{
  "course_name": "2nd Summer Introduction to Design",
  "course_description": "Introduce students to the creative design process, based on the scientific method and peer review, by application of fundamental principles and learning to complete projects according to schedule and within budget. Subject relies on active learning through a major team-based design-and-build project focused on the need for a new consumer product identified by each team. Topics to be learned while teams create, design, build, and test their product ideas include formulating strategies, concepts and modules, and estimation, concept selection, machine elements, design for manufacturing, visual thinking, communication, teamwork, and professional responsibilities.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design",
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 2-hour session, 3 1-hour final presentation session\n\nLabs: Variable hours / week for 4 weeks\n\nCourse Objective\n\nThe objective of the course is to enable students through a team-based hands-on product design experience to:\n\nLearn the process of design, based on the scientific method, to combine creative thinking with engineering principles (physics) to turn ideas into robust reality:\n\nIdentify a problem (opportunity!).\n\nUse fundamental principles and appropriate analysis and experiments to select and develop ideas.\n\nGenerate & create strategies for solving the problem.\n\nGenerate & create concepts for implementing the strategy.\n\nBreak the concept into modules and develop the most critical module first.\n\nComplete the detailed design of the modules.\n\nManufacture, test, debug, and modify the design.\n\nDocument the results on a web page and make a professional quality presentation to a group of peers and visiting company representatives.\n\nBecome familiar with the fundamental issues and applications of basic mechanical components and manufacturing and assembly techniques.\n\nLearn how to manage projects to be \"on-time\" and \"on-budget\" and to maintain a high degree of professional ethics.\n\nThis Year's Theme\n\nIn response to student feedback, we have spread 2.971 out over IAP, without increasing the total hours required, and we have also enhanced training in the shops with the inclusion of a short introductory project that each student will complete, and thereby be primed for this year's theme: Games and Puzzles! In addition, teams have generally been formed along the lines of student's technical interests, so the challenge for each team is to create an appropriate game or puzzle. The game or puzzle can be any combination of mechanical, electrical, or software elements. It just must be realistically completable within the time frame of the course!\n\nEach team has a TOTAL budget of $250 for your project. FOOD will not be reimbursed.\n\nSolid Modeling and Best Model Contest\n\nEach student is expected to download SolidWorks? or Pro/ENGINEER? from the MIT web and learn it using the on-line tutorials! The TAs can be very helpful!\n\nGrading\n\nThis is very much an interactive course, and you will increase your chance of passing if you attend group meetings and pull your own weight. This is a very demanding course, but the rewards are very high in terms of not just getting a summer job at a sponsoring companies, but getting real responsibility in your summer job. The design problem solving methods you can learn can furthermore help you in your other classes.\n\nTo pass this course, you need to stay on schedule (carefully read and memorize the schedule attached to the syllabus!) and meet the milestones! If you are in 8.01L or 18.01A, then make sure your teammates know it, and the team should pick a project that is doable for the amount of effort that will be available!\n\nEach student MUST have a design notebook, in which you keep ALL your notes and scribbles. A spiral bound notebook will suffice into which you can also paste printouts from the Internet etc. These notebooks will be EXTREMELY important to bring to your company interviews in the spring!\n\nEach team must create a website, and email the URL to the Instructor by the deadline! Each team must update their website daily (just a summary sheet or two is fine). These summary sheets then become your presentation slides (TWO BIRDS, ONE STONE!!!)\n\nLectures\n\nOnly one lecture for a duration of two hours. Final presentation will be three weeks later for a duration of three hours, followed by the celebration luncheon at the faculty club.\n\nLabs and Safety\n\n2.971 students will be divided into 6 teams, and this year the teams are split in terms of members who receive training in each of the two main shops. Teams are encouraged to create their products from components built in each shop. Teams are required to present their ideas to the shop gurus for reality checks and feedback! All teams have access to the Edgerton Lab for electronics help. Of course students will be directed to whatever shop has the appropriate tools for the task!\n\nYou MUST wear safety goggles or safety glasses (polycarbonate eyeglasses are fine) and closed-toed shoes at ALL times in the shops.\n\nMandatory shop training, where you learn safety and machine operation by building a small project, will occur in each of the shops on 4 days (you must attend all 4 days!) for 3 hours for those in the Edgerton Shop. For those in the Hobby Shop, there are two groups, which meet for 2 hours on either two consecutive Wednesdays or Fridays. Please see the following table for your assignment below:\n\nQuizzes\n\nThere are no formal quizzes.\n\nText Book\n\nThere is no textbook for the course; however, course notes are provided for you to review, which will help you become familiar with design process and fundamental principles. READ THEM the first week of class!\n\nDesign Notebooks\n\nAn engineer should keep a detailed bound notebook for invention date establishment. No scrap paper! Each student is responsible for getting a design notebook (spiral notebook is sufficient for the purposes of this course). Each student MUST carry their design notebooks with them, and put all scribblings in it etc...IT IS YOUR CREATION DIARY, and you will be asked to show it at your interview!\n\nMilestone Reports/Final Presentation\n\nEach team will make a final PowerPoint presentation to the class and visitors, followed by a celebration luncheon in the faculty club. A laptop projector will be available as well as a video player if needed. The presentation will have the following format:\n\nSlide 1: Team name, student members (individual or group picture with everyone's names so someone can tell who is who!) and TAs AND define the theme area for your team (e.g., a sports device) (\nMilestone 1\n)\n\nSlide 2: Describe the problem you set out to solve (show the different product strategies considered) (e.g., baseball, football) (\nMilestone 2\n)\n\nSlide 3: Show results of Rohrbach (Peer Review Evaluation Process [PREP]) and brainstorming process, and your top selected strategy (the product area, e.g., baseball) (\nMilestone 2\n)\n\nSlide 4: Show results of Rohrbach (PREP) and brainstorming process, and your top one or two concepts (the hardware ideas, e.g., pitching, or batting machine). Ideally, each person has created a solid model of their own favorite concept, and the slide shows each persons' solid model, as well as the final solid model of the best evolved concept (\nMilestone 3\n)\n\nSlide 5: Show experiments or other things you did to help select the \"best concept\" (e.g., we are developing a human powered pitching machine) (\nMilestone 4\n)\n\nSlide 6: Show the final concept (solid model and sketch model) (\nMilestone 5\n)\n\nSlide 7: Show the development of the concept (analysis, sketches, models, machining the parts etc) (\nMilestone 6\n)\n\nSlide 8: Show the finished product! (\nMilestone 7\n)\n\nSlide 9: Show the testing of the product (\nMilestone 8\n)\n\nSlide 10: Results (how well it worked? Cost-to-produce estimate) (\nMilestone 8\n)\n\nSlide 11: Conclusions: Is this product worth developing for the mass market? Anything else? (\nMilestone 8\n)\n\nIn order to pass the course, each team MUST hand the Instructor a CD or zip drive with their presentation!\n\nAs mentioned above, your summary sheets describing how you met your milestones can be used to form the basis of your presentations!\n\nBring the draft versions of these slides to your meetings with the Instructor! We will resolve any open issues at the meeting so that by the end of the day the milestone (and its summary slide which is also part of your presentation) is DONE and posted on the team website.\n\nThe presentation will thus write itself!",
  "files": [
    {
      "category": "Resource",
      "title": "Design is a ? Passionate ? Process",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-971-2nd-summer-introduction-to-design-january-iap-2003/a2924aa584c786ecfb85f99dfd8f03a1_design_process.pdf",
      "content": "1/16/2002\n(c) 2000 Alexander Slocum\n1-1\nTopic 1\nDesign is a ??Passionate ?? Process\nTopics:\n-\nPassion\n-\nDeterministic design\n-\nSystematic Organization of Ideas\n-\nDesign Process\n-\nMilestones\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-2\nDesign Contest: The MIT and the Pendulum!\n-\n\"Rules\":\n-\nOnly use materials in the kit and plus fasteners and adhesives\n-\nMachine must fit into starting zone (0.5 m cube) at the base of each pendulum\n- You can start with your machine engaged (wheels preloaded) to a pendulum\n-\n\"Score\" is evaluated at the end of 45 second contest:\n-\nYou may not damage the table or willfully damage your opponent\n- No nets or entanglement devices\n-\nWhat would you do?\n-\nHow would you go about designing and building a machine to participate?\n-\nHow would you balance your effort with all the other obligations you have?\n(\n)(\n)\n_\n_\n_\ntan\n_\n_\n_\n_\n_\n_\n_\n_\n_\n_\n_\n_\nTotal\npendulum\nangular\ndis\nce\ntraveled\nin radians\ntotal\nmass\nin\ngrams\nof\nstreet\nhockey\nballs\nand\npucks\nScore\nm\nθ\n=\n+\n+\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-3\n??Passion\nPassion?? LOVE to Create\nLOVE to Create\n\"Enthusiasm is one of the most powerful engines of success. When you do a\nthing, do it with all your might. Put your whole soul into it. Stamp it with\nyour own personality. Be active, be energetic, be enthusiastic and faithful and\nyou will accomplish your object. Nothing great was ever achieved without\nenthusiasm\"\nRalph Waldo Emerson\n-\nUse ??Passion\nPassion?? as a catalyst to make ideas\nbecome reality:\n-\nNever stop asking:\n- \"Is this really the best I can do\"\n- \"Can the design be made simpler\"\n-\nCreate, never stagnate\n- Do you see machines in ink blots?\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-4\n\"You can't always get what you want\nBut if you try sometimes well you might find\nYou get what you need\"\nMick Jagger & Keith Richards 1969\nhttp://lyrics.all-lyrics.net/r/rollingstones/letitbleed.txt\nGet a clear notion of what you desire to accomplish, then you will probably get it\nKeep a sharp look-out upon your materials: get rid of every pound of material you\ncan do without. Put yourself to the question, 'What business has it there?'\nAvoid complexities and make everything as simple as possible\nRemember the get-ability of parts\nHenry Maudslay (1700's, the father of modern machine tools)\n??Passion\nPassion?? FOCUS!\nFOCUS!\nKeep Your Eye on the Prize\nKeep Your Eye on the Prize\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-5\n-\nBefore we can talk about a process for design, we must consider the things the\nbest designers do as they solve problems\n-\nBest Engineering Practice entails careful forethought and following standards\n- 62.5 grams of prevention is worth a kilogram of cure!\n- \"Random Results are the Result of Random Procedures\" Geoffe Portes\n-\nPrevent problems before they occur:\n- Does not meet customer needs\n- Prevention:\n» Identify the Functional Requirements (FR)\n» Develop a Design Parameter that accomplishes each FR\n- Failure\n- Prevention: Design to withstand external and internal loads\n- Poor performance\n- Prevention: Design to be robust to tolerances and errors\n- Cost too much\n- Prevention: Create clever, frugal, manufacturable designs\n-\nDeterministic Design is a key element of Best Engineering Practice\n-\nIt is a means to systematically solve even the most complex problems in a rational, logical\nmanner, while still allowing you to have wild crazy creative zoombah illiminational thoughts!\n??Passion\nPassion?? Best Engineering Practice\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-6\n??Passion\nPassion?? Play, Sketch, Model, Detail, Build & Test\n-\nEngineering is often a tactile, visual, verbal, cerebral, and physical activity:\n-\nPlay with the table and the kit parts\n-\nSketch ideas\n-\nCreate physical and analytical models to identify opportunities and test possible\nstrategies\n-\nDetail the machine using all the engineering skills and tools at your disposal\n-\nBuild & test your machine!\n-\nStudents who follow best engineering practice create very impressive\nmachines with just the correct amount of effort (and have time for a life!)\nAlexSprunt's machine was almost exactly like the solid model, and it worked \"out of the box\"!\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-7\nDeterministic Design\n-\nEverything has a cost, and everything performs (to at least some degree)\n-\nIf you spend all your time on a single tree, you will have no time for the forest\n-\nIf you do not pay attention to the trees, soon you will have no forest!\n-\nYou have to pay attention to the overall system and to the details\n-\nSuccessful projects keep a close watch on budgets (time, money, performance)\n-\nDo not spend a lot of effort (money) to get a small increase in performance\n- \"Bleeding edge\" designs can drain you!\n-\nDo not be shy about taking all the performance you can get for the same cost!\n-\nStay nimble (modular!) and be ready to switch technology streams\n-\nIt is at the intersection of the streams that things often get exciting!\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-8\n-\nHow would you create a contest where the overall goals are:\n-\nThe inertia of the machines is on the order of the inertia of the system\n-\nThe system is SIMPLE to build and solid model (for the staff and the students!)\n-\nThe contest can have MANY different possible winning strategies\n- Engineering analysis can tip the scales in a student's favor!\n-\nThe answer is to:\n- Envision potential strategies\n- A strategy is an approach to solving a problem, but it does not include\nmechanism detail\n- Consider the feasibility of strategies in terms of physics, resources required,\nand resources available (available materials, equipment, time...)\n- Select one or two strategies for further development which define the detailed\nmechanism....\n- Concepts, Modules, Components\n- Follow a process whose pattern of development repeats at each level of detail\n-\nWhat better way to design a robot for a contest than to understand and use the\nprocess used to design the contest?!\n-\nTry to reverse engineer the contest, including building and taking apart a model\n(CAD solid model or a physical model) of the table and recreating the analysis that\nlikely went into its design\nDeterministic Design: Reverse Engineering\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-9\nDeterministic Design: Disruptive Technologies\n-\nAnalysis is the lens which brings a problem into\nfocus and lets you clearly see the best return on\nyour investment\n-\nValue analysis of scoring methods\n-\nPhysics of scoring methods\n-\nRisk analysis\n-\nSchedule analysis\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-8\n-\nHow would you create a contest where the overall goals are:\n-\nThe inertia of the machines is on the order of the inertia of the system\n-\nThe system is SIMPLE to build and solid model (for the staff and the students!)\n-\nThe contest can have MANY different possible winning strategies\n- Engineering analysis can tip the scales in a student's favor!\n-\nThe answer is to:\n- Envision potential strategies\n- A strategy is an approach to solving a problem, but it does not include\nmechanism detail\n- Consider the feasibility of strategies in terms of physics, resources required,\nand resources available (available materials, equipment, time...)\n- Select one or two strategies for further development which define the detailed\nmechanism....\n- Concepts, Modules, Components\n- Follow a process whose pattern of development repeats at each level of detail\n-\nWhat better way to design a robot for a contest than to understand and use the\nprocess used to design the contest?!\n-\nTry to reverse engineer the contest, including building and taking apart a model\n(CAD solid model or a physical model) of the table and recreating the analysis that\nlikely went into its design\nDeterministic Design: Reverse Engineering\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-11\nDeterministic Design: Schedules\n-\nTime is relative, but you will soon run out of it if you keep missing deadlines!\n-\nNo matter how good your ideas are, their value decays exponentially with every day\nthey are late\n- Once a customer starts buying a product, if the manufacturer maintains diligence,\nyou will find it extremely difficult to regain market share\n-\nThe process of getting a product to market involves phases\n-\nIdentify & study problem, develop solution strategies and evolve \"best one\"\n-\nCreate concepts and evolve \"best one\"\n-\nCreate modules\n-\nDetail design, build, & test the modules starting with the most risky\n-\nAssembly integration, test, and modify as needed\n-\nDocument and ship\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-12\nDeterministic Design: Risk Management\n-\nThe key to deterministic design is risk management\n-\nFor every idea, risk must be assessed\n-\nAsk yourself which ideas and analysis (physics) are you most unsure of?\n- Which element, if defined or designed wrong, will neutralize the machine?\n-\nFor every risk identified\n- Estimate the probability of occurrence (High, Medium, Low)\n- Identify a possible countermeasure\n-\nPrioritize your risk and continue to do analytical, computational, or physical Bench\nLevel Experiments (BLEs) to test ideas before you move forward!\n-\nGood Engineering Practice continually applies!\n- Prayer is for your personal life!\n- Determinism is for design!\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-13\nDeterministic Design: Analytical Instinct\n-\nTRUST your analytical & deterministic training\n-\nSeek to create and then defeat ideas by exploring ALL possible alternatives\n- In a Mr. SpockTM - Commander DataTM-like manner, logically seek to\nestablish the need, understand the problem, create many concepts, subjectively\nevaluate ideas, analyze the bajeebees out of the idea.\n-\nThis is the careful execution of the Design Process\n-\nThis is what the best designers do to turn dreams into realities\n-\n& LISTEN to your instincts\n-\nBe wild, random, and impulsive, and take great ideas that your bio-neural-net\nproduces and keep evolving and hammering it until it yields an invention!\n- Sketch the first thoughts that come to mind when you encounter a problem!\n-\nThis is the Captain KirkTM, shoot from the hip, John Wayne approach.\n-\nThis is the element of passion that is the essence of great design!\n-\nThis is what drove Mozart, Edison, Einstein, Elvis....the great creators!\n-\nCombine analysis & instinct to become a successful passionate design\nengineer!\n-\nLearn from experience how much of each to use!\n- Tim Zue's tracked vehicle won, because he used sandpaper to increase the\nfriction on his starting platform!\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-14\nSystematic Organization of Ideas\nIdeas or plan to\nmitigate each\nrisk, including\nuse of off-the-\nshelf known\nsolutions\nHigh,\nMedium, Low\n(explain why)\nrisk of\ndevelopment\nassessment for\neach DP\nAnything that\ncan help\ndevelop the idea\nincluding\npersonal\ncontacts,\narticles, patents,\nweb sites....\nEconomic (financial\nor maximizing score\netc), time & motion,\npower, stress...\nEACH DP's\nFEASABILITY\nMUST BE\nPROVEN.\nAnalysis can be\nused to create DPs!\nIdeally\nindependent\nmeans to\naccomplish each\nFR. AN FR CAN\nHAVE\nSEVERAL\nPOTENTIAL\nDPs. The \"best\none\" ultimately\nmust be selected\nA list of\nindependent\nfunctions that\nthe design is to\naccomplish.\nSeries (1,2,3...)\nand Parallel (4a,\n4b..) FRs\n(Events) can be\nlisted to create\nthe Function\nStructure\nCounter-\nmeasures\nWords,\nDrawings,\nAnalysis...\nRisk\nWords,\nDrawings,\nAnalysis...\nReferences\nHistorical\ndocuments,\nwww...\nAnalysis\nExperiments,\nWords, FEA,\nEquations,\nSpreadsheets...\nDesign\nParameters\n(Idea)\nWords &\nDrawings\nFunctional\nRequirements\n(Events)\nWords\n- To actually use the FRDPARRC Table:\n- Create one actual table that becomes your development roadmap\n- Dedicate one sheet to each FR/DP pair\n- This can become your Milestone Report (\"Press Release\") for an idea (DP)\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-15\nFRDPARRC Sheet Topic: Precision Low Cost Linear Motion Stage\nFunctional Requirement (Event) Preload air bearings\nDesign Parameter (description of idea) Preload air bearings using magnetic attractive force of motor, so air bearings need only ride on two\nsurfaces instead of having to wrap around a beam; thus many precision tolerances to establish bearing gap can be eliminated\nSketch:\nAnalysis (physics in words) The magnet attraction force is 5x greater than the motor force, so it can be positioned at an angle such that even\npreload is applied to all the bearings. As long as the magnet attraction net vertical and horizontal force are proportional to the bearing areas\nand is applied through the effective centers of the bearings, they will be evenly loaded without any applied moments.\nAnalysis\nReferences: Vee & Flat bearings used on many common machine tools where gravityprovides preload. NEAT uses two magnet tracks, one\nhorizontal and one vertical, to provide horizontal and vertical preload force. Patent search revealed no other relevant art.\nRisks: The magnet pitch may cause the carriage to pitch as the motor's iron core windings pass over the magnets\nCountermeasures: Add steel out of phase with motor core position, or if the error is repeatable, map it and compensate for it in other axes\ntan\narctan\nV\nV\nH\nH\nV\nH\nF\nA\nF\nA\nA\nA\nθ\nθ\n=\n=\n\n=\n\nsin\ncos\nV\nmagnets\nH\nmagnets\nF\nF\nF\nF\nθ\nθ\n=\n=\nMotor core\nCarriage\nBearing rail\nAir bearing pad\nMagnet track\nFRDPARRC Example: A Precision Linear Motion System\nAssume we want even preload pressure per pad\nMotor preload angle\n26.57\nMotor attraction force, Fm\nMotor width (mm), L\nMotor thickness\nSpace for motor thickness\nSupply pressure, Ps (Pa, atm)\nbearing efficiency, m\n0.35\npreload proportion of total load capacity, f\n0.5\nvertical/horizontal load capacity, vh\nX direction pads' total area (mm^2), Ax\nY direction pads total area, (mm^2) Ay\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-16\nDesign Process\n-\nFollow a design process to develop an idea in steps fromcoarse to fine:\n-\nFirst Step: Evaluate the resources that are available\n-\nSecond Step: Carefully study the problem and make sure you have a clear understanding of what\nneeds to be done and what are the constraints (rules, limits)\n-\nSteps 1 & 2 are often interchangeable\n-\nThird Step: Start by creating possible strategies using words, analysis, and simple diagrams\n-\nImagine possible motions, data flows, and energy flows from start to finish or from finish back\nto start!\n-\nContinually ask \"Who?\", \"What?\", \"Why?\", \"Where\", \"How?\"\n-\nSimple exploratory analysis and experiments can be most enlightening!\n-\nWhatever you think of, others will too, so think about how to defeat that about which you think!\n-\nFourth Step: Create concepts to implement the best strategies, using words, analysis, and sketches\n-\nUse same methods as for strategies, but now start to sketch ideas\n-\nOften simple experiments or analysis are done to investigate effectiveness or feasibility\n-\nSelect and detail the best concept...\n-\nFifth Step: Develop modules, using words, analysis, sketches, and solid models\n-\nSixth step: Develop components, using words, detailed analysis, sketches, and solid models\n-\nSeventh Step: Detailed engineering & manufacturing review\n-\nEighth Step: Detailed drawings\n-\nNinth Step: Build, test, modify...\n-\nTenth Step: Fully document process and create service manuals...\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-17\nFirst Step: Resource Assessment\n-\nBefore even thinking about potential solutions to a problem, one has to first take stock\nof the available resources:\n-\nWhat time is available?\n-\nWhen is the project due?\n-\nHow many person-hours a week can be spent on the project?\n-\nWhat are the hours of operation for support facilities (library, shop, computers...)\n-\nDesigner engineers are often way too ambitious!\n-\nWhat materials and components are available?\n-\nLay out all the materials you have (physically or catalogs) in front of you and play with\nthem, let them talk to you, what are their limits, how have others used them...\n-\nLook through hardware magazines\n-\nCheck the Web: http://pergatory.mit.edu/2.007 , http://www.efunda.com/home.cfm\n-\nLook at other machines\n-\nKnowing your hardware is a POWERFUL design catalyst\n-\nWhat manufacturing processes are available?\n-\nYou may not have access to a wire EDM, nor the time to send out the parts!\n-\nYou may not have the time to have a casting made!\n-\nWhat people are available?\n-\nEngineering?\n-\nManufacturing?\n-\nManagement?\n-\nMarketing....?\nΣ\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-18\nSecond Step: Understanding the Problem (Opportunity!)\n-\nAny problem can be dissected and understood by establishing a starting point,\nand then analyzing the system and its elements\n-\nIt is like creating a design in reverse\n-\nStudy a problem and then define it in terms of its energy storage and\ndissipative elements, and its geometry and materials:\n-\nSimple physical models\n- Physically play with the kit and contest table: Let the hardware talk to you....\n- A sketch model made from simple materials enables you to play with the\nproblem\n-\nSimple drawings\n- A simple hand-drawn isometric figure helps you to pattern the problem into\nyour bio neural net\n- A simple solid model can also be very useful, particularly when later seeking\nto test your solid model solution on the problem\n-\nPhysics: First-Order-Analysis\n- Words to describe the physics\n- Simple analysis with guestimates of realistic numbers (spreadsheets)\n-\nWords (in a table or bulleted list) to describe what problem must be solved\n- What must be accomplished? (e.g., tip a balance...functions, events)\n- What are the constraints? (e.g., rules, cost, size, time)\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-19\nThird Step: Developing StrategiesConceptsModulesComponents\n-\nPlaying\n-\nPlay with the contest table and the kit parts\n-\nCreate simple experiments\n-\nDrawing\n-\nSketch all the motions that might occur (use arrows to indicate motions)\n-\nROUGH Sketch potential concepts (just stick figures)\n-\nOverlay sketches and search for patterns and AHAs!\n-\nReading\n-\nStudy past 2.007 contests\n-\nStudy construction equipment, websites of mechanisms and other robot contests....\n-\nWriting\n-\nWrite a story about how the contest was won.....imagine the future!\n-\nThe FRDPARRC Table is a fantastic catalyst\n-\nArithmetic (analysis)\n-\nAnalyze the effectiveness of different scoring methods with a sensitivity study\n-\nCreate time/motion studies of the table\n-\nInvestigate geometric packaging options\n-\nSketch free-body-diagrams to understand how the forces flow within the system\n-\nLoad your mind with information\n-\nlet your bio-neural-net start creating broad overall pictures of what gets the most done with the\nleast effort\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-20\nThird Step Example:\nStrategies for The MIT and the Pendulum!\n?\n?\n1)8.01 text\n2)Past 2.007\ncontests\n3)Ball shooters\nfrom past\ncontests\nReferences\n?\n?\n1)Opponent\nscatters balls\nand pucks\n2) Machine\nbecomes to big,\nopponent blocks\n3) Balls are too\nlarge and heavy\nRisk\n?\n?\n1)Linear motion\n2)Linear motion,\nPower to raise\nthe balls to the\ngoal\n3)Trajectories,\nConservation of\nmomentum\nAnalysis\n?\n1)Scatter pucks\nand balls\n2)Anchor the\npendulum\nBlock opponent\nfrom scoring\n?\n1)Actuate from\nground\n2)Actuate from\npendulum\nScore with\npendulum\n1)Acquisition\ndevice must also\nbe able to pick\nup from the\nground\n2)Gather a few,\nSet up blocking\ngate\n3)Ball on ramp,\npinball shooter\n1)Acquire balls\nand move them\ninto the goal\n2)Collect balls\nand pucks and\ndeposit in goal\n3)Bat them into\nthe goal\nScore with balls\nCounter-\nmeasures\nPossible Design\nParameters\n(Concept's FRs)\nFunctional\nRequirements\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-21\nFourth Step: Developing Concepts\n-\nA concept is a vision of how one could actually accomplish the Strategy:\n-\nWords to describe what the concept must do, and how it will work\n-\nIdeally in simple tabular form, like a FRDPARRC Table\n-\nSimple sketch\n-\nA simple hand-drawn isometric figure often suffices\n-\nA simple solid model can also be very useful\n-\nA sketch model made from simple materials can also be very useful\n-\nFirst-Order-Analysis\n-\nSpreadsheet-based time and motion study\n- More detail based on better estimates of machine size...\n-\nPreliminary power, accuracy, or stress calculations\n- More detail based on better estimates of machine weight...\n-\nThe design engineer needs to take care to propose a concept in just enough detail to be assured\nthat it could indeed be implemented\n-\nExample: Concepts for Gather pucks and balls and deposit in goal Strategy\n-\nConcept A for Strategy 1: Drive around picking up pucks and balls and deposit them into the\ngoal one-by-one, so as to avoid complexity or jamming\n-\nAfter scoring with objects, the vehicle could go and actuate the pendulum\n-\nConcept B for Strategy 1: Gather pucks and balls using a combine-like harvester that collects\nthem and dumps them into a bin, and then drives over and raises the bin and dumps it into the\nscoring goal\n-\nAfter scoring with objects, the vehicle could go and actuate the pendulum\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-22\nFourth Step Example:\nConcepts for the Knock Down Balls Strategy\n?\n?\n8.01 text and\nPast 2.007\ncontests. Farm\nequipment\nwebsites\nReferences\n?\n?\n1)Not enough\ntime to make\nmultiple trips\n2)Gather bin is\ntoo large\nRisk\n?\n?\n1)Time/Motion\nstudy,\nFriction/slip,\nLinkage design\n2)Friction, slip,\nlinkage design\nAnalysis\n?\n1)Molestabot\n2)Pendulum\nclamp\nBlock opponent\n?\n1)Vehicle\nknocks\npendulum as it\ndrives by\n2)Fixed-to-\nground spinning\nactuator\nActuate\npendulum from\nground\n1)Gather 2 or 3\nobjects\n2)Gather 2 or 3\nobjects\n1)Pick up and\nscore one at a\ntime\n2)Harvest lots\nand dump loads\nGather pucks\nand balls and\ndeposit in goal\nCounter-\nmeasures\nPossible Design\nParameters\n(Modules FR's)\nFunctional\nRequirements\n(Distilled from\nStrategy's DPs)\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-23\nFifth Step: Developing Modules\n-\nA module is a subassembly that has a defined envelope and specific inputs and outputs\nthat can be engineered, built, and tested and then assembled with other modules to\nimplement the concept\n-\nPick any module, and you will also get sub- modules\n- Example: Powertrain: Transmission, Motors, Crawler tracks\n- Hence the term \"module\" implies a granularity of detail\n-\nWords to describe what the module must do, and how it will work (FRDPAARC)\n-\nDrawings\n-\nInitially a simple hand-drawn isometric will suffice\n- There may be many different ways of designing the module\n» The process of strategy, concept, module, components can be applied again!\n-\nA solid model (layout drawings) will eventually need to be created\n-\nFirst-Order- and Detailed-Analysis\n-\nMotion, power, accuracy, stress...\n-\nGreater detail as the module detail increases\n-\nDeveloping modules is the first part of what some called the \"embodiment\" phase of design\n-\nExample: Modules for the Harvester Concept\n-\nModule 1 for Concept B: Gatherer\n-\nModule 2 for Concept B: Bin\n-\nModule 3 for Concept B: Deposit mechanism\n-\nModule 4 for Concept B: Vehicle\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-24\nFifth Step Example:\nModules for the Harvester Concept\n?\n?\n?\n1)Street sweepers,\nCombine\nHarvesters\n2)Hungry Hippos\ngame\n3)Crabs\nReferences\n?\n?\n?\n1)Objects jam\n2)Complexity\n3)Complexity\nRisk\n?\n?\n?\n1)Angular\nacceleration\n2)Linkages\n3)Triggers\nAnalysis\n?\n1)Crawler treads\n2)4WD\nVehicle\n?\n1)Comveyor\n2)Raise &\ndump\nDeposit\nmechanism\n?\n1)Passive half-\ncylinder hands\n2)Actuated\nfingers\nBin\n2)Reversible, or\nraise and lower\n2)Single central\narm to make T\n3) Rotary system\n1)Rotary paddles\nor brush\n2)Reciprocating\npaddle\n3)Crab-claws\nHarvest objects\nCounter-\nmeasures\nPossible design\nParameters\n(Components'\nFRs)\nFunctional\nRequirements\n(Distilled from\nConcept's DPs)\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-25\nSixth Step: Developing Components\n-\nModules are made from components, sub-\nassemblies or machine elements:\n-\nWords to describe what the component must do,\nand how it will work\n- Ideally in simple tabular form, like a\nFRDPARRC Table\n-\nDrawings\n- Initially a simple hand-drawn isometric will\nsuffice\n- There may be many different ways of\ndesigning the component\n» The process of strategy, concept,\nmodules, components can be applied\nagain!\n- A solid model (part drawing) will\neventually need to be created\n-\nDetailed engineering analysis\n- Motion, power, accuracy, stress,\ncorrosion...\n-\nThis is the super detailed phase of design\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-26\nSixth Step Example:\nComponents for the Reciprocating Paddle Module\n?\n?\n?\nFreshman\nphysics, Chapter\n4 of this book\nReferences\n?\n?\n?\n1)Too simple\nmotion\n2)Complexity\nRisk\n?\n?\n?\n1)4-bar synthesis\n& force analysis\n2)Trigonometry\n& force analysis\nAnalysis\n?\n1)Screwdriver\nmotor\n2)Piston\nActuator\n?\n1)Nylon\n2)Metal pins\nBearings\n?\n1)Bent sheet\nmetal\n2)Welded truss\nPaddle\n1)Use option 2,\nor a paddle\n2)Make one\nsingle center\nlinkage\n1)Revolute joint\nlinkage\n2)Revolute &\nprismatic linkage\nLinkage\nCounter-\nmeasures\nPossible design\nParameters\nFunctional\nRequirement's\n(Distilled from\nModule's DPs)\nWhat else?...\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-27\nPatterns from the Process: RepeatsRepeatsRepeatsRepeats\n-\nNotice how each Strategy's Functional Requirements will each generate one\nor more Design Parameters (Concepts)...\n-\nNotice how each Concept's Functional Requirements will each generate one or\nmore Design Parameters (Modules)...\n- Notice how each Module's Functional Requirements will each generate one\nor more Design Parameters (Components)...\n-\nExecuting a systematic design process can help you develop a rapid design\nreflex:\n-\nRapidly and effectively solve design problems with a minimum of floundering!\n-\nAs you take more and more trips around the sun, the design process and a\nrapid design reflex becomes hard-wired into your bio-neural-net!\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-28\nWeek 1: Milestone ONE (10 pts)\nResource Assessment\nDeliverables:\nNOTE these deliverables can be completed even though you have yet to meet in your\nlab sections\n-\nObtain locker and kit and check kit for completeness\n-\nPUT YOUR NAME ON YOUR TOOLS AND Critical KIT PARTS (motors!)!\n-\nThere are no free lost motor replacements for lost: you can buy your own replacements at\nHome Depot or from Amazon!\n-\nSign up for your lab section's email list (see syllabus for details)\n-\nReview sample Milestone Reports on the web, so you know what to do in the future (not too\nmuch, not too little)\n-\nCAREFULLY READ AND ASSIMILATE TOPICS 1,2, AND 3!\n-\nCreate a personal website for 2.007 where you can post your milestone summaries\n-\nIf you build a good website as you go, you can get 20 extra bonus points added to your grade!\n-\nA great website that illustrates how you design is an invaluable interviewing tool\n-\nCreate a solid model of the table, post it on your website, and also turn in a hardcopy\n-\nPlay with the table and kit parts, and observe and discuss scoring physics (Strategies)\n-\nCreate a spreadsheet or Matlab script that models the physics and scoring potential at at\nleast one strategy (e.g., a basic time & motion study using freshman physics knowledge)\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-29\nWeek 2: Milestone TWO (10 pts)\nUnderstanding the Contest & Creating Strategies\nDeliverables:\n-\nPlay with the table and kit parts to investigate different scoring ideas (Strategies)\n-\nThis includes making simple sketch models and Bench Level Experiments (BLEs)\n-\nRecord observations, including sketches, pictures of sketch models, and analysis\n-\nDescribe the physics of the contest, including the dominant variables and means by\nwhich you can influence them (1 or 2 pages, be brief)\n-\nDescribe various scoring methods and their physics, including the dominant variables\nand means by which you can influence them (1 or 2 pages, be brief)\n-\nSketch lines of motion (actions) or simple stick figures for different Strategies that\ncome to mind on printouts of your solid model of the contest table.\n-\nDO NOT SKETCH detailed MACHINE CONCEPTS!\n-\nWith your evaluation team, complete a Rohrbach evaluation of each other's Strategies\n-\nComplete \"Modular Right Angle Gearbox\" design and manufacturing exercise, and\ndemonstrate a working right angle gearbox\n-\nTwo such gearboxes allow you to easily create a vehicle\n-\nIf you think a vehicle may be a useful module, go ahead and assemble one and test it as a\nBench level Experiment!\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-30\nWeek 3: Milestone THREE (20 pts)\nDeveloping Strategies & Creating Concepts\nDeliverables:\n-\nEvolve and refine your Strategies with sketches, pictures of sketch models, and analysis,\ninclude:\n-\nLines of motion (actions) or simple stick figures for different strategies on a printout of your solid\nmodel of the contest table. DO NOT SKETCH detailed MACHINE CONCEPTS!\n-\nFRDPARRC Sheet for Strategies to exploit the physics of the scoring methods\n-\nFRDPARRC Sheet for Strategies to defend\n-\nFRDPARRC Sheet for Strategies to attack\n-\nAnalysis to predict your score (time budget, physics, etc)\n-\nBench Level Experiments (make simple machines from kit parts and play with them!)\n-\nCreate a weighted Strategy selection chart to evaluate your ideas\n-\nShow how you combine elements of different Strategies to create \"best overall evolved\nStrategies\"\n-\nBe VERY CAREFUL to analyze risks and countermeasures of each strategy!\n-\nWith your evaluation team, complete a Rohrbach evaluation of each other's Strategies\n-\nPlay with your kit elements and sketch several Concepts that could implement your \"best\"\nStrategy\n-\nThe reality of what you can actually build may be cause for strategy modification!\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-31\nWeek 4: Milestone FOUR (10 pts)\nDeveloping Concepts & Most Critical Module\nDeliverables:\n-\nBased on contemplating Concepts, FINALIZE & LOCK-IN your Strategy from Milestone\nThree:\n-\nPresent the final description of the Strategy in a FRDPARRC Sheet\n-\nEvolve and refine Concepts for your final Strategy, and for the top three Concepts include:\n-\nFRDPARRC Sheet\n-\nBe VERY CAREFUL to analyze risks and countermeasures of each Concept\n-\nAppropriate sketches\n-\nBench Level Experimentation and/or sketch models\n-\nCreate a weighted Concept selection chart to evaluate your ideas\n-\nShow how you combine elements of different Concepts to create a \"best overall evolved Concept\"\n-\nRohrbach evaluation of each other's Concepts\n-\nPlay with your kit elements and identify the most critical Module in your Concept, and sketch\nideas for implementing it using the elements in your kit\n-\nThe reality of what you can actually build may be cause for concept modification!\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-32\nWeek 5: Milestone Five (10 pts)\nDeveloping Modules\nDeliverables:\n-\nBased on contemplating Modules, FINALIZE & LOCK-IN Concept using the\nweighted selection chart from Milestone Four:\n-\nPresent the final description of the Concept in a FRDPARRC Sheet\n-\nSeparate your Concept into Modules:\n-\nCreate a sketch showing how the Modules fit together\n-\nFor each Module, create:\n- FRDPARRC Sheet\n- Be VERY CAREFUL to analyze risks and countermeasures of each Modules\n- Appropriate Sketches\n- Select the best version of each Module using a weighted selection chart\n- Show how you combine elements of different Modules to create \"best overall\nModules\"\n-\nStart development of the Most Critical (risky) Module\n-\nPerform Bench Level Experiments to help start developing the Most Critical Module\n-\nRohrbach evaluation of each other's Concepts and Most Critical (risky) Module\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-33\nWeek 6: Milestone Six (10 pts)\nDeveloping the Most Critical Module (MCM)\nDeliverables:\n-\nFINALIZE & LOCK IN Most Critical Module from Milestone Five:\n-\nPresent the final description of the most critical Module in a FRDPARRC Sheet\n-\nBe VERY CAREFUL to analyze risks and countermeasures\n-\nProceed with detailed engineering of Components for the Most Critical Module\n-\nFRDPARRC Sheets\n-\nAppropriate analysis (silicon is cheaper than metal!)\n-\nBench Level Experimentation (if analysis too tough for you or teacher, run an experiment!)\n-\nREMEMBER, part of development is creating BLEs (get in the lab and build and experiment\nand try stuff!)\n-\nSketch the idea and identify sensitive design parameters (e.g., dimensions)\n-\nSolid Modeling of Components for the Most Critical Module so you can make its parts\n-\nManufacturing drawings and process plans (know what you need to do before you step up to the\nmachine!\n-\nSolid Modeling of Components\n-\nRohrbach evaluation of each other's Modules\nYour intention should be to build & test the Most Critical Module first,\nso you have a good idea of will your concept work well before spring break\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-34\nWeek 7: Milestone Seven (15 pts)\nTest & Evolve Most Critical Module (MCM)\nDeliverables:\n-\nFinish building and testing your most critical Module\n-\nDetermine what works and what doesn't, and evolve your MCM accordingly\n-\nIf the MCM is a total unsalvageable failure, this will not affect your grade, IF you can\nshow how you plan to fall back to a less risky concept (or strategy)\n- Now is the time to change, or forever hold your peace\n- You only have SIX weeks left, and soon it will be warm and sunny outside!\n-\nFINALIZE & LOCK-IN the remaining Modules:\n-\nPresent the final description of these Modules in FRDPARRC Sheets\n-\nRohrbach evaluations of each other's most critical Modules\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-35\nWeek 8: Milestone EIGHT\nSpring Break: Relax!\nDeliverable:\n-\nCome back Relaxed!\nNOTE: Colin\nwas a 2.007\nwinner!\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-36\nWeek 9: Milestone NINE (15 pts)\nMost Critical Module Complete\nDeliverables:\n-\nFinish building and testing most critical Module\n-\nIt should now be a working module, ready to integrate into the rest of your machine!\n-\nComplete manufacturing drawings and process plans for what you will build next week\n-\nDevelop a manufacturing, assembly, and test schedule for rest of the course\n-\nProceed with detailed engineering of Components for the remaining Modules:\n-\nFRDPARRC Sheets\n-\nUse what you learned in building the MCM to carefully do the risk and countermeasures analysis!\n-\nAppropriate analysis (silicon is cheaper than metal!)\n-\nBench Level Experimentation (if analysis too tough for you or teacher, run an experiment!)\n-\nSketch the idea and identify sensitive design parameters (e.g., dimensions)\n-\nSolid Modeling of Components (you need drawings to machine parts!)\n-\nManufacturing drawings and process plans (know what you need to do before you step up to the\nmachine!\n-\nRohrbach evaluation of each other's drawings and process plans\n-\nRevise schedule for next week\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-37\nWeek 10: Milestone TEN (10 pts)\nDesign, Build, Test\nDeliverables:\n-\nManufacture Components from drawings made last week\n-\nTest Modules from Components made\n-\nEvaluate what did and did not work, and take appropriate action (fix it!)\n-\nProceed with detailed engineering of Components for the remaining Modules:\n-\nFRDPARRC Sheets\n-\nUse what you learned in building the MCM to carefully do the risk and countermeasures analysis!\n-\nAppropriate analysis (silicon is cheaper than metal!)\n-\nBench Level Experimentation (if analysis too tough for you or teacher, run an experiment!)\n-\nSketch the idea and identify sensitive design parameters (e.g., dimensions)\n-\nSolid Modeling of Components (you need drawings to machine parts!)\n-\nManufacturing drawings and process plans (know what you need to do before you step up to the machine!\n-\nRohrbach evaluation of each other's drawings and process plans\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-38\nWeek 11: Milestone ELEVEN (10 pts)\nDesign, Build, Test, & Begin Integration\nDeliverables:\n-\nManufacture Components from drawings made last week\n-\nTest Modules from Components made\n-\nBegin Integration of Modules\n-\nEvaluate what did and did not work, and take appropriate action (fix it!)\n-\nProceed with detailed engineering of Components for the remaining Modules:\n-\nFRDPARRC Sheets\n-\nUse what you learned in building the MCM to carefully do the risk and countermeasures analysis!\n-\nAppropriate analysis (silicon is cheaper than metal!)\n-\nBench Level Experimentation (if analysis too tough for you or teacher, run an experiment!)\n-\nSketch the idea and identify sensitive design parameters (e.g., dimensions)\n-\nSolid Modeling of Components (you need drawings to machine parts!)\n-\nManufacturing drawings and process plans (know what you need to do before you step up to the machine!\n-\nRohrbach evaluation of each other's drawings and process plans\n-\nRevise schedule for next week\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-39\nWeek 12: Milestone TWELVE (20 pts)\nDemonstrate Working Machine\nDeliverables:\n-\nManufacture Components from drawings made last week\n-\nTest Modules from Components made\n-\nEvaluate what did and did not work, and take appropriate action (fix it!)\n-\nAssemble and demonstrate working machine (at least to some degree)\n-\nEvaluate what did and did not work\n-\nComplete manufacturing drawings and process plans for all Components that need to\nbe finished!\n-\nRevise schedule for next week\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-40\nWeek 13: Milestone THIRTEEN (10 pts)\nIn-Class Contest & \"Ship\" Machine\nDeliverables:\n-\nClean up your machine and test, test, test!\n-\nHave a working machine ready to compete in the in-class contest\n-\nYour score will determine your seeding in the final contest\n- High score machines will be matched against low score machines\n-\nEvaluate what did and did not work\n-\n\"Ship\" your machine:\n- Machine is judged for size and weight:\n- Green dot means you can compete and win\n- Red dot means you can compete in first round, but cannot win\n- Machine is boxed in FREM container and put into locked locker\n-\nRecycle unused materials and components\n-\nClean up your 2.007 web site (if you have one!)\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-41\nWeek 14: Milestone FOURTEEN (80 pts)\nFinal Contest (Celebration!)\nDeliverables:\n-\nCheck the website for details\n-\nPick up your machine (and FREM box) from the Lab before 5 PM on the first contest\nday and take it to the Contest Arena\n-\nPlace your machine in your designated section area\n-\nMake sure your batteries are charged and you bring your charger\n-\nYou MUST (please) wear your 2.007 T-Shirt and safety glasses to the contest\n-\nHave FUN!\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test\n\n1/16/2002\n(c) 2000 Alexander Slocum\n1-42\nWeek 15: Milestone FIFTEEN (20 pts)\nDocument the Design\nDeliverables:\n-\nWebsite (if you chose to do one) containing at least:\n-\nWhat you did for each milestone:\n-\nEither this is already done (you did it each week), OR:\n- A clear description of how you evolved your machine\n- FRDPARRC Sheets for final Strategy, Concept, Modules\n- One page summary from each earlier milestone\n-\nPost-contest analysis:\n- What worked and what didn't?\n- What would you have changed if you could do it all over again?\n- How well did you follow the schedule\n- What do you think your grade should be, based on the fact that you grade is based\n100% on how well you met weekly milestones?\nΣ\nΣ\nΣ\nΣ\n!!!\nWWW\nStrategy & Concept\nDetailed Engineering & Development\nIntegration & Test"
    },
    {
      "category": "Resource",
      "title": "Generating and Creating Ideas",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-971-2nd-summer-introduction-to-design-january-iap-2003/a85eca404265bb2967dd5c2538ef3a55_creation_ideas.pdf",
      "content": "Topic 2\nGenerating and Creating Ideas\nTopics\n-\nThought Processes\n-\nExperimentation\n-\nDrawing\n-\nResearch\n-\nWriting\n-\nAnalysis\n-\nEvolving Ideas\n=>\n=>\n=>\n(c) 2000 Alexander Slocum\n2-1\n1/16/2002\n\nThought Processes\n-\nTo help generate and create ideas, thought processes can be used as catalysts\n- Systematic Variation\n- Consider all possibilities\n- Persistent Questioning\n- Continually ask \"Who?\", \"What?\", \"Why?\", \"Where\", \"How?\"\n- Reversal: Forward Steps\n- Start with an idea, and vary it in as many ways as possible to create different\nideas, until each gets to the end goal\n- Also called the method of divergent thought\n- Reversal: Backwards Steps\n- Start with the end goal and work backwards along as many paths as possible\ntill you get to the beginning\n- Nature's Way\n- How would nature solve the problem?\n- Exact Constraints\n- What are the minimum requirements\n(c) 2000 Alexander Slocum\n2-2\n1/16/2002\n\nThought Processes: Systematic Variation\n-\n-\n-\n-\nConsider all possibilities:\nEnergy: How can it be applied, generated, stored?\n- Mechanical: springs, flywheels...\n- Hydraulic: piston, bladder, reservoir, propeller...\n- Electrical: line source, battery, capacitor, magnet, optical...\nMaterial:\n- State: solid, liquid, gas\n- Behavior: rigid, elastic, plastic, viscous...\n- Form: bar, sheet, powder...\nMotions:\n- Type: fixed, linear, rotary\n- Nature: uniform, non-uniform, transient\n- Direction & Magnitude\n-\nControls:\n- Passive\n- Active\n-\nAND all combinations of the above!\n-\nAnalytical models of systems are invaluable\n-\nSensitivity studies can be easily conducted\n(c) 2000 Alexander Slocum\n2-3\n1/16/2002\n\nThought Processes: Reversal\n- Being able to rapidly switch between the methods of Forward Steps and Backward\nSteps is an invaluable skill\n- Example: Given length equalities indicated by the colored pointy end cylinders, prove that the\nyellow cylinder is the perpendicular bisector of the purple and red cylinders?\n- Never be afraid to add your own sketching to a problem that is given you\n- The thin red and blue lines and vertex labels were added!\n- If you do not rapidly see how to move forward, try going backwards!\nAs given:\nA\nB\nC\nD\nE\nF\nAfter user inflicted\nclarifying features:\n(c) 2000 Alexander Slocum\n2-4\n1/16/2002\n\nExperimentation\n-\nPlaying With Parts\n-\nSketch Models\nBench Level Experiments\n-\n-\nBench Level Prototypes\n-\nIdentifying Risky Ideas\nQKC Error in Sensitive Direction\n-2.0\n-1.5\n-1.0\n-0.5\n0.0\n0.5\n1.0\n1.5\n2.0\nTrial #\nδ c , microns\nJL\nJR\nδ\nδ = 0\nδfinal\ninitial\nJL Cap Probe\n2nd Block Fixture\n1st Block Fixture\nBedplate Fixture\nAxial Cap Probe\nCMM Head\nSpherical\nProtrusion\nGroove Seat\nBedplate\nSide Reliefs\nJR Cap Probe\n(c) 2000 Alexander Slocum\n2-5\n1/16/2002\n\nExperimentation: Playing with Parts\n-\nLay out all the materials you have (physically or information sheets) in front of\nyou and play with them, let them talk to you, what are their limits, how have\nothers used them...?\n-\nPlace components amongst each other on the contest table to obtain a physical feel\nfor how they might work and fit.....\n-\nMove the table and feeeeeeel its motions....\n-\nWith a \"competing\" partner \"drive\" imaginary machines with your hands to\nfell how things might move in competition\n-\nMock competitions can help create and evolve strategies\n(c) 2000 Alexander Slocum\n2-6\n1/16/2002\n\nExperimentation: Sketch Models\n- Sketch models are made from simple materials (e.g., cardboard, foam, hot-melt-\nglue, tape, string) and they allow you to literally \"play\" with potential strategies\n- Later, when you have a concept developed, they enable you to \"test drive\" your machine\nconcept around the table\n- In the \"real world\" where designs are often very complex, sketch models are still\noften important \"proof of concept \" aids\n- They can be invaluable sales tools!\n-\nA Sketch-Model-Derby is an invaluable way to test ideas, with minimal risk of\ntime and materials\n-\nEvolution of The MIT and the Pendulum:\n(c) 2000 Alexander Slocum\n2-7\n1/16/2002\n\nExperimenting: Bench Level Experiments\n- Experiments to test function, force, friction, and speed, are a vital part of the\ndesign process\n- Analysis is potentially the quickest way to verify an idea\n- Remember, to be thorough! The first 4 letters of analysis are...\n- Analysis inexperience or uncertainty can lead to analysis paralysis\n- Example:\n-\n-\n-\n=>\n- Analysis paralysis is most often relieved by a simple experiment\nIdea: Use a winch to pull the pendulum back and forth?\npull the pendulum?\nExperiment: Tape a motor to the beam and tie a string around the pendulum\nand see if the motor shaft can wind the string up and pull the pendulum over\nDoes the motor's distance from the pendulum affect how far over it can\n(c) 2000 Alexander Slocum\n2-8\n1/16/2002\n\nExperimenting: Bench Level Prototypes\n- Once you get to the concept phase, you may have a risky idea, which if it works,\nwould be awesome\n-\nABench Level Experiment was performed to prove the principle of an idea, but it is not\na potentially functional part of the machine\n-\nA Bench Level Prototype is designed to ideally be an actual module to test a risky\nconcept\n- Design it well, and if it works, it could be a ready-to-use module for your machine!\n- It often shows what works and what must be fixed in a module (like the software!)\n- A robot contest BLP would be to create a vehicle to test its speed and controllability\n- Use modular components, so you can change them to optimize performance\n- E.g., change the gear ratio on a vehicle's drive train\n(c) 2000 Alexander Slocum\n2-9\n1/16/2002\nOops! Software crashed it again!\nProgrammers are not that innocent!\n\nDrawings\n-\nMotion & Force Diagrams\n-\nSketches & Mock Battles\n-\nSolid Models\n(c) 2000 Alexander Slocum\n2-10\n1/16/2002\n\nDrawing: Motion & Force Diagrams\n- It is important to sketch the idea of a strategy without including any\nmechanical detail:\n- Just use arrows to indicate directions of motions\n- Illustrating the motion with mechanism implies a concept\n- Use different colors!\n- You do not want to start implying specific concepts because this could lead you to\nspend time developing it before you explore enough strategies\n- Time is precious\n- For an illustrative reference, read If You Give a Mouse a Cookie\n2000's Sojourner This!\n2002's The MIT and the Pendulum\n2001's Tiltilator!\n(c) 2000 Alexander Slocum\n2-11\n1/16/2002\n\nDrawing: Sketches\n- Strategies are sketched with simple arrows to indicate motions\n- Concepts are sketched showing overall design intent via possible\nmechanisms and blocks representing modules\n- Modules are sketched showing basic types of components\n- Subassemblies and components capture detail and design intent\n-\nPit your sketches against each other in mock competitions!\n-\nGood sketches and a not so good sketch:\n- Try to sketch in 3D!\n(c) 2000 Alexander Slocum\n2-12\n1/16/2002\n\nmachine....\nDrawing: Solid Models\n- Creating a solid model of the environment (Contest table!)\nhelps you build a solid model of your machine, to make sure it\nwill fit!\n- A solid model of the environment lets you make measurements\noutside of the lab, to make sure your mechanism will fit\n- A solid model of a concept starts with simple parametric\nshapes, that will essentially define volumes into which\nmodules must fit\n- Detail is added as the design progresses\n- Analysis of a solid model can serve as a Bench Level\nExperiment, to illuminate problems and help guide sensitivity\nstudies\nFelix Lam's\n(c) 2000 Alexander Slocum\n2-13\n1/16/2002\n\nResearch\n-\nPast contests\n-\nThe Internet\n-\nPatent searches\nUS Patent 4,637,738\n(c) 2000 Alexander Slocum\n2-14\n1/16/2002\n\nWriting\n-\nPutting it in your own words....\n-\nLists and Tables\n-\nNarratives\n-\nPoems, raps, ballads...\n(c) 2000 Alexander Slocum\n2-15\n1/16/2002\n\nVelocity\nAnalysis\n-\nAppropriate Analysis\n-\nScoring Sensitivity\n-\nTime & Motion\n-\nPower & Strength\nTime\nt a\nt d\nt c\naa\nB\nbb\nExtended:\nRetracted: Pc\naaa\nbbb\nβ\nα\nA\nγ\nφ\nξ\nζ\nL\nPe\nFmax\n(c) 2000 Alexander Slocum\n2-16\n1/16/2002\n\nAnalysis: Scoring Sensitivity\n-\n- Pendulum?\n- Hockey pucks?\n- Balls?\n-\n- Ball and puck weight\n- Pendulum travel?\n-\n?\n\nWhat variables affect the score?\n?\n?\nθ\nd\nWhat gives the greates score for the least effort:\n- Answer these questions by writing the equations, and then investigating which\nare the most sensitive parameters\n- Ask yourself: How can I affect each of these parameters?\n- Physics is an AWESOME catalyst to help your brain generate ideas\n- Analysis is an awesome lens for focusing effort!\nScore = (θ Total _ pendulum _ angular _ dis tan ce _ traveled _ in _ radians +1)(mtotal _ mass _ in _ grams _ of _ street _ hockey _ balls _ and _ pucks +100)\n(c) 2000 Alexander Slocum\n2-17\n1/16/2002\n\nAnalysis: Appropriate Analysis\n- Appropriate Analysis is a CRITICAL part of defining a problem's bounds and\ngenerating creative concepts!\n-\nIf\n\nF = ma will answer the question, do NOT bother with relativity!\n-\nSpreadsheets, MATLAB, FEA....use whatever works best for you to yield an\ninformative and insightful answer in the least amount of time\n-\nRemember to use analysis to design experiments, and experiments to answer questions\nwhen analysis is too difficult\n- If you spend your time pushing on a rope, you will buckle from the strain!\n-\n\"Back-of-the-envelope\" calculations are a critical part of the early conceptual design phase!\n-\nKinematic constraints\n-\nBeam stresses\n-\nPower required\n-\nTractive force\n-\nTipping angle\n-\n...\n-\nToo many designers put-off analysis until its too late, and they are stuck trying to detail a\ndesign that fundamentally draws vacuum (S%$KS!)\n(c) 2000 Alexander Slocum\n2-18\n1/16/2002\n\nAnalysis: Geometry, Time, & Motion\n-\nThe contest only lasts for N seconds, so do you have the time (and the power!)\nto do what is needed?\n-\nVelocity\n1/16/2002\n(c) 2000 Alexander Slocum\n-\nTime\nt a\nt d\nt c\nD = amax\ntc\n+ amtc\n2tc\n+ amax\ntc\namax = 9D\n2tc\n2 , maximum acceleration (m/ s2\n2)\nvmax = 3D\n2tc\n, maximum velocity (m/ s\nA simple spreadsheet can help answer these questions\n2-19\nMaximum motor power is generated at 1⁄2 the motor's no-load speed!\nor rad/ s\nor rad/s)\n\nAnalysis: Energy, Momentum, & Strength\n-\n1st check for the feasibility of a design: Is available Poweravailable > Powerrequired?\n- Example: Can I raise the pendulum through a 30 degree arc in 1 second using energy\nstored in constant force springs?\n- mgh < FLextension\n-\n2nd check for the feasibility of a design: Is σyeild > applied stress?\n- Example: Can I hold M kg extended out L m on a telescoping truss with H m cross section\nmade from D mm welding rod?\nσ = ( MgL )⎛\n⎜\nπ D\n2H ⎞\n⎟\n⎠\n⎝\n-\nphysical requirements of the scoring methods...\nIt is a good idea to be aware of the physical capabilities of the kit materials, and the\n(c) 2000 Alexander Slocum\n2-20\n1/16/2002\n\n-\nIndividual Thought\n-\nRohrbach's 635 Method\n-\nBrainstorming\n-\n(c) 2000 Alexander Slocum\nEvolving Systems\nDesign Comparison Methods\n1/16/2002\n2-21\n\nEvolving Systems: Individual Thought\n- Individual thought is often the most creative\n- Do leisurely things (e.g., long walks) that you know inspire creative thought.\n- Look at what other people have created\n- Look in your home, stores, www, patents\n- Get out of traffic and take alternate routes\n- Sketch ideas and the ideas' principal components\n- Cut out the principal components and pretend they are modular elements\n- Like toy building blocks, try different combinations of components to make\ndifferent products\n- Pit one idea against another and imagine strategies for winning\n- Take the best from different ideas and evolve them into the best 2 or 3 ideas\n- Update the FRDPARRC table and create a Milestone Report or Press Release\nfor your favorite ideas\n- The FRDPARCC Table (ONE DP per FR) and a large annotated sketch makes an\neffective infomercial\n- A random person should be able to read your press release and fully\nunderstand your idea without your having to explain it to them\n- These sheets will be shared with your teammates in the next stage...\n(c) 2000 Alexander Slocum\n2-22\n1/16/2002\n\nEvolving Systems: Rohrbach's 635 Method\n- Six (N) people circulate their Milestone Reports or Press Releases to the other five (N\n1) for comments\n- A written record is thus also made of who first had the idea, so personality conflicts are more\neasily avoided\n- NO TALKING: people make written constructive comments on each other's papers, until\neveryone has read everyone else's press releases\n- This creates a collective mind, so everybody knows what everyone else has been\nthinking\n-\n- Very useful for developing strategies, concepts, & modules\nWhy are these people\nmissing an ear?!\nThe group mind then works together in a more efficient manner when brainstorming...\n(c) 2000 Alexander Slocum\n2-23\n1/16/2002\n\nEvolving Systems:Group Brainstorming\n- Brainstorming helps teams solve personal creativity deadlocks and help to\nensure something hasn't been overlooked\n- Initially let everyone voice their suggestions, then distill ideas\n- Group personality factors must be considered:\n- Shy individuals getting run over\n- Aggressive individuals always driving\n- An individual's personality often has nothing to do with creativity\n- Careful to avoid conflicts over the issue of who first thought of the idea\n- The people in the group must be willing to take praise or scolding as a group\n- NO pure negatives, only observations with suggestions for improvement:\n- \"That design sucks!\"\n- \"I see a low pressure region that can be alleviated by making it blue\"\n(c) 2000 Alexander Slocum\n2-24\n1/16/2002\n\nEvolving Systems: Design Comparison Methods\n-\nThere are many systematic methods available for evaluating design alternatives\n- The simplest method is a linear weighting scheme:\n- You may want to use the list of FRs as the evaluation parameters\n- Apply a relative importance weight to each evaluation parameter\n- Pick one design as a \"baseline\" (all zeros), and compare the rest (+ or -)\n- Easiest to use provided user bias can be minimized\n- When you find the \"best\" design, look at other designs that have higher weights and see\nhow those characteristics can be transferred to the \"best\" design to make it even better!\n- A \"Pugh\" chart is similar, except that it does NOT use the weighting column!\n- A linear weighting scheme (a series of +, -, 0 wrt a baseline design) will give equal\nweighting to attributes\n(c) 2000 Alexander Slocum\n2-25\n1/16/2002\n\nEvolution: It Never Stops\n- Physically experimenting with the hardware while thinking about all possible\nvariations can produce many creative ideas\n- Sketching, drawing, and solid modeling are powerful creativity catalysts\n- Much has been done by others: Learn from others' failures and successes\n- Writing down your thoughts and dreams can help you to see solutions\n- Analysis can identify areas of high (low) sensitivity and rapidl y ascertain feasibility\n- Ideas can evolve rapidly when they are compared to others\n- Do Not Stop!\n=>\n=> ?\n(c) 2000 Alexander Slocum\n2-26\n1/16/2002"
    },
    {
      "category": "Resource",
      "title": "Second Summer Program Presentation Outline",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-971-2nd-summer-introduction-to-design-january-iap-2003/1e1b597d6afaae83b6245df09bd8b2fb_presentation_requirements.pdf",
      "content": "Second Summer Program\nPresentation Outline\nPresentation\nWho is your audience? Consumers and the people for whom you want to work this\nsummer. This is your chance to really impress them!\nRemember, you only have 20 MINUTES to present your idea, so be organized and\nconcise. For example:\nMilestone reports/Final Presentation\nEach team will make a final PowerPoint presentation to the class and visitors, followed by a celebration\nluncheon in the faculty club. A laptop projector will be available as well as a video player if needed. The\npresentation will have the following format:\n- Slide 1: Team name, student members (individual or group picture with\neveryone's names so someone can tell who is who!) and TAs AND define the\ntheme area for your team (e.g., a sports device) (Milestone 1)\n- Slide 2: Describe the problem you set out to solve (show the different product\nstrategies considered) (e.g., baseball, football) (Milestone 2)\n- Slide 3: Show results of Rohrbach and brainstorming process, and your top\nselected strategy (the product area, e.g., baseball) (Milestone 2)\n- Slide 4: Show results of Rohrbach and brainstorming process, and your top one\nor two concepts (the hardware ideas, e.g., pitching, or batting machine). Ideally,\neach person has created a solid model of their own favorite concept, and the slide\nshows each persons' solid model, as well as the final solid model of the best\nevolved concept (Milestone 3)\n- Slide 5: Show experiments or other things you did to help select the \"best\nconcept\" (e.g., we are developing a human powered pitching machine)\n(Milestone 4)\n-\nSlide 6: Show the final concept (solid model and sketch model) (Milestone 5)\n- Slide 7: Show the development of the concept (analysis, sketches, models,\nmachining the parts etc) (Milestone 6)\n-\nSlide 8: Show the finished product! (Milestone 7)\n-\nSlide 9: Show the testing of the product (Milestone 8)\n-\nSlide 10: Results (how well it worked? Cost-to-produce estimate) (Milestone 8)\n- Slide 11: Conclusions: Is this product worth developing for the mass market?\nAnything else? (Milestone 8)\nYour presentation doesn't have to go exactly like this, but should have most of these\nideas:\n\nA. Team/Product Intro.\n- Group members and product.\n- What were your original ideas and concepts?\n- What problem(s) does it solve? What products does it replace/compete with?\n- Market Research: Who wants to buy it?\nB. How did you pick your final design? (design process is important)\n- Functional Criteria: What does it have to do?\n- Which criteria were important (Perhaps show how you weighed and graded them?)\nC. Prototypes (how did they evolve?)\n- Did you identify any major problems with your design.\nD. What was your final product?\n- What are its features?\n- Why is it better?\n- What will you make it out of?\n- Were there any variations or spin-offs (similar ideas)?\n- Price: What are similar items priced at in a store? Do you think you can compete?\n- If you still have problems, how are you gonna fix them?\nE. What next with your product?\nYou may add things you think are important, but remember you only have 20 minutes!"
    }
  ]
}