{
  "course_name": "Abnormal Language",
  "course_description": "Introduction to the linguistic study of language pathology, concentrating on experimental approaches and theoretical explanations. Discussion of Specific Language Impairment, autism, Down syndrome, Williams syndrome, normal aging, Parkinson’s disease, Alzheimer’s disease, hemispherectomy and aphasia. Focuses on the comparison of linguistic abilities among these syndromes, while drawing clear comparisons with first and second language acquisition. Topics include the lexicon, morphology, syntax, semantics and pragmatics. Relates the lost linguistic abilities in these syndromes to properties of the brain.",
  "topics": [
    "Health and Medicine",
    "Speech Pathology",
    "Humanities",
    "Linguistics",
    "Science",
    "Cognitive Science",
    "Health and Medicine",
    "Speech Pathology",
    "Humanities",
    "Linguistics",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nThis course provides an introduction to the linguistic study of\nabnormal language\n, by which we mean nothing more than any system of language that differs from standard adult language for biological reasons, including lack of maturation, difficulties in learning, brain damage, and genetic variation. We include discussion of first language acquisition, second language acquisition, hemispherectomies, working memory disorders, aphasia, autism, Williams syndrome, Down syndrome, Specific Language Impairment, animal communication, and critical periods. Although scientists have always had an interest in abnormal language, a large, serious literature on this topic has only emerged in the last 5 to 10 years. This course will attempt to review much of this recent literature, attempting to provide a deeper understanding of human language in general. Throughout the cognitive neurosciences, a paradigm for learning about how a system works is to explore the ways in which the system can break down. A careful investigation of abnormal language, therefore, offers an excellent opportunity to learn much about normal language, and human cognition and biology in general. In particular, the study of abnormal language bears on central questions within the cognitive sciences, such as the role of innateness versus learning, the reality of specialized cognitive modules, the universality of linguistic features and operations, the role of competence versus performance, and the reality and basis of critical periods. This field further offers great promise in understanding how language is instantiated in the brain. By correlating brain changes with linguistic differences, we come closer to a biological understanding of the neural substrates of language. For each abnormality, the experimental evidence will be reviewed leading to a linguistic profile. We will emphasize the comparison of linguistic abilities across these syndromes. Linguistic theory will be used both to guide the search, as well as to help organize seemingly disparate data. We will show how these language abnormalities can be better understood in light of current linguistic theory, and hopefully, how linguistic theory can be better informed given the data from such abnormalities. Such research is also important for practical purposes, as a detailed study of these abnormalities is a prerequisite for developing clinical applications, as treatment is possible only once the etiology and symptoms are clearly defined.\n\nTarget Audience\n\nThis course is aimed at undergraduates in the cognitive sciences, brain sciences, and linguistics. Graduates students are also welcome and may receive graduate credit. Interested students should have at least some background in linguistics (e.g.\n24.900\n, \"Introduction to Linguistics\"). Those lacking such a background should contact the instructors as soon as possible.\n\nReadings\n\nThere will be two required readings per class, which should be read before class. The exams will cover material present in the readings that is not discussed in class. All readings are posted in the\nreadings\nsection.\n\nAttendance Policy\n\nThis course is unique in that it does not (yet) exist at any other university, nor has a textbook been written that covers all these different areas. As such, we strongly feel that there is no substitute for daily attendance. Therefore, attendance will be worth one letter grade (10%). Students will lose 1% of total class credit for each class missed. Each student, however, will be allowed to miss four classes with no consequences, no excuses needed. A sign-in sheet will be passed around each class in order for us to determine who was present. It is the student's responsibility for signing-in. Of course, any absences due to illness will be excused (simply bring us a note from your doctor) and will\nnot\ncount against the four free absences.\n\nParticipation\n\nFor students on the border between grades, participation will help decide if we round up or down.\n\nExams\n\nBoth exams will be open book. The midterm will take place during regular class time five days after session 10 and will cover all material to that point. The final will take place during finals week and will cover material from the entire course. The exams will cover material in the readings and from the lectures. Note that there will be material in the lectures that is not in the readings. Likewise, there will be material in the readings that is not covered in the lectures. Sample exam problems will be given at the end of many lectures.\n\nGrading\n\nFor Undergraduates\n\nACTIVITIES\n\nPERCENTAGES\n\nTerm Paper\n\n30%\n\nSyntax Pset\n\n5%\n\nAttendance\n\n10%\n\nMidterm\n\n20%\n\nFinal\n\n35%\n\nFor Graduates\n\nACTIVITIES\n\nPERCENTAGES\n\nTerm Paper\n\n50%\n\nMidterm\n\n20%\n\nFinal\n\n30%",
  "files": [
    {
      "category": "Assignment",
      "title": "Syntax Problem Set",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-56j-abnormal-language-fall-2004/39d6659e7ae0fd8de5bb5df0dabb59c8_prob_setsolution.pdf",
      "content": "9.56, Fall 2004, PROBLEM SET, DUE Tuesday, Sept. 28, 2004 (at beginning of class)\nPlease note: These are not meant to be \"tricky\" but to help you learn, to let you test your\nunderstanding. Answers should be given in a fairly brief manner; no extra points for extra\nwords. Clarity and correctness is most important. We are happy with and encourage\nworking in groups, but all exercises must be written in your own words (no copying or\ngroup submissions). As always, note anyone with whom you work.\nExercise 1\nOn the basis of the following tree diagram, decide which of the following statements are\ntrue and which are false:\nCP\nSpec C`\nC\nIP\nNP I`\nI VP\nV`\nPP\nV NP\nP NP\nWill John - buy a car after the holidays ?\n(a) IP\n\ndominates\n\nCP\n\nF\n\n(b) IP immediately dominates the subject NP\nT\n(c) IP\n\nis\n\na\n\nsister\n\nof\n\nC\n\nT\n\n(d) V and the NP a car are\n\nsisters\n\nT\n\n(e) The NP the holidays is a constituent of IP\nT\n(f) The NP the holidays is an immediate constituent of VP\nF\n(g) VP\n\nand\n\nI\n\nare\n\nsisters\n\nT\n\n(h) VP precedes I\nF\n\nExercise 5\nNorwegian in an SVO/V2 language. For each of the following sentences say whether the\nsentence is good in the adult language. In each case, why? (Remember that in a V2\nlanguage an adverb like \"soon\" can be the constituent which moves into first position\n(Spec,C)). +fin means \"finite\"\n(1) John leaves (+fin) soon\nGood. \"Leaves\" moves to C, \"John\" moves to Spec,CP.\n(2) Soon leaves (+fin) John\nGood. \"Leaves\" moves to C, \"Soon\" moves to Spec,CP.\n(3) John leave [-fin] soon\nBad. Need finite V in root clause; \"John\" fails to get Case.\n(4) Soon leave [-fin] John\nBad. Need finite V in root clause; \"John\" fails to get Case.\n(5) Soon John leaves [+fin]\nBad. \"Leaves\" cannot be in C with two constituents to its left.\n(6) Soon John leave [-fin]\nBad. Need finite V in root clause; \"John\" fails to get Case.\n\nExercise 6\nIllustrate Principles A, B, and C of the binding theory with examples of your own,\nproviding three examples for each principle.\nFor the most part, everyone gave fine examples.\nPrinciple A\nPrinciple B\nPrinciple C\n\nExercise 7\nConsider the following sentences in light of the binding theory as discussed in class.\nHow do you explain their ungrammaticality?\n(a) *Briani liked [Mary's picture of himselfi]\nMost of you attributed this to a violation of the locality constraint of Principle A. But\nvery few of you stated the binding domain necessary to rule this out. That is, the binding\ndomain cannot be the IP (Brian and himself are part of the same IP). This sentence\nsuggests that NP also serves as a binding domain.\n(b) *Briani's mother liked himselfi\nViolation of c-command constraint of Principle A (Brian does not c-command himself).\n(c) *I expect [himselfi to invite Poiroti]\nViolations of both Principle A (himself is not bound) and Principle C (Poirot is bound).\n\nExercise 8\nConsider the following examples. Does the binding theory explain the judgments we\nindicate? Why?\n(a) *John requests that himself leave soon.\nYes. Himself requires a local antecedent which is not available.\n(b) *John longs for Mary to date himself.\nYes. Himself requires a local antecedent which is not available.\n(c) A picture of himself astonished John\nNo. Himself requires a local antecedent which is not available, yet the sentence is ok.\n(d) Unflattering descriptions of himself have been banned by our president.\nNo. Again, the anaphor is not bound. Here, however, we've a passive sentence, so\nperhaps the anaphor is bound at D-struct (requires that Principle A need only be satisfied\nat D-Struct then).\n(e) *Himself astonished John.\nYes. Another example of an unbound anaphor.\n(f) Joani recognized the necessity for heri to leave.\nYes. The antecedent for her is sufficiently far away (different clauses).\n\nExercise 9\nMy D- and S-struct notation is to save me from having to draw more trees while allowing\nthe relevant movements to be highlighted.\nDiscuss the derivation of the following sentences. For each sentence, provide a D-\nstructure representation, an S-structure representation, and discuss the assignment of theta\nroles and of case.\n(a) The prisoners have been arrested.\nD-Struct: have been arrested [the prisoners]\nS-Struct: [the prisoners]i have been arrested ti\nThe verb arrested assigns a theme role to the prisoners. The unaccusative passive verb\ncannot assign Case, so the prisoners must raise to Spec,IP where it is valued for Nom\nCase (from finite I).\n(b) Poirot seems to like the countryside\nD-Struct: seems [to Poirot like the countryside]\nS-Struct: Poiroti seems ti to ti like the countryside.\nThe verb like assigns an experiencer (not agent!) role to the external argument and a\ntheme role to the internal argument. Poirot cannot receive case from the embedded\nclause (non-finite I) so it raises to the matrix Spec,IP where it gets Nom case.\n(c) George is thought to have been invited to the court.\nD-Struct: is thought [to have been invited George to the court]\nS-Struct: Georgei is thought ti to have been invited ti to the court\nThis sentence involves two passive transformations (many of you forgot about the second\none). The NP George is assigned a theme role from by invited. It continues to raise to\nsatisfy EPP and receive Case (in matrix Spec,IP).\n(d) John is likely to leave soon.\nD-Struct: is likely [to John leave soon]\nS-Struct: Johni is likely ti to ti leave soon.\n\nExercise 10\nConsider the following sentences. For each sentence we offer some possible syntactic\nrepresentations. Which one is theoretically justified? Provide evidence.\n(a) John tried to go.\na. [IP Johni tried [CP [IP PROi to go]]]\nb. [IP Johni tried [IP ti to go]]\nA.\nFirst, we see two theta-roles. That is, John is both a trier and a goer. The theta-criterion\ntells us that for each theta-role, there must be a unique argument.\nSecond, no expletive construction is allowed (*It tried that John went), providing further\nevidence that John is an argument of try.\n(b) John appears to be happy.\na. [IP Johni appears [IP ti to be happy]]\nb. [IP Johni appears [CP [IP PROi to be happy]]]\nA.\nFirst, we see only one theta-role. That is, John is happy, but not an appearer. The theta-\ncriterion therefore tell us that there is only one argument present.\nSecond, there is a semantically equivalent sentence using an expletive subject (It appears\nthat John is happy), which shows that John is not an argument of appear.\n(c) John is happy to leave.\na. [IP Johni is happy [IP ti to leave]]\nb. [IP Johni is happy [IP PROi to leave]]\nc. [IP Johni is happy [CP [IP PROi to leave]]]\nB or C accepted (A is clearly wrong since we don't get an expletive construction and see\ntwo theta roles). I realized that deciding between B and C is actually a bit trickier than\nwe intended. No grades were affected.\n\nExercise 11\nConsider the following (ungrammatical) examples. Together, they demonstrate a certain\nrestriction on A-movement. What is this restriction?\n(a) *A kissi was given Mary ti by John.\n(b) *Johni seems that Mary likes ti.\n(c) *Johni seems that hei is believed ti to be happy.\n(d) *Johni seems that [IP it appears [IP ti to be happy]].\nTo answer this question, it helps to list related sentences that are grammatical.\n(e) *A kissi was given Mary ti by John.\nMary was given ti a kiss by John.\n(f) *Johni seems that Mary likes ti.\nMaryi seems ti to like John.\n(g) *Johni seems that [IP it appears [IP ti to be happy]].\nIt seems to appears that John is happy.\nThe difference between the ungrammatical and grammatical sentences involves a locality\nconstraint on A-movement. Only the closest NP to I may move there. A corollary of this\nconstraint is that an NP can never skip over another NP by A-movement."
    },
    {
      "category": "Assignment",
      "title": "Syntax Problem Set",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-56j-abnormal-language-fall-2004/03e6b9837d5e8f1dda0ede801b836ffe_synt_problem_set.pdf",
      "content": "9.56, Fall 2004, PROBLEM SET, DUE Tuesday, Sept. 28, 2004 (at beginning of class)\nPlease note: These are not meant to be \"tricky\" but to help you learn, to let you test your\nunderstanding. Answers should be given in a fairly brief manner; no extra points for extra\nwords. Clarity and correctness is most important. We are happy with and encourage\nworking in groups, but all exercises must be written in your own words (no copying or\ngroup submissions). As always, note anyone with whom you work.\nExercise 1\nOn the basis of the following tree diagram, decide which of the following statements are\ntrue and which are false:\nCP\nSpec C`\nC\nIP\nNP I`\nI VP\nV`\nPP\nV NP\nP NP\nWill John - buy a car after the holidays ?\n(a) IP dominates CP\n(b) IP immediately dominates the subject NP\n(c) IP is a sister of C\n(d) V and the NP a car are sisters\n(e) The NP the holidays is a constituent of IP\n(f) The NP the holidays is an immediate constituent of VP\n(g) VP and I are sisters\n(h) VP precedes I\n\nExercise 2\nConsider:\n(a) Mary has been ill\n(b) Mary has not been ill\n(c) *Mary has been not ill\n(d) Mary is not ill\n(e) *Mary not is ill\nSuppose that not starts out in the structure to the left (outside of) the VP. That is, not is a\nfunctional item, an instance of a functional category; it starts out outside VP. We know\nthat Mary raises to Spec, IP. How do we account for the pattern in (a) through (e) above?\nIn particular, have and be are Auxiliary verbs (Aux). What does Aux do? Where does it\nmove to? All Aux? (Remember that a head (like Aux) must move to a head position.\nWhich head is available?\n\nExercise 3\nShow the X-bar structure (phrase-structure) of the following (include INFL (I) and\nCOMPLEMENTIZER (C):\n(a) Steven will meet the new maid in the foyer of the opera.\n(b) Chris prefers for Veronica to win the race\n(HINT: to is often thought to be the word that is the head of a non-finite clause)\n\n(c) She has decided that owners of big cars without children should pay tax.\n(d) Veronica's friend hopes that Chris is winning\n\nExercise 4\nShow the derivation in GERMAN of the sentence: \"That cake baked John.\" (Meaning\nthe sensible meaning, of course, i.e., John baked that book.). In particular, draw a tree and\nshow the movements.\n\nExercise 5\nNorwegian in an SVO/V2 language. For each of the following sentences say whether the\nsentence is good in the adult language. In each case, why? (Remember that in a V2\nlanguage an adverb like \"soon\" can be the constituent which moves into first position\n(Spec,C)). +fin means \"finite\"\n(1) John leaves (+fin) soon\n(2) Soon leaves (+fin) John\n(3) John leave [-fin] soon\n(4) Soon leave [-fin] John\n(5) Soon John leaves [+fin]\n(6) Soon John leave [-fin]\n\nExercise 6\nIllustrate Principles A, B, and C of the binding theory with examples of your own,\nproviding three examples for each principle.\nPrinciple A\nPrinciple B\nPrinciple C\n\nExercise 7\nConsider the following sentences in light of the binding theory as discussed in class.\nHow do you explain their ungrammaticality?\n(a) *Briani liked [Mary's picture of himselfi]\n(b) *Briani's mother liked himselfi\n(c) *I expect [himselfi to invite Poiroti]\n\nExercise 8\nConsider the following examples. Does the binding theory explain the judgments we\nindicate? Why?\n(a) *John requests that himself leave soon.\n(b) *John longs for Mary to date himself.\n(c) A picture of himself astonished John\n(d) Unflattering descriptions of himself have been banned by our president.\n(e) *Himself astonished John.\n(f) Joani recognized the necessity for heri to leave.\n\nExercise 9\nDiscuss the derivation of the following sentences. For each sentence, provide a D-\nstructure representation, an S-structure representation, and discuss the assignment of theta\nroles and of case.\n(a) The prisoners have been arrested.\n(b) Poirot seems to like the countryside.\n(c) George is thought to have been invited to the court.\n(d) John is likely to leave soon.\n\nExercise 10\nConsider the following sentences. For each sentence we offer some possible syntactic\nrepresentations. Which one is theoretically justified? Provide evidence.\n(a) John tried to go.\na. [IP Johni tried [CP [IP PROi to go]]]\nb. [IP Johni tried [IP ti to go]]\n(b) John appears to be happy.\na. [IP Johni appears [IP ti to be happy]]\nb. [IP Johni appears [CP [IP PROi to be happy]]]\n(c) John is happy to leave.\na. [IP Johni is happy [IP ti to leave]]\nb. [IP Johni is happy [IP PROi to leave]]\nc. [IP Johni is happy [CP [IP PROi to leave]]]\n\nExercise 11\nConsider the following (ungrammatical) examples. Together, they demonstrate a certain\nrestriction on A-movement. What is this restriction?\n(a) *A kissi was given Mary ti by John.\n(b) *Johni seems that Mary likes ti.\n(c) *Johni seems that hei is believed ti to be happy.\n(d) *Johni seems that [IP it appears [IP ti to be happy]].\n\nExercise 12\nShow the phrase (X-bar) structure and the movements that take place in the following:\n(a) Which cookie is Mary eating?\n(b) This is the author whom I like.\n(c) Which detectives will be invited?\n\n(d) Who do you think seems to be nicest?\n(e) Which ships do you think will sink?"
    },
    {
      "category": "Resource",
      "title": "9.56/24.907 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-56j-abnormal-language-fall-2004/e0d1b566977c934f4d179749e492764b_9_56paperoutline.pdf",
      "content": "9.56/24.907 Paper Topics\nThe paper should represent an opportunity for you to read outside of the class material\nand gain a deeper understanding of abnormal language. The end result should be a paper\nthat contributes something novel to the field. That is, we are not looking for literature\nreviews alone. While the papers should review what is known in the relevant area, we\nare looking for critical analysis and theory generation. All papers should offer a critique\nof the relevant literature and attempt to unify disparate results, proposing how theories\ncould be tested and what types of results would help in deciding between competing\nalternatives. We can imagine papers in the following four styles, but are open to other\nideas.\nI. Further Areas\nDue to time constraints, we were not able to discuss many other areas of abnormal\nlanguage. You may review what is known in one such area, and propose a theory to\naccount for the data if enough data is available. If relevant data is lacking, you may\npropose a research program outlining how such data might be acquired. Based on what is\nknown, make predictions about what linguistic problems should be expected. Some areas\nto consider include:\nLanguage savants\nCerebellar patients\nLeft-handed individuals (i.e. RH language)\nLate-talkers\nIndividuals with low IQ\nDemented patients (e.g. Alzheimer's)\nII. Linguistic Inquiry\nThe course focuses on three areas of grammatical knowledge: finiteness, binding theory,\nand A-movement. While these areas have been the best studied, other areas have also\nbeen probed. Papers reviewing problems with other linguistic phenomena in a single\nabnormal population would be acceptable. In addition to reviewing what is known about\nthe linguistic phenomena in the population of interest, ties should be made to whether\nthese data match or refute existing theories of the disorder. A good place to start would\nbe to review what is known about the linguistic phenomenon in L1. Some areas to\nconsider include:\nDeterminers\nNull subjects\nIndividual vs. stage level predicates\nUnaccusativity\nClitics\nInversion\n\nIII. Biology\nCan any strong claims be made about the localization of linguistic knowledge in the\nbrain? A review of the neuroimaging literature, patient literature, and material discussed\nin the course, leading to specific claims about the linguistic processes carried out by a\ncertain area of the brain would be acceptable. Such a paper should review what is known\nabout the candidate area with respect to language processing, propose a theory of what\nrole the area plays in such computations, and include ideas about what data should be\nsought to help determine the validity of the theory. Some areas to consider include:\nBasal ganglia\nBroca's area (LH)\nBroca's area homologue (RH)\nCerebellum\nIV. CHILES\nFor those interested in conducting their own research, and especially for those who speak\nanotherlanguage, you might consider undertaking an analysis of natural production data.\nA paper in this area would require examining speech transcripts for evidence of certain\nlinguistic phenomena. Predictions should be made based on the material discussed in the\ncourse. The relationship of the predictions to the data should be thoroughly discussed.\nThe CHILDES database (http://childes.psy.cmu.edu/) contains transcript files for the\nfollowing languages and disorders.\nCastillian (SLI)\nDutch (SLI, DS, hearing impaired)\nEnglish (SLI, perinatal brain injury- twins, autism, DS, cocaine, WS)\nFrench (SLI)\nHebrew (Fragile X)\nSpanish (SLI, WS)\nV. Other\nIf you have another idea for a paper, please come see us soon.\nLength\nUndergraduates: 10-12 pages + references\nGraduates: 15-18 pages + references\nDouble-spaced, Times New Roman, 12 point font, 1\" margins\nImportant Dates\nOctober 20th (10-12), 22nd (12-2), 26th (3-5)\nWe will meet with each student for 15 minute meetings to discuss paper topics.\nBring to the meeting a one paragraph description of what you would like to study.\nStart scheduling a meeting time as soon as possible.\n\nNovember 16th\nTurn in 1-2 page write-up of initial findings, with a short discussion of where the\npaper is going.\nDecember 2nd\nPapers are due in class, by the beginning of class.\nJournals\nBehavioral and Brain Sciences\nBrain and Language\nCognition\nLanguage\nLanguage Acquisition\nLanguage and Cognitive Processes\nJournal of Child Language\nJournal of Cognitive Neuroscience\nJournal of Neurolinguistics\nJournal of Speech, Language, and Hearing Research\nNeuropsychologia\nNeuropsychology\nTrends in Cognitive Sciences\nResources\nGoogle\nPubMed\nScience Citation Index"
    }
  ]
}