{
  "course_name": "Advanced Fluid Mechanics",
  "course_description": "This course is a survey of principal concepts and methods of fluid dynamics. Topics include mass conservation, momentum, and energy equations for continua; Navier-Stokes equation for viscous flows; similarity and dimensional analysis; lubrication theory; boundary layers and separation; circulation and vorticity theorems; potential flow; introduction to turbulence; lift and drag; surface tension and surface tension driven flows.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Ocean Engineering",
    "Hydrodynamics",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Ocean Engineering",
    "Hydrodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nTutorials: 1 session / week, 1 hour / session (Students attend one of three tutorial sessions per week.)\n\nPrerequisites\n\n2.006 Thermal-Fluids Engineering II\nor\n2.06 Fluid Dynamics\n\nCo-requisites\n\n18.075 Advanced Calculus for Engineers\nor\n18.085 Computational Science and Engineering I\n\nDescription\n\nThis course is a survey of principal concepts and methods of fluid dynamics. Topics include mass conservation, momentum, and energy equations for continua; Navier-Stokes equation for viscous flows; Similarity and dimensional analysis; lubrication theory; boundary layers and separation; circulation and vorticity theorems; potential flow; introduction to turbulence; lift and drag; surface tension and surface tension driven flows.\n\nTextbooks\n\nPanton, Ronald L.\nIncompressible Flow\n. 4th ed. Wiley, 2013. ISBN: 9781118013434. [Preview with\nGoogle Books\n]\n\nShapiro, Ascher H., and Ain A. Sonin.\nAdvanced Fluid Mechanics Problems\n. (Self-published manuscript.)\n\nOther Recommended Textbooks:\n\nKundu, Pijush K., and Ira M. Cohen.\nFluid Mechanics\n. 6th ed. Academic Press, 2015. ISBN: 9780124059351.\n\nFay, James A.\nIntroduction to Fluid Mechanics\n. MIT Press, 1994. ISBN: 9780262061650. [Preview with\nGoogle Books\n]\n\nTritton, D. J.\nPhysical Fluid Dynamics\n. Springer, 2013. ISBN: 9780442301323.\n\nSchlichting, H., and K. Gersten.\nBoundary Layer Theory\n. Springer, 2000. ISBN: 9783540662709. [Preview with\nGoogle Books\n]\n\nThis journal publishes excellent reviews of the state of the art in all areas of fluid mechanics:\n\nAnnual Review of Fluid Mechanics\n\nWe will occasionally use this DVD in class:\n\nHomsy, G. M., ed.\nMultimedia Fluid Mechanics\n. 2nd ed. Cengage Learning, 2011. ISBN: 9780521721691.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nQuiz 1\n\n30%\n\nQuiz 2\n\n30%\n\nFinal Exam\n\n40%\n\nExtra Credit\n\nYou can gain extra credit by turning in, at the conclusion of the final exam, a notebook in which you have reworked and amplified your lecture notes in cohesive, clearly reasoned form. This is not obligatory, and note that your grade will not suffer if you do not do it. Grades will be assigned before the notebooks are examined, and only upward adjustments will be made thereafter. However, thinking through and rewriting the lecture notes, preferably on the same day as the lectures and in consultation with a text, is one of the most effective forms of study, and well worth the effort. Please do not bother to turn in a pretty version of what is on the blackboard: Extra credit will be given only when it is apparent that thought has gone into the rewriting and reconsideration of the material.\n\nAssignments and Tutorial Sessions\n\nHomework problems from Shapiro & Sonin's Advanced Fluid Mechanics Problems are indicated in the course outline for each topic. The homework problems are not to be turned in. Instead, they will be discussed in the tutorial sessions. Three tutorials are scheduled per week, but the idea is that each student should come to one session each week, usually the same one. Three sessions are scheduled, partly to accommodate a variety of student schedules and partly to reduce the class size and allow for a more informal atmosphere for discussion.\n\nDetailed solutions for most of the problems have been prepared and will become available on line each week after the recitation. Additional solutions will be prepared by the Teaching Assistants and will be posted online weekly.\n\nThe main purpose of this course is not so much to feed students with \"advanced\" material (the topics covered do not in fact appear terribly advanced). It is instead designed to help students develop a mastery of the underlying principles and the ability to solve, quickly and efficiently, a variety of real fluid mechanics problems from first principles. The lectures present and illustrate the fundamental laws and the methods and modeling approximations that form the basis of fluid mechanics. The problems and tutorials help the students gain mastery of the material and to develop, by practice and trial and error, the mindset of an effective problem solver in fluid mechanics.\n\nBoth the assigned problems and the tutorials are entirely voluntary. No problem sets are collected, nor is roll call taken. However, based on repeated experience over many years, you may take our word that your chances of doing well in this course are minimal if you do not independently do at least the assigned problems before the tutorials, and use the tutorials to repair weaknesses and develop new insights. We are ready to help you in every way to master the course material. There is, however, a profound difference between being taught and learning. To quote Benjamin Franklin: \"Tell me and I forget, teach me and I may remember, involve me and I learn.\"\n\nExams\n\nThere will be two 90-minutes quizzes during the term and the dates are announced well in advance. In order to minimize time pressures, we prefer to give the 90 minute quizzes in the evening starting at 7 pm, and give students until 9 pm to complete the problems.\n\nThere will be a three hour final exam during the final exam week.\n\nQuizzes and the exam will permit you to use your notes, the course textbook, a calculator, and a book of mathematical formulas and tables. No other books will be allowed. The quizzes and the exam will not present you with routine problems, but will probe for mastery of the underlying material and for skill in modeling problems in the simplest possible realistic terms.",
  "files": [
    {
      "category": "Exam",
      "title": "Equation Sheet for Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/53faf9135b15c4e419ca8dfd9e74a735_MIT2_25F13_EquationSheet.pdf",
      "content": "Newtonian Constitutive Equation\n! = μ \"v + (\"v)t\n{\n} = μ !#\nNavier-Stokes Equation for isothermal flow\nof an incompressible Newtonian fluid\n! Dv\nDt = ! \"v\n\"t + v #$ v\n%&'\n()*\n= +$p + μ$2v + !g\nInviscid fluid Re ! !\n(Euler Equation)\n! Dv\nDt = \"#p + !g\nSteady Irrotational Flow ( ! = 0)\nVelocity potential v = !\"\n(! \"v) = !2# = 0\nVery viscous fluid (Stokes' Flow; Re ! 0 )\n0 = !\"p + μ\"2v + #g\nQuasi-Fully Developed Flow (Lubrication approximation)\nh L << 1, ReL h L\n(\n)\n2 << 1, h2 (!\") << 1)\n0 ! \" #p\n#x + μ #2vx\n#y2 + $gx\n0 ! \"p\n\"y + #gy\nBoundary Layer Equations ( !(x) << x )\n! vx\n\"vx\n\"x + vy\n\"vx\n\"y\n#\n$%\n&\n'( = ) \"p\n\"x + μ \"2vx\n\"y2\n0 = ! \"p\n\"y\n!vx\n!x +\n!vy\n!y\n\"\n#$\n%\n&' = 0\nFree Surface Flows; p ! \"# $2h $x2\n(\n)\n!h\n!t + ! \"\nQ\n!x = 0\nwhere\n!\nQ =\nvx!dy\nh\"\n!h\n!t\n+\n\"gh2 sin#\nμ\n$\n%\n&\n'\n(\n)\n!h\n!x\n= \"gcos#\n3μ\n!\n!x\nh3 !h\n!x\n*\n+,\n-\n./\nYoung-Laplace Equation\n!p = \"\nR1\n+ 1\nR2\n#\n$%\n&\n'(\nHydrostatics\n!p = \"(g # a)\nCauchy Momentum Equation\n! Dv\nDt = \"#p + # $% + !g\nContinuity\n!\nD!\nDt = \" # $v\n(\n)\nIncompressible Flow\n! \"v = 0\nKutta-Zhukowski Theorem\n! =\n\" #dA =\nv #ds\n!$\n$\nL = !V\"\nD = 0\nUnsteady Bernoulli Equation along a streamline\n!v\n!t \"dr\n#\n$%\n+\n2 v2\n2 & 1\n2 v1\n(\n)+\ndp\n'\n#\n$%\n+ (2 & (1\n(\n) = 0\nSteady Bernoulli Equation along a streamline for\nan inviscid flow of an incompressible fluid\n2 v2\n2 ! 1\n2 v1\n(\n)+ 1\n\" p2 ! p1\n(\n) + g z2 ! z1\n(\n) = 0\nAcross streamlines\n(outward pointing normal n)\n!p\n!n = \"v2\nR\nThe Equations of\nFluid Mechanics\n(c) Gareth H. McKinley\nDecember 2006\nReynolds Transport Theorem Bcv =\n!dV\ncv\"\n=\n#b dV\ncv\"\nForm A: dBsys\ndt\n= d\ndt\n!dV\ncv\"\n+\n(#b) v $ vc\n(\n)%n dA\nCS\n\"\nForm B: dBsys\ndt\n=\n!\"\n!t dV\n#\n$%\n+\n(&b)v 'n dA\nCS\n(\n! = 0! = 0\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/cc50bdf595a615c6279b35367995f1e2_MIT2_25F13_FinalExam.pdf",
      "content": "2.25 Final\nFall 2013\n2.25 ADVANCED FLUID MECHANICS\nFall 2013\nFINAL\nTUESDAY, December 17th, 9:00-12:00 P.M.\nOPEN QUIZ WHEN TOLD AT 9:00 AM\nTHERE ARE TWO LONG PROBLEMS\n(worth 15 points and 20 points respectively)\nPlus 5 \"Conceptual Questions\" (worth one point each)\nPlease answer each long question in DIFFERENT books\nALSO: Please write your name on page 2 with Concept Questions\nAND HAND THIS EXAM SCRIPT IN WITH THE BOOK\nCONTAINING QUESTION 1\nYou may use the course textbook (Kundu or Panton), a binder containing your class notes,\nrecitation problems and THREE pages of handwritten notes summarizing the key\nequations.\n\n2.25 Final\nFall 2013\n\n2.25 Final\nFall 2013\nFamily Name:\nFirst Name:\nConcept Question [5 Points]:\n1. A single spherical bacterium moving in water vs. a baseball moving in air which one has\na higher CD?\n2. For each flow description on the left, choose the form of mass conservation you would\nuse for that situation on the right.\na. Steady/compressible flow of air\n1.\nb. Arbitrary flow (Lagrangian perspective)\n2.\nc. Unsteady/incompressible flow of viscous oil\n3.\nd. Arbitrary flow (Eulerian perspective)\n4.\n3. How would the three phase contact angle (between liquid/air/solid) (\n) change with\nrespect to the Bond number for an ideally smooth surface?\na. It will decrease\nb. It will increase\nc. It remains constant\n4. Write down in one line the scaling for the pressure in a lubrication problem in a confined\ngeometry with characteristic length (L) and height (h) viscosity ( μ ) and velocity (V )\n(assumptions\n)?\n5. A soccer player is trying to score a goal, but the players from the other team are blocking\nhis way. So, he decides to curve the ball. What direction of circulation will make the ball\ngo into the goal?\n\n2.25 Final\nFall 2013\n1. Savart Liquid Sheets [15 Points]\nAtomization processes in rocket engines and electronics cooling applications frequently use an\nImpinging Jet geometry as shown in Figure 1 below. Viscous liquid of viscosity μ, density ρ\nand surface tension σ is fired vertically downwards out of a nozzle at a constant velocity u j as a\ncylindrical jet of radius rj and hits a small rigid circular disk of radius r1 that is aligned to be\northogonal to the jet. The impact leads to a rapid deflection of the jet and rearrangement of the\nfluid so that a thin circular sheet of fluid of thickness h < rj flows outwards radially.\nA few important experimental observations that can be made are:\ni)\nfor small jet diameters and high speeds the sheet remains almost perfectly horizontal and\ndoesn't sag under gravity.\nii) the circular disk of fluid flows outwards to a critical radial point R and then abruptly\nstops and forms a 'rim' that subsequently breaks into small drops that fall vertically\ndownwards under gravity.\niii) experimental measurements show that small seed particles or bubbles move outwards\nalong this liquid sheet with a constant velocity U (so that their position varies as\nrp = Ut for r1 ≤ r ≤ R )\nWe describe the flow in a cylindrical polar coordinate system r,θ,z . We will consider two cases;\nfirstly one in which fluid viscosity is negligible and then one in which viscous effects near the\ndisk do play a modifying role.\na) [2 points] We seek to understand how the sheet radius R varies with the incoming\nmomentum of the jet and the size of the disk r1 . Using a suitable dimensionless analysis\nand selecting the surface tension as the relevant fluid property, identify the key groups that\ncontrol the size of the fluid sheet.\n- Based on your analysis, give two suitable constraints that would enable you to tell people\nwhen the following conditions hold:\ni) gravitational effects on the circular sheet are negligible so that sagging doesn't occur\nii) viscous effects in the film as it first flows radially outwards over the disk are negligible\nb) [2 points] Show that the thickness of the fluid film flowing radially outwards is h1 = rj 2r1\n. Give an expression for the steady thrust force (including sign) that acts on the solid disk.\nc) [2 points] In this part we neglect any effects of viscosity:\n- Given the experimental observation that the radial velocity is constant in the outward flowing\nfilm (until it reaches the rim) find an expression for the thickness of the fluid film h(r) and then\n\n2.25 Final\nFall 2013\nby considering a radial momentum balance find an expression for the rim radius R. Arrange your\nresults into a dimensionless form; i.e. R rj = ??\n- Describe in words what forces (or stresses) physically balance each other at this point?\nd) [2 points] When the fluid viscosity is small, but not completely negligible, a viscous\nboundary layer forms near the disk and grows as the fluid flows radially outwards. Give an\nappropriate expression for the thickness of the\nboundary layer at the edge of the disk (where r → r1 ).\nTo express this in dimensionless form we compare this\nvalue to the thickness of the inviscid sheet and call the\nratio β = δ h1 = ??\n- If viscous effects are important, do you expect the\nfluid film to be thicker and moving slower, or thinner\nand moving faster than in the inviscid case?\ne) [2 points] Use the concept of a displacement thickness to give an expression for the\nmomentum loss in the viscous sheet as it exits the disk radially at r = r1 . Then using the\nconservation laws find expressions for the average velocity and height of the sheet just as\nthe fluid leaves the disk. Check that your result is in agreement with the conclusion you\nreached above in (d).\nf) [2 points] Beyond the edge of the disk (i.e. for radii r1 ≤ r ≤ R ) there is no rigid surface to\nprovide additional shearing, and the thin but viscous fluid film quickly returns to a plug-\nlike profile in which U is constant throughout the fluid sheet. Use the results of your\nmomentum balance from part (c) to evaluate an expression for the viscous stress τθθ .\nGive a dimensionless condition for when viscous effects are small (but not totally\nnegligible) in the sheet.\ng) [2 points] Use your expressions from parts (d) and (e) to construct a new expression for the\nradius of the sheet at which the radial outward flow stops; R r1 = ??\n(hint your result should reduce correctly to the case when fluid viscosity is totally negligible!)\nh) [1 point] Experiments show that beyond a critical flow rate the disk transitions to a time-\nperiodic 'flapping mode' (reminiscent of a flapping flag or a pulsating jellyfish). A linear\nstability analysis (like the one described in the last class for a fluid jet) gives the following\ncritical condition for the critical wavelength λ of the instability:\nλcrit = 10π\nσ\n(where ρa is the density of the air surrounding the fluid sheet)\nU2\nρa\nAssuming that the sheet starts flapping when it extends radially outwards to be big enough\nto fit in exactly one flapping wavelength (i.e. so the sheet radius grows to be R →λcrit ),\ncombine the expression above with your expression for the radius of a viscous sheet to give\na dimensionless expression for the critical Weber number Wecrit at onset of the flapping\ninstability.\n\n2.25 Final\nFall 2013\n2. Flow Around an Oar [20 points]\nTo study the flow around a rowing oar, we consider a simpler but related two-dimensional\nproblem. The problem involves a vertical thin plate, height 2a and negligible thickness, moving\nin an unbounded fluid with horizontal velocity Uinf perpendicular to its long axis. The fluid\ndensity is ρ and the kinematic viscosity is ν.\nThroughout the problem, you may neglect all body forces.\nFigure 1: Potential flow over an oar of length 2a and negligible thickness oriented perpendicular to\nthe free-stream flow direction. This figure is shown in the reference frame of the plate. Roman\nnumerals indicate 1st-4th quadrants.\nPart I: Potential flow\nInitially, we assume that the flow has no separation around the plate and that potential flow\ntheory is valid. The complex potential for this flow (in the reference frame of the plate) is\nknown to be\n(1)\nwhere z = x + iy, β is a positive constant (\n) and 2a is the height of the plate.\n(a) [1 point] Use basic dimensional arguments to determine the value of β.\n(b) [1 point] Draw 5 representative streamlines and 5 lines of constant velocity potential\naround the plate.\n(c) [3 points] It can be shown that the complex velocity\nis given by\n(2)\nUse this definition to determine the y-direction velocity on the surface of the plate (x = 0,\n) and the x-direction velocity on the centerline (y = 0). Carefully note the sign of\nthese velocities!\nUse physical arguments to determine the sign of the x- and y-\ncomponents of velocity (in the reference frame of the plate) in each quadrant (I-IV).\n\n2.25 Final\nFall 2013\n(d) [2 points] Determine the circulation (sign and magnitude, assuming positive circulation is\ncounter-clockwise) around (i) the top half of the plate (i.e., the portion for which y > 0)\nand (ii) the entire plate. Clearly indicate the contours used in computing the circulation.\nFigure 2: Vortex pair left in the fluid after sudden removal of the plate. This figure is in the\nlaboratory reference frame (the bulk fluid is stationary).\nPart II: Vortex propagation\nNow consider the situation when the oar is suddenly removed from the fluid. The resulting flow\ncan be described as a pair of vortices a vertical distance H apart, moving with a forward speed V.\nThe fluid outside of the vortices is irrotational. The vorticity distribution within each vortex is\nassumed to be uniform over a radial distance R from the center. Assume\n(e) [2 points] Neglecting any flows induced by the removal of the oar, what is the strength\n(i.e. the magnitude of circulation) of each vortex? Justify your answer, stating any\nnecessary assumptions. What is the magnitude of the vorticity in each of the vortices?\n(f) [2 points] Determine (i) the tangential velocity and (ii) the pressure at the \"edge\" of the\nbottom vortex, at r = R (where r is the distance outward from the center - see Figure 2),\nin terms of the circulation found in part (e).\n(g) [1 point] Assuming potential flow, calculate the propagation speed V of the vortex pair (it\nshould depend on Uinf).\nPart III: Vorticity diffusion\nIn reality, viscous stresses will diffuse the vorticity outward. Let us focus our attention on the\nflow field around one of the vortices. Initially, the vortex resembles an ideal vortex (R → 0). As\ntime passes, the flow resembles solid-body rotation near the center and an ideal vortex far from\nthe center.\n(h) [4 points] Derive the governing equations, initial condition, and boundary conditions for\nthis unsteady process.\nUse the similarity transformation below to show that the\ngoverning equation reduces to\n\n2.25 Final\nFall 2013\n(3)\nsubject to appropriate boundary conditions.\nHere\nis a dimensionless\nvelocity and\nis a dimensionless similarity variable. Solve equation (3) and thus\ndetermine the velocity profile around one of the vortices. You may find the following\nidentity helpful: if\n(i) [1 point] Estimate a characteristic width (in the y direction) of the vorticity distribution.\nIt should depend on time.\n(j) [3 points] Estimate the time required for the vorticity distributions associated with each\nvortex to overlap. Use your result to estimate the distance traveled by the vortices before\nthey overlap. What dimensionless parameter appears? Explain why this answer makes\nsense.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Solutions to the Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/e53775b7c7cddb1c6b60cf12e8f3fede_MIT2_25F13_SolFinalExam.pdf",
      "content": "2.25 Advanced Fluid Mechanics\nFall 2013\nSolution to Problem 1-Final Exam- Fall 2013\nr1\nh(r)\n2rj\ng\n\nρ, μ,σ ,u j\nr = R\nu j\nu\nFigure 1: Viscous \"Savart Sheet\". Image courtesy: Villermaux et. al. [1]. This kind of\ngeometry was first studied by Felix Savart in 1833.\n(a):\nWe know that the following independent properties are important for determining the value of\nR: radius of the disk (r1), radius of the jet (rj ), viscosity (μ), density (ρ), surface tension (σ),\nvelocity of the jet (uj ), and gravity (g), so:\nR = f(r1, rj , μ, ρ, σ, uj , g)\nthus, n = 8 and knowing that there are three dimensions involved in these parameters ([M],[L],\nand [T ] ⇒ r = 3) we can conclude that there are 5 dimensionless groups. We select r1,vj , and σ\nas the repeating parameters and using Buckingham-Pi theorem following dimensionless groups\nwill be identified:\nΠ1 = R/r1\nΠ2 = rj /r1\nΠ3 = μuj /σ\nΠ4 = gr1/u2\nj\nΠ5 = ρu2\nj r1/σ\nSo the relationship for R can be written in the following dimensionless form:\nrj μuj gr1 ρuj\n2r1\nR/r1 = f\n,\n,\n2 ,\n(1)\nr1\nσ\nuj\nσ\nOne can easily see that Π3 is the Capillary number (comparing the jet velocity with visco\ncapillary velocity scale) and Π4 is the inverse of Froude number (comparing the gravity and\ninertia). The other dimensionless number found in this problem, (Π5) is indeed the Weber\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nnumber comparing the inertia stresses with capillary pressure. Thus, in order to ignore the\neffects of gravity and viscosity we have to satisfy the following1:\ngr1\nfor ignoring gravity: Fr-1 ≡\n<< 1\nuj\n(2)\nCa\nfor ignoring viscosity: Re ≡\n<< 1\nWe\n2 Satisfying the two mentioned criteria, Equation 1 will be simplified to:\nrj ρuj\n2r1\nR/r1 = f\n,\n(3)\nr1\nσ\n(b):\nFrom conservation of mass written for the dashed control volume in Figure 2 we will have (note\nthat since viscous losses are ignored in this part, by Bernoulli, we can say that velocity at the\nedge of the disk is equal to the jet velocity i.e. along a streamline the velocity is unchanged.):\nMass. Cons.: ρu2\nj (πrj\n2) = ρuj (2πr1h(r1)) →h(r1) = rj /2r1\n(4)\n2rj\nr1\nh(r)\ng\n\nproper s\nρ,μ,σ ,u j\nr = R\nu j\nu\nFigure 2: Simplified geometry with the selected control volume in dashed green line.\nFor calculating the thrust force on the disc we need to apply the conservation of linear momen\ntum for y-component, lets assume that the disc is exerting Fey to the control volume:\nMomentum. Cons.: Fey = ρvj\n2(πrj\n2)ey\n1Another approach to do the dimensional analysis is picking ρ, σ, r1 as the repeating parameters and that\nwill lead to R/r1 = g(rj /r1, Oh = μ/ √ ρσr1, Bo = ρgr1\n2/σ, W e = ρvj\n2 r1/σ) and the criteria for ignoring gravity\nand viscosity will respectively be Fr-1 = Bo/W e << 1 and Oh << 1; the physical reason that Fr-1 << 1\nmeans that gravity is negligible is the fact that inertia is fighting against gravity to keep the sheet flat rather\nthan capillarity so the Fr-1 << 1 is a physically more meaningful criteria for ignoring gravity effects compared\nto Bo << 1.\n2Stating the argument for neglecting the viscous effects by picking the Oh number or the Ca number is\nconsidered as the right answer but the most physical one is the Re << 1\nSolution by B.K. and G.H.M., 2013\n\n!\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nthus an equal and opposite thrust force will be exerted from the liquid to the disc, i.e.\nFT ey = -ρvj\n2(πrj\n2)ey.\n(c):\nFor finding a relationship for the value of R we have to consider a slice of the rim as our control\nvolume (Figure 3) . The x-component of linear momentum enters the control volume at\nbut\nvanishes as the drops have zero/negligible velocity in the x-direction. This must happen from\nthe force acting on the fluid in the control volume thus the conservation of linear momentum\nfor the selected C.V. will be:\nWρh(R)U2 = 2Wσ\nsubstituting U = uj and h(R) = rj /2R from conservation of mass:\nR\nρuj\n2rj\nρu2\nj rj /(2R) = 2σ ⇒\n=\n(5)\nrj\n4σ\nRearranging the result in Equation 5 we can get the following form:\n\nR\nρuj\n2r1\nrj\n=\nr1\n4σ\nr1\nwhich matches well with our predictions from dimensional analysis (equation 3).\nFσ = 2π Rσ\nFσ = 2π Rσ\nρ2π Rh(R)U 2\n\nr ~ R\n\nFigure 3: A slice of the sheet rim picked as our control volume (with h << R) and length taken\nto be W = Rdθ.\n(d):\nUsing the boundary layer scaling for diffusion of momentum away from the plate we have the\nfollowing:\nJ\n√\nδ ∼\nνt ∼\nνr1/uj\nand using the fact that h1(inviscid) = rj /2r1 we will have:\n1/2\n\n3/2\nδ\n4r1ν\nr1\nβ ≡\n=\n⇒ β =\n(6)\nh1(inviscid)\nuj r\nRej\nrj\nj\nSolution by B.K. and G.H.M., 2013\n\n!\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nIf we look into β through dimensional analysis then we will have:\nρu2\nrj\nμ\nj\nβ = f\n, Oh ≡√\n, We ≡\nr1\nρσr1\n(σ/r1)\nand by rearranging the equation in (6) we will have:\nOh1/2\n3/2\nr1\nβ = We1/4\nrj\nIf viscous effects are important then the momentum of the incoming jet will get dissipated in\nthe boundary layer and thus the liquid sheet emerging from the jet will be slower and thicker.\n(e):\nAt the end of the disc there will be loss of momentum compared to the initial flux from the\nimpinging jet due to the losses in the boundary layer. Through the concept of momentum\nthickness we know that the loss in the radial momentum at the edge of the disk should be:\nΔMOM = Loss in the momentum = 2ρπr1θu2\nj\nin which θ is the momentum layer thickness and for simplicity we can assume that θ and δ∗\ndiffer at most by a constant of order unity. After the sheet leaves the edge of the disc the\nvelocity in the sheet becomes uniform and conservation of mass and momentum for a C.V.\nfrom the impingement point to r1 < r will give us two equations respectively:\nρπrj\n2 uj - 2ρπr1δ ∗ uj = 2ρπrhU2\nρπrj\n2 uj = 2ρπrhU\nby multiplying the momentum equation by (1/ρπrj\n2uj = 1/2ρπrhU) we will find an expression\nfor U and then plugging that into the mass conservation equation we can find another expression\n= δ∗/(r2\nfor h. We rewrite the mentioned relationships in terms of β = δ/h1\nj /r1):\nU = uj (1 - β)\n(7)\nh = h(r)inviscid/(1 - β) = (rj /2r)(1 - β)\nwhere h(r)inviscid = rj /2r is the variation in the sheet thickness observed in the inviscid case.\nδ (r)\nh(r)\nr\nr = r1\nU\nFigure 4: Boundary layer developed on the disc.\nSince β > 0 then we can see that indeed the velocity of the sheet will decrease and the height\nwill increase.\nSolution by B.K. and G.H.M., 2013\n\n!\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n(f):\nUsing the appendix in either Kundu or Panton we have:\nτθθ = 2μ 1 ∂uθ\nr ∂θ + ur\nr\nknowing that by axisymmetry the first term on the right hand side is zero (there is no variation\nin the θ direction):\nU\nτθθ = 2μ r\nnow we can compare the scale of inertial terms with the viscous terms in the liquid sheet:\ninertia\n(1/2)ρU2\nUr\n∼\n=\nviscous\n2μU/r\n4ν\nif this ratio is larger than unity then viscous terms in the sheet are dominated by inertia terms.\n(g):\nWe can repeat the same argument we had in part (c) but only this time we need to use new\nexpression for U and h using equation (7):\nR/rj = ρu2\nj rj (1 - β)/4σ\n(8)\nρW U 2(1 - β)2hinviscid/(1 - β) = 2σW ⇒\nWhich rearranging it to the dimensionless form will give:\nR\nρu2\nj r1\nrj\n=\n(1\n\n- β)\n(9)\nr1\n4σ\nr1\nusing the expression for β we can rewrite the result:\n3/2\nR\nρu2\nj r1\nrj\nOh1/2\nr1\n=\n1 -\n(10)\nr1\n4σ\nr1\nWe1/4\nrj\nwhich is exactly in accordance to what we expected from dimensional analysis in the absence\nof gravitational effects (part a).\n(h):\nBy putting λcrit = R and using the result in equation (8) one can get:\n2 2\n4 2\nρ2\n10πσ\nρuj rj (1 - β)\n10πσ\nuj rj (1 - β)3\n40π2\nR =\n→\n=\n→\n=\nρauj (1 - β)2\n4σ\nρauj (1 - β)2\nσ2\nρa/ρ\nwhich can be rewritten as:\nWecrit(1 - β)3/2 =\n40π/α\n(11)\nin which α ≡ ρa/ρ and Wecrit ≡ ρu2\nj rj /σ. In the inviscid case for water in the air (ρa/ρ =\n1.2/1000) we get Wecrit ∼ 900. As the effects of viscosity get larger and larger (β = 0) the\ncritical Weber number shifts to higher values (Equation 11) and the rim radius at a given value\nof the Weber number is reduced, from equation (8). Interestingly because the dependence of\nequation (11) on β is stronger than equation (8) this means the viscous Savart sheet actually\nextends a little bit further out radially before it starts flapping (Figure 5).\nSolution by B.K. and G.H.M., 2013\np\n\n!\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n\nFigure 5: Copy of Figure 4 from Villermaux's paper ([1]).\nReferences\n[1] E. Villermaux, V. Pistre, and H. Lhuissier. The viscous Savart sheet. Journal of Fluid\nMechanics, 730:607-625, August 2013.\nSolution by B.K. and G.H.M., 2013\n\n2.25 - Fluid Mechanics - Fall 2013\nFinal Exam, problem 2 solution\nPart (a) (1 point)\nDimensions of :\nL\nw\nT\n\nDimensions of\n:\nL\nU\nT\n\nDimensions of\nand :\na\nz\nL\n\nL\nL\nL\nT\nT\n\nPart (b) (1 point)\n\nx/a\ny/a\n-4\n-3\n-2\n-1\n-2\n-1.5\n-1\n-0.5\n0.5\n1.5\nFigure 1: A holiday-themed plot of velocity potential contours (green) and streamlines (red) for potential flow\naround a flat plate of length 2a and negligible thickness. Lines of constant potential and streamlines are\neverywhere perpendicular, except at the stagnation point at the origin. Flow is from left to right. Note: the\nvertical \"streamlines\" at x = 0 are not physical; they are artifacts of discontinuities in the stream function at\nx = 0.\n\nPart (c) (3 points)\nThe complex velocity is\n\n2 .\nx\ny\nU\nx\niy\nU z\ndw\nv\niv\ndz\nz\na\nx\nixy\ny\na\n\n(1.1)\nTo find vx along the centerline, set y = 0 and isolate the real part of dw / dz:\n\n.\nx\nU x\nv\ny\nx\na\n\n(1.2)\nSince vx is positive everywhere (in the reference frame of the plate),\n\n,\n,\nx\nU x\nx\nx\na\nv\ny\nU x\nx\nx\na\n\n(1.3)\nSimilarly, the y-direction slip velocity on the plate is determined by setting x = 0 and looking at\nthe imaginary part of dw / dz:\n\n.\ny\nU y\nv\nx\na\ny\n\n(1.4)\nAgain, use physical intuition to determine the sign of vy:\n\n,\n0 (left side of plate)\n0,\n,\n0 (right side of plate)\ny\nU y\nx\na\ny\nv\nx\na\ny\na\nU y\nx\na\ny\n\n(1.5)\nFigure 2 shows the signs of the velocity components in each of the four quadrants.\nII\nvx > 0, vy > 0\nI\nvx > 0, vy < 0\nIII\nvx > 0, vy < 0\nIV\nvx > 0, vy > 0\nFigure 2: Signs of velocity components in each quadrant.\n\nPart (d) (2 points)\nThere are at least two curves that may be used to compute the circulation around the top half of\nthe plate.\nCurve 1\nThe simplest curve to use is likely the rectangle ABCD shown below.\nFigure 3: Counter-clockwise curve used for computing circulation.\nThe circulation is determined from its definition\nABCD\nAB\nBC\nCD\nDA\nd\nd\nd\nd\nd\n\nv\nr\nv\nr\nv\nr\nv\nr\nv\nr\n(1.6)\nwhere v is the velocity vector and dr is a differential line segment along ABCD. The integrals\nalong BC and DA vanish because the plate is infinitely thin. The integrals along AB and CD\nreduce to\n\n.\na\na\nAB\nCD\na\nU y\ndy\nU ydy\nd\nd\na\ny\na\ny\nydy\nU\na\ny\n\nv\nr\nv\nr\n(1.7)\nThis integral may be evaluated by, for example, making the substitution\n2,\nu\na\ny\ndu\nydy\n\nto obtain\n.\nU a\n\n(1.8)\n\nCurve II\nOne can also integrate along a rectangle that includes the entire half-domain y > 0. This\nrectangle extends to infinity in the +x, +y, and -x directions and coincides with the x-axis. Since\nthe fluid contains no vorticity flux (it is a potential flow, which by definition is irrotational), all\nof the vorticity within curve II is contained in the top half of the plate. Thus, the answer for\ncirculation should be the same as for curve I.\nFigure 4: The desired circulation may also be computed by integrating around the entire top half of the domain. The\nresult for circulation is the same because the flow around the plate is irrotational, and so the entire vorticity flux is\n\"bound into\" the top half of the plate.\nIn this case, the y-components of velocity along the left and right segments of the curve are zero\n(since\nas distance from the plate approaches infinity).\nx\nU\n\nv\ne\nThe circulation becomes\nx\nx\nU dx\nU\ndx\nU\ndx\nx\na\nx\na\n\n(1.9)\nBy symmetry, this integral can be written\nlim\n.\nL\nL\nx\nU\ndx\nU\nx\na\nx\nU a\nx\na\n\n(1.10)\nSince the flow is symmetric about the x-axis, the circulation around the bottom half of the plate\nis equal and opposite to (1.8). Thus the net circulation around the entire plate is zero.\n\nPart (e) (2 points)\nIt was given that the flow is incompressible (and thus barotropic), inviscid, and free of body\nforces. If we ignore any flows induced by the removal of the oar, we can thus apply Kelvin's\nCirculation Theorem and argue that the circulation around the top and bottom halves of the oar is\nconserved, and the strength of both resulting vortices is given by the circulation found in part (d):\n.\nbottom\ntop\nU a\n\n(1.11)\nThe vorticity may be computed from Stokes' Theorem. Consider the bottom vortex, which has\npositive circulation:\nbottom\nz\nz\nA\nU a\ndA\nR\n\n,\n,\n.\nz bottom\nz top\nU a\nR\n\n(1.12)\nPart (f) (2 points)\nSince the vorticity is uniformly distributed in each vortex, the fluid within the vortices is moving\nin solid-body rotation. The velocity field inside the bottom vortex (ignoring flows induced by\nthe top vortex) is given by\n2 .\nz\nU a\nv\nr\nr\nR\n\n(1.13)\nEvaluating at r = R,\n\n.\nU a\nv\nr\nR\nR\n\n(1.14)\nOne can also arrive at this answer by assuming the flow field outside the vortex to be that of an\nirrotational vortex\n\n/ 2\nv\nr\n\n, setting r = R, and using the result from part (e):\n\n.\nU a\nU a\nv\nr\nR\nR\nR\nR\n\n(1.15)\nThe pressure is obtained from applying the Bernoulli equation between a point at infinity (where\nthe fluid is stationary) and the edge of the vortex. Recall that the Bernoulli equation may be\napplied between any two points since the flow outside the vortices is irrotational.\nSince there are no body forces to consider, the Bernoulli equation reads\n\n.\nU a\np r\nR\np\nR\n\n(1.16)\n\nfluid is stagnant\nat infinity in the\nreference\nframe\nlaboratory\np\np r\nR\nv\nr\nR\n\nNote that we are considering each vortex to be isolated from the other, i.e. the velocity field\ninduced by the other vortex is ignored in formulating (1.16); we will justify this assumption later.\nSolving for the desired pressure,\n(1.17)\nPart (g) (1 point)\nIn this part we consider each vortex as an irrotational vortex (i.e., one that can be described by a\nvelocity potential), but now we specifically account for the influence of the other vortex. The\nvelocity field associated with an irrotational vortex is\n,\n.\nU a\nv\nr\nR\nr\nr\n\n(1.18)\nEach vortex will induce the other one to move. Each vortex core moves at a speed given by\nevaluating (1.18) at r = H:\n\n.\nU a\nv\nr\nH\nH\n\n(1.19)\nIn the laboratory reference frame, the vortices propagate to the left. Thus,\nfrom right to left.\nU a\nV\nH\n\n(1.20)\nEquation (1.20) justifies the assumption made in part (f) that the velocity field induced by the\nother vortex may be neglected when computing the tangential velocity at the edge of the vortex\n(r = R). From part (f), the tangential velocity at the edge of the vortex scales as 1/R. Equation\n(1.20) shows that the contribution to the tangential velocity due to the other vortex will scale as\n1/H. Since\n,\nH\nR it is therefore safe to assume that\n\n.\nV\nv\nr\nR\n\nPart (h) (4 points)\nThe unsteady viscous decay of a free vortex was covered in detail on problem set 8. The\ngoverning equation is the Navier-Stokes equation in the -direction, which in our case reduces to\n\n.\nv\nrv\nt\nr r r\n\n(1.21)\nThe necessary assumptions are that the flow is:\n- Axisymmetric\n\n/\n\n- Unaffected by the velocity field due to the other vortex\n- Unidirectional\n\nr\nz\nv\nv\n\nInitial condition: Initially, the flow field is that of an irrotational vortex:\n\n,\n.\nv\nr t\nr\n\n(1.22)\nHere\n2U a\n\nis the circulation around the bottom vortex found in part (e).\nBoundary conditions (valid for t > 0): (1) The velocity is zero in the center of the vortex (similar\nto solid-body rotation), and (2) very far away the velocity field looks like an irrotational vortex\n(because the fluid very far away from the vortex core has not yet felt the influence of viscosity):\n\n0,\n0,\n,\n,\nv\nr\nt\nt\nv\nr\nt\nt\nr\n\n(1.23)\nFollowing the problem statement, introduce the dimensionless velocity and similarity variable\n,\n.\n/ 2\nv\nr\nF\nr\nt\n\n(1.24)\nUsing the chain rule, we can transform the partial derivatives with respect to t and r in (1.21) to\nordinary derivatives with respect to :\n\n,\nd\nd\nr\nt\nt d\nt\nd\n\n.\nd\nd\nr\nr\nr d\nt d\n\nThe left and right-hand sides of equation (1.21) are then rewritten as\n\n,\n.\nv\nr dF\nt\nr\nt d\ndF\nr d F\nrv\nr r\nr\nr\nt d\nt\nt d\n\nThe governing equation (1.21) then becomes\n(1.25)\nr dF\nr d F\nt d\nt d\n\n0.\nd F\ndF\nd\nd\n\n(1.26)\nThe boundary and initial conditions collapse to\n\n0,\n1.\nF\nF\n\n(1.27)\nThe solution can be found by several different methods. Here, we write the characteristic\nequation for the ODE (1.26) as\n\n0, 1.\ns\ns\ns s\ns\n\nThen the general solution is\nFrom (1.27), we have\n(1.28)\nor, in dimensional terms,\n\n.\nF\nA\nBe\n\n1 and thus\nA\nB\n\n,\nF\ne\n\n,\n1 exp\n.\nU a\nr\nv\nr t\nr\nt\n\n(1.29)\nThis result implies that the propagation speed V of the vortices decays with time, according to\n\n1 exp\n.\nU a\nH\nV t\nH\nt\n\n(1.30)\n\n.t\n\nPart (i) (1 point)\nFrom the solution to part (h), it is straightforward to determine the vorticity distribution as a\nfunction of space and time:\n\n,\nexp\nexp\n,\nr\nz\nv\nU a\nU a\nr\nr\nr t\nrv\nr\nr\nr\nt\nt\nt\n\n(1.31)\nThe vorticity has a normal distribution centered at the vortex core with standard deviation .\nNote that the peak value (at r = 0) changes with time. It is convenient to define the length scale\nEven without knowing the solution to (h), one can still make an argument based on previous\nproblems we have considered throughout the course that deal with viscous diffusion of vorticity\n(e.g., Rayleigh problem, boundary layers, etc.). From a similar argument one could conclude\nthat\n~\n.t\n\nPart (j) (3 points)\nThe vorticity distributions will begin to overlap when their characteristic widths are\napproximately equal to H/2. This happens at a characteristic time tc, where\n~\n.\nc\nc\nH\nH\nt\nt\n\n(1.32)\nThe vortex propagation speed scales with the value found in part (g):\n~\n.\nU a\nV\nH\n\n(1.33)\nThen the distance x that the vortices travel before they decay away is roughly the product of V\nand tc:\nc\nH\nU a\nU H\nH\na\nx\nVt\nH\nRe\n\n~\n.\nH\nx\nRe\na\n\n(1.34)\nA Reynolds number clearly emerges from (1.34). This is not surprising, as the Reynolds number\nshould govern the distance that the vortices propagate before they are spread out by viscosity.\nThus, in this case the Reynolds number can be interpreted as a dimensionless propagation\ndistance.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/e0827193f6f799cc371d7eae34c38c69_MIT2_25F13_Quiz1.pdf",
      "content": "2.25 Quiz 1\nFall 2013\n2.25 ADVANCED FLUID MECHANICS\nFall 2013\nQUIZ 1\nTHURSDAY, October 10th, 7:00-9:00 P.M.\nOPEN QUIZ WHEN TOLD AT 7:00 PM\nTHERE ARE TWO PROBLEMS\nOF EQUAL WEIGHT\nPlease answer each question in DIFFERENT books\nYou may use the course textbook (Kundu or Panton), a binder containing your class notes,\nrecitation problems and ONE page of handwritten notes summarizing the key equations.\n\n2.25 Quiz 1\nFall 2013\n\n2.25 Quiz 1\nFall 2013\nQuestion 1: Bernoulli Equation in a Curved Channel\n(a) [1] Provide a brief verbal interpretation of Bernoulli's equation (i) along a streamline, (ii)\nnormal to a streamline.\n(b) [3] Consider a 2-dimensional incompressible, inviscid, steady, irrotational flow. Show\nthat in this case the Bernoulli constant\nis constant everywhere\nthroughout the flow field, not only along a streamline. Consider a Cartesian coordinate\nsystem and let gravity act in the negative y direction.\nA liquid flows steadily along an open channel of rectangular cross section having a uniform\nwidth (ro - ri). Viscous and compressibility effects are negligible. At station (1), where the flow\nenters a circular bend, the depth of the flow is uniformly equal to h1 and the velocity magnitude\nis uniformly equal to v1. We assume that the streamlines are straight and parallel upstream of the\nbend and that in the bend the streamlines are approximately circular arcs having a common\ncenter at the origin, 0. Note that the depth h in the bend will depend on r because the free\nsurface is exposed to the uniform pressure of the atmosphere.\n(c) [2] Show that the velocity in the bend is independent of both θ and z.\n(d) [2] Argue that the Bernoulli constant is the same for all streamlines. Extend this result to\nshow that the velocity in the bend is given by\n(1)\nwhere K is a constant.\n\n2.25 Quiz 1\nFall 2013\n(e) [2] Show that the shape of the liquid's free surface in the bend is given by\n(2)\n(f) [2] Show, by applying an appropriate control volume theorem, that the constant K in (1)\nmust satisfy\n(3)\nFinally, consider steady rigid-body rotation of a viscous liquid at an angular velocity ω:\n(4)\nThe fluid is in a circular bucket and the fluid height in the center (r = 0) is H. The free surface of\nthe liquid is exposed to the uniform pressure of the atmosphere.\n(g) [1] Explain why Bernoulli's equation is applicable to this case, given that the liquid has a\nnonzero viscosity.\n(h) [2] Show that the Bernoulli constant Bsb for this case does not depend on z. Show that Bsb\ndoes depend on r and determine its value for a given r. Explain why Bsb varies in this\ncase.\n\n2.25 Quiz 1\nFall 2013\n2. Flow over a Bump in a River\nA common observation in big rivers or other fast-flowing bodies of water (e.g. during floods) is\nshown in the figures and sketch below. A fast moving stream of water that is steadily flowing\nalong suddenly decelerates and the position of the free surface 'jumps' upwards. After a lot of\nlocal turbulent motion, the flow settles down again but is now steadily moving at a significantly\nslower speed.\nWe will represent the free surface height as h(x) and the velocity by the function u(x). The fluid\nhas constant density ρ and we will treat the problem as one-dimensional. You can assume that\nviscous stresses along the control surfaces of the volume shown above are negligibly small, and\nneglect the density of air.\nPART I:\na) [2 points] consider a streamline drawn (line AB in the figure) just above the smooth flat\nlower surface of the channel. How is the static pressure in the fluid along this line related\nto the height of the river? How does the static pressure vary along the line DEA?\nb) [4 points] Using the control volume shown in the sketch develop two expressions that\nrelate the velocity and height of the stream at station 1 and the velocity and height of the\nstream at station 2. Developing a table of relevant quantities along each face of the\ncontrol volume ABCDEA is highly recommended!\nc) [2 points] Combine your expressions from (a) and (b) together to show that the speed of\nthe river can be simply evaluated from simple measurements of the river height (e.g.\nusing marked yardsticks attached to the channel floor):\nu1 = gh2\n2h1\nh1 + h2\n(\n)\n(1)\nPart II: A deeper question to answer is why is the water moving so fast locally to begin with. To\nanswer this we must consider the topography of the river bed that is upstream of station 1, as\nshown in the drawing below. We denote the height of the fluid stream above the river bed as h(x)\nand the height of the riverbed by b(x):\nd) [1 point] Consider a slice of river dx and show that conservation of mass can be written in\nthe form:\nu(x) dh(x) + h(x) du(x) = 0\n(2)\ndx\ndx\n\n2.25 Quiz 1\nFall 2013\ne) [2 points] As the riverbed elevation rises (or the flow goes over a bump such as a\nsubmerged tree, (or house!) etc.) so that b(x) increases in the flow direction as shown\nwhat should happen to the height of the free surface h(x)? If viscous effects are\nnegligible in this upstream region, use the Bernoulli equation along a streamline at the\nfree surface to obtain an additional differential expression involving U(x), h(x) and b(x).\nf) [2 points] Combine your equations from (d) and (e) to show that the velocity of the river,\nthe height of the surface, and the underlying topography are all inter-related by the\ndifferential equation:\n1 du(x)\ndb(x)\n(u(x)2 - gh(x))+ g\n= 0\n(3)\nu(x) dx\ndx\ng) [2 points] Finally, consider the specific point along the flow direction xm at which the\nriverbed height b(xm ) locally reaches a maximum, so that db dx\n= 0 as shown in the\nxm\nfigure above. Describe very briefly in words happens to the velocity (and sketch the free\nsurface) just beyond this bump in the river for the two different cases given by:\ni) u(xm )2 - gh(xm ) < 0 ?\nand\nii) u(xm )2 - gh(xm ) > 0 ?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Solutions to Quiz 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/92f65cbd9038d2525c61c265527f148e_MIT2_25F13_SolQuiz1.pdf",
      "content": "2.25 - Fluid Mechanics - Fall 2013\nSolutions to quiz 1, problem 1\nPart a (verbal interpretation of Bernoulli's equation)\n- Along a streamline: Bernoulli's equation is essentially a special case of the balance of\nenergy for a moving fluid element. For steady, inviscid, incompressible flow along a\nstreamline, the work done on a fluid element by pressure forces and gravity causes a\nchange in the kinetic energy of the element.\n- Normal to a streamline: This form of Bernoulli's equation is a force balance across\nstreamlines. Fluid elements moving along curved streamlines experience a centripetal\nforce due either to gradients in pressure or gravitational body forces, both of which act\ntoward the local center of curvature.\nPart b (show that B is a true constant for irrotational flow)\nThere are several ways to do this part. Below we show two possible methods.\n\"Standard\" solution: Let the velocity vector\n.\nx\ny\nv\nue\nve\n\nUnder the assumptions we have\nmade, the flow is described by the Euler equations in the x and y directions:\n,\n.\nu\nu\np\nu\nv\nx\ny\nx\nv\nv\np\nu\nv\ng\nx\ny\ny\n\nThe vorticity is zero by definition of an irrotational flow:\n.\nz\nv\nu\nv\nu\ne\nx\ny\nx\ny\n\nSubstituting\n/\n/\nv\nx\nu\ny\n\ninto the Euler equations (and dividing through by )\n,\n.\nu\nv\np\nu\nv\nx\nx\nx\nu\nv\np\nu\nv\ng\ny\ny\ny\n\nNow, consider an infinitesimal displacement vector in an arbitrary direction,\n.\nx\ny\ndr\ndxe\ndye\n\nMultiplying the Euler equations in x and y by dx and dy respectively,\n\n,\n.\nu\nv\np\nu\ndx\nv\ndx\ndx\nx\nx\nx\nu\nv\np\nu\ndy\nv\ndy\ndy\ngdy\ny\ny\ny\n\nAdding these equations gives\n.\nu\nu\nv\nv\np\np\nu\ndx\ndy\nv\ndx\ndy\ndx\ndy\ngdy\nx\ny\nx\ny\nx\ny\ndu\ndv\ndp\n\nSince the terms in parentheses are the total differentials of u, v, and p along\n,\ndr this equation\nbecomes\n,\ndp\nudu\nvdv\ngdy\n\nor\n0.\nu\nv\ndp\nd\nd\ngdy\n\nIntegrating indefinitely, and assuming the flow is incompressible, we obtain Bernoulli's\nequation,\n,\nu\nv\np\ngy\nB\n\nwhere B is a constant. Since we have made no assumptions about the direction of the\ndisplacement vector\n,\ndr we conclude that the constant B must be the same for any\n,\ndr that is, it\nmust be the same everywhere in the flow.\n\"Elegant\" solution:\nUsing the vector identity\n\n/ 2\n,\nv\nv\nv v\nv\nv\n\none can rewrite the general vector\nEuler equation in the form\n\n.\nv\nv\np\ngy\nv\nv\nv\nt\n\nHere v is the velocity magnitude. In this case the right-hand side is identically zero because\nthe flow is irrotational. If we assume a steady flow and integrate the resulting equation, we are\nleft with\nv\np\ngy\nB\n\nThis equation applies everywhere in the flow field; therefore, the Bernoulli constant is the same\neverywhere in an arbitrary inviscid, irrotational (\"potential\") flow.\nPart c (show that velocity is independent of and z)\nThere are several ways to do both parts. Below we show the most straightforward way for each.\nIndependent of : Consider the differential statement of the conservation of mass for this\nsteady, incompressible flow in cylindrical coordinates:\n\n0.\nz\nr\nv\nv\nv\nrv\nr\nr\nr\nz\n\nSince it was given that the streamlines in the bend are circular arcs, this implies that\n0.\nr\nz\nv\nv\n\nThus, the first and third terms vanish, and we are left with\n/\n0.\nv\n\nClearly, this implies that\nvelocity in the bend is independent of . This part is also relatively straightforward to show with\nthe control-volume statement of mass conservation.\nIndependent of z (actually shows independent of as well): Consider Euler's equation in z:\n\n0.\np\ngz\nz\n\nIntegrating this equation gives\n,\np\ngz\nC\nf r\n\nwhere C is a constant. Noting that\n\nat\n,\natm\np\np\nz\nh r\n\nwe see that at any value of r,\n.\natm\np\ngz\np\ngh r\n\nWe can substitute this result into Bernoulli's equation normal to a streamline in the bend (which\nis really Euler's equation in the r direction):\n\n.\natm\nv\np\ngz\np\ngh r\nr\nr\nr\n\nSimplifying,\n.\ndh\nv\nrg dr\n\nThis equation depends on r only, thus v does not depend on z or .\nPart d (argue that the Bernoulli constant is the same for all streamlines; show that vr=K)\nThe key to this part is to recognize that under the assumptions we have made, any streamline in\nthe bend originates somewhere in the inlet, where the velocity is uniform (station 1).\nIf we apply the z-direction Euler equation to the inlet, we can write the Bernoulli constant in the\nentire inlet region as\ninlet\natm\nB\nv\np\ngh\n\nsince the fluid height at the inlet is equal to h1 everywhere. Since all streamlines in the bend\noriginate at the inlet, and since B is constant along a streamline by definition, the value of B for\nany streamline is equal to Binlet:\n.\natm\ninlet\nbend\nv\nv\np\ngz\np\ngh\nB\n\nThus, the Bernoulli constant is the same for all streamlines in this flow.\nThere are many ways to determine the velocity profile. One possible way is to take the radial\nderivative of the Bernoulli equation along a streamline to obtain:\n\n,\nv\nv\nv\nB\np\ngz\np\ngz\nv\nr\nr\nr\nr\nr\n\nwhere\n/\nB\nr\n\nbecause B is constant everywhere in the flow. We also know from Bernoulli's\nequation in the radial direction that\n\n.\nv\np\ngz\nr\nr\n\nThus we can set\n.\nv\nv\nv\nr\nr\n\nSimplifying and rearranging,\n\n,\nC\nv r\ne\nK\n\nln\nln\n0.\ndv\ndr\nd\nv\nd\nr\nv\nr\n\nIntegrating,\n\nln\nln\n,\nv\nr\nC\n\nwhere C is a constant of integration. Exponentiating both sides,\nwhere K is another constant.\nPart e (derive the shape of the free surface in the bend)\nConsider a streamline along the free surface extending from the inlet to somewhere in the bend.\nBernoulli's equation along this streamline is\n\n.\ninlet\natm\natm\nv\nv\nB\nB\np\ngh\np\ngh r\n\nEquation (24) is valid for any streamline (i.e., at any value of r or z) because B is the same for all\nstreamlines. Simplifying,\n\n/\n.\nK r\nv\nv\ngh\ngh r\ngh r\n\nSolving for h,\n\n2 .\nv\nK\nh r\nh\ng\ngr\n\nPart f (derive a condition on K from a control-volume theorem)\nConsider a control volume that surrounds the liquid in the bend, from the inlet to some arbitrary\ncross section in the bend. Applying form A of the control-volume statement of conservation of\nmass,\n\n0.\n0, steady\nc\nCV\nCS\nd\ndV\nv\nv\nndA\ndt\n\nNoting that the control surface is not moving (\ncv\n), the flux integral over the inlet is\n\n1 1\no\ni\nInlet\nv ndA\nv h r\nr\n\nand at the outlet (which is at an arbitrary cross-section in the bend) it is\n\n.\no\ni\nr\nr\nOutlet\nv ndA\nv\nr h r dr\n\nThus the conservation of mass equation becomes\n\n1 1\n\nln\no\ni\no\no\ni\ni\nr\no\ni\nr\nr\nr\nr\nr\no\ni\ni\no\nv\nK\nK\nv h r\nr\nh\ndr\nr\ng\ngr\nv\ndr\nK\ndr\nKh\ngh\nr\ng\nr\nr\nv\nK\nKh\ngh\nr\ng\nr\nr\n\nThus, the constraint on K is\n\n1 1\nln\n.\no\ni\no\ni\ni\ni\no\nr\nr\nv\nK\nv h r\nr\nKh\ngh\nr\ngr\nr\n\nPart g (explain why Bernoulli is valid for rigid-body rotation)\nAlthough the fluid is viscous, there is no viscous stress in steady rigid-body rotation since there\nis no relative motion between fluid elements, by definition. Thus, there are no viscous losses to\nconsider. Since the flow is also incompressible, steady, and without energy input, Bernoulli's\nequation may be applied along a streamline.\nIf one wishes to make a more rigorous argument, one can look at the velocity gradient tensor,\nAll components of this tensor vanish except for two:\n.v\n\n.\nr\nr\nr\nv\nv\nv\nr\nr\nr\nv\nv\nv\nv\nr\nr\nr\n\nThe symmetric (deformation) tensor then reads\n\n.\nT\ne\nv\nv\n\n.\nsb\natm\nr\nB\np\ngh r\n\nAs expected, fluid elements experience no deformation, only pure rotation. Thus, if we wish to\ncalculate the viscous stress tensor, e.g.\n2 e\n\nfor a Newtonian fluid, we see that there is no\nviscous stress in the flow (at steady state) regardless of how viscous the fluid is. Thus, there are\nno viscous losses, and Bernoulli's equation is applicable.\nPart h (show that the Bernoulli constant does not depend on z; show that it does depend on r and\ndetermine its value for a given r; explain why it varies in this case)\nThe Bernoulli equation for this case is\n.\nsb\nv\nr\np\ngz\np\ngz\nB\nconst\n\nAgain, we can integrate Euler's equation in the z direction to find\n\n.\natm\np\ngz\np\ngz\np\ngh r\nz\n\nHere h(r) is the concave, parabolic shape for the free surface that we derived in class for rigid-\nbody rotation. Substituting this relation into the Bernoulli equation,\nThis shows both that the Bernoulli constant does not depend on z and that it does depend on r.\nThis equation is an acceptable final answer for the Bernoulli constant, but one can also substitute\nthe height profile from the class notes (not required for credit) to obtain\n2.\nsb\natm\natm\nr\nr\nB\np\ng H\np\ngH\nr\ng\n\nSince the flow is rotational, the Bernoulli constant is not the same everywhere in the flow field,\nand varies across streamlines as indicated above.\nInterpretation\nRecall that the Bernoulli constant B is roughly a measure of the total energy of a fluid element.\nAs one looks outward in r, the fluid elements are moving faster and thus have greater kinetic\nenergy. Thus it makes sense that the total energy of fluid elements increases as r increases, i.e.\nthat B varies with r.\nLater in the class, we will show that B is actually constant along both streamlines and vortex\nlines. In this flow, the vortex lines point in the z direction, so it makes sense that the Bernoulli\nconstant does not depend on z.\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nSolution to Problem 2-Quiz 1 2013\nPart I:\n(a):\nThe pressure distribution on line AB follows the hydrostatic rule. It is true that the flow is\nnot static but by picking an arbitrary control volume at any point on line AB (green dashed\ncontrol volume in Figure 1) one can see that the balance of forces in the y-direction will tell\nus that the difference between the pressure at the bottom and the ambient pressure should\nbalance the weight of the liquid inside the control volume. This simply implies that the static\npressure on line AB should be equal to Pa + ρgh(x). This result is shown in Figure 1.\n\nh2\nP - Pa\nρgh2\nρgh1\nx\nFigure 1: Pressure distribution on line AB.\nThe pressure distribution on line DEA also follows the hydrostatic change merely due to the\nfact that there is no curvature in the streamlines as one integrates the Euler equation normal to\nthem and thus the only change in pressure when one moves from E to A will be the hydrostatic\npart. Ignoring the density of air one can see that the pressure is constant from D to E and\nthen start to grow linearly with height as we move from E to A. The result is shown in Figure\n2.\ny\nu1\nh1\nu2\n\nx\nxA\nxB\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\ny\n\nyD\nyE\nyA\nx\nFigure 2: Pressure distribution on line DEA.\n(b) and (c):\nThe selected control volume is shown in Figure 3 (dashed green line). One can subtract the\nambient pressure from the entire problem and knowing that the net effect of uniform Pa acting\non the control volume is zero then there will be no change in the problem analysis if we only\ndeal with gauge pressures (P (x, y) - Pa).\n\nρgh1\nP - Pa\nu1\nh1\n\ny\nu2\nu1\nh1\nh2\n\nρgh1\nρgh2\nP2(y)\nP1(y)\ny\nx\nFigure 3: A schematic of the selected control volume for the hydraulic jump problem.\nTable 1 summarizes all the important parameters acting on different control surfaces for the\nselected control volume:\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nTable 1: Bookkeeping of all the related properties at different control surfaces in the control\nvolume.\nn\nv\nvc\n(v - vc).n\nA\nP - Pa\nAD\n-ex\nu1ex\n-u1\nh1W\nρgy\nAB\n-ey\n?ex\n?\nρgh(x)\nBC\nex\nu2ex\nu2\nh2W\nρgy\nCD\ney\n?\nNow we can start by writing the conservation rules using the RTT. It is important to notice\nthat due to the turbulent mixing happening in the region of the hydraulic jump, energy will\nnot be conserved and thus either applying the conservation of energy or the Bernoulli equation\nwill not be the right approach. If we write the conservation of mass for the selected control\nvolume then we will have:\n\nd\nC.O.Mass: 0 =\nρdV +\nρ(v - vc).ndA\ndt\nc.v.\nc.s.\nKnowing that the problem is steady state and using the tabulated quantities, conservation of\nmass can be simplified to:\nρu1h1 = ρu2h2 ⇒\n(1)\nu1h1 = u2h2\nThe conservation of linear momentum in the x direction can also be written in the RTT form:\n\nd\nC.O.Momentum:\nFx =\nρvxdV +\nρvx(v - vc).ndA\nW\ndt\nc.v.\nc.s.\nwhere W is the width into the page.\nThe net of external forces acting in the x-direction on the control volume neglecting the wall\nshear effect is a result of pressure forces acting on the AD and BC control surfaces:\n\nh1\nh2\nh2\nh2\nFx =\n(P - Pa)dy -\n(P - Pa)dy =\nρgydy -\nρgydy = ρg\n-\nW\nAD\nBC\nThe right hand side of the RTT for the conservation of linear momentum can also be simplified\nto (knowing that the problem is steady and using the tabulated identities):\nR.H.S. of RTT for C.O. Momentum= ρu2\n2h2 - ρu2\n1h1\nthus the conservation of linear momentum implies that:\n\nh2\nh2\ng\n\nh2\n1 - h2\nρg\n-\n= ρu2\n2h2 - ρu2\n1h1 ⇒\n= u\n(2)\n2h2 - u1h1\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nusing the result from conservation of mass (equation (1)) one can eliminate u2 from equation\n(2) to give:\n\ng\ngh2\nh2\n1 - h2 = h1u1 (h1/h2 - 1) ⇒ u1 =\n(h1 + h2)\n(3)\n2h1\nwhere we have used the identity h2\n1 - h2\n2 = (h1 - h2)(h1 + h2).\nPart II:\n(d):\nFor the selected control volume (Figure 4) one can easily write the conservation of mass using\nTaylor series to obtain expressions for u(x + Δx) and h(x + Δx):\ndu\ndh\nu(x)h(x) = u(x + Δx)h(x + Δx) → u(x)h(x) = (u(x) +\nΔx)(h(x) +\nΔx)\ndx\ndx\nwhich after ignoring the second order terms such (Δx2) it can be rewritten as:\ndh\ndu\ndh\ndu\nΔx\nu(x)\n+ h(x)\n= 0 ⇒ u\n+ h\n= 0\n(4)\ndx\ndx\ndx\ndx\nAnother way to reach the same result is to say that since the flow is incompressible then the\nvolumetric flow rate should remain unchanged thus d(uh)/dx = 0 which will lead to the same\nresult we just derived in equation (4).\n∆ x\nh(x0 )\nh(x0 + ∆ x)\nu(x0 + ∆ x)\nu(x0 )\nFigure 4: An arbitrary control volume selected to derive the conservation of mass in the\ndifferential form.\n(e) and (f):\nOne plausible answer is that h(x) decreases since the flow starts to accelerate as it reaches the\nbump and thus due to conservation of mass hu = const. the value of h should decrease (Figure\n5(b)). It is also easy to show that the case of h remaining constant (Figure 5(c)) will be wrong\nsince in that case at constant velocity we are gaining height which is similar to generating po\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\ntential energy from nowhere and is thus unphysical1 . For further explanations see the appendix.\nx\ny\nO\nh(x)\nb(x)\n\nb(xm )\n\ny\nO\nh(x) = const.\nb(x)\nb(xm )\nx\ny\nO\nh(x) is decreasing\nb(x)\nb(xm )\n\nx\nFigure 5: (a) Flow approaching the bump (b) The case for low speed flows in which Fr1 < 1\n(c) The non-physical case in which h remains constant.\nSince the incoming flow is smooth and has not undergone tany mixing and also viscous\neffects are negligible we can think of writing Bernoulli equation on a streamline very close to\nthe water surface:\n[\n]\nd\nPa +\nρu(x)2 + ρg(h(x)+ b(x)) = const. →\nPa + ρu(x)2 + ρg(h(x) + b(x)) = const.\n= 0\ndx\nwhich can be simplified to:\ndu\ndh\ndb\nu(x)\n+ g\n+ g\n= 0\n(5)\ndx\ndx\ndx\nFrom conservation of mass (equation (4)) we have:\ndh\ndu\ndh\nh(x) du(x)\nu\n+ h\n= 0 ⇒\n= -\n(6)\ndx\ndx\ndx\nu(x) dx\nThe mentioned argument holds for cases in which the incoming kinetic energy of the flow before the bump\nis small compared to the potential energy of the fluid (i.e. u1\n2 < gh1 or Fr1 < 1). If the initial flow has a high\nkinetic energy compared to its potential energy (i.e. u1\n2 > gh1 or Fr1 > 1) then it is possible to see a different\nsolution in which h(x) does increase as the liquid goes over the bump. Later in the solution we will see that\ncombining the conservation of mass and Bernoulli equation it can be shown that: dh/dx = db/dx(Fr2 - 1)-1\nand consequently the rise or decrease in h(x) depends on the Froude number of the entering flow (Fr1).\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nplugging the result from (6) into (5) will give the following result:\n1 du(x) [\n]\ndb(x)\nu(x 2) - gh(x) + g\n= 0\n(7)\nu(x) dx\ndx\n+\n(g): As the flow reaches xm, the slope db/dx becomes zero. Slightly after the bump (x ) we\nm\n+\nwill have a negative value for db/dx (i.e. db/dx < 0 at x ) and thus the sign of the quantity\nm\n[\n]\ndu/dx depends on the value of the quantity u(x)2 - gh(x) . Using equation (7) one can see\n+\nthat it means that at x\nwe will have the following:\nm\n1 du [\n]\nu 2 - gh |\nu(x) dx\n> 0\n+\nm\nx\n)2 - gh(x\n+\n+\nthus depending on the sign of u(x\n) there will be two situations:\nm\nm\n(i):\n\n1 du\n:\nm\n\n+\n[\n]\nu2 - gh\n< 0 ⇒ at x\n< 0\n\nu(x) dx\n+\nm\nx\nwhich means that the flow will decelerate after the bump and with decrease in velocity the\nheight will increase due to the conservation of mass, equation (6) as shown in figure 6(a).\n(ii):\n\n1 du\n+\n[\n]\nu2 - gh\n> 0 ⇒ at x\n> 0\n:\n\nm\nu(x) dx\n+\nm\nx\nwhich means that the flow will accelerate after the bump and with the increase in velocity the\nheight will decrease due to the conservation of mass (Figure 6(b)). This will lead to a state that\nis called a \"super-critical\" flow (Fr > 1) and slightly after the bump the viscous effects become\nimportant since the speed is increasing and the height is decreasing (remember that γ ∼ v/h)\nand the flow ultimately reaches a point at which it has no more kinetic energy to continue its\nacceleration into the super-critical zone. As a result, hydraulic jump will occur with a lot of\nturbulent energy dissipation and the flow returns into a sub-critical stage (Fr < 1). Figure\n6(b) shows a sketch of this flow.\nSolution by B.K. and G.H.M., 2013\n\nx\ny\nO\n\n2.25 Advanced Fluid Mechanics\nFall 2013\ny\nO\nh(x) is decreasing\nb(x)\nb(xm )\nx\n\nb(xm )\n\nFigure 6: (a) Physical image for the (i) case. (b) Physical image for the (ii) case.\n(extra additional part of the problem:)\nFrom equation (7) we have the following:\n1 du(x) [\n]\ndb(x)\nu(x 2) - gh(x) + g\n= 0\nu(x) dx\ndx\nusing the following:\ndu(x)\ndu h(x)\n1 d(u2(x))\ndu\n1 d(u2(x))\nd\nu(x)\n- g\n=\n- gQ\n=\n+ gQ\ndx\ndx u(x)\ndx\nu2(x) dx\ndx\ndx\nu(x)\nwe can expand equation (7) into:\n1 d(u2(x))\nd\ndb(x)\n+ gQ\n+ g\n= 0\n(8)\ndx\ndx\nu(x)\ndx\nIntegrating equation (8) from point 1 to point 2 (far after the bump at which point the surface\nbecomes flat again, b(x) = 0) will give the following:\nu(x)2 + gQ\n+ gb(x) = const. → u1 + gQ\n= u2 + gQ\n(9)\nu(x)\nu1\nu2\nEquation (9) is nothing but a reformulation of Bernoulli equation or conservation of energy\nbetween any two arbitrary points on the water surface. Looking at equation (9) it is easy to\nsee that one possible solution is u2 = u1 which is the case (i) studied in the previous part. Also\nit is worthy to mention that there is another root which satisfies the following:\ngQ = u1u2(u1 +u2) → u1 +gQ\n= u1 + (u2u1 +u2) = u2 + (u2u1 +u1) = u2 +gQ\nu1\nu2\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nThis second solution or root happens in the case in which the flow is sub-critical before the\nbump, becomes critical at the bump point and then becomes super-critical after the bump.\nUsing the definition of the Froude number (Fr ≡ u2/gh) one can manipulate the derived result\nin equation (9) in the following way (using the hint that Fr = u3/gQ):\ngQ\ngQ\nu1u2(\n+ u =\n+ u2) → u2(gQ + u1) = u1(gQ + u2)\nu1\n2 1\nu2\nu2\nu1\n→\n(1 + Fr1) =\n(1 + Fr2) → (gQFr2)1/3(1 + Fr1) = (gQFr1)1/3(1 + Fr2)\ngQ\ngQ\n1/3\n1/3\n1/3\n1/3\n1/3\n1/3\n1/3\n1/3\n2/3\n2/3\n→2Fr\n+ Fr\nFr1 = 2Fr\n+ Fr\nFr2 → 2(Fr\n- Fr\n) = Fr\nFr\n(Fr\n- Fr\n)\n(\n)\n1/3\n1/3\n1/3\n1/3\n⇒ 2 = Fr\nFr\nFr\n+ Fr\n(10)\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nAppendix:\nThe flow that has just been studied in this problem is a well known subject in the hydraulic\nliterature. It is worthwhile to mention a few words about different physical aspects of these\nflows which are generally named \"open channel flows\" in hydraulics. One way to study these\nproblems is to introduce two identities called the \"specific energy head\" (E) and \"momentum\nof the flow\" (M):\n1 q2\nE ≡\n+ h =\nu + h\n2 gh2\n2g\n(11)\nq2\nh2\nM ≡\n+\ngh\nknowing that q ≡ uh one can easily see that E is the total specific energy and has similari\nties to Bernoulli constant whereas M is the linear momentum of the flow and when defined\nin this way will have dimensions of length squared. At a constant flow rate (q) one can plot\nthe relationship between h and E (Figure 7) or h and M (Figure 8) using the relationships in\nequation (11). One can easily see that in both equations dE/dh and dM/dh will be zero at\na critical height hc = (q2/g)1/3 . It is also possible to show that at h = hc the local Froude\nnumber which is defined as Fr ≡ u2/gh becomes equal to 1 and in fact another way to define\nthe Froude number is to define it as the ratio of local height (h) over the critical height (hc)\n(i.e. Fr ≡ h/hc). Based on this we can categorize open channel flows in three different types:\n- Sub-critical flow in which the Froude number is lower than one and the flow is dominated\nby gravity rather than inertia. This is a characteristic for low speed, deep river flows.\n- Critical flow in which the Froude number is one and the inertia and gravity are equally\nimportant.\n- Super-critical flow in which the Froude number is higher than one and inertia dominates\nover the gravity.\nLooking to Figures (7) and (8) it is worthwhile to notice that at a constant flow rate for any\ngiven specific energy (E) or momentum (M) value there are two possible heights: one in the\nsub-critical zone and the other one in the super-critical zone. Also it is noteworthy that for\nspecific energies lower than the value at Ec at hc there is no possible physical solution.\nOne benefit of these diagrams is enabling us to find solutions for hydraulics problems just by\nvisual inspection of the curves. For example in the bump problem we know that the Bernoulli\nequation between points on the free surface is equivalent to:\nu1 + gh1 = u2 + gh2 + gb(x) → g(E1) = g(E2 + b(x)) ⇒\nE2 =\nE1 -\nb(x)\n(12)\nhc\nhc\nhc\nwhere b(x) is the height of the bed of the river.\nWhat equation (12) is showing is the fact that knowing the value of E1 we can easily find the\nsolution for E2 and h2 by following the constant q curve and subtracting the b(x) from the\nvalue of E1 (Figure 9).\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nh/hc\n\nFr < 1\nFr = 1\nFr > 1\nE/hc\nFigure 7: The specific energy (E)-height (h) diagram for a flow with constant flow rate. In\nwhich hc is defined as (q2/g)1/3 .\nh/hc\n\nFr < 1\nFr = 1\nFr > 1\nM/h2\nc\nFigure 8: The momentum of the flow (M)-height (h) diagram for a flow with constant flow\nrate. In which hc is defined as (q2/g)1/3 .\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nh/hc\n\nb(x)/hc\nE/hc\nFigure 9: Solution to the bump problem using the constant q curve in the specific energy-\nheight diagram. The green points show the sub-critical solution while the red points show the\nsuper-critical solution.\nUsing the visual solution from Figure 9 one can easily detect that there are two possible\nbranches of solution for the flow over a bump based on the initial Froude number. The sub-\ncritical solution (Fr < 1) predicts that as the flow goes over the bump the value of h will\ndecrease and the flow will speed up while the super-critical solution (Fr > 1) predicts the\nopposite. If the flow starts from sub-critical branch in the upstream as it reaches the bump\nit is possible to become very close to the critical point in the specific energy-height diagram\n(Figure 10(b)) but right after the bump with decrease in b(x) it will return to the original point\nand thus all through the process the flow will remain sub-critical. The solution for the change\nin height of the flow over the bump for this case is shown in Figure 10(a).\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n\ni\ni\ni\ni\n\n[h(x) + b(x)]/hc\n\n(x - xm)/hc\nb(xm)/hc < 1\nh/hc\n\nE/hc\nFigure 10: Flow over the bump. Sub-critical solution for the entire flow.\nIf the bump is high enough then it is possible that the flow initially is sub-critical but as it passes\nover the bump (where x = xm and db/dx = 0) it becomes critical and with a small perturbation\nafter (x = xm) the solution will follow the super-critical branch (Figure 11 (b)). This means that\nbefore the bump h(x) will decrease as it reaches the bump and after xm this decrease will con\ntinue since the flow has become super-critical (Figure 11). In most hydraulics labs the transition\nfrom sub-critical to critical and super-critical flow is demonstrated in a water tank experiment of\nthe flow over the bump (link on youtube: http://www.youtube.com/watch?v=cRnIsqSTX7Q).\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n\ni\ni\ni\ni\n\n[h(x) + b(x)]/hc\n\n(x - xm)/hc\nb(xm)/hc = 1\nh/hc\n\nE/hc\nFigure 11: Flow over the bump. Sub-critical solution for the flow before the bump, critical at\nxm and super-critical after the bump.\nAnother possibility is to have an upstream flow that is already in the super-critical regime.\nThe flow this time stays entirely on the super-critical branch of the solution (Figure 12). This\ntime the height initially increases and after xm it starts to decrease back to the original height.\nAchieving this flow in the lab is not easy since a hydraulic jump can easily occur either before\nor after the bump.\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n[h(x) + b(x)]/hc\n\n(x - xm)/hc\nE/hc\n\nb(xm)/hc < 1\nFigure 12: Flow over the bump. Super-critical solution for the entire flow.\nIt is also important to notice that although the application of specific energy-height diagrams is\nquite useful in the case of the flow over the bump, special caution should be taken in interpreting\nthe diagram. As we saw in this problem the hydraulic jump does not conserve the total energy\n(but in fact dissipates a lot). The conserved identity is the linear momentum. Thus a good\napproach would be to find the point on the super-critical branch before the jump and find a\ncorresponding point on the sub-critical branch with an equal value of momentum and see where\nthis new point sits on the energy diagram (as shown in Figure 13). It is noticeable that the\njump will lead to a considerable drop of the energy head due to viscous dissipation involved in\nthe jump region.\n\ni\ni\ni\ni\n\nh/hc\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nh/hc\nΔE/hc\n\nE/hc\nh/hc\nh = h1\nh = h2\n\nM/h2\nc\nFigure 13: (a) Blue curve showing h/hc as a function of E/hc for constant flow rate. (b) Red\ncurve showing h/hc as a function of M/h2\nc for constant flow rate. The flow starts at point\n1 on each curve and after the hydraulic jump transitions to point 2 for downstream of the\njump.\nSolution by B.K. and G.H.M., 2013\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/43300acaaacfe5bc552f1c7632185ccc_MIT2_25F13_Quiz2.pdf",
      "content": "2.25 Quiz 2\nFall 2013\n2.25 ADVANCED FLUID MECHANICS\nFall 2013\nQUIZ 2\nTHURSDAY, November 14th, 7:00-9:00 P.M.\nOPEN QUIZ WHEN TOLD AT 7:00 PM\nTHERE ARE TWO PROBLEMS\nOF EQUAL WEIGHT\nPlease answer each question in DIFFERENT books\nYou may use the course textbook (Kundu or Panton), a binder containing your class notes,\nrecitation problems and TWO pages of handwritten notes summarizing the key equations.\n\n2.25 Quiz 2\nFall 2013\n\n2.25 Quiz 2\nFall 2013\nQuestion 1: Electro-osmotic flow in a capillary tube\nMicrofluidics concerns fluid flows whose characteristic length scale is on the order of\nmicrometers. One commonly used method for driving flows in micro-devices is to use electro-\nosmotic flow (EOF), which exploits the fact that the walls enclosing the flow typically possess an\nelectric charge, and involves applying an electric field along a microfluidic channel. For this\nproblem, the only thing you need to know about EOF is that, under typical conditions, it results\nin a uniform velocity profile. That is, the no-slip condition is not valid at the walls, and the fluid\nvelocity resulting from EOF does not vary transverse to the flow direction.\nIt is important, but not always straightforward, to be able to measure the EOF-driven flow rate in\nmicrochannels. One apparatus to do this is depicted in the figure above. A small, cylindrical\n\"capillary tube\" with diameter Dc and length Lc connects two wells. The wells and capillary tube\nare filled with an aqueous solution having density ρ and viscosity μ. An electric field pointing\nfrom right to left drives EOF in the same direction at a uniform velocity veo. The right well is\nopen to the atmosphere and the left well is connected to a needle having diameter Dn and length\nLn. The needle feeds into a microsyringe with a smaller diameter Dm, which is open to the\natmosphere. Lm is the length of the microsyringe that is filled with fluid. The entire system is\nkept horizontal to eliminate the effects of gravity.\nAs fluid accumulates in the left well, over time a pressure difference builds up between\nthe two wells that drives fluid from left to right. This \"back-flow\" has an average velocity given\nby\nAt the same time, fluid is driven upward into the needle and microsyringe, where the\naverage velocities are\nrespectively.\nIn the following, neglect the effects of surface tension (i.e. assume the meniscus at the\nair/liquid interface in the microsyringe is perfectly horizontal) and assume steady, fully\ndeveloped, incompressible flow everywhere in the capillary tube.\n(a) [2 points] Show that the velocities in the capillary tube, needle, and microsyringe are\nrelated by\n(1)\n(b) [3 points] Determine the velocity profile in the capillary tube at a point near the middle of\nthe tube (far from either end), in terms of an unknown pressure gradient and\nClearly\n\n2.25 Quiz 2\nFall 2013\nlist your assumptions and boundary conditions. Sketch the velocity profile for two\ndifferent magnitudes of the pressure gradient (you don't need to specify the values - just\none stronger, one weaker).\n(c) [2 points] Neglecting entrance effects at the junction between any two pieces of the\ndevice, show that\n(2)\nThe utility of this experimental setup is that it enables one to indirectly measure the electro-\nosmotic velocity by directly measuring the average meniscus velocity\nand using\nmathematical manipulations of (1) and (2) to convert this result to veo.\nis relatively easy to\nmeasure by fixing a camera on the microsyringe and tracking the position of the meniscus over\ntime.\n(d) [1 point] Show that the needle and microsyringe can be lumped together as a single tube\nwith average fluid velocity\nand diameter Dm if we assume its effective length is\n(e) [3 points] Show that the electro-osmotic velocity is related to the average meniscus\nvelocity and the average pressure-driven back-flow velocity by\n(3)\n(4)\n(f) [2 points] Determine the maximum pressure difference that the capillary can support, in\nterms of the electro-osmotic flow velocity veo.\n(g) [2 points] How does the meniscus height scale with time at short times? That is, find n in\nthe expression\nAssume here that the situation is quasi-steady, i.e. that\neverything you have derived above for the steady case is still valid. There is no need to\nuse the unsteady momentum or the unsteady Bernoulli equation.\n\nll\n\n-\n\n2.25 Quiz 2\nFall 2013\nQuestion 2: Flow of Paint in a 'Bell Atomizer'\nMotor &\nRotating Be\nDuring modern car production, the application of paint is carried out robotically. A computer-\ncontrolled robot arm is programmed to uniformly apply paint to all of the internal and external\nsurfaces with a minimum of \"overspray\". This requires a unique nozzle that can handle large\nvolumes of paints of a range of viscosities without clogging or blocking. The dominant\ntechnology has become the\nRotating\nBell\nMotor\nSpray\npainted part\nrotary bell atomizer shown in the Figure below.\nRobot Arm\n\"Bell Cup\"\nViscous liquid of viscosity μ, density ρ\nand surface tension σ is ejected through\na hole (at the center of the axis of\nrotation and at a constant volumetric\nflow rate Q) onto a smooth conical\nsurface or \"bell\" (with angle θ0 < 1) that\nis rapidly rotating at a constant angular\nvelocity Ω . We describe the flow in a\nspherical\npolar\ncoordinate\nsystem\n{r,θ,φ}\n(see\nfigure\nopposite).\nCentrifugal force holds the fluid film\nagainst the wall of the \"bell\" and drives\nthe fluid radially outwards towards the exit lip at r = R. The fluid film thickness h(r) is always\nvery thin compared to the effective radius of the cup ξ = r sinθ0 at each point throughout the\ndevice and forms a thin and very uniform coating by the time it reaches the exit of the applicator.\nWe will represent the free surface height as h(r) and the radial velocity by the function vr (r,θ ) .\nYou can neglect the density and viscosity of air as well as the effects of gravitational acceleration\nand pressure gradients in the film (these are both overwhelmed by the centripetal acceleration of\nthe fluid in the rapidly spinning bell).\na) [3 points] This is a complicated problem with many possible control parameters for a plant\noperator, or robot path planner or paint formulator to vary. A common language is needed\nto prepare suitable applicator charts and design new bell applicators. This can best be done\nusing the tools of dimensional analysis. Identify the appropriate dimensionless groups that\ncontrol the thickness hR of the paint film at the exit of the applicator (r = R). Select both\n-\n\n2.25 Quiz 2\nFall 2013\nthe density and surface tension of the paint as two of your primary variables.\nb) [2 points] Write down the conservation of mass in spherical polar coordinates and show\nthat a velocity vector v = [vr (r,θ ), vθ (r,θ ), Ωr sinθ0] consisting of a two-dimensional\naxisymmetric velocity profile in the film, combined with a constant angular velocity\nthroughout the film (at each value of r) vφ = Ωr sinθ0 is able to satisfy the continuity\nequation. Make a scaling argument to determine if vθ is small or large compared to vr ?\nc) [4 points] Now consider the radial component of the conservation of momentum equation\nfor the paint film on the rapidly-spinning conical applicator shown in the figure above.\nBecause the layer is 'thin' (so that the value of θ doesn't vary much), it can be argued that\nit is valid to simplify the angular dependence of the radial velocity component, so that\nsinθ ≈ sinθ0 everywhere. Show that the radial component of the equation of motion can\nbe simplified to the following form for a very viscous thin film of paint:\n1 ∂2 vr\nρΩ2r sin2 θ0 ≈ 0\n(2.1)\nr2 ∂θ 2 +\nμ\nGive three appropriate constraints that identify when this approximation is valid.\nd) [1 point] Give appropriate boundary conditions at the free surface between the paint and\nthe air and at the rigid wall between the cup and the paint.\n[Hint: To do this, it is easiest to sit in the rapidly and steady rotating frame of the cup\nwith angular velocity vφ r sinθ0 = Ω ; you can then focus just on the radial\n(outwards) velocity towards the edge of the bell].\ne) [2 points] Find an expression for the radial velocity profile in the fluid film.\n[Hint: you may find it useful to define a new coordinate as shown in the figure with\ny = r sin (θ0 -θ ) and also recall that the function sin x ≈ x + O(x3) for x << 1.\nf) [2 points] Integrate your expression for the velocity field through each small annular slice\nof area dA = 2π (r sinθ0)dy to show that the constant volume flow rate Q of paint and the\nthickness h(r) of the paint film are related by the expression\n1/3\n⎛\n3μQ\n⎞\nh(r) =\n(2.2)\n⎝⎜ 2πρΩ2r2 sin3θ0 ⎠⎟\ng) [1 point] In the laboratory reference frame, fluid streamlines and particle pathlines actually\nfollow spiral trajectories as the paint flows outwards of the conical bell cup, because of the\ncombined radial and azimuthal (i.e. rotational) flow components. Use the definition of a\nstreamline to show that the expression for the spiral trajectory of a material point rs (φ)\n(such as a small bubble or particle) that is on the paint surface is given by:\ndrs\n-1/3\n= Ars\n(2.3)\ndφ\nand give an expression for the constant A.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Solutions to Quiz 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-25-advanced-fluid-mechanics-fall-2013/c17a44106364b3650c19b4c9a579d0c5_MIT2_25F13_SolQuiz2.pdf",
      "content": "Part (a) (2 points)\nConsider the two control volumes shown above. Steady mass conservation in CV1 gives:\ncapillary\nneedle\ndA\ndA\n\nv n\nv n\n\n.\nc\nn\neo\nb\nn\nD\nD\nv\nv\nv\n\n(1.1)\n(1.2)\nSimilarly, in CV2:\nneedle\nsyringe\ndA\ndA\n\nv n\nv n\n.\nn\nm\nn\nm\nD\nD\nv\nv\n\nNote that all of the storage terms\n\n/\nd dt\ndV\n\nvanish because the flow is steady. Setting\n(1.3)\n(1.4)\n(1.2) and (1.4) equal and simplifying,\n\n2.\neo\nb\nc\nn\nn\nm\nm\nv\nv\nD\nv D\nv D\n\n(1.5)\n\n/\n0.\n\nPart (b) (3 points)\nAssumptions\n-\nThe problem statement provided the assumptions of steady, fully developed, and\nincompressible flow in the capillary tube. Thus all\n/\nt\n\nand\n/\n0, except\n/\n0.\nz\np\nz\n\n-\nAssume the flow is axisymmetric, so that all\n-\nAssume the flow is unidirectional (no r or component), and postulate a solution of the\nform\n\n.\nzv\nr\n\nv\nFollowing the figure in part (a), let us use cylindrical coordinates with z increasing from left to\nright. The Navier-Stokes equation (z component) is\nUnder the assumptions we've made, the equation becomes\nConstant.\nz\ndv\nd\np\nr\nr dr\ndr\nz\n\n(1.7)\nBoundary conditions\nThe general solution is obtained by rearranging (1.7) and integrating twice:\n1. Centerline (r = 0): either\n/\nz\ndv\ndr\nor\nis finite.\nzv\n2. Wall (\n/ 2\nc\nc\nr\nD\nR\n\n):\n.\nz\neo\nv\nv\n\n(electro-osmotic slip)\nln\n.\nz\np\nv\nr\nc\nr\nc\nz\n\n(1.8)\nThe first BC implies that\n0.\nc\nThe second BC implies that\n.\nc\neo\np\nc\nR\nv\nz\n\n0,\n0, steady\n0,\n0,\n0,\n0, fully\n0, /\n0, fully\ndeveloped\ndeveloped\n/\nr\nz\nz\nz\nz\nz\nz\nz\nz\nr\nz\nz\nv\nv\ng\nv\nv\nv\nv\nv\nv\nv\nv\np\nv\nv\nr\ng\nt\nr\nr\nz\nz\nr r\nr\nr\nz\n\n(1.6)\n\nThus the solution is\n\n.\nc\nz\neo\nc\nR\np\nr\nv\nr\nv\nz\nR\n\n(1.9)\nEquation (1.9) is a linear superposition of the solutions for Poiseuille flow and the spatially\nuniform \"plug flow\" due to electro-osmosis.\nNote: There was an error in the wording of this part. It asked for the velocity profile in terms of\nthe \"pressure gradient and\nbv .\" It should have said \"pressure gradient or\nbv .\" As long as your\nanswer was equivalent to (1.9) or (1.11), it was given credit, regardless of the choice of\nvariables.\nAs discussed in class, the average velocity in Poiseuille flow is equal to half of the maximum\nvalue, i.e. the value at the centerline. That is,\n,max\n.\nb\nc\nc\nb\nv\nR\nD\np\np\nv\nz\nz\n\n(1.10)\nThus the velocity profile could be expressed in terms of\nbv as\n\n.\nz\nb\neo\nc\nr\nv\nr\nv\nv\nR\n\n(1.11)\nYour sketches needed to show a discernible difference in the relative dominance of the electro-\nosmotic and pressure-driven components. One possible solution is shown below:\n-1\n-0.5\n0.5\n0.2\n0.4\n0.6\n0.8\nvz / veo\nr/Rc\nWeak dp/dz\n-1\n-0.5\n0.5\n0.2\n0.4\n0.6\n0.8\nvz / veo\nr/Rc\nStrong dp/dz\nNote also that the coordinate system used here was not the only choice. For example, we could\nlet z increase from right to left. In this case, the solution will be exactly the same as in (1.9) or\n(1.11) except the sign of every term on the right-hand side will be flipped.\n\nPart (c) (2 points)\nPart (b) showed that there are two contributions to the volume flow rate in the capillary: electro-\nosmotic flow and the pressure-driven backflow. The volume flow rate associated with the\nbackflow is given by the Hagen-Poiseuille equation:\n\n.\nc\natm\nc\nbackflow\nc\nD\np\np\nD\np\nQ\nz\nL\n\n(1.12)\nThis volume flow rate is related to the average backflow velocity\nbv by\n\n.\nc\natm\nc\nb\nc\nD\np\np\nD\nv\nL\n\n(1.13)\nThus the pressure difference along the capillary is\n.\nb\nc\natm\nc\nv\nL\np\np\nD\n\n(1.14)\nWe know from the problem statement that the pressure drop across the needle and microsyringe\ntogether is also\n\n.\natm\np\np\n\nSince the individual pressure drops across the needle and\nmicrosyringe are additive, we can also write\n.\nm\nm\nn\nn\natm\nm\nn\nv\nL\nv\nL\np\np\nD\nD\n\n(1.15)\nSetting (1.14) and (1.15) equal and simplifying,\n2 .\nb\nc\nm\nm\nn\nn\nc\nm\nn\nv L\nv L\nv L\nD\nD\nD\n\n(1.16)\nPart (d) (1 point)\nIn this part, we are effectively replacing the needle+microsyringe with a new microsyringe with\nthe same pressure drop, diameter, and average velocity, which will require it to have a different\nlength, Leff. Thus we can use the same strategy of part (c) and apply the Hagen-Poiseuille\nequation across this new microsyringe. We want to find Leff such that\n2 .\nm\neff\nm\nm\nn\nn\nm\nn\nm\nv L\nv L\nv L\nD\nD\nD\n\nNoting from part (a) (equation (1.5)) that\n\n/\n,\nn\nm\nm\nn\nv\nv\nD\nD\n\nwe can rewrite this expression as\n(1.17)\n\nm\neff\nm\nm\nm\nn\nm\nm\nn\nm\nv L\nv L\nv L D\nD\nD\nD\n\n(1.18)\nThus (1.17) is satisfied if\nPart (e) (3 points)\n.\nm\nn\nm\neff\nm\nn\nm\nn\nm\nn\nD\nL\nD\nL\nL\nL\nL\nD\nL\nD\n\n(1.19)\nWe seek two unknowns:\nand .\nm\nb\nv\nv\nThese quantities are related to one another by the mass\nbalance (1.5)\n\n2.\nm\nm\neo\nb\nc\nv D\nv\nv\nD\n\n(1.20)\nAnother relationship is given by setting (1.16) and (1.17) equal:\n2 .\nm\neff\nb\nc\nc\nm\nv L\nv L\nD\nD\n\n(1.21)\n(1.20) and (1.21) are two equations with two unknowns,\nand .\nm\nb\nv\nv\nSolving (1.21) for\nbv and\ninserting into (1.20),\n.\neff\nc\nc\nc\nc\nm\neo\nb\neo\nm\nm\nm\nm\nc\nm\nL\nD\nD\nD\nD\nv\nv\nv\nv\nv\nD\nD\nD\nL\nD\n\n(1.22)\nRearranging, we have\neff\nc\nc\nm\neo\nc\nm\nm\nL\nD\nD\nv\nv\nL\nD\nD\n\n(1.23)\nor\n\n.\n/\n/\n/\nm\neo\nm\nc\neff\nc\nc\nm\nv\nv\nD\nD\nL\nL\nD\nD\n\n(1.24)\nSimilarly,\n\n.\n/\n/\n/\neff\neff\nb\nc\nm\nc\neo\nc\nm\neo\nc\nm\nm\nc\neff\nc\nc\nm\nL\nL\nv\nD\nv\nD\nv\nL\nD\nv\nL\nD\nD\nD\nL\nL\nD\nD\n\n(1.25)\n\nSimplifying,\n\n.\n/\n/\nb\neo\nm\nc\nc\neff\nv\nv\nD\nD\nL\nL\n\n(1.26)\nPart (f) (2 points)\nThe pressure drop is maximized when the net volume flow rate through the capillary is zero:\n\nmax\n.\nc\nc\nnet\neo\nc\nD\np\nD\nQ\nv\nL\n\n(1.27)\nThus\n\nmax\n.\nc\neo\nc\nL v\np\nD\n\n(1.28)\nNote that a vanishing volume flow rate implies that\n.\nb\neo\nv\nv\n\nThus we can also obtain the correct\nanswer by simply substituting\nb\neo\nv\nv\n\ninto the rearranged Hagen-Poiseuille equation, (1.14).\nPart (g) (2 points)\nSetting\n/\n,\nm\neff\nv\ndL\ndt\n\nwe can write equation (3) in the problem statement as\n\n.\n/\n/\n/\neff\neo\nm\nc\nc\nm\neff\nc\ndL\nv\ndt\nD\nD\nD\nD\nL\nL\n\n(1.29)\nThis ordinary differential equation can be solved analytically, or one can make a simple\n1/2\n/\n1/\n.\neff\neff\neff\nL\nt\nL\nL\nt\n\ndimensional argument that\n,\neo\nv\n\n/\n,\nm\nc\nD\nD\n\nand\n\n1/\n/\nc\nc\nm\nL\nD\nD\n\nto clean up\nTo solve the ODE, let us define\nthe algebra. Then (1.29) becomes\n.\neff\neff\ndL\ndt\nL\n\n(1.30)\nIt can be readily verified that (1.30) has the solutions\n\n,\neff\nt\nc\nL\n\n(1.31)\n\nwhere c1 is a constant of integration that depends on the initial height of the fluid in the needle\nand syringe. Since Leff is positive and increasing with time, the physical solution is the one with\nthe positive coefficient of t. Converting back to the original constants, we have\n\n/\n/\n/\n/\n/\nm\nc\nm\nc\neo\nc\nc\nm\neff\nc\nc\nm\nD\nD\nD\nD\nv\nL\nD\nD\nt\nc\nL\nt\nL\nD\nD\n\n(1.32)\nwhere\n1 .\nc\nc\n\nThus\n1 .\nn\nNote that this result also implies that\n1/2\nm\nL\nt\n\nsince\n.\neff\nm\ndL\ndL\ndt\ndt\n\nThus (1.29) could also have been solved with Lm as the dependent variable rather than Leff.\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nSolution to Problem 2-Quiz 2 2013\n0.1 mm\nFigure 1: Rotary atomization at different flow rates (Image: Bavand-HML).\n(a):\nWe know that the following independent properties are important for determining the value of\nhR: radius of the cup (R), viscosity (μ), density (ρ), surface tension (σ), volumetric flow rate\n(Q), and angular speed of the cup (Ω)1. So, for a fixed given θ0, the following holds:\nhR = fun(R, μ, ρ, σ, Q, Ω)\nthus, n = 7 and knowing that there are three dimensions involved in these parameters ([M],[L],\nand [T ] ⇒ r = 3) we can conclude that at a fixed value of θ0 there are 4 dimensionless groups.\nWe select R,ρ, and σ as the repeating parameters and using Buckingham-Pi theorem following\ndimensionless groups will be identified:\nΠ1 = hR/R\nΠ2 = μ/\nJ\nρσR\nΠ3 = Q\nJ\nρ/(σR3)\nΠ4 = Ω\nJ\nρR3/σ\n(b):\nWriting down the conservation of mass we will have:\n∂ρ\n1 ∂\n∂\n∂\n+\n(ρr2 vr) +\n(ρvθsinθ) +\n(ρuφ) = 0\n∂t\nr ∂r\nrsinθ ∂θ\nrsinθ ∂φ\nwe already know that due to axi-symmetry ∂/∂φ = 0 thus the continuity equation simplifies\nto:\n∂ρ\n1 ∂\n∂\n+\n(ρr2 vr) +\n(ρvθsinθ) = 0\n∂t\nr ∂r\nrsinθ ∂θ\n1the angle of the cup (θ0) is another important parameter and we can keep it separate since it is already\ndimensionless\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nnow knowing the scale of different parameters (vr ∼VR, vθ ∼Vθ, r ∼R, θ ∼δθ ∼h/R), we can\nproceed with a scaling argument:\nh\nVR\nVθ\n∼\n⇒Vθ ∼δθVR ∼\nVR ⇒vθ << vr\nR\nRδθ\nR\n(c):\nWriting down N.S.E in spherical coordinates:\n\n∂vr\nvθ + vφ\n-1 ∂P\n2vr\n∂(vθsinθ)\n∂vφ\n+ (v.∇).vr -\n=\n+ ν ∇vr -\n-\n-\n∂t\nr\nρ ∂r\nr2\nr2sinθ\n∂θ\nr2sinθ ∂φ\nnow using the appropriate scales for length and velocities involved (vr ∼ VR, vθ ∼ Vθ ∼\nδθVR << VR, r ∼ R, θ ∼ δθ << 1, t ∼τ ∼inf), the Also using the problem's hint or N.S.E\nfor the θ-component it is easy to show that within the thin layer pressure is constant and\natmospheric (P ∼Pa), thus N.S.E. for the r-component will be simplified to:\nVR\nVR\nVR\nO(1) + VR\nO(1) + VR\nO(1) + 0 -(0 + Rsin2θ0Ω2) =\ninf\nR\nR\nVR\nVR\nVR\nVR\n0 + ν\nO(1) +\nO(1) + 0 -\nO(1) -\nO(1) -0\nR2\nR2(δθ)2\nR2\nR2\nIf δθ << 1 or (rδθ/r) << 1 then the dominant viscous term will be:\n(\n)\nν\n∂\n∂vr\nif (δθ)2 << 1 ⇒Dominant Viscous Term:\nsinθ\n(1)\nr2sinθ ∂θ\n∂θ\nFor ignoring the inertia convection terms the criterion will be:\nρVRRδθ\nρVRh h\nh\nif\n(δθ) << 1 or equally if:\n= Reh\n<< 1\n(2)\nμ\nμ\nR\nR\nFor ignoring the temporal derivative the criterion will be:\nR2δθ2\nif τ →inf⇒\n= 0\n(3)\nντ\nOne may argue that based on the selection of the reference frame the time scale may change\nfrom infto 1/Ω, in that case the condition in Equation (3) will change to:\nR2δθ2Ω << 1\nν\nWith the three mentioned criteria one can see that all the terms on the left hand side of the\nN.S.E. (r-component) other than the centripetal acceleration vanish, the scaling for centripetal\nacceleration shows that compared to the viscous terms they may be large enough and we have\nto keep them:\nCentripetal\nRsinθ2Ω2\n∼\n∼O(1)\nV iscous\nνVR/R2δθ2\nafter simplifying the N.S.E (r-component) we will be left with the following:\n(\n)\nvφ\nν\n∂\n∂vr\n+\nsinθ\n= 0\nr\nr2sinθ ∂θ\n∂θ\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nsince θ ∼θ0 = const. in the thin film, then we can further simplify the N.S.E into:\n1 ∂2vr\nr2\nρΩ2rsin2θ0\n+\n∂θ2\n= 0\nμ\n(4)\nO\nΩ\nθ0\nθ\nQ\nr\nh(r)\nx r\ny r(θ0 -θ)\nh(r)\nx r\ny r(θ0 -θ)\nhR\nξ = rsinθ0\nFigure 2: Schematics of the problem.\n(d):\nAs shown in Figure 2 we move to a local cartesian coordinate system (x-y) and the boundary\nconditions for y = 0will be:\nvθ = 0\nvφ = rsinθ0Ω\nvr = 0\nand for y = h(r):\nvθ =?\nvφ rsinθ0Ω\n∂vr\n=\n∂y\n∂vr\nr\nvr = 0\n∂θ\n(e):\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nEquation (4) in the x - y coordinate system will be:\n∂2vx\nρΩ2xsin2θ0\n+\n= 0\n∂y2\nμ\nafter integrating we will get:\nρΩ2sin2θ0r\nvr =\nh(r)y - y 2/2\n(5)\nμ\n(f):\nIn order to find the volumetric flow rate we just need to integrate the velocity along the liquid\nheight:\nh(r)\nh(r) ρΩ2sin2θ0r\nQ = 2π(rsinθ0)\nvrdy = 2πrsinθ0\n(hy - y 2/2)dy\nμ\nwhich can be simplified to:\n(ρΩ2sin2θ0r h3 )\nQ(r) = (2πrsinθ0)\nμ\nThus h(r) can be shown to be:\n(\n)1/3\n3μQ\nh(r) =\n(6)\n2πρΩ2r2sin2θ0\n(g):\nIn order to find the pathline we use the definition of a pathline:\ndrs = vr\ndt\ndφs = Ω\ndt\nwhich will lead to:\ndrs\nvr\n=\ndφs\nΩ\nFor a particle or bubble at the liquid surface we have:\nρΩ2sin2θ0r h2\nvr(y = h(r)) =\n(7)\nμ\nand we also know that:\n(\n)1/3\n3μQ\nh(r) =\n(8)\n2πρΩ2r2sin2θ0\nthus one can easily show that:\n(\n)1/3\ndrs\n9ρQ2\n-1/3\n=\nrs\ndφs\n32π2μΩ\nSolution by B.K. and G.H.M., 2013\n\nZ\nZ\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nwhich results in:\n(\n)1/3\ndrs\n9ρQ2\n= Ar-1/3 in which A =\ns\ndφs\n32π2μΩ\nUsing this relationships one can actually follow the spirals that the liquid make in the bell\natomizer and find an estimate for the spacing of the spirals by solving for the change in rs over\na 2π change in φ. The algebra will give:\n(16ρQ2 )1/4\nΔrs =\nμΩ\nor in the dimensionless form:\n( 16Π2 )1/4\nΔrs =\nΠ2Π4\nFigure 3 shows a comparison between the predictions from theory and the experimental mea\nsurements for the spiral's spacing.\nΔξ or Δrs\ni\n\n16ρQ2\nμΩR4\ni\n\ni\n\ni\n\ni8\n\nΔrs\nR =\n( 16Π2\nΠ2Π4\n)1/4\nΔrs =\n( 16ρQ2\nμΩ\n)1/4\ni\ni\ni\n\nΔξ/2R or Δrs/2R\nFigure 3: Results from Hinze et al. ([]) showing the agreement between measurements of the\nliquid's spiral spacing and the lubrication theory predictions.\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nExtra information:\nOne aspect of this problem which we did not cover is the behavior of liquid drops/ligaments/film\nat the rim of the cup. Experimentally the formation of drops, ligaments, and film at the rim has\nbeen seen at different working conditions (Figure 1 and 5(a,b,c)). It is interesting to observe\nthat all the experimental data maps on a phase diagram which is made by combination of\ndimensionless numbers you got for this problem in part (a) (Figures 4 and 5).\nFigure 4: Results from Hinze et al. ([]) showing the performance map for the rotary atomization\ndescribed with dimensionless groups introduced in this problem.\nTable 1 summarizes all the important parameters acting on different control surfaces for the\nselected control volume:\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\n\nv\nQ\nρ ( √μ\n)1/6\n\nD\nσD\nρσD\nFigure 5: (a) Single drop formation stage (b) Ligament formation stage (c) Liquid film for\nmation stage. (d) Results from Hinze et al. ([]) showing the performance map for the rotary\natomization described with dimensionless groups introduced in this problem.\nSolution by B.K. and G.H.M., 2013\n\n2.25 Advanced Fluid Mechanics\nFall 2013\nSolution by B.K. and G.H.M., 2013\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.25 Advanced Fluid Mechanics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}