{
  "course_name": "Advanced German: Professional Communication",
  "course_description": "This course exposes students to current issues and language use in German technology, business, and international industrial relations, and discusses ramifications of these issues in a larger social and cultural context. We seek to prepare students who wish to work or study in a German-speaking country by focusing on specialized vocabulary and systematic training in speaking and writing skills to improve fluency and style and emphasizing communicative strategies that are crucial in a working environment. Discussion and analysis of newspaper and magazine articles, modern expository prose, and extensive use of online material are included. Taught in German.",
  "topics": [
    "Humanities",
    "Language",
    "German",
    "Social Science",
    "Economics",
    "International Development",
    "Humanities",
    "Language",
    "German",
    "Social Science",
    "Economics",
    "International Development"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n21G.404 German IV\nor permission of instructor.\n\nKommunikation im Berufsleben\n\nThis course fulfills the HASS-H\nrequirement.\n\nZiele\n\nDieser Kurs bietet:\n\nEinblick in Aspekte der deutschen Wirtschaft, Wissenschaft und Technologie im europaischen Kontext\n\nInformationen uber aktuelle Veranderungen in Politik und Gesellschaft\n\nErhohung der kommunikativen Kompetenz durch projektorientiertes Arbeiten und Prasentationen\n\nEinblick in fach- und wissenschaftsspezifische Besonderheiten des Deutschen\n\nSprachpraktische Fertigkeiten wie Posterprasentation, Bericht, Lebenslauf, usw.\n\nErweiterung des Wortschatzes\n\nArbeit mit authentischen Materialien aus dem Internet, Fernsehen, Zeitungen und Zeitschriften\n\nTexte\n\nHall, K. und B. Scheiner.\nUbungsgrammatik fur Fortgeschrittene\n. Deutsch als Fremdsprache. Hueber Verlag, 2001. ISBN: 978-3-19-007448-8.\n\nArbeitsblatter in Form von Originalmaterialien und Kopien\n\nMaterialien aus dem Internet\n\nInhalte\n\nHausaufgaben\n\nSie sollten ungefahr 2.5 Stunden pro Unterrichtstreffen als Hausaufgaben einplanen. Das konnen unter anderem das regelmaßige Schreiben von Beispielsatzen fur die Vokabeln sein, sowie kurzere schriftliche Grammatikubungen, das Lesen und Analysieren von Texten (und anderen Materialien), das Vorbereiten von Prasentationen und das selbstandige Wiederholen von Grammatikkonzepten und Vokabeln.\n\nAktuelles\n\nFur die Dauer des Kurses sollten Sie taglich Nachrichten aus deutschsprachigen Landern horen, sehen und lesen. Die ersten 10 Minuten jeder Klasse sind fur die Besprechung aktueller Themen aus Deutschland reserviert. Jede/r Kursteilnehmer/in wird im Laufe des Semesters mehrmals ein aktuelles Thema vorstellen und die Diskussion leiten.\n\nWorterlernen\n\nIn den letzten 5 Minuten jeder Klasse stellen wir gemeinsam eine Liste relevanter Vokabeln zusammen, die dann von einem.\n\nStudenten/einer Studentin bearbeitet wird. Jeder Kursteilnehmer ist wahrend des Kurses mehrere Male fur das Zusammenstellen einer Liste mit neuen Wortern verantwortlich. Sie schreiben regelmaßig Beispielsatze fur diese Vokabeln und korrigieren diese nachdem Sie Feedback von mir bekommen.\n\nBesuchervortrage\n\nFachleute aus dem Bereich Wirtschaft, Wissenschaft und Kultur werden uns im Kurs besuchen, um Vortrage zu halten oder mit uns zu diskutieren.\n\nReferate/Vortrage/Prasentationen\n\nIm Laufe des Semesters wird jeder Kursteilnehmer Gelegenheit haben formelle und informelle Prasentationen zu bestimmten Themen zu machen: von einer 5-minutige Poster-Prasentation bis zu einem 15-minutigen Referat uber ein aktuelles Thema in seinem/ihrem Fachgebiet.\n\nSchriftliche Arbeiten\n\nStudenten werden im Laufe des Semesters kurzere (eine halbe Seite) und langere (1 bis 2 Seiten) schriftliche Arbeiten in verschiedenen Genres verfassen (z.B. Werbebroschure, Lebenslauf, etc.).\n\nGrammatik\n\nDieser Kurs analysiert und diskutiert relevante Grammatikkonzepte integriert in die inhaltliche Arbeit, selten explizit. Studenten sind fur das Wiederholen von grammatischen Konzepten (bei individuellen Schwachstellen) in Kooperation mit dem Kursleiter selbst verantwortlich.\n\nBenotung\n\nActivities\n\nPercentages\n\nAnwesenheit und aktive Teilnahme\n\n40%\n\nSchriftliche Hausaufgaben und Prasentationen/Vortrage\n\n30%\n\n2 Prufungen\n\n30%",
  "files": []
}