{
  "course_name": "Advanced Topics: Plotting Terror in European Culture",
  "course_description": "This interdisciplinary course surveys modern European culture to disclose the alignment of literature, opposition, and revolution. Reaching back to the foundational representations of anarchism in nineteenth-century Europe (Kleist, Conrad) the curriculum extends through the literary and media representations of militant organizations in the 1970s and 80s (Italy’s Red Brigade, Germany’s Red Army Faction, and the Real Irish Republican Army). In the middle of the term students will have the opportunity to hear a lecture by Margarethe von Trotta, one of the most important filmmakers who has worked on terrorism. The course concludes with a critical examination of the ways that certain segments of European popular media have returned to the “radical chic” that many perceive to have exhausted itself more than two decades ago.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "History",
    "European History",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "History",
    "European History",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis interdisciplinary course surveys modern European culture to disclose the alignment of literature, opposition, and revolution. Reaching back to the foundational representations of anarchism in nineteenth-century Europe (Kleist, Conrad) the curriculum extends through the literary and media representations of militant organizations in the 1970s and 80s (Italy's Red Brigade, Germany's Red Army Faction, and the Real Irish Republican Army). In the middle of the term students will have the opportunity to hear a lecture by Margarethe von Trotta, one of the most important filmmakers who has worked on terrorism. The course concludes with a critical examination of the ways that certain segments of European popular media have returned to the \"radical chic\" that many perceive to have exhausted itself more than two decades ago.\n\nFocus for this term: Germany, Ireland, and Italy. Conducted in English, but students are encouraged to consult original sources when possible.\n\nPurpose\n\nThe course will examine cultural and historical moments of terrorism in European culture and media. Students will be expected to construct arguments of their own about the issues raised. The course places a premium on excellence in communication; papers and oral presentations account for nearly 100% of the final grade. Students are expected to demonstrate progress in critical analysis and expression.\n\nSight and Sound\n\nRecordings of film and music will be placed on reserve at the Music Library.\nStudents are expected to have viewed or listened to each work before the date of its discussion\n. Brief excerpts reviewed in class.\n\nThe method of pedagogy is based in three modes: instruction, practice, and feedback. Students are given the fullest opportunity to engage in seminar discussions. Students shall receive constructive commentary on each assignment, and will be asked to revise their work when appropriate.\n\nClass participation is essential to this course. In order to make a valuable contribution students should come prepared to each class. Assigned readings must be completed before each class meeting. A guiding question shall accompany each assignment. Students who are unable to attend a class must inform the instructor in advance, either in person or by telephone. Students with more than four unexcused absences shall be dropped from the class.\n\nOn most days students shall submit\nbrief written responses\n(150-200 words each) to the question on the reading assignment. Although these responses will not be graded, such individual preparation will enhance class discussions. Further, regular writing practice will prepare students for longer papers, both in this course and beyond. Of the 13 questions distributed over the course of the semester students may select 10 to which they would like to respond. Students shall account for their progress with this series by consecutively marking each text (i.e. 1/10, 2/10... ). No extensions shall be granted for these writing assignments.\n\nCourtesy toward others in discussions is expected.\n\nGrading: Participation in class discussion and submission of ten brief written responses -- 25%\n\nOne of the primary goals of this course is the development and refinement of critical analysis and argument. To this end students will write\nthree essays\nof increasing length. About two weeks before a given due date students must submit a\nbrief outline\nof the essay they plan to write. Shortly thereafter they shall receive critical feedback. In finished essays any and all references must be cited. Essays must conform to MLA standards. A good guideline for word counts is this: 1 manuscript page = 250 words.\nThe minimum amount of writing submitted for grades is 21 pages\n.\n\nEssays are due at noon on the dates indicated.\nEssays submitted late without prior permission from the instructor will be penalized by\none full letter grade.\nEssays submitted more than one week will be penalized by\ntwo full letter grades.\nAlways keep a printed copy of your essay.\n\nThe first essay is a diagnostic exercise. Students are required to submit revised versions of this essay. For this assignment, only the revised essay will be graded.\n\nGrading: First essay and revision -- 20%, second essay -- 20%, third essay -- 25%\n\nIn addition to the writing assignments, students will also be expected to deliver an\noral presentation.\nStudents shall prepare and present a one-page handout on the day's reading. In these twenty-minute presentations students should provide a summary of the author's main points, describe the historical context in which the text was produced, and open up a few questions for discussion.\n\nPresentations will be evaluated according to the following criteria: insight, clarity, and, importantly, the degree to which presenters are able to stimulate the thoughtful participation of their classmates.\n\nGrading: One oral presentation -- 10%",
  "files": [
    {
      "category": "Resource",
      "title": "Anarchy and anarchism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/0a3372822dc7397486f5faa170473b20_MIT21G_061S04_fleming.pdf",
      "content": "Anarchy and anarchism\n\nWhat is anarchy?\nAnarchy is the absence of centralized authority or government.\n\nThe term was first formulated negatively\n\nby early modern political theorists\n\nsuch as Thomas Hobbes [question: who is hobbes?]\n\nwho regarded it\n\nas a condition of chaos, terror, and\n\nviolence.\n\nIn the nineteenth century, however,\n\nit came to be seen\n\nas an alternative to state coercion\n\nand economic exploitation.\nHistorically, anarchism is based\n\non the assertion that\n\npeople are capable of harmony\n\nbut are deformed and oppressed\n\nby political and economic institutions.\n\nIts most active early promoter was\nPierre-Joseph Proudhon (1809-1865),\n\nwhose influential \"What is Property?\" (1840)\n\nargued that \"property is theft\"\n\nand proposed that\n\nsmall associations of free producers\n\nreplace capitalism and the state.\n\nquestion\nhow is proudhon's understanding of property tied to Marx's (surplus\nvalue...)?\n\nIn the next generation,\n\nthe more radical Mikhail Bakunin\n\nproposed the complete replacement\n\nof private property\n\nby collectivism.\n\nAnarchism gradually lost ground to socialism\n\nand particularly communism\n\nduring the late 19th and 20th centuries.\n\nRevolutionary anarchism\n\npeaked in the West\n\nwith a wave of assassinations around 1900.\n\nAnarcho-syndicalism,\n\nwhich drew on Proudhon's ideas\n\nand advocated the devolution of power\n\nto workers' councils,\n\nplayed an important role\nin the short-lived Spanish republic\n\nof the 1930s.\n\nContemporary anarchism\n\nplays a role in opposition to globalization\n\nand neoliberalism on the world stage.\n\nSocialism\n\nquestion\nwhat is socialism?\n\nA form of social organization\n\nthat prioritizes the common ownership of property\n\nand the collective control\n\nof economic production.\n\nSocialism emerged from a diverse array\n\nof social experiments and doctrines\n\ndeveloped in the 1820s.\n\nThese reflected both excitement\n\nabout the possibilities\n\nof a rational, ordered, industrial society...\n\nand growing concern\n\nabout the actual effects\n\nof industrialization\n\nunder the conditions\n\nof private accumulation\n\nand market capitalism.\n\nquestion\nwhat are the ill effects of industrialization?\n\nDuring its first decades,\n\nsocialism was pursued primarily by small,\n\nutopian communities.\n\nThe transformation of socialism into a political doctrine occurred in the 1850s-70s‚\nespecially as Karl Marx and Friedrich Engels\n\ndeveloped their own account of socialism\nas the outcome of a revolutionary class\nstruggle between workers and\ncapitalists.\n\nBy the late nineteenth century,\n\nsocialism had developed\n\ninto a political doctrine\n\nassociated with\n\n--newly formed trade unions\n\n--mass political parties\n\n(e.g., the Social Democratic Party in Germany and the Labour Party in Britain).\n\nThese groups supported diverse views of socialism,\n\nfrom the incremental and ameliorative goals of many trade unionists to\nthe radical, revolutionary agendas\n\nof Marx, Engels, and the anarchists.\n\nThese divisions became increasingly pronounced over time.\n\nModerates [like Karl Kautsky and Eduard Berstein]\n\nadvocated working for socialism\n\nwithin the democratic political process\n\n(a model increasingly known as social democracy).\n\nOthers, such as Lenin, advocated violent revolution.\n\nquestion\nhow would bakunin and kropotkin align with this?\n\nThe Bolshevik Revolution of 1917\n\nand the end of World War I\n\nmarked the definitive split between moderates\nand revolutionaries.\n\nPost 1945:\nWest, welfare state\n\nEast, state socialism\n\nNoncommunist socialist parties\n\nremain prominent in many countries in Europe\n\nand the rest of the world.\n\nMost now pursue agendas\n\nassociated with increasing social welfare\n\nrather than fundamental economic transformations.\n\nBakunin, Mikhail (1814-1876)\n\nquestion\nwhat do you know about him?\n\nA Russian anarchist and revolutionary\n\nwho developed an influential critique of the state\n\nand vied with Karl Marx\n\nfor control\n\nof the First International (1864-1876).\n\nquestion\nwhat was bakunin's problem with marx?\n\nBakunin saw authoritarian tendencies\n\nin Marx's socialism\n\nand especially opposed Marx's emphasis\n\non the need for\n\na centralized proletarian regime.\n\nquestion\nwhat were bakunin's problems with 'the state'?\n\nFor Bakunin, the state in any form\n\nbecame a mechanism of mystified power,\n\ncontrolled by an elite.\n\nIn this respect it mirrored religion--\n\nindeed Bakunin saw the two\n\nas parallel historical developments.\n\nquestion\nwhat is the alternative to the state?\n\nThe alternative, Bakunin suggested,\n\nwas a decentralized federation of communes\n\nthat guaranteed relative autonomy\n\nand control\n\nover the means of production\n\nat the local level.\n\nThe State and Anarchism (1873)\n\nBakunin directed a similar critique\n\nagainst scientific elites,\n\nthe social sciences,\n\nand the scientific pretensions of Marxism.\n\nBakunin also stressed\n\nthat the destruction of the old order\n\nwas a prerequisite for socialism...\n\nand thus he strongly opposed Hegelian\n\nand liberal reformist notions of progress\n\nquestion\ndid you note any contradictions in his ideas?\n\nHis theory of revolution was contradictory, however...\nsometimes leaning on the notion of\nspontaneous action\n\nand at other times\n\nemphasizing the need\n\nfor conspiracy and careful direction.\n\nThe latter, in any event,\n\nbetter characterized his actions\n\nduring the First International.\n\nUltimately, Bakunin's apocalyptic views\n\nand associations with nihilists\n\nsuch as Sergei Nechayev\n\n(accused of murdering a fellow conspirator)...\n\ncontributed to a gradual loss of credibility\n\nand to his eventual expulsion from the First Intl.\nAlthough Bakunin's split with Marx\n\nfragmented the revolutionary movement in Western Europe, he had\na lasting effect on the anarchist movements\n\nin Russia, Italy, Switzerland, and Spain.\n\nThroughout his career,\nhe founded actual and sometimes imaginary\nrevolutionary networks,\n\nwhose varying degrees of political realism\n\noften perplexed his followers.\n\nAmong his more effective organizations was the\n\nInternational Alliance of Social Democracy,\n\nwhich he conceived\n\nas a forward-thinking movement\n\nwithin the First International...\n\nthe alliance advocated the definitive abolition of classes\n\nand the political, economic, and social\n\nequalization of the sexes.\n\nKropotkin, Peter (1842-1921)\n\nRussian nobleman, and main proponent of anarchocommunism.\n\nHe was a geographer who carried out explorations of Siberia, Finland, and Manchuria before\ndevoting his life to political activities.\n\nModern Science and Anarchism (1903)\n\nquestion\ndid you pick up on his interest in darwin?\n\nKropotkin believed that Darwin's theory of evolution,\nproperly applied,\n\nshowed that human beings\n\nare social creatures who flourish best\n\nin small communities\n\ncemented together by mutual aid\n\nand voluntary associations\n\nThe centralized state...\n\nwith its apparatus of coercion...\n\nrepresents a backward step, or obstacle to the\n\nimplementation of this ideal.\n\nReading question:\n\nWhat is the flaw in Winnie Verloc's character?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Corrado on IRA",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/c6424803bead87cee3fe12c0a5310a44_MIT21G_061S04_lessing.pdf",
      "content": "corrado on IRA\n\nideologically, terrorists from the fascist right to the radical left operate across europe\n\nterrorists both nationalist/ethnic and ideological\n\ndef of political terrorism:\n\nexplicitly political tactic\n\nemployed by self-appted individuals\n\nwho belong to clandestine groups\n\nwho want to destabilize a political regime\n\nby provoking the govt to retaliate\n\nthereby encouraging a repressive response\n\nand sowing dissension in the ranks\n\nof those in power\n\nmode: to generate fear and confusion among noncomatants\n\nundermine confidence in govts political and miliatry forces\n\nwhat are favorable conditions for tm?\n\nsympathy or at least tolerance\n\nhighly visible social group that sees itself as oppressed in political\n\nand/or economic terms\n\nneed concrete symbol of repression--\n\nhistorical acts that involve govt violence\n\nagainst a group\n\nthey need historical precedents, need to show continuity with past, need to show need for drastic\nand violent action\n\nquestion\nwhat is sinn fein?\n\nDoris Lessing, The Good Terrorist\n\n1919-, British novelist, b. Kermanshah, Persia (now Iran).\n\nShe was brought up on a farm in Southern Rhodesia (now Zimbabwe) and in 1949 went to\nEngland, where her first novel, The Grass Is Singing (1950), was published.\n\none of the major writers of the mid-20th cent. and an influential figure among feminists,\n\nLessing writes on a wide variety of themes:\n\nRhodesia, women, communism, and animals.\n\nDistinguished for its energy and intelligence, her work is principally concerned with the\nlives of women--\n\n--their psychology, politics, work,\n--relationship to men and to their children,\n--and their change of vision as they age.\n\nIn her later books she has mainly focused on efforts by individuals to resist society's\npressures toward marginalization and acculturation.\n\nThroughout Lessing's work run currents of realism and fantasy, each of which dominate\nin some novels and mingle in others.\n\nHer fiction includes a series of five novels collectively entitled The Children of Violence,\nwhich concern a semiautobiographical character named Martha Quest (1952-69).\n\nOne of her most influential works, The Golden Notebook (1962), a study of the struggles\nof a woman writer, is considered a classic of feminist fiction.\n\nThe Good Terrorist (1985)\nThe Sweetest Dream (2001), a semiautobiographical tale of the 1960s.\n\nTo dramatize the plight of unknown novelists, Lessing wrote two novels, The Diary of a\nGood Neighbour (1983) and If the Old Could (1984), under the pseudonym of Jane Somers; they\nwere ignored by critics until Lessing revealed their true authorship.\n\nThe Council, to discourage squatters,\nhave sent in workmen to make the place uninhabitable, but\nthat will hardly stop Alice.\n\nShe is a veteran of some fourteen years experience in squats and communes and here is a\nhouse which, judging by the smell coming from upstairs, can use her talents.\n\nJasper is grudgingly proud of the way she knows how to confront officials, to wheedle the\nconnection of water and electricity, to eliminate squalor\n\n-- though predictably some of their new comrades make snide remarks about Alice's bourgeois\ndomesticity, saying she cares more for curtains than issues.\n\nNo one, however refused the delicious soup she concocts so economically and can expand to\nunthinkable quantities when a party congress is called.\n\nAccording to an established pattern Jasper lets Alice look after him (though he never allows any\nphysical closeness)\n...and then complains that other people exploit her.\n\nThe fact that they have been living off Alice's mother\nfor the past four years is ignored, a matter of expediency for which they are far from\ngrateful.\n\nWhen Alice sees no alternative to stealing money from her father, Jasper is enraged to discover\nthat she holds any back for emergencies.\n\nStill, Alice cannot imagine life without Jasper and she sees herself as a committed revolutionary.\n\nWhen she isnt so busy nesting, she liked to be on the battlefront: picketing, being bound over\nand, best of all, spray-painting slogans.\n\nShe is aware that the latest aim of the C.C.U. (Communist Centre Union) is to help the I.R.A., but\nis increasingly concerned about activities in the squat next door - what is buried in their\ngarden and why there is a whiff of slick K.G.B. professionalism amidst their bungling\nEnglish zeal.\n\nShe is barely conscious of her deeper alarm about the plans hatching under her won roof: the\ndabbling with explosives, the ill-formed objectives, the disregard of consequences.\n\nDoris Lessing has superbly portrayed the tensions and ironies of a certain kind of militant left-\nwing living today, drawing her characters with eloquent subtlety.\n\nShe is attuned to the accents of the commune - posh tones slipping out when least appropriate.\n(Alice suspects that at least one accent was modelled on Coronation Street.)\n\ntensions in the novel:\n\n1. Individual idealism is nicely balanced against the behaviour of the group;\n\n2. English communism against manipulation from outside;\n\n3. the impulse to revolution against the dangers of amateurism.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Dario Fo, The Accidental Death of an Anarchist",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/78a0622ea87d65b7f8421872a7e19303_MIT21G_061S04_fo.pdf",
      "content": "Dario Fo, The Accidental Death of an Anarchist\n\n1997 Nobel Laureate in Literature\n\nAccidental Death of an Anarchist\nwas a reaction to the arrest of anarchist railway man Giuseppi Pinelli.\n\nOn December 12, 1969 a bomb went off in the Agricultural Bank in Milan\n\nkilling 17 people and wounding 100.\n\nImmediately after the bombing fascists of the Italian Social Movement (MSI)\n\ndistributed leaflets denouncing the 'red terror'\n\nand police in Milan went into action,\n\nsweeping up a number of socialist, communist and anarchist activists.\n\nOne of these was Pinelli,\n\nwell known as a pacifist opposed to individual acts of violence.\n\nAfter four days of interrogation in police headquarters\n\nPinelli 'fell' out of a fourth floor and died.\n\nPolice claimed that the death was an 'accident'.\n\nThese events sent a shock wave throughout Italy. There were demonstrations, articles in the\n\npress, inquires, etc.\n\nIn 1971, the policemen in charge of the investigation,\n\nCalabresi, was charged with manslaughter.\n\nCalabresi, in turn, launched a lawsuit against Lotta Continua,\n\nthe newspaper that had exposed many of the inconstancies\n\nin the police version of events.\n\nThese came to an end in May on 1972 when Calabresi was assassinated in front\n\nof his house by 'unknown assailants.'\n\nTen years later in Catanzaro,\n\nthree fascists were convicted of the Milan bombings.\nOne of them, Giannettini turned out to be a paid informer for the Italian police.\n\nDario Fo, working in Milan with the Capannone of Via Colletta,\n\nwrote the play in 1970 and it toured Italy playing to\n\naudiences totaling more than a million.\n\nIt caused a sensation itself, creating a storm of controversy in the press,\n\nbomb threats to the theatres, etc.\n\nIt has subsequently been translated into a number of languages and has been\nproduced throughout Europe and in the United States.\n\nThe play, while dealing with weighty political issues,\n\nis nevertheless an extremely funny one rooted in Italian\n\ntraditions of farce and of commedia del'arte.\n\nIts probing of issues of fascism, totalitarianism and the threats of a\n\npolice state transcend the particulars of the events\n\nwhich inspired it.\n\nFo has penetrating insights into the nature of power in contemporary society and in this play\n\nhe exposes some of its contradictions.\n\nKey dates in Fo's career:\n\n1970-71\nLa Comune produces a play about the Italian and Palestinian\nresistance.\n\nFollowing the terrorist attack on the Banca\nNazionale dell'Agricoltura in Milan, Dario writes\nand produces \"Accidental Death of an Anarchist\", about\nthe strage di Stato [a massacre thought to be\norganized by organs of the state].\n\n1973-74\nThe theatre collective is subjected to various acts\nof repression by the police as well as to efforts at\n\ncensorship.\n\nA group of fascists kidnaps, tortures and rapes\nFranca Rame. Through this beastly act, they seek\nto punish Franca and Dario for their political\nactivism, in particular Franca's work in the\nprisons since 1970. Outcries of indignation and\nsupport throughout Italy.\n\n1977-78\nIn November opens at a\nproduction of \"Female parts\", a piece mixing the\ngrotesque, comic and dramatic to illustrate the\nsituation of women today. Alone on the stage is\nFranca Rame, who for the first time puts her\nname besides Fo's on the author by-line. The\nperformance is staged more than 3000 times.\n\nFo writes \"La tragedia di Aldo Moro\", on the\nkidnapping and assassination of the Italian\nChristian Democratic Party leader at the hands of\nthe Red Brigades. The play, which has never\nbeen performed, is built on Sophocles'\nPhiloctetes.\n\nquestions\n\nwhat do you make of the prosthetic limbs?\n\n57/\nis the bomb real or a copy? what difference does it make?\n\n67/\nwhy mention watergate?\n\n71/\nmaniac calls police 'children of hitler.' RAF also called same.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Heinrich Böll",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/8c7dbf6d8d54a6c0da432e5e74bd4cbb_MIT21G_061S04_boll.pdf",
      "content": "Heinrich Boll\n\nhttp://www.boell.org/welcome.asp\n\nGerman writer, winner of the Nobel Prize for Literature in 1972.\nBoll portrayed Germany after World War II\nwith a deep moral vision\nand attacked the materialistic values of the post-war society.\n\nBoll's unorthodox Catholic belief often marked the spiritual content of his stories.\n\n\"Art is always a good hiding-place, not for dynamite, but for intellectual explosives and\nsocial time bombs. Why would there otherwise have been the various Indices? And\nprecisely in their despised and often even despicable beauty and lack of transparency lies\nthe best hiding-place for the barb that brings about the sudden jerk or the sudden\nrecognition.\" (from Nobel Lecture, 1973)\n\nBoll was drafted into the compulsory work program. \"... my unconquerable (and still unconquered)\naversion to the Nazis was not revolt,\" Boll later wrote, \"they revolted me, repelled me on every\nlevel of my existence: conscious and instinctive, aesthetic and political.\" (from What's to Become\nof the Boy?, 1981)\n\nDuring World War II Boll served six years as a private and corporal in the army on both the Soviet\nand Western fronts.\n\nHe was wounded four times, and at the end of the war he was interned in a prisoner-of-war camp\nin France.\n\nIn his early novels Boll depicted the despair of soldiers' lives...\nthe oppressive cruelties he witnessed in his youth and in military service.\n\nFrom the \"worm's-eye\" view of World War II his scope widened gradually on the reality of modern\nGerman society.\n\nBilliards at Half Past Nine (1959) took place in a single day (September 6, 1958).\n\nIt depicted a prominent family of Cologne architects,\nwho have been successively involved with the building of an abbey\nat the beginning of the 20th-century, its destruction during World War II,\nand its rebuilding after 1945.\n\nIn the course of the day Boll reveals\nthe crucial incidents in the past of the family,\nfrom the Wilhelminian empire through Weimar and Hitler\nto the prosperous West Germany of 1958.\n\nIn 1968 Boll worked as a teacher at the University of Frankfurt and later at other universities (in\nPrag 1969 and in Israel 1970).\n\nBoll was politically active and in 1972 he participated in SPD's election campaign.\n\nThe Lost Honour of Katharina Blum (1974)\n\nThe protagonist, Katharina Blum, is a decent young housekeeper.\n\nquestion:\nwhat is the basic plot?\n\nShe falls in love with a young man, who is wanted by the police.\nKatharina helps him to escape, and is interrogated by the police as if she had participated in\nterrorist acts.\nShe is persecuted in the sensation-seeking press, and especially an unscrupulous reporter\nnamed Totges, who is responsible for ruining her reputation.\nFinally she is driven to the act of murdering him.\nWhen the reporter says, \"How about us having a bang for a start?\" she shoots him.\n\nBoll himself had experienced harassment\nby the media and his house was searched by police\nwhen he announced that terrorist Ulrike Meinhof should be given a fair trial.\n\nVolker Schlondorff and Margarethe von Trotta adapted the book into screen in 1975.\n\nSafety Net (1979) was inspired by the press coverage of the Baader-Meinhof terrorist group.\n\nIn his essays\nBoll saw his role as a writer to act as the social conscience of his age.\n\nHe ridiculed contemporary jargon,\ndefended individual freedom and self-determination,\nand warned about the dangers of escalating nuclear armament\nand the creeping powers of the state security system.\n\nOften returning to his Catholic faith...\nBoll examined the godlessness of the times ...\nbut viewed critically the church itself.\n\nUlrike Meinhof\nhttp://www.baader-meinhof.com/who/terrorists/bmgang/meinhofulrike.html\n\nHeinrich Boll, Lost Honor of Katharina Blum\n\nWe turn this week to a novel published in the mid-1970s.\n\nAlthough fiction, its story rings true in that it reveals some of the basic structures of daily life and\ninteraction in a highly industrialized society near the end of the 20th c.\n\nDue to its treatment of the theme of violence following the outbreak of severe violent acts in the\nwest in the 1960s and 1970s, KB is often overused as a document of the period, and it is often\nread for its surface features alone.\n\nYet Boll had much more in mind than a literal reading of the text as a direct reflection of an actual\nevent.\n\nBoll distinguishes between the 'topical' and the 'real'.\n\n'Real' events, he argued in 1953, were events identified as having had significant impact upon\nour lives (an example would be WWII).\n\n'Topical' events, by contrast, were more ordinary (in that they were forgotten and therefore\nseemingly inconsequential).\n\nBut Boll's mind, 'topical' events were the keys to reality.\n\nHe cited the example of Japanese fishermen exposed to the radiation of American atomic testing\nin the Pacific.\n\nThe 'event' was 'topical'\n\n--the men were not agents of history or of change--\n\nbut even so, the 'reality' of the event was such\n\nthat it introduced into everyone's mind\n\na new consciousness that air itself can be a form of death.\n\nSo Boll is partly trying to explain the consciousness that governs postwar life\n\n(why do we think this way and not that?).\n\nTo help him achieve this end,\n\nhe introduces into his narratives individuals who themselves have made no history,\n\nbut who carry in their own stories the keys to the overarching structures and\n\nforms of power governing life.\n\nKatharina Blum is one such character.\n\nSocial violence dominated the west in the '60s and '70s.\n\nIn Germany, student protests broke out in 1968,\n\nthere were running protests over the Vietnam War\n\nand the deployment of nuclear missiles on German soil,\n\nand at the Munich Olympics in 1972\n\nterrorists shot and killed Israeli athletes.\n\nSmall hostile violent groups, such as the Baader-Meinhof Group or Red Army Faction,\n\nravaged German life.\n\nIn 1971 two members of that group were killed,\n\nand in 1972 the US army barracks in Heidelberg were bombed,\n\nas was the Springer publishing house in Hamburg.\n\nThe entire Baader-Meinhof affair was exploited by right wing media\n\nwhich used stories on the affair\n\nas a means to bring down the German government.\n\nBoll intervened on behalf of Ulrike Meinhof in 1972\n\nbecause he believed that the press,\n\nwhich had been accusatory, had deprived her and her group of a fair trial.\n\nBoll was then himself criticized, subject to police searches,\n\naccused of creating a climate for violence,\n\nand cast as a threat to the internal security of the nation.\n\nBoll sued for defamation and eventually won his case in Constitutional Court in 1981.\n\nThe Lost Honor of Katharina Blum appears in the midst of this period, in 1974.\n\nThe story is a polemical parody of the structures and mentalities of life.\n\nBoll uses the story to criticize several forms of violence in modern society;\n\nphysical violence is actually the least among them.\n\nThe story of KB is well known.\n\nKatharina Blum sleeps with a suspected terrorist,\n\nand is subsequently charged by the police with murder.\n\nLet's look closely at what he is saying\n\nabout the systematic dangers that exist in postwar society.\n\nquestion:\nwhat is the public sphere? how does media participate?\n\nConsider for discussion:\n\n1. The newspaper News in this story (Die Zeitung in the German version) is actually Bild-Zeitung,\na tabloid published by the Axel Springer (discussed in class). It was and still is the major source\n\nof news for a large portion of the German population. What is the relationship between the News\nand the public sphere?\n\n2. What are the forms of violence that Boll addresses in this work?\n\n3. How does the notion of the public sphere help us to understand what Boll is trying to say about\nviolence?\n\n3. Those who control truth--its construction as well as its certification--in a society are in a\nposition of power. Address the relationship between the News and the truth (for instance,\ncompare Katharina's 'facts' to the police's 'facts' to the News's 'facts').\n\nuseful links:\n\nhttp://www.baader-meinhof.com/terminology/terms/springer.html\n\nhttp://www.boell.org/welcome.asp\n\nhttp://www.baader-meinhof.com/who/terrorists/bmgang/meinhofulrike.html\n\nnotes from corrado reading on baader-meinhof group\n\nBurschenschaften wanted to redeem German nation by direct act of will\n--reaction against Napoleonic incursion\n--romantic, idealist\n--distant goals, outside of time and space, sublime spectacle\n\npost war: consolidation of frg democracy and demise of major conditions for tm\n\n1983: 27 members of green party elected to parliament\n\nradicalization of student mvt:\n\nformation of SDS german soct student alliance\n1950s on: baby boom, student population booms\n\ntension bw students and faculty (who have control over curriculum, sovereignty). professors act\nout authoritarian personality.\n\n418/\ngeneral structure of univ. system facilitates move to student violence\n\nFrankfurt school theorists (Habermas, Marcuse) assert:\n\n419/\nuniv system had to be altered so that students could undergo the radicalizing experience\nthat would allow them to contribute to changing w. german society in a nonviolent manner\n\nonce violence erupted, habermas spoke out against students: violence would bring about\nrepression that would hinder the unfolding of radical revolution in frg.\n\nrudi dutschke maintained that frg needed to be denazified.\n\ntriggers for RAF:\nvietnam\n\nrelease of comrades from prison\n\nmeinhof's goal: to demonstrate the vulnerability of the police by showing \"that armed\nconfrontation is feasible-- that it is possible to carry out actions where we can win.\" (422)\n\n424/\ntimeline of 1977\n\nquestion\nwhat psychological parallels are there between\n\nnapoleonic victories, failed liberalism of 19. century, shame of NS time?\n\nanswer: all attributed to \"parental failure\"\n\nquestion:\nhabermas sees RAF's confusion of symbol and reality as pathological.\n\nwhat does he mean? do you agree? rasch, a forensic psychiatrist,\n\nhas disagreed.\n\n429/\n\nRAF only offered 'the oppressed\" a distant symbolic identification in\n\nreturn for their revolutionary sacrifices.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Heinrich Böll, Lost Honor of Katharina Blum",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/e07719c90fba13f357ba7b98fb993325_MIT21G_061S04_06104notes.pdf",
      "content": "Heinrich Boll, Lost Honor of Katharina Blum\n\nWe turn this week to a novel published in the mid-1970s.\n\nAlthough fiction, its story rings true in that it reveals some of the basic structures of daily life and\ninteraction in a highly industrialized society near the end of the 20th c.\n\nDue to its treatment of the theme of violence following the outbreak of severe violent acts in the\nwest in the 1960s and 1970s, KB is often overused as a document of the period, and it is often\nread for its surface features alone.\n\nYet Boll had much more in mind than a literal reading of the text as a direct reflection of an actual\nevent.\n\nBoll distinguishes between the 'topical' and the 'real'.\n\n'Real' events, he argued in 1953, were events identified as having had significant impact upon\nour lives (an example would be WWII).\n\n'Topical' events, by contrast, were more ordinary (in that they were forgotten and therefore\nseemingly inconsequential).\n\nBut Boll's mind, 'topical' events were the keys to reality.\n\nHe cited the example of Japanese fishermen exposed to the radiation of American atomic testing\nin the Pacific.\n\nThe 'event' was 'topical'\n\n--the men were not agents of history or of change--\n\nbut even so, the 'reality' of the event was such\n\nthat it introduced into everyone's mind\n\na new consciousness that air itself can be a form of death.\n\nSo Boll is partly trying to explain the consciousness that governs postwar life\n\n(why do we think this way and not that?).\n\nTo help him achieve this end,\n\nhe introduces into his narratives individuals who themselves have made no history,\n\nbut who carry in their own stories the keys to the overarching structures and\n\nforms of power governing life.\n\nKatharina Blum is one such character.\n\nSocial violence dominated the west in the '60s and '70s.\n\nIn Germany, student protests broke out in 1968,\n\nthere were running protests over the Vietnam War\n\nand the deployment of nuclear missiles on German soil,\n\nand at the Munich Olympics in 1972\n\nterrorists shot and killed Israeli athletes.\n\nSmall hostile violent groups, such as the Baader-Meinhof Group or Red Army Faction,\n\nravaged German life.\n\nIn 1971 two members of that group were killed,\n\nand in 1972 the US army barracks in Heidelberg were bombed,\n\nas was the Springer publishing house in Hamburg.\n\nThe entire Baader-Meinhof affair was exploited by right wing media\n\nwhich used stories on the affair\n\nas a means to bring down the German government.\n\nBoll intervened on behalf of Ulrike Meinhof in 1972\n\nbecause he believed that the press,\n\nwhich had been accusatory, had deprived her and her group of a fair trial.\n\nBoll was then himself criticized, subject to police searches,\n\naccused of creating a climate for violence,\n\nand cast as a threat to the internal security of the nation.\n\nBoll sued for defamation and eventually won his case in Constitutional Court in 1981.\n\nThe Lost Honor of Katharina Blum appears in the midst of this period, in 1974.\n\nThe story is a polemical parody of the structures and mentalities of life.\n\nBoll uses the story to criticize several forms of violence in modern society;\n\nphysical violence is actually the least among them.\n\nThe story of KB is well known.\n\nKatharina Blum sleeps with a suspected terrorist,\n\nand is subsequently charged by the police with murder.\n\nLet's look closely at what he is saying\n\nabout the systematic dangers that exist in postwar society.\n\nquestion:\nwhat is the public sphere? how does media participate?\n\nConsider for discussion:\n\n1. The newspaper News in this story (Die Zeitung in the German version) is actually Bild-Zeitung,\na tabloid published by the Axel Springer (discussed in class). It was and still is the major source\nof news for a large portion of the German population. What is the relationship between the News\nand the public sphere?\n\n2. What are the forms of violence that Boll addresses in this work?\n\n3. How does the notion of the public sphere help us to understand what Boll is trying to say about\nviolence?\n\n3. Those who control truth--its construction as well as its certification--in a society are in a\nposition of power. Address the relationship between the News and the truth (for instance,\ncompare Katharina's 'facts' to the police's 'facts' to the News's 'facts').\n\nhttp://www.baader-meinhof.com/terminology/terms/springer.html\n\nSpringer Press\n\n11 April 1968 - Thousands of protestors riot at the Berlin headquarters of the Springer Press after\nSDS and APO leader Rudi Dutschke is shot by an extremist.\n\nThe bane of leftist Germans, the Springer newspapers were outrageously conservative. Owned\nby Lord Axel Springer, the Springer Press controlled almost half of the newspaper circulation in\nWest Germany.\n\nSpringer was an avowed anti-communist. During a time when others corporations were leaving\nWest Berlin in droves (fearful of the tenuous political situation that barely kept the city out of East\nGerman hands), Axel Springer chose to put the headquarters for his publishing empire in Berlin.\nSpringer built a 20-story monstrosity mere yards away from the Berlin Wall (a block away from\nCheckpoint Charlie), and put a huge reader-board on the side facing East Berlin. The board\nwould flash the news of the free world to the \"enslaved Germans\" on the other side of the wall.\nThe sheer size of the building was intended as a constant reminder to East Germans of the\nsuperiority of the Capitalist system.\n\nThe Baader-Meinhof Gang bombed the Springer building in Hamburg in May of 1970, injuring 17\nworkers.\n\nhttp://www.boell.org/welcome.asp\n\nGerman writer, winner of the Nobel Prize for Literature in 1972. Boll portrayed Germany after\nWorld War II with a deep moral vision and attacked the materialistic values of the post-war\nsociety. Boll's unorthodox Catholic belief often marked the spiritual content of his stories.\n\n\"Art is always a good hiding-place, not for dynamite, but for intellectual explosives and\nsocial time bombs. Why would there otherwise have been the various Indices? And\nprecisely in their despised and often even despicable beauty and lack of transparency lies\nthe best hiding-place for the barb that brings about the sudden jerk or the sudden\nrecognition.\" (from Nobel Lecture, 1973)\n\nHeinrich Boll was born in Cologne. His father was a cabinetmaker and sculptor, whose ancestors\nhad fled from England to escape the persecution of Roman Catholics. Boll started to write poetry\nand short stories in his youth. He was one of the few boys in his school who did not join the Hitler\n\nYouth movement. However, his elder brother, Alois, joined the movement to keep his father's\nbusiness afloat. Boll graduated from a high school in 1937. In his certificate Boll had two errors:\nhis birth date was incorrect and his choice of career - \"book trade\" was altered by the school\nprincipal.\n\nBoll was drafted into the compulsory work program. \"... my unconquerable (and still unconquered)\naversion to the Nazis was not revolt,\" Boll later wrote, \"they revolted me, repelled me on every\nlevel of my existence: conscious and instinctive, aesthetic and political.\" (from What's to Become\nof the Boy?, 1981) During World War II Boll served six years as a private and corporal in the army\non both the Soviet and Western fronts. He was wounded four times, and at the end of the war he\nwas interned in a prisoner-of-war camp in France.\n\nAfter returning to Cologne, Boll studied at the university and worked then for a short time in the\nfamily workshop and later at the city's Bureau of Vital Statistics. Boll's first stories appeared in\n1947. Some of his early works were published in English in The Mad Dog (1997). The title story\ndepicts two friends, a a priest and a murderer, who meet at the end of the war but find that they\nare separated by their own horrific experiences and spiritual emptiness. Boll's first novel, The\nTrain was on Time, appeared in 1949. From 1951 he was a full-time writer.\n\nIn his early novels Boll depicted the despair of soldiers' lives, the oppressive cruelties he\nwitnessed in his youth and in military service. From the \"worm's-eye\" view of World War II his\nscope widened gradually on the reality of modern German society.\n\nIn a 1952 essay, Boll accepted the label \"rubble literature\" as a designation of literary trend which\nfocused on the war, coming home, and reconstruction. Boll wanted to find a realism that would\ncorrespond \"to the laconic nature of the generation which has 'come home,' a generation that\nknows there is no home for them on this earth.\"\n\nBilliards at Half Past Nine (1959) took place in a single day (September 6, 1958). It depicted a\nprominent family of Cologne architects, who have been successively involved with the building of\nan abbey at the beginning of the 20th-century, its destruction during World War II, and its\nrebuilding after 1945. In the course of the day Boll reveals the crucial incidents in the past of the\nfamily, from the Wilhelminian empire through Weimar and Hitler to the prosperous West Germany\nof 1958.\n\nIn 1971 appeared Group Portrait With a Lady, which was again formally innovative: it was\ncomposed from interviews and documents about Leni Pfeiffer, through whom the lives of some\n\nsixty other characters are depicted. Boll parodied fashionable documentary novels, but also used\nthe dead language of real documents of Nazi bureaucracy. The narrator tries to reconstruct the\nlife of Leni, the simultaneously saintly and sensuous heroine. \"The female protagonist in the first\nsection is a woman of forty-eight, German: she is five foot six inches tall, weights 133 pounds (in\nindoor clothing), i.e., only twelve to fourteen ounces below standard weight; her eyes are\niridescent dark blue and black, her slightly greying hair, very thick and blonde, hangs loosely to\nher shoulders, sheathing her head like a helmet.\" Leni has survived a difficult childhood, a bad\nmarriage, a forbidden love affair with a Soviet prisoner-of-war, the bombing of Cologne, and\npostwar series of losses. In the end his friends, social 'discards', organize a 'Help Leni\nCommittee' to bail her out of bankruptcy and prevent her eviction.\n\nIn 1968 Boll worked as a teacher at the University of Frankfurt and later at other universities (in\nPrag 1969 and in Israel 1970).\n\nBoll was politically active and in 1972 he participated in SPD's election campaign.\n\nThe Lost Honour of Katharina Blum (1974)\n\nThe protagonist, Katharina Blum, is a decent young housekeeper.\n\nShe falls in love with a young man, who is wanted by the police.\nKatharina helps him to escape, and is interrogated by the police as if she had participated in\nterrorist acts.\nShe is persecuted in the sensation-seeking press, and especially an unscrupulous reporter\nnamed Totges, who is responsible for ruining her reputation.\nFinally she is driven to the act of murdering him.\nWhen the reporter says, \"How about us having a bang for a start?\" she shoots him.\n\nBoll himself had experienced harassment by the media and his house was searched by police\nwhen he announced that terrorist Ulrike Meinhof should be given a fair trial.\n\nVolker Schlondorff and Margarethe von Trotta adapted the book into screen in 1975.\n\nSafety Net (1979) was inspired by the press coverage of the Baader-Meinhof terrorist group.\n\nIn his essays Boll saw his role as a writer to act as the social conscience of his age. He ridiculed\ncontemporary jargon, defended individual freedom and self-determination, warned about the\ndangers of escalating nuclear armament and the creeping powers of the state security system.\n\nOften returning to his Catholic faith Boll examined the godlessness of the times but viewed\ncritically the church itself.\n\nBoll died in Bonn on July 16, 1985. After his death, critics lamented the lack of a successor\ncapable of carrying on his public missions as moral authority and a spokesman for intellectual\nfreedom.\n\nhttp://www.baader-meinhof.com/who/terrorists/bmgang/meinhofulrike.html\n\nUlrike Meinhof's parents both died early, leaving Ulrike and her sister Weinke in the care of\nRenate Riemack, a friend of their mother's. Riemack was a devoted socialist, and a profound\ninfluence on Meinhof.\n\nMeinhof married Klaus Rainer Rohl, publisher of the left-wing student newspaper, konkret. After a\nfew years Meinhof became konkret's editor. Rohl and Meinhof have twin girls, Bettina and\nRegine, on 21 September, 1962.\n\nMeinhof drifted away from Rohl, and towards the radical fringe of the student movement. She left\nher husband in the late sixties. On 14 May, 1970, she participated in the freeing of Andreas\nBaader, giving birth to the so-called \"Baader-Meinhof Gang.\" Though partially named after her,\nMeinhof was not, as is often assumed, the co-leader of the gang (Baader, along with his girlfriend\nGudrun Ensslin, led the group, with Meinhof, Jan-Carl Raspe, and others comprising a second\ntier of leadership). She spent the next two years on the run, robbing banks and bombing\nbuildings, before being captured on 15 June, 1972.\n\nWhile in prison over the next four years, Meinhof grew increasingly depressed as the other gang\nmembers ostracize her. She hung herself in her cell on 9 May, 1976 (though some have\nquestioned this official explanation and instead suspect that she was murdered by the state).\n\nUlrike Meinhof\n\nMember\nBaader-Meinhof Gang\n\nBorn\n7 October 1934\n\nFirst Active\nMay 1970\n\nCurrent Status\nCommitted suicide in prison 9 May 1976\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/aa8a1aac41d0e9861815166d1b58d37b_MIT21G_061S04_introduction.pdf",
      "content": "[introduction]\n\nthis is a course about history (terror) and culture (art/lit)\n\n--how do they intersect?\n\nlet's consider a statement made by avant-garde composer karlheinz stockhausen on 16 sept\n--WTC attack was \"greatest work of art that is possible in the whole cosmos.\"\n--drew parallels with his work as a composer:\n\n\"you have ppl so concentrated on one performance, and then 5000 ppl are\ndispatched into eternity, in a single moment... I couldn't do that. in comparison\nwith that, we're nothing as composers.\"\n\n--accd to stockhausen, a similar impulse\nexists behind the act of terror and the work of art:\n\n\"what happned spiritually [on 9.11], this jump out of security, out of the self-\nevident... this sometimes also happens in art... or it is worthless.\"\n\nlets explore the interconnection bw art and terrorism.\n\nRomantics tended to associate art and violence.\nRomanticism. [what is? when?]\n\nreaction to an emergent industrial society\n\nromantics associated art with the idea of\n\na terrifying awakening that would undo the west's\n\nec. and pol. order\n\nwriters and artists seek to shock, to transgress the everyday.\n\nwordsworth yearned for 'extraordinary incident' to prod us out of 'savage torpor.'\n\nThe anarchist and terrorist mvts that\n\ndeveloped during the same period\n\nwere similiarly motivated.\n\nThese mvts countered industrial society\n\n... wanted to induce shock to bring about\n\nnew state of affairs\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Michael Baumann, “How it all began”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/ba27de8944c05e30e789a1268084375f_MIT21G_061S04_baumann.pdf",
      "content": "Michael Baumann, \"How it all began\"\n\nIn intro, it says that the main issue is violence:\n\nShould the state have a monopoly on its use?\n\nCan you imagine a moment in history when such a monopoly worked against democracy?\n\nBoell and Sartre endorsed publication of this book\n\n-- some have gone so far to say that suppression of book\n\nis tantamount to violence. Do you agree? What is real violence?\n\nGo over main points in chronology, pp 12-18\n\nWhat kind of youth did MB have? What are main elements of his formation?\n\n--worker, rebel, commune, drugs, read bakunin\n\nWith whom does he identify? (blacks, jews... thru music, thru exclusion)\n\nLet's lay out a few points of MB's argument from the rest of the book:\n\n31/\nsome ppl, when pushed to the limit, can only free themselves by irrational, aggressive\nactions\n\n33/\nprivileges individual action\n\n\"every slave... that is how the individual terror of the old anarchists can be explained\"\n\nhere's the crux in which german militants found themselves:\n41/\nbefore i get transported to auschwitz, i'd rather shoot first\n\none thing that only is expressed later in the book is that MB identifies with third world struggle\n46/\na little manifesto: struggle doesn't happen in metropolis anymore\n55/\nrefers to fanon\n\nmilitants trained in jordan\n\n60/\nmention of bombing of synagogue in berlin (shalom and napalm)\n\nmb criticizes RAF as too intellectual-- the only shoot out of abstraction (78)\n\nThomas Elsaesser, \"Antigone Agonistes\"\n\nwhat is the Antigone story (Sophocles)?\n\nWhat's Elsaesser's project at hand here? What's the main concern?\n\n267/\ntv show deathgame brought RAF mythology to rest\n\nit did what neither police state did...\n\nnor what the films of the 70s managed to do\n\nWhat is the hot autumn of 1977?\n\n267-68/ timeline\n\nThese events brought postwar Germany to crisis...\n\nThey revealed how fragile the 'cargo of democracy' was,\n\nHow quickly it could devolve into violence...\n\nBoth state and mass violence.\n\nWho are main protagonists of Deathgame?\n\n269/\nHans-Martin Schleyer and Helmut Schmidt, then a hostage\n\nHow is this different to M+J? vT doesn't show side of victim\n\nHow are audiences in 70s different from those in 90s and today?\n\n270/\n70s viewers sympathized with RAF, were skeptical of press and state\n\nRead passage on 271. Elsaesser says this isn't a cynical stance. Why not?\n\nSchmidt and his advisors draw a parallel bw 1977 and Stalingrad.\n\nWhy is this a problem?\n\n272/*\ngerman govt officials still bound by military codes of Nazi past\n\nwhere did the young generation of the 70s see the continuity bw the nazi times and postwar\ngermany?\n\nEssentially they equated fascism with capitalism\n\nPerformativity of RAF\nElsaesser, too, sees something theatrical in the RAF\n\n--he mentions that the RAF wanted to unmask the hypocrisy of postwar Germany\n\n--he compares them to Hamlet and to Antigone\n\nElsaesser compares the RAF to several modern art movements. What are they?\n\n--happenings\n\n--fluxus\n\n--graffiti\n\n--situationism\n\n--avantgarde film: battleship potemkin\n\nAlso the RAFs actions were so emphatically urban\n\n285/*\nthey were urban guerillas... they were part of a tendency to see space as a political\ncategory\n\nthe RAF played upon the inhospitability of modern cities\n\nthe RAF erupted into the urban fabric\n\nbut Elsaesser makes an important distinction that lentricchia, for example, does not:\n\n287/*\nsees street not as metaphor for the stage\n\nbut as synecdoche for urban space\n\na figure of speech by which a part is put for the whole (as fifty sail for fifty ships), the whole for a\npart (as society for high society), the species for the genus (as cutthroat for assassin), the\n\ngenus for the species (as a creature for a man), or the name of the material for the thing\nmade (as boards for stage)\n\nRAF signals shift in political culture...\n\nFrom elite politics of stage/parliament/agora\n\ntheater\n\nTo street politics of event/entertainment culture\nmedia\n\nElsaesser sees a love/hate relationship bw RAF and US. What is it?\n\n--against US imperialism\n\n--idolizes US youth/counterculture... macho gangster\n\nthe RAF became the german equivalent of pop art\n\nis Elsaesser's question, that \"RAF violence was essentially symbolic\" just rhetorical?\n\nRAF seemed to attack the space of the spectacle, but it already operated within this space\n\nLet's read a really dense passage together and think about whether 'artist' could be substituted\nfor 'terrorist': 295/ whole last graph\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Question: Is Michael Kohlhaas a terrorist?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/1f3594589cabecdfe4f45657ce0794e9_MIT21G_061S04_wittkowiski.pdf",
      "content": "question:\nIs Michael Kohlhaas a terrorist?\n\nWolfgang Wittkowski says this:\n\n471/\nmk commits acts of terrorism\n\nbut he willingly accepts decapitation\n\nin the enlightened Rechtsstaat of brandenburg\n\nbut of course, there are other elements of the story that interrupt this legal disquisition\n\nwhat are they? mysticism\n\nThis novel is a study of the use and abuse of the law...\n\nhow the law is used to political advantage\n\nquestion\nlet's reconstruct the plot\n\nquestion\nhow is mk described?\n\nopening graph: both honorable and terrible\n\nquestion\nwhat's romantic about him?\n\noutraged, tortured, half-mad... in other words, close to god\n\nquestion\nhow is martin luther described?\n\nhe's a referee\n\nquestion\nhow does ml's regard for mk change?\n\nfirst ml leads public defamation of rebel\n\nthen, after their meeting he grants mk the\n\nholy communion\n\nthat he had once denied him\n\nwhile alive, lisbeth wanted MK to forgive; he resists.\n\nas gypsy, she gives him a weapon to save his life and finish his destroyer\n\n-- but he can choose this freely\n\nMK becomes deadly avenger of justice violated\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Said, “The Essential Terrorist”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/9adfae453f7620d543d4af13eb75b346_MIT21G_061S04_said.pdf",
      "content": "Lentricchia and McAuliffe, \"Crimes of Art and Terror\"\n\nquestion:\ndo lentricchia and mcauliffe perceive a 'curious knot' bw artists and terrorists?\n\n2/\nthey call it \"an incestuous relationship\"\n5/*\nepigram: from Mao II\n\nquestion:\nso what shared desire do artists and terrorists have, accd to l?\n\n2/\nto transgress the given order\n\n8/*\njump the gap between word and thing\n\ndefeat the representational character of literature\n\nquestion:\nthey mention one artwork-- performance art-- that enacts this 'jumping the\n\ngap.' what is it?\n\nchris burden, shoot (1971)\n\nquestion:\nhow is this unmediated cultural/historical moment different to the\n\naesthetic/poetic object of aristotle's imagination?\n\nnow let's look at a passage on p. 10... more material here about Stockhausen, about shared\ndesire of artists and terrorists\n\n10/*\nread citation\n\nquestion:\nhow far back can we trace this transgressive desire?\n\n3/\nfrom 11 sept all the way back to romanticism\n\nquestion:\nL + M maintain that most americans didn't grieve for victims of 11 sept.\n\ndo you agree?\n\nL + M see 9.11 as a rupture, a defamiliarization-- not as an emotional event\n\nL + M take an unsentimental approach to art\n\n**Essentially, L + M see an equivalence between terror and performance art.\n\n14/\nAtta = author\n\npit of WTC marks the original art of the suicide pilots\n\nI have a problem with this...\n\nI'm also wondering about an assertion at the end of this chapter:\n\nthey say curators and collectors choose bits of refuse and turn them\n\ninto artifacts.\n\nSaid, \"The Essential Terrorist\"\n\nquestion:\nwho was said? what's his relationship to chomsky?\n\nwhat is the political context to which he refers?\n\n153/*\n[top two graphs]\n\nestablishment of israel; disenfranchisement of palestinians\n\nquestion:\nhow does this relate to european history?\n\nexplain orientalism: european subject established in opposition to oriental other\n\n***heart of darkness\n\nquestion:\nhow does this kind of binary opposition\n\nplay itself out in said's analysis of terrorism?\n\n152/*\nread bottom paragraph\n\nScanlan, \"Plotting Terror\"\n\nseeks affinities bw literary and terrorist plots\n\nidentifies remnants of a romantic belief in the power of\n\nthe marginalized\n\nto transform history\n\nsees tm as both:\n\nactual killing\n\nand a fictional construct\n\n5/*\ndefines tm\n\n\"a symbolic act designed to influence political behavior\n\nby extranormal means, entailing the use or threat of violence\"\n\nquestion:\nwhat's the diff bw calling someone a terrorist\n\nand calling them a revolutionary?\n\nScanlan's general inquiry:\n\nthe writer's ability to understand\n\nand influence politics\n\nrel. bw language and violence\n\nthe nature of power\n\nthe impetus to resist\n\nquestion:\nwho are the three classic authors she begins with?\n\ndostoevsky, james, conrad\n\n11/\noverview of 20th c. terrorism in Europe question: what are flashpoints?\n\ntm considered \"outmoded as a revolutionary method\"\n\npolitical activists thought that sustained strikes\n\nwere more effective than sporadic violence\n\npostwar regimes were democratic enough that social change\n\ncould be effected thru legitimate means\n\n1950s one could see state socialism as \"state tm\"\n\nspecters of intl tm resurface with student revolutions\n\nconvergence of: aeroterrorism\n\nleisure flight\n\nmedia\n\nfirst global terrorist broadcast is when?\n1972 olympics\n\nby mid-70s, RAF playing right to tv\n\nat the end of Scanlan's intro, she considers \"radical chic\"...\n\nwhat is that?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Heinrich von Kleist (1777-1811)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-061-advanced-topics-plotting-terror-in-european-culture-spring-2004/5bef7a9402723aa5787dfa2a6444f76b_MIT21G_061S04_kleist.pdf",
      "content": "Heinrich von Kleist (1777-1811)\n\ngerman dramatic poet\n\nKleist served (1792-99) in the Prussian army and led an unhappy life that\nended in suicide.\n\nAmong his passionate tragedies is Penthesilea (1808), The Prince of Homburg,\n(1821, tr. 1956), a historical tragedy.\n\nKleist's terse, dynamic style and his sense of conflict : between reason and feeling, divine law\nand human law : are also evident in his novellas.\n\nBest known of these is Michael Kohlhaas (1808-10, tr. 1967).\n\nEnlightenment and Reformation\n\nboth pretty revolutionary, yet neither kant nor luther endorsed public resistance to authority\n\nluther: 95 theses did, however, help ignit the peasant war of 1524\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.061 Advanced Topics: Plotting Terror in European Culture\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}