{
  "course_name": "Advanced Macroeconomics I",
  "course_description": "14.461 is an advanced course in macroeconomics that seeks to bring students to the research frontier. The course is divided into two sections. The first half is taught by Prof. Iván Werning and covers topics such as how to formulate and solve optimal problems. Students will study fiscal and monetary policy, among other issues. The second half, taught by Prof. George-Marios Angeletos, covers recent work on multiple equilibria, global games, and informational fictions.",
  "topics": [
    "Social Science",
    "Economics",
    "Macroeconomics",
    "Social Science",
    "Economics",
    "Macroeconomics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nPrerequisites\n\nThe prerequisites for this course are\n14.122 Microeconomic Theory II\nand\n14.452 Economic Growth\n.\n\nDescription\n\nFirst Half\n\nThis is the first half of an advanced macroeconomics course aimed at second year PhD students. Prof. George-Marios Angeletos will cover the second half, which will be kept largely disjoint this year. On the methodological side, our agenda includes learning how to formulate and solve optimal policy problems. In terms of topics, we will study fiscal and monetary policy and, if time permits, touch on a few other issues.\n\nSecond Half\n\nBusiness cycles and financial crises hinge on shifts in expectations: booms are sustained by optimistic beliefs about future economic activity; credit crunches and financial crashes are associated with dramatic shifts in such beliefs. But what causes shifts in these kinds of beliefs? And how does this matter for policy? The second half of the course will seek to shed some light on these issues. To this goal, we will cover recent work on multiple equilibria, global games, and informational fictions.\n\nGrading\n\nThe grade for the entire class will be determined by combining the average grade from:\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\nFinal paper",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/8d3582ddcbd4d9ad2bcbb30544a42f7d_MIT14_461F12_pset1.pdf",
      "content": "Problem set 1. 14.461 Fall 2012.\nIvan Werning\nSeptember 13, 2012\nReferences:\n1. Ljungqvist L., and Thomas J. Sargent (2000), \"Recursive Macroeconomic Theory,\"\n- sections 17.2 for Problem 1,2.\n2. Werning Ivan (2007), \"Optimal Fiscal Policy with Redistrtribution,\" - pp. 953-954\nfor Problem 3.\n3. Chari V.V. and Patrick J. Kehoe (1999), \"Optimal Fiscal and Monetary Policy,\" -\nSection 3 for Problem 5.\nTaxing Luck.\nIn this problem we see that with incomplete markets capital taxation is positive in the\nsteady state. The intuition is that the only source of consumption smoothening is capital\ninvestment and agents in the absense regulation overaccumulate capital. That is why\npositive tax improves wealth as it reduces interest rate that agents face and hence, reduces\nsavings to the optimal level. Unlike Aiyagari (1995) who carries out the analysis on a\nmore abstract level, in this problem we take a particular functional forms that allow for\nmore direct derivation.\nConsider economy populated by unit continuum of infinitely lived agents. Time is\ndiscrete t = 0, 1, ... That is, for a generic agent at time t state θt is realized and denote by\nθt = (θ0, .., θt) history of shocks for an agent.1 Shocks are i.i.d. across time and agents.\n1Strictly speaking, there is a unit continuum I of agents and agent i ∈ I at time t observes a history\nof shocks θi\nt = (θ0i, .., θti). For conciseness we drop index i and refer to a generic agent instead.\n\nUtility function is\nu(c) = - e -γc\n(1.1)\nγ\nand agents discount at factor β.\nIn the beginning of each period t after observing θt agent chooses how much effort to\nexert (lt) which affects his income (yt) according to function2\n\nyt = (1 - τt)wtlt +\n1 - lt + θt.\n(1.2)\nThen consumption ct and asset holdings at are chosen subject to the sequential budget\nconstraint\nct + at = yt + Rtat-1 - Tt, ∀θt\n(1.3)\nand the No-Ponzi condition\nat\nΠt\ni=1Ri\n→t 0 almost surely\n(1.4)\nwhere Rt = 1+(1-τt\nk)(rt -δ) is after-tax gross rate of return. Policy of the government is\nlabor tax τt, capital tax τt\nk and lump-sum tax Tt and could not be conditioned on private\nhistory of the agent. Firms produce output employing capital and labor with production\n√\nfunction F (K, L) =\nKL. 3\nPlease, answer the following questions.\n1. Suppose that θt is equal to 1 for all t. Define equilibrium of the deterministic model\nand solve Ramsey problem for this economy. Is tax on capital equal to zero?\nFor the rest of the questions assume that θt is equal to 2 and 0 with equal proba\nbilities.\n2. Write resource constraint.\n3. Consider two agents with different private histories of shocks at moment t, θt and\nθ t . How this affects their expectations of interest rate process Rt? In particular,\nfind difference E[Rt+i|θt] - E[Rt+i|θ t] for all i. How about expectations about Lt\nand Kt?\n4. Solve for optimal choice of effort and define by y ∗(.) function of maximal income\n2In the notation instead of y(θt) we write yt when history θt is implied.\n3As usual define by capital letters aggregate variables.\n\ngiven inputs. What are the arguments of this function, does it depend on the whole\nhistory of shocks?\n5. Using Euler equation find ex ante utility of the agent as a function of initial asset\nholdings and interest rate process?\n6. Introduce the following additional notations. Let At be a price of console\ninf\nAt =\n(Πt\ni=0Ri)-1\n(1.5)\ns=0\nand\nγ\nCE[y,\n] ≡- ln E exp[-γy]\n(1.6)\nA\nγ\na certainty-equivalent for utility function u. Verify that Euler equation is satisfied\nby a guess\nct - ct-1 = Δ(At, Rt, wt) + 1 (yt\n∗ - Et-1yt\n∗ )\n(1.7)\nAt\nwhere\nγ\nΔ(A, R, w) ≡\nln[βR] +\n(E[y ∗ ] - CE[y ∗ ,\n]).\n(1.8)\nγ\nA\nA\n7. Suppose that planner wants to choose policy so that to maximize ex ante utility of\nagents.4 Using ex ante utility function from (4) formulate planning problem.\n8. (*) Write Lagrangian for planner's problem and demonstrate that there is a positive\ntax on capital in the steady state.\nComputation of Equilibrium.\nConsider the simplified version of the model introduced above in which yt = θt + wt\n(i.e. there is no alternative home production and l ∈ [0, 1]). Suppose first there is no\ngovernment intervention. Implement the following algorithm to compute the equilibrium.\n1. Start with some value of capital K = Kj , j = 0 and compute interest rates and\nwages from firms' optimality. Introduce state variable (θ, a) and a mapping αj (θ, a)\nwhich maps current state of a generic agent to the optimal choice of asset holdings.\n4Notice that agents are different ex post, but identical ex ante.\n\n2. Find stationary distribution λj for (θ, a). Compute new capital level\nK ∗ =\nλj (θ, a)αj (θ, a).\n(2.1)\nj\nθ,a\n3. Set Kj+1 = ξKj + (1 - ξ)Kj\n∗ for ξ ∈ (0, 1) and iterate.\nNow compute equilibrium capital holdings for different tax levels on capital, τ k = 0.25, 0.5\nHow the tax on capital affects capital level and ex ante welfare.\nCapital Levies\nThis problem investigates the optimality of capital levies and their relationship to the time\ninconsistency problem. We consider a deterministic economy subject to linear taxation of\nlabor and capital.\n1. Consider a representative agent economy. Assume the on capital is not bounded\nabove. Show that it is always optimal to tax capital completely away, i.e. confiscate\nit.\n2. Assume now that prefereces are separable between consumption and labor and that\nthe utility over consumption is CRRA. Assume that the tax on capital must be\nbounded above by κ. Show that the optimal initial tax on capital must be set at\nthis bound. What happens with the optimal tax rate on capital in other periods?\n[Hint: you must modify the usual Ramsey problem to incorporate the constriants\non capital taxation.]\n3. Define a time inconsistent plan to be an optimum for the Ramsey problem at t = 0\nthat is no longer optimal if the government could re-optimize at some date t > 0\nand select a new competitive equilibrium, taking the starting conditions in period t\nas given. Argue that your results in (a)-(b) imply a time inconsistency problem.\n4. Now consider an economy with two agents. Show that a positive tax on capital may\nor may not be optimal. Argue that a subsidy on capital may be optimal.\n5. (*) Spell out an example economy where the optimum features a constant tax on\nlabor, no tax on capital and the plan is time consistent. Be very specific in your\nconstruction.\n\nBudget Balance and Chamley-Judd\nWe now investigate whether budget-balance rules affects the long-run results on a zero\ncapital-income tax.\n1. Consider a representative agent Ramsey model with capital, but where no bonds\nare available. Assume the government cannot purchase capital; agents can purchase\ncapital. Write down the \"budget balance\" constraint for the government and the\nsequential budget constraints for agents. [Note: a present value condition for the\nagent may also be derived, for appropriate prices, but why is this less useful?]\n2. Define an equilibrium, stating carefully the objects an equilibrium comprises and\nthe conditions it must satisfy.\n3. Show that if the resource constraints are satisfied and the agents' budget constraints\nholds with equality in all periods, then the government's budget balance constraint\nholds in all periods.\n4. Using your result in (b)-(c) to show that, for any given initial tax on capital κ0, an\nequilibrium allocation (c, L, k) must satisfy the resource constraint and,\nuc (ct, Lt) (kt+1 + ct) + ul (ct, Lt) Lt =\nuc (ct-1, Lt-1) kt\nβ\nfor all t = 1, 2, . . . and\nuc (c0, L0) (k1 + c0) + u (c0, L0) (1 - L0) = κ0 (Fk (k0, L0) - δ) kt.\nUse this to state the Ramsey problem as a choice over (c, L, k) for given κ0.\n5. Show that if (ct, Lt, kt) → (css, Lss, kss) then κt → 0 [Note: make sure you prove\nany property about Lagrangian multipliers at a steady state]. What happened to a\nLaffer curve? How can g be financed by labor income taxes only even if g is very\nlarge?\nMoney and the Friedman Rule (Practice problem).\nNot for grade.\n\nIn this problem we look at the Ramsey problem for a monetary economy. Preferences\nare given by\ninf\nβt u(ct, mt, nt)\nt=0\nwhere ct and nt are consumption and labor as before, and mt = Mt,t+1/pt is the represen\ntative agent's real money balance. Technology is linear:\nct + gt = nt\nThe consumer's budget constraint (in terms of goods) is given by:\nMt,t+1\nqt+1\nMt-1,t\n+\nbt+1 + ct ≤ (1 - τt)nt + bt +\npt\nqt\npt\nwhere qt+1 is the real price at time t of a risk-free one-period real bond and pt is the real\nqt\nprice level.\n1. Derive the present value constraint\ninf\n\nRt,t+1\nM-1,0\nqt ct +\nmt - (1 - τt)nt) ≤\n,\nt=0\n1 + Rt,t+1\np0\nwhere Rt,t+1 is the nominal interest rate, defined by\npt+1 qt+1\n1 + Rt,t+1 =\n·\n.\npt\nqt\nand we normalized so that q0 = 1.\n2. Define a competitive equilibrium.\n3. Prove that the implementability condition\ninf\nM0\nβt[ut(ct, mt, nt)ct + um(ct, mt, nt)mt + un(ct, mt, nt)nt] = q0 p0\nt=0\nand the resource constraints are necessary and sufficient for an allocation to be\nsustainable by a competitive equilibrium. Set up the Ramsey problem for given p0.\nHow will the government choose p0?\n\n4. Suppose preferences are weakly separable\nu(c, m, n) = U(w(c, m), n)\nand w(c, m) is homothetic. Prove that the Friedman rule is optimal, that is, Rt,t+1 =\n0 for all t = 0, 1, . . . .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/4031b47b522d0084a4a44941f6cb4f54_MIT14_461F12_pset2.pdf",
      "content": "Problem set 2. 14.461 Fall 2012.\nIvan Werning\nSeptember 22, 2012\nReferences: Ivan's notes.\nComputing AMSS.\nSolve a parameterized version of the AMSS model covered in class with concave util\nity numerically. Use dynamic programming with a single state variable. Parameterize\npreferences and uncertainty to your liking, but defend your choices.\n1. For benchmark parameters, display the solution for the policy functions, value func\ntions and a Monte Carlo simulation.\n2. Starting with a debt level of 60% of GDP how much time does it take on average\nto reach the first best?\n3. Do comparative statics with respect to parameters and report your results.\n4. What is the most interesting and what is most questionable about this model?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/c465a6eacae908114c457f2799353fd3_MIT14_461F12_pset3.pdf",
      "content": "Z Z\nProblem set 3. 14.461 Fall 2012.\nIvan Werning\nOctober 6, 2012\nReferences: Aiyagari, McGrattan (1997), \"The optimum quantity of debt\".\nOptimal level of dept.\nConsider the following modification of Aiyagari (1994) with technological progress, gov\nernment debt and lump-sum taxes. Technological progress is labor-augmenting and given\nby zt = (1+ g)t . Government finances exogeneous process of government expenditures Gt\nthrough government debt and lump-sum taxes.\n1. Normalize variables so that balanced-growth path of the original economy corre\nsponds to a steady-state of the transformed economy. From now on we refer to\ntransformed economy.\n2. Compute supply and demand on assets. Draw a graph.1 Compare the steady-state\ninterest rates and aggregate amount of assets. What is the interest rate if we assume\ncomplete markets? Does the increase of debt have different effect under complete\nand incomplete markets?\n3. Denoting by V (a, e) expected utility of agent with asset holdings a and productiv\nity shock e and by H(a, e) distribution of agents across asset holdings and shocks\nconsider the following welfare criterion\nΣ =\nV (a, e)dH(a, e).\n(1.1)\n1You may use the AR process for productivity log(et) = ρ log(et-1)+σEt and the following parameters\nρ = 0.6, σ = 0.3, growth rate - 0.0185, risk aversion 3, discount factore - 0.971, capital share - 0.3, initial\nborrowing limit 0, depreciation - 0.075, government debt - 10.\n\nPlot welfare as a function of government debt. Is the relation monotonic? Comment.\n2 Review of the topic \"Agent Heterogeneity in Macroe\nconomic Models\".\nThe purpose of the problem is to give you the idea of what you could write in a week\nperiod.\nUsing techniques covered in the first topic come up with research question and give\nan answer to it. Follow the guidelines below.\n1. The question should be related to the first topic, which could be roughly stated as\n\"Agent Heterogeneity in Macroeconomic Models\". Examples for directions are\n- Theoretical exploration of the models we've covered in lectures and recitations.\nE.g. assume that agents in Krusell, Smith model make \"naive\" conjectures\nabout evolution of capital. Come up with two different \"naive\" conjectures such\nthat one has similar properties to KS and in another agents could considerably\nimprove their expected utility by being more sophisticated.\n- Comment on a controversial statement using the heterogeneous agent models.\nE.g. take some popular claim and do theoretical adjustment or a version of the\ncalibration of known model to support or object the claim.\n- Take some macroeconomic model learned in the core macro sequence and in\ntroduce agent heterogeneity.\n2. You are not supposed to know the literature and it's fine if your question is acci\ndentally already answered as long as you come up with it independently. So don't\nread extensively and get to modeling as quickly as you can.\n3. Report should not exceed 7 pages, single interval, 10pt font. You don't need to\nprovide details of every calculation you make. For proofs a physicist proof would\nsuffice. Make sure you describe carefully the model and equilibrium concept. Be\nprecise in the statements of the results and new assumptions you make.\n4. Try to use the tools that you already developed in problem sets and covered in\nlectures. It could be quite easy or hard problem depending on how far you depart\nfrom the tools we've covered.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/25590b548c80515d7461b268c1374156_MIT14_461F12_pset4.pdf",
      "content": "Problem set 4. 14.461 Fall 2012.\nIvan Werning\nOctober 17, 2012\nFiscal Multipliers with Hand-to-Mouth Consumers.\nSuppose a fraction χ of agents live hand to mouth (hereafter HM agents), without access\nto financial markets they consume their labor income net of taxes and transfers. The rest\nof the agents can access financial markets. For generality allow the taxes/transfers on\nHM agents to be different from other agents.\n1. Setup all the equilibrium conditions (nonlinear).\n2. Work out the log-linearized equilibrium conditions.\n3. Derive the effects of current and future fiscal policy on the equilibrium level of aggre\ngate consumption. Work out the effects on HM agents and other agents separately.\nFully Rigid Prices.\nConsider a liquidity trap scenario where r is constant and negative up to T then positive\nafter that. Suppose prices are completely rigid so that κ = 0. Solve for the optimal\ninterest rate path. Prove that i = 0 up to some T ' > T and then i = 0 after T '.\nNonlinear Dynamics.\nConsider the standard NK nonlinear model as described in Woodford's Handbook chapter.\nYou may work in discrete or continuous time. Suppose we are in a liquidity trap scenario\n\nbecause there is less subjective discounting for t ≤ T and then we return to the usual\npositive discounting after T . Assume monetary policy is not optimal, instead it sets\ni(t) = 0 before T and targets zero inflation after T .\n1. Describe all the nonlinear equations that are needed to compute equilibrium. De\nscribe how one can solve for the equilibrium after T and how one can solve backwards\nfor an equilibrium before T .\n2. Compute numerical examples for the full nonlinear solution and compare it to your\nlinearized solution. Show a few representative parameter cases.\n3. Redo the same exercise assuming that the liquidity trap scenario is generated by a\ntemporary slow down in productivity growth.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/643143a34da71072ff6d8c87a534aad8_MIT14_461F12_pset5.pdf",
      "content": "Problem set 5. 14.461 Fall 2012.\nIvan Werning\nOctober 31, 2012\nReferences:\n1. Ljungqvist L., and Thomas J. Sargent (2000), \"Recursive Macroeconomic Theory,\"\n- sections 22.13 for Problem 1.\n2. Mailath J. George and Larry Samuelson (2006), \"Repeated Games and Reputa\ntions,\" - section 3.6 for Problem 2.\nCharacterization of V .\nConsider a government playing repeated game against public. At time t let yt be govern\nment action and xt - action chosen by the public. Action sets are compact. Government\ndiscounts at rate β stage game payoff U(x, y). Agents could condition their actions on\nthe outcome of public correlation device wt.\nLet σ be a pure strategy of the government, i.e. a mapping from history of actions\nand outcomes of correlation device at time t, ht, to action yt. We analyse pure SPE of the\ngame and suppose that public chooses xt myopically according to function h, xt = h(yt).1\nDefine by H(x), myopic best response of govenrment to public action x. Govenment's\nexpected2 discounted utility is\ninf\nv0\nσ = (1 - β)Ew\nβtU(xt, yt).\n(1.1)\nt=0\n1Given particular environment it's usually easy to put restrictions on primitives, so that best response\ncorrespondence is indeed a function. Since this is not the focus of the problem we directly assume that\nh is a function.\n2Expectation is with respect to correlation device outcomes.\n\nFollow the steps below to characterize the set V ≡{v : v = v0\nσ, σ ∈ SPE}.\n1. Reduce the problem to the characterization of extreme points of V , i.e. show that\nV = [v, v ] for some v, v .\n2. Write down the program for finding v. In particular, show that v = U(h(y), H(h(y))\nfor some y. Does the solution to the program depend on v? Did you use convexity\nof V at any step?\n3. Write down the program for finding v. In particular, show that v = U(h( y), y ).\n4. Design a simple algorithm for computing V that works for sufficiently patient gov\nernment. How do you adjust your algorithm to accomodate impatient govenrment?\nConvexity without Public Correlation (optional).\nSuppose that in previous problem no public correlation device is available. Take any v in\nconvex hull of V and suppose that v > vi where vi is utility from static Nash equilibrium\nof the game. We show that for sufficiently big β there is SPE σ with v0\nσ = v. 3\n1. Relate this fact to the solution to the first problem. In particular, we don't prove\nthat V is convex but that it gets convex in the limit of β going to 1. Does the\nargument in problem 1 go through with this weaker statement?\n2. Define ζ(ht) by ζ0 = 0\nt-1\nζt(ht) = (1 - β)\n(U(x t , y t) - vi).\n(2.1)\nτ =0\nInterpret ζt(ht). Specify strategy profile such that at each time t static Nash equi\nlibrium profile giving vi is played if either deviation occured in past periods or\nζt(ht) ≥ (1 - δt+1)(v - vi).\n3. Show that for high β for all histories ζt(ht) < v - vi and for on-equilibrium-path\nhistories ζt(ht) ≥ (1 - δt)(v - vi). What is the expected utility of such strategy for\nthe government.\n3The statement is true for all v in convex hull of V and reasoning for v < v0 is similar but more\ncumbersome.\n\n4. Notice that given your interpretation of ζt(ht) in part 2 it's natural to choose thresh\nold for strategy (1 - δt)(v - vi) instead of (1 - δt+1)(v - vi). Why this does not\nwork.\n5. Prove that strategy specified in part 2 is an SPE for high β.\nProblem 22.3 from Ljungqvist, Sargent.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/e4795a2b5a430c2160546e967acb9c27_MIT14_461F12_pset6.pdf",
      "content": "Problem set 6. 14.461 Fall 2012.\nGeorge-Marios Angeletos.\nNovember 21, 2012\nReferences:\n1. Angeletos M., C. Hellwig and Alessandro Pavan (2006), \"Signaling in a Global\nGame: Coordination and Policy Trap,\" - Problem 1.\n2. Hassan T., and Thomas Mertens (2011), \"Market Sentiments: A Tragedy of the\nCommons,\" - Problem 2.\nSignaling in a Global Game.\nConsider the following modification of Global Game discussed in class. At date 0 gov\nernment observes fundamental θ and could \"burn money\"1 in the amount M > 0. Start\ning from date 1 the game proceeds as in the benchmark model: agents observe signals\nxi = θ + σξi where ξ ∼ [-1, 1] and choose whether to attack or not. At date 2 government\ndecides whether to abandom status quo (D = 1) or not (D = 0) to maximize payoff\n(1 - D)(θ - A) - M where A is size of attack. Please, answer the following questions.\n1. Is (unique) outcome of a benchmark model still an equilibrium in the modification?\nWhat beliefs support this outcome?\n2. \"Rationality of agents implies that burning money is not played when θ > 1 + 2σ\nor θ < -2σ\". True or False.\n1Think of liqudity injections for example.\n\n3. Provide an example of equilibrium in which government burns money? For what\nvalues of M your construction is possible. Be sure to specify beliefs of agents off-\nequilibrium path. Is (interim) utility of govenment monotone in M?\n4. Is it possible to have the following outcome as an equilibrium: there are thresholds\nθ1 < θ2 < θ3 < θ4 such that government burns money whenever θ ∈ [θ1, θ2] ∪ [θ3, θ4]\nand does not burn money otherwise. If yes, could you generalize the construction\nto infinite amount of intervals. Be sure to be precise about details of equilibrium\nconstruction or argument of why such equilibrium is not possible.2\nAttention to Sentiments.\nConsider the following simple version of Hassan-Mertens.\nAgents indexed by i ∈ [0, 1] have endowment 1. Game is played in two stages. In the\nfirst stage each agent chooses μi, amount of attention to pay to sentiment t ∼N (0, 1).\nIn the second stage each agent chooses zi, amount of asset to buy given private signal\nsi = x + νi and price p that clears the market, where x ∼N (0, σx\n2) is fundamental value\nof asset and νi ∼N (0, σν\n2) is idiosyncratic noise.\nAgents are dynamically inconsistent. Let κ be cost of attention. In the second stage\nunless sufficient amount of self-control is exercised agent succumbs to sentiment which\naffects his estimate of fundamental. More precisely, in the second stage agent chooses zi\nto maximize mean-variance utility\nU2(zi, μi) = (1 + zi(E[x|si, p] + μit - p))(1 - κ(1 - μi)) - z 2V[x|si, p](1 - κ(1 - μi))2\ni\nIn the first stage agents are aware of this bias and decide on the amount of attention\nμi to pay to the sentiment to maximize expectation of\nU1(μi) = (1 + zi(E[x|si, p] - p))(1 - κ(1 - μi)) - z 2V[x|si, p](1 - κ(1 - μi))2 .\ni\nwhere zi is chosen by agent in the second stage.3 Follow the following steps to BNE of\nthe game.\n1. Solve for optimal value of zi in the second stage.\n2For constructions you may put any bounds on M and σ, for proof on impossibility of construction\nyou should show that such construction is not possible for any M and σ.\n3Think of this change of preferences as dual-selves model.\n\nR\n2. Characterize REE in the second stage.\n3. Find best response of agent in the first stage and find equilibrium level of attention.\n4. Does the game exhibit strategic complementarity or substitutability in choice of\nattention to sentiment?\n5. Is equilibrium unique? Is there an equilibrium with zero attention to sentiments?\nGive intuition for uniqueness or multiplicity.\n6. How do equilibrium level of attention and volatility change with parameters σν\n2, σx\nand κ?\nInvestment, complementarities and beliefs.\nSuppose we have the information structure:\nθ ∼N (0, 1)\nz = θ + ν\nν ∼N (0, β)\nxi = θ + ti\nti ∼N (0, α)\nand payoffs:\nu(ai, A) = ai(θ + A)\nwhere ai ∈{0, 1} and A =\naidi.\nI\n1. Derive the equations that characterize threshold equilibria and find sufficient con\ndition for uniqueness.\n2. With progam of your choice plot the equilibrium correspondense x ∗(z) for different\nvalues of α and β.\n3. Compute the probabilities P [xj < xi|xi, z].\n\n4. Show that probabilities computed in part 3 converge to 1/2 for any (xi, z) when the\nprecision of private information goes to infinity. That is, we generate \"typicality\"\nin beliefs.\n5. Now assume that the agent's system of beliefs (which is common knowledge) is such\nthat for all xi\nE[θ|xi] = xi\nand\nP[xj = xi|xi] = λ\nP[xj < xi|xi] = P[xj > xi|xi] = (1 - λ).\nShow that you can construct two threshold equilibria, one with x ∗ = -λ -1\n2(1 - λ)\nand the other with x ∗ = -1\n2(1 - λ). What happens when λ → 0? when λ → 1?\nInterpret your results.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-461-advanced-macroeconomics-i-fall-2012/be74fe36c2d3a2e5cb2dcdb1b493a3b0_MIT14_461F12_pset7.pdf",
      "content": "Problem set 7. 14.461 Fall 2012.\nGeorge-Marios Angeletos.\nDecember 5, 2012\nReferences:\n1. Bergemann, Dirk, and Stephen Morris (2012), \"Robust Predictions in Games with\nIncomplete Information,\" - Problem 1.\n2. Mackowiak, Bartosz, and Mirko Wiederhold (2009), Optimal Sticky Prices under\nRational Inattention,\" - Problem 3.\nBergemann, Morris.\nFollowing Bergemann, Morris approach of characterizing BNE over all information struc\ntures do the following exercises (notations are as in the class). Consider special case\nμθ = 0 and σθ = 1.\n1. Consider the model\n⎞\n⎞\n⎛\n⎞\n⎛\n⎛\n⎞\n⎛\nθ\nμθ\nσθ\n∗\n∗\n∗\n⎜\n⎜\n⎜\n⎜\n⎝\n⎟\n⎟\n⎟\n⎟\n⎠\n⎜\n⎜\n⎜\n⎜\n⎝\n⎜\n⎜\n⎜\n⎜\n⎝\n⎟\n⎟\n⎟\n⎟\n⎠\n⎜\n⎜\n⎜\n⎜\n⎝\n⎟\n⎟\n⎟\n⎟\n⎠\n⎟\n⎟\n⎟\n⎟\n⎠\nρθaσa\nσa\n∗\n∗\nρθAσA\nρAaσAσa\nσ2\n∗\nA\na\nA\nμa\nμA\n∼N\n,\nσ2\nBθ\nμBθ\nρθBθ σBθ\nρABθ σAσBθ\nρaBθ σaσBθ\nBθ\n\nwhere Bθ =\nI Ei[θ]di is average first-order beliefs about fundamental. Best response\nfor agent i is given by\nai = (1 - r)Ei[θ] + rEi[A].\n\nWhat information structure maximizes volatility V[A]? noise generated volatility\nV[A|θ]? non-fundamental fraction of volatility V[A|θ]/V[A]? volatility generated by\nhigher-order beliefs V[A|θ, Bθ] for a fixed precision of information about fundamen\ntal, ρθBθ ? Interpret.\nDoes this modification of the model allow to capture effect of higher-order beliefs\nindependent of first-order beliefs?\n2. Consider the following information structure. Each agent gets private signal xi =\nθ + u + ti and public signal y = θ + ζ where ti, u and ζ are independently nor\nmally distributed with zero means and precisions τE, τu and τζ , respectively. Find\nV[A|θ, Bθ] in this model. How is your answer related to your finding in question 1.\n(for this question you may assume that θ ∼N (0, inf).)\n3. Consider two period version of continuous population model. Suppose that θt =\nθ + tt, t = 1, 2 where tt ∼N (0, 1) are independent across periods. Consider the\nfollowing version of correlated equilibrium. Best-response in first period is\na1 = (1 - r)E[θ1|a1] + rE[A1|a1],\nbest-response in second period is\na2 = (1 - r)E[θ1|a1, a2] + rE[A2|a1, a2]\ni = 1, 2. The model is\n⎞\n⎛\n⎞\n⎛\n⎛\n⎞\n⎛\n⎞\n⎠\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎠\nθ1\n∗\n∗\n∗\n∗\n∗\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎝\nθ2\na1\na2\nA1\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎠\n∼N\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎝\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎝\nμa1\nμa2\nμA1\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎟\n⎠\n,\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎜\n⎝\n√\n√\n∗\n∗\n∗\n∗\nρθ1a1 σa1 2\nρθ1a1 σa1 2\nσ2\n∗\n∗\n∗\na1\n√\n√\nρθ1a2 σa2 2\nρθ2a2 σa2 2\nρa1a2 σa1 σa2\nσ2\n∗\n∗\na2\n√\n√\nσ2\n∗\nA1\nρθ1A1 σA1 2 ρθ1A1 σA1 2 ρA1a1 σA1 σa1 ρA1a2 σA1 σa2\n√\n√\nA2\nμA2\nρθ1A2 σA2 2 ρθ2A2 σA2 2 ρA2a1 σA2 σa1 ρA2a2 σA2 σa2 ρA2A1\nDenote by ρb1 = E[θ|a1] and ρb2 = E[θ|a1, a2]. One could think of ρb2θ/ρb1 as\nθ\nθ\nθ\nθ\nθ\nspeed of learning and ρA2θ/ρA1θ as inertia. Explore what is the maximal intertia\none could get given speed of learning. What is the dependence of level of strategic\ncomplementarity/substitutability r? How is this model related to BNE of game\nwith signals?\nσ2\nσA2 σA1\nA2\n\n2 Optimal Monetary Policy with Heterogeneous In\nformation.\nShow that in a standard New Keynesian model with only i.i.d. TFP shocks and heteroge\nneous informaion about shocks price stabilization is an optimal monetary policy (carried\nafter observation of TFP shock).1\n3 Information Capacity Constratints.\nSuppose agents have the following objective function:\nπi = -E [ki - ((1 - ξ)θ + ξK + ηi)]2\nwhere ηi ∼ N(0, αη) is an idiosyncratic shock that is not directly observable by the agents.\nThe prior on θ is N(μ, αμ) and, before choosing ki agents observe private signals about θ\nand ηi:\nxi = θ + ti\nsi = ηi + χi\nwhere ti ∼ N(0, αE) and χi ∼ N(0, αs).\n1. Conjecture that the equilibrium decision rule is of the form:\nki = γ0μ + γ1xi + γ2si\nand solve for coefficients.\n2. Now suppose the agent can choose the precision of the signals he receives subject\nto a capacity constraint:\n+\n≥ λ.\nαx\nαs\nSolve for the equilibrium αx and αs.\n3. How does the degree of complementarity ξ affect αx and αs. Interpret.\n1Formulization is part of a problem.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.161 Advanced Macroeconomics I\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}