{
  "course_name": "Advanced Circuit Techniques",
  "course_description": "Following a brief classroom discussion of relevant principles, each student in this course completes the paper design of several advanced circuits such as multiplexers, sample-and-holds, gain-controlled amplifiers, analog multipliers, digital-to-analog or analog-to-digital converters, and power amplifiers. One of each student’s designs is presented to the class, and one may be built and evaluated. Associated laboratory assignments emphasize the use of modern analog building blocks. This course is worth 12 Engineering Design Points.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Electric Power",
    "Electronics",
    "Engineering",
    "Electrical Engineering",
    "Electric Power",
    "Electronics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nObjectives and Organization\n\nMost of the professional subjects you have taken at MIT effectively coach you in methods for solving relatively well-defined problems that have only one correct answer. As you might expect from your contact with the real world, typical design problems are not nearly so tightly constrained. In the real world, the imagination and creativity of the designer, rather than her ability to remember formulas or to number crunch, are the ingredients essential to success. An infinity of adequate solutions exist to all realistic design problems; the more talented engineers select from the better of the possible solutions.\n\nOur objective in 6.331 is to give you practice in the area of analog and hybrid (analog-digital) circuit design by forcing you to exercise creative skills. Various formats could be used; for example, a project-laboratory approach would accomplish some of the objectives. However, pure laboratory subjects are relatively inefficient in that a disproportionate amount of time is spent locating test equipment, chasing broken wires, etc.\n\nThe format we will use involves discussing the ways that a particular function can be accomplished for a period of several weeks. These introductions are kept non-rigorous and informal (there is no need to prove anything - we have history on our side!), with maximum \"round-table\" - type participation. Following each discussion, a design problem is assigned in the form of a specification sheet. The objective is to complete a paper design of a circuit that meets the specifications. The paper design should be detailed, neat, and in a form that a technician might reasonably be expected to work from. Unspecified component types or values are unacceptable. A description of the operation of the circuit, emphasizing its important features, and analysis demonstrating conformity with specifications are required.\n\nThe specific topics chosen for discussion are relatively unimportant, since our objective of developing design skills can be accomplished via a variety of vehicles. In the past we have drawn topics from the area of data-conversion equipment (digital-to-analog converters, analog-to-digital converters, and related circuits), since this is an area that presently offers exciting employment opportunities and because of my own professional interests. However, I will be happy to use alternative examples if the class can reach any sort of consensus.\n\nLaboratory\n\nWe also anticipate a substantial laboratory effort as part of 6.331. Some laboratory involvement will be directly related to design problems, but the major emphasis will focus on the use of modern analog integrated circuits. Certain laboratory exercises will be assigned; however, we encourage you to suggest lab topics in areas of interest to you.\n\nThe format described above can result in a \"lumpy'' work load, with peaks occurring when design problems and labs are due. We intend to equalize the work load, not by leveling the peaks but by filling in the valleys. It is expected that the total work load will be higher than that normally anticipated in a graduate H-level subject. Homework will be assigned during periods when design problems are not in progress. The homework will concentrate on modeling, feedback, and circuit techniques that provide background for creative design efforts. It will include more advanced problems of the general type you encountered in 6.301 and 6.302.\n\nWe have found that there are certain topics (for example, dealing with laboratory and homework) that do not conveniently fit into our regularly scheduled format. In order to devote sufficient time to these topics we will meet for a third class period each week. We will schedule this third session during the first week of the term.\n\nAs mentioned earlier, the department has committed a substantial quantity of components exclusively for our use. These devices will be used for the laboratory portion of the subject described earlier. They also can be used to resolve any difference of opinion between staff and student concerning the feasibility of a particular design.\n\nGrading Policy\n\nThe staff will review your designs, and will provide comments concerning our impressions of the strong points or possible weaknesses of the designs. These comments will be conveyed in individual conferences. You will be asked to present one of your designs to the entire class in an attempt to encourage \"design-review\" type discussion and to illustrate alternative approaches.\n\nAn overall grade of 1, 2, or 3 will be assigned according to the following guidelines: a grade of 1 indicates a particularly imaginative or complete design effort; a grade of 2 is assigned to a design with no major deficiencies that should be obvious to the author of the design; a grade of 3 indicates that, in the opinion of the staff, errors were made that the student should have been able to avoid. Clearly, grades will be a function of our assessment of the background of a particular student. Students with relatively less design experience will not be penalized unfairly.\n\nYour grade in 6.331 will be based on your performance on design problems, homework sets, and in the laboratory. A passing grade will not be granted unless all assignments are completed. Further, since our schedule also gets hectic toward the end of the term, it is essential that material be handed in on time. You will be loaned certain components in addition to the usual lab kit for use in 6.331. While the department will be generous with components for a project, and tolerant of reasonable but destructive errors, we cannot afford to donate large quantities of components to you. Thus no grade will be assigned until a reasonable amount of material has been returned.\n\nPrerequisites: 6.301 and 6.302\n\nExperience shows that the background provided by 6.301 and 6.302 is essential to successful participation in 6.331. No \"or equivalents\" seem to exist. Thus these subjects must be firm prerequisites. The format described above works best with a limited number of students, so we reserve the right to limit enrollment, on a possibly arbitrary basis, in order to maintain a manageable class size.\n\nReferences\n\nRoberge, J. K.\nOperational Amplifiers: Theory and Practice\n. New York, NY: Wiley, 1975. ISBN: 9764423051.\n\nLundberg, K. H.\nBecome One with the Transistor: for Solid State Circuits\n. Unpublished, 2003.\n\nLundberg, K. H.\nFeedback Control Systems for Analog Circuit Design\n. Unpublished, 2003.\n\nGrebene, A. B.\nBipolar and MOS Analog Integrated Circuit Design\n. New York, NY: Wiley, 1984. ISBN: 0471085294.\n\nPease, R. A.\nTroubleshooting Analog Circuits\n. Boston, MA: Butterworth-Heinemann, 1991. ISBN: 0750694998.\n\nWilliams, J., ed.\nAnalog Circuit Design: Art, Science, and Personalities\n. Boston, MA: Butterworth-Heinemann, 1991. ISBN: 0750696400.\n\nWilliams, J., ed.\nThe Art and Science of Analog Circuit Design\n. Boston, MA: Butterworth-Heinemann, 1995. ISBN: 0750695056.\n\nLee, T. H.\nThe Design of CMOS Radio-Frequency Integrated Circuits\n. Cambridge, MA: Cambridge University Press, 1998. ISBN: 0521639220.\n\nGray, P. R., Hurst, P. J., Lewis, S. H., and Meyer, R. G.\nAnalysis and Design of Analog Integrated Circuits\n. 4th ed. New York, NY: Wiley, 2001. ISBN: 0471321680.\n\nGray, P. E., and C. L. Searle.\nElectronic Principles: Physics, Models, and Circuits\n. New York, NY: Wiley, 1969. ISBN: 0471323985.",
  "files": [
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/e76a9be2014b6dd51597e87b1669d604_ps1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : February 5, 2002\nProblem Set 1\nDue : Friday, February 8, 2002\nYou should feel comfortable (although not necessarily ecstatic) with these problems if you\nintend to take 6.331.\nProblem 1 A bipolar transistor with fT = 100 GHz is operating a IC = 0.1 μA. Using the\ncharge control model, find the forward charge in the base, qF. How many electrons is\nthis?\nProblem 2 Determine the transistors that actually contribute to signal amplification for\neach of the following amplifiers\n(a) μA733\n(b) μA741\n(c) LF357\n(d) OP-37\nProblem 3 An operational amplifier is available with a fixed, unloaded open-loop transfer\nfunction\nA(s) =\n10-2s + 1\nThis amplifier is to be used as a unity-gain inverter. A load capacitor adds a pole at\ns = -106 radians per second to the unloaded open-loop transfer function. Compensate\nthis configuration with an input lead network so that its loop-transmission magnitude\nis inversely proportional to frequency from low frequencies to a factor of five beyond the\ncrossover frequency. Choose element values to maximize crossover frequency subject\nto this constraint. Assume high input impedance for the amplifier.\nProblem 4 A two-stage operational amplifier is connected as an inverting differentiator\nwith a feedback resistor of 100 kΩand an input capacitor of 1 μF. What type of minor-\nloop compensating network should be used to stabilize this configuration? Determine\nelement values that result in a predicted crossover frequency of 104 radians per second\nwith a value of 0.2 m0 for input-stage transconductance.\nWhen this type of compensation is tried using an LM301A operational amplifier, minor\nloop stability is unacceptable, and it is necessary to shunt the compensation terminals\nwith a 3-pF capacitor in addition to the network developed above for satisfactory\nperformance. Describe the effect of this modification on closed-loop performance."
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/f11fbb8d43352cb6b59fa6779abd7665_ps2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : February 8, 2002\nProblem Set 2\nDue : Friday, February 15, 2002\nProblem 1 Consider the sample-and-hold circuit shown below.\n-\n+\nLM110\nvO\nvI\ncontrol\n+VS\n-VS\nFigure 2.1: Sample and Hold Circuit\nThe open-loop transfer function of the op amp is\nA(s) =\n(0.01s + 1)(5(10-8)s + 1)2\nand the closed-loop bandwidth of the LM110 amplifier is in excess of 20 MHz. The\nsum of the FET on resistance and the resistor shunting the current-booster transis-\ntors is 1 kΩ, and the capacitor value is 1 μF. Investigate the stability of this system\nunder small-signal conditions of operation. Suggest a circuit modification that can be\nused to improve stability. Comment of the effectiveness of your method under large-\nsignal conditions (with the booster transistors conducting) as well as for linear-region\noperation.\n\nProblem 2 It was mentioned in class that the real part of the input impedance of a ca-\npacitively loaded emitter follower can be negative. Demonstrate this possibility by\ncalculating the incremental input impedance for the connection shown.\nI\nCE\nVIN\nVCC\nFigure 2.2: Capacitively Loaded Emitter Follower Circuit\nUse a simplified incremental model for the transistor, including only rπ, cπ, and gm.\nAlso show that for sufficiently large values of CE, the real part of the input resistance\nwill be positive at all frequencies, and determine the critical value for CE in terms of\ntransistor parameters.\nSketch plots of the magnitude and phase of Zin for the two cases where CE is larger\nand smaller than the critical value determined above.\nProblem 3 Consider the problem of minimizing the additive error of a very fast sampler\nwith a long hold time by \"ganging-up\" a series of sample and holds. For example using\na τH/τS quotient of ten, the first sampler has a sample time of one nanosecond and a\nhold time of 10ns, the second sampler has τS = 10ns and τH = 100ns, etc.\nAssume that the error of each stage is dominated by hold-time droop, and that it is\nproportional to the τH/τS quotient of each stage.\nAssume we want a sample time of one nanosecond and a hold time of one second.\nWhat is the optimum τH/τS quotient? How many sample and holds will we need?"
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/72c24d9cfbf72e54483e9b0abc2e0da6_ps3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : February 22, 2002\nProblem Set 3\nDue : Friday, March 1, 2002\nProblem 1 Consider the four-diode-switch sample and hold circuit:\nI1\n+15V\nVIN\n-15V\nS1\nVo\n100pF\nI2\nS2\nFigure 3.1: Four Diode Switch Circuit\nIn the sample mode, switches S1 and S2 are open, thus allowing the currents I1 and\nI2 to bias the diodes in the usual manner. In the hold mode, S1 and S2 are closed.\nThus the diodes are reverse biased, insuring a rapid turn-off. This problem investigates\nthe various sources of error inherent in this design. For each source of error, indicate\nwhether it results in an offset error or a scale factor error.\n(a) Let I1 = 10 mA, I2 = 9 mA. What is the maximum slew rate of the hold capacitor\nvoltage in both the positive and negative directions? If the circuit is in equilibrium\nin the sample mode, what is the error caused by the given current imbalance? Use\nthe diode model:\niD = ISeqvD/kT\nIS = 10-13A\n(b) Assume that I1 = I2 = 10 mA. How long does it take for this circuit to slew 10\nvolts? Sample mode is ended when S1 and S2 close. If the switches don't close\nsimultaneously, an error is introduced. Evaluate this error for the case in which\nS1 closes 1 ns late.\n\n(c) Assume that each diode is shunted by 10pF of stray capacitance. There will be\ncharge dumped through this capacitance when the switches close. Evaluate the\neffects of this charge dump. Assume that all of the stray capacitances are equal,\nbut the equilibrium output level was +5 V just before the switches were closed.\n(d) Assume that I1 = I2 = 10 mA, and the circuit is in equilibrium in the sample\nmode. Consider the circuit's response to small changes in vi. Use an incremental\ndiode model. This analysis is valid as long as |vo -vi| is on the order of kT/q.\nCompute the response to a step change in vi. What is the 0.1% settling time?\nWhat is the response if vi is a ramp?\nProblem 2 Consider the following loop transfer functions:\nL1(s) = 106\ns\nL2(s) = 106\ns + 1\nL3(s) = 1010(10-4s + 1)\ns2\nL4(s) = 106(10-4s + 1)\n(10-2s + 1)2\nFor each loop transfer function:\n(a) Plot an asymptotic Bode Plot.\n(b) Find the open loop DC gain, the crossover frequency ωc, and the phase margin\nφM.\n(c) Find the error transfer function, assuming that the above loop transfer functions\ndescribe op amp circuits with unity feedback.\n(d) Find the steady state error to a 1 V step input.\n(e) Use synthetic division to find the first three error coefficients of the error series,\ne0, e1, and e2.\n(f) For a unit ramp input, the steady state error grows as\ness = e0t + e1\nFind the steady state error ess to an input ramp with a slope of 1 V/μs. Comment\non the relative magnitude and measurability of these errors.\n(g) Use MATLAB to simulate (with lsim) the actual error response to the above\nramp. Show and comment on the fast transient versus the slow transient.\nProblem 3 An operational amplifier connected as a unity-gain non-inverting amplifier is\nexcited with an input signal\nvi(t) = 5 arctan(105t)\nEstimate the error between the actual and ideal outputs assuming that the open-loop\ntransfer function can be approximated as indicated below. (Note that these transfer\nfunctions all have identical values for unity-gain frequency.)\n(a) a(s) = 107/s\n(b) a(s) = 1013(10-6s + 1)/s2\n(c) a(s) = 1019(10-6s + 1)2/s3"
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/4d6b53e9ffab22eb51e29010c9a511c5_ps4.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : March 8, 2002\nProblem Set 4\nDue : Friday, March 15, 2002\nProblem 1 The flyback converter shown in Figure 4.1 is operating in steady state with a\nconstant frequency PWM-type switch drive at a switching frequency of 100kHz.\nC=20μF\nRL=50Ω\nL=150μH\nIL\nID\nVL\nIIN\nVIN=75V\n+\nFigure 4.1: Flyback Converter\nA. Determine the relationship between the output voltage VO, the input voltage VI,\nand the duty cycle (D) of the switch drive. Explain why this topology is sometimes\ncalled a \"buck-boost\" or \"up-down\" converter.\nB. Assume that the duty cycle of the switch drive is D = 0.4. Determine the average\nvalue of iin, the average value of vout, and the peak-to-peak magnitude of the\noutput voltage ripple. Sketch iL and vL for a switching cycle.\nC. Determine the transfer function which relates the incremental changes in output\nvoltage to a small perturbation in D. Comment on the nature of this transfer\nfunction.\nD. Assume the on resistance of the switch is Ron = 1Ω, and the forward voltage drop\nof the diode is 0.35V + 0.1ΩiD. Estimate the power dissipation in the switch and\nthe diode.\n\nProblem 2 This problem examines the switching performance of a common base amplifier.\nThe transistor parameters are βF = 100, βR = 5, τF = 0.5 ns, τR = 1 ns, and τS = 7.55\nns. Ignore the effects of the space charge layers. The transistor is connected as shown\nin Figure 4.5.\n-10.6 V\nC\nFigure 4.5: Switched-emitter common base amplifier\nA. Assume that C = 0 and qF = qR = 0 for t < 0. The switch is closed at time t = 0.\nDetermine equations that describe the growth of qF and iC as functions of time.\nB. The test described above is repeated with capacitor C included. What value of C\nminimizes the time required for the transistor to reach steady-state values of qF\nand iC?\nNow suppose the circuit is changed to Figure 4.6 (you may assume that VCEsat for the\ntransistor is zero).\n-10.6 V\nC\n+9.4 V\n1 k\nFigure 4.6: Switched-emitter common base amplifier\n\nC. Again assume C = 0 and qF = qR = 0 for t < 0 and that the switch is closed at\ntime t = 0. How long does the transistor remain in the forward-active region?\nD. The switch is kept closed until the transistor reaches steady state in saturation.\nWhat are the values of qF, qR, qB0, and qS in the steady state? (Recall that qB0\nis the base charge required to get to the edge of saturation.)\nE. The test described in part C is repeated with capacitor C included. What value of\nC minimizes the time required to reach steady-state saturation?\nF. Once steady-state saturation has been reached, the switch is opened. What is the\nvalue of iB immediately after the switch is opened?\nG. How long after the switch is opened does the transistor remain in saturation?\nH. Sketch the general form of the base charge distribution shortly after the switch is\nopened (part F) and at the instant the transistor enters the forward active region\n(following the time determined in part G)."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/ce01e5d97810d4d2bc1aebf5bb656bfe_ps5.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : April 12, 2002\nProblem Set 5\nDue : Friday, April 19, 2002\nProblem 1 Consider the resonant oscillator in Figure 5.2. We wish to examine the condi-\ntions under which the circuit will oscillate. To make the analysis tractable, however,\nwe must make the following simplifying assumption.\n+VS\nio\nvo\n+\n-\nIBIAS\nR\nL\nC\nvo\nFigure 5.2: Resonant oscillator circuit\nRecall that the output current (io) of an emitter-coupled pair is a hyperbolic tangent\nfunction of the input voltage (vo). While very accurate, such a relationship between io\nand vo is too complicated for describing function analysis to be applied. Instead, we will\ncharacterize the emitter-coupled pair by the piecewise linear I/V curve in Figure 5.3.\n-2VT\n2VT\nIBIAS\nIBIAS\n-\nFigure 5.3: Piecewise linear I/V curve\n\nNote that the incremental variables io and vo have been plotted, which is why io can\nbe negative. Note also that the slope near vo = 0 is consistent with the small-signal\nmodel of the transistors.\nA. Using describing functions, find the condition on IBIAS such that the circuit will\noscillate. (Hint: relate vo(s) to io(s) so that a block diagram of the form in Fig-\nure 5.4 can be drawn. You may need to read Section 6.3 in Operational Amplifiers\nif you are unfamiliar with describing functions.)\nG(s)\nFigure 5.4: Block diagram with describing function\nB. Let L = 0.1μH, C = 1000 pF, R = 1 kΩ, and IBIAS = 200μA. Using the describing\nfunction analysis from part A, compute the frequency and amplitude of the output\nof the oscillator (vo).\nC. As an estimate of distortion, compute the ratio of the third harmonic to the first\nharmonic on the output voltage (vo). Is the number larger or smaller than you\nexpected? Explain.\n\nProblem 2 While simple limiters can be used to establish the amplitude of an oscillator's\noutput, they do so at the cost of some distortion. If much lower distortion is desired,\none can use an amplitude control loop, as suggested in Figure 5.5. Such a control\nloop operates in the following manner. If the output amplitude is determined to be\ntoo small, the control loop adjusts a parameter (in this case the bias current) in such\na way as to place the poles of the oscillator in the right-half plane, which causes the\namplitude of the oscillation to grow. Similarly, if the output amplitude is too large, the\ncontrol loop adjusts the parameter to place the poles of the oscillator in the left-half\nplane, which causes the amplitude of the oscillation to decay. In the steady state, the\npoles are placed precisely on the imaginary axis, and the output amplitude is constant.\n+VS\nio\nvo\n+\n-\nvo\nAmplitude\nMeasuring\nCircuit\n1kΩ\n0.1\nμH\npF\na(s)\nΣ\n100kΩ\nRE\neA\neref\n+\n-\nFigure 5.5: Amplitude-stabilized resonant oscillator circuit\nThe amplitude measuring circuit could be based on a full-wave rectifier, as in Problem\nSet 1, but the details are not important for this problem. All you need to know about\nit is that its gain is unity; that is, if the input to the amplitude measuring circuit is\nvI = E sin ωt, its output has a DC average of E.\nA. What is the voltage across RE in the steady state?\nB. To minimize distortion, we want the output amplitude to be 0.1VT. Choose a(s)\nand eref such that this amplitude is exactly maintained, the crossover frequency of\nthe amplitude control loop equals 100 krad/s, and the phase margin is 75 degrees.\nComment: the most difficult part of this problem is properly modelling the dy-\nnamics of amplitude growth and decay."
    },
    {
      "category": "Resource",
      "title": "ps6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/4f24d1457c990591c1ca0331b845357c_ps6.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nSpring Term 2002\nIssued : April 19, 2002\nProblem Set 6\nDue : Friday, April 26, 2002\nPhase Locked Loops This problem set illustrates many of the important concepts in-\nvolved in the design of phase locked loops.\nProblem 1 Figure 6.1 illustrates a linearized block diagram for a phase locked loop (PLL).\nNotice that some of the variables represent a phase (the derivative of phase is fre-\nquency), and some of the variables represent voltages. The scale factor for the phase\ndetector is KD volts/rad. The frequency output from the voltage controlled oscillator\n(VCO) is\nωo = ωc + KOVi\nthus KO has units of rad/v-sec.\nK0\ns\nVD\nΘI\nΘO\nLOOP\nFILTER\nF(s)\nKD\nPHASE DETECTOR\n+\n+\nVo\n-\n+\nVCO\nFigure 6.1: PLL block diagram\nA. First Order Loop: Assume that the PLL is locked onto an input frequency ω1\nrad/sec away from the VCO center frequency. Let F(s) = 1, so the loop trans-\nmission will be first order. What is the steady state phase error?\nAssume that the phase detector will only function properly over the range -π <\nθe < +π. How does this limit the operating frequency range (the lock range) of\nthe PLL? If vD is a constant voltage, what is the lock range?\nSketch a Bode plot of H(s) = θO(s)/θI(s). What is the relationship between the\nsteady state error and the loop bandwidth (i.e. the bandwidth of H(s))?\n\nB. Second Order Loop: Assume that the loop is locked onto an input frequency of\nω1 rad/sec. Let F(s) = 1/τs. Is this loop stable?\nPerhaps a better candidate for F(s) is (τ2s + 1)/τ1s. Sketch a Bode plot of the\nloop transmission. How do you choose τ1 and τ2 so that the loop will have a phase\nmargin of 45*? What is the steady state phase error? What is the lock range?\nC. Higher Order Loops: Sometimes it is desirable to track linear FM (the input is\na ramp in frequency). What does this suggest about the required F(s)?\nD. Multiplier Phase Detectors: An analog multiplier can be used to implement\na phase detector.\nAssume that the input is A sin ωt and the VCO output is\nB sin(ωt + θe).\nWhat is the phase detector output? Assume that the loop will filter out all of the\nhigh frequency components. Sketch the output voltage versus the phase error.\nWhat is the scale factor of the phase detector?\nThe multiplier phase detector is used in conjunction with a second order PLL as in\npart B. Explain how the magnitude of the input signal affects the loop bandwidth\nand stability.\nLet F(s) = (τs+1)2/s2. Assume that the loop is stable for sufficiently large input\namplitudes. Use root locus techniques to demonstrate the effects of reducing the\ninput signal amplitude.\nE. Finite State Machine Phase Detector :\n+5V\nD\nR\nQ\n+5V\nD\nR\nQ\n-\n+\nvD\nR\nR\nR\nR\nI1\nI2\nFigure 6.2: FSM phase detector\nThis circuit uses two \"D\" flip flops and a NAND gate. Assume that a Logic 1 is\n+5 V, and a logic 0 is 0 V. For a \"D\" flip flop, the Q output is set equal to the D\ninput on the rising edge of the clock input, and is set equal to 0 when the reset\ninput is 0.\nAssume that I1 and I2 are 5 volt square waves of frequency ω0. Relate the average\nvalue of vout to the phase difference between I1 and I2. What is KD? What is the\nmaximum allowable range of phase shift?\n\nIf this phase detector is used in a PLL, which input (I1 or I2) should be connected\nto the VCO output? (Assume that the VCO output frequency increases when the\naverage value of vout increases.)\nF. Many State Machine Phase Detector :\nτ2s+1\nτ1s\nK0\ns\nLOOP\nFILTER\nPHASE DETECTOR\n8-BIT UP/DOWN\nCOUNTER\nD/A\nDOWN\nUP\nVo\nVI\nVCO\nFigure 6.3: Alternative Digital Phase Detector\nThis circuit employs an 8-bit up/down counter and a D/A converter. Assume that\nthe VCO output and the input are both square waves. The counter increments\nfor each input pulse and decrements for each VCO pulse. The range of vO is ±10\nvolts.\nWhen the loop is locked, what is the average value of vO? What is KD? What is\nthe allowed range of phase error?\nG. Noise: Digital phase detectors may be useful even if the input signal is not a\nsquare wave. Typically, a comparator is used to detect each zero-crossing of the\ninput signal, thus 'squaring up' the input. Assume that the input is processed by\nan infinite gain comparator.\n(Answer the following questions qualitatively.)\nDescribe the operation of the\ndigital phase detector if the input is a sine wave plus noise. How does this affect\nthe loop behavior?\nHow can this situation be improved if the noise is small\ncompared to the signal? Would a multiplier phase detector perform better in a\nnoisy enviornment?\nH. Spectral Purity: Consider the effects of an inferior VCO. Specifically, assume\nthat the VCO has a certain amount of phase jitter. This can be modelled by\ninjecting a disturbance at the point labelled vD in the diagram of Figure 6.1 and\nthen assuming that the VCO is \"clean\". What is the output jitter θO if the loop is\nlocked to a clean input signal? Consider the transfer function θO(s)/vD(s). How\nis the output jitter related to the loop bandwidth and gain?\n\nProblem 2 Consider the PLL shown below:\nK(τzs+1)\ns(τPs+1)\nFSM PHASE\nDETECTOR\nLIMITER\nK0\ns\nVD\nΘIN\nΘOUT\nLOOP FILTER\nFigure 6.4: PLL block diagram\nThe FSM phase detector is the same as the one examined in problem 1E (see Fig-\nure 6.2). The limiter \"clips\" its input signal such that its output lies within the range\n2 V≤output≤10 V. The VCO has a transfer function of KO/s.\nA. VCO: Assume the VCO operates as ωo = KOVi. Determine KO, such that the\nmaximum VCO output frequency is 50 kHz. What is the lock range of the PLL?\nWith no signal supplied to the input, what is the VCO frequency?\nB. Loop Filter: Consider a loop filter of the form\nF(s) = K(τZs + 1)\ns(τPs + 1)\nLet τP = 2 ms (a pole at 500 rad/sec). Choose values for K and τZ such that the\nloop has a crossover frequency of 100 rad/sec and a phase margin of 45*. (Keep\nthese values for the remainder of the problem.)\nC. Aquisition Time: Assume that the loop is initially in equilibrium and locked to\nan input signal at the low end of the lock range. The input frequency is then\nchanged (in a step-like manner) to a frequency at the high end of the lock range.\nApproximately how long does it take for the loop to acquire lock after the step\nchange?\nD. Loop Dynamics: A convenient way to measure the dynamic characteristics of the\nloop is to inject a small disturbance vD and observe the effects at the VCO input.\nWhat values do you estimate for the risetime and peak overshoot for this loop?"
    },
    {
      "category": "Resource",
      "title": "dp1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/1f74bfacb170072445cfb2d4aa66470d_dp1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nDesign Problem 1\nIssued : February 22, 2002\nSample and Hold\nDue : Friday, March 8, 2002\nDesign a sample-and-hold circuit for either (not both) of the sets of specifications listed\nbelow. Common requirements include operation from +15 and -15 volt supplies over a\ntemperature range of 0*C to +50*C. Assume that you are supplied the sampling pulse from\nTTL levels.\nHigh-Accuracy Circuit :\n- Input Range from -10 to +10 volts.\n- Total Sampling Time < 80 μs.\n- Output must be available immediately following sampling interval.\n- Hold Time > 0.5 s.\n- Total Error < 20 mV. (Include sampling error and droop)\n- Tracking Error < 10 mV for a 10 V/ms ramp.\n- Low impedance source.\n- Maximum Current drawn from source at any time < 1 mA.\n- Minimum Output Load = 1 kΩ\nHigh-Speed Circuit :\n- Input Range from -5 to +5 volts.\n- Total Sampling Time < 150 ns from 'begin' signal until switch open.\n- Output must be settled within 2 μs after sampling is completed.\n- Hold Time > 2 ms.\n- Total Error < 30 mV. (Include sampling error and droop)\n- Tracking Error < 20 mV for a 1 V/μs ramp.\n- Source Resistance = 1 kΩ\n- Maximum Current drawn from source at any time < 1 mA.\n- Minimum Output Load = 2 kΩ\nNote: You should include calculations to show that you meet all specifications. (You may\nfind our discussion on error coefficients of some help for the determination of ramp error.)"
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/d5cc7e77412c403ac59a237549bc952f_lab1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nLaboratory 1\nIssued : February 8, 2002\nOp-Amp or Oscillator?\nDue : Friday, February 22, 2002\nDesign, build, and test one of the following projects.\n1. The 741 operational amplifier can supply an output current of ±20 mA over an output\nvoltage range of ±12 volts. Design a unity-voltage-gain stage that can be added to\nthe output of the op amp to increase the output capability of the combination to at\nleast ±200 mA over a ±10-volt range. Your design should include current limiting to\nprotect it for shorts from the output of the stage to ground and power.\n2. Specifications for the LM101A operational amplifier indicate a maximum input bias\ncurrent of 100 nA and a maximum temperature coefficient of input offset current of\n0.2 nA per kelvin. These specifications apply over a temperature range of -55*C to\n+125*C. Precede this amplifier with a matched pair of 2N5963 transistors connected\nas emitter followers so that it can be used in applications that require very low input\ncurrents. Design the emitter-follower circuit using these transistors and any required\nbias-circuit components such that the bias current required at the input if the emitter\nfollowers is relatively independent of common-mode level over the range of ±10 volts.\nAlso, the drift referred to the input added to the complete circuit by the emitter\nfollowers must be less than ±2 μV per kelvin.\nMeasure the input current for the\nmodified amplifier. Estimate the differential input resistance of the modified amplifier.\n3. A sinusoidal oscillator can be constructed by connecting the output of a double inte-\ngrator to its input. Show that amplitude can be controlled by varying the magnitude\nof the shunt resistor in the feedback network. Design a complete circuit that can pro-\nduce a 20-V peak-to-peak output signal at 1 kHz. Use a 2N5459 FET for the control\nelement. Analyze your amplitude-control loop to show that it had acceptable stability\nand a crossover frequency compatible with the 1-kHz frequency of oscillation."
    },
    {
      "category": "Resource",
      "title": "dp2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/d658813013f46404863b1168273f0612_dp2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nDesign Problem 2\nIssued : March 15, 2002\nD/A Converter\nDue : Friday, April 12, 2002\nDesign a D/A converter for the following specifications. Your design should operate from\n15±0.5-volt supplies. Input digital signals are TTL compatible.\nDesign an 8 bit D/A converter which provides an unloaded scale factor of 2.5V/MSB\nand has a settling time of 50 ns to 1/2 LSB. The circuit should have an output resistance\nless than 500Ωand will not be loaded with more than 10pF of capacitance when high speed\noperation is required. Your design should operate over a temperature range of 25*± 10*C.\nThis design is not intended for integration, so the use of unlimited numbers of components\nis discouraged.\nIn order to simplify your design of the high speed DAC, you may have an unloaded scale\nfactor of either plus or minus 2.5V/MSB. The output may be either positive, negative, or\nboth (which ever is most convenient for your design), however, the output voltage must be\nreferenced to ground.\nBuild a 2-bit version (MSB and LSB) of your design in order to demonstrate feasibility.\nWe would like to see your circuit operating. At checkoff, we will want to measure your scale\nfactor, TTL noise imunity, and settling time (with your window circuit)."
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/c0ea3fe66957c85f9f9bbae09a1dd663_lab2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nLaboratory 2\nIssued : March 15, 2002\nPower Converters\nDue : Friday, April 5, 2002\nDesign, build, and demonstrate a switching power supply that meets the following specs.\n(You may choose to build either the boost or flyback topology.)\nSpecifications\n- Output voltage: for the boost 20 V, for the flyback -10 V\n- Steady state error: Zero (use an integrator in the loop).\n- Output voltage ripple: ≤200 mVpp (peak-to-peak)\n- Input voltage range: 8 V ≤Vin ≤16 V\n- Input ripple current (calculated): ≤10 mA rms\n- Output power: 5 watts\n- Small signal bandwidth: ≥5 kHz\n- Small signal step overshoot: ≤10%\nLab Hints\nBuild your converter in stages rather than attempting to construct and test the entire loop\nin one smoke-producing flip of the switch.\n1. Build the switching section\n- use ceramic capacitors for the main filtering caps in your converter. use elec-\ntrolytics only for damping legs.\n- drive the switch with a function generator (D = 0.5 or whatever)\n- start with a small input voltage (Vin = 0.5 V or so)\n- if the waveforms look ok, gradually increase Vin\n- use the function generator's symmetry control to vary D, and convince yourself\nthat the converter is operating correctly.\n2. Build the controller section\n- test the controller section using \"fake\" inputs\n\n- use lab kit supplies to power controller circuitry (not Vin supply)\n- verify proper operation before attempting to close the loop\n3. Consider start-up details before closing the loop.\n- soft-start\n- current-limit\n- duty-cycle limit\n4. Pray, sacrifice a token 3904, then power up the closed-loop system"
    },
    {
      "category": "Resource",
      "title": "dp3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/2c8114e7497ae1eda962b66337bd3dc3_dp3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nDesign Problem 3\nIssued : April 19, 2002\nA/D Converter\nDue : Friday, May 10, 2002\nDesign any one of the following A/D converters:\nHigh-Accuracy Circuit: 12 bits, 1 second conversion time. You may not use any tech-\nnique (successive approximation or otherwise) which places a D/A in a feedback loop\nto perform the A/D function.\nHigh-Speed Circuit: 10 bits, 10 μs conversion time. Because we anticipate a more sub-\nstantial design effort than simply connecting a single chip to a high speed D/A, you\nmay not use a successive approximation technique for this design.\nLow-Power Circuit: 10 bits, 0.1 second conversion time, absolute minimum power con-\nsumption. Any technique is allowed for this design. To compute the power consump-\ntion, assume that a conversion is performed every 0.1 second.\nCommon Specifications:\n- Power Supplies: ±15 volts, with an accuracy of ±0.5 volt.\n- Temperature: 25*± 10*C.\n- Input Range: 0 to +10 volts\n- Source Impedance: 1 kΩ\nThe converter is allowed to have periodic auto-calibrating cycles if necessary. You may\nspecify whether or not the user must precede the A/D converter with a sample and hold. In\nyour write-up, analyze the performance of your design with respect to monotonicity, absolute\nand relative accuracy, the addition of noise on the input, the effects of temperature, and the\nvariations of power supply voltages.\nThe restrictions on the first two designs is only to encourage thoughtful design and not\nto discourage the future use of successive approximators. If you have any questions about\nwhat is allowed for a design or if you would like to work on a design to a different set of\nspecifications, please talk to one of the staffearly in your design effort."
    },
    {
      "category": "Resource",
      "title": "lab3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/82a699243437c9217f47822034943ca7_lab3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering\n6.331 Advanced Circuit Techniques\nLaboratory 3\nIssued : April 19, 2002\nPhase Lock Loops\nDue : Friday, May 3, 2002\nIn this lab you will investigate phase lock loop (PLL) operation using the CMOS 4046 integrated\ncircuit. It contains two different phase detectors and a VCO. It also includes a zener diode reference\nfor power supply regulation and a buffer for the demodulator output. The user must supply the\nloop filter. The high input impedances and low output impedances of the 4046 make it easy to\nselect external components.\nNotes\n1. This lab is complicated. Be sure that you understand how the circuits are supposed to work\nbefore coming into the lab. Do not try to build something that you have not fully analyzed.\nRead this entire assignment before beginning to work on it.\n2. Data taken in Part 1 will be needed in order to complete your designs in the rest of the lab,\ntherefore, do this part carefully.\n3. Handle the 4046 with care. CMOS integrated circuits are easily destroyed. Avoid static\ndischarges. Use a 10kΩresistor to couple the signal generator to the PLL. Turn offthe signal\ngenerator before turning offpower to the 4046, or else you will power up the entire circuit\nfrom the signal input. Avoid shorting the outputs to ground or the supply. A TTL gate can\nwithstand this kind of abuse, but CMOS cannot (be careful of loose wires). CMOS does not\nhave the output strength to drive capacitive loads. VSS should be connected to ground, VDD\nshould be connected to 5V, and pin 5 should be connected to ground (otherwise the VCO in\ninhibited).\nVCO Operation\nRead the circuit description in the datasheet. The VCO constant (KO in radians/sec-volt) is the\nratio of the change in operating frequency to the change in input voltage (on pin 9). Measure\nKO, that is, graph the output frequency versus the input voltage. Be sure that your data covers\nthe range from 5 kHz to 50 kHz. Make the measurements with various values1 of R1, R2, and C.\nApproximately, how is KO related to R1, R2, and C? Measure the rise and fall times of the VCO\noutput. Investigate the effects of capacitive loading.\nPassive Loop Filters\nThe loop filter is placed between the phase detector output and the VCO input. This filter at-\ntenuates the high frequency harmonics present in the phase detector output. It also controls loop\n1UNDER NO CIRCUMSTANCES use R1 or R2 less than 50kΩ.\n\ndynamics. Often a simple RC filter will function adequately. These designs avoid embarassing level\nshifting and output limiting problems inherent in active filter designs. On the other hand, active\nfilters may offer superior performance.\n2.1\nPhase Comparator II\nBefore continuing, consider the output of phase comparator II of the 4046. The output is a tristate\ndevice. This causes a reduction of the ripple when the loop is locked. Instead of a 50% duty cycle\nbeat note at twice the fundamental, there is no beat note at all. Unfortunately, when one wishes to\nconstruct a block diagram for the loop, KD is not well-specified. When either the upper or lower\ndriver is on, the output looks like a voltage source, but when the output is floating, it is essentially\na current source (a source of 0 amps). Therefore the value of KD will depend on the specific filter.\nConsider Figure 1.\nPIN 13\nPD2\nOUTPUT\nVpo\nR3\nVD\nC1\nFigure 1: Phase comparator II output\nSo the phase comparator output is vPO = +5V when the upper driver is on, vPO = 0V when\nthe lower driver is on, and vPO = vD when the phase comparator is in the open state. We can find\nthe average value of the output:\nvPO\n=\n(5V ) θe\n2π + vD(1 -θe\n2π) = vD + (5 -vD) θe\n2π\nfor\nθe > 0\nvPO\n=\n(0V ) θe\n2π + vD(1 + θe\n2π) = vD + vD θe\n2π\nfor\nθe < 0\nNote that the value of KD depends on the value of vD. This makes the mathematics of the\nloop much more confusing. In fact KD is different for positive and negative phase errors when vD\nis not 2.5 volts. In order to get a usable output, we can modify the output to yield a fixed value of\nKD. To do this we can put an active element in to define the value of vD when the output is open.\nIn both Figures 2 and 4 the open value is defined as 2.5 volts which leads to an equal value of KD\nfor positive and negative θe. If you use phase comparator II with just an RC network, be sure to\nrealize that the loop dynamics may be considerably compromised at extremes of lock range.\nA simple second order PLL with \"passive\" loop filter is illustrated in Figure 2. Phase comparator\nII is used. When the loop is locked, the average phase detector output voltage is vD = 2.5 +\n2.5(θe/2π) volts. The incremental phase detector gain constant is then KD = 2.5/2π volts/radian.\nConsider the following specifications:\nloop crossover frequency\nωc = 1000 rad/s\nphase margin\nφm = 45*\ncenter frequency\nfO = 19 kHz\nphase detector\nII\n\nPHASE\nCOMPARATOR I\nPHASE\nCOMPARATOR\nII\nCOMPARATOR\nIN\nSIGNAL\nIN\nVCO\nSOURCE\nFOLLOWER\nDEMODULATOR\nOUT\nVCO IN\nPHASE PULSES\nPHASE COMP II OUT\nPHASE COMP I OUT\nVCO\nOUT\nZENER\n+5\nR2\nR1\nC\n+1\nLM310\n+5V\n10kΩ\nVD\nR3\nC1\n10kΩ\nFigure 2: \"Passive\" loop filter\nWhere we define the center frequency, fO, as the VCO output frequency when pin 9 is 2.5\nvolts.\nUsing the topology illustrated in Figure 2, design and build a circuit that meets these\nspecifications2.\nDocument your design with block diagrams and Bode plots of the magnitude and angle of the\nloop transmission. What is the steady state phase error and lock range? How do your predictions\nand measurements compare?\nThe phase margin of the loop may be deduced from measurements of the step response of the\nloop. One technique is to apply a FM signal to the input and look at the demodulated output.\nSpecifically, use a square wave to modulate the frequency of the function generator which you are\nusing for your input3. Observe the VCO input voltage. Measure the risetime and peak overshooot.\nAre these results compatible with a second order system with the specified crossover frequency and\nphase margin? NOTE: the frequency deviation should be very small so that the PLL does not\nbreak lock.\nR3\nVD\nC1\nR4\nVCO Input\nFigure 3: Lag loop filter\nThe loop filter is replaced by the lag network illustrated in Figure 3. It will allow you to set\nKO and ωc independently. Hence, the loop may have a wide lock range (as determined by KO) and\n2Hint: let R3C1 = 1 ms. Then C and R1 are chosen to set KO, while R2 determines fO.\n3If frequency generators are in short supply, consider using the VCO from another 4046.\n\na narrow bandwidth. Design and build a circuit to meet the following specifications:\nloop crossover frequency\nωc = 1000 rad/s\nphase margin\nφm = 45*\ncenter frequency\nfO = 19 kHz\nlock range\n9 kHz to 29 kHz\nphase detector\nII\nInclude the appropriate Bode plots.\nThe lag filter does not provide much attenuation of the high frequency ripple from the phase\ndetector. This is evident when you observe the voltage at the VCO input (pin 9). Place a capacitor\nacross R4 in order to increase the high frequency attenuation. If this pole is placed beyond the\nloop crossover frequency, there will be negligible change in the FM step response, except that the\nhigh frequency teeth will be removed.\nNow try increasing the FM frequency deviation so that the loop breaks lock. Note the response\nat the phase comparator output and VCO input.\n2.2\nXOR Phase Detector\nWhat happens if you substitute phase comparator I (an exclusive-or gate) for phase comparator\nII in the lag compensated PLL described in Part 2.1? You should be able to answer this question\ntheoretically and experimentally. Specifically, what is the phase detector gain KD, the loop band-\nwidth, the phase margin, the steady state phase error, the lock range, and the ease of acquiring\nlock (experimentally)?\nNote: if you have difficulty in acquiring lock, try slowly scanning the input frequency until the\ncircuit locks. Will this circuit lock on harmonics? Is the circuit duty cycle sensitive?\nActive Filters\nReturn to the lag compensated PLL using phase comparator II as in Part 2.1.\nApply a FM\nmodulated input to observe the step response as before. Look at the output of the phase comparator\n(pin 13).\nThe steady state phase error and dynamic tracking error should be apparent if you\nmentally average out the high frequency components4. Try varying the input frequency range.\nActive filters are used to reduce this tracking error. A possible active filter PLL realization is\nillustrated in Figure 4.\nCertain precautions must be taken when such filters are used. The opamp can easily supply\nvoltages to the 4046 that will burn it out. For this reason, it is a good idea to diode clamp the\ninputs to the PLL as shown. The low pass filter (R3 and C2) provides extra attenuation of the high\nfrequency phase detector ripple. It also should keep the opamp from slew rate limiting.\nAgain the active circuit specifies the open state output of phase detector II to be 2.5 volts.\nThe inverter is necessary because the PLL wants a non-inverting topology. R4C1 sets the crossover\nfrequency, and R2 sets the zero location, hence the stability. 1/(R3C2) should be set at least a\n4Note: If you find mental averaging unsatisfying, filtering vD with a simple passive RC filter with RC =\n0.1 ms will give you a picture of the average value of the phase error. To avoid loading the phase comparator\nwith a low impedance, make the resistor R a large value (1MΩis fine). IMPORTANT: this filter is not in\nthe loop, it is between the phase comparator output and the scope.\n\nPHASE\nCOMPARATOR I\nPHASE\nCOMPARATOR\nII\nCOMPARATOR\nIN\nSIGNAL\nIN\nVCO\nSOURCE\nFOLLOWER\nDEMODULATOR\nOUT\nVCO IN\nPHASE PULSES\nPHASE COMP II OUT\nPHASE COMP I OUT\nVCO\nOUT\nZENER\n+5\nR2\nR1\nC\n+5V\nC1\n10kΩ\n-\n+\nC2\nR3\n-\n+\n10kΩ\n10kΩ\n10kΩ\n+5V\n10kΩ\nR4\nFigure 4: Active loop filter\nfactor of 5 above ωc. KD is the same as before (as it would be for any loop filter which specified\nthe open state volatage of the phase detector as 2.5 volts).\nFeel free to design your own second order loop filter topology if you wish, just be careful not\nto destroy the 4046.\nDesign and build a PLL using an active loop filter to meet the folowing\nspecifications:\nloop crossover frequency\nωc = 1000 rad/s\nphase margin\nφm = 45*\ncenter frequency\nfO = 19 kHz\nlock range\n18 kHz to 20 kHz\nsteady state error\ness = 0\nphase detector\nII\nDraw the appropriate Bode plots. Make measurements of the step response. Again look at the\nphase detector output (pin 13). What can you say about the dynamic tracking error? What about\nthe steady state error?\nLinear Phase Detectors and Frequency Synthesis\nConsider the problem of trying to lock onto a signal in a composite mix of signals.\nThe zero\ncrossings of the composite signal may not coincide with the zero crossings of the signal you wish to\nlock to, thus the use of zero crossing sensitive phase detectors, such phase comparator II, or even\nXORs, is impossible.\nWe wish to use a linear phase detector that implements an analog multiplication of the composite\nsignal and the VCO output. Since the VCO output is a square wave (a series of ones and minus-\nones) we can relax our requirement to needing a multiplier that can multiply the incoming composite\nsignal by either 1 or -1 with minimal distortion.\n\n-\n+\n-\n+\nR\nPHASE\nDETECTOR\nOUT\nVCO\nOUTPUT\nSIGNAL\nIN\nCD4053\nR\nFigure 5: Linear Phase Detector\nConsider the circuit in Figure 5.\nWhat is KD for this phase detector?\nWhat will be the\nsteady-state phase error for a zero output?\nNote that KD will depend on the amplitude of the incoming signal. For the rest of this lab,\nassume that the signal that we wish to lock to has an amplitude of 300 mV peak-to-peak.\nNow, also consider the problem of wanting a VCO output frequency that is twice the input\nfrequency. By putting a divide-by-two block in the feedback path as in Figure 6, the closed loop\nsystem should implement a multiply-by-two function.\nφD\n÷Ν\nN=2\nLOOP\nFILTER\nVCO\nINPUT\nOUTPUT\nFigure 6: Multiply-by-two PLL\nDesign and build a circuit to meet the following specifications:\nloop crossover frequency\nωc = 100 rad/s\nphase margin\nφm = 45*\ncenter frequency\nfO = 38.0 kHz\nlock range\n18.5 kHz to 19.5 kHz\nsteady state error\ness = 0\nphase detector\nlinear\nNote that \"zero steady state phase error\" is not well defined for a frequency multiplier system.\nFor our purposes, we define \"zero steady state phase error\" to be when the positive going transistions\nof both the input and output coincide. Using a D-flipflop (74LS74) implement a divide-by-two block\nin the feedback path of your PLL. Be sure to include its effects in your loop analysis. Note that if\nthe phase detector has a steady state phase offset, you can compensate for this in your divide-by-\ntwo block. Phase shifts of ±90*or 180*can be accomplished by mixing the input and output of\nthe D-flipflop with the appropriate network of inverters and XOR gates.\nDraw the appropriate Bode plots. Make measurements of the step response. Again look at the\nphase detector output (pin 13). What can you say about the dynamic tracking error? What about\nthe steady state error?"
    },
    {
      "category": "Resource",
      "title": "4046.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/9b7f45098f1e52005ecb97ef17525e0e_4046.pdf",
      "content": "October 1987\nRevised January 1999\nCD4046BC\nMicropower Phase-Locked Loop\nGeneral Description\nThe CD4046BC micropower phase-locked loop (PLL) con\nsists of a low power, linear, voltage-controlled oscillator\n(VCO), a source follower, a zener diode, and two phase\ncomparators. The two phase comparators have a common\nsignal input and a common comparator input. The signal\ninput can be directly coupled for a large voltage signal, or\ncapacitively coupled to the self-biasing amplifier at the sig\nnal input for a small voltage signal.\nPhase comparator I, an exclusive OR gate, provides a digi\ntal error signal (phase comp. I Out) and maintains 90°\nphase shifts at the VCO center frequency. Between signal\ninput and comparator input (both at 50% duty cycle), it may\nlock onto the signal input frequencies that are close to har\nmonics of the VCO center frequency.\nPhase comparator II is an edge-controlled digital memory\nnetwork. It provides a digital error signal (phase comp. II\nOut) and lock-in signal (phase pulses) to indicate a locked\ncondition and maintains a 0° phase shift between signal\ninput and comparator input.\nThe linear voltage-controlled oscillator (VCO) produces an\noutput signal (VCO Out) whose frequency is determined by\nthe voltage at the VCOIN input, and the capacitor and resis\ntors connected to pin C1A, C1B, R1 and R2.\nThe source follower output of the VCOIN (demodulator Out)\nis used with an external resistor of 10 kΩ or more.\nThe INHIBIT input, when high, disables the VCO and\nsource follower to minimize standby power consumption.\nThe zener diode is provided for power supply regulation, if\nnecessary.\nFeatures\n■ Wide supply voltage range:\n3.0V to 18V\n■ Low dynamic power consumption: 70 μW (typ.) at fo =\n10 kHz, VDD = 5V\n■ VCO frequency: 1.3 MHz (typ.) at VDD = 10V\n■ Low frequency drift: 0.06%/°C at VDD = 10V with tem\nperature\n■ High VCO linearity: 1% (typ.)\nApplications\n- FM demodulator and modulator\n- Frequency synthesis and multiplication\n- Frequency discrimination\n- Data synchronization and conditioning\n- Voltage-to-frequency conversion\n- Tone decoding\n- FSK modulation\n- Motor speed control\nOrdering Code:\nDevices also available in Tape and Reel. Specify by appending the suffix letter \"X\" to the ordering code.\nConnection Diagram\nPin Assignments for SOIC and DIP\nTop View\nOrder Number\nPackage Number\nPackage Description\nCD4046BCM\nM16A\n16-Lead Small Outline integrated Circuit (SOIC), JEDEC MS-012, 0.150\" Narrow Body\nCD4046BCN\nN16E\n16-Lead Plastic Dual-In-Line Package (PDIP), JEDEC MS-001, 0.300\" Wide\nCD4046BC Micropower Phase-Locked Loop\n(c) 1999 Fairchild Semiconductor Corporation\nDS005968.prf\nwww.fairchildsemi.com\n\nCD4046BC\nBlock Diagram\nFIGURE 1.\nwww.fairchildsemi.com\n\nAbsolute Maximum Ratings(Note 1)\n(Note 2)\nRecommended Operating\nConditions (Note 2)\nNote 1: \"Absolute Maximum Ratings\" are those values beyond which the\nsafety of the device cannot be guaranteed. They are not meant to imply\nthat the devices should be operated at these limits. The table of \"Recom\nmended Operating Conditions\" and \"Electrical Characteristics\" provides\nconditions for actual device operation.\nNote 2: VSS = 0V unless otherwise specified.\nDC Electrical Characteristics (Note 2)\nNote 3: Capacitance is guaranteed by periodic testing.\nNote 4: IOH and IOL are tested one output at a time.\nDC Supply Voltage (VDD)\n-0.5 to +18 VDC\nInput Voltage (VIN)\n-0.5 to VDD +0.5 VDC\nStorage Temperature Range (TS)\n-65°C to +150°C\nPower Dissipation (PD)\nDual-In-Line\n700 mW\nSmall Outline\n500 mW\nLead Temperature (TL)\n(Soldering, 10 seconds)\n260°C\nDC Supply Voltage (VDD)\n3 to 15 VDC\nInput Voltage (VIN)\n0 to VDD VDC\nOperating Temperature Range (TA)\n-40°C to +85°C\nSymbol\nParameter\nConditions\n-40°C\n+25°C\n+85°C\nUnits\nMin\nMax\nMin\nTyp\nMax\nMin\nMax\nIDD\nQuiescent Device Current\nPin 5 = VDD, Pin 14 = VDD,\nPin 3, 9 = VSS\nVDD = 5V\n0.005\nμA\nVDD = 10V\n0.01\nμA\nVDD = 15V\n0.015\nμA\nPin 5 = VDD, Pin 14 = Open,\nPin 3, 9 = VSS\nVDD = 5V\nμA\nVDD = 10V\nμA\nVDD = 15V\nμA\nVOL\nLOW Level Output Voltage\nVDD = 5V\n0.05\n0.05\n0.05\nV\nVDD = 10V\n0.05\n0.05\n0.05\nV\nVDD = 15V\n0.05\n0.05\n0.05\nV\nVOH\nHIGH Level Output Voltage\nVDD = 5V\n4.95\n4.95\n4.95\nV\nVDD = 10V\n9.95\n9.95\n9.95\nV\nVDD = 15V\n14.95\n14.95\n14.95\nV\nVIL\nLOW Level Input Voltage\nVDD = 5V, VO = 0.5V or 4.5V\n1.5\n2.25\n1.5\n1.5\nV\nComparator and Signal In\nVDD = 10V, VO = 1V or 9V\n3.0\n4.5\n3.0\n3.0\nV\nVDD = 15V, VO = 1.5V or 13.5V\n4.0\n6.25\n4.0\n4.0\nV\nVIH\nHIGH Level Input Voltage\nVDD = 5V, VO = 0.5V or 4.5V\n3.5\n3.5\n2.75\n3.5\nV\nComparator and Signal In\nVDD = 10V, VO = 1V or 9V\n7.0\n7.0\n5.5\n7.0\nV\nVDD = 15V, VO = 1.5V or 13.5V\n11.0\n11.0\n8.25\n11.0\nV\nIOL\nLOW Level Output Current\nVDD = 5V, VO = 0.4V\n0.52\n0.44\n0.88\n0.36\nmA\n(Note 4)\nVDD = 10V, VO = 0.5V\n1.3\n1.1\n2.25\n0.9\nmA\nVDD = 15V, VO = 1.5V\n3.6\n3.0\n8.8\n2.4\nmA\nIOH\nHIGH Level Output Current\nVDD = 5V, VO = 4.6V\n-0.52\n-0.44\n-0.88\n-0.36\nmA\n(Note 4)\nVDD = 10V, VO = 9.5V\n-1.3\n-1.1\n-2.25\n-0.9\nmA\nVDD = 15V, VO = 13.5V\n-3.6\n-3.0\n-8.8\n-2.4\nmA\nIIN\nInput Current\nAll Inputs Except Signal Input\nVDD = 15V, VIN = 0V\n-0.3\n-10-5\n-0.3\n-1.0\nμA\nVDD = 15V, VIN = 15V\n0.3\n10-5\n0.3\n1.0\nμA\nCIN\nInput Capacitance\nAny Input (Note 3)\n7.5\npF\nPT\nTotal Power Dissipation\nfo = 10 kHz, R1 = 1 MΩ,\nR2 = inf, ςΧΟΙΝ = ςΔΔ/2\nVDD = 5V\n0.07\nmW\nVDD = 10V\n0.6\nmW\nVDD = 15V\n2.4\nmW\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC\nAC Electrical Characteristics (Note 5)\nTA = 25°C, CL = 50 pF\nSymbol\nParameter\nConditions\nMin\nTyp\nMax\nUnits\nVCO SECTION\nIDD\nOperating Current\nfo = 10 kHz, R1 = 1 MΩ,\nR2 = inf, ςΧΟΙΝ = ςΔΔ/2\nVDD = 5V\nVDD = 10V\nVDD = 15V\nμA\nμA\nμA\nfMAX\nMaximum Operating Frequency\nC1 = 50 pF, R1 = 10 kΩ,\nR2 = inf, ςΧΟΙΝ = ςΔΔ\nVDD = 5V\nVDD = 10V\nVDD = 15V\n0.4\n0.6\n1.0\n0.8\n1.2\n1.6\nMHz\nMHz\nMHz\nLinearity\nVCOIN = 2.5V ±0.3V,\nR1 ≥ 10 kΩ, VDD = 5V\nVCOIN = 5V ±2.5V,\nR1 ≥ 400 kΩ, VDD = 10V\nVCOIN = 7.5V ±5V,\nR1 ≥ 1 MΩ, VDD = 15V\n%\n%\n%\nTemperature-Frequency Stability\nNo Frequency Offset, fMIN =\n\n%/°C∝1/φ. ςΔΔ\nR2 = inf\nVDD = 5V\nVDD = 10V\nVDD = 15V\n0.12-0.24\n0.04-0.08\n0.015-0.03\n%/°C\n%/°C\n%/°C\nFrequency Offset, fMIN = 0\nVDD = 5V\nVDD = 10V\nVDD = 15V\n0.06-0.12\n0.05-0.1\n0.03-0.06\n%/°C\n%/°C\n%/°C\nVCOIN\nInput Resistance\nVDD = 5V\nVDD = 10V\nVDD = 15V\nMΩ\nMΩ\nMΩ\nVCO\nOutput Duty Cycle\nVDD = 5V\nVDD = 10V\nVDD = 15V\n%\n%\n%\ntTHL\nVCO Output Transition Time\nVDD = 5V\nns\ntTHL\nVDD = 10V\nVDD = 15V\nns\nns\nPHASE COMPARATORS SECTION\nRIN\nInput Resistance\nSignal Input\nComparator Input\nVDD = 5V\nVDD = 10V\nVDD = 15V\nVDD = 5V\nVDD = 10V\nVDD = 15V\n0.2\n0.1\n0.7\n0.3\nMΩ\nMΩ\nMΩ\nMΩ\nMΩ\nMΩ\nAC-Coupled Signal Input Voltage\nSensitivity\nCSERIES = 1000 pF\nf = 50 kHz\nVDD = 5V\nVDD = 10V\nVDD = 15V\nmV\nmV\nmV\nwww.fairchildsemi.com\n\nAC Electrical Characteristics (Continued)\nSymbol\nParameter\nConditions\nMin\nTyp\nMax\nUnits\nDEMODULATOR OUTPUT\nVCOIN-\nVDEM\nOffset Voltage\nRS ≥ 10 kΩ, VDD = 5V\nRS ≥ 10 kΩ, VDD = 10V\nRS ≥ 50 kΩ, VDD = 15V\n1.50\n1.50\n1.50\n2.2\n2.2\n2.2\nV\nV\nV\nLinearity\nRS ≥ 50 kΩ\nVCOIN = 2.5V ±0.3V, VDD = 5V\nVCOIN = 5V ±2.5V, VDD = 10V\nVCOIN = 7.5V ±5V, VDD = 15V\n0.1\n0.6\n0.8\n%\n%\n%\nZENER DIODE\nVZ\nZener Diode Voltage\nIZ = 50 μA\n6.3\n7.0\n7.7\nV\nRZ\nZener Dynamic Resistance\nIZ = 1 mA\nΩ\nNote 5: AC Parameters are guaranteed by DC correlated testing.\nPhase Comparator State Diagrams\nFIGURE 2.\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC\nTypical Waveforms\nFIGURE 3. Typical Waveform Employing Phase Comparator I in Locked Condition\nFIGURE 4. Typical Waveform Employing Phase Comparator II in Locked Condition\nwww.fairchildsemi.com\n\nTypical Performance Characteristics\nTypical Center Frequency vs C1\nfor R1 = 10 kΩ, 100 kΩ and 1 MΩ\nFIGURE 5.\nTypical Frequency vs C1\nfor R2 = 10 kΩ, 100 kΩ and 1 MΩ\nFIGURE 6.\nNote: To obtain approximate total power dissipation of PLL system for no-signal input: Phase Comparator I, PD (Total) = PD (fo) + PD (fMIN) + PD (RS); Phase\nComparator II, PD (Total) = PD (fMIN).\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC\nTypical fMAX/fMIN vs R2/R1\nFIGURE 7.\nTypical VCO Power Dissipation\nat Center Frequency vs R1\nFIGURE 8.\nNote: To obtain approximate total power dissipation of PLL system for no-signal input: Phase Comparator I, PD (Total) = PD (fo) + PD (fMIN) + PD (RS); Phase\nComparator II, PD (Total) = PD (fMIN).\nwww.fairchildsemi.com\n\nTypical VCO Power Dissipation at fMIN vs R2\nFIGURE 9.\nTypical Source Follower Power Dissipation vs RS\nFIGURE 10.\nNote: To obtain approximate total power dissipation of PLL system for no-signal input: Phase Comparator I, PD (Total) = PD (fo) + PD (fMIN) + PD (RS); Phase\nComparator II, PD (Total) = PD (fMIN).\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC\nFIGURE 11. Typical VCO Linearity vs R1 and C1\nNote: To obtain approximate total power dissipation of PLL system for no-signal input: Phase Comparator I, PD (Total) = PD (fo) + PD (fMIN) + PD (RS); Phase\nComparator II, PD (Total) = PD (fMIN).\nwww.fairchildsemi.com\n\nDesign Information\nThis information is a guide for approximating the value of\nexternal components for the CD4046B in a phase-locked-\nloop system. The selected external components must be\nwithin the following ranges: R1, R2 ≥ 10 kΩ, RS ≥ 10 kΩ,\nC1 ≥ 50 pF.\nIn addition to the given design information, refer to Figure\n5, Figure 6, Figure 7 for R1, R2 and C1 component selec\ntions.\nCharacteristics\nUsing Phase Comparator I\nUsing Phase Comparator II\nVCO Without Offset\nR2 = inf\nVCO With Offset\nVCO Without Offset\nR2 = inf\nVCO With Offset\nVCO Frequency\nFor No Signal Input\nVCO in PLL system will adjust\nto center frequency, fo\nVCO in PLL system will adjust to\nlowest operating frequency, fmin\nFrequency Lock\nRange, 2 fL\n2 fL = full VCO frequency range\n2 fL = fmax - fmin\nFrequency Capture\nRange, 2 fC\nfC = fL\nLoop Filter Component\nSelection\nFor 2 fC, see Ref.\nPhase Angle Between\nSingle and Comparator\n90° at center frequency (fo), approximating\n0° and 180° at ends of lock range (2 fL)\nAlways 0° in lock\nLocks on Harmonics\nof Center Frequency\nYes\nNo\nSignal Input Noise\nRejection\nHigh\nLow\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC\nCharacteristics\nUsing Phase Comparator I\nUsing Phase Comparator II\nVCO Without Offset\nR2 = inf\nVCO With Offset\nVCO Without Offset\nR2 = inf\nVCO With Offset\nVCO Component\nSelection\nGiven: fo.\nUse fo with\nFigure 5 to\ndetermine R1 and C1.\nGiven:\n\nfo and fL.\nCalculate fmin\nfrom the equation\nfmin = fo - fL.\nUse fmin with Figure 6 to\ndetermine R2 and C1.\nCalculate\nfrom the equation\nUse\nwith Figure 7\nto determine ratio R2/\nR1 to obtain R1.\nGiven:\n\nfmax.\nCalculate fo from\nthe equation\nUse fo with Figure 5 to\ndetermine R1 and C1.\nGiven: fmin and fmax.\nUse fmin with\nFigure 6 to\nto determine R2 and\nC1.\nCalculate\nUse\nwith Figure 7\nto determine ratio\nR2/R1 to obtain R1.\nReferences\nG.S. Moschytz, \"Miniaturized RC Filters Using Phase-Locked Loop\", BSTJ, May, 1965.\nFloyd Gardner, \"Phaselock Techniques\", John Wiley & Sons, 1966.\nwww.fairchildsemi.com\n\nPhysical Dimensions inches (millimeters) unless otherwise noted\n16-Lead Small Outline Integrated Circuit (SOIC), JEDEC MS-012, 0.150\" Narrow Body\nPackage Number M16A\nCD4046BC\nwww.fairchildsemi.com\n\nCD4046BC Micropower Phase-Locked Loop\nLIFE SUPPORT POLICY\nFAIRCHILD'S PRODUCTS ARE NOT AUTHORIZED FOR USE AS CRITICAL COMPONENTS IN LIFE SUPPORT\nDEVICES OR SYSTEMS WITHOUT THE EXPRESS WRITTEN APPROVAL OF THE PRESIDENT OF FAIRCHILD\nSEMICONDUCTOR CORPORATION. As used herein:\n1. Life support devices or systems are devices or systems\nwhich, (a) are intended for surgical implant into the\nbody, or (b) support or sustain life, and (c) whose failure\nto perform when properly used in accordance with\ninstructions for use provided in the labeling, can be rea\nsonably expected to result in a significant injury to the\nuser.\n2. A critical component in any component of a life support\ndevice or system whose failure to perform can be rea\nsonably expected to cause the failure of the life support\ndevice or system, or to affect its safety or effectiveness.\nwww.fairchildsemi.com\nPhysical Dimensions inches (millimeters) unless otherwise noted (Continued)\n16-Lead Plastic Dual-In-Line Package (PDIP), JEDEC MS-001, 0.300\" Wide\nPackage Number N16E\nFairchild doesnot assume anyresponsibility for use of any circuitry described, no circuit patent licensesare implied and Fairchild reservesthe right at anytime without notice to change said circuitry and specifications."
    },
    {
      "category": "Resource",
      "title": "8038appnote.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/175a2d216f0d552491e8aa845c50605a_8038appnote.pdf",
      "content": "Semiconductor\nAbout the ICL8038\nApplication Note\nNovember 199\nAN013.1\nAuthor: Bill O'Neil\nEverything You Always Wanted to Know\nIntroduction\nThe 8038 is a function generator capable of producing sine,\nsquare, triangular, sawtooth and pulse waveforms (some at\nthe same time). Since its introduction, marketing and appli\ncation engineers have been manning the phones explaining\nthe care and feeding of the 8038 to customers worldwide.\nThis experience has enabled us to form articulate responses\nto the most frequently asked questions. So, with data sheet\nand breadboard in hand, read on and be enlightened.\nQuestion 1\nI want to sweep the frequency externally but can only get a\nrange of 100:1 (or 50:1, or 10:1). Your data sheet says\n1000:1. How much sweep range can I expect?\nAnswer\nLet's look at what determines the output frequency. Start by\nexamining the circuit schematic at pin 8 in the upper left hand\ncorner. From pin 8 to pin 5 we have the emitter-base of NPN\nQ1 and the emitter-base of PNP Q2. Since these two diode\ndrops cancel each other (approximately), the potential at pins\n8, 5, and 4 are the same. This means that the voltage from V+\nto pin 8 is the same as the voltage across external resistors\nRA and RB. This is a textbook example of a voltage across\ntwo resistors which produce two currents to charge and dis\ncharge a capacitor between two fixed voltages. This is also a\nlinear system. If the voltage across the resistors is dropped\nfrom 10V to 1V, the frequency will drop by 10:1. Changing\nfrom 1V to 0.1V will also change the frequency by 10:1.\nTherefore, by causing the voltage across the external resis\ntors to change from say 10V to 10mV, the frequency can be\nmade to vary at least 1000:1. There are, however, several fac\ntors which make this large sweep range less than ideal.\nQuestion 2\nYou say I can vary the voltage on pin 8 (FM sweep input) to\nget this large range, yet when I short pin 8 to V+ (pin 6), the\nratio is only around 100:1.\nAnswer\nThis is often true. With pin 8 shorted to V+, a check on the\npotentials across the external RA and RB will show 100mV\nor more. This is due to the VBE mismatch between Q1 and\nQ2 (also Q1 and Q3) because of the geometries and current\nlevels involved. Therefore, to get smaller voltages across\nthese resistors, pin 8 must be raised above V+.\nQuestion 3\nHow can I raise pin 8 above V+ without a separate power\nsupply?\nAnswer\nFirst of all, the voltage difference need only be a few hundred\nmillivolts so there is no danger of damaging the 8038. One\nway to get this higher potential is to lower the supply voltage\non the 8038 and external resistors. The simplest way to do\nthis is to include a diode in series with pin 6 and resistors RA\nand RB. See Figure 1. This technique should increase the\nsweep range to 1000:1.\n100K\nFREQUENCY\nLOG POT\n1N457\nDUTY\nCYCLE\n1K\n4.7K\nRA\n4.7K\nRB\n0.1μF\n+15V\n15K\n-15V\nDISTORTION\n0.0047μF\n100K\n10M\n11 12\nFIGURE 1. VARIABLE AUDIO OSCILLATOR, 20Hz TO 20kHz\nQuestion 4\nO.K., now I can get a large frequency range, but I notice that\nthe duty cycle and hence my distortion changes at the low\nest frequencies.\nAnswer\nThis is caused partly by a slight difference in the VBEs of Q2\nand Q3. In trying to manufacture two identical transistors, it is\nnot uncommon to get VBE differences of several millivolts or\nmore. In the standard 8038 connection with pins 7 and 8 con\nnected together, there are several volts across RA and RB and\nthis small mismatch is negligible. However, in a swept mode\nwith the voltage at pin 8 near V+ and only tens of millivolts\nacross RA and RB, the VBE mismatch causes a larger mis\nmatch in charging currents, hence the duty cycle changes. For\nlowest distortion then, it is advisable to keep the minimum\nvoltage across RA and RB around 100mV. This would of\ncourse, limit the frequency sweep range to around 100:1.\nCopyright (c) Harris Corporation 1998\n\nApplication Note 013\nQuestion 5\nI have a similar duty cycle problem when I use high values of\nRA and RB. What causes this?\nAnswer\nThere is another error term which becomes important at very\nlow charge and discharge currents. This error current is the\nemitter current of Q7. The application note on the 8038 gives\na complete circuit description, but it is sufficient to know that\nthe current charging the capacitor is the current in RA which\nflows down through diode Q9 and into the external C. The\ndischarge current is the current in RB which flows down\nthrough diode Q8. Adding to the Q8 current is the current of\nQ7 which is only a few microamperes. Normally, this Q7 cur-\nrent is negligible, but with a small current in RB, this current\nwill cause a faster discharge than would be expected. This\nproblem will also appear in sweep circuits when the voltage\nacross the external resistors is small.\nQuestion 6\nHow can I get the lowest distortion over the largest\nfrequency sweep range.\nAnswer\nFirst of all, use the largest supply voltage available (±15V or\n+30V is convenient). This will minimize VBE mismatch prob\nlems and allow a wide variation of voltage on pin 8. The\npotential on pin 8 may be swept from VCC (and slightly\nhigher) to 2/3 VCC +2V) where VCC is the total voltage\nacross the 8038. Specifically for ±15V supplies (+30V), the\nvoltage across the external resistors can be varied from 0V\nto nearly 8V before clipping of the triangle waveform occurs.\nSecond, keep the maximum currents relatively large (1mA or\n2mA) to minimize the error due to Q7. Higher currents could\nbe used, but the small geometry transistors used in the 8038\ncould give problems due to VCE(SAT) and bulk resistance, etc.\nThird, and this is important, use two separate resistors for RA\nand RB rather than one resistor with pins 4 and 5 connected\ntogether. This is because transistors Q2 and Q3 form a differ\nential amplifier whose gain is determined by the impedance\nbetween pins 4 and 5 as well as the quiescent current. There\nare a number of implications in the differential amplifier con\nnection (pins 4 and 5 shorted). The most obvious is that the\ngain determines the way the currents split between Q2 and\nQ3. Therefore, any small offset or differential voltage will\ncause a marked imbalance in the charge and discharge cur-\nrents and hence the duty cycle. A more subtle result of this\nconnection is the effective capacitance at pin 10. With pins 4\nand 5 connected together, the \"Miller Effect\" as well as the\ncompound transistor connection of Q3 and Q5 can produce\nseveral hundred picofarads at pin 10, seriously limiting the\nhighest frequency of oscillation. The effective capacitance\nwould have to be considered important in determining what\nvalue of external C would result in a particular frequency of\noscillation. The single resistor connection is fine for very sim\nple circuits, but where performance is critical, the two sepa\nrate resistors for RA and RB are recommended.\nFinally, trimming the various pins for lowest distortion\ndeserves some attention. With pins 7 and 8 connected\ntogether and the pot at pin 7 and 8 externally set at its maxi-\nmum, adjust the ratio of RA and RB for 50% duty cycle. Then\nadjust a pot on pin 12 or both pins 1 and 12 depending on\nminimum distortion desired. After these trims have been\nmade, set the voltage on pin 8 for the lowest frequency of\ninterest. The principle error here is due to the excess current\nof Q7 causing a shift in the duty cycle. This can be partially\ncompensated for by bleeding a small current away from pin\n5. The simplest way to do this is to connect a high value of\nresistance (10MΩ to 20MΩ) from pin 5 to V- to bring the duty\ncycle back to 50%. This should result in a reasonable com\npromise between low distortion and large sweep range.\nQuestion 7\nThis waveform generator is a piece of junk. The triangle wave\nis non-linear and has large glitches when it changes slope.\nAnswer\nYou're probably having trouble keeping the constant voltage\nacross RA and RB really constant. The pulse output on pin 9\nputs a moderate load on both supplies as it switches current on\nand off. Changes in the supply reflect as variations in charging\ncurrent, hence non-linearity. Decoupling both power supply pins\nto ground right at the device pins is a good idea. Also, pins 7\nand 8 are susceptible to picking up switching transients (this is\nespecially true on printed circuit boards where pins 8 and 9 run\nside by side). Therefore, a capacitor (0.1μF or more) from V+ to\npin 8 is often advisable. In the case when the pulse output is not\nrequired, leave pin 9 open to be sure of minimizing transients.\nQuestion 8\nWhat is the best supply voltage to use for lowest frequency\ndrift with temperature?\nAnswer\nThe 8038AM, 8038AC, 8038BM and 8038BC are all temper\nature drift tested at VCC = +20V (or ±10V). A curve in the\nlower right hand corner of Page 4 of the data sheet indicates\nfrequency versus temperature at other supply voltages. It is\nimportant to connect pins 7 and 8 together.\nQuestion 9\nWhy does connecting pin 7 to pin 8 give the best temperature\nperformance?\nAnswer\nThere is a small temperature drift of the comparator thresh\nolds in the 8038. To compensate for this, the voltage divider\nat pin 7 uses thin film resistors plus diffused resistors. The\ndifferent temperature coefficients of these resistors causes\nthe voltage at pins 7 and 8 to vary 0.5mV/oC to maintain\noverall low frequency drift at VCC = 20V. At higher supply\nvoltages, e.g., ±15V (+30V), the threshold drifts are smaller\ncompared with the total supply voltage. In this case, an\nexternally applied constant voltage at pin 8 will give reason-\nably low frequency drift with temperature.\n\nApplication Note 013\nQuestion 10\nYour data sheet is very confusing about the phase relationship\nof the various waveforms.\nAnswer\nSorry about that! The thing to remember is that the triangle\nand sine wave must be in phase since one is derived from\nthe other. A check on the way the circuit works shows that\nthe pulse waveform on pin 9 will be high as the capacitor\ncharges (positive slope on the triangle wave) and will be low\nduring discharge (negative slope on the triangle wave).\nThe latest data sheet corrects the photograph Figure 7 on Page\n5 of the data sheet. The 20% duty cycle square wave was\ninverted, i.e., should be 80% duty cycle. Also, on that page\nunder \"Waveform Timing\" the related sentences should read\n\"RA controls the rising portion of the triangle and sine-wave and\nthe 1 state of the square wave.\" Also, \"the falling portion of the\ntriangle and sine wave and the 0 state of the square wave is:\"\nQuestion 11\nUnder Parameter Test Conditions on Page 3 of your 8038\ndata sheet, the suggested value for Min and Max duty cycle\nadjust don't seem to work.\nAnswer\nThe positive charging current is determined by RA alone\nsince the current from RB is switched off. (See 8038 Applica\ntion Note AN012 for complete circuit description.) The nega\ntive discharge current is the difference between the RA\ncurrent and twice the RB current. Therefore, changing RB\nwill affect only the discharge time, while changing RA will\naffect both charge and discharge times. For short negative\ngoing pulses (greater than 50% duty cycle) we can lower the\nvalue of RB (e.g., RA = 50kΩ and RB = 1.6kΩ). For short\npositive going pulses (duty cycles less than 50%) the limiting\nvalues are reached when the current in RA is twice that in\nRB (e.g., RB = 50kΩ). This has been corrected on the latest\ndata sheet.\nQuestion 12\nI need to switch the waveforms off and on. What's a good\nway to strobe the 8038?\nAnswer\nWith a dual supply voltage (e.g., ±15V) the external capaci\ntor (pin 10) can be shorted to ground so that the sine wave\nand triangle wave always begin at a zero crossing point.\nRandom switching has a 50/50 chance of starting on a posi\ntive or negative slope. A simple AND gate using pin 9 will\nallow the strobe to act only on one slope or the other, see\nFigure 2. Using only a single supply, the capacitor (pin 10)\ncan be switched either to V+ or ground to force the compara\ntor to set in either the charge or discharge mode. The disad\nvantage of this technique is that the beginning cycle of the\nnext burst will be 30% longer than the normal cycle.\nQuestion 13\nHow can I buffer the sine wave output without loading it down?\nAnswer\nThe simplest circuit is a simple op amp follower as shown in Fig\nure 3A. Another circuit shown in Figure 3B allows amplitude and\noffset controls without disturbing the 8038. Either circuit can be\nDC or AC coupled. For AC coupling the op amp non-inverting\ninput must be returned to ground with a 100kΩ resistor.\nQuestion 14\nYour 8038 data sheet implies that all waveforms can operate up\nto 1MHz. Is this true?\nAnswer\nUnfortunately, only the square wave output is useful at that\nfrequency. As can be seen from the curves on page 4 of the\ndata sheet, distortion on the sine wave and linearity of the tri\nangle wave fall off rapidly above 200kHz.\nQuestion 15\nIs it normal for this device to run hot to the touch?\nAnswer\nYes. The 8038 is essentially resistive. The power dissipation\nis then E2/R and at ±15V, the device does run hot. Extensive\nlife testing under this operating condition and maximum\nambient temperature has verified the reliability of this prod\nuct.\nQuestion 16\nHow stable are the output amplitudes versus temperature?\nAnswer\nThe amplitude of the triangle waveform decreases slightly\nwith temperature. The typical amplitude coefficient is\n-0.01%/oC, giving a drop of about 1% at 125oC. The sine\noutput is less sensitive and decreases only about 0.6% at\n125oC. For the square wave output the VCE(SAT) goes from\n0.12V at 25oC to 0.17V at 125oC. Leakage current in the \"1\"\nstate is less than a few nanoamperes even at 125oC and is\nusually negligible.\n2N4392\nRA\nRB\n15K\n-15V\n1N914\nOFF\nON\n100K\nC\n1N914\n+15V\nSTROBE\n+15V (>0V)\n-15V (< -10V)\nFIGURE 2. STROBE-TONE BURST GENERATOR\n\nApplication Note 013\nV+\nRA\nRB\n20K\nAMPLITUDE\n100K\nC\n4.7K\nV+\nV\n+ -\nRA\nRB\nC\n+ -\nV\nFIGURE 3A.\nFIGURE 3B.\nFIGURE 3. SINEWAVE OUTPUT BUFFER AMPLIFIERS\nSchematic Diagram\nV+"
    },
    {
      "category": "Resource",
      "title": "8038datasheet.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-331-advanced-circuit-techniques-spring-2002/7b1cbcaefca0be7162c27638eb43ff08_8038datasheet.pdf",
      "content": "Semiconductor\nSeptember 1998\nFile Number 2864.3\nICL8038\nPrecision Waveform Generator/Voltage\nControlled Oscillator\nThe ICL8038 waveform generator is a monolithic integrated\ncircuit capable of producing high accuracy sine, square,\ntriangular, sawtooth and pulse waveforms with a minimum of\nexternal components. The frequency (or repetition rate) can\nbe selected externally from 0.001Hz to more than 300kHz\nusing either resistors or capacitors, and frequency\nmodulation and sweeping can be accomplished with an\nexternal voltage. The ICL8038 is fabricated with advanced\nmonolithic technology, using Schottky barrier diodes and thin\nfilm resistors, and the output is stable over a wide range of\ntemperature and supply variations. These devices may be\ninterfaced with phase locked loop circuitry to reduce\ntemperature drift to less than 250ppm/oC.\nOrdering Information\nFeatures\n- Low Frequency Drift with Temperature. . . . . . .250ppm/oC\n- Low Distortion. . . . . . . . . . . . . . . . 1% (Sine Wave Output)\n- High Linearity . . . . . . . . . . . 0.1% (Triangle Wave Output)\n- Wide Frequency Range . . . . . . . . . . . 0.001Hz to 300kHz\n- Variable Duty Cycle . . . . . . . . . . . . . . . . . . . . . 2% to 98%\n- High Level Outputs. . . . . . . . . . . . . . . . . . . . . . TTL to 28V\n- Simultaneous Sine, Square, and Triangle Wave\nOutputs\n- Easy to Use - Just a Handful of External Components\nRequired\nPART NUMBER\nSTABILITY\nTEMP. RANGE (oC)\nPACKAGE\nPKG. NO.\nICL8038CCPD\n250ppm/oC (Typ)\n0 to 70\n14 Ld PDIP\nE14.3\nICL8038CCJD\n250ppm/oC (Typ)\n0 to 70\n14 Ld CERDIP\nF14.3\nICL8038BCJD\n180ppm/oC (Typ)\n0 to 70\n14 Ld CERDIP\nF14.3\nICL8038ACJD\n120ppm/oC (Typ)\n0 to 70\n14 Ld CERDIP\nF14.3\nPinout\nFunctional Diagram\nICL8038\n(PDIP, CERDIP)\nTOP VIEW\nCURRENT\nSOURCE\nSINE WAVE\nADJUST\n14 NC\nSINE\nWAVE OUT\n13 NC\nTRIANGLE\n12 SINE WAVE\nOUT\nADJUST\nDUTY CYCLE\n11 V- OR GND\nFREQUENCY\nADJUST\n10 TIMING\nCURRENT\nCAPACITOR\nSOURCE\nV+\nSQUARE\nWAVE OUT\nFM BIAS\nFM SWEEP\nINPUT\nCOMPARATOR\n#1\nCOMPARATOR\n#2\nFLIP-FLOP\nSINE\nCONVERTER\nBUFFER\nBUFFER\nI\nV+\nV- OR GND\n#1\n#2\n2I\nC\nCAUTION: These devices are sensitive to electrostatic discharge; follow proper IC Handling Procedures.\nCopyright (c) Harris Corporation 1998\n\nICL8038\nAbsolute Maximum Ratings\nSupply Voltage (V- to V+). . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 36V\nInput Voltage (Any Pin) . . . . . . . . . . . . . . . . . . . . . . . . . . . . V- to V+\nInput Current (Pins 4 and 5). . . . . . . . . . . . . . . . . . . . . . . . . . . 25mA\nOutput Sink Current (Pins 3 and 9) . . . . . . . . . . . . . . . . . . . . . 25mA\nOperating Conditions\nTemperature Range\nICL8038AC, ICL8038BC, ICL8038CC . . . . . . . . . . . . 0oC to 70oC\nThermal Information\nThermal Resistance (Typical, Note 1)\nθJA (oC/W) θJC (oC/W)\nCERDIP Package. . . . . . . . . . . . . . . . .\nPDIP Package . . . . . . . . . . . . . . . . . . .\nN/A\nMaximum Junction Temperature (Ceramic Package) . . . . . . . .175oC\nMaximum Junction Temperature (Plastic Package) . . . . . . . .150oC\nMaximum Storage Temperature Range. . . . . . . . . . -65oC to 150oC\nMaximum Lead Temperature (Soldering 10s) . . . . . . . . . . . . 300oC\nDie Characteristics\nBack Side Potential . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . V-\nCAUTION: Stresses above those listed in \"Absolute Maximum Ratings\" may cause permanent damage to the device. This is a stress only rating and operation of the\ndevice at these or any other conditions above those indicated in the operational sections of this specification is not implied.\nNOTE:\n1. θJA is measured with the component mounted on an evaluation PC board in free air.\nElectrical Specifications\nVSUPPLY = ±10V or +20V, TA = 25oC, RL = 10kΩ, Test Circuit Unless Otherwise Specified\nPARAMETER\nSYMBOL\nTEST\nCONDITIONS\nICL8038CC\nICL8038BC\nICL8038AC\nUNITS\nMIN\nTYP\nMAX\nMIN\nTYP\nMAX\nMIN\nTYP\nMAX\nSupply Voltage Operating Range\nVSUPPLY\nV+\nSingle Supply\n+10\n-\n+30\n+10\n-\n+30\n+10\n-\n+30\nV\nV+, V-\nDual Supplies\n±5\n±15\n±5\n±15\n±5\n±15\nV\nSupply Current\nISUPPLY\nVSUPPLY = ±10V\n(Note 2)\n-\nmA\nFREQUENCY CHARACTERISTICS (All Waveforms)\nMax. Frequency of Oscillation\nfMAX\n-\n-\n-\n-\n-\n-\nkHz\nSweep Frequency of FM Input\nfSWEEP\n-\n-\n-\nkHz\nSweep FM Range\n(Note 3)\n-\n35:1\n-\n-\n35:1\n-\n-\n35:1\n-\nFM Linearity\n10:1 Ratio\n-\n0.5\n-\n-\n0.2\n-\n-\n0.2\n-\n%\nFrequency Drift with\nTemperature (Note 5)\nΔf/ΔT\noC to 70oC\n-\n-\n-\n-\n-\nppm/oC\nFrequency Drift with Supply Voltage\nΔf/ΔV\nOver Supply\nVoltage Range\n-\n0.05\n-\n-\n0.05\n-\n0.05\n-\n%/V\nOUTPUT CHARACTERISTICS\nSquare Wave\nLeakage Current\nIOLK\nV9 = 30V\n-\n-\n-\n-\n-\n-\nμA\nSaturation Voltage\nVSAT\nISINK = 2mA\n-\n0.2\n0.5\n-\n0.2\n0.4\n-\n0.2\n0.4\nV\nRise Time\ntR\nRL = 4.7kΩ\n-\n-\n-\n-\n-\n-\nns\nFall Time\ntF\nRL = 4.7kΩ\n-\n-\n-\nns\nTypical Duty Cycle Adjust\n(Note 6)\nΔD\n-\n-\n%\nTriangle/Sawtooth/Ramp\n-\nAmplitude\nVTRIAN\nGLE\nRTRI = 100kΩ\n0.30 0.33\n-\n0.30 0.33\n-\n0.30 0.33\n-\nxVSUPPLY\nLinearity\n-\n0.1\n-\n-\n0.05\n-\n-\n0.05\n-\n%\nOutput Impedance\nZOUT\nIOUT = 5mA\n-\n-\n-\n-\n-\n-\nΩ\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\nICL8038\nElectrical Specifications\nVSUPPLY = ±10V or +20V, TA = 25oC, RL = 10kΩ, Test Circuit Unless Otherwise Specified (Continued)\nSine Wave\nAmplitude\nVSINE\nRSINE = 100kΩ\n0.2\n0.22\n-\n0.2\n0.22\n-\n0.2\n0.22\n-\nxVSUPPLY\nTHD\nTHD\nRS = 1MΩ\n(Note 4)\n-\n2.0\n-\n1.5\n-\n1.0\n1.5\n%\nTHD Adjusted\nTHD\nUse Figure 4\n-\n1.5\n-\n-\n1.0\n-\n-\n0.8\n-\n%\nPARAMETER\nSYMBOL\nTEST\nCONDITIONS\nICL8038CC\nICL8038BC\nICL8038AC\nUNITS\nMIN\nTYP\nMAX\nMIN\nTYP\nMAX\nMIN\nTYP\nMAX\nNOTES:\n2. RA and RB currents not included.\n3. VSUPPLY = 20V; RA and RB = 10kΩ, f ≅ 10kHz nominal; can be extended 1000 to 1. See Figures 5A and 5B.\n4. 82kΩ connected between pins 11 and 12, Triangle Duty Cycle set at 50%. (Use RA and RB.)\n5. Figure 1, pins 7 and 8 connected, VSUPPLY = ±10V. See Typical Curves for T.C. vs VSUPPLY.\n6. Not tested, typical value for design purposes only.\nTest Conditions\nPARAMETER\nRA\nRB\nRL\nC\nW1\nMEASURE\nSupply Current\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nCurrent Into Pin 6\nSweep FM Range (Note 7)\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nOpen\nFrequency at Pin 9\nFrequency Drift with Temperature\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nFrequency at Pin 3\nFrequency Drift with Supply Voltage (Note 8)\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nFrequency at Pin 9\nOutput Amplitude (Note 10)\nSine\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nPk-Pk Output at Pin 2\nTriangle\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nPk-Pk Output at Pin 3\nLeakage Current (Off) (Note 9)\n10kΩ\n10kΩ\n3.3nF\nClosed\nCurrent into Pin 9\nSaturation Voltage (On) (Note 9)\n10kΩ\n10kΩ\n3.3nF\nClosed\nOutput (Low) at Pin 9\nRise and Fall Times (Note 11)\n10kΩ\n10kΩ\n4.7kΩ\n3.3nF\nClosed\nWaveform at Pin 9\nDuty Cycle Adjust (Note 11)\nMax\n50kΩ\n~1.6kΩ\n10kΩ\n3.3nF\nClosed\nWaveform at Pin 9\nMin\n~25kΩ\n50kΩ\n10kΩ\n3.3nF\nClosed\nWaveform at Pin 9\nTriangle Waveform Linearity\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nWaveform at Pin 3\nTotal Harmonic Distortion\n10kΩ\n10kΩ\n10kΩ\n3.3nF\nClosed\nWaveform at Pin 2\nS\nNOTES:\n7. The hi and lo frequencies can be obtained by connecting pin 8 to pin 7 (fHI) and then connecting pin 8 to pin 6 (fLO). Otherwise apply Sweep\nVoltage at pin 8 (2/3 VSUPPLY +2V) ≤ VSWEEP ≤ VSUPPLY where VSUPPLY is the total supply voltage. In Figure 5B, pin 8 should vary between\n5.3V and 10V with respect to ground.\n8. 10V ≤ V+ ≤ 30V, or ±5V ≤ VSUPPLY ≤±15V.\n9. Oscillation can be halted by forcing pin 10 to +5V or -5V.\n10. Output Amplitude is tested under static conditions by forcing pin 10 to 5V then to -5V.\n11. Not tested; for design purposes only.\n\nICL8038\nTest Circuit\n+10V\nICL8038\nSW1\nN.C.\nC\n3300pF\n82K\nRA\n10K\nRB\n10K\nRL\n10K\nRTRI\nRSINE\n-10V\nFIGURE 1. TEST CIRCUIT\nDetailed Schematic\nCURRENT SOURCES\nQ20 Q21\nQ19\nQ22\nQ31\nQ32\nQ33\nQ34\nQ30\nQ7\nQ6\nQ1\nQ2\nQ4\nQ8\nQ9\nQ5\nQ3\nQ14\nQ11\nQ12\nQ13\nQ24\nQ23\nQ25\nQ26\nQ29\nQ27\nQ28\nQ10\nQ15\nQ18\nQ17\nQ16\nQ35\nQ36 Q38\nQ40\nQ37\nQ39\nR1\n11K\nR2\n39K\nREXT\n\nB\nEXT A\nCOMPARATOR\nR41\n4K\nR8\n5K\nR9\n5K\nR10\n5K\nR43\n27K\nR42\n27K BUFFER AMPLIFIER\nR41\n27K\nR17\n4.7K\nR18\n4.7K\nR14\n27K\nR13\nR16\n1.8K\nR6\nR5\nR4\nR3\n30K\nR46\n40K\nCEXT\nR7A\n10K\nR7B\n15K\nR44\n1K\nR11\nR12\n2.7K\nR15\nR24\nR21\n10K\nR20\n2.7K\nR19\nFLIP-FLOP\nSINE CONVERTER\nQ49\nQ50\nQ52\nQ51\nQ53\nQ55\nQ54\nQ56\nQ42\nQ41\nQ43\nQ44\nQ45\nQ46\nQ47\nQ48\nV+\nR32\n5.2K\nR33\nR34\nR35\nR36\nR37\nR38\nR39\nR40\n5.6K\nR23\n2.7K\nR22\n10K\nR28\n33K\nR30\n33K\nR29\n33K\nR31\n33K\nR25\n33K\nR26\n33K\nR27\n33K\nR45\n33K\nR\nREXTC\n82K\nApplication Information (See Functional Diagram)\nAn external capacitor C is charged and discharged by two\ncurrent sources. Current source #2 is switched on and off by a\nflip-flop, while current source #1 is on continuously. Assuming\nthat the flip-flop is in a state such that current source #2 is off,\nand the capacitor is charged with a current I, the voltage\nacross the capacitor rises linearly with time. When this voltage\nreaches the level of comparator #1 (set at 2/3 of the supply\nvoltage), the flip-flop is triggered, changes states, and\nreleases current source #2. This current source normally\ncarries a current 2I, thus the capacitor is discharged with a\nnet-current I and the voltage across it drops linearly with time.\nWhen it has reached the level of comparator #2 (set at 1/3 of\nthe supply voltage), the flip-flop is triggered into its original\nstate and the cycle starts again.\nFour waveforms are readily obtainable from this basic\ngenerator circuit. With the current sources set at I and 2I\nrespectively, the charge and discharge times are equal. Thus\na triangle waveform is created across the capacitor and the\nflip-flop produces a square wave. Both waveforms are fed to\nbuffer stages and are available at pins 3 and 9.\n\n-------------\n------------------------------------------------------------------\n-----------------\n------------\n-----------------------\n-----------------------\n----------------------------------------------------------------------------------\n-------------------------------------\n---------------\n-----------\n------------------------\n-----------------------------------------------------\n----------\nICL8038\nThe levels of the current sources can, however, be selected\nover a wide range with two external resistors. Therefore, with\nthe two currents set at values different from I and 2I, an\nasymmetrical sawtooth appears at Terminal 3 and pulses\nwith a duty cycle from less than 1% to greater than 99% are\navailable at Terminal 9.\nThe sine wave is created by feeding the triangle wave into a\nnonlinear network (sine converter). This network provides a\ndecreasing shunt impedance as the potential of the triangle\nmoves toward the two extremes.\nWaveform Timing\nThe symmetry of all waveforms can be adjusted with the\nexternal timing resistors. Two possible ways to accomplish\nthis are shown in Figure 3. Best results are obtained by\nkeeping the timing resistors RA and RB separate (A). RA\ncontrols the rising portion of the triangle and sine wave and\nthe 1 state of the square wave.\nThe magnitude of the triangle waveform is set at 1/3\nVSUPPLY; therefore the rising portion of the triangle is,\nFIGURE 2A. SQUARE WAVE DUTY CYCLE - 50%\nC\nV\nC × 1/3 × VSUPPLY × RA\nRA × C\n×\n=\n- =\n- =\n-\nt1\nI\n0.22 × VSUPPLY\n0.66\nThe falling portion of the triangle and sine wave and the 0\nstate of the square wave is:\nC × V\nC × 1/3VSUPPLY\nRARBC\n=\n- =\n- =\n-\nt2\n2(0.22)\nVSUPPLY - - 0.22\nVSUPPLY -\n0.66(2RA - RB)\nRB\nRA\nThus a 50% duty cycle is achieved when RA = RB.\nIf the duty cycle is to be varied over a small range about 50%\nonly, the connection shown in Figure 3B is slightly more\nconvenient. A 1kΩ potentiometer may not allow the duty cycle\nto be adjusted through 50% on all devices. If a 50% duty cycle\nis required, a 2kΩ or 5kΩ potentiometer should be used.\nWith two separate timing resistors, the frequency is given by:\nf =\n- =\n-\nt1 + t2\nRAC\nRB\n\n-1 +\n-\n0.66\n2RA - RB\nor, if RA = RB = R\n0.33\nf = RC - (for Figure 3A)\nFIGURE 2B. SQUARE WAVE DUTY CYCLE - 80%\nC\n82K\nICL8038\nRA\nRL\nRB\nFIGURE 2. PHASE RELATIONSHIP OF WAVEFORMS\nV+\nV+\nV- OR GND\nICL8038\nC\n100K\nRA\nRL\nRB\n1kΩ\nV- OR GND\nFIGURE 3A.\nFIGURE 3B.\nFIGURE 3. POSSIBLE CONNECTIONS FOR THE EXTERNAL TIMING RESISTORS\n\n---------------------------------------\n-------\n-----------------------------------\nICL8038\nNeither time nor frequency are dependent on supply voltage,\neven though none of the voltages are regulated inside the\nintegrated circuit. This is due to the fact that both currents\nand thresholds are direct, linear functions of the supply\nvoltage and thus their effects cancel.\nReducing Distortion\nTo minimize sine wave distortion the 82kΩ resistor between\npins 11 and 12 is best made variable. With this arrangement\ndistortion of less than 1% is achievable. To reduce this even\nfurther, two potentiometers can be connected as shown in\nFigure 4; this configuration allows a typical reduction of sine\nwave distortion close to 0.5%.\nICL8038\nC\n100kΩ\nRA\nRL\nRB\nV+\n1kΩ\n10kΩ\n100kΩ\n10kΩ\nV- OR GND\nFIGURE 4. CONNECTION TO ACHIEVE MINIMUM SINE WAVE\nDISTORTION\nSelecting RA, RB and C\nFor any given output frequency, there is a wide range of RC\ncombinations that will work, however certain constraints are\nplaced upon the magnitude of the charging current for\noptimum performance. At the low end, currents of less than\n1μA are undesirable because circuit leakages will contribute\nsignificant errors at high temperatures. At higher currents\n(I > 5mA), transistor betas and saturation voltages will\ncontribute increasingly larger errors. Optimum performance\nwill, therefore, be obtained with charging currents of 10μA to\n1mA. If pins 7 and 8 are shorted together, the magnitude of\nthe charging current due to RA can be calculated from:\nI =\nR1 × (V+ - V-\n-\n)\n× 1 - = 0.22(V+ - V--)\n(R1 + R2)\nRA\nRA\nR1 and R2 are shown in the Detailed Schematic.\nA similar calculation holds for RB.\nThe capacitor value should be chosen at the upper end of its\npossible range.\nWaveform Out Level Control and Power Supplies\nThe waveform generator can be operated either from a\nsingle power supply (10V to 30V) or a dual power supply\n(±5V to ±15V). With a single power supply the average levels\nof the triangle and sine wave are at exactly one-half of the\nsupply voltage, while the square wave alternates between\nV+ and ground. A split power supply has the advantage that\nall waveforms move symmetrically about ground.\nThe square wave output is not committed. A load resistor\ncan be connected to a different power supply, as long as the\napplied voltage remains within the breakdown capability of\nthe waveform generator (30V). In this way, the square wave\noutput can be made TTL compatible (load resistor\nconnected to +5V) while the waveform generator itself is\npowered from a much higher voltage.\nFrequency Modulation and Sweeping\nThe frequency of the waveform generator is a direct function\nof the DC voltage at Terminal 8 (measured from V+). By\naltering this voltage, frequency modulation is performed. For\nsmall deviations (e.g. ±10%) the modulating signal can be\napplied directly to pin 8, merely providing DC decoupling\nwith a capacitor as shown in Figure 5A. An external resistor\nbetween pins 7 and 8 is not necessary, but it can be used to\nincrease input impedance from about 8kΩ (pins 7 and 8\nconnected together), to about (R + 8kΩ).\nFor larger FM deviations or for frequency sweeping, the\nmodulating signal is applied between the positive supply\nvoltage and pin 8 (Figure 5B). In this way the entire bias for\nthe current sources is created by the modulating signal, and\na very large (e.g. 1000:1) sweep range is created (f = 0 at\nVSWEEP = 0). Care must be taken, however, to regulate the\nsupply voltage; in this configuration the charge current is no\nlonger a function of the supply voltage (yet the trigger\nthresholds still are) and thus the frequency becomes\ndependent on the supply voltage. The potential on Pin 8 may\nbe swept down from V+ by (1/3 VSUPPLY - 2V).\n\nICL8038\nC\n81K\nICL8038\nRA\nRL\nRB\nR\nFM\nV+\nV- OR GND\nFIGURE 5A. CONNECTIONS FOR FREQUENCY MODULATION\nC\n81K\nICL8038\nRA\nRL\nRB\nSWEEP\nVOLTAGE\nV+\nV- OR GND\nFIGURE 5B. CONNECTIONS FOR FREQUENCY SWEEP\nFIGURE 5.\nTypical Applications\nThe sine wave output has a relatively high output impedance\n(1kΩ Typ). The circuit of Figure 6 provides buffering, gain\nand amplitude adjustment. A simple op amp follower could\nalso be used.\nV+\nV\nC\nICL8038\nRA\n100K\nRB\nAMPLITUDE\n20K\n+\n-\n4.7K\nFIGURE 6. SINE WAVE OUTPUT BUFFER AMPLIFIERS\nWith a dual supply voltage the external capacitor on Pin 10 can\nbe shorted to ground to halt the ICL8038 oscillation. Figure 7\nshows a FET switch, diode ANDed with an input strobe signal\nto allow the output to always start on the same slope.\nV+\nC\nICL8038\nRA\n1N914\n-15V\nRB\nSTROBE\n2N4392\n1N914\n15K\n100K\nOFF\n+15V (+10V)\n-15V (-10V)\nON\nFIGURE 7. STROBE TONE BURST GENERATOR\nTo obtain a 1000:1 Sweep Range on the ICL8038 the\nvoltage across external resistors RA and RB must decrease\nto nearly zero. This requires that the highest voltage on\ncontrol Pin 8 exceed the voltage at the top of RA and RB by a\nfew hundred mV. The Circuit of Figure 8 achieves this by\nusing a diode to lower the effective supply voltage on the\nICL8038. The large resistor on pin 5 helps reduce duty cycle\nvariations with sweep.\nThe linearity of input sweep voltage versus output frequency\ncan be significantly improved by using an op amp as shown\nin Figure 10.\n10K\nFREQ.\n20K\n0.0047μF\nDISTORTION\nICL8038\n4.7K\n-10V\n+10V\n4.7K\n1K\nDUTY CYCLE\n15K\n1N457\n0.1μF\n100K\n≈15M\nFIGURE 8. VARIABLE AUDIO OSCILLATOR, 20Hz TO 20kHzY\n\nICL8038\nV2+\nOUT\nV1+\nSINE WAVE\nICL8038\n6 3\nR1\nDUTY\nCYCLE\nFREQUENCY\nADJUST\nADJ.\nSINE WAVE\nTRIANGLE\nTIMING\nCAP.\nFM BIAS\nSQUARE\nWAVE\nOUT\nR2\nLOW PASS\nFILTER\nDEMODULATED\nFM\nAMPLIFIER\nPHASE\nDETECTOR\nVCO\nIN\nOUT\nINPUT\nSINE WAVE\nADJ.\nV-/GND\nFIGURE 9. WAVEFORM GENERATOR USED AS STABLE VCO IN A PHASE-LOCKED LOOP\n3,900pF\nSINE WAVE\nICL8038\n4.7kΩ\n4.7kΩ\n500Ω\n10kΩ\n1N753A\nDISTORTION\nFUNCTION GENERATOR\n100kΩ\n+\n50μF\n15V\n1MΩ\n(6.2V)\nHIGH FREQUENCY\nSYMMETRY\n100kΩ\nLOW FREQUENCY\nSYMMETRY\n100kΩ\n+\n-\n+15V\n-15V\nSINE WAVE\nOUTPUT\n+\n-\n+15V\n1kΩ\n10kΩ\nOFFSET\n-VIN\nP4\n1,000pF\n1kΩ\nFIGURE 10. LINEAR VOLTAGE CONTROLLED OSCILLATOR\nUse in Phase Locked Loops\nIts high frequency stability makes the ICL8038 an ideal\nbuilding block for a phase locked loop as shown in Figure 9.\nIn this application the remaining functional blocks, the phase\ndetector and the amplifier, can be formed by a number of\navailable ICs (e.g., MC4344, NE562).\nIn order to match these building blocks to each other, two\nsteps must be taken. First, two different supply voltages are\nused and the square wave output is returned to the supply of\nthe phase detector. This assures that the VCO input voltage\nwill not exceed the capabilities of the phase detector. If a\nsmaller VCO signal is required, a simple resistive voltage\ndivider is connected between pin 9 of the waveform\ngenerator and the VCO input of the phase detector.\nSecond, the DC output level of the amplifier must be made\ncompatible to the DC level required at the FM input of the\nwaveform generator (pin 8, 0.8V+). The simplest solution here\nis to provide a voltage divider to V+ (R1, R2 as shown) if the\namplifier has a lower output level, or to ground if its level is\nhigher. The divider can be made part of the low-pass filter.\nThis application not only provides for a free-running\nfrequency with very low temperature drift, but is also has the\nunique feature of producing a large reconstituted sinewave\nsignal with a frequency identical to that at the input.\nFor further information, see Harris Application Note AN013,\n\"Everything You Always Wanted to Know About the ICL8038\".\n\nICL8038\nDefinition of Terms\nFM Linearity. The percentage deviation from the best fit\nSupply Voltage (VSUPPLY). The total supply voltage from\nstraight line on the control voltage versus output frequency\ncurve.\nV+ to V-.\nSupply Current. The supply current required from the\nOutput Amplitude. The peak-to-peak signal amplitude\npower supply to operate the device, excluding load currents\nappearing at the outputs.\nand the currents through RA and RB.\nSaturation Voltage. The output voltage at the collector of\nFrequency Range. The frequency range at the square wave\nQ23 when this transistor is turned on. It is measured for a\nsink current of 2mA.\noutput through which circuit operation is guaranteed.\nSweep FM Range. The ratio of maximum frequency to\nRise and Fall Times. The time required for the square wave\nminimum frequency which can be obtained by applying a\noutput to change from 10% to 90%, or 90% to 10%, of its\nfinal value.\nsweep voltage to pin 8. For correct operation, the sweep\nvoltage should be within the range:\nTriangle Waveform Linearity. The percentage deviation\n(2/3 VSUPPLY + 2V) < VSWEEP < VSUPPLY\nfrom the best fit straight line on the rising and falling triangle\nwaveform.\nTotal Harmonic Distortion. The total harmonic distortion at\nthe sine wave output.\nTypical Performance Curves\n25oC\n125oC\n-55oC\n0.98\n0.99\n1.01\n1.03\n1.00\n1.02\nSUPPLY VOLTAGE (V)\nSUPPLY VOLTAGE (V)\nFIGURE 11. SUPPLY CURRENT vs SUPPLY VOLTAGE\nFIGURE 12. FREQUENCY vs SUPPLY VOLTAGE\n0.98\n0.99\n1.01\n1.03\n1.00\n1.02\n-50\n-25\n125oC\nFALL TIME\nRISE TIME\n25oC\n-55oC\n125oC\n25oC\n-55oC\nTEMPERATURE (oC)\nLOAD RESISTANCE (kΩ)\nNORMALIZED FREQUENCY\nSUPPLY CURRENT (mA)\nTIME (ns)\nNORMALIZED FREQUENCY\nFIGURE 13. FREQUENCY vs TEMPERATURE\nFIGURE 14. SQUARE WAVE OUTPUT RISE/FALL TIME vs\nLOAD RESISTANCE\n\nICL8038\nTypical Performance Curves (Continued)\n1.0\n1.5\n0.9\n1.0\n0.8\n0.5\nLOAD CURRENT\nLOAD CURRENT TO V+\n25oC\n125oC\n-55oC\nTO V -\nLOAD CURRENT (mA)\nLOAD CURRENT (mA)\nFIGURE 15. SQUARE WAVE SATURATION VOLTAGE vs LOAD\nFIGURE 16. TRIANGLE WAVE OUTPUT VOLTAGE vs LOAD\nCURRENT\nCURRENT\n1.2\n10.0\n1.1\n1.0\n1.0\n0.9\n0.8\n0.1\n0.7\n0.6\n0.01\n1K\n10K\n100K\n1M\n1K\n10K\n100K\n1M\nFREQUENCY (Hz)\nFREQUENCY (Hz)\nFIGURE 17. TRIANGLE WAVE OUTPUT VOLTAGE vs\nFIGURE 18. TRIANGLE WAVE LINEARITY vs FREQUENCY\nFREQUENCY\n1.1\n1.0\n0.9\n1K\n10K\n100K\n1M\n1K\n10K\n100K\n1M\nFREQUENCY (Hz)\nFREQUENCY (Hz)\nADJUSTED\nUNADJUSTED\nNORMALIZED OUTPUT VOLTAGE\nSATURATION VOLTAGE\nNORMALIZED OUTPUT VOLTAGE\nDISTORTION (%)\nLINEARITY (%)\nNORMALIZED PEAK OUTPUT VOLTAGE\n125oC\n25oC\n-55oC\nFIGURE 19. SINE WAVE OUTPUT VOLTAGE vs FREQUENCY\nFIGURE 20. SINE WAVE DISTORTION vs FREQUENCY"
    }
  ]
}