{
  "course_name": "Advanced Spanish Conversation and Composition",
  "course_description": "En este curso el estudiante perfeccionará su comunicación oral y escrita mediante el estudio y la discusión de temas relacionados al impacto social y cultural de la ciencia y la tecnología en ciertas sociedades hispanas. Algunos de los temas a tratar son los efectos de los cambios tecnológicos en la estructura familiar y comunitaria, en las relaciones entre los sexos, en la identidad personal y cultural, en el mundo natural y en los sistemas de valores, la religión, la educación y el trabajo. También se examinan y discuten diversas actitudes hacia la innovación tecnológica y científica así como las ramificaciones éticas de las decisiones tecnológicas.",
  "topics": [
    "Humanities",
    "Language",
    "Spanish",
    "Social Science",
    "Communication",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "Language",
    "Spanish",
    "Social Science",
    "Communication",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times / Horarios de las reuniones:\n\nSeminars: 2 sessions / week, 1.5 hours / sessions\n\nPrerequisites / Requisitos Previos\n\nThe prerequisites for this course are:\n\n21G.704 Spanish IV\n\n21G.774 Spanish IV Globalization\n\nPermission of instructor\n\nCourse Description / Descripcion Del Curso\n\nEn este curso el estudiante perfeccionara su comunicacion oral y escrita mediante el estudio y la discusion de temas relacionados al impacto social y cultural de la ciencia y la tecnologia en ciertas sociedades hispanas. Algunos de los temas a tratar son los efectos de los cambios tecnologicos en la estructura familiar y comunitaria, en las relaciones entre los sexos, en la identidad personal y cultural, en el mundo natural y en los sistemas de valores, la religion, la educacion y el trabajo. Tambien se examinan y discuten diversas actitudes hacia la innovacion tecnologica y cientifica asi como las ramificaciones eticas de las decisiones tecnologicas.\n\nLos materiales incluyen articulos de periodicos y revistas, textos literarios, peliculas y videos cortos. Se utiliza tambien un gran numero de recursos y materiales del Internet enlazados al programa del curso.\n\nLa clase se organiza en torno a discusiones, informes, debates, simulaciones y otras actividades orales basadas en los materiales asignados. La practica escrita se realiza mediante los ensayos y comentarios de los temas, un trabajo de investigacion y la participacion en el foro de discusion electronico.\n\nComponents of the Course/Componentes Del Curso\n\nLibros Requeridos:\n\nNovela corta: Pacheco, Jose Emilio.\nLas batallas en el desierto\n. Ediciones Era, 2011. ISBN: 9786074450552.\n\nSeleccion de cuentos, poemas y articulos\n.\n\nLibros de referencia recomendados:\n\nIguina, Zulma, and Eleanor Dozier.\nManual de Gramatica\n. 5th ed. Cengage Learning, 2012. ISBN: 9781111836818. [Preview with\nGoogle Books\n]\n\nThe Collins Spanish Dictionary\n. 5th ed. Collins, 1997. ISBN: 9780004710235.\n\nMaterial del Internet: La mayor parte de los materiales de la clase son del Internet. Cualquier cambio o aviso aparecera en el programa, por eso es preciso consultarlo para estar al dia. No se distribuira un progama impreso.\n\nPeliculas: Se veran 3 peliculas fuera de las horas de clase.\n\nRequirements and Evaluation/Requisitos y Evaluacion\n\nACTIVITIES\n\nPERCENTAGES\n\nAsistencia y participacion\n\nTareas de communicacion oral en Voicethread\n\nTrabajos escritos\n\nExamenes\n\nProyecto de investigacion y presentacion oral\n\nAsistencia y Participacion: 30%\n\nLos estudiantes deben preparar el material\nantes\nde la clase de acuerdo al programa. En la clase se enfatiza la practica oral mediante discusiones, debates, analisis de casos, simulaciones, resolucion de dilemas, y otras actividades. La participacion activa es un requisito extremadamente importante para tener exito en la clase. Cada estudiante sera evaluado diariamente en base a su preparacion y participacion. Si quieres mas detalles sobre como se efectua la evaluacion de tu participacion en clase, se usara esta guia:\nCriterios para la evaluacion de la participacion en clase (PDF)\n.\n\nAdvertencia Importante: Ya que en esta clase el enfasis es en la practica oral diaria, y esto es imposible de reponer con trabajos extra,\nlas ausencias sin excusa resultaran en una reduccion de la nota final de la clase\n.\nPor cada dos (2) ausencias sin excusa se rebajara un 5% del promedio final de la clase\n. Ademas,\nmas de cuatro (4) ausencias\n\nsin excusa\nresultaran en una\n\"F\" en la nota de participacion en clase\n. Las excepciones requieren una carta del medico, excusa del decano, u otras circunstancias extraordinarias. En caso de dudas o problemas anticipados, por favor, no duden en consultarme.\n\nLas tardanzas tambien afectaran negativamente la nota. Tres tardanzas sin excusa legitima seran consideradas como una ausencia.\n\n****La mejor manera de mejorar la habilidad de expresar efectivamente tus ideas en espanol es mediante la constante interaccion oral o escrita con los demas companeros y companeras. No tengas miedo de cometer errores, de hacer preguntas o de expresar tus dudas sobre el material. El formato de la clase esta disenado para recompensar la practica y el progreso de cada estudiante.Por favor no dejes de comunicarte conmigo en caso de que necesites ayuda en algun aspecto del curso. Si no puedes venir a mis horas de oficina, avisame para hacer una cita en otro momento conveniente.****\n\nPor favor, el uso de computadoras e instrumentos electronicos solo para realizar trabajos relacionados a la clase.\n\nTareas de comunicacion oral en Voicethread: 10%\n\nLos estudiantes deben completar oralmente las tareas asignadas usando la herramienta de conversacion y presentacion en linea, Voicethread. Las grabaciones en Voicethread se evaluaran segun el contenido, la claridad al expresarse y la duracion. (\nVoicethread\nis software the class used to record oral assignments and share them with each other.)\n\nTrabajos escritos: 25%\n\nCuatro ensayos\nde\ndos\npaginas a doble espacio en computadora. Se escribiran dos versiones de cada ensayo: en la primera version se indicaran los errores o problemas segun una\n\"Clave de correccion\" (PDF)\ny se le devolvera al estudiante para que la revise. El estudiante tendra\nuna semana\npara corregir y entregar la segunda version. La nota de cada composicion se calculara de la siguiente manera: la primera version vale 70%. La segunda version vale 30%. Es necesario entregar las dos versiones. Si alguien solo entrega al primera version, perdera 30% de la nota obtenida en la primera version. Es importante entregar las composiciones puntualmente. Composiciones recibidas tarde, no recibiran el credito completo. Las composiciones seran evaluadas por su contenido, organizacion, desarrollo de ideas, vocabulario y gramatica. (20%).\nCriterios para la evaluacion de las composiciones (PDF)\n.\n\nTareas de gramatica y comentarios sobre las lecturas: ejercicios y cortas redacciones para practicar aspectos problematicos de la gramatica y el vocabulario.(5%) En este curso se presupone un conocimiento de la gramatica, y por eso esta no sera un aspecto central de la clase. Sin embargo, se praticaran los aspectos mas problematicos de la gramatica mediante las composiciones y ejercicios escritos. Algunos de estos ejercicios se haran en la clase como pequenas pruebas.\n\nExamenes: 30%\n\nDos examenes escritos durante el periodo de la clase y un examen oral fuera de las horas de clase. Tambien habra pruebas cortas de vocabulario. No hay examen final.\n\nProyecto de investigacion y presentacion oral: 5%\n\nEl tema para la investigacion debe ser seleccionado antes de la mitad del semestre y debe ser aprobado por la profesora. El proyecto de investigacion consiste en una presentacion en clase en la cual los estudiantes seran responsables de investigar un asunto relacionado a los temas del curso y lo presentaran a la clase de manera interactiva. Esto puede ser en la forma de un panel de expertos, un debate, un documental, una simulacion, un juicio, una conferencia de prensa, un juego, etc. Los proyectos son en grupos de no mas de 4 personas. Todos los proyectos requieren la aprobacion previa de la profesora. Se seguiran estos\nCriterios de evaluacion para la presentacion (PDF)\n.\n\nHonestidad Academica\n\nComo estudiante en este curso se espera que completes tu propio trabajo, escribas tus propias tareas y cumplas con las normas de\nIntegridad Academica del MIT\n.",
  "files": [
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition:  Batallas en el desierto reading questions.",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/178d64f06e6171df3a879771cc6ded63_MIT21G_711S14_Batallas.pdf",
      "content": "Batallas en el desierto.\nCapitulos 1-7\nMexico a fines de los anos 40 ¿Que imagen nos presenta Pacheco del Mexico de esos momentos?\nSegun lo que has leido en estos capitulos de Batallas en el desierto ¿que puedes inferir del Mexico de fines de\nlos anos cuarenta? Aqui tienes algunas categorias, trata de encontrar ejemplos en la lectura para algunas de\nellas.\n1. la politica y los politicos (las actitudes de la gente hacia el gobierno en general)\n2. la actitud de la gente hacia el Presidente\n3. la actitud hacia la autoridad\n4. los problemas sociales (la educacion, la salud)\n5. las clases sociales y la relacion entre ellas\n6. las preocupaciones de la gente\n7. las esperanzas para el futuro\n8. la cultura tradicional (musica, comida, entretenimiento)\n9. la infuencia de los medios de comunicacion en la sociedad\n10. la influencia de los Estados Unidos\n11.los cambios en la ciudad de Mexico\n12 . el medio ambiente\n13. la vida familiar: la relacion entre padres e hijos\n14. la relacion entre los sexos : los roles del hombre y la mujer; las discrepancias entre lo permitido a los\nhombres y a las mujeres.\n15. los valores morales, las creencias y actitudes: ¿que se considera bueno o malo? ¿aceptable o inaceptable?\n¿que se censura? ¿que se aprueba?\n16. la historia mexicana (especialmente los ideales de la Revolucion Mexicana)\n17. la ciencia y la tecnologia ¿como son vistas?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Boroboroo Subjunctive Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/4e793c6a05944d6a8198fb19d6e50a62_MIT21G_711S14_Borobo.pdf",
      "content": "Boroboboo\n\nII. Completa las siguientes oraciones segun el cuento y fijandote en la forma necesaria\nde los verbos.\n1. Los animales de la selva vivian \"en un estado de indescriptible atraso\" antes de\nque ......\n2. El mono vestia como si....\n3. Los animales pensaban que el mono....\n4. La mirada del mono hacia sentir a los animales como si...\n5. El mono trataba a los animales como si...\n6. La paz y la armonia en la selva termino cuando....\n7. Los viejos no creian que la maquina...\n8. Los jovenes aseguraban que....\n9. Ellos pensaban que todos vivirian mejor cuando....\n10. Segun ellos, los animales no podrian salir del atraso a menos que...\n11. Al principio el mono selecciono solo a diez animales para que....\n12. Los animales obedecian al mono como si....\n13. A mitad del curso cuando habia que buscar un sitio para emplazar la maquina, el\nmono les exigio a los animales que....\n14. El mono comenzo a cambiar tan pronto como.....\n15. La selva empezo a desaparecer sin que....\n16. La lechuza se dio cuenta de quien era en verdad el mono cuando....\n\nII. Responde a las preguntas de acuerdo al cuento.\n1.¿Que les promete el mono a los animales?\nSi.....\nSi....\n\n2. ¿Cuales son algunos de los argumentos de los jovenes para tratar de convencer a los\nviejos de comprar la maquina?\nSi.....\nSi...\n3. Al final del cuento ¿Cuales podrian ser algunos de los lamentos de los animales sobre\nsu decision de aceptar la maquina?\nSi.....\nSi....\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Common Errors in Spanish",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/fdb583843fac07a62b10cf57dbaac3de_MIT21G_711S14_Comm_Errors.pdf",
      "content": "Errores comunes al escribir en espanol:\nEsta es una lista de algunos errores comunes al escribir o hablar en espanol. Consultala y\nrevisa tus composiciones antes de entregarlas para que no pierdas puntos.\n1. Articulos definidos : el sujeto y los nombres de cosas abstractas siempre llevan un articulo\ndefinido en espanol, especialmente al comenzar una oracion.\nIncorrecto\nCorrecto\nGente es amable. La gente es amable\nAmor es eterno. El amor es eterno.\nTambien es necesario un articulo frente al titulo de una persona, cuando se habla sobre ella. Por\nejemplo, senor, senora, doctor/a, profesor/a. Excepciones : don, dona, san, santo, santa\nEl doctor Perez es mi medico.\nHable con la senora Ramirez hoy.\nRaquel conocio a don Fernando.\nMi abuela siente gran devocion por San Antonio.\nCuando uno se dirige a la persona no se usa el articulo:\n\" Buenos dias, senor, Perez\".\n\"¿Como esta , Sra. Ramirez?\"\n\"Mucho gusto, don Fernando.\"\n2. Genero: muchas palabras de origen griego terminadas en -ma, -pa, y -ta son masculinas a pesar\nde que terminan en \"a\". Por ejemplo: El problema, el sistema, el tema, el mapa, el poeta, el\nprograma, el telegrama, el clima, el diagrama, el planeta.\nAlgunas excepciones: palabras terminadas en \"o\" , pero que son masculinas: la mano, la foto\nLos siguientes sufijos siempre indican una palabra femenina: -cion, -sion, -d, -sis, -umbre: la\ncooperacion, la decision, la libertad,, la tesis, la muchedumbre .\n3. A personal: Cuando el objeto directo es una persona, o algo que se quiere personificar, siempre\nva precedido por la \"a\" personal. Por ejemplo: Via mis amigos en la fiesta. Excepciones:\n-\ndespues del verbo \"tener\": Tengo dos hermanos\n-\ncuando la persona es hipotetica o no especifica: Busco un estudiante que hable\nespanol. Necesito un voluntario.\n4. Otro= other, another: el articulo indefinido \"un\" o \"una\" nunca se usa antes de \"otro\" u\n\"otra\".\n\nIncorrecto\nCorrecto\nTengo una otra clase despues de esta.\nHable con un otro amigo sobre ese asunto.\nTengo otra clase despues de esta.\nHable con otro amigo sobre ese asunto.\n\n5. Palabras problematicas: Atencion con las siguientes palabras, son parecidas al ingles\npero tienen significados diferentes en espanol:\nTo realize = darse cuenta\nTo accomplish = realizar\nElla no se da cuenta de las consecuencias de sus\nactos\nShe does not realize the consequences of her\nactions.\nFinalmente realizo sus sueno de ser doctora.\nTo attend = asistir a\nAtender = to attend to matters, to take care of.\nAyer no asisti a clase de biologia.\nYesterday I did not attend the biology class.\nLa enfermera atendio a los pacientes. Tengo\nnegocios urgentes que debo atender.\nApplication = solicitud\nTo apply = solicitar\nDebes llenar una solicitud si quieres solicitar el\ntrabajo.\nYou must fill an application if you want to apply\nfor the job.\nActually = De hecho, en realidad\nDe hecho, esto no es lo que parece.\nActually this is not what it appears to be.\nNowadays = actualmente, hoy en dia\nActualmente la gente se divierte mas que\nantes. Nowadays people have more fun than\nbefore.\nTopic = tema (Un topico en espanol significa un\ncliche.)\nMe encanta hablar sobre ese tema. I love to talk\nabout that topic.\nSubject =\n-\nasignatura, materia\n-\nsujeto de la oracion\nLa biologia es mi asignatura favorita. Biology is\nmy favorite subject.\nUna oracion tiene sujeto y predicado.\nTo have a good time = divertirse, pasarlo bien Me diverti mucho en las vacaciones. I had a good\ntime during my vacation.\nTo learn = aprender (en el sentido de adquirir\nconocimiento)\nTo learn = enterarse\nde, averiguar, saber (preterito) (en el sentido\ndefind out o discover)\nNo aprendi nada en esa clase.\nSe entero de que su novio era infiel.\nAveriguo toda la verdad.\n\nElla supo que su madre estaba enferma.\nCollege = universidad\nHigh School = colegio, instituto, secundaria,\nescuela superior\nDespues de mi graduacion de secundaria estaba\nun poco triste.\nMi primer ano en la universidad fue muy dificil.\nTo ask a question\" = hacer una pregunta.\nTo ask (question implied) = preguntar.\nTo ask for , to request (a favor, the car) = pedir.\nLa policia hizo varias preguntas al sospechoso.\nLe pregunto donde vivia.\nEl sospechoso pidio un vaso de agua.\nLarge, big = grande\nLong = largo\n\"Gran\" o \"grandes\" (si es plural) frente a un\nnombre = great.\nEste bebe es muy grande en comparacion con los\notros.\nEsta casa es demasiado grande para mi.\nGabriela Mistral fue una gran poeta. Ella y Pablo\nNeruda fueron grandes poetas chilenos.\nTo think, believe = creer o pensar.\nTo think about (using your brains to\nruminate)=pensar EN,\nTo think about (to have an opinion\nabout)= pensar DE\nTo intend or plan to = pensar+ infinitivo.\n¿En que piensas? Pienso en mi familia.\n¿Que piensas de los politicos?\nPienso terminar mis estudios antes de casarme\nTo become or to get:\nponerse + adjetivo ( enfermo, triste, furioso, etc.\n) = to become sick, sad, furious,etc.)\nhacerse + sustantivo = to become (amigos, rico,\netc)\nllegar a ser + sustantivo o adjetivo = to become\nsomething after a lot of effort (doctor, rico,\nfamoso, etc.)\nconvertirse en + sustantivo = to turn into\nSe puso triste al oir la noticia\nSe hizo abogada. Se hicieron novios\nLlego a ser medico despues de mucho esfuerzo\nLlego a ser nuy rico.\nEl sapo se convirtio en un principe\nTime:\nTiempo = time, weather\nVez = para referirse a ocasiones especificas. (una\nvez, cinco veces)\nNunca tengo tiempo para terminar los examenes\n¿Hace buen tiempo hoy. No hace calor ni frio.\nFui a su casa muchas veces.\nLo hizo otra vez.\n\nHora= tiempo del reloj\nRato = periodo de tiempo\n¿Que hora es?\nEstuvimos hablando solamente un rato.\nTo love\nQuerer =means to love in all senses, as a friend,\nrelative or lover\nAmar=used between people who are\npassionately in love and for religious love\nEn expresiones como \"I love football\" es mejor\nusar encantar, complacer, fascinar, etc. Estos\nverbos se usan como gustar.\nTo fall in love = enamorarse (de)\nTo be in love = estar enamorado/a (de).\nLa madre quiere mucho a sus hijos.\nMi novio me quiere mucho.\nAnoche el le dijo que la amaba y le propuso\nmatrimonio.\nLa religion dice que debemos amar a Dios.\nMe encanta esta ciudad.\nMe fascina la comida mexicana.\nLa primera vez que me enamore tenia 16 anos.\nRomeo y Julieta estaban enamorados.\n***Para otras palabras de este tipo y una lista de falsos cognados consulta el Manual de\nGramatica, pags. 284-308***\n\n6. Verbos que no llevan preposicion en espanol\nAlgunos verbos que no requieren una preposicion en espanol, solo el objeto directo (\"a\"\npersonal si el objeto directo es una persona):\nbuscar\nlook for\nBuscamos un apartamento\nesperar\nwait for\n¿Esperan ustedes el autobus? Espero a mi amiga.\nmirar\nlook at\nMira ese cuadro\npedir\nask for\nLe pedimos agua al camarero.\nsolicitar\napply for\nSolicite ese empleo.\nagradecer to be grateful for Te agradezco la ayuda.\n7. Otros errores comunes que debes tratar de evitar\n1 \"Because of \" es \"a causa de\" (as a cause of) o \"por\". Cuando \"because\" empieza una oracion se\ndice \"como\" o \"ya que\". \"Porque de\" no se usa nunca.\n2. \"What\" como sujeto o refiriendose a una idea general idea es \"lo que.\" Ejemplo: What you are\nsaying is excellent. Lo que dices es excelente.\n3. \"There is\" y \"there are\" se expresan con hay. \"There was\", \"there were\" es habia. \"There will be\"\n= habra. El infinitivo is haber y siempre es singular. Habiaun estudiante; Habia 10 estudiantes. En\nespanol no se puede decir \"alli son / es\".\n\n4. \"Mas\" significa \"more\". No significa \"most\". Si queremos decir en espanol, por ejemplo \"most\nof the class...\" decimos la mayoria. \"Mas\" tampoco significa \"very\". \"Very\" = muy.\n5. \"Poco\" significa \"few\" o \"small\" en numero o cantidad (amount). \"Pequeno\" significa \"small\"\ntamano (size).\n6. \"Bien\" significa \"well\" y \"bueno\" significa \"good\". No son intercambiables.\n7. Despues de una preposicion (a, de, con, para, etc.) el verbo siempre esta en infinitivo.\n8. Con partes del cuerpo y la ropa, se usan articulos (el, la, los, las) nunca los adjetivos posesivos\n(mi, tu, su,etc.). Se dice \"la mano\", no \"mi mano\". Me lavo lacara; me pongo el abrigo.\n9. .Nunca se usa use \"en\" con dias de la semana. Solo se usa el articulo - el o los + el dia (Por\nejemplo: Tengo un examen el lunes). El plural de los dias de la semana son iguales al singular (el\nlunes, los lunes) excepto por sabado y domingo(el sabado / los sabados)\n10. \"Would \" para expresar una accion pasada en ingles (Every summer, we would go to the\nmountains for two weeks) es una accion continua y se usa con el imperfecto en espanol. (Cada\nverano ibamos a las montanas por dos semanas.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Advanced Spanish Conversation and Composition: Electronic vigilance and clauses with “si”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/fbe58a15729345d5d903af4439872a6d_MIT21G_711S14_vigilance.pdf",
      "content": "Vigilancia electronica y Clausulas con \"si\"\n\nCompleta las oraciones siguientes prestando atencion a los tiempos verbales:\n\nSi hubiera camaras de vigilancia en todas las calles de la ciudad....\n\nSi la gente supiera que esta siendo vigilada....\n\nHabria menos crimen si....\n\nLas camaras de seguridad no serian necesarias si....\n\nSi tuvieramos robots de vigilancia....\n\nMucha gente se sentiria espiada si....\n\nSi no hacemos nada para reducir el crimen en Bolichimex....\n\nViviremos mas seguros si....\n\nSi en Bolichimex no hubiera tanta pobreza...\n\nSi el gobierno no fuera tan corrupto....\n\nLa vigilancia electronica seria efectiva si....\n\nSi el Presidente hubiera cumplido sus promesas de mejorar la situacion economica el pais....\n\nEl ano pasado habria habido menos crimen si....\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Estilo o discurso indirecto",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/891e879b6fcb6ed9a570daae591ffd1e_MIT21G_711S14_indirecto.pdf",
      "content": "Estilo o discurso indirecto\n\nEstas son citas directas de un dialogo entre Mariana y Carlitos. Imagina que\nle estas contando a otra persona lo que dijeron. Cambia al estilo indirecto\nhaciendo las modificaciones necesarias.\nTrata de no usar el verbo \"decir\" todas las veces para reportar lo que dice alguien.\nDependiendo del contexto puedes usar otros. Estos son algunos de ellos:\nconfesar\nresponder\nsuplicar\ndeclarar\ninsistir\nafirmar\nanadir\nagregar\npreguntar\nordenar\nadvertir\nrogar\nasegurar\ncontestar\npedir\n\nI. Dialogo entre Carlitos y Mariana:\n\n- Carlitos:\no Tiene razon, senora.\no Me doy cuenta de todo.\no Le agradezco mucho que se porte asi.\no Disculpeme.\no De todos modos tenia que decirselo.\no Me iba a morir si no se lo decia.\n\nCarlitos le dijo a Mariana que ella tenia razon y que el se daba\ncuenta de todo. Anadio que le agradecia que se portara de esa\nmanera y que lo disculpara, pero que de todos modos tenia que\ndecirselo porque (el) se iba a morir si no se lo decia.\n\n- Mariana:\no No tengo nada que perdonarte.\no Me gusta que seas honesto y enfrentes tus cosas.\n_____________________________________________________________\n\n- Carlitos:\no Por favor, no le cuente a Jim.\n\n- Mariana:\no No le dire, pierde cuidado.\no Antes de que te vayas ¿puedo pedirte un favor?\no Dejame darte un beso.\nII. Cuentale a otra persona lo que le dijeron la madre y el padre a Carlitos sobre\nsu \"delito\"\n\n- La madre:\no Nunca pense que fueras un monstruo.\no ¿Cuando has visto aqui malos ejemplos?\no Dime que fue Hector quien te indujo a esta barbaridad.\no El que corrompe a un nino merece la muerte lenta y todos los castigos del\ninfierno.\no Habla, no te quedes llorando como una mujerzuela.\no Di que tu hermano te malaconsejo para que lo hicieras.\n-\nEn cuanto se te baje la fiebre vas a confesarte y a comulgar para que Dios\nNuestro Senor perdone tu pecado.\n\n- El padre:\no Este nino no es normal.\no En su cerebro hay algo que no funciona.\no Debe ser el golpe que se dio a los seis meses cuando se nos cayo en la plaza\nAjusco.\no Voy a llevarlo con un especialista.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Free Downloads: A right or digital piracy?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/f2302dd0f867c150ef023eb76c27bb93_MIT21G_711S14_freedown.pdf",
      "content": "Descarga libre: ¿un derecho o pirateria digital?\nLa \"pirateria\" de contenidos es uno de los temas que mas controversias ha generado la red entre\nindustria y usuarios. Hasta la propia definicion esta en entredicho: descargas ilegales, acceso libre,\nintercambio, actividades extramercado, etc. Cada ano se descargan ilegalmente millones de canciones\nsegun la Federacion Internacional de la Industria Discografica. La pirateria digital, sea de musica,\npeliculas o juegos, se ha convertido en un fenomeno global y en la causa de acerrimas disputas legales.\nLa industria del entretenimiento defiende acciones drasticas: desde demandas contra usuarios hasta\nmedidas como la adoptada en Suecia, donde un ley obliga a las empresas proveedoras de servicios a\nrevelar informacion sobre los usuarios. Francia incluso aprobo una legislacion que contempla cortar la\nconexion a quienes persisten despues de varios avisos. ¿Pero es esta la forma correcta de enfrentar la\npirateria? Es mas, ¿debe penalizarse o simplemente es hora de aceptar el intercambio de archivos como\nun \"derecho\" de la era digital? En Suecia el 75% de los votantes entre 18 y 20 anos apoya la descarga de\nfuentes no autorizadas. Y Peter Sunde, co-fundador del sitio The Pirate Bay, dijo a BBC Mundo que es\nhora de \"discutir lo que la sociedad necesita, no lo que las grandes companias necesitan\".\n¿Y tu que opinas? Lee los articulos a continuacion y usa las preguntas abajo para expresar tu opinion.\n-\nUno de cada dos internautas realizan descargas ilegales\n-\nLos 20 paises que mas piratean musica y sus artistas favoritos\n-\nComo acabar con la pirateria digital sin caer en la censura\n-\nEstudio muestra que la pirateria digital no esta afectando la industria del entretenimiento\n-\nProveedores de Internet lanzan medidas anti-pirateria\n¿Debe criminalizarse la descarga de archivos de fuentes no autorizadas? ¿O debe permitirse como un\nfenomeno que es parte de la era digital?\n¿Deben los artistas aceptar, como lo hizo la banda Radiohead, que compartir su musica es mejor para\npromocionarse y compensar ganancias con presentaciones en vivo?\n¿Cual es la mejor estrategia para combatir la pirateria: demandar a los usuarios, obligar a los\nproveedores de servicios a ser policias de la red? ¿O es la revelacion de datos sobre los usuarios una\nviolacion de sus derechos civiles?\n¿Son los modelos de micropagos utilizados, por ejemplo, por iTunes, la solucion?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Internet: Development Tool or Greater Inequality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/5eeb1edc97df277e72c99e856eb6f2f5_MIT21G_711S14_Internet.pdf",
      "content": "Internet ¿herramienta de desarrollo o fuente de mayor desigualdad?\n¿Es la Internet algo en lo que los paises en vias de desarrollo y las comunidades mas aisladas en\nellos deben invertir? ¿Estar conectados a la red justifica el gasto en equipo, infraestructura,\nentrenamiento, mantenimiento, etc. en lugares que tienen necesidades mucho mas\napremiantes? ¿Cuales podrian ser las consecuencias de no hacerlo? ¿y de hacerlo? ¿Sera la\nInternet solo un beneficio para algunos e intensificara las diferencias y la separacion entre las\nclases sociales? ¿Aumentara o disminuira la dependencia? ¿Es Internet diferente a otras\ntecnologias? ¿Que impactos positivos o negativos podria tener en la vida individual, social,\npolitica, economica y cultural, educativa de un pais o comunidad? Lee los planteamientos que\nse hacen en el siguiente articulo y expresa tu opinion.\n-\n\"Esperanza tecnologica: internet para los pueblos indigenas de Latinoamerica\"\n-\nteleSur tv. \"Indigenas en Bolivia difunden lengua aymara por internet.\" March 25, 2010.\nYouTube. Accessed October 7, 2014.\nhttp://www.youtube.com/watch?v=1hcdyw3oMmM&feature=youtu.be\nRepasa este Vocabulario para la discusion en clase.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Preterite or Imperfect",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/0d5c59f5f4e0dd2510a7d6160973db27_MIT21G_711S14_Preterito.pdf",
      "content": "Preterito e Imperfecto\nCompleted Actions - Preterite\nThe preterite is used to describe completed actions in the past:\nPaso una semana. - A week went by.\nHable con el director. - I spoke with the director.\nHice mi tarea. - I did my homework.\nBeginning or End of an Action - Preterite\nEmpece a trabajar a las 8 de la manana. I started to work at 8 in the morning.\nTrabaje hasta las 4 de la tarde. I worked until 4 in the afternoon.\nBeginning and End of an Action or Condition - Preterite\nTrabaje desde las 8 hasta las 4. I worked from 8 till 4.\nVivi en Espana por diez anos. I lived in Spain for 10 years.\nEstuve enferma ayer. I was sick yesterday.\nOngoing Past Actions - Imperfect\nThe imperfect is used for ongoing past actions. These actions tend to be interrupted by\nanother action.\nCaminaban por la calle cuando empezo a llover. They were walking down the street when it\nbegan to rain.\nJuan se banaba cuando llegaste. Juan was taking a bath when you arrived.\nBackground Information - Imperfect\nThe imperfect is used to give background information which sets the stage for the principal\naction:\nEra un dia muy bonito, no hacia calor y habia una brisa muy fresca. It was a very nice day,\nit wasn't hot and there was a very fresh breeze.\nTodos estabamos preocupados por el examen: Adolfo sudaba, Gabriel repasaba su tarea y\nLupe no podia dejar de hablar. We were all nervous about the exam: Adolfo was sweating,\nGabriel was reviewing his homework, and Lupe couldn't stop talking.\nSimultaneous Actions - Imperfect\nSimultaneous actions are expressed with the imperfect:\nMientras pescaban, hablaban del partido de futbol. While they were fishing they talked\nabout the soccer game.\nHabitual Past Actions - Imperfect\nWhen you want to refer to habitual past actions in situations that would require \"used to\" or\n\"would\" in English (e.g. I used to smoke; we would always meet at the arcade) use the\nimperfect in Spanish.\n\nYo jugaba tenis cada fin de semana cuando era nino. I used to play tennis every weekend\nwhen I was a child.\n\nSiempre haciamos excursiones en bicicleta. We would always go for bike rides.\nMental State or Feelings - Imperfect\nIf it is a verb which indicates a state of mind or feelings, rather than a change of state of\nmind, then use the imperfect:\nYo no me sentia bien. - I didn't feel well.\nNo sabiamos quien era. - We didn't know who it was.\nEstaban muy enojados. - They were very angry.\nChange in Mental State or Feelings - Preterite\nChanges in one's mental state or feelings are expressed with the preterite. This is often\nexpressed with the reflexive form and corresponds to \"become + adjective\" in English:\n\nMe enferme del estomago. - I became sick to my stomach.\nSe entero del error. - He found out about the error.\nTe enojaste con el arbitro. - You got mad at the referee.\n\nVerbs that change meaning if used in the Preterite or the Imperfect: There are some\ncases in which two distinct English verbs will be needed to express what can be conveyed by\nthe use of the preterite and imperfect in Spanish. Remember that the preterite refers to the\nbeginning or ending of an action and the imperfect refers to an ongoing condition.\nFor example:\n\nPreterito\nImperfecto\nConocer\nTo meet, to know for the first time\nConoci a Miguel en 1998.\nI met Miguel in 1998.\nPreviously knew for some time\nYo conocia a Juan desde la escuela\nprimaria.\nI knew Juan since elementary school.\nSaber\nLearned, found out at a specific\npoint\nJuan supo que su madre estaba\nenferma cuando su padre se lo\ndijo. Juan found out his mother was ill\nwhen his father told him.\nHad knowledge (or not) for some\ntime\nJuan no sabia que su madre estaba\nenferma. Juan did not know his\nmother was ill.\nPoder\nManaged to; to Succeed (or failed\nto, if negative)\nPude dormir a pesar del ruido de la\nfiesta.\nI managed to sleep (action takes\nplace) in spite of the noise from the\nparty.\nCould, had the ability to\nPodia hacerlo pero no tenia ganas.\nI was able to (had the ability to) do it,\nbut I didn't feel like it.\n\nQuerer /\nNo querer\nTried to (or refused if negative)\nEl vendedor quiso venderme seguros.\nThe salesman tried to sell me\ninsurance (action takes place).\nMe invito al teatro pero no quise ir. (I\nsaid no)\nShe invited me to the theater, but I\nrefused to go (action-saying no-takes\nplace).\nWanted, had the intention to\nEl vendedor queria venderme\nseguros.\nThe salesman wanted to sell me\ninsurance (mental state, no action\nimplied).\nMe invito al teatro pero no queria ir.\n(did not feel like it)\nShe invited me to the theater, but I\ndidn't want to go (ongoing mental\nstate, no action implied).\nTener que\nFulfilled obligation\nTuve que ir a la junta. - I had to go to\nthe meeting.(and I went)\nHad an obligation (not necessarily\nfulfilled)\nTenia que ir a la junta. - I was\nsupposed to go to the meeting.\n\nHaber\nUsed for events\nHubo una fiesta en mi casa.\nThere was a party in my house (event)\nUsed for objects or people\nHabia mucha gente en la fiesta.\nThere were a lot of people in the party.\n(Description)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "La campaña por la madre tierra",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/86f1618dbdf360c5b6445ad263341806_MIT21G_711S14_Madre.pdf",
      "content": "La Campana por la Madre Tierra\nComo todos saben, los problemas que enfrenta el planeta son innumerables y cada vez mas graves. La\norganizacion Paz Verde ha decidido concentrar todos sus esfuerzos en una campana dirigida a atacar el\nproblema ambiental mas apremiante y urgente para la humanidad. Ha reunido a expertos de todo el\nmundo para discutir a cual de los multiples problemas ambientales deben prestar su atencion inmediata\ny sus recursos. Tu eres parte del panel de expertos internacionales que acaba de completar un estudio\ntitulado Planeta Bajo Presion en el que se analizan los problemas mas graves que enfrenta la Tierra. Sin\nembargo, los miembros del grupo tienen una opinion diferente sobre el problema mas critico y no estan\nde acuerdo sobre cual deben escoger como objetivo de la campana. Esta es la ultima sesion donde se\ntiene que llegar a una decision. Tu vas a exponer el que en tu opinion es el mas urgente. Incluye en tu\nexposicion no solo la descripcion del problema sino algunos pronosticos de lo que pasara en el futuro si\nno se le da atencion inmediata.\nLos problemas que se han planteado como los mas urgentes son los siguientes:\n-\nLa desaparicion de la biodiversidad\n-\nLa crisis del agua\n-\nLa crisis energetica\n-\nEl hambre\n-\nEl cambio climatico: el calentamiento globlal / Entrevista radial sobre el cambio climatico\n-\nEl agujero en la capa de ozono\n-\nLa superpoblacion\n-\nEnfermedades y epidemias\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Advanced Spanish Conversation and Composition: Composition 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-711-advanced-spanish-conversation-and-composition-spring-2014/26b28c43e703397e235d5d51b90264e1_MIT21G_711S14_Comp1.pdf",
      "content": "Composicion 1\nEscoge uno de estos temas y escribe una composicion de dos paginas a doble espacio.\nTemas de composicion:\n1. Escribe un ensayo de opinion sobre las ventajas y desventajas de las redes sociales y otras tecnologias\nde la comunicacion para las relaciones personales. Fundamenta tu punto de vista con ejemplos o casos.\n2. ¿Te atreves a imaginar como sera el mundo en el ano 2111?. Imagina que eres un famoso futurologo -\nalguien que estudia las tendencias actuales para pronosticar desarrollos futuros. Describe el mundo que\nanticipas. ¿Que preves tu que habremos logrado para fines de este siglo? ¿Como viviremos? ¿Que habra\ncambiado? ¿Que problemas habremos superado? ¿Que problemas perduraran y que nuevos retos\nencontraremos? Usa tu imaginacion pero no te dejes llevar demasiado por la fantasia. Recuerda que los\nfuturologos basan sus conjeturas en las tendencias existentes.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.711 Advanced Spanish Conversation and Composition\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}