{
  "course_name": "Advanced Topics in Hispanic Literature and Film: The Films of Luis Buñuel",
  "course_description": "This course considers films spanning the entire career of pioneering Spanish filmmaker Luis Buñuel (1900–1983), from his silent surrealist classic of 1929, Un perro andaluz, to his last film, Ese oscuro objeto del deseo (1977). We pay special attention to his Mexican period, in exile, and the films he made in, and about, Spain, including his work in documentary. It explores Buñuel’s early friendship with painter Salvador Dalí and poet Federico García Lorca, surrealist aesthetics, the influence of Freud’s ideas on dreams and sexuality, and the director’s corrosive criticism of bourgeois society and the Catholic church. We will focus on historical contexts and relevant film criticism.\nAbout This Course on OpenCourseWare\nThe instructor of this course, Elizabeth Garrels, is a Professor Emeritus at MIT. She retired in 2014 after 35 years at the Institute. Professor Garrels taught this course for over 15 years, and it evolved over this time period. Normally, a course on OCW represents the version of a course taught during a specific semester and year. However, for this course we hope to represent the evolution of the course during the main years it was taught. The materials you see here are not from a particular iteration of the course, but are drawn from all of the years the course was taught.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "History",
    "European History",
    "Latin American History",
    "Society",
    "European and Russian Studies",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "History",
    "European History",
    "Latin American History",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 2 hours / session\n\nPrerequisites\n\nThe prerequisite for this course is one intermediate Spanish subject. Usually the readings for the class were in both Spanish and English, but student writing and class discussions were exclusively in Spanish.\n\nSyllabus Archive\n\n1999 Syllabus (PDF)\n\n2001 Syllabus (PDF)\n\n2006 Syllabus (PDF)\n\n2007 Syllabus (PDF)\n\n2009 Syllabus (PDF)\n\n2011 Syllabus (PDF)\n\n2013 Syllabus (PDF)\n\nFilms\n\nStudents view one feature-length, or at most, one feature-length and one short film per week by Spanish film director Luis Bunuel, that is, 13 out of Bunuel's total production of 32 films. The course includes roughly two and a half hours per week of discussion about the films and related web materials and printed texts, including film criticism and the director's autobiography\nMi ultimo suspiro\n. The subject considers films spanning Bunuel's entire career, from his earliest silent surrealist classic of 1929 to his last film,\nCet Obscur object du desir\n(\nEse oscuro objeto del deseo\n, 1977), although it pays special attention to his Mexican period and the three films he made in Spain.\n\nThe subject also explores Bunuel's early friendship with painter Salvador Dali and poet Federico Garcia Lorca, surrealist aesthetics, the influence in his films of Freud's ideas on dreams and sexuality, his corrosive criticism of bourgeois society and the Catholic church, and allusions to European painting (i.e. Dali, Vermeer, Ribera, Millet) in his cinematic images. Historical contextualization will be provided for each film discussed.\n\nRequired Books\n\nBunuel, Luis.\nMi ultimo suspiro\n. Debolsillo, 2012. ISBN: 9788499894447.\n\nEvans, Peter.\nThe Films of Luis Bunuel: Subjectivity and Desire\n. Clarendon Press, 1995. ISBN: 9780198159063.\n\nEdwards, Gwynne.\nThe Discreet Art of Luis Bunuel: A Reading of His Films\n. Marion Boyars, 2000. ISBN: 9780714528328.\n\nDetermination of Final Grade\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and quantity and quality of active participation in class discussions\n\n40%\n\nWritten notes on\nMi ultimo suspiro\n\n5%\n\nFirst oral (student group) report\n\n10%\n\n750 word essay on scene from film\n\n10%\n\nOral report on 10 page paper\n\n10%\n\n10 page paper\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "21G.735 Clarification of 750 Word Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-735-advanced-topics-in-hispanic-literature-and-film-the-films-of-luis-bunuel-fall-2013/ad96a8a5aca8fd147c965a77ba42f723_MIT21G_735F13_essay_clari.pdf",
      "content": "Otras aclaratorias sobre este ensayo:\nUna escena no se mide por su extension sino por su unidad de lugar, tiempo, o estilo. La definicion que\naparece en \"Algunos terminos de cine\" define \"scene\" como: \" - scene: secuencia [A continuous block of\nstorytelling either set in a single location or following a particular character. The end of a scene is typically\nmarked by a change in location, style, or time.]   En este glosario \"secuencia\" se usa intercambiablemente\ncon \"escena.\"   Otro glosario, que se ha anadido con el titulo de \"Glosario de Ripoll,\" distingue\nentre \"escena\" y \"secuencia,\" y creo que prefiero esta distincion a la practica de confundir los dos terminos.\nEste glosario (de un tal Ripoll) define \"escena\" de la siguiente manera:   \" ESCENA: Serie de planos que\nforman parte de una misma accion o tambien ambiente dentro de un espacio y de un tiempo concretos.\"  \nSegun esta definicion, que prefiero, la primera escena de \"Los olvidados,\" despues del prologo documental,\nes la escena que tiene lugar en el terreno donde los muchacos de la pandilla juegan a la corrida de toros.\nEsta escena, unida por su lugar o espacio, termina cuando el nino encaramado encina de la columna (del\nque se dijo en clase que se parecia a un mono trepando un arbol) grita, \"Oye, aqui viene el Jaibo.\" El\n\ncambio de escena esta marcado por un nuevo lugar o espacio, en que aparece el anunciado en la escena\nanterior, el Jaibo, en una calle urbana muy transitada.  Como Uds. ven, las escenas pueden ser de distinta\nextension. Uds. deben de escribir sobre una escena que puedan explicar bien, aunque no es necesario\nhacerlo exhaustivamente, en un minimo de 750 palabras, o 3 paginas escritas a maquina doble espacio\n(Word doc. por favor). Cuando digo un minimo, esto quiere decir que el ensayo puede ser de este largo\npero no mas breve. Es mejor que el ensayo no se extienda mucho mas alla del minimo de palabras. Si\nse extiende, estas palabras extras tienen que justificarse por considerarse imprescindibles para hacerle\njusticia a lo tratado. Mi objetivo es que escriban aproximadamente 750 palabras sobre lo que Uds.\nconsideren mas digno de comentar en la escena escogida. Otra vez, su analisis no tiene que ser\nexhaustivo.  Su analisis:\n1) debe comenzar identificando la escena, como yo identifique la primera escena de \"Los\nolvidados\" arriba. Luego;\n2) debe comentar su construccion filmica, que puede incluir observaciones sobre las tecnicas\nempleadas. Uds. deben repasar los dos glosarios (\"Algunos terminos\" y el \"Glosario de Ripoll\") y\nel sitio de Ripoll para familiarizarse con los posibles recursos tecnicos que puedan\ncomentar. Uds. decidiran lo que quieran comentar en este sentido. La ultima parte de su\nensayo es;\n3) comentar la relevancia de la escena con respecto a la narracion del film en su totalidad.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.735 Advanced Topics in Hispanic Literature and Film: The Films of Luis Bunuel\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21G.735 Mi ultimo suspiro notes assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-735-advanced-topics-in-hispanic-literature-and-film-the-films-of-luis-bunuel-fall-2013/6d35e85cb85c534034abe5ad11eb2458_MIT21G_735F13_ultimo_asgn.pdf",
      "content": "Mi ultimo suspiro assignment\nFor all assignments from Mi ultimo suspiro, a student or group of students takes readings notes in\nSpanish and sends them to me by e-mail. Notes are due before Session 5.\nNotes should record (and if appropriate, comment on) those instances in the autobiography where\nBunuel expresses opinions on politics, religion, freedom, sexuality, dreams and the irrational, and art\nand aesthetics. Feel free to add other categories if you wish. Also, there are a lot of cultural allusions in\nBunuel's book, i.e. to names and historical events. When you don't recognize a name or an event, write\nit in your notes, and use the web to quickly identify it. (Give web sources, and use quotation marks if\nyou copy text. Please don't send me more than 100 words per identification, although you are free to\nprint out more and keep it for yourselves. I accept Wikipedia for this exercise. For most topics on\nHispanic culture, Wikipedia.es is much better than its counterpart in English.) Textual quotes for these\nidentifications can be in Spanish or in English. The notes, themselves, must be in Spanish. Please take\ncare in writing these notes, and use this exercise as an opportunity to improve your written Spanish.\nLook up all questions regarding spelling and word meaning on Real Academia Espanola.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.735 Advanced Topics in Hispanic Literature and Film: The Films of Luis Bunuel\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}