{
  "course_name": "Africa and the Politics of Knowledge",
  "course_description": "This course considers how, despite its immense diversity, Africa continues to hold purchase as both a geographical entity and meaningful knowledge category. It examines the relationship between articulations of “Africa” and projects like European imperialism, developments in the biological sciences, African de-colonization and state-building, and the imagining of the planet’s future. Readings in anthropology and history are organized around five themes: space and place, race, representation, self-determination, and time.",
  "topics": [
    "Humanities",
    "History",
    "African History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "Comparative Politics",
    "Humanities",
    "History",
    "African History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "Comparative Politics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nAfrica is not a country, but rather a territory covering one fifth of Earth's land surface, home to over one sixth of the world's population and more than one thousand languages, and yet \"Africa\" continues to mean something in the world as\na\nplace. The aim of this course is to examine how ideas about\nthe kind of place\nthat \"Africa\" is have been articulated and negotiated from colonial times to the present. In so doing, we get a glimpse of the politics of knowledge production across the disciplines of geography, history, biology, political science, and the creative industries.\n\nThe course is divided into two parts: Being and Becoming. In Part 1, Being, we consider foundational constructions of Africa as a place in the world (what Africa is), through its geographical mapping, debates about its history, and the articulation of race--of Blackness in particular. In Part 2, Becoming, we turn to social science theories and political and cultural movements from the postcolonial period to the present that have sought to conceptualize Africa's place in the world after independence (what Africa shall become).\n\nReadings and Films\n\nAll required readings and films can be found in the\nReadings and Films\nsection.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and class participation\n\n20%\n\nReading responses (20)\n\n20%\n\nReading presentation and class discussion lead (1)\n\n10%\n\nMap quiz (P/F)\n\n5%\n\nPaper 1\n\n15%\n\nFinal paper (Prospectus 5% + Outline 5% + Presentation 5% + Paper 15%)\n\n30%\n\nFor detail on the activities listed in the table, see the\nAssignments\nsection.\n\nWriting Support\n\nThe\nWriting and Communication Center (WCC)\nat MIT offers MIT students\nfree\none-on-one professional advice from communication experts. The WCC works with undergraduate, graduate students, post-docs, faculty, staff, alums, and spouses. The WCC helps you strategize about all types of academic and professional writing as well as about all aspects of oral presentations (including practicing classroom presentations & conference talks as well as designing slides). The WCC also helps with all English as Second Language issues, from writing and grammar to pronunciation and conversation practice.\n\nAcademic Integrity\n\nMIT students are expected to adhere to MIT's\nAcademic Integrity\npolicies. All work (research papers, weekly papers, presentations) must be completed independently. Students are encouraged to discuss the readings and their projects with each other (they may, for example, want to practice their presentations for their classmates), but they are individually responsible for all written work.",
  "files": []
}