{
  "course_name": "AIDS and Poverty in Africa",
  "course_description": "This is a discussion-based interactive seminar on the two major issues that affect Sub-Saharan Africa: HIV/AIDS and Poverty. AIDS and Poverty, seemingly different concepts, are more inter-related to each other in Africa than in any other continent. As MIT students, we feel it is important to engage ourselves in a dynamic discussion on the relation between the two - how to fight one and how to solve the other.",
  "topics": [
    "Health and Medicine",
    "Public Health",
    "Society",
    "Global Poverty",
    "The Developing World",
    "Health and Medicine",
    "Public Health",
    "Society",
    "Global Poverty",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nFormat\n\nThis course, as part of the\nExperimental Study Group\nSeminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Student Raja Bobbili (B.S. 07 Computer Science and Electrical Engineering, Economics) taught this seminar in cooperation with Dr. Lee Perlman, Lecturer in the Experimental Study Group. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nOverview\n\nThis is a discussion-based interactive seminar on the two major issues that affect Sub-Saharan Africa: HIV/AIDS and Poverty. AIDS and Poverty, seemingly different concepts, are more inter-related to each other in Africa, than in any other continent. As MIT students, we feel it is important to engage ourselves in a dynamic discussion on the relation between the two, how to fight one and how to solve the other.\n\nBackground and Motivation\n\nIn developing countries across the world, 1.2 billion people earn less than $1 a day. 798 million people in the world are undernourished; 842 million live in hunger, the extreme level of poverty. Many more such statistics exist for Poverty; millions of people across the world have been suppressed and confined to the boundaries of poverty. An important consequence of this is the deadly epidemic: HIV/AIDS.\n\nThe AIDS epidemic has struck Africa devastatingly; in 2003 alone, 2.9 million people died from HIV/AIDS. AIDS has taken more than 20 million lives and promises to take many more. In Sub-Saharan Africa alone, there are 25 million people living with HIV/AIDS. An infection rate of 7.5% in Sub-Saharan Africa shows the imminent threat that AIDS poses to the world.\n\nBeing brought up in Zambia, I have seen poverty and AIDS all around me. I have tried, and mostly failed, to associate with people that live under $1 a day. And I would like to use this seminar as ground for sharing my experiences with people, as well as listening to other people's views on poverty and HIV/AIDS.\n\nAttendance Policy\n\nSince this a seminar-style class, attendance is very important. The seminar is going to be highly discussion-based, so participation is even more important!\n\nMaximum number of unexcused absences: 2\n\nYour participation in this seminar will be directly related to how well you enjoy the class - so, please attend and participate!\n\nGrading Criteria\n\nAttendance (11/13 lessons minimum)\n\nProject",
  "files": [
    {
      "category": "Resource",
      "title": "Discrimination in Schools",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/7828639364a2f55a624c061beb188e19_MITES_253S05_tawanda_siban.pdf",
      "content": "Tawanda Sibanda\nDiscrimination in Schools\n\n(c) Produced for The Law Development Commission of Zambia\n\n1. Background\nThe last decade has witnessed the rapid and merciless spread of HIV/AIDS\nthroughout Southern Africa. Zambia has been directly affected, with over 16.5% of the\nadult population (15-40 years) currently living with HIV according to UNAIDS/WHO.\n\nStudents in secondary and tertiary institutions are between the ages of 12 -30 and\nhence are at a high risk of contracting or even carrying the virus. In Thika, a district in\nKenya, 17% of primary school children, and 22% of secondary school students are HIV\npositive [1]. These staggering statistics accentuate the severity and immediacy of the HIV\nAIDS problem in schools, and debunk the myth that education alone is sufficient to deter\nthe spread of the disease. Our very halls of learning are not immune.\n\nUnfortunately, despite the high prevalence of HIV, suffering students often find\nthemselves victims of discrimination. Due to ignorance of how the disease is spread, and\ntraditional stigma, pupils in all forms of education are frequently isolated and slandered.\nEven more seriously, there have been cases in South Africa, where students have been\nexpelled from schools or denied admission on the basis of their HIV status. Such acts of\ndiscrimination violate the basic tenets of the Universal Declaration of Human Rights:\n\"All human beings are born free and equal in dignity and rights. They are endowed with\nreason and conscience and should act towards one another in a spirit of brotherhood.\"\n\nCurrently, more work needs to be done within the Zambian legislative framework\nto protect HIV sufferers from discrimination. This paper briefly addresses some of the\nkey areas which need to be improved, and offers guidelines for the formation of laws that\nwill provide an umbrella for our large and young sector of HIV positive students. The\npaper begins by presenting suggestions that apply to all levels of educations. Subsequent\nsections then analyze primary, secondary and tertiary institutions independently, and\noffer skeletal instructions, from which a law-making body can later construct legislation.\n\n3. General Instructions\n\n3.1 Testing\nSchools should not force students to be tested for HIV. Getting tested for HIV is a\npersonal decision, and cannot be made compulsory. Similarly, being tested for HIV\nshould not be a prerequisite for admission to any school. There will necessarily be a few\nexceptions to this rule. For examples, schools in which students are exposed to the virus\nthrough classroom activities should be permitted to require HIV tests for incoming\nstudents. Such schools include nursing and medical schools, where students use syringes,\nand may come in contact with each other's blood.\n\n3.2 Privacy\nStudents have a right to keep their HIV status private. When HIV information is\ndisclosed to a member of staff, that information may only be divulged to others with the\nexplicit consent of the student involved (provided the student is of majority age - usually\nsixteen). The school shall not publish the names of HIV positive students.\n\n3.3 Anti-discrimination\nThe school shall not discriminate against HIV positive students. More concretely,\na school cannot expel a student on the basis of their HIV status. Furthermore, a school\ncannot place students with HIV in separate classrooms, or deny them resources, such as\nbooks, financial grants and accommodation, on the basis of their status. An HIV positive\nstudent should be treated identically to an HIV negative student, except in cases where\nspecial care is required to prevent the spread of the virus to peers. Hence, requiring a\nknown HIV positive student to wear gloves during a medical procedure is permissible.\n\n3.4 School Policies\n\nEvery school must adopt an anti-discrimination policy that forbids slander,\nridicule or physical abuse of HIV positive students. The policy must specify punishment\nmeted out to students violating its code. Although we cannot directly hold the school\nresponsible for the discriminatory actions of its students, schools that do not posses an\nadequate antidiscrimination policy will be fined. We hope that by encouraging schools to\npunish prejudiced behavior, we will create atmospheres of tolerance in our institutions of\nlearning.\n\n3.5 School Education\nAll schools are required to provide education on HIV/AIDS, sexuality and\nprotection against HIV. Information provided will be accurate, and scientific. In addition,\nall schools will train at least one member of staff to be a peer counselor, capable of\ndiscussing sexuality and AIDS with students, and provide some form of counseling for\nHIV positive students. Having established general laws for all forms of education, we\nnow offer suggestions for specific institutional levels.\n\n4 Primary and Nursery Schools\nAt this level, the best tool against discrimination is education. Children are very\nimpressionable. Hence, schools should teach students about the basics of HIV/AIDS and\nassure them that they cannot get the disease by befriending other HIV positive students.\nTolerance should be emphasized. Any schools found to be promoting hate or\ndiscrimination of HIV students, or propagating inaccurate, unscientific \"myths\" about\nAIDS and the spread of the disease shall be fined and/or prosecuted.\n\n5 Secondary Schools\nAll secondary schools are required to provide free condom dispensaries. Recent\nstudies have shown that contrary to popular belief, providing young adults with condom\ndecreases HIV prevalence. It is time that the nation realizes that its young adults are\ngoing to be sexually active, regardless of the intensity and frequency of abstinence\nmessages and posters. Sex, for a young man or woman, is perilously enticing and for\nmany the desire is insurmountable. There is a definite need to make sure that the young\nestablish healthy sexual lifestyles early on. We predict that installing condom\ndispensaries in schools will be met with opposition from religious and conservative\ngroups. We are not condoning teenage sex. We are admitting the realities of modern\nAfrica, and reacting accordingly. Furthermore, if an HIV student develops full blown\nAIDS while at school, the institution should allow the student to take time off, and return\nwhen his/her symptoms are under control. If the student has fallen behind irrecoverably\nin class, despite the best efforts of the teaching staff, the student may repeat the entire\nyear, without danger of being excluded from the institution.\n\n6 Tertiary Education\nUniversities and colleges must provide free condoms and sexual health education.\nEvery student has the right to HIV/AIDS information. If a student discriminates against,\nslanders or physically abuses an HIV positive student, then the state is allowed to\nprosecute the aggressor. The school must cooperate with the state, by providing the name\n\nand details of the aggressor. A tertiary institution must employ or train at least one peer\ncounselor to offer support and counsel to HIV positive students.\n\n7 Conclusion\nWe have very briefly highlighted the main talking points for HIV discrimination\nin schools. More work is still required to provide sample anti-discrimination policies that\nschools can employ (section 3.4) and identify institutions exempt from testing rules\n(section 3.1). Dealing with discrimination in schools is difficult, because we cannot\ndirectly hold the school responsible for the actions of its students. Often, the students are\ntoo young to be prosecuted. We have circumvented these issues by requiring that schools\nenforce and promulgate anti-discrimination policies. It is our hope that by holding\nschools responsible for possessing such policies we will foster HIV tolerance on our\nvarious campuses.\n\n8 References\n[1] AIDS in Kenya, Ministry of Health, Sixth Edition 2001\n[2] Stigma, Discrimination and Attitude Towards HIV & AIDS\nhttp://www.avert.org/aidsstigma.htm\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "frances_rogoz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/3b5fa789f54ef5c896e91a30ba08dff7_frances_rogoz.pdf",
      "content": "Frances Rogoz\nGovernment Intervention\n\n(c) Produced for The Law Development Commission of Zambia\n\nGovernment Intervention via special programs and mandates can have a great\neffect on AIDS in Zambia. Two very different types of programs that the government can\nimplement are affirmative action programs in the workplace and public awareness\nprograms.\n\nIn order to successfully integrate HIV and AIDS patients back into the\nmainstream it is imperative that they have jobs in the community. Holding down a job\nwill have a number of positive effects on the HIV/AIDS patient. First and foremost, work\nwill provide these Zambians with a steady source of income,\nwhich they can put towards purchasing the necessary drugs to treat their condition. It is\nalso important for HIV and AIDS patients to maintain a high morale. Jobs will be a\nsource of pride for the patients, and will help alleviate the depression common among the\n\nterminally ill. On a more economic level, an increase in workforce in general will aid in\nthe growth of the Zambian economy.\n\nBut how will the government be able to guarantee these jobs for HIV/AIDS\npatients? The answer lies in affirmative action. Affirmative action programs can be\nimplemented in several ways. First, the government could instate a quota of employees\nthat must be HIV positive. Five percent of a company's workforce must be positive for\nthe disease. This percentage is small enough so that, effectively, jobs will not be taken\naway from healthy Zambians. On the other hand, the percentage is large enough so that\nthere will be plenty of jobs for HIV/AIDS patients that want them.\n\nAnother variety of affirmative action that may work even better in promoting\nwork for HIV and AIDS patients would be to offer a tax break for companies that meet a\ncertain quota of HIV/AIDS patients. This would motivate the companies to hire HIV\npositive employees.\n\nAlthough making sure HIV/AIDS patients have work is very important, it is\nequally important to make sure that the public health is preserved. For this reason, the\naffirmative action program would not be enforced in companies dealing with public\nhealth (like hospitals, for example) or food service. In these industries, the possibility of\naccidental infection is much higher, so it would be safer to not implement the affirmative\naction program in these cases.\n\nAnother form of government intervention that will aid in the prevention of the\nspread of AIDS as well as the integration of HIV and AIDS patients in the community\nwill be through special public awareness programs.\n\nThe government of Zambia will instate a special committee and task force to deal\nexclusively with educating the general public on how to suppress the spread of AIDS as\nwell as how to properly treat and deal with HIV positive peers. The two-part approach of\nthe Committee is central to its success. Clearly, suppressing the spread of AIDS is of\nhighest priority, but it is also incredibly important to help to remove the stigma from\nbeing an HIV positive person in\nthe community.\n\nThese public awareness programs will be targeted at adults who did not have the\nbenefit of modern primary school AIDS education. One of the best ways to reach the\nadult population is through visual media, especially movies and television. The task force\nwill help to create hip television shows and pre-movie clips promoting abstinence and\nsafe sex, or promoting the integration of HIV and AIDS infected persons into the\ncommunity.\n\nIt is very important to get these movies and television shows into all parts of\nZambia. In order to reach the very rural areas, \"portable movies\" will be assembled to be\nplaced on trucks. These movies can then be transported and shown to small villages.\n\nHopefully, these films will help Zambians to better understand how to prevent the spread\nof HIV as well as how to better integrate them into their daily lives.\n\nFemale and male condom distribution is also critical to the successfulness of this\nprogram. Abstinence will be taught at school, so including abstinence education for\nadults, who are very possibly married, would be fruitless. There must be large amounts of\nfunding dedicated to the purchase and distribution of\nsaid condoms. Hopefully, the prevalence of condoms as well as their depiction in\naforementioned movies will help people feel more comfortable using them. Ideally,\ncondom usage will become \"cool\".\n\nHopefully, the combination of affirmative action programs and the establishment\nof a special AIDS committee and task force will have a positive effect on the people of\nZambia. The instatement of these programs could very will shrink the AIDS population,\nand also remove the stigma from having the disease."
    },
    {
      "category": "Resource",
      "title": "mahreen_khan.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/4cee3df1e989750b0499fc44565d703c_mahreen_khan.pdf",
      "content": "Mahreen Khan\nGovernment Intervention\n\n(c) Produced for The Law Development Commission of Zambia\n\nAs a central planning body with access to the national budget and also\ninternational sources of finance, the government of Zambia help alleviate the\nAids/HIV epidemic by undertaking a number of policies geared at raising\nawareness to Aids at all levels of the social strata. The government can play a\ndirect role by directing legislation to include HIV/AIDS friendly laws and\nundertaking policies that help increase social and public awareness of HIV/AIDS.\nThis section will concentrate in the latter initiatives that the government can\nimplement to ensure that the spread of the disease in contained in the future\nyears so it does not permanently debilitate the economy from achieving\n\neconomic growth and welfare for future generations. The government should\nundertake steps that will help reinforce the role of the Zambia National AIDS\nCouncil and Secretariat which was formally launched on March 16,2000. These\nbodies, which are under the supervision of a Council of Ministers, can take a very\nactive role towards strengthening of the AIDS/HIV support and prevention\nprograms around the country. They have the ability to exploit a number of\ndifferent types of outlets for information and support generation to the public. The\nNational Council was established with the goal of promoting and implementing\neffective approaches via different sectors of the economy. Their attention should\nbe directed towards the prevention of HIV Transmission to the non-affected\npopulation and also provide care and social support for those already infected for\nHIV/AIDS by helping mitigate their pains both physical and social. The objectives\nof the Council are: the promotion of behavior change; prevention of mother-to\nchild transmission; safe blood transfusion; voluntary counseling and testing; care\nand support for people living with HIV/AIDS and orphans and vulnerable children;\ndevelopment of an information system database; and, coordination of multi\nsectoral interventions at district, provincial and national levels.\n\nOne of the reasons why there has been such rapid spread of the epidemic\nis because of the inequality between the genders. In general, women tend to\nhave much less economic and social power in the community because of the\nway the society is organized. In general, the household are dominated by the\ndecisions of the males in the family. This inequality has evolved because\ntraditionally women have been less educated and less able to support\nthemselves. Hence, they depend on the men for economic and moral support.\nThe fact that women generally have less brute force than men has exacerbated\nthe process. Consequently, women find it difficult to negotiate safe sex with their\nhusbands who general indulge in extra-marital affairs and are hence more\nsusceptible to HIV/AIDS transmission. The men then pass on the HIV to their\nwives who are unable to make their husbands use condoms during intercourse.\nThus, in order to ameliorate the spread of the disease, the country needs to also\nraise the status of women in society by giving them a larger voice and ensuring\nthat they are able to uphold their rights in the bedroom as well in society. The\nway that this can be done is by increasing their level of literacy so they are able\nto find employment and support themselves. Also, the Council can initiate a\nnumber of different types of awareness programs which inform women of their\nrights in the household. Campaigns can be started to encourage women to use\nthe female condom. Health workers need to be employed who will work at the\nlocal government level along with the local policy makers in order to help start\nsuch awareness programs. The government can seek the aid of the multilateral\nand bilateral support from donor organizations to help create funding for these\nprojects. In order to make the above programs viable, the government must also\ninclude the Local Government and Women's Affairs Ministries with the National\nCouncil. Both these ministries can play an important role in implementing the\nobjectives of the National Council. By integrating them into the Council, there is\ndirect involvement of these sectors in the process of helping create awareness\n\nand ways to reduce the onslaught of AIDS/HIV at all tiers of the government and\nsociety. By promoting the rights of the women in all levels of the social strata, the\nZambian government will be able to progress much further in their battle against\nAIDS.\n\nOne of the other major majors where both the government and other\nnongovernmental organizations (NGOs) need to focus is the prevention of the\nmother to Child transmission of AIDS/HIV. This is a very important focus area\nbecause by reducing the transmission of the virus from mother to child, they are\nable to substantially reduce the spread of the disease to future generations of the\npopulation who are the ones that are responsible for the future growth of the\neconomy. If the new generation of the population of seriously debilitated by\nAIDS/HIV, then the future growth prospects of the economy will get seriously\njeopardized. A weak dying population cannot work at levels required to\ncompete if a rapidly globalizing environment where international competition is\nvery high. Zambia needs a strong and healthy workforce and in order to ensure\nthat is the case the state along with the help of the local and international NGOs\nneed to massively upscale the project of providing treatment to pregnant mothers\nwith IADS from a very early stage of pregnancy. Anti-Retroviral Treatment (ART)\nis one of the most effective ways know so far that will help in the process.\nZambia's Prevention of Mother To Child Transmission (PMTCT) initiative was\nlaunched in 1999 offered anti-retroviral drugs (primarily Nevirapine) to expectant\nmothers. Such medicine can reduce the chance of an HIV-positive mother\ninfecting her baby by around 50%. Unfortunately, very few pregnant women are\neven tested for HIV, let alone offered treatment. However, although at this\nmoment the government is providing such treatment at the public health\ninstitutions, due to a constraint in resources ART is available in very limited\nsupply. This project needs to be scaled up massively. Not only that, the treatment\nshould prioritize the pregnant mothers because they have the most value-added\nfrom this treatment. At present, the Council has initiated programs with UNAIDS\nand its cosponsors and the bilateral agencies, to help in the prevention of\nMother-to-child transmission of HIV (MTCT) at a limited number of sites along\nwith and the Voluntary Counseling and Testing (VCT). Although the latter\nprogram has been expanded from a few sites to all districts, the former which is\nvery important has been limited in its availability. This needs to be taken up by\nthe Council in order to ensure that pregnant mother in all the district have access\nto this kind of free treatment benefits from the state, especially since they would\nmost likely be unable to afford the treatment otherwise.\n\nThe government in general should try to increase the general provision of\nAnti- Retroviral (ARV) support at the public health institutions. One of the major\nfactors that can potentially limit the growth of this program is the lack of trained\nhealth workers at the public health institutions. In order to cope with this restraint\nthe government needs to seeks the aid of other donor organizations to help with\nthis process. UNAIDS and WHO can provide support in this process by setting\nup extensive and intensive training programs for health workers so they can help\n\nin the process of proving Care to the AIDS/HIV affected patients because ARV is\nknown to dramatically improve the quality of lives of AIDS infected patients.\n\nThe government has much to do in order to help create awareness of the\nmethods of treatment for AIDS infected patients and the way in getting this\ntreatment. They need to encourage more people to undergo voluntary testing\nand take the benefit of counseling services. They can create networking\ninstitutions for people with AIDS to get moral support and receive counseling and\nmobilize communities to participate in the program. The can also set up\norphanages for children whose parents dies of AIIDS and homes for single\nmothers with HIV. They can use the help of the media (radio and television) to\nspread these messages to the general public."
    },
    {
      "category": "Resource",
      "title": "Marriage Laws",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/3aa5df699e602039350e4823ace443d0_MITES_253S05_melissa_lat.pdf",
      "content": "Melissa Latigo\nMarriage Laws\n\n(c) Produced for The Law Development Commission of Zambia\n\nAs Zambia continues to grapple with the fight against AIDS, having one of the\nhighest infection rates in the African continent, it is no secret that extramarital\nrelationships play a large role in HIV transmission cases. Studies have shown that men\nand women in Zambia are likely to have 2 - 3 partners outside of marriage. A recent\nstudy carried out on the prevalence of HIV infection rate in relation to marriage in\nKisumu, Kenya and Ndola, Zambia, suggests that in most Sub-Saharan countries, sexual\nactivity is likely to start before marriage. In addition, it is postulated that women are\nmore likely to be HIV positive before entering into a marriage, resulting in female-to-\nmale transmission. Males are thought to pass on the virus to younger females in\nextramarital relationships.\n\nThough infidelity has meant a high price to pay for the country of Zambia in\ncontrolling the spread of HIV, other factors must also be considered. Early marriage is\ncommon in Zambia as it is in other African countries. Girls tend to marry at an early age\nand hence are more likely to engage in frequent sexual intercourse. Married couples\noften see less need for condom use, which clearly puts partners at risk from contraction of\nHIV. It has been stated that \"husbands of married girls are about three times likely to be\nHIV positive than boyfriends of single girls.\" Lastly, traditional marriage practices also\nput a strain on hampering the spread of HIV. Sexual cleansing or kusalazya, is still\npracticed among some Zambian tribes and involves widows undergoing sexual\nintercourse with in-laws in order to be cleansed. \"The traditional practice of \"dry sex\" --\nintercourse that involves male penetration of a tight, dry vagina -- causes internal\nabrasions, thereby facilitating the transmission of HIV.\"\n\nThese are some of the facts that should be considered when enforcing HIV/AIDS\nmarriage policies. It is now clear that to prevent the country fighting a losing battle\nagainst the virus, stringent policies should be put in place that will enable Zambia to\nmitigate what is already a socioeconomic crisis by developing laws for the different\nsectors of the society. One of these sectors is marriage.\n\nMarriage laws within the context of HIV normally focus on two popular issues:\n\n1) Pre-nuptial Testing\n\nOn a global scale there has been continual debate as to whether countries should\nestablish mandatory testing laws prior to marriage in order to curb the effects of\nHIV. Mandatory testing would prevent release of a marriage license to a couple\nin the event that one of the partners is found HIV positive. The advantages to this\nlaw may include a reduction in mother-to-child-transmission, as HIV positive\nwomen are more likely to avoid pregnancy. Secondly, partner notification\n(discussed below) prevents transmission to a potential spouse. However, after the\nstate of Illinois launched a relatively unsuccessful pre-testing law, it is evident\nthat such a law may not work at all in Sub-Saharan Africa where resources are\nscarcer and there is a lack of an established medical record system. Failure of this\nenactment and possible enactment in a country like Zambia can be attributed to:\n- The high cost involved in developing pre-testing programs\n- The aggressiveness of mandatory testing. A lot of pressure is placed on\ncouples that may discourage them from actually getting married. This\nresults in a counter productive effect because the number of people being\ntested prior to marriage falls.\n- The difficulty in monitoring sexual habits prior to and during the course of\nmarriage. Pre-testing does not ensure prevention against infidelity.\nFurthermore, it does not account for those people engaging in sexual\nactivity and who chose not to get married.\n- People seeing married couples as high-risk groups and not seeing a need\nfor being tested if they are not get married.\n\n- The difficulty in monitoring traditional marriages in rural areas.\n- Lack of 100% accuracy in tests. Tests do not account for the window\nperiod in which a person with HIV may not have antibodies against HIV.\n\n2) Partner Notification\n\nPartner notification authorizes health workers to disclose the HIV status of an\nindividual to his/her partner(s) as the partner is at risk from contracting HIV. There\nhas been a lot of debate about partner notification, due to the breach of confidentiality\ninvolved. This lack of privacy may also discourage people from getting tested and\nresult in counter-productivity. However, as observed in past cases, it is also\nnecessary to look beyond privacy issues and protect the life of an individual at risk\nfrom contracting the virus. There has often been the story of the health worker who\ndoes not disclose an individual's positive HIV status to a partner, who later becomes\ninfected with the virus. The question is, to what extent should we allow this \"breach\nof confidentiality\" given the alarming statistics in countries like Zambia.\n\nIt appears that enforcing mandatory pre-testing laws in Zambia would not be practical for\nnamely difficulty in monitoring sexual habits and cost reasons. In a recent study on HIV\nin India, there has been some support of mandatory pre-nuptial testing due to the lower\nstatus of women. Often women do not have much say and are less likely to encourage\ntheir partner to get tested. Similarly in Zambia \"'bamachimbusas' (traditional sex\neducators) counsel girls to be subservient to their husbands and 'never say no'.\"\nHowever, once again, pre-nuptial testing would still not control the sexual behavior of the\nman during marriage. Given these issues, there is a great need to focus on the following\nareas to make the fight against AIDS within the context of marriage a successful one in\nZambia:\n\n- Pre-marital testing should be voluntary. Large campaigns should be\ncarried that encourage individuals to get tested. Since HIV transmission in\nZambia is mainly heterosexual, campaigns should largely be targeted to\nindividuals more likely to be involved in sexual activity. Testing should\nalso involve bonuses e.g. free treatment if found HIV positive, a form of\neconomic provision for children of infected parents.\n- Large campaigns should be carried out to promote use of condoms among\nmarried couples. It must be noted though that this is not always\nsuccessful. In India for example, where women are encouraged to use\ncondoms with their husbands, there has also been societal pressure to have\nchildren. Women are often not respected if they are unable to have\nchildren. As condom use prevents pregnancy, women then abstain from\ncondom use, which exposes them to HIV infection.\n- Promotion of other forms of sexual cleansing that does not involve sexual\nintercourse.\n\n- Development of a partner notification program in which only health\nworkers are authorized to reveal the HIV status of an individual to his/her\npartner. Though this opposes the confidentiality rights of an individual, I\nstill feel that the devastation as result of HIV in Zambia is enough to\nwarrant strict measures to prevent HIV contraction.\n- Campaigns promoting monogamy and it benefits should be carried out.\n- Laws that enable punishment of HIV positive people from knowingly\nengaging in high-risk sexual behavior should be enacted.\n\nOf course there are many points to be thought about while developing these different\npolicies with regard to marriage. However, I must stress that it is also necessary to\nthink about the big picture when enforcing these laws. AIDS is a killer disease and\npeople's lives are at risk. If we get caught up in too many small details like privacy\nissues when the end result of a policy measure would help in reduction of HIV, we\nare wasting precious time and precious lives. When it comes to battling HIV, the end\nshould justify the means.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "On Pre-Nuptial Testing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/11964160f2c1b0cd5214f6f8f28f2215_MITES_253S05_priyadesai.pdf",
      "content": "On Pre-Nuptial Testing: Zambia should enforce mandatory HIV/AIDS pre-nuptial\ntesting with partner notification.\n\nIf we entertain the following premises, it can be shown via a logical succession of\nevents how HIV/AIDS status of each individual is information that must be privy to both\npartners before marriage consent is given. With the rising concern over issues of marital\nfidelity and the objection of certain religious organizations to sex-education under the\npremise that it promotes extramarital sex, we must acknowledge that sex is not only\npermissible, but something that characterizes the special relationship of a marriage.\nPrudence with regards to the education of sexual practices in child-rearing is debatable,\nbut between married couples, efforts towards open discourse of sexual health is crucial.\nSexual intercourse is promoted as a function for childbirth, that which determines the\nsuccess of the family's legacy. Sex between married couples is not only legal, but it can\nsaid that it is reasonable to regard it as a primary characteristic of this state-sanctioned\ncontract.\n\nBecause a married couple is presumed to have sexual relations, the state bares a\nresponsibility at the time of validating the contract to see that there is no obvious\ndereliction. Suppose a man who is HIV positive and a woman who is aware that she is\nHIV-negative and yet is not aware of her future husband's status ask to be married by the\nstate. If the state recognizes that via the sexual contact that is inherent in marriage, if\neither member is HIV positive it will be transmitted to their partner, and, this can be\nprevented, it has a responsibility to do so.\n\nIt is not a breach of privacy to have acknowledgement of one's potential marriage\nspouse's HIV status- because the couple will, by virtue of being married, develop the\nsame HIV-status. The concern of protection of privacy is for those who are HIV-\npositive. We can assume that an HIV-negative status is only a beneficial piece of\ninformation and that it does not carry any negative stigma so that people who were aware\nof their HIVV-negative status would have qualms about presenting the information\nbefore a spouse. In another case, where both people are HIV-positive dispelling the\nknowledge between them causes no conflict of interest in that the disease is already\npresent in each person and there is no new risk imposed. In the last instance, one person\nis HIV-positive and the other is HIV-negative.\n\nWhether or not the HIV-positive individual is aware of his or her status, it is\ndestined to become the status of the HIV-negative partner. If the HIV-negative partner is\nmade aware of the fact that in accepting marriage she is essentially remitting herself to\ncontracting the disease and is also aware of the effect of HIV/AIDS and still desires to\nenter marriage despite the repercussions, it is not the state's business to restrict this\nmarriage. In the event that the HIV-negative partner be unaware of his or her partner's\nHIV-positive status who is aware of his or her positive status, transmission of HIV-AIDS\nis knowingly occurring. It does not matter that this transmission will occur within an\nintramarrital and therefore legal context of sexual intercourse: it remains a violation of\nlaw to knowingly infect another with the virus.\n\nThe state meets its responsibility in the event that a couple is not aware of their\nown HIV status and is consequently unaware of their partner's. If one member is HIV-\npositive, he or she will transmit this disease to his or her partner regardless of whether he\n\nor she is aware. In this instance, the state needs to protect the rights of the potential\nspouse who is HIV-negative from HIV contraction. This is important because in a\nculture that rewards the birth of children and in so rejects condom use between couples\nand other means of pregnancy prevention, becoming pregnant is a goal. From an HIV-\ninfected mother, there is risk to the life of the child. HIV/AIDS testing and status\nacknowledgment between married couples may reduce the stigma associated with\nHIV/AIDs testing. Of course, if someone HIV-positive is aware of his or her status and\ndecides to request that it remain private, this privacy can still remain intact. Only in the\nevent that he or she request marriage must the information be dispelled to each\nindividual.\n\nFreedom in exercising preference not to know:\nFreedom to \"not know\" is an understandable concern with regards to a disease that has\nserious physiological and psychological effects. However, freedom to \"not know\" ceases\nto be a personal freedom when the status has a direct consequence on another. At this\npoint, it is the personal freedom of the HIV-negative, uninformed individual that needs to\nbe protected, saving him or her from needless infection.\n\nIn summary,\n\n1) Sexual intercourse between married couples is legal\n2) Culture supports the notion that wives should submit to their husbands if he\ndesires sex\n3) It is illegal to knowingly infect another person with HIV/AIDS.\n\n4) It is not permissible to accept a course of action whereby a person avoids\nHIV/AIDS testing so as to get around #3.\n5) If people are to be married and extramarital sex is outlawed, it must be\nacknowledged that married couples will engage in sexual practices.\n6) If two people are to be married, it is the duty of each partner to be aware of his or\nher HIV status so that he or she does not knowingly infect his or her partner with\nthe disease. Furthermore, it is the right of each person to be aware of his or her\npartner's HIV/AIDS status so that marriage is not a means of accepting personal\ncontraction of the disease.\n7) This strengthens the rights of individuals to protect themselves from contracting\nthe disease.\na. If one spouse is determined HIV/AIDS positive and the couple decides to\nget married, then every available measure towards education of the\nconsequences and responsibilities of the disease must be made.\nb. In the event of pregnancy, an HIV/AIDS positive mother will be able to\nseek immediate health attention so as to get the best possible care for\nherself and her child. Anti-retroviral drugs are extremely successful in\ntheir ability to prevent the contraction of the HIV virus from mother to\nchild, and by seeking such treatment early on, the entire family unit is\nbenefited.\n\nQuestions:\n\n1. Isn't mandatory HIV/AIDS testing invasive? Is mandatory notification of one's HIV\nstatus to one's potential spouse a breach of privacy?\na)\nWhat should be emphasized is the extension of a human right that is\nmade by giving both individuals of a marriage partnership an outlet\nfrom contracting the disease. No individual should be subjected to\npreventable death: the HIV/AIDS virus is not an exception.\nb)\nConsideration must be given to the future generation of Zambians.\nAnti-retroviral drugs are extremely successful in delaying the onset or\npreventing the transaction of the virus from mother to fetus. The\ntechnology is at hand so that if a mother notifies the state of her HIV-\npositive status, the state has a means to prevent the untimely death of\nher child.\nc)\nThe health care that can be given to help save the child of an HIV-\npositive mother from being born infected saves an innocent child from\nneedless torture: the torture of experiencing the painful deterioration of\ntheir young bodies while living in a country that is economically\ninsufficient to be able to provide the HIV-positive child with a future.\n\nBesides being ethically upright, it is furthermore economically advantageous to\nZambia. Children with AIDS are costly to accommodate, many of whom are likely to be\norphaned upon their parents' premature death caused by the disease. A decision that\nreduces the number of unemployed citizens is beneficial. HIV/AIDS renders its victims\nuseless once it takes its toll. Furthermore, the medical health problems that it causes\n\nincreases demand of government aid to assuage the suffering and accommodate the new\nneeds of the disabled population (e.g. the need for individual care-takers, medical care\nand medicines).\nIt is proven that reducing the stigma associated with AIDS is a means of\nestablishing a more controlled environment of the disease. When people feel free to\nvoice their struggles with the virus, it causes greater awareness of the gravity of the\ndisease and thus more attention to the preventative measures that can be taken. In order\nto decrease the stigma associated with the disease, there needs to be adequate care\naccessible to those who are currently living with the disease such that they are not\ndeemed a burden of society and disrespected. A means of extending this controlled\nenvironment would be to heighten public awareness of the importance and right to\npersonal HIV/AIDS status notification.\nUnfortunately, a lack of funding is only one of many barriers that will make the\nimplementation of mandatory pre-nuptial testing a hard procedure to implement. As it\nstands now, within marriage, the couple is not given the right to know what the\nimplications for childbirth and future personal health and standard of living will be unless\nthe state demands it. Therefore, there is no reason to delay creating this policy as it\ndemonstrates the state's commitment of a serious effort towards combating HIV/AIDS.\n\nA substantial impediment towards AID/HIV prevention occurs due to a lack of\nhuman rights1. If women are forced into marriage by default based upon the sparse\n\n1 A recent highlight on women's rights and a conservative religious organization:\n\nZIMBABWE: Apostolic Faith churches act to prevent spread of HIV/AIDS\n09 May 2005 18:16:20 GMT\nSource: IRIN\n\n\"JOHANNESBURG, 9 May (IRIN) -\n\neconomic opportunities for any form of self-sustainability, then she is indirectly\ncompletely vulnerable to contracting AIDS. At the same time, men must not be left out of\nthe picture2.\nIt is important that individuals believe they are not impotent in their ability to\nprevent their personal contraction of the disease. An apathetic attitude towards the\nrewards of safe-sex practices only breeds an unwillingness to engage in safe-sex. On the\nother hand, if people believe that the use of condoms/ other means of HIV/AIDS\nprevention will successfully prevent the spread of AIDS, there is a greater incentive\ntowards incorporating these practices in one's lifestyle.\n\n\"The leadership of Zimbabwe's Apostolic Faith (AF) movement, one of the most conservative\nchurches in the country, have embraced a new creed - that of AIDS prevention.\"\n\n\"In a bold move, church leaders recently appealed to the AIDS Policy Advocacy Project (APAP)\n\nfor assistance in developing an HIV/AIDS mitigation policy, which could see the overhaul of\n\ndeeply entrenched traditional practices. The APAP is supported by the Futures Group, an\n\ninternational AIDS NGO that targets faith-based organisations.\"\n\n\"We now know that upholding such traditions as polygamy, wife inheritance and forced marriages\n\nfor our daughters is killing us. We want to change these attitudes, and adopt policies that will save\n\nthe young and old members of all Apostolic Faiths, by letting them know which ones of our\n\npractices are exposing us to HIV/AIDS,\" an Apostolic Faith elder, Bishop Revai Chitanda, told\nIRIN\n.\"\n\n2 Reuters news brought out the important role that men play within the relationship and their limited\nknowledge of HIV/AIDS issues:\n\nZIMBABWE: Taking the anti-AIDS message to the men\n09 May 2005 13:06:20 GMT\nSource: IRIN, BULAWAYO, 9 May (IRIN) Reuters Foundation\n\n\"The preponderance of patrons are men, often overlooked in outreach programmes, which tend to\nfocus on women, who are most affected by HIV/AIDS. But MSF recognises the critical role men can\nplay in stemming the virus and has decided to go after this neglected 50 percent of the population.\n\"The reason why we are targeting men is that they are the ones who take the initiative in intimacy, and\nthey have the final word,\" said MSF Bulawayo spokesperson Fernanda Falero.\n\"We have come to realise that the best way to reach men is to go to where they are found most of the\ntime, and in numbers, and that is in bars and beer halls. We have a team that we dispatch every\nweekend to visit drinking places and talk to them on how they can play a meaningful role in fighting\nHIV/AIDS,\" Falero said.\"\nShe noted that a recent MSF survey found that men's knowledge of AIDS-related issues was limited\ncompared to their spouses, who more often receive some kind of education and counseling when they\nvisit clinics during pregnancy or to have their children immunised.\"\n\nExtra-marital sex is an important factor to consider as it introduces changes in the\nHIV/AIDS status of married couples and therefore a spouse remains at risk of contracting\nthe disease if his or her partner is not monogamous. Because of a dormant period of the\nvirus that can cause false-negative HIV-test results and the possibility of extramarital\nsexual interaction with HIV-positive partners, the HIV/AIDs status of couples is\nsusceptible to change even after marriage. Because of a lack of economic means\nwidespread among women, the state should implement an affirmative-action based policy\nthat provides women with the funding to have their partner tested for the virus. If the\nwomen herself desires an HIV test for her partner, it stands to reason that she is\nconcerned that she may contract the disease herself. (If she is already aware that she is\nHIV positive, she should know of the risks involved in giving birth.)\nIn creating this policy, the following is a potential risk that must be considered\ndue to the pervasive gender discrimination. Because infidelity is grounds for divorce, if,\nafter marriage, a spouse is tested and found to be HIV-positive, this could be used as an\nexcuse to divorce one's current partner even if the infidelity falls on the part of divorcer.\nThere is no way to tell who contracted HIV first, and because widows are vulnerable,\neconomic burdens on the state, there should be some means to prevent this event from\noccurring. Perhaps this means that post-marriage HIV-test results remain private (not\ndisclosed unwillingly to spouse).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Policies in Institution (Companies, Civil, Religious and Health)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/6647d1b3364af7a1e4e78f7a930637e9_MITES_253S05_ato_ulzen.pdf",
      "content": "Ato Ulzen-Appiah\nPolicies for Institutions\n\n(c) Produced for The Law Development Commission of Zambia\n\nZambians die earlier than people anywhere else in the world. 2 Hence, caring for\nthe young professionals in the country is crucial to its development and economy.\nUnemployment is at 50% and many of the employed are in civil institutions. In order to\nfight the HIV-AIDS epidemic which will eventually kill half of the population3,\ncompanies and civil institutions have to focus more attention and resources on halting\nand controlling the spread and effect of the disease.\n\nThis can be done through getting various companies and civil institutions to\neducate workers, sponsor healthcare and provide support for its employees. Below are\nsome guidelines as to how these goals can be met and the procedures carried out. HIV-\n\nAIDS education should be added to the training program for new hires and employees.\nThis should detail what HIV-AIDS is, dispel myths and superstitions about it, explain\nhow it is contracted and how it can be prevented, describe what testing entails and what\nto do when one contracts the virus as well as the availability of testing. The education\nsegment should also stress ethics and how to treat other employees who may have\ncontracted AIDS in the workplace\n\nOn the financial side, the institutions should sponsor free testing for workers.\nOtherwise, it should subsidize it. Above all, it should encourage its employees to get\ntested. It should also provide condoms for free or at subsidized prices. They should also\nsponsor HIV-AIDS and marriage counseling at the workplace. The companies and civil\ninstitutions should also provide access to anti-retroviral drugs (ARVs) that attack the\nvirus and can dramatically reduce AIDS deaths.\n\nMore than 80% of Zambia's population consider themselves religious. A lot of\nZambians are unemployed or are self-employed so it is very important to reach them\noutside the workplace. Most of these people commit to their religions and are influenced\nby their leaders and messages. Religious settings are strategic places to continue the fight\nagainst HIV-AIDS. These institutions mostly preach good morality and behavior and\nsometimes lose sight of the need to fight the AIDS menace in other ways.\n\nIn nearby Zimbabwe, former president Kenneth Kaunda, championed condom use\nin the fight against AIDS and came under harsh criticisms from religious bodies. Kaunda\nhad lost his own son to the AIDS disease. He challenged the religious bodies to join the\nstate in controlling the AIDS disease by saying that he knew of religious leaders who had\ndie to AIDS.\n\nReligious bodies, especially churches advocate for the first letter of the ABC\ncampaign (concept) in fighting AIDS: Abstinence, Be faithful and Condomise. It is\ncritical for them to achieve a healthy balance of using the various methods to fight AIDS.\n\nThe following are a few ways religious groups can help fight the AIDS epidemic.\nThey should encourage voluntary testing for HIV-AIDS. They should also discourage\nstigmatization in religious settings. The church, mosques, etc should ensure that people\nwith HIV-AIDS should not be treated as criminals and treated fairly. They should also\nsponsor free testing or subsidize it.\n\nReligious bodies should encourage voluntary testing by giving incentives for\nthose who get tested. Badges, free religious material, or acknowledgment could be used\nas incentives.\n\nYouth groups in religious settings also have major roles to play in helping stem\nthe spread of HIV-AIDS. Using the youth to preach the tenets of AIDS education is\nimportant, since many of the youth are affected and they would be able to influence their\ncolleagues. They can organize rallies on HIV-AIDS and health-related issues to enlighten\nand educate members and other people in the religious group.\n\nMost youth groups do a lot of entertainment related programs in religious settings.\nThey should use their talents to perform theatrical pieces on HIV-AIDS and sing\ncomposed songs (through choirs as well) to educate members about the AIDS menace.\nThey should also educate various age groups on sex education (using the ABC concept)\nto help stem the contraction of the virus.\n\nThe religious groups should also organize contests to encourage composing songs\nand writing letters/essays to help in the fight against HIV-AIDS and honoring excellent\ncontributions. In their education campaign, they can hold seminars and discussions to talk\nabout HIV-AIDS, the condoms debate, stigmatization etc. Pastors and religious leaders\nshould not shy away from talking about HIV-AIDS in their sermons since religious\ngroups are not any significantly less vulnerable to the menace. They should use their\ninfluence and power to preach abstinence, faithfulness to partners and advocate condom\nuse for marriage couples. They should encourage and be encouraged to attend inter-faith\nconferences (with and without chiefs and politicians) to discuss and come to a working\nconsensus about moral issues and legislation.\n\nThey should provide access to anti-retroviral drugs (ARVs) that attack the virus\nand can dramatically reduce AIDS deaths. They should also make condoms available\nfreely to sexually active church members. Clinics, hospitals and healthcare institutions\nare major proponents in the fight against the HIV-AIDS menace. They should sponsor\nand provide free testing and free condoms as well as provide access to anti-retroviral\ndrugs (ARVs) that attack the virus and can dramatically reduce AIDS deaths.\n\nHealth professionals should provide education and support programs. They should\nalso encourage other institutions like churches, mosques, schools and companies to\nintroduce, continue and maintain their education programs about sex and AIDS. Since\nthey are mostly at the forefront of controlling the disease, they should make sex\neducation and HIV-AIDS compulsory before testing. They should also provide free\ncounseling/support for those who test positive.\n\nFor marriage counseling/advice, they should provide advice for women and men\ncaught in marriages with partners who are HIV positive. Partners should be educated\nabout mother-to-child transmission and child-bearing with infected parents. Healthcare\ninstitutions should institute women empowerment programs along with pro-woman\ncounseling/campaigns.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Policies in Schools",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/59641bbca3f8e22e055939388428abe6_MITES_253S05_shima_goswami.pdf",
      "content": "Shima Goswami\nPolicies for Schools\n\n(c) Produced for The Law Development Commission of Zambia\n\nSince the HIV/AIDS epidemic struck Zambia, the projected life expectancy has\ndropped from 60 years to a tragic 37 years1. Now with more than half of the 10.3 million\npersons population under the age of 201, it is absolutely crucial to make every effort to\nend this horrible epidemic. Working with such a young population makes it absolutely\nmandatory to focus on the issue of education. It will be the simplest and most effective\nmeans of teaching a nation how to help itself.\n\n1 UNAIDS. Zambia. 3 May 2005 <http://www.unaids.org/en/default.asp>\n\nBelow are some general guidelines on how to approach revamping the\neducational system such that HIV/AIDS is a critical aspect. Generally speaking, the\nmajor issues that need to be addressed can be summarized as including awareness,\nprevention, testing, and social treatment of those afflicted.\n\nIt is easiest to split the system into three levels: primary school, secondary school, and\nuniversity. Each of these groups should have a formal system to counteract the problem\nof HIV/AIDS, but require different approaches because of the students' age,\ncomprehension, knowledge, experience, and activities outside of the institution.\n\nAt the levels of primary and secondary school, the basic concept of education should\ncome in the form of seminars that will be given regularly throughout every year of\nschooling to attack the general themes stated above. The curriculum for students between\nfirst and sixth grades should include teaching children a general awareness that\nHIV/AIDS exists all around them and is a problem. They should also be taught how to\ninteract with those people who are afflicted or are associated with someone who is\nafflicted. A general courtesy should be developed so as to foster acceptance instead of\nperpetuating the stigmatization that currently pervades the atmosphere.\n\nAs the children get older, it is important that they get more information. By sixth\ngrade, right before they begin secondary school, they are becoming mature enough to\nlearn how the disease is contracted. At this point they should be learning about AIDS in\ngreater detail and means of contraction. Since they are technically old enough to start\nhaving sex but probably still a little too young and immature to handle it, this is a good\ntime to preach abstinence. That way, when they begin attending secondary school they\nare not so sheltered as to not understand what it is that the older children are doing, but\nthey are aware of their surroundings and have solid reasons why they should choose\nabstinence until they are ready.\n\nUpon reaching secondary school, the seminars should add on to what the children\nwere taught in primary school. The curricula should teach students what AIDS is, how it\nis contracted, how one can prevent spreading of the disease, where one can get tested,\nwhat testing entails, what one should do if he/she finds out that he/she is HIV positive,\nand how one should treat a person who is afflicted. More or less, the answers to these\nquestions should both provide knowledge about the disease, how to prevent it, and how to\ncope with it (either having it or dealing with those who have it), as well as alleviate any\nfears associated with getting tested\n\nAt the end of secondary school, each school should administer a test about the\nvirus, contraction, prevention, and testing. Passing this exam should be made a\nmandatory requirement for graduation. This plan should add pressure to each school to\nteach its students about the disease and emphasize the value of learning about AIDS to\nthe students. At the very least this measure will ensure awareness among all students and\nfaculty, which is at least a step in the right direction.\n\nAlong the way, the curriculum should include some or all of the following\nmethods for informing students about HIV/AIDS. The school can show documentaries\nthat describe AIDS so that it provides both information as well as a sense of reality that is\nintended to induce some fear as a means of preventing unprotected sex.\n\nThe school should also encourage speakers of various sorts to come to the school\nto discuss various aspects on AIDS. A variety of different speakers, including but not\nlimited to young people who are already afflicted, health professionals, entertainment\ncelebrities, and politicians, is essential to try to target the entire audience.\n\nBringing in young speakers who carry the virus is crucial because peers have the\nmost direct influence on each other and it will be more relevant and have a greater impact\nthan if someone older came in to speak. A feeling of this could happen to me is one of the\nstrongest weapons of prevention and is most easily conveyed when the speaker has things\nin common with his listener, in this case age.\n\nHealth professionals (i.e. nurses, doctors, people who administer HIV tests, etc)\ncan shed a slightly more scientific/medical perspective that should explain the disease in\na different light and have better statistical information for students. It will also make\napproaching health professionals and getting tested more familiar, comfortable, and less\nfrightening.\n\nAn important resource to tap for influential power/role models is entertainment\ncelebrities. This approach will try to excite the students to attend these speeches, reach as\nmany students as possible, as well as expand the freedom to openly discuss topics about\nAIDS.\n\nFinally, the concept of bringing in politicians has multiple aims. There is the\ngeneral idea of bringing in different types of speakers, the more speakers the better and\npoliticians are also seen as influential people. However, there is another reason for having\npoliticians talk to older students in secondary school. One could believe that if students\nstart learning about the possibilities of governmental influence on issues such as\nHIV/AIDS that affect them in an interactive way, it will more likely lead to greater voting\nparticipation among a younger age group. This would be advantageous for the students\ntrying to voice their opinions as well as the politicians and the government.\nBesides speakers, schools could also implement extracurricular activities (i.e.\nAIDS clubs) that invite students to try to take a more active role in the fight against AIDS\nby discussing it more freely in open spaces, advertising events, and educating others.\n\nOther activities would include organizing events/performances (i.e. plays) that\nadvocate safe and courteous practices that are related to AIDS. There should also be a\ngreat importance placed on the focus of advocating testing among students. Schools\nshould encourage students to get tested by providing free testing that can be subsidized\nby the government/school system. Another method of encouragement is to offer students\na symbol of pride (i.e. red bracelets) for getting tested.\n\nThese material symbols would be a one-day-wear much like wearing a pin the day\none donates blood. Such an action would make it more widely accepted, regarded as a\npositive thing for those who do get tested, not frowned down upon for those who do not\nget tested. It should also encourage fellow peers that the process of getting tested is not\nfrightening. It is also possible to require students to get tested either periodically or at\nleast once right before they complete their schooling in order to get their diploma. This\nlast point is merely one suggestion that would force the issue upon students, but we feel\nis rather invasive and touches on several issues of privacy and individuality.\n\nAt the university level, many of the same plans of action would be suggested, but\nwith the idea of actually targeting the age group the institution is working with. In this\nrespect, there would not be an emphasis on preaching abstinence but on prevention,\ngetting tested, and being open to discussing it in public forums and with one s sexual\npartners. As with secondary schools, speakers, event/performances, and seminars are\nencouraged. However these should all be made voluntary and perhaps have more casual\nget-togethers / meetings that open up discussion by treating these students as mature\nyoung adults. Testing should again be highly promoted and made free for all students.\nOne additional step that should be implemented is the free distribution of condoms,\nplacing them in public places throughout campus so that students are knowledgeable\nabout where they are and how they can get them whenever they may need one.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "stephen_weiner.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/609823c5a68c9af0dfc6f8bd60b46203_stephen_weiner.pdf",
      "content": "Stephen Weiner\nPrivacy Policy\n\n(c) Produced for The Law Development Commission of Zambia\n\nThe issue of setting the appropriate level of privacy concerning AIDS in Africa is\na controversial subject because the level of privacy most respecting people's rights may\nnot be the most beneficial for the AIDS problem. Determining a compromise between\nthese two sides; complete public and governmental disclosure of every person with AIDS\nor no personal disclosure forced or otherwise required, is difficult because there are many\nthings such as discrimination from employers and community that must be considered.\n\nThe American solution to the problem of AIDS discrimination has been to lump\nAIDS in with the list of disabilities protected under the Disabilities Act. Employers,\n\nschools, and communities have no right to know that a person has AIDS or is HIV\npositive. They can not base their decisions of employment or acceptance on whether or\nnot a person is infected. The situation is America is very different from the one in Africa,\nparticularly Zambia, though. Americans have access to many successful forms of\ntreatment of AIDS, essentially being able to keep their T-Cell count high enough to\nfunction normally for as long as they can afford to continue the cocktail of drugs that\nmust be taken daily. Americans with AIDS are able to enjoy the same freedoms that non-\ninfected people are. In Zambia, most do not have access to intensive anti-retroviral\ntreatment and they are much more likely to become seriously ill through AIDS. General\nnutrition is much worse and there is little health care infrastructure. In this setting, is\ndisclosure of one's AIDS status something that should be known? In America, the law\nhas prevented serious discrimination by disallowing disclosure. Currently in Zambia,\nthere is no law forcing testing or protecting people's information about their condition.\nThe situation is laissez-faire, but would forced testing and disclosure of information\nbenefit the fight against AIDS? This paper explores some of the issues associated with\nthis question.\n\nWould an employer discriminate against a job applicant if he knew that that\nperson had AIDS? The easy answer is that without any sort of incentive, he or she would\ndiscriminate. Choosing between two equally skilled applicants, one with AIDS and one\nwithout, it is easy for an employer to think that a person with AIDS would not be able to\ndo his or her job as well as one without AIDS. This is not the case, as evidenced in the\nU.S. With the appropriate treatment, one can be a successful worker without incidence.\nWithout hiring these workers, those with AIDS may not be able to purchase the\nexpensive treatments, allowing them to be healthy enough to work. Clearly this is a\ncircular process, get a job to stay healthy and keep a job. The employers must be blind\nwhen hiring so they allow those with AIDS to enter this cycle. There will be some cases\nwhere an employer hires a person with AIDS and that person in turn becomes sick and\nmust leave his job. This is inevitable and will probably cause a marginal increase in\noverall cost for an employer who has to rehire and retrain an employee. In the long run\nthough, blind hiring will be better for Zambian economy because as people stay healthy\nand retain their productivity they will be adding to the GDP and economic assets that\nZambia offers as a country. Zambia needs to learn to be productive while still shackled\nby AIDS, because this will in turn, help remove AIDS from Zambia. It can start on this\npath by making sure that those with AIDS have a place in the Zambian economy. A\nsystem of quotas will not be necessary to ensure a spot, if hiring is blind. Further, quotas\nwill only increase discrimination towards those with AIDS, and prevent the ingraining of\npositive attitudes towards AIDS.\n\nIf employers do not get to know, then who does? We believe that no one should\nhave to reveal whether or not they have AIDS. This includes the government, employers,\nschools, and communities. Risk of a transfer of AIDS from person to person, without\nsexual contact, is amazingly low. The virus is not airborne and as long as minimal safety\nprocedures are followed, a person with AIDS should not be prohibited from doing\nanything. This includes contact sports and other activities often deemed risky, which in\nreality present little risk. School and schoolmates should not know that a student has\n\nAIDS unless there is a potentially dangerous situation such as a blood drive, in which\nstudents might have to be tested or refrain from donating blood.\n\nThe situation with school acceptances is not that different from the situation\nconcerning jobs above. There should be no discrimination concerning admittance or\nacceptance to a particular school or classroom because there is miniscule potential for\nspread of the virus. The student with AIDS should decide whether or not they want to\nsubject themselves to the rigors of schooling.\n\nFinally, should marriage partners be forced to share their HIV status with each\nother? Again, the proper course of action should be to educate each other to make sure\nthat government intervention is not necessary here. People need to realize through\neducation that if both partners do not have AIDS then perhaps the two should reevaluate\ntheir union. This information, and all of AIDS information, should be passed down from\nmother to daughter and father to son. Families should make AIDS education part of their\nfamily discussions. Marriage is certainly a family affair so it makes sense for families to\ntalk about AIDS awareness as well.\n\nFinally, not being forced to share information would avoid issues where revealing\nHIV status could be emotionally painful such as in the case of a rape. A rape could be a\ntraumatic event for a person and information one might not want to share. In the same\nway that one might discriminate against an HIV positive person, one might discriminate\nagainst a rape victim. For these reasons, as well as the ones stated above, there should be\nno disclosure.\n\nOverall, this committee determined that government enforcement of testing and\nsharing of test information should not be required. Knowing whether or not someone has\nAIDS will only achieve limited gains in the fight against AIDS. More effort needs to be\nplaced on the prevention of the spread, rather than the identification of those already\ninfected. Not only will the gains from identification be marginal but they will also be\nunethical. A person should not have to reveal a disability such as AIDS if they feel it will\ndisadvantage them in certain settings, such as job employment. Clearly some areas of\nsociety should require information about someone's HIV status but this sharing of\ninformation should always be voluntary and not used as a means for discrimination.\nFurther, this information should not be shared with other government or public agencies."
    },
    {
      "category": "Resource",
      "title": "tufool_nuaimi.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/a7e84abda2f27c9955b447663a879ba4_tufool_nuaimi.pdf",
      "content": "Tufool Al-Nuaimi\nPolicies for the Media\n\n(c) Produced for The Law Development Commission of Zambia\n\nPopular local media can be used, in various ways discussed below, to increase\nAIDS awareness in Zambia. Different methods should be used to target different groups\nincluding youth, adults, elderly, schoolchildren, workers, chiefs, politicians, celebrities,\nwomen and religious and cultural groups.\n\nWithin each town, the chief should receive regular updates, through newspapers\nand should be available for individual meetings with locals in order to discuss AIDS-\nrelated issues, like current statistics, recent discrimination against people with AIDS and\nopinions and recommendations from people on AIDS education within the region. The\ntown chief should then take time, during town meetings, to summarize these issues and\nbe ready to discuss them. These meetings will help increase local awareness of current\nAIDS issues.\n\nAwareness can be further increased in town meetings and community centers\nthrough invitations to qualified personnel, like doctors and nurses, to address the\ncommunity. These presentations should include regular education on AIDS, the ways it is\ntransmitted, prevention, and how to deal with people with AIDS and help them integrate\nwithin the community to decrease discrimination. A Question and Answer session should\nfollow the presentations in order to ensure that questions people are unsure about are\nclarified.\n\nA survey within these meetings, with questions on what should be differently,\nshould be handed out to the public on a regular basis. This will help identify problems\nwith current meetings and would help improve them during future meetings. Television\nshows, advertisements and an educational television series can be used to increase\nawareness amongst viewers.\n\nThese shows and advertisements should be different for different audiences. On\nchildren's television channels, advertisement should be suitable for younger viewers, in a\nsimilar fashion to school education, where issues like abstinence should be shown. For\nolder viewers, shows and advertisements should talk about measures of AIDS prevention,\nand condom use for safer sex. In addition, there should also be advertisements that\neducate people on how AIDS is transmitted and how deal with people with AIDS.\nSimilar methods to the ones discussed in shows and advertisements should be included in\nmovie and concert previews.\n\nBecause of some restrictions within society, some women are unable to refuse sex\nwith their husbands regardless of their knowledge of a husband s multiple partners; a\nmorning talk show should be created for women. These talk shows should help women\nchange their attitudes and behaviors into understanding that they are able to refuse having\nsex with their husbands if they suspect them of having multiple partners. These talk\nshows should include a toll-free number, to address concerns during the show. This will\nhelp because if women see that there are others in their situation who are willing to\nchange, it will be easier for them to change their attitudes also. Other educational talk\nshows, on TV and the radio shows, aimed to all groups, should be added to increase\nawareness amongst viewers and listeners.\nAdvertisements and talk shows should include celebrities who talk about AIDS,\nsince many people may feel that they can associate to them. Community centers should\ninclude various AIDS awareness events. This can include short skits that educate people\non AIDS, presentations that talk about AIDS, and concerts where the performer can take\na few minutes to address the AIDS situation and maybe even sing a song on AIDS.\nCompetitions can be created within schools, universities and community centers.\n\nThese competitions can be in the form of presentation on AIDS or responses to\nquestions asked by a panel of judges. The judges should be people that are qualified and\nexperts on AIDS, such as teachers, doctors and nurses. These competitions should be\nfree, and advertised in newspapers, flyers, TV and billboards so that as many people\n\npossible can view it. At the end of the presentation, the judges will award the winner with\na prize. Newspapers should include weekly educational columns, which talk about AIDS.\n\nAlthough some of it may appear repetitive, this is necessary in order to ensure that\nit better educates increasing amounts of people. The column should also include recent\nstatistics on AIDS, and personal stories that may be published anonymously if the writer\ndesires. Personal stories could be of living with AIDS and also of people discriminated\nbecause of this. Including where, why and how they are discriminated should also be\nincluded because by making this information available to the public, discrimination\nwould lessen.\n\nSimilar stories and AIDS awareness articles could be handed out as fliers outside\nschools, universities churches, companies, community centers, shopping centers and\nother organizations.\n\nBillboards and fliers should be used to advertise local AIDS related events. By\ndistributing this widely, we would be able to ensure that more people would attend these\nevents, and more people would be educated on AIDS."
    },
    {
      "category": "Resource",
      "title": "Workplace Discrimination",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-253-aids-and-poverty-in-africa-spring-2005/c7c3a3da1e2dcda6f8abab1ca4911dce_MITES_253S05_samuel_curtis.pdf",
      "content": "Samuel Gikandi and Curtis Vaderpiuje\nWorkplace Discrimination\n\n(c) Produced for The Law Development Commission of Zambia\n\n1. Introduction\n\nThis paper will act as a guideline for companies on dealing with workers that are\nliving with HIV/AIDS. The goal of the paper is to help formulate legislation that will\nguard the rights of these people and enhance their experience as they deal with the\ndisease.\n\nThe need for a policy on HIV/AIDS at the workplace cannot be over emphasized.\nWorkers living with the disease are continuously disenfranchised and they need legal\nprotection at the workplace to enable them lead normal lives while coping with the\n\ndisease. A workplace policy also provides the framework to contain and manage the\nspread of the disease and its impact in the workplace.\n\nThe main goals of the policy will include:\n-\nMaking an explicit commitment for corporate action to curb the scourge\n-\nProvide guidance to managers on how to deal with workers that are affected by\nthe disease.\n-\nHelp those infected with the disease understand their rights and what support\nsystems are in place to help them live with the disease at their workplace.\n-\nEnable the management of prevention programs that limit the spread of the\ndisease.\n-\nEnhance a consistent and efficient way of managing the disease and its impact.\n-\nProvide incentives for workers to undergo testing and publicly divulge\ninformation about their status to others at the workplace, and hence curb the\nspread of the disease amongst co-workers.\n\n2. Specific Provisions\nThe main areas covered by the policy can be grouped into three broad categories:\n- Protection of the rights of those affected by HIV/AIDS.\n- Prevention through information, education and training.\n- Care and support of affected workers and their families\n\n2.1 Stigma, discrimination and rights\n\nAn individuals HIV status should not affect his/her rights in any way. This is\nbecause stigma and discrimination will affect the working environment. The following\nguidelines should be followed regarding this issue:\n\n2.1.1 Rights of employees who are HIV Positive\n\nThe fact that a worker has HIV should not impede on is/her personal rights. This\nknowledge shall also not be used to single out and discriminate workers.\n\n2.1.2 Employment opportunities and termination of employment\n\nA company shall not hire employees differently based on their HIV status. The\ncompany shall also not terminate the employment of a specific worker based on the\nworker's HIV status.\n\n2.1.3 Testing\n\nThe company shall not require HIV status testing for any of its opportunities.\nNonetheless, workers will be continuously encouraged to use HIV testing facilities and\nencourages confidential HIV status testing and counseling for its employees.\n\n2.1.4 Confidentiality\n\nThe company should recognize and respect every employee's right to his/her\nconfidentiality regarding their HIV status. If the management learns of an employee's\nHIV status, such information should be treated discreetly by the management. However,\n\nthe company will encourage employees who are willing to do so to voluntary make\npublic their HIV status.\n\n3. Awareness Raising and education\nEducation is among the most effective approaches that should be used in the fight\nagainst HIV/AIDS. Despite the efforts of education outside the workplace, it is\nimperative that the workplace bolsters the campaign against HIV through various\nprograms at the workplace.\n\nThe education programs should be conducted to not only teach the employees about\nHIV/AIDS, but should fully encompass responsible behavioral patterns, the attitudes\nexpected of the employees not just at the workplace but outside the workplace. The\nprograms should treat the HIV/AIDS pandemic from a top-down approach as a problem\naffecting the entire society and not simply the workplace. This should lead to very\nresponsible behavior and changes in attitudes for the good of all.\n\nAn effective approach to take in creating awareness and educating employees is to\ninclude the employees in the HIV/AIDS education programs. By include, this refers to\nseeking the involvement of the employees in the creation, evaluation and running of the\nprograms. This should lead to a comprehensive program that is very well suited for the\ncompany as the employees will include their personal experiences and views based on the\nexisting dynamics at the company. For instance, employees can be peer evaluators,\npresenters or teachers and incorporate personal anecdotes from their communities. This\nshould tailor the program effectively for the company as the employees can identify with\nthe teaching methods.\n\nThe training programs at the workplace can be made optional to employees. It should\nbe encouraged rather than forced and shown as the responsible thing to do. Incentives\nsuch as time off, paid vacations or even free lunches can be used as perks to encourage\nthe employees to attend. Also by involving the staff at the workplace in the training\nprograms, they can encourage each other to attend the sessions and make it semi-formal,\nfun and a relaxing break from the usual activities of work. If this form of training is too\ninformal, special sessions can be held for higher management or even low level staff.\nEveryone at the workplace under a company's payroll should be encouraged to\nparticipate in the HIV/AIDS awareness programs.\n\nIn addition to the educational programs, the company should facilitate access to\nresources that prevent or help treat employees with HIV/AIDS. The company should\ncertainly distribute both male and female condoms freely to employees. These should be\nmade available regularly and easily accessible to the employees. The company should\nalso provide some funding for testing and treatment of STIs and HIV/AIDS depending on\nthe resources at its disposal. These changes should improve the behavioral patterns\namong the employees.\n\n4. Care and Support for workers and their families\n\nThe company should institute measures to ensure that workers afflicted with the\ndisease remain productive for as long as possible. The company should put in place\nmeasures to support those affected by its employees HIV status information, such as the\nimmediate family. Some of the areas that legislation can cover include:\n\n4.1 The promotion of an employee's well being\n\nThe company should provide a conducive environment for employees that are\naffected by the disease, including appropriate support services and programs that are\naimed at helping individuals cope with the disease. This should include measures such as\ncounseling, time off and sick leaves.\n\n4.2 Work performance and reasonable accommodation\n\nThe company should not user HIV positive status as an excuse for dismissing the\nworker as incompetent in their work, unless the status is likely to endanger the clients\nsuch as in a hospital. The company should make reasonable accommodations for diseased\nworkers and assess their performance as they would that of other employees. Dismissals\nshould only be used where the workers state of health has deteriorated to the condition\nwhere the worker can no longer discharge his/her duties effectively, a point that should\nbe independent of the worker's HIV status.\n\n4.3 Benefits\n\nThe HIV status of an employee should not be used to deny him/her benefits that\nare normally available to other employees.\n\n4.4 Healthcare\n\nThe company should make the best effort to avail the most comprehensive\nmedical coverage for employees living with HIV/AIDS, including access to ARV's,\ntesting facilities and counseling facilities. The company should also aim at making these\nfacilities available to the dependents of those living with the disease.\n\n5. Implementation and monitoring\nCompanies should create a committee (or a position for a smaller company) to take\ncharge of the HIV/AIDS awareness campaign at the workplace. This committee should\nbe taken very seriously and should meet regularly with higher management to report\nprogress or shortcomings of the program. The committee should include employees from\nall levels of hierarchy within the company from upper management to low level\npersonnel so as to effectively deal with all issues for the entire demography of the\ncompany.\n\nThe HIV/AIDS awareness program should be continually evaluated. Surveys should\nbe given out to employees on a regular basis that should be set by the committee. These\nsurveys can include behavioral questions, attitudes about HIV/AIDS, knowledge about\nHIV/AIDS and others that are relevant to the company. The employees taking the survey\nshould be assured of strict confidentiality to ensure that they provide accurate and truthful\ninformation. It can even be made anonymous and given after training programs. The\nresults of these surveys would enable the training team to better focus the\n\nseminars/lectures and the entire program as a whole to cater for the needs of the\nemployees at the company. Also these would ensure that the committee presents accurate\ninformation to higher management about the awareness program to ensure that requisite\nadjustments to the program are made in a timely fashion.\n\nThis policy on HIV/AIDS should be revised yearly. This should be done\ncollaboratively with employees, the committee and higher management. The changes\nshould reflect the changes in the community and the immediate and extended\nenvironment outside the company. The changes should also reflect the changes in the\ncountry and the world as a whole. Most importantly, the changes should incorporate the\nfeedback received from the employees about the program in order to improve the training\nprogram for the following year.\n\n6. Budgets and Finance\nCompanies should incorporate the HIV/AIDS awareness campaign in their budgets.\nMost of the training programs can use resources that the companies have already\nacquired. Additional resources usually cost only minimal amounts. However, for\nprograms that give medical support to employees for testing or treatment, companies can\nconsult the government or many NGOs including the Global Fund to fight AIDS, UN\nTheme Group on HIV/AIDS or UNAIDS. These resources usually go beyond financial\nsupport and include technical support as well. Most large companies can usually be self\nsufficient but for the smaller companies, an effective approach for using the resources\nmentioned could be through the establishment of associations. This way, several small\ncompanies can collaboratively work to utilize the numerous resources available for the\nfight of this deadly pandemic.\n\n7. Conclusion\nThe main focus of the policies outlined above is to ensure that a worker's HIV status\ndoes not impede his/her treatment at the workplace. This is a different approach as\nopposed to making provisions that treat HIV/AIDS afflicted workers as special cases, and\nit helps eliminate the stigma that such an approach might foster.\n\nMaking the recommended provisions at the workplace would also encourage\nworkers to be more proactive in seeking information about their HIV status, as they\nwould be attracted by the benefits in place at the company that support those with the\ndisease and the existence of an environment that encourages their treatment as normal\nemployees. We believe that this in particular will be crucial in managing the spread of the\ndisease at the workplace, and encourage those carrying the disease to be more\nresponsible.\n\nReference\n\n1. ILOAIDS, a workplace policy on HIV/AIDS: what it should cover, www.ilo.org/aids\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.253 AIDS and Poverty in Africa\nSpring 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}