{
  "course_name": "American Literature",
  "course_description": "This course studies the national literature of the United States since the early 19th century. It considers a range of texts - including, novels, essays, and poetry - and their efforts to define the notion of American identity. Readings usually include works by such authors as Nathaniel Hawthorne, Henry David Thoreau, Frederick Douglass, Emily Dickinson, and Toni Morrison.",
  "topics": [
    "Humanities",
    "Literature",
    "American Literature",
    "Classics",
    "Humanities",
    "Literature",
    "American Literature",
    "Classics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nClass Description\n\nThis is a\nHASS-CI\nclass. Like other communications-intensive classes in the humanities, arts, and social sciences, it allows students to produce 20 pages (5000 words) of polished writing with careful attention to revision. It also offers substantial opportunities for oral expression, through presentations of written work, student-led discussion, and class participation. The class has a low enrollment that ensures maximum attention to student writing and opportunity for oral expression.\n\nThis class surveys the American narrative about itself, focusing on such topics as: Myths of Origin, Declarations of Independence, Realism and Satire, and Rewriting History. Although we address a wide range of authors (Emerson, Hawthorne, Melville, Thoreau, Stowe, Whitman, Dickinson, Wharton, Hurston, among others), students also scrutinize certain core works in historical, biographical, and literary contexts: Mary Rowlandson's\nNarrative of the Captivity and Restoration\n, Frederick Douglass's\nNarrative\n, Mark Twain's\nThe Adventures of Huckleberry Finn\n, and Toni Morrison's\nJazz\n.\n\nRequired Texts\n\nBaym, Nina, Wayne Franklin, Philip F. Gura, et al. eds.\nThe Norton Anthology of American Literature\n. Shorter 7th ed. W. W. Norton & Company, 2007. ISBN: 9780393930573.\n\n[Morrison] = Morrison, Toni.\nJazz\n. Plume, 1993. ISBN: 9780452269651.\n\nReadings are in the\nNorton Anthology\n, unless otherwise noted.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nOrigins\n\nWilliam Bradford, Mary Rowlandson\n\nBenjamin Franklin, Washington Irving\n\nAnnotation studio workshop.\n\nLibrary research workshop\n\nEssay 1 writing workshop/groups. Bring rough drafts to class.\n\nEssay 1 due\n\nDeclarations of Independence\n\nRalph Waldo Emerson, Henry David Thoreau\n\nHenry David Thoreau\n\nRevision workshop\n\nNathaniel Hawthorne\n\nFrederick Douglass\n\nHarriet Beecher Stowe, Harriet Jacobs\n\nHerman Melville\n\nEssay 2 writing workshop/groups. Bring rough drafts to class.\n\nEssay 2 due\n\nWalt Whitman\n\nEmily Dickinson\n\nRealism and Satire\n\nSamuel Clemens\n\nSamuel Clemens (cont.)\n\nSamuel Clemens (cont.)\n\nSarah Orne Jewett, Kate Chopin, Charlotte Perkins Gilman\n\nHenry James, Edith Wharton\n\nEssay 3 writing workshop/groups. Bring rough drafts to class.\n\nEssay 3 due\n\nVision and Revision\n\nClaude McKay, Zora Neale Hurston, Langston Hughes, Countee Cullen, Richard Wright\n\n[Morrison] pp. 4-87\n\n[Morrison] pp. 89-162\n\n[Morrison] pp. 165-229\n\nConclusion\n\nEssay 4 due\n\nGrading\n\nThis course consists of both an oral component, which accounts for 25% of the grade, and a written component, which counts for 75%.\n\nACTIVITIES\n\nPERCENTAGES\n\nIn-class report\n\n10%\n\nClass attendance and participation\n\n15%\n\nFour 5-page essays\n\n60%\n\nOne revision\n\n15%\n\nImportant Things to Know\n\nEach student will be allowed 1 excused absence; an\nexcused\nabsence means that you have an urgent reason to miss class and have contacted me in advance. For any additional or unexcused absence your attendance grade will be reduced by one third of a grade. If you are having trouble meeting your requirements for attendance and participation, please see me at once.\n\nPapers must be submitted on the class website by\nmidnight\non the day that they are due. Class time that day will allow for writing workshops before you hand in your final draft. Come to class with draft in hand.\n\nPlease be sure to hand your papers in on time. Lateness will result in lower paper grades. For each day that your paper is late, your grade will be lowered by 1/3 (i.e. a B+ will become a B after one day, a B- after 2 days and so on. Weekends will be included).\n\nBecause of the writing-intensive nature of this course and the swift reading pace, extensions may be granted only in extreme situations (illness, family crisis, or other equally difficult circumstances). You will need to contact me at least 24 hours\nbefore\nthe paper is due in order to receive an extension.\n\nIntellectual integrity is imperative in all of our work. Plagiarism, co-opting of another's work, will not be tolerated in any class. This is the Literature Section's policy on plagiarism:\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom, including images and other media, must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the Writing and Communication Center, and the\nMIT Website on Plagiarism\n.\n\nThe Writing and Communication Center offers\nfree\nprofessional advice about oral presentations and about all types of academic, creative, and professional writing. The best way to guarantee an appointment is to schedule early!\n\nStudents with Disabilities that might affect their work, in or out of class, should check with me as soon as possible (privately after class or by email). MIT is committed to the principle of equal opportunity for students with disabilities with proper registration for accommodations.\n\nStudent Support Services (S3): If you are encountering academic difficulty of any kind, be sure to take advantage of the resources at S3. \"Student Support Services (S3) is designed to be a friendly and easily accessible hub of support. Whether you are having trouble with academic work for personal or medical reasons, you are considering taking time away from the Institute, or you just don't know who to talk to, we can help. A diverse staff welcomes conversations with students about their interests, and the challenges and dilemmas they encounter.\"\n\nResearch/Library Assistance: If you have library-related questions about research and resources, contact our liaison.",
  "files": [
    {
      "category": "Resource",
      "title": "21L.006 American Literature essay 1 worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-006-american-literature-spring-2013/e22fd1925cc45226ab76a871990548fc_MIT21L_006S13_researchwork.pdf",
      "content": "21L006 American Literature\nEssay 1 Worksheet\nTo prepare for the Research Workshop in the MIT Libraries on session 4, please complete the\nfollowing steps, which will be useful for planning your essay as well.\n1. Using your customary search procedures and research tools, locate 3-5 sources of\nmaterials for your topic.\n2. Make a bibliography of the sources you have found, using MLA Works Cited format .\n\n3. Locate the passage(s) in Mary Rowlandson's Sovereignty and Goodness of God that\nrelate to your topic. Using the Annotation Studio text, annotate your passage(s). You may\nadd comments, definitions, images, or links to your annotations.\n4. If you find that your topic is not yielding material for your essay, you may choose\nanother, as long as you stay within the field (historical, biographical, or textual context)\nthat you chose. Please let me know by email if you have chosen another topic. Then\ncomplete the steps above.\n5. In the research workshop you will work on your own research and also with other\nmembers of your research group to develop your materials.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.006 American Literature\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.006 American Literature essay signup",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-006-american-literature-spring-2013/13eb3b1927c4202fa45d6d8c23183bce_MIT21L_006S13_essaysignup.pdf",
      "content": "21L006 Spring 2013\nSignup for Essay 1--on Mary Rowlandson's Sovereignty and Goodness of God\nHistory Explained\n1. King Phillip's War (Places)\n2. American Captivity Narratives\n3. Guns and Money\n4. Puritan Church/Bible in Colonial America\n5. MR's Book as Bestseller\nBiography Explained\n1. Events of Mary Rowlandson's Life/Captivity\n2. Role of Ministers in the Making of MR's Book\n3. Marriage, Childbirth, or Domestic Life in Anglo-American Women's Lives\n4. MR as Woman Writer\n5. MR and Weetamoo Compared\nAnnotations: Language Explained\nBiblical Verses\n1. Psalms\n2. Isaiah/Prophets\n3. Job\n4. Exodus\n5. Other\n\n21L006 Spring 2013\nSignup for Essay 2--on Frederick Douglass's Narrative\n\nHistory Explained\n\n1. Plantation Slavery in Maryland in FD's Time\n\n2. Global Slavery in FD's Time (cf. Melville's \"Benito Cereno\")\n\n3. Slave Narrative in America\n\n4. Women in Slavery and/or Abolition\n\n5. Reception of FD's Book in America and Europe\n\nBiography Explained\n\n1. FD and Stowe\n\n2. FD and the Abolitionists (Garrison, Phillips)\n\n3. FD's Escape from Slavery\n\n4. FD's \"The Heroic Slave\"\n\n5. FD Photographed\n\nAnnotations: Language Explained\n\n1. Biblical Allusions or Echoes\n\n2. English Oratory and Rhetoric\n\n3. Oral Language, Culture, and Song\n\n4. Letters and Other Literate Texts Embedded in the Narrative\n\n5. Language of Names, Bodies\n\n21L006 Spring 2013\nSignup for Essay 3--on Mark Twain's The Adventures of Huckleberry Finn\nHistory Explained\n1. Late Nineteenth-Century Trends in Publishing\n2. Mississippi Steamboat Travel\n3. Early Education, the Rural Schoolroom\n4. Frontier Popular Culture: Shows, Circuses, Itinerant Preachers\n5. Reception of HF--Banned, Canonized, Bowdlerized\nBiography Explained\n1. The Writing of HF\n2. Twain as Performer\n3. Twain and Family\n4. Twain and Travel\n5. Twain's Other Works\nAnnotations: Language Explained\n1. Regional Dialect\n2. Classroom Rhetoric\n3. Religious Discourse\n4. Slave Dialect\n5. Literary References\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.006 American Literature\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.006 American Literature report guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-006-american-literature-spring-2013/0ac5d68d61be32135dc5071d1b7cfd3a_MIT21L_006S13_reportguide.pdf",
      "content": "21L006 Report Guidelines\n\n1. Research your topic, consulting a balance of print and online sources and drawing on the\nresources offered in the research workshop, the class library guide, and the library\nshelves.\n2. Select salient points and materials: facts and information, an image perhaps, a sample\npassage from the reading.\n3. Prepare a handout with copies for the class, no more than one sheet, presenting your\nmaterials in an organized, concise format (if you do not have access to a copier, send me\nyour file by 9:00 am on the day of your report). Give your talk a title.\n4. Include discussion questions for the class. Make sure these are questions the class can\nactually answer, given how little they will know about your topic.\n5. Provide a bibliography in correct MLA format at the end of your handout.\n6. Practice delivering your talk so that you're sure you can make your points in under ten\nminutes, can address the class directly without reading from and repeating the handout\nmaterials, and can hit the high points clearly and concisely.\n7. You will be graded on the effectiveness of your handout and oral delivery and on the\nusefulness of your report for engendering discussion and understanding of the day's\nreading.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.006 American Literature\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.006 American Literature report signup",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-006-american-literature-spring-2013/f93a9e58e6ad91ecef68714b779d03aa_MIT21L_006S13_reportsign.pdf",
      "content": "21L006 American Literature\nReport Signup\n\nPlease sign up for one author below (if more than one are assigned on a particular day, specify one that\nyou would prefer). No reports on days when essays are due.\n\nSession 9\nNathaniel Hawthorne pp. 589-643\nSession 10\nFrederick Douglass pp. 920-88\nSession 11\nHarriet Beecher Stowe pp. 764-99\nHarriet Jacobs pp. 804-25\nSession 12\nHerman Melville pp. 1118-74\nSession 14\nWalt Whitman pp. 991-1088, selections\nSession 15\nEmily Dickinson pp. 1197-1225, selections\nSession 16\nSamuel Clemens pp. 1270-1343\nSession 17\nSamuel Clemens pp. 1343-1410\nSession 18\nSamuel Clemens pp. 1410-63\nSession 19\nSarah Orne Jewett pp. 1590-98\nKate Chopin pp. 1602-19\nCharlotte Perkins Gilman pp. 1695-1719\nSession 20\nHenry James pp. 1532-79\nEdith Wharton pp. 1695-1719\nSession 22\nClaude McKay pp. 2044-47\nZora Neale Hurston pp. 2057-69\nLangston Hughes pp. 2263-71\nCountee Cullen pp. 2283-87\nRichard Wright pp. 2287-97\n\nSession 23\nToni Morrison pp. 4-87\nSession 24\nToni Morrison pp. 89-162\nSession 25\nToni Morrison pp. 165-229\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.006 American Literature\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}