{
  "course_name": "American Popular Music",
  "course_description": "This course surveys the development of popular music in the United States and in a cross-cultural milieu relative to the history and sociology of the last two hundred years. It examines the ethnic mixture that characterizes modern music, how it reflects many rich traditions and styles, and provides a background for understanding the musical vocabulary of current popular music styles.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music History",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nGeneral Information\n\nThis course is a history of pop music in America, starting with the minstrel era of the 1840s and continuing until the present. The survey of the more recent popular styles will result from student presentations. The trends in American popular music will be studied in relation to other cultural and historical events, but the focus will be on the music.\n\nListening is vital to this course. Initially, you should listen to each assignment before and after the class meeting. Then listen again (and again), in order to familiarize yourself with each piece. The class work, reading, essays, and final project will all center on the listening assignments.\n\nAssignments\n\nListening and Reading\n\nListening and reading assignments are listed in the\nReading and Listening\nsection.\n\nThe text for this class is:\n\nStarr, Larry, and Christopher Waterman.\nAmerican Popular Music: From Minstrelsy to MP3\n. 4th ed. Oxford University Press, 2014. ISBN: 9780199859115.\n\nThe majority of assigned readings will be taken from this text, with some additional readings. The recordings can also be found at your local public or university library.\n\nWhen preparing each assignment, I find starting with the music a more rewarding experience. Therefore, I suggest you start by listening to one of the assigned compositions, then read about the piece, composer, etc. in the text, taking notes about both the music and context. Next, listen again to the work and take notes on the musical characteristics.\n\nWritten\n\nYou will write three types of papers for this class: A short research essay, a final project paper, and listening outlines. See the\nAssignments\nsection for format guidelines and assignment details.\n\nResearch essay (4-6 pages) explores a topic in pop music before 1945. See page 6 for more details and a list of potential topics.\n\nListening outlines (1-2 pages). You will create two listening outlines to be shared with the rest of the class and to be part of a short, informal presentation.\n\nThe final project consists of two components. One is a written paper of 6-8 pages and the other is a more formal presentation on the ancestry of a work released within the last five years. In conjunction with this presentation, you will create a one-page handout. See the detailed\nassignment description\nfor more details.\n\nExams\n\nThere will be two exams. Each exam will cover the assigned listening and reading as well as material discussed in class. Exam 1 covers material from Sessions 1-10 and Exam 2 covers Sessions 11-22. Questions will feature excerpts from the assigned listening for identification, description, and comparison. Additional questions will deal with concepts (describing musical forms, historical significance, etc.) and terms.\n\nParticipation\n\nStudents are required to attend each class meeting and participate actively. In addition, all students will be asked to lead the discussions on specific pieces from the assigned listening.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\n2 exams\n\n10% each\n\nResearch essay\n\n20%\n\n2 listening guides and presentations\n\n10% each\n\nFinal project and presentation\n\n30%\n\nParticipation\n\n10%\n\nCourse Overview by Week Including Key Dates\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nI\n\nIntroduction and Themes of American Popular Music\n\nII\n\nNineteenth and Early Twentieth Century Popular Styles\n\nIII\n\nTin Pan Alley\n\nIV\n\nCountry Blues and Hillbilly Music\n\nV\n\nThe Swing Era and The Post-War Era, 1946-1954\n\nResearch Essay Due\n\nVI\n\nRock 'n' Roll\n\nExam 1\n\nVII\n\nBritish Invasion\n\nVIII\n\nAmerican Rock in the 60s\n\nIX\n\nThat 70s Music\n\nX\n\nOutside the Mainstream\n\nXI\n\nThe 1980s ... and Beyond\n\nXII\n\nPresentations on Final Project\n\nExam 2\n\nXII\n\nPresentations on Final Project (cont.)\n\nXIII\n\nPresentations on Final Project (cont.)",
  "files": [
    {
      "category": "Exam",
      "title": "Paper Template and Citation Format Examples",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-295-american-popular-music-fall-2014/4bae68cab5d12785c3bde33899dd5529_MIT21M_295F14_PaprTemplat.pdf",
      "content": "You name here\nMIT 21M235 Essay 1\n\nSeptember 1, 2014\n\nYour Title Here\n\n1) Text should be set in a serif type face such as this one (Baskerville), Times, or\nBookman, etc.\n\n2) The text should be in twelve-point type with double spacing between lines.\n\n3) A paper of six or fewer pages needs no extra title page or added blank pages. Staple\npages together in the upper left corner.\n\n4) Be sure to put a header or footer in smaller size that has your last name and the page\nnumber on all pages after the first.\n\n5) Quotation marks come after commas and periods: i.e., ... music,\" or ... music?\"\n\n6) Use italics for all non-generic titles of pieces.\n\nAve Maria, a motet by Josquin Desprez (1480s?)\n\nBartok's Concerto for Orchestra\n\nMozart's Piano Concerto No. 17 in G Major, Movement 1\n\nBeethoven's Symphony no. 3 in E-flat major (\"Eroica\")\n\nMozart's opera buffa, Cosi fan Tutte\n\nErlkonig by Franz Schubert, is a masterful song, written when he was 17! It is\nbased on\nthe poem \"Der Erlkonig,\" a ballad by Goethe published many years\nearlier.\n\n7) Proofread your paper! Have a friend read it or read it out loud to find any typos or\nawkwardly worded sentences.\n\n8) Citation Formats\nThe following examples are taken from Music in Words: A Guide to Researching and\nWriting about Music by Trevor Herbert and published in 2009 by Oxford University\nPress. Use these as a guide for your footnote and bibliographic citations.\n\nCDs and other recordings (generally used in bibliographies only):\nPalestrina, Giovanni. Mass: Hodie Christus natus est, Gabrieli Consort and Players, Paul\nMcCreesh, CD, Archiv Produktion, 437 833-2, 1993.\n\nFor recordings on Naxos or other websites substitute the file type for \"CD\" and give the\nWeb site and, in parenthesis, the date you accessed it.\n\nBooks and Musical Scores:\n+Footnote format (full):\nWolfgang Amadeus Mozart, Sonatas and Fantasies for the Piano, rev. ed., ed., Nathan\nBroder (Bryn Mawr, PA: Presser, 1960), 10.\n\n+Footnote format (short):\nMozart, Sonatas and Fantasies, 10.\n\n+Bibliographic format:\nMozart, Wolfgang Amadeus. Sonatas and Fantasies for the Piano. Rev. ed. Edited by\nNathan Broder. Bryn Mawr, PA: Presser, 1960.\n\nGrove Dictionary:\n+Footnote for print edition (full):\nDavid Evans, \"Memphis,\" in The New Grove Dictionary of Music and Musicians, 2nd ed.,\nedited by Stanley Sadie and John Tyrell (London: Macmillan, 2001), 17:811-813.\n\n+Footnote for print edition (short):\nEvans, \"Memphis,\" 17:811-813.\n\n+Footnote for online edition:\nDavid Evans, \"Memphis,\" in Grove Music Online, edited by Laura Macy,\nhttp://www.grovemusic.com (accessed September 2, 2007).\n\n+Bibliographic entry for print edition:\nEvans, David. \"Memphis.\" In The New Grove Dictionary of Music and Musicians, 2nd ed.,\nvol. 17. Edited by Stanley Sadie and John Tyrell. London: Macmillan, 2001.\n\nBibliographic entry for online edition:\nEvans, David. \"Memphis.\" In Grove Music Online. Edited by Laura Macy,\nhttp://www.grovemusic.com (accessed September 2, 2007).\n\nNB: Sources in which no controlling author is named should not be used.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.295 American Popular Music\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}