{
  "course_name": "American Classics",
  "course_description": "This subject is devoted to reading and discussing basic American historical texts that are often cited but often remain unread, understanding their meaning, and assessing their continuing significance in American culture. Since it is a “Communications Intensive” subject, 21H.105 is also dedicated to improving students’ capacities to write and speak well. It requires a substantial amount of writing, participation in discussions, and individual presentations to the class.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Literature",
    "Classics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology",
    "Humanities",
    "History",
    "American History",
    "Literature",
    "Classics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nA list of topics covered in the course is provided in the\ncalendar\n.\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nSpring 2011, Pauline Maier (\nPDF\n)\n\nSpring 2010, Pauline Maier (\nPDF\n)\n\nSpring 2009, Pauline Maier (\nPDF\n)\n\nSpring 2007, Pauline Maier (\nPDF\n)\n\nSpring 2006, Pauline Maier (\nPDF\n)\n\nSpring 2005, Pauline Maier (\nPDF\n)\n\nFall 2002, Christopher Capozzola (\nPDF\n)\n\nCourse Requirements\n\nAttendance and Participation\n\nRegular attendance, completion of readings, and participation in discussions is required. This constitutes a significant component of students' performances in the subject.\n\nAssignments\n\nStudents are expected to complete three papers of 4 to 5 pages based on the readings assigned for a specific week. Students will be divided into three groups. Additional details can be found in the\nassignments\nsection.\n\nOral Presentations\n\nOn the first session of the week in which students have papers due they each present to the class a brief summary of their papers. During the final weeks of the term, when students are no longer obliged to write papers on the assigned readings, these presentations will continue. That is, students in group 1 should be prepared to speak about the readings in first session of Week# 12; group 2 in first session of Week# 13, and group 3 in first session of Week# 14. In some cases the format for those classes might be changed, however.\n\nFinal Paper\n\nPreparation of a final paper, roughly 10 pages in length, on a notable historical work that was not assigned as required reading. Additional details are available in the\nassignments\nsection.\n\nThere will be no final examination.\n\nCalendar\n\nWeek #\n\nTopics\n\nKey Dates\n\nIntroduction; the Puritans\n\n\"The First Famous American\": Benjamin Franklin\n\nGroup I Papers Due\n\nGroup I Oral Presentations\n\nPaine's \"Common Sense\" and the Declaration of Independence\n\nGroup II Papers Due\n\nGroup II Oral Presentations\n\nThe Constitutional Convention\n\nGroup III Papers Due\n\nGroup III Oral Presentations\n\nExploring the West\n\nGroup I Papers Due\n\nGroup I Oral Presentations\n\nSlave Narratives: Frederick Douglass and Harriet Jacobs\n\nGroup II Papers Due\n\nGroup II Oral Presentations\n\n\"The Little Lady Who Caused This Big War\"\n\nGroup III Papers Due\n\nGroup III Oral Presentations\n\nThe Lincoln-Douglas Debates; Lincoln\n\nGroup I Papers Due\n\nGroup I Oral Presentations\n\nUlysses S. Grant and the Civil War\n\nGroup II Papers Due\n\nGroup II Oral Presentations\n\nDiscussion: Paper Topics; Writing Final Papers\n\nMaking Money - and Giving it Away\n\nGroup III Papers Due\n\nGroup III Oral Presentations\n\nSegregation and Blacks' Dreams of Success\n\nGroup I Oral Presentations\n\nWhat a Difference the Radio Made: the Presidency, at Home\n\nGroup II Oral Presentations\n\nFree at Last?\n\nGroup III Oral Presentations\n\nFinal Paper Due",
  "files": [
    {
      "category": "Resource",
      "title": "paper_topics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-105-american-classics-spring-2006/4ffd742533819b1a9387d69964bfccdc_paper_topics.pdf",
      "content": "AMERICAN CLASSICS: Suggestions on Paper Topics. Spring 2006.\n\nThe final obligation in this subject is the preparation of a final paper, about 10 pages in\nlength, \"on a notable historical work that was not assigned as required reading,\" as the\nsyllabus puts it. The paper can, however, take a work that was assigned as required\nreading and examine it in a different way, using sources beyond those assigned. For\nexample, Frederick Douglass wrote three autobiographies, of which we read only the\nfirst. Students could look at the other two and compare them, or perhaps compare those\nparts of them that addressed the same or similar topics.\n\nWe did not read The Federalist Papers, which surely are an \"American Classic.\" Often it\nis treated as an official manual on the Constitution. In fact, the Federalist Papers were\noriginally newspaper essays written to defend the Constitution against its critics during\nthe ratification controversy. The Constitution's critics also wrote notable essays, and\nsometimes they're more fun. Bernard Bailyn collected some of the more notable\nspeeches, articles, and letters of the ratification controversy in The Debate over the\nConstitution (Library of America; New York, 1993). Several other collections are\navailable, too.\n\nRemember the story of Washington and the cherry tree? It comes from Mason Weems's\nLife of Washington, first published around 1800 and reprinted, with an introduction by\nMarcus Cunliffe, by the Harvard University Press. Weems's book was overtop: it\nrepeated anecdotes more to teach readers moral or political \"lessons\" than to recover\nWashington's life, and it made Washington a figure like Moses or Christ (depending on\nwhich passages you consider). But this is where the adoration of the founders started.\nAnd parts made their way into the schoolbook McGuthrie's Reader---another good topic\nfor a paper.\n\nThis year some of Lincoln speeches beyond the Lincoln-Douglas debates were listed on\nthe syllabus, but we had little time to discuss them. So I think students could write on\nLincoln---his oratory, and the development of his message, for example, in the course of\nthe Civil War. Someone wrote an entire book on the Second Inaugural. And how much\nhas been written on the Gettysburg Address? Surely there's a paper in there.\n\nSkipping to the late 19th century, Jane Addams, Forty Years at Hull House (orig. 1910)\non her experiences in a settlement house (which offered services to immigrants), or Jacob\nRiis, How the Other Half Lives (1890) on the lives of the poor in American cities. Riis\nwas himself an immigrant, but from Denmark, not southern or eastern Europe, which\nproduced the mass of immigrants of the time. He was also a photographer. Or Edward\nBellamy's Looking Backward, 2000-1887 (1888), which predicted what the United States\nwould look like in 2000! Similarly, a Populist named Ignatius Donnelly published\nCaesar's Column in 1890 that purported to describe New York city in 1988 with its\noppressive conspicuous wealth, its insurgent workers.... But then you might prefer to\nwrite on L. Frank Baum's The Wizard of Oz (1900)---no, not the movie, though you\ncould do both. Baum's book is available on the internet:\nhttp://www-2.cs.cmu.edu/People/rgs/wizoz10.html\n\nHave a look at the introduction. Some say it was a contemporary political allegory, not\njust the \"modernized fairy tale\" Baum said he was producing.\n\nThe spring 2006 rendition of AMERICAN CLASSICS is a bit light on the 20th century.\nYou can make up for that with your paper. There are more possibilities than I can begin\nto list. You might, for example, like Helen Keller's The Story of My Life (orig. 1903).\nYou could examine and write on the Depression era photographs of Dorthea Lange (or,\nearlier, Mathew Brady's Civil War photographs), though we have confined ourselves\nlargely to works in words. You could write on Margaret Mitchell's Gone with the Wind\n(1936)---and/or the movie of three years later, although both are gargantuan. Have you\never wanted to read Rachel Carson's Silent Spring (1962)? A 40th anniversary edition\nwas published in 2002. The 1960s also produced a rash of landmark books by black\nAmericans. Another of an earlier time, The Autobiography of an Ex-Colored Man (1912)\nby James Weldon Johnson, is in Three Negro Classics.\n\nThe possibilities are almost endless. The examples mentioned here are to get you\nthinking. A good topic for a paper must be 1) a work that has attracted considerable\nattention or had a notable impact and 2) provides an interesting vantage point on the time\nit was produced or perhaps on the author, if he or she is independently interesting. Most\nappropriate topics are works of nonfiction: novels are studied intensively in other\nsubjects. That's not to say The Great Gatsby isn't worth reading historically, but you've\nprobably read it already. The same is true of Huckleberry Finn. Johnson's\nAutobiography of an Ex-Colored Man is a novel, but I don't think you'll find it in many\nAmerican literature courses; its interest is largely historical. The same is true of Gone\nwith the Wind. In short, find a work that interests you, that has historical interest, and\nthat you haven't already read. And, assuming the topic isn't on this list, check it out with\nthe instructor."
    },
    {
      "category": "Resource",
      "title": "zgazak_105_brady.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-105-american-classics-spring-2006/26ed7206479349cd70489f43ec52f546_zgazak_105_brady.pdf",
      "content": "Zach Gazak\nMay 2005\n21H.105\nMathew Brady and the Civil War\nWhen civil war erupted between the United and Confederate states in 1861, few\nexpected a conflict of such length which would claim over 600,000 American lives.1 The\nextent and violence of the Civil War cannot be pinned to any single cause--but may be\nwell explained by the technological and methodological state of warfare at this point in\nhistory. Such devastating losses had never before been seen in warfare, and that this\nconflict became one of the first captured by photography appears, at first glance, rather\nunfortunate. But a connection between the ghastly photographs of countless casualties\nand the mismatch of weapons and tactics cannot be ignored. Photography had advanced\nto the point of portability, but could not yet capture the rapid motion inherent in battles.\nWhat was left for Mathew Brady and his team of war photographers? Still life: portraits,\nlandscapes, and the motionless dead. Mathew Brady built his fame on photographing the\npolitical heroes of the day, chose to photograph the Civil War, and fell to professional\nruin after the war ended. The length and destruction of the Civil War forever changed the\n1 Pauline Maier, M.R. Smith, A. Keyssar, and D.J. Kevles. Inventing America: a History of the United States. (New York, NY, 2003)\np. 521\n\nface of American heroism, and Mathew Brady cemented his own professional demise by\ncapturing the horrific effects of this \"modern\" war, replacing lists of dead and reports of\nviolence with stunning photographic images. While his images create a sad record of the\ndeath in the Civil War, his rise to and fall from fame expose another powerful image: that\nof an entire nation wounded and forever changed by the Civil War.\nNo clear record exists of Brady's birth or early life. He claimed a county in\nupstate New York as his birthplace, and an unverifiable birth date of 1823.2 He arrived in\nNew York City in 1839, an uneducated young man seeking work. His immediate interest\nin the new field of photography allowed him to become one of the first professionals of\nthe process. That he learned the trade from Samuel Morse did not hurt: Brady met his\nfirst famous customers through this man of distinction.3 His reputation as an excellent\nportraitist snowballed throughout the 1840s and 1850s, and he began realizing his dream\nto capture the history of America through his professional medium. Brady quickly set up\na studio and began photographing the rich and famous. Rapid success offered Brady the\nluxury of picking his own subjects, and he \"tirelessly sought to make as complete and\ntrue a record as possible of all the great personages of his time.\"4 Brady commented that\n\"the camera is the eye of history.\" His future mission to photograph the civil war was for\nhim a logical extension of this historical record-keeping.\nIn 1858 his pursuit of the historical heroes of the day led Brady to Washington\nD.C., the place which more than anywhere else \"cherished memories of the past and of its\nfirst illustrious citizens, the Founding Fathers.\"5 His work was well accepted. One critic\nwrote that Brady's collection \"concentrates and embalms the greatness of an era,\" and\n2 George Hobart, Masters of Photography: Mathew Brady. (Great Britain, 1984) p. 1\n3 Ibid., p. 2\n4 Ibid., p. 2\n5 Mary Panzer. Mathew Brady and the Image of History. (Washington, 1997) p. 93\n\nanother \"seemed to suggest that the mere exposure to a portrait could preserve and\nconvey the full personality of a man like John C. Calhoun to one who had never known\nhim.\"6 In a time of such political unrest, the portraits of deceased political heroes\ndisplayed alongside those of active politicians offered comfort to a troubled public.\nLooking upon current politicians in Brady's studio allowed citizens to see them as future\npolitical heroes, not the group of men threatening governmental collapse. Here the\nstunning power of Brady's portraiture is most evident. His talent allowed him to create\nimages of politicians on the brink of disunion that emanated strength and power\nequivalent to those historical heroes of generations past, men like Calhoun, Adams, and\nJackson, whom Brady photographed before their deaths.7\nHowever calming, Brady's images of Washington in the late 1850s made little\nattempt to cover the political dissention of the day. In 1860 Brady released a large\ncomposite image in which he \"combined individual portraits of all 250 members of the\nHouse and Senate into two enormous panels three by five feet.\"8 The panels represented\nfar more than the portraits they contained. Patching together individual portraits--\ninstead of photographing the Thirty-sixth Congress as a group--offered a subtle\nvisualization of a faltering political body. At this time the House and Senate represented\na group of individuals consumed by \"sectional loyalties,\" not a single body of\ngovernment.9 Whether intentional or not, Brady captured this shattered government mere\nmonths before southern secession cemented the issue.\nWith war now imminent, Brady made a personal decision to photograph the\napproaching conflict. He later commented on the decision to document the war, \"I felt\n6 Ibid., p. 96\n7 Ibid., p. 99\n8 Ibid., p. 99\n9 Panzer, Mathew Brady and the Image of History, 101\n\nthat I had to go. A spirit in my feet said 'Go,' and I went.\"10 What drove Brady from his\nsuccessful studios in Washington D.C. and New York City? Why did he leave his\ninternational fame--his position of \"society photographer supreme\"11--for the\ndangerous, largely anonymous fields of battle? War photography was a new enterprise,\nas was all photography, but Brady was not the first. Roger Fenton's work on the Crimean\nwar of 1855 would have been readily available at this time. His work combined with the\nportability of new photographic methods provided for a \"universal and immediate\"\nconnection \"between war and the camera.\"12 Brady's drive also surely represents \"an\nextension of his earlier efforts to accumulate portraits of men who could claim some\nsignificance for the present, and for posterity,\"13 yet exposes a deeper connection\nbetween Brady and his quest than earlier works suggest. Amassing wealth and fame\ncollecting images of the rich and famous in a comfortable studio is one thing, but\nsecuring \"permission from Washington officials to photograph the 'coming\nunpleasantness'--at his own expense\"14 represented an entirely different level of\ndedication. Brady truly viewed his art as \"the eyes of history\" and felt photographers\nheld the duty of collecting such history. He collected, trained, and funded entire teams of\nphotographers to follow him into the war. One thing is certain: Brady exhibited\npeculiarly keen insight into the coming change in American heroism. Politics failed to\navert the Civil War--the conflict's resolution would emerge on the field of battle.\nMilitary leaders would replace the politicians in public esteem, and Brady positioned\nhimself to capture these new heroes.\n10 Ibid., p. 18\n11 Dorothy Kunhardt, and P.B. Kunhardt Jr. Mathew Brady and His World. (Alexandria, Virginia: 1977) p. 200\n12 Panzer, Mathew Brady and the Image of History, 101\n13 Ibid., p. 103\n14 Webb Garrison, Brady's Civil War. (Guilford, Connecticut, 2002) p. 6\n\nMany believed that the Civil War would end within a few months, but as the\n\"rebellion\" became a full scale war both sides made haste in acquiring the most powerful\nand effective new weaponry. These new rifles represented a significant improvement\nover older muskets, decreasing the time required to load the weapon and increasing both\nfirepower and accuracy. Soldiers armed with rifles could accurately attack enemies up to\none hundred yards away and fire many times while marching before actually reaching\nenemy troops. In musket warfare of the past, soldiers could not expect to inflict damage\npast fifty yards, and might fire two or three times before engaging their opponents in\ndirect combat. Because the Civil War was the first major military engagement to employ\nthe new rifles as standard equipment, no tactics were available regarding their use on a\nlarge scale. Top military commanders of the time, such as Robert E. Lee and George B.\nMcClellan, were well taught in the tactics of musket warfare and immediately applied\nthese tactics on the first battlefields of the new rifle era. These engagements would prove\na bloody testing ground for modern war: \"This change [in weapon technology] made\nattacking more difficult and defense more effective. It took military officials some time\nto figure out what was going on and to change their tactical manuals accordingly.\"15 This\nnew technology, paired with aged tactics, created a dangerous situation where casualties\nfrom single battles reached levels before seen only over entire wars. One might consider\nthe photographic documentation of the Civil War unfortunate--the most experienced\nmilitary leaders had not witnessed violence of this level, yet Brady and his\ncontemporaries provided such images to all of America.\nThis new level of warfare contained an interesting connection to the\ndocumentation of this violence: technology. The decades prior to Southern secession\n15 Maier, et all, Inventing America 522\n\nprovided not only vast improvements in military technology but show a paralleled\nrapidity in civilian technological advancement. The invention and development of\nphotography is an excellent example of this civilian progress. In the late 1830's, when\nMathew Brady arrived in New York City looking for work, a French inventor released\n\"one of the first methods of capturing an image by chemical means.\"16 The process\ninvolved no negative, instead directly producing a single image, or \"daguerreotype.\"\nBrady mastered the process. But the daguerreotype might be said to represent \"musket\"\nphotography, and quickly became obsolete. A professional could only produce images\napproximately three by three inches in size, and each exposure created a single\nphotograph--the lack of a negative meant no additional copies could be printed. By the\n1850s a new method of photography replaced the old daguerreotype. A new \"rifle\" of\nphotography, the collodion process created a glass negative that could be used to produce\nlimitless copies of various sizes, including occasional life sized prints.17 Brady quickly\nadapted to the change in equipment and mastered collodion, or glass-plate photography,\nas he had daguerreotypy.\nThe colloidon process offered huge advancements to portrait photography, but\nwas limited in a non-studio setting by the time a glass-plate negative needed to be\nexposed to light. In the best of conditions, the chemical processes required four second\nexposures. For portrait photography before the Civil War, a subject would have no\nproblem remaining motionless for such a short length of time. On the battlefield,\nhowever, soldiers were much less willing to stop and remain motionless for a four second\nexposure--the accurate weapons of their enemies could prove deadly in that time. Brady\n16 Hobart, Masters of Photography, 1\n17 Ibid., p. 4\n\nand his contemporaries did amazing work with the technology of the day, yet leave us\nwith a skewed memory of the Civil War in which battles remain conspicuously absent.\nOne photograph displays blurred masses approaching one another on the fields of\nAntietam, obscured by smoke from their own weapons. Yet in this image, the sole\nphotograph of Civil War battle, \"the viewer feels the battle rage--but does not really see\nit.\"18 Brady and his contemporaries risked everything to collect images of the Civil War,\nbut the technology of the time forced an odd, partial record of the war in which conflict\ncould not be directly photographed. The subjects remaining for war photographers\nincluded landscapes, portraits of generals and armies, and the dead. This incomplete\naccount of the Civil War serves as our only visual description of the event, and has a\ngreat effect on how the conflict is remembered. Gone are the notions of glorious warfare,\nmajestic battles, and honorable commanders depicted in paintings of ancient battles.\nPhotography of the time replaced these glorifications with the darker reality of war's\naftermath: shattered cities, trampled fields, and piles of dead strewn about like discarded\ndolls.\nAn interesting connection between these horrific images and the conditions which\nproduced such scenes exposes why Brady's Civil War collection contains so many tragic\nphotographs. In the late 1850s, both the military and photography sat in precarious\ndevelopmental positions. New rifle technology vastly increased the power of weaponry,\nyet the leading generals of the age were instructed and experienced in tactics suited for\nmusket warfare. Photography had become portable, freeing it from the confines of a\nstudio--yet could not capture the action inherent in most non-studio situations. Had the\nwar occurred before rifles became mainstream weapons, one might imagine a much less\n18 Kunhardt, Mathew Brady and His World. 226\n\ndestructive war--a war that would have produced no photographs. If the war was\ndelayed until generals educated in the use of rifle technology replaced their elder\ncommanders, one might expect tactics designed to limit exposure of soldiers to enemy\ngunfire, thus drastically reducing casualties. Such a delay would also allow photography\nthe time needed to develop processes capable of capturing rapid motion--and war\nphotographers would most likely concentrate on the battles themselves, not the aftermath.\nYet the reality of the Civil War is much different: war broke out in an unstable period\nbetween these two points. Soldiers fell dead in great numbers, and photography offered\nno means of capturing battle--only through photographing the excessive death and\ndestruction of the Civil War could Brady and his contemporaries adequately describe the\nconflict.\nWhile the Civil War eventually destroyed his source of business, Brady's\nexperience in the war matured his photographic art, which reached a level unmatched by\nhis pre-war photographs. Brady became one of the first individuals to embrace\nphotography as art, not simply a means of capturing images. His early portraits differ\nlittle from paintings, with regally positioned figures in formal studio settings. This\nphenomenon is quite prevalent in the history of invention: the first automobiles looked\nnearly identical to horse drawn carriages, early motion pictures resembled plays, and the\nfirst computers might be confused for typewriters with screens. Over time, inventions\nsuch as these gain their own identities.\nPhotography made such advancements largely as a result of war documentation.\nOnce Brady took his equipment into the field, he was forced to re-examine how he\nphotographed portraits. He and his teams found limitless new backdrops to replace blank\n\nBrady's pre-war studio portraits exhibit many likenesses to painted portraits.\nPhotography offered no reason to avoid transitory details, but Brady's early work did\nnot explore these strengths. The art of photography had yet to emerge from the\nshadow of painting. Brady and his team explored the strengths and weaknesses of\nphotography throughout the Civil War, when studios were rarely convenient. Image\nSource: Garrison, W. Brady's Civil War. (Guilford, CT: 2002) p. 216.\n\nstudio walls: campsites, forests, and landscapes. The settings of his wartime portraits\nrepresent only a small change in his art form. In the painted portraits of the past, \"the\nideal quality of a portrait depended upon the portraitist's ability to separate the essential\nfrom the circumstantial.\"19 Brady could duplicate this separation in carefully controlled\nstudio settings. But when he and his teams entered the business of photographing war,\nthey were confronted with a change in the very nature of their work. No longer did they\ncapture only the makers of history--taking their equipment into the field allowed the\nphotographers to capture history itself, as it unfolded. And they found that in the field,\nthe circumstantial details became essential. The soldiers and locations so prominent in\nBrady's war collection would never have made it to his pre-war studio, because \"these\nfigures occupy a distinct place and time; the location of the camp, the hour of the day, the\nvery objects that surround the sitter all fix the subject within a particular historical\nmoment.\"20 Without the circumstantial surroundings, such photographs carried little\nweight. Through exercising the portability of photography and its distinct ability to\ncapture transient details, Brady pushed his portraiture from a replication of painting\ntechniques to an original form of art and documentation. This advancement in his art\nalone did not provide enough momentum for his professional survival after the war\nended.\nWar offered another change in portraiture, the photography of the dead.\nGruesome images of lifeless bodies strewn carelessly about by rifle fire--or worse, lined\nup in neat rows for burial--provided civilians across the North a direct view into the\nhorrors of war. The public viewed these images with \"a terrible fascination\" during the\n19 Panzer, Mathew Brady and the Image of History, 106\n20 Ibid., p. 106\n\nCampsites and battlefields of the Civil War offered countless new backdrops for\nBrady and his team. The use of these backdrops and a lack of complete control over\nsimple details changed Brady's photography. For example, notice the man on the far\nleft who has a pipe in his mouth and a cigar in his hand--such a mistake in the posing\nof subjects in the studio would not occur. Instead of photographing the makers of\nhistory, Brady was photographing history itself. Image Source: Garrison, W.\nBrady's Civil War. (Guilford, CT: 2002) p. 40.\nwar and rejected them completely afterwards.21 Warfare always produced casualties, yet\nnever on this scale--and never delivered such images directly to the public. An 1862\n21 Panzer, Mathew Brady and the Image of History, 109\n\nNew York Times review of Brady's work at Antietam commented that war casualties\nappeared \"like a funeral next door... We recognize the battle-field as a reality, but it\nstands as a remote one,\" and \"our sensations might be different if the newspaper carrier\nleft the names on the battle-field and the bodies at our doors instead.\" The review\ncontinues to claim that Brady's photographs did just this: \"If he has not brought bodies\nand laid them in our door-yards and along the streets, he has done something very like\nit.\"22\nThese photographs captivated the public while war raged on, yet in the end\ncontributed to a larger shift in American heroism during and after the Civil War. By\nproducing such images, Brady aided in the downfall of his old political \"hero,\" offering\nvisualizations of the destruction which these politicians only temporarily evaded through\ncompromise. The post-war public, which five years earlier held such compromisers in\ngreat regard, saw such political tactics as a direct cause of the Civil War, and afterwards\n\"their ideals of moderation and compromise inspired no one.\"23 Brady offered images of\na new hero to the American people: military leaders of Mexican War fame who firmly\ntook sides on the secession issue and bravely fought for their beliefs. The public\nvoraciously consumed images of \"the glamour and pomp of Scott and McClellan.\"24 One\nreporter remarked that such military leaders \"are as brilliant but as distant from us as\nplanets; it is a pleasure to have these planets photographed and be upon whispering terms\nwith the Generals who are now to the nation as gods.\"25 But the war dragged on, and\nthese majestic fighters met with little success, a new breed of military leaders took their\nplace. These men--men like Sherman and Grant--provided the tactics and force\n22 Ibid., p. 106-107\n23 Panzer, Mathew Brady and the Image of History, 110\n24 Ibid., p. 110\n25 Ibid., p. 103\n\nrequired to bring about an end to the civil war. Yet they were no heroes. They won\nbattles through \"ruthlessness and efficiency,\" and sacrificed great numbers of lives in the\npursuit of victory.26 When war finally ended, the public was left with no true heroes who\nmight stand up to the ideal heroism which America subscribed to before conflict broke\nout. A new \"hero\" arose from the common, anonymous soldier. These men represented,\nfor post-war Americans, the only figures in the war not marred by playing a role in\nsecession or directing the deaths of so many. Brady's work not only exposed the\nbrutality of military leaders, but also supported this new private hero. His photographs\n\"allowed viewers to see the war through the eyes of their loved ones,\"27 and provided\nimages in which \"the private soldier has just as good a likeness as the General.\"28\nDuring the war, the photographs which facilitated changes in American heroism\nmet with great success and increased Brady's fame. Images of battlefields, soldiers, and\ngenerals provided an exciting look into the conflict that words simply could not\nreproduce. Landscapes supplied \"a screen on which [viewers] could project a private\nversion of the battle.\"29 Even the photographs of dead produced a sense of wonder in the\nminds of people who knew casualties as lists of names and no more.\nYet Brady fell from fame and fortune in the years after the Civil War ended. He\nreturned to his studios in New York expecting to amass a fortune on selling his Civil War\ncollection, after which he could return to photographing the distinguished leaders of the\nday. \"For Brady and his generation, the nation's past was still almost within reach of\npersonal memory, and the future stretched ahead, a long, continuous procession of great\nmen,\" even though his own personal work helped destroy the foundations of this\n26 Ibid., p. 110\n27 Ibid., p. 110\n28 Ibid., p. 106\n29 Panzer, Mathew Brady and the Image of History, 109\n\n\"continuous procession.\"30 The New York Times offered a more successful prediction,\nexpecting Brady's images to \"make common mortals of many a... living idol.\"31\nHowever, the use of Brady's images as news reporting died with the war, and would only\nre-emerge as historically important documentation decades later. In addition, the men\nreturning home needed no reminder of their experiences: \"the truth of the war was too\nmuch to bear for those who had suffered through those four horrible years.\"32 The\nconditions in which Brady rose to fame involved a society willing to pay high prices for\nhigh quality photographs of political heroes. War effectively destroyed the heroism in\npolitics and offered no replacement--post-war Americans preferred photographs of\nfamily members to political heroes, and Brady could make no money in such an\nenterprise. America now desired low cost, low quality personal photographs. In the\nwords of Rose Greenhow, a Confederate spy, the pre-war years seemed \"to belong almost\nto another state of being,\" than the post-war society.33 Brady fell into poverty under such\nconditions, and sacrificed much of his collection to fund the storage of what remained.\nWhy was Brady able to follow the changing trends of heroism into the Civil War,\nyet unable to predict or prepare for the eventual destruction of the \"hero\" on which he\nbuilt his fame? Brady was reluctant to sacrifice the belief that a \"continuous procession\nof great men\" would stretch out from the Civil War. 34 He obviously understood--as he\nstruck off to photograph the war--that his beloved political heroes would give way to\nnew definitions of heroism. Yet his belief in photography as an art form, and his love for\ncapturing the images of rich and famous Americans must have inflicted him with a\n30 Ibid., p. 110\n31 Ibid., p. 110\n32 Hobart, Masters of Photography, 8\n33 Panzer, Mathew Brady and the Image of History, 111\n34 Ibid., p. 110\n\nBrady's Civil War collection remains one of the few sources of images relaying the\ndevastation of the war. While the photographs of fallen soldiers were often staged by\nBrady's teams, even those untouched by the photographers had been \"posed\". The\nbottom photograph, taken after the battle of Antietam, is one of many lines of dead men\ncaptured on film. Note the visual likeness to the top image, a photograph of officers\nobserving a court martial hearing. But the posing of the dead in the bottom photograph\nwas not done by photographers--these men were arranged for burial.\nBrady\nphotographed battlefields after truces between opponents allowed for the burial of fallen\nmen, nearly eliminating the chances of completely untouched scenes of death. Image\nSource (both images): Garrison, W. Brady's Civil War. (Guilford, CT: 2002) p. 217.\n\nstubborn blindness to the approaching elimination of his trade. How else could a man of\nsuch insight into heroism emerge from the war unable to remain out of debt? Perhaps\nBrady was simply unwilling to give up his artistic pursuits in conjunction with the public\ndesire for inexpensive \"portraits for their family albums, showing men and women who\ninspired more private memories.\"35 He felt an unexplainable draw to historically\nsignificant images, and \"an old [photograph] sent home by a soldier, or the frank charm\nof a picture of an actress,\"36 hardly satisfied his understanding of the camera as \"the eyes\nof history.\" In this time where photography of historical importance drifted from public\ninterest, so did Brady \"slip into quiet obscurity.\"37\nYet in some way this fall from fame represents no blindness or false judgment at\nall, but instead another stride in Brady's attachment to the historical significance of his\nCivil War collection. Just as he sacrificed his life and fortune to follow United States\narmies into battle against the Confederacy to collect photographs, Brady surrendered his\nchances at emerging from poverty for the protection of as much of his collection as\npossible. He slowly auctioned off single negatives to fund the storage of those\nremaining, saving as many as he could until Congress eventually purchased what was left\nof the collection.38 Brady suffered ten years of poverty to preserve his precious historical\nphotographs when he might have easily moved to other, more profitable measures and\nallowed his collection to fall into ruin. While only a fraction of his original ten thousand\nphotograph collection survived until the present, history owes a debt of gratitude to\nBrady: that any images survived is amazing, given the circumstances.\n35 Ibid., p. 111\n36 Ibid., p. 111\n37 Hobart, Masters of Photography, 8\n38 Hobart, Masters of Photography, 8\n\nMathew Brady quietly passed away in 1896, leaving the world in the same\nobscurity with which he entered. For a brief period in history Brady enjoyed great fame\nthat he sacrificed in the pursuit of his desire to photograph the Civil War. But Brady's\nintuition into the historical importance of photography, while providing his eventual\ndemise, cemented his position as a great historical figure. His images expose the horrific\nviolence of the Civil War in a way with which words could not hope to compete.\nFurthermore, Brady's rapid rise to fame before the war and even quicker fall after the\nconflict ended exposes much about the societal and political changes which the Civil War\ncreated in America. An analysis of the work and life of Mathew Brady offers an\ninteresting, original view of a traumatic time in American history. While Brady's\nphotographs provide direct images of moments in time, his life exposes a grander image\nof the entire historical period in which he lived.\n\nWorks Cited\nGarrison, W. Brady's Civil War. Guilford, CT: The Lyons Press, 2002.\nHobart, G. Masters of Photography: Mathew Brady. Great Britain: Macdonald & Co\nLtd., 1984.\nKunhardt, D.M., and P.B. Kunhardt Jr. Mathew Brady and His World. Alexandria,\nVirginia: Time-Life Books Inc., 1977.\nMaier, P., M.R. Smith, A. Keyssar, and D.J. Kevles. Inventing America: a History of the\nUnited States. New York, NY: W. W. Norton & Company, Inc., 2003.\nPanzer, M. Mathew Brady and the Image of History. Washington: Smithsonian Institute\nPress for the National Portrait Gallery, 1997."
    }
  ]
}