{
  "course_name": "America in Depression and War",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Military History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "American Politics",
    "Humanities",
    "History",
    "American History",
    "Military History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Political Science",
    "American Politics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course examines the transforming effect of two cataclysmic events in the twentieth century: the Great Depression and World War II. We will study the ways they both led to a major reordering of American politics and society. By focusing on how the government and the country dealt with these national crises, we will explore a significant moment in the evolution of American political culture. Throughout the semester, we will examine how ordinary people experienced depression and war and how those experiences changed their outlook on politics and the world around them. Topics include unemployment and economic decline, the rise of organized labor, New Deal politics, women in the war effort, the Japanese internment, the development of atomic science, and America as a world superpower.\n\nThis class will consist of a combination of lectures and discussions. You will be required to do the reading in advance and come prepared to talk about what you have read. To help facilitate discussion, occasionally you will gather primary documents from the library and/or the web. Class participation will count for 20%. In addition, you will also have two in-class tests each worth 20%. In addition, you must also write a 15-page research paper (40%).\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n20%\n\nIn-class tests (2)\n\n40% (20% each)\n\nResearch paper\n\n40%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nBreadlines to Atom Bombs\n\nThe Great Depression\n\nThe End of Prosperity\n\nThe End of Prosperity (cont.)\n\nThe Unemployed\n\nThe New Deal\n\nRoosevelt's 100 Days\n\nRoosevelt's 100 Days (cont.)\n\nStrikes and Struggles\n\nStrikes and Struggles (cont.)\n\nNew Deal Order\n\nOne Best Source Presentations\n\nExam #1\n\nExam #1\n\nWorld War II at Home\n\nMobilizing for Victory\n\nMobilizing for Victory (cont.)\n\nGender and Race in Wartime\n\nGender and Race in Wartime (cont.)\n\nWorld War II Abroad\n\nD-Day\n\nHiroshima\n\nHiroshima (cont.)\n\nLegacies of Depression and War\n\nExam #2\n\nExam #2\n\nHow to Write A Good Paper\n\nResearch Presentations\n\nResearch Presentations (cont.)\n\nResearch Papers Due",
  "files": [
    {
      "category": "Resource",
      "title": "Blum and Terkel, part I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/0b16b4d8eb0a569cfb5dd0d958cc8c1f_MIT21H_209S12_terkel1.pdf",
      "content": "Reading Questions for Blum, V was for Victory and Terkel, The Good War\nWhat attitudes did Americans have about war before Pearl Harbor?\n\nHow eager were they to participate in the war?\n\nWhat, do you suppose, were their reasons for involvement or non-involvement?\n\nWhat obstacles would the government face in mobilizing for war?\n\nHow would the President overcome these obstacles?\n\nHow do those who lived through Pearl Harbor remember it?\n\nWhat factors influenced their judgement?\n\nWhat can we learn from oral histories?\n\nWhat are their strengths and limitations?\n\nAs sources, how do they compare to the letters in McElvaine?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Blum, part II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/e03a68101a18d48f11fa1f2c9fd1e0b0_MIT21H_209S12_blum.pdf",
      "content": "Reading Questions for Blum, Terkel, and Polenberg\nWhat impact did the war have on the economy?\nDid all sectors of the economy benefit equally?\nWhat was the experience for the average American on the homefront?\nHow did experiences vary for different groups?\nWhy did Americans support the war?\nWhat did they think the US was fighting for?\nHow would you describe the Four Freedoms?\nWhat did they mean for different groups of Americans?\nHow did the government define its war aims?\nHow did government propaganda seek to mobilize the country?\nDid war enable or stifle reform?\nAssignment: Look at propaganda posters on the links to World War II poster sites. Figure out who\nthe audience was and what the intended message was. What were the differences and similarities in\nprivate advertisements verses government posters?\n(http://scriptorium.lib.duke.edu/adaccess/ and\nhttp://www.archives.gov/exhibit_hall/powers_of_persuasion/powers_of_persuasion_home.html)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Brinkley, Voices of Protest and Polenberg",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/40e549ee96ad8b760582278a513777fd_MIT21H_209S12_brinkley.pdf",
      "content": "Reading Questions f or Voices of Protest and Polenberg, 1-1,2; 2-3; 4\n(**note: go through the primary documents in Polenberg and assign each one a number designated\nfirst by chapter and then by document number)\nWhat motivated Huey Long and Father Coughlin?\nWho supported them and why?\nDo you think populist is a good description of their politics? Why or why not?\nWas Long good for the people of Louisiana? How so?\nHow did Long and Coughlin understand the depression?\nWhat remedies did they propose?\nWere those realistic solutions?\nFor whom did they have appeal and why?\nHow did they compare to Roosevelt?\nWhat in Roosevelt's first inaugural address echoes the messages of Long and Coughlin?\nWhat was the basis for each of their successes?\nWhat role did technology (i.e.: the radio) play in each of their platforms?\nWhat was striking about Roosevelt's first FireSide Chat?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Brinkley, Voices of Protest and Polenberg, part II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/09a35ce275750923007d18e5553eda54_MIT21H_209S12_brinkley2.pdf",
      "content": "Reading Questions f or Voices of Protest and Polenberg documents\nWhat made Long and Coughlin significant in 1935?\n\nWhere did they draw their political strength from?\n\nIn what ways did they cause FDR and the Democratic party concern?\n\nIn what ways, if any, did they help the Democratic party?\n\nDid FDR accommodate them and if so how?\n\nHow would you characterize the New Deal legislative proposals from 1935 on?\n\nWhom were they intended to help and why?\n\nIn what ways did Roosevelt carve out a new vision of the New Deal?\n\nWhat was the Administration's political strategy in 1935?\n\nWho gained under the 1935 initiatives?\n\nWhat were the long-term consequences of these acts?\n\nPaper One: The Great Depression\nWrite a 5-page paper in response to one of the questions below. Be sure to have an argument and\nto provide evidence to prove your points. Make sure also to use specific examples from the readings\n(McElvaine, Brinkley, and the Polenberg documents). Please consult the attached \"Guide to Writing\nan A Paper.\"\n\n1) Some scholars argue that the New Deal was a radical break while others suggest it was quite\nconservative. To what extent was the New Deal a revolution? If so, how?\n\n2) Compare the experiences of three groups of Americans in the Great Depression. Did the 1930s\nreinforce or eliminate differences in American society?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "DOWN AND DIRTY GUIDE TO WRITING AN “A” PAPER, OR  .  .  .  OVERCOMING THE “BLANK-SCREEN SYNDROME”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/d8c224743a2bb8855e163aee695dc95d_writing_guide.pdf",
      "content": "Professor Meg Jacobs, History\n\nGUIDE TO WRITING AN \"A\" PAPER, OR . . . OVERCOMING THE\n\"BLANK-SCREEN SYNDROME\"\n\nThe dread of the blank screen has the effect of inducing instant panic, what I call \"blank-\nscreen syndrome.\" This fear leads to a downward spiral. Not being able to stand the sight\nof the empty page, you end up typing fast and furiously with no direction. You tell\nyourself that you'll go back and polish up the paper. But, then, you are so happy to have\nfilled up the necessary space, this editing doesn't happen. Trust me. (There is also a\ncorrelation between this syndrome and last-minuteitis, so usually you won't have enough\ntime to go back anyway.)\n\nThe bottom line: You need to know where you are going before you type in the first\nword. This guide helps to break the writing down into discernible steps, a number of\nwhich you do before you even sit down at the computer. If you know that you have to\ncomplete several steps before you sit down to start writing, then you approach the screen\nwith a sense of what you are doing. In other words, you come armed and ready to face\ndown your own reflection as you stare at the blank screen. I have listed some of the\nimportant practices to master and pitfalls to avoid, in other words, the top ten dos and\ndon'ts. If followed, you will have less anxiety and produce better papers. Trust me.\n\nTOP TEN DOs:\n\n1) Be sure to do all the reading, including materials for the day the paper is due. Mark\nthe readings with your own system--i.e.: underline for important info, add a bracket for\nmain points, add a star for the main argument. This makes it easier when you come back\nto books you've read weeks ago.\n\n2) Take two pages of notes on the reading: first, create a general history of the period\nthat the readings cover-- the major events, turning points, phenomena, as well as key\nactors and institutions. Use your class notes for this, too. This doesn't mean writing\ndown everything, but just those facts that relate to the assignment. Typically, a single\npage of notes covers the main points.\n\n3) Next take another page of notes on the major themes of each work (either primary\ndocuments or secondary sources). These don't have to be extensive. In fact, they serve\nyour purpose better if you stick to major arguments of each text. Usually, a few\nsentences on the main idea and broad narrative for each author suffice.\n\n4) Then figure out where you stand. Your papers should avoid simple synthesis of other\nworks, but rather should reflect your own argument. You should build upon the\nscholarship and borrow examples in order to come up with your own strong, well-\narticulated thesis. At this stage, jotting some ideas down on a pad helps to crystallize\n\nyour argument (and also serves as a useful check to prove to yourself that you really\nknow what you are talking about).\n\n5) Mine the readings to select examples that support your argument. At times, you may\nfind a particular point an author makes useful. At other times, you may want to use the\nevidence an author provides to come to different conclusions. I find it valuable at the\noutset to pick more examples rather than fewer. Typically, I mark these by just sticking a\npost-it on the page. Sometimes, I also code these post-its with letters, numbers, symbols,\nwhatever, so all the examples on the same point are marked \"1\" or \"A.\"\n\n6) Now you are ready to write. Begin with the introduction. This first paragraph should\nclearly state the overall argument and give the reader some sense of the structure of the\npaper. The use of \"first. . . .second . . .finally\" runs the risk of not really making an\nargument in which one point actually leads to the next. Instead, state your overall thesis\nand then the rough outlines of the argument. What is an argument? An argument reflects\nyour particular take on a period of historical change. It explains why and how things\nhappened the way they did, what factors influenced this change or development, and,\noften, who or what played significant roles. In general, an argument characterizes a\nparticular moment in history and explains the contingent forces at work.\n\n7) Outline the remaining argument of the paper. You don't need a tidy outline with\nRoman numerals and lower-case letters. Instead, you need the topic sentences or ideas of\neach paragraph. Once you do this you begin to see how much (or how little) space you\nhave to make your case. Often you have less than you thought. If the rule of thumb is\nroughly two paragraphs per page (or page and a half), and you need an introduction and\nconclusion, then you can work backwards and figure out how many points you have\nroom to make. Assume one major point per paragraph. These points should build on\neach other and thus the reader should be able to read the intro and the first sentence of\neach paragraph and understand the whole argument.\n\n8) Select the quotes you want to use. Typically, you want to use a quote only when an\nauthor or historical actor said something in specific words that actually matter. Use your\njudgment as to whether something is particularly juicy and powerful, and you need to\nhave the exact quote, or whether you can just paraphrase. When you quote a scholar,\nthen you should use a lead-in like, As historian Alan Brinkley points out, \" . . . .\" If you\nare quoting from a quote in a book, identify the historical actor, As Huey Long argued, \" .\n. .\" and then in the footnotes, put where Long wrote it and also \"as quoted in\" and the\ncitation where you got the quote from. (By the way, get a good handbook on the proper\nway to do notes.) In general, use quotes as evidence and examples that support your\nargument rather than as the argument itself. In other words, make sure your quotes\nreinforce a point you have stated in your own words.\n\n9) Now you have to fill in the blanks with the rest of the text. Once you have a strong\nintro, topic sentences that build on each other, and good examples, you are almost done.\nNow you just need to connect the dots. How you do this, though, matters a lot. A good\nidea is only as good as the writing. You need to express precisely what you mean. Again,\nthink before you type. Make sure that each sentence relates to the topic sentence while\nalso adds information. To improve your writing, consult with the list of \"don'ts\" below.\n\n10) Proofread and correct your paper. This means more than spell checking. You should\nprint out a hard copy and ask yourself the following questions: Does the paper tell a\nstrong compelling story that explains how things moved from point A to point B? or else\nstayed the same? Can you read only the introduction and each topic sentence and get the\nargument? Would your classmates or roommates or other professors understand it?\n\nTOP TEN DON'Ts:\n\n1) Don't leave all the reading to last minute. Also, taking notes as you do the reading\nwill shorten the paper-writing process and will also enable you to contribute more to each\nclass.\n\n2) Don't wait to the second or third or fourth (!) paragraph to introduce your argument.\nIn other words, avoid the \"set-the-stage\" intro in which you go back to the American\nRevolution. Also, avoid sweeping statements like \"the world was a different place in the\ntwentieth-century than in the nineteenth.\" Or broad generalizations like \"many things\nhappened in the 1930s.\" Yes, we know and that is why you are writing the paper.\nIndeed, introductions present the most challenging part of writing a paper. You have to\ndo a tricky balancing act between setting up the context and actually stating your thesis.\nThink of the introduction as posing a particular problem that you need to solve, rather\nthan just asserting that \"the world witnessed a lot of change.\"\n\n3) Avoid having too many points per paragraph. Each paragraph should have a single\nidea that you state clearly in the first sentence and then explain and illustrate.\n\n4) Watch out for the \"laundry list phenomenon.\" That happens when you have one\nparagraph after the next without any real transitions. Transitions can often prove to be\nthe biggest stumbling blocks. That's why many authors do neat tricks like use text\nbreaks or false connections like \"meanwhile\" or \"at the same time.\" Instead your points\n\nneed to cumulate and build off of each other. Smooth transitions usually make the\ndifference between papers that simply summarize and papers that actually analyze and\nargue.\n\n5) Don't introduce new ideas or information at the end. Usually I can spot a victim of\nb.s. (blank screen) syndrome if the conclusion makes more sense as an introduction.\nBecause you have not prepared before sitting down to write, then only by the end of the\npaper do you figure out what you want to say. Your argument should not come as a\nsurprise to the reader or to you.\n\n6) Avoid long or vacuous quotes that you could easily summarize. Professors are clever\n(after all, we used to be students too) and realize that this space means fewer of your\nideas and more of someone else's. Also, feel free to use just a few telling words out of a\nlonger sentence.\n\n7) No flabby fillers. Rather than a vague sentence like \"industrialization led to a lot of\nchanges,\" be more specific in your writing. What do you mean by \"a lot of changes?\"\nDo you mean unrest or instability or dislocation or increased living standards or what?\n\n8) At all costs, don't use the passive voice. Teachers say this all the time, but what does\nit mean? It means that every sentence should say who did what. When you write\nsentences that use some form of the verb \"to be,\" you are avoiding telling the reader what\nexactly happened. Instead of writing \"laws were passed,\" you should explain that \"a\ngroup of Progressive politicians from urban areas in the North and the Midwest worked\nfor several years to gain support for their legislation in Congress.\"\n\n9) Avoid sloppy slip-ups. Computer spell checking leaves us with little excuse for errors.\nBut your computer is only so smart. It does not pick up on some of the most classic\nmistakes like \"lead\" for \"led.\" (Bonus points if you can explain why that error occurs\nmore frequently than any other does.)\n\n10) Overall, don't waste space. Once you realize that you have many steps to do before\nyou start writing, you'll realize that the goal is not filling up five pages or fiddling with\nthe margins to make the blank screen go away. You'll come to appreciate that the real\nquestion concerns how you can best use your space, and you'll be wishing you had more.\nThink of it this way: you need to score a certain number of points. If an entire page\npasses with no check marks from the reader, then it will be hard to recover and you have\ncheated yourself out of valuable space.\n\nThe take-home message: start early, break the writing into its component parts, approach\nthe blank screen with a solid game plan, and then reread to make sure you have avoided\npitfalls. Once you get this system down, then writing all papers becomes much easier.\nSure you need to be clever and creative (don't want to forget that), but as with other\ndisciplines, writing papers is a skill you can practice--a formula to learn. Hope this helps\ncure the dreaded blank screen syndrome. Happy writing!"
    },
    {
      "category": "Resource",
      "title": "Down and Out in the Great Depression: Letters from the Forgotten Man",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/9701bf03f0e7872cec25737e16a181f0_MIT21H_209S12_downout.pdf",
      "content": "Reading Questions f or Down and Out\nWhat are these sources, where do they come from, who is doing the writing, and to whom?\n\nWhat are the strengths and the limitations?\n\nHow are these letters different than what might have come earlier?\n\nHow do they identify themselves?\n\nWhat is the general attitude about poverty?\n\nWhy are people poor?\n\nDo some people deserve to be poor and other don't?\n\nShould Americans receive relief?\n\nWho or what gets blamed for the depression?\n\nDo people hate FDR or local administrators or capitalists?\n\nWhat does the government owe them?\n\nWhat do they think about FDR and Eleanor?\n\nHow do letter writers think about their relationship to FDR and the first lady?\n\nWhat did they think the government could and should do to help their conditions?\n\nWhat do they reveal about how Americans think about their government?\n\nDo they want a revolution?\nAssignment\nIn addition to your weekly reading response, go to the web-link for American Life Histories and\nlook at oral histories from your home state (or anywhere you want). In the search, try plugging in\nwords like \"unemployment\" so that appropriate recollections come up.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Galbraith, The Great Crash",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/7fcead600a0be37cc1bc6818b92a376e_MIT21H_209S12_galbraith.pdf",
      "content": "Reading Questions for Galbraith, The Great Crash\nWhat was the atmosphere of the 1920s?\n\nHow many people participated in the speculative boom?\n\nHow did it influence and shape American culture?\n\nDid Americans instantly know that the Crash signaled Depression?\n\nWhat was so \"great\" about the Great Crash?\n\nWhat were the immediate responses and what explains those responses?\n\nWhen did the country begin to realize the severity of the decline?\n\nWhy did Hoover not take more aggressive action?\n\nAccording to Galbraith what were the causes of the Depression?\n\nWhat role did domestic factors play? What about international factors?\nAssignment for Class: Go to the library and get 2-3 primary documents from the weeks and months\nfollowing the Great Crash. Using the New York Times Index or the Readers Guide to Periodical\nLiterature (both reference sources), identify articles to look up on a specific topic of your interest.\nOr else just browse through publications from the time. The documents can be editorials, statistics,\nnews stories, etc. from a wide range of sources. Copy these documents, bring them to class, and be\nprepared to share them with your classmates. What do they reveal about how Americans\nexperienced the crash? What kinds of questions do they answer? What kinds do they not?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Reading Questions for Down and Out – II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/b2c965e4de70208a6ed739de076a8a42_MIT21H_209S12_downout2.pdf",
      "content": "Reading Questions f or Down and Out-II\nHow are these letters different than what might have come earlier?\n\nWhat does the government owe them?\n\nShould Americans receive relief?\n\nWho favors relief and who opposes it?\n\nWhat other kinds of aid did Americans want?\n\nDo specific traits of letter writers influence their views?\n\nWhich are the most important traits in determining attitudes?\n\nDo opinions change from industrial to rural areas?\n\nWhat do these regions have in common and what separates them?\n\nWhat obstacles do the New Deal programs encounter?\n\nWho do people blame for the inadequacies of the New Deal?\n\nWhat do they think about FDR and Eleanor?\n\nWhat do they reveal about how Americans think about their government?\n\nHow do those attitudes change from the early 1930s to later?\nAssignment: In addition to your weekly reading response, go to the web-link for \"By the People, For\nthe People: Posters of the WPA.\" Look through some of these posters at how New Deal imagery\ndepicted working-class Americans.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Terkel, Dower, Blum, part III",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-209-america-in-depression-and-war-spring-2012/fa950c1f7fa84fd0662345dd3d10b4ea_MIT21H_209S12_terkel2.pdf",
      "content": "Reading Questions for Blum, Dower, Terkel, and Polenberg\nJohn Blum explains that \"World War II posed a special test of the ability of the American culture to\naccommodate to its inherent pluralism.\" (p. 147) In the reading for this week, we will explore the\ncomplexities of gender and race during wartime.\n\nWhat does Blum's statement mean? What does he mean by pluralism?\n\nHow did FDR's Four Freedoms (and other government propaganda) build upon this idea of\npluralism?\n\nIn what ways did government propaganda undermine notions of freedom and equality?\n\nWhat wartime factors forced Americans to confront challenges to the ideals of pluralism?\n\nWhat opportunities did women and minorities have during the war?\n\nTo what extent did those experiences change lives?\n\nWhat obstacles did they face?\n\nCan you give concrete examples of discrimination?\n\nWould minorities describe World War II as the Good War? Why or why not?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.209 America in Depression and War\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}