{
  "course_name": "American History to 1865",
  "course_description": "This course provides a basic history of American social, economic, and political development from the colonial period through the Civil War. It examines the colonial heritages of Spanish and British America; the American Revolution and its impact; the establishment and growth of the new nation; and the Civil War, its background, character, and impact. Readings include writings of the period by J. Winthrop, T. Paine, T. Jefferson, J. Madison, W. H. Garrison, G. Fitzhugh, H. B. Stowe, and A. Lincoln.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Humanities",
    "History",
    "American History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2010, Pauline Maier (\nPDF\n)\n\nFall 2009, Pauline Maier (\nPDF\n)\n\nFall 2008, Pauline Maier (\nPDF\n)\n\nFall 2006, Pauline Maier (\nPDF\n)\n\nFall 2005, Pauline Maier (\nPDF\n)\n\nFall 2004, Pauline Maier and Merritt Roe Smith (\nPDF\n)\n\nRequirements\n\nAttendance and Participation\n\nClass attendance, completion of the readings by the class in which they will be discussed, and participation in discussions. Normally the class will discuss the assigned portion of the textbook and the issues it raises on Tuesday and the other readings assigned for the week on Thursday.\n\nAssignments\n\nCompletion of two papers, due in Week #4 and Week #11. Suggested topics based on assigned readings are listed on the\nAssignments\npage. Students can also write on other topics, particularly for the second paper, but must have the topics approved by the instructor before the date they are due. Papers should be about five to seven pages long. They must be typed, double-spaced, with adequate margins for comments and corrections. Any document-based research paper must include notes and bibliography, and all papers must provide page citations for direct quotations.\n\nExams\n\nA midterm examination will be given in Week #7 and a final examination during finals week.",
  "files": [
    {
      "category": "Resource",
      "title": "MIT21H_101F10_dane_tree.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-101-american-history-to-1865-fall-2010/78226afa33a4275464109306eaec2510_MIT21H_101F10_dane_tree.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.101 American History to 1865\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_101F10_jackson.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-101-american-history-to-1865-fall-2010/0dfe94e6553b69f10bce6d42b5bae0fe_MIT21H_101F10_jackson.pdf",
      "content": "21H. 101. American History to 1865.\nAndrew Jackson: Presidential Pronouncements.\n1) Veto Message: Maysville Road (1830)\nTo the House of Representatives:\nGentlemen, I have maturely considered the bill proposing to authorize a \"subscription of\nstock in the Maysville...Road Company,\" and now return the same to the House of\nRepresentatives, in which it originated, with my objections to its passage...\nSuch grants [of money by the federal government] have always been [passed] under the\ncontrol of the general principle that the works which might be thus aided should be \"of a\ngeneral, not local, national, not State,\" character. A disregard of this distinction would of\nnecessity lead to the subversion of the federal system.... I am not able to view [the\nMaysville Road Bill] in any other light than as a measure of purely local character.... It\nhas no connection with any established system of improvements; [and] is exclusively\nwithin the limits of a State [Kentucky]....\n...As great as this object [goal of internal improvements] undoubtedly is, it is not the only\none which demands the fostering care of the government. The preservation and success of\nthe republican principle rest with us. To elevate its character and its influence rank\namong our most important duties, and the best means to accomplish this desirable end are\nthose which will rivet the attachment of our citizens to the Government of their choice by\nthe comparative lightness of their public burthens [burdens] and by the attraction which\nthe superior success of its operations will present to the admiration and respect of the\nworld. Through the favor of an overruling and indulgent Providence our\ncountry is blessed with a general prosperity and our citizens exempted from the pressure\nof taxation, which other less favored portions of the human family are obliged to bear; yet\nit is true that many of the taxes collected from our citizens through the medium of\nimposts have for a considerable period been onerous. In many particulars these taxes\nhave borne severely upon the laboring and less prosperous classes of the community,\nbeing imposed on the necessaries of life, and this, too, in cases where the burden was not\nrelieved by the consciousness that it would ultimately contribute to make us independent\nof foreign nation articles of prime necessity by the encouragement of growth and\nmanufacture at home. They have been cheerfully borne because they were thought to be\nnecessary to the support of government and the payments of debts unavoidably incurred\nin the acquisition and maintenance of our national rights and liberties. But have we a\nright to calculate on the same cheerful acquiescence when it is known that the necessity\nfor their continuance would cease were it not for irregular, improvident, and unequal\nappropriations of public funds?...\n...How gratifying the effect of presenting to the world the sublime spectacle of a Republic\nof more than 12,000,000 happy people, in the fifty-fourth year of her existence, after\nhaving passed through two protracted wars one for the acquisition and the other for the\n\nAndrew Jackson: Presidential Pronouncements\nmaintenance of liberty free from debt and all her immense resources unfettered! What a\nsalutary influence would not such an exhibition exercise upon the cause of liberal\nprinciples and free government throughout the world! Would we not find ourselves in its\neffect an additional guarantee that our political institutions will be transmitted to the most\nremote posterity without decay? A course of policy destined to witness events\nlike these cannot be benefited by a legislation which tolerates a scramble for\nappropriations that have no relation to any general system of improvement, and whose\ngood effects must of necessity be very limited...\n...If different impressions are entertained in any quarter; if it is expected that the people of\nthis country, reckless of their constitutional obligations, will prefer their local interest to\nthe principles of the Union...indeed has the world but little to hope from the example of\nfree government. When an honest observance of constitutional compacts cannot be\nobtained from communities like ours, it need not be anticipated elsewhere... and the\ndegrading truth that man is unfit for self -government [will be] admitted. And this will be\nthe case if expediency be made a rule of construction in interpreting the Constitution.\nPower in no government could desire a better shield for the insidious advances which it is\never ready to make upon the checks that are designed to restrain its action...\n2) Veto Message: Act Rechartering the Second Bank of the United States; July 10, 1832.\nWASHINGTON, July 10, 1832.\nTo the Senate.\nThe bill \"to modify and continue \" the act entitled \"An act to incorporate the subscribers\nto the Bank of the United States\" was presented to me on the 4th July instant. Having\nconsidered it with that solemn regard to the principles of the Constitution which the day\nwas calculated to inspire, and come to the conclusion that it ought not to become a law, I\nherewith return it to the Senate, in which it originated, with my objections.\nA bank of the United States is in many respects convenient for the Government and\nuseful to the people. Entertaining this opinion, and deeply impressed with the belief that\nsome of the powers and privileges possessed by the existing bank are unauthorized by the\nConstitution, subversive of the rights of the States, and dangerous to the liberties of the\npeople, I felt it my duty at an early period of my Administration to call the attention of\nCongress to the practicability of organizing an institution combining all its advantages\nand obviating these objections. I sincerely regret that in the act before me I can perceive\nnone of those modifications of the bank charter which are necessary, in my opinion, to\nmake it compatible with justice, with sound policy, or with the Constitution of our\ncountry.\n\nAndrew Jackson: Presidential Pronouncements\nThe present corporate body, denominated the president, directors, and company of the\nBank of the United States, will have existed at the time this act is intended to take effect\ntwenty years. It enjoys an exclusive privilege of banking under the authority of the\nGeneral Government, a monopoly of its favor and support, and, as a necessary\nconsequence, almost a monopoly of the foreign and domestic exchange. The powers,\nprivileges, and favors bestowed upon it in the original charter, by increasing the value of\nthe stock far above its par value, operated as a gratuity of many millions to the\nstockholders.\nAn apology may be found for the failure to guard against this result in the consideration\nthat the effect of the original act of incorporation could not be certainly foreseen at the\ntime of its passage. The act before me proposes another gratuity to the holders of the\nsame stock, and in many cases to the same men, of at least seven millions more. This\ndonation finds no apology in any uncertainty as to the effect of the act. On all hands it is\nconceded that its passage will increase at least so or 30 per cent more the market price of\nthe stock, subject to the payment of the annuity of $200,000 per year secured by the act,\nthus adding in a moment one-fourth to its par value. It is not our own citizens only who\nare to receive the bounty of our Government. More than eight millions of the stock of this\nbank are held by foreigners. By this act the American Republic proposes virtually to\nmake them a present of some millions of dollars. For these gratuities to foreigners and to\nsome of our own opulent citizens the act secures no equivalent whatever. ...\n... this act does not permit competition in the purchase of this monopoly. It seems to be\npredicated on the erroneous idea that the present stockholders have a prescriptive right\nnot only to the favor but to the bounty of Government. It appears that more than a fourth\npart of the stock is held by foreigners and the residue is held by a few hundred of our own\ncitizens, chiefly of the richest class. For their benefit does this act exclude the whole\nAmerican people from competition in the purchase of this monopoly and dispose of it for\nmany millions less than it is worth. This seems the less excusable because some of our\ncitizens not now stockholders petitioned that the door of competition might be opened,\nand offered to take a charter on terms much more favorable to the Government and\ncountry.\nBut this proposition, although made by men whose aggregate wealth is believed to be\nequal to all the private stock in the existing bank, has been set aside, and the bounty of\nour Government is proposed to be again bestowed on the few who have been fortunate\nenough to secure the stock and at this moment wield the power of the existing institution.\nI can not perceive the justice or policy of this course. If our Government must sell\nmonopolies, it would seem to be its duty to take nothing less than their full value, and if\ngratuities must be made once in fifteen or twenty years let them not be bestowed on the\nsubjects of a foreign government nor upon a designated and favored class of men in our\nown country. It is but justice and good policy, as far as the nature of the case will admit,\nto confine our favors to our own fellow-citizens, and let each in his turn enjoy an\nopportunity to profit by our bounty. In the bearings of the act before me upon these points\nI find ample reasons why it should not become a law. ...\n\nAndrew Jackson: Presidential Pronouncements\nBy documents submitted to Congress at the present session it appears that on the 1st of\nJanuary, 1832, of the twenty-eight millions of private stock in the corporation,\n$8,405,500 were held by foreigners, mostly of Great Britain. The amount of stock held in\nthe nine Western and Southwestern States is $140,200, and in the four Southern States is\n$5,623,100, and in the Middle and Eastern States is about $13,522,000. The profits of the\nbank in 1831, as shown in a statement to Congress, were about $3,455,598; of this there\naccrued in the nine western States about $1,640,048; in the four Southern States about\n$352,507, and in the Middle and Eastern States about $1,463,041. As little stock is held\nin the West, it is obvious that the debt of the people in that section to the bank is\nprincipally a debt to the Eastern and foreign stockholders; that the interest they pay upon\nit is carried into the Eastern States and into Europe, and that it is a burden upon their\nindustry and a drain of their currency, which no country can bear without inconvenience\nand occasional distress. To meet this burden and equalize the exchange operations of the\nbank, the amount of specie drawn from those States through its branches within the last\ntwo years, as shown by its official reports, was about $6,000,000. More than half a\nmillion of this amount does not stop in the Eastern States, but passes on to Europe to pay\nthe dividends of the foreign stockholders. In the principle of taxation recognized by this\nact the Western States find no adequate compensation for this perpetual burden on their\nindustry and drain of their currency....\nIn another of its bearings this provision is fraught with danger. Of the twenty-five\ndirectors of this bank five are chosen by the Government and twenty by the citizen\nstockholders. From all voice in these elections the foreign stockholders are excluded by\nthe charter. In proportion, therefore, as the stock is transferred to foreign holders the\nextent of suffrage in the choice of directors is curtailed. Already is almost a third of the\nstock in foreign hands and not represented in elections. It is constantly passing out of the\ncountry, and this act will accelerate its departure. The entire control of the institution\nwould necessarily fall into the hands of a few citizen stockholders, and the ease with\nwhich the object would be accomplished would be a temptation to designing men to\nsecure that control in their own hands by monopolizing the remaining stock. There is\ndanger that a president and directors would then be able to elect themselves from year to\nyear, and without responsibility or control manage the whole concerns of the bank during\nthe existence of its charter. It is easy to conceive that great evils to our country and its\ninstitutions millet flow from such a concentration of power in the hands of a few men\nirresponsible to the people.\nIs there no danger to our liberty and independence in a bank that in its nature has so little\nto bind it to our country?... Should its influence become concentered, as it may under the\noperation of such an act as this, in the hands of a self-elected directory whose interests\nare identified with those of the foreign stockholders, will there not be cause to tremble for\nthe purity of our elections in peace and for the independence of our country in war? Their\npower would be great whenever they might choose to exert it; but if this monopoly were\nregularly renewed every fifteen or twenty years on terms proposed by themselves, they\nmight seldom in peace put forth their strength to influence elections or control the affairs\nof the nation. But if any private citizen or public functionary should interpose to curtail\n\nAndrew Jackson: Presidential Pronouncements\nits powers or prevent a renewal of its privileges, it can not be doubted that he would be\nmade to feel its influence. ..\nIt is maintained by the advocates of the bank that its constitutionality in all its features\nought to be considered as settled by precedent and by the decision of the Supreme Court.\nTo this conclusion I can not assent. Mere precedent is a dangerous source of authority,\nand should not be regarded as deciding questions of constitutional power except where\nthe acquiescence of the people and the States can be considered as well settled... The\nCongress, the Executive, and the Court must each for itself be guided by its own opinion\nof the Constitution. ..Each public officer who takes an oath to support the Constitution\nswears that he will support it as he understands it, and not as it is understood by others. It\nis as much the duty of the House of Representatives, of the Senate, and of the President to\ndecide upon the constitutionality of any bill or resolution which may be presented to them\nfor passage or approval as it is of the supreme judges when it may be brought before\nthem for judicial decision. The opinion of the judges has no more authority over\nCongress than the opinion of Congress has over the judges, and on that point the\nPresident is independent of both. The authority of the Supreme Court must not, therefore,\nbe permitted to control the Congress or the Executive when acting in their legislative\ncapacities, but to have only such influence as the force of their reasoning may deserve.\nBut in the case relied upon the Supreme Court have not decided that all the features of\nthis corporation are compatible with the Constitution. It is true that the court have said\nthat the law incorporating the bank is a constitutional exercise of power by Congress; but\ntaking into view the whole opinion of the court and the reasoning by which they have\ncome to that conclusion, I understand them to have decided that inasmuch as a bank is an\nappropriate means for carrying into effect the enumerated powers of the General\nGovernment, therefore the law incorporating it is in accordance with that provision of the\nConstitution which declares that Congress shall have power \" to make all laws which\nshall be necessary and proper for carrying those powers into execution. \" ...\nThe principle here affirmed is that the \"degree of its necessity,\" involving all the details\nof a banking institution, is a question exclusively for legislative consideration. A bank is\nconstitutional, but it is the province of the Legislature to determine whether this or that\nparticular power, privilege, or exemption is \"necessary and proper\" to enable the bank to\ndischarge its duties to the Government, and from their decision there is no appeal to the\ncourts of justice. Under the decision of the Supreme Court, therefore, it is the exclusive\nprovince of Congress and the President to decide whether the particular features of this\nact are necessary and proper in order to enable the bank to perform conveniently and\nefficiently the public duties assigned to it as a fiscal agent, and therefore constitutional, or\nunnecessary and improper, and therefore unconstitutional. [Jackson then argued at\nlength that the BUS was not necessary or proper and so unconstitutional.]...\nIt is to be regretted that the rich and powerful too often bend the acts of government to\ntheir selfish purposes. Distinctions in society will always exist under every just\ngovernment. Equality of talents, of education, or of wealth can not be produced by human\ninstitutions. In the full enjoyment of the gifts of Heaven and the fruits of superior\n\nAndrew Jackson: Presidential Pronouncements\nindustry, economy, and virtue, every man is equally entitled to protection by law; but\nwhen the laws undertake to add to these natural and just advantages artificial distinctions,\nto grant titles, gratuities, and exclusive privileges, to make the rich richer and the potent\nmore powerful, the humble members of society-the farmers, mechanics, and laborers-\nwho have neither the time nor the means of securing like favors to themselves, have a\nright to complain of the injustice of their Government. There are no necessary evils in\ngovernment. Its evils exist only in its abuses. If it would confine itself to equal protection,\nand, as Heaven does its rains, shower its favors alike on the high and the low, the rich and\nthe poor, it would be an unqualified blessing. In the act before me there seems to be a\nwide and unnecessary departure from these just principles.\nNor is our Government to be maintained or our Union preserved by invasions of the\nrights and powers of the several States. In thus attempting to make our General\nGovernment strong we make it weak. Its true strength consists in leaving individuals and\nStates as much as possible to themselves-in making itself felt, not in its power, but in its\nbeneficence; not in its control, but in its protection; not in binding the States more closely\nto the center, but leaving each to move unobstructed in its proper orbit.\nExperience should teach us wisdom. Most of the difficulties our Government now\nencounters and most of the dangers which impend over our Union have sprung from an\nabandonment of the legitimate objects of Government by our national legislation, and the\nadoption of such principles as are embodied in this act. Many of our rich men have not\nbeen content with equal protection and equal benefits, but have besought us to make them\nricher by act of Congress. By attempting to gratify their desires we have in the results of\nour legislation arrayed section against section, interest against interest, and man against\nman, in a fearful commotion which threatens to shake the foundations of our Union. It is\ntime to pause in our career to review our principles, and if possible revive that devoted\npatriotism and spirit of compromise which distinguished the sages of the Revolution and\nthe fathers of our Union. If we can not at once, in justice to interests vested under\nimprovident legislation, make our Government what it ought to be, we can at least take a\nstand against all new grants of monopolies and exclusive privileges, against any\nprostitution of our Government to the advancement of the few at the expense of the\nmany, and in favor of compromise and gradual reform in our code of laws and system of\npolitical economy.\nI have now done my duty to my country. If sustained by my fellow citizens, I shall be\ngrateful and happy; if not, I shall find in the motives which impel me ample grounds for\ncontentment and peace. In the difficulties which surround us and the dangers which\nthreaten our institutions there is cause for neither dismay nor alarm. For relief and\ndeliverance let us firmly rely on that kind Providence which I am sure watches with\npeculiar care over the destinies of our Republic, and on the intelligence and wisdom of\nour countrymen. Through His abundant goodness and heir patriotic devotion our liberty\nand Union will be preserved.\nANDREW JACKSON.\n\nAndrew Jackson: Presidential Pronouncements\n3) Nullification Proclamation, December 10, 1832.\nWhereas a convention, assembled in the State of South Carolina, have passed an\nordinance, by which they declare that the several acts and parts of acts of the Congress of\nthe United States, purporting to be laws for the imposing of duties and imposts on the\nimportation of foreign commodities, and now having actual operation and effect within\nthe United States, and more especially \"two acts for the same purposes, passed on the\n29th of May, 1828, and on the 14th of July, 1832, are unauthorized by the Constitution of\nthe United States, and violate the true meaning and intent thereof, and are null and void,\nand no law,\" nor binding on the citizens of that State or its officers, and by the said\nordinance it is further declared to he unlawful for any of the constituted authorities of the\nState, or of the United States, to enforce the payment of the duties imposed by the said\nacts within the same State, and that it is the duty of the legislature to pass such laws as\nmay be necessary to give full effect to the said ordinances:\nAnd whereas, by the said ordinance it is further ordained, that, in no case of law or\nequity, decided in the courts of said State, wherein shall be drawn in question the validity\nof the said ordinance, or of the acts of the legislature that may be passed to give it effect,\nor of the said laws of the United States, no appeal shall be allowed to the Supreme Court\nof the United States, nor shall any copy of the record be permitted or allowed for that\npurpose; and that any person attempting to take such appeal, shall be punished as for a\ncontempt of court:\nAnd, finally, the said ordinance declares that the people of South Carolina will maintain\nthe said ordinance at every hazard, and that they will consider the passage of any act by\nCongress abolishing or closing the ports of the said State, or otherwise obstructing the\nfree ingress or egress of vessels to and from the said ports, or any other act of the Federal\nGovernment to coerce the State, shut up her ports, destroy or harass her commerce, or to\nenforce the said acts otherwise than through the civil tribunals of the country, as\ninconsistent with the longer continuance of South Carolina in the Union; and that the\npeople of the said State will thenceforth hold themselves absolved from all further\nobligation to maintain or preserve their political connection with the people of the other\nStates, and will forthwith proceed to organize a separate government, and do all other\nacts and things which sovereign and independent States may of right do.\nAnd whereas the said ordinance prescribes to the people of South Carolina a course of\nconduct in direct violation of their duty as citizens of the United States, contrary to the\nlaws of their country, subversive of its Constitution, and having for its object the\ninstruction of the Union-that Union, which, coeval with our political existence, led our\nfathers, without any other ties to unite them than those of patriotism and common cause,\nthrough the sanguinary struggle to a glorious independence-that sacred Union, hitherto\ninviolate, which, perfected by our happy Constitution, has brought us, by the favor of\nHeaven, to a state of prosperity at home, and high consideration abroad, rarely, if ever,\nequaled in the history of nations; to preserve this bond of our political existence from\ndestruction, to maintain inviolate this state of national honor and prosperity, and to justify\nthe confidence my fellow-citizens have reposed in me, I, Andrew Jackson, President of\n\nAndrew Jackson: Presidential Pronouncements\nthe United States, have thought proper to issue this my PROCLAMATION, stating my\nviews of the Constitution and laws applicable to the measures adopted by the Convention\nof South Carolina, and to the reasons they have put forth to sustain them, declaring the\ncourse which duty will require me to pursue, and, appealing to the understanding and\npatriotism of the people, warn them of the consequences that must inevitably result from\nan observance of the dictates of the Convention.\nStrict duty would require of me nothing more than the exercise of those powers with\nwhich I am now, or may hereafter be, invested, for preserving the Union, and for the\nexecution of the laws. But the imposing aspect which opposition has assumed in this\ncase, by clothing itself with State authority, and the deep interest which the people of the\nUnited States must all feel in preventing a resort to stronger measures, while there is a\nhope that anything will be yielded to reasoning and remonstrances, perhaps demand, and\nwill certainly justify, a full exposition to South Carolina and the nation of the views I\nentertain of this important question, as well as a distinct enunciation of the course which\nmy sense of duty will require me to pursue.\nThe ordinance is founded, not on the indefeasible right of resisting acts which are plainly\nunconstitutional, and too oppressive to be endured, but on the strange position that any\none State may not only declare an act of Congress void, but prohibit its execution--- that\nthey may do this consistently with the Constitution---that the true construction of that\ninstrument permits a State to retain its place in the Union, and yet be bound by no other\nof its laws than those it may choose to consider as constitutional. It is true they add, that\nto justify this abrogation of a law, it must be palpably contrary to the Constitution, but it\nis evident, that to give the right of resisting laws of that description, coupled with the\nuncontrolled right to decide what laws deserve that character, is to give the power of\nresisting all laws. For, as by the theory, there is no appeal, the reasons alleged by the\nState, good or bad, must prevail. If it should be said that public opinion is a sufficient\ncheck against the abuse of this power, it may be asked why it is not deemed a sufficient\nguard against the passage of an unconstitutional act by Congress. There is, however, a\nrestraint in this last case, which makes the assumed power of a State more indefensible,\nand which does not exist in the other. There are two appeals from an unconstitutional act\npassed by Congress-one to the judiciary, the other to the people and the States. There is\nno appeal from the State decision in theory; and the practical illustration shows that the\ncourts are closed against an application to review it, both judges and jurors being sworn\nto decide in its favor. But reasoning on this subject is superfluous, when our social\ncompact in express terms declares, that the laws of the United States, its Constitution, and\ntreaties made under it, are the supreme law of the land; and for greater caution adds, \"that\nthe judges in every State shall be bound thereby, anything in the Constitution or laws of\nany State to the contrary notwithstanding.\" And it may be asserted, without fear of\nrefutation, that no federative government could exist without a similar provision. Look,\nfor a moment, to the consequence. If South Carolina considers the revenue laws\nunconstitutional, and has a right to prevent their execution in the port of Charleston, there\nwould be a clear constitutional objection to their collection in every other port, and no\nrevenue could be collected anywhere; for all imposts must be equal. It is no answer to\nrepeat that an unconstitutional law is no law, so long as the question of its legality is to be\n\nAndrew Jackson: Presidential Pronouncements\ndecided by the State itself, for every law operating injuriously upon any local interest will\nbe perhaps thought, and certainly represented, as unconstitutional, and, as has been\nshown, there is no appeal.\nIf this doctrine had been established at an earlier day, the Union would have been\ndissolved in its infancy. The excise law in Pennsylvania, the embargo and non\nintercourse law in the Eastern States, the carriage tax in Virginia, were all deemed\nunconstitutional, and were more unequal in their operation than any of the laws now\ncomplained of; but, fortunately, none of those States discovered that they had the right\nnow claimed by South Carolina. The war into which we were forced, to support the\ndignity of the nation and the rights of our citizens, might have ended in defeat and\ndisgrace instead of victory and honor, if the States, who supposed it a ruinous and\nunconstitutional measure, had thought they possessed the right of nullifying the act by\nwhich it was declared, and denying supplies for its prosecution. Hardly and unequally as\nthose measures bore upon several members of the Union, to the legislatures of none did\nthis efficient and peaceable remedy, as it is called, suggest itself. The discovery of this\nimportant feature in our Constitution was reserved to the present day. To the statesmen of\nSouth Carolina belongs the invention, and upon the citizens of that State will,\nunfortunately, fall the evils of reducing it to practice.\nIf the doctrine of a State veto upon the laws of the Union carries with it internal evidence\nof its impracticable absurdity, our constitutional history will also afford abundant proof\nthat it would have been repudiated with indignation had it been proposed to form a\nfeature in our Government.\nIn our colonial state, although dependent on another power, we very early considered\nourselves as connected by common interest with each other. Leagues were formed for\ncommon defense, and before the Declaration of Independence, we were known in our\naggregate character as the United Colonies of America. That decisive and important step\nwas taken jointly. We declared ourselves a nation by a joint, not by several acts; and\nwhen the terms of our confederation were reduced to form, it was in that of a solemn\nleague of several States, by which they agreed that they would, collectively, form one\nnation, for the purpose of conducting some certain domestic concerns, and all foreign\nrelations. In the instrument forming that Union, is found an article which declares that\n\"every State shall abide by the determinations of Congress on all questions which by that\nConfederation should be submitted to them.\"\nUnder the Confederation, then, no State could legally annul a decision of the Congress, or\nrefuse to submit to its execution, but no provision was made to enforce these decisions.\nCongress made requisitions, but they were not complied with. The Government could not\noperate on individuals. They had no judiciary, no means of collecting revenue.\nBut the defects of the Confederation need not be detailed. Under its operation we could\nscarcely be called a nation. We had neither prosperity at home nor consideration abroad.\nThis state of things could not be endured, and our present happy Constitution was\nformed, but formed in vain, if this fatal doctrine prevails. It was formed for important\n\nAndrew Jackson: Presidential Pronouncements\nobjects that are announced in the preamble made in the name and by the authority of the\npeople of the United States, whose delegates framed, and whose conventions approved it.\nThe most important among these objects, that which is placed first in rank, on which all\nthe others rest, is \"to form a more perfect Union.\" Now, is it possible that, even if there\nwere no express provision giving supremacy to the Constitution and laws of the United\nStates over those of the States, it can be conceived that an Instrument made for the\npurpose of \"forming; a more perfect Union\" than that of the confederation, could be so\nconstructed by the assembled wisdom of our country as to substitute for that\nconfederation a form of government, dependent for its existence on the local interest, the\nparty spirit of a State, or of a prevailing faction in a State? Every man, of plain,\nunsophisticated understanding, who hears the question, will give such an answer as will\npreserve the Union. Metaphysical subtlety, in pursuit of an impracticable theory, could\nalone have devised one that is calculated to destroy it.\nI consider, then, the power to annul a law of the United States, assumed by one State,\nincompatible with the existence of the Union, contradicted expressly by the letter of the\nConstitution, unauthorized by its spirit, inconsistent with every principle on which It was\nfounded, and destructive of the great object for which it was formed.\nAfter this general view of the leading principle, we must examine the particular\napplication of it which is made in the ordinance.\nThe preamble rests its justification on these grounds: It assumes as a fact, that the\nobnoxious laws, although they purport to be laws for raising revenue, were in reality\nintended for the protection of manufactures, which purpose it asserts to be\nunconstitutional; that the operation of these laws is unequal, that the amount raised by\nthem is greater than is required by the wants of the Government; and, finally, that the\nproceeds are to be applied to objects unauthorized by the Constitution. These are the only\ncauses alleged to justify an open opposition to the laws of the country, and a threat of\nseceding from the Union, if any attempt should be made to enforce them. The first\nvirtually acknowledges that the law in question was passed under a power expressly\ngiven by the Constitution, to lay and collect imposts, but its constitutionality is drawn in\nquestion from the motives of those who passed it. However apparent this purpose may be\nin the present case, nothing can be more dangerous than to admit the position that an\nunconstitutional purpose, entertained by the members who assent to a law enacted under\na constitutional power, shall make that law void; for how is that purpose to be\nascertained? Who is to make the scrutiny? How often may bad purposes be falsely\nimputed? In how many cases are they concealed by false professions? In how many is no\ndeclaration of motive made? Admit this doctrine and you give to the States an\nuncontrolled right to decide, and every law may be annulled under this pretext. If,\ntherefore, the absurd and dangerous doctrine should be admitted, that a State may annul\nan unconstitutional law, or one that it deems such, it will not apply to the present case.\nThe next objection is, that the laws in question operate unequally. This objection may be\nmade with truth to every law that has been or can be passed. The wisdom of man never\n\nAndrew Jackson: Presidential Pronouncements\nyet contrived a system of taxation that would operate with perfect equality. If the unequal\noperation of a law makes it unconstitutional and if all laws of that description may be\nabrogated by any State for that cause, then, indeed, is the federal Constitution unworthy\nof the slightest effort for its preservation. We have hitherto relied on it as the perpetual\nbond of our Union. We have received it as the work of the assembled wisdom of the\nnation. We have trusted to it as to the sheet-anchor of our safety, in the stormy times of\nconflict with a foreign or domestic foe. We have looked to it with sacred awe as the\npalladium of our liberties, and with all the solemnities of religion have pledged to each\nother our lives and fortunes here, and our hopes of happiness hereafter, in its defense and\nsupport. Were we mistaken, my countrymen, in attaching this importance to the\nConstitution of our country?... Did we pledge ourselves to the support of an airy nothing-\na bubble that must be blown away by the first breath of disaffection?... Did the name of\nWashington sanction, did the States deliberately ratify, such an anomaly in the history of\nfundamental legislation?\nNo. We were not mistaken. The letter of this great instrument is free from this radical\nfault; its language directly contradicts the imputation, its spirit, its evident intent,\ncontradicts it. No, we did not err. Our Constitution does not contain the absurdity of\ngiving power to make laws, and another power to resist them. The sages, whose memory\nwill always be reverenced, have given us a practical, and, as they hoped, a permanent\nconstitutional compact. The Father of his Country did not affix his revered name to so\npalpable an absurdity. Nor did the States, when they severally ratified it, do so under the\nimpression that a veto on the laws of the United States was reserved to them, or that they\ncould exercise it by application. Search the debates in all their conventions-examine the\nspeeches of the most zealous opposers of federal authority---look at the amendments that\nwere proposed. They are all silent--not a syllable uttered, not a vote given, not a motion\nmade, to correct the explicit supremacy given to the laws of the Union over those of the\nStates, or to show that implication, as is now contended, could defeat it. No, we have not\nerred! The Constitution is still the object of our reverence, the bond of our Union, our\ndefense in danger, the source of our prosperity in peace. It shall descend, as we have\nreceived it, uncorrupted by sophistical construction to our posterity; and the sacrifices of\nlocal interest, of State prejudices, of personal animosities, that were made to bring it into\nexistence, will again be patriotically offered for its support.\nThe two remaining objections made by the ordinance to these laws are, that the sums\nintended to be raised by them are greater than are required, and that the proceeds will be\nunconstitutionally employed. The Constitution has given expressly to Congress the right\nof raising revenue, and of determining the sum the public exigencies will require. The\nStates have no control over the exercise of this right other than that which results from\nthe power of changing the representatives who abuse it, and thus procure redress.\nCongress may undoubtedly abuse this discretionary power, but the same may be said of\nothers with which they are vested. Yet the discretion must exist somewhere. The\nConstitution has given it to the representatives of all the people, checked by the\nrepresentatives of the States, and by the executive power. The South Carolina\nconstruction gives it to the legislature, or the convention of a single State, where neither\nthe people of the different States, nor the States in their separate capacity, nor the chief\n\nAndrew Jackson: Presidential Pronouncements\nmagistrate elected by the people, have any representation. Which is the most discreet\ndisposition of the power? I do not ask you, fellow-citizens, which is the constitutional\ndisposition-that instrument speaks a language not to be misunderstood. But if you were\nassembled in general convention, which would you think the safest depository of this\ndiscretionary power in the last resort?... Carry out the consequences of this right vested in\nthe different States, and you must perceive that the crisis your conduct presents at this\nday would recur whenever any law of the United States displeased any of the States, and\nthat we should soon cease to be a nation.\nThe ordinance with the same knowledge of the future that characterizes a former\nobjection, tells you that the proceeds of the tax will be unconstitutionally applied. If this\ncould be ascertained with certainty, the objection would, with more propriety, be reserved\nfor the law so applying the proceeds, but surely cannot be urged against the laws levying\nthe duty.\nThese are the allegations contained in the ordinance. Examine them seriously, my fellow-\ncitizens-judge for yourselves. I appeal to you to determine whether they are so clear, so\nconvincing, as to leave no doubt of their correctness, and even if you should come to this\nconclusion, how far they justify the reckless, destructive course which you are directed to\npursue. Review these objections and the conclusions drawn from them once more. What\nare they! Every law, then, for raising revenue, according to the South Carolina ordinance,\nmay be rightfully annulled, unless it be so framed as no law ever will or can be framed.\nCongress have a right to pass laws for raising revenue, and each State has a right to\noppose their execution-two rights directly opposed to each other; and yet is this absurdity\nsupposed to be contained in an instrument drawn for the express purpose of avoiding\ncollisions between the States and the general government, by an assembly of the most\nenlightened statesmen and purest patriots ever embodied for a similar purpose.\nIn vain have these sages declared that Congress shall have power to lay and collect taxes,\nduties, imposts, and excises-in vain have they provided that they shall have power to pass\nlaws which shall be necessary and proper to carry those powers into execution, that those\nlaws and that Constitution shall be the \"supreme law of the land; that the judges in every\nState shall be bound thereby, anything in the constitution or laws of any State to the\ncontrary notwithstanding.\" In vain have the people of the several States solemnly\nsanctioned these provisions, made them their paramount law, and individually sworn to\nsupport them whenever they were called on to execute any office.\nVain provisions! Ineffectual restrictions! Vile profanation of oaths! Miserable mockery of\nlegislation ! If a bare majority of the voters in any one State may, on a real or supposed\nknowledge of the intent with which a law has been passed, declare themselves free from\nits operation---say here it gives too little, there too much, and operates unequally---here it\nsuffers articles to be free that ought to be taxed, there it taxes those that ought to be free-\n-in this case the proceeds are intended to be applied to purposes which we do not\napprove, in that the amount raised is more than is wanted. Congress, it is true, are\ninvested by the Constitution with the right of deciding these questions according to their\nsound discretion. Congress is composed of the representatives of all the States, and of all\n\nAndrew Jackson: Presidential Pronouncements\nthe people of all the states; but WE, part of the people of one State, to whom the\nConstitution has given no power on the subject from whom it has expressly taken it\naway---we, who have solemnly agreed that this Constitution shall be our law--- we, most\nof whom have sworn to support it---we now abrogate this law, and swear, and force\nothers to swear, that it shall not be obeyed---and we do this, not because Congress have\nno right to pass such laws; this we do not allege; but because they have passed them with\nimproper views. They are unconstitutional from the motives of those who passed them,\nwhich we can never with certainty know, from their unequal operation; although it is\nimpossible from the nature of things that they should be equal-and from the disposition\nwhich we presume may be made of their proceeds, although that disposition has not been\ndeclared. This is the plain meaning of the ordinance in relation to laws which it abrogates\nfor alleged unconstitutionality.\nBut it does not stop here. It repeals, in express terms, an important part of the\nConstitution itself, and of laws passed to give it effect, which have never been alleged to\nbe unconstitutional. The Constitution declares that the judicial powers of the United\nStates extend to cases arising under the laws of the United States, and that such laws, the\nConstitution and treaties, shall be paramount to the State constitutions and laws. The\njudiciary act prescribes the mode by which the case may be brought before a court of the\nUnited States, by appeal, when a State tribunal shall decide against this provision of the\nConstitution. The ordinance declares there shall be no appeal; makes the State law\nparamount to the Constitution and laws of the United States; forces judges and jurors to\nswear that they will disregard their provisions; and even makes it penal in a suitor to\nattempt relief by appeal. It further declares that it shall not be lawful for the authorities of\nthe United States, or of that State, to enforce the payment of duties imposed by the\nrevenue laws within its limits.\nHere is a law of the United States, not even pretended to be unconstitutional, repealed by\nthe authority of a small majority of the voters of a single State. Here is a provision of the\nConstitution which is solemnly abrogated by the same authority.\nOn such expositions and reasonings, the ordinance grounds not only an assertion of the\nright to annul the laws of which it complains, but to enforce it by a threat of seceding\nfrom the Union if any attempt is made to execute them.\nThis right to secede is deduced from the nature of the Constitution, which they say is a\ncompact between sovereign States who have preserved their whole sovereignty, and\ntherefore are subject to no superior; that because they made the compact, they can break\nit when in their opinion it has been departed from by the other States. Fallacious as this\ncourse of reasoning is, it enlists State pride, and finds advocates in the honest prejudices\nof those who have not studied the nature of our government sufficiently to see the radical\nerror on which it rests.\nThe people of the United States formed the Constitution, acting through the State\nlegislatures, in making the compact, to meet and discuss its provisions, and acting in\nseparate conventions when they ratified those provisions; but the terms used in its\n\nAndrew Jackson: Presidential Pronouncements\nconstruction show it to be a government in which the people of all the States collectively\nare represented. We are ONE PEOPLE in the choice of the President and Vice President.\nHere the States have no other agency than to direct the mode in which the vote shall be\ngiven. The candidates having the majority of all the votes are chosen. The electors of a\nmajority of States may have given their votes for one candidate, and yet another may be\nchosen. The people, then, and not the States, are represented in the executive branch.\nIn the House of Representatives there is this difference, that the people of one State do\nnot, as in the case of President and Vice President, all vote for all the members, each\nState electing only its own representatives. But this creates no material distinction. When\nchosen, they are all representatives of the United States, not representatives of the\nparticular State from which they come. They are paid by the United States, not by the\nState; nor are they accountable to it for any act done in performance of their legislative\nfunctions; and however they may in practice, as it is their duty to do, consult and prefer\nthe interests of their particular constituents when they come in conflict with any other\npartial or local interest, yet it is their first and highest duty, as representatives of the\nUnited States, to promote the general good.\nThe Constitution of the United States, then, forms a government, not a league, and\nwhether it be formed by compact between the States, or in any other manner, its character\nis the same. It is a government in which ale the people are represented, which operates\ndirectly on the people individually, not upon the States; they retained all the power they\ndid not grant. But each State having expressly parted with so many powers as to\nconstitute jointly with the other States a single nation, cannot from that period possess\nany right to secede, because such secession does not break a league, but destroys the\nunity of a nation, and any injury to that unity is not only a breach which would result\nfrom the contravention of a compact, but it is an offense against the whole Union. To say\nthat any State may at pleasure secede from the Union, is to say that the United States are\nnot a nation because it would be a solecism to contend that any part of a nation might\ndissolve its connection with the other parts, to their injury or ruin, without committing\nany offense. Secession, like any other revolutionary act, may be morally justified by the\nextremity of oppression; but to call it a constitutional right, is confounding the meaning\nof terms, and can only be done through gross error, or to deceive those who are willing to\nassert a right, but would pause before they made a revolution, or incur the penalties\nconsequent upon a failure.\nBecause the Union was formed by compact, it is said the parties to that compact may,\nwhen they feel themselves aggrieved, depart from it; but it is precisely because it is a\ncompact that they cannot. A compact is an agreement or binding obligation. It may by its\nterms have a sanction or penalty for its breach, or it may not. If it contains no sanction, it\nmay be broken with no other consequence than moral guilt; if it have a sanction, then the\nbreach incurs the designated or implied penalty. A league between independent nations,\ngenerally, has no sanction other than a moral one; or if it should contain a penalty, as\nthere is no common superior, it cannot be enforced. A government, on the contrary,\nalways has a sanction, express or implied; and, in our case, it is both necessarily implied\nand expressly given. An attempt by force of arms to destroy a government is an offense,\n\nAndrew Jackson: Presidential Pronouncements\nby whatever means the constitutional compact may have been formed; and such\ngovernment has the right, by the law of self-defense, to pass acts for punishing the\noffender, unless that right is modified, restrained, or resumed by the constitutional act. In\nour system, although it is modified in the case of treason, yet authority is expressly given\nto pass all laws necessary to carry its powers into effect, and under this grant provision\nhas been made for punishing acts which obstruct the due administration of the laws.\nIt would seem superfluous to add anything to show the nature of that union which\nconnects us; but as erroneous opinions on this subject are the foundation of doctrines the\nmost destructive to our peace, I must give some further development to my views on this\nsubject. No one, fellow-citizens, has a higher reverence for the reserved rights of the\nStates than the magistrate who now addresses you. No one would make greater personal\nsacrifices, or official exertions, to defend them from violation; but equal care must be\ntaken to prevent, on their part, an improper interference with, or resumption of, the rights\nthey have vested in the nation.\nThe line has not been so distinctly drawn as to avoid doubts in some cases of the exercise\nof power. Men of the best intentions and soundest views may differ in their construction\nof some parts of the Constitution, but there are others on which dispassionate reflection\ncan leave no doubt. Of this nature appears to be the assumed right of secession. It rests, as\nwe have seen, on the alleged undivided sovereignty of the States, and on their having\nformed in this sovereign capacity a compact which is called the Constitution, from which,\nbecause they made it, they have the right to secede. Both of these positions are erroneous,\nand some of the arguments to prove them so have been anticipated.\nThe States severally have not retained their entire sovereignty. It has been shown that in\nbecoming parts of a nation, not members of a league, they surrendered many of their\nessential parts of sovereignty. The right to make treaties, declare war, levy taxes, exercise\nexclusive judicial and legislative powers, were all functions of sovereign power. The\nStates, then, for all these important purposes, were no longer sovereign. The allegiance of\ntheir citizens was transferred in the first instance to the government of the United States;\nthey became American citizens, and owed obedience to the Constitution of the United\nStates, and to laws made in conformity with the powers vested in Congress. This last\nposition has not been, and cannot be, denied. How then, can that State be said to be\nsovereign and independent whose citizens owe obedience to laws not made by it, and\nwhose magistrates are sworn to disregard those laws, when they come in conflict with\nthose passed by another? What shows conclusively that the States cannot be said to have\nreserved an undivided sovereignty, is that they expressly ceded the right to punish\ntreason-not treason against their separate power, but treason against the United States.\nTreason is an offense against sovereignty, and sovereignty must reside with the power to\npunish it. But the reserved rights of the States are not less sacred because they have for\ntheir common interest made the general government the depository of these powers. The\nunity of our political character (as has been shown for another purpose) commenced with\nits very existence. Under the royal government we had no separate character; our\nopposition to its oppression began as UNITED COLONIES. We were the UNITED\nSTATES under the Confederation, and the name was perpetuated and the Union rendered\n\nAndrew Jackson: Presidential Pronouncements\nmore perfect by the federal Constitution. In none of these stages did we consider\nourselves in any other light than as forming one nation. Treaties and alliances were made\nin the name of all. Troops were raised for the joint defense. How, then, with all these\nproofs, that under all changes of our position we had, for designated purposes and with\ndefined powers, created national governments-how is it that the most perfect of these\nseveral modes of union should now be considered as a mere league that may be dissolved\nat pleasure ? It is from an abuse of terms. Compact is used as synonymous with league,\nalthough the true term is not employed, because it would at once show the fallacy of the\nreasoning. It would not do to say that our Constitution was only a league, but it is labored\nto prove it a compact (which, in one sense, it is), and then to argue that as a league is a\ncompact, every compact between nations must, of course, be a league, and that from such\nan engagement every sovereign power has a right to recede. But it has been shown that in\nthis sense the States are not sovereign, and that even if they were, and the national\nConstitution had been formed by compact, there would be no right in any one State to\nexonerate itself from the obligation.\nSo obvious are the reasons which forbid this secession, that it is necessary only to allude\nto them. The Union was formed for the benefit of all. It was produced by mutual sacrifice\nof interest and opinions. Can those sacrifices be recalled? Can the States, who\nmagnanimously surrendered their title to the territories of the West, recall the grant? Will\nthe inhabitants of the inland States agree to pay the duties that may be imposed without\ntheir assent by those on the Atlantic or the Gulf, for their own benefit? Shall there be a\nfree port in one State, and enormous duties in another? No one believes that any right\nexists in a single State to involve all the others in these and countless other evils, contrary\nto engagements solemnly made. Everyone must see that the other States, in self-defense,\nmust oppose it at all hazards.\nThese are the alternatives that are presented by the convention: A repeal of all the acts for\nraising revenue, leaving the government without the means of support; or an\nacquiescence in the dissolution of our Union by the secession of one of its members.\nWhen the first was proposed, it was known that it could not be listened to for a moment.\nIt was known if force was applied to oppose the execution of the laws, that it must be\nrepelled by force-that Congress could not, without involving itself in disgrace and the\ncountry in ruin, accede to the proposition; and yet if this is not done in a given day, or if\nany attempt is made to execute the laws, the State is, by the ordinance, declared to be out\nof the Union. The majority of a convention assembled for the purpose have dictated these\nterms, or rather this rejection of all terms, in the name of the people of South Carolina. It\nis true that the governor of the State speaks of the submission of their grievances to a\nconvention of all the States; which, he says, they ''sincerely and anxiously seek and\ndesire.\" Yet this obvious and constitutional mode of obtaining the sense of the other\nStates on the construction of the federal compact, and amending it, if necessary, has\nnever been attempted by those who have urged the State on to this destructive measure.\nThe State might have proposed a call for a general convention to the other States, and\nCongress, if a sufficient number of them concurred, must have called it. But the first\nmagistrate of South Carolina, when he expressed a hope that \"on a review by Congress\nand the functionaries of the general government of the merits of the controversy,' such a\n\nAndrew Jackson: Presidential Pronouncements\nconvention will be accorded to them, must have known that neither Congress, nor any\nfunctionary in the general government, has authority to call such a convention, unless it\nbe demanded by two-thirds of the States. This suggestion, then, is another instance of the\nreckless inattention to the provisions of the Constitution with which this crisis has been\nmadly hurried on; or of the attempt to persuade the people that a constitutional remedy\nhas been sought and refused. If the legislature of South Carolina \"anxiously desire\" a\ngeneral convention to consider their complaints, why have they not made application for\nit in the way the Constitution points out? The assertion that they \"earnestly seek\" is\ncompletely negatived by the omission.\nThis, then, is the position in which we stand. A small majority of the citizens of one State\nin the Union have elected delegates to a State convention; that convention has ordained\nthat all the revenue laws of the United States must be repealed, or that they are no longer\na member of the Union. The governor of that State has recommended to the legislature\nthe raising of an army to carry the secession into effect, and that he may be empowered to\ngive clearances to vessels in the name of the State. No act of violent opposition to the\nlaws has yet been committed, but such a state of things is hourly apprehended, and it is\nthe intent of this instrument to PROCLAIM, not only that the duty imposed on me by the\nConstitution, '` to take care that the laws be faithfully executed,\" shall be performed to the\nextent of the powers already vested in me by law or of such others as the wisdom of\nCongress shall devise and Entrust to me for that purpose; but to warn the citizens of\nSouth Carolina, who have been deluded into an opposition to the laws, of the danger they\nwill incur by obedience to the illegal and disorganizing ordinance of the convention-to\nexhort those who have refused to support it to persevere in their determination to uphold\nthe Constitution and laws of their country, and to point out to all the perilous situation\ninto which the good people of that State have been led, and that the course they are urged\nto pursue is one of ruin and disgrace to the very State whose rights they affect to support.\nFellow-citizens of my native State ! let me not only admonish you, as the first magistrate\nof our common country, not to incur the penalty of its laws, but use the influence that a\nfather would over his children whom he saw rushing to a certain ruin. In that paternal\nlanguage, with that paternal feeling, let me tell you, my countrymen, that you are deluded\nby men who are either deceived themselves or wish to deceive you. Mark under what\npretenses you have been led on to the brink of insurrection and treason on which you\nstand! First a diminution of the value of our staple commodity, lowered by over\nproduction in other quarters and the consequent diminution in the value of your lands,\nwere the sole effect of the tariff laws. The effect of those laws was confessedly injurious,\nbut the evil was greatly exaggerated by the unfounded theory you were taught to believe,\nthat its burdens were in proportion to your exports, not to your consumption of imported\narticles. Your pride was aroused by the assertions that a submission to these laws was a\nstate of vassalage, and that resistance to them was equal, in patriotic merit, to the\nopposition our fathers offered to the oppressive laws of Great Britain. You were told that\nthis opposition might be peaceably-might be constitutionally made-that you might enjoy\nall the advantages of the Union and bear none of its burdens. Eloquent appeals to your\npassions, to your State pride, to your native courage, to your sense of real injury, were\nused to prepare you for the period when the mask which concealed the hideous features\n\nAndrew Jackson: Presidential Pronouncements\nof DISUNION should be taken off. It fell, and you were made to look with complacency\non objects which not long since you would have regarded with horror. Look back to the\narts which have brought you to this state-look forward to the consequences to which it\nmust inevitably lead! Look back to what was first told you as an inducement to enter into\nthis dangerous course. The great political truth was repeated to you that you had the\nrevolutionary right of resisting all laws that were palpably unconstitutional and\nintolerably oppressive-it was added that the right to nullify a law rested on the same\nprinciple, but that it was a peaceable remedy! This character which was given to it, made\nyou receive with too much confidence the assertions that were made of the\nunconstitutionality of the law and its oppressive effects. Mark, my fellow-citizens, that by\nthe admission of your leaders the unconstitutionality must be palpable, or it will not\njustify either resistance or nullification ! What is the meaning of the word palpable in the\nsense in which it is here used? that which is apparent to everyone, that which no man of\nordinary intellect will fail to perceive. Is the unconstitutionality of these laws of that\ndescription? Let those among your leaders who once approved and advocated the\nprinciples of protective duties, answer the question; and let them choose whether they\nwill be considered as incapable, then, of perceiving that which must have been apparent\nto every man of common understanding, or as imposing upon your confidence and\nendeavoring to mislead you now. In either case, they are unsafe guides in the perilous\npath they urge you to tread. Ponder well on this circumstance, and you will know how to\nappreciate the exaggerated language they address to you. They are not champions of\nliberty emulating the fame of our Revolutionary fathers, nor are you an oppressed people,\ncontending, as they repeat to you, against worse than colonial vassalage. You are free\nmembers of a flourishing and happy Union. There is no settled design to oppress you.\nYou have, indeed, felt the unequal operation of laws which may have been unwisely, not\nunconstitutionally passed; but that inequality must necessarily be removed. At the very\nmoment when you were madly urged on to the unfortunate course you have begun, a\nchange in public opinion has commenced. The nearly approaching payment of the public\ndebt, and the consequent necessity of a diminution of duties, had already caused a\nconsiderable reduction, and that, too, on some articles of general consumption in your\nState. The importance of this change was underrated, and you were authoritatively told\nthat no further alleviation of your burdens was to be expected, at the very time when the\ncondition of the country imperiously demanded such a modification of the duties as\nshould reduce them to a just and equitable scale. But as apprehensive of the effect of this\nchange in allaying your discontents, you were precipitated into the fearful state in which\nyou now find yourselves.\nI have urged you to look back to the means that were used to burly you on to the position\nyou have now assumed, and forward to the consequences they will produce. Something\nmore is necessary. Contemplate the condition of that country of which you still form an\nimportant part; consider its government uniting in one bond of common interest and\ngeneral protection so many different States-giving to all their inhabitants the proud title\nof AMERICAN CITIZEN---protecting their commerce-securing their literature and arts-\nfacilitating their intercommunication---defending their frontiers---and making their name\nrespected in the remotest parts of the earth! Consider the extent of its territory its\nincreasing and happy population, its advance in arts, which render life agreeable, and the\n\nAndrew Jackson: Presidential Pronouncements\nsciences which elevate the mind! See education spreading the lights of religion, morality,\nand general information into every cottage in this wide extent of our Territories and\nStates! Behold it as the asylum where the wretched and the oppressed find a refuge and\nsupport! Look on this picture of happiness and honor, and say, WE TOO, ARE\nCITIZENS OF AMERICA--Carolina is one of these proud States her arms have\ndefended-her best blood has cemented this happy Union! And then add, if you can,\nwithout horror and remorse this happy Union we will dissolve---this picture of peace and\nprosperity we will deface---this free intercourse we will interrupt--- these fertile fields we\nwill deluge with blood---the protection of that glorious flag we renounce---the very name\nof Americans we discard. And for what, mistaken men! For what do you throw away\nthese inestimable blessings-for what would you exchange your share in the advantages\nand honor of the Union? For the dream of a separate independence---a dream interrupted\nby bloody conflicts with your neighbors, and a vile dependence on a foreign power. If\nyour leaders could succeed in establishing a separation, what would be your situation?\nAre you united at home---are you free from the apprehension of civil discord, with all its\nfearful consequences? Do our neighboring republics, every day suffering some new\nrevolution or contending with some new insurrection--- do they excite your envy?\nBut the dictates of a high duty oblige me solemnly to announce that you cannot succeed.\nThe laws of the United States must be executed. I have no discretionary power on the\nsubject---my duty is emphatically pronounced in the Constitution. Those who told you\nthat you might peaceably prevent their execution, deceived you---they could not have\nbeen deceived themselves. They know that a forcible opposition could alone prevent the\nexecution of the laws, and they know that such opposition must be repelled. Their object\nis disunion, hut be not deceived by names; disunion, by armed force, is TREASON. Are\nyou really ready to incur its guilt? If you are, on the head of the instigators of the act be\nthe dreadful consequences---on their heads be the dishonor, but on yours may fall the\npunishment-on your unhappy State will inevitably fall all the evils of the conflict you\nforce upon the government of your country. It cannot accede to the mad project of\ndisunion, of which you would be the first victims-its first magistrate cannot, if he would,\navoid the performance of his duty-the consequence must be fearful for you, distressing to\nyour fellow-citizens here, and to the friends of good government throughout the world.\nIts enemies have beheld our prosperity with a vexation they could not conceal--it was a\nstanding refutation of their slavish doctrines, and they will point to our discord with the\ntriumph of malignant joy. It is yet in your power to disappoint them. There is yet time to\nshow that the descendants of the Pinckneys, the Sumpters, the Rutledges, and of the\nthousand other names which adorn the pages of your Revolutionary history, will not\nabandon that Union to support which so many of them fought and bled and died. I adjure\nyou, as you honor their memory--as you love the cause of freedom, to which they\ndedicated their lives---as you prize the peace of your country, the lives of its best citizens,\nand your own fair fame, to retrace your steps. Snatch from the archives of your State the\ndisorganizing edict of its convention-hid its members to re-assemble and promulgate the\ndecided expressions of your will to remain in the path which alone can conduct you to\nsafety, prosperity, and honor---tell them that compared to disunion, all other evils are\nlight, because that brings with it an accumulation of all-declare that you will never take\nthe field unless the star-spangled banner of your country shall float over you--that you\n\nAndrew Jackson: Presidential Pronouncements\nwill not be stigmatized when dead, and dishonored and scorned while you live, as the\nauthors of the first attack on the Constitution of your country!-its destroyers you cannot\nbe. You may disturb its peace-you may interrupt the course of its prosperity-you may\ncloud its reputation for stability- but its tranquillity will be restored, its prosperity will\nreturn, and the stain upon its national character will be transferred and remain an eternal\nblot on the memory of those who caused the disorder.\nFellow-citizens of the United States! the threat of unhallowed disunion-the names of\nthose, once respected, by whom it is uttered--the array of military force to support it-\ndenote the approach of a crisis in our affairs on which the continuance of our unexampled\nprosperity, our political existence, and perhaps that of all free governments, may depend.\nThe conjuncture demanded a free, a full, and explicit enunciation, not only of my\nintentions, but of my principles of action, and as the claim was asserted of a right by a\nState to annul the laws of the Union, and even to secede from it at pleasure, a frank\nexposition of my opinions in relation to the origin and form of our government, and the\nconstruction I give to the instrument by which it was created, seemed to be proper.\nHaving the fullest confidence in the justness of the legal and constitutional opinion of my\nduties which has been expressed, I rely with equal confidence on your undivided support\nin my determination to execute the laws-to preserve the Union by all constitutional\nmeans-to arrest, if possible, by moderate but firm measures, the necessity of a recourse to\nforce; and, if it be the will of Heaven that the recurrence of its primeval curse on man for\nthe shedding of a brother's blood should fall upon our land, that it be not called down by\nany offensive act on the part of the United States.\nFellow-citizens! the momentous case is before you. On your undivided support of your\ngovernment depends the decision of the great question it involves, whether your sacred\nUnion will be preserved, and the blessing it secures to us as one people shall be\nperpetuated. No one can doubt that the unanimity with which that decision will be\nexpressed, will he such as to inspire new confidence in republican institutions, and that\nthe prudence, the wisdom, and the courage which it will bring to their defense, will\ntransmit them unimpaired and invigorated to our children.\nMay the Great Ruler of nations grant that the signal blessings with which he has favored\nours may not, by the madness of party or personal ambition, be disregarded and lost, and\nmay His wise providence bring those who have produced this crisis to see the folly,\nbefore they feel the misery, of civil strife, and inspire a returning veneration for that\nUnion which, if we may dare to penetrate his designs, he has chosen, as the only means\nof attaining the high destinies to which we may reasonably aspire.\nIn testimony whereof, I have caused the seal of the United States to be hereunto affixed,\nhaving signed the same with my hand.\nDone at the City of Washington, this 10th day of December, in the year of our Lord one\nthousand eight hundred and thirty-two, and of the independence of the United States the\nfifty-seventh.\n\nAndrew Jackson: Presidential Pronouncements\nANDREW JACKSON.\nBy the President\nEDW. LIVINGSTON, Secretary of State.\n(1) Written by Edward Livingston.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.101 American History to 1865\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_101F10_lincoln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-101-american-history-to-1865-fall-2010/d9864e8b02942eec576c8539f96f5bf2_MIT21H_101F10_lincoln.pdf",
      "content": "--\n21.390, American History t o 1865.\nSupplementary Documents.\niii3RAHAl.I LIKCOLN ON RACE AND SLAVERY.\n1. Protest presented i n the I l l i n o i s l e g i s l a t u r e , which had passed\na s e t of resolutions deploring the r i s e of a b o l i t i o n i s t s o c i e t i e s , March 1837.\n11Resolutions upon the subject of domestic slavery having passed\nboth branches of the General Assembly a t its present session, the\nundersigned hereby p r o t e s t against the passage of the same.\nThey believe that the i n s t i t u t i o n of slavery is founded on both\ni n j u s t i c e and bad policy; but t h a t the promulgation of a b o l i t i o n\ndoctrines tends rather t o increase than t o abate i t s e v i l s .\nThey believe that the Congress of the United S t a t e s has no power, -\nunder the constitution, t o i n t e r f e r e with the i n s t i t u t i o n of slavery\ni n the d i f f e r e n t States.\nThey believe t h a t the Congress of t h e United S t a t e s h a the power,\nunder the constitution, t o abolish slavery i n the D i s t r i c t of Cclunbia;\nbut t h a t t h a t power ought not t o be exercised unless a t t h e request cf\nthe people of said D i s t r i c t .\nThe difference between these opinions and those contained i n t h e\nszid resolutions is t h e i r reason f o r entering t h i s p r o t e s t .\nDan Stone,\nA. Lincoln,\nRepresentatives f roo t h e County of Sagamon. 11\n2. Undaced fragment on Slavery.\n\"If A. can prove, however conclusively, t h a t he may, of r i g h t ,\nenslave B.---why\nmay not B. snatch the sane argument, and prove equally,\nt h a t he may enslave A.?---\nYou say A. i s white, and B. i s black.\nIt is color, then; the\nl i g h t e r , having the r i g h t t o enslave the darker? Take care.\nBy\nthis r u l e , you a r e t o be slave t o the first man you meet, with\na f a i r e r s k i n than your own.\nYou do not mean color exactly?---You\nmean the whites a r e\nintellectually the superiors of the blacks, and, therefore have t h e r i g h t\nt o enslave them? Take care again.\nBy t h i s r u l e , you a r e t o be\nslave t o t h e f i r s t man you meet, with an i n t e l l e c t superior t o your\nom.\nBut, say you, it is a question of i n t e r e s t ; and, i f you can make\ni t your i n t e r e s t , you have the r i g h t t o enslave another.\nVery well.\nAnd i f he can make it h i s i n t e r e s t , he has the r i g h t t o enslave you.\"\n3. Speech a t Peoria, I l l i n o i s , October 16, 1854.\nThe repeal of the Missouri Compromise \"is wrong i n its d i r e c t\ne f f e c t , l e t t i n g slavery i n t o Kansas and Nebraska---and\nwrong i n its\nprospective principle, allowing it t o spread t o every other part\nof t h e wide world, where men can be found inclined t o take it.\nThis declared indifference, but a s I must think, covert r e a l zeal\nf o r t h e spread of slavery, I can not but hate.\nI h a t e i t because of\n\nLincoln, p. 2\nt h e monstrous i n j u s t i c e of s l a v e r y i t s e l f . I h a t e i t because i t deprives\nour republican example of i t s j u s t i n f l u e n c e i n t h e world---enables\nt h e enemies of f r e e i n s t i t u t i o n s , with p l a u s i b i l i t y , t o t a u n t us as\nhypocrites---causes\nt h e r e a l f r i e n d s of freedom t o doubt our s i n c e r i t y , and\ne s p e c i a l l y because i t f o r c e s s o many r e a l l y good men amongst ourselves\ni n t o an open war w i t h t h e v e r y fundamental p r i n c i p l e s of c i v i l l i b e r t y\n- - - c r i t i c i z i n g\nt h e Declaration of Independence, and i n s i s t i n g t h a t\nt h e r e i s no r i g h t p r i n c i p l e of a c t i o n but s e l f - i n t e r e s t .\nBefore proceeding, l e t me say I t h i n k I have no p r e j u d i c e a g a i n s t\nt h e Southern people.\nThey a r e j u s t what we would be i n t h e i r s i t u a t i o n .\nIf s l a v e r y d i d n o t now e x i s t amongst them, they would n o t introduce it.\nI f it d i d now e x i s t amongst u s , we should n o t i n s t a n t l y g i v e it up.\nThis I b e l i e v e of t h e masses n o r t h and south....\nWhen southern people t e l l u s they are no more r e s p o n s i b l e f o r\nt h e o r i g i n of s l a v e r y , t h a t we; I acknowledge t h e f a c t .\nWhen i t\nis s a i d t h a t t h e i n s t i t u t i o n e x i s t s ; and t h a t i t is v e r y d i f f i c u l t\nt o g e t r i d of i t , i n any s a t i s f a c t o r y way, I can understand and a p p r e c i a t e\nt h e saying.\nI s u r e l y w i l l n o t blame them f o r n o t doing what I should\nn o t know how t o do myself.\nI f a l l e a r t h l y power were given me,\nI should not know what t o do, a s t o t h e e x i s t i n g i n s t i t u t i o n .\nMy f i r s t\nimpulse would be t o f r e e a l l t h e s l a v e s , and send them t o Liberia,---to\nt h e i r own n a t i v e land.\nBut a noment's r e f l e c t i o n would convince ine,\nt h a t whatever of high hope, ( a s I t h i n k t h e r e i s ) t h e r e may be i n\nt h i s , i n t h e long run, i t s sudden execution is impossible.\nI f they\nwere a l l landed t h e r e i n a day, they would a l l p e r i s h i n t h e next\nt e n days; 2nd t h e r e a r e not s u r p l u s shipping and s u r p l u s money enough\ni n t h e world t o c a r r y them t h e r e i n many tines t e n da::s.\nWhat then?\nFree them a l l , and keep then anong u s a s underlings?\nIs i t q u i t e\nc e r t a i n t h a t t h i s b e t t e r s t h e i r - o n a i t i o n ? I t h i n k I would n o t hold\ncrie in s l a v e r y , a t any r a t e ; y e t t h e p o i c t is n o t c l e a r enough f d r\nme t o denounce people upon.\nWhat next?\nF r e e them, and make them\np o l i t i c a l l y and s o c i a l l y our equals? My own f e e l i n g s would n o t admit\nof t h i s ; and i f mine would, we w e l l know t h a t t h o s e of t h e g r e a t\nm a s s of white people w i l l not.\nWhether t h i s f e e l i n g accords with\nj u s t i c e and sound judgment, is not t h e s o l e q u e s t i o n , i f indeed,\ni t is any p a r t of it. A u n i v e r s a l f e e l i n g , whether w e l l o r ill-founded,\ncan n o t be s a f e l y disregarded.\nWe can n o t , then, make them equzls,\nIt does seem t o me t h a t systems of g r a d u a l emancipation might b e\nadopted; but f o r t h e i r t a r d i n e s s i n t h i s , I w i l l n o t undertake t o\njudge our b r e t h r e n of t h e south.\nWhen they remind u s of t h e i r c o n s t i t u t i o n a l r i g h t s , I acknowledge\nthem, n o t grudgingly, b u t f u l l y , and f a i r l y ; and I would g i v e them\nany l e g i s l a t i o n f o r t h e reclaiming of t h e i r f u g i t i v e s , which should\nn o t , i n its s t r i n g e n c y , b e mcre l i k e l y t o c a r r y a f r e e man i n t o s l a v e r y ,\nthan our ordinary c r i m i n a l laws are t o hang a n innocent one.\nBut a l l t h i s , t o my judgment, f u r n i s h e s no more excuse f o r\np e r m i t t i n g s l a v e r y t o go i n t o our own f r e e t e r r i t o r y , t h a n it would\nf o r r e v i v i n g t h e African s l a v e t r a d e by law.\nThe law which f o r b i d s\nt h e bringing of s l a v e s from A f r i c a , and t h a t which has s o long f o r b i d\nt h e t a k i n g them -\nt o Nebraska, can h a r d l y be d i s t i n g u i s h e d on any\nmoral p r i n c i p l e ; and t h e r e p e a l of t h e former could f i n d q u i t e a s\np l a u s i b l e excuses a s t h a t of t h e l a t t e r . \"\n\nLincoln, p. 3\n4. To Joshua F. Speed, August 24, 1855.\nI t I am not a Know-Nothing.\nThat\ni s certain.\nHow could I be?\nHow\ncan any one who abhors t h e oppression of negroes, be i n favor of\ndegrading classes of white people? Our progress i n degeneracy appears\nt o me t o be pretty rapid.\nA s a nation, we began by declaring t h a t\n' a l l men a r e created equal.'\nWe now practically read i t ' a l l men\na r e created equal, except negroes.'\nWhen the Know-Nothings get control,\nit w i l l read ' a l l men a r e created equal, except negroes, and foreigners,\nand catholics.\"\nWhen i t comes t o t h i s I should p r e f e r emigrating\nt o some country where they make no pretence of loving liberty---to\nRussia, f o r instance, where despotism can be taken pure, and without\nthe base alloy of hypocri=y.\"\n5. Speech a t Springfield, I l l i n o i s , June 26, 1857.\n\"I think t h e authors of [ t h e Declaration of Independence] intended\nt o include\nmen, but they did not intend t o declare a l l men e q u a l %\na l l respects.\nThey did not mean t o say a l l were equal i n color, s i z e ,\ni n t e l l e c t , moral developments, or s o c i a l capacity.\nThey defined with\nt o l e r a b l e distinctness, i n what respects they did consider a l l men\ncreated equal---equal\ni n ' c e r t a i n inalienable r i g h t s , among which a r e\nl i f e , l i b e r t y , and the pursuit of happiness.'\nThis they said, and\nt h i s they meant.\nThey did not mean t o a s s e r t t h e obvious untruth,\nt h a t a l l were then actually enjoying that equality, nor y e t , that they\nwere about t o confer it immediately upon them.\nI n f a c t they had no\npower t o confer such a boon.\nThey meant simply t o d e c l a r e the r i g h t ,\nso t h a t the enforcement of it might follow a s f a s t a s circumstances\nshould p e r a i t .\nThey meant to s e t up a standard maxim f o r f r e e society,\nwhich should be familiar t o a l l , and revered by a l l ; constantly looked\nt o , constantly labored f o r , and even though never p e r f e c t l y attained,\nconstantly approximated, and thereby constantly spreading and deepening\nits influence, and augmenting the happiness and value of l i f e t o a l l\npeople of a l l colors everywhere.\nThe assertion t h a t ' a l l men a r e\ncreated equal' ...was placed i n the Declararion...for\nf u t u r e use. ..[as]\na stumbling block t o those who i n a f t e r times might seek t o t u r n a\nf r e e peopleback i n t o the hateful paths of despotism.\"\n. 6. The House Divided Speech,. June 16, 1858.\nUnder the five-year old popular sovereignty policy of t h e Kansas-\nNebraska Act, t h e slavery a g i t a t i o n \"has not only, -\nnot ceased, but has\nconstantly augmented.\nI n 9 opinion, it w i l l not cease, u n t i l a c r i s i s s h a l l have been\nreached, and passed.\n'A house divided against i t s e l f cannot stand.'\nI believe t h i s government cannot endure, permanently half slave\nand half free.\nI do not expect the Union t o be dissolved---I\ndo not expect t h e\nhouse t o fall---but\nI do expect it w i l l cease t o be divided. .\nIt w i l l become\none thing, o r a l l the other.\n-\nEither the opponents of slavery, w i l l a r r e s t t h e f u r t h e r spread\n\nLincoln, p. 4\nof i t , and place it where t h e public mind s h a l l r e s t i n t h e belief\nt h a t i t is i n course of ultimate extinction; or its advocates w i l l\npush i t forward, t i l l i t s h a l l become a l i k e lawful i n a l l the States,\n-\n-\nold a s well a s =---North\na s well a s South.\nHave w e no tendency t o the l a t t e r condition?\nLet any one who doubts, carefully contemplate t h a t now almost\ncomplete l e g a l combination---piece\nof machinery s o t o speak---compounded\nof the Nebraska doctrine, and the Dred Scott decision.\"\n7. Excerpts from the Lincoln-Douglas Debates, 1858.\nLincoln a t Ottawa (which he l a t e r described a s a b o l i t i o n i s t country):\nI1Anything that argues m e i n t o t h i s idea of perfect s o c i a l and\np o l i t i c a l equality with the negro, is but a specious and f a n t a s t i c\narrangement of words by which a man can prove a horse chestnut t o be\na chestnut horse.\n[Laughter.] I w i l l say here, while upon t h i s subject,\nt h a t I have no purpose d i r e c t l y o r i n d i r e c t l y t o i n t e r f e r e with the\ni n s t i t u t i o n of slavery i n the S t a t e s where it e x i s t s .\nI believe I\nhave no lawful r i g h t t o do so, and I have no i n c l i n a t i o n t o do so.\nI have no purpose to introduce p o l i t i c a l and s o c i a l equality between\nt h e white and the black races.\nThere is a physical difference between\nt h e two, which i n my judgment w i l l probably forever forbid t h e i r l i v i n g\ntogether upon the footing of perfect equality, and inasmuch a s it becomes\na necessity that there must be a difference, I, a s well a s Judge Douglas,\na m i n favor of having the race t o which I belong, having the superior\nposition.\nI have never s a i d anything t o the ccntrary, but I hold t h a t\nnotwithstanding a l l t h i s , there is no reason i n the world why the\nnegro is not e n t i t l e d t o a l l the natural r i g h t s enumerated i n the Declaration\nof independence, the r i g h t t o l i f e , l i b e r t y and t h e pursuit of happiness.\n[Loud cheers.] I hold that he is a s much e n t i t l e d t o these a s the white\nman.\nI agree with Judge Douglas he is not my equal i n many respects---\nc e r t a i n l y not i n color, perhaps not i n moral or i n t e l l e c t u a l endowment.\nBut i n the r i g h t t o e a t the bread, without leave of anybody e l s e ,\nwhich h i s ow: hand earns, he i s my equal and t h e equal of Judge Douglas,\nand the equal of every l i v i n g man. [Great applause.]\"\nLincoln a t Charleston, I l l i n o i s ( i n the southern p a r t of t h e s t a t e ) :\nI I I am not nor ever have been i n favor of bringing about i n any\nway t h e s o c i a l and p o l i t i c a l equality of t h e white and black races\n[applause]---that\nI am not nor ever have been i n favor of making voters\no r jurors of negroes, nor of qualifying them t o hold o f f i c e , nor t o\nintermarry with white people; and I w i l l say i n addition t o t h i s t h a t\nt h e r e is a physical difference between t h e white and black races which\nI believe w i l l f o r ever forbid the two races l i v i n g together on terns\nof s o c i a l and p o l i t i c a l equality.\nAnd inasmuch a s they cannot so live,\nwhile they do remain together there must be the position of superior\nand i n f e r i o r , and I a s much a s any other man am i n favor of having\nt h e superior position assigned t o t h e white race.\nI say upon t h i s\noccasion I do not perceive t h a t because the white man is t o have t h e\nsuperior position the negro should be denied everything.\nI do not\nunderstand that because I do not want a negro woman f o r a slave I\nmust necessarily want her f o r a wife. [Cheers and laughter.]\n.My under-\nstanding is that I can j u s t l e t her alone.\nI am now i n my f i f t e i t h\nyear and I certainly never have had a black woman f o r e i t h e r a slave\no r a wife.\nSo it seems t o me q u i t e possible f o r us t o g e t along without\nmaking e i t h e r slaves or wives of negroes.\"\n\nLincoln, p. 5\n8. To Horace Greely, Executive Mansion, Washington, August 22, 1862.\n...11I would save t h e Union.\nI would s a v e it t h e s h o r t e s t way\nunder t h e C o n s t i t u t i o n .\nThe sooner t h e n a t i o n a l a u t h o r i t y can be\nr e s t o r e d , t h e n e a r e r t h e Union w i l l be ' t h e Union a s i t was.'\nI f\nt h e r e be those who would n o t save t h e Union, u n l e s s they could a t\nt h e same time save s l a v e r y , I do n o t agree w i t h them.\nI f t h e r e be those\nwho would not save t h e Union u n l e s s they could a t t h e same t i m e d e s t r o y\ns l a v e r y , I do n o t agree w i t h them.\nMy paramount o b j e c t i n t h i s s t r u g g l e\n-\nis t o s a v e t h e Union, and is n o t e i t h e r t o save o r t o d e s t r o y slavery.\nI f I could save t h e Union without f r e e i n g any s l a v e I would do it; and\ni f I could save i t by f r e e i n g a l l t h e s l a v e s I would do i t , and i f\nI could s a v e i t by f r e e i n g some and leaving o t h e r s a l o n e I would a l s o\ndo t h a t .\nWhat I do about s l a v e r y , and t h e colored r a c e , I do because\nI b e l i e v e i t helps t o save t h e Union; and what I f o r b e a r , I f o r b e a r\nbecause I do not b e l i e v e it would h e l p t o save t h e Union.\nI s h a l l do\nless whenever I s h a l l b e l i e v e what I am doing h u r t s t h e cause, and\nI s h a l l do more whenever I s h a l l b e l i e v e doing more w i l l h e l p t h e cause.\nI s h a l l t r y t o c o r r e c t e r r o r s when shown t o b e e r r o r s ; and I s h a l l adopt\nnew views s o f a s t as they s h a l l appear t o be t r u e views.\"\n(NOTE.\nLincoln i s s u e d h i s \"preliminary\" Emancipation Proclamation on\nSeptember 22, 1862, following t h e b a t t l e of Antietam.\nH e t h e r e promised\nt o d e c l a r e s l a v e r y abolished i n a l l a r e a s s t i l l i n r e b e l l i o n on January 1,\n1863.\nThe promise was f u l f i l l e d on New Year's Day, 1863.)\n9 .\nThe Gettysburg Address.\nNovember 19, 1863.\n-\n\"Four scor? and seven years ago our f a t h e r s brought f o r t h on t h i s\nc o n t i n e n t , a new n a t i o n , conceived i n L i b e r t y , and dedicated t o t h e pro-\np o s i t i o n t h a t a l l men a r e c r e a t e d equal.\nI INow we a r e engaged i n a g r e a t c i v i l w a r , t e s t i n g whether t h a t\nn a t i o n o r any n a t i o n s o conceived and s o dedicated, can long endure.\nWe\na r e met on a g r e a t b a t t l e - f i e l d of t h a t war.\nWe have come t o dedicate a\np o r t i o n of t h a t f i e l d , as a f i n a l r e s t i n g p l a c e f o r those who here gave t h e i r\nl i v e s t h a t t h a t n a t i o n might l i v e .\nIt is a l t o g e t h e r f i t t i n g and proper\nt h a t we should do t h i s .\nI IBut, i n a l a r g e r sense, we can n o t dedicate---we\ncan n o t consecrate---\nwe can n o t hallow---this\nground.\nThe brave men, l i v i n g and dead, who\ns t r u g g l e d h e r e , have consecrated it, f a r above our poor power t o add o r\nd e t r a c t .\nThe world w i l l l i t t l e note, n o r long remember what we say h e r e ,\nb u t i t can never f o r g e t what they d i d here.\nIt is f o r us t h e l i v i n g ,\nr a t h e r , t o be dedicated h e r e t o t h e unfinished work ~ h i c h\nthey who\nfought h e r e have thus f a r s o nobly advanced.\nIt is r a t h e r f o r us t o be\nh e r e dedicated t o t h e g r e a t t a s k remaining b e f o r e us---that\nfrom these\nhonored dead w e t a k e increased devotion t o t h a t cause f o r which they gave\nt h e last f u l l measure of devotion---that\nwe h e r e h i g h l y r e s o l v e t h a t these\ndead s h a l l n o t have d i e d i n vain---that\nt h i s n a t i o n , under God, s h a l l have\na new b i r t h of freedom---and\nt h a t government of t h e people, by t h e people,\nf o r t h e people, s h a l l n o t p e r i s h from t h e earth.\"\n\n1 0 . To General James J. Wadsworth, 1864.\n\"How t o b e t t e r the condition of the colored race has long been\na study which has a t t r a c t e d my serious and c a r e f u l atcention; hence\nI think I am clear and decided a s t o what course I s h a l l pursue i n\nthe premises, regarding it a religious duty, a s t h e nation's guardian\nof these people, who have s o heroically vindicated t h e i r manhood\non the b a t t l e f i e l d , where, i n a s s i s t i n g t o save t h e l i f e of the\nRepublic, they have demonstrated i n blood t h e i r r i g h t t o the b a l l o t ,\nwhich is but a human protection of the f l a g they have so f e a r l e s s l y\ndefended.\nThe r e s t o r a t i o n of the Rebel States t o the Union must r e s t upon\nthe principle of c i v i l and p o l i t i c a l equality of both races; and i t\nmust be sealed by general amnesty.\"\nj1.. To Michael Hahn, March 13, 1864.\n\"I congratulate you on having fixed your name i n h i s t o r y a s the\nf i r s t free-state Governor of Louisiana.\nNow you a r e about t o have\na Convention which, among other things, w i l l probably define t h e\ne l e c t i v e franchise.\nI barely suggest f o r your p r i v a t e consideration,\nwhether some of the colored people may not be l e t in---as,\nf o r\ninstance, the very i n t e l l i g e n t , and especially those who have fought\ngallantly i n our ranks.\nThey would probably help, i n some trying\ntime t o come, t o keep the jewel of l i b e r t y within the family of freedom.\nBut t h i s is only a suggestion, not t o the public, but t o you alone.\"\n(Note: h i s suggestion w a s not followed.)\n12.\nSecond Inaugural Address, March 4, 1865.\n...\"[Four years ago] one eighth of the whole population were colored\nslaves, not distributed generally over t h e Union, but localized i n the\nSouthern part of\nit. These slaves constituted a peculiar and powerful\ni n t e r e s t .\nA l l knew t h a t t h i s i n t e r e s t was, somehow, t h e cause of t h e\nwar.\nTo strengthen, perpetuate, and extend t h i s i n t e r e s t was the\nobject f o r whichthe insurgents would rend the Union, even by war;\nwhile t h e government claimed no r i g h t t o do more than t o r e s t r i c t the\nt e r r i t o r i a l enlargement of it. Neither party expected f o r the war,\nthe magnitude, or t h e duration, which it has already attained.\nNeither anticipated t h a t t h e cause of t h e c o n f l i c t might cease with,\no r even before, the c o n f l i c t i t s e l f should cease.\nEach looked f o r\nan e a s i e r triuniph, and a r e s u l t l e s s fundamental and astounding.\nBothread the same Bible, and pray t o t h e same God; and each invokes\nH i s aid against the other...The prayers of both could not be answered;\nt h a t of neither has been answered f u l l y .\nThe Almightyhas H i s own\npurposes. ...I f we s h a l l suppose t h a t Ainerican Slavery is one of those\noffences which, i n the providence of God, must needs come, but which,\nhaving continued through H i s appointed time, H e now w i l l s t o remove,\nand t h a t He gives t o both North and South, t h i s t e r r i b l e w a r , as t h e\nwoe due t o those by whom the offence came, s h a l l we discern therein\nany departure from those divine a t t r i b u t e s which t h e believers i n a\nLiving God always ascribe t o Him?\nFondly do w e hope---fervently\ndo w e\npray---that\nt h i s mighty scourge of war may speedily pass away.\nYet,\n\nLincoln, p. 7\ni f God w i l l s t h a t it continue, m i t i l a l l t h e wealth piled by the bond-\nman's two hundred and f i f t y years of unrequited t o i l s h a l l be sunk,\nand u n t i l every drop of blood drawn with the l a s h , s h a l l be paid by\nanother drawn with the sword, a s was s a i d three thousand years ago,\ns o s t i l l i t must be said ' t h e judgments of the Lord, a r e t r u e and\nrighteous altogether.'\nWith malice toward none; with c h a r i t y f o r a l l ; with firmness i n\nt h e r i g h t , a s God gives us t o s e e the r i g h t , l e t us s t r i v e on t o f i n i s h\nt h e work we a r e i n ; t o bind up the n a t i o n ' s wounds; t o c a r e f o r him\nwho s h a l l have borne the b a t t l e , and f o r h i s widow, and h i s orphan---\nt o do a l l which may achieve and cherish a j u s t , and a l a s t i n g peace,\namong ourselves, and with a l l nations.\"\n1.. Lincoln's l a s t speech, April 11, 1765.\n...\"The amount of constituency...on which the new Louisiana government\nr e s t s , would be more s a t i s f a c t o r y t o a l l , i f i t contained f i f t y , t h i r t y , o r\neven twenty thousand, instead of only about twelve thousand, a s it does.\nIt\nis a l s o unsatisfactory t o some that the e l e c t i v e franchise is not given\nt o the colored man.\nI would myself prefer t h a t it were now conferred on the\nvery i n t e l l i g e n t , and on those who serve our cause a s s o l d i e r s ,\nS t i l l\nthe question is not whether the Louisiana government, a s i t stands, is\nq u i t e a l l t h a t is desirable.\nThe question is ' W i l l it be wiser t o take\ni t a s i t is, and help t o improve it; o r t o r e j e c t , and\ndisperse i t ? ' 'Can Louisiana be brought i n t o proper p r a c t i c a l r e l a t i o n\nwith t h e Union sooner by sustaining, o r by discarding her new S t a t e\nGovernment ? '\n.\n1' Some twelve thousand v o t e r s i n t h e heretofore slave-state of Louisiana\nhave sworn allegiance t o t h e Union, assumed t o be the r i g h t f u l p o l i t i c a l\npower of t h d ' s t a t e , held elections, organized a s t a t e government, adopted\na free-state constitutinn, giving the benefit of public schools equally\nt o black and white, and empowering the Legislature t o confer t h e ' e l e c t i v e\nfranchise upon the colored man.\nTheir Legislature has already voted\nt o r a t i f y the c o n s t i t u t i o n a l amendment recently passed by Congress,\nabolishing slavery throughout t h e nation.\nThese twelve thousand persons\na r e thus f u l l y committed t o t h e Union, and t o perpetual freedom i n\nt h e state---committed\nt o t h e very things,and nearly a l l t h e things t h e\nnation wants....If...we\nrecognize, and s u s t a i n t h e new government\nof Louisiana...we\nencourage the h e a r t s , and nerve the arms of the twelve\nthousand t o adhere t o t h e i r work, andargue f o r it, and p r o s e l ~ e\nf o r\nit, and f i g h t f o r it, and feed it, and grow it, and ripen it t o a complete\nsuccess. The colored man too, i n seeing a l l united f o r him, is inspired\nwith vigilance, and energy, and daring, t o t h e same end.\nGrant t h a t\nhe desires the e l e c t i v e franchise, w i l l he not a t t a i n it sooner by\nsaving t h e already advanced s t e p s toward i t , than by running backward\nover them?\nConcede t h a t t h e new government of Louisiana is only t o\nwhat it should be a s the egg is t o t h e fowl, we s h a l l sooner have\nthe fowl by hatching the egg than by smashing it?....\n\"What has been said of Louisiana w i l l apply generally t o other States.\nAnd y e t so great p e c u l i a r i t i e s p e r t a i n t o each s t a t e ; and.such\nimportant and sudden changes occur i n the same s t a t e ; and, withal,\ns o new and unprecedented is the whole case, t h a t no exclusive, and\ni n f l e x i b l e plan can s a f e l y be prescribed a s t o d e t a i l s and c o l a t t e r a l s .\nSuch exclusive, and i n f l e x i b l e plan, would s u r e l y become a new\nentanglement.\nImportant principles may, and must, be inflexible.\nI n t h e p r e s e n t 'situation' a s t h e phrase goes, it may be my duty\nt o make some new announcement t o t h e people of the South.\nI a m con-\nsidering, and s h a l l not f a i l t o a c t , when s a t i s f i e d t h a t a c t i o n w i l l\nbe proper.\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.101 American History to 1865\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}