{
  "course_name": "American Consumer Culture",
  "course_description": "This class examines how and why twentieth-century Americans came to define the “good life” through consumption, leisure, and material abundance. We will explore how such things as department stores, nationally advertised brand-name goods, mass-produced cars, and suburbs transformed the American economy, society, and politics. The course is organized both thematically and chronologically. Each period deals with a new development in the history of consumer culture. Throughout we explore both celebrations and critiques of mass consumption and abundance.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology",
    "Humanities",
    "History",
    "American History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2007, Meg Jacobs (\nPDF\n)\n\nSpring 2007, Meg Jacobs (\nPDF\n)\n\nFall 2005, Meg Jacobs (\nPDF\n)\n\nFall 2004, Meg Jacobs (\nPDF\n)\n\nFall 2001, Meg Jacobs (\nPDF\n)\n\nOverview\n\nThis class examines how and why twentieth-century Americans came to define the \"good life\" through consumption, leisure, and material abundance. We will explore how such things as department stores, nationally advertised brand-name goods, mass-produced cars, and suburbs transformed the American economy, society, and politics. The course is organized both thematically and chronologically. Each period deals with a new development in the history of consumer culture. Throughout we explore both celebrations and critiques of mass consumption and abundance.\n\nFormat and Assignments\n\nThe requirements for this class are a primary sources journal (25%), class discussion (25%) and a final research paper (50%). Throughout the semester, students will be expected to have completed the readings before class, gather primary sources, and come prepared to engage in discussion.\n\nTexts\n\nReadings will include novels and non-fiction books. All materials are available for purchase at the MIT Server:\n\nDreiser, Theodore.\nSister Carrie\n. (1900)\n\nLewis, Sinclair.\nBabbitt\n. (1922)\n\nPackard, Vance.\nStatus Seekers.\n(1959)\n\nSchlosser, Eric.\nFast Food Nation.\n(2001)\n\nWriting Help\n\nThe\nWriting and Communication Center\noffers you free professional advice from published writers about oral presentations and about all types of academic, creative, and professional writing. Go to the\nMIT Online Writing and Communication Center\nand click on the yellow sunburst. If you cannot find an open appointment slot, do not despair. There are always cancellations on the day of the appointment (sometimes as many as 15 cancellations in one day). Click on the Wait List (the blue strip that says \"\nIs the time that you want already reserved?\n\"). Whenever a cancellation occurs on that day, you will be automatically notified by email. Because several people might receive that same message, go online as soon as possible to schedule that open spot; 96% of clients who want an appointment end up with one if they use the wait list. If you still can't find an appointment, try the\nOnline Tutor\n.",
  "files": [
    {
      "category": "Resource",
      "title": "babbitt.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/f25175daf2849291699cb2fbefd27d4d_babbitt.pdf",
      "content": "Reading Questions for Sinclair Lewis, Babbitt\n\nWho is Babbitt?\n\nHow does he define himself?\n\nHow has American life changed since Sister Carrie's time?\n\nHow does he feel about his car?\n\nIs Babbitt satisfied with his life?\n\nHow does he seek greater satisfaction?\n\nWho are Babbitt's friends and what role do they play?\n\nWhat is Lewis's take on Babbitt's life?\n\nWhat is your view?"
    },
    {
      "category": "Resource",
      "title": "best.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/387a8e2593ae505a1d72486e8741c76f_best.pdf",
      "content": "Professor Jacobs\n21H.206\nFall 2007\n\nThe One Best Source\n\nNow that the tough work of figuring out your topic is\nbehind you, the fun part of going through the primary\nsources begins. When you approach your sources, keep in\nmind the questions you are interested in answering. Be\nflexible enough to allow the sources to guide you in the\nright direction, but be firm enough so that you don't start\nreading newspapers and magazines cover to cover. When you\nlook through your sources, take notes as you go. I find\nthat index cards are convenient-- you can put the date and\ncite at the top and then write down the pithy quotes that\nyou may want to use. In the end, you'll have more than you\ncan use, but that's okay.\n\nFor the \"one best source\" assignment, pick one or maybe\na couple of representative or interesting documents.\nExplain what it is, where it comes from, and how it fits\ninto your project. Make a copy of an ad, a portion of a\ncongressional hearing, etc. Keep your explanations short.\nMake sure to explain the connections between this source and\nyour thesis.\n\nTry to get as much research done in the next two weeks\nas is possible. That means at least several hours (i.e.:\ndouble-digits) of research per week. Then it will be time\nto start writing. If you are having difficulties dealing\nwith your sources, just let me know."
    },
    {
      "category": "Resource",
      "title": "bibliography.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/f73cf5d3e9e89ff4b5b21f9efdd25a4f_bibliography.pdf",
      "content": "DETAILED BIBLIOGRAPHY: Due October 16\n\nASSIGNMENT\nThis bibliography is more than just a list of books and\narticles you are building on. The purposes of this\nbackground reading and the first stage of your research are\nto refine your question and zero in on your topic. You need\nto figure out what historical problem you are trying to\nsolve and how your sources will allow you to do that.\n\nThink of this detailed bibliography as a game plan. You\nneed to list what your sources are and how you are going to\nuse them. This bibliography consists of two main parts: the\nprimary sources and the secondary readings.\n\nPRIMARY SOURCES\nThe primary sources are the documents from which you are\ngoing to write your paper and make your argument. By and\nlarge, they have to be documents produced from the time\nperiod you are writing about. There are some exceptions\nsuch as oral histories written after the fact. But mostly\nthe primary sources are historical documents. That includes\nthings like newspaper, magazine, and journal articles;\nadvertisements, commercials, and posters; movies, novels,\nand television shows; court records, government reports, and\npolitical speeches. Those are just examples.\n\nThe key is to figure out how to look at a body of source\nmaterial. You can do that at the library, local archives,\nor on-line archives. Hayden and Dewey have many primary\nsources. And many more are available electronically. Some\non-line materials you need to access through Barton's Vera\non-line catalogue. For many useful on-line sources go to\nVera and select History databases. A couple of very useful\nthings to know about are Proquest and the Readers' guide to\nperiodical literature. You can search these databases by\nvery specific entries (people, places, events, etc.)\nProquest is an on-line index of old newspapers like the New\nYork Times, The Washington Post, and the Wall Street\nJournal. The Readers Retrospective is a searchable index to\nold magazine articles. These are fantastic databases\nbecause you can research almost any topic this way provided\nyou know what you are looking for and are imaginative in\nyour searches. Many of the other electronic databases are\nalso very helpful like Lexis-Nexus. The America: History\nand Life is a database of bibliographic entries on all\naspects of American history. Another very helpful database\nis JSTOR, which contains humanities and social science\narticles and is also searchable.\n\nThere are many more sources on-line. You can use google to\nfind out about on-line collections of primary sources. And\nyou can also look at the sites that are on the MIT Server.\n\nA good place to start is with the History Matters website, which\nhas lots of links to specific websites on specific subjects.\nI have also listed some additional websites where you can\nlook at old advertisements. The sites on the MIT server\nare just an example of the many things that you can gain\naccess to on-line from museum and library collections. The\nLibrary of Congress, for example, has a ton of primary\ndocuments available on-line.\n\nSo there is no shortage of material for you to look at. The\ntrick is to focus in on a specific topic that you can become\nthe expert on. You have only fifteen pages so you cannot\nwrite about the entire history of movies; instead, you have\nto identify a specific story that you are excited to tell\nand that will in turn tell us about a particular aspect of\nconsumer culture. To tell your story, you will have to be\nable to research it.\n\nSECONDARY SOURCES\nThe secondary sources will help provide background on your\nsubject, either on the specific topic or the time period.\nThese sources (the type and the number) will range depending\non your topic. More contemporary projects will rely more\nheavily on recent newspaper and magazine articles. And for\nothers, even those from an earlier period, there are more\narticles written than books (check JSTOR). You need to do\nenough background reading so that you can talk with some\nknowledge and precision about your topic. Secondary\nmaterials can also help you fill in some of the gaps in your\nresearch. But you should plan on piecing together your\nstory mainly from primary materials.\n\n****One final note. If the Library does not have something\nyou need (primary or secondary materials), you can ask that\nthey get these items from another library through Inter-\nLibrary Loan. Also, some of the things you need might be in\noff-site storage. In either case, you will need to plan\nahead so that you can have the materials when you need them."
    },
    {
      "category": "Resource",
      "title": "carrie.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/3785763fea9c081c467fb9753d567352_carrie.pdf",
      "content": "Reading Questions for Theodore Dreisel, Sister Carrie\n\nWhat is the significance of the title?\n\nWhat does Carrie care about most?\n\nWhat motivates her?\n\nWhat role do clothes play?\n\nWhy does Carrie agree to take Drouet's money?\n\nWhat kind of arrangement do they have?\n\nWhat is appealing about Hurstwood?\n\nWhy is he a success?\n\nWhy is he a failure?\n\nHow does Carrie become successful?\n\nWhat is Dreiser's judgement of Carrie?"
    },
    {
      "category": "Resource",
      "title": "psj.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/345f48b88edfe6b36a9b998593c728de_psj.pdf",
      "content": "21H.206\nAmerican Consumer Culture\n\nCreating a Primary Source Journal\n\nCollect primary sources on five days throughout the\nsemester. Attach a one-page analysis of this primary source.\nThe journal is due on the last day of class, December 12.\nBut each time you collect a source, you should bring it to\nclass and be prepared to share it in discussion.\n\nThe purpose of this assignment is to discover your own\nprimary sources on a specific topic related to class\ndiscussion. This assignment will help you hone your\nresearch skills and enable you to think about the most\neffective way of presenting your findings. Over the course\nof the semester, you will create your own annotated\ncollection of materials and share them with your classmates.\n\nThe key is to pick a very focused topic such as a person, an\nevent, a new trend, a place, an invention, etc. You want to\nchoose something that illuminates an important historical\nchange in the history of American consumer culture. Ideally\nwhat you select will also shed light onto the broader\ncontours of American history.\n\nThink of these as a scrapbook for a historical scavenger\nhunt. It's your job to find a primary source document\n(i.e.: something old) that sheds light on the time period we\nare studying. Writing history is like doing good detective\nwork. To figure out what happened, you have to piece\ntogether clues of evidence. Rather than hunting down the\nmissing murder weapon or the revealing finger print, your\njob is to find a story or person or event that helps to\nexplain why things turned out the way they did. Your bit of\nhistorical evidence can be exactly that: just a bit. While\nevery episode might not have determined the fate of the\ntwentieth century, each should reveal something about a\nparticular historical moment. Think of the past as an\nunfolding story where individual actors and actions, big and\nsmall, shaped the course of events.\n\nWhere should you look for these clues and stories? For the\ntwentieth century, your choices are endless. The easiest\nplace to begin is in old magazines and newspapers. The MIT\nHumanities Library has many choices. To get a sense of how\neach document is the product of a specific time period, it\nis important to see it in its context. So it is best to\nhave a real hands-on experience: browse the stacks, look\nthrough old magazines, read the ads, see the fashions. To\n\nhelp give your searching expedition some focus, you might\nwant to begin by consulting the Readers' Guide to Periodical\nLiterature or the New York Times Index. Both reference\nbooks list subjects and people alphabetically, year by year.\nYou should also feel free to venture out into other sources\nsuch as old Congressional hearings, scientific and industry\ntrade journals, census and other statistical data, etc.\n\nYou can also gather your sources on-line as long as you can\nprovide detailed information about the document and where it\ncomes from. Note that many historical journals are on-line\nthrough the Barton Catalogue either through JSTOR or the\nHistory Cooperative. You should also consult the many on-\nline resources, beginning with those on the MIT Server.\nThe History Matters site is a very good place to start. In\ndoing on-line research, be sure you are relying on a\nlegitimate source.\n\nWhat do these stories or slices of the past tell us? Though\nany one document will certainly not explain everything, each\nshould provide a window into another world. It's your job\nto explain what your primary source tells us. For example,\nif it is a story about a person, figure out who the person\nwas: a public official or a private citizen, a man or\nwoman, black or white, typical or unusual, a leader or\nfollower, an outsider or an insider, a reactionary or a\nradical, etc. Try to figure out why this person or event or\nphenomenon was thought important enough at the time to\nreceive attention. Next, try to figure out what the larger\nhistorical forces were that enabled or influenced this\nperson and vice versa? Finally, place this story in the\ncontext of your other readings for the week. Does this\nstory help to explain the readings? In what ways? Does it\noffer a different viewpoint and how so? You should be able\nto get all that information across in just a brief one-page\nsynopsis.\n\nBring these to class prepared to share your evidence and\nwhat you learned with your classmates. You will want to\nanalyze these texts by explaining what is significant about\nthem. There is no single right way to do this assignment.\nThe more creative you are, the better."
    },
    {
      "category": "Resource",
      "title": "status.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/1eacb42d0329508c6c98bde86c305421_status.pdf",
      "content": "Reading Questions for Vance Packard, The Status Seekers\n\nWho are the Status Seekers?\n\nAre they happy or unhappy?\n\nWhat are the costs of status seeking?\n\nWhy do people turn to consumption to demonstrate status?\n\nHow exactly do people demonstrate status?\n\nWhat does Packard mean by \"exploiting upgrading urges?\"\n\nIn what ways were the 1950s conformist?\n\nIn what ways were they stratified?\n\nWhy did Packard write his book?\n\nWhy was it a best-seller?\n\nHow do the 1950s compare to the 1920s or to the turn of the century?"
    },
    {
      "category": "Resource",
      "title": "topics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-206-american-consumer-culture-fall-2007/1e8c59d978ed4ade6d22818203c34220_topics.pdf",
      "content": "21H.206: American Consumer Culture\nPossible topics for research paper (***note: for the most\npart, these are very general topics that you will have to\nnarrow down)\n\nDepartment Stores\nReady-to-Wear Clothes\nstreetcar suburbs\nFilene's Basement\nJohn Wanamaker\nShow windows\nKleptomania\nMail Order Catalogues\nSears Roebuck\n1893 World's Fair\nConey Island\nRevere Beach\nAmusement Parks\nNickelodians\nMacy's Thanksgiving Day Parade\nMother's Day\nCrisco\nListerine\nA & P Grocery Chain\nFood and Drug Act\nNational Consumers League\nEight Hours For What We Will\nHenry Ford\nRiver Rouge\nModel T\nFive-Dollar Day\nPlanned obsolescence\nGeneral Motors Acceptance Corporation\nInstallment Credit\nBruce Barton\nJazz Age\nClara Bow\nRadio\nFlappers\nProhibition\nHome Economics\nWorld War One Conservation\nU.S. Food Administration\nEllen Swallow Richards\nHazel Kyrk\nSelling Mrs. Consumer\nYour Money's Worth\nUnderconsumption and the Great Depression\nNew Deal Consumer Advisory Board\nOffice of Price Administration\nGI Bill of 1944\nKitchen Debate\n\nThe Feminine Mystique\nInterstate and Defense Highway Act of 1956\nLevittown\nMalls\nFather Knows Best\nTelevision from the 1950s-1970s\nLonely Crowd\nThe Affluent Society\nBeat Movement\nElvis Presley\nRalph Nader\nGas Lines of the 1970s\nStagflation\nWIN\nSecond Shift\nYuppies\nEnvironmentalism\nDownshifter\nWal-Mart\n\nA very preliminary bibliography:\n\nLawrence Glickman, Consumer Society in American History\n\nJennifer Scanlon, The Gender and Consumer Culture Reader\n\nAlfred D. Chandler, The Visible Hand: The Managerial\nRevolution in American Business\n\nDavid Hounshell, From the American System to mass\nProduction, 1800-1932\n\nWalter Friedman, Birth of a Salesman: the Transformation of\nSelling in America\n\nWilliam Leach, Land of Desire: Merchants, Power, and the\nRise of a New American Culture\n\nSusan Strasser, Satisfaction Guaranteed: The Making of the\nAmerican Mass Market\n\nRichard Tedlow, New and Improved: The Story of Mass\nMarketing in America\n\nRoland Marchand, Advertising the American Dream\n\nRuth Schwartz Cowan, More Work for Mother: the Ironies of\nHousehold Technology from the Open Hearth to the Microwave\n\nKenneth T. Jackson, Crabgrass Frontier: the Suburbanization\nof the United States\n\nLizabeth Cohen, A Consumers' Republic : The Politics of Mass\nConsumption in Postwar America\n\nThomas Frank, The Conquest of Cool : Business Culture,\nCounterculture, and the Rise of Hip Consumerism\n\nJuilet Schor: The Overspent American: Why We Want What We\nDon't Need\n\nDavid Brooks, Bobos in Paradise: The New Upper Class and How\nThey Got There"
    }
  ]
}