{
  "course_name": "American History Since 1865",
  "course_description": "This course examines the social, cultural, political, and economic history of the United States, from the Civil War to the present. It uses secondary analysis and primary documents, such as court cases, personal accounts, photographs, and films, to examine some of the key issues in the shaping of modern America, including industrialization and urbanization, immigration, the rise of a mass consumer society, the emergence of the US as a global power, and the development of civil rights activism and other major social movements.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Modern History",
    "Humanities",
    "History",
    "American History",
    "Modern History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis subject offers an introduction to the social, political, economic, and cultural history of the United States - from the end of the American Civil War to the present. Over the course of the term we will examine secondary historical accounts and primary source documents in order to better understand the major transformations that led to the development of modern America. Topics under consideration include conflict over the frontier West; immigration and industrialization; the emergence of the U.S. as a global power; the Cold War at home and abroad; Civil Rights activism and other major social movements; and the transition to a digital age. As in all\ncommunications-intensive\n(CI) subjects, students enrolled in the course will be expected to engage intensively with course materials through frequent oral and written exercises.\n\nRequired Texts\n\nTrachtenberg, Alan.\nThe Incorporation of America: Culture and Society in the Gilded Age: 25th Anniversary Edition\n. Hill and Wang, 2007. ISBN: 9780809058280. [Preview with\nGoogle Books\n]\n\nWilliams, Robert F.\nNegroes with Guns\n. Foreword by Gloria House. Introduction by Timothy B. Tyson. Wayne State University Press, 1998. ISBN: 9780814327142. [Preview with\nGoogle Books\n]\n\nAll other required readings are listed in the table in the\nReadings\nsection. Assigned readings should be completed by the beginning of the class session under which they appear, unless otherwise stated.\n\nGrading Policy\n\nACTIVITIES #\n\nPERCENTAGES\n\nParticipation\n\n25%\n\nEssay #1\n\n20%\n\nEssay #2\n\n20%\n\nFinal Paper Proposal\n\n10%\n\nFinal Paper\n\n25%\n\nFor detailed information on the essays and the final paper, see the\nAssignments\nsection.\n\nPolicies and Resources\n\nAttendance and Participation\n\nThe success of this class depends on the active participation of all students. Participation represents a substantial portion of the overall course grade, and will be evaluated in terms of preparation, engagement in large and small group discussion, active listening, and overall contributions to the class experience during the term. Needless to say, students who do not attend class sessions cannot contribute to them.\n\nWriting Assistance\n\nMIT's\nWriting and Communication Center\n(WCC) offers MIT students free one-on-one professional advice from lecturers who are published writers and experienced teachers. They offer assistance with all forms of academic, creative, and professional writing - including papers, applications, and theses. They also offer oral presentation assistance and help with English as Second Language questions (including those related to writing and grammar, pronunciation, and conversation practice).\n\nCheating and Plagiarism\n\nMIT has strict policies against plagiarism. In academic writing, it is considered plagiarism to draw any idea or any language from someone else without adequately crediting that source. It doesn't matter whether the source is a published author, a website without clear authorship, a website that sells academic papers, or another student. Taking credit for someone else's work is unacceptable in all academic situations, whether you do it intentionally or by accident. In my experience, most cases of plagiarism are not intentional, and instead arise out of confusion concerning what counts as plagiarism and how to avoid it. To protect yourself from accidentally becoming a plagiarist, and to learn more about what constitutes plagiarism, visit\nAcademic Integrity at MIT: A Handbook for Students\n.",
  "files": []
}