{
  "course_name": "American Urban History II",
  "course_description": "This is a seminar course that explores the history of selected features of the physical environment of urban America. Among the features considered are parks, cemeteries, tenements, suburbs, zoos, skyscrapers, department stores, supermarkets, and amusement parks. The course gives students experience in working with primary documentation sources through its selection of readings and class discussions. Students then have the opportunity to apply this experience by researching their own historical questions and writing a term paper.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Public Administration",
    "Urban Studies",
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Public Administration",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 2 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis is a seminar course that explores the history of selected features of the physical environment of urban America. Among the features considered are parks, cemeteries, tenements, suburbs, zoos, skyscrapers, department stores, supermarkets, and amusement parks. The course gives students experience in working with primary documentation sources through its selection of readings and class discussions. Students then have the opportunity to apply this experience by researching their own historical questions and writing a term paper.\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2011, Robert Fogelson (\nPDF\n)\n\nFall 2010, Robert Fogelson (\nPDF\n)\n\nFall 2009, Robert Fogelson (\nPDF\n)\n\nFall 2008, Robert Fogelson (\nPDF\n)\n\nFall 2004, Robert Fogelson (\nPDF\n)",
  "files": [
    {
      "category": "Resource",
      "title": "How The Sound Was “Saved” The Battle of the Oyster Bay-Rye Bridge",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-014j-american-urban-history-ii-fall-2011/c18006390a0759de9d48877efdf0c0b1_MIT11_014JF11_student.pdf",
      "content": "NY Times, 17 April 1977; pLI32\nHow The Sound Was \"Saved\"\nThe Battle of the Oyster Bay-Rye Bridge\nDecember 10, 2004\n\nHow The Sound Was 'Saved'\nThe controversy over the Oyster Bay-Rye Bridge across the Long Island Sound heralded\nthe end of an era. This missing piece in Robert Moses's vision fell pray to well financed\nopponents taking advantage of a new emphasis on the environment in the public discourse. This\nwas also an era when Moses's parkway vision was increasingly supplanted by planning for public\ntransport. Thus, it is no surprise that the fall of Robert Moses and the fall of the Oyster Bay-Rye\nBridge are intricately intertwined. As New York Governor Nelson Rockefeller conceded when\nthe battle ended, in the post-Moses era \"the people want[ed] to take a more careful look at\ndecisions which affect the face of their land.\"i\nBy the 1960s, Robert Moses was over seventy years old and had been in public service\nfor close to a half century. During that time, he presided over the construction of an impressive\narray of parks, highways, and bridges in Long Island and New York City. But Moses's power\nwas waning. Having successfully outwitted many opponents in the past, he met his match in\nNew York Governor Nelson Rockefeller.\nBoth Moses and Rockefeller were men of similar ruthlessness, using all methods at their\ndisposal to accomplish their aims. In late 1962, the two came into conflict over Moses's\ncontinued chairmanship of the State Council of Parks. At stake was the control of a 100 million\ndollar bond issue for parks recently passed by the voters; Rockefeller hoped to take credit for the\nmeasure and bolster his standing for a future presidential bid.ii Thus, in late November\nRockefeller asked Moses to resign in order to ensure \"a smooth transition from his long and\nbrilliant career.\"iii In response, Moses offered to resign from all five of his state posts, expecting\nRockefeller to backtrack. Moses had used similar threats in the past with success; thanks to the\npopularity of his park system, no Governor wanted to be \"the one to fire Bob Moses.\"iv But\n- 1 -\n\nHow The Sound Was 'Saved'\nRockefeller had called Moses's bluff.\nThese resignations left Robert\nMoses with only his three city posts: the\nmost important was the chairmanship of the\nTriborough Bridge and Tunnel Authority. It\nwas in this capacity that he announced plans\nfor a Long Island Sound crossing in 1965.\nThis bridge was the missing piece in his\nsystem of parks and parkways; it would\nprovide a natural link between the Seaford-\nOyster Bay Expressway on Long Island and\nthe Cross Westchester Expressway on the\nFigure 1: NY Times, 15 February 1965; p1\nother side of the Sound. The link would facilitate commence and industry and provide a more\nconvenient route between Westchester and Jones Beach, the crown jewel of Moses's recreation\nempire.\nOn February 15, 1965 the front page of the New York Times announced \"Moses is\nseeking bridge from L.I. to Port Chester.\"v As one of the first public mentions of the project, the\nFebruary 15 article made the $100 million bridge sound like a forgone conclusion. Moses was\nquoted as saying, \"crossing of the Long Island Sound is inevitable to meet future traffic needs for\ndirect access north and east of the city's congested core.\"vi The location of the bridge had already\nbeen chosen; a crossing of the Sound from Oyster Bay to Port Chester was said to be the only\n\"obvious and feasible\" location.vii Even the type of construction had been decided after an\n- 2 -\n\nHow The Sound Was 'Saved'\nexhaustive study; the second page of the article included an artist's rendering. But there was one\nsmall legal problem: the Triborough Authority was not authorized to operate outside of New\nYork City. Thus Moses had to make his plans public in order to get the necessary approval from\nthe state. This meant that Governor Rockefeller would play a key role as plans for the bridge\nunfolded.\nSo would the town of Oyster Bay and the city of Rye. The later immediately responded\nto Moses's plans for a new bridge. Rye officials\ndisputed his assertion that the bridge would go through\nnearby Port Chester, a town with virtually no\nshoreline, and held that it would go through their city\ninstead. In response to this argument, Peter Reidy,\none of Moses's subordinates at the Triborough agency,\nasserted that \"it is premature to even speculate whose\nbackyard we might go through.\"viii In denying that a\nfinal route for the bridge had been set in stone, Reidy\nFigure 2: NY Times, 16 February 1965; p1\nsought to sustain \"the illusion that the bridgehead in Westchester would be in Port Chester,\nmostly through a run-down area\" where there was little to no opposition to anything that would\nrevitalize the shore front.ix Thus, Reidy maintained that that the bridge would \"probably\" make a\nlandfall in Port Chester Harbor rather than nearby Manursing Island in Rye. Residents of the\nisland, among the wealthiest in Westchester county, wanted nothing to do with Moses's bridge.\nThese homeowners and other opponents strongly argued that the bridge should no go\nthrough their quiet, peaceful communities. Mayor Johnson of Rye characterized his domain as a\n- 3 -\n\nHow The Sound Was 'Saved'\n\"residential city\" and held that the bridge \"would destroy costly homes and estates as well as\nclosing important roads.\" The intersection of the Cross-Westchester Expressway with I-95 in\nRye had just been finalized a few years before. Thus many residents of Rye were opposed to\nanything that would bring even more roadways, congestion, and, traffic to their locale. On the\nother side of the Sound, Oyster Bay officials referred to the plan as \"the forerunner of the\ncomplete destruction of the suburban beauty of the North Shore.\"x\nOne outspoken critic of the bridge was William Snodgrass, the Rye city representative to\nthe Westchester county board of supervisors. Three weeks before Moses's plans were made\npublic, the Westchester county board of supervisors had voted unanimously to support the\nbridge. However, once the public was informed of the plan, Snodgrass was among the most\nvocal of opponents. He explained this apparent contradiction to the Times \"on the ground that\nthe resolution did not specify Rye as the site of the Westchester approach.\"xi\nThis was a tactic Moses had successfully used before. In the early 1920s, he hid a\nprovision inside the bill creating the State Council of Parks which allowed the 'allocation' of land\nfor parks without compensation to the owners. The legislature, believing the bill to be a routine\nmeasure, passed it unanimously. But the landfall for a bridge was harder to conceal.\nFurthermore, Moses had exhibited considerable influence in Albany as a member of Governor\nAlfred Smith's inner circle. Smith had helped Moses immensely in the park debate by casting\nopponents of parks as a \"few wealthy men\" looking to deny the beauty of Long Island to the\nxii\nmasses.\nBut Moses no longer had such strong support in Albany. Now he faced a governor\nwho had just outmaneuvered him out of all of his state jobs; when asked for comment on the\nbridge plan Rockefeller called it \"completely premature\" and said that further study was\n- 4 -\n\nHow The Sound Was 'Saved'\nxiii\nnecessary.\nDespite all of this concentrated opposition, there were still some people who supported\nthe plan, but they were nowhere near as vocal. When asked by the Times, Councilman Edmund\nA. Ocker of Oyster Bay commented, \"We have a considerable number of industrial parks in the\ncentral portion of our town which would be greatly benefited by this bridge\"xiv James F.\nMcManus, a lawyer from Farmingdale, also saw the bridge as \"a thing that would improve this\narea.\"xv These two residents were excited by the potential increase in commerce and industry an\nadditional connection to the mainland could bring to Long Island. On the other side of the\nSound, Mayor Johnson expressed the fear that these interests might lead to a \"tug of war\"\nbetween Rye and Oyster Bay.xvi As part of the mainland, Rye would not experience the same\njump in connectivity as Long Island. But while this fact led Long Island officials to take a more\ncautions approach in the early years of the dispute, opponents on both sides of the Sound were\nequally virulent in their condemnations.\nIn spite of the controversy, the Times reported at this stage of the battle that \"it has been\ngenerally agreed that a new crossing is inevitable to meet future traffic needs.\"xvii With the\nconventional wisdom echoing Moses in this regard, opponents of the bridge sought to present\nalternative routes. For example, Mr. Snodgrass proposed that one end of the bridge be placed at\nBryam Point in Connecticut rather than in Westchester. Snodgrass ostensibly made this\nsuggestion so that Connecticut could \"share in the hardships of land acquisition as well as the\nbenefits of the project.\"xviii However, such a route would undoubtedly be more complicated\npolitically because it would require cooperation and agreement between officials of two different\nstates. Thus proponents of the crossing charged that Snodgrass's purpose in making this\n- 5 -\n\nHow The Sound Was 'Saved'\nsuggestion was either to move the bridge out of his backyard or to kill it entirely.\nAnother source of contention was Moses's proposal for the Triborough authority to build\nand operate the span. Moses argued that the agency was the ideal body to do so because it had\nbuilt many successful bridges in the past and was currently running a surplus. This meant that\nthe cost of marketing Triborough bonds to pay for the project would be less than the cost of\nmarketing bonds backed by a new agency with no track record. However, under Triborough's\ncharter, the bridge would be owned by New York City once the bonds had been paid off. In\narguing against this portion of the proposal, Governor Rockefeller and other critics said it made\nno sense that a bridge in Nassau and Westchester counties should be owned by New York City.\nEven George V. McLaughlin, a member of Moses's own Triborough authority, was against this\npart of the plan; he accused Moses of abusing his position by proposing that Triborough build the\nbridge without seeking the approval of even other members of the agency.xix\nIt was McLaughlin's opposition that put the nail in the coffin of the bill to extend\nTriborough's authority. Not willing to give up, Moses presented a new plan in July of 1965. He\n\"grudgingly acknowledged\" that the only way to get legislative approval was for a new authority\nto build the bridge; thus Moses proposed that the chairman of the Triborough (himself) along\nwith one Nassau and one Westchester representative constitute this new body.xx To placate the\nwealthy residents of Manursing Island, Moses moved the proposed Rye bridgehead several miles\nto the south. Under this new route, the value of the property in Rye that would need to be seized\nfor a bridge was cut from $6 million to $3 million.xxi\nMoses's revised proposal failed to quiet opponents; it \"merely transferred the heated\nopposition from one group of residents to another.\"xxii Three days later, a New York advertising\n- 6 -\n\nHow The Sound Was 'Saved'\nexecutive who had lived in Rye for nearly sixty years commented that he \"had never before seen\nthe community so unanimous.\"xxiii Emboldened by such strong support for his position, Mayor\nJohnson declared that Moses's concessions meant that the bridge plan was all but dead.\nBut the plan was far from dead. In a December meeting to discuss the proposal, Moses\nannounced that he would in fact not need to destroy any houses at all. Instead, he would use\nPlayland Amusement Park for the Westchester county landfall. As the property was in the\nprocess of being refurbished anyway, Moses argued that allocating a small portion for the bridge\nwould greatly contribute to the redevelopment of the remainder of the land.xxiv\nHowever, despite this surprise move, Westchester and Oyster Bay officials geared up for\na fight in the state legislature. They decried the bridge as \"unnecessary, unwanted, and fiscally\nimpossible.\"xxv In order to prove the first contention, they commissioned a report that showed\nthat only 4 percent of the traffic from three existing bridges would be diverted; in addition to the\nWhitestone and Throgs Neck, the Triborough was included in this figure despite the fact that the\nlater bridge was an unlikely route for Long Island to Connecticut traffic.xxvi Mayor Johnson\nnoted that Moses seemed to be the only one actively supporting the bridge and derided him for\nhaving an \"egotistical notion of his exclusive talents.\"xxvii Finally, they argued that the\nTriborough authority's good bond rating could not carry over to a new authority simply by\nimporting Moses to that authority; thus the bridge would be too expensive. This charge was\nmade despite that fact that some of the very same bridge opponents had previously argued for\nmodifications to the plan which would make it even more expensive or unfeasible. The suburban\ncommunities of Rye and Oyster Bay were doing all that they could to preserve what they saw as\ntheir home and identity.\n- 7 -\n\nHow The Sound Was 'Saved'\nBut in 1966, Robert Moses had problems of his own. The new mayor of New York was\nan idealist; John Lindsay had campaigned on the promise to end the Moses-style way of doing\nthings once and for all. The Oyster Bay-Rye bridge all but disappeared from the headlines in\n1966 as Moses focused his energy on defeating Lindsay's transportation merger plans. As an\nadvocate of public transportation, Lindsay wanted to merge Moses's Triborough authority which\nwas running large surpluses with the Transit Authority which was running large deficits. The\nchair of the new authority, who would be more closely tied to the mayor, would be able to use\nTriborough money to advance Lindsay's mass transit goals. Lindsay thought that since both\nagencies he wanted to merge served the city, he could accomplish this easily; instead, he wound\nup with a nasty political fight in Albany. Moses, lined up all of his allies in the state capitol who\naccused Mayor Lindsay of \"trying to destroy confidence in Triborough bonds; trying to put all\ntransportation under the thumb of city hall; and trying to halt highway and bridge progress\ngenerally.\" xxviii Noticeably absent from the controversy was Governor Rockefeller who had\nearlier expressed support for Lindsay's plans.\nMeanwhile, public opinion had turned against Moses. In a strong editorial, The Times\nblamed \"chicanery by it's opponents in City Hall and Albany\" for the defeat of the transportation\nxxix\nmerger.\nAnother opinion piece referred to the \"Moses Problem.\" Rockefeller, sensing the\npublic mood, moved in to take control of the situation. While Lindsay's bill was stuck in\ncommittee, Rockefeller was making transportation plans of his own. Instead of unifying only\ntwo agencies, his plan would create one umbrella group for the entire metropolitan transportation\napparatus. This new Metropolitan Transportation Authority (MTA) would be headed by his own\nman: Dr. William J. Ronan.\n- 8 -\n\nHow The Sound Was 'Saved'\n\"Bill Ronan is going to have so much power under Rockefeller's transportation plan that\nBob Moses will look like a schoolboy with a small allowance,\" one politician commented on the\nmerger.xxx However, despite Ronan's proposed control of the Triborough, these powers spilled\nover into in an area that Moses had never been a fan of: mass transportation. Moses was a\nbuilder; his projects were automobile-centric and meant to stand as part of the infrastructure for\ngenerations. By contrast, Ronan was an academic; as a close aide of Governor Rockefeller he\nrose to prominence as head of the state takeover of the Long Island Rail Road (LIRR). Thus his\ntenure as head of the MTA would not be characterized by controversy over many large-scale\npublic works; instead, he was most identified with disputes over subway and LIRR fare increases\nin the years that followed.xxxi\nBut in 1967 Moses still had a card left in his hand that had the potential to derail this shift\nof power to mass transit. Rockefeller's plan would be financed by a $2.5 billion dollar bond\nissue that needed the approval of the voters. To sell the plan to upstate voters who would not\nderive any significant benefit from the new authority, Governor Rockefeller maintained that\nTriborough surpluses would free the state from worrying about mass transit deficits. However,\nputting pen to paper, Moses found that not only was this claim false, but the bond issue would\ncost taxpayers $1 billion in interest alone.xxxii\nOn March 9, 1967 Moses, about to release his numbers to the press, had one last meeting\nwith the Governor. No one knows precisely what was said, but Moses, who came in as a staunch\nopponent of the plan, came out as a strong supporter. The public reason for this change of heart\nwas that Moses was \"won over by Rockefeller's assurance on safeguards for Triborough\nbonds.\"xxxiii However, two other reasons seem more likely. One idea was that Rockefeller\n- 9 -\n\nHow The Sound Was 'Saved'\npromised Moses a seat on the MTA board; thus, Moses would still have power under the new\nsetup. The second held that Rockefeller gave Moses his support for the Oyster Bay-Rye Bridge.\nLess than two weeks after Moses's pledge of support for the MTA, Governor Rockefeller\nannounced that he was in favor of the immediate construction of the Oyster Bay-Rye Bridge and\nthe investigation of a second span from Port Jefferson to Bridgeport,\nConnecticut. In arguing for the bridge, the Governor held that \"Long\nIsland, with its growth, must get an independent passing out to\nConnecticut without going through New York.\"xxxiv This assertion,\ncontained in a report just submitted to the Governor by Dr. Ronan, put\na new spin on Moses's previous justifications. While Moses had\nsimply warned of unimaginable traffic on the East River bridges,\nFigure 3: NY Times, 23\nRockefeller's argument sought to spin the bridge as a positive\nMarch 1967; p1\nimprovement for Long Island. At the same time, he acknowledged opposition by stating, \"I'm\naware of the fact that nobody wants any more bridges, roads, or anything built in their area.\"xxxv\nHowever, legislators from Nassau and Westchester agreed only with the later sentiment.\nFaced with the possibility that they would derail his transportation merger over the bridge\ncontroversy, Rockefeller agreed to tone down the legislation. Instead of calling for construction\nto begin immediately on the Oyster Bay-Rye link, the bills merely authorized the MTA to build\nboth that bridge and the one from Port Jefferson at some later date.xxxvi\nThus the bond issue passed and the MTA merger went through. On March 1, 1968 when\nthe MTA formally took over the transportation network, it was reveled that Moses was not on the\nagency's board. Instead, he was offered a position as a consultant with no decision-making\n- 10 -\n\nHow The Sound Was 'Saved'\npower. From Moses's meager public statement, \"The Metropolitan Transportation Authority has\noffered me an advisory part in the metropolitan transportation enterprise and I have accepted,\" it\nis clear that he expected something more.xxxvii Rockefeller had outwitted him again, and this time\nhe had no positions of power left. All that remained was a hope that the Governor would allow\nhim to build what he called \"a fetish with me, my obsession\"--the Rye-Oyster Bay bridge.xxxviii\nBut six months after the merger, the city of Rye sued seeking to block the bridge. The\nnew mayor of Rye, Edmund C. Grainger held that the law authorizing the bridge was illegal\nunder \"log-rolling\" prohibitions of the state constitution. This provision outlawed \"the passage\nof a legislative 'package' of various miscellaneous measures, often of a local nature, in which\nenactment results from the mutual exchange of backing from legislators who support respective\nparts thereof.\"xxxix The suit held that Rockefeller's 2.5 million dollar transportation program\nwhich included the bridge authorization and created the MTA was in violation of this provision.\nAs any ruling against the bridge on these grounds could have potential far-reaching effects on\nother parts of the state transportation apparatus, this lawsuit showed how far opponents of the\nbridge were willing to go to derail it.\nWhile this lawsuit was pending, J. Brunch McMorann, the State Transportation\nCommissioner, announced that the Oyster Bay-Rye bridge was going forward. Construction was\nslated to begin immediately following the necessary public hearings in early 1969. The favored\nroute would closely follow the one originally proposed by Moses, although that was subject to\nchange following the hearings. In Rye, this meant the bridge would pass through the estates on\nManursing Island; in Oyster Bay over 200 homes would have to be demolished to make way for\nthe bridge approach.xl\n- 11 -\n\nHow The Sound Was 'Saved'\nOpposition, reignited by Rockefeller's announcement the year before, went into full\nswing with this latest development. Again, Rye took a leading role. Mayor Grainger remained\nhopeful that \"the fact that the state appears to be moving ahead will prompt Rye citizens to raise\nadditional funds to fight the bridge.\"xli Residents of Manursing Island did not move out despite\nthe growing specter of demolition. Bridge critics became even more vocal and caustic. In a\nletter to the editor of The Times Helen Z. Lippincott of Rye denounced the appointed state\nofficial in charge of the bridge as having \"the gall to ask Rye if we would prefer to have our town\ncarved up sideways or down the middle.\"xlii Unlike five years earlier when even critics had\nacknowledged that some kind of crossing was inevitable to meet traffic needs, this letter made a\npoint to say \"we have been given no justification whatsoever.\"xliii Opponents of the bridge had\ndug in.\nAll of the vitriol spit at the state for going ahead with the bridge has it's affect on public\nopinion. The editorial board of the Times, which had responded to Moses original plan with a\ncall for more study and a statewide agency to build the crossing, had now swung toward bridge\nopponents. In concluding that the case for the bridge was 'not proven,' The Times cited a study\nconducted by the city of Rye that maintained that only 2.2 percent of the traffic from the\nWhitestone Bridge and only 11.1 percent of the vehicles from the Throgs Neck Bridge would\nmake use of the Sound crossing.xliv While these numbers alone added up to a higher percentage\nthan the 4 percent figure for three bridges from the original fight, they suggested to the Times\nthat a bridge was not yet necessary.\nBut the state also had numbers to support its position. Their engineering report did not\nlook into how much traffic would be diverted, but instead purported to show that the bridge\n- 12 -\n\nHow The Sound Was 'Saved'\nFigure 4: Response of boatmen to bridge details released by the MTA in December 1972; All clearances would be\n25 feet high except at two points. NY Times, 25 February 1973; p87\nwould be financially self-sustaining and save people time. They estimated that net revenues\nwould be $10.1 million after the first year with a $1 toll for cars. As for time, the average user\nwould save a half hour of driving. While both Rye's figures and those from the state report may\nbe equally valid, each side of the dispute framed the numbers in the way it believed best\nsupported its view.\nDuring this period, bridge opponents argued with increasing frequency that the bridge\nwould damage the environmental and recreational aspects of the Sound. For example,\nLippincott's letter decried \"the destruction of conservation, recreation, and aesthetic values of the\nSound.\"xlv Environmentalists held that dumping steel into the Sound would do irreversible harm\nto the plants and animals that called it home. Boatmen alleged that the limited underpasses\nwould force sailboats into the shipping lanes; their fears are best illustrated by the cartoon in\nfigure 4. These two groups sometimes advocated a tunnel rather than a bridge citing the success\n- 13 -\n\nHow The Sound Was 'Saved'\nof the recent Chesapeake Bay crossing and calling the increased cost \"a small price to pay\" for\nthe preservation of the Sound.xlvi In response to one such petition in early 1968, Moses\ndenounced its proponents as \"aristocratic sportsman\" and their proposal as \"a contrived bit of\nheavy handed social satire\" in a deteriorating economy.xlvii But environmental concerns were\nmore important in the late 1960s and early 1970s than they had been when Moses had first come\nto power. These kinds of arguments were used with greater and greater success both by\nopponents genuinely concerned about the environment and by opponents who took advantage of\nthe mood of the day. \"Do not dwell on private clubs and or houses affected by the bridge,\" read\none group's strategy memo in early 1973; by contrast, early critics in 1965 focused mainly on\nharm to residential neighborhoods.xlviii This exploitation of environmental concerns was a key\nfactor in the defeat of the Oyster Bay-Rye Bridge.\nAn excellent example of this strategy is the gift from the town of Oyster Bay to the\nDepartment of the Interior in late 1968. The state's announcement of the near-final route\nprompted the town to donate 3100 aces in the bridge's path to the federal government as a\nwildlife reserve for the expressed purpose of putting up another barrier to construction.xlix Now,\nthe state could no longer use this land for the bridge without the permission of Washington. To\nensure that this would never happen, the gift included a provision that if the Interior department\nallowed encroachments on the preserve, the property would revert back to the town. Not only\nwere no homes affected by the gift, but the new sanctuary was entirely underwater!\nWhile this sneaky action by Oyster Bay was reported in a four paragraph article on page\nninety-four of the Times, the Rye lawsuit continued to be the skirmish of the day. On January\nrd, 1969, State Supreme Court Justice Samuel M. Gold issued an injunction against the hearings\n- 14 -\n\nHow The Sound Was 'Saved'\nin Rye and Oyster Bay. One month later, he found that the bridge was unconstitutional because\nthe MTA had no authority to build bridges according to the law that created the agency in 1965,\nbefore the merger with Triborough. Gold ruled that such a project would thus require an\nadditional act of the legislature.l\nBut unfortunately for bridge opponents, the state Court of\nAppeals did not agree. By a 4-3 decision, it reversed Gold's ruling in late April. It is interesting\nto note that a statement released by MTA chairman Ronan did not focus on the bridge; he instead\nframed the case as one of \"basic questions regarding the powers of the Metropolitan\nTransportation Authority and the constitutionality of the law creating it.\"li Clearly, the bridge\nwas a hot topic for state officials to touch. Local officials had it worse; in the 1969 election an\nincumbent Republican town board member on Long Island who expressed support for the\ncrossing was not only defeated, but was actually burned in effigy.lii By this time the debate was\nso vitriolic that even through the Court of Appeals had given the go ahead for hearings in April\nof 1969, they were postponed until after the November 1970 election in which Rockefeller was\nseeking another term.\nNo help was to come from Connecticut. In June of 1969, plans for the second crossing\nfrom Port Jefferson to Bridgeport proposed by Governor Rockefeller suffered a setback in the\nConnecticut House. The bill, identical to one that had already become law in New York, would\nhave set up a bistate eight member commission to begin planning the span. This bridge was\nstrongly supported by Suffolk County Executive H. Lee Dennison who maintained that the\nOyster Bay-Rye Bridge was too far west to help with his county's transportation problems.\nHowever, the Connecticut legislature thought differently; one member explained to the Times\nthat \"the thinking was that it [the bridge] would not be of any benefit to Connecticut, only to\n- 15 -\n\nHow The Sound Was 'Saved'\nNew York.\"liii The new access point for Long Island trucks to the mainland, they feared, would\nbring increased traffic to Connecticut and might even necessitate widening of major roads in the\nstate.\nMeanwhile, Governor Rockefeller, fearing for his reelection, issued another concession to\ncritics of the Oyster Bay span. The hearings were postponed indefinitely in favor of a new all-\ninclusive study of transportation across the Long Island Sound. Rockefeller billed the study as a\nway to \"determine once and for all the transit needs of these areas\" bordered by the Sound.liv\nOpponents of the bridge agreed; Assemblyman Joesph M. Reilly of Glen Cove asserted that \"a\ngood long comprehensive study is the thing that is needed.\"lv One might wonder from his choice\nof wording if he wanted the study to go on indefinitely.\nThis concession by Governor Rockefeller points out an important political difference\nbetween Rockefeller advocating for the bridge as Governor and Moses advocating for the bridge\nas the head of an authority. In theory, an authority such as as Moses's Triborough should be able\nto put broad regional interests ahead of narrow provincial ones, removing a measure of political\npressure from public improvements. For example, it would hardly benefit anyone if a bridge was\nleft unfinished because a new mayor or governor who had been bitterly opposed to its\nconstruction came into office just as the project was about to be completed. When an authority\nwas commissioned to build the same bridge, it should in theory run the project like a business\nuntil all the bonds were paid, at which point the bridge would revert back to city or state control.\nHowever, not every element of the theory held in practice; Moses, for example, was often most\nconcerned with amassing power and implementing his master plan of parks, bridges, and\nhighways. In order to defeat the sunset clause, Moses had sunk a provision into Triborough's\n- 16 -\n\nHow The Sound Was 'Saved'\ncharter that allowed him to issue new bonds when the old ones were about to expire. Thus, as a\npowerful independent chairman who was not directly responsible to the voters, Moses in his\nheyday had been able steamroll and demonize opposition, move quickly to make his vision a\nreality, and then gain public support by showing how wonderful the final product was. But now\nwith Moses out of power, Rockefeller was the chief public advocate of the bridge. Indicative of\nthis shift, a rendering of the bridge in the Times now carried the caption \"proposed by Governor\nRockefeller.\"lvi On one hand this change meant that critics of the bridge were more likely to have\ntheir voices heard. On the other hand, this meant that plans for the bridge would proceed on a\npolitical schedule.\nBridge opponents also recognized the potential political impact of the bridge as they\nmobilized for the 1970 election. In order to cast their position in a favorable light they organized\nthe \"Committee to Save Long Island Sound,\" thus taking advantage of the prevailing\nenvironmental wind and painting bridge proponents as out to destroy the Sound. The committee\nwas headed by Mayor Grainger from Rye and Martin Victor from the Nassau Civic Association.\nThey distributed petitions urging fellow opponents to \"write, yell, complain, vote, cause a\ncommotion\" in order to elect candidates who opposed construction of the bridge.lvii In a clever\nmove, the committee sent ballots to all candidates for state elective office asking them to indicate\ntheir stance on the issue. In the face of such intense political pressure, it is not surprising that\nonly one candidate publicly indicated opposition to a proposed resolution repealing the MTA's\nauthorization to build the bridge. Out of the 575 ballots sent, the tally as of October 17th was 134\nin favor, 1 against, and 3 uncommitted.lviii\nThe opposition was so politically outspoken that they succeeded in getting the bill to\n- 17 -\n\nHow The Sound Was 'Saved'\nrepeal the bridge authorization out of committee the following year. The measure passed\noverwhelmingly: 136 to 9 in the Assembly and 49 to 4 in the Senate.lix But Governor\nRockefeller had other plans; he vetoed the bill, urging legislatures to wait until the completion of\nhis study before taking any action. But not even the Governor's political clout could stop an\nattempt to override his veto; although the measure came up seven votes shy of the required two-\nthirds majority, Rockefeller was becoming increasing isolated in his advocacy of the bridge. The\nTimes editorial board had moved from sympathy to outright opposition. In commenting on the\nrecent legislative action, it held that the bridge would turn communities on both sides of the\nSound \"into fume-filled shrines to the automotive god.\"lx\nWhy had the situation changed so drastically? While the response to Robert Moses's\noriginal proposal had drawn the most irate opposition from Rye, the plans for the bridge were\nnow the subject of equal vitriol in Oyster Bay and were being pummeled in the court of public\nopinion. Not only did bridge opponents use every political weapon at their disposal as already\ndescribed, but they had the economic resources to do so. The areas through which the bridge\nwas expected to redirect traffic were home to predominately upper middle class and wealthy\nsuburbanites. In Long Island alone, three major county clubs stood along the right of way.lxi Not\nonly were there expensive homes on Manursing Island on the Westchester side, but the vicinity\nof the proposed bridge in Oyster Bay was also a prime location for many upper class estates. In\nother words, opposition to the bridge came from the section of society most skilled in organizing\npolitical campaigns. Some residents of Oyster Bay were among the wealthiest families in the\ncountry; for example, Governor Rockefeller's sister had a home in the affected Long Island area\nand was rumored to have contributed to a fund opposing the bridge. By 1971, this well-\n- 18 -\n\nHow The Sound Was 'Saved'\norganized and well-financed opposition was successful in making it seem as if Rockefeller was\nthe only one who wanted the structure built.\nHowever, this portrayal was not entirely accurate. Labor and business interests also saw\nthe bridge in a favorable light. These proponents held that the giant public works project would\nnot only provide jobs but would do much to strengthen the local economy. The new outlet for\nLong Island's goods, they argued, would cause freight rates to drop. However, since proponents\ndid not generally see the bridge as crucial to their livelihood, their voices were drowned out by\nopponents during the period in which it seemed that the project was most likely to begin. As one\noutnumbered advocate of the bridge in Rye put it, opponents behaved \"much as a virgin about to\nbe raped.\"lxii\nMeanwhile, the study that Rockefeller commissioned prior to the 1970 election was\nreleased to the public in January of 1972. It analyzed eight possible crossings for their financial\ncost and economic, environmental, and community impacts. The final report concluded that\n\"higher travel costs, greater travel times, unnecessary roundabout travel, and the congestion-\ninduced isolation of Nassau and Suffolk Counties\" would result if no bridge were constructed.\nThe conclusion then eliminated the five possible Suffolk County bridges from consideration on\nthe grounds that they would have \"much lower traffic volume and much higher construction\ncosts.\"lxiii A proposed span from Sands Point in Long Island to New Rochelle in Westchester\nwas removed from consideration on the ground that it would disrupt too many existing\ncommunities. Only two of the original eight bridges remained: one from Glen Cove to Rye and\nthe Oyster Bay-Rye bridge. In language that echoed Robert Moses's original rationale, the study\nconcluded that only the later \"would immediately complete a metropolitan circumferential\n- 19 -\n\nHow The Sound Was 'Saved'\nexpressway\" and would thus not necessitate the building of many miles of access roads.lxiv\nBefore recommending the Rye-Oyster Bay bridge, the study looked into several issues\nraised by bridge critics. While admitting that the bridge would have an impact on wetlands it\ncrossed, the study held that no species would be forced into extinction. Although residents near\nthe bridge might notice some additional air pollution, the study concluded that the overall effect\non air quality in the entire metropolitan area would be minor. Furthermore, the report offered\nengineering suggestions to reduce both air pollution and vehicular noise and held that a good\ndesign could make the bridge \"the most beautiful anywhere.\"lxv From an economic standpoint,\nthe study found that the Oyster Bay-Rye bridge would create an additional 22,000 jobs by 1980\nin Westchester and on Long Island.lxvi The bridge would also impact several daily sailing races\nwhich would have to move to different locations on the Sound.\nWhile critics of the span obviously disagreed with the study's conclusion, they were able\nto use some of its findings to buttress their criticisms. For example, an analysis of the different\napproach roads in Oyster Bay and the detrimental effects of each was incorporated into the\narguments of some opponents. Others seized on warnings that the Sound's dwindling wetlands\nneeded to be preserved. Critics further took note of statistics that showed that out of the eight\nbridges studied, noise from the Oyster Bay-Rye bridge would affect the most residents.lxvii\nOpponents also found fault with the fact that only bridges and no tunnels had been studied.\nBridge opponents now focused their attention on the 1972 session of the New York State\nlegislature where a bill to rescind the MTA's authorization to build the bridge had again been\nintroduced. As before, the bill passed by overwhelming majorities only to be vetoed by\nGovernor Rockefeller. Charging that the rationale for a bridge had been \"amply demonstrated\"\n- 20 -\n\nHow The Sound Was 'Saved'\nby the state study, the Governor decided that the bridge needed to be built.lxviii\nWhy did Rockefeller stick to his bridge plans in the face of so much opposition? The\nmost bitter opponents of the bridge speculated that Rockefeller's insistence was simply a product\nof a promise he had made to Robert Moses in order to get Moses to agree to the MTA. However,\nRockefeller had not kept his first 'promise', a Moses seat on the MTA board, thus it is unlikely\nthat his support for the bridge came solely from a desire to fulfill the second. Asked to comment\non this question, Assemblyman Joseph M. Reilly of Oyster Bay said of the Governor, \"He's a\nbuilder, no doubt about it.\"lxix In other words, Rockefeller was not only convinced of a need for\nthe bridge, but probably hoped to take credit for the project much like Moses had received credit\nfor many of his public works. Author Robert Caro, in his well-known biography of Moses, takes\nthis line of reasoning a step further. Caro maintains that Rockefeller was not doing more to end\nthe construction delays because he wanted to hold off construction until Moses was too old to\ntake part in the project, thus depriving him of the credit.lxx However, this argument has two\nflaws. First, having already removed Moses from power, Rockefeller could have easily bypassed\nhim in assigning responsibility for the project. Second, as already demonstrated, the political\npressures on Rockefeller to delay the bridge cannot be underestimated.\nBut at the end of 1972, the state was still moving ahead. In late November, the Federal\nHighway Administration approved the state's environmental impact study which maintained that\nthe bridge would have only a small negative effect on the \"human and natural environment of the\nmetropolitan area.\"lxxi This report would not have been necessary had the bridge not been\ndelayed by Rockefeller in early 1969. It was a new requirement introduced by the National\nEnvironmental Policy Act passed by Congress later that year, a milestone in the rise of\n- 21 -\n\nHow The Sound Was 'Saved'\nenvironmentalism. Despite this prevailing public mood, the state's study included an insistence\nthat the Long Island approach to the bridge go \"through or over\" the Oyster Bay National\nWildlife Refuge.lxxii In asserting that there would be minimal damage to the wetlands, the report\nheld that the other two Nassau bridges included in the state's January 1972 study would do more\nharm to the \"human and natural\" environment. It is interesting to note how the word \"human\" is\nused to allow for a more expansive definition of what constitutes the \"environment.\" According\nto the January 1972 study, the bridge originating in Glen Cove would disturb far less acres of\nwetland.lxxiii But despite the fact that the environmental impact study seemed not to catch on to\nthe rise of the environment as a political issue, the state scheduled hearings on bridge approach\nroads for mid January 1973.\nOpponents of the bridge promptly responded with two lawsuits in federal court. In the\nfirst case, they sued the MTA and the State Department of Transportation, claiming the state had\nnot given the proper advance notice or released enough information to hold hearings. In\nFebruary 1973, bridge foes, angry over federal acceptance of the state report, also served the\nFederal Highway Administration with a lawsuit.lxxiv As one resident of Bayville, Long Island\n(the town in Oyster Bay where the bridgehead would be built) commented, \"the list of possible\nobjectors is endless.\" And opponents were determined to pursue every avenue available; not\nonly did they have the will to do so, they also had the resources.\nAs the controversy entered 1973, this strategy began to bear some fruit. In early January,\ndeclaring \"there is no urgency in this matter whatsoever,\" Judge Loyd F. McMahon postponed\nthe hearings until the case could be heard.lxxv In February, he ruled that the state had violated\nFederal law by failing to provide enough information on the \"economic, social, and planning\"\n- 22 -\n\nHow The Sound Was 'Saved'\nfactors and thus could not yet hold hearings.lxxvi It took the MTA another month to come up with\na plan that was accepted by the judge under these requirements.\nBut on March 16th, the Bridge was delivered a blow from which it never recovered. The\nUnited States Department of the Interior moved to protect the wildlife refuge it had received\nfrom the town of Oyster Bay. When asked for comment by the Times, deputy assistant secretary\nWilliam W. Lyons said that the decision had been \"based on the terms under which the town of\nOyster Bay\" had turned over the land.lxxvii Since all three proposed access routes went through\nthe refuge, these clever terms forced the state to search for alternative routes. At the very least,\nthis would mean another delay before construction could begin. Despite this, Governor\nRockefeller was still defiant. In words that could have been uttered by Robert Moses, he told\nreportors who asked how the bridge would still go through, \"That's up to me. You'll find out\nmore as the scenario unfolds.\"lxxviii\nUnfortunately for Rockefeller, the scenario was unfolding in favor of anti-bridge forces.\nSenator Ribicoff of Connecticut, a bridge opponent, inserted an amendment into a federal\nhighway bill that barred federal funds from highway projects that would \"significantly affect\" a\nstate without the state's approval.lxxix When the amendment was approved by the House in April,\nthe Oyster Bay-Rye bridge had been dealt another serious blow. In order to receive federal\nfunding to construct the approach roads, Rockefeller now needed the approval of both the New\nYork and Connecticut legislatures. As evidenced by the annual bills against the bridge in the\nfirst body and the scuttling of the Port Jefferson-Bridgeport crossing in the second, this was\nunlikely. In other words, the state would now have to bear the full cost of $70 million for the\nroads in addition to $168 million for the bridge itself.lxxx\n- 23 -\n\nHow The Sound Was 'Saved'\nOn June 20, Rockefeller finally gave up. Citing the increasing prevalence of\nenvironmental concerns, he halted all plans for the bridge. While maintaining that the bridge still\nheld economic advantages, Rockefeller explained that by the early 1970s, people were\n\"beginning to look at the quality of life as well as the quantity of our gross national product.\"lxxxi\nHe held that it was this concern for \"good land use\" that ultimately defeated the bridge.lxxxii\nRobert Moses disagreed. In a speech to the Southampton Garden Club a few days later,\nhe decried what he characterized as \"snobbish social opposition to change\" and held that bridge\ncritics had \"confused the public with irrelevant objections.\"lxxxiii \"On the basis of such crazy\nreasoning,\" Moses maintained, \"there would have been no ... access except by boat to Jones\nBeach and Fire Island.\"lxxxiv\nMeanwhile those who had fought the bridge celebrated their victory. An opposition\ngroup in Rye released a statement which read, \"We regard it as a victory for many\nenvironmentalists, regional planners, and mass transit proponents.\"lxxxv Noticeably missing from\nthis list were the home and estate owners who had stood in the bridge's path and had been the\nsubject of the original statements of opposition in 1965.\nWhich of these three views on the defeat of the bridge was correct? The answer is parts\nof each. For example. the estate owners missing from the Rye group's list saw the value of their\nproperty rise in the wake of the bridge's defeat.lxxxvi While Moses was correct is asserting that\nwealthy interests had defeated the bridge, Rockefeller correctly gauged the mood of the times.\nBridge critics had been so successful in advancing environmental arguments because these\narguments resonated with the general public. In the late 1960s and early 1970s, concern for the\nenvironment was on the rise. During this period Congress passed many major environmental\n- 24 -\n\nHow The Sound Was 'Saved'\nlaws including the Clean Air Act in 1963 and the Endangered Species Act of 1973. In 1970,\nAmerica celebrated the first Earth Day. Thus, Moses's dismissal of conversationalist arguments\nas \"irrelevant objections\" indicates that his vision was formed during an earlier time. But as\nillustrated by the defeat of the bridge, the Moses era was over; a new period of concern for the\nnatural environment had begun.\nThis new era also included a focus on mass transportation. To this end, Governor\nRockefeller tried to turn his bridge defeat into a victory by taking onto the end of his\nannouncement a bond proposal for new mass transit projects. While the bond issue was defeated\nthat November due to a lack of support from upstate residents, Rockefeller had a broader view of\nthe entire transportation picture than Moses. To prohibit buses on his picturesque parkways,\nMoses had made sure that the bridges were too low to allow them to pass safely underneath.lxxxvii\nBy contrast, Rockefeller's plan for a unified MTA was aimed in part at giving a boost to mass\ntransit. Officials who replaced Moses after his fall from power in the 1960s took a broader view\nof the transportation picture and were thus not as willing to force projects such as the Oyster\nBay-Rye bridge down the throat of an unwilling public. As evidenced by the constant\ncontroversies over LIRR and subway fare increases that tied down Ronan's MTA, mass transit\nwas now an important issue in crowded suburbia.\nBut the ghost of the Oyster Bay-Rye Bridge would resurface in the late 1970s. With\nunemployment rising, a cross-Sound bridge was seen as a potential economic stimulus. Acting\non the support of business and labor interests, Suffolk country politicians explored possible\ncrossings, focusing mainly on the eastern bridges from Suffolk to Connecticut. But\nConnecticut's position had not changed since the early 1970s, thus proponents were forced to\n- 25 -\n\nHow The Sound Was 'Saved'\nAlbany.\nlook west. In April 1980, two assemblyman from Suffolk introduced a bridge bill in\nlxxxviii But despite Moses's repeated statements that the bridge was \"inevitable,\" the bill\nwas doomed from the start. Governor Carey of New York cited financing problems plus\nenvironmental and community impact when he ruled out the idea in March; instead, he proposed\nimproved ferry service to Connecticut.lxxxix In the new era of mass transit and environmental\nconcerns, the Oyster Bay-Rye Bridge had become a political football too hot for any top official\nto touch.\n- 26 -\n\ni\nRockefeller, Nelson. \"The Rockefeller Statement\" New York Times, 21 June 1973: p20\nii\nHunt, Richard P. \"Democratic Chief Calls Governor Unfair to Moses\" New York Times, 1 December 1962: p1,43\niii Rockefeller, Nelson. \"Statement by Governor\" New York Times, 1 December 1962: p13\niv Caro, Robert A. The Power Broker: Robert Moses and the Fall of New York (New York: Random House, 1975); p1080\nv\nIngraham, Joseph C. \"Moses is Seeking Bridge From L.I. to Port Chester\" New York Times, 15 February 1965: p1,24\nvi Ingraham, Joseph C. \"Moses is Seeking Bridge From L.I. to Port Chester\" New York Times, 15 February 1965: p1,24\nvii Ingraham, Joseph C. \"Moses is Seeking Bridge From L.I. to Port Chester\" New York Times, 15 February 1965: p1,24\nviii Ingraham, Joseph C. \"Plan for Bridge Across Sound Arouses Rye and Oyster Bay\" New York Times, 16 February\n1965: p37,45\nix Ingraham, Joseph C. \"Moses Revises Plan on L.I. Sound Bridge\" New York Times, 17 July 1965: p1,11\nx\nIngraham, Joseph C. \"Plan for Bridge Across Sound Arouses Rye and Oyster Bay\" New York Times, 16 February\n1965: p37,45\nxi Ingraham, Joseph C. \"Protests Spread on Bridge Plan\" New York Times, 17 February 1965: p45,50\nxii Caro, Robert A. The Power Broker: Robert Moses and the Fall of New York (New York: Random House, 1975); p195\nxiii \"Governor Disputes Moses on L.I. Span; Awaits Joint Study\" New York Times, 15 March 1965: p40\nxiv \"Oyster Bay Strategy\" New York Times, 17 February 1965: p50\nxv \"Oyster Bay Strategy\" New York Times, 17 February 1965: p50\nxvi \"Oyster Bay Strategy\" New York Times, 17 February 1965: p50\nxvii Ingraham, Joseph C. \"Protests Spread on Bridge Plan\" New York Times, 17 February 1965: p45,50\nxviii Ingraham, Joseph C. \"Protests Spread on Bridge Plan\" New York Times, 17 February 1965: p45,50\nxix Silver, Roy R. \"Bridge Authority Split on L.I. Plan\" New York Times, 11 March 1965: p1,24\nxx Ingraham, Joseph C. \"Moses Revises Plan on L.I. Sound Bridge\" New York Times, 17 July 1965: p1,11\nxxi Ingraham, Joseph C. \"Moses Revises Plan on L.I. Sound Bridge\" New York Times, 17 July 1965: p1,11\nxxii Ingraham, Joseph C. \"Moses Revises Plan on L.I. Sound Bridge\" New York Times, 17 July 1965: p1,11\nxxiii \"Rye Opposes L.I. Bridge\" New York Times, 22 July 1965: p18\nxxiv \"Moses Startles L.I. Bridge Foes With a Trump\" New York Times, 1 December 1965: p43\nxxv \"Rye and Oyster Bay Plan Albany Fight to Halt New Bridge\" New York Times, 22 December 1965: p33\nxxvi \"Rye and Oyster Bay Plan Albany Fight to Halt New Bridge\" New York Times, 22 December 1965: p33\nxxvii Folsom, Merrill. \"Victory on Bridge Brings Joy to Rye\" New York Times, 15 August 1965: p96\nxxviii Schanberg, Sydney H. \"Travia to Return City Transit Plan for Council Vote\" New York Times, 11 March 1966: p1,\nxxix \"Transit Debate\" New York Times, 12 March 1966: p26\nxxx Schanberg, Sydney H. \"Transit Power Shift\" New York Times, 24 March 1967; p31\nxxxi Shapiro, Fred C. \"The Wholly Ronan Empire\" New York Times, 17 May 1970; p220\nxxxii Caro, Robert A. The Power Broker: Robert Moses and the Fall of New York (New York: Random House, 1975);\np1137\nxxxiii Bigart, Homer. \"Moses Backs Plan on Transit Unity\" New York Times, 11 March 1967: p1, 33\nxxxiv Maiorana, Ronald. \"Governor Urges Bridge From Oyster Bay to Rye\" New York Times, 23 March 1967: p1, 24\nxxxv Maiorana, Ronald. \"Governor Urges Bridge From Oyster Bay to Rye\" New York Times, 23 March 1967: p1, 24\nxxxvi Maiorana, Ronald. \"Governor Eases Stance on Bridge\" New York Times, 29 March 1967: p49\nxxxvii Witkin, Richard. \"M.T.A. Takes Over Transit Network\" New York Times, 2 March 1968: p36\nxxxviii Reeves, Richard. \"Ideas Still Spark From Moses\" New York Times, 31 October 1971, pA1\nxxxix \"Rye Sues to Block Bridge Over Sound\" New York Times, 27 September 1968: p56\nxl Ingraham, Joseph C. \"State Approves Rye-Nassau Span\" New York Times, 13 December 1968: p1, 35\nxli \"Rye Officials Still Opposed to L.I. Bridge Plan\" New York Times, 14 January 1968: p39\nxlii Tomasson, Robert E. \"L.I.-Rye Bridge Hearing Stalled\" New York Times, 4 January 1969: p54\nxliii Tomasson, Robert E. \"L.I.-Rye Bridge Hearing Stalled\" New York Times, 4 January 1969: p54\nxliv \"...and for the Sound?\" New York Times, 14 December 1968: p44\nxlv Tomasson, Robert E. \"L.I.-Rye Bridge Hearing Stalled\" New York Times, 4 January 1969: p54\nxlvi \"Controversy is Stirred by Proposals for Some Long Island Sound Bridges\" New York Times, 11 February 1968: pB2\nxlvii \"Controversy is Stirred by Proposals for Some Long Island Sound Bridges\" New York Times, 11 February 1968: pB2\nxlviii Keese, Parton. \"Bridge Foes Signed Up at Boat Show\" New York Times, 3 February 1973, p62\nxlix \"U.S. Accepts Land in L.I. Bridge Path\" New York Times, 19 December 1968: p94\nl\nLindsey, Robert. \"Plan for Bridge Across Sound Blocked by State Court Ruling\" New York Times, 4 February 1969: p1\nli\nSibley, John. \"State's High Court Backs Rye-Oyster Bay Bridge\" New York Times, 25 April 1969: p31\nlii Clines, Francis X. \"The Battle of the L.I. Sound Bridge\" New York Times, 12 September 1971: pA1\n\nliii Ingraham, Joseph C. \"Connecticut House Sidetracks Bridge Over Sound\" New York Times, 7 June 1969: p70\nliv Hudson, Edward. \"Governor Orders Study on Bridge Over L.I. Sound\" New York Times, 22 April 1970: p71\nlv Hudson, Edward. \"Governor Orders Study on Bridge Over L.I. Sound\" New York Times, 22 April 1970: p71\nlvi Silver, Roy R. \"Protests Grow Over Bridge Across Sound\" New York Times, 18 October 1970: pS26\nlvii Silver, Roy R. \"Protests Grow Over Bridge Across Sound\" New York Times, 18 October 1970: pS26\nlviii Silver, Roy R. \"Protests Grow Over Bridge Across Sound\" New York Times, 18 October 1970: pS26\nlix \"Assembly Vote Fails to Overturn Veto on Oyster Bay-Rye Bridge\" New York Times, 7 June 1971: p48\nlx \"Proceeding Backwards\" New York Times, 28 April 1971: p46\nlxi Clines, Francis X. \"The Battle of the L.I. Sound Bridge\" New York Times, 12 September 1971: pA1\nlxii Lloyd, Gerald D. \"Letters to the Editor\" New York Times, 23 February 1973; p32\nlxiii Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxiv Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxv Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxvi Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxvii Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxviii Reif, Rita. \"If the Bridge Comes, the Houses Must Go\" New York Times, 10 November 1972: p24\nlxix Clines, Francis X. \"The Battle of the L.I. Sound Bridge\" New York Times, 12 September 1971: pA1\nlxx Caro, Robert A. The Power Broker: Robert Moses and the Fall of New York (New York: Random House, 1975); p1147\nlxxi Prial, Frank J. \"Proposed Bridge on Sound Passes Environment Test\" New York Times, 29 November 1972: p89\nlxxii Prial, Frank J. \"Proposed Bridge on Sound Passes Environment Test\" New York Times, 29 November 1972: p89\nlxxiii Creighton, Hamburg, Inc. \"A Comprehensive Transportation Study for Proposed Long Island Sound Crossings\"\nDecember 1971; available at http://www.nycroads.com/crossings/LI-sound-1/\nlxxiv \"Suit Filed Against L.I. Sound Bridge\" New York Times, 8 February 1973: p47\nlxxv \"Hearing Delayed on L.I. Sound Bridge\" New York Times, 12 January 1973: p37\nlxxvi Lubasch, Arnold H. \"Foes of L.I. Sound Bridge Win Delay\" New York Times, 14 February 1973: p47\nlxxvii Weisman, Steven R. \"U.S. Blocks All State Plans on Rye-Oyster Bay Bridge\" New York Times, 17 March 1973: p1\nlxxviii Madden, Richard L. \"Governor Says U.S. Opposition Won't Stop L.I. Sound Bridge\" New York Times, 6 April 1973\nlxxix Weisman, Steven R. \"U.S. Blocks All State Plans on Rye-Oyster Bay Bridge\" New York Times, 17 March 1973: p1\nlxxx \"House Votes to Tie Up L.I. Bridge Aid\" New York Times, 20 April1973: p63\nlxxxi Rockefeller, Nelson. \"The Rockefeller Statement\" New York Times, 21 June 1973: p20\nlxxxii Rockefeller, Nelson. \"The Rockefeller Statement\" New York Times, 21 June 1973: p20\nlxxxiii Fowler, Glenn. \"Moses Calls Bridge Over Sound Inevitable\" New York Times, 24 June 1973: p91\nlxxxiv Fowler, Glenn. \"Moses Calls Bridge Over Sound Inevitable\" New York Times, 24 June 1973: p91\nlxxxv Feron, James. \"Bridge Opponents Wary, But Hail Governor's Move\" New York Times, 21 June 1973; p30\nlxxxvi Horsley, Carter B. \"L.I. Bridge Decision Upsets Land Values\" New York Times, 8 July 1973, p1, 10\nlxxxvii Caro, Robert A. The Power Broker: Robert Moses and the Fall of New York (New York: Random House, 1975)\nlxxxix \"Carey Rejects Bridge for Sound; Urges Ferry Study,\" New York Times, 16 March 1980: p29\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.014J / 21H.232J American Urban History II\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}