{
  "course_name": "Analysis of Biomolecular and Cellular Systems",
  "course_description": "This course focuses on computational and experimental analysis of biological systems across a hierarchy of scales, including genetic, molecular, cellular, and cell population levels. The two central themes of the course are modeling of complex dynamic systems and protein design and engineering. Topics include gene sequence analysis, molecular modeling, metabolic and gene regulation networks, signal transduction pathways and cell populations in tissues. Emphasis is placed on experimental methods, quantitative analysis, and computational modeling.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Science",
    "Biology",
    "Engineering",
    "Biological Engineering",
    "Science",
    "Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations (Optional): 1 session / week, 1 hour / session\n\nPrerequisites\n\nYou will be most effectively prepared to take this subject if you have previously taken the following subjects:\n\n6.00 Introduction to Computer Science and Programming\n(\nOCW Scholar Version\n)\n\n5.07 Biological Chemistry I\nor\n7.05 General Biochemistry\n\n18.03 Differential Equations\n(\nOCW Scholar Version\n)\n\n20.110 Thermodynamics of Biomolecular Systems\n\nDescription\n\nThis course focuses on computational and experimental analysis of biological systems across a hierarchy of scales, including genetic, molecular, cellular, and cell population levels. The two central themes of the course are modeling of complex dynamic systems and protein design and engineering. Topics include gene sequence analysis, molecular modeling, metabolic and gene regulation networks, signal transduction pathways and cell populations in tissues. Emphasis is placed on experimental methods, quantitative analysis, and computational modeling.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nExam 1\n\nExam 2\n\nProtein Networks Project\n\nProtein Design Project\n\nFinal Exam\n\nProblem Sets\n\nProblem sets are not turned in or graded, although problems sets and answer keys from previous years are provided for your reference. Optional study problems are posted for each section. We strongly encourage the completion of study problems, as they provide a direct metric of your understanding of the material in the course and also serve as practice problems for the exams.\n\nWe adhere to the\nInstitute guidelines (PDF)\nto determine final grades, and use the full range of grades, from \"A\" to \"F\".\n\nIf you have questions about problems that you got wrong on the exams or design projects, or if you think you have been graded incorrectly, you are welcome to discuss your questions with any member of the staff. However, if you have concerns about your overall grade for the course, you must speak to either Professor Fraenkel or Professor White. The teaching assistants are not authorized to discuss projected or final course grades.\n\nSoftware\n\nMATLAB\n(r)\nis used in the\nModeling of Cellular Systems\nand\nProtein Networks Project\nsections of the course; Python,\nPyMOL\nand\nPyRosetta\nare used in the\nModeling and Manipulating Biomolecular Interactions\nand\nProtein Design Project\nsections. If you are a student or teacher, you may be able to\nregister for an educational-use-only PyMOL license\n.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2010 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/81ed88d8729c451510d1dfdcf67ecf45_MIT20_320F12_2010Exam1.pdf",
      "content": "20.320 -- Exam #1\nNovember 27, 2010\nQuestion 1 (25 points total)\nIn your job at BigPharmaCo. you need to test a panel of small molecule inhibitors (each\napproximately 500 Da) for their ability to inhibit EGFR (185 kDa) and their specificity against\na broad panel of kinases. Given the exorbitant cost of in vitro kinase assays for this panel of\nkinases, you decide that it might make more sense to gather some biophysical data first prior\nto characterizing their effect on enzymatic activity. First, you need to figure out how well each\nof these inhibitors binds to the EGFR target protein.\na) (4 points) Design an SPR experiment to test the interaction affinity between EGFR and\nthe first compound in the series. How will you get the desired information out of your\nexperiment?\nc) (6 points) For the first compound, you determine the following parameters: kon = 105\nmolM-1 sec-1 and koff=10-3sec-1. For these parameters and your experimental design,\nhow long will it take for each analysis to reach 75% RUeq, using a ligand concentration of\n50 nM?\nd) (4 points) One of the major problems with SPR is non-specific binding to the surface of the\nchip. How can you identify this problem, and how can you correct data that has already\nbeen gathered?\ne) (5 points) To design the next generation of improved inhibitors you need to know the ther\nmodynamic parameters of the various inhibitors. Describe an experimental setup, including\nthe concentrations of the various components, to generate this information for the first com\npound, given the parameters in part c, above. Experimental design is sufficient - no need to\nwork through equations, although you should provide the relevant equations.\n\nQuestion 2 (21 points total)\nBCR-Abl is a constitutively active fusion tyrosine kinase associated with oncogenesis and pro\ngression of chronic myeloid leukemia. One of the first structure-based designed kinase inhibitors\nis imatinib, an ATP-analog inhibitor of BCR-Abl. Km for BCR-Abl interaction with ATP is\n50 micromolar, and Ki for imatinib is 22 nM. ATP concentration in the cell is 4 mM.\na) (6 points) Since BCR-Abl is such a potent driver of leukemia, 99% inhibition is desired to\nslow down disease progression. Calculate the imatinib concentration required for this level\nof inhibition.\nb) (4 points) Provide 2 reasons why almost all kinase inhibitors are ATP-analogs.\nc) (6 points) Given the difficulty in competing with ATP, BigPharmaCo, Inc. has recently\nstarted a program to develop a novel, non-competitive inhibitor targeting BCR-Abl. Unfor\ntunately, the first inhibitor (Ki = 50 nM) generated in this program is limited by solubility\nissues to a concentration of 1.2 micromolar in the cell. How effective will this inhibitor be\ngiven this concentration limitation?\nd) (3 Points) Describe, in 2 sentences or less, the mechanism of action of Type II inhibitors.\ne) (2 points) Why are Type II inhibitors not applicable to BCR-Abl?\n\nQuestion 3 (22 points total)\nAs discussed in class, Ste7 is unable to phosphorylate Fus3 unless the Ste5 scaffold is present.\nActivated Fus3 phosphorylates the Ste5 scaffold, thereby increasing the affinity of the interaction\nbetween phosphorylated Fus3 and Ste5.\na) (5 points) Draw a schematic diagram of this 3-component signaling cascade. You can start\nwith activated Ste7. Assume Ste7 binds to Ste5 first, followed by Fus3. Assume the order\nof dissociation is the inverse of the binding order (e.g. Fus3 unbinds from Ste5 first).\nb) (8 points) Write out ODEs for each species.\nc) (5 points) While activated Fus3 can drive proliferation, activated Kss1 drives filamentous\ngrowth. Given that these are both MAP kinases that share a large number of substrates,\nprovide two potential hypotheses explaining how the biological response can be so different\ndownstream of the activation of these two kinases.\nd) How does the increased affinity between Fus3 and phosphorylated Ste5 affect the biological\nactivity of this system? Provide a mechanism underlying your answer (short answer, 1-2\nsentences).\n\nQuestion 4 (20 points total)\nJim Smith, a recent hire at BigPharmaCo. in their process engineering group, needs to set\nup a reactor to make a large supply of bioactive peptides. The process currently used at\nBigPharmaCo begins with recombinant proteins. Each protein is converted to 2 bioactive\npeptides in a single step using ClpX, a proteolytic complex. This reaction requries energetic\ninput: ClpX consumes one ATP to cleave each prteoin. You can assume independent binding\n(i.e. no cooperativity) for ClpX binding to ATP or to the recombinant protein.\na) (4 points) Provide the chemical equations for this reaction, given the following rate param\n-1\neters for ClpX-protein: k1 = 2x104 L mol-1 sec-1, k-1 = 1x10-3 sec-1, k2 = 2x10-3 sec\n.\n-1\nFor ClpX-ATP: k1 = 5x103 L mol-1 sec-1, k-1 = 10-2 sec-1, k2 = 2x10-2 sec\n.\nb) 10 points) Given a 10L reactor with 5 micromolar ClpX, 20 mM ATP and 100 mM protein,\ncalculate how long it will take for the reactor to reach steady state.\nc) (6 points) How long will the reactor run at maximal efficiency, and how much product will\nbe generated by the reactor during optimal operation?\n\nQuestion 5 (14 points total)\nShort answers - one to three sentences.\na) (4 points) Name two ways to test the biological role of a given phosphorylation site.\nb) (4 points) How does strong negative feedback affect the duration and amplitude of the\nMAPK signaling network output? How does this differ for strong positive feedback?\nc) (2 points) Name 2 human MAP kinases.\nd) (4 points) Name two reasons why quantitative interaction affinities generated by protein\n\nmicroarrays may not be applicable to modeling reactions in cells.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2010 Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/8574bfebcb34fcbbe9cf046f21252574_MIT20_320F12_2010Exam2.pdf",
      "content": "$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\n20.320 Exam 2\nTuesday November 16th\n9:35‐10:55\nInstructions:\n1. Write your name of the front cover of the blue book.\n2. Answer all questions in the blue books. This exam paper will not\nbe graded.\n3. All questions can be answered in at most a few sentences. We will\ndeduct points for excessively long replies, even if they contain the\nright answer.\n4. State all assumptions for each problem.\n5. In order to pace yourself please note that the maximum possible\nscore on this exam is 100.\nThere are FIVE questions on EIGHT pages.\nPage 1 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 1 (9 points)\nAn important transcription factor for cell cycle regulation has been shown to bind\nthe following DNA sequences.\na.\nCompute the probability matrix for the sequences shown below.\n(2 points)\nb.\nWhat is the probability of finding a T in the second position?\n(2 points)\nc.\nBased on these training data, what is the probability of finding the\nsequence ATCGTC in a binding site?\n(5 points)\n1 2 3 4 5 6\nA C C G T A\nA T C G A A\nC T C A T C\nA T G C T A\nA C C G T A\nC C G G A A\nA T C G T A\nA C T C T A\nPage 2 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 2 (30 points)\nYou have been asked to help improve production of an enzyme necessary for\nsynthesis of a pharmaceutical compound. The enzyme has been cloned into a\nplasmid to be produced in bacteria. After purification, the enzyme is highly\nactive, but the yield is very low. Following examination of the raw bacterial\nlysate, you determine that the protein is actually being produced at very high\nlevels, but most of it is not soluble. You suspect the problem is connected to\nprotein folding.\nA. To understand how the protein folds, you conduct an in vitro experiment by\nchemically denaturing the protein and then rapidly diluting it into an\naqueous solution. The final concentration of the denaturant is so low that\nit has no effect on folding or structure. This process allows the protein to\ninstantly begin to refold.\nA. Based on analysis of the curve below and making simple and\nreasonable assumptions about the underlying process, write a rate\nequation for the formation of folded protein as a function of time\nwhen the protein is diluted to a low final concentration.\nB. Draw a reaction coordinate diagram indicating the free energy of the\nunfolded and folded proteins.\nPage 3 of 8\n\n$16: (5#$$//#.8( 672216 #21#7+(#t/8(#t22.6#\nQuestiion 2 (coontinued)\nB. Surprisingly, when the same experiment is performed with the prootein\npresent att a higher final concentrationn, you find that the total yieldd of\nfolded prootein never exceeds 60%. This result occurs desspite the fact that\nyou are using the same conc entrations of denaturant as bbefore andd that\nyou can s how that the starting material is comppletely denatured, aas it was\nin part (a)).\nA. Propose an explanation ffor these oobservations.\nB. Draw a reactionn coordinaate diagra m similar to that in part (a), but\nadding the necessary sta tes/transiitions to e xplain thee observed\nbehavvior.\nC. Beelow we have provided a contact map for the residues in this proteein.\nIdentify those residues that are likely to maximally decreasse the rate of\nprotein foldding.\nPage 4 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 2 (continued)\nD. A mutagenesis screen has identified a number of mutations that improve\nthe final yield of protein. These mutations are also observed to increase\nthe rate of folding even at dilute solution. The mutations were mapped to\nthe amino acid sequence and found to all cluster in a small region of the\nprotein, which is shown below.\nOriginal\nsequence:\nG\nA\nL\nA\nN\nL\nA\nV\nI\nI\nImproved\nsequence:\nP\nR\nL\nA\nD\nL\nA\nR\nK\nI\nPredict the effect of these mutations on the structure and rationalize why\nthey have the observed effect on the final yield of protein. Please keep\nyour answer brief. Excessively long answers will not be graded.\nEND OF QUESTION 2\nPage 5 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 3 (20 points)\nP53 is an important regulator of the cell cycle. In its activated form it promotes\nthe transcription of several cell‐cycle arrest genes. Mdm2 is an E3 ubiquitin ligase,\nresponsible for regulating p53 protein expression. In this problem we consider\ntheir interaction in a protein network. We consider here a simplified model: p53 is\nconstitutively expressed at rate α0 and Mdm2 is constitutively expressed at rate\nβ0. Both of these proteins are degraded with first‐order rate constant γ0. The E3\nubiquitin ligase activity of Mdm2 is activated by phosphorylation by the\nserine/threonine kinase Akt. You can assume this phosphorylation occurs at a\nconstant activation rate k1. Mdm2 can also be dephosphorylated at constant rate\nk‐1 by a constitutively active phosphatase (PP1). To simplify this problem, assume\nthat the concentrations of the phosphatase (PP1) and the kinase (Akt) are\nconstant. In its phosphorylated form, Mdm2 can bind to p53 (k2, k‐2) and target it\nto degradation by the proteasome in a ubiquitin mediated process, releasing\nphosphorylated Mdm2. You can lump this degradation process using the\ndegradation rate constant kdeg.\na) Draw a schematic of the system\nb) Give the differential equations underlying this system\nc) What is the steady‐state value of p53 in the absence of Akt?\nd) How do you suspect the presence of Akt will change this steady‐state? (One\nsentence answer)\ne) P53 acts as a transcription factor of many genes, including activating\ntranscription of mdm2. What type of regulatory motif is represented by the\ntranscriptional effects of p53 on mdm2?\nf) A scientist has developed a competitive antibody that specifically\nrecognizes the activated phosphorylated form of Mdm2. How would you\nchange your differential equation for d[Mdm2‐P]/dt given in b)? You do\nnot need to rewrite the full equation, just give the additional terms. Use kon\nand koff for the antibody binding kinetic rate constants.\nPage 6 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 4 (20 points)\nConsider two mutually regulating transcription factors as depicted below:\n1) Write down a set of ODEs describing the dynamics of this system. Clearly state\nall assumptions.\n2) Linearize the system about its critical points neglecting basal rates of synthesis\nand using the following parameter values: βy=5/4; βx=1; KD,y=2; αx=αy=1. Show\nall work.\nHint: You may assume that the physiological concentration of X is always much\nsmaller than the dissociation constant for the interaction of X and the\npromoter of Y.\n3) Analyze the stability of all critical points. Will the system be stable or unstable,\nand oscillatory or non‐oscillatory?\nPage 7 of 8\n\n$16: (5#$//#.8(672216#21#7+(#t/8(#t22.6#\nQuestion 5: (21 points)\nShort Answers. Note: You should be able to answer each these questions with\nthree or fewer sentences.\nEXCESSIVELY LONG ANSWERS WILL NOT BE GRADED.\nA. Why are there some regions of the Ramanchandran plot that are unoccupied?\nB. What is the rationale behind the use of foldamers compared to natural\nproteins?\nC. Give two ways in which protein misfolding can contribute to disease\nD. The DeltaG of hydrogen bond formation is ‐6Kcal/mol. How does this compare\nto the DeltaG of protein folding? Why is there such a difference or lack of?\nE. What are the two conditions necessary for oscillations and why?\nF. Is the following feedforward motif coherent or incoherent?\nG. In antibody‐mediated tumor treatment, is a higher affinity (lower KD) always\ndesired? Why?\nPage 8 of 8\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2011 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/1df473d86c66539868c52821d8139878_MIT20_320F12_2011Exam1_Sol.pdf",
      "content": "Question 1 - Protein Folding and Synthesis\n(12 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations where relevant. Excessively\nlong answers will not be graded.\nYou are using a bacterial system to produce a protein to be used as a\ntherapeutic. The bacterial product is chemically pure and identical to\nthat produced in humans. However, the material you obtain is not\nenzymatically active. You presume that improper folding might be a\nproblem.\na. In your blue book, draw the thermodynamic \"pathway\" for a\nsimple two-state model of protein folding on a reaction\ncoordinate diagram, and label important features of the curve.\nPlease label your axes as well. (2 points)\nI was looking just for an unfolded state, a (relatively) higher\nactivation energy and then a lower\nfolded state energy (the proteins in the\npicture are irrelevant).\nb. Consider an experiment where\nyou rapidly dilute a concentrated, denatured protein and\nmeasure the rate at which it refolds (your protein starts in urea,\nwhich denatures proteins, and is diluted in aqueous solution).\nWrite a differential equation for the rate of protein folding,\ndetermine the solution to the equation (it was solved for you in\nclass!) and qualitatively sketch how the \"faster\" and \"slower\"\nproteins would look on a plot of unfolded protein vs. time.\n(Assume that you can ignore the reverse reaction in which\nsome of the newly folded protein unfolds). (3 points)\nthe rate equation: d U(t)/dt = -kU(t)\nkt\n\"faster\" protein)\nand slower protein (top curve)\nthe solved differential: U(t) = U0e -\n(where a greater k indicates a\nfaster protein (bottom curve)\n(\ng\nfaster protein\n\nc. You attempt to denature and refold the bacterial protein in vitro.\nWhile you are able to obtain some active protein, the yield is\nlow. When you increase the initial concentration of your\nprotein, the yield from the system drops further. What might\ncause this? (3 points)\nIt's likely that the protein is forming aggregates.\nd. You have identified mutations that increase your yield when the\nprotein is refolded at high concentrations. However, these\nmutations have no effect on the yield when the protein is\nrefolded at very dilute concentrations. Provide an explanation\nfor these observations. (4 points)\nThe mutations must be preventing aggregate formation. These\nmutations wouldn't affect yield at low concentrations since\naggregation is only really a problem at high concentration.\n(If they explained that aggregation was only a problem at high\nconcentrations in part c, I still gave them full credit here, but I\nwas looking to see that they connected the mutations to the\naggregates and that they recognized aggregation is less of a\nproblem at dilute concentrations).\n\nQuestion 2 - Sequence Motifs\n(20 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations and diagrams where\nrelevant. Excessively long answers will not be graded.\nChIP-Seq is a common experiment that allows the experimenter to\nidentify pieces of DNA to which a particular protein is bound and is\noften used for determining sequence patterns for binding transcription\nfactors.\nSuppose you decided to work with a transcription factor, yfp2 and ran a\nChIP-Seq experiment which showed that yfp2 bound to a 8-mer. You\ncalculate the probability matrix, given below:\n.\nA 0.3\n0.1\n0.25 0.09 0.15 0.3\n0.2\n0.5\nC 0.05 0.1\n0.6\n0.01 0..\n0.01 0.2\n0.15\nG 0..5 0.1\n0.05 0.2\n0..\n0.19 0.3\n0.15\nT 0.2\n0.7\n0.1\n0.7\n0.05 0.6\n0.3\n0.2\na. Under this model, what is the probability of observing the most\nlikely sequence? Why is it so low? (4 points)\n(2 points for explanation and 2 for the calculation)\nThe most likely sequence can be constructed simply by\nchoosing the most likely sequence at each position. There are\nfour sequences of equal maximum probability:\nGTCT[C/G]T[G/T]A. The probability is simply the product of\ntheir entries: 0.45*0.7*0.6*0.7*0.4*0.6*0.3*0.5 = 0.0047628.\nIt is very low because there are many possible observable\nsequences under our model (every possible sequence is also\npossible in our model with nonzero probability!)\nb. Does the fact that the probability is so low suggest that the\ntranscription factor won't bind this sequence? Briefly explain.\n(4 points)\nThis is the probability of seeing a sequence, assuming that the\n\ntranscription factor binds that sequence. This tells us nothing\nabout the validity of our assumption. Put differently, P(A|B) says\nnothing of P(B). To assess the validity of our assumption, we\ncompare the likelihood of our data under this assumption to the\nlikelihood assuming it's not a transcription factor (this\ncomparison is the likelihood ratio).\nc. Write an equation for the log-likelihood ratio that you would use\nto determine whether a sequence was more likely to be a\nbinding site for yfp2 or a random region in this genome.\n(4 points)\nlog(P(sequence|motif model) / P (sequence | background/genome model)) =\nlog(P(sequence|motif model)) - log(P(sequence|background/genome)) =\nsum over all positions i [ log(pi|motif) ] - 8 log 0.25\nNote that log(a/b) does not equal log(a)/log(b)\nContinued on next page\n\nQuestion 2 - continued\nd. In class we discussed the advantages of using sequence motifs\nover consensus sequences. However, there are some features\nthat sequence motifs do not capture. Carefully examine the\nsequences below, which are a representative part of a much\nlarger data set.\nIdentify a sequence pattern that is not captured by a sequence\nmotif built from these sequences (even if you include\npseudocounts). In other words, what types of sequences are\nunlikely to ever occur in this full dataset but would be scored\nwell by a motif built on these data. (You do not need to\ncompute the motif to answer this question).\n1 2 3 4 5 6 7 8 9\nA C T A T T C G T\nA\nG\nT\nG G C A T T C G T\nG\nC\nC\nA G A A T T C G T\nT\nC\nT\nG G T A T T C G T\nA\nC\nC\nC C G T T T C G A\nC\nG\nG\nC T G C T T C G G\nC\nA\nG\nA A G C T T C G G\nC\nT\nT\nC G A C T T C G G\nT\nC\nG\nC A C G T T C G C\nG\nT\nG\nC T A G T T C G C\nT\nA\nG\nC G C G T T C G C\nG\nC\nG\nA A G A T T C G T\nC\nT\nT\nA A C T T T C G A\nG\nT\nT\nT G G T T T C G A\nC\nC\nA\nT A C T T T C G A\nG\nT\nA\n(8 points)\nIn all cases in this matrix, positions 1-4 are perfectly complementary\nto positions 12-9. This is an example of dependence (very very strong\ndependence) between positions, which a motif is incapable of\n\ncapturing. For example, a motif might score the following sequence\nvery well:\nCGGT TTCG TGGT\nbut since the data seems to suggest a palindrome is necessary, this\nsequence is unlikely to perform the same function as the above\nsequences.\nA palindrome may be conserved to allow the RNA to form a\nstem-loop structure (hairpin).\n\nQuestion 3 - Protein Secondary Structure\n(18 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations where relevant. Excessively\nlong answers will not be graded.\nChou-Fasman:\na. Why does Chou-Fasman perform less well on predicting\nsheets than helices?\n(3 points)\nalpha helices rely more on local contacts whereas beta sheets tend\nto form interactions with non-local contacts. It's difficult to predict\nregions of beta sheets from sequential amino acids.\nb. Chou-Fasman is a knowledge-based algorithm. Explain\nwhat this means and what the knowledge-based\nparameters are.\n(3 points)\nKnowledge-based means that the algorithm is based off of\nempirically derived data. I accepted answers that said the algorithm\nwas based on experiments or a database of structure. The\nparameters are the helical \"propensities\".\nc. List two reasons why you don't find Proline in an alpha\nhelix. What about Glycine (one reason)?\n(3 points)\nProline can't hydrogen bond and will have steric hinderance due to\nit's bulky ring structure. Glycine is too flexible and has a high\nentrophic cost to be included in a helical structure.\nCoiled coils:\na. Looking down the length of one helix in a coiled coil, there\nis often a periodic patterning of hydrophobics and\nhydrophilics. What is the period of this repeat?\n(2 points) The repeat for a coiled-coil is once every 7 mers. I gave 1\npoint if they said the repeat was i, i+3 or i+ 4 for a helix.\n\nb. We looked at a general type of coiled-coil domain called a\nleucine zipper. Explain the importance of the leucines in\nthis domain.\n(2 points)\nI was looking for the fact that leucines for stable hydrophobic\ninteractions between the two coils.\nc. Suppose you wanted to create a new algorithm, based on\nChou-Fasman, that would search for coiled-coils in an\namino acid sequence data. Describe briefly (no more than\n3 sentences) how your algorithm would work, and what\ndata you would need to be able to construct the algorithm.\n(5 points)\nSince Chou-Fasman works with helical 'propensities' - some\nempirical measure of how likely a particular amino acid is to be in a\nhelix - we might consider using a similar set of 'propensities' for\neach amino acid to be in a coiled coil. However, this might run into\nissues, since we've seen that the position in the coiled coil matters\nsubstantially. Hydrophobic and hydrophilic patterns in the 7-residue\nrepeat [heptad] should probably not be ignored. To account for this,\nincorporate position-specific propensities, and scan along a\nsequence, looking for a heptad (or longer) with high average\npropensity - then extend outwards till the propensity drops below\nsome threshold.\nIt is true that helical propensity is necessary - however it is\ncompletely insufficient to predict coiled coils.\n2 points deducted for missing the importance of position-specificity\n1-5 points deducted for unclear / insufficient description of algorithm\n\nQuestion 4 - Levinthal's Paradox and Combinatorial Search\n(20 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations where relevant. Excessively\nlong answers will not be graded.\na. What does Levinthal's paradox tell us about how proteins\nactually fold? (5 points)\nProteins do not fold by randomly sampling every possible\nconformation (this would take the age of the universe for\nevery protein to fold!) Instead, there must be some kind of\ndirected folding\nb. You're in luck! You have decided to work on your design\nproject, and the Athena cluster is completely empty\ntonight. You anticipate you have time to explore 10^40\ndifferent protein conformations.\nYou are searching for a novel sequence that will fold into\na stable structure. You intend to try every amino acid at\nevery position, and a reasonable number of backbone\nangles for each residue. Please write an equation for the\nlength of protein you can design, and estimate the value\nof this equation. You do not need to give a precise\nanswer. Make sure you state any of your assumptions.\n(5 points)\nAssume (and many valid assumptions can be made here)\nthat you are allowing 2 backbone conformations for each\nresidue (say, helix and sheet), and all 20 amino acids with\none rotamer conformation at each position. The expected\nlength you're able to design would then be\n(20 * 2)n = 1040\nn ' 15 residues (a very short peptide, probably to short to\nfold anyway). It's hard to calculate n exactly, but you could\nestimate that .0n = 10.0 will mean that n has to be less than\n.0 (by about 2 fold)\nThis course makes use of Athena, MIT's UNIX-based computing environment. OCW does not provide access to this environment.\n\nc. You quickly realize that you will not be able to search all\npossible conformations for a reasonably sized protein.\nInstead you decide to search for the most stable\nconformation of each potential sequence using the type of\nMetropolis algorithm described in class. Describe the\nsteps in this algorithm. Include simulated annealing in\nyour answer.\n1) Random start state Si, with Energy Ei\n2) Make a random perturbation to a new neighbor state\nStest with energy Etest\na. If Etest < Ei\ni. Si+1 = Stest\nii. Ei+1 = Etest\nb. Else, set Sn+1 = Stest with Probability\nP = e-(Etest-Ei)/kT ,determined by a random\nnumber, otherwise Si+1 = Si\n3) Return to Step 2, repeat a set number of times\nWith simulated annealing: Decrease temperature as you proceed\nthrough this process. Essentially, this allows a more likely uphill walk at\nearlier trials (higher temperatures) to allow exploration of the\nlandscape, with a decrease in temperature causing higher energies to be\nrejected, allowing the algorithm to find a minima.\nContinued on next page\n\nQuestion 4 - continued\nd. Copy the following diagram into your blue book and\nindicate the final state or states reached by the algorithm\non the energy landscape below at\ni. high temperature,\nii. low temperature, and\niii. with simulated annealing\nUse the indicated start position for each trajectory and\nassume that the algorithm terminates either when it\nreaches a steady state or after a very large number of\niterations.\ni\nii\niii\nMake your answer clear for each part. It may help to use\nseparate diagrams for each section i, ii, and iii.\nBe sure to number your steps for clarity, and include the\nanswer in your blue book! (Sketch the landscape, DOES\nNOT HAVE TO BE EXACT OR A WORK OF ART) (3\npoints)\n\ni)\ncould end up virtually anywhere - can walk uphill\nor downhill freely, and may not ever settle into a\nminima\nii)\niii)\nWould likely end up in one of the two local minima\nclosest to it (cannot make it uphill often)\nWould optimally find the global minimum, but may\nalso end up in the near-global minimum close to it\nor another local mininum\nA wide variety of answers were accepted here that either showed or stated\nunderstanding of the above concepts.\n\nQuestion 5 (10 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations where relevant. Excessively\nlong answers will not be graded.\na. Name three levels of protein representation discussed in class.\n(2 points)\natomic coordinates, amino acid sequence, dihedral angles, secondary structure,\ntertiary structure (only 3 were required)\nb. Give one advantage or disadvantage of using each representation.\n(2 points)\nAtomic coordinates require much more detail about the protein, whereas\nsecondary and tertiary descriptions are much more succinct, but lack the\n\"resolution\" of atomic coordinates.\nc. Below are structures of the naturally occurring alpha-peptides and of\na beta-3 peptide. If you are trying to make a protein therapeutic, why\nmight you prefer the beta-3 peptide over the alpha-peptide.\n(2 points)\nThe beta peptide is less likely to be cleaved by proteases and so your protein\nwon't be degraded as easily.\nd. For your first attempt at designing a therapeutic molecule out of beta\n3 peptides you synthesize a polymer of these peptides with the same\nsequence of side chains at the uR\" positions as in a naturally occurring\nglobular protein. Will this new molecular have the same function as the\nnaturally occurring version? Briefly explain your answer.\n(2 points)\nSince the residues themselves would have a different structure, it's likely that the\nstructure of the new peptide would have an altered secondary structure and\ndifferent function.\n\ne. What's the difference between positive and negative design? Why\nshould you do negative design? (Hint, think about Prof. Keating's bZIP\nproblems!)\n(2 points)\nIn positive design you are selecting for an advantageous property (such as\nbinding to a particular fragment of DNA) and in negative design you are trying to\nremove unfavorable qualities (such as reducing non-specific binding).\n\nQuestion 6 (20 points)\nDirections: Answer each of the following questions in your blue books\nwith just a few sentences. Include equations where relevant. Excessively\nlong answers will not be graded. (10 points for each part)\nA. You have discovered that there are three common alleles of a\ngene encoding a key signaling protein that regulates cell\ngrowth. These variants differ in the extent to which they are\nphosphorylated by a kinase called Exm320.\nThe kinase specificity is described by the following pattern:\nAXSP. All three protein variants contain this sequence. The\nhighest affinity variant has a short amino-acid insertion\napproximately 100 amino acids away from the site of\nphosphorylation.\nVery briefly explain how this sequence might increase the\nlevels of phosphorylation.\nThe Basic concept we were looking for here was allostery -\nthis extra site away from the site of phosphorylation interact\nwith the kinase favorably to increase binding.\nMost correct specific examples of allostery or explanations\nshowing understanding of how this site could impact\nphosphorylation were acceptable.\nContinued on next page\n\nQuestion 6 - continued\nB. The remaining two variants lack this region and differ in the\nsequences shown below. The site of the phosphorylation is\nindicated by an asterisk (*).\nYou presume that the difference in sequence must explain the\ndifference in their strength as substrates. To prove your\nhypothesis, you synthesize two peptides containing the sequences\nshown above. To your surprise and disappointment, you find that\nthey are both phosphorylated with equal efficiency.\nVery briefly provide a single plausible explanation for the\nobservations that (1) the bottom sequence causes the protein\ncontaining it to be a worse substrate than the top sequence and\n(2) the peptides containing these sequences are both equally good\nsubstrates. Your answer should not be the same one you used in\npart uA\". Rationalize your answer based on the relative positions\nol amino acids that vary among these sequences.\nEssentially, these amino acids likely are part of a helical sequence\n(hydrophilic residues on one side, hydrophobic on the other). Recall that\nhelices are too large to fit into kinase active sites, and must unwind in order\nto do so. This would likely cause the helical part of the bottom protein to be\nphosphorylated less frequently as unwinding takes energy. However, short\npeptides are often unstructured in solution, so these two peptides would be\nboth unstructured and therefore phosphorylated with equal efficiency.\nBest & Second Best\nSubstrates:\nA\nA\nL\nA\nG\nL\nA\nV\nI\nI\nA\nV\nS\nP\nPoor Substrate:\nA\nR\nL\nA\nD\nL\nA\nR\nK\nI\nA\nV\nS\nP\n\n*\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2011 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/db22135ce233f326462272f5569489d3_MIT20_320F12_2011Exam_1.pdf",
      "content": "WRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE\nGRADED.\n20.320 Exam 1\nThursday October 13th\n9:35-10:55\n\nInstructions:\n0. Write your name of the front cover of the blue book.\n1. Answer all questions in the blue books. This exam paper will not\nbe graded.\n2. All questions can be answered in at most a few sentences. We will\ndeduct points for excessively long replies, even if they contain the\nright answer.\n3. State all assumptions for each problem.\n4. In order to pace yourself please note that the maximum possible\nscore on this exam is 100.\n5. There are six problems on ten pages (total) in the exam.\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED. '\nQuestion 1 - Protein Folding and Synthesis\n(12 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations where relevant. Excessively long\nanswers will not be graded.\nYou are using a bacterial system to produce a protein to be used as a\ntherapeutic. The bacterial product is chemically pure and identical to that\nproduced in humans. However, the material you obtain is not\nenzymatically active. You presume that improper folding might be a\nproblem.\na. In your blue book, draw the thermodynamic \"pathway\" for a simple\ntwo-state model of protein folding on a reaction coordinate diagram,\nand label important features of the curve. Please label your axes as\nwell.\n\nb. Consider an experiment where you rapidly dilute a\nconcentrated, denatured protein and measure the rate at which it\nrefolds (your protein starts in urea, which denatures proteins, and is\ndiluted in aqueous solution). Write a differential equation for the rate\nof protein folding, determine the solution to the equation (it was\nsolved for you in class!) and qualitatively sketch how the \"faster\" and\n\"slower\" proteins would look on a plot of unfolded protein vs. time.\n(Assume that you can ignore the reverse reaction in which some of\nthe newly folded protein unfolds).\n\nc. You attempt to denature and refold the bacterial protein in vitro.\nWhile you are able to obtain some active protein, the yield is low.\nWhen you increase the initial concentration of your protein, the yield\nfrom the system drops further. What might cause this?\n\nd. You have identified mutations that increase your yield when the\nprotein is refolded at high concentrations. However, these mutations\nhave no effect on the yield when the protein is refolded at very dilute\nconcentrations. Provide an explanation for these observations.\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE\nGRADED.\nQuestion 2 - Sequence Motifs\n(20 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations and diagrams where relevant.\nExcessively long answers will not be graded.\nChIP-Seq is a common experiment that allows the experimenter to identify\npieces of DNA to which a particular protein is bound and is often used for\ndetermining sequence patterns for binding transcription factors.\nSuppose you decided to work with a transcription factor, yfp2 and ran a\nChIP-Seq experiment which showed that yfp2 bound to a 8-mer. You\ncalculate the probability matrix, given below:\na. Under this model, what is the probability of observing the most likely\nsequence? Why is it so low?\n\nb. Does the fact that the probability is so low suggest that the\ntranscription factor won't bind this sequence? Briefly explain.\nc. Write an equation for the log-likelihood ratio that you would use to\ndetermine whether a sequence was more likely to be a binding site\nfor yfp2 or a random region in this genome.\nContinued on next page\n\nA | 0.3\n0.1\n0.25 0.09 0.15 0.3\n0.2\n0.5\n\nC | 0.05 0.1\n0.6\n0.01 0.4\n0.01 0.2\n0.15\n\nG | 0.45 0.1\n0.05 0.2\n0.4\n0.19 0.3\n0.15\n\nT | 0.2\n0.7\n0.1\n0.7\n0.05 0.6\n0.3\n0.2\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED.\nQuestion 2 - continued\nd. In class we discussed the advantages of using sequence motifs over\nconsensus sequences. However, there are some features that\nsequence motifs do not capture. Carefully examine the sequences\nbelow, which are a representative part of a much larger data set.\n\nIdentify a sequence pattern that is not captured by a sequence motif\nbuilt from these sequences (even if you include pseudocounts). In\nother words, what types of sequences are unlikely to ever occur in\nthis full dataset but would be scored well by a motif built on these\ndata. (You do not need to compute the motif to answer this\nquestion).\n\n1 2 3 4\n10 11 12\nA C T A\nT T C G\nT\nA\nG\nT\nG G C A\nT T C G\nT\nG\nC\nC\nA G A A\nT T C G\nT\nT\nC\nT\nG G T A\nT T C G\nT\nA\nC\nC\nC C G T\nT T C G\nA\nC\nG\nG\nC T G C T T C G G\nC\nA\nG\nA A G C T T C G G\nC\nT\nT\nC G A C T T C G G\nT\nC\nG\nC A C G T T C G\nC\nG\nT\nG\nC T A G T T C G\nC\nT\nA\nG\nC G C G T T C G\nC\nG\nC\nG\nA A G A\nT T C G\nT\nC\nT\nT\nA A C T\nT T C G\nA\nG\nT\nT\nT G G T\nT T C G\nA\nC\nC\nA\nT A C T\nT T C G\nA\nG\nT\nA\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED. '\nQuestion 3 - Protein Secondary Structure\n(18 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations where relevant. Excessively long\nanswers will not be graded.\nChou-Fasman:\na. Why does Chou-Fasman perform less well on predicting sheets\nthan helices?\n\nb. Chou-Fasman is a knowledge-based algorithm. Explain what\nthis means and what the knowledge-based parameters are.\n\nc. List two reasons why you don't find Proline in an alpha helix.\nWhat about Glycine (one reason)?\n\nCoiled coils:\na. Looking down the length of one helix in a coiled coil, there is\noften a periodic patterning of hydrophobic and hydrophilic\nresidues. What is the period of this repeat?\n\nb. We looked at a general type of coiled-coil domain called a\nleucine zipper. Explain the importance of the leucines in this\ndomain.\n\nc. Suppose you wanted to create a new algorithm, based on\nChou-Fasman, that would search for coiled-coils in an amino\nacid sequence data. Describe briefly (no more than 3\nsentences) how your algorithm would work, and what data you\nwould need to be able to construct the algorithm.\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE\nGRADED.\nQuestion 4 - Levinthal's Paradox and Combinatorial Search\n(20 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations where relevant. Excessively long\nanswers will not be graded.\n\na. What does Levinthal's paradox tell us about how proteins\nactually fold?\n\nb. You're in luck! You have decided to work on your design\nproject, and the Athena cluster is completely empty tonight.\nYou anticipate you have time to explore 10^40 different protein\nconformations.\n\nYou are searching for a novel sequence that will fold into a\nstable structure. You intend to try every amino acid at every\nposition, and a reasonable number of backbone angles for each\nresidue. Please write an equation for the length of protein you\ncan design, and estimate the value of this equation. You do not\nneed to give a precise answer. Make sure you state any of\nyour assumptions.\n\nc. You quickly realize that you will not be able to search all\npossible conformations for a reasonably sized protein. Instead\nyou decide to search for the most stable conformation of each\npotential sequence using the type of Metropolis algorithm\ndescribed in class. Describe the steps in this algorithm.\nInclude simulated annealing in your answer.\n\nContinued on next page\n\nThis course makes use of Athena, MIT's UNIX-based computing environment. OCW does not provide access to this environment.\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED.\nQuestion 4 - continued\n\nd. Copy the following diagram into your blue book and indicate the\nfinal state or states reached by the algorithm on the energy\nlandscape below at\ni. high temperature,\nii. low temperature, and\niii. with simulated annealing\n\nUse the indicated start position for each trajectory and assume\nthat the algorithm terminates either when it reaches a steady\nstate or after a very large number of iterations.\n\ni\nii\niii\n\nMake your answer clear for each part. It may help to use\nseparate diagrams for each section i, ii, and iii.\nBe sure to number your steps for clarity, and include the\nanswer in your blue book! (Sketch the landscape, DOES NOT\nHAVE TO BE EXACT OR A WORK OF ART)\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE\nGRADED.\nQuestion 5 (10 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations where relevant. Excessively long\nanswers will not be graded.\na. Name three levels of protein representation discussed in class.\n\nb. Give one advantage or disadvantage of using each representation.\nc. Below are structures of the naturally occurring alpha-peptides and of a\nbeta-3 peptide. If you are trying to make a protein therapeutic, why might\nyou prefer the beta-3 peptide over the alpha-peptide.\n\nd. For your first attempt at designing a therapeutic molecule out of beta-3\npeptides you synthesize a polymer of these peptides with the same\nsequence of side chains at the \"R\" positions as in a naturally occurring\nglobular protein. Will this new molecular have the same function as the\nnaturally occurring version? Briefly explain your answer.\n\ne. What's the difference between positive and negative design? Why\nshould you do negative design? (Hint, think about Prof. Keating's bZIP\nproblems!)\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED.\nQuestion 6 (20 points)\nDirections: Answer each of the following questions in your blue books with\njust a few sentences. Include equations where relevant. Excessively long\nanswers will not be graded.\nA. You have discovered that there are three common alleles of a gene\nencoding a key signaling protein that regulates cell growth. These\nvariants differ in the extent to which they are phosphorylated by a\nkinase called Exm320.\nThe kinase specificity is described by the following pattern: AXSP. All\nthree protein variants contain this sequence. The highest affinity\nvariant has a short amino-acid insertion approximately 100 amino\nacids away from the site of phosphorylation.\nVery briefly explain how this sequence might increase the levels of\nphosphorylation.\nContinued on next page\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED. '\nQuestion 6 - continued\n\nB. The remaining two variants lack this region and differ in the\nsequences shown below. The site of the phosphorylation is indicated\nby an asterisk (*).\nYou presume that the difference in sequence must explain the\ndifference in their strength as substrates. To prove your hypothesis,\nyou synthesize two peptides containing the sequences shown above.\nTo your surprise and disappointment, you find that they are both\nphosphorylated with equal efficiency.\nVery briefly provide a single plausible explanation for the\nobservations that (1) the bottom sequence causes the protein\ncontaining it to be a worse substrate than the top sequence and (2)\nthe peptides containing these sequences are both equally good\nsubstrates. Your answer should not be the same one you used in\npart \"A\". Rationalize your answer based on the relative positions of\namino acids that vary among these sequences.\n\nBest & Second\nBest Substrates:\nA\nA\nL\nA\nG\nL\nA\nV\nI\nI\nA\nV\nS\nP\nPoor Substrate:\nA\nR\nL\nA\nD\nL\nA\nR\nK\nI\nA\nV\nS\nP\n\n*\n\nWRITE ALL ANSWERS IN YOUR BLUE BOOKS. THIS PAPER WILL NOT BE '\nGRADED. '\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2011 Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/c7b4e678a14e5e26ea9c9e6916137757_MIT20_320F12_2011Exam2.pdf",
      "content": "20.320 Exam 2\nThursday November 17th\n9:35-10:55\nInstructions:\n0. Write your name of the front cover of the blue book.\n\n1. Answer all questions in the blue books. This exam paper will not\nbe graded.\n\n2. All questions can be answered in at most a few sentences. We will\ndeduct points for excessively long replies, even if they contain the\nright answer.\n\n3. State all assumptions for each problem.\n\n4. In order to pace yourself please note that the maximum possible\nscore on this exam is 100 - note that there are 4 total questions.\n\nQuestion 1. (18 points total)\nBnndnngofmmotohasbhawbeennmpencatednnactnhatnngthehbeMeecawcadep\nTobeoccthnwnnteractnonaearge-wcaeewcreenofawmaeemoeecheeenbrarthawbeen\nperformedpThnwanaetwnwndentnfnedawnngeewtrongbnnderoMeTmo1,moeechear\nwenght:M1ggwmoeotothemmommmdomannp,bhnohwet,fhrtherbnophtwncae\ncharacternzatnonnwwarrantedpmpecnfncaeet,cnnetncparameterwwneeheepto\ndetermnnehoweongthecompohndwneewtatbohndtothemmmdomannomoeechear\nwenghtofthemmommmdomannnw1e,gmeDaonote1Dah1gwmoeoo,whnchwnee\nnnformawtothepotentnaeforthnwcompohndtobehwedawatherapehtncp\naoogponntwoTogeneratethewecnnetncparameterwanmebespernmentnw\nperformed,bhttherenwonetaenmntedamohntofmmommmdomannahaneabee,whch\nthatonettwoanaetwewwereperformedpoaecheateed,con,andcoff gnhenthattobwh\n14mnnhtewwnthaprotennconcentratnonof1e-8M,andtobw hmimnnhtewwnthan\nnnntnaeprotennconcentratnonof1e-9M\nbearrangnng,\nmhbtract the two eqhatnonwto get\nmoehnng,wegetconh3p8m1eMM-1mnn-1oorMp3Me4M-1w-1opefwethenpehgthatnntoenthereqhatnon, we\ngetcoffhepe33mmmnn-1 oor gpge-4w-1opeD hcoffwcon h8pM9me-9Mp\n\nboogponntwoanhentheenmntedamohntofmmommmdomannahaneabee,tohwantthe\nespernmenttobeawwhortawpowwnbeep>nththatwand,ntnwwtneeagoodndeatohahe\nthewtwtemreacheqhnenbrnhmprnortowtoppnngthefeowofthemmommmdomannp\nmoweongwneenttacetoreach9gbeqhnenbrnhmnneachoftheabohecawewy\nbUotohbUeq o1-e-cobwtto\nh41p9mnnhtew,8ep9 mnnhtew for 1e-8,1e-9 M,rewpectnheetp\nooo4ponntwosortheabohecaweofMeTmo1nnteractnngwnththemmommmdomann,\ndoewntmacewenwetoperformaneToespernmentyhspeanntohranwwerp\nThereareanhmberofgoodreawonwwhtwemnghtnotbennterewtednndonnganeToespernmentpeTo\ndoewnottneedcnnetncparameterw,and hencenwofenmnted hwenfwe areprnmarnetnnterewted nn cnnetncw\nowhnch nw the wtated nn the qhewtnonopddntnonaeet,ntnwwtatedwe hahe enmntedmaternae,andeToreqhnrewa\neargeamohntofmaternaeogeneraeetopsnnaeet, theeD nwabnteow foreTo,technncaeet ohtwnde the 1e-8 to 1e-g\nM rangep\nDoo4ponntwobegardeewwoftohranwwertoooo,howmhchmaternae,forboth\nMeTmo1andthemmommmdomann,wohedtohneedtocondhctaneToespernmenty\nsoreTo,wewant aprotenn concentratnon nn the range\n,wo watee hmeeD h1pie-iMpLLle\noconcentratnonnnnnjectnonwtrnngeowhohedbeaboht1etnmew Lele,wo wat1pie-MMpmnnceweneed l1mL\nprotenn woehtnon and wat we do me 1ehL nnjectnonw, weneed1pie-1emoeand3p4e-1e moe of protenn and\nengand,rewpectnheetoarghabettohmnghtneedtodohbeethe engandamohnttoaccohntforthennjectnonw\nnntothereferenceceeepaohcancaecheatetheweamohntwhwnngthecnownatomncmawwewp\n\nQuestion 2. (33 points total)\nwwehahednwchwwednnceawwmhetnpeetnmew,hpndermaearowthsactorbeceptor\nohasbowngnaenngnwacrntncaeawpectofnormaephtwnoeogt,tetdtwregheatedhasb\nwngnaennghawbeennmpencatednnaharnettofdnweawewtatew,nncehdnngmhetnpee\nhhmancancerwpLawtteartheLemmoneabphbenwhedamanhwcrnptwhnchceanmed\nthathasbdnmernzewandthenweqhentnaeetbnndwtwomoeecheewofhastofnnaeet\nformthewngnaenngcompetenttetramerocomprnwedoftwohasandtwohasb\nmoeecheewopThnwtetramerfnnaeeteeadwtophowphorteatnonandactnhatnonofmant\ndownwtreampathwatw,nncehdnngthehbe-MeecawcadepTownmpenftthnwwtwtem,\nawwhmethatthetetramerdnrectetphowphorteatewandactnhatewhbeotohcan\nawwhmeawnngeeactnhatnngphowphorteatnonwnteonhbetownmpenftthemodee\nfhrtherophbephowphorteatnonnwregheatedbtaconwtnthtnheetactnhephowphatawe\noeIawe1op\no o4ponntwooreateawchematncdnagramofthnwwtwtempsortohrmodee,toh\ncanawwhmethatbothhasbprotennwarendentncaep\nBo o1eponntwo>rnteohttheordnnartdnfferentnaeeqhatnonwdewcrnbnngthnw\nwtwtemp\noo o4ponntwoenthemanhwcrnpt, theahthorwceanmthatbnndnngofthefnrwt\nengandpartnaeetobwchrewthebnndnngpoccetforthewecondengand,whchthat\nhasbdnwpeatwnegatnhecooperatnhnttnnengandbnndnngpmowdoewthnwaffect\ntohrwtwtemofeqhatnonwy\nDo oMponntwomeheraeeabwhahedeheeopedantnbodnewthatbeocchasb\ndnmernzatnonpddthnwcomponenttotohrwtwtem,awwhmnngreherwnbee\nantnbodtbnndnngtothereceptor,andwrnteohtantneweqhatnonwpmcetch\napeotewtnmatnngtheeeheeofhbephowphorteatnon versus amount of E45\naddedpmowdoewthnwdnagramchangewnthaddntnonofdnfferentamohntw\nofthednmernzatnonbeoccnngantn-hasbantnbodty\nho oMponntwoenmhetnpeephbencatnonwntnwceanmedthattherenwanegatnhe\nfeedbacceoopnnwhnchhbephowphorteatewhasbothewngnaenng competent\ntetramerotowhhtdownwngnaenngpddthnweooptotohrwtwtemandwrnte\nohtantneweqhatnonwotohdonothahetoaddnttopart,bhtcannftoh\n\nwantahnwhaereferenceopmcetchapeotdewcrnbnngthehbephowphorteatnon\nover time following addition of E45,wnthandwnthohtthnwnegatnhe\nfeedbacceoopp\nso oMponntwoanhentohrnathraewcnentnfncwceptncnwm,tohdecndetohwetohr\nmodeetotewtwhetherthnwwamefeedbacceoopohbephowphorteatnonof\nhasbocohedbeapowntnhefeedbaccnnwteadofa negatnhefeedbaccp>rnte\nohtantneweqhatnonwthatwohedbenecewwarttotewtthnwtheortpmcetch\napeotdewcrnbnngthehbephowphorteatnon over time following addition of\nE45,wnththnwpowntnhefeedbacceoopnnpeacep\n\nQuestion 3. (26 points total)\nBigeharmaoo. has recently developed two new Te-competitive inhibitors for the\nmbo tyrosine kinase that they are calling ol and o2. n in vitro kinase test has\nbeen performed with 3 mM Te, 50 micromolar mbo, and l mM pl30oas, a mbo\nsubstrate with 5 micromolar Km. In this test, ol has demonstrated an Io25 of 35\nnM, while o2 has an Io25 of K7 nM onote that Io25 is defined as the inhibitor\nconcentration at which 25% of the activity is remainingo.\no o6 pointsooalculate the Ki value for eachol and o2.ssume Km for mbo\nTe is 50 micromolar.\nBo o7 pointsoYou want to model this reaction, but are unsure if the reaction\nconditions satisfy the assumptions necessary for the Michaelis-Menten\napproximation. In the absence of inhibitor, does this in vitro kinase test\nmeet the criteria for M-M kinetics? erovide a quantitative answer.\n\noo o7 pointsoDoes the presence of the ol inhibitor at Io25 alter your\nanswer? erovide a quantitative answer.\nMichaelis-Menten is still valid for the original substrate so no, the answer\nshouldn't change. You can still assume that Δm/m «« l. However, if you were\nanylyzing the depletion of Te as a substrate, this might not hold since the\neffective KM has changed for Te binding.\nDo o6 pointsos an Te analog, might be better to re-design ol to be a non\ncompetitive inhibitor oe.g. re-factor to be a Type II inhibitoro. ssuming that\nthe Ki does not change after refactoring, how much has the inhibitor\nimproved? In other words, at the same concentration of inhibitor, how\nmuch has the reaction been inhibited by the competitive vs. non\ncompetitive inhibitor?\n\nQuestion 4. (20 points total)\nShort answers - one to three sentences.\nao oK pointsomtrong positive feedback is potentially very dangerous for the\ncell, yet is critical for selected biological processes. Name one of the these\nprocesses and describe the role of strong positive feedback.\nThe example we covered in class is during development, strong positive\nfeedback allows a cell to continue through to its differentiated state, even\nthough the input signal may shut off oa cell stopping halfway through\ndifferentiation would not be effectiveo. Many other examples from biology\nare appropriate here.\nbo oK pointsoTo calculate ΔH from an ITo experiment, does it matter if multiple\ninjections are performed simultaneously? hxplain.\nΔH is a state function onot a state experiment - experiments don't have\nstates!o , so you could get this value by performing all injections\nsimultaneously.Multiple injections are useful to curve fit for Kd, and also to\ngive more data points to better constrain deltaH. However, injecting all at\nonce will result in the same cumulative value of heat released.\nco oK pointsos discussed in class, protein microarrays can be used to\nestablish Kd values for a large number of combinations of interactions. Is it\npossible to use mass spectrometry to generate this same sort of data?\nJustify your answer.\nYes, you could envision a way in which oas long as the complex is not\nsensitive to the ionization processo you could add in different amounts of\nligand, and do Mm to see how much complex is formed, and use this\ntitration curve to get Kd oin fact, this is often done for small moleculeso.\ndo o3 pointso Name three ways the cell regulates the catalytic rate of a given\nenyzme.\nThe three covered in class were:\nl.o Transcription/Translation\n2.o Localization\n\n3.o eost-translational modification\nMany answers were acceptable, as long as it was correct/justified if not\nobvious how it would work.\neo o5 pointsohxplain how scaffolding proteins can both promote downstream\nsignaling and prevent it from reaching maximal signals. oite examples from\nclass where relevant\nIn earticular, we covered mte5 as a yeast scaffold which binds ste7, stell,\nand fus3. mte5 can promote downstream signals by bringing all of the\nnecessary kinases in proximity of each other, and can prevent downstream\nsignal form reaching maximal signals by binding tightly to the\nphosphorylated form of fus3, or by in low concentrations of kinase, having\none kinase bound to each scaffold so few scaffolds have all three kinases\nbound. Note, ste5 by itself is N,T a kinase!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2012 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/c3314a14bf83d9859309280903503074_MIT20_320F12_2012Exam1_esh.pdf",
      "content": "20.320 Exam 1 Equation Sheet\n\nG RT ln(Kd )\n1 RU = 0.0001° = 1 pgjmm2\n\nR = 1.987 cal mol-1 K-1\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2012 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/da676903d7a3b0dcea2242f30d2b46f7_MIT20_320F12_2012Exam1_Sol.pdf",
      "content": "20.320 Exam 1\nThursday October 4th\n9:35-10:55\n\nInstructions:\n0. Write your name of the front cover of the blue book.\n\n1. Answer all questions in the blue books. This exam paper will not be graded.\n\n2. All questions can be answered in at most a few sentences. We will deduct\npoints for excessively long replies, even if they contain the right answer.\n\n3. State all assumptions for each problem.\n\n4. In order to pace yourself please note that the maximum possible score on\nthis exam is 100 - note that there are 4 total questions.\n\nQuestion 1. (25 points total)\nXaomodomannsaaeoaotenndomannsthatbnndtoanetyeatedeysnnesosnmneaato\nxH2pohosohotyaosnnennteaantnonsDDQayXaadneaatHaaaaadhasaenentey\ndeaeeooedQ1p1maneeepoeameabeesmaeemoeengeeomassmlm2gumoeDthatbnnds\nandnnhnbntsasgbsetofbaomodomannsDbntheeabmyogwogedeneetodeteamnne\ntheaffnnntybetweenQ1p1andXadnomassm2mml)mgumoeDmyogabaomodomannof\nnhonneD\nAD o9oonntsDXesngnanxpeemoeanmenttoygantnfythennteaantnonaffnnnty\nbetweenQ11andXadnmnnnegdnngoaooeanontaoesandwhnnhmoeengeens\nnmmobnenzedDehedetanesofemanteyhowxpewoaesaaenotnantnnaeto\nansweathnsygestnonDQgstnfyyoganmmobnenzatnonseeentnonbynaengeatnng\nthengmbeaofnaotgaedmoeengeesneededtoobtanna1cevsngnaenhange\nnnbothnonfnggaatnonsDototemassgmea1cmm2 nhnosgafaneaaeaDD\neomamnmnzethesngnaeobtannedwntheanhoaotennbnndnngeaentmwewantto\nnmmobnenzetheenghteaoaotennoQ1p1DonthesgafaneDXganngthexpeemoeanmentm\nwethenfeowsoegtnonnontannnngtheeaageaoaotennoaeatheoeateandmeasgae\ntheevasDtnmeoaofneeD\nOnenmooatantnontaoenstoagnsoegtnonnontannnngtheeaageaoaotennoaeaaoeate\nthatdoesntthaaeanynmmobnenzedoaotennDChangesnnevdganngthnsnontaoemay\nnndnnateootentnaenonpsoennfnnbnndnngD\nAnotheanmooatantnontaoenstoagntheemoeanmentmgetnoeetnmesgsnngdnffeaent\nengandnonnentaatnonsDeheaesgetsbetweentheseemoeanmentsshogedbe\nnonsnstentD\nbmmobnenzeXeXn\nbmmobnenze\nCeeaaeymbynmmobnenznngQ1p1mweneedfaafeweabnndnngeaentstoobtanna1cev\nshnftandthgsntnstheeognnaenhonneD\n\nXD o1coonntsDvnaenthefoeeownngoaaameteasm\neon =lm1cm >moep1 sp1\neoff =mm1cp2 sp1\nHoweongwneenttaeetonomoeetetheemoeanmentgsnngaengand\nnonnentaatnonof2ccm1cp9Mmassgmnngtheassonnatnonaeanhes9ca ofnts\neygnenbangmaaegebefoaeengandstoosand9caoftheassonnatedengand\ndnssonnatesbytheendoftheemoeanmentA\nehetnmeaeygnaednsnomoosedoftheassonnatnontnmem\nmandthednssonnatnon\ntnmem\nD\nFoatheassonnatnonohasem\nFoathednssonnatnonohasem\ntotethat\nnoaaesoondstotheaaegeof afteatheassonnatnonohasens\nteamnnatedmnottheantgaeeygnenbangmevDvndeastandnngthedeanaatnonfoa\nwasantaefoagndeastandnngthnsoonntD\neheaefoaemthetotaetnmens\n\nCD oloonntsDAethogghxpensaaeayooweafgeaooaoanhmntdoeshaaesome\nenmntatnonsDpaoandetwoenmntatnonsanddesnanbehowyogwogedenowthat\ntheyaaeaffentnngyogameasgaementsD\n1D MgstnmmobnenzeengandonsgafaneDAttanhmentnanaffentnhemnstaymsgnh\nasbeonenngthebnndnngsnteDuogwogedenowbenagseyogwogednot\nobseaaeanybnndnngeaenwhenyogwogedemoenttoD\n2D Kd mgstbebetween1cpm and1cp12 MDuogwogedenowbenagsebeeow1cp12\nyogwogedseeneaaeynnstantaneogsbnndnngandnodnssonnatnonDAboae1cpm\nyogwogedneaeagetanybnndnngD\nlD tonpsoennfnnbnndnngnaneeadtosoganogsaesgetsDuognogedsee\ngnaeasonabeeaaegesofKdDuognogedagnanontaoewnththeengandsoegtnon\nbefoaenmmobnenznngtheoaotennonthesgafanetoseenfanybnndnngonngasD\nehnsbnndnngwogedthennndnnateootentnaeeysoganogsbnndnngD\n\nQuestion 2. (25 points total)\nOaeaemoaessnonoamgtatnonoftheRondeamaevaowthFantoaeeneotoaoRvFeDhas\nbeenassonnatedwnthabaoadaangeofnanneasDAsdnsngssedmtheaeaaemany\nnomoannesthathaaedeaeeooedmoeengeaaeyptaagetedtheaaoegtnnsmandseaeaaeof\nthesenomoogndsaaeAepanaeogsdesngnedtonnhnbntRvFeDOneofthese\nnomoogndsmvefntnnnbmnsngaaenteyaooaoaedfoaegngnanneaoatnentswnthhngh\nRvFeemoaessnonoawnthseeentedantnaatnngmgtatnonsnnRvFeDKmfoatheRvFep\nAepnnteaantnonns)cm1cpl MmenatfoaRvFepAepns1cl senp1mandKn foatheRvFep\nvefntnnnbnnteaantnonns22m1cp9MDAepnonnentaatnonnntheneeenslm1cplMD\naD o1coonntsDXgetodosepenmntnngtomnnntymthenntaaneeegeaanonnentaatnonof\nvefntnnnbnsenmntedto1ccm1cp9MDHoweffentnaensthnsdoseatshgttnng\ndownRvFeantnantyA\nWenangsetheaeggeaaMMeygatnonandtheMMeygatnonwnthanomoetntnae\nnnhnbntoatodeteamnnetheaedgntnonnnaeantnonaateasfoeeowsm\nehnsmeansthattheaateoftheaeantnonWbeHthennhnbntoans9lathatofthe\naeantnonWbeHOvethennhnbntoaDabnhnbntnonnsgnaenby1pcD9lDeheaefoaemntoney\naedgnestheaatebyaoggheylD9ma\nbD omoonntsDHowmgnhdoesRvFennhnbntnonnhangennneeesemoaessnng1cl\nnoonesofRvFeaeasgsneeesemoaessnng1cm noonesofRvFeA\n\neheeygatnonfoaanuansnotdeoendentontheenzymenonnentaatnonmsothe\noeanentnnhnbntnonnsthesamefoaboth1cm and1clDHoweaeamthetotaengmbeaof\nnnhnbntedaeneotoasnsdnffeaentD\n1cmmGccaeneotoasnnhnbnted\n1clmGcmcccaeneotoasnnhnbntedo1ccfoednhangeD\nnD omoonntsDWhynsastaongnnnaeasennemoaessnonofRvFeoftenassonnated\nwnthnanneameaennntheabsenneofengandstnmgeatnonA\nehennnaeasennthengmbeaofoaotennsaeeowstheoaotennsnntheneee tosamoee\nmoaenonfoamatnonsDehgsmmoaeRvFeaeneotoassoontaneogseyooenthenaantnae\nsnteandaeeowAeptoenteaeaennntheabsenneoftheantnaatnngengandDAsa\naesgetmtheseneeesaaemoaeoaonetodnmeanznngandantnaatnngtheRvFeoathway\nandntsassonnatedantnpaooototnnandoaopsgaanaaeoaognosnsD\nOtheaansweasanneotednnnegdedaefeaennestoRvFeantnaatnngmgtatnonsm\naeteaedaoeeoffeedbanennnanneasgnhthatmoaeandmoaeaeneotoansgeneaatedm\netnDxtatnngthatRvFedanaesoaoenfeaatnonwhnnhagnsaamoantnnnanneabxtOe\nenogghheaeD\ndD oloonntsDXesnanbehowthemenhannsmofantnonofaeyoebbnnhnbntoa\ndnffeasfaomthatofanAepanaeoggeD\nAnAepanaeoggebnndsnomoetntnaeeytotheAepbnndnngooneetmbeonenng\nantnaatnonofRvFebyoaeaentnngnnteaantnonwnthntsnenessaaynopfantoamnameey\nAepDAeyoebbbnhnbntoabnndstheXFvogtmotnfwhentheenzymensnnthe\nnnantnaestateandbeonestheooennngoftheantnaatnoneooomwhnnhnsnenessaayfoa\ntheenzymetobnndAepandsgbstaateDWnth aesoenttoAepmeyoebbnnhnbntoasnan\nbenonsndeaedanonpnomoetntnaennhnbntoaaethogghntnsmoaenomoennatedthen\nthnsnnaeaentyD\neD omoonntsDvnaenananneaneeeennewnthanantnaatnngRvFemgtatnonmwoged\nyoggseaeyoebbnnhnbntoaoaanAepanaeoggennhnbntoaandwhyA\n\nXgetothemgtatnonmtheennasewneeaewaysbeantnaeDAsaaesgetmatyoebb\nnnhnbntoawneebenomoeeteeynneffentnaeasntsfgnntnonnstooaeaenttheennase\nfaomtaansntnonnngnntotheantnaenonfoamatnonDAsaaesgetmtheAepanaeogge\nwogedbethenoaaenttaeatmentootnon\n\nQuestion 3. (35 points total)\nAsdnsngssednneentgaemthemntogenpantnaatedoaotennennaseoMApKDnasnadens\ngetaasensntnaemdemonstaatnngaeaystaongaesoonsetoeowpeeaeennogtDMany\notheasngnaenngsystemsaesofeatgaegetaasensntnantyDOneofthesenstheCXK1\noennaseDpCXC2)oohosohataseDnnteaantnonmwhnnhaeggeatestheneeenyneeDbna\naenentmangsnanotoptAxm2c12Dm>getaeDdeaeeooedanomogtatnonaemodee\ndesnanbnngmgetnpsnteohosohoayeatnonofCXC2)byCXK1mwheaethemgetnoeyp\nohosohoayeatedCXC2)ohosohatasensfgeeyantnaeDFoasnmoennntynnthnsmodeem\nassgme2CXK1pdeoendentohosohoayeatnonsntesonCXC2)Dbntheoaatsthat\nfoeeowmoeeasedesngnateCXK1asAand CXC2)asXandgsethenomenneatgae\nfaomneasstodesnanbenomoeemesandohosohoayeatedsoennes oXpnsXthattsbeen\nohosohoayeatedonnemXppnsdogbeepohosohoayeatedDDeemembeatostateyoga\nassgmotnonsH\nAD oloonntsDWanteogtthenhemnnaeaeantnonsfoatheaboaesystemDuognan\nstaatwnthohosohoayeatedmantnaatedCXK1D\ne1\nenat1\nep1\ne2\nenat2\nep2\nWhat we looked form\n- Mnnhaeensmentenennetnnsmwnthbothaaeaeasnbeebnndnngsteoandan\nnaaeaeasnbeenataeysnssteofoaeanhoaeaaeeoaotennpsgbstaatennteaantnonD\n- AntnaeCXK1oAmAImoaApJnomenneatgae nogedgomanywaysDantnngasa\nennasemogttnngohosohategaogosonXoneatatnmeDeheseohosohates\nnamefaomenanaonmentaeAepD\n- ehatCXK1antedasanenzymemnotaaeagentDehnsmeansthatntbxtOe\nCHAtvRXXueHReRACebOtxbeCAeA>uKRxDehatnsmntdoesnottaansfeants\nownohosohatestoXmeaeaDKnnasesdonttdothatD\n\nXD o12oonntsDWanteogtOXRsfoaeanhsoennesD\nWegaadedOXRsbasedonwhetheatheynoaaenteyaefeentedthenhangesnn\nwhnnheaeamodeeyogwaotennoaatAmeaennfthemodeewasnnnoaaentDWe\nseaanhedfoaoaooeamasspantnonennetnnsD\nCD omoonntsDWhataaetheeeyoonntsnnthnssystemthateeadto\ngetaasensntnantyA\nehe2psteodnstanbgtnaeohosohoayeatnonofCXC2)mWhenCXK1oeafoamsthe\nfnastaeantnonmntnsnnnaeasnngoaatheathandenaeasnngDthenonnentaatnonofnts\nootentnaesgbstaatesandtheoaeaaeeaeantnonaategoesgoDxeoaaatnngogtthe\noaonessnntononsengtnaesteoseneethnsgnaesntgetaasensntnantyD\nXD oloonntsDFaomadesngnoeasoentnaemhownogedyognnnaeasethe\naesoonsnaenessofthesystemA\nuognogedaddmoaeeeaeestothenasnadeoeDgDmaddanotheaohosohoayeatnonp\nantnaatedoaotenntothenhannDDuognogedaddaoosntnaefeedbaneeoooDuog\nnogedaesoaddnoooeaatnantymgnanngCXK1amgnhhngheaaffnnntyfoathe\nohosohoayeatedaeasnonofCXC2)D\nRD o1coonntsDOneofthesgbstaatesofCXC2)nstheCXK1ennaseD Addthns\naeantnonnntoyogasystemandaddnntheaddntnonaeOXRosDaefeentnngthns\n\naeantnonDWhatbnoeognnaeoannnnoeedoesthns nntaodgnenntothesystemand\nwhynsntgsefgeD\nel\nepl\nenatl\nWetdmentnonedthatAwasnnanantnaemohosohoayeatedstateDbfXma\nohosohatasemhasAasasgbstaatemthenXdeantnaatesAbyaemoanngthe\nohosohateDWeeooeedfoamodeesthataefeentedXdeantnaatnngAmwnthMnnhaeensp\nMentenennetnnsDAgannmXnsanenzymenn thnsnaseDbtnsnotnhangedbythe\naeantnonntnataeyzesDAmhoweaeamnsnowasgbstaateand is nhangedD\nWeneedtoaeteatheOXRsfoaAandXpppandaddaddntnonaeOXRsfoathenew\nnomoeemandthennantnaefoamofCXC2)m\neheaddntnonofthnsaeantnonaesgetsnnthenntaodgntnonofanegatnaefeedbane\neooonntothesystembenagseXpppdeantnaatesADtegatnaefeedbaneeooos\nattengateaesoonsesandmmostnmooatanteymtganthemnnto a shoatpenaedogese\naatheathananontnngedantnaatnonDeheynanbegsedtonaeatetaansnent\nantnaatnonwaaesD\n\nQuestion 4. (15 points total)\nShort answers - one to three sentences.\naD oloonntsDXesnanbewhatnnfoamatnonyognanobtannfaombeCandnotfaom\nxpeandanneaeasaD\nFaombeCmonenanobtann\nwhnnhaaenotattannabeefaomxpeDtotem\nhoweaeamthat nanbeobtannedfaombothtyoesofemoeanmentsD\nFaomxpemonenanobtanntheennetnnaatenonstants\nmwhnnhonenannot\nnaengeatefaomanbeCemoeanmentD\nXothnandeteamnneKXD\nbD oloonntsDHowdoesstaongoosntnaefeedbaneaffentthedgaatnonand\namoentgdeoftheennasesngnaenngnasnadeA\nxtaongoosntnaefeedbanennnaeasesboththeamoentgdeanddgaatnonoftheennase\nsngnaenngnasnadeD\nnD oloonntsDtameoneaeasonwhytheygantntatnaennteaantnonaffnnntnesand\nennetnnsgeneaatedbysgafaneoeasmonaesonanneoxpeDmaynotbe\naooennabeetomodeenngaeantnonsnnneeesD\nbmmobnenznngaoaotennnogednhangentsnonfoamatnonmootentnaeeyeeadnngtoan\nnnnoaaentKX aaegenfthebnndnngsntensbeoneeduaeteaedDAesosnnnetheoaotennns\nnmmobnenzedmweaaenotabeetoannogntfoaanymgetnmeanzatnonm noooeaatnantymoa\nnomoetntnonwnthotheabnndeasthatmayaansenoamaeeynntheneeesD\ndD oloonntsDXesnanbetheosegdofnastoadeaaooaomnmatnonopFOADDbsthns\naooennabeennbeCandxpeAWhyoawhynotD\nehepFOAassgmesthatthebgeenonnentaatnonofsgbstaatedoesnotnhangeand\ntheaefoaeaemannsatntsnnntnaeaaege Dbnoadeafoathnsassgmotnontobeaaendm\ntheamogntofsgbstaatennthebgeetobegnnwnthmgstgaeateyemneedthatwhnnh\nwneeoaatnnnoatennbnndnngoaaeantnoneaentsDbtnsnotaooennabeennbeCbenagse\naeaysmaeeaoegmesofengandaaenn.entedDbnnontaastmntnsaaendnnxpebenagsean\nemnessofengandpnontannnngsoegtnonfeowsoaeathesgafaneD\n\neD oloonntsDXesnanbeonetenhnnygethatnanbegsedtodeteamnnenftwo\noaotennsnnteaantnnantaoD\nWeweaeeooenngfoaaaaenddesnanotnonoftenhnnyges sgnhasnopbpmFeReandp>AD\nxeeneassnotesondetanesofthesetenhnnygesD\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2012 Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/cc0a830811f8ecd595a613cc516cff1d_MIT20_320F12_2012Exam_1.pdf",
      "content": "20.320 Exam 1\nThursday October 4th, 2012\n9:35-10:55\nInstructions:\n\n0. Write your name of the front cover of the blue book.\n\n1. Answer all questions in the blue books. This exam paper will not\nbe graded.\n\n2. All questions can be answered in at most a few sentences. We will\ndeduct points for excessively long replies, even if they contain the\nright answer.\n\n3. State all assumptions for each problem.\n\n4. In order to pace yourself please note that the maximum possible\nscore on this exam is 100 - note that there are 4 total questions.\n\nQuestion 1. (25 points total)\nBromodomainsareprotein domainsthat bindtoacetylatedlysines(similarto\nSH21phosphotyrosine interactions).JayBradneratHarvard hasrecently\ndevelopedJQ11,acell1permeablesmall molecule(mass:642g/mol)that binds\nandinhibitsasubset ofbromodomains.Inthelab, youwouldliketodetermine\ntheaffinitybetweenJQ11andBrdX(mass:24,354 g/mol),yourbromodomainof\nchoice.\nA) (9points)Designan SPRexperimenttoquantifytheinteractionaffinity\nbetween JQ1andBrdX,includingproper controlsandwhich moleculeis\nimmobilized. Thedetailsofexactlyhow SPRworksarenotcriticalto\nanswerthisquestion.Justify yourimmobilizationselectionby calculating\nthenumberofcapturedmoleculesneededtoobtaina10RUsignalchange\ninbothconfigurations. (Note:assumea10mm2 chipsurfacearea).\nB) (10points) Giventhe following parameters:\nkon =3x104 Lmol11 s11\nkoff =4x1012 s11\nHowlong will ittaketocomplete theexperiment usingaligand\nconcentrationof200x1019M, assumingtheassociationreaches90%ofits\nequilibriumvaluebeforeligandstopsand90%oftheassociatedligand\ndissociatesbytheendoftheexperiment?\nC) (6points)Although SPRisavery powerfulapproach,it does havesome\nlimitations.Providetwolimitationsand describehowyouwouldknowthat\ntheyareaffectingyourmeasurements.\n\nQuestion 2. (25 points total)\nOverexpression ormutation oftheEpidermalGrowth FactorReceptor(EGFR)has\nbeenassociatedwithabroad rangeof cancers.Asdiscussed, thereare many\ncompaniesthathavedevelopedmolecularly1targetedtherapeutics,andseveral of\nthesecompoundsareATPanalogsdesignedtoinhibitEGFR.Oneofthese\ncompounds,Gefitinib,iscurrentlyapprovedforlung cancerpatientswith high\nEGFRexpression orwithselectedactivating mutationsinEGFR.KmfortheEGFR1\nATPinteractionis50x1016 M,kcatforEGFR1ATPis106 sec11, andKi fortheEGFR1\nGefitinib interactionis22x1019M.ATPconcentrationinthecellis3x1013M.\na) (10points) Duetodose1limiting toxicity,theintracellularconcentration of\nGefitinib islimitedto100x1019M.Howeffectiveisthisdoseatshutting\ndownEGFRactivity?\nb) (4points)HowmuchdoesEGFRinhibitionchangeincellsexpressing106\ncopiesofEGFRversuscellsexpressing104 copiesofEGFR?\nc) (4points)WhyisastrongincreaseinexpressionofEGFRoften associated\nwithcancer,even intheabsence ofligandstimulation?\nd) (3points)DescribehowthemechanismofactionofaTypeIIinhibitor\ndiffersfromthatofanATPanalogue.\ne) (4points)Givenacancercell linewithanactivating EGFRmutation,would\nyou useaTypeIIinhibitororan ATPanalogueinhibitorandwhy?\n\nQuestion 3. (35 points total)\nAsdiscussedinlecture,themitogen1activatedproteinkinase(MAPK)cascadeis\nultrasensitive, demonstratingverystrong responsetolow1levelinput.Many\nothersignalingsystemsalsofeatureultrasensitivity. OneoftheseistheCDK1\n(kinase)1 CDC25(phosphatase)interaction,which regulatesthecellcycle.Ina\nrecentmanuscript(PNAS,2012),Luet al.developeda computational model\ndescribing multi1site phosphorylationofCDC25 by CDK1,wherethemultiply1\nphosphorylatedCDC25phosphataseisfully active.Forsimplicityinthis model,\nassume2 CDK11dependentphosphorylationsites onCDC25.Inthe partsthat\nfollow, pleasedesignateCDK1 asA andCDC25asB andusethenomenclature\nfromclass todescribecomplexesandphosphorylatedspecies(BPisBthat'sbeen\nphosphorylatedonce,BPP isdouble1phosphorylated). Remembertostateyour\nassumptions!\nA. (6points)Writeout thechemicalreactionsforthe abovesystem.Youcan\nstartwith phosphorylated,activatedCDK1.\nB. (12points) Writeout ODEsforeachspecies.\nC. (4points)Whatarethekey pointsinthis systemthatleadto\nultrasensitivity?\nD. (3points)Fromadesign perspective,howcouldyouincreasethe\nresponsivenessofthesystem?\nE. (10points) OneofthesubstratesofCDC25isthe CDK1kinase.Addthis\nreactionintoyoursystemandaddinthe additional ODE(s)reflectingthis\nreaction. Whatbiologicalprinciple does this introduceintothesystemand\nwhyisituseful.\n\nQuestion 4. (15 points total)\nShort answers - one to three sentences.\na) (3points)Describe whatinformation you canobtainfromITCandnotfrom\nSPRandviceversa.\nb) (3points)Howdoes strong positivefeedbackaffectthedurationand\namplitude ofthekinasesignalingcascade?\nc) (3points)Nameonereasonwhy thequantitative interactionaffinitiesand\nkineticsgeneratedbysurfaceplasmonresonance (SPR)maynotbe\napplicabletomodeling reactionsincells.\nd) (3points)Describethepseudo first orderapproximation(PFOA).Isthis\napplicableinITCand SPR?Why orwhynot.\ne) (3points)Describeonetechniquethat canbeused todetermineiftwo\nproteinsinteractinvitro.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "20.320 Analysis of Biomolecular and Cellular Systems, 2012 Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-320-analysis-of-biomolecular-and-cellular-systems-fall-2012/d98c3db418cd0d3730e9ca2bfc4c36ac_MIT20_320F12_2012Exam_2.pdf",
      "content": "20.320 Exam 2\nThursday November 15th 2012\n9:35-10:55\n\nInstructions:\n\n0. Write your name of the front cover of the blue book.\n\n1. Answer all questions in the blue books. This exam paper will not\nbe graded.\n\n2. All questions can be answered in at most a few sentences. We will\ndeduct points for excessively long replies, even if they contain the\nright answer.\n\n3. State all assumptions for each problem.\n\n4. In order to pace yourself please note that the maximum possible\nscore on this exam is 100 - note that there are 4 total questions.\n\nQuestion 1\n25 points\nAs discussed in class, the amount of receptor on the surface of a cell directly affects the\nmaximal activation of downstream signaling cascades when the cell is pulsed with ligand. To\nquantify surface receptors, assume that receptor (R) is constitutively synthesized at rate Vs, that\nendocytosis of receptor occurs with rate constant ker, and that activated endocytosis of\nreceptor-ligand complex (C) occurs with rate constant kec. C is formed by binding ligand (L) with\nrate constant kf; ligand disassociates with rate kr. Internalized receptors and complexes are\ndegraded with rate constant kdeg. The internalized receptor can be recycled to the cell surface\nwith rate constant krec,R while the internalized complex can be recycled to the cell surface with\nrate constant krec,C.\na. Create a cell-level diagram of this system including all relevant terms.\nb. Write a system of ODEs including the rates of change for each species in the above\nsystem.\nc. A western blot experiment is performed to determine the total amount of receptors\nexpressed by the cell at steady state. From this experiment, it is established that these\ncells have 2x108 copies of receptor in a population of 10,000 cells. Assuming that Vs\n=102 min-1 cell-1 , kdeg=1x10-2 min-1, ker=2x10-2 min-1, and krec,R=9x10-3 min-1, calculate the\nfraction of total receptors that are internalized per cell at steady state conditions, in the\nabsence of ligand. State any additional assumptions.\n\nQuestion 2\n25 points\nETV3, an ETS-family transcription factor, is a transcriptional repressor: it represses transcription\nof the DNA to which it is bound. One of the genes to which ETV3 binds is the gene for ETV3\nitself (with a Kd value of 10-6M), representing a nice example of transcriptional regulation.\na. Plot the population distributions for negative, simple, and positive regulation and\nexplain each curve. Which type of regulation does ETV3 exhibit?\nb. Provide an equation describing the rate of change of ETV3.\nreceptors\nc. Given a basal rate of synthesis (e.g. in the absence of ETV3 protein) of\nand\ncell*second\nreceptors\na rate of degradation of a\n, how much ETV3 is present at steady state?\ncell*second\nd. (5 points) Provide a rough plot of the dynamics of this system prior to reaching steady\nstate. Be sure to label your axes.\n\nQuestion 3\n30 points\nYou are interested in designing two highly specific proteases each of which will target a different\nsequence. You intend to use these protease-target pairs in a synthetic biology experiment. The goal is\nto express each protease only under specific conditions, when it will cleave its target without causing\nany off-pathway effects.\nYou begin with the TEV protease, which cleaves the sequence ENLYFQG after the glutamine residue.\nThis is an incredibly specific protease, and you will focus on altering that substrate specificity. Your goal\nis to mutate the TEV protease to develop a second version that is specific for the sequence RNLYFQG. In\norder to do this, you will start working with a catalytically inactive form of TEV, one which binds the\nsubstrate but does not cleave it.\n1) In the wild-type protein, what properties of the binding pocket do you expect around the first\namino acid in the target sequence?\n2) How much of a free-energy difference do you need so that the mutant will bind RNLYFQG 10,000\nfold better than ENLYFQG?\n3) In order to speed up the design process, you use pyRosetta to test out the predicted changes in\nbinding energy for each mutant.\na) Draw the free energy cycles for the wild type and mutant TEV protease binding the ENLYFQG\nand RNLYFQG peptide sequences.\nb) Write an equation for the //G of each protein for the two substrates.\nc) To save computing time, you would like to eliminate the \"alchemical\" reactions for the free\npeptide. Is that legitimate? Justify your answer.\n4) When your design is complete, you find that the system works very well for isolated target peptides.\nBoth TEV and the mutant have high binding affinities for their own targets and low affinities for the\nwrong peptides. For example, the mutant peptide (TEVM) will bind well to the mutant substrate\n(PepR) but not to the wild type substrate (PepE). The ratio of K1 / K2 for the reactions below is\napproximately 1,000.\nReaction\nEquilibrium constant\nTEVM + PepR\n( Pep)MR\nK1\nTEVM + PepE\n( Pep)ME\nK2\n\n(\n\n(\n\n(\n\nBoth proteins are much less efficient at binding their targets when the targets occur inside the sequence\nof a globular domain, but not equally so. In fact, the mutant binds to a target protein containing either\nthe ENLYFQG or RNLYFQG sequences with the same affinity. These two versions of the target differ only\nin the one amino acid substation (E to R). Specifically, the ratio K3 / K4 for the reactions below is\napproximately 1:\nReaction\nEquilibrium constant\n\nYou wonder whether folding might contribute to this strange overall effect, and decide to include it in\nE\nyour model. Let K:ntold be the equilibrium constant for the unfolding of the protein containing\nR\nENLYFQG, and K:ntold the equilibrium constant for the corresponding reaction of the target containing\nRNLYFQG.\nReaction\nEquilibrium constant\na) Write an equation for the fraction of each peptide that would be bound by the catalytically\ninactive form of each enzyme in terms of the equilibrium constants above (these equations\nshould include the effects of both folding and binding; write one equation for each peptide).\nE\nR\nb) Explain, based on the relative magnitude of K:ntold and K:ntold, why the enzyme's binding\npreferences change when the target sequence is part of a globular protein.\n! \" #+,-&./ '\n( #+,-)!&\nK3\n! \" #+,-*./ '\n( #+,-)!*\nK4\n#+,-*./\n'\n( #+,-*.2/\n#+,-&./\n'\n( #+,-&.2/\n/\n*\n\n/\n&\n\nQuestion 4\n20 points\nConformation of Protein\nEnergy\nState #\nEnergy\nConsider a system in which a protein can adopt seven discrete conformations. The relative energy of\neach conformation is depicted in the schematic and the table above. We're interested in applying the\nMetropolis-Hastings algorithm discussed in lecture to identify the globally optimal conformation which\ncorresponds to state #4. In setting up the algorithm, we only allow adjacent states to transition to one\nanother. In other words, state 2 can transition to states 1 or 3, while state 1 can only transition to state\n2. In the algorithm, when a test state is generated, both of the states that neighbor the current state are\nequally likely to be generated. If the current state only has one neighbor (such as state 1), the test state\ncorresponds to its only neighbor.\na) Calculate the natural log of the probability that the current state transitions to the test state for\neach of the 12 combinations listed below in terms of kB and T. PAB represents the probability of\ntransitioning from state A to state B when A is the current state and B is the test state.\nTransition Probability\nNatural Log of\nProbability\nP12\nP21\nP23\nP32\nP34\nP43\nP45\nP54\n\nP56\nP65\nP67\nP76\nFor the parts that remain, assume that when we initialize our system, we're located in state 7.\nb) What is the probability that we will be in state #3 after 4 iterations of the algorithm? Clearly explain\nyour logic and express your answers in terms of the transition probabilities defined above. Omit\ntransition probabilities of 1 from your final expression and don't neglect the probability associated with\ngenerating a test state.\nc) What is the temperature required for the algorithm to be in state #3 after 4 iterations with a probability\ngreater than 0.05? For simplicity's sake, assume kB = 0.04 and that the units are in accordance with\nthose used for the energy.\nd) What is the temperature required for the algorithm to be in state #3 after 4 iterations with a probability\ngreater than 0.1? For simplicity's sake, assume kB = 0.04 and that the units are in accordance with those\nused for the energy.\ne) Rationalize the results obtained in parts c and d by explaining why a higher/lower temperature\nincreases/decreases the probability of being in state #3 after 4 iterations.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.320 Analysis of Biomolecular and Cellular Systems\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}