{
  "course_name": "Analysis of Contemporary Architecture",
  "course_description": "The goal of this course is to investigate with students backgrounds on some of the pivotal events that have shaped our understanding and approach to architecture. Emphasis of discussion will be primarily on buildings and works of individual architects. Canonical architects, buildings and movements that have exerted significant influences on the development of architecture will be studied in detail. We will visit some of these buildings for a first-hand look and to evaluate for ourselves their significance or lack thereof. As a final project, each student will analyze a building through drawings, text, bibliography and a physical model in a format ready for documentation and exhibition.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism",
    "Fine Arts",
    "Architecture",
    "Architectural History and Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThe goal of this course is to investigate with students backgrounds on some of the pivotal events that have shaped our understanding and approach to architecture. Emphasis of discussion will be primarily on buildings and works of individual architects. Canonical architects, buildings and movements that have exerted significant influences on the development of architecture will be studied in detail. We will visit some of these buildings for a first-hand look and to evaluate for ourselves their significance or lack thereof. As a final project, each student will analyze a building through drawings, text, bibliography and a physical model in a format ready for documentation and exhibition.\n\nNot only will a larger visual vocabulary enable students to communicate more effectively about design, it can also aid in developing their own design ideas in studio. Gaining an insight into the canonical architectural works and movements in the past beyond just the forms will give the students an opportunity to place their own design ideas within the architectural tradition. \"The buildings of the past are studied so that the student will acquire from their significance and greatness a sense for genuine architectural values, and because their dependence upon a specific historical situation must awaken in him an understanding for the necessity of his own architectural achievement.\" Mies van der Rohe.\n\nCourse Format\n\nThis course will include short film documentaries, lectures, in-class discussions, assigned readings for each class and building visits. There will be no final exam in this course. Instead, there will be a final class project that will be scheduled for exhibition. Class attendance is counted toward the final grade and the TA will note any lateness of over 20 minutes.\n\nThere will be weekly assigned readings to be done prior to class and these readings will provide students with some backgrounds for in-class discussion. Active student participation is mandatory. Students will come to each class prepared with two thoughtful questions related to that day's reading material to be emailed to the TA prior to class. I also encourage you to take a look at the recommended readings.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nCompletion of reading assignments on time\n\n40%\n\nClass participation and attendance\n\n30%\n\nFinal project\n\n30%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nIntroduction\n\nLouis Sullivan: Adler and Sullivan\n\nFrank Lloyd Wright\n\nAdolf Loos, Peter Behrens and the German Werkbund\n\nDe Stijl and Schrader Schroder house\n\nWalter Gropius: Bauhaus and Harvard\n\nVisit Gropius House, Lincoln, MA\n\nLe Corbusier buildings and cities\n\nDocumentary: La Tourette\n\nMies van der Rohe: Berlin and America, less is more\n\nDocumentary: Mies\n\nPhilip Johnson and the International Style of 1932\n\nAlvar Aalto\n\nLouis Kahn\n\nEero Saarinen, Paul Rudolph\n\nCase-study house program\n\nField trip to Yale, overnight stay with Sunday trip to Exeter Library\n\nUrbanism CIAM and Team X\n\nAldo Van Eyck\n\nJames Stirling\n\nAldo Rossi and Carlo Scarpa\n\nFive Architects: Eisenman, Graves, Gwathmey, Hejduk, Meier\n\nPost Modernism: less is a bore\n\nDeconstructivist architecture\n\nRem Koolhaas and Frank Gehry\n\nDocumentary: Sketches of Frank Gehry\n\nSuburbia, sprawl, Congress for New Urbanism, Duany Plater-Zyberk\n\nWilliam McDonough, green building practices\n\nFinal review exhibition",
  "files": [
    {
      "category": "Resource",
      "title": "Building list and bibliography notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-205-analysis-of-contemporary-architecture-fall-2009/97293551801e164f4dbd820643600c29_MIT4_205F09_assn.pdf",
      "content": "Recommended Software for Research\nBiblioExpress is a freeware for making bibliographies. The 'industry' standard is Endnote.\nInfomagic is a free note-taking software, and would help you to keep your research\nnotes in a digital format. The 'industry' standards are Infoselect and Zoot. You may also\nwant to try Microsoft Onenote.\nMaking a Bibliography\nHere is a list of the most used databases and other sources you need to use for creating\na bibliography about your building. You will have to learn to check them in a number of\nways: sometimes using the name of your building, sometimes using the architect's\nname etc.\n*\nAvery Index to Architectural Periodicals\n*\nBibliography of the History of Art\n*\nJSTOR:\n*\nWorld History Collection\n*\nLexisNexis Academic\n*\nGoogle Scholar\nYou must also check the books and articles that you find from these searches as they\nwill also contain bibliographies.\nList of Buildings (you may propose your own with instructor permission)\nCharles Eames, Eames House, California 1945-1949\nCharles Eames and Eero Saarinen, Entenza House, California 1945-49\nHassan Fathy, New Gourna Housing, 1948\nBruce Groff, Bavinger House, Norman Oklahama 1955\nAlvar Aalto, Pensions Institute, Helsinki, Finland, 1952-56\nAlvar Aalto, House of Culture, Helsinki, Finland 1955-58\nPierre Koenig, Bailey House-Case Study House 21, Los Angeles 1956-58\nFrank Lloyd Wright, Marin Civic Center, San Rafael California 1957\nFrank Lloyd Wright, Winkler and Goetsch House, Okemos, Michigan 1939\nFelix Candela, Los Manantiales, Mexico 1958\nEero Saarinen, Dulles Airport, 1958-1962\nGeoffrey Bawa, Bawa House, Sri Lanka 1958-1968\n\nAldo van Eyck, Hubertus House, Amsterdam 1959\nEdward D. Stone, American Embassy, New Delhi\nGordon Bunshaft, Chase Manhattan Bank, New York 1961\nGordon Bunshaft, Beinecke Library, New Haven, CT 1963\nGottfried Bohm, Pilgrimage Church, Germany 1962\nZvi Hecker, Spiral Apartment House, Israel 1963\nLe Corbusier, Church at Firminy, 1963\nLe Corbusier, Millowner Association, Ahmedabad, India 1954\nLe Corbusier, Shodan House, Ahmedabad, India 1956\nLe Corbusier, Villa DeMandrot, Toulon 1931\nLe Corbusier, Carpenter Center, Cambridge, MA, 1963\nKevin Roche, Dinkeloo, Ford Foundation Building, 1963-68\nMarcel Breuer, Whitney Museum, New York 1966\nOscar Niemeyer, Strick House, Santa Monica 1968\nJames Stirling, History Faculty Library, Cambridge University 1968\nJames Stirling and Michael Wilford Associates, Sackler Museum, Harvard University, 1985\nPhilip Johnson, Robert C. Wiley House, New Canaan, CT. 1952-53\nHermann Hertzberger, Central Beheer, Netherlands, 1968-1972\nCarlo Scarpa, Brion-Vega Cemetery, Italy 1972\nCarlo Scarpa, Ottolenghi House, Verona, 1974\nJohn Portman, Hyatt Regency Hotel, San Francisco 1973\nJose Louis Sert, Miro Foundation 1974\nI M. Pei, Christian Science Center, Boston 1974\nI.M. Pei, Harbor Towers, Boston, MA 1971\nMies van der Rohe, Chapel, IIT, 1949-52\nMies van der Rohe, Minerals and Metals Research Building, IIT 1942-43\nMies van der Rohe, Farnsworth House, Plano, IL\nMies van der Rohe, Barcelona Pavilion, 1929\nRicardo Legoretta, Hotel Camino Real 1975\nRiema Pietila, Congregational Center, Finland 1979\nBalkrishna Doshi, Sangath, Ahmedabad India 1979-1981\nFay Jones, Thorncrown Chapel, Eureka Springs, Arkansas 1980\nCharles Correa, Kanchanjunga Apartments, Bombay India 1983\nCharles Moore, Hood Musuem of Art, Hanover, New Hampshire 1983\nLouis Kahn, Parliamentary Building, Dacca 1983\nLouis Kahn, First Unitarian Church and School, Rochester, NY 1959-69\nLouis Kahn, Exeter Library, Exeter, NH 1967-72\nLouis Kahn, Norman Fisher House, Hatboro, PA 1960-67\nAntonio Predock, Nelson Fine Arts Center, 1985-90\nJean Nouvel, L'Institut du Monde Arabe, Paris France 1987\nAldo Rossi, Hotel Il Palazzo, Fukuoka Japan, 1987\nPaulo Mendes da Rocha, Brazilian Museum of Sculpture, Sao Paulo, Brazil 1988\n\nNicholas Grimshaw, Sainsbury's Superstore, Britain 1989\nMichael Graves, San Juan Capistrano Library, California 1981-83\nSverre Fehn, Glacier Museum, Fjaerland Norway1991\nHelmut Jahn, Sony Center, Berlin 1993-2000\nMario Botta, San Francisco Museum of Modern Art, California 1995\nChristian de Portzamparc, Cite de la Musique, Parc de La Villette, Paris France 1994\nItsuko Hasegawa, Museum of Fruit, Japan 1996\nEnric Miralles, Parliament Building, Scotland 2001\nAlsop Architects, Fawood Children's Centre 2004\nVenturi and Brown, Hotel du Departement de la Haute-Garonne, Toulouse France, 2005\nToyo Ito, White U house, Tokyo, 1976\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.205 Analysis of Contemporary Architecture\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Taliesin West",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-205-analysis-of-contemporary-architecture-fall-2009/e568a1c78fa6bf2eb259771152724948_MIT4_205F09_sw2.pdf",
      "content": "FRANK LLOYD WRIGHT'S\nTALIESIN WEST\nPLAN\nSECTIONS\nSOUTH ELEVATION\nThe Offi ce\nThe Draft ing Studio (and Vault)\nWright's Quarters (and Garden Room)\nThe Music Pavilion\nThe Cabaret (secti on 1)\nThe Cabaret (secti on 2)\n1. Draft ing Studio\n2. Terrace Steps\n3. Dining Room\n4. Apartments\n5. Loggia\n6. Garden Room\n7. Wright's Living Quarters\n\nFRANK LLOYD WRIGHT'S\nTALIESIN WEST\nBIBLIOGRAPHY\n\"Frank Lloyd Wright: Taliesin West.\" A Digital Archive of American Architecture. Boston Col-\nlege. Web. 1 Dec 2009. <htt p://www.bc.edu/bc_org/avp/cas/fnart/fa267/FLW_taliesin.\nhtml>.\nFrank Lloyd Wright's Taliesin West. CD-ROM. New York: Planet Architecture, 2002.\nPfeiff er, Bruce Brooks and Frank Lloyd Wright. Frank Lloyd Wright treasures of Taliesin: 76\nunbuilt designs. Fresno: The Press at California State University, 1985.\nSmith, Kathryn. Frank Lloyd Wright's Taliesin and Taliesin West. New York: Harry N. Abrams,\n1997.\nStoller, Ezra, and Neil Levine. Frank Lloyd Wright's Taliesin West. New York: Princeton Archi-\ntectural Press, 1999.\n\"Taliesin West\" Great Buildings Online. Arti fi ce, Inc. Web. 1 Dec 2009. <htt p://www.great-\nbuildings.com/buildings/Taliesin_West.html>.\n\"Tours-Taliesin West.\" Frank Lloyd Foundati on. Frank Lloyd Foundati on, Web. 1 Dec 2009.\n<htt p://www.franklloydwright.org/fl lwf_web_091104/Tours.html>.\nWright, Frank Lloyd, Yukio Futagawa, and Masami Tanigawa. Frank Lloyd Wright: Taliesin\nEast, Spring Green, Wisconsin, 1925-, Taliesin West, Paradise Valley, Arizona, 1938-. Tokyo:\nA.D.A Edita, 1972.\nWright, Frank Lloyd, Bruce Pfeiff er, and Yukio Futagawa. Frank Lloyd Wright selected houses.\nTokyo: A.D.A. Edita, 1991.\nKaren Zhou\n4.205 Analysis of Contemporary Architecture\nPHOTOGRAPHS OF MODEL\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.205 Analysis of Contemporary Architecture\nFall 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Tall Office Building Artistically Considered",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-205-analysis-of-contemporary-architecture-fall-2009/e9f665db203bf5acb2ce44d91f75b66e_MIT4_205F09_Sullivan.pdf",
      "content": "Sullivan's Tall Office Building Artistically Considered\nPage 1 of 6\nSullivan, Louis H. The tall office building artistically considered. Lippincott's Magazine,\nMarch 1896.\nThis work is no longer under copyright. It is in the public domain.\nI.\nThe architects of this land and generation are now brought face to face with something new\nunder the sun,-namely, that evolution and integration of social conditions, that special grouping\nof them, that results in a demand for the erection of tall office buildings. It is not my purpose to\ndiscuss the social conditions; I accept them as the fact, and say at once that the design of the\ntall office building must be recognized and confronted at the outset as a problem to be solved,\na vital problem pressing for a true solution.\nLet us state the conditions in the plainest manner. Briefly, they are these: offices are necessary\nfor the transaction of business; the invention and perfection of the high-speed elevators make\nvertical travel, that was once tedious and painful, now easy and comfortable, development of\nsteel manufacture has shown the way to safe, rigid, economical constructions rising to a great\nheight; continued growth of population in the great cities, consequent congestion of centers\nand rise in value of ground, stimulate an increase in number of stories; these successfully piled\none upon another, react on ground values;-and so on, by action and reaction, interaction and\ninter-reaction. Thus has come about the form of lofty construction called the \"modern office\nbuilding.\" It has come in answer to a call, for in it a new grouping of social conditions has found\na habitation and a name.\nUp to this point all in evidence is materialistic, an exhibition of force, of resolution, of brains in\nthe keen sharp sense of the word. It is the joint product of the speculator, the engineer, the\nbuilder.\nProblem: How shall we impart to this sterile pile, this crude, harsh, brutal agglomeration, this\nstark, staring exclamation of eternal strife, the graciousness of those higher forms of sensibility\nand culture that rest on the lower and fiercer passions? How shall we proclaim from the dizzy\nheight of this strange, weird, modern housetop the peaceful evangel of sentiment, of beauty,\nthe cult of a higher life?\nThis is the problem; and we must seek the solution of it in a process analogous to its own\nevolution,-indeed, a continuation of it,-namely, by proceeding step by step from general to\nspecial aspects, from coarser to finer considerations.\nIt is my belief that it is of the very essence of every problem that it contains and suggests its\nown solution. This I believe to be natural law. Let us examine, then, carefully the elements, let\nus search out this contained suggestion, this essence of the problem.\nThe practical conditions are, broadly speaking, these:\nWanted-1st, a story below-ground, containing boilers, engines of various sorts, etc.,-in short,\nthe plant for power, heating, lighting, etc. 2nd, a ground floor, so called, devoted to stores,\nbanks, or other establishments requiring large area, ample spacing, ample light, and great\nfreedom of access. 3rd, a second story readily accessible by stairways,-this space usually in\nlarge subdivisions, with corresponding liberality in structural spacing and expanse of glass and\n8/18/2007\n\nSullivan's Tall Office Building Artistically Considered\nPage 2 of 6\nbreadth of external openings. 4th, above this an indefinite number of stories of offices piled tier\nupon tier, one tier just like another tier, one office just like all the other offices,-an office being\nsimilar to a cell in a honey-comb, merely a compartment, nothing more. 5th and last, at the top\nof this pile is placed a space or story that, as related to the life and usefulness of the structure,\nis purely physiological in its nature,-namely, the attic. In this the circulatory system completes\nitself and makes its grand turn, ascending and descending. The space is filled with tanks,\npipes, valves, sheaves, and mechanical et cetera that supplement and complement the force\noriginating plant hidden below-ground in the cellar. Finally, or at the beginning rather, there\nmust be on the ground floor a main aperture or entrance common to all the occupants or\npatrons of the building.\nThis tabulation is, in the main, characteristic of every tall office building in the country. As to the\nnecessary arrangements for light courts. these are not germane to the problem, and, as will\nbecome soon evident, I trust, need not be considered here. These things, and such others as\nthe arrangement of elevators, for example, have to do strictly with the economics of the\nbuilding, and I assume them to have been fully considered and disposed of to the satisfaction\nof purely utilitarian and pecuniary demands. Only in rare instances does the plan or floor\narrangement of the tall office building take on an aesthetic value, and this usually when the\nlighting court is external or becomes an internal feature of great importance.\nAs I am here seeking not for an individual or special solution, but for a true normal type, the\nattention must be confined to those conditions that, in the main, are constant in all tall office\nbuildings, and every mere incidental and accidental variation eliminated from the\nconsideration, as harmful to the clearness of the main inquiry.\nThe practical horizontal and vertical division or office unit is naturally based on a room of\ncomfortable area and height, and the size of this standard office room as naturally\npredetermines the standard structural unit, and, approximately, the size of window-openings.\nIn turn, these purely arbitrary units of structure form in an equally natural way the true basis of\nthe artistic development of the exterior. Of course the structural spacings and openings in the\nfirst or mercantile story are required to be the largest of all; those in the second or quasi-\nmercantile story are of a somewhat similar nature. The spacings and openings in the attic are\nof no importance whatsoever (the windows have no actual value), for light may be taken from\nthe top, and no recognition of a cellular division is necessary in the structural spacing.\nHence it follows inevitably, and in the simplest possible way, that if we follow our natural\ninstincts without thought of books, rules, precedents, or any such educational impedimenta to\na spontaneous and \"sensible\" result, we will in the following manner design the exterior of our\ntall office building,-to wit:\nBeginning with the first story, we give this a main entrance that attracts the eye to its location,\nand the remainder of the story we treat in a more or less liberal, expansive, sumptuous way,-a\nway based exactly on the practical necessities, but expressed with a sentiment of largeness\nand freedom. The second story we treat in a similar way, but usually with milder pretension.\nAbove this, throughout the indefinite number of typical office tiers, we take our cue from the\nindividual cell, which requires a window with its separating pier, its sill and lintel, and we,\nwithout more ado, make them look all alike because they are all alike. This brings us to the\nattic, which, having no division into office-cells, and no special requirement for lighting, gives\nthe power to show by means of its broad expanse of wall, and its dominating weight and\ncharacter, that which is the fact,-namely, that the series of office-tiers has come definitely to an\n8/18/2007\n\nSullivan's Tall Office Building Artistically Considered\nPage 3 of 6\nend.\nThis may perhaps seem a bald result and a heartless, pessimistic way of stating it, but even so\nwe certainly have advanced a most characteristic stage beyond the imagined sinister building\nof the speculator-engineer- builder combination. For the hand of the architect is now definitely\nfelt in the decisive position at once taken, and the suggestion of a thoroughly sound, logical,\ncoherent expression of the conditions is becoming apparent.\nWhen I say the hand of the architect, I do not mean necessarily the accomplished and trained\narchitect. I mean only a man with a strong, natural liking for buildings, and a disposition to\nshape them in what seems to his unaffected nature a direct and simple way. He will probably\ntread an innocent path from his problem to its solution, and therein he will show an enviable\ngift of logic. If he have some gift for form in detail, some love for that, his result in addition to its\nsimple straightforward naturalness and completeness in general statement, will have\nsomething of the charm of sentiment.\nHowever, thus far the results are only partial and tentative at best; relatively true, they are but\nsuperficial. We are doubtless right in our instinct but we must seek a fuller justification, a finer\nsanction, for it.\nII.\nI assume now that in the study of our problem we have passed through the various stages of\ninquiry, as follows: 1st, the social basis of the demand for tall office buildings; 2nd, its literal\nmaterial satisfaction; 3rd, elevation of the question from considerations of literal planning,\nconstruction, and equipment, to the plane of elementary architecture as a direct outgrowth of\nsound, sensible building; 4th, the question again elevated from an elementary architecture to\nthe beginnings of true architectural expression, through the addition of a certain quality and\nquantity of sentiment.\nBut our building may have all these in a considerable degree and yet be far from the adequate\nsolution of the problem I am attempting to define. We must now heed the imperative voice of\nemotion.\nIt demands of us, What is the chief characteristic of the tall office building? And at once we\nanswer, it is lofty. This loftiness is to the artist-nature its thrilling aspect. It is the very open\norgan-tone in its appeal. It must be in turn the dominant chord in his expression of it, the true\nexcitant of his imagination. It must be tall, every inch of it tall. The force and power of altitude\nmust be in it the glory and pride of exaltation must be in it. It must be every inch a proud and\nsoaring thing, rising in sheer exultation that from bottom to top it is a unit without a single\ndissenting line,-that it is the new, the unexpected, the eloquent peroration of most bald, most\nsinister, most forbidding conditions.\nThe man who designs in this spirit and with the sense of responsibility to the generation he\nlives in must be no coward, no denier, no bookworm, no dilettante. He must live of his life and\nfor his life in the fullest, most consummate sense. He must realize at once and with the grasp\nof inspiration that the problem of the tall office building is one of the most stupendous, one of\nthe most magnificent opportunities that the Lord of Nature in His beneficence has ever offered\nto the proud spirit of man.\n8/18/2007\n\nSullivan's Tall Office Building Artistically Considered\nPage 4 of 6\nThat this has not been perceived-indeed, has been flatly denied-is an exhibition of human\nperversity that must give us pause.\nIII.\nOne more consideration: Let us now lift this question into the region of calm, philosophic\nobservation. Let us seek a comprehensive, a final solution: let the problem indeed dissolve.\nCertain critics, and very thoughtful ones, have advanced the theory that the true prototype of\nthe tall office building is the classical column, consisting of base, shaft and capital,-the molded\nbase of the column typical of the lower stories of our building, the plain or fluted shaft\nsuggesting the monotonous, uninterrupted series of office-tiers, and the capital the completing\npower and luxuriance of the attic.\nOther theorizers assuming a mystical symbolism as a guide, quote the many trinities in nature\nand in art, and the beauty and conclusiveness of such trinity in unity. They aver the beauty of\nprime numbers, the mysticism of the number three, the beauty of all things that are in three\nparts,-to wit, the day, subdividing into morning, noon, and night; the limbs, the thorax, and the\nhead, constituting the body. So they say, should the building be in three parts vertically,\nsubstantially as before, but for different motives.\nOthers, of purely intellectual temperament, hold that such a design should be in the nature of a\nlogical statement; it should have a beginning, a middle, and an ending, each clearly defined,\ntherefore again a building, as above, in three parts vertically.\nOthers, seeking their examples and justification in the vegetable kingdom. urge that such a\ndesign shall above all things be organic. They quote the suitable flower with its bunch of leaves\nat the earth, its long graceful stem, carrying the gorgeous single flower. They point to the pine-\ntree,-its messy roots, its lithe, uninterrupted trunk, its tuft of green high in the air. Thus, they\nsay, should be the design of the tall office building: again in three parts vertically.\nOthers still, more susceptible to the power of a unit than to the grace of a trinity, say that such\na design should be struck out at a blow, as though by a blacksmith or by mighty Jove, or\nshould be thought-born, as was Minerva, full-grown. They accept the notion of a triple division\nas permissible and welcome, but non-essential. With them it is a subdivision of their unit; the\nunit does not come from the alliance of the three; they accept it without murmur, provided the\nsubdivision does not disturb the sense of singleness and repose.\nAll of these critics and theorists agree, however, positively, unequivocally, in this, that the tall\noffice building should not, must not, be made a field for the display of architectural knowledge\nin the encyclopedic sense; that too much learning in this instance is fully as dangerous, as\nobnoxious, as too little learning; that miscellany is abhorrent to their sense; that the sixteen-\nstory building must not consist of sixteen separate, distinct, and unrelated buildings piled one\nupon the other until the top of the pile is reached.\nTo this latter folly I would not refer were it not the fact that nine out of every ten tall office\nbuildings are designed in precisely this way in effect, not by the ignorant, but by the educated.\nIt would seem, indeed, as though the \"trained\" architect, when facing this problem, were beset\nat every story, or, at most, every third or forth story, by the hysterical dread lest he be in \"bad\nform;\" lest he be not bedecking his building with sufficiency of quotation from this, that, or the\n8/18/2007\n\nSullivan's Tall Office Building Artistically Considered\nPage 5 of 6\nother \"correct\" building in some other land and some other time; lest he be not copious enough\nin the display of his wares; lest he betray, in short, a lack of resources. To loosen up the touch\nof this cramped and fidgity hand, to allow the nerves to calm, the brain to cool, to reflect\nequably, to reason naturally, seems beyond him; he lives, as it were, in a waking nightmare\nfilled with the disjecta membra of architecture. The spectacle is not inspiriting.\nAs to the former and serious views held by discerning and thoughtful critics, I shall, with\nhowever much of regret, dissent from them for the purpose of this demonstration, for I regard\nthem as secondary only, non-essential, and as touching not at all upon the vital spot, upon the\nquick of the entire matter, upon the true, the immovable philosophy of the architectural art.\nThis view let me now state, for it brings to the solution of the problem a final, comprehensive\nformula:\nAll things in nature have a shape, that is to say, a form, an outward semblance, that tells us\nwhat they are, that distinguishes them from ourselves and from each other.\nUnfailingly in nature these shapes express the inner life, the native quality, of the animal, tree,\nbird, fish, that they present to us; they are so characteristic, so recognizable, that we say\nsimply, it is \"natural\" it should be so. Yet the moment we peer beneath this surface of things,\nthe moment we look through the tranquil reflection of ourselves and the clouds above us, down\ninto the clear, fluent, unfathomable depth of nature, how startling is the silence of it, how\namazing the flow of life, how absorbing the mystery! Unceasingly the essence of things is\ntaking shape in the matter of things, and this unspeakable process we call birth and growth.\nAwhile the spirit and the matter fade away together, and it is this that we call decadence,\ndeath. These two happenings seem jointed and interdependent, blended into one like a bubble\nand its iridescence, and they seem borne along upon a slowly moving air. This air is wonderful\npast all understanding.\nYet to the steadfast eye of one standing upon the shore of things, looking chiefly and most\nlovingly upon that side on which the sun shines and that we feel joyously to be life, the heart is\never gladdened by the beauty, the exquisite spontaneity, with which life seeks and takes on its\nforms in an accord perfectly responsive to its needs. It seems ever as though the life and the\nform were absolutely one and inseparable, so adequate is the sense of fulfillment.\nWhether it be the sweeping eagle in his flight, or the open apple-blossom, the toiling work\nhorse, the blithe swan, the branching oak, the winding stream at its base, the drifting clouds,\nover all the coursing sun, form ever follows function, and this is the law. Where function does\nnot change form does not change. The granite rocks, the ever-brooding hills, remain for ages;\nthe lightning lives, comes into shape, and dies in a twinkling.\nIt is the pervading law of all things organic and inorganic, of all things physical and\nmetaphysical, of all things human and all things superhuman, of all true manifestations of the\nhead, of the heart, of the soul, that the life is recognizable in its expression, that form ever\nfollows function. This is the law.\nShall we, then, daily violate this law in our art? Are we so decadent, so imbecile, so utterly\nweak of eyesight, that we cannot perceive this truth so simple, so very simple? Is it indeed a\ntruth so transparent that we see through it but do not see it? It is really then, a very marvelous\nthing, or is it rather so commonplace, so everyday, so near a thing to us, that we cannot\n8/18/2007\n\nSullivan's Tall Office Building Artistically Considered\nPage 6 of 6\nperceive that the shape, form, outward expression, design, or whatever we may choose, of the\ntall office building should in the very nature of things follow the functions of the building, and\nthat where the function does not change, the form is not to change?\nDoes this not readily, clearly, and conclusively show that the lower one or two stories will take\non a special character suited to the special needs, that the tiers of typical offices, having the\nsame unchanging function, shall continue in the same unchanging form, and that as to the\nattic, specific and conclusive as it is in its very nature, its function shall equally be so in force,\nin significance, in continuity, in conclusiveness of outward expression? From this results,\nnaturally, spontaneously, unwittingly, a three-part division,-not from any theory, symbol, or\nfancied logic.\nAnd thus the design of the tall office building takes its place with all other architectural types\nmade when architecture, as has happened once in many years, was a living art. Witness the\nGreek temple, the Gothic cathedral, the mediaeval fortress.\nAnd thus, when native instinct and sensibility shall govern the exercise of our beloved art;\nwhen the known law, the respected law, shall be that form ever follows function; when our\narchitects shall cease strutting and prattling handcuffed and vainglorious In the asylum of a\nforeign school; when it is truly felt, cheerfully accepted, that this law opens up the airy sunshine\nof green fields, and gives to us a freedom that the very beauty and sumptuousness of the\noutworking Of the law itself as exhibited in nature will deter any sane, any sensitive man from\nchanging into license; when it becomes evident that we are merely speaking a foreign\nlanguage with a noticeable American accent, whereas each and every architect in the land\nmight, under the benign influence of this law, express in the simplest, most modest, most\nnatural way that which il is in him to say: that he might really and would surely develop his own\ncharacteristic individuality, and that the architectural art with him would certainly become a\nliving form of speech, a natural form of utterance, giving surcease to him and adding treasures\nsmall and great to the growing art of his land; when we know and feel that Nature is our friend,\nnot our implacable enemy,-that an afternoon in the country, an hour by the sea, a full open\nview of one single day, through dawn, high noon, and twilight, will suggest to us so much that\nis rhythmical, deep, and eternal in the vast art of architecture, something so deep, so true, that\nall the narrow formalities, hard-and-fast rules, and strangling bonds of the schools cannot stifle\nit in us,-then it may be proclaimed that we are on the high-road to a natural and satisfying art,\nan architecture that will soon become a fine art in the true, the best sense of the word, an art\nthat will live because it will be of the people, for the people, and by the people.\n8/18/2007\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.205 Analysis of Contemporary Architecture\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}