{
  "course_name": "Analysis and Design of Feedback Control Systems",
  "course_description": "This course develops the fundamentals of feedback control using linear transfer function system models. Topics covered include analysis in time and frequency domains; design in the s-plane (root locus) and in the frequency domain (loop shaping); describing functions for stability of certain non-linear systems; extension to state variable systems and multivariable control with observers; discrete and digital hybrid systems and use of z-plane design. Students will complete an extended design case study. Students taking the graduate version (2.140) will attend the recitation sessions and complete additional assignments.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Robotics and Control Systems",
    "Mechanical Engineering",
    "Dynamics and Control",
    "Mechanical Design",
    "Engineering",
    "Electrical Engineering",
    "Robotics and Control Systems",
    "Mechanical Engineering",
    "Dynamics and Control",
    "Mechanical Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLabs: 1 sessions / week, 3 hours / session\n\nRecitations (graduate students only): 1 session / week, 1 hour / session\n\nDescription\n\nThis course develops the fundamentals of feedback control using linear transfer function system models. Topics covered include analysis in time and frequency domains; design in the s-plane (root locus) and in the frequency domain (loop shaping); describing functions for stability of certain non-linear systems; extension to state variable systems and multivariable control with observers; discrete and digital hybrid systems and use of z-plane design. Students complete an extended design case study. Students in the graduate version (2.140) attend the recitation sessions and complete additional assignments.\n\nTextbooks\n\nFranklin, Gene F., J. David Powell, and Abbas Emami-Naeini.\nFeedback Control of Dynamic Systems\n. 6th ed. Prentice Hall, 2009. ISBN: 9780136019695.\n\nRoberge, James K.\nOperational Amplifiers: Theory and Practice\n. John Wiley & Sons. 1975.\n\nThis book is available as a free electronic textbook from Prof. James Roberge and MIT OpenCourseWare.\n\nReadings from the textbook are listed in the\nReadings\nsection.\n\nLaboratory Sessions\n\nStudents attend one of three\nlab sessions\neach week. Each session meets for three hours. Each lab session concludes with a one-on-one check-off with one of the course teaching assistants. The lab grade is based upon the check-off (50%) and a written lab report (50%). Students will receive a grade of zero for missed lab session.\n\nAssignments\n\nWeekly\nproblem sets\nare due each week in lecture. No late problem sets will be accepted except in extenuating circumstances. Students in the graduate version of the course (2.140) are assigned extra problems. Undergraduate students are welcome to work these, but no extra credit is given.\n\nRandom Lecture Assignments\n\nDuring lecture, the course staff will regularly assign problems for students to solve, either in lecture, or due the following lecture. Solutions will be graded, and the total of the results is worth 5% of the final course grade.\n\nRecitations\n\nStudents in the graduate version of the course (2.140) are required to attend an hour long recitation session held after their lab session. This session covers material unique to 2.140.\n\nQuizzes\n\nTwo closed-book quizzes will be given. There are no laboratory sessions during the weeks of quizzes. The quizzes are closed-book. One sheet of notes will be permitted in Quiz 1. Two sheets of notes will be permitted in Quiz 2. Calculators may be used, but no more advanced computational tools are allowed, i.e., no MATLAB\n(r)\n, LabVIEW, Mathematica, etc. Any requested plots will need to be sketched by hand.\n\nDesign Project\n\nA final\ndesign problem\nwill be assigned in the last two weeks of the course. This problem will allow you to apply the topics covered in the course to a realistic design problem. Students must work individually on this problem; only course staff can be consulted with questions.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nLaboratories\n\nAssignments\n\nRandom Lecture Assignments\n\nQuizzes\n\nDesign Project",
  "files": [
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/e8b5c14fab8968aac01a5c953462d447_MIT2_14S14_Problem_Set_1.pdf",
      "content": "2.14/2.140 Problem Set 1\nAssigned: Wed. Feb. 5, 2014\nDue:\nWed. Feb. 12, 2014, in class\nReading: FPE Chapters 1 and 2, review as needed\nThis problem set is a review of material on modeling and analysis of electrical, mechanical, elec\ntromechanical, fluid, and thermal dynamic systems. The problems from Franklin, Powell, and\nEmami-Naeini, Feedback Control of Dynamic Systems, 6th Ed. are referenced by FPE Chap\nter.Problem#. The Problem Archive can be downloaded as a complete pdf file from the course\nweb page; see the problem numbers therein (pdf bookmarks will help you find them). Note that\nthe problem archive also contains solutions to many of the problems. Please do not consult these\nsolutions initially. Refer to the solutions if you are stuck, or to check your analysis.\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 FPE 2.5\nProblem 2 FPE 2.10\nProblem 3 FPE 2.15, a only\nProblem 4 FPE 2.25\nProblem 5 Archive Problem 4.24\nProblem 6 Archive Problem 10.6\nProblem 7 Archive Problem 14.3\nProblem 8 Archive Problem 14.10\nThe following problems are assigned to only 2.140 students. Students in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 FPE 2.9 Write the equations of motion in state-space form in terms of state variables\nx, x, y, and y, and with input u, and output y. Then eliminate variables in the state equations\nto find the transfer function from input u to output y. What are the locations of the poles\nand zeros of this transfer function?\nProblem G2 FPE 2.12\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/94b21193941797f99fd2d02f62084ce9_MIT2_14S14_Problem_Set_10.pdf",
      "content": "2.14/2.140 Problem Set 10\nAssigned: Wed. Apr. 16, 2014\nDue:\nWed. April 23, 2014, in class\nReading: FPE Sections 8.1-8.4\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 FPE 8.1\nProblem 2 FPE 8.2\nProblem 3 FPE 8.5\nProblem 4 FPE 8.6\nThe following problems are assigned to only 2.140 students. Students in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 FPE 8.8\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/3105bfef7d93128f256795463df536e3_MIT2_14S14_Problem_Set_11.pdf",
      "content": "2.14/2.140 Problem Set 11\nAssigned: Wed. Apr. 23, 2014\nDue:\nWed. April 30, 2014, in class\nReading: FPE Sections 8.1-8.4\nProblem 1: FPE 8.7 For this problem, in part a), calculate by hand the requested magnitude\nexpression |H(z1)| where z1 = ejω1T , and ω1 = 3 rad/sec. (The problem statement omits the\nsubscript 1 in the first sentence.) In part b), you may use Matlab to generate the requested\nBode plots. How do these compare to what you would expect from the continuous-time\nsystem?\nProblem 2: This problem considers designing a continuous-time controller for a single-axis mag\nnetic levitation device. This controller is then mapped into an approximating discrete-time\ncontroller.\nThe plant to be controlled is a mass driven by a voice-coil actuator. Assume that this plant\nhas a transfer function\nGp(s) = 1000/s2\na) For this plant, design a continuous-time PID controller using the series-lag-lead form\n\nατs + 1\nGc(s) = Kp\n1 + TI s\nτs + 1\nto achieve a crossover frequency of ωc = 1000 rad/sec, with a phase margin of φm = 45* .\nYour continuous-time design is to meet specifications for the specified continuous time plant,\nwith no consideration of the later sampling operation when implemented as a discrete-time\napproximation. You should be able to accomplish this design using hand-calculations and\nBode plot sketches. Clearly show your design effort. Indicate the loop crossover frequency,\nphase margin and gain margin.\nb) Now map this controller to discrete-time using the Tustin transformation, and assuming a\nsample rate of 6 kHz. We recommend using the operator notation introduced in class to\naid in this step. Show your hand calculations that give the discrete-time controller. We\nrecommend that you discretize the three terms of the PID controller separately: 1) gain, 2)\nlag, 3) lead. This will be easier than discretizing the full second-order controller. Give a\nblock diagram for the discrete-time controller showing the transfer functions in this block\ndiagram. What are the resulting difference equations for each element? Carefully show your\ndesign approach and calculations. (For the purposes of this problem, do the approximations\nby hand, rather than directly using Matlab to generate the transformations.)\nc) Use Matlab/Simulink to simulate the step response of your closed-loop system with i) the\ncontinuous-time PID controller, and ii) the approximating discrete-time controller which you\ndesigned. Please include plots of the control signal (plant input) and the plant output for\neach case. How do these responses compare?\nNote that you will need to choose the integration solver routines and sample times in Simulink\nto properly simulate the continuous-time loop. That is, don't use a fixed-step solver with 6 kHz\n\nin Simulink when you want to simulate the continuous-time loop. If these considerations are\nunfamiliar, please consult any of the online Simulink tutorials to understand the solvers and\ntime-steps used to simulate continous-time and mixed discrete-time/continuous-time systems.\nIn your Simulink simulations, reduce the discrete-time sample rate from 6 kHz, and comment\non the effect of longer sample times in the resulting signals. Include relevant plots to show\nthese effects. At about what reduced sample rate does the system go unstable?\nRecognize that you can implement the Simlink model block diagram in the series lag lead\nform, replacing each block with its discrete equivalent.\nWhen we ask you to simulate the continuous-time loop, this should be done with the continuous-\ntime controller. When we ask you to simulate the discrete-time loop, use discrete-time transfer\nfunctions in Simulink, and input the difference equation parameters that you calculate when\ndiscretizing.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/8beca46324c3f54261ff91c51600a2b3_MIT2_14S14_Problem_Set_2.pdf",
      "content": "2.14/2.140 Problem Set 2\nAssigned: Thurs. Feb. 13, 2014\nDue:\nWed. Feb. 19, 2014, in class\nReading: FPE sections 3.2-3.5\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 Archive Problem 17.9\nProblem 2 Archive Problem 17.18\nProblem 3 FPE 3.20\nProblem 4 FPE 3.28\nProblem 5 Consider a motor with the following parameters: torque constant K = 1 Nm/A, rotor\ninertia J = 10-2 kg m2, and coil resistance R = 5 Ω. A torque disturbance Td acts on the\nrotor of the motor in opposition to the motor torque Tm = Ki, where i is the motor coil\ncurrent. The voltage at the motor terminals is Vm = iR + Kω, where ω is the motor angular\nvelocity.\na) We consider the motor as a plant with input Vm and output ω. Draw a block diagram for\nthe motor system which shows these signals as well as i, Tm, Td, and the back emf voltage\nvb = Kω.\nb) Now we ask you to design a proportional speed controller of the form\nVm = Kp(ωr -ω).\nHere Kp is the proportional gain of the controller, and ωr is the speed command. Choose Kp\nsuch that the closed-loop system has a time constant of τ = 1 msec. For this value of Kp\nmake plots of Vm and ω when the reference is a unit step ωr(t) = 1us(t) rad/sec.\nc) Now we ask you to design a proportional plus integral speed controller of the form\nVm(s) = Kp(1 + 1\nTis)(ωr(s) -ω(s)).\nHere Kp is the proportional gain of the controller, and Ti is referred to as the integral\ntime. Choose Kp and Ti such that the closed-loop system has a natural frequency of ωn =\n1000 rad/sec and a damping ratio of ζ = 0.4. For these values make plots of Vm and ω when\nthe reference is a unit step ωr(t) = 1us(t) rad/sec.\nProblem 6 An ideal linear voice coil actuator is configured as shown below with the actuation axis\noriented vertically. This ideal actuator has no internal mass or electrical resistance. Gravity\nacts downward as shown in the figure. For the purposes of this problem, assume that motion\nin the x direction is unlimited. The actuator has F = Kfi and e = Kf x.\n\nThe actuator mechanical port is connected to a mass m.\nThe actuator electrical port is\nconnected to a resistance R in series with a switch. Consider the two cases: a) switch open\nand b) switch closed. At t = 0, the mass is released with x(0) = 0, x(0) = 0.\nWrite the equations of motion for the two cases. Take care with minus signs in your analysis:\nnote that with the switch closed e = -iR. To facilitate this analysis, draw a block diagram\nfor this system which includes at least the signals e, i, F, x, x, and which has the acceleration\nof gravity g as an input. Use this block diagram to determine the transfer function from input\ng to output x.\nSolve for the time trajectory x(t) for the two cases, and plot these as a function of time on\nthe same axes. How are the initial (t = 0+) accelerations (slope) related? Why?\nProblem 7 An ideal linear voice coil actuator is configured as shown below with the actuation axis\noriented vertically. This ideal actuator has no internal mass or electrical resistance. Gravity\nacts downward as shown in the figure. For the purposes of this problem, assume that motion\nin the x direction is unlimited. The actuator has F = Kfi and e = Kf x. The actuator\nmechanical port is connected to a mass m. We consider two cases in which the electrical port\nis connected to a capacitor or an inductor.\na) The actuator electrical port is connected to a capacitance C as shown below.\nWrite the equations of motion.\nTake care with minus signs in your analysis: note that\n\ni = -Cde/dt. To facilitate this analysis, draw a block diagram for this system which includes\nat least the signals e, i, F, x, x, and which has the acceleration of gravity g as an input. Use\nthis block diagram to determine the transfer function from input g to output x.\nAt t = 0, the mass is released with x(0) = 0, x(0) = 0. Solve for the time trajectory x(t) and\nplot as a function of time. Write an expression for the acceleration; how does changing the\nvalue of C affect the acceleration? From the viewpoint of the mass, what mechanical element\nis it connected to?\nb) The actuator electrical port is connected to an inductance L as shown below.\nWrite the equations of motion.\nTake care with minus signs in your analysis: note that\ne = -Ldi/dt. To facilitate this analysis, draw a block diagram for this system which includes\nat least the signals e, i, F, x, x, and which has the acceleration of gravity g as an input. Use\nthis block diagram to determine the transfer function from input g to output x.\nAt t = 0, the mass is released with x(0) = 0, x(0) = 0. Solve for the time trajectory x(t) and\nplot as a function of time, with the axes clearly labeled and dimensioned. How does changing\nthe value of L affect the trajectory? From the viewpoint of the mass, what mechanical element\nis it connected to?\nProblem 8 This problem considers an electrical/thermal model of a transistor circuit using an\nNPN bipolar junction transistor. This circuit is used in Labs 2 and 3 to give you experience\nwith a temperature control system. Here we look at the details of the electrical and thermal\nmodels for the circuit. As shown below, an NPN bipolar transistor is a three-terminal device\n(base, emitter, collector), with correspondingly defined voltages and currents.\nWhat makes a transistor useful is that it amplifies. For this NPN device, a basic model of\n\nthis amplification is the relationship iC = βiB, where in typical devices β ≈100. Thus a\nsmall input current at the base terminal can be amplified into a much larger current at the\ncollector terminal. Since the sum of currents entering the device must equal zero, we also\nhave iE = iC + iB. Further, when iB > 0, we can assume vBE ≈0.6 V. (This problem only\nmodels the transistor operation in the forward-active region, and omits internal dynamics.\nThere is significantly more to learn about these devices for general use.)\nThe particular circuit of interest\ndrives the transistor with an input Vin through a base resistor Rb. Note also in this circuit\nthat vCE = Vs > 0.\nAn equivalent circuit for the transistor is\n\nWe will assume that when iB is some positive value, vBE = 0.6 V, and thus require Vin ≥0.6.\nLook at the circuit equations to follow the derivation which shows that the power dissipated\nin the device is Pdiss ≈Vsβ(Vin -vBE)/Rb. (The approximation comes in because we ignore\nthe very small dissipation iBvBE. Why is this reasonable?) Thus we see that the input Vin\ncan directly control the device dissipation, via the base current, at relatively low input power.\nThat is the key idea of amplification: large power or signals somewhere can be controlled\nby small power input signals. Note that we inherently also assume Vin > vBE, since power\ndissipation must always be positive. (If you want negative and positive heat flows from one\ndevice, get a thermoelectric cooler, and go learn more about thermodynamics!)\nNow for the thermal side of the model. Assume that the transistor is a lump of material\nat uniform temperature. Further assume a linear power flow to ambient proportional to the\ndifference between transistor Tj and ambient Ta temperatures. The thermal capacitance of\nthe lump Ct has units of [J/*K], and the thermal resistance Rt has units of [*K/W]. The\npower dissipation Pdiss injects heat into the transistor lump, which connects to ambient via\nthe thermal resistance.\nThe thermal capacitance is described by\nCt\ndTj\ndt =\nX\nP = Pdiss -(Tj -Ta)\nRt\n.\nThis relationship can be shown in the equivalent thermal circuit, where we equate electrical\ncurrent with power flow, and electrical voltage with temperature.\na) Draw a block diagram including at least input Vin, input Ta, Pdiss, Tj.\nb) Now (finally!) we consider closed-loop control issues. For this purpose, Tj is the output to be\ncontrolled and Vin is the input for control. In this context, Ta is a disturbance signal.\n\nThis thermal plant will be controlled by an on/offcontroller with hysteresis, as shown\nTemperature is measured with a sensor which converts *K to volts, via Vs = 0.1(Tj -273) [V].\nThat is, the sensor measures in degrees Celsius, with a scale factor of 1 Volt per 10 degrees\nCelsius.\nThe hysteresis block has the form\nwhere the switching points are at ±∆. For the remainder of this problem, assume the fol-\nlowing values of the parameters: Vref = 5 V, ∆= 0.1 V, Rb = 20 kΩ, β = 100, Vs = 5 V,\nCt = 1 J/*K, and Rt = 400 *K/W. Use these numbers in your dynamic model developed\nabove.\n\ni) Assume Ta = 25 *C, and that the system has been offfor a long time, such that Tj(0+) = Ta. At\nt = 0 the control is engaged and begins operating. Solve for and plot Tj(t) and Vin(t). What\nis the steady-state switching frequency and duty cycle (ratio of on time to cycle period)?\ni) Now assume Ta = 0 *C, and that the system has been offfor a long time, such that Tj(0+) = Ta.\nAt t = 0 the control is engaged and begins operating. Solve for and plot Tj(t) and Vin(t).\nWhat is the steady-state switching frequency and duty cycle? Compare with the earlier case.\nDoes this lower ambient temperature cause any error in the average value of Tj? You can\nanswer this question qualitatively on the basis of your time plots. You do not need to formally\ncompute this average.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/bd8895ca08c779836c78ca6bad9b0f77_MIT2_14S14_Problem_Set_3.pdf",
      "content": "2.14/2.140 Problem Set 3\nAssigned: Wed. Feb. 19, 2014\nDue:\nWed. Feb. 26, 2014, in class\nReading: FPE Chapter 5; Lecture notes on PID control and root locus.\nFor the root locus problems from FPE, attempt to solve them by hand with the root locus sketching\nrules.\nOnly use Matlab where requested, or if you can't see an analytical solution.\nIt's very\nimportant that you learn how to sketch moderate order root loci with pencil and paper.\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 FPE 5.2\nProblem 2 FPE 5.3\nProblem 3 FPE 5.13\nProblem 4 FPE 5.14\nProblem 5 FPE 5.22. Use Matlab computational tools to help with all steps in this problem.\nProblem 6 The four plots below show the pole and zero locations of the return ratio of a feedback\nsystem, informally called the 'open-loop' poles and zeros. Each of these loops also have a\nvariable gain K > 0, which is used to move the poles along the root locus branches. For the\nfour systems shown below, sketch the approximate shape of the root locus plot for K > 0.\nNote that you will need to pay particular attention to the angle criteria in the vicinity of the\ncomplex poles and zeros. If the complex pairs are lightly damped, which of these systems\npresents a danger of instability as the loop gain is varied? This analysis has practical relevance\nfor the situation where a notch filter is used to help stabilize a system with a lightly-damped\npair of poles.\n\nProblem 7 The block diagram for a feedback loop has a forward path transfer function G(s) =\nKa(s)/b(s), and a feedback path transfer function H(s) = c(s)/d(s) as shown below. Prove\nthat the closed-loop zeros are located at: 1) the zeros of the forward path and 2) the poles of\nthe feedback path, independent of the loop gain K.\nProblem 8 FPE 4.23\n\nThe following problems are assigned to only 2.140 students.\nStudents in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 FPE 5.35\nProblem G2\nThis problem was used as the ME quals systems written exam in 2005. It considers modeling\nand control issues associated with positioning systems driven with a piezoelectric actuator.\nA\npiezoelectric positioner is driven with an electrical input in order to produce a mechanical output\nand vice versa.\nThe figure below shows a model of a system incorporating a piezoelectric device.\nHere the electrical terminals of the device are defined as having an input voltage e(t) and an input\ncurrent i(t). The piezo crystal is sandwiched between end plates, with the bottom plate connected\nto mechanical ground. The motion of the upper plate in the vertical direction is defined as x(t).\nA mechanical load consisting of a damper with value b is connected between the upper plate and\nmechanical ground. We model the piezoelectric device and plates as massless. Motion is considered\nto be constrained to the x direction.\nThe electrical/mechanical coupling of the device is modeled as shown below\nHere, the piezoelectric actuator is modeled internally as a dependent force source F(t) in parallel\nwith a spring k. The force depends linearly upon the input voltage as F(t) = Ke(t), where K\nis a scale factor with units of N/V. The spring k models the internal stiffness of the piezoelectric\nactuator. The force F is applied to the massless upper plate which connects the damper and spring.\n\nThe electrical portion of the model is shown on the left in the figure. Here, a dependent current\nsource has a value i(t) = K x(t). The system is driven with a voltage source Vin(t).\na) Calculate the transfer function X(s)/Vin(s). Clearly show the steps in your development.\nb) Assume initial rest conditions. Let the input voltage be a unit step: Vin(t) = u(t). Calculate a\nclosed-form solution for the resulting displacement x(t) and make a graph of x(t) versus time.\nc) Develop a closed-form expression for the input electrical power P(t) = e(t)i(t) associated with\nthe transient you solved for in part b) above, and make a graph of P(t) versus time.\nWe now learn that the top plate has finite mass, and so the model developed earlier needs to be\naugmented. Measurements indicate that the input/output transfer function is now given by\nGp(s) ≡X(s)\nVin(s) =\n10-2s2 + 10s + 106 .\nThis experimentally-adjusted model is to be used to design the feedback loop shown below.\nThe controller for this loop is an integral controller Gc(s) ≡G/s, where G is an adjustable gain\nassociated with the integrator.\nd) Sketch a root locus plot for this control loop as the gain G > 0 is varied. For what range of\ngains G is the loop stable?\ne) The loop transfer function (sometimes called the return ratio) for this loop is given by L(s) =\nGc(s)Gp(s). Make a careful hand sketch of the Bode plot for L(s), showing the effect of G as\na parameter, and using the numerical representation of Gp(s) given above.\nf) What value of G will result in a loop crossover frequency ωc = 100 rad/sec? (Recall that the\ncrossover frequency is the frequency for which the loop transfer function magnitude crosses\nthrough unity, that is, we require |L(j100)| = 1.)\nWhat are the phase margin and gain margin for the loop with this crossover frequency?\nIndicate these parameters on a Bode plot for the loop.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/f3197931e9c38d08fd5157405353486a_MIT2_14S14_Problem_Set_4.pdf",
      "content": "2.14/2.140 Problem Set 4\nAssigned: Wed. Feb. 26, 2014\nDue:\nWed. March 5, 2014, in class\nReading: Lecture notes on loop shaping, frequency response, and Bode plots.\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 Problem Archive 11.5 Pole Zero Plots. Sketch the indicated Bode plots by hand using\nthe sketching rules presented in the lecture and notes. Do not use Matlab to generate these\nplots.\nProblem 2 The Bode plot given below is for a notch filter, which can be used as part of compen-\nsation for attenuating resonances. This is called a notch filter because it cuts out a range of\nfrequencies. On the given Bode plot, mark the straight asymptotes, and the phase staircase\nfunction. Use this analysis to determine the filter transfer function and draw a pole-zero map\nfor the filter.\nProblem 3 Archive Problem 13.1 Rooftop Antenna\n\nProblem 4 This problem considers the paint stirrer shown below. A brushed DC motor is used\nto stir a bucket of paint as shown in the figure. The motor has a torque constant K [Nm/A]\nand the motor plus stirrer inertia is J [kg-m2]. The motor is considered ideal in that it has no\ninductance and no resistance; the only resistance in the electrical circuit is R as shown. The\nrotor is rigidly linked to the stirrer, which has no flexibility; the combined assembly has a\nrotational velocity Ωrad/sec. The effect of the paint on the stirrer is modeled as a rotational\ndamper B [Nms/rad].\na) Solve for the transfer function Gp(s) = Ω(s)/Vi(s) in terms of the system parameters. Now set\nthe parameter values as K = 0.5 Nm/A, R = 5 Ω, B = 0.15 Nms/rad, and J = 0.2 kgm2.\nFor these parameter values, make a hand sketch of the Bode plot for Gp.\nb) Now, let the system input Vi be driven by a PI controller of the form\nGc(s) = Kp\n\n1 + Ki\ns\n\n.\nThis system has a speed reference input Ωr and output Ωas shown in the block diagram below\n\nChoose the controller gain values Kp and Ki to set the loop crossover frequency ωc =\n10 rad/sec, with a phase margin φm = 45*. Show your calculations. You should be able\nto accomplish this design using hand-sketched Bode plots, and then using Matlab for confir-\nmation.\nc) Create a Simulink simulation of the loop with the controller implemented as shown in the block\ndiagram above. For now, let the integrator have an unbounded output (leave the integrator\nlimit output box unchecked). Set your simulation to use the variable step solver with a max\nstep size limit of 0.01 sec, and use the ode45 solver. Note that the standard simulation window\nhas a simulation stop time of 10 sec. You may want to adjust this value.\nLet the input reference Ωr take a step from zero to 10 rad/sec at t = 0, from initial rest\nconditions. Run this as a Simulink simulation and record and plot the responses Vi(t) and\nΩ(t). What is the maxiumum value of the Vi during this transient? What is the steady-state\nvalue of Vi after the transient has settled?\nd) Now set the integrator limits to ±1.5 times the steady-state value of Vi from part c), and check\nthe integrator limit box. (This insures that the integrator term is able to supply the required\nsteady-state control effort for a speed of 10 rad/sec, but not much more.) Again let the input\nreference Ωr take a step from zero to 10 rad/sec at t = 0, from initial rest conditions. Run\nthis as a Simulink simulation and record and plot the responses Vi(t) and Ω(t). How do these\ndiffer from the unlimited case in part c)?\ne) Be sure to keep a copy of your calculations and this model, as we may continue studying it in\nthe next problem set.\nProblem 5 Archive Problem 17.21 Pole Zero Bode Matching\n\nThe following problems are assigned to only 2.140 students.\nStudents in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 This problem was used as the ME quals systems oral exam in 2003. In the inverted\npendulum system shown below, note that gravity acts in the downward direction as shown.\nA rigid massless link constrains the mass M to rotate about the pivot shown. The distance\nfrom the pivot point to the center of gravity of the mass is L m. The mass has negligible\nmoment of inertia. The horizontal position of the mass in meters is x(t). The system is driven\nby a position input w(t) m. The input is connected to the mass via the spring k with units\nof N/m, and via the damper b shown with units of Ns/m. In the problem, we only consider\nmodels which describe motions in which x is very small; do not attempt to write models for\nlarge motions.\nM\ng\nMass position x(t)\nPosition input w(t)\nb\nk\nL\npivot\na) For this system, derive a mathematical model which describes the system for small motions.\nThe resulting linear model should have an input w(t) and output x(t). Be sure to take into ac-\ncount the effect of gravity. Explain your reasoning. What is the transfer function X(s)/W(s)?\nb) For what range of k and b is the system stable?\nc) Now consider the controlled pendulum system shown below.\n\nM\ng\nMass position x(t)\nForce output F(t)\nL\npivot\nReference input w(t)\nController\nThe controller has inputs of the mass position x(t) and reference command w(t). The con-\ntroller outputs a force F(t) which is applied to the mass as shown. Develop a controller which\nprovides an indentical small-motion transfer function X(s)/W(s) to that derived in part a)\nabove. You can feel free to use any linear operation within the controller block. Explain your\nreasoning for the controller you develop.\nd) Now assume that a time delay of T sec is introduced into the position measurement before it is\nreceived by the controller. How does this affect the stability of the controlled system? Why?\nShow your analytical reasoning. Hint: An approach looking at phase margin is the best way\nto understand the effect of the time delay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/4f0b24e235ea4286c081f996c9795749_MIT2_14S14_Problem_Set_5.pdf",
      "content": "2.14/2.140 Problem Set 5\nAssigned: Wed. Mar. 5, 2014\nDue:\nWed. March 12, 2014, in class\nReading: FPE sections 6.1-6.8; lecture notes on loop-shaping and the Nyquist test\nThe following problems are assigned to both 2.14 and 2.140 students. Except where noted,\nyou are free to use Matlab or any other computational tools to aid your solutions. There are\nno additional problems for 2.140 students. Note that Quiz 1 will be held in class on Wed.\n3/12, and is closed-book, but you may bring one page of notes, which can be two-sided. Only\nhand calculators may be used. Recognize that in Quiz 1, all requested plots will need to be\nhand-sketches, so you should work these problems accordingly.\nProblem 1 A unity-gain feedback loop is shown below; note that the plant has a pair of poles\nlocated on the imaginary axis.\na) Sketch a root locus plot for K > 0.\nb) Use a Bode plot of the return ratio L(s) to choose the controller gain K such that the loop\ncrossover frequency is 100 rad/sec. What gain K is required? What is the resulting phase\nmargin φm?\nc) Make a Nyquist plot for this loop, which is accurately drawn in the region where φm is defined.\nBe sure to label the corresponding points on the diagram. Note that your Nyquist analysis\nwill require detours around the poles at ±j10. Please clearly show the portion of the Nyquist\ncontour corresponding to these detours.\nd) Make a sketch of the closed-loop step response for your design.\nProblem 2 A unity-gain feedback loop is shown below. The controller in this loop is a propor-\ntional gain K, but it is implemented on a computer which requires a delay time of T seconds\nto produce the control output.\nIn all of this problem, assume that the time delay has a value of T = 10 msec.\n\na) Use a Bode plot of the return ratio L(s) to determine the maximum controller gain Kmax such\nthat for 0 < K < Kmax the loop is stable. For this maximal value of K = Kmax sketch a\nNyquist plot for the loop.\nb) What value of K < Kmax will result in a stable loop with a phase margin of 20*? What is the\nresulting crossover frequency? What is the gain margin for this loop? For this value of K\nsketch a Nyquist plot for the loop which shows this information.\nProblem 3 A feedback loop for a linearized magnetic suspension is shown below with a controller\nGc(s). The position of the suspended object is Y , the control reference value is R, and there\nis a disturbance D acting on the system.\nIn this problem, assume the controller takes the form\nGc(s) = K 10τs + 1\nτs + 1 .\na) Choose the values of K and τ such that the loop has a crossover frequency of 1000 rad/sec and\na phase margin which is maximized for this controller. Sketch a Nyquist plot which confirms\nthat the loop is stable.\nb) For the value of K determined above, use Matlab to plot the response Y (t) to a unit step in\nreference R(t). Also plot the response Y (t) to a unit step in disturbance D(t).\nc) This magnetic suspension is open-loop unstable, and thus there is a minimum controller gain\nK > Kmin required to stabilize the loop. Using the value of τ determined in part a), what\nis the numerical value of Kmin at this marginally-stable condition? By what ratio can K\nbe reduced with respect to the nominal design of part a) to bring the loop to the brink of\ninstability? Note that this ratio can be defined as the gain-reduction margin, as distinguished\nover the standard gain margin which is defined as an allowable gain-increase margin.\nProblem 4 Archive Problem 11.1 Circuit Bode Plots.\nIt is important to review how to solve\ncircuits for a particular transfer function. To solve for the requested transfer functions, use\nseries/parallel and voltage/current divider relationships with impedances representing each\ncircuit element. Sketch the indicated Bode plots by hand using the sketching rules presented\nin the lecture and notes. Do not use Matlab to generate these plots.\nProblem 5 Archive Problem 19.12\nProblem 6 FPE Problem 5.5 c,d\nProblem 7 FPE Problem 5.7 c,d\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/1d30fd2470e5151db35a89e068353b78_MIT2_14S14_Problem_Set_6.pdf",
      "content": "2.14/2.140 Problem Set 6\nAssigned: Wed. March 12, 2014\nDue:\nWed. March 19, 2014, in class\nReading: Lecture notes on Operational Amplifiers\nThe following problems are assigned to both 2.14 and 2.140 students. The first two prob-\nlems review some basic circuit calculations.\nThe remainder concern operational amplifier\ncircuits, and studying the stability of these connections.\nProblem 1 For the circuits shown below, calculate the equivalent resistance seen at the indicated\nterminals, using the series and parallel resistance formulae.\nProblem 2 The circuit shown below is driven by a current source It at the terminals B-B'. The\nresulting voltage across these terminals is defined as Vt.\na) What is the equivalent resistance Req seen at the terminals B-B'? Viewed another way, what is\nthe ratio Vt(t)/It(t) = Req? The easiest way to solve this problem is to use series and parallel\nequivalents.\nb) Now we modify the circuit by removing the resistor R′ at terminals A-A', and replacing this\nwith the capacitor C shown in the figure below.\n\nWhat is the equivalent impedance Zeq seen at the terminals B-B'? Viewed another way, what\nis the ratio Vt(s)/It(s) = Zeq(s)?\nNote that here we've switched to the Laplace domain\nand work in the more general concept of impedances, since the capacitor adds dynamics to\nthe system. The easiest way to solve this problem is to use series and parallel equivalent\nimpedances.\nProblem 3 Archive Problem 9.2\nFor this circuit, make a sketch of the Bode plot for the negative of the loop transmission L(s).\nWhat are the loop crossover frequency and phase margin? Also, create a Nyquist plot for the\nloop, and indicate the loop phase margin and gain margin on your plot. For what value of C\nwill the loop be marginally stable? (Note that there is a small typo: the variables C and C′\nrefer to the same capacitor.)\nProblem 4 Archive Problem 9.5\nThis circuit can be used as an analog PI controller, for example in a closed-loop current-\ncontrolled power amplifier (see Problem G1 below). Calculate the transfer function Vo(s)/Vi(s),\nunder the assumption that the op amp has infinite gain. Use this transfer function to answer\nthe questions posed in this problem.\nProblem 5 This problem considers the op amp circuit shown below\nHere the resistors take values of R, R, and αR, respectively. The resistors R set the ideal\ngain of the circuit, which is -1. The resistor αR can be used to detune the bandwidth of\nthe opamp loop when the amplifier dynamics are too \"hot\" for the circuit configuration. In\nparticular, like all real systems, op amps have additional high frequency dynamics which can\n\ngive bad stability in some circuits. To understand this, assume\na(s) =\n5 × 107\ns(10-7s + 1)2 .\nThe additional pair of poles represent high-frequency dynamics in the internal opamp circuit.\na) First, we remove the resistor αR by letting α →inf(infinite resistance is an open circuit).\nFor this configuration, calculate the loop crossover frequency and phase margin. Use Matlab\nto plot the unit step response of the circuit. You should find that this system is unstable.\nCompare the ring frequency of the unstable step response signal with the natural frequency\nof the closed loop dominant pole pair and with the loop crossover frequency. You should see\nthat ωn ≈ωc. (When making ring frequency measurements on the step response, be sure to\nconvert from Hz to rad/sec.)\nb) Conduct a Nyquist analysis for the loop in part a), which should indicate the loop instability.\nBe sure to clearly show the number of encirclements, and resulting number of right half plane\nclosed-loop poles. Indicate the loop phase margin (negative) and gain margin (less than one)\non the Nyquist plot.\nc) Draw a root locus plot for the loop of part a). Indicate the closed-loop root locations for the\nnominal design with α →inf.\nd) Now pick a value of α which results in a loop phase margin φm = 45*. For this value of α, what\nis the loop crossover frequency ωc? Use Matlab to plot the unit step response of this detuned\ncircuit. Compare the natural frequency of the closed loop dominant pole pair with the loop\ncrossover frequency.\ne) Conduct a Nyquist analysis for the loop in part d), which should indicate the loop stability.\nIndicate the loop phase margin and gain margin on the Nyquist plot.\nf) Draw a root locus plot indicating where the closed-loop poles are located for the value of α from\npart d).\n\nThe following problems are assigned to only 2.140 students.\nStudents in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 In the lab you will see power amplifiers used to control the voltage on a load such as\na voice coil or motor. In practice, it is also common to use power amplifiers in a feedback loop\nto control the current through a load. This problem investigates the design of such current-\ncontrolled amplifier configurations. In the circuit shown below, the load is represented by\na coil with inductance Lc and resistance Rc. The load current ic is supplied by the power\namplifier A2.\nThe current is measured by passing it through the sense resistor Rs; the\nvoltage Vf is then proportional to the load current. Thus if Vf is kept at a desired level, the\nload current can be regulated. The buffer amplifier A3 is used to avoid loading the main coil\ncircuit; that is, current i2 is supplied by amplifier A3. The control amplifier A1 is used to\ncompare the reference voltage Vr with the feedback voltage Vb, and then to add dynamics to\nthe loop via R3 and C. That is, amplifier A1 is the compensation for the current feedback\nloop. Note that all the op amps are modeled as having infinite gain. All voltages labeled on\nthe circuit are with respect to circuit ground.\n\na) The current feedback loop may be represented in the form of the block diagram shown below.\nDevelop expressions for each of the transfer functions in the blocks of this block diagram, and\nfill them in on your own version of the block diagram. Carefully note the system variables\nalready shown on the block diagram, and fill in the transfer functions appropriately.\nb) Suppose the input Vr has the constant value Vr = V0. What is the steady-state load current iC\nfor this constant reference input? Explain your results.\nc) Now let the parameters take the values R1 = R2 = R4 = 10 kΩ, R5 = 50 kΩ, Rs = 1 Ω,\nLc = 100 mH, and Rc = 10 Ω. Chose the values of R3 and C such that the closed-loop\nsystem poles have a natural frequency of ωn = 1000 rad/sec and a damping ratio of ζ = 0.4.\nd) Make a sketch of the Bode plot for the negative of the loop transmission L(s). What are the\nloop crossover frequency and phase margin? How do these relate to the closed-loop natural\nfrequency and damping ratio from part c)?\ne) For these parameter values, let the input be a negative unit step Vr = -us(t). Make a graph of\nthe response in current iC(t).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/50f6cac85e3ddfe736d42dae1640c691_MIT2_14S14_Problem_Set_7.pdf",
      "content": "2.14/2.140 Problem Set 7\nAssigned: Wed. Mar. 19, 2014\nDue:\nWed. April 2, 2014, in class\nReading: Lecture notes on Operational Amplifiers; section from Chapter 2 of Operational Amplifiers\nwhich describes static nonlinearities in feedback loops.\nThe full text Operational Amplifiers can be found online at:\nhttp://ocw.mit.edu/resources/res-6-010-electronic-feedback-systems-spring-2013/.\nVideo lectures by Prof. Roberge can be found at this same location. In particular, for this problem\nset, video lecture 2 may be helpful to understand the effect of feedback on nonlinearities. There\nis also a video course manual with blackboards for all the lectures along with solutions to selected\nproblems from the text.\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 The circuit shown below implements a first-order all-pass filter. Note that we assume\nan infinite gain model for the op-amp.\nThe term all-pass is used because the circuit response magnitude is unity for all frequencies.\na) Show that the circuit transfer function is\nVo\nVi\n(s) = RCs -1\nRCs + 1.\nNote the non-minimum phase (RHP) zero.\nb) Make a hand sketch of the Bode plot for this filter. You should see that the phase varies from\n+180*at DC to 0*at high frequencies.\nc) This circuit can be used as an adjustable phase shifter where R is a variable resistor used to set\nthe phase. Let C = 0.1μF. What value of R will set the phase equal to +90*at a frequency\nof 1000 rad/sec?\n\nProblem 2 This problem considers a feedback loop with a static nonlinearity as shown below\nThe nonlinear element has an input/output characteristic given by\nThe example from Chapter 2 of the Roberge textbook will be helpful in understanding this\nproblem.\na) Assume that the input Vi takes the form of a unit ramp Vi(t) = t. Calculate and sketch the\nresulting waveforms vA(t) and vB(t). These will be piecewise linear waveforms. Be sure to\nclearly label the relevant breakpoints. Also label the slope of each line segment.\n\nProblem 3 In the loop shown below, the differential amplifier drives an RC low-pass filter. The\noutput of the filter is fed back through a unity-gain buffer. Note that we assume an infinite\ngain model for both of the op amps in this loop.\na) Draw a block diagram which includes Vi, va, vo, and Vf, and where the blocks have expressions in\nterms of the system parameters. Solve for the transfer functions vo(s)/Vi(s) and va(s)/Vi(s).\nb) Let R1 = 1kΩ, R2 = 100kΩ, R = 10kΩ, and C = 1 μF. Also let the input be a unit step\nVi = us(t). Calculate analytically and plot the closed-loop step responses va(t) and vo(t).\n\nProblem 4 The system shown below is a micropositioner, in which a stage guided by flexural legs\nmoves in the x direction as driven by the force from a voice coil actuator.\nThe combined moving mass of the stage and voice coil is m. The flexural legs have a spring\nstiffness k. The actuator is assumed ideal, with a force constant K, and thus the actuator\nforce is F = Ki, and e = K x. The actuator is driven by a power amplifier with a gain of 3,\nthrough a series resistor R.\na) Draw a block diagram which includes the signals Vi, va, e, i, x, and x.\nb) Use this block diagram to solve for the transfer function X(s)/Vi(s) in terms of the system\nvariables.\nc) Assume the system parameters take the following values: K = 10 N/A, R = 10 Ω, k = 107 N/m,\nand m = 0.1 kg. Calculate the numerical values of the transfer function X(s)/Vi(s).\nd) Let the input Vi take a 1 Volt step, i.e. Vi(t) = 1us(t) V. Use Matlab to calculate and plot the\noutput step response. What are the system natural frequency and damping ratio?\ne) Calculate and plot the system Bode plot for X(s)/Vi(s).\nf) We now design a closed-loop controller for this system of the form\n\nHere, position is measured with a capacitive position sensor, with a gain of 3 V/μm. Choose\nthe value of Go which allows a gain margin of 2. What is the corresponding crossover fre-\nquency and phase margin? Construct a Nyquist plot which shows these values. For this\ncontroller, also use Matlab to make a plot of the sensitivity S = (1 -L.T.)-1.\ng) Because the resonance is so lightly damped, the system closed-loop bandwidth determined above\nis quite limited. However, it is possible to phase-stabilize this loop by adding an additional\nhigh-frequency pole. That is, we do not require that the loop transmission remain below unity\nmagnitude in the vicinity of the resonance if the loop phase is such that the corresponding\nloop in the Nyquist plot does not encircle the -1 point. As a way to understand this, assume\nwe add a compensator pole to the loop. That is, let the compensator become Go/s(τs + 1).\nFor the present analysis, let τ = 5/ωn, where ωn is the plant natural frequency. What is the\nlargest value of G0 for which the sensitivity curve does not exceed a peak value of 10 dB?\n(You can use Matlab to help find this value.) Make a Bode plot of the negative of the loop\ntransmission L(jω), the sensitivity S(jω), and also make a Nyquist plot showing how the\n-1 point is avoided. How many crossings of unity gain are there in the loop transmission?\nCompare the accuracy of command following for this phase-stabilized loop with the pure\nintegral compensated loop from part f). (Hint: the sensitivity curve tells this story.)\nThe following problems are assigned to only 2.140 students.\nStudents in 2.14 are\nwelcome to work these, but no extra credit will be given.\nProblem G1 The OP77 data sheet is available separately from the course web page. In particular,\nthe device transfer function a(s) is shown in Bode plot form in Figure 10 on page 8 of the\ndata sheet. For this problem, assume we connect the OP77 as a unity gain buffer.\na) Consider a model of the form\na(s) =\nG0\n(τs + 1)e-sT\nwhere the e-sT term is a time delay used to model the excess high-frequency phase. What\nvalues of G0, τ, and T allow the best fit to the data sheet Bode plot?\nb) For the unity-gain buffer configuration, using this model, what are the loop crossover and phase\nmargin?\nc) Use Matlab to simulate the closed-loop step response for this configuration. How is this time\nresponse consistent with the loop crossover and phase margin?\nProblem G2 This problem considers the AC-coupled feedback loop shown below.\nThe loop is referred to as AC-coupled since it has zero gain at DC, due to the zeros at s = 0.\n\na) Sketch a root locus for K > 0. Be sure to indicate key values on the locus, and accurately show\ndeparture and arrival angles.\nb) For the remainder of the problem assume that K = 1. Make a carefully-dimensioned sketch of\nthe Bode plot of the return ratio.\nc) Conduct a Nyquist analysis which indicates whether the loop is stable for the value of K = 1.\nHow does this analysis correlate with your root locus from part a)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "2.14/2.140 Problem Set 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/b967c0837f358f6fd132bb6e53848f93_MIT2_14S14_Problem_Set_8.pdf",
      "content": "2.14/2.140 Problem Set 8\nAssigned: Fri. Apr. 4, 2014\nDue:\nWed. April 9, 2014, in class\nReading: Section 3.5 of Roberge's Operational Amplifiers, attached to this problem set.\nThis excerpt catalogs relationships for time- and frequency-domain parameters.\nThe following problems are assigned to both 2.14 and 2.140 students.\nProblem 1 The circuit shown below is adapted from the Lab 5 circuit to include a resistor Rf\nwhich allows adding a zero to the loop transfer function L(s). This allows independent ad-\njustment of the loop crossover frequency and phase margin. Note that we assume an infinite\ngain model for the op-amp. Also, as before we assume that Rs << Ra and thus that ia ≈0.\na) Draw a block diagram which includes Vi, Vo, Vf, ii, if, and ia. The entries in the various blocks\nshould be given in terms of the system parameters.\nb) Use the block diagram to write an expression for the loop return ratio L(s) for the current\ncontrol loop. Draw a pole zero-diagram for L(s) with the singularity locations labeled in\nterms of the system parameters.\nFor the remainder of this problem, assume that Ra = 1 kΩ, Rs = 100 Ω, RL = 100 Ω, and\nL = 50 mH.\nc) Choose Ri to set the DC gain such that iL = -1 mA/V × Vi.\nd) Choose Rf and Cf to set the loop crossover at ωc = 104 rad/sec with phase margin φm = 45*.\nShow your reasoning; you should be able to do this design with hand calculations. Use Matlab\nto create a Bode plot of L(s) which shows ωc and φm for your chosen design values.\ne) Use Matlab to compute the transfer functions Vo(s)/Vi(s) and Vf(s)/Vi(s). For this purpose,\nuse of the series and feedback commands will be helpful.\nCreate Bode plots for these\ntwo transfer functions and explain the asymptotic magnitude characteristics in terms of the\ntransfer function poles and zeros.\nf) For the input-output transfer function Vf/Vi Bode plot, what is the -3 dB frequency ωh? (See\nRoberge Figure 3.17) What is the frequency response peaking ratio Mp? At what frequency\n\nωp does this occur? What are the closed-loop damping ratio ζ and natural frequency ωn\nof the dominant pair in Vf/Vi? How do these values compare with those predicted via the\napproximations ζ ≈φm/100 and ωn ≈ωc?\ng) Let Vi(t) = us(t), a unit step. Use Matlab to compute Vo(t) and Vf(t) assuming zero initial\nconditions. Explain the character of the two responses in terms of the poles and zeros of\nthe respective transfer functions. With respect to the response Vf(t) what is the 10-90%\nrise time tr? (See Roberge Figure 3.17). What is the ratiometric peak overshoot P0? What\nrise time would be predicted from tr = 2.2/ωh (Roberge equation 3.57) on the basis of ωh\ndetermined in part e) above? How does this compare with the actual step response rise time?\nThe relationship tr = 2.2/ωh is extremely useful.\nProblem 2 This problem considers a one degree of freedom magnetic levitation system using a\nLorentz actuator as shown below\nIn this figure, the motion of the levitated mass is given by xs relative to inertial space. The\nsupporting base which carries the magnet structure moves relative to inertial space as xb. This\nbase motion can be used to model floor vibration, which is important to consider in precision\napplications. We assume no gravity in this problem. The objective of the levitation system\nis to control xS to follow a desired trajectory without interference from base vibrations. In\nthis problem, we consider the effect of using voltage- or current-control for the actuator drive\nrelative to the effect of base vibrations.\nThe Lorentz actuator is considered to be ideal, and thus to have no inductance or resistance,\nwith coil current i and back emf voltage e. The actuator is driven by a voltage source Vi\nthrough a series resistance R. The coupled electromechanical system can be represented as\nshown below\na) Voltage Drive Draw a block diagram which includes Vi, i, e, F, xs, xs, xs and xb.\n\nUse this block diagram to calculate the transfer function Xs(s)/Xb(s) in terms of the system\nparameters. You may assume Vi = 0 to aid in block diagram reduction, but note that this is\nnot strictly necessary, given that the system model is linear.\nOn the basis of this transfer function, what equivalent mechanical element is connected be-\ntween the base and the levitated mass? How does this result in transmission of base vibration\ninto the levitated mass?\nHand sketch a Bode plot for Xs(s)/Xb(s) with values labeled in terms of the system param-\neters. Indicate how the base vibration transmission is shown in the Bode plot.\nb) Current Drive We now close a current control loop on the coil by driving Vi on the basis of\nmeasurement of coil current i. In this context, we assume that i is directly measured, and\nthat Vi is a dependent voltage source whose value is set by the current controller, i.e., a power\namplifier. In this simple model, we will assume that the coil has no inductance, and thus that\nthe current can be controlled by a pure integral controller Gc(s) = g0/s. Draw a modified\nblock diagram which includes the same signals as in part a), but adds the current reference\nir, current error ie, and controller transfer function Gc(s) = g0/s.\nc) We will assume that g0 is large enough that the current-loop dynamics are very fast relative to\nthe mechanical subsystem dynamics. Under this assumption, we assert that the current loop\ncan be designed with the mass motion set to zero, xs = 0. Calculate the open loop plant\ntransfer function I(s)/Vi(s), and determine its high-frequency asymptotic behavior. Sketch\na Bode plot and show the high-frequency region.\nUse this high-frequency model to write an approximate expression for the current-loop crossover\nfrequency and phase margin as they depend upon g0, and thus argue that the current loop\nwill be stable for this controller and for a wide range of gains g0.\nd) Use your modified block diagram to calculate the transfer function Xs(s)/Xb(s) in terms of the\nsystem parameters with the current control loop active. You may assume ir = 0 to aid in\nblock diagram reduction, but note that this is not strictly necessary, given that the system\nmodel is linear.\nOn the basis of this transfer function, what equivalent mechanical element is connected be-\ntween the base and the levitated mass? How does this this element vary with current loop\ngain g0?\nHand sketch a Bode plot for Xs(s)/Xb(s) with values labeled in terms of the system param-\neters, and with several overlaid plots for varying g0. How does the current loop bandwidth\naffect the ability of base vibrations to affect the levitated platform motion xs?\n\nLinear System Response\nquency scale in Fig. 3.14a. These factors are combined to yield the Bode\nplot for the complete transfer function in Fig. 3.14b. The same information\nis presented in gain-phase form in Fig. 3.15.\n3.5 RELATIONSHIPS BETWEEN TRANSIENT RESPONSE\nAND FREQUENCY RESPONSE\nIt is clear that either the impulse response (or the response to any other\ntransient input) of a linear system or its frequency response completely\ncharacterize the system. In many cases experimental measurements on a\nclosed-loop system are most easily made by applying a transient input.\nWe may, however, be interested in certain aspects of the frequency response\nof the system such as its bandwidth defined as the frequency where its gain\ndrops to 0.707 of the midfrequency value.\nSince either the transient response or the frequency response completely\ncharacterize the system, it should be possible to determine performance in\none domain from measurements made in the other. Unfortunately, since\nthe measured transient response does not provide an equation for this\nresponse, Laplace techniques cannot be used directly unless the time re-\nsponse is first approximated analytically as a function of time. This section\nlists several approximate relationships between transient response and fre-\nquency response that can be used to estimate one performance measure\nfrom the other. The approximations are based on the properties of first-\nand second-order systems.\nIt is assumed that the feedback path for the system under study is fre-\nquency independent and has a magnitude of unity. A system with a fre-\nquency-independent feedback path fo can be manipulated as shown in Fig.\n3.16 to yield a scaled, unity-feedback system. The approximations given\nare valid for the transfer function Va!/Vi, and V, can be determined by\nscaling values for V0 by 1/fo.\nIt is also assumed that the magnitude of the d-c loop transmission is very\nlarge so that the closed-loop gain is nearly one at d-c. It is further assumed\nthat the singularity closest to the origin in the s plane is either a pole or a\ncomplex pair of poles, and that the number of poles of the function exceeds\nthe number of zeros. If these assumptions are satisfied, many practical\nsystems have time domain-frequency domain relationships similar to those\nof first- or second-order systems.\nThe parameters we shall use to describe the transient response and the\nfrequency response of a system include the following.\n(a) Rise time t,. The time required for the step response to go from 10\nto 90 % of final value.\n\ntM\n102 -\n10 -\n0.1\n-270*\n-18 0o\n-90*\nFigure 3.15\nGain phase plot of s(O.1s +\n107(10- 4 s + 1)\n1)(s 2 /101 2 + 2(0.2)s/10 + 1)'\n\nLinear System Response\na(s>\nvo\n(a)\nsff\n-\na\nV.a\n(b)\nFigure 3.16\nSystem topology for approximate relationships. (a) System with\nfrequency-independent feedback path. (b) System represented in scaled, unity-\nfeedback form.\n(b) The maximum value of the step response P0 .\n(c) The time at which Po occurs t,.\n(d) Settling time t,. The time after which the system step response re-\nmains within 2 % of final value.\n(e) The error coefficient ei. (See Section 3.6.) This coefficient is equal\nto the time delay between the output and the input when the system has\nreached steady-state conditions with a ramp as its input.\n(f) The bandwidth in radians per second wh or hertz fh (fh = Wch/ 2 r).\nThe frequency at which the response of the system is 0.707 of its low-\nfrequency value.\n(g) The maximum magnitude of the frequency response M,.\n(h) The frequency at which M, occurs w,.\nThese definitions are illustrated in Fig. 3.17.\n\nRelationships Between Transient Response and Frequency Response\nFor a first-order system with V(s)/Vi(s) = l/(rs + 1), the relationships\nare\n2.2 = 0.35\n(3.51)\nt,.=2.2T\n(351\nWh\nfh\nPO = M,= 1\n(3.52)\nt, =\noo\n(3.53)\nta = 4r\n(3.54)\nei = r\n(3.55)\nW, = 0\n(3.56)\nFor a second-order system with V,(s)/Vi(s) = 1/(s 2/,,\n2 + 2 s/w, + 1)\nand 6 A cos-'r (see Fig. 3.7) the relationships are\n2.2\n0.35\n(357\nW h\nfh\nP0 = 1 + exp\n= 1 + e-sane\n(3.58)\nV1 - (\nt7\n-\n(3.59)\nWn #1-2 ~on sin6\nt,\n~\n=(3.60)\no\ncos\ni=\n=2 cos\n(3.61)\nWn\n(on\n_\nM, -\nsI\n< 0.707, 6 > 45'\n(3.62)\n1_2\nsin 20\n, = co V1 -\n2 2 = w, V-cos 26\n< 0.707, 6 > 450\n(3.63)\nWh =\nfn(l-22 N2\n-4\n2+\n) 12(3.64)\nIf a system step response or frequency response is similar to that of an\napproximating system (see Figs. 3.6, 3.8, 3.11, and 3.12) measurements of\ntr, Po, and t, permit estimation of wh, w,, and M, or vice versa. The steady-\nstate error in response to a unit ramp can be estimated from either set of\nmeasurements.\n\n- -- -- -- - --\nt\nvo(t)\nP0\n0.9\n0.1\ntp\nts\nt:\ntr\n(a)\nVit\nVi (jco)\n0.707\n---\nC\n(b)\nvt\nK\nV0(tW\ne1\nt:\n(c)\nFigure 3.17\nParameters used to describe transient and frequency responses.\n(a) Unit-step response. (b) Frequency response. (c) Ramp response.\n\nError Coefficients\nOne final comment concerning the quality of the relationship between\n0.707 bandwidth and 10 to 90% step risetime (Eqns. 3.51 and 3.57) is in\norder. For virtually any system that satisfies the original assumptions, in-\ndependent of the order or relative stability of the system, the product trfh\nis within a few percent of 0.35. This relationship is so accurate that it really\nisn't worth measuringfh if the step response can be more easily determined.\n3.6\nERROR COEFFICIENTS\nThe response of a linear system to certain types of transient inputs may\nbe difficult or impossible to determine by Laplace techniques, either be-\ncause the transform of the transient is cumbersome to evaluate or because\nthe transient violates the conditions necessary for its transform to exist.\nFor example, consider the angle that a radar antenna makes with a fixed\nreference while tracking an aircraft, as shown in Fig. 3.18. The pointing\nangle determined from the geometry is\n= tan-'\nt\n(3.65)\nLine of flight\nAircraft\nvelocity = v\nRadar\nantenna ,0\nLength = I\nFigure 3.18\nRadar antenna tracking an airplane.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Instruction for Dynamic Signal Analyzer (DSA)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/78c396d86cc51240b6231d81474fa7d3_MIT2_14S14_DSA_Ins.pdf",
      "content": "Instruction for Dynamic Signal Analyzer (DSA)\n\n1. Make your closed loop system stable by implementing controller, such as P or PI, and wait until\nit settles down to steady state (Fig.1).\n\nFigure 1 - Closed loop system stabilized with proportional control\n\n2. Go to the Dynamic Signal Analyzer tab (Fig. 2) and fill out specifications.\n\nFigure 2 - Dynamic Signal Analyzer tab\n\nDynamic Signal Analyzer (blue circle in Fig. 3) can measure frequency response of a system that\nyou are interested in experimentally. It generates one output signal (SRC) to excite the loop, and\ntakes two input signals (CH1 and CH2) to measure frequency response of a system between the\ntwo channels. DSA compares CH1 and CH2 signals to calculate magnitude ratio and phase\ndifference between them, which tells you the frequency response of a system between two\nchannels.\n\nFigure 3 - DSA implemented in the Block Diagram\n\nSRC can be injected into the loop through any summing junctions; in this particular lab, we are\ninjecting it through a summing junction for reference and feedback signals (the left most red circle\nin Fig. 3). And we are tapping two signals from CH1 and CH2 to measure frequency response\nbetween the two channels. For example, if you want to measure frequency response of thermal\nplant (Tout/Vin), you can wire control effort signal to CH1 and temperature signal to CH2 (other red\ncircles in Fig. 3). If you want to measure loop return ratio (Tout/E), then you can wire error signal\nto CH1 and temperature signal to CH2.\n\nFrequency Range\nWe recommend use 0.1 Hz for initial frequency, 1 Hz\nfor final frequency, and 10 for number of bins. If you\nwant, you can put more bin numbers and wider\nfrequency range, which will give you finer result but\ntake more time.\n\nAmplitude\nFor linear system, its frequency response does not\nchange with respect to sinusoid amplitude. However,\nFigure 4 - Specification of DSA\n\nyou cannot put too large value because it could saturate the actuator, which makes the whole\nsystem nonlinear. Also, you might not want to put too small value because that leads to poor\nsignal to noise ratio.\n\nCycles\nTo measure frequency response of a system, it needs to be in steady state, so DSA spends several\nsettling cycles to get to steady state. After that, DSA takes several cycles to calculate averaged\nvalue.\n\nCH1 and CH2 Offset\nWe recommend you subtract DC offset manually from CH1 and CH2 signals to get better result.\n(Typical DSA do that automatically, but current version of LabVIEW DSA does not have that\nfunctionality)\n\n3. Now, hit the RUN button!! Then you can see a pop-up window as below.\n\nFigure 5 - Identification Window of DSA\n\n4. Once it finishes the analysis, you can right click each plot to export data to excel.\n\nFigure 6 - Export data to Excel\n5. Import the data to MATLAB to design the controller by loop shaping. Please refer to\n'LoopShaping.m' example file for the next steps.\n\nAppendix A: Troubleshooting if your don't see a pop-up window\n1) If you have trouble seeing the pop-up window, it's possible that your computer is blocking the\nserver that opens up this VI. You can resolve this by going to Tools >> Options (Figure A-1)\n\nFigure A-1: Options menu\n\n2) Under \"Categories\" on the left-hand side, select 'VI server\". Make sure \"TCP/IP' box is checked\n(Figure A-2)\n\nFigure A-2: Configuring VI Server\n\n3) Scroll down the menu to \"Machine Access\". Type an asterisk (*) in the \"Machine name/address\nbox\" (see blue circle in Figure A-3), make sure \"Allow access\" is chosen, then press the \"Add\"\nbutton (see yellow circle in Figure A-3). Do the same thing for \"Exported VIs\". You should see a\ncheck mark next to an asterisk under \"Machine access list\" (see red circle). It's okay if you have\nother items listed.\n\nFigure A-3: Configuring machine access\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/6f39d6f4606a334de5c12434dfd201c0_MIT2_14S14_Lab_1.pdf",
      "content": "2.14/2.140 Lab 1\nAssigned: Week of Feb. 10, 2014\nDue:\nWeek of Feb. 17, in your lab session\nFor Lab 1, we ask that you install and run Labview on your own laptop computer. You will also\nneed to install the CD&Sim and Mathscript RT modules. Please see instructions posted on the\ncourse web page.\nPlease load and run the file URACTLR.vi. This file lets you implement on/off and linear control of\n4 different plants. You can also test automatic (machine) on/off and linear control. The system\nruns as a 10 second simulation. During this run, your goal is to use the control input to keep\nthe plant output at a level of 0.5. Deviations from 0.5 are errors; the square of these errors is\nintegrated over the 10 second run, and displayed on a gauge and as a numerical output. The lower\nthe integrated square error, the better.\nBy the end of the lab session, conduct your own experiments with this control system. Look at\nhow each system is controlled by the machine automatic control. How well do you (human) control\nthe 4 different systems? How well does the machine control work? For the second-order system,\nexplore changes in ωn and ζ, and see how these affect the control. Before leaving lab, meet with\none of the lab staff one-on-one to explain what you've observed. Be prepared to explain the loop\nbehavior in light of the plant dynamics for each plant.\nA report documenting your experiments is due the following week (week of Feb 17) at the start\nof your assigned lab session. Reports will not be accepted more than 10 minutes late, i.e., after\n2:15 pm. We will not accept reports turned in to other lab sections. This report should show time\ntraces from some of your best runs and for your best tunings of the automatic controller in on/off\nand linear modes for each of the four plants. Explain the observed signals (control effort and plant\noutput) in terms of the plant dynamics and controller charcteristics.\nYour Lab grade will be based 50% upon your understanding as shown to in the face-to-face lab\nmeetings and 50% upon the data and understanding shown in your written report. Grades for each\nof these components will range from 0 (worst/not there) to 5 (excellent) for a total lab grade of 0\nto 10.\nWe will not make up lab sessions. If you miss a lab session, except for medical or emergency\nreasons, your lab grade will be 0.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/08d598817b5571bd673bb6bfd2388d3c_MIT2_14S14_Lab_2.pdf",
      "content": "2.14/2.140 Lab 2\nAssigned: Week of Feb. 24, 2013\nDue:\nWeek of Mar. 3, in your lab session.\nLab 2 studies a thermal control loop. The mechanical configuration of the thermal plant is shown\nbelow.\nHere a thermistor is attached to a 2N3904 NPN transistor. The thermistor is packaged in a round\nepoxy bead; we have sanded offone side of the bead in order to create a flat spot to improve heat\ntransfer. The joint thermal conductivity is improved by using thermal grease in the joint. The pair\nis held together with heat-shrink tubing, and then a styrofoam bead is used as thermal insulation.\nThe electrical configuration is shown below\n\nThis system will be the focus of the next two labs. The goal of the control system is to regulate the\nmeasured temperature to 40 *C. This is done by maintaining the transistor heating at a correct\nvalue using the control input at the base resistor. When operating at 40 *C, for small changes\nthe system can be viewed as linear, since temperature can be increased and/or decreased using the\ncontrol input. (Strictly speaking, the changes of the control input are linearly related to the changes\nof the temperature, where these changes are measured relative to the steady-state operating point\nvalues.)\nFor this week, we ask you to do the following:\n1. In open loop, manually adjust the control effort so as to set the steady operating temperature\nat 40 *C. Experimentally save and plot the step response for small control changes about\nthis equilibrium. How well does the measured step response match a fitted first order step\nresponse?\n2. Experiment with human ON/OFF control. Try this with and without the styrofoam insula-\ntion in place. Save and plot an interesting set(s) of data (both control effort and resulting\ntemperature).\n3. Experiment with machine ON/OFF control. Try this with and without the styrofoam insu-\nlation in place. Save and plot an interesting set(s) of data (both control effort and resulting\ntemperature).\n4. Experiment with human linear control. That is, you manually move the control effort slider\nto control the measured temperature to a setpoint of 40 *C. Notice how the control effort\nmust be actuated to make a relatively fast change in the controlled temperature. Try this\nwith and without the styrofoam insulation in place. Also notice the effect of disturbances\nsuch as blowing air on or touching the transistor with the insulation removed. Save and plot\nan interesting set(s) of data (both control effort and resulting temperature).\n5. Experimentally tune P and PI linear controller. First tune the loop with only a P term. Then\nadd in an I term. Can you see the effect of the integral control? Save and plot the closed-loop\nstep response to reference temperature changes of the loop operating with these controllers\n(both control effort and resulting temperature), and record the control gains used.\nAlso,\nimpose some disturbance on the system, for instance, by removing the styrofoam insulation,\nor putting your fingers on the transistor, or blowing on the device, etc. Save and plot some\ninteresting set(s) of data (both control effort and resulting temperature).\n6. For graduate students only: Create a thermal model competent to explain the observed\ndynamics.\nEstimate the thermal mass on the basis of the system dimensions and some\nreasonable assumptions of specific heat.\nUse experiments to determine the thermal loss\nmodeled as a resistance to ambient, both with and without the styrofoam peanut insulation.\nFit parameters to this model and compare with your experimental step measurements.\nCheckoffin lab session: In this week's lab session demonstrate to one of the teaching staff\nyour working controller and some experimental results. Progress shown in this checkoffwill count\ntowards half of your lab grade.\n\nAnswer sheets: At the start of next week's lab session you must submit your lab writeup. These\nwrite-ups are due at the start of the lab session, and will not be accepted late. Please attach to\nthis lab assignment clearly labeled answers and plots for all the questions above. This lab report\nwill count towards half of your lab grade.\nIt is key that you submit your lab report on time at the start of the lab session next week, as we\nwill begin work on Lab 3 during that session.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 2 Thermal Expansion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/30a17ce0aae8cec86c78646604865cd0_MIT2_14S14_Lab_2-TherEx.pdf",
      "content": "1.1. FIRST-ORDER SYSTEMS\nFigure 1.15: Sketch of bulb and relevant thermal elements.\n1.1.4\nThermal first-order system\nFor an example thermal system we study the desk lamp shown in the picture\n(to be added). This lamp bulb is electrically heated via the bulb filament.\nThe resulting bulb temperature is measured with the infrared sensor shown\nin the figure (to be added). A sketch of the light bulb in the lamp is shown\nin the line drawing of Figure 1.15.\nWe left the lamp on for a long enough time to reach steady state, and\nthen turned o↵the lamp and measured the decay of temperature back to\nambient. Data taken from this system is shown in tabular and graphical\nform in Figure 1.16. By inspection of this data, the bulb system is well-fit\nby a first-order model of the form of (1.1). An estimate of the associated\ntime constant is about 3 minutes. But we need to have ⌧in seconds, so the\nsystem time constant is formally given as ⌧= 180 sec.\nAn abstraction to a lumped model of this system is shown in Figure 1.17.\nHere the thermal capacitance of the bulb is summarized by the block of\nmaterial labeled with the capacitance Cb with units of [J/*K]. The block\nis assumed to have a uniform temperature Tb [*K]. This block has a total\nstored thermal energy Wb = CbTb [J]. The change of thermal stored energy\nhappens via heat flow\nqb = dWb\ndt\n= Cb\ndTb\ndt .\n(1.23)\nHere qb in units of watts represents heat flow into the bulb. As shown in\nthe figure, we assume that the block is insulated on three sides, and so the\n\nCHAPTER 1. NATURAL RESPONSE\nFigure 1.16: Data from light bulb cooling experiment.\n\"ULBTHERMALCAPACITANCE\n4HERMALRESISTANCE\nTOOUTSIDEWORLD\n#B\n4B\n2B\n44A\nFigure 1.17: Lumped model for bulb cooling experiment.\n\n1.1. FIRST-ORDER SYSTEMS\nheat flow through those sides is zero. The block is connected to the outside\nambient temperature via the thermal resistance Rb, such that\nqb = Ta -Tb\nRb\n.\n(1.24)\nThis resistance represents the flow of heat into the bulb as a linear function of\nthe temperature di↵erence4 between the ambient and the bulb temperatures.\nSetting equality between the last two equations gives\nCb\ndTb\ndt = Ta -Tb\nRb\n.\n(1.25)\nNow, it's convenient to define a variable to represent the temperature dif-\nference between the bulb and ambient: T ⌘Tb -Ta. Since the ambient\ntemperature is constant, dT/dt = dTb/dt. Making these substitutions and\nmultiplying (1.25) through by Rb yields\nRbCb\ndT\ndt + T = 0.\n(1.26)\nIf we define ⌧= RbCb, this is in the form of (1.1). The natural response is\nthus as calculated in section 1.1, with its associated figures. Specifically, if\nthe initial temperature di↵erence of the bulb is defined as T(0) = T0, then\nthe temperature di↵erence as a function of time varies as\nT(t) = T0e-t/RbCb [K].\n(1.27)\nIf you want to convert back to the absolute temperature of the bulb, re-\nmember that Tb = T + Ta.\n1.1.5\nFluidic first-order system\nA fluidic system which can be modeled with a first-order di↵erential equation\nis shown in Figure 1.18. Here a tank filled with liquid drains through a long,\nthin pipe. The height of the liquid above the pipe inlet is defined as h. If we\nassume that the liquid has a density of ⇢[kg/m3], then the pressure Pt at\n4In real systems, more exact and likely nonlinear models can apply, but a linear model\ngives a first understanding of this system response, and is well able to match the measured\nbehavior.\nFor example, pure radiative cooling varies as temperature di↵erence to the\nfourth power, which is highly nonlinear. There will certainly be radiative heat flow in\nthis system, however, the experimental data fits well to a linear heat flow model which\nsuggests that radiative cooling is not highly significant at the bulb envelope temperatures\nof 100 *C and down to ambient.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/12d282985015ed6dc5c2856bb1c0c9c2_MIT2_14S14_Lab_3.pdf",
      "content": "2.14/2.140 Lab 3\nAssigned: Week of Mar. 3, 2014\nDue:\nWeek of Mar. 17, in your lab session.\nLab 3 continues with studies of a thermal control loop. You will design PI and PID controllers\nvia experimental loop shaping. First, carefully measure the plant transfer function. Use this\nexperimental data to design PI and PID controllers that achieve a phase margin of 45* ± 5* with\nas high a crossover frequency as you can achieve. Experimentally measure the return ratio transfer\nfunction to confirm your design's crossover frequency and phase margin.\nNote that you do not need to create a parametric model of the plant, but can work directly from\nthe plant experimental magnitude and phase measurements. To do this, bring your plant data\ninto Matlab as vectors of frequency, magnitude, and phase. On the basis of this data, design a\ncontroller that you think will work. Then use the Matlab command [mag,phase] = bode(sys,w),\nwhere w is the vector of frequencies at which you have experimental plant data. This allows\nyou to compute the controller magnitude and phase at all the experimentally measured frequen\ncies. Then the return ratio magnitude is the controller magnitude multiplied by the plant mag\nnitude frequency by frequency. In Matlab, you will use the dot multiply to do this: magloop =\nmagcontroller .* magplant. Similarly, the return ratio phase is the controller phase added to the\nplant phase frequency by frequency. In Matlab, you will use the vector add to do this: phaseloop\n= phasecontroller + phaseplant. Then you can use plotting commands loglog and semiologx\nto make the return ratio magnitude and phase plots.\nSpecifically, we ask you to:\n1. Experimentally measure an accurate plant transfer function. Try this measurement at several\namplitudes so as to be confident that you are not seeing nonlinear effects. Document your\nmeasurements.\n2. Use Matlab to design a PI controller to meet the specifications above for the measured plant\ndata. Document your design approach and show return ratio Bode plots indicating the\nexpected loop crossover and phase margin.\n3. Experimentally implement your PI controller. Measure the closed loop small-signal step\nresponse. Also measure the return ratio Bode plot. How do your crossover frequency and\nphase margin compare with the design values?\n4. Use Matlab to design a PID controller to meet the specifications above for the measured\nplant data. Document your design approach and show return ratio Bode plots indicating the\nexpected loop crossover and phase margin.\n5. Experimentally implement your PID controller. Measure the closed loop small-signal step\nresponse. Also measure the return ratio Bode plot. How do your crossover frequency and\nphase margin compare with the design values?\n\n6. For graduate students only: Create a pole-zero-gain (PZK) model for the plant. (See\nMatlab help files for this model type.) Note that you may need to add some amount of\ntime delay to your model to allow matching the phase. To match a fractional-order Bode\nplot magnitude roll-off, you can add sets of pole/zero doublets on the real axis. The relative\nspacing of these doublets sets the fractional order. Fit parameters to this model and compare\nwith your experimental frequency response measurements to show the quality of the fit. Use\nthis model to predict the closed-loop step response for your loops with the PI and PID\ncontrollers. How do these predictions compare with the measured step responses?\nCheckoff in lab session: In this week's lab session demonstrate to one of the teaching staff\nyour working controller and some experimental results. Progress shown in this checkoff will count\ntowards half of your lab grade.\nAnswer sheets: At the start of next week's lab session you must submit your lab writeup. These\nwrite-ups are due at the start of the lab session, and will not be accepted late. Please attach to\nthis lab assignment clearly labeled answers and plots for all the questions above. This lab report\nwill count towards half of your lab grade.\nIt is key that you submit your lab report on time at the start of the lab session next week, as we\nwill begin work on Lab 4 during that session.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/b0be8a14319de9b330e2fc53a2301f35_MIT2_14S14_Lab_4.pdf",
      "content": "2.14/2.140 Lab 4\nAssigned: Week of Mar. 17, 2014\nDue:\nWeek of Mar. 31, in your lab session.\nLab 4 concerns the op-amp circuit shown below. You will use the NI myDAQ kit and protoboard\nto build and test this circuit, and compare your measured results against theory.\nBuild this circuit on the protoboard of your myDAQ kit. Be sure to connect power to the op amp\nand use the indicated bypass capacitors. For this circuit:\n- Calculate the closed loop transfer function from reference Vr to output Vo. For this purpose,\nmodel the 741 op amp with the transfer function Voutput(s) = (6×106/s)(v+(s)-v-(s)), i.e.,\na(s) = 6 × 106/s, where Voutput is the amplifier output voltage at pin 6.\n- Analytically calculate the closed-loop step response. (Do not use any numerical program such\nas Matlab.)\n- Make a carefully labeled and dimensioned Bode plot for the closed loop response. (Do not\nuse any numerical program such as Matlab.)\n- Use the scope and signal generator VIs in Labview to measure and plot the closed-loop step\nresponse. Compare with the analytical result from above.\n- Use the scope and signal generator VIs in Labview to measure and plot the closed-loop\nfrequency response. Compare with the analytical result from above.\n\nCheckoffin lab session: In this week's lab session demonstrate to one of the teaching staffyour\nworking circuit and some experimental results. Progress shown in this checkoffwill count towards\nhalf of your lab grade.\nAnswer sheets: At the start of your lab session during the week of March 31 you must submit\nyour lab writeup, including the completed Lab 4 answer sheet. These write-ups are due at the start\nof the lab session, and will not be accepted late. Please include in your lab report clearly labeled\nanswers and plots for all the questions above. This lab report will count towards half of your lab\ngrade.\nIt is key that you submit your lab report on time at the start of the lab session.\n\n2.14/2.140 Spring 2014 -- Lab 4 Answer Sheet\nName:\nPlease complete this answer sheet and include it with your lab report. This will be the primary\ndocument that we will use to grade your work on Lab 4, so please be sure to fill in all requested\ninformation.\n1. The closed-loop transfer function from reference Vr to output Vo is:\n2. The closed-loop poles are located at:\nwith natural frequency ωn and ζ of:\n3. An analytical expression for the closed loop step response is:\nThe following requested plots should be attached to this answer sheet:\n1. A carefully labeled and dimensioned sketch of the analytical closed-loop step response. (This\nshould be a hand-sketch. Do not use any numerical program such as Matlab.)\n2. A carefully labeled and dimensioned Bode plot for the closed loop response. (This should be\na hand-sketch. Do not use any numerical program such as Matlab.)\n3. A well-scaled experimental step response acquired using the scope and signal generator VIs\nin Labview. List the measured ωn and ζ on the basis of the step response and explain how\nthese were measured. Compare with the analytical result from above.\n4. A well-scaled experimental Bode plot of the frequency response acquired using the scope and\nsignal generator VIs in Labview. List the measured ωn and ζ on the basis of the frequency\nresponse and explain how these were measured. Compare with the analytical result from\nabove.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2.14/2.140 Lab 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/1ac936abb8cf72269b331d4dc18be343_MIT2_14S14_Lab_5.pdf",
      "content": "2.14/2.140 Lab 5\nAssigned: Week of Mar. 31, 2014\nDue:\nWeek of Apr. 7 , in your lab session.\nLab 5 concerns the op-amp circuit shown below. This circuit implements a current-control loop,\nwhich regulates the current iL passing through the inductor.\nSuch current control circuits are\nwidely used, e.g., to drive actuators such as motors in order to control torque/force. The focus of\nthis lab is on the feedback dynamics of the current control circuit.\nUnlike Lab 4, here we will assume that the op amp has infinite gain. The reason for this assumption\nis that the feedback capacitor C1 sets the op amp dynamics such that the internal a(s) model is\nnot needed to accurately model the loop operation relative to the current control dynamics. Also,\nsince the capacitor looks like a short-circuit at high frequencies, the op-amp feedback has unity\ngain and zero phase shift at high frequencies, and thus the internal loop will be stable. Thus, the\ninternal amplifier dynamics are stable, and much faster than the current control dynamics, and so\nwe can ignore them for our present purposes.\nReal inductors have internal resistance, due to the non-zero resistance of the wire used to form the\ncoil. In this circuit, the inductor resistance is represented by RL. The inductor current iL passes\nthrough the sense resistor RS, which gives a voltage Vf = iLRs. We set Ra >> Rs, and thus we\ncan assume that all of iL passes through RS, and thus that ia ≈0. This lets us ignore the loading\nfrom Ra when computing Vf.\nYou will use the NI myDAQ kit and protoboard to build and test this circuit, and compare your\nmeasured results against theory.\n\nFor this circuit, we ask you to analyze the loop dynamics as they depend upon the choice of\ncomponent values. Specifically:\n1. Derive and draw a block diagram representation for the circuit. As part of this block diagram,\ninclude the signals Vr, ii, ia, iC, Va, Vf, and the inductor current estimate ˆiL = Vf/RS.\n2. Use your block diagram to calculate the closed-loop transfer function Vf(s)/Vr(s).\nThis\ntransfer function should be in terms of the component values as variables. Do not substitute\nin any numbers at this point. What is an expression for the closed-loop DC gain?\n3. Solve for the closed-loop ωn and ζ of the poles of Vf/Vr in terms of the parameter values.\n4. For the remainder of this problem, let Ri = 20Ra, C1 = 1 nF, L = 47 mH, RL = 100 Ω,\nand RS = 100 Ω. Show that these values result in a closed-loop DC current gain of iL =\n-0.5 mA/V × Vr.\n5. The only component left unspecified so far is Ra. Compute the three values of Ra which give\nclosed-loop natural frequencies of 103, 104, and 105 rad/sec, respectively. For each of these\nthree values, create Bode plots of the loop return ratio. What are the crossover frequency ωc\nand phase margin φm for each of the three values? How do these compare with the closed-loop\nωn and ζ? (Recall the approximations ωn ≈ωc and ζ ≈φm/100.)\n6. For each of these three values, use Matlab to compute and plot the closed-loop step response\nof Vf to a 2 volt step in Vr.\nAlso, for each of these three values, compute and plot the\nclosed-loop Bode plot from input Vr to output Vf.\nThe experimental part of this lab uses the values for ωn = 104, as computed above. For these\nvalues, build this circuit on the protoboard of your myDAQ kit. Be sure to connect power to the\nop amp and use the indicated bypass capacitors. For this circuit, use the 47 mH inductor we have\nprovided, and use a 741 op amp. Measure the coil resistance RL of the inductor; this should be\nclose to the value given above. Recompute your predicted step and frequency responses for the\nmeasured component value. (Extra credit: Design an experiment to measure the inductance value\nL, and use this measured value in your calculations below.)\n1. Use the myDAQ with the scope and signal generator VIs in Labview to measure and plot the\nclosed-loop step response of Vf to a 2 volt step in Vr. Also record the control effort Va. Be\ncareful that the response is in the linear regime, i.e. no saturation in the control effort Va. If\nnecessary, reduce the amplitude of the input square wave such that the response is in a linear\nregime.\nFor this linear response, what are the measured closed-loop 10-90% rise time, percentage peak\novershoot, natural frequency ωn, and damping ratio ζ? Compare with the Matlab result from\nabove.\n2. Use the Bode Analyzer VI in Labview to measure and plot the closed-loop frequency response\nfrom input Vr to output Vf. Be sure to use enough frequency points to see any resonance\nclearly. Be careful that the response is in the linear regime, i.e. no saturation in the control\neffort Va. If necessary, reduce the amplitude of the input sine wave such that the response is\nin a linear regime.\n\nFrom the frequency response, estimate the closed-loop natural frequency ωn, and damping\nratio ζ. Compare with the Matlab result from above.\nTo learn how to use the Bode analyzer, you might want to first measure a simple circuit such\nas an RC low-pass filter, which can be easily compared with theory. You also could use the\nBode analyzer to measure the plant frequency response Vf/Va as a way to experimentally\nmeasure the inductor resistance and inductance, assuming a known value of RS = 100 Ω.\nCheckoffin lab session: In this week's lab session demonstrate to one of the teaching staffyour\nworking circuit and some experimental results. Progress shown in this checkoffwill count towards\nhalf of your lab grade.\nAnswer sheets: At the start of your lab session during the week of April 7 you must submit your\nlab writeup, including answers to all the questions in the lab assignment. These write-ups are due\nat the start of the lab session, and will not be accepted late. Please include in your lab report\nclearly labeled answers and plots for all the questions above. This lab report will count towards\nhalf of your lab grade.\nIt is key that you submit your lab report on time at the start of the lab session.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Instructions for installing LabVIEW software for 2.14 labs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-14-analysis-and-design-of-feedback-control-systems-spring-2014/486d7cdeb92c595ae33a396dba4ea4cc_MIT2_14S14_Lab_0_Soft.pdf",
      "content": "Instructions for installing LabVIEW software for 2.14 labs\n1. Go to http://www.ni.com/academic/download.htm. You should see the screen in Figure 1.\n\nFigure 1: Website for software download\n2. Expand the categories and download the software highlighted in red in Figure 2\n\nFigure 2: Software to download\n\n3. Once you've downloaded the myRIO DVD 1 and DVD2, run the setup executable of DVD1.\nInstall the components as seen in Figure 3. During the install, you will be asked for a serial #. If\nyou haven't been provided with one in class, choose \"evaluation mode\", otherwise, use the\nserial # you've been given.\n\nFigure 3: Items to install during myRIO Software Suite setup\n\n4. Run the ELVISmx installer and install ELVISmx. You are done!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.14 / 2.140 Analysis and Design of Feedback Control Systems\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}