{
  "course_name": "Analytical Techniques for Studying Environmental and Geologic Samples",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Earth Science",
    "Environmental Science",
    "Geochemistry",
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Earth Science",
    "Environmental Science",
    "Geochemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nLabs: 2 sessions / week, 2.5 hours / session\n\nPrerequisite\n\nStudents need permission from instructors to enroll.\n\nOverview\n\nThis course focuses on analytical facilities that are used to determine elemental and isotopic abundances in soils, rocks, minerals, and fluids. Emphasis is on isotopic ratios of Sr, Nd, and Pb, which can be used for geochronology, and abundances of trace elements such as Rb, Sr, Cu, Cd, Hg, rare-earths, Pb, Th, and U. Analytical techniques include mass spectrometry, emission spectrometry, atomic absorption, neutron activation, and electron microprobe. A major lab project utilizes these techniques to address specific environmental and geologic problems.\n\nReference Books\n\nGill, Robin, ed.\nModern Analytical Geochemistry (Longman Geochemistry Series)\n. Addison Wesley Longman, 1997. ISBN: 9780582099449.\n\nPotts, P. J.\nA Handbook of Silicate Rock Analysis\n. Chapman and Hall, 1987. ISBN: 9780412008818.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nBasic geochemistry & glaciology background\n\nSpecimen characterization with the Electron Microprobe Part 1\n\nSpecimen characterization with the Electron Microprobe Part 2\n\nToxic pollutants\n\nSr Isotope dating\n\nU/Th/Pb dating\n\nAnthropogenic Geochemistry\n\nInductively Coupled Plasma: Emission and Mass Spectrometry\n\nInterferences in Inductively Coupled Plasma Mass Spectrometry\n\nGrading\n\n30% on homework assignments and 70% on final report.",
  "files": [
    {
      "category": "Resource",
      "title": "Concentration Determination by Isotope Dilution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/50a45aa264ac7dba40a043bc9e1de357_MIT12_119S11_assignment1.pdf",
      "content": "12.119: Concentration determination by isotope dilution\nMost concentration determinations that are done by thermal ionization mass spectrometry use the technique of isotope dilution. The\nbasic principle of isotope dilution is that a known amount of a spike (or tracer) of known isotopic composition and elemental\nconcentration is added to a sample of unknown isotopic composition and unknown element concentration. From the measured\nisotopic composition of the spiked sample, the isotopic composition and elemental concentration of the unknown can be calculated.\nFrom the viewpoint of arithmetic, it is a simple mixing problem:\nAtoms in sample + atoms in spike = atoms in mixture\nThe \"atoms in spike\" is known from previous measurements and the weight of the spike; the \"atoms in mixture\" is the quantity\nmeasured in the mass spectrometer, so that the unknown is \"atoms in sample.\" The only kicker in the works is that we measure ratios\nof atoms in the mass spectrometer, because they are easier to measure, and have fewer uncertainties than measurements of \"absolute\"\nnumbers of atoms. Correspondingly, the arithmetic is complicated by having to deal with ratios.\nIn our laboratory, we use two different Pb spikes - a 205Pb spike and a 208Pb spike. Here are the data for the spikes:\n204Pb\nMIT 1M:\n0.000475717\nData in picomoles/gram of spike\n205Pb\n18.4094\n206Pb\n0.009715\n207Pb\n0.00703748\n208Pb\n0.015377\nMIT 208:\n3.7620e-6\nData in picograms/milligram of spike\n0.00767233\n5.5536e-5\n155.093136\nAtomic weights:\n203.97302\n204.9737\n205.97444\n206.975872\n207.976627\n12.119: March 15, 2011\nF.O. Dudas\n\nThe data for samples run with the two spikes are (these are fractionation corrected, atomic ratios):\nMIT-1M\n206Pb/204Pb\n207Pb/204Pb\n208Pb/204Pb\n206Pb/205Pb\nsample wt. (g) spike wt. (g)\nT 2545\n\n18.702\n15.644\n38.464\n45041.035\n0.1420\n0.0105\nMIT 208\n206Pb/204Pb\n207Pb/204Pb\n208Pb/204Pb\n208Pb/206Pb\nsample wt. (g) spike wt. (g) extracted wt. (g)\nCh4 EtOH IC\n18.584\n15.594\n38.250\n0.3138\n12.3029\nCh4\n\nEtOH\n\nID\n\n29.963841\n0.09611\n0.0219\n1 Of the total extracted weight in the line above, this is the weight of the aliquot I spiked.\nYour task is to calculate the concentration of Pb in the two samples.\nDue date: March 29, 2011\n12.119: March 15, 2011\nF.O. Dudas\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_119S11_assignment3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/ddf823e8263325b3ec51f415703e9d79_MIT12_119S11_assignment3.pdf",
      "content": "12.119 Problem Set: Electron Microprobe\nQuestion 1: Characteristic X-rays\nFor the following elements decide which one of the three diffracting crystals\nwould be the best to measure the X-ray intensities of MgKD, CaKD and FeKD. The\noptimal range of 2T for each crystal is between 30o and 130o and the best peak shape is\nachieved closest to the middle of the 2T range of the spectrometer. Recall Bragg's Law,\nnO = 2dsinT. We are typically interested in first order diffractions (i.e., n=1).\nDiffracting Crystal\nTAP\nPET\nLiF\nLattice spacing (2d) (nm)\n2.5757\n0.8742\n0.4027\nElement\nMg\nCa\nFe\nKD X-ray wavelength (O) (nm)\n0.989\n0.33584\n0.193735\nQuestion 2: Quantitative analysis using Bence-Albee corrections\nThe X-ray intensity generated for an element \"i\" is proportional to the\nconcentration (Ci) of that element in the sample. However, the X-ray intensity emitted (Ii)\nis different from the generated intensity because of the effects of average atomic number\n(Z), absorption (A) and fluorescence (F) arising from the presence of other elements in\nthe sample and the standard. This is known as the matrix effect. The emitted intensity (Ii),\nconcentration (Ci) and matrix correction factors (ZAF) are related by the following\nequation:\nCi\nunk / Ci\nstd\n= (Ii\nunk / Ii\nstd) * ZAF\n\n(1)\n\nwhere, \"unk\" denotes the unknown compound, \"std\" the standard, and Ii\nunk / Ii\nstd , the X-\nray intensity ratio, is known as the \"k-ratio\" of element i (ki):\nki = Ii\nunk / Ii\nstd\n\n(2)\n\nZAF includes the combined effects of the matrices of the unknown and the standard.\nSince the standard composition is known, the contribution to ZAF from the standard is\nalso known. The concentration in the standard divided by its own matrix correction\nfactors is the standard correction factor (CF). The contribution to ZAF from the unknown\nis denoted by E. Hence, for element i in the unknown compound with n elements:\nCi = Ei ki CFi\n\n(3)\n\nwhere,\n- 1\n\nEi = (C1Di1 + C2Di2 +...+ CiDii +...+ CnDin)/(C1 + C2 +...+ Ci +...+ Cn)\n(4)\nwhere, Dij is the D-factor, a constant for element i in the binary system i-j, at a given\nvalue of electron beam energy E0 and take-off angle \\. The value of Dii, which is the D-\nfactor of element i in itself, is unity.\nSince both Ci and Ei are unknown in the above equations, an iterative procedure is\nused to determine Ci. In the first step, an initial \"first approximation\" concentration of\neach element is calculated as:\nCi\n0 = ki CFi\n\n(5)\n\nUsing these \"first approximation\" concentrations, the initial values of E are calculated as:\nEi\n0 = (C1\n0Di1 + C2\n0Di2 +...+ Ci\n0Dii +...+ Cn\n0Din)/(C1\n0 + C2\n0 +...+ Ci\n0 +...+ Cn\n0) (6)\nThen, the next set of concentrations is calculated using the E0 values and equation (3). In\nturn, the next set of E values are calculated using equation (6). This procedure is repeated\nuntil the differences between successive calculated E values are arbitrarily small. This\nhappens after 3 or 4 iterations. The final calculated concentrations are determined using\nequation (3) and the final calculated E values.\nIn the following problem, the measured (emitted) X-ray intensities of Mg, Si and\nFe in standards and an olivine sample are given. Synthetic forsterite for Mg and Si, and\nMarjalotti olivine for Fe were used as standards. Although we measure the intensities of\nthe elements, the Bence-Albee correction procedure calculates the concentrations as\noxides because the standard composition is defined in terms of oxides. The D-factors at\nE0=15 keV and \\=40o are provided. Calculate the concentrations of MgO, SiO2 and FeO\nin the sample using the iterative procedure discussed above (repeat up to 4 iterations).\nMgO\nSiO2\nFeO\ncomment\nIi\nstd\n393.46\n328.81\n22.1\nstandard intensity\nCF\n0.5473\n0.3364\n0.1018\nstandard correction factor\nIi\nunk\n329.72\n325.26\n14.51\nmeasured intensity in the sample\nDMg-i\n1.085\n2.101\nalpha factors: DMg-Mg, DMg-Si, DMg-Fe\nDSi-i\n1.414\n1.3\nalpha factors: DSi-Mg, DSi-Si, DSi-Fe\nDFe-i\n1.119\n1.126\nalpha factors: DFe-Mg, DFe-Si, DFe-Fe\nki\n...\n...\n...\nk-ratio\nCi\n...\n...\n...\n\"first approximation\"concentration\nEi\n...\n...\n...\nfirst E\nCi\n...\n...\n...\nconcentration after first iteration\nEi\n...\n...\n...\nE after first iteration\n...\n...\n...\n...\nsuccessive iterations\nCi\n...\n...\n...\nfinal concentration\n- 2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_119S11_PSet2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/e7ace2638d7b86bab91eb63ea19f524b_MIT12_119S11_PSet2.pdf",
      "content": "12.119: Fractionation Corrections in Mass Spectrometry\nFractionation is a primarily mass-dependent phenomenon that affects the distribution of\nisotopes of individual elements during processes in which there is mass transfer. There\nare rare instances of mass-independent fractionation, but, for our purposes, the simplest\nexplanation of the cause of mass-dependent fractionation is that, for isotopes of a single\nelement, the lighter-mass isotopes have lower binding energy than the heavier isotopes.\nAs a consequence, in any process that involves the breaking of chemical bonds,\nregardless of bond type, the bonds of the lighter isotopes are preferentially broken, and\nthe lighter isotope is preferentially represented in the product of the process.\nDuring thermal ionization mass spectrometry, the fundamental processes are the\nevaporation of atoms from the filament in response to heating, the ionization of the\nevaporated atoms, and the acceleration of the resulting ions into the mass analyzer of the\nmass spectrometer. It is during the evaporation step, primarily, that lighter isotopes are\npreferentially removed from the filament, so that the isotopic ratios that are measured\nduring the course of an analysis will tend to show a systematic shift with time. This shift\nwill produce increasing ratios as a function of time when the light isotope is used as the\ndenominator. The extent of fractionation depends on absolute mass, on the mass\ndifference between the isotopes, and on the temperature. The greatest natural\nfractionations in processes that occur near the earth's surface approach 1%, and are\nobserved for isotopes of hydrogen.\nIn the case of lead, the absolute mass is large and the mass difference is 4 mass units or\nless; in natural terrestrial processes, there is little or no observable fractionation. In the\nmass spectrometer, however, the filament is at high temperature (roughly 1200°\n1400°C) and is in a vacuum - measurable fractionation occurs, so that all data have to be\ncorrected for this systematic bias. We have measured the fractionation of lead in our\nmass spectrometers by analyzing multiple samples of a standard whose isotopic\ncomposition has been accurately determined.\nThe fractionation of isotopes during any process of evaporation is described by the\nRayleigh equation:\nR / Ro = f (α-1)\nwhere R is the isotopic ratio of material remaining in the reservoir (i.e., the filament) at\nany instant, Ro is the initial isotopic ratio of the whole sample, f is the mass fraction of\nthe sample remaining in the reservoir, and α is the isotopic fractionation factor, defined\nas the isotopic ratio in the product / isotopic ratio of material remaining in the reservoir.\nIn practice, for small values of α, this can be approximated by a linear equation:\nRtrue = Rmeas*(δMα/100) + 1)\n12.119 March 17, 2011\nF. Dudas\n\nwhere δM is the mass difference in amu for the isotope pair, and the factor of 100 is\nincluded because α is usually expressed as %/amu. If we solve for α (assuming a mass\ndifference of 1), this can be written as\nα = ((Rtrue - Rmeas) / Rmeas)*100.\nValues of α can be positive or negative, depending on a number of factors. For the mass\nspectrometer configuration with which your Pb samples were measured, the value of α =\n0.12 ± 0.03%/amu.\n1. For the following data, calculate the \"true\" isotopic compositions by making the\nnecessary fractionation corrections.\n2. Assuming that the typical uncertainty of a measured ratio is 0.05%, what is the\ngreatest source of uncertainty in analyses of the isotopic composition of lead?\nMeasured Values:\nSample\n206/204\n207/204\n208/204\n207/206\n208/206\nNBS-981\n16.9113\n15.4580\n36.5940\n0.914096\n2.16396\n12.119 #2\n18.4321\n15.5574\n37.9817\n0.844187\n2.06109\n12.119 #8\n17.2215\n15.4436\n36.8678\n0.896904\n2.14097\nIn the case of Sr, the natural abundances of 86Sr and 88Sr are practically invariant, and, by\nconvention, 86Sr/88Sr is defined to be 0.1194. Attached is a data file showing Sr isotopic\ncompositions during a single mass spectrometer run of the Sr isotopic standard, NBS-987\n(or NIST 987). For these data:\n3. Calculate the value of α per amu, assuming that 86Sr/88Sr = 0.1194, for each\nmeasurement.\n4. Calculate a linearly fractionation-corrected value for 87Sr/86Sr (this ratio is\nvariable in nature) for each measurement.\n5. Plot the raw data in coordinates of 86Sr/88Sr (abscissa) vs. 87Sr/86Sr, and the\ncorrected data in coordinates of 86Sr/88Sr (raw) vs. 87Sr/86Sr (corrected). These\nplots should show the effect of fractionation during analysis quite dramatically.\n6. Based on these measurements, what is the best estimate of the actual value of\n87Sr/86Sr in NIST-987?\n7. What is the uncertainty of this measurement?\nDue Date: March 31, 2011\n12.119 March 17, 2011\nF. Dudas\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_Ion_Exchange.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/f774d66019450667c8d485d9957ac509_MIT12_119S11_Ion_Exchange.pdf",
      "content": "Ion Exchange Chromatography\nThe separation and purification of various elements by ion exchange chromatography\ntakes advantage of the variation of the electrostatic bond energies of ions in solution.\nThus, the two main controlling factors in ion exchange chromatography are the ionic\ncharge (z) and the ionic radius (r). These two are combined in the ionic potential - z/r -\nthat can be used to compare relative electrostatic bond strengths. Ions of high charge\n(trivalent or greater) and small radius have high electrostatic bond strength, and therefore\nare likely to attach strongly to an oppositely charged solid surface, whereas ions of low\ncharge and large radius form relatively weaker electrostatic bonds. By manipulating the\nchemistry of the solution, ions can be separated from each other using this contrast in\nbond strength.\nIn an ion exchange column, the stationary phase is a resin on which a usually organic\ncoating provides a charged surface. The mobile phase is a solution with which the ions to\nbe separated are introduced into the system; aqueous acid and base solutions, and\norganic, non-aqueous solutions can be used as the mobile phase. The resin typically\nconsists of inert (commonly polystyrene), spherical beads; these are coated with any\nrange of polar molecules, some of which provide negatively charged surfaces (for\nseparation of cations), and others of which provide positively charged surfaces (for\nseparation of anions). In our applications, the separation of Pb takes advantage of a very\nstable anionic Pb bromide complex (PbBr4\n2-), using \"anion resin\" (positively charged\nresin surfaces), whereas the separation of Sr (Sr2+) uses a \"cation resin\" with negatively\ncharged surfaces. The resin and mobile phase have to be chemically compatible, so that\nthe only reactions that take place during chromatography are the adsorption - desorption\nreactions at the resin surface.\nWe can characterize the theoretical effectiveness of the separations in ion exchange\nchromatography by comparing the distribution coefficients (D) of various ions. The\ndistribution coefficient is defined as the ratio of the concentration, at steady state, of an\nelement or ion on the solid (resin) to the concentration in the liquid:\nD = Cs / Cl\nAt high D (> 100), ions will remain attached to the stationary phase (resin), whereas at\nlow D (< 0.1), ions will remain primarily in the mobile phase, the liquid. Obviously, the\nbest separation of two ions occurs when they have contrasting D. In most ion exchange\nchromatographic procedures, the D of ions of interest is > 1000 during the stages when\nunwanted ions are being removed from the system, and is < 1 during stages when the ion\nof interest is being collected. It is obvious that ions that have similar z/r, and therefore\nbroadly similar D, are difficult to separate. D for all ions varies as a function of the\ncomposition of the solution; for PbBr4\n2-, for example, D is > 100 for HBr concentrations\nbelow about 2 M HBr, but drops dramatically as the acid concentration is increased, and\nis < 1 for concentrated HBr solutions (8.3 M HBr).\n12.119, 3/30/11: F.O. Dudas\n\nThe distribution coefficient can be defined thermodynamically (more detail than you\nneed here). Consequently, it is affected by the factors that affect the thermodynamics of\naqueous solutions - temperature, Eh, pH, solution composition, and ionic strength. It is\nless sensitive to variations in pressure because neither the stationary nor the mobile phase\nis very compressible. In most applications, conventional ion exchange chromatography\nis done at room temperature, but it is obvious that temperature has a pronounced effect on\nthe kinetics of adsorption - desorption reactions. Eh is not directly controlled - most\nsolutions are oxidizing because the procedures are conducted in an uncontrolled,\noxidizing atmosphere. In exceptional applications, temperature and pressure can be\ncontrolled, and separations can be done in inert (low-oxygen) atmospheres. Solution\ncomposition and ionic strength are manipulated primarily by varying the amount of\nsample in relation to the amount of liquid initially loaded onto the column, and by\nvarying the acid concentration of liquids that are added to the column. In the ideal case,\nsample solutions should be dilute enough to avoid ionic strength effects.\nThe factors that affect separation during ion exchange chromatography include the\nsurface area of the stationary phase (resin bead size); the density of exchange sites on the\nstationary phase surface (cross-linkage); the flow rate of the mobile phase (resin bead\nsize and column geometry; system pressure in high-pressure chromatography); and the\nchemistry of the mobile phase (ionic strength of the sample solution, concentration of\nmobile phase). As resin bead size decreases, the surface area per unit volume increases,\nso that finer-grained resins provide more numerous exchange sites and therefore usually\nbetter separations. The organic coating on the resin beads, during manufacture, can be\naltered to provide more or fewer exchange sites per unit area; this is called the cross-\nlinkage of the resin. Higher cross-linkages (e.g., 12X) provide better separations but\ntypically broader elution peaks. Newer resins may have organic coatings whose\nstereochemistry is custom-designed to fit specific ions; the crown ether family of organic\nmolecules is particularly suited to this application. The combination of bead size and\ncross-linkage leads to a maximum exchange capacity per unit volume for each resin, and\nthe sample size that is processed must be below this maximum exchange capacity for\neffective separations.\nThe flow rate of the mobile phase is determined in large part by the resin bead size;\ncoarser resin beads have larger inter-bead spaces through which the fluid can move, and\ncapillary effects are smaller, so that coarser resins have faster fluid flow. Faster flow\nusually leads to poorer separations. In our applications, fluid flow is controlled by\ngravity feed - the mobile phase moves as fast as gravity allows. At fine resin bead sizes,\ngravity is insufficient to induce flow (capillary forces and surface tension exceed\ngravity), and pressurized columns must be used.\nUltimately, the separation of elements on an ion exchange column is a statistical process.\nIf all ions of a particular element were to behave identically, then the concentration peak\nof the element would move along the length of the column, from the injection site to the\ncollection site, essentially as a step function that is identical along the length of the\ncolumn. But because the behavior of ions in the adsorption - desorption reactions that\nproduce the separation is statistical, there is a general broadening of the elution peak\n12.119, 3/30/11: F.O. Dudas\n\nalong the length of the column. The adsorption front, where ions first encounter\nexchange sites that are available to them, is typically sharp, but the desorption front\ntypically has a long tail. This asymmetry in the shape of the concentration curve means\nthat most separations are not quantitative in the sense that, though > 99% of the ions of a\nspecific element can be captured if a large enough volume of solution is collected, that\nsolution will also contain a range of other ions with roughly similar z/r. The quality of\nthe separation - the purity of the product - can be improved by decreasing the volume of\nsolution collected, but this leads to loss of some fraction of the element of interest. In\nsome cases, different isotopes of an element can have sufficiently different D to cause\nsome fractionation of isotopes on the ion exchange column (this is likeliest with lighter\nelements that have a large mass range, e.g., calcium).\nThese general observations are illustrated by the chromatographic profiles of a couple of\nNd cut\nNew Resin, Column 7\nHf cut\nLu cut\nNd\nSm\nLu\nHf\n90 100\nmL eluted\ndifferent columns that we use for separation of Hf, Lu, Nd and Sm. The graph above\nshows the profile of an 8 cm3 cation column, with solution volume on the abscissa and a\nrough measure of concentration as the ordinate. The sample (roughly 100 mg of rock that\nhas been completely dissolved) is loaded onto the column in 3 mL of 1 M HCl. The first\n15 mL of solution that is passed through the column is 1 M HCl, and results in virtually\nquantitative removal of Hf from the resin (this is counterintuitive, considering that Hf\nshould form a small ion of high charge - +4; it is likely that Hf is present in solution as a\nlarge, low-charge cation complex, perhaps HfCl2\n2+). The 1 M HCl solution is followed\nby 45 mL of 3 M HCl, toward the end of which the heavy rare earth elements (Lu, for\n12.119, 3/30/11: F.O. Dudas\n\nexample) begin to be released from the resin. After 60 mL have passed through the\ncolumn, we change the mobile phase to 3 M HNO3 and continue the elution to a total\nvolume of about 125 mL. The reason for changing to HNO3 is that barium remains on\nthe column in HCl, and ultimately can interfere with the separation of the rare earths; in\nHNO3, however, barium is mostly eluted before the rare earths of interest (Nd and Sm)\nare collected. Both Hf and Lu show small subsidiary peaks when the solution changes\nfrom HCl to HNO3. During this separation procedure, essentially all of the major\nelements in the rock - Si, Al, Mg, Ca, Na, K, etc., - are removed in the mobile phase that\nwe send to waste.\nOur target is to separate Sm from Nd, so that each can be analyzed separately. Both Nd\nand Sm have an isotope at mass 144, and the interference of 144Sm on 144Nd is fatal to\ngood Nd isotopic analyses. After collecting the volume between 70 and 95 mL from the\ncolumn above, where there is complete overlap between Sm and Nd, we dry the solution\ndown, and re-dissolve the sample in 100 μL of 0.3 M HCl. This solution we introduce\nonto a second column that contains a different type of cation resin. On this column, we\nBa 135\nLa 139\nCe 140\nPr 141\nNd 146\nSm 147\nEu151\nGd 157\nDy 162\nmL eluted\nget good separation of Nd from Sm, but there is extensive overlap of Ce and Pr with Nd.\n142Ce is a low abundance isotope, and does not seriously impact on our analyses of\n143Nd/144Nd (the ratio of interest); Pr has only one isotope, 141Pr, that does not affect our\nNd analyses. Note that there is a long tail on the Nd and Ce elution peaks on this second\ncolumn. The rise in Ce content between 27 mL and 35 mL reflects a change in the\nmobile phase from 0.3 M HCl to 0.5 M HCl.\nFrom these graphs, you should be able to imagine that the element concentration peaks\nare migrating down the length of the column as a function of time, gradually broadening\n12.119, 3/30/11: F.O. Dudas\n\nas some ions lag behind, whereas others rush ahead, potentially as fast as the mobile\nphase is flowing through the column. These graphs and column procedures also illustrate\nhow solution concentrations and compositions are manipulated to effect separations.\nFor separation of Pb, we used anion resin in a column that has a total volume of 120 μL,\ncompared with the 8 mL cation column illustrated above; the solution volumes were also\nmuch smaller, totaling only 2.5 mL for the Pb column, compared with 125 mL for the\nbulk cation column above. This gives you an idea of the variety of geometries and resin\ntypes that can be used. In our lab, the people who separate Pb from zircons use 50 μL\ncolumns with a total solution volume of only 8 drops (less than 0.5 mL).\n12.119, 3/30/11: F.O. Dudas\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_Peat_Protocol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/352152db47fc55c40217f7a4c35c598e_MIT12_119S11_Peat_Protocol.pdf",
      "content": "PROTOCOL FOR SAMPLE TREATMENT\nLaboratory Safety: The isotope lab is used by many people, and it is the responsibility\nof each user to work in a way that is safe for themselves, safe for others, and does not\ncompromise the integrity of anybody's work. Flammable liquids are used in the lab,\nalong with a number of acids, exposure to some of which can be lethal. To protect\nyourself, it is mandatory that you wear\n1. eye protection\n2. gloves\n3. lab coat\n4. shoe covers\nwhen you are working in the lab. Additional personal protection equipment may be\nrequired for specific tasks (e.g., transfers of > 1 L of acid solutions). All procedures\ninvolving acid solutions in open containers should be performed in chemical fume hoods.\nIn all circumstances, if you are unsure of the correct procedure, ASK!\nPlease familiarize yourself with the location of fire extinguishers, safety shower, eyewash\nfacilities, spill control and cleanup kits, and HF treatment gel.\nOverview: The samples are predominantly organic. The target is to extract Pb (and, for\nsome samples, Sr) for isotopic analysis.\nWe assume Pb is bound to the sample in several different ways; some Pb is surface-\nbound (hydrogen bonds or electrostatic bonds), some is incorporated structurally in the\norganics, and some is bound into the inorganic fraction of the samples. We would like to\ndetermine the isotopic composition and relative abundance of Pb in each of these\ndifferent \"reservoirs.\"\nWe do selective extractions that help us separate the different sources of Pb, with a\nrelatively mild extraction as the initial step, and increasingly aggressive dissolutions of\nthe residues from prior steps. At each step, we will generate subsamples for isotopic\ncomposition (IC) determination and concentration measurement (isotope dilution or ID),\nas well as a residue for further treatment. The initial extraction step is with ethanol; the\nresidue from ethanol treatment is extracted with hot 1 M hydrochloric acid; the residue\nfrom hydrochloric acid treatment is extracted with aqua regia (a mixture of hydrochloric\nand nitric acids), and the residue of aqua regia treatment is fully dissolved in a mixed\nhydrofluoric acid - nitric acid solution. Thus, for each sample, we will have up to 8\nsubsamples to analyze. Because we will be working with low levels of Pb in some of\nthese samples, working cleanly is a must.\n12.119, Spring 2011: Dudas\n\nProtocol:\nA. Sample Weighing\n1. For each sample and the blank, prepare two 15 mL teflon beakers. Empty 6M HCl\nfrom clean beaker to waste jar. Label beakers (cap and body) with sample number; one\nof the two beakers for each sample should be labeled with \"R\" (residue), the other with\n\"S\" (solution). Set beakers on hot plate to dry. When beakers are dry, remove from hot\nplate, cap, and allow to cool. When cool, weigh each beaker with cap.\n2. Remove 10 15-mL centrifuge tubes from the acid bath; rinse them twice with MQ\nH2O, and shake them \"dry.\" Label tubes with sample numbers; label last tube as \"blank.\"\n3. Weigh up to 1 g of sample (0.3 - 1 g) and transfer to centrifuge tube.\nB. Ethanol Extraction\n4. To each sample, add 3 mL of ethanol. Mix the sample on the vortex mixer, then place\ninto the hot water bath for ~1 hour. During the hour, mix sample on vortex mixer every\n15 minutes.\n5. After ~ 1 hour, centrifuge the samples for 5 minutes. Pipette the ethanol solution into\nthe \"S\" beaker prepared in step 1. Cap the beaker and set it aside. To each sample, add 5\nmL hot MQ H2O. Mix on vortex mixer, and place into the hot water bath for ~ 15 min.\n6. After ~ 15 min., centrifuge the samples for 5 min. Pipette the water solution into the\nbeakers with the ethanol. When the ethanol+water solutions have cooled, weigh the\nbeakers with the ethanol+water sample.\n7. Using a minimum of MQ H2O, transfer the solid residue from the ethanol extraction\ninto the second Teflon beaker prepared in step 1. Place these samples on the hot plate to\ndry. (Go to step 11 for further treatment of residues.) Reserve the 15 mL centrifuge\ntubes for later use.\n8. For each sample, prepare a 15 mL Teflon beaker for IC and ID. Empty 6M HCl from\nclean beaker to waste jar. Label beakers with sample number followed by \"EtOH Pb IC\"\nor \"EtOH Pb ID.\"\n9. To the IC beaker, pipette 1 mL of the ethanol sample solution. Add 1 mL of\nconcentrated HNO3 (2-9-11 batch!) and place the beaker, uncapped, on the hot plate.\nNote: concentrated nitric acid can react violently with organics like ethanol. Watch the\nbeakers closely and remove from the hot plate if the reaction is too vigorous. The\npurpose of this step is to destroy the organic compounds that are in solution; these\ninterfere with ion exchange and analysis.\n12.119, Spring 2011: Dudas\n\n9a. Dry down the ethanol - nitric acid solution. When dry, add 1 mL of\nconcentrated nitric acid and dry down again.\n9b. To each sample, add 0.2 mL conc HNO3. Then add 0.1 mL 30% H2O2\n(Seastar, not Suprapur), place on hot plate, and allow to react. This reaction produces a\nlot of spatter, so samples should be well spaced on the hot plate. When the reaction has\ndied down, add another 0.1 mL aliquot of H2O2, and allow to react. Then add another 0.1\nmL aliquot of H2O2 and allow the sample to dry. The H2O2 treatment is a more\naggressive procedure for destroying organics. At the end of this step, the samples should\nbe free of organics.\n9c. When the sample is dry, add 2 mL 6M HCl. Cap the beaker and allow to\nreflux on hot plate for at least 2 hours. After ~ 2 hrs, dry the samples down. They are\nnow ready for processing through Pb ion exchange columns. The purpose of this step is\nto collect the spatter from the walls of the beaker, and to convert the sample from nitrate\nsalts to chloride form, which is necessary for the subsequent ion exchange procedure.\n10. Take the ID beakers into the weighing room. Tare each beaker, open, on the balance.\nAdd 2 drops of the 208Pb spike (kept in hood in zircon lab). Record spike weight. Seal\nspike bottle and return to zircon lab.\n10a. Tare each beaker, open, with spike. Pipette 0.1 mL of the ethanol sample\nsolution into the beaker. Record sample weight.\n10b. In the Sr lab, add 0.5 mL conc. HNO3 to each beaker. Place the beakers,\nopen, on the hot plate to dry down.\n10c. When dry, process with 30% H2O2 and the HCl conversion steps, as the IC\nsamples were processed in steps 9b and 9c above.\n11. When the residues are dry, cap the beakers, take them off the hot plate and allow\nthem to cool to room temperature. When they are cool, weigh the beakers.\nC. HCl Extraction\n12. For each sample, prepare two Teflon beakers, labeled with the sample number and\n\"HCl-S\" and \"HCl-R.\" Place the beakers on the hot plate, open, to dry. After ~ 1 hr.,\nremove the beakers, cap them and allow them to cool. When cool, weigh the beakers\nwith caps.\n13. To start the HCl extraction step, pipette 1 mL of hot 1 M HCl into the beakers and\ntransfer the samples from the Teflon beakers back to the 15 mL centrifuge tubes. Then\npipette 1 mL of hot 1 M HCl into the beaker, rinse it, and add the acid to the centrifuge\ntube. Bring the total volume of HCl to 3 mL by pipetting another mL of hot 1M HCl into\nthe centrifuge tube. Mix the sample and acid on the vortex mixer, then place the\ncentrifuge tube into the hot water bath for ~ 10 min.\n12.119, Spring 2011: Dudas\n\n14. After ~ 10 min, centrifuge the samples for 5 min. Pipette the HCl solution into the\n\"HCl-S\" beakers. Cap the beakers and set them aside. Pipette 10 mL of hot MQ H2O\ninto the centrifuge tubes. Mix the samples on the vortex mixer, and place the centrifuge\ntubes into the hot water bath for ~ 10 min.\n15. After ~ 10 min, centrifuge the samples for 5 min. Pipette the water solution into the\nTeflon beakers. Cap the beakers and allow the samples to cool. When cool, weigh the\nbeakers with the HCl solution.\n16. Using a minimum of MQ H2O, transfer the solid residue from the HCl extraction into\nthe second Teflon beaker prepared in step 12. Place these samples on the hot plate to dry.\n(Go to step 20 for further treatment of residues.) The 15 mL centrifuge tubes should be\nreserved for step 24 below.\n17. For each sample, prepare a 15 mL Teflon beaker for IC and ID. Empty 6M HCl\nfrom clean beaker to waste jar. Label beakers with sample number followed by \"HCl Pb\nIC\" or \"HCl Pb ID.\"\n18. To the IC beaker, pipette 0.5 mL of the HCl sample solution. Add 1 mL of\nconcentrated HNO3 (2-9-11 batch!) and place the beaker, uncapped, on the hot plate. The\npurpose of this step is to destroy the organic compounds that are in solution.\n18a. Dry down the HCl - nitric acid solution. When dry, add 1 mL of\nconcentrated nitric acid and dry down again.\n18b. To each sample, add 0.2 mL conc HNO3. Then add 0.1 mL 30% H2O2\n(Seastar, not Suprapur), place on hot plate, and allow to react. This reaction produces a\nlot of spatter, so samples should be well spaced on the hot plate. When the reaction has\ndied down, add another 0.1 mL aliquot of H2O2, and allow to react. Then add another 0.1\nmL aliquot of H2O2 and allow the sample to dry. The H2O2 treatment is a more\naggressive procedure for destroying organics. At the end of this step, the samples should\nbe free of organics.\n18c. When the sample is dry, add 2 mL 6M HCl. Cap the beaker and allow to\nreflux on hot plate for at least 2 hours. After ~ 2 hrs, dry the samples down. They are\nnow ready for processing through Pb ion exchange columns. The purpose of this step is\nto collect the spatter from the walls of the beaker, and to convert the sample from nitrate\nsalts to chloride form, which is necessary for the subsequent ion exchange procedure.\n19. Take the ID beakers into the weighing room. Tare each beaker, open, on the balance.\nAdd 2 drops of the 208Pb spike (kept in hood in zircon lab). Record spike weight. Seal\nspike bottle and return to zircon lab.\n19a. Tare each beaker, open, with spike. Pipette 0.1 mL of the HCl sample\nsolution into the beaker. Record sample weight.\n12.119, Spring 2011: Dudas\n\n19b. In the Sr lab, add 0.5 mL conc. HNO3 to each beaker. Place the beakers,\nopen, on the hot plate to dry down.\n19c. When dry, process with 30% H2O2 and the HCl conversion steps, as the IC\nsamples were processed in steps 18b and 18c above.\n20. When the residues are dry, cap the beakers, take them off the hot plate and allow\nthem to cool to room temperature. When they are cool, weigh the beakers.\nD. Aqua Regia Extraction\n21. All subsequent procedures will use the HCl-R beakers, because the reactions take\nlonger and because the reagents are too strong for the plastic centrifuge tubes. Prepare 40\nmL of aqua regia. To a 60 mL Teflon beaker, add 10 mL concentrated HNO3 (2-9-11).\nThen add 30 mL of concentrated HCl. Mix.\n22. Add 3 mL of aqua regia solution to each HCl residue sample (and blank). Swirl the\nbeaker to suspend the sample. Place on the hot plate, uncovered. There should be an\nactive reaction as the aqua regia begins to oxidize the organics in the sample. Monitor\nthe reaction; if it is too vigorous, remove the sample from the hot plate, and let the\nreaction settle down. It may be necessary to cycle the samples on and off the hot plate\nuntil the reaction is reasonably confined to the beaker. Then leave the samples on the hot\nplate to react and dry down.\n23. Repeat the aqua regia reaction step, after preparing fresh aqua regia: add 3 mL aqua\nregia to each sample. Cap the samples and place them on the hot plate for a minimum of\n8 hours. Remove from the hot plate and allow to cool.\n24. For each sample, prepare a 15 mL Teflon beaker. Pour the 6M HCl from the clean\nbeaker into the acid waste jar, then label the beakers with sample number and \"AR-S.\"\nWeigh the empty beakers.\n25. Carefully transfer the samples from the Teflon beakers to the 15 mL centrifuge tubes,\nreserving the beakers for use in step 27. Centrifuge the samples for ~ 5 min. Pipette the\naqua regia solution into the beakers labeled \"AR-S.\" Cap the beakers and set them aside.\n26. To each beaker, add 10 mL hot MQ H2O. Mix on a vortex mixer to suspend all of\nthe remaining solid. Place in hot water bath for 10 minutes. Centrifuge the samples for ~\n5 min. Pipette the H2O solution to the AR-S beakers. Cap the beakers and allow the\nsolutions to cool. When cool, weigh the AR-S beakers.\n27. Using a minimum of MQ H2O, transfer the remaining solid residue back into the\nbeakers used in step 25. Dry down the residues. When dry, remove from hot plate, cap\nand allow to cool. When cool, weigh the beaker+residue. Go to step 31 to treat residue.\n12.119, Spring 2011: Dudas\n\n28. For each sample, prepare a 15 mL Teflon beaker for IC and ID. Empty 6M HCl\nfrom clean beaker to waste jar. Label beakers with sample number followed by \"AR Pb\nIC\" or \"AR Pb ID.\"\n29. To the IC beaker, pipette 0.5 mL of the AR sample solution. Add 1 mL of\nconcentrated HNO3 (2-9-11 batch!) and place the beaker, uncapped, on the hot plate. The\npurpose of this step is to destroy the organic compounds that may remain in solution.\n29a. Dry down the AR - nitric acid solution.\n29b. To each sample, add 0.2 mL conc HNO3. Then add 0.1 mL 30% H2O2\n(Seastar, not Suprapur), place on hot plate, and allow to react. When the reaction has\ndied down, add another 0.1 mL aliquot of H2O2, and allow to react. Then add another 0.1\nmL aliquot of H2O2 and allow the sample to dry. At the end of this step, the samples\nshould be free of organics.\n29c. When the sample is dry, add 2 mL 6M HCl. Cap the beaker and allow to\nreflux on hot plate for at least 2 hours. After ~ 2 hrs, dry the samples down. They are\nnow ready for processing through Pb ion exchange columns.\n30. Take the ID beakers into the weighing room. Tare each beaker, open, on the balance.\nAdd 2 drops of the 208Pb spike (kept in hood in zircon lab). Record spike weight. Seal\nspike bottle and return to zircon lab.\n30a. Tare each beaker, open, with spike. Pipette 0.1 mL of the AR sample\nsolution into the beaker. Record sample weight.\n30b. In the Sr lab, add 0.5 mL conc. HNO3 to each beaker. Place the beakers,\nopen, on the hot plate to dry down.\n30c. When dry, process with 30% H2O2 and the HCl conversion steps, as the IC\nsamples were processed in steps 29b and 29c above.\nE. HF Dissolution\n31. To the residue of each sample, pipette 0.5 mL conc. HNO3, then add 3 mL conc. HF.\nCap the beakers and place them on the hot plate for a minimum of 8 hours. The purpose\nof this step is to dissolve all of the remaining residue.\n32. Remove the beakers from the hot plate. Uncap them, carefully, preserving all of the\nsolution. Place the open beakers back on the hot plate to dry down (ideally to \"wet\ndryness\").\n33. When dry, add 1 mL conc. HNO3 and allow to dry down (\"wet-dryness\"). Repeat\ntwice (i.e., 3 mL total HNO3). The purpose of this step is to break down all of the\nfluoride salts that may have formed in step 31.\n12.119, Spring 2011: Dudas\n\n34. When the samples are dry, add 3 mL 6 M HCl. Cap the samples and allow them to\nreflux on the hot plate for a minimum of 8 hours. The purpose of this step is to effect\nfinal dissolution of all solids, and to convert the sample to chloride salts.\n35. Remove samples from hot plate and allow to cool. When cool, weigh beakers.\n36. For each sample, prepare a 15 mL Teflon beaker for ID. Empty 6M HCl from clean\nbeaker to waste jar. Label beakers with sample number followed by \"HF Pb ID.\"\n37. Take the ID beakers into the weighing room. Tare each beaker, open, on the balance.\nAdd 2 drops of the 208Pb spike (kept in hood in zircon lab). Record spike weight. Seal\nspike bottle and return to zircon lab.\n37a. Tare each beaker, open, with spike. Pipette 0.1 mL of the HF sample\nsolution into the beaker. Record sample weight. Make sure that all of the spike is mixed\nwith all of the sample solution.\n37b. In the Sr lab, place the beakers, open, on the hot plate to dry down. When\ndry, these samples are ready for ion exchange chemistry.\n38. Relabel the beakers with the remaining solution with sample number and \"HF IC.\"\nPlace the beakers, uncapped, on the hot plate to dry down. When dry, these samples are\nready for ion exchange chemistry.\n12.119, Spring 2011: Dudas\n\nF. Pb Ion Exchange Chemistry\n39. To each sample (products of steps 9c, 10c, 18c, 19c, 29c, 30c, 37b, and 38), add 0.5\nmL 1.1 M HBr. Allow the samples to sit overnight at room temperature.\n40. For each sample (IC and ID separately), prepare a Pb ion exchange column. Rinse\nthe column with MQ H2O multiple times, then add ~ 1 mL of AG1-X8 anion exchange\nresin suspension to each column and allow it to settle. When the resin is settled, adjust\nthe resin height in the column by pipetting the excess resin to waste. Allow the columns\nto drain.\n41. Cleaning the resin: Sequentially, add 1 mL 6 M HCl, 1 mL 0.1 M HCl, and 1 mL 6\nM HCl to each column, allowing the acid to drain from the column before adding the\nnext aliquot. Capture all acid from the columns in waste containers.\n42. Conditioning the resin: To each column, add 0.5 mL 1.1 M HBr, and allow it to\ndrain.\n43. Loading the sample: To each column, add the 0.5 mL 1.1 HBr solution containing\nthe sample (use a clean pipette tip for each sample!). IF the sample contains undissolved\nsolids, transfer the sample to a 1.5 mL centrifuge tube and centrifuge for ~ 5 min, then\nload the solution, only, onto the ion exchange column. Once the sample beakers are\nempty, add 2 mL 6 M HCl to each beaker, cap it and place it on the hot plate to reflux\nuntil it is needed in step 47.\n44. Drop Rinse: Add 1 drop of 1.1 M HBr to each column and let it drain. Repeat until\nyou have added a total of 5 drops HBr.\n45. Bulk Rinse: Add 0.5 mL 1.1 M HBr to each column and let it drain.\n46. Bulk Rinse: Add 0.5 mL 2 M HCl to each column and let it drain.\n47. Remove waste containers from under columns, and empty them to the acid waste jar.\nThen, pour the 6 M HCl from the sample beakers into the waste jar and place the beakers\nunder the respective columns to begin collecting the Pb solution. To each column, add 1\nmL of 6 M HCl, and allow it to drain.\n48. When the 6 M HCl solution is completely drained from the column, remove the\nbeakers from under the columns, add 1 drop of 0.1 M H3PO4 and place the beakers on the\nhot plate to dry. When dry, these samples are ready for mass spectrometry.\n12.119, Spring 2011: Dudas\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Anthropogenic Geochemistry",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/9ee43ae2f81214f882dc4e3459752e60_MIT12_119S11_anthropogenic.pdf",
      "content": "t\nAnthropogenic\nGeochhemiistry\n(1) Local - Regional - Global scale emissions\n(2) Types of emissions:\n( )\nyp\n- solid waste\n- liquid waste\nliquid waste\n- acid mine drainage\n- volatile emissions\n- fine particle emissions to the atmospphere\n- \"natural pollution\",\ne g arsenic in Bangladesh well\ne.g. arsenic in Bangladesh well\nwaters.\n\n-\nAnthropogenic geochemistry\n3) Regional and global scale anthropogenic emissions.\nsome elements of particular interest:\nsome elements of particular interest:\n- Lead (Pb): globally the most anthropogenically\nLead (Pb): globally, the most anthropogenically\nenhanced element; emitted to the atmosphere by high\ntemperature industrial processes ((smelting, coal\np\ng,\ncombustion, etc.) and by automobiles using leaded\ngasoline.\n- Mercury (Hg): one of the most volatile toxic\nelements; emitted from high temperature industrial\nactivities (similar to lead); exists in toxic organic mercury\ncompounds Also used in industrial processing and gold\ncompounds. Also used in industrial processing and gold\nmining, released into natural waters. Mercury is high in\nfish in lakes located downwind of coal combustion\nregions. It bioaccumulates in predatory fish such as\nsalmon and swordfish.\n\nAnthropogenic geochemistry\nHg,\ng, continued: \"Minamata Bay Disease\" from industrial mercury\nrelease into a fished harbor is one of the most infamous\npollution episodes. Minamata is a small town in Japan facing an\nocean embayment From 1932 to 1968 a company dumped\nocean embayment. From 1932 to 1968, a company dumped\napproximately 27 tons of mercury compounds into the bay.\nThousands of p\np\neople who ate fish from the bayy developped\nsymptoms of methyl mercury poisoning.\n- Cadmium (Cd): also volatile and used in industrial\nactivities (Ni-Cd batteries; Cd-plated metals, etc.). \"Itai-Itai\"\ndisease is perhaps the second most infamous pollution\ndisease is perhaps the second most infamous pollution\nepisodes. In the early years of the 20th century, villagers along\nthe Jinzu River basin in Japan developed a painful disease that\nwas dubbed \"Itai-Itai\" (\"it hurts, it hurts\"). Research didn't begin\nuntil the 1950s when and in May 1968 it was determined that it\nwas due to chronic cadmium poisoning caused by commercial\nwas due to chronic cadmium poisoning caused by commercial\nmining operations. It impairs kidney function and leads to\ncalcium deficiency and brittle bones.\n\no\nc\neta\nou d\nds e e\ne\nda\ne ous\n\"\nCd in toys\nToxic metal found in kids' je\nj welryy very dangerous\ny\ng\nBy JUSTIN PRITCHARD\nThe Associated Press\nSunday, Januaryy 10, 2010;; 2:26 PM\ny,\n,\n-- Cadmium is a soft, whitish metal that occurs naturally in soil. It's perhaps best known as one half of rechargeable\nnickel-cadmium batteries, but also is used in pigments, electroplating and plastic.\nLab testing organized by The Associated Press shows that it also is present in children's jewelry - sometimes at eye\npopping llevels exceediding 90\n90 percentt of the ititem''s t t l\ntotal weight.\nl\nf th\ni ht\nMost people get a microscopic dose of the heavy metal just by breathing and eating. Plants, including tobacco, take up\ncadmium through their roots and people absorb it during digestion or inhalation. Without direct exposure, however,\npeople usually don't experience its nasty side: cancer, kidneys that leak vital protein, bones that spontaneously snap.\nC d\ni\ni\nti\nl\nl d\nf\nhild\nb\ni\nb di\ndil\nb\nb\nb t\nd\nd\ni\nCadmium is particularly dangerous for children because growing bodies readily absorb substances, and cadmium\naccumulates in the kidneys for decades.\n\"Just small amounts of chemicals may radically alter development,\" said Dr. Robert O. Wright, a professor at Harvard\nUniversity's medical school and school of public health. \"I can't even fathom why anyone would allow for even a small\namount to be accessible \"\namount to be accessible.\nRecent research by Wright found that as cadmium exposure increased, kids were more likely to report learning\ndisabilities.\nDr. Aimin Chen of the University of Cincinnati's medical school also has studied how cadmium affects young brains.\nWhil\nWhile llead is th\nthe hheavy mettall mostt associattedd with h\nith harming cognitiitive ddevellopment, Ch\nChen has conclluded th\nd that caddmium\nd i\ni\ni\nt\nh\nd\nt\ni\nlowers IQ even more than lead - though cadmium isn't harming the average American child because the typical\nexposure is not as large as lead.\nScientists don't know how much cadmium it takes to kill a child. The only child's death attributed to cadmium that AP\nfound was a nearly 3 year old boy from Toronto According to a case study published in 1994 an autopsy showed his\nfound was a nearly 3-year-old boy from Toronto. According to a case study published in 1994, an autopsy showed his\nbrain had swollen; the researchers concluded his exposure came from items around his home such as paint pigments,\nbatteries or cadmium-electroplated utensils.\n\nAnthropogenic Geochemistry\n- Nitrogen - as NO3\n-, usually from fertilizers. Too much nitrate in waters\ndamages infant's brain development. It also can lead to \"eutrophication\" of\ncoastal seawaters (e.g. Gulf of Mexico \"dead zone\").\n- Phosphorus - as PO4\n3- usually from fertilizers now (although also from\ndetergents in the past). Can lead to \"eutrophication\" of lakes and rivers.\n- Selenium - Human selenosis at the population level is rare and is generally\nrelated to excesses from food rather than from drinking water. It has been\nreported from China and Venezuela where selenium-rich food is grown and\nreported from China and Venezuela where selenium rich food is grown and\nconsumed locally (Tan, 1989; WHO, 1996). Cancers of the skin and\npancreas have been attributed to high selenium intake (Vinceti et al., 1998).\nSelenium sulfide is used in antidandruff shampoos and is ppotentiallyy\ncarcinogenic but is not absorbed through the skin unless there are lesions\n(WHO, 1987). Selenium toxicity can lead to hair and nail loss and disruption\nof the nervous and digestive systems in humans and to alkali disease in\nanimals. Chronic selenosis in animals is not common but has been reported\nfrom parts of Australia, China, Ireland, Israel, Russia, South Africa, USA,\nand Venezuela (Oldfield, 1999). Liver damage is a feature of chronic\nselenosis in animals (WHO, 1987). Source: Plant, J. A., Kinniburgh, D. G., Smedley, P.\nL., Fordyce, F. M. & Klinck, B. A. in Treatise on Geochemistry Vol. 9 (eds. Holland, H. D. & Turekian,\nK. K.) (Elsevier, Amsterdam, 2004).\n\nate\nas ta e\no\nbot\nsu ace\nate a d\ne e e a d\nKesterson Reservoir, Central California\nOne of the best-documented cases of selenium toxicity in animals occurred at Kesterson Reser\nvoir, California, USA (Jacobs, 1989; Wu et al., 2000). Soil irrigation in the western San Joaquin\nValley of California began in the late 1800s and accelerated, particularly in the 1930s - 1940s.\nIrrigation water was taken from both surface water and groundwater (Deverel and\nuj\nFujii,\n988)\n1988).\ngat o\ng ou d ate (\nDuring the 1970s, flow into the reservoir was mainly surface water, but over the period 1981 -\n1986 almost all the inflow was from shallow agricultural drainage for which the reservoir acted as\na set of evaporation ponds. This inflow contained 250 - 350 mg L selenium, mostly present as\nbioavailable selenate (Se(VI)). The primary source of the selenium is believed to have been\npyrite in shales, particularly the Upper Cretaceous - Paleocene Moreno Shale and the Eocene -\nOligocene Kreyenhagen Shale. Concentrations of selenium in these formations range up to 45\nmg kg, median concentrations being 6.5 mg kg and 8.7 mg kg, respectively (Presser, 1994). The\nconcentration of selenium in the surface sediments (0 - 0.3 m depth) of the old playas is in the\nrange 1\n20 mg kg reflecting the historical accumulation of selenium from the selenium rich\nrange 1 - 20 mg kg reflecting the historical accumulation of selenium from the selenium-rich\ndrain water. Deeper sediments typically contain much lower selenium concentrations of 0.1 - 1\nmg kg (Tokunaga et al., 1994). Between 1983 and 1985, the USA Wildlife Service compared the\nbiological impact of the high selenium in the Kesterson Reservoir region to that of the adjacent\nVolta Wildlife area, which was supplied with water containing normal selenium concentrations.\nVolta Wildlife area, which was supplied with water containing normal selenium concentrations.\nThe research showed that the high concentrations of selenium in the irrigation waters were\nhaving a detrimental effect on the health of fish and wildlife (Tokunaga et al., 1994). Health\neffects on birds in the Kesterson Reservoir area were very marked. Twenty-two percent of the\neggs contained dead or deformed embryos. The developmental deformities included missing or\nabnormal eyes, beaks, wings, legs, and feet as well as hydrocephaly. It has been estimated that\nat least 1,000 adult and young birds died between 1983 and 1985 as a result of consuming\nplants and fish containing 12 - 120 times the normal amount of selenium. No overt adverse\nhealth effects were noted in reptile or mammalian species, but the concentrations of selenium\npresent were of concern in terms of bioaccumulation through the food chain.\npresent were of concern in terms of bioaccumulation through the food chain\n-\nSource: Plant, J. A., Kinniburgh, D. G., Smedley, P. L., Fordyce, F. M. & Klinck, B. A. in Treatise\non Geochemistry Vol. 9 (eds. Holland, H. D. & Turekian, K. K.) (Elsevier, Amsterdam, 2004).\n\nAcid Mine Drainage\n- Pyrite oxidation:\nPyrite oxidation:\n=\n2 FeS2 + 15/2 O2 + 4 H2O --> Fe2O3 + 4 SO4 + 8 H+\n- Sulfide ores are common sources of Fe, Zn, Cd, and H2SO4. Coal\ndeposits often contain sulfide minerals so acid mine drainage\ndeposits often contain sulfide minerals, so acid mine drainage\ncommonly affects both sulfide ore and coal tailings (the waste leftover\nafter mining).\n- Acidic waters are in themselves damaging to organisms (e.g. fish do\nnot live in low-pH waters, perhaps because of enhanced aluminum\nsolubility at low pH) The low pH can also mobilize toxic trace metals\nsolubility at low pH). The low pH can also mobilize toxic trace metals\nsuch as Cd, As, and Pb.\n- Example: Rio Tinto mining complex (Spain): drains into pH ~ 2 rivers\nthat enter the Atlantic coastal waters of southern Spain having more\nthan a millionfold more Zn than normal ocean surface waters, along\nith\nth\nt l\nh\nPb Cd\nd A\nThi\nffl\nt\nb\nt\nd\nwith other metals such as Pb, Cd, and As. This effluent can be traced\ninto the Mediterranean Sea.\n\nRio Tinto picture\n\nRio Tinto Pb\npollution\n\nThe Global Anthropogenic Lead\nExperiment\nExperiment\n- Lead is a volatile element and it is emitted by\nLead is a volatile element and it is emitted by\nhigh temperature industrial activities\n(smelting coal combustion incineration\n(smelting, coal combustion, incineration,\ncement manufacture).\n- Leaded gasoline utilization creates fine\nLeaded gasoline utilization creates fine\nparticles that the atmosphere transports to\nremote regions of the world.\n- Most of the lead in the present ocean derives\nfrom human activities.\n- Changes in the patterns of industrial and\ngasoline Pb emissions have led to time-\ndependent changes for oceanic lead during\nthe past 180 years.\n\nt\n--------------------------\nAnthropogenic Pb - how we use Pb\nand release it into the environment\nand release it into the environment\n- Automobile batteries\n- Solder - electronics and pipe sealing\n- Cathode ray tubes\n- PVC stabilizer\n- Wine bottle seals\n- High temperature industrial activities\n(smelting, coal burning, etc.)\n- I\ni\nIncineratiion\n- \"Tin\" can solder seams\n\"Tin \" can solder seams\n- Gasoline anti-knock compound\n- House paint\n- House paint\n- Water pipes\n\nHealth effects of lead\n- Pb++ interferes with Ca\ninterferes with Ca++\n++ biochemistry\nPb++\nbiochemistry.\n- Ca++ is used extensively in intra- and inter-cellular\nelectrical messaging\nelectrical messaging.\n- At high levels, Pb causes extreme and permanent\nmental and physical damage.\nmental and physical damage.\n- Damage to workers at tetraethyl Pb plant gave it the\nmoniker \"looney gas\" (1924,, Baywayy New Jersey:\n80% of staff die or suffer severe Pb poisoning).\n- A study of the achievement, behavior, and baby tooth\nPb content of children in Somerville MA (Needleman\net al. 1979) showed a strong (negative) correlation\nbetween Pb and behavioral indices with no evidence\nbetween Pb and behavioral indices with no evidence\nof a threshold.\n- Subsequent detailed medical and biochemical studies\nSubsequent detailed medical and biochemical studies\nhave elucidated the pathways of Pb's effects on\nhumans.\n\nClair Patterson and Lead\nClair Patterson and Lead\n\nPb in Camp Century Greenland Ice Core\nPb\n(μg/kg)\nAge (yr A.D.)\n\nt\nPb in the human environment according to Patterson:\n- Some off thhe uses of lf lead have iincreased Pb in aiir, ffoodd\nd h\nd Pb i\nand water by orders of magnitude above prehistoric levels.\n- Pb in ancient Peruvian bones is orders of magnitude lower\nPb in ancient Peruvian bones is orders of magnitude lower\nthan those of modern humans.\n- Pb\nPb in (lead soldered) canned tuna fish is 10 000 times\nin (lead soldered) canned tuna fish is 10,000 times\nhigher than tuna when they are caught.\n- Modern nearshore marine sediments show much higher\nPb concentrations than those deposited 100's of years ago.\n- Leaded gasoline and high temperature industrial activities\nhave spread l\nd lead t\nd to remotte regiions. HHuman actitivitiities hhave\nincreased the flux of lead into the earth surface\nenvironment by more than a factor of ten.\nenvironment by more than a factor of ten.\n- The typical individual in the U.S. in the middle of the 20th\ncentury was within an order of magnitude of demonstrated\ntoxic levels.\n\nPb in the human environment\naccording to the lead industry:\n- Lead isn't a problem (except maybe at very extreme\nLead isn t a problem (except maybe at very extreme\nexposures).\n- Patterson's data are wrong: Pb in food and water isn't\nPatterson s data are wrong: Pb in food and water isn t\nany different than it was in pre-industrial times.\n- Volcanoes and other natural sources emit plentyy of\nlead. How could humans emit more than they do?\n- Even if it is a problem, it isn't our fault.\n- Can you prove it was my lead that caused your\nproblem?\n\n-\nt\nt\nOther Pb industry responses to Patterson:\n- Representatives of the Ethyl corporation\nRepresentatives of the Ethyl corporation, inin\nPatterson's words, tried to \"buy me out through\nresearch support that would yyield results favorable to\npp\ntheir cause.\"\n- Instead of joining forces with Ethyl, Patterson\ndeliliveredd a llecture assailiiling th\nthe company''s actiivitiities\nand predicting the demise of their TEL operation.\nFollowing these events his longstanding contract\n- Following these events, his longstanding contract\nwith the Public Health Service was not renewed, nor\nwas a substantial contract with the American\nwas a substantial contract with the American\nPetroleum Institute.\n- Members of the board of trustees at Cal Tech leaned\non the chairman of his department to fire him. Others\nhave alleged that Ethyl offered to endow a chair at\nCal Tech if Patterson was sent packing\nCal Tech if Patterson was sent packing.\n(J. Kitman, The Nation, March 20,\n2000)\n\n-\nPb in lunch boxes\nAugust 31, 2005\nA Back to School Warning: Children's Vinyl Lunch Boxes Can Contain\nA Back to School Warning: Children s Vinyl Lunch Boxes Can Contain\nDangerous Levels of Lead\nOakland CA - The Center for Environmental Health (CEH) announced it is filing\nOakland, CA\nThe Center for Environmental Health (CEH) announced it is filing\nlawsuits today against makers and retailers of soft vinyl lunch boxes that can expose\nchildren to harmful levels of lead. The Center has also notified several other companies\nof violations under California's toxics law Proposition 65 ((Propp 65)) for lunch boxes with\nhigh lead levels. The lawsuits and violation notices against companies including Toys\n\"R\" Us, Warner Brothers, DC Comics, Time Warner, Walgreens, and others involve\nmany lunch boxes featuring beloved children's characters including Superman, Tweety\nff G\nf\nBird, Powerpuff Girls, and Hamtaro. The level of lead in one lunch box, an Angela\nAnaconda box made by Targus International, tested at 56,400 parts per million (ppm)\nof lead, more than 90 times the 600 ppm legal limit for lead in paint in children's\nproducts\nproducts.\nIn most cases, the highest lead levels were found in the lining of lunch boxes, where lead could come into\ndirect contact with food. Lead is known to be harmful to children even in minute amounts, as it can imppair\nbrain development and cause other behavioral and developmental problems. Children may be exposed to\nlead from lunch boxes when they eat food that has been stored in them. Handling the lunchboxes just\nbefore eating could also be an exposure risk.\nIt is not possible to tell by appearance whether a vinyl lunch box may contain lead, so CEH is advising\nparents to avoid vinyl lunch boxes altogether.\n\nThis image has been removed due to copyright restrictions.\nFigure 2. Flegal et al., 1983\n\nCourtesy Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\n\nGlobal gas and Pb gas consumption, 1992\nThis image has been removed due to copyright restrictions.\nPlease see the pie charts showing global gas and Pb gas consumption in 1992.\nThomas, V. M. \"The Elimination of Lead in Gasoline.\" Ann Rev Energy Environ 20 (1995): 301-24.\n\nSurface Water Pb in the Western North Atlantic is still decreasing!\n\nMeridional Pb section in the Western North Atlantic (2002, 2005)\nNorth\nSouth\nPb\nPb,\npmol/kg\nODV graphics\n\nPb in the\nIndian\nOcean,\n\nImage courtesy of NOAA.\n\nx-ray imagge of a coral core slab\n\nb s\n\n-\nPb isotopes\notopes\n- 238U =>\n206Pb\n(24.1%)\n235U\n=>\nU\n=>\n\n207Pb\nPb\n(22.1%)\n- 232Th =>\n208Pb\n(52 4%)\n(52.4%)\n- Solar nebula => 204Pb (\n1.4%)\n-\n\nLima et al. (2005)\n\nAnthropogenic\nLead deposition in\np\nthe Northeast U.S.\n(past 250 years)\nPettaquamscutt\nEstuary Rhode\n(p\ny\n)\nEstuary, Rhode\nIsland, USA (near URI\nGraduate School of\nGraduate School of\nOceanography): a\npermanently anoxic\nestuary with varved\nsediments\n(established by 137Cs\n(established by 137Cs,\n14C, and 210Pb: Lima,\nKing, et al., Geochim.\nKing, et al., Geochim.\nCosmochim. Acta .)\nLima et al. (2005)\n\nThe Upper Mississippi Valley District\ndominated lead mining in the middle of the\n19th century, because the ores were near the\nf\nil\nd b 1 2\nsurface, were easily processed by 1-2 person\noperations (charcoal kilns), and were near\nappropriate transportation (Mississippi River\nappropriate transportation (Mississippi River\nsystem).\n\nPrevailing winds\nPrevailing winds\n\nt\nt\nPettaquamscut\nt, Saanich Pb\nisotope\nrecords, 1800\nN t\nNote thhe very rapid decrease iin 206Pb/207Pb at\n-\nid d\n206Pb/207Pb\n1909. What caused this event?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_ICPMS.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/8c12f60ef993a9dfd062bd738bb4e9e0_MIT12_119S11_ICPMS.pdf",
      "content": "12.119 Geochemical Analysis of Environmental Materials Spring 2011\nInductively Coupled Plasma: Emission and Mass Spectrometry\nI. Overview of ICPMS technology\nII. Inductively coupled plasma: ~1 liter per minute of Ar gas flows through a copper coil\n(~3-5 turns, ~1\" diameter, cooled by internal water flow) connected to a 1-2 kilowatt\nradiofrequency generator. The slower central Ar flow is sheathed by a stronger outer\nflow (~10 liters/min) . The slower-moving Ar gas becomes inductively coupled to the\nradiofrequency energy (the moving electrons and nuclei are ripped apart in opposite\ndirections by the magnetic field resulting in the formation of a plasma (a \"gas\" of\nelectrons and positively charged argon ions). This plasma has a very high temperature -\ndependent on conditions and sometimes hard to define by conventional measures - but it\nis on the order of 5,000-10,000 degrees Kelvin. The plasma emits an intense light rich\nin ultra-violet that cannot be viewed without special eye protection (e.g. welding hood).\nA. This plasma is capable of ionizing almost all elements with high efficiency - most\nelements are >90% ionized although a few unusually stable atoms with higher\nionization potentials (e.g. Zn, Cd) are somewhat less efficiently ionized. The\nsamples must be injected into the plasma as a gas, mist or very fine particles\n( <~10 μm).\nB. As the ions jump back to their ground state, they emit photons of characteristic\nwavelengths. Observation of these photons through a spectrophotometer is the basis\nof ICP-OES: inductively coupled plasma optical emission spectroscopy. This\nmethod is less prone (but not immune) to interferences than lower-temperature flame\nemission methods, and the high degree of ionization leads to many photons per\ngiven number of atoms - hence it is a relatively sensitive method (depending on the\nelement, detection limits typically fall somewhere between flame AAS and graphite\nfurnace AAS (certain new ICP-OES instruments view a larger portion of the plasma\nand claim near-GFAAS detection limits, but this benefit comes with increased\n\ninterferences as cooler portions of the plasma are viewed). Certain elements (usually\nthe more refractory elements) are analyzed much more easily by ICP-OES than the\nother methods, and multi-element analysis is easy by multiple detectors or\nwavelength scanning.\nIII. Quadrupole ICPMS: Inductively coupled plasma mass spectrometry.\nA. In the late 1970's, Gray and Date in Britain and Houk in the U.S. conceived of using\nthe ICP as an ion source for mass spectrometry. The principle problem is in\ntransferring ions at atmospheric pressure (necessary to maintain a sufficient atom\ndensity for efficient sample ionization) into a mass spectrometer that must operate at\nlow pressure. They solved this problem by using a dual-\"pinhole\" inlet system with\nmassive vacuum pumps to allow some of the sample to go into the high vacuum at\ngreatly reduced pressure. They used a quadrupole mass spectrometer (which is more\ntolerant of higher pressures than magnetic sector instruments, and has the additional\nbenefit of allowing for millisecond scans over 0-250 amu).\n\nThe beam is then further focused and accelerated by slits and electrostatic\noptics.\nOne problem is of secondary discharges between the plasma and the\n(grounded) sampling cone. Various strategies are used to minimize these,\nincluding capacitive balancing of the RF generator.\nPlasma shield: a grounded metallic strip that is sometimes placed between\nthe RF load coils and the torch; it appears that this minimizes the \"energy\nspread\" of the ions in the plasma.\nB. Plasma \"torch\"\n1. Gases flow into concentric quartz cylinders. The \"cool gas\" (or sheath) is flowing so fast\nthat insignificant coupling occurs between it and the RF magnetic field. The\nintermediate and nebulizer gases move more slowly, couple with the RF magnetic field,\nand heat up to form the plasma.\n2. At some point in the plasma, the sample is optimally ionized; this is the point at which\nyou want the plasma to impinge upon the sample cone.\nC. Quadrupole mass filters\n1. Unlike conventional magnetic-sector instruments, which in effect form a mass\nspectrum by viewing the magnetically-produced image of a slit (much as a prism\nor grating makes an optical spectrum of the image of a slit), quadrupole mass\nspectrometers are mass filters in that they do not form an image but rather simply\n\nact as a filter which allows a certain range of masses to pass through. One pair of\npoles serves as a low-mass filter, the other serves as a high-mass filter.\nQuadrupole mass filter, end view:\n2. Imagine a beam of positive ions traveling between two poles which are positively\ncharged. If an ion has a trajectory which carries it away from the enter, electric\nrepulsion forces it back towards the center. Hence positively charged poles tend\nto have a focusing effect, keeping ions on beam.\n3. Imagine a beam of positive ions traveling between two poles that are negatively\ncharged. If an ion strays from the center, the electric attraction pulls it further\naway from the center until the ion hits a pole and is discharged. Hence negatively\ncharged poles tend to have a defocusing effect, removing ions from the beam.\n4. Now image an alternating (AC) voltage on the poles. Depending on the voltage,\nfrequency, and ionic mass, charge and velocity, the ions are alternately either\ndefocused and focused:\n\n5. Suppose on one pair of rods an AC voltage is combined with a small positive bias.\nIf the mass of the ion is large, or the frequency of the AC is high, then the ion\nwill tend to feel the effect of the average (DC) field. If the mass of the ion is\nlight, then it will experience rather large swings which bring it into contact with\nthe electrodes. Hence a pair of rods with an alternating current will tend to serve\nas a high-pass filter, trapping the light ions and letting heavy ions through:\n6. Suppose on the other pair of rods, an AC voltage is combined with a small\nnegative bias. The heavy ions will tend to feel the effect of the average and be\ndefocused and lost. The light ions will be restored to the beam by the positive\nphases of the AC field. Hence this pair of rods will act as a low-pass filter:\n\nThis works as if you had a ball traveling through space on a saddle surface with\noscillating peaks and valleys :\n\n\"ion surfing\"\n7. The net result of both pairs of poles is to serve as a narrow-range filter.\n8. Because the electrostatic field can be changed rapidly, the parameters of the DC\nand AC fields on the poles can be changed rapidly to alter the position of the\n\nmass notch. Hence a quadrupole mass spectrometer can rapidly (~ 1 millisecond)\nscan the entire mass range (1-250 amu).\n9. In order to maximize time spent on ions of interest, this analyzer can be operated\nin \"peak jumping\" mode where you rapidly change the m/e value from one\nelement to the next. You have to wait a short time (fractions of a millisecond) for\nthe mass to \"settle\", take a quick measurement, then move to the next element\nwith little time lost measuring between peaks.\n10. Mass resolution on a quadrupole mass spectrometer is a little bit better than 1\namu. Because the system acts as a filter rather than an imaging device, the peaks\nare not flat-topped. Quadrupole mass spectrometers also do not have constant\ntransmission across the mass range; sensitivity can vary by as much as 1% per\namu at high masses.\nD. Detection: the usual detection device is the electron multiplier (or a variant referred\nto as a discrete dynode), which is similar to a photomultiplier except that the photo\nsensitive surface is not required; instead, the electron cascade is stimulated by an\nimpinging ion. This may be operated in pulse mode (counting of pulses due to single\nion impacts) or in analog mode (measurement of steady current resulting from\nmultiple impacts). Some instruments use a \"Daly\" detector, which uses a high\nnegative voltage (~30kV) to impact the ions onto a metal knob, releasing a few\nelectrons that are then accelerated away to impact onto a scintillating crystal, with\nthe light pulses counted by a photomultiplier outside of the vacuum system. This\ndetector has the advantage that the detector is not degraded by the impacts, so it has\na long and trouble-free life and a relatively stable efficiency (~95%). Both types of\ndetectors can only tolerate a maximum of ~106 cps, so they usually have circuits that\n\"trip out\" when count rates exceed that maximum.\nE. Dissolved solids limitation: if a high concentration of dissolved solids is in the\nsample, the nebulizer will form salts at the tip and clog; in general, dissolved solids\nmust be <0.1% for most nebulizers. Even at ~0.1%, the dissolved solids will\ncondense on the sampling and skimmer cones, eventually plugging up the interface,\nso only limited runs are possible at ~0.1% dissolved solids.\nF. Ion transmission in an ICPMS: from the sublime to the ridiculous:\ncps = [Concentration of atoms] * rliquid flow * fnebulized * fionized * finterface *\nftransmitted\n1. A typical ICPMS nebulizer delivers only about 1% of the sample as a fine spray to\nthe plasma. Other sample introduction devices can be more efficient -\nmicroconcentric nebulizers (~10%), desolvating nebulizers (~50%),\nelectrothermal vaporization (~50%)(i.e., graphite furnace as a source of atoms)\nlaser ablation (~50%), hydride generation (~100%).\n2. Once the atoms are delivered to the plasma, most of them are ionized. Some\nelements (e.g. Zn, Cd) are less efficiently ionized. For some elements 1-30% can\nbe further lost to double ionization (e.g. Ba++) or oxides (e.g. Ce0+, UO+)\n\n3. Typically about 0.1-10% of the ions in the plasma pass through the skimmer cone\nand 10-90% of these ions become part of the ion beam (depends on\nconfiguration).\n5. The quadrupole mass spectrometer itself has a transmission efficiency on the\norder of 10% of the ions which enter it.\n6. The electron multiplier counts (almost) every atom that exits the quadrupole.\n7. Overall, therefore, in a quadrupole ICPMS system using a conventional concentric\nglass nebulizer system, about only 1 out of every 1-10 million atoms in the\nsample arrives at the detector! The principle points of improvement are in sample\nintroduction (with little further progress possible, perhaps a factor of 3 at most\nfrom the most efficient sources) and ion transmission in the interface (possibly\norders of magnitude). During the past 10 years, maximum transmission has been\nimproved by a factor of 100.\n8. The detection limit is partially determined by the background count rate: the count\nrate observed when you are parked on a mass with no isotopes or polyatomics, or\nat half-mass next to low-count rate peaks when the resolution is sufficient.\nBecause the quadrupole has a linear flight path, photons coming in from the\nplasma, or generated within the ion beam by electrons dropping to ground state,\nare counted as if they are ions - but they are not selected against by the QMS.\nThis background can be minimized to some extent by bending the ion beam\naround a \"photon stop\" (a circular barrier in the ion path that photons crash into\nbut ions are bent around), or by electrostatically bending the ion beam before it\nenters the detector.\nG. Isobaric interferences in ICPMS\n1. Because quadrupole mass resolution is a little bit better than 1 amu, any element\nhaving a m/e value within 0.5 amu of the isotope of the element of interest will\ninterfere. In many cases, you can avoid these inter-elemental isobaric\ninterferences by using a different isotope of the element you are interested in, or\nby measuring another isotope of the interfering element and subtracting from the\nmass of interest on the basis of the known isotope ratio of the interfering element.\nAlternatively, by using a high-resolution magnetic sector instrument, you can\nresolve some interferences (see later)\n2. In addition to elements in the sample, elements in the solvent (often a mineral acid\nsuch as HNO3, HCl, H2SO4, H3PO4) and plasma gas (Ar with impurities C, N, O,\nNe, Kr, Xe,...) can interfere.\n3. The elements in the sample and plasma gas can combine to form interfering\npolyatomic molecular species which form when the ion beam is cooling in the\nvacuum interface, e.g.:\nAr2\n+ (mainly mass 80 but also at 76 and 78) ArCl+ (mainly masses 75 and 77);\nArO+ (mainly mass 56); POH+ (mainly mass 48), ClO+ (mainly 53, 55), ClOH+\n(mainly masses 54 and 56), ArN+ (mainly mass 54), ArCl+ (mainly masses 75 and\n\n77), NaAr, MgAr+ and many other bizarre, non-intuitive species. Note that minor\nisotope interferences also exist: e.g. 36Ar14N+ and 40Ar18O+). Nitric acid is often\nconsidered the \"preferred\" ICPMS acid because it has the fewest polyatomic\ninterferences (but it is obviously not desirable for 54Fe/56Fe isotope measurements\nbecause of 40Ar14N+)\n4. Molecular interferences can be minimized using a hexapole collision cell (or\nquadrupole or hexapole reaction cells): a hexapole confining cell just downstream\nof the skimmer cone can allow a \"collision gas\" to interact with the ion beam at\nhigher pressures \"... thus reducing the ion energy spread of the ions as they\nemerge from the skimmer, and breaking up molecular species before they reach\nthe mass analyzer. As a result, a mass spectrum free from argon interferences is\nachieved, which in turn allows much lower detection limits for what would\notherwise have been 'difficult' elements.\" (quote from Micromass product literature)\nExample: 40Ar16O+ is minimized with collisions with Ar gas, and additions of H2\ncollision gas can eliminate it entirely when residual ArO+ is convered to ArOH+)\n5. \"Abundance sensitivity\": if a very small peak (e.g. 234U) occurs near a very large\npeak (e.g. 235U), the larger peak will \"tail\" into the larger peak, largely because\nof ions that are scattered by gas molecules (although some may instead bounce\noff the walls). This tail will give a false high signal on the smaller peak.\nQuadrupole mass spectrometers have very good abundance sensitivity, but\nmagnetic sector mass spectrometers are poorer at high masses. One strategy for\nminimizing this problem is the \"WARP\" filter (wide angle retarding potential),\nwhich takes the \"higher angle, lower-energy\" ions out of the ion path.\nH. Other interferences in ICPMS\n1. Although ionization is high (>90% for many elements), it is not complete and\nsome inter-element ionization interferences can occur.\n2. Interface transmission interferences\na. In addition to factors that influence ionization, mass-dependent interferences\noccur via factors influencing the transmission of elements into the ion beam.\nb. Space-charge effects: the beam of positively charged ions suffers from mutual\nrepulsion. Light elements with less momentum are lost laterally more rapidly\nthan heavier elements; this factor contributes to a generally lower sensitivity\nfor light elements compared to heavy elements, and accounts for several inter-\nelement interferences (e.g., a solution containing high concentrations of\nuranium depresses the sensitivity for lithium).\nc. A high concentration of ions in the beam can lead to \"space charge effects\" (a\nresult of the total positive charge of an bit of space inside of the vacuum\nsystem). Most of the ions in the plasma are Ar+ ions, which are an inevitable\nproduct of an Ar plasma. Mass charge effects lead to the preferential loss of\nlight ions (which can leave the space more rapidly than the heavy ions). This\nis one reason why the sensitivity of ICPMS is lower for light ions than for\n\npositive ions. - hence high concentrations of U can depress the signal for Li.\nIn addition, if the sample itself contains a high concentration of heavy\nelements (e.g. U), the light ion sensitivity is even lower than it would be in a\nsolution containing no heavy ions.\nsource: Beginner's guide to ICPMS, Pt. V, Spectroscopy magazine\nd. These interferences, being dependent on the geometry of the ion beam, can be\nquite dependent on the specific instrumentation used, and even upon the\nspecific tuning conditions employed (nebulizer flow, position of torch relative\nto sample cone); interferences reported on one instrumental configuration may\nnot apply to different instruments, or to the same instrument in a different\nconfiguration. But in general on modern instruments, most interferences are\nmass-dependent, an \"internal standard\" at a nearby mass can correct for most\nof these interferences.\nI. The bottom line is that ICPMS is not an interference-free method. As with FAAS,\nGFAAS, and ICP-OES, one must be aware of interferences and how to control them.\n1. Minimize polyatomics:\na. Minimize acid interferences for elements of interest.\nb. Use appropriate collision gases if possible\n\nc. Purify the sample of elements that produce interfering polyatomic\ninterferences.\nd. Use pure acid blank correction for polyatomics produced by acid.\n2. Compensate for ionization and transmission interferences:\na. Use the internal standard method to minimizing mass-dependent matrix\ninterferences.\nb. Use standard additions method to correct for \"sensitivity\" interferences.\nc. Use the isotope dilution method to avoid all \"sensitivity\" interferences (and\nsample recovery issues during processing).\nIsotope dilution equation for analysis of an element by spiking natural element\n(f238U=0.993) with an isotope-enriched spike 235U-enriched spike, then\nmeasuring the isotope ratio R:\nIsotope dilution equation:\nf spike >\n@\n§spike volume ·a\n\nRmeasured Rspike o\nCsample\nf natural\nCspike\n(c)samplevolume\n\n1¬«Rnatural Rmeasured 1⁄4\nwhere f is the fraction of the element occurring as the denominator isotope in\nthe ratio measured for the sample or spike, Cspike is the concentration of\nthe element in the spiking solution, Rmeasured is the isotope ratio measured\nin the spiked sample., Rspike is the isotope ratio of the spike, and Rnatural is\nthe isotope ratio of the naturally-occurring element.\n\nIV. Magnetic-sector ICPMS\nA. Magnetic sector mass spectrometer:\nHence\nM/e = 4.824 x 10-5 r2B2 / V\nwhere\nM = atomic mass units\ne = electronic charge (1,2,3,...)\nr = radius (centimeters)\nV = acceleration potential (volts)\nB = magnetic field strength (gauss)\nB. One solution to the isobaric interference problem is to employ a magnetic-sector\nmass spectrometer with higher mass resolving capability ('m/m>3000). A higher\nvacuum is required, the instrument is more expensive than a quadrupole (~2-4x), and\nmagnetic field scans occur more slowly (seconds rather than milliseconds). But\nmagnetic sector instruments can distinguish between species such as 32S16O+,\n31P16O1H+, and 48Ti+, or 40Ar16O+ (55.957 amu) and 56Fe+ (55.935 amu), for\nexample.\nC. In order to improve mass scanning speeds, these instruments sometimes employ\nelectrostatic scanning whereby the accelerating voltage of the mass spectrometer is\nvaried instead of the magnetic field strength. Although this method can scan as fast\nas the quadrupole, it has a more limited AMU range (±30% of the central mass).\n\nD. These instruments also have lower counter background count rates (~0.1 cps\ncompared to ~3-30 for a quadrupole instrument), resulting in improved detection\nlimits.\nE. The energy spread of the ions coming in from the plasma is relatively large, but the\nmagnetic sector mass spectrometer requires a narrow spread. Most designs use an\nelectrostatic focusing sector to pre-select a narrower energy range (this results in\nsome loss of transmission). One other design uses a \"hexapole collision cell\" to\ncollide the incoming ions with thermal gas to reduce the energy spread (this design\nhas a very high transmission).\nF. Although these instruments deliver square-topped peaks (images of the slit),\nfluctuations in the plasma prevent this method from having much better isotope ratio\nperformance when a single detector is used because the ion current fluctuates during\nthe time over which the scan is performed.\nG. A more expensive (~$750K) variant overcomes the plasma fluctuation problem by\nusing multiple-collectors with a magnetic-sector ICPMS. This device collects several\nm/e levels simultaneously. Because the ratio of ions is determined instantaneously,\nplasma fluctuations do not affect these isotope ratios. This instrument is almost as\nstable as a TIMS mass spectrometer, but has the particular advantage of high\nionization efficiency for almost all elements and very rapid isotope ratio\ndetermination (minutes compared to hours).\nH. Isotope mass fractionation in ICPMS, and correction strategies\n1. During the step from plasma formation to ion beam detection, rather large isotope mass\nfractionations occur in ICPMS with discrimination in favor of heavier isotopes. The\neffect is largest at low masses and smallest at high masses and depends on the\ninstrument, analytical conditions, and sample matrix; these fractionations can change\nrelatively quickly even on the same instrument.\n2. Example: on our IsoProbe, mass fractionation is about +5% per amu at mass 55 and\nabout +1% per amu at mass 207.\n3. For some purposes that don't require precision to better than 10%, these fractionations\nare often ignored and assumed to be taken care of by similar fractionations in the\nelemental standards. However, for the most precise analyses using isotope dilution or\nnatural stable isotope ratio determinations, it is necessary to compensate for this mass\nfractionation before the isotope ratio is computed. For very high precision data, these\nmass fractionations can vary from sample to sample.\n4. These fractionations are typically calculated using either \"natural\" isotope ratios (where\nthe natural isotope ratio variations are typically small compared to the desired\nprecision; this approach is typically used in isotope dilution measurements where the\nspiked ratio variations are large compared to natural isotope variations) or by using a\nstandard of known isotopic composition. For the highest accuracy, an \"internal\"\nstandard should be used. For example thallium (masses 203 and 205) is often added to\n\nPb isotope samples (masses 204, 206, 207, 208). Mass fractionation is typically\ninterpolated/extrapolated using the \"exponential\" formula:\nRtrue\nRmeasured\n§M 2\n·\nE\n(c)M1 1\nwhere\nRtrue is the known true isotope ratio of isotopes with masses M1 and M2,\nRmeasured is their isotope ratio signal measured by the mass spectrometer, and\nE is a constant determined from a known isotope ratio in the same sample\nIV. Alternative sample introduction techniques\nA. Because the conventional concentric glass nebulizer/spray chamber throws away\n99% of the sample, higher sensitivity can be achieved by alternative sample\nintroduction techniques, which may also have other advantages.\nB. Micro Concentric Nebulizer (MCN): similar in principle to the concentric nebulizer,\nbut scaled down dimensionally so the sample draw rate is much lower (~50 μl per\nminute compared to 1 ml per minute) and the efficiency of conversion to fine\ndroplets is higher. The signal intensity for this device is similar to the conventional\nnebulizer, but because the sample size is much smaller, the mass detection limits\n(absolute mass required for detection) are much lower. Disadvantage: it is easy to\nclog the nebulizer with fine particles.\nC. Desolvators: because the plasma is partially cooled by the water droplets, and\nbecause the water contributes molecular interferences, it is advantageous to\ndesolvate the mist before introducing it into the plasma. The conventional spray\nchamber achieves this to some extent, but alternative desolvators are more effective:\ninfrared heating and flow past a water-permeable membrane. These devices can\nresult in order-of-magnitude higher signals. Disadvantage: not always as stable a\nsignal, and more difficulty with inter-sample carryover.\nD. Electrothermal Vaporizers (ETV): essentially, a graphite furnace used as the source\nfor the ICPMS. It has the advantages of complete desolvation, small sample size,\nefficient sample transport, and concentration of the signal into a few seconds\nduration (getting signals above noise levels) - hence it has excellent detection limits,\nperhaps unsurpassed. Disadvantages: slow, less precise, and requires more\nknowledge of sample preparation and temperature programming.\n\nE. Laser ablation: a powerful laser can be focused onto a 10-100μm spot and pulsed to\nablate a small crater; the ejecta can be caught up into the Ar flow and introduced into\nthe ICPMS. This has the advantages of analyzing solid samples without dissolution,\na capability for determining spatial heterogeneity, and a dry plasma (hence excellent\ndetection limits and relative freedom from solvent-induced molecular interferences).\nDisadvantage: more difficult to calibrate, as the interaction of the laser beam and the\nsample depends very strongly on the composition of the sample and its geometrical\ncharacteristics.\nF. Solid slurry: a slurry of finely divided particles can be introduced into the plasma. If\nthe particles are small enough, they will decompose in the plasma. This method has\nthe advantage of not requiring dissolution of solid samples. Disadvantages: particles\nhave to be very small; more matrix interferences; more difficult to standardize.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_intrfrn_ICPMS.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/ab3525a3865c3745f9fcd5c23f248202_MIT12_119S11_intrfrn_ICPMS.pdf",
      "content": "2 In addition to elements in the sample elements in the\n2. In addition to elements in the sample, elements in the\nsolvent (often a mineral acid such as HNO3, HCl, H2SO4,\nH3\n4)\np\ng\n(\np\n,\n,\n,\n,\n,\nXe,...) can interfere.\n3PO4) and plasma gas (Ar with impurities C, N, O, Ne, Kr,\nIsobaric interferences in ICPMS\n1.At the highest sensitivity, any ion having a m/e value within\n0.1 amu of the isotope of the element of interest will interfere.\nIn many cases, you can avoid these inter-elemental isobaric\ninterferences by using a different isotope of the element you\nare interested in or by measuring another isotope of the\nare interested in, or by measuring another isotope of the\ninterfering element and subtracting from the mass of interest on\nthe basis of the known isotope ratio of the interferingg element.\nAlternatively, by using high-resolution on a magnetic sector\ninstrument, you can resolve some interferences (e.g. 40Ar16O+\nfrom 56\n56Fe+)\n\nmass\nmasses\nIsobaric interferences in ICPMS\n3 Th\nl\nt i\nth\nl\n(i\nl di\nH\nd O)\nd\nl\n3. The elements in the sample (including H and O) and plasma\ngas (Ar and its impurities) can combine to form interfering\npolyatomic molecular species which form when the ion beam is\npolyatomic molecular species which form when the ion beam is\ncooling in the vacuum interface, e.g.:\nAr2\n+ (mainly mass 80 but also at 76 and 78) ArCl+ (mainly\nmasses 75 and 77); ArO+ (mainly mass 56); POH+ (mainly\n48) ClO+ (mainl 53 55) ClOH+ (mainl\n54 and\nmass 48), ClO+ (mainly 53, 55), ClOH+ (mainly masses 54 and\n56), ArN+ (mainly mass 54), ArCl+ (mainly masses 75 and 77),\nNaAr\nNaAr+, MgAr\nMgAr+ and many other bizarre non-intuitive species\nand many other bizarre, non intuitive species.\nNote that minor isotope interferences also exist: e.g. 36Ar14N+\nand 40Ar18O+). Nitric acid is often considered the \"preferred\"\nICPMS acid because it has the fewest polyatomic interferences\n(but may not desirable for 54Fe/56Fe isotope measurements\nbecause of 40Ar14N+)\nbecause of 40Ar14N+)\n\nIsobaric interferences in ICPMS\n4. Molecular interferences can be minimized using a collision\ncell: a hexapole confiningg cell jjust downstream of the skimmer\ncone can allow a \"collision gas\" to interact with the ion beam at\nhigher pressures \"... thus reducing the ion energy spread of the\nions as they emerge from the skimmer, and breaking up\nmolecular species before they reach the mass analyzer. As a\nresult a mass spectrum free from argon interferences is\nresult, a mass spectrum free from argon interferences is\nachieved, which in turn allows much lower detection limits for\nwhat would otherwise have been 'difficult' elements.\" (q\n(quote from\nMicromass product literature) Example: 40Ar16O+ is minimized with\ncollisions with Ar gas, and additions of H2 collision gas can\nli\ni\ni\ni\nl\nh\nid\nl A O i\nd\nA\nd\neliminate it entirely when residual ArO+ is converted to Ar and\nArOH+)\n\nTailing interferences in ICPMS\n\"Abundance sensitivity\": if a very small peak (e.g. 234U) occurs\nnear a very large peak (e.g. 235U), the larger peak will \"tail\" into\nk\nd b\nth\nthe llarger peak, bbecause of if ions th\nthatt are scattttered by resididuall\ngas molecules in the vacuum (some others may bounce off the\nwalls) This tail will give a false high signal on the smaller peak\nwalls). This tail will give a false high signal on the smaller peak.\nOne strategy for minimizing this problem is the \"WARP\" filter\n(wide anggle retarding potential), which takes the \"higher anggle,\ng p\n)\nlower-energy\" ions out of the ion path, but this solution cannot\nbe employed on systems that do not have a narrow energy\nspread.\n\nTailing interferences in ICPMS\nTailing interferences can be evaluated by using a mono-\nisotopic element near the mass of interest, e.g. 209Bi can be\nused to estimate tailing for Pb:\n\nt\nt\nt\nt\nOther interferences in ICPMS\n1. Although ionization is high (>90% for many elements), it is not\ncomplete and some inter-element ionization interferences can occur\nfor some elements in some matrices (e g\nCd Zn)\nfor some elements in some matrices (e.g., Cd, Zn).\n2. Interface transmission interferences\na. In addition to factors that influence ionization, mass-dependent\ninterferences occur via factors influencing the transmission of\ninterferences occur via factors influencing the transmission of\nelements into the ion beam.\nb. Space-charge effects: the beam of positively charged ions suffers\nfrom mutual repulsion. Light elements with less momentum are lost\nlaterally more rapidly than heavier elements; this factor contributes\nlaterally more rapidly than heavier elements; this factor contributes\nto a generally lower sensitivity for light elements compared to heavy\nelements, and accounts for several inter-element interferences (e.g.,\na sol ti\nlution contaii ining hihighh concentratiions off uraniium ddepresses thhe\nsensitivity for lithium).\n\nOther interferences in ICPMS\nc. A high concentration of ions in the beam can lead to \"space charge\neffects\" (a result of the total positive charge of the ion beam inside of the\nvacuum system) Most of the ions in the plasma are Ar+ ions which are\nvacuum system). Most of the ions in the plasma are Ar ions, which are\nan inevitable product of an Ar plasma. Space charge leads to the\npreferential loss of light ions (which are repelled from the beam more\nrapidly than the heavy ions) This is one reason why the sensitivity of\nrapidly than the heavy ions). This is one reason why the sensitivity of\nICPMS is lower for light ions than for positive ions. High concentrations\nof U can depress the signal for Li, but high concentrations of Li do not\naffffect U\nt U very muchh.\nd. These interferences, being dependent on the geometry of the ion\nbeam, can be quite dependent on the specific instrumentation used, and\neven upon the specific tuning conditions employed (nebulizer flow,\nposition of torch relative to sampple cone); interferences repported on one\np\n)\ninstrumental configuration may not apply to different instruments, or to\nthe same instrument in a different configuration. But in general on\nmodern instruments, most interferences are mass\nmodern instruments, most interferences are mass-dependent, an\ndependent, an\n\"internal standard\" at a nearby mass can correct for most of these\ninterferences.\n\nt\nt\nt\nMimimizing interferences in ICPMS\nThe bottom line is that ICPMS is not an interference-free method. As\nwith FAAS, GFAAS, and ICP-OES, one must be aware of\ni t\ninterfferences and how to controll them.\nd h\nh\n1. Minimize polyatomics:\n1. Minimize polyatomics:\na. Minimize acid interferences for elements of interest.\nb. Use appropriate collision gases if available on your\ninstrument\nc. Purify the sample of elements that produce interfering\npolyatomic interferences\npolyatomic interferences.\nd. Use pure acid blank correction for polyatomics\nproduced by acid, water, and plasma gases.\n\nMimimizing interferences in ICPMS\n2. Compensate for ionization and transmission interferences:\na. Use the internal standard method to minimize\nmass-dependent matrix interferences (e.g. addition\nof known amount of indium). Works best if added\nof known amount of indium). Works best if added\nelement is near the same mass as the analyte element.\nb Use standard additions method for analyte element\nb. Use standard additions method for analyte element\nto correct for sensitivity interferences.\nc. Use thhe iisotope dil\ndilutiion methhodd to avoidid allll\nsensitivity interferences and sample recovery\nissues during processing.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_mcrprb_prt1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/8d111df3bb8ccc76abe1bc63de0253d9_MIT12_119S11_mcrprb_prt1.pdf",
      "content": "Massachusetts Institute of Technology\nSpecimen characterization\nwith the\nElectron Microprobe\n\nElectron\nbeam\nBack-scattered\nCathodoluminescence\nelectron (BSE)\n(CL)\nCharacteristic X-ray\nSecondary\nelectron (SE)\nSpecimen\nSignals produced in the\nElectron Microprobe\n\nElectron-specimen interactions\nElastic Scattering\nInelastic Scattering\nE1 = E0 , large e\nE1<E0 , small i\n( e>> i)\n- Back-scattered\n- Characteristic X-rays\nelectron\n- Secondary electron\n- Cathodoluminescence\nBeam electron\nSpecimen atom\nScattered beam electron\n\nElastic scattering cross-section\nQ(>\n-\ne) = 1.62x10 20 (Z /E2)cot2(\n/2)\ne\nQ: cross section (events.cm2/e-.atom)\n: elastic scattering angle\ne\nZ: atomic number\nE: beam energy\nE1 = E0 , large e\n\nElectron interaction volume\n- Increases with voltage (electron\nbeam energy)\n- Decreases with sample atomic\nnumber\nTypical depths (15 kV, perpendicular beam):\nCarbon (C, At# 6)\n1.8\nm\nIron (Fe, At# 26)\n1.1\nm\nUranium (U, At#92)\n0.8\nm\n\nElectron Back-scattering\n(High angle elastic scattering)\n\nFunction of\ncomposition\nThin section\nBackscattered electron image\nBack-scattered electron\nPlane polarized transmitted light\nPolished surface\nFunction of optical\nproperties\n\nPhase identification: EDS X-ray spectra\nilm\nhbl\nplg\nNumber\nomic\nAt\nMean\n\nUnderstanding X-rays:\nEnergy and Wavelength\nE=h\nh : Planck's constant\n(6.626x10-34 Joule.sec\nor, 6.626x10-34/1.6021x10-16 keV.sec)\n: frequency (= c/ )\n(c : speed of light in vacuum\n= 2.99793x1017 nm/sec\n: wavelength)\nnm) = c/ = hc/E = 1.2398/E (keV)\n\nUnderstanding X-rays:\nThe electromagnetic spectrum\nSiK\nnm) = 1.2398/E (keV)\nUM\n1.74 keV\n0.71 nm\n3.17 keV\n0.39 nm\n\nThe X-ray spectrum\nX-ray background\n(maximum energy = electron beam\nenergy, E0)\nCharacteristic X-rays\nContinuum\nX-rays\n\nContinuum X-rays: background in\nX-ray spectra\nNeither phase contains Cr\nBut background counts at Cr :\nin 1\nin 2\nPhase 2\nPhase 1\n\nTi Ka\nFe Ka\nTi Kb\nFe Kb\nK-shell\nL-shell\nCharacteristic X-ray generation\nFlowchart for\nX-ray generation\nInner-shell ionization\nX-ray and electron transition\nKa : L to K-shell\nKb:\nM to K-shell\nLa : M to L-shell\nLb:\nN to L-shell\nMa:\nN to M-shell\n\nOvervoltage\nU = E0/Ec\nwhere, E0 is the electron beam energy (usually 10-25 keV)\nEc : critical excitation energy for inner shell ionization\nBest analytical condition, U≈5\n\nK\nL\nM\nkeV\n\nBeam-rastered image: electron beam rasters over the area to be imaged\nStage-rastered image: electron beam is stationary, stage moves\nImaging with X-rays:\ncompositional mapping\nMg\nCa\nNa\nTi\n\nEPMA: Quantitative analysis\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\nZAF\nk\nC\nC\nk\nI\nI\nwhere\nI\nI\nC\nC\n]\n[\n\n,\n\n)\n(\n)\n(\n)\n(\n)\n(\nCi and C(i): concentration of element 'i' in sample and standard\nIi and I(i): measured X-ray intensities of element 'i' in sample and standard\nki : k-ratio of element 'i'\nZAF : matrix corrections\nWDS spectrum:\nIntensity is proportional\nto concentration\n\nMatrix (ZAF) corrections\nZ : atomic number correction\nA : absorption correction\nF : fluorescence correction\n\nAtomic number (Z) correction\ni\ni\ni\ni\ni\nS\nR\nS\nR\n)\n(\n)\n(\nZ\nRi = S CjRij\nR = #X-rays generated / #X-rays if\nthere were no electron backscattering\nSi = S CjSij\nS = -(1/r )(dE/ds), stopping power\n( ): standard\na function of E0 and composition\n(Duncumb and Reed)\n\nZ, a function of E0 and composition\nMeasuring Cu\nin\nCu-Al alloy\nPure Cu\nstandard\nCuAl2\nstandard\nZCuKaα\n\nX-ray absorption\nI = I0 exp-(m /r )(r\nx) = I0 exp-(m /r )(r\nz cosecy )\nI: Intensity emitted; I0: Intensity generatedm\n/r : mass absorption coefficientr\n: density; z: depth; y : take-off angle\n\nMass absorption coefficient,\nenergy\nabsorber\n)\n(\nEnergy\nEc(K-shell)\nenergy\nNi)\n(\n\n__________(keV)_____(keV)____(cm2/g)______\nCoK\n6.925\n\nNiK\n7.472\n8.331\n\nCuK\n8.041\n\nZnK\n8.632\n\nZnKa\nis highly\nabsorbed in Ni\n\nAbsorption (A) correction\n)\n(\n)\n(\n)\n(\ni\ni\ni\nf\nf\nA\nAbsorption function,\nf(c\ni) =\nIi(emitted)/Ii(generated)\n( ): standard\na function of E0, y\nand composition\n(Philibert)\n\nA, a function of E0, y\nand\ncomposition\nANiKa in Fe-Ni alloy\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\nANiKa at 15.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKa at 40o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKa at 52.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n\nX-ray fluorescence\nA consequence of X-ray absorption\nwhen\nEabsorbed X-ray > Ec(absorber shell)\n\nAbsorption-Fluorescence in Fe-Ni alloy\nNiK\nis absorbed in Fe, and Fe is fluoresced\nK-shell excitation energy of Fe = 7.111 keV; NiKa\nenergy=\n7.478 keV\n=379.6 cm2/g\nNiKα\nFe)\n(\n\nCharacteristic fluorescence (F)\ncorrection\ni\nf\nij\ni\nf\nij\nI\nI\nI\nI\ni\n)\n(\n)\n(\nF\nFluorescence correction for an element includes the\nsummation of fluoresced intensities by other\nelements in the compound\nIf : fluoresced intensity\nI : e-beam generated intensity\n( ): standard\na function of E0 and composition\n(Castaing-Reed)\n{\n\n{\n}\n}\n\nF, a function of E0 and composition\n1.7\n1.6\n1.5\n1.4\n1.3\nK\ni\nN\nA\n1.2\n1.1\nCFe\no\nat 15.5\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\n1.6\n1.5\n1.4\n1.3\nK\ni\nN\nA\n1.2\n1.1\nCFe\no\nat 40\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\n1.6\n1.5\n1.4\n1.3\nK\ni\nN\n1.2\nA\n1.1\nCFe\no\nat 52.5\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n0.9\nFeK\nF\n0.8\n0.7\no\nat 15.5\nCFe\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n0.9\nFeK\nF\n0.8\n0.7\no\nat 52.5\nCFe\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n0.9\nFeK\nF\n0.8\n0.7\no\nat 40\nCFe\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\nFFeK in Fe-Ni alloy\nANiK in Fe-Ni alloy\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_119S11_mcrprb_prt2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-119-analytical-techniques-for-studying-environmental-and-geologic-samples-spring-2011/891a61ee49264e4b6b9a2d304fd60536_MIT12_119S11_mcrprb_prt2.pdf",
      "content": "Electron\ngun\nCondenser\nlens\nOptical\nMicroscope\nWDS\nLiq\nN2\nEDS\nSE\nObjective lens\nBSE\nStage JEOL JXA-8200 Superprobe\nJEOL JXA-8200 Superprobe\nHigh\nvacuum\nPerpendicular geometry\nElectron\ngun\nLiq\nN2\nfor\nEDS\nEDS\nWDS\nOptical\nMicroscope\nSample\nexchange\nchamber\n\nBack-scattered electron detector\nTop view of specimen\n\nCompositional and topographic\nimaging with BSE\nA+B\nCompositional\nmode\nA-B\nTopographic\nmode\n\nSecondary electrons\n- Specimen electrons mobilized by electron\nbeam through inelastic scattering\n- Secondary electrons have lower energy\ncompared to backscattered electrons\n(useful in studying surface topography)\n\nSecondary electron detector\nSide view of specimen\n\nSecondary electron imaging\n-ve Faraday cage bias\nless SE\nless topographic contrast\n+ve Faraday cage bias\nmore SE\nbetter topographic contrast\n\nCathodoluminescence\nBand gap energy, Egap, is a property of the semiconductor\nTrace impurities change Egap by adding additional energy\nstates in the band gap\nLight generated from sample through electron beam interaction\n\nCathodoluminescence detector\nPhotomultiplier for secondary electron imaging is used as CL detector\nOptical arrangement is the same as for the optical microscope\nJXA-733\nOptical\nmicroscope\nlight\nturned off\nFront view\nSide view\n\nCathodoluminescence spectrometer\nOptical\nspectrometer\nJXA-8200\nOptical microscope\nlight (turned off)\nOptical microscope\ncamera (not used)\n\nIntegrated CL and X-ray\nspectrometry\nCL spectrum\nty\nnsi\nInte\nEnergy\nScatter plot\n3 band CL map\n3 element X-ray map\nCL wavelength band may be correlated with an element\n\ncrystal\ndetector\nWDS\nWDS\nWavelength Dispersive Spectrometer\n(WDS)\n\nWDS Analyzing crystal\nFlipping motor\n\nBragg's Law\n= path length ABC\nq = angle of\ndiffraction\nd = lattice spacing\nn = order of reflection\n(any integer)\nnl = 2d sin q\n\nFirst and second order\nreflections\n1l = 2d sinq1\n2l = 2d sinq2\n=ABC\n=DEF\nSame element\nn=1\nn=2\nq1\nq2\nD\nF\nA\nC\nB\nE\npath DEF = 2* path ABC\n\nDiffraction angle\nnl1 = 2d sinq1\nnl2 = 2d sinq2\nDifferent elements\nl\nl\n(Element 1)\n(Element 2)\nq1\nq2\nDiffraction angle changes with wavelength being\ndiffracted (for the same order of reflection, n)\n\nName 2d (A) Type\nElements usually analyzed\nLDEC 98\nNi/C Multi-layer\nB-O (K), optimized for C analysis\nSTE\n100.4\nPb stearate\nB-O (K), optimized for C analysis\nLDE1 59.8\nW/Si Multi-layer\nC-F (K), optimized for O analysis\nTAP\n25.8\nThallium acid phthalate Na-P (K); Cu-Zr (L); Sm-Au (M)\nPET\n8.742\nPentaerythritol\nS-Mn (K); Nb-Pm (L); Hg-U (M)\nLIF\n4.028\nLithium fluoride\nTi-Rb (K); Ba-U (L)\n\nWDS Analyzing crystals\nwith different \"d\" spacings\n\nTungsten collection wire set at 1-3 kV bias\nFlow counter: 90% Ar +10% CH4 (P-10);\npoly-propylene window\nSealed counter: Xe or Kr; Be window\nWDS detector: Proportional counter\nCount rate\ndepends\non bias\nand\ngas used\n\nBias in proportional counter\nbest count rate\n\nCounting efficiency of gas\nHeavy\nLight\nelements\nelements\n\nWDS signal processing\nSingle channel analyzer (SCA)\nand\npulse height analysis (PHA)\nwindow\nbaseline\nOnly pulses\nin this voltage\ninterval are\ncounted\n\nWDS Focusing geometry\nL = nl .R/d\nangle of\ndiffraction\ntake-off\nangle\n\nCurved diffracting crystals\nJohansson type\nbending curvature: 2R\npolished and ground to R\nJohan type\nonly bent to 2R,\nnot ground\nR\nFWHM of fully focusing Johansson-type crystal ~10 eV\nSome defocusing in Johan-type, but resolution is not compromised\n\nDefocusing in beam-rastered\nWDS X-ray maps\n\nWDS: changing the angle\nof diffraction\nor, n2l1 = 2d sin q2\nL2 = n2l1.R/d\n\nTheoretical and actual limits of\nspectrometer movement\n2R ≤ L ≤ 0\n\nEPMA: Quantitative analysis\nprocedure\nSample preparation\nQualitative analysis with EDS\nStandard intensity measurement\n(calibration)\nMeasurement of X-ray\nintensities in the specimen\nData reduction through matrix\ncorrections\n\nSample preparation\nSample cut and mounted in epoxy\nPolished first with coarse SiC paper, then with\nalumina grit slurry (final size: ≤0.25 mm) 1\nWashed with water in ultrasonic cleaner 2\nDried with blow duster and air\nCarbon coated 3\n1: diamond paste or colloidal silica for some samples; dry polishing paper for\nwater-soluble samples\n2: ethanol may be used sparingly; cleaned with blow duster and cloth for samples\nthat dissolve in water\n3: for insulators; if standards are coated, however, all samples must be coated\n\nSample prep: carbon coating\nSample\nchamber\n(bell jar)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.119 Analytical Techniques for Studying Environmental and Geologic Samples\nSpring 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}