{
  "course_name": "Analysis and Design of Digital Integrated Circuits",
  "course_description": "6.374 examines the device and circuit level optimization of digital building blocks. Topics covered include: MOS device models including Deep Sub-Micron effects; circuit design styles for logic, arithmetic and sequential blocks; estimation and minimization of energy consumption; interconnect models and parasitics; device sizing and logical effort; timing issues (clock skew and jitter) and active clock distribution techniques; memory architectures, circuits (sense amplifiers) and devices; testing of integrated circuits. The course employs extensive use of circuit layout and SPICE in design projects and software labs.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Computer Design and Engineering",
    "Electrical Engineering",
    "Digital Systems",
    "Electronics",
    "Engineering",
    "Computer Science",
    "Computer Design and Engineering",
    "Electrical Engineering",
    "Digital Systems",
    "Electronics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis course covers the analysis and design of digital integrated circuits using CMOS technology. The course emphasizes design, and requires extensive use of MAGIC for circuit layout, and HSPICE and IRSIM for simulations.\n\nText\n\nRabaey, Jan, Anantha Chandrakasan, and Bora Nikolic.\nDigital Integrated Circuits: A Design Perspective.\n2nd ed. Prentice Hall, 2002.\n\nMaterial is also derived from the\nJournal of Solid-state Circuits\nand the\nInternational Solid-state Circuits Conference\nproceedings.\n\nPrerequisites\n\nBasic device physics (\n6.012\nor equivalent) and basic logic design (\n6.004\nor equivalent).\n\nGrading\n\nThere is a significant emphasis on the\ndesign\naspect of the digital design process. The grade is based on problem sets, one design project, and two in-class quizzes. The final grade is calculated approximately using the following weights:\n\nProblem Sets (5) 20%\n\nQuiz #1 25%\n\nQuiz #2 25%\n\nFinal Design Project 30%",
  "files": [
    {
      "category": "Resource",
      "title": "processparam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/f209be21df57f47e98fc268d2afdcbab_processparam.pdf",
      "content": "μm CMOS)\nμm\nμ\nVT0 (V)\nγ (V0.5)\nV\n(V)\nk' (A/V2)\nλ (V-1)\nNMOS\n0.43\n0.4\n0.63\n115 × 10-6\n0.06\nPMOS\n-0.4\n-0.4\n-1\n-30 × 10-6\n-0.1\nWith the above conventions, the ID equation presented in the previous viewgraph\ncan be used for PMOS devices with IDp defined as the current going into the drain\nterminal. Vmin should be changed to Vmax = max (VGT, VDS, VDSAT)\nProcess Parameters (0.25\nThe following table shows parameter values for the minimum-sized\nNMOS and a similarly sized PMOS device in our generic 0.25\nCMOS process. We will use the following parameters in this course.\nParameters for manual model of generic 0.25 m CMOS process\n(minimum sized device).\nDSAT\nCMOS Inverter"
    },
    {
      "category": "Resource",
      "title": "ps1_03_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/151adc5717d8b3c7e34e2761972124f8_ps1_03_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 1 Solutions\nFall 2003\nIssued: 9/18/03\nProblem 1: Device Parameters\nThe data from five measurements made on a short channel NMOS device appears in Table 1. Given that\nVDSAT = 0.6 V and k' = 100 μ A/V2, calculate VT0,\n,\nγ\nλ , 2| φ F|, and W/L.\nTable 1: Measured Data for Short Channel NMOS\nMeas. Number\nVGS\nVDS\nVBS\nID(\nA)\n\nμ\n2.5\n1.8\n1.8\n2.5\n1.8\n-1\n1.8\n-2\nSolution\nUsing the data from the table, set up equations containing the unknowns of interest. We will use the unified\nMOSFET model for our analysis: kn'W/L(VGTVmin - Vmin\n2/2)(1+ λ VDS) = Io.\nLet us first make an assumption about the region of operation. The minimum VGS is 2, and we can guess that\nVto is less than half a volt, so VGT > VDSAT. Additionally, the minimum VDS is greater than VDSAT. Unless\nVto is abnormally high, the device is in the velocity saturation region for all the data points. We can check\nthis assumption at the end of the problem. Using this assumption, the first three data points give us the fol\nlowing equations\nW\n0.62\n100 ⋅----- ⋅\n(2.5 - V ) ⋅0.6 - ----------⋅(1 + λ ⋅1.8) = 1812μ\nL\nto\nW\n0.62\n) ⋅0.6 - ----------⋅(1 + λ ⋅1.8) = 1297μ\n100 ⋅----- ⋅\n(2 - V to\nL\nW\n0.62\n) ⋅0.6 - ----------⋅(1 + λ ⋅2.5) = 1361μ\n100 ⋅----- ⋅\n(2 - V to\nL\nThese are three equations with three unknowns - piece of cake! Divide the first two equations to get:\n0.62\n(2.5 - V ) ⋅0.6 - ----------\n\nto\n\n------------------------------------------------------------ = ------------ . Simplifying gives: 1.5 - 0.6V to 0.18\n-\n= 1.397 ⋅(1.2 - 0.6V to - 0.18)\n0.62\n(2 - V ) ⋅0.6 - ----------\n\nto\nand 0.2382V to = 0.1049 and\n= 0.44 V.\nV to\n\n------\n--------------------------------------------------\nDividing the second and third equations gives:\n(1 + λ ⋅ 1.8)\n----------------------------- = ------------ . Solving for λ gives λ = 0.08\n(1 + λ ⋅ 2.5)\nPlugging these two parameters into the first equation gives: W\nL = 15\n\n.\nWriting two equations from the last two data points permits us to solve for the remaining two unknowns:\n1716 ⋅ ((2 - V T 1 ) ⋅ 0.6 0.18\n-\n) = 1146 so V T 1 = 0.5869 .\n1716 ⋅ ((2 - V T 2 ) ⋅ 0.6 0.18\n-\n) = 1039 so V T 2 = 0.6909 .\nNow we use the equation for threshold voltage to relate the remaining unknowns:\n2φF\n2φF\n-\n2φF\n2φF\n-\n+\n\n+\n\nγ\n(\n)\n0.44\n0.5869\n+ ⋅\n=\nγ\n(\n)\n0.44\n0.6909\n+ ⋅\n=\nSubtracting 0.44 from both sides and dividing the equations gives:\n2φF\n2φF\n-\n2φF\n2φF\n-\n-\n+\n\n+\n\n(\n)\n= 1.7 . Simplifying gives: 1.7 ⋅\n2φF\n+\n2φF\n+ + 0.7\n2φF .\n⋅\n=\n(\n)\n2φF\n2φF\n+\nSquaring both sides gives: 2.89 ⋅(\n+ )\n+\n+\n\n0.49 ⋅\n+ 1.4 ⋅\n2φF\n2φF\n2φF\n⋅\n=\n.\n⋅\n2φF\n2φF\n⋅\n+\n.\nCollecting terms gives: 1.4 2φF\nSquaring both sides and solving\n0.89\n+\n1.4\n⋅\n=\ngives:\n= 0.556 .\nWe can plug this value back into either threshold voltage equation to get γ = 0.293 .\nProblem 2: Backgate Effect\n2φF\nThe circuit in Fig. 1 is known as the source follower configuration. It achieves a DC level shift between the\ninput and the output. The value of this shift is determined by the current I0. Assume xd=0, γ=0.4, 2|φf|=0.6V,\nVT0=0.43V, kn'=115μA/V2 and λ=0.\nVDD = 2.5V\nVDD = 2.5V\nM1 1um/0.25um\nVo\nVo\nIo\nM1 1um/0.25um\nM2 LD=1um\nIo\n(b)\nVi\nVi\nVbias= 0.55V\n(a)\nFigure 1: NMOS source follower configuration\na) Suppose we want the nominal level shift between Vi and Vo to be 0.6V in the circuit in Figure 1(a).\n\nNeglecting the backgate effect, calculate the width of M2 to provide this level shift (Hint: first relate Vi\nto Vo in terms of Io).\nSolution\nThe level shift of 0.6 tells us that VGS1=0.6 so VGT1=0.17. This means that M1 must be in the saturation\nregion (not velocity saturated). Thus,\nW\nk' ⋅ ----\nn\nL\n----------------- ⋅(V GS - V T)2 = I D, and ID=6.647 μ A.\nFor M2, VGT=0.12, so M2 also is in the saturation region (not velocity saturated). Using the same equation\nas above and solving for W/L gives W/L = 8.\nb) Now assume that an ideal current source replaces M2 (Figure 1(b)). The NMOS transistor M1 experi\nences a shift in VT due to the backgate effect. Find VT as a function of Vo for Vo ranging from 0 to 2.5V\nwith 0.5V intervals. Plot VT vs. Vo.\nSolution\nThe threshold voltage equation provides the relation that we need:\nV T = V T 0 + γ ⋅(\n-\n) = V T 0 + γ ⋅(\n+ V -\n).\n2φF\n2φF\n2φF\n2φF\n+ V SB\no\nSee the graph at the end of this problem.\nc) Plot Vo vs. Vi as Vo varies from 0 to 2.5V with 0.5 V intervals. Plot two curves: one neglecting the back-\ngate effect and one accounting for it. How does the backgate effect influence the operation of the level\nconverter?\nAt Vo(with backgate effect) = 2.5V, find Vo(ideal) and thus determine the maximum error introduced by\nthe backgate effect.\nSolution\nTo plot Vo versus Vi, we need to relate Vo to Vi. We can do this by solving the current equation (M1 should\nremain in the same region to first order because VGT will remain roughly constant to maintain the correct\ndrain current) for Vi:\n2I D\nV i = V + V T + ----------------\no\nW\nk' ⋅ ----\nn\nL\nThe maximum error occurs at the highest VSB. At Vo = 2.5, the error is 3.4944-3.1=0.3944 V.\n\nBackgate Effect: V versus V\nBackgate Effect: Vo versus V\no\nT\ni\n0.9\n2.5\n0.65\nNo backgate effect\nBackgate effect\n0.85\n0.8\n0.75\n0.7\n1.5\nT (V)\nV (V)\no\n0.6\n0.55\n0.5\n0.5\n0.45\n0.4\n0.5\n1.5\n2.5\n0.5\n1.5\n2.5\n3.5\nV (V)\nV (V)\no\ni\nFigure for Problem 2(b)\nFigure for Problem 2(c)\nProblem 3: Velocity Saturation\nThis problem explores the behavior of short-channel devices. For the HSPICE simulations of this problem\nyou will use the 0.18u model parameters. Use the HSPICE model parameters which can be found in \" log018_1.l \"\na)\nUsing HSPICE plot ID versus VDS, for the transistor of the following figure, with VGS (0.6V, 0.8V, 1V,\nVd\nM1\nV\nWD = 0.54um\nLD = 0.18um\ng\nVs\nFigure 2: Short channel Transistor.\n1.2V, 1.4V, 1.6V, 1.8V) as a parameter. Comment on the dependence of ID with respect to VGS.\nSolution\nThe ID plots are shown in the next graph.\n\n* problem 3a\nCurrents (lin)\n20u\n40u\n60u\n80u\n100u\n120u\n140u\n160u\n180u\n200u\n220u\n240u\n260u\n280u\n300u\n320u\n340u\n360u\nVgs=1.8V\nVgs=1.0V\nVgs=0.8V\nVgs=0.6V\nVgs=1.6V\nVgs=1.4V\nVgs=1.2V\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\nVoltage X (lin) (VOLTS)\nIt is clear from the curves that, for the short channel device, there is a linear dependence of the saturation\ncurrent with respect to VGS.\nb) Calculate the effective resistance for a high to low transition, using the method described in slide 44\n(Handout 2).\nSolution\n* problem 3b\nCurrents (lin)\n20u\n40u\n60u\n80u\n100u\n120u\n140u\n160u\n180u\n200u\n220u\n240u\n260u\n280u\n300u\n320u\n340u\n360u\nCurrent =3.48e-04\nVoltage =1.80e+00\nCurrent =3.25e-04\nVoltage =9.00e-01\nVgs=Vdd\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\nVoltage X (lin) (VOLTS)\nWe can use the following expression:\nV DS\n\n1 V DS\n+ ----------\n= --\n-----------\nReff\n2 I D V DS = V DD\nI D V DS = V DD ⁄ 2\n\nWe can find the values of the drain current from the plot. So\n1.8\n0.9\nReff = --2 -------------------------------- + -------------------------------- = 4KΩ\n-\n-\n0.3481 ⋅ 10\n0.3254 ⋅ 10\nc) Consider two CMOS inverters with (W1/L1)n=(2.88u/1.44u), (W1/L1)p=(5.76u/1.44u) and (W2/\nL2)n=(0.36u/0.18u), (W2/L2)p=(0.72u/0.18u). Assume VDD = 1.8 V and the output of the inverter is\nloaded by CL=100fF capacitance. Calculate the propagation delay tP and check the answers with\nHSPICE.\nSolution\nThe propagation delay tp is the average of tpHL and tpLH. We can use the next equations to calculate the rise\nand fall times for the two inverters.\n= 0.69ReqHLCL and\n= 0.69ReqLHCL\nt pHL\nt pLH\nInverter 1\nfor a high to low transition (we assume that the PMOS is off):\n(\n(\nR V DS = 1.8V ) = 1.8V ⁄ 0.339m = 5.3KΩ and R V DS = 0.9V ) = 0.9V ⁄ 0.319m = 2.8KΩ\nR\n= --(5.3K + 2.8K) = 4.05KΩ\neq\n(\n= 0.69 4.05K)(100 f ) = 0.28ns\nt pHL\nfor a low to high transition (we assume that the NMOS is off):\n(\nR V DS = 1.8\n-\n) = -1.8V ⁄ -0.162m = 11.1KΩ and (\n= 0.9\n-\nV ) = -0.9V ⁄ -0.150m = 6.0KΩ\nR V DS\nR\n= --(10.5K + 5.7K) = 8.6KΩ\neq\n(\n= 0.69 8.1K)(100 f ) = 0.59ns\nt pLH\nSo, t p1 = --(\n) = 0.435ns\n2 t pHL + t pLH\nInverter 2\nfor a high to low transition (we assume that the PMOS is off):\n(\n(\nR V DS = 1.8V ) = 1.8V ⁄ 0.254m = 7.1KΩ and R V DS = 0.9V ) = (0.9V ) ⁄ 0.237m = 3.8KΩ\nR\n= --(7.1K + 3.8K) = 5.45KΩ\neq\n(\n= 0.69 5.45K)(100 f ) = 0.38ns\nt pHL\n\nfor a low to high transition (we assume that the NMOS is off):\n(\n(\n= 1.8\n-\nV ) = 1.8\n-\n⁄ -0.172m = 10.5KΩand R V DS = 0.9\n-\nV ) = 0.9\n-\n⁄ -0.147m = 6.4KΩ\nR V DS\nR\n= --(6.4K + 10.5K) = 8.5KΩ\neq\n(\n= 0.69 7.9KΩ)(100 f ) = 0.58ns\nt pLH\nSo, t p2 = --(\n) = 0.48ns\n2 t pHL + t pLH\nThe HSPICE simulation gives for the propagation delay:\n0.45n + 0.8n\n0.39 + 0.59n\n= ------------------------------- = 0.625ns and t p2 = -----\n= 0.49ns\nt p1\nComment.\nHspice simulations give different results than the hand calculations, because there are some second order\neffects that affect the performance of the devices. If you perform a transient analysis, you will see that in the\ncase of the long channel inverter, there is an overshoot(undershoot) when the new input data arrives. That's\nbecause of clock feedthrough (gate-to-drain capacitive coupling - Chapter 6). The long channel inverter\nexperiences this more intensively, because of the larger sizes of the transistors.\nIf you make the output load capacitance fairly large then this effect won't be so obvious, and the inverter\nwith the long channel devices will be faster as expected.\nThis is shown in the next figure.\n* problem 3c\nVoltages (lin)\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\nLong Channel\nShort Channel\n20n\n40n\n60n\n80n\n100n 120n 140n 160n 180n 200n 220n 240n 260n 280n 300n 320n 340n 360n 380n\n-20n\nTime (lin) (TIME)\n400n\nThe difference for the two transitions, comes from the fact that the for the low-to-high transition the currents\nforthe two inverters are almost the same..\nd) Repeat part c) sweeping the supply voltage VDD from 0.4V to 1.8V (sweep step 0.2V). Plot the propa\n\ngation delay tPversus the supply voltage VDD in the same graph. Comment on the results.\nSolution\nThe next table summarizes the propagation delays for the different supply voltages\nVDD (V)\ntPinv1 (ns)\ntPinv2 (ns)\n0.4\nX\nX\n0.6\n9.8\n7.7\n0.8\n2.9\n1.9\n1.6\n1.1\n1.2\n1.1\n0.8\n1.4\n0.9\n0.6\n1.6\n0.7\n0.5\n1.8\n0.6\n0.5\nTable 2: Propagation Delays for the two inverters\nThe plot is shown in the next figure.\ntp (ns)\nShort Channel\nLong Channel\n0.6\n0.8\n1.2\n1.4\n1.6\n1.8\nVdd (Volts)\nComments\nWe see that the curve for the short channel device flattens (~1.4 V), since ID is linear with respect to VGS.\nProblem 4: Voltage transfer characteristics, Noise Margins\nThe next figure shows an all NMOS inverter.\n\na) Calculate VOH, VOL, VM for the inverter.\nVDD = 2.5V\nM2 W/L=0.375/0.25\nVOUT\nVIN\nM1 W/L=0.75/0.25\nA\nFigure 3: Two Inverter Implementations\nSolution:\nVOH: We calculate VOH, when M1 is off. The threshold for M2 is:\nV T = V T 0 + γ ⋅( - 2φF +\n-\n-2φF ),\n, -2φF = 0.6V\nV SB\nV SB = V OUT\nand M2 will be off when: V GS - V T =\n- V T = 0,\nV DD - V OUT\nSubstitute VT in the last equation and solve for VOUT.\n- V T = 2.5 -\n- (0.43 + 0.4 ⋅( 0.6 + V OUT -\n0.6 )) = 0\nV DD - V OUT\nV OUT\nWe get VOUT=VOH=1.765V\nVOL: To calculate VOL, we set VIN=VDD=2.5V.\nWe expect VOUT to be low, so we can make the assumption that M2 will be velocity saturated and M1 will\nbe in the linear region.\nW 2\nV 2\nDSAT\nFor M2: I D2 = k' ⋅ -------- ⋅ (\n- V T) ⋅\n- -----------------⋅(1 +\n) and\nn\nL2\nV GS\nV DSAT\n\nλV DS\nW 1\nV 2\nDS\nfor M1: I D1 = k' ⋅ -------- ⋅ (\n- V T 0 ) ⋅\n- -----------\nn\nL1\nV GS\nV DS\nSetting I D1 = I D2 , we get an equation and we solve for VOUT.\nWe get: VOUT=VOL=0.263V, so our assumption holds. We have input 2.5 V instead of VOH, an assumption\nthat is often used. If we instead put VOH at the input, VOL=0.38 V and full credit was given for either solu\ntion.\nVM: To calculate VM we set VM=VIN=VOUT.\nAssuming that both transistors are velocity saturated, then we have the next pair of equations:\n\nDepletion Load Inverter\nW 1\nV 2\nDSAT\nI D1 = k' ⋅ -------- ⋅ (V M - V T 0 ) ⋅\n- -----------------⋅(1 + λV M) and\nn\nL1\nV DSAT\n\nW 2\nV 2\nDSAT\nI D2 = k' ⋅ -------- ⋅ (\n- V M - V T) ⋅\n- ----------------- ⋅(1 + (\n- V M))\nn\nL2\nV DD\nV DSAT\n\nλ V DD\nSetting I D1 = I D2 , we get for VM = 1.01 V\nb) Use HSPICE to obtain the VTC.\nSolution\nThe VTC is shown below.\n* problem 5\n2.6\n2.4\n2.2\n1.8\n1.6\n1.4\n1.2\n800m\n600m\n400m\n200m\nVoltages (lin)\nVoltage X (lin) (VOLTS)\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\n2.2\n2.4\n2.6\nc) Calculate VIH, VIL, and the noise margin and comment on the results. How can you increase the noise\nmargins and reduce the undefined region?\nSolution\nCircuit 1\nVIL = 0.5V, VIH = 1.35V\nNMH = VOH - VIH = 1.765 - 1.35 = 0.42V, NML = VIL - VOL = 0.5- 0.26 = 0.24V\nWe can increase the noise margins by moving VM closer to the middle of the output voltage swing. Some of\nyou pointed out that the VOH/VOL obtained from HSPICE does not match the value in the hand calculation.\nThis is because, due to diode and leakage currents, the output actually rises higher than VT in order to reach\nDC steady state and match all the tiny leakage currents. (These are second order effects not modeled by the\nassumption that Vout should rise to VDD-VT).\nd) Comment on the differences in the VTCs, robustness and regeneration between this inverter and a stan\n\ndard CMOS inverter.\nSolution\nIt is clear from the two VTCs, that a CMOS inverter is more robust, since the low and high noise margins are\nhigher than the first inverter. Also the regeneration in the second inverter is greater since it provides rail to\nrail output and the gain of the inverter is much greater.\nProblem 5: Inverter Gain and Regions of Operation\nFigure 0.1 shows a piecewise linear approximation for the VTC. The transition region is approximated by a straight\nline with a slope equal to the inverter gain at VM. The intersection of this line with the VOH and the VOL lines defines\nVIH and VIL.\na) The noise margins of a CMOS inverter are highly dependent on the sizing ratio, r=kp/kn, of the NMOS\nand PMOS transistors. What ratio 'r' would be required to achieve equal noise margins if the thresholds\nof NMOS and PMOS were equal and channel length modulation were ignored? Now use HSPICE and\nthe 0.25u process file to test your theory. For your simulation, use Wn=1.0 umso that Wp will just be\nequal to r*(NMOS mobility/PMOS mobility). If there is a discrepancy in the two results you obtain,\nsuggest some possible explanations.\nSolution\nThe TSMC 0.25μm models were used for simulation and the threshold voltages of NMOS and PMOS\ndevices are nearly equal in this process. A value near r=1 should result in equal noise margins, since the\ntransistors will be closely matched. HSPICE showed that the resulting noise margins for this sizing were\nNMH=0.97 V and NML=1.1 V. The mismatch is due to the fact that the PMOS threshold voltage is actually\nslightly lower, so the PMOS is stronger and the upper noise margin is reduced. In addition, the NMOS veloc\nity saturates at a lower voltage, further increasing the relative strengh of the PMOS when both devices are in\nvelocity saturation. The actual value that results in equal noise margins is r=0.83.\nb) Section 5.3.2 of the text uses this piecewise linear approximation to derive simplified expressions for\nNMH and NML in terms of the inverter gain. The derivation of the gain is based on the assumption that\nboth the NMOS and the PMOS devices are velocity saturated at VM . For what range of r is this assump\ntion valid? What is the resulting range of VM ?\nSolution\nUsing the equations for finding the region of operation, it can be shown that the PMOS and NMOS are both\nvelocity saturated only while the switching threshold is between 1.06 V and 1.10 V. Since this range may be\nconsidered inclusive, we can assume that both devices are velocity saturated and set the currents equal with\nVIN=VOUT=VM to find kp/kn . Depending on the assumptions we make when we find r, there are a range of\npossible results. Some people used the definition of r that includes variation in VDSAT for NMOS and\nPMOS, some included the effect of channel length modulation, and other combinations of the above consid\nerations. Since the problem was slightly ambiguous on this topic full credit will be given for any of the\nanswers.\nThe equation below gives kp/kn in terms of known circuit parameters. Leaving out channel-length modula\ntion results in slightly different numbers. Then, whether r is defined as kp/kn or (kp*vdsatp)/(kn*vdsatn)\nproduces two different results due to the different definitions.\n\nvdsatn\n- v\n- ----------------- [1 + λv ]\nk p\nvdsatn vm\ntn\nm\n------ = --------------------------------------------------------------------------------------------------------------------------------\nk\nv\nn\ndsatp\nv\n- vdd - vtp - ----------------- [1 + λ(v - vdd)]\ndsatp vm\nm\nTABLE OF 'r' RANGES\nVDSAT Included\nVDSAT Not Included\nLambda Included\n0.54-0.65\n0.34-0.41\nLambda Not Included\n0.58-0.71\n0.37-0.45\nSome of you, however, used the equation for r given on page 186, equation 5.6 of the text. Although you\ncoincidentally got the same numbers as one of the results above, this method isn't valid because this equa\ntion is for the case when both NMOS and PMOS are saturated, NOT velocity saturated.\nThis result can be checked by sizing the devices accordingly and testing the resulting VM in HSPICE. The\nresult gives a range of 1.04 V to 1.09 V. This makes sense, because the NMOS must be much stronger than\nthe PMOS to achieve a switching threshold near 1 V.\nc) Derive expressions for the inverter gain at VM for the cases when the sizing ratio is just above and just\nbelow the limits of the range where both devices are velocity saturated. What are the operating regions\nof the NMOS and the PMOS for each case? Consider the effect of channel-length modulation by using\nthe following expression for the small-signal resistance in the saturation region: ro,sat = 1/(λID).\nVout\nVOH\nVM\nVIL\nVIH\nVin\nFigure 0.1 A different approach to derive\nVOL\nVIL and VIH.\nSolution\nWhen V' is slightly smaller than 1.06 V, the PMOS is velocity saturated and the NMOS is saturated. Section\n5.3.2 of the text shows this derivation for the case when both devices are velocity saturated. These deriva\ntions can be completed by substituting the correct current equations and using the same method. The results\nare as follows:\nFor the case when the NMOS is saturated and the PMOS is velocity saturated:\ndV\nk (Vin - V\n)(1 + λ Vout) + k pV\n(1 + λ p(V\n- V\n))\nout\nn\ntn\nn\nDSATP\nout\nDD\n---------------- = -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nV\ndVin\nkn λ n\nDSATP\n-------------(Vin - V\n) + k pV\n- V\n- -----------------------\ntn\nDSATPλ p\nVin - V DD\ntp\n\nDropping the second order terms in the numerator, substituting Vm for Vin, and simplifying the denominator\nleads to the following expression for the gain:\ndV\nk (V\n- V\n) + k pV\nout\nn\nm\ntn\nDSATP\n---------------- = -------------------------------------------------------------------------\ndV\nID(V )(λ n - λ p)\nin\nm\nProblem 6: Static CMOS Inverter\nFor this problem use scalable CMOS design rules and assume:\nVDD = 2.5V, WP/L = 1.25/0.25, WN/L = 0.375/0.25, L=Leff =0.25μm (i.e. xd= 0μm), CL =Cinv-gate, kn' =\n115μA/V2, kp'= -30μA/V2, Vtn0 = | Vtp0 | = 0.4V, λ = 0V-1, γ = 0.4, 2|φf|=0.6V, and tox = 58A. Use the Hspice\nmodel parameters for parasitic capacitance given below (i.e. Cgd0, Cj, Cjsw), and assume that VSB=0V for all\nproblems except part (e).\nVDD = 2.5V\nL = LP = LN = 0.25μm\n-+\nVOUT\nVIN\nCL = Cinv-gate\n(Wp/Wn = 1.25/0.375)\nVSB\nFigure 4: CMOS inverter with capacitive load.\n## Parasitic Capacitance Parameters (F/m)##\nNMOS\nCGDO=3.11x10-10, CGSO=3.11x10-10, CJ=2.02x10-3, CJSW=2.75x10-10\nPMOS\nCGDO=2.68x10-10, CGSO=2.68x10-10, CJ=1.93x10-3, CJSW=2.23x10-10\na) What is the Vm for this inverter?\nSolution\nAssume that Vm is around midrail (1.25V). That means that the NMOS is velocity saturated and the PMOS\nis saturated. To find Vm, we set the sum of the currents at Vout equal to 0 using the correct equation for each\ndevice:\nV DSATn\n)2\nk ⋅V DSATn ⋅\nV M - V Tn - -------------------- + k p ⋅0.5 ⋅(V M - V DD - V Tp\n= 0. Plug in numbers:\nn\n\n172.5 ⋅ 0.6 ⋅(V M\n0.4\n-\n0.315\n-\n) + ( 150\n-\n) ⋅ 0.5 ⋅(V M\n2.5\n-\n- ( 0.4\n-\n))2 = 0\n103.5V M\n-\n\n- (-75\n\n⋅(V M\n2 - 4.2V M\n4.41\n+\n)) = 0.\nSolving this quadratic gives V M = 1.245 V.\nb) What is the effective load capacitance CLeff of this inverter? (include parasitic capacitance, refer to notes\nfor K\nand m.) Hint: You must assume certain values for the source/drain areas and perimeters since\neq\nthere is no layout. For our scalable CMOS process, λ = 0.125 μm, and the source/drain extensions are\n5λ for the PMOS; for the NMOS the source/drain contact regions are 5λx5λ.\nSolution\nThe calculation of the lumped load capacitance follows the format presented in the lecture notes. The only\ndifference is the dimensions of the devices.\nCLeff = CL + Cparasitic = Cg3 + Cg4 + Cdb1 + Cdb2 + Cgd1 + Cgd2.\nCg3 = (CGD0n + CGSOn)Wn + CoxWnL = 2(3.11e-10)(0.375e-6) + 6e-15(0.375)(0.25) = 0.796fF\nCg4 = (CGD0p + CGSOp)Wp + CoxWpL = 2(2.68e-10)(1.25e-6) + 6e-15(1.25)(0.25) = 2.545fF\nCdb1 = Keqn(ADn)Cj + Keqswn(PDn)Cjsw. Need to do this calculation for both transitions and average the\nresults. The Keq values are already calculated in the notes.\nAD =ASp=1.25um*0.625um=0.78125um2 and ADn=ASn=0.125*0.375+0.6252=0.4375um2.\np\nPD =PS =2*0.625um+1.25um=2.5um and PDn=PSn=5*0.125um*3+(2+1+1)*0.125um=2.375um.\np\np\n(0.57*0.4375*2 + 0.61*2.375*0.28) = 0.904fF for HL transition\n(0.79*0.4375*2 + 0.81*2.375*0.28) = 1.23fF for LH. Average Cdb1=1.067fF.\nCdb2 = Keqp(ADp)Cj + Keqswp(PDp)Cjsw.\n(0.79*0.78125*1.9 + 0.86*2.5*0.22) = 1.65fF for HL transition\n(0.59*0.78125*1.9 + 0.7*2.5*0.22) = 1.26fF for LH. Average Cdb2=1.455fF.\nCgd1 = 2CGD0nWn = 2*3.11e-10*0.375e-6 = 0.233fF.\nCgd2 = 2CGD0pW = 2*2.68e-10*1.25e-6 = 0.67fF.\np\nCL = sum = 6.767fF. Note - since the problem states that xd=0, it is ok if you neglected the last two parasitic\ncapacitances. We intended for them to be included, though.\nc) Calculate tPHL, tPLH assuming the result of (b) is\n= 6.5fF'. (Assume ideal step input, i.e.\n'CLeff\n=tfall=0. Do this part by computing the average current used to charge/discharge CLeff.)\ntrise\nSolution\nWe can estimate the propagation delay using the approximation ∆t = ∆Q/I, where ∆Q = CLeffVDD and I is\n\nthe average current used to charge/discharge CLeff. During the high-to-low transition CLeff is discharged\nthrough the NMOS transistor so I = IavgN. During the low-to-high transition CLeff is charged through the\nPMOS transistor so I = IavgP. In summary\nV DD\nV DD\nI ds(V o = 0) + I ds\nV o = -----------\nI ds(V o = V DD ) + I ds\nV = ----------\nV DD ⋅ CLeff\no\n≅ ------------------------------, where I avgN = ---------------------------------------------------------------------------,\n= ----------------------------------------------------------------------------------\ntdelay\nI avgP\n2 ⋅ I\navg\nTable 3 shows corresponding values for IavgN, IavgP, tPLH, and tPHL. NOTE- This solution included channel\nVo (V)\nOperation Mode\nIds (mA)\nIavg (mA)\nProp Delay (ps)\nfor tPLH\n1.25\nPMOS vel sat.\nPMOS vel sat\n0.300\n0.270\n0.285\n28.5\nfor tPHL\n2.5\n1.25\nNMOS vel sat.\nNMOS vel sat\n0.209\n0.195\n0.202\n40.0\nTable 3: Average currents and propagation delays for Problem 4(c).\nlength modulation, but it is ok if your solution did not (see problem assumptions).\nd) Find (Wp/Wn) such that tPHL = tPLH.\nSolution\nOne way to do this is to solve the current average equations for Wp/Wn after setting the propagation delays\nequal to one another. A much easier method is to sweep the widths in HSPICE. The HSPICE sim shows that\nWp/Wn =2.6 gives equal rise and fall times.\ne) Suppose we increase the width of the transistors to reduce the tPHL, tPLH. Do we get a proportional\ndecrease in the delay times? Justify your answer.\nSolution\nThe propagation delays DO NOT decrease in proportion to the widths because of self-loading effects. As the\ndevice size increases, its parasitic capacitances increase as well. In this problem, increasing device size\nincreases both average current and CLeff.\nf)\nSuppose VSB = 1V, what is the value of Vtn, Vtp, Vm? How does this qualitatively affect CLeff?\nSolution\nVtp = Vtp0 = -0.4V.\nVtn\n\n= 0.4 + γ ⋅( 2φF\n+\n\n-\n) = 0.596 V.\n\nUsing the equation for part a) and plugging in the new value of Vtn gives: VM = 1.35V\nThe increased Vsb will increase the depletion region and lower the junction capacitance, lowering CLeff.\ng) Use Magic to create a layout for this inverter. Extract the schematic, including parasitic capacitance,\nfrom the layout and use HSPICE to simulate the circuit and measure tP and the average power for the\n2φF\n\nfollowing input Vin: pulse(0 VDD 5n 0.1n 0.1n 9n 20n), as VDD varies from 1V - 2.5V with 0.25V inter\nval. [tP = (tPHL + tPLH) / 2]. Using this data, plot 'tP vs. VDD', and 'Power vs. VDD'.\nThe extracted layout will include parasitics so you need not manually include AS, AD, PS, PD in your\nspice deck, but remember to manually add CL = 6.5fF. Set VSB = 0V for this problem. Use the HSPICE\nmodel parameters which can be found in \" logic025.l \".\nSolution\nThere are many valid layouts for the inverter and you can find an example in the book. For one possible lay\nout, the simulation results are as follows. (The parasitics should be quite similar for any reasonable layout.)\n*prob4g pset1\n*prob4g pset1\n230p\n220p\n210p\n200p\n190p\n180p\n170p\nMeasures (lin)\n4u\n3.8u\n3.6u\n3.4u\n3.2u\n3u\n2.8u\n2.6u\n2.4u\n2.2u\n2u\n1.8u\n1.6u\n1.4u\n1.2u\n1u\n800n\n600n\nOuter Result (lin)\n160p\n150p\n140p\n130p\n120p\n110p\n100p\n90p\n80p\n70p\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\n1.8\n1.9\n2.1\n2.2\n2.3\n2.4\n2.5\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\n1.8\n1.9\n2.1\n2.2\n2.3\n2.4\n2.5\nOuter Result (lin) (pvdd)\nOuter Result (lin) (pvdd)\nDelay vs VDD (part g)\nPower vs VDD (part g)\nh) Using HSPICE, simulate the circuit for a set of 'pulse' inputs with rise and fall times of tin_rise,fall =1ns,\n2ns, 5ns, 10ns, 20ns. For each input, measure (1) the rise and fall times tout_rise and tout_fall of the\ninverter output, (2) the total energy lost Etotal, and (3) the energy lost due to short circuit current Eshort.\nFor measuring short circuit power, use the technique discussed in class (slide 96, Handout 2). Use the\nHSPICE model parameters which can be found in \" logic025.l\"\nUsing this data, prepare a plot of (1) (tout_rise+tout_fall)/2 vs. tin_rise,fall, (2) Etotal vs. tin_rise,fall, (3) Eshort\nvs. tin_rise,fall and (4) Eshort/Etotal vs. tin_rise,fall.\nProvide simple explanations for:\n(i) Why the slope for (1) is less than 1?\n(ii) Why Eshort increases with tin_rise,fall?\n(iii) Why Etotal increases with tin_rise,fall?\nSolution\ni) The slope is less than 1 because of the regenerative property of the inverter. The high gain around the\n\nswitching point causes the output to change faster than the inputs.\nii) The amount of time for which both devices are on simultaneously increases.\niii) Total energy increases because the short circuit energy begins to dominate, and it increases as the rise/fall\ntime increases.\n(trise+tfall)/2 vs trfin\n(trise+tfall)/2 (ns)\n0.5\n1.5\nEtotal vs trfin\nEtotal (pJ)\ntrfin (ns)\ntrfin (ns)\nEshort vs trfin\nEshort/Etotal vs trfin\n0.5\n1.5\nEshort (pJ)\n0.6\n0.7\n0.8\n0.9\nEshort/Etotal\ntrfin (ns)\ntrfin (ns)\nPlots for Problem 4(h)"
    },
    {
      "category": "Resource",
      "title": "ps1_faq.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/4e8d355cbb5c2c012df0f90fd7983248_ps1_faq.pdf",
      "content": "Problem Set #1: Updates and Frequently Asked\nQuestions\n\nNotes and Hints:\nProblem 2:\n-\nSome of you have asked about the regions of operation of the devices. Ignore the\ngiven VDD=2.5V and assume VDD is large enough that M1 does not go into\nsubthreshold or linear operation when Vo is swept to 2.5 V. (You don't even need\nto know an exact value for this particular problem since lambda=0 - just assume\nit's large enough.) Given that condition, you know enough about VGT and\nVDSAT to determine the regions of operation.\nProblem 3:\n-\nAssume VDD=1.8 V for the entire problem. (To clarify, this does NOT mean that\nthe drain is always connected to VDD! Think about the appropriate drain voltage\nfor each section of the problem.)\n-\nIn part b, don't calculate entirely by hand. Use the I-V curves to find the resistance\nfrom the HSPICE simulation.\n-\nFor parts b and c you need only to consider the case where vdd=vgs(max)=1.8V.\nFor parts a and d you may want to consider using .DATA and .MEASURE\nstatements to make your work easier.\nThe .DATA statement has syntax as follows and is used to repeat a particular\ntransition for a set of conditions: (if you have parameterized vd in a statement\n.param vd=1.8v)\n.DATA D1 vd\n+ 0.6\n+ 0.8\n+ 1.0\n+ 1.2\n+ 1.4\n+ 1.6\n+ 1.8\n\n.ENDDATA\nThen, in your transient analysis: .tran SWEEP DATA=D1 (Where step size and\nstop time are the values you have chosen. Given this parameterization, the easiest\nway to find and plot the propagation delays is to use .MEASURE statements. An\nexample of this is: .MEASURE TRAN tdf TRIG V(in) VAL='vd/2' RISE=1\nTARG V(out) VAL='vd/2' FALL=1 More documentation on how to use these\nstatements is available in the complete documentation available through the\ncourse web page.\nProblem 4:\n-\nYou will not get the same result for VOH by hand and with HSPICE. The hand\ncalculation is based on the assumption that that M2 will stop charging the output\nnode when the node reaches VDD-VT, (where VT includes body effect). In fact,\ntransistors have non-zero subthreshold current and the final output voltage in the\nsimulation is determined as several second order effects adjust the voltage to\nmake the DC currents sum to zero. So, just use your VTC from part b to answer\nthe questions in part c.\nProblem 5:\n-\nAs stated, question 5a doesn't really make sense. Please reword 5a as follows:\n\"The noise margins of a CMOS inverter are highly dependent on the sizing ratio,\nr=kp/kn, of the NMOS and PMOS transistors. What ratio 'r' would be required to\nachieve equal noise margins if the thresholds of NMOS and PMOS were equal\nand channel length modulation were ignored? Now use HSPICE and the 0.25u\nprocess file to test your theory. For your simulation, use Wn=1.0 um so that Wp\nwill just be equal to r*(NMOS mobility/PMOS mobility). If there is a discrepancy\nin the two results you obtain, suggest some possible explanations.\"\n-\nSome of you have asked about including vdsatp/vdsatn in the 'r' equation. For this\nproblem only, do just use r as defined above for part a. You can think of this as\nthe ideal case when threshold voltages, channel length modulation, and saturation\nvoltages are equal for NMOS and PMOS. Since the vdsat terms are ratioed in this\nequation leaving out the two terms is equivalent to pretending they're equal. The\nexplanation section is a good opportunity to discuss which of the prior\nassumptions might have been primarily responsible for causing any difference\nbetween your calculated 'r' in the above expression and the value you actually get\nfrom simulation.\nProblem 6:\n-\nFor the parts of the problem involving Keq, find the C values for both transistions\nand average the results to get the effective capacitance."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/5dcb80b345eaefe50da8b47366c2cc74_ps1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 1\nFall 2003\nIssued: 9/9/03\nDue: 9/18/03\nUnless otherwise specified, use the 0.25 micron libraries for all HSPICE simulations.\nProblem 1: Device Parameters\nThe data from five measurements made on a short channel NMOS device appears in Table 1. Given that\nVDSAT = 0.6 V and k' = 100 μ A/V2, calculate VT0,\n,\nγ\nλ\n\n, 2| φ F|, and W/L.\nTable 1: Measured Data for Short Channel NMOS\nMeas. Number\nVGS\nVDS\nVBS\nID(\nA)\n\nμ\n2.5\n1.8\n1.8\n2.5\n1.8\n-1\n1.8\n-2\nProblem 2: Backgate Effect\nThe circuit in Fig. 1 is known as the source follower configuration. It achieves a DC level shift between the\ninput and the output. The value of this shift is determined by the current I0. Assume xd=0, γ=0.4, 2|φf|=0.6V,\nVT0=0.43V, kn'=115μA/V2 and λ=0.\nVDD = 2.5V\nVDD = 2.5V\nIo\nVi\nM1 1um/0.25um\nM1 1um/0.25um\nVi\nVo\nVo\nVbias= 0.55V\nM2 LD=1um\nIo\n(a)\n(b)\nFigure 1: NMOS source follower configuration\n\na) Suppose we want the nominal level shift between Vi and Vo to be 0.6V in the circuit in Figure 1(a).\nNeglecting the backgate effect, calculate the width of M2 to provide this level shift (Hint: first relate Vi\nto Vo in terms of Io).\nb) Now assume that an ideal current source replaces M2 (Figure 1(b)). The NMOS transistor M1 experi\nences a shift in VT due to the backgate effect. Find VT as a function of Vo for Vo ranging from 0 to 2.5V\nwith 0.5V intervals. Plot VT vs. Vo\nc) Plot Vo vs. Vi as Vo varies from 0 to 2.5V with 0.5 V intervals. Plot two curves: one neglecting the back-\ngate effect and one accounting for it. How does the backgate effect influence the operation of the level\nconverter?\nAt Vo(with backgate effect) = 2.5V, find Vo(ideal) and thus determine the maximum error introduced by\nthe backgate effect.\nProblem 3: Velocity Saturation\nThis problem explores the behavior of short-channel devices. For the HSPICE simulations of this problem\nyou will use the 0.18u model parameters. Use the HSPICE model parameters which can be found in \"log018_1.l \"\na)\nUsing HSPICE plot ID versus VDS, for the transistor of the following figure, with VGS (0.6V, 0.8V, 1V,\nVd\nM1\nV\nWD = 0.54um\nLD = 0.18um\ng\nVs\nFigure 2: Short channel Transistor.\n1.2V, 1.4V, 1.6V, 1.8V) as a parameter. Comment on the dependence of ID with respect to VGS.\nb) Calculate the effective resistance for a high to low transition, using the method described in slide 44\n(Handout 2).\nc) Consider two CMOS inverters with (W1/L1)n=(2.88u/1.44u), (W1/L1)p=(5.76u/1.44u) and (W2/\nL2)n=(0.36u/0.18u), (W2/L2)p=(0.72u/0.18u). Assume VDD = 1.8 V and the output of the inverter is\nloaded by CL=100fF capacitance. Calculate the propagation delay tP and check the answers with\nHSPICE.\nd) Repeat part c) sweeping the supply voltage VDD from 0.4V to 1.8V (sweep step 0.2V). Plot the propa\ngation delay tPversus the supply voltage VDD in the same graph. Comment on the results.\nProblem 4: Voltage transfer characteristics, Noise Margins\nThe next figure shows an all NMOS inverter.\n\na) Calculate VOH, VOL, and VM for the new inverter.\nVDD = 2.5V\nM2 W/L=0.375/0.25\nVOUT\nVIN\nM1 W/L=0.75/0.25\nFigure 3: An Alternate Inverter Implementation\nb) Use HSPICE to obtain the VTC.\nc) Calculate VIH, VIL, and the noise margins and comment on the results. How can you increase the noise\nmargins and reduce the undefined region?\nd) Comment on the differences in the VTCs, robustness and regeneration between this inverter and a stan\ndard CMOS inverter.\nProblem 5: Inverter Gain and Regions of Operation\nThe Figure 4 shows a piecewise linear approximation for the VTC. The transition region is approximated by a\nstraight line with a slope equal to the inverter gain at VM. The intersection of this line with the VOH and the VOL\nlines defines VIH and VIL\nVout\nVOH\nVM\nVin\nVOL\nFigure 4: A Different Approach to Derive VIL and VIH\n\na) The noise margins of a CMOS inverter are highly dependent on the sizing ratio, r = kp/kn, of the NMOS\nand PMOS transistors. Use HSPICE with VTn = |VTp| to determine the value of r that results in equal\nnoise margins? Give a qualitative explanation.\nb) Section 5.3.2 of the text uses this piecewise linear approximation to derive simplified expressions for\nNMH and NML in terms of the inverter gain. The derivation of the gain is based on the assumption that\nboth the NMOS and the PMOS devices are velocity saturated at VM . For what range of r is this assump\ntion valid? What is the resulting range of VM ?\nc) Use the method from section 5.3.2 to derive an expression for the inverter gain at VM for the case when\nthe sizing ratio is chosen to place VM just below limits of the range where both devices are velocity sat\nurated. What are the operating regions of the NMOS and the PMOS?\nProblem 6: Static CMOS Inverter\nFor this problem use scalable CMOS design rules and assume:\nVDD = 2.5V, WP/L = 1.25/0.25, WN/L = 0.375/0.25, L=Leff =0.25μm (i.e. xd= 0μm), CL =Cinv-gate, kn' =\n115μA/V2, kp'= -30μA/V2, Vtn0 = | Vtp0 | = 0.4V, λ = 0V-1, γ = 0.4, 2|φf|=0.6V, and tox = 58A. Use the Hspice\nmodel parameters for parasitic capacitance given below (i.e. Cgd0, Cj, Cjsw), and assume that VSB=0V for all\nproblems except part (e).\nVDD = 2.5V\nL = LP = LN = 0.25μm\nVOUT\nVIN\nCL = Cinv-gate\n(Wp/Wn = 1.25/0.375)\n-+ VSB\nFigure 5: CMOS inverter with capacitive load.\n## Parasitic Capacitance Parameters (F/m)##\nNMOS\nCGDO=3.11x10-10, CGSO=3.11x10-10, CJ=2.02x10-3, CJSW=2.75x10-10\nPMOS\nCGDO=2.68x10-10, CGSO=2.68x10-10, CJ=1.93x10-3, CJSW=2.23x10-10\na) What is the Vm for this inverter?\nb) What is the effective load capacitance CLeff of this inverter? (include parasitic capacitance, refer to notes\nfor Keq and m.) Hint: You must assume certain values for the source/drain areas and perimeters since\nthere is no layout. For our scalable CMOS process, λ = 0.125 μm, and the source/drain extensions are\n5λ for the PMOS; for the NMOS the source/drain contact regions are 5λx5λ.\n\nc) Calculate tPHL, tPLH assuming the result of (b) is 'CLeff = 6.5fF'. (Assume ideal step input, i.e.\ntrise =tfall=0. Do this part by computing the average current used to charge/discharge CLeff.)\nd) Find (Wp/Wn) such that tPHL = tPLH.\ne) Suppose we increase the width of the transistors to reduce the tPHL, tPLH. Do we get a proportional\ndecrease in the delay times? Justify your answer.\nf)\nSuppose VSB = 1V, what is the value of Vtn, Vtp, Vm? How does this qualitatively affect CLeff?\ng) Use Magic to create a layout for this inverter. Extract the schematic, including parasitic capacitance,\nfrom the layout and use HSPICE to simulate the circuit and measure tP and the average power for the\nfollowing input Vin: pulse(0 VDD 5n 0.1n 0.1n 9n 20n), as VDD varies from 1V - 2.5V with 0.25V inter\nval. [tP = (tPHL + tPLH) / 2]. Using this data, plot 'tP vs. VDD', and 'Power vs. VDD'.\nThe extracted layout will include parasitics so you need not manually include AS, AD, PS, PD in your\nspice deck, but remember to manually add CL = 6.5fF. Set VSB = 0V for this problem. Use the HSPICE\nmodel parameters which can be found in \" logic025.l \".\nh) Using HSPICE, simulate the circuit for a set of 'pulse' inputs with rise and fall times of tin_rise,fall =1ns,\n2ns, 5ns, 10ns, 20ns. For each input, measure (1) the rise and fall times tout_rise and tout_fall of the\ninverter output, (2) the total energy lost Etotal, and (3) the energy lost due to short circuit current Eshort.\nFor measuring short circuit power, use the technique discussed in class (slide 96, Handout 2). Use the\nHSPICE model parameters which can be found in \" logic025.l \"\nUsing this data, prepare a plot of (1) (tout_rise+tout_fall)/2 vs. tin_rise,fall, (2) Etotal vs. tin_rise,fall, (3) Eshort\nvs. tin_rise,fall and (4) Eshort/Etotal vs. tin_rise,fall.\nProvide simple explanations for:\n(i) Why the slope for (1) is less than 1?\n(ii) Why Eshort increases with tin_rise,fall?\n(iii) Why Etotal increases with tin_rise,fall?"
    },
    {
      "category": "Resource",
      "title": "ps2_03_sola.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/db1e3c55a52e7f79096b7dfa6d35a80d_ps2_03_sola.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 2 Solutions\nFall 2003\nIssued: 9/18/03\nDue: 9/30/03\nFor these problems you should use the parameters for the 0.25 technology (given in the text) unless\notherwise specified for a particular problem.\nProblem 1: Subthreshold Inverter Operation\nIn circuit applications where extremely low power consumption is essential and high speed operation is not\nrequired, subthreshold logic may provide an ideal solution. This problem will explore how far the supply\nvoltage may be lowered before a CMOS inverter fails. For the entire problem, assume that the both devices\nare minimum length and that the NMOS device has a width of 0.44 um. Failure is defined as the point where\nan input swing of 0 to VDD produces an output swing less than 10% to 90% of VDD. For this problem use\nthe 0.18 micron technology file which is located in \"/mit/6.374/models/log018_1.l\". (Research by Alice\nWang)\na)\nConsider the case where the input to the inverter is 0 V. Will the output voltage remain equal to the sup-\nply voltage as the supply voltage is lowered to arbitrarily low values? If not, explain what will happen\nand why. Would using a wider PMOS device increase or decrease the minimum possible supply volt-\nage? Which process corner (TT, FF, SS, SF, or FS) will be the worst case and why? (Variable process\nconditions may result in a case where the NMOS and PMOS devices have modified mobilities. TT is the\ncase where both devices are typical, SF has slow NMOS and fast PMOS, etc...)\nSolution\nWhen the input is 0 V, Vgs for the NMOS device is 0V and Vgs for the PMOS is -VDD. For typical supply\nvoltages, the current through the PMOS in this case dominates and the output is pulled to VDD. As VDD\nfalls to lower voltages, eventually pushing the PMOS into subthreshold the currents will eventually begin to\napproach comparable levels and the simple CMOS inverter will become a ratioed circuit. Using a wider\nPMOS would decrease the minimum possible supply voltage since this would increase the strength of the\nPMOS relative to the NMOS and allow the PMOS current to overpower the NMOS for lower supply volt-\nages. FS would be the worst case process corner, since the PMOS is weakened in comparison to the NMOS\nand looses some ability to pull up the output node. So, for a given supply voltage there is a minimum width\nrequirement on the PMOS to maintain proper operation and the minimum size is largest for the FS corner.\nb)\nConsider the case where the input to the inverter is VDD. Would using a wider PMOS increase or\ndecrease the minimum supply voltage in this case? Which process corner will be the worst case and\nwhy?\nSolution\nIn this case, Vgs for the PMOS is 0 V and Vgs for the NMOS is lowered with supply voltage. Using a wider\n\nPMOS would increase the minimum supply voltage since the PMOS would be stronger and have more leak-\nage current to pull the output up from its desired value of 0 V. The worst case corner would be SF since this\nwould also increase the output voltage for a given supply voltage. So for a given supply voltage, there is a\nmaximum width for the PMOS to maintain proper operation and the maximum width is smallest for the SF\ncorner. Comparing the results for parts a and b, it is clear that since one case requires large PMOS and one\ncase requires small PMOS there must be an optimum PMOS size to operate at the lowest possible supply\nvoltage.\nc)\nNow, use HSPICE to simulate the inverter and find the lowest possible supply voltage. Complete one\nsimulation for each input value using the process corners you chose in parts a and b. Use a .DATA state-\nment to vary the width of the PMOS device across the set {0.5u, 1u, 1.5u, 2u, 4u, 8u, 10u, 15u, 30u,\n45u, 60u} and sweep VDD from 100mV to 400 mV. Then, using the expressions function in AWaves,\nplot the ratio of V(out)/VDD. The points where the ratio crosses 0.1 and 0.9 are the failure points. Cre-\nate a table with three columns containing: PMOS width, minimum supply voltage for the case where the\ninput voltage equals 0, and minimum supply voltage for the case where the input voltage equals VDD.\nd)\nNow use your favorite graphing program (Matlab, Excel, etc....) to create a graphical representation for\nthe functional region of operation. On a single graph, plot both cases of (minimum supply voltage,\nPMOS width) and indicate the region where both conditions are met. What is the lowest possible supply\nvoltage that meets both conditions? What must the PMOS width be to operate at this supply voltage?\nThe mimimum supply voltage is about 190 mV and the PMOS must be about 5 um.\nPMOS\nWidth\n0.5u\n1.0u\n1.5u\n2u\n4u\n8u\n10u\n15u\n30u\n45u\n60u\nMin. VDD\n(Vin=VDD\n118m\n120m\n134m\n150m\n184m\n213m\n221m\n235m\n260m\n274m\n284m\nMin. VDD\n(Vin=0)\n275m\n273m\n256m\n238m\n201m\n172m\n163m\n150m\n128m\n115m\n107m\nSupply Voltage (mV)\nPMOS W\n(um)\nOperational\nRegion\nMin. PMOS W\nVin=0/Corner=FS\nMax. PMOS W\nVin=VDD\nCorner=SF\nMinimum VDD\nVDD=190 mV\nW=5um\n\nProblem 2: CMOS Logic\nConsider the following CMOS logic circuits:\na)\nDo the two circuits in Figure 0.1 implement the same logic function? If yes, what is that logic function?\nIf no, give Boolean expressions for both circuits.\nSolution\nYes, they implement the same logic function : F = (ABCD + E) = (A + B + C + D).E\nb)\nAssuming we can ignore all second order effects, do these two circuits have the same output resistances\nwhen driven with the same input patterns?\nSolution\nYes, they do. The pull down networks are identical and the pull up network can be found by inspection to\nhave the same resistances given the same input pattern.\nc)\nAssume the transistors have been sized to give a worst case output resistance of 13 kΩfor the worst-\ncase input pattern. What input patterns (A-E) give the lowest output resistance when the output is low?\nWhat is the value of that resistance?\nSolution\nThe lowest output resistance is obtained when all inputs (A, B, C, D and E) are equal to 1. In that case, the\noutput resistance is the parallel of the resistance of a NMOS of width 1, with a series of four equal nMOS of\nwidth 4. Both combinations have the same resistance, equal to the worst-case output resistance, 13 k\n.\nThen the output resistance, in this case, is half this value, 6.5 k\n.\nd)\nWhat input patterns (A-E) give the lowest output resistance when the output is high? What is the value\nof that resistance?\nVDD\nD\nA\nF\nE\nB\nC\nB\nC\n6 D\nA\nE\nVDD\nD\nA\nF\nE\nB\nC\nB\nC\n6 D\nA\nE\nCircuit A\nCircuit B\nFigure 0.1: Two static\nCMOS gates.\nΩ\nΩ\n\nSolution\nThe lowest output resistance is obtained when all inputs are equal to zero. Each of the PMOS have the same\nwidth, so all of them have the same resistance. The worst case resistance happens when only one of the\ninputs (A, B, C or D) is equal to 0 while all the rest are equal to 1. The output resistance in that case is the\nseries of the resistance of two of the PMOS and it is equal to 13 k\n. Then, each of the pMOS has an output\nresistance equal to 6.5 k\n. The output resistance is equal to the series of one of these resistance with the\nparallel of four of the same resistnaces. Then, the minimum output resistance is 6.5 k\n+ 6.5 k\n/4 =\n8.125 k\n.\ne)\nNeglecting parasitics and assuming a load capacitance of 100 fF, find the best case and worst case tplh\nand tphl.\nSolution\nWe can use the RC time constant method of t=0.69*Req*CL . For the worst case, R=13 K for both pull-up\nand pull-down and the tplh and tphl are both equal to 0.9 ns. For the best case tphl we know that R=6.5 K so\ntphl=0.45 ns. For the best case tplh we know that R=8.125 K so tplh=0.56 ns.\nf)\nNow consider a few second order effects on the propagation delays. Which circuit is optimized for the\ncase when it is known a priori that E will be the last input to arrive and why? How will body effect influ-\nence the performance of Circut A vs. Circut B?\nSolution\nCircuit B is optimized for the case when 'E' will arrive last. The only difference between the two circuits is\nthe pull up network. The nodes between (ABCD) and (E) can use the time before E arrives to charge up to\nVDD therefore reducing the time required for the overal circuit to charge after E does arrive. Circuit B is\nalso preferable due to the lower influence of body effect. All four parallel devices in Circuit A may experi-\nence an increase in threshold voltage and consequent decrease in drive strength due to body effect.\ng)\nFor parts g and h, consider only Circuit B. Each intermediate node has some parasitic capacitance that\nmust be charged and discharged at each transition. Therefore, the propagation delay is a function of both\nthe initial voltage conditions on the internal nodes and the inputs. The inital voltage conditions, how-\never, are determined by the previous inputs. Which set of previous and current inputs will cause the\nslowest tplh? Which will cause the slowest tphl?\nSolution\nFor the worst case low-to-high output transition, all internal caps should initially be discharged to ground\nwhich gives a worst case previous input of[ABCDE]=[11110]. Then, the following input should leave all of\nthose capacitances exposed to the output node so [ABCDE]=[11100]. For the high-to-low transition, we\nshould have [ABCDE]=[11100] as the previous input to charge up the internal nodes, then\n[ABCDE]=[11110] to discharge through a single path only.\nh)\nLet all devices be minimum length and set the widths according to the relative scale in the diagram with\n1=0.375 um, specify your source and drain areas and perimiters, and include an additional 10 fF load.\nUse Nanosim to verify functionality by creating an input file which tests the following set of inputs\n[ABCDE]=[00000, 00001, 11110, 11100, 11111]. Verify that your simulated output values match the\nexpected logic function. Submit your Nanosim output file.\nSolution\nΩ\nΩ\nΩ\nΩ\nΩ\n\nYour output file should show that, for the input list above, the output should be [OUT]=[1, 0, 0, 1, 0]\nProblem 3: Pseudo-NMOS Logic\nConsider the circuit of Figure 0.2.\na)\nWhat is the output voltage if only one input is high? If all four inputs are high?\nSolution\nConsider a case when one input is high: A = VDD and B = C = D = 0 V. Assume that Vout is small enough that\nVmin = VDSAT for the PMOS device, and Vmin = VDS = Vout for the NMOS devices. Solve for Vout by setting\nthe drain currents in the PMOS and NMOS equal to each other, |IDP| = |IDN|, where the drain currents are\nfunctions of Vout, VDD, and the device parameters.\nVout = 102 mV, and ID = 35.7 μA.\nNow verify that the assumptions for Vmin are correct. For the PMOS: VDS = -2.34 V, VDSAT = -1 V, VGT = -\n2.1 V, therefore Vmin = VDSAT. For the NMOS: VDS = 102mV, VDSAT = 630mV, VGT = 2.07 V, therefore Vmin\n= VDS.\nConsider the case when all inputs are high: A = B = C = D = VDD. For these hand calculations, this is numer-\nically equivalent to a circuit with a single NMOS device with W/L = 4*1.5 and its gate tied to VDD. Now, the\nanalysis used above for the case when one device is on can be reused, replacing W/L of the NMOS with 6,\nand using the same assumptions for Vmin. Vout = 25 mV, and ID = 35.9 μA. The assumptions for Vmin are cor-\nrect.\nb)\nWhat is the average static power consumption if, at any time, each input turns on with an (independent)\nprobability of 0.5? 0.1?\nSolution\nNotice in part a) that the drain current in the PMOS is 35.7 μA with one NMOS on and 35.9 μA with four\nNMOS devices on. The current in the PMOS can be approximated as 35.8 μA when any number of NMOS\ndevices are on and 0 μA when all four are off. The probability that all four NMOS devices are off is (1-ρ)4\nwhere ρ is the probability an input is high. Therefore,\nwhere POFF = 0 W, and PON = 89.5 μW. PAVG = 83.9 μW when ρ = 0.5 and PAVG = 30.7 μW when ρ = 0.5.\nc)\nCompare your analytically obtained results to a SPICE simulation.\nSolution\nFrom SPICE: Vout = 98.7 mV, and ID = 38.2 μA with one NMOS device on and Vout = 23.5 mV, and ID =\nID\nk′ W\nL-----\nVGT\nVmin\n⋅\nVmin\n-----------------\n-\n\nλ V DS\n⋅\n+\n(\n)\n⋅\n⋅\n⋅\n=\nPAVG\nPOFF\nρ\n-\n(\n)4\n⋅\nPON\nρ\n-\n(\n)4\n-\n[\n]\n⋅\n+\n=\n\n38.3 μA with all NMOS devices on\nProblem 4: Pass Transistor Logic and Level Restoration\nConsider the circuit of Figure 0.3. Assume the inverter switches ideally at VDD/2, neglect body effect, chan-\nnel length modulation and all parasitic capacitance throughout this problem.\na)\nWhat is the logic function performed by this circuit?\nSolution\nThe circuit is a NAND gate.\nb)\nExplain why this circuit has non-zero static dissipation.\nSolution\nWhen A=B= VDD, the voltage at node x is VX=VDD-VtN. This causes static power dissipation at the inverter\nthe pass transistor network is driving.\nc)\nUsing only just 1 transistor, design a fix so that there will not be any static power dissipation. Explain\nhow you chose the size of the transistor.\nSolution\nA\nB\nVDD\nF\nC\nD\nFigure 0.2 Pseudo-NMOS gate.\n(W/L) = 1.5\n(W/L) = 0.6\nM2\nM1\nMn1\nB\nVDD\nx\nMn2\nA\nB\nOut\nFigure 0.3 Level restoring circuit.\nVDD = 2.5V\n(W/L)2 = 1.5um/0.25um\n(W/L)1 = 0.5um/0.25um\n(W/L)ni = 0.5um/0.25um\nkn' = 115uA/V2, kp' = -30uA/V2\nVtN = 0.43V, VtP = -0.4V\nPass Transistor Network\n\nThe modified circuit is shown in the next figure\n.\nThe size of Mr should be chosen so that when one of the inputs A or B equals 0, either Mn1 or Mn2, would be\nable to pull node X to VDD/2 or less.\nd)\nImplement the same circuit using transmission gates.\nSolution\nThe circuit is shown below.\ne)\nReplace the pass-transistor network in Figure 0.3 with a pass transistor network that computes the fol-\nlowing function: x = ABC at the node x. Assume you have the true and complementary versions of the\nthree inputs A,B and C.\nSolution\nOne possible implementation is shown:\nM2\nM1\nMn1\nB\nVDD\nx\nMn2\nA\nB\nOut\nMr\nVDD\nB\nA\nB\nOut\n\nProblem 5: Device Modeling - DIBL\nThe standard equation for modeling subthreshold leakage current given in the notes is\n.\nThis equation does not account for higher order effects like DIBL. The following BSIM equation adds the DIBL\neffect to the model:\n.\nUsing this new equation, we will produce a model for the subthreshold leakage in the 0.25\nm process used in\n6.374.\na) Using HSPICE, plot Id vs VGS for a single NMOS device with VD = VDD = 2.5V and W/L = 0.5um/0.25um.\nWe are only interested in the subthreshold region, so sweep VGS over the appropriate range.\nUsing HSPICE, plot Id vs VDS for VGS=0V over the full range of VDS. Plot the current on a log scale for both\nplots.\nYou will need to extract the points along these curves to use in your favorite analysis program (ie Matlab) for the\nrest of this problem. The following statement in HSPICE prints a table of the sweeping value and the current\nthrough a MOSFET to the HSPICE output stream: .print dc i(Mn1)\nB\nA\nC\nC\nC\nB\nB\nABC\nI d\nI o e\nV GS\nV T\n-\nnV th\n------------------------\ne\nV\n-\nDS\nV th\n-------------\n-\n\n⋅\n⋅\n=\nI d\nI o e\nV GS\nV To\n-\nγ' V SB\n⋅\n(\n)\n-\nη V DS\n⋅\n+\nnV th\n--------------------------------------------------------------------------------\ne\nV\n-\nDS\nV th\n-------------\n-\n\n⋅\n⋅\n=\nμ\n\nSOLUTION:\nb) Using the data from the Io vs VGS plot, extract a value for S, the subthreshold slope, in mV/decade. Plot S as it\nvaries with VGS. Over which range of VGS is S likely to be the most accurate for modeling? Plot \"instantaneous\nn\" as it varies with S. Over which range is it likely to be accurate for modeling?\nSOLUTION:\nThe slope of the curve in the Id vs VGS plot is 1/S. To find S, we need to find the slope of the curve and then take\nits inverse. We cannot calculate the derivative directly because we want S to be in units of mV/decade. Thus we\ntake the log of the current before finding the slope (notice that we can plot the log10(Id) vs VGS on a linear scale\nand get the same shape curve as in the simulation plot above). The following expression then gives the subthresh-\nold slope in mV/decade:\n. In Matlab, this might look like: S = delV./diff(log10(Id));\nwhere delV is the voltage step in mV. We can solve for \"instantaneous n\" using S=nVthln(10). The plots for S and\n\"instantaneous\" n appear on the following page. The region of interest is clearly the right side of the graph (VGS\nabout 0.15V and above). The rise in S at low voltages comes from the tail-up of current. This increase in current\nat low VGS and high VDS results from the GIDL effect (Gate Induced Diode Leakage). For modeling purposes,\nwe will select a value of S and n from the regions of the plots where the slope is more constant.\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0.45\n-12\n-11\n-10\n-9\n-8\n-7\n-6\nId vs VGS for NFET\nVGS (V)\nId (A)\n0.5\n1.5\n2.5\n-13\n-12\n-11\nId vs VDS for NFET\nVDS (V); VGS=0\nId (A)\nPlots of simulated subthreshold current vs VGS and vs VDS.\nS\n∆V\n∆\nI d\n(\n)\nlog\n----------------------\n=\n\nc) Now we will construct a model for the subthreshold behavior of the FET using the BSIM equation. This model\nshould accurately represent the behavior of the FET that you saw in part a). The BSIM equation still is a reason-\nably low order model, so do not expect your final result to match the plots precisely - just try for a ballpark\nmatch. To develop the model, you need to select three parameters: n, Io, and\n. The value for n should be some-\nwhere in the range that you plotted in b). Select Io so that the drain current supplied by the model matches the\nsimulated value at VGS=VT0.\nHints: Pick an initial value for\nand use it with your estimates for n and Io in the model equation for varying\nVDS.\ncontrols the slope of the curve versus VDS. Once the slopes are roughly equivalent, use your estimate of\nto find the current while sweeping VGS. Select values of n and Io that give a good fit. Now use those values in\nthe other case to refine your choice of\n. Iterate this process a few times until you are satisfied with the models.\nIt is helpful to convince yourself (by experimentation or from the equation) of the effects of the different param-\neters on the current. Remember, there is a range of \"right\" answers to this part of the problem. Also, be glad you\ndon't do this for a living :)\nTurn in a plot of Io vs VGS with the real data and the model data on the same plot. Do the same for Io vs VDS.\nWhat were your values for Io, n, and\n? Comment briefly on what you consider to be a \"good\" fit using this\nmodel for this process (ie - is it more important to get the slope right or the actual values? is it better to overesti-\nmate or underestimate the current? etc). Why is your model a good choice?\nWe selected n = 1.55,\n= 0.019, and Io = 1.0715E-7A. The choice of Io causes the subthreshold current to\nmatch the simulated value at VGS=VT0 for our choice of\nand n. We selected n such that the difference between\nthe model and the simulation was very small at VGS=0. This allows our model for varying VDS to match more\nclosely in magnitude. This approach may not be ideal, however. By matching the magnitude of the current at\nVGS=0, we actually do a fairly poor job of matching the slope of the curve vs VGS. If matching the magnitude of\nthe curve vs VDS is not so important, we could do a better job of matching the slope vs VGS. Also, the choice of\nchanges the slope of the curve as VDS varies. Again, different choices of this parameter allow a better match\nover different regions of the curve. You see that the limitations of this model force some trade-offs in the decision\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0.45\nS vs VGS\nVGS (V)\nS (mV/decade)\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0.45\n1.5\n2.5\n3.5\n\"instantaneous\" n vs VGS\nVGS (V)\n\"instantaneous\" n\nPlot of S vs VGS.\nPlot of \"instantaneous n\" vs VGS.\nη\nη\nη\nη\nη\nη\nη\nη\nη\n\nabout the \"best match\".\nProblem 6: DCVSL Gate Design\na)\nImplement the function S = ABC + ABC + ABC + ABC using transmission gate logic. What function\ndoes this circuit implement.\nSolution\nThis is the 'Sum' bit of a one bit carry-in adder. A pass transistor implementation is shown below. The trans-\nmission gate implementation you designed will have a PMOS in parallel with each NMOS driven by the\ncomplement of the signal that drives the NMOS.\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0.45\n-12\n-11\n-10\n-9\n-8\n-7\n-6\nModel and Id versus VGS\nVGS (V)\nCurrent (A)\nMeasured Id\nModeled Id\n0.5\n1.5\n2.5\n-13\n-12\n-11\n-10\nModel and Id versus VDS\nVDS (V)\nCurrent (A)\nMeasured Id\nModeled Id\nModels and Simulated Data.\nB\nB\nA\nC\nA\nA\nA\nC\nS\nPass Gate Implementation\n\nb)\nNow, design a DCVSL gate which implements the same function. Assume A, B, C, and their comple-\nments are available as inputs.\nSolution\nOne implementation of this circuit is shown on page 50 of Handout #3.\nc)\nSimulate your DCVSL implementation in HSPICE with 30 fF load capacitance on each output. Assume\nthat W/L = 0.5u/0.25u for all NMOS transistors and W/L = 2u/0.25u for all PMOS. Does your circuit\nwork? If not, explain why and resize the PMOS devices to fix the problem.\nSolution\nThe circuit will not work with this sizing because the PMOS is too large and the NMOS pull-down network\nwill be unable to pull the outputs down to the required value for switching to occur. A more reasonable size\nfor the PMOS is around 0.5 um.\nd)\nAssuming W/L = 0.5u/0.25u for all nmos transistors and W/L = WP/0.25u for the pmos transistors\n(where WP is the value you chose in part c), produce a layout of the gate using Magic. Your layout\nshould conform to the following datapath style: (1) Inputs should enter the layout from the left in poly-\nsilicon; (2) The outputs should exit the layout at the right in polysilicon (since the outputs would proba-\nbly be driving transistor gate inputs of the next cell to the right); (3) Power and ground lines should run\nvertically in metal 1. Extract and simulate your circuit to verify functionality.\nSolution\nOne possible layout is shown below:"
    },
    {
      "category": "Resource",
      "title": "ps2_03a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/96cc4bebc5562f2f09f06285fa18f05b_ps2_03a.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 2\nFall 2003\nIssued: 9/18/03\nDue: 9/30/03\nFor these problems you should use the parameters for the 0.25 technology (given in the text) unless\notherwise specified for a particular problem.\nProblem 1: Subthreshold Inverter Operation\nIn circuit applications where extremely low power consumption is essential and high speed operation is not\nrequired, subthreshold logic may provide an ideal solution. This problem will explore how far the supply\nvoltage may be lowered before a CMOS inverter fails. For the entire problem, assume that the both devices\nare minimum length and that the NMOS device has a width of 0.44 um. Failure is defined as the point where\nan input swing of 0 to VDD produces an output swing less than 10% to 90% of VDD. For this problem use\nthe 0.18 micron technology file which is located in \"/mit/6.374/models/log018_1.l\". (Research by Alice\nWang)\na)\nConsider the case where the input to the inverter is 0 V. Will the output voltage remain equal to the sup-\nply voltage as the supply voltage is lowered to arbitrarily low values? If not, explain what will happen\nand why. Would using a wider PMOS device increase or decrease the minimum possible supply volt-\nage? Which process corner (TT, FF, SS, SF, or FS) will be the worst case and why? (Variable process\nconditions may result in a case where the NMOS and PMOS devices have modified mobilities. TT is the\ncase where both devices are typical, SF has slow NMOS and fast PMOS, etc...)\nb)\nConsider the case where the input to the inverter is VDD. Would using a wider PMOS increase or\ndecrease the minimum supply voltage in this case? Which process corner will be the worst case and\nwhy?\nc)\nNow, use HSPICE to simulate the inverter and find the lowest possible supply voltage. Complete one\nsimulation for each input value using the process corners you chose in parts a and b. Use a .DATA state-\nment to vary the width of the PMOS device across the set {0.5u, 1u, 1.5u, 2u, 4u, 8u, 10u, 15u, 30u,\n45u, 60u} and sweep VDD from 100mV to 400 mV. Then, using the expressions function in AWaves,\nplot the ratio of V(out)/VDD. The points where the ratio crosses 0.1 and 0.9 are the failure points. Cre-\nate a table with three columns containing: PMOS width, minimum supply voltage for the case where the\ninput voltage equals 0, and minimum supply voltage for the case where the input voltage equals VDD.\nd)\nNow use your favorite graphing program (Matlab, Excel, etc....) to create a graphical representation for\nthe functional region of operation. On a single graph, plot both cases of (minimum supply voltage,\nPMOS width) and indicate the region where both conditions are met. What is the lowest possible supply\nvoltage that meets both conditions? What must the PMOS width be to operate at this supply voltage?\n\nProblem 2: CMOS Logic\nConsider the following CMOS logic circuits:\na)\nDo the two circuits in Figure 0.1 implement the same logic function? If yes, what is that logic function?\nIf no, give Boolean expressions for both circuits.\nb)\nAssuming we can ignore all second order effects, do these two circuits have the same output resistances\nwhen driven with the same input patterns?\nc)\nAssume the transistors have been sized to give a worst case output resistance of 13 kΩfor the worst-\ncase input pattern. What input patterns (A-E) give the lowest output resistance when the output is low?\nWhat is the value of that resistance?\nd)\nWhat input patterns (A-E) give the lowest output resistance when the output is high? What is the value\nof that resistance?\ne)\nNeglecting parasitics and assuming a load capacitance of 100 fF, find the best case and worst case tplh\nand tphl.\nf)\nNow consider a few second order effects on the propagation delays. Which circuit is optimized for the\ncase when it is known a priori that E will be the last input to arrive and why? How will body effect influ-\nence the performance of Circut A vs. Circut B?\ng)\nFor parts g and h, consider only Circuit B. Each intermediate node has some parasitic capacitance that\nmust be charged and discharged at each transition. Therefore, the propagation delay is a function of both\nthe initial voltage conditions on the internal nodes and the inputs. The inital voltage conditions, how-\never, are determined by the previous inputs. Which set of previous and current inputs will cause the\nslowest tplh? Which will cause the slowest tphl?\nh)\nLet all devices be minimum length and set the widths according to the relative scale in the diagram with\n1=0.375 um, specify your source and drain areas and perimiters, and include an additional 10 fF load.\nVDD\nD\nA\nF\nE\nB\nC\nB\nC\n6 D\nA\nE\nVDD\nD\nA\nF\nE\nB\nC\nB\nC\n6 D\nA\nE\nCircuit A\nCircuit B\nFigure 0.1: Two static\nCMOS gates.\n\nUse Nanosim to verify functionality by creating an input file which tests the following set of inputs\n[ABCDE]=[00000, 00001, 11110, 11100, 11111]. Verify that your simulated output values match the\nexpected logic function. Submit your Nanosim output file.\nProblem 3: Pseudo-NMOS Logic\nConsider the circuit of Figure 0.2.\na)\nWhat is the output voltage if only one input is high? If all four inputs are high?\nb)\nWhat is the average static power consumption if, at any time, each input turns on with an (independent)\nprobability of 0.5? 0.1?\nc)\nCompare your analytically obtained results to a SPICE simulation.\nProblem 4: Pass Transistor Logic and Level Restoration\nConsider the circuit of Figure 0.3. Assume the inverter switches ideally at VDD/2, neglect body effect, chan-\nnel length modulation and all parasitic capacitance throughout this problem.\na)\nWhat is the logic function performed by this circuit?\nb)\nExplain why this circuit has non-zero static dissipation.\nA\nB\nVDD\nF\nC\nD\nFigure 0.2 Pseudo-NMOS gate.\n(W/L) = 1.5\n(W/L) = 0.6\nM2\nM1\nMn1\nB\nVDD\nx\nMn2\nA\nB\nOut\nFigure 0.3 Level restoring circuit.\nVDD = 2.5V\n(W/L)2 = 1.5um/0.25um\n(W/L)1 = 0.5um/0.25um\n(W/L)ni = 0.5um/0.25um\nkn' = 115uA/V2, kp' = -30uA/V2\nVtN = 0.43V, VtP = -0.4V\nPass Transistor Network\n\nc)\nUsing only just 1 transistor, design a fix so that there will not be any static power dissipation. Explain\nhow you chose the size of the transistor.\nd)\nImplement the same circuit using transmission gates.\ne)\nReplace the pass-transistor network in Figure 0.3 with a pass transistor network that computes the fol-\nlowing function: x = ABC at the node x. Assume you have the true and complementary versions of the\nthree inputs A,B and C.\nProblem 5: Device Modeling - DIBL\nThe standard equation for modeling subthreshold leakage current given in the notes is\n.\nThis equation does not account for higher order effects like DIBL. The following BSIM equation adds the DIBL\neffect to the model:\n.\nUsing this new equation, we will produce a model for the subthreshold leakage in the 0.25\nm process used in\n6.374.\na) Using HSPICE, plot Id vs VGS for a single NMOS device with VD = VDD = 2.5V and W/L = 0.5um/0.25um.\nWe are only interested in the subthreshold region, so sweep VGS over the appropriate range.\nUsing HSPICE, plot Id vs VDS for VGS=0V over the full range of VDS. Plot the current on a log scale for both\nplots.\nYou will need to extract the points along these curves to use in your favorite analysis program (ie Matlab) for the\nrest of this problem. The following statement in HSPICE prints a table of the sweeping value and the current\nthrough a MOSFET to the HSPICE output stream: .print dc i(Mn1)\nb) Using the data from the Io vs VGS plot, extract a value for S, the subthreshold slope, in mV/decade. Plot S as it\nvaries with VGS. Over which range of VGS is S likely to be the most accurate for modeling? Plot \"instantaneous\nn\" as it varies with S. Over which range is it likely to be accurate for modeling?\nc) Now we will construct a model for the subthreshold behavior of the FET using the BSIM equation. This model\nshould accurately represent the behavior of the FET that you saw in part a). The BSIM equation still is a reason-\nably low order model, so do not expect your final result to match the plots precisely - just try for a ballpark\nmatch. To develop the model, you need to select three parameters: n, Io, and\n. The value for n should be some-\nwhere in the range that you plotted in b). Select Io so that the drain current supplied by the model matches the\nsimulated value at VGS=VT0.\nHints: Pick an initial value for\nand use it with your estimates for n and Io in the model equation for varying\nVDS.\ncontrols the slope of the curve versus VDS. Once the slopes are roughly equivalent, use your estimate of\nto find the current while sweeping VGS. Select values of n and Io that give a good fit. Now use those values in\nthe other case to refine your choice of\n. Iterate this process a few times until you are satisfied with the models.\nIt is helpful to convince yourself (by experimentation or from the equation) of the effects of the different param-\nI d\nI o e\nV GS\nV T\n-\nnV th\n------------------------\ne\nV\n-\nDS\nV th\n-------------\n-\n\n⋅\n⋅\n=\nI d\nI o e\nV GS\nV To\n-\nγ' V SB\n⋅\n(\n)\n-\nη V DS\n⋅\n+\nnV th\n--------------------------------------------------------------------------------\ne\nV\n-\nDS\nV th\n-------------\n-\n\n⋅\n⋅\n=\nμ\nη\nη\nη\nη\nη\n\neters on the current. Remember, there is a range of \"right\" answers to this part of the problem. Also, be glad you\ndon't do this for a living :)\nTurn in a plot of Io vs VGS with the real data and the model data on the same plot. Do the same for Io vs VDS.\nWhat were your values for Io, n, and\n? Comment briefly on what you consider to be a \"good\" fit using this\nmodel for this process (ie - is it more important to get the slope right or the actual values? is it better to overesti-\nmate or underestimate the current? etc). Why is your model a good choice?\nProblem 6: DCVSL Gate Design\na)\nImplement the function S = ABC + ABC + ABC + ABC using transmission gate logic. What function\ndoes this circuit implement?\nb)\nNow, design a DCVSL gate which implements the same function. Assume A, B, C, and their comple-\nments are available as inputs.\nc)\nSimulate your DCVSL implementation in HSPICE with 30 fF load capacitance on each output. Assume\nthat W/L = 0.5u/0.25u for all PMOS transistors and W/L = 2u/0.25u for all PMOS. Does your circuit\nwork? If not, explain why and resize the PMOS devices to fix the problem.\nd)\nAssuming W/L = 0.5u/0.25u for all nmos transistors and W/L = WP/0.25u for the pmos transistors\n(where WP is the value you chose in part c), produce a layout of the gate using Magic. Your layout\nshould conform to the following datapath style: (1) Inputs should enter the layout from the left in poly-\nsilicon; (2) The outputs should exit the layout at the right in polysilicon (since the outputs would proba-\nbly be driving transistor gate inputs of the next cell to the right); (3) Power and ground lines should run\nvertically in metal 1. Extract and simulate your circuit to verify functionality.\nη"
    },
    {
      "category": "Resource",
      "title": "ps2faq.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/adffc712023d4bf207a82c383e994113_ps2faq.pdf",
      "content": "Problem Set #2: Updates and Frequently Asked Questions\nNotes and Hints:\nProblem 6:\nz *** The expression for S should be read as S=ABC+(A*notB*notC)+(notA*notB*C)+\n(notA*B*notC). If you interpreted it the as A*not(BC) etc and have already completed the layout\nwe'll accept that, but please complete the other parts of the problem for the correct interpretation\nof S.\nz This should read just \"transmission gate\", not \"NMOS transmission gate\" You may assume inputs\nand their complements are available as inputs.\nz For part c, the sizing should be W/L=0.5/0.25u for all NMOS and W/L=2u/0.25u for all PMOS."
    },
    {
      "category": "Resource",
      "title": "ps3_03_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/f1f6b5b0a226b23ea238b48c4dca0778_ps3_03_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 3 Solutions\nFall 2003\nIssued: 10/14/03\nFor these problems you can use the process parameters for the 0.25 technology- see the Process\nParameters file in the assignments section.\nProblem 1: Dynamic Logic I\nConsider the conventional N-P CMOS circuit below in which all precharge and evaluate devices are clocked\nusing a common clock φ and its complement. For this entire problem, assume that the pulldowown/pullup\nnetwork is simply a single NMOS/PMOS device, so that each Domino stage consists of a dynamic inverter\nfollowed by a static inverter. Assume that the precharge time, evaluate time, and propagation delay of the\nstatic inverter are all T/2. Assume that the transitions are ideal (zero rise/fall times)\nφ\nφ\nφ\nOut1\nOut4\nPullup\nOut3\nPulldown\nNetwork\nNetwork\nPulldown\nIN\nNetwork\nφ\nφ\nφ\nφ\nφ\nPulldown\nNetwork\nOut2\na) Do any problems occur when the input makes a 0->1 transition? What about a 1->0 transition? If so,\ndescribe what happens and insert one inverter somewhere in the circuit to fix the problem.\nSolution\nThere is no problem if the input makes a 1->0 transition, as long as the input is stable when the evaluate\nphase begins. However, if the input makes a 0->1 transition, Out1 will initially be precharged to 1 and then\ngo to 0 at some time after the evaluate phase begins. In our case this time is T/2. This could allow the next\n\nPDN to pull Out2 low before Out1 goes low and cause an error in Out2. Insert the inverter before the PDN\ngenerating Out2 to solve the problem.\nb) For your corrected circuit, complete the timing diagram for signals Out1, Out2, Out3 and Out4, when the\nIN signal goes high before the rising edge of the clock φ. Assume that the clock period is 10 T time units\nSolution\nT\n2T\n3T\n4T\n5T\n6T\n7T\n8T\n9T\n10T\nCLK\nIN\nOUT1\nOUT2\nOUT3\nOUT4\nb) Suppose that there are no evaluate switches at the 3 latter stages. Assume that the clock φ is initially in\nthe precharge state (φ=0 with all nodes settled to the correct precharge states), and the block enters the\nevaluate period (φ=1). Is there a problem during the evaluate period, or is there a benefit? Explain.\nSolution\nThere is no problem during the evaluate stage. The precharged nodes remain charged until a signal pro\npogates through the logic, activating the pull-down network and discharging the node. In fact, this topology\nimproves the circuit's robustness in terms of charge sharing affecting the output for any generic pull-down\nnetwork, and reduces the body effect in the pull-down network.\nc) Assume that the clock φ is initially in the evaluate state (φ=1), and the block enters the precharge state\n(φ = 0). Is there a problem, or is there any benefit, if the last three evaluate switches are removed?\nExplain.\nSolution\nThere is a problem during the precharge stage. If all precharged nodes are discharged during the evaluate\nstage, when the precharge FETs simultaneously turn on, the pull-down networks will initially remain on,\ncreating a short circuit. This continues in each gate until the previous gate charges, disabling its pull-down\nnetwork.\nProblem 2: Leakage Power\nConsider the circuit shown below:\na) What is the logic function implemented by this circuit? Assume that all devices (M1-M6) are 0.5μm/\n0.25μm.\nSolution\n(AB)+C\n\n----------\n-------------\nb) Let the drain current for each device (NMOS and PMOS) be 1μA for NMOS at VGS = VTn0 and PMOS\nat VGS = VTp0. What input vectors cause the worst case leakage power for each output value? Explain\n(state all the vectors, but do not evaluate the leakage). Ignore DIBL.\nSolution\nWhen the output is high, the worst-case leakage occurs when two transistors leak in parallel: ABC = 100 or\n010. When the output is low, the worst-case leakage also occurs when two transistors leak in parallel: ABC\n=110.\nc) Suppose the circuit is active for a fraction of time d and idle for (1-d). When the circuit is active, the\ninputs arrive at 100 MHz and are uniformly distributed (Pr(A =1) = 0.5, Pr(B=1) = 0.5, Pr(C=1) = 0.5) and\nindependent. When the circuit is in the idle mode, the inputs are fixed to one you chose in part (b). What\nis the duty cycle d for which the active power is equal to the leakage power?\nSolution\nChoose the case where ABC=100.\nd*Pactive = (1-d) Pleakage. Pactive = α 0->1*f*CL*VDD\n2 = (3/8 * 5/8)*(100*106)*(50*10-15)*(2.52) = 7.3 μ W.\n-V T\n0.43\n-\n0.1\nPleakage (ABC = 100) = VDD*2*IleakM1 = 5*I 10 S = 5*1uA10\n= 251pW.\no\nPlugging the power numbers into the activity equation and solving for d gives d = 3.4*10-5.\nVDD = 2.5V\nVDD = 2.5V\nB\nM4\nA\nM6\nC\nM5\nOut\nA\nM3\nCL = 50fF\nB\nM1\nC\nM2\nProblem 3: Multi Threshold CMOS\nMulti Threshold CMOS is a circuit technique that utilizes multiple threshold devices to provide both low\nleakage and high performance operation. The following problem explores some of the issues involved in\nMTCMOS circuits, although a more realistic circuit would be more complicated (like an adder or multiplier)\ninstead of the single inverter shown in Figure 1. For hand calculations, ignore body effect, lambda, and para\nsitic capacitances.\nIn the sleep mode, M3 is turned off, and this high Vt device limits the subthreshold leakage current. On the\nother hand, when the circuit is active, M3 is turned on hard for fast switching operation. For the rest of the\n\nVDD = 2.5V\nWp/Lp=1.25μm/0.25μm\nVtpl = -0.2V\nOut\nIn\nWn/Ln=0.625μm/0.25μm\nCl = 40fF\nM1\nM2 Vtnl = 0.2V\nVx\nSleepL\nM3 Wnsleep/Lnsleep = 0.625μm/0.25μm\nVtnh = 0.43V\nproblem, assume that M3 is turned on. ( i.e. VSleepL = VDD )\nParts a) through f) do not require HSPICE.\na) What is the desired region of operation for M3 during the active mode?\nSolution\n(VGS - Vt) > VDSAT > VDS , therefore M3 is in the linear mode (i.e., M3 acts like a linear resistor).\nb) Calculate the effective resistance looking into the drain of transistor M3.\nSolution\nThe effective resistance is just the output resistance of M3 from its corresponding small-signal model:\n∂I\n′ W 3\n0.625\nG = -------------- = k --------(V GS - V t - V DS) = 115×10 6\n- × ------------- × (2.5 0.43\n-\n) = 595 × 10 6\n-\nand R = G 1\n- so\nn\n0.25\n∂V DS\nL3\nR = 1680 Ω . Notice that we assumed the VDS term was negligible. That may not be too valid, but it works for\nproviding an approximation of R.\nc) Now assume the effective resistance of M3 is 0. What is the peak current (saturation current) that dis\ncharges Cl during an output high to low transistion?\nSolution\nThe peak discharge current with the effective resistance of M3 set to 0 is simply the initial discharge current\nthrough M2 when M2 is velocity saturated\n′ W 2\n0.625\n= k -------- ⋅ V DSAT ⋅(V GS - V t - 0.5V DSAT ) = 115×10 6\n- ⋅ ------------- ⋅ 0.63 ⋅(2.3 0.315\n-\n) = 360μA\nI peak\nn L2\n0.25\nd) What is the peak current taking into account the finite sleep resistance (computed in part b)\n\nSolution\nWith a non-zero effective resistance the voltage at Vx becomes a function of the discharge current and we\nneed to take this into account when determining the peak discharge current.\nOut\nV = iR = 1680i\nx\n2.5V\nM2\n′ W\nVx\ni = kn\n----- ⋅ V DSAT ⋅(2.5 - V - V t - 0.5V DSAT )\nR\ni\nL\nx\n\nSolving for i and Vx , Vx = 0.41V, i = 244μA.\ne) As Wnsleep increases, qualitatively how does tPHL vary? How does tPLH vary?\nSolution\ntPHL decreases,because average current gets bigger. tPLH is unaffected\nf)\nIf there is a large parasitic capacitance at node Vx, what is the effect on switching performance?\nSolution\nThe switching performance improves (i.e., tPHL decreases) if there is big capacitance at x. This is because\nthe average current gets larger. If there's a capacitance at node x then the discharge current entering node x\nsees a first order RC circuit and as a result Vx increases slowly. This results in a larger VGS,M2 which results\nin a larger peak current (another way to think about this is to consider the large parasitic capacitor at Vx as a\nlocal sink for the charge from Out). The larger the value of the capacitor, the more slowly that Vx will charge\nand hence the smaller tPHL becomes.\nFor Hspice simulations use the models' file \"logiclvt.l\". Include two .lib statements, one with\nTT and one with TT_LVT and use nchlvt, pchlvt, and nch as the three device types in your netlist\ng) Using HSPICE, simulate the circuit for varying Wnsleep values of (0.625, 1.5u, 3u, 5u, 7u, 9u, 11u).\nTurn in plots showing output voltage as a function of time and Vx as a function of time (with the vary\ning Wnsleep curves superimposed on the same graph). Note if done correctly, HSPICE need only be run\nonce. For the input specification, use the piecewise linear option: \"Vin node1 node2 pl 0v 0n, 0v 2.5n,\n2.5v 2.6n, 2.5v 7.5n, 0v 7.6n\".\nSolution\nFigure 2 shows the required plot generated by Hspice.\n\n* problem 3 netlist (hw 3)\n2.4\n2.2\n1.8\n1.6\n1.4\n1.2\nIncreasing Wnsleep\nVoltages (lin)\n800m\n600m\n400m\n200m\n2.5n\n3n\n3.5n\n4n\n4.5n\n5n\n5.5n\n6n\n6.5n\n7n\n7.5n\n8n\nTime (lin) (TIME)\nWe can see from the above graph that (f) is verified. (i.e., as parasitic capacitance (W) gets bigger tPHL\ndecreases) Notice that our calculation for Vx overestimated the value. That is because we assumed Vx was\n* problem 3 netlist (hw 3)\n240m\n220m\n200m\n180m\n160m\n140m\nIncreasing Wnsleep\nVoltages (lin)\n120m\n100m\n80m\n60m\n40m\n20m\n-20m\n500p\n1n\n1.5n\n2n\n2.5n\n3n\n3.5n\n4n\n4.5n\n5n\n5.5n\n6n\n6.5n\n7n\n7.5n\n8n\n8.5n\n9n\nTime (lin) (TIME)\nsmall enough to neglect when solving for R. In reality, that approximation caused us to underestimate the\nresistance.\nh) Plot tPHL and tPLH for each of these choices of Wnsleep.\nSolution\n\n* problem 3 netlist (hw 3)\nMeasures (lin)\n154p\n156p\n158p\n160p\n162p\n164p\n166p\n168p\n170p\n172p\n174p\n176p\n2u\n3u\n4u\n5u\n6u\n7u\n8u\n9u\n10u\n11u\nOuter Result (lin) (sw)\nProblem 4: Low-Swing Bus Drivers\nConsider the two possible bus driver circuits shown below:\nUse 0.25 um technology: VDD=2.5 V\nIn1\nIn1\nC=1pF\nC=1pF\nIn2\nCs=10pF\nC=1pF\nIn2\nC=1pF\nCircuit A\nCircuit B\na) First consider circuit A. Assume an ideal inputs with zero rise time are available. Assuming Wp/Wn=3,\nfind the minimum sized inverters such that tp will be less than 10% of the period for switching frequen\ncies of 10 MHz, 100 MHz, and 1 GHz. (To make this easy, you can specify wn='0.375u*scale' and\nwp='1.125u*scale', specify the areas and perimeters similarly, and just vary the parameter 'scale'.)\nWhat is the leakage power consumed by inverters of each of these sizes when the input is low? What is\nthe average total power consumed by the 2-bit bus if the inputs are tied together and switch at a fre\nquency of 100 MHz? (For this very last question, just give a hand calculation based on switching power\nonly and neglecting parasitics.)\n\nSolution\nUsing HSPICE and parameterizing the device sizes in terms of the scale factor it is relatively easy to iterate\nand find a solution. We find that scale must be about 1 for 10 MHz operation, 7 for 100 MHz operation, and\n80 for 1 GHz operation. The leakage currents/powers, measured by placing a zero volt test source between\nVDD and the PMOS device, are118 pA/295 pW, 18 pA/45 pW, and 8 pA/20 pW for the required scale fac\ntors. (These values for scale and resulting current/power are somewhat subjective The average power of the\n2-bit bus can be found by the following method. Each time a capacitor charges from 0->VDD, the required\ncharge is Q=CVDD. For each of the two capacitors this will happen 100E6 times per second, so\nItot=2*100E6*CVDD. Then multiply this by VDD since P=IV. The result is that the switching power for the\nbus is 1.25 mW.\nb) Circuit B shows a simplified version of a purposed low-swing bus driver circuit. [\"Low-swing charge\nrecycle bus drivers\" Karlsson, M.K.; Vesterbacka, M.; Wanhammar, L.; Circuits and Systems, 1998.\nISCAS '98. Proceedings of the 1998 IEEE International Symposium on , Volume: 2 , 31 May-3 June\n1998; Page(s): 117 -120 vol.2] Explain how this circuit works. Theoretically, what should be the per\ncentage power saved by using this circuit instead of Circuit A?\nSolution\nThis circuit works by lowering voltage swing and recycling charge to conserve power. The large capacitor at\nthe middle node acts as a virtual ground at VDD/2 which stores and reuses charge and each of the buses has\na swing of VDD/2. The power can be calculated by recognizing that when the two buses make a simulta\nneous 0->1 transition, the only charge drawn from the supply is Q=C∆V, where ∆V is the change in voltage\non the upper bus and is equal to VDD/2. Then I=100E6*C*∆V and P=100E6*C∗∆V*VDD=50E6*C*VDD\n2.\nThis is a factor of 4 reduction in power or 75% savings.\nc) Now simulate Circuit B with the inputs tied together and switching at 100 MHz. Size the NMOS and\nPMOS as above and with scale=10. Be sure to initialize Cs to VDD/2 using a .ic statement. In a real cir\ncuit you would probably need to use progressively scaled buffers, but for this case you may assume that\nyou have IN1, IN2 and their complements available at the gate inputs with zero rise/fall times. (This\nmeans you DO NOT need to implement the two inverters at the input.) How much power do we actually\nsave by using this low-swing driver? Submit your output waveform.\nSolution\nThe output waveform is shown below. The power, found by averaging the current sourced by VDD, is 294\nuW for Circuit B. This is approximately 76.5% percent savings from the theoretical power used by the sim\nple dual inverter bus driver which matches well with the calculated result.\n\n*hspicefile\nVoltages (lin)\n2.6\n2.4\n2.2\n1.8\n1.6\n1.4\n1.2\n800m\n600m\n400m\n200m\n2n\n4n\n6n\n8n\n10n\n12n\n14n\n16n\n18n\n20n\nTime (lin) (TIME)\nd) What problem might occur in Circuit B if the two inputs had different activity factors?\nSolution\nIf the circuits two inputs had different activity factors the virtual ground capacitor would start to move away\nfrom VDD/2 until the circuit failed. For this reason, the actual circuit proposed in the paper has additional\nbiasing circuitry to guarantee that the virtual ground node will remain within a predetermined voltage range.\nProblem 5: Dynamic Logic II\nFigure 5 shows a dynamic CMOS circuit in Domino logic. In determining source and drain areas and perim\neters, you may use the following approximations: AD = AS = W × 0.625μm and PD = PS = W + 1.25μm.\nAssume 0.1 ns rise/fall times for all inputs, including the clock. Furthermore, you may assume that all the\ninputs and their complements are available, and that all inputs change during the precharge phase of the\nclock cycle.\na) What Boolean functions are implemented at outputs F and G? If A and B are interpreted as two-bit\nbinary words, A = A1A0 and B = B1B0, then what interpretation can be applied to output G?\nSolution\nF = A0B0 + A0B0, G = F(A1B1 + A1B1)\nIf A and B are interpreted as two-bit binary words, output G is high if A = B: a comparator\n\nb) Which gate (1 or 2) has the highest potential for harmful charge sharing and why? What sequence of\ninputs (spanning two clock cycles) results in the worst-case charge-sharing scenario? Using SPICE,\ndetermine the extent to which charge sharing affects the circuit for this worst case.\n.\nF\nG\nA0\nB0\nB0\nB1\nA1\nA1\nB1\nCL\n2/0.25\n2/0.25\n2/0.25\n2/0.25\n0.5/0.25\n0.5/0.25\n1/0.25\n1/0.25\n1/0.25\n2/0.25\n2/0.25\n1/0.25\n1/0.25\nφ\nφ\nφ\nφ\n2.5 V\n2.5 V\n2.5 V\n2.5 V\nA0\nGATE 1\nGATE 2\nSolution\nGate 2 has the higher potential for harmful charge sharing because the capacitance that contributes to charge\nsharing is larger than in gate 1.\nThe sequence of inputs resulting in the worst-case charge sharing is A0 = B0 and A1 = B1 for the first\ncycle. Then A0 = B0 and A1 = B1 for the second cycle such that A1/A1 transistor that is on during the sec\nond cycle is the same as in the first cycle. For example, A1 = B1 = VDD in cycle 1 and A1 = VDD, B1 = 0 V in\ncycle 2. This will cause the charge at the output of gate 2 to be shared with the total parasitic capacitance at\nthe drains of the A1, A1, and B1 transistors.\n*problem set 3: number 6: charge sharing problem\nVoltages (lin)\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\n2.2\n2.4\n2.6\n2.8\nOut\nGbar\nphi\nB1\n1n\n2n\n3n\n4n\n5n\n6n\n7n\n8n\n9n\n10n\nTime (lin) (TIME)\nc) In part b you determined which gate (1 or 2) suffers the most from charge sharing. Add a single 2/0.25\nPMOS precharge transistor (with its gate driven by the clock φ and its source connected to VDD) to one\nof the nodes in that gate to maximally reduce the charge-sharing effect. What effect (if any) will this\n\naddition have on the gate delay? Use SPICE to demonstrate that the additional transistor has eliminated\ncharge sharing for the previously determined worst-case sequence of inputs.\nSolution\nThe additional precharge transistor should charge the node that is shared by the A1 and A1 transistor drains\nand the F transistor source. Assuming the gate delay is dominated by the precharge stage, this will reduce\nthe gate delay by briefly aiding the precharging of gate 2. SPICE output with additional precharge transistor.\nVoltages (lin)\n200m\n400m\n600m\n800m\n1.2\n1.4\n1.6\n1.8\n2.2\n2.4\n2.6\n2.8\nOUT\nGBAR\nB1\nPHI\n*problem set 3: number 6: charge sharing problem\n1n\n2n\n3n\n4n\n5n\n6n\n7n\n8n\n9n\n10n\nTime (lin) (TIME)\nd) For the new circuit (including additional precharge transistor), find the sequence of inputs (spanning\ntwo clock cycles) that results in the worst-case delay through the circuit. Remember that precharging is\nanother factor that limits the maximum clocking frequency of the circuit, so your input sequence should\naddress the worst-case precharging delay.\nSolution\nThe worst-case delay results from A = B for two consecutive cycles. This results in the maximum charging\nand discharging of the internal nodes\ne) Using SPICE on the new circuit and applying the sequence of inputs found in part (d), find the maxi\nmum clock frequency for correct operation of the circuit. Remember that the precharge cycle must be\nlong enough to allow all precharged nodes to reach ~90% of their final values before evaluation begins.\nAlso, recall that the inputs (A, B and their complements) should not begin changing until the clock sig\nnal has reached 0 V (precharge phase), and they should reach their final values before the circuit enters\nthe evaluation phase.\nSolution\nThe maximum clock frequency is ~4.4 GHz if you didn't include parasitic capacitance. If you did, it is\naround 2 GHz depending on the assumptions you made.\nProblem 6: Dynamic Power\nFor parts a and b of this problem, assume independent, identically-distributed uniform white noise inputs.\n\na) What logical function is implemented by the Circuit A? Does this schematic contain reconvergent fan-\nout? Explain your answer. Find the exact signal (P1) and transition (P0 → 1) formulas for nodes X, Y, and\nZ for: (1) a static, fully complementary CMOS implementation, and (2) a dynamic CMOS implementa\ntion. Assume an np-CMOS implementation with an n-tree first stage.\nSolution\nThis schematic has reconvergent fan-out because both inputs of the or gate depend on the value of S. How\never, due to the special nature of this particular case, conditional probablity is NOT required to complete the\nsolution.\nAssuming a fully complementary CMOS implementation:\nX is the output of an AND gate with independent, identically-distributed uniform white noise inputs. As\nonly when both inputs are equal to 1 the output is 1, P1 = 0.25 . On the other hand\n= P0 P1 = 0.25 1 0.25\n-\n) = 0.1875 .\n(\nP0 → 1\nY is also the output of an AND gate with independent, identically distributed uniform white noise inputs.\nThe analysis is the same as with X.\nIf we represent the truth table of the schematic we will see that\nP1 = 0.5 . Then\n= P0 P1 = 0.5 1 0.5\n-\n) = 0.25 .\n(\nP0 → 1\nAssuming a dynamic CMOS implementation:\nIn the same way as before, for X, P1 = 0.25 . In order to obtain the transition probability, an n-tree dynamic\ngate will be assumed. In this case: P0 → 1 = P0 = 0.75 .\nThe analysis for Y is equal to the analysis for X.\nFor Z, using the truth table of the schematic we obtain, again , P1 = 0.5 . For the transition probability, it\nwill be assumed that a np-CMOS structure is used.. Then, Z is the output of a p-tree dynamic gate. Then:\n= P1 = 0.5 .\nP0 → 1\nC\nC\nC\nA\nB\nS\nX\nY\nZ\nb) Compute the switching power consumed by Circuit A, assuming that all significant capacitances have\nbeen lumped into the three capacitors shown in the figure, where C = 0.3 pF. Also, assume that VDD =\n2.5 V and that input events occur at a frequency of 100 MHz. Perform this calculation for a static, fully\n\ncomplementary CMOS implementation and a dynamic CMOS implementation. Assume np-CMOS\nagain for the dynamic implementation, but find the power for both orders of trees.\nSolution\ni)A static, fully-complementary CMOS implementation.\nSwitching power is:\n= α\nf\nC\n\n= (αX 0 →1\n⋅\n⋅\n⋅\n\nV DD\n+ αY 0 →1 + α\n) ⋅\n⋅\n⋅\n\nPSW\nZ0 →1\nf\nC\nV DD\nWe calculated previously the probabilities of a 0->1 transistion for each node:\nfor X and Y is 0.1875\nP0 →1\nfor Z is 0.25.\nand P0 →1\nThus, PSW = (2*0.1875+0.25)*100MHz*0.3pF*2.52 = 117.2uW.\nii)A dynamic CMOS implementation\nIn part b) for a dynamic np-CMOS gate, we calculated the probabilities:\nfor X and Y is 0.75 and\nP0 →1\nP0 →1 for Z is 0.5. Thus, PSW = (2*0.75+0.5)*100MHz*0.3pF*2.52 = 375uW.\nWhen the first stage is implementated with a p-tree,\nis equal to P1 = 0.25. The output stage has\nP0 →1\nP0 →1\nequal P0=0.5. Thus,\nPSW = (2*0.25+0.5)*100MHz*0.3pF*2.52 = 187.5uW.\nc) Now consider the implementation of a 3-input OR gate shown in Circuit B. Assume that you have 3\ninputs A, B, and C and where P(A=1)=0.5, P(B=1)=0.2, P(C=1)=0.1. For a static CMOS implementa\ntion of this circuit and neglecting any glitches that may occur, what is the best order to place these inputs\nin order to minimize power consumption? What is the activity factor at the internal node (INT) in this\ncase? What is the worst order and the activity factor of the internal node in this case?\nCircuit B\nIN1\nIN2\nIN3\nINT\nSolution\nP(0) for INT\nP(1) for INT\nAlpha(0->1)\nAB\n0.4\n0.6\n0.24\nAC\n0.45\n0.55\n0.248\nBC\n0.72\n0.28\n0.201\nSo, to minimize power comsuption we should place B and C at the first stage. The worst case occurs when A\nand C placed at the input stage. The activity factors for each case are shown in the table above.\n\nProblem 7: Dynamic Logic III\nConsider the circuit shown below:\na) Give the logic function of x and y in terms of A, B, and C. Sketch the waveforms at x and y for the given\ninputs. Do x and y evaluate to the values you expected from their logic functions? Explain.\nSolution\nx = AB and y = ABC\nThe circuit does not correctly implement the desired logic function. This stems from the fact that x is pre-\ncharged high, and thus node y is discharged as soon as the evaluation phase starts. Although x is eventually\ndischarged by the first stage, y cannot be charged high again since it is a dynamic node with no low-imped-\nance path to Vdd (during evaluate). Common solutions to this problem are to place an inverter between the\ntwo stages (thus allowing only 0-to-1 transitions on the inputs to each stage during evaluate) as in Domino\nlogic or employ np-CMOS. The latter is presented in (b).\nb) Redesign the gates using np-CMOS to eliminate any race conditions. Sketch the waveforms at x and y\nfor your new circuit\nSolution.\nVDD\nx\ny\nφ\nA\nB\nC\nφ\nφ\nφ\nA\nB\nC\nφ\n0 V\n2.5 V\n2.5 V\n0 V\n2.5 V\n2.5 V\n0 V\n2.5 V\n0 V\nx\ny\n(b) np-CMOS\nx\nφ\nA\nB\nφ\nVDD\nC\ny\n2.5 V\n0 V\n2.5 V\n0 V\nx\ny\nφ\nφ\n(a)"
    },
    {
      "category": "Resource",
      "title": "ps3_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/b4b0ba298ce3c93e19f24215304850c5_ps3_03.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nProblem Set # 3\nFall 2003\nIssued: 9/30/03\nDue: 10/14/03\nFor these problems you can use the process parameters for the 0.25 technology- see the Process\nParameters file in the assignments section.\nProblem 1: Dynamic Logic I\nConsider the conventional N-P CMOS circuit below in which all precharge and evaluate devices are clocked\nusing a common clock φ and its complement. For this entire problem, assume that the pulldowown/pullup\nnetwork is simply a single NMOS/PMOS device, so that each Domino stage consists of a dynamic inverter\nfollowed by a static inverter. Assume that the precharge time, evaluate time, and propagation delay of the\nstatic inverter are all T/2. Assume that the transitions are ideal (zero rise/fall times)\nφ\nφ\nφ\nOut1\nOut4\nPullup\nNetwork\nOut3\nPulldown\nNetwork\nPulldown\nIN\nNetwork\nφ\nφ\nφ\nφ\nφ\nOut2\nPulldown\nNetwork\na) Do any problems occur when the input makes a 0->1 transition? What about a 1->0 transition? If so,\ndescribe what happens and insert one inverter somewhere in the circuit to fix the problem.\nb) For your corrected circuit, complete the timing diagram for signals Out1, Out2, Out3 and Out4, when the\nIN signal goes high before the rising edge of the clock φ. Assume that the clock period is 10 T time\nunits.\n\nb) Suppose that there are no evaluate switches at the 3 latter stages. Assume that the clock φ is initially in\nthe precharge state (φ=0 with all nodes settled to the correct precharge states), and the block enters the\nevaluate period (φ=1). Is there a problem during the evaluate period, or is there a benefit? Explain.\nc) Assume that the clock φ is initially in the evaluate state (φ=1), and the block enters the precharge state\n(φ = 0). Is there a problem, or is there any benefit, if the last three evaluate switches are removed?\nExplain.\nProblem 2: Leakage Power\nConsider the circuit shown below:\na) What is the logic function implemented by this circuit? Assume that all devices (M1-M6) are 0.5μm/\n0.25μm.\nb) Let the drain current for each device (NMOS and PMOS) be 1μA for NMOS at VGS = VTn0 and PMOS\nat VGS = VTp0. What input vectors cause the worst case leakage power for each output value? Explain\n(state all the vectors, but do not evaluate the leakage). Ignore DIBL.\nc) Suppose the circuit is active for a fraction of time d and idle for (1-d). When the circuit is active, the\ninputs arrive at 100 MHz and are uniformly distributed (Pr(A =1) = 0.5, Pr(B=1) = 0.5, Pr(C=1) = 0.5) and\nindependent. When the circuit is in the idle mode, the inputs are fixed to one you chose in part (b). What\nis the duty cycle d for which the active power is equal to the leakage power?\nVDD = 2.5V\nVDD = 2.5V\nB\nM4\nA\nM6\nC\nM5\nOut\nA\nM3\nCL = 50fF\nB\nM1\nC\nM2\nProblem 3: Multi Threshold CMOS\nMulti Threshold CMOS is a circuit technique that utilizes multiple threshold devices to provide both low\nleakage and high performance operation. The following problem explores some of the issues involved in\nMTCMOS circuits, although a more realistic circuit would be more complicated (like an adder or multiplier)\ninstead of the single inverter shown below. For hand calculations, ignore body effect, lambda, and parasitic\ncapacitances.\nIn the sleep mode, M3 is turned off, and this high Vt device limits the subthreshold leakage current. On the\nother hand, when the circuit is active, M3 is turned on hard for fast switching operation. For the rest of the\nproblem, assume that M3 is turned on. ( i.e. VSleepL = VDD )\n\nVDD = 2.5V\nWp/Lp=1.25μm/0.25μm\nVtpl = -0.2V\nOut\nIn\nWn/Ln=0.625μm/0.25μm\nCl = 40fF\nM1\nM2 Vtnl = 0.2V\nVx\nSleepL\nM3 Wnsleep/Lnsleep = 0.625μm/0.25μm\nVtnh = 0.43V\nParts a) through f) do not require HSPICE.\na) What is the desired region of operation for M3 during the active mode?\nb) Calculate the effective resistance looking into the drain of transistor M3.\nc) Now assume the effective resistance of M3 is 0. What is the peak current (saturation current) that dis\ncharges Cl during an output high to low transistion?\nd) What is the peak current taking into account the finite sleep resistance (computed in part b)\ne) As Wnsleep increases, qualitatively how does tPHL vary? How does tPLH vary?\nf)\nIf there is a large parasitic capacitance at node Vx, what is the effect on switching performance?\nFor Hspice simulations use the models' file \"logiclvt.l\". Include two .lib statements, one with\nTT and one with TT_LVT and use nchlvt, pchlvt, and nch as the three device types in your netlist.\ng) Using HSPICE, simulate the circuit for varying Wnsleep values of (0.625u, 1.5u, 3u, 5u, 7u, 9u, 11u).\nTurn in plots showing output voltage as a function of time and Vx as a function of time (with the vary\ning Wnsleep curves superimposed on the same graph). Note if done correctly, HSPICE need only be run\nonce. For the input specification, use the piecewise linear option: \"Vin node1 node2 pl 0v 0n, 0v 2.5n,\n2.5v 2.6n, 2.5v 7.5n, 0v 7.6n\"\nh) Plot tPHL and tPLH for each of these choices of Wnsleep\nProblem 4: Low-Swing Bus Drivers\nConsider the two possible bus driver circuits shown below:\n\nUse 0.25 um technology: VDD=2.5 V\nIn1\nIn1\nC=1pF\nC=1pF\nIn2\nCs=10pF\nC=1pF\nIn2\nC=1pF\nCircuit A\nCircuit B\na) First consider circuit A. Assume an ideal inputs with zero rise time are available. Assuming Wp/Wn=3,\nfind the minimum sized inverters such that tp will be less than 10% of the period for switching frequen\ncies of 10 MHz, 100 MHz, and 1 GHz. (To make this easy, you can specify wn='0.375u*scale' and\nwp='1.125u*scale', specify the areas and perimeters similarly, and just vary the parameter 'scale'.)\nWhat is the leakage power consumed by inverters of each of these sizes when the input is low? What is\nthe average total power consumed by the 2-bit bus if the inputs are tied together and switch at a fre\nquency of 100 MHz? (For this very last question, just give a hand calculation based on switching power\nonly and neglecting parasitics.)\nb) Circuit B shows a simplified version of a purposed low-swing bus driver circuit. [\"Low-swing charge\nrecycle bus drivers\" Karlsson, M.K.; Vesterbacka, M.; Wanhammar, L.; Circuits and Systems, 1998.\nISCAS '98. Proceedings of the 1998 IEEE International Symposium on , Volume: 2 , 31 May-3 June\n1998; Page(s): 117 -120 vol.2] Explain how this circuit works. Theoretically, what should be the per\ncentage power saved by using this circuit instead of Circuit A?\nc) Now simulate Circuit B with the inputs tied together and switching at 100 MHz. Size the NMOS and\nPMOS as above and with scale=10. Be sure to initialize Cs to VDD/2 using a .ic statement. In a real cir\ncuit you would probably need to use progressively scaled buffers, but for this case you may assume that\nyou have IN1, IN2 and their complements available at the gate inputs with zero rise/fall times. (This\nmeans you DO NOT need to implement the two inverters at the input.) How much power do we actually\nsave by using this low-swing driver? Submit your output waveform.\nd) What problem might occur in Circuit B if the two inputs had different activity factors?\nProblem 5: Dynamic Logic II\nThe figure below shows a dynamic CMOS circuit in Domino logic. In determining source and drain areas\nand perimeters, you may use the following approximations: AD = AS = W × 0.625μm and PD = PS = W +\n1.25μm. Assume 0.1 ns rise/fall times for all inputs, including the clock. Furthermore, you may assume that\nall the inputs and their complements are available, and that all inputs change during the precharge phase of\nthe clock cycle.\n\na) What Boolean functions are implemented at outputs F and G? If A and B are interpreted as two-bit\nbinary words, A = A1A0 and B = B1B0, then what interpretation can be applied to output G?\nb) Which gate (1 or 2) has the highest potential for harmful charge sharing and why? What sequence of\ninputs (spanning two clock cycles) results in the worst-case charge-sharing scenario? Using SPICE,\ndetermine the extent to which charge sharing affects the circuit for this worst case.\nF\nG\nA0\nB0\nB0\nB1\nA1\nA1\nB1\nCL\n2/0.25\n2/0.25\n2/0.25\n2/0.25\n0.5/0.25\n0.5/0.25\n1/0.25\n1/0.25\n1/0.25\n2/0.25\n2/0.25\n1/0.25\n1/0.25\nφ\nφ\nφ\nφ\n2.5 V\n2.5 V\n2.5 V\n2.5 V\nA0\nGATE 1\nGATE 2\nc) In part c you determined which gate (1 or 2) suffers the most from charge sharing. Add a single 2/0.25\nPMOS precharge transistor (with its gate driven by the clock φ and its source connected to VDD) to one\nof the nodes in that gate to maximally reduce the charge-sharing effect. What effect (if any) will this\naddition have on the gate delay? Use SPICE to demonstrate that the additional transistor has eliminated\ncharge sharing for the previously determined worst-case sequence of inputs.\nd) For the new circuit (including additional precharge transistor), find the sequence of inputs (spanning\ntwo clock cycles) that results in the worst-case delay through the circuit. Remember that precharging is\nanother factor that limits the maximum clocking frequency of the circuit, so your input sequence should\naddress the worst-case precharging delay.\ne) Using SPICE on the new circuit and applying the sequence of inputs found in part (d), find the maxi\nmum clock frequency for correct operation of the circuit. Remember that the precharge cycle must be\nlong enough to allow all precharged nodes to reach ~90% of their final values before evaluation begins.\nAlso, recall that the inputs (A, B and their complements) should not begin changing until the clock sig\nnal has reached 0 V (precharge phase), and they should reach their final values before the circuit enters\nthe evaluation phase.\nProblem 6: Dynamic Power\nFor parts a and b of this problem, assume independent, identically-distributed uniform white noise inputs.\na) What logical function is implemented by the Circuit A? Does this schematic contain reconvergent fan-\nout? Explain your answer. Find the exact signal (P1) and transition (P0 → 1) formulas for nodes X, Y, and\nZ for: (1) a static, fully complementary CMOS implementation, and (2) a dynamic CMOS implementa\ntion. Assume an np-CMOS implementation with an n-tree first stage.\nb) Compute the switching power consumed by Circuit A, assuming that all significant capacitances have\nbeen lumped into the three capacitors shown in the figure, where C = 0.3 pF. Also, assume that VDD =\n2.5 V and that input events occur at a frequency of 100 MHz. Perform this calculation for a static, fully\n\ncomplementary CMOS implementation and a dynamic CMOS implementation. Assume np-CMOS\nagain for the dynamic implementation, but find the power for both orders of trees.\nC\nC\nC\nA\nB\nS\nX\nY\nZ\nCircuit A\nc) Now consider the implementation of a 3-input OR gate shown in Circuit B. Assume that you have 3\ninputs A, B, and C and where P(A=1)=0.5, P(B=1)=0.2, P(C=1)=0.1. For a static CMOS implementa\ntion of this circuit and neglecting any glitches that may occur, what is the best order to place these inputs\nin order to minimize power consumption? What is the activity factor at the internal node (INT) in this\ncase? What is the worst order and the activity factor of the internal node in this case?\nCircuit B\nIN1\nIN2\nIN3\nINT\nProblem 7: Dynamic Logic III\nConsider the circuit shown below:\na) Give the logic function of x and y in terms of A, B, and C. Sketch the waveforms at x and y for the given\ninputs. Do x and y evaluate to the values you expected from their logic functions? Explain.\nb) Redesign the gates using np-CMOS to eliminate any race conditions. Sketch the waveforms at x and y\nfor your new circuit.\nVDD\n2.5 V\nφ\n0 V\nx\nφ\nA\nB\nC\nφ\nφ\nφ\ny\n2.5 V\nA\n2.5 V\nB\nC\n0 V"
    },
    {
      "category": "Resource",
      "title": "ps3_faq.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/05c50dfb1af114d0f95cb6133d499f7a_ps3_faq.pdf",
      "content": "FAQs and Overview of Problem Set 3\n\nNotes and Hints:\nProblem 1:\n- The statement that \"each stage consist of a dynamic inverter followed by a static\ninverter\" is in error. For this particular logic style we do not need static inverters except\nin the one place you choose.\n\nProblem 2:\n-\nFor part (c) you may assume S=100mV/decade. Also for part (c), choose the input\nvector that you chose in part (b) for the worst case leakage through the pull-up\nnetwork when the output=0V\nProblem 3:\nProblem 4:\n-\nLeakage power may be found by simulation.\n-\nFor the hand calculation of power, you may assume that the 10 pF node is always\nequal to VDD/2, despite the fact that in practice it varies by about 100 mV during\nswitching.\nProblem 5:\nProblem 6:\n-\nYou may assume that CL=0 when running your simulations.\nProblem 7:"
    },
    {
      "category": "Exam",
      "title": "quiz03_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/7979a38e92379d0463a71aa2d98fdb1a_quiz03_1.pdf",
      "content": "1 of 13\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Sciences\nAnalysis and Design of Digital Integrated Circuits (6.374) - Fall 2003 Quiz #1\nProf. Anantha Chandrakasan\nStudent Name:\n\nProblem 1 (30 Points): _____________________\nProblem 2 (24 Points): _____________________\nProblem 3 (18 Points): _____________________\nProblem 4 (28 Points): _____________________\nTotal (100 Points): _____________________\nUse the following device parameters unless otherwise specified:\nAlso assume that all NMOS device bulks are connected to 0V and PMOS well termi\nnals are connected to VDD.\nSTATE ANY ASSUMPTIONS YOU MAKE IN SOLVING PROBLEMS and\nSHOW YOUR WORK. Points might be taken off if you don't explain how you arrived\nat your answer.\nThere are 13 pages in total\nParameter\nNMOS\nPMOS\nVT0\n0.4 V\n-0.4V\nK' = μ Cox\n75 μA/V2\n-25 μA/V2\nVDSAT\n0.5V\n-0.75V\nγ\n0.3V1/2\n-0.3V1/2\n|2φ|\n0.6V\n0.6V\nλ\n\n2 of 13\nProblem 1: Driver Circuit: Consider the following circuit driving a capacitive load of 1pF.\n\n(a) Assuming that In swings from rail-to-rail (0 to 2.5V), what is the swing on the node Out? (2 points)\n(b) At the switching threshold VM = 1.75V, what is the mode of operation for M1 and M2. Show your work\n(4 points)\nVDD= 2.5V\nM1\nM2\nOut\nCL = 1pF\n+-\nVlow = 1V\nIn\n\n3 of 13\n(c) Assuming (W/L)2 = 25μm/0.25μm, determine (W/L)1 such that VM = 1.75V. (6 points)\n\n4 of 13\n(d) Assuming (W/L)2 = 25μm/0.25μm, determine the low-to-high propagation delay using the method of equivalent\nRC. Assume that the input switches from 2.5V to 0V with a zero fall time (8 points)\n\n5 of 13\n(e) Assuming that the input switches at a clock frequency of 100MHz with a swing of 0 to VDD (with zero rise and fall\ntimes) what is the average power dissipation of this circuit? Show your work (10 points).\n\n6 of 13\nProblem 2: Pass Transistor Logic\n(a) Consider the following circuit implemented using NMOS and PMOS pass transistors. Assume that the inputs and\ntheir complements (A, A, B, B) swing rail-to-rail (0 to VDD). What is the function implemented by the two circuits. (6\npoints)\n(b) Assuming that the primary inputs (A, B, C, D) and their complements are have rail-to-rail swing (0 to VDD), what\nis the voltage swing on outputs Y and Z? (4 points)\nA\nB\nZ\nB\nA\nVDD=2.5\n\nA\nY\nB\nB\nA\nin0\nin0\nin1\nin1\nout1\nB\nA\nB\nA\nY\nout2\nZ\nY =\nZ =\nVDD=2.5\nin0\nin0\nin1\nin1\nout1\nB\nA\nB\nA\nout2\nin0\nin0\nin1\nin1\nout1\nD\nC\nD\nC\nout2\nin0\nin0\nin1\nin1\nout1\nY\nout2\nZ\n\n7 of 13\n(c) Using the same style of logic in part 2(a) (i.e., using NMOS, PMOS pass transistors connected to signal or VDD/\nGND), create the minimal transistor implementation of the OR/NOR function. Your implementation should have the\nsame swing as the circuits in 2(a) (6 points)\n\n8 of 13\nConsider the following cross-coupled complementary pass-gate logic\n(d) What is the logic function Y implemented by the above gate? What is the voltage swing on nodes Y and Y ?\n(4 points)\n(e) Assume that A, A, B, B are from ideal voltage sources and have a rail-to-rail swing (0 to VDD). Also assume (just\nfor this part) that there is no body effect (γ = 0) and ignore sub-threshold conduction. Is this a ratioed circuit? Explain.\n(4 points).\nMp2\nMp1\nM1\nM2\nB\nB\nA\nA\nM3\nM4\nB\nB\nA\nA\nVDD = 2.5V\nVDD = 2.5V\nY\nY\n\n9 of 13\nProblem 3: Dynamic Logic\n(a) Complete the circuit schematic of the DCVSL gate below (6 points)\n(b) What is the function of Mp1 and Mp2? Is this a ratioed circuit? (4 points)\nCLK\nD\nOut\nB\nC\nA\nOut\nMp2\nMp1\nVDD\nVDD VDD\nVDD\nCLK\nCLK\n\n10 of 13\n(c) Consider the following function Y= A+ B+ C implemented using a cascade of two 2-input DOMINO OR gates.\nAssume that p(A=1) = 0.1, p(B=1) = 0.2, p(C=1) = 0.5. Determine the order of inputs to minimize power dissipation\n(show numerical analysis). Explain. Fill in the empty boxes with the appropriate inputs. (8 points)\n\n11 of 13\nProblem 4: Multiple Threshold CMOS Circuits: This problem explores issues related to leakage in MTCMOS cir\ncuits. Just for this problem, assume that the low threshold NMOS and PMOS devices have the following device\nproperties (ignore DIBL). All low-VT and high-VT devices are 1μm/0.25μm.\nConsider the circuit shown below (low threshold devices are shaded).\n(a) During active mode (SLEEP = 0), provide the logic function for Out (4 points)\nParameter\nNMOS\nPMOS\nVTlow\n0.3V\n-0.3V\nVThigh\n0.5V\n-0.5V\n|Io| for a 1μm/0.25μm\nDevice (Drain current when\nVGS=VT)\n1μA\n1μA\n|S| (Sub-threshold slope)\n100mV/Decade\n100mV/Decade\nSLEEP\nSLEEP\nOut\nA\nB\nM1\nM2\nM3\nM4\nM5\nM6\nM7\nM8\nM9\nM10\nM11\nM12\nVDD=2.5V\nVDD\nVDD\nB\nB\nB\n\n12 of 13\n(b) Assuming SLEEP = 0 (Active mode), compute the total leakage when A=0, B=0? A numerical result is\nexpected. Draw all the contributing leakage paths on the figure below (10 points)\nSLEEP\nSLEEP\nOut\nA=0\nB =0\nM1\nM2\nM3\nM4\nM5\nM6\nM7\nM8\nM9\nM10\nM11\nM12\nVDD=2.5V\nVDD\nVDD\nB\nB\nB\n\n13 of 13\n(c) Assuming SLEEP = 1 (Sleep mode) and A=0, B=1. In the Sleep mode, ideally, the leakage should be small and be\nset by high-threshold devices. Unfortunately, this is not always the case for distributed sleep devices as shown below.\nIdentify (but do not compute) any leakage path(s) from VDD to ground which are determined by low-threshold\ndevices (i.e., not cut-off by high-threshold devices). (8 points)\n(d) For the same assumption of part (c), what do you expect the leakage through device M9 to be:\n(1) 10pA\n(2) 1nA\n(3) >> 1nA\nBriefly explain why (6 points)\nSLEEP\nSLEEP\nOut\nA = 0\nB =1\nM1\nM2\nM3\nM4\nM5\nM6\nM7\nM8\nM9\nM10\nM11\nM12\nVDD=2.5V\nVDD\nVDD\nB\nB\nB\nx"
    },
    {
      "category": "Exam",
      "title": "quiz03_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/9fa744fa82b5788e9207586a0fdc4cf3_quiz03_2.pdf",
      "content": "1 of 13\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Sciences\nAnalysis and Design of Digital Integrated Circuits (6.374) - Fall 2003 Quiz #2\nProf. Anantha Chandrakasan\nStudent Name:\n\nProblem 1 (30 Points): _____________________\nProblem 2 (24 Points): _____________________\nProblem 3 (22 Points): _____________________\nProblem 4 (24 Points): _____________________\nTotal (100 Points): _____________________\n\nFor the entire quiz, ignore body effect (γ=0) and leakage effects. Also assume that all NMOS\ndevice bulks are connected to 0V and PMOS well terminals are connected to VDD.\nSTATE ANY ASSUMPTIONS YOU MAKE IN SOLVING PROBLEMS and\nSHOW YOUR WORK\nThere are 13 pages in total\n\n2 of 13\nProblem 1: Carry Skip Adder: In this problem, we will explore the addition of two numbers based on the Carry\nSkip (or Carry Bypass) technique.\na) Consider the following 16-bit Carry Skip Adder. Assume that the Sum Logic (SL) block for stage i has as inputs Pi,\nGi, and Cin,i. Assume the following delays:\n-\nDelay to produce the Pi, Gi signals from the Ai, Bi inputs is 1 (i.e., the delay of the PG_L block)\n-\nDelay to compute Cout_i from Pi, Gi and Cin,i inputs is 1 (i.e., the delay of the Carry Logic (CL) block)\n-\nDelay to compute Si from Cin,i, Pi, Gi being valid is 2 (i.e., the delay of the Sum Logic (SL) block)\n-\nDelay for the 2:1 multiplexor is 2\n-\nDelay to compute the group propagate, GPi, is 1 (assume for the entire problem that this delay is independent of\nthe fan-in)\nHighlight the critical path for this 16-bit adder directly on Figure 1 (4 points)\n(b) What is the delay for a 32-bit adder assuming equal block sizes of 4 and making the same assumptions of delay as\n1 (a)? (4 points)\nFigure 1: A 16 bit Carry Skip Adder with a block size M = 4.\nCL\nPG\nA0 B0\nSL\n_L\nCL\nPG\nA1 B1\nSL\n_L\nCL\nPG\nA2 B2\nSL\n_L\nCL\nPG\nA3 B3\nSL\n_L\nS0\nS1\nS2\nS3\nGP0= P0P1P2P3\nCL\nPG\nA4 B4\nSL\n_L\nCL\nPG\nA5 B5\nSL\n_L\nCL\nPG\nA6 B6\nSL\n_L\nCL\nPG\nA7 B7\nSL\n_L\nS4\nS5\nS6\nS7\nGP1= P4P5P6P7\nCL\nPG\nA8 B8\nSL\n_L\nCL\nPG\nA9 B9\nSL\n_L\nCL\nPG\nA10B10\nSL\n_L\nCL\nPG\nA11B11\nSL\n_L\nS8\nS9\nS10\nS11\nGP2= P8P9P10P11\nCL\nPG\nA12B12\nSL\n_L\nCL\nPG\nA13B13\nSL\n_L\nCL\nPG\nA14B14\nSL\n_L\nCL\nPG\nA15B15\nSL\n_L\nS12\nS13\nS14\nS15\nCin,0\nCout,15\n\n3 of 13\n(c) Consider an N-bit Carry Skip adder with equal block sizes of M-bits. With the same timing assumptions of 1(a),\nderive the optimum block length M, for an N-bit adder. (6 points)\n(d) Consider a transmission gate implementation of a 4-bit Carry-Skip section. Derive the signals S1, S2, and S3 as a\nfunction of Pi and Gi. Will this circuit work if Pi = A +B? Explain. (8 points)\nP0\nG0\nCin\nP1\nG1\nP2\nG2\nS1\nS2\nS3\nG3\nCout,3\nFigure 2: A transmission gate implementation of a 4-bit Carry Skip section.\n\n4 of 13\n(e) Consider the following 32-bit adder variation where the block sizes of each stage are not equal. Highlight the crit\nical path directly on Figure 3. What is the delay of the critical path? (8 points)\nP,\nA0,B0\nBits1-3\nA1-3,B1-3\nP,G\nG\nBits 4-8\nP,G\nA4-8,B4-8\nBits 9-15\nP,G\nA9-15,B9-15\nBits 16-22\nP,G\nA16-22,B16-22\nBits 23-27\nP,G\nA23-27,B23-27\nBits\nA28-30,B28-30\nP,G\n28-30\nP,\nA31,B31\nG\nBits1-3\nBits 4-8\nBits 9-15\nBits 16-22\nBits 23-27\nBits\n28-30\nSum Logic\nFigure 3: A 32-bit Carry Skip Adder with a variable block size.\n\n5 of 13\nProblem 2: Sequential Element: Consider the following circuit. Assume that each inverter takes 1 time unit for a\nlow-to-high or high-to-low transition. Assume that it takes 1 time unit for a pull-up path or pull-down path to pull-up\nor pull-down, respectively. Ignore any leakage effects. Assume VDD >> VT. Also assume that there is no skew\nbetween CLK and CLK and assume that the rise/fall times on all signals are zero.\n(a) Complete the timing diagram below. What type of sequential element is the above circuit? Be specific. (8 points)\nVDD\nD\nCLK\nVDD\nD\nCLK\nQ\nX\nY\nI1\nI2\nI3\nI4\nI5\nI6\nD\nQ\nCLK\nSE\nFigure 4: Sequential Element.\nSymbol\nCLK\nD\nX\nQ\n\n6 of 13\n(b) What is the setup time, tsu, hold time, thold and propagation delay, tp of this sequential building block relative to\nthe appropriate edge(s)? Explain. (6 points)\n\n7 of 13\n(c) Consider the following simple sequential system built using the sequential element in Figure 4. Assuming that\nthere is no skew in distributing the clock, what is the minimum possible clock period for which this sequential sys\ntem will function? Assume that the primary input In is setup before the appropriate clock edge(s). (6 points)\n(d) What is the maximum positive skew on the clock to SE2 such that the circuit still functions? (4 points)\nQ\nD\nIn\nCombinational\nLogic\nQ\nD\nCLK\nSE1\nSE2\nCLK\ntlogic (cd) = 2\ntlogic = 10\nOut\nFigure 5: Simple Sequential System.\n\n8 of 13\nProblem 3: Sequential Circuit: Consider the following circuit. Assume that each inverter takes 1 time unit for a\nlow-to-high or high-to-low transition. Also assume that it takes 1 time unit for a pull-up path or pull-down path to\npull-up or pull-down, respectively. Assume that ratioed circuits are properly sized (i.e., assume that the devices in the\ncross-coupled inverters are weak and can be overpowered). Assume that the rise/fall times on all signals are zero.\n(a) Complete the following timing diagram for QSD, QSD#, END. (8 points)\nCLK\nVDD\nD\nCLK\nCLK\nCLK\nCLK\nQSD\nQSD#\nVDD\nVDD\nVDD\nI2\nI1\nI3\nI4\nI5\nI6\nI7\nI8\nI9\nI10\nEval\nEval#\nEND\nFigure 6: Sequential Circuit.\nCLK\nD\nEND\nQSD\nQSD#\n\n9 of 13\n(b) Assuming that the circuit of Figure 6 directly drives a dynamic DCVSL gate (i.e., differential N-type dynamic\nlogic clocked by CLK), what is the setup time of the circuit in Figure 6 relative to the appropriate clock edge?\nExplain. (4 points)\n(c) What is the hold time, thold and propagation delay, tp, of the circuit in Figure 6 relative to the appropriate clock\nedge? (4 points)\n\n10 of 13\n(d) Consider the following sequential implementation which includes both differential dynamic logic and static logic.\nThe circuit below has a major problem. Identify the problem and propose a solution (draw a gate level schematic).\n(6 points)\nFigure 7: Sequential System.\nQSD\nQSD#\nCircuit of\nD\nCLK\nFigure 6\nDynamic\nDCVSL\nLogic\ngate\nOut\nOut#\nStatic\nLogic\nOut_static\nPositive\nEdge\nTriggered\nCLK\nRegister\nCLK\n\n11 of 13\nProblem 4: Interconnect Issues: For this entire problem assume CI/CL = 5. (CI is the interwire capacitance and CL is\nthe line capacitance to the substrate). An inverter is modeled using resistors and an ideal switch. The switch is con\nnected either to the top resistor or the bottom resistor.\n(a) Consider the 2-line bus shown in Figure 8. Compute the total energy drawn from the power supply VDD for the\ntransition of (In0, In1) from 01 to 10. (6 points)\nFigure 8: 2-bit bus.\nCL\nCI\nLINE 0\nCL\nLINE 1\nR\nVDD\nR\nIn0\nIn1\n\n12 of 13\n(b) Consider the following modification in which the inverters are replaced by tri-state inverters. When the enable\nsignal En is low, the tri-state does not drive the LINE. In addition, a switch with a small resistance R is added in par\nallel with CI which is closed when the control signal S = 1. Consider the same transition as 4(a) in which (In0, In1)\nswitches from 01 to 10. However, before the transition happens, the switch is shorted and then opened. Assume that\nthe time period when the switch is closed is long enough for all the transients to settle. Compute the total energy\ndrawn from the power supply VDD. (8 points)\nCL\nCI\nLINE 0\nCL\nLINE 1\nIn0\nIn1\nEn\nEn\nS\nR\nR\nVDD\nR\nEn\nIn0\nIn1\nEn\nS\nFigure 9: Modified driving scheme for a 2-bit bus.\n\n13 of 13\n(c) Consider the following input sequence, which represents all the possible transitions for 2 input bus.\n\nTransition Sequence: 00J00J01J10J11J00J10J10J01J11J01J01J00J11J11J10J00\nWhat is the difference in energy drawn from the power supply for the above sequence using the approach in 4(b) vs.\n4(a). For the scheme in part 4 (b), assume that you may choose on a transition by transition basis if the switch should\nbe closed before the transition happens. If the switch is closed between transitions, assume that the tri-state driver is\noff during that period. (10 points)"
    },
    {
      "category": "Resource",
      "title": "guidelines.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/3fd5ad1346a5389abc54bd158606a17a_guidelines.pdf",
      "content": "Project Report\n- Template is posted on the course web page (two\ncolumn and TWO pages MAX)\n- One page of Text (2 column):\n- Clearly introduce the problem and why it is\nimportant\n- Describe and cite previous work (2-3 references)\n- Describe your basic contribution and ideas (make\nsure you indicate what parts worked and what\nparts did not work)\n- Describe the three most innovative ideas pursued\nin your project (even if it does not work!)\n- Any suggestion for future work\n- One page of Figures (2 column - 8 figures max)\n- Overview (e.g., block diagram of system)\n- 3 or 4 detailed (circuit schematics or architecture\nissues)\n- 3 or 4 simulations\n- Include a path for your simulations (make sure we\nhave the appropriate permissions on athena)\n- Turn in four copies of the 2-page report and the\ntechnical summary sheet\n\nProject Presentation\n- Schedule will be sent via email this week:\n- 12/9 (in class and from 5:30-7PM)\n- Mail Alex your final project title and team member\nnames.\n- Time per group: 10 minutes for a two student team\nand 15 minutes for a 3 person team. This includes\nQ &A.\n- Content\n- Clearly introduce the problem and what has\npreviously been done\n- Describe your basic contribution and ideas\n- Describe the three most innovative ideas\npursued in your project\n- What is the impact of your project (e.g., Factor\nof 10 reduction in Power without loss in\nperformance, etc.)\n- Pick one or two interesting simulations to show\n- Provide us with one hardcopy of the viewgraphs\npresented.\n- Everyone is expected to make a presentation"
    },
    {
      "category": "Resource",
      "title": "technicalsummary.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/7b958ae6c59b2644c47598508c945a96_technicalsummary.pdf",
      "content": "_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n6.374 Final Project - Technical Summary Sheet\nYou may complete this form by hand. Please use ONLY the space provided.\nProject Title: ______________________________________________________\nAuthors:\n______________________________________________________\nList the three most innovative ideas of your project.\n1. _______________________________________________________________\n2. _______________________________________________________________\n3. _______________________________________________________________\nList the contributions of each partner.\n1. _______________________________________________________________\n2. _______________________________________________________________\n3. _______________________________________________________________\nProvide a path to your files on the class server and provide instructions on how to\nrun the simulations if necessary."
    },
    {
      "category": "Resource",
      "title": "inv_tut.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/d0d647954588f3d039b7adeae57cbc50_inv_tut.pdf",
      "content": "Sample Inverter Layout"
    },
    {
      "category": "Resource",
      "title": "hspice02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/16ffd3d3befdc29de92c8fbe38d9cc24_hspice02.pdf",
      "content": "------------------------------\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nUsing HSPICE\nFall 2002\nIssued: 9/10/02\nI.\nBasic Usage of HSPICE and Awaves\nStep 1.\nCreate an HSPICE file\nAll HSPICE files should have an .sp extention.\nType in athena prompt:\n% emacs inv.sp &\nSimple HSPICE file1:\n*CMOS Inverter - DC Sweep\n* Netlist\n* Define Voltage Sources\nvdd 1 0 2.5\nvin in 0 pvdd\n* Define Transistors\nm1 out in 1 1 pch l=0.25u w=1.125u as=0.7p ad=0.7p ps=2.375u pd=2.375u\nm2 out in 0 0 nch l=0.25u w=0.375u as=0.7p ad=0.7p ps=2.375u pd=2.375u\n* Define Output Capacitance\nCout out 0 30f\n* Define Parameters\n.param pvdd=2.5V\n* Models\n.lib 'logic025.l' TT\n* Analysis\n* post option necessary for awaves\n.options nomod post\n\n------------------------------\n------------------------------\n------------------------------\n* DC sweep from 0 to 2.5V at 0.01V increments\n.dc vin 0 pvdd 0.01\n.end\nSimple HSPICE file2:\n*CMOS Inverter - Transient Analysis\n* Netlist\n* Define Voltage Sources\nvdd 1 0 2.5\nvin in 0 pulse(0v 2.5v 1n 0.1n 0.1n 4n 8n)\n* Define Transistors\nm1 out in 1 1 pch l=0.25u w=1.125u as=0.7p ad=0.7p ps=2.375u pd=2.375u\nm2 out in 0 0 nch l=0.25u w=0.375u as=0.7p ad=0.7p ps=2.375u pd=2.375u\n* Define Output Capacitance\nCout out 0 30f\n* Models\n.lib 'logic025.l' TT\n* Analysis\n* post option necessary for awaves\n.options nomod post\n* Transient Analysis for 10ns\n.tran 0.01n 10n\n.end\nThere are three main sections in the file:\na.\nthe netlist: Netlist is a designation for a computer readable representation of the circuit schematic.\nb.\nthe models: A model in spice is a description of the parameters of the equations used by spice to analyze\nthe circuit.\nc.\nthe analysis to be performed: here we are requesting a DC sweep from 0 to 2.5 with 0.01V increments and\na transient analysis for 10 ns with step 0.01n.\nd.\nthe end of the file. This isn't really a main section, but hspice won't work without it, and many people for\nget about it. Always put a .end statement at the end of your file.\nStep 2.\nIf you haven't done so, add spice (this command also adds awaves):\n\n% add hspice\nRun spice in the background, and direct the output to a file for later reference:\n% hspice inv.sp > inv.out &\nWhen the simulation is complete, you should have some *.sw* (DC \"sweep\" data) and/or *.tr* (transient analysis\ndata) files:\n% ls\ninv.sp\ninv.out\ninv.sw0\ninv.tr0\nStep 3.\nNow, we use awaves to display the data generated by hspice stored in the .sw and .tr files:\n% awaves inv &\nTo view waveforms, select the node number (or node name) that you want to see with the mouse button and drag and\ndrop them in the highlighted panel. Double-clicking on the node numbers also brings up the waveforms. Panels are\nhighlighted when they have a red border. The graph window will display the waveforms which can be measured using\na variety of features.\nNOTE: awaves doesn't run on Linux."
    },
    {
      "category": "Resource",
      "title": "cadtutorial_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/674b609b91535023e25047539fb3a906_cadtutorial_03.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nCAD Tutorial: An Introduction to Magic\nFall 2003\nIssued: 9/10/03\nCAD Tools for 6.374\nWe will use three CAD tools for 6.374: Magic, HSPICE and Nanosim.\nMagic is used for drawing the layout of circuits. With the layout, we can perform extraction from layout to\na HSPICE deck for simulation. The HSPICE deck contains information about the geometry of individual\ndevices and parasitic capacitances of interconnects. It is similar to the HSPICE decks that you may use for\nthe first problem set. This tutorial covers the basics of how to use Magic.\nMagic Tutorial\n\nDrawing a CMOS gate: 2-Input NAND\nTask: Layout a 2-Input NAND gate with NMOS size 0.5/0.25 and PMOS size 0.75/0.25. Inputs should\nenter from the left in Poly and the output should exit the right in Poly. Power and Ground rails run verti\ncally in Metal 1.\nSTEP 1: Plan your design.\nIn the space provided on the left, draw the circuit schematic for a 2-Input NAND gate. In the space on the\nright, sketch the layout for your design.\n\nSTEP 2: Starting to Layout - Drawing the NFETs\nWhen you start Magic, a window should appear as shown in Figure 1. This is where you will draw your\nlayout. The window in which you started 'magic' now becomes the console and logs all the commands and\nmacros you type. Always point your mouse in the drawing window when you type a command or macro.\nFirst, to faciliate your drawing, make the grid appear by typing 'g' (with the mouse in the drawing win\ndow.) You may not see the grid because the zoom is inappropriate. Type 'v' to zoom to the current selected\nobject, which is a square. Type 'Z' to zoom out by a factor of 2 and 'z' to zoom in. The size of a small\nsquare is 1 λ.\nFigure 1: Magic window.\nSketch the Schematic\nSketch the Layout\n\nDoing layout involves drawing rectangles and painting them to represent various layers. We will now draw\nan n-channel MOSFET (the uppermost one in the pair). At any point, to undo a the last step, type 'u'.\nStep 1: Drawing the source,drain and channel region.\nAnchor one corner of a rectangle by clicking the left mouse button (in the Magic window). To select the\nother corner of the rectangle, click the right mouse button. (Make sure your mouse cursor looks like a\ncross-hair. If not, press space bar a few times until you see it.) Select a 17x4 rectangle. With the mouse in\nthe window type (yes, include the ':')\n:paint ndiff\nYou should see a green rectangle as shown in Figure 2\nStep2: Drawing the poly gate\nUsing the same method, select a 2x8 rectangle overlaping the green rectangle. Type\n:paint poly\nAdd a second rectangle of poly three boxes away from the first.\nYou should see two red rectangles overlapping the green rectangle as shown in Figure 3. The overlapping\nregions are the channels of our two NFET devices.\n\nStep 3. Drawing the M1 output contact\nFigure 2: Source, drain and channel region\nFigure 3: Poly gates over channel with source and drains on the side\n\nSelect a 4x4 rectangle on the right side of the green rectangle. Type\n:paint ndc\nThis is a metal to n-diffusion contact. You do not need a contact on the source because it abuts directly with\nthe other NMOS device. Add a contact to the source of the second NMOS device (far left side).\nLayer Names\nThe names of some various 'layers' are:\nm1 - metal1\nm2 - metal2\npdiff - p+ diffusion\npdc - p+ to metal 1 contact.\nnwell - nwell for the p-channel MOSFET\nnwc - nwell to metal1 contact\npwc - p substrate to metal1 contact\npc - poly to metal1 contact\nm2c - metal1 to metal2 contact\nShort-cuts for drawing\nInstead of typing ':paint ...', once you have the basic layers on the drawing, you can copy and paste as fol\nlows. Select a rectangle. Point the mouse at a region in the drawing which has the color you want to paint\nthe selected rectangle and click the middle button. To erase a certain rectangle, click the middle button with\nthe mouse pointed on the background.\nBreaking and fixing design rules\nWhen design rules are broken, magic gives a warning by covering the rectangle which has violated design\nrules with an array of white dots.\nIn your drawing, select the tip of the poly and paint it gray. Type 'y' with the mouse in the dotted region to\nsee what design rule has been violated. In this case, the console reads:\nPoly overhang of Transistor < 2 (Mosis #3.3) [nfet,pfet space/\nactive,poly,pres,rp,pc/a poly,pres,rp,pc/a]\nPractice breaking and fixing a few design rules. And now, BACK TO THE NAND GATE....\nSTEP 3 - Drawing the PFETs\nNow draw the two PFETs above the NFETs. Give yourself LOTS of space for wiring and for meeting\ndesign rules. To draw the PFETs, you will need to lay down an n-well, p-diffusion, poly, and contacts. Is\nthe location of the contacts the same as for the NFETs?\nFigure 4 shows the layout with all four FETs in place.\n\n.\nSTEP 4 - Wiring up the NAND gate\nTo connect metal to a via, just draw metal touching the via. For example, select a rectangle of at least 3x3\ntouching any contact. Type\n:paint m1\nThis paints a layer of metal 1.\nWire up the gates of the FETs in poly. You will have to jumper one of the gates in metal1 to bring poly out\nto the left of the design. Now wire up the output node. Remember that you want to minimize capacitance\nat this node. Now wire up the power and ground. Are all of the connections in the circuit complete?\nNO! You need to make contacts for the body terminals of your devices. Find the right type of contact in\nthe layer list, and add the well contacts to your design.\nSTEP 5 - Labeling your circuit\nOnce your have drawn your circuit, you need to label the ports so that you can do an extraction of the lay\nout into a circuit, including geometrical information and parasitics.\nFigure 4: Four FETs (2 parallel PMOS, 2 series NMOS)\n\nClick the middle of the VDD power strip with the left mouse button, followed by the right mouse button.\nType\n:label VDD!\nA label for VDD! appears. Do the same for the other nodes in the circuit.\nYou should get something like Figure 5 for your final layout. If you want to erase a label, select a rectangle\ncontaining the label and type\n:erase label\nNote: The '!' in 'VDD!' represents that it is a global signal. It is the same when used in all instances.\n(Refer to the section on hierachical designs about making instances of cells.)\nFigure 5: NAND gate complete with labels\n\nSTEP 6 - Saving, loading and extracting\nTo save, type\n:save tutorial\nTo load, type\n:load tutorial\nTo extract the layout into a circuit for simulation in HSPICE and Irsim, type\n:extract\nThis will create a file tutorial.ext which can be converted into a HSPICE deck and Nanosim deck using\next2spice and ext2sim respectively. We will discuss this later.\nYou can type\n:quit\nto exit Magic.\nSTEP 7 - Creating and Verifying your netlist\nConvert the layout to a spice netlist. View the netlist to see if it looks correct.\nAre there any problems?\nYou will find that CAD tools never do everything you would like. For example, the netlist sizes devices in\nterms of a scaled unit, but it uses the wrong scale unit! Also, the names of the FETs are nfet and pfet, not\nnch and pch. VLSI designers become masters at writing scripts to tie together CAD tools and to make\nthings work.\nMore short cuts for drawing\nSelecting and Moving\nYou may want to move certain blocks. To select a rectangle, point the mouse over the rectangle and type\n's'. To select a whole region, select a rectangle, and type 'a'\nOnce a rectangle or block is selected, you can move them by typing 'q' for left, 'w' for down, 'e' for up\nand 'r' for right.\nHierarchy in designs\nIn the layout of complex circuits, hierachy is very useful to maintaining modularity. For example, an 8-bit\nadder can be made from an array of 1 bit adders. However, to be able to do this, it is necessary to layout\ncells so that they can be made into modules by putting them next to each other.\nHere is an example of how to create an array of cells:\n:getcell name\nfinds the file name.mag on disk, reads the cell it contains, and creates an instance of that cell.\nTo turn the instance into an array, invoke the command:\n\n:array xsize ysize\nwhere xsize and ysize indicates how many elements the array should have in the x- and y-direction\nrespectively.\nTo see the layout in individual cells, use the command :expand all.\nHere is how to generate an array of your nand gate:\nStep 1. Layout the nand gate and save it with a name like 'tutorial'..\nStep 2. Use the command :getcell tutorial to create an instance of the nand gate.\nStep 3. Use the command :array 3 1 to make an array 3 by 1 of the gate.\nStep 4. Use the :expand to display the layout of each cell.\nYou probably would need to modify the original cell so that the inputs and outputs meet up correctly."
    },
    {
      "category": "Resource",
      "title": "magic_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-374-analysis-and-design-of-digital-integrated-circuits-fall-2003/2ced9fcaba8f790131132e769003aae6_magic_03.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.374: Analysis and Design of Digital Integrated Circuits\nUsing MAGIC\nFall 2003\nIssued: 9/04/00\nBasic Usage of Magic\nThe Basics\n1. Changing tools\nThere are 4 types of tools you can select in magic by pressing the space bar. The one that is used most often is the\nbox tool, which the mouse cursor looks like a cross hair. You should be using box tool when you are designing basic\ntransistor cells.\n: Box Tool\n\nCommands can be invoked in Magic in three ways: 1) by pressing buttons on the mouse; 2) by typing single key\nstrokes on the key board (called macros); 3) typing longer commands on the keyboard (called long commands).\nWhen you're giving commands, make sure that the mouse cursor is on the cell window, not on the command window.\nLong commands are invoked by typing a colon(:). After you type the colon or semi-colon, the \">\" prompt on the\ncommand window will be replaced by \":\". ( When you're giving macro or mouse commands, the cursor on the com\nmand window should be \">\" )\nMost of the commands that we will be using are the default macros. In general, commands are sent to MAGIC using\nthe format \":[keyword] [arguments]\". To see a list of commands or to get help on a particular, use the \":help [key\nword]\" command.\n3. Viewing\nThe first thing you should do is show the grid. Typing \"g\" will turn the grid on/off. (or \":grid 1\" (1 lambda per divi\nsion) or \":grid 2\" (2 lambda per division)).\nHere are some ways to view the cell.\nmacro command\nlong command\ndescription\nv\n:view\nView the entire cell.\nz\nZooms in to the area specified by rectangle\nZ\n:zoom 2\nZooms out by a scale factor of 2\n,\nCenters screen about mouse cursor, keeping\nzoom factor constant\nPainting Layers / Design Rules\nYou will need to draw rectangles a lot. To draw them, use the left mouse button to set one of the corners, and the right\nmouse button to set the other. If you already have a rectangle drawn, clicking the left mouse button moves the rectan\ngle and with its origin (the lower left corner) at the cursor location. Clicking the right mouse button will change the\nposition of the other corner of the rectangle, while keeping the origin at the same point. This is useful for resizing\nbox sizes. Practice this a little. The middle mouse button copies all the layers under the mouse cursor location to the\ncurrently drawn box. (more on this later.)\nNow you're ready to draw the transistors. In general, it's best to save drawing the wells (pwell and nwell) for last.\nSpecify a box about 5 lambda tall and 1 lambda wide. Now, type \":paint poly\". Note that the box is now red, which\nis poly. Note also that white dots have appeared next to it. This means that you have violated a design rule. To find\nout exactly what design rule you have violated, draw a box containing some white dots and press \"y\". Some informa\ntion regarding the drc (design rule check) violation(s) will be displayed in the text window.\nOnce you have drawn a piece of poly, you no longer need to type \":paint poly\". All you need to do to draw another\nbox of poly (or any other layer) is to specify a new box, then move your mouse pointer to the layer(s) to be copied\ninto the box and press the middle mouse button. Remember, however that all the layers will be copied; a common\nmistake is to copy multiple layers by accident.\n^D is the converse of the middle mouse button; pressing ^D will delete all the layers under the mouse cursor from the\ncurrently specified box.\nHere are some of the more common paint layers:\nSingle layers\np or poly or polysilicon or red\nPolysilicon\nblue or m1 or metal1\nMetal 1\nm2 or metal2 or purple\nMetal 2\ncyan or m3 or metal3\nMetal 3\n\ngreen or ndiff or ndiffusion\nn-type diffusion (for use w/ NMOS)\nbrown or pdiff or pdiffusion\np-type diffusion (for use w/ PMOS)\npw or pwell\np-well (for use w/ NMOS)\nnw or nwell\nn-well (for use w/ PMOS)\nComplex layers\nnfet or ntransistor\nPoly over ndiffusion (NMOS)\npfet or ptransistor\nPoly over pdiffusion (PMOS)\nContacts\npc or pcontact or polycontact or polycut\nPoly to Metal1\nm2c or m2contact or m2cut or v or via\nMetal1 to Metal2\nm3c or m3contact or m3cut or v2 or via2\nMetal2 to Metal3\nndc or ndcontact or ndiffcut\nn-diffusion to Metal1\npdc or pdcontact or pdiffcut\np-diffusion to Metal2\npwc or pwcontact\np-well to Metal1 (for well contacts, usually)\nnwc or pwcontact\nn-well to Metal1 (for well contacts, usually)\nEditing / Moving Rectangles\nTo edit or move objects, you must specify them. This is how:\ns\nselect the largest box containing all the layers under the mouse cursor.\nS\nkeep the current selection and add another box containing all the layers under the current cursor position.\na\nselect everything under the specified box.\nd\ndelete selected object\nc\ncopy selected object (distance from origin of box to cursor position specifies where copy is placed)\nm\nmove selected object (distance from origin of box to cursor position specifies where object is placed)\ne\nq r\ndirection to move a selected object by 1 lambda\nw\nE\nQ R\ndirection to stretch a selected object by 1 lambda\nW\nMagic has a large undo/redo buffer. Paint, move and experiment with these options:\nu\nundo\nU\nredo\nFinally, don't forget to save your work:\n:save mylayout\nThe filename will be called \"mylayout.mag\".\nThere are still many topics not covered; only the very basics were covered. Reading the magic tutorials is highly rec\nommended.\nStep 3.\n\nLayout an inverter following the attached layout. Once your layout is done, we need to extract the circuit for simula\ntion. If you used the technology file option when you started magic, the extraction style should default to the standard\nfor 6.374. Simply type the following:\n:extract\nThis will create a \"filename.ext\" file that can be used by ext2spice and ext2sim.\nStep 4.\nTo simulate a circuit in HSPICE, run ext2spice on the .ext file:\nThe\n% ls\ninverter.ext\ninverter.mag\n% ext2spice inverter\n% ls\ninverter.ext\ninverter.mag\ninverter.spice\nThe .spice file will only have transistor information (parasitic R and C are included); voltage sources, .model state\nments, .sweep and .tran statements must all be added.\nThe macros are listed below for your convenience:\nMacro '^D' contains \"erase $\" (erase layer(s) under cursor from sel. region)\nMacro '^L' contains \"redraw\"\nMacro '^N' contains \"iroute route -dSelection\"\nMacro '^R' contains \"iroute route -dBox\"\nMacro '^X' contains \"expand toggle\"\nMacro ' ' contains \"tool\"\nMacro ',' contains \"center\"\nMacro '.' contains \"macro\" (repeat last command)\nMacro '?' contains \"help\"\nMacro 'A' contains \"select more area\"\nMacro 'B' contains \"findbox\"\nMacro 'C' contains \"select clear\"\nMacro 'E' contains \"stretch up 1\"\nMacro 'G' contains \"grid 2\"\nMacro 'O' contains \"closewindow\"\nMacro 'Q' contains \"stretch left 1\"\nMacro 'R' contains \"stretch right 1\"\nMacro 'S' contains \"select more\"\nMacro 'T' contains \"stretch\"\nMacro 'U' contains \"redo\"\nMacro 'W' contains \"stretch down 1\"\nMacro 'X' contains \"unexpand\"\nMacro 'Z' contains \"zoom 2\"\nMacro 'a' contains \"select area\"\nMacro 'b' contains \"box\"\nMacro 'c' contains \"copy\"\nMacro 'd' contains \"delete\"\n\nMacro 'e' contains \"move up 1\"\nMacro 'f' contains \"select cell\"\nMacro 'g' contains \"grid\"\nMacro 'o' contains \"openwindow\"\nMacro 'q' contains \"move left 1\"\nMacro 'r' contains \"move right 1\"\nMacro 's' contains \"select\"\nMacro 't' contains \"move\"\nMacro 'u' contains \"undo\"\nMacro 'v' contains \"view\"\nMacro 'w' contains \"move down 1\"\nMacro 'x' contains \"expand\"\nMacro 'y' contains \"drc why\"\nMacro 'z' contains \"findbox zoom\"\nEXAMPLE\nINVERTER\nathena % magic\nMagic 6.4.4 - Compiled on Wed Jun 21 00:22:15 EDT 1995.\nUsing technology \"scmos\", version 8.2.6.\nMOSIS Scalable CMOS Technology for Standard Rules\nUnable to allocate 7 planes in default colormap; making a new one.\nBlack = 0 White= 1\n\nUsing new basepixel = 128\nOnly 126 contiguous colors were available.\nMagic news (07 Jun 1995):\nRev. 8.2.6 of the MOSIS SCMOS technology file is now installed.\n<jgealow@mtl>\nIf you need help using Magic, send mail to cad-problems@mtl.\n>\n:paint pdiff\n:paint ndiff\n:paint poly\n:paint pdc\n:paint ndc\n:paint pc\n:paint m1\n:label IN left pc\n:label OUT right m1\n:label Vdd! center m1\n:label GND! center m1\nSelected cell is inv (Topmost cell in the window)\n:save inverter\n:extract style SCNE12(ORB)\nExtraction style is now \"SCNE12(ORB)\"\n:extract all\nExtracting inverter into inverter.ext:\n:quit\nathena %"
    }
  ]
}