{
  "course_name": "Ancient Philosophy",
  "course_description": "This course will acquaint the student with some of the ancient Greek contributions to the Western philosophical and scientific tradition. We will examine a broad range of central philosophical themes concerning: nature, law, justice, knowledge, virtue, happiness, and death. There will be a strong emphasis on analyses of arguments found in the texts.",
  "topics": [
    "Humanities",
    "Literature",
    "Classics",
    "Philosophy",
    "Humanities",
    "Literature",
    "Classics",
    "Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course will acquaint the student with some of the ancient Greek contributions to the Western philosophical and scientific tradition. We will examine a broad range of central philosophical themes concerning: nature, law, justice, knowledge, virtue, happiness, and death. There will be a strong emphasis on analyses of arguments found in the texts.\n\nCourse Requirements\n\nWeekly reading assignments will range from about 30-100 pages per week. It is essential that students read these assignments in preparation for class meetings. Attendance in class is required. A significant portion of the final grade will depend on active class participation.\n\nThere will be three 5-7 page papers due during the term. Paper topics will be distributed in advance. Papers must be on one of the listed topics unless an alternative topic is approved.\n\nStudents must participate in a \"text analysis presentation\" [TAP] twice during the term. In a TAP, pairs of students are assigned a paragraph of text and are responsible for presenting an interpretation of the passage to the class, together with several follow-up discussion questions. Normally TAPs will occur on Wednesdays, though Mondays may be added to accommodate everyone. Sign-up for TAPs will begin during the first class.\n\nThere is no final exam for this course.\n\nEvaluation\n\nThe student's final grade will be based on written work, class participation, and improvement over the term. Each essay will count approximately 25% of the final grade; the remaining 25% will depend on TAP presentations and class participation. Late papers will be graded down unless an extension is granted in advance of the due date (except, of course, in case of medical emergency).\n\nACTIVITIES\n\nPERCENTAGES\n\nThree Essays\n\n25% each\n\nTAP Presentations and Class Participation\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "acat.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/880ed2368cb537f700611c8ea77b2717_acat.pdf",
      "content": "24.200: Ancient Philosophy\nNovember 1, 2004\nAristotle's Categories\nAristotle's Categories is naturally viewed as part of his logical writings. In it he distinguishes\nvarious kinds of claims we make, and various relations we assert in making those claims. This\nleads him to a list of broad classification of things; it is plausible to take this set of categories to\nbe the broadest classification of all the things that there are in terms of their highest genera. I.e.,\nAristotle is proposing that ultimately there are 10 fundamentally different kinds of things. This\nis his list, with some examples:\nsubstance: Socrates, Plato, horse, human being, animal\nquality: pale, square, grammatical\nquantity: 6 ft. tall, 12 inches long\nrelation: half, larger\nwhere: in the marketplace\nwhen: tomorrow, in October\nposition: is lying, is sitting\nhaving: has shoes on\ndoing: cutting, hitting\nbeing affected: being cut, being hit\nOverlaying this classification of things, there is a further fourfold distinction which relies on a\ndistinction between two kinds of predication:\nbeing said of and being present in.\nAnimal is \"said of\" Socrates (think of this in terms of essential predication: Socrates could not\ncease to be an animal and continue to exist); Pale is \"present in\" Socrates (think of this in terms\nof accidental predication: Socrates could cease to be pale and continue to exist). This is the\nfourfold classification which further divides the items in the 10 categories:\na) what is both said of and present in things (non-substance species and genera)\nb) what is said of but not present in things (species and genera of substance)\nc) what is present in but not said of things (non-substance individuals)\nd) what is neither present in nor said of things. (individual substances)\nIn addition to classifying the things that exist, Aristotle is concerned to ask whether there are\nsome sorts of things which should have a privileged status in our theorizing. Are there some\nsorts of things which are more significant than others, egg., some sorts of things which are\nontologically or epistemologically basic? We can rephrase this question more simply by\ndividing it into two issues:\na) Are there some sorts of things on which the existence of everything else depends, i.e., things\nsuch that if they failed to exist, nothing else would exist?\nb) Are there some sorts of things which are required for systematic understanding of the world,\n\ni.e., things such that if they failed to exist we couldn't have such knowledge?"
    },
    {
      "category": "Resource",
      "title": "afunction.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/66565b93124b6b84b9a27c9561d85bb9_afunction.pdf",
      "content": "24.200: Aristotle\nProf. Sally Haslanger\nNovember 15, 2004\nAristotle on the Human Good\nAristotle believes that in order to live a well-ordered life, that life must be organized around an\nultimate or supreme good which is the goal or end of all action. Think of it this way. Practical\nreason enables us to determine what means are appropriate given certain ends; this allows that\nwe might have many ends in life. But when the ends conflict we are either stuck with no way to\n(rationally) proceed, or we must have some way of ordering the ends, i.e., a way to rank them in\norder of priority. Aristotle thought the way to provide this rank ordering of ends was to have\nsome one ultimate end in terms of which the others could be ordered. Thus, in the well-ordered\nlife there is some ultimate end towards which all action, desire, activity, is directed. (Note that\nthe supreme or ultimate good need not be defined in terms of a single dominant value, but may\nhave as constituents a number of things which count as good, e.g., pleasure, practical and\ntheoretical activity....etc. In other words, it might be a complex good.)\nIt is important to recall that there are different kinds of goods. This claim we find in Plato\n(Republic II) as well as in Aristotle's Nichomachean Ethics (NE). Some goods are intrinsic, some\ninstrumental, some both. Each thing that we do is done either as a means to an end which is\nchosen for its own sake, or it is an end in itself, or both. For example, health is chosen both as a\nmeans to and as a constituent of happiness; so it is chosen both for the sake of happiness, and\nfor its own sake. Health is a mixed good; it is both intrinsically and instrumentally good. The\nfinal or supreme good is chosen for its own sake and not for the sake of anything else; e.g.,\nhappiness is always chosen for its own sake and not for the sake of some higher goal. We don't\nwant to be happy because this enables us to achieve some other goal; we want to be happy\nsimply in order to be happy. The question arises: what is this supreme good? How is it related\nto (a) happiness, (b) moral virtue, (c) contemplation?\nFrom the characterization of what it is to be a \"supreme good,\" it looks like happiness is the best\ncandidate for the supreme good for a human life. It is what is chosen for its own sake and not\nfor the sake of anything else. But immediately more questions arise. Aristotle wants to know,\nwhat are the constituents of a happy life? What does it take to be happy, truly happy? Can we\ncharacterize the life of complete human flourishing? What would such a life include?\nAristotle, like Plato and Socrates before him, believes that the happy life is the life of virtue or\nexcellence. The outlines of his main argument for this claim appear in Nicomachean Ethics I:7;\nthe argument has traditionally been called the \"function argument\".\nAristotle takes it to be unproblematic to claim that the highest good for human beings is\nhappiness. He says,\nBut presumably the remark that the best good is happiness is apparently\nsomething <generally agreed, and what we miss is a clearer statement of what\nthe best good is. Well, perhaps we shall find the best good if we first find the\nfunction of a human being. For just as the good, i.e., <doing> well, for a\nflautist...and, in general, for whatever has a function and <characteristic> action,\nseems to depend on its function, the same seems to be true for a human being, if\na human being has some function. (1097b22-28)\n\nRecalling our discussion of Aristotle's views in the Physics and On the Soul, the function of\nhuman beings will be specified in terms of the characteristic activity towards which our natural\ndevelopment aims. The main steps of the argument are as follows:\nI. The good for human beings is the performance of our function, i.e., our characteristic activity,\nin an excellent manner. (1097b26-28)\n--If there is more than one kind of excellence, then the good for humans will\nbe in the best and most complete. (1098a17-18)\nII. The characteristic activity of human beings is the activity of the rational element, for reason\nis distinctive of humans. (See On the Soul II:3 414b35-415a14, NE I:7 1097b33-1097a8, and I:13)\n--Nutrition, growth, and reproduction are common to all living things.\n--Perception is common to all animals.\n--Reason is distinctive of humans.\nIII. Therefore, the good for human beings is the activity of the soul in conformity with the\nexcellence of our rational element. (NE I:7 1098a4-18)\nWe can continue to explicate this excellence further, as follows:\nIV. The rational element of human soul is twofold, and likewise, its excellence is of two kinds:\nintellectual wisdom is the excellence of theoretical reason, and practical wisdom is the\nexcellence of practical reason. (NE I:13 1103a4-10)\nV. The excellence of practical reason is a state of character, which given opportunities for\nexpression, leads to a life of moral virtue. (See NE II:6 1106b36-1107a2, and NE X:8 1178a9-b7)\nVI. The excellence of theoretical reason is the activity of contemplation. (NE X:7 1077a11-18).\nVII. Since what is distinctive of humans is the dual nature of their rational element, the\ndistinctively human good will be a life combining moral virtue and contemplation. (e.g., NE X:7\n1077b27-30)\nVIII. However, if we focus on what is best in humans (and what is closest to the divine), the\ngood will be a life of contemplation. (See, NE X:7-8)\nQuestions: After having devoted considerable attention to the excellence of practical reason,\nand its expression in moral virtue, Aristotle turns at the end of the work to emphasize the virtue\nof theoretical reason and its expression in contemplation. Is there an irreconcilable tension in\nhis view? Does the function argument force him to favor the life of contemplation over the\npolitical life of moral virtue? What assumptions are leading him to favor contemplation?\nCould one resist those assumptions while remaining true to the principles of the function\nargument?\nAristotle's account of happiness rules out certain characterizations of the happy life, e.g., it isn't\na life spent in the pursuit of money, nor is it a life spent in the pursuit of honor, etc. His view is\nthat a perfect human life is one which consists in activity in accordance with virtue, i.e., moral\nexcellence; this is the life of human flourishing; this is the supreme good for humans (even\n\nthough some of us don't understand that this is the supreme good and mistakenly choose some\nother good as our ultimate end).\nAlthough Aristotle thinks that most people would agree with the claim that the final good is\nhappiness, he thinks that they would not agree with the philosophical definition of happiness --\nactivity in accordance with virtue. They will think that happiness is some obvious thing like\npleasure or wealth. He thinks they are wrong, but not completely on the wrong track. For\nexample, although happiness cannot be identified with pleasure, nonetheless the happiest life is\nthe most pleasant. Aristotle thinks that his view can account for this because virtuous activity is\nin itself pleasant. The pleasures associated with virtue are pleasant by nature, and are more\npleasant than the pleasures the majority pursue: the latter pleasures, in addition to being\ninferior, come into conflict with each other.\nSo in addition to the function argument, Aristotle offers a variety of further considerations\nwhich support the view that the human good, i.e., the happy life, consists in the activity of the\nsoul in conformity with excellence of the rational element. His strategy is to articulate a number\nof principles concerning happiness and the human good, and to argue that they are best\nsatisfied by the virtuous life (as he has defined it). (See especially, e.g., NE I:5 and X:6) These\nprinciples include:\na) The happy life is pleasant; the happy life will be free of excessive suffering and grave\nmisfortune. (I:5 1095b34-1096a1, also I:8 1099a6-b8)\nb) The human good is something only humans can achieve. (I:7 1098a1)\nc) Happiness should not depend wholly on other people or things, but is one's own.\n(I:5\n1095b23-26)\nd) Happiness, or human good, is relatively stable, and is not easily lost. (I:5 1095a24-26)\ne) Happiness involves activity. (I:5 1095b32-1096a1, also I:8 1098b34-99a3)\nf) Happiness, as a supreme good, is chosen for its own sake, and not for the sake of something\nelse; it is a complete end. (E.g., I:2, and I:7 1097a15-b7)\ng) Happiness is (at least to some extent) self-sufficient; your life would not be improved if it\nwere to have something other than or in addition to happiness. (I:7 1097b7-21)\nh) Happiness can be achieved in action, in a human life. (I:6 1096b35-37)\nConsider a common set of candidates for the good life (below). In which of these lives will one\nbest be able to achieve the happiness characterized by (a-h)? How does Aristotle argue that (4-\n5) are better than (1-3) in offering happiness?\n1) The life of enjoyment.\nEnd: pleasure\n2) Military/Political life.\nEnd: honor\n3) Money-making life.\nEnd: money, material goods\n4) Life of practical excellence.\nEnd: moral virtue\n5) Contemplative life.\nEnd: theoretical wisdom\nQuestions:\nThere is a temptation to hesitate here, for we might be inclined to say that what constitutes a\nflourishing human life might differ between people; some people may flourish in one kind of\nlife, others in others (think of Plato?); some may flourish as professors, others in business, others\nas farmers, others as nurses. No particular life is required in order to be fully happy. Can\nAristotle accommodate this idea?\n\nThere is a sense in which Aristotle can agree with this; for there are moments when Aristotle\nseems to suggest that what matters in a life is not what you've chosen to do, e.g., to be a\ncarpenter or to be a farmer, but the kind of character you have developed to make choices and\nrespond to situations. If you are a person who has developed your capacity for practical reason,\nand if you have had the experience and habituation to develop the dispositions to act and feel\nappropriately, then as long as your life is not beset with gross misfortune, you can flourish.\nHow does this fit in with Aristotle's function argument? Consider it this way: Aristotle could\nsay that our function qua humans is concerned with our specifically human capacities, e.g., for\npractical reason, choice, etc. Your development of these capacities, in whatever domain you\nfind yourself, is a kind of human excellence. So even if there are more specific social functions,\ne.g., one person functions in the society as a farmer, another as a soldier, the\nvirtue/excellence/happiness of each will be a matter of their ability to develop the states of\ncharacter which do justice to these human capacities.\nIt is worth noting that it may be that some circumstances may prevent one from developing the\ncapacities in a way which allows excellence. E.g., it may be that a slave is not in a position to\nexercise choice, or to develop the states of character which stem from acting out of practical\nreason because the slave is, so to speak, governed from without. Thus, although it may be that\nany of a range of choices regarding the specifics of a life may be consistent with virtue; if one is\ndenied choice altogether, then one is thereby denied the possibility of virtue. (In effect, one is\ndenied one's humanness?)\nBut there are other parts of Aristotle which conflict with this picture, or suggest that there is\nmore to the story. In NE book X:6-9, A returns to the notion of happiness and suggests that\nthere is a hierarchical ranking of happy lives. The happiest life, i.e., the life which most fully\nembodies the supreme good, is the life of contemplation. Commentators have found this\npuzzling for centuries. What is Aristotle claiming here and how does it relate to the earlier\nbooks of NE and their arguments? At the beginning of X:7 he says:\nIf happiness, then, is activity expressing virtue, it is reasonable for it to express the\nsupreme virtue, which will be the virtue of the best thing. The best is understanding,\nor whatever else seems to be the natural ruler and leader, and to understand what is\nfine and divine, by being itself either divine or the most divine element in us. Hence\ncomplete happiness will be its activity expressing its proper virtue; and as we have\nsaid that this activity is the activity of study. This seems to agree with what has been\nsaid before, and also with the truth. (1177a12-19)\n(The editors emphasize in the note that contrary to his suggestion that he is repeating here\nsomething he's already said, he hasn't made this point before, at least not explicitly.) Aristotle\nthen goes on to suggest that contemplation best fits the requirements placed on the supreme\ngood, and is the best candidate for the account of what happiness consists in. He argues that\ncontemplation (theoretical wisdom) is, among human activities:\n-the best\n-the most continuous\n-most pleasant\n-most self-sufficient\n-most free and leisurely\n-especially loved for its own sake.\nFurthermore, (and importantly), A suggests that if we consider the different kinds of activities\n\nwe engage in, and if we consider what kind of thing we are, we will find that we are theorizing\nbeings; beings whose highest function is to theorize. Thus the highest excellence for us will be\nto pursue this highest function; and the perfect life of human flourishing will be the\ncontemplative life.\nHow might we relate this to the earlier views about moral virtue?\nI) There is a conflict between the two positions:\nAristotle has changed his mind during the course of writing the text; there is no coherent\nposition in the NE. Earlier he counts moral virtue as the supreme good; here he counts\ncontemplation as the supreme good.\nII) There is no conflict between the positions:\na) Aristotle still believes that moral virtue is the supreme good, but sees that\ncontemplation is inseparable from moral virtue; thus contemplation is included in the\nsupreme good as a constituent of moral virtue. For example: moral virtue requires\nknowledge and choice; in order to have knowledge and to exercise choice we must\ndevelop the capacity to theorize. [Problem: this isn't what he actually says in X:7...]\nb) Aristotle believes that contemplation is the supreme good, but also realizes that\ncontemplation is inseparable from moral virtue; so moral virtue is also part of the supreme\ngood as a constituent of contemplation. For example: friendship a constituent of the\ncontemplative life? [Problem: moral life defined by virtue as its supreme end;\ncontemplation won't have virtue as its supreme end.]\nc) Aristotle believes that moral virtue and contemplation are distinct parts of the supreme\ngood. [Problem: because their demands sometimes conflict, we don't have a well-ordered\nlife. If we give them an order, on what basis do we order them? Isn't the basis for our\nordering the supreme good?]"
    },
    {
      "category": "Resource",
      "title": "akrasia.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/f98a2982e6d0da95adfbf47eb6608f7c_akrasia.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nSocrates on Weakness of Will\nOne of Socrates' most puzzling views is the claim that AKRASIA, or weakness of will, is\nimpossible. We seem to encounter weakness of will on a daily basis. What is weakness of will?\nStandardly, cases of weakness of will are characterized as those in which one knows or believes\nthat a certain action is better than another, but voluntarily does the worse action instead. There\nseem to be many ways this can occur. For example, in spite of my judgement that it is best not\nto have a cigarette with my morning coffee, I may nevertheless go ahead and indulge, while\ncontinuing to think that the best thing for me to do would be to forego it. Or, in spite of my\njudgement that it would be far better for me to give my lottery winnings to charity rather than\nuse the sum to buy CD's, I may nevertheless use it to buy the CD's, and give none of it to\ncharity.\nYet Socrates seems to maintain that such incontinent actions are not possible. He claims, eg., in\nthe dialogue Protagoras (See also Apology 25d8-26a7):\nNo one who either knows or believes that something else, which is in his power\nto do, is better than what he is doing, subsequently does the other, when he can\ndo what is better. (358b7-c1)\nand:\nNo one freely goes for bad things or things he believes to be bad; it's not...in\nhuman nature to be prepared to go for what you think to be bad in preference to\nwhat is good. And when he is forced to choose one of two evils, nobody will\nchoose the greater when he can have the lesser. (358c6-d4)\nI. Desire and action in the Meno\nAlthough Socrates' view that weakness of will is impossible conflicts with our ordinary\nexperience of life, his view seems to rest on very plausible assumptions. To see his point, it is\nimportant to consider more closely the relationship between desire and action. In the Meno\n(77c-78b), (and elsewhere), Socrates argues for the claim that:\nNO ONE DESIRES BAD THINGS; ALL PEOPLE DESIRE GOOD THINGS.\nOn the face of it, this appears to commit Socrates to the claim that:\n1) If an action is bad/evil, then one will not desire to do it; and if an action is good,\nthen one will desire to do it.\nWe can then add a further premise to connect this to action:\n2) If I desire to perform or avoid an action, and it is in my power to do so, then I will\n\ndo so.\nFrom this it appears that we can conclude:\n3) If an action is good, and it is in my power to perform it, then I will perform it; and\nif an action is bad, and it is in my power to avoid it, then I will avoid it.\nBut if these conclusions are correct, then if an action is bad, and I perform it anyway, it must not\nhave been in my power to avoid it, ie., I must have done it involuntarily. So bad action is never\nvoluntary.\n\nThis argument lacks plausibility as it stands because the premise from the Meno Socrates relies\non (i.e., (1) above) seems false. Moreover, it seems to be a much stronger conclusion than the\nthesis that weakness of will is impossible: the argument leads to the conclusion that no wrong\naction is voluntary, but this goes beyond saying that action I believe to be wrong is involuntary.\nPerhaps we should look for a different version of the argument that points to the latter rather\nthan the former conclusion.\nII. The Meno argument: second thoughts\nTo start, let's consider the argument (1-3) as it stands. Should we accept the conclusion that no\none desires bad things, and everyone desires good things? It would seem not. For example,\nsuppose that I desire to eat a mushroom quiche I made from some mushrooms I found on a\nwalk in the woods. Unbeknownst to me, the mushrooms are poisonous. Eating the quiche\nwould be a bad thing, yet it is something I desire. Socrates considers this objection in the Meno.\nHe points out the distinction to Meno between:\na) Desiring bad things, knowing or believing they are bad.\nb) Desiring bad things, not knowing or believing they are bad.\nHe argues that if one desires something bad, not knowing it is, then the object of one's desire is\nsomething believed good, even if actually bad. In short, he argues that:\nIf one believes an action to be good, then one will desire to do it; and\nIf one believes an action to be bad, then one will not desire to do it.\nThe point here is to link our evaluations with our desires. Consider our practices of evaluation.\nOften we make initial evaluations of courses of action, and find that several actions might be\ngood, or that one action appears better than another. As we proceed in our evaluations,\nweighing all the pros and cons, we finally come to a judgement about what's the best thing for\nus to do in the circumstances. Socrates is proposing that this evaluation leads us to action: we\nwant to do what we judge to be overall best in the circumstances. As he puts it in the quote\nmentioned: \"it is not in human nature to go for what you think to be bad in preference to what\nis good.\" But once we've modified his claim to read:\nNo one desires what one judges overall to be bad; one desires what one judges overall\nto be good.\nThe claim seems much more plausible. And if we revise the other premises accordingly, then\nwe are faced with the paradox of denying weakness of will. E.g.,\n1*) If one believes that an action is bad/evil, then one will not desire to do it; and if\none believes the action is good, then one will desire to do it.\n2*) If one desires to perform or avoid an action, and it is in one's power to do so, then\none will do so.\nFrom this it appears that we can conclude:\n3*) If one believes that an action is good, and it is in one's power to perform it, then\none will perform it; and if one believes that the action is bad, and it is in one's\npower to avoid it, then one will avoid it.\nBut this argument yields a conclusion which denies weakness of will, yet it is not at all clear\nwhich premise we should deny. All of the premises seem plausible, but they are inconsistent\nwith the common sense claim that:\n\nSometimes I judge an action to be overall best, and nevertheless fail to perform it.\nIII. Possible responses:\n--As a matter of fact, weakness of will is impossible. Ordinary cases are not what they\nmay seem, i.e., (3*) is unproblematic.\n--The premise that we always desire what we judge best is false; judgement and desire\nis not linked in this way, i.e., (1*) is false.\n--The premise that we always act on our desires (where possible) is false, i.e., (2*) is false..\nDivide and Conquer?\nSo far we have not distinguished different ways that something can be bad. On one hand\nthings which are harmful, or against our self-interest are bad for us; on the other hand things\nmay be judged morally good or bad. If we are sensitive to this distinction we may see that the\nargument can be divided into two different conclusions:\n- If I judge that an action is best for me, and it is in my power to perform it, then I will perform\nit.\n- If I judge that an action is morally best, and it is in my power to perform it, then I will\nperform it.\nConsider how this distinction might affect Socrates' crucial premise:\nNo one desires what they judge to be (morally) bad.\nNo one desires what they judge to be harmful (bad for them).\nThe first is clearly less plausible than the second, since people may make judgements not only\non the basis of moral right and wrong, but factoring in other things they value. Ie., our desires\nmay be responsive to other concerns besides moral value. But this in fact suggests that there are\ntwo paradoxical ideas at stake:\nPrudential paradox:\nNo one desires what's bad or harmful (for oneself).\nAll those who pursue what's bad or harmful (for themselves) do so involuntarily.\nMoral Paradox:\nVirtue is (moral) knowledge, i.e., one is virtuous if and only if one has moral\nknowledge).\nAll those who act immorally and do what is wrong do so involuntarily, i.e., out of\nignorance.\nIV. Where are we now?\ni) We are still left with the prudential paradox if we grant the claim that people don't desire\nwhat they judge to be bad for them.\nii) There also seem to be reasons to take seriously the moral paradox. Consider the following\narguments:\nI.\na) If an action is right, it will contribute to one's flourishing; if an action is wrong it\nwill frustrate one's flourishing.\nb) If one has knowledge of what is right and wrong, then one will know what\ncontributes to one's flourishing and what won't.\nc) If I know that an action contributes to my flourishing, then I will desire to\n\nperform\n\nit.\n\nd) If I desire to perform an action (and it is in my power to do so, etc.), I will.\ne) If I know that an action is right, then (if it is in my power to do so, etc.) I will perform it.\n(from a-d)\nf) If I don't perform it, either I must have lacked moral knowledge, ie., I must have acted in\nignorance, or the action must not have been within my power.\ng) In either case the action is not voluntary.\nII.\na) If I know what is right and wrong, I will know what is best overall.\nb) If I know what is best overall, then what I think best, is best.\nc) If I think an action is best, then I will want to perform it.\nd) If I want to, then I will, unless prevented.\ne) If I don't do the right action, I must either have been prevented, or I must not have known\nwhat was right overall.\nf) In either case, the wrongness of my action was not voluntary."
    },
    {
      "category": "Resource",
      "title": "arsciencehdo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/a7ac3ced6a1ea1776cc14f10cf4c3d29_arsciencehdo.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nNovember 10, 2004\nAristotle on Science\nI. Scientific Knowledge\nScientific knowledge is unified and systematized. To have scientific knowledge of something is\nnot just to know that it is so, but also to know why it is so. (E.g., I don't have scientific\nknowledge that water becomes steam when heated unless I know why it does.) To know why it\nis so, is to know the more general or basic facts which are the reasons for its being so; science\naims to connect particular facts and events with these more basic and general facts. (E.g., we\nknow why water becomes steam when heated when we connect that fact with the more basic\nfacts about the chemical composition of water and the laws that concern heat.) So one may\nhave knowledge of a particular matter of fact without having scientific knowledge of it, i.e.,\nwithout a scientific explanation of it.\nAristotle believed that what is scientifically known is what is demonstrable, i.e., it must be the\nconclusion of a demonstration. A demonstration is a syllogism (or string of syllogisms) which\nis valid, the premises of which are necessarily true, and which is such that the premises are\nmore knowable than and prior to the conclusion. A paradigm syllogism is a (valid) argument\nconsisting of two premises and a conclusion, the premises and conclusion each having one of\nthe following forms:\nA:\nAll A's are B's.\nE:\nNo A's are B's.\nI:\nSome A's are B's.\nO:\nSome A's are not B's.\nFor example:\n\nAll kittens are cats.\n\nAll cats are ANIMALS.\nAll kittens are ANIMALS.\nIn this argument the premises and the conclusion are all of the form (A). The major term of a\nsyllogism is the predicate of the conclusion (in the above argument 'ANIMALS'); the minor term\nis the subject of the conclusion ('kittens'); the middle term is the term that occurs in the premises\nand not in the conclusion ('cats').\nWe gain scientific knowledge of lunar eclipses once we know that there are occasions when the\norbit of the moon places the earth between the moon and the sun; knowing this we know why\neclipses happen, but note that knowing why the eclipse happens is also just knowing what a\nlunar eclipse is. In other words, knowing why eclipses happen is importantly related to knowing\nthe real definition of an eclipse. This suggests that definitions play a crucial role in scientific\nknowledge.\nWe can connect the role of definition in scientific knowledge with scientific explanation in the\nfollowing way. Note that there are demonstrations that don't yield scientific knowledge\nbecause they don't tell us \"why\", but only \"that\" something is so. For example, compare the\nfollowing two demonstrations (see 93a37-b8):\nA.\nOccasions when an apparently unveiled full moon causes no shadows are lunar eclipses.\n\nThis is an occasion when an apparently unveiled full moon causes no shadows.\nTherefore, this is a lunar eclipse.\nB.\nOccasions when the earth screens the moon are lunar eclipses.\nThis is an occasion when the earth screens the moon.\nTherefore, this is a lunar eclipse.\nIn both cases we have a demonstration of a fact that something is so, but only in (B) do we have\na demonstration of why it is so. It is part of the nature of an eclipse that it occurs when the earth\nscreens off the sun's light so that the moon cannot reflect the sunlight. So the cause or nature of\nan eclipse is given in the premise of the demonstration (B). In (A) the premises do not give the\ncause or explanation of the eclipse. The moon's failing to cause shadows may be the evidence\nfor the occurrence of an eclipse, but in order to understand what an eclipse is, i.e., in order to give\na scientific definition of an eclipse, we must understand it to be a screening of the sun's light by\nthe earth. This definition is provided in (B) and not in (A).\nThe principles of Aristotelian science will only contain necessary and universal truths; it is by\napplying these general truths to the world that we explain particular individuals, events, and\nprocesses. If we can determine that a particular individual, event, or process is of a certain kind,\nscientific principles will enable us to offer demonstrations concerning objects of that kind.\nNote, however, that Aristotle allows that we acquire knowledge by means other than\ndemonstration--e.g., we acquire knowledge in part by means of experience; and he allows that\nwe apply knowledge by means other than demonstration. What he is claiming is that science\nearns its status as a systematic and unified body of knowledge because of its demonstrative\nstructure.\nThe statement of a definition is a primary truth that is known, but not known by demonstration.\nIt is clear that there must be some basic principles that are not known by demonstration but\nwhich serve as the ultimate premises in demonstration. If we gained all knowledge through\ndemonstration, then every premise of a demonstration would have to be proven through a\nfurther demonstration resting on even more basic principles. (See, e.g., Posterior Analytics I: 3)\nBut demonstration must stop somewhere. The primary truths serve as these stopping points.\nDefinitions that serve as the primary truths will be known by some combination of observation\nwith nous. Nous is an intellectual capacity for obtaining non-demonstrable knowledge; it is\nplausible to think that our ability to abstract from particular cases is due to nous. (See Posterior\nAnalytics II: 19, esp. 100b7-13, and Posterior Analytics I:3. Note that the translation uses\n\"understanding\" as a translation for 'nous'; see fn. 22 p. 520.) So to know what an eclipse is, we\nmust make careful observations, and use nous to come up with the real definition of an eclipse.\nII. Accidents\nAccording to Aristotle, an event or state of affairs has a proper cause and can be explained only\nif it is the kind of thing that happens always or (at least) for the most part. More specifically,\nthere is an Aristotelian AITIA, or \"cause\" of an event or state of affairs only if there is some\ngeneral law of nature or some general principle which connects (always or for the most part) an\nAITIA of that kind with events or states of affairs of that kind.\nFor example, if the copper of which a statue is made (or, alternatively, the fact that the statue is\nmade of copper) is the \"cause\" of the statue's being green, then there must be a general principle\nstating that copper (or things made of copper) always or usually turn green under ordinary\n\nconditions. If this is not something that happens always or usually, then we cannot explain\nwhy the statue is green by pointing out that it is made of copper. (Suppose that the statue is\nmade of clay which has been painted green. We cannot explain why the statue is green by\npointing out that it is made of clay, for (among other things) clay is not always or usually\ngreen.)\nIf something cannot be subsumed under some principle which holds always or usually, then it\nis an \"accident\" or a coincidental state of affairs (e.g., it happened by chance), and it has no\ngenuine explanation. Science studies and investigates the regularities in nature, and the body of\nscience contains principles which are either always or usually the case. Since an accident is a\nkind of thing which does not happen always or usually, there is no science of the accidental\n(there is no science of what happens by chance), and there can be no scientific explanations of\naccidental states of affairs.\nAn example of an accident would be finding buried treasure when digging in the garden.\nUsually when one digs in the garden one finds dirt, plant roots, rocks, etc., but no buried\ntreasure. Thus, if when digging in the garden you find a rock, that is no accident -- that is the\nkind of thing that usually happens. However, if you find treasure, that is an accident precisely\nbecause this is not the kind of thing that usually happens. Since it is an accident, it simply has\nno proper cause or explanation. Another example: suppose that I go to the marketplace to\npurchase eggplant for a meal. I meet one of my debtors and collect some money owed to me.\nAccording to Aristotle, my meeting of the debtor has no proper (scientific) cause or explanation\nbecause it cannot be subsumed under some principle which holds always or for the most part.\nOne does not usually meet a debtor when going to the market to buy eggplant, thus the meeting\nis a coincidence.\nNotice that in both examples there is something which does have a proper cause. In the first\nexample, my digging in the garden is caused. Perhaps I want to plant a tree, and decide that the\ngarden is the best place for the tree. If so, it is easy to explain why I was digging in the garden.\nHowever, my digging in the garden coincides with my finding the treasure, and it is the latter\nthat simply cannot be explained. In the second example, my going to the market can easily be\nexplained: I wanted to buy eggplant, and one typically finds eggplant at the market. Thus I\nwent to the market. (Probably one can give an explanation of why my debtor went to the\nmarket too.) However, my going to the market coincides with my going to where my debtor is,\nand this latter state of affairs itself cannot be explained. Likewise, accidents in nature cannot be\nexplained."
    },
    {
      "category": "Resource",
      "title": "asubsthdo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/966b9b904ae6ae40dca146c2cf310cbe_asubsthdo.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nNovember 1, 2004\nAristotle on Primary Substance\nI. Substance in the Categories\nIn the Categories, Aristotle takes primary substances to be ordinary individuals like Socrates.\nWe noted in connection with this view that a primary substance must be what is both\nontologically and epistemically basic, i.e., they must be those things on which the existence of\neverything else depends, and on which our systematic knowledge depends.\nAristotle's view in the Categories that primary substances are ordinary concrete individuals\ndepended on his acceptance of what we called the subject criterion. I.e., primary substances are\nthe primary logical subjects, i.e., they are that in which properties (qualities, quantities, etc.)\ninhere, and which are themselves the members of kinds (species).\n\"A substance --that which is called a substance most strictly, primarily, and most of\nall-- is that which is neither said of a subject nor in a subject.\" (Cat. 2a11)\nPrimary substances are also the subjects of change:\n\"It seems most distinctive of substance that what is numerically one and the same is\nable to receive contraries [i.e., contrary properties].\" (Cat. 4a10)\n(E.g., a single individual may become hot, having been cold, or may change from being 5' tall to\nbeing 5'2\" tall.)\nIn his discussion of change in Physics I: 7-9, Aristotle feels the need to accommodate both the\ndemand that in any change something remain through that change, and the demand that there\nbe something \"new\" as a product of the change. To handle these demands, he distinguishes\nthree \"elements\" in any change: the matter, the form, the lack. The matter is what persists\nthrough the change as subject for the change. The form is what the matter/subject comes to be\n(i.e., the quality it comes to have, etc.). The lack is what the form replaces. For example, in the\ncase of Socrates turning tan, Socrates is the matter for the change; tanness is the form; not-tan\n(or pale) is the lack which is replaced by tanness in the change. In the case of the generation of a\nbronze statue, the bronze is the matter for the change (it is what persists as subject for the form\nof the statue). The \"form\" is the statue-shape which is produced. The \"lack\" is what the bronze\nloses (the lumpishness?) when it comes to have the shape of the statue. In some cases the \"lack\"\nand the \"form\" will have no name.\nIn addition to the simple elements of a change, viz., the matter, lack, and form, these \"elements\"\nmake up composites or complexes. Before the change there is a complex of [matter + lack]; after\nthe change there is a \"new\" complex of [matter + form]. On this schematic model we can see\nthat in any change there is always (a) something which \"goes out of existence\", (b) something\nwhich \"comes into existence\", as well as (c) something which continues to exist. The composite\nof [matter + lack] goes out of existence; the composite of [matter + form] comes into existence;\nthe matter remains.\nIt is very important to note that what counts as matter, lack, and form is relative to the change\none is considering. In the case of Socrates turning tan, tan is the form, not-tan (pale) is the lack.\nIn the case of Socrates turning pale, pale is the form and not-pale (tan) is the lack. In both of\nthese cases Socrates is the matter for the change. In the case of Socrates dying, Socrates' body is\nthe matter for the change, since the body is what persists through his death. Socrates himself is\n\nthe composite of body and soul which gives way to a new composite, the corpse. (Presumably\nthe form present in the corpse has no name).\nWithin this general model of change, we can distinguish two kinds of change: alteration, and\ngeneration/destruction. Intuitively, when an object alters, the object which changes continues to\nexist while gaining or losing a property (think of Socrates becoming tan). In contrast, when an\nobject is destroyed, it doesn't merely lose a property, it goes out of existence altogether (think of\nSocrates dying). We can accommodate this intuitive contrast within Aristotle's account by\nnoting that alterations are cases in which the \"matter\" for the change is an individual substance,\nand the \"lack\" and \"form\" are merely qualities, quantities, etc., of the substance. I.e., alterations\nare changes in an object's accidental properties. In the case of generation and destruction, we\nare considering a composite thing prior to the change, which is replaced by a new composite,\ni.e., the original [matter + lack] ceases to exist and is replaced by a new [matter + form]. An\nindividual substance such as Socrates will be generated just in case the \"form\" of the new\ncomposite is a substantial form, e.g., the essence or nature of human being (which is human soul).\nAn individual substance will be destroyed just in case the \"lack\" which is lost is a substantial\nform. So when Socrates dies, the body ceases to be informed by the soul, and Socrates (the\ncomposite of body and soul) ceases to exist.\nII. Four causes\nIn Physics II: 3, Aristotle introduces the doctrine of four \"causes\" or explanatory factors. A\n\"cause\" answers a \"why?\" question. Aristotle claims that there are four basic types of \"why?\"\nquestion, and corresponding to these there are four basic types of cause. The four causes are:\nFINAL CAUSE: (goal, end, aim, function, telos): Why does he walk? To stay fit.\nFORMAL CAUSE: (essence, structure, form, arrangement): Why is this body alive? Because it\nhas a soul (the soul being the form of the body). Why does the ball roll? Because it is a sphere.\nMATERIAL CAUSE: (constituent, that of which something is composed, or from which (as\nsubstratum) it comes to be): Why is this statue green? Because it is made of copper.\nEFFICIENT CAUSE: (the primary source of change/motion and rest): Why is he fit? Because\nhe walks.\nNotice that in the examples given above, fitness is the final cause of walking (i.e., it is the goal or\naim of walking) and walking is the efficient cause of fitness (walking is what causes the bodily\nchanges that constitute fitness). Aristotle also believes that in many cases the final and formal\ncauses coincide: the (ideal) form of human being is both that which makes humans what they\nare, and is the goal of human development.\nThe doctrine of the four causes applies best to biological objects. In the case of explaining\nbiological objects (their natural states, behavior, activities, development), one can typically give\nall four causes. This is connected to Aristotle's idea of a biological object for he believes that\nsuch objects should be understood as sets of material components (ultimately, earth, air, fire and\nwater) that are structured or formed in such a way as to move towards self-determined goals. This\nis true, for example, of human beings.\nGiven that human beings are made up of matter, there will sometimes be questions about us\nthat must be answered in terms of the kind of material to which humans are composed, e.g., a\nhuman body will fall through the air to the surface of the earth because it contains a great deal\nof earth. So if I were to fall out of a window, my falling would have to be explained in terms of\nmy material components. Yet, earth, air, fire, and water, are not of such a nature that by\n\nthemselves they would shape up into human beings. The simple mechanical principles\ngoverning these elements can in no way explain how it is, or why, masses of material get\nshaped up into living organisms. In order to explain this, Aristotle believes that we need a new\nlevel of explanation, i.e., FORMAL explanation. It is the form which is responsible for the\nparticular materials shaping themselves into a living organism. Further, many of the things\nhumans do can be explained only by the fact that they are human. For instance, I am capable of\nmaking moral choices and contemplating truth. This is something that cannot explained by\npointing out that I'm made of certain material components; one must turn to considerations\nsuch as what kind of thing I am, e.g., my form.\nIII. Substance in the Metaphysics\nNow that we have introduced the form/matter account of change, should we continue to say\nthat individuals such as Socrates are primary substances? What is the subject of change, i.e.,\nthat which persists while gaining and losing properties? What is that in which properties\ninhere? In Metaphysics VII:3, Aristotle argues that if we insist that primary substance is just\nwhat meets the subject criterion, then we are forced to say that matter is primary substance. As\nwe saw, the subject which continues to exist through Socrates' death is Socrates' body; but also,\nwhat continues to exist through the decomposition of Socrates' body will be (ultimately) the\nearth, air, fire, and water, of which his body is composed. And if water can give way to air (e.g.,\nin evaporation), then we should postulate something even more basic as the matter for such\nelemental change. But Aristotle is concerned that such basic material stuff can't properly play\nthe role of primary substance. Why not?\nTo put Aristotle's answer simply, matter can't be what is ontologically and epistemologically\nbasic. This partly depends on his view of science: on his account systematic knowledge rests\non knowledge of definitions, and strictly speaking, it is only form that can be defined. Even if\nwe try to define matter, what we are capturing is the structure or form of the matter. Moreover,\nwhen consider what it is for something to exist, we find that any thing must have a form.\nUnformed matter is nothing; any natural thing is a composite of matter plus substantial form.\n(Consider Aristotle's doctrine of \"four causes\". Remember that the form of an object will serve\nas its efficient, final, and formal cause; so the form will be responsible for the object's generation\nas well as its natural changes and activities.)\nIn keeping with these demands on primary substance, Aristotle articulates explicitly two\nfurther criteria for primary substance which must be considered in addition to the subject\ncriterion. (See Metaphysics VII:1-3, especially 1028a8-15 and 1029a27-29). (I have supposed that\nthese were in some sense implicit even when he was writing the Categories.)\n(a) A primary substance is what a thing is (think of an answer to Socrates' \"What is X?\"\nquestion); they are the primary objects of knowledge, and being so, they are objects of definition\nand the ultimate explanatory factors.\nAnd:\n(b) A primary substance is an individual and separable \"this\". Primary substance is what is\nresponsible for the unity and integrity of individual beings of the world.\nGiven the considerations of the Categories and the Physics, the best candidates for primary\nsubstance are matter, form, and the composite of matter and form. As I suggested above,\n\n(prime) matter cannot be primary substance for it is neither (a) what a thing is, i.e., that which is\nthe primary object of knowledge and definition, nor is it (b) a particular \"this\", i.e., a something,\na real being. Perhaps, then, the composite of matter and form is primary substance. But this is\nimpossible, for the elements of the composite surely are more basic (in both senses) than the\ncomposite. The composite cannot be a primary object of knowledge because to know a\ncomposite one must know its elements; and the composite cannot be ontologically basic since\nthe existence of the composite depends on the existence of its elements (and not vice versa).\nSo primary substance cannot be (prime) matter, or the composite of matter and form. As a\nresult, Aristotle argues that primary substance is SUBSTANTIAL FORM, i.e., the form (or\nessence, or nature) of particular substances such as Socrates. That is to say, in the composite of\nmatter and form which constitutes Socrates, it is the formal component which is the primary\nsubstance. This formal component is his essence. To know what Socrates is, is to know his\n(definable) essence; and the existence of Socrates depends upon the existence of his essence.\nThus Aristotle has revised his views between the time he wrote the Categories and the time he\nwrote the Metaphysics on what counts as primary substance. By the time of the Metaphysics, he\nno longer takes the subject criterion to be the true test of primary substance, but comes to see\nthat other factors must be emphasized in order to determine what is ontologically and\nepistemologically basic. His change of mind was motivated by his recognition of (i) the fact that\nordinary concrete individuals are composites of matter and form, and (ii) the fact that\ndefinition, and so definable objects, are required for scientific knowledge. Because substantial\nforms (or essences) are the proper objects of scientific knowledge, and because the substantial\nform is the cause of a natural object's unity and integrity, he ultimately decides that substantial\nforms, and not concrete individuals, are ontologically and epistemologically basic."
    },
    {
      "category": "Resource",
      "title": "avolunt.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/4fa344a3358118404862fafdadc627cc_avolunt.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nNovember 22, 2004\nAristotle on Voluntary Action\n1. What constitutes voluntary action? Under what conditions does one act involuntarily?\n2. When are we responsible for our actions, and so subject to blame and praise?\ninvoluntary:\n\"What comes about by force or because of ignorance seems to be involuntary. What is\nforced has an external origin, the sort of origin in which the agent or victim contributes nothing-\n-if, e.g., a wind or human beings who control him were to carry him off.\" (NE III: 1109b36-\n1110a4)\n\"What sorts of things, then, should we say are forced? Perhaps we should say that\nsomething is forced unconditionally whenever its cause is external and the agent contributes\nnothing.\" (1110b1-3, also 1110b14-16)\n\"Everything caused by ignorance is non-voluntary, but what is involuntary also causes\npain and regret.\" (1110b19, and 1111a32-b4)\ninvoluntary actions:\nA. Actions which are forced and painful/regretted\nB. Actions which are done by reason of ignorance (through ignorance, because of\nignorance), e.g., when ignorance is the genuine cause of the action, i.e., when knowledge of a\nsignificant particular is lacking.\nmixed actions;\nC. (non-voluntary): actions done through ignorance but not painful or regretted.\nD. (non-voluntary): actions done in ignorance, e.g., when one's state prevented one from\nmaking the appropriate choice:\ni) When knowledge of the universal is lacking.\nii) When one is moved by passion or incapacity (drunkenness).\niii) When one makes a bad judgement.\nE. Actions which are chosen, but under dire circumstances, i.e., the action would not be\nchosen for its own sake, i.e., it is not an action which would be chosen otherwise (e.g., throwing\ncargo off ship).\nvoluntary actions: \"...what is voluntary seems to be what has its origin in the agent himself\nwhen he knows the particulars that the action consists in.\" (NE III:1 1111a23-25)\nResponsibility:\n1. Voluntariness is not the sure test of responsibility, since animals and children behave\nvoluntarily, but are not responsible. One is responsible if the voluntary action (or mixed action)\narises from the kind of character which is responsive to deliberation.\n\n2. We are also responsible for some non-voluntary actions; though these cases will be harder to\nadjudicate, since it depends on the character and choice, also on the extent to which the\nindividual is responsible for the character and choice..."
    },
    {
      "category": "Resource",
      "title": "euthyhdo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/1772c321d915875bdb630a165988c3ac_euthyhdo.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nSocratic Definition and the Elenchus\nI. The Standard Pattern of Socratic Elenchus (Adapted from G. Vlastos: \"The Socratic\nElenchus\")\nDescription:\nA search for (moral) truth by adversary argument (of question and answer) in which:\n(1) a thesis is debated only if the one answering asserts it as sincerely held belief; [the \"say what\nyou believe requirement\"],\nand\n(2) the thesis is refuted if and only if its negation is shown to follow from some set of beliefs\nagreed upon by questioner and answerer.\nPurpose:\nThe Socratic elenchus has a double purpose: to discover truths about how one ought to live (i.e.,\nto discover moral truths), and to test the person who is answering to determine if they are living\na moral life. Thus, its purpose is both philosophical and therapeutic. Note that this underscores\nthe importance of the requirement that the interlocutor satisfy the \"say what you believe\"\nrequirement. The elenchus will provide a test of the interlocutor's virtue, and will assist one in\nthe task of becoming virtuous only if participation is sincere.\nProcedure:\n1. The interlocutor asserts a thesis P which Socrates considers false and targets for refutation.\n2. Socrates secures agreement to some further premises, egg., Q, and R. Q and R are\n(normally) not argued for.\n3. Socrates then argues, and the interlocutor agrees, that Q and R entail not-P.\n4. Thereupon, Socrates claims that P (the target thesis) has been shown false, not-P true.\nExample: (taken from Euthyphro 5c-6e with some re-ordering and adjustments):\nQuestion: What is piety and impiety, both with regards murder and other things?\nTarget thesis (P): The pious is what I am doing now, to prosecute the wrongdoer...not to\nprosecute is impious.\nAuxiliary hypotheses agreed upon:\n(Q):\nThe pious itself is the same and alike in every pious action.\n(R):\nThe impious is the opposite of all that is pious.\n(S):\nEverything which is impious presents us with one form or appearance insofar as it is\npious (e.g., both in murder and other things).\n(T):\nThere many other pious actions other than prosecuting the wrongdoer.\nConclusion (not-P): Then it is not the case piety (or the pious) is prosecuting the wrongdoer\n(because prosecuting is not common to all pious actions).\nIn this passage Socrates aims to refute the proposal (P), by showing that it conflicts with other\nbeliefs Euthyphro holds, viz., (Q), (R), (S), and (T). His explicit challenge to Euthyphro's\ndefinition of piety relies primarily on (Q) and (T). One cannot consistently hold that piety is\nwhat is common to all pious actions, that piety is prosecuting the wrongdoer, and that\n24.200: Notes on Euthyphro\n\nprosecuting the wrongdoer is not common to all pious actions. This example is not only a\nparadigm of elenchtic argument, but is also a paradigm of Socrates' quest for definition.\nII. The Socratic Quest for Definitions\nRegardless of the question being raised in discussion, Socrates typically leads the conversation\nto a concern with definition: What is virtue? What is piety? What is love?\nAssumptions:\nCommonality: There is a form (EIDOS) of piety that is the same in all and only pious things.\n(5d2-5)\nExplanatory Priority: The form of piety makes pious actions pious, i.e., it is what is responsible\nfor their being pious, and explains why they are pious. (6d10-e1)\n--the form is the essence or nature of piety\nIdeal/Standard: The form is a standard by which to judge which things are pious and which are\nimpious. (6e3-6)\nObject of Definition: This form or nature or essence of piety is what we seek in giving a\ndefinition, i.e., it will provide the correct answer to the \"What is X?\" question.\nCorollaries:\n1. The answer to \"What is X?\" cannot be an individual instance of X, since it must be common to\nall instances.\n2. Because the form must be the standard or ideal pattern for X's, it cannot be qualified by its\nopposite, i.e., it cannot be not-X.\n3. Since one role of the standard is to provide a basis for recognizing instances, we can make\nknowledgeable claims about instances of X, only if we have a definition.\nExample of an argument relying on explanatory priority: Euthyphro on Piety: 9d1-11b1\nAssume that:\n1) What is pious (i.e., what piety is) = what is loved by (all) the gods. (To be pious = to be loved\nby all the gods)\n2) Piety is what makes actions pious.\nBut:\n3) The gods love what is pious because it is pious,\nBut not:\n4) The gods love what is pious because it is god-loved.\nContrast:\nBeing pious is what makes actions god-loved.\nBeing god-loved is what makes actions pious.\nHow exactly does this argument work? Is it convincing?\nIII. Questions\n24.200: Notes on Euthyphro\n\nIs Socrates entitled to claim, on the basis of his method, that he has proven the target thesis\nfalse? I.e., is Socrates entitled to conclude that the hypothesis (P) is false and (not-P) true\nbecause he has shown that (P) is inconsistent with some further agreed upon premises?\nThe worry behind this question stems from the observation that one can avoid inconsistency in\na set of beliefs by denying any one of the set. In the example considered, Euthyphro need not\nhave agreed with Socrates to reject the target thesis. Instead, he might have chosen to reject (Q),\nviz., that the pious itself is the same in every pious action, or (T), viz., that there are other sorts\nof pious actions besides prosecuting the wrongdoer; in doing so, he would still avoid\ninconsistency. In fact, Socrates' interlocutors typically agree with him that the thesis to reject is\nthe target thesis, but this doesn't avoid the problem. The question remains: how do we know\nwhich belief to give up when we find an inconsistency in our beliefs? What conclusions should\nwe draw about the individual beliefs when we find an inconsistency?\nExample:\n1. (P) Jones is the best chess player in town.\n2. (Q) The best player always wins.\n3. (R) Jones lost last night to Smith.\nGiven that we believe (1-3), and that they are not consistent, what should we conclude? We\nhave 3 options:\n4. (not-P) Jones is not the best chess player in town.\n4*. (not-Q) It is not the case that the best player always wins. (Sometimes the best player loses.)\n4**. (not-R) Jones did not lose last night to Smith.\nNo doubt we have to reject the belief which seems weakest to us. Of course, further inquiry\nmay show us that we gave up the wrong belief. But we continue, doing the best we can, to test\nour beliefs for inconsistency, knowing that if we find an inconsistency then at least one of the\nbeliefs is false. This suggests that through elenchtic inquiry we can never be certain that we\nhave proven a target thesis false, or its negation true; the most we can claim to have proven is\nthat one or another of the beliefs we considered is false.\nThis fact is connected to Socrates' disavowal of knowledge. Through elenchtic inquiry he finds\nthat his interlocutors are willing to assent to inconsistent claims; this shows that they have false\nbeliefs, i.e., that they lack knowledge. His own commitment to elenchtic inquiry is a\ncommitment to test his own beliefs for hidden inconsistencies. Perhaps he thinks that until he\ncan show his beliefs to be wholly consistent, he is not entitled to claim knowledge. Although he\nthinks his beliefs are consistent, inconsistency is sometimes difficult to find; only diligent testing\nand retesting will establish their coherence. He differs from his interlocutors because he, unlike\nthey, respect the difficulty of achieving consistency in one's beliefs. Perhaps the only thing he\ncan say he knows with confidence is that he lacks the required assurances of consistency, and so\nlacks knowledge.\nSome may want to push this idea even further. The fact that a set of beliefs is consistent is no\nguarantee of their truth. As we saw above, one might gain consistency in a set of beliefs by\nrejecting one which is, as a matter of fact, true. It might be that this danger was what prevented\nSocrates from claiming knowledge. Even if he was confident in the consistency of his beliefs\n(due to years of conscientious elenchtic inquiry), he must acknowledge that his inquiry is\nfallible, that some of his beliefs may nevertheless be false. This fallibility is the hallmark of\nhuman knowledge, and what distinguishes it from infallible divine knowledge. Socrates'\n24.200: Notes on Euthyphro\n\nhuman wisdom is to acknowledge this fallibility in the elenchus, which is the best procedure we\nhumans have to achieve knowledge.\n24.200: Notes on Euthyphro"
    },
    {
      "category": "Resource",
      "title": "forms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/ba11e96393169011ca3fb588a8cdcb60_forms.pdf",
      "content": "24.200: Ancient Philosophy\nProf. S. Haslanger\nOctober 4, 2004\nNotes on the Forms\n\"Platonism,\" very generally, is the doctrine according to which:\ni) in addition to whatever sensible particulars there may be, there also exist separate abstract\nentities;\nii) these abstract entities do not exist in some secondary or derivative sense, but are as real as\nanything can be; and\niii) they exist independently of our thought about them, i.e., they are not the creations or\ninventions of the human mind.\nVarious philosophers, ancient and modern, have subscribed to versions of \"Platonism.\" Plato\nhimself held a distinctive form of it committed to Platonic FORMS.\nTwo Worlds:\nThe Forms exist in a realm separate from the sensible realm. Forms are eternal and unchanging\n- this is the realm of \"Being\" ; the sensible realm is in constant flux - this is the realm of\n\"Becoming\". The sensible things are related to the Forms, by participating in them; it is in virtue\nof their participation in the Forms that they have the qualities/properties they do.\nKnowledge:\nThe Forms are objects of knowledge; sensible things are objects of belief/opinion. The Forms\nare grasped through the intellect and are clear; the sensible things are experienced through the\nsenses and are never fully clear. The Forms are ideal patterns (paradigms) in terms of which the\nsensible realm is explained.\nMeaning:\nThe Theory of Forms plays a role in explaining how language attaches to the world. General\nterms--terms such as \"pale,\" \"wise,\" and \"large,\" that can be predicated of many things--are\nnames of Forms. If we consider how names attach to things, we can see that there is a\ndifference between saying that \"this is pale\", speaking of pallor itself, and \"this is pale\", pointing\nto Socrates. Plato thought that words attach to (sensible) things by attaching directly to the\nForms, and indirectly to the sensible things by virtue of their participation in the Forms. For\nexample, when we say of Socrates that he is pale (meaning that he \"has\" pallor), this is true\nbecause Socrates participates in the Form of pallor. Pallor is the pale itself, which Socrates only\nimperfectly copies or resembles in being pale. So language attaches to sensible objects in a\nderivative way through its primary attachment to Forms.\nMoral/aesthetic standards:\nThe Forms are objective moral and aesthetic standards. They are the true source of value.\nContemplation of the Forms is the highest form of moral and aesthetic experience."
    },
    {
      "category": "Resource",
      "title": "greekvirtueshort.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/340916a74de1775088445f199f778388_greekvirtueshort.pdf",
      "content": "24.200: Ancient Philosophy\nProf. Sally Haslanger\nThe Greek Concept of Virtue\nLet us begin by looking in a general way at the ancient Greek conception of virtue and\nmorality. Although the various authors we will consider differ considerably in their views\nabout morality, there are a number of core assumptions which they all shared, and within\nwhich their views evolved. Many of the assumptions and the debates will be familiar to us;\nthey concern the foundations of moral motivation (why be moral?), the basis for moral\nobligation (by what authority does morality make demands on us?), and moral epistemology\n(how do we know what is right or wrong? Can virtue be taught?).\nThe Greek word for virtue is 'ARETE'. For the Greeks, the notion of virtue is tied to the\nnotion of function (ERGON). The virtues of something are what enable it to perform excellently\nits proper function. Virtue (or arete) extends beyond the realm of morality; it concerns the\nexcellent performance of any function. For example the function of a paring knife is to cut fruits\nand vegetables. A paring knife \"has virtues\" relative to that function, eg., a good paring knife\nhas the virtue of being sharp, strong, etc. From this it appears that our own broad idea of virtue\nretains the Greek suggestion that virtue is excellence in performing one's proper function.\nIn keeping with this broad conception of virtue, human virtue is that which enables a\nhuman being to perform well or excellently the proper function of a human being. We may find\nit odd to speak of the proper goal or function of a human being; what is the function of human\nbeings? The function of something is linked to what it can do especially well, or what only it can\ndo. For humans, to put the point broadly, this is to live a human life. So the function of a\nhuman being is to live well or excellently the life that we have. Since to live well is to be happy,\none's virtue is what enables one to lead a happy life.\nSo, on the Greek conception of virtue, a virtuous person is one who has the ability to live\nexcellently, ie., to live a full, productive, and happy human life. Moral goodness is a kind of\nfunctional goodness: goodness relative to our proper purpose or function. This is only a\nschematic model and must be filled in by further discussion of what constitutes a distinctively\nhuman life, and distinctively human excellence.\nHappiness is not only the product of well-living, but it is also what we naturally pursue.\nWe have as our function a well-lived life, and we are naturally motivated to pursue such a life;\nthis is a life of happiness. In short, happiness is our TELOS, ie., our goal or aim. On the Greek\napproach to ethics what is morally right for an agent must contribute to the agent's happiness,\nfor the moral goodness of our actions is necessarily connected to living well. On this view, one\ncan always characterize what is morally right in a way which reveals it as conducive to the\nagent's good, or self-interest. (This need not mean that all morality is narrowly self-centered,\nfor it may be essential to my happiness and the goodness of my life that I am able to care for\nothers.)\nDuring Socrates' lifetime, it was usually assumed that there are five cardinal virtues:\nwisdom, moderation/temperance, bravery, justice, piety. Popular belief had it that one could\n\nhave one of these virtues without having the rest. Socrates, Plato, and Aristotle believed,\nhowever, that the virtues are inseparable; if you have one you have them all.\nThe point of these virtues is that each enables one to perform well in a particular sphere\nof life, and the virtues together enable one to live a good life as a whole. Bravery enables one to\nperform well in situations of danger; justice enables one to carry out successfully one's dealings\nwith the others in a community; having all of the virtues enables one to perform excellently in\nall aspects of life. Truly living well requires that one have all of the virtues; complete virtue is\nthe key to happiness (EUDAIMONIA).\nThere are two problems we shall have to address in coming to understand this\nconception of virtue:\n1. Morality requires that we be just. To be just is to honor the claims of others in considering\npotential conflicts. In some cases, honoring the claims of others will clearly be against one's\nself-interest. How do we reconcile the claim that justice is a virtue and so (necessarily) leads to\nmy happiness, with the seemingly undeniable fact that sometimes the unjust person who does\nnot treat others fairly ends up happier? (Eg., won't an unjust person who gets more than a fair\nshare of the pie be happier than they would be if the pie were divided fairly?)\n2. If all morality is in our self-interest (because morality necessarily promotes our happiness),\nand we are naturally motivated to act in our own self-interest, why is it that sometimes we\nperform actions we know to be morally wrong? In other words, how is possible that sometimes\nwe know the right thing to do, and yet go ahead and do the wrong thing? This is known as the\nproblem of AKRASIA or \"weakness of will\"."
    },
    {
      "category": "Resource",
      "title": "knowl_forms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-200-ancient-philosophy-fall-2004/783850dacbf848bd5423a34e0212a6b0_knowl_forms.pdf",
      "content": "24.200: Ancient Philosophy\nOctober 25, 2000\nKnowledge and the Forms\nArguments for the Forms from the nature of knowledge (476e-480a):\nFirst argument:\n1) If I know something then I cannot be mistaken about it. (E.g., If I know that water boils at\n100C, then I cannot be mistaken about it.)\n2) If I know something, then there must be things that I cannot be mistaken about, i.e., they are\nthe sorts of things that once aware of we are infallible about?\n3) One can always be mistaken about sensible things.\n4) If knowledge is possible, then there must be non-sensible objects about which we are\ninfallible.\nCompare:\na) Necessarily, [if S knows that p, then p is true].\nb) If S knows that p, then necessarily, [p is true].\nCompare:\nc) Necessarily, [If S knows that p, then S is not mistaken about p.]\nd) If S knows that p, then necessarily, [S is not mistaken about p].\n(d) suggests that if one knows p, then p is the sort of thing that one cannot ever be wrong about\n(p is certain?). But is this plausible? I know that water boils at 100C, but it is the sort of thing\nthat one can be wrong about; it is even the sort of thing that I can be wrong about and have been\nwrong about in the past. It looks like there has there been a slide from (a) to (b), or (c) to (d).\nSecond argument:\n1) If I know something, then I am reliable in making judgements about it. (E.g., if I know what\npiety is, I am reliable in making judgements about what's pious.)\n2) My reliability is based on the fact that what I know is stable--what one appeals to in making\nthe particular judgements is always the same. (Keep in mind that Plato and Socrates\nwould think that what one appeals to is the correct account or definition.) If I make a\nmistake in my judgements (e.g., about what is pious), then I must have in mind\nsomething other than the true source of knowledge.\n3) The objects of knowledge are stable, the objects of belief/opinion are unstable. To have\nknowledge of X is to have access to a perfect model of X that is in no way not-X\n(otherwise it would not be a reliable guide).\n4) Sensible things are unstable and are capable of being both X and not-X.\n5) If knowledge is possible there must be non-sensible things that serve as stable models for our\njudgements."
    }
  ]
}