{
  "course_name": "Anthropology Through Speculative Fiction",
  "course_description": "This class examines how anthropology and speculative fiction (SF) each explore ideas about culture and society, technology, morality, and life in “other” worlds. We investigate this convergence of interest through analysis of SF in print, film, and other media. Concepts include traditional and contemporary anthropological topics, including first contact; gift exchange; gender, marriage, and kinship; law, morality, and cultural relativism; religion; race and embodiment; politics, violence, and war; medicine, healing, and consciousness; technology and environment. Thematic questions addressed in the class include: what is an alien? What is “the human”? Could SF be possible without anthropology?",
  "topics": [
    "Humanities",
    "Literature",
    "Fiction",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology",
    "Humanities",
    "Literature",
    "Fiction",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nExamines how anthropology and speculative fiction (SF) each explore ideas about culture and society, technology, morality, and life in \"other\" worlds. Investigates this convergence of interest through analysis of SF in print, film, and other media. Covers traditional and contemporary anthropological topics, including first contact; gift exchange; gender, marriage, and kinship; law, morality, and cultural relativism; religion; race and embodiment; politics, violence, and war; medicine, healing, and consciousness; technology and environment. Thematic questions addressed in the class include: what is an alien? What is \"the human\"? Could SF be possible without anthropology?\n\nRequirements\n\nStudents will write three 7-page papers. Each paper represents 25% of the subject grade. No emailed papers accepted. Late papers lose a full grade a day. Students will also be evaluated on class participation, including the preparation of occasional reading notes to prompt class discussion as well as contribution to classroom conversation (25% of subject grade). Punctual attendance is obligatory. There is no final.\n\nRequired Books\n\nRoberts, Adam.\nScience Fiction\n. New York, NY: Routledge, 2000. ISBN: 9780415192057.\n\nBarlowe, Wayne Douglas, Ian Summers, and Beth Meacham.\nBarlowe's Guide to Extraterrestrials\n. New York, NY: Workman, 1987. ISBN: 9780894803246.\n\nRussell, Mary Doria.\nThe Sparrow\n. New York, NY: Ballantine Books, 1997. ISBN: 9780449912553.\n\nHopkinson, Nalo.\nBrown Girl in the Ring\n. New York, NY: Grand Central Publishing, 1998. ISBN: 9780446674331.\n\nButler, Octavia.\nFledgling\n. New York, NY: Seven Stories Press, 2005. ISBN: 9781583226902.\n\nVonnegut, Kurt.\nCat's Cradle\n. New York, NY: Holt, Rinehart, and Winston, 1963.\n\nButler, Octavia.\nKindred\n. Boston, MA: Beacon, 2004. ISBN: 9780807083697.\n\nGibson, William.\nNeuromancer\n. New York, NY: Ace, 1984. ISBN: 9780441569595.\n\nCard, Orson Scott.\nEnder's Game\n. New York, NY: Tor, 1991. ISBN: 9780812550702.\n\nLe Guin, Ursula.\nThe Left Hand of Darkness\n. New York, NY: Ace, 1969.\n\nHuxley, Aldous.\nBrave New World\n. New York, NY: Harper, 2006. ISBN: 9780060850524.\n\nButler, Octavia.\nDawn\n. New York, NY: Warner, 1987. ISBN: 9780445205161. [Currently available in\nLilith's Brood\n. New York, NY: Grand Central Publishing, 2000. ISBN: 9780446676106.]",
  "files": []
}