{
  "course_name": "Antibiotics, Toxins, and Protein Engineering",
  "course_description": "The lethal poison Ricin (best known as a weapon of bioterrorism), Diphtheria toxin (the causative agent of a highly contagious bacterial disease), and the widely used antibiotic tetracycline have one thing in common: They specifically target the cell’s translational apparatus and disrupt protein synthesis.\nIn this course, we will explore the mechanisms of action of toxins and antibiotics, their roles in everyday medicine, and the emergence and spread of drug resistance. We will also discuss the identification of new drug targets and how we can manipulate the protein synthesis machinery to provide powerful tools for protein engineering and potential new treatments for patients with devastating diseases, such as cystic fibrosis and muscular dystrophy.\nThis course is one of many Advanced Undergraduate Seminars offered by the Biology Department at MIT. These seminars are tailored for students with an interest in using primary research literature to discuss and learn about current biological research in a highly interactive setting. Many instructors of the Advanced Undergraduate Seminars are postdoctoral scientists with a strong interest in teaching.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Health and Medicine",
    "Pharmacology and Toxicology",
    "Engineering",
    "Biological Engineering",
    "Health and Medicine",
    "Pharmacology and Toxicology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nA basic knowledge of the central dogma of molecular biology: DNA → RNA → protein.\n\nOverview\n\nThe lethal poison Ricin - best known as a weapon of bioterrorism, Diphtheria toxin - the causative agent of a highly contagious bacterial disease, and the widely used antibiotic tetracycline have one thing in common: They specifically target the cell's translational apparatus and disrupt protein synthesis.\n\nIn this course, we will explore the mechanisms of action of toxins and antibiotics, their roles in everyday medicine, and the emergence and spread of drug resistance. We will also discuss the identification of new drug targets, and how we can manipulate the protein synthesis machinery to provide powerful tools for protein engineering and potential new medical treatments for patients with devastating diseases such as cystic fibrosis and muscular dystrophy.\n\nProtein synthesis is a fundamental and ancient process that has been highly conserved in all cells from bacteria to human. Protein synthesis takes place on the ribosome and requires many protein and RNA factors to ensure timely and accurate translation of the mRNA. Because of the essential and ubiquitous role of proteins in all cells, protein synthesis has been a prime target of antibiotics and toxins that can effectively shut down translation and cell function. Bacteria, fungi and plants produce various compounds that are extremely potent inhibitors of translation and therefore toxic to cells. The overall mechanism of protein synthesis is similar in all kingdoms of life. However, there are some essential structural differences between the protein synthesis machineries of bacteria and eukaryotes that allow for highly selective inhibition of protein translation in one kingdom but not another. This selective inhibition has important medical implication, as it is the basis of antibiotic usage to combat bacterial infections.\n\nIn this course, we will cover protein translation in detail and discuss the scientific literature that investigates the mechanism of action of protein synthesis inhibitors such as Ricin, Diphtheria toxin, and some major antibiotics (e.g. tetracycline). We will also learn about diseases caused by various defects in the translational machinery and possible new medical treatments. Finally, we will discuss cutting-edge methods that are currently being developed to \"twist and tweak\" normal protein synthesis for the purpose of protein engineering.\n\nCourse Objectives\n\nThe main objective of this course is to familiarize students with the primary scientific literature (in print and on-line databases) while you discover the exciting world of protein synthesis. You will learn how to read, analyze and critically evaluate scientific papers, and you will be encouraged to engage in active class discussions. The course will provide fundamental insight into the structure and function of the ribosome, its role in protein synthesis, structure and function of the ribosome, and mechanism of action of antibiotics and toxins that target translational machinery. A strong focus will be on the methodology and experimental approaches used, from basic biochemistry, genetics, and molecular biology, to state-of-the-art protein engineering.\n\nFormat and Expectations\n\nMost meetings will consist of discussion of two research papers. Students are expected to have read the papers in advance, use on-line literature databases for optional background reading, and be prepared to discuss the selected papers in class. At the end of each class, the necessary background to understand the papers for the next session will be provided.\n\nAssignments\n\nThere are two projects on the following topics:\n\nProject 1: Screening for new drug targets.\n\nProject 2: Site-specific incorporation of L-acetyl-phenylalanine and L-benzoyl-phenylalanine into a target protein (X) in mammalian cells.\n\nGrading\n\nSuccessful conclusion of the course requires the completion of two projects. Attendance at all meetings is very important, and no more than one class can be missed. Students who miss a class must complete a make-up assignment, which will consist of a 1-2 page (double-spaced) summary of the papers discussed in that particular meeting.\n\nCalendar\n\nSES #\n\nTOPICS\n\nIntroduction\n\nToxins I: Toxins that target the ribosome - Ricin and Shiga toxin\n\nToxins II: Toxins that target eukaryotic elongation factor 2 - Diphtheria toxin and Pseudomonas exotoxin A\n\nToxins III: Toxins that target tRNA - Bacterial colicins and the eukaryotic γ-toxin\n\nMechanism and action of antibiotics I: Tetracycline and other antibiotics that target the 30S ribosomal subunit\n\nMechanism and action of antibiotics II: Chloramphenicol and other antibiotics that target the 50S ribosomal subunit\n\nMechanism and action of antibiotics III: Aminoglycoside antibiotics - Antibiotics that affect translational fidelity\n\nProtein engineering I: Incorporation of unnatural amino acids into proteins - Making SENSE out of NON-SENSE\n\nProtein engineering II: Incorporation of unnatural amino acids into proteins - Use of ribosomal frameshift-suppressor tRNAs and editing-defective aminoacyl-tRNA synthetases\n\nProtein engineering III: In vitro evolution of proteins\n\nThe translational apparatus and human diseases\n\nEpilogue",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Antibiotics, Toxins, and Protein Engineering Lecture Summaries",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-344-antibiotics-toxins-and-protein-engineering-spring-2007/2af264b6a4de92a3d8b1624418c29e02_7344_lecture_sum.pdf",
      "content": "Week 1 Introduction.\n\nIntroduction of instructors, students, and course\nOverview of translation (ribosome, ribosomal proteins, rRNA, mRNA, tRNA, translation\nfactors, genetic code)\nWe will watch the amazing mini movie \"Elongation Cycle of Protein Biosynthesis\" by\nAgrawal, Whiting & Frank starring the E. coli ribosome, tRNA and elongation factors.\nProtein synthesis is one of the most fundamental cellular processes in a living cell.\nProtein synthesis occurs on the ribosome. It is composed of three distinct steps:\nINITIATION, ELONGATION and TERMINATION. Although protein synthesis is\nhighly conserved in all kingdoms of life, there are critical structural and functional\ndifferences between prokaryotes and eukaryotes.\nIn this first class, we will review the ordered events in protein synthesis and review the\nfunction of the various components of the translation machinery. We will discuss high-\nresolution structures of the prokaryotic and eukaryotic ribosome obtained by x-ray\ncrystallography and cryo-electron microscopy and how these structures help us\nunderstand the mechanism of action of toxins, antibiotics and other protein synthesis\ninhibitors covered later in the course.\nSit back and enjoy a fantastic voyage through the most incredible molecular machine:\nThe Ribosome!\n\nWeek 2 Toxins I: Toxins that target the ribosome - Ricin and Shiga toxin.\n\nIn 1978, a very small amount of Ricin was used by the KGB to kill a Bulgarian Soviet\npolitical dissident in London, and Ricin is still considered to be one of the most serious\nbio-terrorist threats. Many organisms produce toxic proteins that exert lethal activity\ntowards other cells. Ricin is an extremely potent protein toxin produced by the castor\nbean plant and has no known antidote. A single molecule will inactivate almost 2000\nribosomes within a minute.\nThe bacterial Shiga toxin is also extremely potent. Interestingly, both Ricin and Shiga\ntoxin are ribosome-inactivating proteins and target the eukaryotic ribosome large subunit\nin a similar fashion. We will discuss the experimental techniques and data that explain\nhow Ricin and Shiga toxin specifically target the 60S ribosomal subunit and why they are\nso potent.\n\nWeek 3 Toxins II: Toxins that target eukaryotic elongation factor 2 - Diphtheria\ntoxin and Pseudomonas exotoxin A.\n\nDiphtheria, a respiratory tract infection, is caused by the gram-positive Corynebacterium\ndiphtheriae; the mortality rate of diphtheria is 5-10 %. Diphtheria toxin (DT) is one of\nthe most studied and best-understood bacterial toxins. Both Diphtheria toxin and\nPseudomonas exotoxin A target eukaryotic elongation factor 2 (eEF-2) by covalent\n\nmodification of diphthamide, a unique modified amino acid in the protein. We will\ndiscuss experiments that led to the identification of the cellular targets of these toxins and\nhow resistance to those toxins could arise.\n\nWeek 4 Toxins III: Toxins that target tRNA - Bacterial colicins and the eukaryotic\nγ-toxin.\n\nAlthough the majority of protein synthesis inhibitors target the ribosome or protein\ntranslation factors, several tRNA-specific toxins have been identified. Action of these\ntoxins often requires the presence of specific base modification on the tRNA. Base\nmodifications are implicated in stability of the 3D-structure of the tRNA molecules,\nothers in the codon-anticodon interactions, or interaction with proteins. Some have yet\nunknown functions.\nIn this class, we will discuss the importance of tRNA modifications, and how tRNA-\nspecific toxins including bacterial colicins and the eukaryotic γ-toxin stop protein\nsynthesis in bacteria and yeast, respectively.\n\nWeek 5 Mechanism and action of antibiotics I: Tetracycline and other antibiotics\nthat target the 30S ribosomal subunit.\nTetracycline, a widely used antibiotic, is a good example of drugs that bind directly to the\nribosome and thereby interfere with its function. Tetracycline binds to the 30S subunit of\nthe prokaryotic ribosome and blocks binding of the tRNA. The exact mode of action of\ntetracycline is well understood, especially with the availability of the 3D structure of the\nribosome cocrystallized with tetracycline, and the mapping of mutations that confer\nresistance to tetracycline.\nIn this class, we will discuss the mode of action of tetracycline and other antibiotics that\ntarget the small ribosomal subunit, and highlight differences between these antibiotics.\n\nWeek 6 Mechanism and action of antibiotics II: Chloramphenicol and other\nantibiotics that target the 50S ribosomal subunit. .\n\nRibosomes are a major target for natural and synthetic antibiotics. Besides being of\nclinical importance, antibiotics are powerful probes to study ribosome structure and\nfunction. Detailed knowledge of the binding sites of these antibiotics on the ribosome\n(provided by x-ray crystallography, NMR or chemical footprinting) is critical for our\nunderstanding of their mechanism at the molecular level. This knowledge will facilitate\nrational approaches to the design of new antibiotics and the identification of new\nantibiotic targets on the ribosome of bacterial pathogens to overcome the increasing\nproblem of resistance against currently used antibiotics.\n\nWeek 7 Mechanism and action of antibiotics III: Aminoglycoside antibiotics -\nAntibiotics that affect translational fidelity.\n\nMany human diseases are caused by nonsense mutations (premature termination codons;\nPTCs) that lead to the generation of truncated, functionally inactive or less active\nproteins. One such example is Duchenne muscular dystrophy (DMD). DMD is caused by\nmutations in the dystrophin gene, leading to the absence of the dystrophin protein in\nstriated muscle cells. Without dystrophin muscle cells gradually die causing a severe\nweakness of muscle tissue. At present, there is no cure for DMD.\nWe will discuss the use of aminoglycoside antibiotics (e.g. gentamycin, G-418,\nparomomycin) as a possible clinical treatment for diseases caused by PTCs.\nAminoglycoside antibiotics are known to interact with the highly conserved decoding site\nof the ribosome where pairing between the codon of the mRNA and the corresponding\nanticodon of a tRNA (cognate tRNA) is carried out.\nWhen aminoglycoside antibiotics are bound to the ribosome, reduced translational\nfidelity is observed and near-cognate tRNAs (tRNAs that form two instead of the\nstandard three base-pairs between anticodon and codon) are allowed to participate in\ntranslation. It has been shown that, depending on the dose, aminoglycoside antibiotics\ncan be used to partially restore the synthesis of full-length protein from a gene carrying a\nPTC without inhibiting overall protein synthesis.\n\nWeek 8 Protein engineering I: Incorporation of unnatural amino acids into proteins\n- Making SENSE out of NON-SENSE.\n\nIncorporation of unnatural amino acids (amino acid analogues) with novel chemical,\nphysical and biological properties at specific sites into proteins adds a new dimension to\nstudies of protein structure, function, protein-protein interactions and protein localization.\nIn addition, it provides a powerful tool for the design of proteins with novel chemical and\nbiological properties.\nUnnatural amino acids of interest include those that are photoactivatable or fluorescent;\nthose that carry heavy atoms or spin labels for structural studies such as crystallography,\nNMR and spectroscopy; those that have reactive side chains such as keto groups; and\nthose that mimic amino acids with phosphorylated or glycosylated side-chains. The\ndemand for in vitro and in vivo synthesis of proteins with modifications at specific sites\nhas driven the development of suppressor tRNA-based methods, as illustrated in this\nweek's papers.\n\nWeek 9 Protein engineering II: Incorporation of unnatural amino acids into\nproteins - Use of ribosomal frameshift-suppressor tRNAs and editing-defective\naminoacyl-tRNA synthetases.\n\nThe use of 4- and 5-base frameshift suppressor tRNAs, which decode 4- or 5-base codons\nin an mRNA and thereby suppress ribosomal frameshifting, provides the means for\nfurther expansion of the genetic code. The combination of two frameshift suppressor\ntRNAs or the combination of nonsense and frameshift suppressor tRNAs allows\nconcomitant incorporation of two different unnatural amino acids.\nMany aminoacyl-tRNA synthetases contain a secondary active site for editing\nmischarged or non-cognate amino acids before they are used in translation. Editing is\ncrucial to maintain amino acid specificity and thereby the accuracy of the genetic code. In\nthis week's second paper, we will discuss how editing-defective aminoacyl-tRNA\nsynthetases can be used to insert amino acid analogues into proteins.\n\nWeek 10 Protein engineering III: In vitro evolution of proteins.\nProtein engineering employs two different strategies: (1) rational design; and (2) directed\nevolution where random mutagenesis of a protein gene is followed by an appropriate\nselection strategy to pick out those variants of the protein that show the desired quality.\nOver the past years, powerful ribosome display systems were developed that allow in\nvitro (cell-free) evolution of proteins with novel characteristics. In these systems, the\nprotein and its encoding mRNA remain attached to the ribosome; multiple rounds of\nselection are performed to enrich for those proteins with new and specific properties,\nsuch as protein stability, folding and functional activity.\nRibosome display has a number of advantages over cell-based systems; it can display\nvery large libraries without the restriction of bacterial transformation. It is also suitable\nfor generating toxic or unstable proteins, and furthermore allows the incorporation of\nmodified amino acids at defined positions.\n\nWeek 11 The translational apparatus and human diseases.\n\nIt comes as no surprise that mutations in individual components of the translational\nmachinery are responsible for a wide spectrum of human diseases. Two interesting\nexamples are mutations in tRNAs and aminoacyl-tRNA synthetases (class of enzymes\nresponsible for attaching the correct amino acid onto a tRNA). So far, more than 150\ndisease-related mutations have been identified within the human mitochondrial genome.\nMost remarkably, more than half of these mutations are found within tRNA genes and are\nresponsible for diseases such as mitochondrial myopathy, encephalopathy, lactic acidosis,\nand stroke-like episodes (MELAS). More recently, mutations in aminoacyl-tRNA\nsynthetases have been shown to cause protein misfolding leading to several pathological\nconditions, including neurodegeneration.\nIn this class, we will also discuss the possibility of using specifically modified tRNAs as\na novel therapeutic approach for diseases caused by premature termination codons in\nmRNAs of certain genes. This approach could possibly complement treatments that use\naminoglycoside antibiotics\n\nWeek 12 Epilogue."
    },
    {
      "category": "Resource",
      "title": "Chemical and enzymatic probes for sequence and structure/function analysis of RNA",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-344-antibiotics-toxins-and-protein-engineering-spring-2007/8919082cefe85543ae9b7ebd62646ce9_rna_footprinting.pdf",
      "content": "Chemical and enzymatic probes for sequence and\nstructure/function analysis of RNA:\n[modfied from Ehresmann (1987) NAR 15, 9109ff]\nProbe\nMW\nSpecificity\nRNase T1\n11,000\nunpaired G\nRNase U2\n12,500\nunpaired A>>>G\nRNase CL3\n16,800\nunpaired C>>>A>U\nRNase PhyM\nn/a\nunpaired A + U\nRNase T2\n36,000\nunpaired N\nS1 nuclease\n32,000\nunpaired N\nN. c. nuclease\n55,000\nunpaired N\nRNase V1\n15,900\npaired or stacked N\nDMS\nN3-C\nN1-A\nN7-G\nDEPC\nN7-A\nCMCT\nN3-U\nN1-G\nkethoxal\nN1, N2-G\nbisulfite\nUnpaired C->U\nENU\nPhosphate\nFe(II)-EDTA\nBackbone\n\nChemical probes:"
    },
    {
      "category": "Resource",
      "title": "Primer extension",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-344-antibiotics-toxins-and-protein-engineering-spring-2007/3fe9c853ab6ab351a55d4a0420c9ffb3_primer_extension.pdf",
      "content": "PRIMER EXTENSION\n5'\n3' mRNA\nadd 5'-radiolabeled primer [*I\n5'\n3'-\n3' mRNA\n5'\nadd reverse transoriptase (RT)\nadd dNTPs\n5'\n3' mRNA\n3'*newly synthesized DNA strand\n5 '\nanalyze products by polyacrylamide gelelectrophoresis under\ndenaturing conditions\n('1 Alternatively, unlabeled primer can be used in combination with radiolabeled dNTPs\nto visualize the products synthesized by RT"
    },
    {
      "category": "Resource",
      "title": "Protein Engineering",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-344-antibiotics-toxins-and-protein-engineering-spring-2007/dfe7b9ed422da7499c804b88e088a088_protein_engineer.pdf",
      "content": "PROTEIN ENGINEERING\nSite-specific incorporation of amino acid analogues\n(A general introduction)\nC. Koehrer\n7.344 2007\n\nWhy introduce unnatural amino acids into proteins ?\nI. Synthesis of proteins with novel properties\n(protein engineering)\n3⁄4 Changes in structural properties\n- Changes in physico-chemical properties\ne.g. improvement in thermostability\ne.g. improvement in stability in organic solvents\n- Changes in conformation (e.g. α-helix)\n3⁄4 Changes in catalytic properties\n- Increase in Vmax\n- Decrease in Km\n- Changes in pH & temperature optimum\n- Modification of specificity of reaction\nWhy introduce unnatural amino acids into proteins ?\nII. Analysis of protein structure and function\n3⁄4 Fluorescent analogues for studying intracellular protein\nlocalization, protein folding, structure, binding to ligands etc.\n3⁄4 Photoactivatable amino acids for protein-protein interactions\n3⁄4 Chemically reactive groups\n3⁄4 Phospho amino acids for studies of signal transduction\n3⁄4 Heavy-atom derivatives for x-ray crystallography\n3⁄4 Spectroscopic probes for NMR, EPR etc.\n\nThe Genetic Code\nThree codons (UAG, UAA, UGA) specify termination of translation\n\nRole of specialized tRNAs (suppressor tRNAs) in translation of\npremature termination codons\nPremature termination\nof translation\nNonsense Suppression\n\nStrategy for site-specific incorporation of unnatural amino\nacids into proteins using nonsense suppression\nStrategy for site-specific incorporation of unnatural amino\nacids into proteins using nonsense suppression\nKey requirement:\nsuppressor tRNA carrying the unnatural amino acid IS NOT recognized\nby any of the endogenous synthetases ...'orthogonal' suppressor tRNA\n\nUse of 'orthogonal' suppressor tRNAs in unnatural amino acid\nmutagenesis\n1. In vitro protein synthesis\n3⁄4E. coli S30 cell extracts\n3⁄4Wheat-germ system\n3⁄4Rabbit reticulocyte systems\n21st aminoacyl-tRNA synthetase/suppressor tRNA pairs\n\nIncorporation of unnatural amino acids into proteins\nin vitro\n-Chemical peptide synthesis\n-In vitro protein synthesis\nsystems\n-Use of minimal media\nsupplemented with analogue\nrandom\nsite-specific\nin vivo\n-Nonsense suppression\nExpanding the genetic code"
    }
  ]
}