{
  "course_name": "Architecture Studio: Intentions",
  "course_description": "This is the second undergraduate design studio. It introduces a full range of architectural ideas and issues through drawing exercises, analyses of precedents, and explored design methods. Students will develop design skills by conceptualizing and representing architectural ideas and making aesthetic judgments about building design. Discussions regarding architecture’s role in mediating culture, nature and technology will help develop the students’ architectural vocabulary.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Fine Arts",
    "Architecture",
    "Architectural Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 3 hours / session\n\nCourse Description\n\nThis is the second undergraduate architectural studio at MIT. Previously, in 4.101, students were taught to explore the concept of experiencing architectural design through the coordination and integration of circulation, structure and space.\n\nThis term students will be challenged to use that knowledge and to add to it the dimension of intention, in order to develop a personal design process that will be used as a method of informing and interrogating future designs. By a series of initial short projects, students will be required to develop attitudes - spatial, contextual, structural, and phenomenological - toward the assigned design problems. By identifying and cataloguing these attitudes and intentions, students will develop a rigorous set of guidelines against which their proposals may be critiqued.\n\nStudents will learn various methods of representation for their ideas, and will work in model form and both freehand and hard-line drawings. Students will be encouraged to remain away from digital means of representation until late in the semester. 4.104 will be an opportunity for students to challenge and develop strong manual skill sets and learn to rely on ready methods of visual and physical exploration.\n\nThe 4.104 studio will have a rigorous emphasis on the development of a personal working method. The curriculum and evaluation methods will recognize design as a process, not a product, and constant evaluation and evolution of that process will be of paramount importance.",
  "files": [
    {
      "category": "Resource",
      "title": "siteoverview.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/00e81af5c125e14e5124a901d0e560b5_siteoverview.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "1parking_lot.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/63e89812a2f05d3437fce2f1358eff85_1parking_lot.pdf",
      "content": "PARKING LOT"
    },
    {
      "category": "Assignment",
      "title": "assignment_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/3e42dfcef620cb856f92ff7f74c5fa01_assignment_1.pdf",
      "content": "4.104/Joel Turkel\nAssignment 1 - Written Intentions - Why Architecture?\nDue: M Feb 7 @ 2pm\n\n\"Architecture is a synthesis of intention\"\n-Fernando Domeyko-Perez\n\nYour assignment due next Monday is to write a one-page paper to respond to the following:\n\n1. Describe the moment or event when you first knew you wanted to study architecture.\n\n2. Regarding your studies in architecture, which one ability/insight would you most like to gain\nthis term? Why do you feel it to be important?\n\n3. What is the greatest creative/intellectual challenge you will need to overcome to feel you\nhave been successful in studio this term? (By this I mean your challenge, not one imposed by\nthe curriculum, pressures of other courses, annoying roommates, etc...)\n\nOK - let's face it - the purpose of this one-page paper is to help me understand what it is that\ninterests you about architecture, what you want to get out of this studio, and what you're concerned\nabout that may prevent you from succeeding.\n\nIt's also to help me work with you to make sure you do succeed. So try to be honest with yourself -\nthese assignments will not be read in class, but will remain as a touchstone between you and I\nover the course of the semester. I expect that some of your goals may shift, but I want you to force\nyourselves to at least enter into the discussion with yourself and with me.\n\nLike most creative fields, architecture requires passion, so I expect your answers to contain a little\nof that - if you saw the Empire State Building shrouded in mist from a train in New Jersey when\nyou were seven years old and just knew you had to build buildings, great. If you had an uncle who\ndrew cool houses and lived in a really funky one, and you always admired him, great. If you just\nwoke up one day and said \"Oh no, I gotta declare a major\", and then picked architecture because it\nwas \"kinda cool\" - then tell me why it's kinda cool.\n\nTry to keep you answers succinct - please give me a one-page printout at 2:00pm on Monday.\n\nIf you have any questions prior to that time, please ask."
    },
    {
      "category": "Resource",
      "title": "2student_center.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/5dff6990ab8800bbc6e684e300b0b50d_2student_center.pdf",
      "content": "STUDENT CENTER\nROCKWELL CAGE"
    },
    {
      "category": "Assignment",
      "title": "assignment_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/2afefd6e135256808e0cf6df1b1250e2_assignment_2.pdf",
      "content": "4.104/Joel Turkel\nF Feb 4\nAssignment 2 - Written Intentions - Selecting a Reading/Writing Place\nDue: M Feb 7 @ 2pm\n\n\"Every generation laughs at the old fashions, but follows religiously the new\"\n- Henry David Thoreau\n\nReading: Colin Rowe \"Mathematics of the Ideal Villa\"\n\nThis essay, perhaps more than any other single piece written in the last century, has\nshaped the way architects and designers view and critique the space we design and inhabit.\nRowe was the first historian and critic to outline a fundamental method for seeing,\nunderstanding, and judging space based on spatial principles rather than \"style\". He identifies\nseveral key points which we will refer to frequently throughout the term.\nThe TAs and I will ask you to discuss the organization of your future projects this semester\nin the terms expressed in this essay. You may recognize many of the concepts Rowe discusses\nfrom your experiences in 4.101.\n\nAssignment:\n\nSelect a place, neither in your living quarters, (nor in someone else's), in which to read this\nessay and write a one page paper. It should be something in the public realm, but not a\ncommercial environment (i.e. not Starbucks). It should be a place in which you feel you will be\ncomfortable for 1-2 hours. It should offer the degree of privacy necessary to read and write. It can\nbe in a living group common area, a library, the student center, etc.\n\nOnce you have found this place, read the essay, then:\n\nCritique the place you chose to read. Write about both the positive attributes of the place\nyou chose, and on what is negative about it.\n\nConsider the following topics for each:\nWhy did you choose that place; what drew you to it?\nWhat is the nature of the light? The space? The room? The privacy?\nWhat are the materials? Are you comfortable?\nIs it an exposed place? Is it enclosed?\nWhat are the views? What can you see? What can you hear?\nHow well does it facilitate what you are doing?\nPlease answer in architectural/spatial terms, with particular reference to what you are\ndoing there, and the positive and negative impact on your task (i.e reading and writing). Discuss\ndimension, space, light, material, spatial zones, etc.\n\nPlease post your assignments by Monday at 2pm AND bring a one-page print-out of both\nAssignment 1 & 2 to studio on Monday, Feb 7th."
    },
    {
      "category": "Resource",
      "title": "3boathouse.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/72a0431b287951adc59490746c03a301_3boathouse.pdf",
      "content": "BOAT HOUSE"
    },
    {
      "category": "Assignment",
      "title": "assignment_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/4387af062c6f793885278d46fb71eab5_assignment_3.pdf",
      "content": "4.104/Joel Turkel\nM Feb 7\nAssignment 3 - Dimensions: Drawing from Memory (in-studio assignment)\nDue: W Feb 9 @ 2pm\n\nAssignment:\nFrom memory, draw the place in which you selected to read Rowe's essay over the last\nfew days.\nThis is a free-hand, scaled drawing assignment - no straight-edges please\n\nMethod:\nUse your 15\"x20\" illustration boards as a base.\nMount a piece of the graph paper given you on the illustration board.\nPlace a layer of 18\" tracing paper on top of the graph paper.\nUsing your Micron pens, try to block out the spaces and objects you recall.\nWork at 1⁄2\" =1'0\" scale.\n\nTry drawing a 10\" diameter circle first (this represents a 20' diameter).\nPicture yourself at the center of that circle, then try to remember everything as it was within\n10 feet of you.\nSketch it first, then, layering with tracing paper, try to find the correct proportions -\napproximating them as closely as you can.\nDevelop plan and section simultaneously, allowing them to inform one another.\nWhen you feel the proportions and elements are as close as you can recall, make a final\nlayer, remembering to use poche and a variety of line weights for to show depth. Fine\nlines recede visually, heavy lines advance.\nAt this scale, your plan and section should fit neatly beside each other on one piece of\nillustration board - they should also be easily scanned on an 11x17 copier/scanner.\n\nProduct:\nOne plan and one section at 1⁄2\" scale.\nFree-hand, scaled, ink line drawings only. No shading, no pencil.\nRemember to shown line-weights to indicate cut-lines in section\nUse line-weight to shown advancing and receding surfaces.\nAnnotate legibly to indicate special features, textures, material, etc., you feel important.\nSection should show at least one scale figure your height.\nPresent all your tracings together, layered, with your final pass on top.\nThis should be on one 15\" x 20\" board, pinned to the bulletin board by your desk.\n\nPlease submit a scan (JPEG, not PDF) of your finished work. Please size the image such\nthat the long edge is 1400 pixels.\nThis scan will be due on the website at 2pm Wednesday, Feb 9.\n\nAlso, for yourself, size and print the scan to an 8 1⁄2\" x 11\" sheet and place in your Itoya\nportfolio."
    },
    {
      "category": "Resource",
      "title": "4med_labmed_cent.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/62495abd17453d007229cd0bbbf96986_4med_labmed_cent.pdf",
      "content": "MEDIA LAB\nMEDICAL CENTER"
    },
    {
      "category": "Assignment",
      "title": "assignment_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/be3d077b6e54ce75330e5ad61e323c47_assignment_4.pdf",
      "content": "4.104/Joel Turkel\nM Feb 7\nAssignment 4 - Dimensions 2: Drawing from Reality\nDue: See below\n\na. Information Gathering - due W Feb 9 @ 2pm\nThis information will be essential to work in studio on Wednesday.\nReturn to your reading place.\nTake with you a copy of your finished Assignment 3, your measuring tape, a pen, and a\ndigital camera.\nWorking outward from the center of your drawing (the position you occupied in the plan),\ncheck the measurements of the reality against what you drew from memory.\nAnnotate the discrepancies, and sketch a new rough plan if necessary, showing all\npertinent information. Use the copy of Assignment 3 to write/draw on.\nIf you are taking photos, don't rely on those alone, they should supplement and add\ncontext to the written/drawn information you gather, not replace them.\nGather all the information needed to draw both PLAN and SECTION to scale in studio.\n\nb. scaled drawings - due F Feb 11 @ 2pm\nOne plan and one section at 1⁄2\" scale.\nFree-hand, scaled, ink line drawings only. No shading, no pencil.\nRemember to shown line-weights to indicate cut-lines in section\nUse line-weight to shown advancing and receding surfaces.\nAnnotate legibly to indicate special features, textures, material, etc., you feel important.\nSection should show at least one scale figure your height.\nPresent all your tracings together, layered, with your final pass on top.\nYou may include photos as context, working them into the graphic layout of the one-board\npresentation.\nThis should be on one 15\" x 20\" board, pinned to the bulletin board by your desk.\n\nPlease submit a scan (JPEG, not PDF) of your finished work. Please size the image such\nthat the long edge is 1400 pixels.\nThis scan will also be due on the website at 2pm Friday, Feb 11.\n\nAgain, print the scan to an 8 1⁄2\" x 11\" sheet and place in your Itoya portfolio."
    },
    {
      "category": "Resource",
      "title": "5metropol_warhse.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-104-architecture-studio-intentions-spring-2005/45fcd191b6269a9cd694d27512b68e39_5metropol_warhse.pdf",
      "content": "METROPOLITAN STORAGE\nWAREHOUSE"
    }
  ]
}