{
  "course_name": "Architecture Studio: Building in Landscapes",
  "course_description": "This subject introduces skills needed to build within a landscape establishing continuities between the built and natural world. Students learn to build appropriately through analysis of landscape and climate for a chosen site, and to conceptualize design decisions through drawings and models.\nThis class was taught concurrently with course 4.125A. Some of the assignments are the same, some are different, and the sites for the final project are different. But since they were taught in tandem, it would be useful to look at both together.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Environmental Design",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Environmental Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: Three sessions / week, 4 hours / session\n\nCommunity and Privacy - Building in Earthtexture\n\nThe work for the semester is the designing of places for community and privacy. These are always the two main issues that we have as architects. How to make spaces that can respond to the needs of the community for joyful livable places of interaction and how to respond to the dreams of individuals to provide for a joyful livable place of their own.\n\nThe second concern is building on the land or - earthtexture. Earthtexture includes land, sky, air, wind, sun, context- all the influence what we design. Architecture happens in the space between the sky and land and the designs for the studio will always take this into account.\n\nWe will also explore materials and structures that can relate to earthtexture and to give architectural meaning to the forms. It is with an understanding of materials/structures that we can give form to our ideas of architecture.\n\nFinally, and most important, we will be understanding and reflecting the ideas and dreams of the people we are designing for. Architecture is an echo of our society and culture and at the same time it can influence the way that people relate to their surroundings.\n\nThere are four projects for the semester.\n\nThe first two projects will be the same for both sections\n(Alan Joslin and Jan Wampler)\n. Both sections will also share lectures, information and field trips during the semester as well as consultants and instructors will be available to both sections. For the second part of the semester the two projects have a similar theme of building for the individual and community, however they will use different sites and different programs.\n\nThe first project is designing a\n\"Performance Place\"\nin an abandoned quarry in Rockport near Boston. The concern is how to design a cover for the sky - sky form - and a platform for the land - landform - that can give people shelter from the wind, sun, rain, and snow while enjoying a performance of your choice.\n\nThe second project is a short building project to design an\n\"A Place for the Homeless\"\n. This will be designed and built by teams of 4 or 5 from either section. The project will explore creative uses of materials that are recycled or inexpensive to provide a shelter and place of dignity for the homeless. This project will be done with Chris Dewart, Cambridge Agencies and homeless people input. The final building project will be assembled in on the MIT campus and viewed by MIT, City of Cambridge Agencies, students and faculty.\n\nThe third project is to design an\n\"An Individual Place in the Sky\"\non the rooftops and walls of buildings in the North End (Wampler), or on and around the BU Bridge (Joslin). This is another translation of land and we will treat the area as a quarry, the buildings being sides of this quarry. Sites will be on rooftops, on sides of the bridge/buildings, or both. There will be as many sites as designers in the studio and each will be asked to pick a site -space- and design a place for you to live and work while projecting your life ten years from now. Each house must connect in some way to a neighbor so that there will be village in the sky or on the bridge. Again the architecture must not only relate to the sky and land but also attached to the walls or roof.\n\nThe last project and longest part, is to design\n\"A Coming Together Place\"\nfor members of your studio on a site in the same area. The project is the making of a small building of not more than 5,000 square feet that might contain, meeting places, work rooms, living places, etc. The program for the building is to be designed by each studio member. Adjacent to this building will be a small \"earthplace\" a place related to nature that might be enjoyed by not only your community but also others in the North End or BU Bridge community.\n\nDuring the semester, designing mediums will include many kinds of sketch modeling, sketching, making of full size pieces of the building and drawing methods both that you used last semester and new ones. In addition we will be working in digital programs, such as Adobe(r) Photoshop(r), Microsoft(r) PowerPoint(r), digital photo programs that can be useful in explaining your design.\n\nOther issues for the semester include, the making of the space and space within, the making of large scale and human size spaces, the making of light and shadow and the making of beautiful architecture.\n\nThis class was taught concurrently with 4.125A. Some of the assignments are the same, some are different, and the sites for the final project are different. But since they were taught in tandem, it would be useful to look at both together.",
  "files": [
    {
      "category": "Assignment",
      "title": "assignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-125b-architecture-studio-building-in-landscapes-fall-2005/01748730fd619e22615f73e2060180ab_assignment1.pdf",
      "content": "ARCHITECTURE DESIGN: LEVEL 1\nLevel One Studio\n4.125\n\nTRF 1-5 PM\nJan Wampler\nAlan Joslin\n\nDavid Whitney - Consultant of Structure and Construction\nRebecca Luther, Jennifer Seely, Angela E. Watson - Instructors\n\n\"Community and Privacy - Building in Earthtexture\"\n\n\"Performance Place\"\nAssignment 1 \"Clues and References\"\n\nWe will spend the afternoon at the quarry site on Friday. During this time\nyou should think about the nature of the site:\n\n- What does it feel like?\n- Where did it come from?\n- How can someone else understand it?\n- What would the ideal performance place be like?\n- Where should it be?\n\nBy the end of the afternoon, you should have selected a location for your\ndesign project and photographed/sketched the area so you can bring back\ninformation to the studio. You also should bring back a \"site clue\" that you\ncan talk about with the rest of the studio. Finally, you should start to think\nabout the design.\n\nDue for next review on :\n\n1. One 20\"x 30\" drawing/board to show the site through photos, sketches,\nsit clues, and an attitude about your design. This should be a photoshop\npresentation (Board should feel alive and fresh)\n2. Sketch model at 1/8\" scale of the area and simple form model of your\nfirst idea.\n\nAssignment 2 -Making a Design\n\nNext Friday, September 24, there will be a review of the first project. For\nthis review there should be the following material to present your ideas.\n\n1.Model at 1/4\" scale (as detailed as possible)\n2.Complete model of the quarry at 1/4\" scale including areas not built on/ to\nbe done as a studio group project.\n3. Two panels (20 x30) to include at least the following\n- plan and section of your design showing space, place, sizes, materials\n- statement of your ideas\n- small sketches of views from your place\n- other photos, ideas, drawings, words... that are helpful\n4. On one 20\" x 30\" board a photo montage of model photoshopped into the\nsite photos.\n5. Work from first assignment."
    },
    {
      "category": "Assignment",
      "title": "assignment2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-125b-architecture-studio-building-in-landscapes-fall-2005/29d0734e7c450146f111f50493dbcb78_assignment2.pdf",
      "content": "ARCHITECTURAL DESIGN\nLEVEL ONE STUDIO, FALL 2005\n4.125\nTRF 1-5PM\nJAN WAMPLER\n\nALAN JOSLIN\n\nWITH\nDAVID WHITNEY - CONSULTANT OF STRUCTURE AND CONSTRUCTION\nCHRISTOPHER B. DEWART - BUILDING INSTRUCTOR\nREBECCA LUTHER, JENNIFER SEELY, ANGELA E. WATSON - CRITICS AND INSTRUCTORS\n\nSUMMARY OF ASSIGNMENT #2:\n\"A PLACE FOR THE HOMELESS\"\n\nTheme:\nTwo serious predicaments, expanding daily, currently plaque our society; 1) the lack\nof affordable housing and protection for those people falling out of the security of our\neconomic system, and 2) the overabundance of waste flowing from an economic\nsystem of disposable consumption. This studio exercise looks to use the second to\nassist the first. Students in groups of 5 or 6 will Design and Build creative solutions\nfor the temporary sheltering of those without homes, using standard materials from\nthe piles of waste typically discarded daily from MIT and other readily accessible\nlocal sources, as well as inexpensive new materials of general availability.\n\nProgram:\nThe success of the design shall be based on the following criteria,\n\n1) Size: No larger than 6'x6'x 6' (height)\n2) Function: Providing for the inhabitant a secure place to sleep and to\nkeep his/her belongings, where protection from the elements can be\nfound and/or just simply a \"home base\" where time can be spent.\n3) Structure: An ability to withstand the force of storm winds without\ncollapse.\n4) Thermal and Moisture Protection: An ability to keep the inhabitant\ncomfortable and dry in a broad range of weather, temperature and\ninternal humidity conditions, through waterproofing, insulation,\nheating, and natural ventilation.\n5) Transport: An ability to easily dismantle, move and reconstruct the\nshelter without the inhabitant having to rely on the use of any outside\nvehicle or physical assistance, other then a shopping cart and their\nown simple construction skill.\n6) Image: The construct shall transform \"junk\" into a crafted and\nbeautiful shelter that provides dignity to its inhabitants.\n\nSchedule:\nFriday, September 16\n\nIntroduction to the Problem\nSchedule:\nFriday, September 16\n(cont.)\n\nStudents form teams of 4 or 5 members drawn from both sections.\n\nFriday, September 23 thru Sunday, September 25 (9pm)\n\nRepresentatives of the homeless share needs and challenges.\n\nMarco Marraccini to present references of temporary shelters and the\nextraordinary handling of \"ordinary materials\".\n\nChris Dewart presents available \"kit of parts\", their characteristics and\nthe associated working processes.\n\nTeams begin \"serious\" brainstorming of ideas and convert into rough\nsketch model form.\n\nTeams to present rough sketch model, for review and sign-off, to the\nFaculty on Sunday evening (9pm)\n\nTeam to assemble a material list and review with Chris Dewart and the\nFaculty to determine source of each material, which studio member shall\nbe responsible for the acquisition of each, and within what time frame.\n\nMonday, September 26 through Wednesday, September 28\n\nMaterials to be acquired by designated team members, TA's and Faculty\non Monday.\n\nStudents, within their groups, shall prefabricate the shelter within the\nshop.\n\nThursday, September 29\n\nBy 4pm, students are to have transported their shelters in shopping carts\nand erected them in the designated area of the Kresge oval (rain or\nshine). Critics will judge the designs awarding 1st place and runner up\nprizes.\n\n5pm, a Celebration. The work will be open to the public, as well as to\nRepresentatives from the City of Cambridge Social Services and MIT.\n\nGood luck and Good fun to all."
    },
    {
      "category": "Resource",
      "title": "assignme3wampler.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-125b-architecture-studio-building-in-landscapes-fall-2005/9aaf5f716248fc8eebddb4f7e149973c_assignme3wampler.pdf",
      "content": "ARCHITECTURAL DESIGN\nLEVEL ONE STUDIO, FALL 2005\n4.125\nTRF 1-5PM\nJAN WAMPLER\nALAN JOSLIN\nWITH\nDAVID WHITNEY - CONSULTANT OF STRUCTURE AND CONSTRUCTION\nCHRISTOPHER B. DEWART - BUILDING INSTRUCTOR\nRebecca Luther, Jennifer Seely, Angela E. Watson - Critics and Instructors\n\"Community and Privacy - Building in Earthtexture\"\nWampler Assignment 3 - NORTH END QUARRY COMMUNITY\nIN THE SKY\nEach of you now have a site on a wall, on the roof, or on both.\nThe program for this area is the following:\nDesign a place for you to live in projecting your life ten years from\nnow. Think about what you might want to do with both your personal and\nprofessional life keeping in mind that more people may be working in\ntheir living place in the future. Each of your places should have at least\none connection to a neighbor of you studio.\nThe program is up to you but it should include something of the\nfollowing kinds of space.\n1. Living area\n2. Work area\n3. Cooking and Eating area\n4. Sleeping areas (could be several)\n5. Bathroom\nThe total area for this should not exceed 1000 square feet, this is close to 5\ntimes the amount of space most people in the world live in.\nFirst part of the project is clue searching, attitude statement, program first\nsketches and sketch model. This will be followed by the final assignment\nincluding final model, drawings, model of site and presentation.\n1. On 1- 20 x 30 sheet include in a montage the following:\n1. References of form that relate to your site either built or in nature\n\n2. Your attitude statement of what this place is like and your idea of your\nlife in the future\n3. A detail program including square feet of your idea.\n4. Sketches of first ideas merged into your presentation at 1/8\"=1-\n0\".(plans, sections, sketches\n5.\nA sketch model out of chip board of the first design.\nDue on Friday October 7 for discussion.\nWe will discuss the work due for the following week."
    },
    {
      "category": "Assignment",
      "title": "assignment6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-125b-architecture-studio-building-in-landscapes-fall-2005/0bc7503a46f23bd63bebb4cf8ab8cfa9_assignment6.pdf",
      "content": "ARCHITECTURE DESIGN: LEVEL 1\nLevel One Studio\n4.125\n\nTRF 1-5 PM\n\nJan Wampler\nAlan Joslin\n\nDavid Whitney - Consultant of Structure and Construction\nChristopher B. Dewart - Building Instructor\nRebecca Luther, Jennifer Seely, Angela E. Watson - Critics and Instructors\n\n\"Community and Privacy - Building in Earthtexture\"\n\nAssignment 6 - \"Making a Community Place\"\nClues, Attitude, Program and Design Ideas\n\nFor this first assignment you are asked to think about what this building wants to be.\nWhat is the program that would satisfy your needs and bring people together in the\ncommunity?. What kind of spaces for work would you need? How can we design\nbuildings in our present society that can address the issue of community? How can\nwe design a building that will be a \"coming together\" celebration and can help\nachieve peace.\nWhat is the connection to nature? How can nature be introduced into the city?\nThe basic program for the site should be between 6000 and 8000 square feet in\nbuilding that has in places, at least three floors. No matter what you program might be\nthe following types and sizes of spaces should be included.\n1. Large space (meeting, theater, exhibition, work) for long span of structure. About\n1500 to 2000 sq. ft.\n2. Some middle size spaces (work, small meetings). About 800 sq. ft.\n3. Small spaces (offices, work, studios) About 150- 200 sq. ft.\n4. Public space that connects the above spaces.\n5. Vertical spaces that connects the building floors.\n6. Outside space of nature in the city.\n\nIt would be a good time to revisited the site and understand more of the community.\nYou might do this by being there at different times of the day, by talking with people\nwho live there or by understanding the history of the area. From your observations\nideas for the program and form should come.\n\nFor next Tuesday the following should be done.\n\n1. One 20 x 30 board to include your attitude about the building, program uses\nand sizes (make areas of colored paper to show sizes) and sketches about how you might\n\nuse the site. Include at 1/16\" scale as many sketch plans as you can about a beginning\napproached to the design.\n\n2. Having an attitude, program and sketch ideas about the project the next step is to\nstart the design process. We will start by working in model form and then later work\nwith drawings. However, sketches of your ideas in plan, section and perspective in your\nsketch book should always be part of the process.\nThe first is very abstract and at 1/16\" scale build a quick context model of the area and\nwith found objects make a quick design of your initial ideas about the general form of the\nbuilding and ideas about the integration of nature. Use what objects you can find and\nthink of the idea of the design but let the objects inform you of the design. Please do not\ntry to impose your initial thoughts about the design.\n\nDue Tuesday at 1 for pin up."
    },
    {
      "category": "Assignment",
      "title": "assignment9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-125b-architecture-studio-building-in-landscapes-fall-2005/6eb201a23738646d07dc93c093379076_assignment9.pdf",
      "content": "ARCHITECTURE DESIGN: LEVEL 1\nLevel One Studio\n4.125\n\nTRF 1-5 PM\nJan Wampler\nAlan Joslin\n\nDavid Whitney - Consultant of Structure and Construction\nChristopher B. Dewart - Building Instructor\nRebecca Luther, Jennifer Seely, Angela E. Watson - Critics and Instructors\nCommunity and Privacy - Building in Earthtexture\"\n\nAssignment 9 - \"Making a Community Place\"\n\n\"1/4\" Chunk\"\n\nSelect an area of your design that is about 60' by 50' that shows a main\nspace, roof and exterior wall. Build a sketch model at 1/4\" = 1'-0\" with\nall members in scale. Use bass wood, board and materials that relate to\nyour design and materials.\nThe model should show the following:\n1. Space of selected area\n2. Floor planes\n3. Details of the enclosure wall including materials, ventilation, glass...\n4. Think about the transition from inside to outside.\n5. Details as able to show at this scale.\n\nSame issues as before but now in more detail.\nHow light enters the building\nStructure and construction.\nSpace of uses\nTransitions from inside to outside.\n\nThis is due for pin up on Friday, December 2."
    }
  ]
}