{
  "course_name": "Architectural Construction and Computation",
  "course_description": "This class investigates the use of computers in architectural design and construction. It begins with a pre-prepared design computer model, which is used for testing and process investigation in construction. It then explores the process of construction from all sides of the practice: detail design, structural design, and both legal and computational issues.",
  "topics": [
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Fine Arts",
    "Architecture",
    "Architectural Engineering",
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Fine Arts",
    "Architecture",
    "Architectural Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nCourse Description\n\nThis class investigates the use of computers in architectural design and construction. It begins with a pre-prepared design computer model, which is used for testing and process investigation in construction. It then explores the process of construction from all sides of the practice: detail design, structural design, and both legal and computational issues.\n\nCourse Organization\n\nLectures\n\nAssignments\n\nOne Final Presentation\n\nCourse Policies\n\nStudents are expected to complete both the assignments to full completion for a grade.\n\nAssignments later than one week after the due date will loose one letter grade.\n\nAssignments will be accepted more than 2 weeks after the assignment date.\n\nAssignments\n\nThere will be a total of 2 assignments plus one final project. Each assignment is broken into weekly goals.\n\nGrading\n\nDue to the size of the class and the fact that we are working in teams your fellow classmates will have a hand in determining your individual final grade. Each team of four will individually evaluate the other three team members after the final presentation in December. Your final grade will be determined as a variation of the overall grade for the team. For example, if your team receives a B as the average grade for the semester and your teammates qualify you to have contributed to the team your personal grade for the semester will be a B+ or an A. If you slack off or minimally contribute to your teams efforts you will receive a B- or a C. Since everyone has a specific role to play on your team individual contributions should be evident at reviews. Please talk to us early if irreconcilable disputes occur we would like to address them sooner rather than later.\n\nactivities\n\npercentages\n\nAttendance and Participation in Class (Full Participation in all Aspects of the Course)\n\n30%\n\nAssignments\n\n50%\n\nFinal Project\n\n20%",
  "files": [
    {
      "category": "Resource",
      "title": "finalproj.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/8e573d7fb932ed6feceb0bf8a69e13a3_finalproj.pdf",
      "content": "4.501\nMassachusetts Institute of Technology\nFinal Project Proposal\nNovember 17, 2005\nFor Class Monday Nov 22nd\n1.0 FOR GROUPS OF 2 OR 4\nFor Discussion - You do not have to write this please think about it be prepared to discuss\nthese points in class\n1.1\nDefine a Theoretical Position\n-\nDefine the goal of the mockup. Prepare one sentence that defines the construction system and a\nmessage the mockup will attempt to convey ie: Exploration of corner section of a panelized\nbuilding design\n-\nWrite two sentences defining the technical struggles of the study ie: To test the relationship of CNC\nfabrication at the corners in order to quickly design and fabricate panels\n-\nIdentify the area of the detail you wish to explore, two or four students per detail. Each detail must\ndemonstrate the challenges of CNC fabrication both in purpose and execution\n1.2\nBackground\n-\nFind magazine article, websites or books that contain similar details as yours\n1.3\nMethod\n-\nPresent the method of exploration for the mockup. What is your process going to be? How do you\nthink you will find what you are looking for? The method is a search for a faster construction, higher\nlevel of precision on site or simplified construction detail, etc. Propose a way to explore the\ntheoretical goals above.\n\n2.0\nFOR GROUPS OF 4\n2.1\nMockup Design -\nPresent on paper\n-\nDo not remodel anything print on 8 x 11 a rendering or drawing of the area you and a co-student(s)\nwill build.\n-\nGenerate a preliminary list of materials for the detail. This should be a typed list you can email to\nthe TA.\n-\nMaterials will be delivered within 3 Days.\nAs a major part of the work is to consider how reviewers will observer the mockup. You need to build a\nstructure for the mockup that is:\n\nStructurally sound\nWorks as an assembly\nDoes not obstruct the major display points of the mockup\nIs not a dominate feature in the mockup\nThe mockup should be no more than 3' square in plan and 7' in height.\n2.2\nSchedule\nCreate a clear schedule based on clear goals. Subdivide the problem into discrete goals, first as 3 major goals\nwith due dates, second as intermediate short term goals for you and your team. For Mondays class add to\nthis daily schedule:\nNov\nMaterials List Due\nFinal Project Proposal Due\nMaterials will be delivered to N51\nDec\n1PM Final Review Setup"
    },
    {
      "category": "Resource",
      "title": "assn1a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/74b34e4542a79deaaea18b03bc867833_assn1a.pdf",
      "content": "4.501\nMassachusetts Institute of Technology\n\nAssignment 1\n\nParametric Modeling and Drawing\nSeptember 26 2005\n\nThis assignment will be presented in class on Monday October 17th\n\nProject Presentation\nTo quote Mies Van der Rohe, \"God is in the details\". Design and construction of building details is perhaps\nthe most complex segment of the design process. Designing the connective tissue between walls and floors,\nroof and exterior wall, and exterior walls and the ground is challenging and requires the architect to\nresearch and test new building concepts with models or through drawings. The goal of this assignment is to\npresent design and construction methods of detailed connections for your project in the form of drawings\non paper. You are required to present a plan and elevation of the building first, and secondly, of a detailed\ncorner. The details should be designed based on the architectural intent and material quality of the overall\nstructure as well as on the environmental and structural performance requirements for the building. The\nfollowing are examples of what should be considered in the design of a detail:\n\nAppearance/Weathering: When designing a detail connection it is more important that it maintains its\nappearance over time, rather than evaluating it solely on aesthetic beauty. It is most difficult to design a\ndetail that is easily maintained through many years of rain, wind and exposure to the harsh sun. It is\nimportant to anticipate how materials will change due to this exposure and design with that in mind.\n\nWaterproofing: Water is a building's greatest enemy; one rain storm can destroy carefully designed details.\nIn addition, water damage is often extremely difficult to remedy, as evidence of leaks may occur far from\nthe source, and in locations that are difficult to access.\n\nStrength: Details usually must last at least twenty years and often more. They have to resist stresses caused\nby water, wind and other physical forces in addition to weathering issues caused by these forces.\n\nCost: The cost of constructing details is based on the number of trades required at the job site, variations in\nexpensive materials, and the number of components across many trades in the assembly. In short, the\ngreater the number of varying trades, the higher the cost.\n\nAssemblies: The right balance of assembly connections between parts should be established. Needed\ncomponents should have as few connections as possible in order to resist water leaks and complex labor\ncost.\n\nREQUIRED DRAWINGS\nPage One:\nFloor Plan @ 1⁄4\" = 1'-0\"\n\nElevation @ 1⁄4\" = 1'-0\"\n\nPage Two:\nAxonometric Drawing of the detailed area -\n\nthe areas should be 10' x 10' in plan called out on the floor plan\n\nSection dwg:\nRoof Connection to exterior wall\n\nSection dwg:\nOuter wall with floor\n\nSection dwg:\nBasement and ground plane\n\nTEAM MANAGEMENT\nThere are four areas of responsibility granted each team member. It is critical that you all work together to\nget the project completed and that you are all constructively critical of each other's role.\n\nOutput Manager:\nIn charge of 2D printing, laser cutting and CNC routing\n\nMaster Modeler:\nIn charge of organizing the main file, archiving all project files and combining files\nfor the main model in Digital Project\n\nMaterials Research:\nIn charge of declaration of materials, library and web research for materials,\nrelationship with the architect and product sale personnel.\n\nDesigner:\n\nIn charge of the project appearance and the look of each detail. The designer is also\nresponsible for the overall schedule and assurance that the project goals are met.\n\nFIELD WORK\nWeek 1 Field Trip\nDesigning great details comes from experience in both building them and\nyears of observation after the building is constructed. A great builder takes\nnote of details that have not worked over time, corners that leak, colors\nthat fade or assemblies that separate due to building movement. Take\nnotes! Ask questions and learn from the experience of others.\n\nWeek 2 Designing the Detail\nFirst draw a floor plan and elevation in AutoCAD of your project. The\ndrawing should be at 1⁄4\" = 1'0\" plotted on 24\"x36\" paper. The drawing\nwill be used by the builder to lay out details and price the project. Make\nsure to vary line weight and annotate drawings in order to orient the\ncontractor. Second, design the building's exterior shell while outlining i\n(1) internal and (2) external material, (3) structure and (4) connections.\nts\n\nWeek 3 Construction Presentation\nThis drawing is a collection of details in 2D taken from the digital project\n3D model. Drawing should include a full section at 1⁄2\" = 1'0\" and called\nout details at 3\" = 1'-0.\" As a group you should work together to pull\ninformation from various areas of research into one drawing for review\nby a builder from Empyrean."
    },
    {
      "category": "Resource",
      "title": "assn1b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/f0b15a7532599e8ef0817d5dc62baa90_assn1b.pdf",
      "content": "4.501\nMassachusetts Institute of Technology\nAssignment 1\nReview Revisions\nParametric Modeling and Drawing\nSeptember 26 2005\nProject Presentation\nMany helpful comments were exchanged today between our reviewers and classmates. For next Mondays\nclass please develop the following:\n- Email a clear list of review comments to members of your team\n- Revise the 3D model to match reviewer's comments-Only make conceptual changes do not worry\nabout tons of detail. For example, if you are dealing with a panel make sure that is clear.\na) Render with color the 3D section model in 3D studio and print on large plotter\nb) 2D drawing should be revised (cleaned up) based on comments and print on large plotter\nc) Create a PDF of the Renderings, 2D drawings and comments into one MS Word Document .\nPlease make sure to include your groups names (Only one person on each team\nneeds to submit)"
    },
    {
      "category": "Resource",
      "title": "assn2a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/dda228b716150f6785f261e09f02f319_assn2a.pdf",
      "content": "4.501\nMassachusetts Institute of Technology\nAssignment 2a\nDesign Modeling with Digital Fabrication\nOctober 26 2005\nModel in Class Due Monday 31\nProject Scenario\n-\nEmpyrean has purchased a CNC router to improve manufacturing time and to increase production\nspeed and component variety\n-\nPatrick Gilrane (the Owner) was recommended by you that the company purchase a laser cutter to\ncomplement the CNC router in the shop\n-\nYou have been hired by Empyrean to research (explore) the relationship of the two machines. The\nfirst goal is to find ways to integrate design and shop fabrication with these digital machines by\nexample in model form.\n\nAssignment\n-\nBuild a design model of one corner or an area of your groups design at 1\" = 1'-0\"\n-\nInclude a scale figure\n-\nInclude a base of concrete\n-\nRedesign the manufacturing concept for your house\n-\nIf Panel design redesign the panel for cnc cutting\n-\nNot all parts can be cut which parts do you recommend\n-\nConsider redesigning all parts of the building for manufacture with digital fabrication\n-\nIs this possible?\n-\nBe prepared to present your new method it should enable the designer to redesigned and\nmanufactured one house in month.\n-\nWhat is the system of digital fabrication will be used?\n-\nIs the process repeatable?\n-\nIs the method flexible?\n-\nHow are you taking advantage of machine precision?"
    },
    {
      "category": "Resource",
      "title": "assn2b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/dedaa65c51cf936dc059f73a4e5ce00c_assn2b.pdf",
      "content": "4.501\nMassachusetts Institute of Technology\nAssignment 2b\nRevised Design\nNovember 3, 2005\nDue in Class Monday Nov 14th\nModeling\nThis assignment calls for new physical models, do not revise the existing models\n1.\nFor this phase you will work in groups of two. Partner with one student from your current group try\nto select someone with a similar approach to design and construction and someone whose schedule\nworks with yours.\n2. Each sub-team will remodel the top or bottom and middle area of the section model reviewed in\nclass this past Monday. In summary, we will review 6 models on Nov 14th, two from each team. Of\nthe two groups, the first sub-team will model the roof and floor/ceiling of the floor below (Fig 1).\nThe second, will model the floor and the foundation (Fig. 2). Your sub-team must take a stance on\nthe problem, we should see two distinct philosophies for areas of each model.\n3. Take a position on one subject matter as it relates to digital fabrication technologies, state a\nhypothesis. For example \"my team is using DF for part alignment\" or \"it is used to assure a\nparticular data point from the original model in support of concurrent construction\", etc.\n4. This assignment is research into future methods of construction. There is no right or wrong answer.\nYou should speculate. Be bold! Fifteen years ago most people did not believe in the web. Who could\nhave ever imagined purchasing all of their Holiday gifts online? Who could have ever thought we\ncould view news clips on our phones while sitting in traffic?\n4' extention into the\nfloor above\n4' extention into\nthe floor below\nFig 1. Roof/Second Floor Section Model\nFig 2. Foundation/Second Floor Section Model\n\nModel Requirements\na) SECTION:\nWalls should expand vertically a minimum of 4' into the floor above or below, for example\nfor the roof/floor model the walls should extend 4' down into the first floor\nb) SCALE:\nModel should be 1\"=1'-0\" - Same as the last model\nc) MATERIALS: Challenge traditional methods to represent model ideas. How can the user visually\ndistinguish new from old construction methods through your model? Use materials that allow the viewer to\ndistinguish between legacy (hand) and CNC methods (computer based\nd) ASSEMBLY: What are the principles of your assembly? Your model should reflect assembly systems for\nboth vertical (walls) and horizontal surfaces (roof & floor).\ne) PRESENTATION: Joel and I plan to have a guest reviewer at the next presentation. Bring the old (4\nperson) model and your new (2 person group) model to class. Present the digital model and physical model\nin presentation form for our next class, you can decide how you want to present the two."
    },
    {
      "category": "Resource",
      "title": "catialab1surface.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/b2340693edf51babf578133a13ceb2ce_catialab1surface.pdf",
      "content": "GENERATIVE SHAPE DESIGN WORKBENCH.\nCATIA TUTORIAL: GENERATION OF\nPARAMETRICALLY DEFINED BASIC\nSURFACES\n1) In this tutorial you will practice how to build\nbasic surfaces from two dimensional\nelements. You will use the Generative Shape\nDesign and the Sketcher workbenches\n2) Start by launching the CATIA Software. The\nPRODUCT design workbench appears as a\ndefault interface. On the top is the\nWorkbenches toolbar. Access the\nGenerative Shape Design Workbench by: a)\nclicking once the indicated icon or b) Find\nthe command in the Start pull-down menu.\n3) Once you enter the Generative Shape Design\nyou can see how the Structure Three has\nchanged to Part.1; it also contains the basic\nstructure: a) Reference planes b) Part Body\nand c) Open body.1. The part design host\nsurface and solid components, as well as\nall two dimensional entities.\n4) Around the screen you can find the\nToolbars for construction of three-\ndimentional entities: points, lines, planes,\nsplines.\n\nCREATING A PLANE:\n5) Start by clicking once in the plane icon. A\ndialog box called plane definition appears\nwith the options and parameters. From the\nto select offset from plane option and\nselect the YZ plane. The selected plane\nhighlights indicating that the selection has\nbeen made.\n6) A plane appears both in the screen and the\nthe Structure Tree. Type in the distance you\nwant the new plane to be located.\n7) Once all parameters have been defined\nclick apply to update the screen. If you are\nsatisfied click OK. The dialog box closes\nand the plane in defined.\n8) If the parameters are incorrect you can\nmake the necessary adjustments and see\nthe changes by clicking Apply before\nclicking OK\n9) Once the plane is defined it can be\nredefined by: a) double click on the plane;\nand b) double click in the corresponding\nname in the Structure Tree. The same\ndefinition dialog box appears.\n\n10) You will build three-dimensional basic\nsurfaces by using two-dimensional\nsketches defined in the Sketcher\nWorkbench.\n11) To enter the sketcher workbench start by\nclicking on the sketch icon.\n12) Select the plane in which you want to draw\nthe sketch. In this case select the YZ plane.\n13) As soon as you click on the plane the\nscreen rotates to a dark blue. This indicates\nthat you are in the two-dimensional\nenvironment. You will also notice that the\nStructure Tree also changes indicating that a\nnew Sketch has been generated.\n14) Notice also that in the Sketcher workbench\nthe toolbars and the layout also changes.\n\n15) Using the spline tool draw a spline by\nclicking point by point.\n16) Double click to end the spline.\n17) Exit the Sketcher by clicking in the exit\nbutton located in the top of the screen.\n\n18) Back in the Generative Shape Design\nworkbench you can see the sketch you just\ncreated.\n19)Follow the procedure to create a similar\nsketch in Plane.1, the first plane you\ncreated.\n20) This spline should be created in a different\nsketch. The program creates a new sketch\nin the Structure Tree.\n\n21) Exit the Sketcher workbench by clicking in\nthe exit button.\n22) The two sketches appear in the Generative\nShape Design as two splines.\n23) You will use this two splines to create a\nlofted surface by using the LOFT\ncommand.\n24)To create the loft click on the loft command\nand the LOFTED SURFACE DEFINITION\ndialog box appears showing the parameters\nand options for creating a lofted surface.\n25) To create a simple loft defined by two\ncurves select each of the curves. You can\nalso select the curves by clicking each of\nthe sketches on the Structure Tree.\n26) Notice that when you click on the sketch a\nset of red arrows appear as the spline is\nselected. This set of red arrows indicates\nthe direction in which the line was created\nand the direction in which the loft will be\ngenerated. IT IS VERY IMPORTANT THAT\nTHE ARROWS OF BOTH LINES ARE\nORIENTED IN THE SAME DIRECTION,\nOTHERWISE THE LOFT WILL\nGENERATE A SELF-INTERSECTING\nSURFACE.\n27) Once both sketches are selected you can\nclick the apply button to preview the loft.\n\n28)The loft is completed by clicking in the OK\nbutton.\n29) You can try switching the orientation of the\ncurves by clicking on the red arrows and\nhitting the APPLY button before clicking OK\nto end the command.\n\nPART 2: MODIFYING THE LOFT.\n1) In this tutorial you will practice how to\nmodify the loft you created by controlling\nthe sketches.\n2) Let's start by going back to the SKETCHER\nworkbench. You do that by double click in\none of the SKETCHES in the STRUCTURE\nTREE. Don't try to select a plane and use\nthe Sketch button since this will not allow\nyou to enter the sketch but it will create a\nnew one.\n3) Once you re-enter the Sketch use your\nmouse to drag on the points of the spline.\nThis will modify the shape of the spline and\nconsecuently the shape of the LOFT.\n4) While the spline in the sketch changes you\nwill notice that the loft turns to a bright red\ncolor. This indicates that there has been a\nchange in one of the entities that defines\nthe surface, they haven't been translated to\nthe surface, in other words the surface\nneeds to be updated. You will update this\nsurface on the Generative Design\nWorkbench once you exit the sketcher.\n5) Click on the exit button if you are satified\nwith the changes to return to the Generative\nShape Design environment.\n\n6) Once you exit the Sketcher you will se how\nthe spline has been updated. However\ndepending on your CATIA settings the\nsurface might still keep it's previous\ncondition.\n7) Click on the local update button to update\nthe modified parameters in the\n8) You will see how the surface is now\nupdated to the according to the modified\nparameters on the sketches.\n\n9) If the parameters are incorrect you can\nmake the necessary adjustments jumping\nback and forth between the Generative\nShape Design and the Sketcher\nWorckbenches.\n10) Until you define the final surface\n\n11) You can define more planes and Sketches\non order to expand the possibilities in the\ndesign.\n12) By adding more splines and more sketches\n\n13) Repeat the process until you find a\nsolution.\n\nThe same principle can be used to make\nrevolved surfaces with one straight line as an\naxis of revolution and a spline as a profile.\n\nIn this example we are creating a complex\nsurface by using three sketch splines and use\nthe BLEND command."
    },
    {
      "category": "Resource",
      "title": "catialab2solids.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/6a38c5495214b5de24345b81ec597b5b_catialab2solids.pdf",
      "content": "4.501 Recitation 1: Introduction to Digital Project\nThis introduction will provide an example of a model with all information and components of a structure in Digital Project. It will outline\nthe basic terminology and fi le setup to set up a basic understanding of drawing in the program.\nFILE LAYOUT AND ORGANIZATION\nIn digital project, you must build your solids using supports, which are 2 dimensional elements. Think of this as laying out a\nframework to support the solid elements: \"construction lines\". As opposed to other solid modeling programs, each element\nis supported by others, so the order in which you draw something creates a set of relations between parts. So, when you\nare drawing, you should think about how the building itself would be put together, in order to determine how you draw. For\ninstance, the location of the fi nished surface of a fl oor, would be dependent on the location of the subfl ooring, which would\nbe dependent on the beams supporting the fl oor. Also, the height of the second fl oor would be dependent on the height\nrequired for the fi rst fl oor, for instance, if you raise the ceiling height of the fi rst fl oor from 10 to 12 feet, but want the second\nfl oor ceiling height to remain the same, the second fl oor structure would have to move up along with it, so when you draw\nthe second fl oor, you want it to be in relation to the fi rst. These dependencies make drawing more complicated early on, but\nmake modifi cation easier later. For instance, it is possible to set up the drawing so that when you change the fl oor height in\na building, all of the structure and fi nished fl oor components in the model move automatically. These relations are outlined in\nthe Structure Tree. Think of the Structure Tree as a more complex version of your Layer Manager in AutoCAD, where there\nare different types of layers, depending on whether they are solids or 2D, and the order of the layers is important to building a\nsuccessful model.\nExample: Citron House\nThe entire house is a product, which would be created when starting a new fi le by choosing \"product.\" Within this\na part is created, below the product. Notice the symbols for each of these.\npart\nproduct\np\nstructure tree\n\nThe Structure Tree can be expanded by clicking on the plus sign next to the element in the tree in order to reveal the\nelements that make up that part/product. In the Example fi le, you can see that by expanding the Citron House Part, the\nelements used to construct the house are revealed. The symbol represents a Geometric Set, the \"layer\" where all\nof the 2-D construction lines are drawn for each solid component.\ngeometric set: this one named \"Horizontal Grid\" contains\nthe information for the points and lines used to create the\nhorizontal grid at the base of the house.\nThe Horizontal Grid in the Drawing\nAs you can see, there are other Geometric Sets in the drawing, renamed according to the elements of the house they are associated\nwith, such as the Floor Levels, Floor Slab, Stairs, CMUs, etc. These set up the support and construction of the solid\npart. For instance, the \"Floor Level\" geometric set contains the information for the height of each fl oor, while the \"Floor\nSlab\" geometric set contains a 2D line drawing (called a Sketch in DP) that is the outline of the Floor Slab. These sets are\ncurrently hidden in this drawing, which is why the icon is dimmed. The actual solid elemet that is the Floor\nSlab is drawn in a Body and is in another portion of the Structure Tree.\n\nIn the image below, the Bodies of this model are shown, the 3D solids. These are just below the Geometric Sets in\nthe structure tree below, and were viewed in this example by scrolling down. There is a Body for each Floor Slab, whose\ncorresponding Geometrical Sets were pointed out before. Also, there is a Body for Brick Cladding, highlighted in orange.\nWhen you select an item in the structure tree, it is highlighed in orange in the tree, and the portion of the model that is in that\nset is highlighted as well. This works in the opposite order as well: if a portion of the drawing is selected, its corresponding\nelement in the tree is highlighted as well.\nBrick Cladding Body\ng\ny\nBrick Cladding Geometric Set\nFloor Slab\nBodies\nIf the Brick Cladding Geometric Set is expanded (by clicking on the + ) the\n2D components that were used to make the Brick Cladding Body\nare revealed. The symbol represents a Sketch. A Sketch is\ncreaded in a 2D drawing mode called the Sketcher, where you can\ndraw lines and shapes much like you do in 2D AutoCAD. These can\nthen be extruded as solids or surfaces using a command called Pad,\nlofted, etc. to make solids.\n\nIn the image below, the tree is expanded for the Body \"Slab_Level3\" revealing a Pad. In DP, each operation used to\nconstruct an element is revealed in the tree. The properties of these operations can be edited as well.\nFor instance, by double-clicking on the Pad in the\nStructure Tree, this dialogue box comes up for the\nPad Defi nition. Within this box the type of Pad\nand the Thickness of it can be changed without\nredrawing the Pad itself. Rather than adding or\nsubtracting to a volume, like you would in AutoCAD,\nthe properties of the volume itself can be redefi ned\nthrough values entered.\n\nDRAWING A SKETCH AND MAKNG A SOLID\nThe procedure outlined below is the most basic example of how to make a solid, using a 2D sketch.\nFirst, you enter the Sketcher by selecting the appropriate icon which becomes orange when you are in that command.\nA dialogue box will appear, requiring you to pick a Reference. The reference is used to align the 2D drawing you will make in the\nSketcher to the 2D environment. This reference is usually a Plane. You can create planes to use as references, but there are also\nthree planes that mark the origin built in to each drawing that are aligned to x, y, and z orientations.\nThese are represented in the drawing as small squares (as shown above), but in actuality they represent an infi nate plane in that\nparticular orientation, which elements can be aligned to.\nthe three origin planes represented\nin the Structure Tree\nThe Sketch represented in the Tree\nThe Sketcher Icon\nThe origin planes\nThe Sketcher dia-\nlogue box prompt-\ning the selection of\na Reference Plane\n\nThe solid created is shown below. Notice the Pad is in a Body that I renamed \"shape\", and the geometric set that I renamed\n\"shape base\" contains the sketch. Also, notice the Sketch is hidden. DP automatically hides the 2D construction elements\nwhen a 3D solid is created."
    },
    {
      "category": "Resource",
      "title": "recit1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/9ab41a9f061aa56a423e5491397246c4_recit1.pdf",
      "content": "4.501 Recitation 1\n\nNAVIGATION AND ORIENTATION\n\nOrbiting, Zooming, Understanding the Structure Tree, Selecting and editing components,\nMoving between workbenches, Measurement Tools\nHiearchy of tree:\n- Product\n- parts\n\n- geometrical sets\n\n- bodies\n\n- part bodies (avoid using them)\n\nORGANIZING PARTS: BODIES AND GEOMETRICAL SETS\n\nIn order to successfully link and print drawings, organizing Bodies and Geometric Sets is\nnecessary.\n\n-\nGeometric Sets consist of the \"construction lines\"--2-D components that are used\nto construct the 3-D components of the model.\n-\nBodies are the 3-D solids used to create the total assembly of the building (model)\n-\nParts consist of the bodies and geometric sets of a particular portion of the building\nassembly. These can be worked on separately and inserted into a Master Model\nthat makes up the total assembly of a buildng.\n\nCATparts, as they are called in the structure tree, can be worked on separately, as separate files.\nThe entire assembly that you create consisting of these CATparts is the CATproduct. Geometrical\nSets and Bodies make up the part and cannot be worked on separately.\n\nWhen properly organized and inserted, different components of the model are linked, so the\nMaster Model is updated as each component is edited.\n\nProducts, Parts, Bodies and Geometrical Sets should be renamed for successful organization of\nfiles. Construction \"stuff\" and final \"stuff\" should be clearly distinguished.\n\n- Construction \"stuff\"\n-wires\n\n-surfaces\n\n- Final \"stuff\"\n\n-Roof, Wall Assembly, Window Assembly, etc.\n\nWhen Fabricating, it is a good idea to rename Parts according to material.\n\nDRAWING WITH A BUILDING STRATEGY\n\nWhen drawing products and parts, the sequence in which you draw, and the relations between\nparts is important to the success of the model. The order in which you would build the\nstructure should relate to the order in which you draw the parts. Think about if the information\nyou use to build a particular structure is dependent on another structure and vice versa. For\nexample, your roof height depends on your wall height.\n\nOrganizing the Structure Tree: the structure tree shows which parts are dependent upon each\nother. The alteration of one component may affect another, depending upon how the model is\ncomposed. In DP, nothing ever goes away, unlike CAD, you cannot simply erase a component of\nthe model later."
    },
    {
      "category": "Resource",
      "title": "recit2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/b1a65441c0567484b2397e721297a072_recit2.pdf",
      "content": "4.501 Recitation 2\n\nMAKING A PART WITH A SKETCH\n\nCreate a Part and name it HouseCMU\n-\nInsert 2 Geometrical Sets and call one \"Floor Levels\", and one \"CMUConstruction\"\n-\nCreate a Plane in the \"Floor Levels\" set by \"Defining it as In Work Object\" and\nselecting the icon in the Geometric Workbench (right side of screen) and choosing\n\"offset from plane\" in the dialog box\n-\nOffset it from the xy plane 14', to create the top level of a wall (for instance)\n-\nCall the plane \"Level 1\"\n\nDrawing in the Sketcher\n\n-\n\"Define In Work Object\" (right click to access) as CMUConstruction\n-\nEnter the Sketcher\n-\nChoose the xy Plane to support the sketch\n-\nConstruct a sketch with Constraints\no\nDraw a Rectangle with the appropriate tool\no\nSelect an edge and select \"Define constraint in Dialog Box\" icon\no\nConstrain the Height and Width of the Rectangle\n-\nExit the sketch and create a new sketch on the same support plane as the previous\none\no\nDraw a smaller Rectangle\no\nConstrain the Distance between each edge and the corresponding edge in the\nother sketch by selecting the two edges and selecting \"Define Contstraint in\nDialog Box\" (select multiple lines by holding down the ctrl key\no\nIn the Constraints dialog box clicking the \"More\" icon will provide\nadditional options, including \"swap location\", if the distance constraint is\non the wrong side\no\nConstrain the distance on each side (the thickness of a CMU)\n\nCreating Formulas for Constraints\n-\nClick the ƒ(x) icon at the bottom of the screen\n-\nSet the type of parameter next to \"new parameter of type\" button, in this case,\nLength\n-\nClick the \"new parameter of type\" button, and it will appear as Length.1 in the box\nabove\n-\nRename the formula, \" wallthickness\"\n-\nSet it to 8\"\n-\nCreate formulas for the wall lengths, rename to \"wall_lenght1\" and\n\"wall_length2\"\n\nApplying formulas to the Constraints\n-\nEnter the sketch and double click on a constraint value\n-\nRight click on the current value\n-\nSelect \"Edit Formula\"\n-\nIn the Dialog Box select, \"Renamed Parameters\" in the \"Members of Parameters\"\nlist, to limit the number of parameters shown, and find the ones you created more\neasily\n-\nDouble Click the appropriate formula so it appears in the upper window\n-\nClick OK\n-\nApply the thickness formula to all of the distance constraints to make an equal\ndistance on all sides\n\nUsing Part Design Workbench\n\n-\nInsert a Body\n\n-\nRename it CMUWall\n-\nCreate a Pad and choose \"up to plane\" as the type\no\nSelect the outer sketch\no\nTo specify height select the Plane for the floor level created in the\nGeometric Set\n\n-\nCreate a Pocket\no\nSelect the inner sketch\no\nSpecify the floor level plane as the limit\n\nTest Parametrics by altering Constraints, this can be done by creating more formulas for\nalternate thicknesses and lengths and applying them, double-clicking on the formulas in the\nstructure tree and changing their value, or deleting the formula and typing in new numbers.\n\nUSING NAVIGATIONAL ICONS\n\n-\nHide/Show\n-\nSwap Visible Space\n-\nFit All In"
    },
    {
      "category": "Resource",
      "title": "recit3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/7b377f7c092fadb1b936286de7fba084_recit3.pdf",
      "content": "4.501 Recitation 3\n\nIMPORTING AN AUTOCAD FILE INTO DIGITAL PROJECT AND CREATING A REFERENCE FILE\n\nOpen the .dwg file in AutoCAD and prepare for exporting.\n\n-\nMake sure polylines are joined\n-\nDelete text and other unnecessary elements of the drawing\n-\nSave the file as a .dxf, preferably AutoCAD R14 or earlier\n\nEnter Digital Project and set units\n\n-\nGo to Options, select the Compatibility tab, and then select the dxf tab\no\nIn the Import section set the \"Unit of the File\" to the units your file was drawn\nin\no\nIn Parameters and Measure, set the drawing units to the units you drew your\nfile in, as well. Note: if you want to draw in DP with different units than those\nused in CAD, once the drawing is imported you can change the units and DP\nwill scale the drawing to the new units\n-\nGo to File, Open, change file type to .dxf and select the file to import\n-\nSelect the elements of the drawing you want to import and copy\n-\nGo to File, Open, New, and select \"Part\"\no\nRename the part \"Main Reference\", this file will be used as the reference file to\ncontain all construction elements of the model (wires, surfaces, planes and\nsketches)\n-\nEnter the sketcher and select a plane (xy if it's a plan, yz or xz if it's an elevation)\no\nPaste the copied drawing in the sketch\no\nIf the drawing does not need to be edited, constrain the lines to prevent\naccidental moving\n-\nExit the Sketcher and rename the Geometrical Set \"Reference Plan\" and the Sketch\n\"Main View\", or whatever name is most logical to you for organization\n\nPublishing the File:\nIn order to use the \"Main Reference\" File within a master model drawing (Product) the components\nin the file must be published\n\n-\nGo to Tools, Publication\n-\nWhen the dialog box opens, select the geometries to be published and click \"ok\"\n\nUSING THE REFERENCE FILE IN A PRODUCT (MASTER MODEL)\n\n-\nOpen a new Product and rename it the name of your house (i.e. FlatPak House)\n-\nGo to Insert, Existing Component and select the Main Reference file\nNote: make sure the Main Reference is the first below the product. This can be\nguaranteed by double clicking on the Product level before inserting the Component, if the\nfile is in the wrong place, right click on the Product and choose \"Reorder Children\" to\nchange it\n\n-\nAdd Geometrical Sets to the Main Reference for surfaces, wires, and planes\no\nPlanes can be made for building levels, and the sketch can be copied and\npasted as a new sketch on each level, as a reference\no\nIf a geometry is in the wrong set, right click and select \"geometry\nname.Object\" and choose \"Change Geometrical Set\nDRAWING IN GEOMETRICAL WORKBENCH (OUTSIDE THE SKETCHER)\n\n-\nMake sure the \"Wires\" set in the \"Main Reference\" part is chosen by right clicking and\nselecting \"Define in Work Object\", when it is active it will be underlined\n-\nSelect the point icon in the Geometrical Workbench list of icons on the right hand side\nof the screen (double-click if repeating the operation multiple times in a row)\n\no\nUsing a \"coordinates\" point, select a reference point on the reference sketch\nand leave the coordinates at (0,0,0) if the reference point is where you want\nthe point to be\no\nLay out all points for a shape\n-\nSelect the Polyline Icon (sometimes hidden under the line tool)\no\nCreate the polyline by selecting the points in the appropriate order and\nclicking the \"close\" box\no\nPoints can be reordered within the Polyline dialog box at any time, even after\nit's drawn\n-\nTo make a Surface, make the \"Surfaces\" set the In Work Object\n-\nSelect the Polyline and use one of the surface creation tools, in this case, Extrude\n-\nSpecify the height and direction of the extrusion in the dialog box\n-\nPublish these newly created elements (surfaces and wires)\n\nCREATING SOLIDS IN A SEPARATE PART\n\n-\nMake the top level (Product) active by double-clicking on it\n-\nInsert, New Part\n-\nRename it BuildingSolids (or WallSolids, EntrySolids, etc.--whatever applies)\n-\nRename a \"part body\" (insert if necessary) according to the type of solid you will be\ndrawing, relate it to material and type of element, i.e. ConcreteSlab, WoodStair\n-\nMake this part body the In Work Object\n-\nSelect a Solid creation icon in the part design workbench (left hand side of window), in\nthis case, use the \"Close Surface\" icon\no\nSelect the surface created from the polyline\n-\nA solid is created within the appropriate part body\nNote: notice that a \"External References\" Geometrical Set is created when a\npublished element from another Part is used in the creation of the solid.\n\nSAVING THE FILES\n\n-\nWhen saving, select \"Save Management\"\n-\nA dialog box will show all open files, their location, and whether they're new, modified,\nor saved\n-\nSelect the Product file and save it in a folder for that product specifically\n-\nClick \"Propagate Directory\", all files within that file will be saved in the same location.\n-\nClick Okay to complete save\n\nBy organizing files and geometries in this way, different parts of the model can be worked on by different\npeople at the same time, and re-published to the master model. If the swirl-like icon is on one of the icons of\na component, it means it has been altered and needs to be updated, which can be done by right clicking and\nselecting \"Local Update\". When drawing different portions of the model in separate Parts (files), be sure the\norigin is the same for all of them. The geometries, or construction lines, can be turned off to reveal the solids\nof the model, the actual components of the construction that will be used for prototyping and producing\ndrawings and spreadsheets. Colors and Transparencies of different elements of the model can be changed for\nbetter legibility and presentation in the Properties dialog box, accessed by right-clicking."
    },
    {
      "category": "Resource",
      "title": "recit4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-501-architectural-construction-and-computation-fall-2005/2b589b213c11adbd4eceedb9a8873393_recit4.pdf",
      "content": "4.501 Recitation 4\n\nDRAWING GENERATION: CREATING PLANS, SECTIONS AND ELEVATIONS FROM A DIGITAL MODEL\n\nWithin the model, create reference planes for drawing views\n\n-\nInsert a new Part and name it Drawing Support Geometry\n-\nSelect the plane creation icon and choose a support and an offset\no\nIf the model is drawn at the origin, the easiest method is to reference the xy\nplane for plans and the yz and xz planes for sections and elevations\no\nCreate additional planes offset a certain distance. For example, for floor plans,\nyou may want to offset the first plane 3' from the xy plane, and continue to\noffset it every 12' from there to create supports for plans at each level\n\nEnter the Project workbench by either double-clicking on the current workbench to reveal the\nworkbench icons, or select the Start menu and choose the workbench from the list\n\nWithin the Project workbench, annotations can be made, spreadsheets can be generated\nwith part information, and camera views can be generated within the drawing.\n\n-\nZoom to the desired view and select the Camera Icon on the bottom of the screen to\ngenerate a camera view. It will appear in a subset called Applications in the structure\ntree\n-\nCreate a reference section\no\nClick the Sectioning icon in the Spatial Analysis toolbar\no\nA Section Window will pop up and a corresponding section plane will appear\nin the model window\no\nThe section plane can be dragged to various points on the model, and the\n\"volume cut\" icon on the result tab will change the view to remove the sliced\nportion\n-\nCreate a 2D annotation in a specific view\no\nOrbit to the desired view and click the 2D icon (left toolbar)\no\nThe 2D annotation toolbar will come up, which allows you to create arrows\nand text notes for others using the model\n-\nCreate 2D Views for Drawing Generation\no\nSelect the desired view icon from the left hand tool bars, or select insert,\ndrawing views, and your desired view from the drop down menu--in this\ncase, select section view\no\nIt will prompt you to select a reference plane or surface, select one of the\ncreated reference planes\no\nThe set view plane will be placed in an \"Annotation Set\" subset of the structure\ntree, right click on the view in the tree to change its name to apply to the\ndrawing it will generate, i.e. Plan01\no\nAnnotations can be made on the Annotation Plane of this view which will\nshow up in the 2D drawing you produce, to create annotations select the \"text\nwith leader\" icon and insert the note\n-\nEnter the Drawing Generation Workbench to create a 2D drawing\no\nA drawing window will open, adjust the windows so both the model and\ndrawing are visible\no\nWith the drawing active, select the \"view from 3D icon\"\no\nSelect the view created in the model using the structure tree\no\nThe view will be projected in the drawing window\no\nClick on the Drawing window to activate it\n\n-\nChange Drawing Scale, Lineweights and Annotations\no\nRight click on the Name of the View in the Drawing Sheet Structure Tree\n\no\nSelect Properties, under the View tab, the scale of the drawing can be changed.\nIn addition, you can choose which 3D elements should show up in the\ndrawing.\no\nTo move the drawing, the icon at the top of the screen called \"Position View at\nOrigin of Sheet\" will put it generally where it needs to be, then drag it to the\nappropriate location by clicking on the viewport\no\nDrawing lineweights, hatches and text properties can be edited by right\nclicking on the element and choosing \"Properties\"\no\nAdditional drawing tools are available in the Insert drop down menu, such as\nAnnotations (text and leaders), 2D drawing tools and translations. These can\nbe used to create titleblocks.\n\n-\nInsert a 3D view of the Model\no\nSelect the \"Isometric View\" icon, in the Drawing Generation Workbench (in\nthe same toolbar as the \"View from 3D\" icon)\no\nSelect a reference plane (xy in this case)\no\nThe axonometric will appear in the drawing along with a blue compass\no\nUse the arrows on the compass to rotate the axo to the desired view\no\nWhen finished, click on the center circle. Note: once the circle is clicked, the\ndrawing is set and cannot be rotated between 3D orientations any longer\no\nScale the drawing and set properties the same as with the other views\n\n-\nSave the drawing as a CATdrawing. It can also be saved as a .dwg, but each element is\nan individual line on the same layer when imported, so it is best to print and setup\ndrawings from DP, Saving as a CAT drawing is helpful when creating cut sheets."
    }
  ]
}