{
  "course_name": "Archery",
  "course_description": "This 12 session course is designed for the beginning or novice archer and uses recurve indoor target bows and equipment. The purpose of the course is to introduce students to the basic techniques of indoor target archery emphasizing the care and use of equipment, range safety, stance and shooting techniques, scoring and competition.",
  "topics": [
    "Health and Medicine",
    "Physical Education and Recreation",
    "Health and Medicine",
    "Physical Education and Recreation"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week for 6 weeks, 1 hour / session\n\nCourse Description\n\nThis 12 session course is designed for the beginning or novice archer and uses recurve indoor target bows and equipment. The purpose of the course is to introduce students to the basic techniques of indoor target archery emphasizing the care and use of equipment, range safety, stance and shooting techniques, scoring and competition.\n\nEach student will be instructed in:\n\nBasic equipment used for archery.\n\nHow to practice stringing and unstringing the bow.\n\nPractice components for nocking, drawing, aiming and shooting on targets.\n\nPractice scoring and retrieving arrows.\n\nBe exposed to basic rules, competitions and etiquette of target archery.\n\nPractice stretching and warming up specifically for archery.\n\nBe encouraged to continue participation in Archery for its recreational, health, fitness and social benefits.\n\nThere is often an opportunity for students to be filmed with high speed digital photography to assess their technique.\n\nPreliminary Information-Attendance and Credit Policies\n\nClass begins 10 minutes after the hour and runs until 10 minutes before the hour.\n\nNumber of classes - Only one absence is allowed if one wishes physical education credit.\n\nMake-ups can be made in any other Archery section offered that term.\n\nAttire - Students must wear gym shoes or rubber soled shoes, comfortable clothing with short sleeved shirts.\n\nSafety - Students must abide by the \"rules of the range\" at all times as instructed.\n\nThe class meets in the rear of Rockwell Gymnasium.\n\nThere is a $5.00 fee per student for this class.\n\nAll Equipment is provided for students.\n\nRequirements\n\n$10.00 fee for equipment.\n\nSoft soled shoes or sneakers.\n\nShort sleeves, comfortable clothing.\n\nDesire to learn how to shoot and practice.\n\nAbout the Instructors\n\nCheryl Silva\n\nBringing a wealth of experience and proven success, Cheryl Silva handles the reigns of both the MIT field hockey and women's lacrosse programs. As she begins her 15th fall under the Cambridge sun, Silva has developed a legacy of success in both.\n\nShe is the winningest coach in MIT field hockey history, posting a 127-103-1 record at the Institute. The Engineers have recorded 11 winning seasons under coach Silva's tutelage, including six straight seasons with double-digit victories in the 90's. She also maintains an active role in field hockey on the regional and national levels.\n\nSilva received her bachelor's degree from the University of Bridgeport (Conn.) in physical education in 1981. She captained the field hockey and softball teams while at Bridgeport and was named to the New England All-College Field Hockey Team.\n\nFollowing graduation, Silva worked at Staples H.S. and the Princeton Day School as a physical education instructor and field hockey coach. A year as assistant lacrosse coach at Mount Holyoke College was followed by two years at Wellesley College where she was assistant to the Athletic Director, Sports Information Director, and Assistant Field Hockey and Lacrosse Coach.\n\nJarek Koniusz\n\nJarek Koniusz enters his 11th year at the helm of MIT's men's and women's fencing program with over 28 years of international level competition, as both a coach and an accomplished athlete. In 2002, Koniusz was selected by the US Fencing Federation to coach the United States sabre team in the World Cup competition held at Koblenz, Germany.\n\nKoniusz holds a master of science degree from the Academy of Physical Education in Katowice, Poland. He has earned the title of fencing master in sabre, epee, and foil. His athletic achievements include gold medal World Cup finishes and a silver medal in the 1989 World Championships. In spring 2002, Jarek was honored by the Polish Fencing Federation with a Lifetime Achievement Award, given to the fencer who has made a lasting contribution to Polish fencing in its 75 year history.\n\nKoniusz has built MIT fencing into a perennial powerhouse, qualifying 20 fencers to the NCAA National Championships and guiding MIT to nine New England Championship titles in the last six years. Seven of those fencers began their career with Koniusz, serving as a testimony to his outstanding coaching ability.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lec_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/91d27dc41c44ccdca8813474586433c5_lec_01.pdf",
      "content": "Day One\n\n1. Introductions - instructor and class members\n-brief overview of sport of archery\n-handout which covers basic of equipment and shooting\n2. Class logistics\n-attendance, credit, stretching, locker rooms\n3. Safety - rules of the range, care of equipment, range director\n\n-review parts of bow, arrow, arm and finger guards\n4. Intro - How to string and unstring bow\n5. Demonstrate firing line, stance.\n6. Demonstrate finding dominant eye to aim\n7. Review of commands for drawing: Nock, check your feet, relax back, hips, exhale,\ndraw with back muscles, anchor, aim, relax string.\n8. Practice drawing bows dry.\n9. Practice unstringing bows.\n10. Preview next class."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/f1a033006274a432f6e2e656e322e653_lec_02.pdf",
      "content": "Day Two\nIntroduce Stretches/ Warm up exercises - demonstrate and check technique of students\nStretch out with partner upon arriving at class\nChoosing equipment-bow, quiver, and arrows, arm guard, finger tab\n\n2. Review stringing bow - have students partner up, introduce themselves and teach each\nother how to string up.\n3. Archers \"to the line\" - assume the stance on firing line\n4. Verbal commands for draw - check stance -index feathers, etc.\n5. Demonstrate drawing the bow with shoulder down-demo arm bend -hook arm\n6. Wrist grip -high or low\n7. Check equipment for safety\n8. Today we will practice draw twice and then shoot three arrows under\ncommand/repeat\n9. Getting all of your arrows on the target you're meant to be shooting at.\n10. Students will practice shooting following commands from 12 yards away from targets\n11. Introduce and demonstrate retrieving arrows from target -hand to hand-don't twist or\npull from middle of arrow\n12. repeat shooting and retrieving as time allows\n13. Review unstringing bow and returning equipment to cart\n14. Preview of next class.\n\nNotes:\nWarm up, review finger release vs mechanical release gadgets.\nSplit finger, \"apache\" style\" (all three fingers below the nock mark), split finger but taking the\ntop index finger off the string before releasing.\nThe hand should be relaxed to allow the string to slip from the fingers-no effort required.\nAs the string is released, there is a slight backward movement of the hand due to the tension\nin the back muscles.\nFocusing on the role of the back muscles to create tension in the string arm-not having tension\nin the hand/arm.\nWhen at full draw-the effort required to keep the bow at full draw should be felt in the\nrhomboids and squeezing the shoulder blades together and down."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/863afe2a24a62a43b71a3e9701fb2d97_lec_03.pdf",
      "content": "Day 3\n\nCheck in/attendance\nStretch out with partner\nChoose equipment-bow, quiver, and 5 arrows, arm guard finger tab\n\n1. Review video of proper shooting technique\n2. Review and demonstrate verbal commands for draw - point of aim technique\n3. Pinching, plucking/creeping with draw hand\n4. Review bow shoulder down-demo arm bend -follow through\n5. Wrist grip -high/low\n6. Check equipment for safety\n7. Shoot in partners-one shoots, the other \"coaches\" the technique\n8. Attempt 6 rounds or \"ends\" of 5 arrows each - move back to red line for last round\n9. Goal is for all arrows on the target you're meant to be shooting at and begin grouping.\n10. Explain and demo arrow \"grouping\" on targets in quadrants\n11. Review retrieving arrows from target\n12. Return equipment"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/ab124b9843ea921228eae678f687270f_lec_04.pdf",
      "content": "Day 4\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\nMake sure arrows are different from partner you share target with\nStudents who are early can shoot warm up rounds-assign one student as range director\n\n1. Assign partners to targets-have them introduce themselves-shoot from red line\n2. Move back firing line to 15 yards from target\n3. Review plucking and creeping -follow through technique - correct stance\n4. Review pointing inside of elbow joint down toward floor to create bend\n5. Anchoring just below jaw-string in line w/ nose/bow\n6. Shoot 2 warm up rounds giving commands -emphasize \"grouping\"\n7. Introduce setting sight on bow\n8. Shoot 6 ends trying to group arrows at own pace.\n9. Introduce scoring and card - emphasize tracking where each arrow lands on target -\nlook for pattern\n10. Review self checks on back\n11. Preview next class - scoring 6 rounds\n12. Return Equipment"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/0bff6bb12e27b5cbed1c6d70bd794bba_lec_05.pdf",
      "content": "Day 5\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\nStudents who are early can shoot warm up rounds-assign one student as range director\n\n1. Assign partners to targets - introduce themselves-check arrows marked/different from\npartner\n2. Warm up 2 rounds to check equipment\n3. Review adjusting sight-shoot two arrows with sight in gold; adjust sight toward where\narrows land on target\n4. Score 6 ends on card and tally for the day-students sign the card.\n5. A good score usually averages 35 points per round"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/7d3504c67d3cb72ffbfcda9b6f299c4a_lec_06.pdf",
      "content": "Day 6\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\nStudents who are early can shoot warm up rounds-assign one student as range director\n\n1. Move back to 15 yards from target\n2. Assign partners to targets - introduce themselves-check arrows marked/different from\npartner\n3. Warm up 2 rounds to check equipment\n4. Review adjusting sight-shoot two arrows with sight in gold; adjust sight toward where\narrows land on target\n5. Score 6 ends on card and tally for the day-students sign the card - collect to seed for\nclass tournament"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/a827f1aa00b1803fb7eb20b0a1f07b2f_lec_07.pdf",
      "content": "Day 7\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\nStudents who are early can shoot warm up rounds-assign one student as range director\n\n1. Assign partners to targets - introduce themselves\n2. Warm up 2 rounds to check equipment\n3. Speed shooting for practice - start with 20 seconds per arrow for 5 arrows and decrease\neach end down to 12 seconds per arrow.\n4. 2 minutes to score and retrieve\n5. Continue to shoot attempting 8 rounds in the class\n6. Preview next class - singles tournament\n7. Return equipment"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/1bfb658ed3a0118bff5aeb7ebd0709bf_lec_08.pdf",
      "content": "Day 8\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\n\n1. Review singles tournament bracket\n2. Pick number for target\n3. Warm up shooting 3 rounds to adjust equipment\n4. Assign partners and targets for tournament\n5. Archers score each round and then move one target left if they win or stay at their\ntarget if they lose\n6. Objective is to get to the \"championship target\" no. 1 on far left.\n7. Collect scores and reassign partners\n8. Preview next class: Team Tournament (or shooting outside in warm weather)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/01dab08dc3b091773f3460f2dff9454e_lec_09.pdf",
      "content": "Day 9 - Team Tournament or Clout shooting outside (weather permitting)\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\n\nTeam Tournament:\n1. Break class up into two teams of 7 or fewer archers:\n2. Everyone scores a round vs. own team; record winners and losers\n3. Cross overs; seed archers each team based on won loss record; score a round\n\nClout Shooting:\n1. Archers need bows of 20 lbs or heavier\n2. Walk out to baseball field\n3. Set up three targets (depending on wind) 30 yards, 50 yards and 60 yards from the\nthird baseline which will serve as the firing line.\n4. Archers space themselves out on the line should not be able to touch each other.\n5. Demonstrate drawing and anchoring at the sternum\n6. Review possible factors that could impact the flight of the arrow-wind, weight of\narrow, strength of bow.\n7. In order to score, arrows must be sticking in the ground\n8. Demo retrieving arrows from the ground-pull them out at the same angle they went in.\n\nShoot 3 to 4 rounds as time allows."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-730-archery-spring-2006/d173b1a47adbefc9c61793ae9cb8e693_lec_10.pdf",
      "content": "Day 10 - Bump Over Tournament\n\nCheck in/attendance\nStretch out with partner or by self\nChoose equipment-bow, quiver, and arrows, arm guard finger tab\n\n1. Review \"Bump Over\" tournament\n2. Warm up shooting 3 rounds to adjust equipment\n3. Assign partners and targets: Archers partner up at the 7 targets\n4. Everyone shoots a round and scores\n5. Target partners have to agree to scores and declare a winner (for tie breakers either\nshoot 1 arrow if time or count number of arrows closest to center\n\n1v2\n\n3v4\n5v6\n\n7v8\n\n9v10\n11v12\n13v14\n\nwinner at #1 target stays\nall other winners slide 1 target over toward their left facing the targets\nLosers stay at target they lost at\n\nRepeat for as many rounds as you have time for\n\nnames"
    }
  ]
}