{
  "course_name": "Argumentation and Communication",
  "course_description": "This Communication and Argumentation seminar is an intensive writing workshop that focuses on argumentation and communication. Students learn to write and present their ideas in cogent, persuasive arguments and other analytical frameworks. Reading and writing assignments and other exercises stress the connections between clear thinking, critical reading, and effective writing.",
  "topics": [
    "Humanities",
    "Literature",
    "Nonfiction Prose",
    "Rhetoric",
    "Social Science",
    "Communication",
    "Humanities",
    "Literature",
    "Nonfiction Prose",
    "Rhetoric",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis Communication and Argumentation seminar is an intensive writing workshop that focuses on argumentation and communication. What does it mean to make an argument? What are the different types and styles of arguments that you can make? What are the different forms of writing that you need to learn in order to be successful here at MIT and when you move into the professional world?\n\nThis seminar provides the forum we will use to discuss your ideas, thoughts, apprehensions, frustrations and successes that go along with writing and communicating effectively. In this class we will write, revise and revise again. We will also practice oral briefing skills.\n\nThis class uses some of the assignments in your other classes as a springboard for the writing that we will be doing in this class. This means that I do not intend to make up all the writing for you to complete. Instead, I encourage you to use assignments from your other classes (such as the Gateway class,\n11.201\n) to analyze, revise and rethink your arguments about topics that interest you.\n\nHere are just a few of the topics we will discuss:\n\nUnderstanding the parts of an argument\n\nDrafting memos that get results\n\nCreating and giving oral briefings\n\nUnderstanding good, bad and horrible graphics\n\nAs part of this class, you will be given many opportunities to practice your writing and speaking skills. In-class writing and peer review will provide the means by which you practice and refine your ability to communicate complex ideas clearly.\n\nCollaborative Learning\n\nThis class works best for those students who use class time to share their ideas, thoughts and creative suggestions. This means practicing active listening and participating skills. You will find that giving and receiving constructive feedback can be a highly useful tool for learning to analyze and improve the quality of your writing and analysis. Your peers can provide a new perspective, valuable insights, and guidance for you as you work through your research question.\n\nToward this end, we will work together to test your writing in order to help you find ideas that can be structured into viable arguments. As in many group situations, those students who commit to coming to each class and who are more willing to put forward nascent ideas and thoughts will get the most time and assistance.\n\nGrading\n\nThe Grade for the course is based on a series of written and oral assignments.\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance\n\n25%\n\nShort Assignments\n\n50%\n\nOral Presentations\n\n25%\n\nAttendance\n\nAs indicated above, attendance is critical to a class forum which will largely be a round-table (although we have a rectangular table) discussion. We will use the time together to discuss ideas, review writing and presentation work and explore the next steps in the research process. As such, students will be allowed\nonly two unexcused absences\nfrom class.\n\nWritten Work\n\nAll written assignments must be submitted in hard copy on the day it is due (this includes PowerPoint\n(r)\npresentations). Written work must be typed, spell-checked, and neatly formatted. Please include your name, the course number, assignment number, and date at the top of the page or on a cover sheet. While an occasional typo or editing error may slip through, the presence of several mistakes indicates a lack of attention and will lower your grade. Specific formatting conventions are negotiable, based on standards in your field and appropriateness for your intended audience.\nAll work must be professional looking and designed for easy reading\n.\n\nDocumenting Sources\n\nDo not cut and paste material from Web pages or other documents without making evident the source of the information. This is called plagiarism, which is a serious offense and subject to formal action by the Institute. Inadequately documented papers (including bibliography and footnotes or in-text citations) will not receive a passing grade.\nWhen in doubt, document the source\n.\n\nWeekly Workshops\n\nThe focus of this class will be on editing and revising. So, each week we will review writing that you or I bring to share with the class. You will take turns bringing in writing to share with the class so that we get a chance to really focus on what you have brought. Student samples should be no more than one page long.\n\nHow this works: I will assign each of you two dates for which you will be expected to bring in writing to share with the class. This is your chance to get substantial feedback on the areas that you need to work in. So, I encourage you to select your pieces of writing carefully in order to get the most out of the workshop session.\n\nWe will work in small groups and together as a larger class. Please bring in an electronic copy and also 10 copies of each piece of writing on your assigned day.\n\nWeekly Readings\n\nIn order to be able to write arguments, you need to read well-written published arguments. So, each week you should be reading 5 to 10 opinion/editorial pieces.",
  "files": [
    {
      "category": "Resource",
      "title": "ps2attach.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/47f3c1db95db10c623250bc2e8fd9f2f_ps2attach.pdf",
      "content": "How To Analyze an Argument\n\nLogic\n1. What is the topic?\n2. What is the main claim - main message?\n3. What are the assertions that support and further the main message?\n4. Is there evidence to support the assertions?\n\nEthos -- Credibility - Why should we listen to this author?\n5. Is the author well informed? How do you know?\n6. Does the piece offer different sides of the argument? (counter-\narguments?\nDoes the author tell how s/he is connected to the issue?\n\nPassion - Why should we care? What is the significance?\n7. What is the tone like? Engaging? Defensive? In other words, do you\nfeel like you are talking to someone or do you feel like someone is\ntalking at you?\n8. Does the author say how the issues affect him/her?\n9. Does the author help you feel connected to the issue?"
    },
    {
      "category": "Resource",
      "title": "analyze_argument.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/1a11b01ad75a950c25f70ba8b3c4be5e_analyze_argument.pdf",
      "content": "How To Analyze an Argument\n\nLogic\n1. What is the topic?\n2. What is the main claim - main message?\n3. What are the assertions that support and further the main message?\n4. Is there evidence to support the assertions?\n\nEthos -- Credibility - Why should we listen to this author?\n5. Is the author well informed? How do you know?\n6. Does the piece offer different sides of the argument? (counter-\narguments?\nDoes the author tell how s/he is connected to the issue?\n\nPassion - Why should we care? What is the significance?\n7. What is the tone like? Engaging? Defensive? In other words, do you\nfeel like you are talking to someone or do you feel like someone is\ntalking at you?\n8. Does the author say how the issues affect him/her?\n9. Does the author help you feel connected to the issue?"
    },
    {
      "category": "Resource",
      "title": "guide_dec_memos.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/9fd176faea61535e638c44088ae03b66_guide_dec_memos.pdf",
      "content": "-------------------------------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\nMassachusetts Institute of Technology\nGuidelines for Decision Memos\nSo, you have to write a decision memo and you're wondering what is a decision memo anyway?\nWhat do these Gateway people really want from me? What do I know about some dam in India?\nI know these assignments can be frustrating, especially when you feel you don't have enough\ntime, but there is a purpose. The public housing case was meant to introduce you to the fast pace\nof the class, but provide most everything you need - predigested cases - so that you wouldn't\nhave too many loose ends. The Narmada case asks you to stretch a bit more. We want to know\nif you can take a very open ended case, with many players and many issues and find some way to\nmake sense of the mess. In other words, can you offer guidance to a leading international World\nBank Council?\nHere is one strategy with 6 tasks that are explained in detail below:\nPLAN\nTask 1: Analyze your audience and define your purpose\nTask 2: Generate ideas\nTask 3: Group information under headlines\nTask 4: Sequence your ideas\nDRAFT\nTask 5: Write a first draft\nEDIT\nTask 6: Edit for clarity, conciseness, accuracy, visual design, and\ntone.\n\n__________________________________________________________________________\n___________________________________________________________________________\n___________________________________________________________________________\n______________________________________________________________________________\n______________________________________________________________________________\nMassachusetts Institute of Technology\nTask 1: Analyze your audience and purpose\n1. Purpose:\nWhy am I writing this? _______________________________________________\nWhat do I want the reader to do? ______________________________________\n2. Audience:\nWho exactly is my reader? Do I have more than one reader? ________________\nWhat is the reader's role: decision maker? Implementer? Influencer? Other?\nWhat does the reader know about my subject? ____________________________\nHow will my reader react to my main message? Receptive? Indifferent?\nResistant?__________________________________________________________________\nWhat's in it for the reader? Why should the reader read this or agree with it?\nWhat issues could affect this communication? Ethnic? Corporate? Language?\n3. Main Message:\nIf the reader were in an elevator and the doors were closing, what would I yell to\nthat person to remember as my main message?\nOnce you have your main message ask the following questions:\n\nSo what?\n\nWho cares?\nCould I be wrong?\nTask 2: Generate ideas\n1. Brainstorming\nA. Brainstorming technique - write as many ideas as you can down without thinking or\nediting them.\nOr\nB.\nDraw a circle in the middle of a piece of paper.\nWrite your main message in the circle.\nWrite your ideas on \"spokes\" that surround and connect to the main message.\nNumber your ideas in order of importance.\n2. Free writing technique - write for 5 minutes without stopping. You are not allowed to take\nyour pen off your paper or stop. If you don't know what to say, just keep writing \"I don't know\nwhat to say\"\n\nMassachusetts Institute of Technology\n3. Questioning - for 5 minutes write as many questions as you can about your subject with out\nstopping to consider whether they make sense.\n4. Dictation - Dictate your ideas into a digital recorder.\nTask 3: Group information under headlines\n1. Memo categories that can double as headlines\nSummary\nAnalysis\nProposal\nAction Steps\nRational\nSpecifications\nAction Requested\nAnalysis of data\nSummary\nNext steps\n\nImplementation Plan\nConclusion\n2. Creating Effective headings\nThe purpose of headings is two-fold. First, headings guide the reader to the important\ninformation. Second, the headings give the reader a message about the content in that section.\nWhen finished, the reader should be able to get a full sense of the memo just by reading the title\nand the headings that you write. If you still haven't found your main message, turn your topics\ninto statements and see if your main message surfaces.\nCategory\nÆ\nEffective Heading\nActors\n\nFour Groups of Actors argued four different strategies in\n\nthe\n\nNarmada\n\nCase\n\nTop Down Planning\nPlanning from the top cannot be completely dismissed as a\n\nmechanism for affecting change\nTransnational Factors\n\nTransnational Actors are often not considered in planning a\nlarge-scale project - a mistake that can lead to....\nTask 4: Sequence your ideas\nIt is not enough to just figure out the points you want to make and your main message, you need\nto put them in an effective order. To do this, take a look at the headings you wrote for Task 3\nand number them in order of importance. Once you do this, you need to study them to find out\nhow read, one after to the other. In other words, your headings, need to flow in the right\ndirection when your read them.\n\nMassachusetts Institute of Technology\n1. Put the main message first and summarize it for the reader in the first paragraph.\n2. Put the most important supporting point with effective heading next.\n3. Put the second most important supporting point next.\n4. Continue to include point after point with its effective heading.\nThen:\nA. Read them in sequence out loud to yourself.\nB. RE-Organize your headings to figure out if there is a more effective way to order them.\nC. Ask yourself again - So What?\nTask 5: Write a first draft\nNow that you have your main message and your headings in the right order, it is time to start\nwriting. For this part, you need to consult Task 2 - Generating Ideas. What ideas did you write?\nDo you nee to write more? Less? To begin writing in your categories try the following:\nRaw Text\n1. Pick an effective heading to work on - one that has a clear message that relates to your main\nmessage or core idea. This should be your favorite heading - the one you know the most about\nor the one you find most interesting.\n2. Begin to write on your heading section. You could free write, brainstorm ideas, or use any of\nthe other ideas listed in task 2. The point is to begin to get words on paper.\nForming Paragraphs\nOnce you have your ideas for your paragraphs, you need to organize them into paragraphs. A\nparagraph is a unit that discusses a single issue or point. If you want to talk about a new issue,\nyou need to have a form a new paragraph.\nParagraphs have the following characteristics:\n1. They are short 5 to 7 sentences at most in memos.\n2. Paragraphs have a topic sentence that states the main issue that will be discussed.\n3. Paragraphs must be related to the effective heading which is directly related to the paper's\nmain message.\n4. Paragraphs can provide evidence and examples to support the main point.\n5. Paragraphs can have a short conclusion.\n6. Paragraphs use transitional words to connect sentences within the paragraph.\n7. Paragraphs link to the next paragraph or to the next section using a transitional sentence\n(more on this below).\nCohesive Tissue\nIt is not enough to talk about your ideas in paragraph units. Paragraphs need to connect to one\nanother and to the section that follows. To create connections we use transition words or\n\nMassachusetts Institute of Technology\nphrases. Words such as \"however\" or \"in addition\" are general words that can be used. Other\nwords that speak directly to the subject matter tend to be better connectors.\nIn addition, transitional sentences are used by writers to connect paragraphs together. Sentences\nsuch as \"As we will see below, there are three major considerations that....\"\nTask 6: Edit for clarity, conciseness, accuracy, visual design, and\ntone.\nOnce you are finished composing, you need to begin the editing process. It is best if you can ask\na friend to read your work for you so that you can get a fresh pair of eyes to help you find\nmistakes. Here are some general strategies.\nRead your memo out loud.\nRead you memo backwards one sentence at a time.\nCheck for typos.\nPut your work aside for a few hours, a day in order to make sure it reads well.\nCheck for effective word choice."
    },
    {
      "category": "Resource",
      "title": "guide_info_memos.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/ed1e65990aae6f1c7db2c77a79d02f1c_guide_info_memos.pdf",
      "content": "Massachusetts Institute of Technology\nGuidelines for Effective Informational Memos\nWriting clear, informative memos is a critical to your career whether you are a policy maker, engineer, architect,\nconsultant, or activist. Informative memos help lay the ground work for critical decisions that you and others will be\nmaking. Informative memos are not decision memos; they do not recommend a course of action. Instead,\ninformative memos are directed to a decision maker and seek to:\n-\nhighlight options,\n-\ncompare alternatives, and\n-\nprovide analyses.\nAs such your ability to covey complex information simply is key. Also important is your forethought about the\nconcerns of the decision maker and deciding how to address each concern.\nOf course no writing is unbiased and while you will likely have an opinion about the best course of action, save\nthese strong opinions for later. Instead, challenge yourself to carefully lay out each critical issue, idea or plan and\nanalyze these using a carefully chosen structure (e.g., pros/cons, long term/short term). Think of an informational\nmemo as a document that sets the stage, frames the issues, and provides the detailed analysis that feeds into the\nlarger decision. When you what know your decision maker expects (audience) and you give her what she needs\nclearly and concisely (meeting expectations), you become part of the decision making team.\nOkay, so here's the strategy:\n1. Include a Summary Paragraph:\nSimilar to an action memo, here you need to summarize the contents of the memo. However, your decision maker\ndoesn't want an action plan. She will create that (or have you create it later). Instead:\n-\nState the issue (1 sentence),\n-\nSummarize the analysis briefly (1-3 sentences), and\n-\nOutline the options (1-3 sentences).\n2. Focus on the content of the memo:\nThe body of the memo is where the analysis goes. Here you want to explicitly tell the decision maker that she will\nneed to make a decision about the issues that you will present one by one. For each issue you need to:\n-\nName and explain briefly each issue - most important issue goes first;\n-\nProvide the analysis at a level expected by the reader (don't include raw data, if she wants to focus on\ntrends);\n-\nDiscuss options; and\n-\nUse a sub heading to divide issues.\n3. Craft the Conclusion\nInformational memos have conclusions that state what the next steps are, but don't draw conclusions or recommend\nany specific action. It is not about providing a distinct answer to a question but providing a variety of well-analyzed\noptions.\n\nMassachusetts Institute of Technology\n4. Don't under estimate the power of tone in writing\nGet in the habit of thinking about who you are writing to and where the memo might end up (the press, a higher up,\netc.) Everything you write these days and send electronically (even e-mail) should be carefully crafted, edited and\nthen scanned for problems. Informative memos have a distinctively neutral tone. They don't seek to sell an idea,\nalthough your choices about what to present and how will often persuade a decision maker. In general tone should:\n-\nBe diplomatic;\n-\nAcknowledge problem areas;\n-\nAdvance options without arguing with existing policies; and\n-\nBe tactful, not patronizing or insistent.\nPracticing more than one style of memo writing will help you fine tune and develop your individual style."
    },
    {
      "category": "Resource",
      "title": "guide_pres.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/d1707ae4dc9223e798bceafd3264cb14_guide_pres.pdf",
      "content": "Massachusetts Institute of Technology\nGuidelines for Effective Briefings\nCan you get up on your feet with only a week's notice and speak on a topic you just learned something about? We\nwant to know. Can you digest the history, the context, the social engineering and mis-engineering, successes and\nfailures and report on these to an audience? We want to know. And, can you coordinate with a group, can you\ncreate a set of effective written and visual materials, can you be enthusiastic, fun and entertaining? We want to\nknow.\nSo, we designed these oral briefings to challenge you in many ways that we believe you will be challenged when\nyou get out of MIT. The real world doesn't provide endless time to research, prepare and present. Many times you\nwill be asked to speak on an issue when there is very limited data, no time and scant resources.\nBut, public briefings should be brief and too the point (read: you won't have to be up there forever). We\nrecommend that you focus on the key elements (discussed below) of a briefing:\n-\nPick a format - linear or hub/spoke.\n-\nProvide brief background/context on the issue.\n-\nProvide a clear structure for the briefing.\n-\nProvide analysis.\n-\nProvide a conclusion.\nAs with informational memos, your ability to covey complex information simply is key. Also important is your\nforethought about the concerns of the audience. Challenge yourself to carefully lay out each critical issue, idea or\nplan and analyze these using a carefully chosen structure (e.g., pros/cons, long term/short term, then/now). Think of\nyour briefing as way to frame issues and analyze those specific issues so that you can feed into a larger decision.\nWhen you know what your decision maker expects (audience) and you give her what she needs clearly and\nconcisely (meeting expectations), you become part of the decision making team.\nHere's one strategy:\nTask 1. Work as a Team - You will need to decide a few things as a group before you get underway. The format\nis critical. Remember that there are two approaches - the linear model and the hub and spoke model. Both models\nshare a priority: Get the audience informed and back up what you say with well-designed visuals. The difference\nbetween the two models is high vs. low control over the flow and sequence of information.\nIt is likely that your team will have a variety of skill sets. Some of you will be better at: creating slides, presenting,\ncoordinating, or ordering take out. Whatever these strengths are, play to them and decide:\n-\nWho talks when?\n-\nWho is the techie?\n-\nWho changes whose slides when different members present?\n-\nWho is the best speaker (put first or last or use as the moderator (hub/spoke)?\n-\nWho has the most fear (needs the most encouragement and practice with team)?\n\nMassachusetts Institute of Technology\nTask 2. Focus on the parts of the briefing - Introduction, Analysis, Conclusion\n-\nCraft the Introduction - Here you introduce the issue(s) and tell a portion of the story. This means that\nyou get to present the first piece of the whole picture, so present it well.\no\nIntroduce team members -- Say who you are (a consulting group, a task force, etc.)\no\nSay who the audience is (homeowners, residents, academics, etc.)\no\nState the purpose of the briefing - Describe the issue for the audience\no\nOutline the entire briefing for the audience\n-\nFocus the Content/Analysis - The body of the briefing, like a memo, is where the analysis goes. Here you\nwant to show the decision maker the analysis that she will need to make her decision.\no\nBreak down analysis into chunks and assign each chunk to a team member (most important piece\ngoes first)\no\nFor each chunk, highlight its main points\no\nShow data, charts, graphs, photos as part of the analysis\no\nDecide -- does this individual piece have its own conclusion? Action steps?\no\nMake sure that one chunk doesn't out pace other chunks in terms of depth, analysis and visual\neffectiveness - remember you're a team.\n-\nNail down your Conclusion - Synthesize, synthesize, synthesize -- Briefings have conclusions that\nsynthesize the information for the listener and outline the next steps. It can be about recommending a\nspecific action or providing a variety of well-analyzed options. As the wrap-up presenter, can you:\no\nPull the strings of the analysis together for the listener?\no\nShow how the chunks of analysis work together (even though they were presented by different\nteam members)?\no\nTell your audience/decision makers what the next steps/next area of analysis, next study should\nbe?\nTask 3. Get Ready for Questions and Answers -- Everyone in the team must be ready for Q&A. So, everyone\nneeds to focus.\n1. Predict three most likely questions you will be asked and prepare answers\n2. Create back up slides with further analysis and put them at the end of the slide show\n3. Listen carefully to questioners\n4. Be brief, be concise and be understanding\n5. If you don't know, don't pretend to know\n6. Don't meet a rude question with a rude answer - be polite and diplomatic and move on\n7. Respond with brief examples\n8. Pause briefly before you answer - this shows that you have considered the question\n9. Decide who will field which types of questions"
    },
    {
      "category": "Resource",
      "title": "oralpresentation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/5f622468937e59000ff4730f6a12cb25_oralpresentation.pdf",
      "content": "Abbanat/ -- Effective Oral Presentations\nSlide 1\nEffective Oral Presentations\n11.225\nFall 2006\nCherie Miot Abbanat\nDepartment of Urban Studies and Planning\n\nAbbanat/ -- Effective Oral Presentations\nSlide 2\nThe Tasks....\nDelivery\nStructure\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 3\nUnmask your Audience\nRace\nGender\nGeneration\nAffiliation\nSize\nAttitude\nEducation\nEconomic status\n\nAbbanat/ -- Effective Oral Presentations\nSlide 4\nStructure the Presentation\nBeginning\nMiddle\nEnd\nState the Issue\nTell us why it is\ninteresting\nChoose a framework\nAnalyze the parts of\nthe issue\nShow how the parts\nfit with the whole\nRecap/Synthesis/\nNext Steps\nStructure\n\nAbbanat/ -- Effective Oral Presentations\nSlide 5\nBegin with the End\nWhat is the Purpose of the Presentation?\nWhat Problem are you working on?\nRoadmap - what structure do you use?\nStructure\n\nAbbanat/ -- Effective Oral Presentations\nSlide 6\nMiddle -- Choose a Framework\nCause/Effect\nProblem/Solution\nCategories or elements of the problem\nQuestions/Answers\nChronological - historical background\nStructure\n\nAbbanat/ -- Effective Oral Presentations\nSlide 7\nEnd With Your Message\nHighlight Major\nPoints\nSummarize\nRecommendations\nSynthesize in light of\nproblem/purpose\n\nOutline next steps!\nStructure\nFigure showing t\nhe different st\neps to\nsynthesizing a r\ne\np\no\nr\nt\n.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 8\nNon Linear Structure -- Hub and\nSpoke Model\nStructure\nImage courtesy of the US Department of Transportation <http://ostpxweb.dot.gov>\n\nAbbanat/ -- Effective Oral Presentations\nSlide 9\nContent is Key!!\nContent\nImage removed due to\ncopyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 10\nContent is Key....\nKnow your project\nCollect more information than you will\nuse\nFocus on graphs and charts\nAnticipate problem areas\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 11\nContent and Visual Aids\nKeep them simple\nAverage attention span\nper slide is 8 seconds\nUse examples and metaphor\nThe stretching of vorticity is a\ndifficult physical concept, but\ncomparing it to a skater's\nconservation of momentum\nhelps to clarify what we mean\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 12\nVisual Arguments Need Evidence\nPresent evidence\nTeach with evidence\nConvince with\nevidence\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 13\nWhat does the Audience Expect?\nt (time)= 15', T (temperature)=32°; t=0',\nT=25°; t=6', T=29°; t=3', T=27°; t=12',\nT=32°;t=9', T=31°\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 14\nWhat does the Audience Expect?\nTime (min)\nTemperature (°C)\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 15\nWhat does the Audience Expect?\nTemperature (C)\nTime (min)\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 16\nWhat about Context?\nContent\nIll\nust\nrat\nion\nshow\ning how graphics should not\nuse information out of co\nntext.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 17\nWhat about Context?\nContent\nMor\ne d\nata\nca\nn r\nevea\nl im\nport\nant\ninfo\nrmation.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 18\nWhat about Context?\nContent\nCo\nnt\nra\nst\ni\nng s\never\nal t\nrend\ns in\na singl\ne graph.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 19\nDoes Image Quality Matter?\nConsider size\nChoose colors with care\nMake data accessible\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 20\nWhat about Size?\nContent\nImage courtesy of the CIA <http://www.cia.gov>Haiti in a top-level map.\nHaiti in a mediu\nm-level map.\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 21\nWhat about Colors?\nContent\nIllustrat\nion s\nhowin\ng the e\nxcess\nive use\nof\ncolo\nrs.\n\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 22\nWhat about Colors?\nContent\nIllustrati\non showing\na mod\nerate use of colors.M\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 23\nWhat about Colors?\nContentIllustration showing the lack of contrast in the colors used.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 24\nMake Data Accessible\nContent\nIllu\nstr\natio\nn s\nhowi\nng t\nhe\ngra\nphs\nand\nth\ne ra\nw da\nta u\nsed.\n\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 25\nFocus on the Overall Composition\nWhat is the eye drawn to?\nWhere does the reader want to focus?\n\"Less is More\"\nAvoiding chart junk\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 26\nWhat is the eye drawn to?\nContent\nImage removed due\nto copyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 27\nWhere Does the Reader want to Focus?\nContent\nImage removed due\nto copyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 28\nWhat are Credible Visual\nArguments?\nThe integrity of the graphic is key\nInclude careful comparisons\nDocument everything\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 29\nLack of Graphical Integrity\nContent\nImage removed due to\ncopyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 30\nFaulty Comparisons\nContent\nImage removed due\nto copyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 31\nWhat are Emotional Arguments?\nHave a single message\nAppeal to our hearts\nStir us inside\nMove us to action\nInclude evidence and examples\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 32\nWhat can you do to help a child in China\nstay in school?\nImage removed due\nto copyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 33\nContent\nImage removed due\nto copyright restrictions.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 34\nPrepare the Delivery\nFocus and center\nyourself\nBe excited about\nyour subject\nBe yourself--don't\nimitate others' styles\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 35\nDid you rehearse?\nPractice and time briefing at least 6 times\nGet feedback\nIs your content clear?\nDo you rock, squirm, gesture too much?\nIs there room for improvements/adjustments?\nWhat 3 questions will your audience ask\nyou?\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 36\nRehearse non-verbal\ncommunication\nDelivery\nNon-verbal communicati\non speaks loudly.\nFigure by MIT OCW.\n\nAbbanat/ -- Effective Oral Presentations\nSlide 37\nHow do you connect with the\naudience?\nUse the terms that your audience knows\nUse examples to explain new ideas\nEngage the audience\nEstablish eye contact; look at people not the screen\nUse friendly hand gestures\nSpeak to specific individuals if you know them\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 38\nHow do you connect with your\naudience?\nA presentation is two-way\ncommunication\nPay attention to audience reaction\nModify your talk as needed (are they listening or\nreading email?)\nLook for nods, smiles and strange looks to\ndetermine if your message is being received.\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 39\nThe Presentation Doesn't Live on\nthe Screen\nSay more than\nyou show\nHand-out more\nthan you say\nLeave paper trail\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 40\nThe Presentation Flows Through\nYou\nWeave a story\nWhy is this\ninteresting?\nInclude stories,\nexamples,\nevidence?\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 41\nDid you prepare for questions?\nListen actively (nod, make eye contact)\nAnswer the question and move on\nSay you don't know, if you don't know\nState that you will supply answers later,\nif necessary\nDelivery\n\nAbbanat/ -- Effective Oral Presentations\nSlide 42\nCan you finish strong?\nStructure - pick one\nContent is key! -- What was your primary\nmessage?\nDelivery -- Rehearse, rehearse, rehearse\nDelivery\nContent -->\nStructure -->\n\nAbbanat/ -- Effective Oral Presentations\nSlide 43\nThe Tasks....\nDelivery\nStructure\nContent\n\nAbbanat/ -- Effective Oral Presentations\nSlide 44\nSources\nPurpose, Movement, Color:\nA Strategy for Effective Presentations\nTom Mucciolo and Rich Mucciolo, MediaNet, Inc.,\nThe Quick and Easy Way to Effective Speaking\nDale Carnegie, Dale Carnegie Associates, Inc., 1962\nThe Visual Display of Quantitative Information\nEdward R. Tufte, Graphics Press, 1983"
    },
    {
      "category": "Resource",
      "title": "paragraph_flow.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/3d8ccde7d1caa64f9b981ab7f55b5835_paragraph_flow.pdf",
      "content": "Paragraph Structure\nParagraph Structure\nCherie Miot Abbanat\n11.225\nDecember, 2006\nCherie Miot Abbanat\n11.225\nDecember, 2006\n\nHow can we better shape our\nParagraphs?\nHow can we better shape our\nParagraphs?\nTopic sentences\nParagraph Flow\nTransitions and connections\nTopic sentences\nParagraph Flow\nTransitions and connections\n\nBegin your paragraph with your\ntopic sentence\nBegin your paragraph with your\ntopic sentence\nThe topic of the paragraph:\n-grounds the reader\n-announces the focus of the paragraph\n-is usually a noun of some kind\nThe rest of the paragraph characterizes,\nexplains, comments on, the topic\nThe topic of the paragraph:\n-grounds the reader\n-announces the focus of the paragraph\n-is usually a noun of some kind\nThe rest of the paragraph characterizes,\nexplains, comments on, the topic\n\nWhy Do We Need Topic\nSentences?\nWhy Do We Need Topic\nSentences?\n1.\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury.\nAs readers, we assume that the rest of the paragraph\nwill:\n- comment on,\n- criticize, or\n- explain this position.\n1.\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury.\nAs readers, we assume that the rest of the paragraph\nwill:\n- comment on,\n- criticize, or\n- explain this position.\n\nTopic Sentences (cont.)\nTopic Sentences (cont.)\nPrivate higher education is seriously\nconcerned about population trends through\nthe end of the century. Educational\nthinking has changed throughout the\ndecades. In fact, many scholars question\nwhether private education is worth its price\ntag.\nPrivate higher education is seriously\nconcerned about population trends through\nthe end of the century. Educational\nthinking has changed throughout the\ndecades. In fact, many scholars question\nwhether private education is worth its price\ntag.\n\nToo Many Topics\nToo Many Topics\nPrivate higher education is seriously\nconcerned about population trends through\nthe end of the century. Educational\nthinking has changed throughout the\ndecades. Is private education worth its\nprice tag, many scholars want to know.\nPrivate higher education is seriously\nconcerned about population trends through\nthe end of the century. Educational\nthinking has changed throughout the\ndecades. Is private education worth its\nprice tag, many scholars want to know.\n\nParagraphs have structure\nParagraphs have structure\nDecide and announce a clear topic.\nRefer or connect to that topic through the rest of\nthe paragraph.\nInformation placed at the beginning of a sentence\nannounce that :\nThe sentence connects to its topic\nThe sentence connects to the previous sentence\nThe sentence will offer a new idea or example to\nfurther understanding of the topic\nDecide and announce a clear topic.\nRefer or connect to that topic through the rest of\nthe paragraph.\nInformation placed at the beginning of a sentence\nannounce that :\nThe sentence connects to its topic\nThe sentence connects to the previous sentence\nThe sentence will offer a new idea or example to\nfurther understanding of the topic\n\nWhat is Paragraph Flow\nWhat is Paragraph Flow\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury. Population trends will signal to these\ninstitutions the rate of growth that they can expect\nin the next 10 to 20 years. For example, if the rate\nof growth expands by 10%, these institutions can\nexpect about a 5% increase in the number of\nstudents attending college. If the number of\nstudents increases, this growth will affect capital\ncosts, faculty additions, among other expenses.\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury. Population trends will signal to these\ninstitutions the rate of growth that they can expect\nin the next 10 to 20 years. For example, if the rate\nof growth expands by 10%, these institutions can\nexpect about a 5% increase in the number of\nstudents attending college. If the number of\nstudents increases, this growth will affect capital\ncosts, faculty additions, among other expenses.\n\nParagraph Flow out of control\nParagraph Flow out of control\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury. Population trends can tell a business\nowner what markets to look at when designing\nnew products and services. New products and\nservices are part of the global market place but can\nhave severe implications on the countries that\nmanufacture them. Manufacturing has been the\npath towards greater wealth for many developing\nnations but the question is whether these global\nfirms are good for the environment.\nPrivate higher education is seriously concerned\nabout population trends through the end of the\ncentury. Population trends can tell a business\nowner what markets to look at when designing\nnew products and services. New products and\nservices are part of the global market place but can\nhave severe implications on the countries that\nmanufacture them. Manufacturing has been the\npath towards greater wealth for many developing\nnations but the question is whether these global\nfirms are good for the environment.\n\nWhat are Transitions\nWhat are Transitions\nAdding: furthermore, moreover, similarly, and,\nalso\nOpposing: but, however, though, nevertheless, on\nthe other hand\nConcluding: so, therefore, for, as a result,\nconsequently\nIntensifying: in fact, indeed, even, as a matter of\nfact\nSequencing: first of all, second, next, finally...\nAdding: furthermore, moreover, similarly, and,\nalso\nOpposing: but, however, though, nevertheless, on\nthe other hand\nConcluding: so, therefore, for, as a result,\nconsequently\nIntensifying: in fact, indeed, even, as a matter of\nfact\nSequencing: first of all, second, next, finally...\n\nHow can we best use\nTransitions?\nHow can we best use\nTransitions?\n- Be careful not to tack on ideas\nMetaphor is one of the most difficult figures of speech for\nan inexperienced writer to master. Also, irony can be a\nproblem.\nMetaphor is one of the most difficult figures of speech for\nan inexperienced writer to master. Also, it requires a\nmature imagination and a sense of appropriateness.\nBecause would be more precise:\n... an inexperienced writer to master because is requires a\nmature imagination and a sense of appropriateness.\n- Be careful not to tack on ideas\nMetaphor is one of the most difficult figures of speech for\nan inexperienced writer to master. Also, irony can be a\nproblem.\nMetaphor is one of the most difficult figures of speech for\nan inexperienced writer to master. Also, it requires a\nmature imagination and a sense of appropriateness.\nBecause would be more precise:\n... an inexperienced writer to master because is requires a\nmature imagination and a sense of appropriateness.\n\nEffective Use of Transitions\nEffective Use of Transitions\nWhen you contradict:\nI love you, but\ndo so early on.\nAvoid using a series of contradictory transitions so\nthat you don't confuse the reader:\nI love you, but I am not sure about our\nfuture. However, we could focus on the fact that I\nam not single, but that would be futile because we\nalready have discussed this complication.\nWhen you contradict:\nI love you, but\ndo so early on.\nAvoid using a series of contradictory transitions so\nthat you don't confuse the reader:\nI love you, but I am not sure about our\nfuture. However, we could focus on the fact that I\nam not single, but that would be futile because we\nalready have discussed this complication.\n\nHow can we best use transitions?\nHow can we best use transitions?\nUse logical connectors such as therefore, hence,\nthus and then sparingly.\nPlace transitions towards the beginning of\nsentences where they can be most helpful.\nShe had tenure, she had variety of job prospects.\nHer bid to be head of the department was not\nsuccessful, however.\nUse logical connectors such as therefore, hence,\nthus and then sparingly.\nPlace transitions towards the beginning of\nsentences where they can be most helpful.\nShe had tenure, she had variety of job prospects.\nHer bid to be head of the department was not\nsuccessful, however.\n\nCan you write concisely?\nCan you write concisely?\nAccording to good quality control practices\nin manufacturing any product, it is\nimportant that every component part that is\nconstituent of the product be examined and\nchecked individually after being received\nfrom its supplier or other source but before\nthe final, finished product is assembled (45\nwords)\nAccording to good quality control practices\nin manufacturing any product, it is\nimportant that every component part that is\nconstituent of the product be examined and\nchecked individually after being received\nfrom its supplier or other source but before\nthe final, finished product is assembled (45\nwords)\n\nConcision\nConcision\nGood quality-control requires that every\ncomponent be checked individually before\nthe final product is assembled (16 words)\nGood quality-control requires that every\ncomponent be checked individually before\nthe final product is assembled (16 words)\n\nConcison\nConcison\nOver the most recent monthly period, there\nhas been a large increase in the number of\ncomplaints that customers have made about\nservice that has been slow. (27 words)\nOver the most recent monthly period, there\nhas been a large increase in the number of\ncomplaints that customers have made about\nservice that has been slow. (27 words)\n\nConcison\nConcison\nLast Month, many more customers\ncomplained about slow service (10 words)\nLast Month, many more customers\ncomplained about slow service (10 words)\n\nVoice\nVoice\nSupportive Voice - Let's meet tomorrow to see if\nwe can figure out why people in your department\nhad difficulty meeting last month's production\ntargets.\nDomineering Voice - I have scheduled an hour for\nus to meet tomorrow to discuss the failure of your\ndepartment to meet production targets last month\nSupportive Voice - Let's meet tomorrow to see if\nwe can figure out why people in your department\nhad difficulty meeting last month's production\ntargets.\nDomineering Voice - I have scheduled an hour for\nus to meet tomorrow to discuss the failure of your\ndepartment to meet production targets last month\n\nCan you simplify your sentences?\nCan you simplify your sentences?\nA new factory that produces chemicals for\nthe OPAS system, which enables large\nmanufacturers of business forms to make\ncarbonless copy paper as part of their own\nmanufacturing process, began to operate\nlast year.\nA new factory that produces chemicals for\nthe OPAS system, which enables large\nmanufacturers of business forms to make\ncarbonless copy paper as part of their own\nmanufacturing process, began to operate\nlast year.\n\nWhen should you combine\nsentences?\nWhen should you combine\nsentences?\nWater quality in Hawk River declined in March.\nThis decline occurred because of the heavy\nrainfall that month. All the extra water overloaded\nTomlin County's water treatment plant.\nWater quality in Hawk River declined in March\nbecause heavy rainfalls overloaded Tomlin\nCounty's water treatment\nWater quality in Hawk River declined in March.\nThis decline occurred because of the heavy\nrainfall that month. All the extra water overloaded\nTomlin County's water treatment plant.\nWater quality in Hawk River declined in March\nbecause heavy rainfalls overloaded Tomlin\nCounty's water treatment\n\nEmphasize a point by putting it at\nthe end of the sentence\nEmphasize a point by putting it at\nthe end of the sentence\nAlthough our productivity was down, our\nprofits went up.\nAlthough our profits were up, our\nproductivity was down.\nAlthough our productivity was down, our\nprofits went up.\nAlthough our profits were up, our\nproductivity was down."
    },
    {
      "category": "Resource",
      "title": "writing_eff_esay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/a7f55e5ed2e5e23586d34587c09e455a_writing_eff_esay.pdf",
      "content": "Massachusetts Institute of Technology\n\nCherie Miot Abbanat, Lecturer\nDepartment of Urban Studies and Planning\n\nGuidelines for Writing Effective Essays\n\nCan you read and digest a series of articles assigned to you? Next, can you extract the essence out of each article\nand summarize it in no more than a few sentences? Okay, you can read, you can summarize, but can you pull\ntogether the threads that connect each of the articles together and create a new idea? Can you offer thoughts and\ninsights on the ideas in these articles? We want to know.\n\nSo, you have been given an essay to write. We design essay questions in order to challenge you in many ways that\nwe believe you will be challenged while you are at MIT and beyond MIT. But, where do you begin and how do you\nknow when you're done?\n\nTask 1: Review and review again the essay question.\nSometimes you develop the questions yourself - thesis questions. Most of the time, however, you will be handed\nquestions that were written by your professors and you will need to respond. Examine the question. Think about\nthe question. Brainstorm answers and otherwise get into that creative space inside you.\n\nSome essay questions are really broad. Broad questions can be helpful, but sometimes they can make you want to\ntear your hair out because you are not sure what the professor expects. Try to think of these types of questions as an\nopportunity because they may signal that the door is wide open for you to pick and choose what you really want to\nsay. Usually what broad questions really mean is that the professor is not exactly clear about what s/he wants in\nterms of an answer. Or, it means that the case can be approached from a number of different angles. Regardless,\nwhen a professor offers you a broad question, rejoice! You have lots of room to create.\n\nSome essay questions are very specific. Here the professor knows what s/he wants and s/he wants to know that you\nknow what s/he wants. Here you need to focus your attention on the articles. You need to take good notes, work to\ndistill the information. Most of all, you need to figure out what is asked and how best to respond so that you all\nquestions are addressed. Once you figure out what type of question you have, I recommend that you focus on a few\nkey elements:\n\nTask 2: After you have reviewed the question ask yourself the following:\n-\nDo you understand the question that is being asked?\n-\nDo you know what topic you need to address?\n-\nDid you already summarize each of the articles in your own words? If not, go do this.\n-\nCan you tell from your notes, which ideas are yours and which ideas are the authors' ideas? If not, fix your\nnotes - no plagiarism please!\n-\nDid you craft an outline for your essay question?\n\nTask 3: Write a first, messy draft:\n-\nDon't try to control your first responses to the question too much, just write what comes to mind while you\nhave the question in your mind.\n-\nWhat questions do you have for the authors of the articles you are responding to?\n-\nWhat inconsistencies do you find in the articles? What problems do you see? What holes can you\nidentify?\n\nMassachusetts Institute of Technology\n\nCherie Miot Abbanat, Lecturer\nDepartment of Urban Studies and Planning\n\n-\nIs your thesis clear? Do you need to explain what you are trying to show?\n-\nWhat is your main message - what you really want to say about the topic you have been asked? Draw a\nbig circle around this idea.\n-\nWhat claims or assertions can you make that might support your main message? If you don't have any,\nyou need to check to see if your main message is robust enough.\n-\nWhat evidence and examples do you find that support your claims? If you don't have any, time to do more\nwriting and reviewing.\n\nTask 4: Focus on your introduction. Once you have your first draft written, it is time to edit -- to scrutinize\nwhat the creator in you thinks is important.\n-\nDoes your introduction provide some context or background for the issue and then relate your thesis or\nmain message? If not, why not?\n-\nDoes the last sentence in your introduction draw the reader into the rest of the paper?\n-\nDoes your introduction relate to the essay question? If you have a specific essay question, your intro must\nrelate directly to the question. If you have a broad essay question, your response must touch on the issues\ndiscussed in the question, but usually cannot attend to all the details of the question.\n\nTask 5: Focus on your supporting paragraphs.\n-\nDo you develop your main idea in your subsequent paragraphs using assertions and supporting evidence to\nmake your point? If not, start finding evidence and examples to support your points.\n-\nDo you include lots of \"shoulds\" in your writing? If so, this type of writing can point to assertions without\nevidence and examples to back up claims. Sometimes we think if we use strong language --\"The BRA\nshould understand that low income housing is good for all of Boston\" - we don't need to support our\nstatements. Try to rewrite most of the \"shoulds\" out of the response. Try replacing \"shoulds\" with\n\"coulds\" to see what happens. Usually you have to offer more evidence and examples to shore up your\nideas.\n\nTask 6: Focus on your conclusion.\n-\nFirst, do you have a conclusion?\n-\nDoes your conclusion restate your first paragraph? If so, delete your conclusion and start again, this is\nfreshman college writing.\n-\nDoes your conclusion synthesize the many ideas discussed in the essay in order to offer your reader more\ninsight on the problem? If not, why not? If not, what does your conclusion need in order to further the\nmain idea that you are discussing? I know this is hard, but try to push yourself!\n-\nDid you pull the strings of the analysis together for the reader?\n-\nDid you show how the chunks of analysis work together?\n\nIf you have done all of these things, you are probably done writing and you need to turn to editing.\n\nTask 7: Take time to edit.\n-\nPredict three questions your professor will want to ask you about your ideas. Have these questions been\nanswered?\n-\nGet a friend to read your essay.\n-\nProofread.\n\nMassachusetts Institute of Technology\n\nCherie Miot Abbanat, Lecturer\nDepartment of Urban Studies and Planning\n\n-\nRead your essay out loud.\n\nEssay writing can be challenging, there is no doubt. But, try to think of it as a way you can teach yourself about the\nissues and ideas that are important to you. Who knows, maybe one of these ideas will turn into your thesis!"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/e2749f8b8aadea3fc4df72704de9e1e9_lect_3.pdf",
      "content": "Preparing\nPreparing\nBriefings/Memos\nBriefings/Memos\nCherie\nCherie Miot\nMiot Abbanat\nAbbanat\nDepartment of Urban Studies and\nDepartment of Urban Studies and\nPlanning\nPlanning\n\nDissecting Assignments\nDissecting Assignments\nWho are you?\nWho are you? You have been\nYou have been\nappointed by Thomas\nMenino,\nthe Mayor of Boston, to the Task\n\nForce on the Future of Public\n\nHousing\n\nDissecting Assignments\nDissecting Assignments\nWho is your audience?\nWho is your audience?\nzz Mayor\nMayor\nzz Deputy Chief of Staff for Policy\nDeputy Chief of Staff for Policy\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\n\nWhat do you write?\nWhat do you write?\n\ninformational memo\ninformational memo\n\n1,500 words\n1,500 words\n\ndiscusses any\ndiscusses any two\ntwo of these three\nof these three\nongoing concerns\n\na few sentences about the third\na few sentences about the third\nissue if it links to other issues\n\ndon\ndon''t try to address all three issues\nt try to address all three issues\nin such a compact document.\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\n\nHere\nHere''s one strategy\ns one strategy -- Dissect the\nDissect the\nAssignment:\n\n-\nP ick your first question\n-\nz\nz work on one at a time\nwork on one at a time -- you can make\nyou can make\nconnections between them later.\n\nTurn first sub\nTurn first sub--question into a\nquestion into a\nbackground sentence that begins\n\n\"As you pointed out...\n..\"\n\nSpend no more than a paragraph (5\nSpend no more than a paragraph (5\nsentences) on background.\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\n\nFocus on the last sub\nFocus on the last sub--question it is:\nquestion it is:\nzz focuse\nfocused\nd\n- overarching\nz\nz could turn into the larger point\ncould turn into the larger point\n\nSift through the sub\nSift through the sub--questions to decide\nquestions to decide\nwhich of these sub\n-questions is:\nz\nz A key point\nA key point\nz\nz Most important\nMost important\nz\nz Tangential\nTangential\n\nFind evidence and examples to support the\nFind evidence and examples to support the\npoints that you will make.\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\nCreate an overarching\nCreate an overarching\nstatement\n\nKnit the two questions together\nKnit the two questions together\n-- broad is okay\nbroad is okay\nMake the background work for\nMake the background work for\nboth questions.\n\nNarrow your statement\nNarrow your statement\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\nCreate a conclusion for the\nCreate a conclusion for the\nentire paper.\n\nDon\nDon''t forget about next steps at\nt forget about next steps at\nthe end of your memo, if\n\nappropriate.\n\nDissecting Memo\n\nAssignments\n\n2. Redevelopment: Physic\n2. Redevelopment: Physical Design vs. Social\nal Design vs. Social\nPolicy\n\nEach of the three redevelopment efforts discussed\nEach of the three redevelopment efforts discussed\nin class entailed spending tens of millions of dollars\n\non efforts to redesign the physical environment.\n\nWhat aspects of this design intervention were most\n\nimportant? Were there important missed design\n\nopportunities? Should more of the money have\n\nbeen spent on some other non\n-design aspects of\nthe redevelopment, such as social services? Are\n\nphysical designs and social policies\nalternative\nways to take action to improve public housing, or\n\nare they connected in some important ways? If you\n\nwere in charge of developing a proposal for a public\n\nhousing redevelopment now, what priorities would\n\nyou set for allocating funds to these different forms\n\nof intervention?\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\nBackground:\nBackground: Each of the three\nEach of the three\nredevelopment efforts in Boston\n\n(Franklin Field, Commonwealth\n\nand West Broadway) spent tens\n\nof millions of dollars on\n\nredesigning the physical\n\nenvironment. Explain\n.....\n\nDissecting Memo\n\nAssignments\n\nLarge Overarching Questions:\n\nAre physical designs and social policies\nalternative\nways to take action to improve public housing, or\n\nare they connected in some important ways?\n\nPhys\nPhysical des\nical designs and social policies are/are not\nigns and social policies are/are not\nalternative\nways to take action to improve public\nhousing and are/are not connected.\n\nz\nz What aspects of this design intervention were most\nWhat aspects of this design intervention were most\nimportant?\n\nz\nz Were there important missed design opportunities?\nWere there important missed design opportunities?\nz\nz Should more of the money have been spent on some\nShould more of the money have been spent on some\nother non\n-design aspects of the redevelopment, such\nas social services?\n\nDissecting Memo\nDissecting Memo\nAssignments\nAssignments\nLarge Overarching Questions:\nIf you were in charge of developing a\n\nproposal for a public housing\n\nredevelopment now, what priorities would\n\nyou set for allocating funds to these\n\ndifferent forms of intervention?\n\nThere are at least X priorities that need to\nThere are at least X priorities that need to\nbe set for allocating funds.\n\nz\nz Were there important missed design\nWere there important missed design\nopportunities?\nz\nz Should more of the money have been spent on\nShould more of the money have been spent on\nsome other non\n-design aspects of the\nredevelopment, such as social services\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\n\nWhat Role is the Group Playing?\nWhat Role is the Group Playing?\nThe Staff the Task Force on the\nFuture of Public Housing.\n\nEach group includes:\nEach group includes:\nz\nz Boston Housing Authority,\nBoston Housing Authority,\nz\nz Boston Redevelopment Authority\nBoston Redevelopment Authority\nz\nz Department of Neighborhood\nDepartment of Neighborhood\nDevelopment\nz\nz Social service staff from other agencies.\nSocial service staff from other agencies.\n\nDissecting Briefing\n\nAssignments\n\nWho is the Audience?\nWho is the Audience?\n\nTwo local philanthropists ,\nTwo local philanthropists ,\n\nEditor of\nEditor of The Boston Globe\nThe Boston Globe newspaper,\nnewspaper,\n\ntwo respected real estate developers,\ntwo respected real estate developers,\n\na university professor\na university professor\n\nthe retired head of a local civil rights\nthe retired head of a local civil rights\norganization\n\nheads of three nonprofit community\nheads of three nonprofit community--based\nbased\ndevelopment organizations\n\nHead, Boston Housing Authority and\nHead, Boston Housing Authority and\n\nMayor\nMayor\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\nSome expectations:\n\nInterrupts\nInterrupts\n\nChallenges to your claims\nChallenges to your claims\n\nSome might also argue (a bit) with\nSome might also argue (a bit) with\neach other.\n\nIn addition, you should prepare a\nIn addition, you should prepare a\nbriefing summary\n--a report in\nminiature\n--of no mor\ne t\nhan 500\nwords\n, to summarize your analysis\nand recommendations.\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\nGet the Basics Down:\nWhat software is group using?\nWhat software is group using?\nPower Point? Web based?\n\nWho is the final editor in group?\nWho is the final editor in group?\n\nWho is the moderator in group?\nWho is the moderator in group?\n\nWhat format will use?\nWhat format will use? Linear or\nLinear or\nHub/spoke\n\nWho is writing the 500 word briefing\nWho is writing the 500 word briefing\ndocument?\n\nDissecting Briefing\n\nAssignments\n\nFind out who is in your group:\n\nWho has public housing experience?\nWho has public housing experience? What kind?\nWhat kind?\n\nWho is\nWho is an architect/des\nan architect/designer?\nigner?\n\nWho is\nWho is a techie?\na techie? This per\nThis person should check to make\nson should check to make\nsure presentation works in Gateway classroom\n1⁄2\nhour before presentations\n\nWho knows how to pull up/use maps?\nWho knows how to pull up/use maps?\n\nWho knows public policy?\nWho knows public policy? What kind?\nWhat kind?\n\nWho has worked for a Mayor?\nWho has worked for a Mayor?\n\nWho has time to visit the\nWho has time to visit the site(s\nsite(s) with a digital\n) with a digital\ncamera\n- (this may not be necessary but some\ngroups did this last year)?\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\nDivide up the Assignment:\n\nEveryone needs a speaking part\nEveryone needs a speaking part\nEveryone needs a\nEveryone needs a task(s\ntask(s))\nDivide up questions\nDivide up questions -- what goes\nwhat goes\nwhere?\n\nVolunteer for what you are good\nVolunteer for what you are good\nat.\n\nDissect Briefing Assignment\n\nSet the Schedule for Individual and Group\nSet the Schedule for Individual and Group\nPieces:\n\n1.\n1. Saturday am:\nSaturday am: Finis\nFinishh Drafting your indiv\nDrafting your indiviidual\ndual\nsection(s\n)\n\n2.\n2. Sunday am:\nSunday am: Draft your slides on Sunday am\nDraft your slides on Sunday am\n\n3.\n3. Sunday pm:\nSunday pm: Meet with group and merge slides\nMeet with group and merge slides\n(assume something will go wrong)\n\n4.\n4. Monday:\nMonday: Practice with Group (assume someone\nPractice with Group (assume someone\nwill not be ready)\n\n5.\n5. Tuesday: Practice with Group (assume someone\nTuesday: Practice with Group (assume someone\nwill be late)\n\n6.\n6. Wednesday:\nWednesday: Arrive\nArrive 1⁄2\n1⁄2 hour early to test your\nhour early to test your\npresentation in the Gateway Classroom\n\n(Remember: Larry Vale\n's presentation didn't fully\nwork last week)\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\n\nDissect the Assignment\nDissect the Assignment\n\nGiven uncertainties about the future of\nGiven uncertainties about the future of\nfunding for public housing redevelopment\n\nas well as ongoing misperceptions about\n\nthe current state of public housing in the\n\ncity, the Mayor wants to know:\n\nWhat housing authority planners should\nWhat housing authority planners should\ndo next?\n\nWhat issues matter most when trying to\nWhat issues matter most when trying to\nassess\n\"success\"\n\nAnalyze several past efforts\nAnalyze several past efforts\n\nDissecting Briefing\nDissecting Briefing\nAssignments\nAssignments\n\nThe Mayor has asked each group to\nThe Mayor has asked each group to\nprepare a 20\n-minute briefing that\nanalyzes\nthe lessons of a si\nngle\nredevelopment case\n(see below) for:\n\n(a) The role of physical design in\n(a) The role of physical design in\nredevelopment success; and\n\n(b) The optimal role for planners in public\n(b) The optimal role for planners in public\nhousing redevelopment.\n\nWhat is the best mix of physical and non\nWhat is the best mix of physical and non-\nphysical planning interventions to ensure\n\neffective redevelopment?\n\nWhat kinds of planning policies can best\nWhat kinds of planning policies can best\npromote this mix?"
    },
    {
      "category": "Lecture Notes",
      "title": "lect_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-225-argumentation-and-communication-fall-2006/e280fcda606c0badd67bf52b240a55a1_lect_6.pdf",
      "content": "Arguments and\nArguments and\nDebates\nDebates\n11.225\n11.225\nSession 6\nSession 6\n\nWhat is an Argument?\nWhat is an Argument?\nIs it about:\nIs it about:\nWinning?\nWinning?\n- Asserting your position?\n\n- Convincing someone else?\n\n- Listening?\n\n- Speaking?\n\nFinding the truth of the matter?\nFinding the truth of the matter?\n\nThe Three Bases of an Arguments\nThe Three Bases of an Arguments\nBased on credibility\nBased on credibility\nBased on logic\nBased on logic\n- Based on emotional draw\n\nHow do you Debate?\n\n-\n-\n-\n-\n-\nDeliver your point of view and sit down?\nDeliver your point of view and sit down?\nDeliver your point of view and stand firm?\nDeliver your point of view and stand firm?\nDeliver your point of view and listen?\nDeliver your point of view and listen?\nDeliver your point of view, listen and\nDeliver your point of view, listen and\nunderstand?\nunderstand?\nDeliver your point of view, listen, understand\nDeliver your point of view, listen, understand\nand\nand ...\n.....nooooooooo\nnooooooooo...\n.... Change?\n. Change?\n\nArguments/Debates\nArguments/Debates\nA chance to learn\nA chance to learn\nA chance to match wits\nA chance to match wits\nA chance to have an impact on the listener\nA chance to have an impact on the listener\nA dialogue out loud\nA dialogue out loud\nStatements\nStatements\nQuestions\nQuestions\nAnswers\nAnswers\nNew Ideas\n\nDebate Obstacles\nDebate Obstacles\nFear of your opposition\nFear of your opposition\nTenacity to one view\nTenacity to one view\n- No clear, concise message\n-\n-\nLack of a willingness to consider another view\nLack of a willingness to consider another view\nDo you consider change to be failure?\nDo you consider change to be failure?\n\nStep 1 = Research, Perspectives,\nStep 1 = Research, Perspectives,\nMessage\nMessage\nKnow your Material\nKnow your Material\nKnow who your audience is\nKnow who your audience is -- what do they know?\nwhat do they know?\nKnow who you are\nKnow who you are -- what is your bottom line?\nwhat is your bottom line?\nKnow your opponent\nKnow your opponent -- what is his/her bottom line?\nwhat is his/her bottom line?\nFind your message as an individual\nFind your message as an individual\nFind your message as a group\nFind your message as a group\nMessage\nResearch\nLens\n\nStep 2 = Play with Your Message\n-\n-\n-\n-\n-\n-\n-\nAre there faults in the logic of your message?\nAre there faults in the logic of your message?\nAre there faults in the evidence supporting your\nAre there faults in the evidence supporting your\nmessage?\nmessage?\nAre there gaps in information that need to be filled?\nAre there gaps in information that need to be filled?\nAre you convinced by what you say?\nAre you convinced by what you say?\nWhat are your assumptions?\nWhat are your assumptions?\nWhat are your opponent\nWhat are your opponent''s assumptions?\ns assumptions?\nAre there other assumptions? Different starting places?\nAre there other assumptions? Different starting places?\n\nMap Your Argument\nMap Your Argument\nCORE MESSAGE\nDUSP Should Reduce\nthe MCP 1 Class Size\nto a total of 60\nIndividual Classes\nare too big\nAdvisors are hard\nto find\nNot enough funding for\nstudents\nHousing is scarce\nCaliber of students is not\nhigh\n\nDecide on Point Hierarchy\nDecide on Point Hierarchy\nDUSP Should Reduce\nthe MCP 1 Class Size\nto a total of 60\n4. Individual\nClasses are too big\n3. Advisors are\nhard to find\n1. Not enough funding\nfor students\n2. Housing is scarce\n5. Caliber of students is\nnot high enough\n\nList Counter Points\nList Counter Points\nDUSP Should Reduce\nthe MCP 1 Class Size\nto a total of 60\n4. Individual Classes\nare too big\n3. Advisors are\nhard to find\n1. Not enough funding\nfor students\n2. Housing is scarce\n5. Caliber of students is\nnot high enough\nCounter: more diversity, more\nexperience, better discussions,\nmore networking opportunities\nCounter: Forces students\nto sell themselves better, to\ntry harder to impress, to\nfocus on who they really\nwant to work with.\n\nConnect the Points\nConnect the Points\nDUSP Should Reduce\nthe MCP 1 Class Size\nto a total of 60\n4. Individual Classes\nare too big\n3. Advisors are\nhard to find\n1. Not enough funding\nfor students\n2. Housing is scarce\n5. Caliber of students is\nnot high enough\nFaculty are\nconstrained\nResearch assistant positions\nare hard to get\nPaying for school is not\nour only concern\n\nRevisit Your Core Message\nRevisit Your Core Message\nDUSP Should NOT decrease class size\nDUSP Should NOT decrease class size\nDUSP needs the extra tuition funds\nDUSP needs the extra tuition funds ---- $300,000/yr!!\n$300,000/yr!!\nDUSP needs a variety of views from around the\nDUSP needs a variety of views from around the\nworld\nworld\nLarger numbers = more power at MIT\nLarger numbers = more power at MIT\nLarger numbers = more active research\nLarger numbers = more active research\nDUSP Should\nNOT Reduce\nClass Size\n\nStep 3 = The Strategy\nStep 3 = The Strategy\nThe 12 minute presentation\nThe 12 minute presentation\nIntro\nIntro -- quick intro/deliver core message 2\nquick intro/deliver core message 2--min.\nmin.\nBody\nBody -- deliver no more than 3 supporting\ndeliver no more than 3 supporting\npoints\npoints -- 7 minutes\n7 minutes\nMost important point first\nMost important point first\nProvide at least 1 or 2 details on one or two points\nProvide at least 1 or 2 details on one or two points\nConclusion\nConclusion -- Repeat Core message\nRepeat Core message -- 2 minutes\n2 minutes\nHave no more than 7 slides\nHave no more than 7 slides\n\nThe Critique\n\n- Intro\n- 20 se conds\n-\n-\nTell the Audience you are glad to review your colleague\nTell the Audience you are glad to review your colleague''ss\nwork and that you will be brief\nwork and that you will be brief -- be respectful of differing\nbe respectful of differing\nopinions\nopinions\nHighlight no more than 1 or 2 criticisms\nHighlight no more than 1 or 2 criticisms\nBody\nBody -- 2 minutes\n2 minutes -- could use a back up slide if you are\ncould use a back up slide if you are\nfast and planning ahead\nfast and planning ahead\nDeliver only 1 or 2 important criticisms\nDeliver only 1 or 2 important criticisms\nProvide at least 1 detail, if possible\nProvide at least 1 detail, if possible\nWrap up\nWrap up -- 30 seconds\n30 seconds\nRepeat main points\nRepeat main points\nConnect back to your core message\nConnect back to your core message\n\nThe Rebuttal\nThe Rebuttal -- 3 minutes\n3 minutes\nStrategy A\nStrategy A -- if you have a\nif you have a\nstrong response\nstrong response\nAcknowledge 1 of 3 critical\nAcknowledge 1 of 3 critical\npoints (10 seconds)\npoints (10 seconds)\nSay what problem with\nSay what problem with\ncritical point (3 minutes)\ncritical point (3 minutes)\nLogical Problems\nLogical Problems\nCredibility Problems\nCredibility Problems\nEmotional Argument\nEmotional Argument\nProblems\nProblems\nBack to Core Message\nBack to Core Message\nStrategy B\nStrategy B-- if you have a\nif you have a\nweak response\nweak response\nAcknowledge one point\nAcknowledge one point\nGive an alternative view\nGive an alternative view\nBring audience back to your\nBring audience back to your\ncore message and say why it\ncore message and say why it\nis stronger.\nis stronger.\n\nPersuasion\nPersuasion\nConnect your message to you\nConnect your message to you -- who you are and\nwho you are and\nwhy what you say matters\nwhy what you say matters\nNarrative to make themes come alive\nNarrative to make themes come alive\nAddress the specific concerns of your audience\nAddress the specific concerns of your audience\nAddress counterpoints in your talk\nAddress counterpoints in your talk\nBe serious\nBe serious -- but don\nbut don''t be afraid to smile\nt be afraid to smile"
    }
  ]
}