{
  "course_name": "Astrophysics II",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nDescription\n\nThe subject covers the physics of galaxies, active galactic nuclei, clusters of galaxies, and the Universe. Topics include X-ray and Sunyaev-Zeldovich observations of clusters of galaxies, the cosmic microwave background radiation and big bang nucleosynthesis.\n\nTopics\n\nGalaxies: dynamics, potential theory, equilibria\n\nGroups and clusters of galaxies; X-ray emission and dark matter\n\nActive galactic nuclei; black hole accretion and jets\n\nPhenomenological cosmology\n\nNewtonian and Friedman-Robertson-Walker models\n\nCosmic microwave background\n\nPrimordial nucleosynthesis\n\nFormation of galaxies and large scale structure\n\nRequired Texts\n\nBinney, James, and Scott Tremaine.\nGalactic Dynamics\n. Princeton, N.J.: Princeton University Press, 1 January 1988. ISBN: 9780691084459.\n\nLongair, Malcolm S.\nGalaxy Formation\n. New York: Springer-Verlag, 1 December 1998. ISBN: 9783540637851.\n\nPrerequisite\n\n8.901 (Astrophysics I)\n\nGrading\n\nThe basis for the course grade is listed below.\n\nACTIVITIES\n\nPERCENTAGES\n\nAssignments\n\n40%\n\nMidterm\n\n20%\n\nFinal Exam\n\n40%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/591cb59963a006607bc9611881a17978_lec1.pdf",
      "content": "Chapter 1\nGalaxies: dynamics, potential theory, and\nequilibria\n1.1\nDynamics of scattering\nA natural way to begin is to ask the seemingly naive question \"what is a galaxy?\" The straightforward\nanswer is that a galaxy is a system of stars and gas, like the Milky Way (the word galaxy comes\nfrom the Greek for \"milk\"). Prior to the last century, the Milky Way was not just the only known\ngalaxy, but was thought to constitute the entire Universe. In 1926, Edwin Hubble showed that\nthe Andromeda nebula was actually a separate galaxy, spanning 3o in the sky, another blow to our\nanthropocentric view of the Universe (if one was needed). The Earth is not the center of the Solar\nSystem, the Solar System is not the center of the Milky Way, and the Milky Way is just one of\nbillions (and billions) of galaxies in the Universe.\nJust as stars are held up by internal gas pressure, galaxies also have internal energy that prevents\ngravitational collapse, held in equilibrium by the virial theorem (e.g. Hansen and Kawaler 2004),\n2T + U = 0,\n(1.1)\nwhere T is the internal kinetic energy of the particles (stars) and U is the negative gravitational\npotential energy. Like any self-gravitating system, the potential energy, up to constants of order\nunity, is given by\nGM 2\n,\n(1.2)\nU » - R\nwhere M and R are the mass and characteristic size of the system and G is Newton's gravitational\nconstant1 . The kinetic energy is given by\nT = M v 2 ,\n(1.3)\n1Although G is known to relatively poor accuracy in cgs units, in combination with the solar mass GM is known\nquite well. We can specify G in solar mass units: G = 4.30091851 × 10-3M -1(km/s)2pc. This is very useful given\nastronomers' habit of quoting masses in terms of M and distances in terms of parsecs.\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nx + b\nΔ b\nb\nμ\nm\nx\nFigure 1.1: A star of mass μ travelling with velocity v passes a second star, with mass m at a distance\nof closest approach (impact parameter) b.\nwhere v2 is the average squared velocity for a particle in the system. The gravitational potential is\nthen of order\nΛ » GM\nR » v 2 .\n(1.4)\nFor a typical galaxy we have:\nradius R » 10kpc\ndensity δ » 0.1Minf/pc3 and,\nNstars » 1011 .\nThe \"thermal\" velocity for individual stars within the galaxy is then v » 210 km/s.\nUnlike the interiors of stars, where the mean free path (mfp) of particles is much shorter than\nthe size of the star (mfp » 1μm ¿ R), the mean free path of a star within a galaxy is much larger\nthan the size of the galaxy, suggesting that the average star cannot be expected to scatter off another\nstar during an orbit or even during its lifetime. How do we quantify scattering interactions? For a\nstar with mass μ moving along a trajectory x = vt with impact parameter b (the distance of closest\napproach if there were no deflection; see Fig. 1.1) relative to another star with mass m, the change\nin the component of velocity perpendicular to the direction of travel, Ωv is given by\n→\nF Ωt\nGmb\nΩv =\n→\n=\nΩt.\n(1.5)\n→\nμ\n(x2 + b2)3/2\nAssuming a constant speed v during the interaction, this change in perpendicular velocity can be\nintegrated over time, giving\nZ ≈ F\nGm Z ≈\ndt\nGm\nΩv =\n→ dt =\n= 2\n.\n(1.6)\n→\n-≈ μ\nb2\n·\n⎡2 3/2\nbv\nvt\n-≈ 1 +\nb\nWe call a scattering \"strong\" if Ωv = v, so bstrong = 2Gm/v2 . The strong scattering cross section ε\n→\nis therefore\n⎞ 2Gm ⎢2\n4ψ\nε = ψb2\n= ψ\n» N 2 R2 ,\n(1.7)\nstrong\nv\n\nC\nsX\n1.1. DYNAMICS OF SCATTERING\nwhere we have used the virial theorem to get v2 » GmN/R. We now want to see how often a star\nmight actually experience a strong encounter with another star. For low number densities n (an\nexcellent assumption for galaxies), the probability of a strong scattering encounter during a single\norbital crossing is given by\n⎩ probability of a\n⎜\nN\n4ψ\n⎦ strong encounter A 1⁄4 nεR =\nR2 R =\n,\n(1.8)\n⎪\n4 ψR3 · N 2\n·\nN\nin one crossing\na very small number for galaxies with N » 1011! So we can safely say that strong scattering does\nnot play a very important role in the orbits of stars within the galaxy.\nWe must nonetheless consider the cumulative effects of weak scattering from long-range gravita\ntional interactions. Treating the encounters as a collection of steps in a random walk, we find\n(Ωv )total =\n(Ωv i)2\n(1.9)\n→\n→\ni\nIntegrating over all possible impact parameters, we find that over a time Ωt, the accumulated per\npendicular velocity is given by\nX\n(Ωv i)2 =\nZ ≈\n2ψvΩt bdb\nn\n⎞ 2Gm ⎢2\n= Ωt 8ψGm2n Z ≈ db.\n(1.10)\n→\n|\n{z\n}\nbv\nv\nb\ni\nvolume element\nIn order to get a finite value for the integral, we must impose physical bounds on b. The upper limit\nis the size of the galaxy. The lower limit is the impact parameter at which a collision is judged to be\nstrong. Taking bmin = Gm/v2 and bmax = R, the integral can be evaluated as\nZ bmax db\nRv2\n= ln ¤ = ln Gm » ln N » 25,\n(1.11)\nbmin\nb\nwhere we again use the virial theorem to substitute R/Gm » N/v2 .\nFor a system of stars in a galaxy (or globular cluster or any collisionless, gravitationally bound\nsystem), we can define a relaxation time for which the accumulated perpendicular velocity is com\nparable to the average velocity: (Ωv )tot » v. Combining equations (1.9, 1.10, and 1.11), we see\n→\nthat\nv\ntrelax »\n.\n(1.12)\n8ψG2nm2 ln ¤\nThe number of orbits needed for the system to \"relax\" is given by\ntrelax\nv\n1 v\nv4R2 4 ψ\nN\ntorbit\n» 8ψG2nm2 ln ¤ R » 8ψG2N m\n2 ln ¤ » 6 ln N ,\n(1.13)\nso it seems that weak scattering is also relatively insignificant for calculating orbits within galaxies.\nEvidently we must think of a galaxy not as a large collection of scatterers, but rather as a gravitational\nfield that is created by and interacts with the matter in the galaxy."
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/592be4b9c591af93c2f6949c3998866e_lec2.pdf",
      "content": "CHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\n1.2\nBuilding galaxies\nAs we saw above, gravitational scattering plays a very small role in the dynamics of stellar orbits\nwithin galaxies or globular clusters. We return to our original question, \"what is a galaxy?\" In\nlight of the previous section, it seems better to think of a galaxy as a collisionless fluid of stars, a\nsuperposition of a large number of orbits guided by a single background potential.\nHow does one put together such a galaxy? Superpose orbits! Schwarzschild's method (see Figure\n1.2) follows these simple steps:\n- choose gravitational potential\n- generate an orbit library\n- populate potential with orbits\n- check for self-consistency\ngravitational potential\nself-consistent Figure 1.2: Schwarzschild's method for\nonly if\nbuilding galaxies. One adjusts the distri\norbit library\nlight ~ mass\nbution function (DF) to match the light\ndistribution or the gravitational poten\ntial.\nlight =\nDF *footprints\norbit library\nFor example, imagine building a spherically symmetric galaxy. How would the orbits be dis\ntributed in phase space? Even though they may occupy three-dimensional space quite uniformly,\nthere is no reason to insist that the orbits should be uniformly distributed in momentum space. A\ngalaxy made only of circular orbits would appear \"hot\" in the tangential direction and \"cold\" in the\nradial direction, while a collection of radial orbits (an equally valid approach to a spherical system)\nwould look hot in the radial direction and cold in the tangential direction (see Figure 1.3).\nFigure 1.3: Two schemes for constructing a spher\nical galaxy: out of circular orbits, left, and out of\n(nearly) radial orbits, right.\n\"Hot\" and \"cold\" can be understood quantitatively by defining a symmetric velocity dispersion\ntensor:\nε2 = (vi - vi)(vj - vj ),\n(1.14)\nij\nwhere vi is the velocity in the ˆei direction averaged at some point. For a collisionless fluid, we can\ndiagonalize the velocity dispersion tensor, giving three independent temperatures at each point in\n\n1.2. BUILDING GALAXIES\n0.8\n0.6\n0.4\nFigure 1.4: The orbit of a star on a\nspherically symmetric logarithmic po-\n0.2\ntential. The position of the star is plot\nted for the first 100 time steps. By fol\nlowing the star for many orbits we accu-\n-0.2\nmulate a probability density \"footprint\"\nthat may be used to generate a galaxy\nmodel.\n-0.4\n-0.6\n-0.8\n-1\n-1\n-0.8 -0.6 -0.4 -0.2\n0.2\n0.4\n0.6\n0.8\nFigure 1.5: Left: a disk in circular or\nbit around a spherical bulge.\nRight:\na disk in polar orbit around a triaxial\nbulge. Such \"polar ring\" galaxies con\nstitute perhaps 0.1% of all galaxies.\nspace. If the random velocities are greater than (or in the same order as) the ordered velocities, the\nfluid is hot ; if the ordered velocities are much greater, the fluid is cold.\nObservations (Figure 1.7) show that many galaxies have nearly constant rotational velocities\nwith v(r) 1⁄4 vc over the observable range of radius. These flat rotation curves are a departure from\nKeplerian orbital velocities, which would scale as v(r) » r-1/2 . Flat rotation curves imply mass\nincreasing linearly with radius, and so cannot continue without bound.\nFor a spherically symmetric system, the centripetal acceleration is given by\nv\ndΛ\nr = dr\n(1.15)\nFor a constant rotation velocity v(r) = vc, the solution for the potential is\nr\nΛ = v 2 ln\n.\n(1.16)\nc\nrref\nCombining with Poisson's equation r2Λ = 4ψGδ, we find an expression for the density profile:\nv\nδ(r) =\nc\n.\n(1.17)\n4ψGr2\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nTelescope\nFocal Plane\nCollimator\nSpectrometer\nGrism\nCamera\nDetector\nspectrograph slit\ngalaxy\nFigure 1.6: A schematic representation of a spectrograph.\nLight from the telescope is brought to a focus in the focal\nplane. The slit of the spectrograph isolates the light from a\nnarrow strip of the sky, which diverges and passes through\nthe collimator. Parallel light rays from the collimator enter\nthe grism (a grating ruled on a prism) which disperses the\ndifferent wavelengths. The camera brings the light to a focus\non the detector.\n[N II]\nH α\n[N II]\nred\n[SII]\nblue\n[SII]\nFigure 1.7: Left: The slit of a spectrometer is placed along the major axis of a disk galaxy. The disk\nis highly inclined to the line of sight. Stars and gas on the left side of the slit have a line of sight\nvelocity toward us (relative to the center of the galaxy). Right: The spectrum of the galaxy. The\nlines shown are typical of gas photo-ionized by hot stars. The lines are blueshifted on the left side\nand redshifted on the right side. This gives the rotation curve of the galaxy. The rotation curve is\nflat in the outer parts of the galaxy and roughly linear in the inner parts.\n\n\"\n#\n1.2. BUILDING GALAXIES\nz /rref\nr /rref\nFigure 1.8: Equipotentials for Mestel's Disk\nAmong the obvious shortcomings of this model are the failure of the potential to go to zero at large\nradius and the prediction of infinite mass. Notwithstanding, it is still a useful potential for many\npractical applications.\nAnother weakness of this model is that it is limited to spherically symmetric galaxies and we\nknow from experience that many galaxies are shaped more like flattened disks. A corresponding\nmodel for such a galaxy is called a Mestel disk, which is azimuthally symmetric around the z-axis.\nThe potential for the Mestel disk is\nΛ(r, β) = v 2 ln r + ln 1 + |\ncos β| ,\n(1.18)\nc\nrref\nwhere β is measured from the positive z-axis. The Laplacian in spherical geometry with azimuthal\nsymmetry is given by\n1 σ\n2 σ\nσ\nσ\n2 =\nr\n+\n.\n(1.19)\nr\nr2 σr\nσr\nr2 sin β σβ sin βσβ\nApplying Poisson's equation to equation (1.18), we find that the Mestel disk has zero density every\nwhere except β = ψ/2, where the density is infinite. The more useful (and in this case finite) quantity\nis the surface density, determined by integrating the density over the (infinitesimal) thickness of the\ndisk:\nZ\nv2\nΨ(r) =\nδ(r, z)dz =\nc\n.\n(1.20)\n2ψGr\nLike the spherical model for a flat rotation curve, the disk model also suffers from an infinite total\nmass and radius, but it is still useful for many applications.\nObservations show that most galaxies have elements of both of the above models, with a roughly\nspherical bulge and a flattened disk. The relative weight of these features (the \"disk-to-bulge ratio,\"\nFigure 1.9) is a useful parameter for classifying galaxies, with disk strength correlating positively\nwith other galaxy properties such as young stellar fraction, hydrogen fraction, CO gas, dust, and the\nstrength of spiral arms. In most galaxies the spiral arms, which are located within the disk are the\nprimary location for new star formation. The disk and bulge components of most galaxies appear to\nhave had rather different histories, a subject to be raised again in the context of galaxy formation.\nSoon after the realization that many nebulae were in fact distinct galaxies, astronomers (and\nin particular Hubble) began systematically classifying galaxies in the hope that taxonomy would\nlead to further understanding. The principal component of Hubble's classification scheme is strongly\ncorrelated with disk-to-bulge ratio. But Hubble conflated the relative proportions of bulge and disk\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nD/B = 0\nD/B > 1\nD/B < 1\nD/B =\nFigure 1.9: Galaxies with varying disk to bulge ratios, seen edge on.\nFigure 1.10: Two spiral galaxies, floc\nculent to the left and grand design to\nthe right. Flocculent systems are more\nlikely to be classified Sa; grand designs\nare more frequently Sc.\nwith the prominence of spiral arms within the disk. In Hubble's scheme most galaxies were classified\nas \"E\", \"Sa\", \"Sb\" or \"Sc.\" \"E\" stood for elliptical with no sign of spiral structure. \"S\" stood for\nspiral structure, with \"Sa\" galaxies showing the least spiral structure and \"Sc\" galaxies showing the\nmost, as shown in Figure 1.10. The sequence from E to Sc is approximately one of increasing disk-to-\nbulge ratio. But there are also galaxies with prominent disks and little evidence for spiral structure.\nHubble added the S0 classification, placing it between E and Sa. Modern versions of Hubble's\nscheme have put the S0 systems parallel to the S systems, with S0/a, S0/b and S0/c systems having\nincreasingly large disk-to-bulge ratios. One might hope that disk-to-bulge ratio would completely\nreplace Hubble's system, but while easy to describe, disk-to-bulge ratio can be difficult to measure,\nparticularly for systems that are face-on. Modern \"quantitative\" classification schemes often use\ncentral concentration as a proxy for disk-to-bulge ratio and use deviation from bilateral symmetry\nas a proxy for spiral structure."
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/571eba79693121c3e48b5aefb2f8f3bc_lec3.pdf",
      "content": "CHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\n1.3\nExtragalactic empiricism\nBefore we can discuss galaxies quantitatively, we must first introduce some new terms. The specific\nintensity Iν(θ) is a measure of energy flux incident on a unit surface area per unit solid angle and\nfrequency (erg/s/cm2/sterad/Hz). Then the specific flux on a given surface element is the specific\nintensity integrated over all solid angle:\nfν =\nZ\nIνdΩ.\n(1.21)\nFor the purpose of the present discussion, the units of specific flux are ergs/s/cm2/Hz. The specific\nluminosity Lν at a given frequency ν of an object at a distance D is then\nLν = 4πD2fν.\n(1.22)\n(Continued on next page.)\n\n1.3. EXTRAGALACTIC EMPIRICISM\n\nFigure 1.11:\nThe observed velocities of nearby\ngalaxies are proportional to their distances, per-\nmitting distances to be estimated from Doppler\nshifts.\nAstronomers often use Pogson quantified magnitudes, a logarithmic system to describe the incident\nflux in a certain frequency bandpass. There are many different variants, but the one that will appeal\nmost to physicists is the \"absolute\" system with\nmAB ≡-2.5 log fν -48.60\n.\n(1.23)\nThe zero points of the various magnitude systems are arbitrary 2, but they all try, to some extent,\nto preserve Ptolemy's scheme of 2000 years ago. The surface brightness μ (in dimensionless units of\nmagnitude per square arcsecond) is then\nμ ≡-2.5 log Iν -48.60 -2.5 log(206265)2\n.\n(1.24)\nObservers will immediately recognize the last quantity in parentheses as the number of arcseconds in\na radian (and the number of astronomical units in a parsec). As a matter of convention, the visible\nand near infrared portions of the electromagnetic spectrum are split up into a number spectral bands\nthat have their origin in recipes for the glass that was used (by Harold Johnson) to construct filters.\nIn order of increasing wavelength they are called U, B, V, R, I, J, H, and K where the first five letters\nstand for \"ultraviolet\", \"blue\", \"visual\", \"red\", and \"infrared\".\nWhen giving the luminosity or\nbrightness of a source, one typically specifies a wavelength. For example, the background magnitude\nof the night sky in the B filter is roughly μB ∼22.05 Bmag/arcsec2, corresponding to a luminosity\nsurface density of 100L⊙/pc2.\nEmpirically, it is found that many galaxies obey simple \"laws\" that give the surface brightness\nas a function of radius from the galactic center. The best-known of these empirical relations are the\nFreeman disk and the deVaucouleurs spheroid:\nI(r) =\n\nI0 exp\nr\nrs\n\n:\nFreeman disk\nI0 exp\n·\n-7.67\nr\nre\n1/4\n:\ndeVaucouleurs spheroid.\n(1.25)\nFor disks, the central intensity is such that at r = 0, the surface brightness is μ0 ∼21.5 Bmag/arcsec2.\nFor spheroids, the effective radius, re, is defined so that half the light lies interior to it. At r = re\nthe surface brightness is typically μe ∼22.5 Bmag/arcsec2. These are both very close to the surface\nbrightness of the background night sky, which is made up primarily of zodiacal light and terrestrial\nairglow. This makes it relatively difficult to detect low surface brightness (LSB) galaxies, and those\ngiven to fretting (or quibbling) might worry that we were missing a large fraction of the universe\n2This particular definition gives a magnitude for the star Vega of mAB ≃0 at 5556 A\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\n\n!\n\"#\n$%\n&'\n()\n*+\n,-\n./\n:;\n<=\n>?\n@\nA\nBC\nDE\nFG\nHI\nJK\nLM\nNO\nPQ\nRS\nTU\nV\nV\nX\nX\nvelocity\nDoppler\nlog\nlog distance\nFigure 1.12: A schematic plot of redshift versus distance for\na sample of galaxies. The slope is unity, implying a linear\nrelation. Notice that a few points lie far from the mean. Real\ndata is never pretty.\nin failing to find such galaxies. Recent work by Blanton et al. using the Sloan Digital Sky Survey\nindicate that at most ∼5% of the total luminosity density of the Universe might be lurking in galaxies\ntoo faint to detect against the surface brightness of the night sky.\nIn addition to these scaling laws that describe the surface brightness of a single galaxy, there\nare also a number of relationships that describe how galaxies of different luminosities are distributed\nthroughout the Universe. Unfortunately, intrinsic luminosities cannot be determined without knowing\nthe distance to a galaxy. Distances are difficult to measure. This would be a serious problem were\nit not for the Hubble relation, which tells us (to first order) that distance is proportional to Doppler\nshift, D = v/H0 (see Figure 1.12). The Hubble constant, H0, was poorly known until recently.\nIn the absence of a definitive measure of H0, it was absorbed into many results, giving an overall\nmap of the universe with a sliding scale. An example is Schechter's Law, an empirical expression for\nthe \"luminosity function\" [# galaxies/unit volume with luminosity between L and L + dL],\nφ(L)dL = φ⋆\nμ L\nL⋆\n¶α\nexp\nμ\n-L\nL⋆\n¶\nd(L/L⋆).\n(1.26)\nSchechter's law works best for galaxies in the range 0.003 < L/L⋆< 3 where L⋆(≃1010L⊙h-2) is\ndetermined from a fit giving m⋆\nB = -19.75 + 5 log h, φ⋆= 2.0 × 10-2h3Mpc-3, and α = -1.09. In\neach of these parameters, h is the dimensionless expansion factor of the Universe as a fraction of the\ncanonical value for the Hubble constant3:\nh ≡\nH0\n100 km/s/Mpc =\nv/D\n100 km/s/Mpc.\n(1.27)\nThe luminosity function φ(L) has a form often seen in physical processes, a power law dependence\nwith an exponential cutoff, shown schematically in Figure 1.13. Although φ(L) diverges for faint\ngalaxies (L →0), the integrated luminosity is finite and actually analytic:\nZ\nφ(L)LdL = Γ(α + 2)φ⋆L⋆= (1 + α)!φ⋆L⋆.\n(1.28)\nGiven the difficulty of measuring absolute distances and magnitudes of galaxies, it is useful to\nestablish that one or another observable property of galaxies is correlated (the more strongly the\nbetter) with the intrinsic luminosity of a galaxy. The Tully-Fisher Law for spiral galaxies is one such\n3The best measurements today give h ≃0.7, or equivalently, H0 ≃(14Gyr)-1\n\n1.4. POTENTIAL THEORY\nlog #\nper unit\nvolume\nabsolute magnitude\nFigure 1.13: A schematic representation of the lu-\nminosity function for galaxies, cutting offsharply\nat the bright end and diverging slowly at the faint\nend.\nempirical relation, between the circular velocity vc and the total luminosity, L, of a galaxy, with\nvc ≃250 km/s\nμL\nL⋆\n¶1/4\n(1.29)\nand the Faber-Jackson Law gives a similar relationship for the line-of-sight velocity dispersion σlos\nfor elliptical galaxie, :\nσlos ∼220 km/s\nμL\nL⋆\n¶1/4\n.\n(1.30)\nThe fundamental plane relation for ellipticals is an extension of the Faber-Jackson relation to include\na dependence upon surface brightness. It is usually expressed in terms of deVaucouleurs' effective\nradius re rather than luminosity,\nre ∝σ1.49±0.05\ne\nI-0.75±0.01\ne\n.\n(1.31)\nHere effective radius, re, depends upon distance, but the velocity dispersion and intensity do not.\nAnother two techinques for estimating galaxy distances involve the luminosity functions for glob-\nular clusters and planetary nebulae within galaxies. Yet another technique (the surface brightness\nfluctuation method) involves measuring the graininess of the observed surface brightnesses of ellipti-\ncal galaxies due to the finite numbers of stars in each square arcsecond. The best technique requires\npatience and luck - observing a supernova within a galaxy."
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/a640fdbf6840889b97a7c3680cb2e4f1_lec4.pdf",
      "content": "1.4. POTENTIAL THEORY\n1.4\nPotential theory\nThe central result of Newton's gravitational theory is the inverse square law for the force between\ntwo point masses m1 and m2 separated by ξr = ξx1 - ξx2:\nξ\nGm1m2\nF(ξr) = -\nˆr.\n(1.32)\nr\nSince the inverse square law can be added linearly for multiple point masses, we can write the force\nper unit mass caused by a continuum mass density distribution δ(ξx) as\nξF(ξx) = G\nZ\nξx⊥ - ξx\n3 δ(ξx⊥)d3ξx⊥,\n(1.33)\nξx⊥ - ξx\n|\n|\ngiving the corresponding gravitational potential\nZ δ(ξx⊥)d3ξx⊥\nΛ(ξx) = -G\n,\n(1.34)\nξx⊥ - ξx\n|\n|\n(Continued on next page.)\n\nZ\nZ\nZ\nZ\nZ\n|\n{z\n}\n|\n{z\n}\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nF = - ξ\nfrom the force-potential relation for conservative forces, ξ\nrΛ. Integrating the Poisson equation\n(which can be derived by taking the divergence of the force equation) and applying the divergence\ntheorem, we can derive Gauss' Theorem for localized mass distributions:\nξ\nS = 4ψG\nδ(ξx)d3ξx = 4ψGMenclosed.\n(1.35)\nrΛ dξ\n·\nThe potential energy of a system (as distinct from the gravitational potential) is defined as the\nwork done against gravitational forces in the assembly of a mass distribution. Calculation of the\ntotal work proceeds by examining the change in the gravitational potential νΛ(ξx), due to a change\nin the density νδ(ξx). After integration by parts and invocation of the divergence theorem, one finds\n2d3ξx =\nx)Λ(ξx)d3ξx,\n|rΛ(ξx)\nδ(ξ\nW = -\n(1.36)\n|\n8ψG\nwhere the minus sign indicates that negative work was done in assembling the mass distribution.\nWhile these results have the advantage of being completely general, in practice the integrals can\nbe solved analytically only for a few special cases. One of the most important simplifications results\nfrom spherical symmetry and the first two of Newton's Theorems :\na) A body inside a uniform density spherical shell experiences no net gravitational force from that\nshell.\nb) The gravitational force on a body outside such a shell is the same as it would be if the shell's\nmass were concentrated at its center.\nBoth theorems can be proved through direct integration of equation (1.33) or by geometric argu\nments4 . So for spherical symmetry, the potential can be divided into two pieces, that caused by the\ninterior mass and that caused by the mass exterior to each radius r:\n⎣\n⎛\nr\nZ ≈\nΛ(r) = -4ψG\n⎝⎝⎝4\n⎧⎧⎧⎨ .\n(1.37)\nδ(r⊥)r⊥2dr⊥ +\n⊥)r⊥dr⊥\nδ(r\nr 0\nr\ninterior\nexterior\nAs we saw above in section (1.2), one result of spherical symmetry is the relation between the circular\norbital velocity vc and the potential Λ(r)\ndΛ\nvc\n2(r) = r\n.\n(1.38)\ndr\nThe escape speed is defined as the velocity for which a particle has positive total energy (kinetic plus\nnegative potential) and is thus not gravitationally bound to the system. For spherical symmetry, the\nescape speed ve is a function only of radius\nve\n2(r) = -2Λ(r),\n(1.39)\n4For proofs of these theorems as well as the more obscure\nthird theorem, see Binney and Tremaine.\n\n1.5. DENSITY-POTENTIAL PAIRS & ORBITS\nwhere the convention adopted is that Λ(∼) ! 0. The Virial Theorem [see below, sec. (1.6)] gives\nanother useful result relating the kinetic energy to the work done by gravity, averaged over an entire\norbit:\n(1.40)\nv ⇔orbit = ξr rΛ⇔orbit.\n√\n√· ξ\nNote that all three of the above equations have a \"typical\" or \"characteristic\" velocity squared on\nthe left hand side and the gravitational potential on the right. In two of them the potential is\ndifferentiated with respect to length and then multiplied by a length that brings us back to the units\nof potential - velocity squared."
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/29eeaa289e7f7472fde0837f4dd113f1_lec5.pdf",
      "content": "1.5. DENSITY-POTENTIAL PAIRS & ORBITS\n1.5\nDensity-potential pairs & orbits\nRecall that the first step in constructing a galaxy is to pick a gravitational potential. Since differen\ntiation is generally much more manageable than integration, it should be no surprise that we rely on\nPoisson's Equation to get the density distribution from the potential (Λ ! δ via differentiation rather\nthan δ ! Λ via integration). We shall loosely speak of a density-potential pair being a \"model\" for a\ngalaxy, but such models are incomplete. As we saw in Figure 1.3 there are many ways to populate a\ngiven density with different orbits. A complete description requires not just a physical density δ(ξx),\nbut a phase space density f(ξx, ξp) (# stars/unit volume/unit momentum).\nDifferent density-potential pairs are good for different purposes. Some have the virtue of simplicity\nor some special symmetry. Others permit one to write the phase space density in closed form, often\na function of only a limited number of variables: f = f(E), or f = f(E, L2) or f = f(E, Lz ), where\nE, L and Lz are respectively the total energy of the orbit, its angular momentum and its angular\nmomentum around the z-axis. Yet others have the property that orbits are self-similar, meaning that\nan orbit at any radius can be scaled by an arbitrary factor producing another legitimate orbit. This\nis especially useful when generating orbit libraries.\nBefore proceeding we will want to tighten up our language a bit. We shall use ellipsoid to mean\nsomething whose equi-something contours are elliptical in cross-section but which generically have\nthree unequal axes. A spheroid has also elliptical cross-sections but has two equal axes. Oblate\nspheroids have their long axes equal while prolate spheroids have their short axes equal.\nWe present the following list of density-potential pairs so that our reader is not taken by surprise\nwhen he encounters one in a talk or in the literature. He might even ask \"Please remind me what\nspecial property of the something-something potential makes it appropriate for the problem at hand\"\nand then say \"ah yes\" upon hearing the answer.\n1.5.1\nspherical potentials:\na) point mass: The Kepler potential with\nGM\nΛ(r) = -\n.\n(1.41)\nr\nThe energy of an object with mass μ is a function only of the elliptical orbit's semi-major axis\n\ns\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\na:\nGM μ\nE(a) = -\n.\n(1.42)\n2a\nb) homogeneous sphere: A constant density sphere of mass M = 3 ψδR3 gives orbits within the\nsphere with constant periods\n3ψ\nT =\n.\n(1.43)\nGδ\nFormulæ like this are common throoughout astrophysics. The typical dynamical time scale\nTdyn must vary as (Gδ)-1/2 . The potential outside a homogeneous sphere is the same as that\nof the point mass Λ(r) = -GM/r while for r < R,\nA\n2 !\nΛ(r) = -2ψGδ R2\nr\n.\n(1.44)\n- 3\nc) isochrone: This potential has the interesting property that the orbital period is a function\nonly of the energy of the orbit. Recall that the Kepler potential has a similar degeneracy - the\nenergy is a function only of the semi-major axis.\nGM\nΛ(r) = -\n,\n(1.45)\nb +\ninf\nb2 + r\ngiving a central density of\n3M\nδo =\n(1.46)\n16ψb3\nd) modified Hubble: The modified Hubble law starts with a surface brightness profile that at\none time was thought to be a close fit to those observed in for elliptical galaxies,\n2j0a\nI(r) = 1 + (R/a)2\n,\n(1.47)\nwhere j0 is a central surface brightness and a is a scale length. It is a variant of a similar one\ncalled the Hubble-Reynolds Law. To first order it matches the profile for a non-singular isother\nmal sphere. The scale length plays the role of the core radius of the non-singular isothermal\nsphere. The associated analytic potential is somewhat cumbersome, but it is still of some use\n(as we shall see below) for clusters of galaxies.\ne) power-law density: These models have simple power-law expressions for the density profile\nwith\n⎢γ\n⎞ ro\nδ(r) = δo\n.\n(1.48)\nr\nA special case of the power-law density potential is the singular isothermal sphere. It has\na constant velocity dispersion and a density profile δ\nr-2 . This gives our old friend, the\n→\nlogarithmic potential described in Sec. (1.2). It has a flat rotation curve and infinite mass and\nradius. The logarithmic potentials produce self-similar orbits. There are therefore theoretical\nas well as practical reasons for choosing them.\n\nq\nq\n1.5. DENSITY-POTENTIAL PAIRS & ORBITS\nf) Dehnen (with special cases Jaffe and Hernquist): These have \"cuspy\" density profiles for\nsmall r and a power law of the form δ →r-4 as r ! ∼. The phase-space distribution function\ncan be written in closed form as a function of energy and angular momentum, f(E, L2).\ng) King models: Starting with the isothermal sphere, King introduced an energy cutoff to the\ndistribution function that limits the size of the system. The associated truncation radius rT is\noften suggestively called a tidal radius.\nh) Navarro-Frenk-White: This is an empirical fit to the observed density profiles in gravita\ntional N-body experiments,\n4δs\nδ(r) = (r/rs)(1 + r/rs)2\n,\n(1.49)\nwhere rs is a scale length. It is a member of the larger family\n23-ρ δs\nδ(r) = (r/rs)ρ (1 + r/rs)(3 -ρ)\n,\n(1.50)\nof which the ρ = 1.5 case is called the Moore profile. Astronomy is not immune to fashion and\nthese days the NFW and Moore profiles are quite fashionable, both as models for galaxy halos\nand for clusters of galaxies.\n1.5.2\naxisymmetric potentials\na) Plummer-Kuzmin: also known as \"Toomre's model 1.\" In cylindrical coordinates (R, z, θ)\nit has\nΛ(R, z) =\n-GM\n,\n(1.51)\nR2 + (a + |z|)2\ngiving a infinitesimally thin sheet of mass density at z = 0 with mass surface density\naM\nΨ(R) =\n.\n(1.52)\n2ψ(R2 + a2)3/2\nb) Miyamoto: A combination of the Plummer-Kuzmin model and the spherical Plummer model\nthat is often used for globular clusters,\nΛ(R, z) =\n-GM\n.\n(1.53)\nR2 + (a +\ninf\nb2 + z2)2\nc) \"cored\" logarithmic: A modified logarithmic potential that avoids a singularity at R = 0\nand scales the z axis by the factor q so as to give a spheroidal potential, with q < 1 in the\noblate case and q > 1 in the prolate case:\nA\n2 !\nΛ(R, z) = 1 v 2 ln R2 + R2 + z\nq2\n.\n(1.54)\nc\n2 o\nIn the limit of vanishing core radius Rc, the equipotentials all have the same spheroidal shape\nand the equidensity contours likewise all have the same shape (though not spheroidal). The\norbits are therefore self-similar.\n\n\"\n#\n\"\nZ\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nd) Mestel disk: As in Sec. (1.2), we write this in terms of spherical coordinates,\nΛ(r, β) = v 2 ln r + ln 1 + |\ncos β| .\n(1.55)\nc\nRc\ne) self-similar logarithmic: As its name implies, the both the equipotential surfaces and the\nequidensity contours all have the same shape. It is separable in r and β, with\nΛ(r, β) = vo\n2 ln[(r · Q(β)] and\n(1.56)\n⎢2\n⎞ ro\nδ(r, β) = δo\nS(β),\n(1.57)\nr\nwhere Q(β) and S(β) are arbitrary functions for the potential and density (but of course related\nto each other via Poisson's equation). The spheroidal logarithmic potentials describe above are\nspecial cases of this.\nf) homoeoids: A homoeoid is a uniform density shell of finite thickness whose inner and outer\nsurfaces are similar spheroids. A thin homoeoid is the limiting case where the inner and\nouter shells approach each other. Thin homoeoids have the remarkable property their external\nequipotentials are spheroids that are confocal with the thin homoeoid, while their internal\npotentials are constant. This can be used to generate the potentials of arbitrary spheroidal\nmass distributions. Many of the results for spheroidal systems are most simply expressed in\nspheroidal coordinates. If one draws nested confocal spheroids, there is a corresponding family\nof confocal hyperboloids of revolution. One coordinate is constant on the ellipses (playing the\nrole of the radius in spherical coordinates) and the other is constant on the hyperboloids of\nrevolution, playing the role of the polar angle.\n1.5.3\nnon-axisymmetric potentials and the multipole expansion\nThe logarithmic potential and homoeoid above are straightforwardly generalized to non-axisymmetric\ncases. In the logarithmic case of the potential, the density and the functions Q and S are then\nfunctions of r, β and θ. The homoeoids are by extension ellipsoidal rather than spheroidal.\nFor more general three-dimensional systems, last resort is to expand the potential in spherical\nharmonics:\nX Ylm(β, θ)\nΛ(r, β, θ) = -4ψG\nZ r\nδlm(a)a l+2da + r l\nZ ≈ δlm(a) da\n#\n,\n(1.58)\n2l + 1\nrl+1\nr\nal-1\nwhere Ylm are the spherical Legendre functions and\nδlm(a) =\nY ¤\nlm(β, θ)δ(a, β, θ)d.\n(1.59)\nThe multipole expansion method is frequently used in N-body simulations because of the compu\ntationally efficient methods for solving the Laplacian with spherical harmonics."
    },
    {
      "category": "Lecture Notes",
      "title": "lec6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/95988decfd83a16520394ebf1fa01998_lec6.pdf",
      "content": "!\n1.6. ORBITS IN SPHERICAL POTENTIALS\n1.6\nOrbits in spherical potentials\nOur method for building galaxy models (often called \"Schwarzschild's method,\" after Martin Schwarzschild,\nson of the general relativist Karl) requires that we construct an orbit library in which we store the\n\"footprints\" or probability densities of a representative set of orbits. These are then superposed to\nconstruct the luminosity distribution. Since orbits play such a major role, we discuss them in some\ndetail\nWe begin by calculating orbits for the simplest systems mentioned above, those with spherically\nsymmetric potentials Λ = Λ(r). It is easy to get lost in the details of the calculation, so we start\nwith an outline of the procedure we will follow:\na) Discover that the vector angular momentum is conserved and reduce the dimensionality of the\nproblem to motion in a plane.\nb) Split the vector equation of motion into two scalar equations of motion.\nc) Change the independent variable from time to angle.\nd) Change the dependent variable from radius to inverse radius.\ne) Multiply by the derivative of inverse radius with respect to angle and integrate, giving a dif\nferential equation for the square of the derivative of inverse radius with respect to angle. The\nconstant of integration is proportional to the energy per unit mass divided by the angular\nmomentum squared.\nf) Solve the differential equation for inverse radius as a function of angle.\nThe experience of seeing this for the first time is not unlike that of an undergraduate being led from\none side of the campus to the other via basements and tunnels.\nWe begin with the central force equation (where we adopt the convention of expressing force ξF,\nenergy E, and angular momentum ξL per unit mass)\nd2\nξr = - ξ\nF = F (r)ˆ\nrΛ(r) = ξ\ner .\n(1.60)\ndt2\nCombined with the angular momentum definition\nξ\nr\nv,\n(1.61)\nL ≥ ξ × ξ\ngives the conservation of angular momentum in central-force systems:\nd ξ\nd\nA\ndξr\ndξr\ndξr\nd2ξr = 0,\nL =\nξr\n(1.62)\ndt\ndt\n× dt\n= dt × dt + ξr × dt2\nso we immediately see that the orbit will be constrained to a plane perpendicular to ξL. Within this\nplane we adopt coordinates (r, A) with\ndA\nL = r 2\n.\n(1.63)\ndt\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nThe equations of motion in this new coordinate system are\nξr = rˆer\nd ξr = rˆ\neA\ner + rA ˆ\ndt\nd2\n\nξr =\n(\n\ner + (2 rA + rA)ˆ\nr - rA2)ˆ\neA ,\n(1.64)\ndt2\nwhere we have used the relations\nd\nd\nˆ\neA and\nˆ\nAˆ\ner = A ˆ\neA = - er .\n(1.65)\ndt\ndt\nSeparating the centeral force equation (1.60) into two scalar equations of motion gives\nr - rA 2 = F (r)\n(1.66)\nand\n\n2 rA + rA = 0.\n(1.67)\nWe change the both the dependent and independent variables in the radial equation, to A and u ≥ 1/r\nrespectively. We then have\nd\nL d\n=\n(1.68)\ndt\nr2 dA\nfrom equation (1.63) and\n1 d\nd\nr =\nu\n.\n(1.69)\nr2 dA\n- dA\nThe radial equation (1.66) becomes\nd2u\nF (u)\n+ u =\n.\n(1.70)\ndA2\n- L2u\nWe assume that F (r) can be derived from a potential F (r) = -rΛ. We then use the common trick\nof turning a force equation into an energy equation by multiplying by a first derivative of position\ndu\n(in our case dA ) and integrating with respect to the timelike variable A giving\nA\n!2\ndu\n2Λ\n2E\n+ u + L2 = L2 ,\n(1.71)\ndA\nwhere E is the conserved energy per unit mass, expressed in our original coordinates as\nA\n!2\nA\n!2\n1 dr\ndA\nE =\n+ r 2\n+ Λ(r).\n(1.72)\ndt\ndt\nWe can solve for the turning points in the orbit (where r = 0) by setting E = Λeff , where Λeff (r) is\nthe effective potential\n1 L2\nΛeff =\n+ Λ(r).\n(1.73)\n2 r2\nTo procede further we must choose a potential. There are a wide variety of potentials used in the\nstudy of galaxies. Most of these require numerical integration of orbits. Here we consider some special\ncases which can be solved analytically and which serve to make interesting points about orbits.\n\nA\n!\n!\n1.6. ORBITS IN SPHERICAL POTENTIALS\na) Harmonic Potential: This is just like a spherically symmetric harmonic oscillator, giving\nclosed elliptical orbits centered on the origin,\nΛ(r) = 12 r 2 .\n(1.74)\nb) Kepler Potential: This is the gravitational potential for a single point mass,\nGM\nΛ(r) = -\n.\n(1.75)\nr\nTaking the derivative of this potential with respect to r and substituting into our equation for\nthe second derivative of inverse radius with respect to angle, equation (1.70) gives\nd2u\nGM\n+ u =\n.\n(1.76)\ndA2\nL2\nwhich is just the equation for a simple harmonic in u with\nGM\nu = C cos(A - A0) + L2\n.\n(1.77)\nRearranging terms we have\nr =\na(1 - e2)\n1 + e cos(A - A0)\n,\n(1.78)\nwhere\nL2\na ≥ GM (1 - e2)\n,\n(1.79)\nand e is the eccentricity. Note that there are three constants in the above equations, a, e and\nA0. But there are two more hidden constants, the angles giving the orientation of the orbital\nplane. Thus the orbit traces a one dimensional locus in six dimensional phase space. We shall\nloosely call such constants which reduce the dimensionality of the allowed phase space integrals\nof the motion.\nc) Post-Newtonian Kepler Potential: To lowest order the effects of general relativity can be\napproximated by adding a \"post-Newtonian\" correction to the Newtonian potential,\nGM\nk\nΛ(r) = -\n1 +\n,\n(1.80)\nr\nr\nwhere k = 2GM/c2 has units of length. Substituting this into our general equation for the\nspherically symmetric case (1.71) we find\nd2u\nA\n2GM k\nGM\ndA2 + u 1 -\n=\n.\n(1.81)\nL2\nL2\nThis again gives simple harmonic motion in the radial direction, but the radial frequency is\nno longer unity. The radial and azimuthal oscillations now have different periods, and the\norbits are no longer closed ellipses. The periastron precesses. One of the early successes of the\ntheory of general relativity was its successful explanation of the precession of the perihelion of\nMercury's orbit. For larger k the orbit looks like the \"rosette\" shown in Figure 1.4.\n\ns\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nr\na\nae\nη\nψ\nFigure 1.14: An elliptical orbit with semi-major\naxis a and eccentricity e. The eccentric anomaly φ\nis defined by circumscribing a circle.\nd) Witta-Paczy nski Potential: This has the functional form\nGM\nΛ(r) = -\n2GM\n,\n(1.82)\nr - c r\nwhich reduces to the post-Newtonian approximation in the limit of large r. It also has the\nproperty of having an innermost stable circular orbit (ISCO) that coincides with the innermost\nstable orbit of a Schwarzschild black hole. It allows approximate Newtonian calculations of the\ndynamics of accretion disks without the apparatus of general relativity.\n1.6.1\ndigression on the Kepler problem\nThe solution provided to the Kepler problem above is mathematically correct and practically useless.\nObservations give position or velocity as a function of time, not angle. Unfortunately there is no\nclosed form expression for the position as a function of time. But position and time can be given\nparametrically in terms of an angle φ called the eccentric anomaly. The angle A is called the true\nanomaly. Both angles are shown in Figure 1.14. Thus parameterized we have\nr = a(1 - e cos φ) and\n(1.83)\nP\nt =\n(φ - e sin φ),\n(1.84)\n2ψ\nwhere P is the orbital period given by Kepler's third law\na\nP = 2ψ\n.\n(1.85)\nGM\nOnce can solve for the true anomaly in term of the eccentric anomaly, and vice versa using\nA\n⎞ 1 + e ⎢1/2\nφ\ntan\n=\ntan\n.\n(1.86)\n1 - e\nWe will see this parametric solution to Kepler's potential again when studying the gravitational\nexpansion and collapse of the Universe.\n\n*\n1.7. ORBITS IN AXISYMMETRIC POTENTIALS\n1.6.2\ndigression on the virial theorem\nSo as not to interrupt our narrative thread we postponed a proof of the virial theorem, equation (1.40),\n√v ⇔orbit = √ξr ξ\n.\nrΛ⇔orbit\n·\nHaving now given further attention to orbits we proceed with our proof. Taking the dot product of\nequation (1.60) with ξr and averaging over time gives\n*\nd2ξr\n+\n1 Z T\nd2ξr\n⎛\ndξr\nT\nZ T A dξr\n!2\n⎣\nξr\n= lim\nξr\ndt = lim\n4ξr\n\n(1.87)\n· dt2\nT !≈ T\n· dt2\nT !≈ T\n· dt\n-\ndt\ndt⎨ .\nd∂r\nFor bounded orbits, the long-time average of ξr\ndt is zero, so we are left with\n·\n¿3\n⎡2A\nD\nD\nE\n- ξr d2ξr\n+\n=\nξr\n= ξr ξ\nE\n= v\n(1.88)\ntime\nc time\n· dt2 time\ntime\n· rΛ\nwhere the last equality holds only for cylindrically symmetric potentials. These results can be very\nhelpful in calculating distributions of orbits in phase space, but one must be careful not to abuse the\nVirial Theorem. One may, for example, replace the time average in equation (1.88) with a volume\naverage, but only if all stars and orbits are inclueded. The result does not apply, in particular, if the\naverage is taken over only a finite region of position space."
    },
    {
      "category": "Lecture Notes",
      "title": "lec7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/d3e3b3c1cf354bd27a2d006cd0d0bbe0_lec7.pdf",
      "content": "1.7. ORBITS IN AXISYMMETRIC POTENTIALS\n1.7\nOrbits in axisymmetric potentials\nWe have seen above that empirically, most galaxies are not spherically symmetric, but rather have\nflattened disks or ellipsoidal shapes. For many of these more general potentials, azimuthal symmetry\nand also up-down symmetry (z ! -z) are still fine approximations. Thus we can write the potential\nas Λ(R, θ, z) = Λ(R, z ). From the formula for the gradient in cylindrical coordinates, we get the\n| |\n\nthree pieces of the vector equation ξr = -ξrΛ,\nˆ\n\nθ2\neR : R -R =\nσΛ\n-σR\nd\nˆeθ :\n(R2θ ) = 0\ndt\nσΛ\nˆez : z =\n.\n(1.89)\n-σz\nJust as in the spherically symmetric case, we can define an effective potential Λeff for a given angular\nmomentum about the z-axis, Lz = R θ2 ,\nΛeff = Λ + L2\nz\n2R2\n.\n(1.90)\nThe equation of motion in the ˆeR direction is\n\nR = - σΛeff\nσR\n,\n(1.91)\n(Continued on next page.)\n\nA\nA\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nz\nFigure 1.15: Contours of constant of constant Λeff which are\nalso bunding curves for orbits with energy E. The dot indi-\nR cates the \"parent\" circular orbit, for which Λeff is a minimum.\nAs E increases the bounding curves grow larger.\nz\nz\nR\nR\nFigure 1.16: Left: A circular orbit has been perturbed in the R direction. Right: A circular orbit\nhas been perturbed in the z direction.\nthe equation of motion in the z direction is\nσΛeff\nz =\n,\n(1.92)\n- σz\nand the energy equation is\nE = 1(R 2 + z 2) + Λeff .\n(1.93)\nIf we draw curves of constant effective potential (Fig. 1.15), we see that for a given Lz the\nminimum effective energy is at a point Rg on the R axis. A particle with exactly this minimum\nenergy will be in circular orbit, with orbital frequency such that\n1 σΛ\n2 =\n.\n(1.94)\nR σR\nWe can expand the effective potential in the vicinity of this point,\nΛeff 1⁄4 Λ(Rg , 0) +\nσ2Λeff\n!\nx 2 + 1 σ2Λeff\n!\n(1.95)\nσR2\nσz2\nz\n,\n(Rg ,0)\n(Rg ,0)\nwhere we have defined a radial displacement, x ≥ R - Rg ¿ Rg .\nIf a test particle in circular orbit is given a small perturbation in the radial direction, (Fig. 1.16),\nit obeys the equation of motion\nx + η2 x = 0 where\n(1.96)\n\nA\nA\n1.7. ORBITS IN AXISYMMETRIC POTENTIALS\nz\nFigure 1.17: Bounding curves for two orbits with the same\nR values of E and Lz . Evidently there is some third conserved\nquantity that makes for distinct bounding curves.\nσ2Λeff\n!\nη2\n.\n(1.97)\n≥\nσR2\n(Rg ,0)\ndefines the epicyclic frequency, η.\nSimilarly giving a particle given a small perturbation perpendicular to the orbital plane (Fig.\n1.16) will obey the equation of motion\nz + o2 z = 0 where,\n(1.98)\nσ2Λeff\n!\no2\n(1.99)\n≥\nσz2\n(Rg ,0)\ndefines the vertical frequency o.\nAs the amplitudes of the the perturbations increase the expansion above is no longer strictly\ncorrect, but the character of the two orbits remains the same. In one case the particle oscillates\nwithin the orbital plane, while in the other the particle traces out an arc in the (R, z), meridional\nplane. Notice that the epicyclic, vertical and orbital frequencies need not be the same - in general\nthey are different. Only for the Kepler potential and for the spherical harmonic potential are they\nidentical.\nMore generally, a particle given an arbitrary perturbation must be contained within the contour\nΛeff = E in Figure 1.15. But when a circular orbit is given an arbitrary perturbation, the orbit does\nnot fill the allowed region. Rather it produces a Lissajou figure contained within a box-shaped region.\n(Fig. 1.17). Notice that two different box-shaped regions can have the same bounding energy. This\nsuggests that some additional conserved quantity, another integral of the motion (beyond energy and\nz-axis angular momentum), denies it access to the full allowed region.\nTo study the dimensionality of these orbits, one constructs a Poincare surface of section which\nreduces the six-dimensional phase space to something more manageable. The construction proceeds\nas follows:\na) From azimuthal symmetry, ignore θ and θ , giving 4-D trajectories in (R, R, z, z ).\nb) Use conservation of energy to give z = z (R, R, z, E)\nc) Take a cross-section of the orbits, plotting a point on the (R, R ) plane every time the orbit\ncrosses the plane defined by z = 0 with z > 0.\n\nA\nA\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nR\nFigure 1.18: A \"surface of section\". The allowed region is\nR bounded by the solid curve. The dashes indicate where the\nparticle intersects the z = 0 plane.\nd) The confinement of trajectories to 1-D invariant curves in the (R, R ) plane suggests they will\noccupy 2-D surfaces in (R, R, z, z ) space and 3-D regions within the full 6-D phase space and\nthus the existence of an additional integral of the motion.\nAn example of such a Poincare surface of section is shown in Figure 1.18.\nFor potentials that are nearly spherical, the third integral is something like, but not exactly,\nthe total angular momentum. For orbits that stay close to the equatorial plane, the third integral\nis something like, but not exactly, the energy in the z direction. More generally, while one may\ndemonstrate the existence of a third integral using Poincare's method, it cannot be written in closed\nform5 .\n1.7.1\nnearly circular orbits: the epicyclic approximation\nFor many axisymmetric potentials, we are interested primarily in trajectories that are nearly circular\nwith an average orbital frequency (R) at each radius R. This circular orbit acts as a guiding center\nfor the perturbed orbit which we want to study. Near this equilibrium orbit, we can expand the\neffective potential around the guiding radius Rg and the equatorial plane z = 0,\nΛeff 1⁄4 Λ(Rg , 0) +\nσ2Λeff\n!\nx 2 + 1 σ2Λeff\n!\nz 2\n.\n(1.100)\nσR2\nσz2\n(Rg ,0)\n(Rg ,0)\nWe pay attention here only to motion in the plane, which decouples from the vertical motion, and\nhenceforth take z to be identically zero. As before we take the x direction to be radial and the\ny direction to be positive in the direction of rotation. As noted in the previous section, small\nosciallations are governed by the harmonic equation\nx + η2 x = 0\n(1.101)\nand η2, defined by equation (1.97), is then\nA σ2Λ\n!\n3L2\nA\n!\nd\nη2 =\n+\nz = R\n2 + 42\n.\n(1.102)\nσR2\nR4\ndR\ng\nRg\nRg\n5An interesting counterexample is the tri-axial St ackel potential where all three integrals of motion can be written\nin closed form.\n\nA\n!\n1.7. ORBITS IN AXISYMMETRIC POTENTIALS\n\nslower guiding center\nFigure 1.19: Stars executing epicycles around guid\ning centers or circular orbits. The inner orbit has\nfaster guiding center\na higher orbital frequency.\nRecall from equation (1.15) the relation between circular velocity and potential gives the orbital\nfrequency as\n1 σΛ\nL2\nz\n2 =\n=\n.\n(1.103)\nR σR\nR4\nThe solutions to (1.101) are harmonic oscillations of the form\nx(t) = X cos(ηt + A),\n(1.104)\nwhere A is a phase determined by initial conditions.\nBut what is happening in the θ direction as the particle excutes radial oscillations? The angular\nposition in the orbit can be solved for using conservation of angular momentum and the fact that\nthat x ¿ Rg ,\nLz\n2x\nθ = Lz =\n⎡2 1⁄4 g 1 -\n.\n(1.105)\nR2\nR2 1 + x\nRg\nRg\nFrom here we integrate to get\n2g\nθ(t) = g t + θo -\nX sin(ηt + A).\n(1.106)\nηRg\nIt is useful to define y as the distance away from the guiding circular orbit in the angular direction:\n2g\ny ≥ Rg (θ - θg ) = -\nX sin(ηt + A) = Y sin(ηt + A).\n(1.107)\nη\nAs both the x and y coordinates execute harmonic oscillations with the same frequency, η, the\ntrajectories trace out ellipses, called epicycles around the guiding center6 . A few helpful relations\ncan be derived without too much effort:\nX\nη\n<\n=\n< 1,\n(1.108)\nY\n2g\nwhere the lower bound (1/2) corresponds to a Keplerian potential and the upper bound (1) corre\nsponds to a harmonic potential. Averaging over an epicycle (ηt = 0 ! 2ψ), we find\ny\n√ 2 ⇔orbit =\ng .\n(1.109)\nx\nη2\n√ 2 ⇔orbit\n6Ptolemy is unjustly ridiculed for having introduced epicycles to explain planetary motions 2000 years ago. Epicycles\ndo indeed improve upon circular motion. What Ptolemy failed to realize was that for planetary motion these epicycles\nare ellipses rather than circles.\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nR\nd\nFigure 1.20: A star at distance d from the sun observed in\nthe plane of the Milky Way at galactic longitude l. The sun\nis located a distance Rinf from the origin at the center of the\ngalaxy.\nHowever, if one takes the average over a volume of space encompassing many orbits instead of\njust averaging over a single orbit (something we postpone discussing until our treatment of Jeans'\nequations), one finds the exact opposite:\ny\nη2\n√ 2 ⇔vol =\n.\n(1.110)\nx\n√ 2 ⇔vol\ng\nA qualitative understanding for this can be seen in Figure 1.19, where the outer, slower guiding center\noverlaps with a faster inner guiding center but their epicyclic velocities are in opposite directions.\nIn the early part of this century, Jan Oort interpreted nearby stellar radial velocity and transverse\nproper motion measurements as the result of differential rotation, giving as a function of R. From\nthe point of view of an observer moving on a circular orbit at distance R from the center of the\ngalaxy, a star at a distance d and galactic longitude l (see Figure 1.20) will have a line-of-sight radial\nvelocity given by\nvlos = d(A sin 2l)\n(1.111)\nand a transverse velocity of\nvT = d(A cos 2l + B),\n(1.112)\nwhich is actually measured in terms of a proper motion (typically fractions of an arcsecond per yr),\nμ = vT /d = A cos 2l + B.\n(1.113)\nHere A and B are the Oort constants defined as\n1 d\nR\n(1.114)\nA ≥- 2 dR\nand\n1 d\nR\n+ ).\n(1.115)\nB ≥-(2 dR\nFrom our definitions of the epicyclic frequency, equation (1.97) and Oort's constants we derive\nη2 = -4B(A -B).\n(1.116)\n\n1.8. 2D NON-AXISYMMETRIC POTENTIALS\nFigure 1.21: The black ellipses are equipotentials. The blue\nhorizontal line is the radial orbit that is the parent of the box\norbits. The red ellipse is the closed orbit that is the parent\nof the tube orbits."
    },
    {
      "category": "Lecture Notes",
      "title": "lec8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/d377ac0b5697e4368055d9e2508d3ffa_lec8.pdf",
      "content": "1.8. 2D NON-AXISYMMETRIC POTENTIALS\n1.8\n2D non-axisymmetric potentials\nFor orbits in a non-axisymmetric potential, no component of the angular momentum is conserved.\nThere are nonetheless two distinct families of orbits that contribute to the shape of the galaxy. The\nfamilies are generated by stable, closed parent orbits.\nStarting at any point on the long axis of the galaxy, one can launch particles perpendicular to\nthat axis. In general these will generate rosettes that do not close upon themselves. But for exactly\none value of velocity at every position on the long axis there is an orbit which returns to that point on\nthe axis with the same velocity - it closes on itself, producing an orbit that is roughly elliptical (see\nFigure 1.21). Small perturbations to this orbit produce orbits that fill a narrow ribbon straddling\nthis orbit. Such orbits are called tube orbits. As the pertubations increase, the width of the ribbon\nincreases, but the sign of the angular momentum of the orbit does not change.\nA second family has a parent that oscillates back and forth on the long axis. Small perturbations\nto this parent produces orbits that fill a bow or box shaped region along the long axis. Bigger\nperturbations produce wider bows and boxes. But the angular momentum is relatively small and\nchanges sign frequently. These are called box orbits.\nBox orbits (sometimes called centrophilic) are characterized by an angular momentum that\nchanges sign, while tube orbits (centrophobic) always have Lz that does not change sign. Box orbits\nmust be present for a disk to be non-axisymmetric, since the tube orbits are elongated counter to the\nelongation of the potential.\nIn addition to these major families, there are also minor families. The parent closed orbits for\nthese families are characterized by the stars coming to a complete halt and reversing direction. The\nnames for these families are particularly apt: banana orbits and fish orbits look like bananas and\nfishes. Small perturbations from the parents produce similarly shaped orbits, but larger perturbations\nproduce boxes and tubes.\nA further complication can be added if the non-axisymmetric potential is allowed to tumble.\nBarred galaxies are thought to be such tumbling non-axisymmetric shapes.\n1.8.1\n3D non-axisymmetric potentials\nThe most straightforward case of a 3D non-axisymmetric potentials would be one that was ellipsoidal,\nwith three unequal axes. Such potentials have three major families of orbits. There are short-axis\ntubes whose angular momentum is roughly aligned with the short axis, and long-axis tubes whose\nangular momentum is roughly aligned with the long axis. The projection of the angular momentum\n\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nalong these axes does not change sign. There are also box orbits, for which the projection of the\nangular momentum along each of the three axes does change sign. The tube orbits are generically\ntorii. The box orbits are quite boxy.\nSt ackel potentials are remarkable in being triaxial but admitting for closed form descriptions of\nits orbits in terms of confocal ellipsoidal coordinates. Sta ekel potentials are useful for studying the\nqualitative nature of orbits but less useful for constructing realistic models.\nThere is overwhelming evidence for central mass concentrations at the centers of galaxies that are\nthought to be black holes. These produce cusps at centers of potentials that destroy box orbits. It\nmay be that galaxies with large central black holes cannot be triaxial.\nAs with 2D non-axisymmetric potentials, 3D potentials may tumble, adding another degree of\ncomplication."
    },
    {
      "category": "Lecture Notes",
      "title": "lec9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/4657bd3baac7db638f8ab7d09b9ce0d7_lec9.pdf",
      "content": "A\n!\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\n1.9\nThe collisionless Boltzmann equation and Jeans' equa\ntions\nWe have emphasized Schwarzschild's view of a galaxy as a superposition of orbits. He prescribes a\nscheme that is straightforward in principle but difficult in practice. An alternate view of galaxies is\nas a system of particles in six dimensional phase space. The galaxy is then instantaneously described\nas a distribution function f(ξx, ξv) over the phase space.\nSince Schwarschild's approach assumes a time independent potential, it guarantees that a set\nof orbits that reproduces that potential will do so for all time. By contrast a phase space density\nthat reproduces the density and potential of a galaxy at one instant will not in general reproduce\nitself at later (or earlier times). The time evolution of the phase space density is governed by a\na 6-dimensional equation of continuity that is analogous to the familiar 3-dimensional equation of\nw = (ξx, ξ\ncontinuity of fluid mechanics. Each point in phase space is described by a 6-D vector ξ\nv).\nThe equation of continuity is then\nσf\nX\nσ\n+\nσt\nγ=1 σwγ\nWe find that\n(fw γ) = 0.\n(1.117)\nX σw γ\nX\n=\nσvi\nσv i\nσxi\nσvi\nγ=1 σwγ\ni=1\n+\n= 0,\n(1.118)\nwhere the first part of the sum is zero because the velocities are necessarily not explicit functions of\nposition (hence six dimensions in phase space and not fewer). The equation of motion tells us that\nφ\nv i =\nφxi Λ(ξx) and thus v i is a function of position only. Substituting back into our 6-dimensional\n-\nequation of continuity we get the collisionless Boltzmann equation (CBE):\nσf\nσt + ξv · ξrf - ξrΛ · σf\nσξv = 0.\n(1.119)\nIt collisionless in that particles do not make instantaneous jumps in ξx or ξv, a consequence of a\npotential Λ that is smooth in space and time. The CBE can be used simultaneously for many different\n\nZ\nZ\nZ\nZ\nZ\nZ\n1.9. THE COLLISIONLESS BOLTZMANN EQUATION AND JEANS' EQUATIONS\nspecies in a galaxy, each with its own distribution function. This is important in implementing the\nfourth step of galaxy construction: calculating the distribution of light produced by all the different\ntypes of stars in the galaxy.\nThe phase space density f(ξx, ξv) is far too unwieldy to produce a useful description of a galaxy. But\nif the dependence of the phase space density upon velocity is relatively smooth and free of singularities,\none can collapse the 6-dimensional phase space density into set of functions of 3-dimensional position\nby taking moments of the velocities. The zeroth moment is just the number denisity, o(ξx), give by\no(ξx) ≥\nf(ξx, ξv)d3ξv .\n(1.120)\nFor each of three velocity components the first moment gives a mean velocity,\nv i(ξx) ≥\nvif(ξx, ξv)d3ξv .\n(1.121)\no(ξx)\nOne can likewise define higher order moments with combinations of powers of the three velocity\ncomponents. The second moments give a quantity related to the velocity dispersion tensor, ε2\nij ,\nvivj (ξx) ≥\nvivj f(ξx, ξv)d3ξv = ε2 +\nij\nvivj\n.\n(1.122)\no(ξx)\nIdeally the velocity distribution functions are not cuspy and so are reasonably well described by the\nlow order moments. There is at least some observational support for this. A density and a set of low\norder moments may therefore give a reasonably complete description of a galaxy.\nBy multiplying the CBE by powers of the velocity components, and integrating over velocity space\nwe obtain a series of differential equations for the various velocity moments. The zeroth moment of\nthe CBE yields\nZ σf\nZ\nσf\nσΛ Z σf\nd3ξv +\nvi\nd3ξv -\nd3ξv .\n(1.123)\nσt\nσxi\nσxi\nσvi\nNote that we have dropped the summation signs and adopted the implicit summation convention, in\nour case over i. We can eliminate the last term term by application of the divergence theorem,\nξ\nS -\nf ξ\nξg · rv fd3ξv =\nfξg · dξ\nrv · ξgd3ξv .\n(1.124)\nξ\nIn the present case g = rΛ(ξx) and is not a function of ξv and so may move freely inside and outside\nthe integral. We have ξ\nξg = 0 and the surface integral goes to zero if the phase space density goes\nrv ·\nto zero at infinity. Incorporating our definitions of number density and mean velocity we have\nσ\nσ\no +\n(ov i) = 0,\n(1.125)\nσt\nσxi\nwhich looks just like a standard 3-D continuity equation. This should come as no surprise since to\nderive it we just collapsed the 6-D continuity equation by integrating over all velocity.\nThe first moment of the CBE is found by multiplying by vj and integrating over velocity. Again\ntaking the spatial and temporal derivatives outside the velocity integrals, we get\nZ\nσ Z\nσ\nσΛ Z\nσf\nvj fd3ξv +\nvj vifd3ξv -\nvj\nd3ξv = 0 .\n(1.126)\nσt\nσxi\nσxi\nσvi\n\nZ\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nIntegrating by parts and expressing our results in terms of our average velocities, we have\nσ\nσ\nσΛ\n(ov j) +\n(ovivj) +\nf σvj d3ξv = 0 .\n(1.127)\nσt\nσxi\nσxi\nσvi\nφvj\nIn an orthogonal coordinate system, φvi = νij so the last term on the left hand side becomes oνij.\nApplying the product rule and our continuity equation to the first term we get\nσ\nσ\nσΛ\no σv j\nvj\n(ov j) +\n[o(ε2\nvivj)] = -ov i σxj\n,\n(1.128)\nij +\nσt - σxi\nσxi\nwhere we have made use of the relation between the second moments and the velocity dispersion.\nDifferentiating the second term on the left hand side, part of the result cancels part of the third term\nand we arrive Jeans' equations for a collisionless fluid,\no σv j\n+\nv io σv j\n=\nσΛ\nσ (oε2\n(j = 1, 2, 3).\n(1.129)\nij)\nσt\nσxi\n-o σxj\n- σxi\nkinematic\nacceleration +\n= gravity + pressure\nviscosity\nWhile in Cartesian coordinates all three Jeans equations have the same form, this is not true in other\ncoordinate systems.\nBy setting the acceleration and shear terms to zero, we can recover the equation for hydrostatic\nequilibrium. Other uses include calculating the number density and potential self-consistently, as\nsuming a given model for the velocity dispersion.\nAs an example, we will calculate the surface density of a sheet of fluid with plane parallel symmetry\nand reflection symmetry in the z-axis. The mass surface density, Ψ(z), is defined by\nZ z\nΨ(z) =\nδ(z⊥)dz⊥\n.\n(1.130)\n-z\nTaking ε2 to be constant (iosthermal), the j = 3 Jeans Equation gives\nzz\n1 σ\nσΛ\n(oε2\nzz) = -\n= -2ψGΨ(z),\n(1.131)\no σz\nσz\nwhere we have used Gauss' theorem to write the last part of the equality. The solution to (1.122) is\nof the form\nε2\nA\n!\nd\nΨ(z) = -\nzz\nln o\n.\n(1.132)\n2ψG dz\nIf we consider the population of of nearby G and K dwarf stars, their measured velocity dispersion\nis found to be ε2 = (20 km/s)2 and their scale height h, defined as\nzz\nd\nh-1 ≥ dz ln o\n(1.133)\nis found to be approximately 300 pc. This gives a mass surface density of Ψ 1⁄4 50 Minfpc-2 for the\ndisk of the Milky Way.\n\n1.10. JEANS' EQUATION IN SPHERICAL COORDINATES\nApplying the same equation to the Mestel disk model, we should be able to calculate a surface\ndensity from\nvc = 2ψGΨMestelR0,\n(1.134)\nwhere measured values of v2 and R0 for the Milky Way are (220 km/s)2 and 8 kpc, respectively.\nc\nSubstituting, we find that the ratio of the predicted Mestel disk surface density and that of the\nperpendicular plane model is\n⎢2 ⎞ 0.3 ⎢\nΨMestel\nvc\nh\n⎞ 220\n=\n=\n1⁄4 4.5.\n(1.135)\nε2\nΨperp\nzz\n· R0\n·\nThe assumptions going into the Jeans analysis are involve considerably less extrapolation than those\ngoing into the Mestel analysis. In particular we have assumed that all of the mass of the Milky Way\nlies in the disk. This might at first seem reasonable, since all but perhaps 15% of the light in the\nMilky Way lies in the disk. But if the disk were embedded in a more nearly spherical component,\nthis would affect the circular velocity but not in the perpendicular velocity dispersion. The currently\nfavored interpretation is that some large fraction of the mass interior to the Sun's orbit lies in an\nunseen, dark component. We will see that clusters of galaxies and the cosmic microwave background\n(CMB) provide additional evidence for such dark matter. A great many investigators have searched\nfor Milky Way dark matter in various forms: ionized gas, atomic gas, molecular gas, compact stars\nand planet sized condensations. All have proved unsuccessful. Observations of the CMB in particular\nlead us to believe that the dark matter is non-baryonic - that it is not composed of protons, neutrons\nand electrons."
    },
    {
      "category": "Lecture Notes",
      "title": "lec10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-902-astrophysics-ii-fall-2004/f79268ad526f5b4aef91f6343bf86bd5_lec10.pdf",
      "content": "1.10. JEANS' EQUATION IN SPHERICAL COORDINATES\n1.10\nJeans' equation in spherical coordinates\nWe start by writing down the collisionless Boltzmann equation (1.119) in spherical coordinates\n(r, β, θ):\nσf\nσf\nσf\nσf\nσf\nσf\n+ r\n+ β σf + θ\n+ vr\n+ vψ\n+ vθ\n= 0,\n(1.136)\nσt\nσr\nσβ\nσθ\nσvr\nσvψ\nσvθ\nwhere the time derivatives of the coordinates may be expressed in terms the velocity components,\nr\n= vr\n,\nβ\n= vψ\nand\nr\nθ\n=\nvθ\n.\n(1.137)\nr sin β\nLagrange's equations give the components of the acceleration,\nθ\n2 + v\nψ\nσΛ\nv\nv r =\nβ\ncot - v vψ\nθ\nr\nv\n-\n,\nσr\nr\n1 σΛ\n- r σβ\nand\nv ψ =\nr\n-vθvr - vθvψ cot β\nσΛ\nv θ =\n.\n(1.138)\nr\n- r sin β σθ\n(Continued on next page.)\n\nA\n!\n| {z }\n| {z }\n| {z }\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nOne then substitutes these into the CBE (1.136), multiplies by the powers of vr, vψ and vθ, and\nintegrates over velocity space to obtain moment equations. These give one Jeans equation for each\ncomponent of the potential gradient (force term). The radial Jeans equation is\nσv r\nσv r\nv ψ σv r\nv θ\nσv r\nσ\n1 σ\nσ\n(oε2\nrr) +\n(oε2\nrψ) +\n(oε2\nrθ)\no\n+ o\nv r\n+\n+\n+\nσt\nσr\nr σβ\nr sin β σθ\nσr\nr σβ\nr sin β σθ\no\nσΛ\nrr - (ε2\nθθ + 2\nvθ) + ε2\n+ [2ε2\nψψ + ε2\nvψ + 2\nrψ cot β] = -o\n.\n(1.139)\nr\nσr\nThis may seem daunting (especially when one considers that the polar and azimuthal equations are\nsimilarly lengthy), but in practice one typically makes a number of simplifiying assumptions before\ninvoking the radial Jeans equation:\nφ\na) Steady-state hydrodynamic equilibrium implies φt = 0 and vr = 0.\nvψ = v θ = 0, ε2 = ε2 = ε2\nb) Spherical symmetry implies\nψθ = 0, and a single tangential velocity\nrψ\nrθ\ndispersion (\"temperature\") ε2 = ε2 = ε2\nt1\nψψ\nθθ.\nWith these assumptions the radial Jeans Equation becomes considerably more manageable,\n1 σ\nrr - εt\n1)\nσΛ\nGM(r)\nrr) + 2\no σr (oε2\n(ε2\nr\n= - σr = -\nr2\n,\n(1.140)\nwhich reduces to spherical hydrostatic equilibrium when the velocity dispersion tensor is isotropic\nand ε2\nrr = ε2\nt1 = ε2 ,\no\nσoε2\nσr = - σΛ\nσr = - GMr\nr2\n.\n(1.141)\nTo measure the departure from this condition, we define the anisotropy parameter as\nε2\n≥ 1 - ε\nt\n(1.142)\nrr\nwhich can take values in the range -∼ < < 1, with the extremes corresponding, respectively, to\npurely circular and purely radial orbits. The spherical Jeans equation (1.140) can be rewritten to\ngive an expression for the mass M(r) within a radius r\n⎣\n⎛\nM(r) = - rε2\nrr\nG\n⎝⎝⎝4\nd ln o\nd ln ε2\nrr\n⎧⎧⎧⎨ .\n(1.143)\n+ 2 (r)\n+\nd ln r\nd ln r\n?\n1⁄4-3\n1⁄4-0.2\nThe difficulty with determining (r) from observations, is that one can only measure the line-of-sight\nvelocity dispersion ε2\nlos. It is not in general possible to make independent measurements of ε2 and\nrr\nε2 (see Figure 1.22).\nt1\nThe above table gives \"typical\" values of the velocity dispersion and scale length for a giant\nelliptical galaxy and a very rich cluster of galaxies. The cluster of galaxies will have of order 100 bright\ngalaxies (and a great many very much fainter galaxies). We can use these values and equation (1.143)\n\n1.10. JEANS' EQUATION IN SPHERICAL COORDINATES\nt1\nlos\nr\nσ\nσrr\nFigure 1.22: An observer measuring the Doppler broadening of lines in a galaxy spectrum sees some\ncombination of the radial and tangential velocity dispersion, averaged over the line of sight.\nsystem\nε2\nN\nR\nrr\ngalaxy\n(300 km/s)2\n10 kpc\ncluster\n(1000 km/s)2\n1000 kpc\nabove to calculate a dynamical mass for a rich cluster. This can be compared to the dynamical masses\ncomputed for the constituent galaxies. The ratio of these two is\nMcluster\n1 ε2\nclus Rclus\ngal Rgal\n1⁄4 100 · 10 100 = 10.\n(1.144)\nNgalMgal\n1⁄4 Ngal ε2\n·\nThis very large discrepancy was first noted by Zwicky in the mid-thirties. It was at first known as the\n\"missing mass\" problem, but \"missing light\" would have been more correct, as the mass was surely\npresent. For the next 40 years this problem was given scant attention, or dismissed as the result of\nsome combination of bad data and bad modeling. When the first X-ray observations of clusters were\nmade in the 1970s, very different observations and modeling led to the same conclusion. The missing\nmass problem became part of the larger \"dark matter\" problem that we first encountered within the\nMilky Way. Thirty years of effort have failed to produce a non-gravitational detection of this dark\nmatter. In the meantime evidence (to be described later) has mounted that this matter must be\nnon-baryonic.\nStarting with the hydrostatic equation (1.141) and making the additional assumption of isother\nmality, taking the velocity dispersion sigma2) to be independent of radius, allows us to move the\nvelocity dispersion outside the derivative. Taking all particles to have the same mass m the density\nis then δ = mo and the hydrostatic equation reduces to\nε2 σδ\nσΛ\nGMr\n=\n=\n.\n(1.145)\nδ σr\n- σr\n- r\n\n!\nA\n!\nCHAPTER 1. GALAXIES: DYNAMICS, POTENTIAL THEORY, AND EQUILIBRIA\nlog (r/rc)\n-4\n-3\n-2\n-1\nlog\nρ~r-2\nρ\nFigure 1.23: A schematic representation of the\ndensity profile of an isothermal sphere.\nMultiplying this by r2, and differentiating with respect to r and then multiply by 1/r2 we get\n1 d\nA r2 d\n4ψGδ\nδ =\n.\n(1.146)\nr2 dr\nδ dr\n- ε2\nSubstituting δ ≥ ωeA (with the central density given by δc = ω), we get\nA ε2\n! 1 d\nA\n2 d\n!\nr\nA = -e A .\n(1.147)\n4ψGω r2 dr\ndr\nMaking a change of variables ∂ ≥ r with κ2 =\nε2 ⎡\n, we get\nγ\n41⁄4Gσ\n1 d\nd\n∂2\nA = -e A ,\n(1.148)\n∂2 d∂\nd∂\nwhich looks much like the Lane-Emden equation for polytropic stellar models, except the right-hand-\nside is an exponential instead of a power law. Indeed it is the limiting case of the Lane-Emden\nanalysis for infinite polytropic index. The solution to this equation is called the isothermal sphere.\nWe are interested in solutions with boundary conditions A(0) = A⊥(0) = 0. Figures 1.23 and 1.24\nshow the density and circular velocity of the isothermal sphere as a function of radius. Note that for\nlarge r, they approach the asymptotic values first mentioned in Sec. (1.5):\nv\nd ln δ\nc =\n(1.149)\nε2\n- d ln r ! 2.\nNote also that wiggles persist at large radii, though with smaller and smaller amplitudes."
    }
  ]
}