{
  "course_name": "Astrophysics I",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course addresses a range of topics, including:\n\nSize and Time Scales\n\nHistorical Astronomy\n\nAstronomical Instrumentation\n\nStars\n\nSpectra\n\nClassification\n\nStellar Structure Equations and Survey of Stellar Evolution\n\nStellar Oscillations\n\nDegenerate and Collapsed Stars\n\nRadio Pulsars\n\nInteracting Binary Systems\n\nAccretion Disks\n\nX-ray Sources\n\nGravitational Lenses\n\nDark Matter\n\nInterstellar Medium\n\nHII Regions\n\nSupernova Remnants\n\nMolecular Clouds\n\nDust\n\nRadiative Transfer\n\nJeans' Mass\n\nStar Formation\n\nHigh-energy Astrophysics\n\nCompton Scattering\n\nBremsstrahlung\n\nSynchrotron Radiation\n\nCosmic Rays\n\nGalactic Stellar Distributions and Populations\n\nOort Constants\n\nOort Limit\n\nGlobular Clusters\n\nTextbooks\n\nHansen, Carl J., Steven D. Kawaler, and Virginia Trimble.\nStellar Interiors: Physical Principles, Structure and Evolution\n. New York, NY: Springer, 2004. ISBN: 9780387200897.\n\nCarroll, Bradley W., and Dale A. Ostlie.\nAn Introduction to Modern Astrophysics\n. Reading, MA: Addison-Wesley Pub., 1995. ISBN: 9780201547306.\n\nKippenhahn, Rudolf, and Alfred Weigert.\nStellar Structure and Evolution\n. New York, NY: Springer-Verlag, 1990. ISBN: 9780387502113.\n\nShapiro, Stuart L., and Saul A. Teukolsky.\nBlack Holes, White Dwarfs, and Neutron Stars\n. New York, NY: Wiley, 1983. ISBN: 9780471873167.\n\nPrerequisites\n\nThermodynamics and Statistical Mechanics (\n8.044\n), Quantum Mechanics II (\n8.05\n), or permission of the instructor.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem Sets\n\n30%\n\nMidterm Exam\n\n30%\n\nFinal Exam\n\n40%",
  "files": [
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/fc974868b05dc2f2912de41d02b7c8a6_ps1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 1\nDue: Thursday, February 16 in class\nReading: Hansen, Kawaler, & Trimble, Chapter 1. (Note: This refers to the 2nd edition of 2004, not the\n1st edition of 1994.) You may also find Carroll & Ostlie, Chapter 7 useful for useful background on stellar\nbinaries.\n1. HK&T, Problem 1.1\n2. HK&T, Problem 1.2\n3. HK&T, Problem 1.3\n4. HK&T, Problem 1.6\n5. Historical astronomy: Fundamental length scales. Accurately determining distances and sizes in\nastrophysics remains a fundamental and challenging problem to this day. However, a number of surpris-\ningly accurate measurements can be made simply with the naked eye. The ancient Greek philosopher\nAristotle (c.384-322 B.C.) was able to deduce that the Earth was spherical from observations like the\nshape of the Earth's shadow during lunar eclipses and the changing view of stars in the sky during\ntravel from north to south. A number of fundamental length scales in our solar system were also\ncorrectly deduced by the ancient Greeks.\n(a) Size of the Earth. Eratosthenes (c.276-196 B.C.) deduced the size of the spherical Earth using\nthe following facts: (1) On a particular summer day each year, the Sun penetrated to the bottom\nof a very deep well (and thus was directly overhead - this point is called the zenith) in the town\nof Syene (now Aswan); (2) On the same day in Alexandria, the Sun at mid-day was 7*south of\nthe zenith; (3) Alexandria was north of Syene by a distance of just under 5000 stadia, where 1\nstadium is about 160 meters. Eratosthenes assumed that the Sun is sufficiently distant that its\nrays can be treated as parallel. Use these facts to reproduce Eratosthenes's inference of the radius\nof the Earth. (You may use the value of π.) Compare this to the modern value of 6378 km.\n(b) Size and distance of the Moon. Aristarchus (c.310-233 B.C.) calculated these using informa-\ntion from a lunar eclipse. Use Timothy Ferris's composite photograph of a lunar eclipse (on the\nweb at http://web.mit.edu/8.901/images/moon.png) to make a similar calculation. The dia-\ngram below indicates the relevant geometry. You should make use of small angle approximations\nwhere appropriate.\n\n1/4o\n1/4o\nUmbral Shadow\nEarth\nCenter of Solar Disk\nCenter of Solar Disk\nEastern Limb\nD\nWestern Limb\nMoon\ni. Assume that only the darkest part of the Earth's shadow (the umbra) corresponds to total\neclipse. Estimate the diameter of the circle roughly corresponding to the umbral shadow on\nthe composite image, and also the diameter of one of the lunar images. Note that the center\nof the shadow does not lie on the line connecting the path of Moon's center -- why not?\nii. Compute the radius of the Moon compared to that of the Earth. Be sure to account for the\nproper geometry of the umbral shadow at the distance of the Moon; for this purpose, you may\ntake the angular diameter of both the Sun and the Moon to be 0.5*. Estimate the uncertainty\nin your answer, given the uncertainty in your estimate of the diameter of the umbral shadow.\nCompare to the modern value of 6378/1738=3.67.\niii. Taking the angular diameter of the Moon to be 0.5*, calculate the Earth-Moon distance D\nin terms of the Earth's radius.\n(c) Distance to the Sun. Aristarchus also estimated this. In the diagram below, the Moon at Q\nis at first quarter, so that the angle EQS is 90*. (Note that EQ is not perpendicular to ES.)\nThe interval from new Moon (at position N) to first quarter (at Q) is 35 min shorter than that\nfrom first quarter to full Moon (at F). Given that the lunar synodic period (the interval between\ntwo identical lunar phases) is 29.53 d, estimate the Earth-Sun distance (ES) in terms of the\nEarth-Moon distance.\n\nE\nF\nQ\nS\nβ\nβ\nN\n\n6. The Kepler problem: hyperbolic motion. In class, we derived the Kepler equation for elliptical\nmotion, ωt = ψ -e sin ψ, which relates the eccentric anomaly ψ to the time t since pericenter passage,\nthe eccentricity e ≤1, and the orbital angular frequency ω. For hyperbolic motion, the analog of the\neccentric anomaly is the angle ψ′, defined such that the trajectory can be written as r = a(e cosh ψ′-1),\nwhere e > 1 and a(e -1) is the distance of closest approach to the focus (the pericenter distance).\nFind an analog to the Kepler equation for hyperbolic motion, which specifies the time t since closest\napproach as a function of ψ′.\n\n7. Tidal evolution of the Earth-Moon system. In this problem, you will compute the evolution of\nthe Earth-Moon system by considering the tidal coupling between the Moon's orbit and the Earth's\nrotation. Angular momentum may be exchanged between these two components but must be conserved\noverall. Energy may be lost from the system via the heat generated by tidal friction. You should neglect\nany effects due to the rotation of the Moon.\n(a) Write down expressions for the total energy E and total angular momentum J of the Earth-\nMoon system. Some useful symbols will be the Earth's angular rotation frequency ω; the Moon's\n(Keplerian) orbital frequency Ω; the masses of the Earth and Moon, Me and Mm; the Earth's\nmoment of inertia I; and the mean separation of the Earth and Moon, a.\n(b) Use the equation for J to eliminate ω from the energy equation.\n(c) Show that the energy equation can be cast into the dimensionless form\nε = -1\ns + α(j -s1/2)2,\nwhere ε is the total energy in units of (Gmemm/2a0), j is the total angular momentum in units\nof (μa2\n0Ω0), s = a/a0 is the dimensionless separation, μ is the reduced mass, and the subscript\n\"0\" refers to values at the present epoch in history.\n(d) Find numerical values for α and j. Look up the masses of the Earth and Moon, and take the\nEarth's moment of inertia to be (2/5)MeR2\ne and a0 = 3.84 × 105 km.\n(e) Graph the dimensionless energy equation to find the two values of s for which ε is an extremum.\n(f) Find the same two values of s quantitatively by differentiating the energy equation and solving the\nresulting nonlinear equation numerically by the Newton-Raphson method or some other scheme.\nShow that ω = Ωat these orbital separations. Find the corresponding orbital period of the Moon\nand rotation period of the Earth.\n(g) Find the difference in energy ∆E between the current epoch and the time in the future when the\nEarth's rotation and the Moon's orbit will be synchronous.\n(h) Estimate the rate of energy dissipation due to tidal friction by assuming that, twice per day, the\ntop 1-m layer of the oceans is lifted by 1-m and then lowered. Further assume that a few percent\nof this mechanical energy is dissipated as heat.\n(i) From the energy dissipation rate and total energy ∆E that must be lost in order for the Earth\nto come into rotational equilibrium with the Moon's orbit, estimate the time (from the current\nepoch) when this equilibrium configuration will be reached.\n8. Eclipsing binaries. Assume that two stars are in circular orbits about a mutual center of mass and\nare separated by a distance a. Assume also that the binary inclination angle is i (defined as the angle\nbetween the line-of-sight and the orbital angular momentum vector, with 0*≤i ≤90*) and that the\ntwo stellar radii are R1 and R2. Find an expression for the smallest inclination angle that will just\nbarely produce an eclipse.\n9. Ensemble of binaries. The table below (from a paper by Hinkle et al. 2003) contains the measured\norbital parameters (binary period Porb and radial velocity semi-amplitude K1) for a group of \"single-\nline\" spectroscopic binaries (for which the Doppler radial velocity curve for M1 is measured, but M2\nis not directly observed). You may assume that all the orbits are circular.\n\nPorb\nK1\nStar\n(days)\n(km s-1)\nEG And\n482.6\n7.3\nZ And\n759.0\n6.7\nT CrB\n227.6\n23.9\nBF Cyg\n757.2\n6.7\nV1329 Cyg\n956.5\n7.8\nCI Cyg\n853.8\n6.7\nAG Dra\n548.7\n5.9\nV443 Her\n599.4\n2.5\nBX Mon\n4.6\nRS Oph\n455.7\n16.7\nV2116 Oph\n16.0\nAG Peg\n818.2\n5.4\nAX Per\n682.1\n7.8\nFG Ser\n633.5\n6.9\nV343 Ser\n450.5\n2.7\n(a) Recall from class the definition of the binary mass function,\nf1 ≡(M2 sin i)3\n(M1 + M2)2 = 4π2(a1 sin i)3\nGP 2\norb\n.\nDerive an expression for the mass function in terms of the observables Porb and K1. What is the\nphysical significance or interpretation of the mass function?\n(b) The systems in the table are a group of symbiotic binaries, which consist of a red giant star with\na hot, degenerate white dwarf companion. The radial velocity measurements are for the red giant\ncomponent. Typical component masses are M1 = 1.5M⊙for the red giant and M2 = 0.56M⊙for\nthe white dwarf.\nA random ensemble of binaries (i.e., one whose orbital angular momentum vectors are isotropically\ndistributed in direction) has a uniform (flat) probability distribution in cos i. Using the measured\ndistribution of mass functions for the systems in the table, determine if these systems are consistent\nwith being a randomly chosen ensemble of symbiotic binaries with typical component masses.\nTo do this, first plot the cumulative distribution function (CDF) for the set of f1 measurements.\n[Recall that for an ensemble of measurements {xi}, the function CDF(xi) is equal to the fraction\nof ensemble values for which x < xi. The CDF thus increases monotonically between zero and\nunity.] For comparison, also plot the expected CDF of mass functions for a randomly oriented\nensemble of binaries with M1 = 1.5M⊙and M2 = 0.56M⊙. What can you say about whether the\ncollection of binaries in the table is \"typical\" of symbiotic binaries in terms of masses? If there\nare any individual systems that seem to stand out as different, identify them and indicate what\nyou can deduce about them is you assume only that M1 = 1.5M⊙is correct.\n10. Magnitudes (optical intensity). Because photon counting detectors are governed by Poisson statis-\ntics, when we expect to observe N photons from an astrophysical source in a given time interval, the\nactual number detected will fluctuate by an amount ±\n√\nN.\n\n(a) How many photons need to be collected if the apparent magnitude of a star has to be measured to\nan accuracy of ±0.02? How long an exposure would be required with a 1-m (diameter) telescope\nto measure the B magnitude of an mB = 20 star to this accuracy? You may assume that the\ntelescope+detector combination have 100% detection efficiency. You may also neglect the noise\nbackground from the sky.\n(b) Now consider an attempt to measure the magnitude of a fainter star (mB = 24) with the same\naccuracy. Assume that the sky background light has brightness 22.5 mag arcsec-2 in B, and that\natmospheric effects cause the starlight to be spread over a circle with 1 arcsec diameter. How\nmany photons are required to achieve this measurement? How long would this take with a 1-m\ntelescope? What about with a 4-m telescope? Note that MIT is a consortium partner for the two\n6.5-m Magellan telescopes in Chile.."
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/9d2060b793ec3a34dacd02dd885b3044_ps2.pdf",
      "content": "R\nR\nZ\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 2\nDue: Thursday, March 2 in class\nReading: Chapter 3 in Hansen, Kawaler, & Trimble, especially §3.4. You may also find it useful to read\nChapter 8 in Carroll & Ostlie, Introduction to Modern Astrophysics.\nIf you are interested in additional\nreading about the Saha equation, you may also consult Chapter 14 of Stellar Structure and Evolution by\nR. Kippenhahn and A. Weigert (1990, Springer).\n1. Blackbody radiation. The Planck radiation spectrum is given by\n2hν3\nBν =\n(erg cm-2 s-1 Hz-1 steradian-1),\nc2\nexp(hν/kT ) - 1\nper unit frequency.\n(a) Wavelength spectrum. Show by explicit calculation that the equivalent Planck radiation spec-\ntrum per unit wavelength is given by\n2hc2\nBλ =\n(erg cm-2 s-1 cm-1 steradian-1),\nλ5 exp(hc/λkT ) - 1\nstarting from the expression for Bν.\n(b) Stefan-Boltzmann law. Derive the Stefan-Boltzmann law (F = σT 4) by integrating the Planck\nblackbody spectrum over all wavelengths or frequencies. (Note that there is an extra factor of π to\nconvert from brightness per unit solid angle to total brightness, so that F = π\nBνdν = π\nBλdλ.)\nYou may use the fact that\ninf\nπ4\nu\ndu =\n.\neu - 1\nGive an expression for the Stefan-Boltzmann constant σ in terms of fundamental physical con-\n-2 s-1 K-4 .\nstants, and check its numerical value and units, σ = 5.67 × 10-5 erg cm\n(c) Wavelength of radiation peak.\nDerive the Wien displacement law, which relates the wave-\nlength of the radiation at the peak of the Planck function Bλ to the temperature: Tλmax =\n0.29 cm K. [When you differentiate to find the maximum of Bλ, you will obtain a nonlinear\nequation of the form 5(1 - e-y) - y = 0 which you can solve numerically.]\n(d) Frequency of radiation peak. Repeat the previous part, but this time find the relation between\nthe frequency at the peak of the Planck function Bν and the temperature: νmax/T = 5.9 ×\n1010 Hz K-1 . For a given temperature T , does the photon energy corresponding to νmax agree\nwith that for λmax in the previous part? Should they agree? Explain.\n2. Saha equation and pure hydrogen. Consider a gas of pure hydrogen at fixed density and tem-\nperature. The ionization energy of hydrogen is χ0 = 13.6 eV. You may assume that all the hydrogen\natoms (whether neutral or ionized) are in their ground energy state.\n\n(a) Write down the Saha equation relating the number densities of neutral and ionized hydrogen (n0\nand n1, respectively). Make reasonable approximations to use numerical values for the partition\nfunctions.\n(b) To find the individual densities, further constraints are required.\nReasonable constraints are\ncharge neutrality (ne = n1) and conservation of nucleon number (n1 + n0 = n), where the total\nhydrogen number density n is a constant if the density ρ is fixed. Rewrite the Saha equation\nin terms of the hydrogen ionization fraction x = n1/n, eliminating n1, n0, and ne. Does this\nequation have the expected limiting behavior for T →0 and T →inf?\n(c) Use the relation n = ρNA (where NA = 6.023 × 1023 is Avogadro's number) to replace n with\nρ. Find an expression for the half-ionized (x = 0.5) path in the ρ-T plane. Plot this path on a\n-3\nlog-log plot for densities in the interesting range from 10-10-10-2 g cm\n3. Saha equation and pure helium. (Based on HK&T, Problem 3.1.) Consider a gas of pure helium at\nfixed density and temperature. The ionization energies for helium are χ0 = 24.6 eV and χ1 = 54.4 eV.\nAs above, you may assume that all the helium atoms (whether neutral, singly ionized, or doubly ionized)\nare in their ground energy state. Let ne, n0, n1, and n2 be the number densities of, respectively, free\nelectrons, neutral atoms, singly-ionized atoms, and doubly-ionized atoms. The total number density of\nneutral atoms and ions is denoted by n. Furthermore, define xe as the ratio ne/n and, likewise, let xi\nbe ni/n where i = 0, 1, 2. You should assume that the gas is electrically neutral. You should look up\nthe degeneracy factors you need for the atoms and ions; for example, see pp. 33-36 of Astrophysical\nQuantities by C. W. Allen (3rd edition, 1973, Athlone) or pp. 31-35 of Allen's Astrophysical Quantities\nedited by Arthur Cox (4th edition, 2000, Springer).\n(a) As in the hydrogenic case, construct the ratios n1/n0 and n2/n1 using the Saha equation. In\ndoing so, take care in establishing the zero points of energy for the various constituents.\n(b) Apply charge neutrality and nucleon number conservation (n = n0 +n1 +n2) and recast the above\nSaha equations so that only x1 and x2 appear as unknowns. The resulting two equations have T\nand n (or, equivalently, ρ = 4n/NA) as parameters.\n(c) Simultaneously solve the two Saha equations for x1 and x2 for temperatures in the range 4×104 ≤\n-3\nT ≤2×105 K with a fixed value of density from among the choices ρ = 10-4, 10-6, or 10-8 g cm\n.\nYou may find it more convenient to use the logarithm of your equations. Choose a dense grid in\ntemperature because you will soon plot the results. Once you have found x1 and x2, also find xe\nand x0 for the same range of temperature. Note that this is a numerical exercise and you should\nuse a computer.\n(d) Plot all your x's as a function of temperature for your chosen value of ρ. (Plot x0, x1, and x2\non the same graph.) Identify the transition temperatures (half-ionization) for the two ionization\nstages.\n4. Stellar opacity.\n(a) HK&T, Problem 3.2.\n(b) (Carroll & Ostlie, Problem 9.7) Calculate how far you could see through the Earth's atmosphere\nif it had the opacity of the solar photosphere (κ = 0.264 cm2 g-1 for a wavelength of 5000 A and\na density of 2.5 × 107 g cm-3). Use 1.2 × 10-3 g cm-3 for the density of the Earth's atmosphere."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/f46043a00498843b204615ceb8af221d_ps3.pdf",
      "content": "R\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 3\nDue: Thursday, March 9 in class\nReading: Chapter 4 in Hansen, Kawaler, & Trimble (including §4.8). You should also at least look through\nChapter 5 on convection.\n1. Radiation pressure and the Eddington limit.\n(a) Show that the condition that an optically thin cloud of material can be ejected by radiation\npressure from a nearby luminous object is that the mass to luminosity ratio (M/L) for the object\nbe less than κ/(4πGc), where κ is the mass absorption coefficient (assumed to be independent of\nfrequency). (Hint: The force per unit mass due to radiation pressure on absorbing material is\n(κν Fν /c)dν, where Fν is the radiative flux per unit frequency.)\n(b) Calculate the terminal velocity v attained by such a cloud under radiation and gravitational forces\nalon, if it starts from rest at a distance R from the object. Show that\n2GM\nκL\nv =\n- 1\n.\nR\n4πGMc\n(c) A minimum value for κ may be estimated for pure hydrogen as that due to Thomson scattering\noff free electrons, when the hydrogen is completely ionized. The Thomson cross-section is σT =\n6.65 × 10-25 cm . The mass scattering coefficient is thus > σT/mH, where mH is the mass of a\nhydrogen atom. Show that the maximum luminosity that a central mass M can have and still\nnot spontaneously eject hydrogen by radiation pressure is\n-1\nLEdd = 4πcGMmH = 1.3 × 1038(M/M) erg s\n.\nσT\nThis is called the Eddington limit.\n2. Stability against convection.\n(a) In lecture, we derived the following condition for stability against convection in a star,\nρ\ndP\ndρ\n-\n> 0,\nγP dr\ndr\nwhere P is the pressure, ρ is the density, γ is the exponent in the adiabatic equation of state\n(P = Kργ ), and r is distance from the stellar center. Using the ideal gas law P = ρkT/μmp,\nshow that this condition can also be written as\ndT\nT dP\n>\n1 -\n.\ndr\nγ\nP dr\nFurthermore, use the relevant stellar structure equations (for a radiative star) to show that this\nreduces to\n16πacT 4GM(r)\nL(r) <\n1 -\n,\nγ\n3κP\nwhere L(r) and M(r) are the luminosity and enclosed mass at radius r, κ is the opacity, and a is\nthe radiation constant.\n\n(b) Show that to avoid convection in a stellar region where the equation of state is that of an ideal\nmonatomic gas, the luminosity at a given radius must be limited by (in cgs units)\nL(r) < 1.22 × 10-18 μT 3\nM(r)\nκρ\nwhere T (r) is the temperature, μ is the mean molecular weight, κ is the Rosseland mean opacity,\nand M(r) is the mass enclosed at a radius r.\n3. Radiative transfer. HK&T, Problem 4.1.\n4. Helium ionization. HK&T, Problem 4.6. (Note that this problem refers back to HK&T Problem\n3.1, which is essentially Problem 3 from our Problem Set 2.)\n5. Stimulated emission. HK&T, Problem 4.9."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/1960751442f3446c0854a88a5f6a4c78_ps4.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 4\nDue: Tuesday, March 21 in class\nREMINDER: The mid-term exam will be in class on Thursday, March 23.\nReading: Chapter 6, Chapter 7 (§7.1-7.2) in Hansen, Kawaler, & Trimble. (I encourage you to at least\nskim through the rest of Chapter 7 as well.) We will also start covering the material in Chapter 2 (§2.1-2.5),\nalthough homework problems on this material will be on Problem Set 5. (You should still do this reading\nprior to the midterm exam, however.)\n1. Uniqueness of solutions to the stellar structure equations. HK&T, Problem 7.1.\n2. Properties of polytropic stars. Recall that in polytropic stars, pressure and density are simply\nrelated as P = Kρ(1+1/n), where K and n are constants and n is called the polytropic index. These\nstars satisfy the Lane-Emden equation,\n1 d\nξ2 dθ\n= -θn ,\nξ2 dξ\ndξ\nwhere the dimensionless variables θ and ξ are defined in terms of radial coordinate r and density ρ as\nr = aξ and ρ = ρcθn(r) and ρc is the central density. The relevant boundary conditions are θ(0) = 1\nand θ0(0) = 0 at the center (ξ = 0) and θ(ξ1) = 0 at the surface (the first zero-crossing of θ, which\noccurs at ξ = ξ1).\nShow the following:\n(a) For an ideal gas equation of state, the variable θ is a dimensionless temperature, such that\nT (r) = Tcθ(r).\n(b) The total mass of a polytropic star is M = -4πa3ρcξ2\n1(θ0)ξ1 .\n(c) The ratio of the mean density to the central density is hρi = -(3/ξ1)(θ0)ξ1 .\nρc\n(d) The central pressure is Pc = [4π(n + 1)(θ0)2 ]-1 (GM 2/R4).\nξ1\n3. Solutions for polytropic models.\n(a) Show that solutions to the Lane-Emden equation for polytropes of index n can be expanded as\nξ2\nnξ4\nθ(ξ) = 1 -\n+\n+ · · · ,\nfor ξ small (i.e. near the center of the star). To do this, first show that polynomial expansions of\nθ(ξ) contain only even terms of ξ, and then substitute such a polynomial into the Lane-Emden\nequation and find the first three coefficients.\n(b) Numerically integrate the Lane-Emden equation for polytropic indices of n = 1.0, 1.5, 2.0, 2.5,\n3.0, and 3.5. Do this by breaking up the second-order differential equation into a pair of first-\norder coupled equations in u = dθ/dξ and du/dξ, and use a numerical integration scheme (e.g.,\n\n4th-order Runge-Kutta or some other equivalent scheme) to find θ(ξ), applying the appropriate\nboundary conditions. To help start the integration near the center, use the first two terms of the\nanalytic expansion you derived above for θ(ξ).\nPlot the dimensionless temperature θ(ξ) and the dimensionless density θn(ξ) for all six values of\nn. (Put all the temperature curves on one plot and all the density curves on another.)\n4. Classical Coulomb collisions.\n(a) What temperature would be required for two protons to collide if quantum mechanical effects\nare neglected? Assume that nuclei having ten times the rms value for the Maxwell-Boltzmann\ndistribution can overcome the Coulomb barrier. Compare your answer with the estimated central\ntemperature of the Sun.\n(b) Calculate the ratio of the number of protons having velocities ten times the rms value to those\nmoving at the rms velocity for a Maxwell-Boltzmann distribution.\n(c) Assuming (incorrectly) that the Sun is pure hydrogen, estimate the number of hydrogen nuclei in\nthe Sun. Are there enough protons moving with a speed ten times the rms value to account for\nthe solar luminosity?\n5. Coulomb barrier penetration.\nConsider a head-on collision between two atomic nuclei whose\ncharges are Z1e and Z2e and whose masses are A1 and A2 (in atomic mass units). Using the WKB\napproximation, show that the quantum mechanical tunneling probability for this encounter is given by\n-2πZ1Z2e2\nT ' exp\n,\nv h\nwhere v is the relative velocity of the two nuclei and e is the proton charge. Show also that this can\nbe written in the form\nT ' exp(-31.28 Z1 Z2 A1/2 E-1/2),\nwhere A is the reduced mass of the two nuclei (in atomic mass units) and E is the center-of-mass\nkinetic energy (in keV) of the two nuclei at a large separation before the collision.\n6. Nuclear binding energies. The Q value of a nuclear reaction is the amount of energy released\n(or absorbed) in the reaction, defined such that energy released is positive. Compute the Q values\n(in MeV) for each of the following nuclear reactions. Indicate whether the reaction is exothermic or\nendothermic.\n(a) 12C + 12C → 24Mg + γ\n(b) 12C + 12C → 16O + 24He\n16O\n(c) 19F + 1H →\n+ 4He\n+\n(d) 1H + 1H → 2H + e\n+ ν\n(e) 15N + 1H → 12C + 4He\nYou may compute the atomic mass excesses for each isotope yourself, but it is easier to consult a table\n(see, e.g., Table 4-1 in Clayton, Principles of Stellar Evolution and Nucleosynthesis or Table 38 in\nLang, Astrophysical Formulae, 2nd ed. 1980).\n\n7. Nuclear burning. Consider the hypothetical nuclear reactions\nAG + AG\n→\n2AJ + γ\n2AJ + 2AJ\n→\n4AM + γ,\nwhere G, J, and M are hypothetical elements, γ is a photon, A is the atomic mass number of element\nG (an integer with units of amu), and the atomic numbers Z for each element are taken to be exactly\nhalf their atomic mass number.\nSuppose that we have two stars, one in which the first reaction is occurring and another in which the\nsecond reaction is occurring, and that the reactions proceed at the same rate at the respective stellar\ncenters. Estimate the ratio of the central temperatures of the two stars. Comment on whether your\nanswer seems reasonable or not, and why.\nNote: In the spirit of ruthless approximation, you may ignore factors which multiply exponentials,\ne.g., the densities of the reactants and the astrophysical cross-section factor S(E).\n8. Relative velocity distribution of two Maxwell-Boltzmann populations. In class we calculated\nthe weighted average hσvi for nuclear reaction rates by assuming that the relative velocity of the two\nfusing nuclei has a Maxwell-Boltzmann distribution. Here, you will prove that this was justified.\nIf the velocities of a set of identical, distinguishable particles with mass m has a Maxwell-Boltzmann\ndistribution, then the fraction of particles that have velocity in the range [v, v + dv] is given by\nm\n3/2\nmv\nf(v) dvx dvy dvz =\nexp\n-\ndvx dvy dvz.\n2πkT\n2kT\nSuppose there are two different sets of particles, with masses m1 and m2, with Maxwellian velocity\ndistributions v1 and v2, respectively. Show that the distribution of relative velocities v = v1 -v2 is also\nMaxwellian. (You will find it useful to rewrite v1 and v2 in terms of the center of mass and relative\nvelocities.)"
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/3be00d8feb60af7efdf62202d83f4627_ps5.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 5\nDue: Thursday, April 6 in class\nReading: Finish reading the first part of Chapter 2 (§2.1-2.6) on stellar evolution in Hansen, Kawaler, &\nTrimble, and also read §9.3 on the solar neutrino problem. You may also find it useful to review §3.5-3.6 on\ndegenerate equations of state. For a deeper discussion, you can consult Chapters 2-3 of Black Holes, White\nDwarfs, and Neutron Stars by Shapiro & Teukolsky.\n1. Lower and upper main sequence stars.\n(a) Estimate the hydrogen-burning lifetime of stars on the lower and upper ends of the main sequence.\nThe lower end of the main sequence occurs near 0.085 M, with log Te = 3.438 and log(L/L) =\n-3.297. Assume that the upper end of the main sequence occurs at 90 M with log Te = 4.722\nand log(L/L) = 6.045. Assume that the 0.085 M star is entirely convective so that, through\nconvective mixing, all of its hydrogen becomes available for burning rather than just the inner\n10%.\n(b) Use the information above to calculate the radius of a 0.085 M star and a 90 M star on the\nmain sequence.\n2. Evolution on the red giant branch. Once a low-mass star leaves the main sequence and ascends\nthe red giant branch, its luminosity is provided by hydrogen burning in a thin shell surrounding a\ndegenerate helium core. As hydrogen is burned in the shell, the mass of the helium core grows and\nthe star continues to ascend the giant branch. It turns out that both the luminosity and the radius\nof red giants can be written as steep functions of their helium core mass alone, nearly independent of\nany other quantity. These expressions are\n\nmc\nL ' 2 × 105L\nmc\n,\nR ' 3700R\n,\nM\nM\nwhere mc is the helium core mass, and L and R are the luminosity and radius of the (entire) red giant,\nrespectively. Note that these expressions are \"empirical\" in that they are based on the results of stellar\nevolution calculations and are not derived analytically.\nUse these relations to compute the evolution of a star (L and R as functions of time) as it ascends the\nred giant branch. Take the initial core mass value to be mc = 0.1M and the final value (at the tip of\nthe giant branch) to be mc = 0.45M. (Note that L = 0.007\n\nMc2, where M represents both the rate\nthat hydrogen is burned in the shell around the core, and the rate of growth of the degenerate helium\ncore.)\nPlot the radius, luminosity, and effective temperature of the star as a function of time on the giant\nbranch. Also, plot the track of the evolving giant on an H-R diagram (i.e., log L versus log T , with\nlog T increasing to the left).\n\n3. Core helium flash in red giants. (Adapted from Hansen, Kawaler, & Trimble, Problem 6.8).\nSuppose you have a gram of pure 4He in the center of a pre-helium-flash red giant. The density and\ntemperature of the gram are, respectively, ρ = 2×105 g cm-3 and T = 1.5×108 K. This is hot enough\nto burn helium by the triple-α reaction, which is the only reaction you will use. The energy generation\nrate for this reaction is given by\n5.1 × 108 ρ2 Y 3\n-4.4027/T9\n-1\n3α =\nT 3\ne\nerg g-1 s\n,\nwhere Y is the helium mass fraction and T9 is the temperature in units of 109 K.\nYou are now to follow the time evolution of the gram as helium burning proceeds, by computing the\ntemperature T (t) as a function of time. Start the clock runnning at t = 0 with the stated conditions.\nFor simplicity, assume that the density and the helium concentration remain constant for all time and\nthat no heat is allowed to leave the gram. Compute T (t) numerically until that time when the material\nbegins to become nondegeerate.\nFor this, use the nonrelativistic demarcation line ρ ≈ 10-8 T 3/2;\ndensities below this will be nondegenerate.\nFor a given input of heat energy ΔE, you can calculate the change in temperature of a mass Δm from\nthe specific heat cV using\n(ΔE/Δm)\nΔT =\n.\ncV\nNote that you will need to use the total specific heat cV = cV,e+cV,He. The degenerate electron specific\nheat is given by\ncV,e = 1.35 × 105\nT x (1 + x 2)1/2 erg g1 K1 ,\nρ\nwhere ρ ≈ 2 × 106x3 allows solution for the dimensionless Fermi momentum x. The ideal gas specific\nheat for the helium ions is\n3k\ncV,He =\n.\n4mp\nPlot temperature T (t) versus time in days. You will be able to recognize the flash when it happens\nbecause the temperature will suddenly skyrocket afer not too many days of burning. Indicate whether\nthe result you get is reasonable and what criteria you use to make that determination.\nAfter how many days does the helium flash occur? As a test of the quality of your numerical integration\nscheme, do your best to determine this onset time precisely; to do so, you will need to either use a\nsmall step-size in time or an adaptive step-size method (see, e.g., Chapter 16 of Numerical Recipes by\nPress et al. or another reference on numerical integration of ordinary differential equations).\n4. Neutrino oscillations. A promising solution to the solar neutrino problem (the deficit of electron\nneutrinos detected from the Sun relative to what is predicted by standard solar models; see your\nreading in §9.3 of Hansen, Kawaler, & Trimble) the phenomenon of neutrino oscillations, an expected\nconsequence of non-zero neutrino masses. We can use the elementary quantum mechanics to understand\nthe essential idea. For simplicity, we will ignore the τ-neutrino and consider only a two-state system\ncomprising the electron neutrino νe and the muon neutrino νμ.\nOur two-state system can be represented with two different sets of basis vectors. One set comprises the\nenergy eigenstates |ν1i and |ν2i; a neutrino of type j with momentum p is an energy eigenstate with\n\nq\n\neigenvalue E =\np2c2 + mjc4 . The other set comprises the weak-interaction eigenstates produced\nin weak decay processes, denoted by |νei and |νμi. Neutrinos are produced by weak interactions in\neigenstates of lepton number (νe and νμ) that are not necessarily energy eigenstates. These two basis\nsets are related by a unitary transformation,\n|νei\n=\ncos θ |ν1i + sin θ |ν2i\n|νμi\n=\n-sin θ |ν1i + cos θ |ν2i,\nwhere the phases have been chosen the phases to make the matrix elements real. The mixing angle θ\nis presumably determined by the same dynamics that determines the neutrino masses, and it is just as\nmysterious at this time.\nSuppose that at time t = 0 we have a beam of electron neutrinos |νei (which is thus a superposition\nof mass eigenstates) with momentum p, propagating from the origin in the z-direction. For simplicity,\nuse free-particle plane waves and non-relativistic quantum mechanics in what follows (even though,\nstrictly speaking, one should be using wave packets and relativistic quantum mechanics).\n(a) In the limit where the masses mj are small, show that the wavefunction for the beam after a time\nt and distance z is\n-ipc(t - z/c)\n1c t/2\n2c 3t/2\nψ(z, t) = exp\n\nexp(-im 2\nhp) cos θ |ν1i + exp(-im 2\nhp) sin θ |ν2i .\nh\nTaking E ≈ pc and z ≈ ct and ignoring the overall phase factor, this reduces to\nψ(z, t) = exp(-im 2\nhE) cos θ |ν1i + exp(-im 2\nhE) sin θ |ν2i.\n1c z/2\n2c 3z/2\n(b) Show that, after a distance z, the probability that a muon neutrino νμ will be found in the initially\npure νe beam is\nc3Δm z\nP (z) = sin 2(2θ) sin 2\n,\n4 hE\nwhere Δm2 ≡ m1 - m2. We thus see that the initially pure |νei state oscillates until P reaches\na maximum possible value of sin 2(2θ), and then oscillates back to being a pure |νei state as it\ntravels an oscillation length\n4π hE\nLosc =\n.\nc3Δm2\nWe also see that, for neutrino oscilations to occur, we must have a non-zero mixing angle θ and\na non-zero neutrino mass difference, and therefore at least one non-zero neutrino mass.\nIn principle, one could imagine a choice of Δm2 and sin 2(2θ) that could reproduce the observed deficits\nof solar neutrinos at various energies, although this would imply that the experimental results depend\nupon the precise distance between the Earth and the Sun (and that the solar neutrino problem would\nappear different on, say, Mars).\nA more likely explanation additionally involves a mechanism for\nenhanced oscillations during passage of neutrinos through the solar interior, due to the so-called MSW\neffect.\nAs of summer 2004, the best experimental values give sin 2 2θ = 0.82 ± 0.07 and Δm2c4 = (8.2 ± 0.6) ×\n10-5 eV2 .\n\n5. Mass-radius relation for polytropic stars (e.g., white dwarfs). In this problem, we return to\npolytropic stars, whose pressure and density are related as P = Kργ, where γ = 1 + (1/n), K and n\nare constants, and n is the polytropic index. Recall that these stars satisfy the Lane-Emden equation.\nIn lecture and in a previous problem set, we showed that the radius of the star is R = aξ1 where\n(n + 1)K 1/2\nρ(1-n)/2n ,\na =\n4πG\nc\nand that the mass is\n\nM = 4πa 3ρc\n-ξ2 dθ\n.\ndξ\nξ=ξ1\n(a) Show that the mass-radius relation for a polytropic star is\nM = 4πR(3-n)/(1-n)\n(n + 1)K n/(n-1)\nξ(n-3)/(1-n)\n-ξ2 dθ\n4πG\ndξ\n.\nξ=ξ1\n(b) Show that for a low-density white dwarf (non-relativistic, γ = 5/3, n = 3/2), the radius and mass\ncan be expressed as\nρc\n-1/6 μe -5/6\nR =\n1.122 × 104\nkm,\n106 g cm\nρc\n1/2 μe -5/2\nM\n=\n0.4964\nM\n106 g cm\n\n-3 μe -5\nR\n=\n0.7011\nM,\n104 km\nwhere μe is the mean molecular weight per electron and ne = ρ/μemp where mp is the proton\nmass, ρ is the mass density, and ne is the electron number density. Note that for a completely\nionized element of atomic number Z and weight A, μe = A/Z to 1 part in 104 .\n(c) Show that for a high-density white dwarf (relativistic, γ = 4/3, n = 3), the radius and mass can\nbe expressed as\nρc\n-1/3 μe -2/3\nR =\n3.347 × 104\nkm,\n106 g cm\nμe -2\nM\n=\n1.457\nM.\nThis is an approximation to the Chandrasekhar mass, the maximum mass of a stable white dwarf.\n(Strictly speaking, a more rigorous calculation would include electrostatic and other corrections\nto the degenerate equation of state.)"
    },
    {
      "category": "Resource",
      "title": "ps6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/8287551bd830b992ac1c1c6295053bd6_ps6.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 6\nDue: Thursday, April 13 in class\nReading: Finish reading the rest of Chapter 2 (§2.7-2.15) on stellar evolution in Hansen, Kawaler, &\nTrimble.\nYou can also read more about white dwarf properties, cooling, and crystallization physics in\nChapter 10 of HK&T, as well as in Chapters 3-4 of Black Holes, White Dwarfs, and Neutron Stars by\nShapiro & Teukolsky.\n1. Properties of a white dwarf. (Carroll & Ostlie, Problem 15.1). The most easily observed white\ndwarf in the sky is in the 40 Eri triple star system: 40 Eri A is a 4th-magnitude star similar to the\nSun, 40 Eri B is a 10th-magnitude white dwarf, and 40 Eri C is an 11th-magnitude red M5 star. This\nproblem deals only with the latter two stars, which are widely separated from 40 Eri A by 400 AU.\n(a) The period of the 40 Eri B+C \"binary\" is 247.9 yr. The system's measured trigonometric parallax\nis 0.201 arcsec and the true angular extent of the semimajor axis of the reduced mass is 6.89 arcsec.\nThe ratio of the distances of B and C from the center of mass is aB/ac = 0.37. Find the mass of\n40 Eri B and 40 Eri C in solar units.\n(b) The absolute bolometric magnitude of 40 Eri B is 9.6. Determine it luminosity in solar units.\n(c) The effective temperature of 40 Eri B is 16900 K. Calculate its radius and its average density.\n(d) Compare the radius and mean density of 40 Eri B with those of the first known white dwarf,\nSirius B (R = 0.008 R, ρ = 3.0 × 106 g cm-3 . Which is denser, and why?\n2. White dwarf cooling. (Carroll & Ostlie, Problem 15.8). Crystallization will occur in a cooling white\ndwarf when the electrostatic potential betweeen neighboring ions dominates their thermal energy. Their\nratio is\nZ2e\nΓ =\n,\nrkT\nwhere r is the typical distance between neighboring nuclei, taken as the radius of the sphere whose\nvolume is equal to the mean volume per nucleus, so that\n4 πr 3 = Amp ,\nρ\nwhere A is the atomic weight of the nuclei.\n(a) Calculate r for a 0.6 M pure carbon white dwarf with radius 0.012 R.\n(b) Much effort has been spent on precise numerical calculations of Γ to obtain realistic white dwarf\ncooling curves. The results indicate that Γ ≈ 160 for the onset of crystallization. Estimate the\ninterior temperature Tc where this occurs.\n(c) Estimate the luminosity of a pure carbon white dwarf with this interior temperature. For the\nnondegenerate envelope, assume that hydrogen mass fraction X = 0, helium fraction Y = 0.9,\nand metal fraction Z = 0.1.\n(d) For roughly how many years could the white dwarf sustain this luminosity using just the latent\nheat of crystallization of kT per nucleus released upon crystallization?\n\np\n3. Cosmochronology with white dwarfs. (Adapted from Hansen, Kawaler, & Trimble, Problem 2.9).\nIn lecture, we discussed how the luminosity function (number per cubic parsec as a function of lumi-\nnosity) of local white dwarfs can be used to estimate the age of the Galaxy. If low-mass stars had\nbeen forming forever into the past, then the luminosity function would rise indefinitely for fainter lu-\nminosities. However, for a finite history of star formation, the luminosity function should cut off below\nsome luminosity. From the plot I handed out in lecture (or see Figure 15.10 in Carroll & Ostlie or\nFigure 2.16 in Hansen, Kawaler, & Trimble), we see that the observed luminosity function for local\nwhite dwarfs cuts off for luminosities below ≈ 10-4.4L.\nFrom stellar evolution modeling, the time is takes for a star of mass M to go from birth on the zero-age\nmain sequence to the end of the planetary nebula phase (when a hot white dwarf is revealed) is\nlog τpn(yr) = 9.921 - 3.6648 log(M/M) + 1.9697 log 2(M/M) - 0.9369 log 3(M/M),\nfor ZAMS masses 0.6 < (M/M) < 10. Note that M in this equation is the original ZAMS mass (i.e.,\nbefore any mass loss). You should assume that the sample is large enough that the WDs at dropoff\nstarted out at the maximum mass for stars ending up as WDs. (Why make this assumption?)\nOnce the star has reached the end of the planetary nebula phase, it will has the mass it will retain\nfor its white dwarf lifetime. The time in years for a white dwarf of mass Mwd to cool to some given\nluminosity L is\n\n-1\n\n-2/7\nA\nMwd\n5/7 μ\nL -5/7\nτwd = 8.8 × 106\nyr,\nM\nL\nwhere A is the nuclear mass number and μ is the mean molecular weight. Assume pure carbon white\ndwarfs (A = μ = 12) and a \"standard\" white dwarf mass. Use the observed cut-off luminosity and\nthe above expressions for τpn and τwd to estimate the age of the Galactic disk (based on our local\nneighborhood).\nHaving done this part of the problem, also estimate the age of the Galactic halo, assuming that the\nobserved cutoff there corresponds to Teff = 4000 K and assuming a standard mass and radius for the\nwhite dwarfs.\n4. Mass loss from winds in hot luminous stars.\n(Adapted from Hansen, Kawaler, & Trimble,\nProblem 2.13).\nThe mass loss rate\nM in a stellar wind from a hot, massive star of mass M, radius R, and luminosity\nL obeys the semi-empirical relation\nlog( M vinf R1/2) = -1.37 + 2.07 log(L/106),\n\nwhere M, R, and L are measured in solar units, M is measured in M yr-1, and vinf is the terminal\nvelocity of the wind (far from the star) in km s-1 . This terminal velocity is found to be roughly\nproportional to the escape velocity vesc at the stellar surface,\nvesc =\n2(1 - Γe)GM/R,\nwith all quantities measured in physical (e.g., cgs) units. The factor of (1-Γe) arises from the levitating\neffect of radiation pressure at the photosphere, which effectively lowers the escape velocity. For stars\nwith T ∼> 2.1 × 104 K, it turns out that vinf ≈ vesc/2.6.\n\n(a) Neglecting radiation pressure (i.e., setting Γe = 0), make a plot of log M (in units of M yr-1)\nversus M (in solar masses) for luminosities of 105L, 3 × 105L, 106L, and 2 × 106L.\n(b) Now consider the effects of radiation pressure, by using\nκL\nΓe =\n,\n4πcGM\nwith all quantities in cgs units, and using the electron scattering opacity for the winds of hot stars\nwith κ = 0.3 cm2 g-1 . Remake your plot of log M versus M, including this radiation pressure.\nWhat is the effect on the mass loss rates?\n5. Mass loss from winds in cool luminous stars. (Adapted from Carroll & Ostlie, Problems 13.4-\n13.5).\nThe mass loss rate in a wind from a cool, luminous star with luminosity L, radius R, and surface\ngravity g can be parametrized by the Reimers wind law,\nL\n\nM yr-1\nM = 4 × 10-13 η\n,\ngR\nwhere L, R, and g are in solar units (g = 2.74 × 104 cm s-2), and η is a dimensionless free parameter\nof order unity.\n(a) Estimate the mass loss rate of a 1 M AGB star with a luminosity of 7000L and a temperature\nof 3000 K.\n(b) Assuming (incorrectly) that L, R, and η do not change with time, derive an expression for the\nstellar mass as a function of time. Let the initial mass be M0 at t = 0.\n(c) Using L = 7000L, R = 310R, M0 = 1M, and η = 1, plot the stellar mass as a function of\ntime in units of 105 yr.\n(d) How long does it take the star in the previous part to be reduced to the mass of a 0.6M degenerate\nC-O core?"
    },
    {
      "category": "Resource",
      "title": "ps7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/342ecfa3afc1aad168f5957e8167f822_ps7.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 7\nDue: Thursday, April 20 in class\nReading: Read \"How Massive Stars End Their Life\" by Heger et al. (2003, Astrophys. J., 591, 288),\nhanded out in lecture. You will also find it useful to read Sections 2.6-2.8 and 2.11.2 in HK& T, as well\nas Chapter 18 in Shapiro & Teukolsky, Black Holes, White Dwarfs, & Neutron Stars. You should also read\nChapters 5 and 12 in Shapiro and Teukolsky (handed out in lecture).\n1. Energy released in supernova core collapse. (Problem 2.12 from Hansen, Kawaler, & Trimble.)\nEstimate the gravitational potential energy released in the collapse of a 1.2M core from an initial\ndensity of 109 g cm3 to a final density of 1015 g cm .\n2. Nuclear statistical equilibrium. (Adapted from Hansen, Kawaler, & Trimble, Problem 6.7).\nIn the normal course of evolution of a massive star, the end products of nuclear burning are elements in\nthe iron region of nucleon number. If the temperatures get high enough, the radiation field is capable\nof initiating photodisintegration, and all the iron-peak elements end up as individual nucleons. This\ncan happen on such rapid time scales that the abundances of nuclei (as functions of temperature and\ndensity) can be calculated approximately as if the gas were in chemical equilibrium using a version of\nthe Saha equation.\nTo look at this in a very simplified way, consider a gas composed only of 56Ni and 4He where the\n\"chemical reaction\" between them is\n14 4He �\n\n56Ni + Q,\nwhere you may compute the Q-value from the mass excesses,\n(M - A)c 2\n=\n2.42 MeV for 4He\n(M - A)c 2\n=\n-53.9 MeV for 56Ni.\nIn equilibrium, the chemical potentials obey the relation\n14μHe = μNi.\nSince the nuclei are non-degenerate, the number density of species i (either He or Ni) obey the Maxwell-\nBoltzmann distribution,\nmikT 3/2\nμi - mic\nni = gi\nh2\nexp\n.\n2π\nkT\n(a) Set up an equivalent of Saha equation for the reaction, pretending that you are dealing with\natoms and ions and assuming that both nuclei are in their ground states. To do this, substitute\nthe Maxwell-Boltzmann relation for the number densities into the equilibrium relation for the\n\nchemical potentials, and derive an equation whose left hand side is an appropriate ratio of number\ndensities. Let the statistical weights be unity (which is appropriate since the ground state spins\nare zero).\nNote that there will be two differences from the Saha equation you encountered earlier in the term:\nFirst, there are only two species so there will only be two different n's. Second, the multiple He\nnuclei in the reaction will result in a nonlinear dependence on nHe. The Q-value plays the role of\nthe ionization energy.\n(b) Re-cast your Saha equation so that the unknowns are the mass fractions X4 and X56 where\nX4 + X56 = 1.\n(c) Fix the density to be ρ = 107 g cm-3 and solve for X4 and X56 for temperatures in the range\n4.5 < T9 < 6.5, where T9 is the temperature in units of 109 K.\n(d) Plot your results for the mass fractions versus temperature. At what temperature is X4 = X56?\n3. Trajectories near a black hole. You should read Chapter 5 and Sections 12.1-12.5 of Shapiro\n& Teukolsky (handed out in lecture) before doing this problem, in which you will study particle\ntrajectories near black holes by numerically integrating the equations of motion for both massive test\nparticles and photons near a Schwarzschild black hole (Equations 12.4.13-15 and 12.5.1-3 in Shapiro\n& Teukolsky). You should treat the equations as ordinary differential equations. Do not attempt to\nsolve them by direct analytic integration. For Equation 12.4.13, there is a singularity at the turning\npoints that makes numerical integration tricky. One can avoid this problem by taking an additional\ntime derivative and rearranging appropriately.\nDefine your units such that c = G = M = 1. What are then the units of time and length, scaled to\nM = 10M? Compute trajectories for the following cases:\n(a) Compute the radial infall (l = 0) of a massive particle into the black hole. Plot r as a function\nof both coordinate time t (time as measured by an observer at infinity) and proper time τ, thus\nreproducing the results illustrated in Figure 12.1 of Shapiro & Teukolsky). Verify explicitly that\nenergy is conserved in your numerical integration.\n(b) For a massive test particle, construct examples of the following types of orbits (defined on page\n345 in Section 12.4 of Shapiro & Teukolsky): (i) an unbound orbit (how close can you get to the\nblack hole without being captured?); (ii) a \"capture\" orbit (check the definition of this in the\nreading); (iii) a bound orbit (what is their shape?); (iv) a stable circular orbits; (v) an unstable\ncircular orbit (Where does the particle go? You might try perturbing it slightly to make it go the\nother way). Verify numerically that the innermost stable circular orbit is at r = 6M.\n(c) Construct light rays emitted in many different directions from a point near the horizon (choose\nr/M between 2.1 and 2.5). Verify numerically Equation 12.5.15 and the result of Exercise 12.14\nfrom Shapiro & Teukolsky, both illustrated in Figure 12.6."
    },
    {
      "category": "Resource",
      "title": "ps8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/2b09512c550ee542438d52df9b3837f1_ps8.pdf",
      "content": "=\nh\ni\n,\nR\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 8\nDue: Thursday, April 27 in class\nReading: Read Chapters 9 and 10 in Shapiro & Teukolsky, Black Holes, White Dwarfs, & Neutron Stars.\n1. Incompressible fluid model for a neutron star. Consider a nearly incompressible fluid as material\nfrom which to construct a neutron star. Describe the fluid as having a constant density throughout\nthe star, ρ = ρ0. This is equivalent to supposing that the pressure and density are related as P ∝ργ ,\nwhere γ →inf.) To compute the structure of a neutron star, general relativistic corrections to the stellar\nstructure equations must be made. The relativistic version of the equation of hydrostatic equilibrium,\ncalled the Oppenheimer-Volkoff equation, is given by\ndP\n-G[M(r) + 4πr3P/c2][ρ + P/c2]\ndr\nr2 1 -2GM(r)\nrc2\nwhere M and ρ refer to the total mass-energy and its density. This can be combined with M(r) =\ndr 4πr2ρ.\n(a) Integrate the Oppenheimer-Volkoff equation to show that the pressure as a function of radius is\n1 -2GMr 2 1/2\n-\n\n1 -2GM 1/2\nR3c2\nRc2\nP(r) = ρ0c 2 h\ni .\n\n1 -2GMr2 1/2\n\n1 -2GM 1/2 -\nRc2\nR3c2\nTake ρ0 = (3/4π)MR-3, where M and R are the mass and radius of the neutron star, respectively.\n(b) Show that, in order for the pressure to remain finite, R must be greater than (9/8)(2GM/c2).\n2. Internal structure of neutron stars. In this problem, you will solve numerically for the equi-\nlibrium structure of a neutron star.\nDetailed discussions of the technique are given by Arnett &\nBowers (1977, Astrophys. J. Suppl., 33, 415) and Lattimer & Prakash (2001, Astrophys. J., 550,\n426). These papers can be found in the library, or online via the NASA Astrophysics Data System\n(http://ads.harvard.edu, click on \"Search References\").\n(a) Use Figure 4 of Arnett & Bowers (1977) or Figure 1 of Lattimer & Prakash (2001) to choose a\nplausible power-law equation of state of the form P = Kργ . To do this, draw a single (\"average\")\nstraight line through equation of state models A through G in Arnett & Bowers or the equivalent\nmodels (not the strange quark matter models denoted by \"SQM\") in Lattimer & Prakash. You will\nuse your power-law model down to arbitrarily low densities extending below the lower limits of the\nfigures in these papers. Note that one can convert between the number density in baryon fm-3\nplotted in Lattimer & Prakash and mass density of g cm-3 using mb = 1.7 × 10-24 g and\n1 fm=10-13 cm.\n(b) Consider a range of central densities, 14 < log ρc < 16.5 (g cm-3), uniformly spaced in log ρc. For\neach of these, integrate the Oppenheimer-Volkoff equation for hydrostatic equilibrium in general\n\n=\nh\ni\n,\np\nrelativity,\ndP\n-G[M(r) + 4πr3P/c2][ρ + P/c2]\ndr\nr2 1 - 2GM(r)\nrc2\nto find the run of density as a function of radial coordinate r. To do this, you can directly integrate\ndρ/dr as determined from your power-law equation of state and dM/dr = 4πr2ρ.\n(c) Plot neutron star mass versus central density of your range of models. What is the maximum\nmass Mmax of a neutron star for the assumption that your chosen pressure law is correct?\n(d) Plot radius versus central density for your range of models (M < Mmax only).\n(e) Plot mass versus radius for your models (M < Mmax only).\n(f) Repeat steps (b) and (c) for the following hybrid equation of state:\n-3\nP = ρc 2\nfor ρ > 1014.6 g cm\n-3\nP = Kρ5/3\nfor ρ < 1014 g cm\nwhere K = 5.5×109 (cgs) is the appropriate constant for a non-relativistic Fermi gas of neutrons.\n[Note that P = ρc2 corresponds to the causality limit, since it gives a sound speed cs = (dP/dρ)1/2\nequal to c. See Section 9.3 and 9.5 of Shapiro & Teukosky for further discussion.] For densities\nbetween 1014 g cm-3 and 1014.6 g cm-3, use a simple linear interpolation between the pressures\ngiven by the above expressions.\n3. Maximum rotation rate of a pulsar. Estimate the maximum rotation rate for a neutron star\nbefore it breaks up.\n(a) Find an expression for the minimum rotation period, Pmin, of a neutron star of a function of its\nmass M and radius R. Simply estimate the rotation at which a small mass parcel at the neutron\nstar surface, near the equator, would experience centrifugal and gravitational forces of the same\nmagnitude.\n(b) Evaluate Pmin for a neutron star with M = 1.4M and R = 10 km. For comparison, the fastest\nknown millisecond pulsar is PSR J1748-2446ad, which has a spin period of 1.4 ms (Hessels et al.\n2006, Science, 311, 1901).\n(c) Newton studied the equatorial bulge of a homogeneous fluid body of mass M that is slowly rotating\nwith angular velocity ω. He proved that the equatorial radius Re, polar radius Rp, and mean\nradius Rm are related by\nm\nRe - Rp = 5ω2R3\n.\nRm\n4GM\nUse this to estimate the equatorial and polar radii for a 1.4M neutron star rotating at twice the\nminimum rotation period you found in part (b).\n4. Pulsar spin-down properties. Consider a pulsar with spin period P = 2π/ω that is losing rotational\nkinetic energy and thus spinning down.\n(a) For magnetic dipole radiation, ω = -kω3 . For the case where k is a constant, show that the\nmagnetic field strength B ∝\nPP .\n\n\"\n#\nq\nZ\n\n(b) For a more general braking index n, where ω = -kωn, show that n = ωω/ω 2 .\n(c) Show that a good estimate for the age of a pulsar is\nP (n-1)\n|P/P |final\nτ =\n1 -\ninitial\nP n-1\n(n - 1)\nfinal\n(d) Derive an expression for the spin-down time scale of a pulsar with a braking index of 3 in terms\nof B12 (the magnetic field strength in units of 1012 G) and Ps (the rotation period in seconds).\n5. Dispersion of pulsar radio pulses in the interstellar medium.\n(a) Show that the index of refraction of a plasma is given by\nn =\n1 - (ωp/ω)2 ,\nwhere νp = ωp/2π is the plasma frequency (with ω2 = 4πnee2/me in terms of electron number\np\ndensity ne) and ν = ω/2π is the frequency of the radio waves.\n(b) What is the phase velocity at frequency ν?\n(c) What is the group velocity at frequency ν?\n(d) Show that a pulsar pulse observed near radio frequency ν is delayed (compared to, say, optical or\nX-ray pulses emitted at the same time) by\n\nν\n-2\nΔt = (constant)\n(ne/0.01 cm-3)(dx/1 kpc) s,\n400 MHz\nwhere ne has been scaled in units of 0.01 electrons/cm3, the distance in kpc, and the observing\nfrequency in units of 400 MHz. The integral is over the distance from the pulsar to the Earth.\nAssume that ν νp always. Evaluate the constant in the above expression."
    },
    {
      "category": "Resource",
      "title": "ps9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/73bd12e1817d52663c8a16385575b48f_ps9.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 9\nDue: Tuesday, May 9 in class\nReading: Read Chapter 13 on compact X-ray sources in Shapiro & Teukolsky, Black Holes, White Dwarfs,\n& Neutron Stars. (Note that the observational details are very dated, but the theoretical description is good.)\nYou may also find it instructive to skim through Chapters 14 (accretion onto black holes), 15 (accretion onto\nneutron stars and white dwarfs), and 16 (gravitational radiation).\n1. Supernova explosion in a binary system. Two stars of mass m1 and m2 are in a circular orbit.\nStar 1 undergoes a supernova explosion in which mass Δm is blown away spherically symmetrically\n(in the frame of star 1) on a time scale that is very short compared to the orbital period. Show that\nthe condition for the orbit to remain bound is\nm1 + m2\nΔm <\n.\nHint: Compute the total energy of the binary after the explosion in the (new) center of mass frame\nof the binary. Assume that immediately after the explosion, the binary separation and the orbital\nvelocities of both stars are unchanged. A useful relation is that the total kinetic energy is (1/2)μv2\nrel,\nwhere μ is the reduced mass and vrel is the relative velocity.\n2. Changes in orbital separation due to mass transfer. Two stars of mass m1 and m2 are in a\ncircular orbit. Star 2 transfers matter onto star 1 via Roche-lobe overflow. Assume that the mass\ntransfer is conservative, i.e. that no mass is lost from the system, and also that the orbit remains\ncircular during mass transfer.\n(a) Using only conservation of mass and orbital angular momentum, find the fractional change in\nbinary separation (Δa/a) in terms of the mass ratio q = m2/m1 and the fractional mass change\nΔm/m (where Δm2 = -Δm and Δm1 = +Δm). Show that transfer from the lighter to the\nheavier star leads to a widening of the orbit (Δa/a > 0), while transfer from the heavier to the\nlighter star leads to a shrinking of the orbit (Δa/a < 0).\n(b) The effective radius of the Roche lobe around star 2 is given approximately by\n\nM2\n1/3\na\nRL2 '\n.\nM1 + M2\nFind the change in the Roche lobe radius in response to the mass transfer.\n(c) For simplicity, assume that star 2 is fully convective, and thus well-described by an n = 3/2\npolytrope. The adiabatic reponse of the star is obtained from the mass-radius relation for an\nn = 3/2 polytrope, which gives R ∝ M -1/3 . From this relation, find the change in the radius of\nstar 2 in response to the mass loss.\n(d) Argue that the mass transfer will be dynamically unstable is ΔR2 > ΔRL2. Find the maximum\nvalue of the mass ratio q for stable mass transfer.\n\n3. Magnetospheric radius of an X-ray pulsar. Define the magnetospheric radius of an accreting\nneutron star as the distance at which the energy density in the magnetic field (B2/8π) is equal to the\n(Keplerian) kinetic energy density of the orbiting material in the accretion disk (ρv2\nK/2, were ρ is the\nmass density and vK is the Keplerian velocity). Assume that the neutron star has a dipolar magnetic\nfield, with dipole moment μ.\nShow that the radius of the magnetosphere can be written as\n4/7\n-2/7 M1\n-1/7\n\nrm ' 1.3 × 108 (ηΩ)2/7 μ30 M-8\ncm,\n\nwhere μ30 is the magnetic dipole moment of the neutron star in units of 1030 G cm , M-8 is the mass\naccretion rate in units of 10-8M yr-1 , M1 is the neutron star mass in solar masses, and Ω is the solid\nangle subtended by the accretion disk as seen from the neutron star.\n\nNote that conservation of mass requires that, in steady state, M ' (ρvrΩ)(4πr2) (or flux times area),\nwhere vr is the (small) radial velocity component of the disk material. Define the ratio η = vr/vK,\nwhere generally η 1.\n4. Gravitational radiation from the Hulse-Taylor binary pulsar.\nThis problem explores material discussed in Ryan Lang's guest lecture on April 27. Consider a binary\nneutron star system. Assume that both stars have the same mass M and that they move in a circular\norbit, separated by a distance R. For convenience, define the period of the orbit to be P and the\nangular frequency of the orbit to be Ω = 2π/P. What are these in terms of M and R?\n(a) Calculate the (standard Newtonian) energy of the system in terms of M and P.\n(b) Calculate the gravitational quadrupole moment tensor Iij for this system. For simplicity, assume\nthe binary lies in the xy-plane, and take the origin to be the center of mass.\nUse standard\nidentities to reduce the answer to single trigonometric functions (not products of them). How\ndoes the gravitational wave frequency f relate to the orbital frequency Ω?\n\n(c) Use the result of part b to calculate the trace-reversed metric perturbation hij generated by the\nmotion of this system. The result you get should already be in transverse-traceless form for a\nwave propagating in the z direction. Describe the polarization of this wave.\n(d) Apply the projection tensor and remove the trace to find the transverse-traceless representation\nof a wave propagating in the x direction. What is its polarization? Explain why this makes sense.\n(e) Calculate the energy loss from the system due to gravitational radiation, dE/dt. Then use the\nresult of part a to find the change in period, dP/dt.\n(f) Now plug in some numbers: M = 1.4M and P = 7.75 h. What is the resulting orbital pe-\nriod derivativem, dP/dt? Compare your answer to Hulse and Taylor's answer, -2.42 × 10-12\n(dimensionless). What assumptions did we make that might cause these results to disagree?"
    },
    {
      "category": "Resource",
      "title": "ps10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-901-astrophysics-i-spring-2006/b00b9dcaf02ca1f6500ea0c672213a7f_ps10.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Physics\nPhysics 8.901: Astrophysics I\nSpring Term 2006\nPROBLEM SET 10\nNot due: This problem set will not be collected or graded.\nReading: You may find Chapter 12 of Carroll & Ostlie (Introduction to Modern Astrophysics) helpful for\nbackground reading on star formation.\nReminders: The final exam will be on Wednesday, May 24, 9:00am-12:00pm.\n1. Mass loss rate in Roche lobe overflow. Consider a stellar binary comprising stars of mass M1\nand M2 located at r1 and r2, respectively, where we use a reference frame rotating with the orbital\nangular frequency Ω whose origin is at the binary center of mass. In this coordinate system, the orbit\nlies in the x-y plane and the stars are at fixed positions on the x-axis. The Roche potential is\nGM1\nGM2\nΦ(r) = -\n-\n-\n|Ω × r|2 ,\n|r - r1|\n|r - r2|\nwhere we have neglected the Coriolis force. Star 2 fills its Roche lobe and loses matter through the\ninner Lagrangian (L1) point, located at (xL, 0, 0) in Cartesian coordinates.\n(a) Recall that the L1 point has rΦ = 0. Show that, to order of magnitude, the potential at a nearby\npoint (xL, Δy, 0) is\nΦ(xL, Δy, 0) ' Ω2 (Δy)2\n(b) Use an energy argument to show that mass escapes from star 2 from a patch near the L1 point\nwith radius\nΔy ∼ cs/Ω,\nwhere cs is the sound speed in the patch.\n(c) Show that, to order of magnitude, the mass loss rate from star 2 through the L1 point is\nρc3P 2\nM2 ∼\ns\norb\n-\n,\n4π\nwhere Porb is the binary period and ρ is the mass density in the patch. The sound speed is order\nthe mean thermal velocity and thus scales with temperature as T 1/2 . Since both ρ and T increase\nbelow the stellar surface, the mass loss rate will grow if the Roche lobe penetrates deep into the\n\"natural size\" of the star.\n2. The thin disk approximation for accretion disks.\nConsider an accretion disk around a star of mass M, with the disk's midplane having z = 0 in a\nrectangular coordinate system with origin at the star. At a midplane radius r, the disk has height\nH(r) in the z-direction (so that its thickness is 2H. We will assume that H r, and that the mass in\nthe disk is negligible compared to M (so that the disk's self-gravity may be neglected).\n(a) Write down an equation for hydrostatic equilibrium in the z direction in terms of the pressure P,\ndensity ρ, and mid-plane radius r.\n\np\n(b) Show that the disk height may be written as\ncs\nH(r) '\nR,\nvK\nwhere cs '\nP/ρ is the sound speed and vK is the Kepler velocity.\n(c) Show that the thin disk condition (H r) is equivalent to requiring that the Keplerian orbital\nvelocity is highly supersonic (vK cs).\n3. Star formation: the collapse of a molecular cloud.\nRecall that the radial hydrodynamic equation of motion is\nGMrρ\ndP\nρr = -\n-\n,\nr2\ndr\nwhere ρ is the density, P is the pressure, and Mr is the mass interior to radius r (assuming spherical\nsymmetry). For the case of hydrostatic equilibrium, = 0. (Note that for a collapsing cloud, the mass\nr\nenclosed by the collapsing surface remains constant as the density increases.)\nConsider the collapse of a uniform-density giant molecular cloud with temperature T = 150 K and\n-3\nnumber density 108 cm\n.\n(a) Using the ideal gas law, estimate |dP/dr| ≈|ΔP/Δr| ∼Pc/RJ at the start of the cloud's collapse,\nwhere Pc is an approximate value for the central pressure of the cloud and RJ is the Jeans length.\nAssume that P = 0 at the edge of the cloud, and use the Jeans values for its mass and radius.\n(b) Show that, within the accuracy of our crude estimates for the Jeans parameters, the value of\n|dP/dr| you found above is comparable to (i.e. within an order of magnitude of) what is required\nfor quasi-hydrostatic equilibrium.\n(c) As long as the collapse remains isothermal, show that the size of dP/dr continues to decrease\nrelative to gravitational effects, so that the pressure gradient may be neglected once the free-fall\ncollapse begins.\n4. Magnetic fields and star formation.\nEstimate the gravitational potential energy per unit volume for the pre-collapse giant molecular cloud\ndescribed in the previous problem. (Take M to be the Jeans mass for this cloud.)\nCompare this\nto the magnetic energy density of the cloud if it is threaded by a uniform magnetic field of strength\nB = 10 μG. Would you expect that the magnetic field could play a siginificant role in the collapse of\nthis cloud?\n5. Angular momentum and star formation.\nIn this problem, we will explore the effect of rotation on the collapse of a molecular cloud.\n(a) Write down the radial equation of motion for free-fall of a molecular cloud, including a centrifu-\ngal term for a non-zero fixed-axis angular velocity of the cloud. Using conservation of angular\nmomentum, show that the collapse of the cloud will stop in the plane perpendicular to the axis\nof rotation when the cloud radius reaches\nω2\n0 r0\nrf =\n,\n2GMr\n\nwhere ω0 and r0 are the original angular velocity and radius of the cloud. You may assume that\nthe initial radial velocity of the cloud is zero, and that rf r0. You may also assume (incorrectly)\nthat the cloud rotates as a rigid body throughout the collapse.\nHint: You may use the fact that\nd2r\ndr\nd dr\ndvr\n=\n×\ndt2\ndt\ndr\ndt\n= vr dr ,\nwhere vr is the radial velocity.\n(b) Assume that the original cloud had a mass of 1M and a radius of 0.5 pc. If the collapse is halted\nat a radius of approximately 100 AU, find the initial angular velocity of the cloud. What was the\noriginal rotational velocity (in cm s-1) of the edge of the cloud?\n(c) Assuming that the moment of inertia is that of a uniform sphere when the collapse begins, and\nthat the moment inertia is that of a uniform disk when the collapse ends, determine the rotational\nvelocity at 100 AU when the collapse stops.\n(d) After the collapse has stopped, calculate the time required for a mass element at 100 AU to make\none complete revolution around the center of the protostar. Compare this time to the orbital\nperiod at 100 AU expected from Kepler's third law. Why would you not expect the two periods\nto be identical?\n6. Deducing the nature of a highly reddened star.\nNote: To do this problem, you will need to look up tabulated information on the typical intrinsic\ncolors and absolute magnitudes of stars as a function of spectral type and luminosity class. There\nare any number of references where you can find this information. One particularly convenient source\nis the fourth edition of Allen's Astrophysical Quantities (2000; ed. Arthur N. Cox, AIP Press and\nSpringer-Verlag), Tables 7.6, 7.7, 7.8, and 15.7.\nInfrared observations are made of a star lying toward the Galactic center, yielding the following infrared\n(apparent) magnitudes: J = 19.21±0.05, H = 16.16±0.05, and K = 14.69±0.05. In this problem, you\nwill use the interstellar reddening law to compare the observed magnitudes to the tabulated intrinsic\n(unreddened) colors and absolute magnitude of stars to determine the most likely range of spectral\ntype and luminosity class for this star. Recall from our in-class discussion of the reddening law that\nin the infrared: AJ = 0.282 AV , AH = 0.175 AV , and AK = 0.112 AV .\n(a) Recall that the intrinsic (unreddened) apparent magnitude mλ,0 in band λ is related to the\nobserved magnitude mλ by mλ = mλ,0 + Aλ, where Aλ is the reddening. Using this relation as\nwell as the interstellar extinction law and the measured J - H and H - K colors for the star,\nderive a linear equation relating the intrinsic colors of the star, (J -H)0 and (H -K)0. Be sure\nto propagate the measurement uncertainties into this equation as well. This equation represents\nthe allowed locus of intrinsic colors for our star, as a function of the reddening AV . Show this\nallowed region as a band on a color-color diagram that plots (J - H) vs (H - K) for a range\ncorresponding to AV from 15 to 25.\n(b) What could this star be? As candidates, consider main sequence stars (luminosity class V), giants\n(luminosity class III), and supergiants (luminosity class I). For each of these classes, compare our\nstar's allowed region of intrinsic J -H and H -K colors to the tabulated intrisic infrared colors\n\nof the various spectral types by placing both on the same color-color plot. For each luminosity\nclass, what range of spectral types has intrinsic colors consistent with the observed colors of the\nstar, and for what values of the reddening AV ?\n(c) For each luminosity class, determine the distance to the star (in kpc) for each allowed spectral\ntype. Do this by comparing the observed K magnitude of the star with the absolute K magnitude\n(MK) for each spectral type/luminosity class. (It is generally the absolute V magnitude that is\ntabulated; you will need to combine this with the intrinsic V -K color and the reddening in K.)\nYou should be able to argue that some of these distances are implausible given the amount of\nreddening and/or the direction in the sky. Use such arguments to infer what the most plausible\nrange of spectral class and luminosity class for the star."
    }
  ]
}