{
  "course_name": "At the Limit: Violence in Contemporary Representation",
  "course_description": "This course focuses on novels and films from the last twenty-five years (nominally 1985–2010) marked by their relationship to extreme violence and transgression. Our texts will focus on serial killers, torture, rape, and brutality, but they also explore notions of American history, gender and sexuality, and reality television—sometimes, they delve into love or time or the redemptive role of art in late modernity. Our works are a motley assortment, with origins in the U.S., France, Spain, Belgium, Austria, Japan and South Korea. The broad global era marked by this period is one of acceleration, fragmentation, and late capitalism; however, we will also consider national specificities of violent representation, including particulars like the history of racism in the United States, the role of politeness in bourgeois Austrian culture, and the effect of Japanese manga on vividly graphic contemporary Asian cinema.\nWe will explore the politics and aesthetics of the extreme; affective questions about sensation, fear, disgust, and shock; and problems of torture, pain, and the unrepresentable. We will ask whether these texts help us understand violence, or whether they frame violence as something that resists comprehension; we will consider whether form mitigates or colludes with violence. Finally, we will continually press on the central term in the title of this course: what, specifically, is violence? (Can we only speak of plural “violences”?) Is violence the same as force? Do we know violence when we see it? Is it something knowable or does it resist or even destroy knowledge? Is violence a matter for a text’s content—who does what, how, and to whom—or is it a problem of form: shock, boredom, repetition, indeterminacy, blankness? Can we speak of an aesthetic of violence? A politics or ethics of violence? Note the question that titles our last week: Is it the case that we are what we see? If so, what does our obsession with ultraviolence mean, and how does contemporary representation turn an accusing gaze back at us?",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "American Literature",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "American Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nScreenings: 1 session / week, 2-4 hours / session\n\nPrerequisites\n\nOne subject in Literature or Comparative Media Studies.\n\nThis is an intermediate-level course. The prerequisite is broad and flexible: ideally, you will have taken one or two previous classes involving analytical writing in the humanities, and have some experience with either film or literary analysis. You can fulfill this with previous HASS courses at MIT; summer studies here or elsewhere; or AP work in the humanities in high school. In addition, I am willing to waive the prerequisite on a case-by-case basis as long as you understand the nature of the workload and expectations for the course. You do not need to have formally studied literature\nand\nfilm; I will be talking about how to do close analysis of texts throughout the semester, and we'll practice it every week in our seminar discussions.\n\nCourse Description\n\nThis course focuses on novels and films from the last twenty-five years (nominally 1985-2010) marked by their relationship to violence and transgression. Our texts will focus on serial killers, torture, rape, and brutality, but they also explore notions of American history, gender and sexuality, and reality television--sometimes, they delve into love or time or the redemptive role of art in late modernity. Our texts are a motley assortment, with origins in the U.S., France, Spain, Belgium, Austria, Japan and South Korea. The broad global era marked by this period is one of acceleration, fragmentation and late capitalism; however, we will also consider national specificities of violent representation, including particulars like the history of racism in the United States, the role of politeness in bourgeois Austrian culture, and the effect of Japanese manga on vividly graphic contemporary Asian cinema.\n\nWe will explore the politics and aesthetics of the extreme; affective questions about sensation, fear, disgust, and shock; and problems of torture, pain, and the unrepresentable. We will ask whether these texts help us understand violence, or whether they frame violence as something that resists comprehension; we will consider whether form mitigates or colludes with violence. Although we're focusing on contemporary controversial work, this course will hopefully give you a ground for thinking about extremity across a variety of historical, national, and even disciplinary borders.\n\nFinally, we will continually press on the central term in the title of this course: what, specifically, is\nviolence\n? (Can we only speak of plural \"violences\"?) Is violence the same as force? Do we know violence when we see it? Is it something knowable or does it resist or even destroy knowledge? Is violence a matter for a text's content--who does what, how, and to whom--or is it a problem of form: shock, boredom, repetition, indeterminacy, blankness? Can we speak of an aesthetic of violence? A politics or ethics of violence? Note the question that titles our last week: Is it the case that we are what we see? If so, what does our obsession with ultraviolence mean, and how does contemporary representation turn an accusing gaze back at us?\n\nRequirements\n\nSeminar attendance and active, engaged participation are the foundation of this course.\nThinking together is what a seminar is; therefore, your participation grade counts for a great deal of your final mark. Because time spent discussing and analyzing course material in the seminar cannot be made up, and because we only meet twelve total times, one unexcused absence will affect your grade and two unexcused absences will result in failing the course. (If you are sick or have another good excuse for being absent, email me.) It should go without saying that completing all readings and required screenings before class is of the utmost importance; doing so with a careful eye, and coming to class ready to talk about and critically unpack course material, is part of that preparation. Your participation grade encompasses far more than attendance, including a rigorous set of film and reading notes and articulate engagement in class discussions.\n\nThere are nine film\nscreenings\nscheduled for this class. They will last 2-4 hours and the material covered therein is required. In some weeks, the screened material will constitute all of your required assignments for this course; in others, the films may be part of the assigned work with theoretical / critical readings and / or novels. Viewing the material before class is required whether you attend the screening or watch the films on your own. Acquiring the texts on your own is an option, but the variability of delivery time is not an excuse for being unprepared. You should take extensive notes during screenings: these will be helpful for class discussions and your papers, and they force you to watch the films critically. I will often give directions before the screenings with guidance on things to watch for.\n\nBecause this course is a seminar, responsibility for the content and rigor of class discussions lies with its participants. I will open each class by contextualizing that week's material, and if there is conceptual or historical background information that I think might be valuable, I'll present that as well. This is not a lecture class, however, and your individual intellectual interests will shape most of our discussion time.\n\nYou will be placed in groups that will rotate responsibility for guiding our class discussion. The group designation is merely an ordering principle: questions should be conceptualized, formulated, and presented individually. When it is your week, you will be asked to come to class having written and posted a weighty\ndiscussion question\non our course website by\nmidnight\n\non the day before each class meeting\n. (Think: 4-5 sentences, minimum, and a significant, open, complex question or two.) Questions posted after midnight will not make it into the class plan for the next day, and will count against your grade. At some point during the morning before class, everyone should read and think about these questions; they will form the basis of our class discussions. When it is your group's week, I will ask you to present your question (you can summarize, but most students read a copy of it)--and you should be prepared for me to ask you follow-up questions or expand an aspect of it as a way into discussion.\n\nRequired Texts\n\nThere are four required books for this class. You will want to acquire them immediately--especially\nAmerican Psycho\n, which you will start reading very soon.\n\nMajor texts\n\nEllis, Bret Easton.\nAmerican Psycho\n. Vintage, 1991. ISBN: 978067973577.\n\nPalahniuk, Chuck.\nFight Club: A Novel\n. W. W. Norton & Company, 1996. ISBN: 9780393039764.\n\nCooper, Dennis.\nFrisk\n. Grove Weidenfeld, 1991.\n\nSontag, Susan.\nRegarding the Pain of Others\n. Picador, 2004. ISBN: 9780312422196. [Preview with\nGoogle Books\n]\n\nShorter readings can be found on the calendar.\n\nFurther Readings & Viewings\n\nA lot has been written about violence and representation, violence in American culture, violence and the media, etc., just as violence has been a central topic to so many filmmakers and authors. The works on these lists are intended to supplement and extend your interests in the work we do in this course.\n\nFurther Reading (PDF)\n\nFurther Viewing (PDF)\n\nAssignments\n\nThere will be three papers for this course: two short papers (4-5 pages each) and one longer final paper (8-10 pages). I will provide a long list of topics and questions for each paper for you to choose from. These will be analytical essays (with a thesis, textual analysis as evidence, a rigorous conclusion), they will be comparative (asking you to think about multiple texts from our course), and they will ask you to reflect on or engage with critical and theoretical questions. I encourage everyone to come talk to me early and often about assignments--I am happy to comment on your thesis, or first paragraph, or conclusion, if you want feedback during the writing process.\n\n* Professor Brinkema's Note About This Course\n\nThis semester, we will continually examine the concept of \"violence\" in order to make it more complex, more diverse, more complicated, and--quite possibly--more opaque by the end of the semester than it was at the beginning. We will ask about historical versus individual forms of violence, sanctioned and unsanctioned violence, psychic versus physical violence, and even about whether formal devices constitute a kind of violence on the aesthetic level. Therefore, it should not go without saying that we already know what \"violence\" is, and thus this note is to be taken as posing the very problem we will be exploring this semester.\n\nThat having been said: there is no question that some of the films and novels we will be studying include acts of rape, torture, brutality, assault, and representations of pain and fear. Some of the films are rated NC-17. Some of the material is gross, much of it is disturbing--and we will be examining and theorizing the disturbing (as an aesthetic, a politics, an ethics). This is not to dissuade anyone from taking the course, but if you're particularly sensitive and do not think that you can get through this material, you may want to talk to me. Everyone is welcome to email me, come to office hours, or make an appointment at any time during the semester.\n\nI work on this material constantly, as it is my research specialty, and I will say two final things about extreme texts. First, they can also be funny or loving or gentle or moving, and you should attend to the positive affective side of this kind of material as well. Second, violence catches us off guard. Be open to being surprised by your reactions: they may range from boredom and indifference to being bothered that you're bothered by something seemingly trivial. Attend to the affective (i.e. emotional, physical, visceral) experience of reading and watching this material: it's something that literary and film critics write and think about, and this semester, it's one of many ways to approach the texts. In addition, I often find that when I think and write analytically and curiously about disturbing material, it produces a new, often surprising relationship to it, makes it possible to tarry with dark things.\n\nLiterature Faculty Policy on Plagiarism\n\nPlagiarism--the use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations. This includes images or texts in other media as well as materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For guidance on attribution, consult\nhttp://cmsw.mit.edu/writing-and-communication-center/citation-formats/\n.*\n\n* A teachable moment: The text in this paragraph was not created by me--it is the official policy of the Literature Section and all Lit faculty have it in their syllabi. So, to denote that I didn't write it, I should in theory put the entire paragraph in quotation marks and use an endnote / footnote to write the following citation: Literature Faculty Policy on Plagiarism, online text, available at\nhttp://lit.mit.edu/academic-policies-resources/\n, accessed September 1, 2013. If I had encountered this material in a book written by Jane Smith, I would cite it as:\n\nSmith, Jane, \"Literature Faculty Policy on Plagiarism,\" in Plagiarism Policies, ed. John Smith (Cambridge: MIT Press, 2013).",
  "files": [
    {
      "category": "Resource",
      "title": "Final Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/3dc7254982675a2422cc7cda975e765d_MITCMS_840F13_FinalPrTopis.pdf",
      "content": "At the Limit: Violence and Contemporary Representation\nGuidelines for Final Paper, p. 1\n\nEugenie Brinkema\n\nWhat is New This Time:\n\n- Papers should be 8-10 pages long.\n- You must write about more than one text; this is a comparative paper.\n- You will have the option of designing your own topic (more below).\n\nWhat Stays the Same:\n\n- The paper should be in 12-point font, double-spaced, Times New Roman or Times font.\n- You should rewatch the films about which you write--all are available in the Film Office.\n- Feel free to come to my office hours or make an appointment to talk. You can always email\nme your thesis for feedback. If you have any questions about your earlier papers, please just\nask.\n\nNOTE:\n\nYour final paper for this class should be a summation of your investment in the course\nmaterial and, therefore, needs to grow out of the work we've done on violence in contemporary\nliterature and film. This paper is an opportunity to take all of our course material, work with it,\nbut also go beyond it and connect it to your specific intellectual interests. For those of you\nwho have wanted to explore tangents and related theoretical issues in your shorter papers, this\nis the chance to write that longer, more complex, more nuanced paper.\nIn general, I want you to engage with as many films and theoretical issues as possible\nthis semester, so your films and readings for this paper should be ones on which you have not\nyet written. Thus, the period of texts for this paper is the material from week ten to fourteen\n(TV/Celebrity; Postmodern Graphic; Regarding the Pain of Others; We are what we watch?).\nWith prior permission, you can write on other texts so long as you didn't write on them\nearlier--if you didn't write about Henry and are desperate to connect it to Man Bites Dog, we\ncan talk about that, but overall these papers should be engaging with the problems of\n(re)mediation, the graphic, style, pain, trauma, reflexivity, criticism, etc. from the last third of\nthe course.\n\nII. Topics for Final Paper:\n\n1. Pain. Consider either Scarry's epistemology of pain or Sontag's ethics of regarding the pain\nof others, and read it in relation to one or two texts: Reservoir Dogs; Oldboy; Funny Games; and\nBenny's Video might all work especially well here. Articulate how your see your chosen theorist\ndefining and accounting for images of pain: what kinds of problems emerge when talking about\nthe pain of others? How do your chosen texts present or grapple with pain as a problem? Do\n\nAt the Limit: Violence and Contemporary Representation\nGuidelines for Final Paper, p. 2\n\nthey concur with your theorist, or argue for another relation to pain? How do the texts\nrepresent the regarding of pain (in the text) and how does this relate to our spectatorial\nregarding of pain? Is there an aesthetic of regarding the pain of others? A politics? An ethics\nto it? What kinds of critical problems are present when dealing with representations of the\npain of others? Does it demand a different approach, or a specific mode of critique? Is pain\ndifferent from other things we can regard? What is the relationship between violence and\npain? Do your texts bind those terms together or do they de-couple them?\n\n2. Violence and Humor/Violence and Laughter. Choose two texts and consider the\nrelationship between humor and violence in them. Consider the cartoonish; the absurd; gross-\nout humor; splatter; camp; parody. Or, you might focus on laughter more specifically and\nwrite an argument about its specific usage (or related forms: the smirk and wink in Funny\nGames; the laugh track in Natural Born Killers--that use of the word track is so very\ninteresting; the absurd or surreal or ironic in Man Bites Dog, etc.)\nBe specific in how you define your terms and how your films deploy the figure you\ndefine: how do the texts use humor, and how or where do they fail to use it? Is humor in the\nimage? In the use of sound? In the narrative? In juxtaposition or incongruity? Is it in\nabsurdity? Are there several or different modes of humor in your very violent texts? Do the\ntexts change their approach or tone in regards to humor over the course of the text? (If so,\nwhat is the tipping point in which tone shifts?) What does the usage of humor in any form\nmean in a text that is about violence: is violence presented humorously, is humor presented\nviolently? What does it mean for a text to juxtapose those two figures? What does it mean for\nspectatorship? What does it mean for criticism? Is humor a way of downplaying violence, or\ncan it make violence more violent? What are the ethics of deploying humor in this way?\n\n3. Violence, Looking, and Videotape(s). Consider and describe reflexive moments of\nvideotaping or watching scenes of violence in two texts; make an argument about how these\nfilms use embedded screens or reflexive references to mediation as either an agent of violence\nor for a critique of violence; and make use of Bazin's argument about obscenity and death and\ntime in formulating your argument (do you agree with him? do your films complicate his\naccount? etc.). Consider Man Bites Dog; Natural Born Killers; Funny Games; Benny's Video;\nand/or Tesis.\nIs there a logic to embedded scenes of videography; how is filming a victim linked\ndiegetically to violence and/or how is showing us violence through embedded filming linked to\na critique of violence? Does putting a diegetic frame around violence make the violence more\nviolent, or more distant; does it increase the affective experience or mitigate it? Is watching\nviolence (diegetically) pleasurable or unpleasurable? Are there ways of connecting our\nspectatorial work to these scenes of people watching terrible things? Are there ways of\nwatching filmed violence that are more or less complicit with violence? How do different looks\nfunction in the texts you've chosen; are there looks that undo violence?\n\nAt the Limit: Violence and Contemporary Representation\nGuidelines for Final Paper, p. 3\n\n4. Noise. Water. Meat.\n[ EB: This is the title of a fantastic book about the uses of sound in contemporary art,\neach of these titular words being ways in which sound is generated in different practices... It\nobviously also has other resonances in the context of our course; I couldn't resist. ]\nPick two texts and make an argument about their use of sound (including: voice, music,\neffects, noise, silence; but also: the muffled, the distinct, the loud, the whispering, the fragile,\nthe painful, the hard and rhythmic, the lyrical and languid) and how that use of sound relates\nto violence. You'll want to make sure you have a grasp on some language for the analysis of\nsound (diegetic/extradiegetic; timbre; frequency; pitch; sound and/vs. image; on- vs. off-screen\nsound --talk to me if you're not sure), and you'll want to be clear on how the sonic as such (not\nwords as they mean, but words as they sound) relates to violence. You might also consider a\nsonic figure such as laughter; the scream; breathing; gasping; suffocating; televisual or media\nnoise; and read that figure in relation to violence. How does sound work in the text, and how\ndoes sound work on spectators? Does sound seem to have a privileged relationship to violence\nthat is different from either language or the image's relationship? Why is that; what does that\nmean for thinking about violent texts?\n\n5. Time and Duration. Pick two texts and think about the figure of time, temporality, and\nduration. Make an argument about how the texts deal with the problem of time: historical\ntime; memorialized time; felt time (duration; boredom); the time of trauma; the time of grief;\nthe time of shock; quick time; long time; familial time; the past; the present; the future; story\nvs. plot time; anachronies (narrative out of linear time); etc. Every paper will want to create an\nargument about the relationship between time and violence, and speculate in the conclusion\non the significance of that argued-for relationship. This topic would work especially well for\nReservoir Dogs; Oldboy; Funny Games; and/or Benny's Video.\nSpeculate on the broader relationship between time, duration and violence. How would\nthe texts have been different with a different formal relationship to time and narrative? Do we\nexperience violence in time, or as something that punctures or destroys or exists outside of\ntime? Does time lessen violence or exacerbate it? Does time mitigate certain forms of\nviolence, but amplify others? If you relate representations of time to felt/spectatorial time,\nwhat is that relationship? What is the time of spectatorship, and how does that relate to\nviolence?\n\n6. Form and Content. Choose any two or three texts and make an argument about the\nrelationship between form (how the work is structured) and content (more on that in a\nmoment). You'll want to identify and focus on key formal traits--don't just list them or move\nfrom trait to trait--and analyze how they appear, how they work across the text as a whole,\n\nAt the Limit: Violence and Contemporary Representation\nGuidelines for Final Paper, p. 4\n\nhow they change or modify over the course of the work. This is an enormous topic, with lots of\npotential directions; formal traits might include: style; a certain use of editing; light; color;\nvisual composition; repetition; hyperbole; overloading or exhaustion; voice; tone; surface\nrelations; blankness (literal: whiteness; or metaphorical: emptiness); a relation to staging (of\nbodies; of representation).\nConsider how form relates to what you take to be the content of the text. This may not\nbe an easy and neat distinction. Make an argument about it: does form collude with violence\nor mitigate it? Is form how meaning is conveyed or is form the meaning of your work? (And if\nso, what does that in fact mean?)\n\n7. Is it the case that we are what we _________________?\n\ndocument?\n\ntelevise?\n\naestheticize?\n\nstylize?\n\nstudy?\nwatch?\ncritique?\n\nChoose two texts and make an argument that it is or is not the case that we are what we\n___________. You can pick your own formulation from the above, or generate your own. Make\nan argument about how you see your chosen texts posing, exploring and either answering or\nsuspending this question. Compare and contrast how each text deals with this formulation,\nand speculate on the significance of their relations or differences in how they address it. Every\npaper should address the significance of this formulation in the specific case of violent texts.\nYour conclusion should reflect on the significance of the fleshed-out formulation: what does it\nmean for that final figure (those who document; those who watch; those who study/critique)?\nWhat do we do with this formulation: does it teach us about violence? Does it demand a\ncertain adoption or refraining from some activity or gesture? Does it require a new or different\nmethod of critique or thinking or writing (about violence)?\n\nAnd, finally, you were waiting for it, right?\n\n8. What is \"violence\"? No, really: what is it? Is it, in fact, a \"what,\" or is that ontological word\nthe wrong figure to use? Is \"violence\" in another form: the who; the when; the where; the how?\nCan we only speak of violences? Is it something that resists definition? Something that\nchanges depending on critical approaches? Choose at least two texts from the last half of our\nsemester (though you could work on more if you wanted to create a taxonomy of types; we can\ntalk about this) and analyze how they define, present, trouble, complicate, etc. \"violence.\"\nThese texts can include films, novels, but also critical texts (Sontag, Scarry, etc.). Articulate\n\nAt the Limit: Violence and Contemporary Representation\nGuidelines for Final Paper, p. 5\n\ntheir definitions of violence (which you may have to extrapolate or argue for), and make a\ntight, coherent argument about how to think about \"violence\" in light of these offerings. Do\nyou want to quibble with, disagree with, totally reject, these definitions?\nYou should offer or speculate on a positive definition of violence that encompasses the\ncomplexities of the term that you want to see... do any of your chosen texts get close to that\ndefinition? If \"violence\" is not definable, are there texts that suggest just that? Every paper\nshould consider this: What does it mean for criticism to define \"violence\" or to be unable to\ndefine it? How does one begin to write about it, then?\n\n*** OR, you can design your own topic in consultation with me--\n\nIf you want to do this, go ahead and write it out as though it were a topic (you don't\nhave to have quite as many sub-questions as I like to, but give it a term/concept/topic and\ngenerate a few questions that your topic will pose). You must meet with me to talk about a\npaper topic you design on your own so I can make sure it's a fitting scope. Plan on meeting\nwith me at least a week before the paper is due; you can come to office hours or email to set up\nan appointment\n\nBe sure to remember that this is designed to let you speak to your particular intellectual\ninterests, but that doesn't mean choosing a final paper topic is a free for all. Your final paper\nmust speak, in some way, to central issues that have come up in this class, and must be about\nviolence in contemporary representation, even as you may want to problematize any of those\nterms. So, for example, \"I want to write about the history of the MPAA regulations in the late\n1960s and how Bonnie and Clyde changed the aesthetic representation of violence\" is not a\ntopic that sufficiently grows out of our class material, as it's outside of our historical era, and\ninvolves methods more appropriate to a film history course. However, \"I want to write about\nthe relationship between flat, quick, banal representations of violence and more elaborate,\naestheticized, choreographed violence, focusing on three films from our class\" is a viable topic.\n\nIf you want to put course material in dialogue with material that we haven't focused on\nin class, that's fine, but it will need to address at least one of our texts and be in dialogue with\nconceptual issues we have discussed. If, for example, you really wanted to write on \"torture\nporn\" and ultraviolent recent horror films, that's fine and we can make that possible as one of\nyour texts, and a conceptual area like pain--but you would want to contextualize that\ndiscussion in relation to certain films we watched, such as Funny Games, and you would need\nto make reference to the readings we did on pain. In short, think about your paper topic this\nway: it should start with our course material, especially that of the last third of the course; it\nshould engage films and readings we've looked at; and, if you then want to, you can go from\nthere.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper One Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/bfc62cb3213236c3299bc0e6668c3d1d_MITCMS_840F13_PrOneTopics.pdf",
      "content": "21L.435 Violence and Contemporary Representation\nQuestions for Paper # 1\n\nEugenie Brinkema\n\nNOTES:\n\nA. The period of texts for this paper is the material from the weeks on America the Violent\nand the three weeks on the Serial Killer.\n\nB. Read the packet I've given you on Scholarly Writing. Everything you need to know about\nhow to write a great paper and do well in this class is in there! Be sure you have a thesis in\nyour paper; be sure you have a strong conclusion that presses on the stakes of that thesis.\nProofread your papers; reread and polish your work before turning it in.\n\nC. Papers should be 5 pages, double-spaced, 12-point font, Times or Times New Roman.\n\nD. I am not only willing to talk to you about your papers as you work on them, I really enjoy\ndoing it and I think it's very helpful to not write your papers in solitude. So: feel free to\ncome to my office hours or make an appointment to talk. You can also always email me your\nthesis for some feedback--I can help focus it, or pose some questions to it (which you may\nwant to consider in your conclusion), or let you know it sounds good as is.\n\n* NB: I write long questions because I want to suggest all the different ways one might think\nabout a given topic. You do not need to answer every sub-question (nor could you possibly in a\n5-page paper). These are broad topics to give you a lot of flexibility in how to approach your\npaper. The numerous sub-questions are there to get you thinking about the material from\nseveral angles; you will use them to develop a narrow, specific thesis.\n\n1. America the Violent, America the Psychotic. Choose two of the following: American\nHistory X; Fargo; American Psycho (the novel). (You can also write about just Ellis' novel, if\nyou like.) Articulate your understanding of what Slotkin's argument is about the role of\nviolence in American mythology. Then make an argument about how your chosen text(s)\nsuggest their own theory about the relationship between \"Americanness\" and \"violence.\" Do\nthey agree with Slotkin, or offer their own versions of similar claims as his, or do they\nsuggest something that seems really different from Slotkin's formulation?\nWhat is the signifier \"American\" to these texts: how do they define it, and what\ntextual evidence suggests that definition? Is it a simple or complex term? Does national\nidentity mix in with class, race, gender, sexuality, or other forms of identity? What about\nthe role of history, temporality, family in relation to violence (consider both senses of that\nkey word \"generation\" in Slotkin's argument)? Does \"Americanness\" change at all over the\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 1\n\ncourse of the text? Is it something that can change or adapt or become otherwise? Invert\nthe phrase and consider each formulation: is there something uniquely violent about\nAmerica / is there something uniquely American about violence? These texts can be read as\nargumentative, even didactic: do they offer only a diagnosis of the problematic or also an\naccount of how change or another sense of national identity might be possible?\n\n2. Blankness / Nothingness. Choose two of the following: American Psycho (the novel);\nAmerican Psycho (the film); Henry: Portrait of a Serial Killer; Se7en. Or, you can just write\nabout Ellis' novel if you like. Make an argument about the way(s) in which the texts use the\nconcept of blankness, nothingness, or absence. Be sure to be as specific as possible in\ndefining your terms: blankness might be linked to gaps, omissions, ellipses, opacity,\nambiguity, avowals of nothingness, white space, missing things, illegible things, darkness,\nunrealized canvases, etc. So articulate what kind of blank or nothing you're making a claim\nabout.\nDescribe how your chosen texts deploy the figuration of blankness or nothingness\nthat you're focusing on, and make an argument about how this figure relates to the text's\ntheory of violence. Does that figure change over the course of the text? Do different media\nforms deal with blankness and nothingness in different ways? And what does this figure\nmean for reading, spectatorship, and/or critique? Does it foreclose judgment, evaluation,\nunderstanding of violence, or does it enable those modes of thought?\n\n3. The Staging of the Corpse. Choose two of the following: American Psycho (the novel);\nAmerican Psycho (the film); Henry: Portrait of a Serial Killer; Se7en. Make an argument about\nthe way(s) in which the texts/films stage, display, visualize, structure, present and represent\nthe corpse. The corpse is a specific form of the (dead, hurt, material) corpus--so it is like a\nbody, but also not quite like a body.\nDescribe how your chosen works treat the corpse (as a visual or plastic or material\nobject) and make an argument about how this staging of the corpse relates to the films'\ntheory or use of violence. How does a film's visual treatment of the corpse parallel or depart\nfrom the diegetic serial killer's treatment of the corpse? (In other words, is it the killer or\nthe aesthetic work that stages the corpse, and does it matter which is the directorial agent?)\nYou should stay focused on your chosen texts, but in your conclusion you might make a\nlarger claim about the relationship between staging (art, artifice, artificiality, presentation)\nand violence, using the corpse as a means to make a broader argument about your chosen\nfilms. The corpse is the human as a form of meat and flesh, as a form of plastic, as an object\nand artifact: does the staging of the corpse in your texts mitigate violence (aestheticize or\nsanitize it) or is staging yet another way violence takes place?\n\n4. Abnormal Normality. Unpack Seltzer's argument about the role of the normal or\ntypicality in relation to the serial killer. (You might also consider Freeland's arguments here\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 1\n\nas well.) Then choose two of the following: American History X; American Psycho (the\nnovel); American Psycho (the film); Henry: Portrait of a Serial Killer; Se7en. What is the role\nof the average, the normal, the typical in your chosen texts?\nHow do formal techniques figure the typical as typical; in turn, do formal techniques\n(saturation, repetition, exaggeration, literalization) make the typical atypical or the familiar\nunfamiliar? You should interrogate the key terms of this question: what do you understand\nnormality to mean in your chosen texts, and how does that term get figured, defined,\nnegotiated, renegotiated and upset over the course of the texts? You might want to pluralize\nthe terms and suggest how the average, normal, ordinary, typical, etc., works differently in\ndifferent texts. How does Seltzer's theorization of identity relate to violence? What is\nviolent about the normal, or what is normal about violence? Does the conjoining of\ntypicality and violence open up a space for a critique of violence in your texts?\n\n5. Reader Complicity and American Psycho. We've talked at length about different ways\nin which the reader of Ellis' American Psycho is made a part of the text, or addressed by it,\nsutured to it, bound up in it without an exit, etc. Formulate an argument about the\ncomplicity of the reader, using specific textual evidence to support your claim about how the\nreader is in relation to Ellis' novel. Or does the reader have different poles / modes of\nengagement over the course of the novel?\nWhat is the reader's \"work\" in relation to the novel: as co-doer of violence; as\nassaulted victim; as narrative agency; as detached viewer; as consumer? What is at stake in\nthinking about the reader as Bateman, as aggressor, as victim? Is complicity the same as\nrecognition or identification? Does the novel give us clues as to how it views the figure of\nthe reader (which is not necessarily the same as its own reader)? Bateman, after all, is a\nconsumer of popular culture; is he also a \"reader\" or critic of it? Is reading different from\nconsuming, or a form of it? Or do you want to redefine the question and suggest that the\nreader of this novel is not a \"reader\" in a traditional sense (making meaning, identifying,\nunderstanding, interpreting, taking a text apart, seeing underneath/behind it)? Is this novel\ndoing something affective with the figure of the reader? Boring it? Baiting it? Making it\nendure or witness something?\n\n6. Red and White and Black. Choose two of the following films: American History X;\nFargo; American Psycho; Henry: Portrait of a Serial Killer and make an argument about the\nuse of color in relation to your chosen texts. You'll want to carefully trace how color is used,\ndeployed, structured, destructured, nuanced, multiplied, staged, etc. in your films and make\nan argument for how the relation(s) of color gives us an understanding of some larger\ndimension of each film: its relation to critique; its relation to violence; to history; to\nlanguage; to bodies; to power; to racial connotations of white / black / red; etc. This is\nanother way of saying you'll explore how formal issues relate to ones of content.\nAs you analyze how color(s) appear, how they work across the text as a whole, how\nthey change or modify over the course of the work, and the specific lines, shapes and blocks\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 1\n\nthey take, you'll want to consider both color as an aesthetic or formal element and as\nrepresentations (so, for example, red as both red and as blood; or as culinary ornament and\nspilled interior of the meat of the body)... Does color undergo distortion or change over the\ncourse of each text, or do your different films use color differently? Is there a logic or\nnarrative related to color or is it linked to spectacle, excess, what resists language, logic,\nnarrative? Why would a critic interested in violence attend to color at all? You might end by\nexamining whether form colludes with violence or mitigates it. Is color relevant to how\nspectators engage with violence, trauma, disturbing forces, or is color linked to a dominance\nof style that aestheticizes, sanitizes and makes it easier to consume violent images?\n\n7. Violence, Looking, and Videotape(s). Consider and describe reflexive moments of\nvideotaping or watching scenes of violence in any two of our texts to date, and make an\nargument about how these works use embedded screens or reflexive references to mediation\nas either an agent of violence or for a critique of violence. You might think about the\nvideotape scenes in American Psycho (the film) or the famous video-rewatching scene in\nHenry: Portrait of a Serial Killer; you might also want to consider the role of videotapes in\nthe narrative of Ellis' novel, the video interviews in American History X, and even the\nfunction of watching television in Fargo. Recording is of something \"live\" to be played back\nat a later time: some of our films show the \"live\" recording; others rewatch/repeat it after the\nfact; these notions of liveness might be contrasted to a deathliness in rewatching... perhaps.\nIs there a logic to embedded scenes of videography; how is filming a victim linked\ndiegetically to violence and/or how is showing us violence through embedded filming linked\nto a critique of violence? Does putting a diegetic frame around violence make the violence\nmore violent, or more distant; does it increase the affective experience or mitigate it? Is\nwatching violence (diegetically) pleasurable or unpleasurable? Are there ways of connecting\nour spectatorial work to these scenes of people watching terrible things? (Or forced to\nwatch terrible things? Unable to look away...) Are there ways of watching filmed violence\nthat are more or less complicit with violence? How do different looks function in the texts\nyou've chosen; are there looks that undo or work against violence?\n\n8. Consumerism, Commodities, Banking. Choose one or two of the following: American\nPsycho (the novel); American Psycho (the film); Fargo; Se7en. Consider and make an\nargument about the role of capitalism, consumerism, big corporations, commodity culture,\nconspicuous consumption, or banking in relation to your texts. What is your texts' reading\nor figuration of your chosen figure of late capitalist economics? (This ranges from the literal\nappearance of banks in American Psycho and loans in Fargo to more abstract figurations\nsuch as \"consumption.\" You can take this question any direction that interests you.)\nWhat is the relationship between violence and economics, according to your chosen\ntexts? Is there a necessary or inevitable link between the economic sphere and violence, or\nis your text suggesting a more complex model? Is there any way of breaking or undoing or\nchallenging that relationship according to your texts? What does it mean to make a system,\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 1\n\nabstraction or collective (such as \"capitalism\" or \"corporations\") the agent of violence?\nWhat critical problems arise in relation to that claim? Likewise, your chosen text(s) may\nwell still focus on a singular protagonist or representative of an entire system: what is the\nrelationship between individuals and the economic critique your texts are positing?\n\n9. The Real, Realism and Expressionism. Consider and make an argument about the\n\"real\" in relation to two of the following texts: Fargo; American Psycho (the novel or the\nfilm); Henry: Portrait of a Serial Killer; Se7en. What is function of discourses of \"the real\" in\nyour texts (real places, real histories, real objects, real people)?\nOr, in turn, you could consider realism. The real is different from realism, which is an\naesthetic meant to evoke or replicate our ordinary world: how do your texts (especially if\nyou've chosen to write on Henry, Se7en or the film of American Psycho) deploy a realist\naesthetic? Relatedly, how do they deploy the opposite: an expressionist aesthetic (marked\nby self-conscious stylization, notable aesthetics, and a distorted view of bodies/the world)?\nConsider Freeland's argument in your analysis. How is violence differently negotiated by a\nrealist vs. expressionist aesthetic?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper Two Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/b1a9d3c4f37cce9aa772b78e5075796f_MITCMS_840F13_PrTwoTopics.pdf",
      "content": "21L.435 Violence and Contemporary Representation\nQuestions for Paper # 2\n\nEugenie Brinkema\n\nNOTES:\n\nA. The period of texts for this paper is the material from weeks eight through ten (White\nMasculinity; Girls/Women/Psychic Assault; Sex/Desire/Fragmentation).\n\nB. If you haven't already, do read the packet I've given you on Scholarly Writing.\nEverything you need to know about how to write a great paper and do well in this class is\nin there! Be sure you have a thesis in your paper; be sure you have a strong conclusion\nthat presses on the stakes of that thesis. Proofread your papers; polish your work.\n\nC. Papers should be 4-5 pages, double-spaced, 12-point font, Times or Times New Roman.\n\nD. I am not only willing to talk to you about your papers as you work on them, I really\nenjoy doing it and I think it's very helpful to not write your papers in solitude. So: feel\nfree to come to my office hours or make an appointment to talk.\nYou can also always email me your thesis for some feedback--I can help focus it,\nor pose some questions to it (which you may want to consider in your conclusion), or let\nyou know it sounds good as is. If you have any questions about my feedback on your first\npaper, please just ask.\n\n* You do not need to answer every sub-question (nor could you in a focused 4-5 page\npaper). These are broad topics to give you a lot of flexibility in how to approach your\npaper. The numerous sub-questions are there to get you thinking about the material\nfrom several angles; you will use them to develop a narrow, specific thesis.\n\n1. Splicing and the Cut. Pick one or two of the following: Fight Club (the novel); Fight\nClub (the film); Frisk. Consider and make an argument about the figure of splicing or the\ncut--you should articulate your sense of what that figure is, means, or does--in relation\nto your chosen text(s).\nSplicing involves conjoining the disparate, so it's a figure of unity and difference at\nonce. You can be literal or metaphorical here; this can be an aesthetic problem, a bodily\nproblem, a structural problem, and so forth--just be clear about how you're writing of the\nfigure. Splicing might be a material gesture, one linked to media like photography or the\nediting in cinema (Tyler's nighttime repasts); it might be a violent gesture, linked to\ninterruption, intermittency, or fragmentation (as in Cooper). At minimum, it involves\nconjoining the separate, which means it's a figure that troubles the relation between unity\nand dehiscence. You may want to speculate in your conclusion on how splicing affects or\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 2\n\nrelates to critical approaches to your chosen text(s); do we have to read or approach the\nsplice in a specific critical manner; what splices into criticism, or, by contrast, does\ncriticism conjoin or suture over such rends?\n\n2. Men and Women and Rape. Pick one or two of the following: Frisk; A ma soeur;\nAudition. Consider and make an argument about the figure of rape in relation to your\nchosen text(s)--you should articulate your sense of what that figure is, means, or does,\nbecause you may want to take rape as a broad figure of forced insertion/penetration, as a\nscene of unspecified sexual assault, or as a more literal figuration. But several of these\ntexts pose the question, \"What is rape, actually?\", so the figure is quite complex and you\nshould articulate how you're defining/figuring it.\n\nConsider not only how your text(s) represent or depict rape (visually, formally,\nnarratively, linguistically) but also how the (con)text for those scene(s) suggests a reading\nof rape. Do these films self-analyze or articulate a critique of how they represent (or\ndeploy, or use, or theorize) rape? Does rape stand for a logic of something else\n(seduction; desire; familial love) taken to its extreme? Is rape the \"worst\" form of violence\nin your chosen text(s); does it have a kind of violent specificity, or is it \"just another form\nof assault\"? I strongly recommend considering in your conclusion: What are the critical\nimplications of diegetic/narrative contestations over rape? (In other words, what are the\ncritical implications of \"rape\" being a contested site within a text?)\n\n3. Time and Deferral. Compare (and contrast, and complexify) the relation between\ndeferral and duration in Audition and A ma soeur. Both films have very interesting\nnarrative structures, and one could argue (many have argued) that both defer or put off\nthe scene(s) of their most infamous violence. Do you agree? Disagree? Want to quibble?\nDo we have to define violence in a certain way to see it as deferred?\nNo matter how you negotiate the above questions, in your essay you should make\nan argument about how the temporal form of each film relates to violence, and you\nshould articulate an explicit, theorized relationship between the \"early\" parts of each film,\nand the \"later\" or \"final\" parts. Do you agree that violence is deferred to the end, or do\nyou see strains/traces of it earlier in the work? What is the spectatorial effect or\nconsequence of the formal logic for which you are arguing? How does this understanding\nchange on (re)viewing the texts (something you should absolutely do for this paper). Can\nyou speculate on the broader relationship between deferral, duration and violence? How\nwould the films have been different with a different formal relationship to time and\nnarrative?\n\n4. Words, words, words. Consider the role of talking, language, negotiation,\npersuasion, confession (and so forth) in one or two of the following: Fight Club (the\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 2\n\nnovel); Frisk; A ma soeur. Articulate how you take language here: as tone or sound, as\nbodily speech, as narrative, as a form of too-much- or not-enough-ness, as rhetoric\n(persuasion), as confession or revelation, as full or as empty, as truth (for deception, see\nquestion #5, below).\n\nMake an argument about the form, function and role of words, language, oral\ndictates, speaking (and the speakable/unspeakable), rhetoric (however you focus this\ntopic) in relation to your chosen text(s). What kinds or pluralities of language-forms and\n-functions do you read in your text(s). How does language appear: as too-much, as not-\nenough; as meaning, as failures of or gaps in meaning; as seduction/persuasion; as logic\nor as emotion; as grotesque and empty or as exciting or bland? Every essay should make\na connection between language and violence: is language the vehicle for violence (its\nmedium; how it is transmitted)--and, if so, what are the consequences of that for readers\nor spectators? Is language the cause of violence; is language the consequence of violence?\nDoes language promote or amplify violence or mitigate or calm it? Consider the\nimplications for your own form of criticism on your chosen text(s), which is itself another\nproduction of more words, words, words...\n\n5. Lies, lies, lies. Choose two of the following: Fight Club (the novel); Fight Club (the\nfilm); Frisk; Audition; A ma soeur. Analyze and make an argument about the figure of the\nlie, betrayal, bent truth, partial truths, revelations of previous deception--and articulate\nhow you're approaching this figure--in relation to your chosen text(s). Who (is lied to;\nthis is not always obvious); how, where, when and in what way does it take place in your\nchosen text(s)? Definitely consider whether (and if so, how; if not, what then) the reader\nor spectator is told the truth or told forms of lying. Is every lie always a betrayal? Can a\nlie also every reveal a truth? Are some lies worse (or more violent, or more linked to\nviolence) than others?\nYou may want to consider: What is the temporality of the lie: does it matter when\nit's revealed to have been a lie? What do you make of your text if it troubles the neat\nbinary between truth and lie: where is that distinction made impossible to determine?\nHow do different texts lie: i.e. a novel versus a film? I strongly recommend considering in\nyour conclusion the critical upshot of your argument about how your texts navigate this\nterrain; specifically: What is the consequence of how your texts grapple with figurations\nof the lie for a critical reading of violence in your chosen text(s)?\n\n6. The child. Working with Frisk or A ma soeur (or both), consider and make an\nargument about violence and the child. What is the signifier \"child\" to your text? How\ndoes that get permuted or modified over the course of the novel or film (does the \"child\"\ncome to be or represent new/different things, or is that status solidified, essentialized\nover the course of the text)? Is the child a figure of guilt or innocence (and whose guilt or\ninnocence)? Is the child a form of time (new time; future time; corruptible time;\n\n21L.435 Violence and Contemporary Representation\nQuestions for Paper # 2\n\nirrecoverable time)? Is the child a figure in a family, in other words a relational figure, or\nis the child its own independent thing?\nConsider how the child relates to violence (agent of, cause of, provoker of, victim\nof, witness to, field for thinking about...)? We'll stipulate that violence against a child is a\nparticularly powerful, strong cultural taboo: how do your texts deploy that, formally, in\nrelation to the reader/spectator? Is violence against or with or in relation to the child\nmeant to conjure negative affects: shock, disgust, horror, terror, revulsion, anxiety, etc., or\nmore positive/recuperative forms: empathy, pathos, affection, love, tenderness?\n\n7. The Trace/the Scar/the Mark -- Choose two of the following: Fight Club (the novel);\nFight Club (the film); Frisk; Audition. Analyze and make an argument about the figure of\nthe trace, the scar, the (birth)mark--and articulate how you're approaching or limiting or\ndefining this figure--in relation to your chosen text(s). What is the relationship of the\ntrace or scar or mark to time, to history, to meaning (or non-meaning), to\nwriting/inscription, to legibility (or illegibility)? What is its relation to love, erotics,\nintimacy, closeness? How is it made in each work (i.e. how does it come into being)?\nAnd, above all, what is the relation of the trace, scar, or mark to violence: is it something\nthat makes violence comprehensible or marks it as incomprehensible?\nYou may want to consider: Is it something that enables violence to circulate\namong or for forming communities (is the scar seductive; does it recruit figures to\nviolence) or, rather, is it something that posits separation and difference? Are these\nmarks giving us a theory of the body? As a form of truth? Or as deceptive? Is the\nphotograph a kind of scar or mark? Or are specific media forms within your texts scarred\nor marked, as though they too were a body? What is the consequence of how your texts\ngrapple with figurations of the trace/scar/mark for a critical reading of your chosen\ntext(s)' theories of violence (as destruction or creation? As undoing or as additive? As ugly\nor as beautiful? --You can take this in many directions...)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Guide to Scholarly Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/b52fb238fc24b1aef7900ae5098cb170_MITCMS_840F13_GdeToSclyWtg.pdf",
      "content": "Eugenie Brinkema; Updated 2011\n\nEB's GUIDE TO SCHOLARLY WRITING\n\nThis packet contains:\n\n1. Tips for How to Do Critical Reading\n2. General Comments on Papers\n3. Literature Faculty Policy on Plagiarism\n4. What is Scholarship?\n5. Common Errors and Solutions\n6. Citation Guidelines\n7. Mechanical Errors to Avoid\n8. A FAQ\n\nI. How to Do Critical Reading\n\nCritical reading is...\n\n...reading for more than the plot.\n\n...necessary for understanding course material in depth and for writing strong papers.\n\n...a skill that can be taught, practiced, developed, and improved upon -- it is learned!\n\nYou should ask of any piece of writing:\n\n1. What is the author saying explicitly? What is the author saying implicitly?\n2. What is the author not saying?\n[The unsaid of a text often being the most important part.]\n3. With whom is the author in dialogue (again: explicitly or implicitly)?\n4. What is the author's methodology? What kinds of structures are used: logical syllogisms,\nmetaphor and simile, appeals to science or reason, etc.?\n5. Where do I think the author is right? And where do I think the author is wrong? (Why?)\n[This question is not a matter of opinion but an examination of where the\nargument goes astray, oversteps, is illogical, is contradictory, etc.]\n6. Under what assumptions is the writer operating? What perspectives are taken for\ngranted?\n7. From what position (authoritative, internal, meta-) is the author speaking?\n8. What sort of reader is assumed, implied, or addressed?\n9. What are the implications of the text's position? What's really at stake here?\n\nSuch a list could--and your own list will--go on and on. The point is this: this sort of reading\nis active, questioning, and intense. It is meant to forge a relationship between you--as\nreader--and the text and/or author.\n\nNow for practical tips:\n\n1. Read slowly--don't skim. At the same time, don't read so slowly that you get lost in the\nlanguage of any one sentence. Try to figure out the main points on a paragraph-by-\nparagraph level. It is to be expected that texts will have to be read twice, or more. That is\nnot a failure or an indication that you're not getting the material; quite the opposite. I like\nto use a three-part system for my first read-through of a text (though yours may differ): I\nscan a text before reading it to see if there are subheadings or specific indications about\nthe development the argument will take. Then, I read in depth, taking notes, indicating\nimportant passages, writing questions in the margins. Finally, I go back and reread the 2-3\nmost important sentences, paragraphs, or sections.\n\nEugenie Brinkema; Updated 2011\n\n2. Use some sort of note-taking system. You probably have one--checks, exclamation\npoints, colored pencils, a separate sheet for marking interesting quotes. It doesn't matter\nwhat the system is, only that you find one that works for you, and allows you to come into\nclass days after reading something and remember what struck you at the time. Critical\nreading includes critical viewing: screening notes are very important as both a cause and\nrecord of active thought during the films for this class.\n\n3. Read with an eye towards making distinctions: not everything in a text is equally\nimportant (to you or to the author). Again: don't skim. In part, on your first go-through\nyou won't necessarily know what's important; and, sometimes the throwaway example or\nhidden sentence is the most interesting part of a text! But, at the same time, start to\npractice creating hierarchies from the mix of conceptual foundations, background\ninformation, examples/illustrations, digressions, and ultimate implications in any writing.\n\n4. Try, if possible, to constantly put the author's words into your own. You might especially\npay attention to the central point or argument in which she is participating, and the\nimplications of the argument at hand. If you can step away from an article and put the\nauthor's argument in your own words, you are in great shape. This is also largely what we'll\nwork on in class with abstract theory--working with it and rephrasing it to make sure that\nwe understand it deeply, not simply that we can repeat phrases from the text.\n\n5. Keep track of questions you have while reading! This is important: don't just skip over\ndifficult passages. Slog through them and mark them to bring up in class. Intellectual\ncuriosity is a fantastic thing--the best critical readers are constantly asking questions of\nthemselves and of any text.\n\nII. General Notes on Papers\n\n- Read the paper topics carefully: you don't have to address every subtopic or sub-question, but\nthe topics will indicate what you must cover. I provide you with a lot of sub-questions in order to\ngive you many avenues for thinking about course material. If you don't know where to start with\na topic, brainstorming answers or thinking about these sub-questions should help. Again, though,\nyou will not answer all of them, and your paper should remain focused.\n\n- You should rewatch films about which you write, the same way you'd reread passages from a\nnovel or theoretical article.\n\n- Papers are due in hard copy in the folder on the front of my office door. The deadline\nfor papers is firm: they will be lowered half a grade for each day that they are late. If you are in\nexceptional need of an extension, talk to me early and be prepared to make your case. In general,\nthough, as papers address specific sections of our course material, it's important to finish them on\ntime so you can turn your attention to new conceptual areas and material. In turn, however, my\nresponsibility to you is to turn these papers back as quickly as possible so that you can think\nabout how to improve for your next assignment and meet with me to discuss those adjustments.\n\n- Finally, remember to think and write about the texts for this class in the manner in which we\nanalyze them in our seminar: in other words, as readers and thinkers in the humanities. Be careful\nnot to slip into other discourses in your papers: for example, you would not want to produce a\nsociological analysis of violence or talk about cognitive science and what it suggests about shock.\nYou want to stay focused on reading the films, novels, and theoretical articles. You will want to\nthink about textuality; affect; visual and narrative form; style; aesthetics, ethics, and politics;\nmeaning (and non-meaning); etc., and keep interrogating the theoretical terms we've explored.\n\nEugenie Brinkema; Updated 2011\n\nIII. Literature Faculty Policy on Plagiarism\n\nPlagiarism--the use of another's intellectual work without acknowledgement--is a serious\noffense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in\nthe subject, and that the instructor will forward the case to the Committee on Discipline. Full\nacknowledgement for all information obtained from sources outside the classroom must be\nclearly stated in all written work submitted and in all oral presentations. This includes images or\ntexts in other media as well as materials collected online. All ideas, arguments, and direct\nphrasings taken from someone else's work must be identified and properly footnoted. Quotations\nfrom other sources must be clearly marked as distinct from the student's own work.\nFor further guidance on the proper forms of attribution, consult the style guides available\nin the Writing and Communication Center http://humanistic.mit.edu/wcc, and the MIT Website\non Plagiarism located at: http://web.mit.edu/writing/Special/plagiarism.html\n\nThe above is the official policy of the Literature Department. This is my addendum to it: this\nis not a research class where you are expected to seek out secondary sources; the only quotations\nin your papers should be from our primary texts, which is the material on our syllabus (things like\nfilms, novels, criticism, theoretical essays). You will primarily be engaging in close readings,\nargument and analysis, and theoretical speculation. There are a lot of materials out there on the\ntexts on which we are working--I would advise you not to consult them, as wikis, imdb.com, and\ninternet postings are notorious for banalities if not errors. If you have a sincere question about\nhow to use a material--whether paraphrase needs to be cited, or how to reference information\nthat is not yours, but encountered in a footnote or some such--just ask me: teaching you how to\ncite materials is part of my job and I'm happy to talk about any writing matters. Likewise, if you\nwant to read more theoretical or critical work on an area, I'm happy to recommend authors and\neven specific texts. But you must cite all material that you did not originally create. The vast\nmajority of plagiarism cases results from a dangerous combination of stress and procrastination\nthat turns over into desperation. Do not do it. The zero tolerance policy is real.\n\nIV. What is Scholarship?\n\nYour papers for this class are scholarship. They are not film or book reviews, nor should\nthey consist of plot summary--they are analytical scholarly papers supported by close analyses of\nliterature and visual texts. This is the standard by which they will be judged, but I don't presume\nthat you already know what this means, so I am going to talk a bit here about what scholarship is\n(and isn't).\n\n1. Scholarly writing takes the most general form of a dialogue--your paper is in conversation\nwith the academic writing that came before it, and you should position your work in relation to\nthose other texts. (*In general; see the starred point below.) The most general form this takes is\noften referred to as the \"They say, I say\" model. In other words: \"Freud says X about das\nUnheimliche, but I say Y [because...].\" Or \"While Rony and Young argue A, B, and C, I say D, E,\nand F [because...].\" The best scholarly writing not only identifies differences as the conversation\noccurs, but always also elaborates on the significance of those differences. The \"They say, I say\"\nmodel is ideally not an example of what Freud called \"the narcissism of minor differences\"--\nrather, it should be a significant statement of difference. That is not to say that you can't agree\nwith the theorists about which you're writing: \"They say, I say\" can also be used to apply a theory\nin new ways, to complicate it or pose questions to it, or to defend a principle using new or\ndifferent evidence. The very fact that you--and not someone else--is writing your paper should\nmean that there is always an \"I say\" in there. (And yes, you can write \"I will argue\" or \"I claim.\")\n* Even if your essay focuses on primary source material, and you are not engaging with\nsecondary interpretations of the texts, this dialogue can be made implicit. For example:\n\nEugenie Brinkema; Updated 2011\n\n\"Although the shower scene in Psycho seems to align violence with the cinematic apparatus\nthrough editing that cuts up the image, I want to argue through a close reading of Arbogast's\nmurder that violence is more spectacularly rendered in the film through continuous, uncut shots.\"\nThat \"although\" with which the sentence begins suggests how your argument might have gone\notherwise or a claim someone might make about a text; just an acknowledgement of that presents\nyour work in the context of a dialogue.\n\n2. Scholarly writing has a thesis. A thesis is an argument, which means that someone could\ndisagree with your paper's central claim. So, for example: \"Citizen Kane is organized as a mystery\naround the detection of the meaning of the word 'rosebud'.\" is not a thesis. It's a statement of\nreasonably verifiable truth. Few (if any) people would ever disagree with this statement; if they\ndid, you'd wonder if they had seen the film. However, \"Citizen Kane is structured around the\ndetection of the meaning of the word 'rosebud,' which makes it appear as though the obsession of\nthe film is a problem of missing knowledge about an object; in fact, however, I will argue that the\nediting and camerawork of the final three scenes suggest an indifference to the meaning of that\nword. Furthermore, I will conclude by suggesting that the missing knowledge that does organize\nthe film is not about the meaning of a word but about the status of maternal love, an absent\ncertainty that is never resolved in the film.\"--That's a thesis. Someone could disagree with it and\nargue otherwise. And, thus, the conversation could continue. That's the thing: the first point\nabove about what scholarly work is, and this point about needing a thesis--they're related.\nBecause the only way that scholarly conversation can continue is if people risk making arguments\nwith which other people can conceivably disagree and debate. A good thesis always takes such a\nrisk: it makes a claim against which others might argue. (The very best papers, in fact, will build\nthis structure into the argument, anticipating counter-arguments and then arguing against them\nwith support, or even accommodating evidence to the contrary of an argument, while still\ndefending the broader strength of the central claim.) You have to take such a risk to write a good\nscholarly paper. I will be looking for it in everything you write this semester.\n\n3. Scholarly writing uses evidence to support a paper's central argument. That evidence varies by\ndiscipline, but for this class you should be using close textual analysis as evidence to support your\narguments. That is, you will be closely analyzing literary and media texts, and your evidence will\nvary but likely include quotations from literary texts, in addition to paraphrased arguments,\nattention to the language and/or logic used, and observations about large-scale textual structure.\nThe second kind of close textual analysis you will be performing is of films, and this kind of close\nanalysis is a bit trickier than with the literary texts. Writing about visual media always involves a\nsort of translation: you can quote directly from Homer or Shelley, but without frame stills, you\nare always writing about (in other words, around) a film text. Some film theorists (Raymond\nBellour) even call the cinematic object about which one writes \"a skeleton,\" even a dead or\n\"unfindable\" text (a missing text). You will have to find a way to talk about the films, paying close\nattention to the things on your \"How to Watch a Film Handout\"--the visual, aural, narrative,\nideological, etc. dimensions of the film. You don't have to (and shouldn't) talk about all those\naspects every time; you will edit and choose from your notes to find the evidence most relevant\nfor the argument at hand. But when you make a claim in this class, this is how you should support\nit. This is also why taking really detailed screening notes is so important--they are the equivalent\nof the thoughtful marginalia on a marked-up page.\n\n4. Scholarly writing has a conclusion that presses on the implications of proving the thesis. In\nother words, let's say, from above, that you do indeed demonstrate through close analysis and\nlogical argumentation that Citizen Kane gives us one missing thing in order to distract from the\nmore ephemeral, but infinitely more important, missing maternal affect. You now have to answer\nthe charge posed by the most difficult reader you can imagine, the one who gets very close to your\nface and demands, \"So what? Why should I care that you proved your argument? What does it\nmatter?\" You must answer this feisty reader. It is never enough that you are writing for an\nassignment; your scholarly work should have something intellectually and personally at stake.\n\nEugenie Brinkema; Updated 2011\n\nYour conclusion should talk about the significance of your thesis being correct--this can\ninvolve new questions that now must be posed (which you may or may not start to answer\nyourself), or new complications that arise, or new directions scholarship could take your\nargument. A strong conclusion might press on or tease out the larger implications of your\nargument. Let's say you make an argument about time in narratives about heroic figures: that\nmight give you a ground for talking about temporality and finitude; about whether time erases or\npreserves heroic deeds; about ways that time itself makes figures seem heroic; the way heroism\nitself involves a relation to time (an overcoming of it, perhaps); the way temporal forms in the\norganization of plot in relation to story change our perception of heroism over the course of the\ntext; or any number of other concerns. What might make another reader care about your thesis\nas much as you do? Without gesturing at those questions, your paper is a mere exercise; with\nsuch gestures, however, your work becomes important, original scholarship about which other\nscholars will care.\n\n5. Scholarly writing is readable. That means it is free of grammatical or spelling problems; it\ndevelops a logical and coherent argument, wherein each sentence flows to the next, and each\nparagraph builds on the previous one; and it has a compelling and necessary conclusion that\nbroadens the concerns of the essay. It uses correct citation form--which means the author's last\nname and a page number for each quotation; for example, (Brinkema 5) or (Ellis 334)--and it\nparaphrases correctly where needed. Your paper topics are large, sometimes with several sub-\nquestions. You don't have to touch on every subtopic, but you should pay attention to what the\nquestion directs you to focus on. One way to keep your papers concise and focused is to have a\nnarrow, specific thesis. Make one strong argument instead of a series of claims, each of which\ngets less space than it deserves. Second, avoid plot summary at all costs. Assume I know the\ntexts about which you are writing. Learn to paraphrase well: it shows me that you understand the\nmaterial well enough to rephrase it, and it also takes up much less space than lengthy quotations.\nWhen you're doing a close reading, cut it down ruthlessly to the bare minimum necessary to make\nyour point; the evidence should, every time, be in support of the argument for which it is\npresented. Long sentences and long papers are often meandering thoughts trying to find an\nobject; that's fine in a draft and an important part of thinking through complex ideas. But in a\nfinal paper, be specific and concise and get right to your central points.\n\n6. Finally, scholarly writing should also, at its best, be exciting, interesting, and compelling. You\nshould think about your writing as writing--all writing is creative. Scholarly writing has no ideal\nor perfect form. Forget structures like \"the 5-paragraph essay\" or rules like \"Your conclusion\nshould restate everything you've said in your paper.\" Feel free to use the first person; there is a\nclear \"I\" making your argument, so use it. Every paper will follow an organic and logical\ndevelopment of its central thesis. And the words you choose, and the phrasing you choose--its\nrhythm, its pacing--will all affect how your work is read. Consider going to the Writing Center\nto workshop your paper before it is due. They offer one-on-one consulting and meeting with\nthem will inevitably make your work stronger (http://writing.mit.edu/wcc). At minimum, you\nshould reread your papers several times before turning them in--proofreading, yes; but also\nediting, changing, refining, modifying, continually improving your work. Ask questions back to\nyour papers; think like a reader. Thinking and writing are not separable, which means that clear,\nrigorous, deep thinking will be reflected in a paper that is clear, rigorously argued, deep, and also\nexciting, interesting, original, provocative, and compelling.\n\nYour papers for this class are scholarship, as I wrote above. They should cover material that is\ninteresting to you, make claims in which you really believe, and be the very best examples of your\nthinking and writing. This is the standard to which I hold my students, but I will also make every\neffort to help you achieve these goals--so come talk to me early and often, in office hours or by\nappointment, if you would like to work on your arguments or papers together.\n\nOne final note: enjoy the process. As scholars, your job is to think. It's a good way to\nspend one's time. I look forward to seeing the outcome.\n\nEugenie Brinkema; Updated 2011\n\nV. Common Errors and Solutions\n\nFour common writing errors / and their solutions:\n\n1. Problem: Vagueness or speaking too broadly\nSolution: Have a strong, concrete, narrow, specific thesis. Keep your focus on this\nargument throughout the paper. Reread your introductory paragraph after you've finished writing\nthe conclusion to make sure you end up arguing what you said you were going to argue.\nOutline or plan your paper before you start writing or try making a reverse outline: after\nthe paper is done, create a quick map of its structure and see if that overall shape makes sense.\n\n2. Problem: Mechanical Errors\nSolution: Proofread and edit well. Don't finish the paper so close to the deadline that you\ncan't reread it at least once to make sure it's clean and error-free. We all write sloppy emails from\ntime to time, but a formal paper is a different beast. (Academics find their articles are not\naccepted at journals if submitted with punctuation or spelling errors, for example. Graduate\nschool applications are routinely eliminated due to writing errors in the personal statement.)\nI have never given an A to a paper with more than one really obvious spelling mistake: it\ntakes little time and effort to polish a paper in this way. Proofreading is a way of representing\nyour ideas well; you might think of it as a matter of intellectual self-respect.\n\n3. Problem: Thinness of Logic\nSolution: Acknowledge counter-arguments or evidence against your thesis, and\nrespond to hypothetical claims (account for textual details that contradict you). It can be\nespecially useful (and interesting) to do this in a conclusion: now that you've proven your\nargument, you can consider any problems/holes/quibbles/complications with it, and start to\nanswer those as a way of broadening your concerns and giving your argument credibility.\n\n4. Problem: No Impact/Weak Conclusion\nSolution: Answer the \"So what?\" question that justifies and ties together all of your analysis\nand makes your reader care about the essay's argument. Keep the big picture in mind at all times:\nwhat is at stake in demonstrating your argument. What kinds of new questions or issues does it\nraise or allow us to now think about? A paper is shaped like an hourglass: it starts with a broad\nproblematic, moves towards a thesis (the most \"narrow\" part of the paper), builds up again with\ntextual evidence, adding more and more evidence and analysis, and coming to the conclusion,\nwhich is broad again and addresses wider or larger concerns.\n\nFive common media studies errors / and their solutions:\n\n1. Problem: Ignoring media specificity\nSolution: Don't treat film like a purely narrative art form or a purely visual art form.\nTake account of a medium's totality and specificity--use the language and ideas specific to your\nmedium. Your screening notes will be helpful for identifying specific shots, scenes, visual traits,\nsonic traits, formal/structural/temporal traits, and narrative issues that are important in your\nchosen film.\n\n2. Problem: All Plot Summary\nSolution: You don't need to summarize the plot or recount every detail for your\npapers--assume I know the texts about which you are writing. If your retelling of plot is\nimportant, focus on significant sections only and contextualize why that redescription matters.\nSpend most of your time on argument and analysis.\n\nEugenie Brinkema; Updated 2011\n\n3. Problem: Not Understanding the Assignment\nSolution: There are many ways of analyzing media, and the entire process--the notes\nyou take, how you pare them down, the thesis you posit, the evidence you use--will depend on\nwhether you're writing a close analysis of a short scene, an ideological analysis with reference to\ntheory, or a historical analysis of one director's work. Read the assignment carefully. Be sure you\nare clear on the kind of analytic, critical-theoretical, close-analysis type of assignment I'm looking\nfor here.\n\n4. Problem: All Observation\nSolution: Make sure to tie your observations into your argument (Why does the\nlighting matter? How is your argument supported by specific textual workings?). Don't summarize\ndetails as though you were transcribing your screening notes--make your observations support\nyour thesis. (It's difficult, but you will do yourself a favor if you learn to leave out observations if\nthey do not support your main point. Editing is not just for late in the writing process--omitting\nirrelevant, even if interesting, observations makes for a clearer argument and paper.)\n\n5. Problem: Essentializing\nSolution: Don't essentialize formal observations. (E.g., a high angle shot sometimes\nindicates a position of mastery, but not always. The color red may signify anger or rage, but not\nnecessarily.) Pay attention to the specific workings of any specific film text, and don't assume a\nuniversal or consistent palette of meanings. Instead, offer analysis to support your claim that X\nimplies or produces Y in a specific shot, scene, text, genre, etc. Context matters! Look for\npatterns, repetitions, structural logic, etc.\n\nVI. How to Cite Materials:\n\nUse parenthetical citations in the body of your paper. Normally, those citations include\nthe author's last name and the page number from which the quote was taken. However, omit the\nauthor's last name when you use it in the text. For example:\n\nBrinkema says that all college students should study horror films (5).\nBrinkema argues, \"It would be a travesty to leave college having never studied horror films\" (5).\nSome instructors even contend that \"it would be a travesty\" to graduate from college bereft of\na rigorous horror education (Brinkema 5).\n\nIn his paper on how horror films disturb the sleep of college students, Smith derides\nBrinkema's seemingly hyperbolic claim that \"It would be a travesty to leave college\nhaving never studied horror films\" (qtd. 10).\n\n--In other words, in the last case, Brinkema is quoted on page 10 of Smith's article. Since\nBrinkema and Smith are named in-text, only the page is needed, but as it's a quote from a person\nother than the article writer, you use \"qtd.\" and the page number.\n\nOr, if Brinkema were not named in the text, it would look like this:\n\nIn his paper on how horror films disturb the sleep of college students, Smith argues against\nthe position that \"It would be a travesty to leave college having never studied horror films\"\n(Brinkema, qtd. 10).\n\n- Footnotes or endnotes should be used sparingly and for explanatory or extra information that\ndistracts from the flow of your paper's main argument--not for citations. You can use footnotes\nif you have \"extra\" information to offer, but you don't have to have them in your papers at all.\n\nEugenie Brinkema; Updated 2011\n\n- Finally, after your last paragraph, move down to a new page and start a Works Cited list.\n\nIt will look like this:\nWorks Cited\n\nArbus, Diane. Diane Arbus: An Aperture Monograph. Ed. Doon Arbus and Marvin Israel. New\nYork: Aperture, 1972.\nBonitzer, Pascal. \"Hitchcockian Suspense.\" Everything You Always Wanted to Know About\nLacan...But Were Afraid to ask Hitchcock. Ed. Slavoj Zizek. London: Verso, 2000.\nCixous, Helene. \"Castration or Decapitation?\" Psychoanalysis and Woman, a Reader. Ed.\nShelley Saguaro. New York: New York University Press, 2000.\nDadoun, Roger. \"Fetishism in the Horror Film.\" Fantasy Cinema. Ed. James Donald.\nLondon: British Film Institute, 1989.\nDeleuze, Gilles. Cinema 2: the Time-Image. Trans. Hugh Tomlinson and Robert Galetta.\nMinneapolis: University of Minnesota Press, 1989.\nFreud, Sigmund. \"The Uncanny.\" Writings on Art and Literature. Ed. Werner Hamacher and\nDavid E. Wellbery. Fwd. Neil Hertz. Stanford, CA: Stanford University Press, 1997.\n\nThe entries are alphabetical by last name. They include author name, article or book title, title\nof anthology if it's an article from one, place of publication, publisher, and date of copyright.\nNormally, you would do this for every entry, but if it's from an article we read and you don't have\nall of the information at hand, you can just do author's name, title of article, title of anthology (if\nindicated) and year of publication. However, for outside reading, you must provide full entries.\nYou do not need to put films in your list of works cited.\n\nVII. Common Mechanical Errors:\n\nThese sorts of errors make it difficult for any reader to follow your argument, so you need to learn\nto avoid them through scrupulous editing.\n\n- it's v. its: the former means \"it is\"; the latter is possessive (*It's* a cold day today. Look at\nthe snowman: *its* nose is frozen.)\n\n- then v. than: the former is sequential or causal; the latter is comparative (I went to the\nstore, *then* to the bank. If all men are mortal and Socrates is a man, *then* Socrates is\nmortal. I like Socrates more *than* you do.)\n\n- their v. there v. they're: the first is possessive, the second is about place, the third is a\ncontraction for \"they are\" (I went to *their* party; it was weird. When I got *there,*\neveryone was standing on their heads. *They're* all nuts.)\n\n- effect v. affect: almost always, the former is a noun, the latter a verb (\"What are the effects\nof watching TV?\" \"I don't know; it probably affects us a lot.\"). \"Affect\" as a noun\ngenerally means emotions or feelings.\n\n- Don't use single quotes, except when you are quoting within a quote: \"'Hi,' she said.\"\n\n- No contractions in formal papers! In the professional or postgraduate world, you will\nnever go wrong being on the formal side of things.\n\n- Article titles should be put in quotes (and not italicized or underlined): \"Critique of\nViolence\". Book titles and film titles (Psycho) should be underlined or italicized (but not\nboth; italics are better).\n\nEugenie Brinkema; Updated 2011\n\n- \"Modern\" is a specific historical time period (its boundaries are debatable). Current media\nis referred to as \"present-day\" or \"contemporary\" (or \"postmodern\").\n\n- Possessives need apostrophes. For example: viewers pleasure. That's incorrect. If it's one\nviewer, it should read \"viewer's pleasure\", or, if you're talking about several viewers, it\nshould read \"viewers' pleasure.\"\n\n- Avoid ending sentences or clauses with prepositions (in, of, to, from, with, etc.)--you want\nto move that word earlier and add \"which\" or \"whom\"... So: instead of \"You are the person\nI'm fond of\", you should write, \"You are the person of whom I am fond.\" Or, instead of\n\"That is the book I read a lot of\", you should write \"That is the book of which I read a\nlot.\" It may sound stilted, and there are exceptions to the rule for its use, but it is correct,\nand for good reason--think about the order in which you get information in the correct\nversion: those prepositions tell us crucial information about the object of the sentence\n(\"That is the building I jumped from\" is a very different sentence from \"That is the\nbuilding I jumped to\"), and should therefore be given to readers early on in a sentence.\n\n- Commas and periods go inside quotation marks. Other punctuation goes outside the\nquotation marks, unless part of the quote itself. Sentence punctuation goes after the\nparenthetical citation. For example:\nFreud writes, \"The Uncanny is that class of things...\" (32).\nFreud writes, \"The Uncanny is that class of things...\" (32); this suggests that...\n\nVII. Frequently Asked Questions (and a few answers...)\n\nHow do you Grade?\n\nI have high standards for all of you, and over the course of the semester, we'll work together to\nimprove your analytical reading, thinking and writing. So wherever you start, know that it is not\nonly possible but likely you will improve, especially if you come talk to me about my comments so\nthat the next paper is stronger. I take MIT's definition of grades seriously, and there is no grade\ninflation in my classes. I don't think it does you any favors to artificially amplify grades; if you get\na high mark in my class, you can trust that the work you've produced is really accomplished.\nIt is not enough to have a thesis (or argument), though that is important; you'll also be\nasked to defend it rigorously and creatively, using close textual analysis, and then expand into a\nconclusion that presses on the implications of that argument being well-defended. By the end of\nthe semester, you should be able to follow and flourish in that form, which will serve you well in\nyour major, in other classes in the humanities, and in future analytic projects that require\nsustained attention to putting forth and defending an argument.\nA grade of a D suggests real problems in completing the assignment and a paper without a\nthesis or that does not use textual evidence at all or very much; a C suggests adequate\nperformance--a decent argument; sufficient, if unsurprising or obvious evidence; a B suggests a\ngood paper, one that showed a solid understanding of the material and some creative engagement\nwith evidence in support of the central thesis; an A suggests exceptional work and either a\nprofound, rigorous defense; broad synthesis of textual material; creative readings; or all three.\n\nCan I talk to you while working on papers? Can I run my thesis by you?\n\nYes and yes! My office hours are on the syllabus, and I am almost always available on other days\nthroughout the week. If you can't make office hours, just email me to ask a question or run your\nthesis by me or to make an appointment to talk in person. I like talking to my students!\n\nEugenie Brinkema; Updated 2011\n\nWhat do your comments mean?\n\nIf I wrote \"awk\" or \"grammar,\" there was something amuck in your sentence, grammatically.\n\"Proofread\" indicates several errors within a short span of time; heed this, because in future\npapers writing errors will be taken more seriously, as you've been put on notice to polish your\nwork. A question mark, especially in relation to a phrase, means it is unclear what the subject is\n(general reference errors usually take this form, i.e. an unattributed \"this,\" or \"it\") or I'm just not\nsure what you're saying. My marginal comments usually take three forms: check marks to\nindicate an interesting or clear argument; counter-evidence or suggestions for thinking about\nother ways of interpreting textual evidence; or questions trying to tease out what you're trying to\nsay. Often, the better the paper, the more I write, so marginal comments are there to get you\nthinking, not as punitive or assessment-based remarks.\n\nThe final page, on which I write a longer paragraph, should be read carefully: I articulate\nwhat is strong in a paper (so you know what you can build on; so you can keep doing it) and also\nwhere, specifically, I'm looking for improvement in future papers. I hope these comments are\nhelpful to you--you may want to keep these papers and refer to them explicitly when working on\nyour other papers for this course. And again, if you have questions about something I've written,\nor are not sure how to make the suggested improvements, please come talk to me.\n\nWhat did you mean when you said I need to use stronger textual evidence?\n\nIf you can write your paper from memory, without opening a novel or poring through detailed\nscreening notes, that's a good sign that you're not hewing close enough to the text and your\ntextual evidence to support your argument will be too vague, weak or both. Generalities are not\nyour friend in analytic papers. You want to be specific: use specific formal figures, specific shots\nor scenes, specific quotations or episodes. Keep in mind the kinds of things we talk about in our\nclass meetings: we turn to specific pages, or talk about specific chapter titles or epigraphs; we\nattend to language used, patterns and repetitions, beginnings and endings, formulations related to\nspeaking or narrating; we note uses of color or sound in films; and so forth. When we talk about a\npage in class, be sure to make note of it unless you have already in your text; your pages should be\nvery marked up as you read to keep you thinking and attending to details; and then, as you get\ninto your paper, pull evidence from the text and evaluate it for the best evidence to support your\nargument, whatever it may be. Bonus points for either synthesizing large amounts of material (i.e.\nnoting a structure or formulation that reappears throughout the text, creating a large-form\nproblem) or for using surprising evidence that shows a nuanced or original take on the material.\nTexts do not contain meaning: they make it, formally, and you generate it, critically, in your\ninterpretation(s); feel free to read idiosyncratically, as long as you defend your claims well.\n\nWhat did you mean when you said I need to \"push\" my conclusion?\n\nThe very best writers learn to read their own work as though it were written by another, and they\nlearn how to \"press against\" or \"press on\" their own arguments. When you finish your paper, in\nan ideal world, you'd set it aside for at least a few hours; then, you'd come back to it, sit down, and\nread it from start to finish as though you had not written it: you'd pose questions to it (Really? Is\nthat always true? What does it mean that that argument requires we ignore the second half of the\ntext?). You might then refine your argument to be more persuasive, or incorporate (and answer)\ncounter-evidence to your claims. You also would want to ask the \"So what?\" question I wrote of\nin the scholarly writing section: why does your argument matter? What new questions does it\npose? Is there anything peculiar about your argument that might now, in a conclusion, need to be\naddressed (have you identified something that opens up new issues)? Conclusions end, as\nintroductions begin, with broad problematics; feel free to speculate on or wonder about the very\nargument you've made. Think with it, even after you've written it; write that down. Papers need\nto be reread, even after they've been written. When we talk about editing and revising, that re- is\nwhat's important: attend to your papers not once, but again. Your work will absolutely get\nstronger for it. (It is also the most fun and exciting part of the writing process, in my opinion.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "How to Watch a Film",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/c1067a2b1da892e5c31950549ead3073_MITCMS_840F13_HwtoWtchaFlm.pdf",
      "content": "E. Brinkema\n\nHow to Watch a Film\n\n!\n- We are so used to film that many aspects of formal construction (editing, camerawork, sound\neffects) are invisible to us--and indeed, are often meant to be invisible. But when you study\nfilm, it's precisely those invisible elements that you need to notice and analyze.\n\nPay attention to:\n\nThe Visual (What's in the frame?)\n- how the camera moves (left, right, up, down, track versus pan)\n- camera angles and distances (long shot/establishing shot, close-up, etc.)\n- cinematography (film stock, color, lenses, changes in focus)\n- point of view (seeing through a character's eyes, \"God's eye view,\" etc.)\n- editing (length of shots, frequency of cuts, rhythm, smoothness/jumpiness,\nmontage, continuity--How do the images relate to each other?)\n- transitions (dissolves, fades in or out, iris in or out, etc.)\n- lighting--high/low contrast, shadows, harshness, natural light/studio\n- special effects, digital additions\n- \"mise-en-scene\" (= \"put into the scene\"; this is a term from theater)--\nthe placement of things in front of the camera (objects; sets; costumes)\n- actors: faces and bodies; gestures\nThe Auditory (What's in the soundtrack?)\n- sound effects / noise / music / silence\n- diegetic (radio in a scene) versus nondiegetic sound (film score)\n- dialogue, voiceover, dubbing\nNarrative (How is the story told? How is knowledge given and withheld?)\n- language (melodramatic, documentary, naturalistic)\n- tone (realist vs. expressionist)\n- plot versus story (what isn't said? what pieces do we fill in ourselves?)\n- ordering of elements (how are flashbacks and flashforwards used?)\n- is it an adaptation? What intertextual connections exist to other works?\n- cliches, narrative expectations, genre conventions (or deviations from genre)\n(e.g., \"meeting cute\" in Romantic Comedies; the \"rules\" of the slasher genre)\nMore Ephemeral Questions\n- rhythm / pacing (speed vs. slowness)\n- reflexivity; Is it self-conscious?\n- construction of space (coherent, fragmentary)\n- aesthetics (form, repetition, symmetry)\n- production practices (where/how was it made?; celebrity/star system; auteurism)\n- credits (opening and final) / title sequence\n- affect / emotional response\n- ideology / politics (sexual or racial difference, class, nation, generation, etc.)\n- spectatorship (How do we view the film and why? How does the film \"imagine us\"?)\n\nTips:\n\nThink as you watch. Draw sketches during the screening. Constantly ask yourself questions:\nWhat's in the frame? What is the camera doing? How is the text put together? Note scenes\nyou might want to revisit, or that are particularly striking. Attend to the affects the film\nprovokes; ask about structures of spectatorship. See a film several times. And make the film\nunfamiliar: try watching with the sound off to really notice the visuals, or watch with your eyes\nclosed to explore how sound is used.\n\n! You can only interpret a text once you see all its component parts...Think of your\nnotes as breaking the film down so your critique can piece it back together!\n!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Violence - Terms, Concepts, and Etymology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/a631193023aa92128e92200af024c7fb_MITCMS_840F13_Violence.pdf",
      "content": "21L.435/CMS.840\nAt the Limit: Violence in Contemporary Representation\n\nProfessor Eugenie Brinkema\n\nTerms & Concepts\n\nToday, we watched clips from:\n\nAlfred Hitchcock's 1960 Psycho\n\nNormalcy of the monster; realism\nArthur Penn's 1967 Bonnie and Clyde\n\nAestheticized Violence / Balletic style\nPasolini's 1975 Salo\n\nSanctioned v. unsanctioned violence; the Law\nWes Craven's 1997 Scream 2 Reflexivity and irony; postmodernity\n\nRepresentation and (vs.) the Real\n\nUltraviolence (1967-on) in terms of history/code changes, aesthetics, spectator, 1966, the\nProduction Code was revised\n\n1968, \"Code and Rating Administration\" was created, along with the G-M-R - X classification\n1930-1960: Hollywood Code; pre-Hayes, no glamorizing of violences; hidden gore, no\nstylization of violence\n1960-on / post-Code / ultraviolence (Peckinpah, Penn) rise of youth culture; Vietnam;\nassassinations (instant coverage on TV) squibs, show of violence and spraying blood aesthetics:\nmakeup artists (opened body), latex/prosthetic limbs graphic mutilation and slow-motion\nrepresentations of body in states of extremity and pain\n\nViolence= exercise of force so as to inflict injury on, or cause damage to, persons or property\n(Oxford English Dictionary) [ derived from Jean-Luc Nancy: Violence as a FORCE\nEXTERNAL TO A SYSTEM THAT DENATURES IT ]\n\nviolentia (Latin), \"vehemence, impetuosity,\" violentus \"vehement, forcible,\" violation: early\n15c., from L. violationem (nom. violatio) \"an injury, irreverence,\" from violatus, pp. of violare\n\"to violate, treat with violence, outrage, dishonor\"\n\n- Questions to Consider: Does violence require a victim? Is violence the same thing as force or\nintensity or great energy? Does violence have to result in physical harm, or can it be emotional,\nmoral, affective? Is violence always unjust or impermissible? (Is the notion of \"justified\nviolence\" an oxymoron?) Is violence singular or can it be collective? Does there have to be an\nindividual person behind violence or can an abstraction (a state, a peoples) be violent? Is\nviolence only destructive or can it also be creative (can it produce the new or only obliterate)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 1 - A Brief History of Violence",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/a435909d69c5caee7224e63466e3915b_MITCMS_840F13_Session_1.pdf",
      "content": "Session One Lecture Notes: A Brief History of Violence\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nI want to make a few remarks as a kind of epigraph to class today; then, we'll go over the\nsyllabus. Finally, I'll give a lecture to contextualize (and even problematize) some of the work\nwe'll be studying: we'll look at four film clips, from Hitchcock's 1960 Psycho, Arthur Penn's\n1967 Bonnie and Clyde, Pasolini's 1975 Salo, and Wes Craven's 1997 Scream 2, and I'll pose\nsome questions to get us ready to begin our discussion next week.\n\nEpigraph to class today -\n\nThe last time I taught this course was spring 2011. Back then, the time I was preparing the\nsyllabus coincided with January 8, 2011 - which was the date of the Tucson mass shooting,\nwhich left six people killed, 14 others injured (one of whom is Gabrielle Giffords, a member\nof the House); I'm sure you saw at least some (if not quite a bit) of the news coverage about\nthat.\n\nSo two and a half years ago, I opened that class by summarizing an article that appeared in Slate\nabout the shooter in Arizona, Jared Loughner. The article was titled \"Jared Loughner, Ready for\nHis Photo Op,\" and the subtitle was \"The bald head. The calculated zombie grin. The living\navatar of evil.\" The premise of the article is that Loughner's mug shot, in which he is bald and\ngrinning widely, exists in relation to representation; the author of the article writes (until I say\notherwise, this is from the Slate article):\n\nLoughner has \"proved himself rational enough to have groomed himself into a modified Travis\nBickle in expectation of Saturday's arrest and yesterday's arraignment. The alleged assassin\ndefinitely wanted a part of the assassin's look. [Bickle - De Niro, Scorsese's Taxi Driver ]\n\nShaved heads once signified induction into the military, a religious or an ascetic statement, [. . .].\nBut for the past few decades, Hollywood has frequently cast shaved heads in lead roles--Marlon\nBrando in Apocalypse Now, Laurence Fishburne in The Matrix series, Sigourney Weaver in\nAlien 3, Brad Pitt in Fight Club, Natalie Portman in V for Vendetta, Edward Norton in American\nHistory X, and all the rest, [. . .] --to telegraph that their characters are crazy-awesome-\ndangerous-self-sacrificing human torpedoes capable of chaos, magic, bedlam, and sometimes\nsequels.\n\n[. . . ] But as the movies illustrate, while going naked up top can establish a character in a drama,\nit's never enough to carry the role. Loughner knows that, which is why he added the Hare\nKrishna smile and the glazed eyes--eyes that have drifted just a couple of degrees from direct\ncontact with the camera lens--to his horror portrait. [. . .] If Richard Avedon had shot color film\ninside a Supermax prison for In the American West, he would have hoped to come back with a\nshot like this.\n(c) The Slate Group LLC. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nThe shaved character in the movies is almost never happy. Nobody tapping the primal forces he's\ntapping could ever be happy. But being angry is too cliched to be accepted. Hence Loughner's\nbent smile, which recycles Jack Nicholson's psycho grin from The Shining and any number of\nBruce Dern and Jack Palance grimaces. [. . .]\n\nLoughner has consciously sculpted himself into a modern computer-game avatar in his photo. By\nthis evening we'll have seen the shot so many times that its silhouette will be etched into our\nbrains, and a glance of it will be enough to remind us of where we were when we first heard\nabout the Giffords shooting, what we felt, and how we reacted to the debates about politics,\nviolence, and media that immediately followed. It ranks with the mug shots of Charles Manson,\nLee Harvey Oswald, James Earl Ray, and Timothy McVeigh. Somewhere, musicians are\nappropriating his name for their punk band, others are printing T-shirts, somebody is writing an\ninstant-book about him, & somebody has made it their Twitter icon.\"\n\nEB again: the reason I wanted to open with this as an epigraph to our class is that the Slate article\nfigures Loughner's photograph in a long history of representation: what we know of Loughner is\nreduced to a visual analogue (mug shot) and the semiotics (meaning: the meaning) of that mug\nshot are placed in a history of films, photographs, and the recycling of those tropes in new media.\nI'm going to gloss this a bit, because we'll be talking quite a bit about postmodern representation\nin this class, but one longstanding trope in critical accounts of our historical era (late capitalism,\npostmodern, accelerated globalization) is that representation and the real have blurred with each\nother: such that, news footage from 9/11 of people who were in Manhattan and saw plumes of\nsmoke live, \"It looked like something from a movie.\" Loughner, goes the argument in this\narticle, is legible as a signifier because his image participates in a history of images of mass\nmurderers from visual culture. This structure - whereby a real figure models himself after\nfigures from popular culture (life imitating art imitating life) is a trope that's quite common with\nserial killers; we'll be talking more about this intimate relationship between violence and the\nmedia, even as it is negotiated within media texts. (And in a case like Taxi Driver, it's not just\nthe claim that Loughner's image is re-presented as something familiar from that iconography, but\nthat film, which is about Travis Bickle's vigilante fantasies itself became part of the obsessional\nfantasies of John Hinckley who shot Roland Reagan claiming he wanted to impress Jodie Foster,\nthe actress who plays a prostitute in the film, and whom Travis Bickle wants to save - to the\npoint that the film was played during the trial.)\n\nNow, this is a class on contemporary representation: representation is a presentation to the mind\nof an idea or an image; it's a rendering of something else, it symbolizes or stands in for\nsomething else (why representation can have a political and an aesthetic meaning). This is not a\ncourse in \"real\" violence as such, as might be studied in a political science or an anthropology or\nsociology class. This is not a class in sociological analysis of media effects--we're not going to\nbe talking about research on whether violent films cause copycat crimes; there is no \"data\" in\nthis class. This is a class in interpretation.\n\nSo, there's a sleight of hand to open class today by talking about a real instance of mass violence,\none that left real material bodies wounded and dead. But it's not as though the two are totally\nunrelated or different beasts; the two reals are constantly mutually affecting each other and the\nway in which we understand the \"real\" and the \"represented\" requires recourse to the other mode\n(c) The Slate Group LLC. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nof discourse. We're going to explore this relationship between representation and the real more\nfully, and we'll critique it, interrogate it, but I wanted to open by suggesting that any firm divide\nthat suggests that we're \"only\" studying representation--or that violent representation is an\nentirely separate thing from thinking about \"real\" violence--is a difficult division to hold fast\nand firm.\n\nWhen we talk about contemporary literature and film that pose violence as a problem; that\ndeploy it as an aesthetic; that attempt to think about it in relation to ethics and politics and\nhistory; that use formal devices that collude with (or critique) violence, and that in essence\ninterrogate violence (even as some of our works will be accused of reveling or even irresponsibly\ndeploying) violence, we'll be using a methodology firmly rooted in the humanities: textual\nanalysis, contextual analysis, close reading, speculative thought, and critical theory. This doesn't\nmean, however, that we're not continually getting at ethical and political consequences. It's just\nthat our analyses of representation will get us there.\n\nSo, that's how I opened class last time. Loughner's photograph was a useful example -\nposing issues of the intertwined relationship of representations of violence and real violence; the\nways real violence can style themselves after representation, and the way representation can\nitself be blamed as causing 'real' violence. And two and a half years isn't exactly ancient\nhistory. So it could hold for today as well.\n\nBUT - one of the interesting, troubling and inevitable facts about working on violence and\nrepresentation is that it is a renewable, deep field of material. So let's a get more recent\nand come a bit closer to home.\n\nYou have perhaps seen this - or, maybe only read about it...Hand out Rolling Stone.\n\nThis is the (now infamous) Rolling Stone issue from this summer -- about three months\nafter the Boston Marathon bombings (the ones as well you know that also left an MIT\npolice officer dead and many people injured) - with the cover image of Dzhokhar Tsarnaev,\nthe younger brother of the two marathon bombers. As you may well also know (though if you\nweren't in Boston this summer, maybe you missed it), the cover was so controversial that\nWalgreens and CVS (nationally) and lots of local stores refused to carry and sell the issue.\n\nThe mayor of Boston came out and publically accused the magazine of offering Tsarnaev\n\"celebrity treatment.\" And of course the normal course of figuring on the cover of rolling stone\nis not just \"for\" celebrities, but is itself part and parcel of making and denoting certain people\nand figures as celebrities (it's not a neutral tool of documentation, but colludes in deeming\ncertain figures as being worthy of having fame, status, name and image recognition conferred\nupon them).\n\nFOR EXAMPLE: PLAY Dr. Hook SONG - 1973. Cultural capital.\n\nThen there's the issue of visual form. Look at the image - the tussled hair; the direct gaze at the\ncamera. Like the semiotic chain with Loughner (which runs through Apocalypse Now to Taxi\nDriver) - this one seems to echo the way in which the magazine has framed romantic, Byronic\n\nfigures like Jim Morrison - does it make him too handsome? Too desirable? Why is that a\nproblem - what anxiety is provoked over the prospect of the mix of a sexualized image with a\nnarrative of violence.... Compare the two covers; this, and the one long after Morrison's dead...\n\nBut it's even more complicated, because this debate itself is one we've had before: when the\nmagazine did a special issue on Charles Manson in 1970, interviewing him from prison where\nwas himself already a celebrity who had a very vexed relationship with popular media, critiquing\nits excesses and yet using it to disseminate his own self-mythologizing narrative, it was criticized\nfor framing him in a Christ-like pose and light - which again, becomes an issue of interpretation:\nto Manson's followers, he was a messianic figure, so is the visual representation colluding with\nthat discourse (i.e. supporting it, participating in it) or is it critiquing it? It's complicated. But\nthen again, the image is also reminiscent of the Rolling Stone cover of billionaire Paul Getty's\ngrandson, who was kidnapped, held for ransom and had his ear cut off before his return - so the\nimage on its own is also a visual echo of a young boy synonymous with victimization,\nvulnerability, exploitation. (In another twist back to representation, the severed ear and\nkidnapping/extortion scheme, and Paul Getty's refusal to provide the ransom, is itself echoed in\npart of the plot for the Coen Brothers' film The Big Lebowski. So, again, the path goes both ways\n- the real and the representational always mutually affecting each other.)\n\nIf one wants to trace the mediatization of this issue (which is a debate in the media about the\nrelation of the media to covering violence), it's worth noting that the copies that were for sale\nflew off newsstands and the resulting effect of making the issue scarce produced a kind of\n\"limited edition\" dimension to it, as though it were a rare bootleg of some underground album (I\nbought mine weeks later for a very high premium off a collector on ebay - one who sells rare\nissues of magazines but also, for example, serial killer trading cards, another bonding of\nviolence, representation, media celebrity and commodification that we'll talk about as often if\nnot always present in the case of the figure of the serial killer). Much criticism of the cover was\nthat it participated in the \"branding\" of the bombings - providing as the visual iconography that\nis a shorthand for the events not a victim or a rescuer but the perpetrator of violence; poses the\nquestion of who has profited from it?\n\nBut it's still more complicated: The image has a caption - and as often happens in the relation\nbetween word and image, in which the latter is polysemous (= many-meanings), the caption\ngrounds those meanings, fixes and shapes them into something concrete. The caption reads \"The\nBomber: How a Popular, Promising Student was Failed by His Family, Fell into Radical Islam,\nand Became a Monster.\"\n\nThe subtitle is not descriptive or labeling (name, birthdate); rather, this subtitle tells a story: and\nit goes like this - We start with a state of normalcy (Normal = unviolent; popular; promising -\nthe American Dream); then something privately goes wrong - he's failed by his family\n(privatizing story: it's about family, not economics or politics or ideology); and then became a\nmonster (something not-normal; because only monsters perpetrate violence). For all that the\nimage seems to suggest celebrity, normalcy, sexual desire, allure, the caption promises causal\nexplanations, the breakdown of normalcy, the pathological family as blameworthy, and the final\njudgment of monstrosity.\n\nWe'll see this kind of formula again and again this semester - as early as next week, when we\nlook at the relation of violence to the imaginary of \"America\" and then the following week when\nwe start the novel American Psycho, we'll continually encounter this question: Is violence\nsomething monstrous, abnormal, unusual, exceptional, different... or is violence, in fact,\nprecisely something utterly, completely expected, ordinary, banal - Is it the very essence of the\nnormal and normative? Is violence bound up with the failure of the family, or a commitment to\nthe ideology of protecting and shoring up the family? Is violence something that the monstrous\ndo, or is violence precisely the logical outcome of the most ordinary and normal course of events\n(in the Ellis novel, is it the logical consequence of capitalism run amuck - in a world where you\ncan buy and use and exploit anything, are human bodies an obvious commodity to be added to\nthe list?)\n\nThe interesting thing about the debate about Rolling Stone is that it tends to oscillate\nbetween opposing camps: One suggests the cover glorifies him, promotes him to the level of\nthe celebrity. The other that it normalizes him, brings him down to earth instead of\nfiguring him as a monster. The status of this debate about violence (abnormal or normal) and\nthe question of what images should do (expose the normal or highlight the abnormal; do they\ncollude with the unethical dimensions of violence; do they need to accuse or confront us with the\ngraphic? What should we ask of images - what should we ask of representations of violence?\nWhy is there such a persistent desire for The Face of Evil - what's at stake in wanting ethical\nabnormality to be visually legible?) If the image of Tsarnaev is too pretty, too easy (in a\nmanner) to look at, what's the alternative: the image (circulated in other periodicals) of him\nbloodied, shot by the police? Would that image have its own problems: would it be open to\ncritiques that it was reminiscent of images of soldiers or martyrs; would it be accused of\nvoyeurism, allowing consumers of the magazine to imagine themselves into the position of the\nviolent event without risking anything? If the problem with the photograph is that it's too\nconsumable, then what about an image difficult to look at, hard to take in, something bloody,\nsomething graphic, even disgusting - something that makes us sick upon looking at it? Is the\nopened, mutilated body a better option (what does 'better' mean?) What about a black cover? A\nrefusal to represent the bombings at all? Is it more responsible to commit to the ultra-violent,\nrepresentationally? This debate - between critique and voyeurism - about whether\nrepresentation is \"reflective or affective\" (makes us think or makes us feel) is a vibrant one. I'd\nencourage you to keep an open mind about these terms: to ask whether critique can only come\nfrom taking a \"reflective\" stance, or whether aestheticizing, even trivializing, prettifying violence\nmight be one way into a critique.\n\nThese are just some of the questions we'll ask about this semester. But from the outset, I\nhope it's clear that these issues of interpretation are multi-layered and complex. Violence,\nintertwined with representation, has a way of slipping away from final judgments - of\nposing contradictions that are difficult, if not impossible, to resolved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 2 - America the Violent",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/edf9075527141ee9ce362e0ff8faa6f2_MITCMS_840F13_Session_2.pdf",
      "content": "Session Two Lecture Notes: America the Violent\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nThings to Watch For - \"Fargo\" and \"American History X\"\n\n1. Both of these films have peculiar TITLES, one marked by a placeholder for meaning (X, the\nvariable, the open, the undetermined) and one that names a specific place. What do you make of\nthose titles? What kind of conceptual work are they doing? If the title is a kind of shorthand\ntheory or reading of the film, what is each title proposing we pay attention to?\n\n2. What is each film's relationship to TIME and HISTORY? Familial, national, local,\nmythological, generational, etc.? Both play with time: formal (non-linear) time; historical time\n(on a grand scale); the time of trauma (one that seems to slow down, or be experienced in stilled\nmoments); generational time (father to son to brother). What is the relationship between time\nand violence?\n\n3. What is \"VIOLENCE\" (or what plural forms of violence, perhaps on a continuum, exist) in\n\"American History X\"? What is the relationship between violence of thoughts (racism, hatred,\ncontempt) and physical violence? Or sanctioned and unsanctioned violence in \"Fargo\"? Do the\nfilms frame violence as either comprehensible (with a cause, origin, explanation, logic) or as\ntotally incomprehensible (what destroys causality, origin, explanation and logic)?\n\nTODAY: Week on America the Violent: about mythic national conceptions (Americanness\nand violence); generation (in the sense of familial generations and also generation as in creation/\nperpetuation) and regeneration (as in to create anew or revitalize; but also reform); and versions\nof American history that are read through the lens of violence. So today, among other things,\nwe'll talk about how our texts offer their own versions of American History: American History\nX [blankness, placeholder], American History as a series of losses (job, curriculum); Slotkin's\nHistory of the frontier; etc. We'll broadly consider: Do our texts suggest there is something\nparticularly American about violence? That it's the nature of \"America\" (quotes: as an idea) to\nbe violent? We won't stop asking this question - next week: American Psycho.\n\nWant to make just a few comments to serve as an overview for class today.\n\nSlotkin, Introduction, from \"Regeneration through Violence\"\n\nSlotkin's work focuses on the myth of the frontier in American history and American mythic\nconceptions of itself as a national identity and conceptions of the national self in relation to\nviolent acts, and the others against whom violence is done in the name of national expansion and\nactualization.\n\nSo, it's a textual and historical reading of the anxieties of early American settlers, and the\nrelationship of violence to those anxieties.\n\nThe mythic image (white, male, land-owning) Americans have of themselves; it's a largely\nnegative definition (X is what it is because it is NOT Y - where Y is natives, women, slaves,\netc.) Violence becomes a conceptual figure that moves around to different agents in Slotkin's\nargument: some figures \"absorb\" violence; others manifest violence; others justify it; many of\nthe narratives he analyzes suggest a distinction between those who aggress and those who\navenge. Of the three major categories of identity associated with violence--aggressor, victim,\navenger--the avenger is particularly dangerous because he associates his violence with\nretribution, with a right to violence (with a justifiable violence).\n\n[ Meta-comment:\nBINARIES: a lot of analyses of violence tend to hinge on binaries/pairs/sets of\noppositions /(aggressor and victim)/WATCH FOR THESE\n- dangerously in collusion w/discourses of us/them\n(p. 17: \"the fatal opposition, the hostility between two worlds, two races, two realms of\nthought and feeling\") ]\n\nWhat is his thesis? Get this on the table in preparation for our first question today.\nTHESIS: In America, anything is possible, regeneration is always possible - but the means\nfor that are the means of violence (p. 5)\n\np. 4: founding fathers were those who \"tore violently a national from the implacable ad opulent\nwilderness\"/mastered the land that might kill them; made it fertile (productive; put it to work;\nprofited off it)\n\np. 5: rational man of foundational gov't vs. western man (irrational, destructive)\n\"myth of the frontier\"\nFrontier = where real Americans stand their ground; general, abstract, ideal\n\np. 4: two initial forms of violence (against nature) and against Indians (natives)\n\nSlotkin/Fargo/land/myth\nIn Slotkin's study of the American myth, he discusses a few key factors that differentiated the\nformation of the American myth from the classic European myths. Two of these factors were (1)\nthe unfamiliar \"New World\" landscape which set the original American myth as a tale of man\nvs. wilderness and (2) the fact that the American myth was born after the invention of the\nprinting press, which then blurred the lines between myth and literature. This second factor\nallows the myth's creator to reference and manipulate already familiar literary devices and\nstructures.\n\nWith this in mind, what are the effects of these factors in the film \"Fargo\"? The film is set\nsignificantly in North Dakota, the quintessential American wilderness, and yet nature is neither\nthe antagonist nor a causal force in the film's violence. \"Fargo\" also uses classic cinematic/\nliterary devices such as an unexplained MacGuffin (Jerry's need for money which causes him\nto kidnap his own wife), a Hitchcockian briefcase full of money (left irrelevant and untouched at\nthe film's end), and contains a bathroom scene that feels oddly reminiscent to \"The Shining\". If\nSlotkin argues that these factors define the American myth, then does it seem intentional that the\n\nCoen Brothers use the same factors for an arguably opposite goal; to confuse and distort any\nsort of classic mythopoetic narrative?\n\n[so, it uses myth form to distort and confuse mythic narrative...]\n\n1st, let's establish what mythic features they exploit:\n\nFargo -- Title - why?\n4 min of screen time (only the first meeting to give them the car) takes place in Fargo, North\nDakota; rest in Minneapolis or Brainard or en route, so it's not a geographic designation but an\nidea (an abstraction about America)\n\nPaul Bunyan - see him (light; dark; end of the film)/Brainerd, home of P. Bunyan\n\nmyth of the American west\n\ngiant (with Babe, the blue ox); ax (felling and opening space; killing)\n\nmythic figure of American masculinity (pioneer, agrarian America: clearing the\nwilderness, preparing it for settlement; part of the myth includes making lakes for Babe to drink\nor forming Grand Canyon when dragging ax behind him)\n\nnow: civilization in decline (this time has passed)\n\nbut depending on the light, benign pioneer looks like monster w/ an ax\n\nGaear likened to Marlboro man (big w/ little companion; ax) - but instead of creation,\ndestruction; instead of grand mythic, small and pathetic\ndoubles/twins (twin cities; Carl and Gaear)\n\nSlotkin\np. 18, tales: native Americans vs. interlopers; dark races vs. light\n\nland: harsh vs. fertile\n\nDefining sense of self through negative (not-native; not-black) (p. 22, simplicity of opposition\nbetween Indian and settler/white and black/us and them)\n\nTwo senses of generation: bringing forth (something new)/being formed; being produced or\nmade (regeneration: remaking of the self, the people, the nation)/but also, and of course related,\nis generation, body of people born at the same period: act of procreating (passing things down\nfrom generation to generation) - legacy or inheritance of violence/ask about relation between\nolder and younger men (the father to the son; but also the elder figures with the young boy who\nshoots Danny in the end)\n\n\"the sons of these emigrants strove to justify their title to the land they took for their own\" (p. 18)\n\nformal conventions: narratives of discovery, captivity, sermons, colonization and\nanticolonization tracts\n\nLAND/Harshness/Elements - SNOW\nSnow\nstatic/tv - obstruction ( Fargo ch. 11 - tv/snow )\n(can't get a clear picture)\nsnowball (escalation out of your control)\n\"snow job\" = (1940s) -- a deceptive story that tries to hide the truth; a strong effort to make\nsomeone believe something by saying things that are not true or sincere\nrelate to the form of kidnapping\n(ransom: convince someone that you will do something that you by definition haven't done\nyet; if you do it, no grounds for ransom, but the threat's believability is the bargaining\npower of the exchange)\n\nwhat will thaw or be (re)born in the spring (land; her baby; the buried money)\n\n* So harshness of the land and the mythic work of the film itself as story seem related\nhere... as though the harshness of the land were the metaphor for the story, instead of the\nstory being the metaphor for the land!\n\n\"I just don't understand it,\" says Marge of the incomprehensible bloodshed near the end of\nFargo. How do we deal with things we don't understand? Is humor or a more \"traditional\"\nemotional response (horror, grief, anger, etc.) more effective at understanding some of the\nintricacies of violence and violent acts? Is either a more appropriate or legitimate way to cope\nwith violence?\n\nFargo Epigraph - not true; feint\n-what's at stake in the film pretending to be real?\nthe film itself is a tall tale (pretends to be true)\naesthetics of the film in collusion w/ this (location shots, natural light, unobtrusive camera)\n\nhumor and seriousness:\n\nissue of \"respect for the dead\"\n\nWho has this?! (i.e. Marge: almost pukes, morning sickness; not disgust or\nmoral revulsion at the corpse)\n\nSHOW ch. 9 - Marge/bodies/vomit\n\nBlack humor - laughter (sound; distortion of face; anxiety)\nForm of a polemic/didactic\n\nAmerican History X is \"about\" violence/both didactic and argumentative (obviousness to it; in\nsome ways, is a melodrama)...\n\nObviousness to American History X-- Forms; Polemic (argument against a position)/polemos:\nanger); didactic (overly/highly instructive)... what's the effect? How does its message or stance\nor position relate to violence (make it easier to disregard it/what are we being instructed in?)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.430 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 3 - Serial Killers I - Repetition & Commodities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/2b6de5f3ea16cfe66bc56ae49a8109b4_MITCMS_840F13_Session_3.pdf",
      "content": "Session Three Lecture Notes: Serial Killers I - Repetition & Commodities\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nLast week we talked about America the Violent: Mythic national conceptions (Americanness and\nviolence); generation and regeneration; -- is violence only destructive or is it also discursively\npositioned as creative/generative/a mode of making? We talked about different forms of\nviolence (including against the audience), which is a kind of textual violence we may want to\nreturn to today; and we talked about surface/flatness (television, blankness, snow, whiteness,\ncold - affect and environment); red versus white. Today, we start a three-week unit on the figure\nof the serial killer (and then later in the semester, when we get to the problem of\nmediation/reality TV, Natural Born Killers and Man Bites Dog, we'll come back to seriality,\ncelebrity, and the serial killer).\n\nSome remarks to frame today's discussion:\n\nBy virtue of being a class on contemporary representation - in the time period of\npostmodernism (sometimes also called advanced or late capitalism). Our texts last week\nforeground some aspects of that mode in their representational strategies (emphasis on\nmediation/television; blankness; surface). Ellis does so as well, even more polemically. One\nreason I wanted to wait to today to talk about postmodernism as an aesthetic stance that\nmay help us think about how to grapple critically with American Psycho.\n\npostmodernism/the postmodern means different things, depending on the user. It can be\nused to refer to a historical period (some date it to the invention of television; some date it to the\nradical social upheavals of the 1960s; others place it around the 1980s--very few critical\ntheorists would deny, however, that we are now in a post-modern historical moment). It can\nalso, however, refer to a shift in thought, a cultural stance, and an aesthetic approach.\n\nmodernism (modern, modernity, modernization)\n\nassociated with: elitism, morality, ontology, authoritarianism, parody/satire\n\n\"depth\" model/see under-inside-behind ideology/surface\nNB Norman Mailer's review of American Psycho, 1991: \"Since we are\ngoing to have a monstrous book with a monstrous thesis, the author must\nrise to the occasion by having a murderer with enough inner life for us to\ncomprehend him. [...] We cannot go out on such a trip unless we believe\nwe will end up knowing more about extreme acts of violence, know a little\nmore, that is, of the real inner life of the murderer.\"\nvs.\npostmodernism: flat affect; pure surface; depthlessness\n\n\"Postmodern\" often refers to:\n- a rejection of the Cartesian subject\n- irony, self-reflexivity, or parody\n- a mixing of high and low culture\n\n- a critique of rationality\n- urge to deconstruct/demolish totalizing systems of knowledge (religion, humanism)\n\n- fragmentation instead of unity; distraction instead of organization\n\n- quotation or citation instead of originality\n- pastiche instead of coherent stylistics/theme\n- Modernist \"boredom\" (in aesthetics) is often contrasted to postmodern super-fastness /\n\"moments of schizophrenic intensity\" (Jameson)\n\nWith modernism, artists felt they could challenge dominant culture through critique,\nsubversion, and avant-garde practices such as irony or self-reflexivity that commented on the\nmedium. With the postmodern, things change--and many theorists now believe such critique is\nno longer possible (this is debatable!).\n\nFredric Jameson, for example, sees the postmodern as having no possibility for subversiveness or\nsatire (or at least, less so than with modernism); he sees the postmodern as being marked by\n\"blank\" parody, which he calls \"pastiche\". He writes: \"Pastiche is, like parody, the imitation\nof a peculiar or unique style, the wearing of a stylistic mask, speech in a dead language: but it is\na neutral practice of such mimicry, without parody's ulterior motive, without the satirical\nimpulse\" (\"Postmodernism and Consumer Society\"). Pastiche is speech in an exhausted\nlanguage; postmodernism read this way signals the end of aesthetic innovation and originality;\nthere is only quotation and mimicry (think about the way something like Scream figures horror\nfilms as constituting a \"genre about genre,\" an always-already-seen set of cliches that can only\nrefer to their own generic history, re-presenting and circulating previously existing horror\nmaterial).\n\nAnother famous theorist of the postmodern is Jean Baudrillard; he writes, \"No matter how\nmarginal, or banal, or even obscene it may be, everything is subject to aestheticization,\nculturalization, museumification. Everything is said, everything is exposed, everything acquires\nthe force, or the manner, of a sign.\" If postmodernism signals an impulse to deconstruct\neverything, and a repetition of earlier cultural productions, it brings to bear the question: can\nthere be any new aesthetic creation, or is one only ever repeating old/dead/earlier styles?\n\njuxtaposition of humor and violence\nirony/mimicry/mockery/intertextuality\npastiche vs. parody\ngore/excess/explicitness\nself-conscious/reflexive (accepts/plays with its generic cliches)\nmass/low culture vs. high culture\nconceptual and moral relativism\n\nLOSSES:\ncollapse of American hegemony; \"center cannot hold\"; American Dream v. Nightmare\nwaning of historicity\nwaning of affect\nsurface v. depth models\n\npostmodernism: flat affect; pure surface; depthlessness\n\nJameson: \"What replaces these various depth models is for the most part a conception\nof practices, discourses and textual play...depth is replaced by surface, or by\nmultiple surfaces\" (62)\nmultiplicity (instead of singularity)\nfragmentation (instead of totality, wholeness)\n\nNote: Jameson uses the words \"schizophrenic\" and \"intensities\" (58)--we might want to keep\nthose in mind when thinking about American Psycho: a mix of boredom and schizophrenia; a\nseries of textual intensities that are as apt to land on a new album as on a mutilated body.\n\nLyotard's postmodernity as \"incredulity towards metanarratives\"\n\nor the end of master narratives (the Enlightenment, Reason, Progress, etc.)\n\nTEXT SEEMS TO DO AWAY WITH ALL GREAT NARRATIVES\n(THEOLOGY/INDIVIDUAL FREEDOM)\n\nOpening line of the text?\n\n* Dante / 14th century, late medieval period/Divine Comedy (Inferno/Hell)\nDante passes through the gate of Hell, which bears an inscription, the final) line of which\nis the phrase Lasciate ogne speranza, voi ch'intrate, or \"Abandon all hope, ye who enter here.\"\n\nTheology / salvation\n\nEpigraph of the text?\nExistentialism/freedom // dread, anxiety (subject \"thrown into the world/existence, not of\nyour own making, responsible for everything\" - responsibility for individual choice, free will,\nsubject condemned to freedom)\n\nAnother theorist of the postmodern is Jean Baudrillard: NB 1990 book The Transparency of Evil.\n\nBaudrillard is very concerned with the abolition of otherness in postmodern culture. He\nsuggests that while the (uncanny) double was the preeminent figure for modernity; the clone is\nthe figure of postmodernity. He writes about cloning in order to suggest that the loss of\notherness involves the loss of an original, and that a body deprived of otherness has lost its\nrelation to death. (WE might think of late capitalism as an era marked by a radical loss of\noriginal: everything is an imitation of an imitation of an imitation; every character is wearing the\nsame set of designers; everyone looks the same - p. 89, mistaken identity but doesn't matter\n- and everyone is equivalent, with no distinction p. 123, bored by how beautiful Evelyn\nis;....)\n\nSo the \"Hell of the Same,\" that provocative phrase, is suggesting that in structures of repetition\nwith no original (we might say the Clone, but equally, might point to iterations of\nundifferentiated commodities), we've lost a relation to finitude because we've lost the concept of\nthe original, material body. Destroying the other as a point of reference destroys\ncommunication and exchange, but equally, makes it impossible to have a relation to one's own\nfuturity. So live in a world of death but cannot understand it, for Baudrillard.\n\nThe question that gets asked of postmodernity - and we'll ask versions of it many times in this\nclass, and different texts will suggest different answers - is whether critique is still possible.\nWhere can we locate meaning in postmodern culture? The problem of critique: Can we only\nread (and thus commit/and thus be complicit) or does the text admit any position from which one\ncan critique it?\n\nThree epigraphs:\n\n\"That which is for me through the medium of money - that for which I can pay (i.e., which\nmoney can buy) - that am I myself, the possessor of the money. The extent of the power of\nmoney is the extent of my power. Money's properties are my - the possessor's - properties\nand essential powers. Thus, what I am and am capable of is by no means determined by my\nindividuality. I am ugly, but I can buy for myself the most beautiful of women. Therefore I\nam not ugly, for the effect of ugliness - its deterrent power - is nullified by money. I,\naccording to my individual characteristics, am lame, but money furnishes me with twenty-four\nfeet. Therefore I am not lame. I am bad, dishonest, unscrupulous, stupid; but money is honoured,\nand hence its possessor. Money is the supreme good, therefore its possessor is good. Money,\nbesides, saves me the trouble of being dishonest: I am therefore presumed honest. I am brainless,\nbut money is the real brain of all things and how then should its possessor be brainless? Besides,\nhe can buy clever people for himself, and is he who has power over the clever not more clever\nthan the clever? Do not I, who thanks to money am capable of all that the human heart longs for,\npossess all human capacities? Does not my money, therefore, transform all my incapacities into\ntheir contrary?\"\n--Marx, The Economic and Philosophic Manuscripts of 1844\n\n\"I am a sick man ... I am a wicked man. An Unattractive man. I think my liver hurts.\"\n\n--Dostoevsky, Notes from Underground, trans. Pevear and Volokhonsky\n\n(note liver ref. p 98)\n\n\"To define force--it is that x that turns anybody who is subjected to it into a thing. Exercised to\nthe limit, it turns man into a thing in the most liberal sense: it makes a corpse out of him.\nSomebody was here, and the next minute there is nobody here at all; this is the spectacle the Iliad\nnever wearies of showing us.\"\n--Simone Weil, \"The Iliad or the poem of force\" (1986)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.430 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 4 - Serial Killers II - Boredom & Blankness",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/498ded0811a704db60ef31cfea78bdc1_MITCMS_840F13_Session_4.pdf",
      "content": "Session Four Lecture Notes: Serial Killers II - Boredom & Blankness\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\n* Aesthetic of kenosis (emptying out; evacuation of content)\nKenosis is a Greek word for emptiness, which is used as a theological term. Ancient Greek\nκενωσις (kenosis) means an \"emptying\", from κενος (kenos) \"empty\". The word is mainly used,\nhowever, in a Christian theological context, for example εκενωσεν (ekenosen) in Philippians 2:7,\n\"Jesus made himself nothing ...\"\n\nEtymology is from Greek κενοω (kenoo) \"to empty out\". The Liddle Scott Lexicon gives the\nfollowing simplified definition simplified for the noun :[1]\n1. emptying, depletion, emptiness (of life) (e.g. Vettius Valens)\n2. depletion, low diet, as opposed to plerosis fullness (e.g. Hippocrates)\n\nLast week we started our three-week unit on the figure of the serial killer. We talked about some\nof the key traits of postmodernity (sometimes called \"late capitalism\")\n\nsurface v. depth models\n\nJameson: \"What replaces these various depth models is for the most part a conception\nof practices, discourses and textual play...depth is replaced by surface, or by\nmultiple surfaces\" (62)\n\n- pastiche instead of coherent stylistics/theme (think about in relation to the film:\nJameson: the postmodern as being marked by \"blank\" parody, which he calls \"pastiche\". He\nwrites: \"Pastiche is, like parody, the imitation of a peculiar or unique style, the wearing of a\nstylistic mask, speech in a dead language: but it is a neutral practice of such mimicry, without\nparody's ulterior motive, without the satirical impulse\" (\"Postmodernism and Consumer\nSociety\").\nRelate to signs of 1980sness (music, fashion)\n\nThe question that gets asked of postmodernity - and we asked different versions of it in class\nlast week - is whether critique is still possible.\n\nI wanted to talk a bit about that word. In some ways, we were using \"critique\" in the kind of\nordinary language sense of analyzing, evaluating, judging something. Specifically: we asked\nhow to read, how to analyze or judge Ellis' American Psycho. We talked about whether the\nreader experiences Ellis' text in different ways: are we in collusion with Patrick and the logic of\nviolence (relieved when porn and violence break our tedium of consumerism excessive choice)?\nOr, is the reader worked over like a kind of victim in the text, subjected to shock and assaulted\nby the form of the text?\nRole of creating spectatorial desire (boredom, frustration, then scenes of\nviolence as \"something happening\")\nIn economics, a commodity is a marketable item produced to satisfy wants or needs.\n\nIs this book a commodity, then? Is the violence a commodity that satisfies our\ndesire for something to break the tedium?\n\nCan we just read along and follow its logic or does it call for an active, deconstructing readerly\nstance to fight that position (and if so: if we have to take it apart, break it up, break it its parts;\nread against the grain; undo it, is that itself a form of violence; does the text demand we do\nviolence to it--dis-member it as it were--in order to undo its violence)? But we also talked\nabout whether the text might not allow a position from which to evaluate it (just read it or\ndon't: endure it or don't; but how do we judge it other than by continuing to read and let it\nwash over us)... This was our way of asking the key question: Where can we locate meaning in\npostmodern texts?\n\nThe philosophical use of the word \"critique\" means an exploration of the conditions of\npossibility for thinking about something (in this case, violence): What kinds of questions need to\nbe asked in order to think about violence?\n\nOther people use the word critique as a kind of \"fault-finding\" or vocabulary of judgment\n(critique of capitalism would mean: How can we interrogate and criticize it?)\n\nBut yet other thinkers see critique as something that suspends judgment and focuses on\nexposing, unpacking and seeing them anew. (One formulation for this approach is \"not\njudgment, but practice\".) This would mean, for example, interrogating the ways in which\ncategories of evaluation are themselves ordered and formed: so, for example, this model of\ncritique would mean that instead of assuming a text \"ought\" to \"condemn violence,\" we'd ask\nwhat is at stake in asking that texts do something; what is at stake in demanding that violence be\ncondemned; what is at stake in figuring violence as something fixed and knowable enough to be\ncondemned? (We'd be suspending judgment in order to expose and unpack the very questions\nthat one might ask of violence. Instead of assuming we know what violence is (so we can judge\nit), we'd be using critique and this method of questioning to suspend arriving at a sense of what\nviolence is. Critique would not be an end, but a process... It's an activity that continually poses\nthe problem of its own terms of inquiry. It's a mode of questioning things. Can we make any\nfinal judgments on this novel or just keep questioning as an open stance of possible engagements\n- that's the question that in some ways the novel itself poses in its last line... which we'll get to.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 5 - Serial Killers III - Portraits & Signs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/bd78a7a396d760ec31fbcdf8aca04f09_MITCMS_840F13_Session_5.pdf",
      "content": "Session Five Lecture Notes: Serial Killers III - Portraits & Signs\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nThings to watch/read for this week as we turn to \"Serial Killers III: Portraits and Signs.\"\n\nThis week, we will continue our work with serial killers, but very different ones: we'll watch two\nfilms, shot in very different styles - each focusing on the issue of portraits and signs, realism and\nexpressionism, causelessness and grand meta-narratives for the causes of violence. We'll read\ntwo short and very helpful pieces: one on realist horror that is a reading of \"Henry\" and realism\nmore generally; the other is a classic: Mark Seltzer on the serial killer and idea of abnormal\nnormality, role of typicality, problem of identity.\n\nFirst, heed the title of the week: what is the role of the \"portrait\" in the title of Henry, and what is\nthe function of signs/clues/traces/metaphors/staging in Se7en? These are two figures (the\nportrait, the sign/trace) that demand reading or attention or decipherment, or we might think of\nthem as \"hermeneutic moments\" (remember, hermeneutics is the field of interpretation). What\nare we meant to interpret, detect, read or decipher in each film? Or, is the figure of the \"portrait\"\nlinked to immediacy, legibility, transparency: in other words, to a figure of the \"real\" that\nrequires no mediating interpretation?\n\nAlso keep in mind the relationship between realism and expressionism: each is a style of\nfilmmaking, but the former attempts to replicate the surface appearance of our ordinary reality,\nwhile the latter is marked by self-conscious stylization and exaggeration. They create different\nrelationships to violence and representation, and to spectatorship.\n\nFreeland's article is very interesting for its take on Henry as a form of \"realist horror,\" and I\nthink you'll find her philosophical approach to film interesting. Seltzer's article is a classic and\nwill be very helpful for almost every paper topic: he's interested in the serial killer in general, as\na discursive and cultural phenomenon. What is the role of seriality/repetition/iteration in the\nfigure (both construction and representation) of the serial killer? What is the role of typicality,\nthe average, the normal (and also, the exceptional, the abnormal, the unusual)?\n\nThese films have very interesting endings: they will be fascinating to compare. (Keep in mind\nthe formulation: \"This isn't going to have a happy ending\"). We're watching two films by David\nFincher this semester - Se7en and Fight Club; he definitely has an aesthetic, a style, a visual\nvoice - what does that look like? Se7en is by far the \"slicker\", more Hollywood film; Henry was\ndistinctly low-budget; how do the different visual, acting, narrative, and formal styles affect how\nwe read the films' narratives? We talked last week about how the film of American Psycho\nincreases the role of the detective and law; what is the figure of authority/law/punishment (and\nall those grand meta-figures for justice) in each film? What does each film suggest as cause,\norigin and explanation for violence? How do the films both narrativize and grapple with the\nrelationship between meaning and non-meaning? Is violence figured as a trope of non-meaning\nor the ultimate site of meaning? Attend to the video technology in Henry; the \"rewatching\"\nscene is justly (in)famous. And attend to the role of the city, the urban, the stranger, anonymity,\n\ncrowds, etc. in each film. Who are the victims in each film, and how do we (and the killers)\nregard/read them?\n\nPeras / Telos\n\n\"peras\" (limit/boundary) vs.\n\"telos\" (end as purpose/destiny/fulfillment/consummation/resolution)\n\nThis week is titled \"Portraits and Signs,\" and this is our last week explicitly on the figure of\nthe serial killer. We've talked about problems of postmodernity, late capitalism, waning of\naffect, depersonalization, issues of commodification, and empty identity (including aesthetic\nforms of kenosis: emptying out) in relation to American Psycho. This week, we're focusing on\nportraits and signs; we'll keep talking about violence and identity (esp. in relation to Seltzer)\nbut we also have a new set of conceptual issues to focus on.\n\nThe past few weeks, we've been asking a version of the question of critique: Where can we\nlocate meaning in postmodern texts? This week, however, we have something of an abundance\nof meaning - portraits and signs; traces and clues; sites of inscription and staged tableaux,\nmessages and warnings and witnesses and archives... texts that are demanding that they be\nstudied, interpreted, regarded, and read.\n\nEpigraph for class today: a quote from a film theorist named Judith Halberstam.\nShe writes, \"The monster, as we know it, died in 1963.\"\n\nHalberstam chooses that date because it marks the publication of Hannah Arendt's Eichmann in\nJerusalem: A Report on the Banality of Evil, Arendt's account on Adolf Eichmann's trial that she\nwrote for The New Yorker. Halberstam's argument is that after Arendt's redescription of evil as\na civil servant \"simply 'doing his job' or obeying orders\", we can no longer think of the monster\nas psychologically warped, as wildly hateful, or, as otherworldly--the monster, instead, is a\nfollower and a conformist; the monster is remarkably normal and utterly average... in other\nwords, the monstrous is banal, and the monster could be anyone. If the monster is no longer\nOther, then we can no longer speak of normalcy versus the monster, but only the monster as\nthe normal, or the normal as itself monstrous. If the monster is no longer an imaginary\ncreature--then the monster is the human; the human is now the monster.\n\nAnd that idea could be seen as the mantra for realist horror that we read about in Freeland, a\nhorror no longer concerned with the figure of the supernatural monster, but the ordinary,\neveryday, average, and typical monster--or even in relation to the typicality and banality Seltzer\nidentifies in relation to the serial killer as a type or category of person marked by abnormal\nnormality; typifying typicality.\n\nRealist horror is interested in, and often based on, \"true stories\": In 1974, Tobe Hooper's The\nTexas Chainsaw Massacre deployed a visual style taken directly from documentary aesthetics.\nThe film--based loosely on the murders of a real serial killer--opens with onscreen text that\nsays that announces that the film is based on a true story. While German Expressionism shows\nus a world that formal devices mark as askew and off-kilter, by the time we get to realist horror,\n\nthese films seem to be suggesting that by showing us the world exactly as it is, we can see that it\nalready horrific - horror is already in the world; it doesn't have to be created.\n\nAnd real horror (or giving us an experience of real horror) is something that after 1960 becomes\nof real interest to horror films (in particular):\n\n[marketing something as really real, really true; that mix of pleasure and intellection - screaming\nvs. talking in last line - is the affective commodity it's selling to spectators ]\n\nKey Traits of Realist Horror: - let's get them on the table:\n\nmantra \"the human as monster\"\nSpecific day, time, place - take place in our world! Camera comes in through\nmotel blinds / catches the lovers unaware, and sees all. In opening of Psycho.\nInterest in the city (urban space: anonymity/stranger)\nImage: washed-out image; drab; ordinary/plot: boring, ordinary moments\n\nFlat affect/flat realism/flat tone (no judgment)\nNB: Henry received an X-rating from MPAA (due to \"disturbing moral tone\"; pointed\nexplicitly to its amoral/neutrality towards Henry\n\nSurface / superficiality\n\nAverageness/ordinariness of killer (\"abnormal normality\")\neven killers who are shy, sympathetic or pathetic (Tony Perkins' gentle\nmanner and stutter is an example)\n\nfascination of the realistic monster (human as monster)\n\nforegrounding of spectacle over plot\n\nFreeland: plot and violence are flat and random;\n\n\"three r's: random, reductive, repetitious\" (134)\nin the realm of the possible (no supernatural elements)\nBut violence is: highly graphic; unflinching presentation of disintegrating bodies\n\nAnd there's a randomness/contingency/chance to violence;\n--Violence as a result of accident or bad luck\n\nRealist horror films are often highly self-reflexive about violence and technologies of mediation,\nso often show the processes of framing and representing violence, blur them (offers possibility of\ncritique). See this in Henry: Portrait of a Serial Killer in the video-rewatching scene/we'll talk\nabout it.\n\nRealist horror films offer a frisson (a pleasurable fright) precisely by blurring the authentic and\nthe staged, playing the one off the other. This erasure of the distinction between art and life puts\ninto play a series of terms: immediacy, presence, real-time, authenticity, truth.\n\nAnd, finally, spectacle: for in the loss of interest in stories and plots that we see in realist horror,\nwe see a new turn towards spectacle for spectacle's sake. And although the monster film was\n\ninterested in the spectacle of the monstrous body (for ex. Nosferatu's otherworldly and feral\nbody), in realist horror we have a turn to the spectacle of the victim's suffering body.\n\nSo this week is about portraits and signs, but it's also about presentation and spectacle: about\nstaging violence (though open question of who is staging: director or serial killer/film text or text\nof violence/art as murder or murder as art)...\n\nBoth of our films this week were dealing with the problem of the real by also posing the problem\nof aesthetics: portraits, staged tableaux, but also photographs, the Western literary canon, the\nstill-life.\n\nSo, we're back to the question of meaning in postmodern culture - where to find it? Can we find\nit? Is there meaning in violence or does violence obliterate meaning (such that you can't say\nanything about it), but this time it's actually about meaning (not non-meaning or nothingness): In\nSe7en, Somerset says of the staging of gluttony, why risk the time, \"Unless the act itself has\nmeaning.\"\n\nIn some ways, Se7en and Henry are opposites: one is about detection/reading and interpreting\nclues and finding meaning; the other appears to be about a refusal of retrospection or meaning\nand an outright resistance to forming a pattern. One demands to be read; one refuses to be read.\nWe'll see if we feel that way at the end.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 6 - White Masculinity at the End of the Century",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/04ef9e5e6b02c2f67ee3bf26d31a1754_MITCMS_840F13_Session_6.pdf",
      "content": "Session Six Lecture Notes: White Masculinity at the End of the Century\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nThings to read for and think about: Chuck Palahniuk's spare, taut novel Fight Club and David\nFincher's film version...\n\n1. Language and truth in language. It may seem as though in all novels you should attend to\nlanguage, but here I mean: how characters speak to each other; how speech relates to persuasion,\nseduction, argument, polemic, but also lies, also violence. Ditto in the film. Is language a\nbonding agent (we communicate with each other and understand each other better) or a\nseparating/cleaving agent (we talk and with each word understand each other less)? How does\nviolence relate to things like lies, deception, half-truths?\n\n2. What's the status of embedded media in the novel and film (photographs, other films, other\ndocuments, Xeroxes, etc.) - pay attention to the circulation of media objects and when they\nappear in each work, ask what kind of work they're doing. In the film, for example, the figure of\ncutting/splicing is very important; when/how/why does it appear?\n\n3. The Figure of Rules - what are the rules of Fight Club, and why does Fight Club take,\nrequire, order itself through rules? Are there also rules to \"Fight Club\" (the novel or film; i.e.\nformal rules)? How does the rule relate to violence - mitigate it? Amplify it?\n\n4. Finally, keep in mind the subject titling this weeks' material: White Masculinity at the End of\nthe Century. All of those things in the title matter, but especially the fourth to last word: End.\nWhat is ending or coming to a close in Fight Club (historically, nationally, ideologically) and\nhow does violence relate to that end - does it bring it about or forestall it? Mirror it or disrupt it?\nLikewise, attend to ends formally in each work - and their difference from each other.\n\nTerm 'any-space-whatever' (l'espace-quelconque) from Pascal Auge.\n\n& \"everything's a copy of a copy of a copy\" (Fight Club)\n\nAn epigraphic framing concept - look at board: term 'any-space-whatever' (l'espace-\nquelconque) from Pascal Auge.\n\nAuge used the term to describe the effects of modern urban planning on the human psyche and\ninterpersonal relations: \"An 'any space whatsoever' is a space such as a metro stop, a doctor's\nwaiting room, or an airport terminal. It is an anonymous space people pass through, ... a point\nof transit between places of 'importance', such as the metro, which is merely the space one passes\nthrough between home and work. Individuals become depersonalized....It is for this reason that\nAuge argued that the 'any space whatsoever' is a homogenous, de-singularizing space\"\n\n* What does it mean for identity and a sense of self to experience space this way?\n\np. 31, \"hotel time, restaurant food\" / \"You wake up at O'Hare.\"\nnon-differentiation of places; always passing through somewhere else\nInsomnia as form: Never quite asleep; never quite awake.\n\nThis week, we turn to three weeks on identity and politics: white masculinity; gender; and both\nnormative and queer sexualities- also start to turn towards a global thinking of violence (w/ films\nfrom France and Japan) and in some ways less \"obvious\" forms of violence (opaque violence;\nstructural violence; even violence that does not reveal itself as violence, or is contested or denied\nas forms of violence). In many ways, in our weeks on the figure of the serial killer, violence had\nan obviousness about it: violence was murdering, or torturing, or wounding. Violence itself as a\nterm will become complicated and contested in the next few weeks.\n\nEven in today's novel and film, violence appears as violence against the self, against property, as\nforms of mischief, mayhem, but also destruction, also historical annihilation, also domestic\nterrorism.\n\nLast time we met, two weeks ago, we talked about \"portraits\" and \"signs\". We talked\nabout the typical, the average, the type, the banal, the ordinariness of the serial killer or\navowals that the serial killer does not even exist, is nothing but his work (his life as form of\nart).\n\nWe talked about John Doe in Se7en: Making life into a work of art/using violence to self-\nactualize... Murder as self-improvement; Seltzer: Self-making = self-evacuating (which might be\ninteresting in a different way in relation to today's material).\n\nAnd we ended class last time by considering the Question of the witness: John Doe requires a\nwitness/archive/memory - for message to be remembered. Somerset functions as witness (ideal\nb/c does not act in proceedings/survives b/c he does not act and understands that one must\nsometimes not act)\n\nNB Somerset's view of police work: pick up the pieces, collect the evidence, note the time\nthings happen, put things into neat little piles, file it away in case it's needed (detection as\narchive/list-making/noting things down/assembling... not acting)/Somerset sees Doe as rational,\nmethodical (correctly categorizes him) vs. danger of not correctly categorizing (Mills sees him as\nlunatic: files him incorrectly).\n\nSo, last time posed the figure of violence in relation to meaning: can we \"read\" meaning into\nHenry's acts of violence or are they resistant to being read for depth and meaning; likewise, Doe\nstages his acts of violence as demanding they be read and interpreted (literal scenes of this in the\nlibrary)--but is there a way Somerset resists that imperative, by refiguring detection not as\ndetecting, but as listing, noting, assembling?\n\nTHIS WEEK: we also have figure of traces, memory, remembrance, legacy, archive,\nhistory. But it's mediated through crisis of white masculinity at the end of the century. It's not\nthe trace of a specific act of staged violence as in SE7en: it's the trace of one's legacy on history;\n\nbeing \"the middle children\" of history; the drive and desire to leave a legacy of destruction; to\ncreate a ground zero or to hit bottom; to start history over. It's a personal trace of self-\nevacuation, esp. in ending (but very different from the serial killers' relationship to emptying &\nanonymizing self).\n\nConsumerism and Identity\nMasculinity (and what \"women\" are to this text)\nCreation and destruction (self-improvement vs. self-destruction)\nLove; empathy\nReflexivity and textual self-awareness\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.430 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 7 - The Underclass and the Marginalized",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-840-at-the-limit-violence-in-contemporary-representation-fall-2013/de4d8ae34ef6643abb47748de92ab072_MITCMS_840F13_Session_7.pdf",
      "content": "Session Seven Lecture Notes: The Underclass and the Marginalized\nProfessor Eugenie Brinkema\n21L.435/CMS.840 - At the Limit: Violence in Contemporary Representation\n\nWe turned to our unit on identity and politics--with Fight Club, we talked about white\nmasculinity at the end of the century, and the anxiety of a generation of men who felt lost to\nhistory and thus attempted to produce a series of traces, scars, destruction as the creation of a\nkind of material legacy; we also talked in that class about the figure of hitting bottom, of truly\nlosing everything so that personal and national history can start again and start over. This week,\nwe're turning to figures of the underclass and marginalized; and then, after break, we look at\nsexualities and gender. (Last week was about one's temporal place in and trace on history; this\nweek is about one's place and identity in relation to globalized France.)\n\nI also mentioned last time that in some ways we're turning to less \"obvious\" forms of violence\n(opaque violence; structural violence; fantasized violence; violence with undetermined sources\nand targets; and even violence that does not reveal itself as violence, or is contested or denied as\nforms of violence).\n\nWe'll also continue to talk about the relationship between narratives of violence and formal\nissues--in particular, sound and editing this week.\n\nOur films this week are both from France, made in 1995 and 1998, and both about\nmarginalized figures, social outsiders, class and race... both films take place largely in the\nbanlieues of Paris (meaning outskirts; edges; far away from fantasy Paris - a Paris that does not\nbelong to these men). They have a lot of similarities: both are, in some ways, a story that\nbegins: \"A man once came upon a gun...\" and everything proceeds from that. But they deal\nwith violence in really different ways; and even on the level of framing - both literal and\nmetaphorical - they are very different: La Haine is about the relations within and among\ngroups (racial and ethnic and political; familial; urban and geographical; us vs. them; and even\nthe baseline community of the three friends)--on the level of literal framing, the film is littered\nwith shots of the three figures interacting, even multiplied in reflective surfaces.\n\nBy contrast, the title and the signature shot of I Stand Alone--a single person in an asymmetrical\nshot, to one side of the frame--suggests radical isolation and the breaking of community (until,\nperhaps, and problematically, the end of the film). Stylistically, they also have some things in\ncommon (editing style) but Noe, with his use of written text and verbal language, and his\nwarning to the audience, is very different from Kassovitz's more realist style, epitomized in the\nchoice to film in black and white).\n\nThis week is about the marginalized, the underclass, the outsiders on the outskirts of Paris; it is\nabout being left out, left alone, put down, pulled under, falling, or having hit bottom. And then it\nasks: what next? In some ways, both are picaresques gone wrong/nightmarish: picaresque =\nform of a novel (from picaro for rogue/rascal); often satirical, often realistic, often humorous, of\na roguish hoer (always of low social class) who lives by his wits in a corrupt society. 16th c.\nSpain. E.g. Huck Finn.\n\nQUESTIONS / DISCUSSION\n\nLa Haine -- Relation between form and narrative. B&W; quick edits; arbitrary times; realism;\nAnother key trait of the form: role of disseminated American popular culture: Taxi Driver;\nphraseology; rap music\n\nAnother comment on form: opening five minute credit sequence/newsreel/surveillance/\nimmediacy - documentary - cinema verite = cinema truth style\n\nMen or types?\nA Cop; A Skinhead; A Jew; A Black; An Arab (sometimes called \"black-blanc-beur\" - beur =\ncolloquial French term for Arab immigrants; contraction of reversed syllabus of word Arab / mix\nof ethnicities in the banlieues) - are these characters or figures?\n\n* Bonus question: Halfway through the film, a scene takes place in a restroom where an elderly\nman tells the main characters the story of a man who got left behind on a journey to a Siberian\nwork camp. After the old man tells his story and leaves, the protagonists ask \"What was the\npurpose of that story?\" I'd like to ask the same question: given the rest of the film, what is the\npurpose of the scene in the restroom?\n\nSHOW scene in bathroom (50 min. in);\nnote the reflective surfaces (pluralizes, multiplies them)\n\nAbout relations; multiplicities; community; responsibility --\n\n[One way of reading it - reminder of the horrors suffered by Eastern Europeans; everyone has a\nclaim to oppression and victimhood...]\n\nFroze to death - narrative about responsibility; failing to take responsibility for the friend.\nLeaving the friend behind. Shit is a cycle of consumption and production; an exchange; but also\na metaphor for waste, for detritus, for every form of abjection. Remember the line that Said\nkeeps repeating, \"'I'll waste you for free' -what a great line!\" To waste (shit); to waste\nsomeone; to waste one's time... to waste a life.\n\nAt the end, in standing up for his friend, Hubert will risk everything - he will be killed or have\nkilled, and in either case, that's what friendship gets you. It wastes you; but is it about love? Is\nlove, community, loyalty worth killing or being killed for? What does it mean to be your\nbrother's keeper in a world filled with forms of hate?\n\nRelation between explosiveness and boredom - nothing to do; hanging around;\nunemployment; scenes of waiting - literally: killing time; failed event - can't drive\n\nlink to Roulette: an event in which nothing or something happens; relate to time\n\nLink to narrative about being frozen to death: men with nowhere to go, nowhere to be; long\nshots, long takes of them waiting, lounging, loitering... a living frozen death.\n\nEnd of the film; death of Vinz and Hubert's response. Abruptness and even flatness of death:\nkilling seems almost accidental...\n\nRelate to the moment of inversion: the policy brutality in Paris\n\nVinz: white privilege? Hubert is de-educated; seduced towards hate.\n\n* Relate to this repeated figuration of a man falling, falling, so good so far - what matters is the\nlanding. Spatial logic of descent inscribed everywhere in the film: Said yells for Vinz to come\ndown; ordered by police to come down off the building's rooftop; have to come down and leave\nthe apartment complex in Paris; yelling from rooftop at skinheads... and of course Vincent's\nbody: falling down.\n\nLong process of continual descent. (Relatedly: ejecting/rejecting: getting kicked out of places.\nGetting expelled. Being figured as waste. If your ordinary state is of being excluded, where do\nyou go; where can you be?)\nIs the ending of the film the landing? Is the ending the fall?\n\nNoe --\nscene with daughter; death is revealed over the eye to not have taken place.\n\nGushing: of blood; of words / violence is related to profusion of things spilling\n\nRole of the gun. In each film, is it a metaphor? A catalyst? Passive brute object? Tool? Is\nviolence in it; is it inevitable as a form of \"production for use\" -- socialism\n\nAt the end of La Haine, we hear the gun, don't know target or shooter: only its force and sound.\nWhen Vinz hands Hubert the gun as a moment of renunciation, it's also a moment of Hubert's\ninscription: the gun calls/seduces/pulls you towards its use...\n\nGun does not equal event of violence; but equals condition of possibility (so what is the relation\nbetween the gun and these failed/non-events of violence?) In Noe, linked to CUTS/editing/\ncomposition and structural making of film as material object.\n\nNB scene with warning; talk about the role of written text. You have 30 seconds to leave.\nWhat does it mean to give an out; from where does order emanate?\n\nFigure of draining: film absents itself; retraction from itself / from cinematic space - \"new\nEuropean extremism\" (see also Breillat)/but what's extreme here?\n\nRelation of stylization to violence\n& Relation of violence to love\n\nLove; responsibility - do I have the right to leave Cynthia? ...but incestuous love (from being\nradically alone to overly close)/loss of difference\n\nFiguration of the Alone -- Attempt to connect: to protect daughter, kills innocent man; to\ncomfort or be with the nurse after the death, but accused and ends up killing future child; desire\nto find community, but it ends up perverted\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.840 / 21L.435 At the Limit: Violence in Contemporary Representation\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}