{
  "course_name": "Atmosphere, Ocean and Climate Dynamics",
  "course_description": "This undergraduate class is designed to introduce students to the physics that govern the circulation of the ocean and atmosphere. The focus of the course is on the processes that control the climate of the planet.\nAcknowledgments\nProf. Ferrari wishes to acknowledge that this course was originally designed and taught by Prof. John Marshall.",
  "topics": [
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Climate Studies",
    "Environmental Science",
    "Geophysics",
    "Oceanography",
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Climate Studies",
    "Environmental Science",
    "Geophysics",
    "Oceanography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nPrerequisites\n\nMultivariable Calculus (18.02) and Physics I: Classical Mechanics (8.01)\n\nDescription\n\n12.003 is an undergraduate class designed to introduce students to the physics that govern the circulation of the ocean and atmosphere. The focus of the course is on the processes that control the climate of the planet.\n\nTextbook\n\nMarshall, John, and R. Alan Plumb.\nAtmosphere, Ocean, and Climate Dynamics: An Introductory Text\n. Boston, MA: Elsevier Academic Press, 2007. ISBN: 9780125586917.\n\nOther Reading and References\n\nHartmann, Dennis L.\nGlobal Physical Climatology\n.\nInternational Geophysics Series.\nVol. 56. San Diego, CA: Academic Press, 1994. ISBN: 9780123285300.\n\nThis book is recommended as supplementary reading. It should prove useful for both atmospheric and oceanic sections of the course, especially chapters 1-7 of the book, which cover most of the material we will be covering (though in some cases it treats the material differently, and at different depth).\n\nHoughton, John Theodore.\nThe Physics of Atmospheres\n. Cambridge, UK: Cambridge University Press, 1977. ISBN: 9780521214438.\n\nFor the atmosphere, detailed treatment of radiation, and simple and intelligible treatment of dynamics.\n\nWallace, John M., and Peter Victor Hobbs.\nAtmospheric Science: An Introductory Survey\n. New York, NY: Academic Press, 1977. ISBN: 9780127329505.\n\nGood qualitative discussion of many of the topics we will cover in atmospheric science.\n\nPickard, George L., and William J. Emery.\nDescriptive Physical Oceanography An Introduction\n. Oxford, UK: Pergamon Press, 1982. ISBN: 9780080262802.\n\nOne of the few not-too-technical texts on physical oceanography.\n\nGrading\n\nThe assessment will be in four parts (with weight toward final grade):\n\nHomework assignments will be handed out each week that reviews material covered in class. These will serve a multiple purpose: As a component of the teaching process, as an assessment of performance, and as a means of providing feedback to me. (35%; the two lowest marks will be given half-weight)\n\nClass participation. (5%)\n\nA mid-term test. (20%)\n\nA final, closed book, exam on all assessable course material. (40%)\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n35%\n\nClass participation\n\n5%\n\nMidterm exam\n\n20%\n\nFinal exam\n\n40%",
  "files": [
    {
      "category": "Assignment",
      "title": "Assignment 1: The Earth's radiation budget",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/46fcd74720470edfe39c6417f08a18a9_hmk1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\nHome Textbook Lectures Assignments Observations Pictures\nAssignment I\nThe Earth's Radiation Budget\n1. I.Introduction\nThe global energy balance is important for Earth's climate. When visible radiation from the\nSun reaches the Earth, some of it is reflected or scattered directly back into space as\nshortwave radiation (the percent reflected is known as albedo) and some of it is absorbed. In\nthe absence of clouds, absorption happens mainly at the surface. The absorbed energy\nwarms the Earth's surface, which, in turn, emits this energy at a longer wavelength (infrared\nrather than visible light).\nThe purpose of this assignment is to get you thinking about the Earth's radiation budget and\nthe sorts of phenomena which may influence that budget. The description of the datasets is\ntaken from a class taught by Schlosser, Pfirman and Ting at Columbia University.\nA. How the data were collected\nThe Earth Radiation Budget Experiment (ERBE) was designed to collect information about\nsunlight reaching the Earth, sunlight reflected by the Earth, and heat released by the Earth\ninto space. Since October 1984, ERBE employed three satellites to carry the instruments\nwhich collected this information: ERBS, NOAA-9, and NOAA-10. Each satellite was equipped\nwith special instruments (scanners) that measured radiation along the satellite track and from\nspace. Radiation is measured in three wavelength bands:\n* Total: radiation in the 0.2 to 50 micron wavelength band.\n* Longwave: radiation in the 5 to 50 micron wavelength band.\n* Shortwave: radiation in the 0.2 to 5 micron wavelength band.\nTechnical information about the scanners and other information about the experiment can be\nfound in the following NASA web sites.\n1. The Earth Radiation Budget Experiment website.\n2. The NASA Educational Resources website - the Trading Card page (click on radiation\nbudget).\n3. JPL Quick-Look at ERBS website.\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\n4. A NASA Fact Online ERBE page.\nB. The structure of the ERBE dataset, and how to access it\nThe ERBE data available from the IRI/LDEO Climate Data Library contains information from\nall three ERB satellites and their combinations (for the period when the satellite provided\noverlapping observations). The data are organized by satellite, and by variable.\nOpen the ERBE dataset. (Note that you just opened a new browser window. Please move\nthat browser aside so you can continue to access it later).\nAs indicated above, the ERBE data include shortwave (solar) radiation reflected by the\nEarth's surface and longwave radiation emitted by the Earth. These data are processed by\nmonth for the duration of the satellite flight, and are provided on a grid of latitude and\nlongitude lines. On this grid, longitude varies from 1.25°E to 1.25°W by intervals of 2.5°, and\nlatitude varies from 88.75°N to 88.75°S by intervals of 2.5°. Thus, there are 144 grid points on\neach latitude and 72 latitudes overall. You can read the information on the time and space\ngrids when you click on a satellite name in the viewer. For example, in the ERBE dataset\npage you opened earlier, click on the link Climatology. This is a time averaged set created\nby using data from the NOAA 9 and NOAA 10 satellites. Each calendar month was averaged\nfor four full years of available data (February 1985 to January 1989).\nThe Climatology dataset is divided again into three data types (as are all other ERBE\ndatasets as well):\n* clear-sky: Satellite measured radiation averaged only from satellite views that were free\nof clouds.\n* cloud-forcing: The difference between clear-sky and cloudy-sky radiation, showing how\nradiation at the top of the atmosphere differs in the presence or absence of clouds.\n* total: Satellite measured radiation averaged over an entire month regardless of sky cloud\ncoverage.\nFor each of these data types, the \"data tree\" branches off further, as you can see by clicking\non their links. For example, on the NASA ERBE Climatology page, click on clear-sky. Now\nyou can see the different variables measured by the satellites, and provided by NASA in the\nERBE dataset:\n* albedo: The ratio between the shortwave radiation reflected from Earth and what is\ncoming in from space (this is a unit-less number expressed in percent).\n* longwave radiation: The longwave radiative flux emitted from Earth (in W/m2).\n* shortwave radiation: The shortwave radiative flux reflected from Earth (in W/m2).\n* net radiation: The difference between the shortwave radiative flux absorbed by the Earth\nclimate system and the longwave radiation emitted into space (in W/m2).\nAlso on this page (titled NASA ERBE Climatology clear-sky), under the section Grids, you\ncan find the Latitude and Longitude grid information described above. Note that the Time grid\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\nfor this dataset is the period of overlap between the two satellites, NOAA 9 and NOAA 10.\nMore information about the ERBE dataset can be accessed by clicking on the \"NASA ERBE\ndocumentation\" link in the blue IRI box in the upper left corner of the browser window.\nClick on albedo. Notice that the page no longer contains dataset links. You are now ready to\naccess the actual albedo data month by month and to view them using the different buttons\non the page.\nThe same set of variables is given in the total dataset. The variable list under cloud-forcing\nis somewhat different, but we will not use it.\nClick on the Views link to access the NASA ERBE Climatology clear-sky albedo data.\n2. II.Assignment\nA. Clear-Sky Albedo\nThe instructions below assume you arrived at the radiation budget data web site following the\ninstructions above.\nGo to the open viewer window displaying the NASA ERBE Climatology clear-sky albedo\ndata. Clear sky albedo is the light reflected back only from cloudless areas of the Earth's\nsurface (this is calculated by ERBE scientists by identifying cloud-free regions during each\nsatellite's observations and averaging their data separately). If the maps you are examining of\nclear sky albedo have white patches, these patches are areas so often covered by clouds\nthat we do not have enough cloud-free observations to create a reliable average.\nAll ERBE data run through the calendar months from January to December so that annual\nvariations in the measured variable can be appreciated. Use the drop-down menus and\nchange \"draw...\" to \"draw coasts\", and \"colors\" to \"colors | contours\". Set the range of the\nalbedo from 0 to 90. Click the redraw button (the circle arrow) and then click on \"plot\".\nTask 1: Study the albedo data by concentrating on the months of January, March, July and\nSeptember. Save images for each month with your browser.\n1. Identify the latitudinal and longitudinal boundaries of those parts of the Earth's surface\nthat are highly reflective and identify those that are not (implying they are strongly absorbing\nthe solar radiation).\n2. Describe how and why the albedo varies seasonally by comparing data for the four key\ncalendar months. (Maxmimum two paragraphs)\n3. Explain why there are variations of reflectivity from high to low latitudes and within\ncontinents such as Africa and North America.(Maximum one paragraph)\nB. Short Wavelength Solar Radiation Reflected from the Earth\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\nReflected short wavelength radiation (SW) is a direct measurement of short wavelength\nradiative flux reflected from the Earth's surface and is expressed in watts per meter squared.\nUnlike albedo, this is an absolute measurement and not a ratio. Remember that:\nalbedo = (reflected solar radiation) / (incoming solar radiation)\nThus, the albedo can be high where the actual reflected radiation is low. To appreciate the\ndifference, compare the fields of Climatology clear-sky shortwave radiation for January with\nthe abedo data for the same month that you have been studying earlier.\nTask 2: As before, outline the continents, set colored contours, and set the short wavelength\nrange from 0 to 400. Save images for January, March, July and September with your\nbrowser. Look at shortwave radiation and albedo over Antarctica and northern Europe, Asia\nand North America. These locations have high albedos but the clear-sky short wave radiation\nvalues there are very different. Why is this? (Maximum one paragraph)\nC. Clear-Sky Long Wavelength Radiation\nThis last data set is for the radiation that the Earth emits in response to being warmed by the\nSun. Since the Earth is much colder than the sun, its radiation to space peaks in the infrared\n(long wavelength) band of the electromagnetic spectrum. Because some components of\nEarth's atmosphere trap longwave radiation (the greenhouse effect), emission to space\noccurs not at Earth's surface, but at a higher level in the atmosphere which varies depending\non the concentration of greenhouse gases (mainly water vapor) at that location.\nGeographic variations in this data set are a result of differences in the effective temperature\n(the temperature at which the planet is emitting radiation to space) at various locations.\nEffective temperature depends both on the temperature at the surface, and on the\nconcentrations and vertical profiles of greenhouse gases.\nTask 3: Go to the NASA ERBE Climatology data page again and select the clear-sky\nlongwave radiation data. Remember to \"draw coasts\", select \"colors | contours,\" and click\n\"Redraw.\" Study the data for January, March, July and September.\n1. Write down the areas of each hemisphere that emit the least and most longwave\nradiation.\n2. Use the Stefan Boltzmann relationship (I = σT4 where σ = 5.67*10-8 Wm-2K-4) to convert\nthe minimum and maximum radiation values (for the northern and southern hemispheres in\nJanuary and July) to temperatures first in Kelvin, then in Celsius (°C = K - 273.15).\n3. 3.Describe the\noutstanding\nchanges that\noccur as you\nmove through\nthe year.\n(Maximum one\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\nparagraph)\nD. Emission Temperature of the Earth\nOpen a new browser window with the total longwave radiation dataset. We will now calculate\nthe globally averaged amount of longwave radiation in the clear-sky case. To do that, click on\nthe \"expert mode\" link in the upper right corner of the window. We will first average all the\ndata over time to look at the annual average. In the expert mode window type the following\nline of text below the text which is already present in the window:\n[T] average\nNow click the \"OK\" button to the right of the expert window. This tells the software to average\nthe data over all time slices. Each point in space is averaged separately. View this field to\nlook at the annual average total longwave radiation. Now return to expert mode and continue\ntyping underneath the first line you entered:\nY cosd mul\nThis multiplies every grid point in space by the cosine of the latitude angle (Y is the latitude\nangle in degrees, and cosd is a calculation of cosine when the angle is given in degrees). We\nneed to do that so that our grid points will be properly weighted with respect to the\ngeographical areas they represent as there are more grid points per unit area in the high\nlatitudes than in the tropics. Then type:\n[X Y] average\nCick the \"OK\" button again. The viewer will return a single number just below the expert\nwindow (in bold letters). That number is the amount of longwave radiation averaged over the\nentire globe in W/m2.\nTask 4: You can use the yearly average map of longwave radiation and the yearly and space\naverage value of longwave radiation to compute the Earth's emission temperature.\n1. 1.Use the Stefan-\nBoltzmann\nequation to\ncalculate the\nemission\ntemperature\naveraged over\nthe globe.\n1. 1.Use the Stefan-\nBoltzmann\nequation to\ncalculate the\n\nAssignment I The Earth's Radiation Budget Introduction The global energy b...e emission temperature at one of the areas of maximum longwave radiation.\nemission\ntemperature at\none of the areas\nof maximum\nlongwave\nradiation."
    },
    {
      "category": "Assignment",
      "title": "Problem set 2: Emission temperatures and greenhouse models",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/b06b7674e4cdc66ce9773e154c3fe4ff_homework2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n12.003 Physics of Atmospheres, Ocean and Climate\nProblem set 2: Emission temperatures and green\nhouse models\nDue date: September 24, 2008\n1. Suppose that the Earth is, after all, flat. Specifically, consider it to be a thin\ncircular disk (of radius 6370km), orbiting the Sun at the same distance as the\nEarth; the planetary albedo is 30%. The vector normal to one face of this\ndisk always points directly towards the Sun, and the disk is made of perfectly\nconducting material, so both faces of the disk are at the same temperature.\nCalculate the emission temperature of this disk, and compare with the result\nwe obtained for a spherical Earth.\n2. Consider the thermal balance of Jupiter. You will need the following informa\ntion about Jupiter: mean planetary radius = 69, 500km; mean radius of orbit\naround the Sun =5.19A.U. (where 1A.U. is the mean radius of the Earths orbit);\nplanetary albedo =0.51.\n(a) Assuming a balance between incoming and outgoing radiation, calculate\nthe emission temperature for Jupiter.\n(b) In fact, Jupiter has an internal heat source resulting from its gravitational\ncollapse. The measured emission temperature Te defined by\nσT e\n4 = (outgoing flux of planetary radiation per unit surface area) (1)\nis 130K. Comment in view of your theoretical prediction in part (a). Cal\nculate the magnitude of Jupiters internal heat source.\n3. The haze containing organic molecules in Titan's upper atmosphere absorb\n90% of the solar radiation reaching Titan, but is inefficient at trapping infrared\nradiation generated by the surface. Adapt the greenhouse model sketched in\nFig. 2.7 of the textbook to an atmosphere that is opaque to shortwave radiation,\nbut is transparent to infrared radiation. Compute the emission and surface\ntemperatures for such an atmosphere (assume that the incoming radiation per\nunit area is S0 and the albedo is αp). Is Titan's surface temperature warmer or\ncolder as a result of its peculiar atmosphere?\n4. For the one-layer leaky greenhouse model we considered in class suppose that,\nall else being fixed, the atmospheric absorption depends linearly on atmospheric\nCO2 concentration as\n= 0 + [CO2]1\n(2)\nwhere [CO2] is CO2 concentration (in ppm), 0 = 0.734, and 1 = 1.0 × 10-4\n(ppm)-1 . Calculate, for this model, the surface temperature:\n(a) for the present atmosphere, with [CO2] = 360 ppm\n\n(b) in pre-industrial times, with [CO2] = 280 ppm; and\n(c) in a future atmosphere with [CO2] doubled from its present value.\nCalculate the expression for the climate sensitivity using the leaky greenhouse\nmodel with the emissivity = 0 + [CO2]1. Is the climate sensitivity larger or\nsmaller in the presence of CO2?"
    },
    {
      "category": "Assignment",
      "title": "Problem set 3: Hydrostatic balance and lapse rate",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/f65ab01a771ec7d76097172e64b834ba_homework3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nProblem set 3: Hydrostatic balance and lapse rate\nDue date: October 1st, 2008\n1. A spherical spaceship with radius 10 meters is pressurized to an interior pressure\nof 1000 hPa. The exterior pressure can be regarded as zero. What is the net\nforce (in Newtons) exerted on the walls of the spaceship?\n2. Somewhere (in a galaxy far, far away) there is a planet whose atmosphere\nis just like that of the Earth in all respects but one-it contains no moisture.\nThe planets troposphere is maintained by convection to be neutrally stable to\nvertical displacements. Its stratosphere is in radiative equilibrium, at a uniform\ntemperature -80*C, and temperature is continuous across the tropopause. If\nthe surface pressure is 1000 hPa, and the equatorial surface temperature is 32*C,\nwhat is the pressure at the equatorial tropopause?\n3. For a perfect gas undergoing changes dT in temperature and dV in specific\nvolume (the inverse of density), the change ds in specific entropy, s, is given by\nTds = cvdT + pdV.\n(1)\n(a) Hence, for unsaturated air, show that potential temperature θ\n\n!k\np0\nθ = T\n(2)\np\n(notation defined in class) is a measure of specific entropy; specifically,\nthat\ns = cp ln θ + constant.\n(3)\nwhere cv and cp are specific heats at constant volume and constant pressure,\nrespectively.\n(b) Show that if the environmental lapse rate is dry adiabatic, then it has\nconstant potential temperature.\n4. In this exercise you need the measurements of pressure you collected at various\nfloors in the Green Building with a barometer. You want to use these pressure\nmeasurements to estimate the height of the Green Building and the height of\nthe 9th floor. Be careful with your units.\n(a) First derive the relationship between the height of the Green Building and\nthe pressure drop between the ground and the top of the building. Then\nuse this relationship to compute the height of the Green Building. Assume\nthat the air is at a constant temperature of T = 20*C.\n\n(b) Compute the height of the 9th floor using the pressure measurements at\nthe ground and at the 9th floor. Assume that the atmosphere is at a\nconstant temperature of T = 20*C.\n(c) Now assume that the air of the atmosphere drops with height z as T = 20*C\n+Γaz, with Γa = -6.5*C/km. Derive the relationship between the height\nof the Green Building and the pressure drop between the ground and the\ntop of the building in this case. Use this relationship to compute the height\nof the Green Building. Does your estimate differ from what you reported\nin the answer to 4a?\n5. Criticize the statement: Since the Earth's atmosphere is warmest near the\nground, it must necessarily be statically unstable.\n6. A jetliner flying at 40, 000 feet altitude has a cabin pressure equivalent to an\naltitude of 10, 000 feet. The plane pumps in ambient air, which must be heated\nor cooled to the same temperature as the air at the ground level. Does the\nplane need an air conditioner or a heater?"
    },
    {
      "category": "Assignment",
      "title": "Problem set 4: Convection and moist processes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/c4eb5cf86e6f9f4840f520a3e578efcf_homework4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nProblem set 4: Convection and moist processes Due\ndate: October 8th, 2008\n1. In class, we showed that the pressure of an isothermal atmosphere varies ex\nponentially with height. Consider now an atmosphere with uniform potential\ntemperature. Find how pressure varies with height, and show in particular that\nsuch an atmosphere has a discrete top (where p\n0) at altitude RT0/(κg),\n→\nwhere R , κ, and g have their usual meanings, and T0 is the temperature at\n1000hPa pressure.\n2. Consider an isothermal atmosphere in hydrostatic balance, with temperature\nT0 = 280K. Suppose an air parcel is moved adiabatically from the surface to an\naltitude of 10km. Determine its temperature on arrival\n(a) assuming its potential temperature is conserved during adiabatic displace\nment;\n(b) assuming its temperature decreases with altitude at the adiabatic lapse\nrate\n∂T\ng .\n∂z = -cp\nCompare and discuss. Now repeat the calculations for an atmosphere which\nhas the same surface temperature, but in which the potential temperature is\nconstant with height.\n3. Use the expression for saturated specific humidity:\nR\nes(T )\nqs =\n(1)\nRv\np\nand the following empirical (but pretty accurate) relation for saturated vapor\npressure es(T ):\nes = A exp(βT )\n(2)\nwhere A = 6.11 hPa and β = 0.067*C-1 and T is in *C, to compute from\ntabulated data of T (p) (use annual means), vertical profiles of saturated specific\nhumidity, q∗(p). Carry out your calculation using T (p) data at the equator and\nat 50*N. You will need to look up values of R and Rv in your notes.\nCompare your q? profiles with observed profiles of q, the specific humidity, at\nthe same latitudes. Comment?\nYou can obtain tabulated data here (follow detailed instructions in appendix):\nhttp://paoc.mit.edu/labweb/atmos-obs/temperature.htm and\nhttp://paoc.mit.edu/labweb/atmos-obs/specifichumidity.htm\n\nAppendix\nTo obtain data from the web, follow this example. Suppose you want to obtain\na table of annual mean T (p) at 50*N. Go to http://paoc.mit.edu/labweb/atmos\nobs/observations.htm and click on temperature on the side bar. Click on the annual\nmean T picture and you will taken through to Ingrid, a data server at Lamont.\nUnderneath the figure, in the Get Data row, click Entire data set, then click tables\n(toward the toponthe right) andthen P,Y Table. The tabulated data should pop up\nin your browser. Pick out the 50*N (not south!!) row. Thats it. The procedure is the\nsame for other data. E-mail professor if you have problems."
    },
    {
      "category": "Assignment",
      "title": "Problem set 5: Convection and moist processes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/74e6557348cfbfaf3b4aa9288edeab99_homework5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n!\nProblem set 5: Convection and moist processes\nDue date: October 15th, 2008\n1. Consider an atmospheric temperature profile at dawn with a temperature dis\ncontinuity (inversion) at 1 km, and a tropopause at 11 km, such that\nT (z) =\n⎧\n⎪\n⎨\n⎪\n⎩\n5*C\nz < 1 km\n[10 - 8(z - 1)]* C 1 < z < 11 km\n-70*C\n(1)\nz > 11 km\n(where here z is expressed in km). Following sunrise at 6 a.m. until 1 p.m., the\nsurface temperature steadily increases from its initial value of 5*C at a rate of\n3*C per hour. Assuming that convection penetrates to the level at which air\nparcels originating at the surface attain neutral buoyancy, describe the evolution\nduring this time of convection:\n(a) if the surface air is completely dry;\n(b) if the surface air is saturated.\nYou may assume that unsaturated (saturated) air parcels follow the dry (moist)\nadiabatic lapse rate of 10 K km-1 (7 K km-1) under all conditions (even at finite\ndisplacements).\n2. Investigate under what conditions we may approximate\nL dq\n(2)\ncpT\nby\nL\nd\nq\n(3)\ncpT\nin the derivation of equivalent temperature. Is this a good approximation in\ntypical atmospheric conditions?\n3. Raindrops are water drops sufficiently large that they fall with appreciable\nspeeds. A typical raindrop has a diameter of 1 mm. That of a typical cloud\ndroplet is perhaps 100 times less. Although it may be thought that cloud\ndroplets grow into raindrops by condensation, this can be shown to be false by\nsimple thermodynamic arguments. Please do so. That is, calculate the maxi\nmum size to which a cloud droplet can grow solely by condensation. You will\nneed the following:\nThe gas constant Rv for water vapor is 461.5 J/kg K.\n\nA useful approximation for the saturation vapor pressure (in hPa) as a function\nof temperature is\nlog es = 9.4041 -\n(4)\nT\nwhere the logarithm is to the base 10.\nYou may make the following assumptions:\n(a) An air parcel at a temperature of 30*C is saturated at cloud base (500\nhPa).\n(b) This parcel ascends adiabatically to the tropopause (300 hPa) without\ncondensation (i.e. the parcel becomes supersaturated).\n(c) Then excess water vapor condenses onto the nuclei that were in the parcel\nat the beginning of its ascent.\n(d) Each nucleus acquires the same amount of water.\n(e) Initially, the concentration of nuclei in the parcel is 100/cm3, which corre\nsponds to very clean air.\nHint: Dont make this problem harder than it need be. You are only trying to\nshow that cloud droplets cannot grow into raindrops by condensation of water\nvapor.\nBriefly explain why these assumptions, although they are reasonable (a cloud\nbase temperature of 1000*C will give larger droplets, but this temperature is\nabsurd), lead to a good estimate of the maximum cloud droplet size.\n4. Consider the tropical Hadley circulation in northern winter, as shown schemati\ncally in Fig.1. The circulation rises at 10*S, moves northward across the equator\nin the upper troposphere, and sinks at 20*N. Assuming that the circulation, out\nside the near- surface boundary layer, is zonally symmetric (independent of x)\nand inviscid (and thus conserves absolute angular momentum about the Earths\nrotation axis), and that it leaves the boundary layer at 10*S with zonal velocity\nu = 0, calculate the zonal wind in the upper troposphere at (a) the equator,\n(b) at 10*N, and (c) at 20*N."
    },
    {
      "category": "Assignment",
      "title": "Problem set 6: Atmospheric circulation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/40c7c768917afd7b0839855919b0bf0d_homework7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nProblem set 6: Atmospheric circulation\nDue date: November 12th, 2008\n1. Using only the equation of hydrostatic balance and the rotating equation of\nmotion, show that a fluid cannot be motionless unless its density is horizontally\nuniform. Do not assume geostrophic balance, but assume that a motionless\nfluid is subject to no frictional forces.\n2. Consider a zonally symmetric circulation (i.e., one with no longitudinal varia\ntions) in the atmosphere. In the inviscid upper troposphere, one expects such\na flow to conserve angular momentum, so that DA/Dt = 0, where\nA = Ωa 2 cos 2 φ + ua cos φ\nis the absolute angular momentum per unit mass (see Eq. 8-1 in the textbook),\nΩ is the Earth's rotation rate, u the eastward wind component, a the Earth's\nradius, and φ latitude.\n(a) Show that, for an inviscid zonally symmetric flow, the relation DA/Dt = 0\nis consistent with the zonal component of the equation of motion (using\nour standard notation, with Fx the x-component of the friction force per\nunit mass)\nDu\n1 ∂p\nDt - fv = -ρ ∂x + Fx,\nin (x, y, z) coordinates, where y = aφ (see Fig. 6.19 in the textbook).\n(b) Use angular momentum conservation to describe how the existence of the\nHadley circulation explains the existence of both the subtropical jet stream\nin the upper troposphere and the near surface trade winds.\n(c) If the Hadley circulation is symmetric about the equator, and its edge is\nat 20* latitudes, determine the strength of the subtropical jet stream.\n3. An open dish of water is rotating about the vertical axis at one revolution per\nminute. Given that the water is 1*C warmer at the edges than at the center,\nat all depths, estimate, under stated assumptions and using the following data,\ntypical azimuthal flow speeds at the free surface relative to the dish. Comment\non, and give a physical explanation for, the sign of the flow. How much does\nthe free surface deviate from its solid body rotation form?\nBriefly discuss ways in which this rotating dish experiment is a useful analogue\nof the general circulation of the Earth's atmosphere.\nAssume the equation of state for fresh water, ρ = ρref (1 - α[T - Tref ]), with\nρref = 1000 kg m-3 , α = 2 × 10-4 K-1, and Tref = 15 *, the mean temperature\nof the water in the dish. The dish has a radius of 10 cm and is filled to a depth\nof 5 cm.\n\n4. Consider the typical, zonally-averaged eastward flow component, u, shown at\nhttp://paoc.mit.edu/labweb/atmos-obs/zonalwind.htm\nand the typical overturning atmospheric circulation shown at\nhttp://paoc.mit.edu/labweb/atmos-obs/overturning.htm.\nFocus on two prominent features of the observed atmospheric circulation: (1)\nthe zonal westerly jets at midlatitudes and (2) the Hadley cell circulation in the\ntropics. Discuss how each feature will change if:\n(a) The Earth's rotation rate is twice what it is today.\n(b) The Earth spins clockwise (instead of anticlockwise).\n(c) The Earth does not rotate.\nGive qualitative answers. Do not attempt detailed calculations, because the\nproblem can become very messy.\n5. Consider the typical, zonally-averaged flow, u, shown here:\nhttp://paoc.mit.edu/labweb/atmos-obs/zonalwind.htm.\nConcentrate on the vicinity of the subtropical jet near 30*N in winter (DJF). If\nthe x-component of the frictional force per unit mass is:\nFx = νr2 u\nwhere the kinematic viscosity coefficient is ν = 1.34 × 10-5 m2s-1 and\n∂2\n∂2\n∂2\nr ≡ ∂x2 + ∂y2 + ∂z2 .\nCompare the magnitude of this eastward force with the northward or southward\nCoriolis force and thus convince yourself (and me!) that the frictional force is\nnegligible. [Hint: 10* of latitude ≈ 1100 km; the jet is at an altitude of about\n10 km. You should find that an oder of magnitude calculation will suffice to\nmake the point unambiguously.]\n6. In class we showed that friction in the bottom Ekman layers tends to steer large-\nscale atmospheric flows towards low pressure. Derive a detailed solution for the\nflow in the Ekman boundary layers. Assume that the large-scale atmospheric\nflow has a small Rossby number and express the frictional force per unit mass\nas\n∂2u\n∂2v\nFx = ν ∂z2 ,\nFy = ν ∂z2 .\nSolve for the structure of the agesotrophic velocity field as a function of depth.\n(a) The frictional force used in this problem is similar to that used in problem\n1, but the horizontal derivatives in r2 have been dropped. Do you think\nthis is a reasonable approximation? Discuss.\n\n(b) Show that the equation for the ageostrophic flow are:\n∂2ua\n-fva = ν\n,\n∂z2\n∂2va\nfua = ν\n.\n∂z2\n(c) The full velocity at the bottom of the atmosphere (z = 0) must vanish due\nto friction. Therefore the sum of the geostrophic and ageostrophic velocity\nmust be zero at z = 0, ua = -ug and va = -vg (for simplicity consider\na zonal mean flow with ug = Ug = const and vg = 0). The ageostrophic\nvelocity must also vanish as z →inf because friction becomes less and\nless important as you get into the interior of the atmosphere. Using these\nbottom and top boundary conditions show that solutions of the equations\nabove have the form,\nua = V0ez/δ cos(z/δ),\nva = V0ez/δ sin(z/δ).\nExpress the parameters δ and V0 in terms of ν, f and Ug.\n(d) Sketch the direction of the ageostrophic velocity at different depths in the\natmosphere.\n(e) Take the vertical integral of ua and va between z = 0 and z = inf. In which\ndirection does the integrated ageostrophic transport go?"
    },
    {
      "category": "Exam",
      "title": "Midterm exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/74bf587f31d9ae0b4adafd5259ce1888_midterm.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n12.003. Midterm exam\nDue date: October 20th, 2008\n1. Determine the emission temperature of the planet Venus. You may assume the\nfollowing: the mean radius of Venus' orbit is 0.72 times that of the Earth's\norbit; the solar flux S0 decreases as the square of the distance from the Sun\nand has a value of 1367W/m2 at the mean Earth orbit; Venus planetary albedo\nis 0.77. The observed mean surface temperature of the planet Venus is about\n750K. How many layers of the N-layer model described in Lecture 4 (and in\nProblem 2.1 in the textbook) would be required to achieve the same degree of\nwarming? Comment.\n2. Let us consider a typical lecture of 12.003. There are 10 students, two TAs and\none professor in a well-insulated classroom measuring 20 meters by 20 meters by\n3 meters. Each person in the classroom puts out energy at a rate of 100 Watts (1\nWatt = 1 Joule/second). The classroom is dark, except for a computer and LCD\nprojector which together consume power at a rate of 200 Watts. The classroom\nis filled with air at a pressure of 1000hPa. How much does the temperature of\nthe classroom rise during the course of a 1 hour lecture? Assume that at the\nbeginning of the class the temperature was 290K. Neglect the specific heat of\nthe walls, the furnishings, and the people inthe room!\nHint: The specific heat of air, at constant volume, is 720 Joules/Kg.\n3. The temperature profile of the tropical troposphere is maintained by moist\nconvection in the form of heavily raining cumulonimbus cloud systems. The\nstrongest updrafts lift moist air from near the surface to an altitude higher\nthan 15km. They stay buoyant due to latent heating due to condensation in\nthe rising, cooling updrafts. By the time they reach 15km, essentially all of\ntheir water vapor has condensed into liquid water or ice, which precipitates out\nof the updraft. This air spreads out to define the temperature just below the\ntropopause.\n(a) Suppose the air starts at a near-surface pressure of ps = 1000hPa, tem\nperature of 302K, and specific humidity q = 0.019 kg kg-1 . Calculate the\nair density at this pressure. Here and throughout this problem, ignore the\nvirtual effect of water vapor on the air density. Using a reference pressure\npref = 1000hPa, what is the potential temperature θ of the air?\n(b) Suppose this air is lifted to the top of the cumulonimbus clouds at an\nambient pressure of pt = 125hPa, without any external input of heat. If\nthe water all stayed as vapor, what would its potential temperature be?\nHow about its temperature?\n\n(c) If (more realistically) the water vapor condenses into cloud in the rising air\nparcel, this produces condensational heating of the rising air parcel. Sup\npose that as the air rises up to 125hPa, all of the water vapor is condensed\ninto liquid water and rained out. This provides a heat input L per unit\nmass of air, where L = 2.5 × 106J kg-1 is the latent heat of condensation.\nThis heat input takes place gradually as the air cools, but for simplicity\nassume that the heat is all added at a representative pressure pq = 700hPa.\nArgue that this will increase θ of the rising air parcel by Lq/(cpΠq), where\nΠq = (pq/pref )κ . What will its potential temperature θt now be at 125hPa?\nWhat will its temperature and density be?\n4. Suppose that the Earth's rotation axis were normal to the Earth-Sun line. The\nsolar flux, measured per unit area in a plane normal to the Earth-Sun line, is S0.\nBy considering the solar flux incident on the latitude belt bounded by latitudes\n(φ, φ + dφ), show that F , the 24-hr averaged flux per unit area of the Earth's\nsurface, varies with latitude as,\nS0\nF =\ncos φ.\n(1)\nπ\nUsing this result, suppose that the atmosphere is completely transparent to\nsolar radiation such that, separately at each latitude, the radiation budget can\nbe represented by the single slab model shown in Fig. 2.7 of the text book.\nDetermine how surface temperature varies with latitude.\n5. [Bonus point] What topic did you find most interesting in the first part of the\nclass? And which one was the least interesting?\nThe midterm exam is to be done by you as an INDIVIDUAL: no group ef\nforts. You can either print or handwrite your answers, but make sure that\nthe text is neatly written. Full credit requires proper units be included.\nAny plot must be completely and unambiguously labeled, including title\nand axes. Show ALL math steps. Good luck!"
    },
    {
      "category": "Resource",
      "title": "GFD VI: Inertial Circles - Visualizing the Coriolis Force",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/fe5b07f06f466a80406b55fb96442a0f_inertial_circle.pdf",
      "content": "Inertial circles - visualizing the Coriolis force: GFD VI\nJohn Marshall\nFebruary 9, 2003\nAbstract\nWe study the trajectories of dry ice pucks launched over the surface of a smooth,\nrotating parabola viewed from both inertial and rotating frames. Experiments are\ndescribed which are designed to help us come to a deeper understanding of frames of\nreference and the Coriolis force.\nIntroduction\nIn this laboratory we study the trajectory of a 'frictionless' dry ice puck sliding over a smooth\nparabolic surface. The parabola available in the lab was manufactured by pouring resin in to\na mold on a table turning at a rate f = 2Ω = 3 rad s-1 and allowing it to solidify forming a\nhighly smooth surface: it is a metre in diameter and a centimeter or so deeper in the center\nthan at the periphery - see Fig.1 and section 4.2 of the appendix.1\nPlace the parabola on the rotating table and, for the moment, do not spin the table up.\nLaunch the puck along a radius toward its center. The puck oscillates along a straight line\npassing through the origin. Its trajectory is governed by the equation:\nd2r\ndh\n= -g\n(1)\ndt2\ndr\nwhere r is the distance of the puck from the center of the parabola, g is the acceleration due\nto gravity and h(r) is the shape of the parabolic surface. The restoring force on the puck is\njust gravity resolved in the direction of the surface. Because the surface is parabolic i.e. of\nthe form h = h(0) + ar2, where a is a constant and h(0) is the depth of the parabola at the\ncentre, then dh = 2ar - thus the restoring force in Eq.(1) is linear in r increasing toward\ndr\nthe edge of the parabola where the surface tilt is most pronounced. Because of this linearity\nin the restoring force, the puck performs simple harmonic motion.\n1The\nprocedure\nused\nto\nmanufacture\nthe\nparabola\nis\ndescribed\nhere:\nhttp://paoc.mit.edu/labweb/parabolic_surface.htm.\n\n1 INTRODUCTION\nFigure 1: Experiments with ball bearings and dry ice 'pucks' on a rotating parabola. A corotating\ncamera views the scene from above.\nFigure 2: Trajectory of the puck on the rotating parabolic surface in (a) the inertial frame and\n(b) the rotating frame of reference. The parabola is rotating in an anticlockwise (cyclonic) sense.\n\n1 INTRODUCTION\nNow spin up the parabolic surface by rotating the table at rate f = 2Ω = 3 rad s-1\n(the speed used to manufacture the parabola), in an anticlockwise direction. If the surface\nof the parabola is indeed frictionless, then the puck, launched as before, will perform simple\nharmonic motion in a straight line even though the parabola is rotating beneath. This can\nbe seen in Fig.2a where the trajectory of an observed puck in the inertial (fixed) frame of\nreference is plotted. Note that because it is impossible to reduce frictional effects to zero, in\npractice the straight line is dragged out in to an ellipse.\nBut what do we observe if we place ourselves in a frame of reference rotating with the\ntable? The trajectory of the puck when viewed in the rotating frame (recorded by an overhead\ncamera co-rotating with the parabola) is shown in Fig.2b. The puck moves in circles! The\nequation that governs the trajectory in the rotating frame is very different from Eq.(1) and\ninvolves, as we shall see, the Coriolis force which 'deflects the puck to the right'. The circular\ntrajectories - which are called 'inertial circles' - are commonly observed in the atmosphere\nand ocean. They are a consequence of observing the motion in a rotating frame of reference.\nThe parabolic surface used in our experiments has the shape that the free surface of a\nfluid takes up in solid body rotation in a tank rotating at rate Ω - see section 4.2:\nΩ2r2\nh = h(0) +\n(2)\n2g\nwhere Ω is the rotation rate of the table. The surface defined by Eq.(2) is an equipotential\nsurface and so a body carefully placed on it at rest should remain at rest. Indeed if we place\na ball-bearing on the parabolic surface rotating at speed Ω, then we see that it does not fall\nin to the center but instead finds a state of rest in which the component of gravitational\nacceleration acting on it resolved along the parabolic surface, gH , is exactly balanced by\nthe outward-directed horizontal component of the centrifugal acceleration resolved in the\nsurface, (Ω2r)H , as sketched in Fig. 3.\ndh = -Ω2\nIn the case that h is given by Eq.(2), the restoring force -g dr\nr, Eq.(1) takes on\nthe form:\nd2r = -Ω2 r.\n(3)\ndt2\nand describes simple harmonic motion with frequency Ω.\nThe experiments we now describe are designed to help us come to a deeper understanding\nof frames of reference and the Coriolis acceleration. We use our rotating parabolic surface in\nconjunction with ball-bearings and a frictionless dry ice 'puck' to study trajectories in the\ninertial and rotating frames.\n\nEXPERIMENTAL PROCEDURE\n\nFigure 3: If a parabola of the form given by Eq.(2) is spun at rate Ω, then a ball carefully placed\non it at rest does not fall in to the center but remains at rest.\nExperimental procedure\nWe can now play games with the dry ice puck and study its trajectory on the parabolic\nturntable, both in the rotating and laboratory frames. It is useful to view the puck from\nthe rotating frame using an overhead co-rotating camera. The following are useful reference\nexperiments:\n1. set up the parabola on the rotating table and adjust the speed of rotation to match\nthat which was used to manufacture it. The exact Ω can be checked by placing a ball\nbearing on the parabola so that is motionless in the rotating frame of reference: at the\n'correct' Ω the ball can be made motionless - at which point the balance of forces as\nsketched Fig.(3) - without it riding up or down the surface. In the laboratory frame\nthe ball follows a circular orbit around the center of the dish.\n2. launch the puck on a trajectory that lies within a fixed vertical plane containing the\naxis of rotation of the parabolic dish. Viewed from the laboratory the puck moves\nbackwards and forwards along a straight line (the straight line will expand out in to an\nellipse if the frictional coupling between the puck and the rotating disc is not negligible\n- see Fig.2). When viewed in the rotating frame, however, the trajectory appears as\na circle tangent to the straight line. This is the experiment from which the results\npresented in Fig.2 are shown. These circles are called 'inertial circles' - see theory\nbelow.\nCompute the period of the oscillations of the puck in the inertial and rotating frames.\nHow do they compare to one-another and Ω?\nCompute the trajectory of the puck by using the theory of inertial circles presented in\n\nTHEORY OF INERTIAL CIRCLES\n\nsection 3 and compare to the observed trajectory - see 4. below\n3. again place the puck so that it appears stationary in the rotating frame, and then\nslightly perturb it. In the rotating frame the puck undergoes inertial oscillations con\nsisting of small circular orbits passing through the initial position of the unperturbed\npuck.\n4. use the particle tracking software to compute the trajectories of the particles and\ncompare them to the theory of inertial circles presented below.\nTheory of Inertial circles\nIt is straightforward to analyze the motion of the puck in our experiment. We adopt a\nCartesian (x, y) coordinate in the rotating frame of reference whose origin is at the center\nof the parabolic surface. The velocity of the puck on the surface is urot = (u, v) where\nurot = dx/dt and vrot = dy/dt. Further we assume that z increases upwards in the direction\nof Ω.\n3.1\nRotating frame\nThe law of motion of the puck traversing the frictionless parabolic surface are given by\nEq.(15) of the appendix, which we write out again here:\ndurot = -2Ω × urot\ndt\nLet's write out Eq.(15) in component form. Noting that:\n2Ω × urot = (0, 0, 2Ω) × (urot, vrot, 0) = (-2Ωvrot, 2Ωurot, 0)\nthe two horizontal components of Eq.(15) are:\ndurot\ndvrot\n- 2Ωvrot = 0;\n+ 2Ωurot = 0\n(4)\ndt\ndt\ndx\ndy\nurot =\n; vrot =\n.\ndt\ndt\nIf we launch the puck from the origin of our coordinate system x(0) = 0; y(0) = 0 (chosen\nto be the center of the rotating dish) with speed urot(0) = 0; vrot(0) = vo, the solution to the\nabove is:\n\nTHEORY OF INERTIAL CIRCLES\n\nFigure 4: Trajectory of the puck studied in Section 3 in the inertial frame (straight line) and the\nrotating frame (circle). The scale of the axes are 2\nv\nΩ\no . We launch the puck from the origin of our\ncoordinate system x(0) = 0; y(0) = 0 (chosen to be the center of the rotating dish) with speed\nu(0) = 0; v(0) = vo.\nurot (t) = vo sin 2Ωt; vrot (t) = vo cos 2Ωt\nvo\nvo\nvo\nx (t) =\n-\ncos 2Ωt; y (t) =\nsin 2Ωt\n2Ω\n2Ω\n2Ω\nThe puck's trajectory in the rotating frame is a circle - see Fig. 4 which should be\ncompared with that observed in the experiment plotted in Fig.2b. The puck moves around\na circle of radius of 2\nv\nΩ\no in a clockwise direction (anticyclonically) with a period Ω\nπ .\n3.2\nInertial frame\nNow let us consider the same problem but in the non-rotating frame. The acceleration in\na frame rotating at angular velocity Ω is related to the acceleration in an inertial frame of\nreference by Eq.(9). And so, if the balance of forces is du\ndt\nrot = -2Ω × urot these two terms\ncancel out in Eq.(9), and it reduces to:\nduin = Ω × Ω × r.\n(5)\ndt\nIf the origin of our inertial coordinate system lies at the center of our dish, then the above\ncan be written out in component form thus:\n\n4 APPENDIX\nduin\ndvin\n+ Ω2 x = 0;\n+ Ω2 y = 0\n(6)\ndt\ndt\nwhere in means inertial. This should be compared to the equation of motion in the rotating\nframe - see Eq.(4). Note that Eq.(6) is just Eq.(3).\nThe solution is:\nuin (t) = 0; vin (t) = vo cos Ωt\nvo\nxin (t) = 0; yin (t) =\nsin Ωt\nΩ\nThe trajectory in the inertial frame is a straight line - see Fig. 4. The length of the line\nis twice the diameter of the inertial circle and the frequency of the oscillation is one-half\nthat observed in the rotating frame.\nThe above solutions go a long way to explaining what is observed in the experiments\ndescribed above and expose many of the curiosities of rotating versus non-rotating frames of\nreference.\nAppendix\n4.1\nTransformation in to rotating coordinates\nImagine that the puck in our rotating parabola experiment has velocity uin in the inertial\nframe. Viewed on the rotating frame, however, it has velocity urot. The two velocities are\nrelated through - as is evident from Fig. 5:\nuin = urot + Ω × r ,\n(7)\nwhere r is the position vector of a parcel in the rotating frame and Ω × r is the vector product\nof Ω and r. Here\nμ\n¶\nμ\n¶\nd\nd\nuin =\nr\n;\nurot =\nr\ndt\ndt\nin\nrot\nd\nwhere\n¡\ndt r\n¢\nin, rot is the rate of change of position of the puck measured in the respective\nframes. Eq.(7) suggests the following 'rule' for transforming the rate of change of vectors\nbetween frames:\n\n4 APPENDIX\nFigure 5: On the left is the velocity vector of a particle uin in the inertial frame. On the right is\nthe view from the rotating frame. The particle has velocity urot in the rotating frame. The relation\nbetween uin and urot is uin = urot + Ω × r where Ω × r is the velocity of a particle fixed (not\nmoving) in the rotating frame at position vector r.\nμ\n¶\nμ\n¶\nd\nd\n=\n+ Ω×\n(8)\ndt\ndt\nin\nrot\nA more rigorous derivation of Eq.(8) can be found in Chapter 6 of the 12.003 notes.\nCombining Eqs.(7) and (8) we see that:\nμ\n¶\nμ\n¶\nμμ\n¶\n¶\nduin\nd\nd\n=\n(urot + Ω × r) =\n+ Ω×\n(urot + Ω × r)\n(9)\ndt\ndt\ndt\nin\nin\nrot\nμ\n¶\ndurot\n=\n+ 2Ω × urot + (Ω × Ω × r)\ndt\nrot\nThus the equation of motion of the puck in the inertial frame is:\nμ\n¶\nduin\n= applied forces/unit mass = F\n(10)\ndt\nin\nwhere, in the absence of friction,\nF = -gbz\n(11)\nis the gravitational acceleration acting on the puck, with bz a unit vector in the vertical.\nUsing Eq.(9), Eq.(10) can be written in the rotating frame thus:\n\n4 APPENDIX\ndurot\n= -2Ω × u + -Ω × Ω × r -gbz\n(12)\nμ\ndt\n¶\n|\n{z\n}\n|\n{z\n}\nrot\nCoriolis\nCentrifugal\nacceln\nacceln\nNote that Eq.(12) is the same as Eq.(10) except that u = urot and 'apparent' accelera\ntions, introduced by the rotating reference frame, have been placed on the right-hand side\nof Eq.(12) [just as in the gradient wind equation that describes the radial inflow experi\nment, GFDIII]. The apparent accelerations are given names: the centrifugal acceleration\n(-Ω × Ω × r) is directed radially outward - see Fig.5; the Coriolis acceleration (-2Ω × u)\nis directed 'to the right' of the velocity vector (if Ω > 0 as sketched in Fig.6).\n4.1.1\nCentrifugal and Coriolis acceleration\nBecause centrifugal acceleration can be expressed as the gradient of a potential thus\nμ\n¶\nΩ2r2\n-Ω × Ω × r =∇\n\nit is convenient to combine ∇\nΩ2\nr2\nwith gbz = ∇(gz) - the gradient of the gravitational\npotential, gz - and write Eq.(12) in the succinct form:\nμ\n¶\ndurot\n= -2Ω × urot -∇φ\n(13)\ndt\nrot\nwhere\nΩ2r2\nφ = gz -\n(14)\nis the modified (by centrifugal accelerations) gravitational potential 'measured' in the rotat\ning frame.\nBecause our parabolic surface is constructed to ensure that φ=constant, ∇φ = 0, and so\nEq.(13) reduces to:\ndurot = -2Ω × urot\n(15)\ndt\nThis is the equation of motion governing the puck on the parablolic surface in the rotating\nframe. With the signs shown, the parcel would turn to the right in response to the Coriolis\nforce if Ω > 0.\n\n4 APPENDIX\nFigure 6: A fluid parcel moving with velocity urot in a rotating frame experiences a Coriolis\nacceleration -2Ω× urot, directed 'to the right' of urot if, as here, Ω is upwards, corresponding to\nanticyclonic rotation - like that of the northern hemisphere viewed from above the north pole; for\nthe southern hemisphere, the sign of rotation is reversed and the deflection is to the left.\nFigure 7: Water placed in a rotating tank and insulated from external forces (both mechanical\nand thermodynamic) eventually comes in to solid body rotation in which the fluid does not move\nrelative to the tank. In such a state the free surface of the water is not flat but takes on the shape\nof a parabola given by Eq.(2).\n4.2\nThe parabolic rotating table\nSuppose we filled a tank with water, set it turning and leave it until it comes in to solid\nbody rotation. We note that the free-surface of the water is not flat - it is depressed in the\nmiddle and rises up slightly to its highest point along the rim of the tank, as sketched in\nFig. 7. What's going on?\nIn solid-body rotation, urot = 0 and so Eq.(13) implies that ∇φ = 0 and so\nΩ2r2\ngz -\n= constant\n(16)\nis just the modified gravitational potential, Eq.(14). We can determine the constant of\nproportionality by noting that at r = 0, z = h(0), the height of the fluid in the middle of\n\n4 APPENDIX\nthe tank. Hence the depth of the fluid h is given by Eq.(2). The free surface takes on a\nparabolic shape: it tilts so that it is always perpendicular to the vector g ∗ (gravity modified\nby centrifugal forces) given by g ∗ = -gbz - Ω × Ω × r. If we hung a plumb line in the frame\nof the rotating table it would point in the direction of g ∗ i.e. slightly outwards rather than\ndirectly down.\nThe parabola available in the lab was manufactured by pouring resin in to a mold on a\ntable turning at rate f = 2Ω = 3 rad s-1 and allowing it to set to form a highly smooth\nsurface. Let us estimate the 'dip' of the free surface of the parabola by inserting numbers\nin to Eq.(??). If f = 3, as for the parabola available in the lab, Ω = 1.5 s-1, the radius of\nthe tank is 0.50 m, then with g = 9.81 m s-2, we find Ω\ng\nr2 ∼ 2. 9 × 10-2m or about 3 cm, a\nnoticeable effect."
    },
    {
      "category": "Resource",
      "title": "Table of Contents",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/cf50acd7bcd19d8eb5c1d01714467d13_contents.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n12.003 Atmosphere, Ocean and Climate Dynamics\n\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nContents\n0.1 Preface . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n0.1.1\nNatural fluid dynamics . . . . . . . . . . . . . . . . . . 10\n0.1.2\nRotating fluid dynamics . . . . . . . . . . . . . . . . . 13\n0.1.3\nHolicism . . . . . . . . . . . . . . . . . . . . . . . . . . 16\nI\nThe Atmosphere\n1 Characteristics of the atmosphere\n1.1 Geometry . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n1.2 Chemical composition of the atmosphere . . . . . . . . . . . . 22\n1.3 Physical properties of air . . . . . . . . . . . . . . . . . . . . . 23\n1.3.1\nMoist air . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n2 The global energy balance\n2.1 Effective planetary temperature (emission temperature) . . . . 29\n2.2 The atmospheric absorption spectrum . . . . . . . . . . . . . . 33\n2.3 The greenhouse effect . . . . . . . . . . . . . . . . . . . . . . . 34\n2.3.1\nA simple greenhouse model . . . . . . . . . . . . . . . 36\n2.3.2\nA leaky greenhouse . . . . . . . . . . . . . . . . . . . . 38\n2.3.3\nA more opaque greenhouse . . . . . . . . . . . . . . . . 39\n3 The vertical structure of the atmosphere\n3.1 Vertical distribution of temperature and 'Greenhouse gases' . . 43\n3.1.1\nTypical temperature profile . . . . . . . . . . . . . . . 43\n3.1.2\nAtmospheric layers . . . . . . . . . . . . . . . . . . . . 45\n3.2 The relationship between pressure and density: hydrostatic\nbalance . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 48\n3.3 Vertical structure of pressure and density . . . . . . . . . . . . 50\n\nCONTENTS\n3.3.1\nIsothermal atmosphere . . . . . . . . . . . . . . . . . . 50\n3.3.2\nNon-isothermal atmosphere . . . . . . . . . . . . . . . 51\n3.3.3\nDensity . . . . . . . . . . . . . . . . . . . . . . . . . . 52\nConvection\n4.1 The nature of convection . . . . . . . . . . . . . . . . . . . . . 53\n4.1.1\nConvection in a shallow fluid . . . . . . . . . . . . . . . 53\n4.1.2\nInstability . . . . . . . . . . . . . . . . . . . . . . . . . 54\n4.2 Convection in water (an almost-incompressible fluid) . . . . . . . 56\n4.2.1\nBuoyancy . . . . . . . . . . . . . . . . . . . . . . . . . 56\n4.2.2\nStability . . . . . . . . . . . . . . . . . . . . . . . . . . 57\n4.2.3\nEnergetics . . . . . . . . . . . . . . . . . . . . . . . . . 58\n4.2.4\nGFD Lab II: convection . . . . . . . . . . . . . . . . . 59\n4.3 Dry convection in a compressible atmosphere . . . . . . . . . . 63\n4.3.1\nThe adiabatic lapse rate . . . . . . . . . . . . . . . . . 63\n4.3.2\nPotential temperature . . . . . . . . . . . . . . . . . . 65\n4.4 The atmosphere under stable conditions . . . . . . . . . . . . 68\n4.4.1\nGravity waves . . . . . . . . . . . . . . . . . . . . . . . 68\n4.4.2\nTemperature inversions . . . . . . . . . . . . . . . . . . 71\n4.5 'Moist' convection . . . . . . . . . . . . . . . . . . . . . . . . . 72\n4.5.1\nHumidity . . . . . . . . . . . . . . . . . . . . . . . . . 73\n4.5.2\nSaturated adiabatic lapse rate . . . . . . . . . . . . . . 74\n4.5.3\nRadiative-convective equilibrium . . . . . . . . . . . . 75\n4.6 Convection in the atmosphere . . . . . . . . . . . . . . . . . . 76\n4.6.1\nConvective clouds . . . . . . . . . . . . . . . . . . . . . 76\n4.6.2\nOccurrence and depth of convection . . . . . . . . . . . 77\n4.6.3\nWhere does convection occur? . . . . . . . . . . . . . . 78\n5 The Meridional Structure of the Atmosphere\n5.1 Temperature . . . . . . . . . . . . . . . . . . . . . . . . . . . . 81\n5.1.1\nLatitudinal dependence of incoming radiation . . . . . 81\n5.1.2\nLatitudinal dependence of outgoing radiation . . . . . . 82\n5.1.3\nMeridional structure of temperature . . . . . . . . . . . 84\n5.1.4\nThe energy balance of the atmosphere . . . . . . . . . 87\n5.2 Pressure and geopotential height . . . . . . . . . . . . . . . . . 88\n5.2.1\nThe height of pressure surfaces . . . . . . . . . . . . . 88\n5.2.2\nGeopotential surfaces . . . . . . . . . . . . . . . . . . . 89\n5.3 Moisture . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 90\n\nCONTENTS\n5.4 Winds . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 95\n5.4.1\nDistribution of winds . . . . . . . . . . . . . . . . . . . 95\n6 The equations of fluid motion\n6.1 Differentiation following the motion . . . . . . . . . . . . . . . 103\n6.2 Equation of motion for a nonrotating fluid . . . . . . . . . . . 106\n6.2.1\nForces on a fluid parcel . . . . . . . . . . . . . . . . . . 106\n6.2.2\nThe equation of motion . . . . . . . . . . . . . . . . . . 110\n6.2.3\nHydrostatic balance . . . . . . . . . . . . . . . . . . . . 111\n6.3 The continuity equation . . . . . . . . . . . . . . . . . . . . . 111\n6.3.1\nIncompressible flow . . . . . . . . . . . . . . . . . . . . 112\n6.3.2\nCompressible flow . . . . . . . . . . . . . . . . . . . . . 112\n6.4 Equation of motion for a rotating fluid . . . . . . . . . . . . . 114\n6.4.1\nGFD Lab III: radial inflow . . . . . . . . . . . . . . . . 114\n6.4.2\nTransformation into rotating coordinates . . . . . . . . 119\n6.4.3\nThe rotating equation of motion . . . . . . . . . . . . . 121\n6.4.4\nExperiments with Coriolis forces on a parabolic rotat-\ning table . . . . . . . . . . . . . . . . . . . . . . . . . . 123\n6.4.5\nGeostrophic motion . . . . . . . . . . . . . . . . . . . . 129\n6.4.6\nThe Taylor-Proudman Theorem . . . . . . . . . . . . . 132\n6.4.7\nThe thermal wind equation . . . . . . . . . . . . . . . 135\n6.4.8\nSubgeostrophic flow: the Ekman layer . . . . . . . . . 143\n6.5 Putting things on the sphere . . . . . . . . . . . . . . . . . . . 148\n6.5.1\nGFD Lab X: An experiment on the Earth's rotation . . 148\n6.5.2\nThe centrifugal force, modified hydrostatic balance and\ngeopotential surfaces on the sphere . . . . . . . . . . . 150\n6.5.3\nComponents of the Coriolis force on the sphere: the\nCoriolis parameter . . . . . . . . . . . . . . . . . . . . 152\n6.6 Geostrophic balance on the sphere . . . . . . . . . . . . . . . . 154\n6.6.1\nSmall Rossby number flow . . . . . . . . . . . . . . . . 154\n6.7 Thermal wind in pressure coordinates . . . . . . . . . . . . . . 163\n6.7.1\nThermal wind expressed in terms of potential temper-\nature . . . . . . . . . . . . . . . . . . . . . . . . . . . . 164\n7 The general circulation of the atmosphere\n7.1 The tropical Hadley circulation . . . . . . . . . . . . . . . . . 169\n7.2 The midlatitude circulation . . . . . . . . . . . . . . . . . . . 173\n7.2.1\nEnergy stored in the thermal wind . . . . . . . . . . . 174\n\nCONTENTS\n7.2.2\nAvailable potential energy . . . . . . . . . . . . . . . . 175\n7.2.3\nBaroclinic instability . . . . . . . . . . . . . . . . . . . 178\n7.2.4\nGFD Lab XI: baroclinic instability of the thermal wind 180\n7.3 The 'big picture' of the atmospheric heat (and momentum)\nbudget . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 182\n7.3.1\nEnergy requirements, as deduced from observations . . 182\n7.3.2\nIncorporating eddy transfer in to our general circula-\ntion theory . . . . . . . . . . . . . . . . . . . . . . . . 185\nII\nThe Ocean\n8 The ocean and its circulation\n8.1 Physical characteristics of the ocean . . . . . . . . . . . . . . . 192\n8.1.1\nProperties of seawater; equation of state . . . . . . . . 193\n8.1.2\nTemperature and salinity structure . . . . . . . . . . . 196\n8.1.3\nThe mixed layer and thermocline . . . . . . . . . . . . 201\n8.2 The observed circulation . . . . . . . . . . . . . . . . . . . . . 204\n8.3 Inferences from geostrophic and hydrostatic balance . . . . . . 207\n8.3.1\nOcean surface structure and geostrophic flow . . . . . . 208\n8.3.2\nDeep geostrophic flow . . . . . . . . . . . . . . . . . . 211\n9 The wind-driven circulation\n9.1 The wind stress and Ekman layers . . . . . . . . . . . . . . . . 213\n9.1.1\nBalance of forces in the Ekman layer . . . . . . . . . . 215\n9.1.2\nWind-driven Ekman pumping . . . . . . . . . . . . . . 216\n9.2 Response of the interior ocean to Ekman pumping . . . . . . . 220\n9.2.1\nInterior balances . . . . . . . . . . . . . . . . . . . . . 220\n9.2.2\nTaylor-Proudman on the sphere . . . . . . . . . . . . . 221\n9.2.3\nGFD Lab XIII: Wind-driven ocean gyres . . . . . . . . 225\n9.2.4\nThe wind-driven gyres and western boundary currents 226\n9.3 The depth-integrated circulation . . . . . . . . . . . . . . . . . 228\n9.3.1\nMass transport of gyres: western boundary current\nspeeds . . . . . . . . . . . . . . . . . . . . . . . . . . . 231\n9.4 Effects of inhomogeneity . . . . . . . . . . . . . . . . . . . . . 231\n9.4.1\nTaylor-Proudman in a layered ocean . . . . . . . . . . 233\n9.5 Ocean eddies . . . . . . . . . . . . . . . . . . . . . . . . . . . 236\n9.5.1\nObservations of ocean eddies . . . . . . . . . . . . . . . 236\n\nCONTENTS\n9.5.2\nBaroclinic instability in the ocean . . . . . . . . . . . . 238\n10 The thermohaline circulation of the ocean\n10.1 Sources of deep water . . . . . . . . . . . . . . . . . . . . . . . 243\n10.2 Time scales and intensity of thermohaline circulation . . . . . 249\n10.3 Abyssal circulation schematic deduced from 'Taylor-Proudman' 250\n10.4 Observations of the abyssal circulation . . . . . . . . . . . . . 252\n10.5 GFD Lab XIV: The thermohaline circulation . . . . . . . . . . 257\n10.6 Why western boundary currents? . . . . . . . . . . . . . . . . 258\n10.6.1 GFD Lab XV: Source sink flow in a rotating basin . . . 260\n11 The ocean's role in climate\n11.1 Ocean Heat storage . . . . . . . . . . . . . . . . . . . . . . . . 263\n11.2 Ocean heat transport . . . . . . . . . . . . . . . . . . . . . . . 264\n11.2.1 Mechanisms of ocean heat transport . . . . . . . . . . 266"
    }
  ]
}