{
  "course_name": "Atomic and Optical Physics II",
  "course_description": "This is the second of a two-semester subject sequence beginning with Atomic and Optical Physics I (8.421) that provides the foundations for contemporary research in selected areas of atomic and optical physics. Topics covered include non-classical states of light–squeezed states; multi-photon processes, Raman scattering; coherence–level crossings, quantum beats, double resonance, superradiance; trapping and cooling-light forces, laser cooling, atom optics, spectroscopy of trapped atoms and ions; atomic interactions–classical collisions, quantum scattering theory, ultracold collisions; and experimental methods.",
  "topics": [
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n8.05 Quantum Physics II\n\nMain Topics\n\nQuantum states and dynamics of photons.\n\nPhoton-Atom interactions: basics and semiclassical approximations.\n\nPhoton-Atom interactions: open system dynamics, optical Bloch equations.\n\nApplications and limits of the optical Bloch equations: dressed atoms, light force, decoherence.\n\nCold atoms, quantum states, and quantum dynamics: quantum algorithms and protocols, ion traps, magnetic traps, evaporative cooling, Bose-Einstein condensation.\n\nRequirements\n\nThere will be ten problem sets. Assignments will usually be due one week after they have been handed out. There will be no quiz or final exam, but a term paper at the end of the course. This will be a paper in the style of a publication in Physical Review Letters on a topic of mutual interest (see below). The term paper and the homework have equal weight for the total grade. The term paper will be due on the day of the last class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAssignments\n\n50%\n\nTerm Paper\n\n50%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nQED Hamiltonian\n\nQuantum description of light\n\nNon-classical light, squeezing\n\nSingle photons\n\nHomework 1 due\n\nEntangled states\n\nMetrology, shot noise and Heisenberg limit\n\ng_2 for atoms and light\n\nDiagrams for light-atom interactions\n\nHomework 2 due\n\nVan der Waals and Casimir interactions\n\nHomework 3 due\n\nCasimir force\n\nHomework 4 due\n\nResonant interactions\n\nDerivation of optical Bloch equations\n\nSolutions of optical Bloch equations\n\nHomework 5 due\n\nUnraveling Open System Quantum Dynamics\n\nLight forces part 1 and part 2\n\nHomework 6 due\n\nDressed atom part 1 and part 2\n\nTechniques for ultralow temperatures (magnetic trapping, evap. cooling)\n\nHomework 7 due\n\nBose gases, BEC, superfluid to Mott insulator transition\n\nHomework 8 due\n\nFermi gases, BEC-BCS crossover\n\nHomework 9 due\n\nIon trapping and quantum gates\n\nHomework 10 due",
  "files": [
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/d05744a933d5ca180b89f2caa6234695_MIT8_422S13_hw1.pdf",
      "content": "Z\nMIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nFebuary 13, 2011\nAssignment #1\nDue: Friday, February 22, 2013\n1. Properties of the coherent state |α)\n(a) Compute the overlap of two coherent states (α|β), for arbitrary complex α and β.\n(b) Prove that the coherent states form an over-complete basis, that is\nd2α\n|α)(α|\n= I .\n(1)\nπ\nA B\nA+B+[A,B]/2\n(c) The BCH Lemma states that e e\n= e\nfor operators A and B satisfying\n[A, B] = c, where c is a complex number. Use this lemma to prove that the displacement\nh\nm\noperator D(α) defined by D(α)|0) = |α) may be written as D(α) = exp αa+ -α∗ a .\nh\nm\n(d) Let the electric field operator be Ex(t) = E0 a(t) + a+(t) sin(kz), where E0 =\na\nlω/V E0 is the average electric field created by one photon inside the cavity vol\nume V . For a freely evolving coherent state |α) = |α(t)), compute the average elec\ntric field (Ex) = (α|Ex(t)|α) and the root-mean-square deviation of the electric field\na\na\na\n(ΔE2) =\n(α|E2(t)|α) -|(Ex)|2 . Why is\n(ΔE2) independent of time and field\nx\nx\nx\nstrength |α|? Why does this result hold even for the vacuum state α = 0?\n(e) In quantum mechanics, there is no unique choice for a phase operator. To better under\nstand the phase properties of a state, here we give you one possible definition of a phase\niθ\nprobability distribution. For a coherent state |α) with α = |α|e\nit can be defined as\nbeing\n\nP (φ) =\n|\n(n|e -inφ|α)|2 ,\n(2)\n2π\nn\n2π\nwhich can be shown to obey the normalization condition\ndφP (φ) = 1. Show that\nthis definition gives the expected results for coherent states, which for large values of α\napproach classical states. Show that this definition gives an undefined phase for number\nstates.\n(2)(τ)\n2. The Hanbury-Brown Twiss experiment and g\nThe second-order coherence function g(2)(τ) is often measured in the laboratory using an\nexperiment first developed by Hanbury-Brown and Twiss in the 1950's, for studying the\nlight from distant stars. This experiment involves mixing light from the input source with\nthe vacuum, |0), on a 50/50 beamsplitter, and measuring the intensity-intensity correlation\nfunction at the output using two detectors and a coincidence circuit:\n\nId: hw2.tex,v 1.4 2009/02/09 04:31:40 ike Exp\nThis problem examines how this experiment measures g(2)(τ), and what results are obtained\nfor different input states of light.\na) Let a, a+, and b, b+ be the raising and lowering operators for the two modes of light input\nto the beamsplitter, and let the unitary transformation performed by the beamsplitter\nbe defined by\na + b\na1 = UaU + =\n√\n(3)\na - b\nb1 = UbU + =\n√\n.\n(4)\nFor light input in state |ψ), you are given that the output of the coincidence circuit is a\nvoltage\n+\n+\nVψ = V0(ψ, 0| a1a1b b1 |ψ, 0) ,\n(5)\nwhere V0 is some proportionality constant, and |ψ, 0) denotes a state with |ψ) in mode\n\"a\" and |0) in mode \"b\". In other words, the voltage is the average of the product of the\n(2)(τ ),\ntwo detected photon signals. Show that Vψ gives a measure of g\n+\n+\n(a a aa)\ng(2)(τ ) =\n(6)\n(a+a)2\nup to an additive offset and normalization.\n(2) is\nb) The classical expression for g\n(2)\n(I (t)I (t + τ ))\ng\n(τ ) =\n.\n(7)\ncl\n(I )2\n(2)\nProve that g\n(0) ≥ 1. It is helpful to use the fact that ((I (t) -( I (t)))2) ≥ 0.\ncl\nc) Compute g(2)(τ ) for the following input light states:\n|ψ1) = |α) = e-|α|2/2\n√\nαk\n|k)\n(a coherent state)\n(8)\nk!\nk\n|ψ2) = |2)\n(the number state n = 2)\n(9)\nX\n\nId: hw2.tex,v 1.4 2009/02/09 04:31:40 ike Exp\nd) Compute g(2)(τ ) for the following input light states, as a function of α:\n|α) + | - α)\n|ψ3) =\n√\n(10)\n|α) -| - α)\n|ψ4) =\n√\n(11)\nDo either of these two states show non-classical second-order coherence? Why (or why\nnot)?\n3. States of light: pseudo-probability distribution plots\nPseudo-probability distributions such as the Q(α) function provide useful and insightful ways\nto depict quantum states of light. In this problem, we explore some important states and their\ndepictions. Due to the technical challenge of analytically calculating Q(α), it is satisfactory\nto give numerical answers for some parts of this problem. In particular, the Q(α) function is\ndefined as\nQρ(α) ≡(α|ρ|α) ,\n(12)\nand it is readily computed numerically by using the fact that any pure state ρ = |ψ)(ψ| can\nbe represented using\ninf\n|ψ) =\nn=0\ncn|n) ,\n(13)\nand\n(n|α) = e-|α|2/2 αn\n√\nn!\n.\n(14)\nCompute and plot the following:\n(i)\nQ1(α) = |(α|ψ1)|2 ,\n(15)\nfor\n|ψ1) = cos θ\n2 |0) + e iφ sin θ\n2 |12) ,\n(16)\nwhere |12) is the twelve photon number eigenstate. Plot for various values of φ and θ.\nIs this a minimum uncertainty state? Is it a squeezed state?\n(ii)\nQ2(α) = |(α|ψ2)|2 ,\n(17)\nfor\n|α) + | - α)\n|ψ2) =\n√\n,\n(18)\nsay, with α = 3. Try plotting this on a logarithmic scale, and you should see interference\nfringes around the origin. What is that due to?\nX\n\nId: hw2.tex,v 1.4 2009/02/09 04:31:40 ike Exp\n(iii)\nQ3(α) = |(α|ψ3)|2 ,\n(19)\nfor\nN\n|ψ3) = √\ne ikφ|k) ,\n(20)\nN k=1\nwhere |k) is a Fock state of k photons, say with N = 10 and φ = π/4. How would\nyou interpret the physical meaning of this state? What happens as N →inf? Is this a\nsqueezed state, and how so?\n(iv)\nQ4(α) = |(α|0E)|2 ,\n(21)\nwhere |0E) = S(E)|0) is the squeezed vacuum with parameter E. You may use\na\ninf\n(2n)!\nS(E)|0) = √\n(tanh E)n|2n) .\n(22)\ncosh E\n2nn!\nn=0\nCompare plots made with E = 0.2, 1.2, and 4, for example. Look for the signatures of\nsqueezing.\n(v)\nQ5(α) = |(α|e iHkerrt|β)|2 ,\n(23)\nwhere the Kerr effect Hamiltonian is\n+\nHkerr = ξa+ a(a a - 1) = ξn(n - 1) .\n(24)\nThis is easily numerically computed by using the number basis representation\nof the coherent state |β).\nTake β = 4, and ξ = π/128, for example, and gen\nerate a sequence of plots as a function of time.\nAt what time does the initial\ncoherent state evolve to become two superposed coherent states?\nWhen does\nit return to its original state?\nThe Kerr-type nonlinearity is important both\nin nonlinear optics, and in interacting cold atomic gasses.\nIt produces interest\ning and useful squeezed states, such as that depicted in this sample Q(α) plot:\nX\nX\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/c40473e83755459fd78be60cf20da536_MIT8_422S13_hw2.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nFebuary 25, 2013\nAssignment #2\nDue: Monday, March 4, 2013\n1. The quantum beamsplitter. Let the beamsplitter operator B, acting with angle θ on\nmodes a and b, be defined by\n\nB = exp θ a +b -ab+\n.\n(1)\nIn lecture, we noted that B conserves total photon number, and leaves coherent states as\ncoherent states. In this problem, you can prove those claims for yourself.\n+\na) Prove that B leaves na + nb = a a + b+b unchanged. Also prove that B+B = I.\nb) Let |α) be a coherent state. Compute B|0)b|α)a, and show that the output is a tensor\nproduct of coherent states for all θ. Your result should be consistent with the intuition\nthat the beamsplitter has well defined transmission and reflection coefficients; give these\nas a function of θ.\nc) There is close connection between the Lie group SU(2) and the algebra of two coupled\nharmonic oscillators, which is useful for understanding B. Let's define\n+\nsz = a a -b+b\ns+ = a +b\ns- = ab+ ,\n(2)\n+\nand let s± = (sx ± isy)/2. What is B(θ) in spin space? What is a a + b+b in spin space?\nShow that sx, sy, and sz have the same commutation relations as the Pauli matrices.\n+\nThis relationship also explains why a a + b+b is invariant; it is the Casimir operator of\nthe algebra.\nd) How does a beamsplitter transform an input photon-number eigenstate? Let\n\nB(θ) = exp θ a +b -ab+\n,\n(3)\nand B = B(π/4) be a 50/50 beamsplitter, such that\na + b\n-a + b\nBaB+ = √\nand\nBbB+ =\n√\n.\n(4)\nCompute B|0)|n), where the first label is mode b, and the second label is mode a. Note\nthat the result is not |n/2)|n/2), because |n) is a photon number eigenstate, and not a\ncoherent state. What photon number states have the largest amplitude? How sharp is\nthe distribution for n = 10, and n = 100, or as a function of n, if a general solution\n+\nexists? Hint: use the binomial expansion on (a + b+)n .\n2. Understanding a beam attenuator\nIn this problem, we study the attenuation of coherent state using a beam splitter model. In\nthe Heisenberg picture, one intuitive model for an optical attenuator in quantum optics is to\nmultiply the annihilation operator by a complex transmission coefficient t, where |t| < 1, i.e.\nDefine the attenuating operator T , we have T aT + = ta\n\na) Show that for the attenuating operator defined above, a coherent state will have its\nphoton number fluctuation below shot noise. i.e. for the unattenuated state |α), with\n'\n'2\nn = Δn\n= |α|2, the attenuated state would have n = |t|2|α|2, and Δn\n= |t|4|α|2 ,\nwhich violates the minimum uncertainty.\nb) We now see that this most intuitive definition does not give a physical result for an atten\nuated coherent state. In fact, it's not a unitary transformation and does not correspond\nto quantum time evolution. One correct model instead, is to formulate attenuation as\nphotons going through a beam splitter, where the attenuating part is still given by a\ntransmission scaling factor t, but from the other port of the beam splitter, a vacuum\nstate mixes in with a reflection which has a reflection scaling factor r, with |r|2 +|t|2 = 1.\nShow that with this beam splitter model, the photon number fluctuation of a coherent\nstate, after attenuation, still follows shot noise. Argue using result from 1(a), that a\ncoherent state will always be transmitted as an attenuated coherent state.\nThis problem shows that any kind of attenuation (e.g. dissipation) couples the quantum\nsystem to an open port which allows vacuum fluctuations to enter. Any kind of dissipation\nadds fluctuations to the attenuated quantum state.\n3. The Schmidt measure of pure state entanglement\nWe will talk soon in class about entanglements, but this problem can already be addressed\nwithout special knowledge.\nEntanglement is a property of a composite quantum system that cannot be changed by local\noperations and classical communications. How do we mathematically determine if a given\nstate is entangled or not? And if a state is entangled, how entangled is it?\nIn this problem, we explore a measure of bi-partite entanglement known as the Schmidt\nnumber, which is particularly easy to compute. This is based on the Schmidt decomposition,\nwhich, for a pure state |ψ) in the Hilbert space of systems A and B, is the expression of |ψ)\nin the form\n\n|ψ) =\nλk|kA)|kB ) ,\n(5)\nk\n\nwhere |kA) and |kB ) are orthonormal states of systems A and B, respectively, and\nλ2 = 1.\nk\nk\nNote that this is essentially just a singular value decomposition. The Schmidt number is\ndefined as the number of nonzero λk.\na) Prove that |ψ) is a product state, that is |ψ) = |ψA)|ψB ), for some states |ψA) and |ψB )\nof systems A and B, if and only if the Schmidt number of |ψ) is 1.\nb) Prove that the Schmidt number cannot be changed by local unitary transforms. It\nturns out that even with any amount of additional classical communication, the Schmidt\nnumber still cannot be changed. Because this number is invariant under \"local operations\nand classical communication,\" it is a measure of entanglement.\n\nc) Give the Schmidt numbers for each of the following states:\n|00) + |11) + |22)\n|φ1) =\n√\n(6)\n|00) + |01) + |10) + |11)\n|φ2) =\n(7)\n|00) + |01) + |10) -|11)\n|φ3) =\n(8)\n|00) + |01) + |11)\n|φ4) =\n√\n.\n(9)\nd) From the lecture, it would seem to follow that the more entangled a state you have\n(eg the higher Schmidt number a state has), the better you can do with interferometric\nmeasurements.\nLater in the class, we will encounter the Yurke state as an input state of interferometers\nwhich gives a precision higher than the standard shot noise limit. What is the Schmidt\n√\nnumber of the Yurke state, |ψ) = (|n)|n - 1) + |n - 1)|n))/ 2? What is the Schmidt\nnumber of the state after the Yurke state is transformed by a 50/50 beamsplitter B,\n|φ1) = B|ψ)? Explain why this is a better measure for \"how entangled\" the interferom\neter is.\nWhat is the Schmidt number of the state given by feeding a coherent state |α) and\nvacuum |0) into B, i.e. |ψ1) = B|α)|0)?\ne) Often, the Schmidt number can lack meaning as a quantitative measure of entanglement,\nbecause it includes even the smallest non-zero coefficients in its count. One improvement\non this is to count only coefficients above a certain threshold, as illustrated by the\nfollowing example.\nA two-mode squeezed state can be generated in the laboratory by a certain kind of\noptical parameteric oscillator; suppose this is the state\n\nr\n+\n+\n|Ψ) = exp - (a1a2 - a\n) |0)1|0)2 ∝\ntanhn r|n)1|n)2 .\n(10)\n1a2\ncosh r n\nPlot the number of Schmidt coefficients of |Ψ) which are above a fixed threshold, say\n0.01, as a function of the squeezing parameter r. Show that this measure of entanglement\nincreases with increasing r, as intuitively desired.\nX\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/c9f173e436ad2d3b9bd74082a85a5e6f_MIT8_422S13_hw3.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nMarch 4, 2013\nAssignment #3\nDue: Monday, March 11, 2011\n1. Lossy interferometer. A real interferometer usually suffers from loss of photons in its arms,\nor due to imperfect beamsplitters. The effect of such loss can be modeled by a beamsplitter,\nas we explore in this problem.\na) Our starting point is the standard Mach-Zehnder interferometer, which uses two 50/50\nbeamsplitters, and has a phase shifter of variable delay φ:\na\nb\nj\nIn the absence of loss, and given an input |10) (notation |ba)), a photon is measured to\nbe output in mode b with probability Pb = cos2(φ/2). The fringe visibility of this output\nsignal is defined as\nmax(Pb) - min(Pb)\nV =\n,\n(1)\nmax(Pb) + min(Pb)\nwhere the min and max are taken over φ. Show that V = 1 for this ideal situation.\nb) Suppose now that one arm of the interferometer is lossy, and we model this loss with a\nbeamsplitter, in this way:\nLet the input state be |φ0) = |010) (using notation |cba) for the three modes). The two\nouter beamsplitters are the usual 50/50 beamsplitters of the Mach-Zehnder interferom\neter, while the new middle beamsplitter has angle θ. When θ = 0, no photons are lost\nfrom b into c, and when θ = π/2, any photon in b is moved into mode c, modeling com\nplete loss. Give the intermediate states |φ1) through |φ3), and compute the probability\nthat a photon is found at the output in mode b, as a function of φ and θ. What is the\nfringe visibility as a function of θ?\n\nc) Now let both arms of the interferometer be lossy, modeled with two beamsplitters, in\nthis way:\nThe top beamsplitter has angle θ', and the bottom one θ. Give the intermediate states\n|φ1) through |φ4), and compute the probability that a photon is found at the output in\nmode b, as a function of φ and Δθ = θ - θ'. What is the fringe visibility as a function of\nΔθ? Suppose you include only cases when at least one photon is measured to be output\nin b or c (in other words, throw away the case when no photons are measured at the\noutput). How does the visibility change, when using this conditional probability?\nThe case when Δθ = 0 is known as the balanced loss Mach-Zehnder interferometer, and\nyour results should show why balancing the loss in the two arms is helpful. Restricting\ncases to when at least one photon is detected implements a simple kind of quantum error\ndetection code!\nd) In the scenarios above, a single photon input was used. Do any of the visibilities change\nif a coherent state were input instead? If not, then describe a situation in which the\neffects of loss would distinguish interferometers used with single photons versus coherent\nstate inputs.\n2. Generation of Squeezed States by Two-Photon Interactions\nConsider a mode (kk, kε) with wavevector kk and polarization vector εk of the electromagnetic\nfield with frequency ω whose Hamiltonian H is given by\n\n+)2 -2iωt - a 2 2iωt\nH = ωa+ a + i Λ (a\ne\ne\n(2)\nwhere a+ and a are the creation and annihilation operators of the mode.\nThe first term of Eq. 2 is the energy of the mode for the free field. The second term describes a\ntwo-photon interaction process such as parametric amplification (a classical wave of frequency\n2ω generating two photons with frequency ω). Λ is a real quantity characterizing the strength\nof the interaction.\n(a) Write the equation of motion for a(t) Using the Heisenberg picture. Take\na(t) = b(t)e -iωt .\n(3)\nWhat are the equations of motion for b(t) and b+(t) ?\n\n(b) Using the Heisenberg picture, the contribution of the mode (kk, kε) to the electric field is\nwritten\n\ni k·\n-i k· r\nEk(kr, t) = iEωkε a(t)e\nr - a +(t)e\n(4)\nwhere a(t) is the solution of Eq. 3. Show that\nb(t) + b+(t)\nb(t) - b+(t)\nbP (t) =\nand\nbQ(t) =\n(5)\n2i\n(where b(t) is defined Eq. 3) represent physically two quadrature components of the field.\nFind the equations of motion of bP (t) and bQ(t) and give their solutions, assuming that\nbP (0) and bQ(0) are known. Give the corresponding solutions for b(t) and b+(t).\n(c) Assume that at t = 0, the electromagnetic field is in the vacuum state. Calculate at\ntime t the mean number of photons (N) in the mode (kk, kε) as well as the dispersion\nΔbP (t) and ΔbQ(t) on the two quadrature components of the field. Explain the results.\n3. Noise properties of squeezed states.\nWe now look at noise properties of squeezed states generated in question 2. The results\nobtained will be useful here, namely, the transformations under squeezing of b and b+, of\nthe quadrature components bP and bQ and of their dispersions ΔbP and ΔbQ.\nWe again start with a vacuum state at t = 0 and, for simplicity, fix the interaction time\nto t = t0. Let us define the squeezing parameter of the resulting squeezed vacuum state\nr = 2Λr.\n(a) Calculate the photon number variance < Δn > of this squeezed vacuum state. How is\nit related to the variance of the two quadrature components of the field < Δb2 > and\nP\n< Δb2 >? Take the limit of large squeezing r >> 1. How does the photon number\nQ\nvariance scale with the mean photon number of the squeezed vacuum state? Compare\nthis scaling to a strong coherent state (classical laser beam).\n(b) Consider now that our squeezed vacuum state is attenuated, and as in problem 1, we\nmodel the loss with a unitary beam splitter with vacuum state input at the second port.\nLet T = t2 be the transmission coefficient of the beam splitter (where t is the amplitude\ntransmission coefficient) and R = 1 - T is the reflection coefficient. Let us quantify\nthe quality of the squeezed state by the ratio c\nof variances of the two quadratures\n(larger variance over smaller variance). At what attenuation (value of T ) is the quality\nof squeezing c2 reduced by a factor of 2?\n(c) Now let us see what happens to the squeezed vacuum state when we replace the vac\nuum state input at the second port of the beam splitter with a coherent state |α >\n(local oscillator (LO)). Remember that mixing with a coherent state on a beam splitter\napproximates a displacement operation. Assume that the coherent state displaces the\nsqueezed vacuum along the lower-variance quadrature (this corresponds to a choice of\nphase of α). Sketch the phase space of the output state.\ni. What is the mean photon number at the output? Express the result in terms of the\nmean photon numbers of the input states.\n\nii. What is the photon number variance at the output? (Hint: remember from class\nnotes, that the squeezed vacuum state is composed of even-photon-number eigen\nstates only.) Identify the different contributions. Take the limit of large squeezing\nand small attenuation (such that it does not degrade the quality of squeezing - refer\nto part (b)).\niii. Can sub-Poissonian photon number fluctuations be achieved at the output? If so,\nwhat are the constraints on the strength of the LO |α|2? Can you give intuitive\nreasoning for why mixing with the LO changes the nature of photon number fluctu\nations of the squeezed state? This goes to show that squeezing can be measured on\na single photo-detector, without the need to measure field quadratures.\n4. Teleportation\n√\nThe two-mode state |ΨEP R) = (|00) + |11))/ 2 has many interesting properties, one of which\nis its usefulness in \"teleporting\" unknown quantum states, as explored in this problem.\na) Let the two modes of |ΨEP R) be separated by a considerable spatial distance, such that\nAlice has the first photon, and Bob has the second. Alice is also given an unknown\nquantum state |ψ) = a|0) + b|1), so we may write the complete state of all three modes\nas\n|ψ0) = |ψ)|ΨEP R)\n(6)\n\n|00) + |11)\n=\n[a|0) + b|1)\n√\n(7)\na|000) + a|011) + b|100) + b|111)\n=\n√\n,\n(8)\nwhere the first two modes are Alice's, and the third is Bob's. Suppose that Alice can\nmeasure her two modes in the basis defined by the four orthogonal states (the \"Bell state\nbasis\")\n|00) + |11)\n|φ00) =\n√\n(9)\n|01) + |10)\n|φ01) =\n√\n(10)\n|00) -|11)\n|φ10) =\n√\n(11)\n|01) -|10)\n|φ11) =\n√\n.\n(12)\nWhat single-mode state does Bob end up with, for each of Alice's four possible\nmeasurement results? Show that if Alice sends Bob two bits of information, he can use\nthat to perform a corresponding unitary operation on his state to recover |ψ).\nThe rest is for your interest only. The Bell basis measurement used in the scheme above is\ndifficult to accomplish with optics, and generally requires some kind of nonlinearity that\nis challenging to realize with single photons. However, an alternate teleportation scheme\ncan be employed, which uses squeezed states instead of photon number states, allowing\n\na beamsplitter and homodyne measurement to accomplish the Bell basis measurement.\nThis can work as follows. Let\ninf\niαx\n|φP ) =\ndαx e\nP |αx + iP ) ,\n(13)\nN (P )\n-inf\nwhere |αx +iP ) denotes a coherent state, and N (p) is some normalization factor which we\nmay neglect. This is an infinitely squeezed state with well defined momentum quadrature\nvalue P (convince yourself of this by sketching its Q(α) plot). Similarly,\ninf\n|φX ) =\ndαp e -iXαp |X + iαp)\n(14)\nN (X)\n-inf\nis an infinitely squeezed state with well defined position quadrature value X.\n\nRecall that a 50/50 beamsplitter U transforms the two-coherent state input |α)1|β)2\n\nβ - α\n\nas\nα + β\nU|α)1|β)2\n√\n√\n(15)\n=\n.\nSuppose that the two output modes of the beamsplitter are measured in the x ∼ a +\n+\n+\na\nand p ∼ a - a\nquadratures (modes 1 and 2, respectively), giving measurement\nresults X and P . By calculating U + acting on |φX )1|φP )2, it can be shown that the\nquadrature measurement projects an arbitrary input state into the basis defined by this\n(unnormalized) state:\ninf\ninf\n|φXP ) =\ndαx\ndαp e\n-inf\n-inf\ni(αxP -Xαp)\n\n-αx + iαp + X - iP\n√\n\nαx + iαp + iP + X\n√\n.\n(16)\nThese basis states define a continuous variable Bell basis, where X and P are analogues\nof the two indices describing the four discrete Bell states of Eqs.(9-12).\nWe have shown that a beamsplitter and quadrature measurements can be used to perform\na kind of Bell basis measurement. To implement teleportation, we also need an analogue\nto the entangled state |ΨEP R). Specifically, we would like one of the basis states |φXP );\nfor example, it would be satisfactory to have\ninf\ninf\n|φXP =00) =\ndαx\ndαp\n-inf\n-inf\n\nαx + iαp\n√\n\nαx - iαp\n√\n,\n(17)\nwhere we have labeled the modes by \"2\" and \"3\" for later convenience. This state is a\ntwo-mode squeezed state. Specifically, consider the two-mode squeezed state\n\n|Ψs\nEP R)23 ∝\ns n|n)2|n)3 .\n(18)\nn\nSuch a state can be generated in the laboratory by a non-degenerate optical parametric\noscillator. It may be rewritten in the coherent-state representation as\n\n/g2\n|Ψg\n)23 ∝\nd2α e-|α|2\n|α)2|α ∗ )3\n(19)\nEP R\nC\n\nwhere the integral is taken over the complex plane. It is easily found that g =\ns/(1 - s).\nFor\nmore\ninfo\non\nthe\nteleportation\nprotocol,\nrefer\nto\nthe\nAMO\nWiki:\nhttps://cua-admin.mit.edu/apwiki/wiki/Non-classical states of light\nand to the experiment carried out in Jeff Kimble's group at Caltech (Furusawa\net al, Science vol. 282, p. 706, 1998).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/d32f378fcb5959fbd65aabc50cda12a0_MIT8_422S13_hw4.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nMarch 6, 2013\nAssignment #4\nDue: Monday, March 18, 2013\n1. Heisenberg-limited interferometry with the Yurke state\n√\nThe Yurke state |ψ) = (|n)|n - 1) + |n - 1)|n))/ 2 allows one to obtain a measurement of\n√\nan unknown phase φ with uncertainty (Δφ) =\n, using a Mach-Zehnder interferometer.\nn\nMethods for experimentally realizing these states have been proposed, for example, using\nBose-Einstein condenstates [Castin & Dalibard, Phys. Rev. A vol. 55, p. 4330, 1997]. For\nthis problem, use the following definition for the beamsplitter:\nBaB+ = √ 1 (a + ib)\nBbB+ = √ 1 (b + ia)\n(1)\na) Let us now analyze the Mach-Zehnder interferometer, fed with a Yurke state as input.\nUse this setup:\na\nb\nj\nand work in the Schrodinger picture, by doing the following. Let the input be the Yurke\nstate, |φ0) = |ψ), let the state after the first 50/50 beamsplitter be |φ1) = B|φ0), the state\nafter the phase shifter be |φ2) = P |φ1), and the state after the final 50/50 beamsplitter\nbe |φ3) = B+|φ2). Give expressions for |φ1), |φ2), and |φ3). Note that the transform of\niφ\nthe phase shifter P is P aP + = ae\n. Double-check that when φ = 0, the output is the\nsame as the input |φ3) = |φ0). Hint: write these states in terms of operators acting on\nthe vacuum.\nb) What is the uncertainty with which you can determine φ using the Yurke state input?\nThis is\n(ΔM 2)\n(Δφ2)\n\n(2)\n=\n2 ,\n∂ M\n∂φ\n+\nwhere M = a a - b+b is the difference in the photon numbers measured at the outputs\nof the interferometer. Compute (Δφ2), evaluated at φ = 0 (the point at which the\ninterferometer is balanced), using the |φ3) you obtained above. You should find (Δφ) =\n√\n2 .\nn\nc) In lecture, we used the Heisenberg picture to compute statistics about interferometer\nperformance with coherent state inputs. For comparison with the Yurke state, let's now\n\nwork out what happens with coherent states in the Schrodinger picture. Using the same\ndiagram as above, let the input now be a coherent state and a vacuum state, |ψ0) = |α)|0).\nJust as above, let the state after the first 50/50 beamsplitter be |ψ1) = B|ψ0), the state\nafter the phase shifter be |ψ2) = P |ψ1), and the state after the final 50/50 beamsplitter\nbe |ψ3) = B+|ψ2). Give expressions for |ψ1), |ψ2), and |ψ3).\nd) Given the quantum fluctuations of the coherent state, use uncertainty propagation to\ndetermne the uncertainty with which you can determine φ using the coherent state input,\nas a function of n = |α|2 and the phase shift angle φ.\n2. Hanbury Brown and Twiss Experiment with Atoms\nThis problem illustrates the coherence and collimation requirements for performing a Hanbury\nBrown and Twiss (HBT) experiment with atoms. In fact the HBT experiment was done for\nboth bosons (4He) and fermions (3He) by Jeltes and company in 2007 (T. Jeltes et al., Nature\n445, 402 (2007)). (Note: Ignore gravity in this problem.)\nIf a free particle starts at point A at time t = 0 with an amplitude (wavefunction) ψA, then\nthe amplitude at another point 1 and time t = τ is proportional to ψAei(k·rA1 -ωτ ), where\nrA1 is the vector from A to 1, k is the particle's wavevector, and 1ω is its total energy. This\ncan be regarded as Huygen's principle for matter waves, and is a special case of the Feynman\npath integral formulation of quantum mechanics.\n(Based on figure 19-5, in G. Baym, Lectures on Quantum Mechanics)\n(a) Correlation function\nAssume we have a particle at A with amplitude ψA and one at B with amplitude ψB .\nThe joint probability P of finding one particle at 1 and one at 2 is\niφA1 ψB e iφB2\niφA2 ψB e iφB1\nP = ψAe\n± ψAe\n(3)\nand is proportional to the second-order coherence function g(2)(1, 2). The ± is for\nbosons/fermions and makes the two-particle wavefunction symmetric/antisymmetric un\nder the exchange of particles. Here, φA1 = kA · rA1 - ωτ is the phase factor for the path\nfrom point A to detector 1, etc. Calculate P as a function of r21, the vector from point\n2 to point 1 on the detector.\n(b) Transverse Collimation\nAssume you are given a source (e.g. a ball of trapped atoms) with transverse dimension\nW and detector with transverse dimension w where |r21| ≤ w. The distance between\nsource and detector d is much greater than all other distances. The transverse component\n\nof the phase factor in part (a) can be written: φt = (kA - kB ) · (r21)t. Assume that\nt\nthe signal at the detector is mainly due to atoms with wavevectors distributed around\nk0. Argue that the transverse collimation required to see second order correlation effects\ncan be expressed as Ww « dλdB , where λdB is the deBroglie wavelength corresponding\nto k0. (Hint: How does φt vary for atoms originating at different points in the source\nand being detected at different points on the detector?)\nConsider a 6Li MOT at 500 μK. Calculate the deBroglie wavelength. Assuming a MOT\nand detector of approximately equal size (W ≈ w), estimate an upper bound on the\nMOT and detector size using d = 10 cm.\n(c) Longitudinal Collimation\n(i) The longitudinal component of the phase factor in part (a) can be written: φl =\n(kA - kB )l · (r21)l. Assume a Gaussian distribution of wavevector differences p(kA -\nγ2\n-|kA -kB |2\nkB ) = e\nwhere the width γ is related to the temperature of the atoms.\nCalculate (P ) using this distribution and your result from part (a). Sketch (P ) for\nboth fermions and bosons, indicating the extent of (r21)l over which the second order\ncorrelation effect can be seen. (Hint: Use the fact that φt « 2π from part (b) to simplify\nthe integral.)\n(ii) Now assume you have a pulsed source of atoms with longitudinal dimension L. Atoms\nare released at time t = 0 and detected at some later time t = τ . Give geometric argu\nments to show that the wavevectors of detected atoms must obey | (kA - kB )l\n~d ,\n| ≤ mvL\nd\nwhere the velocity v = τ . This implies that the different velocity groups separate during\nthe expansion, narrowing (by a factor L ) the velocity distribution of atoms detected at\nd\nany particular time.\nConsider again the 6Li MOT from part (b). Assuming τ = 0.1s and L ≈ W , estimate\nthe necessary timing resolution of the detector in order to see second order correlation\neffects?\n(d) Phase-Space Volume Enhancement\nWe now pull all the pieces together. The peak in g(2)(1, 2) is visible for (kA - kB ) · r21 ≤\n2π. This is equivalent to saying that we must detect atoms from within a single phase\nspace cell, defined by δpxδx ≤ h (and likewise for y and z). In our trapped atom sample,\nthe 3D volume of a phase space cell is δxδyδz = (λdB ) . Liouville's theorem says that as\nour ball of atoms expands, the number of phase space cells remains constant. Verify that,\nby using this pulsed source, the volume of a coherent phase space cell is increased by a\nfactor d3/W 2L by the time atoms reach the detector. What is the order of magnitude\nof this increase (assuming L ≈ W )?\nEstimate the average occupation of a cell of phase space for the 6Li MOT from parts (b)\nand (c). How does this compare with the average occupation of a BEC or a degenerate\nFermi cloud?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/fce97bcca211574337b1eae641510c06_MIT8_422S13_hw5.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nMarch 18, 2013\nAssignment #5\nDue: Monday, April 1, 2013\n1. Rayleigh and Thomson scattering using two different interaction Hamiltonians.\nElastic light scattering takes the system from state |i |=) |a; k) to state |f) = |a; k'E') where a is\nthe (unchanged) state of the atom, and k(k') and E(E') the wavevector and polarization of the\nincident (scattered) photon.\n(a) Calculate the transition matrix element Tfi (i.e. matrix element of the T matrix) in leading\n(non-zero) order for both Rayleigh and Thomson scattering (lω smaller/larger than excita\ntion energies), for both the electric-dipole Hamiltonian:\nH' = -d · E\n(1)\nI\nand the Coulomb-gauge interaction Hamiltonian:\nHI = - q p · A(0) + q\nA2(0)\n(2)\nm\n2m\nYou will realize that Rayleigh scattering is more easily calculated with the dipole Hamiltonian,\nwhereas the reverse is true for Thomson scattering. Of course, both Hamiltonians lead to the\nsame answer.\n(b) Show that the total cross section for Thomson scattering is given by σ0 = 8π r0\n2 where r0 is\nthe classical electron radius.\nTry to advance with this problem as far as you can by yourself. If you get stuck, you will find a\ndiscussion of this problem in Exercises 3 and 4 in the book Atom-Photon Interactions.\nFIG. 1: Rayleigh and Thomson scattering\n\n2. Long-range (Van der Waals) interaction between ground-state atoms.\nThe electrostatic interaction between atoms a and b is described to first order by the dipole-dipole\nterm:\nˆ\nˆ\nda · db - 3(da · R)(db · R)\nHel(R) =\n(3)\nR3\nwhere da = era is the electric dipole operator of atom a, db = erb is the electric dipole operator\nof atom b, and R = Rnb - Rna is a position vector pointing from the nuclei of a to the nuclei of\nb.\nWe will use time-independent perturbation theory to calculate the effect of Hel. This is simpler\nthan the time-dependent perturbation expansion discussed in class and does not lead to a virtual-\nphoton picture of the Van der Waals interaction.\nNotation: Let |gagb) denote atom a and atom b in the ground state.\nLet |iagb) denote atom a in an excited state i and atom b in the ground state.\n.\n.\n.\n(a) What is the first non-vanishing term in the series for the perturbed ground state energy of\nthe system?\n(b) Dipole matrix elements in atomic physics are often discussed in terms of \"oscillator strength,\"\n2mω\n;\nig\nEi-Eg\nfig =\n|(i|x|g)|2 . Note: ωig =\n, so fig is positive for absorption and negative for\nl\n;\nemission. Also,\nfig = 1, the Thomas-Reiche-Kuhn sum rule. Express your result from (a)\ni\nin terms of oscillator strengths. You will have to make some arguments (non-mathematical\nif you prefer) about the symmetry of photon emission to get rid of annoying cross terms.\n(c) We can estimate C6 using the approximation that the oscillator strength fig is large for only\none transition, |g) →|i). The |nS) →|(n + 1)P ) transitions in alkali atoms are the classic\nexamples, with f ≈ 0.98. Use this in combination with the sum rule above and the definition\nof the static polarizability of the ground state:\n|(i|z|g)|2\nαg = 2e\n(4)\nEi - Eg\ni\n(a)\n(b)\nand express your result for C6 from (b) in terms of polarizabilities αg\nand αg . (You should\nnot have any summation signs in your final answer.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/fcfe45976e692139ff0c5bd64f21e5d9_MIT8_422S13_hw6.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nApril 1st, 2013\nAssignment #6\nDue: Monday, April 8 2013\nProblem 1. Long-range interaction between an excited atom and a ground-state\natom\nConsider the case where one atom is excited and the other atom is in its ground state. For\nsimplicity model each atom as a two level system with one ground state and one excited state.\na) Assume you have two atoms a and b with almost (but not quite) degenerate ground ↔ excited\n(a)\n(a)\n(b)\n(b)\nstate transition energies (E\n- Eg ) ≈ (E\n- Eg ). How does the energy of the state |iagb)\ni\ni\nchange as a function of the separation R for large distances? What about state |gaib)? For\nwhat separation does perturbation theory become invalid?\nb) Now assume you have two identical (i.e. same transition energy) atoms. Calculate the long-\nrange interaction potential curves for the case of one excited atom and one ground state\natom.\nc) For case (b) what is the relation between the spontaneous decay rate of the atom and its\nlong-range interaction coefficient?\nProblem 2. Casimir model of the electron\nModel the electron as two parallel plates of area a2, separated by distance a and carrying charge\ne\nq = 2 . Balance the Casimir and electrostatic forces and from this determine a value for the\ne\nfine-structure constant α ≡\n(cgs units).\n~c\nProblem3. Physical origin of T2\nNext week, we will discuss a general derivation of optical Bloch equations which include damping\nof elements of the atomic density matrix. In this problem, in preparation for the general discussion,\nyou will look at different processes which lead to such damping.\nWhat is the physical meaning of the decay of the off-diagonal elements of the atomic density\nmatrix, ρeg and ρge, due to spontaneous emission and other processes? Three very simple models\nfor this kind of quantum noise, which leads to loss of phase coherence, and gives rise to decoherence\ntimes characterized by T2, are the following.\n\na) One physical origin for the decay of the off-diagonal elements of the atomic density matrix\n(this decay is known as \"phase damping\") is random phase noise. Suppose that we have an\natom in the arbitrary state\n\nρ =\na\nc\nb\nd\n,\n(1)\nexcited by far off-resonance light of random intensity. The effect of this light on the state\nis an AC stark shift |e) → eiθ|e), which we may model as a rotation Rz (θ), where the angle\nof rotation θ is random, distributed as a Gaussian with mean 0 and variance 2λt. Give\nρ(θ) =\n(θ)ρR+ (θ), and the expected density matrix ρ (t) = ρ(θ)), averaged over this\nRz\nz\nGaussian distribution.\nb) Another physical origin for phase damping is elastic collisions. Assume the two-level atom\nbounces along a waveguide, interacting with the walls without loosing kinetic energy, but\nchanging its trajectory slightly at each bounce, in a manner depending on the state of the\natom. This can be modeled by a Hamiltonian interacting the atom with a single mode\nenvironment,\n\nHSE = |e) e| ⊗γ|0) 1| + γ ∗ |1) 0|\n,\n(2)\nwith coupling constant γ. This Hamiltonian flips the state of the environment between |0)\nand |1) with a rate gamma, when the atom is in the excited state. This is a simple model\nfor a state-dependent interaction with the environment. Compute the evolution of an initial\natomic state a|g)+b|e) coupled to an environment |0), evolved for a small differential timestep\ndt, and give the density matrix of the atom ρ(t) for small t.\nc) A third physical model for phase damping is the following scenario (which you may think a bit\nunphysical). Suppose the two-level atom is subject to a force which randomly flips the phase\nof the atom by -1, changing |e) → -|e), with probability (1 - e-λt)/2 at each moment in\ntime. Assuming the density matrix is initially arbitrary, give ρ(t) averaged over this random\nphase flip process.\nAn amazing fact about these three models is that if phase damping is known to be happening to\nan atom, say during traversal through some black box, without additional knowledge about what is\ninside the black box, there is in principle, no way to distinguish between which of the above physical\nprocesses is causing the phase damping! They are perfectly equivalent and equally legitimate. This\nis fundamental to why quantum error correction can work: phase noise can be modeled as either no\nerror happens to the state, or a phase flip \"error\" occurs (analogous to bit errors in a communication\nchannel), even if the actual physical process is a different one.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/d9520607d097e5f08a8609a5eddfb0c5_MIT8_422S13_hw7.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nApril 08, 2013\nAssignment #7\nDue: Tuesday, April 16, 2013\n1. Optical Bloch Equations: weak and short-time limits.\nThe time-independent form of the optical Bloch equations (eg, see API p. 359), including\nspontaneous emission, and the rotating wave approximation, is:\nΩ\nρ ee = i (ρeg -ρge) -Γρee\n(1)\nΩ\nΓ\nρ ge = i(ω0 -ωL)ρge -i (ρee -ρgg ) -\nρge ,\n(2)\nwhere the remaining two components of the density matrix are given by ρgg = 1 -ρee, and\nρeg = ρge\n∗ . It is insightful to study these equations in the limit of weak excitation, and for\nshort evolution times.\na) Show that the solution of these equations to lowest order in |Ω|, and in the limit |Ω| « Γ,\nwith the initial conditions ρee = 0 and ρge = 0, gives\n\n|Ω|\n-Γt/2\nρee =\n1 + e -Γt -2 cos[(ω0 -ωL)t]e\n.\n(3)\nΓ\n(ω0 -ωL)2 +\nWhat does this solution reduce to in the limit of an infinitely narrow linewidth (Γ →0)?\nb) Show that the solution of these equations to lowest order in |Ω| in the limit |Ω|t « 1,\nwith the initial conditions ρee = 0 and ρge = 0, gives\nρee = |Ω|2t2 .\n(4)\nThis result is independent of the detuning ω0 -ωL and the decay rate Γ. Why?\n2. One atom and one photon: spontaneous emission\nA single atom coupled to a single mode of electromagnetic radiation undergoes spontaneous\nemission. What is the state of the atom during such spontaneous emission?\nLet us model the interaction of one atom with a single optical mode using the Jaynes-\nCummings interaction\nω0\nΩ1\nH = ωa+ a +\nσz +\n(a +σ- + aσ+)\n(5)\nwhere δ = ω -ω0 is the detuning of the cavity frequency ω from the atomic frequency ω0,\nΩ1 is the coupling of the atom to the field and we defined σz = |e)(e| -|g)(g|, σ+ = |e)(g|,\nσ- = |g)(e|.\n\nIn the subspace where at most one quantum of energy is exchanged with the optical mode,\nwe may write this Hamiltonian as a matrix\n⎡\n⎤\n-δ - 2ω0\nH = 2\n⎣\n-δ\nΩ1\nΩ1\nδ\n⎦ ,\n(6)\nwhere the basis states are |0g), |0e) and |1g). Here |g) and |e) are the ground and excited\nstates of the atom. |0) and |1) denote the number of photons in the optical mode.\na) Compute the full unitary evolution U(t) = e-iHt/n under this Hamiltonian and obtain\n\nδ\nU(t) = e i(δ/2+ω0)t|0g)(0g| +\ncos(Ωt/2) + i\nsin(Ωt/2)\n|0e)(0e|\nΩ\n\nδ\nΩ1\n+\ncos(Ωt/2) - i\nsin(Ωt/2)\n|1g)(1g| - i\nsin(Ωt/2) |0e)(1g| + |1g)(0e| (7)\nΩ\nΩ\n\nHere Ω =\nΩ2\n1 + δ2 is the generalized Rabi frequency.\nb) Suppose the atom starts out in the excited state |e) and the cavity with no photon |0).\nWhat is the state of the atom after time t, if the cavity is measured and found to have\nno photon? What if one photon is found to be in the cavity?\nc) A reduced density matrix describes the state of part of a system, averaged over the\npossible states of the remainder. Suppose that at t = 0 the atom starts out in a general\nmixed state with no photons in the cavity:\n\nρgg ρge\n⊗|0)(0|\n(8)\nρeg ρee\nGive a reduced density matrix describing the state of the atom at time t > 0.\nd) Suppose that the atom interacts with the cavity for a short time Δt, after which the\ncavity is measured. Determine how its density matrix evolves under repeated short\nevolutions with the cavity. The cavity state is reset to |0) after each interaction. What\nis the fixed point of this process? This shows how spontaneous emission emerges as the\nlimiting case of a continuous readout of the photon field.\ne) Let |e) and |g) be depicted as the south and north poles of a Bloch sphere representation\n√\n√\nof the atom. Plot the points (|e) + |g))/ 2, (|e) -|g))/ 2 and |e). Recall that a two-\ndimensional density matrix ρ can be represented by a point ar inside the Bloch sphere,\nusing\nI + ar · aσ\nρ =\n.\n(9)\nPlot how these three initial states evolve under repeated short evolutions with the cavity\naccording to d).\nf) If the cavity is tuned far off resonance from the atom, emission into the cavity is strongly\nsuppressed. It seems surprising that the results you should have obtained in d) and e)\nare independent of the detuning δ. How can this be explained physically?\nHint: What assumptions have you made in d)?\nħ\n\n3. Driven two-level atom: dressed states\nA two-level atom driven by a classical laser field is often conveniently studied in a stationary\nbasis, that is, the basis defined by the eigenstates of the Hamiltonian. These basis states are\nknown as dressed states, and they are useful for interpreting many phenomena and solving\nproblems in atomic physics.\nLet the Hamiltonian for the classically driven atom be\nω0\nΩ1\nH =\nZ +\nX cos(ωLt) + Y sin(ωLt) ,\n(10)\nwhere X, Y , and Z are the usual Pauli matrices, ω0 is the energy difference between the\natomic levels |e) and |g), ωL is the laser frequency, and Ω1 = eE0(g|z|e)/ is the Rabi\nfrequency.\na) Write the coupled time-dependent Schrodinger equations using a solution anzatz of the\nform |ψ(t)) = aeiω1t|g) + beiω2t|e). Choose the frequencies such that the equations are\nsteady-state, containing no oscillating terms.\nb) The Schrodinger equations you have just written are identical to those for a system with\na Hamiltonian that is a function of the Rabi frequency and the detuning δL = ωL - ω0\nonly. Give this Hamiltonian; denote it as H'.\nc) Write H' in terms of trigonometric functions, where sin 2θ = Ω1/Ω, where Ω =\nΩ2\n1 + δ2\nL\nis the \"effective\" Rabi frequency.\nd) Diagonalize H' to find the eigenvalues and associated eigenvectors.\ne) Use these results to find the time-dependent solutions to the Schrodinger equations for\nH, in the original frame of reference.\nħ\nħ\nh\ni\np\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/b5010cf1d440436975f6094d30fcfc36_MIT8_422S13_hw8.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring 2013\nProf. Wolfgang Ketterle\nApril 12, 2013\nAssignment #8\nDue: Monday, April 22\n1. Classical Model of the Light Force\nIn class, we will discuss light forces using the OBE. In preparation for this, you are asked here to\nconsider a (semi-)classical derivation. Assume that a hydrogenic atom can be modeled classically as\nan electron harmonically bound to a nucleus, with a resonant frequency ω0 and damping coefficient γ.\nThe nucleus is fixed at position x0 while the electron's position is denoted by x. Now suppose the\natom is illuminated with an electromagnetic wave of the form\nE(x, t) = ˆEE0(x) cos(θ(x) + ωt)\n(1)\nwhere θ(x) is the phase of the wave as a function of position x at time t = 0. The dipole moment of\nthe electron may be written as\np(x, t) = pˆ(u cos(θ(x) + ωt) - v sin(θ(x) + ωt)\n(2)\nThen the force of the light on the atom is\nF = (p · Eˆ)VE(x, t)\n(3)\n(a) Time averaged force\nMake the dipole approximation that E(x) ≈ E(x0). Show that the time averaged force is\n(F) = (ˆp · Eˆ)(uVE0(x0) + vE0(x0)Vθ(x0))\n(4)\nThis expression is exactly analogous to the quantum-mechanically derived force. The first term\nis the dipole (stimulated) force, and the second term is the scattering (spontaneous) force.\n(b) The potential picture\nRecalculate the time averaged force on the atom from the instantaneous potential energy of a\ndipole in an electric field. How does this answer differ from that of 1a? Speculate as to why.\n(c) Dipole moment of electron\nNow we will solve explicitly for the dipole moment of the electron. In complex notation, the\nequation of motion is\ni(θ(x0)+ωt)\nm\n+ γ\n0 r = -eˆ\n(5)\n∂2r\n∂r + mω2\nEE0(x0)e\n∂t2\n∂t\nwhere r = x - x0. Solve this equation to find p = -er. Substitute the quadrature components\nof p into the force equation from part (a) to find that\ne\nδVE0\n2 + ΓE0\n2Vθ\nF = -\n(6)\n2mω0\n4δ2 + Γ2\nwhere δ = ω - ω0 and Γ = γ/m. Make the approximation that ω ≈ ω0.\n\n(d) Force on a two-level atom\nThe quantum mechanical expression for the light force on a two-level atom in the low intensity\nlimit is\nhδVω2 + hΓω2 Vθ\nR\nR\nF ≈-\n(7)\n4δ2 + Γ2\nwhere ωR is the Rabi frequency. Show that if we introduce the oscillator strength ffi between\nthe two levels, we may write\nF\n= ffiF\n(8)\nquantum\nclassical\n2. Master equation for a damped optical cavity\nA Fabry-Perot cavity can be modeled as being made of a high reflectivity mirror and a perfect mirror\nwith fixed spacing. Clearly, photons stored inside this cavity will gradually leak out the partially\nreflecting mirror, causing the state inside to change. This process is described by a master equation,\nmuch like an atom coupled to fields is described by the optical Bloch equation. In this problem, we\nexplore a simple derivation of such a master equation, for a single mode cavity.\nLet a and a+ describe the optical mode of interest within the cavity, with characteristic energy hω,\ndescribed by the Hamiltonian H0 = hωa+a. Let |ψ) be the initial cavity state. Let us suppose that\nphotons leak out of the cavity at a rate proportional to the photon number in the cavity and to Γ,\nwhich parameterizes the leakiness of the leaky mirror. Thus the probability that a photon leaks out\n+\nwithin the infinitesimal timestep between t and t + dt is given by dp = Γdt(ψ|a a|ψ). And with a\nprobability 1 - dp it doesn't. For these two cases we model the time evolution as follows:\n√\n- If a photon leaks out, the cavity state becomes |ψ 1) = a Γ dt|ψ).\n-iHt/\n- If no photon leaks out, the state becomes |ψ 0) = e\nh|ψ) having evolved under the\n+\n\"Hamiltonian\" H = H0 - i( hΓ/2)a a. Note that H is not Hermitian. It has an imaginary term,\nso it is \"lossy\". Evolving a state forward in time with H yields an un-normalized state.\nThe two un-normalized states |ψ 0) and |ψ 1) will later be two \"components\" of the density matrix.\na) Compute the normalized states |ψ0) and |ψ1). Provide some words of justification for the lossy\nterm in H (for instance, why is it proportional to a+a?).\nWhere you encounter exponentials of H or H+ (which is NOT equal to H), expand them to first\norder in dt.\nb) At time t, suppose the cavity starts in the pure quantum state ρ(t) = |ψ)(ψ|. At time t + dt the\nstate of the leaky cavity system is given by\nρ(t + dt) = (1 - dp)|ψ0)(ψ0| + dp|ψ1)(ψ1| .\n(9)\nRewrite this density matrix, building it out of the the un-normalized states described in part a).\nThe only bras or kets to appear in your final expression should be |ψ) and (ψ|.\nc) Compute ρ(t + dt) - ρ(t) for small dt, and write the coarse-grained differential equation\nd\nρ(t + dt) - ρ(t)\nρ(t) ≈\n.\n(10)\ndt\ndt\nShow that this has the proper Lindblad form of\ndρ\ni\n\n= - [H0, ρ] -\nC+Cρ - 2CρC+ + ρC+C\n,\n(11)\ndt\nh\nand identify what C and C+ are for this case.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/b42e4c9a3332f34f5ff5233b0efcc7e9_MIT8_422S13_hw9.pdf",
      "content": "8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nAssignment #9\nDue: Wednesday, May 1, 2013\nConsider the following questions for Na. Try to plug in numbers after obtaining an analytical expres\nsion.\nNa oven temperature T = 600K\nnatural line width γ = 2π× 10 MHz\nZeeman splitting 1.4 MHz/gauss\nwavelength λ = 2π/k = 589 nm\n1. A Zeeman Slower\nIf you want to slow an atomic beam efficiently, you have to compensate for the changing Doppler shift\n(kk · kv) during the deceleration. This can be done by sweeping the frequency of the slowing beam, i.e.,\nchirping (as discussed in class). A method of producing a continuous beam of cold atoms is Zeeman\nslowing.\nA well collimated beam of atoms is originating from an oven with a temperature T . The beam\npropagates along a distance L with a longitudinal magnetic field B(x) ( 0 < x < L ). A laser beam\nof intensity I is counter propagating. Its frequency is detuned by δ (δ ≡ ω - ω0) from the transition\nfrequency at B = 0.\na) Calculate the maximum deceleration amax you can achieve. Assume you could choose arbitrarily\nlarge laser intensities.\nAssume you want to slow down atoms with speeds lower than the peak (most probable) velocity vpeak\nof the thermal distribution to a stand still using the constant deceleration famax. (0 < f < 1) The\nZeeman effect shifts the resonance ω0 → ω0 + gμB B(x) (where gμB = (2π)1.4 MHz/gauss, in this\ncase).\nb) Calculate the spatial dependence of the magnetic field B(x) and the length L of the slower as a\nfunction of f.\nc) Assume three different models for spontaneous emission: (i) Photons are emitted along the +/-xˆ\ndirection, (ii) isotropic emission, or (iii) emission in a dipole pattern. What is the momentum\ndiffusion constant D for the (longitudinal) x-component of the momentum in the three cases, at\na given photon scattering rate Γs?\n\n2. Slowing an atom with off-resonant light\nAssume you want to slow an atom of velocity vpeak with a counter propagating laser beam that is on\nresonance with the atom at rest. (Use the same vpeak as in Problem 1, and I = 5Isat.)\na) How long would it take?\nb) How far would the atom travel?\n(Hint: Think about integrating the equation of motion)\n3. Density Limit in a MOT. In a 3-D magneto-optical trap, the density of the trapped atoms is\nlimited by a net outward radiation pressure which opposes the trapping force. We can divide the\ndensity-dependent photon-pressure force into two parts. First there is a repulsive 'radiation trapping\nforce' due to atoms absorbing photons scattered from other atoms in the trap. Also, there is an attrac\ntive 'attenuation force' which is caused by atoms at the side of the cloud attenuating the laser beams,\nthus creating an intensity imbalance which leads to an inward force.\n(a) Show that the radiation trapping force obeys the equation\n6σLσRIn\n\\ · FR =\n,\nc\nwhere I is the intensity of one of the trapping laser beams, n is the number density of atoms in\nthe cloud, σL is the cross-section for absorption of the laser beam, and σR is the cross-section\nfor absorption of the scattered light. (Hint: Find the magnitude of the force between two atoms\nseparated by a distance d, where one atom re-radiates a laser photon and the second atom absorbs\nit. Now, since this is an inverse-square force, you can use Gauss' law to find \\ · FR. Assume that\nphotons are only scattered twice.)\n(b) The attenuation force may be obtained simply by replacing σR with -σL, so that\n6σ2 In\nL\n\\ · FA = -\n.\nc\nExplain why this is so.\n(c) The total force is the sum of FR, FA, and the trapping force FT = -κr, where κ is the spring\nconstant of the trap. For stability we require that the total force is attractive, \\· Ftotal < 0. Find\nthe maximum density of the trapped cloud at a given κ from the condition \\ · Ftotal = 0.\n(d) Give a qualitative argument for whether we expect σR = σL, σR > σL, or σR < σL. ( Hint:\nsketch the absorption and emission spectra for an atom in a strong laser field with a red detuning.)\n(e) Suppose that some of the atoms can be put into a 'dark state', so that only a fraction f of the\natoms absorb the trapping light. How do FR, FA and FT vary with f? What happens to the\nlimiting density nmax? This is the concept of the Dark SPOT trap (PRL 70, 2253 (1993)).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Atomic and Optical Physics II, Assignment 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/5c8ec5d73034ef2c1b6f218651cb8376_MIT8_422S13_hw10.pdf",
      "content": "MIT 8.422 Atomic Physics II\nSpring, 2013\nProf. Wolfgang Ketterle\nAssignment #10\nDue: Friday, May 10th, 2013\n1. The Dressed Atom\nIn HW assingment 7, problem 3, you looked already at the dressed atom picture using a classical\nexternal field. Use the solution you have already derived, and discuss the following properties:\n(a) Identify the a.c. Stark shift in the dressed states. It appears as a shift in the energy levels of the\ntwo dressed states relative to the uncoupled states. What is the Stark shift in the limit Ω1 << δL.\nWrite the dressed states in this limit.\n(b) The polarization vector is the expectation value of the dipole operator for the dressed state. It can\nalso be written PP(ωL, t) = α(ωL)Eo cos(ωLt). Compare these two expressions, and express α(ωL)\n2m\nas a function of |< a | z | b >|2 . Substitute the oscillator strength fab =\nωo |< a | z | b >|2\nh\ne 2\nfab\ninto the expression and compare it with the known expression α(ωL) =\n. Where do they\nm ω2-ω2\no\nL\nagree? Comment briefly on the physics of ωL → ωo.\n(c) Let ωL → 0, and write the d.c. polarizability for both expressions. What approximation has been\nmade that accounts for the difference?\n(d) Let | Ψ(t = 0) >=| a >. Express | Ψ(t) > as a linear superposition of the dressed states. What is\nthe probability P (t) that | Ψ(t) > will be found in the state | a >? This shows that the dressed\nstates contain the physics of Rabi \"nutation\" or oscillation.\n(e) Use your solution to find the stimulated light force on each of the two dressed states.\n(f) Can you explain how the two pictures are connected: (a) the time dependent solutions derived\nwith the classical field (b) the time-independent solutions derived in class using a quantized elec\ntromagnetic field.\n2. Sideband Cooling\nAs we have seen in class, optical pumping involves using a laser to drive a sequence of atomic transitions\ninto a specific state from which further transitions cannot occur. This method can be used for laser\ncooling atoms, when the transitions involved are between discrete states of different motional energy\n(phonons). Such is the case with sideband cooling, which is essentially optical pumping of an atom\nwhich is spatially confined in a harmonic potential; this can be, for example, a trapped ion. Sideband\ncooling is a very powerful laser cooling technique, which can be used to cool ions to their motional\nground state. This problem looks at sideband cooling of a two-level ion in one dimension.\n(a) Consider the Hamiltonian of a two-level atom, with raising and lowering operators σ±, interacting\nwith a quantized laser field, through the usual Jaynes-Cummings interaction:\nHI = hΩ(ˆσ+ + ˆσ-) cos(kxˆ - ωt)\n(1)\nSuppose that the atom is an ion (of mass m) which is confined in a harmonic potential, such that\no\nthe Lamb-Dicke parameter η = kx0 « 1, where x0 =\nh/(2mν) is the size of the ground state\nwavefunction, and ν is the motional frequency of the ion. Expand the interaction Hamiltonian to\n\nfirst order in η and transform to the frame defined by\nhω0\n+ˆ\nH0 =\nσˆz + hνaˆ a ,\n(2)\nwhere ˆσ+ = |e) (g| and ˆσ- = |g) (e| are the raising and lowering operators, ˆσz = |e) (e| -|g) (g| is\nzˆ axis Pauli matrix, and ˆa+ and ˆa are the motional raising and lowering operators.\nWhat are the Rabi frequencies Ωn,n-1 and Ωn,n+1 for transitions |n) |g) →|n - 1) |e) (red side\nband) and |n) |g) →|n + 1) |e) (blue sideband)?\n(b) Because every cooling cycle involves spontaneous emission, coherences decay rapidly and the cool\ning dynamics are adequately described by rate equations. The population of the harmonic oscil\nlator level |n), pn = TrA (n| ρ |n) where TrA denotes the trace over the atomic state, increases due\nto the spontaneous Raman transitions |n - 1) |g) →|n) |g) and |n + 1) |g) →|n) |g) and decreases\ndue to the spontaneous Raman transitions |n) |g) →|n - 1) |g) and |n) |g) →|n + 1) |g). Note\nthat each spontaneous Raman transition can happen in two ways; for example |n) |g) →|n + 1) |g)\ncan proceed via either |n) |g) →|n) |e) →|n + 1) |g) or |n) |g) →|n + 1) |e) →|n + 1) |g).\nUse the Rabi frequencies Ωn,n-1 and Ωn,n+1 from part (a) to write down the rate equation for pn.\nAssume for simplicity that the laser power is below saturation (Ω « Γ), and write your answer\nin the form\ndpn = nA+pn-1 + (n + 1)A-pn+1 - (n + 1)A+pn - nA-pn .\n(3)\ndt\nWhat are the rates A±?\n(c) Write down a differential equation for\ninf\nc\n(n) =\nnpn\n(4)\nn=0\nand solve it. You should find that cooling occurs for A- > A+. What is the steady state\ntemperature in the resolved sideband limit (Γ « ν) when δ = -ν? How long does it take to reach\nthis temperature?\n(d) Now for some numbers. What are the steady state temperature and time constant for cooling\n88Sr on the S1/2 → D5/2 electric quadrupole transition? Use ν = 2π × 10 MHz, Γ = 2π × 0.4 Hz,\nk = 2π/(674 nm), and Ω = 2π × 0.04 Hz. This does not work experimentally because sideband\ncooling must compete with heating due to electric field noise, which is typically thousands of\nquanta per second. To cool in the presence of ion heating it is necessary to use a transition with\na linewidth larger than the heating rate. For 88Sr we broaden the D5/2 state by weakly coupling\nit to the P3/2 state, which decays quickly via an electric dipole transition to the S1/2 state. What\nare the steady state temperature and time constant for sideband cooling when Γ = 2π × 100 kHz\nand Ω = 2π × 10 kHz?\n3. Optical dipole trap\nWhen atoms are loaded into a far-off resonant dipole trap, they are accelerated by the stimulated light force.\nIn the absence of spontaneous emission, where does the kinetic energy come from? In this problem, we shall\ndiscuss this situation in an idealized geometry. As described in Figure 1, a finite number of atoms is initially\nstored in reservoir A, and they can move into reservoir B thorough a thin capillary. For simplicity we assume\na non-divergent uniform electromagnetic(EM) field in an isolated region (dotted region in figure 1, total\nvolume V ).\nMoreover, the EM field has large detuning δ < 0 (no spontaneous force) so that the atoms\nwill move into the reservoir B at t = t0. Assume that the atom density increases linearly up to ndt during\ndt. Since the atoms shift the phase of the transmitted EM field, the frequency of the EM field measured at\nposition D is shifted by dω in the lab frame(figure 2). In this problem, we will show that the total energy\n1The wavevector spread of the electromagnetic field near the region's boundary is important to explaining the acceleration and\nits transverse direction, but for simplicity we assume a plane wave.\n\nchange of the atoms in the reservoir B is equal to the energy decrease of the EM field accumulated between\nt = t0 and t = t0 + Δt.\n-→\ni(wt-kz)\na) First, let the incident EM field be Ei\nxe\nWhen some atoms are introduced in the reservoir\n∝ ˆ\n.\nB, the index of refraction is changed: nr c 1 + 1 n(t)α(w) where α(w) is the polarizability. By considering\nthe phase shift due to the atoms in the reservoir B, calculate a frequency shift Δω of the EM field at the\n-→\nposition D. (see figure 2) You will get ED ∝ ˆ i([w-Δw]t-kz) when t0 < t < t0 + Δt.\nxe\nb) With the result of (a) Δω, calculate the total energy decrease of the EM field, ΔEEM , accumulated\nbetween t = t0 and t = t0 + Δt.\nc) By considering the Stark effect, we can calculate the polarizability α(w). Given the α(w), calculate the\nenergy shift, ΔEStark|t=to+Δt, due to the Stark effect. Is ΔEStark equal to ΔEEM ? Why? (or Why not?)\nReservoir A\nReservoir B\nAtoms\nArea: A\nd\nAtomic density\n= n(t)\nAtoms\nEM field\nDetector\ntime\natom\ndensity: n(t)\nt\nn∆\n&\ntime\n0t\nt\nt\n∆\n+\nEM field frequency\nat the detector\n0t\nt\nt\n∆\n+\nω\nω\n∆\nFigure 1\nFigure 2\nD\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/0b40206cb3d5e0293e64d52a0aa49cb5_MIT8_422S13_casimir_effect.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Vanderwaals Interaction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/f9127aac384fa682a75219bd2a23ad8b_MIT8_422S13_vanderwalInter.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "3 pages lecture notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-422-atomic-and-optical-physics-ii-spring-2013/8ca7d6c02df88b389e856ddb16800e38_MIT8_422S13_homodyne_notes.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n8.422 Atomic and Optical Physics II\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}