{
  "course_name": "Attraction and Repulsion: The Magic of Magnets",
  "course_description": "This Freshman Advising Seminar surveys the many applications of magnets and magnetism. To the Chinese and Greeks of ancient times, the attractive and repulsive forces between magnets must have seemed magical indeed. Through the ages, miraculous curative powers have been attributed to magnets, and magnets have been used by illusionists to produce “magical” effects. Magnets guided ships in the Age of Exploration and generated the electrical industry in the 19th century. Today they store information and entertainment on disks and tapes, and produce sound in speakers, images on TV screens, rotation in motors, and levitation in high-speed trains. Students visit various MIT projects related to magnets (including superconducting electromagnets) and read about and discuss the history, legends, pseudoscience, science, and technology of types of magnets, including applications in medicine. Several short written reports and at least one oral presentation will be required of each participant.",
  "topics": [
    "Humanities",
    "History",
    "History of Science and Technology",
    "Science",
    "Physics",
    "Electromagnetism",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nCourse Summary\n\nMy goals for this seminar include:\n\nteaching you some interesting things about magnets and their many uses in science and technology,\n\nexposing you to glimpses of the wide range of research that goes on in various departments at MIT,\n\ncreating a friendly and low-pressure small-group environment, and\n\ngiving you a little practice in oral and written communication.\n\nYou get 6 academic credits for the seminar, but I suspect your 12-credit courses consume more than twice as much time each week as the seminar. (That's OK, but I do want you to learn\nsomething\nfrom the seminar!) In your other courses, the exams provide ample pressure to motivate you to study and learn the material, but the seminar has no exams. The only assigned \"homework\" to motivate study is seven short writing assignments and one oral presentation. (I gather some freshman seminars assign more homework, some assign less.) To try to maintain interest, I cover many different topics rather than a few in great depth.\n\nTextbook\n\nLivingston, J. D.\nDriving Force: The Natural Magic of Magnets\n. Cambridge, MA: Harvard University Press, 1996. ISBN: 9780674216457.\n\nReadings in\nDriving Force\nwill be supplemented by other articles and handouts distributed in class.\n\nCourse Calendar\n\nThe following table summarizes the topics covered in each class session.\n\nLec #\n\nTopics\n\nDetails\n\nINSTRUCTORS\n\nKEY DATES\n\nIntroduction: Basics of Hard and Soft Magnetic Materials\n\nEarth's magnetic field, north and south poles, attraction and repulsion, magnetic torques, forces, energy. Hard (permanent) and soft (temporary) magnetic materials. Saturation magnetization, coercivity, magnetic viewers.\n\nDr. James Livingston\n\nMagnetic Forces and Curie Temperatures\n\nVisit:\nMIT Plasma Science and Fusion Center\n. See demonstrations of Curie temperature, induction, levitation, plasma control, etc. by MIT's \"Mr. Magnet.\"\n\nPaul Thomas\n\nAssignment 1 due\n\nBasics of Electromagnetism\n\nMagnetism from electricity (electromagnets), electricity from magnetism (induction), magnetic levitation.\n\nDr. James Livingston\n\nAssignment 2 due\n\nMagnetic Data Recording\n\nVisit: Prof. Ross's\nMagnetic Materials and Devices Group\n. Discuss magnetic recording materials and systems, hard disks, other forms of data recording.\n\nProf. Caroline Ross, Department of Materials Science and Engineering\n\nAssignment 3 due\n\nSuperconductivity\n\nUse liquid nitrogen to show the levitation of magnets above a \"high-temperature\" superconductor and learn a bit about superconductivity and its applications. We also may be able to cool other things to 77 Kelvin to see how their properties change.\n\nDr. James Livingston\n\nAssignment 4 due\n\nBrain Magnetic Fields\n\nVisit:\nMagnetoencephalography Lab\n. See how a magnetically shielded room and SQUIDs are used measure the magnetic fields produced by the human brain.\n\nProf. Alec Marantz, Department of Linguistics\n\nAssignment 5 due\n\nOral Presentations - Part 1\n\nStudent presentations on the Gauss rifle, bird navigation, and magnetism and relativity.\n\nStudents\n\nMagnets in Cyclotrons, CERN, and Space\n\nVisit: Cyclotron Building. Perform hands-on experiments in the large cyclotron magnet, directly seeing and feeling the effects of large magnetic fields on conductors. Learn about their space-based and land-based research employing magnets.\n\nDr. Ben Monreal, Electromagnetics Group of the\nLaboratory for Nuclear Science\n\nAssignment 6 due\n\nOral Presentations - Part 2\n\nStudent presentations on NMR in chemistry, magnetic therapy, and rail guns and coil guns.\n\nStudents\n\nMagnets in NMR, EPR, Mass Spectroscopy\n\nVisit: Chemistry Department's\nInstrumentation Facility\n. See a collection of large superconducting electromagnets used for NMR and learn how they are used to analyze molecular structure.\n\nDr. Hyongjun Pan\n\nFerrofluids\n\nBegin with experiments on ferrofluids (suspensions of fine magnetic particles in liquids).\n\nVisit: Prof. Doyle's\nDynamics of Biopolymers and Complex Fluids\nlaboratory, where they have employed magnetic microparticles for DNA separation.\n\nProf. Patrick Doyle, Department of Chemical Engineering\n\nWrap-up\n\nDiscuss this seminar, your first term at MIT, and your plans for the rest of the school year.\n\nAssignment 7 due",
  "files": [
    {
      "category": "Resource",
      "title": "Magnetism and Relativity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-a08-attraction-and-repulsion-the-magic-of-magnets-fall-2005/8b381002f65584aef2ba0b42339868aa_mag_relativity.pdf",
      "content": "Magnetism and Relativity\nRobert Moffat\n\nReference Frames:\nz\ny\n\n- A reference frame is a coordinate system that you set up around yourself in\norder to make measurements, e.g. up/down, north/south, east/west, and your\nwristwatch for measuring time.\n\nx\n- If you are moving at a constant velocity, then you are in an inertial reference frame. You can\nonly measure things with respect to your own frame. People in other reference frames will\nmeasure the same things differently. For example, you might say the sun is in the up direction,\nwhile someone in Australia might say it is in the down direction. This not only applies to\nmeasuring positions, but also lengths, and time intervals.\n\n- Keep in Mind!!! There are always two parts to every observation: the thing being observed, and\nthe person doing the observing. Two people observing the same thing can get different\nmeasurements of the same property, like length for example. It all depends on the observer's\nreference frame!\n\nPostulates of Relativity:\n\n1. Principle of Relativity: \"The same laws of electrodynamics and optics will\nbe valid for all frames of reference for which the equations of mechanics\nhold good.\"\n2. \"Light is always propagated in empty space with a definite velocity c\nwhich is independent of the state of motion of the emitting body.\"\n\nEinstein, Albert. On the Electrodynamics of Moving Bodies, June 1905.\nPhoto: Wikimedia Commons\n\nThe Equations of Relativity:\n\nTime Dilation:\nMoving clocks appear to tick more slowly to observers at rest.\n\nt = t' t' is the length of a time interval that you measure with your clock,\n√ 1 - v2/c2 and t is the length of the same time interval another observer would measure if\n\nyou were moving past them with velocity v.\n\nLength Contraction: Moving objects appear shorter to observers at rest.\n\nl = l' √ 1 - v2/c2 l' is the length of the object that you measure with your ruler,\nand l is the length of the same object that another observer would measure if you\nwere moving past them with velocity v. (This only applies to lengths in the same\ndirection as v. All other lengths stay the same.)\n\nElectricity and Magnetism in Two Different Reference Frames:\n\nSuppose you send a current through a wire, and then toss an electron next to it so that it has the\nsame velocity as the electrons flowing through the wire. Using the right hand rule, you can find the\ndirection of the wire's magnetic field. Using it again will show that the wire attracts the electron. This is\nobviously a magnetic force, since the wire does not produce any electric fields.\nBut what if you walked next to the electron, so that it appeared to stand still in your new\nreference frame? (This should be easy, since electrons usually flow through wires with speeds of a few\nmillimeters per second.) When a charge is not moving it experiences no magnetic force at all! What\nhappens now?\n\nThe Wire, Observed in the Laboratory Reference Frame:\n\nF = -e v×B\n\nv\nB (out of page)\n\nIn the electron's reference frame (where the electron is standing still), all of the electrons in the\nwire now appear to stand still. They are not moving in this reference frame, so the distances between\nthem are no longer length-contracted as they were in the laboratory frame. This means the electron sees\nthe other electrons to be spread out compared to what someone in the laboratory frame would measure.\nThe opposite happens to the positive metal ions. They appear to move backwards in the electron's\nframe, and so their separations appear length-contracted to the electron. Thus, the electron sees a lower\ndensity of negative charges, and a higher density of positive charges, which creates an electric field that\nattracts the electron.\n\nThe Wire, Observed in the Electron's Reference Frame\n\nF = -e E\n\nE\n\nSo a force caused by an electric field in one reference frame appears to be caused by a magnetic\nfield in another reference frame. In different reference frames, the force will appear to be caused by a\ncombination of electric and magnetic fields. However, the same thing always happens: the electron is\nalways attracted to the wire with the same force. This shows that electricity and magnetism are not really\ndifferent from each other. In fact they are two different ways of looking at the same thing. This is why\nthe two are combined into what is now called the \"electromagnetic force\"."
    },
    {
      "category": "Resource",
      "title": "The \"Gauss Rifle\"",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-a08-attraction-and-repulsion-the-magic-of-magnets-fall-2005/234b1fdf3985fbb9b4460a162f8522d9_gauss_rifle.pdf",
      "content": "Meghan Reedy\n\nThe \"Gauss Rifle\"\n\nReady... Aim... Fire! But this gun sets off no explosion; instead, the ball flies off the end,\npropelled not be heat or rapidly expanding air, but magnets! Meanwhile, the ball \"fired\"\nsits at the back, behind the very first magnet in the string. But how?\nSimple materials make up a working Gauss Rifle: a ruler, several magnets, and balls\nmade of a magnetizable metal with a diameter about equal to the size of the magnets.\nTwice as many balls as magnets are needed for the initial set up, and then one more ball\nto release in order to fire the gun. The magnets are tightly fixed to the ruler, and the balls\nlined up such that two follow each magnet on the front sides. Then the one extra ball is\nreleased from behind the first magnet, and within a few seconds, the front ball flies off the\nfront!\nWhen the \"fired\" ball is released, the attractive force of the first magnet pulls it forward,\nand the ball speeds up until it hits the magnet. The energy from the ball's speed must go\nsomewhere, and so it transfers to the front ball of this set, on the other side of the magnet.\nThis ball in turn flies off, speeding up as it approaches the second magnet, which it hits.\nThe energy from this collision sends the furthest forward ball of this set moving towards\nthe third magnet, and so on. With each successive magnet, the speed of the ball as it flies\noff increases. With only a few magnets, the last ball can leave with enough speed that the\nhuman eye cannot follow it.\nThe energy in the Gauss Rifle comes from the second ball following each magnet moving\nfrom a position of higher energy to lower energy. The first ball in each pair touches the\nmagnet, and thus cannot move any closer. However, if it were taken out, the second ball\nwould roll to touch the magnet. In the final configuration of the gun, there are the same\nnumber of balls, but all of the balls are directly touching a magnet, with none separated\nfrom the magnet by another ball. With no balls in the higher-energy state of separated\nfrom the magnet, the total energy of this system has decreased. The energy, in turn, had\nto go somewhere, and it went into the ball that left the front of the gun. This ball had as\nmuch kinetic energy as the gun lost potential energy, counting the potential lost as the first\nball moved forward to touch the first magnet. Since quite a bit of potential energy can be\nstored in the starting configuration, giving moderately strong magnets, the front ball can\nleave at quite high speeds.\n\nBibliography\n\nField, Simon. \"The Gauss Rifle: A Magnetic Linear Accelerator.\" Science Toys You Can\nMake With Your Kids. October 21, 2005.\nhttp://www.scitoys.com/scitoys/scitoys/magnets/gauss.html."
    },
    {
      "category": "Resource",
      "title": "Magnetic Materials Overview",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-a08-attraction-and-repulsion-the-magic-of-magnets-fall-2005/ce90286532316e4ad28124407aac22b6_magnet_basics.pdf",
      "content": "MAGNETIC MATERIALS OVERVIEW\nDr. James Livingston\n\nMagnetic materials provide the \"driving force\" that turns our electric motors, generates\nelectricity in power stations and sound in our speakers, and stores information on our credit\ncards and computer disks. Materials science has created magnetic materials far more\npowerful than those available only a few decades ago, resulting in a tremendous impact on\nmodern technology.\n\nReview of magnetics basics\nMagnetic fields are created by electric charges in motion (electric currents, orbital motion of\nelectrons, SPIN of electrons)\nMagnetic fields exert forces on electric charges in motion (current-carrying wires, charged-\nparticle beams, orbital motion of electrons, SPIN of electrons)\n\nMaterials categories\nIf atoms have no net spin, materials are diamagnetic (weakly repelled by field)\nIf a net spin, but uncoupled to neighbors, paramagnetic (weakly attracted)\nIf equal net spins are coupled antiparallel, antiferromagnetic (weakly attracted)\nIf unequal net spins are coupled antiparallel, ferrimagnetic (strongly attracted)\nIf net spins are coupled parallel, FERROMAGNETIC (very strongly attracted)\nOnly ferri- and ferromagnetic materials are considered magnetic materials\n\nHard and soft magnetic materials\n\"Soft\" (temporary-magnet) materials lose their net magnetization (form domains) when a\nmagnetic field is removed - used for AC or on-off applications\n\"Hard\" (permanent-magnet) materials retain their magnetization after field is removed - used\nfor applications requiring a steady magnetic field\n\nProperties of magnetic materials\nSaturation magnetization is a measure of the magnetic field a material can produce when all\natomic magnets are aligned - how \"magnetic\" it is\nCoercivity is the reverse magnetic field required to reduce the net magnetization to zero -\nhow \"permanent\" it is. (\"soft\" = low coercivity, \"hard\" = high coercivity)\n(Other properties often quoted are the permeability of soft materials, which varies inversely\nwith coercivity, and the energy product of hard materials, related to area of \"hysteresis loop\"\n& depends on both coercivity and saturation magnetization)\n\nHistory of hard (permanent-magnet) materials\nLodestones - natural magnets based on magnetite (Fe3O4)\nCarbon steel (Fe-C) 18th-c. England (horseshoe shaped or bar magnets)\nAlloy steel (Fe-C+W, Mo, Cr, Co, etc.) - 19th and early 20th-c. (horseshoe or bar)\nAlnico (Fe+Al,Ni,Co) - 1930s & 1940s - helped Allies win World War II\nHard Ferrite (Ba-Fe-O or Sr-Fe-O) - 1950s & 1960s - higher coercivity, cheap!\nRare Earth (Sm-Co, Nd-Fe-B) - 1970s-1990s - VERY powerful, but NOT cheap\n\nApplications\n\nHard (permanent) magnetic materials are used in applications requiring a steady\nmagnetic field. Recent increases in coercivity (resistance to demagnetization) and energy\nproduct (dependent on both coercivity and saturation magnetization, and related to the area\nwithin the hysteresis loop) have greatly increased the use of permanent magnets in modern\ntechnology. The widest applications are in motors, speakers, and sensors, but large quantities\nof Nd-Fe-B magnets are also used in permanent-magnet MRI systems, each of which uses\nabout 2 tons of permanent magnet.\n\nFor most applications, the amount of permanent magnet required is inversely\nproportional to the energy product. Available energy products have increased by a factor of\nfifty since the 1930s, allowing a corresponding decrease in the size of the magnet, and thus\nthe size of the device. (e.g., small motors made possible by Nd-Fe-B magnets spin the disks\nand move the heads in computer disk drives, and small speakers produce music in the tiny\nearphones of iPods and the like.)\n\nAt least as important have been increases in coercivity by even greater factors, which\nallow a greater flexibility of magnet shape. Low-coercivity steel magnets required long bar\nmagnets or horseshoe shapes to minimize demagnetization from reverse fields produced by\nthe north and south poles at the ends of the magnet. (Before the advent of alnico magnets in\nthe 1930s, telephone receivers were long and separate from the speakers because they\nincluded a long horseshoe-shaped steel magnet.)\n\nMaterials for magnetic recording have also improved dramatically in recent years. The\nfirst magnetic recorder, patented in 1898, used steel piano wire. Magnetic tapes employing\nparticles of iron oxide coated on plastic tapes were developed in Germany in the 1930s. Such\ntapes were used in the first commercial computers in the 1950s, and advanced versions\nremain in use today for audio and video applications, but today's computers instead store\ninformation in patterns of north and south poles on disks coated with thin films of cobalt-\nrich alloys.\n\nThere have also been dramatic improvements in the properties of soft magnetic\nmaterials. Decreases in coercivity have decreased the energy losses of soft materials in ac\napplications, as have increases in electrical resistivity. Many transformers today use\n\namorphous Fe-rich alloys, cooled so rapidly from the melt that they are unable to crystallize.\nAn area of extensive current research is materials for recording heads, and improved\nmaterials have contributed to the remarkable increases in the density of information storage\n(bits per square inch)."
    }
  ]
}