{
  "course_name": "Autism Theory and Technology",
  "course_description": "This course illuminates current theories about autism together with challenges faced by people on the autism spectrum. Theories in communicating, interacting socially, managing cognitive and affective overload, and achieving independent lifestyles are covered. In parallel, the course presents state-of-the-art technologies being developed for helping improve both theoretical understanding and practical outcomes. Participants are expected to meet and interact with people on the autism spectrum. Weekly reading, discussion, and a term project are required.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Health and Medicine",
    "Mental Health",
    "Social Science",
    "Psychology",
    "Teaching and Education",
    "Educational Technology",
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Health and Medicine",
    "Mental Health",
    "Social Science",
    "Psychology",
    "Teaching and Education",
    "Educational Technology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nDescription\n\nThis course will lay a foundation in autism theory and autism technology that significantly leverages and expands MIT's ability to pioneer new technology for helping under-served populations. Autism Spectrum Disorders (ASD's) encompass a broad set of conditions applying to a growing number of people worldwide, which the CDC identified in 2009 as involving the diagnosis of 1 in 100 children by age 8 in the USA. A person receives a diagnosis of ASD when they have a combination of atypical responses in categories relating to social interaction, communication, and restrictive and repetitive behaviors.\n\nMany people on the autism spectrum face significant challenges with daily living, relationship building and maintenance, emotion awareness and regulation, and both verbal and nonverbal communication. Many also have problems with motor coordination and fine motor control to produce speech or certain sequences of movements, and some have a mysterious condition where their ability to move completely disappears and returns. Many also have problems with sensory regulation, sleep, attention, and executive function abilities. Students who take this class will learn about all of these challenges, many of which also affect people who do not have an autism diagnosis. Students will receive a state-of-the-art overview of technologies being developed to address such challenges.\n\nThis class will involve presentations from experts in autism and in autism technologies, and provide opportunities to interact with individuals on the autism spectrum, including those who support them. The course will also explore the converging challenges and goals of autism research and new technologies - including networked, wearable, and robotic - that have increasingly human-like social, emotional, and communication skills. We will advance ways technology can be used for helping both researchers and people on the autism spectrum to gain greater understanding of the condition through systematic measurement of affective, physiological, and behavior data. We will also work together to develop technologies that increase opportunities for communication and expression. Our goals are to enable people with disabilities to gain the tools and help they need, while also helping researchers, families, and their support network to develop a better understanding of what autism is.\n\nAll students will be expected to carry out a project in a team or solo.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClassroom participation\n\n25%\n\nTen assignments (reading/response)\n\n30%\n\nProject and presentation\n\n45%\n\nHomework handed in late will be deducted points as follows: 1 point the first time you are late; 2 points the second time; N points the Nth time.\n\nWith the exception of the first day of class, readings and assignments are due 24 hours before class meets.\n\nAll students are expected to attend all classes and all project presentations. Please contact one of the professors in advance if you will have to miss class. Unexcused absence will affect your class participation grade.\n\nThe final project presentations are especially important for everyone to attend; please do not plan to leave for summer until after the last day of class.\n\nCalendar\n\nCLASS\n\nTOPICS\n\nGUEST SPEAKER\n\nKEY DATES FOR FINAL PROJECT\n\nIntroduction to autism and autism technology - Overview of autism spectrum disorders. Discussion of opportunities we see with our research/technology, e.g., affective computing, social robotics, relational machines, commonsense computing, to offer communication and learning opportunities to individuals with autism spectrum disorder, to their families and to teachers/clinicians/researchers. What can we learn from individuals, many of whom prefer to be called \"autistic\" and from strategies they have devised to adapt to the challenges they face with autism?\n\nAutism Technologies\n\nGregory Abowd, Rob Morris and Ehsan Hoque\n\nUnderstanding & Treating Problem Behavior in ASD\n\nTed Carr\n\nBiomedical & Environmental Factors\n\nMartha Herbert\n\nPersonal Perspective & Autistic Intelligence\n\nStephen Shore\n\nProject proposal (draft) due\n\nProject Idea Discussions\n\nProject proposal (final) due\n\nPersonal Perspective, and Stress, Arousal, Anxiety & Physiological Recording\n\nNomi Kaim, and Matthew Goodwin\n\nSensory Issues\n\nJane Koomar and Elliot Hedman\n\nProject Progress Presentations\n\nProject progress presentations\n\nAlternative & Augmentative Communication Technologies, and Repetitive Behavior\n\nAmanda Baggs, and Matthew Goodwin\n\nEarly Diagnosis\n\nCharles Nelson\n\nLast day of class - Final Project Presentations\n\nPresentations on final projects\n\nProject feedback/wrap-up/reflect and discuss, ASD controversies\n\nProject write-up/webpages due",
  "files": []
}