{
  "course_name": "Basic Structural Design",
  "course_description": "This course provides students with a basic knowledge of structural analysis and design for buildings, bridges and other structures. The course emphasizes the historical development of structural form and the evolution of structural design knowledge, from Gothic cathedrals to long span suspension bridges. Students will investigate the behavior of structural systems and elements through design exercises, case studies, and load testing of models. Students will design structures using timber, masonry, steel, and concrete and will gain an appreciation of the importance of structural design today, with an emphasis on environmental impact of large scale construction.",
  "topics": [
    "Engineering",
    "Civil Engineering",
    "Structural Engineering",
    "Fine Arts",
    "Architecture",
    "Architectural Engineering",
    "Engineering",
    "Civil Engineering",
    "Structural Engineering",
    "Fine Arts",
    "Architecture",
    "Architectural Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLab: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis course provides students with a basic knowledge of structural analysis and design for buildings, bridges and other structures. The course emphasizes the historical development of structural form and the evolution of structural design knowledge, from Gothic cathedrals to long span suspension bridges. Students will investigate the behavior of structural systems and elements through design exercises, case studies, and load testing of models. Students will design structures using timber, masonry, steel, and concrete and will gain an appreciation of the importance of structural design today, with an emphasis on environmental impact of large scale construction.\n\nWe will cover the following topics: graphical analysis and design of structures; properties of construction materials; environmental assessment of materials; analysis, design and behavior of beams, columns, trusses, frames, arches; and structural systems. The laboratory exercises include design exercises, materials testing, and model building.\n\nTextbooks\n\nZalewski, Waclaw, and Edward Allen.\nShaping Structures: Statics\n. New York, NY: Wiley, 1998. ISBN: 9780471289968.\n\nSchodek, Daniel.\nStructures\n. 4th ed. Upper Saddle River, NJ: Prentice Hall, 2000. ISBN: 9780130278210.\n\nGrading\n\nFinal grades will be determined as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance\n\n5%\n\nHomework\n\n30%\n\nLab reports\n\n20%\n\nMidterm exam\n\n20%\n\nFinal project\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "Beam Design Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/f0db2c64d4ede6bbb217eee8f78495a5_MIT4_440s09_project02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBasic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nBeam Design Project\nWorking in teams of two, you will design a simply-supported beam to carry a heavy load at\nthe center. The beam must span a clear distance of 24\" and must support a 4\" square loading\nplate at the center. The goal is to design a minimum weight structure which will support 100\npounds at the center. Though it should fail at 100 pounds, the structure should support 50\npounds with no visible deflection. A load plate (4\"x4\") must be supported at the center of the\nbeam. Your beam must be less than 4\" deep and less than 4\" wide throughout.\nMaterials: You may use balsa wood and dental floss. Suggested properties of balsa wood:\nModulus of Elasticity, E = 100,000 psi\nFailure Stress, fcr = 800 psi (in both tension and compression, parallel to grain)\nThese properties vary substantially for balsa wood of differing density and quality. Similarly,\nthe mechanical properties of dental floss vary.\nYou may use smaller balsa wood elements to build up larger sections, but no single\ncomponent may have a cross-sectional area greater than 0.125 square inches (1/8 in2). (For\nexample, you may use thin strips of balsa 1/4\" x 1/2\" to build up sections with an area greater\nthan 0.125 square inches, but you may not use solid balsa pieces which are 1/2\" x 1/2\".) No\nmore than four pieces of wood may be glued together to make a built-up member. There are\nno restrictions on the type of glue used. If you are unsure about whether your proposed\ndesign is acceptable, please see your TA or the professor with questions.\nDeliverables\nYour final project must include a report with design drawings and supporting calculations.\nYou should justify the failure mode with calculations. You should illustrate the plan and\nelevation of your structure with drawings or pictures, together with the cross-sectional\nproperties of at least two key structural members. Your calculations should not exceed two\nletter size pages and the entire report must not exceed four pages.\nProject Schedule\nWeek 5\nProject assigned\nWeek 6\nForm teams in lab\nWeek 8\nLoad testing of structures\nWeek 9\nProject report due\nGrading: Your project will be evaluated on the clarity and accuracy of your final report."
    },
    {
      "category": "Resource",
      "title": "Structural Design Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/65aea134c6a1d5951e76e8bf33a01e77_MIT4_440s09_project03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n4.440/4.462 Basic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nStructural Design Project\nYou will design a long span roof to serve as an open market and pavilion. A successful design will require\nminimal structural supports to avoid obstructing the interior views. You must provide at least 30,000 square\nfeet of enclosed space on the ground level (about half the size of a football field). No other floors are\nallowed, though you may alter the elevations of the ground level as you like. At least one long span is\nrequired, with a minimum span of 100 feet. Your structure must provide a means for natural lighting as well\nas natural ventilation.\nLoads\nYour structure must support its own self-weight (dead load), plus a uniform live load of 30 psf for\nsnow/wind. The structure must be able to support asymmetrical loads, such as the snow/wind load applied\nover one half of the roof. You must also propose a lateral load system. Detailed design calculations are not\nrequired for lateral loads, but you must have a strategy for resisting lateral loads due to wind and\nearthquake loading. You may use metric units throughout if you prefer.\nAllowable Design Stresses\nYou should size the elements of your structure so that the axial stresses under all loading conditions do not\nexceed the allowable stress given below. Use the material density to compute the dead load.\nMaterial\nMasonry (compression)\nConcrete (compression)\nSteel\nSteel cable (tension)\nTimber (tens. or comp.)\nAllowable Stress\n\n0.5 ksi\n\n1.5 ksi\n\n15 ksi\n30 ksi\n1.0 ksi\nMaterial Density\n\n150 pcf\n\n150 pcf\n\n490 pcf\n490 pcf\n60 pcf\nDeliverables\nYour final project must include design drawings and supporting calculations. Your drawings should illustrate\nthe plan and elevation of your structure, together with the cross-sectional properties of at least two key\nstructural members. One critical structural detail must be designed and presented as part of the drawings.\nYour design should include sufficient calculations to illustrate the structural action and the safety of your\nproposal. You may demonstrate safety with a graphical analysis or other equilibrium methods. Your\ncalculations should include an estimate of the weight of the structure and the maximum vertical loads for\ndesign. Be sure to include the approximate weight of roofing or other external finishes. Your calculations\nshould not exceed five pages of 8.5\" x 11\" and above all you should seek clarity in your design and\nanalysis. Your complete proposal should be presented on a maximum of eight total pages of 8.5\" x 11\", or\nthe equivalent sized poster. Each design must provide the self-weight and embodied CO2 emissions\nin pounds per square foot for your structure.\nProject Schedule\nWeek 11\nTurn in preliminary calculations for project\nWeek 13\nFinal review"
    },
    {
      "category": "Assignment",
      "title": "Assignment #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/12bd9ffbc93d7e5cfdc85442db8bafda_MIT4_440s09_assn01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n4.440/4.462 Basic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nAssignment #1\n1) A cable must support five point loads as shown below. Label the problem with Bow's\nnotation. Draw the force polygon and determine the shape of the cable if the horizontal\ncomponent of cable force is 200 kN. (Draw your force polygons on the load line at left below,\nwhere 1 cm = 50 kN.) Now draw a new force polygon below with the horizontal force\ncomponent of 800 kN and determine the shape of the cable based on the new force polygon. For\neach case, draw the cable below the point loads and determine the size of the tension reactions\nneeded to support the cable. What do you notice about the geometry of the cable in each case?\nHow does the sag of the cable change in relation to the horizontal force in the cable?\n50kN\n75kN\n50kN\n75kN\n50kN\nSuggested scale: 1 cm = 50 kN\n\n4.440/4.462 Basic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\n2) As the structural guru in Frank Gehry's office, you must propose a system for carrying column loads\nover a truck loading zone in the basement of a new building. The inclined columns carry the weight of\nfive stories above and this load must be transferred over an open space as illustrated in Figure 1. Each\ncolumn carries an axial load of 200 kips and is inclined at a slope of 4:1 as shown.\na) Label the problem using Bow's notation to facilitate a graphical solution.\nb) On a separate piece of paper, draw the load line for the problem using the loads given in Figure 1. (You\nmay choose to draw the force polygon at a convenient scale.)\nc) Using graphic statics, propose a structural solution in axial compression for the problem which does\nnot interfere with the zone marked by a dashed line in Figure 1. Your arch must be supported on the\nfoundation beneath the building and should be horizontal at the crown of the arch. Draw your design on\nFigure 1. (Note: you may wish to experiment with several trial pole locations before deciding on the final\nform.)\nd) Based on the force polygon for this problem, which element of the arch carries the highest load? Using\nconcrete with an allowable stress of 1,300 psi (1 kip = 1,000 lbs, so this is 1.3 kips/in2), what is the\nminimum required cross-sectional area? (Recall that stress is force/area.)\ne) Based on the results of (d), propose a suitable cross-section for this part of your arch.\nf) In terms of construction, name one advantage and one disadvantage to your proposed system.\n200k\n200k\n200k\n200k\nColumn-free zone for\ntruck loading area\nContinuous foundation\nFigure 1\n3) Solve for the internal forces in the crane of Figure 2 using\na) graphical methods, and\nb) numerical methods\ndue to the applied load of 40 kips. Assume that two\nseparate cables are fixed to the end of the mast (ie the\ncable is not continuous). Label tension and compression.\nc) Now suggest a redesign to decrease the mast force.\nFigure 2\n40 kips\n26.6"
    },
    {
      "category": "Resource",
      "title": "Structural Design Project #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/d6e0e627235b73eeaeb744e3078296a1_MIT4_440s09_project01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n4.440/4.462 Basic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nStructural Design Project #1\nDescription: Design a balsa wood column to support axial load. Verify the design with an\nanalysis to predict the ultimate load and failure mode. Build the structure with the specified\nmaterials and test to failure.\nGoal: Design a minimum weight structure which can support the maximum possible axial force.\nAs a measure of performance, the failure load will be divided by the weight of the structure. For\neach column, we will also determine the maximum force times the length squared as a weighted\nmeasure of performance to reward taller columns. Your column must have a minimum height of\n12\" and must be less than 5\" in diameter at any point. Columns may not be more than 36\" tall.\nMaterials\nYou may use only balsa wood and dental floss. Suggested properties of balsa wood are:\nModulus of Elasticity, E = 600,000 psi\n\nFailure Stress, σcr = 1,000 psi (in both tension and compression, parallel to grain)\nNOTE: These properties vary substantially for balsa wood of differing density and quality. Similarly, the mechanical\nproperties of dental floss vary widely. You may want to research your material properties independently.\nYou may use smaller balsa wood elements to build up larger sections, but no single element may\nhave a cross-sectional area greater than 0.125 square inches (1/8 in2). (For example, you may\nuse thin strips of balsa 1/4\" x 1/2\" to build up sections with an area greater than 0.125 square\ninches, but you may not use solid balsa pieces which are 1/2\" x 1/2\".) No more than four pieces\nof wood may be glued together to make a single built-up member. There are no restrictions on\nthe type of glue used.\nDeliverables\nYour final report must include a description of your design and supporting calculations. Draw a\nsimple plan and elevation of your structure showing dimensions. Calculate the sectional\nproperties of gross area and moment of inertia for the critical section. Calculate the load capacity\nof your column and state all assumptions clearly. Include graphs of the load-displacement curve\nand the stress-strain curve for your column. Estimate the modulus of elasticity of balsa in\ncompression by determining the slope of the elastic portion of the stress-strain curve. Your\ncalculations should not exceed two pages of 8.5\" x 11\" and above all you should seek clarity in\nyour design and analysis. The total report should be three pages or less.\nProject Schedule\nWeek 2\nProject assigned\nWeek 3\nDesign in lab\nWeek 4\nLoad testing of structures\nWeek 5\nProject report due"
    },
    {
      "category": "Assignment",
      "title": "Assignment #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/7fcbc53329b4c32fd282f450fc81a0bf_MIT4_440s09_assn02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n4.440/4.462 Basic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nAssignment #2\n1) For the truss illustrated below, make the typical assumptions for truss analysis to determine the internal\nforce in each element.\na) What are the external support reactions?\nb) Solve for the internal forces in the truss using the method of joints. Label each member as\ntension or compression, together with the value of internal axial force.\nc) Analyze the same truss using graphical analysis. Label the problem clearly using Bow's\nnotation and determine the internal forces from the resulting force polygon. Compare your\ngraphical solution to the numerical solution from (b) and explain any discrepancies.\n30 feet\n30 feet\n22 k\n11 k\n45o\n45o\n45o\n45o\n45o\n45o\n2) Using results from above, which element has the highest compression force? Design this element so\nthat the safety factor against buckling is at least 3.0 due to the applied loads. You may assume that the\nelement is pinned at each end.\na) If the member is a steel pipe with an outside diameter of 6\", what is the thickness required for\nthe pipe wall to resist buckling with a safety factor of 3.0? (Esteel = 29,000 ksi)\nb) If the member is a solid square timber column, what is the width of the column required to\nresist buckling with a safety factor of 3.0? (Etimber = 1,600 ksi)\nc) If every element of the truss is made from a 6-inch outer diameter steel pipe with a wall\nthickness of 0.25 inches, what is the axial stress in each element due to the applied loads?\nd) Name two things you could change about this truss design in order to reduce the value of\ncompressive force in the most highly stressed element."
    },
    {
      "category": "Resource",
      "title": "Homework #4: Frame Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/4c041629c9968d57be5d3915608f3bf1_MIT4_440s09_assn04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n4.440/4.462: Basic Structural Design\nSpring 2009\nOchsendorf\nMIT Architecture\nHomework #4: Frame Design\n1 k/ft\n0.4 k/ft\n40 ft\n20 ft\nA\nB\nC\nFor the frame supported on a pin and a roller shown above:\na) Determine the support reactions at A and B due to the applied loads. (15 pts)\nb) Determine the value of internal bending moment at point C. (10 pts)\nc) Draw the shear diagram for the frame and label the key values. (20 pts)\nd) Draw the moment diagram for the frame and label the key values, including the magnitude\nand position of the maximum bending moment. (25 pts)\ne) Propose two ways to alter the frame to reduce the maximum bending moment for the same\ngeometry and loading. (20 pts)\nf) Considering your moment diagram from (d) above, sketch an efficient truss design for the\nframe. (10 pts)"
    },
    {
      "category": "Resource",
      "title": "Equations for Structural Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/d3103de89f76ac2f7b51fe6c1bcc15c4_MIT4_440s09_exam02_equations.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBasic Structural Design\nSpring 2009\nJ.A. Ochsendorf\nMIT Architecture\nEQUATIONS FOR STRUCTURAL DESIGN\nAxial stress: σ = P/A\nBending stress due to an applied moment, M: σ = My/I\nwhere y is the distance from the neutral axis of the beam\nCritical buckling load for a column in axial compression: Pcr = π2EI/(kL)2\nMoment of Inertia (I):\nb\ny\ny\nx\nx\nd\nx\nx\nh\ny\ny\nIxx = Iyy = πd4/64\nIxx = bh3/12\nIyy = hb3/12\n- Modulus of Elasticity (E): Approximate values for six common structural materials:\nEsteel = 29,000 ksi\nEglass = 10,000 ksi\nEaluminum = 10,000 ksi\nEconcrete = 3,000 ksi\nEtimber = 1,600 ksi\nEbrick = 3,000 ksi\n- Effective Length of the column (k):\nEffective Length Factors k for centrally loaded columns with various idealized end conditions. (*)\n(*) Taken from: Basic Steel Design with LRFD, T.V. Galambos, F.J. Lin and B.G. Johnston, Prentice Hall, Upper Saddle River, New Jersey,\n1996, pp. 88-89.\nBuc\nkle\nd s\nhap\ne o\nf c\nolu\nmn\nund\ner\nsix\nse\nts of end condit\nions.\nFigure by MIT OpenCourseWare."
    },
    {
      "category": "Exam",
      "title": "Midterm Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-440-basic-structural-design-spring-2009/45924a0aa369a1e541d00a56bab3d648_MIT4_440s09_exam01_2007.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n4.440 / 4.462 Basic Structural Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBasic Structural Design\n\nSpring 2007\nOchsendorf\n\nMIT Architecture\n\nMIDTERM EXAM (90 minutes)\n\nMarch 22, 2007\nMIDTERM EXAM (90 minutes)\n\nMarch 22, 2007\n\nANSWER ALL QUESTIONS IN THE EXAM BOOKLET PROVIDED.\nANSWER ALL QUESTIONS IN THE EXAM BOOKLET PROVIDED.\nSHOW ALL OF YOUR WORK FOR PARTIAL CREDIT.\nSHOW ALL OF YOUR WORK FOR PARTIAL CREDIT.\n\n1) TRUSS ANALYSIS (28 POINTS)\n1) TRUSS ANALYSIS (28 POINTS)\n\nFor the truss illustrated below, determine the internal force in each element.\nFor the truss illustrated below, determine the internal force in each element.\n\na) What are the external support reactions? (6 pts)\na) What are the external support reactions? (6 pts)\n\nb) Solve for the internal forces in the truss. You may use any method you like. (Note: Graphical\nsolutions must be within 5% of the exact solution.) Label each member as tension or\nb) Solve for the internal forces in the truss. You may use any method you like. (Note: Graphical\nsolutions must be within 5% of the exact solution.)\nure\nLabel each member as tension or\ncompression, together with the value of axial force. (16 pts)\n\nc) Name two assumptions necessary for the analysis of trusses. (6 pts)\n\n2) BUCKLING (17 pts)\n\nA timber column carries an axial load of 40 kips. The column is 25 feet tall and is supported by pin\nconnections at each end. If the column is 8\" x 8\" inches square, what is the safety factor against buckling\ndue to the applied load of 40 kips? (5 pts)\n\nIf the allowable axial stress is 2,000 psi, will the design of this column be governed by crushing or\nbuckling? (3 pts)\n\nSuggest three ways to increase the strength of this column. (9 pts)\n\n26.6o\n45o\n45o\n45o\n26.6o\n45o\n10 feet\n10 k\n10 k\n20 feet 10 feet 10 feet 20 feet\n10 k\n\nBasic Structural Design\n\nSpring 2007\nOchsendorf\n\nMIT Architecture\n\n3) BEAMS (35 pts)\n\nFor the beam illustrated below:\n\na) Find the support reactions at A and B due to the applied loads. (6 pts)\n\nb) Draw the shear diagram and label all values. (12 pts)\n\nc) Draw the moment diagram on the tension side of the beam. Label the location and magnitude\nof maximum moment. (12 pts)\n\nd) If the specified beam is a steel wide flange W18x50, with a depth of 18 inches and a moment\nof inertia I of 800 in4, what is the maximum bending stress in this beam? Does it exceed the\nallowable stress of 18 ksi? (5 pts)\n\n30 kips\n\n2 k/ft\n\nB\nA\n\n5 ft 5 ft\n\n10 ft\n\nBasic Structural Design\n\nSpring 2007\nOchsendorf\n\nMIT Architecture\n\n4) SHORT ANSWER (20 PTS) Answer each of the following with sketches or a few sentences.\n4) SHORT ANSWER (20 PTS) Answer each of the following with sketches or a few sentences.\n\na) Explain the difference in the structural behavior of a stone lintel on columns (Figure A) and a\nblock arch on columns (Figure B). How would each system fail? (8 pts)\na) Explain the difference in the structural behavior of a stone lintel on columns (Figure A) and a\nblock arch on columns (Figure B). How would each system fail? (8 pts)\n\nb) Each image below is a cross-section of a structure, which you may consider as a series of\nforces in tension or compression. For each image, draw the approximate forces which must act\non it in order to give this funicular form in pure tension and in pure compression. (12 pts)\nb) Each image below is a cross-section of a structure, which you may consider as a series of\nforces in tension or compression. For each image, draw the approximate forces which must act\non it in order to give this funicular form in pure tension and in pure compression. (12 pts)\n\nForm\n\nTension\n\nCompression\nure\nForm\n\nTension\n\nCompression\nFigure A\n\nFigure B\n\nExample\n\ni) Arch\n\nii) Rectangle"
    }
  ]
}