{
  "course_name": "Basic Themes in French Literature and Culture",
  "course_description": "Childhood is a source of fascination in most Western cultures. It is both a major inspiration for artistic creation and a political ideal, which aims at protecting future generations. Which role does it play in French society and in other francophone areas? Why is the French national anthem (“La Marseillaise”) addressed to its “children”? This course will study the transformation of childhood since the 18th century and the development of sentimentality within the family. We will examine various representations of childhood in literature (e.g. Pagnol, Proust, Sarraute, Laye, Morgièvre), movies (e.g. Truffaut), and songs (e.g. Brel, Barbara). Course taught in French.",
  "topics": [
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nChildhood in French and Francophone Cultures\n\nChildhood is a source of fascination in most Western cultures. It is both a major inspiration for artistic creation and a political ideal, which aims at protecting future generations. Which role does it play in French society and in other francophone areas? Why is the French national anthem (\"La Marseillaise\") addressed to its \"children\"? This course will study the transformation of childhood since the 18\nth\ncentury and the development of sentimentality within the family. We will examine various representations of childhood in literature (e.g. Pagnol, Proust, Sarraute, Laye, Morgievre), movies (e.g. Truffaut), and songs (e.g. Brel, Barbara). Course taught in French by\nBruno Perreau\n.\n\nGrading Policy\n\nFinal grade will be determined from the following:\n\nACTIVITIES\n\nPERCENTAGES\n\nOral presentation\n\n30%\n\nWeekly short-answer papers\n\n20%\n\nIndividual research paper\n\n40%\n\nClass participation\n\n10%\n\nPlease see the\nAssignments\npage for more details about the oral presentation, weekly short-answer papers, and research paper.\n\nClass Participation\n\nThe evaluation will be based on (1) attendance, (2) the demonstration that the students have done the weekly readings, (3) the quality (and not only the quantity) of their oral output. To help prepare for the discussion, questions on the readings and their most topical aspects will be suggested every week.\n\nCourse Schedule\n\nClass sessions will be divided between\n\nStudents' presentations of the weekly theme\n\nClass discussion to engage with the main readings and movies screened\n\nWeekly analysis of topical issues on France and the United States\n\nPlease see the table below for an overview of the topics covered in each session and in each of the four parts of this course, as well as key dates for the course.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nE\nPARTIE: QU'EST-CE QUE L'ENFANCE?\n\nL'enfance n'est pas une categorie stable. Ou commence et ou s'arrete-t-elle? Quel est le statut de l'enfant au cours des siecles? Non seulement les frontieres de l'enfance varient-elles au cours du temps et dans differents espaces, regionaux ou nationaux, mais, plus encore, sont-elles toujours le produit d'un travail de subjectivation. Etre un enfant, c'est etre a la fois designe comme tel et se penser comme tel, tant par son experience que dans son rapport aux autres.\n\nLa place de l'enfant\n\nLa parole de l'enfant\n\nOral presentation topics due\n\nL'inconvenient d'etre ne\n\nQuitter l'enfance I\n\nFilm:\nLe grand chemin\nby Jean-Loup Hubert\n\nQuitter l'enfance II\n\nE\nPARTIE: VIVRE L'ENFANCE\n\nL'enfance est souvent associee au jeu, a la liberte, aux soins parentaux. Bien sur d'autres representations existent-elles. Pour ne prendre qu'un seul exemple,\nVipere au poing\nd'Herve Bazin narre la cruaute et la tristesse dont les enfants font aussi l'experience. Mais, ces situations semblent aujourd'hui concues comme une exception ou un souvenir du passe, dans un modele general de l'enfance voulue sereine et protegee des rapports de pouvoir. Les discours qui dominent la vie politique mais aussi les medias de masse tendent ainsi a recouvrir la complexite de l'enfance. Sans doute le rapport inquiet des citoyens a leur avenir les conduit-il a vouloir projeter sur l'enfance leurs fantasmes de purete et de tranquillite. Mais ne risque-t-on pas, par consequent, de rester aveugles aux souffrances et aux besoins reels des plus jeunes d'entre nous?\n\nLes amis d'enfance\n\nDes jeux d'enfant\n\nL'enfant roi\n\nSouffrir d'enfance I\n\nFilm:\nLes quatre cent coups\nby Francois Truffaut\n\nSouffrir d'enfance II\n\nE\nPARTIE: LES ADULTES ET L'ENFANCE\n\nLa production de l'enfance est en partie retrospective. Ce sont les adultes qui developpent divers dispositifs d'education a destination des enfants. Ce faisant, ils se confrontent a leur propre enfance, ce qu'ils furent mais aussi ce qu'ils ne parvinrent pas a etre. Etre designe et se penser comme adulte, c'est toujours, par contraste, poser les limites de sa propre enfance. C'est pourquoi l'enfance a une dimension immediatement politique : elle est le contre-point a partir duquel se pensent et agissent les citoyens. La majorite liee a l'age se meut donc en regle de domination politique, apprise dans le rapport adulte/enfant, celle des plus nombreux sur les minoritaires. Dans quelle mesure l'enfant peut-il etre lui-meme traite comme une minorite politique?\n\nL'education I\n\nResearch paper outline due\n\nL'education II\n\nFilm:\nEtre et avoir\nby Nicolas Philibert\n\nL'enfance perdue, l'enfance retrouvee\n\nLa disparition de l'enfant\n\nE\nPARTIE: LA FORCE DE L'ENFANCE\n\nLe developpement des conventions internationales sur le droit des enfants ainsi que la prise en compte croissante de leur parole a radicalement transforme les representations des ages de la vie. Pour autant, ce phenomene a conduit a une certaine sanctification de l'enfance et omet de penser la faiblesse relative des adultes devant l'enfant : l'enfant qui dispose d'un capital temps, d'une energie qui semble inepuisable et d'un imaginaire fecond que l'adulte envie et regrette bien souvent. Nous chercherons a penser ce rapport de pouvoir complexe qui se ramifie dans des normes de classe, de race, de sexe et de sexualite.\n\nL'enfant dans la guerre\n\nResearch paper due\n\nFilm:\nLa colline aux mille enfants\nby Jean-Louis Lorenzi\n\nLa vie devant soi\n\nLes reves d'enfant\n\nFilm:\nLa cite des enfants perdus\nby Jean-Pierre Jeunet\n\nBilan du semestre\n\nBruno Perreau is an Assistant Professor of French Studies at MIT (PhD in Political Science, Sorbonne University, 2006) and a Research Fellow at Cambridge University. He is a former member of the Institute for Advanced Study (Princeton). Prior to joining MIT, Perreau taught at Paris XII University and Sciences Po. Please\nvisit his website\nfor further biographical information and his publication list.",
  "files": [
    {
      "category": "Resource",
      "title": "Émile ou l’éducation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-312-basic-themes-in-french-literature-and-culture-spring-2011/076defd5806f2fc2751928e2451e6393_MIT21G_312S11_Rousseau.pdf",
      "content": "Jean-‐Jacques Rousseau,\n(1762)\n\nEmile ou de l'education\n(\nnous\n...) Nou\navons\ns na\nbesoin\nissons faibles, nous a\nTout ce que nous n'a\nd'assistance\nvons pas a\n\n;\nnot\nnou\nvons\ns\nbesoin de force ; nous naissons\nre\nna\nna\nissons\nissance\nst\net\nup\ndont\nides,\nnous\nnous\na\navons\nvons b\nbesoin\ndepou\nde\nrvu\njugement.\ns de tout,\nnous est donne par l'education.\nesoin etant grands,\n\nC\nloppement\nette education\ninterne\nnous\nde nos\nvient\nfa\nde la nature,\nqu'on nous apprend\ncultes et de nos o\nou\nrga\ndes\nnes e\nhommes\nst l'educa\nou\ntion\ndes\nde l\nchoses.\na nature\nLe\n; l'u\ndeve\nsage\n-‐\nde\n\nnotre propre experience\na faire de\nsur\nce\nles\ndeveloppement\nobjets qui nou\nest\ns affect\nl'education\nent est l'edu\ndes hommes\ncation des\n; et\nchoses.\nl'acqu\n\nis\nChacun de nous\ncelui\ndiverses\nforme\ndans\nlecons se\nest\ncontrarient\ndonc\nest\npar\nmal\ntrois\neleve,\nsortes de maitres. Le disciple dans lequel leurs\nva seul a son but et vit consequemment. C\nlequel elles tombent toutes sur\nelui\nles\net\nmemes\nne sera\npoints,\njamais d'accord avec lui-‐meme ;\n\n-‐la seul est bien e\net\nle\ntendent\nve.\naux memes fins,\nOr\ndes\n, d\nchoses\ne ces tr\nn'en\nois e\ndepend\nducations\nqu'a\ndiff\ncertains\nerentes,\negards.\ncelle de\nC\nla\nelle\nnatur\ndes\ne\nhommes\nne depend point de nous ; celle\nsoyons vraiment les maitres ; encore ne le sommes-‐nous que par\nest\nsupposition\nla seule dont\n; car\nnous\nqu\nenvironnent\nest-‐ce qui peut\nun\nesperer\nenfant ?\nde\n\ndiriger entierement les discours et les actions de tous ceux qui\ni\n\nSitot\nconc\ndonc\nours\nque\nnec\nl'education\nforce\nle\nde soins\ne\nest\nssaire a so\nest\nn s\nun\nucc\nart,\nes ne\nil est\ndepe\npresque\nnd de pe\nimpossible qu'elle reussisse, puisque\nl'atteindre.\nd'approcher plus ou moins du but,\nrsonne\nmais\n. T\nil\nout\nfaut\nce q\ndu\nu'o\nbonheur\nn peut fai\npour\nre a\n\nQue\nconcours\nl est ce\ndes\nbut\ntrois\n? C'\neducat\nest celui\nions\nmeme\nest necessaire\nde la natur\na l\ne\neur\n; cel\nperfect\na vient\nion,\nd'etre\nnous ne pouvons rien qu'il faut diriger les deux autres. Mais peut\nc'est\n-‐etre\n\np\nsur\nrou\ncel\nve.\nle\nPu\na\nisqu\nlaquel\ne\nl\nl\ne\ne\n\na-‐t-‐il un sens trop vague ; il faut tacher ici de le fixer.\nce mot de nature\nLa\nhabitudes qu'on ne contracte que par force, et qui n'etouffent jamais la\nnature, nous dit-‐on, n'est que l'habitude1. Que signifie cela ? N'y a-‐t-‐il\nnatur\npas des\npar exemple, l'habitude des plantes dont on g\ne ? Telle est,\nli\ncela sa direction primitive\nberte garde l'inclinaison q\n;\nu'\net\no\n,\nn l'\nsi l\na f\na p\no\nl\nr\na\nc\nnt\nee a pr\nene la direction verticale. La plante mise en\nendre ; mais la seve n'a point change pour\nle meme etat, on peut garder celles qui resultent de l'habitude, et qui nous sont le moins\nredevient vertical. Il en est de meme des inclinations des hommes. Tant qu'on reste dans\ne continue a vegeter, son prolongement\nnatur\nL'edu\nelles\ncation\n; mais, sitot que la situation change, l'habitude cesse et le naturel revient.\nn'est certainement qu'une habitude.\n\nM. Formey nous assure qu'on\n\nne dit pas precisement cela. Cela me parait pourtant tres precisement dit dans ce\nvers auquel je me proposais de repondre :\n\nLa nature, crois-‐moi, n'est rien que l'habitude.\n\nM. Formey, qui ne veut pas enorgueillir ses semblables, nous donne modestement la mesure de sa\ncervelle pour celle de l'entendement humain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.312 Basic Themes in French Literature and Culture\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Lorsque l’enfant paraît",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-312-basic-themes-in-french-literature-and-culture-spring-2011/2d8bb08a8c5799b02df02acc533bfb4e_MIT21G_312S11_vhugopoem.pdf",
      "content": "Victor Hugo, « Lorsque l'enfant parait »\nLes feuilles d'automne (1831)\n\nLorsque l'enfant parait, le cercle de famille\nApplaudit a grands cris. Son doux regard qui brille\nFait briller tous les yeux,\nEt les plus tristes fronts, les plus souilles peut-‐etre,\nSe derident soudain a voir l'enfant paraitre,\nInnocent et joyeux.\n\nSoit que juin ait verdi mon seuil, ou que novembre\nFasse autour d'un grand feu vacillant dans la chambre\nLes chaises se toucher,\nQuand l'enfant vient, la joie arrive et nous eclaire.\nOn rit, on se recrie, on l'appelle, et sa mere\nTremble a le voir marcher.\n\nQuelquefois nous parlons, en remuant la flamme,\nDe patrie et de Dieu, des poetes, de l'ame\nQui s'eleve en priant;\nL'enfant parait, adieu le ciel et la patrie\nEt les poetes saints! la grave causerie\nS'arrete en souriant.\n\nLa nuit, quand l'homme dort, quand l'esprit reve, a l'heure\nOu l'on entend gemir, comme une voix qui pleure,\nL'onde entre les roseaux,\nSi l'aube tout a coup la-‐bas luit comme un phare,\nSa clarte dans les champs eveille une fanfare\nDe cloches et d'oiseaux.\n\nEnfant, vous etes l'aube et mon ame la plaine\nQui des plus douces fleurs embaume son haleine\nQuand vous la respirez;\nMon ame est la foret dont les sombres ramures\nS'emplissent pour vous seul de suaves murmures\nEt de rayons dores.\n\nCar vos beaux yeux sont pleins de douceurs infinies,\nCar vos petites mains, joyeuses et benies,\nN'ont point mal fait encor;\nJamais vos jeunes pas n'ont touche notre fange,\nTete sacree! enfant aux cheveux blonds! bel ange\nA l'aureole d'or!\n\nVous etes parmi nous la colombe de l'arche.\nVos pieds tendres et purs n'ont point l'age ou l'on marche,\nVos ailes sont d'azur.\nSans le comprendre encor vous regardez le monde.\nDouble virginite! corps ou rien n'est immonde,\nAme ou rien n'est impur!\n\nIl est si beau, l'enfant, avec son doux sourire,\nSa douce bonne foi, sa voix qui veut tout dire,\nSes pleurs vite apaises,\nLaissant errer sa vue etonnee et ravie,\nOffrant de toutes parts sa jeune ame a la vie\nEt sa bouche aux baisers!\n\nSeigneur! preservez-‐moi, preservez ceux que j'aime,\nFreres, parents, amis, et mes ennemis meme\nDans le mal triomphants,\nDe jamais voir, Seigneur, l'ete sans fleurs vermeilles,\nLa cage sans oiseaux, la ruche sans abeilles,\nLa maison sans enfants!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.312 Basic Themes in French Literature and Culture\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}