{
  "course_name": "Biological Engineering II: Instrumentation and Measurement",
  "course_description": "This course covers sensing and measurement for quantitative molecular/cell/tissue analysis, in terms of genetic, biochemical, and biophysical properties. Methods include light and fluorescence microscopies; electro-mechanical probes such as atomic force microscopy, laser and magnetic traps, and MEMS devices; and the application of statistics, probability and noise analysis to experimental data. Enrollment preference is given to juniors and seniors.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Electrical Engineering",
    "Electronics",
    "Signal Processing",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Engineering",
    "Biological Engineering",
    "Electrical Engineering",
    "Electronics",
    "Signal Processing",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nLabwork: Self-scheduled sessions, 6 to 8 hours / week expected\n\nCourse Overview\n\n20.309 is an intensive laboratory that teaches the principles and practices of making quantitative measurements using advanced instrumentation. The field of Biological Engineering employs a broad set of measurement techniques and instruments, and students studying the discipline must develop a strong understanding to use them effectively. Students must know not only how to use these tools, but should learn their underlying physical principles, and how they are designed. The approach of 20.309 is highly hands-on and we believe students learn best by building and doing the experiments in the lab. Lectures provide the broader underpinnings in measurement principles that support the experiments. Topics include light and fluorescence microscopies, electro-mechanical probes, application of statistics, probability, and noise analysis to experimental data, and Fourier techniques.\n\nThe course content is organized into modules, each focused on a major piece of apparatus or a group of experiments. In Fall 2006, the four main modules are:\n\nElectronics for measuring DNA melting curves\n\nMicromechanics and the atomic force microscope\n\nFluorescence optical microscopy\n\nOptical trapping\n\nWe emphasize design and building - several of the setups, such as the DNA melting experiment and optical microscope are build by students from scratch. Going beyond simply using the instruments provides students with the confidence to \"turn the knobs\" on these systems to make the types of measurements that modern research requires.\n\nPrerequisites\n\n18.03\n\nAssignments\n\nHomework\n\nStudents must complete several homework assignments. These will include questions related to lecture material, lab modules, and selected journal articles.\n\nOral Presentations\n\nFive class sessions are devoted to student oral presentations. Each student will each give a 12 minute presentation on a lab module or a journal article of their choice.\n\nQuizzes\n\nQuizzes will be given during lab sessions, and are intended to help you prepare for the experiment you are performing. The questions will be straightforward and should take about 5 minutes before you begin working on each lab.\n\nLabs\n\n20.309 is an \"open format\" lab. Generally, students should aim to sign up for 6-8 hours of lab time per week, which should be enough to accomplish the week's goals. Students are responsible for scheduling their own hours. Instructors and TAs will always be present in the lab, but will only be available to answer questions and help you work on your experiments during scheduled hours. (However, if an emergency arises or an injury occurs, get an instructor's attention immediately).\n\nFour written reports on the labs will comprise 50% of the course grade. You will be working in pairs throughout the semester, but you will be submitting individual lab reports.\n\nLab attendance is mandatory and there are no make-up labs. A family crisis or severe illness requiring attention from the infirmary and prohibiting you from all your coursework are acceptable reasons for missing lab. In these exceptional circumstances, every effort will be made to accommodate you.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten reports for lab modules\n\n50%\n\nOral presentation\n\n15%\n\nHomework assignments\n\n15%\n\nLab quizzes\n\n10%\n\nOral participation during lectures, student presentations and laboratory modules\n\n10%\n\nCourse Calendar\n\nWEEK #\n\nLEC #\n\nLECTURE TOPICS\n\nLAB TOPICS\n\nKEY DATES\n\nPart I: Electronics (Instructor - Scott Manalis)\n\nCourse overview, procedures, syllabus, scheduling\n\nLab orientation and tour, safety, introduction to electronics\n\n1-2\n\nElectronics for DNA analysis; dividers, Thevenin's theorem, impedance and loading, RC circuits\n\nRC circuits: transfer functions, Laplace transforms, impedance, RC filters\n\nLab orientation and tour, safety, introduction to electronics (cont.)\n\nModule 0: introduction to electronics\n\n3-4\n\nFeedback: Black's formula, the loop; Op-amps: \"Golden Rules\" and circuit examples\n\nDNA analysis: SNP detection, chemical equilibrium - K and DeltaG; description of DNA melting lab apparatus\n\nModule 1: measuring DNA melting curves\n\nPart I: build optics for DNA melting experiment, build photodiode readout circuit; calibrate fluorescence signal\n\nHomework 1 due in Lec #4\n\n5-6\n\nFourier series, integrals, Fourier transform (continuous/discrete)\n\nFourier analysis (cont.)\n\nEvening session: student presentations 1\n\nModule 1: measuring DNA melting curves (cont.)\n\nPart II: complete DNA melting curves apparatus; test perfect-match, all-mismatch, and single-base mismatch DNA strands\n\nStudent presentations 1 due\n\nPart II: Mechanics (Instructor - Scott Manalis)\n\n7-8\n\nScanning probe microscopy\n\nSignals, noise, power spectral density\n\nModule 2: atomic force microscope\n\nPart I: AFM alignment and calibration, AFM imaging I\n\nLab report 1 due one day after Lec #8\n\nCorrelation/convolution, lock-in amplification, linear systems\n\nModule 2: atomic force microscope (cont.)\n\nPart II: AFM imaging II; force spectroscopy\n\nHomework 2 due one day before Lec #9\n\n10-11\n\nEquipartition theorem and thermal fluctuations\n\nStudent presentations 2\n\nModule 2: atomic force microscope (cont.)\n\nPart III: thermal fluctuations of microcantilevers: Boltzmann's constant experiment\n\nStudents presentations 2 due\n\nPart III: Optics (Instructor - Peter So)\n\n12-13\n\nImage processing I\n\nImage processing II\n\nImage processing with MATLAB(r) (linked to homework 3)\n\n14-15\n\nPhysical optics and optical instrumentation: detectors, noise\n\nOptical instrumentation: sources, lasers\n\nOptoelectronics: PMT and photon counting (linked to homework 3.5)\n\nLab report 2 due one day before Lec #14\n\nHomework 3 due one day after Lec #15\n\n16-17\n\nIntroduction to microscopy: geometric optics, lenses, ray tracing\n\nInterference and diffraction, resolution in microscopy, Fourier optics\n\nModule 3: fluorescence microscope construction\n\nPart I: White light imaging and Fourier optics\n\nHomework 3.5 due in Lec #16\n\n18-19\n\nFluorescence microscopy\n\nActive microrheology\n\nEvening session: student presentations 3\n\nModule 3: fluorescence microscope construction (cont.)\n\nPart II: live-cell imaging and microrheology\n\nStudents presentations 3 due\n\nPassive microrheology and particle tracking\n\nModule 3: fluorescence microscope construction (cont.)\n\nPart III: actin cytoskeleton imaging\n\n21-22\n\nOptical trapping [Instructor: Prof. Matt Lang]\n\nAdvanced fluorescence microscopy\n\nEvening session: student presentations 4\n\nModule 3: fluorescence microscope construction (cont.) and experiments\n\nModule 4: optical trapping\n\nStudent presentations 4 due\n\n23-24\n\n3D microscopy: confocal imaging\n\n3D microscopy: two-photon microscopy, 3D image processing\n\nModule 4: optical trapping (cont.)\n\n3D imaging and visualization: two-photon microscopy\n\nLab report 3 due one day before Lec #23\n\nStudent presentations 5\n\n3D image-stack visualization, imageJ\n\nLab report 4 due one day before Lec #25\n\nStudent presentations 5 due",
  "files": [
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/c7a7db261a20f61efabd92dff6af4ee3_hw1.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nHomework Set 1\nDue by 12:00 noon on Friday, Sep. 22, 2006 in 16-352.\n1. Figure 1 shows a resistor network known as a Wheatstone Bridge, which will be part of\napparatus that you'll build shortly for the DNA melting curves module. You can read a bit\nmore about it in the handout for that module. For now, we will look at it analytically. Rx is\na resistance you are trying to measure, and R3 is a variable resistor.\nFigure 1: A Wheatstone bridge circuit.\n(a) Assuming R3 is set such that the bridge is balanced (i.e. Vab = 0), derive an analytical\nexpression for Rx in terms of R1, R2 and R3.\n(b) Now let R3 also be a fixed value, and suppose that Rx varies in a way that makes Vab\nnonzero. Derive an expression for the dependence of Vab on Rx\n2. Referring again to the Wheatstone Bridge in Figure 1, suppose that Rx varies with some\nphysical parameter (strain, temperature, etc.) in the range of 1-10kΩ. You want to use the\ncircuit to measure the physical variable by observing Vab and correlating it to the resistance\nchanges. In what range should the values of R1, R2 and R3 be to make a sensitive measure\nment? Explain your reasoning. (Hint: using matlab to plot the output as a function of the\nvarying resistances is a very useful way to think about this problem).\n3. Photodiode i-v characteristics: Using the data that you collected in the lab for the photo\ndiode, generate 3-4 i-v curves for a photodiode at different light levels (including in darkness).\nPlot these on the same graph to see how incident light affects diode i-v characteristics.\nGive a brief (qualitative) explanation for why photodiodes are best used in reverse bias?\n4. Transfer functions: For the \"black boxes\" that you measured in the lab, determine what\nkind of circuit/filter each one is (two of them will look similar, but have an important difference\n- what is it?). Determine a transfer function that can model the circuit, and fit the model to\nthe data to see whether the model makes sense.\nOf the four boxes, \"D\" is required, and you should choose one of either \"A\" or \"C\". You can\nfit \"B\" for bonus credit.\n(over)\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n5. Referring to the circuit shown in Figure 2, what value of RL (in terms of R1 and R2) will\nresult in the maximum power being dissipated in the load?\n(Hint: this is much easier to do if you first remove the load, and calculate the equivalent\nThevenin output resistance RT of the divider looking into the node labeled Vout. Then\nexpress RL for maximal power transfer in terms of RT .)\nFigure 2: A voltage divider formed by R1 and R2 driving a resistive load RL.\n6. Consider the op-amp circuit shown in Fig. 3.\nFigure 3:\n(a) Determine an expression for the output voltage of the circuit with respect to a DC\ncurrent input. Express your answer in Vout/Iin.\n(b) Since this is such a high-gain circuit, it can be quite noisy, if the input current Iin\nexperiences high-frequency fluctuations. You can insert a capacitor across one of the\nresistors to reduce the noise (i.e. make a low-pass filter to eliminate high-frequency\ncontent). Where would you insert it, and how would you choose its size?\n(c) Now write down the expression for this new circuit's output with respect to the current\ninput for AC signals (Hint: in the expression from part (a), substitute the parallel\ncombination Rx k C for the resistor Rx that you chose)."
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/7ea06f60372381b56301fa11c890f9c5_hw2.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nHomework Set 2\nDue by 12:00 noon on Wednesday, Oct. 11, 2006\nHere we will look at power spectra in matlab, and some issues associated with discrete-time\nFourier analysis. You should save your matlab code in an m-file, which will make it easy to modify\nand reuse it, and submit your m-file along with your plots.\nRemember, when in doubt about any of the matlab commands given below, use the help\ncommand to get info about how to use each one - the Windows installation of matlab will have\nthis same info and more accessible via the Help menu.\n1. Use matlab to generate a time vector y(t), approximately one second long, with a sampling\nfrequency fsamp of a few kHz (the syntax \"vector=start value:increment:end value;\"\nwill be useful here -- increment is the time between your samples or 1/fsamp).\nThen create a sinusoid based on that time vector -- choose a frequency fSIN of a few hundred\nHz:\ny = sin(ωSIN t) = sin(2πfSIN t)\nCalculate the PSD of your sinusoid using the pwelch 1 command, and plot it on a linear\nscale and a logarithmic scale; use the plot and loglog commands, respectively. What is the\nsignificance of the highest and lowest frequencies that appear on the plot?\n2. An important feature of pwelch is that it always correctly normalizes the total power of the\nPSD, but--depending on the parameters you use--you can get quite different PSD shapes\nfor the same signal. For example, the default parameters give a lot of spectral leakage. To see\na low-leakage spectrum, try running pwelch with the nfft and window parameters satisfying\nthe following conditions:\n- the sinusoid frequency fSIN is an integer multiple of the quantity fsamp/Nfft\n- window is the same length as nfft.\nCan you suggest what causes spectral leakage? Plot the low-leakage PSD on the same axes\nas your previous linear and log plots (use hold after plotting one waveform to freeze a figure,\nbefore plotting a second). Considering the relative magnitudes, how much does the leakage\nmatter?\n3. Recall that one of the consequences of Parseval's theorem is the following relationship between\na time-domain signal f(x) and its PSD F (ω):\nD\nf(x)2E\n=\nZ inf\nF (ω)dω.\nVerify that this is the case for the sine wave you've been using by computing its mean-square\nvalue in the time domain, and the integral of its PSD in the frequency domain (matlab's\nvar and sum functions will be useful here). Remember that you're effectively calculating an\narea, and make sure that units match up: pwelch gives you the PSD in units2/Hz, while the\nintegral of your PSD needs to be equal to a mean-square value (units2).\nThe syntax is [PSDvect, freqvect]=pwelch(signal,window,n overlap,nfft,f samp) and only requires you to\nsupply a signal vector and a number for f samp to properly scale and calculate the frequencies for the PSD - i.e.\npwelch(signal,[ ],[ ],[ ],fsamp) will get you a result. The result is stored in the two vectors before the = sign.\nUse matlab's help to find out what the other parameters do. For parameters that you leave out by entering \"[ ]\",\nmatlab uses its defaults (also found in help).\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n4. Now use the randn command to generate a noise signal with the same length as your time\nvector. Calculate its PSD with the pwelch parameters of your choice, and plot it on a new\nlog plot. To observe the benefits of averaging, generate a noise signal that is 10× longer in\nduration, calculate its PSD, using the same pwelch parameters, and plot its spectral density\non the same plot.\n5. Take the sinusoid from part (a), but with its amplitude reduced tenfold, and the first (short\nduration) noise signal from part (d), and add them together. Look at a section of the summed\nwaveform in the time domain - can you find the sine wave at all? Now plot the PSD of the\ncombined signal - can you find the sine wave peak in the noise? What can you do to get it to\nresolve more clearly? (Part (d) should provide a clue.) Plot your result on the same axes.\n6. (BONUS) Finally, take the original sinusoid from (a), compute its Discrete Fourier Trans\nform using the fft command, and plot its magnitude (an FFT is complex-valued) on a\nsemi-log plot (see the semilogy command). Compare this to the PSD of the sine wave given\nby pwelch, and comment on the FFT's features: Why two peaks? What is the meaning of\nits x-axis values? Why are the values along the y-axis so large?"
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/f280ad79c125635fc69ef50db2df3333_hw3.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nHomework Set 3\nDue by 12:00 noon on Friday, Nov. 3, 2006\n\nThis is a hybrid lab/homework set. It will count as a homework, and be graded accordingly,\nbut most of the work should be done in the lab. Feel free to work outside the lab, if you have\naccess to matlab with the image processing toolbox. However, you will find it useful to get help\nand advice from instructors. Definitely don't put off working on this until the night before\n- you will not be able to finish.\nObjectives\n1. Learn to use matlab to manipulate image files in a variety of formats, sizes, and resolutions.\n2. Explore several different image processing techniques, and learn to improve images with them.\n3. Extract quantitative data from images.\n4. Prepare some analysis/processing algorithms for future experimental modules.\nImage Files\nAll the image files you will use in this lab can be found on the lab PCs in the C:\\BioInst\\imgproc\ndirectory. They are of different sizes, file formats, and aspect ratios. Here we will only work with\ngrayscale files (one channel of intensity data), but the techniques generalize for working with color\n(three or four channels).\nGuidelines and Hints for Image Processing in MATLAB\nAs usual in matlab, your best resource is its Help function. Specifically for this lab, you'll want to\nstart by opening Matlab Help (Help\nMatlab Help), and browsing through the Image Processing\nToolbox help files.\n→\n3.1\nImage Input/Output and Manipulation\nBelow are a some commands for opening, displaying, and writing image files, for which Help will\nprovide the details. Pay attention to the numerical data type of these images when matlab imports\nthem (the \"workspace\" window will be key here) - you may need to inter-convert between types.\nimread is used to load image data from a file. The basic syntax is A = imread('filename'), with\nthe image data from the file ending up stored in matrix A.\nimshow displays the data of an image file in a matlab figure window. You can do it either without\nloading it into the matlab workspace, or when it's present in the workspace and assigned to\na variable.\nimwrite writes image data to a file, in a format that you specify. The basic syntax is\nimwrite(A,'filename').\naviinfo returns the header information about a movie file in .avi format\naviread('filename', 1) reads one frame of the avifile into a Matlab movie structure. If f is\nthe movie structure, you can assign the image data of that frame to a matrix A using the\ncommand A = f.cdata.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.2\nOther Useful Commands\nThe details of how these work will be important for you to explore on your own, with the help of\nmatlaband the instructors. Be aware that the list below is by no means exhaustive or exclusive -\nyou may not use every command on the list, and you should explore other commands you find to\nbe relevant that may not be listed here.\nfft, fftshift, imhist, histeq, imadjust, conv, conv2\nImage Processing Problems\n1. Optimize the contrast for visualization of the microscope image on the left below, (dark actin.jpg)\ntaken at too low a light level.\n2. Create a 3×3 and a 5×5 low pass filter. Apply these filters to remove noise from the cell\nimage on the right above (noisy actin.tif). Can you make a 7×7 filter also?\n3. Generating a long integration image using a CCD camera sometimes produces large intensity\nspikes due to cosmic rays. Try to remove the noise from the image spiky actin1.tif. Can\nyou develop a different method to remove the spikes if you have two pictures taken one after\nthe other (spiky actin1.tif, spiky actin2.tif)?\n4. Perform a segmentation to isolate the region corresponding to the actin stress fibers in the\nimage actin f.tif. Also perform a segmentation to isolate the region corresponding to\nclustered actin in a cell with a chemically disrupted cytoskeleton actin treated.tif. The\noutput of both tasks should be binary images corresponding to the desired regions.\n(BONUS: can you devise a quantitative metric to quantify the degree of fiber-ness of the\ncytoskeleton?)\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n5. You have two images of a \"test pattern\" consisting of light and dark line pairs with a spacing\nof 18 line-pairs per millimeter (HiMag.bmp and LowMag.bmp). This test pattern was imaged\nwith a home-built microscope at two different magnifications. Calculate the magnification\ndifference between these two images.\n6. Periodic noise often occurs in biological imaging -- high noise.tif (below, left) & low noise.tif\n(below, center). Can you remove the noise if you know the (normalized) noise characteristics\n(noise.tif - below, right)?\nConsider a case in which you do not know the noise characteristics. Can you clean up the\nimage below (ecoli noisy.jpg)? (For bonus credit, feel free to work on any AFM images of\nyour own that you'd like to similarly clean up.)\n7. You are given a movie file (beadtest.avi) of a fluorescent bead in the cytoskeleton of the\ncell. Choose any bead in the image. Can you find the centroid of the bead as a function of\nframe number?\nNote: If you are having trouble opening the bead movies on your home computer and need a\ncodec, it can be downloaded from the LEAD Multimedia Website (http://www.leadcodecs.com/\nDownload/eval.htm). Select the \"LEAD MCMP/MJPEG Video Codec\" on the left column and\ninstall with the evaluation version."
    },
    {
      "category": "Resource",
      "title": "hw3part2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/5e769d7778dabf797e7251786a5123ca_hw3part2.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nHomework Set 3.5\nSensitive optoelectronic detectors: seeing single photons\nDue by 12:00 noon (in class) on Tuesday, Nov. 7, 2006.\nThis is another hybrid lab/homework; please see Section 3.4 for what you need to turn in.\nContents\n1 Objectives\n2 Background\n2.1 Photomultiplier Tube (PMT) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2 Noise Sources . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2.1\nPhoton Shot Noise . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2.2\nElectron Shot Noise . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2.3\nJohnson Noise . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3 Experimental Procedures\n3.1 Hardware set-up . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2 Software . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3 Experiment Roadmap . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.4 Data Analysis and \"Deliverables\" . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nObjectives\n1. Understand the principles of operation of photomultiplier tubes (PMTs).\n2. Build signal conditioning electronics to capture and detect the optical signal generated by a\nphotomultiplier tube.\n3. Observe single-photon events with the detector.\n4. Understand some of the noise characteristics of the PMT-circuit system as affected by light\nlevel and gain.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nBackground\n2.1\nPhotomultiplier Tube (PMT)\nFor low light-level detection and measurement,\nyou can't beat the photomultiplier. This clever\ndevice allows a photon to eject an electron\nfrom a light-sensitive alkali metal photocath\node. The photomultiplier then amplifies this\nfeeble photocurrent by using a high voltage to\naccelerate the electron onto successive surfaces\n(dynodes), from which a cascade of additional\nelectrons is easily generated (Figure 1).\nThis use of \"electron multiplication\" yields\nextremely low-noise amplification of the initial\nphotocurrent signal. The final current is col\nlected by the anode, usually run near ground\npotential.\nFigure 1: Principle of PMT operation: a high neg\native voltage applied to the photocathode acceler-\nA PMT is a linear device in the sense\nthat the current output is proportional to the ates electrons down the dynode chain.\nlight power incident on the photocathode. The\nPMT we use in this lab is a Hamamatsu R7400P, which has a photocathode sensitivity of 60 mA/W\n(recall that a photon's energy depends on its wavelength - our LED's light is approx. 565nm). The\ngain of the dynode chain depends on the applied accelerating voltage. The overall anode sensitivity\nis the product of the photocathode sensitivity and dynode chain gain (Table 1 provides a summary,\nand the PMT data sheet has more detail).\nPMT voltage (V)\ndynode chain gain\ntotal sensitivity (A/W)\n-500\n3 × 104\n1.8 × 104\n-800\n6 × 104\nTable 1: PMT gains at two operating voltages.\nDue to its high sensitivity, a PMT can be used to observe individual photoelectron events. At\nlow light levels, this is typically done by following the PMT with charge-integrating pulse amplifiers,\ndiscriminators and counters. In this lab, we will simply observe them visually on an oscilloscope.\nAt higher light levels, the individual photoelectron current becomes too high, so you measure\nthe anode current as an analog quantity instead.\nNote: A powered PMT should never be exposed to ordinary light levels. A PMT\nthat has seen the light of day, even without power applied, may require 24 hours or\nmore to \"cool down\" to normal dark-current levels. More on this later.\nWhen compared to photodiodes, PMT's have the advantage of high quantum efficiency while\noperating at high speed. This makes the PMT particularly well-suited to biological imaging appli\ncations where small numbers of fluorescent molecules are observed on very short time scales. The\nmain disadvantages of the PMT are its large size and need for a stable high-voltage source.\nPhotomu\nltip\nler t\nube (PM\nT): pho\ntons strike photocathode at one end; a sequence of dynodes lead toward an anode at the other end.\nFigure by M IT OCW.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n2.2\nNoise Sources\n2.2.1\nPhoton Shot Noise\nAn electric current is the movement of discrete electric charges, not a smooth fluid-like flow. Like\nwise, incoming light energy is quantized into the packets we know as photons. The \"finite-ness\"\nof the quantized photons and electronic charges results in statistical fluctuations of the resulting\ncurrent. This is referred to as photon shot noise. If the charges act independently of each other,\nthey follow Poisson statistics, and the current fluctuations are given by\nIES =\np\n2qIdcB ,\n(1)\nwhere q is the electron charge, and Idc is the steady-state RMS current, and B is the measurement\nbandwidth in Hz. The assumption of independence of individual electron movement is true for\nelectrons crossing a barrier such as electrons excited by single photons at the cathode of a PMT\n(An important exception is in metallic conductors, where there are long-range correlations between\ncharge carriers).\n2.2.2\nElectron Shot Noise\nIn the absence of light, due to thermal excitation, electrons are occasionally generated at the cathode\nor one of the dynodes. These electrons will be accelerated through the circuitry and generate a\ncurrent pulse similar to the effect of an incoming photon. However, because many of these don't\npropagate down the entire dynode chain, the current pulse from the \"dark\" electrons tends to be\nlower in amplitude. This current is typically in the neighborhood of 30 counts per second per square\ncentimeter of cathode area.\nThe current generated in the photomultiplier tube in the absence of light is called the dark\ncurrent. As a noise source, it is the fluctuation amplitude of the dark current and not its DC value\nthat presents a problem. Similar to photon shot noise, the electrons generated spontaneously in\nthe photomultiplier tube also follow Poisson statistics and the RMS noise is given by Equation 1\nwhere Idc is the steady-state RMS dark current.\n2.2.3\nJohnson Noise\nAny resistor just sitting on the table generates a noise voltage across its terminals, which arises\nfrom the random thermal motion of electrons within it. This is known as Johnson noise, and has a\nflat power spectrum - having equal power density at all frequencies (you've also heard it described\nas \"white noise\"). The actual open-circuit noise voltage generated by a resistance R at absolute\ntemperature T is given by\nVJ =\np\n4kBTRB ,\n(2)\nwhere kB is Boltzmann's constant. Note that VJ is the RMS magnitude of the noise signal we\nmeasure; the actual signal fluctuates in time with a Gaussian probability distribution.\nThe significance of Johnson noise is that it sets a lower limit on the noise voltage in simple\nresistive circuits. The resistive part of a source impedance generates Johnson noise, as do the bias\nand load resistors of an amplifier.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nExperimental Procedures\n3.1\nHardware set-up\nThe apparatus for this lab consists of an enclosed tube containing an ordinary diffuse green LED\npointed at a PMT as shown schematically in Figure 2.\nFigure 2: Experimental setup.\nThe PMT end of the tube has two connectors, labeled \"HVin\" and \"Iout\" which are the high-\nvoltage input from the power supply and the output anode photocurrent, respectively. This pho\ntocurrent will be amplified using a by-now-familiar transimpedance amplifier, which you can build\nas shown in Figure 3. Use an LF411 op-amp, and ±15 V supplies, as usual. Choose Rf and Cf\nvalues to give a DC gain of Vout/iin = 2 × 106 V/A and a time constant of 200 μs.\nFigure 3: Transimpedance amplifier circuit.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.2\nSoftware\nThe LED light source is driven from the computer DAQ system. (Why does this work for this\nexperiment, but would not work for e.g. the blue LEDs in the DNA melting experiment and we\nneeded a separate power supply?)\nThe output of the transimpedance amp is read by LabVIEW and observed on the screen shown\nin Figure 4. You should also connect this same signal to an oscilloscope for easier direct observation.\nThe LabVIEW panel is very simple. You can set the data sampling rate and number of data\npoints to acquire, the data input and output channels (easiest to leave at the default value of 0),\nand the input limits. A word about these limits: they determine the digital that LabVIEW can\nsee, and therefore the minimum signal level that you'll be able to read. Experiment with changing\nthese to achieve better resolution at low signal levels.\nFinally, the slider bar at the bottom, and the corresponding entry box to its left set the voltage\nbeing applied to the LED.\nWhat you'll want to record are the \"Signal Mean\" and \"Standard Deviation\" values that Lab-\nView calculates from the signal waveform. These represent the photocurrent from the PMT and\nits noise, and this is what we'll study a bit more quantitatively.\nScreenshot from LabVIEW software removed\ndue to copyright restrictions.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.3\nExperiment Roadmap\n1. With the PMT HVPS at -800 V, and no LED drive voltage applied, observe the output of\nyour amp circuit on the oscilloscope. Predict the character and magnitude of the amplifier\noutput signal for the following:\n(a) A single photon hitting the PMT\n(b) The PMT dark current\n(c) Pure Johnson noise\nWhich of these can you see on your scope? Discuss with\n2. Now observe the mean amplifier output signal and standard deviation as you increase the\ndrive voltage on the LED. Remember that LEDs have a characteristic \"turn-on\" voltage, at\nwhich slight changes in voltage produce large increases in current, and light output. You'll\nsee this effect beginning at about 1.5 V.\n3. Record the mean and standard deviation values for various input voltages (in particular\naround the \"turn-on\" transition of the LED).\n4. Change the HVPS to -500V and repeat the observations in items 1. and 2. above.\n5. Reduce the amplifier gain to 1.5 × 106 V/A while maintaining the same time constant and\nkeeping the PMT supply voltage at -500V. Similarly to item 3. above, collect mean and\nstandard deviation data.\n3.4\nData Analysis and \"Deliverables\"\nThe key step here is to convert the signals you recorded (in volts), into units of \"photons per\ntime constant.\" You can do this by tracing out the various signal-conversion steps that take place\n(photocathode, dynode chain, transimpedance amp) and noting the gain or amplification factor for\neach. Keeping track of the physical units via dimensional analysis is very useful here.\nOnce you have performed the conversion, the following two plots and associated explanation are\nall you'll need to turn in:\n1. Plot the noise level (in units of photons per time constant) versus the signal level (same units)\non a log-log scale for both the -500 V and -800 V supply voltages.\nCompare the situations at -800 V and -500 V and briefly discuss in a few sentences:\n(a) Explain the shape and slope of each curve, and what it tells you about the origin of the\nnoise observed? Can you see the noise floor for the measurements? If so, what is the\nsource of the noise? (Johnson noise? shot noise?)\n(b) How does the noise characteristic change between -800 V and -500 V? What types of\nnoise are observed in each case?\n2. Finally, if you've been paying attention, you'll notice that something is not quite right about\nthe two noise plots relative to each other at -500 and -800 V (what is it?). This is because\nthe PMTs have actually seen too much bright light, and are no longer able to reach their\ndesign-specified gain at -800 V. Using these plots (assuming the -500 V gain is correct), try\nto determine what the actual dynode gain is at -800 V."
    },
    {
      "category": "Resource",
      "title": "convclar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/084d33c861a762bcfcbd602bbce40070_convclar.pdf",
      "content": "g\nh\n\ng*h\n\nEx #1:\n[...,1,...]\nEx #2:\n[...,1,-1,...]\nEx #3:\n[...,-1,2,-1,...]"
    },
    {
      "category": "Resource",
      "title": "lab_guidelines.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/56044f5c9893c00edd00d17d4113c7ef_lab_guidelines.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n20.309 Lab Guidelines\nWelcome to 20.309 Lab! We're excited to have you join us, and all the teaching staff are very\nmuch looking forward to a new semester. Much about 20.309 is new this year, so it's likely that\nwe haven't thought of everything. When something does not make sense, ask!\nSafety\nIn any laboratory, there is potential for injury if certain common-sense practices are not followed.\nIn 20.309 this is minimal, but it's still important to follow a few basic rules.\n1.1\nElectrical Safety\nElectrical injuries happen when large amounts of electrical power are dissipated by the body. Most\noften, this happens in high-current situations, which is why you always hear that \"it's not the\nvoltage, it's the current that is dangerous.\" Strictly speaking, both are dangerous, and it's a good\nidea to avoid becoming a current path.\nIn 20.309, we will work with only low-power electronics, and nothing we do is likely to cause\ninjury. However, some common-sense precautions, are in order:\n- don't connect supply voltages directly to ground\n- don't touch any current-carrying conductor with your bare hands\nThese simple rules will keep you from injuring yourself and damaging circuit components. Some\ncomponents will have maximum power ratings that should not be exceeded, so pay attention to\nthese values.\n1.2\nLaser Safety\nWe will use three laser systems in this lab that are considered Class III and therefore require\nvigilance and caution during use. You will receive an introduction to laser safety at the beginning\nof the lab, and a reminder about proper safety procedures before each of the relevant lab modules.\nThe three laser types are:\n1. 2mW red laser diode with λ=635nm (AFM)\nThis is a Class IIIa laser, and will only damage your eye if you spend prolonged periods of\ntime (many hours) staring at the beam. We do not require safety eyewear. The beam will be\nwell-contained in the apparatus.\n2. 5mW green laser pointer with λ=532nm (fluorescence microscope)\nThis Class IIIb laser is the most dangerous type we will use, because the beam is uncon\nstrained, and you can aim the pointer anywhere while you are building your fluorescence\nscope. The beam is strong enough to injure your sight, particularly because the human eye\nis most sensitive to green light. Safety eyewear will be provided to you, and you are\nrequired to wear it at all times, while you or anyone else in the lab is building\ntheir fluorescence scope. In addition, whenever working with these lasers, you must turn\non the blinking laser safety sign near the door, to warn others that laser work is going on.\n\n3. 175mW NIR diode lasers with λ=975nm (optical traps)\nThe hazards of this Class IIIb laser come from its higher power level, and because it is\ninvisible, making it harder to be aware of its location/direction. The beam will be largely\nconstrained in the apparatus, and you will not need to make adjustments that might put you\nin the beam path. Safety goggles will be available, but not required. Please also switch on\nthe blinking door sign.\nIn general, other important things to keep in mind:\nAlways know the path of the beam, and keep any body parts or reflective items (rings,\n-\nwatches, etc.) out of the beam path.\nAlways read the pre-labs and know what special precautions you need to take associated with\n-\nlasers or optics.\nWhen in doubt about doing something, don't do it before checking with the lab instructor.\n-\nYou will sometimes view scattered light from the AFM laser through a stereo-microscope\n-\nthis is safe as long as the duration is less than eight hours.\n1.3\nChemical Safety & Biosafety\nThough there is minimal wet work in 20.309, please do not bring food or drink into the lab.\nThe electronics will appreciate it, and we will also later be handling some bacteria and fluorescent\ndyes. When needed, latex gloves will be provided, as well as proper containers for disposing of\nchemical/biological waste and sharps. Please make sure to wash your hands with soap and water\nafter removing gloves and before leaving the lab. Please report any spills or injuries to the lab\ninstructor immediately.\n\nLab Notebooks\nTo record the experiments and measurements you carry out, each of you will keep a lab notebook.\n\nA lab notebook is one of the key ways that researchers record, organize, and share the work\nthey do. Lab notebooks in research laboratories are the property of the lab itself, and sometimes\ncan serve as legal documents in intellectual property questions and patent disputes. It's therefore\nimportant that a lab notebook be complete, organized, and clear. While there isn't necessarily one\n\"correct\" way to keep one's lab notebook, it's important to develop good habits from the start, so\nbelow are a few helpful guidelines.\nPermanence - Use pen to keep records in your lab notebook. Any photos, print-out graphs, or\npages that you add should be taped or stapled in so they don't fall out.\nCompleteness - One of the main purposes of keeping a lab notebook is so that you, or another\nresearcher in your field, can repeat your experiments. Record your experimental procedures\nand goals, any special techniques or protocols you develop or use, and conclusions you make\nfrom your data. All data you collect should be recorded directly into the notebook (NOT\ncopied in later from loose bits of paper). Also, write in any calculations you make or key\nequations you use or derive. For data collected with and stored on a computer, it's a good\nidea to make note of file names and experimental conditions.\nFor 20.309, you do not need to repeat in exhaustive detail the descriptions of lab procedures\nfrom the handouts. Paragraphs of description and complete sentences aren't required. Record\nenough key details and information such that another 20.309 student or instructor can un\nderstand what you did. Remember, you're keeping a record for yourself and peer researchers.\nClarity and Organization - Always record the date (and time, if necessary) of experiments on\nevery page, clearly label any plots, charts, or data tables you make. Sometimes, you'll need\nto think ahead to the data you need to collect, so you can write it down neatly and clearly\n(e.g. creating a data table ahead of time that you will fill in during lab).\n\nLab Report Guidelines\nA report will be due at the end of each lab module. Each module will list certain requirements for\nits write-up, and give an appropriate page estimate for how long it should be. In addition to this,\nyour report should:\n- summarize the question(s) you aimed to answer or measurement(s) you made\n- summarize what experiments you performed to that end\n- detail the collected data and the experimental results\n- explain how you interpreted your results, what conclusions you drew and why\nA few other things to keep in mind about lab reports:\nDO:\n1. Follow the Report Requirements section at the end of each lab module.\n2. Describe any procedures you followed that were different from what's suggested in the pre-lab\nhandout.\n3. Present data concisely and clearly: a series of curves all being compared to each other should\nall appear on the same graph. A caption or explanation of the graph should make evident\nthe meaning of what's plotted.\n4. Use the passive voice -- i.e. it is typical to write \"the measurement was repeated three times,\"\nrather than \"I repeated the measurement three times.\" This is a style somewhat unique to\nscientific writing, and likely to run counter to other types of writing you've been asked to do.\nDON'T:\n1. ... rehash all the details of the lab procedures if you followed them exactly as described in\nyour pre-lab handout. A short summary is sufficient.\n2. ... strive for sheer volume of data. If you're including pages of nearly-identical plots, with little\ndiscussion of what they mean, something is wrong. A single figure that's well-thought-out is\nworth a dozen that aren't.\n3.1\nAuthorship and Collaboration\nIn 20.309, you will usually work with a partner in the lab. However, every student is responsible\nfor writing and submitting his or her own individual lab report. You should always acknowledge\nthe partner with whom you worked. On occasion, you may need to use data collected by someone\nelse, in which case you must acknowledge that you were not the one to collect it.\n3.2\nGraphs, Figures and Tables\nAlways label the axes of all graphs or the columns of all tables with what data it is that's being\npresented, and its units. What you show in a plot isn't always self-evident, even if you followed a\nprocedure suggested in the pre-lab handout. Sometimes, simply making sure you specify the units\nfor something will help you understand the data better."
    },
    {
      "category": "Resource",
      "title": "matlabintro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/b5668108f2e65c595e6f8870124632a8_matlabintro.pdf",
      "content": "BE.309: Instrumentation and Measurement Laboratory\nFall 2005\nMATLAB Fundamentals\nmatlab is an abbreviation of Matrix Laboratory, which is a mathematics software package\noptimized for working with vectors and matrices. It is a powerful tool for data analysis and\nplotting, and much more. It is available on all our lab's PCs, and is very worthwhile to learn, since\nit can be applied to a tremendously broad range of scientific applications. We'll start by learning\nto manipulate matlab vectors and create plots.\nMATLAB Help\nAlmost the most important and useful thing in matlab is its \"help\" feature. To learn about the\ndetails of using any command whose name you know, type:\nhelp 'commandname';\nAt the end of the help information, you'll also get a very useful list of related commands. If\nyou don't know the command name, and need to try finding it out using a related keyword, use\nlookfor 'keyword' -all;\nIf you're using a Windows-based implementation of matlab , you can also access the same in\nformation via the Help menu.\nVectors and Matrices\nTry the following commands and observe the results:\n> a = 1:10\n> b = 0:0.4:1.5\n> c = [2 5 8 2 ; 2 5 0 0 ; 3 4 2 1]\n> d = a'*b;\n> e = ones(100,1);\nNote the difference between placing a semicolon at the end of a command, and leaving it out --\nin the first case output is suppressed, which is crucial for working with large matrices. Other useful\ncommands to try are linspace and logspace.\nExample: Generate a sine function with an amplitude of 1.5 and a frequency of 5kHz, and\nlasting 0.1sec. You'll first need a vector representation of time. This should be closely-spaced\nenough to have at least 10 points per cycle of the sinusoid.\nPay attention to operations defined both as matrix operations and element-by-element. To\nspecify an element-wise operation, put a dot in front of the operator. If the four commands below\nare run on the variables defined above, the 1st and 3rd will not work, but the 2nd and 4th will:\n\n> c*b;\n> c*b';\n> c.*b;\n> c(1,:).*b;\nIndexing\nIndexing, or selecting the desired elements of a vector or matrix, is crucial in this environment. The\nentries of matlab matrices are always numbered starting with 1, and some have special names.\nSome examples follow:\n> c(:,3) is the third column of matrix c.\n> c(3,:) is its third row.\n> c(4,1) will produce an error, since c only has three rows, as we've defined it.\n> d(2:7,:) gives rows 2-7 of d\n> d(:,2:end) refers to columns 2 through the last one.\nThese expressions can be used within other operations and calculations, letting you have pow\nerful access to various subsets of your data.\nExample: Assign a small section of your sinusoid (about one or two cycles) to a new variable,\nand make an equal-length variable section of the time vector. The \"Workspace\" pane in matlab\nwill show you the size of various variables, or you can use size(variable) or length(variable).\nPlotting\nFor making plots, the most basic syntax is:\n> plot (x_vector,y_vector);\nThis must be done with vectors of the same length and plots them one vs. the other.\n> plot(x); simply plots the data in vector x vs. the index of each data point.\n> loglog(x,y); and semilogy(x,y); produces non-linear plotting axes.\n> hold; prevents a plot from being re-drawn when the next plot command is issued, let\nting you plot multiple curves on the same set of axes.\n> plot (x,y,'r.:'); plots using a red dotted line, placing a dot at each data point.\n> axis ([-3 2 -1 1);\nsets the limits of the current plot such that the range of the x-axis is from -3 to 2, and the y-\naxis from -1 to 1.\n\n> figure(2);\ncreates a blank new figure window numbered 2, or if the window already exists, makes it ac\ntive.\nExample: Plot your full-length 0.1sec sinusoid (vs. its time vector), and the one- or two-cycle\nsegment, in two different plot windows. Adjust the axes of the full-length plot such so you can see\nthe oscillations of the sinusoid.\nNow, see what happens if you re-generate the sinusoid using fewer time points. How many\npoints per cycle do you need to be able to recognize it as a sinusoid? How many points do you\nneed for it to appear at the correct frequency?\nHere are some example commands for adding labels, gridlines, titles, etc. to your plots:\n> grid;\n> title('figure title');\n> xlabel('label for x-axis');\nAs always, use help to get the details of usage for any of these commands (in this case help plot).\nm-files and Functions\nAny time you have a series of matlab commands that you are likely to re-use, it's worth saving\nthem to an m-file, so named because their file names always end with \".m\". Such files can be run\nby simply by typing the filename (without the .m) at the matlab prompt.\nA special case of an m-file is a matlab function. This is analogous to functions in other\nprogramming languages, and can be called from other functions, m-files, or the matlab prompt\nwith parameters passing to and from it. If you are unfamiliar with the concept of functions in\nprogramming, that is beyond the scope of this introduction, but help is available from your lab\ninstructor.\nA matlab function must always adhere to the following pattern:\nfunction [output_par]=myfunction(input_par_1, input_par_2)\ncommand1;\nresult1=input_par_1+input_par_2;\ncommand2;\noutput_par=result1;\nThe file containing this function must be named myfunction.m. As written, it requires two\ninput arguments, and returns one output argument (i.e. you'd use it something like this:\noutvar=myfunction(invar1, invar2). The numbers of intput/output arguments can, of course,\nbe changed.\n\nMore Examples\nTo get more practice with matlab , work through these few examples related to Lab Module 1.\nThese don't need to be turned in, but it's highly worth your while to do them.\n5.1\nVoltage Divider\n1. Create a vector of resistance values R1, in the range 1-10kΩ.\n2. If R1 is used to make a voltage divider with a second resistor R2 having a value of 5kΩ, write\ndown two equations representing the output voltage in the two cases, where R1 is \"upstairs\"\nand \"downstairs.\"\n3. Plot both curves on the same set of axes. This should give you more insight into the sensitivity\nof resistive divider setups?\n5.2\nPhotodiode\nThe analytical equation for the i-v curve of a diode is\nI = I0(eqV/kB T - 1) ,\nin which V is the applied voltage, q, kB and T are the elemental electrical charge, Boltzmann's\nconstant, and absolute temperature, respectively (the values are q = 1.6 × 10-19C, kB = 1.38 ×\n10-23J/K, and T = 300K). I0 is the saturation current in reverse bias, which depends on the diode\nmaterial parameters and how the p-n junction is made.\n1. Start with a vector of voltages, using a range and spacing that will include the transition\nregion of a diode i-v curve, and generate a vector of current values based on those voltages,\nassuming a value for I0 of 1μA. Plot this curve and set the plot axes to be able to see clearly\nthe region where all the \"action\" is.\n2. Input your measured data for a diode in darkness either by directly entering the vectors, or\nby first entering them into a file, and using the load command. Plot this on the same figure\nwith the ideal curve from above and compare. What is the key difference from the theoretical\ndiode equation? What is the physical cause?\n3. How can you change the diode equation to model the series resistance Rs of the diode? Try\nusing different values of Rs to see if you can get the ideal curve to more closely approximate\nthe data you took.\n4. (time permitting) Create an m-file with a function that computes the ideal diode i-v curve,\ngiven a vector of voltage values, and a series resistance R. Show it to your lab instructor."
    },
    {
      "category": "Resource",
      "title": "module0.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/7c33d5fd7c79f5ba38fa1dd145e10dc2_module0.pdf",
      "content": "20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nModule 0: Introduction to Electronics\nContents\n1 Objectives and Learning Goals\n2 Roadmap and Milestones\n3 Lab Procedures\n3.1 DC measurements . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2 Impedance and load . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3 Photodiode i-v characteristics . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.4 Time-varying signals and AC measurements . . . . . . . . . . . . . . . . . . . . . . .\n3.5 \"Black-box\" transfer functions . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nA Circuit Components\nA.1 Resistors . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nA.2 Capacitors . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nA.3 Diodes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nA.4 Breadboards . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nA.5 Operational Amplifiers . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\nB Instruments\nB.1 Digital Multimeter (DMM) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\nB.2 DC Power Supply . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\nB.3 Function Generator . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\nB.4 Oscilloscope . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\nB.5 LabVIEW and the data acquisition (DAQ) system . . . . . . . . . . . . . . . . . . . 13\nObjectives and Learning Goals\n1. Familiarize yourself with standard lab electronics and some common circuit elements: linear\nand nonlinear, passive and active.\n2. Understand fundamental electronics concepts, including:\ncurrent/voltage dividers\n-\nimpedance & load\n-\nfrequency response & transfer functions\n-\n3. Analyze and build several circuits, which will be of use later.\nThis module is an extended lab orientation of sorts. Take this time to explore electronic circuits\nand really get to know all the features of our lab's instrumentation. It will pay off later. What you\nlearn and do this week will underpin many of the experiments during the rest of the semester.\nSince you are mainly concerned with understanding your toolset and learning its uses and\nlimitations, no formal write-up is necessary. However, many parts of this module work hand-in\nhand with questions on Problem Set 1, so you will still want to record data for completing them.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nRoadmap and Milestones\n1. Practice making DC and AC signal measurements.\n2. Measure circuit input and output impedances and observe loading effects.\n3. Study the nonlinear characteristics of a diode, and learn how a photodiode responds to inci\ndent light.\n4. Test several unknown circuits to determine their transfer functions\nLab Procedures\n3.1\nDC measurements\nThe simplest type of circuit is the direct current (DC) situation. This means simply that the\napplied voltage does not vary in time. Alternating current (AC) is discussed in Sec. 3.4. Most\noften, we separate complex signals into their DC and AC components (e.g. a sine wave with a\nconstant offset) to make analysis simpler.\nTo get started, wire the circuit shown in Figure 1 on your breadboard, where R1=330Ω and\nR2=150Ω. Using the power supply, set Vin to 5V. We'll make a few measurements of the behavior\nof R2 in the circuit. We want to know the voltage across it and the current through it.\nFigure 1: Resistive voltage divider circuit.\nMeasuring Voltage with the DMM:\n1. First switch the DMM to voltage mode. Note: Make sure that the DMM test leads are\nplugged into the right connections. Remember, the correct configurations for current and for\nvoltage/resistance measurements are different. See Sec. B.1\n2. Place the two leads across the terminals of R2 so that it is in parallel as shown in Figure 2.\n3. In voltage mode, the DMM has a very large equivalent resistance (ideally infinite) so that\nwhen placed in parallel with the circuit you are measuring, it will have minimum effect on\nthe circuit under test.\nTo prove this:\n(a) Assume first that the effective resistance of the DMM is small, such as 100Ω. What is\nthe combined resistance of the parallel combination of R2 and the DMM?\n(b) Now assume the DMM's resistance is something very large, like 10MΩ. Now what is the\nresistance of the parallel combination of R2 and the DMM?\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nFigure 2: Measuring voltage across R2.\nWhy would a DMM in voltage mode with low input resistance be poor for voltage measure\nments? Hint: think about how it affects the voltage divider circuit in this case.\nMeasuring current with the DMM:\n1. Switch the DMM to current mode.\n2. Place the leads of the DMM in series with a device in the path that you want to measure,\nshown in Figure 3. For this type of measurement you actually need to break the circuit and\ninsert the DMM.\nFigure 3: Measuring current through R2.\n3. What would you expect to happen if you reverse the leads of the DMM? Reverse the leads\nand see if you were correct.\n4. The input resistance of the DMM in current mode is very small, ideally zero. Why is it\nimportant for the effective resistance of the DMM to be small in current mode? Again think\nabout the effect on the circuit under test.\nCalculate the resistance of R2 using Ohm's law and the current and voltage you measured. Also\ndetermine the error in the nominal resistance value:\nerror = 100\nRexp - Rmeas .\n×\nRexp\nIs this within the tolerance value indicated by the color bands on the resistor?\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nMeasuring resistance with the DMM:\n1. Turn off power to the circuit, and disconnect the resistor you want to measure. This is\nimportant both in order to protect the DMM and because other parts of the circuit will affect\nthe resistance you measure for one particular branch.\n2. Switch the DMM to resistance mode.\n3. Place the leads in parallel with the resistor of interest (in this case R2), as you did for the\nvoltage measurement in Figure 2. Does this match your calculated resistance?\nResistor i-v characteristics\nThe current-voltage (i-v) curve of a circuit element is simply a plot of the current through it as a\nfunction of applied voltage. In your lab notebook, sketch the i-v curve of the resistor you measured.\nWhat is the slope of this curve? (Ohm's law should make this very easy).\n3.2\nImpedance and load\nFrom the previous section you already have a sense of the importance of considering the equivalent\nimpedances of your instruments - when making voltage or current measurements (or connecting\nany two circuits together) we must always keep in mind the relative output and input impedance of\nthese components.\nAn easily observable example: Suppose you have a 5V power\nsource, and need to drive an LED with approximately 2 volts. A\nvoltage divider may seem straightforward to use for this purpose,\nbut one must be careful when designing the circuit. To see why,\nwire up the circuit in Fig. 4, first using relatively small resistors\n(50-500Ω range), then do it using resistors that are 100× larger.\nWhy does the brightness of the LED change so drastically?\n-\nMeasure the voltage at the + node of the LED, before hook\n-\ning it up, and after. Also, measure the current through the\nLED in each case. Does this help you understand what's\ngoing on?\nFigure 4: A voltage divider\nCalculate the output impedance of the driving voltage di-\ndriving an LED.\n-\nviders in the two varieties you built.\nA brief discussion:\nImpedance is a generalization of resistance (including capaci\ntance and inductance), and we use the terms somewhat interchangeably here, but you should know\nthat they are not strictly speaking the same.\nA load is a general way of referring to any part of a circuit that has a signal delivered to it,\nsuch as a measurement device, or a particular component. What is considered the \"load\" depends\nentirely on how the parts of the circuit are being considered. In the case of the circuit in Fig. 4\nthe LED is the load for the voltage divider.\nThe output impedance of a circuit or device is seen \"looking into\" the output port of a circuit (i.e.\nbetween the output signal node and ground). Likewise, the input impedance of a device/circuit is\nthe impedance seen between the input node and ground. The agent doing the \"seeing\" is whatever\nconnects to the circuit in question - e.g. if an oscilloscope is hooked up to a circuit to do a\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nmeasurement, that circuit \"sees\" the input impedance of the oscilloscope. Here, the voltage divider\nbeing used to drive the LED \"sees\" the LED's input impedance, and the LED \"sees\" the output\nimpedance of the driving circuit.\n3.3\nPhotodiode i-v characteristics\nIn this section, our aim is to measure and plot the current-voltage relationship for a diode in the\ntransition region from non-conducting to conducting. After that, we also want to measure the\nbehavior of photodiodes (see Sec. A.3, which we'll use a number of times in the course as light\ndetectors.\nStart by covering the window of an FDS100 photodiode with black tape -- with no light coming\nin, it is just a regular diode. Then we'll illuminate it to see its photodiode action.\n(A) Construct the circuit shown in Fig. 5. You have at your disposal your DC power supply, and\na variable resistance R (we recommend you use values of 100kΩ, 27kΩ, 8.2kΩ, 4.7kΩ, 2.2kΩ,\nand 820Ω -- this is more straightforward than using a pot and measuring its value every time\nyou turn the knob).\nFigure 5: Circuit for diode i-v measurements.\n(B) Given this circuit, come up with a scheme to measure the diode's i-v curve. Think about\nthese questions to help guide you:\nIs current or voltage easier to measure?\n-\nFor a given setting of VS and R in Figure 5, how can you calculate the current and\n-\nvoltage through the diode by making a single measurement?\nWhat should you do differently for the forward and reverse bias regions of the curve?\n-\nFrom what you know about diodes, how does their impedance in forward bias compare\nto that in reverse bias?\nYou'll want to generate a set of ID and VD values in your notebook to be used for creating\nthe i-v plot. Then put a plot together using the program of your choice (MS Excel is fine).\n(C) For photodiode behavior, uncover the window of the device, and aim a Fiber-Lite illuminator\nat it. You should repeat the measurements you made at two or three levels of light intensity.\nYou can now combine your data to produce four i-v curves for this diode at different light\nlevels. Plot these on the same graph to see how incident light affects diode i-v characteristics.\nYou'll need this data for your first Homework Set.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\n3.4\nTime-varying signals and AC measurements\nGenerally, we refer to signals that vary with time as AC signals (alternating current, as opposed to\nDC - direct current). When we leave DC behind, the DMM we've used so far is no longer enough to\nobserve what is happening. At this point, you'll need to get acquainted with the function generator\n(Sec. B.3) and the oscilloscope (Sec. B.4), to generate and record AC signals, respectively. We'll\nalso start making extensive use of BNC cables and connectors.\nFirst, let's look at how the resistive voltage divider with which you're already familiar behaves\nwith AC signals. Build the divider circuit as you did in Sec. 3.1, but use the function generator in\nplace of Vin, and the oscilloscope in place of the DMM (Figure 6).\nFigure 6: The familiar divider circuit, with a voltage measurement across R2.\n1. Set the FG503 frequency to 5kHz, and the waveform to sinusoid with no offset.\n2. Set the voltage to 3V peak-to-peak (often written as 3Vpp). Verify that the voltage is set as\nyou intend with the scope, since the FG503 has no markings on its knob.\n3. Connect the waveform to your circuit.\n4. Use the other channel of the scope to measure Vpp across R2. Also measure the frequency\nacross R2 on the scope. You can display both the input and output waveforms at the same\ntime by using the scope's dual mode. Does this resistive voltage divider behave any differently\nat AC than it did at DC? What's the relationship between the output and input waveforms?\nNow replace R2 with a capacitor in the 0.05-0.1 μF range. Again use dual mode on the scope\nto see both the input and output waveforms. Qualitatively observe what happens to the output as\nyou change the frequency of the input. What kind of circuit is this?\n3.5\n\"Black-box\" transfer functions\nFor this part, you'll find prepared for you several metal boxes with \"mystery\" circuits wired up\ninside, labelled \"A\" through \"D.\" Your goal is to determine their transfer functions. To streamline\nthe process, we've provided a program that will output a frequency-sweep function, which you can\nfeed into the circuit. The program will then record the amplitude of the output, and plot the data\nfor you. Ask your lab instructor how to use it.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nAppendices\nA\nCircuit Components\nA.1\nResistors\nThe important things to know about resistors are: (1) value, (2) tolerance,\nand (3) power rating. The power rating indicates the maximum amount of\npower a resistor can withstand, e.g. 1/4 watt, 1/2 W, etc. The value and the\ntolerance of the resistor is printed on the package in the form of a color-band\ncode (see below).\nPotentiometers (or \"pots\") are variable resistors with three leads. The\ntop half of Figure 7 shows a full schematic, but the lower picture is usually\nused for compactness. The arm at lead #2 is called the wiper, and turning Figure 7:\nTwo\nthe potentiometer knob controls its position. While the resistance between ways potentiome\n#1 and #3 always remains the same, the knob varies the resistance between ters are shown on\nleads #1 and #2 (and between #2 and #3). Another way to think of this is schematics.\nas a variable voltage divider. The value between either #1 and #2 or #2 and\n#3 can be varied from zero to the pot's full value.\nReading the Resistor Color Code\nWe provide this table here for your convenience, but you can always easily look this information\nup on the web. For instance, http://www.elexp.com/tips/clr code.gif contains a good table\nof 4-band and 5-band resistor color codes, while this URL does it in an interactive clickable Java\napplet: http://samengstrom.com/elec/resistor/index.html.\n1. Orient the resistor so that the band that is most separated from the rest is on the right\n(typically this is gold or silver).\n2. On a four-band resistor, form the number from the first and second band by placing them as\nthe tens and ones place respectively (e.g. from the left a blue band then a green band means\n65).\nFirst or Second\nThird Band\nFourth Band\nColor\nBand (digit)\n(multiplier)\n(tolerance)\nBlack\nBrown\n1%\nRed\n2%\nOrange\nYellow\nGreen\n0.5%\nBlue\n0.25%\nViolet\n0.10%\nGray\n0.05%\nWhite\nGold\n0.1\n5%\nSilver\n0.01\n10%\nTable 1: Table of 4-band resistor colors. For a five-band resistor, the first band becomes the 100s\ndigit, the second band is the tens the third the ones, the fourth is the multiplier, and the fifth the\ntolerance.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\n3. Multiply the resulting number by the multiplier from the third band (e.g. blue-green-red =\n65 × 100 = 6.5kΩ).\n4. The most common types of resistors are 5% and 1%, so for quick designation the bodies of\nthese resistors are often color coded (brown - 5% and blue - 1%).\nA.2\nCapacitors\nCapacitors immediately make for much more interesting types of circuits than simple resistive\nnetworks, because (1) they can store energy and (2) their behavior is time-dependent.\nAn intuitive way to think about capacitor behavior is that they are reservoirs for electrical\ncharge, which take time to fill up or empty out. The size of the reservoir (the capacitance C) is\none of the factors that determines how quickly or slowly. Because of this, circuits with capacitors\nin them have time-dependent and frequency-dependent behavior. Capacitors act like open circuits\nat DC or very low frequencies, and like short circuits at very high frequencies.\nA.3\nDiodes\nThis is one of the simplest non-linear electronic devices, and is remarkably versatile. It can function\nas an electronic \"valve\", as a light-emitter (LED) or a light-detector (photodiode). Fig. 8 shows\nhow they appear on schematics.\nA diode as an electrical \"valve.\" In the simplest model, we can imagine\na diode as a one-way electrical valve - it behaves almost as a short circuit (wire)\nwhen a positive voltage is applied across it (called forward bias - shown in Fig. 8)\nand as an open circuit with a negative voltage (reverse bias). As you might guess,\nthis is not the whole story, and is only true for relatively large voltages. You will Figure 8: The\nexplore diode behavior in more detail, especially around the critical transition diode\nsymbol\nregion near 0 volts.\non a schematic.\nPhotodiodes are optimized to work as a light detector by capturing photons\nand converting them to electrical signals. This happens when photons absorbed in the semiconduc\ntor generate electron-hole pairs. Run in reverse bias, the current out of the photodiode is linearly\nproportional to the light power striking the device.\nLight-emitting diodes (LEDs) are designed to output light when current passes through\nthem. In this case, we have recombination of electron-hole pairs producing photons in the semicon\nductor. Light is emitted in forward bias, and power output depends on the current flowing through\nthe device (what's the relationship? linear? quadratic?).\nA.4\nBreadboards\nBreadboards are a platform that allows for easily building prototype circuits without the need\nfor soldering. Their advantage is that parts can be added, swapped in and out, and different\nconfigurations tested very easily and quickly. However, breadboards are bulky, pick up significant\nexcess noise from the environment, have large parasitic capacitance, as well as other limitations.\nOnce a circuit design is finalized, it's typically made in a printed circuit board (PCB).\nFigure 9 is an example of a breadboard, where each square represents a hole in which a wire\nlead can be placed. The lines drawn over the board represent the basic connectivity. The two\noutermost lines on each side represent power \"buses\" that are connected across all rows. In the\nvery center of the board is a divider that separates columns A-E and F-J. Each row is connected:\ni.e. 1A-E are all connected to each other, as are 1F-J. However, A-E are electrically isolated from\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nFigure 9: A typical breadboard layout. Some breadboards have several panels such as these adjacent\nto each other, with banana cable jacks for power and ground connections.\nF-J. Finally, rows that are not in the power rail are also electrically isolated (these connections are\nexplicitly shown only in the first five rows).\nOf course, if connectivity is unclear, you can use the multimeter to test for electrical continuity\nbetween two points on the board. Multimeter leads often don't fit in the holes directly, so you can\nuse a wire as a connector between the meter and the board.\nAn example of how to place a component in the breadboard is shown in the figure. A resistor\nis depicted as a red box with two metal leads. There are many ways to place this resistor, and the\nfigure shows two of these ways.\nBreadboard Tips and Techniques\n1. Choose the right length of wire and clip leads to keep components and wires close to the\nboard. This has two benefits: (1) It makes debugging a circuit easier if you can easily see all\nthe connections and (2) It prevents pick-up of additional noise from the environment, since\nbig loops of conducting material make for good antennas.\n2. Utilize the power rails, e.g. use one each for the positive supply voltage and negative supply\nvoltage (referred to as +Vcc and -Vcc), and one for ground.\n3. Create a common ground. If you use a power supply for DC power, a function generator\nfor an AC supply, and measure using the oscilloscope, then you will have four independent\ngrounds that may not be at the same potential unless connected together (the four grounds\nare: circuit ground, FG ground, PS ground, and scope ground).\n4. Always turn off power when building and making any changes to the circuit. Also, when\nmeasuring resistance, power off the circuit and disconnect the resistor being measured.\n5. As a rule of thumb, always connect the ground lead of an instrument to the circuit first before\nthe live lead.\n6. In future labs, we will work with Integrated Circuit (IC) packages. Static electricity can\ndestroy ICs. To prevent damage, ground yourself before handling them by touching a metal\nobject, e.g. a metal case or metal bench top.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nA.5\nOperational Amplifiers\nIn the upcoming lab module we will start using integrated circuits (ICs) known as operational\namplifiers, or op-amps. They are an enormously versatile circuit component, and come in hundreds\nof special varieties, built to have particular characteristics and trade-offs. We will use some very\ncommon general-purpose op-amp, of which a typical example is the LM741.\nEvery op-amp manufacturer provides a datasheet for ev\nery IC they make, and you should always familiarize your\nself with it. It provides information on everything from\npin and signal connections, to special features, limitations,\nor applications of a particular IC. We have copies of the\ndatasheets available in the lab for the op-amps we are us\ning, and you'll want to refer to them regularly as you work.\nAs you'll see in lecture, a typical op-amp circuit looks\nsomething like Fig. 10. This is called the inverting con\nfiguration, because the input is connected to the inverting\n(-) input. As you might guess, the output signal is the Figure 10: A basic inverting op-amp\nnegative of the input, times a gain factor set by the circuit. circuit.\nThe LM741 package of course does not look like the\ntriangle drawn above. Instead it looks more like Figure 11. Plugged into a breadboard, the two\nrows of pins straddle a trough.\nFigure 11: The pin assignments of the LM741 in a DIP-8 package.\nBesides the (-) and (+) (inverting and non-inverting) inputs, an op-amp needs DC power\nconnections, which is what enables it to be an active circuit element. These power connections are\nusually omitted on a schematic (as in Fig. 10), but always shown on the datasheet (in Fig. 11 they\nare pins 4 and 7). Typically ±15 volts is used, but you should check the datasheet to be sure.\nEvery IC has a marking on the package to indicate Pin 1, and the datasheet shows the relative\npositions of the other pins. On your LM741 there is a dot near Pin 1 (or a semi-circle on one end\nof the chip, as in the figure to the right). nc on the datasheet stands for No Connection.\nImportant:\nICs are sensitive to static electricity discharges. Your body can easily store\nenough charge to damage an IC, especially on a dry winter day. To prevent this, always make\nsure to touch the grounded metal case of an instrument to dissipate the charge. Use caution when\nhandling the chips.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nB\nInstruments\nThe brief descriptions in this section will give you an introduction to each instrument. You can\nalways refer to the manuals available in the lab for more details.\nB.1\nDigital Multimeter (DMM)\nA very versatile tool, the multimeter serves as a voltmeter, ammeter, ohmmeter, and has a number\nof other functions as well (see Figure 12(b)). Modern DMMs, such as our Fluke 111, are highly\nintuitive to use: select the function you want with the central mode dial, plug the leads into the\nappropriate connectors, and measure. The black (negative) lead always plugs into com while the\nred (positive) lead is adjusted depending on the function. The voltage and current measurement\nmodes of the DMM are very different (you'll see why), so don't forget to reconnect the leads.\nIn alternating current (AC) mode, the multimeter gives root-mean-square (RMS) measurements,\nwhich are useful when you know what the waveforms are. We'll discuss RMS later in the course.\nB.2\nDC Power Supply\nThe power supply we will use is a Tektronix PS503, shown in Figure 12(a). It has one fixed\n5V output and two adjustable ones. The (+) and (-) outputs have adjustable current limits\nand voltages up to ±20V can be set either independently, or together (using the dual tracking\nknob). The white output button on the upper right allows power to flow to the outputs: always\nremember to turn this off or disconnect it when rewiring your circuits.\nNote that the black common voltage connector is \"floating,\" i.e. not directly connected to\nground, and can't be assumed to have zero voltage. You'll want to connect it to the white connector\nof the fixed 5V supply, which is tied to ground.\n(a) Tektronix PS503A.\n(b) Fluke 111.\nFigure 12: (a) The DC power supply and (b) the digital multimeter used in our lab\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nB.3\nFunction Generator\nA function generator does what its name says -- gen\nerates signal waveforms for standard functions: sinu\nsoids, triangles, square waves. The FG503 is very\nbasic. Its frequency range is about 0.1Hz to 300kHz,\nand amplitude range from about ±0.35V to ±10.0V.\nIt can output waveforms with and without offset. The\nlarge central dial in Figure 13 is the main frequency\nknob, which sets the output frequency together with\nthe multiplier knob (labeled). Be warned that the\nlarge dial's markings can be fairly inaccurate - al\nways verify the actual output frequency with an os\ncilloscope or spectrum analyzer.\nNote that higher-end function generators, such as\nthe DS-345 from Stanford Research Systems, have\nmuch more precise controls for waveform frequency,\namplitude, and offset, and may have other advanced Figure 13: An FG503 function generator.\nfeatures like sweeping frequency, generating nonstan-\n(In this image, the BNC signal connectors\ndard or arbitrary waveforms, and modulation.\nare capped.)\nB.4\nOscilloscope\nAn oscilloscope is designed for observing signal waveforms that change faster than can be usefully\nseen on a DMM. Most often, the signals observed are periodic, and the scope is effectively a \"time\nmagnifier\" letting you stretch and compress the timebase (as well as the waveform magnitude) for\nconvenient viewing.\nOurs is an OS-5020 model made by EZ Digital, the front panel of which is shown in Figure 14.\nIt's about as basic as a two-channel analog scope can be. Below is a brief description of the most\nimportant controls:\nFigure 14: The OS-5020 oscilloscope.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nCH1, CH2: channel inputs (2) - Signals connect to these via BNC cables. Above each input\nis a three-position input coupling switch (ac - gnd - dc). Understanding the three settings\nis crucial to knowing how the scope is measuring incoming signals.\nVOLTS/DIV: channel gain knobs (2) - Set the \"magnification\" of the waveform in the verti\ncal axis. The scale around the knob tells you how many volts each square of the grid represents\nat a given magnification.\nMODE select - Choose whether the scope is displaying the signal on Ch. 1, Ch. 2, both simul\ntaneously (dual), or their sum (add).\nPOSITION knobs (2 vert., 1 horiz.) - Set the zero-position of the trace for each channel, and\nthe time-trace to enable accurate measurements.\nTIME/DIV: timebase selector - Like channel gain, but for the horizontal (time) axis, this sets\nhow much time each square of the grid represents. In its rightmost position, it selects \"X-Y\nmode\", which plots the two input channels one vs. the other, with no time dependence.\nMost of the other controls deal with triggering, which refers to synchronizing the scan of the\ndisplay with the input waveform. You will get a feel for these as you use the instrument in lab.\nYou'll notice that the scope only measures voltages - there are no modes for directly measur\ning current or resistance. It's also important to remember that scope measurements are always\nreferenced to ground. The shield (black lead when using grabber wires) of the BNC connector is\nhard-wired to ground. This means you can't use just one channel of a scope to measure the voltage\nbetween two non-ground nodes in a circuit.\nB.5\nLabVIEW and the data acquisition (DAQ) system\nLabVIEW is a software and hardware system designed to perform the functions of many standard\nbench-top measurement devices. The hardware provides signal input and output for the PC (see\nFig. 16, while the software runs what are called \"virtual instruments\" (VIs), resulting in a very\ngeneral-purpose data collection and processing platform. In addition to collecting data, LabVIEW\ncan be used to control instruments, for example via a GPIB interface.\nYou will use a number of different VIs throughout the course that have been\nwritten for you. While they will all perform different functions, they all have\ncommon run/stop controls in the upper left hand corner, as shown in Fig. 15.\nThe arrow at the left is used to start each VI, and the red \"stop\" button will halt\nFigure 15:\nit once it is running.\nThe great advantage of LabVIEW is its breadth and flexibility. The major disadvantage is that\nwhen performance is important (high speed, low noise, high precision, etc.) dedicated instruments\nquickly outperform it.\nFigure 16: The data acquisition (DAQ) connection board, used for signal input and output with\nLabVIEW. The analog input channels are in two rows, labeled ach0 through ach7, and ach8\nthrough ach15. The two output channels are to their right, labeled dac0out and dac1out, one\nabove the other."
    },
    {
      "category": "Resource",
      "title": "module1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/0c9c517efae28a31929a9d95cf92afcf_module1.pdf",
      "content": "20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nModule 1: Measuring DNA Melting Curves\nContents\n1 Objectives and Learning Goals\n2 Roadmap and Milestones\n3 Background\n4 Building the apparatus\n4.1 Temperature sensing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.1.1\nThermistor . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.1.2\nWheatstone bridge . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2 Fluorescence readout system . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.1\nAmplification circuit . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.2\nOffset circuit . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.3\nSYBR Green I . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.4\nOptical system . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.5\nSample handling . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.2.6\nHeating block . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5 Experimental Protocol\n5.1 Preparing the setup . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.2 DNA melting curve experiment . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6 Report Requirements\n6.1 Data to take . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6.2 Model vs. reality . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nObjectives and Learning Goals\nImplement a temperature sensor using the well-known Wheatstone bridge scheme.\n-\nBuild an instrument for recording DNA melting curves.\n-\nUse your instrument to study the melting behavior of several DNA samples under different\n-\nconditions.\nUnderstand the factors affecting DNA melting behavior, and what type of information can\n-\nbe usefully obtained from such measurements.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nRoadmap and Milestones\n1. Build and test the temperature-sensing circuit.\n2. Calibrate the circuit for accurate temperature measurement.\n3. Build an amplification/offset circuit for the DNA fluorescence signal.\n4. Assemble an optics setup that will enable you to observe the light output of a DNA sample\nto be studied.\n5. Combine the subsystems you have built to generate a DNA melting curve; troubleshoot and\noptimize your system.\n6. Obtain DNA melting data for several sequences, and identify a single-base mismatch (SNP)\nsequence.\nBackground\nYou will learn in lecture about the im\nportance and utility of measuring of\nDNA melting temperatures.\nA com\nmon application takes advantage of\nthe length-dependence of DNA melt\ning temperatures to examine PCR prod\nucts, and determine whether the desired\nsequence was successfully amplified.\nThe goal of this lab is to build the\nhardware to be used for double-stranded\nDNA (dsDNA) concentration measure\nment with the common dsDNA-binding\ndye SYBR Green I. This setup, together\nwith a temperature sensing circuit, en\nables DNA length and complementar\nity analysis via melting curve measure-\nment. The tools developed in this lab\nwill also be capable of analyzing other\nfluorescent dyes with similar excitation\nand emission wavelengths.\nA typical plot of temperature-\ndependent fluorescence from a solution\nof DNA and SYBR Green I is shown in\nFig. 1. The \"melting temperature\" Tm\nis defined as the temperature at which\n50% of the DNA remains hybridized.\nSometimes, the transition is not partic\nularly sharp, or other factors in the mea-\nsurement may create offsets or drifts in\nthe signal (evident below 80*C in Fig.\nFigure 1: Typical melting curves using SYBR Green I.\n1(a)), in which case the derivative of this\nPlot\nof\ntem\nper\natur\ne-d\nepen\nd\nen\nt\nfl\nuo\nre\nsc\nen\nce from a solution\nof DNA\na\nn\nd\n\nS\nY\nB\nR\nGr\nee\nn\nI.\nFigure by MIT OCW.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\ncurve is plotted (Fig. 1(b)), and the lo\ncation of its peak value gives Tm more clearly. More about this in Section 4.2.3.\nTo perform a DNA melting experiment, the temperature of the DNA sample is usually ramped\nup at a controlled rate, and carefully monitored, while the concentration of dsDNA is recorded,\nmost often using a fluorescent dye. To avoid the need for precise temperature control, we will\nramp the temperature downward by heating the DNA sample to above its melting temperature,\nand letting it cool naturally.\nBuilding the apparatus\nYour apparatus will consist of two major subsystems for (a) temperature measurement, and (b)\nquantification of dsDNA in your sample. The outputs of the subsystems give you the two data sets\nthat constitute a DNA melting curve: temperature and relative fluorescence intensity.\nNote: as you build the setup, keep stability in mind. This is a sensitive high-gain\nsystem, and it will not perform well if it is constantly getting bumped and wires are\nbeing moved or disconnected. This means making solid electrical connections, keeping\nwires and cables clamped or taped down, and setting things up to move as little as\npossible when you connect and disconnect the sample.\n4.1\nTemperature sensing\n4.1.1\nThermistor\nA thermistor is a resistor whose resistance varies with temperature. Thermistors come in two \"fla\nvors:\" positive temperature coefficient (PTC - R increases with higher T) and negative temperature\ncoefficients (NTC - R decreases with higher T). To build and test your temperature-sensing circuit,\nyou can use a 5 kΩ NTC thermistor (black with red leads, available in our usual small parts drawers\n- part number RL0503-2890-95-MS). Its temperature-resistance characteristic is nonlinear, and the\ndatasheet is available in the lab.\nOnce you have a good feel for the temperature sensing circuit (see Sec. 4.1.2), you will actually\nuse a thermistor called an RTD (resistance temperature device) for the melting experiment (see\n4.2.6. It is a positive temperature coefficient platinum thermistor with a nominal value of 1 kΩ that\nhas a very linear temperature response. This one has part number PPG102A1, and the datasheet\ncan be likewise found in the lab.\n4.1.2\nWheatstone bridge\nThough very simple, the voltage divider is a very powerful concept in electronics - divider-based\ncircuits contribute to many types of sensor and measurement systems. Here we will use a well-known\ncircuit called a Wheatstone bridge to make temperature measurements.\nThe Wheatstone bridge was invented in the 1800's in order to measure the resistance of an\nunknown value Rx. The circuit consists of four resistors in the configuration shown in Figure 2.\nTypically, two have known values, R1 and R2, and a third resistor R3 is variable. The unknown\nresistance Rx takes the fourth position, and the circuit is wired with a voltage source Vin. The\nbridge is \"balanced\" when the ratio of R1 to R3 is exactly equal to the ratio of R2 to R4, in which\ncase the voltages at nodes a and b are equal. Otherwise a voltage difference develops, and current\nwill flow if a connection is made across the bridge.\nWire up a Wheatstone bridge on your breadboard, as shown in Figure 2, using a 1-10 kΩ\npotentiometer for R3 (blue rectangular, not the round multiturn type) and values for R1 and R2\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nFigure 2: A Wheatstone bridge circuit.\nthat will give good sensitivity if Rx is in the 1 kΩ range. Note that the RTD should have no\nmore than 1 mA of current passed through it, so build your circuit accordingly.\nOne way to measure the unknown resistance Rx is by monitoring the voltage difference Va -\nVb, and adjusting the value of R3 until the bridge is balanced. Another method is to perform\na calibration to derive the relationship between the voltage across the bridge to the change in\nresistance. Our approach will be a combination of these methods - you will first adjust R3 to\nbalance the bridge, then use your knowledge of how Vab depends on Rx to calculate resistances\nfrom voltages.\nTest your temperature circuit using the black-with-red-leads thermistor, and small amounts of\ncold or warm water to vary its temperature. Observe the circuit output and make sure that the\ntemperature reading makes sense to you. A thermometer is likely to be helpful here.\nOnce you are satisfied with this, connect your circuit to a the sample block with the attached\nRTD. Make sure you are able to convert Vab to resistance, and use the datasheet to determine the\ncalibration relationship between temperature and resistance.\nYou should now have a functional electronic thermometer, and a straightforward way to convert\nits output to temperature.\n4.2\nFluorescence readout system\n4.2.1\nAmplification circuit\n(If you need a brush-up on op-amps, refer to Section A.5\nin the previous lab module).\nTo usefully measure and record the fluorescence sig\nnal you will need what's called a transimpedance amplifier\n(sometimes called a current-to-voltage converter) with a\ngain of approximately 108 V/A. Be sure you understand\nwhy this is the case, and explain it to your lab instructor.\nThe simplest transimpedance amplifier looks like Figure\n3:\nDetermine the DC gain Vout/iin of this configuration (in\nV/A) in terms of the resistance Rf . It should be clear that\ngetting a large gain from this circuit requires the use of a\nvery large resistor, which we'd prefer to avoid. (Optional: Figure 3: Basic transimpedance am-\nwhy not simply use a resistor, and omit the op-amp?)\nplifier circuit.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nFigure 4: The high-gain version of the transimpedance amplifier circuit. Don't forget to add a\ncapacitor for high-frequency noise rejection.\nInstead, we can use the circuit from Homework Set 1,\nwhich you have already analyzed, shown in Fig. 4. Since the signal you will measure will be very\nslowly-varying (near DC), you will also want to include a capacitor for rejecting high-frequency\nfluctuations (as discussed in HW1).\nOne final note about the type of op-amp to use. Though real op-amps don't behave exactly\nlike ideal ones we use for analysis, we want an op-amp whose input current is as close to the ideal\nvalue of zero as possible (why?). Op-amps with this characteristic have JFET inputs, and in our\nlab, the LF411 or LF351 are both suitable.\n4.2.2\nOffset circuit\nA final addition to the system that will greatly improve its usabil\nity is a knob that lets you control the level of the output signal.\nA simple way to do this is using an LM741 op-amp, with a 10kΩ\npotentiometer connected as shown in Fig. 5. Use one of the high-\nquality round pots to obtain smooth and precise control.\n4.2.3\nSYBR Green I\nThis is a common intercalating dye that binds highly preferen\ntially to dsDNA (not ssDNA), and exhibits strong fluorescence Figure 5: Offset circuit using the\nwhen bound and nearly zero fluorescence when unbound. We LM741. Note that all three of the\ntherefore expect to see an decreasing signal (using an inverting pot's leads are used, and the wiper\nconfiguration) as the temperature of the DNA sample drops, and is connected to the negative sup-\nmore and more DNA duplexes are formed. SYBR Green I is ex-\nply voltage.\ncited by light at a wavelength of 498 nm (blue), and emits at\n520 nm (green).\nSYBR Green I fluorescence is not only dependent on its bind\ning state with dsDNA, but also has a dependence on temperature. Higher temperatures reduce its\nfluorescence, which introduces an approximately-linear drift into the signal as the temperature is\nramped. This is one of the reasons for taking the derivative of the recorded data to determine Tm.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nFigure 6: Recommended layout of the light source, filters, and detector for the optics setup.\n4.2.4\nOptical system\nFigure 6 shows a schematic of the recommended optical configuration. The right-angle geometry\nhelps to reduce any background signal that gets through the excitation filter. Build this on an optical\nbreadboard, keeping the components close to the board for stability and simplicity of design. This\nwill mostly involve short rails, rail clamps, and posts.\nThe filters used are a D470/40x bandpass filter (excitation), and a E515LPv2 long-pass filter\n(emission) from Chroma Technologies. Take care not to touch the optical surfaces when handling\nthese components, as they have coatings that are easily damaged. Datasheets are available, as\nusual.\nThe LED array connects to the circuit just like a single LED, using two leads - anode and\ncathode. It can be powered directly from your power supply, and ≈ 8.8V is known to supply a\ngood amount of light while dissipating manageable heat.\n4.2.5\nSample handling\nThe DNA samples for these experiments are loaded inside a glass cuvette. You should use 500μL\nof DNA solution for each run. Pipet (20μL) of mineral oil on top of the DNA solution to prevent\nevaporation; make sure the oil stays on top by always keeping the block vertical, especially when\nheating it.\nTo change samples, pipette out the previous DNA solution, and discard it in the waste container\nprovided. Discard the pipette tip. Rinse the cuvette with water, then, using a fresh pipette tip, fill\nit with 500μL of new DNA solution.\nYou should be able to use the same DNA sample for many heating/cooling cycles, so only replace\nit if you lose significant volume due to evaporation. If you need to leave the sample overnight, store\nit in the lab refrigerator, and clearly label it with your name.\n4.2.6\nHeating block\nFor better temperature stability and easier handling, the cuvette slips inside a machined aluminum\nblock, also provided for you. The RTD thermistor for temperature measurement is hard-mounted\nonto this block. Use a hotplate to heat up the block to above the DNA melting temperature\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\n(≈ 90*C), then move the block to your setup for measurement, and connect the thermistor to the\nWheatstone circuit.\nYou'll find that the speed at which the block cools down is likely too fast if it's placed directly\nin contact with the metal optical breadboard. You can control this speed by placing one or a few\npieces of paper or layers of paper towel underneath the block. Experiment with this until the block\ntakes between 5 and 10 minutes to cool down from 90*C to 40*C.\nExperimental Protocol\n5.1\nPreparing the setup\n1. (The system will generate the best data when both the amplifier circuit and LED have been\non for at least 60 min. and all drifts have stabilized. However, you certainly don't need to\nwait idly while this happens, and can test the setup and try measurements in the meantime.)\n2. (Do this first without the sample and the block.) Using a box and a piece of black cloth,\nmake sure the entire optical setup is isolated from stray light. If you can see any blue light\ncoming out at all, light is also getting in.\n3. Use the potentiometer to adjust the amplifier voltage offset until the baseline signal is approx.\n0 V.\n4. The baseline should be relatively flat - if it is not, generally it's because the setup is not well\ncovered.\n5. Now include the block with DNA solution in the setup. Adjust the block's placement and the\nangle of the LED source to maximize the ratio of DNA signal vs. background signal without\nthe block. Use the plastic alignment jig if you need, or simply mark the position of the block\nin some way.\n5.2\nDNA melting curve experiment\n1. Place the block on the hotplate (set to 95*C) for at least 10 min. Measure the RTD thermistor\nto make sure the temperature is above 80*C before removing the block\n2. Move the block to your setup. Immediately connect the RTD to its Wheatstone bridge circuit.\nCover the setup in a box and put a piece of black cloth over it.\n3. Start the LabVIEW recording program (called DNAmelting.vi). Wait for the block to cool\nto below 40*C, which should take about 10 min. if the block sits on a single piece of paper\ntowel.\n4. A monotonically decreasing fluorescence signal is expected (for an inverting amplifier setup).\nIf there is any LED output fluctuation, or if the signal drifts upward, you'll need to restart\nthe experiment. When you're satisfied with the melting run, save the data.\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nReport Requirements\nThis lab report is due by noon on Friday, Oct. 6.\n6.1\nData to take\nOnce your instrument is running to your satisfaction, you should record the following melting\ncurves:\n40bp perfect match\n-\n19bp perfect match\n-\n19bp complete mismatch\n-\n19bp single-base mismatch (SNP)\n-\n19bp at 1-2 different ionic strengths\n-\n(Note: Other than the last one, the 19bp samples will only be identified as A, B, and C, and you\nwill need to identify, based on your measurements, which is which.)\nYou will need to take the derivative of the recorded fluorescence data, and combine it with the\ntemperature data to generate plots. Generally, the region of interest will fall between 40 and 65*C.\nIt will be helpful to create a matlab script to convert raw data to a plot of dF/dT vs. temperature.\nHaving generated your melting profiles, you need to produce the following plots:\n1. Comparison of perfect match 40bp and 19bp sequences.\n2. Comparison of 19bp perfect match vs. SNP vs. complete mismatch sequences.\n3. Comparison of 19bp sequences at different ionic strengths.\nIn each situation, discuss the melting temperatures and shapes of the melting curves for the\nsamples relative to each other. Briefly explain the curves are the way they are in each case.\nCompare your melting curves with those of other students in the class. You may find the quite\ndifferent even under the same conditions. What might cause these variations? What factors affect\nthe DNA melting temperature, and the \"sharpness\" of the melting transition?\n6.2\nModel vs. reality\nIn class, we derived an expression that relates the melting temperature to the enthalpy change\nΔH* and entropy change ΔS* of the hybridization reaction:\nΔH*\nT (f) =\n,\n(1)\nΔS* - R ln(2f/CT (1 - f)2)\nHere, f is the fraction of DNA strands hybridized (dimerized) at a particular temperature (at Tm,\nthis is 1/2), and CT is the total concentration of single-strand oligonucleotides (or 2× the dsDNA\nconcentration when all strands are hybridized).\nChoose one of the perfect-match sequences that you measured, and use matlab to fit the model\nto your measured data, which will allow you to extract the ΔH* and ΔS* parameters.\nTo perform the fit, you will need a matlab function that will evaluate T (f) given an input\nconst for the ΔH* and ΔS* parameters. The function will be something like this:\n\n20.309: Biological Instrumentation andMeasurement Laboratory\nFall 2006\nfunction Tf = melt(const, f)\nR=8.3;\nC_T=33e-6;\ndH = const(1);\ndS = const(2);\nTf = dH./(dS - R*log(2*f./(C_T*(1-f).^2)));\nYou can then invoke matlab's lsqcurvefit routine to do the fit, which will return the best\nvalues for ΔH* and ΔS*.\nFitVals = lsqcurvefit(@melt, [dH_guess, dS_guess], frac_vector, temp_vector)\nBonus (optional):\n1. Calculate ΔH* and ΔS* for this sequence using the nearest-neighbor model from class.\n2. Compare these to the fit parameters, and speculate about why they might be different? What\nfactors affect ΔH* and ΔS*?"
    },
    {
      "category": "Resource",
      "title": "tutorial1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/e5a631930e48074e0dbd558ecf5f560c_tutorial1.pdf",
      "content": "20.309 Tutorial Sheet #2\ndiscrete vs. continuous functions, periodicity, sampling\nWe will encounter two classes of signals in this class, continuous-signals and discrete-signals. The distinct\nmathematical properties of each, especially in regards to Fourier transforms, requires us to have at least a basic\nunderstanding of the differences between them. First I will present some mostly non-mathematical intuition,\nthen discuss some of the theory behind it. This material is meant to help you understand the labs and\nhomeworks.\nContinuous-signals have, as their name suggests, a continuous independent variable. For example, the velocity\nof a moving body, like you moving around campus, could be considered a continuous signal - at any time t the\nvelocity is clearly defined. Notation is the common f(t), which you are used to from mathematics classes.\nIn contrast, discrete signals are only defined at discrete independent variables. For example, the daily high\ntemperature during a week is only defined for the 7 days. It would make no sense to compare the daily high of\nday 1 (say Monday) to day 1.5. Other examples of discrete signals include census data and class attendance; if\nyou think about it there are many others. Notation for discrete numbers is typically f[n], with the brackets\nemphasizing that n is a sequence.\nGraphically:\ncontinuous function\n0.5\n1.5\n2.5\n3.5\nt\ndiscrete function\nt\nThe distinction is very important to us because when we use computers to numerically perform mathematical\noperations we are confined to dealing with the properties of discrete numbers. That is because typical computers\nare built with digital logic dealing with ultimately binary data. MATLAB can approximate a continuous\n0.5\n1.5\nf(t)\nf[t]\n\nfunction by generating values at small intervals of the independent variable, but there is a limit to how much\nsuch approximations actually mirror the real thing. It is that limit we are interested in.\nSampling\nSo how do we go from continuous to discrete signals? In the case of the moving body, if you were to measure\nthe velocity with a radar gun and write down your reading every 0.5 seconds, you would in fact now have\ndiscrete data. We would say that your sampling frequency is 2 Hz, or 2 per second. Ideally, you would write\ndown values at exactly every 0.5 seconds. Mathematically we can define this operation as multiplying an\n\"impulse train\" with your data, then passing it through a \"continuous to discrete converter\" or \"C/D converter\".\nLet's examine the situation where you are on a swing, tracing the motion of a pendulum - thus your velocity\nwould be a sinusoid. Your velocity v(t) is thus equal to sin(t).\n-1\nvelocity (m/s)\nSignal:\nv t sin( )\nt\ntime (s)\nsampled v(t) (m/s)\nimpulse (unitless)\nImpulse train: p t( ) 1for t\n0, 1, 2,\n\nr r\n\np t 0 otherwise\nSampled:\nv\nt\nv t p t\n\np\ntime (s)\n-1\ntime (s)\nPerforming this operation is known as \"sampling\" the function v(t) at the sampling frequency of 1/aT, where T\nis the period of the impulse train. Note that an impulse train can also be written as\nIf you sample vp(t) by multiplying with p(t) you will obtain a sampled signal. Note that the impulse train is still\na continuous function although it looks discrete, since it's defined for every t. Also note that we are multiplying\ntwo signals in time, which by the convolution theorem which we saw in class means the transform of vp(t)\nequals the convolution of the signals in frequency: Vp (:) V (:)* P(:) . vp(t) becomes a discrete signal vp[t]\n=\n\n,\n0, 1, 2,...\np t\nt\nkT\nT\n\nafter running the signal through a C/D converter which will non-dimensionalize time into sample numbers\n(more on this and the convolution in frequency later).\nIf v(t) is changing slowly enough for our sample rate to capture all the information contained in the signal, we\ncan completely reconstruct v(t) based on the discrete sequence vp[t]. Stop and think about this for a while - you\ncan exactly reconstruct a function v(t) by knowing an infinitesimally smaller subset of information, as long as\nyour sampling frequency is great enough. The cutoff point is called the \"Nyquist sampling frequency\", and it is\nexactly twice the highest frequency you can reconstruct in your signal. This is known as the \"sampling\ntheorem\":\nSampling at Fnyquist with Fnyquist > 2*fmax (where fmax is the highest frequency in your signal of interest) allows\ncomplete reconstruction of the signal from its sampled values. A more formal way to say this (T = period):\nSampling Theorem, Oppenheim and Willsky, \"Signals and Systems\" page 518\nLet x(t) be a band-limited signal with X( : ) = 0 for | : |> : max. Then x(t) is uniquely determined by its\nsamples x(nT), n = 0, ±1, ±2, ..., if : s> 2 : max where : V ʌ7*LYHQWKHVHVDPSOHVZHFDQUHFRQVWUXFW\nx(t) by generating a periodic impulse train in which successive impulses have amplitudes that are successive\nsample values. This impulse train is then processed through an ideal lowpass filter with gain T and cutoff\nfrequency greater then : max and less then : s- : max. The resulting output signal will exactly equal x(t).\nIf your signal contains frequencies higher then half your sampling rate, then you are \"undersampling\" the signal\nand will not be able to reconstruct it fully. If you try to reconstruct it anyways you will encounter \"aliasing\", or\ndistortion of the original signal. It's really useful to look at the graph below to see what this means - if you\naren't sampling fast enough you have no way of knowing if the signal you are observing is the red or blue one.\n\"Two different sinusoids that give the same samples; a high frequency\n(red) and an alias at\n(blue).\" (http://en.wikipedia.org/wiki/Aliasing, accessed 10/05/06).\nLater we will see what aliasing looks like in the frequency plane.\nBackground Theory\n\nI will present some basics to help understand hwk2, but the full mathematics behind it is outside the scope of\nthis course. A course entitled \"Signals and Systems\", or the textbook of the same name by Oppenheim and\nWillsky (available in the lab) can fill in the blanks if you are interested.\nIn class Prof. Manalis introduced the Fourier Transform for continuous signals, and its inverse. We will specify\nthis transform as the CTFT, or Continuous Time Fourier Transform. Because MATLAB doesn't work with\ncontinuous signals, when you want MATLAB to perform a Fourier Transform it actually performs the Discrete\nFourier Transform, or DFT.\nIn class we saw this table:\nTime\nFrequency\nFourier series (CTFS)\nContinuous (t)\nDiscrete (wn)\nFourier integral (CTFT)\nContinuous (t)\nContinuous ( : )\nDiscrete Time Fourier Transform (DTFT) Discrete [t]\nContinous (w)\nDiscrete Fourier Transform (DFT)\nDiscrete [t]\nDiscrete [2*pi*k/N]\n(I've added the DTFT)\nThe CTFS maps a continuous, periodic signal to its harmonic (sinusoidal) components. This means that we are\nWU\\LQJWRPLPLFRXUVLJQDOZLWKVLQHVDQGFRVLQHVRILQWHJHUPXOWLSOHVRIWKHIUHTXHQF\\ LQUDGLDQV An = n : =\nn*2pi/T. The series of frequencies thus presents a discrete mapping in frequency space. Note from the formula\nthat the CTFS is aperiodic.\nT /2\na0\n3 f\nt\n\ndt\n\nT T /2\nT /2\nan\nf t cos Znt\n\ndt\n\nT T /2\n\nCTFS:\nT /2\nbn\nt sin Znt\n\ndt\n\nf\n\nT T /2\n2S\nZ\nn , n 1,2,3...\nn\nT\nf\nCTFS-1 (inverse):\nf t\na0 ¦an cos Znt bn sin Znt\nn 1\nThe CTFT is a generalization of the CTFS to include all frequencies in the transform, not just integer multiples.\nWe are taking the formula for CTFS and taking the limit as T goes to infinity. Thus the signal in time no longer\nneeds to be periodic (since the period T is going to infinity), and in turn we need to use all frequencies in order\nto mimic the signal. The CTFT of a signal is thus continuous, and also not necessarily periodic. The CTFT\ntransforms a continuous time signal to a continuous spectrum in frequency. We represent that frequency as : .\n\nf\nCTFT:\nH (:) 3 h(t)eiwt dt\nf\nf\nCTFT-1:\nh(t) 3 H (:)eiwt d:\nf\nThe DTFT is symmetrical to the CTFS. Recall the CTFS maps a periodic, continuous signal in time to a discrete\nsignal in frequency. The DTFT maps a discrete signal in time to a periodic, continuous signal in frequency. The\nconnection to the CTFT is that the DTFT acts on a sample of a continuous signal. If we were to rewrite the\nCTFS in terms of exponentials (using Euler's Formula, eiZ\ncosZ i sinZ ) the symmetery would be more\napparent, I'll leave that to you, or you can look up the Strang reference \"Fourier Transforms\" on page 5.\nf\nH eiZ\n[ ] iZn\nDTFT:\n\n¦h t e\nf\nDTFT-1:\nh t[ ] 1\nS 3 H eiw eiZndZ\n2S\nAll these transforms involve continuous signals in either time or frequency space. However as you know\ncomputers in general can only work with discrete information, and additionally we can only sample for a finite\ntime. Thus the best we are able to do numerically with transforms is a discrete approximation in frequency to a\ndiscrete signal in time. This brings us to the DFT. The reference in the 20.309 schedule page titled \"FFT\nreference material\" contains a more detailed explanation if you desire.\nThe Discrete Fourier Transform (DFT)\nWhy DFT if we have DTFT? Recall that DTFT provides a continuous frequency spectrum provided that we are\ngiven an \"infinitely long\" discrete-time signal. However, in real life we do not have the luxury of sampling a\nsignal forever. Therefore DFT approximates the frequency spectrum of a DTFT using discrete samples. The\nDFT maps a discrete, aperiodic and finite signal in time to a discrete, periodic signal in frequency. This is\nsomething computers can do. The DFT of a length N signal in time will also be of length N in frequency. In\notherwords, if we have a signal of length 10, we could only estimate the entire frequency spectrum with 10\nsamples. Note that we have a limited series of frequency values in the DFT, namely N. If a signal f[t] contains\nDIUHTXHQF\\Ax which is not close to one of the frequency values available in the DFT, the frequency spectrum\nwill have to use a combination of the available frequencies to substitute, resulting in \"spectral leakage\". Thus\nwhen performing a DFT in MATLAB it can be extremely helpful to know what frequency you are looking for,\nand adjust input parameters accordingly. Modern implementations of the DFT use an algorithm called the Fast\nFourier Transform, or FFT, and use clever windowing techniques to reduce the inherent problems of the DFT\napproximations. Windowing refers to taking subsets of the signal and performing the FFT multiple times - you\ncan see how this can affect your result based again on the number N of frequency values being the same as the\nnumber of time values.\n\n=\n=\n\n1 N 1\nik§\n(c)\nN\nS ·\n1 n\nH k\nh n e\n, k\n0,1,..., N 1\n¦ > @\nDFT:\n[ ]\nN n 0\nN 1\nik§ (c)\nN\nS · 1\nh n\nH k e\n, n 0,1,..., N 1\nDFT-1:\n> @ ¦ > @\nn\nk 0\nNow let's look at a sampling example...see next document, hand-written pages."
    },
    {
      "category": "Resource",
      "title": "matlabtutorialv2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/3f530c9d373a344fd90da65ba9175018_matlabtutorialv2.pdf",
      "content": "20.309 Matlab Tutorial\nBy Marcio von Muhlen\nFall 2006\nAdapted from previous tutorials by Maxim Shusteff, Nate Tedford and other BE students\nWhere to use Matlab: In the 20.309 lab, any MIT server or your own computer.\nHow to use Matlab (please print and bring to lab):\nhttp://openwetware.org/images/5/5f/MatlabIntro.pdf (Intro to Matlab file 2 in the website)\nWe will follow these tutorial notes, with additional material below.\nAdditional Material:\nIn experimental work you will often encounter the need to fit data to arbitrary (non-polynomial)\nfunctions. Matlab provides a variety of methods for doing this, one of which is the function\nLSQCURVEFIT. Take a few moments to glance through the help file to see what we're getting in to.\nThe various paragraphs indicate that this function behaves differently depending on the number of\ninput and output variables specified in calling it.\nIn order to generate a fit you need to tell Matlab the form of the equation you believe the data should\nfollow. Bear in mind that Matlab has no way of knowing or telling you if you're incorrect, so it's up to\nyou to account for this. The way you do this is by creating a Matlab function file. For example, for an\nC1 X\nequation of the form: f (x) 1 C2 X\nThe function file might look like:\nfunction yhat = myfun(beta, x)\nc1 = beta(1);\nc2 = beta(2);\nyhat = (c1*x ./ (1 + c2*x));\nwhich, since it's a function, must be named myfun.m. The coefficients to be fitted are here contained\nin the input variable beta. Make sure to have this function in your working directory.\nLet's try to fit the following data to this function using LSQCURVEFIT:\n(you can find it in digital form at http://openwetware.org/images/8/8f/Fitdata.txt, or just copy and paste)\n\nX\nf(X)\n1.0000\n1.6523\n1.2743\n1.8215\n1.6238\n2.0050\n2.0691\n2.1106\n2.6367\n2.3456\n3.3598\n2.4778\n4.2813\n2.5952\n5.4556\n2.8175\n6.9519\n2.8945\n8.8587\n3.0125\n11.2884\n3.0001\n14.3845\n2.9454\n18.3298\n3.1056\n23.3572\n3.1850\n29.7635\n3.2454\n37.9269\n3.1170\n48.3293\n3.2313\n61.5848\n3.2092\n78.4760\n3.3027\n100.0000\n3.2677\nCreate a matrix fitData which contains this information. You could use:\n>>fitData = dlmread('fitdata.txt', '\\t', 1, 0);\nAssuming fitdata.txt exists in your working directory. The 1 in the third input tells Matlab the data is\nstarting on the 2nd row of the text file (Aside: Matlab indexes occasionally start with 0 as in JAVA, but\nusually start with 1 - you can tell different coders wrote different parts of this software).\nAssign the X column to the variable X and the f(X) column to the variable Y, then plot the data with a\nsemilog plot.\n>> X = fitData(:,1);\n>> Y = fitData(:,2);\n>> semilogx(X,Y, 'bd')\n%'bd' specifies blue diamond, unconnected data points\nWe need to provide Matlab with initial guesses for our coefficient values. At this point it's a good idea\nto plot our function to see if the data makes sense in regards to it. We can start by guessing 1 for both\ncoefficients; in a real experiment your prior knowledge of what you are measuring would determine\nthese guesses.\n>>hold on\n>>semilogx(X, (1 ./(1 + 1*X))\nNow let's have Matlab figure out the best fit (least squares sense) of the data to this function, then plot\nthe data and fit together.\n\n>> Cfs = LSQCURVEFIT(@myfun, [1 1], X, Y)\n>> hold off\n>> semilogx(X,Y, 'bd', X, (Cfs(1)*X ./(1 + Cfs(2)*X)), 'k-') %what does 'k-' do?\nHere we plotted two sets of data in the same command. See the help file for semilogx to understand\nhow this works. Notice that although our guess wasn't very good, Matlab had no trouble finding good\ncoefficients. This won't always be the case with more complicated data and functions.\nAdditional Resources:\nMIT's MATLAB answer page: http://web.mit.edu/answers/matlab/\nAnother MATLAB tutorial, with additional material on looping and solving ODE's in MATLAB:\nhttp://openwetware.org/images/7/76/MatlabTutorial2.pdf"
    },
    {
      "category": "Resource",
      "title": "module2_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/f357cf9b7e84cf4df25328a70711588d_module2_5.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nLab Exercise: Sampling, Aliasing, and Digital Data\nContents\n1 Objectives\n2 Lab Procedures\n2.1 The LabVIEW Spectrum Analyzer . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2 RC Filters Redux . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.3 Sampling and Aliasing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.4 LabVIEW to MATLAB . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3 Completion Requirements\nObjectives\n1. Gain a deeper understanding of how a computer records and analyzes signals.\n2. Experiment with observing power spectra with the LabVIEW Spectrum Analyzer.\n3. Understand how sampling affects the frequency-domain description of a signal.\nLab Procedures\n2.1\nThe LabVIEW Spectrum Analyzer\nUse this section to familiarize yourself with how a spectrum analyzer works.\n(A) Open the Spectrum Analyzer VI (SpectrumAnalyzer.vi) which you will find on the PC\ndesktop. Plug the output of your function generator into ch1 of your scope and into ach0\nof the DAQ board.\n(B) Once the VI is open, press the arrow button at the top left of the toolbar to run it, or choose\n\"Run\" (Ctrl-R) from the Operate menu. To stop it, use the \"stop\" button in the VI, or the\nRed \"Stop Sign\" button on the toolbar (refer to Figure ??).\n(C) As a starting point, use a sampling rate of 100kHz, and leave the other parameters at their\ndefaults. Look at the spectra for several waveform types (no offset) at a few kHz. Compare\nthe spectra for a sinusoid, a triangle wave, and a square wave.\n(D) As your lab instructor if you'd like to discuss some issues of digital sampling and features of\nthe spectrum analyzer.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n2.2\nRC Filters Redux\nUse the spectrum analyzer to look further at filter transfer functions, similarly to HW1. Note that\nthe spectrum analyzer discards phase information. This stems from the way that a computer esti\nmates power spectra, using Discrete Fourier Tranform (DFT) and Fast Fourier Transform (FFT)\nalgorithms.\n(A) Instead of using the function generator as a signal source, we'll use an AM502 differential\namplifier to generate white noise. Leave both the amp's inputs unconnected and ground-\ncoupled (to get the noise output spectrum to be white), and connect the output to the scope\nand DAQ board. Turn up the gain of the \"noise source\" to 10K or 20K until the noise\namplitude is about 0.5V. You should see a flat spectral response on the spectrum analyzer\nplot.\n(B) Use this noise generator as the input to another AM502 amp with unity gain (gain knob at\n100, with ÷100 pushed in). Turn on the low-pass filter for this second amp and set the cutoff\nfrequency fc where you'll see it on the Spectrum Analyzer. The output spectrum should look\nfamiliar. What's the slope of the roll-off? Experiment with changing the cutoff frequency fc.\n(C) As configured, this filter has a single pole. Add a second pole at the same frequency and verify\nthat the roll-off becomes twice as steep. (Remember, you can put more than one AM502 into\nyour rack).\n(D) Now switch to the high-pass configuration - turn off the low-pass filters, and turn up the\nhigh-pass knob. Does the spectrum look as you would expect? Use the oscilloscope to verify\nthat the filter actually does attenuate slowly varying signals. What's going on here? Why\nisn't the spectrum analyzer giving you an accurate representation? (The next section will\nhelp answer this).\n2.3\nSampling and Aliasing\nWe'll now see how digital sampling affects a signal. Because sampling takes \"snapshots\" of a signal,\nspaced apart at certain time intervals, some of the information in the signal may not be captured.\nHowever, understanding the limitations allows for powerful computer-based analysis.\n(A) Set your function generator to output a 10kHz triangle wave. Set the LabVIEW sampling\nfrequency to 100kHz. What is the Nyquist frequency at this sampling rate? Explain what is\nhappening to the spectrum of the triangle wave under these conditions? See what happens\nto the spectrum (specifically to the aliased peaks) if you shift the triangle wave's frequency\nup and down.\nGenerally one of two things can be done to cope with aliasing. If the capability exists, increasing\nthe bandwidth of the spectrum will fit more data on the upper end of the frequency range. If that\nisn't possible, we can at least remove the aliased components from the visible spectral region, so\nthey are not interfering with data in the spectral region you can see.\n(B) Keeping the base triangle-wave frequency at 10kHz, what can you do with your spectrum\nanalyzer parameters (i.e. in software) to increase the bandwidth?\n(C) You can also improve the aliasing situation with hardware by using an anti-aliasing filter.\nThe purpose is to block the signal components that are too high in frequency to be correctly\nsampled. Pass your triangle-wave signal through a diff. amp. set to unity gain and with a\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nlow-pass filter, choosing a cutoff which will attenuate frequencies above the Nyquist frequency.\nAs always, you can use multiple filters to improve roll-off.\n(D) Anti-aliasing filters turn out to be especially important when taking low-frequency noise mea\nsurements. Let's examine the low-frequency characteristics of the FG503 generator. Generate\na 1kHz triangle wave, but set your Spectrum Analyzer software parameters such that you see\nonly the frequencies from 0.1Hz to 100Hz. Notice what a difference the anti-aliasing filter\nmakes in this case. Save your data for both cases.\nAre there any drawbacks to using the anti-aliasing filter (take a look at the triangle wave on\nthe scope once you've applied the filter to it)? Can you think of a situation in which aliasing\nmight be useful, and how it could be used to the advantage of a measurement.\n(E) Go back to using an AM502 amp as a white noise source. Run its output through another\nAM502 amp with unity gain, and a high-pass filter with a low-frequency cutoff at 100Hz.\nObserve the output on the spectrum analyzer. Now you should be able to explain why the\nspectrum looks the way it does. What do you need to do to be able to see the low-frequency\nroll-off of this filter?\n2.4\nLabVIEW to MATLAB\nThe last thing you need to know is how to transfer out LabVIEW's spectral data for manipulation\nwith MATLAB.\n(A) The Spectrum Analyzer outputs its data to a two-column text file, with the first column\ncontaining the frequency data, and the second the amplitudes.\nTo import this data into matlab, use the load command (e.g. type Pxx=load('filename'),\nwhich will store the data in a two-column vector called Pxx). You can plot the amplitudes\nvs. the frequencies on a log-log scale by typing loglog(Pxx(:,2),Pxx(:,1)).\n(B) The Waveforem Acquisition VI saves its data to a file as a single column vector containing only\nthe voltage values. If you intend to use the time-domain information, you must separately\nrecord the sampling rate. You can likewise bring this into matlab using load.\nCompletion Requirements\nThis lab requires no formal report submission. If you have time, you should aim to complete the\nfollowing two tasks using the skills you've learned, and show them to your lab instructor.\n1. On a single set of axes, plot the spectrum of a waveform of your choice (sine, triangle, or\nsquare) acquired both with the Spectrum Analyzer VI, and with the time-domain Waveform\nAcquisition VI (the latter converted to a PSD using pwelch in matlab).\n2. Plot the low-frequency region (approx 0.1 to 100 Hz) of the FG503 function generator's\nspectrum when it's outputting a 1kHz triangle wave. Do this both with and without an\nappropriately chosen anti-aliasing filter."
    },
    {
      "category": "Resource",
      "title": "module2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/63ff36fe23a7030b2bf2d357aefc04c1_module2.pdf",
      "content": "20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nModule 2: Atomic Force Microscope\nContents\n1 Objectives and Learning Goals\n2 Roadmap and Milestones\n3 The 20.309 AFM System\n3.1 Hardware . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.1.1\nMotion control system . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.1.2\nOptical system . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.1.3\nCantilever probes for imaging . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.1.4\nCantilevers for thermal noise measurements . . . . . . . . . . . . . . . . . . .\n3.2 Major operational steps . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2.1\nPower-on . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2.2\nSignal connections and data flow . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2.3\nLaser alignment and diffractive modes . . . . . . . . . . . . . . . . . . . . . .\n3.2.4\nSample loading and positioning . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2.5\nEngaging the tip . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2.6\nCalibration and biasing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3 Software . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n3.3.1\nControls overview . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n3.3.2\nImage mode operation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n3.3.3\nZ-mod (force spectroscopy) operation . . . . . . . . . . . . . . . . . . . . . . 11\n3.3.4\nSaving AFM data . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n3.4 Additional instrumentation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n3.4.1\nDifferential amplifier . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n3.4.2\nLabVIEW VIs for signal capture . . . . . . . . . . . . . . . . . . . . . . . . . 13\n4 Experiment 1: Imaging\n4.1 AFM resolution limit . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n4.2 Measuring Image Dimensions . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n5 Experiment 2: Elastic Modulus\n5.1 Data Analysis . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 16\n6 Experiment 3: Measuring Boltzmann's Constant kB\n6.1 Theory: thermomechanical noise in microcantilevers . . . . . . . . . . . . . . . . . . 17\n6.2 Calibration and biasing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n6.3 Recording thermomechanical noise spectra . . . . . . . . . . . . . . . . . . . . . . . . 19\n6.4 Data analysis in MATLAB . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n7 Report Requirements\n7.1 Calibration and noise . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n7.2 Imaging . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n7.3 Elastic modulus . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n7.4 Measuring Boltzmann's constant . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 21\n8 Useful References\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nObjectives and Learning Goals\nLearn the function of the 20.309 AFM and the relationships between its components.\n-\nUnderstand how to extract quantitative information from this tool.\n-\nUse the AFM to take images, probe sample stiffness, and estimate the value of a fundamental\n-\nphysical constant.\nAnalyze the sources of uncertainty and noise in the system that limit the accuracy of mea\n-\nsurements.\nRoadmap and Milestones\nThe AFM will be the basis of three weeks' worth of experiments, and the roadmap below is subdi\nvided into weeks to help you gauge your progress.\nWeek 1:\n1. Learn the signal paths and connections of the system.\n2. Practice aligning the AFM optics.\n3. Learn how to calibrate the AFM to extract useful physical data.\n4. Measure the vibrational noise floor in the AFM system.\n5. Set up and prepare the AFM for imaging.\nWeek 2:\n1. Image several different samples with the AFM and measure the physical dimensions of imaged\nfeatures (Experimment 1).\n2. Use the AFM to measure the elastic modulus and surface adhesion force of several different\nsamples (Experiment 2).\nWeek 3:\n1. Use your knowledge of the AFM system and associated instrumentation to record the vibra\ntional noise spectrum of a cantilever probe (Experiment 3).\n2. Calculate the value of Boltzmann's Constant kB from the vibrational spectrum.\nThe 20.309 AFM System\nThis section describes the various components of the AFM you will use in the lab, and particularly\nhow they differ in operation from a commercial AFM. In lecture we will discuss the operational\nprinciples of a commercial AFM. You may also find it helpful to review some of the References in\nSection 8 at the end of this module.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nFigure 1: The AFM setup, with major components indicated.\n3.1\nHardware\nA photo of our AFM setup is provided in Figure 1 for you to refer to as you learn about the\ninstrument. Start by physically examining the setup and identifying all the parts described below.\n3.1.1\nMotion control system\nTo be useful for imaging, an AFM needs to scan its probe over the sample surface. Our microscopes\nare designed with a fixed probe and a movable sample (also true of some, but not all, commercial\nAFM systems). Whenever we talk about moving the tip relative to the sample, in 20.309 we\nwill always only move the sample. The sample is actuated for scanning and force spectroscopy\nmeasurements by a simple piezo disk, shown in Figure 2. The piezo disk is controlled from the\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nFigure 2: Schematic of the piezo disk used to actuate the AFM's sample stage. The circular electrode is\ndivided into quadrants as shown in (a) to enable 3-axis actuation. When the same voltage is applied to all\nquadrants, the disk flexes as shown in (b), giving z-axis motion. Differential voltages applied to opposite\nquadrants, produce the flexing shown in (c), which moves the stage along the x- and y-axes, with the help\nof the offset post, represented here by the vertical green line.\nmatlab scanning software, which is described in Section 3.3.\nFor vertical motion along the z-axis, there are\nthree regimes of motion:\nManual (coarse): turning the knob on the\nred picomotor with your hand (clockwise moves\nthe stage up).\nPicomotor (medium): using the joystick\nto drive the picomotor (pushing the joystick for\nward moves the stage upward).\nPiezo-disk (fine): actuating the piezo disk\nover a few hundred nanometers using the mat-\nlab software.\nFor x- and y-axis positioning (in the sam\nple plane), coarse movements are accomplished\nwith the stage micrometers, and fine (several\nμm) movements are also attained using the\npiezo disk.\n3.1.2\nOptical system\nOur microscopes use a somewhat different opti\ncal readout from a standard AFM to sense can\ntilever deflection. Rather than detecting the po\nsition of a laser beam that reflects off the back\nsurface of the cantilever, we measure the inten\nsity of a diffracted beam. To do this, a diode\nlaser with wavelength λ = 635nm is focused\nonto the interdigitated (ID) \"finger\" structure,\nand we observe the brightness of one of the re\nflected spots (referred to as \"modes\") using a\nphotodiode. This gives us information about\nthe relative displacement of one set of fingers\nrelative to the other -- this is useful if one set\nis attached to the cantilever, and the other to\nsome reference surface.\nFigure 3: A sketch of the interdigitated (ID) inter\nferometric fingers, with the detection laser shown in\ncident from the top of the figure. When the finger\nsets are aligned, as in the left box above, the even-\nnumbered modes are brightest, and odd modes are\ndarkest. When they displace relative to each other by\na distance of a quarter of the laser wavelength λ, the\nsituation reverses, shown on the right. This repeats\nevery λ/4 in either direction.\nCourtesy of John D. Alexander. Used with permission.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nAs the cantilever deflects, and the out-of-plane spacing between the ID fingers changes, the\nreflected diffractive modes change their brightness, as shown in Figure 3. However, a complication\nof using this system is the non-linear output characteristic of the mode intensities. As the out-of\nplane deflection of the fingers increases, each mode grows alternately brighter and dimmer. The\nintensity I of odd order modes vs. finger deflection Δz has the form\nI ∝ sin2\nμ 2π Δz\n¶\n,\nλ\nand for odd modes, the sine is replaced by a cosine. The plot in Figure 4(a) shows graphically the\nintensity of two adjacent modes as a function of displacement.\nThis nonlinearity makes the sensor's sensitivity depend critically on the operating point along\nthis curve at which a measurement is done. To make useful measurements, the ID interferometer\ntherefore needs to be biased to a spot on the sin2 curve where the function's slope is greatest\nmidway between the maximum and minimum, as sketched in Figure 4(b).\nDue to residual strain in the silicon nitride from which the cantilevers are fabricated, the relative\nplanar alignment of the two finger sets varies slightly over the area of the grating. This variation\nis typically a few hundred nanometers in the lateral direction. Therefore, the bias point of the\ndetector's output can be adjusted along the sin2 curve by moving the incident laser spot side to\nside on the diffraction grating.\n(a) The non-linear intensities of the 0th and 1st or-\n(b) The desired operating point for maximum de-\nder modes as a function of cantilever displacement\nflection sensitivity is sketched here on the sin2\n(from Yaralioglu, et al., J. Appl. Phys., 1998).\noutput characteristic of the ID fingers.\nFigure 4: The characteristic output of the ID interferometric sensor.\n3.1.3\nCantilever probes for imaging\nA few words about probe breakage: you will break at least a few probes - this is a normal part\nof learning to use the tool. We have a large, but not infinite supply of replacement probes. The\ncost of an individual AFM probe is not large, and the greater problem with breaking them is the\ntime lost to replacing the probe and realigning the laser.\nGra\nph\nof\ndet\nect\nor\noutp\nut v\ns. c\nanti\nleve\nr de\nflection, showing sinusoidal qualit\ny\nFigure by MIT OCW.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nExercise caution when moving the sample up and down, but don't\nlet this prevent you from getting comfortable moving the sample\naround. Under most conditions, the cantilevers are surprisingly flex\nible and robust. They are most often broken by running them into\nthe sample (especially sideways) - avoid \"crashing\" the tip into the\nsurface, or worse bumping the stage into the die or fluid cell. Make\nsure you're familiar with the motion control system (Sec. 3.1.1).\nThe probes we use for imaging are shown in Figure 5 with relevant\ndimensions. The central beam has a tip at its end, which scans the\nsurface. The shorter side beams to either side have no tips and remain\nout of contact. The side beams provide a reference against which the\ndeflection of the central beam is measured; the ID grating on either\nside may be used. When calibrating the detector output to relate\nvoltage to tip deflection, remember to include a correction factor to\naccount for the ID finger position far away from the tip.\n3.1.4\nCantilevers for thermal noise measurements\nFor noise measurement purposes, we'd like a clean vibrational noise\nspectrum, which is best achieved using a matched pair of identical\ncantilevers. The configuration with a central long beam and reference\nside-beams has extra resonance peaks in the spectrum that make it\nharder to interpret. With the geometry shown in Figure 6 the beams\nhave identical spectra which overlap and reinforce each other. Using\na pair of identical beams also helps to minimize any common drift\neffects from air movements or thermal gradients.\nThere are two sizes of cantilever pairs available. For the long\ndevices, L = 350μm and the finger grating starts 140μm and ends\n250μm from the cantilever base. For the short devices, L = 275μm,\nand the finger gratings begin 93μm and end 175μm from the base.\nThe width and thickness of all of the cantilevers is b = 50μm and\nh = 0.8μm, respectively.\n(a)\n(b)\n(a)\n(b)\nFigure 5: (a) Plan view and\n(b) SEM image of the imag\ning cantilever geometry. The\ncentral (imaging) beam dimen\nsions are length L = 400μm,\nand width b = 60μm. The fin\nger gratings begin 117μm and\nend 200μm from the base.\nFigure 6: (a) Plan view and (b) SEM image of the geometry of a differential cantilever pair. Because the\nbeams are fabricated so close together, we assume that their material properties and dimensions are identical.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.2\nMajor operational steps\n3.2.1\nPower-on\nFor our AFMs to run, you must turn on three things: (1) the detection laser, (2) the photodetector,\nand (3) piezo-driver power supply. The photodetector has a battery that provides reverse bias, and\nthe others have dedicated power supplies (refer to Figure 1 for where these switches are located).\nWhen you finish using the AFM, don't forget to turn off the three switches you turned on at the\nbeginning.\n3.2.2\nSignal connections and data flow\nThe first key step to using the instrument is\nproperly connecting all of the components to\ngether. Figure 7 will help to guide you.\nThe AFM itself requires two signal inputs\n(Xin and Yin) to drive the piezo actuator,\nwhich connect to the electronics board on the\nback of the headplate. They are provided by\nthe computer's digital signal outputs (dac0out\nand dac1out). The computer also needs to\nread these signals in, together with the AFM\nsignal output, so these become the three DAQ\ninputs.\nThe output from the AFM's photodetector\nis a current signal proportional to the brightness\nof the laser spot, which needs to be converted to\na voltage (a 100 kΩ resistor to ground is suffi\ncient). It's good to be able to amplify and offset\nthis voltage at our convenience, so run this sig\nnal through an AM502 amplifier before it enters\nFigure 7: Schematic of signal connections.\nthe DAQ.\nFinally, during calibration, it's very useful to watch the detector signal as a function of stage\nmovement in realtime, on the oscilloscope screen, so run those signals to the scope as well.\n3.2.3\nLaser alignment and diffractive modes\nTo get a cantilever position readout, the laser needs to be well focused on the interdigitated fingers\nof the cantilever. Use the white light source and stereo-microscope to look at the cantilever in its\nholder. The laser spot should be visible as a red dot (there may be other reflections or scattered\nlaser light, but the spot itself is a small bright dot). Adjust its position using the knobs on the\nkinematic laser mount, until it hits the interdigitated fingers (use the cantilever schematics in\nFigures 5 and 6 as a reference).\nWhen the laser is focused in approximately the right position, the white \"screen\" around the\nslit on the photodetector will allow you to see the diffraction pattern coming out of the beam\nsplitter. Observe the spot pattern on this screen while adjusting the laser position until you see\nseveral evenly spaced \"modes.\" Make sure you aren't misled by reflections from other parts of the\napparatus -- some may look similar to the diffraction pattern, but aren't what you're looking for.\nWhen you see the proper diffraction pattern is on the detector, adjust the detector's position\nsuch that only one mode passes through the slit. Typically the 0th mode gives the largest difference\nbetween bright and dark.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.2.4\nSample loading and positioning\nCorrectly mounting a sample in the AFM is a key part of obtaining quality images. Our samples\nare always mounted on disks, which are magnetically held to the piezo actuator offset post. The\nAFM can image only a small area near the center of the opening in the metal cantilever holder, so\nbe sure that the area of interest for imaging ends up there.\n(a) A photo of the underside of the can-\n(b) A close-up view of the opening into\ntilever mount, with the sample disk\nwhich the sample rises, showing the can-\nlowered for changing samples.\ntilever die and sample disk.\nWhen changing or inserting a sample disk, the 3-axis stage must be lowered far enough for\nthe disk to clear the bottom opening of the cantilever mount, as shown in the figures above. This\nrequires a large travel distance, so exercise caution when bringing the sample back up to the\ncantilever, and take care not to crash the tip.\nIn addition, as you change samples, it is critical to reposition the offset post as nearly centered\nas possible on the actuator disk, to ensure true horizontal motion in the x-y plane (Centering the\nsample disk at the top of the offset post is not critical; rather, it's the position of the bottom end\nof the post on the piezo scanner disk. For instance, in figure 8(b) above the sample disk is\nvisibly off-center, which is not a problem).\n3.2.5\nEngaging the tip\nThe process of bringing the probe tip to the sample surface so we can scan images and measure\nforces is called \"engaging.\" The aim is to get the tip in close proximity so it is just barely coming\ninto contact, and bending only slightly. If the probe does not touch the surface, it is obviously\nuseless, but if it's bent too much against the surface, it is equally useless.\nBefore engaging, start the piezo z-modulation scan in the matlab software (see Sec. 3.3.3). Be\nsure the mode switch on the AFM electronics board is flipped down to \"force spec. mode,\" and\nmake sure to turn on the piezo power supply. Carefully bring the tip near the surface, first turning\nthe red motor knob by hand, then very slowly with the joystick. When you make contact, you will\nsee the modes on the photodetector fluctuate in brightness. Because of the device geometry, only\nthe central long cantilever with the tip will make contact with the sample surface.\n3.2.6\nCalibration and biasing\nAt this point, it's worth pausing to review the definition of calibration, as well as the distinction\nbetween sensitivity and resolution - terms which will often used frequently in this context, but\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nwhose precise meaning isn't always made explicit. Be sure you're clear on the differences between\nthem.\nCalibration - finding the relationship between the output of your instrument to the physical\nquantity you are measuring like distance or force; in our case, relating the mode brightness\nmeasured by the photodiode to cantilever tip deflections\nSensitivity - a numerical expression for the calibration, the \"slope\" of a transducer output e.g.\nmV/N, W/ A, or in our case nm/V\nResolution - the minimal measurement or change in signal that an instrument can detect; depends\ncompletely on the noise and the frequency and bandwidth of the measurement\nIt's a good idea to run a calibration before performing any measurement, because they varies\nfrom AFM to AFM, and may be thrown off by drifts or disturbances. We calibrate our AFM in\nforce spectroscopy (or z-modulation) mode, in which the sample is only moved straight up and\ndown (see Section 3.3.3 for details).\nWatching the AFM signal on the oscilloscope in x-y mode, (with detector output on the y-axis,\nand the stage actuation signal on the x-axis) you should see something like the plots shown in\nFigure 9: a flat line that breaks into a sin2 function at a certain x-value (whether it starts upward\nor downward depends on the mode you choose). The flat line is the cantilever out of contact, and\nthe oscillating section is the cantilever bending, after making contact with the sample.\nIf necessary, use the offset on the voltage amplifier to position the sin2 so that it is centered\naround zero. Then, set the out-of-contact bias point by moving the position of the laser focus on\nthe fingers until the flat section of your force spec. curve is approximately at zero volts, halfway\nbetween the maximum and minimum, as in Figure 9(c).\n(a) Bias too high.\n(b) Bias too low.\n(c) Bias set to optimal sensitivity for\nout-of-contact.\nFigure 9: Proper setting of the bias point.\nThe goal of this calibration process is to relate the detector's voltage signal to physical tip\ndeflection - i.e. how many nm is the cantilever tip bending for every volt of signal. We can take\nadvantage of the fact that a mode's brightness goes from fully bright to fully dim (peak to trough\non the sin2) as the fingers deflect through a distance of λ/4 (≈ 160 nm). This should allow you to\ncalculate the relationship between deflection and y-axis voltage in nm/V.\nFinally, you will also need to multiply the calibration by a correction factor Acorr to account\nfor the location of the diffraction fingers with respect to the tip of the cantilever. Acorr can be\nestimated most simply by assuming a quadratic shape for the bent cantilever Acorr = 1/m2 , where\nID\nmID = LID/LT is the ratio of the distance of the ID fingers from the cantilever base to the total\ncantilever length. A more precise expression is Acorr = 2/(3mID\n2 -mID\n3 ) (derived from the equation\nfor the shape of a simple rectangular beam, with an applied end-load).\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.3\nSoftware\nThe software that interfaces with the AFM is an application that runs in matlab. Its graphcial\nuser interface (GUI) is launched by typing 'scannergui' in the matlab command window. Its\nmain function is to systematically scan the probe tip back-and-forth across the sample, recording\nthe cantilever deflection information at each point, line by line, and assembling that data into an\nimage. Figure 10 shows a screen capture of the scanner control window, and an overview of its\noperation is provided below.\nFigure 10: The Scanner GUI window. The AFM is scanning a 12 × 12μm area, at a rate of one line per\nsecond, and is currently near the bottom of the image.\nScreenshot from LabVIEW software removed due to copyright restrictions.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.3.1\nControls overview\nMany of these are self-explanatory, such as the start imaging and stop buttons, as well as the\nimage area in the lower right, which displays the image currently being scanned. Some notes are\ngiven below on features that are not immediately obvious.\nTo begin with, it's easiest to simply use the default settings on all these controls, and to\nexperiment with changing them as you become more familiar with the tool.\nScan Parameters - The Scan size sets the length and width of the image in nanometers (always\na square shape), but its accuracy depends on having the correct value for Scan sensitivity\n(which should already be set for you, but may require calibration). The Scan frequency (lines\nper second) sets the speed of the tip across the surface, and together with the Number of lines\naffects the amount of detail you will see in the image. Setting the Y-scan direction tells the\nscanner whether to start at the top or the bottom of an image, and the trace/retrace selector\ndetermines whether each line is recorded as the tip scans to the left or to the right.\nScope View - As the tip scans back and forth, this plots the tip deflection data for each line.\nUseful for quantitative feature height measurements.\nScanner Waveforms - Shows the voltage waveforms driving the piezo scanner, for each scan line\nthat is taken. Helpful for knowing where in the image the current scan line is located, and\nthe output level of the waveforms driving the scanner.\nZ-mod Controls - These are only active during a z-mod scan, and have no effect when taking an\nimage. For more on this mode, see Section 3.3.3.\n3.3.2\nImage mode operation\nThis is the primary operating regime of the AFM, and provides a continuous display of the surface\nbeing scanned, as the probe is rastered up and down the image area. To use this mode, the switch\non the back of the AFM must be flipped upward. Remember that the maximum scan area is\nonly abut 15 μm square, and adjusting the position of the sample under the tip requires only the\nsmallest movements of the stage micrometers. Finally, keep in mind that there is always a delay\nafter pressing start imaging before the scan begins, as the actuator drive signals are buffered to\nthe I/O hardware.\n3.3.3\nZ-mod (force spectroscopy) operation\nIn this mode, the piezo moves the sample only along the z-axis - i.e. straight up and down (hence\nz-mod, short for z-modulation). To use this mode, the switch on the back of the AFM must be\nflipped downward. The default frequency and amplitude of 2 Hz and 8 V provide a nice force curve.\nBesides being critical for calibrating and biasing the readout, this mode is used to perform force\nspectroscopy experiments, in which tip-sample forces can be measured as the tip comes into and\nout of contact with the sample.\n(Note that the red stop button is also used to stop a z-mod scan).\n3.3.4\nSaving AFM data\nThe software allows you to save the raw data of both images as well as force curves. Unsurpris\ningly the \"Save Image\" and \"Save Force Curve\" buttons do this. In both cases an instantaneous\n\"snapshot\" of the current image or force curve is written to the file location specified in the entry\nbox at the bottom of the window.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nAn image is written to a files as a square matrix (interpolated to have the same number of rows\nand columns), with the value at each point representing height data. Force curve data is saved as\ntwo columns: x-axis (stage deflection) data in column one, y-axis (mode intensity) in column two.\nIf you intend to save an image, it is best to set the filename before starting the scan - the\nfilename box behaves . . . elusively while the scanner is running due to some peculiarities of the\nsoftware.\nAs a final note, a \"quick and dirty\" way to save an image is by simply doing a screen capture\nwhile the AFM is scanning (press \"Print Screen\" on the keyboard). The captured image can then\nbe pasted into MS Paint (Programs\nAccessories\nPaint) and cropped to leave only the scanned\n→\n→\nAFM image. These images can be imported into matlab for analysis/processing (we'll do this in\nlater parts of the course).\n3.4\nAdditional instrumentation\n3.4.1\nDifferential amplifier\nThe Tektronix AM502 is a differential amp, so it\namplifies the voltage difference between the two in\nput signals. Both inputs have DC, AC, and GND\ninput coupling, like the scopes. The amp can be\nused single-ended if the (-) input is left unconnected\nand ground-coupled. The gain (amplification fac\ntor) ranges from 1 to 10,000, and is set by the red\nknob together with the \"÷100\" button above it.\nThe instrument also has high- and low-pass fil\nters. These are somewhat confusingly labeled \"HF\n3dB\" and \"LF-3dB\" (see Figure 11). This doesn't\nmean \"high-pass\" and \"low-pass,\" but refers to the\n\"high [cutoff] frequency\" of a LPF and the \"low\n[cutoff] frequency\" of a HPF. Therefore, HF-3dB\nis the low-pass filter, and LF-3dB is the high-pass\nfilter.\nBoth filters are considered \"off\" when the low-\npass is turned all the way up, and the high-pass all Figure 11: An AM502 differential amplifier. The\nthe way down.\ngain is determined by the central red knob, to-\nFinally, the lower (high-pass) filter knob also gether with the ÷100 button in the center above\nhas two settings for controlling output signal DC it.\nlevel: dc and dc offset. When set to dc, the\namp outputs the actual DC level of the input signal, multiplied by the gain. Set to dc offset,\nyou can manually adjust the DC level using the knob at the upper right of the AM502. In both\ncases, the AC component is simply added on top.\nPhoto removed due to copyright restrictions.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3.4.2\nLabVIEW VIs for signal capture\nThe spectrum analyzer\nFigure 12: The LabVIEW Spectrum Analyzer VI runs continuously until the stop button is pressed. Each\nPSD is averaged with all the data that precedes it, so the spectrum gets cleaner the longer you acquire.\nNote that the \"PSD controls\" (Nfft, downsampling) can be changed on the fly, but to change the sampling\nrate you must stop and re-start the VI. Pressing \"Stop and Save Data\" pops up a window in which you can\nchoose a file name to store the spectrum currently displayed.\nTime-domain signal capture\nFigure 13: The LabVIEW Waveform Acquisition VI does a \"one-shot\" waveform capture in the time domain.\nPre-set your desired parameters, including sampling rate, length of captured waveform, and filename to save\nto, then press the Run (arrow) button to do the data capture. What you've captured appears in the waveform\nplot.\nScreenshot from LabVIEW software removed due to copyright restrictions.\nScreenshot from LabVIEW software removed due to copyright restrictions.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nExperiment 1: Imaging\nThe general approach to imaging is to (1) set the overall output signal range and offset while in the\nz-mod regime, (2) stop the z-mod scan and engage the probe with the surface, and (3) carefully\nadjust the cantilever deflection to give the desired bias point, and (4) start the image scan.\nCorrect biasing is key to obtaining good images. If you are not yet comfortable with choosing\nand setting an appropriate bias point for the cantilever's optical readout, it is worth reviewing that\nmaterial from Section 3.2.6.\nFor imaging, maximum out of contact sensitivity is not the goal. Instead, the sensitivity should\nbe greatest when the probe is engaged, and exerting a small force on the surface. The more force\nthe probe applies to the surface, the more wear and damage to the probe and surface can result.\nThe samples available for imaging are calibration gratings, various integrated circuit chips,\nand E. coli bacteria on a silicon dioxide surface. With the latter two, you may need to navigate\naround the surface in order to find interesting features to image. Unfortunately, unlike commercial\ninstruments, our AFMs do not have an integrated optical viewing system, so when positioning the\nsample it is difficult to determine exactly what spot on the sample the probe tip will scan. Use the\nstereo-microscope (at moderate magnification) and a fiber-light to observe the tip and position it\nas well as you can. Temporarily turning off the sensing laser will make it easier to see. You can\nmove the sample \"on the fly\", as you're imaging, but it takes some practice to make small enough\nstage movements. You will also likely have to readjust the bias point (also fine to do on the fly).\n4.1\nAFM resolution limit\nResearchers using the AFM always need to know their noise-limited resolution. Therefore, we will\ncharacterize the noise floor of the system, so we know what performance to expect.\nThe simplest way to do this is to look at the root-mean-square (RMS) noise, which represents the\naverage fluctuations that will obscure features in AFM images. RMS noise data is easily obtained\nby recording a length of the output signal in the time domain (using the VI from Sec. 3.4.2), and\nanalyzing the data in matlab.\nYou should capture and calculate the RMS noise of the AFM both out of contact and in\ncontact with the sample surface. Make sure you don't lose your calibration, especially when you\nbring the AFM into contact - it's easy to move to a different point on the output curve.\nYou may also find it instructive to look at the noise output signal using a Spectrum Analyzer\n(LabVIEW VI in Sec. 3.4.2) to see whether the noise is concentrated in particular spectral regions.\n4.2\nMeasuring Image Dimensions\nWhen it's necessary to determine the size of imaged features, the Scan size control is most helpful.\nThis gives the size of the image square, which can be related to imaged feature dimensions.\nNOTE: the Scan sensitivity is pre-calibrated to 900nm/V, but if you would like more precise\nlateral feature measurements, it's worth verifying this. This can be done by scanning a reference\nwith precisely known feature sizes (such as a calibration grating), and adjusting the Scan sensitivity\nuntil the actual image size matches the Scan size setting.\nFinally, feature height (z-axis) measurements can be made by observing the Scope View of\nthe AFM software. The waveform display shows the feature height dimensions as voltages - the\ncalculated calibration factor then gives corresponding feature sizes.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nExperiment 2: Elastic Modulus\n[For these measurements, we'll use the shortest and stiffest cantilevers available to us, which will\ngive the best signal. These have very similar geometry to the long cantilevers in Figure 5, but have\na length of 250μm, and a width of 50μm. The fingers begin 43μm from the base and end 125μm\nfrom it. Ask your lab instructor to provide you with a short cantilever when you are ready.]\nAs you know, some of the most useful applications of AFMs in biology take advantage of their\nability to measure very small forces. We'll use this capability to measure the elastic moduli of\nsome soft samples, to simulate mapping cell wall elastic properties, similarly to the 2003 paper by\nTouhami et al.1\nAs seen in this paper, when using the optical lever sensor, samples with different elastic moduli\nchange the slope of the in-contact portion of the force curve. For our non-linear ID sensor, the\nequivalent of changing the slope is a changing period for the sin2 function. Just as softer samples\ncause lower slope with the optical lever, softer samples give the output function of the ID sensor a\nlonger period, with greater spacing between the peaks (see figure 14(a) below).\n(a) Force curves for samples of varying hard-\n(b) Preferred biasing and calibration on a hard\nness. The green (solid) curve is for a hard\nsurface for measuring elastic modulus, and\nsample, the red (dashes) curve is softer, and\ncorresponding physical stage movement\nblue (dots) curve is softest.\nThe approach for measuring modulus is to first take a force curve on a reference sample, con\nsidered to have infinite hardness. We will use a bare silicon nitride surface. This allows us to\ndetermine how the x-axis signal corresponds to stage movements.\nYou'll want to bias this measurement similarly to measuring noise - the output should be at\nthe middle of the output range when out of contact (See Fig. 14(b)).\nAfter your measurement of the hard sample, switch to the more compliant PDMS elastomer\nsamples, and run force curves on them.\nMake sure to save these force curves for later analysis, described in Section 5.1.\nTo get good force curves:\n1. Don't change the biasing or laser position between samples - if you do, the force curves you\nget can't be compared one to another.\n2. Careful initial biasing at the middle of output range is worth it -- this will make a big\ndifference in ease of data analysis.\n1A. Touhami, B. Nysten, and Y. F. Dufrˆene, \"Nanoscale Mapping of the Elasticity of Microbial Cells by Atomic\nForce Microscopy,\" Langmuir 19(11), 4539-43 (2003).\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n3. After you've brought each sample into contact and are satisfied with the Z-modulation range,\nrun the scan at slow speed (e.g. 0.5Hz) for the cleanest force curves.\n5.1\nData Analysis\nAccording to Touhami et al., the depth δ of an indentation made by a conical tip (approximately\ntrue for ours) is related to the applied force F by\nμ\nE\n¶\nF =\ntan α\nδ2 ,\nπ\n1 - ν2\nwhere α is the half-angle of the conical tip, and E and ν are the elastic (Young's) modulus and the\nPoisson's ratio of the substrate material, respectively.\nSubstituting in appropriate values for α (35.3*) and ν (0.25), we are left with\nF = 0.60Eδ2 ,\nin which we need only the force and indentation δ values to calculate modulus.\nThe force F is calculated by treating the cantilever as a Hookian spring, which obeys the law\nF = -kz, where k is the spring constant and z the tip deflection. For the 250 μm long cantilever,\nassume a spring constant of 0.118 N/m.\nFinally, all that remains is to calculate indentation depths for the soft materials from the\ndifference in the period of the sin2 output between their force curves and the one for the hard\nsample. Corresponding forces are derived from the cantilever deflection. Don't forget at all points\nto include the factor that relates cantilever tip deflection to finger deflection.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nExperiment 3: Measuring Boltzmann's Constant kB\n6.1\nTheory: thermomechanical noise in microcantilevers\nFor simplicity of analysis, we model the cantilever as a harmonic oscillator with one degree of\nfreedom, similar to a mass on a spring, as discussed in lecture. According to the Equipartition\nTheorem, the thermal energy present in the system is simply related to the cantilever fluctuations\nas follows:\nkBT = k\nD\nΔz 2E\n,\nwhere hΔz2i is the mean-square deflection of the cantilever, T is the absolute temperature, k is the\ncantilever spring constant, and kB is Boltzmann's Constant (yes, this notation can be confusing -\ntake care to keep these ks straight).\nThe characteristic transfer function of the second-order resonant system has the form\ns\n4kB T\n�\n\n|G(ω)| =\nQkω0\nω2 2\n1 ω2 ,\n+\n1 - ω2\nQ2 ω2\nin whichω0 and Q are the (angular) resonant\nfrequency and quality factor, respectively.2\nAt\nlow frequencies, (ω ¿ ω0) this expression yields\nwhat's called the \"thermomechanical noise limit\"\n(see Figure 14 for an illustration):\ns\n4kBT\nδ =\n.\nQkω0\nFigure 14: A data plot of a cantilever's noise spec\ntrum, with an ideal transfer function G(ω) fit on top\nThese relations suggest several possible ap-\n(dark line). Note that G(ω) is flat at low frequen\nproaches that can be taken for determining kB ,\ncies, at the thermomechanical limit, as indicated. In\nfor which you will need the values of several pa-\ncontrast, real data has more 1/f-type noise present\nrameters. These include (1) the quality factor Q\nat lower frequencies (see Section 6.3).\nand resonant frequency ω0 of the resonator (2) the\ncantilever's mean-square deflection hΔz2i, and (3)\nits spring constant k.\n1. The quality factor and resonant frequency can be obtained from taking the noise PSD\nof the vibrating cantilever. If your intuitive sense for them is good, you can estimate these\nquantities directly from the plot, or determine them more precisely by fitting an ideal transfer\nfunction to the noise data, and extracting the fitting parameters (more on this in Section 6.4).\n2. The mean-square deflection is readily available from either time-domain or PSD data of\nthe cantilever thermal noise. Recall that these are related through Parseval's theorem as\nfollows:\nD\nΔz 2E\n=\nZ inf\nS(ω)dω ,\nwhere S(ω) is the PSD function of Δz. By now, you know enough MATLAB spectral analysis\ntechniques to make these caculations.\nIf you'd like to understand how this function is derived in greater detail, see M. Shusteff, T. P. Burg, and\nS. R. Manalis, \"Measuring Boltzmann's constant with a low-cost atomic force microscope: An undergraduate exper\niment,\" Am. J. Phys. 74(10), pp. 873-9, (2006).\nGra\nph\nof\nPSD\nvs.\nFre\nquen\ncy.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nYou will likely find that simply using the mean-square noise value and Parseval's theorem\nwill not give you a good result (why?). Instead, the approach in Section 6.4 will work much\nbetter.\n3. The spring constant (stiffness) can be analytically calculated from geometrical parameters\nin two ways (see Section 3.1.4 and Figs. 5 and 6 for cantilever dimensions). From basic\nmechanical beam-bending analysis of a rectangular cantilever the stiffness k can be expressed\nas\nEbh3\nk =\n,\n4L3\nin which E is the elastic (Young's) modulus of the beam material, and L, b and h are the\nlength, width, and thickness of the beam, respectively (b is used for the width to avoid\nconfusion with angular frequency ω).\nThis method, however, does not always yield accurate results -- can you suggest why? An\nother analytical model for the spring constant was devised by Sader and coworkers3, and it\nrelies on measuring the cantilever's resonant frequency:\nk = 0.2427ρchbLω2 ,\nvac\nwhere ρc is the mass density of the material, L, b, and h are the same geometrical parameters\nas above, and ωvac is the cantilever's resonant frequency in vacuum. For the purposes of these\ncalculations, you can assume that the resonant frequency that you will measure in air ωair\nis 2% lower than ωvac. (remember the factor of 2π when interconverting between ω and f in\nyour equations).\nSuitable material parameters to use for the low-stress silicon nitride (SixN), out of which\nthese cantilevers are made are ρc = 3400kg/m3, and E = 250GPa. Dimensions are given in\nSection 3.1.4\n6.2\nCalibration and biasing\nFor the accuracy of this measurement, it's especially\nimportant that the signal be biased at the maximum-\nslope position along the output curve when it's not in\ncontact with the surface.\nBy now you're familiar with aligning, calibrating,\nand biasing your AFM. The major difference in this\ncase is how you'll actually perform the z-modulation\nscan for the calibration.\nBecause this device is a pair of identical cantilevers,\nsimply bringing it down to a surface will deflect both Figure 15: Using the edge of a sample to bend\nbeams equally. A z-mod scan will show approximately only one beam of a differential cantilever pair.\nzero deflection of one beam relative to the other. In\nstead, we want to bend only one of the beams, while keeping the other unbent.\nTo do this, you'll use a sample with a sharp step edge. The goal is to position the cantilever\npair above this edge such that one of the beams will be on the surface, and the other will hang in\nfree space (sketched in Fig. 15). A z-mod scan should then deflect only one of the beams, giving\nus the calibration curve we want. (Note: reflections of the laser from the edge of the substrate can\n3J. E. Sader, et al, \"Calibration of rectangular atomic force microscope cantilevers,\" Review of Scientific Instru\nments, 70(10):3967-3969, 1999.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\ninterfere with the diffractive modes. If this is the case, try repositioning the sample edge, perhaps\nusing only the corner to bend one of the cantilevers, until the sin2 shape improves.)\n6.3\nRecording thermomechanical noise spectra\n[Of the two cantilever sizes available, choose either size to make your measurement, and work on\nthe second size time permitting. If you do not have enough time to do both, exchange data with a\ngroup that measured the other size, and note in your notebook and report with whom you shared\ndata.]\nOnce you're satisfied with your calibration and bias point, withdraw the lever's tip from the\nsurface, making sure that the bias point stays where you set it. Gain up the signal using the AM502\nvoltage amp, and use the LabVIEW spectrum analyzer to record the thermal noise signal coming\nfrom the freely vibrating cantilever. Once you are happy with how the spectrum looks, save it to\na .txt file of your choise.\nYou only need to measure the noise spectrum down to about 50-100 Hz. Below this frequency,\n1/f-type or \"pink\" noise dominates. You are welcome to measure this if you are interested, but\nit is of limited use for determining kB. For very low-frequency measurements, anti-aliasing and\nproper input coupling becomes very important. If you are interested in this, your lab instructor\ncan provide guidance.\nSome guidelines for getting a good noise spectrum:\nChoose a sampling frequency at least 2× higher than the highest frequency of interest, or\n-\nabout 10× higher than the first resonance peak of the cantilever.\nUse AC coupling on your voltage amplifier, and use a gain of 100-1000.\n-\nIf necessary, add a low-pass anti-aliasing filter (recall Module 1) at an appropriate frequency\n-\nto eliminate high-frequency components being \"folded\" over into the frequency region of\ninterest.\nRecall from the previous lab that, if you prefer, you can also measure the time-domain signal\n-\ndirectly, and later calculate its PSD in MATLAB. You can decide which technique you prefer.\n6.4\nData analysis in MATLAB\nOnce you bring your saved PSD data from LabVIEW into matlab ([Fvec,PSDvec]=load('filename')\nis the syntax you want), you can manipulate it as you wish. To fit the second-order transfer function\nG(ω) to the noise data, we'll use the lsqcurvefit routine from matlab's optimization toolbox.\nWe're aiming to do something similar to what you see in Figure 14, where an ideal function is\noverlaid on real noise data.\nTo make the fit converge easily, we'll separate the nonlinear f0 and Q parameters from the\nlinear scaling factor. When doing the fitting, it is helpful not to use the whole frequency range\nof your data. Instead, crop your PSD data to a suitable range around the resonant peak - the\nvectors xdata and ydata used below are cropped PSD frequency and magnitude data, respectively,\nextracted from Fvec and PSDvec.\nFirst, you'll need a matlab function transfunc to generate the unscaled transfer function (i.e.\nthe thermomechanical noise scaling factor is 1 here - refer to the equations in Sec. 6.1):\n|G(ω)| = r3\n1 - ω2 2 + 1 ω2 .\nω2\nQ2 ω2\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nThe function takes the f0 (note that this is real frequency in Hz, and not angular frequency in\nrad/sec) and Q parameters as input, with a vector of frequencies, and outputs corresponding PSD\nmagnitude data:\nfunction [output]= transfunc(params,xdata)\n% params [f_0 Q]\nx=xdata/params(1);\n% x-matrix to contain freq. points normalized to f/f_0\noutput=sqrt(1./((1-x.^2).^2 + (x/params(2)).^2));\nThen, create a function scaling to do the linear scaling, and calculate the thermomechanical\nnoise level (the left-divide operation actually does a least-squares fit):\nfunction [y]=scaling(params,xdata,ydata)\nunscaled=transfunc(params,xdata);\nA=unscaled\\ydata;\n% note the left-divide here!\ny=unscaled*A;\nFinally, use the lsqcurvefit routine, supplying an appropriate initial guess for f0 and Q:\noptions=optimset('TolFun',1e-50,'tolX',1e-30);\np=lsqcurvefit('scaling',[f_guess Q_guess], xdata, ydata, [ ], [ ], options, ydata);\nThis will return the best f0 (again in Hz, not in rad/sec) and Q parameters after the fit as a two-\nelement vector p. Now you just need the scaling pre-factor, which you can get by left-dividing the\nfull-range fit function by the PSD magnitude data (the left-divide again gives you a least-squares\nfit \"for free\"):\nA=(transfunc(p,full_xdata))\\full_ydata;\nHere full xdata and full ydata are the full-range frequency and magnitude PSD vectors,\nrather than just the cropped sections used for the fit algorithm. You can now see how well the fit\nworked, by plotting it on top of the original PSD data:\nGfit = A*transfunc(p,full_xdata);\nloglog (full_xdata, Gfit);\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nReport Requirements\nThis lab report is due by noon on Friday, Oct. 27.\n7.1\nCalibration and noise\n1. For each measurement you perform, briefly describe the calibration you carried out, and\nthe calculations for the calibration factor in each case. Remember to take into account any\namplifier gain, geometric factors, etc. that affect the value of the signal.\n2. Using your calibration factor, determine the RMS noise of the system both in and out of\ncontact, in nanometers. Are there particular spectral regions at which noise is greatest?\n3. Based on your calculations, can these AFMs resolve atoms? What about DNA? Large globular\nproteins? Cells?\n7.2\nImaging\n1. Choose 2-3 samples from those available. For each one, center on an area or feature of interest\n(e.g. a single E. coli bacterium) and take a high-resolution scan (at least 1Hz and 32 lines\n- but go as fine as you like). This scan should be approximately 3-5μm square. Include a\ncapture of this scan in your report.\n2. Determine the lateral (x- and y-axis) dimensions and the vertical (z-axis) height of the object\nor feature. Indicate these either directly on the image, or in the image caption/description.\n3. Comment on what you think the resolution limit of your AFM is (lateral and vertical). Your\nnoise measurements should help your thinking. How small of a \"bump\" can be resolved?\n4. (BONUS) Time permitting, try scanning very fast (10Hz or more -- WARNING, this may\ncause some unpredictable results). How does this affect resolution, image quality and stability,\nand other performance considerations?\n7.3\nElastic modulus\nHere, you just need to calculate the elastic modulus of the two elastomer samples (we'll call them\nPDMS-10 and PDMS-25), and to determine which is softer.\n7.4\nMeasuring Boltzmann's constant\n1. Carry out the data analysis of Section 6.4 and summarize your results with a plot showing\nthe noise spectra for both cantilever sizes, and the fit functions for them. Include the relevant\nmatlab code.\n2. Your report should include the values of spring constants k, resonant frequencies f0 = ω0/2π,\nand quality factors Q, that you found for both cantilevers. Explain which method of calcu\nlating spring constant you preferred, and why. Finally, what value of Boltzmann's Constant\nkB did you find from each device size.\n3. How close were you able to come to the actual value of kB , which is 1.38 × 10-23J/K?\n(You will be graded much less on the accuracy of your kB value than on the quality of your\nanalysis.)\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\n4. To understand what factors influence the accuracy of your measurement, consider the sources\nof uncertainty and \"noise\" in this experiment:\n- Calibration accuracy\n- Geometrical correction factor\n- Spring constant calculations, including geometrical (L, b, h) and material (ρc, E) parameters\n- Parameters derived from the PSD curve fit (Q, ω0)\n- Any noise in the system other than thermally-driven vibrations of the cantilever beams\nYou should quantitatively estimate the uncertainty/noise in these various components and\nsteps of the kB calculation (if you aren't sure how to approach this, you'll probably find\nit helpful to discuss with your lab instructor). Paragraphs of explanation for each item\nare not necessary - briefly mention key considerations, and focus on the major sources of\nerror/uncertainty.\nQuestions that'll help you: How confident can you be of the various values? Within ±10%\nor ± a factor of 2. If a particular variable has a 20% error, how does that propagate to kB?\ni.e. what's the dependence of kB on that variable? Based on these estimates, which one or\ntwo items dominate the error in the measurement? (i.e. improving anything else won't help\nuntil this dominant source of error/uncertainty is dealt with).\nLab Problem\nYou learned in lecture about the minimal force detectable with a microcantilever. The force was\nassumed to have a white spectrum, and its PSD (at all frequencies) had a value of:\n4kBT\nk\nSF 0 =\n·\n.\nQ ω0\nUsing analytical expressions for spring constant and resonant frequency, given by\nk = Ebh3\n4L3\nand ω0 = h\nL2\ns\nE\nρc\n,\nanswer the following questions:\n(a) Calculate the minimum detectable force in a 100 Hz bandwidth using the 350 μm beams\nfrom this lab.\n(b) How does this value compare to typical forces in biological systems (e.g. antibody/antigen\nbinding, DNA hybridization, interdomain forces in proteins, etc.)? Use whatever knowledge you\nmay have, or find one or two examples, but don't spend too long doing literature searches.\n(c) Which cantilever geometrical parameters affect the minimal detectable force? I.e. for smaller\nforces, do you need a cantilever that's shorter? thinner? wider? Comment on which parameter\nvariations will have the greatest effect.\n\n20.309: Biological Instrumentation and Measurement Laboratory\nFall 2006\nUseful References\nAFM basic operating principles\na. A website with a basic description:\nhttp://www.weizmann.ac.il/Chemical_Research_Support/surflab/peter/afmworks\nb. One with some more detail:\nhttp://saf.chem.ox.ac.uk/Instruments/AFM/SPMoptprin.html\nc. If these really stimulate your interest, this is a more comprehensive site on Scanning Probe\nMicroscopy (SPM), of which AFM is a subset:\nhttp://www.mobot.org/jwcross/spm/\nThe paper that started it all. G. Binnig, C. F. Quate, Ch. Gerber, \"Atomic Force Microscope\"\nPhysical Review Letters 56(3):930-933, 1986.\nUsing interferometric ID fingers for position detection\na. The original paper:\nS. R. Manalis, S. C. Minne, A. Atalar, C. F. Quate, \"Interdigitatal cantilevers for atomic\nforce microscopy,\" Applied Physics Letters 69(25):3944-3946, 1996.\nb. A more thorough treatment:\nG. G. Yaralioglu, S. R. Manalis, A. Atalar, C. F. Quate, \"Analysis and design of an interdigital\ncantilever as a displacement sensor,\" Journal of Applied Physics, 83(12):7405-7415, 1998.\nA nice review of using the AFM in boiology\nD. Fotiadis, S. Scheuring, S. A. M uller, A. Engel, D. J. M uller, \"Imaging and manipulation of\nbiological structures with the AFM,\" Micron, 33(4):385-397, 2002."
    },
    {
      "category": "Resource",
      "title": "tutorial2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/46df619b748ae8f3f7512c19b66127a9_tutorial2.pdf",
      "content": "Uu+\n+kamp(;+&\nof the mnhn KOUJ\nd i m e s 5 n ~ Qa,+ WY\nw\nh\n0~ is sbme lntc9e.r f r ~ m (\nH\nP\n,\n~\n)\n\nf is ue\nSanp\\;ng\nper i o J \\\nChe spati03 w d e del'k f~~~''*''*\n'\n\ny q d i ~ + I ~ Q ~ & & Y\n.\n,\nc h h known\nM\n\\\ne\n'=f\nL\ns;B\"\"e ' d ' l o ~ I\nis\nOcS\nA 'bad-l\nbnrl\nf,,,\n)he\nfirs+\npc'5'\nCevl\nThe\nbrig i 0 9 8;gfld"
    },
    {
      "category": "Resource",
      "title": "convclar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/898a07d02c6b861a8e8b06acc7bcbc60_convclar.pdf",
      "content": "g\nh\n\ng*h\n\nEx #1:\n[...,1,...]\nEx #2:\n[...,1,-1,...]\nEx #3:\n[...,-1,2,-1,...]"
    },
    {
      "category": "Resource",
      "title": "tutorial1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/d77564eb7de7cbcd98a22d64bbca401e_tutorial1.pdf",
      "content": "20.309 Tutorial Sheet #2\ndiscrete vs. continuous functions, periodicity, sampling\nWe will encounter two classes of signals in this class, continuous-signals and discrete-signals. The distinct\nmathematical properties of each, especially in regards to Fourier transforms, requires us to have at least a basic\nunderstanding of the differences between them. First I will present some mostly non-mathematical intuition,\nthen discuss some of the theory behind it. This material is meant to help you understand the labs and\nhomeworks.\nContinuous-signals have, as their name suggests, a continuous independent variable. For example, the velocity\nof a moving body, like you moving around campus, could be considered a continuous signal - at any time t the\nvelocity is clearly defined. Notation is the common f(t), which you are used to from mathematics classes.\nIn contrast, discrete signals are only defined at discrete independent variables. For example, the daily high\ntemperature during a week is only defined for the 7 days. It would make no sense to compare the daily high of\nday 1 (say Monday) to day 1.5. Other examples of discrete signals include census data and class attendance; if\nyou think about it there are many others. Notation for discrete numbers is typically f[n], with the brackets\nemphasizing that n is a sequence.\nGraphically:\ncontinuous function\n0.5\n1.5\n2.5\n3.5\nt\ndiscrete function\nt\nThe distinction is very important to us because when we use computers to numerically perform mathematical\noperations we are confined to dealing with the properties of discrete numbers. That is because typical computers\nare built with digital logic dealing with ultimately binary data. MATLAB can approximate a continuous\n0.5\n1.5\nf(t)\nf[t]\n\nfunction by generating values at small intervals of the independent variable, but there is a limit to how much\nsuch approximations actually mirror the real thing. It is that limit we are interested in.\nSampling\nSo how do we go from continuous to discrete signals? In the case of the moving body, if you were to measure\nthe velocity with a radar gun and write down your reading every 0.5 seconds, you would in fact now have\ndiscrete data. We would say that your sampling frequency is 2 Hz, or 2 per second. Ideally, you would write\ndown values at exactly every 0.5 seconds. Mathematically we can define this operation as multiplying an\n\"impulse train\" with your data, then passing it through a \"continuous to discrete converter\" or \"C/D converter\".\nLet's examine the situation where you are on a swing, tracing the motion of a pendulum - thus your velocity\nwould be a sinusoid. Your velocity v(t) is thus equal to sin(t).\n-1\nvelocity (m/s)\nSignal:\nv t sin( )\nt\ntime (s)\nsampled v(t) (m/s)\nimpulse (unitless)\nImpulse train: p t( ) 1for t\n0, 1, 2,\n\nr r\n\np t 0 otherwise\nSampled:\nv\nt\nv t p t\n\np\ntime (s)\n-1\ntime (s)\nPerforming this operation is known as \"sampling\" the function v(t) at the sampling frequency of 1/aT, where T\nis the period of the impulse train. Note that an impulse train can also be written as\nIf you sample vp(t) by multiplying with p(t) you will obtain a sampled signal. Note that the impulse train is still\na continuous function although it looks discrete, since it's defined for every t. Also note that we are multiplying\ntwo signals in time, which by the convolution theorem which we saw in class means the transform of vp(t)\nequals the convolution of the signals in frequency: Vp (:) V (:)* P(:) . vp(t) becomes a discrete signal vp[t]\n=\n\n,\n0, 1, 2,...\np t\nt\nkT\nT\n\nafter running the signal through a C/D converter which will non-dimensionalize time into sample numbers\n(more on this and the convolution in frequency later).\nIf v(t) is changing slowly enough for our sample rate to capture all the information contained in the signal, we\ncan completely reconstruct v(t) based on the discrete sequence vp[t]. Stop and think about this for a while - you\ncan exactly reconstruct a function v(t) by knowing an infinitesimally smaller subset of information, as long as\nyour sampling frequency is great enough. The cutoff point is called the \"Nyquist sampling frequency\", and it is\nexactly twice the highest frequency you can reconstruct in your signal. This is known as the \"sampling\ntheorem\":\nSampling at Fnyquist with Fnyquist > 2*fmax (where fmax is the highest frequency in your signal of interest) allows\ncomplete reconstruction of the signal from its sampled values. A more formal way to say this (T = period):\nSampling Theorem, Oppenheim and Willsky, \"Signals and Systems\" page 518\nLet x(t) be a band-limited signal with X( : ) = 0 for | : |> : max. Then x(t) is uniquely determined by its\nsamples x(nT), n = 0, ±1, ±2, ..., if : s> 2 : max where : V ʌ7*LYHQWKHVHVDPSOHVZHFDQUHFRQVWUXFW\nx(t) by generating a periodic impulse train in which successive impulses have amplitudes that are successive\nsample values. This impulse train is then processed through an ideal lowpass filter with gain T and cutoff\nfrequency greater then : max and less then : s- : max. The resulting output signal will exactly equal x(t).\nIf your signal contains frequencies higher then half your sampling rate, then you are \"undersampling\" the signal\nand will not be able to reconstruct it fully. If you try to reconstruct it anyways you will encounter \"aliasing\", or\ndistortion of the original signal. It's really useful to look at the graph below to see what this means - if you\naren't sampling fast enough you have no way of knowing if the signal you are observing is the red or blue one.\n\"Two different sinusoids that give the same samples; a high frequency\n(red) and an alias at\n(blue).\" (http://en.wikipedia.org/wiki/Aliasing, accessed 10/05/06).\nLater we will see what aliasing looks like in the frequency plane.\nBackground Theory\n\nI will present some basics to help understand hwk2, but the full mathematics behind it is outside the scope of\nthis course. A course entitled \"Signals and Systems\", or the textbook of the same name by Oppenheim and\nWillsky (available in the lab) can fill in the blanks if you are interested.\nIn class Prof. Manalis introduced the Fourier Transform for continuous signals, and its inverse. We will specify\nthis transform as the CTFT, or Continuous Time Fourier Transform. Because MATLAB doesn't work with\ncontinuous signals, when you want MATLAB to perform a Fourier Transform it actually performs the Discrete\nFourier Transform, or DFT.\nIn class we saw this table:\nTime\nFrequency\nFourier series (CTFS)\nContinuous (t)\nDiscrete (wn)\nFourier integral (CTFT)\nContinuous (t)\nContinuous ( : )\nDiscrete Time Fourier Transform (DTFT) Discrete [t]\nContinous (w)\nDiscrete Fourier Transform (DFT)\nDiscrete [t]\nDiscrete [2*pi*k/N]\n(I've added the DTFT)\nThe CTFS maps a continuous, periodic signal to its harmonic (sinusoidal) components. This means that we are\nWU\\LQJWRPLPLFRXUVLJQDOZLWKVLQHVDQGFRVLQHVRILQWHJHUPXOWLSOHVRIWKHIUHTXHQF\\ LQUDGLDQV An = n : =\nn*2pi/T. The series of frequencies thus presents a discrete mapping in frequency space. Note from the formula\nthat the CTFS is aperiodic.\nT /2\na0\n3 f\nt\n\ndt\n\nT T /2\nT /2\nan\nf t cos Znt\n\ndt\n\nT T /2\n\nCTFS:\nT /2\nbn\nt sin Znt\n\ndt\n\nf\n\nT T /2\n2S\nZ\nn , n 1,2,3...\nn\nT\nf\nCTFS-1 (inverse):\nf t\na0 ¦an cos Znt bn sin Znt\nn 1\nThe CTFT is a generalization of the CTFS to include all frequencies in the transform, not just integer multiples.\nWe are taking the formula for CTFS and taking the limit as T goes to infinity. Thus the signal in time no longer\nneeds to be periodic (since the period T is going to infinity), and in turn we need to use all frequencies in order\nto mimic the signal. The CTFT of a signal is thus continuous, and also not necessarily periodic. The CTFT\ntransforms a continuous time signal to a continuous spectrum in frequency. We represent that frequency as : .\n\nf\nCTFT:\nH (:) 3 h(t)eiwt dt\nf\nf\nCTFT-1:\nh(t) 3 H (:)eiwt d:\nf\nThe DTFT is symmetrical to the CTFS. Recall the CTFS maps a periodic, continuous signal in time to a discrete\nsignal in frequency. The DTFT maps a discrete signal in time to a periodic, continuous signal in frequency. The\nconnection to the CTFT is that the DTFT acts on a sample of a continuous signal. If we were to rewrite the\nCTFS in terms of exponentials (using Euler's Formula, eiZ\ncosZ i sinZ ) the symmetery would be more\napparent, I'll leave that to you, or you can look up the Strang reference \"Fourier Transforms\" on page 5.\nf\nH eiZ\n[ ] iZn\nDTFT:\n\n¦h t e\nf\nDTFT-1:\nh t[ ] 1\nS 3 H eiw eiZndZ\n2S\nAll these transforms involve continuous signals in either time or frequency space. However as you know\ncomputers in general can only work with discrete information, and additionally we can only sample for a finite\ntime. Thus the best we are able to do numerically with transforms is a discrete approximation in frequency to a\ndiscrete signal in time. This brings us to the DFT. The reference in the 20.309 schedule page titled \"FFT\nreference material\" contains a more detailed explanation if you desire.\nThe Discrete Fourier Transform (DFT)\nWhy DFT if we have DTFT? Recall that DTFT provides a continuous frequency spectrum provided that we are\ngiven an \"infinitely long\" discrete-time signal. However, in real life we do not have the luxury of sampling a\nsignal forever. Therefore DFT approximates the frequency spectrum of a DTFT using discrete samples. The\nDFT maps a discrete, aperiodic and finite signal in time to a discrete, periodic signal in frequency. This is\nsomething computers can do. The DFT of a length N signal in time will also be of length N in frequency. In\notherwords, if we have a signal of length 10, we could only estimate the entire frequency spectrum with 10\nsamples. Note that we have a limited series of frequency values in the DFT, namely N. If a signal f[t] contains\nDIUHTXHQF\\Ax which is not close to one of the frequency values available in the DFT, the frequency spectrum\nwill have to use a combination of the available frequencies to substitute, resulting in \"spectral leakage\". Thus\nwhen performing a DFT in MATLAB it can be extremely helpful to know what frequency you are looking for,\nand adjust input parameters accordingly. Modern implementations of the DFT use an algorithm called the Fast\nFourier Transform, or FFT, and use clever windowing techniques to reduce the inherent problems of the DFT\napproximations. Windowing refers to taking subsets of the signal and performing the FFT multiple times - you\ncan see how this can affect your result based again on the number N of frequency values being the same as the\nnumber of time values.\n\n=\n=\n\n1 N 1\nik§\n(c)\nN\nS ·\n1 n\nH k\nh n e\n, k\n0,1,..., N 1\n¦ > @\nDFT:\n[ ]\nN n 0\nN 1\nik§ (c)\nN\nS · 1\nh n\nH k e\n, n 0,1,..., N 1\nDFT-1:\n> @ ¦ > @\nn\nk 0\nNow let's look at a sampling example...see next document, hand-written pages."
    },
    {
      "category": "Resource",
      "title": "tutorial2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/1876ddc4f4b215842bd403e031a89ad8_tutorial2.pdf",
      "content": "20.309, Measurement and Instrumentation II\n10/06/2006\n\nSampling Example in Fourier Space\n\nSuppose we have a signal in continuous time.\n\nxc(t)\n\nt\nΩ\nxc(Ω)\nA\n-\nmax\nΩ\n\nmax\nΩ\n\nt\nxc(t)\nt\ns(t)\nt\nxs(t)\n\nIt has the following frequency response:\n\nSuppose we want to sample the continuous time signal into discrete time using a frequency\nT\nf\n=\n. The following block diagram illustrates what we would like to do.\n\ns(t)\n\nxc(t) ⊗\nx(n)\n\nxs(t)\nconversion from\ncontinuous to\ndiscrete time\n\n=\n\n-3T -2T -T T 2T 3T -4T -3T -2T -T T 2T 3T 4T\n⊗\n\nxc(t) = continuous time signal\nxs(t) = sampled continuous signal\n∑\n-\n=\n(\nnT\ns\nδ\ninf\ninf\n-\n)\n)\n(\nt\nt\n\n\"impulse train\"\n\nNote: When you multiply a continuous time signal with an \"impulse train,\" the result is\nanother \"impulse train\" that has the amplitude of the continuous time signal at every n·T,\n\nwhere n is some integer from (-inf,inf) and T is the sampling period or the spacing between\ndelta functions in the impulse train.\n\n∑\n∑\ninf\n-inf\n=\nI\ninf\n-inf\n=\n-\nΩ\n=\nΩ\n⎯→\n←\n-\n=\nn\nn\nT\nk\nT\ns\nnT\nt\nt\ns\n)\n(\n)\n(\n)\n(\n)\n(\nπ\nδ\nπ\nδ\n\nThe Fourier Transform of an impulse train in time is also an impulse train in frequency.\n\ns(Ω)\n\nΩ\nΩ\nx(Ω)\nA\n-Ω\n\nmax\nmax\nΩ\n\nΩ\ns(Ω)\nΩ\nA/T\n-\nmax\nΩ\n\nmax\nΩ\n\n. . .\n. . .\n\nT\nπ\n-\nT\nπ\n-\nT\nπ\nT\nπ\n\nA multiplication of s(t)\nx(t) is a convolution in frequency s(Ω)\n⊗\nx(Ω). Therefore,\n\n*\n. . .\n. . .\n\nT\nπ\n-\nT\nπ\n-\nT\nπ\nT\nπ\n\n. . .\n\n. . .\n\nxs(Ω)\n\nNote: Ωmax < T\nπ , or else the signal will \"alias\" or superimpose at the edges (which we want\nto avoid).\n\nT\nπ\n-\nπ\nπ\nπ\nπ\nT\nπ\nπ\nπ\n-\n-\n-\nT\nT\nT\nT\nT\nT\n\nΩ\nA/T\nIf Ωmax > T\nπ distortion of signal\nA/T\nmax\nΩ\n\nΩ\nH(Ω)\nT\n-Ω\n\nmax\nT\n-\nmax\nΩ\n\nmax\nΩ\n\n. . .\n\nxs(Ω)\nT\nπ\n-\nπ\nπ\nπ\n-\n-\n-\nT\nT\nT\n\nPreviously, we defined sampling frequency as\nT\nf\n=\n. Now we define sampling rate as\nT\nf\ns\nπ\nπ\n=\n=\nΩ\n. Therefore,\nmax\ns\nΩ\n<\nΩ\nfor aliasing to be prevented. 2\ns\nΩ is then known as\nthe Nyquist frequency. Any signal whose\nmax\ns\nΩ\n<\nΩ\nis known as a \"band-limited\" signal.\nThe original signal from the first page can then be recovered by an ideal low pass filter.\n\n⊗\n. . .\n. . .\n\nT\nπ\nT\nπ\nT\nπ\nT\nπ\nxs(Ω)\ns\nΩ\ns\nΩ\n-\nΩ\ns\nΩ\ns\nΩ\n-\n\"Ideal low pass\" filter\n\nxc(Ω)\n\n=\nΩ\n\nFor those of you who are curious about the difference between \"continuous time\" and\n\"discrete time,\" feel free to read on.\n\nΩ\nA/T\n-Ω\n\nmax\nmax\nΩ\n\nω\nA/T\n-\nmax\nΩ\nT\nmax\nΩ\nT\nt\nt\n\n-2T -T T 2T 3T 4T -2 -1 1 2 3 4\n\nIn time we multiply by T\n1 to change dimensionalized time to \"non-dimensionalized\" time.\n\nIn frequency we multiply by f\n1 , or T, to reflect this change.\n\n. . .\n\n. . .\nXs(Ω)\n\nπ\nT\nπ\n-\nT\nπ\n-\nT\nπ\nT\nπ\n\nT\n\nXs(ω)\n\nThis is an important point, because if you leave out the sampling frequency parameter in\npwelch you will notice that your frequency is given in radians. This is because the frequency\nis given in \"discrete time\" if you leave out the sampling frequency parameter.\nπ\n-\n-π\nπ\nπ\nπ\n\nNow we want to go from continuous time to discrete time. This just means turning a\ndimensionalized time into a non-dimensionalized unit of time.\n\nXs(t)\nXs(t)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/577a368ab1d38374e6cbaed236310e14_lec14.pdf",
      "content": "OPTICS AND Optical Instrumentation\nOptical imaging is the manipulation of light to elucidate the structures of objects\nHistory of Optics\nOptical Instrumentation - light sources\nOptical Instrumentation - detectors\nPhysical Optics\nOptical Instrumentation - intermediate optics\n\nA Historical Snap Shot of Optical Study\nThe study of light has a long history dating back to far antiquity. Optical\nmicroscope was first invited in the 16 century. However, we will focus on\nthe beginning of 20th century where there are two class of thoughts about\nthe physical properties of light.\nWave Nature of Light -- Huygen\nParticle Nature of Light -- Newton\nFigures from Wikipedia.\n\nHistory of Optical Studies\nThe advent of quantum mechanics allows us to understand that light has both\nwave and particular properties\nPlanck - quantization of black\nbody radiation Graph shows the spectral radiance of electromagnetic radiation at all wavelengths from a black body at various temperatures T.\nCourtesy of the Clendening History of Medicine\nLibrary,University of Kansas Medical Center.\nG\nr\naph\nsho\nws t\nhe s\npec\ntra\nl r\nadi\nance of e\nlectromag\nnetic rad\niation at\nall wave\nlengths\nfrom a black body at various temperatures T.\nFigure by MIT OCW.\n\nHistory of Optical Studies\nThe advent of quantum mechanics allows us to understand that light has both\nwave and particular properties\nBohr - Resolve wave-particle duality\nof light Graph shows the spectral radiance of electromagnetic radiation at all wavelengths from a black body at various temperatures T.\nNiels Bohr debating quantum theory\nwith Albert Einstein.Photo by\nPaul Ehrenfest (source: Wikipedia).\nGraph\nshow\ns the\nspec\ntral radiance\nof electromagnetic radiation at all wavelengths from a black body at various temperatures T.\nFigure by MIT OCW.\n\nA typical biomedical optics experiment\nLight source\nDetector\nIntermediate\nOptics\nSpecimen\n\nPhysical Principle of High Sensitivity Optical Detectors\nHigh sensitivity photodetectors today are mainly based on two physical processes:\n(1) Photoelectric effect\n(2) Photovoltic effect\nOne can detect light by other processes such as heating.\nPower meter for laser light is called a thermopile and is based\non heating by light - not very sensitive\n\nPhotoelectric Effect\nFirst observed by Becquerel in 1839, he observed current in conductive\nsolutions as electrode is exposed to light\nTheoretically explained by Einstein: An electron knocks out of a material\nby a photon. It is one of the major evidence in the quantization of light.\nhn = f + Ek\nf is the work function characterizing the barrier in the material for electron\nEjection. Ek is the kinetic energy of the ejected electron.\nThe kinetic energy depends only on the color (energy) of the photon\nbut not light intensity (number of photons)\nThe number of electrons ejected is proportional to the number of photons\n\nPhotovoltic Effect\nQM predicts that the electrons in a periodic lattice occupy energy bands\nthat has gaps.\n\nPhotovoltic Effect II\nPhotovoltic effect:\nElectron, hole generation\nin semi-conductor\nmaterial by light\n\nSignal and Noise in Optical Detection\nSignal - the amount of light incident upon the detector per unit time\nn is the number of photons detected per unit time\nDt is the data acquisition time\n< I >=anq / Dt\n-\nq is the electron charge= 1.6·10 19 C\n(1A = 1C/sec)\na is a gain factor of the detector\nNoise - the \"disturbance\" on the signal level that hinders an accurate measurement\n\nSignal-to-Noise Ratio and Noise Equivalent Power\nSignal: S =< I >2 R\nSNR: Signal power/Noise power = S/N\nNEP: Signal power at which SNR = 1\n\nSource of Noise in Optical Detectors\n(1) Optical shot noise (Ns) -\ninherent noise in counting a finite number of photons per unit time\n(2) Dark current noise (Nd) -\nthermally induced \"firing\" of the detector\n(3) Johnson noise (NJ) -\nthermally induced current fluctuation in the load resistor\nSince the noises are uncorrelated, the different sources of noise add in quadrature\nN 2 μ NS\n2 + Nd\n2 + NJ\n\nOptical Shot Noise\nPhoton arrival at detector are statistically independent, \"uncorrelated\", events\nWhat do we meant by uncorrelated?\nT /2\nLim o(n(t +t ) - n)(n(t) - n))* =< Dn(t +t )Dn*(t) >= 0 t „ 0\nT fi¥ T -T /2\n(* denotes complex conjugate)\nAlthough the mean number of photons arriving per unit time, l, is constant on average,\nat each measurement time interval, the number of detected photons can vary.\nThe statistical fluctuation of these un-correlated random events are characterized\nby Poisson statistics.\n\nPoisson Statistics\nIf the mean number of photon detected is n , the probability of\nobserving n photons in time interval t is:\nn\n-n\nP(n | n) = e\nn\nn!\nMean:\n=1\n=5\n=10\n=20\nn\nn\nn\nn\n1 M\nn =\na ni\nM\ni\nVariance:\n1 M\ns n\n2 =\na(ni - n)2\nM\ni\nn\nn s\n=\n\nSpectrum of Possion Noise I\n¥\nD ~ I ( f ) = o DI (t)e -i2pftdt\nwhere DI(t) = qDf (n(t) - n)\n-¥\nAssume photon number is Poisson distributed\nPower spectral density: P ~( f ) = RDfDI ~*( f )DI ~( f )\nNoise power:\nN ~( f , Df ) = P ~( f )Df\nThe power spectral density can be evaluated in a slightly round about way by\nconsidering the autocorrelation function:\n¥\nAutocorrelation function: g(t ) = RDf oDI(t +t )DI(t)*dt\n-¥\nBecause the event of Poisson process is completely independent of each other\ng(t ) = Rs I\n2d (t )/ Df\n\nSpectrum of Poisson Noise II\nd (t ) is the Dirac-Delta function with the following properties:\nIt has the unit of frequency\nd (0) = ¥; d (t) = 0 for t „ 0\nod (t)dt =1; o f (t)d (t -t )dt = f (t )\nFrom Poisson process: s I\n2 = 2aqDf < I >\nFactor of 2 account for positive and negative frequency bands\nThe autocorelation function of Poisson noise is:\ng(t ) = 2Raq < I > d (t )\n\nSpectrum of Poisson Noise III\n¥\nWiener-Khintchine Theorem:\nP ~( f ) = o g(t )e -i2pft dt\n-¥\nLet's why Wiener-Khintchine theorem is true:\n¥\n¥\n¥\ng(t )e -i2pft dt = RDf\n[ DI(t +t )DI(t)dt]e -i2pft dt\no\no o\n-¥\n-¥ -¥\n¥\n¥\n� �\n-i 2pft\n= RDf\n[ DI(t +t )e\ndt ]DI(t)dt\n-¥ -¥\n¥\n¥\n= RDf\n[ DI(t ')e -i2pft ' dt ']e+i2pftDI(t)dt\no o\n-¥ -¥\nt ' = t +t , dt ' = dt\n¥\n¥\n= RDf [ o DI(t ')e -i2pft ' dt '][ o DI(t)e+i 2pftdt]\n-¥\n-¥\n= RDfD ~I ( f )DI ~( f )*\nFourier transform of the autocorrelation function is the power spectral density\n\nSpectrum of Possion Noise IV\n¥\nP ~( f ) = o 2Raq < I > d (t )e -i2pft df =2Raq < I >\n-¥\nf\nt\nPoisson noise has a \"white\" spectrum\nNoise in a given spectral band:\n~N( f ,Df ) = 2Raq < I > Df\n\nPhoton Shot Noise\nThe origin of the photon shot noise comes from the Poisson statistics of\nthe incoming photons itself\nThe shot noise power is:\nN~\ns ( f , Df ) = 2Raq < I > Df\nLog(S/N)\nThe signal power is: S =< I >2 R\n< I >\naqn / Dt\n2aqnDf\nSNR =\n=\n=\n= n\n2aqDf\n2aqDf\n2aqDf\nUsed sampling theorem: 1/ Dt = 2Df\nA detector is consider to be \"ideal\" if it is dominated by just shot noise."
    },
    {
      "category": "Lecture Notes",
      "title": "lec15.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/bd8906024b6da23a235acd446ab34bc9_lec15.pdf",
      "content": "20.309\nOptical Microscopy and Spectroscopy for Biology and Medicine\nFigures removed due to copyright restrictions.\n\nA typical biomedical optics experiment\nLight source\nDetector\nIntermediate\nOptics\nSpecimen\n\nNoise Sources of A Detector\n1. Photon Shot Noise - Counting statistics of the signal photons\n2. Dark Current Noise - Counting statistics of spontaneous electron generated\nin the device\n3. Johnson Noise - Thermally induced current in the transimpedence amplifier\n\nPhoton Shot Noise\nOriginates from the Poisson distribution of signal photons as a function of time\n~Ns ( f , Df ) = 2Raq < I > Df\n< I >\naqn / Dt\n2aqnDf\nSNR =\n=\n=\n= n\n2aqDf\n2aqDf\n2aqDf\nLog(S/N)\n\nDark Current Noise\nThe ideal photoelectric or photovoltic device does not produces current (electrons)\nin the absence of light. However, thermal effect results in some probability\nof spontaneous production of free electrons. This effect is measured\nby the dark current amplitude of the device:< Id >\nThe average dark current is constant at constant temperature, but the electron\ngenerated fluctuate in time according to Poisson statistic similar to the\nfluctuation of the signal photons.\nFrom our discussion of photon shot noise, we have immediately\n~Nd ( f , Df ) = 2Raq < Id > Df\n\nJohnson Noise\nJohnson noise originates from the temperature dependent fluctuation in the\nload resistance R of the transimpedance detection circuit.\nConsider a simple dimensional analysis argument:\nThermal energy: kT\nThermal power: kTDf\nPower of Johnson noise current IJ : IJ R\nkTDf\nI J =\nR\n~N J ( f , Df ) = kTDf\n\nCharacterizing Photodetectors\n1. Quantum Efficiency: The probability of generating of a photoelectron from\nan incident photon\n2. Internal Amplification: The amplification ratio for converting a photoelectron\ninto an output current\n3. Dynamic Range: What is the largest and the lowest signal that can be\nmeasured linearly\n4. Response Speed: The time difference and spread between an incoming\nphoton and the output current burst\n5. Geometric form factor: Size and shape of the active area and the detector\n6. Noise: Discussed extensively already\n\nPhotomultiplier tube (PMT)\nThe PMT are characterized by two important parameters\nI =\nEg\nCathode sensitivity, S (A/W): 0.06 A/W\nGain, a: 107 to 108\nWe can relate current measured at the\nanode to the number of incident photons, n,\narriving within a time interval Dt\nS ×a × Eg × n / Dt\nEg\nis photon energy\nFor green (500 nm wavelength) photons:\nhc\n6.6·10-34 Js× 3·108m/ s\n-19\n=\n=\n= 4·10\nJ\nl\n5·10-7 m\n\nImage removed due to copyright restrictions.\nGraph of PMT Cathode Sensitivity as a function of material, from Hamamatsu Corporation.\n\nPhotodiodes\nBiasing can increase\ndevice temporal\nResponse speed\nRecall:\n\nCharge Coupled Device (CCD) Cameras\nFront Illuminated\nBack (thinned) Illuminated\n\nReadout Sequence Principle of CCD\n\nA Comparison of Detector Characteristics\nPMT\nPhotodiode\nAPD\nCCD\nQE\n40%\n80%\n80%\n80%\nSpectral Range\nUV-Green\nBlue-NIR\nBlue-NIR\nBlue-NIR\nInternal Gain\n106-108\n100-1000\nDark Noise\ne -/sec\n1000 e-/sec\ne -/sec\ne -/sec\nElectronic (Read) Noise\nNA\n1000 e-\nNA\n3-1000 e-\nResponse Speed\n+++\n+++\n+\n-\nPixel Size\ncm\nmm\nmm\nmm"
    },
    {
      "category": "Lecture Notes",
      "title": "lec16.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/17f90a5cbdab65afa29186fa3a0659f5_lec16.pdf",
      "content": "Optics and Microscopy I\n\nA typical biomedical optics experiment\nLight source\nDetector\nIntermediate\nOptics\nSpecimen\n\nWave and Particlel Nature of Light\nWave Nature of Light -- Huygen\nParticle Nature of Light -- Newton\n\nPhysical Optics - Wave nature of light\nMaxwell and His Equations\nWave Equations\nr\nN × E = 4pr\nr\nr\n2 r\n1 ¶2 E\nN × B = 0\nN E -\n= 0\nr 1 ¶B\nr\nc2 ¶t 2\nN· E +\n= 0\nr\nc ¶t\nr\n1 ¶2B\nr 1 ¶E\nr\n4p v\nN2 B -\n2 = 0\nN· B - c ¶t = c J\nc ¶t\nPlane Wave Solution\nr\nr\nE(x,t) = E0 cos(kx -wt)\nk = 2p\nw = 2pf\nck = w\nl\nPlane wave propagates like a \"ray\" of light\n\nReflection and Refraction of Light at Boundary\nReflection\nsin qi = sin qr\nRefraction (Snell's Law)\nni sinqi = nt sinqt\n\nRcfkactlon at 8 spherical surface\nLet's h k\nat one of the simplest case of how light is transmitted\nthou@ a spherical diektric (glass)&\ninMae\nWe can trace a ray oi@ating a?a distance S1 h nthe &&ice.\nHow far Grom the intmhce (wwillthe ray intersect the axis of the\nspherical inferface?\nThis question can be settled by Snell's law and my tracing:\n~nm!\nnl sinel =n, sine2\nSneu9sLaw:\n\nThesc)lutimiscomplicated dess all the anglesam small W e\nwill 6rst consider this caw. h this case, the she ofthe sum oftwo\nmallangles is the sum ofthe sines:\nFrom Snell's law:\nThis siqliato:\nRename S, to So\ns*to S,\nThe assumptimof smell angle iscalled the paraxid\nqpmhatiion.\n\nDerivation of the Lcmsmaltcr's Fo-r\nw h a t h t p p c n t o t h e f b d ~ s , , w h m t h p o i n t s o m a o f ~\nis mavedtoa distance\ntb;mthe object focus, Po?\nA l e n s i s W d l y t w o s p h r i c a l g l a s s s ~ b o o d t ~\nbaekW&\nLet'sateodthevirtullimagehningclseand\nplace a 2M\ntothe sight.\n\nSimple Ray Tracing I\nRay Tracing is just based on the application of Snell's law\nto a curved (spherical) surface. We will focus on 4 simple\nrules of ray tracing.\nRays pass through the focal point becomes parallel to the optical axis.\nRays originated from the focal point\nemerge parallel to the optical axis\nRays parallel to the optical axis\nconverges to the focal point\nRays parallel to the optical axis are deflected through the focal point.\n\nSimple Ray Tracing II\nRays originate from the focal plane becomes collimated.\nCollimated rays converges at the focal plane.\nRays originated from the plane\nemerge collimated\nCollimated rays emerge focus at\nThe focal plane\n\nOphcal elements I: Lens\nWehavebeenusinglensthroughmtthis~,itmaybeusefnl\nto pause for a moment to desuibe what are the typical terminology\nassociated with lens.\nBiconvex\nR1 >O\nR2 <O\nBiconcave\nR1<0\nR2>0\nMeniscus\nconvex\nR1 >O\nR2 >O\nMenGcus\nconcave\nR1>0\nR2 >0\nThese are common\nelements that is mostty d f e q h a t m y\nd I w i l l n o t ~ ~ t i m e o n ~ .\nMirrors: Minors has similar tumjnology as leus but oaly has m e\nSutt-5~.\nPrisms: Prisms has a number of applications such as dispersing\ndifkmt color of light and direcling light and image.\nAperWes & Stops: As discussed before, apertnre and stops serves\nt o ~ o p ~ l p t h d t o ~ a e r r a t i m e ~ ~\ndmimting m\n-\np\nd\n\nrays.\n\nOptical Microscopy I\nDetection path of an optical microscope. Note that at the detector,\nthe magnification is the ratio of the focal length of the objective and the\ntube lens.\nX'\n'\nf\nf\nx\nx\nM\n=\n=\nMagnification\n\nOptical Microscopy III\nKohler illumination ensure that the structure of the light source\n(such as the filament of lamp) is not imaged at the specimen.\nTrans-illumination\nEpi-illumination\n\nInterference I\nConsider combining two plane waves:\nE\nr\n1(r r,t) = E\nr\n01 cos( k\nr\n1 × r r -wt)\nr\nr\nk1 = k2 = k\nE\nr\n2(r r , t) = E\nr\n02 cos(k\nr\n2 × r r -wt)\nThe combined field is\nr r\nr\nr\nr\nr\nr\nr\nE(r , t) = E01 cos(k1 × r -wt) + E02 cos(k2 × r -wt)\nThe brightness or intensity is the \"mean square\" of the field\nT r r\nr\nr\nE2\nI = o E(r,t) × E *(r ,t)dt \"\nT 0\nE 2\nE2\nE 2 E2\nr\nr\nr\n=\n01 +\n02 + 2\n02 cos[(k1 - k2) ×r ]\n= I1 + I2 + 2 I1I2 cosd\nd is a phase factor measuring the path length difference\nr\nof the two beams at r multiplied by k\n\nInterference\nConsider two thin slits separated by d. What is the intensity of light\nat a screen distance s away at a position y?\nq\n/\ntan\ns\ny\n=\nConstructive\nd = 0,2p ,4p ,L\nd sin q = ml\nDestructive\nd = p ,3p ,5 p L\nd = kd sinq = 2pd sinq\nd sin q = (m + )l\nl\nWhat happen if we have many slits with separation d?\nImplications in the photonic crystal experiment?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/c5c8f88046b0c843fdbef8d1073fe249_lec17.pdf",
      "content": "Optics and Microscopy II\nGraph of Fourier Optics resolution (Goodman) removed due to copyright restrictions.\n\nTwo of tee masthpmbmt and difbxlt to\naspects of'an\nolpiid micmscoge are its Wtyta gmaak cwlmst dit albjlity\n~\n~\nT\nR\nf\ni\ne\nR\n~\ns\n\nWhat is rewllltim? RemMrnrkflues howhW E call !M!E .- -\nTwo objects ane:dish-ble\nif*\namtm are sep&\nIby\nthm thpk fill1 nr%\"M\n.r)hslfrn~viminn\n\nHuygens-Fresnel Principle\nIXlTmdwmh~\nd\na\ns\na\nm\nn\nr\ne\na\n~\ne\nd\n~\no\nf\n\nintakemeefEect- The basic physics oftktwo ~IBEYI-\nwe\nM a l . W h i t e w e ~ ~ t e d i n ~ e a s ~ o r i ~\n&mipint smmes(?ike the double slitq-t],\ndiEmchm\ntxmidm ixkckrm of light hMibesize. objects &asan\nSpherical Wave Solution\napertune-\n~ ~ ~ ~ b e ~ s i l y ~ w h ~ l . i g h t i s ~ ~ i n t o l\ndimmiws thatare ccmpmbk toitswavelength,- For coherent\nlight wmoe, like a laser, diflkxtimd k d s canbereadily\nobserved A n ~ ~ l e i s ~ g l ~ l i g h t ~ a n a a r o l w s l i\n- sin(k,r -a)\nThe b-eatmmtofdiflhctimefk& skated mthe 170Qs-1800swi\nB(r,t)= E,\nY\nanti ck, =o\nthe intmdndkm dthe Huygens-Fmsnel Principle-\nTheHuygen's principle wl be derived d k d y from the wave\nquation assumingtheelectric W d\ncan k treated PS Scafaz\nquantities. It is quite a bit o f w a and I will not go thm@ it\nhere.\n\nDiffraction I\nSingle slit diffraction is a result of the interference of light due to its wave nature\nGraph of intens\nity\n\nvs.\n\ndi\ns\nt\nan\nce\n\nf\nor\n\nsi\nn\ngle slit diffraction; show\ning dominant lobe from -pi to +pi, and rapidly diminishing lobes at each multiple of pi distance out.\nFigure by MIT OCW.\n\nDiffraction I I\nLa's considm the simplest diffraction situation that of a fmite size\nslit:\nThe contributionofclement dy at position P can be calculated\nfrom Hsvgen's principle:\n\nDiffraction Ill\nIn the far field (Fm~mhoffea)limit, R3:3D\nWe cm appr~~ximate\nr by R and the distance r can be approximated\nas a function of R y and E (usiny\nofcosine):\nThe total field at P is:\nTherefore, we have\nE=-ED sin[(kD .!2) sin81sia(c~-kR)\nR (kD1)rin8\n\nDiffraction IV\nDefutmgP =(kD/2)sinO duIcu]atingimemtemitytPwe\nhaw:\n1 ED2 sinins 2\n( 0 )=-2 (-1R (-1 p\n=I(0)sinc(P)\nU a t e t h z t i n t h i s ; d e r i ~ l o e , w e h a v e i ~ m e a r ~ ~\n@rmm!zldifbdm) as mtlas the vectar natweofthe electric\nfield-\n\nDiffraction V\nMicroscopy imaging can be consider as the diffraction from a circular aperture\nwith a lens for focusing - diffraction results in \"broadening\" of the focal point.\nCourtesy of Paul Padley.\nSource: Padley, Paul. Figure 3 in \"Diffraction from a Circular Aperture.\"\nConnexions, November 8, 2005, http://cnx.org/content/m13097/1.1/.\n\nRecall from lecture 1, the interference of two plane waves:\nFourier Optics I\nRecall the interference of two plane waves\nr r\nr\nr r\nE1(r,t) = E cos(k1.r + wt)\nr\nr\nr\nr r\nE2(r, t) = E cos(k2.r + wt)\nr\nr r r r\nI(r,t) = 2I + 2I cos(k1.r - k2.r )\nIn the case where the waves incident symmetrically and looking at the intensity along the\ny axis\nr\nk1 = k sinqxˆ + k cosqyˆ\nr\nk2 = k sinqxˆ - k cosqyˆ\nr r = yyˆ\nThe intensity has a simple distribution depend on angle q:\nI(r r ,t) = 2I (1 + cos(2k cosqy))\nNote that when angle is zero degree (light wave counter propagating), the highest\nfrequency oscillation is observed at spatial frequency: 2k = 2p ( ) . When the waves are\nl\nparallel, angle is 90 degree, the spatial frequency is zero (constant intensity light).\n\nFourier Optics II\nConsider two point source at the focal plane of a lens, the light rays\nbecome collimated plane waves after the lens and interference is observed.\n\nFourier Optics III\nWhat happen when the two sources coincide? Only parallel plane waves\nare generated.\n\nFourier Optics IV\nWhat happen if the point sources are made further apart?\n\nResolution viewed from Fourier Optics\nLight emission from any object in the specimen plane can be\nDecomposed into its Fourier components. Which Fourier component\nwill pass the finite aperture of the objective lens? Low frequencies!\n\nResolution viewed from Fourier Optics II\nNA = n sin(q )\nWhat is the maximum frequency that can be pass? Consider the case\nof a very large lens (numerical aperture, NA approach one). The\nwaves will approach counter propagating and the maximum frequency\nis:\nkmax = 2p (\n)\nl\nNote that maximum spatial frequency is a function of wavelength.\nShorter wavelength implies higher frequency (resolution) imaging.\nAt a given wavelength, we should expect a resolution of about l\n\nResolution viewed from Fourier Optics III\nPoint Spread function\nl\np\nMore quantitative analysis shows that:\n2 p\nl\np\nl\nr\na\nJ1(kasin )\nJ1(\n)\nJ1(\n)\nJ1(\nNAr)\nq =\na\n=\nr =\nf\nf\n0.6l\nJ1(x) = 0 at\nx = 3.83 Þ rmin = NA\n\nResolution viewed from Fourier Optics VI\nGraph of Fourier Optics resolution (Goodman) removed due to copyright restrictions."
    },
    {
      "category": "Lecture Notes",
      "title": "lec18.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-309-biological-engineering-ii-instrumentation-and-measurement-fall-2006/186780a48ca6c2cbc4cf9f9b67515f82_lec18.pdf",
      "content": "Fluorescence Spectroscopy & Microscopy\nCourtesy of NASA.\nSource: Dr. David Fischer et al., http://www.grc.nasa.gov/WWW/RT/2003/6000/6712fischer.html\n\nA typical biomedical optics experiment\nLight source\nDetector\nIntermediate\nOptics\nSpecimen\n\nMicroscope Configurations\nTrans\nEpi\n\nFluorescence is fundamentally a quantum phenomena\nLight ray can be thought of as a stream of photons each having energy:\nE = hu = h c\nl\nJablonski Diagram\nLight-Molecule Interaction\nPolyatomic\nmolecules\nSimple\norbitals\n\nJablonski Diagram\nS0\nS1\nT\nA\nF\nP\nISC\nIC\nIC\nIC\n\n(Iolserphotw mer~!.)\nas compared with the excitation\nprocess. flus fact ts immediatclp obvious frm the Jablonski\nrlnapm. Fluorescence (phasphmescmce) does not cmla\nfrom the exated nbrational lewl mimnall!* reached dunm\n-\nC\nthe excitation process but occm ina lo~verenerev-. starc due to\ninternal con~ersionand mtcrsystemcross.\nIn~ariazarrcaf emission 1~5thexcitatim: hammal,\n.b\nemir~ion\nspccrnun n ro~lahlv\n- (~r-ith\nof\n.-\nr m e cxccptions) ~ndcpmdea\nlescitanm 'var-ellen~h,This fact is a darect re~nlzof mien~l\ncon~~crsionill orltr5e molm~leto the bottom of 51\nindependent of exci~ation process.\n\nBasic Properties of Fluroescence\n0-2 0-1 0-0\n0-1 0-2\ns1\nS0\nFL\nAB\nl\nGra\nph\nof\nemi\nssi\non\nand\nab\nsorption spectra for pe\nrylene.\nFigure by MIT OCW.\n\nLifetime and qwnhm ~ i e l d\n~ ~ ~ ~ c e n c e\nlax bv emitting a\nmofmule docs not have to\nphoton (radisiiati~e decay) but they cmalso relax by thermal\nprocess without emitting a photm(ma-radiative decay]. The\nquality of a fluorophorc A clearly related to the rates of these\nt;rro decas modes. 1\nI\nI\nIn this simplified Jablon5ki rlia~amthe mdiatitredecay is\ndenoted by r andthe non-radiative decas is denoted by k.\nThe residence time of the inolectik in the excited state (Sl),\nlifetime, is aEectec3 by both radiative and non-radiative rates,\nIn particular,\nIn the absence of non-radiative decay pmcesses, the lifetime\nmeawed is caflcd the infihsic lifetime of the flnoroghore.\nThe '\"efficiency of the flmrclphore, the quantumefficiency,\n;?'\nis,defined as:\n\n~~spectra is &findas m\nd\ngmissicw intensity as a\nhctimofwave-\nat a given\nw\n-\nI%cdatilonspm Is defiaedastheoeea-lentofesimr\ninkmdy at a givenemksimw a v e h a as a fundmof~lcribtim\nw\n-\nPohizdion isalm aa&\nmfirlproperty of fl-- All\n~\n~\ne\nm W e schave a pfkrmtial diredimdadtation\n(excitationdipole) and Ilemisssim(emissiondipok). Nuk that. the\ne~utatimand mission dipoles do wt havetocoincide ingeneral.\nTheprobability of excdmga rrmohule depends w therelative\norientationdthe~a0-ar\nexcitatiw, dipale andt$ep h t i m\nloflight L R t $ b e t h e a n @ ~ ~ ~ t p r s l ~ ~ m m d ~\nmok&\nexcitationdipole. The p b w w of excitation is:\nof a palarimr- One canalso see that exitingmkmks with\npolarized light x h t s a sub-on\ndm-\nthat am\nm k k d close the palaimtion of light-\n\nThe me;lswcrmat ofpallariz;rtionof aqueous specimen Is typically\nperformed uskg the abo~:egemetrjr. Excitation light is fir~t\nplzrized. The ~missir~a\nlight is analjzed for its polariratfm\nparallel and perpendicular to the exritation direction.\nNote that the steady state po1xiz;atim Ir hi@ with ratation\ndfl11simnteslow: compared with its lifetime bmt its polarization is\nIQTV ifdiffi~siwis fa31 compared n+rhits lifetime. This is wry\nusefill far meanyring the bhding ofsmll ligand to large rnoImlcs\nor surfaces. Polarizationis also aftfm asml to measwe the mean\norientation of m o l ~ ~ ~ l c s .\n\nFluorescent Probes\nOrganic Probes\nGenetic Probes\nMolecular Probes, Oregon\nHoffmann et al, Nat. Meth, 2005\nQuantum Dots\nMichalet et al, Science, 2005\nFigure removed due to copyright restrictions.\nFigure removed due to copyright restrictions.\nCourtesy of Martin Lohse. Used with permission.\n\nStrengths of Fluorescence Microscopy\n\nStrengths of Fluorescence Microscopy\n\nStrengths of Fluorescence Microscopy\n(3) Molecular Sensitivity\nAlexandrakis, Nat. Med., 2004\nYildiz, Acc. Chem. Res., 2005\nCourtesy of Dr. Rakesh Jain. Used with permission.\n\nStrengths of Fluorescence Microscopy\nFigure removed due to copyright restrictions.\n4) Image biochemical reactions/Monitor microenvironmental\nchanges.\nFan et al. Biophys. J., 1999\nCalcium wave in HeLa cells.\n\nStrengths of Fluorescence Microscopy\n(5) Monitors genetic expression\n\nFlumcence lifetime is a cornplimenta-ykneaslrmefzt to spectral\nmasruement. Most fluorophores has a signature lifethe as xliell\nas spectral. Mare important, some flaoqlrcrses h a ~ elifetimes t l ~\nare more sensitive to mviro~eratalfactors than their spectra.\nThe fl~~czrtrscenc\ne decay of a fluorophore is gotrtrrnedby the\nfullol-vingequation:\nnrhrre Y, 19 the number of moleculer in the excited state nThichis\nproportional to the fluorescenceintmsity. This differential\nequation can be easily so11~ed:\nwhere F mdFoare the:in~taatanem~s\nand initial flr~wesccnce\ninzasitt.. T'he~fmt,IVP can see that fluorescence mission is a\nstatisticalprocess that is clwacterizedby exponential decays.\nWhat if there are mmllItiple decay pathways and multiple rates? h\nthis c . a q the fl~~mesc~nce\ndecay 1xlaJl be m~zltipleexponwtial:\n\nAs a matterof-\nhcmscesce &my ofmost\nIre\nbiological S-\no\nh hasmultiple apmmhd&mythat. is\nchmtektic both of th.eprobe and itsenvirmma\nWhileBm-\nl i f e h i s averyuseftrl~pmme-ter,it is\nhowever difficult Inmeasure As we have d\ni\nd\n\nMim,\ni%%lorBmce\nwetime is typlcauy cm thetifix maledm#=&-\nW e ~ ~ e v e r y f a s t s l p ~ s ~ ~ c t s ~ s w e t h e s ~\neverrCs. C m m p t m l @ , t h e ~ ~ c ~ b e ~ m ~\nfxmwiugway:\nTime do&:\nI?hlmxm~ce\nTime\nWewillnsealascrthatmg-trepulsesthatart~eryshort\nc o m p a r e d w i t h ~ f l ~ d R c a y ~ ( ~ c r r p s j ~\nThe\nfbmscuxe lifetimiEcantbabe meawnxiby tkkmhhg the\ntime lapsebetween the e;xdalianligM and theh . tmission\nphoton-\nOeeimpmtzmtcat@hbthiss(cherneisthatthe\np h ~ d e t e c t e d f o r & e x c i ~ p u l s e h a s t o k l e s s ~ ~ .\n\nIt 15 often venrusef~~lt-a\nmeaswe the difllrsilonofismall metabolites\nina biol@ci1 ~.;ystm;oxygenis a good example. As it nunr out,\na number of fluorophore, such as pxcne, with suff~cientlvimg\nlifenme cnn b'cquenched by the pr&cncc of lnctabolitc s k h as\noxygen due to m~lecularcalhsiw. Uponcallisiw, the fluorophme\nis de-excited am-racliatively.\nThecollision frequency is proportional to the cmcwtratiw ofthe\nquencher and the rate equation inthe presmce ofthe quencher can\nbe expressed as:\nwhm [Q]is the concenmtion of the quencher and IQ is: a\npropwtinnality constant related to the dffiusi~ityof the reactants.\n~vhrre%R, are the \"collision\" radii uof rhe fl~~orophore\nand the\nquencher and DryDqaxe the dfi~sioncoefficients of the\nflunrophore and the qtiencl~m\nTherefore, mreh n ~ :\ns-' =k0[e]+r=k,[p]~r,'\n+koto[p])\nnmefore, by measuring fl~~orescence\nM e b e , ITC candetermine\nquencher concentration as long as the nah~rallifetime and the\nproportionality constant k can be calibrated.\n\nThe effect of quencher can also be studied bv rnwitorinsthe\nsteady fqtatefl~mrescenceemissim. We xvili'add a conseaat\nilluminaticm term, I, to the fl~~orercence\nrate equation:\nd*\\T,\nInthe steady state,\n=0 .and we have the fluorescence, F,\ndt\nsimal:\n&.\nWe can re-write this equation in the absmce of quencher. The\nsteady state flumscmce in the absence of pencher. Fo,is:\nCombining the laq tsoequations, we ~ e tthe Stern-Volmer\n~ s ~ a r i ~ n :\nFor dynamic (collision) qtmching process, the steady state\nfluorescence intensit?;is a linem function of quencher\nconcmtzatim,\n\nThe quenchingprocess that .rwhave describedprwio~~sl;is called\ndynamic quenchingwhere a fluorophore is de-excited bi collision\nploces3 in the excited state. For dymmic quenching, both the\nr;teadystate flumescmce hterrsity and the fl~~mescenceliferime\nchanges linear1y with q~enchmcmcwtratim.\nmolecde is chemicallr.bound to a quencher to form a \"dark\ncomplef' -a reaction prdduct tlnt do not fluoresce. The gro~md\nstate reaction cmbe describedby the standard chemical hetic\nrate equationwhere Ks iq the assaclation tmstmt, F]is the\ncolncmtration ctf the an-complexed fluorophmes, [F-Q] i5 the\ncmcmtrataonof the complexes.\nThe total concentrationof flnorqhore, p301\nis given by:\nTherefore, in static q~enchim,the s-teadv state flwolecmce again\ndecreases linearly with qumcher cwce&tion.\nHo\\verrer,it is irnpoflant to note that steady state qmching does\nNOT affect fll~mesccncelifetime as it does not affect the excited\ntl~ereduction of avalable flumophores\n€0be excited.\n-1:\nis\neEict\nits\nand\nTtztte\n\nF~rrorascanc~\nResonance Ene r g Tronsfk P A P Z T )\nFRET is a wry \"cool\"~eclmique.It is an optical mler with\nmo111tionthat is better thm mestzms. The theory of\nis\nrather complicated and we will not go into the details hwe.\nInstead, I lr\\-illprovide a qualitative des&ption about what is\nFRET,what a-re the rclle~ziant~xpmimrntalparameters, and what it\ncan meamre.\nFRET is a proce~swhere energy 15 transferred fram one excited\nfluompl~ore(the doner) ro a second fluoqhore (the acceptor).\nAftm enerv transfer, the acceptor ir excited and will emit a\n--A\nphotw in the emission rpectmrn of the acceptor. As an example,\nflwre.;cein (a ereen dye) and rhotdamine (a red dye) make a good\nC.\nFRET pair. A fluoresceinmolecule is nclnnally excited by blue\nh ~ f\nand m n i ~ smem light- ,4 rhodamhe is be excited bv\ni m e n\n*.\nhiht and e m i ~red. ~ L t h o ~ ~ t\nFRET, the fluorescence ofthe\ncolmpesite system mill emit ereen. Inthe presence of FRET, the\nenergy of the fluorescein is transferred to the rhodamine mdw\nappropriate conditions. In this case, the emirsinn of the composite\nrysternmrill be red.\nIt should be pointed out that FRET itseIf ir a non-radiative process,\ni.e.no real pl~oton ir tramfmed between the doner ancl the\nacceptor. Iustead, the transfer is via a dipoledipole c o ~ ~ p l i n ~\n-. of\nthe dwer m d acceptor molen~le.The excited donw can Lw\nmodeled as a librating elettricaI dipole. me enegv is\n'*kmsfmd\"to the acceptor through t l ~\nfl~actuatingdipole field.\n\nhe dipole electric ~d IWa spa^\nofi3\nmat\nelectsic mollqle, atk isolated charge,has aa dechc W d hat has\na spatial ~ c e o f i ' .Since the &pole has no net charge, its\nfield sbauPd&cay fa§kr].\nThe rate of FRET is describedby thefullowinge p h :\nThe dwiatiwafthisfhdaisguirteinvoMWit is not hardto\ns e e w h y I f r e s e ~ ~ ~ i n t o p l a y .\n~irst,~'kanmsmeof\nthedative ari-rw\nofthehimmhsiw, a d the acceptw\nexdatim dipole, Only when the&ple are cwrectly aligned\nwould ERET be efficient. nis thei n k of ~ f r a h\nof the\nmedillminbdweem A\n~\nn\nshielding\n~\nb\n\n--\n~\no\nf\n~\n~\nb\n;\nm\nd\n~\n~\nF\nR\nE\nT\n.\n@diskqwntam\nyiddoflkhm- Aaargevm*-m*mlew\nam-rdiative decayrr&unita~~to camp& withFRET. zdis the\nofthe he^. A ~ e r ~ i m p l i e s l a r n n r e s b b k\nexcited state and ksspba$ility ofenergyiramferring. The\nintegralamtahstwo tmms: F&]is\nthe f i u u m x m emissiw\ns\np\nn of the dwter as a funciirw of\nthe abslovrptinnFm efilhe aecppm- This*gral,\nJ, li!qlrew\ntheir wlerbp.\nwavelength\n~ i o a l l ~ , t h e f * s p r t i a l ~ ~ ~ n n e ~ ~ t h e w l h a t ~ ~ ~ ~\nisa combined processoftwodipoksandeach dipolehas a f3\nBy ccmhiugmast ofthe mlecwkparameters into a djstancrre\npammkr>&,the Fmskrdistance*the eqmationcanbemmitkn\nas:\n\nFigure removed due to copyright restrictions."
    }
  ]
}