{
  "course_name": "Biomedical Computing",
  "course_description": "Analyzes computational needs of clinical medicine reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements. Topics: the nature of clinical data; architecture and design of healthcare information systems; privacy and security issues; medical expertsystems; introduction to bioinformatics. Case studies and guest lectures describe contemporary systems and research projects. Term project using large clinical and genomic data sets integrates classroom topics.",
  "topics": [
    "Business",
    "Information Technology",
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedicine",
    "Business",
    "Information Technology",
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedicine"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session.\n\nDescription\n\nThe US is about to invest at least tens of billions of dollars in healthcare information technology (HIT), hoping to create the information base for improving access to care, continuity of care, medical decision making, and reduction in errors. At the same time, we hope to make more rational the delivery of care, providing the most effective and least expensive interventions possible. This shift, if it is to be accomplished successfully, will require not only vastly improved infrastructure but also improved methods of learning from experience.\n\nContemporary medical care requires health care providers (and patients and their families) to know a great deal about the diseases, genetic predispositions, signs and symptoms, treatments and medications of each individual. To exploit the potential contributions of improvements in our understanding of genomics, proteomics and the \"new biology,\" we must combine such data with the clinical data that represent the patient's phenotype. We must also develop new analytical methods to find the important relationships among these data, and then apply them in many settings to improve health care. These needs form an intriguing engineering challenge described in this class, along with methods and practices aimed at their solution.\n\nThis class will serve as an introduction to the computing challenges in health care. We present the nature of contemporary health care, the types of data available for guiding decision making, research and analysis, the growing body of biological data and knowledge that underlie health care, and methods to develop models that can enhance applications from decision support to clinical research. We also look at applications of these ideas in electronic medical records, personal health records, telemedicine for developing countries, public health surveillance, and institutional and national scale infrastructures. Many of these latter topics will be presented by guest lecturers who are leaders in their fields.\n\nAssignments and Projects\n\nThere are four assignments for this course, in addition to the final report and presentations. The last two class sessions are reserved for student presentations.\n\nGrading\n\n50% final report and presentations, 30% assignments, 20% classroom participation\n\nRequired Text\n\nShortliffe, Edward H., and James J. Cimino, ed_s._\nBiomedical informatic_s\n: Computer Applications in Health Care and Biomedicine_. 3rd ed. Springer, 2006. ISBN: 9780387289861.\n\nReadings in the textbook will be supplemented by notes and papers listed on the\nLectures and Readings\npage associated with the day of the lecture. Students are expected to have read the material relevant to each lecture before coming to the lecture.",
  "files": []
}