{
  "course_name": "Black Matters: Introduction to Black Studies",
  "course_description": "Interdisciplinary survey of people of African descent that draws on the overlapping approaches of history, literature, anthropology, legal studies, media studies, performance, linguistics, and creative writing. This course connects the experiences of African-Americans and of other American minorities, focusing on social, political, and cultural histories, and on linguistic patterns.",
  "topics": [
    "Humanities",
    "Language",
    "Literature",
    "Philosophy",
    "Society",
    "African American Studies",
    "Humanities",
    "Language",
    "Literature",
    "Philosophy",
    "Society",
    "African American Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture/discussion: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNone\n\nCourse Description\n\n(c) Velvet Film, Artemis Productions and Close Up Films. All rights reserved. This content is\nexcluded from our Creative Commons license\n.\n\nHow the Humanities can help break walls and build bridges...and help us #StayWOKE\n\nWhat do texts and theories about Africans and their descendants in the Americas, alongside other \"Negroes\" (somewhat in the sense of Raoul Peck & James Baldwin's film \"I Am Not Your Negro\"), reveal about the making of various hierarchies of power in the United States and beyond--based on race, class, gender, etc.? We'll start by deconstructing the concepts of \"Negro\" and its congeners: \"Black,\" \"African-American,\" etc.?\n\nWe'll seek to enrich our understanding of these concepts through analyses that consider the possibility of action by ourselves as local community members and as world citizens working toward equal opportunity for individual and communal well-being. These analyses will ask us to identify and analyze general global patterns through the study of the local and specific.\n\nSuch endeaver can be made especially challenging when identity politics are used and mis-used for alienation and de-humanization, and for the grabbing of power by the few to the detriment of the many. Still, can we hope to improve our future and \"make America [and the world] great\" (at long last?) through the Humanities via the study of our past and present?\n\nAnd, most importantly for us at MIT in Spring 2017, how can this \"Black Matters\" course be made relevant to advancing social justice locally and globally?\n\nHaiti, my native country, and other socio-economically and intellectually oppressed communities in the Americas will serve as comparative case studies for analyzing the shaping and reshaping of languages, cultures and identities by Black people in the Americas and beyond.\n\nThese analyses will, I hope, help shape our own future as wall breakers, bridge builders and change makers. With the help of guest speakers from various disciplines, we will use language, linguistics, education, history, religion, literature, migration, politics, etc., to examine how theories and concomitant attitudes about \"Black Matters\" have shaped, and have been shaped by, global events through struggle, rebellion, critique and innovation.\n\nAnd the struggle continues toward a better world...",
  "files": [
    {
      "category": "Resource",
      "title": "MIT24_912s17_essay1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/7e0463a42499133f065d7c28de59e1d7_MIT24_912s17_essay1.pdf",
      "content": "MIT 24.912 Black Matters\nSpring 2017\nEssay Assignment #1\nDue as a WORD file\nIt's February 2017, and you've just read Douglass's 1854 speech \"The claims of the Negro ethnically considered.\"\nThis powerful speech, from the 19th century already, fits right in the agenda of the Black Lives Matter movement.\nIndeed the goal of the speech is to undermine some of the racist claims that degrade the humanity of Africans and\ntheir descendants in the Americas. However this speech--as it was written one and a half centuries ago--inevitably\nshows certain scientific flaws, many of which are a reflection of common beliefs in the 19th century.\nYour assignment is to write a letter to Douglass. Your letter will contain a coherent argument that will help improve his\nanalyses of the \"humanity of the Negro.\" This argument will have two main components:\nYou explain the ways in which your own linguistic autobiography, alongside your newly acquired insights about\nlinguistics in our Black Matters class, critically bear on Douglass's own assumptions and arguments about the role of\nAfrican languages in proving the \"humanity of the Negro Race.\" In other words, use personal biographical data\ncoupled with scholarly analyses in order to evaluate and, where appropriate, to improve some of the details in Douglass's\nspeech, especially focusing on his assumptions, evidence and reasoning.\nAs you improve Douglass's language-related arguments, please do two things:\n1. Clearly identify and explain one or more flaws. Ground your discussion in specific references to Douglass's speech; include\nquotations and page numbers for all relevant passages. NB: Since you are not linguists, please do not get bogged\ndown in the empirical and analytical details of Douglass's arguments about particular languages. Instead analyze\nand correct, where appropriate, the underlying assumptions and the logic of Douglass's argument, in light of all that\nyou've learned, from class discussions and readings, about history, linguistics, etc.\n2. Do lay out your linguistic biography with specific details--especially personal and socio-economic factors--that\nyou think may have shaped your language patterns and your and others' feelings and attitudes toward these\npatterns. Relevant biographical data may include: place of birth, where you grew up, what language(s) and\nlanguage attitudes you've been exposed to. Please share any relevant events that, as you remember them,\nmay have influenced on, or challenged or affirmed, your identity in some decisive or memorable fashion.\nThen explain how these aspects of your biography bear on Douglass's language-related arguments. NB:\nAgain, since you're not linguists, it's perfectly OK to describe speech patterns in everyday language, without\nany linguistic technical terminology. The most important issue here is your meta-linguistic reflection about\nyour language patterns, its acceptance (or lack of acceptance) by others, how these patterns may have shaped\nyour identity, and so on, and how such biographical matters bear on Douglass's language-related arguments.\nIf you think they don't, then you can simply use your linguistic biography to introduce yourself to Douglass.\nThroughout your letter, it's crucial that you make explicit reference to relevant passages in the class\nreadings and that you cite these passages appropriately, with page numbers (see below).\nGuidelines:\n1. Maximum length of essay as WORD document: 1,000 words--this maximum length is non-negotiable.\n2. Include your name, the course, the date and a title on the first page. Be sure to double-space, use a normal 12\npoint font and 1-1.25 inch margins.\n3. Number your pages.\n4. Please support any assertion with specific references to the readings, and include page numbers and\nbibliography as necessary.\n5. Cite quotations correctly. Consult the MLA Handbook for Writers of Research Papers. This is the industry\nstandard. Parenthetical quotations are fine for a short paper like this.\n6. Refer to the General Writing Guidelines handout as you work on your essay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_912s17_essay2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/a79322f72c5fea8fba33f88be2819e33_MIT24_912s17_essay2.pdf",
      "content": "Black Matters\nSpring 2017\nAssignment #2\nDue as a WORD file\nIn her lecture on The Bluest Eye, Prof. Helen Lee taught us, quoting Morrison, that:\n\"... literature ought to be both political, and beautiful... Fiction, then, provides social criticism. It disrupts\nand disturbs our complacency, our presumptions. It opens up the truth of experience. Stories give us a way\nto live, to grapple with the hard questions. Stories make us bigger. Stories help us to see ... and to steer.\"\nThen, Prof. Lee defined the \"Master Narrative\" as:\n\"The ideological script imposed by those in power which defines what is legitimate and beautiful and\nworthy and correct and normative.\"\nPlease select a couple of your favorite readings from the syllabus to date, and identify one \"Master Narrative\" (aka\n\"M.N.\") in these texts (whether or not this \"M.N.\" is explicitly defined, as in Rosina Lippi-Green's texts or indirectly\nalluded to, as in The Bluest Eye). Then, pick one theme that this Master Narrative speaks about and that relates to\nsome specific aspect of your own life or that of some group that you're familiar with.\nThe goal of this argumentative essay is to think constructively about events in your life when you yourself were\n\"complicit\" in, and/or a \"victim\" of, the Master Narrative. The terms \"complicit\" and \"victim\" are from Prof.\nLee's analysis of The Bluest Eye. As Prof. Lee argued in class, we can sometimes unconsciously contribute to the\nreinforcing the M.N. and even unwittingly be \"complicit\" in our own \"victimization\" by the M.N.\nBut now that we're #WOKE, we can interrogate this Master Narrative and our role in it--as \"accomplice\" or\n\"victim\" or both.\nSo the key question is: How can you, using what you've learned about \"Black Matters\" to date, help interrogate and\nperchance undermine the Master Narrative that you've identified. Please be concrete and specific as to which insights\nfrom the course will help you counter which aspects of the M.N. that you've identified, and how exactly you can\ncounter this M.N. Of course, this is a somewhat open (even life-long) project, so there's no \"right\" and \"wrong\" answer\"\nas long as you can elaborate a coherent argument and plan in your essay, based on both real-life events and scholarly\nknowledge--to be eventually put to actual use as you learn to \"read the word and the world.\"\nGuidelines:\n1. This is an argumentative essay, not a piece of creative writing.\n2. Length of essay as WORD document: 1,000 words including title and bibliography.\n3. Include your name, the course, the date and a title on the first page. Be sure to double-space, use a normal 12\npoint font and 1-1.25 inch margins.\n4. Number your pages.\n5. Quote and analyze specific passages from the chosen text to support your argument.\n6. Please support any assertion with specific references to readings, and make sure that your citations include\npage numbers and bibliography as necessary.\n7. Cite quotations correctly. Consult the MLA Handbook for Writers of Research Papers. This is the industry\nstandard. Parenthetical references are fine for a short paper like this.\n8. Refer to the General Writing Guidelines handout on Stellar as you work on your essay.\nIt's crucial that you make explicit reference to relevant passages in the class readings--as many passages\nas are relevant--and that you cite these passages appropriately. Please check the grading rubric on Stellar\nwhich will help you in meeting the expected standards.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_912s17_essay3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/fea65266dc2ad1f2c25003b70b4587cc_MIT24_912s17_essay3.pdf",
      "content": "Black Matters\nSpring 2017\nEssay Assignment #3\nDue as a WORD file\nPlease read this prompt while keeping in mind our discussions during Prof. Sandy Alexandre's and Prof.\nJohn Tirman's visits, and the readings related to their visits.\nConsider the use of translation in Danticat's The Farming of Bones: As you know very well by now, this\nnovel is written in English, but it also uses Spanish and Kreyol phrases, often with side-by-side\nEnglish equivalents or, rather, approximations.\nHere's your prompt: What kinds of relationship does the novel establish between these three languages, and to what\nends? This prompt will require you to practice close reading as exemplified by Prof. Alexandre\nduring her visit to class. As an answer to the prompt, generate a thesis that is supported by a\nclose reading of 1 to 3 selected passages in the novel where Spanish or Kreyol or both are used,\nalongside English.\nThe overall goal of this essay is to analyze the linguistic choices in The Farming of Bones in light of the\nissues discussed in class and in all the readings to date, especially those that relate to language,\ngender, culture, identity, body, geography, power, etc. Select at most 3 passages, in a way that\ngives you an interesting and relatively substantial sample of Kreyol and Spanish phrases to\nwork with, then provide a coherent analysis of the author's linguistic choices in these\npassages. Your essay should teach us something about the author's use of English vs. Kreyol vs.\nSpanish and how these choices help convey the morale of her story and give us a deeper\nunderstanding of the issues that we've been discussing in class about Master Narratives and related\nmatters. If space permits, feel free to share any insights derived from your own personal\nbiographies, and from your own stories of ancestry and migration.\nGuidelines:\n1. Length of essay as WORD document: 1,000 words TOTAL, including title and\nbibliography.\n2. Include your name, the course, the date and a title on the first page. Be sure to double-space, use a\nnormal 12-point font and 1-1.25 inch margins.\n3. Number your pages.\n4. Quote and analyze specific passages from the chosen text to support your argument.\n5. Please support any assertion with specific references to readings, and make sure that your\ncitations include page numbers and bibliography as necessary.\n6. Cite quotations correctly. Consult the MLA Handbook for Writers of Research Papers. This is the\nindustry standard. Parenthetical quotations are fine for a short paper like this.\n7. Refer to the General Writing Guidelines handout as you work on your essay.\nIt's crucial that you make explicit reference to relevant passages in the class readings--as many\npassages as are relevant--and that you cite these passages appropriately. Please check the\ngrading rubric which will help you in meeting the expected standards.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Chart on black infant mortality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/7612c1c2437479c52b7ae521f655f0a2_MIT24_912s17_chomsky_mortality.pdf",
      "content": "Total Black Excess Deaths\nYear\nFigure. Total Black Excess Deaths and\nthe Reagan and Bush Presidencies\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Democracy Enhancement in Haiti",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/199bfcd6d260e023f15a77e611d27241_MIT24_912s17_haiti.pdf",
      "content": "Correct: [February 1991?]. Check, must be 1992\n@flushright<@u<Z>, Summer 1994>\n@heading<Democracy Enhancement II>\nAs discussed in Part I, the Reagan-Bush Administrations reluctantly\nadopted \"prodemocracy policies as a means of relieving pressure for\nmore radical change,\" and \"inevitably sought only limited, top-down\nforms of democratic change that did not risk upsetting the traditional\nstructures of power with which the United States has long been\nallied\" (Thomas Carothers of the Reagan State Department). The\nleading idea is revealed in the documents of USAID's democracy\nproject, which stress that the U.S. supports \"processes of democratic\ninstitutional reform that will further economic liberalization\nobjectives\" -- that is, entrenchment of the service role.@note{Cited\nby Robert Vitalis, \"Dreams of Markets, Nightmares of Democracy,\" ms.\n1994; @u<Middle East Report>, Spring 1994.}\nThe reference to \"the traditional structures of power with which the\nUnited States has long been allied\" has to undergo the usual\ntranslation. The phrase \"United States\" refers to the \"traditional\nstructures of power\" at home. This is among the elementary truths\nthat are to remain unspoken, along with the fact that the policies for\nthe service areas merely adapt a conception of democracy that is to\napply to the home societies as well. Here the general public \"must be\nput in its place,\" as Walter Lippmann explained in his progressive\nessays on democracy long ago. The \"ignorant and meddlesome outsiders\"\nare to be only \"interested spectators of action,\" not \"participants.\"\nTheir sole \"function\" in a democracy is to choose periodically among\nthe leadership class (elections). Also unspoken is the fact that the\n\"responsible men\" who manage the democratic society gain that status\nby virtue of their service to \"the traditional structures of power.\"\nThere is a very broad consensus in the intellectual community, and of\ncourse the business world, that the \"ignorant and incapable mass of\nhumanity\" must not be allowed to disrupt policy formation (Woodrow\nWilson's Secretary of State Robert Lansing), that planners must be\n\"insulated\" from politics, in World Bank lingo.\nThe \"prodemocracy policies\" in the service areas long antedate the\nReaganites, and have little to do with the Cold War, apart from\nideological cover. Accordingly, they should be expected to persist,\nas they do. Among the cases reviewed in Part I, the most striking is\nColombia, which has become the leading human rights violator in the\nhemisphere and the recipient of more than half of total U.S. military\naid and training, sent on its way with the usual acclaim for\nColombia's democratic achievements as state terror mounts -- all\nrising to new heights under Clinton.\n\"Human Rights enhancement\" marches on in parallel. In Part I, I\nreviewed Clinton's steps to evade congressional efforts to impose\nhuman rights conditions on military aid and trade privileges for\nNote: the text of this document contains formating tags (@flushright, @u, etc.) for Texifno, the GNU\nDocumentation System.\n\nIndonesia and China, and the concept of \"human rights\" itself, crafted\nto evade atrocities that contribute to profit. In the weeks since,\nthe China story took its predictable course. \"President Clinton's\ndecision to renew China's trade benefits was the culmination of a\ntitanic clash between America's global economic interests and its\nself-image as the world's leading advocate of human rights,\" Thomas\nFriedman's lead article opened in the @u<New York Times>, reporting\nthe surprising outcome. Clinton did not merely endorse the Bush\nAdministration policies that he had caustically denounced during the\npresidential campaign, but went well beyond them, deciding \"to delink\nhuman rights\" completely from trade privileges.@note{@u<NYT>, May 27,\n1994.}\nThe Indonesia case sheds further light on the \"titanic clash.\" As\ndiscussed in Part I, Clinton joined his predecessors and colleagues\nabroad in ensuring the welfare of the Indonesian tyrants and murderers\nand the foreign corporations that benefit from their rule, blocking\nand evading congressional restrictions on military assistance. The\nissue was quite narrow: whether to refrain from direct participation\nin Indonesian atrocities at home and abroad. There was no thought of\nproceeding beyond, to some action to deter some of the worst crimes of\nthe modern era.\nThe review in Part I was perhaps unfair in not mentioning that world\nleaders do recognize some limits, and have indeed considered sanctions\nagainst Indonesia. In November 1993, on behalf of the nonaligned\nmovement and the World Health Organization (WHO), Indonesia submitted\nto the UN a resolution requesting an opinion from the World Court on\nthe legality of the use of nuclear weapons. In the face of this\natrocity, the guardians of international morality leaped into action.\nThe U.S., U.K., and France threatened Indonesia with trade sanctions\nand termination of aid unless it withdrew the resolution, as it did.\nTraditional clients understand very well when a message from the\npowerful is to be heeded.\nCitizens of the free world were again fortunate to have the\ninformation readily available to them; in this case, in the Catholic\nChurch press in Canada.@note{@u<Catholic New Times>, 9 Jan. 1994; John\nPilger, @u<New Statesman and Nation>, June 3, 1994.}\nFreedom of information can go only so far, however. On June 10, the\nWorld Court was scheduled to take up the WHO request for an opinion,\ndespite a furious campaign by the U.S., U.K., and their allies to\nprevent this outrage. The matter is of some importance. Even\nconsideration of the issue by the Court would be a contribution to the\ncause of nonproliferation; even more so a decision that use of nuclear\nweapons is a crime under international law -- hence by implication,\npossession as well. As of mid-June, I have found no word on the\nmatter, though the nonproliferation treaty is a topic of lead\nheadlines, particularly the threat posed to its renewal in 1995 by\n\nNorth Korea's alleged nuclear weapons program.\nI barely mentioned one of the clearest tests of the Clinton vision on\n\"democracy enhancement\": Haiti. The case serves well to illustrate\nthe \"prodemocracy policies\" of the Reagan-Bush years, as Carothers\naccurately describes them. We may ask, then, how things changed as\nthe New Democrats took command.@note{Much of what follows appears in\nmy introduction to Paul Farmer, @u<The Uses of Haiti> (Common Courage,\n1994), a rich and informative analysis of what is happening and its\nbackgrounds. For further discussion and sources, see also my @u<Year\n501>, chaps. 8-9.}\n@subheading<1. The Legacy of History>\nEven the briefest glimpse of Haiti's torment leaves impressions that\ndo not easily fade, beginning with the scene of desolation on\napproaching the international airport. It is hard to remember that\nthrough the 18th century the island was the richest and most\nprofitable of the Western colonies, and like today's Bangladesh, had\nstruck the European conquerors as a virtual paradise. The\nPresidential Palace in Port-au-Prince, dominating a large square, is\nflanked by the headquarters of the military command and, at a slight\nremove, the equally-dreaded police. The symbols of authority and\nviolence stand in impudent mockery of the misery that lies below them\n-- \"confirming the permanence of power, a reminder to the people of\ntheir smallness in regard to the state, a reminder to the executioners\nof the omnipotence of their chief,\" in the worlds of Haitian\nanthropologist Michel-Rolph Trouillot, expressing the logic of the\nDuvalierists, Papa Doc and Baby Doc, who ruled with brutal violence\nfor 30 years.@note{@u<Haiti: State against Nation> (Monthly Review,\n1990).}\nIn the markets and slums below, it is barely possible to make one's\nway down alleys of mud and filth through teeming masses of people clad\nin rags. Women struggle past with huge burdens on their heads,\nchildren try to sell any miserable object, an occasional cart is\ndragged through mud that is inches deep and puddles left by recent\nrains. Flies swarm over a handful of vegetables and what might pass\nfor fish. Peasants who have trudged down from the mountains on\nancient trails sit by their paltry offerings, sleeping in the relics\nof shacks that line the alleys. In the depths of Third World poverty,\none rarely finds a scene so noxious and depressing.\nWhen I visited briefly a year ago, before the renewed terror, some\npeople in the marketplace were willing to speak in the presence of a\ntranslator who was known and trusted, but only in circumlocution. The\neyes of the security forces are everywhere, they intimated by their\ngestures more than their words. These were uniform: hunger, no work,\nno hope -- unless, somehow, President Aristide returns, though few\ndare to articulate the phrase beyond hints and nods. Some do, with\n\nremarkable courage, even after police torture and the threat of worse.\nIt is not easy to believe that such courage can long survive, even if\nthe people do.\nU.S. relations with Haiti are not a thing of yesterday, and show no\nsign of fundamental change. They go back 200 years, to the days when\nthe Republic that had just won its independence from Britain joined\nthe imperial powers in their campaign to quell Haiti's slave rebellion\nby violence. When the rebellion nevertheless succeeded, the U.S.\nexceeded all others in the harshness of its reaction, refusing to\nrecognize Haiti until 1862, in the context of the American civil war.\nAt that moment, Haiti was important for its strategic location and as\na possible dumping ground for freed slaves; Liberia was recognized in\nthe same year, for the same reasons. Haiti then became a plaything\nfor U.S.-European power politics, with numerous U.S. interventions\nculminating in Woodrow Wilson's invasion of Haiti and the Dominican\nRepublic, where his warriors -- as viciously racist as the\nAdministration in Washington -- murdered and destroyed, reinstituted\nvirtual slavery, dismantled the constitutional system because the\nbackward Haitians could not see the merits of turning their country\ninto a U.S. plantation, and established the National Guards that held\nboth countries in their grip after the Marines finally left.\nWilson's thuggery has entered history in two different versions: here\nand there. In the U.S., the events figure in the amusing\nreconstructions entitled \"history\" as an illustration of U.S.\n\"humanitarian intervention\" and its difficulties (for us). Haitians\nhave somewhat different memories. \"Most observers agree that the\nachievements of the occupation were minor; they disagree only as to\nthe amount of damage it inflicted,\" Trouillot writes under the heading\n\"unhealed sores. The damage included the acceleration of Haiti's\neconomic, military, and political centralization, its economic\ndependence and sharp class divisions, the vicious exploitation of the\npeasantry, the internal racial conflicts much intensified by the\nextreme racism of the occupying forces, and perhaps worst of all, the\nestablishment of \"an army to fight the people.\" \"The 1915-1934 U.S.\noccupation of Haiti,\" he writes, \"left the country with two poisoned\ngifts: a weaker civil society and a solidified state\napparatus.\"@note{@u<Ibid.>; NACLA Report on the Americas, Jan/Feb.\n1994.}\nA year ago, after enduring almost two years of renewed state violence,\ngrassroots organizations, priests in hiding, tortured labor leaders,\nand others suffering bitterly from the violence of the security forces\nexpressed marked opposition to the plan to dispatch 500 UN police to\nthe terrorized country, seeing them as a cover for a U.S. intervention\nthat evokes bitter memories of the Marine occupation. If ever noted,\nsuch reactions may be attributed to the fact that \"even a benevolent\noccupation creates resistance...among the beneficiaries\" (Harvard\nhistorian David Landes, writing about the Marine occupation). Or to\n\nthe deficiencies of people who need only a new culture and more kind\ntutelage of the kind he provided as director of the USAID mission in\n1977-79, Lawrence Harrison writes in a \"think piece\" on Haiti's\nproblems in which the U.S. military occupation merits only the words:\n\"And some of the Marines abused their power.\"@note{@u<Haiti Info>, May\n23, 1993. Personal interviews, Port-au-Prince, June 1993. Harrison,\n\"Voodoo Politics,\" @u<Atlantic Monthly>, June 1993. For some\ncomments, see Farmer, @u<op. cit.>; his letter in response was refused\npublication.}\nPoor and suffering people do not have the luxury of indulging in fairy\ntales. Not uncommonly, their own experience gives them a grasp of\nrealities that are well concealed by the intellectual culture. The\nusual victims can not so easily dismiss the record of U.S. power,\nwhich leaves little doubt that U.S. military intervention in Haiti\nwould be the death knell for any form of democracy that \"risks\nupsetting the traditional structures of power with which the United\nStates has long been allied.\" Haitians who have lost all hope for\nrestoration of democracy might support a military intervention that\ncould, perhaps, reduce terror and torture. But that is the most that\ncan be realistically expected.\nThe military occupation left the island under U.S. control and largely\nU.S.-owned. The killer and torturer Trujillo took over the Dominican\nRepublic, remaining a great friend until he began to get out of hand\nin the 1950s. In Haiti, Washington reacted with some ambivalence to\nthe murderous and brutal dictatorship of \"Papa Doc\" Francois Duvalier,\nfinding him a bit too independent for its taste. Nevertheless,\nKennedy provided him with military assistance, in line with his\ngeneral program of establishing firm U.S. control over the\nhemisphere's military and police as they undertook the task of\n\"internal security\" that he assigned them in a historic 1962 decision.\nKennedy also provided aid for the Francois Duvalier International\nAirport in exchange for the Haitian vote to expel Cuba from the OAS.\nWhen \"Baby Doc\" Jean-Claude took over in 1971, relations rapidly\nimproved, and Haiti became another \"darling\" of the business\ncommunity, along with Brazil under the neo-Nazi generals and other\nright-thinking folk. USAID undertook to turn Haiti into the \"Taiwan\nof the Caribbean,\" forecasting \"a historic change toward deeper market\ninterdependence with the United States,\" Trouillot observes. U.S.\ntaxpayers funded projects to establish assembly plants that would\nexploit such advantages as enormous unemployment (thanks in part to\nUSAID policies emphasizing agroexport) and a workforce -- mainly\nwomen, as elsewhere considered more docile -- with wages of 14 cents\nan hour, no unions, ample terror, and the other usual amenities. The\nconsequences were profits for U.S. corporations and their Haitian\nassociates, and a decline of 56% in wages in the 1980s. In short, if\nnot Taiwan exactly, Haiti was an \"economic miracle\" of the usual sort.\nHaiti offered the Reaganites yet another opportunity to reveal their\n\nunderstanding of democracy enhancement in June 1985, when its\nlegislature unanimously adopted a new law requiring that every\npolitical party must recognize President-for-Life Jean-Claude Duvalier\nas the supreme arbiter of the nation, outlawing the Christian\nDemocrats, and granting the government the right to suspend the rights\nof any party without reasons.\nThe law was ratified by a majority of\n99.98%. Washington was deeply impressed, as much so as it was when\nMussolini won 99% of the vote in the March 1934 election, leading\nRoosevelt's State Department to conclude that the results \"demonstrate\nincontestably the popularity of the Fascist regime\" and of \"that\nadmirable Italian gentleman\" who ran it, as Roosevelt described the\ndictator. These are among the many interesting facts that might be\nrecalled as neo-Fascists now take their place openly in the political\nsystem that was reconstructed with their interests in mind as Italy\nwas liberated by American forces 50 years ago. Curiously, all this\nescaped attention during the D-Day anniversary extravaganza, along\nwith much else that is too enlightening.\nThe 1985 steps to enhance democracy in Haiti were \"an encouraging step\nforward,\" the U.S. Ambassador informed his guests at a July 4\ncelebration. The Reagan Administration certified to Congress that\n\"democratic development\" was progressing, so that military and\neconomic aid could continue to flow -- mainly into the pockets of Baby\nDoc and his entourage. It also informed Congress that the human\nrights situation was improving, as it was at the time in El Salvador\nand Guatemala, and today in Colombia, and quite generally when some\nclient regime requires military aid for \"internal security.\" The House\nForeign Affairs Committee, controlled by Democrats, had given its\napproval in advance, calling on Reagan \"to maintain friendly relations\nwith Duvalier's non-Communist government.\"\nTo justify their perception of an \"encouraging step forward\" in\n\"democratic development,\" the Reaganites could have recalled the vote\nheld under Woodrow Wilson's rule after he had disbanded the Haitian\nparliament in punishment for its refusal to turn Haiti over to\nAmerican corporations under a new U.S.-designed Constitution.\nWilson's Marines organized a plebiscite in which the Constitution was\nratified by a 99.9% vote, with 5% of the population participating,\nusing \"rather high handed methods to get the Constitution adopted by\nthe people of Haiti,\" the State Department conceded a decade later.\nBaby Doc, in contrast, allowed a much broader franchise, though it is\ntrue that he demanded a slightly higher degree of acquiescence than\nWilsonian idealists, Mussolini, and New Dealers. A case could be\nmade, then, that the lessons in democracy that Washington had been\nlaboring to impart were finally sinking in.\nThese gratifying developments were short-lived, however. By December\n1985, popular protests were straining the resources of state terror.\nWhat happened next was described by the @u<Wall Street Journal> with\nengaging frankness: after \"huge demonstrations,\" the White House\n\nconcluded \"that the regime was unraveling\" and that \"Haiti's ruling\ninner circle had lost faith in\" its favored democrat, Baby Doc. \"As a\nresult, U.S. officials, including Secretary of State George Shultz,\nbegan openly calling for a `democratic process' in Haiti.\" Small\nwonder that Shultz is so praised for his commitment to democracy and\nother noble traits.\nThe meaning of this call for democracy was underscored by the scenario\nthen unfolding in the Philippines, where the army and elite made it\nclear they would no longer support another gangster for whom Reagan\nand Bush had expressed their admiration, even \"love,\" not long before,\nso that the White House \"began openly calling for a `democratic\nprocess'\" there as well. Both events accordingly enter the canon as a\ndemonstration of how we \"served as inspiration for the triumph of\ndemocracy in our time\" in those wondrous years (@u<New Republic>).\nWashington lent its support to the post-Duvalier National Council of\nGovernment (CNG), providing $2.8 million in military aid in its first\nyear, while the CNG, \"generously helped by the U.S. taxpayer's money,\nhad openly gunned down more civilians than Jean-Claude Duvalier's\ngovernment had done in fifteen years\" (Trouillot). After a series of\ncoups and massacres, Reagan's Ambassador explained to Human Rights\ninvestigators that \"I don't see any evidence of a policy against human\nrights\"; there may be violence, it is true, but it is just \"part of\nthe culture.\" We can only watch in dismay and incomprehension.\nHaitian violence thus falls into the same category as the atrocities\nin El Salvador at the same time, for example, the massacre at El\nMozote, one of the many conducted by U.S.-trained elite battalions --\nand one of the few to be admitted to History, after exposure by the UN\nTruth Commission. Given their origins in U.S. planning, these routine\natrocities must also be \"part of the culture.\" Or perhaps \"There is no\none to blame except the gods of war,\" as Christopher Lehmann-Haupt of\nthe @u<New York Times> observed, reviewing the \"fair-minded\" account\nby Mark Danner which \"aptly denotes\" the \"horrifying incident\" as \"a\ncentral parable of the cold war\" for which blame is shared equally by\nSalvadorans on all sides, murderers and victims alike. In contrast,\natrocities organized and directed by the Soviet Union always seemed to\nhave more determinable origins, for some reason.@note{@u<NYT>, May 9,\n1994.}\n@subheading<2. The Democratic Interlude>\nHaiti's happy ascent towards Taiwan was deflected unexpectedly in\nDecember 1990, when a real problem arose, unlike the terror and\nvirtual enslavement of workers that are just \"part of the culture.\"\nWashington made a serious error, allowing a free election in\nexpectation of an easy victory for its candidate, Marc Bazin, a former\nWorld Bank official. To the surprise of outside observers, Father\nJean-Bertrand Aristide was elected with two-thirds of the vote (Bazin\n\nwas second with 14%), backed by a popular movement, Lavalas, which had\nescaped the notice of the rich folk. Outside of properly educated\ncircles, one question came to the fore at once: What would the U.S.\nand its clients do to remove this cancer?\nPresident Aristide held office from February to September, when his\ngovernment was overthrown by a military coup, plunging the country\ninto even deeper barbarism than before. There are two versions of\nwhat happened in the interim. One is given by various extremists who\nsee Aristide as the representative of a \"remarkably advanced\" array of\ngrass-roots organizations (Lavalas) that gave the large majority of\nthe population a \"considerable voice in local affairs\" and even in\nnational politics (Americas Watch); and who were impressed by\nAristide's domestic policies as he \"acted quickly to restore order to\nthe government's finances\" after taking power when \"the economy was in\nan unprecedented state of disintegration\" (Inter-American Development\nBank). Other international lending agencies agreed, offering aid and\nendorsing Aristide's investment program. They were particularly\nimpressed by the steps he took to reduce foreign debt and inflation,\nto raise foreign exchange reserves from near zero to $12 million, to\nincrease government revenues with successful tax collection measures\n(reaching into the kleptocracy), to streamline the bloated government\nbureaucracy and eliminate fictitious positions in an anti-corruption\ncampaign, to cut back contraband trade and improve customs, and to\nestablish a responsible fiscal system.\nThese actions were \"welcomed by the international financial\ncommunity,\" the IADB noted, leading to \"a substantial increase in\nassistance.\" Atrocities and flight of refugees also virtually ended;\nindeed the refugee flow reversed, as Haitians began to return to their\ncountry in its moment of hope. The U.S. Embassy in Haiti secretly\nacknowledged the facts. In a [February 1991?] State Department cable,\ndeclassified in 1994, the number two person in the Embassy, Vicky\nHuddleston, reported to Washington on \"the surprisingly successful\nefforts of the Aristide government,...quickly reversed after the\ncoup\" (reported by Dennis Bernstein for Pacific News\nService).@note{For extensive discussion, see @u<Haiti After the Coup:\nSweatshop or Real Development>,\" National Labor Committee Education\nFund (New York), April 1993, a report based on visits and research by\nU.S. labor union factfinders, entirely ignored in the mainstream.\nBernstein, Pacific News Service, April 4-8, 1994.}\nSophisticates in Washington and New York could understand that all of\nthis is illusion. As Secretary of State Lansing had explained: \"The\nexperience of Liberia and Haiti show that the African race are devoid\nof any capacity for political organization and lack genius for\ngovernment. Unquestionably there is an inherent tendency to revert to\nsavagery and to cast aside the shackles of civilization which are\nirksome to their physical nature. Of course, there are many\nexceptions to this racial weakness, but it is true of the mass, as we\n\nknow from experience in this country. It is that which makes the\nnegro problem practically unsolvable.\"\nA more acceptable version of Aristide's months in offices is offered\nby @u<New York Times> Haiti correspondent Howard French. He reported\nafter the coup that Aristide had governed \"with the aid of fear,\"\nleaning \"heavily on Lavalas, an unstructured movement of affluent\nidealists and long-exiled leftists\" whose model was China's Cultural\nRevolution. Aristide's power hunger led to \"troubles with civil\nsociety.\" Furthermore, \"Haitian political leaders and diplomats say,\nthe growing climate of vigilantism as well as increasingly strident\nstatements by Father Aristide blaming the wealthier classes for the\npoverty of the masses encouraged\" the coup. \"Although he retains much\nof the popular support that enabled him to win 67% of the popular vote\nin the country's December 1990 elections, Father Aristide was\noverthrown in part because of concerns among politically active people\nover his commitment to the Constitution, and growing fears of\npolitical and class-based violence, which many believe the President\nendorsed.\"@note{French, @u<NYT>, Oct. 22, 1991; Jan. 12, 1992.}\nRelation to fact aside, the analysis provides some lessons in\nPolitical Correctness. Two-thirds of the population and their\norganizations fall outside of \"civil society.\" Those involved in the\npopular organizations and in local and national politics are not among\nthe \"politically active people.\" It is scandalous to tell the plain\ntruth about the responsibility of the kleptocracy for \"the poverty of\nthe masses.\" \"Fears of political and class-based violence\" are limited\nto the months when such violence sharply declined, its traditional\nperpetrators being unable, temporarily, to pursue their vocation.\nThese lessons should be remembered as Washington moves to construct a\n\"civil society\" and \"democratic political order\" for this \"failed\nstate\" with its degenerate culture and people, quite incapable of\ngoverning themselves.\nIn reality, the two versions of what happened during the democratic\ninterlude are closer than it may seem on the surface. The \"remarkably\nadvanced\" array of popular organizations that brought the large\nmajority of the population into the political arena is precisely what\nfrightened Washington and the mainstream generally. They have a\ndifferent understanding of \"democracy\" and \"civil society,\" one that\noffers no place to popular organizations that allow the overwhelming\nmajority a voice in managing their own affairs. By definition, the\n\"political leaders\" of such popular organizations have only \"meager\"\ndemocratic credentials, and can therefore be granted only symbolic\nparticipation in the \"democratic institutions\" that we will construct\nin accord with our traditional \"prodemocracy policies.\" So the\ngovernment and media have been instructing us since the coup removed\nthe radical extremist Aristide and his Maoist clique.\n\nThese simple truths account for much of what has happened in Haiti\nsince Aristide's election. Trouillot concludes his study by observing\nthat \"In Haiti, the peasantry is the nation.\" But for policymakers,\nthe peasantry are worthless objects except insofar as they can advance\ncorporate profits. They may produce food for export and enrich local\naffiliates of U.S. agribusiness, or flock to the city to provide\nsuper-cheap labor for assembly plants, but they have no further\nfunction. It is therefore entirely natural that USAID, while\nproviding $100 million in assistance to the private sector, should\nnever have provided a penny to the leading popular peasant\norganization, the Peasant Movement of Papaye (MPP); and that former\nUSAID director Harrison should see no special problem when MPP members\nare massacred by the military forces and should dismiss with contempt\nits call for moves to reinstitute the popularly elected President who\nwas committed to \"bottom-up\" rather than \"top-down\" democracy.\nSimilarly, it is hardly surprising that USAID should have denounced\nthe labor reforms Aristide sought to institute and opposed his efforts\nto raise the minimum wage to a princely 37 cents an hour. Nor should\nwe find it odd that USAID invested massively in the low wage assembly\nsector while wages sharply declined and working conditions fell to\nabysmal levels, but terminated all efforts to promote investment as\nthe democratically elected government took office. Rather, USAID\nreacted to this catastrophe by dedicating itself still more firmly to\nproviding the Haitian business community with what it called\n\"technical assistance in labor relations, development of a business\noriented public relations campaign, and intensified efforts to attract\nU.S. products assembly operations to Haiti.\" Given the unfortunate\ndemocratic deviation, USAID's task, in its own words, was to \"work to\ndevelop sustainable dialogue between the government and the business\ncommunity\"; no comparable efforts for workers and peasants were needed\nwhen Haiti was run by U.S.-backed killers and torturers. All of this\nconforms well to USAID's conception of \"processes of democratic\ninstitutional reform\" as those that \"further economic liberalization\nobjectives.\"@note{@u<Haiti After the Coup>.}\nSimilarly, there is no reason to be surprised that U.S. elites\nsuddenly began to show a sensitive concern for human rights and\ndemocracy just as human rights violations precipitously declined and\ndemocracy (though not in the preferred \"top-down\" sense) began to\nflourish. Amy Wilentz observes that during Aristide's brief term,\nWashington suddenly became concerned with \"human rights and the rule\nof law in Haiti.\" \"During the four regimes that preceded Aristide,\"\nshe writes, \"international human-rights advocates and democratic\nobservers had begged the State Department to consider helping the\ndemocratic opposition in Haiti. But no steps were taken by the United\nStates to strengthen anything but the executive and the military until\nAristide won the presidency. Then, all of a sudden, the United States\nbegan to think about how it could help those Haitians eager to limit\nthe powers of the executive or to replace the government\n\nconstitutionally.\" The State Department \"Democracy Enhancement\"\nproject was \"specifically designed to fund those sectors of the\nHaitian political spectrum where opposition to the Aristide government\ncould be encouraged,\" precisely as \"prodemocracy policies\" dictate.\nThe institutions and leaders that merited such support are just the\nones that survived the military coup, also no surprise.@note{Wilentz,\n@u<Reconstruction>, vol. 1.4 (1992).}\n@subheading<3. After the Coup>\nWilentz reports further that immediately after the September 30 coup,\nthe State Department apparently \"circulated a thick notebook filled\nwith alleged human rights violations\" under Aristide -- \"something it\nhad not done under the previous rulers, Duvalierists and military\nmen,\" who were deemed proper recipients for aid, including military\naid, \"based on unsubstantiated human-rights improvements.\" @u<Toronto\nStar> reporter Linda Diebel adds details. A \"thick, bound dossier\" on\nAristide's alleged crimes was presented by the coup leader, General\nCedras, to OAS negotiators. On October 3, U.S. Ambassador Alvin Adams\nsummoned reporters from the @u<New York Times>, @u<Washington Post>,\nand other major U.S. journals to private meetings where he briefed\nthem on these alleged crimes, reportedly presenting them with the\n\"dossier\" -- which, we may learn some day, was compiled by U.S.\nintelligence and provided to its favorite generals. The Ambassador\nand his helpers began leaking the tales that have been used since to\ndemonstrate Aristide's meager democratic credentials and his\npsychological disorders.@note{Diebel, @u<Star>, Oct. 10, 1991; Nov.\n14, 1993.}\nThe approved version is reflected by coverage of human rights abuses\nafter the coup. As shown in a study by Boston Media Action, while the\nmilitary were rampaging, the press focussed on abuses attributed to\nAristide supporters, less than 1% of the total but the topic of 60% of\nthe coverage in major journals during the two weeks following the\ncoup, and over half of coverage in the @u<New York Times> through\nmid-1992. During the two-week period after the coup, Catherine\nOrenstein reports, the @u<Times> \"spent over three times as many\ncolumn inches discussing Aristide's alleged transgressions [as] it\nspent reporting on the ongoing military repression. Mass murders,\nexecutions, and tortures that were reported in human rights\npublications earned less than 4% of the space that the @u<Times>\ndevoted to Haiti in those weeks.\" A week after the coup, the\n@u<Washington Post> accused Aristide of having organized his followers\ninto \"an instrument of real terror,\" ignoring the 75% reduction in\nhuman rights abuses during his term reported by human rights\ngroups.@note{Boston Media Action report, distributed by Haiti\nCommunications Project (Cambridge); @u<Z magazine>, March 1993.\nOrenstein, NACLA @u<Report on the Americas>, July/August 1993.}\nWhile attention was directed to the really important topic of the\n\n\"class-based violence\" of Aristide and the popular movements, the\nU.S.-trained military and police were conducting their reign of\nterror, \"ruthlessly suppressing Haiti's once diverse and vibrant civil\nsociety,\" Americas Watch reported. Though \"Washington's capacity to\ncurb attacks on civil society was tremendous, this power was largely\nunexercised by the Bush administration,\" which \"sought to convey an\nimage of normalcy\" while forcefully returning refugees. The terror is\nfunctional: it ensures that even if Aristide is permitted to return,\n\"he would have difficulty transforming his personal popularity into\nthe organized support needed to exert civilian authority,\" Americas\nWatch observed in early 1993, quoting priests and others who feared\nthat the destruction of the popular social organizations that \"gave\npeople hope\" had already undermined the great promise of Haiti's first\ndemocratic experiment.@note{Americas Watch and National Coalition for\nHaitian Refugees, @u<Silencing a People> (Human Rights Watch, 1993).}\nThe coup and ensuing terror revived the flow of refugees that had\nlapsed under Aristide. The Bush Administration ordered the Coast\nGuard and Navy to force them back, or to imprison them in the U.S.\nmilitary base in Guantanamo until a court order terminated the\nshocking practices there. During the presidential campaign, Clinton\nbitterly condemned these cruel policies. On taking over in January\n1993, he at once tightened the noose, imposing a still harsher\nblockade. Forceful return of refugees continued in violation of\ninternational law and human rights conventions. Clinton's increased\nbrutality proved to be a grand success. Refugee flow, which had\nreached over 30,000 in 1992, sharply declined under Clinton's\nministrations, to about the level of 1989, before the sharp decline\nunder Aristide.@note{@u<USA Today>, March 2, 1994.}\nThe official story is that these are \"economic refugees,\" not victims\nof political persecution who would be eligible for asylum. The onset\nof poverty can be quite precisely dated: to the date of the coup.\nDuring Aristide's term, refugee flow was slight, skyrocketing after\nthe coup though economic sanctions were minimal. These oddities are\nnoted by the indispensable journal @u<Haiti Info> published in Port\nau-Prince, in a discussion of a cable circulated to high officials by\nU.S. Ambassador William Swing. The 11-page cable, full of racist\nslanders, alleges that \"the Haitian left manipulates and fabricates\nhuman rights abuses as a propaganda tool\" and is \"wittingly or\nunwittingly assisted in this effort\" by human rights organizations and\nthe civilian monitors of the UN and OAS missions; all \"comsymps\" in\nthe terminology of an earlier day. The Embassy dismissed with a sneer\nthe reports of \"the sudden epidemic of rapes\" on the grounds that \"For\na range of cultural reasons (not pleasant to contemplate), rape has\nnever been considered or reported as a serious crime here.\" The\ntestimony of a man that his wife was raped and that he was badly\nbeaten under police custody, corroborated by a foreign nurse, is\ndismissed because he chose asylum in Canada (granted at once),\navoiding the U.S. Immigration and Naturalization Service (INS) -- a\n\ntransparent admission of iniquity. Clinton's Embassy attributes\nproblems in Haiti to \"a high level of structural, or endemic,\nviolence,\" which, again, is just \"part of the culture.\" Like the\npoverty that causes refugee flight, the \"structural\" factors causing\nviolence had an unexplained 8-month gap: during Aristide's tenure even\nhis most vehement opponents, the USAID-supported \"human rights\"\nadvocates who moved quickly into power after the coup, could compile\nonly 25 cases of \"mob violence\" and four crimes that could be\nconsidered political, a tiny fraction of the terror before, not to\nspeak of the atrocities that followed the coup.\nKenneth Roth, the director of Human Rights Watch, comments that the\ncable reveals the \"extreme antipathy for Aristide\" in the Embassy and\nits \"willingness to play down human rights abuses to prevent a\npolitical momentum to build for [Aristide's] return.\" It \"reflects a\ndislike and distrust of Aristide that has been widely felt in the\nAdministration -- though voiced only privately,\" @u<Times>\ncorrespondent Elaine Sciolino adds. In reality, the dislike is quite\npublic and widely reported, along with the fact that it has sent a\nvery clear message to the Haitian rulers, military and\ncivilian.@note{@u<Haiti Info>, May 21; Sciolino, May 9, 1994.}\nAs the Embassy cable was released, an experienced INS asylum officer\nin Haiti went public with his charges that thousands of \"egregious\ncases of persecution\" were rejected by the Haitian INS office, where\nthe \"entire process\" of asylum review \"had been politicized\" and under\n1% of legitimate petitions were accepted by racist and contemptuous\nofficials; similar accounts have been documented by human rights\norganizations, who have also denounced the very idea that petitioners\nshould have to identify themselves to the murderers by appearing at\nthe INS office. At the same time, a \"Top Secret\" memo of the U.S.\nInterests Section in Cuba was leaked. Addressed to the Secretary of\nState, the CIA, and the INS, the document complains about the lack of\ngenuine claims of political persecution in Cuba, contrary to policy\nneeds. The usual silence prevailed.@note{Dennis Bernstein, Pacific\nNews Service, April 4; @u<Cuba Action>, Spring 1994.}\nMeanwhile refugees from Cuba receive royal treatment while Haitians\nare returned to terror. That is nothing new. Of the more than 24,000\nHaitians intercepted by U.S. forces from 1981 to Aristide's takeover\nin 1991, 11 were granted asylum as victims of political persecution,\nin comparison with 75,000 out of 75,000 Cubans. In these years of\nterror, Washington allowed 28 asylum claims. During Aristide's\ntenure, with violence and repression radically reduced, 20 were\nallowed from a refugee pool perhaps 1/50th the scale. Practice\nreturned to normal after the military coup and the renewed terror. As\nalways, human rights are understood in purely instrumental terms: as a\nweapon to be selectively deployed for power interests, nothing more.\nThe democratically elected President will be acceptable to Washington\n\nand elite opinion generally only if he abandons his popular mandate,\nceding effective power to the \"moderates\" in the business world. The\n\"moderates\" are those who do not favor slaughter and mutilation,\npreferring to see the population driven to agroexport and the low-wage\nassembly sector. They constitute \"civil society,\" in the technical\nsense. Since the coup, the U.S. has demanded that Aristide agree to\n\"broaden the government\" in such a way as to place the \"moderates\" in\npower. Insofar as he refuses to transfer power into these proper\nhands, he is an \"extremist\" whom we can hardly support.\nWhile these are the basic terms of respectable discourse, the spectrum\nis not entirely uniform. It ranges from the far right, which is\nhonest and outspoken in its call for dismantling Haitian democracy, to\nthe more nuanced versions of the liberal Democrats. Taking a stand in\nthe middle, George Bush calls for abandoning Aristide because \"he has\nbecome unreliable\" and even \"turned on our president the other\nday\" (May 1994). Aristide should be dumped because his \"undemocratic\nbehavior...included fostering violence against his opponents,\"\naccording to another noted pacifist who has distinguished himself\nparticularly for his dedication to legality and democratic principle\n(Elliott Abrams).\nMoving toward the liberal end, a Clinton official explained in the\nlast days of 1993 that \"We're not talking about dumping Aristide or\nabout military power-sharing. But we have two adversaries who don't\nwant to compromise and we have to find enough of a middle to make a\nfunctioning democracy,\" marginalizing the extremists on both sides.\nThe elected President should be \"restored to power, at least\nnominally,\" World Peace Foundation president and historian Robert\nRotberg added; but also at most nominally, as all understand. The\nWashington director of the Inter-American Dialogue, Peter Hakim, urged\nin May 1994 that \"the US ought to separate out the notion of\nprotecting human rights, and reestablishing some semblance of society\nin Haiti, from restoring Aristide to power.\" \"So it is only honest for\nthe United States to tell Father Aristide that he has little hope of\nreturning to power without making large political compromises,\" as the\n@u<Times> editors phrased the common understanding a few weeks later.\nIn short, the traditional \"prodemocracy policies.\"@note{Bush, John\nLaidler, @u<BG>, May 13; Abrams, @u<WSJ>, May 6, 1994. Pamela\nConstable, @u<BG>, Dec. 25; Rotberg, @u<BG>, Dec. 29, 1993. Peter\nGrier, @u<CSM>, May 6; @u<NYT>, Feb. 21, 1994.}\nThe basic idea was outlined by Secretary of State Warren Christopher\nduring his confirmation hearings. Christopher \"expressed support for\nFather Aristide,\" Elaine Sciolino reported, \"but stopped short of\ncalling for his reinstatement as President. `There is no question in\nmy mind that because of the election, he has to be part of the\nsolution to this,' Mr. Christopher said. `I don't have a precise\nsystem worked out in my mind as to how he would be part of the\nsolution, but certainly he cannot be ignored in the\n\nmatter'.\"@note{@u<NYT>, Jan. 15, 1993.} With this ringing endorsement\nof democracy, the Clinton Administration took charge.\nAcross the spectrum, it is taken for granted that we have both the\nright and the competence to \"establish some semblance of society\" in\nHaiti, whose people are so retrograde as to have developed a\n\"remarkably advanced\" array of grass-roots organizations that gave the\nmajority of the population a place in the public arena. Plainly, they\ndesperately need our tutelage.\n@subheading<4. The Clinton Compromise>\nTo much acclaim, Washington finally succeeded in compelling Aristide\nto transfer authority to the \"moderates.\" Under severe pressure, in\nJuly 1993 the Haitian President accepted the U.S.-UN terms for\nsettlement, which were to allow him to return four months later in a\n\"compromise\" with the gangsters and killers. He agreed to appoint as\nPrime Minister a businessman from the traditional mulatto elite,\nRobert Malval, who is \"known to be opposed to the populist policies\nduring Aristide's seven months in power,\" the press announced with\nrelief, noting that he is \"generally well regarded by the business\ncommunity,\" \"respected by many businessmen who supported the coup that\nousted the President,\" and seen as \"a reassuring choice\" by coup-\nsupporters.\nShortly after these happy developments took place, UN/OAS observers\nreported, with little notice, that they were \"very concerned that\nthere is no perceptible lessening of human rights violations,\" and a\nfew weeks later, reported an increase in \"arbitrary executions and\nsuspicious deaths\" in the weeks following the UN-brokered accord, over\none a day in the Port-au-Prince area alone; \"the mission said that\nmany of the victims were members of popular organizations and\nneighborhood associations and that some of the killers were police,\"\nwire services reported.@note{AP, @u<BG>, July 18, 27; @u<NYT>, July\n26; Reuters, @u<BG>, July 27; Reuters, @u<BG>, Aug. 12, 1993.}\nExpected to be a transitional figure, Malval resigned at the year's\nend. His presence did, however, serve a useful role for Washington\nand its media, diverting attention to a \"political settlement\" while\nattacks on the popular organizations and general terror mounted,\nAristide's promised return was blocked, and new initiatives were put\nforth to transfer power to traditional power centers (\"broadening the\ngovernment\"). Malval's presence also offered the press a great method\nto bring out Aristide's unreasonable intransigence. He couldn't even\ncome to terms with \"his handpicked Prime Minister,\" a phrase that\nritually accompanied the name \"Robert Malval.\" In a typical exercise,\nHoward French opened a report of Malval's resignation by writing:\n\"Three days after formally resigning, the handpicked Prime Minister of\nHaiti's exiled President lashed out this weekend at the man who\nappointed him\" -- hammering home the message in the fashion that\n\nbecame so routine as to be comical. Malval described Aristide as an\n\"erratic figure\" with a \"serious ego problem,\" French continued,\nreferring to his commitment to restore the democratically-elected\ngovernment.@note{@u<NYT>, Dec. 20, 1993.}\nAs the date for Aristide's scheduled October 30 return approached,\natrocities mounted high enough to gain some attention, though no\naction. Amidst reports of \"terrifying stories\" of terror, murder, and\nthreats to exterminate all members of the popular organizations, the\nClinton Administration announced that the UN Mission \"will rely on the\nHaitian military and police to maintain order\" -- that is, on the\nkillers. \"It is not a peacekeeping role,\" Secretary of Defense Aspin\nexplained: \"We are doing something other than peacekeeping here.\"\nMeanwhile, the press emphasized the concerns of U.S. officials that\nAristide \"isn't moving strongly to restore democratic rights,\" from\nhis exile in Washington. \"Even as the situation has grown worse,\nforeign diplomats have increasingly blamed Father Aristide for what\nthey say is his failure to take constructive initiatives,\" Howard\nFrench wrote, using the standard device to disguise propaganda as\nreporting.@note{Pamela Constable, @u<BG>, Oct. 1; Steven Holmes,\n@u<NYT>, Oct. 1; @u<WSJ>, Oct. 1; Howard French, @u<NYT>, Sept. 22,\n1993.}\nThe stage was set for ignoring the October deadline, as the U.S. stood\nhelplessly by, unable to bring the uncompromising and violent\nextremists on both sides to accept \"democracy.\"\nReviewing these mid-1993 developments, Ian Martin, who directed the\nOAS/UN mission from April through December 1993, writes that one basic\nproblem was U.S. insistence on adding \"a mostly American military\ncomponent to the negotiators' proposals.\" Aristide's call for reducing\nthe Haitian army to 1000 men was rejected. \"The Haitian high command,\nfor its part, sought U.S. assistance to ensure the army's future.\" The\ngenerals trusted the U.S. and \"mistrusted the U.N. and the proposal\nfor the Canadians and French, both more committed supporters of\nAristide than the United States, to take the lead in the police\ncontingent. The U.S. hoped to preserve the military -- an institution\nit had often assisted and in fact had created for purposes of internal\ncontrol during the American occupation of 1915-34.\" Haitian army\n\"resistance was encouraged whenever they perceived that the United\nStates, despite its rhetoric of democracy, was ambivalent about that\npower shift\" to the popular elements represented by Aristide. There\nwas no shortage of such occasions.\nThe crucial signal, Martin and others agree, came on October 11, when\nthe USS @u<Harlan County> was scheduled to disembark U.S. and Canadian\ntroops at Port-au-Prince. The military organized \"a hostile\ndemonstration of armed thugs,\" Martin observes, and \"instead of\nwaiting in the harbor while the Haitian military was pressured to\nensure a safe landing, the @u<Harlan County> turned tail for\n\nGuantanamo Bay,\" leaving officials of the UN/OAS mission \"aghast\";\nthey \"had been neither consulted nor informed of the decision by\nPresident Bill Clinton's National Security Council to retreat.\" \"The\norganizers of the Haitian protest could hardly believe their success,\"\nMartin continues. The leader of the paramilitary organization FRAPH,\nresponsible for much of the terror, said that \"My people kept wanting\nto run away, but I took the gamble and urged them to stay. Then the\nAmericans pulled out! We were astonished. That was the day FRAPH was\nactually born. Before, everyone said we were crazy, suicidal, that we\nwould all be burned if Aristide returned. But now we know he is never\ngoing to return.\" The military got the message too, loud and clear.\nPerhaps they were even notified in advance. @u<New York Daily News>\ncorrespondent Juan Gonzalez learned of the October 11 port\ndemonstration the day before at a Duvalierist meeting attended by U.S.\nEmbassy personnel. The following day, he asked in print: \"How can two\n@u<Daily News> reporters who have only visited Haiti on a few\noccasions learn beforehand of secret plans to sabotage the landing of\nour troops, while our vaunted officialdom claims it was caught flat\nfooted?\" How indeed.\nAnother possible line of communication is suggested in a report by\nFather Antoine Adrien, former head of Aristide's religious order in\nHaiti and a close associate. Just before the ship \"turned tail,\" he\ninformed the Catholic Church press that Haitian military officers had\nnot only attended training school in Fort Benning, Ga., in 1992, but\nthat \"some were there as recently as the previous week\" -- October\n1993. \"How are you going to tell those people they have no backing in\nthe United States?,\" Father Adrien asked. That Haitian army officers\nreceived training in the U.S. after the coup was confirmed in an\ninternal Pentagon document, including eight officers who started\ncourses in early 1992. The program they joined is designed to expose\n\"future leaders of foreign defense establishments\" to \"American\nvalues, regard for human rights and democratic institutions,\"\naccording to the Defense Secretary's report to the President for 1993.\nEarlier graduates include the leading killers in Haiti, Central\nAmerica, and elsewhere.\nWhat lay behind the decision to turn tail was explained by Deputy\nUnder Secretary of Defense Walter Slocombe, who \"boasted at a cocktail\nparty that by turning back the U.S.S. Harlan County, he had helped\nsave the United States from a `small war',\" the @u<Times> reported six\nmonths later: \"He vowed that the Pentagon would not risk American\nsoldiers' lives to put `that psychopath' back in power.\"@note{Martin,\n@u<Foreign Policy>, Summer 1994. Gonzalez, @u<NYDN>, Oct. 12, cited\nby Kim Ives, NACLA @u<Report on the Americas>, Jan./Feb., 1994.\nPatricia Zapor, @u<Birmingham Catholic Press>, Oct. 15, 1993; Paul\nQuinn-Judge, @u<BG>, Dec. 6, 1993. Elaine Sciolino, et al., @u<NYT>,\nApril 29, 1994.}\n\nWhile messages were coming through to the military, the Haitian people\nwere deprived of the one voice they longed to hear. \"Senior Clinton\nadministration officials are embroiled in a fight over whether to\nallow...Aristide to broadcast into the junta-ruled country using\nairborne U.S. military transmitters,\" Paul Quinn-Judge reported in May\n1994. The USIA is opposed, fearing that \"the plan may violate\ninternational law,\" always a prime concern in Washington. USIA was\nalso concerned that such broadcasts \"would provide Aristide with an\nuncomfortably direct means to communicate with Haitians, who elected\nhim by an overwhelming margin in 1990.\" His oratory has been known to\n\"create problems,\" a classifed USIA memorandum of May 23 noted, asking\nwhether \"we wish to have the responsibility for having given him the\nmeans to broadcast whatever he chooses to Haiti.\" He might even\nchallenge the U.S. publicly \"the first time we refuse to air\nsomething.\" It wouldn't even suffice to have him submit his scripts in\nadvance, because of the \"highly nuanced language and context\" of a\nradio broadcast; who knows what thoughts this devious creature might\nconvey by his tone of voice? \"Debate over the idea...underscores the\ncontinuing ambivalence and nervousness with which some senior\nofficials view Aristide,\" Quinn-Judge observed.@note{@u<BG>, May 28,\n1994.}\nAfter the military coup, the OAS instituted a toothless embargo, which\nthe Bush Administration reluctantly joined, while making clear that it\nwas not to be taken seriously. The reasons were explained a year\nlater by Howard French: \"Washington's deep-seated ambivalence about a\nleftward-tilting nationalist whose style diplomats say has sometimes\nbeen disquietingly erratic\" precludes any meaningful support for\nsanctions against the military rulers. \"Despite much blood on the\narmy's hands, United States diplomats consider it a vital\ncounterweight to Father Aristide, whose class-struggle\nrhetoric...threatened or antagonized traditional power centers at home\nand abroad.\" Aristide's \"call for punishment of the military\nleadership\" that had slaughtered and tortured thousands of people\n\"reinforced a view of him as an inflexible and vindictive crusader,\"\nand heightened Washington's \"antipathy\" towards the \"clumsy\" and\n\"erratic\" extremist who has aroused great \"anger\" because of \"his\ntendency toward ingratitude.\"@note{French, @u<NYT>, Sept. 27; Oct. 8,\n1992.}\nThe \"vital counterweight\" is therefore to hold total power while the\n\"leftward tilting nationalist\" remains in exile, awaiting the\n\"eventual return\" that Bill Clinton promised on the eve of his\ninauguration. Meanwhile, the \"traditional power centers\" in Haiti and\nthe U.S. will carry on with class struggle as usual, employing such\nterror as may be needed in order for plunder to proceed unhampered.\nAnd as the London @u<Financial Times> added at the same time,\nWashington was proving oddly ineffective in detecting the \"lucrative\nuse of the country in the transhipment of narcotics\" by which \"the\nmilitary is funding its oil and other necessary imports,\" financing\n\nthe necessary terror and rapacity -- though U.S. forces seem able to\nfind every fishing boat carrying miserable refugees. Nor had\nWashington figured out a way to freeze the assets of \"civil society\"\nor to hinder their shopping trips to Miami and New York, or to induce\nits Dominican clients to monitor the border to impede the flow of\ngoods that takes care of the wants of \"civil society\" while the\nembargo remains \"at best, sieve-like.\"@note{Canute James, @u<FT>, Dec.\n10, 1992.}\nMeanwhile Washington continued to provide Haitian military leaders\nwith intelligence on narcotics trafficking -- which they naturally\nused to expedite their activities and tighten their grip on power. It\nis not easy to intercept narcotraffickers, the press explained,\nbecause \"Haiti has no radar,\" and evidently the U.S. Navy and Air\nForce lack the means to remedy this deficiency.@note{Douglas Farah,\n@u<WP weekly>, Nov. 1-7, 1993.}\nUnder Clinton, matters only got worse. An April 1994 report of Human\nRights Watch/Americas documents the increasing terror and State\nDepartment apologetics and evasions, condemning the Administration for\nhaving \"embraced a murderous armed force as a counterweight to a\npopulist president it distrusts.\"\nOn February 4, 1992, the Bush Administration lifted the embargo for\nassembly plants, \"under heavy pressure from American businesses with\ninterests in Haiti,\" the @u<Washington Post> reported, with its\neditorial endorsement; the lobbying effort was assisted by Elliott\nAbrams, Human Rights Watch noted. For January-October 1992, U.S.\ntrade with Haiti came to $265 million, according to the Department of\nCommerce.@note{HRW and National Coalition for Haitian Refugees,\n@u<Terror Prevails in Haiti>, April 1994. @u<WP weekly>, Feb. 17, 10,\n1992 (Lee Hockstader, editorial). See my \"Class Struggle as Usual,\"\n@u<Letters from Lexington> (Common Courage, 1993); reprinted from\n@u<Lies of Our Times>, March 1993.}\nAs Clinton took over, the embargo became still more porous. The\nDominican border was left wide open. Meanwhile, U.S. companies\ncontinued to be exempted from the embargo -- so as to ease its effects\non the population, the Administration announced with a straight face;\nonly exemptions for U.S. firms have this curious feature. There were\nmany heartfelt laments about the suffering of poor Haitians under the\nembargo, but one had to turn to the underground press in Haiti, the\nalternative media here, or an occasional letter to learn that the\nmajor peasant organization (MPP), church coalitions, labor\norganizations, and the National Federation of Haitian Students\ncontinued to call for a real embargo.@note{Eyal Press and Jennifer\nWashburn, letters, @u<NYT>, March 3, 1994.}\nCuriously, some of those most distressed by the impact of the embargo\non the Haitian poor were the most forceful advocates of a still\n\nharsher embargo on Cuba, notably liberal Democrat Robert Torricelli,\nauthor of the stepped-up embargo that the Bush Administration accepted\nunder pressure from the Clintonites. Evidently, hunger causes no pain\nto Cuban children, another oddity that passed unnoticed, along with\nthe U.S.-Haiti trade figures.\nClinton's tinkering with the embargo also passed without comment here,\nthough the facts are known, and occasionally even leak through, as in\na tiny Feb. 13 Reuters dispatch in the @u<New York Times> reporting\nefforts of human rights advocates to convince the President to observe\nthe embargo. \"US imports from Haiti rose by more than half last year\n[1993],\" the @u<Financial Times> reported in London, \"thanks in part\nto an exemption granted by the US Treasury for imports of goods\nassembled in Haiti from US parts.\" U.S. exports to Haiti also rose in\n1993. Exports from Haiti to the United States included food (fruits\nand nuts, citrus fruit or melons) from the starving country, which\nincreased by a factor of 35 from January-July 1992 to January-July\n1993. The federal government was among the purchasers of the\nbaseballs imported from Haiti (duty free), stitched by women who work\n11 hour days with a half-hour break in unbearable heat without running\nwater or a working toilet, for 10 cents an hour if they can meet the\nquota (few can), using toxic materials without protection so that the\nU.S. importer can advertise proudly that their softballs are \"hand\ndipped for maximum bonding.\" The manufacturers are the wealthy Haitian\nfamilies who supported the coup and have gained new riches during the\nembargo, along with others profiting handsomely from the black market,\nsuch as the fuel supplier for the U.S. embassy. The \"assembly zone\"\nloophole, criticized by U.S. labor unions and at the UN Security\nCouncil by France and Canada in January, was extended by the Clinton\nAdministration on April 25, 1994, four days after announcing that it\nwould seek to tighten UN sanctions; the latter announcement was\nreported. On the same day, the U.S. Coast Guard returned 98 refugees\nto military authorities, 18 of them at once arrested.\n\"The Clinton administration still formally declares its support for Mr\nAristide, but scarcely disguises its wish for a leader more\naccommodating to the military,\" the @u<Financial Times> reported,\nwhile \"European diplomats in Washington are scathing in their comments\non what they see as the US's abdication of leadership over\nHaiti.\"@note{Reuters, @u<NYT>, Feb. 14; George Graham, @u<FT>, Feb.\n20, 1994. Report of National Labor Committee Education Fund, Feb. 15;\nApril 1994. See Charles Kernaghan, @u<Multinational Monitor>, March\n1994; @u<Counterpunch> (IPS), April 1, 1994.\n@u<Haiti Progres>,\nApril 27-May 3, 1994. Oil, Douglas Farah, @u<WP weekly>, May 30,\n1994. Note that the trade increases are not attributable to the\nrescinding of the embargo from July to October 1993.}\nIn his January 1994 testimony to Congress on \"Threats to the U.S. and\nIts Interests Abroad,\" the Director of the CIA predicted that Haiti\n\"probably will be out of fuel and power very shortly.\" \"Our\n\nintelligence efforts are focused on detecting attempts to circumvent\nthe embargo and monitoring its impact,\" and \"any indication of an\nimminent exodus.\" The \"Threats to the U.S.\" were contained with the\nusual selectivity and skill. \"Exodus\" from the charnel house was\neffectively blocked, while the press reported an \"oil boom\" as\n\"diplomats expressed amazement at the extent of the trafficking\"\norganized by the Haitian and Dominican armies, and the former assured\nreporters that \"The military is not concerned about fuel shortages; it\nhas plenty.\"@note{Opening Statement, Director of Central Intelligence,\nU.S. Senate Select Committee on Intelligence, Jan. 25, 1994. Howard\nFrench, @u<NYT>, Feb. 14, March 13, 1994.}\nThe Clinton Administration has scarcely departed from the\nprescriptions outlined by the @u<Washington Post> and @u<New York\nTimes> as it came into office.@note{@u<WP>, Dec. 20, 1992; @u<NYT>,\nJan. 9, 1993.} The preferred solution, John Goshko explained in the\n@u<Post>, would \"delay indefinitely\" the return to Haiti of the\n\"radical priest with anti-American leanings\" whose \"strident populism\nled the Haitian armed forces to seize power,\" and would \"allow Bazin\nor some other prime minister to govern in his place.\" Bazin was then\nprime minister under army rule, but was having problems, because\nalthough \"well-known and well-regarded in the United States,\"\nunfortunately \"the masses in Haiti consider him a front man for\nmilitary and business interests.\" A replacement would therefore be\nneeded to represent the interests of the moderates. In the @u<Times>,\nHoward French indicated the scale of the required delay: \"In the past,\ndiplomats have said the Haitian President could return only after a\nsubstantial interim period during which the country's economy was\nrevived and all its institutions, from the army itself to the\njudiciary to health care and education, were stabilized.\" That should\novercome the danger of Aristide's \"personalist and electoralist\npolitics.\" But unfortunately, the troublesome priest has been\nrecalcitrant: \"Father Aristide and many of his supporters have held\nout for a quick return,\" undermining the moderate course.\nAs understood on all sides, the \"delay\" need not be too long.\nAristide's term ends in 1996, and he is barred from running again. By\nthen military terror should have sufficiently intimidated the\npopulation and demolished popular organizations so that \"free\nelections\" can be tolerated, as in the Central American terror states,\nwithout too much fear of any threat to \"civil society\" from the\nrabble.\n@subheading<5. The May 1994 Reversal>\nPlans proceeded on course into early 1994. By then, the cynicism and\nbrutality of U.S. policy had become too blatant for the usual cover-\nup, particularly after Clinton's point man Lawrence Pezzullo revealed\nin congressional testimony that the plan that the Administration had\ntouted as the product of negotiations among Haitian democrats,\n\ndenouncing Aristide for his intransigence in rejecting it (it made no\nprovision for his return), had in fact been produced by the State\nDepartment, which brought to Washington selected Haitians to ratify\nit, among them Duvalierist collaborators of the murderous police chief\nCol. Francois. Something new was needed.\nPezzullo was replaced by William Gray, a more credible voice. In May\nClinton instituted a new and more humane refugee policy, which \"will\nmean the forcible return of 95 percent of boat people instead of 100\npercent,\" a Human Rights Watch Haiti analyst observed, pointing out\nthat \"The US policy excludes people who are not high profile but are\npersecuted nonetheless.\" The new policy is just \"window dressing,\" the\nnational refugee coordinator of Amnesty International added.\nBut 5% of the boat people fleeing persecution is beyond what the\nUnited States can be expected to handle. It will \"devastate Florida,\"\na Republican congressional staff member complained. Explaining a few\ndays later why the U.S. might have to invade, \"Mr. Clinton saved his\nstrongest warning for what he described as `the continuous\npossibility' that Haitians left poor and desperate under military rule\nwould join in a `massive outflow' and seek refuge in the United\nStates,\" the @u<Times> reported; the terms \"poor and desperate\" convey\nthe doctrine that these are economic refugees. Overcrowded and\ndestitute, the United States plainly cannot bear the burden of\naccepting refugees or even housing them until their claims of\npersecution are rejected; and surely it has no historical\nresponsibilities in the matter. The President piteously pleaded with\nother countries to help us in our plight.@note{Peter Grier, @u<CSM>,\nMay 16; Douglas Jehl, @u<NYT>, 1994.}\nCuriously, the anguished debate over this issue missed the obvious\ncandidate: Tanzania, which had just then accommodated hundreds of\nthousands of Rwandans, and could surely come to the rescue of the\nbeleaguered United States by accepting a few thousand more black\nfaces.\nOn May 21, an embargo was announced which, for the first time, may\nhave some serious intent. The \"assembly plant\" exemption was quietly\nremoved, and the Dominican border was (at least briefly) closed. The\nlong-known involvement of the Haitian military in narcotrafficking was\nalso officially reported. \"We're not going to say, `Let the masses and\nthe middle class suffer, but the very wealthy don't have to pay a\nprice,\" a senior Administration official stated. \"Even Wealthy\nHaitians Starting to Feel Pinched,\" a @u<Times> headline read, again\nletting out the real story of the efforts to \"restore democracy\"\nduring the 2 1/2 years since the coup. Government statements and\npress reports tacitly conceded what had always been clear: that the\nU.S. has the means, far short of military intervention, to restore\ndemocracy in Haiti, but had no intention of doing so, and still does\nnot. What has always been required is a clear declaration of intent\n\nto restore democracy, but that cannot be given, because there is no\nsuch intent. The military and their civilian allies understand that\nperfectly well.\nIn the following weeks, the U.S. banned commercial air flights and\nfinancial transactions, while leaving crucial loopholes open.\nPersonal assets of the coup supporters were not frozen, so they can\nwithdraw funds from U.S. bank accounts at will and transfer money to\nbanks abroad, Administration officials acknowledged -- a matter that\nmay be academic, the chair of the Congressional Black Caucus, Kweisi\nMfume, observed, since \"the dictators of Haiti have long ago moved\ntheir assets in anticipation of this.\" The sanctions also permit the\nfamilies that have long dominated the economy to hold on to the\nmonopoly of the food trade that is a major source of their wealth,\nincluding the Mevs family, which is building \"a huge new oil depot\nhere to help the army defy the embargo,\" French reported, adding that\n\"Washington's hesitancy in taking firm action against the business\nelite and the army is a result of a long history of close ties and\nperceived common interests,\" if not fear of \"a spate of embarrassing\nrevelations made by Haitians in reprisal for a crackdown.\"\nAfter sanctions were finally imposed in May 1994, a U.S. diplomat\nconceded that the continuing failure to move against the richest\nfamilies has left \"a perception out there of sending mixed messages\nand having double agendas.\" Other diplomats and Haitian experts agree\nthat the decision not to target key civilian supporters of the coup is\nyet another mixed signal, noting particularly the relief granted the\nMev, Brandt, Acra and Madsen families, who \"still have a role to\nplay,\" a U.S. Embassy source informed the press, though they have made\nno effort to disguise their support for the coup. Washington is\n\"imposing sanctions designed to strangle the country into restoring\nAristide at the same time they are telling the people who backed the\ncoup and are in business with the military in keeping Aristide out\nthat they are free to lead their privileged lives,\" another diplomat\nsaid. Haitian Senators who lead the anti-Aristide movement were not\ndenied their permanent U.S. resident status, including Bernard\nSansaricq, who played a leading role in installing the puppet civilian\ngovernment with its new \"president\" Emile Jonassaint, appointed to\nreplace Aristide.@note{Drugs, Tim Weiner, @u<NYT>, April 22; Howard\nFrench, @u<NYT>, June 8, 1994. Stephen Greenhouse, French, @u<NYT>,\nJune 11, May 25; Pamela Constable, @u<BG>, June 11; Kenneth Freed,\n@u<LA Times>, May 25, 1994.}\nMeanwhile, the serious work of undermining the basis for democracy\ncontinues unhampered. By the time Clinton took office, as Americas\nWatch reported, the terror had already decimated the popular\norganizations that would allow Aristide \"to exert civilian authority,\"\neven if he were eventually permitted to return. As Clinton finally\nagreed to sanctions 16 months later, Douglas Farah reported in the\n@u<Washington Post> that \"the army and its allies have damaged\n\ndemocratic institutions and grass-roots organizations that had begun\nto grow in Haiti to such an extent that they would take years to\nrebuild even if Haiti's military leaders surrendered power, according\nto diplomats and human rights monitors.\" \"The Duvalierist system will\ncontinue, with or without the return of Aristide,\" the leader of a\nnow-clandestine pro-Aristide group said, a judgment endorsed by \"a\nveteran human rights worker\" who prefers anonymity \"because of\nnumerous threats against his life.\" \"The Duvialierists have many fine\ndays ahead of them in this country,\" he said: \"People are losing their\nability to make things happen here, and it will take many years to\nreverse that under the best of circumstances.\" Even nonpolitical\ncommunity organizations have been repressed, thousands of community\nleaders have been driven into hiding along with hundreds of thousands\nof others, while over 4000 have been murdered outright. The \"massive\nterrorism,\" Farah reports, is \"aimed at dismantling the last vestiges\nof organized support\" for Aristide, while the civilian allies of the\narmy and police in FRAPH have \"become a very efficient machine of\nrepression,\" which will remain the only authority even if Aristide\nwere to return, the same human rights worker comments. Members of the\npopular organizations interviewed in hiding have \"applied for\npolitical asylum at the U.S. Embassy and been denied.\"@note{@u<WP\nweekly>, April 25, May 16, 1994.}\nTo ensure a smooth transition to the intended post-coup system, with\nthe \"moderates\" in charge and the Duvalierists preserving order, FRAPH\nand USAID-funded groups linked to it are establishing a monopoly of\nsocial services, so that \"the poor who are compliant and docile get\nhealth services,\" a Haitian doctor explains. This is the \"soft side\"\nof counterinsurgency, on the model of Guatemala and other terror\nstates. Meanwhile we are to ponder the question of whether Haitians\n\"can muster the maturity and cohesiveness to forge a working\ndemocracy\" (Howard French), or whether we must labor for decades in a\n(perhaps vain) effort to overcome the defects -- cultural, if not\ngenetic -- that had been discerned by Wilson's Secretary of State and\nCarter's USAID director in Haiti.@note{NACLA, Observers Delegation\nreport, Jan. 1994; @u<Report on the Americas>, Mar/April 1994;\n@u<Haiti News Digest> (Haiti Communications Project, Boston), May\n1994. French, @u<NYT>, June 6, 1994.}\nAs the Bush Administration prepared to hand over the reins, a senior\nUN official observed that its dislike of Aristide was an open secret:\n\"Two lines about Haiti co-existed at the time. There was the line\nabout `return to democracy,' which was for public consumption. And\nthen there was a second line, spoken privately within the\nadministration. And the Haitian military knew it perfectly well.\" A\nyear later, after the @u<Harlan County> affair gave birth to FRAPH, a\nFrench military adviser updated the picture: \"Do you know what the\nreal problem is? The Americans don't want Aristide back, and they\nwant the rest of us out\" -- \"the rest of us\" being Canada, France and\nVenezuela, the other three of \"Aristide's so-called Four\n\nFriends.\"@note{Kate Doyle, @u<World Policy Journal>, Spring 1994;\nLinda Diebel, @u<Toronto Star>, Nov. 14, 1993.}\nThat this judgment is exactly right has been apparent throughout. It\nshould be clear, however, that the issue is not Aristide personally.\nThe problem is the forces he represents: the lively and vibrant\npopular movements that swept him into office, greatly alarming the\nrich and powerful in Haiti and their American counterparts, and\nteaching lessons in democracy that have to be silenced, for who can\ntell what minds they might reach?\n@blankspace<1 line>\n@flushleft{Noam Chomsky\nJune 14, 1994}\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Noam Chomksy on the Future of Humanity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/14fd3dc92c58480dfa32bd4fbc3f51aa_MIT24_912s17_chomsky_future.pdf",
      "content": "Reading UK 5-17\nMayr-Sagan\n50 billion species. Beetles, bacteria, large mammals. Humans a statistical blip last\nfew 100 years. Mayr: The history of life on Earth refutes the claim that \"it is better\nto be smart than to be stupid.\" Ave life span: 100,000 yrs.\nModern humans emerged about 200kya. They are now engaged in a dedicated\neffort to establish Mayr's thesis, an enterprise that that has been underway since\nthe end of World War II. During this period, human intelligence has succeeded in\nconjuring up a perfect storm: It has created two huge sledgehammers poised to\ndestroy us, while systematically eroding the most important line of defense against\nself-destruction, with particular dedication in the past generation.\nThe two awesome challenges to decent survival are, of course, nuclear weapons\nand environmental catastrophe. The best defense would be functioning democracy\nin which informed and engaged citizens join together to develop means to\novercome the threats - as can be done. In crucial ways to which I will return\ndirectly, policy-making throughout this era has often enhanced the threats, for\nprincipled reasons, and has undermined functioning democracy by excluding the\npopulation from participation, even awareness. These dangerous tendencies have\nbeen significantly enhanced by the socioeconomic policies of the past generation,\nthe neoliberal era. These policies have sharply concentrated wealth, hence political\npower, and have undermined institutions that might be responsive to the public will.\nThey are well designed to diminish functioning democracy, with consequences that\nwe see before us over much of the world, dramatically right now in the West.\nIt is as if the species is determined to prove that Ernst Mayr's thesis is correct: that\nintelligence is a lethal mutation, and we have perhaps outlived our allotted time on\nearth.\nLet me try to bring together various strands of recent history that intertwine, I think,\nto show that this picture of a perfect storm is all too plausible.\nThe end of WWII was one of the most important dates of human history. It was a\nmoment of joy, and also of horror, with the dawn of the nuclear age. I remember\nwell my own feelings when the grim news was announced on August 6: relief that\nthe war was over, horror at the events and their import, and astonishment that so\nfew seemed to care either about the enormity of what had just happened, or that we\n\nhad entered into what might be the final era of human existence, the nuclear age, in\nwhich human intelligence had created the means for terminal destruction.\nIt was not understood at the time, but the end of WWII also signaled the beginning\nof another era that threatens organized human existence: the Anthropocene, a new\ngeological epoch in q human activity is dramatically changing env. E have been\ndebates about its inception. World Geological Society has settled on 1950, partly\nbecause of radioactive elements dispersed across the planet by nuclear bomb tests\nand also other consequences of human action, including sharp increase in\ngreenhouse emissions. So nuclear age and Anthropocene coincide.\nOne index of the severity and imminence of crisis is provided graphically by the\nfamous doomsday clock of the Bull of AS. Scientists, political analysts meet to\nevaluate the state of the world and to determine how close we are to terminal\ndisaster, midnight on the clock. 1947. 7 min. 1953, 2 minutes. Oscillated since.\n2015-6 moved to 3 min to midnight (early 80s, major war scare). Reasons:\nmounting threat of nuclear war, failure to deal with climate change, which had not\nbeen considered before. \"The probability of global catastrophe is very high, and\nthe actions needed to reduce the risks of disaster must be taken very soon.\" That\nwas 2016. At the outset of the Trump term, the analysts reset the clock, moving\nthe hand closer to midnight. The reason, in their words, is that they found \"the\ndanger to be even greater, the need for action more urgent. It is two and a half\nminutes to midnight, the Clock is ticking, global danger looms\" - closest to\nterminal disaster since 1953, when US-USSR tested H-bombs.\nThat earlier close brush with terminal disaster is worth attention: it tell us a good\ndeal about policy-making and the nature of western democracy.\nObvious question: was it avoidable, and what efforts were made to avoid it?\nAnswer is startling, and fraught with grim lessons for today:\n1950: US remarkably secure. Hemisphere, both oceans, opposite sides,\noverwhelming ec/mil superiority, largely controlled major industrial states, which\nhad been severely weakened or almost destroyed by the war while the American\neconomy boomed: ind production almost quadrupled, and the basis was laid for\nrapid postwar expansion. The US had long had by far the greatest economy in the\nworld, with unusual advantages, but had not been a major player in world affairs,\nceding that role to Britain and France. The war left the US in a position of power\nwith no historical precedent.\n\nThough the US was indeed remarkably secure, there was one potential threat:\nICBMs, which would have nuclear warheads. They did not yet exist, but surely\nwould. Bundy: \"I am aware of no serious contemporary proposal, in or out of\neither government, that ballistic missiles should somehow be banned by\nagreement.\"\nReread: seems to me one of the most remarkable and revealing statements in\nhistorical scholarship. In short, there was apparently no thought of trying to\nprevent the sole serious threat to the US, the threat of utter destruction. Security of\npopulation very marginal concern, even security from instant destruction. Rather,\nthe institutional imperatives of state power prevailed. Furthermore, the potential\nvictims, the population, were left completely in the dark - and still are. Though all\nof this is public, it is unknown.\nLook further: Possibilities? Can't be sure, because apparent opportunities ignored.\nStalin-1952. Unif of G, not join NATO, prospect of elections. Warburg. Ridiculed.\nRussian Archives: might have been serious. Bitterly anti-Communist Soviet\nscholar Adam Ulam takes the status of Stalin's proposal to be an \"unresolved\nmystery.\" Washington \"wasted little effort in flatly rejecting Moscow's initiative,\"\nhe writes, on grounds that \"were embarrassingly unconvincing,\" leaving open \"the\nbasic question\": \"Was Stalin genuinely ready to sacrifice the newly created\nGerman Democratic Republic (GDR) on the altar of real democracy,\" with\nconsequences for world peace and for American security that could have been\nenormous? One of the most prominent Cold War scholars, Melvyn Leffler, writes\nthat scholars who studied released Soviet archives were surprised to discover that\n\"[Lavrenti] Beria -- the sinister, brutal head of the secret police - propos[ed] that\nthe Kremlin offer the West a deal on the unification and neutralization of\nGermany,\" agreeing \"to sacrifice the East German communist regime to reduce\nEast-West tensions\" and improve internal political and economic conditions in\nRussia - opportunities that were squandered in favor of securing German\nparticipation in NATO.\nReal? Can't be sure. What we can be sure of is that what mattered was global\npower, not security for the irrelevant and uninformed population.\nOne of starkest and most consistent lessons of policy formation. There is much\ntalk of security, but it is not security of population, at most a marginal concern:\nrather, security of systems of power, state and private. Too large a topic to review\nin detail, but let's proceed for a few more years into the '50s and '60s.\n\nKhrushchev. JFK. Kenneth Waltz: Kennedy administration \"undertook the largest\nstrategic and conventional peace-time military build-up the world has yet\nseen...even as Khrushchev was trying at once to carry through a major reduction in\nthe conventional forces and to follow a strategy of minimum deterrence, and we\ndid so even though the balance of strategic weapons greatly favored the United\nStates.\"\nOnce again, the decision harmed national security while enhancing state power.\nOnce again what happened was concealed behind the enthusiastic rhetoric of the\nCamelot years. And largely remains so.\nThe import of these decisions was revealed in Oct. 62. \"most dangerous moment in\nhistory.\" Facts are harrowing. Pres. Eisenhower had subdelegated authority to use\nnuclear weapons to commanders. Ellsberg, Chrome Dome pilots: indiv bomber\ncrews could have launched nukes, ending human existence. Details of that crisis\nmerit close consideration. Possible resolution: Letter from K. Trade. K refused:\n1/3-1/2 nuclear war. Establish principle: we have the right to surround them with\nmissiles, no reciprocal right.\nSecurity of pop minor concern. Continues, right to present moment. When\ninvestigating foreign affairs and government decisions, we routinely discover that\npeaceful options exist, but are dismissed, though they might well avert disaster.\nNo time to review the record, but let's turn to today's headlines.\nToday, we are instructed that the great challenge faced by the world is how to\ncompel NK to freeze its nuclear and missile programs. Perhaps we should resort to\nmore sanctions, cyberwar, intimidation, anti-missile system that China realistically\nregards as a serious threat, even perhaps direct attack.\nE another possible option that seems to be ignored: accept North Korea's offer to\ndo exactly what we are demanding. China and North Korea have proposed that\nNK freeze nuclear and missile programs, a proposal rejected at once by\nWashington just as it had been two years ago.\nThe reason for the instant rejection is that the Chinese-NK proposal has a quid pro\nquo: it calls on the US to halt its threatening military exercises on North Korea's\nborders, including simulated nuclear-bombing attacks by B-52s, sent by Trump in\none of his famous \"signals.\"\n\nThe Chinese-NK proposal is hardly unreasonable. NK's of course remember that\ntheir country was literally flattened by US bombing, and they surely have not\nforgotten the gleeful reports in American military journals of the bombing of major\ndams when there were no other targets left, the rejoicing about the exciting\nspectacle of a huge flood of water wiping out the rice crops on which Asians\ndepend for survival - very much worth reading, if you haven't done so. A useful\npart of historical memory.\nThe Chinese-NK proposal could lay the basis for more far-reaching negotiations to\nradically reduce the threats and perhaps even bring the crisis to an end. Contrary\nto much inflamed commentary, there are reasons to think negotiations might\nsucceed, as the record, well-known to scholarship, clearly reveals.\nNevertheless, the Chinese-NK proposal to freeze NK's nuclear and missile\nprograms in return for an end to threats of destruction is unacceptable to\nWashington, and to commentators with impressive unanimity, even though the NK\nnuclear and missile systems are constantly described as the greatest threat we face.\nAgain, a matter that merits some reflection about the state of democracy, and what\nit implies about prospects for survival.\nLet's look further into how we are carrying forward our verification of Mayr's\nthesis.\nLast March, the Bull of Atomic Sci's published a detailed report on the vast\nnuclear modernization program initiated by President Obama and now being\ncarried forward under Trump. The report discusses how US nuclear force\nmodernization is undermining the strategic stability on which survival suspends, by\na slender thread.\nThe current modernization programs include \"revolutionary new technologies that\nwill vastly increase the targeting capability of the US ballistic missile arsenal. This\nincrease in capability is astonishing--boosting the overall killing power of existing\nUS ballistic missile forces by a factor of roughly three--and it creates exactly what\none would expect to see, if a nuclear-armed state were planning to have the\ncapacity to fight and win a nuclear war by disarming enemies with a surprise first\nstrike.\"\nUS submarines \"now patrol with more than three times the number of warheads\nneeded to destroy the entire fleet of Russian land-based missiles in their silos. US\nsubmarine-based missiles can carry multiple warheads, so hundreds of others, now\n\nin storage, could be added to the submarine-based missile force, making it all the\nmore lethal.\"\nAll of this has \"revolutionary impact on military capabilities and important\nimplications for global security.\" The implications are very clear. Russian\nstrategic analysts are of course aware that the US now has to capacity to wipe out\ntheir deterrent. The Russians do not have our sophisticated satellite-based advance\nwarning systems. With the deterrent at serious risk because of the nuclear\nmodernization programs, at a moment of crisis - and there are many possibilities -\nRussian leaders may be tempted to undertake a preemptive strike just to assure\nsurvival - an act that would end organized human life on earth.\nOnce again, is a diplomatic avenue possible? It surely seems so. Is it being\npursued? If so, it's not detectable.\nAll relevant to Mayr's thesis.\nTurning to the second existential threat, global warming, anyone who is not living\nunder a rock should be aware that the dangers are severe, and imminent. How are\nwe reacting? Here's a recent report from the US business press:\nThe oil boom is back: \"The number of oil and gas rigs drilling in the U.S. has\nalmost doubled since bottoming out at the lowest level in more than 75 years of\nrecords...While two dozen nations are coordinating to cut oil production and rein\nin the global supply glut, U.S. producers are moving in the opposite direction. Over\nthe last four months, output increased by half a million barrels a day. If that rate of\nexpansion continues, the shale boom will break new production records by summer.\nThe U.S. now produces 9 million barrels a day.\"\nIllustrates crucial fact of current history: while the world is taking halting steps\ntowards facing the existential challenge to survival, the richest and most powerful\nstate in world history, the leader of the Free World, virtually alone, is racing\ntowards destruction, with enthusiasm and dedication. That has been true since\nNovember 8 2016, another date of great historical significance.\nThree significant events on that date: one impt, one extremely impt, one\nastonishing.\nImpt: US election. Xtremely impt: Marrakesh: (WMO: \"confirms that 2016 was\nthe warmest year on record: a remarkable 1.1 C above the pre-industrial period,\"\nsharply above the previous record set in 2015, approaching the desired limit set in\n\nParis; other dire reports). Deliberations effectively ended on Nov. 8. Survive?\nSavior: China! Leader of Free World leading world to disaster, World looking to\nChina to save it. Astonishing: Reaction. Silence.\nNo less astonishing is that while the richest and most powerful country in history,\nwhich enjoys incomparable advantages, is leading the effort to intensify the likely\ndisaster, efforts to avert catastrophe are being led, worldwide, by what we call\n\"primitive societies\": First Nations in Canada, tribal, aboriginal. Ecuador, with its\nlarge indigenous population, sought aid from the rich European countries to allow\nit to keep its oil reserves underground, where they should be. The aid was refused.\nEcuador revised its Constitution in 2008 to include \"rights of nature\" as having\n\"intrinsic worth.\" Same in Bolivia, with an indigenous majority. In general, the\ncountries with large and influential indigenous populations are well in the lead in\nseeking to preserve the planet. The countries that have driven indigenous\npopulations to extinction or extreme marginalization are racing toward destruction.\nPerhaps something more to think about.\nPractically every issue of science journals provides more grim forecasts. One\nrecent paper in Atmospheric Chemistry and Physics by prominent climate scientist\nJames Hansen and 18 others compares today's climate with that of 120,000 years\nago, which had only slight warmer temperatures: sea level rise of 20-30 feet when\nmuch of polar ice disintegrated. Paper predicts in the near future killer storms\nstronger than any in modern times, disintegration of large parts of the polar ice\nsheets leading to melting of huge glaciers, and a rise of the sea sufficient to begin\ndrowning the world's coastal cities before the end of this century. Hansen says\n\"We're in danger of handing young people a situation that's out of their control,\"\nwith precipitous rise in sea level not too far down road and other dire consequences.\nA study by researchers at U of Bristol, published in the journal Nature Geosciences,\nfound that the pace of environmental change is faster now than at any previous\ntime in the Earth's history, possibly as much as 1000 times faster.\nLast year, atmospheric CO2 passed the symbolic level of 400 ppm (particles per\nmillion), considered a crucial danger point - first time in 4 million years, and\npossibly irreversible.\nThis is only a small sample of many such reports, appear regularly in science\njournals, sometimes making it to major media. Meanwhile, Republican wrecking\nball is systematically dismantling the structures that offer hope for decent survival.\nThe Environmental Protection Agency, established by Richard Nixon, is being\n\nvirtually dismantled. Far more impt is Dept of Energy. Its Office of Science is\nscheduled to lose $900 million, nearly 20% of its budget. DOE's $300 million\nARPA-Energy program eliminated completely. Along with deep cuts to the\nresearch programs at the EPA and the National Oceanic and Atmospheric\nAdministration (NOAA), and a 5% cut to NASA's earth science budget. Even\nmention of climate change is coming under a ban, while regulations are being\ndismantled and every effort is being made to maximize the use of fossil fuels,\nincluding the most destructive, like coal.\nNot just Trump. Primaries. Local level. NC. Virtual unanimity among party\nleaders.\nSome time ago I made the outrageous comment that today's Republican party in\nthe US is the most dangerous organization in world history. I stressed that the\nstatement was outrageous. More important, is it false? Has there ever been an\norganization so publicly and openly dedicated to massive destruction on such an\nincredible scale?\nEven sea level rise more limited that what is anticipated will inundate coastal cities\nand coastal plains, as in Bangladesh a 10s of millions fleeing in fairly near future,\nmany more later. Today's refugee issues will be a tea party: Chief env scientist in\nBangladesh: \"These migrants should have the right to move to the countries from\nwhich all these greenhouse gases are coming. Millions should be able to go to the\nUnited States.\" Just fits current mood in the West. Not just the US, which is\nextreme. Or Britain. Those who think it's better on the continent can turn to a\nrecent poll showing that a majority of Europeans want a total ban on immigration\nfrom Muslim-majority countries.\nIn general, the idea is that first we destroy them and then we punish them for trying\nto escape from the ruins - calling it a \"refugee crisis\" while thousands drown in the\nMediterranean fleeing from Africa, where Europe has a certain history. In fact, the\n\"refugee crisis\" is a serious moral/cultural crisis in the West.\nLet's return to the other sledgehammer, the nuclear threat. The major nuclear\npowers, US and Russia, are both expanding arsenals, in quite dangerous ways,\nincluding tactical nukes that can be scaled down to battlefield use, with very likely\nrapid escalation. And flash points becoming more serious, particularly on R border\n- On the R border, not Mexican border, a result of expansion of NATO right after\ncollapse of the USSR, in violation of verbal promises to Gorbachev that NATO\nwould not expand \"one inch to the East\" - meaning E Germany - if G agreed to\n\nunification of Germany within a hostile mil alliance, a pretty remarkable\nconcession in the light of the history of the past 12 century. Recent archival work\npublished in the MIT-Harvard journal International Security strongly suggests that\nPres Bush I and Secy of State James Baker were consciously deceiving Gorbachev.\nHis vision of a European common home, a security system from Brussels to\nVladivostok with no military alliances, is a fading dream.\nGeorge Kennan and other senior statesmen had warned early on that NATO\nexpansion is a \"tragic mistake, [a] policy error of historic proportions.\" It is now\nleading to rising tensions on the traditional invasion route through which Russia\nwas virtually destroyed twice during the past century by Germany alone. To make\nmatters worse, in 2008 NATO membership was offered to Ukraine, the Russian\ngeostrategic heartland, efforts pursued later by Obama and Hilary Clinton.\nWith some justice, European historian Richard Sakwa writes that NATO's prime\nconcern now is \"to manage the risks created by its existence.\" All of which also\nperhaps bears on Ernst Mayr's conclusion.\nLet's turn finally to the main line of defense: functioning democracy. We can\nbegin with the leader of the free world, the model of democracy for centuries -\nthough we might remember that Alexander Hamilton regarded the British system\nas superior to what he and his colleagues were constructing - and several million\nslaves might have agreed.\nLet's ask what might happen in the US if the voice of the people were heard. One\npossibility is that most popular and respected political figure in the country would\nhave an influential role, maybe even be president. That's Bernie Sanders, by a\nvery large margin, so we learn from a poll by Murdoch's Fox News.\nSanders's campaign was the most remarkable feature of the 2016 elections. It\nbroke the prevailing pattern of over a century of US political history. A substantial\nbody of academic political science research establishes very convincingly that\nelections are pretty much bought: campaign funding alone is a remarkably good\npredictor of electability, for Congress as well, and also for decisions of elected\nofficials. Research also shows that a considerable majority of the electorate, those\nlower on the income scale, are effectively disenfranchised, in that their\nrepresentatives pay no attention to their preferences. As wealth increases, political\nrepresentation does too, slightly, until the very top, a fraction of 1%, where policies\nare pretty much set.\n\nThe Sanders campaign broke sharply from that well-established model. Sanders\nwas scarcely known. He had virtually no support from the main funding sources,\nthe corporate sector and private wealth, was derided by the media, and even used\nthe scare word \"socialist.\" And probably would have won the Democratic\nnomination had it not been for shenanigans of the Obama-Clinton party managers.\nSuppose he had won, or even had a public platform today. We might then hear\nstatements like this concerning labor rights: \"I have no use for those - regardless of\ntheir political party - who hold some foolish dream of spinning the clock back to\ndays when unorganized labor was a huddled, almost helpless mass...Only a\nhandful of unreconstructed reactionaries harbor the ugly thought of breaking\nunions. Only a fool would try to deprive working men and women of the right to\njoin the union of their choice.\"\nThat's not Sanders, however. It's Dwight Eisenhower, when he was running for\noffice in 1952: that's conservatism during the days of the great growth period of\nregulated state capitalism, often called the economic \"golden age.\"\nWe've come a long way since then. Now we are on the verge of seeing the demise\nof public unions, about all that remains. The Supreme Court will soon take up a\ncase that has been on hold, with a 4-4 split, but now, with Gorsuch on the bench,\nthe case will probably be resolved in a way that will effectively undermine unions\non fraudulent \"libertarian\" grounds called \"right to work\" in the propaganda\nsystem - meaning right to scrounge, to be represented by a union without paying\ndues. Functioning democracy would be quite different, so public opinion studies\nshow.\nMuch the same holds for a host of other issues. One consequence is anger,\nfrustration, contempt for the formal institutions of democracy, often taking very\nominous forms.\nIn the US, as in Europe, the basic fact is that populations would never vote for the\npolicies designed by elites, particularly those instituted during the neoliberal era of\nthe past generation. Some simple figures give a good indication why.\nTake the US, which has suffered less from these policies than most. In 2007,\nbefore the crash, at the height of euphoria about the grand triumphs of\nneoliberalism, neoclassical economics, and the Great Moderation, real wages of\n\nAmerican workers were lower than they had been in 1979, when the neoliberal\nexperiment was just taking off. A primary reason was explained by Fed chair Alan\nGreenspan, when he testified to Congress on the wondrous economy he was\nmanaging. He informed Congress that \"greater worker insecurity\" was keeping\nwages and inflation low. Workers are too intimidated to ask for decent wages,\nbenefits, working conditions -- a sign of health of the economy by some standards.\nSocial justice measures also deteriorated through this period - the US, in fact,\nranks at the very bottom of the developed countries of the OECD in social justice\nmeasures, alongside of Greece, Mexico, and Turkey. But profits were booming,\nparticularly in the largely predatory financial industry, which exploded during the\nneoliberal period, accounting for 40% of corporate profit right before the crash for\nwhich they were, once again, largely responsible. One motive for the neoliberal\n\"reforms\" - as they are called - was to reverse a falling rate of profit that was a\nconsequence of popular activism and worker militancy in the '60s. That was\nachieved, so in that sense the \"reforms\" were a success - apart from the population.\nUnder such conditions, democracy can hardly be tolerated.\nMuch the same has been true in Europe under the lash of neoliberal austerity\nprograms, which even IMF economists listen to different voices - mostly those of\nthe rich northern banks. And those are the voices that control the unelected Troika\nthat determines policy the IMF, the ECB, European Commission.\nEconomist Marc Weisbrot has carried out a careful and revealing investigation of\nthe political agenda guiding the destructive economic policies. He studied the\nreports of the regular IMF consultations with member governments of the EU, and\ndiscovered \"a remarkably consistent and disturbing pattern.\" The financial crisis\nwas exploited as an opportunity to lock in the neoliberal reforms: spending cuts in\nthe public sector rather than tax increases, reduced benefits and public services,\ncuts in health care, undermining of collective bargaining, and in general moving to\ncreate a society \"with less bargaining power for labor and lower wages, more\ninequality and poverty, a smaller government and social safety nets, and measures\nthat reduce growth and employment.\" \"The IMF papers,\" Weisbrot concludes,\n\"detail the agenda of Europe's decision-makers, and they have accomplished quite\na bit of it over the past five years.\" An agenda that is quite familiar here and in fact\nwherever the neoliberal assault has proceeded.\n\nIn Europe too, populations would not vote for these so-called \"reforms,\" so\ndemocracy must be sacrificed on the altar of locking in neoliberal reforms. The\ndevice in Europe is straightforward: transfer decision-making to unelected bodies:\nthe unelected Troika. At the ideological level, the idea that people should have a\nrole in determining their social and economic fate is another victim of neoliberal\ndoctrine. That was revealed with unusual clarity when the Greek government\ndared to ask the population whether they agree that Greece should continue to be\ndestroyed by the so-called \"bail outs\" - which, in fact, pass through Greece to pay\noff northern banks for their incompetence in providing careless and risky loans,\nwhile Greece's debt burden actually increases, relative to GDP, and the country is\nruined. The reaction among European elites was utter outrage, particularly when\nthe population voted the wrong way. And the Greeks were sternly punished for\ntheir illusion that democracy might have a place in neoliberal Europe, even in the\ncountry of its birth: the Troika conditions were made even harsher in reaction to\nthis deviation from good order.\nThe public response in Europe to the neoliberal assault on democracy resembles\nwhat has been happening in the US. Centrist political institutions are discredited,\npublic disillusionment, fear, and anger are running high, sometimes taking quite\nominous forms. Those old enough to remember the 1930s, as I do, cannot fail to\nbe alarmed at the rise of neo-fascist parties, even in Austria and Germany, of all\nplaces, and not only there. And bitter memories are not easy to suppress when a\nmajority of Europeans call for banning all Muslims from Europe, and many want\nto reverse the real achievements of the European Union, such as free movement of\npopulations and erosion of national borders - which would be quite consistent with\nstrengthening of cultural diversity in liberal and human societies.\nWe cannot attribute all of these developments across the West to the neoliberal\nassault, but it is a common and significant factor.\nThere is also no guarantee that functioning democracy, with an informed and\nengaged population, would lead to policies that address human needs and concerns,\nincluding the concern for survival. But it is our only hope - and a hope that can\nand must be realized.\nAll of this brings us back to Ernst Mayr's question: is it better to be smart than\nstupid? A question for you to ponder, and like it not, for you to answer. And\nwithout too much of a delay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Notes on Neo-Liberalism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-912-black-matters-introduction-to-black-studies-spring-2017/6277496f9515438bd5499a846195bcd1_MIT24_912s17_chomsky_neolib.pdf",
      "content": "Neoliberalism: an accounting\nPart way through the current experiment with neoliberalism, Jim Crotty provided\nan accounting of the record of over two decades of global economic performance\nsince the onset of the neoliberal revolution. \"The evidence to date supports\nneoliberalism's critics,\" he wrote in 2003. \"The promised benefits of\nneoliberalism have yet to materialise, at least for the majority of the world's people.\nGlobal income growth has slowed, as has the rate of growth of capital\naccumulation. Productivity growth has deteriorated, real wage growth has\ndeclined, inequality has risen in most countries, real interest rates are higher,\nfinancial crises erupt with increasing regularity, the less developed nations outside\nEast Asia have fallen even further behind the more advanced, and average\nunemployment has risen.\"\nEast Asia, of course, hadn't followed the rules\nOther analysts have since drawn similar conclusions. The overall record was\nreviewed recently in a careful analysis by Marc Weisbrot, Dean Baker and David\nRosnick of the Center for Economic and Policy Research. They compare the\nWashington Consensus years (1980-2005) to the prior two decades (1960-1980).\nThey found that \"contrary to popular belief, the past 25 years (1980-2005) have\nseen a sharply slower rate of economic growth and reduced progress on social\nindicators for the vast majority of low- and middle-income countries.\" The latter of\ncourse is the anticipated consequence of the neoliberal programs of privatizing\nstate functions. We see that clearly in the US. Among the OECD countries, the\nUS ranks near the bottom in social justice measures, alongside Turkey, Greece, and\nMexico. There is no need to review the scandal of US health care - in violation of\npopular will, which continues to support universal health care despite virtually no\narticulate advocacy of this sane stand, so recent polls again reveal.\nRecall that these assessments cover the period before the crash - the period of\ncelebration of the Great Moderation, the triumph of efficient market and rational\nexpectations theory, and virtual worship of St. Alan, perhaps the greatest\neconomist since Adam Smith. And to his credit, Greenspan did keep a close eye\non the economy. In 1997 testimony to the Senate Banking Committee, Greenspan\nrecognized that - in his words - \"Atypical restraint on compensation increases has\nbeen evident for a few years now and appears to be mainly the consequence of\ngreater worker insecurity,\" insecurity that was, as he noted, markedly increasing\neven as employment prospects improved.\nGreenspan predicted that these benign conditions would be only temporary, and\nthat \"suppressed wage cost growth as a consequence of job insecurity\" could not\n\nlast. He was mistaken. Ten years later, in 2007, real wages for non-supervisory\nAmerican workers were actually lower than they had been in 1979, when the\ncurrent neoliberal experiment was just taking off - a remarkable record over 30\nyears, perhaps unprecedented. Recall that 2007 was the peak of euphoria and self-\ncongratulation, right before the entire intellectual edifice crashed to the ground.\nOther consequences of greater worker insecurity have recently come to light. One\nfollowed immediately after Greenspan's Senate testimony: the dramatic increase in\nmortality among middle-aged white Americans without college degrees, from\n1999, recently documented by Anne Case and Angus Deaton, a phenomenon\nunknown apart from war and pestilence. Their updated current analysis attributes\nthe increase in mortality to despair and loss of status of working people under the\nneoliberal miracle, concomitants of heightened worker insecurity.\nAnother such effect reached international prominence in November 2018, when the\nsame sectors of the population that are suffering increased mortality turned for\nrescue to their bitter class enemy, out of understandable but self-destructive\ndesperation. The consequences for working people are now being exhibited\nbehind the facade of Trump-Bannon-Spicer bluster before the cameras: the\nsystematic enactment of the Ryan legislative programs, which are unusually savage\neven for the ultra-right. There is probably worse to come as further blows to\nworking people are authorized by the Trump-Roberts Court, which will soon\naddress the Friedrichs case, and with Gorsuch now on board, will probably decide\nto destroy public sector unions on fraudulent \"libertarian\" grounds.\nJust to show how far we've advanced in this respect during the neoliberal era, we\nmight listen to words of Dwight Eisenhower when he was running for president in\n1952: \"I have no use for those - regardless of their political party - who hold some\nfoolish dream of spinning the clock back to days when unorganized labor was a\nhuddled, almost helpless mass...Today in America unions have a secure place in\nour industrial life. Only a handful of unreconstructed reactionaries harbor the ugly\nthought of breaking unions. Only a fool would try to deprive working men and\nwomen of the right to join the union of their choice.\"\nThat's conservatism, vintage 1952, the days of the \"golden age\" of regulated state\ncapitalism.\nEurope has not been spared the lash of neoliberalism, particularly after the 2008\ncrash, which unleashed the austerity programs of the Troika - the IMF, the ECB,\nand the European Commission. The severe and harmful impact of these programs,\n\nparticularly on the more vulnerable European periphery, had been amply\ndocumented by Mark Blyth, Yanis Varoufakis, and Marc Weisbrot, among others.\nThe policies have been criticized as economically absurd even by IMF economists,\nbut the IMF bureaucrats in the Troika listen to different voices: mainly the northern\nbanks.\nWeisbrot's investigations provide clear evidence of a political agenda guiding the\ndestructive economic policies. He studied the reports of the regular IMF\nconsultations with member governments, covering 27 countries for the years 2008\n2011 - stopping in 2011, because in 2012 ECB President Mario Draghi uttered the\nmagic words that ended the recurrent crises of the euro, stating that the ECB would\ndo \"whatever it takes to preserve the euro. And believe me, it will be enough\". In\nfact, the words alone were enough, as they would have been from the outset.\nIn the years before the magic words, Weisbrot discovered \"a remarkably consistent\nand disturbing pattern.\" The crisis was exploited as an opportunity to lock in the\nneoliberal reforms: spending cuts in the public sector rather than tax increases,\nreduced benefits and public services, cuts in health care, undermining of collective\nbargaining, and in general moving to create a society \"with less bargaining power\nfor labor and lower wages, more inequality and poverty, a smaller government and\nsocial safety nets, and measures that reduce growth and employment.\" \"The IMF\npapers,\" Weisbrot concludes, \"detail the agenda of Europe's decision-makers, and\nthey have accomplished quite a bit of it over the past five years.\" An agenda that is\nquite familiar here and in fact wherever the neoliberal assault has proceeded.\nOf course, populations would not vote for these so-called \"reforms,\" as W points\nout. For that reason, democracy must be sacrificed on the altar of locking in\nneoliberal reforms. The device in Europe is straightforward: transfer decision-\nmaking to unelected bodies. All three members of the Troika are of course\nunelected. At the ideological level, the idea that people should have a role in\ndetermining their social and economic fate is one of the victims of neoliberal\ndoctrine. That has been revealed with unusual clarity in Europe, particularly when\nthe Greek government dared to ask the opinion of the population about whether\nthey agree that Greece should continue to be destroyed by the so-called \"bail outs\"\n- which, in fact, pass through Greece to pay off northern banks for their\nincompetence in providing careless and risky loans, while Greece's debt burden\nactually increases, relative to GDP, and the country is ruined. The reaction among\nEuropean elites was utter outrage, particularly when the population voted the\nwrong way. And the Greeks were sternly punished for their illusion that\ndemocracy might have a place in neoliberal Europe, even in the country of its\n\nbirth: the Troika conditions were made even harsher in reaction to this deviation\nfrom good order.\nThe public response in Europe to the neoliberal assault on democracy has some\nresemblance to what has been happening here. Centrist political institutions are\ndiscredited, public disillusionment, fear, and anger are running high, sometimes\ntaking quite ominous forms. Those old enough to remember the 1930s, as I do,\ncannot fail to be alarmed at the rise of neo-fascist parties, even in Austria and\nGermany, of all places, and not only there. And bitter memories are not easy to\nsuppress when a majority of Europeans call for banning all Muslims from Europe,\nand many want to reverse the real achievements of the European Union, such as\nfree movement of populations and erosion of national borders - which is quite\nconsistent with strengthening of cultural diversity.\nWe cannot attribute all of these developments across the West to the neoliberal\nassault, but it is a common and significant factor.\nIn the US too functioning democracy has declined under the neoliberal assault,\ndevelopments revealed particularly in detailed studies by Martin Gilens, Ben Page,\nand Larry Bartlett. These show that the majority of the population, the lower 70%\non the income scale, are literally disenfranchised, in that their representatives pay\nno attention to their attitudes and preferences. As one moves up the scale,\ninfluence slowly increases, while at the very top, policies are basically set, by a\nfraction of 1%.\nThe significance of these results is underscored by recent work of Tom Ferguson\nand his colleagues extending his investment theory of politics to congressional\nelections since 1980. Their studies show that campaign spending is a near perfect\npredictor of electoral outcomes, a virtual straight line effect over many years. The\ntendencies go far back, as Ferguson has shown in earlier work, and appear to be\nenhanced by the neoliberal assault on democracy, implicit in the general principles.\nThere has of course been resistance to the neoliberal assault, notably in Latin\nAmerica, where the center-left governments that took power during this\nmillennium went a long way towards reversing the lost decades of the neoliberal\nyears. One consequence is that the IMF - basically an agency of the US treasury\nin Latin America -- has been expelled, along with all US military bases in South\nAmerica. There has also been some progress in reversing the harm caused by the\nWashington consensus programs of the lost decades. And regrettably, there have\nalso been severe failures resulting from caudillism, corruption, and reliance on an\n\nunsustainable extractivist model that as a side effect undermines domestic\ndevelopment. One of the better records is in Ecuador, where poverty has been\nreduced by 38 percent and extreme poverty by 47 percent, along with reduction in\ninequality, growth of pc income, substantial increase in social spending and access\nto health care and education. Elsewhere too there have been advances that seem to\nbe sustainable.\nNot every Latin American country participated in the reversal of the neoliberal\nassault -- or \"reforms,\" to use the preferred term. One prime exception was\nMexico, subjected to a policy decision called NAFTA, which had the express\npurpose of \"locking Mexico in\" to the structural reforms of the '80s. The effects\nare reviewed in a recent CEPR study. It finds that Mexico ranks 15th out of 20\nLatin American countries in growth of real GDP per person. Real wages were\nalmost the same in 2014 as in 1994. The poverty rate barely budged, while in the\nrest of the region poverty declined from 44% in 2002 to 28% in 2014. These and a\nstring of other results confirm the general assessment of the neoliberal policies.\nThe modern experiment with neoliberalism was initiated in Chile after the Pinochet\ncoup in 1973 overthrew the Allende government and installed a harsh dictatorship\n- the first 9/11. What happened is quite informative about what followed,\nworldwide.\nWe might pause for a moment to compare the two 9/11s, the first one in 1973, the\nsecond in 2001. The easiest way is with a thought experiment. Imagine that on\n9/11 2001, the plane that was downed in Pennsylvania had reached its target,\npresumably the White House, killed the President, instituted a carefully planned\nmilitary dictatorship that murdered some 50-100,000 people and tortured 700,000,\nalso establishing a global terror center. That would have been far worse than what\nhappened in September 2001. And it is what indeed happened in 1973, with\nfigures adjusted to pc equivalents, the appropriate measure.\nThe second 9/11 was celebrated by al-Qaeda. Its far more horrendous precursor\nwas celebrated by the United States government and business world - facts worth\npondering -- but let's put topic aside.\nThe US of course had strongly opposed the Allende government, and celebrated\nthe new military dictatorship with enthusiasm. Among other punishments, loans\nhad been withheld during the period of Chilean democracy. 9/11 pulled the cork\nout of the bottle and there was a flood of loans from the WB and private investors.\n\nThe new military rulers were praised by US Sec of Treasury William Simon for\nhaving brought \"economic freedom\" to Chile.\nThe applause was reminiscent of Washington's reaction to the military coup in\nBrazil in 1964, establishing the first of the neo-Nazi terror-and-torture states that\nspread like hideous plague through the hemisphere, the curse reaching Central\nAmerica in the '80s. Kennedy's Ambassador Lincoln Gordon explained that\nWashington supported the military forces that overthrew parliamentary democracy\nin recognition of their \"basically democratic and pro-United States orientation.\"\nWhile the torturers and assassins were carrying out their necessary work of\ncleansing the society, Gordon hailed their achievement as \"the most decisive\nvictory for freedom in the mid-twentieth century.\" The \"democratic rebellion,\"\nGordon cabled Washington, would help in \"restraining left-wing excesses\" of the\nformer moderate elected government. And the \"democratic forces\" now in charge\nshould \"create a greatly improved climate for private investment.\"\nThe US is a global power, and policies and attitudes tend to be consistent\nworldwide. We should not be surprised, then, at the discovery that at the same\ntime, 1965, US liberal opinion was welcoming with unrestrained joy what it\nrecognized to be \"the staggering mass slaughter\" in Indonesia that instituted a\nvicious dictatorship that opened the rich resources of the country to private\ninvestment, \"a gleam of light in Asia,\" as it was described by NYT columnist\nJames Reston, articulating the common view.\nThe Pinochet dictatorship brought in the \"Chicago Boys\", economists trained in\nthe doctrines of leading proponents of neoliberalism. They had perfect\nexperimental conditions. There could be no objections because of the brutality of\nthe dictatorship. They had overwhelming support from the hemispheric\nsuperpower and the institutions it dominated, like the WB. Furthermore, the\nalleged \"free market\" economy could rely on a highly efficient state-owned Copper\nproducer, Codelco, a mainstay of the economy that the dictatorship didn't dare to\ntouch.\nWorth mentioning that although neoliberalism proclaims its allegiance to free\nmarkets and free trade, practice is different, as the Chilean example illustrates.\nReagan was the same. Much lofty rhetoric about free markets, but quick resort to\nextreme protectionism to save American industries from more advanced and\nsuccessful Japanese competitors - autos, semiconductors, others - sometimes\ncalled \"voluntary export restrictions,\" where \"voluntary\" means \"do what we say\n\nor else.\"As for the more recent \"free trade agreements,\" these are at root highly\nprotectionist investor rights agreements.\nThe Chicago boys proceeded to impose the theoretical model they had been taught.\nThey were visited by Milton Friedman himself along with his associate Arnold\nHarberger. Both made a series of well-publicized appearances to promote a \"shock\ntreatment\" for the economy. In Friedman's words, shock therapy -- rapid\nimposition of market systems is \"the only medicine. Absolutely. There is no other.\nThere is no other long-term solution.\"\nWithin a few years, by 1982, the results of the experiment were in: The economy\ncollapsed. Note that 1982, the year of the collapse of the perfect experiment, was\nthe year in which Friedman reissued his classic manifesto Capitalism and\nFreedom, with a new preface on the triumph of the neoliberal model.\nIn Chile, in order to salvage something from the neoliberal wreckage, the state had\nto take over a large part of the economy. One prominent Chilean economist\n(Gabriel Palma) points out that the Pinochet government ended up with a share of\nthe economy far greater than the Allende's government ever dreamed off...\nBasically, the whole of the banking system ended up owned by the government,\nand a large share of the real sector as well (including export activities,\nmanufacturing, services, etc.) -- what was called at the time \"The Chicago Road to\nSocialism.\"\nPinochet then sacked the Chicago boys and brought in entrepreneurs of the\ntraditional old-fashioned right to set the economy back to some sort of functioning.\nThe post-dictatorship years of mostly center-left governments introduced some\nimprovements, particularly during Bachelet's terms, but, as a recent scholarly\nreview points out, \"none of the reforms dismantled the underlying structures put in\nplace by the military dictatorship.\" There have been constant and in recent years\nvigorous protests over the privatized pension, health and educational systems,\nwhich are failing most of the population - but not the rich, or the military and\npolice: Pinochet was careful to ensure that they would be protected by the former\nstate pension system.\nThe Chilean experiment with neoliberalism and shock therapy was soon followed\nby others. The most significant one was after the collapse of the Soviet Union. US\nadvisers administered shock therapy in accord with neoliberal principles - rapid\nimposition of privatization, decontrol of prices, general market doctrines. The\n\nresult was an economic collapse and loss of nearly half of Russia's GDP in five\nyears. Also a sharp increase in the death rate, reaching millions of excess deaths in\nthe 1990s. And robbery of state assets on a colossal scale, leading to the corrupt\noligarchy and the Putin reaction. Another grand success.\nAnd as we have seen, hardly untypical.\nOr for that matter, hardly surprising. I began by saying that the Chilean\ndictatorship opened the first \"modern experiment\" with neoliberalism. The reason\nfor the qualification is that it was not really new. Similar socioeconomic regimes\nhad been imposed by imperial powers for centuries, pretty much creating the third\nworld.\n\"Neoliberalism\" is a strange term: in many respects it is neither new nor liberal,\neven in technical economic sense. There is no time to review the interesting\nhistorical record. What it reveals, generally, is that from England to the US to\nJapan and the East Asian tigers, the countries that have developed are those that\nrejected the neoliberal principles - for the US, advised by no less an economist\nthan Adam Smith - and rejected by the independent Republic, which instead\nfollowed England's model of state-led development, protectionism, appropriating\nsuperior technology from others, with some dallying with free trade when it was\nadvantageous. The countries that were under imperial domination were compelled\nby force to pursue these doctrines, and became the third world. There are many\nstriking illustrations.\nHistory is a complicated matter, with many obscure interactions, but these are\namong the clearer lessons that economic history provides. And they are known to\nmainstream economic historians. Among others, Paul Bairoch amply documents\nhis conclusion that \"it is difficult to find another case where the facts so contradict\na dominant theory\" as the doctrine that free markets were the engine of growth.\nThere have been some notable successes of the modern experiment with neoliberal\nreforms. These were instituted in large part to arrest the declining rate of profit,\ndue in part to more popular power, particularly labor power, in the 1960s. That has\nbeen achieved. Profitability has been restored, particularly in the largely predatory\nfinancial institutions, which exploded during the neoliberal years and are now even\nbigger and richer than they were before the 2008 financial crisis for which they\nwere largely responsible.\n\nThere are other successes that are insufficiently appreciated. Some have been\ncarefully studied by political economist Sean Starrs in recent work. He points out\nthat the conventional estimates of national wealth in terms of GDP are misleading\nin the era of neoliberal globalization. With complex integrated supply chains,\nsubcontracting, and other such devices, corporate ownership of the world's wealth\nis becoming a more realistic measure of global power than national wealth, as the\nworld departs more than before from the model of nationally discrete political\neconomies. Investigating corporate ownership, Starrs finds that in virtually every\neconomic sector - manufacturing, finance, services, retail and others -- US\ncorporations are well in the lead in ownership of the global economy. Overall,\ntheir ownership is close to 50% of the total, roughly the maximum estimate of US\nnational wealth in 1945, at the historical peak of US power. National wealth by\nconventional measures has declined from 1945 to the present, to maybe 20%. But\nUS corporate ownership of the world has exploded.\nSo in some respects, all is well. Neoliberalism has been a grand success.\nTo quote the head of state of Brazil's military dictatorship, General Emilio Medici,\nin 1971: \"the economy is doing fine, but the people aren't.\" Perhaps the simplest\none-sentence accounting of neoliberalism.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.912 Black Matters: Introduction to Black Studies\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}