{
  "course_name": "Black Feminist Health Science Studies",
  "course_description": "Black feminist health science studies is a critical intervention into a number of intersecting arenas of scholarship and activism, including feminist health studies, contemporary medical curriculum reform conversations, and feminist technoscience studies. We argue towards a theory of Black feminist health science studies that builds on social justice science, which has as its focus the health and well-being of marginalized groups. Students will engage feminist science theories such as the linguistic metaphors of the immune system, the medicalization of race, and critiques of the sexual binary. We will use contemporary as well as historical moments to investigate the evolution of “scientific truth” and its impact on the U.S. cultural landscape.",
  "topics": [
    "Health and Medicine",
    "Social Medicine",
    "Social Science",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Health and Medicine",
    "Social Medicine",
    "Social Science",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week; 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nBlack feminist health science studies is a critical intervention into a number of intersecting arenas of scholarship and activism, including feminist health studies, contemporary medical curriculum reform conversations, and feminist technoscience studies. We argue towards a theory of Black feminist health science studies that builds on social justice science, which has as its focus the health and well-being of marginalized groups. Students will engage feminist science theories such as the linguistic metaphors of the immune system, the medicalization of race, and critiques of the sexual binary. We will use contemporary as well as historical moments to investigate the evolution of \"scientific truth\" and its impact on the U.S. cultural landscape.\n\nAbout the Instructor\n\nMoya Bailey was an\nMLK Visiting Professor\nat MIT for 2020-2021. Dr. Bailey is a scholar of critical race, feminist, and disability studies. Her work focuses on marginalized groups' use of digital media to promote social justice as acts of self-affirmation and health promotion. She is interested in how race, gender, and sexuality are represented in media and medicine. She currently curates the\n#transformDH\nTumblr initiative in Digital Humanities. She is also the digital alchemist for the\nOctavia E. Butler Legacy Network\n.\n\nGoals and Objectives\n\nStudents will:\n\nDetermine the validity of scientific claims based on evidence, not opinion\n\nRecognize societal and cultural influence on \"biological\" behavior\n\nGrasp basic Black feminist concepts such as intersectionality and standpoint theory\n\nExplore race, class, and gender's impact on medicine\n\nRequired Texts\n\nPetry, Ann.\nThe Street\n. Mariner Books, 1998. ISBN: 9780395901496. [Preview with\nGoogle Books\n]\n\nRoberts, Dorothy.\nFatal Invention: How Science, Politics, and Big Business Re-create Race in the Twenty-first Century\n. The New Press, 2012. ISBN: 9781595588340. [Preview with\nGoogle Books\n]\n\nFor additional readings, see the\nReadings\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPOINTS\n\nWeek 1 reading response\n\n10 points\n\n1-page reading response\n\n10 points\n\n2-page reading response\n\n20 points\n\nClass participation\n\n1 point for each class attended, 4 points for the symposium\n\nPodcast\n\n40 points\n\nFor additional information, see the\nAssignments\nsection.\n\nTo complete this course with an A, you will need to gain a total of 93 to 100 points. You will have the opportunity to choose the assignments and readings that you will complete to allow you to arrive at the points that are needed. As you choose how to proceed through this course, do think carefully about your research interests, projects, future academic and/or professional goals, and skills you would like to acquire. See the\nReadings\nsection for articles and books that will be linked to the different assignments.\n\nExtra Points\n\nStudents may attend virtual events detailed by the professor and write a one-page reflection on the event. Each write-up must include a reference to at least one class reading that connects to the event. Other extra credit opportunities will be announced in class. Each of these write-ups is worth an additional point added to your cumulative grade.",
  "files": []
}