{
  "course_name": "BSAD Foundations in the Visual Arts",
  "course_description": "This class offers a foundation in the visual art practice and its critical analysis for beginning architecture students. Emphasis is on long-range artistic development and its analogies to architectural thinking and practice. Students will learn to communicate ideas and experiences through various two-dimensional, and three-dimensional, and time-based media, including installations, performance and video. Lectures, visiting artist presentations, field trips, and readings supplement studio practice.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Visual Arts",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Visual Arts"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 3 hours / session\n\nCourse Description\n\nThis class offers a foundation in the visual art practice and its critical analysis for beginning architecture students. Emphasis is on long-range artistic development and its analogies to architectural thinking and practice. Students will learn to communicate ideas and experiences through various two-dimensional, and three-dimensional, and time-based media, including installations, performance and video. Lectures, visiting artist presentations, field trips, and readings supplement studio practice.\n\nThe course meets twice a week for three hours each session for a total of 12 units of credit. A minimum of six hours per week outside class work is expected. At least three studio projects must be completed for the course of study. You are required to prepare a written one-page statement for each project. Readings are assigned to provide a historical and theoretical framework for each studio project.\n\nEvaluations\n\nGrading will be based on:\n\nACTIVITIES\n\nPERCENTAGES\n\nConcept of individual projects\n\n20%\n\nExecution of individual projects\n\n20%\n\nClass participation\n\n20%\n\nPersonal investment in and commitment to your work\n\n20%\n\nDemonstrated growth over the course of the semester\n\n20%\n\nCompletion of all projects is required for a passing grade, as is regular attendance. Unexcused absences will automatically lower a grade by 1/2 a letter grade.\n\nMaterials\n\nYou are responsible for obtaining most of your own materials. The bulk of the lab fee covers printing costs for handouts and certain basic materials which the program will buy in bulk, and which are available to everyone (for example, plaster and some molding compounds) as well as upkeep of shop tools. Lab fee: $30.",
  "files": [
    {
      "category": "Assignment",
      "title": "Final Assignment: Body Extension",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-302-bsad-foundations-in-the-visual-arts-fall-2003/4dd3bc38850d4e429871caf591776e3e_3_body_extension.pdf",
      "content": "4.302\n\nFall 2003\n\nIntroduction to Visual Arts\n\nFinal Assignment: Body Extension\nAn assignment in two parts\n\nCreate an art work that exists as a \"body extension,\" a sculptural/architectural/corporeal supplement. The\nart work must manifest an exploration of your desires, fears, experiences. The second part of the\nassignment asks you to interact with your body extension in a way that significantly alters your\nexperience of it. Your interaction can be represented by video documentation, or by live performance.\n\nExercise:\nBring in images that illustrate the concept of existing \"body extensions.\"\n\nStudent presentation:\nPresent the work of an artist whose work relates to the idea of a body extension, the manipulation of\ntime, or is designed to exist in the public realm. Presentations should include background information\nabout the artist and place the work in an art historical context. How you present the artist's work is\nimportant to our understanding of it. You may want to practice before hand. Length: 10 minutes.\n\nreading:\nHorn, Rebecca and Celant, Germano. \"The Bastile Interviews.\" Rebecca Horn, 1993.\nLinker, Kate. \"On Language and Its Ruses: Poetry into Performance.\" Vito Acconci, 1994.\nPejic, Bojana. \"Being-in-the-Body, On the Spiritual in Marina Abramovic's Art.\" Abramovic, 1993."
    },
    {
      "category": "Assignment",
      "title": "Assignment #1: Made Public",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-302-bsad-foundations-in-the-visual-arts-fall-2003/fe71cd9bc32190bb1ce4f26a0ee92d3a_i_made_public_fo3.pdf",
      "content": "4.302\n\nFall 2003\n\nIntroduction to Visual Arts\n\nAssignment #1: Made Public\n\nIn a public space make a work that reveals or draws attention to something overlooked, hidden, unseen,\nor absent, or which bears witness to a past event. We will be discussing monuments, counter\nmonuments, site interventions and strategies for working in public.\n\nnote: Working in public necessitates considerations of safety, permission, and weather. Getting permission\nor asking for forgiveness afterward is part of the assignment.\n\nExercises:\nUsing a roll of masking tape, create a private space in public.\nUsing plaster, cast the interior of at least 5 different spaces that you consider to be private.\n\nReading:\nAcconci, Vito. \"Public Space in a Private Time,\" Critical Inquiry, Summer 1990, Vol 16, Number 4.\nAntin, David. \"Fine Furs,\" Mapping the Terrain, Art and the Public Sphere, W.J.T. Mitchell ed.\nBaca, Judith. \"Whose Monument Where? Public Art in a Many-Cultured Society,\"\n\nMapping the Terrain, Art and the Public Sphere, W.J.T. Mitchell ed.\nLacy, Suzanne. \"Cultural Pilgrimages and Metaphoric Journeys,\" Mapping the Terrain, Art and the Public\nSphere, W.J.T. Mitchell ed."
    },
    {
      "category": "Assignment",
      "title": "Assignment #2: Shaping Time",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-302-bsad-foundations-in-the-visual-arts-fall-2003/3da666d60e311b1d051a917e1ba0ec67_2_shaping_time_fo3.pdf",
      "content": "4.302\n\nFall 2003\n\nIntroduction to Visual Arts\n\nAssignment #2: Shaping Time\n\nUsing demonstrated production and editing techniques, make a 90 second video focusing on an\naspect of your physical self in space. Sound must be diegetic or self generated.\n\nThis unit presents time as a malleable, plastic material that can be shaped by the artist. It asks\nyou to consider different concepts of time, as well as your own specific relationship to time.\n\nExercises:\n\nMake (2) one minute videos: one in which time appears to be moving quickly, the other in which\ntime appears to be moving slowly.\n\nUsing a provided film clip, make a one minute video edited to convey an emotive quality not\nordinarily associated with the clip.\n\nReading:\nBrand, Stewart. The Clock of the Long Now.\nViola, Bill. \"The Porcupine and the Car,\" \"I Do Not Know What It Is I Am Like,\" Reasons for\nKnocking at an Empty House.\nWollen, Peter. \"Time in Film and Video Art,\" Paris Hollywood."
    },
    {
      "category": "Resource",
      "title": "Made Public",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-302-bsad-foundations-in-the-visual-arts-fall-2003/f2986dc6011932679c862bd0d8340275_foundmid.pdf",
      "content": "Foundations in the Visual Arts\nFoundations in the Visual Arts\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, Professors\n, Professors\nStudent Work from\nStudent Work from Made Public\nMade Public\nIn a public space make a work that reveals or draws attention to something\noverlooked, hidden, unseen, or absent, or which bears witness to a past event.\nWe will be discussing monuments, counter monuments, site interventions and\nstrategies for working in public.\nNote: Working in public necessitates considerations of safety, permission, and\nweather. Getting permission or asking for forgiveness afterward is part of the\nassignment.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Leon Wang.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Jessica Rosenkrantz.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWhen asked to present a work that revealed something\noverlooked or hidden, I was immediately attracted to the\neffect of modern urbanism on our perception of private\nand public spaces. In a world dominated by sprawling\nsystems of infrastructure and modes of circulation, we are\nunconsciously bombarded with escalators, elevators,\nentryways, sidewalks, street signs, and traffic lights just to\nname a few--all invading and regulating the way in which\nwe move through space and time. In particular, I was\ndrawn to the structure of a revolving door, as it is a\ncompact, controlled study of how people pass through a\nseries of private and public spaces in a matter of seconds.\nWhile swiftly pushing through this spatial volume, people\nneglect the rather intimate quadrant they occupy for the\nsecond that they are enclosed in the revolving door's\ncylindrical glass. The users of the doors are merely\nthinking only of traveling swiftly and seamlessly to their\ndestination. In my Made Public installation, I wanted to\nreveal both the unseen fragmentation of our travel into\nprivate and public spaces, and also how heavily we rely on\nour visual memory to define destination and origin points\nas we travel through these spaces. Much of the inspiration\nfor this concept is derived from Vito Acconci's essay\n\"Public Space, Private Time,\" where Acconci proves that\nspace and time are inseparable and powerful in affecting\nus psychologically. I want others to realize their\ndependence on visual memory and expectations as they\npass through the set of revolving doors in E25. These\nparticular doors present a unique situation in that the\npathway connecting the two doors nearly restricts the flow\nof traffic to a single, suffocating line. Inevitably linked, the\ntwo doors frame a compressed space that effectively\ncreates a traffic \"bottleneck\" between MIT and the outlets\nfor off-campus travel: Carleton Street and the Kendall T\nstation. By posting the plots fully around the circular glass,\nthe outward appearance of the doors become opaque; I\nintend to call attention to the surprisingly private,\ncompartmentalized space that is solely controlled by the\ntraveler for a transient moment.\nWork by Michelle Ha.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Jamie Carreiro.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\n\"Faces of Terrorism\" by Lindsey L. Buck-\nMoyer.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nMade Public\nMade Public Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nLike many large American cities, the city of Boston\ncontinually works to promote itself as not only a place of\nculture and sophistication, but also as a place that\nembodies the goodwill of mankind. Sprinkled throughout\nBoston are landmarks and monuments that reinforce this\nspirit; an example would be the Public Gardens' Make\nWay for Ducklings sculptures by Nancy Schon. Inspired\nby Robert McCloskey's 1941 book Make Way for\nDucklings, these sculptures tell the story of Mrs. Mallard\nand her eight duckling children and her search to find a\nsafe and nurturing place in which to raise them. These\nducklings, an indispensable symbol of Boston culture, are\nrepresentative of an era of innocence and virtue, and they\nreinforce the city's duty to promote the safety and well-\nbeing of the Boston's youth. Unfortunately, the popularity\nof these sculptures adversely masks several social\nproblems prevalent in the city of Boston, specifically those\npresent in disadvantaged, generally overlooked\nneighborhoods like Roxbury and Dorchester. In painting a\npristine picture of a safe and wholesome Boston, citizens\nfail to notice the social plague that exists beneath the\nsurface--a plague characterized by rape, murder, and\nbrutality. In the city's idealistic quest to establish a safe\nenvironment for its children, it ignores the fact that this\nsocial plague has not only victimized innocent children but\nhas created criminals and perpetrators among them as\nwell. My public work seeks to challenge traditional views\nby addressing the hidden reality within Boston's mix of\nsocio-economic and cultural groups. It is a juxtaposition of\ntwo very different generations, two very different societies:\nthe innocence and idealism of Robert McCloskey's world\nversus the harsh reality of 21st-century urban America.\nThe effectiveness of this piece lies in the ability to initially\nattract the audience for purely aesthetic reasons, then\nimpose an unlikely shock and insight at the moment when\nthe curious audience chooses to take a closer look.\nWork by Andrea Urmanita."
    },
    {
      "category": "Resource",
      "title": "Student Work from Body Extension",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-302-bsad-foundations-in-the-visual-arts-fall-2003/55d9e7e115a0d31aa6c00b53b9334aef_foundfin.pdf",
      "content": "Foundations in the Visual Arts\nFoundations in the Visual Arts\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, Professors\n, Professors\nStudent Work from\nStudent Work from Body Extension\nBody Extension\nAn assignment in two parts:\nAn assignment in two parts:\nCreate an art work that exists as a \"body extension,\" a sculptural / architectural\n/ corporeal supplement. The art work must manifest an exploration of your\ndesires, fears, and experiences. The second part of the assignment asks you\nto interact with your body extension in a way that significantly alters your\nexperience of it. Your interaction can be represented by video documentation,\nor by live performance.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nBody Extension\nBody Extension Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Leon Wang.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nBody Extension\nBody Extension Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Jessica Rosenkrantz.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nBody Extension\nBody Extension Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Noel Davis.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nBody Extension\nBody Extension Review\nReview\nCompilation of Student Work\nCompilation of Student Work\nWork by Jamie Carreiro.\n\n4.302 Foundations\n4.302 Foundations\nWendy Jacob and\nWendy Jacob and Sanjit\nSanjit Sethi\nSethi, ,\nProfessors\nProfessors\nBody Extension\nBody Extension Review\nReview\nCompilation of Student Work\nCompilation of Student Work\n\"The truth may set us free, but it is in searching for the\ntruth that we become oppressed.\" Within the past half-\ncentury, the role of information technology has evolved at\na mind-numbing pace. Looking at what exists today, one\ncould easily say that the technological possibilities that lie\nahead in the future are endless. The field of\ncommunications has been dramatically enhanced, making\ninterpersonal the most convenient and most easily-\naccessible it has ever been. Never before could one\ninstantly check their Palm Pilot for the latest national and\nlocal news headlines, read sport scores off of a taxicab\nmarquee, or e-mail a friend in Paris using merely a cellular\nphone. It is clear that daily life is heavily dependent on\ncommunications media, an inescapable force in the 21st\ncentury. Not only is media information readily available,\nbut its rate of transmission is extremely high--due in part\nby the wide range of topics presented. The media has\ndeveloped itself into a full-fledged circus ring, pulling out\ntricks and stunts to crank out the juiciest and most\nappealing stories. One could argue that the subject\ncontent generated by this circus has reached\nunreasonable and intolerable levels--the question that the\npublic faces is how much unnecessary junk are we able to\nfilter out of our lives? Sadly, the public has already grown\ndesensitized and subconsciously dependent upon\ncommunication and the media: how often are people\ncompelled to check e-mail every half-hour or keep the\ntelevision on just for the sake and comfort of it being on?\nWhy was there such low voter turn-out in the 2000\nelections, yet it seemed like everyone and their mother\nvoted for their favorite American Idol? Whether it was to\ndiscover what Paris Hilton really did with that Arkansas\nfarm boy, or to find out what Fox News will expose about\nthe. This sudden bombardment of media information has\ncreated another thick layer of skin to surround the body--\na layer that is slowly hardening, apathetic and unfeeling.\nIs it too late for the body to reject this new organ? -\nAndrea Urmanita\nWork by Andrea Urmanita."
    }
  ]
}