{
  "course_name": "Building Earth-like Planets: From Nebular Gas to Ocean Worlds",
  "course_description": "This course covers examination of the state of knowledge of planetary formation, beginning with planetary nebulas and continuing through accretion (from gas, to dust, to planetesimals, to planetary embryos, to planets). It also includes processes of planetary differentiation, crust formation, atmospheric degassing, and surface water condensation. This course has integrated discussions of compositional and physical processes, based upon observations from our solar system and from exoplanets. Focus on terrestrial (rocky and metallic) planets, though more volatile-rich bodies are also examined.",
  "topics": [
    "Science",
    "Earth Science",
    "Geology",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Earth Science",
    "Geology",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisite\n\nPhysics II (8.022), Calculus II (18.02)\n\nDescription\n\nExamination of the state of knowledge of planetary formation, beginning with planetary nebulas and continuing through accretion (from gas, to dust, to planetesimals, to planetary embryos, to planets). Processes of planetary differentiation, crust formation, atmospheric degassing, and surface water condensation. Integrated discussions of compositional and physical processes, based upon observations from our solar system and from exoplanets. Focus on terrestrial (rocky and metallic) planets, though more volatile-rich bodies are also examined. Includes regular readings from literature, lectures, discussion, and problem solving.\n\nTopics\n\nDust clouds\n\nStar formation\n\nStars and disks\n\nDust accretion\n\nAccretion signatures\n\nT-Tauri disks\n\nIntegrated model of the planetary disk\n\nDifferentiation\n\nPlanetesimals\n\nEffects of the star\n\nMoons\n\nMagma ocean processes\n\nExoplanet systems\n\nVolatiles\n\nPlanetary crusts\n\nVenus, Mercury, Earth, Mars\n\nHabitability and Biosignatures\n\nOcean worlds\n\nDesert worlds\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n20%\n\nPaper summaries\n\n15%\n\nDiscussion leadership\n\n15%\n\nProblem set\n\n25%\n\nReview paper\n\n25%",
  "files": []
}