{
  "course_name": "Capitalism in the Age of Revolution",
  "course_description": "The decades leading up to the Atlantic revolutions of the late eighteenth century were formative moments in the rise of capitalism. The novel instruments of credit, debt, and investment fashioned during this period proved to be enduring sources of financial innovation, but they also generated a great deal of political conflict, particularly during the revolutionary era itself.  This seminar examines the debates surrounding large-scale financial and trading corporations and considers the eighteenth century as a period of recurring financial crisis in which corporate power came into sustained and direct contact with emerging republican norms. The seminar ends with a look at the relationship between slavery and the rise of “modern” or “industrial” capitalism in the nineteenth century, as well as some of the critiques of capitalism that emerged out of that experience.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "European History",
    "World History",
    "Humanities",
    "History",
    "American History",
    "European History",
    "World History"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThe decades leading up to the Atlantic revolutions of the late eighteenth century were formative moments in the rise of capitalism. The novel instruments of credit, debt, and investment fashioned during this period proved to be enduring sources of financial innovation, but they also generated a great deal of political conflict, particularly during the revolutionary era itself. We will examine the debates surrounding large-scale financial and trading corporations and consider the eighteenth century as a period of recurring financial crisis in which corporate power came into sustained and direct contact with emerging republican norms. The seminar ends with a look at the relationship between slavery and the rise of \"modern\" or \"industrial\" capitalism in the nineteenth century, as well as some of the critiques of capitalism that emerged out of that experience.\n\nCourse Materials\n\nThere is one required text for this course.\n\nBeckert, Sven, and Seth Rockman, eds.\nSlavery's Capitalism: A New History of American Economic Development\n. University of Pennsylvania Press, 2016. ISBN: 9780812248418. [Preview with\nGoogle Books\n]\n\nAlthough no background knowledge is assumed or required, it will be useful to have some familiarity with the events and issues of eighteenth-century North Atlantic history. For this purpose I have indicated, at various points in the semester, some selections from the following textbook:\n\nPalmer, R. R., Joel Colton, and Lloyd Kramer.\nA History of the Modern World\n. 9th ed. Knopf, 2002. ISBN: 9780375413988.\n\nThis reading is strictly optional and we will not discuss it directly in seminar.\n\nAll readings are detailed in the\nReadings\nsection.\n\nClass Format, Evaluation, and Attendance\n\nThis seminar meets once a week for three hours for close readings of texts that must be studied carefully and critically in advance in order for the class to work. Because we meet only once a week and cover a good deal of ground in each seminar meeting, students who miss more than two sessions of the seminar will not be able to receive a passing grade for the course barring an unusual medical or personal emergency.\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n40%\n\nPaper 1 (5 pages)\n\n15%\n\nPaper 2 (6-7 pages)\n\n20%\n\nPaper 3 (9-10 pages)\n\n25%\n\nFor detail on the activities mentioned in the above table, see the\nAssignments\nsection.\n\nWriting Help\n\nThe\nWriting and Communication Center at MIT\n(WCC) offers MIT students free one-on-one professional advice from communication experts (MIT lecturers who have advanced degrees and who are all are published writers). The WCC helps you strategize about all types of academic writing as well as about all aspects of oral presentations. The WCC also helps with all English as Second Language issues, from writing and grammar to pronunciation and conversation practice.",
  "files": [
    {
      "category": "Exam",
      "title": "21H.382F16 Capitalism in the Age of Revolution - Student Example 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-382-capitalism-in-the-age-of-revolution-fall-2016/577228369c8e0326bd90f22154b5e648_MIT21H_382F16_Tale.pdf",
      "content": "A Tale of Two Companies:\nEast India Companies and Revolution in 18th Century Britain and France\n\nThe intersection of economic and political history is clear in the relationships of the\nBritish and French East Indies Companies to the revolutions of the 18th century Atlantic. In the\n17th century, the British and French Companies had been granted charters by their respective\ngovernments that gave them monopolies over the their nations' trade with the Indies.1 While\nthese companies were initially economic assets to their shareholders and respective\ngovernments,2 they became political liabilities in the late 18th century and were tied to factors\nthat ultimately lead to American and French Revolutions. Both similarities and differences can\nbeen seen when comparing the relationship of the British Company to the American Revolution\nand the relationship of the French Company to the French Revolution. The similarities between\nthe two situations highlight trends of the revolutionary era that apply across borders, while the\ndifferences offer insight into distinctions between the roles of the two Companies. We will begin\nby examining the similarities and what they indicate about the era as a whole. Then, we will\nconsider the differences and what they indicate about the unique role of each company.\n\nOne important similarity between the British and French situations is that a financial\ncrisis involving each country's Company helped fuel Revolution. Financial problems in the\nBritish Company lead to the Boston Tea Party, and the bankruptcy of French Company\ncontributed to the state's decision to call the Estates General. Both of these events can be\n\n1 Philip J. Stern, \"Company, State, and Empire: Governance and Regulatory Frameworks in\nAsia,\" in Britain's Oceanic Empire: Atlantic and Indian Ocean Worlds, C. 1550-1850, ed. H. V.\nBowen, Elizabeth Mancke, and John G. Reid (Cambridge: Cambridge University Press, 2012),\n132; Emily Erikson, Between Monopoly and Free Trade: The English East India Company,\n1600-1757, Princeton Analytical Sociology Series (Princeton: Princeton University Pres, 2014),\n73.\n2 Erikson, Between Monopoly and Free Trade, 52, 73.\n\nclassified as immediate precursors to revolution. Intuitively, it makes sense that a financial crisis\nwould leave a country in a fragile state, ripe for revolution. That in both countries the Company\nwas involved in such a financial crisis may either be the result of the special link between East\nIndia Companies and governments or a simple result of the fact that East India Companies were\nlarge and were financially vulnerable during this period.\nAn attempt by the British government to remedy a financial crisis in the British East\nIndia Company in 1773 lead to the Boston Tea Party, a key event in the preamble to the\nAmerican Revolution. At the time, the British Company had a surplus of seventeen million\npounds of tea in its warehouses, largely as a result of colonists in America buying cheaper\nsmuggled tea. The British Company's inability to sell this tea compounded other financial\nproblems it faced at the time.3 Only 237,062 pounds of Company tea was sold in the American\ncolonies in 1772,4 but the British government estimated that up to two million pounds of\nCompany tea could be sold per year if the price to consumers was low enough to undercut that of\nthe smuggled tea.5 The Tea Act of 1773 aimed exploit this potential market in order to aid both\nthe British Company and the British government. With the tax on tea lowered and an allowance\nfor the Company to sell directly to colonial merchants,6 the British Company would be able to\nsell its surplus tea and the administration would profit from the tax paid on the large amount of\ntea being purchased.7 This effort backfired when colonial resentment of the tea tax, as well as\nother aspects of the Company's operations, was put on display in the Boston Tea Party. Thus, the\n\n3 Benjamin W. Labaree, Catalyst for Revolution: The Boston Tea Party, 1773 (Massachusetts\nBicentennial Commission Publication, 1973), 19.\n4 James R. Fichter, So Great a Proffit: How the East Indies Trade Transformed Anglo-American\nCapitalism (Cambridge, Mass: Harvard University Press, 2010), 12.\n5 Labaree, Catalyst for Revolution: The Boston Tea Party, 1773, 19.\n6 Fichter, So Great a Proffit, 12.\n7 Labaree, Catalyst for Revolution: The Boston Tea Party, 1773, 9.\n\nBoston Tea Party provides a link between the financial crisis in the British Company and the\nAmerican Revolution.\n\nAn analogous sequence of events occurred prior to the French Revolution. At the French\nCompany's peak in the early 1750s,8 sales of goods imported from the Indies exceeded one\nhundred million livres, and the Company was operating with a 15% margin.9 The disruption of\ntrade due to the Seven Years' War led to the collapse of this trading empire.10 Shareholders\nrallied, hoping that if they could avoid having the Company's monopoly revoked in the short\nterm, the Company could recover in the long term.11 It seemed as though this argument,\npresented by Jacques Necker with emphasis on the fact that \"the company had proven very\nuseful to the monarch and the state,\"12 was winning for a time. However, in 1770 the French\nCompany's monopoly was revoked, and the Company was set to be liquidated.13 With this\nliquidation, the Company's shares became government obligations.14 This debt, among others,\nforced France to borrow itself to the verge of bankruptcy in the 1780s. Rather than declare\nbankruptcy, however, the Estates General was called,15 allowing for the rise of the Third Estate\n\n8 K. Margerison, \"The Shareholders' Revolt at the Compagnie Des Indes: Commerce and\nPolitical Culture in Old Regime France,\" French History 20, no. 1 (January 26, 2006): 27,\ndoi:10.1093/fh/cri054.\n9 Philippe Haudrere, \"The French India Company and Its Trade in the Eighteenth Century,\" in\nMerchants, Companies, and Trade: Europe and Asia in the Early Modern Era, ed. Sushil\nChaudhury and Michel Morineau, Studies in Modern Capitalism = Etudes Sur Le Capitalisme\nModerne (London ; New York: Cambridge University Press, 1999), 203.\n10 Margerison, \"The Shareholders' Revolt at the Compagnie Des Indes,\" 27.\n11 Ibid., 28.\n12 Ibid., 45.\n13 Ibid., 48-49.\n14 Lynn Hunt, \"The Global Financial Origins of 1789,\" in The French Revolution in Global\nPerspective, ed. Suzanne Desan, Lynn Hunt, and William Max Nelson (Ithaca: Cornell\nUniversity Press, 2013), 34.\n15 Gail Bossenga, \"Financial Origins of the French Revolution,\" in From Deficit to Deluge: The\nOrigins of the French Revolution, ed. Thomas E. Kaiser and Dale K. Van Kley (Stanford, Calif:\nStanford University Press, 2011), 38.\n\nand the beginning of the French Revolution.\n\nAnother similarity between the American and French Revolutions is that in both cases the\nCompany was associated with the power being rebelled against. In the American Revolution, the\ndestruction of Company tea as an act of rebellion against the British government is evidence of\nthis belief. Similar evidence can be found with regards to the French Revolution in the\nliquidation scandal preceding the Reign of Terror. As royal charters granting monopolies were\nkey to the function of both the British16 and French East India Companies,17 this is not surprising.\nAdditionally, the British and French governments had built links to their respective Companies\nprior to the revolutionary era beyond these charters. For example, in Britain, the Company acted\nas an instrument of empire, functioning as a government in parts of India.18 In France, the\nCompany was incorporated into John Law's infamous \"System\" which for a time was the official\nfinancial system in France.19 The importance of these relationships became clear as resentment\ntowards both the government and the Company built toward revolution in each country. While\njoint stock companies with government-granted monopolies were once a revolutionary idea,\nevidence suggests that by the end of the 18th century, they were instead something to rebel\nagainst.\nThe willingness of American revolutionaries to destroy British Company property in the\nBoston Tea Party as an act of rebellion against the British government is evidence for the\nperceived equivalence of the British Company and the British government. In the meetings of the\n\n16 Stern, \"Company, State, and Empire: Governance and Regulatory Frameworks in Asia,\" 132.\n17 Erikson, Between Monopoly and Free Trade, 73.\n18 Stern, \"Company, State, and Empire: Governance and Regulatory Frameworks in Asia,\"\n140-141.\n19 Antoin E. Murphy, \"John Law: Innovating Theorist and Policymaker,\" in The Origins of\nValue: The Financial Innovations That Created Modern Capital Markets, ed. William N.\nGoetzmann and K. Geert Rouwenhorst (Oxford ; New York: Oxford University Press, 2005),\n234-235.\n\n\"Body Publick\" prior to the Boston Tea Party, the figures most derided were Massachusetts\ngovernor Thomas Hutchinson and the consignees who were set to receive the tea.20 These figures\nwere not seen as representatives of the Company. Hutchinson was seen as a representative of the\nBritish government. While a characterization of him as a \"Representation of Majesty\" was\nmocked by the Body, that he was characterized as such indicates that his primary role was to\nrepresent British power in Massachusetts.21 The consignees depended on orders from the British\nCompany,22 but it was their actions as individuals \"basely preferring their own private Interest to\nthe general Good\" that provoked the Body to revolve that anyone importing dutied tea was \"an\nEnemy to his Country.\"23 Also discussed extensively was how \"accursed and unrighteous\"24 the\nAct was, a description that implies that British lawmakers had erred in the view of the Body.\nWhile the recorded discussion of the Body does not lay blame on the Company itself, the people\neventually came to the conclusion that destroying Company property was a logical way to their\ndemonstrate objections to the actions of the British government and those affiliated with it.25\nThus, we must conclude that the Company and the British government were two tightly linked\nconcepts in the minds of American revolutionaries.\n\nA similar link can be seen between the French Old Regime and the French Company in\nthe scandal in the French Company preceding the Reign of Terror. In one of many conspiracies\nthat came to a climax in November 1793,26 Montagnard politician Francois Chabot accused\n\n20 L. F. S. Upton, \"Proceedings of Ye Body Respecting the Tea,\" William and Mary Quarterly,\nThird, 22, no. 2 (April 1965): 292.\n21 Labaree, Catalyst for Revolution: The Boston Tea Party, 1773, 11.\n22 Upton, \"Proceedings of Ye Body Respecting the Tea,\" 292.\n23 Ibid., 295.\n24 Ibid.\n25 Ibid., 298-299.\n26 Norman Hampson, The Life and Opinions of Maximilien Robespierre (London: Duckworth,\n1974), 202-212.\n\nseveral notable Girondins of blackmailing first bankers and then officials of the French Company\nin an effort to secure easy terms for the liquidation of the Company.27 An easy liquidation of the\nCompany would have allowed insiders to profit in the last moments of the Company's life. Jean\nPierre de Batz, a royalist known for his attempts to save Louis XVI and Marie Antoinette from\nthe guillotine, was thought to be behind the plot.28 While the veracity of Chabot's story is\nquestionable, it is clear that \"a good deal of corrupt speculation\" was occurring.29 In contrast to\nthe role of the British Company in the Boston Tea Party, the French Company acted more as a\npawn than as a player in this scheme. Still, the willingness of the Montagnards to accuse their\npolitical opponents of aiding the Company in its dying moments, even if it was a self-serving act,\nis evidence of a perceived alliance of interests between the Company and the less radical party.\nLooking at the distinctions between the situations in Britain and France, one particularly\nprominent difference is the nature of the objections raised related to the Company. The primary\nissues that American revolutionaries expressed associated with the British Company were its\ninvolvement in taxation and its monopoly. In France, however, it was not the actual operations of\nthe Company that were problematic. Instead, it was the fraud that surrounded trade of the\nCompany's stock. American and French revolutionaries obviously had different relationships\nwith their associated Companies. Americans had experienced a colonial relationship with the\nCompany, while the French were more familiar with the Company's operations in its\nmetropolitan base. This difference in experience is clear in the different complaints the two\ngroups of revolutionaries had about their Companies.\n\nOne aspect of the British Company that American revolutionaries took issue with was the\n\n27 Ibid., 209.\n28 N. Hampson, \"Francois Chabot and His Plot,\" Transactions of the Royal Historical Society 26\n(1976): 7, doi:10.2307/3679069.\n29 Ibid., 13.\n\ntax levied on the tea it sold. The American patriots' objection to taxation by the British\ngovernment was not limited to tea, but the tax on tea drew particular ire as it remained after other\ntaxes had been withdrawn.30 As by law all tea was imported by the Company,31 the\nimplementation of this tax was unavoidably linked to the Company. Taxation was a political as\nwell as economic issue, though: even when duties were reduced such that taxed Company tea\nwas priced comparably to smuggled tea, patriots refused to buy the legal tea, crying \"no taxation\nwithout representation\" as they threw the tea overboard in the Boston Tea Party.32 The Company\ndid not choose to implement the tea tax, but was pulled into the political struggle between Britain\nand its American colonies because of its unavoidable involvement in the administration of the\ntax.\nThe issue of monopoly brought the British Company into another aspect of the dispute\nthat would become the American Revolution. Monopoly was, to the American revolutionaries,\n\"a tool of a dangerous state.\"33 They feared that the oppressive system of governance that had\nbeen set up by the British Company in India34 could emerge in America. The tendency of\nmonopoly governments to be \"military and despotical\" was recognized by Adam Smith,35\nindicating that this was not a fear unique to the American situation. However, this idea was\ncompatible with the uniting revolutionary idea of liberty and thus was easily adopted by\n\n30 Labaree, Catalyst for Revolution: The Boston Tea Party, 1773, 8-9.\n31 Ibid., 6.\n32 Ibid., 7.\n33 Fichter, So Great a Proffit, 17.\n34 Stern, \"Company, State, and Empire: Governance and Regulatory Frameworks in Asia,\"\n140-141.\n35 Adam Smith, An Inquiry into the Nature and Causes of the Wealth of Nations, ed. Edwin\nCannan, 5th ed. (London: Methuen & Co., 1776), bk. 7, chap. 190,\nhttp://www.econlib.org/library/Smith/smWNCover.html.\n\nAmerican revolutionaries.36 Others who opposed the monopoly did so on the grounds that the\nmonopoly violated a right to property. As this argument went, there were British merchants other\nthan the Company who would have liked to participate in the Atlantic tea trade, and by giving\nthe Company a monopoly these merchants lost potential profits, and thus property.37 The\narguments against monopoly were more philosophically motivated than those against taxation,\nbut both issues were clearly present in the minds of American revolutionaries.\n\nIn contrast, the primary issue that French revolutionaries had with the French Company\nwas the fraud that had plagued the operation of the Company throughout its history. This\ncorruption began with John Law's incorporation of the French Company into his new French\nfinancial system as part of the Mississippi Company.38 During the dramatic boom and bust of the\nMississippi Company stock prices, Law manipulated the market to drive stock prices up and then\nfurther manipulated prices, fueling the plummet.39 A later example of the French Company's\ninvolvement in fraud can be seen in the Paris Bourse of the 1780s. Trading in the Paris Bourse\nwas a more complex matter than stock trading had been in the day of John Law: there were Bulls\nand Bears, and techniques like buying stocks for future delivery and hedging investments were\nemployed.40 In 1786, when a crash seemed imminent, the government allocated 115,000 livres to\nprop up prices. A syndicate was appointed to invest this money. However, rather than investing\nthe money as intended, the syndicate attempted to corner the market on Company stock.\n\n36 Fichter, So Great a Proffit, 18.\n37 Ibid., 18-19.\n38 Margerison, \"The Shareholders' Revolt at the Compagnie Des Indes,\" 26-27.\n39 James MacDonald, A Free Nation Deep in Debt: The Financial Roots of Democracy\n(Princeton, NJ: Princeton University Press, 2006), 197-201.\n40 George V. Taylor, \"The Paris Bourse on the Eve of the Revolution, 1781-1789,\" The\nAmerican Historical Review 67, no. 4 (July 1962): 967-968.\n\nExposure of this fraud resulted in outrage.41 With this history, the scandal in the Company's\nliquidation in 179342 should have come as no surprise. While the British company was known,\nand hated, for aspects of its business, it was fraud that defined the French Company.\n\nFinally, the fate of corporations in general differed greatly between the American and\nFrench Revolutions. After the American Revolution, a culture of free trade arose in America and\nproved very profitable. Eventually, this culture spread to Britain and allowed for growth in other\nareas of American commerce. In contrast, joint stock companies and the stock market were\nbanned during the French Revolution. Even after the end of the ban, this had the notable\nconsequence of retarding the growth of corporations in France. While these trends do not apply\nto the East India Companies specifically, they can be seen as the ultimate display of differing\nrelationships of the two revolutions to the two Companies. Americans saw the Company as\nsomething to improve upon, while the French saw the Company as an idea that had already done\ntoo much damage.\n\nThe product of the relationship between the British Company and the America\nRevolution can be seen in America's implementation successful free trade regime, and ultimately\nBritain's decision to revoke the Company's monopoly. A culture of free trade arose in American\nimmediately after the Revolution.43 The government's support for this trade is clear in the terms\nof the 1795 Jay Treaty with Britain. The treaty affirmed American neutrality in the wars between\nBritain and France, which had already given American traders a distinct advantage over the\ninvolved European powers. Further, the treaty granted \"reciprocity in navigation\" which ensured\n\n41 Ibid., 970-971.\n42 Hampson, The Life and Opinions of Maximilien Robespierre, 208.\n43 Fichter, So Great a Proffit, 39.\n\nthat American vessels could continue to trade at British Company ports in India.44 The new\nsystem of American trade was as unlike the old British system as it could be: American ships\nsailed on no set schedule, their merchants traded on the open market in India, and voyages were\nmade between many Atlantic ports to a variety of ports in India.45 These differences can be\npartially credited to the American spirit of freedom, but it seems though there was also a\nconcerted effort made to develop a system unlike the one that the patriots had rebelled against.\nUnable to compete, Britain dropped the Company's monopoly of trade with India in 1813.46 A\nnew era of free trade began with the end of the Company's monopoly, with both imports from\nand exports to India growing significantly in the years after the monopoly was lifted. The success\nof this reform led to further liberalization of British trade, including the removal of the\nCompany's monopoly in China in 1833.47 In short order, American and British trade in the\nIndies had been transformed from the old monopoly model to a new model of free trade.\n\nThe trend of the American Revolution having positive effects on the growth of free trade\ncorporations and negative effects on monopoly corporations continued into the nineteenth\ncentury. After interrupting Britain's dream of being a \"trade emporium\" at the end of the 18th\ncentury, war with Britain intruded on America's prolific trade with the Indies.48 The capital that\nAmerican merchants had accumulated in the Indies trade did not disappear, though. It was\ntransferred to \"domestic banking, manufacturing, and real estate.\"49 The businesses that\nmerchants invested are historically significant: Stephen Girard's unincorporated bank helped\n\n44 Ibid., 176-177.\n45 Ibid., 195.\n46 Ibid., 232-233.\n47 Ibid., 250-251.\n48 Ibid., 83, 197.\n49 Ibid., 252-254.\n\nfund the War of 1812,50 Israel Thorndike's Boston Manufacturing Company ran the\ngroundbreaking Lowell Mills,51 and John Jacob Astor made astounding investments in land in\nNew York and the Pacific Northwest.52 All of these businesses were able to exist as a result of\nAmerica's previous lucrative Indies trade. Indirectly, Americans' experience with the British\nCompany contributed to building the American capitalist system in areas far removed from the\nIndies trade itself.\n\nIn stark contrast, during the French Revolution joint stock companies were banned. The\nban came after a speculation-fueled economic crisis in 1793 that resulted in a dramatic rise in\ncommodity prices. Combined with the egalitarian zeal of the revolution, an end to the stock\nmarket and joint stock corporation seemed an ideal solution to some of the more radical\nrevolutionaries.53 These reforms became a reality in August 1793 during the Montagnards' rise\nto power.54 After the Revolution, corporations eventually reemerged in France. The first\ninsurance company was incorporated in 1819, and by 1830 shares of seven insurance companies\nwere being traded on the reopened Bourse.55 The railroad industry also grew in nineteenth\ncentury France,56 and the Credit Foncier and Credit Mobelier corporations were founded in\n1852 to provide credit for land development.57 While capitalist institutions did eventually begin\nto grow in France, their growth was clearly hindered. The ban on corporations during the French\nRevolution likely contributed to this delay.\n\n50 Ibid., 260.\n51 Ibid., 269.\n52 Ibid., 272-273.\n53 Georges Lefebvre, The French Revolution (Columbia University Press, 1962), 60-61.\n54 Ibid., 67.\n55 E. Vidal, The History and Methods of the Paris Bourse (Washington: Government Printing\nOffice, 1910), 176, https://fraser.stlouisfed.org/docs/historical/nmc/nmc_573_1910.pdf.\n56 Ibid., 177-181.\n57 Ibid., 186.\n\nComparing the relationship of the British East India Company and the American\nRevolution to that of the French East India Company and the French Revolution, we find that\nboth the similarities and differences provide insight into the Atlantic world of the 18th century.\nThe motif in which a crisis in the Company preceded and can be tied to the beginning of a\nRevolution can be seen in both situations. This is not unexpected, as the volatile environment left\nin the wake of a major financial crisis is an ideal environment for the development of a\nrevolution. The link between the Company and the party being rebelled against in each\nRevolution is also unsurprising. Company operations in both England and France depended on a\ngovernment granted monopoly, and governments had built links to the Companies prior to the\nRevolutions. The differences between the British and French situations lead to more interesting\nconclusions. In the British case, American patriots objected to the taxes the British Company\ncollected and the monopoly it operated under. In the French case, there were more practical\nobjections to the fraud that had plagued the Company throughout its history. This difference\npoints to a perception of the British Company as focused on actual operations and the French\nCompany as more of a tool for speculation. Additionally, it sheds light on the different\nexperiences revolutionaries in the two countries had with the two Companies. The diverging\npaths of free trade after the American and French Revolutions allow us to further differentiate\nbetween the views of the American and French revolutionaries. As Americans saw the situation,\ncorporations as a whole did not need to be banned, just restructured so that they were consistent\nwith revolutionary ideals. Seeing America's success, Britain followed. On the other hand, in\nFrance there was seemingly no way to separate the company from the fraud that came with\nspeculation other than to ban joint stock companies and the stock market all together, and to later\nstart again from scratch. Careful comparison of the situations of the British and French East India\n\nCompanies aids our understanding of an important era and two major players in it.\n\nWorks Cited\n\nBossenga, Gail. \"Financial Origins of the French Revolution.\" In From Deficit to Deluge: The\nOrigins of the French Revolution, edited by Thomas E. Kaiser and Dale K. Van Kley,\n38-66. Stanford, Calif: Stanford University Press, 2011.\nErikson, Emily. Between Monopoly and Free Trade: The English East India Company, 1600-\n1757. Princeton Analytical Sociology Series. Princeton: Princeton University Pres, 2014.\nFichter, James R. So Great a Proffit: How the East Indies Trade Transformed Anglo-American\nCapitalism. Cambridge, Mass: Harvard University Press, 2010.\nHampson, N. \"Francois Chabot and His Plot.\" Transactions of the Royal Historical Society 26\n(1976): 1. doi:10.2307/3679069.\nHampson, Norman. The Life and Opinions of Maximilien Robespierre. London: Duckworth,\n1974.\nHaudrere, Philippe. \"The French India Company and Its Trade in the Eighteenth Century.\" In\nMerchants, Companies, and Trade: Europe and Asia in the Early Modern Era, edited by\nSushil Chaudhury and Michel Morineau, 202-11. Studies in Modern Capitalism = Etudes\nSur Le Capitalisme Moderne. London ; New York: Cambridge University Press, 1999.\nHunt, Lynn. \"The Global Financial Origins of 1789.\" In The French Revolution in Global\nPerspective, edited by Suzanne Desan, Lynn Hunt, and William Max Nelson, 33-43.\nIthaca: Cornell University Press, 2013.\nLabaree, Benjamin W. Catalyst for Revolution: The Boston Tea Party, 1773. Massachusetts\nBicentennial Commission Publication, 1973.\nLefebvre, Georges. The French Revolution. Columbia University Press, 1962.\nMacDonald, James. A Free Nation Deep in Debt: The Financial Roots of Democracy. Princeton,\nNJ: Princeton University Press, 2006.\nMargerison, K. \"The Shareholders' Revolt at the Compagnie Des Indes: Commerce and Political\nCulture in Old Regime France.\" French History 20, no. 1 (January 26, 2006): 25-51.\ndoi:10.1093/fh/cri054.\nMurphy, Antoin E. \"John Law: Innovating Theorist and Policymaker.\" In The Origins of Value:\nThe Financial Innovations That Created Modern Capital Markets, edited by William N.\nGoetzmann and K. Geert Rouwenhorst. Oxford ; New York: Oxford University Press,\n2005.\nSmith, Adam. An Inquiry into the Nature and Causes of the Wealth of Nations. Edited by Edwin\nCannan. 5th ed. London: Methuen & Co., 1776.\nhttp://www.econlib.org/library/Smith/smWNCover.html.\nStern, Philip J. \"Company, State, and Empire: Governance and Regulatory Frameworks in Asia.\"\nIn Britain's Oceanic Empire: Atlantic and Indian Ocean Worlds, C. 1550-1850, edited by\nH. V. Bowen, Elizabeth Mancke, and John G. Reid, 130-50. Cambridge: Cambridge\nUniversity Press, 2012.\nTaylor, George V. \"The Paris Bourse on the Eve of the Revolution, 1781-1789.\" The American\nHistorical Review 67, no. 4 (July 1962): 951-77.\nUpton, L. F. S. \"Proceedings of Ye Body Respecting the Tea.\" William and Mary Quarterly,\nThird, 22, no. 2 (April 1965): 287-300.\nVidal, E. The History and Methods of the Paris Bourse. Washington: Government Printing\nOffice, 1910. https://fraser.stlouisfed.org/docs/historical/nmc/nmc_573_1910.pdf.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.382 Capitalism in the Age of Revolution\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.382F16 Capitalism in the Age of Revolution - Student Example 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-382-capitalism-in-the-age-of-revolution-fall-2016/9ce15d1694881b46166c0f52afe59b6c_MIT21H_382F16_Corporation.pdf",
      "content": "The Corporation as a Dynamic Modern Capitalist Institution that can either\nSupport or Conflict with Representative Democracy\n\nThis paper examines the role of the corporation in the time of the American and\nFrench Revolutions. The corporation was associated with authoritarian rule and\ndevastating economic outcomes, making it a target of public resentment that buoyed the\ncause of representative democracy. Corporations were investment instruments in\nspeculative stock markets, recipients of bailouts, and agents for taxation. In these forms,\nthis modern financial institution conflicted with democracy. The public's criticism of the\ncorporation helped fuel both the American and French Revolution. However, the\ncorporation did not only create resentment of the government. Its failures also helped\nadvise the changes the Americans and French desired in their new democratic\ngovernments. In America, a new understanding of the role of government informed better\ncorporate governance and shifted the corporation's mission. Thereby, the corporation was\nable to survive harsh opposition and thrive in post-Revolutionary America. Eventually,\nthat model would spread globally. Depending on the country and circumstances,\ncorporations can act in conflict or in concert with democracy to this day.\n\nSpeculation on corporate shares resulted in the stock market crash and contributed\nto the fiscal crisis of 1787 that was \"the immediate precipitating cause of\" the French\nRevolution (Hunt 32). In 1785 and 1786, \"values rose precipitously\" (Hunt 39) for shares\nof the newly re-chartered French East India Company, along with various other\ncompanies. Stock market participants and companies used financial capital to generate\nhuge speculative fortunes, such as that of Claviere. Ironically, the same speculators who\n\nmade a fortune on the Paris Bourse were hailed as \"righteous denouncers of speculation\"\n(Hunt 42). Calonne, the finance minister, took measures to reduce speculation by\nstabilizing prices. However, his agents cornered the market. Calonne was denounced as\nparticipating in agiotage, leading to a loss of credibility for him and the French\ngovernment. Calonne's interference in the operations of the Paris Bourse both failed to\nprevent crisis and redoubled resentment towards the government.\n\nIn fact, the dangers of speculative frenzy were experienced in France as early as\n1720 when Law's System was implemented. He created a Mississippi Company that had\ngrossly exaggerated prospects (Wennerlind 231) and used propaganda to support his\nSystem and even defended \"despotic authority\" (Kaiser 17). He converted government\ncreditors into Mississippi company shareholders, believing that this would make them\npassive. He thought, \"in credit... it is necessary that the supreme power reside in a single\nperson\" (MacDonald 205) and applied this viewpoint to the management of the\nMississippi Company and the entire French economy. The magnitude of his failure and\nthe resulting deflation (MacDonald 204) served to sow the seeds of distrust in\nauthoritarian France; some historians claim that it \"conditioned responses to monarchical\nauthority down to the French Revolution\" (Kaiser 2). MacDonald professes that Law's\nSystem was flawed because it was based on faulty principles. While the System\nattempted to recreate the success of mercantilist states, it simultaneously worked to\nconsolidate power in the crown. The Genoese mercantilist state, however, was \"entirely\ncontrolled and run by its citizen shareholders\" (MacDonald 204-205). Law's confidence\nin authoritarian rule was deeply in conflict with democracy, and so too was the System\nand company he created. However, some of his other financial principles such as paper\n\nmoney and monetary stimulus, may not have been in conflict with the democracy had\nthey not be associated with Law's despotic rhetoric and ultimate failure.\n\nThe French Revolution rejected the joint stock corporation in part because of the\ndestructive nature of stock jobbing and the perception that government used stock\nspeculation for its own gain. The influence of speculative capital on the financial crisis\nthat precipitated the French Revolution supports the notion that companies, as\ninstruments of stock speculation, were in conflict with revolutionary ideals. Taylor\naffirms, \"the join stock enterprises... contributed less to production, trade, or insurance\nthan to stock-jobbing and price manipulation\" (Taylor 977). High levels of speculation\ncreated sharp business cycle downturns. In France, some capitalist institutions such as\ncompanies and stock markets were relatively new. The \"temporal rhythm\" and \"creative\ndestruction\" (Sewell 7) of capitalist systems was not understood when the populace\nblamed the authoritarian government for the country's economic woes. Fiscal crisis acted\nas an agitator for change towards representative democracy. The crisis required\nspeculative capital, joint stock companies and the massive indebtedness of the French\ngovernment to make it as harmful as it was.\n\nGrowing interconnectedness of the eighteenth century Atlantic economy allowed\nfor states and companies to be increasingly leveraged. Debt was an essential pillar of\ncapitalism that fueled corporate growth and public spending. Hodgson includes \"the\nwidespread use of credit... and selling of debt\" as part of his definition of capitalism\n(Hodgson 259). Governments often implicitly underwrote corporate debt obligations,\nleading to moral hazard that allowed companies to take on risky debt that proved too\nonerous to manage. In 1773, the British East India Company was in \"dire financial\n\nstraits\" (Labaree 9). It made a deal with the British government to have a monopoly on\nselling tea in America. The deal was made \"perhaps partly because much of the\nCompany's debt were owed to the Government\" (Labaree 9). To the Company's chagrin,\nthe British Government did not remove the Townshend duties on the tea the company\nwould export to America. The imposition of the tax was an anathema to patriotic\nAmericans; Labaree claims the resulting Boston Tea Crisis was an essential catalyst for\nthe American Revolution. The desire of the British government to prevent the default of\nthe East India Company's suggests that the government had mistakenly allocated its\ncredit too narrowly. In a time where the government was facing financial crisis because\nof its debts from the 7 Years War (Labaree 7), it could not afford to allow the Company\nto default. This created an American backlash to taxation that was blamed on both the\nBritish government and the Company. The Company monopoly was deemed \"unjust and\noppressive regulations of trade\" (The Massachusetts Gazette, December 1773) and\nultimately its property was destroyed when its tea was thrown overboard. The British\nEast India Company worked, to an extent, in concert with the British government.\nAmerican revolutionaries could not accept corporations in this form. The complicated\nrelationships of creditors and debtors in Britain lead to the Boston Tea Crisis, an event\nthat defined the upcoming conflict between America and Britain.\n\nFrench revolutionaries also gained momentum from conflict with over-leveraged\ninstitutions: the French East India Company and the French crown. The French crown\ndefaulted on its large debts multiple times in the seventeenth and eighteenth centuries\n(Bossenga 44). France's prosperity in the 1780s drove increased stock market speculation\nand also increased the levels of government debt (Hunt 43). Government debt was often\n\nissued in the form of life annuities, which \"ruined the state\" (Taylor 963) at interest rates\nof 8-9%. The crown's rich history of defaults and the opacity of its accounts lead to these\nhigh rates. The increasing interconnectedness of global markets allowed new capital from\nGeneva and other European capitals to flow to France, at a time when local investors\nwere reluctant to risk the default they had experienced before. Capital flowed to\nspeculative investment on the Paris Bourse. Calonne took action to stabilize shares, but at\nthat point the French government debt issuances were already engaging in Ponzi finance,\nas defined by Minsky's financial instability hypothesis. The government was \"borrowing\nto pay interest\" (Minksy 7) by creating an \"artificial bull market\" (Darnton 152).\nCalonne's interventions created the \"inflationary bias\" (Minksy 5) that eventually led to a\n\"collapse in asset values\" (Minksy 8), which benefitted the bearish investors such as the\nimmigrant Claviere. The stock market crash served to strengthen the view of government\nas \"a world of decadent courtiers and despotic ministers\" (Darnton 153). The speculation\nwas fueled by foreign capital reaching the French market and the crash was created by\nthe desperate attempts to save the French government from another default.\n\nThis interconnectedness and over-leverage in the Atlantic economy led to forced\neconomic errors by the French and British governments. Both Revolutions fed off\nresentment at the effective bailouts received by corporations and the crises that resulted\nfrom overconfidence, either in the American tea market or in the French stock market.\nThe excessively close relationships between government and corporation lead to moral\nhazard and ultimately unacceptable outcomes for the general populace. However, this\nrelationship does not only exist when authoritarian governments are in power. Judge\nRakoff suggests that in the Financial Crisis of 2007 \"the [American] government was\n\ndeeply involved, from beginning to end, in helping create the conditions that could lead\nto such fraud.\" Government favoritism for corporations creates a conflict with\ndemocracy. Government, democratic or not, loses credibility when the influence of\ncorporations unduly overshadows the needs of citizens. Minsky, writing in 1992 before\nthe most recent financial crisis, contends, \"government interventions aimed to contain the\ndeterioration seem to have been inept in some of the historical crises\" (Minksy 1).\n\nIn the eighteenth century, corporations supported authoritarian governments,\nfinanced a greedy elite, and failed at international governance. Adam Smith describes\nexclusive companies as \"nuisances in every respect\" and \"destructive to those which have\nthe misfortune to fall under their government\" (Smith IV.7.194). Even when corporate\nstock was more accessible to the public, the result was stock market crashes and fiscal\ncrisis. The French Revolutionary government outlawed corporations in 1791 (Maier 51).\nWhy then were over 200 acts of incorporation passed in the 1790s in Massachusetts alone\n(Maier 54)? After the Revolution, corporations became common in America. Entities\nsuch as cities, businesses and colleges were incorporated and sought benefit from being\nable to \"make binding rules for its self-government, to function in law as a single\nperson... and to persist after the lifetimes of its founding members\" (Maier 54).\n\nOne reason for the invigoration of the American corporation may be that without\nlarge institutions like a crown, the capital needed to build new infrastructure was difficult\nto come by. Without the influence of the English crown, Americans desired to improve\ntheir own lot and so joined forces in the corporate form to achieve their aims. In New\nEngland, individuals were less wealthy than in the south, and so combined \"their assets to\n\naccomplish what other, such as the early bridge builders of Virginia, could apparently do\nalone\" (Maier 57).\n\nThe change in government from authoritarian to representative democracy\nchanged the aim of the corporation and so allowed it to thrive in America. The East India\nCompanies that American and French Revolutionaries despised served the government\nby providing revenue and asserting the interests of the government abroad. American\ncorporations were \"agencies of government... for the furtherance of community\npurposes\" (Primm). It may seem that nothing had changed. However, the key difference\nwas the nature of government. An American corporation was an agency of government,\nbut that did not mean it enriched government officials or an elite aristocracy. Rather, like\nthe democratic government, it served a public need in addition to its private purpose. In\nthis form, the corporation became compatible with representative democratic\ngovernment.\n\nThe strong opposition to corporations in America molded the changing form of\nthe corporation. Inspired by British thinkers like Adam Smith, some Americans such as\nPennsylvania's Governor thought that corporations \"take away from people their\ncommon rights and give them to a few\" (Shunk). Municipal corporations were reformed\nto fit \"the more modern and plain republican institutions of the present day\" (Maier 64).\nBusiness corporations were also reformed to include limited charters (Maier 76) and to\nenhance shareholder rights while reducing the power of any one shareholder (Maier 77).\n\nIn time, the corporation exemplified an important strength of representative\ndemocracy. Open debate resulted in better aligning corporate charters with serving a\npublic good as well as private interests. This notion persisted potentially as late as 1900\n\n(Maier 81). By adapting this corporate model, the new American democracy was able to\nwield the power of financial capital for the improvement of their new nation.\n\nThe American corporation was not the first example of a corporation that was in\nconcert with revolutionary values; the French East India Company shareholder's revolt of\n1769 introduced patriotic republicanism to the public discourse (Margerison 26). The\nshareholders deemed themselves effectively a \"self-governing commercial republic\"\n(Margerison 25). The dispute was important as it involved direct conflict between owners\nof the company and the crown. Previously, people who were creditors to the government\nhad little authority or agency to protest a crown default. These shareholders saw\nthemselves differently. They believed they \"possessed the ultimate authority to govern\nthe Compagnie des Indes\" and \"had the duty to expose the corruption of its\nadministrators and the despotism of the royal ministers\" (Margerison 26). The discourse\nof \"judicial Jansenism and classical republicanism\" (Margerison 49) presaged\nRevolutionary dialogue. Pamphleteers later used the story of the shareholder revolt to\nemphasize government despotism (Margerison 50). Ultimately, the crown removed the\ncompany's exclusive privilege, which led to its liquidation. Before and after the\nshareholder's revolt, the French East India Company was used as a government puppet,\nby financing its military efforts and protecting its trading position. However, the self-\ngoverning model that originated in Genoa and would later come to prominence in the\nAmerican corporation was powerfully introduced in France by this brief period of\nshareholder governance. In this case, the corporation acted against the authoritarian\ngovernment. The French Revolution was amenable to the ideas the shareholder revolt\n\ncreated, though not supportive of the corporation itself given its previous and later\nassociation with authoritarianism.\n\nThe success of the post-Revolutionary American corporation suggests that the\nprivate and public benefit provided by incorporation could be compatible with\ndemocracy. However, the events of the 2007 Financial Crisis exemplify many of the\nobjectionable features corporations bore before the Revolution. Market speculation led to\ncompanies being over-leveraged, which brought them to the brink of bankruptcy. Bear\nSterns and AIG, for example, required, and received, government bailout to survive\n(Stewart). Fraud and moral hazard in companies were common accusations (Rakoff). The\ngovernment and company interactions may or may not have benefitted the public by\nreducing the severity of the resulting crisis. However, Congressmen and constituents\nwere often principally opposed to the bailouts (Stewart). This calls into question\ncompatibility of the current state of the American corporation with representative\ndemocracy.\n\nIn most circumstances in the eighteenth century, the corporation was at odds with\ndemocratic ideals. French revolutionaries had the examples of the Mississippi Company,\nthe French East India Company and the various companies speculated on in the Paris\nBourse to vilify. Americans resented the presence of the British East India Company. In\nsum, these corporations made ill-fated use of other modern capitalist institutions such as\nstock markets, paper money and the increased availability of capital in a global market.\nNonetheless, the relationship between post-Revolutionary America and the corporation\nillustrates that representative democracy can change the nature of these institutions to be\nincreasingly compatible with a representative system where the needs of the populace are\n\nprioritized. This leads to the conclusion that these institutions do not inherently conflict\nwith or support democracy, but rather are molded by the governments that create them.\n\nReferences\n\nHunt, Lynn. The French Revolution in Global Perspective: The Global Financial Origins\nof 1789. Essay 2. Ithaca and London: Cornell University Press. Print.\n\nWennerlind, Carl. Casualties of Credit: The English Financial Revolution, 1620-1720.\nCambridge and London: Harvard University Press, 2011. Print.\n\nKaiser, Thomas. Money, Despotism, and Public Opinion in Early Eighteen-Century\nFrance: John Law and the Debate on Royal Credit. Journal of Modern History 63, 1991.\nPrint.\n\nMacdonald, James. A Free Nation Deep in Debt. Princeton and Oxford: Princeton\nUniversity Press, 2003. Print.\n\nTaylor, George. The Paris Bourse on the Eve of Revolution, 1781-1789. American\nHistorical Review 67 no. 4. 1962. Print.\n\nSewell, William. The Capitalist Epoch. Social Science History 38, no 1-2. 2014. Print.\n\nHodgson, Geoffrey. Conceptualizing Capitalism: Institutions, Evolution, Future.\nChicago: University of Chicago Press. 2015. Print.\n\nLabaree, Benjamin. Catalyst for Revolution: The Boston Tea Party. Massachusetts:\nBicentennial Commission Publication, 1973. Print.\n\nThe Massachusetts Gazette. New York, December 6, 1773. December, 1773. Page 2.\nOnline: http://www.masshist.org/revolution/essay-viewer.php?item_id=40 Accessed:\n05/15/2016\n\nBossenga, Gail. Financial Origins of the French Revolution. In From Deficit to Deluge:\nThe Origins of the French Revolution ed. Thomas Kaiser and Dale Van Kley. Stanford:\nStanford University Press. 2011. Print.\n\nMinsky, Hyman. The Financial Instability Hypothesis. Working Paper no. 74. Levy\nEconomics Institute of Bard College. 1992. Online:\nwww.levyinstitute.org/pubs/wp74.pdf. Accessed: 5/15/2016\n\nDarnton, Robert. George Washington's False Teeth. New York: W.W. Norton &\nCompany Inc. 2003. Print\n\nRakoff, Jed. The Financial Crisis: Why Have No High Level Executives Been\nProsecuted? The New York Review of Books. 2014. Online: http://bit.ly/1o4aFTV.\nAccessed: 5/15/2016\n\nSmith, Adam. Wealth of Nations. London: Methuen & Co., Ltd, 1776. Online:\nhttp://www.econlib.org/library/Smith/smWN17.html#B.IV,%20Ch.7,%20Of%20Colonie\ns Accessed: 05/15/2016\n\nMaier, Pauline. The Revolutionary Origins of the American Corporation. William and\nMary Quarterly 50(1). 1993. Print.\n\nPrimm, Economics Policy in a Western State. Quoted in Maier, page 55\n\nShunk, Annual Message to the Legislature, Jan 5, 1848, in\nth\nPennsylvania Archives, 4\nSer., vol 7: Papers of the Governors, 1845-1858. Harrisburg. 1902. Quoted in Maier,\npage 60\n\nMargerison, Kenneth. The Shareholders' Revolt at the Compagnie des Indes: Commerce\nand Politcal Culture in Old Regime France. Oxford: Oxford University Press, 2006.\nOnline: http://fh.oxfordjournals.org/content/20/1/25.abstract\n\nStewart, James. Eight Days. The New Yorker. 2009. Online: http://nyr.kr/1nzxcrO.\nAccessed 5/15/2016\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.382 Capitalism in the Age of Revolution\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.382F16 Capitalism in the Age of Revolution: Assignments-Paper 1 Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-382-capitalism-in-the-age-of-revolution-fall-2016/c5d95c58bda5781294262158c0b56ebb_MIT21H_382F16_Paper1.pdf",
      "content": "Capitalism in the Age of Revolution (Fall 2016)\n\nGuidelines for Paper 1\n\nHere are two approaches you may choose from in writing the first paper. While you are\nfree to choose another approach, your paper should be defined by an analytical question along\nthese lines, and should involve a focused comparison between the Mississippi and South Sea\nBubbles.\n\n1. In Manias, Panics, and Crashes: A History of Financial Crises (5th ed., 2005), Charles\nKindleberger and Robert Aliber write:\n\n\"Some bubbles are swindles, some are not. The Mississippi\nBubble was not a swindle; the South Sea Bubble was. A bubble\ngenerally starts with an apparently legitimate or at least legal\npurpose. What became the Mississippi Bubble initially started as\nthe Compagnie d'Occident, to which the Law system added the\nfarming-out of national tax collections and the Banque . . . [John\nLaw's] activities were not a swindle, but his financial demise\nreflected a mistake that was based on two fallacies: (1) that stocks\nand bonds were money and (2) that issuing more money as\ndemand increased was not inflationary. // In the South Sea\nBubble, the monopoly of trade in the South Atlantic was purely\nincidental. Very quickly, consolidation of British governmental\ndebt overwhelmed the South Atlantic trade aspects of the\nenterprise, and stockjobbing overwhelmed government debt\nshortly thereafter . . . To get the cash to pay profits, the South Sea\nCompany both needed to increase its capital and to have the price\nof its stock increase continuously. And it needed both increases\nat an accelerating rate as in a chain letter or in a Ponzi scheme.\"\n\nKindleberger and Aliber distinguish a \"swindle\" from \"ordinary robbery\" in that swindles\ninvolve an \"abuse of trust.\" And they distinguish swindles from bribery of government\nofficials (or of the employees of one business by those of another) in that swindles\ninvolve \"both misrepresentation and the violation of an explicit or implicit trust\nbetween particular groups.\"\n\nPlease comment on the validity of this comparison, with specific reference to our\nreadings from the first three weeks of the seminar (as well as your document from the\nSouth Sea Bubble Collection at HBS).\n\nKindleberger, Charles P., and Robert Aliber. Manias, Panics, and Crashes: A History of Financial Crises. 5th edition. Wiley, 2005.\n\n(c) Wiley. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/\n\n2. For the first week of this seminar, we read several readings that attempt to set forth a\ndefinition or interpretation of capitalism. Do you think the Mississippi and South Sea\nBubbles are a reflection of inherent tendencies within capitalism as defined by any of\nthese interpretations? Or are the essential causes of these early financial crises\n\"exogenous\" to the practices and culture of capitalism? Please take into account the\narguments of McCloskey, Sewell, Minsky, and Kocka in responding to this prompt, and\nmake use of the readings on both the Mississippi and South Sea Bubbles (in addition to\nyour document from the South Sea Bubble Collection at HBS).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.382 Capitalism in the Age of Revolution\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.382F16 Capitalism in the Age of Revolution: Assignments-Paper 2 Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-382-capitalism-in-the-age-of-revolution-fall-2016/41af0202173cfcafed749fcfc80522be_MIT21H_382F16_Paper3.pdf",
      "content": "21H.382: Capitalism in the Age of Revolution\n\nGuidelines for Paper 3\n\nThe essays in Slavery's Capitalism and earlier seminar materials relating to the slave\ntrade and the Caribbean plantation complex make a forceful case that slavery was integral to\nthe rise of North Atlantic capitalism, was itself \"capitalistic\" in important respects, and was\ngenerative of great wealth for the European metropole in the early modern period and going\ninto the 19th century in areas where it survived (the British Caribbean until 1833, the United\nStates, Cuba, and Brazil until even later). The clearest exposition of this case is made by Beckert\nand Rockman in their introduction to Slavery's Capitalism, which reviews the historiographical\nliterature situating the claim that slavery was crucial to the accumulation of modern wealth in\nrelation to earlier scholars such as W.E.B. Dubois and C.L.R. James. (Walter Johnson's essay\n\"The Pedestal and the Veil\" suggests an additional \"take\" on this theme.)\n\nHow does that claim (or set of claims) measure up against the countervailing argument\nin Deirdre McCloskey's text that the rise of modern prosperity was not a function of empire,\nslavery, trade, or even \"capitalism\" generally (understood as the accumulation of capital)? To\nthe contrary, says she, it was a product of the Great Enrichment, which was itself a product of\nthe four \"Rs,\" which gave us the liberal ideas of \"liberty, equality, and justice\" enshrined by\nAdam Smith. These values, says McCloskey, came to undergird a new emphasis on the dignity\nof the common laboring person.\n\nCan these perspectives both be correct? Do they describe different things? Are the\nslavery/capitalism scholars trying to explain something essentially different than McCloskey? If\nso, can you explain what the difference is? It seems hard to argue that they are writing on\ntotally different levels, since McCloskey herself dismisses the trade/slavery/empire/colonialism\naccount of the rise of modern wealth. Your essay should explore this debate by bringing the\ntwo perspectives into conversation, using -- as appropriate and relevant -- the definitional\nreadings on capitalism that we looked at earlier in the semester as well as any other materials\nyou think contribute to our understanding of the problem (in addition to the slavery and\nMcCloskey readings).\n\nYour essay should be nine to ten pages. Please avoid generalities - test your assertions\nby making use of specific points and by citing to the actual readings for Sessions 1, 2, 6, 12, and\n13. The essay is due in class during Session 15.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.382 Capitalism in the Age of Revolution\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21H.382F16 Capitalism in the Age of Revolution: Assignments-Paper 3 Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-382-capitalism-in-the-age-of-revolution-fall-2016/85a7e6546aa5735a1bdc7dadeb7a0a3f_MIT21H_382F16_Paper2.pdf",
      "content": "21H.382: Capitalism in the Age of Revolution\n\nGuidelines for Paper 2\n\nThe American and French revolutions are often seen as foundational to the rise of\nmodern representative democracy. Our readings for this part of the course have demonstrated\nin great detail how institutions and practices associated with financial capitalism (such as\nmoney, stock markets, and companies), as well as fiscal and corporate crises of various kinds\nprecipitated these two transformational events. Gail Bossenga, for example, observes that\n\"[f]ew would dispute that the immediate cause of the French Revolution was the impending\nfinancial bankruptcy of the royal government.\" Lynn Hunt concurs - \"almost everyone agrees\nthat the immediate precipitating cause was the fiscal crisis of 1787-1787\" - though she revises\nthat traditional picture by emphasizing France's growing commercial empire (in which the\nFrench Indies Company played a major role) and its reliance on international capital (including\nDutch, British, Spanish, and Swiss bankers).\n\nWhat does this relationship between financial capital and fiscal/corporate crisis, on the\none hand, and the late eighteenth-century Atlantic revolutions, on the other, tell you about\nrepresentative democracy? How would you characterize the relationship between eighteenth-\ncentury finance and democracy on a scale of outright conflict on one end to full compatibility\non the other? Were the American and French revolutions essentially critical or supportive of\nmodern capitalist institutions?\n\nIn answering this question, you would do well to focus on either the American or the\nFrench Revolution, rather than try to compare the two (though you can certainly make some\ncomparative references). Your essay should be six to seven pages. Please avoid generalities -\ntest your assertions by making use of specific points and by citing to the actual readings,\nincluding all relevant materials up through Session 11. The essay is due during Session 12.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21H.382 Capitalism in the Age of Revolution\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}