{
  "course_name": "Career Options for Biomedical Research",
  "course_description": "This course has been designed as a seminar to give students an understanding of how scientists with medical or scientific degrees conduct research in both hospital and academic settings. There will be interactive discussions with research clinicians and scientists about the career opportunities and research challenges in the biomedical field, which an MIT student might prepare for by obtaining an MD, PhD, or combined degrees. The seminar will be held in a case presentation format, with topics chosen from the radiological sciences, including current research in magnetic resonance imaging, positron emission tomography and other nuclear imaging techniques, and advances in radiation therapy. With the lectures as background, we will also examine alternative and related options such as biomedical engineering, medical physics, and medical engineering. We’ll use as examples and points of comparisons the curriculum paths available through MIT’s Department of Nuclear Science and Engineering. In past years we have given very modest assignments such as readings in advance of or after a seminar, and a short term project.",
  "topics": [
    "Engineering",
    "Nuclear Engineering",
    "Radiological Engineering",
    "Health and Medicine",
    "Biomedicine",
    "Medical Imaging",
    "Engineering",
    "Nuclear Engineering",
    "Radiological Engineering",
    "Health and Medicine",
    "Biomedicine",
    "Medical Imaging"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nInterest in Biomedical Research in the Department of Nuclear Science and Engineering\n\nThe Department of Nuclear Science and Engineering (formerly Department of Nuclear Engineering) at MIT has a longstanding tradition of teaching and research in the field of nuclear medicine, that branch of clinical and biomedical studies which involve the uses and effects of nuclear radiations. In the early days, Positron Emission Tomography was a particular interest in the department, later it was Boron Neutron Capture Therapy and Neutron Capture Synovectomy using the MIT Research Reactor and an in-house accelerator. Another area where the Department is very active is Nuclear Magnetic Resonance, including f-MRI for neuro-imaging. The Department offers a Joint Program in Radiological Sciences with the Harvard-MIT Division of Health Science and Technology. Currently three faculty members plus an emeritus professor devote full time to an area which the Department has designated as Bio-Nuclear Science and Engineering. For further information about the Department, please see\nMIT Department of Nuclear Science and Engineering\n.\n\nHistorical Perspective on Freshman Advisor Seminar 22.A09, Career Options in Biomedical Research\n\nThe Freshman Advisor Seminar at MIT is a unique program that connects a small group of freshmen, typically 6 to 8, with an advisor in a weekly seminar arrangement. The Seminar could be on any topic that pertains to research and informal learning experience, for the purpose of introducing the students to aspects of life at MIT beyond the traditional classroom teaching. For further descriptions, see\nFreshman Advising Seminars\n.\n\nThe seminar 22.A09 Career Options in Biomedical Research is led by Sidney Yip, a Professor at MIT, and Bruce Rosen, a Professor at Harvard Medical School and Director of the Martinos Center at MIT and Massachusetts General Hospital, with Xin He, a sophomore in Course 10, as Associate Advisor for 2006-2007. It meets at the same time with 22.013 Undergraduate Seminar in Nuclear Science and Engineering.\n\nFollowing is a description of the seminar:\n\nWe have designed this seminar to give students an understanding of how scientists with medical or scientific degrees conduct research in both hospital and academic settings. There will be interactive discussions with research clinicians and scientists about the career opportunities and research challenges in the biomedical field, which an MIT student might prepare for by obtaining an MD, PhD, or combined degrees. We will hold the seminar in a case presentation format, with topics chosen from the radiological sciences, including current research in magnetic resonance imaging, positron emission tomography and other nuclear imaging techniques, and advances in radiation therapy. With the lectures as background, we will also examine alternative and related options such as biomedical engineering, medical physics, and medical engineering. We'll use as examples and points of comparisons the curriculum paths available through MIT's Department of Nuclear Science and Engineering. In past years we have given very modest assignments such as readings in advance of or after a seminar, and a short term project.\n\nSid Yip has been an MIT faculty member in Nuclear Science and Engineering since 1965, and in Materials Science and Engineering since 2000. He is interested in working with colleagues in and outside of MIT to develop an effective undergraduate program with a biomedical or pre-med orientation. In research he is engaged in the theory and simulation of materials at the molecular level.\n\nBruce Rosen holds both MD and PhD degrees. He is on the faculty of the Harvard Medical School in the Department of Radiology, and director of the Athinoula A. Martinos Center, MIT and Massachusetts General Hospital, Charlestown.\n\n22.A09 Class Projects Through 2004\n\nThe spirit of the Freshman Advisor Seminar is to encourage exploration of various ways a student can learn and grow outside the class room during the first year at the Institute. The small group size and opportunities for personal interactions are designed for free-style exchange with fellow students and mentors of all kinds. 22.A09 meets concurrently with 22.013, an undergraduate seminar on the same topic, which typically draws only a few students. At each class meeting an outside speaker is invited to come and meet with the students in an informal discussion of a topic in biomedical research, along with remarks on career trajectories, using the speaker's own paths as example. The students get to meet two types of speakers, faculty and staff at MIT involved in various programs pertaining to biomedical studies, and MDs and PhDs from the Massachusetts General Hospital with experience in clinical studies and grant-sponsored research. Part of the discussions invariably will touch on the issue of what resources are required in order to carry out a research project. The students are made aware of the fact that every research study will have to funded, thus someone would have to write a proposal. The question of what does it take to write a successful proposal is one that is frequently asked, discussed, and answered in various ways.\n\nPrior to this year, the class project is a proposal which each student presents on the last day of class. While the topic of proposal is left up to the student, each proposal must have the same basic parts - Introduction, Statement of Proposed Study, Approach to be Taken, Results Expected, Personnel, Budget. In writing such a proposal the student gains appreciation of what is involved in a research study, from conception to implementation to conclusion. The student also learns that proposal writing (and later evaluation) will always be a part of the professional life of a research scientist.\n\nInstructor's Perspective\n\nSidney Yip (Seminar Advisor)\n\nThis is not so much a biographical sketch as a few words about one of the two Seminar Leaders of 22.A09 and 22.013. This is how I see the value of the seminars and why I am still excited about working with the students.\n\nAfter forty years (last June) of being on the faculty at the Institute I find that the current events at this place are as refreshing as ever. MIT remains a terrifically exciting and very privileged place for anyone. There is an amazing list of possibilities and opportunities for personal growth and fulfillment at all levels. In such a dynamic environment, it is important to understand the context in which events are continually evolving. To say that MIT is in transition implies that in some particular aspects things are about to change very quickly, or some major decisions are being made very shortly. What happened in 2005 was that the new President announced that MIT will undertake a major new Institute-wide initiative on energy. MIT will do so by forming an Energy Council to lead the planning for this initiative, which is intended to foster new research in science and technology aimed at increasing the energy supply and bringing scientists, engineers, and social scientists together to envision the best energy policies for the future. Notice that prior to this focus on energy and the environment, for several years the major thrust at MIT has been neuroscience. Since MIT, understandably, will never stand still, for anyone to thrive in this place the ability to assess, decide, and act is as important as ever. In this respect, the seminar is an exercise in sharpening this ability. To anyone who is listening, I say, don't wait to be empowered (or told what to do), be a stake holder at MIT on your own, the sooner the better. Once you realize that the power to envision and to achieve lies with you, doors will open for you to walk through. Enjoy the moments and the actions while you are at it, years from now I hope you will look back (as I see myself doing) and take pride in knowing that you didn't hold anything back.\n\nBruce Rosen (Seminar Advisor)\n\nAs the \"junior partner\" to Professor Yip in organizing our Freshman Seminar, it has been a great source of fun to participate in these groups for many years. Coming from a hospital-based research laboratory, I get to focus my work on things that are often close to, if not already part of, the clinical care of patients. The upside of this is that I get to think about and work on ideas that might really make a difference in the lives of people. Sometimes this even happens - just the other day I learned that the imaging tools that some of our MIT students have worked on have just demonstrated that a new treatment for brain tumors might be the first to actually reverse the growth of the most deadly kind of these cancers, which has never been seen before. The downside is that by focusing on new ideas that are ready to be specifically applied to today's problems, you can lose sight of how more basic research concepts can be pursued for their own sake. Of course, such research may never have \"real world\" applications; but on the other hand, this kind of work is exactly what leads to entirely new fields that haven't been previously envisioned.\n\nStaying connected with MIT has become my best way to keep these opportunities in view. The fact that freshman are just beginning their educational journey means that they have the fewest prejudices on what others may think is possible or practical, and getting a sense for what they are attracted to in the way of research questions and opportunities is an exciting and interesting way to keep my own ideas from getting too ossified (or, more colloquially, me from becoming too bone-headed!) Hearing new questions and new concepts from the smartest students on the planet is also just plain fun.\n\nAt the other extreme, working with a veteran scholar like Professor Yip continues to be a \"grounding\" experience. Mentoring is something that is critical for new students - it's just as critical for you at other stages of your career. Finding good mentors can be the most important part of your educational experience, and Professor Yip has been one of my most important mentors for many years. Professor Yip continues to amaze me with his wisdom, and his life and career lessons are just as important for me as I suspect they are for the freshmen in our seminar. He is an extraordinary role model for keeping excitement and energy directed at new opportunities and challenges, and for understanding how to build a balanced universe of scholarship, family and friends. Many of the lessons that he has taught to our seminar students have become lessons that I try to keep in mind for my own life, and for me to teach my young children. The freshmen in our seminar are extremely lucky to have had the chance to work with Professor Yip, and I expect that they will appreciate this even more as their careers progress.",
  "files": [
    {
      "category": "Resource",
      "title": "bruck_assefa.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/257d89bf0d298c20c7eaeaca68e5913e_bruck_assefa.pdf",
      "content": "Bruck Assefa, Class of '09\nMy name is Bruck Assefa and I am a freshman at MIT. I was born and raised in Ethiopia.\nWhen I was a child, my father brought up a unique way of celebrating my and my\nsiblings' birthdays. After the usual ceremony of cutting the cake and singing 'happy\nbirthday', he would ask all the children in the house what they wanted to be in the future.\nLooking at the video recordings of those days, it strikes me to notice that most children\nsaid they wanted to be a doctor, engineer, or a pilot. They thought those three were the\nonly respected professions worth pursuing. It was interesting for me to examine why that\nwas the case. After a lot of thought, I came to the realization that we were not exposed to\nother career options. No one ever thought about becoming a nuclear engineer or a rocket\nscientist because we simply did not hear about them.\nI remember saying I wanted to be a scientist when I was a child - I was fortunate enough\nto hear of the profession from my father. What kind of scientist? I did not have the\nslightest idea. The truth of the matter was that I just wanted to be different. I had no idea\nwhat scientists did or how much they were paid. For me, it was all about proving myself\ndifferent, going places where no one else ever went, and aspiring to do things no one ever\ndid.\nOn the course of my middle school life, I found myself interested in mathematics and\nphysics. My interest in them, however, was not really an attractive force to the field of\nengineering. It was rather a driving force away from the areas of the social sciences. With\nthat line of argument, I entered tenth grade still believing that my career would have\nnothing to do with the social sciences.\nIt was then when I was introduced to International Relations. I had previous Model\nUnited Nations experience in ninth grade but it was the first time that I was taking it as a\nregular subject in a classroom. I found out that the range of subjects the UN delegates\ndiscuss, the rules and regulations that guide the General Assembly, the intricacies of\npolitics and economics that influence decision-making were all astonishing to me. I\nbegan to reconsider my stance on this particular area of social science, which now proved\nas a possible career path for me to follow.\nHaving been accepted to MIT, I can say there is little possibility of me studying\nInternational Relations in the next four years simply because it is not offered at an\nundergraduate level. However, MIT is a place where one's aspiration to explore is never\ncontained. My exploration of MIT began with the course Careers in Biomedical\nResearch. I should say the course gave me a clear insight into what professionals in\nbiomedical research do and how they came to be where they are now. I came to be\nacquainted with research centers such as the Massachusetts General Hospital, Martinos\nCenter, HST and others. Above all, however, I came to see renowned researchers come to\nthe class and talk about the areas of research they are engaged with. I strongly believe\nthat it was a rewarding experience.\n\nAt the end of the day, however, one might want to know if I am considering pursuing a\ncareer in biomedical research. In all truth, it is too early to tell. I will make sure that I\ncan consider all the numerous career paths that are available in the 'real' world. The fact\nthat I missed out on this unique opportunity when I was a child makes me want to keep\nmy options alive as long as possible; and God willing, that is what I intend to do!\nconsider all the options before I make my decision. I am glad that I am in MIT because I"
    },
    {
      "category": "Resource",
      "title": "cathy_zhang.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/c27619c4a2ae5605f025a721375b0764_cathy_zhang.pdf",
      "content": "Cathy Zhang, Class of '09\nEver since I was little, I have been a thinker, a seeker of knowledge. I was always trying\nto understand this or that, even if it was something that I wasn't required to know. While\nmy fellow kindergarteners learned the alphabet, I was already reading chapter books.\nBefore I reached the age of seven, my parents ordered a children's encyclopedia set\ncalled ChildCraft. Being an ambitious child, I read all of those fourteen volumes from\nfront to back, storing little bits of information in the back of my mind as I went. All that\nknowledge actually did come in handy from time to time, such as freshman year of high\nschool, when I was able to recognize the Fibonacci sequence in math class because I had\nread about it all those many years ago.\nI spent my elementary school years in a small town in Washington State, without ever\nhaving heard of science, but when I started middle school in a bigger city, a newfound\nsubject called 'science' became the love of my life. From the day I was introduced to\nscience, I thought that I preferred chemistry to all other sciences, since it was the main\ntopic of my first year of science and it always made logical sense to me. Even when I\ntook biology in eighth grade, it never occurred to me that I would ever favor it over\nchemistry. At last, when I enrolled in AP Biology in my junior year of high school, I\nbegan to discover my passion for biology and realized that I loved biology more than\nchemistry. After all, I used to tell my friends that I loved chemistry, but also that I\ninvariably found myself reading biology books in my spare time. Now, however, I finally\nunderstood why biology books were more interesting to me--my passions had been in\nthe field of biology all along.\nThis term's \"Career Options in Biomedical Research\" seminar caught my interest\nbecause I was and still am interested in a biology-related career. Having never before\nconsidered or really explored the option of a medical or health-related career, I thought\nthat the seminar would be a good opportunity to do so. As a result of my time as a part of\nthis seminar, I have been able to catch a glimpse of the multitude of opportunities\navailable in biomedical research, and while I'm not sure that it's the field I want to spend\nthe rest of my life in, I'm not going to count it out completely. Using this seminar as a\nlaunching pad into the diverse options offered in the MIT community, I plan to continue\nto explore the various bio-related careers out there, and in time, find my true calling."
    },
    {
      "category": "Resource",
      "title": "daon_ha.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/632fe59a4290c60b47d64132c715182e_daon_ha.pdf",
      "content": "Daon Ha, Class of '09\nWhen I was applying to MIT, biomedical research was not exactly what I had on mind as\nmy career goal, even though I had an interest in it. I thought I would major in\nArchitecture because I had always loved practicing visual arts. However, I found the\narchitecture workshop I did over the summer after high school graduation to be\nuninteresting, and it seriously questioned me if architecture is truly the career I wanted to\npursue the rest of my life. So when I was to sign up for a freshman seminar, I chose\nCareers in Biomedical Research to see if I could find a new interest in an area other than\narchitecture. I chose specifically this seminar because I have always been fascinated by\nmy high school biology class and the study of all life forms in general. Although I had an\ninterest in biomedical field, I realized that I had not very much exposure to it because I\ndidn't have an extraordinary experience such as working in a research lab. I would say I\nknew no more than what an average student would know about biomedical research by\nthe time they are fresh out of high school.\nAs I am currently exploring many options for my major, this seminar has helped me to\nrealize that I have a stronger interest in medical research than what I had thought I had\nbefore. Although I had hard time understanding parts of presentation due to my lack of\nknowledge in the technical subject, it did not prevent me from recognizing the passion of\nthe researches toward their work in every presentation. What was also interesting to learn\nabout was that almost none of the speakers knew what they were going to be when they\nwere college freshmen like me. In fact, many of them did not know until they had done\nmore study. Many had redirected their career path as opportunities came up, in the similar\nway I am trying to choose my major among so many opportunities here at MIT. The\nrecurring advice from the speakers to us was \"leave the doors open,\" \"be ready for a\nchange when another interest comes up,\" and even \"live without plan.\" I learned from\ntheir advice that what I can do now is to explore as much as I can and find where my\nheart lies, and then I will be able to pursue it with passion like I saw the speakers did,\nwhile being ready for changes at any time."
    },
    {
      "category": "Resource",
      "title": "justin_tan.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/4fc1bfa7fa093b7de8dcab5c128fbacf_justin_tan.pdf",
      "content": "Justin Tan, Class of '09\nOne line struck me when I researched the Massachusetts Institute of Technology as a\nprospective school to attend for college: \"Sleep, work, social life: at MIT, you can only\nchoose two of the three\". Naturally, it was too unbelievable to warrant any serious\nvalidity. However, it wasn't the first time I had heard it. Thus, following Mark Twain's\nsuggestion, I threw off my bowlines and sailed away from the safe harbor, casting myself\naway from my beloved Canadian hometown of Montreal and into the fast-paced\nAmerican culture. I could have stayed in a familiar environment with my friends and\nfamily. I could have attended the local university where my parents worked. I could have\ncontinued doing research with a group of scientists willing to let me pursue my own\ninterests. But I decided to experience something new, challenging, and potentially\nirrational. So far, my choice has made all the difference in who I have become.\nMy first semester at this institution has taught me so many different aspects of living and\nlearning. All my life I have pursued the most difficult of challenges by enrolling in the\ntoughest courses, attending the most competitive schools, and competing for the highest\nhonors. Once I arrived at MIT, however, I knew I would be required to make\nchoices...and sacrifices. I started the year off ambitious, enrolling in the most difficult\nclass in each of the subjects I was pursuing. Furthermore, I committed to an intense\nundergraduate research opportunity and decided to take up varsity pistol. The result:\nendless days and sleepless nights. I have since learned to focus on what means the most\nto me, on what truly sparks my interest.\nThe most difficult aspect of MIT has been neither the competition nor the pressure. It has\nbeen the choices. Never before have I been presented with such an immense repertoire of\nopportunities. Since I arrived, there have been innumerable opportunities in all aspects of\ncollege life. It was horrible narrowing the field down, and as apparent by my schedule, I\nobviously need more practice. Even concerning potential majors, I was originally set on\npursuing some sort of engineering. However, now that I have arrived, my interests\ntranscend many different fields, from management to brain and cognitive sciences,\neconomics to biological engineering. It seems overwhelming, but I must admit that the\nstudents at MIT are more than adequate inspiration and support. Unlike most other\ninstitutions, MIT's philosophy of undisclosed rankings among students fosters a\ncooperative environment. It is hard work, but I would not trade my experiences at this\nschool for anything...period."
    },
    {
      "category": "Resource",
      "title": "minwah_leung.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/82d1a46a1e268a66fbe8dc4f5c5ef003_minwah_leung.pdf",
      "content": "Minwah Leung, Class of '07\nEver since I was a young girl, I was inspired by the work of doctors. They have to piece\ntogether all their knowledge and experience to treat patients' illnesses. If they can't cure\nthe pain, they at least have to make the best of the situation. At the same time, they have\nto deal with the emotions of patients and their loved ones. Becoming a doctor became my\nvision and goal in life at a young age.\nDuring my junior year in high school, I discovered my love for solving problems in\nphysics class. I worked on physics problems from the textbook until I finally reached the\nanswers; whether the process took five minutes or five hours didn't matter to me. I\nwanted to find answers, and when I finally finished, I couldn't stop smiling to myself. My\nlove for solving problems was further driven by my research project for the Intel Science\nTalent Search Competition. My mentor for the project inspired me to be involved in\nresearch. He brought me to dog surgeries where they tested the newest bone implants and\nprovided me with a chance to observe on the sidelines while he guided medical students\nto dissect a human shoulder. I also accompanied him to experiments of a knee device at a\nlocal university.\nThrough my freshman year in college, as I took all the general requirements, I held on to\nmy goal to study medicine. Whenever I was asked about my interests, I replied almost\nrobotically that I wanted to study medicine. As the time came to decide a major, I wanted\nto find a major that combined medicine and engineering. I was first attracted to the\nNuclear Engineering Department by the diversity of the undergraduate curriculum, as\nmany of the required classes are in other departments. However, I ultimately joined the\ndepartment because I heard that nuclear engineering was the new direction of medicine. I\nheard from friends who were doctors and recruiters for nuclear engineering that imaging\ntechniques and radiation therapy were the most rapidly developing areas of medicine.\nAfter taking a semester full of basic introductory nuclear classes, I realized I had been in\ncollege for over a year but had not done anything related to medicine; I hadn't even taken\nIntroductory Biology yet. I used the next semester to explore whether I was genuinely\ninterested in biology by taking a biological engineering laboratory class. I enjoyed the\nclass because there was a level of suspense connected to the fact that our experiments\nwere cutting-edge. I trembled with nervous energy when I handled microassays that were\nclose to a thousand dollars each. I appreciated that MIT is one of the rare places, if not\nthe only place, where such opportunities to use advanced techniques are available to\nstudents. Yet, I was also overwhelmed by the amount of work I had to do. The laboratory\nwork required immense preparation. My attention span was too short to focus on four to\nfive hours of meticulous pipetting and laboratory procedures. In addition, if I overlooked\na step, the results would be almost meaningless. Looking around the classroom, I knew\nthere were other students who had more passion in doing these experiments than I did.\nThey had a grand vision of what their experiment would bring while I followed protocol\nwith only a shallow understanding of the significance of my results.\n\nAfter I took the biological engineering lab, I started to question whether I was interested\nin biology because I had also disliked Introductory Biology. I only told myself I was\ninterested in the subject because I wanted to be a doctor. Reality was telling me\notherwise. I was also discouraged because I had applied to several summer internships\nrelating to medical applications of engineering throughout my sophomore year, but had\nbeen rejected by all of them.\nI started junior year unclear of what I would be studying in my required nuclear classes.\nOn the first day of class, my professor told us he was going to teach us about reactors. I\nwas surprised that I was a junior in the department and I had no idea how a reactor\nworked. Although the problem sets were frustrating and the material was more theoretical\nthan I would have liked, I soon realized that the inner workings of a reactor stimulated\nmy interest. This was an area of knowledge that I didn't know about; it was as if I wanted\nto solve and find answers to this mysterious subject. Consequently, I changed my\nattention from medical applications to reactor science.\nMaybe by delving deeper into reactor science, I will find my way back to biomedical\nengineering. Perhaps once I have satisfied myself with understanding of reactor science, I\nwill return to my goal of medical school. Most importantly, I realized if you've lost\ncuriosity for the subject you have been pursuing, you should temporarily turn your\nattention elsewhere to another subject of interest. There is always a chance to return to\nyour previous subject if you discover you genuinely enjoyed the previous interest more.\nThis way you'll always be learning because of your drive for curiosity rather than forcing\nyourself to learn material."
    },
    {
      "category": "Resource",
      "title": "monica_crespo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/1f7de5c8ddbc8cee7fc9778f3f5a8a92_monica_crespo.pdf",
      "content": "Monica Crespo, Class of '09\nThinking about the future is as exciting an adventure as writing a story. I can, as the\nauthor of a novel, write whatever ending I desire and make the path for getting there as\ninteresting as I want. I might not be able to tell what will happen around me, but I can say\nwhat I plan to do.\nAlthough most kids think they have the whole novel already figured out, as they grow\nolder and wiser, they realize that far from having a complete piece written, they only had\na few scribbled papers. If you had asked me ten years ago I probably had a \"very clear\"\nidea of how things would be in the future. What I didn't realize was that in order to make\na decision, you need to know the choices. My ignorance and lack of information was the\nreason I thought I was so sure of how things would turn out.\nAs the years passed, I got involved in various activities in school and started discovering\nwhere my passion laid. In my attempt to try out different things, I ended up participating\nin Oratory, Science Fair, Math Competitions, and community service, between other\nactivities. High school was a great time for me to explore everything that interested me. I\ndefinitely took advantage of all the opportunities I could find and explored the\npossibilities. One of the most enriching experiences was the MITE2S summer program. I\nspent an entire summer at MIT, where I took Calculus, Chemistry, Physics and\nHumanities classes. Those six and a half weeks helped me see that going away for\ncollege was a possibility.\nAll these great experiences I had during High School led me to college. I am now a\nfreshman at MIT, a place that offers me a great variety of fields to choose from, giving\nme the option of finding my passion and following it. As part of my Freshman\nexperience, I took the seminar Career Options in Biomedical Research, where I had the\nchance of meeting with professionals in the biomedical field and listening to their current\nresearch experience, as well as hearing about the academic journey that lead them there.\nToday, after finishing my first semester in college, I don't have an answer to all the\ninterrogatives that come up regarding my future. I don't know exactly which career path\nI'm going to follow and whether or not biological engineering is the major I will choose,\nbut I have very useful information will help me when the time comes. I have also learned\nthat having some goals is not a binding contract one makes with oneself, but rather a map\nor idea of what seems right at some moment in time. Goals are not meant to limit us;\ninstead, they are the inspiration and guidance that we need in order to achieve.\nI know that many things might change as years pass, but my values and biggest\naspirations will not experience significant variations. My focus, determination, and\nperseverance will continue being key in my life, and will help me acquire the skills\nnecessary to face the circumstances each day brings. As for now, I'm taking each day at\ntime, writing each page without trying to skip a chapter. This will be an interesting\njourney!"
    },
    {
      "category": "Resource",
      "title": "perspective.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/be58093c3867b05f32ff6cbd771ddf90_perspective.pdf",
      "content": "Students of seminar 22.A09 at the Massachusetts Institute of T\nPersp\n.\ne\nA\nc\nti\nechnology prve\nesent a\na wide array of biomedical careers and how to get there.\nAn annual newsletter\nIssue #2 - Fall 2006\nModel Perspective:\nDr. Bruce Rosen\nThe director of the\nAthinoula A. Martinos\nCenter for Biomedical\nImaging at M.G.H.\nillustrates an\ninteresting approach to\na career in biomedical\nresearch.\nPage 4\n\nDr. Denise Hinton, Ph.D.\nDr. Hinton shows the\nstudents of 22.A09 that\nwhen it comes to\nbiomedical research, it's\nall about the Teslas.\nMRI is one of the most\namazing technologies to\nbe ever harnessed by\nscience.\nPage 9\nField Trip:\nIt's Reactor Time!\n22.A09 tour M.I.T.'s\nnuclear reactor to see\njust how they would\nreact.\nPage 9\nModel Perspective:\nProf. Sidney Yip\nIf you think Professor\nYip's infinite wisdom\nand uncanny ability to\ncultivate questions is\nimpressive, wait until\nyou read about what he\nis researching. Find out\non...\nPage 10\nAcupuncture and\nScience\nVitaly Napadow\ndemonstrates the\nfascinating link between\nalternative medicine\nand scientific research.\nStudents experience the\nscience of acupuncture\nfirst hand.\nPage 11\nScience at M.I.T.\nB Y A N N A L A B N O, '07\nWhat is Biological Engineering?\nBiological engineering is a new and rapidly\ndeveloping discipline that attempts to fuse engi-\nneering with biology in order to harness the power\nof molecular life sciences. The goal of this engineer-\ning discipline is to advance fundamental under-\nstanding of operation of biological systems, and to\ndevelop effective biologically-based technologies for\napplications across a wide spectrum of societal\nneeds including breakthroughs in diagnosis, treat-\nment, and prevention of disease, in design of novel\nmaterials, devices, and processes, and in enhancing\nenvironmental health. Perhaps due to its freshness,\nbiological engineering is not a well-defined field,\nbut it encompasses many aspects of mimicking,\nmodifying and controlling biological systems. In\norder to learn more about this fascinating field and\ncareer options within it, we have decided to learn\nfrom people who participated in its creation. During\nthe 22.013 seminar series we had a pleasure of meet-\ning with Dr. Denice Yeates, Dr. Fred Bowman, Prof.\nBewin Engleward, Dr. Jerry Ackerman, Maria An-\ngela Franceschini, and Prof. A. Kadak, and discuss-\ning under guidance of Prof. Sidney Yep and Prof.\nBruce Rosen the various aspects of biological re-\nsearch, possible career options, research trends, and\nlife at and after MIT. To gain an impression on state-\nof-the-art research facilities, we have toured the MIT\nNuclear Reactor and the Martinos Center.\nWhat sort of research is done in\nBiological Engineer at MIT?\nBiological engineering customarily encompasses\nmany sub-fields of research, many of which were\npioneered at MIT. The Institute is home to the Cen-\nter for Systems Biology and Bioinformatics where\nscientists are striving to understand the dynamics\nand stochasticity of biological networks as well as\nadvance mathematical and computational modeling\nof networks, complex systems and proteins, and to\naid discovery of molecular therapeutics (E. Alm, A.\nChakraborty, C. Burge, F. Dewey, R. Kamm, D. Lauf-\nfenburger, R. Sasisekharan, P. Sorger, S. Suresh, B.\nThilly, B. Tidor, L. Samson, S. Tannenbaum, D. Wit-\ntrup). A large portion of biological research at MIT\nfocuses on biological and physiological transport\nphenomena where mechanical, electrical and other\nproperties of cells are being studied (F. Dewey, A.\nGrodzinsky, R. Kamm, B. Langer) or new methods\ndeveloped, such as biological imaging and func-\ntional measurements (P. Dedon, F. Dewey, B. Engel-\nward, M. Lang, S. Manalis, P. Matsudaira, P. So,\nP.Sorger, J. Han). Many aspects of biomaterials and\nespecially cell and tissue engineering are being stud-\nied in order to extend this understanding towards\nengineering applications (A. Belcher, L. Griffith, D.\nIrvine, B. Langer, I. Yannas, F. Dewey, B. Engelward,\nA. Grodzinsky, R. Kamm, D. Lauffenburger, H.\nLodish, L. Samson, R. Sasisekharan, J. Sherley).\nOther groups focus on human diseases and study\ngeneric toxicology, infectious diseases, pathogens,\nmolecular epidemiology and dosimetry (P. Dedon,\nB. Engelward, J. Essigmann, L. Samson, B. Thilly, G.\nWogan, A. Chakraborty, J. Fox, L. Griffith, D. Irvine,\nD. Lauffenburger, D. Schauer, D. Wittrup, James\nSherley). New fields such as synthetic biology (E.\nAlm, A. Belcher, D, Endy, B. Engelward, K. Hamad-\nSchifferli ) and Nano-scale Engineering of Biological\nSystems (A. Belcher, K. Hamad-Schifferli, J. Han, D.\nJ. Irvine, M. J. Lang, S. Manalis, S. Suresh) are devel-\noped and promoted at MIT, and are promising new\ndirections which bioengineering might take.\nSo, how do I become Biological\nEngineer at MIT?\nMIT offers many options of studying biological\nengineering and securing bright future as a bioengi-\nneer. The exact choice would depend on your per-\nsonal interests and goals. Here are some examples of\nroutes that you might take.\n(Continued on Page 2)\n22.A09 - Career Options for Biomedical Research\nCourtesy of Bevin Engelward. Used with permission.\n\nT\nH\nE\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nBiomedical Career Paths at M.I.T.\nDestiny is not a matter of chance. It is a matter of choice: it is not to be waited\nfor, it is a thing to be achieved.\n-- William Jennings Bryan\nPath 1:\nMajor in Biological Engineering (Course 20).\nAlthough Course 20 was formally established in\n1998 as a new MIT departmental academic unit,\nwith the mission of defining and establishing a new\ndiscipline fusing molecular life sciences with engi-\nneering, it was the Class of 2008 that would provide\nthe first graduates with a Science Bachelor (SB) de-\ngree in Biological Engineering. The department still\nhas limited enrollment, and thus ones wishing to\nfollow that path need to discuss it with their aca-\ndemic advisors and Linda Griffth, the Head of Bio-\nlogical Engineering Department, to secure them-\nselves a place. Biological engineering at MIT is deal-\ning mostly with understanding the basic principles\nof operation of biological systems and applying\nthem to modify those systems or even create new\nones. Unlike many other universities, it is not fo-\ncused on applying engineering to medicine. To re-\nflect the emphasis on integrating molecular and\ncellular biosciences with a quantitative, systems-\noriented engineering analysis and synthesis ap-\nproach, Biological Engineering has created a pro-\ngram unique on national scale. Students take basic\nscience classes, out of which the required ones are\n5.07, 5.12, 18.03 or 3.016 and 7.06 alongside more\nspecialized classes such as 22.110, 6.00, 20.310,\n20.320, 20.330 which survey the most important\nareas of molecular bioengineering. Additionally,\ncore training includes fundamental laboratory\nclasses 22.109, 20.309 and capstone designing project\n20.380. Example roadmaps are available at the de-\npartmental website. Besides the aforementioned\ncore classes, you are free to take any of the many\nclasses offered by the department or, depending on\nyour interest, in other departments such as chemis-\ntry, chemical engineering, mechanical engineering,\nphysics, biology and mathematics. For example, if\nyou were passionate about Cell and Tissue Engi-\nneering, you would want to ensure that you start\nlearning about Materials for Biomedical Applica-\ntions (20.340J), Biomaterials-Tissue Interactions\n(20.441) and specifically about tissue engineering\nand its applications (20.360). On the other hand, if\nyou envision your future as a system biologists you\nwould want to make sure that you possess enough\nmathematical and computational sophistication\nnecessary to tackle complex problems of systems\nbiology, and take more classes in mathematics de-\npartment, for example 18.303, 18.086, 18.06, 18.330\nand perhaps 7.36 or BE.420.\nPath 2:\nMajor in Chemical-Biological Engineering\n(10B).\nFor those of you who prefer a more classical ap-\nproach to biological engineering with a well estab-\nlished MIT department, the Chemical-Biological\nEngineering would be a great option (ask Xin, she\nknows). This course has been developed for stu-\ndents who want to focus on biological applications\nof chemical engineering. Course XB provides strong\nfoundation in chemical engineering but also re-\nquires additional biology courses in place of 5.310\nand 10.32. In addition, the laboratory and design\nelements feature biological topics and processes.\nAlthough the core curriculum of course X is very\nstructured, there are many options within restricted\nand unrestricted electives to explore your interests.\nCourse X is also very careful about scheduling its\nclasses so that there are no major scheduling con-\nflicts with either Biology or Biological Engineering.\nPath 3:\nMajor in Mechanical Engineering (Bioengi\nneering and Biomedical Engineering 2A-1).\nDepartment of Mechanical Engineering offers an\ninteresting option for those who are interested in\nstrong engineering background and want to have\nflexibility in exploring biological options. The pro-\ngram allows students to tailor curriculum to their\nown needs, starting from a solid mechanical engi-\nneering base and combining a rigorous grounding\nin core mechanical engineering subjects with an\nindividualized course of study that the you can\ndesigns with the help and approval of the faculty\nadvisor (for example, Prof. Linda Griffith). This\noption is quite popular among course II-A students.\nIn 2005, 35% of students chose this track. If you\ndecide to pursue this option, you must take 7.01\nduring your freshmen year, as it will conflict with\nmost of your sophomore classes. At the beginning,\nyou will also be required to take a variety of funda-\nMassachusetts Institute of Technology - Fall 2006\n\nmental mechanical engineering classes, such as\n2.001, 2.003J, 2.005, 2.009, 2.670, 2.671, 18.03 and the\nsome second level core courses such as 2.002, 2.004,\nand 2.006. Subsequently, you can develop your biol\nogy emphasis by taking any combination of bioen-\ngineering classes from course II, such as biomechan\nics (2.183, 3.052, 2.385J), biomaterials (2.79J) and\nbiological instrumentation or design of medical\ndevices (2.673, 2.782J), quantitative physiology\n(2.791J) or from biology or chemistry departments,\nsuch as 5.12 or 7.05. Course II offers also a unique\noption of studying medical engineering at MIT. In\nthis case core classes that you will be required to\ntake span a broad range of topics starting from de-\nsign and manufacturing (2.007 ), to mechanical de-\nsign (2.72) to biomechanics (2.183). Afterwards, you\nare free to take more specialized classes such as\nDesign of Feedback Control Systems (2.14) or spe-\ncifically Design of Medical Devices (2.782J).\n-\nn\n-\n\nPath 4:\nEECS with Biology.\nMany revolutionary discoveries in bioengineering\nwere possible only due to extensive use of computer\ntechnology, and nowadays computer techniques\nplay an important role in bioengineering and be-\ncome a separate field known as computational biol-\nogy. If that is one of your interests, your best option\ncould be majoring in course 6 with biological em-\nphasis. Additionally, if you are not yet certain about\nyour future career path, a major in course 6 will\nrelieve you from the headache of finding an interest-\ning job regardless of your choice of future field.\nThere are two main areas of specialization within\ncourse VI. The first one is engineering with a eiving\nsystems component, which focuses on engineering\nproblems which contain a living system component\nsuch as biomedical electronics and transducers;\nimage and speech processing; computerized tomo-\ngraphy; sensory aids for the deaf and blind; auto-\nmatic speech recognition, speech synthesis.The sec-\nond area is more focused on living systems them-\nseves and understanding of them. Examples in-\nclude: auditory physiology and psychophysics,\nhuman speech communication, the transmission\nand coding of signals in the nervous system; elec-\ntromechanical properties of biological cells, tissues\nand membranes; optical properties of tissues; inter-\naction of high-energy particles, laser radiation and\nultrasound with living matter; methods for optical\nbiopsy and detection of pathology; ophthalmic im-\naging; endoscopic optical coherence tomographic\nimaging. Some great classes in those areas include\nControl and Signal Processing (6.011), Quantitative\nPhysiology: Cells and Tissue (6.021J, also a CI-M),\nPsychoacoustics (6.182), Sensation and Perception\n(9.35) or even as specialized fields as Psycholinguis-\ntics (9.59J). Before you take a class, consult the Un-\nderground Course VI guide - publication of Eta\nKappa Nu Fraternity. It contains unofficial rankings\nof professors, students opinions and many other\nuseful tips and hints.\nPath 5:\nNon-standard Applied Sciences Options.\nExcept of the above routes, there are many non-\nstandard ways to satisfy interests in biological engi-\nneering. For example, you could add a second major\nor a minor in biology or a minor biological engineer-\ning on the top of a degree in a more classical engi-\nneering or science discipline, for example mathe-\nmatics or physics. Although doing it the other way\nround is also possible, you would have to be careful\nas my personal experiences show that it is easier to\nteach yourself biology and lab techniques than to\nmaster computational techniques or understand\ndifferential equations by yourself. If you do it this\nway, you will enjoy the possibility to plan your\ndegree by yourself (ideally, with your advisor) and\ntake the classes that interest you rather than those\nthat satisfy a departmental requirement. Further-\nmore, if you plan your degree well you can equip\nyourself with a set of skills perfectly matching the\nneeds of your future employer or graduate school.\nHowever, if you will choose to do so be prepared for\nscheduling difficulties (departments frequently\nschedule their core requirements at the same time),\ntroubles with professors not really prepared for the\ninterdisciplinary study (be careful about presenting\nan amazing piece of coding as you biology project if\nyou cannot pinpoint the biological meaning of its\nresults), and planning, because no one might be\nthere to tell you which classes are important and in\nthat order you should take them.\nBut whatever your do, always consider...\nResearch Experience\nTry to get some research or industry experience. It\nmight be embarrassing and painful at the\nbeginning--mine was--but it will pay off later. For\ngraduate schools and many companies, the experi-\nence you get actually trying to solve questions that\nno one has answer to, working in the lab, going\nthrough its highs and lows, or having to give a pres-\nentation to a room of skeptics is likely to be at least\nas important as your GPA. You might even become\na specialist in your field, or the only person in the\nworld who knows why certain processes behave the\nway they do.\nThe most common way of getting research experi-\nence is through the UROP program, which posts its\nofferings at web.mit.edu/urop. Additionally, you\ncan simply e-mail the professors who do interesting\nresearch and express your enthusiasm and fascina-\ntion with their research. Other ways of finding a\ngood place for research work include networking\nwith friends, or talking to your academic advisors.\nFinally, the alumni networks and organized gov-\nernmental programs have their own offerings,\nwhich, however, are rarely on-campus and might\nrequire travel during the summer semester or IAP.\nDon't be discouraged if you accumulate only rejec-\ntions through your freshmen year. MIT professors\nand graduate students tend to undermine freshmen\nabilities just due to the fact that they are freshmen,\nno matter what experiences and potential you pos-\nses. The good side is that as soon as you become a\nsophomore and get some lab experience (for exam-\nple, through lab classes such as 7.02--take it as soon\nas you can), virtually everyone will be happy to\noffer you a UROP position in their lab. During your\njunior year, in many advanced classes professors\nwill advertise UROP offers in class and companies\nwill have special representatives to collect CVs from\njuniors during career fairs. If you want to combine\nyour research with a funded stay abroad, you\nshould try the excellent MISTI program, which\nhelps in finding placement in companies and re-\nsearch institutions in Germany, France, China, Ja-\npan, Mexico and Spain.\nTake your time choosing classes\nMake sure you know what is actually offered in the\nclass and whether the class fits your learning style.\nSome people like to be able to attend lectures, recita-\ntions and tutorials, and if you are one of those make\nsure that you schedule your classes so that they do\nnot overlap. On the other hand, if you prefer to\nlearn by yourself but would like to be able to ask\nyour professor questions as you read through your\ntextbook, make sure to choose a class taught by an\napproachable one. Some people hate exams, and\nwhile most core classes will not allow avoiding this,\nthere are multiple possibilities to take a project-\nbased class as your electives. Finally, if projects are\nwhat annoys you most and you would rather have\nan hour exam to get over it, there are certain classes\nwhose grading breakdown involves purely ex-\nams--not even problem sets. Everything will be\nexplained in the syllabus, which should provide you\nwith an approximate grade breakdown between\nexams, problem sets and projects, and it is the sylla-\nbus that should guide your choice of classes. You\nknow yourself know how you learning preferences,\nso make use of that--choosing the right classes\nmight improve your GPA dramatically.\nAsk for help\nAs much as it seems untrue, most professors are in\nfact sympathetic creatures that were once in your\nshoes. If you were sick or had any sort of trouble, go\nto your professor or advisor and explain your situa-\ntion. Try to show the way you can catch up after the\nemergency is over. Most professors want you to\nlearn the class material and if you can show them\nthat you can achieve that goal if given an extension,\nyou are likely to be fine. The policies vary from\nacross departments, and also between professors in\nthe same department, and some places are more\n\"relaxed\" than others. The rule of thumb is that the\nmore advanced and technically challenging the\nclass, the more relaxed the professors. Additionally,\nonce you pass the introductory classes, the Mathe-\nmatics department is well known to give extensions\nreaching even the very grade deadline.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\n22.A09 - Career Options for Biomedical Research\n\nPerspective:\nDr. Bruce Rosen, M.D., Ph.D.\nB Y A L I C E C H A N G, '10 &\nT O A N T R A N-P H U, '10\nUpon first seeing Bruce Rosen, a person might never\nknow that he's an M.D., Ph.D. who is currently the\nDirector of the Athinoula A. Martinos Center for\nBiomedical Imaging at Massachusetts General Hos-\npital, MIT, and Harvard Medical School, as well as a\nradiology professor at Harvard.\nDr. Rosen's manner is neither overbearing nor in-\ntimidating as his accomplishments might entitle.\nSmiles come easily, and his down-to-earth personal-\nity and easy way of talking makes you immediately\nthink of the uncle that all the kids like because he's\ncool and speaks to them as if they were on the same\nlevel. And even though he has more things to do\nthan humanly possible on a daily basis, he always\nCourtesy of Harvard-MIT Division of Health\nSciences & Technology. Used with permission\nseems to give his full attention to you, never rushing\nor looking preoccupied.\nSo what's the secret to his success both profession-\nally and in person? How did he get to where he is\ntoday? Curiously enough, Dr. Rosen didn't aspire\nto be a radiologist when he first started out at\nschool. He was passionate about and received an\nA.B. in Astronomy from Harvard University in\n1977. But when told the projected career options\navailable in the field at the time (totaling to nega-\ntive one), he went with the flow and decided to\nchange tracks. Moving on to graduate school across\nthe river at MIT, he received an M.S. in Physics in\n1980. Two years later, he received his M.D. from the\nHahnemann Medical College and Hospital, and\nanother two years after that, returned to MIT and\nreceived his Ph.D. in Physics.\nThe newly titled Dr. Rosen then completed several\nyears of research, eventually ending up at the new\nfledging Martinos Center whose focus was the\nnewly developped NMR machine. His unique\nbackground in Radiology and physics in tandem\nwith his medical degree put Bruce in a unique dis-\nposition to have specialized expertise in the tech-\nnology. Eventually joining their faculty, Dr. Rosen\nrose through the ranks, becoming the director of the\nMartinos Center for Biomedical Imaging where he is\ncurrently serving in that position.\nSo enough about what Dr. Rosen did when he was\nyounger, what revolutionary work is he doing today\nthat gave him such renown and recognition? His\ncurrent research involves the technique develop-\nment and potential application of functional MRI\n(fMRI for short), such as measuring metabolic and\nphysiological changes when the brain is activated.\nHe and his colleagues have already made many\nadvances in measuring blood flow in the brain dur-\ning stimulus. His work also aims to combine MR\nimaging with EEG and MEG recordings, an ambi-\ntious task that is much more complicated than it\nsounds. With that technology, it would be possible\nto view the brain as it functions in real time, open-\ning so many possibilities for the study and direct\n\ntesting of how the brain works and is affected by\ndisease.\nOf course, Dr. Rosen's excellent research hasn't gone\nunnoticed. He was inducted into the MIT chapter of\nthe honorary society of Sigma Xi Scientific Research\nSociety. Already, Dr. Rosen is the recipient of the\nGold Medal for the International Society of Mag-\nnetic Resonance in Medicine and has been named a\nFellow there.\nDespite being the director of a world-renowned\nmedical research facility and a senior lecturer at the\nHST program, Bruce still finds time to help budding\nscientists and talk to interested parties. During our\nrecent visit to the Martinos Center, Bruce took time\nout of his day to give us a tour and talk with us\nafterwards. From the extreme familiarity with\nwhich he talked about the projects it was clear that\nhe knew all the research projects that were being\nconducted. The ease with which he talked stimu-\nlated understanding and comfortability; simply put,\nhe was very easy to talk to. This is one of the very\nimportant qualities that facilitated his current posi-\ntion. Several guest lecturers have mentioned this\naspect of Bruce's success. There are many excellent\nscientists in the world currently. However, scientists\nwith social skills like Dr. Rosen's are those that rise\nto head institutions. That was duly noted by the\nentire group, and was a very memorable message,\none that we gladly took to heart.\nNevertheless Dr. Rosen was a big part of the semi-\nnar, being one of the two leaders. He was the one\nwith most of the connections who invited the\nspeakers to talk. In this way he got to choose most\nof the selection, choosing most of the time from\nMartinos Center faculty. This explains the heavy\nMartinos tilt of many of the speakers and is also\nbecause the focus of the seminar ties very well into\nthe objectives of the Center.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nMassachusetts Institute of Technology - Fall 2006\nModel Perspectives\nVery few men are wise by their own counsel, or learned by their own teaching.\nFor he that was only taught by himself had a fool for his master.\n\n-Ben Johnson\nModel Perspectives\nVery few men are wise by their own counsel, or learned by their own teaching.\nFor he that was only taught by himself had a fool for his master.\n-Ben Johnson\nPhoto courtesy of \"t-dawg.\" Source: http://www.flickr.com/photos/wheatland/536982090/\n.\n\nField Trip:\nAthinoula A. Martinos Center\nfor Biomedical Imaging\nArticle on Athinoula Imaging Center removed\ndue to copyright restrictions.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\n22.A09 - Career Options for Biomedical Research\nCurrent work/presentation\nMaria Franceschini shared with us her work in brain\nphysiology and imaging. Through studying neuro-\nvascular coupling and baseline hemoglobin fluctua-\ntions with data interpreted from imaging, it has\nbeen made possible to learn more about brain\ndevelopment/aging, strokes, and psychiatric syn-\ndromes. FMRI (functional magnetic resonance im-\naging) is a method of taking high-resolution pic-\ntures to map parts of the body by means of a mag-\nnetic field and emission of a specific radio wave-\nlength. DOI (diffuse optical imaging) is a way of\nusing light absorption and reflection to scan changes\nin blood volume and hemoglobin oxygenation.\nWith integration and application of these two tech-\nniques to the brain, specific areas can be identified\nthat are affected by stimulation like thoughts, per-\nception, or movement. Maria has done research in\ncerebral oxygenation in infants as well as in nonin-\nvasive techniques for optical imaging of the brain\nthat measure the effect of stimuli on oxygen concen-\ntration. The eventual hope for imaging technology\nis finding a way to see what we think, although\ncurrently there hasn't been much progress besides\nattempts to pinpoint face recognition and lying.\nMy Personal Commentary\nMaria's presentation on optical imaging was very\nhelpful to myself and my peers. She gave us a basic\noverview of her career path and current work in\nintriguing and unprecedented research taking place\nat the Martinos Center. Another side topic she\ntalked to us about was grant writing, a critical part\nof her career that determines her salary and job. She\nhas a great deal of experience in this process and has\nwritten many, many grant proposals. Each can be as\nlong as 50 pages or more, with half of that just to\nbudget and outline of the plan, and other parts cov-\nering goals, background information, preliminary\nstudies, and similar projects. It can take a lot of\nstrong preceding data to prove that your plan will\nbe useful and is necessary. You can submit grant\nproposals up to three times a year to the National\nInstitute of Health, where a panel of 20-30 people\ndiscuss 100+ grant ideas. Each gets a score before it\nis considered; no more than 10% will be funded.\nIdeas that need revision are provided suggestions\nand can be submitted up to twice more before one\nmust start again from scratch. It's a good idea to sit\non grant panels when possible to understand what\nthe organization is looking for and see how the\nprocess works. The money has to be divided up\nevenly between the different fields of medicine, so\noften the chances of getting the money are purely a\ngamble. Maria's inside scoop on the workings of\ngrants was very helpful information that will\nprobably apply to many of us as we move on to\npursue careers in biomedical research, whether it be\nin medical imaging or other fields.\nPerspective:\nMaria Angela Franceschini, Ph.D.\nB Y T I F FA N Y Y E E, '10\nMaria Angela Franceschini was born and raised in\nItaly to a family with many members working in\nmedicine. She, however, decided to take a different\npath and first attained her doctoral degree in phys-\nics at the University of Florence in Italy. After that,\nshe came to America and worked as a Post-\nDoctorate Research Associate and research physicist\nin the Department of Physics at the University of\nIllinois in Urbana-Champaign for seven years.\nMoving to Boston to be with her husband in 1999,\nshe was a research assistant professor at Tufts in the\nElectrical Engineering and Computer Science De-\npartment for a few years. Soon she realized that\nphysics just wasn't her biggest interest in life, and in\n2000 found a way to incorporate her mechanical\nbackground with studies in medicine by being an\nassistant physicist at the NMR Center in\nCharlestown. She's been working with imaging\nparts of the body ever since. She was also an in-\nstructor for a year at Harvard Medical School and\nnow is an assistant professor there. Currently, as an\nassociate professor, she plans to make a few more\npublications with hopes for a new grant to continue\nher research and may eventually become a full-time\nprofessor.\nMRI machine, similar to that used at MGH. Photo courtesy of NASA.\n\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nMassachusetts Institute of Technology - Fall 2006\nCrossword Answer\n\nPerspective:\nDr. Denise Hinton, Ph.D.\nB Y A L I C E C H A N G, '10\nDenise P. Hinton, PhD., will tell you that it's all\nabout the Tesla.\nClinical magnetic resonance imaging, also known in\nshort as MRI, has changed the medical world for\nearly detection and diagnosis of various diseases.\nWhile MRI has been universally recognized as a tool\nfor studying the brain, enormous progress has also\nbeen made recently in cardiac MRI. Cardiovascular\ndisease and malfunction is the number one killer of\nAmericans today. With cardiac MRI, radiologists\nhave studied various cardiovascular structural ab-\nnormalities such as valvular and congenital dis-\neases.\nTesla are a unit of magnetic induction. The higher\nthe Tesla, the stronger the field strength and ulti-\nmately, the better the picture. Most hospitals' MRI\nmachines operate at 1.5T, the stan-\ndard for field strength used clini-\ncally today.\nBut there are problems that arise\nwith the conventional 1.5 Tesla\nresolution that is clinically avail-\nable. For example, images of the\nbeating heart tend to come out\nblurry due to its movements. In\naddition, though the major trunks\nof the coronary arteries are clear,\nsmaller arteries are invisible in\n1.5T prints. As research explores\nincreasingly complex cardiovas-\ncular issues with MRI such as\nmyocardial perfusion and func-\ntionality, it becomes even more\nessential to have a good picture of what's going on.\nThat's where Denise P. Hinton comes in. Besides\nworking with the MGH/MIT/HMS Athinoula A.\nMartinos Center for Functional and Structural Bio-\nmedical Imaging and Mass General Hospital, Bos-\nton, she is also a radiology instructor at Harvard\nMedical School.\nHinton has been studying cardiac MRI at ultra-high\nfields, primarily at 3.0T. Direct comparisons of im-\nages at 1.5T and 3.0T show significant differences,\nsome of which include better contrast between tis-\nsue and blood and better signal-to-noise ratios\n(SNRs). That means that such measurements as\nvessel diameter can be more accurate, thus improv-\ning the diagnosis of various ailments.\nOne priority is the development of plaques, which\nare an abnormal accumulation of inflammatory\ncells, lipids, and sometimes connective tissue within\nthe walls of arteries. The progression of the disease\nis called atherosclerosis. Plaques are so hard to track\nbecause heart arteries are very small and hidden\ndeep within the chest. Slices as thin as 2 mm and in-\nplane resolution of less than 0.5mm is needed for\nplaque imaging. 3.0T MRI makes plaque detection\nmuch more efficient and can acquire plaque images\nin half the time 1.5T scanning could.\n\nBut optimizing 3.0T scanning isn't as easy\nas it sounds. Hinton remarks that, \"In order to take\nfull advantage of the SNR gain provided by high\n\nmagnetic fields, both hardware\nand software optimization are\ncritical. The higher field tends t\nbe more sensitive, and we have\nto invest more time at the outse\nof a 3T body examination to\nremove field inhomogeneities.\"\nThe necessary technology is\navailable, it simply needs to be\nadjusted and fine tuned. Ra-\ndiofrequency coils needed for\nscanners of high-fields are not\nas broadly ranged as lower-\nfield scanners. In addition, car-\ndiac MRI is not as popular as\nsay, brain MRI. Hinton, who\nworks at the Martinos Center,\no\nt\nacknowledges that the MRI scanners there are pri-\nmarily adjusted for the brain. Coils that are optimal\nfor studying the heart are still being developed and\nit will take time to be more widely available.\nThe ultimate goal would be to make 3.0T scanners\navailable for clinical use. Hinton, along with many\nothers, are sure that the benefits will be well worth\nthe cost.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\n22.A09 - Career Options for Biomedical Research\nIt's all about\nthe Tesla\n22.A09\nSeminar Participants\nI.\nStudents\n- Olga Botvinnik, '10\n- Anna Labno, '07\n- Alice Chang, '10\n- Toan Tran-Phu, '10\n- Troy Rurak, '10\n- Ke Zhang, '10\n- Richard Lin, '09\n- Tiffany Yee, '10\n- Richard Yau, '10\n- David Li, '10\n- Jennifer Chu, '10\nII.\nCoordinators\n- Sidney Yip\n- Bruce Rosen\nIII.\nStudent Coordinator\n- Xin He, '09Diagram showing magnetic field pattern around a coil.\nFigure by MIT OCW.\nCourtesy of NIH.\n\nPerspective:\nDr. Frederick Bowman, Ph.D.\nB Y T R O Y T. R U R A K, '10\nOctober 17th was the day my love came home to\nme. Well, no. Actually, it was the day Dr. Fred\nBowman came to chat. Our advising seminar 22.A09\nentitled \"Career Options for Biomedical Research\"\ntypically hosts a guest speaker on a weekly basis in\norder to promote awareness and to give us a sense\nof what the biomedical field beholds, should we\ndecide to pursue it further with simple curiosity or\nas a potential career. Dr. Fred Bowman, Ph.D.,\nworks in the Division of Health Sciences and Tech-\nnology (HST), the collaborative child of Harvard\nMedical School and the Massachusetts Institute of\nTechnology. \"(HST) is dedicated to integrating\nmedicine, science, and engineering into an educa-\ntional program that carries these disciplines from\nthe laboratory bench to the patient's bedside, and\nconversely, brings clinical insights from the patient's\nbedside to the laboratory bench\" (hst.mit.edu). This\nmotto of \"bench to bedside\" exemplifies their mis-\nsion to integrate technical learning with physical\ninteraction and application to the medical world in\norder to better the understanding of both fields.\nDr. Fred Bowman, a self-proclaimed \"farm boy\"\ngrew up in the heartland of the United States, al-\nways fascinated by the way things worked. When\nthe time came, he ventured on to college: a venture\nnew to the Bowman family. He entered the Pennsyl-\nvania State University hoping to learn about engi-\nneering, but when asked which field of engineering\nmost interested him, Dr. Bowman replied, \"You\nmean there's more than one?\" To keep his future\noptions open, he elected to study mechanical engi-\nneering, the most general of all fields. Along the\nway, a few of his professors and colleagues saw that\nhe was doing good work, and suggested he look\ninto nuclear engineering. He wasn't too sure what it\nwas or why they wanted him to do it, but he figured\nhe'd give it a shot; several years later, he left the\nMIT graduate program with a degree in nuclear\nengineering. Since then, he's spent time on the bio-\nmedical engineering faculty at Northeastern Uni-\nversity* and, during his stay at MIT, has developed\nthe Bowman Perfusion Monitor (BPM) through an\napplication of thermal properties to blood flow.\nThermal diffusion technology can be applied to\naddress and facilitate all sorts of bodily processes\nand procedures such as neurosurgical and cardio-\nvascular monitoring, organ transplantation, and\nreconstructive surgery. Appropriately named, the\nBowman Perfusion Monitor displays historical and\nimmediate information on a patient's blood flow\nand tissue temperature using a diffusion probe that\nconnects to the BPM via an \"umbilical cord.\" \"The...\nprobe, which is a flexible, medical grade catheter, is\ninserted into the target tissue using the appropriate\nsurgical hardware to measure focal temperature and\ntissue perfusion....\" This minimally invasive\nmethod of monitoring perfusion and temperature in\nsmall volumes of tissue has been sought after for\nyears, and will likely play a key role in critical sur-\ngeries and treatments where such information is\nessential for the patients' vitality and well-being.\nDuring his talk, the one thing he emphasized more\nthan any other was the web-like quality of biology,\nmedicine, and engineering, thus stressing the im-\nportance and usefulness of biomedical engineering\nin our ever-changing world. Each field bears a facet\nof the same gem, and without just one of these\nsides, the gem is not whole, and the understanding\nof each is diminished. *Aside from his Chairman\nand CEO positions at Hemedex--the company he\nfounded to manufacture the Bowman Perfusion\nMonitor--Bowman is a lecturer on Radiation On-\ncology at Harvard Medical School and has served\nfor twenty-five years as a faculty member in the\nMechanical and Biomedical Engineering program at\nNortheastern University. Dr. Bowman is the Senior\nAcademic Administrator and UROP Coordinator at\nHST and has served the National Science Founda-\ntion where he plays a prominent role as Program\nDirector for Biomedical Engineering. He has pub-\nlished nearly one hundred fifty articles and ab-\nstracts, many examining his principal research in-\nterests of \"microprocessor-based instrumentation\nfor the quantification of perfusion, thermal proper-\nties and cardiac output, 'bioheat' and mass transfer\nbased problems in clinical research, thermal physics\nof hyperthermia, and thermometry.\"\nDr. Bowman has certainly come a long way\nfrom the farm boy he once was, though in\nmany respects, I'm sure he has been left un-\nchanged. He still shows that innate curiosity\nfor the human body and figuring out \"how\nthings work,\" only now, he has the means and\nthe education necessary to change the way the\nworld thinks and to better the lives of all\nthose who've benefited from his technological\nadvances. I'm sure, as a kid, he'd wonder\nwhat he'd be doing when he got older. Now,\nhe probably asks himself the same question.\nThe door for opportunity has been left open,\nand the people who choose to venture out-\nward will change our world and our knowl-\nedge forever. Dr. Fred Bowman is one of these\npeople.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nMassachusetts Institute of Technology - Fall 2006\nHST\nDivision of Health, Sciences, and Technology...\nEducation beyond M.I.T.\n\nField Trip:\nM.I.T.'s Nuclear Reactor\nB Y D AV I D L I, '10\nIt may seem as if the MIT nuclear reactor would\nbe irrelevant to career options in biomedical\nresearch, but in fact, the MIT nuclear reactor is\nrelevant since the neutrons it produces are used\nfor research, especially medical research. On\nNovember 21, 2006, the students in the Career\nOptions in Biological Research Class went on a\ntour of the MIT nuclear reactor. Before the tour\nmost of the members of our class met in room\n24-105. In this room, Professor Yip explained to\nus the basics of how a nuclear reactor works. A\nnuclear reactor works by a fission reaction of\nUranium-235. Fission is the process in which an\nUranium atom absorbs an external neutron,\nwhich causes it to split into two parts and re-\nlease two or three neutrons. The released neu-\ntrons induce a chain reaction by bombarding the\nsurrounding Uranium atoms. Thermal energy\nis generated each time a Uranium atom is split.\nNormally, this energy is used to convert water\ninto steam, which drives a turbine to produce\nelectrical energy. At the MIT reactor, the excess\nheat generated by fission is carried away via\nheat exchangers to cooling towers. As men-\ntioned before, the neutrons produced at the MIT\nreactor are used only for research.\nAfter Professor Yip's presentation, we headed to\nthe nuclear reactor. The MIT nuclear reactor\nhas been operational since July 1959. The reac-\ntor is located on Vassar Street behind the John-\nson Athletic Center. Inside the reception area\nthere was a counter to our left and sofas to our\nright. Toan and Jennifer had arrived earlier on\ntheir own and were sitting on the sofas. The\nlady behind the counter asked us to sign in. I\nsigned in first and the lady gave me a scintilla-\ntion counter. The scintillation counter was ap-\nproximately one centimeter in diameter and ten\ncentimeters long. I put it in my pocket. This\ncounter was used to measure the amount of\nradiation exposure that I received while touring\nthe reactor. After we finished signing in, we\nwaited in the lounge for a long time.\nAt around 4:30 pm, a guy named Ed Lau came\nand said that he would be our tour guide. Be-\nfore we began, he gave us some background\ninfo on the MIT reactor using a small metal\nmodel of the reactor in the reception area. The\nmodel of the reactor had small Christmas lights\non it at specific components of the reactor. Be-\nneath the model, there were labeled buttons\nthat corresponded to each of the lights; when\none of these buttons was pushed, the corre-\nsponding light would light up.\nThe core of the reactor consists of 27 bars, 24 of\nwhich have fuel elements. Each bar costs\naround $50,000. Each bar has a rhomboid shap\nand consists of fifteen fuel plates. Each fuel\nplate is sandwiched between sides of aluminum\ncladding. The fuel is a uranium-aluminum mix-\nture called cermet. The 27 bars are arranged in\na hexagonal formation. For each hexagonal sid\nthere is a corresponding boron-stainless steel\nshim blade. When all the blades are dropped\ninto the core, the reactor is shut down. The\nreactor can be shut down in less than one sec-\nond. Surrounding the core, there are various\nlayers of material that shield against radiation.\nThere is a layer of water, a layer of lead, a layer\nconcrete, and layers of other things.\nThe reactor is refueled three or four times a\nyear, and each refueling involves either replac-\ning two or three fuel elements or rearranging\nthe fuel elements. A typical fuel element stays\nin place for three years. The reactor is opera-\ntional twenty four hours a day, seven days a\nweek.\nAfter Ed finished telling us the background on\nthe reactor, we began the tour. First, we walke\nlengthwise into a large cylinder, whose dimen-\nsions were approximately three meters in di-\n\ne\n\ne\n\nd\nameter and six meters long. Both sides of the\ncylinder were sealed airtight. Then the side of\nthe cylinder leading into the main reactor\nchamber opened. The main reactor chamber\nwas very bright. The reactor was located in the\ncenter of the room. Ed explained to us that the\nreactor core is kept at a lower pressure com-\npared to the outside chamber so that if an acci-\ndent happens, clean air from the outside will\nflow in and not the other way around. After\nwalking around in the main room for a bit, we\nwent down a flight of stairs and into the control\nroom. The control room was about two meters\nby four meters by two meters and was full of\ndials, lights, and TV screens. There was one\nperson in the control room monitoring the reac-\ntor. After seeing the control room, we went\nback upstairs and walked around the reactor.\nThe most interesting part of this walk was see-\ning one of the medical research rooms which\nhad four inch thick yellow glass. The yellow\ncolor of the glass comes from doping with lead.\nThere are also many other research facilities\nscattered throughout the facility. On the way\nout we tested for radiation using a Geiger\ncounter. Then we signed out and I returned my\nscintillation counter. The actual tour only\nlasted for about 12 minutes.\nPersonally, I enjoyed the reactor tour a lot. I\nhad never visited a nuclear reactor before. I\nwas surprised to learn that the MIT reactor is\nused only for research and is not used to pro-\nduce energy. Our tour guide, Ed Lau, was\nknowledgeable and friendly.\nLinks:\nhttp://web.mit.edu/nrl/www/index.html\nThis is the official website of the MIT nuclear reactor\nlaboratory.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\n22.A09 - Career Options for Biomedical Research\nNuclear Reactor Tour\nNew Text Courtesy of William McGehee. Used with permission.\n\nPerspective:\nProfessor Sidney Yip, Ph.D.\nB Y T O A N T R A N-P H U, '10\nProfessor Sidney Yip holds a special place in all of our\nhearts. To us, he will remain our beloved seminar advi-\nsor. His years of wisdom were soundly encapsulated\ninto advice that he would periodically give. We were\nthus treated to an enlightening and engaging lecture on\nboth snippets of motivational advice and a background\non his current research.\nProfessor Sidney Yip came to the US from Beijing as a\nkid and attended different high schools in the US,\ngraduating from high school in 1953. He then attended\nthe University of Michigan, earning a BS in Mechanical\nEngineering and then a M.S. and Ph.D. in Nuclear En-\ngineering, and after a year as a postdoc and a brief stint\nas a Research Associate at Cornell, was offered a faculty\nposition on the Nuclear Engineering Faculty at MIT.\nEarning his Professor status in 1973, he has since taught\nmany classes and has received a secondary appoint-\nCourtesy of Kavli Institute for Theoretical\nPhysics. Used with permission.\n\nment in the Department of Materials Science and Engi-\nneering.\nCurrently, he teaches several undergraduate and\ngraduate level classes in nuclear physics in topics like\nneutron physics, nuclear and atomic collision phenom-\nena, and statistical processes and atomistic simulations.\nHe has also co-led this very seminar for many years\nnow, focusing on career options in biomedical research,\na departure from his traditional field.\nThis varied background prompted a stimulating and\nvaried talk, which was duly attended by both his semi-\nnar and a guest seminar group, supplemented by abso-\nlutely delicious pizza.\nProfessor Yip's current research deals with computer\nsimulations of atomic interactions. True to Morse's Law,\ncomputational power has been exponentially increas-\ning. This affords ever increasing sheer computational\npower and makes it more readily available and accessi-\nble to many more researchers. Supercomputers are\nbecoming more ubiquitous, allowing just about any\nresearcher to have computing time on these computers.\nThe challenge is therefore to find uses and make the\nbest use of this newfound power. Yip's work is one\nsuch example of computer usage. In order to design\nand understand materials better, we need to figure out\ninteractions between the actual materials and the mole-\ncules therein. We want to be able to predict how mate-\nrials will hold up to different strains and stresses. We\nknow that different materials behave differently under\nvarying conditions, and react according to their state.\nFor example, refractory carbide will cleave at low tem-\nperatures when exposed to a stress, and will begin to\ncavitate when at high temperatures and exposed to a\nstress. This cavity will expand through the material as\nadditional strain is applied, eventually causing a rup-\nture. Similarly, a carbon nanowire will simply break in\nhalf at low temperatures but will break down string by\nstring until separated at high temperatures. This is\nuseful in applications like bridges and other structures\nwhere advanced warning of degradation would be\nbeneficial and could save lives and reduce costs. These\nbehaviors were observed in the lab in carefully con-\ntrolled experiments.\nProfessor Yip managed to predict these behaviors in his\ncomputer simulations with the simplest assumptions\nand behaviors. Using elementary Newtonian mechan-\nics, he modeled many thousands of particle interactions\nand came up with behavior that matched observed\nbehavior. Nanoindentation and stress wave behavior\nwas also seen in some of his models. He also was able\nto explain the physical mechanics of the weakening of\nquartz immersed in water at the molecular level.\nThe second part of the lecture was devoted to dissemi-\nnating tidbits of wisdom accumulated during Yip's\nforty year stay at MIT. His summary of the research life\nat MIT is best put as \"It's not what we know. It's what\nwe don't know.\" A professor can become the absolute\nexpert on a subject matter, but MIT would not be inter-\nested. Knowing a lot about something does not further\nthe human understanding of science. MIT, according to\nYip, is a research institute. A professor needs to be able\nto do competent and relevant research. Teaching is\nsecondary and an added bonus.\nThe beauty of this institution as a school is that it will\nnot teach formulaic responses. Instead, it focuses on\nteaching students how to respond to situations. Unex-\npected obstacles and circumstances will undoubtedly\narrive in one's career, and we are taught to surmount it.\nFour qualities especially will serve us: excellence, perse-\nverance, boldness, and optimism. We should all excel at\nour classes and work, persevere in times of trouble, be\nbold and daring and never hold back, and be optimistic\nand have a bright outlook for the future. We are indeed\n\"way too young to be cautious.\" And how to approach\nlife? Have a mission and stick to it: \"Vision without\nAction is a Dream. Action without Vision is a Night-\nmare.\"\nWe hope Professor Yip continues to continue to impart\nhis wisdom for many more freshman by continuing to\noffer the seminar. We are very grateful for his time and\nenergy in helping us find our roots about us in this\nseminar.\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nMassachusetts Institute of Technology - Fall 2006\nModel Perspective\nnot to stop questioning.\n\n-Albert Einstein\nModel Perspective\nLearn from yesterday, live for today, hope for tomorrow. The important thing is\nnot to stop questioning.\n\n-Albert Einstein\nCourtesy of \"Uncle Jerry in Golden Valley, AZ.\" Used with permission.\nSource: http://www.flickr.com/photos/uncle_jerry/162852753/\n\nPerspective:\nVitaly Napadow, Ph.D., Lic.Ac\nB Y J E N N I F E R C H U, '10\nDr. Vitaly Napadow is currently a neuroscience re-\nsearcher in Massachusetts General Hospital's De-\npartment of Radiology. Yet what is so intriguing and\nunique about his choice in careers is that he is also a\nlicensed acupuncturist. Dr. Napadow combined his\nacupuncturist background and his knowledge of\nbiomedical imaging to enhance his research on the\neffects of acupuncture in the brain. He works as a\nclinical acupuncturist once a week at Brigham and\nWomen's Hospital's Pain Management Center and\nspends the rest of his time investigating the scientific\nevidence behind the effects of acupuncture.\nInterestingly, if you had asked Dr. Napadow as a\ncollege freshman where he saw himself in the future,\nhis reply would be light-years away from anything to\ndo with acupuncture. As a freshman at Cornell Uni-\nversity, Dr. Napadow had his mind set on pursuing a\ncareer in the aeronautics and astronautics engineer-\ning field, with the ultimate goal of becoming an as-\ntronaut. He majored in Mechanical Engineering, as\nthere was no Aeronautic and Astronautics Engineer-\ning major at Cornell, and sought out a summer in-\n.\n\nternship at NASA's Johnson Space Center. Dr. Napa-\ndow described his internship as a fantastic learning\nexperience. But at the same time, it also led him to the\nconclusion that he did not want to work for NASA or\nthe government.\nDr. Napadow saw it as a good thing to have been\ndisappointed early on and realize that he did not\nwant to continue in the aeronautics direction since he\nhad more time to adjust his plans and search for a\nnew interest. Unsure of where to turn next, a girl he\nwas interested in was taking classes in biomechanics,\nso he decided to try it out. As a result, Dr. Napadow\nbecame interested in biomechanics, which integrated\na human element into engineering. He continued\nwith his new interest and did his undergraduate\nresearch projects in biomechanical engineering.\nAfter graduating from Cornell, Dr. Napadow contin-\nued to pursue his interest in biomechanical engineer-\ning, obtaining a Ph.D. through the Harvard-MIT\nHealth Science and Technology program. Yet during\nthat time, he also became interested in acupuncture\nand started as a part-time student at New England\nSchool of Acupuncture. Eastern medicine and acu-\npuncture were 180 degree turns from his engineering\nbackground, and it provided an entirely different\nperspective and interpretation of the biomedical field.\nNonetheless, Dr. Napadow was intrigued by acu-\npuncture and continued as a full-time student,\ngraduating with a Master of Science in Acupuncture.\nThen he was in a dilemma. Dr. Napadow did not\nknow whether to continue with his Ph.D. into re-\nsearch or become a clinical acupuncturist. In 2002, he\nwent to China for an internship in outpatient acu-\npuncture clinics to explore his options as an acupunc-\nturist. In the end, he found his path lying on the line\nbetween the two options. Dr. Napadow became an\nacupuncture researcher, using his MRI imaging back-\nground to study the effects of acupuncture in the\ncentral nervous system, while adding his acupunc-\nturist perspective to the field. He also continued to be\na part-time acupuncturist to maintain the patient-\ncontact aspect of acupuncture. As an acupuncturist,\nDr. Napadow treats his patients with the conviction\nthat acupuncture works, while as a researcher, he\nremains open to the idea that perhaps acupuncture is\njust a very effective placebo effect.\nAcupuncture research is a relatively new field, dating\nback to over 30 years. It was only recently that acu-\npuncture research increased in popularity and fund-\ning, though acupuncture has a history of over 3,000\nyears. Currently, a popular scientific explanation for\nthe mechanism of acupuncture is the \"opiate hy-\npothesis\" which attributes the effects of acupuncture\nto the release of endogenous opiates due to needle\nstimulations.\nYet because of the conflicting views between Western\nand Eastern perspectives on acupuncture, it has been\nhard to design experiments that represent both sides\nfairly. One particularly tricky area is in designing\ncontrols for clinical trials. From the Eastern perspec-\ntive, each acupuncture treatment is individual-based\nand different patients with the same Western symp-\ntoms could be diagnosed differently and given en-\ntirely different treatments according to Eastern acu-\npuncture theory. This idea strongly conflicts with the\nWestern ideology of developing standardized treat-\nments in which all patients with the same general\nsymptoms get the same, equivalent treatments. West-\nern science also tends to investigate phenomena by\nbreaking them into core elements, but acupuncture\nwould lose its meaning since it was meant to be taken\nas a whole according to the Eastern perspective.\nThere is also the presence of skepticism to the idea of\nacupuncture. Even at MGH, where there are acu-\npuncturists on the anesthesia staff, acupuncture is yet\nto be recognized as a mainstream medicine.\nThe future of acupuncture research is bright, with lots\nof opportunities available since it is a growing, new\nfield with a lot of unchartered territory. Learning\nabout how acupuncture works in the brain can also\nlead to discoveries and insights into the somatic,\ncentral and peripheral nervous systems. It is not\nuncommon now to see MD students go into research\nor look into alternative medicines like acupuncture.\nAnd for all students, Dr. Napadow gives the advice\nto keep your options open and not be afraid to pur-\nsue the things that interests you when you happen to\nstumble upon them.\nS\nE\nQ\nU\nO\nI\nA\n\nC\nL\nU\nB\n22.A09 - Career Options for Biomedical Research\nNew, Ancient, Sharp:\nAlternative Medicine and Biomedical Research\n\nCourtesy of Vitaly Napadow. Used with\npermission.\nNew, Ancient, Sharp:\nAlternative Medicine and Biomedical Research\n(c) Bob Stockfield. Courtesy of National Center for Complementary and Alternative Medicine.\n\nCourse A09: Crossword\nT\nH\nE\n\nP\nE\nR\nS\nP\nE\nC\nT\nI\nV\nE\nMassachusetts Institute of Technology - Fall 2006\nThank You:\nOlga Botvinnik, Anna Labno, Alice Chang, Toan Tran-Phu, Troy Rurak,\nKe Zhang, Richard Lin, Tiffany Yee, Richard Yau, David Li, and Jenni-\nfer Chu would like to extend a most grateful thanks to Professor Sid-\nney Yip and Dr. Bruce Rosen for being amazing seminar coordinators.\nYour guidance and advice catalyzed a smooth transition to M.I.T. for all\nthe freshmen in the seminar. We certainly hope you continue the tradi-\ntion of 22.A09 and allow the future classes to experience what we did.\nOf course, none of this would have been possible without the help of\nXin He, '09. Thank you for always being there with advice, an open\near, and copious amounts of food.\nLast, but most certainly not least, we would like to thank all the speak-\ners of 22.A09 for presenting their research, sharing their life stories, and\ngiving us a perspective of M.I.T. that undergraduates rarely see.\n\nThank You.\nAcross\n2. computerized axial tomography scan\n5. the Martinos Center is in this town\n7. build-up in arteries\n8. crystallography is performed on molecules\nin this phase\n9. atmospheric pressure reader\n10. Not very basic\n11. one can submit grants to the National\nInstitute of Health this many times a year\n13. volume picture elements\n15. Primary products of the MIT nuclear\nreactor\n18. most commonly used nuclei in NMR are\nhydrogen-1 and carbon-\n21. What uranium is incorporated into (2\nwords)\n22. this has many forms, but can't be used up\ncompletely.\n24. use this force, luke.\n25. don't wear it when you go into an MRI\nmachine\n28. electrons flow around a ___ to generate a\nmagnetic field in a given direction\n29. Practices acupuncture and does brain\nresearch\n30. the director of the Martinos Center\n32. all nuclei that contain odd numbers of\nnucleons have an intrinsic ___ moment\n33. integral of force\n34. the MIT nuclear reactor core chamber\npressure, compared to the outside pressure, is\n___\n35. strokes can be categorized into two types:\nhemorrhagic and ___\n36. the rupture of a vessel wall\nDown\n1. the H of HST\n3. unit of magnetic induction\n4. Nuclear reactor reaction\n6. what the MIT nuclear reactor sells\n9. most focused on organ for MRI\n11. bioengineering at MIT\n12. neutron-absorbing metal\n25. Imaging Technique\n26. years that a fuel element in MIT reactor can be\noperational for\n27. signal-to-noise ratio\n31. functional Magnetic resonance imaging\n14. a principal NMR technique\n16. 7 is better and stronger than 3 of these\n17. shape of nuclear core reactor\n19. this kind of magnetic field gives better\nresolution than low fields\n20. radiofrequency\n23. electroencephalograph"
    },
    {
      "category": "Resource",
      "title": "sara_ruben.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/6ea6a28aed8e5c2d79b55f42e34171ff_sara_ruben.pdf",
      "content": "Sara Rubenstein, Class of '09\nMy name is Sara Rubenstein and I am currently a freshman at MIT. I have just finished\nmy first semester, and I can honestly say that the past three months were probably the\nhardest of my life. But, they were hard in a good way. I knew coming to MIT would be a\nchallenge, but I could never have imagined what it would actually be like, both the good\nand the bad. Despite the difficulty of the decision, I really think I made the right decision\ncoming here. I was scared coming here, scared that I wouldn't be smart enough, or that I\nwouldn't fit in. However, I have realized that MIT has so much to offer its students both\nacademically and socially. MIT allows me to get a glimpse of the many opportunities and\npossibilities out there, and I am glad that I made the decision to come here.\nIf you asked me what I wanted to be when I was 5, I would have said a ballerina; If you\nasked me when I was 10, I would have said an author; If you asked me when I was 13, I\nwould have had absolutely no idea. It wasn't until high school when I realized that I was\ninterested in science. Over the past few years biology has been my favorite course. Ever\nsince the first few months of freshman Biology, I have developed a love for the subject\nand an especially keen interest in the areas of genetics and molecular Biology. I liked the\nother sciences as well, but I never saw myself as a hard-core physicist. Biology was\nextremely appealing and intriguing to me. It was around that time when I fell in love with\nbiology, that I decided that I wanted to be a doctor.\nMy desire to work in the medical field was intensified when I took part in a mentoring\nprogram offered by my high school. This program partners students with professionals in\nareas of specific interest to the student. During my sophomore, junior and senior years, I\nwas paired with a pathologist, a neurologist, and cardiologist. This experience exposed\nme to both medical research and patient care, two areas in which I am interested. My\nmentoring experience gave me added experience to the medical field and really helped to\nsolidify my desire of becoming a doctor.\nI came into MIT 99% sure I wanted to major in Biology and be a doctor, but I had no\nidea what kind of doctor I wanted to be or what specific areas I wanted to study. I had\nalways been interested in the patient-care aspect of medicine as well as the medical\nresearch aspect, but was unsure of how I was going to combine them. After one semester\nat MIT and participating in the seminar Career Options in Biomedical Research, I am still\n99% sure I want to major in Biology and be a doctor, but all of the other questions\nremaining unanswered. However participating in this seminar did open my eyes to what\nis out there in the field of biomedical research. While I am still sure that I want to major\nin biology, I have begun to generate interest in neuroscience and bio-medical\nengineering, and thus am considering the possibility of double majoring in Biology and\nBrain and Cognitive sciences, or possibly minoring in biomedical engineering. While I\nstill am unsure about exactly what type of doctor I want to be or how I am going to\ncombine my interests in patient care and research, this seminar introduced me to some of\nthe possible career options. I was given the opportunity to hear from successful medical\ndoctors as well as bio-medical researchers, and was given the inspiration to further my\ninterests."
    },
    {
      "category": "Resource",
      "title": "sidney_yip_bio.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/ffb37439b723b4fa6e1ee8cc6c54c259_sidney_yip_bio.pdf",
      "content": "Professor Sidney Yip, Ph.D.\nDepartment of Nuclear Science and Engineering, Massachusetts Institute of Technology\nDepartment of Materials Science and Engineering, Massachusetts Institute of Technology\nBy Justin Tan\nFrom a purely scientific standpoint, Professor Yip teaches in the Nuclear Science and\nEngineering Department. His recent teaching duties concern both graduate and\nundergraduate nuclear physics, graduate subjects in neutron physics and in nuclear and\natomic collision phenomena, and an advanced subject pertaining to statistical processes\nand atomistic simulations. Prof. Yip also involves himself with a number of\nextracurricular activities. For example, in spring 2002, along with 9 other faculty\nmembers in 6 departments, Professor Yip introduced an Institute-wide undergraduate\nsubject on introduction to modeling and simulation. His current departmental duties\ninclude serving as the Financial Aid Officer, Undergraduate Registration Officer, and the\nCoordinator of the Nuclear Science and Technology Program.\nSidney Yip was born in Beijing, China where he was raised until 1950 when he, his\nparents, and his two brothers immigrated to the United States. Initially, he attended\nschool in San Francisco but soon moved to New Jersey where he graduated in 1953.\nProfessor Yip then sought college degrees at the University of Michigan, garnering a\nBachelors of Science in Mechanical Engineering (1958), a Masters of Science in Nuclear\nEngineering (1959), and finally a Ph. D. in Nuclear Engineering (1962). His formal\neducation ended with a postdoctoral year at the University of Michigan. Before joining\nthe Nuclear Engineering Faculty at MIT, he worked for two years as a Research\nAssociate in the Department of Applied Physics at Cornell University. Since coming to\nMIT, he has garnered several milestones including a professorship in 1973 and a\nsecondary appointment in 2000 to the Department of Materials Science and Engineering.\nHowever, apart from his scientific interests, Prof. Yip reflects a sincere enthusiasm\ntowards teaching and passing on his own experiences, stressing several valuable lessons\non the nature of education and learning. Most importantly, he stresses that whether a\ntoddler, adolescent, or adult, the learning process never truly ends. Therefore, it is\nimportant to do something enjoyable, for the knowledge and education imparted will\nexist as a companion throughout one's entire life. Professor Yip offers much more to\nMIT than mere scientific information, as apparent every fall, where he co-leads a\nFreshman Advisor Seminar on career options in biomedical research. Through the\nseminar, he conveys the importance of learning, and more specifically, happiness in\nlearning, to disoriented MIT freshman lost in a sea of possibilities.\nProfessor Sidney Yip's philosophy on choosing a career path has been fundamentally\ninfluenced by MIT. Those who reflect MIT's outlook will achieve at MIT, and more\nimportantly, in life in general. The institution's mission, according to him, outlines the\nfundamental concepts that should be considered by every human being in deciding on\nwhich area of knowledge to pursue. Thus, Prof. Yip continually reiterates the ideals with\nwhich MIT is based on: \"To develop the ability and passion to work wisely, creatively\n\nand effectively for the benefit of humankind [...] To generate, disseminate and preserve\nknowledge, working with others to bring this knowledge on the world's great challenges\n[...] To combine rigorous study with the excitement of discovery.\" Above all, he stresses\nfour fundamental aspects inherent within the school's environment: passion, great\nchallenges, rigorous study, and discovery. The right path is one which generates a passion\nfor facing great challenges and one which excites a person to study rigorously in order to\nachieve some level of personal or public discovery. With this in mind, it is important that\neach student know what he or she wants to do, not necessarily indefinitely, but from one\nmoment to the other.\nEven though most students do not know what they want to do, Prof. Yip emphasizes that\nit is necessary to make a decision based on the current situation. This philosophy further\nreflects that of MIT's in choosing which area of research to develop. For the past couple\nof years, due to an increasing demand for knowing how the brain functions, MIT focused\non developing its neuroscience facilities, thereby enhancing its Harvard-MIT Division of\nHealth Sciences & Technology (HST) program. Most recently, it successfully\ninaugurated its Picower Center for Learning and Memory, the largest neuroscience\nresearch facility in the world. Nowadays, MIT has shifted its focus towards renewable\nenergy due to the government's increasing concern to find alternative energy resources.\nThus, along the same lines as MIT's philosophy to move in directions reflected by the\npresent-day problems of society, Prof. Yip incites the same philosophy towards freshman\nin choosing a specific major. Furthermore, the most important aspect reflected in MIT's\nphilosophy, in Prof. Yip's opinion, insists that the institution must keep moving forward\nin order to avoid being trapped in the past. In the end, \"it's not what we know, it's what\nwe don't know\" that is important. Thus, MIT teaches students how to think rather than\nwhat to think so that they gain four fundamental qualities throughout their education -\nexcellence, perseverance, boldness, and optimism. With these skills, graduates will be\nable to stay at the frontier of information and technology. As mentioned in the 1999\nCampaign for MIT, \"\"In our lifetime, technology and science will change and converge\nin abundant and bewildering ways. We may find ourselves in a place where we won't\nknow what to do, and we'll have to figure it out. But if you've been to MIT, you've been\nthere before.\"\nTo incoming freshman, Professor Yip's final advice is to investigate a wide variety of\noptions. A common misconception is that MIT is a school of engineering. Although the\nMassachusetts Institute of Technology was founded for engineering and is historically\nknown for that program, it has since expanded to become a world leader in numerous\nother faculties as well. For example, Sloan Business School now rivals both Wharton and\nthe London School of Economics as one of the top managerial schools in the world. In\nthe same way, the Economics department repeatedly appears at the forefront of research\nand innovation, known to many economists as the top program in the country. Likewise,\nas Professor Yip asserted and demonstrated through guest lecturers during the freshman\nseminar, MIT has collaborated with Harvard in the biological sciences over the past few\ndecades to develop one of the most sought after MD, PHD, and MD-PHD programs\nthrough their HST collaboration. Thus, Professor Yip conveys that students at the\ninstitution can pursue extremely valuable educations in many different fields, including\n\nbut not exclusively in engineering. The possibilities are endless for those who choose to\ncome to this institution. Especially for freshman, these choices can be as difficult as the\ninformation taught during the classes. Fortunately, we have such experienced professors\nas Sidney Yip to guide us on the journey towards our future at the Massachusetts Institute\nof Technology.\nCurrent Research\nProfessor Sidney Yip is a significant figure in the Nuclear Engineering and Materials\nScience and Engineering Divisions at the Massachusetts Institute of Technology. As\nprincipal investigator, he directs the Atomistic Simulation of Materials Group at the\nMassachusetts Institute of Technology. His long and illustrious career has been marked\nwith creativity and dedication towards life and learning, leading to a focus on the theory\nand simulation of fundamental materials properties and behavior across different length\nand time scales. More specifically, Professor Yip's research group concerns itself with\nmechanical and thermal behavior of structural and functional materials.\nHis research group in the Department of Nuclear Engineering, Atomistic Simulation of\nMaterials (ASM), is dedicated to the study of materials modeling, in order to make use of\ntheory and simulation in conjunction with experiments for validation. The group's main\nresearch topics include High-Temperature Oxidation of Refractory Borides, Molecular\nConductivity, Molecular Actuation, Equation Free Modeling, Hydrolytic Weakening, and\nStress-Induced Defect Nucleation.\nResources\nIf you would like to read more about Boron Atomistic Simulation of Materials Group,\nfeel free to visit:\nhttp://mmm.mit.edu/\nHere is the MIT News article that was published in 2005 about Professor Yip's\nadvancements in Robotic muscle:\nhttp://web.mit.edu/newsoffice/2005/muscle.html"
    },
    {
      "category": "Resource",
      "title": "term_project.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/2155bef5d7d8c80de779a39d8c809740_term_project.pdf",
      "content": "Now that we have talked about the term project, let me kick it off a little more formally by\ngiving you some thoughts on what we have in mind. Hopefully this is enough to get you off\nand running as a group. Never mind if the beginning seems rough and arbitrary - it is the\nnature of the game when you are trying something brand new.\nLet's say you have seen the report from the Student Advisory Board (SAB) which was charged\nby President Susan Hockfield to come up with the student perspectives on MIT - what are the\nInstitute strengths, what are the challenges and the future directions facing MIT. See the\nExecutive Summary and the full report on MIT in Transition.\nSuppose you, as a class, are now charged by Bruce and me to come up with a student\nperspective on Biomedical Research at MIT - what programs are available, what are the\nopportunities facing a new student (say freshman), and what guidance, if any, can be offered.\nWhile this is a much more restricted topic than the charge given to SAB, you can nevertheless\nfollow their report in structuring your perspective. There is nothing like having a finished\nproduct (one that is well done) to guide you in carrying out your own investigation, evaluation,\nand reporting.\nNotice that the SAB report is: MIT in Transition: Student Perspectives on MIT's Legacy\nStrengths, Emerging Challenges, and Future Directions.\nFor your term project you might start with (just a suggestion, you should feel free to modify):\nBiomedical Research at MIT: Student Perspectives on Traditional Values (Strengths),\nEmerging Directions, and Decision Guidance.\nBasic idea is to make a survey of the landscape for biomedical research (define it according to\nwhat you want to emphasize) at MIT by\n-\nNoting institutional programs such as HST, BE, and research groups like the Martinos\nCenter and the Computational Systems Biology Initiative\n-\nGathering information from the scheduled speakers during the term\n-\nPutting in your own assessment of the emerging directions\nYou should also try to come up with some kind of guidance for the future students who are not\nas fortunate as you in having this group opportunity to look into things over an entire term\n(and who have similar personal goals and face the same kinds of decisions as you).\nI am confident that once you get going, you will find many more ideas along the way that will\nguide you in knowing how to proceed. Don't worry about making it too detailed in the\nbeginning since there will be adjustments. The important thing is to get started and work as a\nteam as much as possible (give everyone a chance to contribute and be a stake holder). Do\nkeep an eye on the schedule because the time goes faster as the term gets going.\nThoughts on the Term Project for 22.A09/22.013 Careers in Biomedical Research"
    },
    {
      "category": "Resource",
      "title": "advisorsem05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-a09-career-options-for-biomedical-research-fall-2006/a44ebf9dbf194e618a82fb40ebc1788c_advisorsem05.pdf",
      "content": "An Informal Discussion with Members of Class of 2009\nNuclear Science and Engineering Department, MIT,\nNovember 29, 2005\nA Glimpse of MIT, Nuclear Engineering,\nand Multiscale Materials Modeling and Simulation\nSidney Yip\nDepartment of Nuclear Science and Engineering\nDepartment of Materials Science and Engineering\n\nMIT\nNuclear Engineering at MIT\n\nA few words, with meaning ...\n\nThe MIT Mission\nDevelop the ability and passion to work wisely, creatively\nand effectively for the benefit of humankind.\nGenerate, disseminate and preserve knowledge, working with\nothers to bring this knowledge on the world's great challenges.\nCombine rigorous study with the excitement of discovery.\nhttp://mit.edu/\n\nWhere To Put the X ?\n(how MIT sees its future through the Capital Campaign -\nCalculated Risks and Creative Revolutions)\nIT'S SAID THAT IN THE EARLY YEARS OF THIS\nCENTURY CHARLES PROTEUS STEINMETZ, THE\nGREAT ELECTRICAL ENGINEER, WAS BROUGHT TO\nGENERAL ELECTRIC'S FACILITIES IN SCHENECTADY,\nNEW YORK.\nGE had encountered a performance problem with one of its\nhuge electrical generators and had been absolutely unable to\ncorrect it. Steinmetz, a genius in his understanding of\nelectromagnetic phenomena, was bought in as a Consultant -\nnot a very common occurrence in those days, as it would be\nnow.\nSteinmetz also found the problem difficult to diagnose, but for\nsome days he closeted himself with the generator, its\nengineering drawings, paper, and pencil. At the end of this\nperiod he emerged, confident that he knew how to correct the\nproblem.\nAfter he departed, GE's engineers found a large \"X\" marked\nwith chalk on the side of the generator casing. There was also a\nnote instructing them to cut the casing open at that location and\nremove so many turns of wire from the stator. The generator\nwould then function properly.\nAnd indeed it did.\nSteinmetz was asked what his fee would be. Having no idea in\nthe world what was appropriate, he replied with the absolutely\nunheard-of answer that his fee was $1,000.\nStunned, the GE bureaucracy then required him to submit a\nformally invoice.\nThey soon received it. It included two items:\n1. Marking chalk X on side of generator: $1.\n2. Knowing where to mark chalk X: $999.\"\nPresident Charles M. Vest, Commencement address, June 1999 \"Where to Put the X?\"\nFigure by MIT OCW.\n\n(how the School of Engineering sees its Mission)\nLeadership Through Technical Excellence and Innovation\n\nMIT (5 Schools)\nSchool of Engineering (8 Departments)\nDepartment of Nuclear Science and Engineering\nFission Technology\nPlasma Science and Fusion\nNuclear Science and Technology\n17 Faculty, 110 Grad, 60 UG\nEnergy/Technology Management\nand Policy\nhttp://mit.edu/ned/\n\nNuclear Engineering Department\nFundamental Studies leading to diverse applications\nCore Currriculum\n→ Fission, Fusion, NST\n\nJeffrey A. Coderre\nAssociate Professor of Nuclear\nEngineering\nRadiation biology; boron\nneutron capture therapy.\nSow-Hsin Chen\nProfessor of Nuclear Engineering\nNeutron and X-ray diffraction and\nspectroscopy applications of laser\nlight scattering to complex fluids\nand biological problems.\nDavid G. Cory\nProfessor of Nuclear Engineering\nMagnetic resonance and its applications\n(particularly to spatial characterization);\nadvanced instrumentation; new\nmethodologies; imaging; scattering;\nmedical imaging; non-destructive analysis;\nquantum information processing; quantum\ncomputing; quantum complexity.\nJacquelyn C. Yanch\nProfessor of Nuclear Engineering,\nand Whitaker College of Health\nScience and Technology\nComputational methods in\nmedical physics; nuclear medicine\nimaging; radiation therapy;\naccelerator neutron production.\nSidney Yip\nProfessor of Nuclear Engineering,\nand Material Science and\nEngineering\nTheory and atomistic simulations\nin transport and collisional\nphenomena; multiscale materials\nmodeling.\nRichard Lanza\nSenior Research Scientist\nRadiation imaging; radiation\ndetectors; nondestructive testing;\nradiological and industrial\napplications of radiation;\ndevelopment of new radiation\nsources.\n\nDown to the level of an individual professor\nwhose research interests and activities are in\nModeling and Simulation\n\nComputational Materials Research (Computational Materials)\nis a unique complement to traditional theory and experiment\nFundamental Understanding, Prediction, Design/Discovery\nHigh Performance Computing\nAdvances in theory and simulation\nScientific Visualization\n\nFig. 1-1\nModeling Challenges in\nMaterials Processing\n\nMultiscale Modeling -\ntheory, simulation and visualization of\nphysical phenomena from electrons to\natoms, macromolecules and beyond\nModeling is the\nphysicalization of a concept,\nSimulation its computational realization\n\n\"If, in some cataclysm, all of scientific knowledge were to be\ndestroyed, and only sentence passed on to the next generations\nof creatures, what statement would contain the most\ninformation in the fewest words? I believe it is the atomic\nhypothesis (or the atomic fact, whatever you wish to call it)\nthat all things are made of atoms - little particles that move\naround in perpetual motion, attracting each other when they\nare a little distance apart, but repelling upon squeezed into one\nanother. In that one sentence, you will see, there is enormous\namount of information about the world, if just a little\nimagination and thinking are applied.\"\nRichard P. Feynman, Six Easy Pieces, (Addison-Wesley,\nReading,1963), p.4, Matter is made of atoms\n\nFor understanding and prediction -\natoms\n{rN(t)}\nNewton\nelectrons\ni\nψ\nSchrodinger\n→\nstatistical Thermodynamics\nsolid and fluid mechanics\ncondensed matter physics, etc.\n→\nScience and\nTechnology\nof Materials\nfunding agencies, universities, national labs, corporate research\nworkshops, symposia, publications\n\nFig. 1-2\nThere exist corresponding time scales\n\nScales of Microstructure\nScales of Microstructure\nFig. 1-3\nCourtesy of Prof. Lalit Anand. Used with permission.\n\nA large\nA large multiscale\nmultiscale modeling project (the dynamics of metals)\nmodeling project (the dynamics of metals)\nat the Lawrence Livermore National Laboratory\nat the Lawrence Livermore National Laboratory\nFig. 1-4\n\nMD determination of Argon melting curve\nMelting curves from defect-nucleation MD\nand from direct free-energy calculations\nThe most challenging problem in thermodynamics\nis the calculation of free energy\nImage removed due to copyright restrictions\nSolca, J. et al. \"Melting curve for argon\ncalculated from pure theory.\" Chemical\nPhysics 224 (December1997): 253-261.\nFigure 3.\nImage removed due to copyright restrictions\nde Koning, Maurice, Alex Antonelli, and\nSidney Yip. \"Single-simulation\ndetermination of phase boundaries: A\ndynamic Clausius-Clapeyron integration\nmethod. Journal of Chemical Physics 115,\nno. 24 (December 2001): 11025-11035.\nFigure 9.\n\nUnderstanding the mechanical and thermal behavior of irradiated SiC\nis a basic nuclear materials issue for fission and fusion technologies\n\nThe Jiggling and Wiggling of Atoms\n\n\"Certainly no subject is making more progress on so many fronts than\nbiology, and if we were to name the most powerful assumption of all,\nwhich leads one on and on in an attempt to understand life, it is that\nall things are made of atoms, and that everything that living things do\ncan be understood in terms of the jiggling and wiggling of atoms.\"\n-- Richard Feynman, Lectures on Physics, vol. 1, p.3-6 (1963)\n\nImage removed due to copyright restrictions.\nImage removed due to copyright restrictions.\nGouldstone\nGouldstone, A., K. Van\n, A., K. Van Vliet\nVliet, and S. Suresh.\n, and S. Suresh. \"\"Simulation of defect\nSimulation of defect\nnucleation in a crystal.\nnucleation in a crystal.\"\" Nature\nNature 411 (2001): 656.\n411 (2001): 656. Figure 1.\nFigure 1.\n3⁄4\n3⁄4formation of slip step\nformation of slip step\nExperimental Observations of yield\nExperimental Observations of yield\nonset\nonset\n\nNanoindentation\nNanoindentation in 2D (MD)\nin 2D (MD)\ncoordination number encoding\ncoordination number encoding\n\nH2O + Si-O-Si\n2SiOH\n→\nAttack of water molecule on quartz (SiO2)\n\ncharge transfer during hydrolysis of Si-O-Si bridge\n\nH\nC\nS\nAu\nS\nC\nH\nelectron conductance across\na molecular junction\ncharging a single polypyrrole chain causing\na conformation change is an intrinsic mechanism\ncharge transport and localization in functional nanostructures\n- molecular electronics, molecular actuators\n↓\n\nConjugated Polymer Actuators\nConjugated Polymer Actuators\nExamples of big companies using conjugated polymer\nactuator technology include:\n- Honda Asimo Technology\n-EAMEX\nhttp://www.eamex.co.jp/index_e.html\n\nEffects of temperature on deformation and bond breaking\n\nFailure of ZrC under Hydrostatic Tension - Temperature Effects\nLow T (300oK) Cleavage\nHigh T (3500oK) Cavitation\n\n5nm\nExtension of Elliptical Crack in Quartz\nTm=1700K\n300K\n[2]\nFracture Toughness of Quartz (300oK)\nGriffith:\nGriffith:\n/(1\n)\nIC\nK\nEγ\nν\n=\n-\nKIC=0.91 [MPa m1/2] (from E,γ,ν)\n=0.97 (expt - Iwasa & Ueno '81)\nDirect Simulation:\nIC\nc\nK\nc\nσ\nπ\n=\nKIC=1.55 (simulation)\nKIC=1.63 (unrelaxed γ')\n\nImage removed due to copyright\nrestrictions.\nReal-time imaging gold nanojunctions\nRodrigues and Ugarte. \"Real-time imaging of\natomistic process in one-atom-thick metal\njunctions Physical Review B 63 no. 073405\n(2001). Figure 1.\nImage removed due to copyright\nrestrictions.\nTB-MD simulations\nda Silva, E.Z., Antonio da Silva, and A.\nFazzio. \"How Do Gold Nanowires Break?\"\nPhysical Review Letters 87, no. 25 (2001).\nFigure 1.\n\nE [eV/atom]\nTensile Strength of Carbon\nNanotube\n(molecular dynamics simulation)\n\nEnergy of (10,10) SWNT vs Stretching Strain\n-5\n-5.5\n-6\n-6.5\n-7\n-7.5\n0.34\n0.35\n0.36\n0.37\n0.38\n0.39\n0.4\n0.41\n0.42\nε xx\n\n(10,10) SWNT Junction Strength\n(10,10) SWNT Junction Strength\n\nback to the MIT experience ...\n\"In our lifetime, technology and science will change\nand converge in abundant and bewildering ways.\nWe may find ourselves in a place where we won't\nknow what to do, and we'll have to figure it out.\nBut if you've been to MIT, you've been there before.\"\nIt's Not What We Know. It's What We Don't Know.\n-- Calculated Risks, Creative Revolutions: The Campaign for MIT (1999)\n\nIntelligent, Irreverent, and To the Point\nThe MIT Style -\n\nFour qualities that will serve you well at MIT\nExcellence\nPerseverance\nBoldness\nOptimism"
    }
  ]
}