{
  "course_name": "Causes and Prevention of War",
  "course_description": "This course examines the causes of war, with a focus on practical measures to prevent and control war. Topics include causes and consequences of misperception by nations; military strategy and policy as cause of war; religion and war; U.S. foreign policy as a cause of war and peace; and the likelihood and possible nature of great wars in the future.\nThe historical cases covered include World War I, World War II, the Korean War, the Seven Years’ War, the Arab-Israel conflict, other recent Mideast wars, and the Peloponnesian War.",
  "topics": [
    "Humanities",
    "History",
    "Military History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Military Studies",
    "Security Studies",
    "Humanities",
    "History",
    "Military History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Military Studies",
    "Security Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDiscussion sections: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThere are no prerequisites for this course. This is an undergraduate course but is open to graduate students.\n\nCourse Description\n\nThe course topic is the causes and prevention of interstate war. The course goal is identifying ways to prevent or control war. Hence we focus on causes of war that are manipulable or controllable, or whose effects can be abated by feasible countermeasures. Covered topics include dilemmas, misperceptions, crimes and blunders that caused wars of the past; the deeper origins of these and other war causes; the possible causes of wars of the future; and possible means to prevent such wars, including short-term policy steps and more utopian schemes. We use history to infer and test theories, and use theories to explain specific wars and other history.\n\nCovered historical cases include the Peloponnesian and Seven Years wars, World War I, World War II, Korea, the Arab-Israel conflict, and wars between the U.S. and Iraq (2003) and the U.S. and al-Qaeda and ISIS (1993-present).\n\nCommunications Intensive Requirement\n\n17.42 is a HASS Communications Intensive (CI) course, and so helps fulfill the HASS\nCI\nrequirement. Communications intensive subjects in the humanities, arts, and social sciences require at least 20 pages of writing divided among 3-5 assignments. Of these 3-5 assignments, at least one should be revised and resubmitted.\n\n17.42 requires 20 pages of writing, requires early submission of at least one paper, and includes two public speaking exercises in section. Sections will include fewer than 10 students.\n\nFormat and Requirements\n\nClass Format\n\nThe class has two 1-hour general meetings and one 1-hour discussion section meeting per week.\n\nDiscussion Sections\n\nStudents are required to attend section meetings. Sections cover key material. Also we need you to attend section to make the class work. Help us out!\n\nTwo student-led debates on responsibility for World War I and World War II will be organized in section when those wars are covered during Sessions 14-18.\n\nPapers\n\nStudents are required to write two short ungraded response papers that react to course material, and two longer papers on questions arising from course material. The two response papers each will be two pages long (double spaced). The longer papers should total about 16 pages-roughly 8 pages each.\n\nQuizzes\n\nTwo short (15 minute) quizzes will be given. They will occur during Session 8 and Session 20. Three short define-and-identify questions will be asked on each quiz.\n\nFinal Exam\n\nA 2.5 hour final will be given during Session 26. We will circulate a list of study questions before the final. The final exam questions will be drawn from this list. Students are encouraged to study together to prepare their answers. The final will also include short-answer questions that will not be distributed in advance.\n\nThe 17.42 Film Society\n\nA couple of optional evening film showings will be organized during the term on topics to be chosen by acclamation of the class. Topics could include the current danger of nuclear war, past and present religious conflict, the Cuban Missile Crisis, the Vietnam War, or other subjects. Some of the film to be shown include:\n\nDr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb\n. Directed by Stanley Kubrick. Black and white, 95 min. 1964.\n\nStar Trek: Discovery (tv series)\n. Color, 60 mins. / episode. 2017-.\n\nJames Carroll's Constantine's Sword\n. Directed by Oren Jacoby. Color, 93 min. 2007.\n\nReadings\n\nHaffner, Sebastian.\nThe Meaning of Hitler\n. Translated by Ewald Osers. Harvard University Press, 1983. ISBN: 9780674557758. [Preview with\nGoogle Books\n]\n\nIenaga, Saburo.\nThe Pacific War, 1931-1945: A Critical Perspective on Japan's Role in World War II by a Leading Japanese Scholar\n. Pantheon Books, 1978. ISBN: 9780394734965. [Preview with\nGoogle Books\n]\n\nIkle, Fred Charles.\nEvery War Must End\n. Revised edition. Columbia University Press, 2005. ISBN: 9780231136679. [Preview with\nGoogle Books\n]\n\nRees, Sir Martin.\nOur Final Hour: A Scientist's Warning: How Terror, Error, and Environmental Disaster Threaten Humankind's Future in this Century-On Earth and Beyond\n. Basic Books, 2004. ISBN: 9780465068630. [Preview with\nGoogle Books\n]\n\nThucydides.\nHistory of the Peloponnesian War.\nTranslated by Rex Warner. Penguin Classics, 1972. ISBN: 9780140440393.\n\nI also recommend--but don't require--that students buy a copy of the following book that will improve your papers:\n\nTurabian, Kate L.\nA Manual for Writers of Research Papers, Theses, and Dissertations: Chicago Style for Students and Researchers\n. 7th edition. University of Chicago Press, 2007. ISBN: 9780226823379.\n\nTurabian has the basic rules for formatting footnotes and other style rules. You will want to follow these rules so your writing looks spiffy and professional.\n\nFor additional readings, see the\nReadings\nsection.\n\nGrading Policy\n\nGrades are based on:\n\nACTIVITIES #\n\nPERCENTAGES\n\nSection participation\n\n15%\n\nTwo 8-page papers\n\n40%\n\nFinal exam\n\n30%\n\nTwo quizzes\n\n15%\n\nFor more detail on the papers, see the\nAssignments\nsection.",
  "files": [
    {
      "category": "Assignment",
      "title": "17.42_S18 First Paper Assignment: Lebon Pace Fund Proposal",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/86e44256e69523dba0d3742f487c79be_MIT17_42S18_LebonPeaceFund.pdf",
      "content": "17.42\nMIT Student\nProfessor Van Evera\nLebon Peace Fund Proposal\nWars are an incredibly costly affair that should be avoided if at all possible. Derfla\nLebon, a wealthy world peace activist, created the Lebon Peace Fund to develop projects that\nwill prevent wars, regardless of the financial cost. Devising such projects requires an\nunderstanding of the current international political climate as well as brewing tensions. At the\nmoment, France and Great Britain each have a military and economic reach that is unrivaled by\nany other state, and as a result, a war between them would be very damaging. Given that I have\nbeen transported in a time machine from the year 2018 to the current year 1730, I am aware that\nif the current political situation continues unhindered, a war between these world powers, called\nthe Seven Years' War, will break out in 26 years. My mission as an advisor to the Lebon Peace\nfund is to use my knowledge of the Seven Years' War to prevent it from occurring. Although it\nwas explicitly control of the Ohio Valley that the states fight over, the true stakes are supremacy\nof the world economy, control of North America, and dominance in the sea. Unfortunately, the\nbelief that the Ohio Valley is essential for these goals is not true, but it was perpetuated by actors\non both sides of the Atlantic. Corrupt governors in North America drove Great Britain and\nFrance into believing misperceptions, and warmongering individuals in London took\nadvantage of windows of opportunity and vulnerability that arise; as a result, the Lebon\nPeace Fund should develop multiple, independent, free journalism organizations in North\nAmerica and a peace party in the British government.\n\nOne of the guiltiest actors in starting the Seven Years' War is Governor Dinwiddie of\nVirginia, whose personal interests in the Ohio Land Company motivated him to mislead London\nabout French aggression. Dinwiddie was a major stockholder in the Ohio Land Company1, a\nland-exploitation company that was meant to operate in land that was also claimed by the\nFrench. Knowing that London would only support him if they believed the French threat to the\nOhio was also a threat to Virginia, Dinwiddie exaggerated the issue. He sparsely mentioned the\nOhio Company, emphasized the English rights to the land (based on a highly questionable\ninterpretation of the Treaty of Utrecht2), and exaggerated the French threat in his letters to\nLondon and other American governors. Meanwhile, he discussed the use of government\nresources to advance the Ohio Company's agenda in his letters to other shareholders, clearly\ndemonstrating his misleading intentions. Since in 1753 the British government only had\nDinwiddie's letters to consider, they fell into a misperception. They began to have false\npessimism about their own ability to defend themselves, and the notion of an overly aggressive\nFrance threatening the British colonies was introduced. Upon introduction, states often\nexperience belief perseverance, wherein they are slow to absorb new realities that clash with\ntheir existing beliefs3. Furthermore, because Britain and France have been rivals for centuries,\nthey were likely to have separated themselves into cohesive and mutually hostile groups,\notherwise known as in-group-out-group-theory4. In 1754, London receives two letters that affirm\ntheir beliefs: Dinwiddie's detailing Jumonville's death and Washington's defeat at Fort\nNecessity; and Governor Shirley's incorrect reports that the French were invading Kennebec5.\n1 Richard Smoke, War: Controlling Escalation (Harvard University Press, 1978), 232.\n2 Patrice Louis-Rene Higonnet, The Origins of the Seven Years' War (The University of Chicago Press, 1968), 61.\n3 Robert Jervis, International Politics: Anarchy, Force, Political Economy, and Decision Making (TBS The Book\nService Ltd, 1984), 518.\n4 Jervis, International Politics: Anarchy, Force, Political Economy, and Decision Making, 521.\n5 Smoke, War: Controlling Escalation, 233.\n\nBecause these were the only sources of information the Crown had to consider, they were\nconvinced that the French were the aggressors. Dinwiddie's relationship to the Ohio Land\nCompany made him a biased informant to the Crown, and as a result, he misled them into\nbelieving they were significantly vulnerable to French attacks.\nAnother governor who misled their European superiors was the Governor of New France,\nDuquesne. He reported to the French government that he would reduce costs by eliminating\nunnecessary outposts. Instead, soon after arriving to Canada, he began developing an army of\n2,200 men and proceeded to establish a chain of forts in the Ohio Valley to protect what he\nclaimed to be the lifeline between France's colonies in North America. Fortifying the Ohio\nterritory was seen as highly aggressive by the British, though he and the French did not see it as\nsuch. The discrepancy in judgement is a prime example of attribution error, a type of\nmisperception wherein states attribute their own aggressive behavior to their situation but that of\nanother state to their innate disposition6. Attribution error is dangerous here because Duquesne\nwas influencing France to believe that he was acting defensively while the English were\nunjustified in their aggressions. The French government was unable to recognize offensive\nmoves made in their name because they were excessively dependent on the word of Duquesne in\ntheir considerations. He also perpetuated an overextended limit of French territory to his officers,\nwho then extended even beyond those boundaries7. His actions were contradictory to Paris's\ndesire to limit expenses and avoid conflict with the English, so it seems he had motives other\nthan that of the state. There was some evidence to suggest that Duquesne was involved with the\nGrande Societe which were a group of fur traders who relied on the Ohio area8. Like Governor\n6 Jervis, International Politics: Anarchy, Force, Political Economy, and Decision Making, 521.\n7 Higonnet, The Origins of the Seven Years' War, 66.\n8 Smoke, War: Controlling Escalation, 233.\n\nDinwiddie, he was also relying on in-group-out-group divisions, based off of existing tensions\nbetween the two states, to occur. Duquesne was later removed in 17549 because he was unable to\nreduce expenses, indicating that he was not acting according to Paris's wishes, but by then, the\ndamage in misperception had already been done. The British believed the French were being\naggressive by fortifying the Ohio Valley, and the French believed the British to be aggressive\nafter their general, Jumonville, was killed. Although it is not certain that he was motivated by a\nprivate business, Duquesne's aggressive actions, which contradicted the peaceful intentions of\nthe French government, suggest that he thought he would be able to mislead Paris into\nmisperceiving the British as the primary aggressors.\nMisperceptions would be mitigated if the Lebon Peace Fund were to invest in multiple\nindependent presses, each with a culture of integrity in the colonies. Since Britain and France are\nboth over 2500 miles from their territories in North America, a likely problem would revolve\naround the evaluation of their governors and government employees in the colonies. In order to\ndiscourage the North American actors from engaging in corruption or purposefully misinforming\ntheir European superiors, several independent journalism agencies would gather information\nfrom various locations in the colonies and release newspaper issues and pamphlets every month,\nupdating both the local populations and those back in Europe of the happenings in North\nAmerica. The pace of publication would encourage the press to stay up to date on government\naffairs, which would allow Europe to gain a better understanding of the political climate in the\nAmericas. Although this does not solve this issue of news taking several weeks to arrive in\nEurope, the pace of the build-up to the Seven Years' War is slow enough that with more regular\nupdates, the governing officials in London and Paris would be better able to judge the situation.\n9 Higonnet, The Origins of the Seven Years' War, 67.\n\nIf a government representative, such as Duquesne or Dinwiddie, decides to provoke a military\nconflict with another state to help their private business, their actions would be reported by\nseveral news agencies. Once one official has been made an example of, other officials will be\ndiscouraged from tampering with the peace. In order to prevent a governor from shutting down\nthe press, numerous printers and supplies would be purchased and placed throughout urban areas\nin New France and the English colonies, and the Lebon Peace Fund would finance riders to\ndistribute papers to crossroad inns, urban taverns, army camps, and rural estates. The Fund\nwould also pay apprentices to work at the printers, and writers would publish under a pseudonym\nto protect their identity from the government. With the entire industry spreading news all over\nthe country and writer anonymity, it would be difficult for the governors to stop all information\nfrom flowing back to Europe. In addition to preventing malicious actors from using their public\nposition for private interests, these news agencies would reduce the likelihood of attribution error\nbecause both states would be able to read the news and understand how the other side perceives\ntheir actions, similar to the embassies mentioned earlier. The presence of news agencies that\nreport the wrongdoings of government officials would greatly prevent misperceptions because\nthe states would recognize unsanctioned actions and respond diplomatically. The independent\npress would serve as a watchdog ensuring that the peaceful policies of the states were being\nfulfilled and provide more perspectives on the events occurring in North America.\nOn the other side of the ocean, the war party in London perceived windows of\nopportunity and vulnerability that led them to pursue war with France. Prime Minister Newcastle\nand most of his cabinet originally believed that a peaceful negotiation would be the best way to\nresolve the conflict in North America10. However, several influential individuals, collectively\n10 Higonnet, The Origins of the Seven Years' War, 71.\n\nreferred to as the war party, interpreted the French attacks as a precursor to a major war and were\nskeptical of the value of negotiations. Some were staunch imperialists who generally favored war\nover negotiations and believed in this case that it was better to be aggressive sooner rather than\nlater because England's advantage was fleeting11. In response to a request from Dinwiddie for\nBritish troops, Newcastle intended to send money to raise and equip colonial troops, but the\nDuke of Cumberland, a party member, convinced King George II to send General Braddock with\ntwo regiments instead. Sending General Braddock to North America was a turning point, where\nafter both sides were forced to act aggressively and send resources from Europe to the colonies\nin order to counteract the other's actions. Newcastle agreed to this plan on the condition that the\nmission remained secret because he did not want the French to have an opportunity to take\neffective countermeasures, but the war party leaked the mission to the London press because\nthey believed Britain had a window of opportunity12. One of the flaws with this belief is that the\ncolonies were not as vulnerable as the British believed, as shown by the colonial troops faring\nmuch better than Braddock's troops, who were unprepared for the type of fighting and\nsubsequently decimated by the French and Indians.13 They also believed their worldwide\nmilitary advantage was waning because the French were building up their fleet, but the French\nfleet was still significantly behind. These falsely perceived windows fueled the war movement\nbecause the British now believed that, as declining state, it ought to attack early on to have the\ngreatest advantage. Negotiations with the French were also seemingly useless because there was\na perceived credible commitment problem14, in which the French could not be trusted to uphold\nany peace promises if their power was increasing beyond that of the British. As these beliefs\n11 Smoke, War: Controlling Escalation, 202.\n12 Smoke, War: Controlling Escalation, 202.\n13 Smoke, War: Controlling Escalation, 203.\n14 Smoke, War: Controlling Escalation, 222.\n\nwere spread throughout the English government, it was hard for Newcastle to continue his\npursuit of peaceful negotiations. These seemed even less likely to succeed because ministers\nbeneath him who were members of the war party, such as the Undersecretary of the War Party,\nwere circumventing his approval by influencing the king directly15. Consequently, when it came\ntime to negotiate in 1755, the negotiations were hastily done because both sides wanted to\nresolve disputes before their power waned and were ill-informed of the intentions of the other\nfrom a plethora of misperceptions. In effect, the warmongering individuals in London\noverpowered the prime minister's peace efforts and exacerbated the misperceptions about British\nand French relative power.\nThe influence exerted by the war party was significant enough that even with a free and\nindependent press established in North America to clear up misperceptions, these individuals\nwould have likely still started a war for fear of waning world dominance, so it is therefore\nnecessary for the Lebon Peace Fund to fund a peace party in London. Although it will not be a\ndistinctly separate political party, starting immediately, lobbyists will be paid to convince\nministers and cabinet members that peace and peaceful negotiations are in the best interest of the\nCrown. The Lebon Peace Fund will pay for several London press organizations to pursue a\nsmear campaign that criticizes the growing debts of the Crown and attributes them to\nwarmongering efforts by members of the war party. By reading newspapers and pamphlets, the\ngeneral public will be made to understand that these debts incurred through unnecessary wars\nwill be paid for through increased taxes, which will paint the war party very unpopular. New\nwould also discuss how the French navy development was not as impressive as government\nofficials had come to believe, which will assure the public and the cabinet members that there is\n15 Higonnet, The Origins of the Seven Years' War, 76.\n\nnot a window of opportunity. The combination of lobbyists, the public's negative association\nwith the war party, and the news from American press that Dinwiddie was exaggerating the\nstatus of the French threat will have several members of Cabinet agreeing with Newcastle that\npeaceful negotiations with the French ought to be pursued in 1754. Furthermore, several cabinet\nmembers who were being advised by individuals from the Lebon Peace Fund or paid through\nlobbyists will gain influence in the British government, and the peace party will soon begin to\ninstill in King George II the belief that the colonies, with such a sizeable population, should be\nable to unite and defend themselves against a significantly smaller French threat. Therefore, if\nthe call for Braddock's troops was still made in 1754, the king would not listen to the members\nof the war party and instead side with Newcastle to simply send money to help raise and enlist\ncolonial troops. The peace party funded by the Lebon Peace Fund would make effective\ncountermeasures against the influence of the war party and reduce the perceptions of windows of\nopportunity.\nWith all of that being said, an outbreak of war in the North American colonies seems\npreventable. In spite of the vague border definitions leftover from the Treaty of Aix-la-\nChappelle, English and French skirmishes may only be limited to minor conflicts in the North\nAmerican conflict if the greater issue of misperception is handed. The free, independent press\nagencies in North America will prevent corrupt governors from misleading their superiors into\nbelieving their colonies are being threatened, and the development of the peace part in London\nwill counteract warmongering politicking for the sake of ensuring worldwide dominance. Both\nof these projects will be supported by the Lebon Peace Fund. The Lebon Peace Fund is fully\ncommitted to helping alleviate these issues by implementing comprehensive reform that will\nmaintain peace between the world powers of Great Britain and France for the next fifty years or\n\nso. For the time being, the British colonies will be allowed to expand and occupy lands further\nwest, and the French will be allowed to use the Ohio River to maintain connections between\nNew France and Louisiana. However, in the end, it seems most likely that the French endeavor\nof North American dominance will fail because they do not have a sizeable enough population\ncompared to the British. In the future, France will most likely realize this and pull their resources\nout of the North American continent and invest more into their sugar-producing islands in the\nCaribbean.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "17.42_S18 Second Paper Assignment: A More Disastrous World War II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/40ae522584ba3a8e071979d4ca95cb9e_MIT17_42S18_MoreDisastrousWWII.pdf",
      "content": "17.42\nMIT Student\nProfessor Van Evera\nA More Disastrous World War II\nWorld War II, the most devastating war in world history, followed the 1919 Versailles\nPeace, the most elaborate and determined effort to ensure world peace. It is safe to say that the\nconditions which would have prevented World War II are difficult to imagine if limited to the\nexisting technologies and political strategy of the time. Western democracies clung onto\nisolationism as a means to avoid engaging in war, and as a result, aggressive, expansionist\ndictatorships flourished. However, if the causes of the war were to be reexamined in light of a\nnuclear revolution occurring around 1920, the events of World War II are undoubtedly changed.\nConsider a situation in which by 1933, only Germany, Britain, France, the Soviet Union, and the\nUnited States have large nuclear second-strike counter value capabilities, meaning these nations\nhave the ability to launch a nuclear force aimed at a civilian population after withstanding a full\nscale nuclear attack. Although it may seem that the existence of such nuclear weapons would\ndeter states from being aggressive, the start of World War II would have remained the same\nbecause Germany was intent on greatly expanding their borders, and the Allied Powers\nwere adamant on pursing a policy of appeasement. The end of World War II, however,\nwould be much more intense due to the fact that Germany is on the verge of losing, and\nHitler would become a derailed, irrational head of state.\nRegardless of the existence of nuclear weapons, Germany would be insatiable because\nthe German people were convinced that they needed to expand their borders to secure their\n\ncountry after being treated so unfairly post World War I. The German government went to great\nlengths to convince the public that they were innocent, setting up a secret public relations\ncampaign that blamed other nations for the war.1 In the 1920's, German schools and scholars\nwere told and propagated lies about the Entente powers instigating the war, and the Jews and\nSocialists losing the war.2 The German government also promoted the publishing of pro-war\nliterature, which often glorified the personal experience of the war, and consequently promoted a\nculture where war and military tradition was highly valued.3 This propaganda campaign would\nhave happened whether or not Germany had a large nuclear arsenal. Those in charge in the\nGerman government needed nationalist mythmaking to justify their actions from the previous\nwar in order to stay in power. They also needed to establish nationalist citizens in order to\nmaintain a functional state where civilians paid taxes and wanted to serve in the military.\nFurthermore, the Great Depression of 1929 hit Germany the hardest, and many Germans\nattributed this to the harsh conditions that had been imposed on Germany from the Treaty of\nVersailles.4 The depression and the nationalist myths brought forth German hatred of the Allies\nand German insecurity, especially regarding food. Eventually, this train of thought would lead to\na call for an empire, with which Germany would be able to have secure, food-producing lands.\nHowever, in order for Germany to have a large nuclear force by 1933, they needed to have put\ntogether a large industrial workforce in a few years after the depression to support the nuclear\nrevolution. A work force mobilization aimed towards the development of nuclear weapons\nwould allow Germany to use of the weapons as leverage to expand its borders, thereby\nestablishing a secure state. As a result, the general sentiment of the German population would\n1 Stephen Van Evera, Origins of the Second World War (Massachusetts Institute of Technology, 2018), 1.\n2 Van Evera, Origins of the Second World War, 1.\n3 Wolfram Wette, The German Military in the Age of Total War (Dover: Berg, 1985), 81.\n4 R.R. Palmer and Joel Colton, A History of the Modern World (NY: Knopf, 1991), 825.\n\nstill be pro-expansion with the nuclear revolution because the German government\noverwhelming promoted a sense of militant nationalism.\nAnother cause of World War II that would remain unchanged with the advent of the\nnuclear revolution is the isolationist attitude of other countries, such as Britain, France, and the\nUnited States. The First World War was widely seen as pointless and a consequence of war\npropaganda, so western powers believed that war could not break out if one side refused to be\nprovoked.5 For Britain, this mentality was motivated by the large losses they suffered during the\nwar. Many British also fell victim to German propaganda and started to believed that the Treaty\nof Versailles was too harsh or that the Germans should allow to expand. These beliefs were also\napplicable to the French, as they were also eager to avoid war after having suffered greatly\nduring the First World War. The French were absorbed in domestic left-right conflicts, in which\nmany French of the right were sympathetic to Hitler and Mussolini, so they were either distracted\nfrom or sympathetic to Germany's early expansions.6 Meanwhile, the United States embraced\nisolationism to the such an extent that Congress passes a series of neutrality laws from 1935\n1939 that required the U.S. remain neutral in the event of a war elsewhere.7 All of these actions\nencouraged Germany to go on an expansionist rampage. Hitler was able to remilitarize the\nRhineland and acquire Austria, the Czech Sudetenland, the Czech rump, and Memel by 1939, all\nwithout any meaningful protest from the western powers.8 The Allied powers were foolishly\nhoping that each piece of territory Germany acquired would be its last, that Hitler would be\nsated. They would not have threatened a nuclear attack over these early acquisitions because they\nwere so firmly entrenched in their isolationism, and they would not risk the total destruction of\n5 Palmer and Colton, A History of the Modern World, 835.\n6 Palmer and Colton, A History of the Modern World, 835.\n7 Palmer and Colton, A History of the Modern World, 836.\n8 Palmer and Colton, A History of the Modern World, 841.\n\nany of their cities over lands that they were somewhat sympathetic to Hitler acquiring. Even\nwhen Poland was invaded and they decided to take a stand and denounce Hitler, the Allied\npowers would not have engaged in nuclear war for fear of mutually assured destruction. The\nthreat of the Allied powers using nuclear weapons after so many years of appeasement would\nalso not be taken seriously by Hitler. Additionally, Hitler would not use nuclear weapons not\nonly because he wanted to avoid mutually assured destruction but also because of how effective\nthe German army and Blitzkrieg strategy were. In effect, the nuclear revolution was unable to\nprevent the isolationist and appeasement strategy of the Western powers encouraging Germany's\naggressive expansion.\nIn fact, nuclear weapons would not be used for most of the war, even when nations were\nmost desperate. As France was the first nation with nuclear capabilities to fall, the question arises\nof whether or not France would use nuclear weapons as part of a last minute, desperate attack on\nGermany. However, given the defensive strategy the French have previously employed, this\nseems unlikely. Having lost about 1.4 million Frenchmen and half of all males between the ages\nof 20 and 32 in 1914, the French were incredibly wary of losing more lives.9 The political\nstrategists would have understood that bombing Germany's military would not have effectively\nstopped Germany's ability to retaliate and would have only resulted in their worst fear: a\ncountervalue attack. The French would also have to engage in this nuclear attack on their own,\nwithout the support of Britain because the British would most likely be unwilling to engage in a\nnuclear war and risk their own cities being destroyed, and the same would apply for the United\nStates or the Soviet Union. Due to the fact that the French would not have the backing of any\nother major power in using nuclear force on Germany, they would most likely accept defeat.\n9 Palmer and Colton, A History of the Modern World, 835.\n\nSimilarly, the Soviet Union is another country that was at risk of losing and perhaps would have\nbeen desperate enough to consider the use of nuclear weapons. In 1941, the Germans made huge\nadvances into the Soviet Union, killing millions of Soviet soldiers, and the situation seemed\ndire.10 However, Stalin highly valued Soviet cities such as Moscow and Leningrad and made\ngreat efforts to defend them. He would not have wanted to use nuclear forces against Germany\nbecause he believed that the Red Army would eventually be an effective defense for the cities,\nand he would have known that launching a nuclear attack would drive the Germans to nuke\nSoviet cities.\nThe most notable impact that nuclear weapons would have on World War II would occur\ntowards the end of the war, when it was clear that Germany was losing. Unlike the French and\nSoviet leaders, Hitler had long established that \"the fate of the Reich depends on [him] alone,\"11\neffectively aligning Germany's life and death with his own. As the German situation became\nmore and more desperate, without nuclear weapons, Hitler's only option would have been to\naccept defeat and begin negotiations, but to him, this would have meant suicide. With nuclear\nweapons, Hitler would have looked to nuclear force as a means to end the war, even if it meant\nrisking the death of a significant portion of his civilian population. Hitler would have struck\nGreat Britain's industrial centers first, in order to cripple their war effort, but at this point in the\nwar, Great Britain's forces were not the primary threat to him. They were exhausted. However,\nhis ability to stop the influx of American resources and military was limited because launching a\nnuclear strike across an ocean would have been much more difficult. Hitler needed to strike the\nBritish, accept a countervalue strike, and defeat them in conventional warfare, all before the\nAmericans had a sizable presence on the European continent. The chance of an attack being\n10 Palmer and Colton, A History of the Modern World, 847.\n11 Sebastian Haffner, The Meaning of Hitler (Harvard University Press, 1983), 28.\n\nenough for the Germans to win the war would have been extremely slim, given the American\nentrance into the war, but it would have been a better alternative to giving up and committing\nsuicide. Hitler's desperation to win the war would not have allowed him to make a decision that\ncould have limited the damage. In fact, by the end of the war, Hitler's health had been declining,\nwhich suggests that he may not have been that rational decision maker.12 Without a rational head\nof state, the strategy behind mutually assured destruction falls apart because there is no longer a\ndeterrable actor involved.13 As a result, Hitler's irrational tendencies at the end of the war would\nhave provoked a nuclear attack on Great Britain and created a much more intense end to World\nWar II.\nIn summary, nuclear weapons would not have been able to prevent World War II from\noccurring. The German people were too riled up about expanding far beyond their borders, and\nthe Western powers were insistent on staying out of any potential conflict. As a result, a clear\npath was left for Hitler to develop Germany's military and nuclear force and to pursue a German\nempire. The fear of mutually assured destruction would limit conflicts to conventional warfare\nbut only so long as all heads of states were rational. Upon German's defeat, Hitler would have\nlaunch a futile nuclear assault on Great Britain, and the resulting nuclear warfare would have\ncaused even more casualties. In this scenario, the nuclear revolution occurring by 1933 would\nhave only worsened the suffering of all parties and would not have been an effective means of\npreventing conflict. Misunderstandings about the origins of war from both the Allied and Axis\npowers were too great for the deterrence of nuclear weapons to work.\n12 Haffner, The Meaning of Hitler, 59.\n13 David Ziegler, War, Peace, and International Politics (Little, Brown and Company, 1981), 277.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 10: Great Wars of European History, 1740–",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/f9dd7d01c41ef6951def531f48ec577c_MIT17_42S18_lec10_GreatWars.pdf",
      "content": "Stephen Van Evera / for 17.42\nGREAT WARS OF EUROPEAN HISTORY, 1740\n1. The War of Austrian Succession, 1739-1748. Prussia and\nallies vs. Austria and allies. Prussia seeks Silesia in order to\ngrow Prussian power, increase Prussian security. Prussia wins,\ngains Silesia.\n2. The Seven Years' War: Anglo-French, 1756-1763. Britain v.\nFrance. Brits win.\n3. The Seven Years' War: Continental, 1756-1763. Prussia v.\nAustria, Russia, France. Austria tries to recover Silesia,\nfails. It ends in a bloody draw.\n4. American Revolution, 1775-1783. U.S. colonies v. Britain.\nU.S. wins independence. But this was more of a sidebar than a\ngreat war.\n5. French Revolutionary and Napoleonic Wars, 1792-1815. France\nvs. Austria, Prussia, Russia, Britain, others. France loses.\nFrench monarchy restored, several million people killed. Causes:\nrevolutionary France and its oligarchic neighbors each feared\nsubversion by the other. France attacked others when it felt it\nhad a fleeting advantage. The French also hoped they could\nspread revolution throughout Europe. In short security fears and\nperceived offensive opportunities, plus windows, fueled the war.\nAftermath: the Concert of Europe.\n6. Crimean War, 1854-56. Russia v. Britain, France, Ottoman\nEmpire (Turkey). Britain, France & Ottoman Empire defeat Russia.\n825,000 people killed. Main cause: a tangle of misperceptions.\n(1) \"The Russians Are Coming!\" The British and French held ill-\nfounded fears of Russia. (a) They had illusions of Russian\npower: \"Russia is the strongest state in Europe!\" Russia\nactually was mired in backwardness, no where close to being top\ndog. (b) They had illusions of Russian expansionism: \"Russia\nplans to carve up Turkey!\" Russia had no such plans. (2) \"The\nFrench are coming!\" Russia, thinking back to 1792-1815, had ill-\nfounded fears of a \"revolutionary\" France and wrongly thought\nthat Britain and Austria shared these fears. (3) \"The Turks Are\nCollapsing.\" Russia falsely expected Turkey's imminent demise.\nTurkey actually took decades to collapse. Other causes: (4)\nReligious conflict--\"The Quarrel of the Monks,\" 1690-1852.\nCatholics and Orthodox Christians quarrel over control of the\nChurch of the Holy Sepulcher in Jerusalem and other Christian\nholy sites in Palestine. France favors Catholics, Russia backs\nOrthodox. Landlord Turkey must referee. The trouble starts\n\nhere. (5) Russia uses bullying tactics against Turkey over\nOrthodox religious rights issues. This leads others to wrongly\nbelieve Russia has wider aggressive intentions. (6) The French\nleader (Napoleon III) is an insecure and irresponsible demagogue\nwho inflames religious issues to play to the French crowd--a\nsymptom of the fact that France is in early process of\ndemocratizing? (7) Russia seeks agreement on how to partition\nTurkey, suggests a Russian-British agreement on terms of\npartition. Britain doesn't think the Ottoman empire's collapse\nis immediate and believes Russia's suggestions that it be\npartitioned is a veiled threat to destroy it. This causes false\nBritish alarm at Russian intent.\n7. Wars of German Unification, 1864-1871. Prussia v. Denmark,\n1864, Prussia wins. Prussia v. Austria, 1866, Prussia wins.\nPrussia v. France, 1870-71, 250,000 killed, Prussia wins.\n8. World War I, 1914-1918. The Central Powers (Germany and\nAustria) v. the Triple Entente (Britain, France, Russia).\nEntente wins. 20 million people killed.\n9. World War II, 1939-1945. The Axis allies (Germany, Italy,\nJapan) v. Grand Alliance (Britain, France, Poland, USSR, United\nStates, others). Allies win.\n35-60 million people killed.\n10. Cold War, 1947-1989. Soviet Union v. NATO, Japan and\nothers. Hot wars waged as part of the Cold War: Korea 1950-53\n(2-4 million killed), Vietnam 1945-75 (2.5 million killed),\nAfghanistan 1979-92 (1 million killed), Angola 1975-91 (1 million\nkilled), Cambodia 1979-89 (64,000 killed), Nicaragua 1983-91\n(30,000 killed), El Salvador 1979-89 (70,000 killed), Guatemala\n1954-96 (200,000 killed), Indonesia 1965 (500,000 killed), East\nTimor 1975-1999 (200,000 killed), and others. NATO wins.\n11. The War of Civilizations (\"War on Terror\")? 2001-.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 10: The Anglo-French Seven Years' War",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/a8a5d899343240739a9bfcf13cab3a3e_MIT17_42S18_lec10_7YearsWar.pdf",
      "content": "Causes and Prevention of War // MIT\nStephen Van Evera\nTHE ANGLO-FRENCH SEVEN YEARS' WAR, 1756-1763: AN INADVERTENT WAR?\nAN AVOIDABLE WAR?\nI. INADVERTENT WAR: war caused by actions that actors did not\nexpect or desire would cause war. Some believe inadvertent wars\nnever happen, other think they are common. Was the Seven Years'\nWar an inadvertent war? Was it avoidable?\nII. BACKGROUND TO WAR\nThe Seven Years' War was a worldwide Anglo-French battle for\nempire. Americans call it the French and Indian War but it\ncould be called the first world war. It saw fierce Anglo-\nFrench fighting in the Caribbean, South Asia, West Africa, and\nNorth America. Britain won but with little enduring gain.\nBackground factors:\nA. Mercantilism. Before 1756 the European powers scrambled for\ngold to pay mercenaries, hence for trade surpluses, hence\nfor empire.\nWhat changes would have prevented war?\n> New ways to tax, to increase the state's tax base?\n> Better scholarship explaining the economic\nefficiencies of free trade and the costs of\nmercantilism (e.g., David Ricardo's 1816 writing\noutlining the Theory of Comparative Advantage--it\narrived too late!)\n> Cheaper strategies for national defense (e.g.,\nguerilla war) to replace expensive cash-dependent\nmercenary war & naval war?\nB. The incomplete partition of North America. France had\nQuebec. Britain had what became the U.S. eastern seaboard.\nBut who owned the Ohio Valley wilderness? This was left\nundecided by the Treaty of Aix-la-Chapelle (1748), which\nended the last big war (the War of Austrian Succession,\n1739-48).\nC. Military facts:\n1. Britain and France were the only powers with global\nmilitary reach.\n2. The British navy was twice the strength of the French\nnavy but France had far the stronger army.\nD. Economic facts: in 1748 a group of Virginians including\nVirginia Gov. Robert Dinwiddie form the Ohio Company to\ncolonize and develop the Ohio Valley and to enrich\nthemselves. They obtain a vast land grant of initially\n200,000 acres (312.5 square miles, an area 20x16 miles) in\nthe Ohio Valley from the British Crown, with 300,000 more\nacres to come if they achieve settle 100 families in the\nterritory in 7 years. Total: 500,000 acres, or 781 square\nmiles, an area 20x38 miles. Lots of $$$ on the table for\n\nDinwiddie & Friends!\nE. Chronology:\n1. During 1752-53 France destroyed a British trading post\nin the Ohio Valley and built two forts of its own there,\nat Presque Isle and Fort Le Boeuf.\n2. During 1753-54 Britain sent three expeditions to the\nOhio Valley to eject the French. All three failed.\n> Fall 1753: A Virginian expedition to Fort Le Boeuf,\nsent to warn the French to leave the Ohio Valley (and\nled by George Washington), was ignored and came home.\n> February 1754: Virginians established a fort at the\nconfluence of the Allegheny, Monongahela and Ohio\nrivers (now Pittsburgh). The French conquered it,\nrenamed it Fort Duquesne, and expelled the British.\n> May-July 1754: Virginians commanded by George\nWashington entered the Ohio Valley on a fort-building\nmission. They learned of the nearby presence of a\nforce of 36 French troops sent into the Valley with a\nsummons to warn any British troops or traders to leave\nthe Valley (same as Washington did at Fort Le Boeuf).\nWashington's troops ambushed this French force at\nJumonville Glen (the first fighting in the war),\nkilling 10 including the French commander, May 28.\nWashington's force then pulled back and erect Fort\nNecessity in an effort to establish a defensible\nposition. A larger French and Indian force then\narrived and defeated this British force at Fort\nNecessity. The British surrendered and came home.\n3. In early 1755 Britain sent two army battalions under\nGeneral Braddock from Britain to America to eject the\nFrench from the Ohio Valley. The British claimed\nBraddock's instructions were purely defensive. The\nFrench, who knew Braddock's instructions, thought the\nOhio Valley was theirs, hence they saw his expedition as\naggressive.\n4. Braddock led his two battalions into the Ohio Valley\ntoward Fort Duquesne, aiming to eject the French.\nBraddock's force was annihilated and Braddock was killed\nby the French and Indians at the Battle of the\nMonongahela, July 9, 1755. A fiasco.\n5. Meanwhile ... In May 1755 France countered by sending\nsix army battalions to America aboard 1/3 of the French\nbattle fleet, stripped of its guns.\n6. In June 1755 Britain's Admiral Boscawen tried to\nintercept these six French battalions off Newfoundland.\nIt captures only 2 of 18 French ships.\n7. Britain and France halted negotiations and war erupted,\nMay 18, 1756.\nF. This was a war of illusions. Four types of misperceptions\nto look for:\n1. Of one's own conduct. \"We are being benign!\"\n2. Of the other's conduct and intentions. \"They are being\n\naggressive!\"\n3. Of the other's likely response to one's own acts.\nGovernments expected their threats to elicit compliance\nbut they evoked defiance. Britain's deployment of\nBraddock evoked unexpected French counter-escalation\n(its six-battalion deployment); and this French counter-\nescalation evoked further British counter-counter\nescalation unexpected by France.\n4. Of the value of the stakes in dispute. This value was\ngreatly exaggerated by British and French leaders.\nWhat changes would have prevented war??\n> Enact British business regulations that forbid conflicts\nof interest by government officials, including the\ngiving of royal land grants to government officials\n(Dinwiddie) and/or the acceptance of royal land grants\nby these officials; and forbidding the giving of land\ngrants in territory disputed with another power?\n> Develop a professional British intelligence agency (like\ntoday's MI6), to preclude the role of local business\npeople with conflicts of interest (like Dinwiddie and\nShirley) in British intelligence-collection?\n> Develop of an independent British press with a culture\nof integrity, to provide transparency into situations\nlike the Ohio Valley conflict of 1753-56, to dampen\nmisperceptions about it?\n> Somehow make British officials in London aware of the\nattitudes of the English colonists: \"We will only stick\nwith British rule as long as we face a threat from the\nFrench and the Indians!\"\n> Teach about the spiral model in British and French\nschools, as a self-denying prophecy.\n> Assassinate Dinwiddie?\n> Would war have occurred if Britain and France had\npossessed secure nuclear arsenals?\nIII. CAUSES OF THE SEVEN YEARS' WAR\nA. Misperceptions. Do these constitute a Jervis spiral?\n1. Britain misperceived:\na. The nature of the status quo -- \"Ohio belongs to us!\"\n> Virginia Governor Dinwiddie described the Ohio Valley\nas \"British property\" in communiques to London (making\nthe French \"invaders of British property\" in one of\nhis communiques). But Ohio wasn't British--its\nownership was undecided.\nb. French conduct--Britain exaggerated the aggressiveness\nof French behavior.\n> Dinwiddie told London that \"the French have invaded\nEast of the Alleghanies!\" (but they hadn't), and were\npreparing a general invasion of North America (but\nthey weren't).\n> Massachusetts' Governor Shirley told London \"the\n\nFrench have invaded Massachusetts!\" (but they hadn't).\n> Dinwiddie wrote London that the French were attacking\n\"the forces of this Dominion\" in the Ohio Valley (but\nthese forces were Ohio Company mercenaries, not\nBritish government troops). In his dispatches the\nOhio Company fort-builders became \"our people\" and the\nfort was \"our fort,\" wrongly implying that they were\nBritish government personnel and property.\nc. French intentions--Britain exaggerated French\nexpansionism.\n> Dinwiddie told London \"the French are planning a\ngeneral invasion of British North America!\" (but they\nweren't).\nd. British conduct--Britain underestimated the\naggressiveness of its own behavior.\n> Dinwiddie failed to report his own fort-building in\nthe Ohio Valley.\n> Dinwiddie failed to report his collaboration with\nIndians fighting against the French in the Ohio\nValley.\nConsider that misperceptions like these can feed each\nother, as follows: misperceptions of the status quo -->\nfalse belief that another's defensive actions are\naggressive --> exaggeration of the other's aggressiveness\n--> misperception of how the other will react to\npunishment. Some of this probably happened here.\n2. France suffered similar misperceptions, though we know\nfewer details.\n3. Additional beliefs and misperceptions (did some grow from\nthose above?):\na. Both sides saw the other as very expansionist.\nb. Both sides thought a tough policy would persuade the\nother side to back down. In fact the other counter-\nescalated in response.\ni.\nBritain thought France would not counter\nBraddock's 2-battalion deployment. But France did\ncounter with 6 battalions.\nii. France thought Britain would not counter its 6\nbattalion deployment. But Britain did with\nBoscawen's naval attack on that deployment.\nc. Both sides were reluctant to negotiate, because:\ni.\nThey thought the other would take their\nwillingness to talk as a sign of weakness.\nii. They thought concessions would injure their\ncredibility.\niii. They thought negotiations were pointless, wouldn't\nsucceed.\nHowever, without talks misperceptions on both sides\nwent undiscovered.\nWere both sides applying the deterrence model to a\nspiral situation?\n\nWhat changes would have prevented war? How about\nusing Track II diplomacy--having private citizens who\nare close to the government unofficially exchange views\non solutions?\nd. Britain exaggerated the value of the stakes at issue.\nBritain thought that by beating France it could\nconsolidate control over North America. In fact\nBritain's victory cost it North America. British\nvictory removed the French threat to Britain's North\nAmerican colonies. The British colonists felt less\nreliant on London's protection, hence less willing to\ntolerate rule from London. Hence they rebelled in\n1775-1776. Washington & Co. stuck it to the Redcoats.\nB. Non-settlement of disputes: the 1748 Treaty of Aix-la-\nChapelle had gaps.\nC. Four windows of opportunity or vulnerability:\na. Britain saw a waning British worldwide military\nadvantage over France. British leaders thought Britain\nwas better prepared for war than France but also saw\nFrance building up its fleet.\nb. France saw British power growing. The French saw\nBritain making alliances on the European continent\n(e.g., with Spain) and expanding into the Ohio Valley.\nc. The British deployment of Braddock's 2 battalions to\nNorth America in winter 1755 caused France to perceive\na tactical window: \"We must deploy offsetting forces to\nNorth America before a war starts and Britain closes\nthe seas; we can't do it later.\"\nd. The subsequent French 6-battalion deployment to North\nAmerica on disarmed French warships created dual\nBritish windows of opportunity and vulnerability: \"We\nhave a fleeting opportunity to destroy a third of the\nFrench fleet,\" and \"If we don't strike the French will\ngain military superiority in North America!\"\nNote: windows 'c' and 'd' were unwitting results of\ngovernment decisions.\nWhat changes would have prevented war? Better national\nsecurity analysis in London and Paris? One of these\ncapitols had to be wrong in seeing a window, as two\nopposing windows cannot co-exist at the same time. Also,\npreventive wars rarely look wise in retrospect. Good\nscholarship might have illuminated these realities,\ndiscouraging decisions for war.\nE. Competition for control of cumulative resources; also,\ncompetition for security.\nF. Expectation of a cheap, limited war.\nIV. OUTCOME: BRITAIN WINS WAR --> BRITAIN LOSES ITS AMERICAN\nCOLONIES (!)\nV. ESCALATION OF THE SEVEN YEARS WAR\n\nBritish leaders tried to limit the war to North America but\nfailed.\nVI. AN INADVERTENT WAR? Historians once explained this war as\nthe product of calculated aggression by great empires. Now many\nbelieve it was an inadvertent war. Who is right?\nVII. CURRENT PARALLELS: The Russia-NATO conflict over Ukraine,\nthe China vs neighbors conflict over South China Sea, a possible\nUS vs. Clina clash over spheres of influence in North Korea\nshould the North Korean government collapse, ongoing conflict\nbetween the Turks, Kurds, Iranians, Russians, Syrian government\nand US over the carcass of the ISIS state, and the looming Arctic\nconflict are conflicts over domains where rights are unsettled.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 12-14: The Austro-Prussian War of 1866 / The Franco-Prussian War of 1870",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/035590cbbc067a10812f29f12975e953_MIT17_42S18_lec12-14_Prussian.pdf",
      "content": "Causes and Prevention of War // 17.42 // MIT\nStephen Van Evera\nTHE AUSTRO-PRUSSIAN WAR OF 1866\nI. BISMARCK'S PLAN TO UNIFY GERMANY: \"LET'S BAIT AUSTRIA INTO\nSTARTING A WAR!\"\nIn 1866 Germany was divided into several dozen mini-states,\nof which Prussia was the largest. Prussia's Chancellor Otto\nvon Bismarck (1862-1890) sought to unify Germany under\nPrussian leadership. Main reasons: Prussia was geographically\nnot contiguous, had long borders, and had a smaller total\npopulation than other European powers. This left Prussia\ninsecure, and left Germany ripe for a rerun of the epic ruin\nit suffered at the hands of other powers during the Thirty\nYears' War (1618-1648). A united Germany would have better\nborders and more resources, and so be more secure.\nToward the goal of dominating Germany Bismarck sought to\nremove Austrian influence in southern Germany by war. He saw\nthree prerequisites for this campaign. (1) France, Britain\nand Russia had to be induced to stay neutral while Prussia\nbeat Austria. A very tall order! Major states almost never\nallow other major states to increase their power by war. (2)\nThe Prussian king had to be induced, against his sentiments,\nto declare war on his brother-German Austrians. (3) Prussian\nwar aims had to remain limited. If Prussia pursued large aims\nit would likely provoke other powers to intervene to reverse\nits gains. It could reduce this risk by pursuing strictly\nlimited aims. This required tight civilian control of\nPrussia's expansion-minded military.\nBismarck's three solutions: (1) Prussia would sweet-talk\nthe other European powers into not fearing Prussia, by talking\ndown Prussian power and persuading others that Prussian aims\nwere limited, even benign. He thought: \"If other powers don't\nfear Prussia they will more readily allow it to grow,\nexpanding its power.\" (2) Bismarck would bait Austria into\nstarting the war. He thought: \"If Austria acts aggressively\nit will alienate the other powers and thus be without allies;\nand the Prussian king will be outraged at Austria and declare\nwar on it.\" (3) Bismarck would persuade the Prussian king to\ntightly control Prussia's tactically brilliant but expansion-\nminded Chief of Staff Helmut von Moltke the Elder. Bismarck\nthen could keep Prussian war aims tightly limited, and could\npromptly end the war when these aims were achieved. This\nwould avert intervention against Prussia by Russia, France and\nBritain.\nII. BACKGROUND TO WAR: EVENTS AND CONDITIONS\nA. Bismarck's deceptions.\n1. Deceptions regarding Prussian capability: \"We're\nweak!\" These deceptions were aimed chiefly at\nBritain, France, and Russia, but also fooled Austria\n\ninto false optimism.\n2. Spin regarding Prussian intentions: \"We're benign!\"\nBismarck sent the Schweinitz mission to Russia to\nproclaim that Prussia had limited aims.\n> Note: Prussian intentions were in fact limited.\nAfter defeating France in 1871 Bismarck proclaimed\nGermany \"sated.\" But after Bismarck left office in\n1890 Germany's appetite grew vastly. Bismarck\ncould not speak for his successors.\nB. Britain, France, and Russia were indifferent to containing\nPrussia, in part due to Bismarck's deceptions.\n1. Britain feared France more than Prussia, and was\ngenerally isolationist.\n2. France failed to foresee that Prussia would win a\nquick, decisive victory, instead expecting a long\nfratricidal Prussian-Austrian war. It saw advantage\nin such a war, thinking: \"We can demand the Rhineland\nas our fee for breaking the stalemate for the victor.\"\n3. Russia felt solidarity with Prussia against the Poles,\nwhom they both cruelly oppressed and who hated them\nboth. Russia also was distracted from central\nEuropean affairs by its focus on undoing the\ndemilitarization of the Black Sea, imposed by Britain\non Russia in the peace that ended the Crimean War in\n1856.\nC. Prussia signed a 3-month offensive alliance with Italy,\nApril 8, 1866. Terms include giving Italy parts of\nsouthern Austria. This was a provocation and threat to\nAustria.\nD. Austria mobilized its army against Italy and Prussia,\nApril 21, 1866--a fateful step. Why did Austria take it?\n1. Austria received false reports that Italy was\nmobilizing, and mobilized very quickly in response.\nWhere did these false reports come from? Maybe the\nAustrian military deceived its civilians; or perhaps\nBismarck deceived Austria. Alois Karoly, Austrian\nminister in Berlin, believed Bismarck was the source\nof the falsehood.\n2. Why did Austria mobilize against Prussia as well as\nItaly?\na. Austrian leaders assumed Prussia had already\ndecided for war. They didn't realize that Prussia\ncouldn't start a war if Austria didn't move first.\nb. Austria had only one mobilization plan. It\nposited a 2-front mobilization.\n3. Results: Prussia's king was outraged, opted for war\nagainst Austria; and Britain, France and Russia stood\naside indifferently. The table is set for Prussian\nvictory.\nIII. WARTIME EVENTS:\nA. In Prussia there was bitter civil-military conflict over\nwar aims. The Prussian army said: \"Let's smash Austria\n\ncompletely! And perhaps France!\" Bismarck sarcastically\nresponded: \"Why not go all the way to Constantinople?\"\nThe army didn't get its way--fortunately for Prussia.\nB. Prussian war aims nevertheless did modestly widen.\nPrussia excluded Austria from Germany instead of dividing\nit with Austria at the Main river.\nIV. CAUSES OF THE WAR? PERHAPS AMONG THEM:\nA. Austria's false optimism.\nB. Prussia's search for security; and Prussia's offensive\nopportunity.\nC. Bismarck's baiting, and Austria's unwise decision to take\nthe bait.\nV. WHAT CAUSED THE PEACE? AN EMERGING DEFENSIVE ALLIANCE\nAGAINST PRUSSIA.\nVI. WAS A NEGOTIATED SOLUTION TO THE CRISIS POSSIBLE? PROBABLY\nNO--SCARY THOUGHT. To get Austria to concede peacefully Bismarck\nwould have had to scare Austria by showing muscle and a will to\nfight. But that would have mobilized the other powers against\nPrussia, tipping the overall balance of power against Prussia.\nSo Bismarck could not use coercive diplomacy.\nTHE FRANCO-PRUSSIAN WAR OF 1870\nI. BACKGROUND\nA. Bismarck's goal: to provoke France into serving as a bogey\nthat Bismarck could use to tighten Prussia's grip on the\nlesser German states. Baiting!\nB. Bismarck continued/repeated his deceptions: \"We're weak\nand we're benign!\"\nC. Bismarck's provocations to France:\n1. He authored a Hohenzollern candidacy for the Spanish\nthrone, to spark French fears of Prussian encirclement\nof France.\n2. He edited a telegram to the French--the Ems telegram-\nto make it seem insulting to France. This telegram\nsummarized an informal conversation between Prussian\nKing William I and French ambassador Vincent Benedetti\nin July 13. Ir was drafted by Prussian royal\nsecretary Abeken, then edited by Bismarck and released\nto the press also on July 13. Bismarck happily\nassured friends that the telegram, after his\nrewriting, \"would have the effect of a red flag on the\nGallic bull.\" It was the trigger for French\nmobilization on July 14, triggering war.\nD. Serendipity: the Salazar telegram of June 21 1870 was mis\ntranslated as \"Salazar will return July 9\" not \"June 25,\"\nhence the Spanish adjourned the Cortes to escape the\nsummer heat, hence the election of the new king was\ndeferred, hence the Hohenzollern candidature remained\nalive into July. Accidents matter.\n\nE. Due mainly to Bismarck's deceptions and France's idiotic\nbelligerence, Russia, Britain, and Austria all decided to\nbe unconcerned about the possibility of German victory,\nand so stayed out of the war.\nF. First-move advantage? Michael Howard offers hints that\nFrance perceived such an advantage and mobilized to gain\nit.\nG. France launched military mobilization first on July 14,\n1870, then Prussia on July 15. France declared war on\nPrussia on July 16. Fighting began July 19.\nII. THE WAR: EVENTS\nA. France thought Prussia would take 6 weeks to mobilize its\narmy. In fact it took Prussia 3 weeks to mobilize; and\nPrussia's mobilized army was twice the size of France's\nmobilized army.\nB. The Prussians crushed the French army in 6 weeks, largely\nby inducing the French to unwisely take the offensive.\nC. The French then mounted a long war of guerilla resistance\nagainst Prussian occupying forces. Subduing France proved\nvery difficult.\nD. During the war German aims widened to include keeping\nAlsace-Lorraine. In 1867 Prussia's chief of staff, Helmut\nvon Moltke the Elder, declared: \"We desire nothing from\nFrance.\" But Prussia then demanded Alsace-Lorraine. Why?\nPressure from the Prussian military; and Bismarck saw\nadvantage in keeping France hostile to Prussia!\nE. There was bitter civil-military conflict in Prussia over\nwar aims and military operations. Moltke sought to smash\nFrance utterly, and (wrongly) dismissed Bismarck's fears\nof British or other intervention. Moltke also resisted\ncivilian control over his military operations by keeping\ncivilians in the dark. Bismarck complained that he\nlearned about events on the battlefield only \"five days\nlater in the newspaper.\"\nIII. MORE CAUSES OF THE WAR\nA. The Prussian and French militaries both (!) saw windows of\nopportunity.\nB. Prussia's search for security; and Prussia's offensive\nopportunity. Prussia saw an offensive opportunity arising\nfrom Britain, Russia and Austria's unusual failure to\ncounterbalance Prussia. And Prussia, as always, feared\nfor its safety if it failed to achieve German national\nunion.\nC. France was falsely optimistic about the military outcome\nof the war.\nIV. THE FALSE LESSONS GERMANS LEARNED FROM THE WAR OF 1870:\n\"BISMARCK USED BLOOD AND IRON TO MAKE FRIENDS AND INFLUENCE\nPEOPLE. YOU CAN TOO!\" QUESTION: WHY WAS THIS FALSE LESSON\nLEARNED?\nV.\nBISMARCK PURSUES PEACE, 1871-1890.\n\nAfter the Franco-Prussian war Bismarck deemed that German\nnational aims were achieved and that Germany now needed only\ntwo things: to be at peace, and to avert the appearance of a\noverwhelmingly strong neighbor that could overmatch German\npower. Toward these goals Bismarck sought to prevent\naggression among Germany's neighborhood. This would avoid\nGermany being sucked into wars among its neighbors, and would\nensure that no neighbor won a decisive war that left it\noverwhelmingly powerful. To achieve these two goals Bismarck\nwove a web of defensive alliances with other European states.\nHis web of defensive alliances included Russia and Austria-\nHungary, which were hostile to each other. Germany assured\neach that it would defend them if they were attacked but\nwarned that they would fight alone if they launched\naggression. Result: Europe enjoyed 20 years of peace.\nVI. KEY CHANGES IN GERMAN POLICY AFTER 1890\nA. Germany was sated, 1871-1890; after 1890 it becomes\nexpansionist.\nB. Germany pursues expansion by stealth and deception, 1864\n71; after 1890 it pursues expansion by belligerence and\nintimidation.\nVII. LESSONS OF BOTH WARS AND THEIR AFTERMATH FOR U.S. FOREIGN\nPOLICY\nA. These wars suggest that when offshore balancers don't\nbalance against Europe's continental aggressors, the\ncontinental aggressors get frisky and start wars. Does\nthis lesson still apply?\nB. The aftermath of these wars suggests that the U.S. can\nmaintain peace elsewhere by weaving a web of defensive\nalliances.\nC. Other lessons re: effects of contempt v. respect? Dangers\nof being baited. E.g, some say al-Qaeda sought to bait\nthe U.S. into an imperial lunge into the Mideast in 2001,\nand Bush 43 took the bait. Belligerence v. assurance as\ndiplomatic strategies?\nVIII. PRELUDE TO WORLD WAR I. IMPORTANT CAUSES OF WAR\nDISAPPEARED DURING 1870-1914. SO WHY WAR IN 1914??\n> The partition of Africa was finally resolved in 1911,\nremoving a major source of international conflict.\n> The German question was finally resolved on terms very\nfavorable to Germany, with Germany's unification in 1870-71.\n> German power rose sharply relative to other European powers,\n1870-1914, and seemed likely to keep rising. Germany was on\na roll! So why didn't Germany sit tight and enjoy the ride?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 19: The Causes of Intense War",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/ed5552778edd7853066465d11bd322fe_MIT17_42S18_lec19_IntenseWar.pdf",
      "content": "17.42\nStephen Van Evera\nTHE CAUSES OF INTENSE WAR\nI. THE MYSTERY OF LIMITED/INTENSE WAR\nSome wars are total from the outset, like World War I. Some\nstart quietly but end with a bang, like World War II in\nEurope, which opened with the near-bloodless 1939-40\n\"Sitzkrieg\" but became total. Some remain limited, like\nKorea and Vietnam. Why?\nII. SEVEN COMMON HYPOTHESES ON LIMITED WAR\nA.\n\"Destructive Weapons Cause Destructive War\"--and its\nless-popular opposite: \"Destructive Weapons Cause Mutual\nDeterrence; Mutual Deterrence Prevents Destructive War.\"\nConsider four hypotheses on arms and the intensity of\nwar:\n1.\nStates destroy what they can. The violence of war\ncorresponds to the destructive power of states.\n2.\nStates destroy what they cannot avoid destroying.\nThe violence of war depends on whether weapons are\ndiscriminating, e.g., accurate or not.\n3.\nStates destroy what they must to accomplish their\nwar goals. The violence of war corresponds to the\nscope of those goals, and hence to the scope of\npolitical conflict between the belligerents.\n4.\nStates destroy least when they fear large punishment\nin return. The violence of war corresponds inversely\nto the ability of both belligerents to punish the\nother.\nNote: Propositions #A1 and #A2 produce opposite\nprescriptions from #A4. Indeed, #A1 and #A4 are logical\nmirror opposites. What to make of this?\nSolutions implied by Proposition #A1:\n>\nDisarmament.\n>\nDeploy forces that can disarm the other side--e.g.,\nstrategic nuclear counterforce forces (accurate silo-\nbusting ICBMs and national missile defense).\nSolutions implied by Proposition #A2:\n>\nDeploy discriminating weapons that can be used\nwithout collateral damage--e.g., laser-guided bombs.\n\nBan land mines, especially hard-to-clear anti\npersonnel mines; and weapons of mass destruction.\nSolution implied by Proposition #A3:\n>\nAll states should adopt defensive force postures so\nthat their neighbors will not be insecure, hence will\nnot feel the need to adopt desperate measures in a\nsearch for security.\nSolution implied by Proposition #A4:\n>\nStates should arm themselves abundantly with well-\nprotected weapons of mass destruction. \"Nuclear\nweapons are your friend!\"\n>\nWe should fear the proliferation of weapons of mass\ndestruction to non-deterrable states or non-state\nactors (nihiliist terrorists or psychopaths). Non-\nstate actors are hard to punish (they have no return\naddress) and non-deterrable crazy states and non-state\nactors are indifferent to punishment.\n>\nWars of counterinsurgency will be especially\nviolent, as they are wars in which governments and\ninsurgents compete to coerce unarmed publics. The\npublics cannot punish either government or insurgents,\nso violence directed at them is intense.\nB.\n\"Total War Doctrine Causes Total War, Limited War\nDoctrines Allow Limited War.\"\nC.\n\"Defining and Observing Thresholds Helps Keep War\nLimited\"--e.g., \"I won't use gas if you won't.\"\nD.\n\"Don't destroy your opponent's command, control,\ncommunications, and intelligence (C3I)\"--otherwise they\ncan't observe your restraint or make peace with you. See\nan old science fiction novel, Berserker, on this danger.\nIII. CAUSES OF WAR AS CAUSES OF ESCALATION\nA.\nFirst-strike advantages. When these exist, wars\n1. Start at an intense level. Cf. the 1941 Japanese\nattack on the U.S.; the 1941 German attack on the\nUSSR; and the 1967 Arab-Israeli war. Compare with the\nslow-growing 1939 war in Europe, U.S. in Vietnam.\n2. Are fought intensely as each attacks before it is\nattacked.\n3. Widen as belligerents preempt neutrals. Cf. the\nGerman invasion of Norway 1940.\n\n4. Are harder to stop due to the treachery displayed by a\nsurprise attack--why should the attacker now be\ntrusted to keep peace?\nB.\nLarge windows--i.e., impending fluctuations in\nrelative power. When these exist, wars\n1. Start at an intense level. Cf. World War I, 1941\nPacific War.\n2. Escalate as states jump through windows of opportunity\nin wartime. Cf. Hitler's 1940 attack on France, and\nGermany's 1918 offensive.\n3. Widen as neutrals jump in to exploit windows opened by\nwar. State A seizes the opportunity to attack state B\nwhen B becomes tied down fighting state C.\nNote: windows also make war more barbaric. Belligerents\noften massacre POWs and populations because otherwise\nthey will escape and rejoin the fight. See e.g., the\n1976 massacre of Tal Zataar in Lebanon. Moreover, such\nhorrors make losers fight to the end.\nC.\nFalse optimism. This makes war\n1.\nPersist--see e.g., World War I, World War II,\nVietnam.\n2.\nEscalate--see e.g., Germany's 1917 unlimited\nsubmarine campaign against the U.S.; and Athens'\nexpedition to Syracuse in the Peloponnesian War, both\nfueled by false optimism.\n3.\nWiden.\nD.\nCumulative resources. When resources are cumulative\nstates struggle to control them for themselves, and to\ndestroy them, in order to deny them to their opponent.\nThese two motives drive much wartime destruction.\nE.\nOffense vs. Defense: Does a strong offense make war\nmore or less intense? 1914-1918 vs. 1792, 1939.\nIV. WARFIGHTING STRATEGY AND ESCALATION\nA.\nDo offensive military operations cause or dampen\nescalation? Both can happen. The U.S. rush to the Yalu\nin 1950 sparked escalation. The US invasion of Germany\nin 1945 didn't spark chemical use and ended the war.\nB.\nMilitary operations open windows. Example: France\ntempted British Admiral Boscawen's attack on French\nwarships in 1756 by stripping these ships of guns and\nusing them as troop transports. A self-opened window.\nV. DOES WAR BEGET MORE INTENSE WAR? IF SO, WHY?\nA.\nWar aims may expand in wartime as each side adopts a\ndarker image of the other's intentions.\n\nB.\nThe use of force is blackmail, but states pay large\nreputation costs if they concede to blackmail. So using\nforce makes others less as well as more willing to\nconcede.\nC.\nWar creates false optimism. Belligerents' optimism\ngrows as they fight.\nD.\nStates at war infuse their populations with hyper-\nnationalism and chauvinist mythmaking to persuade them to\nsupport costly war policies.\nE.\nWartime non-evaluation:\n1.\nCritical assessment of official policy becomes \"aid\nand comfort to the enemy\"--and in fact it is!\nQuestion: should wartime dissent therefore be\nsuppressed?\n2.\nIngroup-outgroup dynamics get going. Those who find\nfault with official policies are excoriated for the\ncrime of sowing disunity in the tribe. Hence war\npolicies are not properly evaluated.\n3.\nWartime breakdown of communication between\nadversaries ---> no external evaluation of each\nside's domestic debate ---> lopsided debates on war\naims. Sealed information bubbles appear. Hawks can\nspread unanswered lies about the enemy.\nF.\nSunk-cost dynamics and ego-investment by elites who\ncan't admit they were wrong.\nG.\nWar creates a popular desire for vengeance. An\nemotional factor.\nH.\nDo \"Cleon's\" (military hawks, other hawks) wield\nmore political power in wartime?\nA missing concept in wartime: The \"Treason of the Hawks.\"\nCollaborating with enemies is reviled as treason, but ruining\none's country in avoidable warfare is a crime with no name\nand no punishment.\nVI. DOES WAR BEGET WIDE WAR? WHY?\nWars tend to spread laterally and engulf other states:\n1.\nWars open windows that other states jump through. WWI\nopened a window for the Ottoman empire to regain Russian\nterritory, and for Bulgaria to regain Serb territory, and\nfor Italy to gain Austrian territory. So they joined the\nwar. World War II in Europe opened a window for Japan\nthat caused WWII in the Pacific.\n2.\nWars have crossfire effects: neutrals are damaged, as\nthe US was damaged in 1914-17; and as in the Gulf Tanker\nWar of the 1980s. The neutrals enter to stop the damage.\n\n3.\nDecisive wars threaten the security interests of\nstates threatened by the enlarged power of the winner.\nE.g., Hitler's victories in 1939-40 threatened US\nsecurity, spurring it to join WWII. Some argue (Buerhig)\nthat possible German success also brought the US into WWI.\nThese dynamics sucked the USA into three of Europe's five\ngreat wars of 1792-1945.\nVII. WHAT WILL WORLD WAR III BE LIKE? THE NUCLEAR\nREVOLUTION/BIO REVOLUTION AND THE INTENSITY OF WAR\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 19: Weapons of Mass Destruction and World Politics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/ec9183e03eda1025f665b46b7e284bec_MIT17_42S18_lec19_MassDestruct.pdf",
      "content": "17.42\nStephen Van Evera\nWEAPONS OF MASS DESTRUCTION AND WORLD POLITICS\nI. WEAPONS OF MASS DESTRUCTION: WHAT THEY ARE\nThree types of weapons are grouped together (perhaps\nunwisely) under the rubric of \"Weapons of Mass Destruction\"\n(WMD). Of these, nuclear and biological weapons are\npotentially far more powerful than chemical weapons.\nBiological and chemical weapons have been outlawed by\ninternational treaties. The United States dropped its\noffensive bioweapons program in 1969.\nKey background questions:\nA.\nWould the world be better off if nuclear weapons had\nnever been invented? Would it be better off if nuclear\nweapons were now abolished?\nB.\nWould the world be better off if biological weapons\nhad never been invented? Would it be better off if\nbiological weapons were now abolished?\nC.\nIf nuclear and biological weapons cannot be\nabolished or controlled, what should we now do?\nII. THE TECHNICAL EFFECTS OF THE NUCLEAR REVOLUTION\nTechnologies rarely have decisive effects on war or\npolitics; more often technology is bent to serve politics or\nmilitary doctrine. Nuclear weapons are an exception. They\noverwhelm politics and doctrine.\nFive cascading technical effects flow from the nuclear\nrevolution. These cascade further into political effects\nlisted below in Sections IV and V. The technical effects\nare:\nA.\nEffect #1: hydrogen bombs offer an increase of six\norders of magnitude over the power of the TNT explosives\nused in World War II. The atomic bomb = x 1,000 increase\non TNT; the hydrogen bomb = x 1,000 increase on atomic\nbombs.\nB.\nEffect #2: due to 'A', the destructiveness of\nnuclear weapons, the \"cost exchange ratio\" vastly favors\nretaliators over attackers who try to disarm them.\nNuclear weapons pack tremendous explosive power in\ndevices that are cheap, light, easily hidden, protected,\nand delivered. Hence destroying nuclear weapons is very\nhard, protecting and delivering them very easy.\n\nC.\nEffect #3: due to 'B'--a cost-exchange ratio that\nheavily favors retaliators over attackers--a relationship\nof MAD (\"Mutual Assured Destruction\") develops between\nmajor powers. Both can destroy the other's society even\nafter absorbing an all-out counterforce attack by the\nother. In short, both have a \"second strike countervalue\ncapability.\"\nIn the Cold War both the US and USSR sought to avert\nMAD, preferring instead to deny the other a second-strike\ncountervalue capability, but they could not escape it.\nTechnology overrode their desires.\nToday China and Russia may not have a second strike\ncountervalue capability against the U.S. This reflects\ntheir lack of effort. They could get a second-strike\ncountervalue capability if they pursued one.\nD.\nEffect #4: \"flat of the curve\" dynamics. One of\nMAD's special characteristics is the \"flat of the curve\":\nbeyond a certain point, the capacity to inflict damage on\nthe other society, or to prevent damage to one's own, is\ninelastic to the size and capability of one's own force\nor one's opponent's force. Capabilities are absolute.\nImplication: MAD prevents preventive war.\nE.\nEffect #5: the \"multiplier effect.\" The efficiency\nwith which one side must strike the other's forces in\norder to leave the other unable to inflict unacceptable\ndamage in retaliation increases sharply as the arsenals\non both sides grow. Even an inefficient strike can\nreduce the retaliation to acceptable levels if both\narsenals are very small; even a very efficient strike\n(e.g., 99 percent effective) can fail to reduce\nretaliation to acceptable levels if both arsenals are\nvery large. Hence first strikes are least thinkable when\narsenals are large, suggesting the argument that \"the\nmore weapons both sides have, the less the risk of their\nuse.\" Implication: the India-Pakistan nuclear\ncompetition is more dangerous than was the U.S.-Soviet\ncompetition.\nF.\nAnd a political effect: Most scholars argue that MAD\nis a defensive revolution in warfare. Conquest is very\nhard in a MAD world. But see below for qualifications to\nthis argument.\nIII. ALTERNATE NUCLEAR DOCTRINES: COUNTERVALUE vs.\nCOUNTERFORCE STRATEGIES\nA.\nCountervalue vs. Counterforce Nuclear Strategies\nNuclear weapons present states with two basic nuclear\ndoctrines: counterforce and countervalue.\n>>\nCountervalue: the enemy society is targeted.\nPolitical aims are achieved by threatening to punish\n\nthe adversary by destroying its population and\nindustry.\n>>\nCounterforce: the enemy nuclear forces are targeted.\nPolitical aims are achieved by threatening to disarm\nthe adversary--that is, to remove its capacity to\ninflict punishment on oneself.\nSince forces can be used first or second, we have a crude\nuniverse of four possible nuclear capabilities:\n1.\nFirst-strike countervalue capability: the capacity\nto launch a first strike that inflicts unacceptable\ndamage on the adversary's society.\nThis capability is very easy to build, for reasons\nnoted above in Section I, but is quite useless.\n2.\nSecond-strike countervalue capability: the capacity\nto absorb an all-out counterforce first strike and\ninflict unacceptable damage on the adversary's\nsociety in retaliation.\nThis capability is easy to build for reasons noted\nabove in Section I.\n3.\nFirst-strike counterforce: the capacity to launch a\nfirst strike that removes the adversary's capacity to\ninflict unacceptable damage on oneself in\nretaliation.\nThis capability is very hard or impossible to build\nfor reasons noted above in Section I.\n4.\nSecond-strike counterforce capability: the capacity\nto absorb an all-out counterforce first strike and\nmount a counterforce counterattack that leaves the\nattacker's forces unable to inflict unacceptable\nfurther damage on one's own society.\nThis capability is even harder to build than a first-\nstrike counterforce capability.\nThese four capabilities can be displayed in a 2x2 table:\nStriking what?\nValues (cities)\nForces\n+))))))))))))))))0))))))))))))))))),\n*#1 First\n*#3 First\n*\n*\nStrike\n*\nStrike\n*\nFirst\n*\nCountervalue *\nCounterforce *\nStriking\n*\nCapability\n*\nCapability\n*\nWhen?\n/))))))))))))))))3)))))))))))))))))1\n*#2 Second\n*#4 Second\n*\n\nSecond\n*\nStrike\n*\nStrike\n*\n*\nCountervalue *\nCounterforce *\n*\nCapability\n*\nCapability\n*\n.))))))))))))))))2)))))))))))))))))\nCold War-era debates over US nuclear doctrine focused on\nwhether the US should be content with capability #2\n(second strike countervalue capability) or should also\nstrive for #3 (first strike counterforce capability)\nagainst the USSR. More recently, many analysts suggest\nthat the U.S. should deny even capability #1 (first\nstrike countervalue capability) to states like North\nKorea and Iran.\nB.\nCountervalue vs. Counterforce Strategic Nuclear\nWeapons: What Are they?\n>\nSecond-strike countervalue nuclear forces can survive\na surprise attack and retaliate against the attacker's\ncities or other \"value\" targets.\nAn example of a pure second-strike countervalue\nweapon is the U.S. Polaris ballistic missile submarine\nfleet of the 1960-1980s era. Polaris submarines could\nhide from attack in the vast ocean and their missiles\ncould strike an attacker's cities, but these missiles\nlacked the accuracy to destroy another state's hardened\nforces.\n>\nFirst-strike counterforce nuclear forces can be used\nto destroy an opponent's nuclear forces in a first\nstrike.\nAn example of a pure first-strike counterforce\nweapon in a U.S. vs. Russia or China context today is a\nhighly accurate intercontinental ballistic missile (ICBM)\nbased in a vulnerable soft silo. It could be used to\nlaunch a surprise attack on another state's nuclear\nforces, but it could not survive an attack, so it could\nnot retaliate against the attacker's cities.\nAnother first-strike counterforce weapons system is\narea national missile defenses (NMD) deployed to protect\ncities. The role of NMD in a first strike would be to\nknock down warheads missed by the first strike that are\nretaliating against the attacker's cities. In this role\nNMD is the defensive half of a first strike system and\nthus is essentially offensive despite its defensive\nappearance.\n(NMD configured to defend ICBM fields or other\nnuclear forces rather than cities is part of a second-\nstrike countervalue capability, not a first strike\nsystem, since it protects the national nuclear deterrent\n\nfrom first strike and does not protect cities from\nretaliatory attack.)\nIV. THE POLITICAL EFFECTS OF THE NUCLEAR REVOLUTION\nIF NUCLEAR ACTORS ARE DETERRABLE. THAT IS, ONLY\nSTATES (NOT TERRORISTS OR OTHER NON-STATE ACTORS)\nPOSSESS NUCLEAR WEAPONS; AND THESE STATES ARE\nCASUALTY-SENSITIVE, CLEAR-PERCEIVING, NOT HYPER\nAGGRESSIVE, CANNOT TRANSFER NUCLEAR WEAPONS\nANONYMOUSLY, AND CAN BUILD SECURE ARSENALS\nAssume that nuclear actors have six attributes: (1) They\nhave a clear return address--a territory they control. (That\nis, they are states, not non-state actors). (2) They are\ncasualty-sensitive. (3) They do not value conquest or the\ndestruction of others unduly, e.g., they do not value it more\nthan others value freedom. (4) Their perceptions of their\nsurroundings are fairly accurate--they have some capacity to\nassess their neighbors' capabilities, and to correctly\nanticipate how these neighbors will respond to their conduct.\n(5) They are unable to use or transfer nuclear weapons\nanonymously. (6) They have the industrial capacity to build\nlarge, secure arsenals. If so, the nuclear revolution has\nseven positive consequences:\nA.\nFirst-strike advantages disappear, hence \"crisis\ninstability\" and preemptive war also disappear. Flat-of\nthe-curve dynamics (see 'IID') erase first-strike\npayoffs. Even if a country can shift the force ratio in\nits favor by striking first, it merely moves itself and\nits enemy laterally on the flat of the curve. The\nrelative ability to bounce rubble changes, but nothing\nelse.\nB.\n\"Windows\" of opportunity and vulnerability\ndisappear, hence temptation to preventive war also\ndisappears. See previous point, 'IV A': windows\ndisappear for similar flat-of-the curve reasons.\nC.\nResources are less cumulative. Flat-of-the-curve\ndynamics diminish the additivity of resources; even large\nshifts in the control of industrial resources, or in\ncontrol of advantageous geographic positions, won't move\neither power off the flat of the curve. Also, nuclear\nforces can be delivered over great distances, hence don't\nrequire proximity to function, so bases matter little.\n(Though this was less true earlier, e.g., in 1962.)\nD.\nLess false optimism. Nuclear weapons create very\ncertain physical results, eliminating miscalculations of\nrelative capability. They still leave room for\nmiscalculations of relative will, however.\nE.\nDefense-dominance, hence fewer wars for security and\nwars of opportunity. The nuclear revolution strengthens\ndefender-states and weakens aggressor-states, since\n\nconflicts in a MAD world become contests of will, and\ndefenders nearly always win contests of will. Under MAD\neach side can harm the other without limit. Disputes are\nthen settled in favor of the side that cares more about\nthe issue, and hence is willing to run a greater risk or\npay a higher price to prevail. Contests of will are\nnearly always won by defenders, since defenders value\nfreedom more than aggressors value conquests. If so,\nconquest among great powers is impossible unless one\npower acquires a first-strike counterforce capability\nagainst the other. A first-strike counterforce\ncapability is essentially unreachable between powers of\nremotely comparable resources, hence conquest is also\nimpossible among them.\n> Qualification: nuclear weapons are less useful for\ndefending one's allies than for defending oneself.\nStates nearly always have greater resolve than states\nthat seek to conquer them, so defenders can credibly\nthreaten to use nuclear weapons to defend themselves.\nIt is less clear that states have greater resolve than\naggressors who seek to conquer their allies. The\nproblem of \"extended deterrence\" therefore arises: it\nis hard to credibly threaten to use one's nuclear\nweapons to defend allies. This leaves allies less\nprotected.\nF.\nLimited war. Logic suggests that causes of war and\nintense war are similar. If so, logic suggests that the\nnuclear revolution may--counter-intuitively--promote\nlimited war as well as less war.\nG.\nSlower arms racing.\nH.\nOn the other hand ... \"Nuclear weapons raise states'\nanxiety about preserving the credibility of threats.\nThreats to use nukes are often suicidal, hence\nincredible. Hence states are drawn to use conventional\nforces to persuade others that they will use nuclear\nforces, e.g., as the U.S. did in Korea and Vietnam.\"\nV. THE POLITICAL EFFECTS OF THE NUCLEAR REVOLUTION IF\nNUCLEAR ACTORS ARE NOT DETERRABLE--THAT IS, THEY HAVE\nNO RETURN ADDRESS, OR ARE NOT CASUALTY-SENSITIVE OR\nCLEAR-PERCEIVING, ARE HYPER-AGGRESSIVE, CAN TRANSFER\nNUCLEAR WEAPONS ANONYMOUSLY, AND CANNOT BUILD SECURE\nARSENALS\nIf we relax the six assumptions outlined at the\nfront of in Section IV then the benefits of MAD\nevaporate and the dark face of MAD appears.\nA.\nIf the first five assumptions are relaxed, the\nbenefits of the nuclear revolution are lost, even\nreversed. Defenders no longer have the clear upper hand.\nThe security dilemma reappears.\n\nMoreover a new danger emerges. States now must face\nthe possibility of being physically destroyed--by a\ncrazed, non-deterrable adversary--even if they cannot be\nconquered. This may impel them to take drastic steps if\na nuclear-armed neighbor seems to be taking leave of its\nsenses. If the crazed neighbor seems certain to attack\neventually, killing hundreds of millions, a preemptive\nstrike against it becomes sensible, even though the\nneighbor's retaliation will kill tens of millions. (In\nshort, a \"survival dilemma\" arises, parallel to the\n\"security dilemma.\" \"The measures each state must take\nto ensure its physical survival threaten the sovereignty\nand physical survival of other states.\") States also\nface the risk of anonymous use by rogue states or\nmovements. Such rogues are less deterred because they\ncan hope that their responsibility will not be\ndiscovered; or, if they are non-state actors (such as\nterrorist groups) because they have no territory to hold\nhostage.\nWe saw the first conflicts of this kind in the post\n9/11/01 U.S. effort to destroy Al Qaeda and the 2003 U.S.\nwar on Saddam Hussein's Iraqi regime. The Bush 43\nadministration feared that AQ and Saddam were not\ndeterrable, might acquire and use nuclear weapons against\nus, and so had to be destroyed. Current talk of war with\nNorth Korea and Iran has similar logic.\nB.\nIf the sixth assumption is relaxed MAD itself may be\nfrail or may never develop. A first strike may be\nfeasible by one or both sides. Hence MAD between\nsuperpowers can be good, but nuclear proliferation to\nsmall states can be bad.\nBottom line: nuclear weapons are Janus-faced. They cause\npeace or war, security or insecurity, depending on ... us!\nThey pacify a world of states that are casualty-sensitive,\nfairly clear-perceiving, not hyper-aggressive, unable to use\nor transfer nuclear weapons anonymously, and able to build\nsecure arsenals. If these conditions are relaxed--if non\ndeterrable states or terrorists acquire nuclear weapons--the\nbenefits of the nuclear revolution evaporate and a horrific\ndark side appears; nuclear weapons themselves become a cause\nof war.\nSince 1990 these issues have been cast in a far darker\nlight by three events: (1) the appearance of nuke-seeking\nrogue states (North Korea, Iran, perhaps at one time Saddam's\nIraq); (2) the acquisition of nuclear weapons by a state that\nmay leak them to terrorists (Pakistan!); and (3) the collapse\nof security of the Soviet nuclear arsenal after 1991, raising\nthe risk of nuclear sale or theft of Soviet nuclear weapons\nor materials to terrorists. (This problem has now been\naddressed but not completely solved.)\n\nSo some now worry that non-deterrable nuclear states may\nsoon appear, and non-deterrable terrorists may acquire\nnuclear arms.\nVI. ALTERNATE NUCLEAR ORDERS: MAD AND ITS ALTERNATIVES\nWhat global nuclear order would be best?\nA.\nHow many nuclear powers is best?\n1. No nuclear powers, nuclear weapons are never invented\nand remain unknown. A now-impossible world still\nworth evaluating.\n2. No nuclear powers, in a world of nuclear knowledge.\nWe would achieve this if today's nuclear powers\ndisarmed. This is MARNE (\"mankind absolutely rejects\nnuclear explosives,\" a non-nuclear world.)\n3. Few (5-10) nuclear powers. Is this the most peaceful\nof all possible worlds?\n4. Many (80-100) nuclear powers.\nB.\nIn a world that includes nuclear powers, what\ndistribution of capabilities is best? Distinguish these\npossibilities:\n1. MAD (\"Mutual Assured Destruction\"), a world where\nnuclear states have secure second-strike capabilities\nagainst one another.\n2. BAD (\"both are defended\"), a world of symmetrical\npowerful population defenses.\n3. WORSE (\"winning only requires striking early\"), a\nworld of mutual first strike capabilities.\n4. USA (\"Unilateral Superiority--American\"), a world\nwhere the U.S. is top dog--it has second-strike\ncountervalue and first-strike counterforce\ncapabilities against all other nuclear powers.\n5. UN control of nuclear weapons.\nIf choice were possible, which would you choose?\nVII. THE BIOLOGICAL WARFARE REVOLUTION\nBioweapons differ from nuclear weapons in five prime regards.\nHopeful differences:\nA.\nInfectious biological weapons are very\nindiscriminate. They may blow back against users and\nusers' societies. If so, their use is suicidal. If this\nis true, even extreme terrorists will hesitate to use\nbioweapons unless the terrorists seek to destroy their\nown societies. Only psychopaths will find them useful.\nB.\nDefenses are more feasible against bio attack than\nagainst nuclear attack--but the attacker still has a\nlarge advantage. Defenses may thus be possible but at a\npoor cost-exchange ratio.\nQualification: developing biodefenses may require\ndeveloping bio-offenses in order to test the new defense\n\nagainst them. If so, we are on a treadmill.\nDefense -\n> offense --> defense --> offense.\nWorrying differences:\nA.\nBiological weapons are far cheaper to make than\nnuclear weapons so even non-state actors (terrorists) may\nbe able to make them--and terrorists are far harder to\ndeter than states.\nB.\nBiological weapons can be used anonymously so,\nagain, their use is especially hard to deter.\nC.\nBiological weapons programs have no clear signature\nthat distinguishes them from peaceful biological\nresearch. As a result an arms control regime that bans\nbioweapons is probably impossible to devise.\nAs a result of differences C, D, and E, some argue that\nbioweapons use cannot be deterred and perhaps cannot be\ndefeated. If so bioweapons are truly weapons from hell,\nperhaps posing a greater long-run danger than nuclear\nweapons. Their dark shadow will lie across the future of the\nhuman race as far as the eye can see. Our only hope lies in\ndefenses--an answer that may be a weak reed.1\nSome people discount the bioterror danger because the\nUnited States and most other major powers have been\nuninterested in developing bioweapons. (The U.S. abandoned\nits offensive bioweapons program in 1969). They infer from\nthis that bioweapons aren't very useful and so won't be\nfurther developed or used. But while bioweapons may be\nunuseful to states, they are useful to terrorists who seek\nvast destruction instead of finite military objectives. The\nappearance of skilled terrorist groups that aspire to mass\nmurder (Al Qaeda) means that a new class of potential\nbioweapons users has appeared. These weapons now have\ncustomers!\nMany were also lulled by the world's success in surviving\nthe nuclear revolution. They assumed that nuclear, chemical,\nand biological weapons were all of a piece (all were \"weapons\nof mass destruction\") and that measures that worked with one\n(arms control, deterrence) would work with all three. But as\nnoted above bioweapons are harder to control by agreement\nthan nuclear weapons and their use is harder to deter. This\nis because bioweapons are more likely to be obtained by non\ndeterrable terrorists; they can more easily be used\nanonymously; and arms control to halt their spread is harder.\nIn Kurt Vonnegut's novel Cat's Cradle a mad scientist\ninvents a new crystalline form of water--\"ice nine\"--that\n1 My thinking on bioweapons reflects work by\nProf. Greg Koblentz of George Mason University, an MIT\npolitical science department PhD.\n\nsolidifies at 90 degrees fahrenheit. Its release ends life\non earth by freezing the oceans.\nBioengineers have developed a powerful new tool for gene\nediting: crispr-cas9. Does crispr-cas9 = ice nine? Will bad\nactors use it to develop hyper-lethal hyper-contagious\npathogens? If so, what can we do in response--if anything??\nIf we survive cripr-cas9, what next? Will the biotech\nrevolution hand us some other biotech \"ice nine\"--a vastly\ndestructive technology that we can't handle, and will spell\nour demise?\nPhysicist Enrico Fermi notes empirical evidence from the\ncosmos that may be relevant to this issue. Google up \"Fermi\nparadox.\" \"Where is everybody?\"\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 20-21: The Cold War and Korea",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/add2f76fc592308576e8ba29c6312b8a_MIT17_42S18_lec20-21_ColdWar.pdf",
      "content": "17.42 / Causes and Prevention of War\nStephen Van Evera\nTHE COLD WAR (1947-1989) AND KOREA (1950-1953)\nI. THE COLD WAR IN A NUTSHELL\nA. Duration: ~1947-1989. Ended by the Soviet withdrawal\nfrom Eastern Europe, 1989.\nB. Wars of the Cold War: Korea 1950-53, Vietnam 1950-75,\nAfghanistan 1979-89, Cambodia 1979-89, Nicaragua 1983-90,\nAngola 1975-1990s, El Salvador 1979-90, Soviet\nintervention in Ethiopia 1970s; massacres in Indonesia\n1965, East Timor 1975. Millions were killed.\nC. US-sponsored coups in Iran 1953, Guatemala 1954, Chile\n1973, Congo 1960, Brazil 1964, Greece 1967, maybe\nIndonesia 1965, East Timor 1975.\nD. Crises: Berlin 1948; Berlin 1958-62; Cuban Missile Crisis\n1962; War Scare of 1983; China offshore islands, 1950s.\nII. HOW THE COLD WAR ERUPTED: EVENTS\nA. Poland and Eastern Europe:\n1. Warsaw uprising, 1944. Stalin drew the Polish non-\ncommunists into a futile rebellion against Hitler,\nthen watched passively while Hitler slaughtered them.\nAmericans wondered what else Stalin intended.\n2. Stalin made a vague promise at Yalta (Feb. 1945) to\nallow democracy in Poland. Then he imposed communist\ndictatorship instead.\nB. Iran 1946: Stalin wouldn't leave northern Iran until\npressured.\nC. Turkey 1946: Stalin said \"I want some Turkish territory!\"\nInstead Truman sent the Missouri to the Mediterranean as\na show of force.\nD. Greece 1947: the West thought Stalin was instigating the\nCommunist revolution in Greece. (He wasn't.\nYugoslavia's communist Tito government was aiding the\nGreek communists, but not Stalin.)\nE. The Berlin Crisis of 1948-1949. This grew from a Soviet-\nAmerican struggle to control Germany.\nF. Military aspects:\n1. The U.S. had false fears of Soviet military\nsuperiority. U.S. intelligence and the Western press\ndepicted a vast Soviet conventional superiority in\nEurope and downplayed the implications of the U.S.\natomic monopoly. Hence a Soviet threat that was\n\nlargely political--the Soviets had some capacity to\ndisrupt or subvert Western Europe--was also perceived\nas military.\n2. The Soviets explode an atomic bomb, August 1949. Now\nthe West is really scared. What if Stalin isn't\ndeterrable?\nWestern responses: the Marshall Plan (1947); the Berlin\nairlift (1948-49); the formation of NATO (1949); and a vast\nAmerican military buildup (1950-54), following a plan defined\nin NSC 68 (1950). This triggered a large Soviet counter-\nbuildup.\nThe Soviet threat, US response, 1944-50: a natural\nexperiment testing offense-defense theory, balance-of-threat\ntheory?\nIII. WHAT CAUSED THE COLD WAR? WHO CAUSED THE COLD WAR? SEVEN\nEXPLANATIONS\nA. Communist totalitarian expansionism? \"The totalitarian\nSoviets were the aggressor, the democratic West the\ndefender. Soviet aggression sprang from the\naggressiveness of Communist political systems. Communist\ngovernments are aggressive because they are (a)\ninherently messianic--Communist ideology preaches global\ncommunist rule; and/or because they are (b) frail, hence\naggressive for Orwellian reasons--they needed enemies to\nlegitimate their totalitarian rule.\"\nVariant #1: Soviet expansion into Eastern Europe\nthreatened U.S. security, causing the Cold War.\n> The US prime interest: to maintain the political\ndivision of industrial Eurasia. Soviet expansion into\nEastern Europe positioned the USSR to destroy that\ninterest by achieving Eurasian hegemony.\nVariant #2: The Soviets conquered the homelands of\npowerful U.S. ethnic groups--especially Polish-Americans\n-when they seized Eastern Europe. These ethnic groups\nthen pushed Washington to respond.\nB. Communist totalitarian cruelty and barbarism? \"The U.S.\nopposed the USSR less because the USSR was aggressive\nthan because it was tyrannical. The Cold War was a\nWestern human rights crusade.\" But if true, why didn't\nthe Cold War blossom fully in 1919?\nC. U.S. softness? \"U.S. softness early in the Cold War made\nthings worse--the U.S. led the Soviets forward by\nappeasement. Instead the U.S. should had given Stalin an\nultimatum in 1946: 'Get out of Eastern Europe or we'll\nthrow you out!'? The Soviets would have left, removing\n\nthe Cold War's cause!\" (Adam Ulam.)\nD. Capitalist expansionism? \"The capitalist U.S. was the\naggressor, the socialist Soviet Union was the defender.\nThe U.S. feared a new depression. It hoped to avoid such\na depression by finding market outlets for surplus goods.\nIt sought to control Eastern Europe to compel it to be\nsuch a market. U.S. imperialism in Eastern Europe\ncollided with a defensive Soviet desire to maintain a\nneutral buffer to its west.\" This is the now-largely\ndiscredited left-revisionist view. See e.g., writings by\nGabriel Kolko and Lloyd Gardner.\nE. Revolutionary vs. oligarchic states? \"Both sides were\naggressors, for reasons Stephen Walt describes.\nRevolutionary states are messianic and frightened; their\nneighbors are defensively aggressive, and polluted by\nemigres.\" But if true why didn't the Cold War blossom\nfully in 1919?\nF. The unshaped postwar European order/collapse of German\nempire? \"The lack of a clear Soviet-American wartime\nagreement on the postwar partition of the German empire\ncaused a collision of the two major allied powers in a\nzone of uncertainty. Had each side's sphere of influence\nbeen more clearly delineated earlier the Cold War might\nhave been milder.\" Shades of the 7 Years' War.\nG. The international system: Bipolarity and the security\ndilemma? \"The world's two strongest states rarely get\nalong well because each is the main threat to the other.\nThey will always compete for security. The Cold War was\nan inevitable result of the rise of the U.S. and USSR to\nthe pinnacle of world power.\"\nVariant #1: The two superpowers were in fact\ninsecure and contended for resources of real value-\nespecially the industry and buffer room of Eastern\nEurope.\nVariant #2: The superpowers were secure due to the\nnuclear revolution, their vast size, and their distance\nfrom each other. But didn't know it; and they contended\nfor assets (Eastern Europe) of no real value. Soviet\ncontrol of Eastern Europe made the USSR less, not more,\nsecure by provoking the rest of the world into a hostile\nstance against the USSR.\nVariant #3 (spiral model variant): The two\nsuperpowers felt insecure and contended for security but\nboth thought the other pursued unprovoked aggression for\nnon-security reasons and overreacted accordingly.\nWhat does this systemic explanation portend for the\n\nfuture of U.S.-China relations?\nIV. THE KOREAN WAR, 1950: WHAT HAPPENED\nA. The U.S. and USSR agreed to partition Korea at the 38th\nparallel in 1945.\nB. The U.S. pulled its troops out of Korea in 1949. A U.S.\nblunder?\nC. Communist victory in China in 1949 triggered a bitter\n\"who lost China?\" debate in the U.S.\nD. Dean Acheson gave a speech at the Washington Press Club\nin January 1950 delineating an \"American defense\nperimeter in Asia.\" He omitted South Korea! Another\nU.S. blunder?\nE. North Korea attacked South Korea by surprise, June 25,\n1950. Why? Kim Il Sung and Stalin expected the U.S.\nwould not intervene, or that the North could crush the\nSouth before the U.S. could intervene effectively. A\nhuge miscalculation by them.\nF. Truman decided to intervene. Reasons:\n1. To preserve American credibility. But was it engaged\nin Korea?\n2. To avert a worldwide pro-Soviet bandwagon effect.\nU.S. leaders feared that other states would align\nwith the USSR, thinking it the tide of the future, if\nSoviet-allied North Korea seized South Korea. But\n... absent US intervention, was a worldwide pro-\nSoviet bandwagon effect likely? Do states generally\nbandwagon or balance?\n3. Domestic politics. Truman feared being pilloried for\nlosing another Asian country to Communism.\nG. U.S. forces landed at Inchon on Sept. 15, 1950 and routed\nthe North Korean army from South Korea.\nH. In late September 1950 Truman decided to cross 38th\nparallel and conquer North Korea. Part of the U.S.\nreasoning: \"We must punish the aggressors to deter them\nfrom other aggression elsewhere.\" An American mega-\nblunder.\nI. September/October 1950: China decided to enter the war\nagainst the U.S. if the U.S. invaded North Korea. Why?\n1. China's leaders feared that after the U.S. conquered\nNorth Korea it would destabilize Communist rule in\nnortheast China (Manchuria) or even invade China\ndirectly. Mao wrote Stalin on October 2, 1950 that\n\"if we allow the United States to occupy all of Korea\n... the American invaders will run more rampant, and\nhave negative effects for the entire Far East.\" On\n\nOctober 13 he wrote that U.S. victory in North Korea\n\"will be most disadvantageous to Manchuria; all of\nthe South Manchurian electricity will be threatened.\"\n> because U.S. power will then be adjacent to China,\nand\n> because the U.S. and anti-communist Chinese will be\nemboldened by U.S. victory in Korea. \"The\narrogance of reactionaries at home and abroad\n[will] grow,\" threatening Manchuria. See telegrams\nattached to lecture notes.\nThe U.S. was unaware of these Chinese fears.\nIs the U.S. approach to the Yalu is a \"natural\nexperiment\" that tests (and corroborates) offense-\ndefense theory? The U.S. applied a large, rapid\ninsecurity \"treatment\" to China. China responds with\ngreat violence despite long odds and high risks.\n2. Chinese leaders hoped for total victory over U.S.\nforces. Mao suggested that \"our forces can destroy\nthe American forces in Korea,\" and that \"the scope of\nthis war will not be great, and the duration will not\nbe long.\" \"If the American forces are defeated, the\nKorean problem is, in fact, finished.\"\nJ. Oct. 3, 1950: China warned the U.S.: \"Don't cross 38th\nparallel or it's war with us!\" Truman and Acheson didn't\nlisten. UN troops crossed the 38th parallel on Oct. 7.\nWhy?\n1. The warning came via an Indian diplomat not trusted\nby Dean Acheson (so said Acheson later).\n2. China didn't explain the reasoning behind its warning\nor convey the warning directly to Congressional\nRepublicans.\n3. The Administration had already decided to cross the\nparallel in late September; backtracking is painful.\n4. Truman feared attacks from Republican hawks if he\nstayed south.\n5. U.S. contempt for Chinese military capability. One\nU.S. commander told his troops they faced \"a bunch of\nChinese laundrymen\" before China's attack.\n6. Some U.S. officials argued that (paraphrasing) \"China\nwould have entered the war in July, when it had a\nchance to win, if it meant to enter at all. It makes\nno sense for China to enter now when its prospects\nare far worse.\" U.S. leaders dismissed the\npossibility that security fears would drive China to\nenter.\nK. Chinese baiting of the US:\n\n1. U.S. forces encountered small Chinese forces in\nKorea, 26 Oct. 1950. MacArthur thought: \"If this is\nall they can do they'll be a pushover,\" and ordered\nan advance to the Yalu River. Another mega-blunder.\n2. Chinese warnings of the U.S. all but ceased on\nOctober 13, with only one later exception. Instead\nChinese officials released US POWs with happy waves\nand good wishes in October/November.\nL. China launched a massive surprise attack on U.S. forces\nin North Korea on Nov. 26, 1950 and routed the U.S. army,\ndriving it from North Korea. This was the worst ground\ndefeat in U.S. military history!\nM. A long and bloody war ensued, Dec. 1950-summer 1953,\nending in a tie. China tried and failed to drive the\nU.S. from Korea. Note: this war included a long-hidden\nSoviet-American air war!\nV. KOREAN WAR, U.S.-CHINA WAR: WHAT CAUSED THEM?\nA. Background misperceptions:\n1. American self-sugar-coating: \"We've always been nice\nto China--so China has nothing to fear from us!\"\n2. Chinese myths about U.S.: \"The U.S. helped Japanese\naggressors in the 1930s! The U.S. is plotting to\nrebuild and unleash Japan in Asia again!\" Marxist-\nLeninist dogma shaped Chinese thought.\nB. Non-strategy: By the USA? No--the problem was that\nAcheson did state US strategy, but misstated it. A\nmisstated strategy is worse than none. By China? Yes.\nChina told the US in late September that it wouldn't\nintervene, then changed its mind too late.\nC. Absence of Sino-American diplomatic relations. A mega-\nblunder by both sides.\nD. McCarthyism in the U.S.? A powerful force. What caused\nit? Some blame the China Lobby, which fed lots of\ninformation to McCarthy.\nE. First-strike advantage. This is the likely reason why\nChina never issued an ultimatum and sought to convince\nthe U.S. of China's weakness.\nF. U.S. window after Inchon ----> too-hasty diplomacy, Sept.\n15-Oct. 7.\nG. False optimism by everyone.\nH. The security dilemma, and unawareness of it. Security\nwas the basic goal pursued by both the U.S. and China but\nneither realized this of the other.\nI. War ----> War\n1. U.S. aims widened due to the war itself:\n\na. \"We must conquer the North to punish the\naggressor.\"\nb. \"We should hold POWs to scare future communist\naggressors into thinking we'll do it again.\"\n2. Chinese aims also widened in wartime. Mao inferred\nmalign U.S. intent from the interposition of the U.S.\nfleet off Taiwan in June 1950 and the October 1950\nU.S. invasion of North Korea. He responded by\nexpanding China's aims to include expelling the U.S.\nfrom South Korea.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 22: Causes of / Solutions to the Israel-Arab Conflict",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/d54293bb2ebb8682a4bf1eaa423bc05e_MIT17_42S18_lec22_IsraelArab.pdf",
      "content": "17.42 / Causes and Prevention of War\nStephen Van Evera\nCAUSES OF/SOLUTIONS TO THE ISRAEL-ARAB CONFLICT\nI. ISRAEL/PALESTINE IN ANCIENT TIMES\nThe Israelites, forbearers of today's Jews, emerged in ~1200\nBCE in today's West Bank. Twice in ancient times they\nestablished independent kingdoms (~1000-586 BCE, ~140-63 BCE).\nThese Israelite kingdoms were eventually conquered and\ndestroyed by others. Many Jews fled to Europe at some point.\nThere they were relentlessly oppressed--driven into ghettoes\nand sometimes murdered en masse--by the Christian majority.\nThe Arabs are a Mideast people racially and linguistically\nrelated the Jews and Canaanites. In ancient times they were\ndesert people.\nII. THE BIRTH OF ZIONISM, 1896\nTheodor Herzl and other early Zionist leaders sought to create\na safe haven for the Jewish people in an anti-semitic world\nthat rejected them.\nIII. ISRAEL-ARAB CONFLICTS: SIX BIG WARS, THREE SMALL WARS, TWO\nINTIFADAS\nA. Big wars in 1947-49 (the \"1948 War,\" or the \"Nakba\" or\n\"Catastrophe\"); 1956 (the \"Sinai War\"), 1967 (the \"Six Day\nWar\"), 1969-70 (the \"Canal War\"); 1973 (the \"Yom Kippur War\"\nor \"October War\"); and 1982-2000 (the \"Lebanon War\").\nB. Small wars in 2006 (the \"Second Lebanon War\" or \"July War\"),\n2008-9 (\"Operation Cast Lead\" or \"the Battle of al-Furqan\"),\nand 2014 (\"Operation Protective Edge\" or the \"2014 Gaza\nMassacre\").\nC. Intifadas (Palestinian uprisings) in 1987-1991, 2000-2005.\nD. Serious peace talks in 2000 (\"Camp David\"), 2001 (\"Taba\"),\nand 2008 (Olmert-Abu Mazen talks).\nIV. CAUSES OF THE CONFLICT\nA. Conflict over land. The Jews and Palestinians both claim\nthe same place. Oh dear! No settler-colonial movement has\never avoided war with the indigenous people of the lands\nthat it colonized. If so, the cause of the conflict lies in\nthe cause of Jewish settler-colonialism (Christian\nantisemitism).\nB. The security dilemma. Geography--close proximity and\n\nindefensible borders--made the Palestinians and Israelis a\nthreat to each other. This drove each to seek to dominate\nthe other. Israel sought wide territories in 1947-48,\nexpelling many Palestinians in the process, to gain secure\nborders. Israel also sent settlers into the West Bank after\n1967 to avert a two-state solution, to ensure Israel\nretained secure borders.\nSome argue that Israel no longer needs large territories\nto be secure. Does Israel's nuclear deterrent make it\nunconquerable?\nC. Invented chauvinist history. Both Arabs and Israelis\nwallowed in historical mythmaking about the origins of\nZionism, the 1948 war and later wars. Each exculpated\nitself of wrongdoing while casting all blame on the other.\nNeither put much blame for the conflict on the most\nresponsible party, the Christian West.\n> These chauvinist histories lie mainly by what they omit.\nD. Religious extremism.\n1. In Israel.\na. An Israeli settler movement has emerged since 1967\nthat claims vast Arab lands beyond Israel's 1967\nborders, roughly following the borders of David's\nkingdom. This settler movement is fueled by\nscripture-based claims that God gave the West Bank and\nmuch more to the Jews. This reflects a literalist\nreading of scripture, and a selective reading\nscripture that omits the command to \"love the\nstranger, for you were strangers in the land of Egypt\"\n(Deut. 16:11).\nb. Some religious Israelis now demand that Israel must\nretain control of the Temple Mount. This is a change\nof position the old days; in 1938 Zionist leaders\nexpressed more interest in Mount Scopus (Hebrew\nUniversity) than the Temple Mount.\n2. Among Palestinians. Hamas, an extremist Palestinian\norganization that rejects a two-state solution with\nIsrael, emerged in 1987 and gained large influence.\nHamas is fueled by the view that Islam requires jihad,\njihad requires the defense of all Muslim land, and Israel\nis Muslim land. This view reflects militant sections of\nthe Koran written in Medina, when Muhammad and his\nfollowers were at war.\n> The Israeli settler and Hamas views of scripture are\ncontestable but rarely contested.\n3. Among Christians. Christian anti-semitism through the\nages has been fueled by barbs against the Jews in the\n\ngospels of Matthew and John. These barbs (e.g., Matthew\n27:20-26; John 8:44-47; also 7:1, 10:31) were written\nduring growing conflict between the mainstream Jewish\ncommunity and the early Christian secessionists.\nE. False optimism. Both sides have relentlessly believed that\nforce could make the other fold. Neither has proven right\nso far.\n1. The Palestinians refused the 1947 partition and then\nrefused to accept the 1949 armistice lines, wrongly\nbelieving that force could gain them better terms.\n2. Israel refused Egypt's peace offer in 1971, and pursued\nlater peace efforts indifferently or not at all, wrongly\nbelieving that Israel could instead compel the Arabs to\nconcede the gains Israel made in the 1967 war. These\npolicies set the stage for the 1973 war and later\nviolence.\nE. Bad strategies and tactics, arising from illusions and\nmisperceptions.\n> Regarding Palestinian strategy:\n1. Some argue that the Palestinians' strategy of violence\nhas served them poorly. In this view the methods of\nGandhi and Martin Luther King would serve them better\nat this stage of the conflict. Likewise, more use of\npublic relations instead of violence would serve them\nbetter. \"Use your words.\"\n2. Some complain that the Palestinians have missed\nopportunities to settle the conflict--they have \"never\nmissed an opportunity to miss an opportunity.\"\n> Regarding Israeli strategy:\n1. Some argue that Israel cannot be expansionist and\nZionist. They note that Israel will soon become an\nArab-majority country unless it divests itself of the\nterritories it conquered in 1967.\n2. Some argue that Israeli expansion (that is, Israeli\ncolonization of West Bank and vassalization of Gaza) on\nbalance harms Israeli security.\na. \"Israeli expansion retards Israel's ability to\nattract Jewish immigrants.\"\nb. \"Israeli expansion could trigger a resurgent pan-\nArabism, or an even wider Muslim mobilization\nagainst Israel. Pan-Arabism could lead to an Arab\nunion of some kind--as German, Italian, and\nVietnamese movements of union produced nation\nstates. This would gravely threaten Israeli\nsecurity. A still-wider Muslim mobilization would\nbe even more dangerous to Israel.\"\n\nc. \"Israeli expansion raises the risk of WMD terror\nagainst Israel.\" Yitzhak Rabin and Ehud Barak both\nworried that the conflict could produce WMD terror\nagainst Israel unless it is resolved.\nWould better policy evaluation among Israelis or\nPalestinians have produced peace?\nF. War ---> War. Specifically, 1948 war ---> 1967 war --->\n1973 war, war today.\nG. Strategy debates.\n1. In Israel: Does Israel have a Palestinian partner for\npeace? Related: Does Arab hostility to Israel stem\nmainly from Israel's seizure of Arab lands and expulsion\nof Arab peoples in 1947-48? Or from anti-semitism\nembedded in Muslim scripture?\n2. Among Palestinians: Is Israel a partner for peace?\nRelated: Is Israeli hostility toward Palestinian\nstatehood fueled mainly by Israeli doubts that the\nPalestinians are willing to accept Israel and make a\ndurable peace with it? Or by Jewish religious extremism\n(i.e., desire for Biblical fulfillment) and a desire for\nmore land for settlement?\nPolls show that both sides greatly underestimate the\nproportion of the other public that is willing to agree a\ntwo-state solution.\nV. EVENTS 1949-PRESENT\nA. Religions motivations and religious extremism have risen on\nboth sides since 1949,\n1. In the late 1960s an extremist religious Israeli settler\nmovement appeared. It aimed to colonize the West Bank\nand perhaps more.\n2. In the 1980s an extremist religious Palestinian\nmovement, Hamas, appeared. Its stated goal is to\ndestroy Israel. It now controls Gaza. (The secular\nFatah still controls the West Bank.)\nB. Secular communities on both sides have greatly moderated\ntheir views, and now largely accept the need to share\nPalestine/Israel with one another. Secular Israelis (for\nexample, former Prime Minister Ehud Olmert and former\nKadima party leader Tzipi Livni) accept the notion of a\nPalestinian state. Secular Palestinians (for example,\nPalestinian President Abu Mazen) accept the need to\nrecognize and live with Israel.\nC. Since 1949 Israel has become far more secure from conquest,\nand control of the West Bank has become far less important\nto Israeli security.\n\n1. Israel has developed a secure nuclear arsenal that makes\nIsrael unconquerable.\n2. Israel achieved peace with Egypt in 1979, lifting threat\nof Egyptian attack.\n3. The Soviet Union collapsed in 1991, removing Syria's\nsource of weapons.\n4. The Syrian, Iraqi, and Iranian economies have stagnated,\nwhile Israel has prospered.\n5. The U.S. invaded Iraq in 2003 and occupied it during\n2003-2011. Iraq is now a failed state, incapable of\naggression.\n6. Syria fell into civil war in 2011 and is also incapable\nof aggression.\n7. The Israeli military has adopted new technologies while\nArab militaries have stagnated.\nOverall, threat of Arab/Iranian invasion from the east has\nbecome implausible.\nVI. SOLUTIONS TO THE ARAB-ISRAELI CONFLICT: LARGE OPTIONS\nA. Partition the land of Palestine--the two-state solution.\n1. Through agreement, and failing that,\n2. By Israeli fiat.\n3. By UN fiat.\nB. Create a binational state with power-sharing between Jews\nand Arabs. Once proposed by dovish Zionists (Martin\nBuber, Judah Magnes, Ahad Ha'am); later proposed by\nPalestinian hard-liners.\nC. Palestinian exhaustion, eventual submission to Israeli\ndomination. A greater Israel solution.\nD. Expel (or \"transfer\") Palestinians into Jordan if they\ndon't submit to Israel. Eventually the Palestinians would\naccept life in Jordan. Another greater Israel solution.\nE. The Jews eventually leave the Middle East as the Crusaders\ndid in 1300. This is the rejectionist Palestinian\nsolution--often masked under solution B, \"binational\nstate.\"\nWhich solutions are feasible? How do we know? What evidence\nis needed to judge their feasibility?\nVII. MEANS TO A 2-STATE SOLUTION\nMost experts argue that only solution VI \"A\", partition,\nholds promise of durable peace in the near term.\nIf so, how could partition be achieved?\nA. New historical narratives.\n1. Israelis and Palestinians could take responsibility\nfor their own misdeeds and stop false blaming of the\n\nother.\n2. Israelis and Palestinians could put more blame for the\nconflict where it belongs--on the Christian west--and\nless on each other.\na. Palestinians could then grant the Zionist\nenterprise some moral legitimacy.\nb. Israelis could more easily admit their own\ncruelties toward the Palestinians, knowing that\nthey could attribute these in a final sense to the\nChristians instead of taking full responsibility\nfor these cruelties themselves.\nB. Could the U.S. impose peace? Specifically, could it frame\nan American final-status peace agreement and then persuade\nboth sides to accept it with carrots and sticks?\nVIII. WHERE LIES JUSTICE IN THIS CONFLICT? JUDGING MORAL CLAIMS\nTO ISRAEL/PALESTINE: CRITERIA\nA. Religious claims--\"God gave it to us.\" (A Jewish claim,\nechoed by the Jews' evangelical Christian allies; and a\nPalestinian claim.) Jews point to the Covenant passages\nof Genesis and Exodus. Palestinians claim that Palestine\nis \"Muslim land\" and that Palestinians are enjoined to\ndefend it by the religious requirement to defend all\nMuslim lands under attack.\nB. Ancient ownership--\"We had it first.\" A Jewish and\nPalestinian claim. Jews note their ancient presence in\nPalestine back to 1200 BCE. Palestinians counter by\nnoting their likely relationship to the Canaanites and\nother ancients who owned Palestine before the Jews. They\nalso note that in ancient times the Jews lived mainly in\nthe highlands of the West bank. Jewish settlement in the\nlowlands, including Tel Aviv, was sparse and brief. Under\nan \"ancient ownership\" principle the Israeli Jews and\nPalestinians would trade places.\nC. Longest tenure--\"We had it longest.\" (A Palestinian and\nJewish claim. In fact it's a close-run thing.)\nD. Most recent tenure--\"We had it last.\" (A Palestinian\nclaim.)\nE. Current tenure--\"We have it now.\" (A Jewish claim\nregarding Israel within 1967 lines; and a Palestinian\nclaim regarding the West Bank, Gaza, East Jerusalem.)\nRelated: \"It's ours under civil law. Please respect\nproperty rights!\" (A Palestinian claim.)\nF. Necessity--\"Our straits are more dire than yours--we need\nPalestine to survive, you don't.\" Also, \"Palestinians can\nlive in any one of 21 Arab states; Jews have only one\n\nJewish state.\" (A Jewish claim.)\nG. Religious importance of the land--\"Israel-Palestine is key\nto our faith!\" Jews point to the central importance to\nJudaism of the ancient Jewish temple in Jerusalem and the\nGrave of the Patriarchs in Hebron. Palestinian Muslims\npoint to the Dome of the Rock mosque in Jerusalem.\n(Christians once made similar claims; interesting they no\nlonger do so.)\nH. Illegitimacy of the opponent's status as heir--\"You are\nnot descendants of those from whom you claim you inherited\nrights to Palestine.\" A Palestinian claim, arguing that\ntoday's Jews are descended from Jewish converts from\nKhazaria, and cannot trace family lineage back to ancient\nPalestine.\nI. Human rights--\"You can't take Palestine without\nsubjugating and expelling us, because we live there now.\nThat's barbaric!\" (Mainly a Palestinian claim, although\nIsraelis make a parallel claim to denounce Palestinian\nrejection of Israel's right to exist.)\nJ. Best use--\"You wasted the land, we made it bloom.\" (A\nJewish claim.)\nK. Forfeit by misconduct:\n> \"You should have shared Palestine with us but\nrefused--so you lose it by moral forfeit.\" (A Jewish\nclaim.) Related: \"You started the wars between us,\nespecially the 1948 and 1967 wars--so you lost Palestine\nby moral forfeit.\" (A Jewish claim.) Related: \"The Arab\nstates expelled many Jews in 1948 and after; this\nexpulsion negates any wrong that the Jews committed\nagainst the Palestinians in 1948.\" (A Jewish claim.)\n> \"You came here to create an ethnically exclusive\nJewish state that would dominate us and expel us, not to\nlive together with us in a secular state. You are the\nones who wouldn't share Palestine! Hence your Zionist\nenterprise is morally illegitimate.\" (A Palestinian\nclaim.) Related: \"You started the wars between us. You\nknew that any indigenous people in our shoes would resist\nyour movement by force but you pushed ahead anyway. Thus\nyou knowingly provoked war by colonizing Palestine.\"\nRelated: \"You lost Palestine fair and square when you\nfoolishly launched the Bar Kokhba rebellion in 134 CE.\nThat folly canceled your claims based on ancient\npossession, as you threw the possession away.\" (A\nPalestinian claim.)\nHow can these moral claims be assessed?\nA formula to consider: \"Both the Jews and the Palestinians\n\nare right. The Christian west is wrong; it is morally\nresponsible for the conflict.\"\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture 24: The Peloponnesian War",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/95128af07f82a5b61f435d9c846c3db0_MIT17_42S18_lec24_Peloponnesian.pdf",
      "content": "17.42 // Causes and Prevention of War\nStephen Van Evera\nTHE PELOPONNESIAN WAR, 460-404 BCE\nContents of brackets [] suggest analogies to later events.\nI. THUCYDIDES: WHAT A GUY!\nMany readers across many centuries felt that Thucydides'\nPeloponnesian War evoked their own times and tragedies.\nYet readers often see different central arguments in this\nbook. Some see an anti-democratic Thucydides warning that\npublics are folly-prone and popular rule is misrule. Some see\na ruthless celebration of the inexorable cruelties of\ninternational politics and the use of force. Some see an\nanti-war book, warning that force often produces unforeseen or\nunwanted results, and should only be used as a last resort.\nWho is right?\nDoes this book identify general laws of motion that govern\nevents across time and circumstance?\nII. PHASES OF THE CONFLICT\nA. 480 BCE:\nGreece vs. Persia War\nB. 460-445 BCE: Athens vs. Sparta War Round #1\nC. 431-421 BCE: Athens vs. Sparta War Round #2--the\n\"Archidamean War\"\nD. 421-415 BCE: Truce--the Peace of Nicias\nE. 415-404 BCE: Athens vs. Sparta War Round #3--the\nExpedition to Syracuse\nRounds #2 and #3 are the focus of Thucydides' book.\nIII. MILITARY POWER: CHARACTER AND DISTRIBUTION\nA. Athens and Sparta were the two strongest powers in\nGreece. Each led a large alliance/empire.\nB. Athenian power was growing relative to Spartan power.\nC. Athens had a MAD-like military strategy. If Sparta\nattacked it by land Athens would leave its farmland\nundefended, instead withdrawing its population within\nAthens' strong walls while sending its navy to torch\nSpartan coastal cities.\nIV. SPARTAN AND ATHENIAN SOCIETY\nA. Sparta: an oligarchic slave state--an oppressive \"human\nvolcano.\" A small Spartan population ruled a large slave\npopulation. The Spartans themselves were ruled by a\nSpartan oligarchy.\n\nB. Athens: a quasi-democracy. All male Athenian citizens\ncould vote. But half of Athens' subjects were\ndisenfranchised slaves, and women could not vote. Public\nquestions were decided by direct democracy at popular\nassemblies of male voters.\nV. THE SECURITY DILEMMA IN ANCIENT GREECE\nA. The Spartan empire feared that its large slave population\nwould help an invader, hence it feared it could easily be\nconquered if an enemy force penetrated its territory.\n[Like Austria 1914 and like Hitler's 1941 view of the\nUSSR.]\nB. The Athenian empire depended on its fleet, which required\ntribute from \"allies\" (really imperial vassals). So it\nhad to keep its vassals in line and it did so by harsh\nmeasures. [Like the world imagined by mercantilists in\n1755--empire was a highly cumulative resource.]\nHence both states believed they were vulnerable to conquest\nand had to maintain empires for their own safety.\nVI. CHRONOLOGY\nA. The Greco-Persian War: Athens acquired an empire as a\nside-effect of war. [Like the USSR's conquest of Eastern\nEurope, 1944-45.]\nB. Round #1: the Sparta-Athens war of 460-445--of which we\nknow little. Thucydides has a sketchy account on pp. 87\n103.\nC. Round #2 beginnings:\n1. The dispute at Epidamnus, 433 BCE. Epidamnus was a\ntiny colony of Corcyra, which in turn was a colony of\nCorinth. Corcyra was now hostile to its progenitor\nCorinth, and was neutral in the Athens-Sparta\nconflict. Corinth was a major Spartan ally.\nA civil war erupted in Epidamnus. The losers\nappealed for aid to Corcyra. It refused aid. The\nlosers then appealed to Corinth.\nCorinth agreed and sent settlers to seize\nEpidamnus, which Corinth saw as a lost possession.\nCorcyra objected to Corinth taking a Corcyran\ncolony and asked Athens to help defend it against\nCorinth. Athens agreed because it feared that\nCorinth, a major naval power, might conquer Corcyra's\nsubstantial fleet and thereby tip the naval balance of\npower against Athens. Hence Athens offered Corcyra a\ndefensive alliance.\nHowever, offensive and defensive behavior proved\nhard to distinguish at sea. This allowed Corinth to\nlater claim (to Sparta) that Athens had broken the 30\n\nyear truce, which had ended the war of 460-445 BCE, by\nacting offensively. Thus this local dispute was the\nfirst trigger to a vast war. [Sarajevo]\nBackground causes of the clash over Epidamnus:\na. Security fears in Athens caused it to care who\ncontrolled Corcyra.\nb. Greeks had no agreed rules to determine\nownership of rebel colonies. Hence ownership of\nrebel Epidamnus was undefined. Did it belong to\nCorcyra or Corinth? The matter was unsettled.\n2. The dispute at Potidaea, 432 BCE. Athens, fearing war\nwith Corinth and Sparta, tightened control over its\ncolony Potidaea by ordering Potidaea to tear down its\ncity walls and hand over hostages. Potidaea rebelled\ninstead. Corinth--fearing the long-term growth of\nAthenian power and anxious to contain it--sent help to\nPotidaea. It thereby violated the 30-year truce of\n445. [Athens toward Potidaea = G.W. Bush to others:\n\"You are with us or with the terrorists.\"]\nBackground causes of the clash over Potidea:\na. Security fears in Athens caused it to care who\ncontrolled Potidea, hence to take harsh measures\nto enforce Athenian control of Potidea.\nb. These harsh measures provoked Potidea to rebel,\nnot comply. The spiral model in action?\nc. Security fears in Corinth then caused Corinth to\nbreak the truce with Athens by supporting\nPotidea's rebellion.\nD. Sparta's decision for war, 431 BCE.\n1. Sparta saw the rise of Athenian power and feared that\na stronger Athens could destroy Sparta. [Germany\nfeared rising Russia, 1914]\n2. Corinth lied to Sparta--\"Athens is breaking the 30\nyears truce! They are starting a war!\"--and Athens\nfailed to reply to these lies. [Dinwiddie, Shirley\nand Duquesne, 1754]\n3. Sparta offered pretexts for war--priests, goddesses,\ncurses. Every reason for war was trotted out except\nthe real one: Sparta's fear of Athens' rising power.\n[Vietnam, Gulf of Tonkin 1964]\nE. The moderate Pericles died and the violent Cleon and\nAlcibiades rose to power in Athens. The moderate\nArchidamus died and Brasidas rose to power in Sparta.\n[The rise of the Ludendorff/Hindenburg ultra-hawkish\n\"silent dictatorship\" in Germany, 1914-1918.]\nF. The growth and later contraction of Athenian war aims.\n1. Athens won a big victory at Sphacteria. It then\nrefused to settle on its original peace terms. [US in\n\nKorea 1950, Sebastopol 1855]. Was war causing war?\nAthens was then sobered up by ...\n2. Athenian defeats at Delium and Amphipolis. These\ndefeats finally convinced Athens to make a truce--the\nPeace of Nicias, 421-415 BCE.\nG. Mytilene, an Athenian colony, saw Athens' harsh treatment\nof other colonies and decided to revolt before the same\nfate befell it. But Athens believed the revolt had \"no\nreason\" and was unprovoked. Hence Athens saw need to\nfurther scare its colonies with even harsher treatment.\nAthens considered killing all Mytilenians (Cleon pushed\nfor this) but relented.\nH. Round #3 beginnings: the truce broke down.\nI. Athens destroyed Melos, a rebellious Athenian colony.\nAthens killed all military-age Melian men and sent the\nMelian women and children into slavery.\nCompare the Mytilene Debate and the Melian Dialogue:\nthe latter was nastier. Ethical concerns disappeared\nfrom the discussion. Regarding justice, the Athenians\nsimply declared that \"the strong do what they have the\npower to do and the weak accept what they have to\naccept.\" (Thucydides, p. 402)\nDid Thucydides' think ethics mattered? Yes. \"Those\nwho really deserve praise are the people who, while human\nenough to enjoy power, nevertheless pay more attention to\njustice than they are compelled to do by their\nsituation.\" (Thucydides, p. 80.)\nJ. The Athenian expedition to Syracuse [Germany's\nunrestricted submarine warfare campaign, 1917]\n1. Athenians did little research before launching the\nexpedition. They were ignorant of basic facts such as\nSicily's size and population.\n2. Athens' aims were vast; Syracuse's aims soon became\nvast [Britain and France in 1755, US in 1941, US and\nChina in 1950.]\n3. Athens expected easy victory, believing the expedition\nwas \"an absolutely safe thing.\" This grew from:\na. Athenian ignorance of Syracuse's power.\nb. False expectation that others--Sparta and the\nSicilian states--would bandwagon with Athens,\nwouldn't balance against it. [Hitler and the Axis\nAlliance.]\nc. False expectations of help from Egesta (see\nbelow).\n4. Athens expected a fun, cheap war. Alcibiades told\nAthenians that the Syracusan Expedition was an\nopportunity for \"gaining new experience\" and to avert\nthe \"ruin\" that comes with being \"idle.\" [1914.]\n\n5. Athenians wrongly thought their decision for war was\nreversible. Alcibiades told Athenians that if things\nwent poorly the Athenian forces could simply \"come\nback again.\"\n6. Athenian strategy was disintegrated. Athenians said\nSyracuse was so strong it was a serious threat, and so\nweak it could be easily conquered.\n7. Egestaean blue smoke and mirrors--Egesta manipulated\nAthenian perceptions. Egesta told Athens:\na. \"Beware the transnational Dorian conspiracy\nagainst Athens! Syracuse, being Dorian, is part\nof it!\"\nb. \"If you fight Syracuse others in Sicily will join\nyour side!\"\nc. \"We Egesteans have huge financial resources and\ncan help a lot!\"\n8. When the Expedition later faced disaster Nicias (the\ncommander) feared making a necessary and prudent peace\nbecause he feared being pilloried for it by Athens'\nhawkish public. So he fought on to ruin.\nK. Catastrophe for Athens. The Syracusan expedition was\ndestroyed in 413 BCE. But Athens survived anyway for\nnine more years (413-404 BCE)! [Germany 1914-1918.]\nVII. WHAT CAUSED THE PELOPONNESIAN WAR? WHY DID IT ESCALATE AND\nCONTINUE? POSSIBLE CAUSES\nA. Windows:\n1. Preventive war by Sparta, 431 BCE: a window of\nvulnerability.\n2. Preventive escalation by Sparta, 414 BCE: a window of\nopportunity.\nB. Offense and Defense:\n1. Security was a major goal on all sides:\na. Athens' goal: to maintain the political division\nof maritime Greece, since a unity of non-Athenian\nmaritime Greece could threaten Athens.\nb. Sparta's goal: to ease its vulnerability to\ninvaders that arose from its oppressive social\nstructure.\nc. Sparta's and Corinth's goal: to avert the threat\nposed by rising Athenian power.\n2. \"Chain gang\" dynamics in the Spartan and Athenian\nalliances:\na. Corinth could drag Sparta to war because Sparta\nfeared that otherwise Corinth might defect;\ncausing Megara to defect; causing Sparta's\ndownfall.\nb. Athens was dragged into war by Corcyra for similar\n\nreasons. [Serbia and Austria dragged Europe to\nwar in 1914]\n3. Offensive and defensive conduct proved to be\nindistinguishable. [1914]\n4. Offense was believed easy militarily. Campaign after\ncampaign--by Thebes, Corinth, Sparta, and Athens--was\nlaunched amid assurances that \"it's a sure thing.\"\n5. Bandwagon beliefs prevailed on both sides.\nC. Conflict spirals:\n1. Athens vs. Potidaea: Potidaea revolted in response to\nAthens' efforts to tighten control. These efforts\ntriggered more rebellion, not less.\n2. Athens vs. Mytilene: Athens provoked the Mytilene\nrevolt but failed to see this, instead thinking the\nrevolt was unprovoked. Hence it inferred that even\nharsher policies toward its colonies were called for.\n3. Athens vs. Syracuse: Athens exaggerated Syracusan\nhostility by imagining that Syracuse was part of a\nfalse Dorian hostile conspiracy; then it made Syracuse\nhostile by attacking it. Athens also expected that\nSparta and the Sicilian states would bandwagon with\nAthens if Athens sent an imposing expedition with\nSyracuse; in fact they balanced against it. (Thuc VI J\n3b.)\n4. Sparta opted for war in 431 partly because (Thucydides\nimplies) it falsely thought Athens had broken the 30\nyear truce. A case of \"exaggerate the hostility of\nothers' conduct.\"\nD. Lack of clear strategy ---> Forgetting of original aims\nand purposes in Athens. For example, Athens continued\nthe Syracusan expedition even after the important\npremises that underlay it (e.g., that Sparta wouldn't\nenter the fray on Syracuse's side) were disproven.\nE. Poor evaluation of policy ideas, especially in wartime.\nThucydides is dismayed by the quality of public\ndiscourse. See, for example, above on Athenian mis-\nestimates of Syracuse's power and below on evaluators\nbeing shouted down in wartime and on the destructive\nactions that Nicias took because he feared the Athenian\nmob.\nF. Pericles' hubris: \"I can handle everything--I needn't\ntrain successors.\" [Like Bismarck?]\nG. Other war causes from this course found in the\nPeloponnesian war:\n1. False optimism about war outcomes.\n2. Cheap war, fun war expectations. (Alcibiades: the\nSyracusan Expedition was an opportunity for \"gaining\nnew experience\" and to avert the \"ruin\" that comes\n\nwith being \"idle.\")\n3. Chauvinist mythmaking. Athenians indulged in this.\n4. Both sides fought to control resources believed\ncumulative, and to maintain credibility.\n5. Manipulation by Allies: Corinth manipulated Sparta;\nEgesta manipulated Athens.\nH. War ----> War\n1. Reciprocal growth of war aims.\n2. Rise of superhawks in wartime.\n3. The tyranny of sunk costs. Alcibiades: \"After having\nsailed out in such forces [the Athenians] ought not to\ndisgrace themselves by going home with nothing to show\nfor it.\" (Thuc. p. 440.)\n4. Fear that negotiation will be taken as a sign of\nweakness. Pericles warned: \"Do not send embassies to\nSparta: do not give the impression that you are bowed\ndown under your present sufferings!\" (Thuc. pp. 162\n163.)\n5. McCarthyism: evaluators were shouted down or worse.\nSee Thucydides, pp. 242-243. During the war Greeks\ncame to believe that \"anyone who held violent opinions\ncould always be trusted, and anyone who objected to\nthem became suspect.\" And \"fanatical enthusiasm was\nthe mark of a real man.\" And \"to think of the future\nand wait was merely another way of saying one was a\ncoward; any idea of moderation was just an attempt to\ndisguise one's unmanly character; ability to\nunderstand a question from all sides meant that one\nwas totally unfitted for action.\" Not a climate\nconducive to calm evaluation of options.\n6. Growing barbarism on both sides as the war proceeds.\nVIII. MORAL OF THE STORY: NEVER USE FORCE?\nThucydides warns of the over-use of force. Does this\nwarning apply universally? Does history also offer instances\nwhen force brought good results? Does it offer instances of\nthe under-uses of force?\nConsider history's many successful uses of force: the\nSpanish/French/British/U.S. \"Indian Wars\" against native\nAmericans--a cruel but successful land grab; the U.S. war\nagainst Mexico, 1846-1848--a profitable escapade; the U.S.\nwars on Germany and Japan in World War II; Bismarck's wars of\nGerman unification; the 1989 U.S. invasion of Panama; and the\nBritish war to recover the Falklands from Argentina, 1982.\nSome might also list the U.S. Persian Gulf war, 1991;\nIsrael's 1948 and 1967 wars against the Arabs; the Arabs'\n1973 war against Israel; and the Greeks' defensive war\nagainst Persia before 480 BCE. In these cases war aims were\n\nachieved without falling into a quagmire. How can quagmires\nbe distinguished from instances when force will succeed?\nConsider also under-uses of force. Should the Wampanoag\nand Narragansett nations have wiped out the New England\nEnglish settlers when they could, in 1620-21? Should Britain\nand France have attacked Germany in 1936?\nWere contemporary U.S. wars with Afghanistan (2001-) and\nIraq (2003-2011) a good or a bad use of force?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lecture1: CourseOverview",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/9e06e45594a9ca5d3440bd62c3f4e445_MIT17_42S18_lec1_Overview.pdf",
      "content": "17.42 // Causes and Prevention of War // MIT\nInstructor: Stephen Van Evera\n17.42 COURSE OVERVIEW\nI. COURSE QUESTIONS\n> What causes war? Including: wars of the past, present, and\nfuture.\n> What general phenomena cause war?\n> What were the causes of specific wars? Who caused\nspecific wars (e.g., World War I?\n> How can war best be prevented?\n> Why has war changed? Until 1945 most wars were interstate,\nnow most wars are civil wars. Also, warfare diminished\nsharply after 1945. Why?\n> Will another world war someday occur? If so, what will be its\ncauses?\n> We focus on interstate war. For civil war, see 17.582,\n\"Civil War,\" usually taught by Prof. Roger Petersen,\nsometimes by Prof. Fotini Christia, and open to\nundergraduates with permission of the instructor.\nII. SCHOLARSHIP ON THE CAUSES OF WAR IS INCOMPLETE. John\nBurgess started the Columbia School of Political Science in 1881\nto find a solution to the war problem. We now have some answers\nbut big questions remain.\nIII. WHAT THEORIES OF WAR ARE YOU EXPECTING TO HEAR DISCUSSED IN\nTHIS CLASS?\nPlease share your expectations.\nIV. IDEAS OF THE COURSE: FAMILIES OF HYPOTHESES\nA. Military factors:\n> Arms cause war, arms control or disarmament can prevent\nwar.\n> \"First-move advantage\" causes war. Examples: the 1967\nIsrael-Arab war and World War I.\n> \"War is more likely when states are insecure. This\nhappens when conquest is easy.\" World War I is the\nclassic example but most wars illustrate, including the\nCold War, US vs. China 1950, Germany vs. Europe 1939, the\nPeloponnesian War, and the 2003 Iraq war.\n> Do weapons of mass destruction (WMD)--nuclear or\nbiological weapons--cause peace or war? Is the possible\nfuture spread of WMD to more states, or even to sub-state\norganizations like terrorists or individuals, a cause of\nwar?\nB. Misperception: false optimism; nationalist mythmaking;\nmilitarism; the stupidity of bureaucracies; myths purveyed\nby religious establishments; ingroup-outgroup dynamics and\ntheir role in causing misperception. Examples of\nmisperceiving states: Germany before WWI and WWII; Japan\nbefore WWII; Athens before its expedition to Syracuse; al-\nQaeda today; Saddam Hussein before the 1991 and 2003 Gulf\nwars; the US in Vietnam and before the second Gulf war\n\n(2003).\nC. Religion as a cause of war and peace. Under what\nconditions do religions become aggressive and/or violent?\nD. Diplomatic/foreign policy bungles and blunders.\nAppeasement as a cause of war.\nE. Other causes of war: climate change, dictatorship,\npersonality disorder, men and their testosterone.\nF. A class theme: pre-modern war was often about material\nconflicts of interest. Modern wars are often wars of\nillusions and misperceptions.\nV.\nCLASS MISSIONS\nA.\nSpecific course missions: explaining historical cases;\nmaking/testing theories of war's causes; making\nprescriptions. How can war be prevented?\nB.\nBroad course missions: to help students learn how to ask\nquestions, devise and frame explanations and arguments,\nmarshall evidence, and present arguments and evidence. How\nto distinguish the essential from the trivial in an unformed\ndomain.\nC.\nWe focus on developing your communication skills. MIT\nalumni have reported that they later found they needed more\ncommunication and leadership skills to realize their\npotential. We are here to help with that.\nVI. NINE CASES EXPLORED: Peloponnesian War, Seven Years War,\nWars of German Unification, World War I, World War II,\nKorea, Israel-Arab conflict, 2003 US-Iraq War, the US-al-\nQaeda war/Clash of Civilizations.\nOther current wars will also be mentioned: India-\nPakistan, Ukraine, ISIS, the U.S.-North Korea confrontation.\nVII. GRADES AND REQUIREMENTS\nA. Background required: none. Students with zero history\nbackground are welcome. No knowledge of international or\ndiplomatic history is assumed for this course. We start\nfrom the beginning.\nB. Requirements: see the syllabus.\nC. Discussion sections are important. Sections are small.\nHence they won't work if you don't attend regularly and try\nto contribute to discussion. Help us make sections work!\nA section highlight: Debates on responsibility for the two\nworld wars are featured in coming weeks.\nVIII. SOCIAL SCIENCE AND THE CAUSES OF WAR\nA. The premise of social science: like the physical world,\n\nhuman affairs are governed by regularities, or \"laws of\nmotion.\" These laws of political/social motion can be\ndivined by using the scientific method, and knowledge of\nthese laws can be used to solve social problems.\nB. Inferring and testing general social science theories.\n1. Observation vs. experimentation.\n> Controlled experiments can rarely be used to study\ninternational politics.\n> In observational science, \"natural experiments\" or\n\"quasi-experiments\" are especially useful. These are\nsituations that occur in history that have attributes\nof controlled experiments. They offer strong tests\nof theories.\n2. Large-n (statistical) method vs. case study method.\nC. Explaining specific events: Carl Hempel's \"covering law\"\n(or \"deductive nomological\") method.\n1. Identify valid theories.\n2. Identify the scope conditions required for their\noperation.\n3. Investigate whether the theory's cause and required\nscope conditions are present in the case to be\nexplained. If so, the theory helps explain the case.\nD. Criticisms of social science.\n1. \"Accidents drive history--'butterflies cause\nhurricanes' in history--hence general theories cannot\nexplain much.\" Annie Oakley had a chance to shoot\nKaiser Wilhelm while on tour in Europe before 1914.\nWhat if she had?\n2. \"Each historical event is unique; hence generalization\nis futile, even misleading\"--a claim made by\nhistorians. Implied: politics has no laws of motion.\n3. \"Controlled experiments are necessary to test theories.\nThey are often infeasible in political science, so it\ncan't be a science.\"\n4. \"Data on human affairs is unreliable or lacking, hence\nsocial science has no reliable empirical basis.\" This\nis sometimes true but often the reverse is true.\nCompare social science with paleontology: we can\ninterview our subjects and read their memoirs; natural\nscientists can't. Social scientists really can't\ncomplain on this score.\nE. Controversies in social science about how to do it.\n1.\nSocial scientists disagree on the best way to measure\ncausal relationships between phenomena. Should\nscholars use large-n methods, experimental methods, or\ncase methods?\n2.\nIn the history field the study of international history\nand military history has been pushed aside by other\nsubjects, such as the study of race, class and gender\nissues. Questions of race, class and gender are very\nimportant, but so are international and military\nhistory. Their marginalization harms our ability to\nstudy the causes and prevention of war.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "17.42_S18 Lectures 12 - 14: The Origins of the First World War, Part I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/c242147661cdf09dbe58fa57ec451ca9_MIT17_42S18_lec12-14_WWI_I.pdf",
      "content": "17.42\nStephen Van Evera\nTHE ORIGINS OF THE FIRST WORLD WAR, PART I\nI. WORLD WAR I IN PERSPECTIVE\nA. In 1890 Europe was a nice, quiet place. Things were cool.\nGermany was sated. Question: How could such a great war\nemerge from such an untroubled world?\nB. World War I started on August 1, 1914, ended November 11,\n1918. At the start of the war the Triple Entente (Britain,\nFrance, Russia, plus Serbia and Belgium) faced the Central\nPowers (Germany and Austria-Hungary). Italy, Rumania, the\nUnited States and others later joined the Entente, Turkey and\nBulgaria joined the Central Powers. Ultimately the Entente\ndefeated the Central Powers.\nC. World War I was the bloodiest war in history to that point.\nBy one estimate 25,955,000 people died (12,981,000 military,\n12,974,000 civilian).1\nD. WWI unleashed an avalanche of violence that pervaded the 20th\ncentury. It caused the 1917 Russian revolution, which caused\nStalinism and its vast murders (perhaps 30 million or more\nkilled), and led eventually to the 1947-1989 Cold War, which\ncaused the Korean, Vietnam, Afghan, Angolan, and\nNicaragua/Contra wars, killing millions more. The Vietnam\nwar caused further trouble, including the rise of the Khmer\nRouge to power in Cambodia in 1975 and their murder of 2\nmillion Cambodians. The Afghan war of the 1980s caused the\n1996 rise of the Taliban in Afghanistan, who sheltered Al\nQaeda, leading to 9/11/01 and the current U.S.-al-Qaeda war.\nMany argue that World War I also caused the rise of the Nazis\nin Germany and thus both World War II and the Holocaust.\nWorld War II in turn caused the rise to power of communist\ngovernments in China, North Korea, Yugoslavia and elsewhere.\nThese governments in turn perpetrated mass murders on an epic\nscale and started several wars. The U.S. narrowly avoided\nwar with North Korea in 1994 and war remains possible.\nBottom line: World War I was a taproot of violence, and a\ndark scar across human history.\nII. WHO CAUSED THE WAR? SIX VIEWS\nA. \"Germany caused the war.\" Three main variants are offered.\nThe first two paint the war as inadvertent, the last paints\nit as deliberate.\n1. The minimalist Germany-blaming view: a \"calculated risk\"\nby Germany gone bad (Konrad Jarausch). Germany\nconsciously risked a continental war in July 1914 in\norder to make gains for the German/Austrian alliance-\n1 Ruth Leger Sivard, World Social and Military Expenditures\n1996 (Washington DC: World Priorities, 1996). I added Sivard's raw\ndata.\n\nspecifically, to achieve the smashing and partition of\nSerbia. Germany preferred the prewar status quo to a\ncontinental war but did knowingly risk such a war to\nachieve the destruction of Serbia. The war was\ninadvertent but was caused by witting risk-taking.\n2. Two intermediate Germany-blaming views:\na. Germany preferred a smashing and partition of Serbia\nto a continental war (that is, a war against France\nand Russia); preferred a continental war to the prewar\nstatus quo and/or to the simple smashing of the Black\nHand terrorist group; and preferred the prewar status\nquo and/or the smashing of the Black Hand to a world\nwar (that is, a war against Britain, France, and\nRussia). The world war that happened was inadvertent,\nbut Germany did choose a continental war, making the\ncontinental war advertent. This is the view of\n\"Fischer School\" moderates, exemplified by Imanuel\nGeiss. And a more extreme variant:\nb. Germany preferred a continental war to a smashing and\npartition of Serbia and to the prewar status quo, and\nplotted to cause it. But Germany did still prefer the\nprewar status quo to a world war. Again, the world\nwar was inadvertent, the continental war was\nadvertent.\n3. The maximalist Germany-blaming view: Germany preferred\neven a world war to the prewar status quo and plotted to\ncause the war that occurred. This is argued by some\nFischerites and by Dale Copeland.\nThese three Germany-blaming views can be distinguished by\nrank-ordering the preferred outcomes that the view ascribes\nto Germany. Five outcomes were possible:\nStatus Quo Ante Bellum (SQAB): Things remain as they were in\nJune 1914. Serbia is wholly independent and feisty toward\nAustria-Hungary. This SQAB outcome was logically possible\nbut very unlikely, as no state preferred it: the Entente\nstates agreed with Germany and Austria that something had to\nbe done to control Serbian extremism.\nAustria and Germany compel Serbia to Destroy Black Hand\n(SDBH): Austria and Germany coerce the Serbian government to\nsmash the Black Hand and other extremist nationalist Serbian\norganizations. Serbia survives intact and sovereign.\nAustria Destroys Serbia (ADS): Austria conquers Serbia (or\ncompels its surrender) and partitions it, probably between\nBulgaria, Greece, and Albania. No more Serbia. Russia,\nFrance and Britain do not intervene.\nContinental War (CW): War erupts between the Central Powers\nand the Dual Alliance (i.e., France and Russia). Britain\nremains neutral.\nWorld War (WW): Britain joins France and Russia in a war\nagainst Germany and Austria.\nFeatured relevant evidence: the December 8 1912 \"War\n\nCouncil.\" Strong Germany-blamers allege that German leaders\ndecided on war at this meeting.\nThree views on why Germany was expansionist can be\ndistinguished:\n1. \"Germany was mindlessly expansionist in almost random\ndirections--it sought \"Weltmachtpolitik\" largely for\nreasons of prestige, and for imagined economic gain.\"\nAnd older view.\n2. \"Germany believed that its security depended on\nAustrian survival, and that Serb subversion threatened\nto destroy Austria. Hence it resolved to destroy\nSerbia. It also resolved to destroy Russia because it\nfeared Russia's rising power and knew Russia would\ndefend Serbia.\" A self-defense argument. A newer\nview.\nB, C, D, E, F.\"Russia, or Serbia, or Britain, or France, or\nAustria caused the war.\"\n1. During 1919-1945 many Germans alleged that Britain\norganized the encirclement of Germany and conspired to\ncause the war. Germany, they said, was wholly innocent.\n2. Sidney Fay and other scholars put prime responsibility on\nAustria and Russia. Some others heavily blame Serbia.\nSome blame France and Britain for not restraining Russia\nmore firmly. Some suspect that France egged Russia on.\nIII. WHAT CAUSED THE WAR? EIGHT EXPLANATIONS FOR WORLD WAR I\nA common view frames the \"MAIN\" causes of the war: Militarism,\nAlliances, Imperialism, Nationalism\" (from Sidney Fay).\nA. \"Militarism caused the war.\" Before 1914 European societies\nwere swept by a widespread popular glorification of war and\nof all things military. Europe's militaries gained undue\ninfluence over foreign policy, which they used to press for\nwar. These public attitudes and military influence on policy\ncaused the war.\nB. \"Alliances caused the war.\" The major European powers were\ndragged into a local Balkan dispute by Europe's encompassing\nsystem of competing international alliances. The war stemmed\nfrom a local Balkan dispute between Serbia and Austria. The\nrest of Europe was dragged into this dispute because they\nwere allied with Serbia or Austria, or with one of their\nallies, and hence were compelled to join the war.\nC. \"Imperialism caused the war.\" By 1914 the major European\npowers had long contested for control of overseas empire for\nseveral centuries. This competition continued in the decades\nbefore 1914, as manifest in the Fashoda crisis of 1898 and\nthe Moroccan crises of 1905-6 and 1911, in which European\npowers nearly came to blows over control of the upper Nile\nregion and Morocco. The July 1914 crisis that produced World\nWar I also stemmed from such rivalries for colonies.\n\nD. \"Nationalism caused the war.\" Malignant supercharged\nnationalism and nationalist mythmaking fueled expansionism\nand conflict throughout Europe, causing the war.\n1. The rise of nationalist feeling among stateless European\npeoples led them to demand their own states. This fueled\nconflict among the major powers. Most notably, it led\nSerbia to seek to unifying the Serbian people with other\nSouth Slavic people under Serb control. Hence Serbia\nsought to subvert and dismember Austria-Hungary, where\nmany South Slavs lived. The rise of nationalism also\nmagnified divisions among Austria-Hungary's eleven\nnationalities, leading Austrian elites to fear that\nAustria might be torn apart by foreign subversion, and to\nlash out against Serbia when Serbia pursued such\nsubversion. This brought Austria and Serbia into\ncollision, and thereby brought Austria into collision\nwith Russia, which supported Serbia in part from pan-\nSlavic nationalist sentimentality.\n2. Chauvinist nationalist mythmaking across Europe fueled a\nspirit of self-entitlement and contempt for others. This\nfostered belligerence and expansionism, especially in\nGermany, Serbia, and Russia.\nFour more explanations:\nE. \"Crisis bungling caused the war.\" In this view no European\npower willfully risked war. Instead European leaders\nmismanaged the July crisis.\n1. Russian and French leaders misunderstood the nature of\nmobilization.\na. \"Russia and France began pre-mobilization without\nrealizing that mobilization meant war, and Russia\nbegan without knowing that partial Russian\nmobilization against Austria was impossible.\"\nb. \"Russia began pre-mobilizing in the false hope that\nRussian pre-mobilization measures would deter Germany\nfrom moving toward war. Instead German hawks used\nRussian pre-mobilization as an excuse to mobilize and\nmore to war on July 30.\"\n2. German leaders misunderstood the nature and meaning of\nmobilization measures.\na. \"German Chancellor Bethmann-Hollweg did not fully\nunderstand that mobilization meant war until war was\ninevitable. Specifically, he did not learn of the\nsecret attack on Liege embedded in the German\nmobilization plan until July 31.\"2\nb. \"German Chancellor Bethmann-Hollweg did not realize\nthat the German military would insist on German\n2 May and Williamson, \"Identity of Opinion\": 365.\n\nmobilization and war, forcing the end of peace\nefforts, if Russia and France launched preliminary\nmobilization.\nHence Bethmann let the crisis start and continue without\nunderstanding how quickly it would explode into war.\"\n3. \"British leaders (Grey) did not realize that mobilization\nmeant war; hence they unwisely failed to restrain Russian\nmobilization.\"\n4. \"Austria failed to give Russia its evidence showing that\nSerbia was responsible for the death of the Austrian\nArchduke. Had Russia known Serbia's guilt it would have\nsympathized more with Austria's position.\"\n5. \"The French ambassador to Russia, Maurice Paleologue,\nfailed to warn French leaders that Russian leaders were\nthinking of mobilizing against Austria-Hungary in order\nto coerce it. Hence French messages urging restraint on\nRussia arrived too late (July 30) to prevent Russian\nmobilization.\"3\n6. \"German leaders (Jagow) falsely assured Russia that\nGermany would tolerate Russian partial mobilization\nagainst Austria, leading Russia to mobilize.\"\n7. \"German leaders wrongly hoped Britain would stand aside\nfrom a continental war. This stemmed partly from\nBritain's failure to make up its mind to fight, and issue\nclear warning to Germany, until after the July crisis was\nout of control. In part this reflected British foreign\nsecretary Grey's failure to foresee the speed of events;\nin part it reflected the secrecy of German plans to\nattack Belgium.\"4\nF. \"The explosive military situation caused the war.\" Three\nvariants:\n1. Inflexible military mobilization plans caused the war by\nspreading a local Balkan war outward to engulf all\nEurope.\n2. An imperative to rush to mobilize, stemming from a first-\nmove (first-mobilization) advantage, caused the war.\n(Some argue that Russian's slowness in mobilizing\ninclined it to mobilize precipitously, but this is\nfalse).\n3. The widespread belief in the power of the offense and the\ngeneral embrace of offensive military plans primed the\nworld for war. This explosive military backdrop\nmagnified the dangers posed by a minor crisis and normal\nblunders by leaders. They had no margin for error.\n3 May and Williamson, \"Identity\": 376. However, some argue\nthat Paleologue cooperated loyally with the hawkish French president\nPoincare to bring war, and omitted to send warning to France of\nRussian thoughts of mobilizing on Poincare's instructions.\n4 May and Williamson, \"Identity\": 361, 379.\n\nG.\nH.\nA.\nB.\nPerhaps these explosive military conditions and beliefs\nstemmed from undue military influence on states' policies and\nperceptions. If so they stemmed from \"militarism\" (see\nabove).\n\"Imperial Collapse caused the war.\" The collapse of the\nOttoman and Ottoman empires created a rule-free vacuum in the\nBalkans. The escaped Balkan nations fought each other for\ndominance there, while Austria, Germany and Russia contended\nfor influence. The Austro-Serb and Austro-Russian collisions\nin the Balkans caused the war.\n\"Distempered/deformed states caused the war.\" European\naristocratic elites deflected demands for pluralism and\nsocial equality by granting some secondary powers to elected\nparliaments, while still reserving key powers for the\nmonarchs, who were presumed likely to protect the existing\naristocratic order. Bismarck developed this model, and\nGermany under Wilhelm II, Austria under Franz Josef, and\nRussia under Nicholas II followed it. But the task of\nrunning modern industrial states proved beyond the capacity\nof most hereditary monarchs, especially if they lack strong\nadministrative institutions, without a Bismarck-quality prime\nminister/chancellor at the Monarch's side. Hence these\nregimes could not properly formulate, assess and implement\npolicy. Instead chaos reigned and blunders proliferated.\nThese regimes also were penetrated and coopted by parasitic\nspecial interests, including professional militaries, whose\ninfluence was unchecked by countervailing political\ninstitutions (such as parliaments or courts) and who pressed\nfor belligerent policies that brought war. (From Dominic\nLieven.)IV. BACKGROUND TO WAR: EUROPE 1890-1914\nThe Powers' relative strength. They ranked as follows: (1)\nGermany; (2) Britain; (3) Russia; (4) France; (5) Austria-\nHungary; (6) Serbia. (See Paul Kennedy tables, attached to\nthese notes, especially Tables 7 and 9.)\nSocial structure and domestic politics in Europe, 1890-1914.\n1. Autocrats and oligarchs who feared upheaval ruled much of\nEurope, i.e., in Austria-Hungary, Germany, and Russia.\n2. Germany's neurotic King: Kaiser Wilhelm II (1888-1918)\nwas traumatized, neglected and rejected as a child. His\nmother never bonded with him. He reacted by rejecting\nwhatever his peace-minded, democracy-minded parents stood\nfor. So he fired Bismarck, embraced the German military\nas his family, and gave hawkish German military leaders\nfree rein.\n3. Militarism (see assigned Martin Kitchen readings).\na. Militaries had great influence, especially in\nGermany--due partly to Kaiser Wilhelm's emotional\nembrace of the German officer corps.\nb. The military's ideas were dangerous. These included:\ni.\nOffense is easy // windows are common and large\n// surprise is essential.\n\nii. Waving big sticks makes others nice.\niii. Others are hostile.\niv. Empires are valuable / allies are essential.\nv.\nWar is short, glorious, even fun.\nvi. \"Let's start a war!\" European militaries were\nintensely and uniformly hawkish. All pressed\nfor war in 1914.\n4. Self-glorifying nationalist myths in the schools--history\nas chauvinist fiction (see assigned Langsam reading).\n5. Lack of independent scholarship. Professors were\npropagandists for the state who repeated fatuous ideas\ninstead of evaluating them, especially in Germany (see\nL.L. Snyder, German Nationalism, in \"further readings,\"\nchapter on scholars).\nC. The changing nature of war.\n1. The rise of mass armies and the mobilization system.\na. During the late 19th century European states adopted\nmobilization systems for their armies. Mobilization\nmultiplied size of the armies of Russia/France by\n2.46x, and multiplied the size of the armies of\nGermany/Austria by 2.82x. (Niall Ferguson, Pity of\nWar).\nb. Preliminary mobilization vs. full mobilization.\nc. Why did mobilization mean war? Because Germany's\nSchlieffen plan mandated a surprise attack on Belgium\nimmediately after mobilization began; and because\nGermany would have a fleeting military advantage\nafter it mobilized and it felt it had to exploit this\nadvantage by attacking.\nd. Was secret mobilization possible? No, but some\nRussians and French (Gen. Joffre) wrongly thought so,\ninfluenced by the Ludendorff Memorandum, acquired by\nFrench intelligence.\n2. The rise of the power of the defensive on the\nbattlefield: machine guns, barbed wire, railroads, and\nmass armies.\n3. The growth of the \"cult of the offensive\" and offensive\nwar plans: Germany's Schlieffen Plan, France's Plan XVII,\nRussia's Plan 20, Austria's offensive war plans. Even\nBelgium had advocates for an offensive war plan! And\nFrance's General Joffre pushed for a French offensive\ninto Belgium as well as Germany!5 German, French and\nAustrian officers paid little heed to evidence against\ntheir plans, or even to logic.6 French general Ferdinand\nFoch argued that the increased power of the machine gun\nhelped the offense! British officers said that the\nmachine gun could be overcome by troops imbued with a\nwillingness to \"take casualties\" (T.H.E. Travers).\n5 May and Williamson: 375.\n6 May and Williamson: 347.\n\nQuestion: What war plans would have made the most sense for\neach power? Once at war, what was the best way for each side\nto fight?\nD. Perceptions in Europe (see assigned Geiss reading).\n1. The rise of international Social Darwinism and the cult\nof the offensive.\n2. Big stick ideas in Germany: Admiral Tirpitz's Risk Theory\nand Kurt Riezler's theory of \"bluff diplomacy.\" (Riezler\nwas Bethmann's top aide.)\n3. The self-encirclement of Germany after 1890, and the\nGerman myth that others had conspired to bring it about.\nGermany had only one adversary (France) in 1890. By 1907\nit had three adversaries--France, Russia and Britain-\njoined against Germany in the Triple Entente, and only\none ally (Austria). German belligerence provoked the\nEntente into forming.\n4. \"We need an empire!\"\na. Germany, Austria-Hungary and Serbia were expansionist.\nGermans had three imperial dreams: of an empire in\nEurope (\"Mitteleuropa\"), Africa (\"Mittelafrika\") and\nthe Middle East, toward current Iraq/Kuwait/Iran.\nAustria dreamed of expanding into the Balkans, down\ntoward the Aegean. Serbia dreamed of a vast South\nSlavic empire that would include Serbs, Croats,\nSlovenes, Bosniaks, Macedonians, and Albanians.\nRussia, sought to expand its influence in the Balkans.\nFrance and Britain were not expansionist.\nb. German focus shifted from Expansionism to what might\nbe called Destructionism around 1912. Specifically,\nGermany came to focus as much on destroying Serbian\nand Russian power as on expanding Germany's sphere of\ninfluence.\n5. \"War is good for you\"--a remarkable idea found\neverywhere. 40,000-50,000 assembled outside the Kaiser's\nBerlin palace in a carnival atmosphere on August 1, as\nwar erupted.7\nE. German expansion and the Fischer Controversy (see Geiss\nreading).\n1. How expansionist was Germany? The \"War Council\" of\nDecember 8, 1912: did Germany plot World War I at this\nmeeting? If so, what should we see in the historical\nrecord? What should we see in the record if this meeting\nmeant little?\n2. How expansionist was Austria-Hungary? Answer: very\nexpansionist. Austrian leaders were determined to smash\nSerbia.\n3. How expansionist were the other European powers? Serbs\nwere very expansionist toward Austria. Russia was mildly\nexpansionist--mainly toward the Balkans, a bit toward the\nMay and Williamson: 347.\n\nOttoman empire. Britain and France were not\nexpansionist.\n4. What theories explain German, Austrian and Serbian\nexpansion?\nF. The decline of British power and the Anglo-German Detente of\n1912-1914.\nG. The appearance of a tight (offensive) network of alliances in\nEurope transformed alliances from \"epimachies\" to\n\"symmachies.\") Defensive alliances appeared in 1879-1894;\nthese spread and became offensive in the years before 1914.\nH. The crises of 1905-6, 1908-9, 1911, and 1912-13. These\ncrises concerned whether Germany or France would control\nMorocco (1905-6 Algeciras crisis), whether Austria could\nannex Bosnia (1908-9 Bosnia crisis), Morocco again (1911\nAgadir crisis), and Serbian expansion in the Balkans (1912-13\nBalkan crises). Were these causes of trouble or mere\nsymptoms of other causes?\nI. The naval and land arms races. Were these causes of trouble\nor mere symptoms of other causes?\nJ. The rise of economic interdependence (it was high in 1914!)\nand international cooperation (e.g., international agencies\nregulated railways, postal service and telegraph).\nK. The alleged appearance of dumb national leaders in Russia,\nGermany, Britain, and Austria-Hungary. (Perhaps an artifact\nof Deformed/distempered states? Of the speed of the July\ncrisis?)\nL. The rise of (incompetent?) peace movements: \"Let's arbitrate\ndisputes!\"; \"Let's have arms control!\"\nV. THE JULY CRISIS: JUNE 28-AUGUST 4, 1914\nAsk three questions of these events: (1) What caused the war?\ni.e. what conditions, events, or actions made the war inevitable?\n(2) Who caused the war? What states, or political groups or\npersons within states? (3) Why did these actors cause the war?\nWhat expectations and intentions animated their actions? Were\nthey trying to cause war? Expecting to cause war?\nHistorians point to eight possible keys to the July crisis:\nthe June 28 Sarajevo assassination; the July 5-6 German Blank\nCheck to Austria-Hungary; Russian and French preliminary military\nmobilization on July 25; German refusal to restrain Austria\nduring July 25-29; Germany's brief peace effort from 2:55 a.m. to\n1:00 p.m. July 30; Germany's decision to halt this belated peace\neffort and move to full mobilization, decided at ~1:00 on July\n30; British dithering during July 23-28; Russian partial military\nmobilization against Austria on July 29; and Russian's decision\nfor full mobilization at 4:00 p.m. on July 30.\nA. The Sarajevo Assassination of Austria's Archduke Ferdinand,\nJune 28. Was the Serbian government responsible? Unknown at\nthe time, the Serbian military intelligence chief, Col.\nDragutin Dimitrijeviƒ (a.k.a. \"Apis\") trained and armed three\nof the assassins. The Serb prime minister discovered the\n\nB.\nC.\nD.\nplot, tried to prevent it, then later concealed it.8\nThe German \"Blank Check\" to Austria, July 5-6. Germany\nagreed to back an Austrian war against Serbia, aimed at the\ndestruction and partition of Serbia. Germany promised to\nfight Russia if Russia intervened to protect its Serbian ally\nfrom this destruction. Germany could have chosen, more\nmodestly, to back Austrian coercion to compel Serbia to\ndestroy the Black Hand and other violent extremist Serb\nnationalist groups, while leaving Serbia intact. Russia,\nBritain, and France would have accepted this remedy. So\nGermany's decision to back Austria's more extreme goal, of\ndestroying Serbia, proved fateful, as Russia and France would\nnot accept it.\n1. German expectations: what were they?\n> Did the German government think that such a war would\nprovoke Russia to intervene? Most Germans saw a 50-50\nchance that the crisis would bring war with Russia.\n(See Geiss). Those expecting no war thought Russia\nwould sit quietly, from monarchic solidarity, and for\nwindow reasons: Germany's good window was the Russian-\nFrench bad window.\n> Was British intervention in such a war expected? Most\nGermans thought not. And some who expected British\nintervention thought it would be deferred, so it would\ncome too late for Britain to save France from German\nconquest.\n2. German desires: what were they?\n> Did Germany want a war? The elite was split. The army\nactively wanted a continental war, the Kaiser didn't.\nIn my view the center-of-gravity among the elite had\nthe following preference ordering: (1) Austria Destroys\nSerbia (ADS); (2) continental war (CW); (3) Serbia\nDestroys Black Hand (SDBH); (4) status quo ante bellum\n(SQAB); and the least-desired result was world war\n(WW). The Kaiser preferred the status quo ante to\ncontinental war (CW) or world war (WW), but the army\npreferred WW by July 30, and prevailed--ultimately in a\nconfrontation on July 30 that was essentially a coup.\nBut who cares what I think? You figure it out!\nThe Austrian Ultimatum to Serbia, July 23. This had a 2-day\ndeadline, and was designed to be impossible to accept.\nAustria's plan was then to smash the Serbian army and\npartition Serbia, but not to annex any of it, because\nAustria-Hungary's Hungarian politicians wouldn't accept more\nSlavs in the empire.\nThe Serbian reply, 6:00 p.m., July 25. Serb leaders\nconsidered accepting all Austria's demands but in the end\nrejected Austria's demand to allow Austrian officials to\nparticipate in the Serbian enquiry into the assassination of\nMay and Williamson: 351.\n\nFranz Ferdinand. (This would have exposed Serbia's role in\nthe murder.)\nOn receiving this reply the Austrian government promptly\nordered mobilization of its army against Serbia. This order\nreached the army command at 9:23 p.m. July 25; it posited\nJuly 27 as \"alarm day,\" and July 28 as the first day of\nmobilization.\nE. Russian and French Preliminary Mobilization and Russian\nPartial Mobilization. Russia ordered preliminary\nmobilization against Germany and Austria on July 25 at 4:00\np.m.--even before the Serbian time limit expired at 6:00.\nThese measures were promptly detected by Germany (on July\n26). Russian leaders also decided in principle to fully\nmobilize later against Austria (but not Germany) if Austria\nattacked Serbia. Russia issued orders to ready this\nmobilization late on July 24.9\nFrance began pre-mobilization on July 25. These measures\nhad little immediate effect because they were still\nsubstantially undetected by July 28, but they had effects on\nJuly 30.\nRussian and French preliminary mobilization was cited as\na key reason for Germany to mobilize by German warhawks\n(Generals Moltke and Falkenhayn) on July 30. In this way\nthese premobilizations helped catalyze the war.\nWhy did the Russians pre-mobilize? With what\nexpectations? It seems some Russian leaders hoped to deter\nGermany from further belligerent actions. Russians also\nsought to secure a first-mobilization advantage in what some\nthought was an inevitable war.\n1. One Russian leader, Agriculture Minister Krivoshein,\nargued that Russian preliminary mobilization offered the\nbest route to peace, as it would deter Germany from\nfurther moves toward war.\n2. Russian leaders feared that Germany meant to push matters\nto war and felt compelled to move first to prepare for\nthe coming conflict. Sazonov, the Russian Foreign\nMinister, outbursted on July 24 \"C'est la guerre\nEuropeenne!\" when he heard the terms of the Austrian\nultimatum. It seems the Russians already expected war at\nthis point: they felt the Austro-German move showed that\nAustria and Germany planned to smash Serbia, and that\nRussia would have to allow this or fight; and since\nRussia wouldn't allow this, it would have to fight.\nPerhaps they also felt that Germany would merely find\nanother excuse for war if Russia conceded on Serbia,\nmaking concessions fruitless.\nIf so, it seems that the Russians pre-mobilized to\ngain the first strike (really first-mobilization)\nadvantage in the war that Germany and Austria seemed to\nMay and Williamson: 369.\n\nbe forcing upon them. Since war seemed inevitable, and\nthe Russians thought that whoever mobilized first would\nhave the upper hand, quick mobilization made sense.\nThe July crisis occurred against the backdrop of\nmanifest signs of war fever in Germany (e.g., the\nJubilees of 1913) that Russia had detected.\n3. Russian civilians (Sazonov and the Czar) were unaware\nthat mobilization meant war until later in the crisis.\nWe can surmise that their soldiers talked them into these\npreliminary measures before the civilians realized that\nmobilization meant war.\n4. When they authorized preliminary mobilization and partial\nmobilization against Austria, Russian civilians (Sazonov\nand the Czar) were apparently unaware that Russia had an\n\"all or nothing\" mobilization plan; Russia had to\nmobilize against Germany if it mobilized against Austria.\nMoreover, the Russian chief of staff failed to explain\nthis to the civilians at the key meetings on July 24-25.\nThis misconception eased the Russian decision in\nprinciple to mobilize against Austria.\nThis suggests a civil-military split in Russia on\nwhether to mobilize preemptively against Germany: the\ncivilians were not yet sold on preemption on July 24-25.\nIt also suggests that the Russian military manipulated\nunwitting civilian consent to Russian military measures.\nIn fact partial Russian mobilization against Austria-\nHungary was impossible--Russia could choose only full\nmobilization or none. But Russian officers agreed to\npartial mobilization in principal on July 24, without\ntelling Russian civilians that this was impossible.10\n5. Russian leaders did not receive Austria's dossier showing\nSerb responsibility for the Sarajevo murder of Archduke\nFerdinand until after Russia had pre-mobilized on July 25\nand mobilized on July 30.\nF. Germany hangs tough, July 25-30.\nThe British proposed mediation of the crisis under British\nauspices. But the Germans kept pushing Austria forward,\nseeking to get the fait accompli finished. The German\nproblem: Austria wouldn't be ready to attack Serbia until\nAugust 12. Hence, to foreclose diplomacy, the Germans urged\nAustria to declare war on Serbia. Austria then declared war\non Serbia on July 28, and shelled Belgrade on July 29. The\nAustrian war declaration in turn helped spur Russia to\ndeclare partial mobilization on July 29, and then full\nmobilization on July 30, by convincing Russia that it would\nhave to fight to protect Serbia or see it destroyed.\n1. Germany runs a red warning light. The Germans learned of\nthe Russian pre-mobilization measures on July 26 or 27,\n10 May and Williamson: 368, 370.\n\none or two days after they began.11 If Germany sought to\nprevent a continental war, this news should have shocked\nGermany into backtracking--i.e. pushing Austria to accept\na \"Halt in Belgrade\" and an SDBH final outcome. But\nBethmann kept on a belligerent course until overnight on\nJuly 29-30. This supports the inference that the Germans\nviewed a continental war with equanimity, preferring it\nto an SDBH outcome, and feared only a world war.\n2. Bethmann sabotages the Kaiser's peace effort. The Kaiser\nwasn't told of the Serbian reply for several days. When\nhe saw it, he wrote (July 28) that \"every cause of war\nfalls to the ground.\" He then asked Bethmann to ask\nAustria to offer the \"Halt in Belgrade\" peace plan to\nRussia.\nBut Bethmann didn't do it! He waited half a day, and\nthen late on July 28 he expressed only vague, mild wishes\nto the Austrians. He never told them that the Kaiser\nstrongly wanted the crisis ended!\nWhat outcome was Bethmann seeking? He now knew that\nBritain, France and Russia would not allow an Austria\nDestroys Serbia (ADS) outcome; but they would have\nallowed a smashing of the Black Hand (SDBH). SDBH was\napparently not enough for Bethmann. He faced what seemed\na binary choice at that point: Serbia Destroys Black Hand\n(SDBH) or Continental War (CW); his hopes of Austria\nDestroys Serbia (ADS) were gone. He fatefully chose CW.\nG. The German peace effort, 2:55 a.m.-1:00 p.m. July 30.\nLate on July 29 Bethmann reversed course and tried to pull\nthe Austrians back from the brink, in messages sent\novernight, asking Austria to accept the Halt in Belgrade\npeace formula. These messages were sent at 2:55 a.m. and\n3:00 a.m. July 30.\nWhat caused Bethmann to change course? Some say he was\nscared by the latest warning from Britain, received at 9:12\np.m. July 29, which indicated that Britain would join a war\nand would do so quickly. Some say Russian partial\nmobilization convinced him that Russia wouldn't cave. Some\nsuggest that Belgian mobilization alarmed him (Germany\nlearned of significant Belgian mobilization measures on July\n29 at 4:00 p.m.) It also seems possible that until late on\nJuly 29 Bethmann hoped to entice Britain to remain neutral\nby offering it a deal: \"We will refrain from attacking\nFrance in a continental war if you British agree not to\nintervene in the war\"; and that Bethmann only learned that\nBritain would not buy this deal late on July 29, in\nconversation with a British official.\nH. Germany abandons its peace move, decides for mobilization\nand war, July 30.\nGeneral Moltke sabotaged Bethmann's effort early on the\n11 Suggesting July 26 are May and Williamson: 349.\n\nafternoon of July 30. At 1:00 p.m. he appeared unannounced\nat a key meeting between Bethmann, Falkenhayn and Tirpitz to\nsuccessfully demand an end to peace efforts. At 2:00 p.m.\nhe sent a telegram to Austria urging immediate Austrian\nmobilization against Russia and promising that Germany would\nfollow suit. Shortly thereafter, and before learning of\nRussian full mobilization, he pressured top German leaders\n(Bethmann) to commit to decide at noon July 31 whether to\nmobilize. This was, in essence, a decision to mobilize, but\nto delay that decision a day in hopes Russia would decide to\nmobilize in the interim, which would give Germany an excuse\nfor its action. Moltke pointed to ongoing Russian and\nFrench pre-mobilization as his excuse for mobilizing,\narguing that Germany could not let Russia and France gain\nthe lead in preparation. Moltke also exploited the Kaiser's\nangry misinterpretation of Czar's remark that Russian\nmobilization had begun 5 days earlier to claim that the\nKaiser wished to end negotiation and begin mobilization.\nThis decision meant that the war would have broken out\nabsent Russian full mobilization, with German mobilization\non July 31. (Thus the outbreak of the war was \"over\ndetermined.\")\nTwo events apparently occasioned Moltke's switch from\nlaid-back observer of the crisis to fierce war advocate.\n1. The Kaiser, in an emotional moment, while misperceiving a\nnote from Russia's Czar Nicholas II, minuted a document\nwith apparent orders to German officials to abandon\nGerman peace efforts. Moltke seized this authority and\nran with it.\n2. Russian and French preliminary mobilizations were\nproceeding. Germany was flooded with alarming reports of\nthese mobilizations. Moltke pointed to these pre-\nmobilizations as excuses for mobilizing, arguing that\nGermany could not let Russia and France gain the lead in\npreparation.\nWhat motives underlay Moltke's insistence on war at\nthis point? Two different interpretations are possible.\ni. Moltke had hoped to preserve peace, but was finally\npersuaded that Germany had to mobilize in order to\nkeep pace with the Russian, French, and Belgian\npreliminary mobilizations. He explained this\nnecessity to Bethmann with sadness in his heart. He\npushed for both preliminary and full German\nmobilization because they could not be separated\nunder the German military system.\nii. Moltke, having desired an opportunity for preventive\nwar against Russia for months or years, and seeing in\nthe July crisis a fine opportunity for such a war,\nwas delighted that Russia, France and Belgium gave\nGermany a pretext to mobilize; was enraged that\nBethmann might waste this pretext by settling the\ncrisis; and coerced Bethmann to cease his efforts.\n\nG.\nH.\nJ.\nInterpretation #i suggests World War I was an\ninadvertent war caused by military factors that made\nthe July crisis exceptionally dangerous.\nInterpretation #ii suggests that World War I was a\ndeliberate war of aggression by Germany, which\nplotted to provoke, and then exploited, the excuse\nthat Russian mobilization presented in order to wage\na war of continental conquest.\nBritish dithering. The British didn't warn Germany that they\nwould promptly intervene if Germany launched a continental\nwar until July 29, chiefly because the British themselves did\nnot firmly decide what they would do until August 3.\nRussian mobilization\n1. Partial mobilization was decided July 29 and announced\npublicly. Russia did this in a panicked reaction to\nAustria's declaration of war on Serbia--the conditions of\nits July 24 decision for \"partial mobilization in\nprinciple\" has not been met, as Austria had not yet\ninvaded Serbia. Russia nevertheless decided for partial\nmobilization partly to deter Austria from invading\nSerbia, partly to offset Austrian mobilization against\nSerbia, partly to forestall Austrian mobilization in\nGalicia, and perhaps partly because on July 27 German\nSecretary of State Jagow lullingly assured the Allies\nthat Germany would accept a partial Russian mobilization\nthat was aimed only at Austria-Hungary.\n2. Full mobilization was ordered on 4:00 p.m., July 30, and\ndone secretly, with no public announcement. Reasons: the\nconviction that war was inevitable, spurred by four\nfactors:\na. Reports that the Germans were threatening war against\nRussia if Russian partial mobilization against\nAustria proceeded.\nb. Reports that the Austrians still resisted any\ncompromise.\nc. Warnings from Russian military officers warning that\nmobilization was an all-or-nothing matter--a partial,\nSouth-only mobilization would make more difficult a\nfull mobilization later if that became necessary.\nd. False reports that German mobilization had begun.\nAn interpretation of the crisis to consider. German military\nleaders rightly knew that Germany could not mobilize in\nsecret for any length of time; but Russian and French\nmilitary leaders thought Germany could mobilize secretly,\nwith the French believing secret mobilization was possible\nfor a week (See Joffre's memoirs). Why was this? Perhaps\nGerman officers, hoping to bait Russia or France into early\nmobilizations that would then justify German mobilization and\nthe preventive war that many German officers sought, primed\nFrench and Russian intelligence with false information that\nwould scare them into a premature mobilization. Joffre does\nindicate that his 7-days-of-secret mobilization estimate came\n\nfrom secret intelligence on Germany. Had I been a German\ngeneral, and had I desired a preventive war, this is exactly\nwhat I would have wanted the French to believe, and I would\nhave polluted French intelligence with exactly this sort of\ninformation. (This is a speculative interpretation, but I\nknow no evidence against it.)\nK. By July 30 the outbreak of WWI was overdetermined. Three\nindependent paths to war were underway: German general\nmobilization, Russian general mobilization, and French\ngeneral mobilization. Even if any two were stopped the third\nwould have produced war. This illustrates how explosive the\nmilitary situation was.\nVI. WORLD WAR I AS A CASE STUDY: USING CASES TO TEST THEORIES, &\nUSING THEORIES TO EXPLAIN CASES. JUDGING THE FISCHER ARGUMENT.\nFischerites claim that Germany favored continental war or even\nworld war over the status quo ante bellum. Fischer critics\nclaim Germany preferred SQAB to WW or CW. Who is right? What\nwere German preferences? What evidence is most telltale?\nVII. AFTERMATH OF WWI\nA. German territorial losses (see map); and reparations. The\nmyth that Versailles's terms were harsh toward Germany.\nB. The non-occupation of Germany. A mistake?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.42_S18 Readings: Further Readings",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-42-causes-and-prevention-of-war-spring-2018/c95c530ff21095756ea544c4a8e661c9_MIT17_42S18_Further_Readings.pdf",
      "content": "FURTHER READING\nI: THE CAUSES OF WAR\nThe causes of war, general and theoretical works:\nJack S. Levy and William R. Thompson, Causes of War (Malden, MA:\nWiley-Blackwell, 2010).\nJack Levy, \"The Causes of War: A Review of Theories,\" in Philip\nE. Tetlock, Jo L. Husbands, Robert Jervis, Paul C. Stern, and\nCharles Tilly, eds., Behavior, Society, and Nuclear War, Vol. 1\n(NY: Oxford University Press, 1989), pp. 209-333.\nJack S. Levy, \"The Causes of War and the Conditions of Peace,\"\nAnnual Review of Political Science, Vol. 1 (1998), pp. 139-165.\nGreg Cashman, What Causes War? An Introduction to Theories of\nInternational Conflict (NY: Rowman and Littlefield, 2013)\nRobert I. Rotberg and Theodore K. Rabb, eds., The Origins and\nPrevention of Major Wars (New York: Cambridge University Press,\n1989)\nKenneth N. Waltz, Man, the State, and War (NY: Columbia\nUniversity Press, 1954)\nGeoffrey Blainey, The Causes of War (NY: Free Press, 1973)\nManus I. Midlarsky, ed., Handbook of War Studies (Boston:\nUnwin Hyman, 1989)\nLeon Bramson and George W. Goethals, eds., War: Studies from\nPsychology, Sociology, Anthropology, rev. ed. (New York: Basic\nBooks, 1968)\nBernard Brodie, War and Politics (NY: Macmillan, 1973), pp. 276\n340 (\"Some Theories on the Causes of War\")\nDonald Kagan, On the Origins of War and the Preservation of Peace\n(NY: Doubleday, 1994)\nLester Kurtz, ed., Encyclopedia of Violence, Peace, and Conflict,\n3 vols. (San Diego: Academic Press, 1999)\nArms and war:\nThomas Schelling, Arms and Influence (New Haven: Yale U. Press,\n1966), parts.\nThomas Schelling and Morton Halperin, Strategy and Arms Control\nNY: Twentieth Century Fund, 1961), parts.\nRobert Jervis, \"Cooperation Under the Security Dilemma,\" World\nPolitics, January, 1978, pp. 167-214.\n\nSean M. Lynn-Jones, \"Offense-Defense Theory and its Critics,\"\nSecurity Studies, Vol. 4, No. 4 (Summer 1995), pp. 660-694.\nMarlies Ter Borg, \"Reducing Offensive Capabilities--the Attempt\nof 1932,\" Journal of Peace Research, Vol. 29, No. 2 (1992), pp.\n145-160.\nJack S. Levy, \"Declining Power and the Preventive Motivation for\nWar,\" World Politics, Vol. 40, No. 1 (October 1987), pp. 82\n107.\nMisconception:\nRobert Jervis, \"War and Misperception,\" in Robert I. Rotberg and\nTheodore K. Rabb, eds., The Origins and Prevention of Major\nWars (New York: Cambridge University Press, 1989), pp. 101-126\nRobert Jervis, \"Hypotheses on Misperception,\" World Politics Vol.\n20, No. 3 (April, 1968), pp. 454-479, also reprinted in George\nH. Quester, ed., Power, Action and Interaction (Boston: Little,\nBrown, 1971), pp. 104-132.\nIrving L. Janis, Victims of Groupthink (Boston: Houghton Mifflin,\n1972)\nErnest R. May, \"Lessons\" of the Past: The Use and Misuse of\nHistory in American Foreign Policy (NY: Oxford University\nPress, 1973).\nAaron Wildavsky, \"The Self-Evaluating Organization,\" Public\nAdministration Review, Sept./Oct. 1972, pp. 509-520.\nGender and War:\nJoshua S. Goldstein, War and Gender (Cambridge: Cambridge\nUniversity Press, 2001)\nLinda Rennie Forcey, \"Feminist and Peace Perspectives on Women,\"\nin Lester Kurtz, ed., Encyclopedia of Violence, Peace, and\nConflict, 3 vols. (San Diego: Academic Press, 1999), 2:13-20.\nJennifer Turpin, \"Women and War,\" in ibid., 3:801-813.\nMark Tessler, Jodi Nachtwey, and Audra Grant, \"Further Tests of\nthe Women and Peace Hypothesis: Evidence from Cross-National\nSurvey Research in the Middle East,\" International Studied\nQuarterly, Vol. 43, No. 3 (September 1999), pp. 519-532.\nMarysia Zalewski and Jane Parpart, eds., The \"Man\" Question in\nInternational Relations (Boulder: Westview, 1997)\nAnne E. Hunter, ed., On Peace, War, and Gender: A Challenge to\nGenetic Explanations (New York: The Feminist Press, 1991)\n\nVirginia Held, \"Gender as an Influence on Cultural Norms Relating\nto War and the Environment,\" in Arthur H. Westing, ed.,\nCultural Norms, War and the Environment (NY: Oxford University\nPress, 1988), pp. 44-51.\nCarol Cohn, \"Sex and Death in the Rational World of Defense\nIntellectuals,\" (Center for Psychological Studies in the\nNuclear Age, 1987), pp. 1-33.\nSara Ruddick, Maternal Thinking: Toward a Politics of Peace\n(Boston: Beacon Press, 1995)\nMilitarism:\nVolker R. Berghahn, Militarism: The History of an International\nDebate 1861-1979 (NY: St. Martins, 1982)\nArden Bucholz, \"Militarism,\" in Lester Kurtz, ed., Encyclopedia\nof Violence, Peace, and Conflict, 3 vols. (San Diego: Academic\nPress, 1999), 2:423-433.\nJames Burk, \"Military Culture,\" in ibid., 2:447-462.\nGregory McLauchlan, \"Military-Industrial Complex, Contemporary\nSignificance,\" in ibid., 2:475-486.\nFrancis E. Rourke, Bureaucracy and Foreign Policy (Baltimore:\nJohns Hopkins U. Press, 1972), pp. 18-40.\nAlfred Vagts, Defense and Diplomacy (NY: Kings Crown, 1956), pp.\n263-377, 477-490.\nRichard Cobden, \"The Three Panics,\" in Richard Cobden, Political\nWritings of Richard Cobden (London: 1887)\nJuergen Arthur Heise, Minimum Disclosure: How the Pentagon\nManipulates the News (NY: W.W. Norton, 1979)\nDerek Shearer, \"The Pentagon Propaganda Machine,\" in Leonard\nRodberg and Derek Shearer, eds., The Pentagon Watchers (NY:\nAnchor, 1970), pp. 99-142.\nBernard Brodie, War and Politics (NY: Macmillan, 1973), pp.\n479-496.\nSee also representative writings on war and international affairs\nby\nmilitary officers, e.g., Friedrich von Bernhardi, Ferdinand Foch,\nGiulio Douhet, Nathan Twining, Thomas Powers, and Curtis LeMay.\n\nNationalism--general works:\nLouis L. Snyder, Encyclopedia of Nationalism (NY: Paragon House,\n1990)\nAnthony D. Smith, Theories of Nationalism, 2nd ed. (New York:\nHarper & Row, 1983).\nErnest Gellner, Nations and Nationalism (Ithaca: Cornell\nUniversity Press, 1983)\nAnthony D. Smith, The Ethnic Origins of Nations (Oxford: Basil\nBlackwell, 1986)\nE.J. Hobsbawm, Nations and Nationalism Since 1780 (New York:\nCambridge University Press, 1990)\nBenedict Anderson, Imagined Communities: Reflections on the\nOrigin and Spread of Nationalism, rev. ed. (London: Verso,\n1991)\nLiah Greenfeld, Nationalism: Five Roads to Modernity (Cambridge:\nHarvard University Press, 1992)\nStephen Van Evera, \"Hypotheses on Nationalism and War,\"\nInternational Security, Vol. 18, No. 4 (Spring 1994), pp. 5-39.\nBarry R. Posen, \"Nationalism, the Mass Army, and Military Power,\"\nInternational Security, Vol. 18, No. 2 (Fall 1993), pp. 80-124.\nIngroup-Outgroup dynamics:\nMuzafer Sherif and Carolyn W. Sherif, Groups in Harmony and\nTension: An Integration of Studies on Intergroup Relations (New\nYork: Octagon, 1966).\nLewis A. Coser, The Functions of Social Conflict (New York: Free\nPress, 1966)\n\nNationalist mythmaking:\nPaul M. Kennedy, \"The Decline of Nationalistic History in the\nWest, 1900-1970,\" Journal of Contemporary History, Vol. 8, No. 1\n(January 1973), pp. 77-100.\nBoyd C. Shafer, Faces of Nationalism (NY: Harcourt Brace\nJovanovich, 1972)\nCarlton J.H. Hayes, Essays on Nationalism (NY: Macmillan, 1926)\npp. 61-92 (\"The Propagation of Nationalism\").\nE.H. Dance, History the Betrayer: A Study in Bias (London:\nHutchinson, 1960)\nFrances Fitzgerald, America Revised: History Schoolbooks in the\nTwentieth Century (Boston: Little, Brown, 1979)\nBernard Lewis, History: Remembered, Recovered, Invented\n(Princeton: Princeton U. Press, 1975)\nHoward Zinn, The Politics of History (Boston: Beacon, 1970), pp.\n5-34, 288-319.\nHolger Herwig, \"Clio Deceived: Patriotic Self-Censorship in\nGermany After the Great War,\" in Miller, ed., Military Strategy\nand the Origins of the First World War, pp. 262-301.\nDemocratic peace theory, dictatorial peace theory:\nNils Petter Gleditsch, \"Peace and Democracy,\" in Lester Kurtz,\ned., Encyclopedia of Violence, Peace, and Conflict, 3 vols.\n(San Diego: Academic Press, 1999)\nNils Petter Gleditsch, \"Democracy and Peace,\" Journal of Peace\nResearch, Vol. 29, No. 4 (1992), pp. 369-376.\nMichael E. Brown, Sean M. Lynn-Jones and Steven E. Miller, eds.,\nDebating the Democratic Peace: An International Security Reader\n(Cambridge: MIT Press, 1996)\nZeev Maoz and Bruce Russett, \"Normative and Structural Causes of\nDemocratic Peace, 1946-1986\" American Political Science Review,\nVol. 87, No. 3 (September 1993), pp. 624-638.\nBruce Russett with William Anholis, Carol R. Ember, Melvin Ember,\nand Zeev Maoz, Grasping the Democratic Peace: Principles for a\nPost-Cold War World (Princeton: Princeton University Press,\n1993)\nStanislav Andreski, \"On the Peaceful Disposition of Military\nDictatorships,\" Journal of Strategic Studies, Vol. 3, No. 3\n(December, 1980), pp. 3-10.\n\nHuman instinct theories of war:\nDougherty and Pfaltzgraff, Contending Theories of International\nRelations pp. 274-288.\nWaltz, Man, the State, and War, pp. 16-79.\nBrown, Causes and Prevention of War, pp. 9-15.\nSamuel S. Kim, \"The Lorenzian Theory of Aggression and Peace\nResearch: A Critique,\" in Falk and Kim, The War System, pp. 82\n115.\nAlbert Somit, \"Humans, Chimps, and Bonobos: The Biological Bases\nof Aggression, War, and Peacemaking,\" Journal of Conflict\nResolution, Vol. 34, No. 3 (September 1990), pp. 553-582.\nWilliam James, \"The Moral Equivalent of War,\" in Bramson and\nGoethals, War, pp. 21-31; William McDougall, \"The Instinct of\nPugnacity,\" in ibid, p. 33-43; Sigmund Freud, \"Why War?\" in ibid,\npp. 71-80; and Margaret Mead, \"Warfare is Only an Invention, Not\na Biological Necessity,\" in ibid, pp. 269-274.\nReligion and war:\nDavid Noel Freedman and Michael J. McClymond, \"Religious\nTraditions, Violence, and Nonviolence,\" in Lester Kurtz, ed.,\nEncyclopedia of Violence, Peace, and Conflict, 3 vols. (San\nDiego: Academic Press, 1999), 3:229-239. A survey of the\nproblem of religion and war.\nSamuel P. Huntington, The Clash of Civilizations and the Remaking\nof World Order (NY: Simon and Schuster, 1996)\nRobert Spencer, Islam Unveiled: Disturbing Questions about the\nWorld's Fastest-Growing Faith (San Francisco: Encounter, 2002)\nMichael Barkun, Religion and the Racist Right: The Origins of the\nChristian Identity Movement (Chapel Hill, NC: University of\nNorth Carolina Press, 1997)\n\nCivil war, its control:\nErrol A. Henderson, \"Civil Wars,\" in Lester Kurtz, ed.,\nEncyclopedia of Violence, Peace, and Conflict, 3 vols. (San\nDiego: Academic Press, 1999), 1:279-288.\nErrol A. Henderson, \"Ethnic Conflict and Cooperation,\" in ibid.,\n1:751-764.\nTimothy D. Sisk, Power Sharing and International Mediation in\nEthnic Conflicts (Washington, D.C.: United States Institute of\nPeace, 1996)\nStephen John Stedman, Donald Rothchild, and Elizabeth M Cousens\n(eds.), Ending Civil Wars: The Implementation of Peace\nAgreements (Boulder, CO: Lynne Rienner, 2003)\nJoseph V. Montville, ed., Conflict and Peacemaking in Multiethnic\nSocieties (NY: Lexington Books, 1991)\nRadha Kumar, \"The Troubled History of Partition,\" Foreign\nAffairs, Vol. 76, No. 1 (January/February 1997), pp. 22-34.\nNegotiation & diplomacy:\nRoger Fisher and William Ury, Getting to Yes: Negotiating\nAgreement Without Giving In (Boston: Houghton Mifflin, 1981)\nRoger Fisher, International Conflict for Beginners (New York:\nHarper & Row, 1969)\nFred Charles Ikle, How Nations Negotiate (Millwood, N.Y.: Kraus\nReprint, 1982, first pub. 1964)\nAlexander L. George, Forceful Persuasion: Coercive Diplomacy as\nan Alternative to War (Washington, D.C.: United States\nInstitute of Peace, 1991).\nHarold Nicolson, Diplomacy (London: Oxford U. Press, 1964)\nRaymond Cohen, \"The Rules of the Game in International Politics,\"\nInternational Studies Quarterly vol. 24, no. 1 (March 1980) pp.\n129-50.\n\nMediation:\nJacob Bercovitch and David Wells, \"Evaluating Mediation\nStrategies: A Theoretical and Empirical Analysis,\" Peace and\nChange, Vol. 18, No. 1 (January 1993), pp. 3-25, and works\ncited therein.\nThomas Princen, Intermediaries in International Conflict\n(Princeton: Princeton University Press, 1995)\nLimited War:\nRichard Smoke, War: Controlling Escalation (Cambridge: Harvard\nUniversity Press, 1977)\nThomas Etzold, \"Clausewitzian Lessons for Modern Strategists,\"\nAir University Review, May/June 1980.\nFor more references, see Smoke's bibliography.\nArms races:\nCashman, What Causes War?, pp. 172-184.\nSusan G. Sample, \"Arms Races and Dispute Escalation: Resolving\nthe Debate?\" Journal of Peace Research, Vol. 34, No. 1\n(February 1997), pp. 7-22.\nSamuel P. Huntington, \"Arms Races: Prerequisites and Results,\" in\nRobert J. Art and Kenneth N. Waltz, eds., The Use of Force, 3rd\ned. (NY: University Press of America, 1988), pp. 637-670.\nII: HISTORICAL SOURCES\nGeneral surveys of global international history include:\nRobert R. Palmer and Joel Colton, A History of the Modern World,\n7th ed. (NY: Knopf, 1991)\nPeter Gay and R.K. Webb, Modern Europe (NY: Harper & Row, 1973)\nTheodore Ropp, War in the Modern World (NY: Collier, 1962)\n\nFor more sources see the bibibliography in Palmer and Colton.\nAnother excellent bibliographic source is Jurgen Forster, David\nFrench, David Stevenson and Russel Van Wyk, eds., War and Society\nNewsletter: A Bibliographical Survey (Munich:\nMilitargeschlichtliches Forschungsamt, annual since 1973); it\nlists articles and book chapters relevant to international\nrelations and war.\nGeneral surveys of European international history:\nA.J.P. Taylor, Struggle for Mastery in Europe, 1848-1914 (London:\nOxford, 1971)\nJames Joll, Europe Since 1870: An International History, 4th ed.\n(London: Penguin, 1990)\nCarlton J.H. Hayes, Contemporary Europe Since 1870 (NY:\nMacmillan, 1962)\nRene Albrecht-Carrie, A Diplomatic History of Europe Since the\nCongress of Vienna, rev. ed. (NY: Harper & Row, 1973)\nAlso pertinent are the relevant books in four series of general\nhistories:\n1: The \"Langer\" series, published by Harper Torchbooks, 15-odd\nvolumes covering western history since 1200, under the general\neditorship of William Langer (e.g. Raymond Sontag, A Broken\nWorld, 1919-1939.)\n2: The Longman's \"General History of Europe\" series, covering\nwestern history since Roman times, published by Longman, under\nthe general editorship of Denys Hays (e.g. J.M. Roberts,\nEurope 1880-1945).\n3: The Fontana \"History of Europe\" series, published by\nFontana/Collins, covering history since the middle ages, under\nthe general editorship of J.H. Plumb (e.g. J.A.S. Grenville,\nEurope Reshaped, 1848-78);\n4: The \"New Cambridge Modern History\" and \"Cambridge Ancient\nHistory\" series, covering western history from the beginning.\n\nThe Seven Years War:\nOverviews:\nFred Anderson, The War that Made America: A Short History of the\nFrench and Indian War (New York: Viking, 2005)\nFred Anderson, Crucible of War: The Seven Years' War and the Fate\nof Empire in British North America (New York: Alfred A. Knopf,\n2000)\nOn the Franco-British conflict in the Seven Years War:\nPatrice Higonnet, \"The Origins of the Seven Years War,\" Journal\nof Modern History, Vol. 40 (1968), pp. 57-90\nJeremy Black, The Origins of War in Early Modern Europe\n(Edinburgh: J. Donald, 1987)\nOn the Prussian-Austrian-Russian-French war of 1756:\nLudwig Reiners, Frederick the Great (NY: Putnam, 1960), pp.\n89-121, 147-164.\nGerhard Ritter, Frederick the Great\n(Berkeley: U. of California, 1974), pp. 73-148.\nPierre Gaxotte, Frederick the Great (New Haven: Yale U. Press,\n1942), pp. 175-229, 303-342.\nThe Crimean War:\nRichard Smoke, War: Controlling Escalation (Cambridge: Harvard\nUniversity Press, 1977): 147-194 (\"The Crimean War\").\nDavid M. Goldfrank, The Origins of the Crimean War (NY: Longman,\n1994)\nNorman Rich, Why the Crimean War? A Cautionary Tale (Hanover, NH:\nUniversity Press of New England, 1985)\nAlan Palmer, The Banner of Battle: The Story of the Crimean War\n(NY: St. Martin's, 1987)\n\nThe Italian Wars of Independence:\nFrank J. Coppa, The Origins of the Italian Wars of Independence\n(NY: Longman, 1992)\nThe Wars of German Unification:\nWilliam Carr, The Origins of the Wars of German Reunification\n(White Plains, NY: Longman, 1991)\nRichard Smoke, War: Controlling Escalation (Cambridge: Harvard\nUniversity Press, 1977), pp. 80-146.\nGordon Craig, The Politics of the Prussian Army (Oxford U. Press,\n1964), pp. 180-216.\nWorld War I:\nBasic histories include:\nAnnika Mombauer, The Origins of the First World War:\nControversies and Consensus (London: Longman, 2002).\nEspecially relevant to 17.42 are pages 127-164 on the Fischer\ncontroversy, and 45-56 on the German innocence campaign.\nJames Joll, The Origins of the First World War (NY: Longman,\n1984)\nV.R. Berghahn, Germany and the Approach of War in 1914 (London:\nMacmillan, 1973)\nD.C.B. Lieven, Russia and the Origins of the First World War (New\nYork: St. Martin's, 1983)\nBarbara Tuchman, The Guns of August (NY: Dell, 1962)\nL.C.F. Turner, Origins of the First World War (London: Arnold,\n1970)\nImanuel Geiss, German Foreign Policy 1871-1914 (London: Routledge\n& Kegan Paul, 1976)\nR.J.W. Evans and Harmut Pogge von Strandmann, eds., The Coming of\nthe First World War (New York: Oxford University Press, 1990).\nSuveys of debates about the war's origins are:\nSamuel R. Williamson and Ernest R. May, \"An Identity of Opinion:\nHistorians and July 1914,\" Journal of Modern History, Vol. 79\n\n(June 2007): 335-387.\nJohn W. Langdon, July 1914: The Long Debate, 1918-1990 (NY: St.\nMartin's, 1991)\nJohn A. Moses, The Politics of Illusion: The Fischer Controversy\nIn German Historiography (London: George Prior, 1975)\nMark Hewitson, Germany and the Causes of the First World War\n(Oxford, UK: Berg, 2004)\nNiall Ferguson, \"Germany and the Origins of the First World War:\nNew Perspectives,\" Historical Journal 35 (September, 1992):\n725-52.\nOther sources on the origins of the war include:\nFritz Fischer, War of Illusions (NY: Norton, 1975)\nLuigi Albertini, The Origins of the War of 1914 3 Vols.\n(Westport, Conn.: Greenwood Press, 1980 reprint of 1952-1957\nedition.) Albertini is chaotic, but essential reading for\nthose researching World War I.\nBernadotte E. Schmitt, The Coming of the War: 1914 2 Vols.\n(Chicago: University of Chicago Press, 1930)\nImanuel Geiss, ed., July 1914: The Outbreak of the First World\nWar: Selected Documents (NY: W.W. Norton, 1967)\nRichard F. Hamilton and Holger H. Herwig, Decisions for War,\n1914-1917 (Cambridge, Eng.: Cambridge University Press, 2004).\nKonrad H. Jarausch, The Enigmatic Chancellor: Bethmann Hollweg\nand the Hubris of Imperial Germany (New Haven: Yale, 1973)\nJohn C.G. Rohl, The Kaiser and his Court: Wilhelm II and the\nGovernment of Germany (Cambridge, U.K.: Cambridge University\nPress, 1994), pp. 162-190 (on the German \"war council\" of\nDecember 8, 1912 and related matters).\nHolger H. Herwig, ed., The Outbreak of World War I: Causes and\nResponsibilities, 5th ed., rev. (Lexington: DC Heath, 1991)\nKeith Wilson, ed., Forging the Collective Memory: Government and\nInternational Historians through the Two World Wars\n(Providence, RI: Berghahn, 1996)\n\nContemporary descriptions of the political climate in Germany\nare:\nWilliam Roscoe Thayer, ed., Out Of Their Own Mouths (NY:\nAppleton, 1917)\nWallace Notestein, ed. Conquest and Kultur: Aims of Germans in\nTheir Own Words (Washington: Committee on Public Information,\n1917)\nJ.P. Bang, Hurrah and Hallelujah: The Teaching of Germany's\nProphets, Professors and Preachers (NY: Doran, 1917)\nWilliam Archer, ed. 501 Gems of German Thought (London: T. Fisher\nUnwin, 1916)\nOther works on themes pertinent to this course include:\nSteven E. Miller et al., eds., Military Strategy and the Origins\nof the First World War, rev. ed. (Princeton University\nPress,1991). See especially pp. xi-xix, 20-108, arguing that a\nEurope-wide \"cult of the offensive\" caused the war, and the\nmilitaries of Europe were responsible for this cult.\nLouis L. Snyder, German Nationalism: Tragedy of a People (Port\nWashington NY: Kennikat, 1969), esp. chapters 6\n(\"Historiography\") and 10 (\"Militarism\").\nLouis L. Snyder, From Bismarck to Hitler (Williamsport: Bayard,\n1935)\nHans Kohn, The Mind of Germany (NY: Scribner's, 1960). pp.\n251-305.\nCharles McClelland, The German Historians and England (Cambridge:\nCambridge U. Press, 1971), pp. 168-235.\nAntoine Guilland, Germany and Her Historians (NY: McBride, Nast,\n1915)\nMark Hewitson, National Identity and Political Thought in\nGermany: Wilhelmine Depictions of the French Third Republic,\n1890-1914 (Oxford, UK: Clarendon, 2000)\nJohn A. Moses, \"Pan-Germanism and the German Professors 1914\n1918,\" Australian Journal of Politics & History, Vol. 15, No. 3\n(December, 1969), pp. 45-60.\nI.F. Clarke, Voices Prophesying War (London: Oxford, 1966).\nWolfgang J. Mommsen, \"Nationalism, Imperialism and Official Press\nPolicy in Wilhelmine Germany 1850-1914,\" in Collection de\nl'Ecole Francaise de Rome, Opinion Publique et Politique\nExterieure I 1870-1915 (Milano: Universita de Milano/Ecole\nFrancaise de Rome, 1981), pp. 367-383.\n\nCarleton J.H. Hayes, France: A Nation of Patriots (NY: Octagon,\n1974).\nJack Snyder, The Ideology of the Offensive: Military Decision\nMaking and the Disasters of 1914 (Ithaca: Cornell University\nPress, 1984)\nGordon Craig, The Politics of the Prussian Army (Oxford U. Press,\n1964), pp. 217-341.\nAnnika Mombauer, Helmuth von Moltke and the Origins of the First\nWorld War (Cambridge, UK: Cambridge, University Press, 2001)\nMarilyn Shevin Coetzee, The German Army League: Popular\nNationalism in Wilhelmine Germany (NY: Oxford University Press,\n1990)\nIsabel Hull, The Military Entourage of Kaiser Wilhelm II 1888\n1918 (Cambridge: Cambridge University Press, 1982)\nIsabel Hull, Absolute Destruction: Military Culture and the\nPractice of War in Imperial Germany (Ithaca: Cornell U. Press,\n2005)\nJeffrey Verhey, The Spirit of 1914: Militarism, Myth and\nMobilization in Germany (Cambridge, Eng.: 2000).\nNicolas Stargardt, The German Idea of Militarism: Radical and\nSocialist Critics, 1866-1914 (Cambridge, Eng.: 1994)\nEmilio Willems, A Way of Life and Death: Three Centuries of\nPrussian-German Militarism: An Anthropological Approach\n(Nashville: Vanderbilt University Press, 1986)\nLawrence Sondhaus, Franz Conrad von Hotzendorff: Architect of the\nApocalypse (Boston: 2000).\nAnnika Mombauer and Wilhelm Deist, eds., The Kaiser: New Research\non Wilhelm II's Role in Imperial Germany (Cambridge, Eng.:\n2003)\nDavid Herrmann, The Arming of Europe and the Making of the First\nWorld War (Princeton: Princeton U. Press, 1996)\nTim Travers, The Killing Ground: The British Army, The Western\nFront and the Emergence of Modern Warfare, 1900-1918 (Boston:\nAllen & Unwin, 1987)\nT.H.E. Travers, \"Technology, Tactics and Morale: Jean de Bloch,\nthe Boer War, and British Military Theory, 1900-1914,\" Journal\nof Modern History, Vol. 51 (June 1979), pp. 264-286.\nMartin Kitchen, The German Officer Corps, 1890-1914 (Oxford:\nClarendon, 1968), Chapter 6, pp. 115-142 (\"The Army and the\nCivilians\".)\n\nGerhard Ritter, The Schlieffen Plan: Critique of a Myth (London:\nWolff, 1958)\nGerhard Ritter, The Sword and the Scepter: The Problem of\nMilitarism in Germany (4 vols: Coral Gables, Fla.: 1969-73).\nMarc Trachtenberg, \"The Meaning of Mobilization in 1914,\"\nInternational Security, Vol. 15, No. 3 (Winter 1990/91), pp.\n120-150.\nScott Sagan, \"1914 Revisited: Allies, Offense, and Instability,\"\nInternational Security, Vol. 11, No. 2 (Fall 1986), pp. 151\n176.\nA.J.P. Taylor, War By Time-Table (London: 1969)\nJay Luvaas, The Military Legacy of the Civil War: The European\nInheritance (Chicago: U. of Chicago Press, 1959)\nBernard Brodie, War and Politics (NY: Macmillan, 1973), pp. 1-28.\nPhillip Knightley, The First Casualty (NY: Quadrangle, 1975), pp.\n80-112 (on wartime press coverage,)\nReadable accounts of the war itself include:\nA.J.P. Taylor, The First World War (Harmondsworth: Penguin, 1966)\nMartin Gilbert, The First World War (NY: Henry Holt, 1994)\nOn Versailles an introduction is:\nAlan Sharp, The Versailles Settlement: Peacemaking in Paris, 1919\n(NY: St. Martin's, 1991)\nWorld War II in Europe:\nP.M.H. Bell, The Origins of the Second World War in Europe (NY:\nLongman, 1986)\nRaymond J. Sontag, A Broken World 1919-1939 (NY: Harper & Row,\n1973)\nE.H. Carr, International Relations Between the Two World Wars\n(NY: Macmillan, 1947)\nJackson J. Spielvogel, Hitler and Nazi Germany: A History, 3rd\ned. (Upper Saddle River, N.J.: Prentice Hall, 1996)\n\nWilliam L. Shirer, Rise and Fall of the Third Reich (NY: Simon &\nSchuster, 1960)\nEberhard Jackel, Hitler's Worldview: A Blueprint for Power,\ntrans. Herbert Arnold (Cambridge: Harvard University Press,\n1981)\nEberhard Jackel, Hitler in History (Hanover, N.H.: University\nPress of New England, 1984)\nNorman Rich, Hitler's War Aims (NY: Norton, 1973)\nIan Kershaw, Hitler, 1889-1936: Hubris (New York: W.W. Norton,\n1999)\nGary D. Stark, Entrepreneurs of Ideology: Neoconservative\nPublishers in Germany, 1890-1933 (Chapel Hill: U. of North\nCarolina Press, 1980)\nMax Weinreich, Hitler's Professors (NY: Yiddish Scientific\nInstitute, 1946)\nHans Kohn, The Mind of Germany (NY: Scribner's, 1960).\nB. H. Liddell-Hart, \"Aggression and the Problem of Weapons,\"\nEnglish Review, July 1932, pp. 71-78.\nSheri Berman, The Social Democratic Moment: Ideas and Politics in\nthe Making of Interwar Europe (Cambridge, MA: Harvard\nUniversity Press, 1998): ix-x, 176-200.\nOmer Bartov, Hitler's Army: Soldiers, Nazis, and the War in the\nThird Reich (NY: Oxford University Press, 1991)\nHolger Herwig, \"Clio Deceived: Patriotic Self-Censorship in\nGermany After the Great War,\" in Miller, ed., Military Strategy\nand the Origins of the First World War, pp. 262-301.\nKeith Wilson, ed., Forging the Collective Memory: Government and\nInternational Historians through the Two World Wars\n(Providence, RI: Berghahn, 1996)\nRichard J. Evans, In Hitler's Shadow: West German Historians and\nthe Attempt to Escape from the Nazi Past (New York: Pantheon,\n1989)\nPeter Baldwin, \"The Historikerstreit in Context,\" in Peter\nBaldwin, ed., Reworking the Past: Hitler, the Holocaust and the\nHistorian's Debate (Boston: Beacon, 1990), pp. 3-37.\nDenis Mack Smith, Mussolini's Roman Empire (Harmondsworth:\nPenguin, 1977)\nSaul Friedlander, Nazi Germany and the Jews, 1933-1939: The Years\nof Persecution (New York: HarperCollins, 1997); and Saul\nFriedlander, Nazi Germany and the Jews, 1939-1945: The Years of\nExtermination (New York: HarperCollins, 2007). This two-volume\nwork is the best current study of the holocaust.\n\nChristopher R. Browning, The Origins of the Final Solution: The\nEvolution of Nazi Jewish Policy, September 1939-March 1942\n(Lincoln, NE: University of Nebraska Press, 2004\nChristian Zentner and Friedemann Bedurftig, eds., The\nEncyclopedia of the Third Reich, trans. Amy Hackett (NY:\nMacmillan, 1991)\nHershel Edelheit and Abraham J. Edelheit, A World In Turmoil: An\nIntegrated Chronology of the Holocaust and World War II\n(Westport, Conn.: Greenwood, 1991)\nNorman Davies, Europe at War, 1939-1945 (London: MacMillan, 2006)\nA.J.P. Taylor, The Second World War (London: Hamilton Hamish,\n1975)\nThe Pacific War:\nMichael A. Barnhart, \"The Origins of the Second World War in Asia\nand the Pacific: Synthesis Impossible?\" Diplomatic History,\nVol. 20, No. 2 (Spring 1996), pp. 241-260.\nRobert J.C. Butow, Tojo and the Coming of the War (Stanford:\nStanford U. Press, 1960)\nWilliam L. Neumann, America Encounters Japan (Baltimore: Johns\nHopkins, 1963), pp. 184-289.\nPaul W. Schroeder, The Axis Alliance and Japanese-American\nRelations, 1941 (Ithaca: Cornell University Press, 1958)\nSaburo Ienaga, The Pacific War, 1931-1945 (NY: Pantheon, 1978)\nStephen E. Pelz, Race to Pearl Harbor: The Failure of the Second\nLondon Naval Conference and the Onset of World War II\n(Cambridge: Harvard University Press, 1974)\nMichael A. Barnhart, Japan Prepares for Total War (Ithaca:\nCornell University Press, 1987)\nF.C. Jones, \"The Military Domination of Japanese Policy,\n1931-1945,\" in Michael Howard, ed. Soldiers and Governments\n(London: Eyre & Spottiswoode, 1957), pp. 117-131.\nAsada Sadao, \"The Japanese Navy and the United States,\" in\nDorothy Borg and Shumpei Okamoto, Pearl Harbor as History (NY:\nColumbia U. Press, 1973), pp. 225-259.\n\nThe origins of the Cold War:\nJohn Lewis Gaddis, Russia, The Soviet Union and the United States\n(NY: John Wiley, 1978), pp. 175-206.\nJohn Lewis Gaddis, The United States and the Origins of the Cold\nWar 1941-1947 (NY: Columbia U. Press, 1972)\nJohn Lewis Gaddis, \"The Emerging Post-Revisionist Synthesis on\nthe Origins of the Cold War,\" Diplomatic History, Vol. 7, No. 3\n(Summer 1983), pp. 171-190.\nThe Korean War:\nPeter Lowe, The Origins of the Korean War (NY: Longman, 1986)\nJames A. Nathan and James K. Oliver, United States Foreign Policy\nand World Order, 3rd ed. (Boston: Little, Brown, 1985), pp.\n113-156.\nBernard Brodie, War and Politics, (NY: Macmillan, 1973), pp.\n57-112.\nMorton H. Halperin, \"The Korean War\", in Art and Waltz, The Use\nof Force, 3rd. ed., pp. 220-237.\nRosemary Foot, The Wrong War: American Policy and the Dimensions\nof the Korean Conflict, 1950-1953 (Ithaca: Cornell University\nPress, 1985)\nAllen Whiting, China Crosses the Yalu: The Decision to Enter the\nKorean War (Stanford: Stanford U. Press, 1960)\nThomas J. Christensen, Useful Adversaries: Grand Strategy,\nDomestic Mobilization, and Sino-American Conflict, 1947-1958\n(Princeton: Princeton University Press, 1996)\nThomas J. Christensen, \"Threats, Assurances, and the Last Chance\nfor Peace,\" International Security, Vol. 17, No. 1 (Summer\n1992), pp. 122-154.\nDavid Halberstam, The Coldest Winter: America and the Korean War\n(NY: Hyperion, 2007)\nJian Chen, China's Road to the Korean War: the Making of the\nSino-American Confrontation (NY: Columbia University Press,\n1994)\nMichael Schaller, Douglas MacArthur: The Far Eastern General (NY:\nOxford University Press, 1989)\nJohn W. Spanier, The Truman-MacArthur Controversy and the Korean\nWar (NY: W.W. Norton, 1965)\n\nMartin Lichterman, \"To the Yalu and Back,\" in Harold Stein, ed.,\nAmerican Civil-Military Relations: A Book of Case Studies\n(Birmingham: University of Alabama Press, for the Twentieth\nCentury Fund, 1963), pp. 569-642.\nBurton I. Kaufmann, The Korean War: Challenges in Crisis,\nCredibility, and Command (Philadelphia: Temple University\nPress, 1986)\nDavid Rees, Korea: The Limited War (Baltimore: Penguin, 1970)\nGlenn D. Paige, The Korean Decision, June 24-30 1950 (NY: Free\nPress, 1968)\nRobert R. Simmons, The Strained Alliance (NY: Free Press, 1975)\nFrank Baldwin, ed., Without Parallel: The American-Korean\nRelationship Since 1945 (NY: Pantheon, 1974).\nWilliam W. Stueck, Jr., Road to Confrontation: American Policy\nToward China and Korea, 1947-1950 (Chapel Hill: U. of North\nCarolina Press, 1981).\nBruce Cumings, The Origins of the Korean War (Princeton:\nPrinceton University Press, 1981)\nRobert Jervis, \"The Impact of the Korean War on the Cold War,\"\nJournal of Conflict Resolution vol. 24, no. 4 (Dec. 1980), pp.\n563-92.\nKeith D. McFarland, The Korean War: An Annotated Bibliography\n(NY: Garland, 1986)\nThe Indochina War:\nGeorge Herring, America's Longest War: The United States and\nVietnam, 1950-1975, 4th ed. (Boston: McGraw-Hill, 2002)\nGeorge McT. Kahin, Intervention: How America Became Involved in\nVietnam (NY: Knopf, 1986)\nAnthony Short, The Origins of the Vietnam War (NY: Longman, 1989)\nGeorge McT. Kahin and John W. Lewis, The United States in Vietnam\n(NY: Dell, 1969)\nBernard Brodie, War and Politics, pp. 113-222.\nDavid Halberstam, The Best and the Brightest (Greenwich: Fawcett,\n1972)\nLeslie H. Gelb and Richard K. Betts, The Irony of Vietnam: The\nSystem Worked (Washington DC: Brookings, 1979)\n\nDaniel Ellsberg, Papers on the War (NY: Simon & Schuster, 1972)\nWilliam Shawcross, Sideshow: Kissinger, Nixon and the Destruction\nof Cambodia (NY: Pocket Books, 1979)\nPhilip Caputo, A Rumor of War (NY: Holt, Rinehard & Winston,\n1977) is a vivid personal account by an American soldier.\nThe Peloponnesian War:\nG.E.M. de Ste. Croix, The Origins of the Peloponnesian War\n(Ithaca: Cornell U. Press, 1972)\nDonald Kagan, The Outbreak of the Peloponnesian War (Ithaca:\nCornell University Press, 1969)\nDonald Kagan, The Peace of Nicias and the Sicilian Expedition\n(Ithaca: Cornell University Press, 1981)\nThe 1990-1991 Persian Gulf War:\nKenneth M. Pollack, The Threatening Storm: The Case for Invading\nIraq (NY: Random House, 2002): 11-54.\nAlexander L. George, \"Epilogue: The Persian Gulf Crisis, 1990\n1991,\" in Alexander L. George, ed., Avoiding War: Problems of\nCrisis Management (Boulder: Westview, 1991), pp. 567-576.\nNorman Cigar, \"Iraq's Strategic Mindset and the Gulf War:\nBlueprint for Defeat,\" Journal of Strategic Studies, Vol. 25,\nNo. 1 (March 1992), pp. 1-29.\nEfriam Karsch and Inari Rautsi, Saddam Hussein: A Political\nBiography (Free Press, 1991).\nEfraim Karsh, \"Reflections on the 1990-91 Gulf Conflict,\" Journal\nof Strategic Studies, Vol. 19, No. 3 (September 1996), pp. 303\n320.\nBob Woodward, The Commanders (NY: Pocket Books, 1992).\nBernard Trainor, The Generals' War: The Inside Story of the\nConflict in the Gulf (Boston: Little, Brown, 1995)\nRick Atkison, Crusade (NY: Random House, 1993)\nElaine Sciolino, The Outlaw State: Saddam Hussein's Quest for\nPower and the Gulf Crisis (John Wiley, 1991).\nMiddle East Watch, Human Rights in Iraq (Human Rights Watch,\n1990). An excellent, horrifying study.\n\nSamir al-Khalil, Republic of Fear: The Inside Story of Saddam's\nIraq (Pantheon, 1989). By a perceptive Iraqi patriot and MIT\ngraduate.\nRobert Tucker and David Hendrickson, Imperial Temptation (Council\non Foreign Relations, 1992). See the 100 pages in here\ncriticizing U.S. policy in the Gulf War.\nThe Cuban Missile Crisis:\nMax Frankel, High Noon in the Cold War: Kennedy, Khrushchev and\nthe Cuban Missile Crisis (NY: Ballantine, 2004)\nMichael Dobbs, One Minute to Midnight: Kennedy, Khrushchev, and\nCastro on the Brink of Nuclear War (NY: A.A. Knopf, 2008)\nErnest R. May and Philip D. Zelikow, The Kennedy Tapes: Inside\nthe White House During the Cuban Missile Crisis(Cambridge:\nHarvard U. Press, 1997)\nRaymond Garthoff, Reflections on the Cuban Missile Crisis, rev.\ned. (Washington, D.C.: Brookings, 1989)\nElie Abel, The Missile Crisis (Philadelphia: Lippincott, 1968)\nGraham Allison, Essence of Decision: Explaining the Cuban Missile\nCrisis (Boston: Little, Brown, 1971)\nAlbert and Roberta Wohlstetter, \"Controlling the Risks in Cuba\",\nin Art and Waltz, The Use of Force, 3rd. ed., pp. 238-273.\nRobert A. Divine, ed. The Cuban Missile Crisis (Chicago:\nQuadrangle, 1971)\nThe Arab-Israel conflict:\nSurveys include:\nBenny Morris, Righteous Victims: A History of the Zionist-Arab\nConflict, 1881-2001 (New York: Vintage, 2001). An outstanding\nhistory by a leading Israeli \"new historian.\"\nAvi Shlaim, The Iron Wall: Israel and the Arab World (New York:\nW.W. Norton, 2000). Also excellent, by another top Israeli\n\"new historian.\"\nCharles D. Smith, Palestine and the Arab-Israeli Conflict, 4th\ned. (Boston: Bedford/St. Martin's, 2001). Even-handed and\njudicious.\nMark Tessler, A History of the Israeli-Palestinian Conflict\n(Bloomington: Indiana University Press, 1994). An excellent\nhistory.\n\nAnton La Guardia, War Without End: Israelis, Palestinians, and\nthe Struggle for a Promised Land (Thomas Dunne, 2002)\nIan J. Bickerton and Carla L. Clausner, A Concise History of the\nArab-Israeli Conflict, 3rd ed. (Upper Saddle River, NJ:\nPrentice Hall, 1998). Judicious and high-quality.\nDeborah Gerner, One Land, Two Peoples: The Conflict Over\nPalestine (Westview, 1991). Even-handed but pretty basic.\nNadav Safran, Israel: The Embattled Ally (Harvard U. Press,\n1978). Mildly pro-Israel.\nFred J. Khouri, The Arab-Israeli Dilemma (many editions.) Mildly\npro-Arab. Legalistic.\nDavid Hirst, The Gun and the Olive Branch: The Roots of Violence\nin the Middle East (Harcourt Brace Jovanovich, 1977). Pro-Arab\nbut not blindly so. Has some facts wrong on 1967 war.\nOn historical narratives and the Israel-Arab conflict\nAbdel Monem Said Aly, Shai Feldman, and Khalil Shikaki, Arabs and\nIsraelis: Conflict and Peacemaking in the Middle East (NY:\nPalgrave Macmillan, 2013). Arabs and Israelis see a different\npast. Each largely blames the other for the conflict. This\nfeeds the conflict. Arabs and Israelis details what history\nboth sides can agree on, and what they contest.\nHistoriographic debates:\nNorman G. Finkelstein, Image and Reality of the Israel-Palestine\nConflict (London: Verso, 1995) A heated but also insightful\nassessment of some important historiographical controversies.\nEugene L. Rogan and Avi Shlaim, The War for Palestine: Rewriting\nthe History of 1948 (Cambridge, UK: Cambridge University Press,\n2001). Another excellent survey of important historiographical\ncontroversies.\n\nNational histories:\nH.H. Ben-Sasson, ed., A History of the Jewish People (Harvard U.\nPress, 1976). The best single history.\nAlbert Hourani, A History of the Arab Peoples (Warner, 1991).\nThe best single history.\nMovement histories:\nWalter Laqueur, A History of Zionism (Schocken, 2003).\nSchlomo Avineri, The Making of Modern Zionism: The Intellectual\nOrigins of the Jewish State (Basic Books, 1981).\nGeorge Antonius, The Arab Awakening: The Story of the Arab\nNational Movement (Paragon 1979, first pub. 1946). A brilliant\nclassic.\nPeter Mansfield, The Arabs (Penguin, 1980 or later)\nRelevant ancient history:\nYehoshafat Harkabi, The Bar Kokhba Syndrome: Risk and Realism in\nInternational Politics (Chappaqua, NY: Rossel, 1983)\nPeace negotiations in recent years:\nGeoffrey Kemp and Jeremy Pressman, Point of No Return: The Deadly\nStruggle for Middle East Peace (Carnegie Endowment, 1997). A\nsurvey of recent events. Pressman is a recent Ph.D. graduate\nfrom the MIT political science department.\nJeremy Pressman, \"Visions in Collision: What Happened at Camp\nDavid and Taba?\" International Security, Vol. 28. No. 2 (Fall\n2003): 5-43.\nJerome Slater, \"Lost Opportunities for Peace in the Arab-Israeli\nConflict: Israel and Syria, 1948-2001,\" International Security,\nVOl. 27, No. 1 (Summer 2002): 79-106.\nU.S. domestic politics / the Christian right and Israel / the\nIsrael lobby.\nMichael Lind, Made in Texas: George W. Bush and the Southern\nTakeover of American Politics (NY: Basic Books, 2003): 128-153.\nThe premillennial dispensationalist scenario for the Jews,\nIsrael and the end-times is found on page 146.\n\nTim F. LaHaye and Jerry B. Jenkins, Glorious Appearing: The End\nof Days (Wheaton IL: Tyndale House, 2004), a picture of the\nChristian right's vision for the world in its own words. The\nbook describes a mass-murdering Jesus returned to Earth,\nhurling the religiously incorrect of the world into an abyss of\neverlasting fire:\n\"Jesus merely raised one hand a few inches and a yawning\nchasm opened in the earth, stretching far and wide enough to\nswallow all of them. They tumbled in, howling and\nscreeching, but their wailing was soon quashed and all was\nsilent when the earth closed itself again.\"\nAt a mere word from Jesus other unfortunates saw \"their own\nflesh dissolved, their eyes melted and their tongues\ndisintegrated.\" The landscape was covered with \"splayed and\nfilleted bodies of men and women.\" Quotes from Nicholas D.\nKristof, \"Jesus and Jihad,\" New York Times, July 17, 2004.\nTimothy P. Weber, On the Road to Armageddon: How Evangelists\nBecame Israel's Best Friend (Grand Rapids, MI: Baker Academic,\n2004): 213-48, 250-68.\nJohn J. Mearsheimer and Stephen M. Walt, The Israel Lobby and\nU.S. Foreign Policy (New York: Farrar, Straus and Giroux,\n2007).\nAbraham H. Foxman, The Deadliest Lies: The Israel Lobby and the\nMyth of Jewish Control (New York: Palgrave, 2007).\nAnti-semitism--the root of the evil:\nWalter Laqueur, The Changing Face of Anti-Semitism: From Ancient\nTimes to the Present Day (Oxford, UK: Oxford University Press,\n2006)\nMarvin Perry and Frederick Schweitzer, Anti-Semitism: Myth and\nHate from Antiquity to the Present (NY: Palgrave, 2002).\nEdward H. Flannery, The Anguish of the Jews: Twenty-Three\nCenturies of Antisemitism, rev. ed. (New York: Paulist Press,\n1999).\nIsrael Pocket Library, Anti-Semitism (Jerusalem: Keter, 1974).\nSee also relevant entries in the Encyclopedia Judaica, from\nwhich this book is excerpted. In this dark story lies a key to\nthe origins of the Arab-Israeli conflict.\nJames Carroll, Constantine's Sword: The Church and the Jews: A\nHistory (Houghton Mifflin, 2001). A fine account of western\nChristian persecution of the Jews. If this account is accepted\nthe party most responsible for the Israel-Arab conflict becomes\nclear: the anti-semitic Christian west.\n\nExcellent press coverage of current events in the Mideast can be\nfound on line at http://www.haaretzdaily.com from Israel's\nHa'aretz, an outstanding newspaper.\nOn Soviet military policy Western analyses are:\nBenjamin Lambeth, \"How To Think About Soviet Military Doctrine,\"\nin John Baylis & Gerald Segal, eds. Soviet Strategy (Montclair,\nN.J.: Allenheld, Osmun, 1981), pp. 105-123.\nThomas Wolfe, Soviet Strategy at the Crossroads (Cambridge:\nHarvard U. Press, 1964)\nThomas Wolfe, Soviet Power and Europe, 1945-1970 (Baltimore:\nJohns Hopkins U. Press, 1970)\nRaymond Garthoff, Soviet Military Policy (NY: Praeger, 1966)\nRaymond Garthoff, Soviet Strategy in the Nuclear Age (NY:\nPraeger, 1958)\nRaymond Garthoff, The Soviet Image of Future War (Washington:\nPublic Affairs Press, 1959)\nHerbert Dinerstein, War and the Soviet Union (NY: Praeger, 1962)\nLeon Goure, Foy Kohler and Mose L. Harvey, The Role of Nuclear\nForces in Current Soviet Strategy (Miami: University of Miami,\n1974)\nJoseph Douglass and Amoretta Hoeber, Soviet Strategy for Nuclear\nWar (Stanford, Calif.: Hoover Institution Press, 1979)\nTranslated Soviet writings on this subject include:\nV.D. Sokolovskiy, Soviet Military Strategy (NY: Crane Russak,\n1968).\nA.A. Sidorenko, The Offensive (Washington: U.S. Government\nPrinting Office, 1970)\nN.A. Lomov, The Revolution in Military Affairs (Washington: U.S.\nGovernment Printing Office, 1973)\nMarxism Leninism on War and Army (Washington: U.S. Government\nPrinting Office, 1972) (no author)\nThe terror war:\nPeter L. Bergen, The Longest War: The Enduring Conflict Between\nAmerica and Al-Qaeda (NY: Free Press, 2011)\nDaniel Benjamin and Steven Simon, The Age of Sacred Terror (NY:\nRandom House, 2003)\n\nDaniel Benjamin and Steven Simon, The Next Attack: The Failure of\nthe War on Terror and a Strategy for Getting it Right (NY:\nTimes Books, 2005)\nBruce Riedel, The Search for Al-Qaeda: Its Leadership, Ideology,\nand Future (Washington, DC: Brookings, 2008)\nMary Habeck, Knowing the Enemy: Jihadist Ideology and the War on\nTerror (New Haven: Yale University Press, 2006)\nRichard A. Clarke, Against All Enemies: Inside America's War on\nTerror (New York: Free Press, 2004):\n1Peter Krause and Stephen Van Evera, \"Public Diplomacy: Ideas for\nthe War of Ideas,\" Middle East Policy, Vol. 16, No. 3 (Fall\n2009): 106-134.\nAnonymous, Imperial Hubris: Why the West is Losing the War on\nTerror (Washington, DC: Brassey's, 2004)\nAnonymous, Through Our Enemies' Eyes: Osama Bin Laden, Radical\nIslam, and the Future of America (Washington, D.C.: Brassey's,\n2002)\nRichard A. Falkenrath, Robert D. Newman, and Bradley A. Thayer,\nAmerica's Achilles Heel: Nuclear, Biological, and Chemical\nTerrorism and Covert Attack (Cambridge, MA: MIT Press, 1998)\nPeter L. Bergen, Holy War, Inc.: Inside the Secret World of Osama\nBin Laden (NY: Touchstone, 2002)\nStrobe Talbott and Nayan Chanda, eds., The Age of Terror: America\nand the World After September 11 (NY: Basic Books, 2001)\nJames F. Hoge and Gideon Rose, ed., How Did This Happen?\nTerrorism and the New War (NY: Public Affairs Press, 2001)\nKurt M. Campbell and Michele A. Flournoy, principal authors, To\nPrevail: An American Strategy for the Campaign Against\nTerrorism (Washington, DC: Center for Strategic and\nInternational Studies, 2001)\nPaul R. Pillar, Terrorism and U.S. Foreign Policy (Washington,\nD.C.: Brookings, 2001)\nYonah Alexander and Michael S. Swetman, Usama bin Laden's al-\nQaida: Profile of a Terrorist Network (Transnational, 2001)\nAnthony H. Cordesman, Terrorism, Asymmetric Warfare, and Weapons\nof Mass Destruction (NY: Praeger, 2001)\nGideon Rose, \"Review Essay: It Could Happen Here: Facing the New\nTerrorism,\" Foreign Affairs, Vol. 78, No. 2 (March/April 1999):\n131-137.\n\nThe US-Iraq War, 2003\nThomas E. Ricks, Fiasco: The American Military Adventure in Iraq\n(New York: Penguin Press, 2006)\nMichael Isikoff and David Corn, Hubris: The Inside Story of Spin,\nScandal, and the Selling of the Iraq War (New York: Crown\nPublishers, 2006)\nGeorge Packer, The Assassin's Gate: America in Iraq (New York:\nFarrar, Straus and Giroux, 2005).\nBob Woodward, State of Denial: Bush at War, Part III (New York:\nSimon & Schuster, 2006)\nJames Bamford, A Pretext for War: 9/11, Iraq, and the Abuse of\nAmerica's Intelligence Agencies (NY: Anchor, 2005)\nOther major post-1945 wars:\nTim Judah, \"Kosovo's Road to War,\" Survival, Vol. 41, No. 2\n(Summer 1999), pp. 5-18.\nDavid Shearer, \"Africa's Great War,\" Survival, Vol. 41, No. 2\n(Summer 1999), pp. 89-106.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.42 Causes and Prevention of War\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}