{
  "course_name": "Cellular Neurophysiology",
  "course_description": "This course includes:\n\nSurveying the molecular and cellular mechanisms of neuronal communication.\nCoversion channels in excitable membrane, synaptic transmission, and synaptic plasticity.\nCorrelation of the properties of ion channels and synaptic transmission with their physiological function such as learning and memory.\nDiscussion of the organizational principles for the formation of functional neural networks at synaptic and cellular levels.",
  "topics": [
    "Health and Medicine",
    "Anatomy and Physiology",
    "Science",
    "Biology",
    "Cell Biology",
    "Neurobiology",
    "Neuroscience",
    "Health and Medicine",
    "Anatomy and Physiology",
    "Science",
    "Biology",
    "Cell Biology",
    "Neurobiology",
    "Neuroscience"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nCourse 9.16 (Undergraduate) and Couse 9.161 (Graduate) meet together. An additional project is required for graduate credit.\n\nPrerequisites\n\n9.01 for undergraduate students.\n\n9.011 for graduate students.\n\nSchedule\n\nLecture 1.5 hr. and Recitation 1.5 hr.\n\nCourse Highlights\n\nSurveys the molecular and cellular mechanisms of neuronal communication.\n\nCovers ion channels in excitable membrane, synaptic transmission, and synaptic plasticity.\n\nCorrelates the properties of ion channels and synaptic transmission with their physiological function such as learning and memory.\n\nDiscusses the organization principles for the formation of functional neural networks at synapse and cellular levels.\n\nCourse Requirements\n\n3 Problem sets\n\nLab Project\n\nClass will be split into three groups; sign-up sheet will be provided in ses #8.\n\nClass participation\n\nAttendance\n\nParticipation and presentation in class\n\nGraduate students only: final project\n\nFinal exam\n\nBooks\n\nJohnston, and Wu.\nFoundations of Cellular Neurophysiology\n. MIT Press.\n\nHille.\nIonic Channels of Excitable Membranes\n, 3rd Edition. Sinauer Associates, Inc.\n\nLevitan, and Kaczmarek.\nThe Neuron\n. Oxford University Press.",
  "files": [
    {
      "category": "Resource",
      "title": "Home work set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-16-cellular-neurophysiology-spring-2002/7332dbc0bfaed6385299d0e81fd79d6d_problem_set_1.pdf",
      "content": "Home work set 1\nExamine general properties of electrically excitable cells as revealed by the Hodgkin-\nHuxley model of the giant axon of the squid.\nThe following set of equations was used by HH to summarize the behaviors of channels\nin a squid axon.\n\nA. Simulate HH equation using MABLAB and explore the implications of the model of\nthe following attributes of electrically excitable cells\n1. All-or-non properties and threshold\n2. Refraction period\n3. The strength-duration relationship\n4. Accommodation\n5. Repetitive activity\nB.\n6. What would you predict the shape of the action potential to be in a squid axon if\nyou could specifically block K channels?\n7. The proteolytic enzyme Pronase has been used to block the Na channel\ninactivation. What effects would this block have on the shape of action potential?\n8. Which parameters determine the duration of action potential? Find a set of\nparameters in which you can reduce the duration of action potential without\nreducing the amplitude of action potential."
    },
    {
      "category": "Assignment",
      "title": "Problem Set #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-16-cellular-neurophysiology-spring-2002/cfd7e3b8231e24250dada390062537ca_problem_set_2.pdf",
      "content": "9.16 Problem Set #2\n\nIn this assignment you will build a simulation of the presynaptic terminal.\n\nThe simulation can be broken down into three parts: simulation of the arriving action\npotential (based on the Hodgkin-Huxley equations from the last assignment); simulation\nof the calcium current influx; and, finally, simulation of the vesicle release dynamics.\nPart 1 - Simulation of the Action Potential\nFor simplicity, you may assume that the calcium current does not change the shape of the\naction potential dramatically; hence, you can use the action potential waveform from the\nprevious assignment as the starting point. Look for the solution to the previous\nassignment posted on the web.\n\nYou will need to take the voltage output from this simulation and feed it as an input to the\nnext part of the assignment. For all subsequent simulations assume a constant current of\n20 nA injected for 100 ms. Plot the resulting action potentials here.\nPart 2 - Simulation of the Calcium Current Influx\n\nSince the Ca2+ concentration inside the cell varies, you will need to use the Goldmann-\nHodgkin-Katz (GHK) equation to calculate the Ca2+ current:\n\n[\n]\n[\n]\n\n-\n-\n=\nV\nout\nin\nV\nCa\nCa\nε\ne\nCa\nCa\ne\nV\nP\nI\nε\nε = 0.07788 mV-1\n\nTo model the Ca2+ channel kinetics, you may adopt a simplified model (from Borst and\nSakmann, J. Phys., 1998), which consolidates the effects of different calcium channels\npresent in the terminal into a single activation parameter (c):\n\n3.\n/\n.1\nV\nc\ne\n=\nα\n\n/\n.0\nV\nc\ne-\n=\nβ\n\nc\nc\nc\ndt\nd\nc\nc\nβ\nα\n-\n-\n=\n)\n1(\n\nmaxc\nP\nPCa =\n\nPmax = 8.2650 ⋅ 10-5\n\nSimultaneously, you will need to solve for [Ca]in, which changes due to the influx of Ca2+\nions into the terminal through the Ca2+ current. The synaptic terminal can be modeled as\na single compartment with a calcium buffer (B) and diffusion of free Ca2+ away from the\nrelease site (diffusion of the calcium buffer is a relatively slow process and can therefore\nbe omitted from the model). The dynamics of the Ca2+ buffering and diffusion can be\nsummarized in the following kinetic scheme:\n\nDiffusion\n(D)\n[Ca] + [B]\nAccumulation (A)\nk2\nk1[Ca][B]\n\nICa\n[BCa]\n\nCytoplasm\n\nThis corresponds to the following equations:\n\n[ ] [\n] [\n]\nBCa\nB\nB\nTot -\n=\n\n[\n]\n[\n]\n[\n][ ]\n[\n]\nCa\nD\nB\nCa\nk\nBCa\nk\nA\nI\nCa\ndt\nd\nCa\n-\n-\n+\n=\n\n[\n]\n[\n][ ]\n[\n]\nBCa\nk\nB\nCa\nk\nBCa\ndt\nd\n-\n=\n\nThe relevant constants are:\n\n[Ca]out = 2000 μM; [BTot] = 500 μM; k1 = 0.01 ms-1; k2 = 0.1 ms-1; A = 100; D = 1\n\na)\nRun the simulation and plot the calcium current influx in the same graph with the\naction potentials. Observe that the peak calcium influx coincides with the repolarizing\nphase of the action potential. Why?\n-80\n-60\n-40\n-20\nTime (ms)\nTiming of Calcium Current vs Action Potentials\nICa (x10)\nAction Potentials\n\nStart the simulation with the following initial conditions:\nc = 0.017; [Ca]in = 0.24; [BCa] = 0\n\nb)\nPlot the free [Ca]in in the same graph with the buffered calcium [BCa]. Note that\nas the buffer saturates, the concentration of free Ca2+ increases. Accumulation of free\nCa2+ in the presynaptic terminal results in the enhancement of vesicle fusion, and causes a\nform of short-term synaptic plasticity called paired-pulse facilitation. (This will be\nexplored further in Part 3).\n\nTime (ms)\nInternal Free Ca and Buffered Ca\nConcentration (um)\n[Ca]in\n[BCa]\n\nc)\nExplore the effects of buffer concentration [BTot] on the extent of paired-pulse\nfacilitation.\nPart 3- Simulation of the Vesicle Release\n\nIn this part of the assignment, you will take the internal calcium concentration computed\nin Part 2, and use it to drive the vesicle release machinery.\n\nFirst, you will have to simulate the binding of Ca++ to a Ca++ sensor (CS) located on the\ndocked vesicles. For simplicity, you may assume that binding to the sensor is\ninstantaneous, in which case the fraction of sensors binding 4 Ca++ molecules (remember\nthat vesicle release obeys a 4th order Ca++ dependency) is given by the dose response\nrelationship:\n\n[\n]\n[\n]\n\n+\n=\nD\nK\nCa\nCa\nCS\n\nKD = 100 μM\n\nTo model the vesicle population dynamics, you may assume a constant source of vesicles\ninside the cell, a rate constant α of vesicle docking, and a rate constant β of vesicle\nundocking. The rate of fusion of docked vesicles depends on CS. The setup for the\nproblem is the following:\n\nReleased\nVesicle\nCS\nβ\nα\nReleasable Vesicle\nPool (RP)\nConstant Vesicle\nSource\n\nThe corresponding model equation is:\n\nCS\nRP\nRP\nRP\ndt\nd\n⋅\n-\n+\n⋅\n-\n=\nα\nβ\n\nFusion Rate = RP ⋅ CS\n\nτ = 50;\n(vesicle relaxation time constant)\nm = 800;\n(mean number of vesicles in the readily releasable pool)\nβ = 1/τ; α = m/τ;\n\na)\nRun the simulation with the initial condition RP0 = 800, and plot the size of\nthe readily releasable vesicle pool as a function of time. Observe that the\nvesicle pool depletes fast. Explore the effects of the vesicle relaxation time\nconstant on the extent of vesicle pool depletion.\nTime (ms)\nReleasable Vesicle Pool Size\nVesicle Pool Depletion\n\nb)\nFinally, combine the effects of internal calcium concentration and the vesicle\npool size on the rate of vesicle release. Plot the vesicle fusion rate as a\nfunction of time.\n\nTime (ms)\nFusion Rate (vesicles/ms)\nVesicle Fusion\n\nComment on what you see."
    },
    {
      "category": "Resource",
      "title": "Homework set #3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-16-cellular-neurophysiology-spring-2002/fbde0a5c6b18f1ccef26d34af9960c28_problem_set_3.pdf",
      "content": "9.16 - Electrophysiology\nHomework set #3\n\nExamination of the kinetic properties of AMPA and NMDA receptors\n\nA2R*\nA2R\nAR\nR\nβ\nα\nk-1\n2k1\nk1\n2k-1\nA2Rd\nARd\nβ1\nα1\nβ2\nα2\nk1\n2k-1\nA2R*\nA2R\nAR\nR\nβ\nα\nk-1\n2k1\nk1\n2k-1\nA2Rd\nARd\nβ1\nα1\nβ2\nα2\nk1\n2k-1\nThe kinetic steps of glutamate receptor\nactivation following the release of\ntransmitters can be summarized in the\ngeneral scheme illustrated in the right\npanel.\nThe following set of equations can be used\nto simulate the process of glutamate\nreceptor activation.\n[ ]\n[ ]\n(\n)\n[ ]\n(\n)\n[ ]\n(\n)\n[ ]\n(\n)\nd\nd\nd\nd\nd\nd\nd\nd\nd\nd\nR\nA\nAR\nR\nA\nR\nA\nAR\nR\nwhere\nR\nA\nk\nAR\nA\nk\nR\nA\ndt\nR\ndA\nAR\nA\nk\nR\nA\nk\nAR\ndt\ndAR\nR\nA\nR\nA\ndt\nR\ndA\nR\nA\nk\nR\nA\nR\nA\nAR\nA\nk\ndt\nR\ndA\nAR\nk\nA\nk\nAR\nR\nA\nk\nR\nA\nk\ndt\ndAR\n*\n*\n*\n*\n-\n-\n-\n-\n-\n=\n+\n-\n+\n=\n+\n-\n+\n=\n-\n=\n+\n+\n-\n+\n+\n=\n+\n+\n-\n+\n+\n=\n-\n-\n-\n-\n-\nα\nβ\nα\nβ\nα\nβ\nβ\nβ\nα\nα\nβ\nα\n\nR is the glutamate receptor, A the concentration of the neurotransmitter, AR the receptor\nwith a single transmitter molecule binding, A2R the receptor with two transmitter\nmolecules binding, and A2R* the receptor in an open channel configuration. Therefore,\nthe probability of channel opening after neurotransmitter release Po is determined by\nA2R*.\n\nThe kinetic rate constants for AMPA receptors are\n6.0\n8.0\n2.1\n.0\n5.0\n8.4\n.0\n=\n=\n=\n=\n=\n=\n=\n=\n-\nβ\nα\nβ\nα\nβ\nα\nk\nk\n\nThe kinetic rate constants for NMDA receptors are\n\n.0\n.0\n.0\n.0\n.0\n.0\n.0\n.0\n=\n=\n=\n=\n=\n=\n=\n=\n-\nβ\nα\nβ\nα\nβ\nα\nk\nk\n\nThe concentration of glutamate in the synaptic cleft can be imitated by\n( )\n(\n) (\n)\n2.0\n/\n1.2\n/\n1.0\n/\nexp\n*\nexp\n5.0\nexp\n2.3\nt\nt\nt\nMAX\nA\nt\nA\n-\n-\n-\n-\n+\n=\n\nwhere Amax is the peak concentration of transmitters. During the process of synaptic\ntransmission, Amax can vary from 100 μM up to 3000 μM.\n\nA. Solve the above equations numerically using MATLAB and answer the following\nquestions.\n1. What determines the decay phase of an EPSC, the profile of glutamate\nconcentration or intrinsic properties of the channel? Does the decay phase of\nAMPA or NMDA receptor activation depend upon the glutamate concentration?\n2. Describe the behavior of AMPA vs NMDA receptors under repetitive activation.\nCan one increase AMPA receptor activation by repetitive release of transmitter?\nWhat about NMDA receptors?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set #4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-16-cellular-neurophysiology-spring-2002/482583d70edb55ef1813e8956c172e2e_problem_set_4.pdf",
      "content": "9.16 Problem Set #4\n\nIn the final problem set you will combine the pieces of knowledge gained in the previous\nassignments to build a full-blown model of a plastic synapse. You will investigate the\neffects of presynaptic stimulation at different frequencies on synaptic potentiation and\ndepression.\nPart 1 - Presynaptic Spiking\nFirst, to make the presynaptic neuron fire at an arbitrary frequency, you need to inject a\nseries of square current pulses, instead of just changing the amplitude of a long\ndepolarizing current, as done previously. This is because with one depolarizing pulse,\nyou cannot evoke repetitive firing at an arbitrarily low frequency (Why? Try it and\ncomment.)\n\nTo set this up you can use the following Matlab script:\n\nt = 0:TMax;\nI = 40*(mod(t, 50) == 0);\n\nThis script will produce a series of pulses of amplitude 40 nA, duration 1ms, recurring\nevery 50 ms.\nFeed this through the presynaptic model you built in Assignment #2. In Part 3, change\nthe mean number of vesicles in the readily releasable pool (m) to 10, as central synapses\ngenerally have small number of vesicles (you need to change the initial condition to RP0\n= 10).\nPlot the vesicle fusion rate for trains of action potentials at 20 Hz and 100 Hz. (Fig. 1)\nPart 2 - Glutamate Concentration Profile\nNext, you need to calculate the concentration profile of glutamate evoked by the action\npotential trains at the postsynaptic receptors. Each vesicle release generates glutamate\nprofile given by the equation\n( )\n(\n) (\n)\n2.0\n/\n1.2\n/\n1.0\n/\nexp\n*\nexp\n5.0\nexp\n2.3\nt\nt\nt\nMAX\nA\nt\nA\n-\n-\n-\n-\n+\n=\n,\n\n(1)\nwith AMAX = 300. To do the calculation right, you would need to simulate the fusion of\nindividual vesicles, which is a stochastic process governed by the fusion rate FR. For\nsimplicity, it will suffice to simulate the average behavior. To obtain the average\nglutamate profile, you need to convolve the concentration profile due to the release of a\nsingle vesicle (Eq. 1) with the average fusion rate (FR).\nIn Matlab this can be done with the command conv:\n\nGlut = conv(FR, A);\nTGlut = 0:dt:(length(FR)+length(A)-2)*dt; % time vector\nplot(Tglut, Glut);\n(you have to make sure that FR and A are sampled at the same resolution, to ensure this,\nkeep dt constant in all simulations. To see how to control sampling, look at the\nsolutions to the previous assignments posted on the web).\nPlot the concentration of glutamate for the trains of action potentials at 20 Hz and 100\nHz. (Fig. 2)\nPart 3 - Receptor Activation\nFeed the glutamate concentration calculated in the previous section into the model for\nAMPA and NMDA receptors given in Assignment #3. (Fig. 3)\nPart 4 - Postsynaptic Activation\nNow use the HH equations to simulate the postsynaptic membrane potential. To do this\nrigorously, you would have to simulate the effects of both AMPA and NMDA currents\non the membrane potential, while at the same time calculating the effects of the\nmembrane potential on the NMDA current by modulating the Mg++ block, and the effects\non both type of currents through the change in the driving force. To avoid this\ncomplication, you can assume that the NMDA current does not significantly contribute to\nthe membrane potential (this is true for most time, since except during an action potential,\nNMDA receptor is largely blocked), and a constant driving force for AMPA receptors.\nThat way, you can use the HH equations in the form from Assignment #1 without\nmodification.\n\nTo calculate the AMPA current, use the following equation:\n\n*\n*\n*\n*\nAMPA\nAMPA\nAMPA\nAMPA\nAMPA\nR\nA\nN\ng\nE\nI\n=\n\nwhere EAMPA is the driving force, gAMPA is the single channel conductance and NAMPA is\nthe number of AMPA receptors. For simplicity, take gAmpa * EAmpa = 1, NAMPA = 50. (Fig.\n4)\nPart 5 -Internal calcium\n\nNow you are in the position to calculate the Ca2+ flux through the NMDA receptors, and\nthe resulting change in the postsynaptic [Ca2+] concentration.\n\nTo model the Ca2+ current through the NMDA receptor, you can use the equation:\n\nMg\nCa\n*\ng\n*\n)\nE\n-\n(V\n*\nNMDA\nCa\nR\nA\nI\n-\n=\n\ng\n/)\n(\n/)\n(\nMg\n+\n=\n+\n+\nV\nV\ne\ne\n\nECa = 60 mV,\n\nwhere gMg is the voltage-dependent conductance modulated by the Mg2+ block, and V is\nthe membrane potential calculated in Part 4. Plot ICa. (Fig. 5)\n\nExplain the qualitative differences between ICa and NMDA activation. Why is Ca flux\ncorrelated better with AMPA activation rather than NMDA activation? Why are there\ntwo spikes on the ICa trace for each postsynaptic spike?\n\nTo calculate the change in the postsynaptic [Ca], you can use a simple integrator model\nwith a diffusion constant D (this captures both the diffusion through the cytoplasm, and\nthe effects of buffers). The corresponding equation is\n\n[\n]\n[\n]\nCa\nD\nI\nCa\ndt\nd\nCa\n*\n-\n=\n\nThe solution can be computed directly (without simulating) by convolving the impulse\nresponse function e\nof the system with the input I\nDt\n-\nCa. Plot [Ca]. (Fig. 6)\n\nPart 6 - Ca Mediated Plasticity\n\nNow, into the final stage. The simplest model of Ca2+ modulated synaptic plasticity is\nthe one in which high concentration of Ca2+ triggers receptor insertion and potentiation,\nwhile low concentration of Ca2+ triggers receptor internalization and depression.\n\nThis mechanism can be modeled by a differential equation\n\n[\n] [\n]\n(\n)\n[\n] [\n]\nMAX\nAMPA\nMAX\nAMPA\nMAX\nCa\nCa\nAMPA\nN\nN\nN\nN\nN\ne\nCa\nCa\nN\ndt\nd\n*\n)\n(\n*\n)\n1(\n*\n/\n-\n-\n-\n=\n-\nθ\nθ\nτ\n,\n\nwhere NAMPA is the number of AMPA receptors in the synapse, and [Ca]θ is the critical\n[Ca] concentration above and below which the synapse gets potentiated or depressed\nrespectively. Note that this equation guarantees that 0 [Ca] has no effect on NAMPA, and\nthat NAMPA stays bounded between 0 and NMAX.\n\nSimulate NAMPA with the initial value 50, NMAX = 100, [Ca]θ = 50, τ = 10, and two\ndifferent presynaptic action potential trains, one at 20 Hz, the other at 100 Hz.\n\nWhat happens to NAMPA in the two cases?\n\nExperiment with different frequencies of presynaptic potentials. At what frequency is the\nchange in the synaptic strength minimal? (there is one obvious solution to this question,\nwhat is the other one?)\n\nPart 7 - Congratulation\n\nYou have just completed a model of two coupled neurons and reproduced frequency\ndependent synaptic plasticity in silico.\n\n0.2\n0.4\n0.6\n0.8\nFusion Rate (vesicles/ms)\nVesicle Fusion\n100 Hz\n0.1\n0.2\n0.3\n0.4\n0.5\nTime (ms)\nFusion Rate (vesicles/ms)\n20 Hz\n\nFig. 1\n\nTime (ms)\nGlutamate Concentration Profile\n100 Hz\n20 Hz\n\nFig. 2\n\n-0.1\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nReceptor Activation at 100 Hz\nTime (ms)\nAMPA\nNMDA\n\nFig. 3\n\n-80\n-60\n-40\n-20\nPostsynaptic Membrane Potential\nTime (ms)\n\nFig. 4\n\n-0.5\n0.5\n1.5\n2.5\nCa flux through the NMDA receptor\nTime (ms)\n\nFig. 5\n-20\nPostsynaptic [Ca]\nTime(ms)\n\nFig. 6"
    }
  ]
}