{
  "course_name": "Cellular Metabolism and Cancer: Nature or Nurture?",
  "course_description": "In this course we will explore how altered metabolism drives cancer progression. Students will learn (1) how to read, discuss, and critically evaluate scientific findings in the primary research literature, (2) how scientists experimentally approach fundamental issues in biology and medicine, (3) how recent findings have challenged the traditional “textbook” understanding of metabolism and given us new insight into cancer, and (4) how a local pharmaceutical company is developing therapeutics to target cancer metabolism in an effort to revolutionize cancer therapy.",
  "topics": [
    "Health and Medicine",
    "Cancer",
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics",
    "Health and Medicine",
    "Cancer",
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nRecommended prerequisites for this course are one of the following:\n\n7.03 Genetics\n\n7.05 General Biochemistry\n\n7.06 Cell Biology\n\n7.28 Molecular Biology\n\nCourse Description\n\nCellular metabolism is frequently considered to be a thoroughly understood and largely static process by which cells metabolize nutrients to generate energy in the form of adenosine triphosphate (ATP). However, while the foundations of cellular metabolism have been clear for over 50 years, recent discoveries have shown that metabolism is a much more dynamic and malleable process than previously recognized. Although all cells have access to the same finite set of metabolic reactions, how these pathways are utilized is context dependent and is tailored to support the distinct functions of different cell types. One striking example is the metabolism of cancer cells, in which nutrient utilization must be re-wired not only to meet cellular energy demands but also to support cell proliferation, growth, survival, and metastatic capacity. In this course we will explore how altered metabolism drives cancer progression and ask: Why do tumors consume more sugar than normal cells? How is the proliferative metabolism of cancer cells different from the homeostatic metabolism of normal cells? How do alterations in cancer-associated genes re-wire cellular metabolism? Can environmental factors cooperate with genetic changes to drive the metabolic phenotypes of cancer cells? Are there metabolic interactions among cancer cells, normal cells, and whole-body metabolism to contribute that the progression of the disease? How do metabolic processes support other malignant cancer characteristics, such as metastasis and drug resistance? As we explore these topics, students will learn (1) how to read, discuss, and critically evaluate scientific findings in the primary research literature, (2) how scientists experimentally approach fundamental issues in biology and medicine, (3) how recent findings have challenged the traditional \"textbook\" understanding of metabolism and given us new insight into cancer, and (4) how a local pharmaceutical company is developing therapeutics to target cancer metabolism in an effort to revolutionize cancer therapy.\n\nFormat\n\nFor our first class, we will meet, introduce ourselves, and discuss the logistics of the course (day, time, location etc.) and also introduce the overall themes of the course. We will briefly introduce the topics to be covered. Subsequently, each class will involve an interactive discussion of two papers that are assigned in the weekly schedule below. The primary objective is for students to learn to read and critically discuss primary scientific literature. Important skills to learn will be understanding experimental design/logic, learning the proper use of negative and positive controls and data interpretation. To accomplish these objectives, it is expected that students come to class being able to discuss the content of the figures and tables of the papers, as well as the key result and control for each paper. In short, the primary assignment in this class is to read two papers each week and formulate two questions per paper to be emailed to the instructors the night before class. In addition, there will be two longer assignments--one written assignment and one oral presentation. To assist students with understanding the material, at the end of each class we will briefly introduce key topics and methods required to understand the papers assigned for the following class.\n\nCourse Objectives\n\nThis course has two main objectives: (1) to introduce students to the primary scientific literature and the process of critically reading a research publication, and (2) to teach students about how basic biological research in cellular metabolism has informed our understanding of cancer and diabetes. At the end of the course, students should be able to:\n\nRead, comprehend, critically evaluate, and integrate knowledge from primary research papers\n\nExplain cell and molecular biology methods as well as biochemical techniques commonly used in metabolic research\n\nFormulate experiments using these methods to answer a relevant biological question, incorporating rigorous experimental design\n\nDescribe the main metabolic pathways that are perturbed in cancer\n\nAppreciate how genetics and the discovery of oncogenes has increased interest in the study of metabolism\n\nUnderstand why metabolic pathways can make good therapeutic targets for treating disease\n\nGrading\n\nGrading for this course is pass/fail and will depend on student attendance, preparedness, participation in class discussions, and satisfactory completion of the required assignments.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroduction to the Course\n\nAn Introduction to Cancer Metabolism: The Warburg Effect\n\nRole of Mitochondrial Function in Tumor Cell Growth\n\nAmino Acid Metabolism\n\nNucleotide and Lipid Metabolism\n\nDistribute Written Assignment\n\nMutations in Isocitrate Dehydrogenase and the Discovery of a Neomorphic Activity\n\n2-hydroxyglutarate: The First Oncometabolite?\n\nField Trip--Visit to Agios\n\nField Trip\n\nOncogenes and Metabolism: How Genetic Changes Alter Cancer Metabolism\n\nWritten Assignment Due\n\nContext Matters! How Tissue Environment Alters Cancer Cell Metabolism\n\nMetabolic Interactions of Stroma Cells and Cancer\n\nFinalize Choice of Paper for Oral Presentations\n\nImpact of Diet on Tumor Metabolism and Progression\n\nOral Presentations and Final Discussion\n\nOral Presentations",
  "files": []
}