{
  "course_name": "Chemical and Biological Reaction Engineering",
  "course_description": "This course applies the concepts of reaction rate, stoichiometry and equilibrium to the analysis of chemical and biological reacting systems, derivation of rate expressions from reaction mechanisms and equilibrium or steady state assumptions, design of chemical and biochemical reactors via synthesis of chemical kinetics, transport phenomena, and mass and energy balances. Topics covered include: chemical/biochemical pathways; enzymatic, pathway, and cell growth kinetics; batch, plug flow and well-stirred reactors for chemical reactions and cultivations of microorganisms and mammalian cells; heterogeneous and enzymatic catalysis; heat and mass transport in reactors, including diffusion to and within catalyst particles and cells or immobilized enzymes.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Physical Chemistry",
    "Engineering",
    "Biological Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Physical Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nSyllabus\n\nA list of topics by session is available in the\ncalendar\nbelow.\n\nDescription\n\nThis course applies the concepts of reaction rate, stoichiometry and equilibrium to the analysis of chemical and biological reacting systems. Derivation of rate expressions from reaction mechanisms and equilibrium or steady state assumptions. Design of chemical and biochemical reactors via synthesis of chemical kinetics, transport phenomena, and mass and energy balances. Topics in this course include: chemical/biochemical pathways; enzymatic, pathway, and cell growth kinetics; batch, plug flow and well-stirred reactors for chemical reactions and cultivations of microorganisms and mammalian cells; heterogeneous and enzymatic catalysis; heat and mass transport in reactors, including diffusion to and within catalyst particles and cells or immobilized enzymes.\n\nRequired Texts\n\nFogler, H. S.\nElements of Chemical Reaction Engineering\n. 4th ed. Upper Saddle River, NJ: Prentice-Hall PTR, 2006. ISBN: 9780130473943.\n\nThere will also be reading from the manuscript of the forthcoming textbook\nBiological Kinetics\nby K. Dane Wittrup and Bruce Tidor.\n\nRecommended Texts\n\nLevenspiel, O.\nChemical Reaction Engineering\n. 3rd ed. New York, NY: Wiley, 1999. ISBN: 9780471254249.\n\nSmith, J.\nChemical Engineering Kinetics\n. 3rd ed. New York, NY: McGraw-Hill, 1981. ISBN: 9780070587106.\n\nSteinfeld, J. I., J. S. Francisco, and W. L. Hase.\nChemical Kinetics and Dynamics\n. 2nd ed. Upper Saddle River, NJ: Prentice Hall, 1999. ISBN: 9780137371235.\n\nBailey, J. E., and D. F. Ollis.\nBiochemical Engineering Fundamentals\n. 2nd ed. New York, NY: McGraw-Hill, 1986. ISBN: 9780070032125.\n\nStephanopoulos, G., A. Aristidou, and J. Nielsen.\nMetabolic Engineering: Principles and Methodologies\n. San Diego, CA: Academic Press, 1998. ISBN: 9780126662603.\n\nRecitation Sections\n\nThe purpose of the recitation section is to give you practice working difficult problems in a supportive environment, with a focus on moving from the problem statement to solvable systems of equations. We will also review homework solutions, discuss problem solving strategies, answer questions concerning lecture material, and discuss exam solutions. You must have read and thought about the homework problems before you come to recitation. Be prepared to be asked to do problems on the chalkboard.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n20%\n\nQuiz\n\n10%\n\nMidterm exam 1\n\n15%\n\nMidterm exam 2\n\n20%\n\nFinal exam\n\n35%\n\nHomework\n\nWeekly problem sets will be assigned approximately 6-7 days in advance of their due date. They will be graded and returned the following week.\nHomework policy and honor code\n: While students are encouraged to discuss problem solutions and strategies, they are expected to work individually in arriving at solutions. Electronically copying or cutting and pasting any section of another student's homework will be considered cheating and will lead to disciplinary action against both the copier and any student who made the electronic version available before the due date. Please do each problem on separate and stapled sheets with your name on it. Homework is normally due at the end of class on Wednesdays. Late homework will be accepted until 10 pm of the date it is due in a box outside one of the TAs' offices. 50% of the grade will be deducted from late homework unless there are extenuating circumstances that justify the late submission. Solutions to problem sets will be provided at 10 pm on the due date.\n\nQuizzes\n\nUnannounced quizzes on the material presented in class or assigned for reading during the previous class. One quiz can be missed or dropped from grading. Most quizzes will be given during recitations.\n\nExams\n\nThe first two exams will be 1 hour long and will be given during class time. The third exam will be given during the final exam period and will be three hours long.\n\nCalendar\n\nInstructors:\n\nWHG = William H. Green\n\nKDW = K. Dane Wittrup\n\nThe calendar below provides information on the course's lecture (L) and recitation (R) sessions.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nL1\n\nPreliminaries and remembrance of things past. Reaction stoichiometry, lumped stoichiometries in complex systems such as bioconversions and cell growth (yields); extent of reaction, independence of reactions, measures of concentration. Single reactions and reaction networks, bioreaction pathways. (WHG)\n\nProblem set 1 out\n\nL2\n\nThe reaction rate and reaction mechanisms: Definition in terms of reacting compounds and reaction extent; rate laws, Arrhenius equation, elementary, reversible, non-elementary, catalytic reactions. (WHG)\n\nR1\n\nRecitation 1\n\nL3\n\nKinetics of cell growth and enzymes. Cell growth kinetics; substrate uptake and product formation in microbial growth; enzyme kinetics, Michaelis-Menten rate form. (KDW)\n\nL4\n\nReaction mechanisms and rate laws: Reactive intermediates and steady state approximation in reaction mechanisms. Rate-limiting step. Chain reactions. Pyrolysis reactions. (WHG)\n\nProblem set 1 due\n\nProblem set 2 out\n\nR2\n\nRecitation 2\n\nL5\n\nContinuous stirred tank reactor (CSTR). Reactions in a perfectly stirred tank. Steady-state CSTR. (KDW)\n\nProblem set 2 due\n\nProblem set 3 out\n\nL6\n\nConcentration that optimizes desired rate. Selectivity vs. Conversion. Combining reactors with separations. (WHG)\n\nR3\n\nRecitation 3\n\nL7\n\nBatch reactor: Equations, reactor sizing for constant volume and variable volume processes. (KDW)\n\nProblem set 3 due\n\nProblem set 4 out\n\nL8\n\nThe plug flow reactor. (WHG)\n\nR4\n\nRecitation 4\n\nL9\n\nReactor size comparisons for PFR and CSTR. Reactors in series and in parallel. How choice of reactor affects selectivity vs. conversion. (KDW)\n\nProblem set 4 due\n\nProblem set 5 out\n\nL10\n\nNon-ideal reactor mixing patterns. Residence time distribution. Tanks in series model. Combinations of ideal reactors. (KDW)\n\nR5\n\nRecitation 5\n\nL11\n\nNon isothermal reactors. Equilibrium limitations, stability. Derivation of energy balances for ideal reactors; equilibrium conversion, adiabatic and nonadiabatic reactor operation. (WHG)\n\nProblem set 5 due\n\nProblem set 6 out\n\nL12\n\nData collection and analysis. Experimental methods for the determination of kinetic parameters of chemical and enzymatic reactions; determination of cell growth parameters; statistical analysis and model discrimination. (WHG)\n\nWebLab experiment out\n\nR6\n\nRecitation 6\n\nL13\n\nBiological reactors - chemostats. Theory of the chemostat. Fed batch or semi-continuous fermentor operation. (KDW)\n\nProblem set 6 due\n\nMidterm exam 1\n\nWebLab follow-up assignment out\n\nR7\n\nRecitation 7: Review of midterm exam 1 and WebLab experiment\n\nL14\n\nKinetics of non-covalent bimolecular interactions. Significance; typical values and diffusion limit; approach to equilibrium; multivalency. (KDW)\n\nProblem set 7 out\n\nL15\n\nGene expression and trafficking dynamics. Approach to steady state; receptor trafficking. (KDW)\n\nWebLab follow-up assignment due\n\nR8\n\nRecitation 8\n\nL16\n\nCatalysis. Inorganic and enzyme catalysts and their properties; kinetics of heterogeneous catalytic reactions; adsorption isotherms, derivation of rate laws; Langmuir-Hinshelwood kinetics. (WHG)\n\nProblem set 7 due\n\nProblem set 8 out\n\nL17\n\nMass transfer resistances. External diffusion effects. Non-porous packed beds and monoliths, immobilized cells. (WHG)\n\nL18\n\nExternal mass-transfer resistance: Gas-liquid reactions in multiphase systems. (KDW)\n\nL19\n\nOxygen transfer in fermentors. Applications of gas-liquid transport with reaction. (KDW)\n\nR9\n\nRecitation 9\n\nProblem set 8 due\n\nMidterm exam 2\n\nL20\n\nReaction and diffusion in porous catalysts. Effective diffusivity, internal and overall effectiveness factor, Thiele modulus, apparent reaction rates. (KDW)\n\nProblem set 9 out\n\nR10\n\nRecitation 10\n\nL21\n\nReaction and diffusion in porous catalysts (cont.). Packed bed reactors. (WHG)\n\nProblem set 9 due\n\nProblem set 10 out\n\nL22\n\nCombined internal and external transport resistances. (WHG)\n\nR11\n\nRecitation 11\n\nL23\n\nPulling it all together; applications to energy/chemicals industry. Presentation of current research. (WHG)\n\nProblem set 10 due\n\nL24\n\nPulling it all together; applications to bioengineering and medicine. Presentation of current research. (KDW)\n\nR12\n\nRecitation 12\n\nL25\n\nCourse review. (WHG)\n\nFinal exam",
  "files": [
    {
      "category": "Resource",
      "title": "additional_info.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/338d16d2f638f5c05e595e17734d36ce_additional_info.pdf",
      "content": "For Fogler 2-5 and 6-6\nIn the first problem, Fogler 2-5, the textbook asks to use the figure to calculate the\nconversions. However, the figure itself has problems such as not matching with the table\nabove it (less data points and one misrepresented point) and difficult to get accurate\nresults. You are required to use the values in the table instead of the figure and Matlab to\nsolve this problem. The use of matlab involves numerical interpolation (by command\ninterp1, together with a spline scheme to get a smooth interpolation), numerical\nintegration (quad), and numerical solution to equations (fzero). These will be also used in\nthe RTD problem. Of course, any method getting the accurate results will be accepted.\nA sample code (showing you how to use these functions) is as follows:\nx0=fzero(@equation,1)\ny=quad(@curve,0,1);%to integrate function curve(x) with x from 0 to 1\n\nfunction y=curve(x)\ndata=[1 2 3 4 5;1.1 2.1 3.01 4.03 5.2]';\ny=interp1(data(:,1),data(:,2),x,'spline');\nreturn\nfunction y=equation(x)\nt=0.3;y=curve(x)*x-t;\nreturn\nIn the problem of Fogler 6-6, plot the selectivities vs. concentrations using Matlab, not by\ncrude sketching. This will help you in understanding the obscure problem\nstatement better.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "batch_reactor.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/8e7d297311d0e0161d4501242715971c_batch_reactor.pdf",
      "content": "HW6 Batch Reactor Balances\nIt is not legitimate to simply take the CSTR enthalpy\nbalance and set the flow terms to zero. This is an\nincorrect enthalpy balance on the reactor in batch mode.\nSee below for a review of how to use thermodynamics in this\nsituation.\nGiven that there is negligible gas holdup in the reactor:\nN B (t) = NC (t) = 0\nhence,\ndN B\ndNC\n=\n= 0\ndt\ndt\nEnthalpy balance:\nd H\nd(N AH A + N BH B + NCH C )\nd(N AH A )\ndN A\ndH A\n=\n=\n=\nH A +\nN A\ndt\ndt\ndt\ndt\ndt\nd H = Q& - FBH B - FCH C\ndt\ndN\ndH\ndt\nA H A +\ndt\nA N A = Q& - FBH B - FCH C\nBatch Reactor mole balances:\ndN A\ndt\n= -kN A\ndN B = 0 = -FB,out + kN A\ndt\nFB,out = kN A\ndNC = 0 = -FC,out + 2kN A\ndt\nFC ,out = 2kN A\nPlugging in the three mole balance relationships into the\nenthalpy balance we find:\n- kN AH A + dH A N A = Q& - kN AH B - 2kN AHC\ndt\ndH A N A = Q& - kN A (H B + 2H C - H A )= Q& - kN A∆H rxn (T )\ndt\ndH A\ndT\n= c\ndt\np,a dt\ndT = Q& - kN A∆H rxn (T ) = Q& - kmA∆Hˆ\nrxn (T )\ndt\nN Ac p,a\nmAcˆp,a\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007. MIT OpenCourseWare\n(http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Assignment",
      "title": "pset01_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/0dc1efb0fe3c2aa209178bcb7309ac9f_pset01_soln.pdf",
      "content": "10.37 Spring 2007 Homework 1\nDue Wednesday, Feb. 14.\nProblem 1. Airbags contain a mixture of NaN3, NaNO3, and SiO2. When the vehicle is in a crash, the\nfollowing reactions are initiated:\n2 NaN3 Æ 2 Na + 3 N2\n10 Na + 2 NaNO3 Æ N2 + 6 Na2O\nNa2O + 10 SiO2 Æ glass\na) If 150 g of NaN3 are used in an airbag, how many grams of NaNO3 and SiO2 must be included so that all\nof the sodium in the system can be safely sequestered as glass? Note the sodium-containing compounds\nNaN3, Na, and Na2O are all dangerous and toxic.\nb) The most important species for airbag performance in a crash are NaN3 and N2, so there are two obvious\ndefinitions of conversion:\nXNaN3 = (moles NaN3 reacted)/(initial moles NaN3)\nand\nXN2 = (moles of N2)/(total moles of N2 when all reactions are completed).\nWhat units do XNaN3 and XN2 have? Does XNaN3 equal XN2? If not, how different could they be?\nThere are three other related quantities, ξ1, ξ2, and ξ3, the extents of reactions 1,2, and 3. Note that each ξ\nhas units of moles. Write algebraic equations for each X in terms of the ξ's.\nc) Suppose that reaction 1 has a rate expression r1=k1/V (this reaction proceeds at a steady rate as a reaction\nfront moves through the solid NaN3), reaction 2 has a rate expression r2=k2[Na][NaNO3], and reaction 3 has\na rate expression r3=k3[Na2O]/V.\nBy the convention used in this course, all the r's have units of moles/second/liter. Write rN2, the rate of\nproduction of N2 per unit volume, in terms of r1, r2, and r3.\nWrite the equations for rate of change of the number of moles, dni/dt, for all the chemical species (i=N2,\nNaN3, Na, NaNO3, Na2O, SiO2, glass).\nd) Of course the volume of the airbag, V, is dramatically changing during the course of the reaction due to\nthe creation of a gas, N2, inside the bag. If the bag can expand fast enough to so that the pressure inside the\nbag is similar to the pressure outside the bag, by the ideal gas law one would expect:\nV = Vo + VN * nN2\nand under this condition the bag would expand depending on the rate at which gas is created:\ndV/dt = VN * dnN2/dt\nwhere VN is the molar volume of a gas at atmospheric pressure (~22 liter/mole) and nN2 is the number of\nmoles of N2 in the airbag. The initial volume of the airbag Vo ~70 cm3.\nHowever there is a physical limit on how fast the airbag can expand. When an airbag is expanded by gas\npressure, the radius of the bag cannot grow faster than the speed of pressure fronts in the gas,\napproximately the speed of sound:\ndR/dt < csound\ncsound ~ 300 m/s in air.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nso there is an upper bound on how fast the airbag can grow; for a spherical airbag:\ndV/dt = 4π R2 dR/dt\nso dV/dt < 4π (3V/4π)2/3 csound = (36πV2)1/3csound\nSo a reasonable approach to model this numerically is\nif (V<Vo + VN*nN2)\n\ndV/dt = (36πV2)1/3csound\nelse\n\ndV/dt = VN * dnN2/dt\nendif\nUsing a numerical ODE solver in Matlab, solve the coupled system of differential equations for the n's and\nV. Take k1~103 moles/s, k2~106 liter/mole-s, k3~105 liter/s. Make and turn in a plot of XN2 vs. time, ξ3 vs.\ntime, and volume vs. time for the first 10 milliseconds of operation. Also, make and turn in a plot of\nvolume vs. time for just the first 0.1 milliseconds of operation. Does the volume vs. time behavior make\nphysical sense? If not, go back and modify your Matlab program to fix the non-physical dV/dt behavior.\nSubmit your Matlab program(s) to the 10.37 course website.\nProblem 1 Solution\na)\n(2 NaN3 Æ 2 Na + 3 N2)÷2\n→ NaN3 Æ Na + 3/2 N2\n(10 Na + 2 NaNO3 Æ N2 + 6 Na2O)÷10\n→ Na + 1/5 NaNO3 Æ 1/10N2 + 6/10 Na2O\n(Na2O + 10 SiO2 Æ glass)x6/10\n→ 6/10Na2O + 6SiO2 Æ 6/10glass\nNet reaction w/all Na safely sequestered as glass:\nNaN3 + 1/5NaNO3 + 6SiO2 Æ 8/5N2 + 3/5 glass\n1mol\nnNaN3, = 150g\n= 2.3mol\no\n65g\n85g\nnNaNO , = nNaN , ⋅ 1mol NaNO3 = 2.3 mol = 0.46mol or m\n= 0.46mol\n= 39g\nNaNO\n3 o\n3 o\n5mol NaN3\n3,o\n1mol\n60g\nnSiO2,o = nNaN3,o ⋅ 6mol SiO2 = 6 ⋅ 2.3mol = 13.8mol\nor mSiO2,o = 13.8mol\n= 830g\n1mol NaN3\n1mol\nb) XNaN3 and XN2 are dimensionless. XNaN3 does not equal XN2 during the reaction.\nX NaN3 =\n2ξ1\nX N2 =\nnN2 = 3ξ1 + ξ2\nnNaN3,o\nnN2, f\n8 nNaN ,\n3 o\nX NaN - X N =\n2ξ1\n- 3ξ1 + ξ2 = ξ1 - 5ξ2\nnNaN3,o\n5 nNaN3,o\n8nNaN3,o\nThe difference between XNaN3 and XN2 will be determined by the kinetics of r1 and r2 (i.e.\nthe rate of change of ξ1 compared to ξ2).\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nc) For no flows in/out and assuming a homogeneous reaction:\ndnA =∑ν A,i\ndξi =∑ν A,iriV\nCan report dni/dt using extents or reaction rates\ndt\ndt\ni\ni\nSpecies\nmol balance\ndni/dt (using extents)\ndni/dt (using reaction rates)\nNaN3\nnNaN3 = nNaN3,o - 2ξ1\ndt\nd\ndt\ndnNaN\nξ\n= -\nrV\ndt\ndnNaN\n2 1\n3 = -\nNaNO3\nnNaNO3 = nNaNO3,o - 2ξ2\ndt\nd\ndt\ndnNaNO\nξ\n= -\nr V\ndt\ndn NaNO\n2 2\n-\n=\nSiO2\nnSiO2 = nSiO2,o - 10ξ3\ndt\nd\ndt\ndnSiO\nξ\n= -\nr V\ndt\ndn SiO\n-\n=\nNa\nnNa = 2ξ1 - 10ξ2\ndt\nd\ndt\nd\ndt\ndnNa\nξ\nξ -\n=\n(\n)V\nr\nr\ndt\ndnNa\n1 10\n2 -\n=\nN2\nnN2 = 3ξ1 + ξ2\ndt\nd\ndt\nd\ndt\ndnN\nξ\nξ +\n=\n(\n)V\nr\nr\ndt\ndnN\n3 1\n+\n=\nNa2O\nnNa2O = 6ξ2 - ξ3\ndt\nd\ndt\nd\ndt\ndnNa O\nξ\nξ -\n=\n(\n)V\nr\nr\ndt\ndnNa O\n6 2\n-\n=\nGlass\nnglass = ξ3\ndt\nd\ndt\ndnglass\nξ3\n=\nr V\ndt\ndnglass\n=\nRate of production of N2: rN = 3⋅ r1 + r2\nd) See the Matlab solution provided. Plots showing XN2 vs. time, ξ3 vs. time, and\nvolume vs. time are copied below.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nProblem 2. One of the students in this class recently measured the reaction of vinyl radical (C2H3) with\nethene (C2H4), a reaction important in flames, pyrolysis, and polymerization reactors. Vinyl radical absorbs\npurple light, so the amount of light absorbed is proportional to the concentration of the vinyl radical. In\neach experiment the student measured the time variation in the amount of purple light passing through his\nconstant volume sample using a photodetector. The voltage signal from the photodetector is linearly related\nto the absorbance, which is proportional to [C2H3], so\nSignal(t) = b + m[C2H3](t)\n\nEq. (1)\nwhere b is an uninteresting number related to how well the electronics baseline was zeroed out before each\nexperiment.\nHe performed similar experiments many times, each time with different initial concentrations of ethene in\nthe sample. From these experiments, he extracted the rate constant \"k\" at various temps and pressures.\nThe reaction of interest is:\nC2H3 + C2H4 Æ products\nThis reaction is very exothermic, so the reaction is essentially irreversible (i.e. when equilibrium is\nachieved the vinyl concentration is too small to detect). You expect this reaction to follow elementary-step\nkinetics, i.e.\n-rC2H3=(k0 + k[C2H4])[C2H3]\n(Eq. 2)\nk0 accounts for all other first-order loss processes of C2H3 in the experiment (e.g. unimolecular reaction).\nBecause the initial concentration of C2H3 is much smaller than the concentration of C2H4, it is reasonable to\nassume that the concentration of C2H4 does not vary significantly during each experiment. Therefore one\nexpects a simple exponential decay of [C2H3]:\n[C2H3] = [C2H3]o e-t/τ\n\n(Eq.\n\n3)\n\na) Write out the algebraic relationship between τ and k. Fit the measured signal for the nth experiment Sn\nto this form:\nSn(t) = Bn + An exp(-t/τn)\n(Eq. 4)\nGive expressions for An, Bn, and τn in terms of b, m, [C2H3]o, k0, k, and [C2H4]0,n. Which of the three fit\nparameters An, Bn, and τn depends on k and [C2H4]0 ?\nb) Use Matlab to plot 1/τn vs. [C2H4]n, where τn is the exponential decay time constant determined by\nfitting the data from the nth experiment. How can you use this plot to determine the rate constant \"k\"?\nYour assignment is to compute the rate constant \"k\" for the reaction of interest from the student's data,\ncontained in files vinylethene1, vinylethene2, and vinylethene3 on the 10.37 course website. In each file the\nfirst column is the time in seconds, and the second column is the measured signal Sn. The first dataset is for\n[C2H4]=6.7x10-4 M, the second for [C2H4]=4x10-4 M and the third for [C2H4]=1.33x10-4 M.\nTurn in the value of \"k\" you derived from modeling the student's experimental data (don't forget to specify\nthe units of \"k\"!), and also turn in plots comparing your model predictions using this \"k\" with the\nexperimental data. Submit your Matlab program(s) to the 10.37 course website.\nN.B. Notice that in this type of \"pseudo-first-order\" experiment, one can determine \"k\" without knowing\n[C2H3]o, the calibration constant \"m\" relating the signal to [C2H3], what the products of the reaction are, nor\nwhat the competing reactions are (that contribute to r0). Because of these simplifications, this type of\nexperiment is very widely use'd to determine rate constants.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nProblem 2 Solution\na) -rC2H3 = -d[C2 H3 ]\n\nEq\n\ndt\nSubstitute Eq 3 into Eq 5\n-t τ\n-rC H = -d[C2 H3 ] = -d ([C2 H3 ]o e\n) = [C2 H3 ]o 1 e-t τ\n\nEq 6\ndt\ndt\nτ\nSubstitute Eq 3 into Eq 2:\n-rC2 H3 = (k0 + k[C2 H 4 ])[C2 H 3 ]= (k0 + k[C2 H 4 ])[C2 H 3 ]o e- τ\nt\nEq 7\nSet Eq 6 = Eq 7 and simplify:\nτ =\n[C2 H 3 ]o\n1 e -t τ = (k0 + k[C2 H 4 ]o )[C2 H 3 ]o e-t τ\n→\n\nEq 8\nk0 + k[C2 H4 ]o\nτ\nalgebraic relationship between τ and k\nSubstitute Eq 3 into Eq 1:\nS( )t = b + m[C2H3 ]( )t = b + m[C2 H3 ]oe-\n\nEq\n\nSubstitute Eq 8 into Eq 9:\n-t\n\nS( )t = b + m[C2 H3 ]oe-t τ = b + m[C2 H3 ]oe k0 +k[C2 H4 ]o\nEq 10\nCompare Eq 10 and Eq 4 to define:\nBn = b\nAn = m[C2H3 ]o\nτ n = k0 + k[C2 H4 ]o,n\nOnly τn depends on k and [C2H4]o,n.\nb) See the Matlab solution provided. To determine k, fit 1/τn vs. [C2H4]o,n to a straight\nline. Slope = k (L/mol-s), y-intercept = k0 (1/s). Figures from Matlab are copied below.\nτ\nt\nk=1.11x107 L/mol-s\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Rea\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Techno\nDownloaded on [DD Month YYYY].\nction\nlogy.\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Assignment",
      "title": "pset01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/fe4d2cbfc258bfa7ecb74de768c24371_pset01.pdf",
      "content": "10.37 Spring 2007 Homework 1\nDue noon Wednesday, Feb. 14.\nProblem 1. Airbags contain a mixture of NaN3, NaNO3, and SiO2. When the vehicle is in\na crash, the following reactions are initiated:\n2 NaN3 Æ 2 Na + 3 N2\n10 Na + 2 NaNO3 Æ N2 + 6 Na2O\nNa2O + 10 SiO2 Æ glass\na) If 150 g of NaN3 are used in an airbag, how many grams of NaNO3 and SiO2 must be\nincluded so that all of the sodium in the system can be safely sequestered as glass? Note\nthe sodium-containing compounds NaN3, Na, and Na2O are all dangerous and toxic.\nb) The most important species for airbag performance in a crash are NaN3 and N2, so\nthere are two obvious definitions of conversion:\nXNaN3 = (moles NaN3 reacted)/(initial moles NaN3)\nand\nXN2 = (moles of N2)/(total moles of N2 when all reactions are completed).\nWhat units do XNaN3 and XN2 have? Does XNaN3 equal XN2? If not, how different could\nthey be?\nThere are three other related quantities, ξ1, ξ2, and ξ3, the extents of reactions 1,2, and 3.\nNote that each ξ has units of moles. Write algebraic equations for each X in terms of the\nξ's.\nc) Suppose that reaction 1 has a rate expression r1=k1/V (this reaction proceeds at a\nsteady rate as a reaction front moves through the solid NaN3), reaction 2 has a rate\nexpression r2=k2[Na][NaNO3], and reaction 3 has a rate expression r3=k3[Na2O]/V.\nBy the convention used in this course, all the r's have units of moles/second/liter. Write\nrN2, the rate of production of N2 per unit volume, in terms of r1, r2, and r3.\nWrite the equations for rate of change of the number of moles, dni/dt, for all the chemical\nspecies (i=N2, NaN3, Na, NaNO3, Na2O, SiO2, glass).\nd) Of course the volume of the airbag, V, is dramatically changing during the course of\nthe reaction due to the creation of a gas, N2, inside the bag. If the bag can expand fast\nenough to so that the pressure inside the bag is similar to the pressure outside the bag, by\nthe ideal gas law one would expect:\nV = Vo + VN * nN2\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nand under this condition the bag would expand depending on the rate at which gas is\ncreated:\ndV/dt = VN * dnN2/dt\nwhere VN is the molar volume of a gas at atmospheric pressure (~22 liter/mole) and nN2 is\nthe number of moles of N2 in the airbag. The initial volume of the airbag Vo ~70 cm3.\nHowever there is a physical limit on how fast the airbag can expand. When an airbag is\nexpanded by gas pressure, the radius of the bag cannot grow faster than the speed of\npressure fronts in the gas, approximately the speed of sound:\ndR/dt < csound\ncsound ~ 300 m/s in air.\nso there is an upper bound on how fast the airbag can grow; for a spherical airbag:\ndV/dt = 4π R2 dR/dt\nso dV/dt < 4π (3V/4π)2/3 csound = (36πV2)1/3csound\nSo a reasonable approach to model this numerically is\nif (V<Vo + VN*nN2)\ndV/dt = (36πV2)1/3csound\nelse\ndV/dt = VN * dnN2/dt\nendif\nUsing a numerical ODE solver in Matlab, solve the coupled system of differential\nequations for the n's and V. Take k1~103 moles/s, k2~104 liter/mole-s, k3~105 liter/s.\nMake and turn in a plot of XN2 vs. time, ξ3 vs. time and volume vs. time for the first 10\nmilliseconds of operation. Also, make and turn in a plot of volume vs. time for just the\nfirst 0.1 milliseconds of operation. Does the volume vs. time behavior make physical\nsense? If not, go back and modify your Matlab program to fix the non-physical dV/dt\nbehavior.\nSubmit your Matlab program(s) to the 10.37 the course website.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nProblem 2. One of the students in this class recently measured the reaction of vinyl\nradical (C2H3) with ethene (C2H4), a reaction important in flames, pyrolysis, and\npolymerization reactors. Vinyl radical absorbs purple light, so the amount of light\nabsorbed is proportional to the concentration of the vinyl radical. In each experiment the\nstudent measured the time variation in the amount of purple light passing through his\nconstant volume sample using a photodetector. The voltage signal from the photodetector\nis linearly related to the absorbance, which is proportional to [C2H3], so\nSignal(t) = b + m[C2H3](t)\n\nEq. (1)\nwhere b is an uninteresting number related to how well the electronics baseline was\nzeroed out before each experiment.\nHe performed similar experiments many times, each time with different initial\nconcentrations of ethene in the sample. From these experiments, he extracted the rate\nconstant \"k\" at various temperatures and pressures.\nThe reaction of interest is:\nC2H3 + C2H4 Æ products\nThis reaction is very exothermic, so the reaction is essentially irreversible (i.e. when\nequilibrium is achieved the vinyl concentration is too small to detect). You expect this\nreaction to follow elementary-step kinetics, i.e.\n-rC2H3=(k0 + k[C2H4])[C2H3]\n(Eq. 2)\nk0 accounts for all other first-order loss processes of C2H3 in the experiment (e.g.\nunimolecular reaction). Because the initial concentration of C2H3 is much smaller than\nthe concentration of C2H4, it is reasonable to assume that the concentration of C2H4 does\nnot vary significantly during each experiment. Therefore one expects a simple\nexponential decay of [C2H3]:\n[C2H3] = [C2H3]o e-t/τ\n\n(Eq. 3)\na) Write out the algebraic relationship between τ and k. Fit the measured signal for the\nnth experiment Sn to this form:\nSn(t) = Bn + An exp(-t/τn)\n(Eq. 4)\nGive expressions for An, Bn, and τn in terms of b, m, [C2H3]o, k0, k, and [C2H4]0,n. Which\nof the three fit parameters An, Bn, and τn depends on k and [C2H4]0 ?\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nb) Use Matlab to plot 1/τn vs. [C2H4]n, where τn is the exponential decay time constant\ndetermined by fitting the data from the nth experiment. How can you use this plot to\ndetermine the rate constant \"k\"?\nYour assignment is to compute the rate constant \"k\" for the reaction of interest from the\nstudent's data, contained in files vinylethene1, vinylethene2, and vinylethene3 on the\n10.37 course website. In each file the first column is the time in seconds, and the second\ncolumn is the measured signal Sn. The first dataset is for [C2H4]=6.7x10-4 M, the second\nfor [C2H4]=4x10-4 M and the third for [C2H4]=1.33x10-4 M.\nTurn in the value of \"k\" you derived from modeling the student's experimental data\n(don't forget to specify the units of \"k\"!), and also turn in plots comparing your model\npredictions using this \"k\" with the experimental data.\nSubmit your Matlab program(s) to the 10.37 course website.\nN.B. Notice that in this type of \"pseudo-first-order\" experiment, one can determine \"k\"\nwithout knowing [C2H3]o, the calibration constant \"m\" relating the signal to [C2H3], what\nthe products of the reaction are, nor what the competing reactions are (that contribute to\nk0). Because of these simplifications, this type of experiment is very widely used to\ndetermine rate constants.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "final_exam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/3df90d5015556ebb24cf7f79cfd5f943_final_exam.pdf",
      "content": "10.37 Final Exam\nSpring 2007\nThere are 4 problems. Pick any 3 of these problems to do and turn in. (If you turn in\nsolutions to 4 problems, we will not count the problem where you earned the lowest\nscore.) Please turn in your solution for each problem separately. Write your name on\nevery blue book or sheet of paper you turn in.\nProblem 1. (100 points) A reactant stream is split to feed, in parallel, two CSTRs, one of\nwhich is twice the volume of the other. The effluents from the two CSTRs are combined.\nThe reaction of interest follows a first-order rate law.\na) (50 points). How should the feed stream be split in order to maximize the total\nreactant conversion in the combined effluent from the two CSTRs?\nSmall\nCSTR\nBig CSTR\nFeed\nEffluent\nb) (50 points). Using the same feed, what overall conversion would be obtained by\nplacing these same two CSTRs in series (i.e. the effluent of the first is the feed of\nthe second)? (Consider both possible topologies - one where the large CSTR\nfeeds the smaller, and one where the small CSTR feeds the larger.) Is this\nconversion superior or inferior to the best case calculated in a)?\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2. (100 points) An appealing partial solution to the greenhouse gas problem is\nto convert biomass into liquid fuels. Most of biomass is composed of linked C6 sugars\n(C6H12O6) and C5 sugars (C5H10O5), which can be broken down by an enzyme secreted\nby fungi. Ideally, the sugars could then be converted into ethanol or other liquids in\nsubsequent reactions.\nThis mechanism is proposed for the enzymatic breakdown:\nC11H22O11 + Enzyme Æ Complex\n\n(reaction 1)\nComplex Æ Enzyme + C6H12O6 + C5H10O5\n\n(reaction 2)\nReaction 1 is expected to be reversible under some conditions, but reaction 2 is\nexpected to be irreversible.\nExperimental rate data on this enzyme from low-conversion batch-reactor\nexperiments can be fit to this expression:\nd[C5H10O5]/dt = r = a[C11H22O11]0[Enzyme]0/{1 + b*[C11H22O11]0}\n(Eqn 3)\na = 2x104 liter/mole-second\nb=108 liter/mole.\nwhere [C11H22O11]0 and [Enzyme]0 are the initial concentrations added to the mixture, i.e.\n(moles added / volume of solution), not necessarily the actual concentrations of these\nspecies in the beaker when the reaction is running, since some of the enzyme will exist in\nthe form of the complex.\n(a) (20 points) Is the observed rate law (Eqn 3) consistent with the mechanism shown\nabove? If so, give an expression for b in terms of k1, k-1, and k2. If not consistent, explain.\nSuppose we could tether 10-9 mole of enzyme within a 4 mm diameter porous particle\nwithout affecting the rate law (i.e. r is given by Eqn. 3). The diffusivity inside the porous\nparticles is 10-10 m2/s. In the bulk fluid D = 7x10-10 m2/s. Suppose we then filled a packed\nbed reactor (internal diameter 2 cm, length 30 cm) with many particles like this, and\nflowed an aqueous solution of C11H22O11 through the reactor at rate of 1 liter/minute. The\nvoid fraction of the packed bed φ=0.4. For concentrations of C11H22O11 below 0.5 M, the\nviscosity and density of the solution is essentially the same as that of water.\n(b) (30 points) Write an equation for the Thiele modulus for this system, as a function of\n[C11H22O11]. Over what range of [C11H22O11] is it reasonable to neglect diffusive\ntransport limitations?\n(c) (30 points) If [C11H22O11] is always in the range where transport limitations are\nnegligible, what differential equation(s) should be solved to compute the conversion?\nWhat Matlab program would you use to solve the equation(s) numerically? Write the\ndifferential equation(s) in the form dY/dt = F(Y) required by the Matlab solvers.\n(d) (20 points) Write (but do not attempt to solve) the differential equation(s) with\nboundary conditions that would have to be solved to compute the effectiveness factor Ω\nif [C11H22O11]bulk had a value outside the range specified in part (b). Are you missing any\ndata needed to calculate Ω?\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3. (100 points) A biosensor experiment is performed with a small amount of\nimmobilized protein and flowing soluble ligand. The observed rate constant during the\nassociation phase, and the signal output at equilibrium, are given as a function of ligand\nconcentration in the table below. The equilibrium signal RUeq is proportional to the\nconcentration of protein/ligand complex at the surface. During the association phase the\nsignal follows the following function: RU = RUeq (1- e-kobs t ).\n[L]o (nM)\nkobs (s-1)\nRUeq\n0.14\n0.00177\n1.63\n0.84\n0.00186\n9.34\n2.1\n0.00201\n21.5\n5.60\n0.00245\n47.1\n14.00\n0.00350\n82.5\n35.0\n0.00612\n84.00\n0.0122\n210.00\n0.0280\n560.00\n0.0718\n1400.00\n0.177\nA) (60 points) Determine Kd, kon, and koff. Are these data self-consistent?\nB) (40 points) In a separate experiment, soluble protein (2 nM) and ligand (0.1 nM)\nare mixed. At equilibrium, what fraction of ligand is complexed with the protein?\nAt what time following mixing will 95% of this equilibrium value be attained?\nProblem 4. (100 points total) \"Clean Coal\" technology is based on first converting the\ncoal into syngas (an H2 + CO mixture). The syngas can then be purified and used to make\nclean synthetic fuels, or to generate electricity (with CO2 sequestration). The largest and\nmost expensive reactor in a \"clean coal\" plant is the gasifier. The main reactions are:\nC(s) + 1⁄2 O2(g) Æ CO(g) (Reaction 1)\n∆Hrxn1 = -110 kJ/mole\nr1 = k1(T)[O2]2[H2]/([H2O] + a[H2])\nk1(T)=(107 liter/mole-s)exp(-2000/T)\na=0.0113 exp(10000/T)\nC(s) + H2O(g) Æ H2(g) + CO(g) (Reaction 2)\n∆Hrxn2 = +130 kJ/mole\nr2 = k2[O2][H2O]/([H2O] + a[H2])\nk2 = 5x104 s-1 at T=1100 K\na=100\nat T=1100 K\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 4 (continued) The peculiar-looking rate laws come from a quasi-steady-state\napproximation treatment of the radicals which are the reactive intermediates in these\nreactions. Reaction 1 is much faster than reaction 2 at low T, so the gasifier system can\nbe modeled as an adiabatic PFR (volume V1) where most of the O2 is consumed but the\nH2 formation is negligible, followed by an isothermal CSTR (volume V2) where both\nreactions occur.\nGasifier\nAdiabatic PFR,\nVolume V1\nOnly reaction 1\nIsothermal\nCSTR\nVolume V2\nT=1100 K\nReaction 1 & 2\nFeed\nsyngas\nThe final 1100 K output stream coming out of the gasifier has no carbon and a negligible\nconcentration of O2(g), but large concentrations of CO, H2, and steam. Assume that the\nheat capacity of the feed stream is 3 MJ/ton-Kelvin and that the heat capacity per ton\ndoes not change significantly with temperature or the change in composition through the\nreactions. The process is carried out at Ptotal=40 bar. The input stream is at 700 K, and\nconsists of 120 tons per hour of C(s), 120 tons per hour of steam, 64 tons per hour of O2,\nand 0.02 tons per hour of H2.\n(a) (20 points) What is the molar flow rate of CO, H2, and H2O at the output? What is\nthe volumetric flow rate of the output?\n(b) (25 points) How much heat must be transferred per second to maintain the output\nat 1100 K? Is the heat flowing into or out of the reactor? How could you adjust\nthe composition of the feed to reduce the amount of heat transfer required, while\nstill maintaining the same Carbon feed rate and output temperature?\n(c) (30 points) Write the equation(s) that should be solved to compute the conversion\nof O2 in the adiabatic PFR, V1=1 m3, in a form that can be solved numerically by\nMatlab. What Matlab program would you use to solve these equations?\n(d) (25 points) What CSTR reactor size V2 is required so that 99% of the initial feed\nO2 and 99% of the initial feed carbon will be consumed by the time the mixture\nleaves the isothermal (1100 K) CSTR? Hint: How much carbon was consumed by\nreacting with O2? So how much carbon must be consumed by reaction 2?\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "ex1_rev_03212007.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/974d5df83efceed755dde9809c7f5d89_ex1_rev_03212007.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam 1 Review\n\nIn-Out+Production=Accumulation\n\nAccumulation=0 at steady state\nA\nA\nA\nF\nF\nr V\n-\n+\n=\n\n[ ]\nA\nF\nA ν\n=\n\n[ ]\nA\nF\nA ν\n=\n\nFor a liquid phase with constant density:\nν\nν\n=\n\nFor A\nB\n→\nthe reaction moles are the same, so\nν\nν\n=\n\nFor\nA\nB\n→\n,\nν\nν\n=\n\n[ ]\nξ\n= moles (extent of reaction) (-) for a reactant and (+) for a product\n,\nrxns\nN\ni\ni\ni n\nn\nN\nN\nn\nυ ξ\n=\n=\n+ ∑\n\nSuppose A\nB\nC\n→\n+\n\nA\nA\nA\nA\nN\nN\nX\nN\n-\n=\n\n(\n)\n0 1\nA\nA\nA\nN\nN\nX\n=\n-\n\nThermodynamics\nSuppose\nk\nk\nA\nB\nC\n-\n+\nZZZX\nYZZZ\n\nG RT\ne\nK\ne Δ\n-\n=\n\n,\n,\nf products\nf reactants\nG\nG\nG\nΔ\nΔ\nΔ\n°\n°\n=\n-\n\n[ ][ ]\n[ ]\nc\nB C\nK\nA\n=\nhas units. You need to use standard states, such as 1M, to make it\ndimensionless.\n\nEnzyme Catalysis\nEnergy versus reac\ntion pr\nog\nre\nss. The ener\ngy rises to the transition state energy where reaction occurs. The transition state has a lower energy with an enzyme.\n\nFigure 1. Energy diagram for a reaction with and without enzyme.\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nE\nS\n+\nU ES\nES\nE\n→\n+ P\nPseudo steady state approximation:\n[\n]\nd ES = 0\ndt\n[ES] = f (\n)\nother species\n\nCell Growth\n# cells\nN =\n\nvolume\nN\nN\n=\nt\n0eμ\nMonod kinetics:\n[ ]\n[ ]\nμmax S\nμ =\n\nK\nS\nS +\nΔA\nYA =\n\nB\nΔB\n\nRate Constants\nk T\n( ) = Ae-E\nR\na\nT\nGiven k1 and k2, you can calculate k and a different temperature.\n\nCSTRs\nF X\nV =\nA0\nA\n-rA\n\nIf the reaction is 1st order and it consists of liq\nds with constant density:\nIncorporates changing\nvolumetric flow rate\nui\nX\nτ =\nA\n\nk\nX\n(1-\nA)\nV\nvolume\nτ =\n=\n\nν\nvolumetric flow rate\nτk\nX A =\n\n1+τk\nDa =τ k =Damkohler number: ratio of kinetic effect to volumetric effect or\n\nratio of reaction rate to dilution rate\n2nd order reaction:\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 2 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\n(\n)\nX\nτ =\nA\n\nkC\nA\nA\n-X\nDa =τkCA\n+\n-\nDa\n+ Da\nX A =\n\n2Da\n\nFor constant density and 1st order reaction:\ndN\nF\nF\nA\nA\nA\n0 -\n+ rAV =\n\ndt\ndC\nC\nC\nA\nA\nA\n0 -\n+ rAτ\nτ\n=\n\ndt\nLet:\nˆ\nCA\nt\nC\nt\nA =\n=\nˆ\n\nCA0\nτ\nNondimesionalize:\ndCˆ\nA +\n+\n(1\nDa)Cˆ\ndtˆ\nA =\n\nSolve given C\nt\nˆ\nat\nA =\n=\nˆ\n\nC\ne\nˆ\n(\n)\n-\n+\n(1 Da t)ˆ\nA =\n-\n\n1+ Da\nTanks in series: 1st order reaction\n(\n)\nC\nC\nA,0\nA n, =\n\n1+ Da\nn\n\nReactor Design Equations\nCSTR:\nF X\nV =\nA0\nA\n-rA\nBatch:\ndN\nr V\nA\n=\nA\ndt\nN\nV\n=\n[A] If V changes, then V must remain in the differential\nA\nPFR: dX A\n-r\n=\nA\nAdz\nFA0\nPBR: Pressure drop consideration\n\nIf\n( )\n( )\ng\ng\nA\nB\n→\n\nUse\n\n(conservation of mass)\n\nν ρ\nνρ\n=\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 3 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nIntroduce ideal gas law\nT\nPm\nF RT\nρ =\n\nT\nm\nnRT\nP\nP\nF RT\nν\nρ\n⎛\n⎞\n=\n=\n=\n⎜\n⎟\n⎝\n⎠\n\n(\n)\n0 1\nT\nT\nF\nF\nX\nε\n=\n+\n\nReactor volume:\nGr\na\np\nh\n\no\nf a Levenspiel plot for\na\nC\nSTR a n\nd a PFR for pos\nitive order reactions. For a given conversion, the CSTR has the greater volume than the PFR.\n\nFigure 2. Levenspiel plot for a CSTR and a PFR for positive order reactions.\nSelectivity\nGrap\nh\n\no\nf\nf\nr\na\nc\nt\ni\no n\nal yiel\nd\n\nv\ne\nr\nsus concentration. The curve increases from left to right and then levels off. It is concave downward. The overall yield times the concentration difference for a CSTR is a rectangle underneath the curve.\n\nFigure 3. Fractional yield versus concentration. Overall yield times concentration\ndifference shown for a CSTR.\n\nCSTR\nk\nk\nA\nP\nC\n⎯⎯→\n⎯⎯→\n\n3k\nA\nU\n⎯⎯→\n\n[ ]\n[ ]\n(\n)\n[ ]\nA\nk\nA\nk\nA V\nF\nA ν\n+\n=\n-\n\nNon-ideal reactors\nResidence time distribution E(t)\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 4 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 5 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\nt\n( )\n( )\nreactor\nt\nC\nδ\n⎯⎯⎯→\n\nE(t) must have a pulse trace\n( )\n( )\n( )\n( )\nC t\nE t\nE t\nC t dt\ninf\ninf\n=\n=\n∫\n∫\n\n( )\nmt\ntE t\ninf\n= ∫\n\ndt\nMean residence time, tm, for an:\nIdeal CSTR: τ\nIdeal PFR: τ\n(\n)\n( )\nm\nt\nt\nE t dt\nσ\ninf\n=\n-\n∫\n\nVariance, σ2, for an:\nIdeal CSTR: τ2\nIdeal PFR: 0\n( )\nV\nE t\nt\nδ\nν\n⎛\n⎞\n⎛\n⎞\n=\n-\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\n⎝\n⎠\n( ) (\n)\n( )\nf t\nt\nt dt\nf t\nδ\ninf\n-\n=\n∫\nAproperty of a dirac delta function\nFor a CSTR,\n( )\nt\ne\nE t\nτ\nτ\n-\n=\n\nExample 1\n\nSc\nhe\nmati\nc of a PFR with inflow of A and outflow of A, B, and C. The length of the reactor is L.\nFigure 4. Schematic of a PFR with inflow of A and outflow of A, B, and C.\n\nr\nr\nA\nB\nC\n⎯⎯→\n⎯⎯→\n\nA\nB\nr\nk C\nr\nk C\n=\n=\n\n( )\nmoles of B produced\nmoles of A in\nB\nB\nA\nF L\nY\nF\n=\n=\n\nMole balance on B\nB\nB\nA\nxs\ndF\nr\nr\nr\nk C\nk C\nA\ndz =\n=\n-\n=\n-\nB\nB\nB\nF\nC ν\n=\n\nA\nA\nF\nC\nν\n=\n\nB\nA\nB\nxs\ndC\nk C\nk C\nA\ndz\nν\n=\n-\n\nA\nA\nxs\ndC\nk C\nA\ndz\nν\n= -\n\nxs\nA\nA\nk A\ndC\ndz\nC\nν\n-\n=\n\nln\nxs\nA\nk A\nC\nz\nφ\nν\n-\n=\n+\n\nInitial condition at z=0 gives:\nln\nA\nC\nφ\n=\n+\n\nexp\nxs\nA\nA\nk A\nC\nC\nz\nν\n⎡\n⎤\n-\n=\n⎢\n⎥\n⎣\n⎦\n\nexp\nxs\nxs\nxs\nB\nB\nA\nk A\nk A\nk A\ndC\nC\nC\ndz\nν\nν\nν\n⎡\n⎤\n-\n+\n=\n⎢\n⎥\n⎣\n⎦\nz\n\n[ ]\ntime, call it\nxs\nA\nz\nτ\nν\n=\n\nThis is the time it takes for something to flow to the end of the reactor (of length z).\nvelocity\nxs\nV\nA\nν\n=\nG\n\nk\nB\nB\nA\ndC\nk C\nk C e\nd\nτ\nτ\n-\n+\n=\n\nIntegrating factor:\nke\nτ\n(\n)\nk\nk\nk\nB\nA\nd\nC e\nk C e\nd\nτ\nτ\nτ\n-\n⎡\n⎤=\n⎣\n⎦\n\n(\n)\nk\nk\nk\nA\nB\nk C\nC e\ne\nk\nk\nτ\nτ\nφ\n-\n=\n+\n-\n\nInitial condition: z=0, CB=0\nB\nA\nk C\nk\nk\nφ\n=\n+\n-\n\n( )\nk\nk\nA\nB\nk C\nC\ne\nk\nk\ne\nτ\nτ\nτ\n-\n-\n⎡\n⎤\n=\n-\n⎣\n⎦\n-\n\nC\nxs\ndF\nr\nA\ndz = +\n\nA\nxs\ndF\nr\nA\ndz = -\n\nB\nxs\ndF\nr\nr\nA\ndz =\n-\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 6 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nC\nA\nB\nxs\ndF\ndF\ndF\nA\ndz\ndz\ndz\n⎡\n⎤\n+\n+\n=\n⎢\n⎥\n⎣\n⎦\n\nA\nA\nB\nF\nF\nF\nF\n=\n+\n+\nC\nB\n\nC\nA\nA\nF\nF\nF\nF\n=\n-\n+\n\nFl\now\nra\nte\nF\nvers\nus residence time tau for species A, B, and C. The amount of B reaches a maximum. The residence time to achieve that maximum is tau-star.\n\nFigure 5. Graphs of flow rates of A, B, and C as a function of residence time.\n\n(\n)\n*\n*\nk\nk\nA\nB\nk C\ndC\nk e\nk e\nd\nk\nk\nτ\nτ\nτ\n-\n-\n=\n-\n+\n-\n=\n\n*\n*\nk\nk\nk e\nk e\nτ\nτ\n-\n-\n=\n\nln\n*\nln\n*\nk\nk\nk\nk\nτ\nτ\n-\n=\n-\n\n(\n)\nln\n*\nk\nk\nk\nk\nτ\n=\n-\n\nln\n*\nk\nk\nk\nk\nτ =\n-\n\nL'Hopital's rule:\n*\n*\n( )\n( )\nlim\nlim\n( )\n( )\nx\nx\nx\nx\ndA x\nA x\ndx\ndo\ndy\nB x\ndB\nx\ndx\ndx\n→\n→\n=\n\nFind τ* for k1=k2\nlim *\nlim\nk\nk\nk\nk\nk\nk\nk\nτ\n→\n→\n=\n=\n=\n\n*\nxs\nxs\nA L\nA\nτ\nτ\nz\nν\nν\n=\n=\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 7 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\n*\nlength of reactor\nxs\nL\nA\nτ ν\n=\n=\n\nExample 2\nIf\nA\nB\n→\n(Assume negligible pressure drop)\nA\nr\nkC\n=\n\nS\nch\nem\natic of a PFR with inflow FA0 and length L.\nFigure 6. Schematic of a PFR.\n\nA\nA\nA\ndF\nr\nkC\ndV = -\n= -\n\nν\nν\n↔\n\n(\n,\ntotal\nPV\nnRT\nF\nn\nV\nν\n=\n=\n\n)\n=\n\ntotal\ntotal\ntotal\nRT\nF\nF\nP\nC\nν\n-\n=\n=\n\ntotal\nA\nB\nF\nF\n=\n+ F\nA\nA\nA\ntotal\nF\nC\ny F\nν\n=\n=\n\nA\nA\nA\ntotal\nA\nB\ndF\nF\nP\nky C\nk\ndV\nF\nF RT\n= -\n= -\n+\n\nB\nA\nA\ntotal\nA\nB\ndF\nF\nP\nky C\nk\ndV\nF\nF RT\n= +\n= +\n+\n\nIf P or T changes, you need other equations.\n\nDerivation of E(t) for a CSTR\nS c h\ne\nm\na\ntic of a CSTR. The pulse has the form of a delta function.\n\nFigure 7. Schematic of a CSTR.\n\nNo reaction:\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 8 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\n( )\n( )\ndN\nN\nt\nC\ndt\nN\nN\nt\nV\nδ\nν\nδ\nν\n=\n-\n=\n-\n\n0 ( )\ndN\nN\nN\nt\ndt\nV\nν\nδ\n+\n=\n\nIntegrating factor: exp\nt\nV\nν\n⎛\n⎞\n⎜\n⎟\n⎝\n⎠\n\nexp\nexp\n( )\nd\nN\nt\nt N\ndt\nV\nV\nν\nν\nt\nδ\n⎛\n⎞\n⎛\n⎞\n⎛\n⎞\n=\n⎜\n⎟\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\n⎝\n⎠\n⎝\n⎠\n\nexp\nexp\nN\nt\nN\nN\nV\nV\nν\nν\nφ\n⎛\n⎞\n⎛\n⎞\n=\n⋅\n=\n+\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\n⎝\n⎠\n\nInitial condition: t=0, N=N0 Æ φ=0\n0 exp\nN\nN\nt\nV\nν\n⎛\n⎞\n=\n-\n⎜\n⎟\n⎝\n⎠\n\nV\nν\nτ\n=\n\n0 exp\nt\nC\nC\nτ\n-\n⎛\n⎞\n=\n⎜\n⎟\n⎝\n⎠\n\n( )\nC\nE t\nCdt\ninf\n=\n∫\n\n(\n)\ne\n0 1\nt\nt\nCdt\nC e\ndt\nC\nC\nC\nτ\nτ\nτ\nτ\nτ\ninf\ninf\ninf\n-\n-\n⎡\n⎤\n⎡\n⎤\n=\n=\n-\n=\n-\n-\n=\n⎣\n⎦\n⎢\n⎥\n⎣\n⎦\n∫\n∫\n\n( )\nt\nt\nC e\ne\nE t\nC\nτ\nτ\nτ\nτ\n-\n-\n=\n=\n\nLong-chain approximation\nDeactivate\nk\nk\nk\nk\nk\nE\nS\nES\nP\ntRNA\nE\nE\nE\n-\n+\n⎯⎯→\n+\n⎯⎯→\n⎯⎯→\nZZZX\nYZZZ\n\nEnzyme propagates a long time before it is destroyed.\nLCA:\n[\n]\n[ ]\nk\ntRNA\nk\nE\n=\n\n(assume 1st order)\nIf there are other steps, add them into the equation\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 9 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\ndestruction\nk\nES ⎯⎯→\n\n[\n]\n[ ]\n[\n]\nk\ntRNA\nk\nE\nk\nES\n=\n+\n\nSuppose there is a production term\nk\nC\nE\n⎯⎯→\n\nAdd another term\n[ ]\n[\n]\n[ ]\n[\n]\nk\nC\nk\ntRNA\nk\nE\nk\nES\n+\n=\n+\n\n0 ,\nA\nA\nA\nA\nF\ndX\nr\nkC\nAdz\nr\n=\n-\n=\n-\n\nThis is a single differential equation in terms of X. Use for PFR with gas flow.\nρ ν\nρ\n=\nν\n(\n)\nA\nA\nC\nX T P\nC\nX\nPT\nε\n-\n=\n+\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nExam1 Review\n\nPage 10 of 10\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "midterm1_key.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/f2d05f20438e788f949c4470e364792e_midterm1_key.pdf",
      "content": "Solutions.\nProblem 1.\na) For first-order reaction kinetics\nsec\n/\n3.0\nmin\n2.5\nsec\n/\n3.0\nmin\n2.5\nk\nk\nDa\nDa\nX\n-\n-\nA\nL\nL\nL\nL\n×\n×\n+\n×\n×\n=\n+\n=\n+\n=\n-\n-\nτ\nτ\n=0.58\nb) Consider the non-steady state design equation for CSTR, where we can have\ndt\ndN\nr\nF\nF\nA\nA\nA\nA0\n=\n+\n-\nV\n\nSince in liquid phase with constant density, we have\ndt\ndC\nkC\n-\nC\nC\nA\nA\nA\nA0\nτ\nτ =\n-\n\nor equivalently\nτ\nτ\nτ\nA0\nA\nA\nC\nC\nk\ndt\ndC\n=\n+\n+\n\nwith the initial conditions CA,t=0=(1-0.58)×0.12 mol/L=0.05 mol/L, new τ=10000L/(0.7×0.3*60\nL/min)=793.7 min\nTherefore, integrate this equation we can have\n)\nk\nexp(\nC\n]}\nk\nexp[\n{\nk\nC\n)\n(\nC\nt\nA,\nA0\nA\nt\nt\nt\nτ\nτ\nτ\nτ\nτ\n+\n-\n+\n+\n-\n-\n+\n=\n=\n\nTherefore the conversion at time t is\n]\nk\nexp[\nC\nC\n]}\nk\nexp[\n{\nk\n)\n(\nX\nA0\nt\nA,\nA\nt\nt\nt\nτ\nτ\nτ\nτ\nτ\n+\n-\n-\n+\n-\n-\n+\n-\n=\n=\n\nAfter 60 min of changing flow rate,\n.0\n]\nk\nexp[\nC\nC\n]}\nk\nexp[\n{\nk\nmin)\n(\nX\nA0\nt\nA,\nA\n=\n+\n-\n-\n+\n-\n-\n+\n-\n=\n=\nt\nt\nτ\nτ\nτ\nτ\nτ\n\nThe new steady state fractional conversion is\n7.0\nsec\n/\n3.0\nmin\n2.5\n7.0\nsec\n/\n3.0\nmin\n2.5\nk\nk\nDa\nDa\nX\n-\n-\nA\n×\n×\n×\n+\n×\n×\n×\n=\n+\n=\n+\n=\n-\n-\nL\nL\nL\nL\nτ\nτ\n=0.665\nc) The steady state productivity (moles/time) of B is FB, and the ratio of that in b) vs. that in a) is\nB\n.0\n.0\nL/sec\n3.0\n.0\n7.0\nL/sec\n3.0\nF\nF\na\nB,\nb\nB,\n=\n×\n×\n×\n=\n\nTherefore, the productivity will be decreased by lowering the flow rate even though a higher\nconversion is to be achieved.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2.\nWe know for first order reaction, conversion XA has the following relation with rate constant k,\nCSTR reactor volume V and volumetric flow rate v\nv\nV\nk\nv\nV\nk\nXA\n+\n=\n\nWhen we have a dead volume (denoted as subscript 1) which does not interact with the input and\noutput streams, we can deduce this amount of volume from the overall reactor volume.\nv\nV\nk\nv\nV\nk\nX\nA1\n+\n=\n\nWe\nare\ntold\nV1=600L-400L=200L,\nXA1=0.75,\ntherefore\nwe\ncan\ncalculate\nv\nk =\n)\nX\n-\n(1\nV\nX\nA1\nA1\n=\n=0.015.\nThen for the well-stirred reactor, V=600L\nv\nV\nk\nv\nV\nk\nXA\n+\n=\n=0.9\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3.\nFor a PFR reactor, the design equation is\nin\n\ncelluose,\ncelluose\ncelluose\nF\nr\n-\nS\ndz\ndX\n=\n\nNow S=10cm2, length=2m, Fcelluose, in=vin[cellulose]in, in order to know v, we have to convert 60\ngrams of slurry into total moles of cellulose and water per second, that is\nwater\ncellulose\nin\n\ntotal,\nMW\n20%)\n1(\ngram/sec\n\nMW\n20%\ngram/sec\n\nn\n-\n×\n+\n×\n=\n\n=\nmol/sec\n\n.2\ngram/mol\n\n20%)\n1(\ngram/sec\n\ngram/mol\n\n20%\ngram/sec\n\n=\n-\n×\n+\n×\n=\n\nUsing ideal gas law to get the volumetric flow rate:\nP\nRT\nn\nv\nin\n\ntotal,\nin\n\n=\n=\nliter/sec\n\n.6\natm\n\nK\nJ/mol/K\n\n8.314\nmol/sec\n\n2.683\n=\n×\n×\n\nAlso\ncellulose,\nin\nmol/m\n\n.2\n600K\nK)\nl\n8.314J/(mo\natm\n)\n18gram/mol\n%\ngram/mol\n%\n(\ngram/mol\n\n%\nRT\nP\ny\n]\n[cellulose\n=\n×\n-\n+\n=\n=\n\nwhere ycellulose,0 is the molar fraction of cellulose in the inlet.\nIn this problem, since the gas phase reaction creates more molecules, the volumetric flow rate is\nnot a constant.\na[CO]\n]\n[cellulose\nk\nr\n- celluose\n+\n=\n\nwhere the concentrations should be expressed (constant pressure and temperature are assumed)\nX)\n(1\nX)\n-\n(1\n]\n[cellulose\n]\n[cellulose\nin\nε\n+\n=\n\nand\nX)\n(1\n24X\n]\n[cellulose\n]\n[H\n[CO]\nin\nε\n+\n=\n=\n\nHere ε=(24+24-1)ycellulose,0=47*0.0062=0.292.\nNow the final molar flow rate of H2 is\nvfinal[H2]=24vin[cellulose]inXf\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "midterm1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/63ba4830861c4a16899097a9b9176418_midterm1.pdf",
      "content": "10.37 first midterm\nMarch 23, 2007\n3 problems total\n\nProblem 1. (40 points total)\n\nThe following liquid-phase hydration reaction occurs in a 10,000 L CSTR:\n\nA\n+ H2O\n⎯\n→\n⎯ ⎯ B\n\nWith a first-order rate constant of 2.5 x 10-3 min-1.\n\na) (20 points) What is the steady-state fractional conversion of A if the feed rate is\n0.3 L/sec and the feed concentration CA,o = 0.12 mol/L?\n\nb) (10 points) If the feed rate suddenly drops to 70% of its original value and is\nmaintained there, what is the fractional conversion of A after 60 minutes, and\nwhat is the new steady state fractional conversion?\n\nc) (10 points) What is the ratio of the steady-state productivity (moles/time) of B for\ncase b) relative to case a)?\n\nProblem 2. (30 points)\n\nA 600 L tank reactor gives 75% conversion for a first order irreversible reaction.\nHowever, the paddle turbine motor is underpowered and so the tank is not well stirred. In\nfact, a pulse-tracer experiment to determine the residence time indicates that\napproximately 400 L of the tank may be considered as a dead volume that does not\ninteract appreciably with the input or output streams. If you replace the stirrer with one\nsufficiently strong to obtain complete mixing throughout the reactor volume, what\nconversion will be obtained?\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3. (30 points)\n\nIn a biorefinery, a steady-state PFR operating at 600 K is used to convert cellulose\noligomers CnH2nOn suspended in water into \"syngas\" (a mixture of CO and H2 that can be\neasily converted into many different fuels or chemicals):\n\nC24H48O24(g) Æ 24 CO(g) + 24 H2(g)\n\nThe cellulose oligomers are introduced as a 20 wt% slurry in liquid water; 60 grams of\nthe slurry are introduced every second. At this high temperature, it is a good\napproximation to assume all the species in the reactor are in the gas phase. The reaction\nrate law has been measured at 600 K under these conditions to be:\n\nr = k [CnH2nOn(g)] / {1 + a [CO(g)]}\n\nwhere k= 0.01 s-1 and a = 10 liter/mole\n\nThe pressure in the reactor is 20 atm. There is no significant pressure drop in the reactor.\nThe cross-sectional area inside the reactor is 10 cm2, and the reactor is 3 m long.\n\nWrite the differential equation(s) that would have to be solved to predict the\nmoles/second of H2 coming out of the reactor. Write the equation(s) in the standard ODE\nformat:\n\ndY/dz = f(Y)\n\nwhere Y(z) are the unknown(s) you want to compute, and there are no other\nunknowns on the right hand side of the equation(s). Please do not attempt to solve the\nequation(s).\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "midterm2_key.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/40d84ef61492f9504761f5dbdce81f3c_midterm2_key.pdf",
      "content": "10.37 Exam 2\n25 April, 2007\n100 points\nProblem 1: 35 points\nA protein and ligand bind reversibly with Kd = 10 nM . The association rate constant\nk\n= 2x104M-1s-1. The two species are mixed at an initial protein concentration of 3 nM\non\nand an initial ligand concentration of 0.2 nM.\na) At equilibrium, what fraction of the ligand will be complexed with protein? (15 points)\nb) At what time will the fraction of ligand in complex reach 95% of the equilibrium\nvalue? (20 points)\nJustify any assumptions you make to simplify equations.\nP + L ←→C\nkoff\n[P]eq [L]eq\nK d =\n=\nkon\n[C]eq\nUsing a batch reactor mole balance and looking at the reaction stoichiometry, it is easy to\nsee that given the initial conditions any unit of complex formed takes away a unit of\nprotein and ligand:\n[P] + [C] = [P]0\n[L] + [C] = [L]0\nUsing these in the equilibrium equation we can get a quadratic equation in [C]eq.\n([P]0 - [C]eq )([L]0 - [C]eq )\nKd =\n[C]eq\n0 = [C]eq\n2 -([L]0 + [P]0 + Kd )[C]eq + [P]0[L]0 = 0\n[C] = ([L]0 + [P]0 + Kd )± ([L]0 + [P]0 + Kd )\n2 - 4[P]0[L]0 = 0\neq\nReject the positive root, it is too large (larger than the initial amount of ligand and\nprotein).\n[C]eq = 0.0456nM\n[C]eq = 0.228 = 23%\n[L]0\nAt this point, it is interesting to look at different approximations to the expression.\nGood Approximation: [P]0 >> [C]\nThis leads to\n([P]0 )([L]0 - [C]eq )\nK d ≈\n[C]eq\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n[C] = [L]0[P]0 0.462nM\neq\nKd +[P]0\n[C]eq = 0.231 = 23%\n[L]0\nBad Approximation: [L]0 >> [C]\n([P]0 -[C]eq )([L]0 )\nKd ≈\n[C]eq\n[C]eq = [L]0[P]0 = 0.0588\nK d + [L]0\n[C]eq = 0.294 = 29%\n[L]0\nThe error in [C]eq of the bad approximation is about 30% of the true answer, whereas the\ngood approximation is only off by about 1%.\nBy noticing that the \"good\" approximation is a good approximation, the dynamic\nequation becomes easier to solve. (As an aside, an even better approximation would be\njust to neglect the second order term that is O([C]eq\n2).)\nStart with the full dynamic equation:\nd[C] = kon [L][P] - koff [C] = kon ([L]0 -[C])(\n\n[P]0 -[C])- koff [C]\ndt\nMake an appropriate approximation:\n([P]0 -[C])≈ [P]0\nd[C] ≈ kon [L]0[P]0 - kon [P]0[C] - koff [C]\ndt\nRearrange and solve using the integrating factor:\nd[C] +[C](kon [P]0 + koff )= kon [L]0[P]0\ndt\nd ([C]exp[(kon [P]0 + koff )t])= kon [L]0[P]0 exp[(kon [P]0 + koff )t]\ndt\non\non\noff\n([C ]exp [(kon [P]0 + koff ) t]) = k [L] [P] exp ((k [P] + k )t ) + I.C.\n(kon [P]0 + koff )\n[C] = ([\n[\nP\nL\n]\n]\n0[\n+\nP\nK\n]0\nd )\n+ I.C.exp[-(kon [P]0 + koff )t]\nUsing the initial condition, [C](t = 0) = 0, we find the integration constant to be:\n[L]0[P]0\nI.C. = - ([P]0 + Kd )\nHence,\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n[C](t) = [L]0[P]0 {1- exp[-(kon [P]0 + koff )t]}\n([P]0 + Kd )\nThe equilibrium value is clearly the value when t gets large.\n[C](t) = [C]eq {1- exp(- (kon [P]0 + koff ) t)}\nIn order to find the point at 95% of the equilibrium value, rearrange and solve for the\ntime when [C]/[C]eq=0.95:\n[C](t*) = 0.95 ={1- exp[-(kon [P]0 + koff )t *]}\n[C]eq\n0.05 = exp[-(kon [P]0 + koff )t *]\n- ln(0.05)\n- ln(0.05)\n3.00\nt* =\n=\n=\n=11500s\n-5\n-1 -1\n(kon [P]0 + koff )\n(kon [P]0 + konKd )\n2x10 nM s [3nM +10nM ]\nt* = 11500s ≈ 3.2h\nProblem 2: 30 points\nA surface-catalyzed reaction follows Rideal-Eley kinetics as follows:\n\nkA→\nA + S← AS\nk- A\nk1\nAS + A → A2 + S\n\nWhere A and A2 are in the gas phase, S is a reactive site on the surface, and AS is a\nmolecule of A adsorbed to a reactive site.\nAssuming that:\n- adsorption of A is at rapid equilibrium\n- reaction of AS with A is rate-limiting\n- desorption of A2 is very rapid\nDerive the steady-state rate law for production of A2 as a function of the concentration of\nA and the total initial reactive site density So .\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nr\n= k\nC C - C AS\n\nwhere K = k A\nAd\nA\nA\nv\nA\n\nK A\nk- A\nrs = k1C ASC A\nAdsorption is at rapid equilibrium, so rAd ≈ 0\nk A\nC ACv = C AS\n⇒\nC AS = K AC ACv\nK A\nOverall site balance in terms of So:\nS\nSo = Cv + C AS = Cv + K AC ACv\n⇒\nCv =\no\n1+ K AC A\nGiven that the surface reaction is the rate limiting step, and the stoichiometric coefficient\nis +1 for A2, the rate of production of A2 is:\nk K S C 2\nrA\n'\n2 = rs = k1CASCA = k1K ACvCA\n2 =\nA\no\nA\n1 + K ACA\nProblem 3: 35 points\nIt is desired to make a product X-Y via this reaction:\nX-OH + Y-H → X-Y + H2O\nAn equimolar feed of liquid X-OH and Y-H at 25oC are fed to a CSTR. At 25oC, where\nall 4 material species are liquids, the heat of reaction ∆Hrxn=-200 kJ/mole, and the heat\ncapacity of each liquid-phase species is 4 kJ/(kg Co). The molecular weight of X-OH is\n150 g/mole, and the molecular weight of Y-H is 100 g/mole. The temperature inside the\nreactor (T) is controlled by putting the reactor in thermal contact with a fluid flowing\nover the outside of the reactor at temperature Ta. To a good approximation, the heat\ntransfer rate (Q, in watts) from the fluid flowing over the outside the reactor to the\ncontents of the reactor is given by the linear expression:\nQ = UA(Ta-T)\na) If the reaction is carried out with the reactor at steady-state at the inlet\ntemperature of 25oC, is T greater than, less than, or equal to Ta? (5 points)\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFor an exothermic reaction, to maintain the products at the same temperature as the\nreactants one must remove heat. So T must be greater than Ta, i.e. Ta must be below\nroom temperature.\nb) When running the reactor at T = 25oC to 50% conversion, the productivity is\nunacceptably low. To try to accelerate the reaction, it is decided to increase the\nsteady-state reactor temperature to T = 105oC. At this temperature, all of the H2O\nformed evaporates, but the other species are still liquids. The heat of vaporization\nof H2O at 105oC is +40 kJ/mole. When T=105oC, the reaction runs to 50%\nconversion 10x faster than it did at 25oC, so we increase the flowrates until the\nreactor is making 10x as much product as it did at 25oC (still at 50% conversion).\nWhen we achieve the new steady-state high-productivity operation at 105oC, will\nthe magnitude of Q (i.e. |Q|) be larger, smaller, or the same as it was when we\nwere operating at 25oC? At this steady-state condition, is T greater than, less than,\nor equal to Ta? (20 points)\nIf the reaction ran 100% to completion, it would release (200 kJ/mole)(1 mole/0.25\nkg entering the reactor)=800kJ/kg entering the reactor. Since we only have 50%\nconversion, the chemical heat release is half as much, 400 kJ/kg. Heating the feed\nfrom 25 C to 105 C requires: (80 degrees)(4 kJ/kg) = 320 kJ/kg entering the reactor.\nEvaporating the water formed by the reaction requires an additional (40 kJ/mole\nH2O)(0.5 mole H20/ 0.25 kg entering reactor) = 80 kJ/kg. Since the heat release and\nthe heat required to warm up the mixture and evaporate the water balance, Q=0 now.\nIn contrast, when we ran the reactor at 298 K, we had to remove heat at a rate of 200\nkJ/kg. So the magnitude of Q is much lower now than before, and T should\napproximately equal Ta.\nc) Since operating hot improved our productivity, but conversion is still pretty low,\nthe operator tries to improve things by cranking up the temperature, preheating\nthe inlet streams to 185oC and increasing Ta. For good measure the operator\nsimultaneously cranks up the reactor pressure from 1 bar to 100 bar; at this high\npressure all the species remain as liquids. (The reactor is safe at this condition,\nand even up T = 300oC.) Curiously, the conversion and productivity of the reactor\ndo not increase under these severe conditions, instead they decrease. Propose an\nexplanation for this experimental observation. (5 points)\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nIt is possible that we are running into equilibrium limitations on the reaction. For\nexothermic reactions, Keq decreases with increasing temperature. So if we are\nequilibrium limited at high T, we would expect the conversion to decrease as T\nincreases. (Note that by increasing the pressure so dramatically, the operator\nprevented most of the H2O from evaporating, hence the concentration of H2O in the\nliquid phase is probably much higher now than it was in the 105 C case where the\nwater evaporated; this contributes to the equilibrium limitation).\nd) Your manager gives the operator who turned up the temperature (without doing\nany calculations first) a formal reprimand, saying the operator is probably lucky\nthat the conversion went down instead of increasing. Why do you think the\nmanager was happy that conversion was low instead of increasing a lot? (5 points)\nExothermic reactions can \"run away\" if T goes high enough, i.e. past a certain point,\nthe steady-state conversion will suddenly jump from a low number to a very high\nconversion, releasing essentially the whole exothermicity, and jumping the T to a\ntemperature above the safety limits of the reaction vessel. In the present case, if the\nreverse reaction were negligible the reaction would release 800 kJ/kg, enough to\nincrease the temperature inside the reactor by up to 200 degrees, so it could have\nexceeded the T=300 C safety limit. The results could have been fatal to the operators\nor anyone else nearby. But fortunately in this case it was lucky that high conversion\nwas not achievable due to the small value of the equilibrium constant.\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "midterm2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/b5dd26e01e7f2595053ce3ec537b353e_midterm2.pdf",
      "content": "10.37 Exam 2 25 April, 2007\n100 points\nProblem 1: 35 points\nA protein and ligand bind reversibly with Kd = 10 nM . The association rate constant\nkon= 2x104 M-1s-1. The two species are mixed at an initial protein concentration of 3 nM\nand an initial ligand concentration of 0.2 nM.\na) At equilibrium, what fraction of the ligand will be complexed with protein? (15 points)\nb) At what time will the fraction of ligand in complex reach 95% of the equilibrium\nvalue? (20 points)\nJustify any assumptions you make to simplify equations.\n\nProblem 2: 30 points\nA surface-catalyzed reaction follows Rideal-Eley kinetics as follows:\nA\nA\nk\nk\nA\nS\nA\n-\n⎯⎯⎯→\n+\n←⎯⎯\n⎯\nS\nk\nAS\nA\nA\nS\n+\n⎯⎯→\n+\n\nWhere A and A2 are in the gas phase, S is a reactive site on the surface, and AS is a\nmolecule of A adsorbed to a reactive site.\nAssuming that:\n\nadsorption of A is at rapid equilibrium\n\nreaction of AS with A is rate-limiting\n\ndesorption of A2 is very rapid\n\nDerive the steady-state rate law for production of A\n2 as a function of the concentration of\nA and the total initial reactive site density So .\n\nProblem 3: 35 points\nIt is desired to make a product X-Y via this reaction:\nX-OH + Y-H → X-Y + H2O\nAn equimolar feed of liquid X-OH and Y-H at 25\noC are fed to a CSTR. At 25\noC, where all 4\nmaterial species are liquids, the heat of reaction ∆Hrxn=-200 kJ/mole, and the heat capacity of\neach liquid-phase species is 4 kJ/(kg C\no). The molecular weight of X-OH is 150 g/mole, and the\nmolecular weight of Y-H is 100 g/mole. The temperature inside the reactor (T) is controlled by\nputting the reactor in thermal contact with a fluid flowing over the outside of the reactor at\ntemperature Ta. To a good approximation, the heat transfer rate (Q, in watts) from the fluid\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nflowing over the outside the reactor to the contents of the reactor is given by the linear\nexpression: Q = UA(Ta-T)\na) If the reaction is carried out with the reactor at steady-state at the inlet temperature of 25\noC, is\nT greater than, less than, or equal to Ta? (5 points)\n\nb) When running the reactor at T = 25\noC to 50% conversion, the productivity is unacceptably\nlow. To try to accelerate the reaction, it is decided to increase the steady-state reactor\ntemperature to T = 105\noC. At this temperature, all of the H2O formed evaporates, but the\nother species are still liquids. The heat of vaporization of H2O at 105\noC is +40 kJ/mole.\nWhen T=105\noC, the reaction runs to 50% conversion 10x faster than it did at 25\noC, so we\nincrease the flowrates until the reactor is making 10x as much product as it did at 25\noC (still\nat 50% conversion). When we achieve the new steady-state high-productivity operation at\noC, will the magnitude of Q (i.e. |Q|) be larger, smaller, or the same as it was when we\nwere operating at 25\noC? At this steady-state condition, is T greater than, less than, or equal\nto Ta? (20 points)\nc) Since operating hot improved our productivity, but conversion is still pretty low, the operator\ntries to improve things by cranking up the temperature, preheating the inlet streams to 185\noC\nand increasing Ta. For good measure the operator simultaneously cranks up the reactor\npressure from 1 bar to 100 bar; at this high pressure all the species remain as liquids. (The\nreactor is safe at this condition, and even up T = 300\noC.) Curiously, the conversion and\nproductivity of the reactor do not increase under these severe conditions, instead they\ndecrease. Propose an explanation for this experimental observation. (5 points)\n\nd) Your manager gives the operator who turned up the temperature (without doing any\ncalculations first) a formal reprimand, saying the operator is probably lucky\nthat the conversion went down instead of increasing. Why do you think the\nmanager was happy that conversion was low instead of increasing a lot? (5 points)\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological\nReaction Engineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "rev_exam2_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/4dc64db87634af6971183d5bb2db4c23_rev_exam2_soln.pdf",
      "content": "Cite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "rev_exam2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/61e8acef1848aae335ea82bedf0b187b_rev_exam2.pdf",
      "content": "Four major areas (√: covered in the following example problems):\nNon-isothermal reactors (√)\nBiological reactors (√)\nLigand/receptor binding kinetics\nSurface reactions/catalysis kinetics\n\nGo over the first problem in PS7 to review the ligand/receptor binding kinetics and\nthe first problem in PS8 to review the surface reactions/catalysis kinetics.\n\nProblem 1.\nThe irreversible liquid phase reaction A →R + S is carried out in a CSTR. The reaction is\nfirst order in A. The feed stream is available at a temperature of 298 K.\nk = 1.7 x 10\n-4\ns\n-1\nat 298 K.\nEa = 41.87 x 10\nkJ/kmol\nΔHR(298) = -167.5 x 10\nkJ/kmol\nCA0 = 2.0 kmol/m\n(Feed is pure A)\nV = 0.5 m\nρ = 1050 kg/m\nCp = 4.19 kJ/kg/K\nThese values can be considered to be constant over the used interval of concentration and\ntemperature. The CSTR is made of carbon steel and weighs 800 kg.\nCp,steel = 502.4 J/kg/K\nCalculate:\na) Conversion and heat duty for an isothermal reactor operating at 298 K.\nb) Conversion and reactor temperature for an adiabatic reactor with inlet temperature\nof 298 K.\nc) Conversion and preheating temperature for an adiabatic reactor with a reactor\ntemperature of 363 K.\nd) Conversion and heat duty if the reactor is operated non-adiabatically without\npreheating and at a temperature of 363 K.\n\nProblem 2.\nConsider an organism which follows Monod equation of growth with μmax = 0.5 h-1 and Ks = 2 g/L.\n\na)\nIn a continuous perfectly mixed vessel at steady state with no cell death, if the substrate\nconcentration in the feed is Sfeed = 50 g/L, the yield Y = 1 (g cells / g substrate), what\ndilution rate D gives the maximum volumetric productivity?\nb)\nFor the same dilution rate as part (a) using tanks of the same size in series, how many\nvessels will be required to reduce the substrate concentration to less than 1 g/L?\n\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "biot_numbers.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/ca372842a20e2e5416bcf2f3faf118f4_biot_numbers.pdf",
      "content": "Biot Numbers by David Adrian\nThis document is a review* of some of the concepts of heat and mass transfer,\nparticularly focusing on the dynamics at the interface between two disparate materials,\nsuch as the boundary of a solid particle submerged in a fluid. In the cases considered,\nthe interface is stationary and there is no phase change or chemical reaction at the\ninterface.\nThe Biot number is a dimensionless group that compares the relative transport\nresistances, external and internal. It arises when formulating and non-dimensionalizing\nthe boundary conditions for the typical conservation of species/energy equation for\nheat/mass transfer problems.\nIf your problem consists of an object suspended in a well mixed fluid, commonly you\nonly need to calculate the dynamics of the object (such as the temperature as a function of\nposition and time). If we focus on the fluid/object interface, the convective flux from the\nbulk fluid to the object must equal the diffusive flux from the surface to the interior of the\nobject. This is typically formulated as a Robin boundary condition at the interface. For\nexample, consider the unsteady heat transfer in a solid sphere at initial temperature T0\nsubmerged in a fluid of temperature Tinf (this is also the \"bulk\" temperature, and could be\ngiven the symbol Tb).\nAt the fluid-solid interface, the flux of heat into the sphere from the fluid must equal the\nflux of heat from the surface of the sphere to the interior.\nr\nr\nqexterior = qinterior\nq r\nexterior = h(Ts - Tinf)n r\nq r\ninterior = -kT ∇T surface\nThe variables are defined as follows: q is the heat flux, h is the heat transfer coefficient in\nthe fluid, T is the temperature, n r is the outwardly pointing normal from the solid, and kT\nis the thermal conductivity of the solid. (Also recall that the heat transfer coefficient can\nbe obtained from correlations, and is basically just kT , fluid /δT in systems without any\ninterfacial reactions or phase changes. The variable δT is the thickness of the thermal\nboundary layer.)\nSince our system is spherically symmetric:\nq r\nexterior = h(Ts -Tinf)e r\nr\nr e\nq r\ninterior = -kT\ndT\nr\ndr surface\ndT\n- kT\n= h(Ts -Tinf)\ndr surface\n* I hope it is a review! TAs should be knowledgeable about this stuff if you have questions.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nWe may non-dimensionalize the system by changing variables. We must pick a\ncharacteristic length scale and temperature scale with the hope that our dimensionless\ntemperature scale will be O(1)+, i.e. it goes from 0 to 1. Also, we want the derivatives of\nthat function with respect to our dimensionless length to also be O(1). This is getting a\ngood scaling for the problem.\nIn this problem, a good dimensionless temperature is:\nT -Tinf\nθ =\nT0 -Tinf\nThis temperature variable starts out at 1 and decays to zero once the solid and fluid\ntemperatures are equal.\nA good dimensionless length is the inverse of the surface area to volume ratio:\nSA\n4πR2\n3r\nη = r / L = r\n= r\n=\nV\n(4/3)πR3\nR\nL = R/3= O(R) in the case of a sphere so \"L = R\" would also be an okay choice. L is the\n\"typical\" length scale that heat in the solid particle must diffuse to get to the surface.\nUsing our definitions of dimensionless length and temperature, our Robin boundary\ncondition becomes:\n- kT\n(T0 - Tinf) dθ\n= h(Ts - Tinf)\nL\ndη surface\ndθ\nhL\n-\n=\nθ\n= N Bi θ\nsurface\nsurface\ndη surface\nkT\nhL\nL / kT\n\"internal diffusion resistance\"\nN Bi =\n=\n=\nkT\n1/ h\n\"external convection resistance\"\nBy definition, our dimensionless temperature is at most 1. Consider the effect of Biot\nnumber on the problem.\nCase 1: NBi<<1\ndθ\n-\n= N Biθ surface\ndη surface\nSince θ\nis at most one, in order for the equation to be true the surface gradient in\nsurface\nour dimensionless temperature is also small (as small as the Biot number). This means\nthat a good approximation to the dynamics can be found from a uniform temperature\nthroughout the sphere (a lumped system model). This means that the \"external\nconvection resistance\" dominates the problem, and the \"internal diffusion resistance\" is\n+ \"Big O Notation\" is used to state in rough terms the magnitude of terms relative to each other, usually\nonly considering the order of magnitude or scaling\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nsmall relative to the convection resistance so that it can be neglected when determining\nthe total resistance. (Think back to the \"resistors in series\" analogy in heat transfer.)\nFor example, a small heat transfer Biot numbers can arise in the case of a small\nconductive metal sphere in a stagnant fluid such as air. The convection speed is very\nslow (the resistance is large and h is small because the fluid is stagnant) and the\nconduction speed is very high (the thermal resistance is small, or the thermal conductivity\nis large, or the distance that heat has to diffuse in the object is very small).\nCase 2: NBi>>1\nOn the other hand, if our Biot number is very large, the gradient must either be very large\nat the surface or θ\nmust be very small. However, since we scaled the derivative\nsurface\ndθ\nproperly,\nshould be O(1). This means that θ\nis very small. Recall that if θ\nsurface\ndη surface\nis zero, this corresponds to the surface being in equilibrium with the bulk temperature (it\ntakes the bulk value). This simplifies our boundary condition for the problem so that we\ncan just use the condition that T (r = R) = Ts = Tinf and still get good results.\nMass Transfer Biot Numbers\nIn the case of mass transfer, the definition of the Biot number could get a little more\ncomplicated because the partition coefficient between phases is involved. In this class,\nhowever, we aren't worrying about partition coefficients, probably because we can't\neasily measure the internal concentrations anyway so we lump their effect into other\nunknown constants (such as the surface reaction rate constant).\nThe analogous case of a catalyst particle in a reactor fluid gives us the Robin boundary\ncondition:\nW\nr\nexterior = km (cs - cinf)e r\nr\nr\ndc\nr e\nWinterior = -De\nr\ndr surface\ndc\n- D\n= km (cs - cinf)\ne dr surface\nc - cinf\nθ =\nc0 - cinf\nSA\n4πR2\n3r\nη = r / L = r\n= r\n=\nV\n(4/3)πR3\nR\n(c0 - cinf) dθ\n- D\n= km (cs - cinf)\ne\nL\ndη surface\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ndθ\nk L\n-\n=\nm θ\n= N\nθ\nsurface\nBi,m\nsurface\ndη\nD\nsurface\ne\nIn this case, we should take a practical look at the terms in the Biot number and see if it is\nstuck in a particular range (always large, always small, etc.).\nk L\nN Bi,m =\nm\nDe\nD fluid\nkm =\n(stationary interface with no interface reaction)\nδ m\nN\n= D fluid L\nBi,m\nD\nδ\ne\nm\nThe boundary layer is the largest it can be in a stagnant system, and in that case it is\napproximately the same length scale as L. (Consider the example of the Sherwood or\nNusselt number for spheres in a stagnant medium.) Thus the ratio L /δ m is typically\ngreater than one.\nAlso, the diffusivity of the species in the fluid is typically much greater than the effective\ndiffusivity in the particle, where the species has to navigate the tortuous pore space. Thus\nD fluid / De is also typically much greater than one.\nLet's consider the mass transfer Biot number definition again and consider what it means\nin words:\nD fluid L\nL / De\n\"internal diffusion resistance\"\nN Bi,m =\n=\n=\n>>1\nDe δ m\nδ m / D fluid\n\"external diffusion resistance\"\nSo the consequence of this ratio is that whenever we are looking at a reactor where we\nhave bulk kinetic data, if we find out that we have an external diffusion limitation, we\nknow that we must also have an internal diffusion limitation.\nHowever, we might not be all that concerned, because when you have an external\nlimitation, you may be able to predict the reaction rate purely by considering the surface\nflux:\n- r''= W = km (cb - cs ) ≈ kmcb because cs << cb when external limitations prevail.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec01_02072007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/98d5717996d5ae55c4831d64c42ec88e_lec01_02072007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 1: Preliminaries & Remembrance of Things Past\n\nThis lecture covers: reaction stoichiometry, lumped stoichiometries in complex\nsystems such as bioconversions and cell growth (yields), extent of reaction,\nindependence of reactions, measures of concentrations, single reactions and reaction\nnetworks, and bioreaction pathways.\n\nCo\nntrol volume with inflow Fo and outflow FA.\n\nFigure 1. A schematic of a control volume with inflow of Fo and outflow of species A,\nFA.\n\nF = total molar flow rate (moles/sec)\nFo = total molar flow rate entering control volume\nFA = molar flow rate of species A\nFAo = molar flow rate of species A entering control volume\nNA = Moles of species A\n\nMass balance: (change in \"A\" inside control volume)= (amount of \"A\" that entered)-\n(amount of \"A\" that exited) + (amount of \"A\" created inside the control volume) -\n(amount of \"A\" destroyed inside the control volume)\n\n[ ]\ndN A =\n-\nF\nF + G\ndt\nAo\nA\nA\nmoles\nGA =\nsec\n\nIf homogeneous, G\nr\nA\nA\n=\nV\nelse, G\nr\nA\nA\n= ∫\ndV\nwhere V is volume and rA is the rate of A created or destroyed (moles/sec/volume).\n\nThe mass balance can also be written as:\n\nd\nconvP\ndiffusion\nection\n\nρA =\n∇\nv\nD\nρ\nρ\nA +\n∇\nA\nA\n+ r\ndt\nwhere v is velocity, D is the diffusion coefficient, and ρA is the molar density of A\n(moles/volume).\n\nExample:\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nA+B→C+D\n\n[ ][ ]\n[ ][ ]\n[ ][ ] moleA\n,\n,\nliter\nA\nC\nr\nk A B\nr\nk A B\nA\n= -\n= +\n=\n\nwhere k is a measurable rate constant that changes with respect to T and P but\nremains constant with respect to changing concentrations.\n\nIf\n[ ][ ]\n1r\nk A B\n=\n, then\nP1\n,1 1\nA\nA\nr\nr\nν\n=-\n=\n\nwhere\n,1\nA\nν\nis the stoichiometric coefficient for species A in reaction 1. Likewise,\nP1\n,1 1\nC\nC\nr\nr\nν\n=+\n=\n\nIf there are n reactions involving species \"A\" then\n,\nn\nA\nA\ni\nr\nr\nν\n=\n= ∑\ni i\n[\n][\n]\n. - ( ( , , , ))\n( , , , )\n( , , , )\n( )\n( , , , )\nA\nA\nVol\nk T x y z t\nA x y z t\nB x y z t\nG t\nr\nx y z t\ndxdydz\n= ∫∫∫\n\n[ ]\nP\n[ ][ ]\n*only true if there are no flows!\nA\nN\nV\nd A\nk A B\ndt\n= -\n→\n\nA\n, assume r is true throughout volume\nA\nA\nA\ndN\nr dV\nr V\ndt\n=\n≈\n∫\n\nIf the system is homogeneous and there are no flows:\nA\nA\ndN\nr V\ndt\n=\n\nTherefore:\niff homogeneous, no flow, constant V\nA\nA\nN\nd\nr\ndt\nV\n⎛\n⎞=\n⎜\n⎟\n⎝\n⎠\n\nExtent of Reaction\n[ ]moles, extent of rxn.\nξ =\n\n[ ] moles , rate of extent of rxn.\nsec\nξ =\n\nA\nB\nC\nD\n+\n→\n+\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 1\nProf. William H. Green\n\nPage 2 of 3\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\n,initially\n,initially\n,\n, if there is one reaction involving A\n, if there are several reactions\nA\nA\nA\nA\nA n\nn\nn\nN\nN\nN\nN\nξ\nν\nξ\n=\n-\n=\n-∑\n\n, n is the reaction number\n, A is the species\nn\nn\nA\nA\nr dV\nG\nr dV\nξ =\n=\n∫\n∫\n\nConversion\nA\nB\nC\nD\n+\n→\n+\n\n,initial\n,initial\n(dimensionless)\nA\nA\nA\nA\nN\nN\nX\nN\n-\n=\n\n,initial\n(\n1 since rxn is 1:1)\nC\nC\nA\nN\nX\nN\n=\n≈\n\nA\nB\nC\nD\nA\nU\n+\n→\n+\n⎛\n⎞\n⎜\n→\n⎝\n⎠⎟ Selectivity is good if\n, bad if\n.\nA\nC\n→\nA\nU\n→\n*May worsen as rxn. goes on (\nslows,\nkeeps going)\nA\nC\n→\nA\nU\n→\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 1\nProf. William H. Green\n\nPage 3 of 3\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec02_02092007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/03959cc9615bf18cbe03b9943238d959_lec02_02092007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 2: The Reaction Rate & Reaction Mechanisms\n\nThe lecture covers: Definitions in terms of reacting compounds and reaction extent,\nrate laws, Arrhenius equation, elementary, reversible, non-elementary, catalytic\nreactions.\n\nFrom previous lecture:\n,\nA\nAo\nA\nA\nA\nA\ndN\nF\nF\nG\nG\nr dV\ndt\n=\n-\n+\n= ∫\n\nExample:\nC\nB\nA\n→\n+\n\n*Reactions are reversible (often will neglect reverse)\nAo\nA\nAo\nN\nN\nX\nN\n-\n=\nA\nAo\nA\nAo\nF\nF\nX\nF\n-\n=\nA\nC\nC\nAo\nF\nX\nF\n=\n\nA re\nacto\nr with\ninputs A and B and outputs A, B, and C.\n\nFigure 1. A reactor with reactants A and B constantly flowing in and product C and\nunused reactants A and B flowing out.\n[ ]\nN\n[ ]\n[ ]\n[ ]\n[ ]\nliters\nsec\nmoles A flowing in\nsec\nmoles A flowing out\nsec\nAo\nin\no\ninput\no\nA\no\noutput\nout\noutput\nin\nin\nF\nA\nF\nA\nA\nv\nX\nA\nv\n=\n=\n=\n=\n= -\nut\nv\nA\nv\nv\n=\n\nClosed reactor, const. V\n\nDetailed balance- all steps in equilibrium, total system\n\n[ ]\n[ ][ ]\n[ ]\n[ ][ ]\nA\neq\nd A\nr\nk A B\ndt\nC\nK\nA B\n=\n= -\n=\n\nwhen [ ][ ]\n[ ]\neq\nC\nA B\nK\n=\nthe rxn. stops -> rA=0\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\n[ ][ ] [ ]\n,\n,\nforward-reverse in one expression\nsame!\nfor\nA\nrev\neq\neq\nk\nC\nr\nk\nA B\nk\nK\nK\n⎛\n⎞\n⎜\n⎟\n= -\n-\n=\n⎜\n⎟\n⎝\n⎠\n/\n\nCatalysis\n[\n][ ]\n[ ]\n(\n)\n,\nmay be included\ni.e. when B is\nvery small\ncatalyst\nA forward\ncat\nr\nk\nA\nf\nB\n=\n\nRate limiting step determines the kinetics (slow step). The kinetics are insensitive to\n[B] because B is not part of this slow step.\n\n[ ]\n[ ][ ]\n[\n] [ ]\n[ ]\n[ ][ ]\n,\n,\n,\ncatalyst\nA reverse\nA forward\neq\nA net\ncat\neq\nC\nr\nr\nK\nA B\nC\nr\nk\nA\nK\nA B\n=\n⎛\n⎞\n⎜\n⎟\n= -\n-\n⎜\n⎟\n⎝\n⎠\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 2\nProf. William H. Green\n\nPage 2 of 3\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\nStoichiometric coefficient\n\n,\n,\nG RT\no\no\neq\nf products\nf reactants\nK\ne\nG\nG\nG\nΔ\nΔ\nΔ\nΔ\n-\n=\n=\n-\n\nA\nB\nC\n→\n+\n\neq\nK\n[ ][ ]\n[ ] [ ] moles\nliter\nB C\nA\n=\n=\n\nC\nK\nP\n[ ][ ]\n[ ]\nPartial Pressures\nIdeal Gas:\nB\nC\neq\no\no\nA\nB C\np p\nK\nP\np P\nA RT\nn\nP\npV\nnRT\nV\nRT\n=\n=\n=\n⇒\n=\n\nPo is the standard state pressure (1 atm), this makes the units cancel. Using partial\npressures is accurate within 10%, more error with liquids.\n\n,\n,\nA\nA initial\nA i\ni\nN\nN\nν\nξ\n=\n+∑\n\nStandard state\nExtent of rxn.\n,\n,\nrxn\nN\nC\nC initial\nC i\ni\ni\nN\nN\nν\nξ\n=\n=\n+∑\n\nP\nP\nP\nP\ncolumn\ncolumn\nvector\nvector\nmatrix vector\no\nN\nN\nν\nξ\n=\n+\ni\n\nDo columns span space? Often no, limits on what is achievable.\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 2\nProf. William H. Green\n\nPage 3 of 3\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n(\n)\n(\n)\nd\nN\nF N\ndt\n=\n\nFigure 2. A plot of the reaction trajectory. ξ is the extent of reaction.\nConservation Laws\n\nConserve atoms\n2CH\nO\nC H\n2H O\n+\n→\n+\n\nN N\nconstant moles\nconst.\nA\nA\nB\nB\nC\nC\nC\nN\nC N\nC N\n+\n+\n=\n\n,\n,\n:1\n: 4\nCH\nC H\nC initial\nCH\nC H\nH O\nH initial\nC\nN\nN\nN\nH\nN\nN\nN\nN\n×\n+ ×\n=\n×\n+ ×\n+\n=\n\nA g\nra\nph\ns\nhowin\ng the r\neacti\non\nprogress from reactants to products.\nReaction trajectory-\nPlot state of system"
    },
    {
      "category": "Lecture Notes",
      "title": "lec03_02142007_w.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/866a0818a4bf6240830298853b9e9985_lec03_02142007_w.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. K. Dane Wittrup\nLecture 3: Kinetics of Cell Growth and Enzymes\n\nThis lecture covers: cell growth kinetics, substrate uptake and product formation in\nmicrobial growth, enzyme kinetics, and the Michaelis-Menten rate form.\nBiological Rate Laws- Enzymes and Cell Growth\n\nRate Law: -\n=\nr\nf\nA\nA\n(C ,C\n\nB,CP,T, pH,...)\n\nWhy would you need a rate law?\n\n-Predictive description of a production process\n\n-Design tool for forming a desired product\n\n-Consistency or inconsistency with alternative mechanism\n\nFor a hypothesized mechanism, we can often derive an exact, closed form analytical\nsolution.\nIf not, it's used to approximate:\n-some reactions go rapidly to equilibrium\n-the concentrations of some species rapidly reach their steady state values\n-the rate-limiting step\nOr, as a last resort- numerical solution\nG\nra\nph\ns\nof\nz\ner\no,\nfirst, and second order\n\nr\ne\nac\nt\ni\no\nns. Zero order is\nh\no\nr\ni\nzo\nn\nt\na\nl whereas first and\nse\nc\no\nn\nd order are upward sloping.\nFigure 1. Rate versus concentration graphs for zero, first, and second order\nreactions.\nEnzymes-Biological Catalysts\nS=Substrate\nE=Enzyme\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\nGraph of energy ve\nrsus re\nac\nti\non progress for re\nactions with and\nwithout enzymes.\nFigure 2. An energy diagram for a reaction with and without an enzyme. The\nactivation energy is lower with an enzyme, so the reaction proceeds faster.\n\nGraph\no\nf the initial\n\nr\na\nt\ne\na\ns\nt\nh\ne\nslope of the concentration versus time curve when t = 0.\nFigure 3. The slope of the concentration versus time curve at time = 0 can give the\ninitial rate.\n\nGraph of Michaeli\ns-\nMe\nnte\nn\nki\nne\nti\ncs . Th e ki ne\ntics change\nfrom first\norder to zero ord\ner kinetics as substra\nte concentration increases.\n\nFigure 4. Michaelis-Menten kinetics.\n\nHypothesized Mechanism:\n-Encounter complex ES formed\n-Irreversible reaction occurs\n-Rapid release of product from complex\n-Assume rapid equilibrium is reached in the formation of ES\nIn more complex cases,\nthese are not always true\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 3\nProf. K. Dane Wittrup\n\nPage 2 of 6\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\nLater, Briggs-Haldane derived a law with steady state assumption for ES and they\ngot the same rate law as Michaelis-Menten. However, the Briggs-Haldane method is\nmore generally applicable.\n\ncat\nk\nk\nk\nE\nS\nES\nES\nE\nP\n-\n+\n⎯⎯→\n+\nZZZX\nYZZZ\n\nSteady state assumption on ES\nES\ndC\ndt\n→\n=\n\nMaterial Balance on ES:\nES\ndC\nk C C\nk C\nk C\ndt\n-\n(steady state)\nE\nS\nES\ncat\nES\n=\n+\nCE\nCES\n,\n(CE\nE\n0 -C S )CS -CES (k-1 + kcat)\nFree enzyme concentration =C\n\nE,0\nbecause C\nC\nE\nS\n,0\n\n,0\n\nC\nC\n≈\n\n=\n-\n-\n≈\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 3\nProf. K. Dane Wittrup\n\nPage 3 of 6\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\n,0\nE\nk\n=\nC\n,0\ns\nS\n\nSolve for CES (steady state solution)\n,0\n,0\nmax\nmax\n,0\nE\nS\nES\ncat\nS\np\ncat\nE\nS\nS\nS\np\ncat\nES\ncat\nm\nS\nS\ncat\nE\ncat\nm\nC\nC\nC\nk\nk\nC\nk\ndC\nk C\nC\nV\nC\nr\nr\nk C\nk\nk\ndt\nK\nC\nC\nk\nV\nk C\nk\nk\nK\nk\n-\n-\n-\n=\n+\n+\n-\n=\n=\n=\n=\n=\n+\n+\n+\n=\n=\n+\n=\n=\nmaximum reaction velocity\nMichaelis constant\n\nThis model fits the data:\n-As C\nK ,\nS\nm\n\nmax\nS\nS\nm\nV\nr\nC\nK\n-\n→\n\n-As C\nK , -\n→\n\nS\nm\n\nmax\nSr\nV\n\nGr\nap\nh o\nf\nMi\nch\nae\nli s- Me nt en\nkinetics. The rate bec\nomes zero order at\nhigh substrate concentration, because all of the enzyme is bound.\nFigure 5. Michaelis-Menten kinetics.\n\n-This rate law reappears in heterogeneous catalysis (Langmuir-Hinshelwood)\n-In the actual Michaelis-Menten derivation Kmax was an equilibrium constant\n-Briggs and Haldane showed that this rate law still works for steady state\n-Steady state approximation is more general\n\n-Steady state approximation is consistent with the data\n-Steady state is defined over a limited period of time. Because there is an\nirreversible step, eventually all of the intermediate will be consumed.\n-Equilibrium assumption is not exactly correct. The irreversible step prevents\ntrue equilibrium.\n\nGrowth Kinetics\nA population of single cells, growing without limitations\nN=#cells per volume\n,\ndN\nN\ndt\nμ\nμ\n=\n= constant, specific growth rate\nt\nN\nN eμ\n=\n-exponential growth while true, \"Malthusian growth\"\n\nGrowth Stops\n\n-Run out of nutrients\n\n-Accumulate toxic byproducts\nNutrient Effect on μ (Monod)\nmax\nS\nS\nS\nC\nK\nC\nμ\nμ =\n+\n\nThis expression is purely empirical (no mechanistic meaning). Even the fit is not that\ngood.\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 3\nProf. K. Dane Wittrup\n\nPage 4 of 6\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\ndN\nμmaxC\n=\nS N\ndt\nKS\nS\n+ C\n\ndCS\n-1\n=\nμN\ndt\nYx s\nWe will return to this when we\nlook at bioreactors\n\nG\nr\na\np\nh\n\no\nf\n\ng\nr\no\nw\nt\nh\nr\nat\ne versus concentration of inhibitor. The curve decreases from left to right.\n\nI=inhibitor or toxin\n(\n)\nμ ∝e-kCI\nμ ∝\n\n1-kCI\nk\nμ ∝\nI\nk\nC\nI\nI\n+\nAll forms fit the data\n\nFigure 6. Growth rate versus concentration of inhibitor. Many functional forms fit\nthe curve.\n\nG\nr\na\nph\no\nf\ngr\now\nth\nr\nat e ve rs us\nconcentration of growth limiting substrate. The curve increases then flattens out at high substrate concentration.\nCS=concentration of growth limiting\nsubstrate, often glucose\n\nFigure 7. Growth rate versus concentration of growth limiting substrate.\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 3\nProf. K. Dane Wittrup\n\nPage 5 of 6\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\nCell Growth as a Chemical Reaction\nAerobic growth:\n→\nCarbon source + O + Nitrogen Source\nBiomass + Byproducts + H O +CO\nCH1.8O0.5N0.2\n(for a typical microbial culture)\n\nA yield coefficient can be defined:\nA B\nA\nY\nB\nΔ\nΔ\n=\n\nA=biomass, byproducts, CO2, heat (any of these)\nB=carbon source or oxygen\n\nFor glucose,\n0.6\n0.1\nx s\nY\n≈\n±\ng biomass\ng glucose\n\nFor oxygen,\n1.9\n0.7\nx O\nY\n≈\n±\ng biomass\ng O\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 3\nProf. K. Dane Wittrup\n\nPage 6 of 6\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec04_02162007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/1b00a881d57ce733f0aa17b824e8ac38_lec04_02162007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 4: Reaction Mechanisms and Rate Laws\nFundamentals of Chemical Reactions\nPSSA (SS, QSSA, PSSH)\nlong chain approximation\nratelimiting step\nA+B\nStable molecules: neutral, closed shells\nTwo\nnucl\nei s\nhare ele\nctrons.\nOne nucleus attracts electrons in a filled set of orbitals.\nFigure 1. Stable molecules.\nPauli Exclusion Principle\nYou can't put 2 identical e in the same exact spot A nucleus attracts two electrons in an orbital. They have opposite spin.\nFigure 2. Two electrons in an orbital have opposite spin.\nBond Forming\nO\n\nh\nlef\nt, a\nn atom\nwith a\nf\nl\ne\nFigure 3. Bond formation. On the left, an empty orbital receives two electrons from\nanother orbital. On the right, halffilled orbitals on the H atom mix to form a filled\nbonding orbital with two electrons.\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nBoltzmann Distribution\n-E k T\nR\n( ) ∼\nB\np E\ne\nB\nk = N A\nE ≫ k T → very unlikely\nB\nE + E > E\nA\nB\nActivation\nBarrier\nA\nB\nSmall fraction will\ncollide correctly\nand react\n-E k T\na\nB\n( ) ∼\nk T\nAe\nA is the prefactor, proportional to the number of ways the molecules get together\nwith sufficient energy to react.\nReactive Intermediates\ncharged\nacid/base chemistry\nempty orbital\nmetal catalyst\nsingle e orbital\nfree radical\nExample:\nRC\nO\nOR + H2O ⇌ RC\nO\nOH + ROH\n(endo\nthermic)\nO\nk3\nk2\nk1\n+ ROH\n⇀\nRC\nOR →\n+ RO →\nOH + RC\nO\nOR ↽�\nk-1\nR\nO\nOH\nR\nO\nO\nOH\n(acid)\nminor\n(base catalyzed)\nspecies\nminor\n(SS)\nspecies\n(SS)\n+ H2O ⇌\n+ OH\nR\nO\nO\nR\nO\nOH\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 4\nProf. William H. Green\nPage 2 of 4\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nO\n\nO\nO\n\nd RC\nOR\n\nOH\n≈\n\nRC\nOR\n\n≈\nk1 OH\n\nRC\nOR\n\nOH\n\nk-1 + k2\ndt\nO\n\nk RC\nOR\n\nd [RO\n] ≈ 0\nRO ≈\n2 OH\n\ndt\nk3 [acid]\n\nrROH = k3 RO [acid] = k2\n\nRC\nO\nOR\n\n= k k\n1 2\nOH\n\nk-1 + k2\nRC\nO\nOR\nOH\n\nk eff\nRate Limiting Step\nOnly 1 rate constant of keff is really relevant\nWhat do you have most of in a reaction mix? This is the material preceding the rate\nlimiting step.\nRC\nO\nOR + H2O ⇌ RC\nO\nOH + ROH\nOH\nk\nk1\n⇀\n\n+ R+\nH+ + RC\nO\nOR ↽� RC\nOR\n2 →\nk-1\n+\nR\nO\nOH\n(acid)\nminor\n(acid catalyzed)\n(SS)\nspecies\n(SS)\n+\nk3\n+\nR + H O →ROH+H\nOH\nO\n\nd RC\n+\nOR\n\nOH\n\nk1 H+\n\nRC\nOR\n\n≈ 0\n\nRC\n+ OR\n\n≈\nk-1 + k2\ndt\nOH\n\nd [R\n+ ]\n+\nk2\n\nRC\n+\nOR\n\ndt\n≈ 0\nR ≈\nk [H O\n2 ]\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 4\nProf. William H. Green\nPage 3 of 4\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nOH\n\nk k\nO\n\n+\n+\nr\n= k R [H O ] = k\n\nROH\n\n2 RC\n+\nOR\n\n= k-1 + k2 H\nRC\nOR\nkeff\nEthylene\n(in plastics)\nC H → H +C H\nEthyl radical\nC H + Hi → H + C H i\nC H i → C H + Hi\n-r\n= k Hi C H\nC H\n1 [ 2\n6 ]\nslow\ni\nC H\ninefficient, but important (radical creation)\n→2CH\nCH i + C H → CH + C H i\n2C H i → C H + C H\n(radical destruction)\n(disproportionation)\nC H + C H → 2C H i reverse disproportionation also happens\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 4\nProf. William H. Green\nPage 4 of 4\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec05_02212007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/9289fe86a4778895a9584bb4fca5c5c2_lec05_02212007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 5: Continuous Stirred Tank Reactors (CSTRs)\n\nThis lecture covers: Reactions in a perfectly stirred tank. Steady State CSTR.\n\nContinuous Stirred Tank Reactors (CSTRs)\n\nA\nschematic\nof a batch reactor\nshow\ning reaction\nmixture and\nstirrer.\nSchema\nt\ni\nc\ns\n\no\nf\n\na\n\nplug flow rea\nctor (PFR)\nand a continuous stirred tank reactor (CSTR).\nIn terms of\nconversion, XA?\n\nMole Balance on Component A\nIn-Out+Production=Accumulation\nF\nF\n(steady state)\nAo -\n+\nA\nrAV = 0\n\nWhat volume do you need for a certain amount of conversion?\nF X\nV =\nAo\nA\n-rA\nwhere rA is evaluated at the reactor concentration. This is the same as the exit\nconcentration because the system is well mixed.\n\nFor a liquid phase with constant P:\nF\nC\n=\n(\n=volumetric flow rate)\nAo\nAov0\n0v\nF\nF\nAo -\nV\nF\n=\n=\nA\nA\nFAo -X AF\n\n-r\nAo\nA\nFigure 2. A batch reactor. Figure 1. A plug flow reactor, and continuous stirred\ntank reactor.\n\nF\nC\nA\nA\n=\nv\nV\nC\nX\n=\nAo\nA\nv\nr\n-A\nV\nτ =\n← average time a volume element of fluid stays in the reactor\nv0\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nAo\nA\nA\nC\nX\nr\nτ =\n-\n\nConsider: 1st Order Reaction Kinetics\nconcentration or conversion?\n\nA\nA\nr\nkC\n-\n=\n\nÆ convert rate law from CA to XA\n(\n)\nA\nAo\nA\nC\nC\nX\n=\n-\n\n(\n)\nA\nAo\nr\nkC\nX\n-\n=\n-\nA\n(\n)\n(\n)\nreactor size in terms of conversion and rate constant\n\nAo\nA\nA\nAo\nA\nA\nC\nX\nX\nkC\nX\nk\nX\nτ\n⎫⎪\n=\n=\n⎬\n-\n-\n⎪⎭\nÆ rearrange to find how much conversion for a given reactor size\nA\nk\nX\nk\nτ\nτ\n= +\n\naverage reactor residence time\n\nτ ≡\n\naverage time until reaction for a given molecule\n\nk ≡\n\nWe can now define a \"Damkohler number\"\nreaction rate\nis the reaction rate law at the feed conditions\nflow\n,\nAo\nAo\nAo\nr V\nDa\nr\nF\n-\n=\n=\n\nFor a liquid at constant pressure with 1st order kinetics:\n\nDa\nkτ\n=\n\nA\nDa\nX\nDa\n⇒\n= +\n\ntherefore:\nAs DaÆ, XAÆ1\nAs Dainf, XAÆ0 (molecule probably leaves before it can react)\n\nFor a liquid at constant pressure with 2nd order kinetics:\n(\n)\n2 1\nA\nA\nAo\nA\nr\nkC\nkC\nX\n-\n=\n=\n-\n\nAo\nAo\nA\nA\nC\nC\nX\nr\nτ =\n=\n-\nA\nAo\nX\nkC\n(\n)\n(\n)\nA\nA\nAo\nX\nX\nkC\nX\n=\n-\n-\nA\n\nsolving for conversion:\n(\n)\nAo\nAo\nA\nAo\nkC\nkC\nX\nkC\nτ\nτ\nτ\n+\n-\n+\n=\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #5\nProf. William H. Green\n\nPage 2 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nAo\nkC\nDa =\nAo\nV\nC\nAo\no\nkC\nv\nτ\n=\n\nThus, conversion can be put in terms of Da.\n(\n)\nA\nDa\nDa\nX\nDa\n+\n-\n+\n=\n\nHow long does it take for a CSTR to reach steady state?\nIn-Out+Production=Accumulation\nA\nAo\nA\nA\ndN\nF\nF\nr V\ndt\n-\n+\n=\n\nFor a liquid at constant density this is:\nA\nAo\nA\nA\ndC\nC\nC\nr\ndt\nτ\nτ\n-\n+\n=\n\nÆnon-dimensionalize\nˆ\nˆ\nA\nA\nAo\nC\nt\nC\nt\nC\nτ\n=\n=\n\nˆ\nˆ\nAo\nAo\nA\nAo\nA\nC\nC C\nkC C\nτ\nτ\n-\n-\n=\nAo\nC\nτ\nˆ\nˆ\nA\ndC\ndt\n\nP\nˆ\nˆ\nˆ\nDa\nA\nA\ndC\nk\nC\ndt\nτ\n⎛\n⎞\n+\n+\n=\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\n\n(\n)\nˆ\nˆ\nˆ\nA\nA\ndC\nDa C\ndt +\n+\n=\nwith initial conditions:\nˆ\nˆ\n0,\nA\nC\nt\n=\n=\n\nwe have the solution:\n(\n)\nˆ\n(1\n)\nˆ\nDa t\nA\nC\ne\nDa\n-\n+\n=\n-\n+\n\nIn nondimensional terms, it exponentially approaches a new steady state with a\ncharacteristic time 1\nDa\nτ\n+\n.\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #5\nProf. William H. Green\n\nPage 3 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nCo n\nc\ne\nn t\nr\na\nti\no\nn\n\nv\ner\ns\nus time graph for the product A. The concentration increases in time until the reactor reaches steady state.\nFigure 3. Approach to steady state in a continuous stirred tank reactor (CSTR).\n\nThe time at which 1⁄2 of the steady state concentration of CA is achieved is the h\ntime: ln(2) τ\n1+ Da\n\nCSTRs in Series\n(Liquid and at constant pressure)\n\nalf\nA\n\ns\nc\nh\ne\nm\na\nt\nic o\nf\ntwo\ntanks in series.\n\nFigure 4. Two tanks in series. The output of the first tank is the input of the second\ntank.\n1st order reaction kinetics\nC\nC\nA0\nA1 =\n\n1+ Da1\nFor the second reactorÆ iterate\n(\n)(\n)\nC\nC\nA0\nA2 =\n\n+\n+\nDa1\nDa\nIf the CSTRs are identical,\n(\n)\nC\nCAn =\nA0\n\n1+ Da\nn\nÆ many CSTRs in series looks like a plug flow reactor.\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #5\nProf. William H. Green\n\nPage 4 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\nA2"
    },
    {
      "category": "Lecture Notes",
      "title": "lec06_02232007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/f168896081c1e94749ab5226253b1a22_lec06_02232007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 6: Concentration that Optimizes a Desired Rate\n\nThis lecture covers: Selectivity vs. conversion and combining reactors with\nseparations.\n\nA\n\nsc\nhematic\nof a react\ning syst\nem. The\noutput of the re\nactor go\nes to a separator that separates reactants and products.\n\nFigure 1. Schematic of a reacting system with a recycle stream.\n\nconst. (vol.)\n\nSimple Target: maximize F\nr\n\np\np\n=\n⋅V\n\nr (concentrations, T)\np\n\nConstraint: T\nT\n≤\n\nmax\nHigh temperature Æ maximum rate constant\n\nSimplest Case:\nA →P\nr\nk\np = [A]\n[A\nA\n] ⇒[ ]\n\nfeed\n\nτ →0\nresidence\n\ntime in reaction\n\n[ ]\n[ ]\n[ ]\nV\nF\nP\np =\n=\nV0\nP τ\n\n(1-e-Da)\n=Vk A feed\nDa\nConstraint: [P\nP\n] ≥[ ]\n(purity constraint\n\nmin\n)\n\nÆ X ≥X\nconversion\nmin\n\nFp =\n-\nk T\n(\n)\nmax {[A]0\nm\n[P] i }V =\nn\nk T\n(\n)\nmax [A] feed V (1-X )\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nA+\n→\nB\nC\n\n2nd order\nr\nk\nc = 2 [A][B]\n\nA, B\n\nA\n\ns\nc\nh\nem at ic\no f a\n\nC\nSTR. A and B are iinputs. A, B, and C are outputs.\n\n[A] =\n-\n[A\nX\n] feed (1\nA)\n[B] =\n-\n[B\nX\n]\n\nfeed (1\nB)\n.1\n.1\nr\nk\nc =\n-\n(\n[A] feed [B] feed 1\nX )(1\nX\n\nA\n-\n)\n.01\n\nB\n\nA\n\ns\nc\nh\ne\nm\na\ntic o\nf\na\nre acti n\ng\n\ns\nystem wit\nh\na recyc\nl\ne\n\ns\ntream\n.\n\nFigure 2. Schematic\nof a CSTR.\n\nproduct may\nA →B\nalso react\nB →C\nA →U\n\nF\nf\nB = (\n)\n[A],\n,\n[B] [C],[U],τ,T\n\n6 variables\nÆ fsolve (Matlab)\n\nSS.\n0 =\n-\nF\nF\nin\nout + r V\n\nA\nA\nA\n0 =\n-\nF\nF\nin\nout + rBV\nB\nB\n0 = ...\n0 = ...\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #6\nProf. William H. Green\n\nPage 2 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\nundesirable\nFigure 3. A reacting system with\nrecycle stream.\n\nSimplest Case:\n\n[ ]\nk T\n( )\nA\nB\n→\nk\nT\nB →\n2 ( )\nC\nk\nT\nA\nU\n→\n3 ( )\nFA\nA =\nin\n\nV k\n(\n)\nk\n+\n+ τ\n[U\nk\n] =\n3[A]τ\n[C\nk\n] =\n2τ [B]\n[ ]\n[ ]\nk\nA\nB =\n\nk2 +τ\n\nN\n(\n)\nN\nN\nN\nF\nk\nAo\n1τ\nF\nT\nB τ,\n=\n(\nk\nk\nτ +\n+\nτ\nτ\n)(1+ k\n\n2 )\n\noptimize\nDa\n2 variables\nDa2\nDa\nÆ contour plot\n\nA\n\ns\na\nm\np\nl\ne contour plot\nshowing optimum combinations of the two variables.\n\nDon't use these - you may not find an actual optima.\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #6\nProf. William H. Green\n\nPage 3 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\nF\nYield ≡\nP\n\nFA0\nYieldA\nP\n→\n→\n≡X S\n\nA\nA\nP\n\nSelectivity\nF\n=\nP\n\n(\n)\nF\nF\nA\nA\n-\n∂\n∂\nF\nF\nB\nB\n=\n=\n0,\n∂\n∂\nT\nτ\n\nSA\nP\n→\nFigure 4. Sample contour plot for the 2-\noptimization.\nvariable\n\n(especially important when A is expensive)\n\nG\nr\na\np\nh\no\nf\n\ny\ni\ne\nl\nd versus residence time for a reaction A to P to U. The yield of P increases at first and then decreases as P is converted to U.\nFigure 5. Yield versus residence time. Intermediate P rises in\nconcentration and then falls off as it is converted to U.\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #6\nProf. William H. Green\n\nPage 4 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec06_correction.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/d0db6b13c38fab65783434f87bfac95f_lec06_correction.pdf",
      "content": "Consider the unconstrained optimization of a CSTR with volume V.\nA → B\nr = k[A]\nq [A]0\n[A] [B]\nV\nThe goal is to maximize FB with respect to changes in the volumetric flow rate, q.\nFB = q[B]\nSteady state material balances on species A and B give:\n0 = FA0 - FA - rV = q([A]0 - [A]) - kV[A]\n0 = FB0 - FB + rV = -q[B] + kV[A]\nHence,\n[B] = k[A](V / q)\nand\nFB = rV = k[A]V ;\nthus production of B is maximized when [A] takes its maximum value, which is [A]0.\nContinuing with the material balances, we find:\n[A] =\n[A]0\n= [A]0\n1+ (kV / q) 1+ kτ\nWhen Da = kτ << 1, [A] goes to [A]0.\nFB = rV = kV[A] = kV[A]o = kV[A]o\n1+ kτ\n1+ kV / q\no\nlim FB = lim⎜⎜⎛ kV[A]\n⎟⎟⎞ = kV[A]0\nq→inf\nq→inf⎝1+ kV / q ⎠\nUnfortunately, in the limiting case of infinite flow rate, the concentration of B in the\noutput solution is vanishingly small:\nlim[B] = lim(k[A](V / q)) = lim⎜⎜⎛ k\n[A]0\n(V / q)⎟\n⎞⎟ = 0 .\nq→inf\nq→inf\nq→inf⎝ 1+ (kV / q)\n⎠\nCite as: William Green, Jr., and K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec07_02282007_w.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/283b16fdf984efdf4e6f5ecccffac44a_lec07_02282007_w.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. K. Dane Wittrup\nLecture 7: Batch Reactors\n\nThis lecture covers batch reactor equations, reactor sizing for constant volume and\nvariable volume processes.\n\nBatch Reactors\n\nRun at non-steady state conditions\n\nWhich to choose? Batch vs. CSTR?\n\nSchem\natics of a batch reactor and a CSTR. The batch reactor is a tank with a stirrer. The CSTR is a tank with a stirrer as well as inflow and outflow streams.\n\nFigure 1. Schematics of a batch reactor and a\n\nCSTR.\n\nSmall Amount of Material\n(small quantities)\n(does not tie up\n\nequipment continuously)\n\nFlexibility\n+\n-\n\nExpensive Reactants\n+\n-\n\nIf product does not flow,\n+\n-\n\nMaterials Handling (e.g. Polymers)\n\nDo not have to shut down and\n-\n+\n\nclean, less down time\n\nCaptial costs? For size of reactor,\n+\n-\n\nfor given conversion\n(concentration stays\n\nhigher longer)\n\nOperability & Control (T, P, p4)\n-\n+\n\ne.g. Exothermic reaction\n\n(Manipulate only one\n\nsetpoint, steady state.\n\nYou can control additional\n\nvariables. Such as flow rates.)\n\nMaterial Balance\n\nIn - Out + Product = Accumulation\n0 0\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\ndN\nrA V =\nA\ndt\nConstant V,\ndC\nr\nA\nA =\n\ndt\nIn terms of conversion,\ndX\nC\nr\nA\nAo\n=\n\ndt\nA\nIntegrating, t\nCA dC\n= ∫\nA or\nCAo rA\nt\nC\nX A dX\n=\nA\nAo∫\n\nrA\n\n1st Order Reaction\nA ⎯k⎯→B\n\n-\n=\nr\nk\nA\nA\nA\nC = kC o(1-xA)\ndx\n∫\nxA\nA\n⎛\n⎞\nt\nC\n=\n⎯\nAo\n⎯→\n=\nt\nln\n\n⎜\n⎟\n-\n-\nkCAo(1\nxA)\nk\n⎝\n⎠\n1-xA\nxA = -\n1 e-kt\n\n90% conversion\n⎛\n⎞\n2.3\nt90.0% =\n=\nln⎜\n⎟\n\nk\nk\n⎝\n⎠\n1 0\n-.9\n\n(order of 1 )\nk\n\n2nd Order Reaction\nA+\n⎯\nA\nB\nk⎯→\n\n-\n=\nr\nk\nA\nA\nC\n= kCAo (1-X A)2\nt\nC\nX\nX\nA\nA\ndX A\nA\ndX\n=\n=\nAo∫\n∫\n\n-\n-\nkCAo (1\nX A)\n-kCAo\n(1-X A)2\n\nX\nt =\nA\n\nkCAo 1-X A\nkC\nX\nAot\nA =\n\n1+ kCAot\n\nIf k\nk\nfirstorder =\nsecond orderCA , which is faster?\no\n\n1st order\n0.63\n0.86\n0.95\n2nd\nx\norder\n0.50\n0.67\n0.75 } A\n\nFor a given Damkohler number, 1st order is faster. The second order reaction has\ngreater concentration dependence. Exponential approach (1st order) is faster.\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #\nProf. K. Dane Wittrup\n\nPage 2 of 5\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\nBatch Cycle\n\nTime\nt\nCharge\nDischarge\nrxn\nClean\n\nDowntime, t\nd\n\nHow long should t be?\nHow high should X be?\nA\nEconomic calculation:\nCompare economics of further conversion to a different use\nof equipment\nChemical consideration: Will product degrade? Assume product stable.\n\nProduct produced in one cycle = X C\nA\nAo V\n\nPr(Rate of Production)\nX C\nA\nAo V\n=\n\nt\nt\n+ d\nWhat value of t will maximize Pr?\nIf there is a maximum of Pr vs. t, d Pr = 0\ndt\nAssume t\nconstant.\nd =\ndX\n(\n)\nt\nt\nA\nd P\noptimum +\n-\nd\nX A\nV\n=\n=\nr\ndt\nC\n\ndt\nAo\n(\n)\nt\noptimum + td\ndX\n(\n)\nt\nt\nA\noptimum +\n-\nd\nX\ndt\nA = 0\n\nNow specify kinetics. There may be no optimum.\n\n1st order\nX\ne\n-kt\nA\ndX\n\nA = ke-kt\ndt\n(\n)\nt\nt\n-\n-\nktoptimum\nktoptimum\noptimum +\n-\n\nd ke\n(1-e\n) = 0\nCan numerically solve for t\n.\noptimum\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #\nProf. K. Dane Wittrup\n\nPage 3 of 5\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n= -\n\nSemi-batch Reactor\n\nSch\ne\nm\na\nt\ni\ncs of fed-batch reactors. In one case, the reactor has a feed into the reactor. In the other case, the reactor has a output stream.\n\nFigure 2. Schematics of two types of fed-batch reactors.\n1) Why?\n-\nTo remove \"poisonous\" product\n-\nMake room in reactor (expansion of product)\n-\nIf a reactant has a negative order effect on rate, add in small quantities\n-\nSelectivity\nA\nB\n+\n→Desired\n(control)\nA+ A →Byproduct\n\nStart with B, slowly feed A.\n\nA sch\ne\nm\nat\ni\nc of a f\ned\n-\nb\na\nt\nch reactor with a slow feed of reactant A.\nFigure 3. A fed-batch\nreactor with a slow feed of\none reactant.\n\n-\nTo shift equilibrium, strip off product\n-\nTo control evolution of heat\n-\nIn biological cases\nFed-batch\n- Feed in carbon source slowly to avoid overflow metabolism\n\n- (glucose)\n\n- O2 sparingly soluble, must feed.\n\n2) Balances\n\nA Balance\n\nSc\nhematic of a fed-batch reactor with a feed of reactant B.\nFigure 4. Fed-batch\nreactor with a feed of B.\n\nIn - Out + Product = Accumulation\n\nd r(\nV)\nr\nt\nV( )\nA\nA\n=\n\ndt\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #\nProf. K. Dane Wittrup\n\nPage 4 of 5\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY].\n\ndCA\nd V\nr\nt\nA\nA\nV( ) =\n+\nV\nC\n\ndt\ndt\n\nLiquid V\nV\n=\n+\n\n0v t\n\nflow\ndCA\nv\n=\n-\nr\nC\n\ndt\nA\nA\nV0\ndilution\n\nB Balance\n\ndCB\nv\nv\n=\n+\nr\nC\ndt\nB\nB\nV\nV\no -\nC\n\nB\n\n0N\nAddition\nDilution\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture #\nProf. K. Dane Wittrup\n\nPage 5 of 5\n\nCite as: K. Dane Wittrup, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec08_03022007_g.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/d4c77250b11a07b28ed55f826c83b376_lec08_03022007_g.pdf",
      "content": "10.37 Chemical and Biological Reaction Engineering, Spring 2007\nProf. William H. Green\nLecture 8: The Plug Flow Reactor\n\nr\nk[ ]\nA = -\nA\n\nX A\nA\nF\nr\no = -AV\n[ ] (\n)\nX F\nV\nA\nAo\n(2\nnd order reaction)\nCSTR =\n\nk A\n0 1-X A\n[ ] (\n)\nX\nt\nA\nreact. =\n\nk A 0 1-X A\nV\nA\nBatch (\n)\n[ ]\n=\n?\n[ ]\nmoles A\nV\nA\nF\nBatch\nAo =\n=\n\ntime\nt\nt\nreact + d\n[ ]\n[ ] (\n)\nF\n⎡\n⎤\n=\n+\nAo\nX\nV\nt\nA\n\nBatch\n⎢\n⎥\nA\nk\nd\n-\n⎢\n⎥\n⎣\n⎦\nA\nX A\nAssume XA=90%\nIf treact>td then\n[ ]\n[ ] (\n)\n2FAo ⋅0.9\nVBatch =\n\nA\nk\nA\n1-0.9\n[ ]\n[ ]\n0.9FAo\n1.8F\nV\nAo\nCSTR =\n≤\n\nk A\nk A\nThree tanks in series. The output of the first tank is the input of the second tank. The output of the second tank is the input of the third tank.\nFigure 1. Three tanks in series.\n[ ]\n[ ]\nV\nA\nA\n=\n+\nCSTR\nin\nr\n\nA v0\nIf r\nk\nA = -[A]\n[ ]\n[ ]\n[ ]\nA\nA\nA\n=\n=\nin\nin\n\nout\n1+ Da\nkV\n1+ v0\nIf n CSTRs are in series:\nV\neach volume =\n\nn\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\n[ ]\n[ ]\nA\nA\n=\nin\n\nout\n⎛\n⎞\nkV\nn\n1+ ⎜\n⎟\n⎝\n⎠\nnv0\n\nÆimproves productivity:\nconcentration of A in 1st one is higher than would be in one large CSTR\n\n[ ]\n[ ]\n-kV\nA\nA\nv0\nout\n=\n0 e\n\nBatch\nkV =\n⇒\n95% conversions\nv0\n[ ]\n[ ]\nA\nN\nX\nA out\n=\nA\n\nCSTR\nn\n.75\nseries\n⎛\n⎞\n⎜\n⎟\n1+\n⎝\n⎠\nn\n.93\n.948\n\nD\niagram of a pipe with flow from one end to another.\n\nFigure 2. Diagram of a plug flow reactor.\n\nPlug Flow Reactor (behaves like an infinite number of infinitely small CSTRs)\nF\nF\n(\n)\nCSTR\nAin -\n+\nAout\nrA ΔV =\n⎛\n⎞\nF\nF\nAin -\n⎜\n⎟\nAout\n= -r\n⎝\n⎠\nΔV\nA\ndFA = -r design equation for PFR\ndV\nA\ndFA = r C\n(\n)\nA\nB\n,C ,...\ndV\n\n= -kC\n(for example)\nA\nB\nC\nF\nC\nA\nA\n=\nv\ndFA\nFA\nB\nF\n= -k\n\ndV\nv0\n0v\nThis can be expressed as: dY = F t( ,Y ) where t is replaced by V.\ndt\nExample:\nA+ B\nC\nYZ\nZZZ\nk X\n\nkrevZZ\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 8\nProf. William H. Green\n\nPage 2 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nN\n⎛\n⎞\nkFA\nB\nF\nk\nF\n⎜\n⎟\n-\n+\nrev\nC\nv\nv\n⎛\n⎞\nF\n⎜\n⎟\nd\nA\n⎜\n⎟\n⎜\n⎟\nkFA\nB\nF\nk\nF\nF\n= -\n+\nrev\nC\n⎜\n⎟\nB\n⎜\n⎟\ndV\n⎜\n⎟\n⎜\n⎟\nv0\n0v\n⎝\n⎠\nFC\n⎜\n⎟\nkFA\nB\nF\nk\nF\n⎜\n⎟\n+\n-\nrev\nC\nY\n⎜\n⎟\n⎝\n⎠\nv\nv\n\nF t( ,Y )\n\nD\niagram of a pipe showing flow in the z direction.\n\nFigure 3. Diagram of a plug flow reactor showing flow in the z-direction.\n\ndV =\n⋅\narea dz\n\nMass flow rate is constant\n(v A\nρ ) = const.\nρ = ∑CW\ni\ni\nFor a liquid, dρ = 0\ndz\n(\n)\nd vρ A\ndv\ndA\ndρ\n=\n+\nρ\nρ\nA\nv\n+ Av\n= 0\ndz\ndz\ndz\ndz\nRearrange:\ndv\n⎛\n⎞\ndA\ndρ\n= -v⎜\n⎟\n+\n\ndz\n⎝\n⎠\nA dz\nρ dz\nFor a normal pipe dA = 0 and for a liquid\ndz\ndρ = 0\ndz\nTherefore: dv =\n⇒\nv\nv\n=\n\ndz\n(We can't assume this for gases!)\n\nFor a PFR:\ndFA = r\ndV\nA\nFA = v A\n[ ]\n(\n)\nd vCA = r\ndV\nA\nFor liquids, v is constant so we can take it out of the differential.\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 8\nProf. William H. Green\n\nPage 3 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nv\ndC\nr\nA , for liquids\nA =\n\narea dz\ndCA\narea\n=\nr\ndz\nv\nA\nInstead of treact we have zreact!\narea⋅length\ntpipe =\n\nv0\n[ ] (\n)\narea⋅z\nX\nt\nA\nPFR =\n=\n\nv\nk\nA 0 1-X A\n\nFlow is driven by the pressure drop across the pipe.\n\nD\niag\nram of a pipe showing pressure is greater upstream than downstream.\nFigure 4. Diagram of a pipe showing pressure upstream and downstream.\n\nPV = NRT\n∑\nP\nCi =\n\nRT\n\n⎫\nP\nF\nC\ni\n⎪ turns F's into concentrations\ni =\n⎬\nRT ∑\n\nFn ⎪\nn\n⎭\nρ = ∑CW ,\nis molecular weight of i.\ni\ni\nWi\n( )\n←const.\nmass flowrate\nv =\n\nρ z\n\n10.37 Chemical and Biological Reaction Engineering, Spring 2007\nLecture 8\nProf. William H. Green\n\nPage 4 of 4\n\nCite as: William Green, Jr., course materials for 10.37 Chemical and Biological Reaction Engineering,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "errata_p781.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/8b477edb3104c518603085f0888253f0_errata_p781.pdf",
      "content": "Error in Fogler: Superficial Velocity or Actual Velocity\nSee page 781 of the 4th edition for the external transport limited PBR derivation (no axial\ndiffusion or radial dispersion).\n\nFogler states that:\n,\nA\nA bulk\nc\nF\nC\nUA\n=\n\nwhere U is the superficial molar average velocity. This is defined as the velocity that the\nfluid would have if no catalyst were present. It can also be thought of as the velocity that\nwould be measured immediately upstream or downstream of the packed bed.\n\nThis equation is incorrect if you consider the units, there should be an additional factor of\nphi, the void volume, in it. The bulk concentration should be measured by taking a fluid\nsample, not measuring the total amount of a component per unit volume of the entire\nreactor.\n\n[ ]moles time\nA\nF =\n\n[ ]moles fluid volume\nreactor volume time\nA\nF =\n×\n\nThe correct relationship is:\n\n,\nA\nA bulk\nc\nF\nC\nUA\nφ\n=\n\n[ ]moles time[ ]moles fluid volume fluid volume reactor volume×reactor volume time\nA\nF =\n=\n×\n\nThis is important for converting from the flowrate to the concentration correctly in a\nPBR.\n\nIf you want to know the residence time in your PBR, the important velocity is the\nACTUAL average axial velocity of the fluid flowing in the void space, not the superficial\nvelocity. The reduction in reactor volume by incorporating catalyst causes the residence\ntime to be shorter than predictions using the superficial velocity. In cases where the fluid\nis water (constant volumetric flow rate):\n\nactual\nU\nV\nφ\n=\n\nactual\nLV\nτ =\n\nA similar mistake with the superficial velocity is made on page 843. A simple remedy is\nto replace U with Uφ in these equations.\n\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction\nEngineering, Spring 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute\nof Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "matlab_review.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-37-chemical-and-biological-reaction-engineering-spring-2007/553b0679342c8db13215140b04230d06_matlab_review.pdf",
      "content": "MATLAB REVIEW\nThe focus of this document is to review common, useful, higher-level Matlab operations\nthat will be employed on your assignments, such as: ordinary differential equation time\nintegrators (i.e. ode45 and ode15s, including event functions), curve fitting to a model,\nplotting options for x-y plots, and solving sets of nonlinear equations (fsolve). Additional\nexamples will be made available for future topics. None of these exercises are required\nwork, but are intended to be a great review and resource for future questions.\nTask 1: Time integration of ODE's\nTypically, a set of unsteady chemical engineering equations can be cast into the following\nform:\naccumulation = input - output + generation\nwhich leads to an unsteady set of equations of the form:\nr\ndf\nr\nwhere time is the independent variable, f is the (unknown) vector of dependent\nr g( f ,t)\n=\n,\ndt\nr\nvariable. Given an initial condition for each dependent variable, f0 , the equations can be\nr\nvariables, and g is the vector of functions giving the rate-of-change of each dependent\nr\nr\nintegrated in time to find f (t) . However, while an analytical expression may not be\navailable for the solution, a numerical integration technique can always find a solution to\nthis type of problem.\nOpen odesintegrate.m. This file solves for the concentrations of two chemical species in\na solution a batch reactor (perfect mixing, isothermal, constant volume) using Matlab's\node solvers. The system is:\nr1\nr 2\nA→ B →C\nr1 = k1[A]\nr2 = k2[B]\nand applying the general chemical engineering balance equation on the reactor, we find\nthat the ode's governing species are:\nd[A] = -k1[A]\ndt\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nd[B] = k [A] - k [B]\ndt\nd[C] = k2[B]\ndt\nSince [C] can be expressed in terms of [A] and [B] using mass balances, the third ode is\nredundant and need not be followed explicitly. Consider the following initial condition:\n[A0] = 1 M, [B0]=[C0] = 0 M. Through two reaction steps, the [A] is converted to [C].\nLook at the example file odesintegrate.m. In particular, look at the calling sequence of\nthe ode solver, which is generally:\n[t,f]=ode_solver(@derivative_function_name,[t0,tf],f0,options,param);\nwhere the ode solver can be ode45 or ode15s, for example. The returned values are a\ncolumn vector t of time steps, and a matrix f, where each column corresponds to a\nvariable.\nThe derivative function has the form:\ndfdt = derivative_function_name(t,f,param);\nBasically, you need to pick a solver, set the function that calculates the time derivatives\nr\ndf , set options (such as error tolerances), and pass additional necessary constants.\ndt\nOptions and param may each be [] when using default error tolerances and no additional\nconstants are needed in the derivative function. Note that only the current value of t\n(scalar) and the column vector of the current unknowns, f are passed to the derivative\nfunction.\nIMPORTANT: always use column vectors for dfdt and f. This is the format Matlab\nexpects and use of row vectors leads to errors that you will have to debug later.\nTry running each set in the EXAMPLE sequence of odesintegrate.m. (Type \"help\nodesintegrate\" at the Matlab prompt and run each set of parameters in sequence.) This\nexample sequence illustrates a difference between the performance of ode45 and ode15s.\nAs k1 is ramped up with a constant k2, the [A] eventually disappears \"instantaneously\"\nrelative to the rate of reaction of [B] into [C]. This essentially looks like [A0] =[C0]= 0\nand [B0] = 1 case. See Figure 1. Note that the number of time steps that the ode solver\nrequires to get an accurate result increases as k1 gets much larger than k2. Whenever a\nprocess has two or more vastly differing characteristic rates, the problem can be called\n\"stiff\".\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure 1. Top: [A0] = 1, [B0] = 0; Bottom: [A0] = 0, [B0]=1; Since k1 >> k2, these\ndynamic results are very similar when viewed over the timescale of decay of [B]. Results\nobtained with integrator ode45.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nWhile ode45 is a more accurate time integrator in general, and is a good overall tool,\node15s handles stiff problems much more quickly; ode15s has better stability properties\nand thus can take larger time steps. (This is because ode45 is explicit and ode15s is\nimplicit. If you would like to more about the inner workings of the time integrators, feel\nfree to ask.)\nProgramming Exercise 1:\nConsider the following pair of coupled linear odes:\ndt\nsubject to the following initial condition:\nr\nf0\nf1(t) 15exp( t)\nf 2(t)\nFeel free to use the structure of the example file, odesintegrate.m as a template to build\nfrom.\nf\nf\ndf1\ndt\ndf\nYour task is to solve this set of equations numerically in Matlab using ode45. Ensure you\nhave the correct solution by plotting your numerical expressions for f1 and f2 along with\nthe analytical expressions:\n⎡\n⎢⎣\n-\n5exp( 5t)\n-\n-\n=\n-\n10exp( 5t) .\n=\n⎤\n⎡\n⎤\n⎡\n⎤\n-\n⎡\n⎥⎦\n⎢⎣\n⎥⎦\n-\n⎢⎣\n=\n⎥\n⎥\n⎥\n⎢\n⎢\n⎢\n⎦\n⎣\n⎤\n⎥⎦\n=\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTask 2: Using events to terminate ode solvers early:\nA priori, you won't always know how long to run a time integration. Matlab incorporates\n\"event function\" functionality into the various ode solvers to allow for this capability.\nThe best way to understand how this works is to see an example. Look at\nlearntouseevents.m.\nA set of event functions is attatched to an ode solver with the following options:\noptions = odeset('Events',@eventfunctionname);\nEach event function in the set triggers an event when the function \"value\" returned is\nzero. The event function has the following format:\n[value,isterminal,direction] = eventfunctionname(t,f,param);\nThe event function takes the current value of time, the unknown vector f, and any\nadditional problem parameters and returns any number of event function values. Each of\nthe three returned variables, value, isterminal, and direction are column vectors with one\nentry per event function. For example, if you wanted to have a single event function\nterminate integration as soon as f(1) became zero, you would write the code:\nfunction [value,isterminal,direction] = eventfunctionname(t,f,param);\nvalue = f(1); %every zero in the value vector is an event\nisterminal = 1; %isterminal =1/0: stop/keep integrating\ndirection = 0; %0/+1 or -1: direction doesn't matter/does matter\nreturn;\nSee learntouseevents.m for a more sophisticated example of the use of event functions,\nincluding recovery of the log of events.\nProgramming exercise 2:\nUsing the same solver and code as exercise 1, add an event function that terminates\nintegration when f2 = 1.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTask 3: Plot Management\nTrying to put lots of things on the same graph can be a pain, so here is a summary of the\nfigure creation process.\nA plotting command replaces whatever is currently plotted on the active figure by\ndefault. A new figure can be created with the command:\nfigure;\nor\nfigure(n); (n is a positive integer, the figure number)\nIn the second case, the figure will always have the number n and if figure n exists it will\nbe replaced unless the hold is on (more on that later). Figure n becomes the \"active\nfigure\" on which all plot commands will be placed.\nX-Y plots are made by calling the plot command, which may take a variable number of\narguments:\nplot(x1,y1,formatstring1,x2,y2,formatstring2,x3,y3,formatstring3,...);\nSee Matlab documentation under \"LineSpec\" for examples of format strings (or \"help\nplot\"). If several data sets are given in a single plot call, Matlab automatically cycles\nthrough different colors. If you want to have separate plots in separate statements on the\nsame figure, the \"hold on\" command must be used, and formats SHOULD be explicitly\nspecified so you can tell which line is which. For example, try the following series of\ncommands (copy and paste):\nx = linspace(0,10,101); y1 = sin(x); y2 = cos(x);\nfigure(1); plot(x,y1); plot(x,y2);\nfigure(2); plot(x,y1); hold on; plot(x,y2); hold off;\nfigure(3); plot(x,y1,'ob'); hold on; plot(x,y2,'or'); hold off;\nfigure(4); plot(x,y1,x,y2);\nIn figure 1, the second plot command over-wrote the first. In figure 2, the second dataset\nplotted is by default the same color as the first; in figure 3, this is explicitly corrected and\nopen circles are used and no line is used. In figure 4, the Matlab defaults automatically\ncycle through colors. I recommend you explicitly give figure numbers, so that you don't\nhave to close your old figures when doing several runs in a row.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPlotting ranges can be set with the following options:\nxlim([xmin,xmax]);\nylim([ymin,ymax]);\nThe title can be specified with:\ntitle(titlestring);\nand the legend can be specified with:\nlegend(series1string,series2string...);\nor\nlegend({series1string,series2string,series3string...});\nAlso, a grid can be overlaid on the plot with\ngrid on;\nThis should cover most plotting needs you will have. Advanced options are available.\nLook up the Matlab \"help plot\" for details.\nProgramming exercise 3:\nUsing the results of exercise 1 or 2, plot f1 with red upward facing triangles (no line) and\nf2 with a blue dashed line (no symbol). Ensure the minimum x and y values on the plot\nare zero, and all the data are visible in the plotted range.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTask 4: Model fitting\nThe Matlab \"fit\" function is a versatile tool for fitting parameters to user-specified\nmodels. This example will show you how to fit some noisy data to a sine function.\nFirst, you need a noisy data set f(x) (a column vector);\nx = linspace(0,2*pi,101)';\nf = sin(x+0.1*randn(size(x)))+0.1*randn(size(x));\nplot(x,f);\nNext set the model type to be fit. The call:\nmodel=fittype('A*sin(B*x+C)+D','ind','x');\ndeclares a 4-parameter model based on the sine function and declares x to be the\nindependent variable. Next you should guess the parameters in the order they appear\nfrom left to right:\ninitial_guess=[1.00,1.00,0,0];\nNote that we guessed our values as those that you should get if there were no noise in the\ndata. Finishing up, call:\noptions=fitoptions(model);\nset(options,'StartPoint',initial_guess);\nfresult = fit(x,f,model,options);\nThe values of A, B, C, and D are stored in the struct fresult. The resulting parameters can\nbe viewed as a whole by typing:\nfresult\nand the two plots can be compared by using the model directly as if it were a function.\nTry typing:\nplot(x,f,x,fresult(x));\nIndividual parameters from the fit can be extracted with struct \"dot\" notation. For\nexample, to see parameter A type\nfresult.A\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProgramming Exercise 4:\nCollect and save the f1 output you get from exercise 1. Add some noise to it, using the\ncommand:\nf1 = f1 + (0.1*randn(size(f1)));\nFit a 4-parameter model to fit f1(t) = Aexp(Bt) + Cexp(Dt). Do you recover the\ncoefficients A, B, C, and D that you expect?\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTask 5: Solving Nonlinear Systems of Equations\nMatlab has the ability to solve nonlinear systems of equations using fsolve, where\nequations are of the form:\n0 = g r(x r) .\nThis could be interpreted as directly finding the steady state of the equation\nr\nr\ndf\nr\n= g( f ,t) .\ndt\nThe calling sequence of fsolve is very similar to the use of ode integrators. The main\ndifference is that instead of supplying a function to calculate the derivatives, you supply a\nfunction to calculate the right-hand-side of the equation, g. When g is not zero, this is\nalso called the residual.\nThe calling sequence and use of fsolve is\nx = fsolve(@gfun,x0,options,param);\nWhere x0 is the initial guess, param are additional constants needed by the g function,\nand gfun is the gfunction:\n[y,Jacobian] = gfun(x,param);\ngfun returns the value of each of the g(x) functions in y. When all the entries in the\ncolumn vector y are zero, the system is solved with the current iterate of x.\nThe Jacobian matrix is an expression that contains the rate of change of each of the g\nfunctions with respect to each of the parameters x (as in Newton iteration). Entries are\ngiven by:\nJ ij = ∂\n∂\nx\ng\nj\ni .\nThe Jacobian matrix is an optional returned value in gfun. In general, Matlab will use a\nnumerical approximation of the analytical Jacobian. The user specifically mentions that\nan specified analytical Jacobian will be given with the statement:\noptions = optimset('Jacobian','on');\nThe use of fsolve is demonstrated in the example file multiplefsolve.m. Given a perimeter\nand area, this function finds the length and width of an appropriate rectangle if one exists:\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ng1(L,W ) = 2L + 2W - P\nand\ng 2(L,W ) = LW - A,\nwhere L = length, W = width, P = perimeter, and A = area. Notice that the g functions\nmust be rearranged so that they are zero when satisfied by appropriate L and W.\nProgramming exercise 5:\nFollowing the example of multiplefsolve.m, make a program that finds the height and\nradius of a cylinder with a given area and volume. Multiple solutions may exist! Verify\nthat your program gives you R = 1 and H = 1 when Area = 4*pi and Volume = pi with an\nappropriate initial guess.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGood programming practices:\nUse meaningful names for variables. If you have a list of 10 different chemical species\nstored in x(1), x(2)...x(10), you shouldn't be using them in that form in your reaction\nequations. Consider renaming them as soon as you enter the function or declare\ndescriptive names equal to your integer indices, e.g.\nCl = 1;\nNa = 2;\nNaCl = 3;\nThen you can say:\nx(Cl)*x(Na);\nwhich is much easier to understand and debug than:\nx(1) * x(2);\nGo for simplicity and clarity before going for elegance. Colon notation is an effective\nway to make Matlab programs more compact, but for loops are much more intuitive. Use\nfor loops if colons give you trouble. Furthermore, in general, several simple steps are\neasier to understand than one long, complicated step.\nWatch out for the differences between matrix and element-wise operations. This\nleads to common mistakes. Most functions, such as sin() and exp() can accept a matrix of\nany size rather than a single value. They operate on each matrix element individually,\nreturning the sin() or exp() of each element, respectively. However, whenever you use\nthe operations (*,/) and the objects being multiplied/divided are vectors or matrices, be\nsure to know the difference between (*,/) and (.*,./). The first uses matrix multiplication\nand the second does element-wise operations, operating on corresponding entries. If this\ngives trouble, feel free to use for loops to operate on one value at a time.\nLearn to use the Matlab debugger. Programs usually fail on the first try. Matlab has a\nuseful debugger, where you can put breakpoints in the code, examine variable values\nduring execution, and even execute any additional operations from the command line\n(such as make plots). As an alternative to placing a breakpoint, the \"keyboard;\"\ncommand will do the same thing. To exit debug mode at the command line, type\n\"return;\". On the command line, \"who\" is a useful command that displays the names of\nall the variables that are known at this point in the code. Each one can be inspected or\noperated upon.\nUse semicolons. If semicolons are omitted at the end of a line, more output is sent to the\nscreen. In the case of large matrices, it can be a startlingly large amount.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nUse functions rather than scripts. A function takes input and gives output; this makes\nit easy to build a code as a group of working parts with well-defined interfaces. If a\nfunction can't change its input to mess up the calling program. A script works at the\nsame level as the regular Matlab prompt. In a script, all variables are effectively global,\nand thus from run to run things might change depending on what is stored in all current\nvalues of the variables. Also, if you run two different scripts, they could use the same\nvariable names and operations and results can get mixed up.\nCite as: David Adrian, course materials for 10.37 Chemical and Biological Reaction Engineering, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    }
  ]
}