{
  "course_name": "Chemistry Behind the Magic: Chemical Demonstrations for the Classroom",
  "course_description": "Chemistry Behind the Magic features videos of exciting live chemistry demonstrations. The videos are enhanced by explanations of the science behind the demonstration, in a fun and easy-to-understand format.\nThis set of videos showcases exciting live chemistry demonstrations held at MIT. Through the magic of chemistry, Dr. John Dolhun and Dr. Bassam Shakhashiri create things that steam, fizzle, and glow. Each video also provides a deeper look into the chemistry that makes it all possible.\nFor teachers, we have provided supporting materials to help you understand and replicate the experiments in your own classrooms. These videos can be watched in any order.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous. Among other things, the experiments should include the following safety measures: a high level of safety training, special facilities and equipment, the use of proper personal protective equipment, and supervision by appropriate individuals. You bear the sole responsibility, liability, and risk for the implementation of such safety procedures and measures. MIT and Dow shall have no responsibility, liability, or risk for the content or implementation of any of the material presented. Legal Notice",
  "topics": [
    "Science",
    "Chemistry",
    "Science",
    "Chemistry"
  ],
  "syllabus_content": "",
  "files": [
    {
      "category": "Resource",
      "title": "Bassam Shakhashiri Bio",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/bassam_bio.pdf",
      "content": "Bassam Z. Shakhashiri is the first holder of the William T. Evjue Distinguished Chair for the\nWisconsin Idea at UW-Madison. He is well known internationally for his effective leadership in\npromoting excellence in science education at all levels, and for his development and use of\ndemonstrations in the teaching of chemistry in classrooms as well as in less formal settings, such\nas museums, convention centers, shopping malls and retirement homes. The Encyclopedia\nBritannica sites him as the \"dean of lecture demonstrators in America.\" His scholarly\npublications, including the multi-volume series, Chemical Demonstrations: A Handbook for\nTeachers of Chemistry, are models of learning and instruction that have been translated into\nseveral languages. He is an advocate for policies to advance knowledge and to use science and\ntechnology to serve society. He promotes the exploration and establishment of links between\nscience, the arts and the humanities, and the elevation of discourse on significant societal issues\nrelated to science, religion, politics, the economy, and ethics. Professor Shakhashiri is the 2011\nPresident-Elect of the American Chemical Society, and will serve one-year terms as president in\n2012 and immediate past president in 2013.\nA native of (Anfe, El-Koura) Lebanon, Professor Shakhashiri is the son of the late Dr. Zekin A.\nShakhashiri, a pioneer in public health at the American University of Beirut, and the late Adma\nN. Shakhashiri, an alumna of what is now Lebanese American University. The Shakhashiris -\nfather, mother, son and two daughters, Amal and Maha -- came to the United States in 1957\nwhen Bassam was 17 years old with one year of college (at the American University of Beirut)\nbehind him. He completed undergraduate work at Boston University (Class of '60) with an A. B.\ndegree in chemistry, served as a teaching fellow at Bowdoin College for one academic year and\nthen earned M.Sc. and Ph.D. degrees in chemistry at the University of Maryland ('64 and '68,\nrespectively).\nAfter a year of post-doctoral research and two years as a junior member of the chemistry faculty\nat the University of Illinois-Urbana, Professor Shakhashiri joined the faculty of the UW-Madison\nin 1970, a position he still holds. In 1977 he became the founding chair of the UW System\nUndergraduate Teaching Improvement Council, now called the Office of Professional and\nInstructional Development. In 1983 he founded the Institute for Chemical Education (ICE) and\nserved as its first director. His work with ICE inspired the establishment of the Center for\nBiology Education, the Merck Institute for Science Education, the Miami University (of Ohio)\nCenter for Chemical Education, the Sacred Heart University SMART Center, and others. In 2002\nhe founded the Wisconsin Initiative for Science Literacy (WISL) and continues to serve as its\ndirector.\nFrom 1984 to 1990 Professor Shakhashiri served as Assistant Director of the National Science\nFoundation (NSF) for Science and Engineering Education. As the NSF chief education officer he\npresided over the rebuilding of all the NSF efforts in science and engineering education after\nthey had been essentially eliminated in the early 1980's. His leadership and effectiveness in\ndeveloping and implementing national programs in science and engineering education have\nhelped set the annual NSF education budget at its current level of over $900 million. His NSF\nstrategic plan launched the systemic initiatives and most of the other NSF education programs of\nthe last two decades.\n\nProfessor Shakhashiri has given over 1300 invited lectures and presentations in North America,\nEurope, Asia, Australia, the Middle East and South America. He has been featured in\nnewspapers, magazines, national and local radio and television; these include the New York\nTimes, Washington Post, Newsweek, Time, the German-language Business Week, NBC Nightly\nNews, National Public Radio, CNN, and the Larry King show. He appears as a regular guest on\nthe Ideas Network of Wisconsin Public Radio.\nProfessor Shakhashiri is the recipient of over 35 awards, including Outstanding Lecturer of the\nYear in General Chemistry, University of Illinois (1969 and 1970), the 1977 Kiekhofer\nDistinguished Teaching Award from UW-Madison, and the 1979 Manufacturing Chemists\nAssociation Catalyst Award. He is the youngest recipient of two of the American Chemical\nSociety's (ACS) most coveted recognitions -- the James Flack Norris Award for Outstanding\nAchievement in the Teaching of Chemistry (1983) and the ACS George Pimentel Award in\nChemical Education (1986); he has been a member of the ACS since 1962. In 1982 he was given\nthe Ron Gibbs Award of the Wisconsin Society of Science Teachers for \"outstanding\ncontributions to science education at the local, regional, national, and international levels.\" In\n1987, he was cited for distinguished public service by the District of Columbia Science\nEducation Association, the National Science Teachers Association, the South Carolina Academy\nof Science, and the Boston University General Alumni Association.\nHe received the 2002 American Association for the Advancement of Science (AAAS) Award for\nPublic Understanding of Science and Technology, \"for his tireless efforts to communicate\nscience to the general public, and especially children.\" In 2004 he was inducted into the Hall of\nFame of the national chemistry fraternity Alpha Chi Sigma. In 2005 he received the Madison\nMetropolitan School District Distinguished Service Award for a Citizen, the Chemical Pioneer\nAward from the American Institute of Chemists, the ACS Helen M. Free Award for Public\nOutreach for \"lifelong accomplishments and for explaining and demonstrating science with\ncharisma and passion,\" and was cited in the Answer Book of Capital Newspapers as the \"coolest\nUW professor.\" In 2006 he received the Rotary Senior Service Award from the Rotary Club of\nMadison. In 2007 he received the National Science Board Public Service Award and was cited\nfor \"extraordinary contributions to promote science literacy and cultivate the intellectual and\nemotional links between science and the arts for the public.\" In 2008 he received the inaugural\nEmerson Science Advocacy Medal from the University of Nevada-Las Vegas and was cited for\n\"distinguished, sustained, and lasting contributions in the development of the sciences.\"\nProfessor Shakhashiri is an elected fellow of the South Carolina Academy of Science, the\nAlabama Academy of Science, the New York Academy of Science, and the Wisconsin Academy\nof Sciences, Arts and Letters. He is the recipient of honorary doctoral degrees from George\nWashington University, Illinois State University, Ripon College, University of Colorado, Grand\nValley State University, University of South Carolina and Lebanese American University. He is\na national and international consultant to government agencies, academic institutions, industry,\nand private foundations on policy and practice matters related to science and to education at all\nlevels.\n\nProfessor Shakhashiri and his wife June live in Madison. Their daughter Elizabeth is a 2007\nalumna of UW-Madison, and received her law degree from the University of Michigan Law\nSchool in Ann Arbor in 2010; she currently practices law in Chicago.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Chemiluminescence: What's Inside a Light Stick Anyway?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/glowstick.pdf",
      "content": "Chemiluminescence\nWhat's inside of a light stick anyway?\nPhoto taken at MIT 150th Celebration Open House Under the Dome April 30, 2011\nAbstract\nThree plastic cups containing solutions are poured simultaneously into three other\nplastic cups containing solutions and chemical reactions occur producing different\ncolors in each of the cups that glow in the dark.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\nCourtesy of Nathan Sanders. Used with permission.\n\nMaterials\n\n5 red light sticks\n\nscissors\n5 green light sticks\n\nknife\n5 blue light sticks\n\ngloves\n6 plastic cups\n\ngoggles\n\nSafety\n\nWear gloves and safety goggles when handling the chemicals in a light stick. H2O2 is\na strong oxidizing agent that can cause burns. The fluorescent dyes should be\nconsidered toxic and not be ingested. Caution! Never ever try to open a glow stick\nup with your mouth. When opening a glow stick and breaking the glass vial inside\nmake sure you wear safety goggles to prevent shards of glass or chemicals from\nreaching the eye.\n\nProcedure\n\nCreate two solutions from each of the three colors of light sticks as follows:\n\nSolution 1:\n\nUsing a knife cut the top off the plastic light sticks and carefully pour out the\nsolutions into plastic cups. Pour all the red light stick solutions into the same cup\nand so on for the blue and green. Carefully remove the inner glass vials and reserve\nfor Solution 2.\n\nSolution 2:\n\nUsing a pair of scissors snip open the glass vials that you removed from the opened\nlight sticks and pour those solutions into the other three cups.\n\nGet three volunteers to come up give each one-cup containing solution 1 and one\ncup containing solution 2. The solutions are then poured together resulting in a\nchemical reaction resulting in different colors of light that glow in the dark.\n\nDiscussion\n\nThis is a classic reaction where energy is released in the form of light without heat.\nIn Chemiluminescence, two molecules react together to create a third excited\nintermediate molecule. This molecule finally relaxes back to the ground state with\n\nthe release of a photon of light at a frequency, which we can see in the visible range\nof the electromagnetic spectrum. A general scheme for Chemiluminescence is shown\nbelow:\n\nIn our case, each light stick contains three chemicals. The chemical in the inner glass\nvial Solution 2 is H2O2. The chemicals inside of the plastic light stick that were\npoured out into Solution 1 consists of Cyalume a Phenyl Oxalate Ester plus a\nfluorescent dye molecule. When the H2O2 in Solution 2 is poured into Solution 1 a\nchemical reaction occurs that produces energy. The energy produced is transferred\nto the dye molecule, which gets excited and converts the energy into light.\nDepending on what type of dye is present you will get different colors of light given\noff.\n\nThe general reaction scheme for the reaction inside of a light stick is shown below:\n\nWhen the two solutions are mixed the hydrogen peroxide oxidizes the phenyl\noxalate ester, which produces phenol plus an unstable compound called 1,2-\ndioxetanedione. This unstable ester breaks apart releasing energy and CO2. The\nenergy gets transferred to the dye molecule causing the electrons to jump to higher\nlevels, when they relax and fall back down, energy is released in the form of light.\n\nDisposal\n\nThe contents of the reaction and any leftover solutions should be combined into a\nproperly labeled waste bottle and disposed of properly in labeled waste containers.\n\nReferences\n\nMichael M. Rauhut, Acc. Chem. Res. 1969, 2(3), pp. 80-87.\n\nElizabeth Wilson, Chemical and Engineering News, 1999, 77(3), p 65.\n\nEdwin A Chandross, Tetrahedron Letters 1963, 4(12) pp. 761-765.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Communicating Science via Demonstrations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/communicating_sci.pdf",
      "content": "Communicating Science\nvia Demonstrations\nBassam Z. Shakhashiri\nScience is one of the most important forces affecting human society. The differences between\nthe way we live now, at the dawn of the twenty-first century, and the way our ancestors lived,\nsay, two hundred years ago, are due mostly to science and its resultant technologies. It is\nimpossible to understand contemporary society without some appreciation for science, how\nit works, and what it tells us about the physical world. Science is fundamentally a human\nendeavor, driven by the same impulses that motivate much of human activity: curiosity\nabout the unknown, the thrill of discovery, delight in creativity, and the benefits derived\nfrom understanding. Fundamental, too, is the desire to share the curiosity, thrill, delight,\nand benefits. This desire to share is perhaps most acutely displayed by science teachers,\nwhose deepest desire is to effectively communicate the beauty of science, both in and out of\nthe classroom. One of the most effective means of communicating this beauty, of stimulat\ning curiosity, and of sharing the thrill of discovery in science is through demonstrations of\nphysical phenomena. Through my experience in presenting demonstrations, I have come to\nappreciate that there are characteristics common to effective demonstrations, and I wish to\nshare some of these with you in what follows.\nCLARITY OF PURPOSE\nTo assure that a demonstration communicates effectively, a teacher must have a clear idea\nabout the purpose(s) and value of presenting the demonstration. This means knowing what\nthe demonstration is about, why it is to be used, how it should be presented, and where and\nwhen it will be presented. The purposes might include displaying phenomena, illustrating\nprinciples, conveying attitude, sparking interest, nurturing curiosity, making connections,\nand so on. Engaging people of all ages through the senses in carefully crafted and well-\norchestrated scientific adventures is my penultimate purpose. My ultimate purpose is to\ntrigger cerebral and emotional discourse within the individual and among individuals to\nheighten the joy of learning.\nBefore selecting a demonstration, I always ask myself, What is the point? My purposes\nfor using demonstrations in the classroom and in other public settings generally include dis\nplaying science phenomena and illustrating scientific principles. However, even more impor\ntantly, demonstrations convey the presenter's attitude toward science as a human endeavor,\nand in turn, learners' attitudes can be influenced by teachers doing experiments in classroom\nsettings. Chemistry demonstrations help focus students' attention on chemical behavior and\nproperties, and they increase students' awareness and knowledge of chemistry. The direct\nobservation of a phenomenon as provided in a demonstration can stimulate the observer\nto develop an immediate concept of the phenomenon. A demonstration can also transform\nan abstract concept from the theoretical and imagined to the observed and real. Sometimes\ndemonstrations are presented solely for the entertainment value of fire, smoke, and noise.\nHowever, to approach demonstrations simply as a chance to show off dramatic chemical\nxxi\n\nxxii\nCommunicating Science via Demonstrations\nchanges or to entertain students is to fail to appreciate the opportunities they provide to\ncommunicate scientific concepts and to acquire knowledge of the properties of chemicals.\nThe demonstration should be a process, not a single event. The instructional purposes\nof a presentation dictate whether a phenomenon is demonstrated or whether a concept is\ndeveloped and built by a series of experiments. In demonstrations, the teacher's knowledge\nof the behavior and properties of the chemical systems is key to successful instruction, and\nthe way in which the teacher safely manipulates the chemical system serves as a model not\nonly of technique but also of attitude. Demonstrations can involve student participation\nthrough responses to questions and suggestions, such as What will happen if you add more\nof . . . ? Even in a demonstration where the teacher directs the flow of events, the teacher can\nask the same sort of \"what if\" questions and can proceed with further manipulation of the\nchemical system. In principle and in practice, every demonstration is a situation in which\nteachers convey their attitudes about the experimental basis of chemistry, motivate their\nstudents to conduct further experimentation, and lead them to understand the interplay\nbetween theory and experiment.\nDemonstrations should not, of course, be considered a substitute for laboratory experi\nments. In the laboratory, students can work directly and at their own pace with the chemicals\nand equipment and make their own observations and discoveries. In the classroom, students\nwitness chemical changes and chemical systems as manipulated by the teacher. The teacher\ncontrols the pace and explains the purposes of each step. Both kinds of instruction are inte\ngral parts of the education we offer students.\nA HIERARCHY OF TEACHING AND LEARNING CHEMISTRY\nIn teaching and in learning chemistry, teachers and students engage in a complex series of\nintellectual activities. These activities can be arranged in a hierarchy that indicates their\nincreasing complexity [1]:\n(1)\nobserving phenomena and learning facts\n(2)\nunderstanding models and theories\n(3)\ndeveloping reasoning skills\n(4)\nexamining chemical epistemology.\nThis hierarchy provides a framework for including demonstrations in the teaching of\nchemistry.\nAt the first level, we observe chemical phenomena and learn chemical facts. For exam\nple, we can observe that at room temperature sodium chloride is a white solid composed of\ncube-shaped crystals. It dissolves in water to form a solution with different characteristic\nproperties of its own. One such property, electrical conductivity, can be readily observed\nwhen two wire electrodes connected to a light bulb and a source of current are dipped\nfirst into a sample of the sodium chloride crystals and then into the solution. Additional\nphenomena and facts can be introduced: the white solid has a very high melting point, the\nsubstance is insoluble in hexane, its chemical formula is NaCl, etc.\nAt the second level, we explain observations and facts in terms of models and theories.\nFor example, we teach that NaCl is an ionic, solid compound and that its aqueous solu\ntion contains mobile, hydrated ions: sodium cations, Na+(aq); and chloride anions, Cl-(aq).\nThe mobility accounts for the electrical conductivity of the solution. The solid, which con\nsists of Na+ and Cl- particles, is said to have ionic bonds; that is, there are electrostatic\nforces between the oppositely charged particles. The ions are fixed in place and arranged\nthroughout the solid in a regular three-dimensional array called a face-centered cube, an\narrangement that explains the cubical shape of the crystals. Here, the teacher can introduce\na discussion of the ionic-bond model, bond energy, and bond distances. Similarly, a descrip\ntion of water as a molecular, covalent substance can be presented. The ionic- and covalent\n\nBassam Z. Shakhashiri\nxxiii\nbonding models can be compared and used to explain the observed properties demonstrated\nby a variety of compounds.\nAt the third level, we develop skills that involve both mathematical tools and logic.\nFor example, we use equilibrium calculations in devising steps in a scheme for separating\nsubstances in aqueous solution. In these calculations, we combine the solubility-product,\nweak-acid dissociation, and complex-ion formation constants for competing equilibria in\nanalyzing the behavior of a mixture of ions. The logical sequence of steps in the separation\nscheme is based on an understanding of the equilibrium aspects of solubility phenomena.\nAt the fourth level, we are concerned with chemical epistemology. We examine the basis\nof our chemical knowledge by asking questions such as, How do we know that the cation of\nsodium is monovalent rather than divalent? and How do we know that the crystal structure\nof sodium chloride can be determined from x-ray data? At this level we deal with the limits\nand validity of our fundamental chemical knowledge.\nAcross all four levels, the attitudes and motivations of both the teacher and the student\nare crucial. The attitude of the teacher is central to the success of interactions with students.\nOur motivation to teach is reflected in what we do and in what we do not do, both in and\nout of the classroom. Our modes of communicating with students affect their motivation\nto learn. All aspects of our behavior influence students' confidence and their trust in what\nwe say. Our own attitudes toward chemicals and toward chemistry itself are reflected in\nsuch matters as how we handle chemicals, adhere to safety regulations, approach chemical\nproblems, and explain and illustrate chemical principles. As I said at the outset, the most\nimportant purpose that lectures and demonstrations serve is to give teachers the opportu\nnity to convey an attitude toward chemistry--to communicate to students an appreciation\nof chemistry and its usefulness, its cohesiveness, its value as the central science and as the\nscience of the familiar, and its intellectual excitement and challenges.\nPRESENTING EFFECTIVE DEMONSTRATIONS\nIn planning to use a demonstration, I always begin by analyzing the reasons for presenting\nit. Whether a demonstration is spectacular or quite ordinary, I undertake to use the chemi\ncal system to achieve specific teaching goals. I determine what I am going to say about the\ndemonstration and at what stage I should say it. Prior to the lecture, I practice doing the\ndemonstration. By doing the demonstration in advance, I often see aspects of the chemistry\nthat help me formulate both statements and questions that I will use in class.\nBecause one of the purposes of demonstrations is to increase the students' ability to\nmake observations, I try to avoid making statements like \"Now I will demonstrate the insol\nubility of barium sulfate by mixing equal volumes of 0.1 M barium chloride and 0.1 M\nsodium sulfate solutions.\" Instead, I say, \"Let us mix equal volumes of 0.1 M barium chlo\nride and 0.1 M sodium sulfate solutions and observe what happens.\" Rather than announc\ning what should happen, I emphasize the importance of observing all changes. Often, I ask\ntwo or three students to state their observations to the entire class before I proceed with fur\nther manipulations. Occasionally pausing to point out an interesting observation or to pose\na focusing question can increase student involvement by allowing them the opportunity to\ncontribute to an explanation. In addition, I help students to sort out observations so that\nrelevant ones can be used in formulating conclusions about the chemical system. Some valid\nobservations may not be relevant to the main purpose of the demonstration. For example,\nwhen the above-mentioned solutions are mixed, students may observe that the volumes are\nadditive. However, this observation is not germane to the main purpose of the demonstra\ntion, which is to show the insolubility of barium sulfate. However, this observation is rel\nevant if the purposes include teaching about the additive properties of liquids.\nEvery demonstration that I present anywhere is aimed at enhancing the understanding\nof chemical behavior. The chemistry always speaks for itself more eloquently than anything\n\nxxiv\nCommunicating Science via Demonstrations\nI can describe in words, write on a chalkboard, or show electronically on a screen. Mod\nern technology now enables us to show an avalanche of text, a multitude of photos, and\nsimulations of almost anything. The Internet provides access to mountains of information\nof widely varying validity. When technology or the Internet is used in an instructional pro\ngram, the purpose for its use must be clear, and it should be the best way to achieve the pur\npose. Their convenience makes them attractive, but descriptions, photos, and simulations of\nphenomena are never as striking as the real thing.\nIn addition to following the advice given by Richard Ramette in his essay \"Exocharmic\nReactions\" [2], here is a sampling of what to keep in mind when using demonstrations:\n(1) Be clear about the purpose(s) for doing the demonstration. What is the point you\nwish to make?\n(2) Plan and base your classroom lectures on one or several carefully selected dem\nonstrations.\n(3) Study the details of the procedures to be followed, and practice more than once\nwhat you will be doing. Remember that you are presenting yourself as a skilled\nprofessional who clearly understands the science involved in the demonstrations.\n(4) Make sure to allow enough time for the demonstration. Be deliberate and do not\nappear rushed.\n(5) Prepare an outline or, even better, a \"mini-script\" to help your pacing.\n(6) Be confident in your presentation and always show enthusiasm.\n(7) Keep the area of the demonstration clean and clear. Ask the audience to focus\ntheir attention on the area of your work.\n(8) Be sure to stage your demonstration so everything is visible to your audience.\nPlace an elevated platform above the table to improve visibility. Use a white\ntable cover and white backgrounds for color changes. Use black backgrounds\nfor white or cloudy phenomena and light emission. Scale the demonstration to\nfit the size of the audience, or if this is not feasible, use audio-visual devices as\nappropriate (see page xxxiii for information about such devices).\n(9) Practice, practice, practice!\n(10) Demonstrations never \"fail.\" A result may be unexpected or unanticipated by\nyou, but this should be welcomed as an opportunity and a teachable moment,\nespecially because it allows you to demonstrate the skill of analyzing a phenom\nenon that may be as puzzling for you as for your audience. Be prepared to try to\nexplain whatever happens, but if you are not sure, admit the limits of your un\nderstanding. Tell the class that you will try to resolve the problem and will share\nwhat you learn and try again during the next class meeting.\nGood teachers entice others to make connections between new observations and what\nthey already know. Good teachers also encourage observers to share their observations.\nIn the process, teachers often gain deeper insight into and appreciation of the science and\nbeauty of a demonstration. The requirements for an effective demonstration go beyond\nthe mere mechanics of mixing chemicals and manipulating equipment. In addition to the\nskillful handling of materials, an engaging stage presence is also essential to successful dem\nonstrations and thus is conducive to better learning. Teaching is, I believe, the ultimate\nperforming art.\nUSING THIS BOOK\nThis volume contains a single chapter entitled \"Color, Light, Vision, Perception.\" A sub\nstantial introduction addresses the science background for the demonstrations that follow.\nThe demonstrations are grouped into sections that deal with the production of light, the\nproperties of light, perception and vision, photoemission (fluorescence and phosphores\ncence), and photochemistry. Each demonstration includes its own discussion, which employs\n\nBassam Z. Shakhashiri\nxxv\nterminology and concepts that are placed in broader context in the introduction. Accord\ningly, when teachers read the discussion section of any particular demonstration, they may\nfind it helpful to refer to the introduction for background information. For additional infor\nmation teachers may wish to consult other sources, including the references provided with\nthe demonstrations.\nEach demonstration has seven sections: a brief summary, a materials list, a step-by-step\naccount of the procedure to be used, an explanation of the hazards involved, information\non how to store or dispose of the chemicals used, a discussion of the phenomena displayed\nand principles illustrated by the demonstration, and a list of references. The brief summary\nprovides a possible rationale for using the demonstration as well as a succinct description\nof the demonstration. The materials list for each procedure specifies the equipment and\nchemicals needed. Where solutions are to be used, the directions sometimes call for prepar\ning stock amounts larger than those required for the procedure. The teacher should decide\nhow much of each solution to prepare for use in practicing the demonstration and for the\nactual presentation. The availability and cost of chemicals may also affect decisions about\nthe volumes to be prepared.\nThe procedure section often contains more than one method for presenting a demon\nstration. The alternative procedures sometimes offer different methods for displaying the\nsame phenomenon, and in some cases they may demonstrate additional properties of the\nsystem of interest.\nThe hazards and disposal sections include information compiled from sources believed\nto be reliable. We have enumerated many potentially adverse health effects and have called\nattention to the fact that many of the chemicals should be used only in well-ventilated areas.\nIn all instances teachers should inquire about and follow local disposal practices and should\nact responsibly in handling potentially hazardous material.\nThe purpose of the discussion section is to provide the teacher with information for\nexplaining each demonstration. We include the discussion of chemical equations, relevant\ndata, and properties of the materials involved, as well as a theoretical framework for under\nstanding the phenomena demonstrated. Again, we remind teachers that they should refer to\nthe chapter introduction for additional background information. Finally, each demonstra\ntion contains a list of references used in developing the procedures and providing informa\ntion for the demonstration.\nA WORD ABOUT SAFETY\nJearl Walker, who was a professor of physics at Cleveland State University and editor of the\nAmateur Scientist section in Scientific American, has been quoted as saying, \"The way to\ncapture a student's attention is with a demonstration where there is a possibility the teacher\nmay die.\" Walker is said to have caught the attention of his students by dipping his hand in\nmolten lead, by gulping a mouthful of liquid nitrogen, or by lying between two beds of nails\nand having an assistant with a sledgehammer break a cinder block on top of him. Walker\nreportedly has been injured twice, once when he used a small brick instead of a cinder block\nin the bed-of-nails demonstration and once when he walked on hot coals and was severely\nburned.\nI disagree strongly with this kind of approach. Chemical demonstrations that result in\ninjury are likely to confirm beliefs that chemicals are dangerous and that their effects are\nbad. In fact, every chemical is potentially harmful if not handled properly. That is why every\nperson who does science demonstrations should be thoroughly knowledgeable about the\nsafe handling of all chemicals used in a demonstration and should be prepared to handle\nany emergency. A first-aid kit, a fire extinguisher, a safety shower, and a telephone must be\naccessible in the immediate vicinity of the demonstration area.\nDemonstrations involving volatile material, fumes, noxious gases, or smoke should be\nrehearsed and presented only in well-ventilated areas. Local procedures and ordinances for\n\nxxvi\nCommunicating Science via Demonstrations\nthe disposal and storage of chemicals and equipment must be strictly followed. Wearing\neye protection is mandatory everywhere, and shielding an audience from potential hazards,\nsuch as flying sparks, noxious fumes, ear-piercing sounds, etc., should be part of careful\nplanning. Several of the demonstrations in this book can be hazardous. The procedures are\nwritten for experienced chemists, who fully understand the properties of the chemicals and\nthe nature of their behavior. The authors take no responsibility or liability for the use of any\nchemical or procedure specified in this book.\nI urge care and caution in handling chemicals and equipment. Remember to have clarity\nof purpose for every demonstration by answering the question What is the point?\nREFERENCES\n1. I have adapted many ideas from Paul Saltman's address at the Third Biennial Confer\nence on Chemical Education, which was sponsored by the American Chemical Society,\nDivision of Chemical Education, and held at Pennsylvania State University, State Col\nlege, Pennsylvania (1974); see J. Chem. Educ., 52, 25 (1975).\n2. R. W. Ramette, \"Exocharmic Reactions,\" in B. Z. Shakhashiri, Chemical Demonstra\ntions, vol. 1, pp. xiii-xvi, University of Wisconsin Press: Madison (1983).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Midas' Magic",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/midas.pdf",
      "content": "Midas' Magic\nAbstract\nTwo clear colorless solutions are mixed together resulting in the formation of a\nthick yellow precipitate.\nMaterials\nLead Nitrate Pb(NO3)2\nPotassium Iodide KI\n1000 mL beaker\n2- 500 mL containers\nglass stir rod\nSafety\nLead nitrate and potassium iodide should both be considered hazardous. Both\nchemicals can cause skin, eye and respiratory irritation. Prolonged exposure to lead\nnitrate can result in burns and can be toxic to the central nervous system and the\nperipheral nervous system. When working with these compounds work in a vented\nhood and avoid breathing in any dust particles.\nProcedure\nPreparation of Stock Solutions:\n0.1M lead nitrate solution--dissolve 16.6 g Pb(NO3)2 in distilled water and dilute to\n500 mL.\n0.1M potassium iodide solution--dissolve 8.3 g KI in distilled water and dilute to\n500 mL.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nPresentation:\nTo an empty 1000 mL beaker add about 100 mL of the first colorless solution\nPb(NO3)2, and then about 100 mL of the second colorless solution KI and a dense\nyellow precipitate forms instantly.\nDiscussion\nThis experiment is dramatic in that it shows the creation of a colorful product from\ntwo colorless solutions. The reaction is a classic example of a precipitation reaction,\nwhich results in the formation of an insoluble product. In this example, when an\naqueous solution of lead nitrate Pb(NO3)2 is added to an aqueous solution of\npotassium iodide KI, a yellow precipitate of lead iodide PbI2 is formed as well as\nsome potassium nitrate KNO3 which stays in solution:\n\nPb(NO3)2 (aq) + 2KI (aq) ------------- PbI2 (s) + KNO3 (aq)\nThe reaction is an example of a metathesis reaction, which involves the exchange of\nions between the Pb(NO3)2 and KI. The Pb+2 ends up going after the I- resulting in\nthe formation of PbI2, and the K+ ends up combining with the NO3- forming KNO3.\nIon\nGeneral Solubility Rule\nNO3-\nAll nitrates are soluble.\nC2H3O2-\nAll acetates are soluble (AgC2H3O2 only moderately.)\nCl-,Br-, I\nAll chlorides, bromides, and iodides are soluble except Ag+,\nPb+, and Hg22+. (PbCl2 is slightly soluble in cold water and\nmoderately soluble in hot water.)\nSO42-\nAll sulfates are soluble except those of Ba2+, Pb2+, Ca2+ and\nSr2+.\nCO32- and PO43-\nAll carbonates and phosphates are insoluble except those of\nNa+, K+, and NH4+. (Many acid phosphates are soluble.)\nOH-\nAll hydroxides are insoluble except those of Na+ and K+.\nHydroxides of Ba2+ and Ca2+ are slightly soluble.\nS2-\nAll sulfides are insoluble except those of NA+, K+, NH4+, and\nthose of the alkaline earths: Mg2+, Ca2+, Sr2+, and Ba2+.\n(Sulfides of Al3+ and Cr3+ hydrolyze and precipitate as the\ncorresponding hydroxides.)\nNa+, K+, and NH4+\nAll salts of sodium ion, potassium ion and ammonium ion are\nsoluble except several uncommon ones.\n\nA quick glance at a solubility table shows that all nitrates are always soluble and all\niodides are soluble except those formed with Pb+2, Ag+ and Hg22+\nDisposal\nThe products of the reaction should be poured out into a properly labeled waste\ncontainer for proper disposal.\nReferences\nShakhashiri, B. Z. Chemical Demonstrations: A Handbook for Teachers of Chemistry;\nUniversity of Wisconsin: Madison, WI, 1983; Vol. 1, pp. 286-292\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Silver Water: Creating a Silver Mirrored Flask",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/mirror.pdf",
      "content": "Silver Water\nCreating a Silver Mirrored Flask\nAbstract\nCombine several solutions in a clean Florence flask. Stopper and swirl the flask.\nWithin minutes, a beautiful silver reflective mirror coating forms on the inside of the\nflask, from the reduction of silver ions to silver metal.\nMaterials\n1.5 M Ammonium Nitrate solution\n4-Graduated Cylinders 50 mL\n2.5 M Sodium hydroxide solution\n1000 mL Florence Flask\n0.5 M Silver Nitrate solution\n\n1-Beaker 100 mL\nAcetone\nMilli-Q Water Bottle\n5% Dextrose Solution\n#8 Stopper to fit 1000 mL flask\nDisposable Gloves\n\nSafety Goggles\nLarge 20-gallon bucket 3⁄4 filled with H2O 2- 50 mL storage bottles\nSafety\nSilver nitrate is extremely toxic. It can cause severe burns along with discoloration\nof the skin and clothing. It could result in corneal damage, even blindness, if\nsplashed into the eyes. Ammonium nitrate is also toxic. Care must be taken in\navoiding contact with skin, eyes, and lungs. Contact with other chemicals or heat\ncould result in fire or explosion. Sodium hydroxide is a corrosive material. Mixing\nthe materials in this experiment has the potential to form an explosive compound.\nWhen the silvered flask has been produced, empty the contents immediately into a\nlarge bucket filled with fresh distilled water. Rinse the flask at least three times into\nthe same bucket. Dispose of the water in the bucket immediately. Always wear\ndisposable gloves and safety goggles when conducting the experiment.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nProcedure\nMake sure that the flask is clean. If the flask is dirty, the metallic silver coating may\nnot adhere to the walls resulting in poor results. Prior to starting the experiment,\ntake a few moments to rinse out the flask with a little acetone and then carefully dry\nit out. Place 40 mL of 5% dextrose solution directly into the 1000 mL Florence flask\nand stopper it. In a 100 mL beaker mix together 20 mL of the 1.5M ammonium\nnitrate solution and 20 mL of the 0.5M silver nitrate solution. Carefully measure out\neach of these solutions with a clean 50 mL graduated cylinder. Now pour this freshly\nprepared solution into a clear bottle labeled Solution 1 and set it aside. Take another\n50 mL storage bottle and add 40 mL of 2.5M sodium hydroxide solution and label\nthis bottle Solution 2. When you perform the demo, take the stopper out of the 1000\nmL Florence flask and in quick succession add Solution 1 first and then Solution 2.\nImmediately put the stopper on the flask. Start to gently rotate the flask making sure\nthat every part of the flask is coated with the solution. Continue rotating the flask\nconstantly in your hands swirling it making sure the entire flask is wet with\nsolution. After a few minutes of rotating, the entire flask should be coated with a\nreflective silver mirror finish. Immediately remove the stopper from the flask and\npour any remaining liquid into the 20-gallon bucket, which is 3⁄4 filled with water.\nUse a water bottle to rinse your reaction flask three times, pouring the contents of\nthese rinsings into the same bucket. The liquid in the bucket should be immediately\npoured down the drain with large amounts of water. This is the only way to prevent\nthe formation of any explosive compounds, which could potentially form if the\nreaction solutions are allowed to sit for any period of time. To fix the flask and use it\nas a vase you could coat the inside with some clear nail polish which will help to\npreserve the metallic silver coating adhering to the walls of the flask and prevent it\nfrom eventually falling off if exposed to liquids.\nDiscussion\nThis classic demonstration is used in the lab today as a qualitative test to detect the\npresence or absence of aldehyde groups in a molecule. We reacted dextrose with a\nsilver complex Tollens' Reagent [Ag(NH3)2+], which is present in a basic aqueous\nmixture. The sugar was immediately oxidized to a carboxylic acid and acted as a\nreducing agent on the silver in Tollens' reagent reducing the silver ions [Ag+] to\nsilver metal [Ag]. The metal deposits on the inside of our flask as a reflective mirror\nsurface. This is precisely how silver mirrors are still made today. The silvering\nprocess was discovered in the 19th century by a German chemist Justus von Liebig.\n\nThe reaction scheme is shown below:\n\nDisposal\n\nThe mixture remaining in the bucket must be properly flushed down the drain\nimmediately after the reaction is complete using excessive amounts of water and\nfollowing all local and state regulations for the disposal. See Flinn Scientific Disposal\nMethod #26b. Dispose of following all local, state and federal regulations for\ndisposal.\n\nReferences\n\nSummerlin, L. R., Ealy, J. L., Jr. Chemical Demonstrations, American Chemical Society:\nWashington, D. C., 1988, p. 91.\n\nCesa, I., Editor, Flinn ChemTopic Labs, Oxidation and Reduction, Flinn Scientific:\nBatavia Il (2004).\n\nShakhashiri, B. Z. Chemical Demonstration: A Handbook for Teachers of Chemistry;\nThe University of Wisconsin: Madison, 1992; Vol. 4, p. 240-243.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Simulate the Colors in Firewords",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/fire.pdf",
      "content": "SIMULATE THE COLORS IN FIREWORKS\nAbstract\nA small quantity of selected metal salts is burned on watch glasses in methanol. The\nspectrum of colors seen in fireworks is reproduced including blue, yellow, green,\ncrimson, red, orange and purple.\nMaterials\nLithium Chloride\nMethanol Anhydrous\nBoric Acid\nSix Watch glasses\nStrontium Chloride\nSpatula\nSodium Chloride\nBulb\n\nPotassium Chloride\nPasteur Pipette\nButane lighter\nSafety\nMethanol is extremely volatile make sure the bottle is away from the watch glasses\nwhen you ignite them. Strontium chloride irritates the lungs, eyes and skin. All of the\nsalts are slightly toxic by ingestion including NaCl, LD50 = 3000 mg/kg.\nProcedure:\n1. Set up six watch glasses including one for the methanol, which is the control.\n2. Add approximately 2-3 grams of each salt to the center of each watch glass\nexcept the first one, which will be reserved for the methanol control.\n3. Add about 2-3 mL of methanol to each salt soaking them well.\n4. Use a long butane lighter to ignite each watch glass one right after the other\nuntil all are burning. Turn down the lights.\nDiscussion:\nColors can be used to qualitatively identify the presence or absence of certain metal\nions. The colors arise because heating the metals elevates the metals electrons to an\nexcited state with electrons jumping into higher energy orbital's, they then relax\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nback to the ground state emitting visible light at specific frequencies resulting in the\ndifferent colors. The relaxation of an excited electron varies from one metal ion to\nanother. Each different ion produces its own line spectrum corresponding to various\nflame colors. Methanol is used as a control and burns with a blue flame. Lithium\nburns with a characteristic pinkish flame, boron a lighter green flame, strontium\ncrimson red, sodium yellow, and potassium purple/lilac.\n\nDisposal:\nAll of the left over salts can be rinsed with a small quantity of water into a dedicated\nwaste collection flask. Dispose of following all local, state and federal regulations for\ndisposal.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Splendor of One Chemical Reaction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/briggs_rauscher.pdf",
      "content": "The Splendor of One Chemical Reaction\nAbstract\nMix three colorless solutions into a 2L beaker and sit them on a magnetic stirring\ndevice. Suddenly the colorless solution turns amber, then blue-black, then back to\ncolorless. The colors continue to oscillate in a steady interval; gradually the intervals\nshorten until after about 5 minutes, the blue-black color remains.\nMaterials\n3 Liters of distilled water\n\n410 mL 30% Hydrogen peroxide, H2O2\n43 g, potassium iodate KIO3\n4.3 mL 18M sulfuric acid H2SO4\n16 g malonic acid, CH2(CO2H)2\n3.4 g manganese(II) sulfate monohydrate\n0.3 g soluble starch\n20 g sodium thiosulfate, Na2S2O3\n4- 2 L beakers\ndisposable gloves\nHot plate\nglass stirring rods\nBeakers, 100 mL & 50 mL\nmagnetic stirrer, 2\" stirring bar\nSafety\nThe reaction produces iodine in solution and vapor. The vapor begins to escape\nwhen the reaction stops oscillating. The vapor can be extremely irritating to eyes,\nskin, mucous membranes and lungs. Have a large 20-gallon bucket with lid on hand\nand set the reaction beaker into the bucket. Put the lid on the bucket and place it\nunder a laboratory fume hood ASAP and begin the quenching process described\nunder disposal. 30% hydrogen peroxide is a strong oxidizing agent, which can cause\nserious burns. Any affected areas should be washed for 15-20 minutes with plenty\nof water before getting emergency attention. If the hydrogen peroxide comes into\ncontact with other chemicals it could result in a very exothermic explosive reaction.\nHydrogen peroxide should be kept in a safe place within the lab. Sulfuric acid is a\nstrong acid and can cause burns. The vapors should not be inhaled to avoid serious\nlung damage. Spills should be neutralized with a weak base such as sodium\nbicarbonate. Malonic acid is a strong eye, skin and respiratory irritant. Take great\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\ncare in working with all of these chemicals by preparing your solutions in a vented\nfume hood wearing the appropriate gloves and safety goggles.\nProcedure\nPrepare the three colorless solutions A, B and C.\nSolution A\nAdd 400 mL of distilled water to one of the 2000 mL beakers and carefully pour in\n410 mL of 30% H2O2. Add distilled water up to the 1 Liter mark.\nPlace the solution into a 1 L storage container labeled Solution A.\nSolution B\nTake a second 2000 mL beaker and add 43 g of KIO3 + 800 mL of distilled water.\nPlace on a magnetic stir apparatus and add a magnetic stir bar. Warm the beaker\nusing low heat while stirring and add in 4.3 mL of concentrated sulfuric acid. Dilute\nthe solution to 1 Liter with distilled water and continue to stir until all the KIO3 is\ndissolved. When the reaction solution is cool, pour into a 1 L storage container\nlabeled Solution B.\nSolution C\nTake a third 2000 mL beaker and dissolve 16 g of malonic acid and 3.4 g of\nmanganese (II) sulfate monohydrate in 500 mL of distilled water. While this beaker\nis stirring on a magnetic stir plate, heat 50 mL of distilled water to a boil in a\nseparate 100 mL beaker. In another 50 mL beaker, mix 0.3 g of starch with about 5.0\nmL of water into a paste (slurry). Pour the slurry into the 100 mL beaker of boiling\nwater and heat for a couple minutes until the starch dissolves. Pour this solution\ninto the Solution C reaction beaker and dilute to 1 Liter with distilled water. When\nthe solution is cool pour into a 1 L storage container labeled Solution C.\nThe solutions can be prepared a couple weeks in advance. Make sure they are stored\nin a well ventilated and temperature controlled storage room.\nPresentation: Place a 2000 mL beaker on a magnetic stir apparatus and place inside\nof it a 2\" magnetic stir bar. Start it stirring before you pour anything into the beaker.\nStart out by pouring in 500 mL of the colorless Solution A, then add 500 mL of the\ncolorless Solution B, finally pour in 500 mL of the colorless Solution C.\nDiscussion\nAt first the colorless solution becomes an amber color, then suddenly it changes to a\nblue-black, the blue-black then fades to colorless and the solution begins to oscillate\n\nchanging colors for about 5 minutes. The oscillations initially come about every 15\nseconds almost allowing you to approximate time from the reaction. However,\ngradually the oscillation frequency increases until the limiting reagent runs out.\nTwo high school teachers, Thomas Briggs and Warren Rauscher from Galileo High\nSchool in San Francisco California, developed the Briggs Rauscher reaction. They\npublished their paper in the Journal of Chemical Education in 1973. It took about a\ndecade for some of the top chemists in the country to sort out the complex maze of\nequations involved.\nA simplified overall scheme is shown below:\nIO3- + 2 H2O2 + CH2(CO2H)2 + H+ ----> ICH(CO2H)2 + 2 O2 + 3 H2O\nEquation 1\nIO3- + 2H2O2 + H+ -------> HIO + 2O2 + 2H2O\nEquation 2\nHIO + CH2(CO2H)2 -----> ICH(CO2H)2 + H2O\nEquation 3\nI- + HIO + H+ ------> I2 + H2O\nEquation 4\nI2 + CH2(CO2H)2 -----> ICH(CO2H)2 + H+ + I-\nEquation 5\nEquation 1 shows an over simplified mechanism for the reaction. Here we have the\nreactants coming together producing iodomalonic acid.\nIn Equations 2 & 3, we have oversimplified the entire reaction by summarizing it in\ntwo equations. In the first equation, we produce hypoiodous acid, which can form\nvia a radical pathway or a non-radical pathway. The hypoiodous acid from both of\nthe pathways reacts in the second equation to produce the iodomalonic acid. There\nare probably another 10 or more equations behind these two equations.\nSummarizing: The hypoiodous acid can be produced via either a radical or non-\nradical pathway. If it is produced via a radical mechanism more hypoiodous acid is\nproduced than can be used up in Equation 3. The excess hypoiodous acid runs down\nand starts reacting as depicted in Equations 4 & 5. This is where the color comes in.\nWhen the I- is the principle ion present (Equation 5), the solution is clear. Then as\nthe hypoiodous acid reacts with the iodide ion (Equation 4), the iodine starts to\nincrease. When both the iodide and iodine are present, they combine to form a\npentaiodide ion complex, which seeks out the starch in the solution and inserts itself\ninto the helical structure of the amylose portion of the starch molecule. This results\nin a blue-black color, as the iodine concentration increases from the reaction of\nhypoiodous acid and iodide. Eventually the iodide disappears and there is iodine,\n\nwhich gives the amber color. The reaction continues to oscillate between the colors\nuntil the iodate or malonic acid is used up.\nDisposal\nThe reaction produces large amounts of elemental iodine (I2), which needs to be\nreduced to iodide ions for disposal. Use sodium thiosulfate by simply sprinkling it\nonto the beaker containing the Briggs solution and this will cause the solution to\nfoam up. The reaction between the iodine and thiosulfate is very exothermic the\nbeaker becomes hot. Continue sprinkling until the foaming dies down. Eventually\nthe reaction stops and the solution becomes colorless. The cold neutralized solution\ncan then be disposed of following all local and state regulations for disposal.\nReferences\nT. S. Briggs and W. C. Rauscher, J. Chem. Educ. 50: 496 (1973).\nShakhashiri, B. Z. Chemical Demonstration: A Handbook for Teachers of Chemistry;\nThe University of Wisconsin: Madison, 1985; Vol. 2, p. 248-256.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Superabsorbent Polymers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/snow.pdf",
      "content": "Superabsorbent Polymers\nAbstract\nPour Milli-Q water into one glass beaker containing a small amount of the polymer;\nthe water turns into a solid gel. Pour Milli-Q water into a second glass beaker\ncontaining a different form of the powdered polymer, immediately a snow like\npowder that begins to grow and rise up overflowing out of the beaker.\nMaterials\nReaction tub\n4- 2000 mL beakers\nDisposable Gloves\nSafety Glasses\nSodium polyacrylate\nMilli-Q or deionized water\nPolySnow\nSafety\nBoth sodium polyacrylate and PolySnow are relatively non-toxic polymers.\nHowever, care should be taken when working with these substances as they can\ncause irritation to the skin and nasal passages. When massing them out into a\nbeaker they are light and airy and it's easy to loose control releasing them in the air.\nTry to work in a properly vented area and avoid breathing the dust and particles,\nwhich could be inhaled causing irritation. Take precautions by wearing gloves and\ngoggles whenever working with these chemicals.\nProcedure\nAdd 9.4 grams of sodium polyacrylate to one of the empty 2000 mL beakers. To a\nsecond 2000 mL beaker add 1600 mL of Milli-Q or deionized water. Quickly pour\nthe water into the beaker containing the sodium polyacrylate. Gently swirl the\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nbeaker then after a few moments turn it upside down showing that the water has\ndisappeared or been absorbed and now exists as a gel.\nAdd 60 grams of PolySnow to another empty 2000 mL beaker. In a second 2000 mL\nbeaker add 1200 mL of Milli-Q or deionized water. Quickly pour the water into the\nbeaker containing the PolySnow. Immediately, a white powdery snow forms and\nbegins to rise up filling the beaker. If you like you can dump the snow out onto a tray\nso that the students can see the product of the reaction.\nDiscussion\nThe basic difference between the sodium polyacrylate and the PolySnow is that the\nformer contains more carboxylate groups and is less cross-linked. Consequently, it is\nable to absorb much more water per gram than the cross-linked PolySnow. Sodium\npolyacrylate is the main chemical ingredient used in diapers one of the reasons why\nthey are called superabsorbent polymers. PolySnow is actually formed by taking the\nsodium polyacrlyate polymer and cross-linking it. The heavily cross-linked polymer\nfolds over on itself until water is absorbed causing it to open up and expand. The\nentire process works on the principle of osmosis. The number of Na+ ions inside or\noutside the polymer determines the osmotic pressure at any given time, which\ndirectly relates to the number of carboxylate anion sites that exist that is COO- vs.\n\nCOOH. The amount of cross-linking also comes into play here for it is the cross-\nlinking that allows for the creation of a membrane layer on the surface of the\npolymer. It's the membrane layer that's permeable to water allowing water to enter\ninto the inside of the cross-linked polymer and hydrogen bond at the sites of high\nionic strength. If there are more sodium ions inside the polymer the amount of\nwater absorbed will be large as the polymer tries to adjust the concentrations of\nsodium ions inside and outside. The use of Milli-Q or deionized water decreases the\nions present outside of the polymer and dramatically increases the amount of water\nthat can be absorbed. In the case of PolySnow the powder consists of small\nindividual cross-linked clusters. When water is added and absorbed, the individual\nclusters form hydrogen bonds internally, the hydrated clusters then become fluffy,\nnot sticking to any of the surrounding clusters resulting in the artificial snow like\nappearance. If too much water is added the outside of the clusters will become\nhydrated resulting in the clusters sticking to each other producing a slush like effect\ninstead of the powdery snow effect.\nDisposal\nThe waste must be disposed of following local, state, and federal guidelines for\nnonhazardous materials suitable for approved solid waste landfills.\nReferences\nBuchholz, F. L., J. Chem. Ed., 1996, 73 (6), 512-515.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Toasting a Gummy Candy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/gummy_bear.pdf",
      "content": "TOASTING A GUMMY CANDY\nAbstract\nA gummy bear candy is oxidized using KClO3 as the oxidizing agent in a dramatic\nreaction, which releases a large amount of energy and results in the formation of\nharmless products KCl, CO2, and H2O.\nA photo taken at MIT 150th Celebration Open House Under the\nDome April 30, 2011. Courtesy of Nathan Sanders. Used with\npermission.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nMaterials\nGummy Bear Candy\n25mm Heavy-Walled Borosilicate Test Tube\nPotassium chlorate, KClO3\nCast Iron Support Stand for Test Tube Clamp\nSpatula\nTest Tube Clamp\nExplosion Shield\nPortable Butane Burner or Lab Burner\nLong laboratory tweezers\nFace shield\nSafety\nPotassium chlorate is a strong oxidizer, which could ignite if placed into contact\nwith other materials. It is a known skin, eye, and respiratory tract irritant.\nPotassium chlorate should always be fresh and weighed on a balance right before\nusing it. It's a good idea to mass it directly into the test tube you are going to use in\nthis experiment and cover the opening with paraffin wax paper to protect the\ncontents from any contamination.\nProcedure\nMass out approximately 5 grams of potassium chlorate into a 25 x 200 mm heavy\nwalled borosilicate glass test tube. Place some paraffin wax on the open end of the\ntest tube until you are ready to start. Clamp the test tube with a metal test tube\nclamp as close to the open end as possible. Angle the tube on the cast iron support\nstand so that it rests at about a 60-65 degree angle. Place the tube behind an\nexplosion shield making sure that the open end is pointing away from any\nspectators. This reaction should be run in a vented laboratory hood if possible.\nWhen ready to begin, put on a face shield and remove the paraffin wax from the test\ntube. Begin to heat the closed end of the test tube containing the potassium chlorate.\nRotate the burner gently with the flame touching the test tube until the potassium\nchlorate begins to melt around 350 0C. A molten mix of KCl and pure oxygen is\nreleased from the KClO3. Continue to heat the KClO3 until it melts and no crystals\nremain. This is important as leaving any solid KClO3 in the test tube at the start of\nthe reaction may cause it to eject violently from the tube. Once the KClO3 is melted,\nshut off the burner and use a long pair of laboratory tweezers to pick up one gummy\nbear. In one quick motion push the gummy candy into the tube. The reaction starts\ninstantly.\nDiscussion\nThe dramatic reaction produces fire and smoke. It almost smells like burnt\nmarshmallows. The gummy bear is sucrose C12H22O11, which is the source of fuel for\nthe reaction. The first reaction produces the molten KCl and a rich oxygen\nenvironment. As soon as the gummy sugar is added, it ignites in the rich oxygen\nenvironment leading to the combustion reaction producing harmless CO2, H2O and\nlots of energy. The reaction feeds on itself producing more oxygen until the gummy\nsugar is consumed. The sequence of reactions is as follows:\n\nDisposal\nThe test tube in this reaction is left completely charred and blackened with\neverything consumed in the reaction. The test tube can be safely disposed of into a\nlaboratory broken glass waste container.\nReferences\nBob Dayton, Tom Annacone, (1988) Lee Meriwether, Princeton Summer Institute\nRevised version by Mark Case, CHEM6 TORCH Binder, 1995.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Toxic Compounds from Cooking \"Cracking\" Bacon Fat",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/bacon.pdf",
      "content": "Toxic Compounds from Cooking\n\"Cracking\" Bacon Fat\nAbstract\nA ration of bacon is heated with a Bunsen burner until it sizzles. The ration of hot\nbacon is tossed into a 2L Erlenmeyer flask filled with red-brown Bromine vapor.\nAfter briefly shaking the stoppered flask with the bacon, the red-brown bromine\ncolor disappears indicating the presence of double bonds in the sizzling bacon.\nMaterials\nPackage of bacon\nPortable butane burner or Lab burner\nBromine\nMatches\nTongs\n2 Liter Erlenmeyer flask\nLaboratory Fume Hood\nLong Glass Pasteur pipette with bulb\nSafety\nWear safety goggles and disposable gloves. Bromine is toxic if inhaled. The vapor is\nan eye and skin irritant and can burn you. Bromine is difficult to work with and\ntends not to stay inside of the transfer pipette due to its high density and vapor\npressure. Because it leaks readily from the transfer pipette, the receiver flask must\nbe close at hand to avoid any spill. Always work with bromine in a laboratory fume\nhood.\nProcedure\nPrior to the demonstration prepare a 2L Erlenmeyer flask with bromine vapor.\nWorking in a laboratory fume hood, open a bottle of bromine and transfer several\ndrops to the 2L Erlenmeyer flask. Immediately stopper the flask. Shake gently to\nvaporize all of the bromine. The flask immediately fills with the red-brown color of\nbromine vapor. If necessary, add a couple more drops to darken the color until it's\nvisible for the audience.\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nWhen it's time to perform the demonstration, pick up about a 1⁄2 ration of bacon\nwith tongs and heat it with a portable butane burner or lab Bunsen burner until it is\nsizzling. Then immediately in a very quick action unstopper the 2 L flask with the\nbromine vapor and toss in the sizzling bacon. Re-stopper the red-brown bromine\nvapor filled flask and shake several times. After a brief time, the red-brown color of\nthe bromine disappears and the flask becomes clear.\nDiscussion\nHeating the bacon to sizzling cracks the bacon fat, producing an unsaturated\nacrolein (CH2=CH-CHO), and some other unsaturated fats:\nAcrolein\nThe acrolein is toxic and represents the simplest unsaturated aldehyde that we\ncould make. It is extremely reactive due to the presence of the double bond. It is one\nof a number of compounds that is highly recognizable from their acrid odor that\nresembles burning fat. By tossing the sizzling bacon into the flask containing the\nbromine vapor, we are able to see a classic reaction in Organic Chemistry: the\naddition of bromine across a double bond. Bromine adds across the double bonds in\nunsaturated molecules according to the following reaction:\nO\n\nThe color of the bromine in the flask disappears because it's used up adding across\nthe double bonds in the unsaturated molecules that are present from \"cracking\"\nbacon fat.\nDisposal\nThe bacon can be discarded. The flask can be washed out and rinsed with soap and\nwater. Dispose of following all local, state and federal regulations for disposal.\nReferences\nHubert N. Alyea, J. Chem. Educ., 1969, Volume 46(9) p. A633\nTed Lister, Classic Chemistry Demonstrations: Unsaturated Compounds in Foods;\nRoyal Society of Chemistry, 1995, Experiment 50, p. 126.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Water to Wine to Milk to Beer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-hs-002-chemistry-behind-the-magic-chemical-demonstrations-for-the-classroom/drink.pdf",
      "content": "Water to Wine to Milk to Beer\nAbstract\nA glass of clear water solution is poured into a wine glass and turns into a glass of\nwine. The wine is then poured into another glass and turns into a glass of milk.\nFinally, the milk is poured into a beer mug and turns into a bubbling mug of beer.\nMaterials\nSodium hydrogen carbonate\nHydrochloric acid\nPhenolphthalein\nlump of dry ice\nBarium chloride\nwater glass, wine glass, milk glass, beer mug\nSodium carbonate\n\nsmall shot glass for HCl\nSodium dichromate\nsmall container for lump of CO2\nBottles for stock solutions\nspatula\nSafety\nAlways wear disposable gloves and safety goggles when preparing solutions and\nworking with chemicals in the lab. Sodium dichromate is corrosive and will cause\nsevere burns to any area of contact. Sodium dichromate is also a known carcinogen\nand strong oxidizer/reducer that can ignite and burn if it comes into contact with\nother materials. Hydrochloric acid is known to cause severe burns to all body\ntissues and could be fatal if swallowed or ingested. Inhalation could cause lung\ndamage. Barium chloride should be handled carefully and is an irritant to skin, eyes\nand lungs. Dry ice can cause frostbite and should be handled only with insulated\ngloves. Sodium carbonate is only slightly toxic but can cause irritation.\nProcedure\nWARNING NOTICE\nThe experiments described in these materials are potentially hazardous.\nAmong other things, the experiments should include the following safety\nmeasures: a high level of safety training, special facilities and equipment,\nthe use of proper personal protective equipment, and supervision by\nappropriate individuals. You bear the sole responsibility, liability, and\nrisk for the implementation of such safety procedures and measures. MIT\nand Dow shall have no responsibility, liability, or risk for the content or\nimplementation of any of the material presented. Legal Notice\n\nAdd to the water glass 22 mL of a saturated solution of sodium bicarbonate. Then\nadd 6 mL of a 20% sodium carbonate solution and fill the glass with distilled water.\nAdd 4 drops of a 1% phenolphthalein solution to the empty wine glass. Add 11 mL\nof a saturated solution of barium chloride solution to the empty milk glass. Add to\nthe beer mug, a few crystals of sodium dichromate. Then, right before you transfer\nthe milk into the beer mug pour in 6 mL of concentrated HCl from the shot glass and\ntoss in one piece of dry ice.\nThere are many ways to present this demonstration. You can start by creating a\nstory for the audience. Starting with the glass of water, pour the contents of the\nglass into the wine glass and a colorful glass of wine appears. Pour the contents of\nthe wine glass quickly into the milk glass and a white opaque glass of milk appears.\nFinally, toss the 6 mL of HCl into the beer mug, throw in a solid piece of dry ice and\nquickly pour the glass of milk into the mug and the solution turns into a bubbling,\nfrothy, colorful mug of beer.\nDiscussion\nThe reactions are eye catching. The water glass contains carbonate ions and\nhydroxide ions, which are basic. The wine glass contains phenolphthalein, which\nforms a pink solution in the presence of base giving the impression of a glass of light\nred wine. When the wine is poured into the milk glass the barium ions react with\ncarbonate to form a solid white milky precipitate of barium carbonate. Finally the\nmilk is poured into the beer mug and the HCl breaks up the solid white precipitate\nproducing CO2 gas and soluble barium ions in water. The dichromate ions help to\ngive it the yellowish-brown color of beer. The short sequence of reactions is as\nfollows:\nWater Na2CO3\nCO32- HCO3- + OH-\n\nWine Phenolphthalein HIn + OH- In- + H2O\nMilk BaCl2\nBa2+ + CO32- BaCO3(s)\nBeer HCl BaCO3(s) + 2H+ Ba2+ + H2O + CO2(g)\nDisposal\nThe final solution should be placed into an appropriate waste container. The glasses\ncan then be rinsed out with plenty of water. Any remaining stock solutions can be\nstored for future use.\n\nhttp://chem.lapeer.org/Chem1Docs/WaterWineBeer.html\nReferences\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nChemistry Behind the Magic: Chemical Demonstrations for the Classroom\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}