{
  "course_name": "Childhood and Youth in French and Francophone Cultures",
  "course_description": "This course studies the transformation of childhood and youth since the 18th century in France and the development of sentimentality within the family in a francophone context. We will examine the personification of children as a source of inspiration for artistic creation and a political ideal aimed at protecting future generations, and consider various representations of childhood and youth in literature, movies, and songs.\nThe course is taught entirely in French.\nAbout the instructor: Bruno Perreau is the Cynthia L. Reed Professor of French Studies at MIT and Director of MIT’s Center of Excellence in French Studies. He is also an Affiliate Faculty at the Center for European Studies, Harvard University.\nPerreau recently published The Politics of Adoption: Gender and the Making of French Citizenship (MIT Press, 2014), Queer Theory: The French Response (Stanford University Press, 2016), Les Défis de la République (ed. with Joan W. Scott, Presses de Sciences Po, 2017), Qui a peur de la théorie queer ? (Presses de Sciences Po, 2018), and Sphères d’injustice. Pour un universalisme minoritaire (La Découverte, 2023).",
  "topics": [
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nPrerequisites\n\nOne intermediate subject in French.\n\nCourse Description\n\nChildhood is a source of fascination in most Western cultures. It is both a major inspiration for artistic creation and a political ideal, which aims at protecting future generations. Which role does it play in French society and in other Francophone areas? Why is the French national anthem (\"La Marseillaise\") addressed to its \"children?\"\n\nThis course will study the transformation of childhood since the 18\nth\ncentury and the development of sentimentality within the family. We will examine various representations of childhood in literature (e.g. Proust, Sarraute, Laye, Despleschin, Forest), movies (e.g. Truffaut, Sciamma, Dhont), and songs (e.g. Barbara, Biolay).\n\nThis course is taught in French.\n\nGrading policy\n\nSessions will be divided between\n\nstudents' presentations\n\nclass discussion to engage with the main readings and movies\n\nother activities: creative writing, document analysis, etc.\n\nFinal grade will be determined from three types of required exercises:\n\nOne grade will be based on short-answer papers (30%.) It will consist of a one-page maximum argument (double spaced) in order to prepare each session.\n\nOne grade will be based on one oral presentation (20%), limited to 10 minutes.\n\nTwo grades will be based on a creative video project about\na piece of art related to childhood\n(by a Francophone artist). Students will select and present a piece (one-page paper, 10%.) They will then invent a story based on their selected work of art and will narrate and/or perform this story on a video (five minutes maximum, 30%.) The video will be submitted four weeks before the end of classes.\n\nOne grade will be based on class participation (10%): the evaluation will be based on attendance, the demonstration that the students have done the \"readings\" (documents, book excerpts, films), and the quality of their oral output. To help prepare the discussion, questions on the readings and their most topical aspects will be suggested every week.",
  "files": []
}