{
  "course_name": "Chinese Foreign Policy: International Relations and Strategy",
  "course_description": "China’s rise as a great power raises important questions about how that power might be used in its relations with other states. Nowhere are such questions more salient than in the future trajectory of China’s conflict behavior, including its approach to deterrence, crisis management and the use of force. To explore these important questions in China’s international relations, this seminar examines the evolution of Chinese strategic thought, in primary sources as well as its reflection in the interactions among Chinese states and between China and other states.",
  "topics": [
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 2 hours / session\n\nPrerequisites\n\nIt is recommended that students have background knowledge of China and international relations.\n\nDescription\n\nChina's rise as a great power raises important questions about how that power might be used in its relations with other states. Nowhere are such questions more salient than in the future trajectory of China's conflict behavior, including its approach to deterrence, crisis management and the use of force. To explore these important questions in China's international relations, this seminar examines the evolution of Chinese strategic thought, in primary sources as well as its reflection in the interactions among Chinese states and between China and other states. To understand the degree of continuity between the past and the present, the majority of the course will explore the evolution of strategic thought in ancient and imperial China, while the role of strategy in modern and contemporary China will be examined in the final sessions. The seminar will focus on a close reading of classic Chinese texts on strategy, such as Sun Zi's\nArt of War\nand Mao Zedong's writings, along with relevant secondary literature on diplomatic, military and intellectual history.\n\nThe course has several goals. The first is to introduce students to the content of Chinese strategic thought in order to understand the degree of continuity and discontinuity reflected in subsequent theory and practice. The second goal is to consider the extent to which China may be described as possessing a unique strategic culture or approach to strategy.\n\nThe seminar will raise many questions, but few may be answered decisively. Students will be expected to read widely and wrestle with concepts, not just accumulate facts. The reading load is heavy and students must complete all the assignments for each session. Class meetings will emphasize discussion, not lectures.\n\nRequirements and Grading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n50%\n\nResearch paper\n\n50%\n\nThe first requirement is active participation in seminar discussion. A successful seminar requires attendance at every meeting, completion of all readings, and active and engaged participation in the class. To stimulate discussion, students may be assigned to give short presentations on assigned readings or to serve as \"resident expert\" for that week's readings. The second requirement is a research paper on the topic of your choice.\n\nInformation for Undergraduates\n\nThis course is open to graduate students and advanced undergraduates with a background in China and international relations. Undergraduates will be evaluated along the same criteria; class participation (50%) and a research paper (50%). Undergraduates may choose a second grading option, substituting two take take-home essays, each roughly 15 pages in length, for the research paper. These essays must demonstrate a command of the readings in the course.",
  "files": [
    {
      "category": "Resource",
      "title": "An Analysis of Traditional Chinese Strategic Thought",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-407-chinese-foreign-policy-international-relations-and-strategy-spring-2009/c8a617618499029cf58906b9cc8c89a2_MIT17_407S09_midterm1.pdf",
      "content": "17.407 Midterm\nAn Analysis of Traditional Chinese Strategic Thought\nThis paper will examine traditional Chinese strategic thought, as represented in\nthe works of Sun Tzu, the Chinese military classics, and the commentaries of Zhuge\nLiang and Liu Ji. We will begin by establishing the basic assumptions: a Hobbesian state\nof constant warfare and the necessity of victory for survival; and, military action as the\nprimary means of conflict resolution. We will examine the sources of victory in conflict\nas conceptualized by these thinkers, namely, the primacy of the mental battlefield and\nparamount importance of psychological victory. Finally, we will investigate the efficacy\nof the use of force, and Chinese thought on when and how it is to be employed. We will\nsee that force is to be employed tactically with precision and great preparation, and that\nthe outcome of such an action should be known in advance. The minimal amount of\nforce is to be applied for greatest possible effect.\nSun Tzu epitomized, \"War is the most important affair of the state.\"1 In the\npolitical and military environment of classical China, success in war was essential to the\nsurvival of the state. States that failed in war would be violently consumed by their\nneighbors. The texts, in concerning themselves almost entirely with questions of\nstrategy, tactics, and leadership, make the implicit assumption that a condition of war is\nto be taken for granted and that failure is not an option. There could be no \"peace with\nhonor,\" to borrow a more modern concept. The state of war was assumed to offer victory\nor annihilation.\nStability occurred through the military dominance of a superior political entity,\nusually a dynasty which itself had absorbed enough weaker states to become powerful.\nPeace through mutual \"benevolence,\" as Sawyer translates the Ssu-ma Fa, was\npreferable, but a state must uphold military readiness in order to maintain it.2 In the final\n1 Sun-Tzu, trans. Sawyer, 1993: p.157\n2 Ssu-ma, trans. Sawyer, 1993: p. 126\n\ncalculation, peace was enforced rather than negotiated. The Ssu-ma Fa states,\n\"Authority comes from warfare, not from harmony among men.\"3\nWhile Western political and military thought contains extensive deliberations on\nthe \"just\" conduct of war, the morality of initiating conflict and when such action is\nacceptable, these ruminations are conspicuously absent from the Chinese corpus.\nOpinions that most nearly approach \"Jus ad Bello\" tend to orbit around Wei Liao-Tzu's\n\"...the military provides the means to execute the brutal and chaotic and to stop the\nunrighteous.\"4 This offers little in the way of guidance for the correctness of initiating\nhostilities, as it seems to imply that hostilities already exist, or at least imply the existence\nof a situation requiring correction. The statement, then, is that the military is the proper\ncorrective instrument. More generally, the assumption that a state of war is a basic fact\nof existence, more than any other, is the key assumption underlying classical Chinese\nstrategy. The military is not a means towards political ends, but towards survival. As\nSun-Tzu notes in his discussion of the importance of forming alliances in certain\nsituations, political means are applied in pursuit of military ends. This seems to imply an\ninversion of the Clausewitzian paradigm.\nThe concept of victory in classical Chinese strategic thought is firmly centered on\nthe psychological. This paradigm is twofold: it both emphasizes psychological victory\nand the psychological preparation required for victory. Touching upon this, as well as\nother issues involving the use of force in battle, Sun-Tzu states: \"...one who knows the\nenemy and knows himself will not be endangered in a hundred engagements.\"5\nMental or spiritual defeat of the enemy is considered an essential aspect of\nmilitary victory - while physical annihilation may or may not follow psychological\ndefeat, the psychological component is a necessary prerequisite. A predominant\ncorollary to this theme of mental determinism would state that every battle is won or lost\nbefore it is joined - implicitly discounting the role of prowess in actual combat, and\nreflecting the writings of Sun-Tzu. A wise commander, then, is prescribed to determine\nhis prospects for a given battle and chose to engage or avoid.\n3 Ibid.,\n4 Wei Liao-Tzu, trans. Sawyer, 1993: p. 247\n5 Sun-Tzu, trans. Sawyer, 1993: p. 162\n\nMissing from this discussion is the destruction of the opposing forces - it seems\nto refer only to a strictly tactical victory, in which a position is gained but the opposing\nforces are not significantly injured. While one might believe this implies that the\npsychological aspect of war is limited to tactical thinking, this is not the case. Wei Liao-\nTzu epitomizes \"One who excels at employing the army is able to seize men... This\nseizing is a technique of the mind.\"6 Conversely, the role of physical military power is\nnot entirely abandoned: Wei specifies three modalities of victory: through \"Tao,\"\n\"awesomeness,\" and \"strength.\"7 Tellingly, only the third of these addresses the actual\nuse of force. Wei continues:\n\"...the means by which the people fight is their ch'i. When their ch'i is\nsubstantial they will fight; when their ch'i has been snatched away they will run off.\"8\nWei makes the case that the battle is decided in the ebb and flow of the warriors'\nch'i, a character which Ames translates as \"psychophysical energy,\"9 and Sawyer as\n\"breath\" or \"pneuma,\"10 presumably in the metaphorical rather than the literal sense. Liu\nJi discusses the exploitation of ch'i in \"Energy and Battle\".11 There is consensus that the\nmaterial aspects of battle are of subsidiary importance. Sun-Tzu also explores ch'i,\nnamely, its \"manipulation,\" and suggests that one attack at a time when it is weakest in\none's enemy. In this chapter, \"Military Combat,\" Sun-Tzu expounds upon the need to\n\"control the mind,\" and states \"the [enemy] commanding general's mind can be\nseized.\"12\nIt is worth noting that Smith and Gimian translate \"mind\" as \"heart-mind\" in the\nabove passages, touching on the spiritual aspect of Sun-Tzu, and by extension, the\nclassical Chinese military corpus.13 Victory is a matter of the heart-mind - the physical\nbattle is secondary.\n6 Wei Liao-Tzu, trans. Sawyer, 1993: p. 247\n7 Ibid.\n8 Ibid.\n9 Sun-Tzu, trans. Ames, 1993: p. 50\n10 Sun-Tzu, trans. Sawyer, 1993: p. 170\n11 Liu Ji, trans. Cleary, 1989: p. 123\n12 Sun-Tzu, trans. Sawyer, 1993: p. 170\n13 Sun-Tzu, trans. Smith and Gimian, 2002: p. 31\n\nChinese strategic thinkers approach the questions of the efficacy of the use of\nforce, and the proper time and mode of its employment, with a focus upon preparation for\nbattle, precision in application and avoidance when possible. Force must be employed in\npursuit of a clearly defined objective, with the outcome precisely conceptualized. One\nmust avoid employing force - not for any ethical reason, but for the utilitarian goal of\navoiding battle to preserve one's own strength. Finally, one may employ force\neffectively only when the goal to be attained is defined, and the commander knows the\noutcome in advance.\nZhuge Liang writes, \"The proper course of military action is to establish strategy\nfirst, and then carry it out.\"14 He expounds in this passage, \"Military Action,\" on the\nmyriad preparations necessary for warfare. Liu Ji adds, quoting Wu Qi, \"The bold will\nreadily clash, readily clash without knowing what is to their advantage.\"15 Liu quotes\nthis passage in the chapter \"Fighting Too Readily,\" which offers a story of a commander\nattacking impulsively and being routed. Thorough planning must presage the\nemployment of force.\nSun-Tzu speaks definitively on the efficacy of employing force and the conditions\nfor its use: \"Subjugating the enemy's army without fighting is the true pinnacle of\nexcellence.\"16 He later adds, \"The best military policy is to attack strategies,\"17 by which\nis meant that a superior use of military power (though not necessarily force) is to act\nagainst the enemy's physical and psychological plans, rather than against the enemy\nmilitary itself. In this way the actual use of force is avoided until absolutely necessary,\nand when force is applied, it is applied in the minimalist fashion: the least amount used in\nthe way to cause the most effect. Another statement from The Art of War that echoes\nthese ideas reads: \"Seize what [the enemy] loves.\"18\nOn the necessity of foresight, Sun-Tzu writes,\n14 Zhuge Liang, trans. Cleary, 1989: p. 56\n15 Liu Ji, trans. Cleary, 1989: p. 106\n16 Sun-Tzu, trans. Sawyer, 1993: p. 161\n17 Sun-Tzu, trans. Ames, 1993: p. 111\n18 Sun-Tzu, trans. Smith and Gimian, 2002: p. 51\n\n\"The battle of the expert is never an exceptional victory...the victorious army\nonly enters battle after having first won the victory, while the defeated army only seeks\nvictory after having first entered the fray.\"19\nSun-Tzu's guidance here is twofold. First, it discounts the ideals of skill or\nbravery in battle - while he discusses these things extensively elsewhere in The Art of\nWar, here he makes plain that they are matters for a calculus of success to be undertaken\nbefore the engagement - they are not virtues to be counted on for success once the battle\nis joined. Secondly, he ascribes victory to successful action undertaken prior to the battle\nitself, underscoring the emphasis on preparation and precision in the use of force.\nSun-Tzu's opinion on the use of force is thus set forth. It is to be employed in the\nleast amount possible and with the greatest precision possible. And, it is not the key to\nsuccess in battle: the psychological aspects of war and one's preparedness to fight will\ntrump the application of naked force, or its corollary, heroic valor on the battlefield.\nCounting on such things is the mark of an army to be defeated.\nThe basic assumptions of Chinese classical strategic thought are the existence of\npolitical entities in a constant state of war, and the necessity of victory for survival.\nMilitary action is the primary means of conflict resolution. The source of victory in war\nis not military might, but psychological dominance. Force is to be employed with\nprecision and preparation, and the minimal amount of force is to be leveraged for the\nmaximum attainable effect.\n19 Sun-Tzu, trans. Ames, 1993: p. 116\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.407 / 17.408 Chinese Foreign Policy: International Relations and Strategy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Explaining China’s Participation in Anti-Piracy Operations in the Gulf of Aden",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-407-chinese-foreign-policy-international-relations-and-strategy-spring-2009/5fb8470f21d4d7acb633d9015801ae01_MIT17_407S09_student2.pdf",
      "content": "Explaining China's Participation in Anti-Piracy Operations in the Gulf of Aden\nDepartment of Political Science\nMassachusetts Institute of Technology\nMay 2009\n\nOn 18 December 2008, Beijing announced its decision to deploy three ships of the\nPeople's Liberation Army Navy (PLAN) to join the international naval flotilla battling\npiracy in the Gulf of Aden. Three weeks later, two of China's most advanced destroyers\naccompanied by the PLAN's largest supply ship arrived off the Somali coast in China's\nfirst long range operational naval deployment with the stated mission of safeguarding\nChinese shipping.1 Aside from sending a Luhu-class guided missile destroyer and a\nsupply ship on a global circumnavigation in 2002, the last time China deployed a naval\nfleet into the Indian Ocean was during the maritime expeditions of Admiral Zheng He in\nthe 1400s.2 All indications suggest that the current mission will not be short lived;\nChinese naval assets will likely remain deployed to the region until improved political\nand social conditions in Somalia lead to a drastic reduction in maritime piracy.3\nChina's anti-piracy deployment, coupled with its increasing participation in\nUnited Nations peace operations, signals a shift in Chinese foreign policy behavior\ntoward increased willingness to employ PLA forces in military operations other than war\n(MOOTW) to secure Chinese interests in regions distant from the Chinese mainland.\nThese missions stand in stark contrast to past PLA operations, which rarely went beyond\nthe Chinese periphery. This paper serves two primary purposes. First, it examines the\ndrivers behind China's participation in anti-piracy operations. Second, it draws on\ncampaign analysis of the current Chinese mission, supported by an examination of\n1 \"China to send Navy to fight Somali pirates,\" PLA Daily. 22 December 2008. Available online: <\nhttp://english.chinamil.com.cn/site2/special-reports/2008-12/22/content_1594031.htm>. Accessed 30\nMarch 2009.\n2 Andrew S. Erickson and Justin D. Mikolay, \"Welcome China to the Fight Against Pirates,\" Proceedings\n135 (March 2009).\n3 \"Chinese new fleet sails to fight Somali pirates,\" PLA Daily. 2 April 2009. Available online:\n<http://english.chinamil.com.cn/site2/special-reports/2009-04/03/content_1713589.htm >. Accessed 13\nMay 2009.\n\nChinese defense publications and acquisitions, to assess what the current Chinese mission\nreveals about Chinese naval capabilities and potential future operations.\nThe first section attempts to determine the factors that motivate China's\nparticipation in anti-piracy operations in the Gulf of Aden by qualitatively testing three\npotential drivers behind China's antipiracy deployment that have appeared in policy\npublications.4 Was China driven solely by a desire to protect its own interests? Did\nBeijing hope to demonstrate its increasing role as responsible global actor? Or, is the\nmission a form of capabilities demonstration, development and training for the PLAN?\nRelying on media releases, unclassified Chinese military publications, and both Western\nand Chinese academic writings, this paper argues that China's anti-piracy mission was\nprimarily motivated by a self-interested desire to protect Chinese interests, while at the\nsame time enhancing China's diplomatic position and providing limited opportunities for\nmilitary development.\nThe paper then offers a comparative campaign analysis of China's mission vis-a\nvis the anti-piracy missions of other nations. This section examines the assets and tactics\nemployed by China and other nations involved in maritime security operations in the\nGulf of Aden and allows for a greater understanding of the objectives of each mission.\nThe paper then concludes by examining Chinese tactical and doctrinal revelations from\nthe current mission to analyze how China may execute future PLAN operations.\nExplaining China's Participation\n4 For example see, David Lai, \"Chinese Military Going Global,\" China Security 5, no 1 (Winter 2009), 3\n8. Richard Weitz, \"Operation Somalia: China's First Expeditionary Force,\" China Security 5, no 1 (Winter\n2009), 27-42.\n\nThe driving forces behind China's decision to participate in anti-piracy operations\ncan be categorized as either realist or idealist. The realist drivers include a desire to\nprotect Chinese shipping, expand China's influence, and to provide opportunities for\nrealistic training that will enhance the PLAN's capabilities in military operations other\nthan war.5 The idealist viewpoint suggests that China hopes to protect regional security\nand stability. The two categories of drivers are not mutually exclusive as China could\nhelp ensure regional stability while protecting its own economic interests, thereby\ndeveloping its status as a more responsible actor in the international community and\nfurthering its own interests.\nProtecting China's Interests\nChina has tasked its anti-piracy force with the primary mission of ensuring the\nsafety of Chinese ships and crews transiting through the pirate infested region.6 On the\nday the Chinese mission was launched, Wu Shengli, commander of the PLAN,\nannounced, \"It's the first time we go abroad to protect our strategic interests armed with\nmilitary force.\"7 These official statements suggest that China is a realist actor seeking to\nprotect its economic and strategic interests. This would support arguments made in some\n5 See note 4.\n6 Tian Yuan, \"Somali pirates pose serious threat to China's rights and interests in navigation,\" PLA Daily.\n26 December 2008. Available online: < http://english.chinamil.com.cn/site2/special-reports/2008\n12/26/content_1599410.htm>. Accessed 14 May 2009.\n7 \"Chinese Navy Off on Historic Anti-Piracy Mission,\" AFP. 26 December 2008. 30 March 2009. Lexis\nNexis.\n\npolicy circles that China is a mercantilist power, using state resources to further economic\nand commercial development.8\nThe pirate-infested waters off the Coast of Somalia are a critical sea lane of\ncommunication for China, meaning that a lack of maritime security could disrupt trade\ncritical to China's economic development. According to Chinese sources, more than 1200\nChinese ships and forty-percent of all goods and raw materials bound for China pass\nthrough the Gulf of Aden each year.9 These vessels carry a variety of products including\nmuch of the crude oil imported to China. As a result of China's \"Going Out\" campaign,\nwhich was launched in 2002, many Chinese firms increased overseas investment in an\nattempt to meet China's growing demand for natural resources and raw materials that\nChina was unable to meet through domestic production.10 Today, China is the world's\nsecond largest importer of crude oil, and obtains about 46-percent of its imports from the\nMiddle East and 32-percent from Africa.11 Ships transporting oil from Angola and Iran,\ntwo of China's top crude oil suppliers, likely avoid the Gulf of Aden, however roughly\n50-percent of China's annual crude imports must pass through the Gulf of Aden.12\nEscorting vessels through this region helps ensure security of supply of the resources\ncritical for China's continued growth and protects Chinese goods whose exports fuel the\nChinese economy.\n8 For example see, Sanusha Naidu, \"China and Africa's Natural Resource Sector: A View from South\nAfrica,\" Center for Strategic and International Studies. Available online: <\nhttp://forums.csis.org/africa/?p=33 >. Accessed 13 May 2009.\n9 \"Piracy Fight to Boost US Ties,\" Chinadaily.com. 22 December 2008.\n63 Aaron L. Friedberg, \"Going Out\": China's Pursuit of Natural Resources and Implications for the PRC's\nGrand Strategy. (Seattle, WA: The National Bureau of Asian Research, 2006), 21-24.\n11 2009 Report to Congress on China. (Washington, DC: Department of Defense, 2009), 4-5.\n12 In 2006, China's top oil suppliers were Saudi Arabia, Angola and Iran. Iran and Angola supply roughly\ntwenty-eight percent of China's crude oil. Source, note 11.\n\nIn addition to protecting economic and commercial interests, China has used the\nanti-piracy mission as an opportunity to further its diplomatic objective of exerting\ngreater influence over Taiwan. China has extended the offer of protection to ships from\nTaiwan and the Special Administrative Regions (SAR) of Hong Kong and Macao.\nEscorting Hong Kong and Macao ships does not generate political concerns because both\nSARs are self-governing entities of the People's Republic of China. As SARs, foreign\npolicy and military related issues are the responsibility of Beijing, justifying PLAN\nescorts for SAR-owned ships. Providing escorts to Taiwan-owned ships, however, has\nconsiderable political ramifications. If it were to allow its vessels to join PLAN escorted\nconvoys through the Gulf of Aden, Taiwan would appear to be under the sovereign\nprotection and jurisdiction of the mainland. To avoid appearing to be subordinate to the\nmainland, Taiwan has declined to establish any official channels for Taiwan-owned ships\nto request escort from the PLAN.13 Although no official mechanism for requesting a\nPLAN escort was initiated, the Formosa Product Cosmos, a tanker owned by the Taiwan-\nbased Formosa Plastics Marine Corporation was one of the first ships to benefit from a\nPLAN escort. Taiwan's Mainland Affairs Council, attempting to reinforce its position\nthat Taiwan ships were not being protected by mainland forces, quickly announced that\ndespite being owned by a Taiwan firm was registered in Liberia and rented to a South\nKorean company, and was therefore not considered a Taiwan ship.14\nInstead of seeking PLAN escorts, Taiwan has directed its merchant and fishing\nvessels to summon the nearest warships from any nation if they are attacked by pirates in\n13 \"Should We Accept China's Protection Against Pirates?\" The China Post. 21 January 2009. Lexis Nexis.\n14 Ibid.\n\nthe Gulf of Aden.15 Taiwan is also considering deploying its own warships to the region,\nhowever, Taipei must first overcome significant logistical and diplomatic obstacles.16\nTaiwan is not recognized by any nation near the Gulf of Aden, which may make\nresupplying its naval ships challenging. Beijing may also be able to use its diplomatic\npower to pressure states into blocking Taiwan's naval vessels from entering their ports to\nrefuel and load additional supplies. Although China clearly did not launch its anti-piracy\noperation as a means of asserting greater influence, Chinese media has extensively\ncovered the escort of the Formosa Product Cosmos, to demonstrate the mainland's\nprotection of Taiwan ships.17 Political tensions between Beijing and Taiwan may increase\nif Taiwan decides to launch its own anti-piracy operation.\nWhile the mission may appear to further China's economic, commercial, and\ndiplomatic interests, the Chinese task force focuses primarily on escorting Chinese-\nowned vessels, and largely excludes non-Chinese ships that might be carrying goods to or\nfrom China.18 One of these ships, a Turkish-owned freighter was hijacked off the coast of\nSomalia in October 2008 while carrying a load of iron ore from Canada to China.19 The\nprimary mission of protecting Chinese vessels, instead of vessels carrying key Chinese\nimports and exports, suggests that Beijing may be more interested in protecting its own\ncrews and ships than with securing critical supply lines. If true, the Chinese anti-piracy\nmission could not be considered a purely mercantilist act because a significant amount of\n15 Minnie Chan, \"Taiwan Won't Seek PLA Protection from Pirates,\" South China Morning Post. 12\nJanuary 2009. Lexis Nexis.\n16 Ibid.\n17 For example, \"Chinese mainland naval fleet escorts Taiwan merchant ship off Somalia,\" Xinhua. 12\nJanuary 2009. Available online: <http://english.chinamil.com.cn/site2/special-reports/2009\n01/13/content_1617701.htm >. Accessed 20 March 2009.\n18 Some foreign flagged ships, including some from Germany have been escorted.\n19 Suzan Fraser, \"Turkish Ship Hijacked,\" AFP. 30 October 2008. Lexis Nexis.\n\nChinese and China-bound goods is carried on foreign owned vessels.20 Admittedly\nproviding escorts to all ships carrying Chinese imports and exports would prove\nlogistically difficult, and perhaps beyond current PLAN capabilities. This suggests that\nother drivers, such as the desire to demonstrate its status as a responsible rising military,\nalso informed the decision-making calculus.\nBecoming a Responsible Global Actor\nMost Chinese policymakers and foreign analysts have argued that the PLAN anti-\npiracy mission was launched largely to protect Chinese shipping interests, however the\nChinese government has gone to great lengths to characterize the mission as a\ndemonstration of Beijing's increasing participation as a responsible actor in the\ninternational system. Chinese officials have stated that participation in anti-piracy\noperations is fulfilling an international obligation, and have justified their deployment by\nciting United Nations resolutions in government press releases and on government\nwebsites.21 China announced its intention to deploy an anti-piracy force just days after the\nUnited Nations Security Council passed Resolution 1851, which encouraged member\nstates to take a more active role in fighting pirates off the Coast of Somalia.22\nAlthough Security Council resolutions legitimize China's actions and decrease the\npotential of a long range Chinese military deployment being viewed through the lens of\nthe \"China threat\", China's participation in anti-piracy operations does not necessarily\n20 The Chinese merchant marine consists of 1826 vessels, many of which are coastal vessels . CIA World\nFactbook. Non-Chinese ships routinely carry goods to China. See note 19 for an example of a case where a\nnon-Chinese was carrying goods to China\n21 \"Rear admiral: Chinese navy's anti-piracy escorts not a short-term mission,\" PLA Daily. 11 March 2009.\nAvailable online: <http://english.chinamil.com.cn/site2/special-reports/2009\n03/11/content_1685574.htm>. Accessed 30 March 2009\n22 Resolution 1851. S/RES/1851 (2008) United Nations Security Council. 16 December 2008.\n\ndemonstrate a more responsible role in the international community. China has\ncommitted personnel and resources to combat piracy, a concern of many international\nactors international, but has decided to do so largely unilaterally, rather than by joining a\nmultinational task force. PLAN Rear Admiral Du Jingchen, the mission's first\ncommander made clear that China would not accept assignments from \"other regional\norganizations or countries.\"23 Combating piracy alongside other world navies strengthens\nChina's claims of accepting greater international responsibility, however its unambiguous\ndeclaration against joining operations with non-Chinese command raises questions on\nChina's actual willingness to cooperate with the international community.\nWhile becoming a member of a multi-national task force would demonstrate\nBeijing's greater commitment to the international system and potentially enhance the\neffectiveness of anti-piracy operations through improved coordination and planning, it\nwould also force Chinese commanders to give up some authority to non-Chinese officers.\nUnder this type of arrangement, Chinese assets could theoretically be tasked to carry out\nmissions that do not serve Chinese interests, such as patrolling a given geographical area,\nrather than escorting Chinese-owned vessels. Although China has opted to steer clear of\njoining a multinational task force, the PLAN does participate in information sharing and\ncoordination with other navies in the region.24\nChina's reluctance to place its anti-piracy force under international command is a\ndeparture from its behavior in United Nations peacekeeping operations, the other major\n23 \"Backgrounder: Chinese Navy sends most sophisticated ships on escort mission off Somalia,\" Xinhua. 26\nDecember 2008. Lexis Nexis.\n24 \"Japan, China to Coordinate Moves on Anti-Piracy,\" Japan Economic Newswire. 5 March 2009. Lexis\nNexis.\n\nfacet of China's participation in international military operations other than war. China\nroutinely authorizes its troops deployed on peacekeeping missions to fall under foreign\ncommand, and at the time of writing, a Chinese officer has only commanded one of the\ntwenty-two missions where China has contributed personnel.25 No publicly available\nChinese government information explains Beijing's rationale for allowing non-Chinese\ncommand in peacekeeping missions but not in anti-piracy operations, however\ndifferences in the conditions surrounding the two types of operations allow this paper to\noffer two potential explanations. First, the three current multinational anti-piracy task\nforces are each led by western powers or western organizations of which China is not a\nmember. The United States established Combined Task Force 151 (CTF-151) and\ncontributes a bulk of forces assigned to the task force, NATO heads Operation Allied\nProtector, and the European Union organized Operation Atalanta. China's lack of\nmembership in either the Atlantic or European based organizations precludes its\nparticipation in the EU and NATO missions, while domestic political and status concerns\nmake it unlikely that China will contribute forces to an operation rotationally commanded\nby an American admiral\nIn contrast to anti-piracy missions led by western states and organizations, the\npeacekeeping operations where China has contributed personnel are planned and carried\nout by the United Nations. Not only does China's membership in the UN enable its forces\nto participate in these missions, but any changes to the mission or mandate of UN peace\noperations must be approved by a UN Security Council Resolution. As a permanent\n25 A list of missions where China has contributed personnel to UN Peace Operations is available as an\nappendix to China's National Defense in 2008. (Beijing: Information Office of the State Council of the\nPeople's Republic of China, 2009).\n\nmember of the Security Council, China has significant influence over the content and\npassage of any Resolution. Additionally, United Nations member states select the\nparticular missions where they will contribute troops and can withdraw their forces at any\ntime. The power to shape peace operation mandates combined with the ability to\nselectively contribute forces likely outweighs the importance of having a Chinese\ncommander on the ground. The UN force commander executes a mandate in which China\nhas a significant say, and China can withdraw its forces should the force commander\nmade a tactical or operational level decision with which the Chinese disagree. In a\nhypothetical case where China participated in a western-led anti-piracy operation, China\nwould likely have the ability to selectively contribute and withdraw its forces, but would\ncertainly not have the same level of influence in high level planning as it does in the\nUnited Nations.\nA second potential explanation for China's avoidance of participation in a\nmultinational anti-piracy task force stems from the secrecy surrounding China's military\noperations and capabilities. China has a long strategic heritage that emphasizes secrecy in\nmilitary affairs that has endured into the current security environment.26 As described\nlater in this paper, the destroyers China deployed on anti-piracy operations are among the\nmost modern in the PLAN fleet. Submitting these vessels to foreign command could\nreveal capabilities or shortcomings of the advanced warships. Similarly, China has also\navoided deploying advanced equipment such as helicopters to UN peace operations, in\n26 Discussion of secrecy and the need to hide true capabilities in Chinese strategic thinking dates back to the\nwritings of Sun Tzu in the Art of War in 500 BC.\n\npart due to concerns about revealing Chinese capabilities.27 Thus, peace operations\ncarried out by the UN rarely include advanced weapons systems, and China's\ncontributions have been limited primarily to military observers, police officers, and\nrelatively low-tech medical, engineering, and transportation units.28\nBeijing's decision to launch an anti-piracy operation may have been motivated by\nanti-piracy deployments made by other nations, notably its Security Council counterparts,\nIndia, and Pakistan. China was the last of the five permanent members of the United\nNations Security Council to commit forces to combat pirates off the coast of Somalia,\nand India deployed a Talwar-class frigate to the Gulf of Aden to protect its shipping\ninterests in October 2008. Prior to deploying its own anti-piracy forces, China relied on\nother countries to rescue Chinese vessels in distress. For instance, a Malaysian navy\nhelicopter and warship responded to a distress call from the Chinese owned Zhenhua 4\ncargo ship after it was boarded by pirates.29 The Malaysian helicopter fired warning shots\nat the pirates' skiff and rescued the thirty-member Chinese crew. Malaysia deployed\nnaval forces to the Gulf of Aden after two Malaysian commercial ships were hijacked in\nthe region. China may have felt obligated to deploy forces in order to prevent itself from\nbeing accused as a free-rider and to maintain its status in light of anti-piracy deployments\nby other actors.\nDespite not fully demonstrating China's commitment to the international system,\nBeijing has taken three significant steps to enhance cooperation and openness with the\n27 China's Growing Role in UN Peacekeeping, (New York: International Crisis Group, 2009), 29.\n28 Ibid, 9-10.\n29 Tham Choy Lin, \"China Thanks Malaysia for Pirate Rescue.\" Malaysian National News Agency.\nAvailable online: < http://www.bernama.com/bernama/v5/newsindex.php?id=379891>. Accessed 25\nMarch 2009.\n\ninternational community. First, the PLAN flotilla has responded to the distress calls of\nnon-Chinese vessels under pirate attack in the Gulf of Aden, and has also provided escort\nto several non-Chinese ships. This demonstrates a commitment to the 1982 United\nNations Convention on the Law of the Sea, which states, \"All States shall cooperate to\nthe fullest possible extent in the repression of piracy on the high seas or in any other\nplace outside the jurisdiction of any State.\"30 Second, China has coordinated information\nsharing with the United States and potentially with France and Japan.31 Media reports\nindicate that the United States has provided China with imagery intelligence and weather\ninformation. This would be a step toward Chinese participation in multilateral military\noperations. Third, China has been extremely transparent with its participation in this\nmission. The PLA established a regularly updated English language website that provides\ninformation on its anti-piracy operations. The site even outlines tactics and procedures\nused by the PLAN in conducting their operations. Additionally, the PLAN has reportedly\nembedded journalists from seven media organizations, including a representative from\nthe Hong Kong-based Phoenix TV, onboard the ships. This marks the first time that a\nnon-state-run media outlet has been invited to accompany a PLAN mission.32 This type\nof openness stands in stark contrast to other realms of the Chinese military, where\ninformation is either unavailable or highly limited.\nWhile the realist motivation to protect Chinese shipping interests is likely the key\ndriver behind China's decision to launch an anti-piracy mission, the other factors\n30 United Nations Convention on the Law of the Seas. Available online:\n<http://www.un.org/Depts/los/convention_agreements/texts/unclos/unclos_e.pdf>\n31 \"Japan, China to Coordinate Moves on Anti-Piracy,\" Japan Economic Newswire. 5 March 2009. Lexis\nNexis.\n32 Krisitn Kwok, \"PLA ships leave for Somalia pirate patrols,\" South China Morning Post. 27 December\n2008. Lexis Nexis.\n\ndescribed above may have played a role in China's decision-making process. The mix of\nprotecting China's diplomatic and commercial interests, enhancing China's status as a\nresponsible actor, and participating alongside world navies combating an international\nthreat is largely in line with China's policy of peaceful development, which was first\nproclaimed in 2003. Under peaceful development, China will avoid the tension that is\noften associated with the growth of a rising state, while striving to create a stable global\nenvironment that facilitates China's continued development as an economic and\ndiplomatic power.33\nTraining\nIn combating Somali pirates, China is relying on military forces to help further its\npeaceful development, affording the PLAN with valuable operational experience. The\nChinese anti-piracy operation has been described as a training opportunity that serves a\nprecursor to future long-range PLAN operations.34 While the PLAN will undoubtedly\ngain significant experience from its first long-range operational deployment, it is unlikely\nthat training benefits were factored into China's decision to launch the anti-piracy task\nforce. The Chinese military was allegedly reluctant to deploy vessels to Somalia, and did\nso only after two months of pressure from the Ministry of Foreign Affairs (MFA).35\nExamining the potentially divergent interests of Chinese military and diplomatic actors is\nbeyond the scope of this paper, but it is unlikely that the MFA's appeals for the mission\nwere motivated by a desire to increase military training opportunities.\n33 Zheng Bijian, \"China's 'Peaceful Rise' to Great-Power Status\" Foreign Affairs 84 (September/October\n2005), 22-24.\n34 Weitz, 34-35.\n35 China's Growing Role in UN Peacekeeping, (New York: International Crisis Group, 2009), 26.\n\nDespite not being a primary driver for participation in the anti-piracy operation,\nthe mission in the Gulf of Aden has allowed China to refine many of the tasks required to\nsustain long-range, blue water naval operations, such as underway replenishment,\ncoordination with foreign navies, and communication.36 A senior PLA officer at the\nstrategy institute of China's National Defense University announced that \"the results of\nparticipating in this kind of action are not just about gaining experience at combating\npirates. It is even more about raising the ability to perform missions on seas far away.\"37\nThe anti-piracy operation provides an ideal chance for the PLAN to practice and evaluate\nvarious blue water tactics, techniques, and procedures in an environment far from the\nChinese periphery, without generating significant political or military alarm. The\ninternational nature of piracy as defined by the United Nations Convention on the Law of\nthe Seas combined with United Nations Resolutions calling for action against Somali\npirates has helped to legitimize Chinese actions and minimized fears of a \"China threat\"\nstemming from the long-range deployment. The implications of these lessons on future\nPLAN operations are addressed later in this paper.\nComparative Campaign Analysis\nThis section analyzes China's anti-piracy deployment in addition to the missions\nlaunched by Russia, India, NATO, the UN, and the US-led Combined Task Force (CTF)\n151. The analysis attempts to determine what event led the nation to deploy its anti-\npiracy operation, reviews the assets involved in each operation, and examines the tactics\nand rules of engagement employed by each force. A comparative campaign analysis\n36 Weitz, 34.\n37 Weitz, 34.\n\npotentially allows for a better understanding of the intentions and objectives (ends) of\neach anti-piracy actor by examining their strategy (ways) and deployed assets (means).\nThis analysis relies entirely on unclassified material including news media,\ngovernment announcements, and openly available reports on the capabilities of naval\nassets. While this information provides a foundation for campaign analysis, certain\ndetails regarding rules of engagement, tactics, and equipment specifications will remain\nclosely guarded secrets of the participating states. Information concerning the date a\nmission is launched and the assets deployed is openly available, however the justification\nfor a mission launch along with rules of engagement and tactics must be derived from\npublished descriptions of participant state actions.\nChina\nStrategy and Tactics\nThe PLAN anti-piracy flotilla was launched in late December 2008 in response to\nincreasing pirate attacks in the Gulf of Aden, and is tasked with escorting Chinese vessels\nthrough the region. According to Rear Admiral Xiao Xinnian, deputy chief of staff of the\nPLAN: \"The Chinese naval vessels will generally adopt three methods when performing\ntheir escort mission: Upon finding suspicious ships at sea, the Chinese side will first send\nshipborne helicopters to conduct reconnaissance before sending its naval vessels to\napproach them. Second, if pirates are engaged in robbery and if our conditions and\ncapabilities permit us to stop them, the Chinese side will adopt appropriate measures in\nlight of the circumstances. If the Chinese side encounters unprovoked attacks by pirates,\n\nit will resolutely defend itself and ensure its own safety.\"38 The official description of the\nmission focuses solely on locating and responding to specific pirate threats and omits key\ndetails of the Chinese operation. First, it makes no mention of the actual escort of\nChinese vessels, although the protection of Chinese ships is the primary mission of the\nPLAN flotilla. Second, it does not describe the \"appropriate measures\" that will be used\nto respond to pirates. Many other missions in the region describe the process by which\nthey, or regional African allies, will prosecute captured pirates. China's decision to omit\nthis information may stem from a desire to appear as a responsible actor making a\ncontribution to the international community, rather than solely protecting China's\nnational interests. China may have left the definition of \"appropriate actions\"\nintentionally vague because of its commitment to respecting state sovereignty. Arresting\nand potentially trying pirates in the Chinese legal system could be viewed as a violation\nof Somali sovereignty.\nThe PLAN has escorted convoys of Chinese ships as well as responded to distress\ncalls of non-Chinese ships under pirate attack. Each month, the Chinese Ministry of\nCommunications releases escort plans to Chinese shipping companies who can then\nsubmit applications to the Ministry of Communications and the PLAN.39 Chinese\nwarships then lead convoys of ships through the Gulf. In emergency situations, ships can\nrequest assistance from the PLAN flotilla via email or emergency radio channels. One of\nthe first direct engagements between Chinese forces and Somali pirates occurred in late\n38 \"Chinese scholars, officers examine significance, purpose of anti-piracy mission.\" Xinhua, reported by\nBBC Monitoring Asia-Pacific. 25 December 2008. Lexis Nexis.\n39 Tian Yuan and Qian Xiaohu, \"Chinese naval escorting formation reminds ships to pay attention to sailing\nsafety\" PLA Daily. 3 March 2009. Available online: <http://english.chinamil.com.cn/site2/special\nreports/2009-03/03/content_1673945.htm>. Accessed 27 March 2009.\n\nFebruary 2009, when the PLAN responded to a request for assistance from the Liberian-\nflagged, Italian cargo ship Lia. Upon receiving distress calls, China scrambles naval\nhelicopters carrying special-forces personnel to intercept the attacking pirates. Once\narriving on scene, the Chinese helicopter fires warning shots or flares at the attacking\npirates.40 At the time of this writing, Chinese forces have not had to escalate the use of\nforce beyond warning shots as attacking pirates generally flee after PLAN forces arrive.\nHowever, the PLAN vessels are equipped with modern weapon system, which could be\nused against pirates if they fail to respond to non-lethal warnings.\nWhile China's Gulf of Aden security operation safeguards Chinese shipping\nvessels, it seems to offer little protection to Chinese fishermen sailing off the coast of\nSomalia. This is surprising as non-Somali vessels, including those operated by Chinese\nstate-owned fishing enterprises, routinely fish near the Somali coast. Much industrial\nfishing occurs in the waters from Mogadishu to the Kenyan border, which is known for\nits diversity of fish species, including stocks of grouper and snapper.41 The November\n2008 hijacking of the state-owned Tianyu 8 fishing vessel and its 24-member crew\noccurred near the Kenyan border and was the first seizure of a mainland owned ship by\nSomali pirates.42 While the decision to deploy Chinese naval forces to the Gulf of Aden\nand not to fishing areas in the Indian Ocean could be justified by higher vessel traffic in\nthe sea lanes of the Gulf, it is also possible that China does not want to visibly support\nviolations of Somalia's exclusive economic zone. In 2005, the United Nations estimated\n40 \"Across China On-board Wuhan\" Chinadaily.com.cn. 31 January 2009. Lexis Nexis.\n41 Fishery Country Profile: Somalia. Food and Agriculture Organization of the United Nations. January\n2005. Available online: < http://www.fao.org/fishery/countrysector/FI-CP_SO/en>. Accessed 14 April\n2009.\n42 \"Chinese fishing boat reported hijacked off Kenya\" Associated Press. 14 November 2008. Lexis Nexis.\n\nthat 700 foreign-owned vessels were engaged in unlicensed fishing in the Somali EEZ,\nand Somali pirates have used illegal fishing to justify their actions as defenders of\nSomalia's territorial waters.43 China would appear to be hypocritical if it protected\nChinese shipping vessels violating Somalia's EEZ, while at the same time remaining\nhighly protective of its own EEZ.\nEquipment and Organization\nThe flotilla currently deployed to the Gulf of Aden consists of three of the\nPLAN's most advanced ships. The Lanzhou-class guided missile destroyer Haikou\n(DDG-171) and the Guangzhou-class destroyer Wuhan (DDG-169) are among the\nPLAN's newest destroyers. Both are indigenously produced and are equipped with a\nvariety of surface to air missiles, anti-ship missiles, torpedoes and sensors.44 The Haikou\nmay also have the capability to transmit information to other ships over data link or\nsatellite communications, something that could greatly enhance the effectiveness of the\nanti-piracy mission by rapidly disseminating information on the location of suspected.\nEach destroyer is also equipped with a Russian-built Kamov Ka-28 helicopter. The\nPLAN Ka-28s are capable of operating up to 200 kilometers from the host destroyer,\ngreatly expanding coverage for the anti-piracy operations.45 During the current mission,\nPLAN helicopters have been launched to respond to and deter attacks and have also been\nused in vertical resupply missions that allow for the transfer of goods between supply\n43 Fishery Country Profile: Somalia, 2005.\n44 \"Type 052C (Luyang-II Class) Missile Destroyer,\" Sino Defence.com. Available online: <\nhttp://www.sinodefence.com/navy/surface/type052c_luyang2.asp> and \"Type 052B (Luyang-I Class)\nMissile Destroyer,\" Sino Defence.com. Available online: <\nhttp://www.sinodefence.com/navy/surface/type052b_luyang.asp>. Both accessed 14 April 2009.\n45 Ibid.\n\nvessels and the destroyers while underway.46 The two destroyers are accompanied by the\nsupply ship Weishanhu, the largest of its type in the PLAN fleet. During the deployment,\nthe Weishanhu replenished its stores of fuel, water, and food in the Port of Aden,\nproviding the PLAN with \"a beneficial trail of logistics support mode by the Chinese\nNavy in performing military operations other than war abroad.\"47\nThe three-ship group likely makes up a zhidui (支队), an organizational grouping\nof vessels that is best translated as a flotilla. This paper assumes the group is a zhidui\nbecause flotillas are generally a division leader-grade command, led by either a Senior\nCaptain or Rear Admiral. The anti-piracy mission is commanded by a PLAN Rear\nAdmiral. When a zhidui conducts mobile task-force operations, it reports to its fleet\nheadquarters, which in turn is responsible to PLAN Headquarters in Beijing. This differs\nfrom traditional operations, where support bases serve as a link between fleet\nheadquarters and the zhidui.48 The command structure for this mission may be even more\ndirect, going directly from PLAN Headquarters to the flotilla. Chinese ships requesting\narmed escorts are instructed to contact the national Ministry of Communication.49 Given\nthe high profile nature of this mission, the Ministry of Communication may coordinate\n46 \"Chinese ship carries supplies for naval escort fleet,\" PLA Daily. 1 February 2009. Available online:\n<http://english.chinamil.com.cn/site2/special-reports/2009-02/01/content_1638575.htm>. Accessed 27\nMarch 2009.\n47 Tian Yuan and Qian Xiaohu. \"'Weishanhu' ship accomplishes first replenishment at foreign port.\" PLA\nDaily. 25 February 2009. Available online: < http://english.chinamil.com.cn/site2/special-reports/2009\n02/25/content_1665345.htm>. Accessed 19 March 2009.\n48 China's Navy 2007. (Office of Naval Intelligence, 2007), 4-5. Available online:\n<http://www.fas.org/irp/agency/oni/chinanavy2007.pdf>. Accessed 27 March 2009.\n49 Tian Yuan and Qian Xiaohu, \"Chinese naval escorting formation reminds ships to pay attention to sailing\nsafety\" PLA Daily. 3 March 2009. Available online: <http://english.chinamil.com.cn/site2/special\nreports/2009-03/03/content_1673945.htm>. Accessed 27 March 2009.\n\nwith the national-level PLAN Headquarters, which in turn may pass instructions to the\nmission commander.\nThe selection of a relatively senior PLAN officer to lead the three-ship fleet\nemphasizes the importance of the mission to China. On 26 December 2008, the PLAN\nappointed Rear Admiral Du Jingchen as the commander of the anti-piracy mission. Prior\nto assuming command, Du served as the Chief of Staff of the PLAN's South China Sea\nFleet, where he was responsible for directing the operations of the command\norganization. Admiral Du also visited the United States as part of a military delegation in\nJuly 2008, one of a small number of senior Chinese military officers who have traveled to\nthe United States. Additionally, Du has operational experience commanding a search and\nrescue operation in May 2002 following the crash of a China Northern Airlines flight off\nthe coast of Dalian.50 This blend of past operational experience, interaction with foreign\nmilitaries, and leadership at the fleet headquarters level likely made Admiral Du an\nappealing candidate to command a mission where PLAN forces would be engaged in a\nhigh operations tempo environment in close proximity to a multi-national naval task\nforce.\nThe deployment of warships from multiple nations, many of which are wary of\neach other, has created a unique operating environment for Chinese naval forces. Chinese\nacademics and senior military officers admit that while there may be small disagreements\nand some \"secretive reconnaissance,\" military powers will likely not engage in\n50 \"People/Points No.2 2009,\" Beijing Review. 4 January 2009. Available Online: <\nhttp://www.bjreview.com.cn/newsmaker/txt/2009-01/04/content_173065.htm>. Accessed 13 March 2009.\n\ndisputes.51 Despite not joining a coalition task force, China vowed to cooperate with\nforeign navies operating in the region. The United States reportedly provided China with\ninformation concerning anti-piracy operations, and viewed the mission as \"a springboard\nfor a resumption of dialogue between PLA forces and U.S. Pacific Command forces.\" 52\nAdditionally, the navies of Japan and South Korea have each discussed coordination with\nChinese anti-piracy forces. The Japanese Maritime Self Defense Force and the PLAN are\nconsidering sharing intelligence on pirates, while the Korean military has agreed to assist\neach other in combating pirates and will assist each other in emergencies. This was the\nfirst instance of cooperation in international operations between the Chinese and Korean\nmilitaries.53 These cooperative efforts will help foster understanding between militaries\nand will be a step toward enhancing military transparency. Although the cooperation\nseems limited to operations in the Gulf of Aden, they may set the foundation for future\npeaceful engagement in\nWhile anti-piracy operations have allowed China to enhance cooperation with its\nEast Asian neighbors, it has also led to increased tensions between India and China.\nChina accused the Indian Navy of using an attack submarine to stalk the PLAN flotilla\nwith a Kilo-class attack submarine.54 Chinese media reports suggest that the Chinese\nvessels and Indian submarine became locked in a half-hour long standoff in which \"both\n51 \"Cooperation in Gulf Mission 'Smooth.'\" Chinadaily.com.cn. 19 February 2009. Lexis Nexis.\n52 \"Fight Against Pirates Could Mend U.S.-China Ties.\" AFP. 18 December 2008. Available online: <\nhttp://www.defensenews.com/story.php?i=3870763>. Accessed 13 March 2009.\n53 \"Korean, Chinese Military to Join Hands in Fighting Pirates.\" The Chosun Ilbo. 26 March 2009.\nAvailable Online: < http://english.chosun.com/w21data/html/news/200903/200903260021.html>.\nAccessed 28 March 2009 and \"Japan, China to coordinate moves on antipiracy missions off Somalia.\"\nJapan Economic Newswire. 5 March 2009. Lexis Nexis.\n54 \"Indian Submarine, Chinese Warships Test Each Other in Pirate Waters.\" Indian Express. 5 February\n2009. Lexis Nexis.\n\nsides\ntried\nto\ntest\nfor\nweaknesses\nin\nthe\nother's\nsonar\nsystem.\"\nThe standoff reportedly ended when the PLAN destroyers forced the Indian submarine to\nsurface and leave the area.55 This incident marked the first military standoff between\nChina and India since a 1987 border skirmish.\nNATO and the European Union\nThe European Union launched Operation ATALANTA, its first naval operation,\non 8 December 2008 to support United Nations Security Council Resolutions in order to\nprotect vessels delivering World Food Program food aid and to protect vulnerable vessels\nin the Gulf of Aden by deterring and preventing acts of piracy. To accomplish this\nmission the operation is mandated to: provide protection to vessels chartered by the\nWorld Food Program, to provide protection to merchant vessels, and to take the\nnecessary measures, including the use of force to deter, prevent, and intervene in order to\nbring to an end acts of piracy and armed robbery.\"\nThe operation will include at least six frigates and three maritime patrol aircraft,\nwhich will be initially deployed for one year. Many of the vessels assigned to the mission\nare from NATO's Standing Maritime Group One, which has previously participated in\nanti-piracy operations in the Gulf of Aden. Additionally, the EU mission regularly\ncoordinates with vessels from NATO's anti-piracy operations and the American-led CTF\n55 Gurmukh Singh, \"Indian Submarine, Chinese Ship in Standoff Near Somalia: Chinese Media.\" Indo-\nAsian News Service. 4 February 2009. Lexis Nexis.\n\n151 to respond to suspected attacks.56 The operation can arrest and detain suspected\npirates, who can be tried either by an EU Member State or by the Kenyan government.\nWhile the Operation ATALANTA mandate specifies that the EU will protect\nvulnerable ships, press releases indicate that escorts have been limited largely to ships\nchartered by the World Food Program to carry humanitarian aid. Escorts for ship escorts\nhave been denied by the German government, a contributor to the EU force, leading\nvessels to modify their sailing plans.57 For now, the mission of Operation ATALANTA\nseems to fall under the realm of cooperative security. Most of the assets assigned to the\noperation appear to be escorting World Food Program vessels and responding to distress\ncalls from vessels transiting the International Traffic Zone.\nThe first NATO anti-piracy task force was launched in October 2008, but was\nreplaced two months later by the EU mission. The initial mission, Operation Allied\nProvider, provided escorts to vessels chartered by the World Food Program, resulting in\nthe safe delivery of 30,000 metric tons of humanitarian aid to Somalia.58 The four vessels\nand over 1000 officers and sailors that participated in Allied Provide were assigned to\nStanding NATO Maritime Group 2, and were supported by auxiliary and supply ships\nfrom several NATO nations.59 In March 2009, NATO announced that it would resume its\nanti-piracy operations by deploying Standing NATO Maritime Group One (SNMG1)\n56 \"EU ATALANTA and American CTF Warships Join Forces to Prevent Hijacking.\" Maritime Security\nCentre-EU NAVFOR Somalia. 3 March 2009. Available online:\n<http://www.mschoa.eu/display.aspx?articlename=47>. Accessed 25 March 2009.\n57 \"Cruise Ship will Evacuate to Avoid Pirate Attack.\" Associated Press. 9 December 2008. Lexis Nexis.\n58 \"Successful Completion of NATO mission Operation Allied Provider.\" Press Release, Allied Command\nOperations, Supreme Allied Powers Europe. 12 December 2008. Available online: <\nhttp://www.nato.int/shape/news/2008/12/081212a.html >. Accessed 27 March 2009.\n59 Ibid.\n\nfrom Souda Bay to the Horn of Africa as part of Operation Allied Protector.60 The\nStanding Group consists of six to ten frigates or destroyers under the command of a rear\nadmiral from one of the ship contributing nations. Like the EU operation, NATO forces\nare tasked with serving as a deterrent against pirates; defending, disrupting and protecting\nagainst pirate attacks, including boarding suspected pirate vessels; establishing ad-hoc\ncooperation and coordination with non-NATO organizations in the region; enhancing\nstability within the international recommended transit corridor; and providing naval\nescort to humanitarian aid supply and other vessels if requested and authorized.61\nThe significant mission overlap between the NATO and EU operations leads to\nquestions on why there are two simultaneous European ant-piracy operations. One\npotential explanation is that the EU deployment along with the other missions in the Gulf\nof Aden was having only a limited impact on deterring pirate activity, and than additional\nwarships would lead to more robust anti-piracy operations. An alternative explanation is\nthat both the European Union and NATO are continuing to shape the role of their military\nforces. Combating pirates is viewed by both organizations as a means of enhancing their\nroles in addressing collective security concerns.62\nThe United States\nThe United States launched its first dedicated anti-piracy mission in the Gulf of\nAden in January 2009 to \"create a lawful maritime order and develop security in the\n60 Slobodan Lekic, \"NATO Resuming Anti-Piracy Mission.\" Associated Press. 26 March 2009. Lexis\nNexis.\n61 Operation Allied Protector. Brochure, North Atlantic Treaty Organization. Available online: <\nhttp://www.manw.nato.int/pdf/web_copy_op_allied_protector.pdf >. Accessed 27 March 2009.\n62 NATO Resumes Anti-Piracy Operations. Press Release, North Atlantic Treat Organization. 13 March\n2009. Available online: <http://www.nato.int/shape/news/2009/03/090313a.html>. Accessed 27 March\n2009.\n\nmaritime environment.\"63 Prior to the creation of Combined Task Force 151 (CTF-151),\nAmerican warships assigned to Standing NATO Maritime Groups and CTF-150 patrolled\nthe region. Although CTF-150 was tasked with anti-piracy missions, it was established at\nthe outset of Operation Enduring Freedom to conduct maritime security operations such\nas deterring drug and weapons trafficking in the Gulf of Aden, the Gulf of Oman, the\nArabian Sea, the Red Sea, and the Indian Ocean. The establishment of CTF-151\nostensibly allows CTF-150 to focus on maritime security operations related to the Global\nWar on Terrorism while the new task force concentrates solely on anti-piracy\noperations.64 While establishing CTF-151 will allow enhanced concentration on\ncombating piracy, a force that is distinct from the one that supports US operations in Iraq\ncould lead to participation by nations that oppose the war in Iraq.\nAccording to the commander of US Naval Forces, Central Command, the\norganization responsible for CTF-151, the goal of the US-led task force is \"dis\nincentivizing piracy.\"65 Accordingly the mission of the force is to disrupt, deter and\ncapture suspected pirates, and to hold them accountable for their crimes by trying them in\ncivilian courts in Kenya. At the start of the mission, the task force consisted of three\nships, the amphibious transport dock USS San Antonio, the guided missile destroyer USS\nMahan, and British frigate HMS Portland. These warships provided the task force with\nMarines, a military police detachment, intelligence personnel, a medical team, and HH\n63 \"New Counter-Piracy Task Force Established.\" Navy.mil. 8 January 2009. Available online:\n<http://www.navy.mil/search/display.asp?story_id=41687>. Accessed 30 March 2009.\n64 \"New Counter-Piracy Task Force Established.\" Navy.mil. 8 January 2009. Available online:\n<http://www.navy.mil/search/display.asp?story_id=41687>. Accessed 30 March 2009.\n65 \"New Central Command Unit Makes it Tough to be a Pirate.\" US Central Command. Available online:\n<http://www.centcom.mil/en/news/new-centcom-unit-makes-it-tough-to-be-a-pirate.html>. Accessed 20\nMarch 2009.\n\n60H utility helicopters.66 Additional coalition vessels as well as civilian-operated ships\nfrom America's Military Sealift Command joined the mission after its initial\nestablishment. In addition to the ships and manned aircraft assigned to the mission, the\ntask force also relies on unmanned aerial vehicles for airborne surveillance missions.67\nThe assets assigned to the task force monitor maritime traffic, perform routine queries of\nvessels, and conduct ship boardings using Coast Guard law enforcement detachments and\nNavy vessel boarding, search, and seizure teams.68 Press releases suggest that the US-led\ntask force provides a deterrent presence and responds to distress calls, rather than\nescorting vessels like the Chinese fleet.\nRussia\nRussia launched its anti-piracy operations on 26 September 2008. The Russian\nNavy announced the deployment of the Baltic Fleet frigate Neustrashimy to Somalia with\nthe stated mission of \"ensur[ing] security in several regions of the world oceans\" and\nprotecting Russian citizens and commercial vessels.69 The Neustrashimy is a general\npurpose frigate that incorporates stealth technology. The ship is equipped with a Ka-27\nASW helicopter and is armed with SS-N-25 anti-ship missiles, SA-N-9 surface to air\nmissiles, torpedoes, a 100-mm gun, and depth charges.70\n66 Brian Goodwin, \"San Antonio Key to Counterpiracy Mission.\" Navy.mil. 17 January 2009. Available\nonline: <http://www.navy.mil/search/display.asp?story_id=41844>. Accessed 30 March 2009.\n67 Monique K. Hilley, \"Mahan UAV at Forefront of 21st Century Readiness.\" US Navy. 24 February 2009.\nAvailable online: <http://www.navy.mil/search/display.asp?story_id=42801>. Accessed 30 March 2009.\n68 Chad R. Erdmann, \"Mahan Implements Maritime Strategy During Counterpiracy Operations.\" US Navy.\n27 January 2009. Available online: <http://www.navy.mil/search/display.asp?story_id=42084>. Accessed\n30 March 2009.\n69 http://en.rian.ru/russia/20080926/117144421.html\n70 \"Russia Sends Warshp to Fight Piracy Near Somalia.\" Novosti. 26 September 2008. Available online: <\nhttp://en.rian.ru/russia/20080926/117144421.html>. Accessed 25 March 2009.\n\nThe Neustrashimy was deployed on the same day the Ukrainian-operated cargo\nvessel, MV Faina, was hijacked. At the time of the hijacking, the Faina was captained by\na Russian and manned by seventeen Ukrainians, a Latvian, and two additional Russian\nsailors. The ship was carrying thirty-three Soviet-made T-72 tanks and a large cache of\nammunition, small arms, rocket-propelled grenades and anti-aircraft guns allegedly\nbound for Southern Sudan.71 Although the deployment of the Russian frigate coincides\nwith the hijacking of the arms carrying freighter, planning for the deployment of the\nNeustrashimy likely began before the Faina was hijacked. The Russian Navy announced\nin June 2008 that it was prepared to deploy vessels to Somalia following the hijacking of\na cargo vessel crewed by Russian sailors.72 However, after the hijacking of the Faina, the\nNeustrashimy joined naval vessels from other nations that had surrounded the Faina to\nprevent the offloading of any weaponry.73\nLike China, Russia has chosen to conduct its operations independent of any\nestablished task-force, but considers itself to be supporting international anti-piracy\nefforts.74 Despite not participating in a multinational anti-piracy task force, Russian naval\nvessels deployed to the Gulf of Aden reportedly coordinate their actions with other\nwarships operating in the region.75 Similar to the Chinese, Russian naval vessels\ndeployed to the region escort transiting commercial vessels, including non-Russian\n72 \"Russian Navy Ready to Head for Somalia.\" Novosti. 3 June 2008. Available online: <\nhttp://en.rian.ru/russia/20080603/109146873.html>. Accessed 25 March 2009.\n73 \"Pirates Seize Indian Vessel Off Somalia.\" CBS News. 21 October 2008. Available online:\n<http://www.cbsnews.com/stories/2008/10/21/world/main4535303.shtml?source=RSSattr=World_4535303\n>. Accessed 25 March 2009.\n74 http://en.rian.ru/russia/20080926/117144421.html\n75 \"Neutrashimy patrol ship replenishes reserves, readying to patrol Gulf of Aden.\" ITAR-TASS. 28\nOctober 2008.\n\nships.76 Russian media has also reported that the Defense Ministry will consider\nproviding naval escorts on a commercial basis to non-Russian ships, although at the time\nof writing, there have been no government announcements that confirm this.77 In addition\nto escorting vessels, the Russian Navy has arrested suspected pirates and turned them\nover to Yemeni authorities for prosecution.78\nIndia\nIndia deployed a frigate to the Gulf of Aden on 18 October 2008 to escort its\ncommercial vessels in the region. Only one Indian dhow was seized by pirates prior to the\ndeployment, but roughly 30 Indian ships pass through the Gulf of Aden each month and\nnumerous ships of other nationalities with Indian crew members had been captured.79\nIndia provides one-sixth of the world's maritime workers.80 The decision to deploy an\nanti-piracy force was reportedly made after the September 2008 hijacking of the\nJapanese-owned chemical tanker MV Stolt Valor, which had a crew of 18 Indians.81 India\nlaunched its own mission rather than joining an existing task force because the largest\nnaval task force patrolling the region in October 2008 was the US and European led\n76 \"Russian Navy to Provide Services to Fight Somali Pirates.\" Pravda. 20 November 2008. Available\nonline: < http://english.pravda.ru/russia/economics/106726-1/>. Accessed 25 March 2009.\n77 \"Russian Navy to Provide Services to Fight Somali Pirates.\" Pravda. 20 November 2008. Available\nonline: < http://english.pravda.ru/russia/economics/106726-1/>. Accessed 25 March 2009.\n78 \"Russian Navy Transfers Detained Somali Pirates to Yemen.\" Novosti. 18 February 2009. Available\nonline: < http://en.rian.ru/world/20090218/120209688.html>. Accessed 25 March 2009.\n79 A list of ships attacked by Somali pirates is available at:\nhttp://en.wikipedia.org/wiki/List_of_ships_attacked_by_Somali_pirates. Accessed 19 March 2009. Also,\n\"India Emerges From Obscurity as New Global Force.\" Canberra Times. 24 November 2008.\n80 Anuh Chopra, \"India leads fight against Somali pirates.\" The Christian Science Monitor. 20 November\n2008. Lexis Nexis.\n81 Rajat Pandit, \"Commandos answer SOS from Saudi, Indian vessels, scare off pirates.\" The Times of\nIndia. 11 November 2008. Available online: <\nhttp://timesofindia.indiatimes.com/India/Navy_foils_Indian_ship_hijack_off_Aden/articleshow/3699918.c\nms>. Accessed 30 March 2009.\n\nCombined Task Force-150.82 In addition to combating piracy, CTF-150 was responsible\nfor supporting maritime operations in the North Arabian Sea as part of Operation Iraqi\nFreedom, the US-led war in Iraq, which India did not support.\nIndia's operation appears to be focused on escorting and protecting Indian ships,\nhowever the Tabar has assisted non-Indian ships. The Indian Navy has deployed the INS\nTalbar, a Russian-made Talwar-class frigate commissioned in 2004. The ship, which is\nassigned to India's Western Naval Command in Mumbai, is armed with a variety of\nsurface to air and surface to ship missiles as well as a 100-mm gun. The Tabar is also\nequipped with a Chetak utility helicopter. The mission differs from previous deployments\nin that the Indian Navy has been authorized to act autonomously. Previously, ships had to\nwait for orders from New Delhi before carrying out preventive and deterrent attacks. This\nallows greater flexibility for the mission commander and is representative of the\ninnovation in tactics and strategy that many navies are practicing in the region.83\nIndia's deployment has been largely successfully in preventing hijacking of\nIndian vessels, and no Indian flagged vessel has been captured since the India launched\nits deployment. On 11 November 2008, pirates attempted to board the MV Jag Arnav, a\nlarge cargo ship owned by Mumbai-based Great Eastern Shipping Company. After\nreceiving a distress call via a text message from the Jag Arnav, the INS Tabar launched a\n82 \"Indian wants UN force off Somalia after its ship is refused protection.\" Indo-Asian News Service. 14\nNovember 2008. Available online: < http://www.thaindian.com/newsportal/uncategorized/india-wants-un\nforce-off-somalia-after-its-ship-is-refused-protection_100118981.html> . Accessed 30 March 2009.\n83 Anuh Chopra, \"India leads fight against Somali pirates.\" The Christian Science Monitor. 20 November\n2008. Lexis Nexis.\n\nhelicopter carrying a team of Marine Commandos, which deterred the attack.84 The Tabar\nthen escorted the Jag Arnav to safety. Despite these successes, the Indian mission has not\nbeen entirely without flaw. One week after rescuing the Jag Arnav, the Tabar sunk a\nThai-owned fishing vessel with a crew of 15 Thais and one Cambodian. The Indians\ninitially suspected the vessel was a pirate mothership and was fired upon by individuals\nonboard the ship, however later reports indicate that the ship was in the process of being\nhijacked.85\nJapan and South Korea\nJapan and South Korea both announced their plans to deploy warships to the Gulf\nof Aden in early 2009, shortly after China launched its anti-piracy mission. Like China,\nthese deployments will be the first overseas operational naval combat mission for both\nKorea and Japan, and both nations will concentrate their deployments on protecting\ncommercial vessels from their home countries.\nOn 28 January 2008, Japan's Defense Minister ordered the Maritime Self Defense\nForce to prepare for an anti-piracy deployment in Somalia.86 The Japanese government\nviewed the pirate activities as a \"major threat not only to Japan but also to international\nsociety and it is a problem that [Japan] must deal with urgently.87\" Five Japanese-owned\nships were hijacked by Somali pirates before the initial announcement was made, more\n84 Rajat Pandit, \"Commandos answer SOS from Saudi, Indian vessels, scare off pirates.\" The Times of\nIndia. 11 November 2008. Available online: <\nhttp://timesofindia.indiatimes.com/India/Navy_foils_Indian_ship_hijack_off_Aden/articleshow/3699918.c\nms>. Accessed 30 March 2009.\n85 \"Indian navy 'sank Thai trawler'\" BBC News. 25 November 2008. Available online:\n<http://news.bbc.co.uk/1/hi/world/south_asia/7749245.stm>. Accessed 30 March 2009.\n86 \"Japan to deploy ships off Somalia.\" BBC News. 28 January 2009. Available online:\n<http://news.bbc.co.uk/2/hi/africa/7855120.stm>. Accessed 28 March 2009.\n87 Ibid.\n\nthan the number of Chinese vessels hijacked before the Chinese launched anti-piracy\noperations.88 Despite the perceived urgency, significant debate surrounded the\ndeployment of Japanese forces due to constitutional restrictions on the use of force. After\nmembers of Japan's ruling party argued that anti-piracy operations should be seen as law\nenforcement operations as opposed to strictly military operations, two Japanese\ndestroyers were authorized to deploy to Somalia in mid-March. The vessels will be\ndeployed under the maritime police action provision of the Self Defense Force law,\nmeaning that Japanese ships in the Gulf of Aden will only be able to protect ships owned\nby Japanese firms or flying the Japanese flag. To further demonstrate the law\nenforcement nature of the mission, officers from the Japan Coast Guard will be onboard\nthe destroyers in order to handle police-related matters such as the collection of evidence\nand arrest of suspects if pirates are found. This is similar to the American practice of\nusing Coast Guard boarding teams to carry out the law enforcement related task of\narresting suspected pirates.\nThe Japanese government is attempting to grant greater authority to its anti-piracy\nforce through a bill submitted to the Diet that will allow the Japanese warships more\nlatitude in engaging pirates, such as firing at pirate vessels that ignore warning shots.89\nThe bill may also allow Japanese destroyers to escort Chinese vessels and vice-versa.\nCurrently the Japanese are limited to serving as a deterrent force and to firing non-lethal\nwarning shots while protecting Japanese vessels. Although the Maritime Self Defense\n88 M/V Golden Nori (hijacked 28 Oct 07, released 12 Dec 07), M/V Stella Maris (hijacked 20 July 08,\nreleased 26 September 08), M/V Irene (hijacked 21 August 08, released 11 September 08), MT Stolt Valor\n(hijacked 15 September 08, released 16 November 08), MV Chemstar Venus (hijacked 15 November 08,\nreleased 12 February 09).\n89 Antipiracy task force heads for Somalia.\" The Japan Times. 15 March 2009. Available online:\n<http://search.japantimes.co.jp/cgi-bin/nn20090315a1.html>. Accessed 27 March 2009.\n\nForce will initially escort only Japanese vessels, it is difficult to determine whether Japan\nis acting entirely out of self-interest, as constitutional provisions prevent Japanese naval\nforces from protecting non-Japanese vessels.\nJapan deployed two destroyers, the Sazanami and the Samidare to the region. The\nSazanami is a Japanese-built Takanami-class guided missile and anti-submarine warfare\ndestroyer commissioned in 2005. It is equipped with a variety of weapons systems\nincluding a 127 mm gun. The Samidare, another indigenously built warship\ncommissioned in 2000 is equipped to carry out both anti-submarine and anti-ship\nmissions and is armed with weapons including the sea-sparrow anti-shipping missile and\na 76-mm rapid fire naval gun. Each of the ships is also equipped with two SH-60K\nhelicopters and two speed-boats that will likely be used as to rapidly respond to distress\ncalls.90 Japan also plans to deploy a land based P-3C patrol aircraft to the Gulf of Aden, if\nit is able to draft a status of forces agreement with the government of Djibouti, the\nAfrican country where Japan plans to base its aircraft.91 The P-3C, which is capable of\nmonitoring surface traffic, will greatly enhance Japan's situational awareness over the\nGulf of Aden and would represent the first Gulf of Aden deployment of a shore-based\npatrol aircraft by a nation that is not a member of any multinational coalition.92\nKorea deployed the Cheonghae unit to the Gulf of Aden in early March 2009.\nThe deployment followed the September 2008 hijacking of a South Korean bulk carrier,\nfour separate hijackings of Korean-owned fishing boats, and the hijacking of other ships\n90 \"Japan destroyers to set sail for antipiracy ops off Somalia.\" Yahoo! Asia News. 14 March 2009.\nAvailable online: < http://asia.news.yahoo.com/090313/kyodo/d96te21g1.html>. Accessed 29 March 2009.\n91 \"Antipiracy task force heads for Somalia.\" The Japan Times. 15 March 2009. Available online:\n<http://search.japantimes.co.jp/cgi-bin/nn20090315a1.html>. Accessed 27 March 2009.\n92 Operation Atalanta expects to operate at least 3 maritime patrol aircraft.\n\nwith South Korean crewmembers.93 The Korean naval unit consists of the Munmu the\nGreat, a 4,500 ton KDX-II destroyer, along with a Lynx helicopter, speedboats, and 300\nsailors, including 30 special operations troops.94 The KDX-II destroyer is equipped with\nHarpoon ship-to-surface missiles, RAM Mk 31 ship-to-air missiles, as well as an Mk 45\n127-mm gun. The Korean unit will operate with CTF-151 and will rely on existing\nlogistical infrastructure to support its operations.95 During the planned six-month mission,\nthe Korean Navy will escort South Korean commercial ships through the Gulf of Aden in\nan effort to protect Korean economic interests.96 The unit will also \"monitor, inspect, stop\nand seize\" pirate vessels as part of CTF-151.\nKorea's dual mission of providing support to the American-led task force while\nalso protecting domestic economic interests sets it apart from many other actors in the\nregion. While most independent anti-piracy actors such as China and Russia combat\npirates in addition to escorting their own vessels, Korea carries out non-escort anti-piracy\nduties as part of CTF-151 . Korea may have pursued this strategy in order to gain access\nto the logistical infrastructure of CTF-151, eliminating the need for Korea to deploy its\nown auxiliary ships or develop contractual agreements with service providers in ports.\nPrior to deploying its forces, a Korean team assessed infrastructure in Bahrain and\ndetermined that, \"There will be no problem regarding logistics support because [Korea]\n93 \"South Korean Ship Hijacked off Somalia\" Associated Press. 10 September 2008. Lexis Nexis.\n94 \"South Korea Launches Naval Unit Against Somali Pirates\" AFP. 3 March 2009. Lexis Nexis.\n95 \"Anti-Piracy Operations Off Somalia Face Challenges\" Korea Times. 9 February 2009. Lexis Nexis.\n96 Jung Sung-Ki. \"New S. Korean Naval Unit to Deploy to Somalia\" Defense News. 3 March 2009.\nAvailable online: < http://www.defensenews.com/story.php?i=3971516 >. Accessed 27 March 2009.\n\ncan use services from local companies contracted with other navies such as the United\nStates, Britain and Germany.\"97\nDiscussion\nA review of the major Gulf of Aden anti-piracy campaigns reveals that operations\ncan be broadly categorized as presence missions and escort missions. Presence missions\nfocus primarily on responding to distress calls, deterring acts of piracy by patrolling\nestablished safe transit zones, and escorting vessels carrying humanitarian aid. These\nmissions offer their services to ships regardless of their nation of ownership or registry,\nand are normally carried out by multinational task forces. Escort missions, which are\ngenerally launched by individual states provide armed escort to vessels from the\ndeploying state and also respond to distress calls of nearby ships. Additionally, the\nreview finds that most actors have deployed surface combatants such as destroyers and\nfrigates to combat Somali pirates. These warships are generally equipped with\ndetachments of special forces personnel, speed boats, and helicopters. These relatively\nlow tech assets greatly enhance the robustness of the anti-piracy forces by providing them\nwith a rapid response capability that extends the reach of the warships.\nChina and other independent anti-piracy actors focus their missions on providing\narmed escorts to their own commercial ships, confirming the hypothesis that China is a\nrealist actor seeking to protect its national interests. Dedicating warships to escort\nconvoys of merchant vessels is a far more effective method of anti-piracy force\nemployment for nations with realist motivations. Using a limited number of warships, the\n97 \"Anti-Piracy Operations Off Somalia Face Challenges\" Korea Times. 9 February 2009. Lexis Nexis.\n\nPLAN is able to protect a significant portion of Chinese shipping vessels passing through\nthe Gulf of Aden. In 2008, more than 1200 Chinese vessels passed through the Gulf of\nAden, amounting to just over 100 ships each month.98 By 6 February 2009, China had\ncompleted 15 escort missions, protecting 33 Chinese and Taiwanese ships.99 PLAN\nwarships first arrived in the Gulf of Aden on 6 January 2009, suggesting that only a third\nof Chinese vessels transiting through the region are provided with a PLAN escort.100 It is\nunlikely that China has denied escorts to Chinese ships as the PLAN has escorted non-\nChinese vessels, something that would likely be avoided if the flotilla was unable to meet\ndemand posed by Chinese ships. Even if all 1200 ships were to request an escort, this\nwould only amount to roughly four ships a day. Assuming an equal amount of eastbound\nand westbound traffic, 14 ships would travel in each direction weekly. Since the voyage\nthrough the Gulf of Aden takes just over two days, the PLAN destroyers operate could\neach escort three one-way convoys per week, assuming the destroyers operate\nindependently.101 Under this system, each destroyer would be responsible for about five\nChinese ships per escort mission. If they conduct escorts together, the flotilla would\nlikely still be able to meet the current level of demand, but would need to schedule\nconvoys in advance to prevent vessels from waiting long periods for the PLAN escort\nvessels.\n98 \"Chinese Navy Completes 15 Escort Missions in Gulf of Aden\" PLA Daily. 7 February 2007. Available\nonline: <http://english.chinamil.com.cn/site2/special-reports/2009-02/07/content_1644539.htm>. Accessed\n15 March 2009.\n99 Ibid.\n100 The actual percent of mainland vessels requesting escort may be slightly higher, as the figure of 1200\nships likely includes Taiwan ships, which are not officially authorized to request escorts.\n101 Two day voyage time based on Chinese press reports specifying the completion of 15 missions in\nroughly 30 days. Additionally, using a 10kts speed for the convoy, it would take approximately 45 hours to\ntransit the Gulf of Aden.\n\nPresence missions appear to be significantly less efficient than escort missions at\npreventing attacks against ships. Numerous ships have been hijacked off the Horn of\nAfrica since the various coalition missions have been in place. This inefficiency stems in\npart from insufficient presence in the pirate infested waters, which covers more than 1.1\nmillion square miles.102 At any given time, there are about twenty-seven ships from the\nEU, NATO, and CTF-151 operating in the waters off the Horn of Africa, meaning that\neach ship is responsible for protecting over 40,000 square miles. Admittedly, warships\nare likely concentrated in areas with high commercial traffic flows, but this illustrative\ncalculation demonstrates the vast surface area which must be protected. The US Navy\nclaims that sixty-one ships are needed to protect just internationally designated shipping\nlanes, which make up only a small portion of the pirates' operating area.103\nDespite the relative inefficiency of presence missions, they are a logical approach\nfor the multinational task forces deployed to the region. Protecting major shipping lanes\nand serving as a deterrent against acts of piracy enhances the security of all vessels\ntransiting through the Gulf of Aden and surrounding waters, while ensuring the relevance\nof multinational security organizations. Actions that improve the global security\nenvironment for all actors are means by which the EU and NATO can take an active role\nin carrying out their post-Cold War security strategies that revolve largely around\ncollective efforts aimed at building security and ensuring stability.\nChina's commitment to a long-term anti-piracy mission suggests that it will\ncontinue providing armed escorts even as pirate attacks in the region extend beyond the\n102 Donna Miles, \"Latest Ship Seizures Broaden Counter-Piracy Challenge\" Navy.mil. 27 March 2009.\nAvailable online: <http://www.navy.mil/search/display.asp?story_id=43830>. Accessed 27 March 2009.\n103 Ibid.\n\nGulf of Aden and further into the Indian Ocean. This would place PLAN escort vessels\nincreasingly closer to the Indian subcontinent and the operating area of the Indian Navy,\npotentially increasing tensions, such as additional naval confrontations, between China\nand India. As additional nations launch anti-piracy missions, the Gulf of Aden and Indian\nOcean will become increasingly complicated operating area patrolled by warships from a\nvariety of states and organizations, each with a unique set of strategic objectives. The\nregion may become a microcosm of geopolitical relations between rising and major\npowers. States may develop and expand bilateral relations by cooperating in the war\nagainst piracy, but the risk of confrontation remains as navies send their most advanced\nwarships to battle pirates in the region.\nImplications on the Future Roles of the Chinese Navy\nChina's deployment to the Gulf of Aden, along with analysis of discussion in\nChinese military and academic circles, has led to western speculation that the PLAN's\nmission may shift to the protection of strategic sea lanes of communication.104 Although\nthe current anti-piracy deployment represents a new type of mission for the PLAN that\nsignals an increased willingness to use military force to protect Chinese interests, the\nfocus of China's navy will likely continue to be the defense of Chinese territory and\nChina's periphery. Given China's strategic principle of winning local wars in conditions\nof informationization, the bulk of China's naval operations will likely remain\nconcentrated near China in order to respond to local crises that may emerge.105 In its\ndescription of \"the high-tech local wars that China may face in the future,\" the Chinese\n104 Andrew S. Erickson and Lyle Goldstein, \"Gunboats for China's New 'Grand Canals'?,\" Naval War\nCollege Review 62, no 2. (Spring 2009), 44-76.\n105 China's National Defense in 2008, 8.\n\nAcademy of Military Science's 2005 text, The Science of Military Strategy, lists potential\nwars stemming from ethnic extremism in China's border regions, conflicts over resources\nand territory in the Yellow Sea, the East China Sea, and the South China Sea, as well the\n\"key issue\" of a potential crisis with Taiwan.106 Even potential great power conflicts are\ndiscussed in the context of local area wars as the analysts who wrote the text describe\nChina as being geographically located in a region where the \"strategic interests of big\npowers meet.\"107 The Science of Military Strategy does briefly mention the protection of\nchannels of strategic energy supply, but addresses the topic in a chapter on local wars and\nChina's \"ecological and oceanic resources\" suggesting that the authors may have been\nreferring to ensuring security of resource flows and extraction in the South China Sea.108\nWhile the mission of the PLAN will likely continue to be centered on\nsafeguarding Chinese territory, recent Chinese military publications hint at a growing\nlong-range role that features a broader spectrum of missions in addition to territorial\ndefense. China's desire to develop naval capabilities is lucidly described in China's\nNational Defense in 2008, which states, the \"Navy has been striving to improve in an all-\nround way its capabilities of integrated offshore operations...and to gradually develop its\ncapabilities of conducting cooperation in distant waters and countering non-traditional\nsecurity threats, so as to push forward the overall transformation of the service.\"109 The\n2008 publication also places an emphasis on the development of capabilities in military\noperations other than war (MOOTW), such as anti-piracy operations. According to the\n106 The Science of Military Strategy. Peng Guangqian and Yao Youzhi, eds, (Beijing: Military Science\nPublishing House, 2005), 441-442.\n107 Ibid, 439\n108 Ibid, 446.\n109 China's National Defense in 2008, 23.\n\npaper, China \"takes MOOTW as an important form of applying national military forces,\nand scientifically makes and executes plans for the development of MOOTW\ncapabilities.\"110\nChina's anti-piracy mission in the Gulf of Aden afforded China the opportunity to\nemploy and test naval techniques and evaluate some of its newest equipment in an\noperational environment far from the PLAN's traditional operating area. The lessons\nlearned on sustaining long-range deployments, coordinating military operations in a\nmultinational environment, and general tactical and equipment operations skills will\nundoubtedly help shape and improve the PLAN's development in both traditional\nterritorial defense operations as well as in MOOTW scenarios. Indeed, the PLAN viewed\nthe escort mission as \"a test of the achievements of the PLAN in preparation for combats\n(sic).\"111 Upon his return to China in April 2009, Rear Admiral Du Jingchen, the\ncommander of the first Chinese naval escort task force announced that the operation was\na learning experience that revealed gaps in China's naval capabilities in areas such as\ncombat readiness training, organization, equipment development, comprehensive support,\nand laws and regulations.112 Du argued that the shortcomings should motivate a increased\npace in naval development, stating that, \"the escort mission can impel us to further update\nour concept and probe into new ways and new methods in naval building.\"113\n110 China's National Defense in 2008, 9.\n111 Qu Yang, \"'Firsts' created by first Chinese naval escort task force,\" PLA Daily. 29 April 2009.\nAvailable online <http://english.chinamil.com.cn/site2/special-reports/2009-04/29/content_1745054.htm >.\nAccessed 13 May 2009.\n112 Qu Yang, \"Du Jingchen: escort is conducive to naval building,\" PLA Daily. 29 April 2009. Available\nonline <http://english.chinamil.com.cn/site2/special-reports/2009-04/29/content_1745055.htm >. Accessed\n13 May 2009.\n113 Ibid.\n\nWhile the real world experience China gained in its deployment to the Indian\nOcean and the Gulf of Aden may be the current pinnacle of the PLANs realistic training\nin conducting offshore campaigns and MOOTW, its importance should not be overstated.\nAside from the great distance between China and the Gulf of Aden, the anti-piracy\noperation is a relatively uncomplicated mission compared to other contingencies that the\nPLAN might face. China is operating in a low risk threat environment free of hostile\naircraft, surface ships, and submarines and is participating in an operation that has\ninternational support. A potential conflict with Taiwan or over territorial claims in the\nSouth China Sea would likely require a far larger force and more sophisticated tactics and\nplanning.\nWhile the conditions surrounding the mission in Somalia are unique and not likely\nreplicable in any other region of the world, China's participation offers valuable insight\ninto the operational capabilities of the PLAN.114 When analyzed in the context of\nChinese military publications, observations of current anti-piracy operations can be used\nto assess China's ability to carry out potential future naval missions. This paper relies on\ninformation about the anti-piracy operation released by the PLA to asses limitations in\nChinese naval capabilities to examine the feasibility of sustaining SLOC protection\noperations in a hostile environment. Both western and Chinese analysts have suggested\nthat as China's dependence on foreign energy sources grows, the nation will become\nincreasingly vulnerable to operations designed to limit or block China's access to energy\n114 Conditions in off the Horn of Africa are unique for many reasons including the existence of a UN\nresolution urging nations to participate in anti-piracy operations and the broad international support for\nanti-piracy operations.\n\nresources.115 Given the possibility of an energy resource blockade against China, analysts\nsuggest that the PLAN enhance its ability to protect key sea lanes of communication to\nensure security of energy resource supply.116\nThe analysis conducted in this section is not intended to be detailed net\nassessments of force-on-force campaigns. While recent publications demonstrate the\nutility of such analysis, they are beyond the scope of this paper.117 Instead, the paper\nattempts to illustrate how lessons learned, successes, and shortcomings from the anti-\npiracy operation apply to future PLAN missions. Admittedly, any method of military\noperations analysis that relies largely on Chinese government-controlled press releases is\nnot ideal. Publicly released information is likely incomplete with little or no mention of\nshortcomings and specific details on successes. Despite a lack of discussion in these\nareas, the PLA Daily, the official media outlet for the PLA, describes many new tasks and\nchallenges the anti-piracy flotilla was forced to overcome. Even brief mention of these\nchallenges offers insight into procedures or activities that the PLAN may consider as\ndifficult.\nProtecting Sea Lanes of Communication in a Hostile Environment\nChina's participation in current anti-piracy operations offers a valuable window\ninto Chinese naval capabilities. Although the PLAN is tasked with a variety of missions\nranging from coastal defense to strategic deterrence, this paper analyzes only one\n115 Gabriel B. Collins, \"No Oil for the Lamps of China?,\" Naval War College Review 61, no 2. (Spring\n2008), 79-95.\n116 Erickson and Goldstein (2009), 44-76.\n117 Recent published examples of net assessment campaign analysis include Kelly Greenhill, \"Mission\nImpossible? Preventing Deadly Conflict in the African Great Lakes Region,\" Security Studies 11, no. 1\n(Autumn 2001): 77-124, and Caitlin Talmadge, \"Closing Time: Assessing Possible Outcomes of U.S.\nIranian Conflict in the Strait of Hormuz,\" International Security 33, no. 1, (Summer 2008): 82-117.\n\npotential type of naval operation, the sea transportation defense/sea communication line\ndefense campaign.118 China's growing dependence on energy resources from abroad has\nled both western and Chinese analysts to discuss the need for the development of military\ncapabilities to protecting strategic sea lanes of communication (SLOCs) through which\noil and energy resources travel.119 A SLOC defense campaign in a hostile environment is\nalso analyzed due to its similarity to the current anti-piracy mission. Using evidence\ndrawn from the China's Gulf of Aden deployment to assess the PLAN's ability to\nconduct other potential operations such as amphibious landings or \"land attack\ncampaigns from the sea\" would offer little analytical value due to the significant\ndifferences in the techniques, force requirements, and tactics. Still, analysis of a SLOC\ndefense operation provides insight into shortcomings in logistics and combined\noperations capabilities that could impact any future PLAN operation.\nAs described earlier, China's current technique for protecting its shipping\ninterests relies on a maritime convoy. After requesting naval protection, commercial\nvessels rendezvous with Chinese warships at a predetermined location. The convoy then\ntransits through the piracy area of operations, with Chinese warships serving largely as a\ndeterrent against would be pirates, firing warning shots and launching helicopters to fend\noff suspected attackers. In some cases, Chinese special forces personnel reportedly board\nmerchant vessels in the front, middle, and rear of the convoy formation to act as \"onboard\n118 The campaign is referred to as a sea transportation defense campaign, sea traffic defense campaign, and\nsea communication line defense campaign in The Science of Military Campaigns. Wang Houqing, et al,\neds. (Beijing: National Defense University Press, 2000), 311-315. This paper refers to the campaign as\nSLOC defense/protection.\n119 Erickson and Goldstein (2009), 44-76.\n\nguards.\"120 These techniques are well suited for protecting shipping against untrained,\npoorly armed, non-state actors, but would be unable to defend Chinese shipping from a\nmore advanced military seeking to block Chinese energy supply flows.\nIn a hostile situation, a blockading power could target both Chinese warships and\nthe ships they escort by either attacking the vessels with the intent of destroying them as\nthe Germans did during the Battle of the Atlantic or could use deterrence to stop vessels\nin a campaign similar to the maritime quarantine of Cuba during the Missile Crisis. In\neither scenario, a potential adversary would be employing equipment far more advanced\nthan the rocket propelled grenades and rifles carried by Somali pirates. Thus, a Chinese\ndefensive escort force would need to serve far more than a deterrent purpose. PLAN\nsurface ships, submarines, and aircraft would need to operate collectively to protect the\nSLOC and vessels transiting through it by locating potential threats and attacking or\navoiding them. The current mission has offered China an environment to train for basic\nelements of a long-range, but a protection mission in a hostile environment would involve\nfar more forces and be significantly more complex.\nBroadening the Scope of the Mission\nIn 2000, the National Defense University in Beijing published The Science of\nMilitary Campaigns. The text offers a comprehensive background to the study of\noperational level campaigns and provides general guidelines for executing various types\nof military campaigns. The authors describe \"sea transportation defense\" as a potential\n120 Xia Hongping and Cao Haihua, \"Second Chinese naval escort taskforce accomplishes large-scale escort\ntask,\" PLA Daily. 29 April 2009. Available online :< http://english.chinamil.com.cn/site2/special\nreports/2009-04/29/content_1745053.htm>. Accessed 13 May 2009.\n\nnaval operation designed to safeguard sea communication safety by defending against\nenemy attacks on load and unloading ports and mid-way ports, protecting transportation\nships, and to break an enemy blockade against port and water channels.121 A SLOC\ndefense mission involves four distinct components.122 First, Chinese ships must be\ndefended during the loading phase. Next a regional task force consisting of aviation units,\nsurface warships, and submarines must ensure control of the sky and sea surrounding the\nSLOC. In addition to seizing air and sea control, an additional \"escort group\" must be\nassigned to protect ships that are transiting through the SLOC. This component of the\nmission differs from the regional task force as it focuses on protecting specific ships,\nwhereas the regional defense mission aims to maintain region air and sea superiority.\nFinally, the destination ports must be defended as the ships are unloaded.123\nThe current anti-piracy operation differs significantly from a traditional SLOC\nprotection campaign in that the current threat of pirates only necessitates protection of\ncommercial vessels during the escort phase of a SLOC defense campaign as outlined in\nThe Science of Military Campaigns. Given the relatively localized and low-tech nature of\nSomali pirates, there is no need to protect origin and destination ports, nor do pirates pose\nany air based or subsurface threat. A SLOC defense campaign in a more hostile\nenvironment, potentially stemming from a larger conflict would greatly widen the scope\nof the mission, requiring protection of Chinese shipping interests in all phases of a ship's\n121 Wang Houqing, et al, (2000), 311. Most of the campaigns described in the text appear to focus on a\npotential crisis in the Taiwan Strait, however, the general lessons can be applied to operations other than a\nconflict involving Taiwan.\n122 Ibid, 312.\n123 Ibid, 312.\n\njourney from the point of origin until the ship is offloaded. The Science of Military\nCampaigns describes the need protect against both conventional attack and sabotage\nbeginning with loading in the port of origin.124 It is unlikely that a blockading power will\nuse conventional attacks against non-Chinese ports where energy resources are loaded\nonto China-bound vessels, as port facilities are generally used by multiple nations, and\nnot exclusively by China. Chinese military planners would therefore need to focus their\nattention on developing measures to prevent sabotage against Chinese vessels. Deploying\na base defense force to achieve this task, as advocated by The Science of Military\nCampaigns, may not be feasible in a non-Chinese port of origin because of a variety of\nfactors ranging from political to logistical concerns. Thus, China may need to coordinate\nwith local governments for in-port protection or station security teams onboard vessels\nwhile they are in port, which may prove to be both monetarily and labor intensive.\nOnce a vessel leaves port, it will potentially face aviation, underwater, and surface\nthreats posed by the blockading force. Since these threats are absent in the current anti-\npiracy operation, China is able to protect its vessels with a minimal deployment of forces.\nIn a higher risk environment, China could not simply escort convoys of ships, but would\nalso be required to search for adversary submarines, mines, aircraft, and surface ships,\nwhich could be a massive undertaking depending on the blockading power and the size of\nthe operating area. Additionally, China maintaining sea and air control over the area of\noperations, would be a difficult challenge for China given the PLAN's limited experience\nin combined arms operations and the lack equipment such as aircraft carriers. While\nChina's current deployment to the Horn of Africa can technically be considered a\n124 Ibid, 313-314.\n\ncombined arms operation because of its use of aviation assets, special forces, and surface\ncombatants, the combined nature of the operation is minimal. The two utility helicopters\nand few dozen special forces personnel act largely as extensions of the destroyers,\ngenerally carrying out short patrol flights in response to reports of suspected pirate\nactivity. The current mission has not provided China with the opportunity to practice true\ncombined arms operations.\nLogistical Shortcomings\nChina's participation in the anti-piracy mission also highlighted the lack of\nsufficient underway replenishment capabilities as a key PLAN shortcoming. In order to\nsustain long duration, long-range operations, warships must refuel and replenish their\nstores of ammunition, food, and other supplies. While these needs can be satisfied by\nmaking port calls, docking into foreign ports generally takes warships away from\nperforming their mission and can be rather dangerous, as demonstrated by the 2000\nterrorist attack against the USS Cole as it pulled into Aden for a routine refueling.125 To\neliminate the need for port calls solely for replenishment and refueling, many modern\nnavies rely on underway replenishment, a practice of transferring fuel and goods from\none ship to another. 126 In most cases, purpose built auxiliary ships designed to resupply\nsurface vessels are tasked with underway replenishment. The PLAN deployed the\nWeishanhu, an indigenously produced, Fuchi-class multi-product replenishment ship as\npart of the anti-piracy task force. The Weishanhu is one of five replenishment ships in the\nPLAN's fleet with blue water capabilities; a majority of China's other replenishment\n125 Dave Moniz, \"US Ships Vulnerable at Refueling Ports, Navy Didn't Relax Guard Cohen Says,\" USA\nToday. 13 October 2000. Lexis Nexis.\n\nships are designed for coastal use and lack the ability to conduct long distance\noperations.127 In comparison, the United States operates thirty-nine auxiliary vessels\ncapable of resupplying a variety of goods, with dozens more in the National Defense\nReserve Fleet and Ready Reserve Fleet that could be quickly activated in the event of a\ncrisis.128\nThe dearth of oceangoing auxiliary ships in the PLAN likely influenced the force\nstructure of China's current anti-piracy mission and will limit future long-range naval\noperations if the fleet size is not increased. While the Chinese destroyers initially\nassigned to the mission remained in the region for roughly three months before being\nrelieved in April 2009, the Weishanhu was not replaced by another replenishment vessel\nand remained deployed to the Gulf of Aden. A variety of plausible explanations could\njustify the Weishanhu's longer deployment. First, it is possible that as a larger vessel, it\nhas a slightly longer endurance than the smaller surface combatants. It is also possible\nthat Chinese military planners feared that deploying a second oceangoing replenishment\nvessel to the Gulf of Aden before the Weishanhu returned would leave the South Sea\nFleet (SSF) without a large replenishment vessel to support potential contingency\noperations in the SSF area of responsibility. The SSF, which has contributed all of the\nvessels and personnel assigned to the anti-piracy force, maintains two of the PLAN's five\nlarge, oceangoing replenishment ships.129 While the PLAN could deploy a supply ship\nfrom either the East Sea or North Sea Fleets, it would likely require significantly more\ncoordination as Chinese naval operations traditionally include only forces from one of\n127 The Military Balance 2009, (London: International Institute for Strategic Studies, 2009), 35-36. Sino-\nDefence Naval Vessels Description, Available online: < http://www.sinodefence.com/navy/vessel.asp>.\n128 The Military Balance 2009, 35-36.\n129 Sino-Defence Naval Vessels Description.\n\nChina's three fleets.130 A SLOC defense operation in a hostile environment would\ncertainly require more than one auxiliary ship. The increased number of PLAN surface\ncombatants deployed in a more stressing operational environment would necessitate the\nneed for additional support vessels. Additionally, Chinese military planners would need\nto consider the loss of auxiliary vessels due to enemy attack or equipment stemming from\na high operations tempo. The potential for losses may result in increased requirements for\nships capable of underway replenishment. China could use civilian cargo vessels to fill\nsome of the underway replenishment capabilities gap. The Chinese anti-piracy has relied\non civilian vessels for replenishment, and has received three tons of fresh vegetables and\nfood from the Chinese Shipping Company's \"New Africa\" freighter.131\nThe great distance between the Gulf of Aden and the Chinese mainland further\ncomplicates the logistics associated with sustaining a sea lane protection operation. In the\ncurrent anti-piracy mission, China has been able to use civilian cargo vessels to\nsupplement naval resupply ships and has loaded additional fuel, water, and food onto the\nWeishanhu in the Port of Aden.132 In a hostile environment, the long logistical tail\nrequired to support deployed operations would be an attractive target for a blockading\npower. Unarmed civilian ships carrying supplies to deployed Chinese naval forces would\ntherefore require escorts, placing additional demands on PLAN resources. Additionally,\nthe practice of commercially purchasing fuel and supplies in the area of operations may\n130 China's Navy 2007, --.\n131 Qian Xiaohu and Tian Yuan, \"Chinese ship carries supplies for naval escort fleet,\" PLA Daily. 1\nFebruary 2009. Available online: < http://english.chinamil.com.cn/site2/special-reports/2009\n02/01/content_1638575.htm>. Accessed 3 March 2009.\n132 Xia Hongping and Hou Yaming, \"Supply ship 'Weishanhu' berths in Port of Aden for Replenishment,\"\nPLA Daily. 27 April 2009. Available online: <http://english.chinamil.com.cn/site2/special-reports/2009\n04/27/content_1742339.htm>. Accessed 13 May 2009.\n\nnot be feasible in a hostile environment. During the first and second Chinese anti-piracy\ndeployments, the PLAN coordinated with the Chinese Ministry of Foreign Affairs and\nthe Chinese Overseas Shipping Company to arrange \"commercialized material\nprocurement\" in the Port of Aden.\"133 During the three-day port call, the Weishanhu was\nloaded with fuel, water, and food, while some crewmembers took shore leave.134 In this\ncase, China was able to replenish the military vessel in a foreign port likely because anti-\npiracy operations have received support from the international community and are\nlegitimized by UN Security Council Resolutions.\nIf China became involved with a conflict that required armed defense of SLOCs,\nBeijing may find itself unable to access foreign port facilities. This may be especially true\nif the SLOC defense mission is a component of a broader war between China and another\nlarge power, such as a war involving the United States in the South China Sea. In such a\nconflict, the United States may attempt to block China's access to energy resources and\nother materials that could aid China's war effort by establishing blockade operations far\nfrom the shores of China, where the mission would be less risky to the blockading\nforce.135 A blockading power could use its influence to encourage states to bar Chinese\nwarships from entering their ports, through coercive diplomacy or by offering economic\nor diplomatic incentives. States may also seek to remain neutral in a potential conflict,\nand independently decide to bar foreign warships from their ports and territorial waters if\nSLOC defense campaign is part of larger conflict. In these cases, China's ability to\n133 Ibid.\n134 Ibid.\n135 Collins and Murray (2008), 81-87.\n\nsustain long-range operations would be significantly impaired, unless the PLAN acquires\nmore naval auxiliary supply ships.\nConclusion\nAs China continues to develop economically and diplomatically, it will\nincreasingly rely on international markets and foreign suppliers. This growth will be\ncoupled with another component of China's peaceful development, the desire to be\nviewed as more responsible and cooperative actor committed to ensuring global stability.\nThese objectives have already manifested themselves in a Chinese foreign policy that\nappears increasingly willing to employ military forces in MOOTW to further China's\ninterests and enhance its image as a responsible state actor. As the PLA becomes more\nactive in international operations, the PLAN will likely find itself deployed on a variety\nof new missions that involve it to travel further from China's shores and employ new\nequipment and techniques in addition to its primary mission of territorial defense.\nHowever, China's ability to carry out these new tasks may be limited by shortcomings in\nlogistical capabilities and combined arms operations.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.407 / 17.408 Chinese Foreign Policy: International Relations and Strategy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Modern Chinese Strategic Thought: Classical and Maoist Influences",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-407-chinese-foreign-policy-international-relations-and-strategy-spring-2009/249112bdf71af81338c5eb13510c262d_MIT17_407S09_final1.pdf",
      "content": "17.407 Final\nModern Chinese Strategic Thought: Classical and Maoist Influences\nThis paper will examine the influences of classical Chinese and Maoist strategic\nthought on China's contemporary military strategy, as expressed in The Science of\nMilitary Strategy. The present aspects of classical and Maoist thought will be compared\nin light of their prescriptions for the sources of victory in conflict; efficacy of using force,\nand the manner of its employment to achieve strategic goals. We will see that the\nmodern concepts of sources of victory reflect Sun-Tzu's and Mao's concepts of military\ncommand, while implicitly replaying Sun-Tzu's emphasis on the commanding officer.\nVictory may be achieved through the classical paradigm of economical application of\nviolence at specific points, obtaining maximum effect for minimal effort. In discussing\nthe use of force, we will find a synthesis of Maoist and classical principles: an inclination\ntowards Sun-Tzu's ideal of decisive battle, blended with a modified version of Mao's\nprescription for quick decision in battle while preparing for protracted conflict. Finally,\nin an examination of contemporary guidance for employing force, we will see implicit\nreflections of both the classical emphasis on psychological victory, and the Maoist\nimportance placed upon mass struggle, updated to reflect technological conditions, while\nneither principle is directly enumerated.\nContemporary Chinese strategic thought on the sources of victory reflects the\nMaoist and classical concepts of command, while eschewing classical prescriptions for\nthe attributes of a general. But, by assigning key responsibility for victory to the\ncommander, contemporary strategy implicitly reflects the classical ideal. Thus, although\nexplicit mention is not given to the central role of the commander in the employment of\ntroops to obtain victory, the focus placed upon the functions and responsibilities of\ncommand make this point nonetheless.\n\nIn Chap. 11 of The Science of Military Strategy, named \"Strategic Command,\" the\nauthors make brief mention of the Tai-Kung, before spending the bulk of the chapter\ndiscussing the responsibilities and desired attributes of a strategic commander:\n\"The sagacity, fortitude, and determination of the strategic commander are the\nkey to boost the morale and maintain the cohesion of his army... However, due to the\nhigh level of strategic command, it is neither necessary nor possible for the strategic\ncommander to closely command and control all the details of all the armed forces...\"1\nThis reflects Mao's ideas on military organization in Chap. 9 of Problems of\nStrategy in Guerilla War, entitled \"The Relationship of Command\". He writes:\n\"...the principle of command in guerilla war should be centralized strategic\ncommand and decentralized command in campaigns and battles.\"2\nThis somewhat muscular and direct prescription for command may be contrasted\nto the original, but more generalized, perspective on the specifics of military organization\nnecessary for victory, as written by Sun-Tzu:\n\"In general, commanding a large number is like commanding a few. It is a\nquestion of dividing up the numbers... It is a question of configuration and\ndesignation.\"3\nIn its guidance for fighting \"high-tech local wars,\" contemporary strategic\nthought echoes Sun-Tzu's concepts of victory through the precise application of violence\nto defeat one's opponent at minimal cost: commanders are instructed to \"strike the nodes\nto destroy the network.\"4 Focus is placed upon destruction of the enemy's \"effective\nstrength,\"5 which is an interesting combination of Mao's ideas of \"annihilation\" and Sun-\nTzu's emphasis on attacking the enemy's strategy. In Chap. 24 of The Science of\nMilitary Strategy, \"China's Strategic Guidance for Future High-Tech War,\" we read:\n\"When striking the nodes to destroy the whole network, generally the information\nsystems and command and control systems must be destroyed to a maximum\n1 Peng & Yao, eds., 2005: p. 252-255\n2 Mao, 1938: p. 110. Page numbers of Mao's writings are the original numbers as\nmarked in the text, rather than the page number of the translation.\n3 Sun-Tzu, trans. Sawyer, 1993: p. 164\n4 Peng & Yao, eds., 2005: p. 463\n5 Ibd., p. 465\n\nextent... However, partial destruction of the forces and fire systems will be\nenough... [Wipe] out the enemy's effective strength, to bring political, public\nopinion, physiological and spiritual pressure to the enemy...\"6\nFor comparison, we juxtapose the relevant passages, starting with Mao's\nendorsement of \"annihilation\" in On Protracted War:\n\"...it is necessary to advocate and vigorously carry out campaigns and battles of\nannihilation whenever circumstances are favourable, so as greatly to deplete the\nenemy's forces and greatly replenish our own.\"7\nSun-Tzu eschewed this strategy. He sourced victory in the defeat of the enemy's\nplans and strategies rather than his material destruction, giving play to self-preservation\nand providing the foil to Mao's focus on annihilation:\n\"Thus the highest realization of warfare is to attack the enemy's plans...one who\nexcels at employing the military subjugates other people's armies without\nengaging in battle... He must fight under Heaven with the paramount aim of\n'preservation'\"8\nThe classical strategy of Sun-Tzu is perhaps too abstract for employment in the\nservice of a modern (or modernizing) military, so its more mystical elements are set aside\nin favor of the concrete and specific instructions of Mao. Mao's strategies of annihilation\nare somewhat absolute, offering little flexibility and requiring dedication of the mass\neffort of the people into a singular objective, to the loss of all others; these are\nprescriptions perhaps too strong for an economically globalizing society, and they suffer\na crisis of relevance when applied to an enemy who is not actively invading the\nhomeland. As such, contemporary strategy borrows from both: seeking victory from\nelements of Mao's practicality and Sun-Tzu's subtlety.\nIn exploring the efficacy of the use of force, contemporary Chinese strategy\npresents a synthesis of Maoist and classical strategic thought. Sun-Tzu is reflected\nthrough the stated disinclination towards violent conflict - his thesis of \"subjugating the\n6 Ibid.\n7 Mao, 1938: p. 176\n8 Sun-Tzu, trans. Sawyer, 1993: p. 161\n\nenemy's army without fighting\"9 is explicitly presented, and it is recognized as the\nunderpinning of traditional Chinese strategy:\n\"The idea of winning victory by stratagem has always been the main idea of\ntraditional Chinese strategic thinking. It means the use of limited force to achieve\nvictory or realize the aim of the war.\"10\nMaoist principles concerning \"mass war\" and \"protracted war\"11 are discussed,\nbut only loosely espoused - it seems to be recognized that the conditions of modern,\n\"high-tech local wars\" warfare obviate the mass guerilla strategies of the 1940s in\npractice; however, the 'spirit' of such strategies remains closely held. In Chap. 23,\n\"High-Tech Local Wars That China May Face in the Future,\" we read\n\"The war China has to fight in the future is still people's war. This basic\ncharacteristic will never change. But the future people's war is likely to take\nplace in the strategic frontlines far away from the depth of the state... In the past,\nthe PLA greatly depended on the superiority of mass mobilization, strategic\ndepth, and protracted wars. Things are different now....The deep-rooted source\nof the sinews of war will remain in the masses of people forever.\"12\nMao's thesis of seeking quick decisions to battles, while being prepared for\nprotracted war, is modified in an interesting manner: its modern incarnation seeks quick\ndecision to both battle and larger conflict, while retaining Mao's prescriptions to remain\nprepared for a protracted war. Mao's original exposition in On Protracted War states:\n\"...our strategically protracted war is translated in the field into battles of quick\ndecision...the above operational principle for fighting campaigns and battles is\none of \"quick-decision offensive warfare on exterior lines\". It is the opposite of\nour strategic principle of \"protracted defensive warfare on interior lines\", and yet\nit is the indispensable principle for carrying out this strategy.\"13\nWhile Mao endorses short battles in the course of long war, The Science of\nMilitary Strategy equivocates on his position, stating:\n9 Ibid.\n10 Peng & Yao, eds., 2005: p. 135\n11 Mao, 1938: p. 134-138\n12 Peng & Yao, eds., 2005: p. 451\n13 Mao, 1938: p. 159-160\n\n\"As the cost of high-tech local war is so high that both sides can hardly afford...it\nis the target of both sides to fight a quick battle and force a quick decision. But it\ndoesn't remove the possibility to achieve the military object through enduring\noperations if it is necessary.\"14\nThis is a modification of Mao's writings on protracted war, reducing it from a\nprimary strategy to a strategy of last resort, and it leans towards Sun-Tzu's ideals of\nseeking quick resolution to battles. The synthesis of classical and Maoist strategy seems\nto have been motivated by the need to recognize the disastrous nature of protracted\nconflict in the 21st century economy; or, it may reflect the observations of the relatively\nshort duration of recent instances of technologically-intensive warfare, given its\ndestructiveness and the economic interconnectedness of nations wealthy enough to\nemploy it. None of these conclusions are new. Sun-Tzu long ago observed:\n\"Thus in military campaigns I have heard of awkward speed but have never seen\nany skill in lengthy campaigns. No country has ever profited from protracted\nwarfare.\"15\nThus, we see the Maoist avocation of the utility of extended uses of force, and the\ncontrasting classical view, advocating minimalization and brevity. Modern Chinese\nthought espouses partly the Maoist estimation of the need to be prepared to use force in\nprotracted conflict, while favoring the classical ideals of seeking quick decisions to\nconflicts. Force is most effective when applied quickly and decisively, but when this is\nnot possible, it may be effective when applied over the long term as well.\nExamining contemporary Chinese theory on the employment of force to reach\nstrategic goals, we find the classical emphasis on the foreknowledge of the outcome of\nbattles, and on initiative, and a Maoist emphasis on the concentration and deployment of\ntroops and firepower. The discussions of the \"strategic initiative\" and \"subjective\ninitiative\" echo strongly the discussions of Sun-Tzu and Wei Liao-Tzu of psychological\nadvantage and victory. \"Strategic initiative\" is defined as an actor's freedom of action,\n14 Peng & Yao, eds., 2005: p. 428\n15 Sun-Tzu, trans. Sawyer, 1993: p. 159\n\nmovement, and \"decision-making,\" and \"subjective initiative\" is explained as the ability\nto obtain strategic initiative through both material and psychological superiorities.16\nSun-Tzu dedicates most of Chap. 6 of The Art of War, named \"Vacuity and\nSubstance,\" to discussing what modern readers might consider \"initiative.\" Summarizing\nboth the attributes and benefits of holding the initiative, he writes:\n\"Thus, if I determine the enemy's disposition of forces while I have no\nperceptible form, I can concentrate my forces while the enemy is fragmented.\"17\nWhile this is not explicitly reprised in The Science of Military Strategy -\nunsurprising in a work that seeks to present strategy in the context of modern or \"high\ntech\" conditions of conflict, avoiding the more abstract elements of the classical texts -\nthe substance of these theories of the mental battlefield remains a strong undercurrent in\nthis writing. In Chap. 10, \"Principles of Strategic Actions,\" Sun-Tzu is channeled into a\ndiscussion of preparations for battle that combines both his psychological tenets, and the\nobjective, materialist prescriptions of Mao:\n\"Careful planning and full preparations are the precondition for winning victory,\nbut are not equal to being sure of victory...the material conditions needed to\ndefeat the enemy must be actively prepared.\"18\nEarlier, Peng and Yao quote Mao almost directly, stating as he did in Problems of\nStrategy in China's Revolutionary War, \"The initiative is not something imaginary but is\nconcrete and material.\"19\nThe contemporary theory thus preconditions the employment of force with careful\npreparation, both of the classical (read: psychological) nature and of the Maoist-\nmaterialist nature. In particular, Mao captures the somewhat esoteric discussion of\ninitiate in Sun-Tzu and presents it in his typically direct manner.\nElsewhere, in discussions of the concentration of troops and firepower as a facet\nof these necessary preconditions to using force, we see a distinctive Maoist influence.\nMao wrote extensively on the necessity and proper modality of dispersing or\nconcentrating guerilla troops as dictated by the conditions of battle, in order to achieve\n16 Peng & Yao, eds., 2005: p. 242-245\n17 Sun-Tzu, trans. Sawyer, 1993: p. 167\n18 Peng & Yao, eds., 2005: p. 238\n19 Mao, 1936: p. 234\n\ntactical or strategic objectives, and these thoughts are here replayed, again in the \"high\ntech/local\" context, in Chap. 22, \"Strategic Guidance of High-Tech Local War\":\n\"In traditional war... Concentration of firepower relied on concentration of\nmanpower... Now the technological component is greatly increased, so\nconcentration of superior power mainly means the qualitative gathering of the\ncombat effectiveness of the armed forces.\"20\nBy way of comparison, we look to Mao's writings on this matter. Mao tied his\nprescriptions for the employment of forces to his ideas on the short timescale of battles\nand protracted timescale of conflict; casting the tactical and strategic goals as\noppositional aspects of the same thing. He wrote:\n\"Our strategy is \"pit one against ten\" and our tactics are \"pit ten against one\" -\nthis is one of our fundamental principles for gaining mastery over the enemy.\"21\nThus, Mao is a primary influence on the contemporary Chinese thought on the\nconfiguration of troops as an aspect of the employment of force. The classical\ncommentaries here focus mainly on deception, i.e. forcing the enemy to disperse his\nforces by making the point and time of attack unknown. Mao's ideas present a more\npractical side of the coin, and when lifted from their context in a low-tech, guerilla\nstruggle, and updated to account for the technological centrism of the modern battlefield,\nthey make up the core of contemporary thought on this matter. This dovetails with the\nclassical, somewhat impractical emphasis on foreknowledge of outcomes; and, the\nabstract conception of initiative received from Sun-Tzu, incorporated into contemporary\nthought via Mao's intermediary interpretation.\nMaoist and classical strategic thought influence contemporary Chinese strategy,\nas evinced in the investigation of the sources of victory in conflict, the efficacy of using\nforce, and the manner of employing force to reach strategic goals. Victory in conflict is\nobtained through proper military organization and the economized application of\nviolence, reflecting both Maoist and classical thinkers. Force is most effective when\napplied quickly and decisively, reflecting aspects of both schools of thought, but\n20 Peng & Yao, eds., 2005: p. 430\n21 Mao, 1936: p. 237\n\nprimarily the classical thought of Sun-Tzu, as the conditions of modern technology push\nwar away from the Maoist conception of protracted struggle. Finally, force is best\nemployed by superior forces holding the initiative. It is noted that the initiative is not\npurely psychological, and superiority is not simply numerical: again, contemporary\nthought borrows from both the classical and Maoist schools.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.407 / 17.408 Chinese Foreign Policy: International Relations and Strategy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}