{
  "course_name": "Chinese Foreign Policy",
  "course_description": "This lecture course provides students with a comprehensive introduction to the international relations of the People’s Republic of China. China’s foreign relations during the Cold War as well as contemporary diplomatic, security and economic issues will be examined to identify and explain China’s foreign policy goals and their implementation since 1949. Throughout, this course will investigate the sources of conflict and cooperation in China’s behavior, assessing competing explanations for key events and policies. Readings will be drawn from political science, history, and international relations theory.",
  "topics": [
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nDiscussions: 1 session / week, 1 hour / session\n\nCourse Description\n\nThis lecture course provides students with a comprehensive introduction to the international relations of the People's Republic of China. China's foreign relations during the Cold War as well as contemporary diplomatic, security and economic issues will be examined to identify and explain China's foreign policy goals and their implementation since 1949. Throughout, this course will investigate the sources of conflict and cooperation in China's behavior, assessing competing explanations for key events and policies. Readings will be drawn from political science, history, and international relations theory.\n\nFormat\n\nThe course will have one two-hour general meeting and one one-hour discussion section per week for undergraduates. The two-hour general meeting will begin promptly at 3:05 pm and end at 4:55 pm.\n\nRequirements\n\nStudents will be expected to have completed each week's reading assignments before the general meeting. Attendance is mandatory, including section.\n\nGrading\n\nGrades will be determined as follows:\n\nActivities\n\npercentages\n\nIn-class Exam\n\n35%\n\nThree Quizzes\n\n15%\n\nA Final Take-home Exercise\n\n40%\n\nClass Participation\n\n10%\n\nCourse Information and Policies\n\nStay Current\n\nStay abreast of current developments through the Asia sections of the\nWashington Post\n,\nNew York Times\n, and the\nBBC\n. For the latest developments in China, see\nPacific Forum: Comparative Connections\n,\nChina Leadership Monitor\n, and\nChina Brief\n. Major news outlets in China have English editions, including the\nPeople's Daily\n,\nLiberation Army Daily\n, and\nXinhua\n, the central news agency. Also, scan the\nMinistry of Foreign Affairs\nand\nState Council\nweb sites.\n\nDisabilities\n\nIf you have a disability and require accommodations, please contact me immediately so that appropriate arrangements can be made.\n\nExtensions\n\nMake-up exams or extensions will not be granted except in case of emergency and in all cases require a note from the Dean or your doctor. Late work will be penalized by one third of a grade for each day that the assignment is late (e.g., a B to B-).\n\nPlagiarism\n\nPlagiarism will not be tolerated. Plagiarism is \"a piece of writing that has been copied from someone else and is presented as being your own work.\" This includes ideas as well as specific phrases, sentences or paragraphs.\nDo not misrepresent your own work\n. See Avoiding Plagiarism from\nMIT's Writing Center\nand\nMIT's rules\nregarding academic honesty.",
  "files": []
}