{
  "course_name": "Chinese I (Regular)",
  "course_description": "This subject is the first semester of four that forms an introduction to modern standard Chinese, commonly called Mandarin, the language with the largest number of native speakers in the world. It is the official language of Mainland China and Taiwan, and one of the official languages of Singapore. The course presupposes no prior background in the language. Course objectives are to master Mandarin pronunciation, including the recognition and writing of Pinyin romanization, basic reading and writing skills (around 150 characters in the traditional character set or the simplified set), and to develop the ability to participate in simple, practical conversations on everyday topics. The relationship between Chinese language and culture and the sociolinguistically appropriate use of language will be stressed throughout. Typical class format will include performance of memorized basic conversations, drills, questions and discussion, and various types of communicative exercises.",
  "topics": [
    "Humanities",
    "Language",
    "Chinese",
    "Humanities",
    "Language",
    "Chinese"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nSelection Criteria of Registration\n\nEnrollment limited to 16 for pedagogical reasons. No auditors. Please note that you have to attend the first day of class to maintain your preference level. In case of over-enrollment, preference will be given in the following order: Declared minors, declared concentrators, pre-registered students of\n21G.076\n, sophomores, freshmen, juniors, seniors and graduate students. Within each category, priority will be given to pre-registered students, including pre-registered undergraduates who were cut from the same class the previous fall semester due to the enrollment cap. Students with prior knowledge of Chinese must contact a Chinese language instructor for a placement test before beginning your studies of the Chinese language at MIT.\n\nSign up for\n\n21G.101 if you are seeking undergraduate credit,\n\n21G.151 if you are seeking graduate credit, or\n\n21G.171 if, and only if, you are taking\nChinese I (Regular)\nin conjunction with\n21G.076 Globalization: The Good, the Bad and the In-Between\n.\n\nTake\n21G.107 / 21G.157 / 21G.181 Chinese I (Streamlined)\n, the streamlined beginning subject,\nif you have prior knowledge of Mandarin or any dialect of Chinese\n(typically gained from growing up in a Chinese speaking environment), but barely any reading or writing ability.\n\nCourse Description\n\nThis subject is the first semester of four that forms an introduction to modern standard Chinese, commonly called Mandarin, the language with the largest number of native speakers in the world. It is the official language of Mainland China and Taiwan, and one of the official languages of Singapore. The course presupposes no prior background in the language. Course objectives are to master Mandarin pronunciation, including the recognition and writing of Pinyin romanization, basic reading and writing skills (around 150 characters in the traditional character set or the simplified set), and to develop the ability to participate in simple, practical conversations on everyday topics. The relationship between Chinese language and culture and the sociolinguistically appropriate use of language will be stressed throughout. Typical class format will include performance of memorized basic conversations, drills, questions and discussion, and various types of communicative exercises.\n\nInstructors\n\nMrs. Miranda Chen-Cristoforo (陈念湘老师 Chen Nianxiang laoshi)\n\nMr. Tong Chen (陈彤老师 Chen Tong laoshi)\n\nDr. Haohsiang Liao (廖灏翔老师 Liao Haoxiang laoshi)\n\nSections\n\nThere are four sections offered by the three instructors. Students may shift between sections on a Regular basis due to scheduling conflicts after consulting with your instructor. All sections will cover the same materials.\n\nSection 1 (Chen Nianxiang laoshi)\n\nSection 2 (Liao Haoxiang laoshi)\n\nSection 3 (Liao Haoxiang laoshi)\n\nSection 4 (Chen Tong laoshi)\n\nTextbooks\n\nKubler, Cornelius C.\nBasic Spoken Chinese: An Introduction to Speaking and Listening for Beginners\n. Tuttle Publishing, 2011. ISBN: 9780804840156.\n\nKubler, Cornelius C., and Yang Wang.\nBasic Spoken Chinese Practice Essentials: An Introduction to Speaking and Listening for Beginners\n. Tuttle Publishing, 2011. ISBN: 9780804840149.\n\nKubler, Cornelius C.\nBasic Written Chinese\n. Tuttle Publishing, 2012. ISBN: 9780804840163.\n\nKubler, Cornelius C., and Jerling Guo Kubler.\nBasic Written Chinese Practice Essentials\n. Tuttle Publishing, 2012. ISBN: 9787512337039.\n\nYou will need all four textbooks right away!\n\nAcademic Conduct\n\nPlease go to the\nMIT Plagiarism Website\nand read through the information carefully to prevent unintentional violations:\n\n\"MIT assumes that all students come to the Institute for a serious purpose and expects them to be responsible individuals who demand of themselves high standards of honesty and personal conduct. Cheating, plagiarism, unauthorized collaboration, deliberate interference with the integrity of the work of others, fabrication or falsification of data, and other forms of academic dishonesty are considered serious offenses for which disciplinary penalties can be imposed.\"\n\nYou are expected to finish the writing assignments\nindependently\n, without using online translation applications such as Google Translate, or receiving help from family and / or friends for translation assignments, compositions, etc.\n\nNote on Disabilities\n\nStudents who feel they may need an accommodation based on a disability should contact the instructor privately to discuss their specific needs.\n\nLearning Objectives / Goals of the Course\n\nThe focus of this course is to train you to function successfully in Chinese culture using Mandarin as your primary language. We assume that you are interested in interacting with Chinese people in a way that will permit you to pursue professional goals in some segment of the Chinese society. This means that we expect you to learn how to present yourself in a way that a Chinese person will find comfortable. If a Chinese person has to adapt to you in order to communicate, it is not likely that you can accomplish what you intend in China.\n\nThis course will help you develop skills in Mandarin Chinese to communicate across ethnic, cultural, ideological and national boundaries and to develop an understanding of Chinese interpersonal behavioral culture and related thought patterns. At the end of the course, you will be expected to perform in speaking, listening, reading and writing Chinese at a basic level of proficiency. You should also demonstrate a level of cultural understanding suitable for correct performance of assigned tasks in Chinese (e.g., how to make a request in an appropriate way). This means that we will pay attention to the way you behave as much as we attend to your use of the language. We are really coaching you on how to behave in Chinese culture. This is a long-term process, but we will get started on it right away. In order to do this, you will have to perform.\nPerformance, your performance\n, is the focus of this course.\n\nWe assure you that if you do what we ask of you on a daily basis, you will learn Chinese. If you learn Chinese, you will do well in this program. Therefore, our evaluation (i.e., your grades) will be based largely on your daily performances. The following section on '\nEvaluation\n' should be read carefully and understood thoroughly.\n\nEvaluation\n\nThe grade for this course will be based on the following table:\n\nACTIVITIES\n\nPERCENTAGES\n\nDaily classroom performance (including performance of the basic conversation, participation in class activities, quizzes, and / or homework)\n\n60%\n\nOral report\n\n5%\n\nReview tests (5% of each)\n\n25%\n\nFinal oral interview\n\n10%\n\nYour grades in the course are largely determined by classroom performance. Among the numerous reasons for this emphasis, the main one is that we are convinced that if you follow the course with consistency and persistence, you will develop significant demonstrable skills in Chinese by the end of the semester. Unless indicated otherwise, your daily performance on the activities assigned in the weekly schedule will be graded based on the following four-point scale:\n\nPOINTS\n\nDESCRIPTIONS\n\nPerformance that promises interaction with a native with no difficulty, discomfort, or misunderstanding; no English hesitation noises in speaking and no \"foreignisms\" in the written work.\n\n3.5\n\nPerformance comprehensible to native speakers, but with some non-patterned errors that would hinder smooth interaction with them.\n\nPerformance comprehensible to a native, but with evident weakness or patterned errors.\n\n2.5\n\nCommunication requires much help from interlocutor.\n\nPerformance puts burden on interlocutor. To facilitate communication, a Chinese-speaking native would probably avoid using Chinese with you.\n\n1.5\n\nBarely prepared; little competency evident.\n\nEvidently unprepared; unable to perform.\n\nAbsent.\n\nMost class sessions will be graded on a scale of 8 possible points -- 4 for \"performance of memorized basic conversations\" and the other 4 for overall practice based on the drills, quizzes, and / or written assignments. Grades will be kept for every assigned performance, but those for the first two days will not be counted if they lower your final grade. This will give us all a chance to get used to this system.\nStarting from the fourth session, the grading system will go into full effect\n. You will need a minimum of 60 points to pass the course. The grading rubric is provided as follows:\n\nA+ = 100-96.7\n\nA = 96.6-93.4\n\nA- = 93.3-90\n\nB+ = 89.9-86.7\n\nB = 86.6-83.4\n\nB- = 83.3-80\n\nC+ = 79.9-76.7\n\nC = 76.6-73.4\n\nC- = 73.3-70\n\nD+ = 69.9-66.7\n\nD = 66.6-63.4\n\nD- = 63.3-60\n\nF = below 60\n\nGrades and comments will be recorded online on\nEngrade\n. You should check this daily to track your progress. If you have a question about a grade, ask your instructor. There is\nno curve\nin this course. You are competing against the communicative demands of the language, not against each other. Each person will have to perform to receive credit; but there is nothing in the grading system to discourage any collaborative efforts to achieve the highest level of performance possible.\n\nIf you must miss a class, please let us know well in advance if possible. You will be allowed to make up no more than\nTwo\nmissed classes in this course unless you provide a doctor's note or a note from your academic advisor to the instructor in advance. The make-ups will be conducted by the instructors by appointment and will cover the work missed. Make-ups are to be arranged within two days of your return to class; missed classes which are not made up within the above time frame or which exceed two in number will be entered as zeroes in your grade record. It is vital that you maintain communication with us if you ever miss a class. You are expected to be in class each hour ready to perform; we do not have the resources to set up a separate program for those who cannot make it to class each hour each day.\n\nPreparation for Classes and Policies\n\nAll classes are conducted in Chinese only\n. English will not be used except when asked for with a Chinese request. Therefore, you must come to class well-prepared in the assigned materials. Here is the secret to success in learning Chinese: The most important materials are the Audio Files. Whenever possible, your preparation should emphasize the audio files. Below are important comments for you:\n\nBe sure to come to every class; frequent cutting equals certain disaster! We cannot possibly emphasize enough the importance of regular class attendance and in-class participation, which will ensure an effective learning experience in the classroom. You should always participate actively, paying close attention to everything you hear and see and anticipating the responses to questions even when you're not called upon.\n\nWe can never overstress the importance of\nthorough preparation before each class\n. You should plan on spending two hours in preparation for each hour of class. This includes studying the explanations in the textbook and, especially, listening to and repeating after the audio recordings. Work with the recordings as actively as possible and always be thinking of the meaning of what you are hearing and saying.\n\nMemory work will be a very important part of the course. Once we begin conversation in class, you should memorize the assigned conversation that constitutes the core of each lesson by working intensively with the audio files; do not rely on reading the romanization in your textbook. Memorize each basic conversation thoroughly, so you can perform it in class accurately and fluently. It is essential to internalize the new words, grammar patterns, and cultural behavior so they will be readily available to you for your own use when needed. Memorization will greatly aid your fluency and naturalness of speaking. Students sometimes question the necessity of repetition, drill, and memorization. Certainly, these are only the first few steps leading to our ultimate goal of communicative competence; however, they are very important steps, since they firmly establish in your brain the sounds and structures of the language for you to draw on later in your own speech. We hope that you understand the importance of these activities and ask that you work hard on them.\n\nWritten homework will be due\nin class\n. Late homework will be accepted with a penalty (10% off per day) and will not be accepted two days late, except in cases of serious medical or family emergency.\n\"Extra work\" to make up for missed homework later on will not be accepted for this class\n.\n\nNo make-up quiz or review test\n. However, the lowest Three grades of your daily performance will be dropped toward your semester grade.\n\nTo give you as much practice as possible in using Chinese, starting from the fourth session and continuing through the end of the course,\n'Chinese only' is to be used during the first 45 minutes of every class\n. If you have questions that can be asked or answered only in English, please: (1) ask during the last 5 minutes of class; (2) ask the instructor right after class is over; (3) make an appointment to meet with the instructor individually; or (4) communicate with the instructor via e-mail. In our classes we want to create an atmosphere as \"Chinese\" as possible and get you used to thinking only in Chinese; if we were to revert to English every few minutes, this would be hard to accomplish.\n\nTo become a successful learner of Chinese, your goal is to know both traditional and simplified characters. However, we will begin with\nsimplified characters\nin Chinese I. After you have gained a solid foundation of Chinese writing system, we will systematically introduce traditional characters so that you will get good exposure. In Chinese I, we will learn about 150 characters.\n\nPlease do all writing (including homework and tests) with no. 2 pencils or pens in black / blue ink. Please do not use very light pencils or red / green ink.\n\nFinal Comments\n\nThis course is the result of years of experience in teaching, and is the best possible first-level curriculum we can devise. The instructors do their best to make this as enjoyable an experience as possible; however, you must do the work and learn the material. Ultimately, your attitude toward this endeavor will be the biggest single factor in your achievement, as learning as a class requires a great amount of cooperation with both classmates and instructors. Your teachers are determined to give you the best possible opportunity to learn the language. If you ever think we are not living up to this, please feel free to discuss your concerns with your instructors. If we think you are not doing your best, we will be sure to let you know.\n\nWe're excited about having you in our first-year Chinese language course this year and, while you should be prepared for a lot of hard work, we think you'll be surprised at how much you will have learned by the end of the semester.\n\nClassroom Etiquette\n\nNo caps.\n\nNo eating or chewing gum.\n\nDo not cross your legs when you are seated.\n\nDo not put your hands in your pockets when you do the dialog performance.\n\nHand in your homework to your teacher with both hands.\n\nWhen the teacher says \"Women shangke ba (\nLet's begin class\n)\" to begin class, students are expected to respond with \"Laoshi hao (\nHow are you teacher?\n)\" to greet their teacher.\n\nWhen the teacher says \"Women xiakele (\nWe end class now\n)\" at the end of class, students are expected to say \"Xiexie laoshi (\nThank you, teacher\n)\" to show their appreciation.\n\nWhen you write your teacher an email, start with \"Laoshi hao.\" Do not start with \"Hi\" or \"Hello\", which are considered inappropriate in this situation.\n\nIf you must bring a cell phone to class, make certain it is turned off. If your cell phone rings during class, you will be asked to leave immediately and will not be allowed to return to class that day.\n\nLooking Ahead\n\nNext semester, you have the option of taking\n21G.102 / 21G.152 Chinese II (Regular)\n, the continuation of\nChinese I (Regular)\n, or, the two VFT (Very Fast Track) classes. The VFT classes are half-term courses that meet for 8 hours a week, 2 hours per day on MTRF. Chinese I, VFT1, and VFT2 form a concentration in Chinese, just as Chinese I, II, III and IV. Completing VFT2 will also make you eligible for a MISTI internship next summer (apply this fall).",
  "files": []
}