{
  "course_name": "Circuits and Electronics",
  "course_description": "6.002 is designed to serve as a first course in an undergraduate electrical engineering (EE), or electrical engineering and computer science (EECS) curriculum. At MIT, 6.002 is in the core of department subjects required for all undergraduates in EECS.\nThe course introduces the fundamentals of the lumped circuit abstraction. Topics covered include: resistive elements and networks; independent and dependent sources; switches and MOS transistors; digital abstraction; amplifiers; energy storage elements; dynamics of first- and second-order networks; design in the time and frequency domains; and analog and digital circuits and applications. Design and lab exercises are also significant components of the course. 6.002 is worth 4 Engineering Design Points. The 6.002 content was created collaboratively by Profs. Anant Agarwal and Jeffrey H. Lang.\nThe course uses the required textbook Foundations of Analog and Digital Electronic Circuits. Agarwal, Anant, and Jeffrey H. Lang. San Mateo, CA: Morgan Kaufmann Publishers, Elsevier, July 2005. ISBN: 9781558607354.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Electronics",
    "Engineering",
    "Electrical Engineering",
    "Electronics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nCourse Objectives\n\nAfter successfully studying 6.002, students will be able to:\n\nUnderstand the basic electrical engineering principles and abstractions on which the design of electronic systems is based. These include lumped circuit models, digital circuits, and operational amplifiers.\n\nUse these engineering abstractions to analyze and design simple electronic circuits.\n\nFormulate and solve differential equations describing the time behavior of circuits containing energy storage elements.\n\nUse intuition to describe the approximate time and frequency behavior of circuits containing energy storage elements.\n\nUnderstand the concepts of employing simple models to represent non-linear and active elements-such as the MOSFET-in circuits.\n\nBuild circuits and take measurements of circuit variables using tools such as oscilloscopes, multimeters, and signal generators. Compare the measurements with the behavior predicted by mathematic models and explain the discrepancies.\n\nUnderstand the relationship between the mathematical representation of circuit behavior and corresponding real-life effects.\n\nAppreciate the practical significance of the systems developed in the course.\n\nLearning Outcomes\n\nEmploy simple lumped circuit models for resistors, sources, inductors, capacitors, and transistors in circuits.\n\nAnalyze circuits made up of linear lumped elements. Specifically, analyze circuits containing resistors and independent sources using techniques such as the node method, superposition and the Thevenin method.\n\nEmploy Boolean algebra to describe the function of logic circuits.\n\nDesign circuits which represent digital logic expressions. Specifically, design a gate-level digital circuit to implement a given Boolean function.\n\nCheck static discipline constraints in circuits. For example, determine if the circuit representing a gate provides adequate noise margins.\n\nDetermine the output produced by a circuit for a given set of inputs using the switch resistor model of a MOSFET.\n\nPerform a small-signal analysis of an amplifier using small signal models for the circuit elements.\n\nCalculate the time behavior of first order and second order circuits containing resistors, capacitors and inductors.\n\nCalculate the frequency response of circuits containing resistors, capacitors and inductors.\n\nConstruct simple gates, amplifiers, or filters in the laboratory.\n\nDetermine in the laboratory the time-domain and frequency-domain behavior of an RLC circuit.\n\nUse operational amplifier models in circuits which employ negative feedback.\n\nUse complex impedances to determine the frequency response of circuits.\n\nDetermine the power dissipation in digital gates and employ CMOS technology to reduce static power losses.\n\nPredict how a given circuit will affect an audio signal in the laboratory given the frequency response of the circuit.\n\nDesign, build and test an audio playback system which includes both analog and digital components.\n\nPrerequisites\n\n8.02 Physics II: Electricity and Magnetism\n, and\n18.03 Differential Equations\n.\n\nRecitations\n\nPlease attend your assigned recitation unless you have a scheduling conflict; if this is the case, please notify the staff either on the scheduling handout or by emailing. Recitation assignments will be posted. You should attend your assigned recitation over the course of the term. If you must change your recitation assignment after the first week of the term, please inform your TA or the head TA.\n\nTutorials\n\nTutorials will be held in the TA offices within the Lab during the beginning of the week and during the weeks when there is no lab in progress. Tutorial hours will be assigned and posted. Tutorials cancelled due to holidays will be rescheduled by your TA. Extra tutorials to address particularly challenging material will be scheduled throughout the term, depending on student demand; if you have interest in receiving extra help on a particular topic, please contact the head TA.\n\nTextbook\n\nThe course textbook is:\n\nAgarwal, Anant, and Jeffrey H. Lang.\nFoundations of Analog and Digital Electronic Circuits\n. San Mateo, CA: Morgan Kaufmann Publishers, Elsevier, July 2005. ISBN: 9781558607354.\n\nHomework\n\nHomework will be issued in lectures and collected a week later in recitation. Corrected homework with solutions will be returned in tutorials the week after it is collected. You are welcome and encouraged to discuss the homework among your colleagues. However, the final formulation and write up of your homework answers must be your own. Submitting homework copied from someone else is a breach of ethics, and will be handled by the Committee on Discipline. More importantly, although homework counts for only 5 percent of the grade, they are critical to learning the material and to doing well on the quizzes and final exam.\nOne homework problem will appear in each of the tests\n, and homework performance will be taken into account during grade assignment for cases that are on letter-grade boundaries.\n\nLate homework will not be accepted for grading\n. However, total homework grades will be based on the best nine out of eleven individual homework grades. Thus, with one exception, two homework assignments may be missed without a grading penalty.\nThe one exception is Homework #11, which is mandatory\n. Homework #11 will be a two-week design assignment that will also serve as the pre-lab exercises for Lab #4.\n\nAll homework will be graded on a coarse scale of 0 to 3 points. 3 points if all or nearly all problems are correct, 2 points if homework is approximately half correct, 1 point if mostly incorrect, and 0 points if late or not submitted.\n\nLabs\n\nLabs will be conducted during the weeks shown in the schedule. Each lab assignment involves one or more accomplishments which must be checked off by a TA in the lab. TAs will be available for help and lab check-off during those weeks in which a lab is in progress. Individual lab hours will be assigned and posted on the 6.002 Web site. Written lab work for labs 1 through 3, which is to be completed in a lab notebook, will be due in recitation on the day following the week of the lab. No written work will be due for the last lab. You are welcome and encouraged to discuss the labs among your colleagues. You are also welcome to team up in pairs to execute a lab. However, the write up of your lab must be done on your own. Skipping the lab and submitting work copied from someone else is a serious breach of ethics, and will be handled by the Committee on Discipline.\n\nLab assignments will be graded on a scale of 0 to 3 (3: lab complete, works, good job on pre- and post-lab; 2: lab mostly complete, reasonable job on pre and post lab; 1: lab partially done, marginal to poor job on pre- and post-lab; 0: lab not done, poor job on pre- and post-lab).\n\nLab Books\n\nYou must obtain a thin square-ruled hard cover notebook for recording measurements, observations and graphs of data taken during the in-lab exercises. Written pre-lab and post-lab exercises are also to be completed in your lab notebook. Your lab notebook must be turned in for grading during recitation following the lab week; it will be returned before the next lab.\n\nQuizzes\n\nTwo closed-book evening quizzes will be given in 6.002 this term. The first quiz will take place 3 days after R9, while the second quiz will occur 1 day after L18. Both quizzes will have a two-hour duration. There will be no lecture or recitation on the day of either quiz.\nYou may bring one two-sided sheet of notes to each quiz\n. You may also bring a calculator.\n\nFinal Exam\n\nA three-hour final exam will be given during the end-of-term exam week. Timing and room assignments will be announced later.\nYou may bring three two-sided sheets of notes to the exam\n.\n\nGrading\n\nInitial grading will be based on the following weighting:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n5%\n\nLabs\n\n5%\n\nQuizzes (25% each)\n\n50%\n\nFinal exam\n\n40%\n\nThis will be followed by considerable discussion among the entire teaching staff to factor in your diligence on the homework and labs, and your participation in class and tutorials. This discussion can affect your letter grade for the course, particularly if your initial grade is on a letter-grade boundary.\n\nFurthermore, failure to complete the labs in this subject will result in an overall grade that is one letter grade lower (not an Incomplete).\n\nThis subject has been designed so that lectures, recitations, tutorials, homework and labs are integral and essential parts of the learning process. Although there is no specific reward for participation, there is a clearly defined penalty for not participating. Students who consistently miss recitations, tutorials, homework and labs will not be included in the grading discussions.",
  "files": [
    {
      "category": "Resource",
      "title": "demo_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/2fed62c5b211b4e797066f264c90c738_demo_01.pdf",
      "content": "6.002 Demo# 01 ( Load set up Demo#01.set stored in scope)\ni-v characteristic of various components Agarwal\nFall 00 Lecture 1\n\nPurpose:\n\nThis demonstration shows the i-v characteristics of several components, showing both ideal behavior and real\nlimitations. It has been used in the context of an introduction to circuit theory, with particular emphasis on the\nabstractions made to result in linear, lumped circuits. Simple i-v characteristics of a variety of components that\nrespond to electrical stimuli, non-electrical stimuli, or that produce interesting non-electrical behavior (light,\nsmoke) are shown. The goal is to display to the student the abstractions made for simplicity of analysis, what\nthose abstractions ignore, and when they can break down.\n\nFor fun, a high voltage is also applied across a pickled cucumber (it begins to glow and emit a distinctive stink)\nto show that components can be modeled as lumped elements in so far as their i-v characteristics are concerned.\nAll other behavior, interesting or otherwise, is not modeled.\n\nAlso for fun, a high voltage is applied across a small resistor - the resistor sputters and blows up with an audible\ncrack. This to show that in practical systems, abstractions only go so far. The simple R model, for example, does\nnot model power dissipation limits.\n\nDescription: Lumped abstraction, relationship to physics, KVL, KCL\n\nCONNECT EXT1 (BLE) to INPUT OF THE BOX\nEXT2 (RED) to OUTPUT OF THE BOX ( Using 1 K Resistor )\n\nFor NEG. RESISTANCE, Set switch to Neg. Resistor/Bulb\n\nFor BULB, Set switch to Bulb and change the output resistor to 50 Ohm\nChange freq to .1 Hz on FG1 and go to File Load Setup click on 1A\n\nNote: Also we have for the first class the \" Burning Cucumber\" and also the \" Burning Resistors \"\nUse resistors in parallel for more actions.\nSee schematic on the next page for more detail\n\nNote: Current is on the Vertical X and Voltage is on the Horizontal X\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 off\nDC\noff\nCH4 ÷ 1k\n\n2 off\n\noff\nCH1 - CH4\n\n3 off\n\non\nF1 vs F2\n2m\n\n4 off\nDC\noff\n\nHorizontal: 2m\nAcquisition: AUTO AUTO\n\nTrigger:\nCH1\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n\n+6\n+25\n-25\nOUTPUT\n\nFg1 On\nSIN\n\noff\n\nTrigger: INT\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "demo_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/343d835ed0c9684c55588580c2eba55f_demo_02.pdf",
      "content": "6.002 Demo #02 ( Load set up Demo#02.set )\nKVL & KCL\n\nAgarwal Fall 00\nLecture 2\n\nPurpose:\n\nThis demo provides an example for KVL by measuring the voltages across components in a loop, and KCL by\nmeasuring the currents into a node. Nodal analysis is also compared with this example, by comparing measured\nvalues with calculated values. The circuit used is five resistors in a bridge topology, with an AC and a DC\nvoltage source. The AC source is used for KCL, along with a field-sensing current meter. The DC source is\nused with a multimeter for the comparison with calculated values.\n\nSteps:\n1. To show KVL, measure voltages around a loop and show that they sum to 0.\n2. To show KCL, measure currents into a node and show that they sum to 0. Additionally, take the three loose\nwires (see figure), bunch them together, and use the field-sensing meter to show the current is 0 when all\nthree wires are put into the ring together.\n\nNote: this demo should be performed in conjunction with a blackboard analysis of nodal analysis using the\nsame circuit as the demo.\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 off\n\n2 off\n\n3 off\n\n4 on\n10 mV/div\n0 off\n\nDescription: Nodal analysis\n\nShowing KVL and KCL Using bridge Resistor with 3 long wires on it and a brown\nbag to cover the wires! ( Done by Prof. Agarwal ).\n\nFor KVL, FG1 should be set at VDC 3 V offset, DC only.\n\nFor KCL, FG1 should be set at 3 V p-p sine wave, freq. 1kHz, and 0V offset.\n\nWe use digital meter (my meter) to show KVL instead of scope.\n\nFor the KCL we use and old current meter and set ch4 @ 10 mV/div (set meter at 1 mAmp \" not 1\nAmp range\". Clamp on each wire one at the time to show individual current and later all three wires\ntogether to show that the sum of all currents will be zero.\n\nNOTE: To show KVL set offset @ 3 v p-p which correspond to 3 v p-p because of the internal Hi Z\nOhm termination.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nHorizontal: 500 uS\nAcquisition: AUTO AUTO\n\nTrigger: CH1\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n\n+6\n+25\n-25\nOUTPUT\n\nFG1 SIN 0V 3 V DC Only Hi Z NOTE: FOR KVL\n\nFG1 DCV 3V 0V 1kHz\nHiZ NOTE: FOR KCL\n\nTrigger: INT\n\nDC\n(17) *\nDC Offset\nof FG1\nFG1\n8.2 K\nR1\n3. 9 K\nR2\n1.5 K\nR3\n3.9 K\nR4\n8.2 K\nR5\nKVl & KCL\nNodal\nAnalysis\nNote # of pins and\nBNC connectors\n(2) *\n246 mV\n1.366 V\n1.613 V\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "demo_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/a32a4d801b8fbe15490079f4f7fd498c_demo_03.pdf",
      "content": "6.002 Demo# 03 ( Load set up demo#03.set )\nSalt water\n\nAgarwal Fall 00\nLecture 3\n\nPurpose:\n\nThis demo uses a tray of salt water to demonstrate concepts such as linearity, superposition and Thevenin equivalent circuits.\nThe salt water is modeled as a complicated network of resistors, but its properties can be summarized using simple equivalent\ncircuits. Two sets of input terminals and one set of output terminals are connected to the tray, and the salt water is treated as a\n\"black box\". Two different signals (DC and a sinusoid) are placed across the inputs, and the resulting output is measured. The\noutput is shown to be the sum of the responses to the individual drives.\n\nSteps:\n1. (optional?) In describing the demo to the students (modeled by a complex linear resistor network), mention that regular\nwater (or distilled water) has a high resistance compared with salt water. Show this using the scope by showing the output\nwaveform growing when salt is added to the water. (Notes: the demo can behave erratically if stirred up too much. Also,\nthere is an opportunity here for a joke regarding the high conductivity of Cambridge water!)\n2. Show the inputs (constant, sinusoid) on the scope along with the total output. Turn off the sinusoidal source by removing\nthe cable. Now show the triangle source on the scope\n3. Turn on the sinusoidal source and the triangle source and observe the output with little triangle waveform ridding over the\nsine waveform.\n\nTriangle\n\nsin\nOutput\n\nWhen Prof. Agarwal ( Fall 00) asked question about the water if they knew where we got it ?\nSome students suggested water from Charles River!!!!!!\n\nSalt Water\nDescription: Linearity, superposition, Thevenin equivalences\n\nCONNECT EXT1 (Blue) to INPUT, EXT2 (Red) to OUTPUT **\n\nScope look @ CH1 and CH4\n\nFG1 set freq @ 1 Khz Amp 1 v p-p Offset zero Sine Wave\nFG2 set freq @ 10 Khz Amp 1 v p-p Offset zero Triangle Wave\n\nNote: see the pictorial diagram next page for more detail\n\n** We use direct connection because the jumper board was picking up signal without water!\nWe use the above connection instead the one on the last page. They both work.\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY].\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 on\nDC\noff\n\n2 off\n\noff\n\n3 off\n\non\n\n4 on\n200 mV 0\nDC\noff\n\nHorizontal: 500 us Acquisition: AUTO AUTO\n\nTrigger:\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n\n+6\n+25\n-25\nOUTPUT\n\nFG1\nSIN\n2 *\n1 Khz\n\noff\noff\noff\n\nFG2 Triangle 1\n10 Khz\n\nTrigger: INT\n\nNote\n\n1) Note: Prof Gary Removed cable completely from FG2 and did not show CH3. Add distilled water and show\nthe output CH4, later add cambridge water and the output should be shown.\n\n2) Remove FG1 cable and connected FG2 cable and do not show CH1, later connect FG1 and show CH1+CH3\nand CH4 output, combination of two inputs on CH4.\n\n* Prof Lang wants 2 V instead 1 V.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY].\n\nRed Cable input\nBlue Cable Input\nCH3\nCH1\nSalt Water\nBNC\nClips\n*\n* Make these connections with the Tee BNC externally because the wire\nhas been removed from broad due to noise\nSalt Water\nCH4\nOutput\nFG1 Sine\nFG2 Triangle\n*\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY].\n\nSalt Water Demo#03GS.set\nProf Sussman\nFall 01\nWaveform generator setup: same as prof Gray\nOscilloscope setup: Demo#03GS.set\nCable setup: see below\nExt Trig\nExt Trig\nGenerator #1\n1 Khz\nGenerator #2\n10 Khz\nOutput\nSync\nOutput\nSync\nCH 1\nCH 2\nCH 3\nCH 4\nAux\nTrig\nOscilloscope\nNormal water\n(Ionized)\nAll Grounds Tied together\nTo set sources to zero remove BNC from output of signal generator and attach 50 ohm load\n(terminator) Put Input signals FG1&FG2 on the side facing the edge of cart and input facing the\nopposite side side works better with a camera looking at them.\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY]."
    },
    {
      "category": "Resource",
      "title": "demo_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/488cdee0ff361c8227e2483e9b45b80d_demo_04.pdf",
      "content": "6.002 Demo# 04 (load set up demo#04L.set)\nNonlinear Device\n\nAgarwal Fall 00\nLectures 6, 7\n\nPurpose:\n\nIn this demo, a nonlinear device (a photo-transistor) is examined to motivate the concepts of linearization and\nsmall-signal models. The nonlinear transfer characteristic for the system including the photo-transistor is shown\non the scope. A music signal is then applied at the input, and the output is shown as a function of the input (as a\nsegment of the transfer characteristic). The output is also sent to a speaker. The nonlinearities are then seen on\nthe scope and heard as distortion, by adjusting the amplitude and bias of the input. It is an interesting aside to\nshow (by blocking the light beam) that the music is in fact being sent as a modulation of the light intensity.\n\nSteps:\n1. Using a large sinusoid, show on the scope the transfer characteristic of the nonlinear device, along with the\ninput sinusoid and distorted output waveform. The tone can also be played through the speaker, so the\ndistortion can be heard. (Stop here in lecture 6 to show nonlinear analysis).\n2. (Do this in lecture 7). Reduce the amplitude of the sinusoid to show that (via small-signal linear\napproximation) the output is an almost perfectly faithful (ignoring scaling) copy of the input.\n3. Switch the input from the sinusoid to music (CD player) in which distortion is easily heard. Adjust the\namplitude to show the effect of the nonlinearity.\n\nMusic\nSignal\n\nSinusoidal input\n\ntransfer characteristic\n\ndistorted output\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 on\n-1.07 V DC\noff\n\nLED\nphototransistor\nAMP\nDescription:\nNonlinear resistors, diodes, load line analysis, small signal.\n\nLinearization of Nonlinear Device (small-signal): Music played through optical connection\n\nNote: see schematic diagram next page for more detail; Fg1\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\n2 on\n200 mV 214.7 mV DC\noff\n\n3 off\n\noff\n\n4 off\n\noff\n\nHorizontal: 5ms Acquisition: AUTO AUTO\n\nTrigger:\nCH1\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n\n+6\n+25\n-25\nOUTPUT\n\n+5 +15 -15\n\nFG2 Sin 500 mV 0 500 Hz\n\nTrigger: INT\n\nNote: Jeff starts with 6 v Supply set @ 2.7 V and amplitude of FG2 @ 500\nmV. Later he changed the amplitude of FG2 to show distortion.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nPre Amp\nAMP\n5 V\n(19 ) *\n+15 V\n- 15 V\n(5) *\n100 K\n1 K\n50 K\n100 K\n1000 uF\n100 Ohm\n1000 uF\nNon Linear Device\n(2) *\n(2) *\n(2) *\n(2) *\n* Note: # of pins and BNC connectors\nBNC\n() Pins\n10 K\nCH4\n4A) Set FG2 = 500 HZ sine Amp = 1.5 v P-P @ 50 Ohm Prof. Agarwal Fall 00\n4B) Set FG2 = 500 HZ sine Amp = 1 v P-P @ 50 Ohm\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "demo_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/ca26202a698ffd6d540cc787aa3aa06c_demo_05.pdf",
      "content": "6.002 Demo# 05 ( Load set up Demo#05.set )\nSuperposition Using Resistors\nAgarwal Fall 00\nLecture 4\n\nPurpose: This demo is shown as a precursor to the intro to digital class, to motivate the use of digital logic. This\ndemo illustrates superposition using a simple 2-source, 2-resistor network. We can show the two inputs (a\nsquare wave and a sine wave) on the scope, along with the output. The output is obviously a linear combination\nof the inputs, but this point can be made clearer by switching off the inputs individually and examining the\ncorresponding output. This demo was used in the context of analog signal processing, and to motivate the digital\nabstraction.\n\nSteps:\n1. Show on the scope the two input signals (square wave and sinusoid) and the resulting \"adder\" output.\n2. Turn off each source independently to demonstrate superposition.\n\n3. This part is not demo'd, rather just drawn on the board. If the output is corrupted by noise, then it is hard to\nread.\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 on\nDC\noff\n\n2 on\nDC\noff\n\n3 on\nDC\noff\n\n4 off\nDC\noff\n\nHorizontal: 200 μ Acquisition: AUTO AUTO\n\nTrigger:\nCH1\n\nDescription: Superposition using resistors\n\nNote: See schematic diagram next page for more detail\nNoise\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n+6\n+25\n-25\nOUTPUT\n\nOn FG1 Sine\n2 0\n20 KHZ @ 50 Ohm\n\nOn FG2 Square 2 0\n1 KHZ @ 50 Ohm\n\nTrigger: INT, INT\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "demo_05a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/71bca38a4c023fd66921cee9132c44ab_demo_05a.pdf",
      "content": "6.002 Demo# 05A ( Load set up Demo#05A-RP.set)\nAND Gate output, noise Fall 00\nFall 00 Lecture 4\n\nPurpose: The \"chain-saw demo\" is a fun illustration of the digital abstraction. Two square waves are inputs to\nan AND gate, and the inputs and corresponding outputs are shown on the scope. A chain saw is used as a noise\nsource on one of the inputs. (Agarwal waltzes around in a men-in-black gig with the chain saw, the right\ncostume, and the right music, chopping a laptop with the chainsaw along the way). By adjusting the intensity of\nthe noise (using a potentiometer), the noise-immunity of digital circuits is exhibited, along with the breakdown\nwhen the digital abstraction is violated (when the noise is large).\n\n1. With switch in \"Coil\" position, adjust frequency of FG2 from 2.5 KHZ to 1.2 KHZ\nto illustrate \"AND\", and than return to 2.5 KHZ.\n2. With switch in \"Aux\" position and duty cycle of FG2 at 50%, input sine wave from\nFG3 into pin #16 (Aux port )\n3. With switch in \"Coil\" position, DISPLAY HAIRDRYER noise on scope ( Pot\nshould be set so that noise is not large enough to trip \"AND\" Gate\n4. With switch in \"Coil\" position DISPLAY CHAINSAW noise on scope ( Noise\nshould now be large enough to trip \" AND\" Gate.\n\nDescription: AND Gate output with Chain Saw noise\n\nSync Cable: From FG1 sync (Front) to FG2 Ext Trig (Back)\nTo trigger FG2 from FG1:\nPress [ SHIFT] (Burst) then press [Single] to activate external trigger (FG2 )\n\nNote: see schematic next page for more detail\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nOscilloscope Setup\n\nCH V/DIV OFFSET MODE FUNC MATH VERTICAL HORIZONTAL\n\n1 on 2 2.03 DC off\n\n2 on 5 -10 .44 DC off\n\n3 on 2 6.72 DC off\n\nNote! Music is played by A-V people so no need to take CD player\n\n4 off\n\noff\n\nHorizontal: 200 uS/div\nAcquisition: AUTO AUTO\n\nTrigger: CH2\n\nWaveform Generator Setup\n\nPower Supply Setup\n\nUNIT WAVE AMP OFFSET FREQ\n\n+6\n+25\n-25\nOUTPUT\n\nFG1 Square 5 2.5\n1 Khz * 5\n-15 on\n\nFG2 Square\n5 2.5\n2 Khz * Trigger:\nINT ( see above )!\n\nFG3 Sinewave large enough to be visible offset 0 5 KHZ, Amplitude not large enough to trip \"\nAND\" Gate. Adjust offset of FG3 such that sine wave riding on FG1 ( middle trace ) looks good,\nhowever, it is not possible to sync sine wave to pulse waveform.\n_______________________________________________________________________________________\n-\nFG1 & FG2 should be on HIGH Z\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY].\n\nFall 01 Prof.Sussman/Parker\nCHAIN SAW DEMO\nFG2\nSync\n(14)\n(2)\n100 K\n4.7 K\n100 k\n2 K\nCH3\nCH1\n(5)\n74LS08\n(20)\nCH2\n(7)\n(2)\n(2)\nSaw\nCoil\nor FG3\n(2)\non board coil\nAux\nCoil\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics,\nSpring 2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of\nTechnology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/ab181ec7aec9431046763e8dd8f55286_hw1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nHomework #1\nHandout S07-011\nIssued 02/08/2007 - Due 02/16/2007\nHelpful readings for this homework: Chapter 1, Chapter 2.1-2.5\nExercise 1-1:\nFor both networks shown below, find the voltage across and the current through each\nelement in the network. Be sure to make the polarity of the voltages and currents clear. Also, find the\npower generated or dissipated by each network element, and show that energy is conserved in total over\nthe network.\n+\n-\nR1\nR2\nR1\nR3\nI\nR2\nR3\nV\nExercise 1-2:\nUsing only 1k resistors, synthesize a resistor of 3/5k and a resistor of 5/3k. Use no\nmore than four 1k resistors in each case.\nExercise 1-3:\nExercise 2.7 from Chapter 2 of A&L (page 110).\nProblem 1-1:\nProblem 2.7 from Chapter 2 of A&L (page 113).\nProblem 1-2:\nFind the equivalent resistance of the following networks as viewed from their ports.\n(Hint: Try using an intuitive approach for this problem)\n2 --\n2R\n2 --R\n2R\n2 --R\n2R\n2 --R\n2R\n2 --R\n2R\nR\nR\nR\nR\nR\nR\nR\nR\nR\nR\nR\n2 --\n2R\nR\nR\nR\nR\nR\n(resistor pattern cont.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1-3:\nYou are given a black box with three terminals, as shown below. The box is known to\ncontain five 1-ohm resistors.\nA\nB\nC\nUsing an ohm-meter, you measure the resistance between the terminals to be the following:\nA - B: 1.5 ohms\nB - C: 3 ohms\nA - C: 2.5 ohms\nDetermine the configuration of the five resistors inside the box.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/15878f74dcca61c4298c957999778bc0_hw2.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nFall 2007\nHomework #2\nHandout S07-015\nHelpful readings for this homework: Chapter 3.\n3.3, 3.5-3.6.\nExercise 2.1: Determine the resistance of each network shown below as viewed from its port.\nR1\nR1\nR2\nR2\nR3\nR3\nR2\nR3\nR1\nR2\nR3\nR1\nNetwork (A)\nNetwork (B)\nNetwork (C)\nNetwork (D)\nExercise 2.2: For both networks shown below, find the voltage across each resistor. (Hint:\nmake use of the results of Exercise 2.1.)\nR2\nR3\nR1\nR2\nR3\n+\n-\nV\nI\nR1\nNetwork (A)\nNetwork (B)\nExercise 2.3: Following the node method, develop a set of simultaneous equations for the\nnetwork shown at the top of the following page that can be used to solve for the three unknown\nnode voltages. Express these equations in the form\n⎡\n⎤\ne1\n⎢\n⎥\nG ⎣ e2 ⎦ = S,\n( )\ne3\nwhere G is a 3x3 matrix of conductance terms and S is a 3x\nvector of terms involving the sources.\nYou need not solve the set of equations for the node voltages.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ne2\nR2\nI\nR4\nR5\nR3\nR6\ne3\ne1\nV -\n+\nR1\nExercise 2.4: Determine the power consumed by the 5Ω resistor in the network shown below.\n(Hint: use the series/parallel simplification method shown in Section 2.4 of the course notes.)\n-\n+\n10V\n4Ω\n5Ω\n15Ω\n5Ω\nProblem 2.1: Find the Thevenin and Norton equivalents of the following networks, and graph\ntheir i-v relations as viewed from their ports. (Hint: use superposition for Network B.)\ni\nR2\ni\nR2\n+\nv\nR1\n-\nV -\n+\nR1\nV -\n+\nI\nv\n+\n-\nNetwork (A)\nNetwork (B)\nProblem 2.2: Problem 3.9 from Chapter 3 of A&L (page\n87).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2.3: Two networks, N\nand N2, are described graphically in terms of their i-v\nrelations, and connected together through a single resistor, as shown below.\n(A) Find the Thevenin and Norton equivalents of N\nand N2.\n(B) Find the voltages v1 and v2 that result from the interconnection of N\nand N2.\ni2\n+\nv2\n-\nR\ni1\n+\nv1\n-\nN 1\nN 2\nv1\nI1\nv2\nV2\ni1\n-I2\ni2\n-V1\n(a) Network 1 (N1)\n(b) Network 2 (N2)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/78ffb2358df6708444c4b05fc44f920c_hw3.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nHomework #3\nHandout S07-019\nIssued 2/22/07 - Due 3/2/07\nReading: Chapter 5, Chapter 6.1-6.10.\nExercise 3.1. The number of Boolean functions of one variable (A) is four (F1, F2, F3, and F4), as it\ncan be learned from the truth table given in Table 1. Then:\na. How many different Boolean functions are there of 2 variables, and of 3 variables?\nb. How many different Boolean functions are there of n variables?\nA\nF1\nF2\nF3\nF4\nTable 1: Truth table for the different Boolean Functions of one variable.\nExercise 3.2. Do Exercise 5.6, page 275 of the textbook, parts a, b, and d.\nExercise 3.3. Do Exercise 6.2, page 322 of the textbook.\nProblem 3.1. Do Problem 5.2, page 278 of the textbook.\n(V)\n(V)\nFigure 1: Input/Output transfer characteristic for inverter of Problem 3.2.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3.2. An inverter has the input/output transfer characteristic shown in Fig. 1. This in\nverter obeys the static discipline for suitable choices of the voltages VOL, VIL, VIH , and VOH , (see\nFig. 5.8 on page 250 of the textbook), and those are such that NMH = NML. Then:\na. Give values of VOL, VIL, VIH , and VOH that actually achieve the static discipline with the maxi\nmum positive noise margin.\nb. What is the noise margin you obtained?\nProblem 3.3 For this problem, consider the convention that a logical one corresponds to a high\nvoltage level and a logical zero corresponds to a low voltage level. Thus, when the voltage vA\nassociated with the Boolean variable A is high (3V), A = 1. When vA is low (≈ 0V ), A = 0. The\nsame relation holds with vB and B, vC and C. Assume also the following:\n- The high voltage level is much greater than the threshold voltage.\n- The \"on\" resistance of the MOSFET is 100Ω.\n- The \"off\" resistance of the MOSFET is 100MΩ.\nThen, for each circuit in Fig. 2:\na. Generate a truth table which shows how the variable C (associated with vC ) depends on the\ninputs A (associated with vA) and B (associated with vB).\nb. For each particular entry of C in the corresponding truth table of part a., find the value of the\noutput voltage vc .\nFigure 2: Circuits for Problem 3.3.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/457f2ef8b94f22ec16e3ff52705c89e6_hw4.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nHomework #4\nHandout S07-023\nIssued 03/01/2007 - Due 03/09/2007\nHelpful readings for this homework: Chapter 4, Chapter 6.1-6.6, 6.10.\nExercise 4.1: Exercise 4.3 from Chapter 4 of A&L (page 231).\nExercise 4.2: Exercise 6.5 from Chapter 6 of A&L (page 323). Use Figure 6.59(c) instead and\nassume that R6 = R7 = 10kΩ.\nProblem 4.1: A voltage source can be represented as the series connection of an ideal DC voltage\nsource and a resistance RIN = 1kΩ, as illustrated in Figure 1a. The model of the voltage source\nalso includes a small signal voltage source vi to represent the noise generated by the source. Assume\nVI = 10 V and vi = 50 mV .\nVI\nvi\nRIN\nVI\nvi\nRIN\nRL\nvo + VO\n(a) Unloaded voltage source.\n(b) Loaded voltage source.\nFigure 1: Simple model of a non-ideal voltage source.\nIn practice, connecting the non-ideal voltage source to a load resistance RL, as in Figure 1b,\nmay result in undesirable effects. This problem studies such effects and how to correct them by\nintroducing a Zener diode into the circuit (Figure 2a).\n(a). In Figure 1b, calculate vo (i.e. output noise) and VO (i.e. DC output voltage) for RL = 2 kΩ\nand RL = 4 kΩ. What can you say about vo and VO as a function of RL?\n(b). Repeat part (a) for the voltage source in Figure 2a. In this setting, how do vo and VO change\nwith RL?\n(c). In Figure 2a, what is the minimum value of RL that would guarantee that the circuit operates\nas in part (b)?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\niD (mA)\nRIN\nVI\nRL\nvD\nvo + VO\nvi\n(a) Voltage source connected to a Zener\ndiode.\nvD (V )\n0.6 V\n-5 V\n1 A/V\n1 A/V\n(b) i-v characteristic for a Zener diode.\nFigure 2: The use of a Zener diode can correct some of the undesirable effects in non-ideal voltage\nsources.\nProblem 4.2: Consider the circuit containing the nonlinear element N as shown below in Figure 3.\nThe i-v relation for the element N is given by\niA = (10 A) 1 - e -vA/5V\n(1)\n2 Ω\nN\n+\n-\nvI\n+\n-\nvA\niA\nFigure 3: Circuit used in Problem 4.2.\n(a). Write an equation which relates the voltage vA to the input voltage vI .\n(b). Solve for the voltage vA when vI = 10 V . Note that this requires that you solve the equation in\npart (a) iteratively for vA. (Hint: Use the exponential term to solve for vA as a function of the\nassumed value of vA, and then iterate. Taking logs on both sides may facilitate convergence.)\n(c). Find the incremental change in vA for a 2% increase in vI and calculate the ratio ΔvA/ΔvI .\n(d). Find the value for the incremental resistance of the nonlinear element N by linearizing the\nexpression for iA about the operating point when vI = 10 V .\n(e). Draw the incremental circuit model for the circuit shown in Figure 3.\n(f). Find the ratio ΔvA/ΔvI from the incremental circuit model and compare it with your exact\nmodel from part (c).\nProblem 4.3 (OPTIONAL): Problem 4.3 from Chapter 4 of A&L (page 233-234). (Hint: You\nmay want to read section 4.4 of A&L on Piecewise Linear Analysis of non-linear devices).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/e26921fde419a3632a4241786551171e_hw5.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n\n6.002 - Electronic Circuits\nSpring 2007\n\nHomework #5\nHandout F07-028\n\nIssued 3/8/2007 - Due 3/16/2007\n\nHelpful Readings for this Homework: Agarwal & Lang Chapter 7.1 - 7.6\n\nExercise 5.1: Do Exercise 7.1 in Agarwal & Lang, page 390.\n\nExercise 5.2: Do Exercise 7.3 in Agarwal & Lang, page 391.\n\nProblem 5.1: Determine the Thevenin equivalent of the following circuit. Note that it contains a dependent voltage source, and\nthat the parameter α has units of Ohms.\n\nFigure for Problem 5.1\n\nProblem 5.2: This problem studies the two amplifiers shown on the other side of the page. Amplifier A is a single-stage\namplifier implemented with a voltage-dependent current source and a pull-up resistor. Assume that the current source parameters\nG and VT satisfy G > 0 and VS > VT > 0. Also assume that . Amplifier B is a two-stage amplifier in which each\nstage is identical to Amplifier A.\n\n(A) Determine vOUT as a function of vIN for Amplifier A.\n\n(B) Sketch and clearly label a graph of the input-output relation found in Part (A).\n\n(C) Determine vOUT as a function of vIN for Amplifier B.\n\n(D) Sketch and clearly label a graph of the input-output relation found in Part (C).\n\n(E) Consider Amplifier A again. Show that the dependent current source sinks power for vOUT > 0 and sources\npower for vOUT < 0.\n\n(F) Unlike the expression for the current in Amplifier A given with the figure on the next page, real-world devices do not supply\nadditional current when vOUT < 0. Instead the device saturates and the dependent current source supplies a constant current,\ngiven by VS / R. Redo parts (A) and (B) in light of this fact. What change (if any) occurs in the input-output relation of\nAmplifier B?\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure for P.5.2.\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/95e622ad8c877e6c14daafecc0b09516_hw6.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nHomework #6\nHandout - S07-030\nIssued 3/15/2007 - Due 3/23/2007\nReading: Section 7.7, and Sections 8.1-8.2 of A+L. Review Section 4.5\nExercise 6.1. Do Exercise 8.1 from A+L Chapter 8 (page 447).\nExercise 6.2. Consider a two-terminal device formed by a MOSFET with its gate tied to its drain.\nThe MOSFET is characterized by parameters VT and K, and its drain-to-source voltage and drain\ncurrent are denoted as vR and iR, respectively.\na. Write the vR - iR relation for this device operating under the saturation discipline (i.e. for\nvR ≥ VT ).\nb. Develop a small-signal model for this device about a dc operating point vR = VR, describing\nthe relationship between vr and ir.\nProblem 6.1. Do Problem 7.5 from A+L Chapter 7 (pages 396-397) with the following changes:\n- For part a., show that vOUT is related to vIN according to vOUT - 2(vIN - VT + RK )vOUT +\n(vIN - VT )2 = 0 instead of the equation listed in the book.\n- For part b., only find the range for vIN . Do not find the corresponding range for vOUT . You\nshould be able to do this without having to solve any quadratic equations.\nProblem 6.2. Do Problem 7.10 from A+L Chapter 7 (page 399).\n(Problem 6.3 on back)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nRL\nVS\n-\nvOUT\nVS\n+\nvIN\nFigure 1: Amplifier Dual power supplies layout.\nProblem 6.3. In many amplifiers we use dual power supplies so we can obtain a 0 V offset at the\noutput. An example is shown in Fig. 1.\nFor this problem, use VS\n+ = +1.5 V, VS\n- = -1.5 V, and MOSFET parameters K =1 mA/V2 and\nVT = 0.5 V. Then:\na. Find the value of RL such that vOUT = 0 V when vIN = 0 V.\nb. As vIN is increased, the output voltage vOUT decreases. For the value of RL found in part a.,\nfind the minimum output voltage vOUT such that the MOSFET will obey the saturation discipline.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/83a70cc0d4a8f73b2dfc8ed329949367_hw7.pdf",
      "content": "p\nMassachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nHomework #7\nHandout S07-036\nIssued 03/22/2007 - Due 04/06/2007\nHelpful readings for this homework: Chapter 8\nExercise 7.1: Exercise 8.2 from Chapter 8 of A&L (page 448).\nExercise 7.2: Exercise 8.6 from Chapter 8 of A&L (page 449).\nProblem 7.1:\nVS\nVS\nR\nR\nvI\nvMID\nvO\nFigure 1: A two-stage non-inverting MOSFET amplifier is shown above. In this problem, VI is\nchosen such that VI = VMID = VO\n(a). Show that the input bias VI for which VI = VMID = VO is given by:\n-1 +\n1 + 2KR(VS - VT )\nVI = VT +\nKR\n(b). Draw the small-signal circuit for the amplifier and use it to determine the small-signal gain\nG = vo/vi. Express G as a function of K, VT , VI and R.\nProblem 7.2: Parts (a), (b) and (c) of Problem 8.2 from Chapter 8 of A&L (page 450). In part\n(c), determine the small-signal gain in terms of gm = K(VIN - VOUT - VT ).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 7.3: This problem examines the behavior and application of a new field effect transistor\n(NewFET) with large-signal electrical characteristics as described in Figure 2. Here, it is assumed\nthat vDS ≥ 0. Note that the coefficient K and the threshold voltage VT are both positive and\nconstant.\niD\nvGS\nvDS\nFigure 2: Large-signal characteristics of the NewFet.\n(a). An amplifier is constructed with the NewFET as shown in Figure 3. Note that this amplifier\ndoes not have a load at its output. Derive an expression for vOUT as a function of vIN , in\nterms of the power supply voltage VS , the resistance R, and the NewFET parameters K and\nVT . Do so for 0 ≤ vIN ≤ VS assuming that 0 < VT < VS .\nFigure 3: The NewFet used as an amplifier.\n(b). For the amplifier shown in Figure 3 and analyzed in part (a), sketch and clearly label a graph\nof vOUT versus vIN for 0 ≤ vIN ≤ VS .\n(c). When the NewFET is biased into its active region, its small-signal model is as shown in\nFigure 4. Using the model shown in Figure 4, find id in terms of gm, ro, vgs, and vds.\n(d). Assuming that the NewFET is biased into its active region, derive expressions for the small-\nsignal-model parameters gm and ro in terms of the large-signal-model parameters K and VT ,\nand the bias voltages VGS and VDS .\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure 4: Small-signal model of the NewFET when biased in its active region.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/65346a991b4299dfc3e7ce4a8dd6165b_hw8.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n\n6.002 - Electronic Circuits\nSpring 2007\n\nHomework #8\nHandout S07-040\n\nIssued 4/5/2007 - Due 4/13/2007\n\nHelpful Readings for this Homework: Chapter 10 of A&L\n\nExercise 8.1: Chapter 10, Exercise 10.16 (p. 572)\n\nExercise 8.2: Chapter 10, Exercise 10.24 (p. 575), assuming RC time constants are small.\n\nProblem 8.1:\n\nLem E. Tweakit, a junior in course VI, wants to control his dorm-room lights from his personal computer.\nHe proposes to use a data line from the parallel port on the computer to control the lights, because it is\neasy to write a program that controls the signal on the parallel port. A TTL parallel port is guaranteed to\nput out a HIGH signal of greater than VOH = 2.4 Volts and it is guaranteed to put out a LOW signal of less\nthan VOL = 0.4 Volts. However, the lights are 110 Volts at 60 Hz AC, so of course, he cannot directly\ncontrol the lights from the parallel port. Lem wants to use a relay to work the lights, but the only relay\nthat Lem has in his junkbox requires 100 mA to reliably close the switch. Unfortunately, his parallel port\ncannot supply anywhere near that much current. He decides to use a MOSFET stage to control the relay,\nso that it can control the lights. Lem's idea is shown in Figure 1. When Lem's computer puts out a\nHIGH, current flows through the relay coil and the light switch turns on; when the computer puts out a\nLOW, the current is stopped and the light switch turns off.\n\nNote: A relay is an electromagnetically-controlled switch. It has a coil of wire that becomes a magnet\nwhen current is passed through it. The magnet is used to move an iron armature which actuates a switch.\nOf course, the coil of wire has inductance and resistance.\n\nThe MOSFET that Lem uses has an ON resistance of about RON = 5 Ohms. It has a threshold voltage of\nabout VT\nT = 1.5 Volts. The coil of the relay has an inductance of about 1 Henry and a resistance of about\n40 Ohms. For all practical purposes, the computer's output voltage changes instantaneously.\n\n(A) Assume that the computer output has been LOW for a long time; it then goes HIGH. Draw a graph of\nthe current in the relay coil as a function of time. At what time does the relay close and the light go on?\n\n(B) Assume that the computer output has been HIGH for a long time; it then goes to LOW. What happens\nto the voltage vDS from the drain to the source of the MOSFET? (Hint: Consider what happens to the\ncurrent in the relay coil at the time of the transition. What does that tell you about the voltage across the\nrelay coil at the time of transition?) Do you expect smoke? Your answer to this part should be only a few\nshort sentences!\n\n(C) Suppose Lem puts a diode across the relay coil as in Figure 2 and the circuit schematic of Figure 3\nbelow. Draw a graph of the current in the relay coil as a function of time, starting when the computer\noutput drops from HIGH to LOW.\n\nProblem continued overleaf...\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNote: A diode is a two-terminal device that can be modeled, for this problem, with the characteristic:\n\nFigure 3.\n\n(D) For the circuit with the diode installed, draw a graph of the voltage across the relay coil inductor and\na graph of the voltage vDS across the MOSFET for the same time period. How does the diode solve the\nproblem raised in part B?\n\nProblem 8.2: Chapter 10, Problem 10.4 (p.578). Your answer may also depend on RL (as well as VS, VL,\nRON, CGS, wire length, l, and wire parameters).\n\nProblem 8.3: Chapter 10, Problem 10.29, parts a, c, and e (p. 591-592). Hint: Try an intuitive approach to\nthe graphs in parts (a) and (c), instead of solving differential equations.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/3bcfb33ff7a4e60cee8cf8acbffbd110_hw9.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nHomework #9\nHandout - S07-45\nIssued 4/12/2007 - Due 4/20/2007\nHelpful Reading for this Homework: Chapter 12.\nExercise 9.1. Find the inductance of the all-inductor network, and the capacitance of the all-capacitor\nnetwork, shown below.\nExercise 9.2. Each network shown below has a non-zero initial state at t = 0 s, as indicated. Find the\nnetwork states for t ≥ 0 s. Hint: what equivalent resistance is in parallel with each capacitor or inductor,\nand what decay time results from this combination?\n-\nProblem 9.1. At t = 0\ns, the networks shown below have zero initial state; the inductor current i(t) and\n-\nthe capacitor voltage v(t) are both zero at t = 0\ns. At t = 0 s, the current source produces an impulse of\narea Q, and the voltage source produces an impulse of area Λ.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nA Derive the differential equation that relates i(t) to I(t) and v(t) to V (t). Hint: consider using Thevenin\nand/or Norton equivalents to simplify the work.\nB Find the inductor current i(t) and the capacitor voltage v(t) at both t = 0+ s and t = inf. Feel free\nto determine the states through either physical or mathematical reasoning. However, explain your\nreasoning in any case.\nC Next, find the time constant by which each state goes from its initial value at t = 0+ s to its final value\nat t = inf.\nD Using the previous results, and without necessarily solving the differential equations directly, con\nstruct i(t) and v(t) for t ≥ 0 s. Alternatively, find i(t) and v(t) by any means you choose, but be sure\nto explain your reasoning.\nE Verify that the solutions to part D are correct by substituting them into the differential equations found\nin part A.\nProblem 9.2. This problem examines the relation between transient responses of linear systems.\nI(t)\niL\nL\nR\nA Find the inductor current iL(t) for t ≥ 0 s in response to the current step I(t) = IStep(t) = I0u(t).\nAssume that i(0) = 0.\nB Find the inductor current iL(t) for t ≥ 0 s in response to the current step I(t) = IRamp(t) = I0αtu(t).\nAgain, assume that i(0) = 0.\nd\nC The step input can be constructed from the ramp input according to IStep(t) = α\ndt IRamp(t). Show that\ntheir respective responses are related in a similar manner. (Note: you could have used this relation\nto solve part B given your answer to part A.)\nD Would the result from part C hold if i(0) = 0? Why or why not?\nProblem 9.3. The network shown at the top of next page includes a switch with three positions: A, B and\nC. Prior to t = 0 s, the switch is in Position B, and the inductor current i(t) and the capacitor voltage v(t)\nare both zero. The voltage source V is constant.\nA At t = 0 the switch moves to Position A, and it remains there until t = T1. Find i(t) and v(t) for\n0 ≤ t ≤ T1.\nB At t = T1 the switch moves to Position C without interrupting the current i(t), and it remains there\nuntil i(t) goes to zero, at which time the switch moves back to Position B. Define the time at which\ni(t) goes to zero as t = T2. Determine T2, and find both i(t) and v(t) for T1 ≤ t ≤ T2.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nB\nA\nC\n+\nL\nv(t)\nV\nC\n-\ni(t)\nC The switch remains in Position B until t = T3. Find both i(t) and v(t) for T2 ≤ t ≤ T3\nD At t = T3 the switch moves again to Position A, and it remains there until t = T4. Find i(t) and v(t) for\nT3 ≤ t ≤ T4.\nE Finally, at t = T4 the switch moves to Position C, and it remains there until i(t) first goes to zero, at\nwhich time the switch moves back to Position B. Define the time at which i(t) again goes to zero as\nT5. Determine T5, and find both i(t) and v(t) for T4 ≤ t ≤ T5.\nF Sketch and clearly label i(t) and v(t) for 0 ≤ t ≤ T5\nProblem 9.4. This problem is continuation of Problem 9.3. It explores the use of energy conservation to\nanalyze the operation of the network described therein.\nA Determine the energy stored in the inductor at t = T1.\nB The energy stored in the inductor at t = T1 is fully transferred to the capacitor at t = T2. Use this fact to\ndetermine v(T2). This answer should match your answer in part B of Problem 9.3 when the latter is\nevaluated at t = T2.\nC Determine the energy stored in the inductor at t = T4.\nD Use energy conservation to determine the energy stored in the capacitor at t = T5, and then determine\nv(T5). This answer should match your answer to part E of Problem 9.3 when the latter is evaluated\nat t = T5.\nE Now let the switch move repetitively through the cycle of Positions B to A to C to B. Assume that in\neach cycle the switch remains in Position A for the duration T . Further, assume that switch always\nmoves from Position C to Position B when i(t) reaches zero. Assuming that v and i are initial zero,\ndetermine v at the end of the nth switching cycle in terms of n, C, L, T and V .\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "hw10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/c9c4deafe4bb5a665d8322778aa5d194_hw10.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nHomework #10\nHandout S07-048\nIssued 04/19/2007 - Due 05/02/2007\nHelpful readings for this homework: Chapter 12.1-5, 12.7, Chapter 13.1-3\nExercise 10.1: Exercise 12.3 from Chapter 12 of A&L (page 695).\nExercise 10.2: Exercise 14.4 from Chapter 14 of A&L (page 824). Hint: Use the impedance\nmethod.\nProblem 10.1: In the network shown below, the inductor and the capacitor have zero current\nand voltage, respectively, prior to t = 0. At t = 0, a step in voltage from 0 to Vo is applied by the\nvoltage source indicated.\nFigure 1: A step-driven series RLC circuit.\n(a). Find vC, vL, vR, i, di/dt just after the step at t = 0.\n(b). Argue that i = 0 at t = inf so that i(t) has no constant component.\n(c). Find a second-order differential equation which describes the behavior of i(t) for t > 0.\n(d). Following parts (a) and (b), the current i(t) takes the form i(t) = I sin(ωt + φ)e-αt . Find I,\nω, φ and α in terms of Vo, R, L and C.\n(e). Suppose that the input is a voltage impulse with area Λo, where Λo = τVo, Vo is the amplitude\nof the voltage step shown in Figure 1 and τ a given time constant. Repeat parts (a), (b), (c)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nand (d) for the network shown in Figure 1. Hint: Assume that the current i(t) takes the form\ni(t) = [A cos(ωt) + B sin(ωt)]e-αt .\n(f). Using the expression for i(t) found in part (d), verify your answer to part (e) by considering\nthe relation between step and impulse responses.\nSave copies of your work for the pre-lab of Lab 3.\nProblem 10.2: The network shown in Figure 2 is driven in steady-state by the sinusoidal current\niIN(t) = Iin cos(ωt).\nThe output of the network is the voltage vOUT(t), which takes the form\nvOUT(t) = Vout cos(ωt + φ). Find Vout and φ as functions of ω as follows.\n(a). Find a differential equation that can be solved for vOUT(t) given iIN(t). Hint: consider how\nvOUT (t) is related to the inductor current.\n(b). Let iIN(t) = Re{Iinejωt}. Also let vOUT(t) = Re{Vˆoutejωt}, where Vˆout is a complex function\nof the circuit parameters, ω and Iin. With these definitions, find Vˆout.\n(c). An alternative way to write vOUT(t) is as vOUT(t) = Re{| Vˆout|ej(ωt+\nVˆout)}. Determine |Vˆout|\nand Vˆout as functions of the circuit parameters, ω and Iin. Then, find Vout and φ for the\noriginal cosine input, again both as functions of the circuit parameters ω and Iin.\n(d). Sketch and clearly label Vout/Iin and φ as functions of ω. Identify the low-frequency and\nhigh-frequency asymptotes on the sketch.\nFigure 2: A first-order network driven in steady-state\nProblem 10.3: Parts (a), (b) and (c) of Problem 14.16 from Chapter 14 of A&L (page 834).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "final_f00.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/0cb29e28115d9dfa9c44c2545111ce84_final_f00.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nFall 2000\nFinal Exam\n- Please write your name in the space provided below, and circle the name of your recitation\ninstructor and the time of your recitation.\n- Please verify that there are 19 pages in your exam.\n- To the extent possible, do all of your work on the pages contained within this exam. In\nparticular, try to do your work for each question within the boundaries of the question, or on\nthe back side of the page preceding the question.\n- You may use three double-sided pages of notes while taking this exam.\n- Final grades in 6.002 will not be given out by phone or by e-mail. Rather, they should be\navailable through WEBSIS by December 22. You may review and take back your final exam\nat the beginning of IAP in January 2001 from Room NE43-624.\n- Good luck!\nProblem\nScore\nTotal\nName:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1\n-\n15 Points\nThe Op-Amp circuit shown below is very similar to the standard non-inverting Op Amp except\nthat RL is some external resistor, and we are interested in showing that the current through RL\nis nearly constant, regardless of the value of RL, that is, the circuit acts like a current source for\ndriving RL.\nRL\nR2\niL\nA\nA'\n-\n+\nvI\n-\n+\n(A) Using the Op-Amp model shown below, derive an expression for iL in terms of vI, A, R2 and\nRL. Show that this expression for iL becomes independent of RL as A approaches infinity.\nvO\n+\nv+\nv\n+\nv\nv\n+\nvO\n+\nA( )\n+\nv\nv+\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(B) To verify the \"current source\" action more directly, use the Op-Amp model from Part A to\nfind the Th evenin equivalent resistance looking to the left of terminals AA′.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2\n-\n15 Points\nThis problem involves the circuit shown below.\nYou are given that R = 1Ω, C = 1μF, and\nK = 1\n\nAmps\nVolt\n\n.\n2R\n+\nR\n2R\n+\nvC\niD\n+\nvD\nV A\nva\n+\nis \"small\"\nva\nCharacteristics of nonlinear device:\nwhen\nwhen\niD\n=\nvD\n≤\niD\nKvD\n=\nvD\n>\nC\niD\nvD\n-\n(A) Find the operating point voltage VD and the operating point current ID in the circuit shown\nabove. Assume for this part that VA = 12V .\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(B) Now assume that VA is changed such that a new operating point ID0 and VD0 is obtained,\nwhere VD0 = 1V . (Note that this operating point may differ from your answer in Part A.)\nDraw the small-signal circuit, substituting numeric values where possible. Label the small-signal\ncapacitor voltage vc and the small-signal device voltage vd. (Recall, the small signal model for a\ncapacitor is the capacitor itself.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nvc\nt\nvd\nt\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3\n-\n15 Points\nA nonlinear device with voltage vd and current id has a characteristic given by\nid = Ieαvd\nwhere vd > 0 and id > 0.\nvd\n+\nid\n-\nFor all parts of this problem assume that the operational amplifiers are ideal, that they are operating\nin the active region and that the nonlinear device is operating with positive values of vd and id.\n(A) For the nonlinear element connected as shown below, find an expression relating vout to vin.\nvin\n+\n+ vd\nid\nvout\nR\n-\n-\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(B) For the nonlinear element connected as shown below, find an expression relating vout to vin.\nvin\n+\nvd\nid\nvout\nR\n+-\n(C) For the operational amplifier circuit shown below, find an expression relating vout to vin1, vin2,\nand vin3.\nvin1\nvout\nvin2\nvin3\nR\nR\nR\nR\n+\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(D) Find an expression for vout as a function of va and vb for the circuit shown below. Hint: Use\nthe results of the previous parts of this problem.\nvA\n+\nvd\nid\n+ vd\nid\nvB\n+ vd\nid\n+\nR\nR\nR\nR\nR\nR\nR\n+\n+\nvd\nid\nvout\nR\n+\n+\n+\n+\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 4\n-\n15 Points\nAnna Logue, a UROP student working for Professor S., has just found a rather strange piece of\ncircuitry in the trash just outside the office of Prof. A. The circuit has three exposed terminals\nand it has exactly one resistor, one inductor, and one capacitor, but she cannot see how they are\nconnected, because the connections are protected by epoxy. She can read the capacitor label: it\nsays that the capacitor has a capacitance of 1μF (Observation O1). However, the other labels are\nnot readable.\nBeing a naturally curious MIT student, Anna takes the circuit to the 6.002 lab to see what can be\ndetermined about this strange device by experiment. Anna labels the terminals with the letters\n\"x\", \"y\", and \"z\" with a marker pen. She then takes several measurements. First, Anna measures\nthe resistances between the terminals of the mystery circuit with an Ohmmeter, and makes the\nfollowing observations:\nx -y: infinity (Observation O2)\ny -z: infinity (Observation O3)\nz -x: 40 Ω(Observation O4)\nNext, Anna uses a signal generator, which may be modeled as a voltage source, to apply a 1\nVolt, 100 Hz, square-wave signal from the x terminal to the y terminal. She uses her oscilloscope\nto display the voltage from z to y superimposed on the square wave, at the same scale as the\nsquare wave, as shown in the figure below (Observation O5). As you can see, she observes that the\nwaveform from z to y follows the square wave, but there is ringing with a cycle time of about 1 ms.\n-2\n-1\n+1\n+2\n0.005\n0.01\n0.015\n0.02\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(A) Circle the circuit below which best reflects the contents of the mysterious circuit. Assume that\nthe inductor and capacitor are ideal. Justify your choice with a two or three sentence explanation.\nx\ny\nz\nx\ny\nz\nx\ny\nz\nx\ny\nz\nx\ny\nz\nx\ny\nz\n(1)\n(6)\n(3)\n(5)\n(4)\n(2)\n(B) What is the inductance (approximately) of the inductor that is in the circuit? What is the\nresistance of the resistor?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(C) Assume that Anna uses the signal generator to apply the same 1 Volt, 100 Hz, square-wave\nsignal from the x terminal to the y terminal. For the circuit you chose in Part A, sketch the form\nof the time-domain graph of the voltage from the terminal labeled x to the terminal labeled z.\nClearly indicate the values just before and just after each transition of the input.\n-4\n-3\n-2\nt\n-1\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 5\n-\n10 Points\nFor the network shown below, determine an expression for the indicated variables for t > 0 and\nprovide clearly labeled sketches of your result. Assume that the Op-Amps are ideal and that they\nare operating in the active region. Further assume that the initial current through the inductor is\nzero, and that the initial voltage across the capacitor is also zero.\n+\n=\nt\n>\n10K\n+\nvi\n10mH\n5K\n+\n10K\n0.001μF\n+\nv1\n1 2 3\nvi\nt (μsec)\n2 3\nv1\nt (μsec)\nv0\nv1\n=\nt\n>\nv0\n+v0\n2 3\nt (μsec)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 6\n-\n15 Points\nLooking to recover from a disastrous product introduction, the marketing team of Yikes Inc. has\nchanged the company name to Yehaa Inc. Furthermore, they hire several MIT undergraduates with\na 6.002 background in the hopes they will turn the company around. One of the engineers discovers\na new three-terminal device which can be manufactured at a lower cost than the MOSFET. This\ndevice has the characteristics shown below:\nvDS (volts)\niDS (mA)\nvCS\nV T\n≥\nvCS\nV T\n<\nC+\nS\nD\niC\n=\nvDS\n+\nVT\n3V\n=\niDS\nvCS\n(0V, )\n0mA\n(1V, )\n8--mA\n(1V, )\n------mA\nAs depicted in the figure, when vCS ≥VT , the vDS versus iDS relationship is a straight line passing\nthrough the points (0V, 0mA) and (1V, 1\n8mA).\nWhen vCS < VT , the vDS versus iDS relationship is a straight line passing through the points\n(0V, 0mA) and (1V, 1\n48mA).\nThe current into node C of the device is always zero. In a rare display of insight, the marketing\ngroup names this device the LOSFET.\nBased on their experience with MOSFETs, the Yehaa Inc. engineers use the LOSFET to build the\ninverter circuit shown below.\nvI\nC\n+\nV S\n5V\n=\nvO\n+\n12K\nD\nS\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(A) Sketch vI versus vO for the inverter.\n1 2 3 4 5\nv0\nvI\n(B) Yehaa's sales team discovers that networking equipment company Disco Inc. buys huge quan-\ntities of MOSFET inverters. Disco's systems operate under a static discipline with the following\nvoltage thresholds:\nVIL = 2.5V , VIH = 3.5V , VOL = 2.2V , and VOH = 3.9V .\nDetermine whether Yehaa's inverters satisfy this static discipline. Justify your answer.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(C) In a given situation, a Yehaa inverter drives a capacitive load with capacitance C = 1pF as\nshown in the figure below. Assume that the input to the inverter is at 5V and that the output is at\nsome voltage VLOW . Suppose that the input switches instantaneously to 0V. Find the time taken\nby the output of the inverter to rise to VOH following the 5V to 0V transition at the input. Express\nyour answer in terms of VLOW and VOH.\nC\nvI\nC\n+\nV S\n5V\n=\nvO\n+\n12K\nD\nS\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 7\n-\n15 Points\nConsider the amplifier circuit shown below. Assume that the MOSFET operates in saturation so\nthat\niDS = K\n2 (vGS -VT )2\nvGS\nV S\nRL\nV S\nR1\nR2\nvDS\nG\nD\nS\n+\n+\n(A) A small-signal model for the MOSFET in the amplifier circuit is shown below. Given that\nVS = 10V , VT = 1V , and K = 1mA/V 2, determine a constraint on the values of R1 and R2 such\nthat gm = 4mA/V .\n+\nD\nvgs\nG\nids\ngmvgs\n=\nS\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(B) Draw the small-signal circuit model for the circuit shown below. Assume that the MOSFET\noperates in its saturation region and is biased such that the value of gm in its small-signal circuit\nmodel is gm0. Clearly label the small-signal voltages vi and vo.\n+\nvi\nV S\nR1\nRL\nRO\nCI\nR2\nCO\nvo\nV S\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(C) Now assume that the amplifier from Part B is driven by a small-amplitude input of the form\nvi = Viejωt. Further assume that\nRL = RO = R\nR1 = R2 = 2R\nCI = CO = C\nDetermine the complex small-signal gain of the amplifier H(jω) = Vo\nVi in terms of C, R, gm0, and ω.\nWhat is the magnitude of the small-signal gain of the amplifier as ω approaches infinity.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz1_f03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/3e44f02d4dbcd4063cf27d23558ccbeb_quiz1_f03.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nFall 2003\nQuiz 1\n- Please write your name on each page of the exam in the space provided, and circle the name\nof your recitation instructor and the time of your recitation at the bottom of this page.\n- Please verify that there are 14 pages in your exam.\n- To the extent possible, do all of your work on the pages contained within this exam. In\nparticular, try to do your work for each question within the boundaries of the question, or on\nthe back side of the page preceding the question. Extra pages are also available at the end of\nyour exam.\n- You may use one double-sided page of notes and a calculator while taking this exam.\n- Good luck!\nProblem\nPoints\nScore\nGrader\nTotal\nName:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\nProblem 1\n-\n20 Points\n2 Ω\n2 Ω\n3V\n6A\n4 Ω\nA\nB\n16 Ω\n4 Ω\n12 Ω\n4 Ω\n4 Ω\n4 Ω\n8 Ω\n8 Ω\n(A) Determine the values of R1, R2 and R3 so that the entire circuit above is equivalent to the\nsimpler circuit shown below for the purpose of creating the Norton equivalent of the above circuit\nwhen viewed from its port labeled A-B.\nR3\n3V\n6A\nA\nB\nR2\nR1\nR1 =\nR2 =\nR3 =\n(over)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\n(B) Assuming R1 = R2 = R3 = 8Ωin the circuit in Part (A), draw the Norton equivalent of the\ncircuit when viewed from its A-B port. Note that these may not be the values you obtained in Part\n(A). (Be sure to specify element values, units and polarities.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\nProblem 3\n-\n15 Points\n(A) The digital circuit below has logic inputs P1, P2, ... Pn, S1, S2, ... Sm and output X. Assuming\nthat the element values are chosen so that the circuit satisfies a static discipline, what is the logic\nfunction computed by the circuit?\nRL\nP1\nP2\nP3\nPn\n. . .\nX\nS1\nS2\nS3\nSm\nVS\n. . .\nX =\n(B) For what choice of logic input values is the maximum power consumed by the circuit? Assume\nthat all the MOSFETs have a nonzero value for their ON resistance.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\nProblem 4\n-\n25 Points\nThe semiconductor device team at Yenron Inc. has created a remarkable new device called the\nLOSFET. The symbol for the device and its equivalent circuit model are shown below.\nG\niDS\nD\nS\nvGS\n+\n-\n-\n+\nvDS\nG\niDS\nD\nS\nvGS < 2V\n-\n+\nvDS\n1mA\niDS\nD\nS\n-\nvDS\nG\n+\nvGS > 2V\n1k Ω\nvGS\n+\n-\nvGS\n+\n-\nLike the MOSFET studied in 6.002, the LOSFET has three terminals labeled G (gate), D\n(drain), and S (source). When vGS < 2V , the device displays an open circuit between its D and S\nterminals, and when vGS ≥2V , the device behavior between its D and S terminals can be modeled\nby a 1mA current source in parallel with a 1kΩresistor. The current into the gate G is always 0.\n(A) Plot the iDS versus vDS curve for the LOSFET when vGS < 2V in the range -5V ≤vDS ≤+5V .\niDS (mA)\nvDS (volts)\n-1\n-2\n-3\n-4\n-5\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\n(B) Plot the iDS versus vDS curve for the LOSFET when vGS ≥2V in the range -5V ≤vDS ≤+5V .\nClearly mark all relevant intercept values on the two axes.\niDS (mA)\nvDS (volts)\n-1\n-2\n-3\n-4\n-5\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\n(C) Yenron engineers use the LOSFET to build the inverter circuit shown below.\nG\nD\nS\nvIN\n+\n-\n-\n+\nvOUT\nVS\nRL\nAssuming that VS = 4V and RL = 1kΩ, determine vOUT for (i) vIN = 0V and (ii) vIN = 4V .\n(Remember that the LOSFET turns ON for vGS ≥2V .)\n(i) vIN = 0V,\nvOUT =\n(ii) vIN = 4V,\nvOUT =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\n(D) Yenron develops several inverters using the same LOSFET but with various values of VS and\nRL. One of the inverters produces a high output of vOUT = 5V and a low output of vOUT = 1V .\n(Note that although this inverter has the same internal circuit as the inverter described earlier, this\ninverter has different values of RL and VS).\nDetermine whether this inverter satisfies a static discipline with the following voltage thresholds:\nVOH = 3.5V , VOL = 0.5V , VIH = 2.5V , and VIL = 1.9V . (Simply answer yes if it satisfies the\nstatic discipline. If your answer is no, indicate a threshold that is not met by the device.)\n(E) Next, determine whether the inverter in Part (D) satisfies a static discipline with the following\nvoltage thresholds: VOH = 3.0V , VOL = 1.5V , VIH = 1.9V , and VIL = 1.7V . (Simply answer yes\nif it satisfies the static discipline. If your answer is no, indicate a threshold that is not met by the\ndevice.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\nProblem 5\n-\n20 Points\n(A) Yikes, Inc. has developed the new device shown below that requires the application of voltages\nin the range 0V to 3V at its A-B port.\nA\nB\nThe Yikes engineers rummage through their supply room but cannot find an appropriate variable\nvoltage source, rather they find only one 9V battery and several 1kΩfixed and variable resistors.\n(A 1kΩvariable resistor can vary between 0Ωand 1kΩ). Symbols for these elements are shown\nbelow.\n9V\n9V battery\n1k Ω\n1k Ω\n1k Ω\n1k Ωvariable\nresistor\nresistor\n(many\n(many\navailable)\navailable)\n(only one\navailable)\nYou are called in as a 6.002 expert to help the Yikes engineers. The Yikes engineers also tell\nyou that the resistance looking into the A-B port of the device is infinite. Design a circuit that can\nsupply voltages in the exact range 0V to 3V using only the circuit elements in the supply room.\nClearly mark the terminals in your circuit which must be connected to the A-B port of the device.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nName:\n(B) Always looking to help your client, you notice that the device would work even better if voltages\nin the exact range -3V to +3V were applied at its A-B port. Design a circuit that can supply these\nvoltages using only the elements available in the supply room. (Hint: Try producing two separate\nvoltages, v1 and v2, that can be varied independently such that v1 -v2 produces the desired output\nvoltage.)\n(End)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz1_f06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/30af3faaaae25b7115141a1f7fcf9434_quiz1_f06.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nFall 2006\nQuiz #1\n3 October 2006\nName:\n-\nThere are 14 pages in this exam, including this cover page.\n-\nPlease put your name in the space provided above, and circle the name of your recitation\ninstructor together with the time of your recitation.\n-\nDo your work for each question within the boundaries of that question, or on the back of\nthe preceding page. When finished, write your answer to each question in the corresponding\nanswer box that follows the question.\n-\nRemember to include the sign and units for all numerical answers.\n-\nThis is a closed-book exam, but calculators are allowed.\n-\nYou have 2 hours to complete this exam.\n-\nGood luck!\nProblem 1\nProblem 2\nProblem 3\nTotal Grade\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1 - 35 Points\nThe circuit shown below models the power distribution network in a digital processor. The voltage\nsource models the external supply that powers the processor, the resistors model the power distri-\nbution wiring internal to the processor, and the current sources model the loads presented by the\nindividual parts of the processor. The source values V , I1, I2 and I3 are all positive, as are the three\ninternal node voltages e1, e2 and e3. Further, depending upon whether the corresponding part of\nthe processor is in use or not, I1, I2 and I3 can each take on only the value of either I or zero.\nDigital\nProcessor\nV\nR1\ne1\nR2\ne2\nR3\ne3\nI3\nI1\nI2\n(1A)\n(10 Points)\nUsing the node method, develop a set of simultaneous equations for the power\ndistribution network that can be solved for the three unknown node voltages e1, e2 and e3.\nExpress these equations in the form\nG\n\ne1\ne2\ne3\n\n= S\nwhere G is a 3 × 3 matrix of conductance terms and S is a 3 × 1 vector of terms involving\nthe sources V , I1, I2 and I3. You need not solve the set of equations for the node voltages.\nAnswer\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1B)\n(10 Points)\nGiven the possible values for I1, I2 and I3, what are the maximum and mini-\nmum values that e2 can exhibit? Express your answer in terms of V , I, R1, R2 and R3.\nMax e2 =\nMin e2 =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1C)\n(5 Points)\nGiven the possible values for I1, I2 and I3, what is the maximum power that\nthe voltage source must be able to supply to the processor? Express your answer in terms\nof V , I, R1, R2 and R3.\nMax Power =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1D)\n(5 Points)\nIf any node voltage inside the processor power distribution network falls below\na threshold value eMin, then the part of the processor connected directly to that node will fail\nto operate properly. Given the possible values for I1, I2 and I3, what is the minimum value\nfor V that guarantees that all parts of the processor will always operate properly? That is,\nwhat is the minimum value of V required to guarantee that e1, e2 and e3 never fall below\neMin? Express your answer in terms of I, R1, R2, R3 and eMin.\nMin V =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1E)\n(5 Points)\nIf any node voltage inside the processor rises above a threshold value eMax,\nthen the part of the processor connected directly to that node will be damaged. Given the\npossible values for I1, I2 and I3, what is the maximum value for V that guarantees that no\npart of the processor will be damaged? That is, what is the maximum value of V required\nto guarantee that e1, e2 and e3 never exceed eMax? Express your answer in terms of I, R1,\nR2, R3 and eMax.\nMax V =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2 - 35 Points\nA noisy power supply with total Thevenin voltage vS and Thevenin resistance RS is connected to\na load that is modeled by the resistor RL as shown below. A biasing component, which could be\nlinear resistor or a nonlinear component, is placed in parallel with the power supply and load. It\nwill be used to adjust the load voltage vL. The noise in the power supply is modeled by the small\nsignal vs superimposed on the constant supply voltage VS. Thus, VS and vs are the large-signal and\nsmall-signal components of the total power supply voltage vS, respectively. Correspondingly, VL\nand vl are the large-signal and small-signal components of the total load voltage vL, respectively, as\nindicated below. The noise vs satisfies vs ≪VS, and is responsible for the presence of vl in vL.\n+\nvS = VS + vs\n-\nVS = 6 V\nvs\nRS = 100 Ω\n+\nvL = VL + vl\n-\nRL = 1 kΩ\niB\n+\nvB\n-\nBiasing\nComponent\nFor Parts (2A) and (2B), let the biasing component be a linear resistor having resistance RB.\n(2A)\n(5 Points)\nIn the absence of any power supply noise voltage, that is, for vs = 0 V, determine\na numerical value for RB so that VL = 5 V. Remember to provide units!\nRB =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2B)\n(5 Points)\nNow let vs be non-zero. For the conditions of Part (2A), determine the ratio\nvl/vs. Numerical answer expected.\nvl/vs =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFor Parts (2C) and (2D), let the biasing component be a nonlinear component having the charac-\nteristic given by iB = 20 mA × ((vB -VX) / (1 V))2 for vB ≥VX, and zero otherwise. Here, VX is\nthe voltage at which the characteristic intersects the horizontal axis.\n(2C)\n(10 Points)\nThe characteristics of five nonlinear components are shown in the graph below.\nThe corresponding VX is 1.5 V, 2.5 V, 3.5 V, 4.5 V and 5.5 V, for characteristics A through\nE, respectively. Which nonlinear component should be used so that VL = 5 V in the absence\nof any power supply noise? Also give a reason. (No credit without a reason.)\nBiasing Component Voltage vB [V]\nBiasing Component Current i B [mA]\nNonlinear Biasing Component Characteristics\nA\nB\nC\nD\nE\nCircle One:\nA\nB\nC\nD\nE\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2D)\n(15 Points)\nAgain let vs be non-zero. For the conditions of Part (2C), approximate the\nratio vl/vs.\nYou may use either a graphical or an analytic method.\nHint: your answer\nshould be smaller than that found in Part (2B), demonstrating an important use of nonlinear\ncomponents. Numerical answer expected.\nvl/vs =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3 - 30 Points\nIn this problem the switch-resistor model of the MOSFET is expanded to include a finite gate-source\nresistance RG. The corresponding model for the MOSFET is shown below.\nG\nRG\nS\nOpen for vGS < VT\nClosed for vGS ≥VT\nRON\nD\n⇐⇒\nS\nD\nG\n(3A)\n(15 Points)\nTwo inverters are connected in series as shown below. The MOSFET in both\ninverters has a finite gate-source resistance as modeled above. For this circuit, sketch and\nclearly label the transfer function for the first inverter, that is, vOUT as a function of vIN,\nover the range 0 ≤vIN ≤VS in the space given below. Assume that VS > VT.\nVS\nvIN\nRPU\n+\nvOUT\n-\nRPU\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGraph\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3B)\n(15 Points)\nNow consider the case in which the output of the first inverter is connected\nto the input of N identical inverters as shown below. Assuming that VT, RON and RG are\nall given, over what range must RPU be designed so that the first inverter can successfully\nswitch the states of the successive inverters. That is, over what range must RPU be designed\nso that vOUT > VT when vIN < VT, and vOUT < VT when vIN > VT. Again assume that\nVS > VT.\nN Gates\nVS\nvIN\nRPU\n+\nvOUT\n-\nRPU\nRPU\n< RPU <\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz1_s04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/28043bafdafaa71572ec5ccd4fe73c89_quiz1_s04.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2004\nQuiz #1\n24 February 2004\nName:\n-\nPlease put your name in the space provided above, and circle the name of your\nrecitation instructor together with the time of your recitation.\n-\nDo your work for each question within the boundaries of the question. When finished,\nwrite your answer to each question in the corresponding answer box that follows the\nquestion.\n-\nThis is a closed-book quiz, but calculators are allowed.\n-\nGraded quizzes will be returned in recitation on Friday February 27. If you do not\nattend recitation on that day, then it is your responsibility to get your quiz from your\nrecitation instructor. You will have until recitation on Friday March 12 to request\na quiz grading review, regardless of whether or not you attend recitation on Friday\nFebruary 27 and take back your quiz. If you wish to have your quiz grade reviewed,\nyou must return your quiz to your recitation instructor, within the two week period,\ntogether with a written explanation of why you think a grading mistake was made.\nThis is the only way in which a quiz grade will be reviewed.\n-\nGood luck!\nProblem 1\nProblem 2\nProblem 3\nProblem 4\nTotal Grade\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1 - 40%\nThis problem involves a network that is implemented with three resistors and a voltage\nsource as shown below. Its terminal characteristics are also given graphically below.\n+\n_\nv\ni\nVS\n2R\n2R\nR\nNetwork\n3V\n-1.5 mA\ni\nv\n(1A)\nFrom the graphical data given above, determine numerical values for the parameters\nof the Thevenin equivalent of the network.\nVTH:\nRTH:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1B)\nDetermine numerical values for the parameters VS and R that characterize the imple-\nmentation of the network shown above.\nVS:\nR:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1C)\nThe network is connected to an external current source and resistor as shown below.\nDetermine the value of its terminal voltage v given the external connection.\nNetwork\n3 mA\n4 kΩ\n+\n_\nv\nv:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1D)\nA load resistor is connected across the terminals of the network.\nDetermine the\nvalue of load resistance that will result in the maximum power dissipated in the load\nresistor. Also determine the maximized load power.\nLoad Resistance:\nLoad Power:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2 - 20%\nDetermine the current i in the network below.\n6 V\n3 A\n4 Ω\n4 Ω\n1 Ω\n3 Ω\n4 A\ni\ni:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3 - 10%\nThe network shown below has two nodes with unknown node voltages e1 and e2. Carry out\na node analysis and determine two node equations that can be used to determine e1 and e2.\nYou need not solve the equations.\nV1\nV2\nI\nR1\nR2\nR3\nR4\nR5\nR6\ne1\ne2\nEqn #1:\nEqn #2:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 4 - 30%\nA nonlinear resistor having terminal voltage vNR and terminal current iNR is connected to\nan external network as shown below. The terminal characteristics of the nonlinear resistor\nare also given graphically below. Note carefully the scales of the graph, volts and milliamps,\nand the location of its origin.\nV\nNonlinear Resistor\nR\niNR\nvNR\n+\n_\n-1\n-0.5\n0.5\n1.5\n2.5\n-1\n-0.5\n0.5\n1.5\nvNR [V]\niNR [mA]\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(4A)\nAssume that V = 2 V and R = 4 kΩin the external network. Using the graphical\nterminal characteristics of the nonlinear resistor, determine vNR and iNR. Hint: draw\na load line for the external network on the graph given above.\nvNR:\niNR:\n(4B)\nAssume now that V = (2 + 0.1 sin(t)) V and R = 4 kΩin the external network. In\nthis case, vNR will be given approximately by vNR ≈A + B sin(t). Using the terminal\ncharacteristics of the nonlinear resistor determine A and B.\nA:\nB:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nExtra copy of the figure for Problem 4\n-1\n-0.5\n0.5\n1.5\n2.5\n-1\n-0.5\n0.5\n1.5\nvNR [V]\niNR [mA]\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz1_s07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/88927b3163eee7d5f232367a897a081d_quiz1_s07.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nQuiz #1\n13 March 2007\nName:\n- There are 26 pages in this quiz, including this cover page. Please check that you have them\nall.\n- Please write your name in the space provided above, and circle the name of your recitation\ninstructor along with the time of your recitation.\n- IMPORTANT: The problems in this quiz vary in difficulty; moreover, questions of different\nlevels of difficulty are distributed throughout the quiz. If you find yourself spending a long\ntime on a question, consider moving on to later problems in the quiz, and then working on\nthe challenging problems after you have finished all of the easier ones.\n- Do your work for each question within the boundaries of that question, or on the back of\nthe preceding page. When finished, enter your answer to each question in the corresponding\nanswer box that follows the question.\n- Remember to include the sign and units for all numerical answers.\n- This is a closed-book quiz, but you may use a calculator and your double-sided page of notes.\n- You have 2 hours to complete this quiz.\nGood luck!\n-\n1.\n2.\n6.\n7.\n11.\n12.\n16.\n17.\n21.\n22.\n3.\n8.\n13.\n18.\n23.\n4.\n9.\n14.\n19.\n24.\n5.\n10.\n15.\n20.\n25.\nFinal Score:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1: 4 points\nVO\n18 Ω\n12 Ω\n12 Ω\n12 Ω\nVS\nVO\nVS =\n1/4\n1/3\n1/2\n2/3\n3/4\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2: 4 points\n3 Ω\n3 Ω\n3 Ω\n3 Ω\nIS\nIO\nIO\nIS =\n1/4\n1/3\n1/2\n2/3\n3/4\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3: 4 points\ni\nR2\nR1\nV -\n+\nI\n+\n-\nv\nGraph the above network's i-v relations as viewed from its port. Clearly label the intercepts\nand the slope.\ni\nv\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 4: 4 points\nR\nR\nR\nR\nR\n(resistor pattern\nR\nR\nR\nR\nReq\nR\ncontinues)\nReq =\nR/2\nR 1+\n√\nR 1 +\n√\nR 1+\n√\n2R\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 5: 4 points\nWrite the node equations for the nodes el and e2 in the box below.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 6: 4 points\nThevenin\nThevenin\nEquivalent\nEquivalent\nCircuit\nCircuit\nThe current i is measured in two experiments which are performed on a Thevenin equivalent\ncircuit as shown. What is the Thevenin equivalent resistance?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 7: 4 points\nA battery, which can be modelled by a Thevenin equivalent circuit, has an open circuit voltage\nof 2 volts.\nWhen a 500 Ω resistor is connected to the battery, the terminal voltage drops to 1\nvolt. How much power is dissipated in the Thevenin equivalent resistance of the battery under this\ncondition?\nPdiss =\n0.002 W\n0.005 W\n0.5 W\n2 W\n5 W\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 8: 4 points\n1 Ω\n1 Ω\n1 V\n1 V\n1 A\nVO\nVo =\n-3/2 V\n-1/2 V\n0 V\n1/2 V\n3/2 V\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 9: 4 points\n2 m\nNoise in the 2 meter digital channel shown above is added in at the rate of 0.6 V per meter.\nTo correct for that noise, we introduce buffers into the channel. The purpose of a buffer is to take\na signal, to which noise has been added so that it no longer meets the output specifications of the\nstatic discipline, and clean it up so that it once again meets the output specifications of the static\ndiscipline. These buffers, as well as the gates shown, obey the following static discipline:\nVOL = 1 V\nVOH = 4 V\nVIL = 2 V\nVIH = 3 V\nWhat is the minimum number of buffers required to connect between the digital links in order\nto insure correct operation?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 10: 4 points\nB\nA\nZ\nFill in the truth table for the above digital circuit.\nA B Z\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 11: 4 points\nA\nC\nB\nThis gate is equivalent to:\nC\nA\nA\nC\nC\nB\nB\nA\nB\nA\nB\n(a) Circuit A\n(b) Circuit B\n(c) Circuit C\n(d) Circuit D\nnone of\nA\nB\nC\nD\nthe above\nC\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 12: 4 points\n19 kΩ\n19 kΩ\n100 Ω\nVO\n10 V\nFind the power dissipated in RON , if the MOSFETs are accurately represented by the switch-\nresistor model, where the threshold voltage VT = 2 V and the on-resistance RON = 100 Ω.\nPdiss =\n0.25 W\n0.5 W\n0.75 W\n1 W\n2 W\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 13: 4 points\n5 V\n1 kΩ\nRL\nVO\nVI\nGiven that VI = 5 V and VO = 5 V , and that the MOSFETs are accurately represented by the\nswitch-resistor model, where the threshold voltage VT = 2 V and the on-resistance RON = 100 Ω,\nfind the minimum value of RL which will allow this buffer to operate correctly.\nRL =\n50 Ω\n150 Ω\n500 Ω\n1 kΩ\n2 kΩ\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 14: 4 points\nP\nRTH\nIP\nIP\nVP\nP VP\nR1\nVTH\nVS\nIS\nThe device P in the circuits above is a nonlinear device. The circuit in the left-hand figure\nabove that includes this device can be represented by the equivalent circuit which is illustrated in\nthe right-hand figure. Find expressions for VTH and RTH .\nVTH =\nRT H =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 15: 4 points\nE\nv~ (Volts)\nThe device D embedded in the circuit shown above has the i--u relation illustrated in the plot\nlocated below the circuit schematic.\nCircle the value of the voltage source Vs required to bias the device at the operating point\nVD= 1 V .\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 16: 4 points\nThe device Q in the circuit shown above has the i--u relation\nFind the value of UQ in the circuit\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 17: 4 points\n1 Ω\n1 Ω\nQ\nvQ\nvS\niQ\nThe result of analyzing the above circuit yields the following relationship for the 2-terminal\nnonlinear device Q:\nvQ =\n2 (vS -1)2\nvS ≥1\n(2)\nvQ =\nvS < 1\nLet vS = VS + vs; then vQ = VQ + vq. Find vq/vs if VS = 5 V .\nvq =\nvs\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 18: 4 points\nFor the above circuit, iL = 3 4 . If Vs = 1V and us = 0.001 sin(wt), circle the correct expression\nfor ii.\nA: 3 amps\nB: (3 x\nsin3(wt) amps\n21 =\nC: (1.11x\nsin(&) amps\nD: (9.0 x\nsin(&) amps\nE: (6.0 x\nsin2(wt) amps\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 19: 4 points\nA\nB\nC\nF (A, B, C)\nWrite a logic expression corresponding to the function F (A, B, C) in the above truth table. You\nneed not simplify your expression.\nF (A, B, C) =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 20: 4 points\nFollowing the node method, write a single node equation involving the node voltage el in terrns\nof I,Vl, V2, R1, R2 and R3.\nNode equation for el:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 21: 4 points\n2.5\n3 volts\nVZ\nVA\n0.7\n0.5\nVA\nVOL = 0.5 V\nVOH = 2.5 V\nVIL = 0.7 V\nVIH = 2.0 V\nThe voltage at the output Z of the 2-input AND gate is a function of the voltage at input A,\nas graphed above. Circle the correct entry in the following list which indicates whether or not the\nAND gate satisfies the static discipline, and which boundary is broken if the static discipline is\nviolated.\n0.5 0.7\n2.5\nV Z\nA: Yes, it satisfies the static discipline.\nB: No, because the VIL threshold is not met for all valid inputs.\nC: No, because the VOL threshold is not met for all valid inputs.\nD: No, because the VOH threshold is not met for all valid inputs.\nE: No, because the transition through the forbidden region is not instantaneous.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 22: 4 points\nVS\nRL\nVS\nZ\nRL\nA\nB\nD\nE\nC\nWrite a boolean expression for Z in terms of A, B, C, D, and E. You need not simplify your\nexpression.\nZ =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 23: 4 points\n(a) Thevenin equivalent circuit A\n(b) Thevenin equivalent circuit B\nThe i-u characteristics for each of two Thevenin equivalent circuits are plotted in the graphs\ncorresponding to the labelled network. Using the graphs, estimate the current i~ when the circuits\nare connected as shown. Circle the answer corresponding to the value nearest your estimate. ( H i n t :\nT h i s problem i s m o s t easily done graphically.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 24: 4 points\nThe NOR gate circuit shown operates in a digital system characterized by a static discipline\nwith the voltage thresholds below.\n5 V\n10 kΩ\nFor both of the MOSFETs,\nC\nRON = 2 kΩ\nVT = 2 V\nA\nB\nVOL = 1 V\nVOH = 4.5 V\nVIL = 1.9 V\nVIH = 3 V\nThe supply voltage is currently 5 V .\nIn order to save power, the designers are thinking of\nreducing the supply voltage to 4 V . Can the designers make this change and still satisfy the static\ndiscipline?\nA: Yes, they can make this change.\nB: No, because the MOSFETS will never turn on.\nC: No, because the gate will not meet the VOH part of the static discipline.\nD: No, because the gate will not meet the VIH part of the static discipline.\nE: No, because the gate will not meet the VIL part of the static discipline.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 25: 4 points\n{Head Scratcher}\nCalculate the equivalent resistance Req seen between the nodes A and B in the circuit shown\nabove. Assume that all of the resistors have a value of 1 Ω, and that 1 amp flows into node A and\nout of node B. (Note: this problem can be solved without writing any node equations.)\nReq =\n1/6 Ω\n1/3 Ω\n1/2 Ω\n5/6 Ω\n1 Ω\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz2_f04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/33673c004dd0259cb16a2a50bbb83636_quiz2_f04.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF ELECTRICAL ENGINEERING AND COMPUTER SCIENCE\n6.002 Circuits and Electronics Quiz #2\nNovember 10, 2004\nYOUR NAME__________________________________________________________\nRecitation Instructor / TA ________________________________________________\nGeneral Instructions:\n1.\nPlease verify that there are 18 pages in your exam booklet.\n2.\nPlease do all of your work in the spaces provided in this examination\nbooklet. In particular, try to do your work for each question within the\nboundaries of the question, or on the back side of the page preceding the\nquestion. Extra pages are also available at the end of the booklet. Place\nthe answer to each question within the appropriate answer box.\n3.\nYou may use two double-sided pages of notes and a calculator while\ntaking this exam.\nFor examiner's use only:\nPart\n2A\n2B\n2C\n2D\nScore\nPart\n3A\n3B\n5A\n5B\nScore\nTOTAL SCORE___________________\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nProblem 1\n(12 Points)\nFind a Thevenin equivalent model of the circuit shown in Figure 1 as viewed from the\nterminal pair at the right of the circuit. (That is, find the Thevenin voltage and resistance\nVTH, RTH that characterize the system.) You may ignore the degenerate case that occurs\nwhen I = -(R1+R2).\nFigure 1\nPage 2 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nVTH =\nRTH =\nPage 3 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nProblem 2\n(25 Points)\nThis problem concerns the MOSFET amplifier shown in Figure 2.\nFigure 2\n(2A) Find the value of the dc input voltage VI such that the dc output voltage VOUT = 5\nV. Assume that the MOSFET operates in the saturation region iD = 1⁄2k(vGS - VT) , and\nhas parameters k = 2 mA/V and VT = 1 V.\nVI =\nPage 4 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(2B) Validate or disprove the assumption that the MOSFET operates in the saturation\nregion for the proposed operating condition.\nMOSFET saturation region satisfied? Justification?\nPage 5 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(2C) Given the small-signal model for the MOSFET shown in Figure 3, draw the small-\nsignal model for the amplifier. Make sure to label all important circuit parameters and\nvariables.\nFigure 3\nDraw the small-signal circuit model for the amplifier\nPage 6 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(2D) Calculate the small-signal voltage gain for the amplifier and express it in terms of\ngm, RD, and RS.\nvout\nvi\nPage 7 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nProblem 3\n(25 Points)\nFor the circuits below, please find expressions for the specified voltage over the indicated\ntime ranges in terms of the circuit parameters. Plot the waveform on the provided axes,\nand clearly identify the key parameters in your graph.\n(3A) Consider the circuit of Fig. 4. The switch is open for t <0, closed for 0 t < t1, and\nopen for t t1, where t1 = 3RC. Find and plot the voltage vC(t).\nFigure 4\nPage 8 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nvC(t), t < 0 =\nvC(t), 0 t < t1 =\nvC(t), t t1 =\nPlot vC(t) over all time, indicating important waveform parameters.\nPage 9 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(3B) Consider the circuit of Figure 5, in which I > -1. The switch is open for t <0, and\nclosed for t 0. vC(0-) = V0. Find and plot the voltage v1(t).\nFigure 5\nPage 10 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nv1(t), t < 0 =\nv1(t), t 0 =\nPlot v1(t) over all time, indicating important waveform parameters.\nPage 11 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nProblem 4\n(13 Points)\nAfter years of research, the FUBAR division of Bellyup Labs has created a new three-\nterminal semiconductor device that they name the \"Dualistor\". The proposed symbol for\nthe device is shown in Fig. 6, along with a large-signal circuit model that the Bellyup\nresearchers tell you is valid over the range of interest.\nFigure 6\nThe researchers at Bellyup Labs have asked your assistance in developing a small-signal\ncircuit model for the Dualistor. Derive a small-signal circuit model for the Dualistor\noperating about a bias point iF = IF. Draw and label the small-signal circuit, making sure\nto indicate all important terminal variables and parameters.\nPage 12 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nDraw and label the small-signal circuit model for the Dualistor. Make sure to provide\nvalues for any circuit parameters that are introduced.\nPage 13 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\nProblem 5\n(25 Points)\nFigure 7 shows a relay driver circuit. The low-power switch S is used to activate and\ndeactivate the relay (which can control much more power). The relay is considered\n\"activated\" whenever the relay current iL exceeds 25 mA, and is \"deactivated\" otherwise.\nThe relay is modeled as the series connection of a resistor RR = 100 o and an inductor LR\n= 200 μH. To protect the switch S driving the relay, a resistor RF = 100 o is placed\nacross the relay as shown.\n5V\nRF\nRR\nLR\nS\n+\n-\nvsw\nisw\nRelay\nmodel\niL\nFigure 7\n(5A) What will be the delay between the time the switch S is closed (after being open for\na long time) and the time the relay is \"activated\"?\nActivation delay =\nPage 14 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(5B) After being open for a long time, the switch S is closed at t = 0, then opened at t =\n10 μs. On the axes provided, plot the switch voltage vsw and the switch current isw from t\n= -5 μs to 15 μs. Clearly label and specify (numerically) all steady-state levels and time\nconstants.\nvsw\nt\nisw\n-5 Ps\n5 Ps\n\nPs\n15 Ps\nt\nPage 15 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(Page for extra work)\nPage 16 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(Page for extra work)\nPage 17 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n6.002 Circuits and Electronics\nFall 2004 Quiz #1\nName:_______________________________\n(Page for extra work)\nPage 18 of 18\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz2_s04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/3f3668c71e80478edb84cc2130fda230_quiz2_s04.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2004\nQuiz #2\n1 April 2004\nName:\n-\nPlease put your name in the space provided above, and circle the name of your\nrecitation instructor together with the time of your recitation.\n-\nDo your work for each question within the boundaries of the question. When finished,\nwrite your answer to each question in the corresponding answer box that follows the\nquestion.\n-\nThis is a closed-book quiz, but calculators are allowed.\n-\nGraded quizzes will be returned in recitation on Wednesday April 7. If you do not\nattend recitation on that day, then it is your responsibility to get your quiz from\nyour recitation instructor. You will have until recitation on Wednesday April 21 to\nrequest a quiz grading review, regardless of whether or not you attend recitation on\nWednesday April 7 and take back your quiz. If you wish to have your quiz grade\nreviewed, you must return your quiz to your recitation instructor, within the two\nweek period, together with a written explanation of why you think a grading mistake\nwas made. This is the only way in which a quiz grade will be reviewed.\n-\nGood luck!\nProblem 1\nProblem 2\nProblem 3\nTotal Grade\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1 - 35%\nA hypothetical \"leaky\" MOSFET (L-MOSFET) is modeled with the additional gate-to-\nsource resistance RGS as shown below. Also shown below is an inverter constructed using\nthe L-MOSFET. Assume that the inverter drives N identical inverters from its output, as\nindicated. Given this load, the inverter is required to obey the standard static discipline\ndefined by 0 < VOL < VIL < VIH < VOH < VS.\nL-MOSFET Model\nRGS\nCGS\nRON\nOpen for vGS < VT\nClosed for vGS > VT\n{\nG\nS\nD\nvIN\nRPU\n+\n_\nvOUT\nVS\nInverter\nTo N other\ngate inputs\n(1A)\nThe static (CGS = 0) input-output characteristic of the inverter is as shown below.\nDetermine the voltages VA, VB and VC that define this characteristic. Express the\nvoltages in terms of VS, RPU, N and the L-MOSFET parameters.\nvOUT\nvIN\nVS\nVS\nVA\nVB\nVC\nVA:\nVB:\nVC :\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1B)\nIn terms of the static discipline parameters (VOL, VIL, VIH and VOH), determine the\nvoltage range within which the threshold voltage VT must be designed for the inverter\nto obey the static (CGS = 0) discipline at its input.\n≤VT ≤\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1C)\nDetermine the resistance range within which the pull-up resistance RPU must be\ndesigned for the inverter to obey the standard static (CGS = 0) discipline at its\noutput. Express the range in terms of VS, N, the L-MOSFET parameters and the\nstatic discipline parameters.\n≤RPU ≤\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1D)\nAssume that vIN(t) > VT for t < 0 so that the L-MOSFET switch is initially closed.\nFor t ≥0, vIN steps to vIN(t) < VT so that the L-MOSFET switch opens. For this\ninput, determine the dynamic (CGS > 0) response of the inverter. That is, determine\nvOUT(t) for t ≥0. Express vOUT in terms of VS, RPU, N, the L-MOSFET parameters.\nYou may also use VA, VB and VC from Part 1A in your answer.\nvOUT(t ≥0):\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2 - 30%\nThis problem concerns the analysis of the MOSFET amplifier shown below. For the pur-\nposes of this analysis, assume that the MOSFET operates in its saturation region. The\ncorresponding MOSFET characteristics are also given below.\nvIN\nRD\n+\n_\nvOUT\nVS\nRS\nSaturation Region:\nvDS > vGS - VT > 0\niD = 0.5K ( vGS - VT )2\n(2A)\nDetermine vOUT as a function of vIN. Express vOUT in terms of the circuit parameters\nand the MOSFET parameters.\nvOUT:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2B)\nLet vIN = VIN+vin where VIN and vin are the large-signal and small-signal components\nof vIN, respectively. Further, let vOUT = VOUT+vout where VOUT and vout are the large-\nsignal and small-signal components of vOUT, respectively. Assume that the amplifier\nis biased with a value of VIN that results in saturated operation of the MOSFET.\nFor this case, draw the circuit that models the small-signal behavior of the amplifier,\nand that can be used to determine vout from vin. Clearly label the components in the\nmodel.\nModel:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2C)\nDetermine the small-signal gain vout/vin of the amplifier. Express the gain in terms\nof the amplifier parameters, the MOSFET parameters and the bias voltage VIN.\nvout/vin:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3 - 35%\nA signal generator having Thevenin resistance RSG is connected to Port #1 of a two-port\nnetwork as shown below. At t = 0, the Thevenin voltage vSG(t) of the signal generator takes\na step from zero to VSG, and the voltage v2(t) is measured at Port #2 as shown below with\nthe port open-circuited. Note that α is a unitless constant satisfying 0 < α < 1, and τ is a\ntime constant. Assume that the Thevenin voltage of the signal generator is zero for a very\nlong time prior to the step.\nvSG(t)\nt\nVSG\n+_\nvSG(t)\nRSG\nSignal Generator\nNetwork\nPort\n#1\nPort\n#2\n+\n_\nv2(t)\nv2(t)\nt\nαVSG( 1 - e-t/τ )\nαVSG\nVSG\n(3A)\nWhich of the following could be the two-port network?\nR C\n#1\n#2\n(A)\nR\nC\n#1\n#2\n(B)\nR\nC\n#1\n#2\n(C)\nR\nC\n#1\n#2\n(D)\nR\nC\n#1\n#2\n(E)\nNetwork (Circle One):\nA\nB\nC\nD\nE\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3B)\nWhich of the following could be the two-port network?\nR L\n#1\n#2\n(A)\nR\nL\n#1\n#2\n(B)\nR\nL\n#1\n#2\n(C)\nR L\n#1\n#2\n(D)\nR\nL\n#1\n#2\n(E)\nNetwork (Circle One):\nA\nB\nC\nD\nE\n(3C)\nDetermine the values of R and L in the network you chose in Part 3B. Express the\nvalues in terms of VSG, RSG, α and τ.\nR:\nL:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3D)\nThe Thevenin voltage vSG(t) of the signal generator now produces the pulse having\namplitude VSG and duration T shown below. Determine the voltage v2(t) measured\nat Port #2 for t ≥0 with the port open-circuited. Express v2(t) in terms of VSG,\nRSG, T, τ and α. Assume that the Thevenin voltage of the signal generator is zero\nfor a very long time prior to the pulse.\nvSG(t)\nt\nVSG\nT\nv2(t ≥0):\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Exam",
      "title": "quiz2_s07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/c402cfea3b68444521e9f012d88b7006_quiz2_s07.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nQuiz #2\n25 April 2007\nName:\n- There are 20 pages in this quiz, including this cover page. Please check that you have them\nall.\n- Please write your name in the space provided above, and circle the name of your recitation\ninstructor along with the time of your recitation.\n- IMPORTANT: The problems in this quiz vary in difficulty; moreover, questions of different\nlevels of difficulty are distributed throughout the quiz. If you find yourself spending a long\ntime on a question, consider moving on to later problems in the quiz, and then working on\nthe challenging problems after you have finished all of the easier ones.\n- Do your work for each question within the boundaries of that question, or on the back of\nthe preceding page. When finished, enter your answer to each question in the corresponding\nanswer box that follows the question.\n- Remember to include the sign and units for all numerical answers.\n- This is a closed-book quiz, but you may use a calculator and your double-sided page of notes.\n- You have 2 hours to complete this quiz.\n- Good luck!\n1A.\n1B.\n1E.\n2A.\n2B.\n3A.\n3D.\n1C.\n1F.\n2C.\n3B.\n3E.\n1D.\n1G.\n2D.\n3C.\n3F.\nFinal Score:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1B: 5 points\nCalculate the small-signal gain vo/vi of the circuit shown in Figure 2a. Use the small-signal\nmodel of the MOSFET shown in Fig 2b. Assume that the MOSFET is operating in the saturation\nregion.\nVDD\nD\nG\nS\nvI\nG\nD\nvO\nRL\nvgs\ngmvgs\nS\nS\n(a)\n(b)\nFigure 2.\nvo =\nvi\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1C: 5 points\nCalculate the small-signal gain u,/ui of the circuit in Figure 3a in terms of RL, gml, and gm2.\nAssume that both of the MOSFETS are operating in the saturation region, and that the small-signal\nmodels of the MOSFETs are as shown in Figure 3b.\nFigure 3.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem ID: 5 points\nThe circuit shown in Figure 4 has been at rest with the switch open for a long time. At t = O\nthe switch is closed. Sketch the current ic through the capacitor for t > O on the axes below. Using\nthe circuit parameters R1, R2, C, and Vo,indicate on your sketch (i) the initial value ic(Ot),\n(ii)\nthe final value ic(oo), and (iii) the time constant.\nFigure 4\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1E: 10 points\nConsider the circuit illustrated in Figure 5.\nI(t)\niL\nL\nR\nFigure 5.\n(a)\n(5 points) Find the inductor current iL(t) for t ≥ 0 in response to the current step I(t) =\nIstep(t) = I0u(t). Assume that iL(0) = 0.\niL(t) =\nfor I(t) = Istep(t)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1E (continued):\n(b)\n(5 points) Find the inductor current iL(t) for t ≥ 0 in response to the current ramp\nI(t) = Iramp(t) = I0αtu(t), where α is a constant. Again, assume that iL(0) = 0.\niL(t) =\nfor I(t) = Iramp(t)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1F: 5 points\nThe capacitor in the circuit in Figure 6 has an initial voltage VO on its terminals at t = 0-\nwhen a step of voltage Vu(t) is applied at t = 0. Find an expression for the voltage across the\ncapacitor vC for t > 0.\nvC(t)\nC\nR2\nR1\nV u(t)\nFigure 6.\nvC(t) =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1G: 10 points\nFind an expression for the voltage vC(t) for the circuit in Figure 7, assuming that vC(0-) = 0\nand iL(0-) = 0. Please express your answer in terms of Λ, L, and C.\nL\nC\nvC\niL\nΛδ(t)\nFigure 7.\nvC(t) =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2: 20 points\nFigure 8a shows a buffer comprising a pair of MOSFETs driven by a source whose Thevenin\nequivalent circuit is represented by the voltage source vTH and source resistance RTH.\nvTH\nRTH\nvA\nRL\nRL vB\nM1\nM2\nvC\nVS\nVS\nSource\nBuffer\n(a)\nD\nG\nG\nD\nS\nCGS\nRON\nS\n(b)\nFigure 8.\nThe MOSFETs M1 and M2 in the buffer are identical and their behavior is to be modelled by\nthe circuit shown in Figure 8b, where the switch is closed for vGS > VT and is open when vGS < VT .\nThis problem explores the dynamic operation of the buffer, in particular the delays introduced by\nthe gate-source capacitance CGS. Throughout the problem, assume that\nRON\nVTH > VT >\nVS\nRL + RON\nVS > VT\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFirst, consider the case in which the input to the buffer makes a 0 → 1 transition. The voltage\nsource vTH and the output at the drain of M1, vB, then exhibit the waveforms sketched in Figure 9.\nvTH\nVS\nt\nvB\nt1\nt\nFigure 9.\n(2A)\n(5 points) Determine the delay t1 indicated in Figure 9.\nt1 =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2B)\n(5 points) The voltage vB(t) for t > t1 can be expressed by a function of the form\nvB(t) = V1 + V2e -(t-t1 )/τ1 .\nDetermine V1, V2, and τ1.\nV1 =\nV2 =\nτ1 =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(2C)\n(5 points) Find an expression for the total delay t0→1 between the 0 → 1 transition at\nthe input VTH and the corresponding 0 → 1 transition at the output vC.\nt0→1 =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNow consider the case in which the input to the buffer makes a 1 → 0 transition. The voltage\nsource vTH and the output at the drain of M1, vB, then exhibit the waveforms sketched in Figure 10.\nvB\nvTH\nt2\nVS\nt\nt\nFigure 10.\n(2D)\n(5 points) The voltage vB(t) for t > t2 can be expressed by a function of the form\nvB(t) = V3 + V4e -(t-t2 )/τ2 .\nDetermine V3, V4, and τ2.\nV3 =\nV4 =\nτ2 =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3B)\n(5 points) In the laboratory, measurements reveal that vIN = vOUT = vGS = 5 V . Is the\nMOSFET operating in the saturation region? Explain your answer in a short sentence.\nExplanation:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3D)\n(5 points) Define the small-signal current through the MOSFET as ids = gmvgs. What is\ngm at the operating point vIN = vOUT = vGS = 5 V ?\ngm =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure 11.: (repeated for convenience)\n(5 points) Draw the small-signal equivalent model of the circuit in Figure 11,representing\nthe relation between id, and u,, in the MOSFET by a voltage-controlled current source\nwith a proportionality constant g,.\nSmall-signal equivalent circuit:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(3F)\n(10 points) What is the small-signal gain vout/vin? Assume that R1 = R2 = R, and\nexpress your answer in terms of R, RL, and gm. Assume that the MOSFET is operating\nin the saturation region.\n(Hint: one way to approach this problem is to set up node\nequations for the nodes in the circuit, and solve for vout.)\nvout =\nvin\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "final_s07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/b5b3536f01475af4d877751c82f785d1_final_s07.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits & Electronics\nSpring 2007\nFinal Exam\n21 May 2007\nName:\n- There are 31 pages in this final, including this cover page. Please check that you have them\nall.\n- Please write your name in the space provided above, and circle the name of your recitation\ninstructor along with the time of your recitation.\n- IMPORTANT: The problems in this exam vary in difficulty; moreover, questions of differ\nent levels of difficulty are distributed throughout the exam. If you find yourself spending a\nlong time on a question, consider moving on to later problems in the exam, and then working\non the challenging problems after you have finished all of the easier ones.\n- Do your work for each question within the boundaries of that question, or on the back of\nthe preceding page. When finished, enter your answer to each question in the corresponding\nanswer box that follows the question.\n- Remember to include the sign and units for all numerical answers.\n- This is a closed-book exam, but you may use a calculator and three double-sided pages of\nnotes.\n- You have 3 hours to complete this final.\n- Good luck!\n1A.\n1B.\n5.\n6.\n10.\n11.\n14.\n15.\n19A.\n2.\n7.\n12A.\n16.\n19B.\n3.\n8.\n12B.\n17.\n19C.\n4.\n9.\n13.\n18.\n19D.\nFinal Score:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 1: 8 points\nD\nvDS\nS\nvGS\nG\nFigure 1.\nA MOSFET (shown in Figure 1) operating in the triode region has a characteristic iDS rela\ntionship which depends on both vDS and vGS :\niDS = K (vGS -VT ) vDS -vDS/2\nwhere vGS > VT and vDS ≤ vGS - VT . The small-signal relationship between ids, vgs, and vds can\nbe expressed by an equation of the form\nids = Avgs + Bvds\nwhere A and B are constants. Assume that the device is biased at an operating point (VGS , VDS ).\n(1A)\n(4 points) Draw the 2-element small-signal model for the device which is operating in the\ntriode region. Express the element values in terms of A and B.\nSmall-signal equivalent circuit:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1B)\n(4 points) Find the values of the constants A and B in the two-element small signal model\nfor the MOSFET operating in the triode region,\nids = Avgs + Bvds\nFormulate your answers in terms of the variables K, VGS, VT , and VDS .\nA =\nB =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 2: 4 points\nA and B are 1 bit numbers.\nEach of them can take on the positive integer values 0 or 1.\nImplement an adder which takes the two inputs A and B and produces a 1 bit sum output Z. The\nsum output Z must saturate at 1, which means that if the sum is greater than 1, the circuit must\noutput a 1.\nYou may use as many inverters, NAND gates and NOR gates as you like in your circuit.\nYour adder design:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3: 4 points\nConsider the logic function O described by the following truth table.\nA\nB\nC\nO(A, B, C)\nShow how to implement the function O using only two-input NAND gates and inverters. (Hint:\nRemember the relations indicated by Figure 2.)\nA\nA\nC\nC\nB\nB\nA\nA\nC\nC\nB\nB\nFigure 2.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 3 (continued):\nImplementation of O:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 4: 4 points\nFigure 3.\nIn the circuit in Figure 3, the current reading from the ammeter is 4 mA with the switch open\nand 3 mA with the switch closed, where iDs= (K/2)(uGs- VT)'. What are VT and K?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n-1\n-1\n-2\n-1\n-100\n-90\n-80\n-70\n-60\n-50\n-40\n-30\n-20\n-10\n\nProblem 5: 4 points\nR\nC\nvi\nvo\nFigure 4.\nLet the network depicted in Figure 4 have a frequency response given by\nvo\n=\nvi\n1 + jωK\nwhere K is positive. The magnitude and phase of this frequency response as a function of ω are\nillustrated by the two plots below. Find the values of ωc, m, φ(ωc), and φ(inf) in terms of the circuit\nparameters R and C.\nlog V\nV\no\ni\nVO\nVI\n= 1\nslope = m\nω\nωc = 1\nlog(ω/ωc)\nφ(ω)\nφ(inf)\nφ(ωc)\nω\nωc = 1\nlog(ω/ωc)\n0*\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 5 (continued):\nωc =\nm =\nφ(ωc) =\nφ(inf) =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 6: 4 points\niL\nL\nvC\nΛ δ(t)\nC\nQ δ(t)\nFigure 5.\nConsider the circuit in Figure 5 with two inputs V (t) = Λ δ(t) and I(t) = Q δ(t). The inductor\nand capacitor have zero initial state, i.e. vC (t = 0-) = 0 and iL(t = 0-) = 0. What are the\ninductor current iL and the capacitor voltage vC at t = 0+? At what frequency ωosc will the circuit\noscillate?\nvC(0+) =\niL(0+) =\nωosc =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 7: 4 points\nR4\nR5\nvO\niO\nC\nR1\nR2\nR3\nFigure 6.\nWhat is the time constant τ for the circuit depicted in Figure 6?\nτ =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 8: 4 points\n\" I N\nFigure 7.\nThe network shown in Figure 7a contains an ideal diode. For the network, plot uour(t) when\nu ~ ~ ( t )\nis the pulse shown in Figure 7b. The capacitor is initially discharged. Please label all\nimportant features of the plot, such as amplitude, time constant, and so forth.\nFor convenience, we have illustrated the U D - ~ Drelationship of the ideal diode in Figure 8b, for\nthe diode terminal variables as defined in Figure 8a.\nFigure 8.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 8 (continued):\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 9: 4 points\nR1\nR3\nL\nR2\niO\ni2\nβi2\nR4\nFigure 9.\nWhat is the time constant τ for the circuit depicted in Figure 9?\nτ =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 10: 4 points\nInlet Inc. manufactures two types of inverters - the SX model and the EX model - which satisfy\nthe following static disciplines.\nInverter SX satisfies a static discipline with the following voltage levels:\nVOH = 4V\nVOL = 0.5V\nVIH = 2V\nVIL = 1V\nSimilarly, Inverter EX satisfies a static discipline with these voltage levels:\nVOH = 5V\nVOL = 0.7V\nVIH = 1.2V\nVIL = 1V\nInlet would like to bid on a contract for buffers issued by QuellCom. The buffers need to operate\nin a system which follows a static discipline with the following voltage levels:\nVOH = 4.55V\nVOL = 0.8V\nVIH = 1.5V\nVIL = 1V\nAs an application engineer at Inlet you are tasked with determining whether a pair of inverters\nconnected in series can satisfy QuellCom's static discipline. For each of the inverter pairs shown\nbelow, indicate whether the circuit can serve as a buffer in QuellCom's systems, or explain in a\nsentence why not.\nSX\nSX\n(a)\nSX\nEX\n(b)\nEX\nSX\n(c)\nEX\nEX\n(d)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 10 (continued):\nIs SX-SX a satisfactory buffer?\nYES\nNO\nIf not, explanation:\nIs SX-EX a satisfactory buffer?\nYES\nNO\nIf not, explanation:\nIs EX-SX a satisfactory buffer?\nYES\nNO\nIf not, explanation:\nIs EX-EX a satisfactory buffer?\nYES\nNO\nIf not, explanation:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 12: 8 points\nvi\nC1\nC2\nR\nvo\nFigure 11.\nQ. Rius is an engineer at Inlet Inc.\nTasked with building a filter, Rius comes up with the\nop-amp circuit shown below, and applies the input signal vI = A sin(ωt).\n(12A)\n(4 points) The output vo(t) is of the form\nvo(t) = Vo sin(ωt + θ)\nDetermine the value of Vo and θ in terms of A, R, C1, C2, and ω.\nVo =\nθ =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 12 (continued):\n(12B)\n(4 points) Experimenting with his circuit, Rius notices that the resistance R is so large\ncompared to the impedances of C1 and C2 that it has little observable effect on the output\neven when he doubles or quadruples the value of R. Excited with this observation, Rius\nremoves R from his circuit in an attempt to reduce the number of components. To his\ndismay, the circuit ceases to work as before. Explain in a sentence or two the reason for\nthe circuit's failure.\nExplanation:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 13: 4 points\nConsider the circuit shown in Figure 12. The parameters characterizing the behavior of the\nMOSFET are K = 2 mA/V2,and VT = 1 V ,and iDs= (K/2)(uGs - VT)'.\nFigure 12.\nDetermine the value of Vo,the DC component of the output voltage. Assume that ui = 0.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 14: 4 points\nConsider the circuit shown in Figure 13. The parameters characterizing the behavior of the\nMOSFET are K = 2 mA/V2,and VT = 1V ,and iDs= (K/2)(uGs- VT)'.\nFigure 13.\nAssume that the input for this circuit is ui(t)= K cos(wt), where K is a small-signal amplitude,\nand assume that the MOSFET can be characterized by a transconductance g,.\nThe small-signal\noutput u,(t) can be expressed in the following form:\nDetermine the values of Voand 0, expressing your answers in terms of Vi,w , R, C, and g,.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 14 (continued):\nVo =\nθ =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 15: 4 points\nFigure 14\nThe circuit depicted in Figure 14a is driven by a signal u I ( t )which is a square wave oscillating\nbetween +5V and -5V with a period of T. The initial capacitor voltage u c ( t = 0 ) = 0. The\nresistor R, is included to insure that the op-amp is operating in a stable range, but it is large\nenough to be ignored in your analysis. Sketch the response uo(t) on the axes provided, labelling\nall of the important features of the waveform.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 16: 4 points\nFigure 15\nThe diodes D l and 0 2 in the circuit of Figure 15 are ideal diodes. If the circuit is driven\nby a signal ui(t) = Kcos(wt), sketch the response u,(t) on the axes provided, labelling all of the\nimportant features of the waveform. (The characteristics of the ideal diode were given in Problem\n8, in Figure 8.)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 17: 4 points\nFigure 16.\nDerive an expression for u,(t) in terms of ul(t) and u2(t)\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nZ\nProblem 19: 20 points\nA car travels at a constant speed along a bumpy road. As a result of the bumps, the velocity\nof the car's axle perpendicular to the road is V (t). Taking into account the dynamics of the car's\nsuspension system, the equation of motion for the body of the car (the chassis) can be formulated\nas follows:\ndu\nt\ndV\nM\n+ Bu(t) + K\nu dt = -M\n(1)\ndt\ndt\n-inf\nwhere u(t) is the velocity of the body of the car (relative to the axle), M is the mass of the car,\nK is the spring constant of the springs connecting the body to the axle, and B is the coefficient of\nviscous damping for the shock absorbers.\nIn this problem, you will be asked to make a circuit model corresponding to the equation of\nmechanical dynamics from Equation 1, and then you will use the model to investigate the car's\nmotion due to the bumpy road.\nNote: Each of the parts of this problem can be worked independently of the others.\nC\nR\nL\nvS\ne(t)\nFigure 18.\n(19A)\n(5 points) The circuit in Figure 18 is proposed to model Equation 1, where the node\nvoltage e(t) is identified with the car body's velocity u(t). Determine the values of vS ,\nC, L, and R in terms of the parameters in Equation 1 so that the solution for e(t) will\nbe identical to the solution of Equation 1 for u(t).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 19 (continued):\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 19 (continued):\n(19B)\n(5 points) Referring to the circuit model, assume that the response is oscillatory.\n- What is the frequency of oscillation ωosc?\n- How long must one wait for the amplitude of the transient oscillation to decay to 1/e\nof its initial amplitude?\nωosc =\nt1/e =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 19 (continued):\n(19C)\n(5 points) Now assume that it is desirable to avoid oscillatory transient behavior. What\nis the maximum value of R in this case?\nRmax =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nProblem 19 (continued):\n(19D)\n(5 points) Once again referring to the circuit, suppose that the source vS (t) is sinusoidal,\ni.e. vS (t) = A sin(ωt). Find an expression for the steady-state voltage e(t).\ne(t) =\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "eesafety.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/4232f38c3f2a88558a44f62beb490698_eesafety.pdf",
      "content": "Handout S07-07\n2/6/2007\nDepartment of Electrical Engineering & Computer Science\nELECTRICAL SAFETY\nfor Staff and Students in EECS Instructional Laboratories\nNEVER WORK ALONE\nIf you are working with energized circuits or equipment over 50 volts peak, make sure that at least\none other person can see you and hear you. In case of emergency DIAL 100 from any phone; and,\nnotify the stock clerk on duty.\nVOLTAGE RULES\nAll EECS Instructional Laboratories lab kit voltages are below 50 volts peak. (OSHA permits\n\"unqualified persons\" to work on such circuits with \"awareness-type\" training.)\nIf you intend to work on a project using power sources over 50 volts peak, you must secure\npermission and receive specific training from your Instructor, TA, or Lab Technical Personnel\nbefore any work on the project begins.\nPREVENT ACCIDENTS: FOLLOW THIS ADVICE\n- Never hurry. Work deliberately and carefully.\n- Connect to the power source LAST.\n- If you are working with a lab kit that has internal power supplies, turn the main power switch\nOFF before you begin work on the circuits. Wait a few seconds for power supply capacitors to\ndischarge. These steps will also help prevent damage to circuits.\n- If you are working with a circuit that will be connected to an external power supply, turn the\npower switch of the external supply OFF before you begin work on the circuit.\n- Check circuit power supply voltages for proper value and for type (DC, AC, frequency) before\nenergizing the circuit.\n- Do not run wires over moving or rotating equipment, or on the floor, or string them across\nwalkways from bench-to-bench.\n- Remove conductive watch bands or chains, finger rings, wrist watches, etc., and do not use\nmetallic pencils, metal or metal edge rulers, etc. when working with exposed circuits.\n- When breaking an inductive circuit open the switch with your left hand and turn your face away to\navoid danger from any arc which may occur across the switch terminals.\n- When using large electrolytic capacitors be sure to wait long enough (approximately five time\nconstants) for the capacitors to discharge before working on the circuit.\n- All conducting surfaces intended to be at ground potential should be connected together.\n[over]\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHandout S07-07\n2/6/2007\nADDITIONAL CAUTIONS\n- The EECS Instructional Laboratories (34-501, 38-500, 38-600) are equipped with Ground Fault\nCurrent Interrupt (GFCI) circuit breakers. Check for leakage paths to ground when breakers trip\nrepeatedly and the problem is not due to an overload.\n- Any equipment used in the laboratories must be equipped with a standard three-prong AC plug or\na two-pronged polarized plug.\n- All exposed non-current-carrying metal parts of fixed and portable equipment that may\naccidentally become energized should be grounded.\n- All electrical equipment or apparatus that may require frequent maintenance must be capable of\nbeing completely disconnected from the power source.\n- Do not bring into the lab or use in the lab equipment that does not conform to these rules without\nspecific permission from your instructor, TA, or Lab Technical Personnel.\nLASER LABORATORY SAFETY\n- Students who intend to use laser systems must read the Radiation Protection Office (RPO) Laser\nSafety Program Handbook before working with lasers. Copies of this handbook are available\nfrom the 38-501 Stockroom.\n- Students must attend the RPO Safety Training Seminar if they will be using Class III or IV lasers.\nRIGHT-TO-KNOW LAW (OSHA HAZARD COMMUNICATION STANDARD)\n- OSHA requires MIT to inform employees (and MIT requires students be informed the same as\nemployees) about potential exposure to hazardous chemicals and about the Institute's Hazard\nCommunication Program and the requirements of the Federal Right-to-Know Law.\nYour\nsupervisor/instructor and department are responsible for providing you with safety information\nand/or training on: - MIT Policies and Procedures on Environmental Health & Safety - Material\nSafety Data Sheets - Labeling requirements for all hazardous materials - The location of the\nhazardous material inventory of your work area - Any operations in your work area that involve\nhazardous chemicals and the associated health and safety hazards - Safety precautions and\nprocedures - Emergency procedures - The hazards of tasks done infrequently\n- The OSHA Hazard Communication Standard and MIT's written Hazard Communication Program\nare on file in the MIT Safety Office and will be made available to any member of the MIT\nCommunity, upon request.\nQUESTIONS ABOUT WORK/SCHOOL SAFETY\n- Any questions about work or school safety should be brought to the attention of your immediate\nsupervisor or instructor. If problems arise that cannot be solved at this level, you should contact\nthe EECS Safety Officer:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHandout S07-07\n2/6/2007\nBASIC ELECTRICAL SAFETY PRACTICES\nThe Institute requires everyone who uses electrical equipment to understand these safety precautions\nto comply with the OSHA Electrical Safety-Related Work Practices standard and MIT's electrical\nsafety policies.\nThe following safe work practices can prevent electrical shock. Contact your\nsupervisor for additional safety training if your job involves repairing, installing or working on\nenergized parts.\nA. Safe Work Practices\n1.\nTurn off and unplug equipment (instead of relying on interlocks that can fail) before removing\nthe protective cover to clear a jam, replace a part, adjust or troubleshoot. Ask a qualified\nperson to do the work if it involves opening equipment and creating an exposure to energized\nparts operating at 50 volts or more.\n2.\nDon't use an electrical outlet or switch if the protective cover is ajar, cracked or missing. Call\nFIXIT (x3-4948) and report this.\n3.\nOnly use DRY hands and tools and stand on a DRY surface when using electrical equipment,\nplugging in an electric cord, etc.\n4.\nNever put conductive metal objects into energized equipment.\n5.\nAlways pick up and carry portable equipment by the handle and/or base. Carrying equipment\nby the cord damages the cord's insulation.\n6.\nUnplug cords from electrical outlets by pulling on the plug instead of pulling on the cord.\n7.\nUse extension cords temporarily. The cord should be appropriately rated for the job.\n8.\nUse extension cords with 3 prong plugs to ensure that equipment is grounded.\n9.\nNever remove the grounding post from a 3 prong plug so you can plug it into a 2 prong, wall\noutlet or extension cord.\n10.\nRe-route electrical cords or extension cords so they aren't run across the floor, under rugs or\nthrough doorways, etc. Stepping on, pinching or rolling over a cord will break down the\ninsulation and will create shock and fire hazards.\n11.\nDon't overload extension cords, multi-outlet strips and wall outlets.\n12.\nHeed the warning signs, barricades and/or guards that are posted when equipment or wiring is\nbeing repaired or installed or if electrical components are exposed.\nB. Check for Unsafe Conditions\n(either before or while you're using equipment:)\n1.\nIs the cord's insulation frayed, cracked or damaged, exposing the internal wiring?\n2.\nAre the plug's prongs bent, broken or missing, especially the third prong?\n3.\nIs the plug or outlet blackened by arcing?\n4.\nWas liquid spilled on or around the equipment?\n5.\nAre any protective parts (or covers) broken, cracked or missing?\n6.\nDo you feel a slight shock when you use the equipment?\n7.\nDoes the equipment or the cord overheat when it is running?\n8.\nDoes the equipment spark when it is plugged in or when switches or controls are used?\nC. If you observe any of these unsafe conditions:\n1.\nDon't use (or stop using) the equipment.\n2.\nTag/label the equipment UNSAFE--DO NOT USE and describe the problem.\n3.\nNotify your supervisor, FIXIT or the service company, as appropriate.\nElectrical safety is for everyone because even contact with the standard 117 volt electrical circuits,\nwhich we constantly use, can be lethal under certain conditions.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab_handout.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/992c85451e40984a2b3a6f4878bb1a76_lab_handout.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Circuits and Electronics\nSpring 2007\nLab Equipment Handout\n(Handout S07-08)\nPrepared by Iahn Cajigas Gonzalez (EECS '02)\nUpdated by Ben Walker (EECS '03) in September, 2003\nThis handout is intended to provide a brief technical overview of the lab instruments which\nwe will be using in 6.002: the oscilloscope, multimeter, function generator, and the protoboard. It\nincorporates much of the material found in the individual instrument manuals, while including some\nbackground information as to how each of the instruments work. The goal of this handout is to serve\nas a reference of common lab procedures and terminology, while trying to build technical intuition\nabout each instrument's functionality and familiarizing students with their use. Students with\nprevious lab experience might find it helpful to simply skim over the handout and focus only on\nunfamiliar sections and terminology.\nTHE OSCILLOSCOPE\nThe oscilloscope is an electronic instrument based on the cathode ray tube (CRT) - not unlike\nthe picture tube of a television set - which is capable of generating a graph of an input signal versus a\nsecond variable. In most applications the vertical (Y) axis represents voltage and the horizontal (X)\naxis represents time (although other configurations are possible). Essentially, the oscilloscope\nconsists of four main parts: an electron gun, a time-base generator (that serves as a clock), two sets of\ndeflection plates used to steer the electron beam, and a phosphorescent screen which lights up when\nstruck by electrons. The electron gun, deflection plates, and the phosphorescent screen are all\nenclosed by a glass envelope which has been sealed and evacuated.\nThe visible part of the CRT tube, the \"screen\", is the outside of the glass wall on whose inner\nsurface lies the phosphorescent film. The screen is inscribed with a set of axes enclosed by a grid. As\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nthe oscilloscope operates, the electron beam traces a graph of the input voltage versus time on the\nphosphorescent film behind these axes. The horizontal axis is the time axis, and the vertical axis is\nthe voltage axis.\nPRINCIPLES OF OPERATION\nThe main component of an oscilloscope is an electron gun which ejects a constant beam of\nelectrons into the surrounding vacuum (see Figure 1). As the beam emerges from the gun, it passes\nthrough a set of parallel plates (the Vertical deflection plates) oriented horizontally. The voltage to\nbe displayed is amplified and applied across these plates producing an electric field which deflects\nthe path of the electrons vertically. The polarity of the signal of interest determines whether the\ndeflections will be up or down and the magnitude of the signal determines the amount of vertical\ndisplacement of the electrons.\nFigure 2 Deflection of an electron in a uniform electric field\nAfter the beam has passed through the Vertical deflection plates, it passes through a second\nset of similar plates that are oriented vertically. A potential difference applied to these plates\nproduces an electric field which deflects the electrons left or right. Under most configurations (one\ncommon exception is XY mode to be discussed later), these Horizontal deflection plates make the\nCourtesy of Iahn Cajigas Gonzalez. Used with permission.\nFigure 1 The internal parts of an oscilloscope\nCourtesy of Iahn Cajigas Gonzalez. Used with permission.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nbeam move sideways at a constant speed. By adjusting this speed with the Sweep knob, the resulting\ntrace on the screen can be spread out or compressed.\nIf the two deflecting voltages were held constant, the electron beam would strike a fixed point\non the phosphorescent film and a stationary point would be visible on the screen. However, most\nvoltages of interest are time-varying and so the voltage applied to the Horizontal deflection plates is\nvaried with time in such a way that the spot moves from left to right on the screen as time passes.\nSince the phosphorescent material has the property of emitting light for several milliseconds after the\nelectrons have passed, the total effect is for the electrons to leave behind a visible trail - a time-\nvarying waveform.\nThe horizontal deflection voltage (or \"sweep\" voltage) is also varied in such a way that when\nthe beam reaches the right-hand edge of the screen, it starts over at the left-hand side. If the signal to\nbe displayed varies periodically in time, it is possible to synchronize the sweep voltage with the\nsignal so that the curve appears motionless on the screen. This is done with the Trigger Level control\nwhich sets the oscilloscope to begin a trace when the voltage it measures reaches a certain value. The\n(+) or (-) button lets you choose whether you want the oscilloscope to trigger on a positive or\nnegative voltage. A trace that is running across the screen can usually be stabilized by adjusting the\ntrigger level (as long as the waveform is periodic!).\nUSING THE SCOPE\nNow that we have acquired a basic understanding of how the oscilloscope works, we can\nproceed to explore some of the most common tasks which can be accomplished with it. The\noscilloscope which we will be using in 6.002 is the Tektronix 2445 - a four channel (input) scope.\nSince the oscilloscope has four channels, we could simultaneously graph four distinct input voltages\non the CRT (although we won't get that complicated in 6.002!). Aside from the display itself, the\noscilloscope consists of various control panels which give the user complete control of how the scope\nprocesses and displays its inputs. In the section that follows we will describe each of the control\npanels and outline the functionality of each of the settings found therein.\nTHE DISPLAY\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nThe oscilloscope's display can be adjusted in various ways in order to make the displayed\nsignals brighter and more defined on the screen. Under the display screen you will find a series of\ncontrols which will allow you to adjust the waveform brightness and focus, etc. The following are the\nlabels of the controls along with a description of their function.\nINTENSITY:\nControls the brightness of the displayed waveform. As you increase the sweep\nspeed of an analog oscilloscope, you need to increase the intensity level.\n\nFOCUS:\nControls the sharpness of the displayed waveform on the screen.\nREADOUT INTENSITY:\nControls the intensity of the oscilloscope's on-screen measurement readouts\nsuch as frequency, period, SEC/DIV, and VOLTS/DIV.\nFOCUS:\nControls the sharpness of the on-screen measurement readouts on the display.\n\nSCALE ILLUMINATION:\nAdjusts the brightness of the screen grid.\nINPUT CHANNELS\nAs mentioned previously, the Tektronix 2445 has four analog input ports for connecting to the\noutside world. These are labeled CH 1 - CH 4 (only CH 1 and CH 2 are full-featured) and are located\nhorizontally along the bottom of the control panel. It is here that we will connect our probes and\ninterface with the function generator and the circuits we build. Each channel has a variety of\nindividual controls which affect how the channel's input will be processed and displayed on the\nscreen. These are input coupling, vertical position, and volts per division (these switches are found\nabove their corresponding input channel).\nThe input coupling setting affects how the input signal is processed by the oscilloscope. In the\ncase of the Tektronix 2445, the input coupling can be set to DC, AC, or GND. The simplest of these\nis the GND setting which disconnects the input signal from the vertical system, letting you see where\nzero volts is on the screen. Switching from DC to GND and back again is a handy way of measuring\nsignal voltage levels with respect to ground.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure 3 Control Panel for the Tektronix 2445 Oscilloscope\nBefore continuing with how the DC and AC settings affect the displayed signal, it is worth\nnoting that all signals can be broken down into two basic components: a constant component (DC)\ndefined as the time-average of the signal, and a time-varying component (AC) defined as the original\nsignal minus the average value. With this in mind, the DC coupling setting displays the entire input\nsignal (time-varying plus constant components), while the AC coupling setting blocks the DC\ncomponent of a signal so that only the time-varying waveform appears centered at zero volts. The AC\ncoupling is handy when the entire signal is too large for the VOLTS/DIV setting or the AC\ncomponent is very small compared to the DC component.\nOnce we have selected the proper type of input coupling for the signal we will be viewing, we\ncan select where it will be placed on the screen via the vertical position control. The vertical\npositioning knob is located at the top left of the control panel for CH 1-2 and at the bottom right for\nCH 3-4. These vertical controls are all independent, so that each channel's input can be positioned\nfreely on the display. It is important to remember that the range of these knobs is greater than the size\nof the screen, so the waveform can be moved off the screen altogether!\n\nThe volts per division setting varies the size of the waveform on the screen. Think of the\nVOLTS/DIV setting as a scale factor (this is the factor by which the input waveform is amplified\nbefore it is applied to the Vertical Deflection plates). For example, if the VOLTS/DIV setting is 5\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nvolts, then each of the eight vertical divisions represents 5 volts and the entire screen can show 40\nvolts from bottom to top. If the setting is 0.5 VOLTS/DIV, the screen can display 4 volts from\nbottom to top, and so on. In general, the maximum voltage that can be displayed is the VOLTS/DIV\nsetting times the number of vertical divisions. The small knob, called a vernier knob, labeled VAR\nlocated on the VOLTS/DIV knob controls a variable gain used for scaling a displayed signal to a\ncertain number of divisions. Note: The vernier knob should be set full clock-wise in order for the\nscale settings on the VOLTS/DIV knob to be accurate.\nIn a manner identical to the VOLTS/DIV setting, the scale of the time axis (X-axis) can also\nbe controlled using the SEC/DIV knob. For example, if the SEC/DIV setting is 1 second, then each\nof the 10 horizontal divisions represents 1 second and the entire screen can display 10 seconds. In\nessence, this setting is letting you adjust the rate at which the waveform is drawn across the screen\n(also known as the time-base setting or sweep speed). As with the vertical VOLTS/DIV setting, there\nis also a variable timing control which allows the user to set the horizontal time scale between\ndiscrete settings.\nMODE MENU\nLocated at the top left corner of the control panel, under the MODE section we find four\nchannel select buttons along with four other buttons: ADD, INVERT, CHOP, and 20MHz BW\n(Bandwidth) LIMIT. Not surprisingly, the four channel select buttons labeled CH 1-CH 4 are used\nto select the channels which will be displayed on the screen. The function of the four remaining\nbuttons are described below:\nADD:\nDisplays the sum of the signals on CH1 and CH2 on the display. The individual\nsignals are no longer displayed separately.\n\nINVERT:\nDisplays the negative of the signal present on CH2.\nCHOP:\nCauses the oscilloscope to draw small parts of each signal by switching back and forth\nbetween them. The switching rate is too fast for you to notice, so the waveform looks\nwhole. This mode is typically used with slow signals requiring sweep speeds of 1ms\nper division or less.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n20MHz BW LIMIT:\nLimits the input bandwidth of the oscilloscope. By limiting the bandwidth, you reduce\nthe noise that sometimes appears on the displayed waveform yielding a more precise\nsignal display.\nTRIGGERING\nThe trigger controls, found at the top right of the scope, give you the ability to stabilize\nrepeating waveforms and capture single-shot waveforms by adjusting the sweep speed in such a way\nthat the waveform is redrawn in the same exact location during each pass. The trigger circuit acts as a\ncomparator. You select the slope and the voltage level of one side of the comparator. When the\ntrigger signal matches your settings, the oscilloscope generates a trigger. The slope control\ndetermines whether the trigger point is on the rising (positive slope) or falling (negative slope) edge\nof a signal. The level control determines where on the edge the trigger point occurs.\nThe oscilloscope does not necessarily have to trigger on the signal being measured. Several\nsources can trigger the sweep: any input channel, an external source (other than the signal applied to\nan input channel), or a signal internally generated by the oscilloscope. Most of the time you can leave\nthe oscilloscope set to trigger on the channel being displayed. Note: The oscilloscope can use an\nalternate trigger source whether it is being displayed or not. Be careful not to unwittingly trigger on,\nfor example, channel 1 while displaying channel 2.\nThe trigger mode determines whether or not the oscilloscope draws a waveform if it does not\ndetect a trigger. Common trigger modes include normal and auto. In normal mode the oscilloscope\nonly sweeps if the input signal reaches the set trigger point; otherwise the screen is left blank. Normal\nmode can be disorienting since you may not see the signal at first if the level control is not adjusted\ncorrectly.\nAuto mode causes the oscilloscope to sweep without manual adjustment. If no signal is\npresent, a timer inside the oscilloscope triggers the sweep. This ensures that the display will not\ndisappear if the signal drops to small voltages. It is also the best mode to use if you are looking at\nmany signals and do not want to bother setting the trigger each time.\nIn practice, you will probably use both modes: normal mode because it is more versatile and\nauto mode because it requires less adjustment.\nThe same way the AC or DC coupling can be selected for the vertical system, you can choose\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ndifferent types of coupling for the trigger signal. Besides AC and DC coupling, we can have high\nfrequency rejection, low frequency rejection, and noise reduction trigger coupling. These special\nsettings are useful for eliminating noise from the trigger signal in order to prevent false triggering.\nHIGH Z (1 MEGOHM) VS. 50 OHM MODES\nIdeally, we would like the oscilloscope to perfectly recreate its input signals on the display.\nHowever, once we connect the probes, the oscilloscope actually becomes part of the circuit we want\nto explore (possibly altering the voltages and currents we wanted to measure). This interaction\nbetween the oscilloscope and an external circuit is termed circuit loading. In an effort to minimize the\namount of circuit loading for a given application, the oscilloscope provides two input impedance\nconfigurations: High Z mode and the 50 Ohm mode.\nThe High Z or 1 Megohm mode makes the oscilloscope's input impedance very high so that\nnegligible current is drawn from the circuit being tested. The term High Impedance is relative\nhowever, and in the case that the circuit being observed has an output impedance greater than 1\nMegohm, more current will flow through the probes and into the oscilloscope (through the path of\nleast resistance), than through the circuit itself.\nThe 50 Ohm input impedance mode is used to match the 50 ohm output impedance of fast\namplifiers and other devices. In such applications, failing to properly match the device's output\nimpedance leads to signals being reflected once they reach the oscilloscope. These reflections cause\nthe signal being viewed to be distorted by time-delayed versions of itself. We will not be using the 50\nOhm input impedance mode in 6.002.\nXY MODE\nThe oscilloscope also lets you display an input signal rather than the time base on the\nhorizontal axis. This setup is called XY mode because both the X and Y axes are tracing input\nvoltages. As a note of interest, the waveform resulting from the XY arrangement of two periodic\nsignals of different periods is called a Lissajous pattern. From the shape of the Lissajous pattern, you\ncan determine information about the relative phases of the signals, as well as their frequency ratio.\nFor example, if you were to input the signal sin(ωt) into both channel 1 and 2. Using the XY\nmode you would see a straight line of unit slope displayed on the screen (because at every instant the\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nvoltages on channel 1 and 2 are identical, ie. X=Y). Now imagine that you input the function sin(ωt)\nin channel 1, but this time you decide to input sin(ωt - π/2) = cos(ωt) into channel 2. In this case\ny=sin(ωt) and x=cos(ωt), which as you might remember from trigonometry correspond to the\nparameterization of the points on a circle.\nBASIC MEASUREMENTS & PROCEDURES\nGrounding:\nProper grounding (connecting an electrical device to an electrically neutral reference point\nsuch as earth ground) is an important step when setting up to take measurements or work on a circuit.\nProperly grounding the oscilloscope by plugging its three-pronged power cord into an outlet protects\nyou from a hazardous shock, while grounding yourself protects your circuits (especially small\nintegrated circuits with memory) from damage.\nGrounding the oscilloscope is necessary for safety. If a high voltage contacts the case of an\nungrounded oscilloscope, any part of the case, including knobs that appear insulated, you can receive\na shock. However, with a properly grounded oscilloscope, the current travels through the grounding\npath to earth ground rather than through you to earth ground.\nGrounding is also necessary for taking accurate measurements with your oscilloscope.\nMeasuring a signal requires two connections: the probe tip connection and a ground connection.\nProbes come with an alligator-clip attachment for grounding the probe to the circuit under test. In\npractice, you clip the grounding clip to a known ground in the circuit, such as the metal chassis of a\nstereo you are repairing, and touch the probe tip to a test point in the circuit.\nMEASURING SIGNAL FREQUENCY, PERIOD AND AMPLITUDE\n\nMeasuring signal amplitude:\n1)Making sure that the channel of interest is the one being displayed, adjust the\nSEC/DIV and VOLTS/DIV settings until the waveform is clearly visible on the\ndisplay.\n2)Press ∆v button (located above the SEC/DIV knob).\n3)Use the ∆REF knob in order to select the point which will serve as your\nmeasurement reference.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n1.For peak amplitude measurements (Vp )place the ∆REF line along the\nwaveform's zero crossing line.\n2.For peak-to-peak measurements (Vp-p ) place the ∆REF line along the\nwaveform's minima.\n4)Using the ∆ knob move the second line until it reaches the top of the waveform.\n5)The measured amplitude will be displayed at the top right of the display.\nMeasuring Signal Period:\n1)With the waveform properly centered on the display, press the ∆t switch (located\nabove the SEC/DIV knob).\n2) Place the ∆REF line at the wave's point of reference: minima, maxima or zero.\n3) Use the delta knob to locate the corresponding point one cycle further down the\nwave.\n4) The signal period will be displayed at the top right of the display.\nMeasuring Signal Frequency:\n1)Follow the steps outlined for measuring the signal's period.\n2)Once one period of the signal has been selected, simultaneously press ∆v and ∆t.\nThe reading at the top right of the display is the frequency of the waveform.\nNote: Make sure that the x10 button at the top of the control panel is not selected or\nthe waveform might be too large to fit properly on the screen.\nNote: Pressing the tracking button holds the distance between the ∆REF and ∆ lines fixed.\nThis might be helpful to make comparisons of signal period, frequency, or amplitude with a\nwaveform present on another channel.\nBASIC TROUBLESHOOTING\nWorking with noisy signals:\nIf noise is present in the signal being observed using one of the following options\nmight be appropriate depending on the type of noise present:\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n1) Enable the 20MHz Bandwidth limit option located in the MODE MENU. This\noption should be selected when using the oscilloscopes in lab because FM radio\nsignals broadcast from nearby manifest themselves as high frequency noise on the\nscope.\n2) Make sure that your circuit is wired neatly. Although this should not be a critical\nissue for the circuits we build in 6.002, it is something to keep in mind while\ndebugging (especially for more complicated circuits). Also, try to avoid using long\npieces of wire on your circuit.\n3)Check that the appropriate point in the circuit is properly grounded (usually\naccomplished through the power supply ground).\nCalibrating the Scope Probes:\nFigure 4 Oscilloscope Probe Compensation\n[Image courtesy of: XYZs of Analog and Digital Oscilloscopes -Tektronix, pg. 26]\n1)Connect an input probe to the calibration signal provided by the oscilloscope itself.\nThis is located in-between the CH3 and CH4 input ports. Note: If no signal is\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\navailable at this port or if the oscilloscope you are using does not have this\ncalibration signal available, a square wave generated by the function generator\nwill suffice.\n2)Adjust the scope settings until the waveform can be clearly seen.\n3)Adjust the knob on the probe until the square wave is almost perfect.\n(Note: This procedure works by changing the capacitance of the probe and hence the RC time\nconstant of the probe-oscilloscope circuit.)\nTHE MULTIMETER\nThe multimeter is capable of measuring voltages, currents, resistance, waveform frequency\n(or period), and even short circuits (continuity). Given the wide range of measurements that are\npossible with this device, it is easy to see why it has become such an indispensable tool in lab. Due to\nthe complexity of the internal circuitry which makes up the multimeter, however, we will focus\nmainly on learning how to perform some common measurements which will be useful throughout\n6.002 (although after this course, you should hopefully have some intuition as to how some of these\ncircuitry works). Before jumping straight into the measurement procedures, let us take a brief look at\nthe multimeter control panel.\nFigure 5 The HP 33120A Multimeter Control Panel\nFUNCTION MENU\nThe function menu is the main interface for controlling the operation of the HP 33120A\nMultimeter. Located along the top row of the multimeter's control panel, this menu allows us to select\nthe type of measurement which we will be performing with the device. The following is a description\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nof the various functional configurations possible along with a description of how to select them.\nVoltmeter\nConfigures the multimeter to measure voltages via its input ports. This configuration\nis selected by either pressing the DC V or the AC V buttons. See the measurement\nprocedures at the end of this section for a description of how the input probes must be\nconnected.\nAmmeter\nConfigures the multimeter to measure currents via its input ports. This configuration is\nselected by pressing either the DC I (SHIFT, DC V) or AC I (SHIFT, AC V)\nbuttons.\nOhmmeter\nConfigures the multimeter to measure the resistance seen looking into a circuit from\nits input ports. This configuration is selected by pressing the Ω\n2W button. For\napplications which require the measurement of small resistances (say a few Ohms),\nselect the Ω\n4W (SHIFT, Ω 2W) setting.\n\nFrequency/ Period\nConfigures the multimeter to measure the frequency (or period) of the signal presents\nat its input port. This setting uses the same probe configuration as the Voltmeter. See\nBASIC MEASUREMENTS & PROCEDURES for information on this configuration.\nContinuity/ Diode Checking\nConfigures the multimeter to check for circuit continuity. That is it checks to see if the\nloop formed by the positive and negative probe leads and the circuit being tested is\nclosed. This mode is useful for detecting broken wires in circuits (open circuits), etc.\nIf the path is closed the multimeter will produce a beep.\nWhy are there different probe configurations for the different types of measurements? The\nreason lies in how the multimeter must interact with the circuit being tested while measuring either\nvoltage or current. To measure voltage without loading the circuit being examined, the voltmeter\nmust be placed in parallel with the circuit and must present a very large input impedance so that\nnegligible current flows through the probes. However, in order to measure current, the ammeter must\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nbe placed in series with the circuit and must present a very small impedance so that the flow of\ncurrent through that branch is not disturbed. In order to ensure that the circuit sees a very small input\nimpedance a different port on the multimeter is used for the ammeter configuration.\nBASIC MEASUREMENTS & PROCEDURES\nMultimeter self diagnostic:\nThe HP 34401A multimeter has a complete self routine which performs an extensive\nseries of tests on the multimeter in order to detect if all of the internal components are\nworking properly.\n1) Turn off the multimeter.\n2) Hold down SHIFT as you press the Power switch to turn on the multimeter. Hold down\nthe key for more than 5 seconds.\n3) The self-test will begin when you release the key.\n4)If the self-test is successful, PASS is displayed on the front panel, otherwise FAIL is\ndisplayed and the ERROR annunciator turns on. Consult a lab assistant for further\nassistance.\nMeasuring Signal Voltage:\n1) Connect the positive signal probe into the top right input port labeled HI, and the\nnegative signal probe in to the terminal directly below labeled LO.\n2) Once the probes have been connected, press either the DC V or AC V button\ndepending on the type of voltage being measured. Note: The value measured under\nthe AC V configuration is the RMS (root-mean square) value of the signal. The\nRMS value is defined to be the square root of the average value (over a period) of\nthe square of the signal (for a sine wave VRMS = 1 / sqrt(2) * Vp).\n3)Connect the probes to the circuit being examined.\n4) The magnitude of the voltage measured will be displayed on the screen.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMeasuring resistance:\nThe multimeter measures the resistance seen at the terminals by injecting a test\ncurrent, Itest, of known magnitude into the circuit being probed and measuring the voltage\nseen at the terminals. The ratio Vterm/ Itest equals the resistance seen at the terminals, Rterm .\nThe following steps outline how to perform this measurement:\n1) Connect the positive lead to the port labeled HI located at the top right of the\ncontrol panel.\n2) Connect the negative lead to the port labeled LO located immediately below the top\nright input port.\n3) Press the button labeled Ω 2W (or Ω 4W for smaller resistance values) on the\ncontrol panel in order to enable the Ohmmeter mode.\n4)Connect the probes to the resistor being measured. Note: The resistor must be\nisolated from the rest of the circuit.\n5)The magnitude of the resistance measured will be displayed on the screen.\nMeasuring Current:\n1)Make sure the circuit being tested is powered off before proceeding with this\nsection.\n2)Connect the positive lead into the port labeled 3A RMS (fused on rear panel)\nlocated at the bottom right of the input panel.\n3) Connect the negative lead to the port labeled LO located second from the bottom on\nthe right side of the input panel.\n4) Select either to measure DC I or AC I in order to place the multimeter in Ammeter\nconfiguration. Note: The value measured under the AC V configuration is the RMS\n(root-mean square) value of the signal. The RMS value is defined to be the square\nroot of the average value (over a period) of the square of the signal (for a sine\nwave IRMS = 1 / sqrt(2) * Ip).\n5) Break the circuit where is the current is to be measured and connect the probes. Be\ncareful about polarity!\n6)Power on the circuit being tested.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n7)The magnitude of the current measured will be displayed on the screen.\nNote: If the ammeter is not working even though it has been setup properly, the\ncurrent-limiting fuse located on the back of the multimeter should be checked. If the\nfuse has burned out, no current will flow into the ammeter.\nTHE FUNCTION GENERATOR\nIn 6.002 we will be using the HP 33120A Function Generator in order to generate most of the\nwaveforms that we will be using to test the circuits we build. Although the circuitry which actually\ngenerates the waveforms inside the function generator is quite complex, its use should be quite\nintuitive. In the same manner that we require a variety of waveforms in order to analyze and\nunderstand circuits analytically, we need a way to recreate those mathematical waveforms in lab to\nverify that our analytical design actually works as we had anticipated. As done previously for the\noscilloscope and multimeter, we will review all of the main features of the HP 33120A and then\nproceed to describe some basic procedures for its use.\nFigure 6 The HP33120A Function Generator Control Panel\nThe function generator provides various methods for entering numerical values to the device.\nThe greater than and less than keys (> , <) are used to select the digit which will be modified, and the\nknob and up-down arrow keys are used to increment or decrement the value of the selected digit. Use\nthe Enter Number mode to enter the number with the appropriate units. The type of units to be used\nare also selected with the arrow keys.\nFUNCTION/MODULATION MENU\nThe FUNCTION/MODULATION control panel on the function generator presents the main\ninterface for controlling wave shape, frequency, amplitude, and offset. By combining all of these\nfeatures it is possible to recreate almost any necessary test waveform. The sine wave, square wave,\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ntriangle wave, and ramp buttons generate the respective waveforms at the output of the function\ngenerator. The frequency (default is 1kHz) and amplitude (default is 100mV) values for these\nwaveforms will be those currently selected by the user. The MODULATION settings which can be\nselected with the SHIFT key will not be used in 6.002. These allow the user to generate an output\nusing one of the following signal modulation schemes: Amplitude, Frequency, Frequency-Skip\nKeying, Burst, and Frequency Shift.\nThe function generator also includes a set of predefined waveforms which might be\ninteresting to play around with. These range from an exponential rise waveform to a test cardiac\nsignal. They can be selected by selecting the Arb List (SHIFT, Arb ) setting. Once one of these\nwaveforms has been selected, it will be assigned to the ARB key and can be retrieved at any time by\npressing this key. As with all other waveforms, the amplitude and frequency can be modified as\ndescribed at the end of this section.\nFUNCTION GENERATOR OUTPUTS\nAt its output terminals, the function generator presents an impedance of 50 Ohms to any\ncircuit which is being examined. When the function generator interacts with an outside circuit, it can\nbe set to operate either one of two modes: 50 Ohm (the 50 Ohm mode will not be used in 6.002) and\nHigh-Z mode. Selecting these options does not change to the output impedance of the function\ngenerator, rather it informs the generator of the type of impedance to expect from the circuit being\nmeasured. Knowing the type of circuit with which it is interfacing allows the generator to modify its\noutput so that the user-selected waveform properties are those seen at the input terminals of the\ncircuit.\nThe necessity of these controls can be seen from the following expression for the input\nvoltage of the any circuit being interfaced with the function generator: Vcircuit = Vgenerator * Rcircuit/\n(Rgenerator + Rcircuit). If the input impedance of the circuit, Rcircuit, is 50 Ohms we see that the voltage\nseen at the input terminals of the device is just half the voltage being provided by the function\ngenerator, Vcircuit = Vgenerator / 2 . Conversely, if the circuit's input impedance is very large (Rgenerator\n<< Rcircuit ) , then we see that the voltage seen at the input terminals of the device is exactly that\nwhich is being output from the function generator, Vcircuit = Vcircuit . Knowing the approximate input\nimpedance of the circuit of interest therefore allows the function generator to compensate for these\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\ndifferences.\nNote: If the function generator is operating in 50 Ohm mode and a high impedance circuit is\nconnected to it, the voltage present at its terminals will be two times larger than expected.\nBASIC MEASUREMENTS & PROCEDURES\nFunction Generator self diagnostic:\nThe HP 33120A has a complete self routine which performs an extensive series of\ntests on the function generator in order to detect if all of the internal components are working\nproperly.\n1)Turn off the function generator.\n2)Hold down SHIFT as you press the Power switch to turn on the function generator. Hold\ndown the key for more than 5 seconds.\n3)The self-test will begin when you release the key.\n4)If the self-test is successful, PASS is displayed on the front panel, otherwise FAIL is\ndisplayed and the ERROR annunciator turns on. Consult a lab assistant for further\nassistance.\nTo set the function generator to High-Z mode:\n1)Press SHIFT and then ENTER in order to access the MODE MENU.\n2)Scroll through the menu until the D: SYS MENU item appears on the screen.\n3)Press the down arrow twice in order to enter the input impedance mode selection submenu.\n4)Press the left or right arrow keys (<, >) until the words HIGH-Z appear on the display.\n5)Once HIGH-Z has been selected press the RETURN key to accept the selection and return\nto the measurement display.\nNote: If the function generator is in 50 Ohm Mode the voltages generated will be 2 times\nlarger than expected for the circuits we will be using. See the previous section on the\nfunction generator outputs for more details.\nTo set the output frequency of a selected waveform:\n1)Enable the frequency modify mode by pressing the FREQ key.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n2) Enter the magnitude of the desired frequency using either the dial, arrow keys, or\nthe Enter Number function. Notice that the Num annunciator turns on and \"ENTER\nNUM\" flashed on the display, indicating that the number mode is enabled. To\ncancel the number mode, press SHIFT and CANCEL.\n3) Set the units to the desired value. As soon as you select the units, the function\ngenerator outputs the waveform with the displayed frequency. To turn off the\nflashing digit, move the cursor to the left of the display using the arrow keys.\nTo set the output amplitude:\n1) Enable the amplitude modify mode by pressing the AMPL key.\n2) Enter the magnitude of the desired amplitude.\n3)Set the units of the desired value.\nTo set a DC Offset Voltage:\n1)Enable the offset modify mode by pressing the OFFSET key.\n2)Enter the magnitude of the desired offset.\n3)Set the units to the desired value.\nNote: Notice that the Offset annunciator turns on, indicating that the waveform has\nan added offset. The annunciator will turn on when the offset is any value other than\n0 volts.\nOutputting a DC Voltage:\nIn addition to generating waveforms, you can also output a dc voltage in the range of\n+/- 5 Volts DC.\n1)Press the OFFSET key and hold it down for more than 2 seconds.\n2)Enter the magnitude of the desired voltage.\n3)Set the units of the desired value.\nNote: Notice that the Offset annunciator turns on (all other annunciators are off),\nindicating that a dc voltage is being output.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTHE PROTOBOARD\nIn 6.002 we will be making use of a protoboard for constructing our lab circuits. The layout of\nthe protoboard allows us to quickly construct and test circuits without the need for complicated\nwiring or soldering. Figure 7 illustrates the internal wiring of the protoboard. Note: The dark center\nstrip indicates that the five columns to the left are electrically isolated from the five columns two the\nright. That is, no physical connection exists between them.\nConnected vertically\nConnected Horizontally\nConnected Horizontally\nFigure 7 Internal connections of a protoboard.\n\nAs shown in Figure 7, there are 4 columns which are connected vertically. That is, a voltage\nCourtesy of Iahn Cajigas Gonzalez. Used with permission.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\napplied to any point in that column will be available at any other point along the same column. These\ncolumns are typically used to supply Vcc and GND to the circuit being constructed. The remaining\nsockets of the protoboard are connected horizontally, so that a voltage applied to any point in a row is\navailable at all other points of the row. Since rows on different sides of the center isolator are\nunconnected, the center region is most commonly used to place integrated circuits (such as op-amps,\netc.) so that each pin of the IC has an entire row for possible connections.\nThis wiring configuration applies, not only to the protoboards which we will use in 6.002, but\nin general to most protoboards.\nREFERENCES\nOSCILLOSCOPE REFERENCES\n1)XYZ of Analog and Digital Oscilloscopes; Tektronix, Inc., Copyright 1992, 1993.\nWeb Reference: http://www.tektronix.com/Measurement/App_Notes/XYZs/scope.html\n2)Oscilloscope web references:\nhttp://progdev.sait.ab.ca/cmph200/oscillos.htm#Objective%204\nhttp://iet.jjc.cc.il.us/oscopes.htm\nhttp://www3.ncsu.edu/ECE480/scope1.htm\nhttp://www4.ncsu.edu/~mowat/H&M_WebSite/Oscilloscope/Oscilloscope.html\nhttp://www.lecroy.com/Applications/ProbesProbing/default.asp\nMULTIMETER REFERENCES\n1)HP 34401A Multimeter: User's Guide; Hewlett-Packard Company, Copyright 1991-1996.\nFUNCTION GENERATOR REFERENCES\n1)HP 33120A / Arbitrary Waveform Generator: User's Guide; Hewlett-Packard Company, Copyright\n1994,1996, 1997.\nNOTE: The manuals for the Tektronix 2445 Oscilloscope, HP 34401A Multimeter, and the HP\n33120A Function Generator are available at the front desk of the 5th floor lab.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGLOSSARY\nAC - (Alternating Current) Used to refer to any waveform that varies in a repeating pattern over time.\nADC - (Analog-to-Digital-Converter) A digital electronic component that converts an electric signal\ninto discrete binary values.\nAM - Modulation in which the amplitude of a carrier wave is varied in accordance with some\ncharacteristic of the modulating signal.\nBandwidth - A range of frequencies.\nCircuit Loading - The unintentional interaction of the probe and oscilloscope with the circuit being\ntested, distorting the signal.\nCoupling -The method of connecting two circuits together. Circuits connected with a wire are\ndirectly coupled; circuits connected through a capacitor or a transformer are indirectly (or AC)\ncoupled.\nCRT (Cathode-Ray Tube) - An electron-beam tube in which the beam can be focused on a\nluminescent screen and varied in both position and intensity to produce a visible pattern. A television\npicture tube is a CRT.\nDC (Direct Current) - A signal with a constant voltage or current.\nFM (Frequency Modulation) - Modulation in which the instantaneous frequency of a sine wave\ncarrier is caused to depart from the center frequency by an amount proportional to the instantaneous\nvalue of the modulating signal.\nGround - 1. The voltage reference point in a circuit. 2. A conducting connection by which an electric\ncircuit or equipment is connected to the earth to establish and maintain a reference voltage level.\nHertz (Hz) - One cycle per second; the unit of frequency. The waveforms frequency equals 1/Period.\nImpedance (Z) - The ratio of voltage to current at the terminals of an element or circuit under\nsinusoidal steady state conditions.\nModulation - The process, or result of the process, of varying a characteristic of a carrier, in\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\naccordance with an information-bearing signal.\nPeak (Vp) - The maximum voltage measured from a zero reference point (ie. Ground).\nPeak-to-Peak (Vp-p) - The voltage measured from the maximum point of a signal to its minimum\npoint. For symmetric waveforms, usually equal to 2 times Vp.\nPeriod - The amount of time it takes a waveform to complete one cycle. The period equals\n1/Frequency.\nRise Time -The time taken for the leading edge of a pulse to rise from its minimum to its maximum\nvalue.\nRoot Mean Square (RMS) - the RMS value of a periodic signal is defined to be the square root of\nthe average value (over one period) of the square of the signal. For a sine wave of unit amplitude, the\nRMS voltage is 1/ sqrt(2) =.707 of the peak value; for a square wave it is equal to the peak value; for\na triangle wave it is less that .707.\nSignal Generator - A test device for injecting a signal into a circuit input; the circuit's output can\nthen be read by an oscilloscope.\nSweep - One pass of an oscilloscope's electron beam from left to right across the CRT screen.\nTransducer - A device that converts a specific physical quantity such as sound, pressure, strain, or\nlight intensity into an electric signal or vice versa.\nTransient - A signal typically generated when a circuit is powered on and before it settles into its\nsteady state behavior.\nTrigger - The circuit that initiates a horizontal sweep on an oscilloscope and determines the\nbeginning of a waveform.\nTrigger Holdoff - A control that inhibits the trigger circuit from looking for a trigger level for some\nspecified time.\nTrigger Level - The voltage level that a trigger source signal must reach before the trigger circuit\ninitiates a sweep.\nZ-Axis - The signal in an oscilloscope that controls electron-beam brightness as the trace is formed.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "labpractices.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/8d05b0f4d4ce5dab988346463658efa7_labpractices.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nLab Practice & Safety\nHandout S07-006\nIntroduction\nThis handout discusses aspccts of thc cxpcri~nc~ital\nIt\nlab work that you will pcrforni in 6.002.\nbcgins witli a discussion of good lab practice, and ends witli a discussion of lab safcty. You should\npay spccial attcntion to tlic EECS Elcctrical Safcty Noticc attachcd to thc cnd of this handout\n(H07). As indicated, it niust bc signcd and rcturncd to tlic EECS I~istru~ncnt\nDcsk in tlic Lab in\nordcr for you to pick up your lab kit.\nYour Lab Notebook\nYour lab notcbook should bcco~nc a coniplctc and pcrlnanc~it rccord of tlic cxpcrimcnts you pcrfor~n\nduring thc scnicstcr. Tlic notcbook itsclf should bc a bound hard covcr ~iotcbook with graph-rulcd\npagcs. Sincc your lab notcbook should co~itaili your raw cxpcrimc~ital data, you should ncvcr copy\ndata into your lab notcbook from somc othcr papcr. If you do not liavc your lab notcbook with\nyou whcn you rccord your data, you should staplc thc pagc of raw data into your lab notcbook.\nCopying data into your lab ~iotcbook aftcr coniplcting an cxpcrinicnt risks beautifying your lab\nnotcbook witli copying crrors.\nLikc any lab notcbook, your 6.002 lab ~iotcbook should contaili tlircc distinct scctions for cacli\ncxpcri~ncnt pcrfornicd:\n(1) thc dcsign, analysis and prcdictio~is you co~nplctc bcforc your cxpcrimcntal work:\n(2) thc data and obscrvations you rccord during your cxpcriniclltal work;\n(3) and tlic analysis and intcrprctations you colnplctc aftcr your cxpcrimc~ital work\nIf your lab notcbook is organized in this nianncr, thcn anyone, includi~ig yoursclf, should bc ablc\nto pick up your lab notcbook at a latcr time and follow your prcli~ninary analysis, reconstruct tlic\ncxpcri~ncntsyou pcrformcd, rcproducc your raw data, and rcacli cquiwlcnt conclusions.\nSincc your lab work is only uscful if it can bc cxplai~icd to and rcproduccd by othcrs, your lab\nnotcbook niust bc niorc than analyscs and ~iunibcrs witli no contcxt. Thc following guidclincs should\nhclp you producc niorc consistc~it lab rccords witli clcas distinctions bctwccn your cxpcctations:\nyour actual data, and your a~ialysis of thc data.\nP T ~ -\nLab Wr,r.k\nPrc-lab work is dcsigncd to ~notivatc and dcfinc your cxpcrinicnts~ and thus prcparc you for your\nin-lab work. Prc-lab work sliould bc trcatcd likc a sniall liomcwork, and sliould bc writtcli up in\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nyour lab notcbook. Thc qucstions askcd in thc 6.002 prc-lab assig~nncnts arc indicativc of thc typc\nof qucstio~is you sliould ask wlicn examining a scicntific or cnginccring hypothcsis. Your analysis\nof thcsc qucstions should ~notivatc and guidc thc cxpcrinicnts you will pcrforni, and suggcst how\ntlic cxpcrimc~ital rcsults will co~ifirm or rcfutc thc liypotlicsis undcr examination.\nThc 6.002 prc-lab assiglimcnts will gcncrally a~ialyzc and prcdict thc pcrformancc of an clcc-\ntronic circuit, and rcsult in prcdictio~is for thc data you will rccord during your in-lab work. As you\nwork througli tlic assignments, you should think about how you could cxpcrilncntally dctcrlninc\nwhcthcr your analysis is corrcct. If you do not scc how thc in-lab work sccks to vcrify your prc-lab\nwork, thcn ncithcr cffort is of valuc cvcn if both arc corrcctly pcrfor~ncd. Finally, as you work on\ntlic prc-lab assignnicnts, you should takc thc time to ~icatly draw tlic circuits you will build during\nyour in-lab work, and to prcparc any graphs and tablcs ncccssary to organizc data rccording.\nIT!,-Lah W r ~ k\nThc notcs you takc during your in-lab work arc siniply a rccord of wliat you did and wliat you\nobscrvcd. A mi~iinial rccord includcs at lcast tlic following.\n(1) A labclcd circuit diagram in your lab notcbook adjaccnt to tlic rccordcd data. Thc diagram\nshould includc: voltagc and currcnt sourcc a~nplitudcs and frcqucncics: rcsistor, capacitor,\nand inductor valucs; scniiconductor and intcgratcd circuit namcs; oscilloscopc and niulti~nctcr\nco~i~icctions:\nyou think arc important to circuit opcratioli such as\nand any otlicr co~~ilncnts\nshielding, coniponcllt tcmpcraturc and so on. You should also notc or skctch your prcdictio~is\nbcforc you takc a mcasurcnicnt.\n(2) A rccord of your spccific proccdurcs and mcasurcmc~its. This should includc kcy oscilloscopc\nand ~nultilnctcr settings, sourcc adjustments niadc wliilc rccordi~ig data, small coniponcnt\ncha~igcs and so on. You should rccord raw data in your notcbook and intcrprct it latcr,\ncvcn if latcr nicans only a fcw ~ninutcs latcr bcforc you niovc on to tlic ncxt cxpcrinicnt.\nFor cxa~nplc, if you usc thc voltagc drop across a rcsistor to lncasurc a currcnt you should\nrccord tlic mcasurcd voltagcs in your lab notcbook and convcrt thcsc nicasurcnicnts to currcnt\nlatcr. If any data is u~icxpcctcdly largc or small? or noisy or noisc-frcc, for cxamplc, or sonic\nadjustnicnt is particularly largc or scnsitivcl you sliould notc this in your lab notcbook as part\nof thc data. Finally, i~icludcd in your notcbook should bc all coni~nc~its\nncccssary to rccrcatc\nyour cxpcri~ncntal proccdurc.\nWavcfornis skctchcd dircctly from tlic oscilloscopc warrant a fcw additional guidclincs. Ncvcr\nniakc a rough skctch that you will copy into your lab ~iotcbook latcr: cach tinic data is copicd\nfrom o~ic lncdiuni to anothcr, ncw crrors and intcrprctations crccp silcntly into thc data.\nRathcr, ~icatly skctcli tlic wavcform dircctly into your lab notcbook as accuratcly as possiblc.\nSucli skctchcs should bc at lcast as largc as thc oscilloscopc scrccn, and arc no st accuratc if\nyou lct thc rulcd syuarcs of your notcbook graph papcr corrcspo~id to thc rulcd graticulc on\ntlic oscilloscopc scrccn.\n(3) Coninicntary about i~iaccuracics in your data. Rccord and plot prcciscly what you scc as\naccuratcly as possiblc; do not rccord what you cxpcct to scc. Rclatcd to thc accuratc rccording\nof data is tlic issuc of precision. You 111ust indicatc in your data how prccisc your rcadings arc.\nSucli an i~idication can bc as simplc as an cstiniatc of tlic ~ioisc in thc mcasurcnicnt. Wlicn\nskctcliing oscilloscopc data bc surc to indicatc thc tracc width and any othcr rclcvant fcaturcs\nof tlic wavcfor~n.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPost-Lab Wirk\nPost-lab work conccrns your intcrprctation of your rcsults in tcrnis of thc analyscs and prcdictio~is\nof your prc-lab work. It is tlic tinic to discuss not only what thc data tclls you about tlic circuit\nopcratioli but also whcthcr tlic data answcrs your qucstions from tlic prc-lab, and supports or\nrcfutcs any hypothcscs you havc niadc. Important qucstions to ask and answcr in thc notcbook\nincludc at lcast thc following.\n(1) Did tlic data match thc prcdictions? Why or why not?\n(2) What docs thc data say about thc thcorics uscd to dcrivc tlic prcdictions? Undcr what condi-\ntions do thc tlicorics apply and why? Wcrc thosc conditions mct during thc in-lab work?\n(3) What factors could bc gcncrati~ig what appcar to bc bad data? How might thc prc-lab analyscs\nbc lnodificd to makc morc accuratc prcdictions in thc futurc? How could tlic cxpcrimcnts bc\nniodificd to obtain niorc accuratc data?\nThc post-lab work is also thc time to co~nbi~ic\ndata from diffcrcnt cxpcrinicllts in ordcr to rcacli\nniorc gc~icral conclusio~is.\nOscilloscope Readings\nMakc your ~ncasurcmc~its\nA widcncd tracc is niost oftcli causcd by\nat thc middlc of tlic tracc.\naddcd noisc. In this casc, tlic rcasonablc assu~nption tliat thc avcragc of thc noisc is zcro lcads to\ntlic co~iclusion tliat thc truc valuc of thc signal lics at tlic niiddlc of tlic tracc. This is particularly\nimportant wlicn measuring tlic pcak to pcak voltagc of a pcriodic signal. Evcn in thc prcscncc of a\nlittlc noisc, ~ncasuring from thc cxtrcnics of thc tracc can casily add 3% to 5% to tlic mcasurcmcnt,\ntlicrcby rcducing its prccision to lcss than two digits.\nThc oscilloscopc is an cxtrcmcly vcrsatilc ~ncasuring instrument and you should attcnipt to takc\nadw~itagc of its capabilitics. Adjust thc voltagc scalc so that thc wavcforni fills thc scopc scrccn\nand thc cffccts of tracc width arc minimized. In gcncral, do not hcsitatc to niovc thc tracc around\non thc scrccli or cxpand intcrcsting parts of thc wavcfor~n in ordcr to gct a morc accuratc vicw of\nits dctailcd bchavior.\nBreadboarding Practice\nFollowing thc brcadboardi~ig practicc outlincd bclow will gc~icrally hclp guarantcc that your circuit\nwill work as wcll as possiblc.\n(1) Lay thc circuit out as ~icatly as possiblc. Having thc co~nponc~it\nlocations correspond to tlic\ncircuit diagram will aid in locating tcst points. Such a lay out is also casicst to clicck for wiring\ncrrors.\n(2) Makc all wircs and lcads as short as possiblc. Long wircs and lcads incrcasc stray capacitance\nand inductance which can bc significant in high-frcqucncy circuits.\n(3) Takc carc whcn inscrting and removing intcgratcd circuits to and from thc brcadboard so as\nto avoid bc~iding thc pins. To rcniovc a DIP, inscrt a scrcwdrivcr or otlicr thin objcct undcr\ntlic packagc and pry up gcntly. It is bcst to pry a littlc on altcrnatc sidcs so tlic pins arc not\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nbait in any direction. Ncvcr pull out an intcgratcd circuit or othcr circuit clcnicnt with tlic\npowcr conncctcd.\n(4) If your circuit cxhihits significant noisc, sig~lifica~it\ndistortion, or poor high-frcqucncy or pcr-\nfol.mancc, try by-passing tlic powcr supplics by placing 0.1-pF capacitors across thc positivc\nsupplics. Also, placc siniilar capacitors across thc powcr supply tcrnii~ials of all i~itcgratcd\ncircuits.\nSafety\nSafcty is a vcry inlporta~it colnponcnt of good lab practicc. Accordingly, plcasc rcad and follow\ntlic attaclicd Elcctrical Safcty Noticc (H07) providcd by thc EECS Dcpartnicnt. As indicated, it\nis ncccssary to sign thc last pagc of thc noticc and rcturn it to tlic EECS Instrument Dcsk in tlic\nLab in ordcr for you to pick up your lab kit.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab0.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/8bb4e0f80644d9414bb7cd3b1364e8e3_lab0.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nLab #O\nHandout S07-010\nSpring 2007\nThe focus of your first tutorial, which wc rcfcr to as Lab #0, will bc the instru~ncntation in tlic\n6.002 Lab and its use: good lab practice, and lab safcty. Prior to attending that tutorial, you should\nread tlic Laboratory Equipnlcnt handout and tlic Lab Practicc and Safcty handout, bc prcparcd\nto use the Lab equipment to cxaniinc simple networks such as those discussed in class so farl and\nbc prcparcd to ask questions about the use of tlic cquipnlcnt and lab safcty. Plcasc pay special\nattention to the EECS Safcty Notice contained in the Laboratory Lab Practicc and Safcty handout.\nIt should bc signed and returned as indicated. It is inlportant for you to do so. If you do not: you\nwill not bc able to purchasc a lab kit and proceed further.\nTutorials will bc licld in the Lab, which is within Rooni 38-500. To get to tlic Lab, you should\ntake an elevator to tlic 5th floor of Building 38; note that the closest stairway to tlic Lab is an\ncnicrgcncy exit only. If you arc unsure as to your schcdulcd tutorial hour, or if you call not attend\nyour first tutorial, plcasc scc your TA innncdiatcly.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/56d60da013efade4a97056c23c4c9c5a_lab1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nLab 1: Thevenin/Norton Equivalents & Logic Gates\nHandout S07-017\nIntroduction\nThc first part of tlic lab cxplorcs thc charactcrization of a nctwork by its Tlicvcnin and Norton\ncquivalcnts. Tlic scco~id part cxplorcs tlic static bchavior of logic gatcs constructcd with 11-channcl\nMOSFETs and rcsistors. You should coniplctc tlic prc-lab cxcrciscs in your lab notcbook bcforc\nconling to lab. Tlicnl carry out thc in-lab cxcrciscs bctwccn Fcbruary 26 and March 2. Aftcr\nco~nplcting thc in-lab cxcrciscs, havc a TA or LA clicck your work and sign your lab notcbook.\nFinally, co~nplctc thc post-lab cxcrciscs in your lab notcbook, and turn in your lab notcbook\nduring recitation on Wcdncsday March 7.\nPre-Lab Exercises\nPrc-Lab Excrciscs 1-1 and 1-2 cxplorc tlic cliaractcrization of a nctwork by its Thcvc~iin and Norton\ncquivalcnts. Prc-Lab Excrciscs 1-3 through 1-5 cxplorc thc static bcliavior of logic gatcs.\n(1-1) Dctcrnli~ic tlic Thcvcnin and Nortoll cquivalcnts of thc ~ictwork shown in Figurc 1as vicwcd\nat its port.\nFigure 1: Sourcc-rcsistor nctwork for Prc-Lab Excrciscs 1-1 and 1-2\n(1-2) Evaluatc thc Thcvcnin and Norton cquiwlc~its of thc nctwork for tlic following wlucs:\nV = 5 V ;RI = 50 S l ; R2= 2.2 k0; R3 = 1.5 k0.\n(1-3) Figurc 2 shows a NOT gatc, a NOR gatc, and a NAND gatc constructcd from n-channcl\nMOSFETs and 1 k 0 rcsistors. Thc figurc also shows a switch-rcsistor lnodcl for thc n-\ncha~i~icl\nfor all thrcc gatcs. In\nMOSFET. Using tlic switch-rcsistor niodcl, colnputc v o u ~\ndoing so. considcr all combinations of input voltagcs: an input voltagc may bc cithcr abovc or\nbclow tlic MOSFET thrcsliold voltagc VT. In cach casc, cvaluatc VOLIT assulning R o s - 0 ~=\n4 0. Suninlarizc your rcsults for cacli gatc in a tablc.\n(1-4) Figurc 3 shows a conibinational logic circuit.\nthc input-output truth tablc for\nDctcr~ni~ic\nthis circuit.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(1-5) Draw thc circuit diagrani for thc colnbiliational logic circuit shown in Figurc 3 using tlic\ngatcs shown in Figurc 2.\nI\nNOT\nI\nNOR\nI\n15V\nGate\nI\n1k\nI\nMOSFET Model\nI\nNAND\nGate\nD 1\nOpen:\nV\nG\n~< VT\nClosed:\nv ~ s> VT\nG\nRDS-ON\nS\nFigurc 2: A NOT gatc, a NOR. gatc, a NAND gatc, and thc switch-rcsistor MOSFET lnodcl\nFigurc 3: Conibinational logic circuit for Prc-Lab Excrciscs 1-4 alid 1-5\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nIn-Lab Exercises\nIn-Lab Excrciscs 1-1through 1-3 cxplorc tlic characterization of a nctwork by its Tlicvcnin and\nNorton cquivalcnts. In-Lab cxcrciscs 1-4 through 1-9 cxplorc tlic static bchavior of logic gatcs.\n(1-1) Construct thc nctwork shown in Figurc 4. Howcvcr, bcforc co~nlccting tlic signal gc~icrator\nto thc rc~naiiidcr of thc nctwork, sct its output voltagc to a constant 5 V? and chcck this\noutput with thc multi-nictcr. Thc ~ictwork is tlic samc as thc onc shown in Figurc 1:\nwith thc function gcncrator scrving as both tlic voltagc sourcc and rcsistor R1. Note: The\nfunction generator has two modes to compensate for the load impedance- 50 i2 and High Z.\nMake sure that your function generator is set to the High Z mode. Press [Shift] and then\n[Enter] to get to the menus. Using the dial, switch to menu D, the SYS MENU. Next press\nthe down arrow twice. Use the dial to switch to HIGH 2. Then press [Enter] to save.\nI u\nL - - - - - - A\nSignal Generator\nFigurc 4: Expcri~nc~ital\nsourcc-rcsistor nctwork.\n(1-2) Mcasurc thc opcml-circuit voltagc and short-circuit currcnt of tlic nctwork with thc multi-\nnictcr. Notc that thc multi-mctcr is itsclf a ncar opcn circuit wlicn uscd as a voltnictcr,\nand a ncas short circuit wlicn uscd as an amnictcr. Tlicrcforc, thc dircct connection of\nthc multi-nictcr across thc port implcnicnts thc propcr mcasurcmcnt in both cascs. Your\nrcsults fro111 Prc-Lab Excrcisc 1-2 should show that both nicasurcnicmlts arc within thc safc\nrangc for tlic niulti-mctcr.\n(1-3) Conncct a rcsistor across thc ~ictwork port and nicasurc thc port voltagc v with tlic multi-\nnictcr. Do so for resistors liming rcsistanccs of 560 i2. 1k 0 and 2.2 k0.\n(1-4) Construct thc circuit sliown in Figurc 5 , wliicli is dcsigncd to nicasurc tlic thrcsliold voltagc\nof thc MOSFET: tlic MOSFET pin assig~nncnts arc givcli in thc attachcd data shcct. Tlic\nMOSFET should say 2N7000 on it. Makc surc that you don't accidc~itally rcvcrsc tlic\npolarity of thc MOSFET. Tlic sourcc sliould bc conncctcd to ground, and thc drain to tlic\n1k 0 rcsistor. (As cvidcnt from thc MOSFET schcniatic in thc datashcct. notc tliat tlic\ndrain and sourc tcrmi~ials of discrctc MOSFETs arc not symnictric). Usc tlic niulti-mctcr\nto mcasurc vcs and thc oscilloscopc to mcasurc v ~ s ,and sct thc signal gcncrator to providc\na constant output. With vcs at 0 V , v ~ ssliould bc at 5 V. Gradually incrcasc vcs until\nv ~ sstarts to fall. Thc valuc of vcs at which this occurs is VT.\n(1-5) Bcgi~i~iing\nwith tlic circuit sliown in Figurc 5 , rcniovc thc 1ki2 rcsistor and tlic oscilloscopc\nfrom thc MOSFET drain. With vcs at 5 V , nicasurc RDswith thc multi-mnctcr. This\nrcsistamlcc is R o s - ~ ~\nfor vcs = 5 V ;notc tliat tlic multi-nictcr supplics a vcry small voltagc\nwhcn uscd as an ohmnictcr.\n(1-6) Construct tlic NOT gatc from Figurc 2 and conncct its input to a switch and 10ki2 rcsistor\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nSignal Generator\np\np\np\np\np\n\n$ l k Q\n\"$$$$A\nI\nI\nb\n~\n50Q\nD\nI\nG\nTo Oscilloscope\nI\nS\nI\nb\nL p p p p p A\nI\nFigurc 5: Circuit to mcasurc VT.\nas sliown in Figurc 6. For both switch positions, tliat is for both logic input lcvcls to tlic\ngatc, nicasurc v o l r ~with thc multi-nictcr.\nA switch pack and a 10 k 0 rcsistor array (10k SIP pn.Al03J) liavc bccn clioscn to simplify\nthc wiring of the switchcs to tlicir associatcd rcsistors. Spccifically, tlic switch pack can bc\nplaced in the protoboard so that olic sidc is on a conimon ground strip and cach pin on tlic\nothcr sidc is on a scparatc tracc. Thcn, thc rcsistor array call bc inscrtcd into tlic protoboard\nalolig sidc the switch pack so tliat scparatc rcsistors coli~icct to cacli switch. Finally, tlic\ncommon pin of thc rcsistor pack, dcsignatcd by tlic whitc circlc, can bc co~i~icctcd\nto tlic 5\nV powcr supply through a singlc wirc. A diagram of this setup is sccn in Figurc 7.\n(1-7) Construct thc NOR gatc from Figurc 2. As for tlic NOT gatc shown in Figurc 6. conncct\nthc inputs to tlic NOR gatc to switchcs and 10 k 0 rcsistors. For all conibinatiolis of switch\npositions. that is for all combinations of logic input lcvcls to tlic gatc, mcasurc\nwith\nthc multi-mctcr. Save the NOR gate for In-Lab Exercise 1-9.\n(1-8) Rcpcat In-Lab Excrcisc 1-7 for tlic NAND gatc. Save the NAND gate for In-Lab Exercise\n1-9.\n(1-9) Use thc NOR gatc and NAND gatc to i~nplcmcnt thc co~nbinational logic circuit of Figurc\n3, as outlincd ill Prc-Lab Excrcisc 1-5. Colimlcct cacli input to a switch slid rcsistor as in\nIn-Lab Excrciscs 1-6 tlirougli 1-8. By clianging its input switch scttings, and nicasuri~ig its\noutput voltagc with tlic multi-nictcr, dcmonstratc that tlic logic circuit fu~ictio~is\npropcrly.\n10ka 1kQ\nFigurc 6: Expcrinicntal NOT gatc.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGate Nodes\niyJyJSWtCh\nFigure 7: Switch pack and rcsistor array sctup\nPost-Lab Exercises\nPost-Lab Excrciscs 1-1 through 1-3 cxplorc tlic cliaractcrization of a nctwork by its Tlicvcnin and\nNorton cquivalcnts. Post-Lab Excrciscs 1-4 and 1-5 cxplorc thc static bchavior of MOSFETS and\nlogic gatcs.\n(1-1) Rcfcr to your nicasurcnicnts from In-Lab Excrcisc 1-2; notc that thcsc nicasurcnicnts arc tlic\nThcvcnin cquivalcnt voltagc and Norton cquiwlc~it currcnt of tlic nctwork in Figurc 4. Froni\nthcsc mcasurcmcnts, co~nputc tlic Tlicvcnin/Norton cquivalcnt rcsistancc of thc nctwork.\nCouiparc tlic cxpcrimcntal Thcvcnin/Norton paranictcrs to thcir corrcsponding wlucs from\nPrc-Lab Excrcisc 1-2, and cxplain any discrcpancics. Hint: considcr mcasurcmc~it crror and\nrcsistancc variation.\n(1-2) Rcfcr to your lncasurcmcnts fro111 In-Lab Excrcisc 1-3. For cach conibination of rcsistor and\nvoltagc mcasurcmcnt, calculatc tlic corrcsponding port currc~it i .\n(1-3) Using tlic opcn-circuit voltagc and short-circuit currc~it mcasurcd during In-Lab Excrcisc\n1-2, graph thc i-v rclation for thc nctwork. On this graph also plot thc i-v data obtaincd\nby combining tlic voltagcs mcasurcd during 111-Lab Excrcisc 1-3 and tlic currcnts calculatcd\nduring Post-Lab Excrcisc 1-2. Explain any discrcpancics bctwccn tlic mcasurcd i-v data\nand tlic i-v rclation obtai~icd from thc Thcvcnin/Norton paranictcrs.\n(1-4) Consult thc MOSFET data shcct and dctcrniinc R D ~ - ~ N\nand VT,rcspcctivcly. Comparc\nthcsc to tlic valucs you mcasurcd during In-Lab Excrciscs 1-5 and 1-4, rcspcctivcly.\n(1-5) Using tlic valuc of R~s-oynicasurcd during In-Lab Excrcisc 1-5, rc-calculate thc output\nvoltagcs calculatcd in Prc-Lab Excrcisc 1-3. Explain any discrcpancics bctwccn thc rc-\ncalculatcd output voltagcs and thosc nicasurcd during In-Lab Excrciscs 1-6 through 1-8.\n(1-6) Using tlic nicasurcd valucs of RDS-ONand VTfor thc invcrtcr that you built. spccify valucs\nfor V O ~ .\nKL, V o ~ .and KH that acliicvc thc bcst symmetric noisc margins. (Scc Scction\n5.1. pagc 245 and Scctioli 6.8, pagc 306. of thc coursc tcxt).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/56c767318f89cccd7448ac5e8af375bf_lab2.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nLab 2: MOSFET Inverting Amplifiers & First-Order Circuits\nHandout S07-034\nIntroduction\nThis lab examines the behavior of an inverting MOSFET amplifier. It begins by examining the\nstatic input-output relation of the amplifier, and concludes by examining the dynamic behavior of\nthe same amplifier when used as a digital logic inverter. You should complete the pre-lab exercises\nin your lab notebook before coming to lab. Then, carry out the in-lab exercises between April 2 and\nApril 6. After completing the in-lab exercises, have a TA or LA check your work and sign your lab\nnotebook. Before asking to get checked off, make sure you meet all the requirements in\nthe checkoff list at the end of the In-Lab Exercises. Finally, complete the post-lab exercises\nin your lab notebook, and turn in your lab notebook on or before Wednesday, April 11.\nBring in your favorite CD for In-Lab Exercise 2-3; it is meant to be a fun experiment and its\nresults will not be needed for the post lab exercises. If you have a portable CD player or laptop,\nplease bring that for use in In-Lab Exercise 2-3, as the stockroom has only a limited number of CD\nplayers and speakers available.\nPre-Lab Exercises\n(2-1)\nConsider the inverting MOSFET amplifier shown in Figure 1. Using the SCS MOSFET\nmodel, write an expression for vOUT as a function of vIN for 0 ≤ vIN ≤ vOUT + VTM. Note\nthat VTM is the threshold voltage of the MOSFET. Also, sketch and clearly label the form\nof vOUT as a function of vIN over the same range.\n+\n-\nR\nVS\n+\n-\nvOUT\nvIN\nM\nFigure 1: Inverting MOSFET amplifier for Pre-Lab Exercises 2-1 and 2-2.\n(2-2)\nWrite an expression for the small-signal gain of the MOSFET amplifier shown in Figure 1\nassuming that the MOSFET is biased into saturated operation.\n(2-3)\nConsider the network shown in Figure 2. First, assume that vOUT = 0 at time t = 0. Then,\nwrite an expression for vOUT(t) for t ≥ 0 given that vIN steps from 0 V to VI at t = 0.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n+\n-\n+\n-\nvOUT\nC\nR2\nR1\nvIN\nFigure 2: Network for Pre-Lab Exercises 2-3 and 2-4.\n(2-4)\nFor the transient determined in Pre-Lab Exercise 2-3, determine the time at which vOUT\nreaches a given VT where 0 < VT < R1\nR\n+\nR2 VI.\n(2-5)\n(OPTIONAL) Design Competition: Design an inverter with the minimum power-delay\nproduct that meets the following static discipline: VOH = 4.8V , VOL = 0.1V , VIH = 2.5V ,\nVIL = 0.3V . Power-delay product is the product of the static power dissipated when the\nMOSFET is on, and the time the output voltage takes to rise from your inverter's low output\nto VOH . Also, assume that your inverter is driving a load capacitance of CL = 97pF, that\nVT = 1.8V , and RDS-ON = 2Ω.\nIn order to be considered for the competition, you must turn in the following with your\npost-lab:\n1. A circuit diagram of your inverter, with values for RL and VS clearly specified.\n2. A description (accompanied by the appropriate equations) showing how your values mini\nmize the power-delay product, and how you reached those values.\n3. Predicted values for the power-delay product using your values for VS and RL, and using\nVS = 5V and your value of RL.\n4. A comparison between your predicted value from 3 and your measured value from In-Lab\nExercise 2-4. If there are large discrepancies, try recalculating your power-delay product\nbased on the value for CL you calculated in Post-Lab Exercise 3.\nMake sure to read the description for In-Lab Exercise 2-4. Those doing the competition\nwill need to do this exercise slightly differently.\nFinally, make sure to keep your design competition write-up separate from your post-lab\n(i.e. the write-up should not be written in your lab notebook). Hand in your competition\nwrite-up to your recitation TA on or before Wednesday, April 11. First prize is dinner in a\nfancy restaurant with the 6.002 staff.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nIn-Lab Exercises\nAs part of the in-lab exercises, you will measure the threshold voltage and gate-to-source capacitance\nof a MOSFET. Because these parameters will not be identical for different 2N7000 MOSFETs,\ntry to use the same MOSFET for the MOSFET labeled as M in every in-lab exercise\ndescribed below. Remember that the MOSFET should say 2N7000 on it.\n(2-1)\n(a) This exercise measures the static input-output relation of the MOSFET amplifier shown in\nFigure 1. To begin, construct the amplifier as shown in Figure 3, and connect the signal\ngenerator and oscilloscope as shown. Next, set the signal generator to produce a 1-kHz sine\nwave with a peak-to-peak amplitude of 3 V and an offset of 1.5 V. Thus, the signal generator\nwill produce a biased sine wave between 0 V and 3 V. Set the oscilloscope to operate in its\nX-Y mode with an X-axis (Channel #1) sensitivity of 500 mV per division and a Y-axis\n(Channel #2) sensitivity of 1 V per division. To set the oscilloscope in X-Y mode, turn\nthe SEC/DIV knob all the way to the left. You should now see the input-output relation\nand on the oscilloscope. Make a sketch in your notebook of this input-output relation and\nnote any difference between this relation and the input-output relation you calculated for\nPre-Lab Exercise 2-1.\nOscilloscope\n+\n-\n5V\nSignal\nGenerator\nChannel #1\nOscilloscope\nChannel #2\n1kΩ\nM\nFigure 3: Measuring the static input-output relation of the MOSFET amplifier shown in Figure 1.\nYou may find it easier and much more accurate to use the signal generator as\na programmable vIN source and measure vOUT with a multimeter for parts (b)\nand (c).\n(b) Record the value of vIN above which vOUT just begins to fall. This is the threshold voltage\nVTM of the MOSFET (see the sketch from Pre-Lab Exercise 2-1).\n(c) Record the values of vIN which correspond to vOUT values of 5 V, 4 V, 3 V, 2 V and 1 V.\n(2-2)\nThis exercise measures the small-signal gain of the amplifier shown in Figure 1 when its\noutput operating-point voltage is 2 V. Construct Circuit #1 shown in Figure 4. Adjust\nthe potentiometer until vOUT = 2 V as measured by the multimeter. Connect the signal\ngenerator and the oscilloscope as shown in Circuit #2. Set the signal generator to zero\nand re-adjust the potentiometer so that vOUT = 2 V. Then, set the signal generator to\nproduce an unbiased 1-kHz sine wave with a peak-to-peak amplitude of 100 mV. Measure\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nthe amplitude of both vin and vout, which are the sinusoidal components of vIN and vOUT,\nrespectively (use AC coupling in Channel #1 of the oscilloscope to accurately measure vin).\nThe ratio of the amplitudes is the small-signal gain. Retain this circuit for the next exercise.\n+\n-\n5V\nSignal\nGenerator\nOscilloscope\nChannel #1\nOscilloscope\nChannel #2\n1kΩ\n+\n-\nvIN\n10kΩ\n+\n-\nvOUT\n5V\n+\n-\nvOUT\n1kΩ\n10kΩ\nCircuit #1\nCircuit #2\nM\nM\nFigure 4: Measuring the small-signal gain of the MOSFET amplifier.\n(2-3)\nThe experiments in this exercise will use Circuit #2 constructed in In-Lab Exercise 2-2 to\nexplore the limits of saturation operation of the amplifier by observing clipping of an output\nwaveform and by listening to distortion in music output.\n(a) Start by adjusting the input bias with the potentiometer, and observing the variation in\nvOUT. Now, increase the peak-to-peak amplitude of the sine wave input from the signal\ngenerator to 300 mV. Observing the output on Channel #2 of the oscilloscope, increase\nthe input bias voltage until you see clipping on the bottom part of the output. Use DC\ncoupling in Channel #1 of the oscilloscope and make a note of the upper excursion limit\nof the voltage vIN (the maximum input voltage before clipping occurs). Similarly, decrease\nthe input bias voltage until you see clipping on the top part of the output, and make a\nnote of the lower excursion limit of the voltage vIN. These upper and lower limits of vIN\napproximate the input operating limits of the amplifier for linear operation.\n(b) Replace the signal generator with the CD player (use the headphones output). Set the CD\nplayer volume such that the peak-to-peak amplitude of the music signal, vin, is approxi\nmately 300mV, when viewed on Channel#1. Connect the vOUT signal to an amplifying\nspeaker (leave the oscilloscope connection in place) and adjust the speaker volume to listen\nto the music. Vary the input bias voltage with the potentiometer and listen to the change\nin volume. Observing vIN on Channel #1 of the oscilloscope (using DC coupling), increase\nthe input bias voltage until you begin to hear distortion. Is the upper excursion limit of\nthe voltage vIN at the onset of distortion approximately the same as that measured with\nthe sine wave input?\n(c) Now, decrease the input bias voltage till you begin to hear distortion. Is the lower excursion\nlimit of the voltage vIN at the onset of distortion approximately the same as that measured\nwith the sine wave input?\n(2-4)\nThe next two exercises will analyze the delay of the MOSFET amplifier when it is used as\na digital logic inverter. Specifically, we will measure the delay of an inverter that is driving\nanother inverter as illustrated in Figure 6.\nSince the delay of an inverter is related to the capacitance of the node that is driven by\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nits output, this exercise measures the capacitance seen by the output of an inverter that is\ndriving the gate of a MOSFET.\nConstruct the circuit shown in Figure 5. You will measure the capacitance CP seen at node\nP in the circuit. CP is the capacitance at node P, and includes CGS , the gate capacitance\nof MOSFET M, in parallel with the oscilloscope input capacitance and a parasitic wiring\ncapacitance. Set the signal generator to produce a 8-kHz square wave with an amplitude of\n5 V peak-to-peak and an offset of 2.5 V. Channel #2 of the oscilloscope should display both\na first-order rising step response and a first-order falling step response. Measure the time\nconstant of the rising step response. Since the on resistance of the MOSFET is very small,\nthe falling response has a very small time constant that is difficult to measure. Therefore,\nwe will focus on the rising step response. To measure the time constant of the rising step\nresponse, note that the initial slope of the response is as follows:\nInitial slope of response = (Final voltage on capacitor-Initial voltage on capacitor)/τ ≈ τ\nFrom your oscilloscope screen, make an estimate of the initial slope, and use that to calculate\nthe τ of the circuit.\nFor those doing the optional design competition from Pre-Lab Excercise 2-5,\ninstead of using RL = 100kΩ, use the value of RL you designed. Also, measure\nthe voltage across RL when VIN = 5V DC to allow you to calculate the static\npower dissipated. Please note in your lab notebook if you are taking part in\nthe competition.\n+\n-\nP\nM\nCP\n5V\nOscilloscope\nOscilloscope\nChannel #1\nChannel #2\n100kΩ\nSignal\nGenerator\nFigure 5: Measuring the gate-to-source capacitance of the MOSFET amplifier.\n(2-5)\nThis exercise measures the delay of the MOSFET amplifier when it is used as a digital logic\ninverter. Construct the circuit shown in Figure 6; As in the previous exercise, set the signal\ngenerator to produce a 8-kHz square wave with an amplitude of 5 V peak-to-peak and a DC\noffset of 2.5 V. Use the oscilloscope to measure the delay from the time at which the signal\ngenerator switches low (Channel #1) to the time at which the inverter pair output (Channel\n#2) begins to switch low. (Note that a high to low transition at the signal generator input\ncorresponds to a low to high transition at node P).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nOscilloscope\n5V\n5V\nChannel #1\n100kΩ\n1kΩ\nSignal\nOscilloscope\nGenerator\nChannel #2\nM\n+\n-\nP\nFigure 6: Measuring the delay of the MOSFET amplifier when it is used as a digital logic gate.\nCheckoff List - Make sure you have the following items\n(2-1)\nCompleted Pre-Lab Exercises in your lab notebook.\n(2-2)\nCompleted In-Lab measurements in your lab notebook. Make sure you've read each of\nthe In-Lab Exercises carefully to note what measurements must be taken.\n(2-3)\nWorking circuit from In-Lab Exercise 2-5.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPost-Lab Exercises\n(2-1)\n(a) This exercise examines how well the MOSFET amplifier model developed during Pre-Lab\nExercise 2-1 explains the input-output relation measured during In-Lab Exercise 2-1.\nThe model from Pre-Lab Exercise 2-1 contains four parameters which are required to nu\nmerically evaluate the input-output relation: VS, R, VTM and K. From Figure 3, VS = 5 V\nand R = 1 kΩ. Further, VTM was measured during In-Lab Exercise 2-1. Thus, only K is\nunknown. Use the value of vIN recorded for vOUT = 1 V to determine K.\n(b) Use the numerical parameters and the model to graph vOUT as a function of vIN for 1 V\n≤ vOUT ≤ 5 V. Note: You are encouraged, although not required, to use Matlab to plot the\ngraph. See the Matlab handout at the end of the lab packet. On this graph, also plot the\ndata measured during In-Lab Exercise 2-1. How well does the model explain the data?\n(2-2)\n(a) From the data recorded during In-Lab Exercise 2-2, compute the small-signal gain of the\namplifier for vOUT = 2 V.\n(b) From the data recorded during In-Lab Exercise 2-1, again compute the small-signal gain by\nestimating the slope of the input-output relation at vOUT = 2 V.\n(c) Compute the small-signal gain from the analysis of Pre-Lab Exercise 2-2 using the param\neters determined during Post-Lab Exercise 2-1. Do the three gains match well?\n(2-3)\nFigure 2 models the behavior of node P in Figure 5 when the MOSFET of the first inverter\nstage is off: R1 is the 100 kΩ resistor; R2 models the oscilloscope input resistance; and\nC models CP . Recall that CP is the capacitance of node P, and includes CGS , the gate\ncapacitance of MOSFET M, in parallel with the oscilloscope input capacitance and a para\nsitic wiring capacitance. Assume that the oscilloscope input resistance and capacitance are\n10 MΩ and 15 pF, respectively. Combine the analysis of Pre-Lab Exercise 2-3 and the time\nconstant measured during In-Lab Exercise 2-4 to determine CP .\n(2-4)\nWith VI = 5 V and VT = vT, the analysis of Pre-Lab Exercise 2-4 models the delay measured\nduring In-Lab Exercise 2-5. Using the parameters computed during Post-Lab Exercise 2-3,\npredict the delay and compare the prediction to the measurement. Note that the oscilloscope\nwith its input resistance and capacitance were not connected to the MOSFET gate at node\nP when the delay was measured (see Figure 6).\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nM\n\nUsing MATLAB for Lab 2\nYou are encouraged, although not required, to use Matlab to plot the graph in Post-Lab Ex\nercise 2-1. Note: This document is provided specifically for this exercise. There are a number of\nresources for general help with Matlab on Athena , MIT's server. To use Matlab, you must first type\n\"add matlab\" at the Athena prompt, and then invoke Matlab by typing the command \"matlab\"\nat the Athena prompt.\nStart by entering the the values for VS, R, VTM and K.\nVS = 5;\nR = 1000;\nVTM = whatever value you measured during In-Lab Exercise 2-1;\nK = whatever value you computed for K;\nYour ultimate goal is to generate a plot of vOUT as a function of vIN for 1 V ≤ vOUT ≤ 5 V.\nIn In-Lab exercise 2-1, you measured vIN for vOUT = 1V. You will now use this value of vIN to\ngenerate a vector vIN of evenly spaced values between VTM and the value of vIN for which vOUT =\n1V.\nvIN = linspace(VTM,value measured for vIN when vOUT = 1V,50);\nType \"help linspace\" at the matlab prompt for details on the linspace command. Next you\nwant to generate a vector vOUT of output voltages corresponding the the input voltages in vIN. To\ndo this, you will use the expression for vOUT as a function of vIN that you came up with in Pre-Lab\nexercise (2-1).\nvOUT = VS - 0.5 * R * K * (vIN - VTM).^2;\nNow you should have two vectors, vIN and vOUT, that you can use to plot the input-output\ncharacteristics of your MOSFET in saturation. Now use the \"plot\" command to generate a plot.\nplot(vIN,vOUT);\nYou should note that vOUT = 5V for vIN ≤ VTM. To include this in the plot, you need one more\ndata point.\nplot([0 vIN],[5 vOUT]);\nThe above command will append the data point (0,5) to the plot.\nNow you are done. You may want to use other commands to better format your graph. Try\nthe commands \"title\", \"xlabel\", \"ylabel\", \"axis\", and \"grid\". For help with any matlab command,\ntype \"help [command]\" at the Matlab prompt.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/d96ecf98f18cefe60249e8aec9a387ec_lab3.pdf",
      "content": "+\n-\nvIN(t)\nC\nL\nR\nvOUT(t)\n+\n-\nRIN\n50Ω\n=\nSignal Generator\nMassachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nLab 3: Second-Order Networks\nHandout S07-49\nSpring 2007\nIntroduction\nThe purpose of this lab is to give you experience with second-order networks, and to illustrate that\nreal network elements do not always behave in an ideal manner. All exercises in this lab focus on\nthe behavior of the network and network elements shown in Figure 1. You should complete the\npre-lab exercises in your lab notebook before coming to lab. Then, carry out the in-lab exercises\nbetween April 23 and April 27. After completing the in-lab exercises, have a TA or LA check your\nwork and sign your lab notebook. Finally, complete the post-lab exercises in your lab notebook,\nand turn in your lab notebook on or before May 2.\nBefore asking to get checked off, make sure you meet all the requirements in the\ncheckoff list at the end of the In-Lab Exercises\nBring in your favorite CD for In-Lab Exercise 3-5; it is meant to be a fun experiment and its\nresults will not be needed for the post lab exercises.\nPre-Lab Exercises\nYou are strongly encouraged to use Matlab to generate the graphs for Exercises 3-2 and 3-5. Matlab\nwill not only save you time, but will also help you generate graphs that are extremely accurate and\nprecise. See the appendix for help with Matlab. There are also two Matlab scripts which you can\ndownload from the class website. By filling in a few relations and changing resistor values these\nscripts will produce the graphs in the pre-lab excercises.\n(3-1) Assume that the network in Figure 1 is initially at rest. At t = 0, the input voltage vIN(t)\nsteps from 0 V to VTI. Given this input, determine the transient response of vOUT(t). Note\nFigure 1: Second-order network.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nthat vOUT(t) takes the form vOUT(t) = VTOe-αTt sin(ωTt + φT). Hint: You are free to use\nthe results from Homework Problem 9-3 for this exercise.\n(3-2) Let L = 47 mH, C = 0.0047 μF, R = 220 Ω and VTI = 10 V. Under these conditions,\ngraph the transient response of vOUT(t) for 0 ≤ t ≤ 0.3 ms; graphing the peaks and zero\ncrossings of the response and a few points in between each peak and zero crossing should be\nsufficient. On a separate graph, repeat this exercise for R = 1000 Ω. Hint: See the Matlab\nappendix and download the transient.m matlab script from web.mit.edu/6.002.\n(3-3) For both values of R, compute the voltage VTP (the first peak voltage of the transient\nresponse), the frequency ωT at which the transient response oscillates, and the rate αT at\nwhich the transient response decays. Note that peaks of the transient response occur at\ntimes such that tan(ωTt + φT) = ωT/αT; you should verify this.\n(3-4) Assume that the network is in sinusoidal steady state. Determine the response of vOUT(t)\nto the input vIN(t) = VSI cos(ωSt). Note that vOUT(t) will take the form vOUT(t) =\nVSO(ωS) cos(ωSt + φS(ωS)).\n(3-5) Let L = 47 mH, C = 0.0047 μF and R = 220 Ω. On separate graphs, graph log HS(ωS)\n|\n|\nand φS(ωS) versus log(ωS/(2π × 10 kHz)) for 2π × 1 kHz ≤ ωS ≤ 2π × 100 kHz where\nHS(ωS) ≡ VSO(ωS)/VSI. Ten to fifteen points per graph should be sufficient to clearly\noutline HS if you space the points more closely near the peak of HS. Again on a separate\ngraph, repeat this exercise for R = 1000 Ω. You may find it easiest to use log-log graph\npaper for the graph of HS and linear-log graph paper for the graph of φS. Hint: See the\nMatlab appendix and download the forcedosc.m matlab script from web.mit.edu/6.002 .\n(3-6) For both values of R compute the peak value HSP of HS, the frequency ωSP at which the\npeak occurs, and Q. Note that Q is defined as Q ≡ ωSP/2αT, and that HS(ωS) will have\nfallen from its peak value of HSP by a factor of\n√\n2 at ωS ≈ ωSP ± αT.\nIn-lab Exercises\nThe in-lab exercises involve measuring both the step response and sinusoidal response of the network\nshown in Figure 1 for two values of R. Afterwards, you will use the same network to filter a signal\nfrom a CD player.\nReal network elements do not always behave the way we model them in 6.002. For example, a\nreal inductor might be better modelled as an ideal inductor in series with a resistor, RP , as shown\nin Figure 2. The resistor is a parasitic element, meaning that it is undesired, but unavoidable.\nThe resistor accounts for the resistance of the wire used to wind the inductor. Yet more complex\nmodels could account for core losses and the capacitance between winding turns. For this reason,\nthe model shown in Figure 2 is not the only possible model. In a similar way, a real capacitor\nmight be better modelled as an ideal capacitor in parallel with a parasitic conductance, GP , which\nmodels leakage through the dielectric of the capacitor. This is also shown in Figure 2.\nIn the exercises which follow, the network in Figure 1 will be exposed to inputs that vary at\nhigh enough frequencies that you can ignore the parasitic parallel conductance of the capacitor.\nTherefore, we need only be concerned with the parasitic series resistance of the inductor.\n(3-1) Take a 47 mH inductor, a 0.0047 μF capacitor, a 220 Ω resistor, and a 1000 Ω resistor\nfrom your lab kit to the instrument desk and use the GenRad impedance meter to measure\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nL\nRP\nC\nGP\nInductor Model\nCapacitor Model\nthese elements and determine the parasitic resistance and conductance of the inductor and\ncapacitor, respectively.\nTo measure the inductor, set the meter for 1 kHz, the series model, and the appropriate\nelement type and value range. The meter will directly read the inductor value. It will also\nread Q from which you can determine RP from Q = ωL/RP, where ω = 2π× 1 kHz.\nTo measure the capacitor, set the meter for 1 kHz, the parallel model, and the appropriate\nelement type and value range. The meter will now directly read the capacitor value. It will\nalso read D from which you can determine GP from D = GP/ωC, where ω = 2π× 1 kHz.\n(3-2) Construct the second-order network shown in Figure 1 using the measured inductor, capac\nitor and 220 Ω resistor.\n(3-3) Set the signal generator to produce a 10 V peak-to-peak square wave at 50 Hz with a 5 V\noffset so that its open-circuit output voltage steps between 0 V and 10 V. Also, obtain a\nBNC to BNC cable from the stockroom and connect one end to the SYNC output of the\nfunction generator. A BNC connector is shown in Figure 3. Connect the other end to one of\nthe oscilloscope channels and trigger the oscilloscope off that channel. Note that the SYNC\noutput is a square wave with the same frequency and zero crossings as the output of the\nfunction generator. With the oscilloscope, measure the transient response of the resistor\nvoltage vOUT(t) to the positive going step, and compare the response to that plotted during\nthe pre-lab exercises. Measuring data at times which correspond to the points graphed\nduring Pre-Lab Exercise 3-2 is sufficient.\nAlso measure the voltage VTP, the oscillation frequency ωT, the rate of decay αT. To\nmeasure αT it is easiest to measure the time τT over which the transient response decays\nby 1/e and then compute αT = 1/τT.\nReplace the 220 Ω resistor with the measured 1000 Ω resistor and repeat the exercise.\nReplace the 1000 Ω with the measured 220 Ω resistor for the next exercise.\n(3-4) Set the signal generator to produce an open-circuit 10 V peak-to-peak sinusoidal voltage\nwith zero offset; the open-circuit voltage is vIN(t). As before, use a BNC to BNC connector\nto connect the SYNC output of the generator to one oscilloscope channel, and trigger the\noscilloscope off that channel. Use the other oscilloscope channel to measure the resistor\nvoltage vOUT(t) over the frequency range of 1 kHz to 100 kHz. In particular, measure\nthe peak-to-peak amplitude of vOUT, and the difference in time between neighboring zero\ncrossings of the SYNC output and vOUT; note that the SYNC output has the same zero\ncrossings as vIN. When measuring the time between zero crossings, measure the time\nfrom the positive-going zero crossing of vOUT to the positive-going zero crossing of the\nFigure 2: Improved models for a real inductor and a real capacitor.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFigure 3: A BNC connector looks like this.\nSYNC output. From this data you will determine Hs and φS during the post-lab exercises.\nMeasuring data at frequencies which correspond to the points graphed during Pre-Lab\nExercise 3-5 is sufficient. Also measure the peak voltage ratio HSP of HS, the frequency\nωSP at which the peak occurs, and Q. Q is most easily measured by first measuring the\ndifference between the two frequencies at which the ratio HS falls from its peak value of HSP\nby a factor of\n√\n2; this frequency difference should be 2αT; Q is then given by Q = ωSP/2αT.\nIt is important to note that φS(ωS) is the phase shift of vOUT relative to vIN. The most\nconvenient manner in which to measure φS is to measure the time delay from zero crossings\nof vIN to zero crossings of vOUT. This time delay may then be converted to a phase shift.\nUnfortunately, vIN is internal to the signal generator, and hence not measurable. However,\nthe SYNC output of the generator and vIN have the same zero crossings, which is why the\nSYNC output is used in this exercise as a reference for measuring phase shift.\nReplace the 220 Ω resistor with the measured 1000 Ω resistor and repeat the exercise.\nReplace the 1000 Ω with the measured 220 Ω resistor for the next exercise.\n(3-5) In this exercise you will use the network from Figure 1 to filter a music signal.\nObtain a CD player, a powered speaker, and a 0.1-1.1 μF decade capacitor box from the\ninstrument desk. Connect the 0.1-1.1 μF decade capacitor box in place of the 0.0047 μF\ncapacitor in your circuit from the previous exercise. Use the knobs on the capacitor box to\nset the capacitance to 0.5 μF. Connect the speaker across the resistor so that you can listen\nto vOUT. Turn on the CD player and powered speaker and adjust the volume so that you\ncan hear the music.\nListen to the music and observe the signal vOUT on the oscilloscope as you adjust the knobs\non the capacitor box from 0.1 to 1.1 μF. What happens to the music when you vary the\ncapacitance? Why?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCheckoff List - Make sure you have the following items\n(3-1) Completed Pre-Lab Exercises in your lab notebook.\n(3-2) Completed In-Lab measurements in your lab notebook. Make sure you've read each\nsection of the In-Lab Exercises to note what measurements must be taken.\n(3-3) Working circuit from In-Lab Exercise 3-5.\nPost-lab Exercises\nComplete these exercises in your lab notebook using the responses which you calculated during the\npre-lab exercises, and the data which you measured during the in-lab exercises. The primary goal\nof the post-lab exercises is to explain any discrepancies which may exist between the responses you\ncalculated during the pre-lab exercises and the responses you measured during the in-lab exercises.\n(3-1) Plot the recorded transient response data on the corresponding graph prepared during the\npre-lab exercises. How well does the measured data match the theoretical graph? That is,\nhow do they differ?\n(3-2) Consider again the transient response. In chart form for the two cases of R, compare\nyour calculated and measured voltage VTP, frequency ωT and decay rate αT. How do\nthe measured and calculated parameters compare? Next, utilize the calibrated values of\nthe network elements, including the parasitic resistance of the inductor, to re-calculate the\nparameters. Include the new parameters in the chart. Do the new parameters compare more\nfavorably with the measured parameters? Do the new parameters explain the differences\nobserved in Post-Lab Exercise 3-1?\n(3-3) First, convert the amplitudes of vOUT measured in sinusoidal steady state to measurements\nof HS(ωS) by dividing the measured amplitudes by the 10 V amplitude of vIN. Second, con\nvert the zero-crossing time differences measured in sinusoidal steady state to measurements\nof φS(ωS) by dividing the time differences by the corresponding waveform period, and then\nmultiplying by 360 degrees. Finally, plot the frequency response data on the corresponding\ngraph prepared during the pre-lab exercises. How well does the measured data match the\ntheoretical graph? That is, how do they differ?\n(3-4) Consider again the frequency response. In chart form for the two cases of R, compare\nyour calculated and measured peak voltage ratio HSP, frequency ωSP and Q. How do\nthe measured and calculated parameters compare? Next, utilize the calibrated values of\nthe network elements, including the parasitic resistance of the inductor, to re-calculate the\nparameters. Include the new parameters in the chart. Do the new parameters compare more\nfavorably with the measured parameters? Do the new parameters explain the differences\nobserved in Post-Lab Exercise 3-3?\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nUsing MATLAB for Lab 3\nYou are encouraged, although not required, to use Matlab to plot the graphs in Pre-Lab Ex\nercises 3-2 and 3-5. Note: This document is provided specifically for these exercises. There are a\nnumber of resources for general help with Matlab on Athena. , MIT's server. To use Matlab, you must\nfirst type \"add matlab\" at the Athena prompt, and then invoke Matlab by typing the command\n\"matlab\" at the Athena prompt. You can also download the transient.m and forcedosc.m files .\nThese scripts set up some of the equations and produce the graphs required for these exercises.\nJust fill in the missing relations and change the resistance values, then run the scripts.\nPre-Lab Exercise (3-2)\nAt the matlab prompt, enter the values for L, C, R, RIN, and VTI.\nL = 47e-3;\nC = 0.0047e-6;\nR = 220;\nRIN = 50;\nVTI = 10;\nReff=R+RIN;\nYour ultimate goal is to plot the transient response of vOUT(t) for 0 ≤ t ≤ 0.3 ms. In order to do\nthis, you must generate a time vector t, and a voltage vector vOUT. Start by using the \"linspace\"\ncommand to generate a time vector t of evenly spaced time values between 0 and 0.3 ms.\nt = linspace(0,0.3e-3,1000);\nType \"help linspace\" at the matlab prompt for details on the \"linspace\" command. In Pre-\nLab exercise 3-1, you came up for an expression of the form vOUT(t) = VTOe-αTt sin(ωTt + φT).\nYou will use this expression to generate the voltage vector vOUT. Enter the parameters VTO, αT,\nωT and φT into matlab in terms of L, C, R, RIN and VTI. After entering these parameters, you\nare ready to generate the voltage vector vOUT.\nvOUT = VTO * exp(-1 * alphaT * t) .* sin(omegaT * t + phiT);\nYou should now have two vectors, t and vOUT, that you can use to plot the transient response.\nUse the \"plot\" command to generate a plot.\nplot(t,vOUT);\nYou may want to use other commands to better format your graph. Try the commands \"title\",\n\"xlabel\", \"ylabel\", \"axis\", and \"grid\". For help with any matlab command, type \"help com\nmand\" at the Matlab prompt.\nNow repeat for R = 1000.\nPre-Lab Exercise (3-5)\nThis exercise asks you to create a log-log graph of HS and a linear-log graph of φS. You will find this\nto be very easy with the help of matlab. Start by creating two row vectors listing the numerator\nand denominator coefficients in descending powers of s. For example, consider the transfer function\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHS(s) =\nsR\n. The following command creates a row vector num listing the numerator\ns2L+s(R+RIN )+ 1\nC\ncoefficients in descending powers of s.\nnum = [R 0];\nNote the zero coefficient corresponding to s0 . Now create a row vector den for the denominator.\nden = [L (R+RIN) (1/C)];\nNow you can use the matlab command \"tf\" to create a transfer function from the num and den\nrow vectors.\nHS = tf(num,den)\nNext you want to generate a vector of frequencies for the x-axis of your magnitude and phase\nplots. Pre-Lab Exercise 3-5 asks you to create graphs over the range 2π×1 kHz ≤ ωS ≤ 2π×100 kHz.\nCreate a frequency vector of logarithmically spaced frequencies in this range.\nomegaS = logspace(log10(2*pi*1e3), log10(2*pi*100e3), 1000);\nFor more information, type \"help logspace\" at the matlab prompt. Now you can use the\n\"bode\" command to calculate the magnitude and phase at each of the frequencies specified in the\nomegaS vector.\n[MAG,PHASE] = bode(HS, omegaS);\nPre-Lab Exercise 3-5 asks you to graph the magnitude on a log-log plot. You can do this in\nmatlab using the \"loglog\" command.\nloglog(omegaS/(2*pi*10e3),MAG(:));\nNow you have a magnitude graph. Note that the x-axis is normalized to 10 kHz as specified in\nPre-Lab Exercise 3-5. As for the previous exercise, you can format your graph with the commands\n\"grid\", \"title\", \"ylabel\", \"xlabel\", etc. The Pre-Lab asks for a linear-log graph of the phase.\nUse the \"semilogx\" command to generate a linear-log graph.\nsemilogx(omegaS/(2*pi*10e3),PHASE(:));\nNow you are finished. After formatting your graph, repeat the exercise for R = 1000.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "lab4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-002-circuits-and-electronics-spring-2007/33d6731c206313c3addd121084d9f3b1_lab4.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Electrical Engineering and Computer Science\n6.002 - Electronic Circuits\nSpring 2007\nLab 4: Audio Playback System\nIntroduction\nIn this lab, you will construct, test and demonstrate the audio playback system which you designed\nin Homework #11. The lab consists of two parts: Pre-lab exercises and in-lab exercises; there\nare no Post-lab exercises. You should complete the Pre-lab exercises in your lab notebook before\ncoming to lab. Then, carry out the In-lab exercises between April 30 and May 11. After completing\nthe In-lab exercises, have a TA check your work and sign your lab notebook. You may hand in\nyour lab notebook for grading at that time.\nBefore asking to get checked off, make sure you meet all the requirements in the\ncheckoff list at the end of the In-Lab Exercises\nNote that in addition to regular lab hours from April 30 to May 4, there will be staff available\nin the lab the following week (May 7 through 11) for checkoff. You will be notified as to the times\nin lecture and by email.\nReminder: You must complete all of the labs. Failure to do so will result in a\ndeduction of one full grade in the class, no exceptions. Your lab notebook must be\nturned in with all Post-Labs completed and you must be checked off for all the labs.\nPre-Lab Exercises\n(4-1)\nCopy your design for the clock from Problem 1 of Homework #11 into your lab notebook.\nLabel all resistor and capacitor names and values.\n(4-2)\nNext to your design for the clock, copy the graph from Part (E) of Problem 1 of Home\nwork #11 into your lab notebook. You will use this information to determine whether the\nclock you construct during In-Lab Exercise 4-2 works correctly.\n(4-3)\nCopy your design for the digital-to-analog converter from Problem 2 of Homework #11\ninto your lab notebook. Label all resistor names and values.\n(4-4)\nNext to your design for the digital-to-analog converter, make a table showing the expected\nconverter output vDAC when each of the data-bit input voltages is 5 V and the others are\nall 0 V. Base the table on the actual resistor values used in your design. Also, note the\nexpected value of the offset voltage vOFF required to center the converter. You will use this\ninformation to determine whether the converter you construct during In-Lab Exercise 4-4\nworks correctly.\n(4-5)\nCopy your design for the low-pass filter from Problem 3 of Homework #11 into your lab\nnotebook. Label all resistor and capacitor names and values.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(4-6)\nNext to your design for the low-pass filter, copy the graph from Part (F) of Problem 3\nof Homework #11 into your lab notebook. Also, make a table showing the expected\nmagnitude and phase of the filter output vLPF given a 2-V peak-to-peak sinusoidal input\nwith a frequency of 4 kHz, 8 kHz and 16 kHz. Base the table on the actual resistor and\ncapacitor values used in your design. You will use this information to determine whether\nthe filter you construct during In-Lab Exercise 4-6 works correctly.\n(4-7)\nCopy your design for the volume control stage from Problem 4 of Homework #11 into\nyour lab notebook. Label all resistor and capacitor names and values.\n(4-8)\nNext to your design for the volume control stage, make a table showing the expected\nmagnitude and phase of the volume control stage output vOUT given a 2-V peak-to-peak\nsinusoidal input with a frequency of 10 Hz, 100 Hz and 1 kHz. Base the table on the\nactual resistor and capacitor values used in your design. You will use this information to\ndetermine whether the amplifier you construct during In-Lab Exercise 4-8 works correctly.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nIn-lab Exercises\nThe In-lab exercises involve constructing and testing the individual functional blocks of the audio\nplayback system, and then demonstrating the operation of the system as a whole.\nYou will need to obtain the counter and memory printed circuit board (PCB) from the stock\nroom, along with a small speaker. Since there is a limited supply of circuit boards and speakers\navailable, make sure you return the memory board and the speaker when you are not using them.\nThe in-lab exercises are organized so that you will construct and test one functional block at a\ntime. As each block is found to work properly, you will connect it to those which already working.\nConsequently, you will alternately construct and test various parts of the audio playback system.\nAs you develop the system in this manner, it is essential that you turn off the power\nto the protoboard before you make modifications to your system, or begin any new\nconstruction. Also, check your wiring carefully before turning the power back on. This\nwill avoid damaging the components in the system, and save you considerable debugging time.\nFinally, construct the functional blocks as compactly and neatly as possible. In this spirit, you\nshould find it easiest to use the components to wire themselves together, rather than using extra\nwires. This will save you considerable construction time, as well as considerable debugging time.\n(4-1)\nIf you are working in a group of two, you should attach your two protoboards together.\nThis will simplify the circuit assembly by providing more wiring space. To minimize\nwiring in this lab, the counter and memory have already been assembled on a printed-\ncircuit board. On the back of this board are pins that will plug into the protoboards in\nthe Lab. Plug these pins into the protoboards so that each pin is inserted into a separate\nprotoboard row. Further, locate the board so that there is considerable protoboard space\non the side with the memory output data bits. This will make connection to the board\neasiest. For example, locating the board towards the lower left corner of the protoboard\nmay prove best. The clock can then be constructed above the board, while the digital-to\nanalog converter, the low-pass filter and the buffer can be constructed to the right of the\nboard.\nFigure 1 shows the pin assignments for the printed circuit board. The pins for the eight\nmemory output data bits as well as the clock, power and ground pins are on the right\nhand side. You should connect the power pin to the 5-V power supply on the protoboard,\nand the ground pin to ground on the protoboard.\n(4-2)\nFollowing your design from Pre-Lab Exercise 4-1, construct the clock using the 74HC14\ninverter chip obtained earlier. Figure 2 shows the pin assignments for the inverter chip.\nUse any two of the inverters in the chip, and leave the others unconnected. Do not yet\nconnect the clock output vCLK to the clock input of the counter. Rather, use one channel\nof the oscilloscope to observe the oscillator output vOSC, and trigger the oscilloscope from\nthat channel. Use the other channel to observe vCAP and the clock output vCLK. Compare\nwhat you observe with the oscilloscope to the graph prepared during Pre-Lab Exercise 4-2\nto determine whether or not the clock is functioning properly. In particular, the clock\noutput vCLK should remain between 0 V and 5 V so as not to damage the counter which\nit drives. Also test whether the output signal is around 8 kHz.\n(4-3)\nProvided that the clock functions properly, and most importantly that the clock output\nvCLK remains within the range of 0 V to 5 V, connect the clock output to the clock input\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nVDD\nGND\nCLK\nB7\nB6\nB5\nB4\nB3\nB2\nB1\nB0\nDB7\nDB6\nDB5\nDB4\nDB3\nDB2\nDB1\nDB0\nCOUNTER CLOCK\nGND\n5V\nFigure 1: Pin assignments for the printed circuit board that contains the counter and memory.\nIN1\nOUT1\nIN3\nOUT3\nIN2\nOUT2\nIN6\nOUT6\nIN4\nOUT4\nIN5\nOUT5\nGND\nVCC\n74HC14\nFigure 2: Pin assignments for the 74HC14 inverter chip.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNOT USED\n+SUPPLY\nOUTPUT\nOFFSET\nNULL\nOFFSET\nNULL\n+IN\n-IN\n-SUPPLY\n&\nof the counter. With the oscilloscope, verify that the eight data bits from the memory\noutput are changing in time.\n(4-4)\nFollowing your design from Pre-Lab Exercise 4-3, construct the digital-to-analog converter\nusing a 741 op-amp and the resistors in the package obtained earlier. Figure 3 shows the\npin assignments for the 741 op-amp. Do not yet connect the converter data-bit inputs to\nthe data-bit outputs from the memory. Rather, adjust the offset voltage vOFF to 0 V, and\nconnect each input individually to the 5-V power supply while leaving the other inputs\ngrounded. Then, measure vDAC with the multimeter, and compare the measurements to\nthe data in the table prepared during Pre-Lab Exercise 4-4 to determine whether or not\nthe converter is functioning properly.\nFigure 3: Pin assignments for the 741 op-amp.\n(4-5)\nConnect the eight data-bit inputs of the digital-to-analog converter to their corresponding\ndata-bit outputs from the memory; refer to Figure 1 for the memory pin assignments.\nWith the oscilloscope, observe the converter output vDAC. You should see an audio signal\nreconstructed in a piecewise constant manner. Adjust the offset voltage vOFF so that the\naudio signal is centered around 0 V.\n(4-6)\nFollowing your design from Pre-Lab Exercise 4-5, construct the low-pass filter using a 741\nop-amp. Set the function generator to produce an unbiased 1-kHz sinusoid with a 2-V\npeak-to-peak amplitude and connect it to the input of the filter. With one channel of the\noscilloscope, observe the input to the filter, and trigger the oscilloscope from that channel.\nWith the other channel, observe the filter output vLPF. Vary the frequency of its input\nvoltage and compare the frequency response of the filter to that predicted by the graph\nand table prepared during Pre-Lab Exercise 4-6 to determine whether or not the filter is\nfunctioning properly.\n(4-7)\nConnect the output from the digital-to-analog converter to the input of the low-pass\nfilter. Using the oscilloscope, compare the output from the converter to the output from\nthe filter. While the two outputs should look similar, the output from the filter should\nlook considerably smoother upon detailed inspection.\nAt this point, the peaks of the audio signal should be clearly observable with the oscillo\nscope at the low-pass filter output vLPF. If necessary, adjust R2 in the digital-to-analog\nconverter so that the peak-to-peak amplitude of the filter output, vLPF, is approximately\n2.5 V. This adjustment may be necessary if the audio signal was recorded with an insuffi\ncient gain. Also, adjust the offset voltage vOFF in the converter again if the low-pass filter\noutput vLPF does not appear to be centered around 0 V.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n(4-8)\nFollowing your design from Pre-Lab Exercise 4-7, construct the volume control stage using\na 741 op amp, but do not yet connect it to the speaker. Figure 3 shows the pin assignments\nfor the op-amp. Set the function generator to produce an unbiased 1-kHz sinusoid with a\n2-V peak-to-peak amplitude and connect it to the input of the buffer. With one channel of\nthe oscilloscope, observe the input to the volume control stage, and trigger the oscilloscope\nfrom that channel. With the other channel, observe the volume control stage output vOUT.\nVary the frequency of its input voltage and compare the frequency response of the volume\ncontrol stage to that predicted by the table prepared during Pre-Lab Exercise 4-8 to\ndetermine whether or not the volume control stage is functioning properly.\n(4-9)\nNext, connect the volume control stage to the speaker according to your design from Pre-\nLab Exercise 4-7. Set the function generator to produce an unbiased 1-kHz sinusoid with\na 2.5-V peak-to-peak amplitude and connect it to the input of the volume control stage.\nYou should now hear a single-harmonic tone. Sweep the frequency of the signal generator\nover the range of 10 Hz to 10 kHz and use the oscilloscope to again demonstrate that the\nvolume control stage is working properly.\n(4-10) Complete the audio playback system by connecting the output of the low-pass filter directly\nto the input of the volume control stage. You would now hear the audio signal recorded\nin the memory as it is played back through the speaker.\n(4-11) OPTIONAL: Experiment with the audio playback system. For example, remove the\nlow-pass filter and see how your perception of the audio signal changes. Also, disconnect\none or more of the least significant memory data bits from the digital-to-analog converter\nand see how your perception of the audio signal changes. Try this with and without the\nlow-pass filter. How may data bits are necessary to make the audio signal intelligible?\nCheckoff List - Make sure you have the following items\n(4-1)\nCompleted Pre-Lab Exercises in your lab notebook.\n(4-2)\nCompleted In-Lab measurements in your lab notebook. Make sure you've read each\nsection of the In-Lab Exercises to note what measurements must be taken.\n(4-3)\nWorking circuit from In-Lab Exercise 4-10.\nCite as: Anant Agarwal and Jeffrey Lang, course materials for 6.002 Circuits and Electronics, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    }
  ]
}