{
  "course_name": "Classics of Chinese Literature",
  "course_description": "This course is an introduction to three of the major genres of traditional Chinese literature—poetry, fiction and drama, with a focus on vernacular fiction. We will read translations of a number of the “masterworks” of Chinese literature. We will also examine the intertextuality between these genres — how poetry blends into narrative, how fiction becomes drama, and drama inspires fiction. Through reading these selected works of traditional Chinese literature, we will examine some of the major features of traditional Chinese society: religious and philosophical beliefs, the imperial system and dynastic change, gender relations, notions of class and ethnicity, family, romance and sexuality. All works are read in translation; no language background is necessary.",
  "topics": [
    "Humanities",
    "Literature",
    "Classics",
    "International Literature",
    "Poetry",
    "Humanities",
    "Literature",
    "Classics",
    "International Literature",
    "Poetry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course is an introduction to three of the major genres of traditional Chinese literature--poetry, fiction and drama, with a focus on vernacular fiction. We will read translations of a number of the \"masterworks\" of Chinese literature. We will also examine the intertextuality between these genres -- how poetry blends into narrative, how fiction becomes drama, and drama inspires fiction. Through reading these selected works of traditional Chinese literature, we will examine some of the major features of traditional Chinese society: religious and philosophical beliefs, the imperial system and dynastic change, gender relations, notions of class and ethnicity, family, romance and sexuality. All works are read in translation; no language background is necessary.\n\nThis course seeks not only to introduce students to highlights from the canon of traditional Chinese literature, but also secondarily to consider the idea of this literary canon as a \"living tradition,\" both in contemporary Chinese societies and in the global Chinese diaspora. Student projects will focus on contemporary media adaptations of famous Chinese literary works (in film, anime, comic books, computer games, web sites, music, theater, art, and other media).\n\nThis course includes two field trips: one to the Boston MFA, and one to the Peabody Essex Museum, Salem.\n\nGrading\n\nIn this course, you will be required to complete the following activities, graded as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n30%\n\nFinal project/presentation\n\n30%\n\nWeekly journal submissions\n\n15%\n\nInformal presentations\n\n10%\n\nAnnotated bibliography and project proposal\n\n15%\n\nRequired and Recommended Texts\n\nRequired Texts\n\nShi, Nai'an, and Guanzhong Luo.\nOutlaws of the Marsh: An Abridged Version\n. Translated by Shapiro Sidney. Commercial Press, 1986. ISBN: 9789620710674.\n\nWang, Shi-fu.\nThe Story of the Western Wing\n. Edited and translated by Stephen H. West and Wilt L. Idema. University of California Press, 1995. ISBN: 9780520201842. [Preview with\nGoogle Books\n]\n\nWu, Ch'eng-en.\nMonkey: Folk Novel of China\n. Translated by Arthur Waley. Grove/Atlantic, 1994. ISBN: 9780802130860.\n\nCao, Xueqin.\nThe Story of the Stone, or The Dream of the Red Chamber, Vol. 1: The Golden Days\n. Translated by David Hawkes. Penguin Group, 1974. ISBN: 9780140442939.\n\nRecommended Texts\n\nOwen, Stephen.\nAn Anthology of Chinese Literature: Beginnings to 1911\n. Edited and translated by Stephen Owen. W. W. Norton & Company, 1996. ISBN: 9780393038231.\n\nCao, Xueqin.\nThe Story of the Stone, Vol. 2: The Crab-Flower Club\n. Edited by E. Gao and translated by David Hawkes and John Minford. Penguin, 1977. ISBN: 9780140443264.\n\nSuggested Texts\n\nLanling Xiaoxiao Sheng [pseud.].\nPlum in the Golden Vase, or Chin P'ing Mei\n. Vol. 1-4. Translated by David To Roy. Princeton University Press, 1997-2011. ISBN: 9780691150437.\n\nFu, Shen.\nSix Records of a Floating Life\n. Edited and translated by Leonard Pratt and Su-Hui Chiang. Penguin Group, 1983. ISBN: 9780140444292.\n\nTang, Xianzu.\nThe Peony Pavilion: Mudan ting\n. 2nd ed. Translated by Cyril Birch. Indiana University Press, 2002. ISBN: 9780253215277. [Preview with\nGoogle Books\n]\n\nLo, Kuan-chong.\nThree Kingdoms: China's Epic Drama\n. Translated by Moss Roberts. Pantheon Books, 1977. ISBN: 9780394733937.\n\nWu, Cheng'en.\nThe Monkey and the Monk: An Abridgment of the Journey to the West\n. Edited and translated by Anthony C. Yu. University of Chicago Press, 2006. ISBN: 9780226971568. [Preview with\nGoogle Books\n]\n\nFilms\n\nCrouching Tiger, Hidden Dragon,\ndirected by Ang Lee, 2000.\n\nHong Niang,\ndirected by Tu Long, 1958.\n\nRed Cliffs,\ndirected by John Woo, 2008.\n\nWater Margin: True Color of Heroes,\ndirected by Billy Chan, 1993.\n\nMonkey Goes West,\ndirected by Meng Hua Ho, 1966.\n\nChinese Odyssey Part One: Pandora's Box,\ndirected by Jeffery Lau, 1994.\n\nPrincess Iron Fan,\ndirected by Guchan Wan and Laiming Wan, 1941.\n\nDream of the Red Chamber,\ndirected by Han Chin, 1978.\n\nA Chinese Ghost Story,\ndirected by Siu-Tung Ching, 1987.",
  "files": []
}