{
  "course_name": "Classical Mechanics II",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Physics",
    "Classical Mechanics",
    "Science",
    "Physics",
    "Classical Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nPrerequisites\n\n8.01 Physics I: Classical Mechanics\nand\n18.02 Calculus II: Multivariable Calculus\n.\n\nDescription\n\nThis course is a broad, theoretical treatment of classical mechanics, useful in its own right for treating complex dynamical problems, but essential to understanding the foundations of quantum mechanics and statistical physics.\n\nClass Objectives\n\nClassical Mechanics Power Tools\n\nHow to solve the really hard problems with relative ease through Lagrangian Mechanics\n\nPreparation for Statistical Mechanics and Quantum Physics\n\nThe theoretical foundation for advanced physics lies in Hamiltonian Mechanics\n\nTextbook\n\nRequired\n\nLandau, Lev D., and Evgenij M. Lifshitz.\nMechanics: Course of Theoretical Physics\n. Vol. 1. 3rd ed. Butterworth-Heinemann, 1976. ISBN: 9780750628969. [Preview with\nGoogle Books\n]\n\nSuggested\n\nThornton, Stephen T., and Jerry B. Marion.\nClassical Dynamics of Particles and Systems\n. Cengage Learning India, 2012. ISBN: 9788131518472.\n\nGoldstein, Herbert, John Safko, and Charles P. Poole.\nClassical Mechanics\n. Pearson, 2013. ISBN: 9781292026558.\n\nCourse Outline\n\nLEC #\n\nTOPICS\n\n1-4\n\nLagrangian Mechanics\n\n5-6\n\nConserved Quantities\n\n7-10\n\nOrbits and Scattering\n\n11-12\n\nOscillations\n\n13-14\n\nTricky Potentials\n\n15-19\n\nHamiltonian Mechanics\n\nAssignments\n\nThere are 4 problem sets. Doing them is critical to getting the most of this class. Try them alone, then in a group, then ask an upperclassman, then email the Teaching Assistant.\n\nProject\n\nThe project problem should look impossible given only 8.01 Physics I, but will not be so bad by week 2 or 3! Do it alone (without help from the internet) whenever you like. Turn it in with the last problem set or earlier for bonus credit).\n\nGrading\n\nSeventy percent of the class grade is based on the Assignments and 30% on the Project.",
  "files": [
    {
      "category": "Assignment",
      "title": "Classical Mechanics II, Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/f4d3219d4de1b3db2d77c87c76c8720a_MIT8_223IAP17_pset1.pdf",
      "content": "Massachusetts Institute of Technology\n8.223, Classical Mechanics II\nExercises 1\n1. Consider the motion of an object close to the surface of the Earth moving under the influence of Earth's\ngravity.\na) The gravitational force law\nGMm\nF = -\nrˆ\nr2\nreduces to\nF = -gmzˆ\nat the surface with z pointing away from the center of the Earth (i.e., \"up\"). Express g in terms of G,\nM\nand R . Compute g in SI units.\n⊕\n⊕\nb) For a cannonball fired at velocity vo and angle θ above the horizon on the Moon, find the range;\nthe distance from the cannon at which the cannonball hits the surface of the Moon. (You will need to\nrecompute g for the Moon, but the lack of air on the Moon makes this calculation much easier there\nthan on Earth.)\n2. Hooke's law for a spring of constant k is F = -kx. A mass m is pushed from position xo with velocity\nvo at t = 0. Find the subsequent motion, x(t).\n3. Some exercises with coordinate systems\na) Find the conversion from spherical (aka \"polar\") to cartesian coordinates, i.e. the functions x(r, θ, φ),\ny(r, θ, φ) and z(r, θ, φ). Also find the inverse functions, r(x, y, z), etc.\nb) Find the conversion from cylindrical to cartesian coordinates, i.e. the functions x(ρ, φ, z), etc. Also\nfind the inverse functions, ρ(x, y, z), etc.\nc) A particle starting from the origin moves in the rˆ direction with velocity vo and polar angles φ0 and\nθ0, such that v = vorˆ. Express v in cartesian coordinates.\nd) OPTIONAL: A particle starting from a point xo moves with the same velocity from part c) above\n(now no longer in the rˆ direction). Express v in polar coordinates. From this exercise, you should\nnotice a BIG weakness of the polar coordinate system.\n\n4. Consider the equation of motion for a pendulum swinging under the influence of Earth's gravity\nml φ = -mgl sin φ\na) Derive this equation of motion (using the Euler-Lagrange equation), with φ = 0 corresponding to\nthe y-axis (parallel to gravity). Recall that we implement the constraint of a rigid pendulum rod as\nx = lsin(φ), y = lcos(φ).\nb) Justify that for small oscillations, we may use sin φ ∼φ.\nc) Solve the resulting equation for arbitrary (but small) initial conditions to give φ(t).\n5. Starting from the Principle of Least Action, show that a system with N degrees of freedom and\n∂L\nthe Lagrangian L(q1, · · · , qN, q 1, · · · , qN), gives N Euler-Lagrange equations ∂qi\n-d\ndt\n∂L = 0 for all\n∂q i\ni ∈{1, · · · , N}.\n6. Referring to Eq. 2.8 and the integral equation which follows in Landau,\na) explain in words why S and S′ \"differ by a quantity which gives zero on variation\".\nb) give 2 example functions which can be written as a total time derivative. That is, find 2 examples\nof g(t) such that\nd\ng(q, q , t) =\nf(q, t)\ndt\nc) give 2 example functions which cannot be written as a total time derivative (i.e., find 2 examples\nof g(q, q , t) such that no f(q, t) can be found for the equation in part b).\n(Please make your 2 example functions for parts b and c at least linearly independent!)\n\n7. For a free particle, we know that L = L(v2) if the particle moves in some direction with velocity v.\nCarry out a Galilean transformation to a primed frame moving with velocity u with respect to the\noriginal (unprimed) frame\nx′ = x -u t,\nt′ = t\nand show that if the unprimed frame is inertial, the primed frame is as well. Hint: you can take the\nexplicit form of the Lagrangian for a free particle L = 1mv2, and show that L in the unprimed frame\nand L in the primed frame (i.e. L′ = L((u -v)2)) give the same equations of motion.\n8. Non-commuting derivatives: Use the definition of the total time derivative to\na) show that\n∂\n∂q\nf = d\ndt\n∂f\n∂q\ni.e., these derivatives commute for any function f = f(q, q , t).\nb) show that\n∂\n∂ q\nf = d\ndt\n∂\n∂ q f + ∂f\n∂q\n(i.e., these derivatives do NOT commute.)\n9. Take L = 1mv2 -mgz\na) Find the equations of motion.\nb) Take x(0) = 0,v(0) = v0, v0z > 0 and find x(τ) and v(τ), τ such that z(τ) = 0, τ = 0\n10. A particle of mass m is confined to a parabolic surface of rotation z = aρ2, where ρ =\np\nx2 + y2. The\ngravitational potential is U = mgz.\na) Show the Lagrangian is\nL = 1\n\nm(z + ρ 2 + ρ2φ2)\n-mgz\nsubject to the constraint that z = aρ2, i.e. the particle remains on the surface of parabolic rotation.\nb) Use the constraint equation to eliminate z from the Lagrangian and give the equations of motion.\nc) Find the generalized momenta pρ and pφ from the Lagrangian. Which, if any, are conserved and why?\nd) OPTIONAL: Solve the equations of motion. Don't spend too much time on this!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Classical Mechanics II, Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/677724fac336d5381f18f3355097bbb2_MIT8_223IAP17_pset2.pdf",
      "content": "Massachusetts Institute of Technology\n8.223, Classical Mechanics II\nExercises 2\n11. For a particle described by L = 1mv2\n-U,\na) Show that if U = U(x), E = T + U is constant.\n\nb) Show that if U = U(x, x), then E is conserved, but it is not necessarily E = T + U.\n12. For L = Ta + Tb -u(xa -\n\nxb), show that P = pa + pb is conserved. Hint: try defining new coordinates:\nX = xa + xb\nx = xa -xb.\n13. For a two body system with particle 1 of mass m1 located at x1 and particle 2 of mass m2 located at\n\nx2, find the center of mass R in terms of m1, m2, x1 and x2. (This is not a trick question.)\n14. a) Show that the change in coordinates of a particle (fixed position) from a small rotation by φ around\nthe zˆ axis may be written as\ndx = x′ -x = (φzˆ) × x.\n\nb) OPTIONAL: Show that the change in coordinates dx for a small rotation around the axis b by φ\nˆ\nmay be written dx = (φb) × x.\n\n15. Moving pendulum: A plane pendulum consists of a bob of mass m suspended by a massless rigid rod\nof length l that is hinged to a sled of mass M. The sled slides without friction on a horizontal rail (see\nFig. ??). Gravity acts on both masses.\nFigure 1: moving pendulum\na ×2) Write the Lagrangian for the system and derive the equations of motion.\nb) At time t = 0 the bob and the sled, which had previously been at rest (with θ = 0), are set in\nmotion by a sharp tap delivered to the bob. The tap imparts a horizontal impulse ΔP = FΔt to the\n\nbob. Find expressions for the values of θ and x just after the impulse. [Hint: consider both linear and\nangular momentum.]\n\n16. (×2) Flyball Governor: In the system shown in Fig. 2, the particle m2 moves on the vertical axis and\nthe whole system rotates about this axis with a constant angular velocity Ω. Derive the Lagrangian of\nthe system and obtain the equations of motion. Gravity pulls down on all masses.\nm1\nm1\nA\nm2\nA\na\na\nA\na\na\nFigure 2: Centrifugal governor (aka, flyball governor)\n17. (×2) Least time path: A particle can slide (without any friction) under gravity from point A(0, 0, h) to\npoint B(X, 0, 0) along a curve z(x) (Fig. 3). Find the path z(x) that minimizes the time. The particle\nstarts at rest from point A. [Hint: you can use conservation laws to simplify your calculation. You\nmay encounter integrals of the form\n\na -t dt\nb + t\nwhich can be solved by substituting t = a -(a + b)sin2θ.]\nA\nB\nz(x)\nz\nx\nFigure 3: Least time path\n\n18. Show that\nd\n\n(x · x) = v2 + x\ndt\n· x.\n(also not a trick question)\n\n19. Show that a potential U = κrk results in a force F = -kκrk-1rˆ.\n20. Carry out the integration of Eq. 14.7 in Landau for U = -α/r. Use the substitution u = 1/r in Eq.\n14.7 and show that u = (ε/p) cos φ + (1/p) solves the integral. Find p and ε in terms of M, μ, α and E.\nHint: multiply the numerator and denominator by r2.\n21. Use p/r = ε cos φ+1 and your results from exercise 20 to show that E > 0 corresponds to a hyperbola,\nE = 0 corresponds to a parabola, and E < 0 corresponds to an ellipse.\n22. There are plenty of asteroids flying around in the universe. For an asteroid coming from infinity with\nvelocity v\n, find the effective total cross-section for the asteroid to hit the earth (due to the gravita-\ninf\ntional attraction between them). You can assume that the asteroid is much smaller than the earth.\nWhat happens in the limit v\n= inf? Interpret the result.\ninf\nHint: Treat this as a scattering problem with the asteroids all moving in the same direction (as in a\nbeam of particles), and compute the maximum impact factor for an asteroid to hit the Earth, bmax.\nThe cross-section is then σ = πb2\nmax.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Classical Mechanics II, Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/0c7f9715e2e0b47c1f0440aa03a6bedf_MIT8_223IAP17_pset3.pdf",
      "content": "Massachusetts Institute of Technology\n8.223, Classical Mechanics II\nExercises 3\n23. Verify the Virial Theorem for a one dimensional simple harmonic oscillator by direct calculation, i.e.\ncompute T(t) and U(t) and find their averages over one cycle.\n24. Compute the cross-section for back-scattering offa fixed impenetrable sphere of radius R (i.e., U = 0\nfor r > R, and U = inffor r ≤R, and scattering angle |θ| > π/2).\n25. Show that a solution to\nF\nx + ω2\nox =\ncos(ωt + θ)\n(1)\nm\nfor the case of resonant driving (ωo = ω) is x(t) = a1 cos(ωot+φ)+a2 t sin(ωot+θ). Find the constants\na1 and φ for the initial conditions x(0) = 0 and x (0) = vo.\n26. (×2) Small Oscillations: For the system in problem 16 (pset 2), compute the angular frequency ω for\nsmall oscillations about (stable) equilibrium.\n27. Review of damped undriven and driven one dimensional harmonic oscillators\na ×2) The equation of motion for an undriven harmonic oscillator is\nmx = -λx -kx.\nUse a trial solution x(t) = e-ct, substitute in the equation, and show that there are three solutions\ndepending on whether the oscillator is under damped, critically damped or over damped:\ni) x(t) = e-Λt [A sin ωt + B cos ωt]\nii) x(t) = e-Λt [At + B]\niii) x(t) = AeΛ1t + BeΛ2t\nFind the values of the Λ's and ω for each case, in terms of m, λ and k. (Note, k is the \"spring constant\"\nas in the conservative potential U(x) = 1kx2, λ is the damping coefficient, and m the mass.)\nb) A driven damped simple harmonic oscillator obeys the equation\nmx = -λx -kx + C sin ωt\nand its solution has the form x(t) = xI(t) + xII(t) where xI(t) is the transient solution and has the\nform of the solution in part a). Show that xII(t), the steady state solution, has the form\nD\nxII(t) = p\nsin (ωt + φ)\n(ω2 -ω2 2\no) + Γ2\nand find ωo, D, Γ and φ in terms of the constants describing the properties of the oscillator (m, λ and\nk) and the drive (C and ω).\n\n28. A driven oscillator is described by\nx + ω2\nF\nox =\ncos(γt + α).\n(2)\nm\nWe found that the solution offresonance is\nF/m\nx(t) = B cos(ωot + β) +\ncos(γt + α).\nω2o -γ2\nwhich we can rearrange to\nF/m\nx(t) = C cos(ωot + κ) +\n(cos(γt + α)\n2o -γ2\n-cos(ωot + α)) .\nω\nwith new constants C and κ.\na) If the oscillator is driven close to the natural frequency ωo, we can write ωo = γ + ε with ε ≪ωo.\nKeeping terms only linear in ε (i.e. set any ε with higher power to zero), show that we can write\nF/m\nx(t)\n=\nC cos(ωot + κ) +\n(cos(ωot + α\nεt)\ncos(ωot + α))\n(3)\n2ωoε\n-\n-\nb) Show that this evolves to the on resonance solution (LL 22.5) for ε →0. Note: you may carry out\nthe calculation using trigonometric identities or complex notation.\nNote: to compare with LL 22.5, convert the above as follows:\nC →a,\nF →f,\nω0 →ω,\nκ →α,\nα →β\n29. (×2) Determine the positions of stable equilibrium of a pendulum\np\nwhose point of support, xs, oscillates\nhorizontally with high frequency: xs = a cos(γt), with γ ≫\ng/l (i.e., a horizontal Kapitza pendulum).\n30. OPTIONAL: We can write the solution to a simple harmonic oscillator as\nvo\nx(t)\n=\nxo cos ωot +\nsin ωot\nωo\n=\nx1(t, xo) + x2(t, vo).\nAfter a time ∆t, the solution will be x(t + ∆t) which we may write\nx1(t + ∆t, xo)\n=\nax1(t, xo) + bx2(t, vo)\nx2(t + ∆t, vo)\n=\ncx1(t, xo) + dx2(t, vo).\nFind a, b, c and d.\n31. OPTIONAL: We can use a, b, c and d from the previous problem to make the matrix M such that\nx(t + ∆t) = Mx(t). Find the eigenvalues of M. Take ∆t = 4π/ωo and find the eigenvectors.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Classical Mechanics II, Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/883108e5d6d4bae2cb0da1cd4460cea9_MIT8_223IAP17_pset4.pdf",
      "content": "Massachusetts Institute of Technology\n8.223, Classical Mechanics II\nPset 4\n32. Show that for F(x1, ..., xn), the Legendre transformation is\nn\nG(s1, ..., sn) =\nX\nxisi\ni=1\n-F\nwhere\nsi =\n∂F\n∂xi\n\nx1,...,xi-1,xi+1,...,xn\nand has the property that\n∂G\nxi = ∂si\n33. Starting from the Lagrangian for the simple harmonic oscillator,\nL = 2m x2 -1kx2,\nfind the momentum, the Hamiltonian H(p, q) and Hamilton's equations of motion.\n34. Continuing the previous exercise, solve Hamilton's equations and make a plot of typical trajectories in\n(p, q) space (referred to as \"phase space\".)\n35. Give the Hamiltonian in three dimensions for a system with potential U(r) = -α/r using spherical\npolar coordinates.\nWrite the equations of motion and identify the conserved momenta.\nUse this\nresult (and a proper reference frame) to reduce the problem to one dynamical variable and associated\nconjugated momentum (they will be r and pr).\n36. OPTIONAL Draw phase space diagrams in r and pr for the previous problem.\n37. Show each of the following fundamental Poisson bracket equations:\n[q1, q2] = 0\n[p1, p2] = 0\n[q1, p2] = 0\n[p1, q1] = 1\n[p2\n1, q1] = 2p1\n[p1, q2\n1] = 2q1\n\n38. Canonical transformation:\n(a) Show that the transformation on 2n-dimensional phase space associated with a coordinate trans-\nformation on configuration space, namely:\nqi →Qi(q)\npi →\nj\nPi(q, p)\nX\n∂q\n=\npj\nj\n∂Qi\nis a canonical transformation.\n(b) On a 2-dimensional phase space, show that the transformation\nsin p\nq →Q = ln(\n)\nq\np →P = q cot p\nis canonical.\n(c) Find the generating function F4(p, P) of the canonical transformation in (b).\nθ\ny\nx\nB\nA\nm\nR\ns\nFigure 1:\n39. As shown in Fig. 1, consider a mass m attached to a string which in turn is nailed to point A on a\ncircular spool of radius R. The whole system lies on the horizontal plane, and the spool is fixed so\nit cannot rotate. As the mass slides without friction, the string remains taut and either winds or\nunwinds around the spool. B is the point where the string leaves the spool. Let the total length of the\nstring be l, and let s denote the free length of the string, that is, the length from B to the mass. We\nalign the coordinate axes so that the center O of the spool corresponds to x = y = 0 and the radius to\nOA is in the positive y direction. Let θ denote the angle between OA and OB.\n(a) Express the coordinates (x, y) of the mass in terms of s, θ and R. Using the constraint relating s\nand θ to the total length, find the Lagrangian L(s, s ) of the system in terms of the dynamical coordi-\nnates s and its associated velocity s .\n\np\n(b) Find the Hamiltonian H(s, p), write Hamilton's equations, and confirm that\nis a constant of the\ns\nmotion. Use this information to find s(t) in terms of its initial value s0 and the total energy E.\n(c) Consider the following change of coordinates:\np\nQ = s2, P = λs\nFind the value of the constant λ so that the transformation is canonical and give H′(Q, P).\n40. For a Lagrangian with a velocity dependent potential\nL = 2m x2 + 1my 2\n-λyx,\na) Show that the solutions have the form\nλ\nx(t) = -R cos(mt + φ) + xo\ny(t) = R sin( λ t + φ) + yo.\nm\nb) Find the conjugate momenta.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Classical Mechanics II, Lecture 1 Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/bedda5d236529e77ad338c6e98a5e5bf_MIT8_223IAP17_Lec1.pdf",
      "content": "(1) Introduction\n1 Welcome to 8.223\n- Classical Mechanics II\n- Matthew Evans lecturer\n- Lectures M-F 10-11:30 AM in 4-270\n- Recitations M-F 12-1 PM in 4-270\n- Recitation TAs:\n- Stephanie O'Neil (weeks 1-2)\n- Yuanhong (Jason) Luo (weeks 3-4)\n- Aravind\nDevarakonda\n(general,\nPsets)\n- TAs: make suggestions and ask questions!\n- website: linked from stellar\n- Hi folks! Welcome to 8.223...\n- Who am I?\n∗ Astrophysics Division\n∗ Experimentalist\n∗ Gravitational Waves!\n- Who are you?\n∗ course 8?\n∗ sophomores? juniors?\nClass Objectives:\n- Classical Mechanics Power Tools\n- How to solve the really hard problems with relative ease through La\ngrangian Mechanics\n\n- Preparation for Statistical Mechanics and Quantum\n- The theoretical foundation for advanced physics lies in Hamiltonian\nMechanics\n- Unfortunately this means you will have to believe me when I say \"this\nwill come in handy in 8.04\"\n- Course Structure\n- Daily Lecture and Recitation - must attend!\n- Psets - 70% - do them daily, hand in Friday 10am\n- \"Project\" - 30% - one hard problem to do alone\nNo late psets! No late projects!!\nDoing the psets is critical to getting the most of this class. Try them alone, then\nin a group, then ask an upperclassman, then email the TA.\nThe project problem should look impossible given only 8.01 physics, but will\nnot be so bad by week 2 or 3! Do it alone (without help from the internet) whenever\nyou like. Turn it in with the last pset on Friday February 2 at 10 AM (or earlier for\nbonus credit).\nRough Course Outline\nTopic\nLagrangian Mechancis\nConserved Quantities\nOrbits and Scattering\nOscillations\nTricky Potentials\nHamiltonian Mechanics\nLL Chapter\nLecture\n1-5\n1-4\n6-10\n5-6\n11, 13-15, 18-19\n7-10\n21-22, 25-26\n11-12\n30+\n13-14\n40, 42, 45-46\n15-19\nA few words about reading LL: it is overly dense, which means that the impli\ncations and examples are generally left to the reader. Suggestions:\n\nLL Suggestions\n1. Read with a notebook and work out the \"evident\" tran\nsitions between equations.\n2. Do the exercises - they overlap with the pset, and the\nsolution is given.\n3. Do 1 and 2 before lecture, and bring questions!\nAlso consider consulting\nClassical Dynamics by Marion and Thornton\nClassical Mechanics by Goldstein\n2 8.01 Work Flow Review\nIn 8.223, I will assume that you remember 8.01, and I will occasionally use it as a\npoint of reference.\nIn 8.01, Newton's second law was king. All you needed was F = ma and\nsome coordinates, and you were ready to go. Sure, you added springs and strings\nand pulleys and went from point masses to rigid bodies; you integrated in space\nand time to find energy and momentum, and studied motion in various potentials,\nbut in the end it was always just F = ma in some coordinates.\nFor any given problem you might\n8.01 Work Flow\n1. set up a coordinate system\n2. draw free body diagram\n3. write equations of motion\n4. eliminate forces of constraint (e.g. tension in a string)\n-k\n5. solve for final equations of motion (e.g. x =\nx)\nm\n\nA typical 8.01 problem:\nSetup and Coordinates\nA typical 8.01 problem:\nr = r1 = r2\nx1 = r cos θ\nx2 = x0\ny1 = r sin θ\ny2 = y0 - r\nrb1 = cos θ xb + sin θ yb\nrb2 = -yb\nbθ = - sin θ xb + cos θ yb\nThe next step is a free body diagram.\n\nAnalyze the free body diagram:\nFx1 = Ts cos θ - N sin θ\nFx2 = 0\nFy1 = Ts sin θ + N cos θ - m1g\nFy2 = Ts - m2g\nEliminate forces of constraint:\nd\n~\nb\nθ = 0 ⇒ F1 · θ = 0 ⇒ N = m1g cos θ\ndt\n~\n~\nF1 · rb1\nTs\nF2 · rb2\n-Ts\nr 1 = r 2 ⇒\n=\n- g sin θ =\n=\n+ g\nm1\nm1\nm2\nm2\n⇒ Ts(\n+\n) = g(1 + sin θ)\nm1\nm2\nm1m2\n⇒ Ts =\ng(1 + sin θ)\nm1 + m2\n\nWrite equation of motion:\n-Fy2\nm1\nr =\n= g(1 -\n(1 + sin θ))\nm2\nm1 + m2\ng\n=\n(m1 + m2 - m1 - m1 sin θ)\nm1 + m2\ng\nr =\n(m2 - m1 sin θ)\nm1 + m2\nGiven some initial conditions (r and r at t = 0) you can solve this ODE.\n3 Generalizing F = ma\nIn the next few lectures we'll explore a different approach. Here's a brief taste:\nGeneralizing F = ma\n-∂U\nd\nGeneralize F = ma to\n=\n(mx ),\n∂x\ndt\nwhere U is the potential energy.\n\n∂\n∂T\nnote mx =\nmx 2\n=\n∂x\n∂x\nwhere T is the kinetic energy\n\n∂U\nd\n∂T\nthus F = ma ⇒-\n=\n∂x\ndt\n∂x\nLet's try this with our example problem.\nNote: \"T\" is used for kinetic energy here (it was tension in the string!)\n\nTo find equations of motion:\nU = g(m1y1 + m2y2) = g(m1 sin θ - m2)r\nT =\n(m1v1 + m2v2) = (m1 + m2) r\n∂U\n∂T\n-\n= g(m2 - m1 sin θ),\n= (m1 + m2) r\n∂r\nr\ng\n⇒ r =\n(m2 - m1 sin θ)\nm1 + m2\nDONE!! No vectors, no forces of constraint to eliminate!\nKapitza Pendulum Example, NDSolve demo\nFor tomorrow\n1. read Feynman Lecture (pages 1-7, non-relativistic)\n2. do pset problems 1-3\nNote about lectures: I aim to finish ≈ 15 minutes early, so that there is time for\nquestions (varying from 5-30 minutes early).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Classical Mechanics II, Lecture 2 Building up to PLA",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/9a2b9c0a146dca9bbac0d45363309c9a_MIT8_223IAP17_Lec2.pdf",
      "content": "Lecture (2)\nToday:\n- Generalized Coordinates\n- Principle of Least Action\nFor tomorrow\n1. read LL 1-5 (only a few pages!)\n2. do pset problems 4-6\n1 Generalized Coordinates\nThe first step in almost any mechanics problem is a choice of coordinates with\nwhich to describe the motion of our system.\nCartesian Coordinates\n\n~r = x xb + y yb+ z zb\nwhere b y, b\nx, b z are direction unit vectors.\nin 3D, we need 3 parameters.\nCylindrical Coordinates\np\nρ =\nx2 + y2\ncos φ = x , sin φ = y\n~r = ρ ρb+ z zb\nnote: ρband φb depend on φ\n⇒ ~r = ρ ρb(φ) + z zb\nwhere ρb(φ) = ρ cos φ xb + ρ sin φ yb\n\nSpherical Coordinates\n~r = r rb\nrb = sin θ(cos φ xb + sin φ yb) + cos θ zb\nbθ = cos θ(cos φ xb + sin φ yb) - sin θ zb\nbφ = - sin φ xb + cos φ yb\nSo no matter how you do it, you need 3 coordinates for each particle in 3D.\nIn our simple example problem, we worked with 2 masses in 2D.\n\n2 masses in 2D\n⇒ 4 \"Degrees of Freedom\" or DOF\nadd 2 constraints (string, ramp)\n⇒ 2 DOF remain\nFx2 = 0, so this DOF is uninteresting\n⇒ 1 DOF problem (coordinate r)\nSo to describe the motion of this system we need only one \"coordinate\". I did\nthis with a parameter called r (I tried d at first but ∂T looked bad!)\n∂d\nIn the above example, we defined a coordinate r which made sense for that\nproblem, but we did it in a creative and ill defined way... it is just what seemed to\nwork. In order to give us a general way to talk about the coordinates with which\nwe describe a system, we will define notation for \"Generalized Coordinates\".\nGeneralized Coordinates\n\nfor N DOFs we use q1, q2, ..., qN\nd\ntime derivatives are q i =\nqi\ndt\nCoordinates of a particle are implicit functions of time. We\nare looking for qi(t).\nI say \"implicit\" because we don't know the functional form until we find and\nsolve the equations of motion. This is as opposed to an explicit time dependence,\nlike an oscillating driving force.\nGeneralized coordinates needn't be orthogonal, they just need to specify the\npositions of all particles completely and they should be continuously differentiable\n(aka \"smooth\").\nSystem State\nCompletely specified by qi and q i at any time t.\nInitial state q(t = 0) and q (t = 0)\nevolve with F (q, q ) = mq (equation of motion).\nQuestions about generalized coordinates?\n\nNote: q without subscript means ~q = qi∀i , so 1 DOF and N DOF look the same.\n\n2 Generalization, Take 2\nNow with generalized coordinates as a well defined concept, we return to where\nwe left off yesterday; generalizing F = ma. First, the generalization you did in\n8.01:\nGeneralizing F = ma\n~\n\nexplicit form F (~r, ~r, t)\n~\nd\n\nlet m vary F =\n(m(t)~ r) = p~\ndt\nconservative force? F~ = -rU = p~\nAnd the generalization we did yesterday, which went a little further:\n\nd\n∂T\np =\n, T = mq\ndt\n∂q\n\n∂U\nd\n∂T\n⇒-\n=\n∂q\ndt\n∂q\nThis was tricky, but it worked!\nHow do we know that a particular generalization is the RIGHT generalization?\nIt's right if it lets us solve more complicated problems with ease (i.e. we use F = p\nfor rockets with m(t)).\nLet's try a slightly more complicated version of the ramp with two masses...\nwe'll let the hanging mass swing.\nas before, but we start with θ2 6= 0. This means that we now have a 2 DoF system.\nWe'll try to find the EoM first this with a simple F = ma approach:\n\nFBD for m2\n~\nb\nb\nF2 · θ2\nτ2\nr2(F~2 · θ2)\n\nr2θ2 =\nor θ2 =\n=\nm2\nI2\nr2m2\n-g sin θ2\n\nθ2 =\nEoM for θ2\nr2\n~F2 · rb2\ncos θ2m2g - Ts\nr 2 =\n=\nm2\nm2\nUsing the string tension from lecture 1,\nm1m2\nTs =\ng(cos θ2 + sin θ)\nm1 + m2\nwe can get\nm1\nr 2 = g(cos θ2 -\n(cos θ2 + sin θ1))\nm1 + m2\n=\ng\n(m2 cos θ2 - m1 sin θ1) EoM for r2\nm1 + m2\nBOTH ARE WRONG! since rb2(θ2) and θb2(θ2)\n\ntry Cartesian coordinates for m2\nFind EoM for x and y\nm2 x2 = -Ts sin θ2 , m2 y2 = m2g - Ts cos θ2\ny2 = r2 cos θ2\n⇒ y2 = d\ndt( r2 cos θ2 - r2 θ2 sin θ2)\n= r2 cos θ2 - 2 r2 θ2 sin θ2 - r2(\nθ2 sin θ2 + θ2\n2 cos θ2)\nx2 = r2 sin θ2\n⇒ x2 = r2 sin θ2 + 2 r2 θ2 cos θ2 + r2(\nθ2 cos θ2 - θ2\n2 sin θ2)\nreturning to Equation of Motion for r2 and θ2\nm2( r2 sin θ2 + ...) = -Ts sin θ2\nm2( r2 cos θ2 - ...) = m2g - Ts cos θ2\nrecall m1r 1 = Ts - m1g sin θ1, r 1 = r 2\nnow we have everything in terms of r2 and θ2, we just need to solve! Ack!\n\n⇒ Mathematica! ⇐\ng\nm2\nr 2 =\n(m2 cos θ2 - m1 sin θ1) +\nr2θ 2\nm1 + m2\nm1 + m2\n\nθ2 = -1(g sin θ2 + 2 r2θ 2)\nr2\nthe new term in each equation is the centripetal force!\nIs this better with our generalization?\nlet m2 swing... we need Potential Energy U and Kinetic Energy T to start:\nU = g(m1 sin θ1 - m2 cos θ2)r\nT = 1(m1 + m2) r + 1 m2(rθ 2)2\n∂U\n∂U\n= g( ) ,\n= gm2r sin θ2\n∂r\n∂θ2\n∂T\n∂T\n= (m1 + m2) r ,\n= m2r 2θ 2\n∂r\n∂θ 2\ng\nr =\n(m2 cos θ2 - m1 sin θ1)\nm1 + m2\nThis is WRONG! Centripetal force is still missing!!\n\nd (r 2θ 2) = -gr sin θ2\ndt\n2rr θ 2 + r θ2 = -gr sin θ2\n\nθ2 = -1 (g sin θ2 + 2 rθ 2)\nr\nbut this is now correct!\nOur problem arises from the dependence of the kinetic energy on the coordinate\nr. In generalizing of F = ma, we tacitly assumed:\nAssumed U(q), T ( q)\n(∂T\ngot d\n) = -∂U\ndt ∂q\n∂q\nwhy not\nd (∂L ) = ∂L for L = T - U\ndt ∂q\n∂q\n∂T\nsince ∂U = 0 and\n= 0 ?\n∂q\n∂q\nThis seems unnecessary but let's try it...\nL = T - U\n= 1\n2(m1 + m2) r 2 + 1\n2 m2(r θ2)2 - g(m1 sin θ1 - m2 cos θ2)r\n∂L\n∂r = m2r θ2\n2 + g(m1 sin θ1 - m2 cos θ2)\n∂L\n∂ r = (m1 + m2) r\nd\ndt\n∂L\n∂ r\n\n= ∂L\n∂r\n⇒ r =\nm2\nm1 + m2\nr θ2\n2 +\ng\nm1 + m2\n(m1 sin θ1 - m2 cos θ2)\n\nDone! No Mathematica needed!\nGeneralizations are a bit mysterious. Done randomly, most will fail to bear\nfruit, but the RIGHT one can open entirely new ways of approaching physics. We\nwill take one more great leap to the Principle of Least Action, and then work our\nway back to Euler Lagrange and F = ma from there.\nPrinciple of Least Action (PLA):\nfor some L(q,\nR\nq, t), the motion of a system minimizes\nt2\nS =\nL dt, where S = \"action\"\nt1\nfor a given q(t1) and q(t2)\nS is the action, and L is the Lagrangian. In the most general case L need not\nbe T - U. But in most interesting cases, L = T - U.\nThe PLA is not like Newtonian thinking. You assume that you know the end\npoints, and ask what happened in between. With F = ma you assume you know\nthe initial position and velocity, and then move forward in time.\nFor the PLA, any trial path is valid. The one with minimal S is the true path.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Classical Mechanics II, Lecture 3 PLA and Lagrangian Workflow",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/4991e17384bab84739ff5c21bc3e7122_MIT8_223IAP17_Lec3.pdf",
      "content": "Lecture (3)\nToday:\n- Principle of Least Action\n- Euler-Lagrange Equations\nFor tomorrow\n1. read LL 1-5 again (really!)\n2. do pset problems 7-9\nPrinciple of Least Action (PLA)\nPrinciple of Least Action (PLA):\nfor some L(q, q, t), the motion of a system minimizes\nS =\nR t2\nt1 L dt, where S = \"action\"\nfor a given q(t1) and q(t2)\nS is the action, and L is the Lagrangian. In the most general case L need not\nbe T -U. But in most interesting cases, L = T -U.\nLet's look at some simple examples.\nFree Particle in 1D\n⇒U = 0 ⇒L = 1\n2m q2\n\nPLA\nThe PLA is not like Newtonian thinking. You assume that you KNOW THE\nEND POINTS, and ask what happened in between. With F = ma, you assume\nyou know the initial position AND VELOCITY, and then move forward in time.\nFor the PLA any trial path is valid. The one with minimal S is the true path.\nFor this example, I'll consider parabolic paths.\nConstant Velocity Path\nt1 = 0 , q(t1) = q1 = 0\nq(t) = at + bt2 , q(t2) = q2 = at2 + bt2\n⇒a = q2\nt2\n-bt2 = v2 -bt2\nwhere v2 = q2\nt2\nThis leaves us b as a free parameter which we can adjust to find the path with\nminimum action.\n\nS =\nZ t2\n2m q2dt , q = a + 2bt\nMathematica! ⇒S = 1\n2mt2(v2\n2 + b2t2\n3 )\nminimum at b = 0\nSo, free particles move at constant velocity. Newton's 1st Law! Inertia!\n(not really a surprise, I guess...)\nLet's try again, but this time with a simple potential.\nSimple Potential\nU = mgq ⇒L = 1\n2m q2 -mgq\n⇒S = m\nZ t2\n2(a + 2bt)2 -g(at + bt2)dt\n⇒S = 1\n2mt2(v2(v2 -gt2) + 1\n3t2\n2(b2 + bg))\n∂S\n∂b = 0 ⇒2b + g = 0 ⇒b = -g\nSo we found the parabolic path with minimum action to be the one you would\nexpect from 8.01.\na = v2 -bt2 = v2 + gt2\n2 = q(t = 0) = v0\nq(t) = v0t -1\n2gt2\nThe initial velocity is just what a projectile needs to fly a distance q2 in time t2\nwith acceleration g.\n⇒Projectile motion results from PLA!\nOf course the PLA does't say anything about parabolic paths. Any trial path\nwill do! How do you know the true path?\n\nThe trick is to assume you know the path and then show you are correct by\ntrying to adjust it. (This comes from from the Calculus of Variations, see Marion\n& Thornton chapter 5 for more info.)\nS′ =\nZ t2\nt1\nL(q′, q′, t)dt\nwith q′(t)\n|{z}\ntrial path\n= q(t)\n|{z}\ntrue path\n+ η(t)\n|{z}\ndeviation\n, ⇒ q′ = q + η\nq′(t1) = q(t1) ⇒η(t1) = 0\nq′(t2) = q(t2) ⇒η(t2) = 0\nPLA says S′ ≈S for small η (first order)\nS′ -S =\nZ t2\nt1\nL(q′, q′, t) -L(q, q, t)\n|\n{z\n}\nδL\ndt\nL(q′, q′, t) ≈L(q, q, t) + ∂L\n∂q η + ∂L\n∂ q η\n⇒S′ -S ≈\nZ t2\nt1\n∂L\n∂q η + ∂L\n∂ q η\n\ndt\nd\ndt\n∂L\n∂ q η\n\n= η d\ndt\n∂L\n∂ q\n\n+ ∂L\n∂ q η\n⇒S′ -S ≈\nZ t2\nt1\nη\n∂L\n∂q -d\ndt\n∂L\n∂ q\n\ndt +\nZ t2\nt1\nd\ndt\n∂L\n∂ q η\n\ndt\n|\n{z\n}\n∂L\n∂ q η|t2\nt1=0\nsince η(t1) = η(t2) = 0\nWe are looking for a true path with S′ -S = 0 for any small deviation η(t).\n\nS′ -S =\nZ t2\nt1\nη\n∂L\n∂q -d\ndt\n∂L\n∂ q\n\ndt = 0\nfor any η\n⇒∂L\n∂q -d\ndt\n∂L\n∂ q\n\n= 0 , Euler-Lagrange\nAnd thus we see that the true path must be a solution to the E-L equation! (It is not\nan accident that this is also the generalization that worked in yesterday's lecture.)\nThe PLA gives us N second order ODEs for a system with N DOFs. To find the\npath of our system through our generalized coordinate space, we should provide\n2N initial conditions, and solve N 2nd order ODEs. (Mostly, we will keep to N ∈\n\n1,2,3\n\n).\nA note about notation: Generally I will write q without the subscript i (as noted\nyesterday). You can think of this as the 1D case. If you want the ND case, just add\ni to all of the q's and q's. If the expression does not have i as a free index, sum over\nit. For example, the Euler Lagrange Equation\nd\ndt\n∂L\n∂ q\n\n= ∂L\n∂q\n→\nd\ndt\n∂L\n∂ qi\n\n= ∂L\n∂qi\nor T = 1\n2m q2 →T = 1\n2m\nX\nqi\nor d\ndtf(q, t) = ∂f\n∂t + ∂f\n∂q q →\nd\ndtf = ∂f\n∂t +\nX ∂f\n∂qi\nqi\n(Similar to Einstein summation notation). The same is true for multiple particles:\nT = 1\n2m q2 ⇒T = 1\nX\nn\nmn\nX\nin\nq2\nin\nI will try to avoid the index jungle as much as possible by sticking to 1 particle\nin 1D when writing equations.\nNB:\n\nq ≡{qi∀i} ≡q\ne.g. r = {x, y, z} or {r, φ, θ}\nGeneralized Forces and Momenta\nBriefly, here is how we get F = ma from E-L\nif L = 1\n2m q2 -U(q)\nFi ≡∂L\n∂qi\n= -∂U\n∂qi\nsince T not a function of q\npi ≡\nd\ndt\n∂L\n∂ qi\n\n= d\ndt(m qi) since U not a function of q\nE-L\n∂L\n∂q\n=\nd\ndt\n∂L\n∂ q\n\n⇒F = p (i.e. Newton)\nSo, while F = ma gets tricky when these conditions are not met, E-L just works;\nthe PLA just got us a very general form of Newton's second law. As such, we will\nneed to give names to the generalizations are of force and momentum that we are\nused to. They are:\nFi ≡generalized force for coordinate qi\npi ≡generalized momentum for velocity qi\nNote that the units associated with these generalized forces and momenta may not\nbe what you expect.\n\nUnits\n[U] =\nenergy = J = kg m2\ns2\n[Fi] = energy\n[qi]\ne.g. kg m\ns2\nif [qi] = meters\n[pi] = energy × time\n[qi]\ne.g. kg m\ns\nif [qi] = meters\nHowever, since the units of qi could be anything (e.q. unitless for angles in spheri-\ncal coordinates) the units of Fi and pi may be unusual.\nMath Review\nBefore we go on to more physics, let's review our mathematical tools.\nChain Rule\nd\ndxf(a, b) =\nda\ndx\n∂f\n∂a\n\n+\ndb\ndx\n∂f\n∂b\n\nTotal Derivative\nd\ndtf(q, q, t) = ∂f\n∂t + q∂f\n∂q + q∂f\n∂ q\nProduct Rule\nbda\ndx = d\ndx(ab) -a db\ndx\nIntegration by Parts\nZ x2\nx1\nb da\ndx dx = ab|x2\nx1 -\nZ x2\nx1\na db\ndx dx\n\nWe will have q and q as the only implicit functions of time (i.e. we don't know\nq and q until we solve the equations of motion). We will also generally only have\ntotal TIME derivatives. All other are \"easy\" partial derivatives like ∂\n∂q or ∂\n∂ q.\nNB: q = d\ndtq(t) = ∂\n∂tq(t)\nLagrangian Workflow\nThe general workflow for solving problems with Lagrangian Mechanics is:\nLagrangian Workflow:\n1. pick generalized coordinates\n2. determine L(q, q, t)\n3. compute Fi and pi to find EoM\nFinding L(q, q, t) requires T(q, q) and U(q, t)\nUsually U(q, t) is given. What about T(q, q)?\nThe Lagrangian formalism is very powerful in that we can pick any coordinate\nwe like, but there is a price to pay: the kinetic energy is complicated.\nKinetic Energy\nT\n= 1\n2m\nX\nj,k\najk qj qk, for each particle\nwhere ajk =\nX\ni\n∂ri\n∂qj\n∂ri\n∂qk\n, r = {x, y, z}.\nNote that we rely on Cartesian coordinates r to find the ajk coefficients (see also\nMarion & Thornton chapter 6.8, but beware of notational differences).\n\nif q = {x, y, z}\naxx =\n∂x\n∂x\n+\n∂y\n∂x\n+\n∂z\n∂x\n= 1\naxy = ∂x\n∂x\n∂x\n∂y + ∂y\n∂x\n∂y\n∂y + ∂z\n∂x\n∂z\n∂y = 0\n⇒T\n= 1\n2m\nx2 + y2 + z2\nIn Cartesian coordinates this is nothing special, but in others it is tricky. See\nLL 4.4-4.6.\nLet's work through an example to show how all of this machinery works. I will\njust do 2D projectile motion (e.g. mgh potential), but I will make the unforgivable\nmistake of using polar coordinates. This will demonstrate the full process in detail,\nand the value of picking the right coordinates!\n\n2D Projectile Motion\nq = {r, φ}\nx = r cos φ , y = r sin φ\nU = mgy = mgr sin φ\n∂x\n∂r\n= cos φ , ∂y\n∂r = sin φ\n∂x\n∂φ = -r sin φ , ∂y\n∂φ = r cos φ\nIn Cartesian Coordinates\nT\n= 1\n2m\n\n(∂x\n∂r )2(∂y\n∂r)2\n\nr2 +\n∂x\n∂r\n∂x\n∂φ + ∂y\n∂r\n∂y\n∂φ\n\nr φ +\n\n(∂x\n∂φ)2 + (∂y\n∂φ)2) φ2\n\nT\n= 1\n2m\n\n(cos2 φ + sin2 φ) r2 +\n2(-r cos φ sin φ + r sin φ cos φ) r φ +\n(r2 sin2 φ + r2 cos2 φ) φ2\nT\n= 1\n2m( r2 + r2 φ2)\nnow we have kinetic energy in 2D polar coordinates\nL = T -U\n= 1\n2( r2 + r2 φ2) -mgr sin φ\nfrom there we find our generalized forces\n\n\"Forces\"\nFr = ∂L\n∂r = r φ2 -mg sin φ\nkg m\ns2\n\nforce\nFφ = ∂L\n∂φ = -mgr cos φ\nkg m2\ns2\n\ntorque\nand generalized momenta\n\"Momenta\"\npr = ∂L\n∂ r = m r\nkg m\ns\n\nmass x velocity\npφ = ∂L\n∂ φ\n= mr2 φ\nkg m2\ns\n\nmoment of inertia x angular velocity\nfinally, the EoM.\nEquations of Motion\nFr = pr ⇒r φ2 -mg sin φ = m r\n⇒ r + g sin φ = 0\nFφ = pφ ⇒-mgr cos φ = m d\ndt\n⇒r2 φ + 2r r φ + gr cos φ = 0\nWe'll stop here with this example. Clearly, picking coordinates wisely is critical!\nNote: you can use T = 1\n2m( x2 + y2 + z2) and compute x(q, q), ...\nIn our example, this would be\nT\n= 1\n2m\nx2 + y2\n= 1\n2m\nd\ndt(r cos φ)\n+\nd\ndt(r sin φ)\n2!\n\nHere is the proof:\nT = 1\n2m( x2 + y2 + z2)\nx = x(q) ⇒ x =\nX ∂x\n∂qi\nqi\n⇒ x2 =\nX\nj\n∂x\n∂qj\nqj\n!\n×\nX\nk\n∂x\n∂qk\nqk\n!\n=\nX\njk\n∂x\n∂qj\n∂x\n∂qk\nqj qk\nnow sum over x, y, z to get all terms with qj qk\n⇒T = 1\n2m\nX\njk\najk qj qk\najk =\nX\ni∈x,y,z\n∂ri\n∂qj\n∂ri\n∂qk\nWhen do we get terms with ajk = 0 for j = k? (\"off-diagonal\" terms)\nnon-orthogonal basis!\nq1 = x, q2 = x + y\n⇒a12 = ∂x\n∂q1\n∂x\n∂q2\n+ ∂y\n∂q1\n∂y\n∂q2\n= 1 + 0 = 1\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Classical Mechanics II, Lecture 4 Mechanics of Lagrangians",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/35dbebd7fdcdaf78f474bfe6171431d4_MIT8_223IAP17_Lec4.pdf",
      "content": "Lecture (4)\nLast time: Mechanics of Lagrangian Mechanics\nToday: Symmetries and Galilean Relativity\nfor tomorrow\n1. read LL 6-8\n2. finish pset 1 by class time!\n1 Nature of Lagrangian and PLA\nLet's take a step back and note some interesting features of Lagrangian mechanics.\nL is a scalar function (not a vector like F~)\nL0 = αL or L00 = L+α give the same EoM for any constant\nα (PLA)\nThe fact that scaling and offsetting L have no effect is clear from the PLA: the true\npath is unchanged. Note also that L is additive:\nLab = La + Lb = (Ta + Tb) - (Ua + Ub)\nfor independent particles a and b\nfor interacting particles, we use a potential which depends on both particles\nInteracting Particles\nLab = Ta(qa, q a) + Tb(qb, q b) - Uab(qa, qb)\nmore on interactions later.\nIn addition to constants, we can add any total time derivative to L without\nchanging the resulting physics (EoMs). See LL eq 2.8.\n\nd\nL0 = L +\nf(q, t)\ndt\nZ t2\nd\nS0 =\nL +\nf(q, t)dt = S + f(q, t)|t2 = S + α\nt1\ndt\nt1\nSince all trial paths pass through the same endpoints at t1 and t2, f(q, t)|t2 is a\nt1\nconstant.\nFor the curious, I will say that this f(t) is the same as the \"generator func\ntions\" which will appear briefly at the end of this class (eqn 45.7), but its deep\nimplications are revealed only in 8.09.\nFor now, let's look at some examples.\n⇒ Ask class for examples! ⇐\nd\ng(q, q, t\n\n) =\nf(q, t)\ndt\nZ\ng(q,\n=\nh(t)dt for any h(t)\nq, t)\nh(t) ⇒ f(t) =\nor\nα → f(t) = αt for any constant α\n∂f(q)\nor\nh(q) q → exists f such that h(q) = ∂q\nd\n∂f(q)\n∂f(q)\n→\nf(q) =\n+\nq = h(q) q\ndt\n∂t\n∂q\nYou can also use this to simplify life:\ng(q, q, t) = a(q, t) d\ndt b(q, t)\n= d\ndt(a b)\n| {z }\ndrop\n-b d\ndt a\nThis type of trick is used in the text with little warning or explanation!\n\n2 Symmetries of Space and Time\nIn order to give concrete examples, I have already given you some idea of the\nfundamental form of the Lagrangian.\nL = T - U = mv2 - U(q)\nfor a free particle U(q) = 0\nNow I will prove that L must be like this using only the PLA and symmetry. I will\nuse Cartesian coordinates for all of this (though I will still write q) because other\ncoordinates are more complicated and not more enlightening. We start with the\nsimplest of assumptions...\nFree particle, all points in space are equal\n(space is homogeneous)\n\n⇒ L(~q, ~q, t) → L(~ q, t)\ncan't depend on WHERE\nall points in time are equal (time is homogeneous)\n⇒ L( ~q, t) → L(~q )\ncan't depend on WHEN\nEuler-Lagrange\n\nd\n∂L\n∂L\n∂L( q)\n=\n=\n= 0\ndt\n∂q\n∂q\n∂q\n∂L( q)\n⇒\n= const ⇒ L = αq,\nor q = const\n∂q\nall directions are equal (space is isotropic)\n\n⇒ L ~q\n→ L |~q |\n→ L ~q · ~q\n= L v 2\nX\nv =\nq i = x 2 + y 2 + z\ni\n\nSo L cannot be proportional to ~q , or else direction would matter. Simply put\nif L( q) = αq then L( 6\nq) = L(-q ) = -αq\nif L( q) = αq\nthen L( q) = L(-q )\nThus we know that the Lagrangian of a free particle can only depend on the mag\nnitude of its velocity, and we know that the result will be motion with constant\nvelocity (vectorially).\nNewton's 1st Law, but with nothing more than PLA in ho\nmogeneous and isotropic space and time.\nLet's try a simple example to see how this works.\n\nL = a + bv + cv 2 + dv3 + ...\nwhere v = q\nd\ndt\n∂L\n∂v\n= d\ndt(b + 2cv + 3dv2 + ...) = 0\n0 = 2c v + 3d(2v v) + ... = (2c + 6dv + ...) v\nSo the 1st and 2nd terms don't survive the differentiation, and if c 6\n0, we must\n=\nhave v = 0 ⇒ v = const. More terms don't change this, and actually all odd order\nterms are inconsistent with isotropic space (L( q) = L(-q )).\nNB: we picked Cartesian coords because the unit vectors are the same every\nwhere and interchangeable under rotation (e.g. homogeneous and isotropic).\nP\nFor a free particle in Cart' coords, we can only have L =\nq 2n\nn=1 αn\n3 Galilean Relativity\nWhat can we say using Galilean Relativity?\nWe'll start with 2 train cars, moving at some relative velocity ~ε.\n\nGalilean Box Cars\nU(~r, ~r ) = potential which defines the experiment in each car\n0 0)\n\nU(~r ,~r\n= U(~r, ~r)\nsame in local coordinates\n~r\n= ~r + ~ε t , ~r = ~r + ~ε\nrelative motion\nthe Lagrangians for each car are\n\nL = L(~r, ~r) = LFP - U(~r, ~r)\nL0 = L0(~ 0 0)\n0 0)\nr ,~r\n= LFP - U(~r ,~r\nwhere LFP = LFP (v 2) Lagrangian of free particle\nand v\n= |~r |2\nGalilean Relativity tells us that the physics in the two cars is the same. This means\nthat the Equations of Motion must be the same. We also know that the PLA tells\nus that 2 Lagrangians give the same physics if\nL0 = L + d f(q, t) ⇒ same physics\ndt\nso...\n\nL - L0\n02) -\n\n0 0)\n= LFP (v 2) - LFP (v\nU(~r, ~r) - U(~r ,~r\n02)\n= LFP (v 2) - LFP (v\nEarlier we expanded LFP (v) in powers of v and found that LFP could only\ncontain even powers v, leaving us with LFP as some function of v2. Since Galilean\nRelativity holds for small velocities as well as large ones, we can assume that ε is\nsmall and expand LFP (v2) around ε = 0.\nExpand LFP (v02) around ε = 0\n02)\nLFP (v\n= LFP (v 2 + 2 ~r · ~ε + ε2)\n\n∂LFP\n' LFP (v 2) +\n2 ~r · ~ε + ε2\n∂(v2)\n\n∂LFP\n⇒ L0 - L '\n2 ~r · ~ε + ε2\n∂(v2)\n\nd\n\n∂LFP\n∂LFP\n2~r · ~ε + ε2\n=\n2~r · ~ε + ε2t\n-\n∂(v2)\ndt\n∂(v2)\n\nd\n\n∂LFP\n2~r · ~ε + ε2t\ndt ∂(v2)\nIn order for us to be sure that the two Lagrangians to give the same Equations of\nMotion, we need the second term to be zero for all ~r and any small ε. That would\nmake L0 - L equal to the total time derivative of some function f(q, t).\nSame Physics\nd ∂LFP\n∂LFP\n= 0 ⇒\n= constant ⇒ LFP = Kv2\ndt ∂(v2)\n∂v2\nThus, L = Kv2 without higher powers of v2 is consistent with Galilean Relativity.\nWe choose K ∝ m to maintain the additive nature of L, and K = m to make\nF = ma pretty.\n\n4 Newton's Laws\nLet's finish deriving Newton's Laws from the PLA and basic symmetries. I have\nalready shown that we can get F = ma from E-L, but previously I always assumed\nthat L = T - U. Now we know that in Cartesian coordinates, with homogeneous\nspace and time, isotropic space, and requiring Galilean Relativity,\nL =\nmv 2 - U = T - U\n∂L\nd ∂L\n=\n⇒ F = ma\n∂q\ndt ∂q\nSo we have now arrived at F = ma from PLA and broad assumptions about space\nand time! We are also in a position to consider interacting particles\nInteracting Particles\nL =\nmav + mbv - U(~ra - ~rb)\na\nb\n∂L\nd ∂L\n∂U\nd\nfor xa :\n-\n= -\n-\n(mx a)\n∂xa\ndt ∂x a\n∂xa\ndt\n= Fxa - mx a = 0\nExtending this to all coordinates we find Newton's 3rd Law:\n\n-raU = ma ~ra and -rbU = mb ~rb\n\n~\n\nU(~ra - ~rb) ⇒ ma ~ra = Fab = -mbr~b\n\"For every action, there is an equal and opposite reaction.\"\nQuestions on this?\n\n5 Math Aside\nAgain, before we move on to more physics, let's look for a moment at these tricky\nderivatives.\nOn the pset you were asked to show that\n∂ d\nd ∂\nf(q, q, t) 6=\nf(q, q, t)\n∂q dt\ndt ∂q\neven though ∂ d f(q, q, t) = d ∂ f(q, q, t)\n∂q dt\ndt ∂q\nLet's explore this a little bit...\n∂\n∂ q\nd\ndt f = ∂\n∂ q\n∂\n∂t f + q ∂\n∂q f + q ∂\n∂ qf\n\n= ∂\n∂t\n∂\n∂ qf + ∂\n∂q f + q ∂\n∂q\n∂\n∂ qf +\n∂\n∂ q q\n∂\n∂ qf + q ∂\n∂ q\n∂ f\n∂q\n∂ d\n∂ d\nq looks like\ng(x)\n∂q dt\n∂x dt\nd ∂\nd\n=\nq =\n1 = 0\ndt ∂q\ndt\nAll but one of the remaining terms can be grouped to make d ∂ f such that\ndt ∂q\n∂ d\nd ∂\n∂\nf =\nf +\nf\n∂q dt\ndt ∂q\n∂q\n∂\nd\n⇒\nand\ndo not commute\n∂q\ndt\n∂\n∂ (∂q )-1\nNB:\n=\n∂q\n∂t ∂t\n\n6 Example\nLet's apply all that we have learned to a moderately complicated problem (5.3 in\nLL) to find the EoMs. Here we have a mass on a string attached to a rotating wheel.\nThe wheel rotates at a fixed angular velocity ω, and gravity acts on the mass m.\nx = a cos(ωt) + l sin φ\ny = -a sin(ωt) + l cos φ\nfind L = T - U\nU = -mgy and T = 1 m( x 2 + y 2)\nx\n= -aω sin(ωt) + l cos φφ\ny = -aω cos(ωt) - l sin φφ\n⇒ T = 1 m(a 2ω2 sin2(ωt) - 2aωl sin(ωt) cos φ φ + l2 cos 2 φ φ 2\n2ω2\nφ2\n+ a\ncos 2(ωt) + 2aωl cos(ωt) sin φ φ + l2 sin2 φ\n|\n{z\n}\n|\n{z\n}\n|\n{z\n}\na2ω2→ drop!\n2aωl sin(φ-ωt)φ\nl2φ 2\n\nNote:\nd\ndt(cos(φ - ωt)) = sin(φ - ωt)(ω - φ)\n⇒ sin(φ - ωt) φ = ω sin(φ - ωt) - d\ndt(...)\n| {z }\ndrop!\n⇒ T = 1\n2 m(2alω2 sin(φ - ωt) + l2 φ2)\nU = -mgy = mg(a sin(ωt)\n| {z }\nf(t)→drop!\n-l cos φ)\nThis finally brings us to the Lagrangian given in LL problem 5.3a (they give no\nexplanation!)\nL = ml(aω2 sin(φ - ωt) + 1 lφ 2 + g cos φ) [note units]\n⇒ Fφ = ∂L = ml(aω2 cos(φ - ωt) - g sin φ) [torque]\n∂φ\npφ = ∂L = ml2φ [Iω ⇒ angular momentum]\n∂φ\n\nFφ = p φ ⇒ φ = aω2 cos(φ - ωt) - g sin φ\nl\nl\nWhere in the last step I have made the E-L equation look like Newton's 2nd Law.\nfor tomorrow\n1. read LL 6-8\n2. finish pset 1 by class time!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Classical Mechanics II, Lecture 5 Full example and conservation of Energy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/723337f83a4d4d162c1ceafa0256d5d5_MIT8_223IAP17_Lec5.pdf",
      "content": "Lecture (5)\nToday: Conserved Quantities and Center of Mass\nFor Next Lecture\n1. read LL 9-11\n2. do problems 11-14\n1 Conservation of Energy\nIn 8.01 you encountered conservation of energy as an integral along the path of a\nparticle, which gave the work done on it.\n8.01 Energy Conservation\nZ 2\nZ t2\nd\nd~r\n~\nW12 =\nF · d~r =\n(m ~v) ·\ndt\ndt\ndt\n1Z\nt1\nZ\nt2 d~v\nt2 d\n= m\n· ~v dt = m\n(~v · ~v) dt\ndt\ndt\nt1\nt1\n= 2 m(v 2\n2 - v 2\n1) = ΔT\n\nSo the work performed lead to a change in kinetic energy. For a conservative force,\nwe can also relate this to the change in potential energy...\nZ 2\nZ 2\n~\nW12 =\nF · d~r =\n(-rU) · d~r = U1 - U2 = -ΔU\n⇒ ΔT = -ΔU ⇒ Δ(T + U) = 0\nE = T + U is conserved!\nIn the context of Lagrangian Mechanics and the PLA, on the other hand, no\nvector calculus is required. We need only assume that time is homogeneous, that is\nthat L has no explicit time dependence.\nLagrangian Energy Conservation\n∂L\ngiven ∂t = 0 i.e. time is homogeneous\nd\ndt L(q, q ) = ∂L\n∂q q + ∂L\n∂q q ← total time derivative\n⇒ dL\ndt = q d\ndt( ∂L\n∂q ) + ( d\ndtq ) ∂L\n∂q ← used E-L\n= d\ndt( q ∂L\n∂q )\n\n← used product rule\n\nd\ndL\n⇒ 0 = dt q d q - L\n⇒ E ≡ q ∂L\n∂q - L = constant in time\nhmm... did we really do anything there? Profoundly simple or totally vacuous?\n\nNote:\nT = 1\n2 m\nX\najkq jq k and L = T (q, q ) - U(q)\njk\n∂L\nX\nq i ∂q i\n= 2 mq i\njk\najk(δijq k + δikq i)\nX\n= 2 m\najk( qjq k + q kq j) = 2T\njk\n⇒ E = 2T - (T - U) = T + U\ngiven\nhomogeneous time and a conservative potential\nSo, conservation of energy is built into the E-L equations. As long as there are\nno time varying forces (e.g. external drivers) or velocity dependent forces (e.g.\nfriction) energy is conserved! (Actually velocity dependent potentials are ok, E is\nstill conserved, but E = T + U is not guaranteed! More on velocity dependent\npotentials later in the course.)\n2 Conservation of Momentum\nConservation of momentum, in 8.01, was found by integrating in time (rather than\nspace as we did for energy). With a single particle and no external forces, this is\nvery simple.\nConservation of Momentum\nZ\nZ\nt2\nt2\n~F dt =\np dt = Δp = 0 if F = 0 (in 8.01)\nt1\nt1\nSingle Particle Conservation of Momentum:\nd ∂L\n∂L\n∂L\n∂L\n(\n) =\n⇒\n= const if\n= 0 (in 8.223)\ndt ∂q\n∂q\n∂q\n∂q\nwe have already seen that we need only assume that space is homogeneous and\nisotropic to show that a free particle moves at constant velocity in Lagrangian Me\nchanics. What about a system of particles?\n\nX ~\nno external forces ⇒\nFn = 0\nn\nX\nX ∂U\n⇒\nrnU(~r1, ..., ~rN ) = 0 ⇒\n= 0\n∂~rn\nn\nn\n∂U\n∂U\n∂U\nNote: rnU(r~1, ..., r~N ) =\nxb +\nyb+\nzb\n∂xn\n∂yn\n∂zn\nThat is 8.01 style. Let's do this 8.223 style by requiring homogeneous and isotropic\nspace. (Homogeneity of a scalar field ⇒ constant ⇒ isotropic). If space is homo-\ngeneous, a small shift of all particle coordinates should not change the Lagrangian.\nL0\n~rn\n0 = ~rn + ~ε\n= L(~r 0 , ~r 0, t) =\nwhere ε is a small constant offset\nL(~r, ~r, t) +\nX\nn\n∂L\n∂~rn\n· ~ε + ∂L\n∂ ~rn\n· ~ε\n\n⇒ L0 - L =\nX ∂L · ~ε = ~ε ·\nX ∂L\n∂~rn\n∂~rn\nn\nn\nL0 - L = 0 ⇒\nX ∂L = 0\n∂~rn\nn\nThat is, the sum of generalized forces over all particles is zero.\nWhat about the total momentum of the particles? Summing E-L over particles:\n\nX\nX\nX\nd\n∂L\n∂L\nd\n∂L\n=\n= 0 ⇒\n= 0\ndt\n∂~r n\n∂~r n\ndt\n∂~r n\nn\nn\nn\nX\nX\n∂L\n~\n⇒ P ≡\n=\np~n = constant\n∂~r n\nn\nn\nSo the total generalized momentum is conserved in an isolated system (no external\nforces, homogeneous space).\n\nNote: unlike E, P does not depend on the interaction potential. It is just the\nsum of each particle's p~n.\n3 Conservation of Angular Momentum\nWe have seen that time invariance of the L leads to Energy Conservation, and\ntranslation invariance of L leads to Momentum Conservation. What about angular\nmomentum?\nAngular Momentum and Rotational Invariance of L\nx = x cos φ - y sin φ\ny 0 = y cos φ + x sin φ\nfor φ ≪ 1, sin φ ≈ φ, cos φ ≈ 1\nx 0 ≈ x - yφ , y0 = y + xφ\n\nz = z ⇒ ~ε =\n- yφ, xφ, 0\n\nL0 = L(~r 0 , ~r 0) = L(~r + ~ε, ~r + ~ε)\n= L(~r, ~r) - ∂L\n∂x yφ + ∂L\n∂y xφ - ∂L\n∂ x yφ + ∂L\n∂ y x\nRotational Invariance ⇒ L0 - L = 0\n⇒ 0 = φ( pyx + py x - ( pxy + px y))\n0 = φ d\ndt(pyx - pxy) for any small φ\n⇒ pyx - pxy = constant ⇒ Lz = constant\nNB: ~L = ~r × ~p ⇒ Lz = x py - y px\nInvariance to rotation about z-axis leads to conservation of z-component of angular\nmomentum!\nOf course there is nothing special about zb; invariance to rotation about any axis\nimplies conservation of angular momentum about that axis. If L is invariant to all\n~\nrotations about a point (e.g. the origin), then L is conserved.\n~\nif U(|~r|) \"central potential\", then L about origin is con\nserved\n~ ~\nNote that like E and P , L is additive and frame dependent.\n~\nLL uses M for AM, presumably to avoid confusion with Lagrangian. We\nwill use L~ as is customary.\n\n4 Center of Mass\nWhile both E and p are deeply meaningful quantities in physics, they both depend\non your choice of reference frame. There is, however, a \"special\" frame for any\ngiven system: the Center of Mass frame which has p = 0 and minimal Energy.\nCenter of Mass Frame\nPCM = 0 , ECM = Einternal = minimum energy\nTo investigate this, let's take 2 frames with relative velocity Δv\nv\n= vn + Δv velocity of the nth particle\nn\nX\nX\nP 0 =\nmn(vn + Δv) = P + Δv\nmn\nn\nn\nX\nP 0 = P + MΔv where M =\nmn\nn\nNote that LL uses μ for total mass and m for reduced mass. It is much more\ncommon to use M for total mass and μ for reduced mass. The velocity of the CM\nframe is\n~P\n~vCM =\nvelocity of CoM\nM\nP mn ~rn\n~\nn\nRCM =\nposition of CoM\nM\nThe potential energy of a system of interacting particles is unaltered by a change\nin reference frame (since only relative positions of the particles matter), but the\nkinetic energy changes with velocity.\nX\nX\nif T = 1\nmnvn ⇒ T 0 = 1\nmn(v~n + Δ~v)2\nn\nn\nX\nT 0 = 1\nmn(v + 2 v~n · Δ~v + Δv 2)\nn\n~\n= T + MΔv 2 + Δ~v · P\n\nIf the initial frame was the CoM frame with P~ = 0, then\nif P~\n= 0, (i.e. start in the CoM frame) then\nT 0 = T + MΔv\nSuch that the CoM frame is the one with minimum energy.\nFor a wide array of physics problems, the first step to a solution is a move to\nthe CoM frame.\n5 Frame Dependence of L~\nL~ = ~\n~\n~\n~\nLi + Rcm × P , where Li is the AM in the CoM frame\nSo like energy total AM may be non-zero in the CoM frame. Unlike energy,\n~\nthere exists a frame with L = 0, though I don't know how it is used or called...\n\nLet's back up a moment and look at the big picture. For any isolated system of\n~\ninteracting particles we have 7 conserved quantities (E + P + L~). By \"isolated\"\nI mean the Lagrangian doesn't depend on location, orientation or time. This is\ntrivially true if the potential depends only on the relative positions of the particles\n(e.q. due to gravity or electric charge).\n6 Homogeneous and Isotropic\nHomogeneous and isotropic space\nU(r~1, ~r2) = α|r~1 - r~2|2\nHomogeneous, but NOT isotropic (vector field only)\n~F (r~1, ~r2) = α xb\nuniform force in xb direction\nIsotropic about origin (NOT homogeneous)\nU(r~1, ~r2) = αr1\n2 + βr2\ncentral force, origin is special\nFor Next Lecture\n1. read LL 9-11\n2. do problems 11-14\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Classical Mechanics II, Project Analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/331a40a60553565646774fd4c31a0f3f_MIT8_223IAP17_ProjectPart1.pdf",
      "content": "Part 1: Analysis\nHere are several parameters you will need (see figure 2):\nm1\nmass of counter-weight\nm2\nmass of projectile\nmb\nmass of beam\nIb\nmoment of inertia of beam about its center of mass\nl1\ndistance from pivot to counter-weight\nl2\ndistance from pivot to sling attachment\nls\nlength of sling\nφb0\nstarting beam angle (∼3π/4)\nφs0\nstarting sling angle (∼π/2)\nTo keep things simple, assume that the sling is massless and that it is always under tension so that its\nlength is constant. Also, to avoid unnecessary complexity, treat the counter-weight and the projectile as\npoint masses, and assume that both masses are released from rest at t = 0.\nFigure 2: Simple trebuchet parameter description.\n1. We'll start by treating the trebuchet as a black box and think only about the energy involved.\n(a) Calculate the maximum range, given that all of the potential energy of the counter-weight, U0 ≈\nm1gh, is transferred to kinetic energy of the projectile. That is, compute dmax as a function of\nm1, m2, g, and h. For this calculation, treat the machine as a black-box, and consider only energy\n\nconservation. (Ignore the potential energy of the projectile, air resistance and the launch height\nof the projectile.)\n(b) Given that all of the available potential energy of the counter-weight is transferred to the projectile,\n\nwhat are φb and φb at the moment the projectile is released?\n(c) To do the maximum range calculation more correctly, you should include the mass of the beam in\nthe potential energy calculation (i.e., if the beam is long and heavy, with l2 ≫l1, it will require\na lot of energy just to lift the CoM of the beam). Furthermore, the distance the counter-weight\nfalls before reaching the bottom of the swing at φb = 0,\nh = y1(t = 0) + l1 = l1(1 -cos φb0)\ndepends on its starting angle φb(t = 0) = φb0. Compute the available potential energy U0, and\nfrom it dmax, given the parameters of the trebuchet in the table in part 1, assuming an initial\nbeam angle φb0 (starting from rest). (As before, ignore the potential energy of the projectile, air\nresistance and the launch height of the projectile.)\n2. Write the kinetic and potential energy (T and U) for the trebuchet in terms of the Cartesian coordinates\nof the counter-weight (m1) and the projectile (or \"payload\", m2), and the beam angle (φb), along with\nwhatever constants you need (e.g., lengths, masses, gravity, etc.).\n3. Write the Lagrangian for the trebuchet in terms of only the angular coordinates φb and φs and constants\n(i.e., without individual cartesian coordinates).\n4. Compute the equations of motion for φb and φs and simplify them to the form\nφb\n=\nαbf(φb -\n\nφs, φs, φs) -ω2\nb sin φb\n(1)\n\nφs\n=\nαsf(φs -\n\nφb, φ\nb, φb) -ωs sin φs\n(2)\nto find the 3 argument function f(a, b, c) and the 4 constants α{b,s and ω\n}\n{b,s .\n}\n(These equation of motion are hard to solve analytically, so I'm not asking you to do that here.)\n5. Solve the equations of motion for l2 = 0 to find φb(t) and φs(t) for small values of φb and φs. (This is\nnot a functional trebuchet, but it is something you can solve.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Classical Mechanics II, Project Follow Through",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-223-classical-mechanics-ii-january-iap-2017/69a3051b16e4bb531e5035a8d4ae7d81_MIT8_223IAP17_ProjectPart2.pdf",
      "content": "Part 2: Follow Through\nThere are a few different options for part 2, depending on what you want to do. Pick one of the following:\n1. Experimental\nBuild a small trebuchet and demonstrate that it works. For this part, you can work in a small group\n(up to 4 students), and the demonstration can take the form of a video showing your group and a\nfunctional trebuchet.\nBE SAFE. Keep the scale of your demonstration small (∼1m max), and do NOT fire any-\nthing dangerous. Think squash ball or racquetball ball, and at most tennis ball (because\ngolf balls are too hard).\nOne of these might be a place to start:\nhttp://www.wikihow.com/Build-a-Trebuchet-(1-Meter-Scale)\nhttp://www.instructables.com/id/Trebuchet-Project/\nhttp://www.stormthecastle.com/trebuchet/how-to-make-a-trebuchet-out-of-popsicle-sticks.htm\nhttps://www.youtube.com/watch?v=Cm-AZSkzdxo\nMeasure the distance the projectile travels, and compute the \"distance efficiency\" (i.e., εd = dmeasured/dmax).\nCompile this information into a brief report which includes the parameters of your trebuchet (lengths,\nmasses, approximate starting and launch angles, etc.). Your score for this part will be 200 × εd\nor 100, whichever is smaller, such that you will need to achieve εd = 0.5 to get full credit.\n2. Numerical\nDesigning a trebuchet that works well is not easy.\nYour job is to optimize the trebuchet length\nparameters with the goal of maximizing the energy transfer to the projectile.\nUse Mathematic,\nor your favorite program to compute the velocity of the projectile at the\npoint of release. For the sake of this calculation, assume that the release happens when v2x = v2y, that\nis, when it is moving up at 45*.\nYou should assume that the beam is uniform so that its mass is\nmb = λ √m1 (l1 + l2) ,\nλ = 1\n√kg\nmeter\nNote that the thickness of the beam scales with the square-root of the mass of the counter-weight.\n(The value of λ given above is roughly what you need with wood to keep it from bending too much.)\nFrom this, and treating the beam as a thin rod (i.e., of negligible cross-section), you can compute Ib\nfor any choice of l1 and l2.\nTo set the scale, assume a 30kg counter-weight and a 1kg projectile.\nYour objective is to find a collection of parameters (l1, l2, ls), so that the energy transfer to the projectile\nis maximized. You can quantify this by computing the expected \"energy efficiency\" εE = Eprojectile/U0.\nYou should be able to find parameters which give εE > 0.5 and a projectile velocity v2 > 20m/s.\nInclude with your optimized parameters plots of the motion of the trebuchet, similar to figures 4, 5\nand 6, and the code you used to do the work.\nNote: if you want to modify the starting angles φb0 and φs0, that is fine too, but you can also just\ntake the values given in the table to reduce the number of parameters you need to think about in the\noptimization. In any case, assume that both masses are released from rest at t = 0.\nMATLAB ,\n(r)\n\n3. Analytical\nMedieval engineers did not have computers. Can you find an optimal design with pencil and paper?\nLet me say up front that this is by far the hardest option for part 2. I eventually found an answer by\ncareful choice of coordinates and separation of the motion into multiple phases in which I could make\nreasonable approximations for various trig functions. I also cross-checked my approximations against\nnumerical solutions, so weed out the bad ones.\nShould you choose to accept this mission, your objective is to find values of the sling and beam lengths\n(ls, l2) which maximize the kinetic energy of the projectile for a given m1, m2, and l1. Assume that the\nstarting angles are φb0 = 3π/4 and φs0 = π/2 and that the system starts at rest. As in the numerical\nsection, you should assume that the beam is uniform with mass\nmb = λ √m1 (l1 + l2)\nand use this to compute Ib for any choice of l1 and l2 given m1 and λ.\n4. Optimal\nThe best trebuchets have a hinged counter-weight and wheels. The wheels aren't just there so that\nyou can move it, they are there because otherwise the hinged counter weight puts huge stresses on the\nframe (and wastes energy bouncing around its maximum achievable radius).\nHere are the additional/modified parameters you will need (see figure 3):\nmf\nmass of frame\nl1\ndistance from pivot to counter-weight attachment point\nlw\ndistance from the beam to counter-weight\nφw0\nstarting counter-weight angle (∼0)\nxf0\ninitial horizontal position of the frame (= 0)\nAssume that the wheels work perfectly so that the frame and pivot are free to move horizontally\nwithout friction.\n(a) Along the lines of problem 1 in part 1, compute the maximum energy efficiency of this design\nεE = Eprojectile/U0\nwhere Eprojectile is the final projectile kinetic energy and U0 in the initial stored potential energy\nrelative to the minimum potential state (hint: consider conservation of momentum as well as\nenergy). Continue to assume that the projectile launches at 45 degrees, and that you can neglect\nfriction, etc as in part 1.\n(b) Compute the Lagrangian of wheeled trebuchet and the resulting equations of motion (similar to\nproblems 2 - 4 in part 1).\n\nFigure 3: Wheeled trebuchet parameter description. Note: the projectile is still m2.\n\nFigure 4: Motion of an example trebuchet. The angles used in the Lagrangian are shown, along with the\nCartesian coordinates of the counter-weight and the projectile.\n\nFigure 5: The velocity of the projectile is shown, along with the kinetic energy of the counter-weight and\nprojectile relative to the stored potential energy.\n\nFigure 6: A parametric depiction of the trajectories shown in figure 4.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n8.223 Classical Mechanics II\nJanuary IAP 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}