{
  "course_name": "Cognitive & Behavioral Genetics",
  "course_description": "How genetics can add to our understanding of cognition, language, emotion, personality, and behavior. Use of gene mapping to estimate risk factors for psychological disorders and variation in behavioral and personality traits. Mendelian genetics, genetic mapping techniques, and statistical analysis of large populations and their application to particular studies in behavioral genetics. Topics also include environmental influence on genetic programs, evolutionary genetics, and the larger scientific, social, ethical, and philosophical implications.",
  "topics": [
    "Science",
    "Biology",
    "Genetics",
    "Neuroscience",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Science",
    "Biology",
    "Genetics",
    "Neuroscience",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nDescription\n\nHow genetics can add to our understanding of cognition, language, emotion, personality, and behavior. Use of gene mapping to estimate risk factors for psychological disorders and variation in behavioral and personality traits. Mendelian genetics, genetic mapping techniques, and statistical analysis of large populations and their application to particular studies in behavioral genetics. Topics also include environmental influence on genetic programs, evolutionary genetics, and the larger scientific, social, ethical, and philosophical implications.\n\nCourse Structure\n\nLectures 1, 2 and 4 will be given by the course directors in the traditional format and will cover background rationale for the course material, an introduction to the course topics, and the basic genetics and molecular biology necessary for understanding these topics.\n\nAll other lectures will begin with a 10-minute introduction by a course director, followed by discussion of several topics; each led by two students. All students will be required to read the assigned material for each lecture and to participate in the ensuing discussion. Topic leaders should research material beyond the literature provided.\n\nQuizzes\n\nTo assess the degree to which course participants have effectively mastered the reading material, each class will begin with a short 10-minute quiz.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nQuizzes\n\n20%\n\nPaper\n\n40%\n\nOrganizing and leading discussion\n\n30%\n\nParticipation\n\n10%",
  "files": []
}