{
  "course_name": "Comedy",
  "course_description": "This course looks at comedy in drama, novels, and films from Classical Greece to the twentieth century. Focusing on examples from Aristophanes, Shakespeare, Cervantes, Molière, Wilde, Chaplin, and Billy Wilder, along with theoretical contexts, the class examines comedy as a transgressive mode with revolutionary social and political implications. This is a Communications Intensive (CI) class with emphasis on discussion, and frequent, short essays.",
  "topics": [
    "Humanities",
    "Literature",
    "Comedy",
    "Comparative Literature",
    "International Literature",
    "Humanities",
    "Literature",
    "Comedy",
    "Comparative Literature",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWhy study comedy? To be able to recognize it? But generally we know comedy when we see it. To learn how to produce it ourselves? But the best comedy often seems unreproduceable. To understand it better? Again, we don't usually have trouble \"getting\" comedy, and as with other forms of pleasure, we may suspect that too close analysis will ruin the delight. This class will not help you recognize, understand, or produce comedy more adeptly than you do now.\n\nRather it considers the history of comedy as a genre and as a tradition in drama, narrative, and film. That history, spreading over 2000 years, tells us a great deal about human modes of expression over time. We will note certain continuities: an interest in the body as object and source of rebellious pleasure, a pattern of transgression against social norms corrected and reordered through laughter, a fascination with the possibilities and limits of verbal play and wit, a concern with identity and mistaken identity, an opportunity for political protest and reform. As the class develops, we will also note the ways writers appropriate and reshape comic plots and structures from the past for their own uses.\n\nThis is a HASS-D--CI class. Like other communications-intensive classes in the humanities, arts, and social sciences, it allows students to produce 20 pages of polished writing in four assignments, one of which is a required revision. It also offers substantial opportunities for oral expression, through student-led discussion, class reports, and class participation. The class has a low enrollment that ensures maximum attention to student writing and opportunity for oral expression, and there is a writing specialist available for consultation on drafts and revisions.\n\nThis is also an intermediate level class in Literature where you will be expected to meet certain requirements independently and responsibly. Be sure to budget time for the required film showings and conferences with the writing specialist and professor and for meetings with your in-class report team. Note also the rapid pace at which we proceed with the plays in the first part of the syllabus; we will be reading these quickly to identify certain characteristic plots and themes in early comedy more than to pore over details. The essay topics assume experience in reading and writing about literature at the college level.\n\nSchedule of Reading and Writing\n\n[It is crucial that you read the whole text (or as much as possible of a novel or longer work)\nbefore\nthe date assigned so as to be prepared for class discussion and able to make decisions about your essay topic before meeting with the writing specialist.]\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nPart I. Classical comedy: the physics and metaphysics of error\n\nAristophanes,\nLysistrata\n\nAristophanes,\nLysistrata\n(cont.)\n\nFilm screening:\nSome Like It Hot\n\nPlautus,\nThe Brothers Manaechmus\n\nShakespeare,\nThe Comedy of Errors\n\nEssay 1 (3 pages) due after five days\n\nLibrary research workshop\n\nPart II. Comic love: sex, violence, and instanity\n\nShakespeare,\nThe Taming of the Shrew\n\nFilm screening:\nBringing Up Baby\n\nShakespeare,\nTwelfth Night\n\nShakespeare,\nTwelfth Night\n(cont.)\n\nFilm screening:\nTwelfth Night\n\nMoliere,\nThe Misanthrope\n\nBehn,\nThe Rover\n\nFilm screening:\nRidicule\n\nAphra Behn,\nThe Rover\n(cont.)\n\nEssay 2 (7 pages) due after two days\n\nPart III. Satire and wit in dark times\n\n12-14\n\nAusten,\nPride and Prejudice\n\nEssay 2 revision (7 pages) due after two days of Ses #14\n\n15-16\n\nTwain,\nPudd'nhead Wilson\n\nWilde,\nThe Importance of Being Earnest\n\nFilm screening\nThe Importance of Being Earnest\n\nWilde,\nThe Importance of Being Earnest (cont.)\n\nFinal essay conferences\n\n20-21\n\nCalvino,\nCosmicomics\n\nBechdel,\nFun Home\n\nFilm screening\nModern Times\n\nBechdel,\nFun Home (cont.)\n\nConclusion\n\nEssay 3 (10 pages) due\n\nCourse Expectations\n\nAttendance, Participation, and Oral Communication (30%)\n\nThis is a discussion course where your attendance and participation in class are vital to your success and that of the group.\n\nAttendance (10%): You are expected to attend every class and film showing. Do not sign up for this course if you have a conflict with another class, recitation, sports commitment, or job. If you must miss class because of a medical or family emergency, you should notify me of the fact by phone, e-mail, or in person by the time of the class.\n\nYou must explain all absences. Two will not be held against your grade, unless they are unexcused. Any absence beyond those two deducts percentage points directly from your final grade (three for the third, four for the fourth, etc): two latenesses count as one absence. Repeated absences will lead to a formal warning and may end in your being dropped from the class.\n\nClass participation (10%): This class is designed to challenge oral communication as well as writing skills. Be prepared to contribute to class discussion, not only by speaking but also by listening and responding well to others. Every student is expected to contribute to class discussion by submitting a weekly comment or question to the class Web site discussion forum. These will provide starting points for group discussion.\n\nIn-Class report (10%): Each student, working in a group, will prepare and deliver a 10-15 minute in-class report on one day's reading. This report should include research, drawing on materials from print and online sources (1-3 of each) and presenting a bibliography, on a handout to be distributed to the class. It should also raise questions and offer ideas for class discussion. You will submit an outline, bibliography, and any supporting materials and will be graded on your content and also on your delivery and ability to generate class discussion.\n\nWritten Work (70%)\n\nEssays and revision (10%, 15%, 20%, 25%):\nEssays are due at the beginning of class on the day assigned\n. You must hand in something, even if you do not consider it your very best, in order to receive credit for the assignment.\nLate essays (only with an extension from me) will receive credit, as long as they come in by the following class. After that they will drop a full grade for each day late\n.\n\nFormat: Essays must be typed or word-processed, double-spaced, and adequately margined, should include a title, and need to observe the conventions of grammar and spelling.\n\nUse of sources / Plagiarism: Use of old course essays or notes,\nCliff's\nor\nSpark Notes\n, essays posted on Web sites, or other sources without correct attribution constitutes plagiarism. Plagiarism--the use of words, ideas, or efforts of others without acknowledgment--is a serious academic offense and will be brought to the attention of the Committee on Discipline. In this class you will practice research skills and learn responsible uses of information. The essay topics encourage but do not require you to use outside sources; they are critical readings of literary texts, representing your own thinking and developing your own arguments. Use correct MLA Works Cited format.\n\nThe Literature Faculty have stated their policy on plagiarism as follows:\n\nPLAGIARISM--the use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work.\n\nFor further guidance on the proper forms of attribution (MLA Works Cited format) consult the style guides available in the\nWriting and Communication Center\n, and their Web site on Plagiarism.\n\nConferences: Each student will meet with the writing specialist to go over drafts for essays and the revision; these meetings will be scheduled as soon as possible in the beginning of the term. Students will also meet with the instructor at least once during the term to discuss essays and writing. Other conferences are strongly encouraged, and you may also consult the Writing and Communication Center.\n\nFilms\n\nScreenings take place Wednesday evenings outside of normal class time. Attendance is required. If you want to re-view the films, you can check out copies from the Humanities Film Office.\n\nThe films screened are:\n\nSome Like it Hot\n. Directed by Billy Wilder, 1959.\n\nBringing Up Baby\n. Directed by Howard Hawks, 1938.\n\nTwelfth Night\n. Directed by Trevor Nunn, 1996.\n\nRidicule\n. Directed by Patrice Leconte, 1996.\n\nThe Importance of Being Earnest\n(earlier version). Directed by Anthony Asquith, 1952.\n\nModern Times\n. Directed by Charlie Chaplin, 1936.",
  "files": [
    {
      "category": "Resource",
      "title": "Cheer Up, Emo Kid: Molière's Commentary on Human Nature in The Misanthrope",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-421-comedy-spring-2008/dff1897da8164789ac9b7fbc325b3f7c_pittore_misanthr.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.421 Comedy\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nCheer Up, Emo Kid\nMoliere's Commentary on Human Nature in The Misanthrope\n\nEmily Pittore\n3/19/08\n21L.421\n\nFrom the title of the play, which lets the audience know what to expect of the main\ncharacter, to the end, Moliere's The Misanthrope is a character study. He experiments with\nhuman nature by placing a man who is the epitome of a particular trait into society, and\nrecords the results. In this case it is Alceste, whom he places in the middle of the French\naristocracy. It is the ending of the play that really showcases Moliere's experiment. Moliere\nappears to end the play without a definite conclusion. The conflicts of Alceste's lawsuit and\nhis courtship of Celimene, which are brought up at the beginning of the play, are both\nresolved in Act V. However these resolutions are merely wrapping up the plot elements\nbefore play finishes; they are not important by themselves. Instead Moliere uses the\nunexpected break between Alceste and Celimene and the open ending to imply that everyday\nevents are unimportant compared to a man's character.\n\nDespite being the title character, Alceste does not have much depth. Nor do any of the\nother characters. This is not a deficiency of the play. Instead it allows the audience to focus\non the immediately apparent and most pertinent characteristics of the characters. Moliere\ndraws on medieval medicine to emphasize this point. In medieval times, a person's character\nwas supposedly determined by the balance of four humors - blood, yellow bile, black bile,\nand phlegm. This method of determining personality is very straightforward. An excess of\nany humor would create a certain personality. Philinte uses this idea when he tells Alceste\n\"My phlegm's as philosophic as your spleen\" (Moliere, 23). Alceste's \"spleen\", where black\nbile was produced, is what defines his personality, whereas Philinte's personality is\ndominated by phlegm. Moliere is unconcerned about character traits that may only reveal\nthemselves under certain circumstances. He is interested in the one trait that stands out, in\nthis case Alceste's spleen and Philinte's phlegm.\n\nWithin each of the male and female casts of characters, there is a spectrum of\npersonalities. Among the male characters, Alceste is one extreme. He is a misanthrope, loudly\n\nagainst all of society. Alceste's friend Philinte is in the middle. He has a very moderate\nnature, neither specifically upholding current society nor damning it. Oronte's personality and\nactions contrast those of Alceste. He is also loud, like Alceste, but he uses society instead of\nrailing against it. Within the female caste, Arsinoe, \"the prude\", is one end of the spectrum\n(27). She is not a misanthrope to the degree Alceste is, but she scorns much of society in her\nown way. The middle ground is provided by Eliante, who is \"honest\" but still well respected\namong other aristocrats, unlike Alceste who is criticized for his frankness (27). On the other\nextreme end of the spectrum is Celimene, who personifies the gregarious aristocratic society.\nThe conflicts throughout the play serve to demonstrate these traits.\n\nAlceste's defining trait is his misanthropy. This brings about the first of the conflicts in\nthe play - Alceste's undescribed lawsuit. His misanthropy has brought him into a conflict that\nis to be settled in court. Moliere uses the lawsuit to show how proud Alceste is about his\ncontrary nature. Alceste refuses to dispute the case, and knows he will probably lose even if\nhe tries to uphold his point in court. He claims his lack of action will demonstrate that his\npoint of view of humanity is true because \"the justice of [his] cause is clear\". He believes he\nshould win the case because he is doing the right thing according a higher power than the\ncorrupt society he lives in. He believes he has such abstract concepts as morality and justice\non his side, so if he loses it will prove that \"men are sufficiently base/ And impudent and\nvillainous and perverse / To do [him] wrong before the universe\" (26). By taking no action,\nhe can blame the outcome on humanity, not on his own skills or lack thereof in court. Thus he\nuses the lawsuit against him to prove his misanthropy is justified.\n\nPhilinte's moderate nature, on the other hand, prompts him to try to convince Alceste\nto argue the lawsuit in court. Philinte does not necessarily condone society's actions, but he\nwants Alceste to learn to live with it. Alceste refuses outright, displaying his stubbornness. If\nAlceste conceded to go to court, he would be playing society's game, and associating with its\n\ncorruption. He would rather have society consider him disgraced due to a lost lawsuit than\ndisgrace himself in his own eyes by playing along with what he believes to be corrupt.\nPhilinte's attempt to persuade Alceste that a more moderate course of action might be\nnecessary demonstrates his position in the middle of the personality spectrum.\n\nOronte provides the final end of the spectrum. While Alceste refuses to settle an\nargument using society's rules, Oronte takes advantage of them. After Alceste gives Oronte an\nhonest opinion on his sonnet, Oronte takes offense. He calls up the Marshals to \"arbitrate the\nmatter\", thus making an personal disagreement between two men a public affair, and bringing\nit to society's attention (73). While Oronte was not involved in the original lawsuit, he helps\ndemean Alceste after it is decided in the other man's favor by \"lend[ing] his credit to . . . [a]\nlibelous tale\" (130). He uses gossip, rather than confronting his antagonist directly as Alceste\nwould do. Oronte's actions show him to be one who takes advantage of society, rather than\none who forces himself against it.\n\nThe lawsuit allows all three male characters to display their particular characters, but\nthe lawsuit itself is very obviously insignificant. The audience never learns what it is about or\nwho started it. After Act 1 t is not mentioned again until Act 5 when Alceste tells Philinte\n\"justice is mocked, and I have lost my case\" (129). The verdict of the lawsuit provides\nanother opportunity for Alceste's character to reveal itself. Although in Act 1 he claims \"[he]\ncould wish, whatever the cost,/Just for the beauty of it, that [his] trial were lost\" he does not\nseem to appreciate the beauty of the moment when he actually loses the case (26). Instead the\nverdict prompts him to finally declare his self exile, so that the \"treacherous and savage race\nof men/ . . . shall not look upon [his] face again\" (130). His ultimate action as a misanthrope\nis to give up entirely on humanity. While in the beginning of the play he hopes that society\nwill recognize his way of life as correct, after he loses his lawsuit he realizes that society\nwon't change. The conclusion of this conflict provides a reason for Alceste decide that the\n\nonly way he can fully express his hatred for human society is to leave it.\n\nPhilinte once again displays moderation, by trying to convince Alceste that he should\nnot go into exile. His final lines, \"let's do everything we can/ To change the mind of this\nunhappy man\" do not sum up the play as the audience might expect a final couplet to do, but\nare rather a call to action (152). They imply that the events of the play continue beyond what\nan audience sees performed. As long as Alceste continues to be contrary, more can happen.\nUsing these lines, Moliere shows that a man's character counts more than any event, because\nwhile resolving events has caused the play to come to its conclusion, the unresolved nature of\nAlceste's misanthropy leaves the play open ended and ready to continue.\n\nWhile the men display more of their character when the issue is the lawsuit, among\nthe women, it is Alceste's courtship of Celimene that allows them to show off their\npersonalities. Alceste's analogue among the female characters is Arsinoe. Philinte tells\nAlceste that Arsinoe \"admires [him]\", which associates the two characters. However because\nAlceste is courting Celimene, Arsinoe \"seems to think [Celimene has] lured him from her\nside\" (86). Like Alceste, she speaks against society. Celimene explains that \"she's always in a\njealous rage/ against the faulty standards of the age\" (86). However while Alceste's defining\ncharacteristic is misanthrope, Arisonoe's discontentment stems from jealousy.\n\nEliante does not have many lines, but Moliere still uses Alceste's courtship to show\nher moderation. Philinte presents her as an alternative to Celimene because she is \"honest\",\nand Eliante herself says that she is \"all for those who frankly speak their mind\" (27, 139).\nHowever she is not quick to anger like Alceste, and like Philinte acts as a moderator. When\nAlceste is upset over the contents of Celimene's letter, it is Eliante who pleads \"do try, Sir, to\nregain your self-control\" (107). Within the conflict between Alceste and Celimene, she tries\nto keep the emotions at a moderate level.\n\nDespite Eliante's calming influence, Celimene remains at the extreme social end of the\n\nspectrum. Within the frame of the courtship, she leads on four different suitors, never telling\nany of them what she really thinks. While the play does not try to confront Alceste's\nmisanthrope, Celimene's flirtatiousness is ended in Act 5. After reading a letter in which she\nfrankly discounts each suitor in turn, all of her suitors turn away from her.\n\nThe courtship between Alceste and Celimene is an attempt at partnering misanthropy\nwith the heart of society. Celimene's letter also reveals this pairing. She is attempting to mix\nfrank opinions with her social life, and it is ultimately her undoing. Although most comedies\nwould end with the main characters getting married, Alceste and Celimene do not. After\nreading Celimene's letter, Acaste, Clitandre, and Oronte all drop their suits. Oronte tells\nAlceste directly \"Sir, she is yours; I'll seek no more to stand/ between your wishes and this\nlady's hand\" (145). Even Celimene offers herself to Alceste, saying \"but if my hand in\nmarriage will content you, / why, there's a plan which I might well consent to\" (150).\nAccording to all the traditions of comedy, everything has been set up to conclude this\ncourtship with marriage. However it is instead resolved when Alceste declares \"I detest you\nnow\" and finalizes their separation (150). By ending the play with this rupture Moliere shows\nthat natures which conflict cannot ever be reconciled in a fairy tale ending, no matter how\neasy it is to set up. Thus the personalities of individuals are worth more than any set of\nevents.\n\nAt the end of The Misanthrope, Moliere leaves the main characters unmarried and\nleaves the end of the play very vague. He chooses to focus on the personalities of the\ncharacters rather than what they say or do. By leaving the play open ended, and Alceste\nunmarried, he opens the future up to interpretation. Many traditional comedies follow a\npattern which starts in civilization, moves to the wild, and then returns to civilization to\nconclude the play. At the end of The Misanthrope, Alceste is preparing to leave civilization in\nfavor of exile. It's as if Moliere has written the first act of the play and invites us to make our\n\nown conclusion about the nature of mankind.\n\nBibliography\n\nMoliere, The Misanthrope. Orlando: Harcourt, 1993.\n\nnote: because this edition did not provide line numbers, I found that it was more informative\nto provide the page number in parenthetical citations rather than the act and scene.\n\nAcknowledgments\n\nLouise Harrison Lepera\n\nJennie Davidow"
    },
    {
      "category": "Resource",
      "title": "Gender Role Reversal in Twelfth Night and The Rover",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-421-comedy-spring-2008/f72b28e94f63b47c2ce888a58ad03d06_perko_essay2rev.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.421 Comedy\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAshley Perko 1\nGender Role Reversal in Twelfth Night and The Rover\nThe confusion unleashed by disguise in comedy creates a space in which social\nboundaries are suspended. When identities are obscured, there is an unparalleled freedom\nfor female characters to test the limits of their power in courtship. In Twelfth Night,\nShakespeare has complicated the gender roles of the relationship between Viola and\nOlivia by cloaking Viola as male. Her identity almost throughout is double-gendered, and\nromantic frustrations she feels as Viola in longing for Count Orsino leak into her\naudiences with Olivia as Cesario. The respect and friendship she feels for Olivia as a\nwoman fuse with the latent desires of her heart to create in Olivia's eyes the irresistible\nillusion of an admirer. The fact that she plays both a male and a female part allows\nShakespeare to test the limits of the female role in courtship. The situation is different in\nThe Rover. Hellena is always a woman, but her masks allow her to employ her femininity\nmore assertively. Her actions are a more naked example of the empowered female,\nbecause courts a man, not just a woman in disguise. Taken together, the two plays give\nnuanced illustration of the interaction between the sexes in love.\n\nThe situation of their meeting would not at first seem propitious for an intimacy to\nform between Viola and Olivia. Olivia is mourning the loss of her dear brother; Cesario is\nan emissary from an unwanted suitor, and is only begrudgingly granted admittance.\n\"Most radiant, exquisite and unmatchable beauty-\" (I, v, 170) she begins in solemn\nattention to her text. This praise is contrived and stilted, unlike the free and\nconversational tone that usually distinguishes Viola's diction. The break signals an abrupt\ntransition into candor, where she reveals she has \"taken great pains to con\" praise like\nthat above (I, v, 174). Viola's sharp wit has quickly revealed itself. She attempts to recite\n\nAshley Perko 2\nthe verses that Orsino has entrusted to her, but her embellishments soon distract Olivia's\nattention from any thoughts of Orsino. Olivia has had too much of the coolly composed\nlove declarations characteristic of the Duke, and Cesario's own remarks make a lively\ndeparture from Orsino's verse. Viola continues to ad-lib, with the consequence of\nundermining Orsino's suit by mocking its seriousness. \"Alas, I took great pains to study\nit, and/ 'tis poetical,\" (I, v, 194-5) she says of his text, again associating the reading of it\nwith suffering. Unknowingly she has touched on how Olivia views Orsino's advances as\noppressive, and unwittingly presents herself as an alternative.\nCesario is Orsino's opposite to Olivia's eyes. He is youth, energy, to his age,\ngravity, and pedantry. \"Good / beauties, let me sustain no scorn; I am very / comptible,\neven to the least sinister usage,\" she jests (I, v, 174-6). Cesario's self-deprecating manner\noffers a contrast to the proud nature of Orsino's suit. In begging the ladies not to mock\nher, she acknowledging her place below them, empowering Olivia in a way that Orsino\ncould not, given his high birth and haughty bearing. The experience of Orsino's suit has\nmade Olivia feel strongly the limitations of the female part in courtship. In response to\nhis advances, she may only consent or attempt rebuff; she may not shape the course of\nthe relationship. In Cesario, though, she can perceive something feminine in looks and\nmanner that make her feel that she has the power to dictate the terms of the acquaintance.\nBy feminizing the male suitor, Shakespeare explores the rich implications of a woman\ndominating the relationship. Olivia's actions in courting Cesario would subvert the\ntraditional gender framework if Cesario were really a man, but because of the female\ngender backdrop, Olivia's assertiveness is less provocative and more comic.\n\nAshley Perko 3\nThere are doubtless few examples of female reversal in courtship as vivid as that\nin Twelfth Night. However, a shade of this theme can be found in The Rover. Here also\ndisguise has a liberating effect on Hellena's pursuit of Willmore. When the pair first\nmeets, Hellena is dressed as a gipsy. This does not quite give her the social clout of man\nlike Viola's disguise does in Twelfth Night, but it does relieve some of the constraints of\nmodesty that she would have as a noblewoman. Gipsies are transient and live outside the\nconventions of class. Their transgressions are acceptable because they do not threaten the\nsocial hierarchy. Thus the gipsy facade allows her flirtations to be more pointed and\nmakes the courtship more of a two-way affair. Hellena is at least Willmore's equal in\nwooing. This augmentation of female power in courtship, though derived in this case by a\nsubversion of social boundaries rather than those of gender, results in a dynamic of parity\nsimilar to the one found in the Viola-Olivia relationship.\n\n\"Sister, there's your Englishman, and with him a handsom proper Fellow--I'll to\nhim, and instead of telling him his Fortune, try my own,\" Hellena says upon seeing\nWillmore for the first time (I, ii, 123-5). She is aware of the social license her garb\nprovides her, and she is confidently prepared to use it to pursue him. Willmore\nacknowledges the greater sexual freedom of the gipsies before the two even meet:\n\"Gipsies, on my life. -Sure these will prattle if a man cross their hands,\" (I, ii, 126-7).\nHellena indeed does prattle, quickly employing her incisive wit to gain hold of the reins\nof the conversation. She is not afraid to insult him, noting in him \"a certain forward\nImpudence, which does not displease me at this time\" (I, ii, 135-6). This appraisal could\njust as easily apply to her. If he is forward in accosting her, she is equally forthright in\nparrying his words with barbs of her own. \"Have a care how you venture with me, Sir,\n\nAshley Perko 4\nlest I pick your Pocket, which will more vex your English Humour, than an Italian\nFortune will please you,\" she replies to his advances (I, ii, 130-2). Such a threat, though\nplayful, is a more aggressive response than what would be expected from a woman. Her\ndirective manner is more akin to the traditionally masculine role in courtship.\nFrom the first, Olivia also seems to assume the more masculine role. Her social\nrole as head of the household creates a position of power over the youth Cesario, even\nthough Olivia is a woman. She sustains this dominant role with strong interrogatives that\npepper the discourse. The staccato of her questioning lends the conversation a playful\ntone, but it is clear that she is leading the way, much like Hellena. Before Viola can begin\nto recite her message, Olivia interjects, \"Now, sir, what is your text?\" (I, v, 220). Viola\ncan only respond, and hope to answer satisfactorily. Olivia immediately puts her on the\ndefensive and successfully prevents her from reciting Orsino's message. She also uses\nher sexuality to her advantage, unveiling her face with the assured and flirtatious, \"Is't\nnot well done?\" (I, v, 235). She knows the power of her beauty over men, and wields it\nagainst Cesario.\nAs their audience comes to a close, the relationship between Olivia and Viola\nmoves to a different level with Cesario's love declaration to Olivia. Though she is\nspeaking hypothetically, the passion of this speech is without match for much of the play.\nThis cannot be explained simply regarding it as a particularly well-crafted example of\nwhat a lover might say. Viola is professing these sentiments as a lover, not of Olivia, but\nof Orsino. \"Make me a willow cabin at your gate, / And call upon my soul within the\nhouse;\" (I, v, 268-9) she begins, in a poetic form which is a departure from the previous\nbantering tone in prose. Olivia could take the image of Cesario waiting at her gate as\n\nAshley Perko 5\nmeaning that Cesario's earlier refusal to be moved from the gates was the act of a\nstubborn admirer. To Viola, however, it is a bittersweet picture of what she would do\nwere she a man. Frustrated by her inability as a woman to act on her love for Orsino, she\nlongs to be able to express her love as a man could, and finds in her disguise an\nopportunity to vent her feelings. \"Halloo your name to the reverberate hills / And make\nthe babbling gossip of the air / Cry out 'Olivia!' O,\" (I, v, 272-4) Viola proclaims in the\nheart of the speech. In these lines concerned with the name of a lover, the vowel sounds\nalways return to the open \"O\", reflecting an inner preoccupation with that name rich in\nthe vowel, Orsino. The fact that her thoughts tend to the object of her secret love gives\nher words such passion.\nShe ends her speech with, \"You should not rest / Between the elements of air and\nearth, / But you should pity me!\" (I, v, 274-276). It is as Viola that she should be pitied,\nin love but unloved; it is as Cesario that she is loved. In pronouncing what, as a woman,\nshe wants most for a lover to be, she imparts to Olivia as a man just what Olivia would\nwant to hear from a suitor. Viola is in no danger of falling for Olivia because of gender\nboundaries, but the disguise affords Olivia no such protection. She falls in love with\nCesario because of Viola's passion and wit. Viola has a unique position in comedy, that\nof being both the pursuer in love and the pursued, the lover unhappily unrequited and the\none undesirably desired. Paradoxically, it is the sisterly bond as women unhappy in love\nbetween Viola and Olivia that makes this love possible.\nNo such dire repercussions of disguise separate Hellena and Willmore. In their\ncase, the removing the disguise is trivial, and only the stubbornness of each keeps them\napart. Accordingly, the love declaration between the two is more lighthearted. \"I am\n\nAshley Perko 6\nparlously afraid of being in love, Child, and you have not forgot how severely you have\nus'd me,\" says Willmore (V, i, 414-6), seemingly unable to be serious, even about love.\nHelena continues the mocking tone by promising \"to find out all your haunts, and rail at\nyou to all that love you, till I have made you love me only in your own defense, because\nnobody else will love\" (V, i, 417-420). The two must depend on joking to communicate\nbecause they are so equally matched, and each is on the defensive. It is significant that in\nthis final scene Hellena is dressed, not as a gipsy, but as a boy. Because Willmore is\naware of Hellena's true gender, the effect of this masking is subtler than in Twelfth Night.\nHellena is essentially feminine, but her male garments underscore the frank, almost\nmasculine manner in which she asserts her will. She plays the male part by proposing to\nhim: \"let but old gaffer Hymen and his priest say amen to't, and I dare lay my mother's\ndaughter by as proper a fellow as your father's son, without fear or blushing.\" (V, i, 441-\n4). As a woman, she would only end up poor and used if she took Willmore without\ngetting married, and she consummately defends against this fate. \"What shall I get?\" she\nasks, \" A cradle full of noise and mischief, with a pack of repentance at my back?\" (V, i,\n456-7). Aphra Behn's words seem to speak from experience, and her female perspective\ngives Hellena's struggle an edge. While Shakespeare is playing with gender for comic\neffect, but for Behn, an empowered female has serious implications.\nOlivia's love declaration, in contrast to Willmore's in The Rover, is completely\nsincere. \"Cesario, by the roses of the spring, / By maidenhood, honour, truth, and every\nthing,\" she begins (III, i, 149-150). Unlike Cesario's declaration in the first act, Olivia's\nis in rhyming couplets. This lends a sense of formality to the lines and suggests that they\nmay be rehearsed. Cesario obviously has often been in Olivia's thoughts. She first cites\n\nAshley Perko 7\nsupports her cause with the bastions of her virtue. Because she is being forward in\nseeking Cesario out, she must assert that her honor is still intact. This is an indication that\nthe submissive behavior of women in courtship is an essential marker of their femininity.\nShe continues, \"I love thee so, that maugre all thy pride, / Nor wit nor reason can my\npassion hide.\" (III, i, 151-2), recognizing before Viola even speaks that she is to expect a\nsardonic reply. This is a different Olivia from what has previously been portrayed.\nBefore, she was proud and eager to spar; now she is willing to submit to all of Cesario's\npride for the sake of love. She goes further to anticipate Cesario's qualms by directing,\n\"Do not extort thy reasons for this clause, / For that I woo, thou therefore hast no cause,\"\n(III, i, 153-4). The self-analysis here is acute: she acknowledges the masculine part she\nhas been playing in the courtship, and even perceives its social implications. She assumes\nthat her usurpation of the wooing role would hurt Cesario's masculinity because the male\ngender roles of the time depended greatly on the way they treated women, especially in\ncourtship. She has risked Cesario's emasculation by pursuing him, just as she has put her\nfemininity on the line. With so much in the air, she can only fall on rational reflection to\nmake her case: \"But rather reason thus with reason fetter, / Love sought is good, but\ngiven unsought better.\" (III, i, 155-6). The emphasis on reason suggests that the gender\nroles are unreasonable and arbitrary. The concluding adage is a wonderfully pithy\nassertion of gender relativism. It paints an inclusive vision of love, in which wooing is\nnot constrained to one gender, and one-sided love is happily accepted. As she is saying\nthis, Olivia could have no idea that this is just the kind of world Viola dreams to inhabit,\nthat she could pursue her love of Orsino.\n\nAshley Perko 8\nHaving a couple composed of two women in Twelfth Night tests the audience's\ncomfort with having women in charge, either in male dress or female. The whole system\nof heterosexual courtship is put under scrutiny when such a major tenet as male\ndominance is subverted. Shakespeare suggetss an alterative to this system in which love\nis unconstrained by gender roles. Though both Viola and Olivia end up in the role\nprescribed by their gender as subjects of their husbands in marriage, the implications of\nfemale empowerment suggested by their courtship linger. A similar subversion occurs in\nThe Rover. Behn has suggested a new type of woman in Hellena. She is not afraid of her\nsexuality and uses it to take a dominant role in courtship. This untested mode of\nfemininity is let loose in a comic space saturated in disguise and frivolity, to hilarious\nresults. Amid the chaos, a hint of Behn's message can be discerned: a yearning for\nequality between the sexes in courtship. Both author ultimately depict gender\nrelationships progressive for their time, but shielded from scrutiny by the giddy freedom\nof comedy.\n\nAshley Perko 9\nWorks Cited\nBehn, Aphra. The Rover. Ed. Jane Spencer and Michael Cordner. Oxford: Oxford\nUniversity Press, 1995.\nShakespeare, William. Four Comedies. Ed. G. R. Hibbard and Stanley Wells. New York:\n\nPenguin Classics, 1995."
    },
    {
      "category": "Resource",
      "title": "The Art of the Tragicomicbook: How Bechdel uses comics to her advantage in creating Fun Home",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-421-comedy-spring-2008/ec692dd8ba8d716dfd6db41f480a6920_pittore_funhome.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.421 Comedy\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nThe Art of the Tragicomicbook\nhow Bechdel uses comics to her advantage in creating Fun Home\n\nEmily Pittore\n21L.421\n5/15/08\n\nIn his famous metacomic Understanding Comics, Scott McCloud quotes Will Eisner to\ndefine comics as \"sequential art\" (5). To be a comic, McCloud says, means that you have a\nsequence of at least two images, between which something happens. The narrative of a comic\nbook is carried along by the reader's interpretation of what happens in the \"gutter\" between these\ntwo images. Although certainly a comic, Alison Bechdel's Fun Home doesn't always seem to fit\nthis definition. Fun Home is a memoir that is heavily dependent on the written word. Bechdel's\nnarration provides her memories and reflections, while the comic panels usually serve to\nillustrate her point rather than move the story along. If a reader was given only the text, they\nwould still get told the story of her father's death and her attempt to understand it. Why, then,\ndoes she expend so much time and effort drawing over 200 pages of pictures? And why use the\nmedium of comics? Would Bechdel have been able to get the same effect using photographs\nfrom her childhood as illustrations to a novel rather than painstakingly drawing everything over\nagain as sequential art? What do comics and cartooning bring to the memoir that photographs\ncannot? Douglas Wolk points out in Reading Comics that drawings in comics are subjective.\nUsing as his example a panel by Will Eisner he says\nyou know that what you're seeing represents a tenement . . . and you believe on some\nlevel that it's real . . . but you also understand that you're not seeing an actual building or a\nbuilding you could have seen unaided by the drawing. What you're looking at is a\nmanifestation of Eisner's style, a personal interpretation of what that sort of building looks\nlike (Wolk, 118).\n\nComics allow for cartooning, a drawing style that \"indicates that . . . [the] stories are subjective\ninterpretations of . . . observations\" (121). Cartooning allows Bechdel to use her interpretation of events in\nher pictures as well as her words. The words provide her view of past events as she writes in the present,\nwhile the images show us what she thought of events at the time, how she remembers seeing them, and\nhow the reader should interpret her words. The unique medium of comics produces a rich environment\ndeeply personal to Bechdel, fusing past and present, and opening up the memoir to further interpretation\n\nfrom the reader as no other medium could.\n\nMcCloud also introduces the idea that the iconographic nature of comics makes it easier for the\nreader to relate to them. He says that instead of maintaining a detailed sense of our own body, we merely\nhave \"a sense of shape . . . something as simple and as basic as a cartoon . . . when you enter the world of\nthe cartoon - you see yourself\" (McCloud 36). He proposes that one of the reasons comics are so effective\nin entertaining people is that they make it easy to see oneself as the hero, and therefore are easy to relate\nto. Bechdel's panels are drawn in a 'realistic' style in that they clearly and consistently portray her family\nand its surroundings. However the drawings are simplified. This is easy to see by contrasting her cartoon\nself with the much more realistic reproductions of photographs included in the story. The iconographic art\nallows the reader to bring themselves into the experience. The reader is invited to look at the pictures\nrepresenting past events and relate to them. This audience interaction adds another layer of interpretation.\nFirst there is the Bechdel of the past whose interpretation of events is revealed in the way they appear in\npictures. Then the Bechdel of the present describes her interpretation in words, and finally the audience\nmoves through both of these, interpreting the mixture and adding their own meanings to the already rich\nmemoir.\n\nThe entire memoir is overwritten with interpretation through the comic medium. Bechdel's words\nbetray an ever changing interpretation of events as she offers different possible reasons for a given\nsequence of images. For example she repeatedly questions the motives behind her father's death. All she\nknows for sure is that he was hit by a semi while crossing the road, but each time she mentions her\nfather's death the words and the pictures bring us to a different understanding of how she feels and thinks\nabout the occurrence. The first time it is brought up, she mentions it in passing. Text over a sequence of\npanels showing a young Bechdel driving a lawnmower with her father in the passenger's seat says \"It's\ntrue that he didn't kill himself until I was nearly twenty\", blithely asserting that his death was suicide (23).\nFour pages later she contradicts this, and against a montage of her own father's funereal, explains that \"no\none knew it wasn't an accident\" (27). This could be interpreted two ways. It could be that she knows it\nwas suicide, but nobody at the funeral knew, or it could be that it was an accident and they have no proof\n\nof suicide. The vagueness of her words betrays her uncertainty about her father's death. Next, along with a\npainstaking illustration of a page of the novel, she says he was reading Camus's A Happy Death, but\nconsidering her father had recently read Proust she did not find this unusual. Finally she wonders \"if I had\nnot felt compelled to share my little sexual discovery, perhaps the semi would have passed without\nincident four months later\" (59). The tenuous connection between her sexuality and her father's death is\naccompanied by a picture of her father carrying weeds from the house he was fixing as the semi, a\nSunbeam Bread truck, passes safely behind him. While the words try to explain his death on a factual\nlevel, the illustrations show how she personally interprets his death. Her first reaction is as a child who\nloses her father. Her next interpretation makes his death nothing more than part of life, and therefore part\nof their business. The illustration of Camus's novel brings her back to seeing her father in a literary light, a\nman who would commit suicide as a scholar. Finally she tries to connect his death to herself. Here the\ncartoon reinforces the tenuousness of the connection. The illustration of her father crossing the street is\ndoubly imagined, first because she does not know the exact nature of his death, and second because this is\nan imagined outcome where her father does not die. In all of these cases, the words and pictures play off\neach other to strengthen the feeling behind them.\n\nIn addition to multiple combinations of words and images, Bechdel also uses different text against\na single sequence of panels to explore possibilities. When her father calls her into the prep room at the\nfuneral home for the first time, the pictures show a continuous sequence of her father working on a\ncadaver and asking a young Bechdel for scissors. Bechdel's narration provides different possible reasons\nfor his suddenly calling her into their business's \"inner sanctum\" (43). First she wonders if \"this was the\nsame offhanded way his own notoriously cold father had shown him his first cadaver\", then \"or maybe he\n. . . was hoping to elicit from me an expression of the natural horror he was no longer capable of. Or\nmaybe he just needed the scissors\" (44-45). Her pondering contrasts with the linearity of the comic\nnarrative to show how she is constantly reinterpreting her own history, even when she does know what\nhappened.\n\nBechdel emphasizes the idea of personal interpretation by reproducing everything by hand. From\n\nthe freehand panel borders and the crosshatched photographs, to typed letters and dictionary entries,\neverything that appears in the comic book has been meticulously copied by hand. Even the text of the\nnarration contains small changes from letter to letter, evidence that she wrote it herself rather than typeset\nit. This is certainly not a necessity or a convenience. It takes a lot of time and is easily avoided using a\ncomputer, so the decision must have been a very conscious one on the part of Bechdel. Wolk suggests the\n\"wobble\" in her hand drawn lines is \"a deliberate gesture to soften the hyper-controlled precision of her\ndrawings, as well as a nod to her first influence, Robert Crumb\" ( Wolk, 361). Earlier in his book Wolk\nmentions that artists such as Crumb went against the mainstream by \"drawing their panel borders\nfreehand, instead of with a straightedge . . . [as] a way of declaring that everything on the page was the\nwork of their hand\" (40). Bechdel uses this technique to imprint the book with her personal style. This\nwould be impossible to do without a comic book. Unlike the cold, impersonal feel of a typset novel or the\nstiff reality of snapshots, the comic book overflows with individuality. It gives Bechdel the creative\nfreedom to create the version of events she believes in or wants the reader to see. Through the use of\nfreehand cartooning, everything in Fun Home becomes Bechdel's, from the way she sees the dictionary to\nher parents' past.\n\nThe color she uses maintains the idea of personality and reinforces the idea that this memoir is\nBechdel's personal view of the world by differentiating between reality and her own memories. While Fun\nHome is not really in color, it is not printed in black and white either. The panels are shaded with a gray-\ngreen wash that softens their impact. Compare a page of Fun Home to Art Spiegelman's comic book\nMaus. Maus is entirely drawn in harsh black and white ink, creating a huge impact on the reader and\nimparting the feeling of the black and white morality of the time. In contrast, Fun Home has a soft,\nnostalgic feel to it. The color wash makes the pages feel like old sepia-toned photographs, faded with time\nand overexposure. The grayness reflects her indecisions about events, both what she thought of them at\nthe time and her opinions on them now. She doesn't have a black and white view of her past. She lives in a\ngray area, constantly rethinking and reevaluating her own life. Her indecisions in the past are revealed in\nher diary entries from when she was 10 years old. Within the gray entries, she begins to insert the words\n\n\"I think\", that morph into a symbol representing her lack of commitment to her words. The inserted \"i\nthink\"s are highlighted in white, and give way to thick black lines obscuring entire entries. The sharp\ncontrast of black and white highlights that the only thing she is really sure about is her own insecurity,\nwhile even simple events like making popcorn are open for interpretation.\n\nIn some cases the images of the memoir are completely imagined. She illustrates her parents\nhistory from what she knows of their past. However aside from a few reproduced passport photographs,\nthe images are all her own. She imagines the story of her parents meeting in a production of The Taming\nof the Shrew. Although the pictures are clear enough, her words are full of qualifiers. She says \"I speculate\non what attracted my father\", \"my parents must have found\" and \"they would probably have been\nappalled\" (Bechdel 69,70). The lack of definite language makes it clear that the images are products of her\nown imagination, although taken alone they would look like the truth. This is her parents as she sees\nthem, and perhaps not as they really were. In some cases, she admits outright to fallacy. Telling the story-\nwithin-a-story of her father as a small child getting stuck in the mud, she draws a milkman, and specifies\nthat that's how she always pictured him, even though she knows it was a mailman. The contrast between\nthe unsure text and the clear pictures emphasize that the memoir is her life as she remembers it, but not\nnecessarily as it really happened.\n\nIn other situations she points out a bit of truth. Her mother reads aloud a poem by Wallace Stevens\nsaying \". . . and the green freedom of a cockatoo upon a rug\" while behind her hangs a painting of a\ncockatoo alighting on a branch. Bechdel points out in a caption \"Honest to God, we had a painting of a\ncockatoo in the library\" (83). In another scene describing the possibility of the semi \"pass[ing] without\nincident\", her caption tells the reader \"Yes, it really was a sunbeam bread truck\" (59). These inserts of\n\"honest to god\" reality ground the story, but also remind us that the rest of it is not so clear cut. There are\nmany details, but only some of them are definitely true. The variation between memory, possibility, lies\nand truths combine to run the full range of anyone's memories, half made up and half true. Cartoons allow\nher to draw the past with a combination of reality and imagination the way photographs or text alone\nwouldn't, and the vagueness of the gray shading reflects this indecisive mix of verity.\n\nThis concept of gray areas in memory is reinforced by Bechdel's rendering of photographs.\nPhotographs appear as each chapter's title page, as well as within the story itself. Each one is rendered in\nstrict black and white, with a much more realistic style than the rest of the comic. Comparing the 'photo'\nof Bechdel on page 120 to the photograph of the author on the back of the book shows a much more true\nto life likeness than the cartoony version of herself that populates the rest of the comic. The black and\nwhite rendering suggests that the photographs represent a known reality. It either exists or it doesn't. This\ncontrasts with the gray-green, faded memories recorded in the cartoons, which may or may not be\ntruthful.\n\nBechdel also uses the comic panels to provide contrast to her written words. In the first chapter\nshe creates an extended metaphor comparing her father to Daedalus. Although she speaks of him as\nDaedalus, the looming shadow of her father in one panel suggests the minotaur more than its captor. This\ninvites the reader to question her words and consider other aspects of her father that go unsaid in the text,\nbut appear in the illustrations. She discusses her house as Daedalus's labyrinth, but while the text tells us\nthat \"escape was impossible\" she is shown running out the front door (12). Again, the reader is invited to\nreinterpret her history, once from words and again in the pictures. Contrasting the words with the images\nsuggests a deeper reading of the memoir than one or the other on its own.\n\nMost importantly Bechdel's illustrations bring subtlety through allusions to literature and motifs.\nThe drawings abound with appropriate literary references in the books and magazines Bechdel and her\nfather read. Without being too obvious, the allusions in the pictures deepen the text by providing\ncontextual references, most of which allude to father's hidden homosexuality. While explaining\nher father's library, Bechdel says \"Part of dad's country squire routine involved edifying the\nvillagers - his more promising high school students . . . The promise was very likely sexual in\nsome cases, but whatever else might have been going on, books were being read\" (61). To back\nup her point, she shows her father lending Roy The Sun Also Rises and The Great Gatsby. Both\nof these books contain homosexuality or homoerotic undertones. The literary allusions reinforce\n\nher speculations as to the sexual nature of her father's relationship to some of his students. In\ndiscussing The Importance of Being Earnest, Bechdel proposes that within the play \"illicit desire\nis encoded as one character's uncontrollable gluttony\" (166). The next panel shows her father\neating cucumber sandwiches being made to serve as props in the play \"faster than [they] can\nmake them\" (167). The image of their father devouring the same food as Earnest's Algy with the\nsame \"uncontrollable gluttony\" connects him to the play's unspoken theme of homosexuality. In\nthe botanical themed chapter \"In the shadow of young girls in flower\", her father is reading an\nissue of \"Wayside Gardens\", which has a picture of a ladyslipper on the back cover. The\nladyslipper is a member of the orchid family, and the Latin root of orchid (orchis) comes from\nthe ancient Greek word for testicle, making the panel a subtle hint at her father's homosexuality\nsimilar to his \"unabash[ed] fixation\" on obelisks (OED, Bechdel 29). In the same chapter\nBechdel uses the comic panels to carry on a motif of lilacs. She tells the reader \"If my father had\na favorite flower, it was the lilac\" (92). Throughout the rest of the chapter, lilacs appear. They are\nshown in a painting her father holds, on the storefront of \"LiLac Chocolates\" near her mother's\napartment, and in a vase in her father's bedroom (96, 105, 119).\n\nThe drawings also provide most of the memoir's subtle humor. As Bechdel was \"comic relief in\n[her] parents' tragedy\" the pictures provide comic relief to the weighty narration (58). Wolk describes her\nhumor as \"poker-faced hilarity\", a type of comedy which is well represented by her pictorial references to\nher father's death (Wolk, 361). After specifying that her father was hit by a \"sunbeam bread truck\",\nsunbeam bread appears on a poster at the gas station, in their kitchen as her mother prepares dinner, and\non the bread her father takes on their camping trip (Bechdel, 96, 67, 112). The cheery little girl on the logo\nprovides an ironic contrast to the death it represents, resulting in a morbidly amusing reference to the\nevent Bechdel spends so much of her memoir trying to understand. Bechdel also uses the comic to\nprovide dual-media puns between the written words and the accompanying panels. Bechdel's description\n\nof her reading about lesbianism and homosexuality in college is described as \"stimulating but solitary\"\n(76). The innocent, bland sentence is given a much funnier meaning by the accompanying visual double\nentendre, a panel of Bechdel masturbating to Delta of Venus. After describing a scene from Proust's\nRemembrance of Things Past where a girl sits \"surrounded by jasmine, verbena, and pansies\", a caption\nover her father planting dogwoods puns on pansy saying \"if there was ever a bigger pansy than my father,\nit was Marcel Proust\" (93). Another visual double entendre happens when a young Bechdel and her\nbrothers stay at the Gryglewicz's for two days. A Bechdel, playing a cop, yells \"Spread 'em, punks!\" while\nbehind her hangs \"one of Dr. Gryglewicz's many interesting paintings of Dr. Gryglewicz\" spreading her\nlegs (160).\n\nThe depth that the comic book medium brings to Fun Home is best appreciated by thoroughly\nanalyzing a single sequence. Take for example the three pages in which Bechdel attempts to connect\nherself to her father's death. She is trying to find a connection, however she knows that it is mostly\nwishful thinking. The lack of connection is betrayed in the following three page sequence. She starts the\nsequence by stating \"The idea that I caused his death by telling my parents I was a lesbian is perhaps\nillogical. Causality implies connection, contact of some kind. And however convincing they might be, you\ncan't lay hands on a fictional character\" (84). This is accompanied by a panel of Bechdel at the library\ndoor calling \"dad?\" to her unseen father. The use of \"fictional\" to describe her obviously real father is\njarring. It implies many things - that he led a fictional life as a heterosexual, that he faked his role in her\nlife and in their family, and that he interacted with people best through novels. It could also be a self\nreferential comment that her father is no longer alive except as a fictional character in her memoir or that\nher supposed connection to his death is fabricated. The image reinforces this. Her father is unseen, unable\nto be contacted in any way. Being unseen leaves him up to interpretation. While we have no confirmation\non what he is doing, we can imagine whatever suits our purpose.\n\nThroughout the rest of the three page sequence, Bechdel's narration compares her father to\nFitzgerald. She explains the use of \"fictional\" saying \"Gatsby's pristine books and my father's worn ones\nsignify the same thing - the preference of a fiction to reality\" (85). Her father, appropriately, is\n\npreoccupied with a Zelda, a novel about Fitzgerald's wife. The setting is his library, another connection to\nfiction. Not only is it full of fictional novels, but as Bechdel says earlier in Fun Home, \"the library was a\nfantasy\", a fabrication of her father (61). As the narration discusses her father's similarities to Fitzgerald\nand his death, young Bechdel and her father have a perfunctory conversation. Over five panels they\nexchange six sentences. Except for the last two sentences, each sentence is within its own panel and very\nshort - four words or less. The separation of their lines creates a halting, staggered feeling in the dialog,\ncreating a distance between the participants. The images also evoke noncommunication. Each time one of\nthem speaks, the other person's back is to the reader. By only showing one of their faces at a time Bechdel\nenforces the idea that they can't connect with one another. In addition, although they are talking to each\nother, they never make eye contact. Bechdel's father remains absorbed in his book for the entire sequence.\nThey can't connect visually or verbally. Finally Bechdel's narration rejects that her father \"had timed his\ndeath with [Fitzgerald's] in mind\" because \"that would only confirm that his death was not [her] fault . . .\nand [she's] reluctant to let go of that last, tenuous bond\" (86). The illustration once again reinforces the\nlack of connection. Looking into the library from the outside, Bechdel and her father are each visible in\ntheir own frame-within-a-frame created by two windows. Splitting the one panel into two in this way\nshows that although the live in the same house, there is a lack of emotional connection that they cannot\novercome.\n\nBechdel's memoir is a very literary one. If you read only the words you would still get an\nidea of what happened and what she thought of it. But without the visual elements provided by\nthe comic book you would be unable to experience it through Bechdel's eyes, appreciate the\nsubtlety of the situation, or find the dual meanings she presents within her drawings. The graphic\nnarrative is equally important as the written narrative, and they compliment each other to provide\na rich, personal memoir that could not have been as effective any other way. As Bechdel herself\nsays, her \"feeble language skills could not bear the weight of such a laden experience\" (143).\nCartooning fills in where her language leaves off, and together they craft a rich, many layered\n\nmemoir.\n\nWorks Cited\nBechdel, Alison. Fun Home. New York: Houghton Mifflin, 2006.\nMcCloud, Scott. Understanding Comics. New York: Harper Collins, 1993.\n\"orchis.\"Oxford English Dictionary. 2008.\nWolk, Douglas. Reading Comics. Da Capo, 2007.\n\nWorks Referenced\nSpiegelman, Art. Maus. New York: Random House, 1991.\n\nAcknowledgments\nWyn Kelley\nLouise Harrison Lepera\nJennie Davidow\n\nAuthor's note:\nUnfortunately, the scanner I brought in from home on Tuesday failed to work with my laptop (I\nblame Vista), so I do not have any comic panels to include as reference. If I can get my scanner\nworking within the next day or so, I will email you a copy that includes comic panels I found\nparticularly relevant."
    },
    {
      "category": "Resource",
      "title": "The Ascendance of the Trivial: The Importance of Being Earnest as Seen through the Lens of Festival Comedy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-421-comedy-spring-2008/807c4bf5c424778df5b0923525e84c12_redfield_earnest.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.421 Comedy\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nThe Ascendance of the Trivial: The Importance of Being Earnest as Seen through the\nLens of Festival Comedy\nCatherine Redfield\n21L.421\nThe world of The Importance of Being Earnest is an essential trivial one. The\nOxford English Dictionary tells us that, in the common modern usage, to be trivial is to\nbe \"of small account, little esteemed, paltry, poor; trifling, inconsiderable, unimportant,\nslight.\" The things of importance in Earnest tend to bit trivial in this respect, be they a\nname or a cigarette case. An older definition of the word is \"belonging to the Trivium of\nmedieval university studies.\" The trivium describes the three lesser of the liberal arts,\nnamely rhetoric, grammar, and logic. In this sense Earnest is only partially trivial.\nRhetoric there is much of: the bright play of wit and jest is tribute to Wilde's fine skill\nwith words. Grammar is also dealt with, in its own small way, in the dichotomy between\nthe Earnest of the title and the Ernest Cecily and Gwendolyn are in love with. When it\ncomes to Logic, however, Earnest falls lamentably short. The entire situation is mildly\nillogical, with the fantastical ideas of Bunburying and the supremely ridiculous twist of\nthe baby in the handbag. If one ignores the ludicrous situations, however, the play is\nlogical within its own context; that is, the characters act in a fashion that is in keeping\nwith the logic of the play, strange though that logic may be. In fact, the very triviality of\nthe values of the characters in The Importance of Being Earnest is what makes their logic\nso entertaining. It is the importance placed on the trivialities of life, especially as\njuxtaposed with the carelessness that Wilde displays to traditionally serious values, that\ncreates an essential illogic in the world. Like the festival comedy of his predecessors,\nWilde deals with a world that is inverted, but unlike other festival comedy, the inversion\nis permanent and pertaining to ideology rather than social structure.\n\nFestival comedy evolved from the medieval feast day, the only sanctioned time\nfor laughter and gaiety in church-dominated society. Bakhtin describes the festivals in\nhis \"Rabelais and his World,\" observing that they focus on an inverted society, where the\nlower classes of society rise up to become, for the duration of the festival, the upper\nclasses. Figures of authority are replaced by fools and idiots, sense gives way to\nnonsense, and everyone can feast and make merry. In The Importance of Being Earnest,\nWilde replaces not the figures of authority, but the values. In so doing, he brings his\nfestival world closer to the reality of his audience, and thus makes the inverted values of\nthe world in the play a comment on the values of the society it inverts.\nAs a comedy of manners, the plot of Earnest naturally deals with romance and\nmarriage, if not quite in the standard romantic language. \"Divorces are made in Heaven\"\n(Wilde, p. 3) one of the characters declaims with apparent seriousness, inverting the\ncommon aphorism. Throughout the play marriage, that essential tie for the continuation\nof the species, which even in comedy usually retains its place as a central theme, is\ntrivialized and downplayed. Though the play ends in proper comedic fashion, with a\ncollection of engagements, none of these are approached with the seriousness that\nromantic comedy demands. Algernon and Cecily, particularly, are lacking in closure.\nAlgernon is the author of the aforementioned quote on divorce, and makes several other\ncomments degrading marriage in the first act, and never officially changes his opinion.\nSimilarly, Cecily has a highly romantic view of both marriage and Ernest, which never\nundergoes any revision. The static nature of their opinions, when combined with the\nsuperficiality of those opinions makes a mockery of such a serious institution. The state\nof being married is treated equally lightly. Algernon even declares that if he ever did get\n\nmarried, he would \"certainly try and forget the fact\" (Wilde, p. 3), a comment that again,\nhe never retracts. Similarly, Lady Bracknell only makes infrequent, passing references to\nher husband, who never appears on stage and leads a life completely separate from his\nwife and daughter, if Lady Bracknell's declaration that she \"never undeceived him on any\nquestion\" (Wilde, p. 45) is to be believed.\nThe necessity of Lady Bracknell undeceiving her husband on the whereabouts of\nher daughter, as well as his absence from the stage and plot, establish Lady Bracknell in\nthe dominant position in their relationship. Certainly a dictatorial female, it is not\nsurprising that she rules her household and husband, but a man's ideal Victorian home is\nhis castle, not his wife's. This inversion of gender roles is perpetuated throughout the\ncouples in the show, with the female characters being, in general, much more assertive\nthan their male counterparts. When Jack proposes to Gwendolyn, she is commanding the\nentire scene according to her own ideas of the convention of the situation. Similarly,\nCecily is one step ahead of Algernon in her pre-emptive engagement. Both women also\ncontrol their partners' identities, as they declare, \"Your Christian names are still an\ninsurmountable barrier!\" (p. 44), forcing both Algernon and Jack to choose to be re\nchristened Ernest. Gwendolyn and Cecily's fascination with the name Ernest, even\nbeyond their love for their prospective partners, is also an inversion of the well-developed\nromantic ideal of love conquering all. Great romantic heroines may find the name and\nfamily of their lovers immaterial, but Cecily and Gwendolyn stand by the notion that\nErnest, and only Ernest, is a valid name for a husband. This determination is a sly\ninversion of its own, taunting the sentimentalism and melodrama of Victorian theater.\n\nThe feminine domination of relationships in Earnest is presented subtly, without\ndirectly challenging social norms. Gwendolyn and Cecily only control Jack and\nAlgernon through the feminine privilege of declining an offer of marriage, rather than\nusurping any of the masculine roles. Even Lady Bracknell's organization of her\ndaughter's life and marriage is not entirely unexpected in a society where arranged\nmarriages were, if not the norm, at least still somewhat common. Lady Bracknell\nacknowledges her lack of control over her male nephew by her observation that\n\"Algernon, of course, may choose for himself\" (Wilde, p. 50). Since this comment is\ndelivered after she has approved his choice for a wife, it is doubtful she would actually\nallow Algernon to do as he chose. However, the fact she says it, and the use of the phrase\n\"of course,\" indicate that insincere though she may be in sentiment, she acknowledges\nthat her control of Algernon must be by force of personality alone, as society, even the\nskewed society of the play, gives her no real control over him.\nAlgernon, of all the characters, is both the greatest proponent of the frivolity of\nthe society his inhabiting, and the most aware of its triviality. He tells Lady Bracknell, in\na rare moment of incivility, \"I don't care twopence about social possibilities\" (p. 47).\nSince Lady Bracknell has been discussing the fashionable way wear one's chin, the\naudience has some sympathy for Algernon's irritation with the importance Lady\nBracknell is placing on such a trivial issue, while true love is at stake. This sudden\nsympathy is unexpected, as Algernon has been trivializing the very notion of marriage\nand true love since the first scene, while upholding the trivial values of his society. Jack\naccuses Algernon of \"never talk[ing] anything but nonsense\" (Wilde, p.19), to which\nAlgernon replies, \"Nobody ever does\" (Wilde, p. 19). This declaration, which ends the\n\nfirst act, goes unchallenged. The implication that is left for the audience to digest during\nintermission is that no one speaks sense, ever. Or rather, no one speaks sense in the\nworld of Earnest, which is not quite the same as the real world, no matter how much they\nmay overlap.\nMeeting Cecily, theoretically his true love, has no effect on Algernon's essential\ntriviality, as he continues to place more importance on the minor things in his life, such as\nmuffins, than the important, such as his failed engagement. However careless of his\nrelationships he may be, Algernon is serious about food. Food, while essential for the\nmaintenance of life, is, for the upper classes described in Earnest, a trivial and\nornamental matter, existing as much for social commentary as for sustenance. When\nsupposing themselves both to be engaged to the same man, Gwendolyn and Cecily trade\nbarbs over afternoon tea, using their positions as hostess and guest to subtly insult one\nanother. Food, here, is a way for Gwendolyn to look down on Cecily, and the control of\nthe teapot as hostess is one of the few outlets the younger and less sophisticated Cecily\nhas to reply to her tormenter. Neither actually consumes anything this scene, as the food\nis a trivial detail with which the women can politely express their dislike. Algernon,\nhowever, actually consumes the leftover food, \"calmly eating muffins when we [Jack and\nAlgernon] are in this horrible trouble\" (Wilde, p. 41). It has been argued that Algernon's\nconsumption of the muffins represents his suppressed desire for Cecily, but it can also be\ntaken as a continuation of the importance he places on the less important things in life.\nWhen distressed, Algernon claims to \"refuse everything but food and drink\" (Wilde, p.\n41), with the implication that food is comforting not for its sustaining values, but because\n\nof its triviality. He has linked his inability to eat muffins in an agitated manner with the\nstate of his shirtsleeves, an even more trivial detail when confronted with crossed love.\nThe importance of food in Earnest reflects the festival atmosphere of the text, as\nfestival comedy is linked to feast days and the food and carnival they inspired in the\nmedieval period. Algernon's obsession with food can be seen as part of the festival\ninversion of the play, as he is the most vocal in his trivialization of serious values. Since\nfood is a trivial ideal elevated to serious by the production, Algernon's comments on the\nimportance of eating can be taken as a reinforcement of the inversion of world the\ncharacters inhabit. While Algernon sets up the festival air with his multiple inverted\naphorisms, he is one of the few characters who chooses to imagine world beyond the\nscope and triviality of the play. His declaration to Lady Bracknell about society and his\nresponse to Jack's accusation of nonsense show his acknowledgment of the triviality of\nthe world he inhabits. Throughout the play, Algernon has been supporting the inverted\nlogic and values of the world of the play, and his disavowal of the frivolity of society can\nbe read as a criticism of said society. The overlap of the real world with the world of\nEarnest is large enough that the subtle differences and inversions turn the festival into a\nbitingly subtle satire, as the audience begins to suspect their own society suffering from\nthe same inversion the society of the play does. Lady Bracknell informs that Algernon\nthat he should \"never speak disrespectfully of Society ... [o]nly people who can't get into\nit do that.\" (Wilde, p. 47). The society to which Lady Bracknell refers is the society of\nthe festival, that inverted world that Algernon has been at such pains to describe to us.\nBut that society deserves, in many ways, to be spoken ill of, and her immediate rejection\n\nof this necessity encourages the audience to consider the possible redress of their own\nsociety, in hopes that they will not find it an image of the society in the play.\nWhile the festival aspects of The Importance of Being Earnest serve to accentuate\nthe satire, the play diverges form the carnivalesque in a number of ways, the most\nimportant of which is the unending nature of the festival world. In general, festivals are\nof a fixed duration and location, an isolated feast in the church year when the usual rules\nare relaxed. In Earnest, however, Wilde creates a festival world that has no end, and no\nbeginning. The world is trivial when Algernon and Lane discuss marriage in the opening\nscene; it equally trivial to find that Jack and Gwendolyn put such importance on his being\nEarnest in the closing scene. There is never any indication that there is a nontrivial world\nbeyond the context of the play. This lack of conclusion accentuates the feeling that the\nworld the characters are describing, and that the audience is laughing at, is somehow the\nreal world. The festival the characters exist in is not a festival to them; it is the whole\nworld and all of time. If one considers the play a self-sustaining world, the implication is\nthat one person's reality can be another person's inverted festival world. By not\nconcluding the festival, Wilde implies that his characters are talking about a real world,\nand it is the real world that the audience is laughing at.\nAnother essential aspect of the feast day is the breakdown of class boundaries and\nthe mixing of all races, castes and genders. In Earnest, however, the different social\nstrata stay firmly in place. Even Jack, who through most of the play could have been\nborn the child of anyone, was raised a gentleman, acts as a gentleman, and in good\ndramatic coincidence, is confirmed as a gentleman by birth in the final scene. The\n\nservants and dependents in Earnest remain invariably servile and obedient. The only\nreference to any social change is Lady Bracknell's passing comment,\n\"Was he the victim of a revolutionary outrage? I was not aware that Mr.\nBunbury was interested in social legislation. If so, he is well punished for his\nmorbidity.\"\n(Wilde, p. 45)\nBy Lady Bracknell's standards, social change is not important, morbid and perhaps\nmildly ridiculous. When Earnest was published in 1899, there was no great political\nupheaval in London, but the Irish Question remained unsolved. As an Irishman, always\nfighting the English prejudices against the Irish, Wilde would be sensitive to the social\nclimate of the time, would have to be careful in any championship of his countrymen. By\nmocking the social politics, Wilde does not offend his audience, who might espouse Lady\nBracknell's view of sociopolitical disturbances. If, however, one considers the other\ntopics Wilde mocks, such as marriage and love, this quote suggests social activism is to\nbe encouraged, as the characters, whose value system is the inversion of our own, distain\nsocial legislation and its explosive consequences.\nSocial activism and inversion are not, in fact, encouraged by the lower class\ncharacters, who are so one-dimensional so as to be almost caricatures. Lane is the\nwooden-faced butler, too proud to ever comment on the peccadilloes of his master, but\neternally loyal. Lane has not been paid wages for some time, but he chooses to remain\nwith Algernon for mysterious reasons of his own. Dr. Chasuble is barely more than the\none-dimensional sketch of a minister; even his name simply refers to the outermost\nvestments of a minister, rather than relating to his personality or family. Both Lane and\nDr. Chasuble are static characters, with no suggestion of character development. They\nare both incapable of social mobility, as they are too static themselves to have any\n\nmotivation to change the status quo. While Wilde leaves the servants firmly in their\npositions, he also elevates them to the position of role model by Algernon, when he\nobserves,\n\"Lane's views on marriage seem somewhat lax. Really, if the lower orders don't\nset us a good example, what on earth is the use of them? They seem, as a class,\nto have absolutely no sense of moral responsibility.\"\n(Wilde, p. 2)\nIn the real world, the moral responsibility is on the part of the upper classes to provide an\nexample for their social inferiors. It is fitting then, that in the world of Earnest, the lower\nclasses are expected to provide an example for their superiors. Besides emphasizing the\ninversion of values, this comment, like the rest of the inverted aphorisms, is worryingly\naccurate in the closeness to reality.\nThe crowning triviality of The Importance of the Being Earnest is, of course, the\nsheer importance of being Ernest. The future happiness of all four main characters\ndepends on the identity of a character who is completely fictional. The festive is often\nconcerned with mistaken identities, but Wilde adds a new degree of complexity by\nmaking the mistake intentional. As the festival is full of kings pretending to be beggars,\nand beggars pretending to be kings, Earnest presents worthy Jack Worthing pretending to\nbe his disreputable brother in the city, and Algernon Moncrieff pretending to be the same\ndisreputable brother in the country. Though they could both choose to travel as\nthemselves, the characters feel the need to hide their actions and identities from the\nsociety they visit. As Ernest, they are able to break the social boundaries they are\nconfined to as Jack and Algernon. As Algernon points out, his own creation, a certain\ninvalid by the name of Bunbury, is a wonderful excuse for missing family dinners with\nhis Aunt Augusta. Algernon uses Bunbury to dodge dinner engagements and escape the\n\nrestrictions of society, but Algernon is the first to acknowledge that Jack is the more\naccomplished Bunburyist at the outset. Jack, after all, has not only created an imaginary\nbrother as an excuse to leave his duties in the country, but actually becomes Ernest when\nhe travels to town.\nTruth is not the absolute ideal in Earnest that it is in the real world; like the other\nvalues discussed, the truth is given secondary importance to social ambitions and\nconvenience. Lady Bracknell derides the truth as being calculating, especially with\nrespect to the image a woman presents to the world. Complete truth finds no favor with\nsociety. On the other hand, Cecily and Gwendolyn break off their respective\nengagements upon learning that neither Jack not Algernon is really Ernest. The made-up\nworld has become, at this point, more desirable than the world as they know it.\nFortunately, both men's willingness to give up his previous identity for the sake of the\nmarriage is sufficient to redeem him in his lady's eyes. When considering the question of\nsecrecy and identity in Wilde's work, it is impossible to avoid considering his own\ndifficulties in this direction. As a bisexual in an aggressively heterosexual society, Wilde\nwas, in a way, always pretending to be someone he was not. In Earnest, it is possible to\nbecome the person one pretends to be, by a twist of fate and poetic license; in the real\nworld, it is harder.\nBakhtin observes: \"one of the indispensable elements of the folk festival was\ntravesty, that is, the renewal ... of the social image\" (Bakhtin, p. 81). In The Importance\nof Being Earnest, Wilde uses the inversion of social norms of a festival to present a world\nin which change is possible. Because it is the world of a festival, with all the inherent\ninstability of such, social issues can be addressed and changed, at least for the day.\n\nBecause in Earnest, the festival is unending, the changes can be permanent. The changes\nin social image Wilde wishes to effect with his \"Trivial Comedy for Serious People\" are\nshown in the particular opinions Wilde chooses to invert and not to invert. The ideals\nthat are trivialized in Earnest, such as traditional notions of marriage, society, and\nmasculinity, can be seen as being presented for redress. The satiric bent of the overlap\nbetween the festival inversion and the real world implies that these ideas are trivialized in\nthe truth as well as in the production. If the festival is a time to present ideas for redress,\nthe creation of an unending festival suggests that continuous change would be worth\ntrying as well. On a more personal level, the play supports change in allowing Jack to\nevolve into his fantasy rather than requiring him to work for his privileges. The authorial\nmanipulation of circumstances creates a world in which one can become one's hidden\nself. As a festival satire presenting problems for redress to a strict society, this calls for a\nrelaxation of the laws that require one to hide one's desires behind a Bunbury.\n\nWorks Cited\nBakhtin, M.M. trans. Helene Iswolsky. Rabelais and His World. MIT Press: Cambridge,\nMA, 1968.\nThe Oxford English Dictionary Online. \"Trivial.\" Accessed at\n<http://dictionary.oed.com/cgi/entry/50258463?single=1&query_type=word&que\nryword=trivial&first=1&max_to_show=10> on May 12, 2008.\nWilde, Oscar. The Importance of Being Earnest. Dover Publications, Inc.: New York,\n1990.\nWorks Consulted\nBechdel, Alison. Fun Home. A Mariner Book, Houghton Mifflin Company: Boston,\nNew York, 2007.\nEverett, Glenn. \"Political & Economic History of Great Britain from the Civil War to the\nTwentieth Century (with an Emphasis on the Eighteenth and Nineteenth\ncenturies).\" Accessed at <http://www.victorianweb.org/history/historytl.html> on\nMay 15, 2008.\nRaby, Peter. \"Plays: The Importance of Being Earnest\" from Oscar Wilde. Cambridge\nUniversity Press: Cambridge, 1988.\nShewan, Rodney. \"The Importance of Being Earnest: The Proverbial Pun\" from Oscar\nWilde: Art and Egoism. Harper & Row Publishers, Inc. Barnes & Noble Import\nDivision, 1977."
    },
    {
      "category": "Exam",
      "title": "We'll Strive to Please You Every Day: An Examination of Feste as Fool and Performer in Shakespeare's Twelfth Night",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-421-comedy-spring-2008/d62cfb879076de191c29aff71a579f76_redfield_twelfth.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.421 Comedy\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nWe'll Strive to Please You Every Day:\nCatherine Redfield\nAn Examination of Feste as Fool and Performer in Shakespeare's Twelfth Night\nLong, long ago and the world began,\nWith hey, ho, the wind and the rain,\nBut that's all one, our play is done,\nAnd we'll strive to please you every day.\n(Feste, V.i.405-408)\nIn Twelfth Night, Shakespeare weaves an intricate, carnival plot of romance and\ntrickery. There are lovers and pirates, sailors and stewards, drunks and Puritans. And\noverseeing it all is one of the most intriguing characters in the play: the fool who is more\nthan a Fool; the traveling player who mocks and triumphs over moralizers; the speaker,\nperhaps, of his creator's view and opinions: Feste.\nFeste jests with everyone in the cast, playing to their moods and foibles in\nwhatever way he can. Malvolio, Olivia's Puritanical steward, is the only character who\nconsistently fails to be entertained. From their very first scene together, the intense\ndislike between Malvolio and Feste is established. Malvolio says of Feste, \"I marvel\nyour ladyship takes delight in such a barren rascal\" (I.v.80-81). This comment distains\nFeste for his lack of worldly possessions by referring to him as \"barren,\" and for his\nsocial position, as Malvolio speaks his criticism to Olivia, rather than deigning to speak\nto the Fool. Feste's dislike takes a more subtle form, constrained as he is by his unstable,\nperipatetic existence to please his audience. He merely wishes \"God send you\n[Malvolio], sir, a speedy infirmity, for the better increasing your folly!\" (I.v.75-76).\nFeste knows Malvolio has no taste for folly, and disapproves the wildness that attends\nany festivity. By wishing the steward illness and folly, Feste is wishing Malvolio two\nthings Malvolio emphatically does not want. In fact, considering Malvolio's desire to\n\nrise in the world and how low he considers such an accomplished Fool as Feste, folly is\none of the things that he desires least. Feste knows this and plays on it.\nThis first scene shows, among other things, how well acquainted Feste and\nMalvolio are with each other's characters, a theme that continues throughout the play.\nMalvolio says of Feste, \"Unless you laugh and minister occasion to him, he is gagged\"\n(I.v.83-84), which is inarguably true; the Fool's livelihood his entirely dependent on his\naudience. If he means to have food to eat and a roof over his head, Feste must please\nthose for whom he performs. In order to please, Feste must be good judge of character to\nknow what his audience will prefer. In the Sir Topas scene, Feste shows how well he has\nlearned Malvolio's character as he taunts the steward's \"madness\". Malvolio is terrified\nof madness, of being thought mad, as is evidenced by his repeated \"I am not mad,\"\n(IV.ii.41) to Sir Topas and to Feste. Feste, both as himself and as Sir Topas, insists that\nreverse to a distressed Malvolio, observing that even a fool like himself will \"ne'er\nbelieve a madman till [he] see[s] his brains\" (IV.ii.117-118). For Malvolio, who had\nbeen ambitious of becoming Count, to be distained so by a mere traveling player must be\na bitter pill to swallow.\nFeste and Malvolio, festivity and ill will, carnival and reality: they are such\nopposites that their disagreements are inevitable and timeless. They begin their first\nscene in conflict, a dissonance that is never resolved. They end the play with the same\nenmity that they began; if they met in ten years, they would still clash. Feste observes,\n\"The whirligig of time brings in his revenges\" (V.i.376-377). Malvolio replies more\nfiercely, promising to \"be revenged on the pack of you!\" (V.i.378). This exchange\nemphasizes their unending cycle of conflict and revenge, revenge and conflict. It also\n\nemphasizes the difference in their characters. Malvolio cares intensely for his revenge;\nhis pride unable to rest until he will no longer be told, \"Alas, poor fool, how they have\nbaffled thee\" (V.i.369). As discussed above, Malvolio has a horror of folly, mostly\nbecause fools and jesters are often the dregs of society. In this line, Olivia places\nMalvolio below even Feste, who, though a Fool, is never baffled. Feste's use of the\npassive, voice makes his remark much milder. His refusal to use the personal pronoun\nimplies that he himself will not enact the events that opportunity for revenge; that job will\nhave to be done by the cyclical nature of fate and their relationship, the \"whirligig of\ntime\" (V.i.377). Feste does not seem to care particularly about the future, and while to\ncourse of Twelfth Night has been diverting, he is aware that his victory over the\nMalvolios of the world is fleeting, and sees no reason to dwell on it.\nThis disassociation from past and future in the normal way is a consistent theme\nin Feste's character. Unlike the other major characters in the show, Feste has no\nmonologues, no great speeches. But he has songs. Songs performed to a variety of\naudiences, for a variety of reasons. The first is 'O Mistress Mine,' the requested love\nsong for Sir Toby and Sir Andrew. The narrator is male, and courting, mirroring Sir\nAndrew's current experience. Feste sings, \"Trip not further, pretty sweeting\" (II.iii.42),\nimplying that the lady in the song is, like Olivia, avoiding her swain. This puts her in the\ncontrolling role in the relationship, an unusual position for a romantic heroine, but very\nfitting to Olivia and Viola, the two strong female characters in Twelfth Night. Feste gives\nSir Andrew hope with his closing line of the first verse, \"Journeys end in lovers\nmeetings\" (II.iii.43). This line also foreshadows the ending of the play, as Viola and\nSebastian's life-changing journey comes to an end with love in Illyria. As with Feste's\n\nwish to \"send [Malvolio] a speedy infirmity, for the better increasing your folly!\" (I.v.75\n76), which predicts Malvolio's sudden madness, Feste speaks truth about a future he does\nnot yet know. In the second verse,\nPresent mirth hath present laughter;\nWhat's to come is still unsure.\nIn delay there lies no plenty,\nCome and kiss me, sweet and twenty;\nYouth's a stuff will not endure.\n(II.iii.48-52)\nFeste sings to an oblivious Sir Toby and Sir Andrew, presenting his own peculiar ideal: to\nlive in the moment. He is a consummate performer, living every moment disassociated\nwith every other moment, and giving each performance as though completely new. The\npresent, as conveyed by the song, is pleasant, especially as compared to the future.\nWorrying about the future and delaying is uncertain, Feste suggests with this lyric, and it\nis better to enjoy what is happening in the present. The command to \"Come and kiss me\"\n(II.iii.51) while youth and love last, reiterates this idea, and the use of the present\nsubjunctive in line 51 reinforces the notion of future uncertainty.\nThe song Feste sings for Orsino and Olivia is not of his making, so it lacks his\nlove of chronological alienation. The song is one suited to his aristocratic audience, a\ntale of a youth dying of his love. This is not the sort of love Feste applauded to Sir Toby\nand Sir Andrew, but a constant, everlasting love that lives in the past. Feste's\ndisagreement with the moral of his song is his advice to Orsino to have \"thy tailor make\nthy doublet of changeable taffeta\" (II.iv.74), implying that such a changeable nature is to\nbe advised. Feste also advises that the constant lovers of songs be \"put to sea\" (II.iv.76),\nthat the ocean, that inconstant of myth and legend, may cure them of their attachment to\n\nthings that are past. Later, in 'I am Gone, Sir,' Feste considers the uncertainly of the\nfuture, but in a very different way from 'O Mistress Mine'.\nI am gone, sir,\nAnd anon, sir\nI'll be with you again,\nIn a trice,\n(IV.iii.121-124)\nFeste sings, using the short lines and varied chronology (moving from present to future)\nto emphasize the uncertainty. This verse, however, makes no promises for joy in the\npresent. Feste moves on to discuss Vice and madness, painting a confusing and none too\nhappy state of existence. But Feste still implies that the future holds no more promises of\nhappiness than the past, especially for Malvolio. Malvolio believes that when freed, he\nwill receive justice; sanity and his future once he has regained his proper sanity are\nassured if only Feste will bring him some paper. The ex-steward even promises Feste\nthat he, Malvolio, will \"requite it [the fetching of paper and ink and light] in the highest\ndegree\" (IV.iii.118), as though he will be capable of such a recompense. Feste's response\nto this commendation is 'I am Gone, Sir,' in which he seems to recommend against\ntrusting in the future.\nThis ephemeral world of a fleeting present is the one that Feste inhabits, and the\none in which most of Twelfth Night takes place. The kingdom the shipwrecked twins find\nthemselves in is Illyria, a made-up realm with a name that conjures illusion and magic.\nThe season is one of joy and madness, the last gasp of Christmas gaiety before the true\nwinter sets in. The whole play has a carnivalesque feel, where the societal boundaries of\nclass and decency are briefly relaxed. Because of the festival time and place, Viola's\ngreat immodesty is not regarded as dreadful, as it would in any other world, and it gains\nher happiness and a future rather than the social exile such a stunt deserves. The other\n\ncharacters are also allowed more flexibility in their actions than would normally be the\ncase. In no realistic world would Orsino marry his serving man, or Sir Toby persecute\nhis niece's steward as he does. There is a sense from the action of the play, and from\nFeste's songs, that the entire interlude is merely \"a midsummer madness\" (III.iv.58), out\nof season and fleeting. Feste, by virtue of his acquaintance with the floating world, and\nby his inability to be touched by the folly of it, takes the role of the Master of the Revels\nin this strange Twelfth Night masque. Unlike Sir Toby, who some have claimed holds\nthis position, Feste has a part in the all the plot threads. He inspires Orsino and Viola's\nlove with his music, brings Sebastian to Olivia, and helps Sir Toby and Maria drive\nMalvolio to the edge of madness, all without being noticeably changed by the experience.\nFeste is the same person when he tells \"Wit, an 't be thy will, put into a good fooling!\"\n(I.v.31) and when he tells the audience, \"Well strive to please you every day\" (V.i.408).\nUnlike the happy lovers or the shamed Malvolio, Feste remains constant in his place as\nperformer and entertainer.\nFeste stands outside the temporary insanity of the play, yet his name implies that\nhe must permanently inhabit a mad world, traveling from one carnival to another, living\nto please his audience with his jests. Feste is, before anything, a Fool. It is his chosen\nprofession, for, as he says to Maria, \"those that are fools, let them use their talents\"\n(I.v.15), and by his success in convincing Olivia that she is more the fool than he, it is\nclear that he does have the talents of a Fool. The place of a Fool in society and drama in\nan interesting one. Drawn from the real jester in medieval and Elizabethan courts, the\ndramatic character \"allowed Fool\" (I.v.91) is isolated and almost mad, speaking in\nnonsense and riddles that baffle the other characters, but are always true. A good jester\n\ncan speak the perfect truth of anyone without offense. Feste is in many ways such a Fool:\nhe is isolated from the action, and never seems to watch his tongue. But he is too\nrecognizably human to be only a traditional Fool. He gets away with more blunt truth\nthan most characters, but unlike the stock character, he does not always speak the truth.\nIn his dialogue with Viola/Cesario, he says, \"How quickly the wrong side [of a word]\nmay be turned outward!\" (III.i.12-13), admitting that he can (and does) twist words from\ntheir meaning. While Feste accepts, and even sometimes revels, in the title of Fool, but\nhe also tells Cesario that he is \"not her [Olivia's] fool, but her corrupter of words\"\n(III.i.35-36). This implies that he is both not a traditional fool and acknowledges, even\nmore than the other observation, his ability to twist the truth. This ability seems to be\nrelated to his other realistic characteristic: a certain less than Foolish sense of the\npracticalities of life. As Feste says, he is not Lady Olivia's Fool, for he has no permanent\nplace of residence. He has been absent from court for some time, Maria implies in his\nfirst scene: he is not truly tied to Olivia's court. As such, he has no constant source of\nincome, room or board. To ensure that he keeps whatever place he is inhabiting, Feste\nmust please his current patron, and everyone else, as well. When Viola pays him for her\nentertainment and information, she observes,\nThis fellow is wise enough to play the fool,\nAnd to do that well craves a kind of wit,\nHe must observe their mood on who he jests,\nThe quality of persons, and the time,\nAnd, like the haggard, check at every feather\nThat comes before his eye.\n(III.i.60-65)\nShe sees the uncertainty and instability of Feste's life, and his dependence of his own\nnative wit and ability to judge character. He must be incredibly sensitive to his audience,\n\nan attention a traditional Fool, secure in his place at court as Feste is not, need not bother\nwith.\nFeste also is more aware of the audience beyond the fourth wall than the rest of\nthe cast, even speaking to the spectators directly in the epilogue, promising, as always,\nentertainment. Throughout the production, Feste's sensitivity to his audience has been\nestablished. Each song is sung to the audience it was intended for, and in so doing serves\nto please the intended audience. Feste, with his comprehension of all the characters\naround him and a finger in every pie, sees to be, by virtue of his profession, in the\nposition of manipulating any and all of the cast. This subtle characterization implies that\nof all the people one knows, it is the performers that know one best. Feste's jests and\nhardships can be seen to mirror Shakespeare's, as the world of a London player is nearly\nas precarious as that of an Illyria musician and jester. Feste's major opposition in the\nproduction is Malvolio, who Maria calls a \"devil [of] a puritan\" (II.iii.146). This mirrors\nthe conflict Shakespeare and his fellow player had with the Puritan elders of London. As\nMalvolio would like to exile Feste from Olivia's court, so the Puritan had managed to\nexile the theater of London beyond city limits. The parallels between Feste and his\ncreator imply a certain similarity in their intents and abilities, as well as in their\ncircumstances.\nFeste is an odd character, fulfilling a number of thematic and plot-related\npurposes. He is a wise Fool, seeing and sometimes speaking the unsayable truth; he is\nMaster of the Revels, seeing and controlling the various plots; he is an itinerant minstrel,\nthreatened by the so gullible a moralizer as Malvolio, but still living by his wit and\ntabour. Feste glories in the moment and in the play of words through it, not in the\n\nromance and social position that satisfies the other characters. Though, as mentioned\nabove, the circumstances of his life relate him to Shakespeare, this taste only for the\npresent alienates Feste from his audience, who would have social and romantic\nambitions. In 'The Wind and the Rain' Feste acknowledges his isolation. \"'Gainst\nknaves and thieves men shut their gates\" (V.i.395) Feste sings in relationship to reaching\n\"man's estate\" (V.i.393) or adulthood. The image suggests that in growing up, most\npeople learn to distrust folly and foolish things that lead, as knaves, to lies and the\ncorruption of words. Thus Feste, who lives in a land of folly and near-madness, is\noutside the gate of the psyche, always isolated from the normal human relationships. Yet\nthis isolation doesn't seem to bother him, and indeed is one that any Fool must survive.\nFeste delivers his last lines directly to the audience, stepping away from the contrived\nworld of the play to speak not as Feste, but as every performer everywhere. The\npenultimate line \"That's all one, our play is done\" (V.i.407) suggests the dual meaning\nboth that this production is over, and that the period of fun and pleasure must come to an\nend, and one must now be serious. The affirmation of purpose comes after that return to\nseriousness, lending unexpected weight. \"We'll strive to please you every day,\"\n(V.i.408) Feste says firmly, telling the audience that the effort he put to please the other\ncharacters is the same effort expended by performers for every audience. Feste controls\nso many subplots by virtue of understanding his audience. If the actor playing Feste and\nhis fellow players (for it is to be remembered that he uses the first person plural form in\nthe final verse) have succeeded in pleasing the audience as well as Feste ever please the\nCountess, do those same players have the same control over and understanding of their\naudience that Feste had of the various machinations and motivations of his audiences?\n\nWorks Cited\nBevington, David, ed. Shakespeare: Four Comedies. Bantam Books: New York, 1988.\nGoddard, Harold C. The Meaning of Shakespeare. The University of Chicago Press:\nChicago, 1951.\nRalli, Augustus. A History of Shakespearian Criticism. The Humanities Press: New\nYork, 1959."
    }
  ]
}