{
  "course_name": "Community-Owned Enterprise and Civic Participation",
  "course_description": "This course will examine literature and practice regarding community-owned enterprise as an alternative means of increasing community participation and development. The use of cooperatives, credit unions, land trusts, and limited stock ownership enterprises for increasing community participation and empowerment will be examined.",
  "topics": [
    "Social Science",
    "Economics",
    "Public Economics",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Sociology",
    "Community Development",
    "Social Science",
    "Economics",
    "Public Economics",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Sociology",
    "Community Development"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis course will examine literature and practice regarding community-owned enterprise as an alternative means of increasing community participation and development. The use of cooperatives, credit unions, land trusts, and limited stock ownership enterprises for increasing community participation and empowerment will be examined. Students may work with two community initiatives in Mattapan, one to establish a youth-run community enterprise and another to develop a locally-run (but regionally affiliated) credit union. Students may also work on a number of projects in conjunction with the Cooperative Development Institute (CDI): a biodiesel production facility project that needs waste vegetable oil collection organized in Boston (maybe working with the City Council on a collection system or working with farmers to back haul it; a Mass health care project that is just in inception - organizing a state-wide meeting to demo the Ithaca model). Other CDI projects include a feasibility study for an herb processing facility in Western Massachusetts; and, an online community product development project to support consensus building among large groups of member-owners of non-profits and cooperatives (now in the software refinement, business planning, and pilot marketing and sales stage built on a volunteer effort). Students will attend four skill-building workshops conducted at MIT in conjunction with CDI CEO Lynn Benander on Coop organization, financing, and management.\n\nGradings\n\nStudents are responsible for one 10-15 page paper, worth 30 percent of their grade, on a topic related to community-owned enterprise and civic participation. Students are also responsible for producing a 'deliverable,' such as a business plan or foundation proposal, for their client. The deliverable will count for 60 percent of the grade, the remaining 10 percent of the grade depends on classroom participation.",
  "files": [
    {
      "category": "Resource",
      "title": "Clarifying Roles within Your Business",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-954-community-owned-enterprise-and-civic-participation-spring-2005/ac66e455be4aec36f39124dae8531442_appendix2.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "Starting a Group-Based Business: Development Plan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-954-community-owned-enterprise-and-civic-participation-spring-2005/170831a2cebc0c95cf7f535712efd70b_appendix4.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "Youth Cooperative Toolkit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-954-community-owned-enterprise-and-civic-participation-spring-2005/0687514a96663de71d92e0e316868d59_youthtoolkit.pdf",
      "content": "Youth Cooperative Toolkit\n\nPrepared for:\nEva Clarke\nMattapan CDC & Faith Partnerships\n\nPrepared by:\nKiara Nagel\nKhalil Shahyd\nMichael Weisner\n\nMIT's Dept. for Urban Studies and Planning\nProf. J. Philip Thompson\n\nMay 21, 2005\n\nTable of Contents\nIntroduction................................................... 3\nSection 1 Background on Co-ops and Youth Co-ops................ 6\n1.1 Background on Cooperatives ................................ 6\nWhat is a Cooperative? ........................................... 6\nPrinciples and Values ............................................ 8\n1.2 Youth and Cooperatives ................................... 10\nCase Study: So Fresh and So Clean, Bronx, NY ................... 10\nCase Study: Nuestras Raices, Western MA ........................ 11\nCase Study: Alternatives FCU, Ithica, NY ....................... 12\n1.3 Legal Issues ............................................ 14\nWorker-Owned Cooperative Model .................................. 14\nFounding Documents .............................................. 15\nLiability and Legal Concerns .................................... 17\n1.4 Resources ............................................... 18\nGeneral Co-op Resources ......................................... 18\nYouth-Related Resources ......................................... 19\nGardening / Herbal Seed Resources ............................... 19\nSection 2 Co-op Business Planning Tools....................... 21\n2.1 Vision and Mission........................................... 21\n2.2 Members/Board Development: Roles and Responsibilities....... 259\n2.3 Market Feasibility........................................... 21\n2.4 Business Plan ........................................... 23\nSection 3 Asset Mapping / Possible Partners................... 24\n3.1 Gardens...................................................... 24\n3.2 Nonprofit Partners........................................... 27\n3.3 Advertising / Marketing Assets............................... 28\n3.4 Distribution................................................. 28\n3.5 Potential Investors ...................................... 31\nSection 4 APPENDIX________________________________________________ 32\n4.1 Legal Structures______________________________________________ 32\n4.2 Clarifying Roles______________________________________________ 33\n4.3 Market Analysis Workbook______________________________________ 34\n4.4 Business Planning_____________________________________________ 35\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 2 of 39\n\nD E D I C A T I O N A N D C I T A T I O N\n\nWe created the Youth Cooperative Toolkit for organizers,\ncommunity development practitioners, and others on the front\nlines of community building work to share this information and\ncontinue to think creatively about developing assets and\nresources for their communities. Most of the core ideas and\ntraining materials can be credited to Lyn Benander and Shakoor\nAnjawani of the Cooperative Development Institute (CDI) in\nGreenfield, MA. We thank them for sharing their rich experience\nand knowledge in the field of cooperative development through a\nseries of trainings for Phil Thompson's course, \" Community-Owned\nEnterprise and Civic Engagement,\" at MIT's Department of Urban\nStudies.\n\nI N T R O D U C T I O N\n\nBackground:\n\nEva Clarke, former Executive Director and current consultant\nat the Mattappan CDC in Boston, approached Prof. Phil Thompson\nabout her idea of creating a youth cooperative. She was inspired\nby an online article about a group of 8th graders in the Bronx\nwho, along with entrepreneurship advisor Khadijah Fajr Muhammad,\ncreated \" So Fresh and So Clean.\"\n\nSo Fresh and So Clean makes a variety of soaps and shampoos\nusing organic ingredients from a local community organic garden.\nThe herbs grown include lavender, peppermint, lemongrass, sage,\nand rosemary. They have turned these products into soaps,\nshampoos, floral air fresheners, and a new children's cherry and\norange bubble bath.\n\nEva Clarke, who now works as a consultant for both the\nMattapan CDC and an organization called Faith Partnerships is\nhoping to lead the development of this new cooperative youth-run\nbusiness.\n\nOur Project:\n\nAs part of Prof. Thompson's course, \"Community-Owned\nEnterprise and Civic Participation, \" we were given the task of\nlaying the groundwork for this new youth-run business - focusing\non the potential for forming a cooperative enterprise, owned and\nmanaged by the young people themselves.\n\nThe concept for this cooperative business is that students\ncould work with existing local community gardens in Boston -\nincluding a garden at the Kennedy Playground in Mattapan, one at\nthe Boston Nature Center (where there is also a greenhouse), and\nperhaps other locations around the city. Products would be\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 3 of 39\n\nmarketed and sold through local small stores and perhaps some\nchains (maybe Trader Joe's or Whole Foods).\n\nIn addition to the entrepreneurship and cooperative\nexperience of this business, the non-business side of the project\nwould provide educational opportunities for participating youth.\nThere would be business/cooperative training, lessons about\nsustainable agriculture and community gardening, and a science\ncomponent based on the production process of creating the soaps,\nshampoos and other products.\n\nAbout This Toolkit:\n\nWhile we were, and still are, extremely excited about the\npotential for this project, we had some initial concerns. We met\nwith Eva Clarke and toured the Mattapan neighborhood, the\ncommunity garden at Kennedy Playground, and Mattapan CDC. We\nheard her ideas for future development and plans for the youth\nbut, given the timing of the project, we were not able to meet\nwith any youth - the potential members of this cooperative.\n\nAs part of our course at MIT, we received multiple trainings\non cooperative development from consultants Lyn Benander and\nShakoor Anjawani, of the Cooperative Development Institute (CDI).\nA consistent part of their advice to us in helping get a\ncooperative business off the ground was that the members needed\nto be invested, have full buy-in, and actively participate from\nthe beginning in setting their vision and goals. As we did not\nhave an extended period of time to work with the youth directly,\nwe were not able to help them work through this process together.\nOur fear was that we would dictate exactly what these young\npeople were going to sell, how they would be structured, what\nroles they would have, their branding and marketing decisions,\nand in doing so, take that democratic control out of their hands.\n\nTherefore, we decided, after discussions with Eva Clarke and\nothers, that the best value we could add to their efforts was to\ncreate a \"Toolkit. \" In developing this toolkit we had multiple\ngoals in mind. The three goals are:\n\n1. To provide background information, and resources to Eva\nClarke and Mattapan CDC staff;\n\n2. To provide materials to be used with the youth - the\nco-op members - as they define their goals, set up\ntheir co-op, and start-up their business;\n\n3. To demonstrate to potential investors and funders that\nthis project has momentum and real potential.\n\nWe are excited to see, over the next 6 months to a year,\nthis project take off. We hope that this Toolkit can provide\nsome valuable resource in an energetic, innovative,\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 4 of 39\n\nentrepreneurial group of young people starting a cooperative\nbusiness!\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 5 of 39\n\nS E C T I O N 1\nB A C K G R O U N D O N C O - O P S A N D Y O U T H C O - O P S\n\n1.1 Background on Cooperatives\n\nThis section provides a basic introduction to cooperatives -\nhow are they defined, what are examples of co-ops, what are their\nprinciples, and what are their values? For a more detailed\nintroduction to cooperatives, see the Resources (Section 1.4)\nbelow.\n\nWhat is a Cooperative?\n\nA cooperative, or co-op, is a group of people who join\ntogether and work toward their shared economic goals through\njointly-owned and democratically operated business.\n\nA co-op is a business that is owned and\ncontrolled\nby the people that use it - it's members!\nCooperatives are similar in many ways to basic businesses.\nThey provide similar services, follow similar business practices,\nand have boards of directors. However, in important ways, co-ops\nare different. Unlike businesses that are owned by a single\nperson or passive shareholders, a co-op is member owned and\ndemocratically run.\n\nPatronage refunds: In a co-op, the profits\nat the end of the year are distributed to its\nmembers. These distributed earnings are\ncalled patronage refunds. They are paid based\non the amount of business the member did with\nthe cooperative that year.\nCo-ops are motivated to serve their members, not to make\nprofits for shareholders and investors. Unlike a for-profit\nbusiness where owners maximize profits that they keep, in a co-\nop, profits are returned to members based on their use of the co-\nop itself. This is called a patronage refund.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 6 of 39\n\nTable 1: Types of Cooperatives\nMembers of consumer co-ops come together to purchase\ngoods like groceries, financial services (like credit\nunions), health care, and utilities (like electricity).\n\n[1]\nConsumer\nExamples -\nGrocery stores\n(see Harvest Co-op, http://www.harvestcoop.com)\n-\nCredit unions\n(see Tremont Credit Union,\nhttp://www.tremontcu.org)\n\nMembers of producer co-ops purchase supplies, usually in\nbulk, and jointly market each other's products. They\noften are made up of farmers or craft producers.\n\n[2]\nProducer\nExamples -\nAgriculture / Farming co-ops\n(Florida's Natural juice,\nhttp://www.floridasnatural.com)\n-\nOther farmer-owned examples include SunKist,\nSunMaid, Blue Diamond, Ocean Spray, and\nLand-o-Lakes.\n\nMembers of employee-owned co-ops are the workers\nthemselves. Each member-worker has a vote in decisions\nabout the business.\n\n[3]\nEmployee\nExamples -\nHealth care\n(Cooperative Home Care Associates, 550 employee-\nowners,\nhttp://www.paraprofessional.org/Sections/chca.htm\n)\n-\nCab companies\n(Union Cab in Madison, WI,\nhttp://www.unioncab.com)\n\nMembers of purchasing co-ops are other businesses, non-\nprofit organizations, or other cooperatives that come\ntogether to increase their purchasing power.\n\n[4]\nPurchasing\nExamples -\nHardware\n(ACE Hardware and TruServ,\nhttp://www.acehardware.com)\n-\nWholesale Food\n(Unified Foodservice Purchasing Co-op,\nhttp://www.ufpc.com/)\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 7 of 39\n\nPrinciples and Values\n\nAlmost every cooperative holds itself to seven common\nprinciples. Some co-ops change them a little to fit their\nmission.\n\n1. Voluntary and Open Membership\nNobody should be forced to join, and nobody should be restricted\nfrom joining.\n\n2. Democratic Member Control\nOne member, one vote.\n\n3. Member Economic Participation\nMembers contribute equitably to the co-op's capital.\n\n4. Autonomy and Independence\nCo-ops are independent. If they partner with anyone else, they\nstay independent.\n\n5. Education, Training and Information\nCo-ops educate members, employees, the public, and youth about\nbenefits of cooperation.\n\n6. Cooperation Among Cooperatives\nAs part of the cooperative movement, co-ops work together with\nother co-op.\n\n7. Concern for Community\nCo-ops work to foster the sustainable development of their\ncommunities.\n\nIn addition to these principles, there are many values that are\nadopted by the majority of cooperatives. These values include:\nself-help, honesty, democracy, equality, equity, solidarity, and\nethical behavior in business.\n\nCo-ops have a long history that spans the globe. There are so\nmany different kinds of co-ops that is hard to define them. Here\nare some facts\n1 about co-ops in the U.S.:\n\n-\n3200 agricultural cooperatives, with a membership of 3 million,\naccount for around $103 billion in net business volume\n-\nCredit unions have over 80 million members and assets in excess\nof $100 billion.\n-\nRural electric cooperatives operate more than half of the\nelectric distribution lines in the United States and provide\nelectricity for 26 million people.\n-\nThere are approximately one million cooperative housing units\nserving households with a range of income levels and housing\nneeds.\n\n1 The list below is from the \" Co-ops and You! \" website,\nhttp://www.wisc.edu/coops/introduction.html\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 8 of 39\n\n-\nCooperative health maintenance organizations (HMOs) provide\nhealth care services to nearly 1.4 million American families.\n-\nMore than 40,000 different cooperatives provide more than 100\nmillion Americans with a wide range of goods and services and\naccount for $123 billion in net business volume\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 9 of 39\n\n1.2 Youth and Cooperatives\n\nThis section examines three cases of cooperatives that have\nincorporated youth into their mission and activities. An overview\nof each cooperative and its youth activities is provided along\nwith contact information.\n\nCase Study: So Fresh and So Clean, Bronx, NY\n\nThe story of So Fresh and So Clean is the story that\nlaunched the concept for a Mattapan youth cooperative. Located\nin the Bronx, the 8\nth grade workers in So Fresh and So Clean turn\nherbs from a community garden - including lavender, peppermint,\nlemongrass, sage, rosemary - into soaps, air fresheners, and\nbubble bath products.\n\nThe Learning Tree sponsors and supports this youth business.\nAccording to Khadija Fajr Muhammad, who helped found So Fresh and\nSo Clean, \"For years, the Learning Tree has been conducting a\ngardening program. One day we realized that we had this over\nabundance of herbs of the program. \"\n\nThis gave them the \"seed \" of an idea to start the\nbusiness. Fajr Muhammad explained, \"So we decided to make soap\nfrom the herbs in the garden. Eventually we decided to bring more\nto the program. So we went into making shampoo and insect\nrepellant. \"\n\nStarting from lower grades, each grade does something\nspecific. By eighth grade, the students do an enterpreneurship\nprogram as part of their senior activity before they graduate on\nto 9th grade. Generally, the bulk of real gardening is during\nthe summer program. In the fall they have a training process and\nmake product from plants the grow\n\nAt first, they did not have any outside funding. The next\nyear the students invested in themselves. Students were willing\nto do this since they make something from selling the product.\nAnother year, we started with seed money.\n\nWhen asked if they would share their business plan, they\nadmitted that they never developed a formal business plan. Fajr\nMuhammad told us, \"We then just kept reinvesting the seed money\nand that keeps turning over year by year. And each year, we\nexperiment to see how we can upgrade the program. \"\n\nThe products are sold in three stores. Each story came to\nbe a retail partner with So Fresh and So Clean in a different\nway. The first store the Learning Tree staff reached out signed\non to get the account. With the second store, one of the\nstudents recruited the retailer. In the third case, the store\nreached out itself after seeing the product being sold at a\nKwanzaa festival put on by the Learning Tree. But the products\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 10 of 39\n\nare not only sold in stores - the students also sell the products\nindividually. They man every school function, like recital and\nother events.\n\nThe students, and their business, are also getting some\ninternational exposure. In fact, in April, 2005, the students\nwent to South Africa. They took along their soap products to\nshow other students and to get in contact with students doing\nsimilar sorts of projects. This was not even their first\ninternational trip. They went to Ghana two years ago and found\nthat in Ghana, they make soap out of the palm plant.\n\nFor this project, we approached So Fresh and So Clean and\nthe Learning Tree about the possibility of Mattapan students\nvisiting. Fajr Muhammad seemed open to it, but needed to speak\nwith the principal. She asked that in terms of scheduling, they\nare given a few weeks notice at least.\n\nContact information:\nKhadija Fajr Muhammad\nThe Learning Tree Cultural Preparatory School\n801 Bartholdi Street\nBronx, NY 10467\n(718) 944-0958\n\nCase Study: Nuestras Raices, Holyoke, MA\n\nNuestras Raices is a grass-roots organization that promotes\neconomic, human and community development in Holyoke,\nMassachusetts through projects relating to food, agriculture and\nthe environment. In addition to maintaining community gardens\nand supporting education, health and community development\ninititatives around the city, they have taken an interesting\napproach to economic development that involves youth and creative\nstrategies of micro-enterprise.\n\nNuestras Raices runs an after school program for youth that\nfocuses on environmental justice and urban agriculture. The\nyouth maintain their own garden and work with other community\nresidents, college students, and community elders around the\ngardens. They have spoken at conferences, led workshops for\nother youth and adults on urban agriculture and the importance of\ncommunity gardens and community building work in their\nneighborhood.\n\nThe Centro Agricola Project has transformed an abandoned building\nand vacant lot into a vibrant center for small business\ndevelopment and community education. The Centro Agricola includes\nan outdoor plaza, a restaurant space, a shared-use community\nkitchen, a bilingual library, and meeting space. The youth\npainted a large mural along the exterikor of the building that\nlines the plaza on the corner of Cabot and Main Street, boldly\nvisable to passing traffic on the busy intersection. The\nrestaurant, Mi Plaza, opened and provides another business\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 11 of 39\n\nopportunity and a gathering space and place to market goods from\nthe gardens. At the same time, micro-enterprise initiatives have\nemerged from the Centro, including a canning of garden products\nand a marketing of sofrito, a traditional Puerto Rican sauce..\nFinally, a bakery opened in the Centre. El Jardin is a for-\nprofit business housed with the non-profit of Nuestras Raices.\nThe profits are shared in some ways (not sure of exact details of\nfinancial structure but they may be willing to share this with\nyou).\n\nRecently, Nuestras Raices acquired a large plot of land on the\nedge of the city to expand their farming initiatives. They\ncontinue to grow and experiment with different business ventures\nand community development strategies that seek to empower\nresidents and youth and improve their community.\n\nContact information:\nNuestras Raices CDC\nExecutive Director: Dan Ross\n329 Main Street\nHolyoke, MA\nPhone: 413-535-1789\nFax: 413-535-1100\nwww.nuestras-racies.org\n\nCase Study: Alternatives FCU, Ithaca, NY\n\nAlternatives Federal Credit Union (FCU) has been working\nwith youth for over 15 years now. In recent years, its youth\nmembers have been playing an increasingly active role. Credit\nunions are cooperative financial institutions owned by their\nmembers. Like other cooperative businesses, credit unions are\ndemocratically operated by their members, who each get one vote\nand elect a board and vote on other issues during annual\nmeetings.\n\nIn addition to their main branch, Alternatives now has\nbranches open in local middle and high schools - their Student\nCredit Unions. At these credit unions are run by students\nthemselves. \"The staff are all under 19 years of age and are\ntrained as tellers, marketers, loan officers, and financial\neducators, and are given the opportunity to organize their credit\nunion. \"\n\nMiddle school students can open an account with only a $1\ndeposit. Over the school year, as they save small amounts each\nweek, they learn the power of saving. The student members who\nrun the school branches receive training from Alternatives, and\nwork alongside the adult tellers in the main branch each Friday\nafternoon. This provides great work experience - whether they\nchoose to work in a credit union or bank in the future or not.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 12 of 39\n\nThe youth members of Alternatives' Student Credit Union\nbranches can do more than just save money. With an adult co-\nsigner, the young people can open a checking account, apply for\nloans, and even get a credit card. By learning how to\nresponsibly use checks and pay back loans and credit card bills,\nthese cooperative members are building important skills and\nhabits at an early age.\n\nContact Information:\nAlternatives Federal Credit Union\n125 North Fulton Street\nIthaca, NY 14850\n(607)273-4611\nwww.alternatives.org\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 13 of 39\n\n1.3 Legal Issues\n\nThe tax code of the United States gives special status for\ncooperative businesses. Under Subchapter T of the IRS tax code,\ncooperates are defined as businesses that are owned and\ncontrolled by their members, and where profits are returned to\ntheir members.\n\nQualifying cooperative businesses only have to be pay taxes\nat either the corporate or the individual level, but not both.\nThis is different than traditional corporations. C-corporations\nhave to pay taxes on corporate profits and then individual\ninvestors pay taxes on the dividends they receive. So if members\nof a co-op receive patronage refunds, these need to be recorded\non their individual income tax returns.\n\nThere are two paths to becoming a cooperative business under the\nIRS guidelines:\nDisclaimer: None of the authors of this Toolkit\nare lawyers. While we hope the information here\nprovides a good start, we highly recommend\nconsulting with a lawyer familiar with\ncooperatives, when establishing the co-op.\n1. Incorporate under a co-op statute in your state; or\n2. Incorporate as a C-corporation and adopt cooperative by-\nlaws.\n\nLimited Liability Corporations (LLCs) can operate\ncooperatively, but they do not need to meet the IRS definition of\na cooperative in order to qualify for the single tax status\ndescribed above.\n\nWhile many cooperatives incorporate, it is not necessary.\nSome cooperative businesses operate informally or as nonprofits.\nRegardless of whether you incorporate or not, it is your bylaws\nthat determine that you are a cooperative and outlines how you\noperate.\n\n1.3.1 Worker-Owned Cooperative Model\n\nAs was outlined above, there are a number of different\nownership models a cooperative business can take. We assume that\nfor the Mattapan youth project, the co-op will probably form a\nworker-owned cooperative.\n\nIn your worker-owned co-op, the members will need to elect a\nboard. Boards of worker-owned co-ops are majority controlled by\n\n2 This section is taken from the Cooperative Development Institute. 2000.\n\" Want to Start a Cooperative?\"\n\n3 This section is based on the National Cooperative Business Association\nwebpage covering worker-owned co-ops, found at\nhttp://www.ncba.coop/abcoop_work.cfm\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 14 of 39\n\nthe workers themselves. However, sometimes an outside director\nor advisor may serve on the board as well.\n\nThe management of worker co-ops can vary widely - from a\ntradition hierarchy of management roles, to a more flat system\nthat spreads management decisions more evenly across all members.\nSome co-ops use a team-based system that mixes the two\napproaches.\n\nPatronage refunds given to workers are sometimes given out\nbased on management position, or hours worked, or seniority.\nAgain, some worker-owned cooperatives have a completely flat\nstructure where all workers earn the same wage, in which case\nrefunds are typically distributed based on hours worked.\n\nWhen joining a worker-owned co-op, members sometimes must go\nthrough a probationary period - sometimes a few months long, or\neven more than a year. Once they pass their probationary period,\nthey are permitted to buy an equity share in the co-op. For some\nco-ops this amount is deducted from their paychecks in small\namounts over time. Once a worker/member leaves the co-op, their\nequity share is returned to them.\n\nFounding Documents\n\nThere are two documents that the youth will draft when first\nestablishing their cooperative business - the Articles of\nIncorporation and the Bylaws.\n\nThe Articles of Incorporation state the kind and scope of the\ncooperative business. Often broad operating authority is stated\neven though services may be limited at the beginning. The\narticles usually contain the following:\n\n- name of the cooperative\n- principle place of business\n- purposes and powers of the cooperative\n- proposed duration of the cooperative\n- names of the incorporators\n- a provision for redemption of member equity although\nsometimes this is in the bylaws\n\nThe Bylaws state the rights and obligations of the\ncooperative's board of directors and members and guide the day-\nto-day operations of the cooperative. The bylaws usually specify\nthe following:\n\n- requirements for membership\n\n4 The following text on the Articles of Incorporation and Bylaws is taken\ndirectly from the National Cooperative Business Association website, at\nhttp://www.ncba.coop/abcoop_howto.cfm.\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 15 of 39\n\n- rights and responsibilities of members\n- grounds and procedures for member expulsion\n- procedures for calling and conducting membership meetings\n- voting procedures\n- procedures to elect or remove directors and officers\n- the number, duties, terms of office, and compensation of\ndirectors and officers\n- time and place of the directors meetings\n- dates of the fiscal year\n- information on how the net earnings will be distributed\n- other rules for management of the cooperative\n\nDecisions to Make\n\nNote: This section on \" decisions to make \" is quoted directly\nfrom the Cooperative Development Institute (CDI) website,\nhttp://www.cooplife.com/startcoop.htm.\n\nMembership Decisions\n\n- Who is eligible for membership?\n- What equity will members contribute?\n- Will members each have one vote? Or will there be weighted\nvoting?\n- Are there financial obligations for voting?\n- Are all members treated the same? Or are there classes of\nmembers?\n- How can a member terminate his/her membership? How can the\nco-op terminate a member's membership?\n\nBoard Decisions\n\n- Who is eligible to serve on the board?\n- What are their duties?\n- How many seats should there be?\n- Will you have board members from outside the organization?\n- How long will a board member serve?\n- How are board members elected? removed?\n- Are they paid? Are expenses reimbursed?\n- How will vacancies be filled?\n- How often will the board meet? What quorum is required? What\nmeeting notice is required?\n- Will there be standing committees of the board? If yes, what\nare they and what are their functions?\n- Will there be officers? If yes, what offices, terms duties,\nselection process?\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 16 of 39\n\nLiability and Legal Concerns\n\nLynn Benander from the Cooperative Development Institute\n(CDI), writing about co-op liability, states, \" Group-based\nbusinesses with limited liability shield individuals from\npersonal liability for the business' debts and liabilities. If\nthe business isn't successful, you won't be personally liable for\nits debts. \"\n\nPlease see Appendix 4.1 for background on the various legal\nforms your cooperative may take and the possible pros and cons of\nthese structures - from the perspective of legal liability.\n\n5 Benander, Lynn. 2004. \"Legal Structure for Group-Based Businesses.\"\nCooperative Development Institute.\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 17 of 39\n\n1.4 Resources\n\nWe have included here a number of additional online resources\nthat might be helpful as you build and launch your new\ncooperative business. The lists below, however, should not be\nconsidered exhaustive - there are many other websites on co-ops,\nyouth co-ops, and gardening that we did not include here. But\nthese lists should be a good start!\n\nGeneral Co-op Resources\n\nBC Institute for Cooperative Studies (Canadian organization)\n\nhttp://web.uvic.ca/bcics/index.html\n\nCenter for Cooperatives (University of Wisconsin)\nhttp://www.wisc.edu/uwcc\n\nCenter for Cooperative Excellence\n\nhttp://www.coopdevelopmentcenter.coop/\n\nCooperative Development Foundation\nhttp://www.cdf.coop/\n\nCooperative Life (Cooperative Development Institute, CDI)\n\nhttp://www.cooplife.com/\n\nCo-op Month (October)\nhttp://www.co-opmonth.coop/index.html\n\nCo-ops and You! (University of Wisconsin)\nhttp://www.wisc.edu/coops\n\nA Legal Sourcebook For California Cooperatives: Start-Up And\nAdministration\nhttp://www.cooperatives.ucdavis.edu/CFC_pubs/vanbaldwin/vanb\naldwin.htm\n\nNational Cooperative Bank:\nhttp://www.ncb.coop/\n\nNational Cooperative Business Association\nhttp://www.ncba.org/\n\nREGINA - Regional Index of Cooperatives (use to search for co-\nops)\n\nhttp://regina.csail.mit.edu/\n\nRural Cooperatives Center at UC Davis\n\nhttp://cooperatives.ucdavis.edu/\n\nUS Dept. of Agriculture. \"Co-ops 101: An Introduction to\nCooperatives \"\nhttp://www.rurdev.usda.gov/rbs/pub/cir55/cir55rpt.htm\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 18 of 39\n\nYouth-Related Resources\n\nInternational Cooperative Association (ICA) - \" Co-ops 4 Kids \"\nhttp://www.ica.coop/kids/\n\nJuma Ventures\n\nhttp://www.jumaventures.org/\n\nJunior Achievement\n\nhttp://www.ja.org/\n\nNational Foundation for Teaching Entrepreneurship\n\nhttp://www.nfte.com/\n\nNorth American Students of Cooperative (college campus co-op\nresource)\n\nhttp://www.nasco.coop/\n\nNuestras Raices (in Western MA)\n\nhttp://www.nuestras-raices.org/index.htm\n\nREAL Entrepreneurship (youth curriculum)\n\nhttp://www.realenterprises.org/\n\nRural Education & Development Association (youth co-op camp in\nCanada)\n\nhttp://www.compusmart.ab.ca/ruraled/youth.html\n\nTupone, Juliano. 2003. \"The Core Neighbourhood Youth Co-op: A\nReview and Long-Term Strategy. \" Community-University Institute\nfor Social Research, Saskatoon, Canada.\n\nhttp://www.usask.ca/cuisr/docs/pub_doc/economic/TuponeFINAL.\npdf\n\nY&E - The Magazine for Young Entrepreneurs\n\nhttp://ye.entreworld.org/\n\nYoung Entrepreneurs' Organization (YEO)\n\nhttp://www.yeo.org/\n\nYoungBiz\n\nhttp://www.kidsway.com/\n\nYouth Enterprise Organizations and Programs (links to youth\nsites)\n\nhttp://www.jamieallen.com/youthlinks.htm\n\nYouth Venture\n\nhttp://www.youthventure.org/\n\nGardening / Herbal Seed Resources\n\nThe Food Project\n\nhttp://www.thefoodproject.org/default.asp\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 19 of 39\n\nGardenGuides.com - Herb Guide\n\nhttp://www.gardenguides.com/herbs/herb.htm\n\nJohnny's Selected Seeds - Herb Seeds\nhttp://www.johnnyseeds.com/catalog/category.html?source=&cat\n_id=205&topname=Herb%20Seeds&ct=hg\n\nKidsGardening.com\n\nhttp://www.kidsgardening.com/\n\nMountain Valley Growers - Organic Seeds\nhttp://www.mountainvalleygrowers.com/organicseeds.htm\n\nNichols Garden Nursery - Seed Store\nhttp://www.nicholsgardennursery.com/store/dept.asp?dept%5Fid\n=79&mscssid=NXJHV89DBDN49MD7UEV4JCH38NPQ3GUC\n\nPapa Geno's Herb Farm\nhttp://www.papagenos.com\n\nPark's Gardens\nhttp://www.parkseed.com/webapp/wcs/stores/servlet/StoreCatal\nogDisplay?catalogId=10066&storeId=10101&langId=-\n1&mainPage=gateherbs\n\nRichters Herb Specialists\nhttp://www.richters.com/\n\nSand Mountain Herbs\nhttp://www.sandmountainherbs.com/Catalog.html\n\nSeattle Youth Garden Works\n\nhttp://www.sygw.org/\n\nSouth Eastern Efforts Developing Sustainable Spaces (SEEDS) - DIG\nYouth Gardening Program\n\nhttp://www.seedsnc.org/dig.htm\n\nThe Washington, DC, Youth Garden\n\nhttp://www.fona.org/youthgarden.html\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 20 of 39\n\nS E C T I O N 2\nC O - O P B U S I N E S S P L A N N I N G T O O L S\n\n2.1 Vision and Mission\n\nStarting a cooperative business is not entirely different than\nstarting a traditional business. It requires a lot of planning\nand preparation, up front and dedication over time. The business\nplanning stage takes time, careful planning, and attention to\ndetail. The success of the business rests largely in the\nsuccessful planning stage. The twist to a cooperatively run\nbusiness is that it must also be seen as an organizing process.\nAs you develop a sound business plan, you are constantly working\nto build capacity in members, provide a good or service to the\ncommunity, work towards a shared vision, build assets, and\nimprove the member's lives and community as a whole. This\nsection lays out specific tools and sets of questions that will\nlead you through a successful planning process step by step.\nFollowing these steps you will help you avoid the most common\nstart-up mistakes for cooperative businesses.\n\nMost Common Start-up Mistakes\n\nPoor board leadership - lack of shared vision, lack of\nagreement on focus, lack of clear board delegation to\nmanagement, poor management/board relations, lack of\nresponse to new information.\n\nPoor management - lack of experience, poor skills,\ninadequate financial controls, poor quality or service,\nlack of response to new information.\n\nPoor planning - Shortage of cash, bringing wrong\nproduct to wrong market, inadequate market research,\noverly optimistic projections, rushing to market\nwithout proper preparation or sufficient capital.\n\nLack of member or community support - lack of\ninvolvement, poor product quality or service,\ninadequate education.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 21 of 39\n\nThe Five \"Must Have\" Ingredients to Cooperative Start-\nup\n\nPurpose: The following is an exercise to get you thinking about the\ncondition of your 5 ingredients and how to strengthen each of them to\nstrengthen the success of your cooperative.\n\nDirections: Use the worksheet to facilitate a discussion among your group\nmembers on the strength of each of the 5 components among your group. Rate\nyourself along the continuum on each ingredient and brainstorm ideas of\nbuilding the capacity for each area and measuring its effectiveness. We have\nprovided suggestions on measuring the strength of each of the ingredients on a\nscale of 1-3 but feel free to create your own scale, value and indicators.\n\n1. Community Organizing\n\n2. A 'Do-able' Business Model:\n\n3. Technical Assistance:\n\n4. Money from Members:\n\n5. Money from Other Sources:\n\nSTRONG\nWEAK\nMeetings held with potential\nmembers; shared vision and clear\nunderstanding of what's\nrealistic; leadership/commitment.\nPotential members are not involved,\nofficials decided in this business;\nleadership and commitment.\nSTRONG\nWEAK\nNo agreement on vision; no\nplan in place; strategy\nisn't do-able\nDo-able business model defined and\nadopted by group.\nSTRONG\nWEAK\nPeople with expertise in every area\nneeded are contributing; group is\nactively learning from their advice and\nsupport\nNo one involved has any\nexperience with business\nplanning, start-up.\nWEAK\nSTRONG\nMembers are putting in the equity\nneeded for successful launch.\nMembers are putting in no\nmoney.\nWEAK\nSTRONG\nGroup has no idea where they\nmight access other funds\nneeded.\nGroup has no relationship with entities\nlikely to bring in more equity, grant\nfunds required for successful launch.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 22 of 39\n\nMembers/Board Development: Roles and Responsibilities\n\nDeveloping leadership and a strong base of members is key to the\nsuccess of group-based businesses. It is important to develop\nstrategies and mechanisms to listening and communicating with\nmembers. Capacity building among members translates to a\nstrengthening of the cooperative. It is important that people\nreceive continued education and training needed to be effective\nmembers, owners, and informed decision-makers. Consider how\nmembers can be involved at EVERY stage of the development\nprocess. What are potentials for organizing at any given point?\nHow are roles and responsibilities clearly defined?\n\nGET TO KNOW YOUR BASE\n\nGET TO KNOW YOURSELF\n\n- Who are members?\n\n- Where do they spend their\nmoney?\n\n- What is important to them?\n\n- What\nskills/interest/resources\ndo you already have among\nyou/them\n\n- What do you do already? What\nis CDC experienced with?\n\n- What is reputation in\ncommunity?\n\n- What is most important to\nyou?\n\n- What can you offer? (i.e.\nquality goods or services,\nmore affordable, more\nconvenient, more locally\nrooted?\n\nGetting to know your self and your base are key. Remember to\nalways be creative and continually brainstorm what makes sense\nfor your group and your constituents.\n\nMembership Development Plan: Members need to be recruited\nthrough a process of outreach and organizing. Orientation and\nongoing education is required in order to participate as active,\neffective members.\n\n4 Stages of Membership Development\n\nParticipation\nin Decision\nMaking\nOrientation\nEducation\nRecruitment\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 23 of 39\n\nKey Questions on Membership Development:\no How will this business begin organizing potential\nmembers in the development stage?\no How will members be involved in the feasibility study?\no How will members be involved once the feasibility study\ndefines a potential business opportunity?\no How will members be involved in the business launch?\no What organizing efforts are needed? How will these\nefforts relate to existing community organizing\nefforts?\no How will new members be recruited?\no What orientation will be given to new members?\no What public relations efforts are needed?\no What ongoing education and training are needed?\no What online tools are available for membership\ndevelopment, consensus building, and business\ndevelopment?\n\nBoard Development Process\n\nKey Questions on Board Development\no How will you build member leadership?\no What is the role of member and community leadership in\na group-based business? How does it change over time?\no Who will serve on the initial steering committee to\noversee business development activities?\no Who needs to be on the board? How do you effectively\nrecruit board members?\no What education and orientation is needed for board\nmembers?\no How do you set up an effective board?\no How do you set up an effective relationship between\nboard and management?\n\nThe group needs to determine a process for making decisions and\ncommunicating between management, board, members, and all the\npieces of the business. It is important that everyone clearly\nknows their role and what they are responsible for. Open\ncommunication around these issues is key. Appendix 4.2\n\" Clarifying your Roles Worksheet \" provides a worksheet that\nhelps your groups map out who is responsible for what in very\nconcrete terms. The process of filling out the worksheet can be\na process of deciding these difficult issues, creating buy-in\nfrom members and board members, creating transparency through the\ncooperative, and educating all group members on the cooperative\nstructure.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 24 of 39\n\n2.3 Market Feasibility\n\nAs you consider your organizing strategy of building strength and\ncommitment among members, you want to consult a market and\nfeasibility study and begin drafting your business plan. This\nsection will take you through the basics of what you need to know\nfor taking concrete steps in market analysis and business\nplanning. The questions are taken from the CDI guide on market\nanalysis.\n\nWhat is a feasibility study?\n\n3 Stages of Feasibility Studies:\n\nA Feasibility Study is designed to provide an overview of\nprimary issues related to a business idea. The purpose is\nto identify any \" make or break\" issues that would prevent\nyour business from being successful in the marketplace. In\nother words, a feasibility study determines whether the\nb\ni\nid\nk\nMarket\nIssues\nOrganizational\ntechnical\nissues\nFinancial\nIssues\n1. Market Issues\n\nKey questions:\no What is my target market (geography demographics,\nlifestyle, interests, attitudes)?\no What am I going to market?\no How does my product match the needs of my market?\no How will the market know I have what they need?\no What competition exists in the market? What are their\nstrengths and weaknesses?\no Is there a niche that you can establish to compete\neffectively?\no How many competitors can you identify? How much are\nthey charging?\n\n2. Organizational/technical issues\nHere you will determine what the structure will be of the\nbusiness, legal and decision-making processes, and technical\nneeds.\n\nKey questions:\no What organizational structure is best for your project?\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 25 of 39\n\n[NOTE: Because all subsequent decisions depend on the\norganization's legal business structure, this question is\ncritical and should be answered before you continue with\nfeasibility analysis. Remember, cooperatives are not the\nbest business structure for every project.]\n\no Who will serve on board of directors? What are their\nqualifications?\no What qualifications are needed to manage this business?\no What other staffing needs does the co-op have? How do\nyou expect staffing needs to change over the next 2-3\nyears?\no What equipment does your proposed business need?\no Where will you obtain this technology and equipment?\no When can you get necessary equipment? Does this affect\nstart-up timeline?\no How much with equipment and technology cost?\n\nRemember, sometimes equipment needed may not be so technical.\nYou may find you need a camera, or computer, or phone/fax\nmachine. Think of creative ways to obtain donations and\ncritical technical needs. At the same time, be realistic\nregarding costs as these estimates will be plugged into your\nfinancial projections.\n\n3. Financial issues\n\nStart-up costs are costs incurred in starting up a new\nbusiness, including \"capital goods \" such as land, building,\nequipment, etc. The business may have to borrow money from a\nlending institution to cover these costs.\n\nRevenue Projections: How will you price your goods or\nservices? Access what the monthly revenue will be.\n\nSources of Financing: If your business needs to borrow money,\nyou need to research potential lending sources.\n\nProfitability analysis: This is the \"bottom line \" for the\nproposed business. Given the costs and revenue analysis, will\nyour business bring in enough revenue to cover operating\nexpenses? Will the business make, or lose a profit or break\neven? What can be done to improve the bottom line?\n\nAppendix 4.3: This section will take you through the 3 stages of\na feasibility study. There are many resources available to assist\nyou with market analysis. A local business school or small\nbusiness development center may help guide you. Local college\nstudents can be a source of labor for conducting interviews.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 26 of 39\n\nBusiness Plan\nWhat is a business plan?\n\nWhat is the purpose?\n\nA business plan is an organized, thoughtful\nprocess of identifying and assessing opportunities\nand problems inherent in a business endeavor to\ngive it an increased chance of being successful.\n1. To craft a shared understanding of the business' goals and\nhow to achieve them\n2. To create a launch strategy and on operational plan for a\nnew venture\n3. To establish strategies for growth\n4. To create a proposal for financing\n5. To minimize the risks new businesses face\n\nWhy do business planning?\n\n1. The research, analysis, and thinking that goes into business\nplanning forces an critical, rational, holistic look at your\nbusiness\n2. Business planning process educates the group about the\nbusiness and brings in ideas and resources from a range of\nstakeholders.\n3. The business plan serves as an operational tool to help\nmanage and govern your business.\n4. It established the means of convincing you, your members,\nyour lenders and investors that the idea is a sound\ninvestment\n5. Provides a vehicle for a group to create agreement about who\nwill do what\n6. Creates ownership and commitment to business goals and\nstrategies\n\nWho should be involved?\n\n1. Potential owner-members who are willing to invest\n2. Community leaders with special skills, experience, interest\nor knowledge useful to planning process\n3. Consultants with experience in business planning and\nbusiness start-up\n4. A lawyer and accountant experienced with group-based\nbusiness\n\nAppendix 4.4 provides a comprehensive business plan that will\nlead you through the start-up and launch of your cooperative\nbusiness. Perhaps the most useful tool in the Toolkit, the\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 27 of 39\n\nbusiness plan takes you through the steps and allows you to\nlayout the timing in a realistic way. If you take nothing else\nfrom this Toolkit, we recommend you use this business planning\ntool with your group.\n\nS E C T I O N 3\nA S S E T M A P P I N G / P O S S I B L E P A R T N E R S\n\nGardens\n\n1.) The Food Project - www.thefoodproject.org\n\nAbout Us:\nOur mission is to grow a thoughtful and productive community of\nyouth and adults from diverse backgrounds who work together to\nbuild a sustainable food system. We produce healthy food for\nresidents of the city and suburbs and provide youth leadership\nopportunities. Most importantly, we strive to inspire and\nsupport others to create change in their own communities.\n\nSince 1991, The Food Project has built a national model of\nengaging young people in personal and social change through\nsustainable agriculture. Each year, we work with over a hundred\nteens and thousands of volunteers to farm on 31 acres in rural\nLincoln, MA and on several lots in urban Boston. We consider\nour hallmark to be our focus on identifying and transforming a\nnew generation of leaders by placing teens in unusually\nresponsible roles, with deeply meaningful work.\n\nEach season, we grow nearly a quarter-million pounds of food\nwithout chemical pesticides, donating half to local shelters.\nWe sell the remainder of our produce through Community Supported\nAgriculture (CSA) crop \" shares, \" farmers' markets, and Harvest\nBags. We market our own Farm-Fresh Salsa and holiday pies, and\neven offer fine catering. Locally, we also partner with urban\ngardeners to help them remediate their lead-contaminated soil and\ngrow healthier food.\n\nNearly half of The Food Project's work is as a resource center\nfor organizations and individuals worldwide. We provide unique\ncapacity building for organizations and educators who learn from\nThe Food Project's expertise through materials, youth training\nand professional development opportunities. Even projects\ncompletely unrelated to farming can draw on our methods for\nbuilding inspired, diverse and productive youth communities.\n\nLincoln Office:\n10 Lewis St.\n\nLincoln, MA 01773\nPhone: (781) 259-8621\n\nFax: (781) 259-9659\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 28 of 39\n\nDorchester Office:\n555 Dudley St.\nDorchester, MA 02125\nPhone: (617) 442-1322\n\nFax: (617) 442-7918\n\n2.) In Mattapan\nClark-Cooper Community Garden at the Boston Nature Center, Inc.\n(MAS/BNC)\nformer Boston State Hospital site, enter off Walk Hill St.; off\nAmerican Legion Hwy.\nOne of Boston's oldest and largest gardens (300 gardeners), but\ntotally rebuilt in spring 1999! Part of overall nature sanctuary\nbeing developed by Mass Audubon. EarthWorks Projects orchard.\nhttp://www.massaudubon.org\nCommunity Garden at Kennedy Playground (MDC & BNAN)\nEdgewater Drive along the Neponset River, north of Mattapan Sq.\n3-yr. old community garden with 23 planting areas on the banks of\nthe Neponset River.\nImani Garden\nRiver St. at Chronic Care Hospital, south of Mattapan Sq.\n2-yr. old garden for mothers and children to improve nutrition,\nprovide recreation, and enjoy nature. Currently being rebuilt and\nexpanded.\nShangri-la gardens/Almont Park (BPRD)\nBehind 54 Messenger St. in Almont Park\n\nBoston Nature Center\n500 Walkhill Street\nMattapan, MA 02126\nPhone:(617) 983-8500\n\nMattapan Board of Trade and Commerce Association\n1663 Blue Hill Ave\nMattapan, MA 02126\nPhone: (617) 286-2200\n\n3.) Boston Natural Areas Network\n62 Summer Street, Second Floor\nBoston, MA 02110-1008\nPhone: 617-542-7696\nFax: 617-542-0383\nEmail: info@bostonnatural.org\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 29 of 39\n\nBNAN is in the Conservation Law Foundation building at Downtown\nCrossing. For directions:\nhttp://www.clf.org/aboutclf/massachusetts_directions.htm\n\nBoston Natural Areas Network, a city-wide organization, was\nfounded in 1977 as Boston Natural Areas Fund. The organization\nwas created by a small group of citizens who took up the\nchallenge of a Boston Redevelopment Authority report entitled\nBoston Urban Wilds. In it, 143 Urban Wilds or unprotected sites\nof natural beauty and environmental significance in Boston\nneighborhoods were listed. Five years later, through working with\nand engaging residents with open spaces in their neighborhoods,\nbegan to protect Community Gardens threatened with development.\nMost recently, with major resources made available from the Lila\nWallace-Reader's Digest Fund, BNAN began linking Urban Wilds and\nexisting and proposed parkland into multi-mile Greenways in East\nBoston and along the Neponset River.\n\nForging effective partnerships has been a hallmark of BNAN's work\nsince its inception. Working for a Greener City, BNAN brings\ncommunity groups, public agencies, non-profit organizations and\nbusinesses together to develop common visions and to combine\nresources. Our work is often described as \"community building\nthrough greening.\"\n\nIn 1995, BNAN was instrumental in starting Garden Futures, a\ncollaborative of the non-profit organizations that own and manage\ncommunity gardens. Garden Futures developed into the common\nservice provider and voice for all of the Boston area's 200\ngardens with 30 different owners, involving 10,000 gardeners.\nBNAN owns 25% of these gardens. In January 2002, Garden Futures\nmerged with BNAN to more efficiently and effectively support\nBoston Community Gardening.\n\nEnvironmental education programs, special events, exhibits and\npublications are some of the ways BNAN builds an informed and\nenthusiastic constituency for urban open space. Come participate\nin an Event soon.\n\nWe offer many Volunteer opportunities. Environmental education\nprograms, special events, exhibits and publications are some of\nthe ways BNAN builds an informed and enthusiastic constituency\nfor urban open space. See our Frequently Asked Questions (FAQ)\nsection.\n\n4.) Greenleaf Composting\n179 Boylston Street\nJamaica Plain, MA 02130\nPhone: 617.522.4477\nFax: 617.522.9820\nEmail: info@greenleafcompost.com\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 30 of 39\n\nGreenleaf's mission is to achieve the maximum financial, social\nand environmental value from the local organics cycle. Our\nmission springs from our vision of a Boston with a locally self-\nreliant and environmentally responsible economy. To support this,\nGreenleaf redistributes the waste stream away from the landfills,\nproduces a valuable commodity, and creates local employment\nopportunities. Composting replaces the need to send money out of\nBoston to dispose of leaves, food and other organic materials. By\ntransforming these into compost, Greenleaf replaces the need to\nsend money out of Boston for imported fertilizers and soil\namendments. Instead, the money stays within our own economic\nsystem, employs local people, and provides local products to\nlandscapers, park managers, community developers, gardeners and\nhomeowners. It is our deepest desire to maximize our ability to\nserve our friends, neighbors and city. We trust that our\nneighbors will assist us in making sure that we do by encouraging\nthat which we do well and pointing out that which we need to\nimprove.\n\nPotential Nonprofit Partners\n\nMattapan Community Health Center\n1425 Blue Hill Avenue\nMattapan, MA 02126\nPhone:(617) 296-0061 (24-hour)\nFax:(617) 296-5408\n\nA Healthy Community. A Healthy You: We are committed to improving\nthe quality of life for our patients and the greater community\nthrough health education, advocacy and hands-on delivery of\nhealth care. The Mattapan Community Health Center frequently\nsponsors community activities, from health fairs to fundraisers.\n\nAlternatives for Community and Environment\n2181 Washington Street, Suite 301\nRoxbury, MA 02119\nPhone:(617) 442-3343\nFax:(617) 442-2425\nEmail: info@ace-ej.org\n\nACE builds the power of communities of color and lower income\ncommunities in New England to eradicate environmental racism and\nclassism and achieve environmental justice. We believe that\neveryone has the right to a healthy environment and to be\ndecision-makers in issues affecting our communities.\n\nMassachusetts Association of Community Development Corporations\n(MACDC)\nJoe Kriesberg\n89 South Street\n4th Floor\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 31 of 39\n\nBoston, MA 02111\nPhone: 617-426-0303\nEmail: macdc@macdc.org\n\nThe mission of MACDC is to preserve and promote affordable\nhousing, and to promote economic opportunities for low and\nmoderate income residents.\n\nAdvertising / Marketing Assets\n\nRed Tomato\n1033 Turnpike St.\nCanton, MA 02021\nPhone:(781) 575-8911\nEmail: redtomato@redtomato.org\n\nRed Tomato is a nonprofit marketing organization that helps\nfamily farmers survive and helps make sure that people can find\nhigh-quality produce. We use two strategies:\n- finding markets for family farmers through our brokerage\noperation, and\n- educating consumers and trade buyers so that they will seek out\nproducts from family farms and those that are locally and\necologically produced.\n\nDistribution\nDonelan's Supermarket - http://www.donelans.com/\n\nAbout Us:\nDonelan's Supermarkets was founded in 1948 in Littleton, MA by\nJohn E. Donelan. Over the next several years, Donelan's expanded\nin Acton, and Lincoln, MA. In 1985, John E. Donelan sold the\nbusiness to his two sons John K Donelan and Joseph R Donelan.\n\nIn August 1992, Donelan's opened its fourth location in Groton,\nMA. In July 1994, Donelan's added a fifth location in Pepperell,\nMA. Donelan's opened its sixth store in Wayland, MA in the summer\nof 1995.\n\nIn August 1996, Donelan's relocated its Acton store from South\nActon to its present location in Gould Plaza.\n\nThrough the years, Donelan's has continually updated and\nremodeled our stores. Our most recent remodel was completed in\n2002 when Donelan's took over space formerly occupied by Newport\nCreamery. We completed renovated the store adding a new kitchen\nand cafe' as well as a new frozen food and dairy department.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 32 of 39\n\nWe are proud of our accomplishments and of the associates who\nhave helped make them possible. We look forward to continued\nquality service to our customers and success for our company.\n\nLocations: Lincoln, Acton, Pepperell, Wayland, Littleton, Groton\n\nCity Feed and Supply - http://www.cityfeedandsupply.com/\n66 Boylston St\nJamaica Plain, MA\nPhone: 617-524-1657\nEmail: feedback@cityfeed.com\n\nAbout Us:\nWe are a small, neighborhood grocery/cafe catering to the Ped Set\nwith a fine selection of natural foods, bread, bagels and pastry\ndelivered daily, fair trade coffee, local goods, and the list\ngoes on. We may not have everything you think you need, but\nsurely we've got enough to help you put off that dreaded trip to\nthe supermarket for a few more days.\n\nHarvest Co-op - http://www.harvestcoop.com/\n57 South Street\nJamaica Plain, MA 02130\nPhone: 617-524-1667\nEmail: cdurkin@harvestcoop.com\n\nHarvest Co-op Markets is a community owned, not-for-profit\ncooperative that started over 30 years ago as two separate Co-\nops. Boston University Student Union Food Coop was a small buying\nclub formed by some students at Boston University in 1971. This\nwas a pre-order Co-op: everyone ordered food together to get bulk\nprices. In 1973, it became the Boston Food Co-op (BFC), and moved\nto Union Square, Allston. In 1975, Cambridge Food Co-op (CFC),\nlater known as Central Square Market, was opened in Central\nSquare by some BFC members and Cambridge community activists.\nTheir mission was to create a diverse and low cost Co-op open to\nmembers. It opened its doors to the general public in 1983. In\n1992, the Central Square Market experienced financial\ndifficulties as a result of its move from the basement store to\nthe new location where Harvest, Cambridge is today. The Boston\nFood Co-op stepped forward with assistance, the two Co-ops joined\ntogether, and became Harvest Cooperative Supermarkets.\n\nIn May 1998, responding to decreasing business due to changes in\nthe surrounding neighborhood, the Allston location was\nreluctantly closed. There was a search for a new location, and\nfinally in October 1998, a new location was found in Jamaica\nPlain, the former site of the Arborway Natural Foods. On May 20,\n1999 the doors finally opened. The store was, and continues to\nbe, a great success, adding over 1,000 new members in the first\ntwo weeks of operation. When the store opened in Jamaica Plain it\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 33 of 39\n\nwas decided to change our name to Harvest Co-op Markets to\nreflect our commitment to neighborhood stores. Today, our mission\nremains the same -- to serve our members, and to sell and promote\norganic, natural, fair trade, and sustainable food products, and\nto educate and advocate for our members and customers in the food\nbusiness.\n\nThe Food Project - www.thefoodproject.org\n\n(see Gardens section).\n\nOur produce is sold in the summers at two farmers' markets in the\nBoston area:\n- Tuesdays at the Children's Museum of Boston from 4:00-6:30 pm,\nand\n- Thursdays at the Dudley Town Commons in Roxbury from 4:00-\n7:00 pm.\n\nThis year (2005) the markets start on Tuesday June 1st.\n\nEqual Exchange\n50 United Drive\nWest Bridgewater, MA\n02379 - USA\n\nEqual Exchange's mission is to build long-term trade partnerships\nthat are economically just and environmentally sound, to foster\nmutually beneficial relations between farmers and consumers and\nto demonstrate, through our success, the viability of worker\ncooperatives and fair trade.\n\nPotential Funding\n\nCooperative Fund of New England\nP.O. Box 3413, Amherst, MA 01004-3413\nPhone: 910.395.6008 / 1.800.818.7833\nFax: 910.397.2857\nEmail: cfne@cooperativefund.org\nThe Cooperative Fund of New England is a community development\nloan fund that is a bridge between socially responsible investors\nand cooperatives, community oriented non-profits, and worker-\nowned businesses in New England (and parts of New York).\nWe advance community based, cooperative and democratically owned\nor managed enterprises with preference to those that serve low\nincome communities through:\n- provision of prompt financial assistance at reasonable rates\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 34 of 39\n\n- provision of an investment opportunity that promotes\nsocially conscious enterprise; and\n- development of a regional reservoir of business skills with\nwhich to assist and advise these groups.\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 35 of 39\n\nAppendix 4.1\nLegal Structures for Group-Based\nBusiness\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 36 of 39\n\nAppendix 4.2\nClarifying Roles in the Development\nProcess\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 37 of 39\n\nAppendix 4.3\nMarket Analysis\nWorksheet\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 38 of 39\n\nAppendix 4.4\nBusiness Planning\n\nMattapan Youth Cooperative Toolkit\nNagel | Shahyd | Weisner\nMay 22, 2005\n\nPage 39 of 39"
    },
    {
      "category": "Resource",
      "title": "Worksheet #1. Market Analysis: What is my target market?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-954-community-owned-enterprise-and-civic-participation-spring-2005/7472d041857e2bba35fda44bd4aaa9b8_appendix3.pdf",
      "content": ""
    }
  ]
}