{
  "course_name": "Commutative Algebra",
  "course_description": "In this course students will learn about Noetherian rings and modules, Hilbert basis theorem, Cayley-Hamilton theorem, integral dependence, Noether normalization, the Nullstellensatz, localization, primary decomposition, DVRs, filtrations, length, Artin rings, Hilbert polynomials, tensor products, and dimension theory.",
  "topics": [
    "Mathematics",
    "Algebra and Number Theory",
    "Mathematics",
    "Algebra and Number Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nIn this course students will learn about Noetherian rings and modules, Hilbert basis theorem, Cayley-Hamilton theorem, integral dependence, Noether normalization, the Nullstellensatz, localization, primary decomposition, DVRs, filtrations, length, Artin rings, Hilbert polynomials, tensor products, and dimension theory.\n\nPrerequisites\n\nAlgebra I (18.701) and Algebra II (18.702)\n\nTextbooks\n\nRequired\n\nReid, Miles.\nUndergraduate Commutative Algebra: London Mathematical Society Student Texts\n. Cambridge, UK: Cambridge University Press, April 26, 1996. ISBN: 9780521458894.\n\nAtiyah, Michael, and Ian Macdonald.\nIntroduction to Commutative Algebra\n. Reading, MA: Addison-Wesley, 1994. ISBN: 9780201407518.\n\nRecommended\n\nEisenbud, David.\nCommutative Algebra: With a View Toward Algebraic Geometry\n. New York, NY: Springer-Verlag, 1999. ISBN: 9780387942698.\n\nGrading\n\nGrades in this class are based nearly entirely on the problem sets. In addition, each student will present (at least) one problem in class. There will be no exams.\n\nHomework\n\nProblem sets are due in class each Thursday of the week after they are assigned (in other words, 7 or 9 days later). On occasion, a late problem set will be accepted provided that you state (1) a good reason why you need the extra time and (2) the date when the set will be turned in. Collaboration is permitted, indeed encouraged, provided that you think through each problem on your own and write it up in your own words. Problem sets will be graded in part on the quality of the write-up.\n\nCalendar\n\nSES #\n\nTOPICS\n\n1-3\n\nRings and ideals\n\n4-6\n\nModules\n\n7-8\n\nIntegral dependence\n\n9-13\n\nLocalization\n\nPrimary decomposition\n\n15-19\n\nDedekind domains\n\n20-22\n\nDimension theory\n\nTensor product\n\n24-26\n\nLength",
  "files": [
    {
      "category": "Resource",
      "title": "Assigned homework Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-705-commutative-algebra-fall-2008/90050ff8c2dece1c2aeccc250df96397_handoutprob.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.705 Commutative Algebra\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n18.705 Assigned homework problems\nS. L. Kleiman, fall 2008\n* Problem SLK 1 (The '*' means that this problem is to be presented in class.) Let B be a\nring, I an ideal, and A := B[y] the polynomial ring. Construct an isomorphism from A/IA\nonto (B/I)[y].\nProblem SLK 2 Let B be a UFD, and A := B[y] the polynomial ring. Let f be a polynomial\nthat has a term byi with i > 0 such that b is not divisible by some prime element p in B.\nProve that the ideal (f) is not maximal.\nProblem SLK 3 Let L, M, N be A-modules, and α: L\nM, β : M\nN, σ : N\nM, ρ: M\n→\n→\n→\n→\nL homomorphisms. Prove that M = L ⊕N and α = iL, β = πN , σ = iN , ρ = πL if and\nonly and if and only if the following relations hold: βα = 0, βσ = 1, ρσ = 0, ρα = 1, and\nαρ + σβ = 1.\nProblem SLK 4 Let k be a field, and K an algebraically closed field containing k. (Recall that K\ncontains a copy of every algebraic extension of k.) Let A be the polynomial ring in n variables\nover k, and f, f1, . . . , fr polynomials in A. Suppose that, for any n-tuple a := (a1, . . . , an) of\nelements ai of K such that f1(a) = 0, . . . , fr(a) = 0, also f(a) = 0. Prove that there are an\ninteger N and polynomials g1, . . . , gr in A such that f N = g1f1 +\n+ grfr.\n· · ·\nProblem SLK 5 Let A be a ring, and P a module. Then P is called projective if the functor\nN 7→ Hom(P, N) is exact. (1) Prove that P is projective if and only if, given any surjection\nψ : M\nN, every map ν : P\nN lifts to a map μ: P\nM; that is, ψμ = ν. (2) Prove that\n→\n→\n→\nφ\nψ\nP is projective if and only if every short exact sequence 0\nL\nM\nP\n0 is split.\n→\n-→\n-→\n→\n(3) Prove that P is projective if and only if P is a direct summand of a free module F ; that\nis, F = P ⊕L for some L. (4) Assume that A is local and that P is finitely generated; then\nprove that P is projective if and only if P is free.\n\nProblem SLK 6 Let A be a Noetherian ring, and P a finitely generated A-module. Prove that\nthe following three conditions are equivalent: (1) P is projective; (2) Pp is free over Ap for\nevery prime ideal p; and (3) P, is free over A, for every maximal ideal m.\nProblem SLK 7 Let A be a ring, M an arbitrary A-module, and I the annihilator of M. Prove\nthat the support Supp(M) is always contained in the set V(I) of primes containing I .\nProblem SLK 8 Let Z be the ring of integers, Q the rational numbers, and set M := Q/Z.\nFind\nthe support Supp(M), and show that it's not Zariski closed (that is, it does not consist of all\nthe primes containing any ideal).\nProblem SLK 9 Let A be a Noetherian ring, M a finitely generated module. Prove that the\nintersection of all the associated primes of M is equal to the radical of the annihilator Ann(M).\n* Problem SLK 10 Let A be a Noetherian ring, I and J ideals. Assume JAp is contained in\nIAp for all associated primes P of AlI. Prove J is contained in I.\n* Problem SLK 11 Let A be a Noetherian ring, x E A. Assume x lies in no associated prime of\nA/I. Prove the intersection of the ideals (x) and I is equal to their product (x)I.\n\np\nProblem SLK 12 Let A be a Noetherian ring, M a finitely generated module, Q a submodule.\nSet P :=\nAnn(M/Q). Prove the equivalence of these two conditions:\n(1) Q is P -primary; that is, Ass(M/Q) = {P }; and\n(2) every zero divisor on M/Q is nilpotent on M/Q; in other words, given an a ∈A for\nwhich there exists an x ∈M -Q such that ax ∈Q, necessarily a ∈P .\nProblem SLK 13 Let A be a domain, K its fraction field. Show that A is a valuation ring if and\nonly if, given any two ideals I and J, either I lies in J or J lies in I.\n* Problem SLK 14 Let v be a valuation of a field K, and x1, . . . , xn nonzero elements of K with\nn > 1. Show that (1) if v(x1) and v(x2) are distinct, then v(x1 + x2) = min{v(x1), v(x2)}\nand that (2) if x1 +\n+ xn = 0, then v(xi) = v(xj ) for two distinct indices i and j.\n· · ·\nProblem SLK 15 Prove that a valuation ring is normal.\nProblem SLK 16 Let A be a Dedekind domain. Suppose A is semilocal (that is, A has only\nfinitely many maximal ideals). Prove A is a PID.\n\nProblem SLK 17 Let A be a Noetherian ring, and suppose AP is a domain for every prime P .\nProve the following four statements:\n(1) Every associated prime of A is minimal.\n(2) The ring A is reduced.\n(3) The minimal primes of A are pairwise coprime.\n(4) The ring A is equal to the product of its quotients A/P as P ranges over the set of\nall minimal primes.\nProblem SLK 18 Let A be a UFD, and M an invertible fractional ideal. Prove M is principal.\n* Problem SLK 19 Let A be a domain, K its fraction field, L a finite extension field, and B the\nintegral closure of A in L. Show that L is the fraction field of B. Show that, in fact, every\nelement of L can be expressed as a fraction b/a where b is in B and a is in A.\nProblem SLK 20 Let A ⊂B be domains, and K, L their fraction fields. Assume that B is a\nfinitely generated A-algebra, and that L is a finite dimensional K-vector space. Prove that\nthere exists an f ∈A such that Bf is a finite generated Af -module.\nProblem SLK 21 Let A be a ring, P a prime ideal, and B an integral extension ring. Suppose\nB has just one prime Q over P . Show (a) that QBP is the only maximal ideal of BP , (b)\nthat BQ = BP , and (c) that BQ is integral over AP .\nProblem SLK 22 Let A be a ring, P a prime ideal, B an integral extension ring. Suppose B is a\ndomain, and has at least two distinct primes Q and Q′ over P . Show BQ is not integral over\nAP . Show, in fact, that if x lies in Q′, but not in Q, then 1/x ∈BQ is not integral over AP .\nProblem SLK 23 Let k be a field, and x an indeterminate. Set B := k[x], and set y := x2 and\nA := k[y]. Set P := (y -1)A and Q := (x -1)B. Is BQ is integral over AP ? Explain.\n\n* Problem SLK 24 Let A be a ring (possibly not Noetherian), P a prime ideal, and B a module\nfinite A-algebra. Show that B has only finitely many primes Q over P . [Hint: reduce to the\ncase that A is a field by localizing at P and passing to the residue rings.]\nProblem SLK 25 Let k be a field, A a finitely generated k-algebra, and f a nonzero element of\nA. Assume A is a domain. Prove that A and its localization Af have the same dimension.\nProblem SLK 26 Let A be a DVR, and f a uniformizing parameter.\nShow that A and its\nlocalization Af do NOT have the same dimension.\nProblem SLK 27 Let L/K be an algebraic field extension. Let X1, . . . , Xn be indeterminates,\nand A and B the corresponding polynomial rings over K and L. (1) Let Q be a prime of B,\nand P its contraction in A. Show ht(P ) = ht(Q). (2) Let f and g be two polynomials in A\nwith no common factors in A. Show f and g have no common factors in B.\n* Problem SLK 28 Let k be a field, and A a finitely generated k-algebra. Prove that A is Artin\nif and only if A is a finite-dimensional k-vector space.\nProblem SLK 29 Let A be an r-dimensional finitely generated domain over a field, and x an\nelement that's neither 0 nor a unit. Set B := A/(x). Prove that B is equidimensional of\ndimension r -1 (that is, dim(B/Q) = r -1 for every minimal prime Q); prove that, in fact,\nr -1 is the length of any maximal chain of primes in B.\n* Problem SLK 30 Let A, m be a Noetherian local ring. Assume that m is generated by an\nA-sequence x1, . . . , xr. Prove that A is regular of dimension r.\n\nQ\nProblem SLK 31 Let A, m be a Noetherian local ring of dimension r, and B := A/I a factor\nring of dimension s. Set t := r -s. Prove that the following three conditions are equivalent:\n(1) A is regular, and I is generated by t members of a regular sop; (2) B is regular, and I is\ngenerated by t elements; and (3) A and B are regular.\nProblem SLK 32 (a) Let A be a Noetherian local ring, and P a principal prime ideal of height\n1. Prove that A is a domain.\n(b) Let k be a field, and x an indeterminate. Show that the product ring k[x] × k[x] is\nnot a domain, yet it contains a principal prime ideal P of height 1.\nProblem SLK 33 (a) Let A be a ring, S a multiplicative set, and M an A-module. Prove that\nS-1M = S-1A⊗M by showing that the two natural maps M →S-1M and M →S-1A⊗M\nenjoy the same universal property.\n(b) Show that (1, 1, . . . ) is nonzero in Q ⊗\nZ/(i)\ni\n.\n* Problem SLK 34 Let A be a ring, I and J ideals, and M an A-module.\n(a) Use the right exactness of tensor product to show that (A/I) ⊗M = M/IM.\n(b) Show that (A/I) ⊗(A/J) = A/(I + J).\n(c) Assume that A is a local ring with residue field k, and that M is finitely generated.\nShow that M = 0 if and only if M ⊗k = 0.\n(d) Let R be the real numbers, C the complex numbers, and X an indeterminate. Using\nthe formula C = R[X]/(1 + X2), express C ⊗R C as a product of Artin local rings,\nidentifying the factors.\nProblem SLK 35: Let A be an arbitary ring, M and N A-modules, and k a field.\n(a) Assume M and N are free of ranks m and n. Prove that M ⊗N is free of rank mn.\n(b) Given nonzero k-vector spaces V and W , show that V ⊗W is also nonzero.\n(c) Assume A is local, and M and N are finitely generated. Prove that M ⊗N = 0 if\nonly only if M = 0 or N = 0.\n(d) Assume M and N are finitely generated. Prove Supp(M ⊗N) = Supp(M)∩Supp(N)."
    },
    {
      "category": "Resource",
      "title": "Refined Noether Normalization Lemma",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-705-commutative-algebra-fall-2008/87fd77a0eeca6d6baebbd028751a85fa_handoutnoeth.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.705 Commutative Algebra\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nX\nX\n18.705\nS. L. Kleiman, fall 2008\nTheorem (Refined Noether Normalization Lemma). Let k be a field, R a finitely\ngenerated k-algebra, and a1 ⊂ · · · ⊂ ar ⫋ R a chain of proper ideals. Then there\nexist algebraically independent elements t1, . . . , tn of R such that\n(a) R is module finite over k[t1, . . . tn];\n(b) for 1 ≤ i ≤ r, there is an h(i) such that ai ∩k[t1, . . . tn] = t1, . . . , th(i) .\nProof (Cf. [Bourbaki, \"Commutative Algebra,\" Thm. 1, p. 344].)\nBy hypoth\nesis, R = S/b0 where S is a polynomial ring k[T1, . . . , Tm]. Say ai = bi/b0. Then it\nsuffices to prove the assertion for S and b0 ⊂ b1 ⊂ · · · ⊂ br. Thus we may assume\nR is the polynomial algebra k[T1, . . . , Tm]. The proof proceeds by induction on r.\nFirst, suppose r = 1 and a1 is a principal ideal generated by a nonzero element\nt1. Then t1 ∈ k because\n\nR. Write t1 = P\nj1 · · · T jm where (j) denotes\n/\na1 =\na(j)T1\nm\n(j1, . . . , jm) ∈ Zm and a(j) ∈ k is nonzero.\nWe are going to choose positive\n≥0\nintegers si for 2 ≤ i ≤ m such that T1 is integral over R ′ := k[t1, t2, . . . , tm] where\nti := Ti -T1\nsi . Then clearly, (a) follows.\nNote that T1 satisfies the equation,\nt1 -\na(j)T1\nj1 (t2 + T1\ns2 )j2 · · · (tm + T1\nsm )jm = 0.\nSet e(j) := j1 + s2j2 + · · · + smjm. Take si := li where l is an integer greater than\nall of the ji. Then the e(j) are distinct. Let e(j ′ ) be largest e(j). Then the above\nequation can be written in the form\na(j′ )T1\ne(j ′ ) +\nQvT1\nv = 0\nv<e(j′ )\nwhere Qv ∈ R ′ , and hence, T1 is integral over R ′ . Thus (a) holds.\nBy the theory of transcendence bases [Artin, \"Algebra,\" Ch. 13, § 8, pp. 525-\n527], the elements t1, . . . , tm are algebraically independent. Let x ∈ a1 ∩R ′ . Then\nx = t1x ′ where x ′ ∈ R ∩k(t1, . . . , tm). Furthermore, R ∩k(t1, . . . tm) = R ′ because\nR ′ is normal as it is a polynomial algebra. Hence a1 ∩R ′ = t1R ′ . Thus (b) holds\nin case r = 1 and a1 is principal.\nSecond, suppose r = 1 and a1 is arbitrary. If a1 = 0, then we may take ti := Ti.\nSo assume a1 = 0. The proof proceeds by induction on m. The case m = 1 follows\nfrom the first case (but is simpler) because k[T1] is a principal ring. Let t1 ∈ a1 be\nnonzero. By the first case, there exist elements u2, . . . , um such that t1, u2, . . . um\nare algebraically independent and satisfy (a) and (b) with respect to R and t1R.\nBy induction, there exist elements t2, . . . , tm satisfying (a) and (b) with respect to\nk[u2, . . . , um] and a1 ∩k[u2, . . . , um].\nSet R ′ := k[t1, . . . , tm]. Since R is module finite over k[t1, u2, . . . , um] and the\nlatter is module finite over R ′ , the former is module finite over R ′ . Hence (a) holds,\nand t1, . . . , tm are algebraically independent. Moreover, by hypothesis,\na1 ∩k[t2, . . . , tm] = (t2, . . . , th)\nfor some h ≤ m. So a1 ∩k[t1, . . . , tm] ⊃ (t1, . . . , th).\nConversely, given x ∈ a1 ∩ R ′ , write x = P\ni\nd\n=0 Qiti\n1 where Qi ∈ k[t2, . . . , tm].\nSince t1 ∈ a1, we have Q0 ∈ a1 ∩ k[t2, . . . , tm], so Q(0) ∈ (t2, . . . , th).\nHence\nx ∈ (t1, . . . , th). Thus a1 ∩R ′ = (t1, . . . , th). Thus (b) holds for r = 1.\n\nFinally, suppose the theorem holds for r - 1. Let u1, . . . , um be algebraically\nindependent elements of R satisfying (a) and (b) for the sequence a1 ⊂ · · · ⊂ ar-1,\nand set s := h(r-1). By the second case, there exist elements ts+1, . . . , tm satisfying\n(a) and (b) for k[us+1, . . . , um] and ar ∩k[us+1, . . . , um]. Then\nar ∩k[ts+1, . . . , tm] = ts+1, . . . , th(r)\nfor some h(r). Set ti := ui for 1 ≤ i ≤ s. Set R ′ := k[t1, . . . , tm]. Then R is module\nfinite over k[u1, . . . , um] by hypothesis, and k[u1, . . . , um] is module finite over R ′\nby hypothesis. Hence R is module finite over R ′ . Thus (a) holds, and t1, . . . , tm\nare algebraically independent over k.\nFix i with 1 ≤ i ≤ r. Set l := h(i). Then t1, . . . , tl ∈ ai. Given x ∈ ai ∩ R ′ ,\nwrite x = P\n· · · t\nwith (v) = (v1, . . . , vl) ∈ Zl\nand Q(v) ∈ k[tl+1, . . . , tm].\nQ(v)t1\nv1\nl\nvl\n≥0\nThen Q(0) lies in ai ∩k[tl+1, . . . , tm]. The latter is equal to zero. It is zero if i ≤ r-1\nbecause it lies in ai ∩k[ul+1, . . . , um], which is equal to zero. and ar ∩k[ts+1, . . . , tm]\nis equal to (ts+1, . . . , tl) by hypothesis. So ar ∩k[tl+1, . . . , tm] = 0. Thus Q(0) = 0.\nHence x ∈\nt1, . . . , th(i) . Thus ai ∩ R ′ is contained in\nt1, . . . , th(i) . So the two\nare equal. Thus (b) holds, and the theorem is proved.\nRemark (Another proof ). Suppose k is infinite. Then in the proof of the first\ncase, we can take ti := Ti -aiT1 for suitable ai ∈ k. Namely, say t1 = Hd +· · · +H0\nwhere Hi is homogeneous of degree i in T1, . . . , Tm and Hd = 0. Since k is infinite,\nthere exist ai ∈ k such that Hd(1, a2, . . . , am)\n0. Since Hd(1, a2, . . . , am) is the\n=\ncoefficient of T1\nd in\nHd(T1, t2 + a2T1, . . . , tm + amT1),\nafter collecting like powers of T1, the equation\nt1 -Hd(T1, t2 + a2T1, . . . , tm + amT1) -· · · -H0(T1, t2 + a2T1, . . . , tm + amT1) = 0\nbecomes an equation of integral dependence of degree d for T1 over k[t1, . . . , tm]."
    }
  ]
}