{
  "course_name": "Communicating in American Culture(s)",
  "course_description": "In Communicating in American Culture(s), bilingual students examine how various aspects of American culture—history, geography, institutions, traditions, values—have shaped dominant Anglo-American communication norms and responses to critical events in the world. In addition, you can expect to practice and strengthen your analytical and communication skills in a carefully scaffolded manner, starting with frequent short writing and speaking tasks and progressing to longer, more formal tasks.",
  "topics": [
    "Humanities",
    "Language",
    "English as a Second Language",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Communication",
    "Humanities",
    "Language",
    "English as a Second Language",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hrs /session\n\nPrerequisites\n\nNone\n\nCourse Description\n\nIn\n21G.221 Communicating in American Culture(s)\n, bilingual students examine how various aspects of American culture--history, geography, institutions, traditions, values--have shaped dominant Anglo-American communication norms and responses to critical events in the world. In addition, you can expect to practice and strengthen your analytical and communication skills in a carefully scaffolded manner, starting with frequent short writing and speaking tasks and progressing to longer, more formal tasks.\n\nCourse Format, Etiquette, and Expectations\n\nAs a CI-H (\nCommunication Intensive in the Humanities, Arts, and Social Sciences\n) subject, 21G.221 provides many opportunities to engage with and create written, spoken, and visual texts. You can expect to write and revise a minimum of 5,000 words (a total of 20\ndouble-spaced\npages over 15 weeks) in a variety of genres.\n\nThe course is conducted as a workshop: it is highly interactive, with most class time devoted to discussion, exercises, peer review of texts, and short presentations. The assignments are designed to provide you the chance to delve more deeply into aspects of American cultures and communication patterns that\nyou\nfind particularly interesting.\n\nThe course draws on a range of multimedia materials--written, visual, audio, and video. You are expected to be familiar with the assigned materials for each class session. But the materials\ncannot\nbe considered a substitute for the content and activities that comprise class periods. Much of the success of 21G.221--as well as the benefit you derive from it--will depend on your preparing well to be an active listener as well as an informed and constructive\nparticipant\n.\n\nLearning Outcomes\n\nBy the end of the semester, you will (1) recognize the fundamental role of culture in communication, (2) understand the context and practices of many communication norms and rituals of mainstream American culture, and (3) know more about your own cultural communication style.\n\nYou can expect to practice and strengthen your communication skills in a variety of genres: e.g., the job search, networking, meetings, presentations, memos, and a multi-part white paper. You will be able to\n\nAnalyze the needs and expectations of your reading and listening audiences.\n\nIdentify and overcome barriers to crafting communications according to academic genre conventions and professional expectations.\n\nRefine your critical thinking skills by asking productive questions and seeking rigorous answers.\n\nCommunicate results that demonstrate critical thinking to your audience.\n\nSmart phones and laptops are\nnot\nwelcome except when their occasional use is explicitly invited for in-class activities.\n\nRequired Materials\n\nGonick, Larry. (2005).\nThe\n\nCartoon History of the United States\n. NY: Collins. ISBN: 9780062730985.\n\nAssigned readings, video clips, and still images\n. Please print out the assigned readings for each period and bring them to class.\n\nA folder with pockets to hold print-outs of readings, assignment drafts, etc.\n\nRecommended Resources\n\nLyall, Sarah.\nAbroad in America\n(\nNew York Times\nnewsletter).\n\nWorld Values Survey\n.\n\nPew Global Attitudes Project\n.\n\nAttendance, Participation, and Grading\n\nPlease be familiar with the course schedule and study the assigned materials so that you are informed and can contribute appropriately to class discussions. Fifteen percent of your grade is based on punctuality, attendance, familiarity with the required texts, timely completion of assignments, and constructive contributions to class discussions.\n\nYou are expected to take responsibility for any\nunavoidable tardiness or absences\n(e.g., an off-campus job interview) by notifying me in advance whenever possible, and by consulting with a classmate to learn what was covered in the class that you missed. Those who do not prepare, contribute to discussions, complete (and hand in) assignments on time, and attend class regularly\nwill not\nreceive an A for the course.\n\nAssignmentS\n\nDue dateS\n\nPORTION of grade\n\nAttendance, preparedness, and participation\n\nEvery class\n\n15%\n\nShort (approx. 250 words) written responses: 6 X 2.5 points\n\nWeeks 2-10\n\n15%\n\nShort (approx. 2 min.) formal oral responses: 2 X 5 points\n\nWeeks 2 and 12\n\n10%\n\nMemoir on educational history: first version\n\nWeek 4\n\n5%\n\nMemoir on educational history: final version (1,000 words)\n\nWeek 6\n\n10%\n\nCultural film analysis of\nBreaking Away\n\nWeek 9\n\n10%\n\nWhite paper: draft proposal and annotated bibliography draft (1,000 words)\n\nWeek 11\n\n5%\n\nWhite paper: final proposal and annotated bibliography\n\nWeek 13\n\n5%\n\nWhite paper (1,250 words)\n\nWeek 14 or 15\n\n10%\n\nTeam presentation: group\n\nWeek 14 or 15\n\n10%\n\nTeam presentation: individual\n\nWeek 14 or 15\n\n5%",
  "files": [
    {
      "category": "Resource",
      "title": "Breaking Away Analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/3e8816802c0819a2edde2c8a76cfc329_MIT21G_221S19_breaking.pdf",
      "content": "Breaking Away: Cultural Film Analysis & Memo\nFilms are a useful way of identifying cultural values and behaviors. In fact, S. Kracauer\nclaims that \"the films of a nation reflect its mentality in a more direct way than other artistic\nmedia (Caligari to Hitler: A Psychological History of the German Film, 1947.).\nBreaking Away ( 1979) is considered one of the top 100 American films for a number of\nreasons. One reason may be deep insights provided by the \"outsider status\" of Director\nPeter Yates, an Englishman, and Steve Tesich, the Serbian immigrant who wrote the\nscreenplay.\n(1) The viewing task. Most mainstream films can be viewed as narratives, similar to\nstories, with protagonists and antagonists who are expected to develop, change and struggle\nover time. Breaking Away is a compelling story with the usual narrative elements. But\nmore salient for our purposes, the film provides many interesting examples of American\ncultural values, themes such as the American Dream, and behaviors revealed in daily life;\nclass distinctions; social roles related to age, gender and friendship; family structures; and\ninstitutions such as religion, education, entertainment. These patterns are reflected in all\naspects of the film, including the portrayal of inanimate objects and the sound track.\nBefore you watch the film, choose 3-5 American cultural features among the many we have\nanalyzed in the class materials that interest you. This subset of features of interest can serve\nas your analytical focμs as you watch the film.\nUse the Film Analysis Viewing Guide provided to keep track of the cultural features that\nyou consider in your analytical memo.\n(2) The writing task. Present your cultural analysis of the film in memo format. A memo\nfollows strict content and format conventions. (See the annotated model of a cross-cultural\nanalysis of the film Lost in Translation below to guide your memo writing.)\nYour memo must provide the following:\n- A very short (no more than ~ 100 words) summary of the movie plot\n- An analysis of 3-5 ofthe most salient cultural features in the film, with concrete\nexamples\n- A description of one scene that demonstrates particularly well an aspect of the\nAmerican culture and communication that we have addressed in 21G.221.\n- Several explicit references to course materials, tied into your analysis/examples and\ndocumented appropriately.\nLength of memo: 2-2.5 pages (single-spaced)\nDue: Week 9\n\nFilm Viewing Guide for Cultural Film Analysis\nChoose up to five (one/column) cultural values, themes and behaviors that we have been examining in class e.g., social relationships. As you watch the film, note in\nthe columns specific examples from the film.\nRelationships\ne.g., the couples\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Educational Memoir",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/2764acb772601026f8fee9d93314dd26_MIT21G_221S19_memoir.pdf",
      "content": "Assignment: Educational Memoir (5 points for version oneD 5 points for version two)\nLength: Three to four pages ( I . 5 spacing)\nDescription: You are currently a member of an educational community in the northeastern United\nStates, and are increasingly familiar with the education culture at MIT (a fire hose?). Educational\nsystems, and our experiences of them, are shaped by a variety of cultural forces. Some, if not all, of\nyourtformal K through 12 education may have taken place in another country.\nExtended family and social community are also influential in educating us about how the world\nworks and what our place is in the world.\nAsk yourself the following questions. How do you know what you know? What have your informal\nand formal experiences of learning been? What is the most comfortable way to communicate what\nyou know? Why?\nIn your memoir, explicitly discuss the C:nvironments, people, systems, and tasks that have most\nshaped you as an educated young adult and provide an analytical reflection on your educational\nexperiences. Consider the following sorts of questions as you get started:\n- What informal experiences have had the most significant effect on your knowledge of\nyourself and the world--e.g., with parents, siblings, extended family, and friends?\n- What formal experiences have had the most significant effect on your knowledge of yourself\nand the world---e.g., in schools, clubs, competitions, and sports teams?\n- How has culture (race, gender, religion, class, history, language, etc.) affected your\neducational experience?\n- What impact did the \"K-12\" ( or the equivalent) school curriculum, activities, and\npedagogical practices have on your understanding of society and yourself in terms culture\n(e.g., race, gender, class, history, language).\n- What channels of communication have been typical of your educational experience: reading\nhard copy (literature, text books, handouts, articles); reading digital sources; in-class or\nhomework writing tasks, or private diary entries; listening to live teachers and\nfamily/community members; discussion with live teachers, students, and family members;\non-line classes of any kind? Other?\nGrading is based primarily on the quality of the analysis and the links you make between your\nexperience and the cultural influences we have discussed in class.\n.\n.\nPeer Review Workshop\nI.At home, write as much as you can for your first version of your educational memoir. The more\nyou have done to discuss with your group, and to receive feedback, the less work you will have for\nyour final version.\n2. Watch the short video No one writes alone to understand the role that informal readers of our\nwriting can play in refining communication strategy.\n3. In class, you will work in small groups. Prepare to summarize your content and explain how you\nmade choices about what to include.\n3. Choose a half to one-page piece of your memoir that you would like to review in detail with your\ngroup members. Print out three copies of this piece to use in the workshop.\n4. Make an appointment with Jane to discuss any questions or problems with your draft.\n5. In response to the comments of your peer reviewers, adjust your strategy, content and expression.\nHand in your \"best\" first version in the class after the peer review workshop.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/f3d7eb0ee3eddd5b452fd4e14a4a33c5_MIT21G_221S19_finalproject.pdf",
      "content": "Final Project: Professional White Papers & Presentations\nGenre: The term white paper refers to a well-researched report of any length on a\nparticular topic. It is designed to help readers in the public, administrative and corporate\nworlds understand a particular situation, solve a problem, or make a decision. In addition,\nthe business world is increasingly using the term white paper to promote a product in\nmarketing.\nWe will have several communication workshops before the end of the semester to cover\nresources and genre norms for proposals, report writing, team presentations, and slide\ndesign/use.\nMotivation: This assignment will give you the opportunity to (1) synthesize what you\nhave learned this semester, (2) explore aspects of American culture and communication\nthat particularly interest you, (3) add to your knowledge of how your own culture and\ncommunication context has influenced your reactions to American life, ( 4) practice\ncommunicating in many different genres, including conversation, negotiation, formal\npresentations, proposals and (5) have an impact on communication culture at MIT.\nDescription of your assignment: Whether you have been a student at MIT for six\nmonths or for three years, you have had to work out how to navigate the communication\nnorms of this academic culture, embedded in the broader US culture. Your experience\ncan be an important source of information for the faculty and administrators who design\ncurricula and learning experiences, establish campus policies, and build communities at\nMIT. It can also help other MIT students, present and future, recognize and appreciate\nthe interconnections between culture and communication.\nAs bilingual/bicultural students in 21G.221, you have deepened your understanding of\nthe cultural context-history, language, geography, religion, institutions-in which\nAmerican values and communication norms are embedded. Now you will have the\nopportunity to help others at MIT gain cross-cultural literacy.\n.\n.\nIn small teams you will do one of the following:\n1.oProduce a coherent and well-supported set of realisi'ic guidelines_for MIT's\nInternational Students Office to support matriculated binational undergraduate,\ninternational undergraduate, or international special students ( choose one group) in\ntheir adaptation to MIT culture.o\nE.g., What are the major barriers to these students' adjustment to MIT?\nFrom the students' perspective what conditions, activities, or information\ncould best ease the transition to the MIT?\nE.g., How can specific differences in communication styles between the\nmainstream Anglo-Americans and one or two other countries lead to\nproblems for these bicultural students? Provide guidelines for the ISO to\ndistribute to prospective students.o\n2.oIdentify and define one particular problem experienced by MIT's international oro\n\nFinal Project: Professional White Papers & Presentations\nbilingual/bicultural students that most needs attention and recommend a realistic\nsolution to the problem in a white paper to an appropriate member of MIT's upper\nadministration (President, Chancellor, Dean).\nE.g., What is the impact of the current political situation and discourse one\nbicultural or international students? What does MIT need to do better toe\nsupport students in this context?e\nE.g., Some say that using the health care system at MIT is complicated,e\nirregular and definitely not user friendly. Why is it so confusing fore\ninternational students and what can MIT do to remedy the situation?e\n3.eIdentify and describe several aspects of the undergraduate support system that havee\nbeen particularly successful and provide concrete examples to support your positive\nassessment; i.e., what is working well?e\nE.g., What is the impact of the current political situation and discourse one\nMIT's bilingual/bicultural or international students? What is particularlye\nhelpful about the way MIT is dealing with the situation?e\nE.g., How do the differences in communication styles between the US and onee\nor two other countries free international students from particulare\ncultural/communication restraints?e\n4.eProvide a substantive background to one particular aspect of adjusting to life as ae\nbicultural or international student at MIT to help staff involved in undergraduate lifee\n-better understand the students' perspective?e\nE.g., What are some surprising taboos at WT / in the USA that you were\nunprepared to manage? Why?\nE.g., If an important aspect of American life is portrayed in a distorted way ine\nthe media ofX country, explain how and why this occurs, and how youe\nadapted to the reality when you arrived.e\nFinal Product: White Paper\nDepending on its nature, your reports will vary in format and length. For example, you\nmay want toeintegrate a survey instrument and data set; a FAQ brochure; a series of\nwebpages that could potentially be integrated into the ISO homepage; a series of images;\naudio or video clips; or an annotated list of mixed media resources for prospective\ninternational students.\nFinal Product: Team Presentations\nOn the day of your presentation, each team must hand in a hard copy dossier that\nincludes the following: All drafts of (1) the proposal, (2) the annotated list ofresources,\n(3) the outline, and (4) presentation slides, printed 4 slides/page.e\n\nFinal Project: Professional White Papers & Presentations\nThe Multi-step Process. Creating the paper and presentation as a team will take place\nthroughout the second half of the semester. It will begin in Week 6, when you will\nidentify the topics that most interest you, and it involves different in-class and homework\ntasks, as well as plenty of practice and feedback.\nWeek\n6-11e\n6-11\n12-13e\n13-15e\n14e\n14-15e\nTeam resentations with Q & A 5% individual; 10% team\nStep #1: The first step is to start identifying broad areas within the context of 21G.221\nthat interest you as an individual, for example:\nRole of argumentation in the US / at MIT\nDifficult conversations in the US / at MIT\nDifferences between academic systems in country X and the US: teaching &\nlearning styles; teacher/student relationships; assignments\nAdjusting to English language in daily use\nFitting in to MIT dormitory and social life\nUnderstanding American/MIT humor\nFriendships in the US / at MIT: barriers; aids; value\nTaking care of oneself day to day at MIT: schedule; food; sleep; exercise; balance\nAmerican/MIT health care: Doctors; appointments; mental health; treatments\nFree speech in US / at MIT\nReligion in US / at MIT\nRace in US / at MIT\nAmerican/MIT visual communication, for example: fashion, arts, urban form,\nadvertising\nStep #2: After conducting a survey, I will put together teams based on your interests.\nYou will be working in small teams of two or three. You may choose any topic or\nquestion that intrigues the team-as long as it involves features of American culture(s)\nand communication norms, enhances your understanding of your life here, and lends\nitself to appropriate research that will lead to increasing the cultural literacy of other units\nat MIT.\nYour team's first job will be to narrow down the topic so that it can be reasonably\ndeveloped into a white paper and a 15- to 20-minute presentation.\nStep #3: Your team will be responsible for submitting Proposal I+ preliminary\nannotated bibliography.\n\nFinal Project: Professional White Papers & Presentations\nThis is a two-to-four-page document (1.5 spaced) in which you describe the question or\ntopic that you plan to address and.include an initial annotated list of some ofthe\nresources you will use. You should be familiar with the notions of common knowledge\nand citing evidence from varied sources, such as surveys; books and scholarly journals on\nhigher education, culture and communication; as well as films, TV, music and other\npopular culture.\nAll materials that you use to illustrate and support your arguments must come from\nreputable sources. Please be sure to include at least two of each of the following:\nnewspaper/magazine articles; articles from scholarly journals; hard copy books; other\nmedia (blogs, personal interviews, surveys, on-line resources, feature films,\ndocumentaries, TV shows, radio programs, or live performances). All documentation\nmust be internally consistent and cited according to APA or Chicago conventions. See\nthe Stellar Assignment Folder for an example of an annotated bibliography.\nStep #4 Proposal II+ annotated bibliography + outline\nAll groups will be expected to add and refine research sources that you have found in the\ninterim between Proposal Version I and Proposal Version II. Depending on my\nfeedback, you may need to substantially revise or simply fine tune and resubmit your\noriginal proposal and biblio_graphy. In addition, you must include a tentative outline.\nFinal Product: White Paper\nDepending on its nature, your reports will vary in length. You may want to include, as\npart of your report, a survey instrument and data set; a FAQs brochure; a series of\nwebpages to potentially integrate into the homepage of an appropriate MIT unit; a series\nof images, audio or video clips; or an annotated list of mixed media resources to help\nprospective bicultural or international students adjust to the American context.\nTeam Presentations\nEvery team member must speak, so the length of time needed will depend on the number\nof people on the team. Appropriate visual aids must support the presentations. At the\nstart of the presentation, each team must hand in a hard copy dossier that includes the\nfollowing: All drafts of ( 1) the proposal, (2) the annotated list of resources, (3) the\noutline, and ( 4) presentation slides, printed 4 slides/page.\nBefore the official presentations, each team will have the opportunity to rehearse and\nreceive extensive feedback. Bring with you an outline of the team presentation and hard\ncopies of your slides. The more complete you can make these materials, the more\nguidance I can give you for a successful final report and presentation.\n\nChecklist for Effective Proposals\nAn effective proposal answers the key questions satisfactorily and conform\nto the reader's expectations about format, contents, level of detail, and tone.\nCan you make the following claims about your proposal?\nI.eMy group's proposal shows sensitivity to audience and purpose. This ise\nreflected in thee\n-e Formate\n-e Tonee\n-e Amount and quality of background informatione\n-e Amount of concrete detaile\n2.eMy group's proposal has a strong introduction, including cleare\nexpression ofe\n-e Context/backgrounde\n-e Problem/question/hole/motivatione\n-e Objectivese\n3.eMy group's proposal provides a detailed description of my approache\n(using future verb forms) that allows the audience to be confident in mye\ncompetence.e\n4.eMy group's proposal clearly states the benefits/expected outcomes as ae\nresult of my project.e\n5.eMy group's proposal includes appropriate annotated bibliography.e\n6.eMy group's proposai demonstrates the accurate and appropriate use ofe\nparagraphs with topic sentences, sentence boundaries, grammar and worde\nchoice.e\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Short Written Response",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/3aa0e95c9e5ec4ced27b9d320bac651c_MIT21G_221S19_swr.pdf",
      "content": "Short Written Response Assignments\nIn 21G.221, you will write six short, written responses to specific prompts. The prompts vary from\neliciting personal reflections to comparing two or more authors' perspectives to speculating about the\nfuture. They are designed to (1) motivate you to read the materials and engage with the content, (2) help\nyou synthesize information from different sources, including yourself, (3) give you practice in\nwriting efficiently and concisely in a relatively low-risk environment, (4) and provide opportunities for\nplenty of feedback on your communication over the semester.\nEach response is worth 2.5 points.\nModel of personal reflection response. This sample written response below demonstrates the length,\nlevel of detail, and thoughtful content that I expect.\nPrompt: Scholars of linguistics have noted differences in the ways men and woman engage in\n\"conversation rituals.\" Have you noticed any differences? Comment.\nConversation rituals between men and women differ in several important aspects, including\ngiving praise, thanking others, making sinall talk, complaining and apologizing.\nMen and women differ in the frequency and type of compliments. Men rarely give praise to\neach other directly, as it could be taken as a sign of weakness. For example, if I tell a male friend that I\nlike his shirt, I am making myself vulnerable to a sarcastic retort. However, when a woman compliments\nherfriend, there is the implicit pressure to reciprocate the sentiment. This is especially obvious when\nwomen are discussing their outfits ofthe day.\nPerhaps because it puts them in an emotionally disadvantageous position, men avoid explicitly\nrecognizing that they are in debt to another man,· whereas it is customary for women to reciprocate\nfeelings of thankfulness, especially at the end of a conversation. I commonly hear statements like\n\"Thanks so much for lunch!\" \"No, thankyoufor taking the time out to help me with this problem!\"\nAnother conversational difference lies in the fact that women are more likely to talk about their\npersonal thoughts and/eelings in small talk than men are. There seems to be an implicit understanding\nof trust and secrecy among women. However, in my experience at MIT, men mainly talk about sports,\npolitics, and girls during small talk-topics which are not inherently personal. Men also lilre to poke fun\nat each other during small talk, whereas I have noticed that women rarely directly verbally attack the\nother person, even in jest.\nMen complain in order to pool ideas with their peers in order to strategize and solve a problem,\nwhile women more often complain to one another in order to feel reassured and understood. I have\nalso noticed that men often find ways to boast while complaining about their problems, e.g. \"I am\ninvolved in so many activities, I barely got any sleep last night. \"In a related area of communication,\nmen see apologizing as a direct act of taking blame or responsibility, and as such they often avoid it\nunless it is unavoidable. On the other hand, women often insert the w_ords \"I'm sorry\" into\nconversation even if they are not at fault.\nIn my experience, conversation rituals between men are less direct, less personal, and more\ninherently competitive, whereas rituals between women are often supported by underlying trust and\nrapport.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s)\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Oral Response #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/0a8bcb86d3d6b3d11316b8d4fa49910e_MIT21G_221S19_oral1.pdf",
      "content": "Oral Response #1: · Cultural Self-Introduction (5 points)\nContext: This activity is motivated by the frequent need in social, academic and\nprofessional life to succinctly summarize key information. In job interview or\nnetworking contexts, for example, a common direction is \"Tell me about yourself,\" with\nthe expectation that we provide the essentials within two minutes. Otherwise, our\nconversation partner loses interest.\nIn the world of management, a summary of a product pitch is referred to as the \"elevator\nspeech.\" In an academic context, a research sumn1ary is sometimes called \"an academic\nminute.\" For students of 210.221, this nano-presentation is an introduction to yourself\nas an individual who has been shaped by your cultural experiences.\nWhat is expected: Each of you will present an \"academic minute\" (no longer than 120\nseconds) to members of the class. Your introduction should be extemporaneous (not\nmemorized and not read aloud), and your tone should be conversational. You will be\nvideotaped and have the chance to see yourself in action.\nCriteria for grading: Your challenge will be to (1) identify several of the most salient\nfeatures of your cultural self and (2) prepare and deliver a short conversational summary.\nYour classmates and I will provide feedback on the success of your strategy and delivery\naccording to the following criteria.\nStrategy\nDelivery and Use\nFocus ofresponse\nPosition of presenter & gestures\nLinking to course content\nEye contact & facial expressions\nExtemporaneous delivery\nListener ease: volume, rate, clarity\nTiming: 60-120 seconds\nSigns of confidence\nSelf-evaluation: I will videotape and send you a private link so you can watch the video\nand send me a short e-mail message identifying (1) one or two concrete features of your\ndelivery that you feel good about and (2) one or two concrete features that you would\nlike to improve over the course of the semester.\nOptional assignment: Watch your video again. As you watch, create a written\ntranscript of the first 45 seconds; note every word, pause or sound. Use the transcript as\nyou watch for a third time to identify concrete features of your presentation that\ndemonstrate particular strengths or weaknesses. Schedule an appointment to debrief.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Oral Response #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/b7f7b12ada9ed4fc425fbeab19442385_MIT21G_221S19_oral2.pdf",
      "content": "Oral Response #2: Survey Report on TV Viewing (5 points)\nContext: Gathering data, finding patterns in the data, and interpreting the patterns is a\ncentral activity of university and professional life.\nConduct an informal interview of approximately 10 of your friends and acquaintances\nabout their TV watching habits. Design and ask them three-four questions that are\ninformed by the materials you have studied for class. Is the \"survey data\" from these\ninformal interviews supportive, contradictory, or distinct from the main themes\ndeveloped in the assigned materials?\nPrepare to describe your survey questions, your results and your interpretation in a well\norganized three-minute presentation.\nWhat is expected: Each of you will present (no longer than three minutes) to members\nof the class. Your survey report should be extemporaneous (not memorized and not read\naloud), and your tone should be conversational. You will be videotaped and have the\nchance to see yourself in action.\nCriteria for grading: Your classmates and I will provide feedback on the success of\nyour strategy and delivery according to the following criteria.\nStrategy\nDelivery and Use\nFocus of response\nPosition of presenter & gestures\nLinking to course content\nEye contact & facial expressions\nExtemporaneous delivery\nListener ease: volume, rate, clarity\nTiming: Maximum 3 minutes\nSigns of confidence\nSelf-evaluation: I will videotape and send you a private link so you can watch and send\nme a short e-mail message assessing your delivery skills.\nOptional assignment: Watch your video again. As you watch, create a written\ntranscript of the first 45 seconds; note every word, pause or sound. Use the transcript as\nyou watch for a third time to identify concrete features of your presentation that\ndemonstrate particular strengths or weaknesses. Schedule an appointment to debrief.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course Workbook Part 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/65088d436047a6add4dfc1d82566eea7_MIT21G_221S19_cw1.pdf",
      "content": "Reading Like a Professional\nThe daily life of scholars, scientists and engineers in the US involves a great deal of\nchallenging reading. We cannot take the time to read every word. We must scan, which\nmeans quickly find the most important contents-the \"news.\" Luckily, effective writers\nhave developed a number of conventions that allow us to find our way through\ndocuments easily and retrieve the information we seek.\nA clear understanding of the general organization and \"logic\" of professional\ndocuments is an essential tool for efficient reading. We expect a document to explain the\nresearch project's purpose, relevance, and outcome in the first sections that we read. We\nalso understand that many professional documents are deliberately repetitive. Some of\nthe most important infonnation is stated in several different places within one paper. For\nexample, many documents provide key information (e.g., results of a resear:ch project) in\nthree places: between the title and the body of the paper, as an abstract or executive\nsummary; in a more detailed subtitled section of the body that focuses on that\ninformation; and at the end of a paper, in a summary paragraph.\nIn fact, we should closely study a document's appearance, including titles and\nsubtitles. These signals attract our attention because they are generally highlighted by\nbold font and extra space in the document. Rather than reading from the start of a paper\nto the end, we can use the key terms provided in these or_ganizational devices to lead us to\nthe section or subsection of most interest. For example, the following subheadings\nclearly indicate the information we will find in these sections of a paper: \" Research\nobjectives\" \"Theoretical study\" and \"Preliminary results.\"\nSkilled readers also benefit from the conventions of English paragraph structure.\nAll formal documents are composed of paragraphs. A change in paragraphs is signaled\nby indenting the first line, or by including an extra line between them. This use of space\nallows us to identify and move between paragraphs easily. Why is it important to be able\nto navigate between paragraphs? The first sentence or two provides its key message.\nThe rest of the sentences in a paragraph provide details that support the general message.\nIn the sections of a paper that hold less interest, we often read only the first two sentences\nof a paragraph-that is, we skim-before we move on to the next paragraph. To ensure\nthat we notice important details embedded in a paragraph, writers can provide a list, table\nor figure, which is formatted to draw our attention.\nIn addition to these organizational, formatting and paragraphing conventions, we\ncan identify signals at the sentence level to help us skim effectively. Standard phrases\nfrequently appear at the start of topic and other sentences to indicate the kind of\ninformation that follows. For example, the phrase --In addition\" at the start ohhis\nparagraph signals that more tools for professional reading will be presented. A writer can\nsignal constraints, problems or disagreements with \"however\" or \"on the other hand.\" At\nthe start of the next paragraph, the phrase \"in sum\" signals that this Ʋhort reading has\ncome to an end.\nIn sum, professional writers and readers in the US work within a set of rules that\nallow the reader to retrieve information from a document efficiently. One good test of\nreader-friendly writing is to see if you can construct a swnmary of the key content of a\ndocument using only the first two sentences of each paragraph. Does this document pass\nthe test?\nTask: Define scan and skim.\n\nEffective Impromptu Speaking\nSpeaking with little advance preparation--impromptu speaking-can be intimidating. Effective\nspontaneous speaking is, however, essential for success in academic and professional life.\nA. Common contexts requiring good impromptu skills\n- Interactive classes, such as those based on case studies\n- Study groups\n- Team projects\n- Professional meetings and networking\n- Job Interviews\n- Q & A sessions of presentations\n- Poster sessions\nB. Strategies to help in these situations\n- Anticipate the likelihood of your contributions being solicited and the topics being\ncovered in a given context. In most cases, you will be asked to speak on a familiar\nsubject.\n- Speak briefly and directly to the point. Do not ramble or repeat yourself. Unless the\ncontext requires it, do not feel that you must provide a lengthy treatment of a topic. A\nrefined three-step approach works well:\nMake a short statement to enter the topic\n-\nConcisely make your point\n-\nExit gracefully\n- If concrete detail and examples are required, try to relate your contributions to the topics\nand experiences you know best.\n- Use gambits to \"buy time,\" organize your thoughts and create movement.\n- Remember the power of nonverbal communication. Speak at a reasonable rate and\nvolume. Use your eye contact, posture and gestures to convey confidence and sincerity.\nC. Sample gambits for graceful impromptu communication\nHesitation (don't overuse)\nIntroducing the topic/Framing\nWell\nI have two points to make.\nLet's see\nI have conflicting reactions.\nLet me think\nX has raised a good question.\nHow can I describe/put/explain\nI'd like to add something.\n\nEffective Impromptu Speaking\nMovement\nReference\nLet me first\nAs X said earlier\nThe second/third/last X\nWe decided last week\nWhy is this a good approach?\nStudent/author gave a good\nexample of\nConcluding\nTo summarize,\nSo, these are the reasons\nI'd like to hear what others think about X.\nDo you understand what I mean?\nD. Task: Practicing contributing to the conversation. In pairs, take turns doing impromptus on\nthe topics below. Use g'!lllbits from the list above to frame your comments.\n1. If you could magnify one of your senses permanently, which would you choose? Why?\n2. Describe the role of sports in the life of the average citizen in your country.\n3. In your opinion, what is the safest practical form of electrical power production?\n4. What should the US be doing to prevent global warming?\n5. Can online education work?\n6. What would you tell a friend from high school who was considering applying to grad\nschool at MIT?\n7. Why is nonverbal communication important?\n\nCritical Listening: Common Structure Cues\nSkilled speakers use patterns (gambits) that help audience members understand\nthe content and progression of their presentations. Used appropriately, these signals help\nmake spoken communication effective (whether impromptu, or in a meeting or formal\npresentation) because they move the listeners smoothly along and give the information\ncoherence.\nA critical listener is careful to recognize these signals and is then prepared for the\norganizational pattern that the speaker has indicated. For example, the comment \"I am\ngoing to argue that free trade is important for a number of reasons\" alerts the audience to\nlisten for a series of distinct arguments. On the other hand, the comment \"I'd like to look\nat US health care policy with respect to the rest of the developed world.\" indicates a\ncomparative approach.\nTask 1: Review the following gambits carefully. Circle the ones with which you are\nfamiliar.\nTask 2: Before the next class, pay close attention in your lectures, seminars, and\nconversations to hear these expressions. Make a list of all that you notice. Be prepared\nto report back to your classmates on the kinds of organizational cues you heard.\nIntroduction Cues\nBy way of introduction. . .\nFirst, I'd like to\nYesterday, we were looking at/discussing/talking about ... Let me start by\nTo pick up where we left off...\nMy main goal today is\nTo summarize briefly before we begin ...\nThe topic of today's lecture is ...\nOrganization Cues\n- Generalization/Specific\nGenerally speaking ...\nIn general ..\nOn the whole .. .\nOverall .. .\nBy and large .. .\nFor the most part ...\n- Chronological Order\nTo begin with ...\nIn the beginning ...\nFirst, 2nd ...\n'Then ...\nNext ...\nFollowing this\nAfterwards .. .\nSubsequently ...\nBefore\nUltimately .. .\nFinally ...\n- Comparison/Contrast\nSimilarly ...\nIn like fashion ...\n\nIn contrast . . .\nIn contrast to this\nLikewise ...\nOn the one hand/on the other hand\n- Cause/Effect\nAs a result ...\nThus ...\nIf this occurs, then . - .\nBecause of this ...\nMain Idea Cues\nLet me stress that ...\nLet me repeat. ..\nThis is a major factor ...\nWhy was this so important?\nI'd like to emphasize -..\nExample or Detail Cues\nFor one thing ... for another ...\nMoreover ...\nFor instance ...\nA few of these are ..-\nFurthermore ...\nThe upshot of this is ...\nTherefore ...\nThe outcome of this ...\nConsequently ...\nThe principal point is ...\nThe main idea is ...\nThe remarkable thing is .. .\nIt is of significance that .. . Most\nimportant to remember is .-.\nFor example .. .\nIn the case of ..\nAlso ...\nOn such case ...\nIn addition ..\nDigression Cues\nIncidentally\nBut before we get to that ..-\nThat reminds me ...\nThat makes me think of ...\nBy the way ...\nOf course ...\nAmendment Clues\nI just remembered ...\nI almost forgot ...\nConclusion Cues\nIn conclusion .. .\nTo summarize ..\nIn summary .. .\nMy goal today was...\nI forgot to mention ...\nI just realized ...\nLet me leave you with the following\nTo conclude ...\nThe final thought I'd like to leave you with...\nI'd like you to leave today with a clear idea...\n\nCritical Listening: Coping with Speaker Faults\nNo speaker is perfect. Even the most professional lecturer can have good and bad\ndays. In order to get the most out of a lecture or presentation, you must be a \"critical\nlistener.\"\nCritical listeners separate essential information from the nonessential information\nas they listen. To do this, you must be actively involved in listening. As you listen,\ncarry on a dialogue in your head, mentally challenge the position of the speaker, and\nwonder about the speaker's choice of examples. A practiced critical listener will\nconcentrate especially hard when aware that a speaker has one or more of the following\nfaults:\n1) A digression-occurs when a speaker makes a side comment unrelated, or minimally\nrelated, to the main topic.\n2) An amendment--occurs when a speaker suddenly realizes that s/he has given\ninaccurate information and tries to correct the problem. In this awkward situation,\nwordiness and confusion may make the speaker hard to follow.\n3) Dependency on entertainment, such as anecdotes, jokes, and lengthy introductions\ncan be distracting and misleading.\n4) Weak or faulty example--may lead to confusion, or even support a different point\nthan the speaker intends.\n5) Imbalance-occurs when a speaker runs out of time. In this case, several important\npoints can be made in a rush at the end of the talk, without the usual signals of\nimportance.\nTask: In the next two days, pay close attention in your lectures to see if any of these five\ncommon faults occur. Be prepared to report back to your classmates. List any speaker\nfaults that challenged your listening skills, and note, as well, how the speaker \"got back\non track.''\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course Workbook Part 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/ad53943eb192ba5ca03a6efd647838d5_MIT21G_221S19_cw2.pdf",
      "content": "Seven Tips for Reader-friendly Writing\nBelow are guidelines for fine-tuning your writing. Each ruJe is followed by sample\nsentences that need revision.\n1. Use active verbs whenever possible.\nImprove: The data are indicative of the problem.\n2. Keep subjects and verbs as close together as possible.\nImprove: Dr. Simmons, because she was concerned about safety, recommended\nadditional supervision of the pediatric ward. (GS)\n3. Place each modifier next to the word or phrase it modifies.\nImprove: Other issues were considered at the final stages of the planning meeting of\nlesser importance.\n4. Avoid long sentences.\nSocial Entrepreneurship is the adoption of a market-driven mindset by a not-for-profit\norganization in order to balance the need for fiscal responsibility and sustainability\nwhile maximizing its social impact through the pursuit of earned income opportunities\nas part of an overall revenue strategy.\n5. Use explicit transitions for readers' ease of movement.\nImprove: Companies wanting to attract new clients to the area are concerned by the\nrising crime rates. Car break-ins have increased by 20% in the last two years.\n6. Eliminate wordiness.\n- Avoid descriptions of your thought process.\nImprove: When I first broached this subject, I expected to be supportive of the new\napproach outlined in this report. However, the more I studied the situation, the more I\nsaw how profoundly flawed the proposed policy is.\n\n-\nBe concise and modem; use simple language.\nImprove: Many of the top tier universities have come to the considered opinion that the\ncontinuous tuition increases over the last ten years are not going to be able to continue\nbecause of strong resistance from many Americans to the soaring price of higher\neducation. (JW)\n-\nAvoid redundancies\nImprove: Each and every operator must participate in the new training program before\nthey operate the equipment.\n-\nAvoid \"There is/are ... \"; \"It is ... \" constructions\nImprove: It is common knowledge that it has been shown that it is bad economic policy\nfor the federal government to run a large deficit.\n7. Learn and use the conventions of incorporating numbers into tert.\n-\nUse the numerical form for numbers above ten.\nImprove: The proposed changes to the federal retirement policies will take place in three\nstages over 5 years.\n-\nAppropriately punctuate numerals and numeral-word combinations\n(when numerals are used as modifiers).\nImprove: The new building will have as its centerpiece a two thousand square foot\ngranite atrium.\nf\n(Guidelines adapted from MIT OCW course 21L.020, taught by Prof. Margery Resnick and Dr.\nJoaquin Terrones. License: CC BY-NC-SA.)\n\nTips for professional writing style\nFor the rest of the term, we will be working on formalizing our written language. Up to now, the\ntone of your short, written responses has been relatively informal and conversational.\nProfessional written style diffeϜs from conversational style in three main ways.\n1. Accessibility-Readability: The goal of good writers is to create reader-friendly documents.\nBefore writing anything, they analyze their purpose and their readers' desires, needs and\nattitudes. Then, writers choose the document format, organize information, incorporate figures\nand tables, and refine their language and style to reach their goals. Good writers realize that\nreaders differ from them in their interests and needs.\n2. Word choice: The five basic guidelines for choosing the right words are\nBe specific.\nFocus on the real verb.\nFocus on the real subject; avoid \"there are\" and\" it is\" constructions.\nA void cliches and pompous words.\nUse formal tone: Match each informal phrase in A with its formal counterpart in B.\nA\nB\nreally important\ninvestiJ!ate\nmeanwhile\neliminate\na lot of\nseldom occurs\nJ!et results\ndecrease\nJ!et hiJlJler\nessential\ndoesn't haooen very o/ien\ndetermine\n-\nthinJ!\nreview\nJ!el rid of\nin addition\nlook into\nobtain results\nfigure out\nincrease\nI!O down\nat the same time\nbesides\naweatdealof/many\nlook over\nfactor, feature, problem\n3. Lean style: Use no more words than necessary. Practice on the wordy phrases below.\na majority of\nat an early date\nat the present time\na number of\nat the conclusion of\ndespite the fact that\nat this point in time\nbased on the fact that\nhaving the capability to\nin connection with\nin view of the fact that\nit is our understanding that\nof the opinion that\norior to\nso as to\nsubsequent to\ntake into consideration\nmake reference to\nTask. After you write your next reading response, evaluate your tone and make adjustments\nwhere needed before you hand it in.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course Workbook Part 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/0e271c4e78103986a72d2f4356da62fa_MIT21G_221S19_cw3.pdf",
      "content": "2.\nmoo\nrouo\nWhat Makes an Effective Group?\nHere are twelve common characteristics of group work:\n1.\nCompetitiveness among members.\nEveryone sticks closely to the agenda.\n3.\nThe group avoids cqnflict.\n4.\nMembers rotate the leadership position.\n5.\nEach member gives and receives feedback.\n6.\nA detailed agenda precedes each group meeting.\n7.\nEach group member is assertive.\n8.\nInformal subgroups form.\n9.\nMembers freely express negative feelings.\n10.\nThe overall goals of the group are explicitly set.\n11.\nInformation is freely shared among group members.\n12.\nEach person's ideas are taken into consideration and\nassessed.\nTask #1: Pick three of these characteristics that you consider essential for good group\nperformance and fill in the table below.\nT bl\na\n1 I\nan\nrt tCh\nt\n1cs\nens\n\"f\nor\nfi G dG\np rfi ormance\ne .\narac\ne\nrouo\n.\nMost important\n'\n2nd most important\n3rd most important\nTask #2: From the remaining items on the list, pick the three that you feel most\ninterfere with good group performance and fill in the table below.\nT bl\na e 2 .. Ch aractensbcs t h at most\n1srupt\no·\nG\np e ormance\nrfi\nMost disruptive\n2nd most disruptive\n3rd most disruptive\nTask #3: Compare your choices with other class members and discuss the differences.\nDo the different choices reflect cultural norms? Do they reflect individual personalities?\n(Adapted from MIT OCW course 15.279, taught by Drs. Lori\nBreslow and Terence Heagney. License: CC BY-NC-SA.)\n\nStrategies for Effective Group Work\nSuccessful group work requires a willingness to participate and to focus: it also requires a\nwillingness not to dominate and to discourage others from doing so.\nI. Show good listening skills. Give physical attention to each speaker through effective\nbody language and listening expressions. Be sure you understand a speaker's point\nbefore you react. Use expressions of clarification.o\n2. Support every group member's right to speak. Know your group members and\nunderstand their strengths. Encourage discussion by acknowledging all ideas. Use\nexpressions like \"Let's consider X,\" not \"That won't work because .... \" Disagree with\nideas, not with group members. For example, \"Can you explain how X will work?\" is\nmore productive than \"Joe's idea won't work.\" Look for places where you can agree and\nfor places where you can ask questions.\n3. Stick to the agenda. Avoid extraneous topics. Make your points quickly at the\nappropriate time. Unless you are giving a formal report during a meeting, you should\nnever speak for more than a few minutes at a time.\n4. Prevent dominance. A void interrupting, arguing, criticizing or over-defending. The\ngroup facilitator should\n- Be sure that everyone has a chance to speak\n- Use tactful reminders of the ground rules\n- Deliberately seek comments from the less assertive members\nA. Establishing Group Ground Rules\nAs you establish your group ground rules, consider the following questions:\n1. Work norms. How will you distribute the work? How will you establish the schedule\nand the guidelines? How will you handle cases when group members do not fulfill their\ncommitments? How will the work be reviewed? What if members have different\nopinions about the quality of the work? How will you handle different work habits?\n2. Facilitator norms. What responsibilities will the facilitator have? How will you choose a\nfacilitator? Will you rotate the position?\n3. Communication norms. Between meetings, which medium is preferred: telephone, email,\ntexting? How frequently will you check for messages? Does everyone understand\nthe concepts of active listening and appropriate participation?\n4. Meeting norms. What is everyone's schedule? Should one person be in charge of\ncoordinating meetings? Where will meetings be held? How will you handle latecomers\nor absent members? Can people eat or smoke at meetings? What if someone dominates\nthe discussion? How can you change norms if someone is uncomfortable with the team\ndynamics?\n(Adapted from MIT OCW course 15.279, taught by Drs. Lori Breslow\nand Terence Heagney. License: CC BoY-NC-SA.)\n\nStrategies for Effective Group Work\nB. Active Listening vs. Poor Listening\nActive Listeners\nLook at the speaker as s/he talks\nNotice nonverbal communication\n(gestures, tone, eye contact)\nListeh for a speaker's structuring cues\nLimit their own talking\nUse feedback cues to show they're\npaying attention: nodding, murmuring\nagreement\nActively check for comprehension and\nuse clear expressions of clarification\nPoor Listeners\nFrequently interrupt speaker or finish\ntheir thoughts.\nAsk too many questions about details\nChange the focus of the discussion\n(e.g., That reminds me ofX; That's\nnothing--let me tell you about.\")\nRush speakers, making them that\ntime is being wasted.\nShow interest in something other than\nthe conversation, discussion or\npresentation.\nFail to value productive conversation.\nC. Guidelines for Giving and Receiving Constructive Feedback\nAnglo-American communication is characterized as \"direct\" and ''to the point.\" However, we\ntend to soften our approach when discussing potentially sensitive issues in several ways:\n1. We couple uncomfortable truths with positive observations. For example,\n\"Your research sounds very exciting. More examples of how it is used in the transportation\nindustry would have been useful.\"\n2. We use guestion structure. For example, \"Can you provide a few examples to help make\nthis concrete?\"\n3. We use our needs to point out weaknesses. For example, \"I'm sorry-I'm having a hard\ntime bearing you.\"\n\nGroup Discussion Preparation\nTasks\nA. In groups, spend a few minutes predicting factors for successful group\ndiscussions by\n1. Anticipating the kinds of expressions that are particularly useful in group\ndiscussions. Record as many as you can think of. Refer to the Introductory\nsection of the course packet for Essential Gambits if necessary.\n2. Discussing how speakers can support their opinions with facts, statistics,\nand sources.\n3. Anticipating what happens when two speakers speak at the same time.\n4. Describing tips for effective group body language.\n5. Defining the role of an effective group facilitator.\nB. In groups, spend a few minutes modeling the language of a group\nmember whose role is\n1. Initiating\n7. Supporting\n2. Seeking information or opinions\n8. Mediating\n3. Giving information or opinions\n9. Reconciling\n4. Questioning\n10. Compromising\n5. Clarifying\n11. Being humorous\n6. Summarizing\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course Workbook Part 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-221-communicating-in-american-culture-s-spring-2019/c623341a5f9ecba1d962341a78939075_MIT21G_221S19_cw4.pdf",
      "content": "The Art of Presenting Research\nPurposeful Design\nA. Questions to Consider in Early Preparation\nAudience: Who is my audience and what are they expecting? What do they want and\nneed to know? Who is the main decision maker?\nLogistics: How much time do I have to prepare? How much time do I have to present?\nHow many audience members do I expect? Am I part of a team? Where will the\npresentation take place?\nPurpose: What is my main message ( ~conclusion)? Is my message neutral, positive or\nnegative? What do I want the audience to take away with them? What do I need to be\nsuccessful?\nB. Contents and Organization\nFor most professional audiences in the Anglo-American world, your approach will be\nappropriate if you\n- Make your main message blazingly clear and refer to it throughout your talk.\n- Choose your content and approach based on what the audience needs/wants and\nNOT what you know. Be selective in your content.\n- Pay particular attention to your introduction and conclusion; your audience is\nmost attentive in these sections. Your introduction should clearly indicate your\nkey message as well as the scope of your presentation. Conclude your\npresentation by summarizing your key points and putting your message into some\ngreater context. Never conclude with \"That's all!\"\n- Keep your main points clear and unencumbered by distracting detail.\nC. Effective Design of Visual Aids\nThe purpose of visual aids is to help the audience understand the content of your\npresentation and remember your key message. The aids should support your message.\nYour goal should not be (exclusively) to entertain the aμdience and display your prowess\nwith presentation software. In other words, \"Provide a high signal to noise ratio.\"\nGeneral conventions for success follow.\n1. Use clear, consistent and correct text\n- Keep it simple, readable and immediately comprehensible.\n- Honor hierarchy in text size: larger titles; smaller content lines of text\n- Use sans serif fonts and no more than two font types (e.g., Arial and\nGaramond) per slide.\n- Try to use a minimum of20-point font size (sometimes hard in graphics).\n\nThe Art of Presenting Research\n- A void all capital letters; use italics and bold fonts purposefully\n- Design aids from the point of view of the audience members farthest away\nfrom the speaker.\n- Check for accurate parallelism, grammar and spelling.\n2. Use color purposefully to emphasize content and minimize distraction\n- A void random use of color; limit maximum three\n- A void ornate backgrounds.\n- Keep in mind that contrast improves readability.\n- Keep in mind that room lighting affects contrast: for a dark room, use light\nfont on a dark background; for a well-lit room, use dark font on a light\nbackground.\n3. Use graphics purposefully to emphasize content\n- A void clip-art clutter.\n- Use recurring graphics (e.g., picture, logo or menu bar) for impact.\n- Manage data: use graphs; avoid tables; have handout, publication or separate\nbackup slides for discussion if necessary.\n4. Fight against the temptation to use all the tools that presentation technology\nallows\n- Minimize the complications, dead time and embarrassment that loose cables.\nslow downloading, poor audio/video quality, faulty equipment, bad Internet\nconnection, etc. can cause.\n- Minimize special effects, e.g .- sound and animation.\n- Always have backup handouts.\n5. Preview your slides as a projected slide show to catch any features that seem\nacceptable on the small computer screen but are unacceptable projected onto a full-size\npresentation screen. Font size and color contrast are just two of many features that can\nchange dramatically between the small and large screens!\n\nEffective Design of Visual Aids\nPractice with appropriate visual design: All the-types of information provided below\nin Column A could be presented effectively as graphics. Draw a line between each item\nin Column A and one or more appropriate graphic forms in Column B.\nA. Types of information\nCurrent cost/unit ofregular 2as in 3 countries\nAverage salaries of MlT m-ads in all engineering fields\nAverage interest rate changes from 2008 throul?h 2016\nLithium battery\nHouse for sublet\nProcess to earn an MIT Ph.D. in chemistrv\nDistribution of Tesla cars in the 50 states\nChanszinn CO2 and ozone levels in the atmosphere\nOther?\nB. Type of Graphic\nPhoto\nFlowchart\nBar graph\nPie chart\nLine graoh\nCutaway l!l'aoh\nDiagram\nTable\nHistogram\nAnimation\nOther?\n\nVisual Representation of Information: Language\nA well-designed slide simply serves as wallpaper unless a speaker uses it effectively in support of the key message.\nSome or all of the five steps provided in the table below are typically used in presenting visual materials. Some\nexamples of language use for each step are provided.\n2. Discuss the\n3. Explain terms\n4. Point out key\n5. Discuss overall\nstru·cture\nfeatu·res\ntrends\nIn this graph, the x-\nHere, A denotes\nIn the first column, we\nIn general, these data\n. .\nax.ts lS\ncan see\nshow\nAs you can see, this\nHere, the red line\nNote the steep incline\nThis photo clearly\n1. Introduce the\nslid\nThis slide/graph\nshows\nThis chart\nrepresents\ndevice has three parts\nshows\ndemonstrates\nAt the top of this\nAll X are\nThis sharp curve\nI'm showing this\nI think this X will\nhelp you\ndiagram\nrepresented by\nindicates\nimage to give a\ngeneral sense of\nI've indicated X by This X here is of\nparticular interest\nunderstand\nIf you examine this The slide is divided\nX, you will see\ninto two halves\nAs you can see in\nthis X\n\n2.\nThe Art of Presenting Research\nPowerful Delivery\nA. To connect with your audience,\n- Respect them. Look at them and speak to them. Be conversational. Move\naround and gesture. If you simply stand in one place and read your slides or\nnotes, the connection between you and your audience is non-existent.\n- Look enthusiastic about your subject. If you don't seem interested, your\naudience will not be interested.\n- Speak with confidence and make no excuses. Never undercut your message,\nyourself, or your reason for presenting. Don't apologize. Make your best effort,\nand the audience will appreciate it.\n- Time yourself. Prepare for a talk that is 25% shorter than the time allowed.\nRehearse your presentation well beforehand; leave time for questions. However,\ndon't over rehearse. If you practice the talk too many times, it may sound as if\nyou've memorized it, which is culturally inappropriate and dangerous in\ninteractive contexts.\nB. To use your visuals effectively,\n-\nHandle the aid as little as possible. A void using the remote control or mouse\nas a crutch. Display the aid only when you are ready to discuss it. Remove the\naid when you are through discussing it. Turn off projection equipment when\nnot in use.\n-\nCompensate for your audience's divided attention. Increase volume and clear\narticulation of speech. Continue to talk while handling aids. A void excessive\nslides (more than 1/minute).\n-\nPosition yourself carefully. Always face and talk to the audience, not the\nvisual aids.\n-\nStand or move at the sides of the screen, not between the audience and the\naid/screen.\n-\nEmphasize details by pointing at the screen, preferably with your hand and\nusing verbal cues. Pointers, especially laser pointers, tend to be overused and\ndistracting.\nC. Know the ten tips for nervous speakers\nMost speakers experience a low level of anxiety before a presentation. You can make\nthis feeling work/or you instead of against you by doing the following:\n1. Know exactly what your listeners expect from you. Ask the person who requested\nthe presentation or a prospective audience member what they want.\nIf possible, familiarize yourself in advance with the room set-up.\n\nThe Art of Presenting Research\n3. Rehearse your presentation at least twice. The first time, focus on familiarizing\nyourself with your material and checking your timing. The second time, record yourself\nfor playback, or present to a friend/colleague, and time the presentation. Ask for\nfeedback.\n4. Snack before you present. Speaking with an empty stomach exacerbates anxiety.\n5. Avoid excessive caffeine, which also exacerbates anxiety.\n6. Chat with audience members before the presentation.\n7. Du.ring the presentation, speak directly to individuals for several seconds; choose\nindividuals throughout the room.\n8. Use your gestures to enhance communicatioO not distract from it. Be aware of\nnervous mannerisms {e.g., playing with a pen, stroking your beard, smoothing back your\nhair) and practice suppressing them.\n9. Speak slowly and distinctly in a low register. A rapid rate at a high pitch indicates\nnervousness.\n10. Prepare good notes in outline form and practice using them appropriately for an\nextemporaneous presentation.\nTips for effective language choice\n1, Use the active voice.\nE.g., We initiated this program to improve communication along the supply\nchain.\nNot: This program was initiated to improve communication along the supply\nchain.\n2. Use personal language.\nE.g., Our goal here is ...\nNot: The goal here is ... .\n3. Use tactical language.\nE.g., We 're going to examine ... .\nNot: I'm going to talk about ... .\n\nThe Art of Presenting Research\n4. Use short words and short sentences.\nE.g., We avoided problems in the following way. First, .... Next , ... .\nNot: We circumvented problems by engineering symbiotic solutions ... .\n5. Use explicit transitions.\nE.g., First, we interviewed the participants. Let me describe . ...\n6. Use word pictures.\nE.g., I think of cell phone movies as film haiku.\n7. Use unbiased language.\nE.g., To predict growth, we used a simple equation.\nNot: To predict growth, we used an equation so easy even your mother\n(secretary , etc.) could solve it.\nE. Use common speech structure cues\nSkilled speakers use patterns that help the listener understand the content of their\npresentations. There are various rhetorical devices that a speaker can use to signal\nprogression from one part of the talk to the next. Used appropriately, these signals make\na presentation clear, move the listeners smoothly along, and provide coherence.\nA critical listener is careful to recognize these signals and is then prepared for the\norganiz.ational pattern that the speaker has indicated. For example, the comment \"I am\ngoing to argue that Google's Chinese policy is acceptable for a number of reasons.\" alerts\nthe audience to listen for a series of distinct arguments. On the other hand, the comment\n\"I'd like us to look at bow Google's Chinese policy differs from its German policy.\"\nindicates a comparative approach.\nSome common speech structure cues are listed below.\nIntroduction cues\nI'd like to start/begin by . . .\nLet's begin ±th ...\nAs an introduction, ...\nI will first describe X and then I can explain ...\n\nThe Art of Presenting Research\nOrganization cues\n- Generalization/Specific\nGenerally speaking, ...\nIn general, . . .\nOn the whole, ..\nOverall, ...\nBy and large, ..\nFor the most part, ...\n- Chronological Order\nTo begin with, ...\nIn the beginning, ... First, 2nd ...\nThen ...\nNext, ...\nFollowing this, ...\nAfterwards, .. .\nSubsequently, ...\nBefore ...\nUltimately, .. .\nFinally, ...\n- Explicit Motiement\nX, then, is the first ... ; let's move on to another Y/the next ...\nNow I'd like to consider/turn to/examine ...\nWhat are the advantages/results/ etc. of this approach?\nComparison/Contrast\nSimilarly, .. .\n·In contrast, .. .\nLikewise, .. .\n- Cause/Effect\nAs a result, - . .\nThus, ...\nIf this occurs, then .. .\nBecause of this, ..\nMain idea cues\nLet me stress that ...\nLet me repeat. ..\nThis is a major factor ...\nWhy was this so important?\nI'd like to emphasize ...\nIn like fashion,...\nIn comparison to this,...\nOn the one hand/on the other\nhand, ...\nThe upshot ofthis is....\nTherefore, ...\nThe outcome ofthis ...\nConsequently,...\nThe principal point is ...\nThe main idea is...\nThe remarkable thing is ...\nIt is significant that...\nMost important to remember is...\n\nThe Art of Presenting Research\nExample or detail cues\nFor one thing ... for another ...\nMoreover, ... .\nFor instance, .. .\nA few of these are ...\nFurthermore,\nPast ref ere nee cues\nFor example, .. .\nIn the case of ..\nAlso, ...\nIn such a case, ...\nIn addition, ...\nAs I/John/Lydia said at the start of this presentation, ...\nAs I mentioned earlier, .. .\nIn my introduction, I said ..\nYou will remember the example ofX I gave you earlier.\nFuture reference cues\nI' 11 return to this in a few minutes.\nI'll come back to this later.\nI'll develop this in the next part of the presentation.\nDigression cues\nIncidentally,\nThat reminds me ...\nBy the way, ...\nBut first, ...\nAmendment cues\nI just remembered ...\nI almost forgot ...\nSummary & conclusion cues\nIn conclusion, ..\nTo summarize, .. .\nIn summary, ..\nBut before we get to that, .. .\nThat makes me think of ..\nOf course, .. .\nFirst let me ..\nI forgot to mention ...\nI just realized ...\nFinally, ...\nTo conclude, ...\nI'd like to leave you with this final X\n\nThe Art of Presenting Research\nProductive Interactions\nAs students and professionals, you are expected to work with others productively to\naccomplish tasks. The contexts may vary-academic study groups, group projects for a\nparticular class, committee work, professional project teams, or high-stakes work\nmeetings. In effective groups, members reach their goals and are satisfied with their\nexperience. They recognize the contributions of all members and share a sense of\naccomplishment.\nIn some of these contexts, you can be assertive and take steps to increase your chances of\nworking effectively together. Successful groups establish ground rules, have a facilitator,\ncommunicate frequently and openly and have strategies to avoid, or deal with, common\ngroup problems.\nA. Learn strategies for effective team presentations\nThe key to a successful team presentation is to ensure that it is organized, unified and\ncoherent. Keep in mind the following six guidelines when planning.\n1. Organize by content area. As a team, organize your total presentation into sections\nbased on logical content areas, not on number of team members. Then decide on the order\nin which the areas will be presented. After the agenda is organized, decide who will cover\nwhich area. One speaker may cover two content areas or two speakers may divide up one\narea. Match personalities with content area. One team member should introduce and\npreview the entire presentation. The goal is to present a coherent whole with the content as\nthe focus.\n2. Provide graceful content transitions. Conclude your area with a section swnmary and\na content link to the next section. Use the following speaker's nam e when linking to the\nnext section.\n3. Use visual aids consistently. Use the same technology, software, color scheme, font\nsize, and layout throughout. Be sure each of you introduces your visual aids with\nstatements that make clear your motivation for using them.\n4. Rehearse as a group. Meet and practice your complete team presentation, introducing\nand concluding, using the exact transitions, and explaining your visuals as if 40jt' s the real\nthing.\"\n5. Answer questions consistently. When planning the presentation, decide on a\nquestion-and-answer format. If you decide to handle questions at the end, choose a\nfacilitator to direct questions and decide whether you will sit or stand to answer\nquestions.\n\nTh Art of Presenting Research\n6. Be a team player. When you are listening to other team members present their\ncontent areas, remember that you are still in the spotlight. Listen attentively and use listening\nbody language to show your interest. If you indicate that you are distracted or bored with what\nyour team members are saying, how can you expect others to listen actively?\n(Strategies above are adapted from Mary Munter's Guide to Managerial Communication, 1999. (c)\nPrentice Hall. All rights reserved. This content is excluded from our Creative Commons license. For\nmore information, see https://ocw.mit.edu/help/faq-fair-use/.)\nB. Follow guidelines for successful Q & A sessions\nQuestion and answer sessions are useful for three reasons. First, listeners will be more\nattentive if they feel they have a chance to be involved. The sessions can also provide\nyou wih feedback on your subject. In addition, you can judge from the questions and\nt comments how well yo,u have communicated your information. You and your\naudience can benefit a great deal from the Q & A session if you\n1. Let your listeners know in advance how you would like to handle questions. Do\naent them to as}c questions as you speak? Would you prefer that they save\nyou w\ntheir questions and commt:nts for the end of the presentation?\n2. Set a time limit for the question and answer session in order to keep a lively pace\nand to limit long debates. As the time limit draws near, let the audience know by\nusing an expression like 11 We have time for one more question.\n3. Remember to acknowledge and reward participants; check for satisfaction.\n4. Ask for clarification if you do not understand a question.\n5. Answer each question as directly, but as completely, as you can.\n6. Always remain calm and polite, even if your questioner is not. If necessary,\nsuggest that the time limit precludes further discussion of an antagonistic\nquestion. Suggest that you meet to discuss the contentious point after the\npresentation is over.\n7. Do not feel that you have to appear to know everything. Feel free to use one of\na\nthese gmbits if you do not know the answer:\nI'm afraid that I can't answer your question.\nI really can't say.\nPerhaps someone else can answer that.\nFrankly, I don't know.\nI'll check and get back to you with that info.\nIt's impossible to say.\n\nFinding the·Right Words: Essential Gambits for Q & A\nInitiating Q & A\n(Adapted from materials created by Jane Dunphy and Dr.\nLori Breslow for the MIT management course 15.279.)\nI welcome your questions and comments\nWe now have X minutes for discussion\nHesitation\nWell, um ...\nLet's see.\nLet me think.\nHow should I put it?\nThat's a good question.\nI'll have to think about that.\nClarification: Others\nSorry, but I don't see what you mean.\nCould you be more specific?\nCould you explain that in more detail?\nDo you mean ... ?\nWhat do you mean by ... ?\nlfI understand you correctly, ....\nClarification: Self\nInterrugtiQ!lS\nWhat I mean is ... /What I meant was ....\nLet me put it/say it another way.\na\n.\nWh t I'\n-\nm saymg 1s ....\nWhat I'm trying to say is ....\nIn other words, . . . .\nI'm sorry, I didn't mean to say that.\nPardon/excuse me, but. ...\nSorry /Excuse me for interrupting, but ....\nMay I ask a question?\nMay I add something?\nI'd like to comment on that.\nI'd like to say something here.\nCould I just jump in here?\nRefusing Interruptions\nJust let me fmish my point; I'll get back to you.\nI'd like to finish what I was saying.\nCould I just finish my point?\nResuming After Allowing Interruptions\nIn any case, . . . .\nOne last point, ....\nTo return to/get back to X -....\nAnyway, ...\nWhere was I?\n\n21G.221 Team Presentation: Check List\nStrategy\nStructure\nContent\nDelivery\nVisual Aids\nIs your strategy appropriate for your goal, audience & context?\nIs your key message (i.e., thesis or conclusion) near the start?\nWhat is your key message?\nIs your structure appropriate?\nHow will your audience follow easily from one part of the\npresentation to the next? What transitions will you use to help the\naudience navigate?\nDoes your Introduction include a clear signal of intent/agenda?\nDoes your structure compensate for the \"attention dip\" common\nwith Anglo-American audiences?\nWill you include a clear and graceful signal and bring closure to\nyour presentation?\nIs your level of detail appropriate for your audience, purpose and\ntime constraint?\nDoes the content support your key message?\nDo you take into account-and counter--any strong opposition to\nyour key message?\nHow will you ensure that your delivery is sincere and confident?\nHow will you demonstrate interest in your topic and in your\naudience's needs/interests?\nDo your visual aids enhance your presentation and meet the needs\nof different types of learners ( visual, textual and audio)?\nDo they include key terms?\nDo they follow the principles of good design?\nHow will you use them purposefully with verbal and nonverbal\nreference?\n\nQ&A\nTeamwork\nWhere will you provide an explicit directive to the audience about\nwhen you would like to handle questions?\nHow will you demonstrate respect and strategy in handling\nquestions?\nHow wil1 the individual members work as a team?\nHow will you gracefully choreograph the transition between\nspeakers?\n\nSelected Resources for Professional Communications\nAlley, M. The Assertion-Evidence Approach to Slide Design. Available 01/31/19, at\nhttps://www.assertion-evidence.com\nAndrews, D. Technical Communication in the Global Community. Upper Saddle River, NJ: Prentice\nHall,1998.\nAnthony, R. Talking to the Top: Executive's Guide to Career MakingPresentations. Upper Saddle\nRiver, NJ: Prentice-Hall, 1995.\nDoumont, J.-L. Trees, Maps, and Theorems: Effective Communicationfor Rational Minds,\nPrincipiae, 2009.\nGurak, L. Oral Presentationsfor Technical Communication. Boston:eAllyneand Bacon, 2000.\nHanda, C. Visual Rhetoric in a Digital World: A Critical Sourcebook. Boston, MA: Bedford/St.\nMartin's, 2004.\nMinto, The Minton Pyramid Principle: Logic in Writing, Thinking & Problem Solving.\nLondon, UK: Minto International, Inc. 1996.\nO'Brien, Liz. A Speaker's Resource: Listener-Centered Public Speaking. Boston, MA: McGraw\nHill, 2009.\nTED Talks (Technology, Entertainment, Design). Available 01/31/19, at http://www.ted.com/talks\nToastmasters International. Available O1/31/19, at http://www.toastmasters.org/\nTufte, E. The Visual Display ofQuantitative Information. Cheshire, CT: Graphics Press, 2001.\nZelazny, G. Say It with Charts: The Executive's Guide to Visual Communication. Homewood, IL:\nDow Jones-Irwin, 2001.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.221 Communicating in American Culture(s) Spring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}