{
  "course_name": "Composing Your Life: Exploration of Self through Visual Arts and Writing",
  "course_description": "No description found.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fine Arts",
    "Visual Arts",
    "Humanities",
    "Literature",
    "Creative Writing"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nIn this interdisciplinary seminar, we will explore a variety of visual and written tools for self exploration and self expression. Through discussion, written assignments, and directed exercises, students will practice utilizing a variety of media to explore and express who they are. Assignments will focus on the nuance and interplay of written and visual elements, with special focus on photography.\n\nRepresentations of self will include:\n\nPersonal and Family History\n\nHow We Portray Ourselves to the World\n\nConcepts of Race and Gender\n\nHow Others See Us\n\nAnalysis of the World Around Us\n\nHow History Impacts Who We Are\n\nThe Values by which We Lead Our Lives\n\nHow We would Like to Lead Our Lives in the Future\n\nExamples of written expression of self will include letters, emails, blogs, journals, poetry, memoirs, and autobiographies. Examples of photographic representation of self will be demonstrated through self-portraiture, images of one's environment, image of self taken by others, and images of others taken by self. Students will complete a \"portrayal of self\" that will synthesize one's own photography, art, memorabilia, writing, and \"found objects\" in a cohesive narrative of self. No prior experience with photography is needed.\n\nPrerequisites\n\n(none)\n\nSummary of Major Assignments\n\nThis class requires regular attendance (no more than 3 classes missed), completion of weekly exercises (writing a few paragraphs in one's journal, collecting one or more pieces of memorabilia, taking one or more pictures), weekly reading and photo assignments, and construction and presentation of a mixed-media portrayal of self.\n\nBasis for Grade\n\nACTIVITIES\n\nPERCENTAGES\n\nFinal Project\n\n30%\n\nWeekly Homework (Including Reading and Assigned Exercises)\n\n20%\n\nClass Participation and In-class Exercises\n\n50%",
  "files": [
    {
      "category": "Resource",
      "title": "Tips for Running Interactive Seminars with a Creative Focus",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-240-composing-your-life-exploration-of-self-through-visual-arts-and-writing-spring-2006/5ed15893ebe77e5a94ed8bea7c0b049a_MITES_240S06_smnr_lead.pdf",
      "content": "TIPS FOR RUNNING INTERACTIVE SEMINARS WITH A CREATIVE FOCUS\n- Encourage student participation through structured exercises\nExercises are a good way to get students involved in the material. Work can be done\noutside of classes (such as photo essays) and brought in for discussion and further\nexercises based on that work, or can be done directly in class (such as making masks\nor doing a visual autobiography). We run one or two experiential exercises each week\nwhere all students create new work or present the work done in the previous week\nand process it with other students. Processing takes place in a variety of formats,\nincluding pairs, quartets, single sex groups, and a round robin format. We ask the\nstudents to design and run a 45 minute exercise in the last week of class. We also\nhave students develop questions for discussion and have them run discussions at least\nonce a month.\n- Keep the class size small\nIt is difficult to get a lot of intimacy and participation in a class which has too many\nstudents. In our experience, we have found that having between 8 and 12 students\ncreates an ideal class size. Too few students doesn't allow for rich interaction: too\nmany students doesn't allow students to participate as much.\n- Encourage student feedback\nWe use weekly feedback forms at the end of each class session to gauge how our\nclass has impacted our students. We gave students opportunity to act as coaches for\nother students in terms of suggestions for their final exhibits by having them meet in\ngroups of three during the seventh week of term to give and receive feedback about\nthe final projects. We have students fill out pre-class questionnaires as well as mid-\nterm and end-of-term evaluations. We also spend part of the last week of class asking\nstudents for their feedback about how the class went.\n- Promote student-staff interaction both in and out of the classroom\nStudents who get to know the instructors and each other in an informal, out-of-class\nexperience are more likely to feel invested in the class and more likely to participate\nin class. We hold a class dinner sometime during the first few weeks of term (free for\nstudents) where we go to a local restaurant and chat about the class material and their\nlives. This helps create a sense of group bonding. In addition, we sponsor a class\nouting where we take students to a local art museum or a movie which addresses\nsome aspect of self-portrayal or the value of visual art and writing in helping\nindividuals understand themselves better. In the past few years, we have taken\nstudents to a movie about Indian children who are given cameras to record the world\naround them (Born Into Brothels) and exhibits at local museums on self-identity. In\naddition, during the sixth week of term each instructor meets individually for 30-45\nminutes with each student to go over how they envision the theme and structural\ncontent of their self portrayals.\n\n- Team-teach from different disciplines if possible\nThe value of team teaching from different disciplines is tremendous, not only for the\nstudents who are exposed to different views on the same subjects but also for the\ninstructors who learn from each other. If you don't have the practical resources to\nteam-teach an entire subject, consider asking a faculty member in a different\ndepartment to give a guest lecture or run an exercise during one of your classes.\n- Have students exhibit their work\nWe involve students in a two-week, end-of-term exhibition of their work, which\nincludes a reception (open to the public) where students talk with the audience about\ntheir final projects and the class itself. The exhibition serves several important\nfunctions. First, it gives students a focus for their work in class. Exercises are done\nby students with the awareness that materials generated from these exercises may\nbecome elements of their final projects. This helps give an over-arching shape to the\nclass and ties each class assignment to a greater goal. Second, for final projects, we\nask students to choose a particular aspect of their lives that they wish to express to\nothers. Beyond self-exploration, we are asking students to be self-expressive in a\nway that clearly presents their ideas to others. In preparing work for exhibition,\nstudents consider how their work will be perceived by an audience and how to be\narticulate in presenting their ideas. Finally, the exhibit opens the content of the class\nto a greater community, inviting feedback and interaction from peers outside of class.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.240 Composing Your Life: Exploration of Self through Visual Arts and Writing\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Final Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-240-composing-your-life-exploration-of-self-through-visual-arts-and-writing-spring-2006/6a94e8df1243eb5b7b1a3998c5c2a059_MITES_240S06_blurb_for_ocw.pdf",
      "content": "The Final Project\nWe knew from the beginning of the seminar that there would be a Final Project to do.\nWhat exactly the project would be was our choice, but it could be either a compilation of\nassignments completed throughout the semester or something completely new that we wanted to\nrepresent and share with the rest of the class (and perhaps the world). Holly and Graham advised\nus to start thinking about our projects early on and to pay attention to assignments that really\nstruck a chord with us. I did both of these things, but alas, neither of them really helped me a\nwhole lot with my own Final Project. I had a lot of ideas for possible projects, but when it came\ntime to execute my plans and put my sketches into a three-dimensional form, I found myself with\na creative block the size of Massachusetts, or perhaps even Alaska. A continuous flood of work\nfrom other classes also kept me from sitting down and really focusing on my Final Project.\nI knew that writings would be important in my representation, but I couldn't decide what\nform they would take. One of my first ideas was to write a series of letters. The list of possible\n\"recipients\" for the letters included my father, my future self, my past selves, and a friend with\nwhom I keep a regular mail correspondence. I thought it would be so simple to put down words\nbecause I was writing either to myself or to someone that I love and trust. No matter how many\ntimes I tried to write these letters, no matter how many different topics I chose as a focal point, I\njust could not make the words feel, look, or sound genuine. They were contrived and awkward,\nconceived for an artificial dialogue. The letter-writing idea got thrown out the window, but I\ndecided to continue writing.\nOf course I eventually found my muse and completed my Final Project. It started with a\nfew old photos that I had picked out when I went home for spring break. One of them was a\npicture of me when I was eight years old, sitting and poking at my keyboard (the musical\ninstrument, not the computer accessory). Looking at this picture made me remember and\nreminisce, and thus I really began to write. I wrote about how I used to play the keyboard and\nwhy I don't anymore. For this attempt, the words flowed, and they were simple and honest.\nThey echoed my voice and reflected me and my past experiences. For me, it was like magic.\nThat essay was my first piece. The second piece of my project was a catharsis in graphite,\nallowing me to release all my emotions and thoughts about my grandmother's death. Again, it\nwas just like magic.\nFor me, the road to the Final Project was long, filled with ideas and failed conceptions,\nand at times, frustrating. However, I would not trade the trip for anything else because I learned\na lot about myself from the results of my project. One of the most important ways to know\nyourself is to be aware of how you present yourself to others, both knowingly and\nsubconsciously. This project and in fact, this class as well, were both a great exercise in\nimproving this awareness.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.240 Composing Your Life: Exploration of Self through Visual Arts and Writing\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}