{
  "course_name": "Comparative Grand Strategy and Military Doctrine",
  "course_description": "This course will conduct a comparative study of the grand strategies of the great powers (Britain, France, Germany and Russia) competing for mastery of Europe from the late nineteenth to the mid-twentieth century. Grand strategy is the collection of political and military means and ends with which a state attempts to achieve security. We will examine strategic developments in the years preceding World Wars I and II, and how those developments played themselves out in these wars. The following questions will guide the inquiry: What is grand strategy and what are its critical aspects? What recurring factors have exerted the greatest influence on the strategies of the states selected for study? How may the quality of a grand strategy be judged? What consequences seem to follow from grand strategies of different types? A second theme of the course is methodological. We will pay close attention to how comparative historical case studies are conducted.",
  "topics": [
    "Business",
    "Organizational Behavior",
    "Humanities",
    "History",
    "Comparative History",
    "Military History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Military Studies",
    "Business",
    "Organizational Behavior",
    "Humanities",
    "History",
    "Comparative History",
    "Military History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Military Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis course will conduct a comparative study of the grand strategies of the great powers (Britain, France, Germany and Russia) competing for mastery of Europe from the late nineteenth to the mid-twentieth century. Grand strategy is the collection of political and military means and ends with which a state attempts to achieve security. We will examine strategic developments in the years preceding World Wars I and II, and how those developments played themselves out in these wars. The following questions will guide the inquiry: What is grand strategy and what are its critical aspects? What recurring factors have exerted the greatest influence on the strategies of the states selected for study? How may the quality of a grand strategy be judged? What consequences seem to follow from grand strategies of different types? A second theme of the course is methodological. We will pay close attention to how comparative historical case studies are conducted.\n\nCourse Requirements\n\nTwo papers based on the class reading will be required. These are to be critical essays. They shall be no longer than 7 pages; no creative line-spacing, margins, or character formats please. A comprehensive take-home final exam will account for 50% of the grade. In the early weeks of the term about half of classroom time is lecture and half is discussion. As the term progresses, an increasing percentage of class time will be devoted to discussion. Participation in classroom discussion is much appreciated; silence is noted.\n\nThe papers are meant to be think pieces, but not day-dreaming pieces. The first paper covers the foundational conceptual material of the course. This paper could take one or more arguments apart and examine them for logical consistency, completeness, clarity, and evidence. It could compare and contrast two or more theoretical arguments according to several of the aforementioned criteria. It could apply one or more theories to a substantive problem already well known to the student (and thus requiring no further research), as a vehicle toward a critique of the theoretical arguments. The second paper covers the substantive material on World War I. Thus it should involve application of the theoretical and conceptual material from part I of the course, to some of the world war I case material. The most self organizing and straightforward approach would test one or more theories against some of this case material. Extra reading is permitted but not required for this paper. Students should review the topics of these papers with me. The best way to do so is to send me a brief one paragraph summary of the plan.",
  "files": [
    {
      "category": "Resource",
      "title": "Comparative Grand Strategy and Military Doctrine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-484-comparative-grand-strategy-and-military-doctrine-fall-2004/991e55865dc10aa38f061014cb0c4994_com_grd_strgy_04.pdf",
      "content": "COMPARATIVE GRAND STRATEGY AND\nMILITARY DOCTRINE-(Fall 2004)\n\nLecture I----Part One--Course Overview\nI.\nPurpose of the Course\n\nA.\nMAJOR-To provide you with an intellectual framework that will permit\nyou to analyze systematically how states organize or fail to organize their\nmilitary forces to achieve their political objectives. This framework is not\nexhaustive, it is rather a base that you can amend, add to, subtract from.\n1.\nThe framework has three important components:\n-Causes of Strategy/\n-Elaboration of Strategy as a Concept/\n-Consequences of strategies of different kinds.\n\n2. This framework is useful for both \"practitioners\" and \"scholars.\"\n\nB.\nMINOR- To study \"on a crash basis\" the diplomatic and military\nhistory of the first half of the century in the traditional cockpit of world\npolitics--Europe.\n1.\nAs a matter of principle, security specialists who wish to\nwork on present day problems ought to have some sense as to how we arrived at\nour current situation, and how well or poorly our forbearers have done at our\nchosen profession.\nII.\nApproach-- CONCEPTUAL/ THEORETICAL-SCIENTIFIC/ COMPARATIVE-\nHISTORICAL/ \"POLICY SCIENTIFIC\"\nA. Conceptual--We will treat \"strategy\" as more than a mere plot or plan/ we will try to\nunpack the concept.\nB. Theoretical Scientific--We will ask why states seem to get the strategies these get, what\nexplains the outcomes we see, are there important causal variables at work?\nC. Comparative-Historical: Permits us to test the overall utility of our concept of strategy--\ndoes it illuminate across space and time, and the overall validity of our hypothesized\ninfluences on strategy and the weights we assign them--again by looking across space\nand time.\nD. Policy-Scientific--In that we ask ourselves could we do better? to school our own\nstrategic faculties.\nIII.\nPREDICTIVE/ DESCRIPTIVE/ AND PRESCRIPTIVE--Why try to do all these\nthings\nat once?\nA. In principle one could simply teach theories with a few examples, or\nteach a history course in chronological fashion with the expectation that wisdom\nwould simply emerge, or one could simply concentrate on how to make \"good\nstrategy\" without bothering about explaining why strategies in the past have\nturned out the way they have.\n\nB. Trying to do all three things makes for a busy semester, complicated\nintellectual gymnastics, and runs the risk of too casual an approach to any or\nall of the three exercises.\nC. But for all the compression of the course, there are some benefits.\n--Those who see themselves as professionals, working where the action is, may do\n\na better job if they have a sense of the underlying dynamics at work in the\nformulation of strategy.\n--Those who see themselves primarily as scholars can guard against excessive\ndeterminism by considering how they might have done better\n--The focused study of historical cases imposes discipline on theorists--the\ndiscipline of \"testing\", and provides vicarious experience for the prospective\npractitioner.\n[A little like Clausewitz view of the study of the study of military history]\n\nIV.\nFORMAT-Reading--Classroom-Writing\n\nA.\nThis is a reading course. Lots of it. A good bit of it is not in\nthe books.\n--Course will not work especially well for you if you do not read what has been\nassigned--includes auditors, especially true of discussion.\n\nB.\nWriting Assignments--\nBasis for your grade in the course\n--Two short essays, and a take-home final--Takehome, technically due the last official\nclass day of the term; I have been known to grant blanket extensions.\n--The paper due dates are real.\n--Paper due dates coincide roughly with the reading. First paper should cover\ntheoretical-conceptual material. Second paper should deal with the first world\nwar.\nThe final will cover everything ; I write the questions.\n--Papers will be based largely on assigned readings. You will determine your\nown topic. You may consult me, however, on topic and execution. I will not,\nhowever, read and critique drafts. Papers could take the form of a critique of\nseveral pieces, a synthetic effort, the application of concepts or theories to\nparticular historical episodes presented in the course, a more daring\napplication of same to a substantive area not developed in the course; or if you\nchoose to read an entire book listed as supplementary reading, a review essay.\nThe stress here is on essay writing, not story-telling. I want to see you really wrestle\nwith the material. These instructions also apply to the final. See the syllabus for bit\nmore elaboration.\n\nC.\nClass-Meeting-Format. Since you are mostly graduate students, I do\nnot believe that I should simply confine our meetings to lectures.\n-But You are entitled to hear what I have to say about the literature and the\nissues raised each week.\n-Therefore, I will usually come in with some prepared material in the earlier part of the\nterm and we'll move to almost all discussion as the term progresses. Please come in\nwith some prepared questions or comments just to keep things rolling along.\nD.\nUndergraduates:.[ See me after class.]\n\nV.\nOrganization (SEE SYLLABUS)\n\nSection 1, roughly the first three weeks of the course will\n-define the concept of grand strategy, and offer a set of questions and analytical\ncategories that we shall use to evaluate the strategies selected for study.\n\n--Examine some of the critical influences that shape the grand strategies\nof nations-- including\nNATIONAL POWER/ GEOGRAPHICAL POSITION/ MILITARY\nTECHNOLOGY/ THE STRUCTURE AND\nNATURE OF MODERN MILITARY ORGANIZATIONS/ SOCIAL\nDEVELOPMENT, ESPECIALLY\nNATIONALISM. (EXPLANATION part of the exercise)\n--Examine the nature of the international political system to better\nunderstand some of the consequences of strategies of different types.\n(JUDGEMENT part of the exercise)\n--We'll spend a week talking about historical case studies; and use my old book as our\nreference point.\n\nSection 2 of the course deals with the strategy of the great powers in the\nyears leading up to World War I: France, Germany, Britain, Russia, the outbreak\nand conduct of the war. (also Austria-Hungary)\n--Expecially interested in the causes and consequences of the \"Cult of the\nOffensive\"\n\nSection 3 deals with the strategy of the three major powers in central\nEurope in the inter-war period--France, Britain, and Germany, (my book); the\ninitial battles of the war. It also deals a bit with Soviet strategy in the\nl930's.\n--Especially interested in the \"Cult of the Defensive\"\n\nIn both periods, we will endeavor to determine\n-what the grand strategy\nseems to have been;\n-what were the principal influences on the strategy;\n-what were the political and military consequences; including success or not.\n\n-We will always have three broad\ntasks in mind CHARACTERIZATION, JUDGEMENT and EXPLANATION.\n\n--CAVEAT--Very little diplomatic and military history is rigorously\norganized around the concept of Grand Strategy. Indeed, there is not a lot of\nagreement on what a grand strategy actually is. So one cannot simply pick up a\nbook or an essay that summarizes the grand strategy of most of the states that I\nhave selected for study.\n\n--CONSOLATION PRIZE-- even if you determine in the end that the whole\nanalytical framework of the course is a figment of my tortured imagination, it\nwill have:\n\n--exposed you to some basic theories of why states do what they do in\n\ninternational politics--especially balance of power theory and organization\ntheory;\n\n--substantial diplomatic history\n\n--a great deal of military history, including the development of tactics\nand technology, as well as the conduct of key battles and campaigns.\n\n\"Grand\" or \"Political-Military\" Strategy Defined\nLecture I- Part Two\nI.\nCaveats\n\nA. States do not always, or even frequently, state their grand strategies\nclearly, or write them down in one place. More often than not, they do not use\nthe term. U.S. in recent years has used the terms \"National Strategy\" for Grand\nStrategy, and \"National Military Strategy\" for Military Doctrine. (Eisenhower's\nMassive Retaliation Strategy stated in NSC 162 is an\nexample of one that was. Can be found in the Pentagon Papers.)\n\nB. Statesmen and soldiers do, however, --implicitly or explicitly--\nthink, plot, and conspire in \"strategic\" fashion.\nII.\nWhat then do we mean by the term \"Grand Strategy?\"\n\nA. A core set of beliefs about national security found in the members of\nstate's foreign policy and military elite. (Consensus would be too strong a\nword.)\n\nB. These beliefs can usually be characterized as a set of inter-connected\npolitical and military means and ends\nexpected to produce \"security.\"\n--(This term is not an objective one; a state's definition of security is not\nalways one that an outside observer would agree with.\n\n1.\nHighest-level political objectives are linked to middle-level\npolitical objectives, which are in turn linked to highest level military\nobjectives, which are linked to lower order military objectives. Each link in\nthe chain is both an end of the link below, and a means to the link above. This\nis merely an extension of Clausewitz's view of the military-political, means-\nends relationship. Duality of Means and Ends.\n\n--This image, which implies linearity, should not be taken too literally;\nit would be more exact to view Grand Strategy as a system of interlinked\npolitical and military means and ends.\n\nC. An IDEAL grand strategy would not only specify political and military\nmeans and ends, but explain why the proposed connections are expected to hold\ntrue?\n\n1. For example a simple question during much of the 1990s would have been\n\"Why is the commitment of roughly one-fifth of active US military resources to actual\npresence in Europe or its waters on a daily basis expected to produce \"security\" for the\nUS?\" Explanations of critical hypothesized linkages ought to be embedded\nsomewhere in the strategy.\n\nD. This chain of political and military means and ends may thus, also be\n\nviewed as a state's THEORY about how it can best \"cause\" security for itself.\nThat theory is tested every day in the unregulated, competitive environment of\ninternational politics.\n\nIII.\nWhat are the key questions that we shall wish to ask of each grand\nstrategy that we examine?\n\nA.\nWhat is the grand strategy? As best we can, we shall draw a map of\nthe core political-military means-ends chain.\n\nB. What are the key factors that seem to have influenced the grand\nstrategy in question?\n\n1. If we can systematize our understanding of these factors we will be\nbetter able to predict the strategies of other states, or at least explain them.\n\nC.\nWhat are the salient characteristics of the strategy. Those that\nseem to hold the greatest implications both for the security of the state\nitself, and the stability of the international political system.\n\n1. At the political level, does the state aim to preserve or upset the\nstatus quo? To what extent? (Key ? because revisionist strategies seem to have\nimportant effects on the behavior of other states.)\n\na.\nThose of us who subscribe to balance of power theory would\nargue that expansionists, or those who appear so, send to provoke coalitions\nagainst themselves unless they are very very clever..\n\n--One fundamental question we shall ask this year is how was it that\nWilhelmine Germany seemed to encircle itself, promoting a fairly cohesive\nopposing coalition, whereas Hitler managed to prevent such a coalition from\nforming until rather late in the game?\n\n2. At the military level is the strategy OFFENSIVE, DEFENSIVE, OR\nDETERRENT\n\n--OFFENSIVE--DISARMING- BLITZKRIEG GERMAN AND ISRAELI\nSTYLE\n\n--DEFENSIVE-DENIAL- US IN LATE 19TH AND EARLY 20TH\nCENTURY, WITH BRITISH,\nTWO OCEANS, and a FLEET; The BRITISH WITH THE CHANNEL AND THE\nFLEET; MAGINOT\nLINE\n\n--DETERRENT-PUNISHMENT- FINLAND, SWITZERLAND,\nYUGOSLAVIA, PRC, FRANCE AND\nBRITAIN WITH NUCLEAR WEAPONS\n\n--This is important because some have argued it affects the odds of arms races,\nprobability of war, and perhaps even the intensity of war. Some would also say that it\naffects probability of success--since there are many strategists today, as has been true\nhistorically, who simply reject defense or punishment as appropriate ways to\nwage war, insist they are doomed to ultimate failure.\n\n--President Bush extols the virtues of the offensive in the War on Terror; says a\npurely defensive strategy won't do the job. Even if you agree, is the mix right?\n\n3. Is there a coherent relationship between the political and military\n\naspects of the strategy? POLITICAL-MILITARY INTEGRATION--Is this tight\nmeans-ends relationship for which Clausewitz argues present?\n\na. Does the statesman have at hand the tools necessary to support his or her\ndiplomatic activities.\n\n--A defensive military doctrine could not support revision of the status\nquo; no gunboat diplomacy without gunboats; you can't defend a global empire\nwith meager resources; hard to practice coercive diplomacy with forces that have\na go-no-go quality-such as mobilization army or the late 1950s US plans for\ngeneral thermonuclear war.\n\n--Examples??--\n\nAs the cold war ended, US military deployments took the form of wars of\nobservation/peace keeping. Our forces were organized and their equipment was\nengineered for big wars. The inadvertent downing of an Iranian airliner revealed a\nproblem. Bernard Trainor formerly\nof the NYT, formerly Deputy Chief of Staff of the USMC.\nNYT, \"US as PeaceKeeper When Role Blurs\" NYT, 8/6/88 p.3\n--\"The military has not yet found a formula, which insures its readiness to\nfight a war, while at the same time fielding forces that can walk the thin line\nbetween restrain and violence in politically complicated crises.\"\n--\"...modern military equipment such as the Aegis system,...is also designed for\nbattlefield situations that involve only friends and targets..\"\n\nSwedish Submarine Incursions-\n--On a smaller scale, the Swedish Navy began to design homing torpedos with\npipsqueak warheads-designed to damage but not kill an enemy submarine--for\npeacetime defense against submarine intrusions by a great power whose submarines\nyou'd rather warn than sink.\n\n--Between the Bush administration's decision to add political re-engineering to the war\non terror, and the European propensity to make peace and order on their periphery,\nespecially throwing a wet blanket on civil wars a priority--we have seen a pretty\nsignificant growth in the West's steady state requirement for ground force\ndeployments. Yet, ground forces are probably the capability we shrunk the most after\nthe Cold War. Steady state maybe a capacity to keep 300,000 persons in the field,\nwith great strain. This permits you to have a ghost of a chance policing populations of\nroughly 30 million. Between Afghan, Iraq, and the Balkans we're trying to do 60\nmillion. And there is a move to add Sudan. We have to do less, get a lot better at\ndoing it, or build more ground forces--which are both expensive and not too\nglamorous.\n\nb.\nConversely has the statesman\n\nasked \"certain military moves and actions to produce effects that are foreign to\ntheir nature.\"\n\"..orders that defeat the purpose they are meant to serve.\"\nExamples?\n--Bethman-Hollweg's submarine rules of engagement.\n--US constraints on bomb run profiles of aircraft hitting the Yalu bridges in\nlate 1950\n--Perhaps US Marines in Beirut?\n--US military in Najaf??\n\nc.\nDoes the strategy set priorities for both for ends and means.\n\n--The notion of priority is critical, because we live in a world of\nscarcity; (Why we have a science of economics) Bernard Brodie use to say that\nstrategy wears a dollar sign; One could look at strategy as the production and\ndistribution of scarce military means in terms of alternate political ends.\n--Big World\n\n--Many threats and many prizes imaginable. Which are most critical?\n\n--Many kinds of forces from which to choose. Air,sea,land, heavy light,\nwhich ones are most appropriate to the ends in view.\n\n--In World War II, over 40% of US GNP was mobilized for defense, but we\nstill had to choose our battles; Europe, at least theoretically had first\npriority, the Pacific second, and Burma third.\n\n--Clausewitz makes much of concentration\non the decisive point, which is a priority issue.\n\n4. Innovation-\n\n-- Do the political aspects of the strategy adapt to alterations in the\npolitical circumstances of the state?\n\n--Does the military strategy adapt to changes in the political strategy,\nmilitary technology, or enemy military technique?\n(Example: some scholars argue that Sadat believed that Egypt and the whole Arab\nworld had to give up the objective of destroying Israel, since it was probable\nthat Israel owned nuclear weapons and could impose a prohibitive cost on the\nArabs even if they did succeed against Israeli conventional forces.)\n(Example: in the 1930's , as we shall see, the German military adapted in\nsuperior fashion to the internal combustion engine and the radio --especially\nfor the operations of tanks and fighter and tactical bombing aircraft. This put\nGermany in a position to win a series of major, swift, initial victories vs.\nFrance, Britain, and Russia. Germany's defensive potential was thus improved\nwith territory and resources, substantially raising the dollar and human costs\nof ending her bid for hegemony. France and Britain responded less well to\ntechnological opportunities, and paid the price.\n\n5. Finally, a \"residual\" category: Was the strategy successful? Why or\n\nwhy not?\n--Did it keep the state secure?\n--Help it expand its power, if that was the objective\n--Were the costs affordable?\n\n--Some of the explanations for success or failure can be found in answers\nto the preceding questions? But there may be additional reasons for success or\nfailure not covered by the questions I have outlined. If we discover any we\nshall surely wish to remember them."
    },
    {
      "category": "Resource",
      "title": "Military Organizations, the Business of War, and what it means for Innovation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-484-comparative-grand-strategy-and-military-doctrine-fall-2004/1ce39cb367c5bf62bbe0c9857d4a3b1f_milorg_and_war.pdf",
      "content": "Military Organizations, the Business of War, and what it means for\nInnovation\nI.\nIntroduction:\nOrganization theorists often think in terms of the effects of three big factors\non the behavior of large scale organizations--Purpose; People; and\nEnvironment.\nA.\nThis discussion is organized around the specifics of military\npurposes, military people, and the environment--\"combat,\"\n\"domestic,\" and foreign.\nB.\nThese are tied together by the theme of uncertainty--its\nsources, and its management.\n1.\nMean-Ends, or \"cause-effect\" Uncertainty, ie uncertainty\nabout how to complete the task in the world\n2.\nInterdependence Related Uncertainties-\n-Internal: How are my own component parts going to\nwork together\n-External: How will outsiders upon whom I depend going\nto work with me, or even at cross purposes\nC.\nHow much difference these specifics about military\norganizations make for considering the behavior of military\norganizations relative to to non-military ones is a fit subject for\ndiscussion, and comment.: Much of organization theory and\nmanagement theory is about large scale organizations that are\nsimilar, but not identical to modern militaries; a lot of\nacademics have used organization theory to look directly at\nmilitaries in one way or another.\nII.\nPurpose\nA.\nLike all organizations, in caricature, and in the abstract modern\nmilitaries arrange people for the mass production of rationality.\n(This may be changing, as I'll discuss later in the week) Max\nWeber's message. The classical administrative-bureaucratic\n\nview. Purpose is the driver. Functional Specialization of the\nOrganization and within it, with an Internal Division of Labor,\ncoordinated through a Hierarchically arranged system of\nCommand and Control. Decision made on Rationality criteria,\ncost and benefit. Professionalization of the officials/managers\nwith education and developing expertise. \"Files.\" The neutral\ntool. The living machine.\n1.\nWeber, one of the earliest students of large scale formal\norganizations, bureaucracy, understood that the very\nevolution of bureaucracy was a in part a function of the\nmilitary struggles among the monarchs of Europe, \"War\nmade the state and the state made war.\" Bureaucracies\ngrew to feed armies, and it's not an exaggeration to say\nthat the professionalization of armies and of\nbureaucracies occurred hand in hand, each learning from\nthe other.\n2.\nThe over-riding commitment to purpose, and the effort to\nachieve rationality in pursuit of that purpose make\nuncertainty of any kind an enemy. Organizations do\nwhat they can to reduce uncertainty.\n3.\nThe need to pursue purpose with people, whose\nrationality is limited, and who in any case are not actually\ngoing to be perfect cogs in a rational machine, creates\nspecial motivation and control problems for\norganizational leaders in their efforts to keep the\norganization focused on the achievement of purpose.\nPeople are a source of uncertainty.\n4.\nHow might a military organization's specific purpose\nproduce special behaviors or qualities, especially\nqualities that might bear on their ability to innovate?\nB.\nMilitary organizations do something unusual--they try to\ndestroy one another, directly. Samuel Huntington's notion of\nthe officer corps as specialists in the management of violence in\nservice to the state does not do it justice. I am not sure that any\nother organization has the explicit purpose of bashing its like to\n\npieces, with the possible exception of criminal ones in\ncompetition with each other. Very Competitive.\n1.\nSometimes you only notice this at the micro-level, the\nearly minutes of Hal Moore's aircav battalion at its LZ in\nthe Drang river area; the sudden realization of the size\nforce encountered and the desperate need to secure a\ndefensible perimeter, and bring in the reinforcements to\ndo so.\nC.\nMistakes have potentially very great Consequences. Many\norganized activities--including the Boston commute--involve\nrisk to life an limb, some risk to a few friends and colleagues,\nAlmost none risk the lives or \"freedom\" of family members and\nfriends not present. One must make decisions that at minimum\ninvolve very serious risks and costs for other organization\nmembers. The consequences of failure for ones self, ones\nassociates, ones country are absurdly great. Very Risky\n1.\nChurchill's (?) remark during WWI that Jellicoe, the\ncommander of the High Seas fleet was the only man who\ncould lose the war in an afternoon.\n2.\nPerhaps less dramatically, Keith Park, commander of\nNumber 11 Group, the one closest to the Germans in\nFrance, and defending the approaches to London, while\nnot able to lose the whole war with a mistake, failure to\nintercept, break up a German raid could produce very\nserious consequences on the ground, either for industrial\ntargets, or for bases the Germans were trying to hit; also\nhuge arguments about what is the right thing to do, try to\n\"defend\" or as those in the neighboring groups, wait,\nmuster larger concentrated forces, and try to shoot down\nmore german planes, and worry less about defending\ntargets on the ground.\nD.\nA very powerful tension between boldness or dynamism\nnecessary for competition and conservatism imposed by the\ngreat consequences??\n\nE.\nThe Purpose of Mutual Destruction Creates a Special\nEnvironment\n1.\nThis has the effect, as Clausewitz observed of giving\nwarfare an inherent competitive quality far more intense\nthan almost any other aspect of social life. The greater\nthe exposure of the state that a military organization\nserves--the more competitive that military's peacetime\nbehavior is likely to be, but as I'll suggest, this does not\nnecessarily cause innovation.\n2.\nThe activity itself creates a new environment.\nClausewitz talks about friction and the dearth of good\ninformation, often called fog.\n-It is hard to make things happen on the battlefield--even\nwhen the adversary is not fighting very hard.\n-It is hard to figure out what is going on on the\nbattlefield. Getting useful information from the mass of\nimpressions and data, often deliberately obstructed by the\nenemy (again due to the competitiveness factor) makes\nthe conduct of war a hugely uncertain activity.\n-Getting information often risks and costs lives and\nmachines.\n--Nothing is easy or free.\n3.\nWithin this environment, these organizations are in a\nrelative sense--\"fragile.\"\na)\nMost modern military organizations (not actually\nall--guerrillas, or MAD excepted ) but most, are\ntrying to coordinate the \"rational\" application of a\nrange of technologies, each of which requires a\nlittle administrative tail to fix it, fuel it, arm it,\nreplace it, as well as brain, eyes, nervous system.\nA very high level of internal interdependence in\nmodern arms, which has grown since the industrial\nrevolution. Thus the organizations suffer a kind of\nfragile internal interdependence. AND\n\n(1)\nThe campaign in the low countries took the\nGermans about six weeks in 1940 to finish\noff the better half of the French Army.\n(2)\nA new term was introduced during Desert\nStorm for the Iraqi army's efforts to avoid\nUS electronic intelligence by the very\nsparing use of their radio communications\nnetworks: EMCON suicide\n\nb)\nOften, they are surprisingly dependent on\nrelatively small numbers of high value assets\n(navies especially) and as both sides know this, the\nhigh value assets get a lot of destructive attention.\n(1)\nThe Israelis destroyed the Egyptian Air\nForce in a day, the Army in six, in 1967.\n(2)\nThe japanese lost 4 carriers in a day at\nMidway.\nc)\nBattle doesn't always, or even often, turn out quite\nso dramatically. But these organizations are\nfragile given their task--and they know it.\nd)\nThe knowledge of how quickly and easily things\ncan go very wrong, coupled with great uncertainty\nabout the precise ways it may go wrong, influences\nthe organization's day to day behavior, in war, and\nalso in time of peace.\ne)\nCompeting businesses, at least the larger ones,\ndestroy each other through competition over many\nyears;\n- to my knowledge, government bureaucracies are\nseldom actually killed off.\nF.\nThere is also a funny, and extremely scary, gray area, the\n\"Transition to Conflict,\" the moment when peace turns into war\n\neither for the organization as a whole, or even for unblooded\nunits in an organization already at war.\n1.\nFraught with Uncertainty, given what the organization\nknows in a general way about the course and risks of\ncombat, coupled with the fact that the normal peacetime\nexistence of the organization, regardless of training\nregimen, is quite different from war.\n2.\nExamples:\na)\nKasserine Pass for the US Army in WWII\nb)\nThe green 106th division in the Battle of the Bulge\nc)\nTask force Smith, but really all of the early\narriving divisions during the first weeks of the\nKorean War\nd)\nFrench Army in May of 1940\n3.\nHow do you get your organization intact through this\ntransition.\n4.\nBoth the Environment of war and the problem of the\ntransition to conflict Raise the Question for the\nOrganization of How it Prepares/Buffers itself in\nPeacetime.\n5.\nMay produce a very high premium on simplicity,\nstability, and acceptance of \"doctrine; cohesion is a very\nhigh value\n6.\nEven if someone could prove, at the last minute, that the\ndoctrine was not quite right, would you try to change it?\nAn agreed poor doctrine may be preferable to none at all\nto an organization looking forward to an imminent\ntransition from the pleasures of garrison life to the rigors\nof the campaign.\nG.\nThe Combination of Friction and Fog, with Competitiveness\nand Fragility (You could say Fear but I think it goes deeper\nthan that) Creates a Very High Degree of Uncertainty\n\n1.\nWar is at some level a struggle of rival organizations, not\njust rival orbats, doctrines, or war plans.\n2.\nA stable, agreed way of warfare, a doctrine, is a very\nappealing way to deal with friction and fog, with\nfragility, especially at the moment of the transition from\npeace to war.\n3.\nThe adversary has the same set of problems, and the\nsame set of incentives, so you want to \"operate\" your\nown doctrine, and deny the adversary his. Impose your\nplans on him.\n4.\nLive by the golden rule, do unto others as they would do\nunto you,, but do it first.--\"Offensive\" is more honored\nthan the Defensive; Striking first is tempting, even if the\nstate is a status quo power; Surprise is honored, though at\nleast one of the better known theorists, Clausewitz,\ndiscounts its utility.\n5.\nOne key aspect of this is secrecy. For purely functional\nreasons militaries wish to keep a lot of things secret, it\nhelps in this process of imposing your own sop's and\ndenying the enemy his but it has some implications for\nother aspects of organizational life..\nIII.\nThe \"Peacetime Environment\"--\nA.\nRealist theorists of International Politics see international\npolitics as an anarchical realm--\n1.\nWith no sovereign warfare is always possible and there is\nnobody to protect the state but the state, or its allies. And\nallies are often unreliable.\n2.\nAs Samuel Huntington notes in Soldier and the State,\nmilitaries tend toward a version of this belief. He\ncorrectly in my view gives the standard rationale which is\nnot as I have stated it--anarchy, but rather human nature.\nHave a pessimistic view thereof. --an unchanging\nexpectation of trouble, and attention to how you are\ngoing to deal with it.\n\nB.\nThe flip side of this expectation however, is that most of the\ntime trouble never comes; the more successful you are at\ndeterring war, or simply avoiding it, the higher your\nuncertainty about what it is that you do.\n1.\nAbsolutely key to the life of military organizations is that\nmost spend years with no reliable test of their\ncapabilities--technological, organizational, doctrinal,\ntactical.\n2.\nAnd given everything I have said so far about the\nconduct of war-- Virtually no way to reliably simulate\nthe process. You try--but it is very hard to prove\nanything. It is also quite costly. Just simulating the\nfriction of a corps level operation by trotting out a full\ntwo or three division corps is sufficiently expensive and\ndisruptive that you virtually never do it.\n3.\nWar games and simulations have gotten better and better,\nas have actual maneuvers. Militaries do what they can,\nand in recent years have invested vast sums. But there is\nsimply a lot you cannot know, as I suspect an honest\n\"before and after\" study of the Kosovo War last year\nwould show.\n4.\nAnd we have another problem, truly realistic training is\ndangerous, and with all volunteer militaries, and\nsignificant competition from the private sector, it's not\nclear how many training deaths you can really afford.\nC.\nDuring these periods of peace, much can change from your last\ncombat. Peace is full of military uncertainty.\n1.\nThe civilian economy throws off new technologies,\nwhich your old or new adversaries may exploit and\nwhich some members of your own organization, as well\nas its clients, want you to exploit..\n2.\nNew adversaries arise, or civilian leaders choose new\nones, with new or at least different methods of warfare,\nin different climates and topography.\n\n3.\nCivil society, which provides the materiel and human\ncontributions for war may change--altering notions of\nacceptable costs of combat, available resources, and even\nwhat it is permissible to do to the enemy .\nD.\nThe domestic political environment in modern societies is a\nsource of uncertainty centering around the basic purpose of the\norganization.\n1.\nMost modern states, to a greater or lesser degree,\nsubscribe to nominal civilian control over foreign policy,\nand of the the military.\n2.\nThe military's function is to manage violence in service\nto state policy. But how can this be achieved?\n3.\nIn early Organization theory, Woodrow Wilson for\nexample, people believed in policy and administration.\nCarried into military this would mean (as soldiers often\nhope, according to Richard Betts's Soldiers Statesmen\nand Cold War Crises) statesmen make policy, provide a\nmission, stand back and watch the neutral tool execute.\nBut it seldom works this way; Nobody believes it. They\nare mixed up together.\n4.\nClausewitz did not believe it either. And insisted policy\nought to infuse every aspect of the conduct of war. But\nhe did not have very interesting ideas on how to do it.\nThis gives rise to a very basic \"Cause Effect\nUncertainty.\"\na)\nDo we Make our soldiers into\npoliticians/statesmen? Running risk that their\nprofessionalism as war fighters will suffer?\n(1)\nDid Gamelin, the interwar French Army\nChief of Staff spend too much time on\ndiplomacy and alliances, to the detriment of\nhis responsibilities as a soldier, it looks like\nit?\n\nb)\nDo we encourage civilians to closely oversee the\nconduct of military operations? You can't prevent\nit if that is what they want to do, But this threatens\nthe organization's core mission, and causes it to\nfight to regain its autonomy,\n(1)\nChurchill's incessant demands on Dowding\nfor more Fighter squadrons to support\nFrance in May/June 1940, even though\nDowding had tried to explain gently that at\nsome point too few would be left to defend\nBritain, finally an open disagreement in a\nkey meetings, Churchill had to cease his\nrequests but he never forgave Dowding.\nc)\nIt is at this point that the fetish for secrecy to\ndeceive enemies without, becomes a handy\nrationale for fending off meddlers at home.\n(Weber--Secrecy is the fighting posture of the\nbureaucracy.)\n(1)\nSAC's great effort to keep SIOP information\nout of the hands of politicians, pentagon\nofficials etc.\n(2)\nGeneral disinclination to share details of war\nplans with civilians, even Pentagon\ncivilians.\n(3)\nOld pedigree, some question as to whether\nthe German Foreign Minister, Bethman\nHollweg understood that the Schlieffen Plan\nnot only called for violation of Belgian\nneutrality, which he probably did, but that it\nrequired a surprise coup de main even\nbefore German mobilization was complete.\nThus the FM did not understand that his\ntimeline for successful diplomacy was\nshorter than he thought.\n\nE.\nComparative Wealth--Militaries in societies that face any kind\nof plausible threat tend to have considerable influence over\ntheir own situation.\n1.\nControl great material resources,. Great Powers in\nparticular tend to perceive other great powers as their\nGreatest Threats which causes them to allocate Great\nResources to their defense, which they have because they\nare great powers. Even today, 3% of GDP is a pretty big\nwar chest,\n2.\nThey tend to have significant prestige, which may arise\nfrom heroic history, conservative political values, or in\nadvanced liberal democratic society simple deference to\ntechnical expertise. Although this will vary as well with\nperceived threats to the state, history, and constitution.\n3.\nSignificant internal influence, especially on its \"own\"\nissues. Political power if it confines itself to its own\nissues where it has legitimacy. Thus very great influence\nover security policy--ie it affects the task it is given.\nAnd it tries to use that power to minimize its own\nuncertainties.\na)\nNot the same everywhere, US very high, Israel\nprobably very high, much of western Europe\nprobably less.\nF.\nIn Most Countries, especially in modern times, there are several\nmilitary organizations, armies, navies, and air forces but there\ncan even be others\n1.\nOther services in peacetime and wartime can create\nsizeable interdependencies and thus sizeable sources of\nuncertainty.\na)\nFratricide for example, between army or navy\nsurface air defenses, and air force aircraft\nb)\nFratricide between aircraft and ground forces.\n[sometimes truly devastating, Leslie McNair was\nkilled in the Cobra breakout from Normandy in\n\nWWII, US bombers attacked US ground forces\nvery heavily on several occasions during the Battle\nof the Bulge, Desert Storm etc.]\n2.\nSpecial, because you need them in the moment of truth\nbut you don't have too much influence over them in many\nmilitaries and central institutions across services are often\nnot strong\n3.\nEach organization has some incentives to get into those\naspects of the other's business that affect it the most. Can\ncause Tension and rivalry, perhaps creative, as Harvey\nwill argue, but can also cause redundancy, and the over-\nconsumption of scarce resources.\na)\nI will not try to answer the perpetual question, do\nwe really need all these air forces in the United\nStates, but this basic question did provide the\nimpetus for the failed roles and missions\ncommission.\nb)\nSome of you may remember \"air land battle\"- IT is\nstriking that as late as Desert Storm, the \"air-\" part\nseemed pretty under-developed, and does to this\nday; the Army seems to still be trying to complete\nthe development of the autonomous deep strike\ncapability to destroy the Soviet Second Echelon\nwith long range rockets, which the air force never\nquite offered.\n4.\nOn the other hand, cooperative relationships, and\ndivisions of responsibility that have been negotiated with\ndifficulty over many years may deter innovation efforts-\na)\nWhen General DePuy was head of TRADOC and\nwas working up the much maligned Active\nDefense, he more or less decided that changing the\nArmy was hard enough without trying to change\nthe air force, and more or less signed a private\ntreaty with the AF saying everything on the other\nside of the FSCL is yours, I hope it all goes well\n\nfor you. He eschewed what the ALB folk hoped to,\nbut failed to, achieve.\n5.\nIn general, \"innovations\" that straddle the boundaries of\nservices should face extremely hard going\n[\"our targets your platforms, our platforms, your\ntargets\"].\na)\nClose Air Support, Maybe tactical aviation in\ngeneral\nb)\nLuftwaffe support of the German Navy\nc)\nUSAAF Long Range maritime patrol aircraft in the\nBattle of the Atlantic\nd)\n[Naval carrier aircraft support for long range\nstrategic bombers?]\nIV.\nThe People within the organization\nA.\nHow do you keep them happy in peacetime; get them to think at\nleast somewhat seriously about preparation for war; and then\nactually make them function when the crunch comes--and keep\nthem functioning?\nB.\nInformal Organization/Human Relations School.\n1.\nTraditional Preparation For War-- We don't really know\nhow to do it, but we know what it's like. Gives rise to\ntwo fundamental peacetime behaviors.\n2.\nCultivate traits in officers that will at least hold the\norganization together--ie Phlegmatic (intrepid coolness\nor calm fortitude) commanders, who can do without\nsleep; eat little, no or poor food; still approximate\nrational decision making.\na)\nSoldiers Once and Young, General, then Col.\nHarold Moore.\nb)\nRommel, Infantry Attacks\n\nc)\nMovie, Command Decisions (Le May), 12 o'clock\nhigh as well\nd)\nCS Forester, The General (Haig caricature)\n3.\nStalwart troops who trust their commanders and rely on\neach other.\n4.\nKnow your weapon--ie proficiency in the actual\ntechnical task of using it.\n5.\nNeither of these have much to do with tactics, doctrine,\noperational art, or anything else. But I advance the\nhypothesis that they are both central to the informal\norganization. Its culture.\nC.\nTo keep them \"happy\" you must go well beyond utilitarian\nincentives, to solidary and purposive ones.\n1.\nBut war is off on the horizon--so some intermediate\ngoals, conducive to solidarity are needed.\n2.\nOne source of non-monetary incentives is allegiance to\nweapons and tactics of the last glorious episode, \"branch\"\nor \"platform community\" (as Owen would say) loyalty.\n[the horse, the tank, the light infantryman with his rifle -\nLIDs, the pilot-ed fighter aircraft]\nD.\nOfficer Corps--peculiar kind of \"profession.\"\n1.\nTruly fundamental differences between doctors or\nlawyers, vs Officers. Doctors and Lawyers can take\nclients or not. They have considerable professional\nmobility. In some cases they can even change countries.\n2.\nBut not officers--particularly the ones closest to the core\ntechnology of \"management of violence.\" Officers have\none buyer--the government, and they usually can't\nswitch countries.\n3.\nThis produces extremely powerful utilitarian loyalties to\nthe organization--once you are in, the thought of being\nout is scarey purely on these grounds. (Forget the\n\nsolidary aspects, which are also very important once you\nhave lived in these organizations for long.)\na)\nThus the incentives to favor classical\norganizational preferences to enhance size, wealth,\nand autonomy, is even higher than it is for most\norganizations.\nb)\nCould change if/as more and more officers are\ndoing things that transfer easily to the civilian\neconomy, but that would not be combat arms.\n4.\nSamuel Huntington argues that the professional\nmilitary's emphasis on obedience, loyalty, and the chain\nof command stems from the military's organizational\ncommitment to infuse the conduct of war with goals of\nstate policy. I don't think this is quite right.\na)\nThis emphasis is part of both the formal and\ninformal organization, and in my view arises from\nthe grave fears of keeping any control at all once\nthe battle starts.\na)\nChain of command is the \"hardware\" of military\ncommand, loyalty is the informal glue that helps\ncommanders believe that subordinates will try to\nexecute their wishes even when the fog and the\nfriction make continuous communication\nimpossible\n5.\nBut both the professional dependence on the\norganization, and the stress on chain of command,\nobedience, and loyalty for combat effectiveness, may put\na kind of premium on maintaining the unified external\nface of the organization; we handle our own problems in\nprivate in order not to provide outsiders a way in.\nMay make innovation debates hard to have. Could\nexplain the decline of public inter-service fights in the\nUS and more generally.\n\nV.\nConclusions: Implications\nA.\nThe more encompassing the Innovation, the harder it should be\nto implement. The commitment to big macro-level\norganizational understandings--\"Service doctrine,\" should be\nvery great.\nB.\nInnovations in doctrine and tactics, should be very hard to\nachieve in \"peacetime.\" Not much can be proven; few sources\nof pressure. Much energy and capability for resistance to\nexternal meddlers.\nC.\nThe human organization has a set of values and characteristics\nthat help prepare for war in a very general way. But these\npreferred characteristics are probably not conducive to\ninnovation. 1. Loyalty can easily drift into Conformity. 2.\nRespect for the human values that get you through combat may\ndrift into a vaguely unscientific attitude 3. Sentimental\nattachment to old branches, arms, etc.may stack the deck\nagainst new ideas and proposals\nD.\nBernard Brodie says, improved weapons should not cause any\ngreat resistance, it is their implications for doctrine, tactics, and\norganization that a military has a hard time seeing, (although\nprobably a little more technology. resistance than he admits.)\nE.\nCivilian control, for direct intervention to try to spur\ninnovation, or even for policy infusion into military strategy,\n(Political-Military Integration) should be difficult, the\norganization has a lot of assets to resist civilian control, and a\nlot of incentives to do it."
    },
    {
      "category": "Resource",
      "title": "Nationalism and Military Power / Nationalism and Expansionism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-484-comparative-grand-strategy-and-military-doctrine-fall-2004/b9475bdff78575d9f8da07747bbeeaea_nationalismandmilitarypower_9_29v2.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "The Nature of Military Organizations and Their Impact on National Strategy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-484-comparative-grand-strategy-and-military-doctrine-fall-2004/64d7924aa80751e6218dc0741a65ca66_nature_of_mi_org.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "Readings",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-484-comparative-grand-strategy-and-military-doctrine-fall-2004/84bfeed6ee8c36ecaeacf9a1afec5580_readings.pdf",
      "content": "In addition to the readings listed by week below, see the bibliography of required\nand recommended readings used in the course.\nSES #\nTOPICS\nREADINGS\nI. Grand Strategies: Their Origins and Their Effects\nCourse Overview and\nIntroduction to Grand\nStrategy\nClausewitz, Carl von. \"The Influence of\nClausewitz.\" On War. Edited and translated by\nMichael Howard and Peter Paret. Princeton:\nPrinceton U. Press, 1976, pp. 27-44.\nNote: All scholars of security affairs should own\nthis book. If you do not wish to own this book,\nyou must copy these pages and read them.\n\n------. \"War Plans.\" On War. Edited and\ntranslated by Michael Howard and Peter Paret.\nPrinceton: Princeton U. Press, 1976, Book 8, pp.\n577-637.\nNote: All scholars of security affairs should own\nthis book. If you do not wish to own this book,\nyou must copy these pages and read them.\n\nBassford, Christopher. \"Clausewitz and His\nWorks.\" Chapter 2 in Clausewitz in English.\nNew York: Oxford U. Press, 1994, pp. 9-33.\n\nLiddell-Hart. Strategy. Chapter XIX, pp. 319-\n323.\n\nPosen. Sources of Military Doctrine. Chapter 1,\npp. 13-33.\nMaterial Influences on\nStrategy: Geographical\nPosition, National Power\nand Military Technology\nGeographical Position and National Power\n\nKennedy. Rise and Fall.... Chapter 7, pp. 177-\n202.\n\nKennedy. \"The First World War and The\nInternational Power System.\" pp. 7-40.\n\nPosen. Sources of Military Doctrine. Chapter 2,\npp. 34-41, 59-80.\n\nRecommended\n\nWeigley. \"A Strategy of Sea Power and Empire.\"\nChapter 9 in The American Way of War. pp. 167-\n191. Supplements the preceding.\nMilitary Technology\n\nHoward. \"Men Against Fire.\" In Military\nStrategy and the Origins of the First World\nWar. pp. 41-57.\nMilitary Organizations\nHoward. War in European History. Chapter 4,\npp. 54-74.\n\nIrvine, Dallas. \"The Origin of Capital Staffs.\" pp.\n161-179.\n\nPosen. Sources of Military Doctrine. pp. 41-59.\n\nVagts. History of Militarism. pp. 323-359.\n\nTravers, T. H. E. \"Technology, Tactics, and\nMorale: Jean de Bloch, the Boer War and British\nMilitary Theory, 1900-1914.\" pp. 264-286.\nNationalism\nCarr. \"The Third Period.\" In Nationalism and\nAfter. pp. 17-26.\n\nStern. \"Why do People Sacrifice for Their\nNations?\" In Perspectives on Nationalism and\nWar. pp. 99-121.\n\nHayes. \"Nationalism and International War,\" and\n\"Nationalism and Militarism.\" In Essays on\nNationalism. pp. 126-155, 187- 195.\n\nParet, Peter. \"Nationalism and the Sense of\nMilitary Obligation.\"\n\nPosen, Barry R. \"Nationalism, the Mass Army,\nand Military Power.\"\n\nEvera, S. Van. \"Hypotheses on Nationalism and\nWar.\" pp. 5-39.\n\nFarrar, L. L., Jr. \"Villain or Scapegoat?\nNationalism and the Outbreak of World War I.\"\n\nWilliamson, Samuel R. \"The Domestic Context\nof Habsburg Foreign Policy.\" Chapter 2 in\nAustria-Hungary and the Origins of the First\nWorld War. New York: St. Martin's, 1991, pp.\n13-33.\nThe International\nPolitical System:\nConstraints, Incentives\nand Interactions\nJervis. \"Cooperation Under the Security\nDilemma.\" pp. 167-214.\n\nWaltz. \"Anarchic Orders and Balances of\nPower,\" and \"Structural Causes & Military\nEffects.\" In Theory of International Politics. pp.\n102-128, 161-193.\n\nChristensen, T., and J. Snyder. \"Chain Gangs and\nPassed Bucks.\" International Organization 44,\nno. 2 (Spring 1990): 137-168.\n\nLynn-Jones. \"Offense-Defense Theory and its\nCritics.\" Security Studies 4, no. 4 (Summer\n1995): 660-691.\nHistorical Case Studies\nGeorge, Alex. Case Studies and Theory\nDevelopment. pp. 43-68.\n\nLijphart, Arend. \"Comparative Politics and the\nComparative Method.\" pp. 682-693.\n\n------. \"The Comparable Cases Strategy in\nComparative Research.\"\n\nLevy, Jack. \"Too Important To Leave to the\nOther.\" International Security 22, no. 1 (Summer\n1997): 22-33.\n\nHaber, S., D. Kennedy, and S. Krasner. \"Brothers\nUnder the Skin...\" International Security 22, no.\n1 (Summer 1997): 34-43.\n\nGaddis, John Lewis. \"History, Theory and\nCommon Ground...\" International Security\n(Summer 1997): 75-85.\n\nPosen, Barry R. The Sources of Military\nDoctrine.\nRead the Preface, and Chapters 2 and 7, but read\nthem after you read the methodology articles,\nand with an eye to how methodological problems\nwere solved, or not. You can skim as much of the\nrest of the book as you wish.\n\nParet, Peter. \"The History of War and the New\nMilitary History.\" In Understanding War.\nPrinceton: Princeton U. Press, 1992, pp. 209-\n226.\nII. Origins of World War I\nThe Anglo-German\nRivalry (Naval and\nOtherwise)\nCrowe, Eyre. \"Memorandum of Eyre Crowe.\"\n\nKennedy. \"Tirpitz, England and the Second Navy\nLaw of 1900: A Strategical Critique.\" pp. 33-57.\n\n------. Rise and Fall. Chapter 8, pp. 205-237.\n\nTurner, L. C. F. Origins of the First World War.\npp. 1-60.\n\nLynn-Jones, Sean. \"Detente and Deterrence:\nAnglo-German Relations, 1911-1914.\" In\nMilitary Strategy and the Origins of the First\nWorld War. pp. 165-194.\n\nGeiss. German Foreign Policy 1871-1914. pp.\n75-83, 106-118, 121-127, 139-145.\n\nWilliamson, S. R. \"Joffre Reshapes French\nStrategy.\" pp. 133-154.\n\nCopeland, Dale C. \"German Security and the\nPreparation for World War I.\" Chapter 3 in The\nOrigins of Major War. Ithaca: Cornell, 2000, pp.\n56-78.\n\nRecommended\n\nRich, Norman. Hitler's War Aims. pp. XIX-\n\nXXX. (useful historical background)\nGrand Strategy and\nMilitary Doctrine\nAmong the Pre-WWI\nLand Powers\nStevenson, David. \"Militarization and Diplomacy\nin Europe before 1914.\" International Security\n22, no. 1 (Summer 1997): 125-161.\n\nSagan, Scott. \"1914 Revisited: Allies, Offense,\nand Instability.\" In Military Strategy and the\nOrigins of the First World War. pp. 109-133.\n\nRitter. \"The Breach of Neutrality.\" In The\nSchlieffen Plan. pp. 3-10, 78-96.\n\nSnyder, Jack. The Ideology of the Offensive.\n(entire)\nThe July Crisis, Military\nStrategy and the\nOutbreak of the War\nTrachtenberg, M. \"The Meaning of Mobilization\nin 1914.\" In Military Strategy and the Origins of\nthe First World War. pp. 195-226.\n\nEvera, Van. \"The Cult of the Offensive.\" In\nMilitary Strategy and the Origins of the First\nWorld War. pp. 59-109.\n\nTurner. Origins. pp. 60-115.\n\nTurner, L. C. F. \"The Russian Mobilization in\n1914.\" pp. 252-268.\n\nHerrmann, David. The Arming of Europe and the\nMaking of the First World War. Chapter 7, pp.\n199-224.\n\nFuller, J. F. C. \"The Battles of the Marne and\nTannenberg, 1914.\" In A Military History of the\nWestern World. New York: Da Capo Press,\n1956, pp. 182-228.\nThe maps at this site will make the initial plans\nand the first battles much easier to understand.\nRecommended\n\nLevy, J. \"Preferences, Constraints, and Choices\nin July 1914.\" In Military Strategy and the\n\nOrigins of the First World War. pp. 226-262.\nThe Course and Conduct\nof WWI\nLupfer, Timothy. \"The Dynamics of Doctrine:\nThe Changes in German Tactical Doctrine\nDuring the First World War.\" Leavenworth\nPaper, no. 4 (July 1981): 69. (entire).\nThose who have not read it before should read\n\nKeegan, John. \"The Somme.\" The Face of Battle.\npp. 204-284.\nNote: This book is a Minor Classic; Security\nStudies Scholars should own a copy. If you do\nnot wish to own the book or cannot find a library\ncopy you will need to make yourself a copy.\n\nKennedy. Rise and Fall. Chapter 9, pp. 239-265.\nRecommended\n\nMay, Ernest R. \"The U-Boat Campaign.\" In Use\nof Force by Art and Waltz. 1971, pp. 298-315.\nThe original source is:\n\nMay. The World War and American Isolation.\nCambridge: Harvard U. Press, 1966, pp. 114-\n136. (Students will also find pp. 200-252, and\n387-415 instructive.)\nBibliographical Note On the Pre-World War I\nPeriod\nStudents interested in more comprehensive\ndiscussions will wish to examine\nSteiner, Zara. Britain and the Origins of the First\nWorld War.\n\nBerghahn, V. R. Germany and the Approach of\nWar in 1914.\n\nKeiger. France and the Origins of the First\nWorld War.\n\nLieven, D. C. B. Russia and the Origins of the\nFirst World War.\n\nWilliamson, Samuel. Austria Hungary and the\nOrigins of the First World War.\n\nShanafelt, Gary. The Secret Enemy. (About\nGerman-Austria relations.)\nIII. Origins of World War II\nBritish and German\nGrand Strategy in the\n1930s\nWeinberg, Gerhard. \"From One War to\nAnother.\" In A World At Arms. pp. 6-47.\n\nMay, Ernest. Strange Victory. Chapter 7, pp. 94-\n110.\n\nKennedy. Rise and Fall. Chapter 10, pp. 267-\n298.\n\nPosen. Sources of Military Doctrine. Chapters 5,\nand 6.\n\nSchweller, Randall. \"An Assessment of the\nInternational Distribution of Power (circa 1938-\n1940).\" Deadly Imbalances. pp. 203-208.\n(Appendix)\n\nRecommended\n\nHoward. War in European History. Chapter 7,\npp. 116-135.\nFrench Grand Strategy\nMay, Ernest. Strange Victory. Chapters 8, 9, 10\n(pp. 113-153), Chapters 19-21 (pp. 271-322).\n\nPosen. \"Still Strange Defeat.\" Draft\n\nYoung, Robert. In Command of France. pp. 1-\n33.\n\nPosen. Sources of Military Doctrine. Chapter 4.\nMilitary Doctrine, Land\nWarfare, and the Crises\nof the Late 1930s\nMearsheimer, John. Conventional Deterrence.\n(All but the Chapter on the Nato-Pact\ncompetition.)\n\nHerwig, Holger. \"Clio Deceived.\" In Military\n\nStrategy and the Origins of the First World War.\npp. 262-301.\n\nMay. Strange Victory. Chapters 11, 12, pp. 153-\n212.\n\nPosen. \"Competing Images of the Soviet Union.\"\n\nOvery, R. J., and Andrew Wheatcroft. \"The\nSoviet Union.\" Chapter 5 in The Road To War.\nLondon: Penguin, 1999, pp. 210-257. Revised\nand updated edition.\nThe Opening Battles of\nthe War\nReview\n\nPosen. Sources of Military Doctrine. pp. 81-104.\nRead\n\nMay, Ernest. Strange Victory. Chapters 15, 16,\n17, 18 (pp. 215-268), Chapters 24 through to the\nconclusion (pp. 347-464).\n\nRequired Readings\nHoward, Michael. War in European History. Oxford: Oxford University Press,\nIncorporated 2001. ISBN: 0-19-280208-9.\nKennedy, Paul. The Rise and Fall of British Naval Mastery. Amherst, New York:\nPrometheus Books, Publishers, 1986. ISBN: 1-57392-278-1.\nMearsheimer, John J. Conventional Deterrence. Ithaca: Cornell University Press, 1983.\nISBN: 0-8014-1569-1.\nTurner, L. C. F. Origins of the First World War. New York: W. W. Norton and\nCompany, Incorporated, 1970. ISBN: 0-393-09947-4.\nMiller, Steven, S., Lynn-Jones, and S. Van Evera. Military Strategy and the Origins of\nthe First World War. Princeton: Princeton University Press, 1991. ISBN: 0-691-02349-2.\nPosen, Barry R. The Sources of Military Doctrine. Ithaca: Cornell University Press, 1986.\nISBN: 0-8014-9427-3.\nSnyder, Jack. The Ideology of the Offensive. Ithaca: Cornell University Press, 1989.\nISBN: 0-8014-8244-5.\n\nMay, Ernest R. Strange Victory: Hitler's Conquest of France. New York: Farrar,\nStraus and Giroux, 2000. ISBN: 0-8090-8906-8.\nRecommended Readings\nThe following books are recommended as sources for substantive or theoretical\nenrichment; I do not ask you to buy them but you should know of their existence.\nKennedy, Paul. The Rise and Fall of the Great Powers. New York: Vintage Press, 1989.\nISBN: 0-679-72019-7.\nMearsheimer, John J. Liddell Hart and the Weight of History. Ithaca: Cornell University\nPress, 1988. ISBN: 0-8014-2089-X.\nMcNeill, William H. The Pursuit of Power. Chicago: University of Chicago Press, 1984.\nISBN: 0-226-56158-5.\nRopp, Theodore. War in the Modern World. Baltimore: Johns Hopkins University Press,\n2000. ISBN: 0-8018-6445-3.\nSnyder, Jack. Myths of Empire. Ithaca: Cornell University Press, 1993. ISBN: 0-8014-\n9764-7.\nWeigley, Russell. The American Way of War. Bloomington: Indiana University Press,\n1960. ISBN: 0-253-28029-X."
    }
  ]
}