{
  "course_name": "Composing with Computers I (Electronic Music Composition)",
  "course_description": "This class explores sound and what can be done with it. Sources are recorded from students’ surroundings - sampled and electronically generated (both analog and digital). Assignments include composing with the sampled sounds, feedback, and noise, using digital signal processing (DSP), convolution, algorithms, and simple mixing. The class focuses on sonic and compositional aspects rather than technology, math, or acoustics, though these are examined in varying detail. Students complete weekly composition and listening assignments; material for the latter is drawn from sound art, experimental electronica, conventional and non-conventional classical electronic works, popular music, and previous students’ compositions.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Music",
    "Music Theory",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Music",
    "Music Theory"
  ],
  "syllabus_content": "This page includes a course\ncalendar\n.\n\nCourse Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nLabs: 1 session / week, 1 hour / session\n\nWhat The Class Is, and What It Isn't\n\nThis class is all about sound, and what we can do with it. The sources are recorded from our surroundings, sampled, and electronically generated (both analog and digital). Assignments include composing with these sounds, feedback, noise, etc., using DSP, convolution, algorithms, simple mixing, etc. The emphasis of the class is not on technology, math, or acoustics, though these are examined in varying depth. Rather, the focus is on sonic and compositional aspects. There are weekly composition and listening assignments, the material and forms for the latter being drawn from sound art, experimental electronica, both conventional and not-so-conventional classical electronic works, popular music, and previous students' compositions. This is not an intensely classical class, nor is it about making beats, production, and studio recording. You will, however, learn some of the skills that will be useful for doing those things. A detailed syllabus, including all composition and listening assignments, and what should be achieved each week, will be given at the beginning of each module.\n\nThe following contains some general rules and procedures that\nmust\nbe followed, so please read this syllabus carefully, and refer back to it from time to time. Experience tells me that I will periodically be asked about class requirements, etc. Please first look back at this document. Especially note the section on grades. Also please note that everything is posted on the class Web site, including this.\n\nClass Structure\n\nThere are five modules. Each module consists of weekly composition assignments, new studio techniques, and for some of you, new types of listening to music and new ways of thinking about it. The assignments work progressively toward a final project for each module. At the beginning of each module, a syllabus will be handed out. We will present a cross-section of our work at a final concert, open to the public (which usually means one or two friends, plus the class, maybe a parent). I always (try to) make piece especially for the concert, using the constraints I set for you. There is no official final project, and there is no exam. The first class is simply for introductions, a performance of a non-instrumental reading of John Cage's\n4'33\"\n, either on the geometric sculpture in Killian Court, or on the benches beside the Green Building (or under the Green Building if it is raining), and a survey of the music we will be encountering this semester, including student compositions. You'll know then whether or not this class is for you...\n\nThe Five Modules\n\nMODULES\n\nTOPICS\n\nMODULE SYLLABI\n\nMusique concrete, form and content\n(3 weeks). Studio basics, recording, musique concrete, representation, basics of Pro Tools software, detailed structure.\n\n(\nPDF\n)\n\nFeedback and continuity\n(2 weeks). Studio feedback, Pro Tools bussing, hardware and software delays, hardware filtering, software reverb, continuous/improvised structure.\n\n(\nPDF\n)\n\nNoise and layers\n(3 weeks). Convolution, Peak software, making noise, dense layering, software filters, noise reduction, other Pro Tools plug-ins, sculpting sound, beautiful sounds.\n\n(\nPDF\n)\n\nSynthesis, algorithm, interaction (Max/MSP)\n(4 weeks). Introduction to Max/MSP software--a graphic programming environment--algorithmic composing, sound synthesis, interfaces for (performance) interaction.\n\n(\nPDF\n)\n\nSampling, remixing, polishing\n(1 week). Borrowing sounds from other sources (either a single source, a large number of sources, or one's own compositions), using single sounds to make new music, or polishing a previous composition.\n\n(\nPDF\n)\n\nConcert\n\nOn the day of our final lab we will each play one of our pieces from the semester, which may or may not be interactive, and perhaps do a performance of an\nImaginary Landscape\nby John Cage.\n\nClass: Composition Assignments and Composition Critiques\n\nThis will be in seminar/critique format, mainly consisting of listening and reacting to the previous week's composition assignments and listening.\nContribution to class discussion\n, and occasionally writing responses to student work, is\nrequired\n.\nAttendance is mandatory\n. Each semester we will have a guest artist, or explore composition via non-musical means.\n\nThe composition assignments--some of which are studies or recordings, others real compositions--will generally be short, and carefully specified. Having said that, there's a lot of leeway in what you can do. The assignments are specified in the syllabus for each module, and the instructions should be followed\nexactly. Assignments are expected to be submitted on time\n. They are due\nbefore\nclass, and\nmust\nbe in the appropriate folder on the studio computer, appropriately named.\n\nWhen final modular compositions have been submitted--there are five of these--instead of there being a full listening journal, a composition critique is\nrequired\nwith an extremely abbreviated listening journal both due at lab. This means that when each piece is played, everyone\nmust\ntake notes. We will have the usual verbal discussion, but over the next two days, a slightly more organized version of the critique\nmust\nbe completed and submitted to the appropriate class Web site assignment dropbox\nbefore\nthe next lab. I do not accept paper or emailed versions. I will then condense and collate feedback, and hand it back to each of you for your edification (at least, I hope it will be edifying). Comments will be treated anonymously, so please feel free to write anything\nconstructive\n. I will slip in remarks that I choose not to make during class.\n\nLab Sessions\n\nLab times will be allocated on the first day of class. In lab we cover technical aspects, bring up problems, and discuss compositional technique at the computer. With a couple of exceptions, lab notes will be given out and put on the class Web site.\nAttendance is mandatory for the first lab of Modules 1-4. And definitely be punctual\n. I used to wait for all students before starting the lesson, but now I start exactly at five minutes past the hour. And all labs used to be mandatory, but now it's really up to you to show diligence or superb prior knowledge, wisdom, and technique. (Don't confuse this with class, which is absolutely mandatory.)\n\nListening Journals\n\nThere will be around an hour of compulsory listening each week, listed in each modular syllabus. All works will be available on the class Web site. Five pieces will be listed as compulsory. Of those,\nyou must write a half page each on three of them\nof your own choosing. Focus on showing me that you actually listened to the pieces, that you gained some insight (technical, aesthetic, personal), and that you can describe these insights.\nFor the remaining two pieces, you must write a couple of lines\njust to show me that you listened to them. Please interpret \"half page\" in a reasonable manner. Most weeks I will also provide listening guides of varying depth and quality, including both information and issues to be addressed. Your listening assignments\nmust\nbe completed and submitted to the appropriate class Web site assignment dropbox\nbefore\nthe next lab. I do not accept paper or emailed versions. I will then condense and collate feedback, and hand it back to each of you for your edification (at least, again, I hope it will be edifying). You should try to listen to the pieces by the time we have class, even though the write-up is due by the following lab; this way we can discuss the pieces in class. Dates are specified on each modular syllabus, though the pattern is obvious. A few recommended extra pieces will be listed. You don't need to listen to these, but they are there if you are interested and have time. Perhaps some time in the future. Works from past students are also posted, to offer ideas or hints at what might be expected of you, for each week's assignment.\n\nAn exception to this is for the weeks you have to give a composition critique\n--these will be made clear in each modular syllabus, by the word\nabbreviated\n. There will still be listening, to be discussed in class, and instead of a full journal,\njust a line on each of the five pieces is required\n.\n\nDon't think of this as a burden; it should be fun, or at least interesting. If you like, do this while working on p-sets, or whatever. There is no use taking the class if you don't want to open up your ears. It is unlikely that every piece will be to your immediate liking, but try to be as positive and open-minded as possible. Do not \"grade\" the pieces or the composers.\n\nStudio Access, etc.\n\nThe studio is available 24/7, and you will have 4 hours allotted to you on a regular basis; this should be enough for your composition assignments. Your hours will be chosen/allocated in the first lab. Students living off-campus, especially females (for safety reasons), have priority in choosing times. Your hours can be divided in any way, though past experience tells me that one or two blocks of time will serve you better than four one-hour sessions. There are studio rules to be followed--we will cover these in the first lab. Some assignments can be completed on your own equipment, in which case you will need a way of transferring large files from your computer to the studio, always as aifs, never mp3s or wavs or anything else. A flash drive, something like an iPod(r), or CDs might be useful; but i find proficiency with scp or sftp or other networking tools/commands are way more helpful. It's up to you to learn how to navigate the MIT network, especially when a Mac is at the receiving end.\n\nStudio Rules (\nPDF\n)\n\nReadings\n\nThere will be none! (That is, aside from my listening notes, and my weekly feedback.)\n\nGrades\n\nI hate grades, but here goes:\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n55%\n\nAssignments (composition, listening, critique)\n\n45%\n\nAssignments are weighted equally. Participation has already been described, and will be reiterated below.\n\nI will only tell you your grades for each component if you ask; I'll let you know if you are slipping or if you are obviously not spending enough time on your assignments. You will notice that participation is worth the most. And throughout the semester you'll notice I'm pretty easy-going about a number of things. Among these things are most definitely\nnot\n: punctuality, attendance, getting assignments in on time, and treating this class merely as your HASS requirement. To each of those points:\n\nShow up on time. In the past I didn't start until everyone was present who had not forewarned me of his or her absence, but now I start on time for class and lab. Being late is also inconsiderate.\n\nBe sloppy with your other classes if you like. But I'd like you to show up to every class and every mandatory lab. Otherwise it is more work for me. Or you'll fall behind, and I don't want that, even if you don't care.\n\nThis is a participation-heavy class, and that means sharing your work. You have to do your work on time for that to happen.\n\nThe HASS thing. I have tried to make this class as enjoyable as possible, and as much a reprieve from the hell of MIT p-sets as possible, without it being an easy A. It is a serious composition class. Treat it that way.\n\nAcceptable reasons for skipping class or lab, or being late with an assignment: field trip, job or internship interview, conference, illness (please don't come to class if you could pass something on to someone else), mental health, death of someone close, religious reasons, sporting events in which you are participating. I accept all acceptable reasons equally. Please let me know in advance if possible (and please ask, don't tell. Just for the sake of being polite). Unacceptable reasons for the above: being tired, having pulled an all-nighter, need to study for an exam, hangover, need to complete an assignment for another class, concurrently being enrolled in another class, bad weather. You get the idea. Asking for extra help--and I'm generous with responding--doesn't ruin your grade. But doing extra work doesn't improve your grade. In fact, you are strongly encouraged to seek extra help when you need it, but save particularly advanced questions for 21M.540. If you miss class or lab for a legitimate reason, I will gladly help you catch up. If you miss for no good reason, you are out of luck.\n\nIn summary:\nAttendance of all classes and some labs is mandatory. Assignments, listening journals, and critiques must be submitted on time or your grade will hurt. Tardiness in any way constitutes a breach of the attendance and deadline rules.\n\nAnd, here's the most important part:\nYou can \"mess up\" once (be remarkably late, absent, fall behind, all without reasonable excuse--and I'm reasonable about what reasonable means). More than once, I'll be tempted to give you a potentially disappointing grade.\n\nCalendar\n\nWEEK #\n\nMODULES\n\nLAB SESSIONS\n\nWEEKLY ASSIGNMENTS\n\nCLASSROOM SESSIONS\n\nNone\n\nNone\n\nFirst class: listening survey (\nPDF\n)\n\nModule 1: musique concrete, form and content\n\n1.1\n\nBasic studio technique\n\nRecording sounds, basic studio technique\n\nListen to assignment 1.1, discuss listening 1.1\n\n1.2\n\nPro Tools editing\n\nTechnical composition, abstracting scores\n\nListen to assignment 1.2, discuss listening 1.2\n\n1.3\n\nMore Pro Tools editing\n\nReal composition based on score\n\nLook at score from assignment 1.2; listen to assignment 1.3, discuss listening 1.3\n\nAssign critique, due at lab 2.1\n\nModule 2: feedback and continuity\n\n2.1\n\nSpeaker-mic feedback; outboard processing such as filters, delay, EQ, Aural Exciter\n\nFeedback improvisation\n\nListen to assignment 2.1, discuss listening 2.1\n\n2.2\n\nPro Tools busses, internal feedback loops, delay and reverb inserts; Pro Tools tricks\n\nFeedback composition and continuity\n\nListen to assignment 2.2; discuss listening 2.2.\n\nAssign critique, due at lab 3.1\n\nModule 3: noise and layers\n\n3.1\n\nIntroduction to Peak\n\nCollecting specific types of sounds\n\nListen to Alvin Lucier's \"I Am Sitting In A Room\"; listen to examples of assignment 3.1 and discuss listening 3.1; go through examples of my own work related to assignment 3.2.\n\n3.2\n\nRecording using Peak; Peak plug-ins; SuperFreq-10; SoundSoap; other noise reduction techniques\n\nLayers, scenes, nice sounds, dense and linear noise\n\nListen to assignment 3.2; drawing with pastels for \"inspiration\" for the next assignment while we discuss listening 3.2.\n\nListen to Maryanne Amacher's \"Head Rhythm 1\" (from\nSound Characters\n) loud, and watch\nSouth Park\n.\n\n3.3\n\nOther Pro Tools inserts; automating inserts; dynamics; Peak to Pro Tools and vice versa\n\nNoise or drone composition\n\nSpecial assignment: before lab 4.1, download Max/MSP and begin to learn it.\n\nListen to assignment 3.3.\n\nAssign critique, due at lab 4.1.\n\nModule 4: synthesis, algorithm, interaction (Max/MSP)\n\n4.1\n\nBasic Max/MSP\n\nBasic Max/MSP\n\nListen to and look at assignment 4.1, discuss listening 4.1\n\n4.2\n\nMore Max/MSP; review assignment 4.1\n\nMore basic Max/MSP\n\nListen to and look at assignment 4.2, discuss listening 4.2, prepare for listening 4.3 which will be your own choices.\n\n4.3\n\nGo over current Max/MSP work\n\nWrite proposals for final Max project and assignment 5.1\n\nReview Max final project proposals, both written statements and initial work\n\n4.4\n\nMore Max/MSP, with emphasis on finishing final Max projects\n\nComplete final Max project\n\nReview assignment 4.4 and listening 4.4\n\nModule 5: sampling, remixing, polishing\n\n5.1\n\nListening to module 5 pieces, explain assignment 5.1\n\nYou choose!\n\nSpecial assignment: prepare for concert\n\nListen to assignment 5.1, discuss requirements for concert\n\nConcert",
  "files": [
    {
      "category": "Resource",
      "title": "lab1_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/fb3737d59f6779ea14af7cfc84973340_lab1_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 1.1: Basic Studio Technique\nThe studio is being repaired right now. Everything works, but quite a few things are in the process of being replaced/\nupgraded, including software. One problem might be obvious: The quality of audio signal is sometimes weaker on one\nside, there are buzzes, hisses, and sometimes one side drops out almost completely. If this happens, wiggle and push\ncables on the patchbay and behind the mixer and studio rack that I told you not to touch.\nTO POWER UP AND DOWN\nTurn on equipment in this order:\n0. The computer should be kept on at all times. When no one is there, no applications should be running. Closing a\nwindow on a Mac doesn't shut down the application. Only restart when you need to (which will be more often than we'd\nlike). The computer is to remain on so that it can be accessed remotely.\n1. In the server room, turn on the computer if it isn't already on. The on button is in the center of the front of the new,\nbig, metallic computer; if the computer is on, the button should be lit. Should you ever need to hard reboot the\ncomputer, i.e., if the computer freezes and you can't choose 'Restart' from the apple menu, you need to hold down the\non button for five seconds, quite firmly, then once the computer is off, turn it on in the usual way. To force-quit an\napplication that is frozen, either right-click (control-click) on the application's icon on the dock, or press command-shift\nescape, which is the same as alt-control-delete on a PC. The latter gives you a simplified list of applications operating.\n2. To login, use student/student361. This gives you access to all that you need, and restricts you from certain things.\nYou can run any normal application (some of which I have put in the dock), plus terminal and a couple of other system\nutilities. You can see other students' work; plus you can see the work of all former students since fall 2003, but they are\nread only.\n3. In the studio, turn on the rack power supply (at the top of the rack), then, after making sure the mixing board faders\nare down and computer has fully booted (if that was necessary), turn on the monitors (speakers). They have switches\non the front.\nTurn off equipment in the reverse order, making sure the mixing board faders are all down, and everything is set as\nspelled out in the studio rules. Please do not turn off individual pieces of equipment, especially not the computer\nmonitor. Logout (keyboard shortcut: command-q). Please leave the computer logged out when you are not there, so that\nothers can 'finger' the computer to see if it is free.\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nBASIC UNDERLYING DESIGN OF STUDIO\nEverything is routed through the patchbay, which is clearly labeled. (Ha! Not really--this will be fixed.) All outputs are in\nrow A and all inputs are in Row B--so if you're patching A-A or B-B you're doing something wrong! (An exception is the\n'mult'--more on that later--and also the mic pres, for now--this will change shortly.) And potentially damaging the\nequipment. The basic routing of the studio is as follows. (This is a very brief account, and was explained in greater\ndetail in lab.) You somehow get your signal into the patchbay, route it through the mixer, then you can route the\nsignal from the mixer either somewhere else, such as the computer, or to the monitors. All routing is done via\nthe patchbay. To patch the main output of the mixer to the studio monitors, use the top patchbay at the very left:\nvertically connect the main outs with studio monitor ins. (The signal can also be routed to the classroom, but it is more\nlikely that I'll be doing that, not you.) And you can leave these two cables in even though the studio rules say something\nabout removing all cables.\nThe basic design of the mixer is: there are a number of inputs, labeled Mix In 1-8 on the patchbay. The signal\napproximately travels down from the top of each input column: through the input sensitivity (trim) which is your last\nresort to boost volume, through the effects and EQs (which we don't use), then to the faders. We can use mix in 1-8 in\nthe current studio configuration. The signal from the inputs is routed to submix outs (the four faders on the bottom\nright of the mixer, other than the main mix fader), which are organized in stereo pairs 1-2 and 3-4 (bottom right of\nthe mixer). A combination of numbered buttons and the pan pot on each input determines to which submixes the\nsignal is routed. The signal can now be taken from the mixer, labeled Mix Out 1-4 on the patchbay. The signal at the\nsubmix part of the mixer can also be routed to the monitors, via the L&R buttons, through the main mix faders,\npatched from Mixer Out L&R to Studio Mon L&R. To get the signal to and from the computer, use the patchbay\nsockets labeled 96 In 1-6 or 96 Out 1-6. (The soundcard's name is abbreviated to '96.') There is an additional output\nfrom the computer, from the built-in soundcard, labeled Mac Out L&R. This will be useful in later assignments, and\ncould be useful if you are working on Pro Tools, but also want iTunes open--in which case open Pro Tools first.\nIf you want to split a signal, i.e., take it from one source and send it to more than one device, use the Mult part of the\npatchbay. Each of the four sockets functions equally.\nUse System Preferences>Sound to route the signal from Mac Out to the Digi HW (96). If iTunes, for instance,\ndoesn't play from Mac Out, then someone has set the system preference to the 96. Or if you were expecting iTunes to\nplay from the 96, and it doesn't, then it's playing through the built-in soundcard (Mac Out). If Pro Tools doesn't run and\niTunes is open, then system preferences have been set to the 96 (Pro Tools demands exclusive rights over the 96, and\ncannot use the built-in soundcard).\nTO PLAY A SOUND FROM AN EXTERNAL DEVICE\n1. Plug the Aux(iliary) cable into your device. That's the dangling stereo mini (1/8\") cable with a red head.\n2. Cable Aux L&R on the patchbay to Mix In 1-2, making sure L->L and R->R. It's good practice, at least to start\n\nwith, to take outputs to inputs, just so you become aware of the signal path. The signal is now routed from your device\nthrough the patchbay into inputs 1 and 2 (the two leftmost fader columns) of the mixer. You could have chosen other\nMix Ins. (Sounds like an ice cream.)\n3. You need to have the mixer route the signal from inputs 1-2 to submix 1-2 (or 3-4, whatever, I'll use 1-2 for now).\nRemember that the 1-2 of the track names and the 1-2 of the submix names are not related (since you could be\nsending input 1-2 to submix 3-4 with the same results). You do this by pressing the 1-2 button on input 1-2. Make\nsure the other buttons are up so that you're not routing to two submixes simultaneously. (You shouldn't use the\nnearby L-R and Solo in this class.) (It's not wrong to send a track signal to multiple submixes, but we only need to use\none pair for now.) To insure input 1 goes to submix 1 and input 2 goes to submix 2, set the input 1 pan pot at\nhard L and the input 2 pan pot at hard R. In other words, the pan pot distributes the signal between the two submixes\nof each pair you have selected; it doesn't directly send the signal to the L&R monitors. You could have done it the other\nway around--sending input 1 to submix 2, and vice versa. But we are keeping the L signal L all the way. Make sure the\ntrim pot (at the top of the input column) is set to U(nity). (This should be its default setting.) You can adjust these\nlater, if necessary, keeping in mind the need to return the mixer to its default when you leave the studio.\n4. Press the submix 1 L button and the submix 2 R button. This routes the signal to the main mix fader on the right,\nsubmix 1 to L and submix 2 to R. (Again, you could have reversed this, but we are keeping left and right intact.) We use\nthe main mix fader to send the signal to the monitors, via the main out to studio monitor in on the patchbay (as\npreviously described). In other words, both the submixes and the main mix are sent to the patchbay, and from there the\nmain mix can be sent to the monitors; and the submixes, on the patchbay as Mix Out 1-4, anywhere else, say the\ncomputer, or an external device.\n5. Give the inputs and submixes some volume using the faders (first set them to the gray region), but keep the the\nmain mix all the way down until you start playing your sound, after which you can cautiously increase its volume.\nWhen playing your sound from your device, you should see the light of input 1-2 blink if your sound is loud enough. The\nmain mix stereo lights also follow the volume of the sound. You can increase the sound volume with the faders of\ninput 1-2, submix 1-2, and main mix. If the sound is still quiet, especially if the main mix lights don't reach very high,\nyou can use the trim pot at the top of each track column to boost the signal.\n6. To use the headphones, have them plugged in the appropriate place in the mixer. Turn down the main mix on the\nmixer, otherwise the sound will come out of the monitors as well (although a nice effect, impossible to capture in a\nsingle recording, is to listen to music with both headphones and monitors). The headphones take their signal from\nsubmixes 1-2 and 3-4 (because that's how I have it set up): 1&3->L and 2&4->R, regardless of the L&R settings (for\nmain mix) for each submix.\nTO GET A SOUND INTO THE COMPUTER\n1. Keep the cables in the patchbay from above. This is so that the external device's signal is getting into the mixer, and\nis ready to be taken from it.\n\n2. Open Pro Tools. There is an icon on the dock (which can be seen when you move the cursor to the middle of the\nleft of the screen). You will get a blank screen after a few seconds, with Pro Tools menus across the top. As previously\nmentioned, if Pro Tools won't open with a warning that it can't find its soundcard, check that you don't have some other\napplication open that might use the soundcard. Even Firefox uses the soundcard, and if system preferences is set to\nthe 96, this will cause problems in such a situation. You can clearly see if the soundcard is in use because if it is, there\nwill be an ugly brown icon near the bottom of the dock, which shows that the Digi (96) Core Audio process is running.\nYou need to open a session, so type command-n (where 'command' means the apple key, not to be confused with\n'control'). This corresponds to menu File->New Session... (but use the keyboard shortcuts for health reasons!). Name\nthe session, and set the Save As (name the session) field to your own folder (361-2007-fall:[your name]) (and\npreferably some folder inside your own folder; it is best to keep your work organized by folders with the assignment\nnumber as its name). The session actually makes its own folder, with files and folders within it. If you cannot see a full\nFinder (like Explorer) window, click on the the triangle to the right of the Save As untitled filed. Set Audio File Type to\nAIFF (the standard for Macs), Sample Rate to 44.1kHz, and Bit Depth to 24. Don't worry about I/O Settings (it\nshould say Last Used). Click on Save. Pro Tools will chug away for a few seconds, with a progress window. Make\nsure you can see the Edit window (the one that has Shuffle/Spot etc. in the top left corner); either use the Window\nmenu, or command-=, to toggle between the Edit and Mix windows.\n3. You now need tracks. Use the menu Tracks>New... (shift-command-n). Select 2 Mono Audio tracks (in samples,\nbut ignore that). We always deal in mono tracks, even from stereo sources; Pro Tools will split stereo tracks. If you\nknow your source is mono, just create one track. Create. The names of the tracks (they will default 'Audio 1' and 'Audio\n2') should be highlighted (i.e., white background) in both the Edit and Mix windows (though all you really need is the Edit\nwindow). They can also be renamed by double-clicking on their names. It pays to name things descriptively. You will\nwant to Group them, so that you have the option of editing and mixing them in tandem. Type command-g, name the\ngroup as you please, keep the Edit and Mix option along with the default Group ID, and press OK (Return). You will\nnotice the group name in the Edit Groups sub-window on the lower left. If you cannot see what I am talking about, you\ncan bring the left pane into view using the << at the bottom left of the window. (Later, likewise for the Regions sub-\nwindow, using >>.) You can use the two tracks grouped together when the name of the group is highlighted (blue) on the\nGroups sub-window on the lower left of the screen. In the Edit window, tracks will be the same color when grouped,\nunless someone has changed the Preferences. You can click on the name of the group to toggle between grouped\nand ungrouped. Any combination of tracks can be grouped, even overlapping, and Pro Tools also provides a default\n<All> grouping. There is quite a lot of functionality to grouping, but we won't go over it here.\n4. You should now check that you can see certain things. There should be a column named 'inserts' and another 'i/\no'; the ruler-type rows should be Min:Secs, Samples, and a probably-blank Markers. The unit of time we deal in is\nMin:Secs. You determine this fundamental unit by making sure the green timer in the middle of the top part of the Edit\nwindow has Min:Secs selected, and the Sub set to Samples. If you do not see these rows and columns, look at the\nblack horizontal bar across the top of the track rulers. The first two icons let you select what you see in the rows and\ncolumns. We may as well check that certain preferences and options are set correctly. Go to the Pro Tools menu,\nselect Preferences..., go to the Operation tab, and make sure the first item, 'Timeline Insertion Follows Playback,' is\n\nchecked. Please do not change anything I don't ask you to check. Under the Display tab, on the right, make sure the\nDefault Track Color Coding and the Default Region Color Coding are set to 'Groups.' Click on Done. Under the Options\nmenu, make sure only 'Link Timeline and Edit Selection,' 'Link Track and Edit Selection,' and 'Automation Follows Edit'\nare checked. (The video ones will be grayed out.) Under Options>Scrolling> make sure 'Page' is selected.\n5. Make sure the input to track 1 (of your Pro Tools session) is set to A 1 and track 2 to A 2. These correspond to\n96 In 1-2 on the patchbay. Click on the track R(ecord) enable button for each track which you want to record onto.\nThey are now ready to receive data. The green level meter for record-enabled tracks will respond to source inputs.\nThis button can be found in both the Edit and Mix windows. If you are not receiving any signal here, check that the\nsound is making it to the mixer by following the signal path through the patchbay and through the mixer, make sure\nwhen you play your device you see lights on the mixer, make sure there is enough volume, make sure you can hear the\nsound (though hearing the sound is independent of whether or not Pro Tools receives the signal).\n6. Even though we will be listening to what is going into the computer, we may as well set the computer up as if we\nwere listening to what comes out of the tracks as we record. Notice that the outputs default to A 1-2 for both tracks 1\nand 2. Just as with the mixer, tracks are set up so that they can be treated as stereo pairs. You then have to slide the\ngreen pan control hard L&R to get true stereo separation. By clicking on the output box, you can see that you can keep\nthem in stereo pairs, thus pan the result pseudo-continuously between L&R--or, to be precise, A 1-2--or make them\nmono.\n7. Back to the real world of cables. We take the signal from submix 1-2 of the mixer to the 96 analog inputs 1-2. On\nthe patchbay take a cable from Mix Out 1-2 to 96 In 1-2.\n8. (As always) with the main mix fader down, start playing your sound. You can cautiously increase the monitor volume.\nYou should see the mixer input and main mix lights again. You should also see some lights on channels 1 and 2 of the\n96 (which you can't see in the studio, since it is in the server room), and in Pro Tools, the level meter lights beside\ntracks 1 and 2 (in either the Mix or Edit windows).\n9. Play your sound for volume levels: you want the Pro Tools level meter lights to reach near the top of their range, but\nyou don't want a single instance of the red light at the top of the VU (level meter) to switch on (because that would\nmean digital clipping, which is undesirable at this stage of our work--don't worry, will get noisy later, very noisy). You\nalready know where to alter volume levels on the mixer. Adjust your volume so that you get the healthiest signal\npossible without clipping. To do this you should listen to your entire sound before actually recording from your source\nto the computer. To remove the red clip light, just click on it; to remove multiple red clip lights, option-click on one of\nthem.\n10. Time to record. Get your device ready to play. On the Pro Tools transport (the floating window that looks like the\ncontrols of a CD player, or the one stuck at the top of the Edit window), click on record (the red button, just like on a\ntape recorder--or am I showing my age?). It should flash on and off, indicating pause. When you click on play, the\nrecording will begin. Once Pro Tools is recording, you can start playing your sound. You can monitor the sound\n\nusing the mixer's main mix, which doesn't affect the computer sound levels, since it is a separate signal path through\nthe patchbay. You should see on the Edit window a waveform growing (but with a latency of around one second). Press\nthe stop button on the transport of Pro Tools when the sound is finished. Stop your device from playing. NB.\nSometimes the play button has symbols on it, like a circle with arrows, or a letter. That means someone has been\nplaying with the settings; check the Options menu for things like Destructive Record, Loop Playback, Pre/Post-Roll;\nnone of these should be checked.\n11. After recording, you will notice bold-print items appearing in the Regions sub-window on the right. If the Regions sub-\nwindow is not there, click on the >> at the bottom of the Edit window. The bold print indicates that these are soundfiles\nthat have been saved on the hard drive, in the Audio Files folder for your Pro Tools session. (Later you will see non-bold\nitems; these are not soundfiles, but virtual regions pointing to regions within actual soundfiles. This distinction becomes\nvery important later.) The names will also appear in the box with the waveforms themselves in the Edit window. These\nregions (which are soundfiles) can be renamed by double-clicking either on the Regions list name or on the waveform in\nthe Edit window. It's a good idea to name these right away so that you remember what they are. Never change the\nname of anything in a Pro Tools folder, or move things about, directly through Finder (Explorer). All changes\nhave to be made in Pro Tools, otherwise we have a missing file/ linking disaster on our hands. When naming regions\n(either soundfiles or regions) in Pro Tools, if you give identical names to the left and right tracks of a stereo region, but\nwith '.L' as a suffix to the left track and '.R' for the right track, it will treat them as a stereo pair. You'll see what I mean.\nTO PLAY A SOUND FROM PRO TOOLS\n1. Click off the R(ecord) enable buttons beside your Pro Tools tracks. Press RTZ (return to zero, the |<- button) on\nthe transport. If you have several tracks, and you just want to hear tracks 1-2, click on the M(ute) buttons of the other\ntracks, or click on the S(olo) buttons of tracks 1-2 (which effectively mutes the other tracks).\n2. Make sure the Pro Tools track outputs are set to A 1-2, as previously mentioned, and that the panning is correct.\n3. Turn down all faders on the mixer.\n4. Cable from 96 Out 1-2 (bottom left of the patchbay) to Mix In 3-4 (since 1-2 are already being used). That is all it\ntakes to get the sound from the computer to the mixer.\n5. On the mixer, you need to send input 3-4 to submix 3-4 (or 1-2, it doesn't really matter, but we are already using\n1-2...) on the mixing board, and submix 3-4 to main mix L&R.\n6. With main mix down, click on the play button of the Pro Tools transport. Now increase the main mix volume.\n7. Avoiding feedback. If you took 96 Out 1-2 and patched them to Mix In 3-4, as described above, but assigned input\n3-4 to submix 1-2, you would experience some pretty nasty feedback. This is because you would be playing into the\ncomputer what was coming out of it. Avoid!\n\nTO EDIT YOUR SOUNDS\n1. In all likelihood, your Pro Tools recording includes stuff at each end that you don't want. At the top of the Edit\nwindow, click on the select button--it looks like a tiny waveform with a portion highlighted, to the left of the 'hand' grab\nbutton. Select Shuffle or Slip, depending on what you want. Shuffle abuts regions; Slip lets you put regions anywhere.\n(We will look at Grid and Spot later. Please don't use them for this assignment.)\n2. Make sure you have your two tracks grouped.\n3. Magnify your waveform by using the < ^ v > buttons a little to the left of the select button at the top left of the\nEdit window. (The ^ and v buttons must be the ones with a tiny waveform, not the ones with little dots--they refer to\nMIDI, which we are not using.)\n4. Select the portion of your waveform that you want to get rid of, and press the delete key on the computer\nkeyboard. You can also cut them by pressing command-x, which will temporarily retain the cuttings on the clipboard (as\nyou would expect). In this instance it's unlikely that you'll have any use for these, so deleting them is simpler. Do this to\neach end. If you cut incorrectly, press command-z to undo your last operation.\n5. Once you've trimmed your files, you will need to move the waveform to the left so that they start at the beginning of\nplayback, unless you selected Shuffle at the beginning. Select the grab button (the hand icon), and move the sound to\nthe left. In Shuffle mode this can be a little tricky, but you'll get used to it.\n6. Notice again that new, non-bold names have appeared in the Regions sub-window, corresponding to the edited tracks.\nThis indicates that these are not actual soundfiles but rather pointers to sections of the original, bold-printed files. The\noriginal files are not altered in editing, hence the term 'non-destructive editing.' Again, these can be renamed as desired.\n7. To break a region up, either place the cursor using the select tool or highlight a region also using the select tool,\nand type command-e. New names will be assigned to all regions involved in the transaction.\n8. Note that the assignment calls for gaps in between your sounds, but one continuous file. You will then have to\ninsert silence. This is easily done in Slip mode (top left of the Edit window), which allows you to slide (slip) things\naround freely. So cut your recording into its individual sounds, keeping just the long and favorite short sounds,\nas per the syllabus, having the short sounds first followed by your long sound. Then slide them around (I imagine\nworking from the rightmost sound would be best) leaving silences between them.\n9. Now you can skip to the section on Bouncing, or you can cheat and do it this way. (Learning to bounce is important,\nthough.) With the select tool, select all the regions in the tracks you would like to have as a single soundfile, by\nmaking them into a single region. Once there is a highlighted stretch, press shift-option-3, or use menu\nEdit>Consolidate, and this will, well, consolidate all that you highlighted into a single region, into a single (pair of)\n\nsoundfile(s), as you might note from the bold type in the Regions list. It will be given a name based on its track name,\nand therefore probably not as a stereo pair. You should then do this manually. If you only had a mono sound and sound\nfile to start with, you can stop reading this paragraph now. Otherwise you now have a Pro Tools pair of mono files listed\nin the Regions sub-window. You can convert this into a single stereo soundfile by pressing shift-apple-k (or by\nclicking on the Regions sub-window title bar, and selecting Export Regions as Files...). Ignore 'Enforce Avid\nCompatibility' (which should be grayed out), choose AIFF/Stereo/24/44100, Prompting for Each Duplicate. And you\nmight like the Destination Directory to be right in your session folder rather than in the Audio Files folder. Click on\nExport.... You will find your new soundfile wherever you chose it be exported.\nTO SAVE (\"BOUNCE\") YOUR NEW SOUNDS TO DISK AS A SINGLE FILE\n1. Decide which tracks and which portions of those tracks you wish to save as an audio file (e.g. as a CD track or file to\nplay in class). Bouncing will save whatever is routed to Analog Out A 1-2 (or whatever you select on the Bounce\ndialog window), from beginning to end. If you wish to only record part of the track (i.e., a set of sounds that appear, say,\nfrom 1:30 to 1:45), simply highlight that part of the track before going on to the next step. This will save you a lot of\ntime for this assignment. To see what the 'end' is, double-click on the magnifying glass tool, which shows you\neverything on one screen. Sometimes you might have left something many minutes past the end of what you think is\nthe end, way off the screen, and when you come to bounce, it will bounce all the way to the little leftover bit.\n2. Use menu File->Bounce to>Disk (or option-command-b). Set the parameters to Out 1-2 (Stereo)/AIFF/\nInterleaved Stereo/24/44.1kHz, ignoring the Avid part. Select the Convert during... option at the bottom of the\nwindow. Click on Bounce.... Now give your sound a name. It will be saved into the Audio Files folder of your session\nwhere the raw sounds from previous steps are located, unless you specify otherwise. I generally save bounced files at\nthe level outside of the Audio folder, in other words, in the same folder as the Pro Tools session files, just as I\ndescribed above.\n3. Now Bounce by clicking on Save. Your sound will play, and the bouncing is done in real time. There is no way\naround this (why, this will become apparent in the next couple of labs). When this is complete, you will have a stereo\naudio file with your sounds.\n(OPTIONAL) TO BURN AN AUDIO CD OF YOUR SOUNDS\n1. Save your session in your folder and Quit Pro Tools.\n2. Open iTunes, using the music note/CD icon on the dock (move the cursor to the hard left of the screen).\n3. There should be a folder in the left frame of iTunes highlighted in blue. If not, click on a folder (to activity the playlist\nlist frame). Type command-n to make a new playlist, name it something (it doesn't really matter what you name it,\nalthough iTunes will always call the CD by this name whenever you use it on the computer you burn it from--you should\ndelete the playlist after you have finished). Click on your new playlist. The right frame of iTunes should be blank.\n\n4. Open the session folder (from inside your own folder using Finder), and from there open the Audio Files folder if\nthat is where you left the bounced file. You should see lots of files named \"Audio_,\" or whatever you named your files.\nIgnore them. You should also see all the files you bounced. Drag them into the right frame of iTunes. You should\nnow see a playlist, like a CD track listing, with the names of your files, their durations, etc. You can then drag\nthem into whatever order you wish.\n5. Now to make the CD. Click on the Burn CD button on the bottom right of iTunes. The CD drive of the computer\nshould quietly open in the server room. (You can also open the CD drive using the ^ key on the top right of the computer\nkeyboard. Sometimes you have to hold the key down for a second.) Insert your blank CD. Close the CD drive by\npressing the ^ key again. DO NOT PUSH THE DRIVE'S SLIDING THINGY. Doing so will eventually wreck it.\n6. After iTunes recognizes what you have done, it will begin burning.\n7. Eject your CD in the appropriate manner and label it. Done!\n(OPTIONAL) TO BURN A DATA CD OF YOUR SOUNDFILES\n1. Insert a blank CD when the active application is Finder. Either the CD will appear on the desktop or in a finder\nwindow, or a dialog box will open. If the latter happens, select something like \"Open in Finder.\" Otherwise double-click\non the Untitled CD. You can name the CD if you like. Drag in the files, or their aliases, you want to have burned as data\n(AIFFs). When you have put what you want on the CD (it is just a disk image at this point, a strange Mac thing), either\ndrag the CD into where the trash normally is, or right-click and select Burn."
    },
    {
      "category": "Resource",
      "title": "lab1_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/da3435b35e368f7a6581b52bb048ed25_lab1_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 1.2: Pro Tools Editing (rough notes in no particular order)\nEdit Mode\nSlip: you can move regions freely.\nShuffle: regions abut--press hard against--to the left. You can insert a region between two adjoining regions. Before insertion\nwhen abutting, wait for a barely invisible line to appear at the point of abutting.\nSpot: when you grab a region, a dialog box asks you where you want to place the region on that track.\nGrid: regions snap to a grid. You can set the grain of the grid on the bar just above the timeline where it says 'grid.'\nMagnification (and option-click)\n1. Use the < ^ v > buttons. Take care to use the correct ^ v buttons; choose the one with a waveform, not dots.\n2. Command-[ and command-] do the same as the < and > buttons.\n3. The magnifying tool. There are two modes, normal and single use. In normal mode, when you click on it and perform a\nmagnification, it stays on the magnifying tool. In single use mode, when you have magnified, it returns to the tool you were\npreviously using.\n4. Using the magnifying tool: once it is set, clicking on a track will let you see half as much with twice as much detail. This of\ncourse applies to all tracks. Option-click brings the level of magnification back to the previous one (which in this case would\nbe twice as much with half the detail). Grabbing with the magnifying tool will make that selection the width of the screen\n(and option-click will take it back to the previous level).\n5. Double-clicking on the magnifying tool sets your entire session to the width of the screen. It is useful to do this before\nbouncing to see the extent of the entire session--this way you can see if you have left any material to the right of what you think\nis the end of your session.\n6. Size of tracks: the height of tracks can be set (in most cases) by selecting the > beside the waveform/pan/volume/etc.\nbutton. It is by default set to medium. In smaller views, this submenu is not so obvious but you'll find it. You can also access the\ntrack height from the ruler to the left of each track.\n7. Option-click on a ruler (as above) will change the height of all tracks. Option-click in Pro Tools almost always selects\nwhatever you are doing for all tracks, not just the one you clicked on.\nGroups\nDon't forget to group tracks, as described in last week's notes. Tracks can be grouped in any combination; one track can be in\nmany groups. The dots or circles etc. to the left of a group name in the groups sub-window indicate which track names are\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nhighlighted. Control-click in a grouped track will override the grouping and apply the operation only to the specific track.\nDeleting Tracks (and shift-click)\nHighlight the tracks you want to delete and select Delete from the Track menu. This is a non-reversible operation; region\ninformation is not destroyed, though. Use command-click to select multiple tracks, just as you would with a Mac or PC in\nselecting files. This command-click (sometimes shift-click) rule works for many things in Pro Tools.\nDisplays (recap from Lab 1.1)\n1. Above the tracks you want to see Min:Secs and Markers. To the left of the tracks you want to see Inserts and i/o (input/output).\nIf these are not the things showing, then go to the black bar above the tracks; to the very left, there are two menus that appear\nwhen you click on the icons. You'll find them with a little effort. These settings should not be altered from the defaults I have just\nmentioned.\n2. The counter's Main unit should be Min:Secs and the Sub should be samples. Make sure it is like this. If it isn't, you might not\nso easily be able to see what you want to see in the above point (display 1). It is easy to correct.\nOdd Behavior\nScrolling: make sure the Options>Scrolling menu item is set to \"page.\" Please don't change this\nPre-roll/post-roll: make sure this is unset otherwise playback will be a little strange\nPlease don't change any settings. If something odd happens, and it baffles you, email me, and if I don't reply promptly, call me\nIf there is a letter or a loop symbol on the play button on the transport, uncheck destructive recording or looped playback in\nthe options menu\nRenaming Regions, Files, and Tracks (recap from Lab 1.1)\n1. Either double-click on the region/file name in the Regions sub-window to the right, or on the region itself. Name things logically.\nIf a stereo pair for some reason is not listed as a stereo pair, give the two regions/files identical names, with .L and .R suffixes. If\nyou change the name of a bold region, i.e., a file, this way, the actual file name will change. The region/file will now be listed as a\nstereo pair, but it still consists of two mono regions/files. For this stereo pair approach to work, the regions must be perfectly\naligned and of the same length (as they would be if you operated on them together due to grouping).\n2. NEVER change the name or location of an audio file through Finder. Pro Tools will then not be able to find it, and then I'll have\nteach you how to re-link missing files.\n3. To change the name of a Track (and this is a sensible thing to do), double-click on the track name. Doing so gives you an easy\noption to rename each track in order.\nChanging the Order of Tracks, and Showing Tracks\n1. Drag the track name to the desired location to change the order of tracks.\n\n2. Above the Edit Groups sub-window is the (Show/Hide) Tracks sub-window. Make sure all tracks you are using are visible.\nEven if a track is not visible, it will still play if you haven't muted it.\n3. To disable a track, highlight the Track name to the left of the track, and select Make Inactive.\nSplitting and Joining Regions, and Turning a Region into a File (recap from Lab 1.1)\n1. To split a region, use command-e. Two new regions will be formed. You can then move these regions independently.\n2. To join regions (including space in between), select the extent of what you want to have turned into a single region and use\nEdit>Consolidate (shif-option-3). This will create a new file, not just a region. You will probably have to rename it; stereo pair\nnaming is not retained, since the consolidated regions are named after the track names.\n3. Recall the command-shift-k method from last week.\nTrim Tool\nThis is to the left of the select and grab tool, and together these three tools are the main ones you will use. The trim tool lets you\nalter the left and right edges of a region. It will not make a new region, just alter the region data, except in the case of a file, in\nwhich case it will create a new region. You can always recover the parts of a region you have trimmed; the residue is 'secretly'\nthere. In fact, the hidden parts of a region are useful for cross-fades, described below. In shuffle mode, trimming will move the\nregion appropriately. When hovering the trim tool above the left half of a region, a [ will appear. this means you will be operating on\nthe left edge of the region. Similarly, for ]. If you need to change the polarity of the trim, i.e., if you want to trim away more\nthan half of a region, press option. You will see the square bracket change direction.\nTriple Tool and Fades\n1. Under the trim-select-grab tools is a long button, clearly connecting those three tools. When it is selected, and this is a very\nuseful thing to do, you can access all three of those tools at once, and do fades.\n2. If the cursor is in the top half of a wave, it will show you the select tool, i.e., the cursor. In the lower half you will have\nthe hand, i.e., the grab tool. To the left and right you can access the trim tool.\n3. At the top left or right of a region you can create a fade in or out, without going to the fade dialog box (though you might\nwant to do it the slow way if you want to alter the shape of the fade and preview the result). For this you will see a tiny square with\na single diagonal line, indicating the direction of the fade. Select the amount of the region you want to be faded.\n4. At the bottom left or right of a region you can create a cross-fade. You will see a tiny square with an X in it, showing you\nthat it isn't just a fade in or out. To cross-fade there needs to be some of each of the adjoining regions hidden, available for\nthe fade. If there isn't anything hidden, you can create hidden portions of each region by trimming each region at the point that\nthey touch, in shuffle mode, so that the regions remain abutted.\n5. To create a fade (in, out, or cross) manually, select the desired portion of the region(s), and use Edit>Fades>Create, or\ntype Command-f. You will have to option of choosing the fade shape(s), and of previewing the result. This is especially useful for\n\ncross-fades. Next week we will look at removing clicks, and cross-fades is one of the easiest way of dealing with the problem (if it\nis a problem; sometimes clicks can be good).\n6. To delete a fade, even one created using the triple tool, use Edit>Fades>Delete once you have selected the fade.\nDuplicate Region\nCommand-d. Very useful.\nScrub Tool\nThis is for hearing the detail of sound at a particular point, at whatever speed, forwards or backwards. It is the speaker icon by the\npencil tool. When activated, just drag left or right over the sound. It is useful for finding clicks which we will deal with next\nweek. Another useful thing: shift-play will play at half speed, down an octave. Right-click drag will also scrub.\nCopying and Dragging Regions\n1. Dragging a region (or file) changes its location. The behavior of the drag will depend on whether you are using slip or\nshuffle mode.\n2. Covering another region shouldn't destroy what is underneath (but for some reason I don't yet understand, sometimes it does,\nso be careful). Playback will play what is on the top. If you want two regions to play simultaneously, use separate tracks. That's\nwhat they're for.\n3. Option-drag copies a region.\n4. Command-c (copy) followed by command-v (paste at new cursor location) does the same thing.\n5. Control-drag (including with option) constrains dragging to the vertical dimension, i.e., you can't move the region left or\nright.\nVolume and Pan, and the Pencil Tool\n1. You can change the volume and pan of a track (at this stage lacking automation data) in the green boxes to the left of a\ntrack. +12dB is the maximum volume increase (which is the same as x4 volume). Panning needn't be all the way left or right; well\nmixed CDs place various instruments at various stereo (and nowadays 3-D) locations.\n2. Volume and pan can be automated. Select volume or pan where it normally says waveform.\n3. Use the grab tool to place a point on the volume or pan automation line, by clicking. Drag it where you like. There is\nalways a point already there by default at the beginning, but not the end, of a track.\n4. Option-click with the grab tool on an automation point removes it.\n\n5. You can also use the pencil tool to freely draw a curve, or to use one of the preset types (triangles, random, etc.).\n6. If there are too many automation points, playback might get clicky. You can thin automation from Edit>Automation>Thin. It\ncan also be set in the preferences.\n7. The pencil tool can also be used to modify waveforms in waveform view when the resolution is down to the sample\nlevel. Not advisable at this stage, although sometimes clicks can be removed this way (next week).\n8. You can copy, delete, paste, duplicate. etc. all automation data; it will not alter the waveform. You can use the select tool\nto select a portion of automation data. You cannot use the grab tool to select a whole region, since the grab tool is reserved for\nadding or subtracting automation points. To select a whole region of automation data, either use the select tool, or go back\nto waveform view, grab a region, then switch back to volume or pan view.\n9. If however you copy, etc. a waveform in waveform view, all automation data will also be operated on.\n10. If you playback watching the Mix window (command-=), you will see the pan and volume faders moving. This shows that the\nsoundfiles are not altered; it is just a playback operation. You can see it on the Edit window too, though not so obviously.\n11. Next week we will learn how to record this sort of data: you can play a track, and with the correct buttons pressed, if you\nchange the volume or pan faders in the mix window, automation data will be written to the track, which you can then edit by hand.\nIncreasing the Volume of a Poorly Recorded Region\nIf a region is ridiculously quiet, possibly because it was recorded too quietly or because you didn't use the mixer to its full effect,\nyou can change the 'gain' of a region. Grab the region, and use the Audiosuite>Other>Gain menu item. Find the peak level\nusing one of the buttons at the bottom of the window. It will be some negative value. You can increase the gain by some\npositive value smaller than the absolute value of that peak value. E.g. if the peak level is -19.6dB, you can change the gain by\nany value up to 19.6db (minus a little bit just to be on the safe side). You can preview it, then it can be processed. A new\nsoundfile, not just a region, will be created, and will appear on the regions subwindow as the old name, with the word GAIN\ninserted. If you want the GAINed region to replace the region in the track (also called the playlist), make sure 'use in playlist' in the\ntop right of the gain window is selected. Otherwise the file will be created, but not be put into the track. This last point is true of all\nAudiosuite operations.\nImporting\nShift-command-i is used to import soundfiles into the regions sub-window or onto new tracks, whichever you eventually\nselect. From the Regions you can drag them onto tracks. A stereo region needs to be dragged onto a stereo track, or onto the top\nof two mono tracks. In the Import Audio window, select the soundfiles you want, make sure they are in the Regions in Current File\nlist at the bottom left, and Add or Convert them. Usually they will have to be converted (e.g. sampling rate, bit depth, number of\nchannels, file type are not consistent with the current session). Make sure they appear in the Regions to Import list. Then click on\nDone. It will ask you where to save the converted mono soundfiles; this will default to the Audio Files folder of your session, which\nis a good place for them. After the conversion, you will have to make a decision mentioned above. I generally just import them into\nthe Regions list, and create tracks separately, but that's up to you.\n\nS&M\nS is Solo and M is Mute, to the right of the Record and TrackInput Monitor buttons to the left of each track. If there are tracks with\nS highlighted (yellow), only those tracks will play; if there are tracks with M highlighted (orange), those tracks won't play. M\nsupersedes S. There is also something called rude Solo, by command-clicking on S, but please ignore this. If you find an S is\ngrayed out, command-click on it to get it back.\nCompositional Techniques Covered in Lab\nLayering, duplication, fades, volume and pan automation, faking echoes and reverb."
    },
    {
      "category": "Resource",
      "title": "lab1_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/52ead252d1555f87a7ae51ea7c2575fc_lab1_3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 1.3: More Pro Tools Editing and Other Stuff (rough notes in no particular order)\nFolder Hygiene\nPlease keep your folders logically named, and with a logical hierarchy. This isn't for my sake.\nRegion List Hygiene\n1. You can select all regions that are not being used by your session. Go to the Regions title bar of the regions sub-window, and\nselect Select. You can choose to select all unused regions, or just those that are not soundfiles. Shift-command-u does\nthis. You can selectively deselect regions using command-click.\n2. You can clear those selected regions by going to the Regions title bar in the regions sub-window, and selecting Clear\n(or shift-command-b). Remove will simply remove the regions from your list; nothing is destroyed, though you will no longer be\nable to access that region. Delete is an option in the case of soundfiles (bold regions). It destroys the soundfile, never to be\nrecovered. It doesn't even put it in the trash.\n3. If you delete a soundfile, all the corresponding regions are lost. This could mess up your session if you are not careful. A\nwarning is given if you select this option.\n4. If you have more than one session (e.g. you have Saved As different versions), and different sessions have different regions\nand soundfiles, destroying soundfiles in one session destroys them for all sessions, since they will have a shared Audio\nFiles folder. So be careful.\n5. (Recap) Never rename or delete soundfiles through Finder. Do all your cleaning and organizing through the Regions\nsubwindow.\nReverse\nFor this week's assignment, we are restricting ourselves to what we could do in an old-fashioned tape studio. One thing\nwe can do is reverse the tape, i.e., reverse a region. E.g., if there is a thud at the beginning of a region, tapering off, a reversed\nversion will have a gradual crescendo followed by a backwards thud. Don't forget that backward sounds often sound strange but\ndifferent--natural or artificial reverberation reversed does not sound like reverberation. It's rather like an echo preceding the sound\nitself. Work with reverse judiciously; it may sound novel but it gets tedious after a while.\nTo reverse a region, it is rather like changing the gain: it is an Audiosuite operation. Select the desired region(s) with the grab\ntool in waveform view, go to Audiosuite>Other>Reverse. You can preview it, or simply process it. Remember, as with Gain,\nselecting 'Use in playlist' will create a new region (actually a soundfile) and replace the region in the track with the new reversed\none. Deselecting it will create the new region, but not put it in the track. The new region (soundfile) should have a similar name,\nwith letters such as RVRS inserted.\nClick Removal\n1. A click is a mathematical discontinuity in your waveform (and even at the nth derivative). Sometimes there are desirable clicks,\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nsome clicks are just awful. You can spot them by a vertical line in a magnified view of your waveform; or strange angles. We are\ndealing here with the vertical line types. Discontinuities of the waveform itself are fairly easy to spot; those of derivatives are much\nharder. They are effectively moments of 'spectral splatter.'\n2. You can use the pencil tool when you are closely zoomed to draw out a click. Pro Tools has a very effective smoothing\noption when drawing.\n3. Between abutted regions (a result of shuffle mode) there can be a discontinuity click. In shuffle mode, trim the edge of the\nleft region by some amount, and then the edge of the right region; they should abut, but there is part of the waveform\nsecretly there to be used for a crossfade. Do this trimming in triple tool mode. Now crossfade using the triple tool by an\namount less than what you trimmed. If you exceed that amount, either you will go beyond the bounds of the region and the\ncrossfade won't be possible, or you will reintroduce material you had previously trimmed out, possibly including the click.\n4. For clicks within regions, delete the click and some material symmetrically around it. (You can measure this in seconds,\nor milliseconds.) Now create a crossfade, using the triple tool, with a size less than half of what you deleted. This insures\nthat you will not reintroduce the click into the fade. Sometimes this does not work; another click appears. Keep trying different\namounts to delete and different crossfade sizes until the click goes away. Sometimes too there is an artifact of this operation,\nincluding a high-pitched rattle. If you can hear it, redo the declicking.\n5. (Recap) The scrub tool can be useful for locating clicks. The scrub tool can also be used by right-click dragging the mouse with\nselect tool, thus saving you the bother of changing tools.\nWhat is Bounced\nYour pieces might include silences at the end. This can be caused by three things:-\n1. You selected your bouncing region beyond the end of your sounds.\n2. You didn't select anything (that's the way I bounce) but a muted or invisible track contained material beyond the end of the\nmaterial on the unmuted or solo-ed tracks.\n3. Pro Tools bounces to the end of its information. This isn't just waveform material; it is also volume and pan (etc.) data. So\ncheck those views. A quick way to see what will be bounced if you don't select anything is by double-clicking on the magnifying\ntool, which puts everything in your session into the viewable screen.\nBouncing Individual Regions\nMute the tracks you don't want to have included in the final soundfile, then highlight the region(s) you want to bounce.\nOverlaps\nAvoid overlaying regions on a single track. Use trim instead. The top layer is played.\n\nDon't forget about this for Assignment 1.3.\nChanging 'Tape Speed'\nWe can change how fast a region will be played, just as we can change the speed of an old-fashioned reel-to-reel tape recorder.\nChanging the speed changes both the pitch and the duration of the region. Twice as fast means half as long, one octave higher.\nKnowing your harmonic proportions (2:1 octave, 3:2 perfect 5th, 4:3 perfect 4th, etc.) can guide you. There is no 'change speed'\nfunction in Pro Tools, but there is time compression/expansion and pitch shift. Time compression/expansion in Pro Tools retains\nthe pitch, so isn't useful to us for this particular task. But Audiosuite>Pitch Shift>Pitch Shift has an option not to do a time\ncorrection. So we will use this. Always deselect Time Correction for this assignment, otherwise you are cheating. Just as\nwith out other Audiosuite operations, select the appropriate region, go to pitch shift, and process. You will notice the length of the\nresulting pitch-shifted region will be different. Therefore be careful with this operation for regions abutted to other regions.\nRecording Automation\n1. You can record changes to volume and pan (and eventually a lot of other things) that you make on the Mix window. Where there\nis a button that says 'Read' in green, select 'Write' which is in red. When you play your session, any changes you make to\nvolume and pan will be recorded. You can see this in volume or pan view, and you will correspondingly see the faders move in\nMix window.\n2. 'Write' automatically changes to 'Touch.' If you were to use 'Write' again, all information would be lost, even if you were just\ntrying to make a tiny alteration.\n3. 'Touch' will apply any changes you make, and move the slider back to where it was from the previous writing or from how you\nhad drawn it (or had done nothing at all). There is a slight slew (gradual change or interpolation) to this, I think around half a\nsecond.\n4. 'Latch' will do the same as 'Touch,' except the sliders are not moved back to where they were; for the duration of the play\nLatching, the sliders will remain where you left them.\n5. 'Trim' performs relative changes. Look it up in the reference manual.\nMaster Fader\nThere is a special type of track called Master Fader. It sure is a funny name. Anyway, it effectively collects the signal from\nanything that goes to the output channels it is assigned. For example, if you have an A 1-2 Master Fader, every track that goes to\nA 1-2 will pass through the Master Fader first. In this way you can control the overall volume, and (see below) check the peak\nlevel reading. You will later be able to put global effects on outputs.\nPeak Level\nCommand-click on the green volume display to the left of a track, and instead of 'vol' you will see 'pk': this is the peak level, also\nin dB, of the track. It continuously updates. If it reaches 0, then you have probably clipped somewhere. If it is -infinity, there is no\nPan\n\nsound. To clear it, in other words, to get it back to -infinity, simply click on it. There are actually three displays in this green box:\nvolume, peak level, and sample delay for effects (which we won't need to cover this semester in all likelihood). To cycle through\nthem, again, use command-click."
    },
    {
      "category": "Resource",
      "title": "lab2_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/b30fbe95e0042315033b5d94c9d39fc6_lab2_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 2.1: Speaker-Mic Feedback; Outboard Processing (Filters, Delay, EQ, Aural Exciter)\nSpeaker-Mic Feedback and Mults:\n1. Always hold onto the mic.\n2. Start with it away from the speaker, with Main Mix volume set to zero. When we have done things with Pro Tools in the past,\nwe know that the Main Mix does not alter what is actually happening in Pro Tools, rather, just what we hear. Since we are making\na feedback loop, the Main Mix is our main volume and feedback control, thus also affects what is happening in Pro Tools.\n3. The two speaker drivers (cones) in each monitor (speaker) produce different feedback sounds; the top one is more varied, but\nless enjoyable to listen to unprocessed.\n4. The region between feedback and no-feedback can produce interesting sounds. The region between the two drivers is also\nuseful.\n5. Play this feedback 'instrument' largely by microphone manipulation, careful control of the Main Mix, and attention to the\nmicrophone pre-amp (the Pre-Sonus outboard device on the rack--this is a vacuum tube device, and is particular 'warm,' better\nthan the built in mic-pres on the mixer). The patchbay connections to the mic-pres (for now) are irregular: Mic Pre 2 (out) is the\nrightmost B socket on the lower patchbay; and Mic Pre 1 (out) is above it but its label has fallen off.\n6. You can use two mics and/or two monitors if you like. But you might not have enough hands to control levels (unless you are an\noctopus or squid).\n7. Moving the microphone a whole lot can be effective. There are 'sweet spots' around the room where (I think this is what\nhappens) there is constructive interference from wall reflections--anti-nodes of standing waves. Experiment with finding them.\nDifferent sounds and pitches can be obtained, especially very deep ones.\n8. You can create little trigger sounds, snapping fingers, tapping, whatever. Cardboard tubes are fun (for this lab).\n9. The SND filterbank will provide a useful means of finding different pitches. Have it at the beginning of the outboard signal path.\n10. You can split a signal using the \"mults\" on the patchbay, on the upper one to the left. Each mult--there are two--has four\nsockets. Any of them can act as an input, and all others in the same mult will be outputs, splitting the signal. Don't have more\nthan one input; a mult isn't a mixer. A mixer is. So you can split the signal to go in parallel to the two SND filterbanks, or in series.\n11. A nice trick is to have the signal follow the path SND1 -> Delay -> SND2.\nOutboard Devices:\n1. SND fixed frequency filterbank:\nYou cannot set Q (quality or resonance, in more simple terms, relative bandwidth) or frequency, just +/- gain, like on a simple\ngraphic equalizer, like on iTunes, etc. The left and right pots are input and output gain, and they both should be near full. If the\nSND doesn't seem to work, check that its blue light is on. If it is off, then someone has knocked the 'bypass' button to the right of\nthe device. Just press it to make it work again. There is no on/off switch. Play with this toy a lot. It will give you different pitches,\nand portamenti. And hisses, rumbles, and a lot more.\n2. MXR Delay:\nFirst check to see if the red clock is working. If not, switch the device on. The main pot is the larger one in the middle surrounded\nby blue. It sets the coarse delay time. To the left is the fine tuning for delay time. Speed and width refer to the sinusoidal\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nfluctuation you can have around the delay time. Mix sets how much of the dry (input) signal you have--fully counterclockwise, it is\nall dry (thus defeating the purpose of using the delay). Fully clockwise is all wet. It is sometimes useful to change this pot. Regen\nis internal feedback within the delay unit. Use! It causes there to be more than one echo. The level pot functions in reverse. One\nof the knobs is missing. Please treat this instrument with care; it is old, and it is mine. (So is everything else on the rack, and the\nrack frame itself, so please take extra special care!)\n3. Aphex EQ:\nThis is also mine, so treat with extra care. You can set frequency, bandwidth, and +/-gain. Narrowing the bandwidth and\naccidentally getting a sweet frequency can actually be quite bad for your ears and the speakers. In the middle of the EQ are two\nbuttons; the left one should be pressed in, which means you have access to all 4 bands for your mono input. Alternatively, you\ncan use this device as a stereo EQ, each channel having two bands. In the past, this device has been as useful as the previous\ntwo for this assignment. It has a particularly 'warm' sound, emulating a vacuum tube device.\n4. Mic-pre:\nOne for each microphone. Both pots should be set to halfway to start with; the further clockwise the 'drive' pot is clockwise, the\nricher harmonically your sound will be (or more overdriven--distorted, like old guitar amps).\n5. Mixing board EQs:\nThey are just above the volume faders. Use only if you want to rule the universe: we already have tons of EQing going on.\n6. Aural Exciter Type C:\nLately I haven't been able to get this working, though when it is working, it is hard to tune, so sometimes it appears not to be\nworking when it actually is. The inputs and outputs are labeled 'excite.' There are two channels to this toy, three pots per channel.\nTune sets a fundamental frequency, drive determines how harmonically rich and 'excited' the signal will become, and mix is similar\nto mix on the delay, determining dry/wet mix. I think the in/out button just controls the LEDs (but I could be wrong). Perhaps they\nare bypass buttons, I forget. What does this thing do? It generally improves your life. It puts back in your sound the harmonics it\nwas supposed to have to begin with. Anyway that's what the blurb says. It makes sounds harmonically richer in some way. It was\nintended to be used for enriching dull vocals. It is hard to use, and you might not hear any effect from it.\nCables\nHow to patch all these things together? I was kind of hoping you might be able to figure out how to use the patchbay by means of\nlogic rather than mechanical reproduction. But here goes. My suggested signal path for one mic is: mic -> Mic Pre 1-.> SND 1\nIn...SND 1 Out -> Delay In...Delay Out -> EQ 1 in...EQ 1 Ou -t> [aural exciter if it works] -> Mix In whatever, and SND 2 wherever\nyou like. The mic-speaker feedback is simply mic>pic pre 1>mix in 1 (e.g.)...submix 1...L...main out>studio out. That is all in\nseries. you can use parallel too, using the mults, but I do recommend this serial approach, at least to start with. (For you who don't\nknow, serial means things following one another, and parallel means things happening at the same time.) Be careful with mults:\nthey take only one in (from an out), and up to three outs (to ins). Pretending they are mixers means you are connecting two outs\nfrom other devices, potentially damaging them. This is mentioned under Speaker-Mic Feedback and Mults, above. You can use\ntwo mics, but we are not octopi, at least not all of us, so it is possible to hold two mics in one hand, for the same speaker, and\nyou can then have one going somewhere, and the other somewhere else, in other words, in parallel. Record everything you do:\ntake the signal from submix 1 (->Mix Out 1 -> 96 In 1, or something like that, etc.)"
    },
    {
      "category": "Resource",
      "title": "lab2_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/7aa42aac75a7f8db12b6659b5573b7da_lab2_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 2.2: Pro Tools Busses, Internal Feedback Loops, Delay and Reverb Inserts, a Ton of Pro Tools Tricks\nBusses:\nA bus (I'm unsure of the plural's spelling) is a virtual cable, in this case within Pro Tools. It allows you to send a signal\nfrom one Pro Tools track to another, without the need to exit and re-enter the computer. It thus bypasses a DA then AD\nconversion. When you bus to a track, you have to record to that track; thus you can record any effects you apply real-\ntime. To select a bus, choose bus rather than interface under input or output for a particular track. Keep track of which\nbusses are going to and coming from. There are a lot of busses available. In this assignment we will need two mono\nbusses.\nAlternatively, you can make an 'Auxiliary Input' track, but the results are not recorded; the sound is simply passed\nthrough. The latter won't be so useful for this module, but will be covered anyway.\nInserts:\nThese are real-time plug-ins. They can be found to the left of the tracks. If the Inserts column isn't visible, add it the usual\nway. You have five inserts per track available, in series. When using them, take care to match mono and stereo correctly:\nsome inserts, labeled as mono/stereo like most reverbs, convert a mono track to a mono/stereo track, meaning it is a\ntrack of mono regions, but the output is stereo; there are two pans and two level meters.\nAudiosuite effects are processed out of real time, whereas inserts operate on the fly.\nThe effects of inserts can only be saved by bouncing, or by bussing and recording. That is how we do it in the present\nassignment. There are two sorts of inserts: TDM and RTAS. We prefer to use TDM, because they are done using\nhardware. To insert an insert in a track, click on the top triangle available in the Inserts column.\nTo apply an effect, say, to control the overall volume of a group/collection of tracks, bus them to an Auxiliary Input, which\ncan be created in the usual way when you create a track--just choose Auxiliary Input rather than Audio, etc. Take care\nwith Auxiliary Inputs with stereo and mono assignment. Aux Inputs can take only TDM or a special type of RTAS called\nHRTAS, but not RTAS. Only some RTAS plug-ins have an HRTAS version. The order of TDM and RTAS plug-ins is\nimportant, and so is the order of mono and stereo. There is a limited number of inserts available: TDM plug-ins have\nlimits to types, and processing power, and RTAS plug-ins can be CPU-intensive. For TDM plug-ins that exceed the limit,\nthey will be made 'inactive,' which grays them out. (You can manually do this too, if you have to choose which you want\nto keep; making them inactive doesn't destroy their settings or automation data.) For RTAS plug-ins, you will just get\nbuffer underflow or CPU overload errors.\nTo see more than one insert window at a time, hold shift while clicking on the second insert. For this assignment, you are\nonly allowed to use the inserts described below, and no Audiosuite effects.\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nTo bypass an insert, either use the insert window, or command click on its name on the inserts column.\nPro Tools Internal Feedback Loop:\nTrack 1: your mono file to be operated on. input=whatever, output=bus 1, no record.\nTrack 2: input=bus 1, output=A 1-2, record.\nTrack 3: input=bus 1, output=bus 2, record. Included Delay and Reverb inserts. Control volume from here.\nTrack 4: input=bus 2, output=bus 1, record.\nDelay:\nInput and Mix are obvious. We are mainly concerned with Decay (time), and Feedback, which is like Regen on the MXR\nDelay. Rate and Depth correspond to Speed and Width on the MXR Delay. Play with the other parameters if you like, but\nthey are less important. Use only short, medium, or long delays for this assignment.\nReverb:\nUse mono, because mono/stereo would require a ton of extra tracks and thinking, though in general mono/stereo reverb\nis preferable, since it gives a feeling of space. You can add a mono/stereo reverb afterwards if you like, but don't overdo\nit. Sometimes no reverb is better than some. Gain and Mix are obvious. Algorithm and Size, just play around with these.\nDiffusion can be interesting to play with. The main controls here are Decay (time) and Gain. The higher you have the\nDecay time, the more likely it is that the sound will blow up, and you will have to control the volume with Gain, or the\nvolume control on track 3.\nA Ton of Pro Tools Tricks (More to Follow Next Week):\n1. Escape cycles between tools (trim, select, etc.).\n2. F1-F4 select edit mode (Shuffle, etc.).\n3. Option-click on volume or pan sets it to 0, and doesn't do it to all tracks.\n4. Command-click on S(olo) is called 'rude solo': it means that unless you mute that track, the track is always solo-ed\nwhen other tracks are solo-ed. When there are no solo-ed tracks, rude solo doesn't steal the solo. It is useful, e.g., to\nrude solo and Aux Input track so that when you solo one of the tracks bussed to it (or all of them in a group), you don't\nhave to remember to solo the Aux Input as well. (Of course you could include the Aux Input in the group.) You could also\nhave, say, the drum track (yikes! beatz!) rude solo-ed, and messing around with solo or mute for other tracks won't affect\nthe drums, which you might want to have playing all the time.\n5. You can select track names using shift, option, and command as you would anything else on a Mac (or PC) and Pro\nTools.\n6. You can add a comments column.\n7. You can alter membership of a group after it has been created, by double-clicking on the identifying letter in the Edit\nGroups sub-window.\n8. Making tracks inactive is useful; sometimes when you hide a track (from the Tracks sub-window) you might not mute it;\nor you might unmute everything at once using option, and that will include hidden tracks, but that might not be apparent\n\nto you.\n9. Clicking on the Tracks sub-window menu brings up a number of display options.\n10. When editing automation data in triple ('smart') tool mode, pressing command gives you the finger tool, and control\ngives you the pencil tool.\n11. When editing automation data, the trim tool is horizontal rather than vertical in appearance, and relatively changes\nall selected (or all) automation data. When the data hits the top or bottom, and the data is changed by unclicking, the\ndata's relative shape is semi-permanently altered. (You can Undo it.)\n12. You can copy inserts by option-dragging them. Just dragging them moves their place in the chain within a track (be\ncareful with mono/stereo), or moves them to another track.\n13. Control-click on play doesn't start playing; it toggles between looped playback (also available under the Options\nmenu), which can be useful for tuning an insert, among other things.\n14. If the play cursor is not on the current screen, regardless of whether you are playing--there are differences between\ntimeline point, edit points, and playback points, which will be clarified next week--you can see a blue triangle to the left\nor the right of the timeline (above the tracks) to show you in what direction the play cursor is at. Clicking on it will bring\nyou to the screen with the play cursor in the middle.\n15. To see session data, e.g. sampling rate, file type, bit depth, type command-(keypad)3 or click Setup>Session.\n16. You can take a snapshot of the arrangement of regions on a track, i.e., a 'playlist,' and have several playlists--\nversions--for a single track. This is a way of storing an arrangement of regions on a track, experimenting, and being\nable to revert to an earlier, or other preferred, version. Of course, a series of Undos can do this, but that's the sloppy\napproach because you lose the less preferred versions. See the Pro Tools Reference Guide.pdf for this, under Editing\nBasics (found under the Help menu). Speaking of this, Window>Undo History gives you what it says.\n17. You can temporarily suspend Grid mode to Slip mode while dragging a region by pressing command.\n18. The 1-5 under the zoom arrows are zoom presets.\n19. You can time compress/expand an audio region by changing the Trim tool to TCE; you can then 'trim,' i.e., compress\nor expand, an audio (or MIDI, for that matter) region to fit another. This is identical to the Audiosuite operation, but you\ncan do it visually.\n20. Normally grabbing more than one region grabs everything (horizontally and vertically) in between. This is useful\nsometimes, but annoying other times. By changing the Grab tool to the 'object' option you can shift-grab non-adjacent\nregions for moving or editing.\n21. Tabbing to transients: when the arrow-to-waveform icon is selected selected on the black bar, place the cursor on a\ntrack, and pressing tab will take the cursor to the next transient. In this case, transient means a click or a percussive\nattack--you can find beats this way.\n22. Repeat is like duplicate, but you can specify how many duplicates of the regions will be made. Option-r or\nEdit>Repeat.\n23. Track>Split Into Mono will split a stereo track into two mono tracks. Useful for applying effects to individual channels\n(without it you would have to bus them to mono Aux Inputs, unless the plug-in had dual parameters)."
    },
    {
      "category": "Resource",
      "title": "lab3_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/8ee1a8079cda2a8f24d79cd429d097db_lab3_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 3.1: Peak Opening, Saving, Importing; Basic Editing; Regions; DSP; Convolution\nPeak Basics:\n1. Peak is a stereo audio editor, and in general a far simpler program than Pro Tools. I personally use it only for\nconvolution, and these days, less so, since there is a free/shareware way of doing it on a Mac (using Audacity and\nSoundhack). Convolution is what we'll eventually be focusing on in this module. Peak is not a mixer, but you can\nhave numerous soundfiles open at a time. The clipboard is shared among the files, but undos (command-z) are\nspecific to each soundfile. You can rotate between soundfiles using command-` (just like on a Mac or PC).\n2. Make sure no other audio app is open when you start Peak. Check the Digidesign soundcard is being used by\nPeak by going Audio>Sound Out>CoreAudio..., and click on Hardware Settings.... Make sure both input and output\ndevices are set to Digidesign HW. If this is not an option, then some other app must have grabbed the soundcard. So\nquit that app (or the Digidesign Core Manager), and start Peak again.\n3. To open a document, use command-o, File>Open, or the leftmost icon on the toolbar. (If you can't see the toolbar,\nselect it under the Windows menu.) The file menu has a list of the most recently used documents.\n4. Peak is a destructive editor, meaning that saving a document writes over the previous. In Pro Tools, saving saves\na session, and doesn't mess with the files, but in Peak it does. So, when you open a document, immediately Save As\n(shift-command-s, or File>Save As).\n5. Just like in Pro Tools, where you should label files and regions descriptively, do the same in Peak, or keep a\nwritten list of what your soundfiles are, how you arrived at them, etc.\n6. There are two views in Peak: the upper one is a view of the whole soundfile. You cannot select regions in this, but\nplacing the cursor in it will start playing from there, and move the view frame--the white frame in the upper view--to\nthe appropriate place. The lower view is the detail of what is in the view frame and it is here you do your editing. In\nthe lower view, placing the cursor above the middle of the left channel will add a tiny 'L', and only the left channel will\nbe selected when selecting. Idem, right channel. This is a fairly useless feature as far as I can tell.\n7. There is a volume control, barely noticeable, on the transport. (If you can't see the transport, select it under the\nWindows menu.)\n8. You can select just like in Pro Tools; shift-click will extend the boundaries. Command-a selects all. Sometimes you\nmight think you've just placed the cursor somewhere, but in fact you have selected a tiny region. You will know this\nbecause playback will be just a blip. You can scroll in the usual way, or using control-left or right.\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\n9. Use the transport controls on the toolbar or on the transport window to play etc., or use the space bar to play and\npause, and return to return to zero. If nothing is selected, playback will begin at the cursor, and play until the end of\nthe file; if a region is selected, only that region will play, and the region will remain intact after playback (unlike in Pro\nTools). Playback with resume at the beginning of the selection next time you hit play.\n10. You can create a named region using shift-command-r (or clicking on the appropriate icon, to the left of the stop\nbutton on the toolbar (not the transport). This region information is saved with the soundfile. Similarly, you can place\nmarkers using the icon to the left of the region, or by typing command-m. In both cases, you can move them either by\nhand or by double-clicking on their triangle. Peak tries to guess what you want a region or marker to be called.\n11. You can create a new document from selected material (which may or may not be a named region) using control-\nn (NB. not command-n) or File>New>Document from Selection. It will be untitled, so save it. If you create a new\ndocument from an entire region, the region markers will be copied to the new document, and a plain marker will be\nleft in the original document, with the region's name.\n12. Windows>Contents will bring up a little window with all open documents listed. Clicking on their triangles will list\ntheir regions; double-clicking on one will highlight that region.\n13. You can change the horizontal scale with the circled + and - buttons on the tool bar, or by using control-[ or ], just\nas in Pro Tools. Control-up or down alters the vertical scale; when it is normal, you should see 100-0-100 to the left\nof the waveform.\n14. There are a number of other ways of navigating using the keyboard, most of which can be found under the Action\nmenu. Fit selection to screen, use shift-command-]. Zoom all the way out use shift-command-[. Zoom at sample level\nuse shift-left and zoom to sample level (end) shift-right.\n15. The usual cut, copy, delete (like cut, but doesn't write over the clipboard), and paste (which inserts, not writes\nover, unless you have selected a region) operations work.\n16. Under the Action menu is Go To. Typing the left arrow takes the cursor to the start of the selection, idem for the\nright. Command-g allows you to set a time-point for the cursor. You can also take the cursor to any named locations,\nsuch as region and loop endpoints, and markers. Speaking of which, you can convert a region or selection into a\nloop (for looped playback) using shift-command-- (minus). Look up nudging.\n17. Under the File menu is Import Dual Mono. This would be used to import .L and .R pairs generated by Pro Tools. If\nyou Save a Dual Mono file, it will just write over those two mono files; you have to use Save As to save it as a stereo\nfile. When importing, select the left soundfile, and it will find the right one automatically. (If necessary, you can\nuncheck Auto Import from Dual Mono under the Options menu, but if you do, please return it to checked.)\n18. Peak will import mp3s; just Open them as you would a normal soundfile. Peak can also read straight from audio\nCDs. It does not write mp3s, but can write CDs from Playlists, which we haven't covered here.\n\nDSP (Digital Signal Processing) Basics:\n1. Any DSP operation is done to the selected region; if no region is selected, the operation is done to the entire\nsoundfile.\n2. Change Pitch... is obvious; don't forget that Preserving Duration will have the advantage of not altering the length\nof the region, but the sound quality will be fairly poor if the interval is wide.\n3. Change Gain...: check with clipguard before increasing gain. +6dB means x2 amplitude (in crude terms); it is a\nlogarithmic scale.\n4. Mix...: Copy a region to the clipboard, place the cursor at the point of the (same or a different) soundfile where you\nwant the contents of the clipboard to be mixed, and select DSP>Mix.... The percentage is not clearly explained in the\nlittle window; 50% means the mix will be 1/2 (clipboard)-1/2 (selection), and 33% means the mix will be 1/3\n(clipboard)-2/3 (selection). Selecting 100% is the same as pasting without inserting, i.e., writing over.\nConvolution:\nI explained what this is in lab. To carry it out in Peak, copy the impulse region to the clipboard, and select the region\n(or all/none) of the (same or different) soundfile you want to convolve with it. There is no dialog window for\nconvolution. It is an expensive operation, so convolving a minute-long sample with a 20-minute one might take a\nlong time, or cause the computer to run out of memory, or even freeze or crash Peak. Typically, for our misusing\npurposes, we would save up to 10s to the clipboard to convolve with a soundfile of any length.\nConvolution basically imparts the frequency characteristics, amplitude envelope, and reverberant properties of a\nshort 'impulse' region onto a longer region. Or, the frequencies (or bands of frequencies) of two sounds, over time,\nare reinforced if they are shared, and diminished if they are not so shared. It's a little like old-fashioned vocoding, the\ntechnique used to make robot sounds in 60s and 70s movies. If I have, say, the opening E-flat major chord of\nBeethoven's Eroica symphony, and convolve it with me speaking, it will sound as if I am speaking Eroica chords.\nThere are enough frequencies in common (and noise) for it to be a successful convolution. (Voice can be thought of\nas shaped noise.)\nVocoding would take, say, the generic robot sound, or the Eroica chord, and pass it through a bank of, say, twelve\nbandpass filters. The energy of the resulting filtered signal would then be used to drive the bandpass/reject filtered\nfrequency bands of, say, my voice. So the frequencies in my voice that the generic sound also had would come\nthrough, and those not in common wouldn't. Convolution effectively uses 4096, or some other large number, of\nequally-spaced frequency bands to do more or less the same thing, not just twelve crudely shaped filters\nMore technically, convolution can be understood both in the time domain--what we are more familiar with, the\namplitude (energy) of a signal over time, in other words, the waveform--and in the frequency domain--the Fourier\ntransform of the time domain representation. The Fourier transform is the spectral content of the sound, the energy of\neach frequency (band), at every (pre-determined and equal) slice of time. We are working with sampled information,\n\nso our data is discrete.\nI've included below excerpts from an excellent book by Garreth Loy, named Musimathics (what an annoying title),\nvol. 2. It explains how, in the time domain, convolution--which is a familiar mathematical operation--builds an array\nof the two sample sets multiplied and added. Effectively, the short (impulse) sample is replicated at every sample\npoint of the long sample, scaled by the amplitude of long sample's sample (the word 'sample' is getting confusing\nnow), and placed at that sample's position. See the simple diagram below, taken from the Csound Book. It shows\nhow delay, echo, and even reverb, can be described using convolution. (In general, reverb is achieved using allpass\nfilters--filters that pass all frequencies through, but with different phases, which effectively reinforces patterns of\nfrequencies through constructive and destructive interference--but that's a different story.) The Musimathics excerpt\nshow how the discrete convolution formula--a kind of 0,5-1,4-2,3-3,2-4,1-5,0 type of scheme--which does not\nsuggest at first sight the kind of array I described, connects with the replication of the short sample scaled at every\nsample point of the long sample. Convolution is commutative, but we always treat the small sample as the impulse,\nthe one that scales and displaces copies of the long soundfile.\nConvolution used as reverb involves recording a delta (a click, a single amplitute=1 at time=0, and 0 everywhere\nelse) in a space, say a concert hall. Though this might not seem intuitive, a delta is actually an instance of white\nnoise, thus containing all frequencies at equal energy. So the frequencies recorded would be those resulting from\nreflections (echoes) in the space, and the resulting sound is the impulse for a reverb. Reverberation impulses are\nfairly complex, and would be near impossible to create them in the time domain. They can be created algorithmically,\nthough. Convolve such an impulse with my voice recorded in a clean (almost anechoic space) and it will sound as if I\nam talking in that reverberant space.\n\nCourtesy of MIT Press. Used with permission.\nSource: The Csound Book: Perspectives in Software Synthesis, Sound Design, Signal Processing, and Programming.\nEdited by Richard Boulanger. Cambridge, MA: MIT Press, 2002. ISBN: 9780262522618.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856.\n\nCourtesy of MIT Press. Used with permission.\nLoy, Gareth. Musimathics. Vol. 2. Cambridge, MA: MIT Press, 2007. ISBN: 9780262122856."
    },
    {
      "category": "Resource",
      "title": "lab3_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/608ac8050d3595134e7e10ed6e8ee830_lab3_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 3.2: Recording Using Peak; Peak Plug-Ins: SuperFreq-10, SoundSoap; Noise Reduction, etc.\nPeak Recording:\n1. As usual, check the Sound Out under the Audio Menu.\n2. Check the Audio>Record Settings. (i) The Record Disk must have some disk name. If mta-studio1-hd isn't listed, click on the drop-\ndown menu and see if it is not grayed-out. If it is, then there are permissions problems and you should contact me so I can fix them.\nOtherwise make sure the disk is checked and is 'primary.' (ii) File Format should be set to AIFF. (iii) The other checkable fields are\nself-explanatory, though I would have Use Record Timer... checked, and Open after Saving checked. (iii) Clicking on Device and\nSample Format will give you the chance to make sure 96 in 1&2 are being used, and set the sample rate, bit depth, and stereo/\nmono.\n3. To record, go to Audio>Record.... First check that a signal is getting into Peak by looking at its level meter in the transport window.\nRecording begins when you click on the circle (record) button in this window. Once you do that, a waveform will start scrolling\njaggedly at the top of the window, usually with a latency of around 1s. Make sure you see some activity. Recording stops when you\npress the square (stop) button in this window. You will be asked to save the new Audio Recording, and if you checked the right box\nunder Record Settings, the newly recorded and saved soundfile will open in Peak.\n4. Two other things I can't think of where to put: (i) Under DSP you can split stereo files, or convert a single mono file into a stereo\nfile with a fixed but settable panning. (ii) If when you try to copy to the clipboard Peak has a fit at you about not having enough disk\nspace, there are either permissions problems which I will have to fix, or the Scratch Disk has been changed. Go to\nPeak>Preferences... and correct it.\nPeak Plug-Ins:\n1. Plug-ins can be found under their own menu. You can use five plug-ins, and they are serial just as in Pro Tools. The BIAS (the\nmanufacturer of Peak) plug-ins are most useful for now. Once you have selected a plug-in, a check mark will be placed beside it in\nthe sub-menu. Even if you click off the plug-in window, it will still be active. You have to select 'none' in the appropriate sub-menu to\ndisable it. You can see which plug-ins you have active under the Windows menu, just above the open soundfiles list.\n2. You play your sound and change the plug-in settings to your satisfaction. But you can't (yet) record dynamic changes to your\nsoundfile using the plug-in. All you can do is bounce them, found under the plug-ins menu. This will alter the file (in memory), so\nremember to Save As... with a different name. After it has bounced, Peak will ask you if you want to disable the plug-ins. You should,\notherwise it will apply (but not bounce unless you tell it to) the same plug-ins to the sounds you have just applied the plug-ins to.\n3. If you are daring, look up V-Box. It is under the plug-ins menu, and there is documentation on how to use it. Basically it is a way of\nusing multiple plug-ins in series and parallel, according to a flow diagram you create yourself. We might cover it one day if we have\ntime.\nSuperFreq-10:\n1. This is a stupidly-named filterbank consisting of 10 filters. There are other SuperFreqs, 4, 6, and 8, referring to the number of\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nindividual filters.\n2. You can change the visual order of the individual filters, but the control order (all the knobs) remains the same.\n3. Each filter can be bypassed by clicking at the bottom of the appropriate column. The entire plug-in can be bypassed by clicking in\nthe Bypass button at the bottom of the window.\n4. You can set each filter type to peak (bandpass or band-reject/notch), highpass, highshelf, lowpass, or lowshelf. The most useful\none is the peak filter. It functions rather like the SND filterbank, or the parametric EQ on the rack. High or low filters of either type are\nmore appropriate at the ends. A shelf filter boosts high or low, leaving everything at 0dB change, i.e., no change. A high or lowpass\nfilter keeps their end of the spectrum at 0dB and reduces everything else.\n5. You can change frequency and dB of each filter visually/using the mouse. Q (quality, resonance, or slope) must be changed\nusing the knob. Q basically says how wide a filter will be, how focused it will be on the frequency you select. Low Q is wide, high Q\nis narrow. More technically, Q is the ratio of center frequency to bandwidth, which is defined at the difference in frequencies which\ncorrespond to a 3dB reduction in amplitude.\n6. Changing one filter appears to change other filters; the dots don't move but the curve does. The curve is the aggregate frequency\nresponse of the filter; areas shaded light blue are where changes occur: above the 0dB line, the sound is amplified, below,\nattenuated.\n7. If you are bumping up a whole of frequencies, which is always tempting, you might make the sound clip. You can reduce the\noverall output with the fader on the right.\n8. Most plug-ins have Presets, Save and Load buttons at the bottom of the window. Save, well, saves the settings. Load, idem.\nPresets, again, obvious.\nNoise Reduction Using SoundSoap:\n1. There are two SoundSoaps, SoundSoap Pro and SoundSoap (2.2). The latter is far simpler, so I'll start with that. It is just a simple\nversion of part of SoundSoap Pro, with an easier interface, but fewer options.\n2. SoundSoap calls what it does 'Broadband' noise reduction. Here is how it works. When you record anything, you should always\nrecord a few seconds of the ambient sound, e.g. the classroom without anyone talking. This is the noise you wish to remove from the\nentire recording. SoundSoap 'learns' that noise by analyzing the frequencies of the noise over a short period of time, averaging it so\nthat time is no longer a variable, and subtracts the amount of each frequency it analyzed from the sound you are cleaning up. It's a\npretty amazing way of doing it. And it doesn't do too much damage to what you want to keep: if, say, there is a certain amount of\n700Hz in the noise, and some in my voice, it will take out the right amount, since it knows how much there was in the noise. Of\ncourse this works best when the noise is fairly consistent, like from a bad recording device, a/c sounds, even fairly homogeneous\ntraffic sounds. It is imperfect though. Noise has a time-varying character; it's fairly random, for all intents and purposes. One chunk of\nnoise might be to our ear exactly the same as the one that follows it, but it most likely contains slightly different amounts of every\nfrequency. A result of this is the melodic tinkling sound I played from Cat Power's Baby Doll (from You Are Free)--now on the MIT\nServer. There are ways around this, discussed below, but generally out of our realm for now.\n3. Set the cursor on the waveform to where there is noise. Click on Learn Noise, and press play (spacebar). Peak will learn the\namount of each frequency in this ~1s sample. After that, when you play your sound with Broadband On, that level of noise will be\nremoved from the sound as it is playing. Since it is a plug-in, you would have to bounce it to retain the noise-reduction effect. If you\n\ndo not have the consecutive ~1s of noise that SoundSoap needs, you can duplicate the smaller fragment a number of times, just so\nit can have its ~1s.\n4. You can switch Broadband (noise reduction) on and off, and you even have the option of keeping only the noise. This can be an\ninteresting source of compositional material: if you bounce the plug-in with noise only selected, that's what you will get.\n5. You can 'tune' the noise reduction. According to the manual, it \"Helps you 'tune in' the hiss and background noise you want to\nremove. The Learn Noise button sets this control automatically--or you can adjust it manually.\" You can also alter how much noise\nreduction is applied: when the knob is vertical, it takes out the amount of noise it learned--\"it is set automatically by Learn Noise (or\nyou can adjust it manually).\" If you increase the knob's value, it will take out more noise, in other words, more of each frequency that\nit detected as noise. This can be compositionally interesting in two ways--you can alter your sounds, or the amount of noise\nreduced is greater, therefore the noise only option gives you more to play with. Decreasing the knob's value will take out less noise,\nin other words, it will leave some noise in your sound. Playing with the Tune Noise knob can yield compositionally unexpected\nresults too.\n6. You can Preserve Voice, \"which is a special pre-filtering mode that removes frequencies outside of the range of the human\nvoice.\" Remove Rumble \"takes out low-frequency noise of 40Hz and below--often found as background noise in many DV clips.\"\nSound Enhancer does what it says, in that it \"adds 'sparkle' back into the audio signal. It can help restore frequencies that may have\nbeen lost in old or degraded media.\" It must be psychic. I imagine it is a little like iTunes' feature with the same name. \"Hum\nRemoval is used for eliminating hum that was introduced into digital audio and video files from electrical interference. Use 60Hz for\nNorth and South America,\" and 50Hz for most other places. I have used Hum Removal to good advantage in the past (due to my\nsloppy wiring of toys). Remove Click and Crackle does exactly that, though not very well. You set a threshold level--moving it\nupwards remove more clicks and crackle, but possible does (undesirable?) things to your sound.\n6. You don't just have to select noisy parts of your sound for the Learn Noise process; you can choose to play any ~1s chunk.\nExperiment with this for interesting compositional results. But in general, it is still advisable to keep a few seconds of noise lying\naround in case you want to NR a recording. I sometimes save them as separate files, for future use.\n7. SoundSoap Pro has four modules. You activate each module by checking its box at the bottom. You bring up its sub-window by\nclicking above the box. Take care with this. It is easy to set a module up, but not check its box, while another module isn't visible, but\nchecked.\n8. Both SoundSoap and SoundSoap Pro can be used as Audiosuite effects, and as RTAS mono or stereo inserts, in Pro Tools. This\nis pretty fantastic; as inserts you can automate many of its parameters, thus change noise reduction amount, noise reduction on or\nnoise only, etc. And with the non-Broadband modules of SoundSoap Pro, all kinds of fantastic things (like variable threshold noise\ngating).\n9. Here is the lazy way of explaining the four modules.\n\nSoundSoap Pro User's Guide\nPreset Save Button\nPreset Load Button\nOn/Bypass\nRadio Buttons\nA/B/C/D Compare Buttons\nHelp Button\nNoise Only Mode Button\nSpectrogram\nWhite = Input\nRed = Output\nDefault View Checkbox\nSpectrogram Slider\n(Scrolling & Zooming)\nClick & Crackle Tab\n(with tool settings thumbnail)\nHum & Rumble Tab\n(with tool settings thumbnail)\nNoise Gate Tab\n(with tool settings thumbnail)\nBroadband Tab\n(with tool settings thumbnail)\nLaunch Tab\nSoundSoap Pro User Interface:\nHum & Rumble Tab\nHum Meter\nHum Frequency Slider\n(with numerical entry field)\nEnable/Disable\nRumble Processing\nCheckbox\nRumble Slider\n(with numerical entry field)\nQ (Bandwidth) Slider\n(with numerical entry field)\nDepth Slider\n(with numerical entry field)\nHarmonics Slider\nHarmonics Tilt Knob\n(with numerical entry field)\n\nHum & Rumble Tab\nOn/Bypass Radio Buttons/Checkbox - These controls\nallow the Hum & Rumble tool to be turned on or off,\nwhile other tools remain active. These controls are use-\nful as they allow this tool to simply be turned off when\nnot required - and are also useful for comparing the dif-\nference between having the Hum & Rumble tool on or\noff.\nHum Meter - SoundSoap Pro's Hum Meter is another\nvisual feedback tool, which along with your ears, is a use-\nful tool for helping to locate the fundamental frequency\ncausing a particular hum. Typically, most hums occur at\neither 50Hz or 60Hz - however, there may be cases in\nwhich they occur at other frequencies. The Hum Meter\nworks in conjunction with the Hum Frequency Slider. To\nfind the fundamental frequency causing a hum, simply\nsweep the Hum Frequency Slider while listening to a\nmedia file containing hum. As you get closer and closer\nto the fundamental frequency, the Hum Meter's reading\nintensifies. When you see the strongest reading in the\nHum Meter, you've found the fundamental frequency\nresponsible for causing the hum, and can then use other\nHum & Rumble controls to adjust how much the hum is\nreduced.\nHum Frequency Slider - The Hum Frequency Slider\nallows you to reduce a specific frequency, and has a\nrange of 20Hz - 200Hz. Moving this slider determines\nthe fundamental frequency that will be targeted (a specif-\nic value may also be entered by typing a value in the\nnumerical entry field). If the frequency causing a hum is\nunknown, the Hum Frequency Slider may be swept as\nthe noisy media file is played, and the Hum Meter, locat-\ned directly above the Hum Frequency Slider, will register\nactivity as you approach the offending fundamental fre-\nquency. The setting that gives the strongest reading in\nthe Hum Meter is the frequency (or very close to it) caus-\ning the hum problem.\nWhen typing in values or using the Up/Down\nArrow keys to adjust values in a numerical field,\nbe sure to press the Return or Enter key on your\nkeyboard.\nQ (Bandwidth) Slider - The Q Slider determines the\nbandwidth of the notch filter being applied to a particu-\nlar frequency. The range of the Q slider is from 10 to 50\n- A larger Q value affects only a very narrow frequency\nrange, and a smaller value affects a wider frequency\nrange. Hum will vary depending on the source - a very\nnarrow Q (higher value) will eliminate only the frequen-\ncy set with the Hum Frequency Slider, and will do very lit-\ntle to frequencies that are very close, either higher or\nlower. On the other hand, a wider Q (smaller value), will\nstill affect the same fundamental frequency, but will also\naffect some of the surrounding frequencies. Ideally, the\nnarrowest Q (largest value) possible should be used, so\nas to affect just the offending frequency. If the Hum\nMeter shows a strong reading, but some hum is still audi-\nChapter 3\nThe Hum Meter provides visual feedback that helps identify the fre-\nquency causing a hum\nParameters can be adjusted with a slider, by entering a numerical\nvalue, or using the Up/Down Arrow keys on your keyboard\nOn/Bypass Radio Buttons\nOn/Bypass Checkbox\nHum & Rumble Tools may be turned on or bypassed using the radio\nbuttons in the tool area, or with a checkbox in the tab\n\nble, it's best to experiment with the Q value setting, as\nwell as the Depth and Harmonics Sliders.\nDepth Slider - The depth slider controls the amount of\naudio being cut out by the notch filter responsible for\neliminating hum, and is directly related to both the Q\nSlider and Hum Frequency Slider. The Depth slider has\na range of 0dB (no audio being cut out) to 50 dB of\nreduction. The Depth setting cuts the most amount of\naudio at the fundamental frequency, as determined by\nthe Hum Frequency Slider, and affects the surrounding\nfrequencies proportionally, depending on the Q value\nthat is used.\nHarmonics Slider - The Harmonics Slider designates how\nmany harmonics of the fundamental frequency should\nbe removed in either direction from the fundamental fre-\nquency. The range of harmonics that can be removed is\n1 - 9, always as integers, never as fractions. When deal-\ning with hum, there is always a fundamental frequency,\nand commonly there are harmonics at other frequencies,\ndue to resonance. Harmonics typically will have similar\ncharacteristics to the hum found at the center frequency,\nbut will be proportionally lower in amplitude. For exam-\nple, a 60Hz hum may have harmonics at higher frequen-\ncies, such as 120Hz, 180Hz, 240Hz, and so on. Assuming\nthe fundamental frequency is 60Hz, a setting of \"3\" on\nthe Harmonics Slider would also remove the hum that\noccurs at 120Hz and at 180Hz.\nHarmonics Tilt Knob - The Harmonics Tilt Knob allows\nyou to fine-tune the relationship between how much of\nthe fundamental frequency is cut, and how much of the\nsignal is cut at each harmonic.\nIt is common for a hum that occurs at a certain harmon-\nic of the fundamental frequency to have a lower ampli-\ntude than the hum at the fundamental frequency. The\nHarmonics Tilt Knob controls the relationship between\nthe depth of each successive notch filter created by the\nHarmonics slider. With a value of \"0.00\", each additional\nnotch created by raising the value of the Harmonics slid-\ner cuts at the same value as the notch placed at the fun-\ndamental frequency.\nFor example, if the Hum Depth slider is set to cut by 20dB,\nand the Harmonics Tilt Knob is set to \"0.00\", each addition-\nal notch created by increasing the value of the Harmonics\nslider will also cut each harmonic by 20dB. However, if the\nHum Depth slider is set to cut by 20dB, and the Harmonics\nTilt Knob is set to \"0.50\", then each successive notch creat-\ned by increasing the value of the Harmonics slider will cut\nat half the depth of the previous notch.\nRumble Reduction Slider - The Rumble Reduction Slider\nfocuses on very low frequency noise, commonly known as\n\"rumble\". Rumbles typically occur around 40Hz or below,\nand SoundSoap Pro's Rumble reduction tool has a range of\n20Hz - 100Hz. The Rumble reduction tool is a high-pass fil-\nter (it lets high frequencies pass through, while blocking\nlow frequencies), with a slope of 12dB and a Q value of .5.\nSoundSoap Pro User's Guide\nSoundSoap Pro can eliminate up to 9 harmonics of the fundamental\nfrequency\nThe Harmonics Tilt Knob allows fine-tuning of harmonic reduction\nNotch filter depth can be adjusted with a slider, or by entering a\nnumerical value\nQ (bandwidth) values can be adjusted with a slider, or by entering a\nnumerical value\nSeparate Rumble reduction control is available for very low frequency noise\n\nChapter 3\nGlobal Tools - As with all the other tool tabs, SoundSoap\nPro's global tools may be accessed from within the Hum\n& Rumble tab. These global tools include Preset\nButtons, A/B/C/D Compare Buttons, Help Button, Noise\nOnly Mode Button, Spectrogram, and the ability to mon-\nitor other tool settings with the Tool Tabs/Tool State\nThumbnails. These tools are described in more detail at\nthe beginning of this section.\nThat concludes the overview of the Hum & Rumble Tool -\nthe next section covers Click & Crackle reduction with\nSoundSoap Pro.\n\nSoundSoap Pro User's Guide\nPreset Save Button\nPreset Load Button\nOn/Bypass\nRadio Buttons\nA/B/C/D Compare Buttons\nHelp Button\nNoise Only Mode Button\nSpectrogram\nWhite = Input\nRed = Output\nDefault View Checkbox\nSpectrogram Slider\n(Scrolling & Zooming)\nClick & Crackle Tab\n(with tool settings thumbnail)\nHum & Rumble Tab\n(with tool settings thumbnail)\nNoise Gate Tab\n(with tool settings thumbnail)\nBroadband Tab\n(with tool settings thumbnail)\nLaunch Tab\nSoundSoap Pro User Interface:\nClick & Crackle Tab\nClick Threshold Slider\n(with numerical entry field)\nCrackle Threshold Slider\n(with numerical entry field)\nClick Meter\n\nClick & Crackle Tab\nOn/Bypass Radio Buttons/Checkbox - These controls allow\nthe Click & Crackle tool to be disabled, or bypassed, while other\ntools remain active. This control allows the tool to simply be\nturned off when not required, to save CPU power for other tasks.\nIt is also useful for comparing the difference between having the\nClick & Crackle tools on or off.\nClick Threshold Slider - The Click Threshold slider dictates\nhow bad clicks must be to be detected and removed.\nThe range of the Click Threshold slider is 1.00dB -\n25.00dB. When clicks are present in the media file being\nrestored, if they fall below the threshold value, they\nremain unaltered - if they're above the threshold, they\nare removed. The general rule with the Click Threshold\nslider is, moving it to the left will remove more clicks,\nand moving it to the right removes fewer clicks.\nCrackle Threshold Slider - The Crackle Threshold slider dic-\ntates how bad crackle must be to be detected and\nremoved. The range of the Crackle Threshold slider is\n12.0dB - 25.0dB. When crackle is present in the media\nfile being restored, if it falls below the threshold value, it\nremains unaltered - if it's above the threshold, it's\nremoved. The general rule with the Crackle Threshold\nslider is, moving it to the left will remove more crackle,\nand moving it to the right removes less crackle.\nClick Meter - The Click meter is another of SoundSoap\nPro's visual feedback tools. It illuminates in red to indi-\ncate that a click is being repaired.\nGlobal Tools - As with all the other tool tabs, SoundSoap\nPro's global tools may be accessed from within the Click\n& Crackle tab. These global tools include Preset Buttons,\nA/B/C/D Compare Buttons, Help Button, Noise Only\nMode Button, Spectrogram, and ability to monitor other\ntool settings with the Tool Tabs/Tool State Thumbnails.\nThese tools are described in more detail at the beginning\nof this section.\nCongratulations! You've now learned about SoundSoap\nPro's Click & Crackle Tools - the next section discusses the\nBroadband Tool...\nChapter 3\nOn/Bypass Radio Buttons\nOn/Bypass Checkbox\nThe Click Threshold slider allows fine-tuning click reduction\nThe Crackle Threshold slider allows fine-tuning crackle reduction\nThe Click Meter - When settings detect click & crackle, the meter lights\nup, as in the picture on the right\nClick & Crackle Tools may be turned on or bypassed using the radio\nbuttons in the tool area, or with a checkbox in the tab\n\nSoundSoap Pro User's Guide\nPreset Save Button\nPreset Load Button\nLearn Noise Button\nOn/Bypass\nRadio Buttons\nLock/Unlock\nThreshold Sliders\nMeters\nThreshold Slider\nReduction Slider\nA/B/C/D Compare Buttons\nHelp Button\nNoise Only Mode Button\nSpectrogram\nWhite = Input\nRed = Output\nDefault View Checkbox\nAttack Knob\n(with numerical entry field)\nSoundSoap Pro User Interface:\nBroadband Tab\nSpectrogram Slider\n(Scrolling & Zooming)\nRelease Knob\n(with numerical entry field)\nRelease Tilt Knob\n(with numerical entry field)\nAttack Tilt Knob\n(with numerical entry field)\nLock/Unlock\nReduction Sliders\nClick & Crackle Tab\n(with tool settings thumbnail)\nHum & Rumble Tab\n(with tool settings thumbnail)\nNoise Gate Tab\n(with tool settings thumbnail)\nBroadband Tab\n(with tool settings thumbnail)\nLaunch Tab\nThreshold/Reduction\nControl Slider\nSpectrogram\nFrequency Scale\n\nChapter 3\nBroadband Tab\nOn/Bypass Radio Buttons/Checkbox - These controls allow\nthe Broadband tool to be disabled, or bypassed, while\nother tools remain active. This control allows the tool to\nsimply be turned off when not required, to save CPU\npower for other tasks. It is also useful for comparing the\ndifference between having the Broadband tool on or off.\nLearn Noise Button - The Learn Noise button is used to\nautomatically \"learn\" a profile of frequencies responsible for\ncausing a particular type of Broadband noise. There are two\nmodes of operation available with the Learn Noise button.\nThe first mode, called \"Snapshot Mode\", (identified by a cam-\nera icon) works by depressing the button and initiating audio\nplayback within the host application. SoundSoap Pro analyzes\nthe minimum amount of audio (from the current playhead\nposition) needed to accurately create a noise profile, and then\nautomatically snaps the 12 Threshold sliders to the appropri-\nate positions to reduce/remove the unwanted broadband\nnoise. The second mode is a timed Learn Noise mode. To use\nthis mode, one would click the portion of the Learn Noise but-\nton with the clock icon, and then initiate playback.\nSoundSoap Pro continues to analyze audio (beginning from\nthe original playhead position) that is played until the clock\nicon is clicked a second time. At this time, the 12 Threshold\nsliders are snapped into the appropriate position to\nreduce/remove the Broadband noise present, based on the\naverage noise profile learned over the duration indicated by\nthe user.\nMeters - The 12 meters in the Broadband Tool indicate the\nlevel of audio contained within each frequency range.\nThe meters on the left-most side of the interface indicate\nlow frequency ranges, while the meters on the right-most\nside of the interface indicate high frequency ranges -\nwith meters between these two extremes indicating the\nmidrange frequencies between the two. The actual fre-\nquency range of each band is not fixed - it depends on\nthe learned noise profile.\nThreshold/Reduction View Slider - This horizontal slider\nallows viewing either just the Threshold sliders - just the\nReduction sliders - or can be positioned so that both\nThreshold and Reduction sliders can be viewed and\nadjusted at the same time. By default, the\nThreshold/Reduction Control slider is set to the center\nposition, so that both Reduction and Threshold sliders\nare visible and adjustable.\nReduction Sliders - The Reduction sliders control the\namount of noise reduction being applied to a particular\nfrequency range. Reduction sliders can be used in a\nnumber of ways - they may all be locked together and\nmoved simultaneously by moving a single slider - or they\nmay be temporarily unlocked, moved to different relative\npositions, and then locked back together and moved uni-\nformly at their respective positions. In addition, they can\nall be unlocked and moved independently of each other\n- or, some sliders may be locked together, while others\nSnapshot Mode\nTimed Mode\nThe meters indicate audio level in each frequency band, and help in\nfine-tuning settings for individual bands\nThe Threshold/Reduction Control slider allows viewing just Threshold\nsliders, just Reduction sliders, or a percentage of both simultaneously\nOn/Bypass Radio Buttons\nOn/Bypass Checkbox\nBroadband Tools may be turned on or bypassed using the radio but-\ntons in the tool area, or with a checkbox in the tab\n\nremain unlocked and can be moved independently. By\ndefault, the Reduction sliders are set to a value of -15dB,\nand have an overall range of 0dB to -40dB.\nThreshold Sliders - The Threshold sliders set the level that\nthe signal must exceed for processing to be enabled in each\nfrequency range. The sliders default to being locked togeth-\ner, so moving one slider will move the other sliders of the\nsame type (reduction or threshold) and retain their relative\npositions. Individual sliders may be fine-tuned by unlocking\nthem and moving them independently. You can optionally\nchoose to lock any number of sliders together so they can be\nadjusted in unison. By default, the Threshold sliders are set\nto a value of 0dB, and have an overall range of 0dB to -70 dB.\nLock/Unlock Reduction Sliders Button - This control\neither locks or unlocks all the Reduction sliders so that\nthey may be moved independently of one another - or\nmoved as a group, each in its relative position. In addi-\ntion to the master Lock/Unlock button, each individual\nslider has its own Lock/Unlock control positioned at its\nbase. These controls allow the locking or unlocking of\neach frequency band's Reduction slider, without having\nto unlock all the sliders simultaneously. By default, all\nthe Reduction sliders are locked together.\nLock/Unlock Threshold Sliders Button - This control\neither locks or unlocks all the Threshold sliders so that\nthey may be moved independently of one another - or\nmoved as a group, each in its relative position. In addi-\ntion to the master Lock/Unlock button, each individual\nslider has its own Lock/Unlock control positioned at its\nbase. These controls allow the locking or unlocking of\neach frequency band's Threshold slider, without having\nto unlock all the sliders simultaneously. By default, all\nthe Threshold sliders are locked together.\nAttack Knob - The Attack knob sets the attack time in mil-\nliseconds for each frequency band. By default, the Attack\nvalue is set to 75 milliseconds.\nRelease Knob - The Release knob sets the release time in\nmilliseconds for each frequency band. By default, the\nRelease value is set to 100 milliseconds.\nAttack Tilt Knob - The Attack Tilt knob adjusts the ratio\nof Attack between the low frequency bands and the high\nfrequency bands. By default, the Attack Tilt knob's value\nis set to 1.0.\nSoundSoap Pro User's Guide\nThe Release knob controls how fast broadband noise reduction is turned off\nReduction sliders may be moved in groups or independently\nThreshold sliders may be moved in groups or independently\nAbove: All Threshold sliders locked together - they move together\nBelow: All Threshold sliders unlocked - they now move independently\nAbove: All Reduction sliders locked together - they move together\nBelow: All Reduction sliders unlocked - they now move independently\nThe Attack knob controls how fast broadband noise reduction is\nturned on\n\nFor example, if the Attack Knob's value is set to 50\nms, and the Attack Tilt knob is set to \"1.0\", then the\nAttack time for the lowest frequency band will be\n50 ms, as will be the Attack time for all other fre-\nquency bands. If however, the Attack Tilt knob is\nset to \"2.0\", then the Attack time for the lowest fre-\nquency band remains at 50 ms, but the Attack time\nfor the highest frequency band will be 25 ms - or,\na 2:1 ratio between the lowest and highest frequen-\ncy bands. In this case, moving to the right from the\nlowest frequency band to the highest, each succes-\nsive band will have a proportionally lower attack\nvalue. Essentially, the Attack Tilt knob simply\nvaries the ratio of Attack time between the lowest\nand highest frequency bands, and sets the Attack\ntime of any midrange frequencies to a proportion-\nal value in between.\nRelease Tilt Knob - The Release Tilt knob adjusts the\nratio of Release between the low frequency bands and\nthe high frequency bands. By default, the Release Tilt\nknob's value is set to 1.0.\nFor example, if the Release Knob's value is set to 50\nms, and the Release Tilt knob is set to \"1.0\", then the\nRelease time for the lowest frequency band will be\n50 ms, as will be the Release time for all other fre-\nquency bands. If however, the Release Tilt knob is\nset to \"2.0\", then the Release time for the lowest fre-\nquency band remains at 50 ms, but the Release\ntime for the highest frequency band will be 25 ms\n- or, a 2:1 ratio between the lowest and highest fre-\nquency bands. In this case, moving to the right\nfrom the lowest frequency band to the highest,\neach successive band will have a proportionally\nlower release value. Essentially, the Release Tilt\nknob simply varies the ratio of Release time\nbetween the lowest and highest frequency bands,\nand sets the Release time of any midrange fre-\nquencies to a proportional value in between.\nGlobal Tools - As with all the other tool tabs, SoundSoap\nPro's global tools may be accessed from within the\nBroadband tab. These global tools include Preset\nButtons, A/B/C/D Compare Buttons, Help Button, Noise\nOnly Mode Button, Spectrogram, and the ability to mon-\nitor other tool settings with the Tool Tabs/Tool State\nThumbnails. These tools are described in more detail at\nthe beginning of this section.\nYou've now learned about SoundSoap Pro's Broadband\nTool - the next section goes over the Noise Gate Tool,\nwhich can be used to eliminate any residual noise leftover\nafter using the previously mentioned tools.\nChapter 3\nThe Release Tilt knob varies the ratio of Release values between low\nand high frequency bands\nThe Attack Tilt knob varies the ratio of Attack values between low and\nhigh frequency bands\n\nSoundSoap Pro User's Guide\nPreset Save Button\nPreset Load Button\nOn/Bypass\nRadio Buttons\nA/B/C/D Compare Buttons\nHelp Button\nNoise Only Mode Button\nSpectrogram\nWhite = Input\nRed = Output\nDefault View Checkbox\nClick & Crackle Tab\n(with tool settings thumbnail)\nHum & Rumble Tab\n(with tool settings thumbnail)\nNoise Gate Tab\n(with tool settings thumbnail)\nBroadband Tab\n(with tool settings thumbnail)\nLaunch Tab\nSoundSoap Pro User Interface:\nNoise Gate Tab\nVisual Display\n(with audio waveform\nand noise gate)\nThreshold Attack Knob\n(with numerical entry field)\nThreshold Release Knob\n(with numerical entry field)\nThreshold Slider\n(with numerical entry field)\nReduction Slider\n(with numerical entry field)\nSpectrogram Slider\n(Scrolling & Zooming)\n\nChapter 3\nNoise Gate Tab\nOn/Bypass Radio Buttons/Checkbox - These controls allow\nthe Noise Gate tool to be disabled, or bypassed, while\nother tools remain active. This control is useful as it\nallows the tool to simply be turned off when not\nrequired, to save CPU power for other tasks. It is also\nuseful for comparing the difference between having the\nNoise Gate tool on or off.\nVisual Display - The Noise Gate's visual display shows\nthe audio waveform being processed, as well as the noise\ngate's threshold indicators. Options for viewing the\nwaveform include displaying just the left or right chan-\nnels, or adding the left and right channels together - dis-\nplaying the overall audio signal between the two chan-\nnels as a single audio waveform. In addition, there is a\nFreeze button that appears when the mouse cursor is\nplaced over the visual display. Clicking the button tem-\nporarily pauses waveform scrolling, and clicking the but-\nton when the waveform is paused starts it scrolling again.\nThreshold Slider - The Threshold slider determines the\naudio level required for the Noise Gate to open. The\nthreshold level is also represented by a pair of white, par-\nallel horizontal lines, which appear over the audio wave-\nform in the visual display. By default, the Noise Gate\nThreshold slider is set to a value of 20dB, and has a range\nof 0dB to -60dB.\nReduction Slider - This slider provides a proportional\namount of noise reduction, based on the settings of the\nNoise Gate's Threshold Slider. A lower setting in the\nDepth slider provides a lower ratio between the thresh-\nold level to the amount of noise reduction, whereas a\nhigher setting increases this ratio. By default, the Noise\nGate's Depth slider is set to a value of 2.00, and has a\nrange of 1.00 to 5.00.\nThreshold Attack Knob - The Threshold Attack knob\ndetermines how quickly the Noise Gate opens. By\ndefault, the Attack value is set to 30 milliseconds, and has\na range of 10 milliseconds to 500 milliseconds.\nThreshold Release Knob - The Threshold Release knob\ndetermines how quickly the Noise Gate closes. By\ndefault, the Release value is set to 100 milliseconds, and\nhas a range of 50 milliseconds to 1000 milliseconds.\nThe Noise Gate's Threshold can be adjusted with a slider, or by enter-\ning a numerical value\nThe Noise Gate's Depth can be adjusted with a slider, or by entering a\nnumerical value\nThe Noise Gate's Attack can be adjusted with a knob, or by entering a\nnumber\nThe Noise Gate's Release can be adjusted with a knob, or by entering\na number\nOn/Bypass Radio Buttons\nOn/Bypass Checkbox\nNoise Gate Tools may be turned on or bypassed using the radio but-\ntons in the tool area, or with a checkbox in the tab\n\"Noise Gate\" Threshold Indicators\nWaveform View Selection Radio Buttons\nVarious elements of the Noise Gate's visual display\nFreeze WaveformButton\n10. As with everything, misuse is a great thing. Keeping just the clicks and crackle can be extremely fruitful, especially when we use\nMax/MSP (and especially in the advanced course); the clicks can be used to trigger events. And clicks are good to collect for making\nbeats. The clicks resulting from a click and crackle removal operation are quite varied.\n11. There are a few other plug-ins that are part of the Master Perfection Suite from BIAS. Briefly, GateEx is a gate/expander, which\ncan be used as a noise gate as in SoundSoap Pro, and as a dynamic expander--we'll be looking at dynamic things next lab. All\nthese plug-ins have tons of controls for fine-tuning production, less for our messing around. PitchCraft is a pitch transposer that can\nretain vocal quality, unlike with normal pitchshifting, which e.g. makes us sound like the chipmunks when our voices are transposed\nup an octave. The manual pages that follow include a section (p. 38) on how to change your voice into that of a robot, child, person\nof another gender, etc. Repli-Q learns the average spectrum of a recording, say of a Radiohead song, and you can then slap it onto\none of your duller produced pieces. It doesn't do anything magical and subtle like impart reverb, spatialization, individual track EQ\ning, but it is a cheap way of making something sound half-good. Reveal doesn't change sound, but shows you all kinds of things\nabout it, many of which won't be useful to you. For instance, the phase diagram is very useful in production, but we don't (yet) have\nmuch use for it. The Sqeez plug-ins are dynamic compressing, limiting, and upward expanding tools that are supposed to be pretty\ndecent.\n\nChapter 3:\nGateEx\nIntroduction\nGateEx is a full-featured noise gate and downward\nexpander plug-in. When used as a noise gate, GateEx\nallows an audio signal to be reduced in amplitude when\nit falls below a user-defined threshold level. When used\nas a downward expander, GateEx allows the apparent\ndynamic range of an audio signal to be increased.\nSome common examples of how a gate would typically\nbe used are:\n-\nIn dialogue recordings, a gate might be used to\nremove (or minimize) the presence of background\nnoise or room tone that is audible in the amplitude\ndips between the speaker's words or phrases.\nWhen the subject speaks, the rising amplitude of\nthe voice triggers the gate to open, allowing the\nvoice to pass through, and as words trail off and the\namplitude drops, the gate closes and prevents any\nlow level background noise from being audible.\n-\nIn music recordings (we'll use a drum kit as an\nexample), a gate might be used to remove or\nisolate one type of drum from another. When used\nproperly on a drum recording, a gate can\naccomplish such tasks as isolating the snare drum,\nand removing any bleed picked up through the\nsnare mic from other nearby drums, such as the\nkick or hi-hat.\nA common example of how a downward expander would\ntypically be used:\n-\nA downward expander can be applied to increase\nthe apparent dynamic range. This increase in\ndynamic range is accomplished by decreasing the\ngain amount in the relatively quiet portions of the\nrecording, so that the apparent noise floor is\nlowered.\nGateEx User Interface & Controls\nThe GateEx plug-in is designed to be intuitive and easy to\nuse. This section discusses the graphical user interface,\nand will familiarize you with each of the various controls.\nGlobal Controls\nGateEx features a variety of parameters designed for\nspecific tasks, and also features some \"global\" controls, that\naffect the state of the entire plug-in. Below is a brief\ndescription of these \"global\" tools, and how they operate.\nA/B/C/D Compare Buttons\nThe A/B comparison feature is common in audio\nprograms, and gives the ability to preview different\nsettings before committing to them. Essentially, various\ntool settings are made and stored as snapshot \"A\" -\nChapter 3: GateEx\n\nMaster Perfection Suite User's Guide\nGateEx Graphical User Interface\nA/B/C/D\nComparison\nButtons\nInput\nLevel\nMeters\nOutput\nLevel\nMeters\nThreshold Slider/\nNumerical Field\nGain Slider/\nNumerical Field\nAttack Knob/\nNumerical Field\nRelease Knob/\nNumerical Field\nDepth Knob/\nNumerical Field\nHold Knob/\nNumerical Field\nHysteresis Knob/\nNumerical Field\nRatio Knob/\nNumerical Field\nGraph Display\nLookahead Knob/\nNumerical Field\nWaveform Display\nGate Threshold Indicators\nAudio Exceeding Threshold\nAudio below Threshold\nView Mode Radio Buttons\nFactory Preset Pop-\nUp Menu\nFactory Preset\nSelection\nArrows\nUser Preset\nControls\nBypass Button\n\nanother group of settings can then be assigned as\nsnapshot \"B\" - and then clicking the A or B buttons in\nthe interface instantly toggles between the two. As\nGateEx offers many fine-tuning options, it features not\njust two comparison modes - but instead includes\nA/B/C/D comparisons, for four unique snapshots to\ncompare between, before committing to any file\nprocessing. These snapshots are similar to saving and\nloading presets, but are instantaneous, and do not\nrequire selecting presets from a menu to load them. To\npermanently save one of these snapshots, simply select\nthe desired snapshot, and save it as a custom User Preset.\nFactory Preset Pop-Up Menu\nThis menu displays the current factory preset, if one has\nbeen selected. Clicking this menu shows a list of all\navailable factory presets. A factory preset may be\nselected by choosing it from this pop-up menu.\nFactory Preset Selection Arrows\nThese arrows are used to navigate through factory\npresets. Clicking the down arrow moves to the next\navailable factory preset, and clicking the up arrow moves\nto the previous factory preset.\nUser Preset Save Button\nSaves a user preset, which includes the state of all GateEx\nparameters.\nUser Preset Load Button\nRecalls a user preset, includes the state of all GateEx\nparameters.\nUser presets do not appear in the Factory Preset\npop-up menu, so be sure you are aware of the\ndirectory where you are saving them into, so they\nmay be recalled easily later.\nBypass Button\nThe Bypass button is used to temporarily disable the\nplug-in. When the plug-in is bypassed, audio playback is\nnot affected by the plug-in.\nGate/Expander Controls\nThe Gate/Expander controls each affect a unique\ncharacteristic of the overall gate/expander behavior.\nThese are described briefly below.\nInput Level Meters\nThe Input Level Meters show the level of the original\naudio signal being fed into the plug-in, before it is\naffected by any of the various controls.\nOutput Level Meters\nThe Output Level Meters show the level of the processed\naudio signal, after being affected by the active parameter\nsettings.\nThreshold Slider\nThe Threshold slider determines the amplitude level at\nwhich the gate opens or closes. If the signal level\nexceeds the Threshold setting, the gate opens, and\nremains open for as long as the signal remains above the\nThreshold. If the signal falls below the Threshold setting,\nthe gate closes, and remains closed until the signal\nexceeds the Threshold setting.\nBy default, the Threshold slider is set to a value of -60dB,\nand has a range of 0 to -60dB.\nChapter 3: GateEx\n\nAttack Knob\nThe Attack Knob determines how quickly the gate opens\nwhen the audio signal being fed into it exceeds the\nthreshold level.\nBy default, the Attack Knob is set to a value of 30ms, and\nhas a range of 1-1000ms.\nRelease Knob\nThe Release Knob determines how quickly the gate\ncloses when the audio signal being fed into it falls below\nthe threshold level.\nBy default, the Attack Knob is set to a value of 100ms, and\nhas a range of 50-3000ms.\nDepth Knob\nThe Depth Knob determines how far the gate closes (i.e.,\nhow deeply the signal is attenuated) when triggered by a\nsignal that exceeds the threshold level. By default, the\nDepth control is set to its maximum level, -90dB, which\ncauses audio signals to be completely silenced when the\ngate is in the closed position. The Depth control is\nuseful as it allows a variable level of signal reduction\nwhen the gate is closed, and can help produce a more\nsubtle gating effect. Another useful effect of having a\nDepth setting lower than the maximum amount is that it\nallows the gate to open faster than if it were in the fully\nclosed position, and can be useful if a faster attack time\nis needed, and the Attack knob is already set to operate\nat its lowest value (1ms).\nBy default, the Attack Knob is set to a value of -90dB, and\nhas a range of 0 to -90dB.\nHold Knob\nThe Hold Knob allows the gate to remain in the open\nposition for a user-specified amount of time, even after\nthe signal level has fallen below the threshold level. This\ncontrol is especially useful when the audio signal is very\nclose to the threshold level, and might cause the gate to\nopen and close repeatedly, very quickly, as the signal\nexceeds and then falls below the threshold over a very\nshort period of time. This rapid opening and closing of\nthe gate can create an unwanted artifact called \"chatter\"\nor \"jitter\", and the Hold control helps to avoid it.\nBy default, the Hold Knob is set to 0ms, and has a range\nof 0 - 3000ms.\nHysteresis Knob\nThe Hysteresis control is similar to the Hold control in its\npractical application of helping to avoid/eliminate\n\"chatter\", but achieves this in a different way. Rather\nthan simply maintaining the gate's open position for a\nuser-specified duration, the Hysteresis control allows\nsetting independent threshold levels for opening or\nclosing the gate, by specifying the difference between\nthem in decibels. With this approach, the gate opens\nwhen a primary threshold level is exceeded by a suitable\nsignal level, and closes again only when the signal level\ndrops below a secondary threshold level.\nBy default, the Hysteresis Knob is set to 0dB, and has a\nrange of 0 - 10dB.\nLookahead Knob\nAs its name implies, the Lookahead Knob reads data\nfrom a file a bit earlier than it is actually played back. This\nallows the gate to react earlier than it would, based on its\nthreshold setting alone. This feature is useful as it helps\nto preserve transients and attacks that might be\neliminated (or minimized) due to the gate opening after\nthey had already occurred.\nBy default, the Lookahead Knob is set to 0ms, and has a\nrange of 0 - 100ms.\nMaster Perfection Suite User's Guide\n\nRatio Knob\nThe Ratio Knob is used to set the rate at which audio\nsignal reduction is applied, when the signal exceeds the\nthreshold level.\nBy default, the Ratio Knob is set at 1:1, and has a range of\n1:1 - 50:1.\nGain Slider\nThe Gain slider is used to set the output level. By\ndefault, it is set to 0dB, and has a range of 0 to -90dB.\nGraphic Displays\nGateEx features two graphic display areas that are helpful\nin making the appropriate settings quickly. These are\ndescribed below.\nWaveform Display\nThe Waveform Display shows a graphical representation\nof the audio signal being fed into GateEx in real-time.\nThis display is particularly helpful in quickly setting the\nthreshold level, as it creates a graphical relationship\nbetween the signal level and the threshold level.\nGate Threshold Indicators\nThese indicators appear as horizontal white lines\nsuperimposed over the Waveform Display, and give a\ngraphical representation of the current threshold value,\nin relation to the input signal level.\nFreeze Waveform Button\nThe Freeze Waveform Button allows you to stop and start\nthe waveform from scrolling. This is useful for examining\nparticular areas of the waveform display as you scroll\nthrough its timeline.\nWaveform View Radio Buttons\nThis group of radio buttons allows choosing between\nhaving the Waveform Display calculated by the content of\na stereo signal's left channel (L), right channel (R), or\nboth channels (L+R).\nWhen using L+R mode, a single waveform\ndisplays the sum of both channels.\nZoom Button\nThis control is located where the X & Y-axes meet. It can\nbe used to zoom in/out on either axis independently, or\nboth at the same time. This allows for higher precision\nviewing of the graph display.\nHorizontal Scrollbars/Arrows\nWhen zoomed in on the horizontal axis, the scrollbars\nand/or scroll arrows may be used to move the Waveform\nDisplay earlier or later in time, allowing examination of\nwaveform events anywhere along the timeline.\nBy default, the zoom level is set to \"zoomed out all the\nway\", and the horizontal scrollbars/arrows have no\neffect.\nVertical Scrollbars/Arrows\nWhen zoomed in on the vertical axis, the scrollbars\nand/or scroll arrows may be used to move the Waveform\nDisplay up or down, allowing examination of events that\noccur in the waveform's positive or negative phase.\nBy default, the zoom level is set to \"zoomed out all the\nway\", and the vertical scrollbars/arrows have no effect.\nChapter 3: GateEx\n\nGraph Display\nThe Graph Display shows a number of key parameter\nsettings in an easy-to-read graph format, with each axis\nlabeled in decibels. The X-axis represents audio input\nlevel, while the Y-axis represents output level. The graph\nmakes it fast and easy to make settings, and allows easy\nplotting of input and output level values.\nWhen Hysteresis is used, the Attack threshold\nsetting in the graph display is represented in blue,\nand the Release threshold setting appears in green.\nUsing GateEx\nThis section contains some basic \"hands-on\" getting\nstarted tips.\n1.\nUse the Ratio Knob to set the rate at which\nreduction increases when the audio signal exceeds\nthe current threshold level. A good starting point\nis to set it to the highest setting (i.e., 50:1).\n2.\nAdjust the Threshold slider until the gate opens to\nallow the desired audio content to pass through it,\nand closes to prevent lower level, unwanted audio\nfrom being passed.\n3.\nFine-tune your settings by making adjustments to\nthe following controls, and try these tips:\n-\nAttack and Release - Use faster times for\npercussive material (such as drums), or slower\ntimes for less-percussive material (such as voice).\n-\nDepth - Set the depth so the proper amount of\nreduction is happening when the gate is closed.\nThis allows for subtle gating where not all the\nsignal is removed when the gate is closed, or more\ndrastic gating where all the signal is removed when\nthe gate is closed.\n-\nHold - Use the hold control to ensure the gate\nstays open for the desired length of time (i.e., so\nthat it does not begin to close prematurely and\nreduce part of the desired audio signal).\n-\nHysteresis - Use the hysteresis control to set\nindependent threshold levels for opening/closing\nthe gate if the audio signal hovers near the\nthreshold setting.\n-\nLookahead - Use the Lookahead control if you\nneed the gate to open a little before the audio\nsignal goes above the threshold level in order to\npreserve any transients or attacks.\nIf you are unfamiliar with using gates, try using some of\nthe included factory presets, which are representative of\ncommon gate settings. These should provide a good\nstarting point, from which you can fine-tune the controls\nto best suit the audio material you are working with.\nConclusion\nNow that you are familiar with the various GateEx\ncontrols, and its basic workflow, please continue along to\nthe next chapter, where you will learn about the\nPitchCraft plug-in.\nMaster Perfection Suite User's Guide\n\nChapter 4:\nPitchCraft\nIntroduction\nPitchCraft is a pitch correction and transposition plug-in\nthat can be used to correct and/or change pitch from a\nvariety of sources. The high quality algorithm includes\nformant correction to retain the natural sound of a voice\n- and may also be used to intentionally modify the\ncharacteristics of a voice.\nThis plug-in provides high-quality professional pitch\ncorrection/transposition, with an easy to use, intuitive\ninterface.\nSome common examples of how PitchCraft might be\nused include:\n-\nTo correct pitch problems in vocal or intrumental\nrecordings\n-\nChange pitch of a performance to match a different\nkey than was used in the original performance\n-\nPitch and formant modification, as a sound design\ntool\n-\nVirtually altering the size of the vocal cavity and\nvocal cords, for effects such as \"gender\ntransformation\", voice disguising, changing an\nadult's voice into a child's voice and vice-versa\nPitchCraft User Interface & Controls\nThe PitchCraft plug-in is designed to be intuitive and\neasy to use. This section discusses the graphical user\ninterface, and will familiarize you with each of the various\ncontrols. The user interface is divided into a number of\nsections, each with dedicated controls or displays used\nfor pitch transposition and correction.\nGlobal Controls\nPitchCraft features a variety of parameters designed for\nspecific tasks, and also features some \"global\" controls,\nthat affect the state of the entire plug-in. Below is a brief\ndescription of these \"global\" tools, and how they operate.\nReference Source Pop-Up Menu\nThis menu allows you to choose whether the reference\nsource (i.e., the signal being fed into PitchCraft) is a\nsingle (left or right) channel of a stereo file, or both\nchannels simultaneously.\nIf you are working with a mono file, be sure to set\nthe Reference Source Pop-Up menu to \"Left\".\nPitch Range Pop-Up Menu\nThis menu allows you to choose the desired pitch range\nto use. Using the appropriate pitch range optimizes\nPitchCraft for certain source types. The plug-in will not\ndetect pitch values outside the bounds specified for a\ngiven source. If you hear artifacts in the audio output,\nChapter 4: PitchCraft\n\nMaster Perfection Suite User's Guide\nPitchCraft Graphical User Interface\nReference Source Pop-Up Menu\nPitch Range Pop-Up Menu\nA/B/C/D Comparison Buttons\nTuning History Graph\nDisplay\nView Notes/Hz Radio Buttons\nGraph Data Legend\nY-axis - Scale\nX-axis - Time in\nminutes and seconds\nZoom Button\nScrollbars/Scroll Arrows\nTranspose On/Off Checkbox\nPitch Slider/Numerical Field\nFormant Slider/Numerical Field\nCorrect Pitch On/Off Checkbox\nTuning Pop-Up Menu\nScale Pop-Up Menu\nKey Pop-Up Menu\nPitch Correction Time\nSlider/Numerical Field\nDetune Slider/Numerical Field\nIgnore Note Checkboxes\nCustom Scale Controls\nKeyboard Display\nFactory Preset Selection Arrows\nTuning Meter\nFactory Preset Pop-Up Menu\nUser Preset Controls\nBypass Button\nUse Note in Scale Indicator\n\nyou might want to try a different setting, as artifacts are\ngenerally produced when the source pitch falls outside\nthe bounds specified by the value selected in the Pitch\nRange pop-up menu.\nMaking a pitch range selection in the Pitch Range pop-up\nmenu assigns a corresponding pitch range scale along\nthe Y-axis of the Tuning History Graph. Pitch range\noptions include:\n-\nNormal - D2 (73 Hz) to E6 (1318 Hz)\n-\nFemale - E3 (165 Hz) to E6 (1318 Hz)\n-\nMale - D2 (73 Hz) to B4 (494 Hz)\n-\nLower Register - E0 (20 Hz) to E4 (330 Hz)\n-\nHigher Register - E4 (330 Hz) to D#7 (2500 Hz)\nA/B/C/D Compare Buttons\nThe A/B comparison feature is common in audio\nprograms, and gives the ability to preview different\nsettings before committing to them. Essentially, various\ntool settings are made and stored as snapshot \"A\" -\nanother group of settings can then be assigned as\nsnapshot \"B\" - and then clicking the A or B buttons in\nthe interface instantly toggles between the two. As\nPitchCraft offers many fine-tuning options, it features not\njust two comparison modes - but instead includes\nA/B/C/D comparisons, for four unique snapshots to\ncompare between, before committing to any file\nprocessing. These snapshots are similar to saving and\nloading presets, but are instantaneous, and do not\nrequire selecting presets from a menu to load them. To\npermanently save one of these snapshots, simply select\nthe desired snapshot, and save it as a custom User Preset.\nFactory Preset Pop-Up Menu\nThis menu displays the current factory preset, if one has\nbeen selected. Clicking this menu shows a list of all\navailable factory presets. A factory preset may be\nselected by choosing it from this pop-up menu.\nFactory Preset Selection Arrows\nThese arrows are used to navigate through factory\npresets. Clicking the down arrow moves to the next\navailable factory preset, and clicking the up arrow moves\nto the previous factory preset.\nUser Preset Save Button\nSaves a user preset, which includes the state of all\nPitchCraft parameters.\nUser Preset Load Button\nRecalls a user preset, includes the state of all PitchCraft\nparameters.\nUser presets do not appear in the Factory Preset\npop-up menu, so be sure you are aware of the\ndirectory where you are saving them into, so they\nmay be recalled easily later.\nBypass Button\nThe Bypass button is used to temporarily disable the\nplug-in. When the plug-in is bypassed, audio playback is\nnot affected by the plug-in.\nTuning History Graph Display and\nTuning Meter\nThese controls are used to view an audio signal's tuning\nhistory over time, and also to customize and navigate the\nGraph display.\nChapter 4: PitchCraft\n\nView Notes/Hz Radio Buttons\nThese controls allow you to choose whether the Graph\ndisplay's Y-axis is represented as Notes or Hz\n(frequencies).\nGraph Display\nThis display plots the pitch of both the input (raw) and\noutput (processed) signals, and is useful for comparing\nthe difference between the two. The yellow line\nrepresents the input pitch, and the orange line\nrepresents the output, or corrected pitch. The X-axis\nrepresents time, and the Y-axis represents the currently\nselected scale, and may be viewed as notes or Hz\n(frequencies).\nZoom Button\nZooming in or out is accomplished using the Zoom\nButton, located at the point where the X and Y-axes\nmeet. This control allows a very detailed zoomed-in\nview, or can be zoomed-out for a \"big picture\" view.\nOption-clicking on the Zoom Button resets the zoom\nlevel.\n-\nZoom In Horizontally - Click and drag to the right\n-\nZoom Out Horizontally - Click and drag to the left\n-\nZoom In Vertically - Click and drag up\n-\nZoom Out Vertically - Click and drag down\nTuning Meter\nThe Tuning meter appears vertically along the right side\nof the interface, and displays the current amount of\ntuning. The divisions along the Tuning meter's scale is\nmarked at 200-cent intervals, with the maximum tuning\namount of 200 cents at the top of the scale, zero cents in\nthe middle, and -200 cents at the bottom.\nTransposition Controls\nThis group of controls is used for altering the pitch and\nformant of the reference source being fed into\nPitchCraft.\nTranspose On/Off Checkbox\nThis control allows enabling/disabling all Transposition\ncontrols.\nPitch Slider/Numerical Field\nThis control allows raising or lowering the pitch value (in\ncents), while maintaining the original formant structure\n(i.e., the \"timbre\" or \"tonal color\" of the voice).\nWhen working with vocal sources this control is\nthe equivalent to modifying the length of the vocal\ncords.\nEach division along the Pitch Slider's scale represents the\nassociated musical interval (major second, major third,\netc).\nSliders/pop-up sliders can be reset to their default\nvalues by Option-clicking on them.\nWhen numerical fields are in an editable state\n(i.e., after clicking in them with the mouse), their\nvalues may be changed by typing in new values,\nby using the Up/Down Arrow keys on your\nkeyboard, or by using the scroll wheel on a Mac OS\nX-compatible scroll wheel mouse.\nFormant Slider/Numerical Field\nThis control allows raising or lowering the format value\nMaster Perfection Suite User's Guide\n\n(in cents) through a tilt of the spectral envelope,\nstretching the spectrum at the high end, and\ncompressing it at the low end. The formant slider acts as\na particular type of filter, while the pitch control\nperforms the usual pitch transposition on the\ninstrument.\nWhen working with vocal sources this control is\nthe equivalent to modifying the volume of the\nvocal cavity.\nEach division along the Formant Slider's scale represents\nthe associated musical interval (major second, major\nthird, etc). When the Formant slider is set to zero,\nformants are preserved independently of pitch\ntransposition (known as \"formant-corrected pitch\ntransposition\").\nPitch Correction Controls\nThis group of controls is used for correcting problems\nwith the pitch of the reference source being fed into\nPitchCraft.\nCorrect Pitch On/Off checkbox\nThis control allows enabling/disabling all Pitch Cor-\nrection controls.\nTuning Pop-Up Menu\nThis menu allows you to choose the desired type of\ntuning to be used in the pitch correction process.\nTuning is expressed in number of cents with respect to\nthe equal-tempered note, for each of the twelve notes,\nand includes the following options:\n-\nEqual - 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0\n-\nClassic Just - 0, -29, 4, 16, -14, -2, -10, 2, 14, -16, 18, -12\n-\nHarmonic - 0, 5, 4, -2, -14, -29, -49, 2, 41, 6, -31, -12\n-\nIndian Raga - 0, -10, 4, -6, -16, -2,-12, 2, -8,-18, -4, -14\n-\nArabic - 0, 30, -20, -50, -45, 2, 23, 6, -14, -43, -70, 10\n-\nBali/Java - 0, 27, -58, -42, -123, -130, -126, -211, 24, -61, -57, -142\n-\nTibetan - 0, -42, 32, 10, -22, 22, 18, 25, -27, -4, 19, -14\n-\nCarlos Alpha - 0, -12, -44, -66, -88, -110, -132, -164, -176, -198, -220, -242\n-\nPythagorean - 0, -10, 4, -6, 8, -2, 12, 2, -8, 6, -4, 10\n-\nMean - 0, -24, -7, 10, -14, 3, -21, -3, -27, -10, 7, -17\nScale Pop-Up Menu\nThis menu allows you to choose the desired scale to be\nused in the pitch correction process. Scales are\nexpressed in number of semitones with respect to the\nroot note\n-\nChromatic - All Notes\n-\nMajor - 1, 2, 3, 4, 5, 6, 7\n-\nDorian - 2, 3, 4, 5, 6, 7, 1\n-\nPhrygian - 3, 4, 5, 6, 7, 1, 2\n-\nLydian - 4, 5, 6, 7, 1, 2, 3\n-\nMixolydian - 5, 6, 7, 1, 2, 3, 4\n-\nMinor - 6, 7, 1, 2, 3, 4, 5\n-\nLocrian - 7, 1, 2, 3, 4, 5, 6\n-\nWhole Tone - 2, 4, 6, 8, 10\n-\nBlues - 3, 5, 6, 7, 10\n-\nHarmonic Minor - 2, 3, 5, 7, 8, 11\n-\nMelodic Minor - 2, 3, 5, 7, 9, 11\n-\nMajor Pentatonic - 2, 4, 7, 9\n-\nMinor Pentatonic - 3, 5, 7, 10\nChapter 4: PitchCraft\n\n-\nMajor Bebop - 2, 4, 5, 7, 9, 10, 11\n-\nDominant Bebop - 2, 4, 5, 7, 9, 10, 11\n-\nSuper Locrian - 1, 3, 4, 6, 8, 10\n-\nDiminished - 2, 3, 5, 6, 8, 9, 11\n-\nHungarian Minor - 2, 3, 6, 7, 8, 11\n-\nArabian - 2, 4, 5, 6, 8, 10\nKey Pop-Up Menu\nThis menu allows you to choose the root note of the\nscale selected in the Scale pop-up menu. Options\ninclude:\n-\nA\n-\nA#\n-\nB\n-\nC\n-\nC#\n-\nD\n-\nD#\n-\nE\n-\nF\n-\nF#\n-\nG\n-\nG#\nPitch Correction Time Slider\nThis control allows you to adjust the speed at which\npitch correction is applied.\nDetune Slider\nThis control allows you to adjust the reference frequency\nused for tuning (i.e., from 440Hz to 445Hz). This\ncontrol should be adjusted only if attempting to match\nthe pitch with another source that is not in \"concert\npitch\" (i.e., not tuned to A 440).\nKeyboard Controls\nThe Keyboard controls are used for defining custom\nnotes and scales to be used in the pitch correction\nprocess. These controls are described below.\nIgnore Note Checkboxes\nThese checkboxes allow certain notes to be ignored in\nthe pitch correction process, even when they are present\nin the scale being used. The presence of a check in an\nIgnore checkbox means that the note represented by the\nkey that appears directly below it in the interface will be\nignored. The absence of a check means the note will be\nused in the pitch correction process.\nKeyboard Display\nThe virtual keyboard is used to display the active notes\nbeing used in the pitch correction process, and can also\nbe used to define a custom scale for pitch correction.\nUse Note in Scale Indicators\nThe Use Note in Scale indicators appear as orange dots\nsuperimposed over keys in the Keyboard display. Scales\ncan be created or modified using any MIDI device, such\nas Peak's MIDI keyboard window, or a MIDI\ncontroller/keyboard. Any MIDI \"Note On\" message from\na controller or sequence is added to the current scale, if\nthe note is already part of the current scale, the \"Note\nMaster Perfection Suite User's Guide\n\nOn\" message will remove it from the current scale.\nWhen a Use Note in Scale indicator appears over a key,\nthat key's note is detected and its pitch is corrected.\nWhen an indicator does not appear over a key, that note\nis not part of the current scale.\nCustom Scale Controls\nThese controls allow the creation of a custom scale to be\nused for pitch correction. Custom scales are\nautomatically saved into the Scale pop-up menu, and\nmay be recalled for use later.\nCurrent Scale Display\nDisplays the name of the current scale, as well as\nappropriately placed Use Note in Scale indicators over\nthe keys/notes in the active scale.\nUsing PitchCraft\nThis section includes hands-on directions for\naccomplishing common pitch modification tasks.\nTo Define a Scale:\n-\nChoose the desired Scale Preset from the Scale\npop-up menu.\nTo Define a Custom Scale:\n1a. Click the desired keys in PitchCraft's virtual\nkeyboard - clicking a key toggles the Use Note in\nScale indicators into the On or Off position.\nOr:\n1b. Click the keys of a MIDI input device (such as\nPeak's virtual MIDI keyboard) - the MIDI Note On\nmessages toggle the Use Note in Scale indicators\ninto the On or Off position.\n2.\nWhen you have finished defining your custom\nscale, click the Done button - the custom scale is\nadded to the Scale menu as a preset.\nTo Correct Pitch:\n1.\nSelect the appropriate type of reference source\nfrom the Reference Source pop-up menu.\n2.\nSelect the appropriate pitch range for the\nreference source, using the Pitch Range pop-up\nmenu.\n3.\nEnable the Correct Pitch section, by checking the\nCorrect Pitch checkbox.\n4.\nDefine a scale or set of notes using the Scale, Key,\nand Keyboard controls.\n5.\nPlay the audio source. As audio enters the plug-in\nand is analyzed, the current pitch is displayed in\nthe Tuning History Graph. The plug-in determines\nwhich note in the current scale is \"correct\" and\napplies the appropriate amount of pitch correction\nto the input source, to match the note in the scale.\nThe Pitch Correction Time control can be used to\nsmooth out the correction effect if the pitch\nbecomes \"warbly\". It can also be used to create\ninteresting \"robotic\" voice effects by setting the\npitch correction time to zero.\nThe Transpose and Correct Pitch sections may be\nenabled simultaneously, with transposition and formant\nmodification being performed in parallel with pitch\ncorrection. Advanced features include the ability to\ndetune the reference frequency (for example from A =\n440Hz to 443Hz), the ability to define the scale via a MIDI\ncontroller, and the ability to save up to 4 temporary\npresets.\nChapter 4: PitchCraft\n\nPitchCraft is designed for monophonic sources\nand it will not work on polyphonic material.\nPlease keep in mind that material with excessive\nreverb or background noise is not considered\nmonophonic. It is advised that you clean up the\naudio signal as much as possible before processing\nit with this algorithm. PitchCraft may produce\ninteresting creative effects when used with\npolyphonic audio material, but keep in mind this\nis an algorithm carefully designed for transparent\nprocessing of monophonic sounds.\nTo Transpose Pitch and/or Formant:\n1.\nSelect the appropriate type of reference source\nfrom the Reference Source pop-up menu.\n2.\nSelect the appropriate pitch range for the reference\nsource, using the Pitch Range pop-up menu.\n3.\nEnable the Transpose section of the interface, by\nchecking the Transpose checkbox.\n4.\nAdjust the Pitch and/or Formant sliders until the\ndesired effect is achieved.\nVoice Modification Using the Pitch &\nFormant Controls\nThe Pitch and Formant controls can produce very\ninteresting special effects, especially when the source is a\nrecording of a human voice. When using these controls\nfor modifying a human voice, the following guidelines\nmay be useful:\n-\nTransposing pitch upward is the equivalent of\nshortening vocal cords\n-\nTransposing pitch downward is the equivalent of\nlengthening vocal cords\n-\nShifting formants upward is the equivalent of\nreducing the size of the vocal cavity\n-\nShifting formants downward is the equivalent of\nenlarging the size of the vocal cavity\nSome examples of voice modification possibilities are\nlisted below:\nTo Transform a Female Voice into a Male Voice:\n1.\nUsing the Pitch slider, transpose pitch downward\nsubstantially.\n2.\nMove Formant slider down until a natural sound is\nachieved, (which usually occurs when the Formant\nslider's value is slightly smaller than the Pitch\nslider's value).\nTo Transform a Male Voice into a Female Voice:\n1.\nUsing the Pitch slider, transpose pitch upward.\n2.\nMove the Formant slider up until a natural sound is\nachieved.\nTo Transform an Adult's Voice into a Child's Voice:\n-\nRaise the Formant slider's value - notice how \"age\"\ndecreases as the formant value increases.\nTo Transform a Child's Voice into an Adult's Voice:\n-\nLower the Formant slider's value - notice how\n\"age\" increases as the formant value decreases.\nTo Transform a Human Voice into an \"Alien\" Voice:\n1.\nRaise the Pitch value all the way (i.e., slider all the\nway to the right).\n2.\nLower the Formant value all the way (i.e., slider all\nthe way to the left).\nTo Disguise a Human Voice:\n1.\nLower the Formant value slightly.\n2.\nAdjust Pitch value to suit level of voice disguise.\nMaster Perfection Suite User's Guide\n\nChapter 5:\nRepli-Q\nIntroduction\nRepli-Q is a powerful EQ matching/spectral balancing\nplug-in, which is designed to analyze, edit, and compare\nthe spectral content of audio recordings. Once analysis\nhas taken place, spectral characteristics of one recording\nmay be applied to another. By viewing the frequency\nspectrum plotted as graphical data (and by listening of\ncourse), a user can discern where there are peaks,\n\"holes\", or other problems in the spectral content of the\nrecording. Various steps in the recording and mastering\nprocess can result in problems such as studio resonance\ncaused by the natural comb filtering effect of a poorly\nshaped recording/listening environment - or equa-\nlization used to compensate for a studio's equipment\nand environmental deficiencies. Repli-Q allows these\nsorts of spectral problems to be located and repaired\nusing its high quality linear-phase filters.\nSome common examples of how Repli-Q might be used\nare:\n-\nMimicking and applying a favorite artist's spectral\n(EQ) \"style\" to your own recordings.\n-\nIn the mastering process, it can give a cohesive\nsound to a collection of songs that may have been\nrecorded and mixed in different locations/\nenvironments.\n-\nIt can be used to create a collection of profiles -\nmicrophones, for example. These profiles may\nlater be applied to audio recordings to give them\nthe characteristic sound of a particular type of\nmicrophone.\nRepli-Q matching profiles may be created for other types\nof equipment, such as consoles, compressors, recording\nenvironments, etc.\nRepli-Q User Interface & Controls\nRepli-Q is designed to be intuitive and easy to use. This\nsection discusses the graphical user interface, and will\nfamiliarize you with each of the various controls.\nGlobal Controls\nRepli-Q features a variety of controls designed for\nspecific tasks, and also features a number of \"global\"\ncontrols, that affect the state of the entire plug-in. Below\nis a brief description of these \"global\" tools, and how\nthey operate.\nA/B/C/D Compare Buttons\nThe A/B comparison feature is common in audio\nprograms, and gives the ability to preview different\nsettings before committing to them. Essentially, various\ntool settings are made and stored as snapshot \"A\" -\nChapter 5: Repli-Q\n\nMaster Perfection Suite User's Guide\nRepli-Q Graphical User Interface\nReference Pop-Up Menu\nSave EQ Button\nEQ Pop-Up\nMenu\nSpectrum/EQ View Radio Buttons\nGraphic Display\n(Showing Profile\nDisplay)\nMatching\nSlider/Numerical\nField\nSmoothing\nSlider/Numerical\nField\nGain Slider/\nNumerical Field\nGain Compensation Checkbox\nSoft Clip\nCheckbox\nInput Meters\nOutput Meters\nA/B/C/D Compare Buttons\nFactory Preset Pop-Up Menu\nUser Preset Controls\nBypass Button\nLearn Spectrum\nButton\nSave Spectrum Button\nGreen = Input's Spectral Profile\nYellow = Reference's Spectral Profile\nBlue = Output's Spectral Profile\nFactory Preset Selection Arrows\nZoom Button\n\nanother group of settings can then be assigned as\nsnapshot \"B\" - and then clicking the A or B buttons in\nthe interface instantly toggles between the two. As Repli-\nQ offers many fine-tuning options, it features not just\ntwo comparison modes - but instead includes A/B/C/D\ncomparisons, for four unique snapshots to compare\nbetween, before committing to any file processing.\nThese snapshots are similar to saving and loading\npresets, but are instantaneous, and do not require\nselecting presets from a menu to load them. To\npermanently save one of these snapshots, simply select\nthe desired snapshot, and save it as a custom User Preset.\nFactory Preset Pop-Up Menu\nThis menu displays the current factory preset, if one has\nbeen selected. Clicking this menu shows a list of all\navailable factory presets. A factory preset may be\nselected by choosing it from this pop-up menu.\nFactory Preset Selection Arrows\nThese arrows are used to navigate through factory\npresets. Clicking the down arrow moves to the next\navailable factory preset, and clicking the up arrow moves\nto the previous factory preset.\nUser Preset Save Button\nSaves a user preset, which includes the state of all\nRepli-Q parameters.\nUser Preset Load Button\nRecalls a user preset, which includes the state of all\nRepli-Q parameters.\nUser presets do not appear in the Factory Preset\npop-up menu, so be sure you are aware of the\ndirectory where you are saving them into, so they\nmay be recalled easily later.\nBypass Button\nThe Bypass button is used to temporarily disable the\nplug-in. When the plug-in is bypassed, audio is not\naffected.\nProfile Controls\nThe Profile controls are used for learning, saving, and\nloading spectral and EQ profiles, as well as for matching\nand smoothing between different profiles. This section\ndiscusses each control's function.\nLearn Spectrum Button\nThis control analyzes the spectral content of the audio\nsource being fed into Repli-Q. When the Learn Spectrum\nbutton is clicked, Repli-Q immediately begins analyzing,\nor \"learning\" the input signal.\nWhen audio playback is stopped, Peak is still\nsending digital silence (a zero amplitude signal\nfor all samples) to the plug-in. If the Learn\nSpectrum button has been clicked, Repli-Q is\nlearning the spectrum of digital silence - which is\na flat spectrum of very low amplitude (-96 dB). If\nplayback starts, Repli-Q continues averaging the\nactual signal spectrum with the already averaged\nflat -96 dB spectrum. The resulting final spectral\naverage will be false.\nThe recommended way to operate Repli-Q is:\n- Start playback first, and then click the Learn\nSpectrum button, in that order. Then, click the\nLearn Spectrum button again to stop learning.\n- In other words, once the Learn Spectrum button\nChapter 5: Repli-Q\n\nis clicked, start playback immediately, and when\nplayback is stopped (or ends on its own), click the\nLearn Spectrum button again to stop the learning\nprocess.\nSave Spectrum Button\nThis control saves the current spectrum as a Repli-Q\nSpectral Profile, and automatically places it in the\nReference pop-up menu as the current/active profile.\nReference Pop-Up Menu\nThis pop-up menu contains all Repli-Q Spectral Profiles\ncreated during the current session (i.e., since the plug-in\nwas instantiated) - and also allows loading Spectral\nProfiles saved in earlier sessions.\nSave EQ Button\nThis button saves the current EQ settings as a Repli-Q EQ\nProfile, and automatically loads it in the EQ pop-up menu\nas the current/active profile.\nEQ Pop-Up Menu\nThis pop-up menu contains all Repli-Q EQ Profiles\ncreated during the current session (i.e., since the plug-in\nwas instantiated) - and also allows loading EQ Profiles\nsaved in earlier sessions.\nMatching Slider/Numerical Field\nThis control allows variable spectral matching between\nan input source's profile and a reference file's profile.\nBy default, the Matching slider is set to 50%.\nSliders can be reset to their default values by\nOption-clicking on them.\nWhen numerical fields are in an editable state\n(i.e., after clicking in them with the mouse), their\nvalues may be changed by typing in new values,\nby using the Up/Down Arrow keys on your\nkeyboard, or by using the scroll wheel on a Mac OS\nX-compatible scroll wheel mouse.\nSmoothing Slider/Numerical Field\nThis control allows variable EQ smoothing, and helps to\nprevent resonance artifacts.\nBy default, the Smoothing slider is set to 0%.\nGain Slider/Numerical Field\nThis control increases or decreases the output level.\nBy default, the Gain slider is set to 0dB, and has a range\nof -20 to 20 dB.\nGain Compensation Checkbox\nWhen active, this control compensates for gain differences\nintroduced by an EQ setting, and makes the output level\nidentical to the input level. The presence of a check in this\nbox means that Gain Compensation is active.\nSoft Clip Checkbox\nWhen active, this control acts as a soft limiter to ensure\nthat the output level does not clip due to gain differences\nintroduced by an EQ setting. The presence of a check in\nthis box means that Soft Clip is active.\nSpectrum/EQ View Radio Buttons\nThese radio buttons allow choosing between viewing of\nspectral profiles and EQ profiles.\nMaster Perfection Suite User's Guide\n\nGraph Display\nThe Graph Display operates in two modes, Spectral\nProfile Mode and EQ Profile Mode. The mode depends\non which of the Spectrum/EQ View radio buttons is\nselected. Various elements of the Graph Display Area\nchange depending on the mode being used.\nSpectrum Profile View Mode Display\nIn Spectrum View Mode, spectral data is shown in the\ngraph. The X-axis is labeled in Hz (Frequencies), and the\nY-axis is labeled in dB (decibels). Three different colored\nlines are plotted in the Spectrum graph, each represents\na unique spectral profile.\nYellow - Represents the spectral profile of the\nReference file, which has the desirable\ncharacteristics you are attempting to match, and\neventually apply to another file (i.e., which is\nreferred to here as the \"Input\" file).\nGreen - Represents the spectral profile of the Input\nfile, which is the file onto which you are attempting\nto apply the Reference's desirable spectral\ncharacteristics.\nBlue - Represents the average spectrum of the\nOutput profile (i.e., the actual degree of matching\nbetween the Input and the Reference). The\nposition of the Blue line within the graph is linked\nto the position of the Matching slider, and indicates\nthe current output spectrum. When the Matching\nslider is set to 0%, it matches the Input's (Green\nline) spectral characteristics perfectly. When set to\n100%, it matches the Reference source's (Yellow\nline) spectral characteristics perfectly. When the\nMatching slider is set somewhere between 0 -\n100%, it represents a blend of both the Reference\nand Input's spectral characteristics.\nEQ View Mode Display\nIn EQ View Mode, frequency data is shown in the graph.\nThe X-axis is labeled in Hz (Frequencies), and the Y-axis is\nlabeled in dB (decibels). The frequency data shown in the\ngraph depends on the position of the Matching slider.\nWhen the Matching slider is set to 0%, the frequency data\ndisplayed belongs to the spectral \"Input\". When it is set to\n100%, the frequency data shown belongs to the spectral\nReference. When the Matching slider is set to some value\nbetween 0 - 100%, a blend of the frequency content of\nboth the Input and Reference is displayed.\nEditing EQ Filtering Properties\nIn EQ View Mode, clicking on the graph display allows\nediting of the EQ's filtering properties.\n-\nClick in EQ Graph - Displays the current EQ\nprofile's filtering properties, such as frequency,\ngain, and Q (bandwidth).\n-\nClick & Drag in EQ Graph - This allows editing the\nEQ profile's frequency and gain filtering properties.\n-\nShift-Click & Drag in EQ Graph - This allows\nediting the EQ profile's frequency and Q\n(bandwidth) filtering properties.\nZoom Button\nZooming in or out is accomplished using the Zoom\nButton, located at the point where the X and Y-axes meet.\nThis control allows a very detailed zoomed-in view, or can\nChapter 5: Repli-Q\n\nbe zoomed-out for a \"big picture\" view. Option-clicking\non the Zoom Button resets the zoom level.\n-\nZoom In Horizontally - Click and drag to the right\n-\nZoom Out Horizontally - Click and drag to the left\n-\nZoom In Vertically - Click and drag up\n-\nZoom Out Vertically - Click and drag down\nUsing Repli-Q\nThis section contains some basic \"hands-on\" getting\nstarted tips, and introduces some typical Repli-Q\nworkflows.\nTo Match the Spectrum of an Audio File:\n1.\nOpen a Reference file in Peak and select the\nportion to be used as a Reference - the\n\"Reference\" file being the one with the desirable\nspectral characteristics that you wish to apply to\nanother file.\nNote that different sections of a Reference file may\nhave differing spectral characteristics. You may\nwish to denote specific portions of the reference\nfile using Peak's Markers or Regions.\n2.\nInstantiate Repli-Q, and start playback of the\nreference file in Peak.\n3.\nClick the Learn Spectrum button - the spectral\nprofile is plotted as Repli-Q learns it.\n4.\nClick the Learn Spectrum button again to end the\nspectral \"learning\" process.\n5.\nClick the Save Spectrum button to save the learned\nspectral profile - it will automatically be loaded\ninto the Reference pop-up menu as the\ncurrent/active spectral reference profile. This\nprofile is plotted as a yellow line in the Graph\ndisplay.\n6.\nOpen another audio file in Peak - this will be the\nmaterial onto which we apply the Reference audio\nfile's desirable spectral characteristics.\n7.\nClick the Learn Spectrum button and start\nplayback, the Input file's spectral profile is plotted\nas a green line in the Graph display.\n8.\nClick the Learn Spectrum button again to end the\nlearning process. As soon as the second learning\nprocess is stopped, the Output spectrum's profile\nis immediately calculated (appears as a blue line in\nthe graph display). At this point, the Graph display\nwill show three differently colored plotted lines -\nyellow is the Reference profile, green is the Input\nprofile, and blue is the output profile (whose\ncorresponding EQ characteristics will be applied to\nthe Input file when the plug-in is active). Each of\nthe spectral profiles' corresponding EQ profiles\nmay be viewed by switching to the EQ Graph\nDisplay (by using the EQ View radio button above\nthe Graph Display).\n9.\nIn the Spectral Profile Graph, use the Matching\nslider to adjust the degree of matching between\nthe Reference and Input profiles - when the\nMatching slider is at 0%, the Output profile (blue\nline) coincides with the Input profile (green line),\nwhich means that the Input will not be modified.\nWhen the slider is at 100%, the Output profile is\nidentical to the Reference profile (yellow line),\napplying maximum equalization matching to the\nInput.\n10.\nUse the Smoothing slider to smooth the Output\nprofile (blue line) if it presents too many sharp\npeaks and dips, which can cause undesirable\nresonance, or inconsistent performance over\ndifferent sets of reference monitors.\nFor additional control, the EQ profile's properties may be\nmanually edited - described in additional steps below.\nMaster Perfection Suite User's Guide\n\n11.\nIn the EQ Graph Display, click and drag to modify\nEQ gain properties (and/or shift-click and drag to\nmodify the EQ's bandwidth filtering properties).\n12.\nRepli-Q is now ready for processing - play back the\ninput and the new EQ settings will be applied.\nAt any point after learning the Input and\nmatching/smoothing/editing the EQ, that EQ may\nbe saved with the Save EQ button. This is useful\nwhen the same EQ is needed in the future. Saving\nthe EQ is not required for processing the current\nInput, however, if not saved, the current EQ will be\nlost when learning a different spectral profile, or\nde-instantiating the plug-in.\nTo Process Using a Saved EQ Profile:\n1.\nInstantiate Repli-Q and load a saved EQ profile\nusing the EQ pop-up menu.\n2.\nMatch, smooth and edit the EQ as desired -\nmatching will simply scale the EQ between a flat\n0dB curve and the loaded EQ profile.\n3.\nOpen an input file in Peak and play back - the\nloaded EQ profile is applied.\nTo Use Repli-Q as an Editable Linear Phase EQ:\n1.\nInstantiate Repli-Q and select the EQ Graph\nDisplay - a flat 0dB curve is displayed.\n2.\nPlay back audio material that needs EQ changes,\nand perform as many manual edits to the EQ curve\nas desired until the desired effect is achieved.\n3.\nBounce the plug-in - the custom EQ settings are\napplied.\nTo Automatically Compensate for Gain Changes:\n-\nCheck the Gain Comp checkbox - gain changes\nintroduced by EQ settings are compensated for\nautomatically,\nkeeping\nthe\noutput\nlevel\napproximately equal to the input level. This is\nuseful in evaluating actual differences in EQ\ncharacteristics independently of differences in\nloudness - as increases in loudness sometimes\ntranslate to \"better sounding\".\nTo Prevent Clipping the Output Signal:\n-\nCheck the Soft Clip checkbox - potential clipping\ncaused by EQ settings that boost output amplitude\nis now avoided.\nTo Manually Control Output Level:\n1.\nUncheck the Gain Comp checkbox.\n2.\nUse the Gain slider to adjust the output to the\ndesired level.\nConclusion\nNow that you are familiar with the various Repli-Q\ncontrols, and its basic workflow, please continue along to\nthe next chapter, where you will learn about the Reveal\nplug-in.\nChapter 5: Repli-Q\n\nChapter 6:\nReveal\nIntroduction\nReveal offers an integrated solution to spectral, power,\nand phase analysis. Its components can be broken down\ninto three categories:\nFrequency Analysis Tools\n-\nOscilloscope\n-\nSpectral Analyzer (Graph & Meter Displays)\n-\nSpectrogram\nLevel Analysis Tools\n-\nPeak and RMS Level History Display\n-\nPeak and RMS Level Meters\nPhase & Pan Analysis Tools\n-\nLissajous Phase Scope\n-\nPan Power History Display\nThis combination of tools provides audio engineers with\nall the elements needed to analyze recordings (or live\ninput), and is indispensable during the audio production\nprocess. Audio engineers typically use these types of\nanalysis tools in the following scenarios:\n-\nIn the studio, they are used to determine problem\nareas in a mix, or to observe how processing or\nmixing is affecting the audio content.\n-\nThe tools may also be used for analyzing real-time\nlive input, in order to analyze room acoustics, and\npotential phase issues due to speaker placement\nand speaker tuning.\nIt takes a combination of audio analysis tools to get a\ncomprehensive understanding of audio content, and\nReveal provides them all, in a single easy-to-use plug-in.\nReveal User Interface & Controls\nReveal is designed to be intuitive and easy-to-use. This\nsection discusses the graphical user interface, and will\nfamiliarize you with each of the various controls.\nGlobal Controls\nReveal includes many controls designed for specific\ntasks, and also features several \"global\" controls, that\naffect the state of the entire plug-in. Below is a brief\ndescription of these \"global\" tools, and how they\noperate.\nChapter 6: Reveal\n\nMaster Perfection Suite User's Guide\nReveal Graphical User Interface\nInput Source\nPop-Up Menu\nGlobal Freeze Button\nA/B/C/D\nCompare Buttons\nOscilloscope\nMini-Display\nPeak & RMS\nPower History\nMini-Display\nLevel Meters\nMini-Display\nMeter Range\nPop-Up Menu\nSpectrogram\nMini-Display\nPan Power\nMini-Display\nSpectral\nAnalysis Mini-\nDisplay\nLissajous\nPhase Scope\nMini-Display\nView All\nDisplays Tab\nOscilloscope\nTab\nPeak & RMS\nPower History Tab\nPeak/RMS Level\nMeters Tab\nSpectrogram\nTab\nPan Power\nTab\nSpectral\nAnalysis Tab\nLissajous Phase\nScope Tab\nFactory Preset\nPop-Up Menu\nFactory Preset\nArrows\nBypass\nButton\nUser Preset\nControls\nZoom Button\nResolution Pop-Up Menu\n\nResolution Pop-Up Menu\nThis control sets the graphical resolution used in\nReveal's various displays. The resolution may be\nadjusted to suit the CPU of the computer on which\nReveal is being used. Higher resolution settings are\nintended for faster CPUs, and lower settings are intended\nfor slower CPUs - you may want to experiment with this\nsetting to get the best results for your particular\ncomputer system.\nGlobal Freeze Button\nClicking the Global Freeze button temporarily stops\nmovement in all displays, allowing for closer examination\nof their data. Clicking this button again resumes activity\nin all displays.\nInput Source Pop-Up Menu\nThis menu allows you to choose whether the input\nsource (i.e., the signal being fed into Reveal for analysis)\nis a single (left or right) channel of a stereo file, or both\nchannels simultaneously.\nIf you are working with a mono file, be sure to set\nthe Input Source pop-up menu to \"Left\".\nZoom Buttons\nTechnically, these are not \"global\" controls, but they\nappear in several of Reveal's tools, so they will be\ncovered here.\nZooming and scrolling is possible within tools that\nfeature this control, which allows a very detailed\nzoomed-in view, or can be zoomed-out for a \"big picture\"\nview. Zooming is accomplished using the Zoom Button,\nlocated at the point where the X and Y-axes meet.\nOption-clicking on the Zoom Button resets the zoom\nlevel.\n-\nZoom In Horizontally - Click and drag to the right\n-\nZoom Out Horizontally - Click and drag to the left\n-\nZoom In Vertically - Click and drag up\n-\nZoom Out Vertically - Click and drag down\nA/B/C/D Compare Buttons\nThe A/B comparison feature is common in audio\nprograms, and gives the ability to preview different\nsettings before committing to them. Essentially, various\ntool settings are made and stored as snapshot \"A\" -\nanother group of settings can then be assigned as\nsnapshot \"B\" - and then clicking the A or B buttons in\nthe interface instantly toggles between the two. As\nReveal offers many fine-tuning options, it features not\njust two comparison modes - but instead includes\nA/B/C/D comparisons, for four unique snapshots to\ncompare between, before committing to any file\nprocessing. These snapshots are similar to saving and\nloading presets, but are instantaneous, and do not\nrequire selecting presets from a menu to load them. To\npermanently save one of these snapshots, simply select\nthe desired snapshot, and save it as a custom User Preset.\nFactory Preset Pop-Up Menu\nThis menu displays the current factory preset, if one has\nbeen selected. Clicking this menu shows a list of all\navailable factory presets. A factory preset may be\nselected by choosing it from this pop-up menu.\nFactory Preset Selection Arrows\nThese arrows are used to navigate through factory\npresets. Clicking the down arrow moves to the next\nChapter 6: Reveal\nThe Zoom Button appears in several of Reveal's tools, and allows\nzooming along the X & Y-axes.\n\navailable factory preset, and clicking the up arrow moves\nto the previous factory preset.\nUser Preset Save Button\nSaves a user preset, which includes the state of all Reveal\nparameters.\nUser Preset Load Button\nRecalls a user preset, which includes the state of all\nReveal parameters.\nUser presets do not appear in the Factory Preset\npop-up menu, so be sure you are aware of the\ndirectory where you are saving them into, so they\nmay be recalled easily later.\nBypass Button\nThe Bypass button is used to temporarily disable the\nplug-in. When the plug-in is bypassed, audio playback is\nnot analyzed by the plug-in.\nTool-Specific Controls & Displays\nWhile all of Reveal's analysis tools may be viewed\nsimultaneously in the View All Displays Tab, you may also\nview each tool independently. Viewing a single tool\noffers a much larger display area, which can translate into\nmore accurate data interpretation. Having this option\nallows you to view many types of data simultaneously, or\na single type of data in great detail.\nNavigating between the various tools can be done in two\nways - clicking a tool's mini-display in the View All\nDisplays Tab will take you to that tool's full size display -\nor, clicking the desired tool's tab in the lower part of the\nReveal interface will do the same. In this section, we'll\ntake a look at each of Reveal's tools.\nOscilloscope Tool\nThe Oscilloscope displays a trace-style scope waveform.\nLeft channel data is displayed in green, and right channel\ndata is displayed in red. The graph display's X-axis\nmeasures amplitude, and is labeled in dB (decibels),\nwhile the Y-axis measures time, and is labeled in samples.\nPeak and RMS Power History Tool\nThis tool analyzes an audio file's Peak and RMS (\"Root\nMean Square\" or average) level history. By plotting the\nPeak and RMS levels in a graph it's possible to monitor the\nperceived volume of an audio signal over a period of time.\nThe data plotted in the graph display area includes:\n-\nLeft Channel Peak Level - Orange\n-\nRight Channel Peak Level - Red\n-\nLeft Channel RMS Level - Yellow\n-\nRight Channel RMS Level - Pink\nMaster Perfection Suite User's Guide\nReveal's Oscilloscope Display\nReveal's Peak and RMS Power History Tool Display\n\nThe graph display's X-axis measures amplitude, and is\nlabeled in dB (decibels), while the Y-axis measures time,\nand is labeled in minutes and seconds. The precision of\nthe intervals along each axis varies, and depends on the\nzoom level being used.\nSpectrogram Tool\nThe Spectrogram analyzes an audio file's spectral\ncontent, and displays it in a graph. A color gradient is\nused to represent the varying amount of power present\nin different parts of the frequency spectrum. Red\nrepresents the highest amplitude for a given frequency,\nwhile green represents the lowest amplitude.\nAnalysis Window Slider/Numerical Field\nThe Analysis Window control allows varying frequency\nresolution versus time (attack/decay) resolution. The\nhigher the Analysis Window setting, the more frequency\nresolution and the less time resolution is displayed, and\nvice-versa.\nA higher Analysis Window setting means that partials/\nharmonics (i.e., sine waves) with very close frequencies\nwill be seen as separate peaks in the spectrum (each\npeak is a lobe about 7 spectral points wide). If the\nAnalysis Window setting is steadily decreased, at some\npoint the peaks will merge into one large lobe, and it will\nbe impossible to distinguish whether separate partials\nexist.\nA lower Analysis Window setting means that two attacks\nwhich occur very close to each other in time will be seen\nas two separate events (i.e., the spectrum will jump up,\ndecay, and jump up again). If the Analysis Window\nsetting is steadily increased, at some point the two\nattacks will be within one Analysis Window, and the\nspectrum will only go up once.\nTherefore, if partials/harmonics are important for the\nanalysis you are performing, the Analysis Window setting\nshould be increased until separate spectral peaks are\nvisible. Too big of an Analysis Window averages too\nmuch of the signal, so fast changes (attacks or fast pitch\nvariations) merge into one blurry spectrum.\nFor monophonic signals, the Analysis Window setting\nshould be around 4 periods of signal (on average, since\nthe pitch is changing) for adequate frequency resolution\n(i.e. so that the partials are seen as separate peaks in the\nspectrum).\nBy default, the Analysis Window slider is set to 50ms, and\nhas a range of 10 - 100ms.\nThe graph display's X-axis measures frequency, and is\nlabeled in Hz (Hertz), while the Y-axis measures time,\nand is labeled in minutes and seconds. The precision of\nthe intervals along each axis varies, and depends on the\nzoom level being used.\nSliders can be reset to their default values by\nOption-clicking on them.\nWhen numerical fields are in an editable state\n(i.e., after clicking in them with the mouse), their\nvalues may be changed by typing in new values,\nby using the Up/Down Arrow keys on your\nkeyboard, or by using the scroll wheel on a Mac OS\nX-compatible scroll wheel mouse.\nPan Power/Phase Correlation Tool\nThis tool analyzes phase correlation and balance\nbetween a stereo signal's left and right channels. Phase\ncorrelation data is shown in the Phase Correlation Meter.\nChapter 6: Reveal\nReveal's Spectrogram Display\n\nMaximum correlation (i.e., a strong \"In Phase\" reading)\nmeans the left and right signals are identical. Zero\ncorrelation (i.e., a strong \"Out of Phase\" reading) means\nthe signals are completely unrelated (i.e., panned hard\nleft or right). Pan power data is shown in the Pan Power\nGraph. If both channels contain equal power, the meter\nreading is centered. If one channel contains more power\nthan the other, the meter reading appears stronger for\nthat channel.\nThe Phase Correlation meter displays correlation as a\npercentage, either in phase or out of phase.\nThe Pan Power graph display's X-axis measures pan\npower as a percentage, while the Y-axis measures time,\nand is labeled in minutes and seconds. The precision of\nthe intervals along the Y-axis varies, and depends on the\nzoom level being used.\nSpectral Analysis Tool\nThe Spectral Analysis tool analyzes frequency content\ncontained in an audio file, and displays it in the form of a\nSpectral Meter or Spectral Graph. Left channel data is\ndisplayed in green, and right channel data is displayed in\nred.\nDisplay Pop-Up Menu\nThis control allows configuring the Spectral Meter or\nGraph to display Instantaneous, Peak, or Average levels.\nResponse Time Slider/Numerical Field\nThe Response Time control is used to set how quickly\nthe display responds, as it receives and analyzes audio\nsignals. A low setting causes it to react relatively quickly,\nand a high setting causes a slower reaction.\nBy default, this slider is set to 50ms, and has a range of 10\n- 100ms.\nAnalysis Window Slider/Numerical Field\nThe Analysis Window control sets the amount of data\nbeing analyzed, and allows varying frequency resolution\nversus time (attack/decay) resolution. The higher the\nAnalysis Window setting, the more frequency resolution\nand the less time resolution is displayed, and vice-versa.\nA larger Analysis Window will better separate\npartials/harmonics, but will also average spectral\nvariations within the duration of the window.\nA shorter Analysis Window will better separate spectral\nvariations over time (i.e., will more clearly show an attack\nof the piano as a sudden rise of the middle portion of the\nspectrum), but will not separate partials as well, and\neventually, with a short enough setting, discrete spectral\npeaks for each partial will not be visible.\nA good rule of thumb is to make this window three to\nMaster Perfection Suite User's Guide\nReveal's Pan Power and Phase Correlation Display\nReveal's Spectral Analysis Tool - showing the Spectral Meter Display\nThe Spectral Analysis Tool's Spectral Graph Display\n\nfour times the average pitch period in the signal. Some\ncommon examples include:\n-\nFemale vocals - (around 300 Hz pitch), the\nwindow should be around 4/300, or 0.01333\nseconds, or 13.33 milliseconds long.\n-\nBass - (around 50 Hz), the window should be\naround 4/50 or 0.08, or 80 milliseconds long.\n-\nComplete Mix - Use the lowest-pitch instrument\n(usually the bass) as the guideline for setting the\nAnalysis Window size.\nThe graph display's X-axis measures frequency, and is\nlabeled in Hz (Hertz), while the Y-axis measures\namplitude, and is labeled in dB (decibels).\nLissajous Phase Scope Tool\nThe Phase Scope tool displays the amplitude and phase\nof two signals (i.e., the left and right channels of a stereo\nsignal) as a Lissajous pattern, in which the left channel's\nfrequency data is plotted along the graph's Y-axis, and\nthe right channel's is plotted along the X-axis. Lissajous\npatterns are useful for determining phase and amplitude\nrelationships between the left and right signals of a\nstereo pair.\nPeak/RMS Level Meters Tool\nThis tool contains both Peak and RMS (\"Root Mean\nSquare\" or average) Level metering. Other features\ninclude Clip Indicators, Clip Statistics, and variable Peak\nHold, RMS Smoothing, and Meter Range. Each of these\nfeatures is described below.\nClip Indicators\nThese indicators are located just above the Peak Level\nMeters. They light up in red when the signal exceeds\n0dBFS. The Clip Indicators can be reset by clicking on\nthem.\nPeak Level Indicators\nThese indicators appear as horizontal yellow lines, at the\ntop of the Peak Level Meter display. Various options for\nthese indicators may be set using the Peak Hold pop-up\nmenu.\nOverall Peak Level Indicator\nThis indicator displays the overall Peak Level, with an\ninfinite hold time (similar to setting the Peak Hold time\nfor the Peak Level indicators to Infinity). This indicator\ncan be reset by clicking the Reset All button.\nSample Count in Last Clip Display/Button\nThis control is both a numeric display, and a button - it\nshows how many samples were clipped in the last\nclipping incident. Clicking this button resets the clipped\nsample count to zero.\nTotal Samples Clipped Display/Button\nThis control is both a numeric display, and a button - it\nChapter 6: Reveal\nReveal's Lissajous Phase Scope Display\nReveal's Peak/RMS Level Meters Display\n\nshows the total number of samples in all clipping\nincidents. Clicking this button resets the clipped sample\ncount to zero.\nTotal Clips Display/Button\nThis control is both a numeric display, and a button - it\nshows the total number of clips. Clicking this button\nresets the clip count to zero.\nPeak Hold Pop-Up Menu\nThis control sets the duration that the Peak Level\nindicators stay at the Peak Level.\nBy default, this control is set to 3 Seconds, and options\ninclude:\n-\nOff\n-\n1 Second\n-\n3 Seconds\n-\n5 Seconds\n-\nInfinity\nRMS Smoothing Pop-Up Menu\nThis control sets the duration over which RMS level values\nare calculated. By default, this control is set to 3 Seconds,\nand options include settings between 1 - 10 Seconds.\nMeter Range Pop-Up Menu\nThis control sets the range of both the Peak and RMS\nmeters. By default, this control is set to -96dB, and\noptions include:\n-\n-48dB\n-\n-96dB\n-\n-144dB\nConclusion\nNow that you are familiar with the various analysis tools\nin Reveal, continue along to the next chapter, which\ncovers SuperFreq.\nMaster Perfection Suite User's Guide\n\nChapter 8:\nSqweez-3 & -5\nIntroduction\nSqweez-3 & -5 represent the very latest in professional\nmulti-band compression, limiting, and upward expansion\ntechnology. Its linear phase filters give precise control\nover compression settings for three frequency bands in\nthe case of Sqweez-3, and five bands with Sqweez-5. The\nadvanced visual display provides crucial analysis\nfeedback, and allows parameter adjustment with the\nhighest degree of control.\nSqweez-3 & -5 allow independent compression settings to\nbe applied for low, mid, and high frequencies, and each\nband can be configured to affect the exact frequency range\ndesired.\nThis chapter will introduce the graphical user interfaces,\nhow the controls work, and gives some basic hands-on\ngetting started tips for working with Sqweez-3 & -5.\nSqweez-3 & -5 User Interface & Controls\nSqweez-3 & -5 are designed to be intuitive and easy to\nuse. This section discusses the graphical user interface,\nand will familiarize you with each of the various controls.\nGlobal Controls\nSqweez-3 & -5 features a variety of controls designed for\nspecific tasks, and also features a number of \"global\"\ncontrols, that affect the state of the entire plug-in. Below\nis a brief description of these \"global\" tools, and how\nthey operate.\nA/B/C/D Compare Buttons\nThe A/B comparison feature is common in audio\nprograms, and gives the ability to preview different\nsettings before committing to them. Essentially, various\ntool settings are made and stored as snapshot \"A\" -\nanother group of settings can then be assigned as\nsnapshot \"B\" - and then clicking the A or B buttons in\nthe interface instantly toggles between the two. As\nSqweez-3 & -5 offer many fine-tuning options, it features\nnot just two comparison modes - but instead includes\nA/B/C/D comparisons, for four unique snapshots to\ncompare between, before committing to any file\nprocessing. These snapshots are similar to saving and\nloading presets, but are instantaneous, and do not\nrequire selecting presets from a menu to load them. To\npermanently save one of these snapshots, simply select\nthe desired snapshot, and save it as a custom User Preset.\nFactory Preset Pop-Up Menu\nThis menu displays the current factory preset, if one has\nbeen selected. Clicking this menu shows a list of all\navailable factory presets. A factory preset may be\nselected by choosing it from this pop-up menu.\nFactory Preset Selection Arrows\nThese arrows are used to navigate through factory\nChapter 8: Sqweez-3 & -5\n\nMaster Perfection Suite User's Guide\nSqweez-3 Graphical User Interface\nGain Compensation\nButton\nSpectrograph View\nPop-Up Menu\nSpectrograph Mode Pop-Up\nSpectrograph Pre/Post Pop-Up\nSoft Clip Button\nDigital Ceiling Slider/\nNumerical Field\nInput Meters\nMaster Gain Slider/\nNumerical Field\nGraph Display (Showing\nEQ & Threshold Views)\nDisplay Mode Radio Buttons\nFilter Crossover\nIndicator\nThreshold Indicator\nGain Indicator\nMax. Compression\nIndicator\nCurrent Compression\nIndicator\nGain Control Ball\nMax. Reduction\nPop-Up Slider\nThreshold Input Meter\nThreshold Slider/\nNumerical Field\nA/B/C/D Compare Buttons\nFactory Preset Pop-Up Menu\nFactory Preset Arrows\nUser Preset Controls\nBypass Button\nOutput Meters\nSpectrograph\nDisplay\nGroup Controls\nBand Bypass Button\nSolo Band Button\nRatio Control\nAttack Pop-Up Slider\nRelease Pop-Up Slider\nKnee Control\nGain Slider/\nNumerical Field\n\npresets. Clicking the down arrow moves to the next\navailable factory preset, and clicking the up arrow moves\nto the previous factory preset.\nUser Preset Save Button\nSaves a user preset, which includes the state of all\nparameters.\nUser Preset Load Button\nRecalls a user preset, includes the state of all parameters.\nUser presets do not appear in the Factory Preset\npop-up menu, so be sure you are aware of the\ndirectory where you are saving them into, so they\nmay be recalled easily later.\nBypass Button\nThe Bypass button is used to temporarily disable the\nplug-in. When the plug-in is bypassed, audio playback is\nnot affected.\nMaster Compression Controls\nA set of master compression controls appears just above\nthe EQ/Threshold Graph Display area. The controls\naffect all compression bands. Each control is described\nin further detail below.\nGain Compensation Button\nWhen clicked, this control toggles automatic gain\ncompensation on or off. When Gain Compensation is\nactive, the output signal approximates the level of the\noriginal input signal.\nSpectrograph View Pop-Up Menu\nThis control allows choosing whether left channel, right\nchannel, or stereo channel information is shown when\nthe Spectrograph is active. The spectrograph display\nappears only in the Threshold View (or in the Threshold\nportion of the \"Both\" View).\nSpectrograph Mode Pop-Up Menu\nThis control allows the Spectrograph display to be\nturned on or off. Two display options are available when\nthe Spectrograph is active - Instantaneous and History.\nInstantaneous mode displays the current spectral\nqualities of the audio signal. History mode displays an\nRMS Average of the file's spectral qualities over the past\nfew seconds.\nSpectrograph Pre/Post Pop-Up Menu\nThis control allows the display of spectral data in a pre-\nprocessing or post-processing state. It is useful for\nvisually comparing the \"before\" and \"after\" states of\ncompression settings before the plug-in is applied.\nSoft Clip Button\nWhen active, this control acts as a soft limiter to ensure\nthat the output level does not clip due to gain differences\nintroduced by a compression setting. The presence of a\ncheck in this box means that Soft Clip is active.\nDigital Ceiling Slider/Numerical Field\nThis control sets the maximum allowable level in\ndecibels (used by the Soft Clip control's algorithm).\nBy default the Digital Ceiling slider is set to 0dB, and has\na range of -20 to 0dB.\nChapter 8: Sqweez-3 & -5\n\nSliders/pop-up sliders can be reset to their default\nvalues by Option-clicking on them.\nWhen numerical fields are in an editable state\n(i.e., after clicking in them with the mouse), their\nvalues may be changed by typing in new values,\nby using the Up/Down Arrow keys on your\nkeyboard, or by using the scroll wheel on a Mac OS\nX-compatible scroll wheel mouse.\nInput/Output Meters\nThese meters show levels for both the original signal\nbeing input, and the output level, after being affected by\nthe current compression parameters.\nMaster Gain Slider\nThis control affects output level globally.\nBy default, the Gain Slider is set to a value of 0dB, and\nhas a range of -12 to 12 dB.\nGraph Display\nThis display shows a variety of compression data for each\nband in graphical format. The Graph display may be\nviewed in three modes - EQ, Threshold, or Both (which\ndisplays EQ & Threshold data simultaneously). The\ngraph's X-axis represents frequencies and the Y-axis\nrepresents amplitude. In Threshold or Both mode, a\nspectrograph may be optionally displayed (see\ndescription of Spectrograph, earlier in this chapter).\nThe Graph display presents many useful pieces of\ninformation in a way that is easy to interpret with just a\nquick glance. The display's elements are described\nbelow.\nDisplay Mode Radio Buttons\nThis set of radio buttons allows choosing between the\nthree available display modes - EQ, Threshold, or Both.\nFilter Crossover Indicator/Numerical Entry Field\nThe Filter crossovers appear in the display as vertical\nlines, and are used to adjust the width of each\ncompression band (and edit the crossover frequency\nbetween it and its neighboring bands). Each crossover\nindicator features a control tab at its top and bottom, and\na numerical entry field so that specific custom values may\nbe quickly entered. Numerical entry fields are staggered\nso as to fit the interface smoothly - the field for the\ncrossover between bands 1 and 2 appears at the bottom\nof the indicator, the field for the crossover between bands\n2 and 3 appears at the top of the indicator, and so on.\nThreshold Indicator\nThe Threshold indicators appear only in Threshold or\nBoth view modes, and are used to adjust the\ncompression threshold for each band. Each band's\nThreshold indicator corresponds (and is linked) to the\nThreshold slider in the band-specific control area below\nthe graph display area - moving the indicator in the\ngraph also moves the slider, and vice-versa.\nGain Indicator\nThe Gain level for each band is indicated by a thin, light\nblue line (see Graphical User Interface overview on page\n72) in the EQ graph display area. This indicator appears\nin a horizontal position by default (with all bands set to\n0dB, but its shape and orientation change with\nadjustments made to the Gain slider and Maximum\nCompression Indicator). The Gain Indicator appears in\nthe EQ and Both view modes.\nMaster Perfection Suite User's Guide\n\nMaximum Compression Indicator\nThis indicator displays the maximum amount of\ncompression that can be applied. It appears as a thin white\nline (see Graphical User Interface overview on page 72) in\nthe EQ graph display area. The Minimum Compression\nIndicator appears in the EQ and Both view modes.\nCurrent Compression Indicator\nThis indicator displays the compressor's current\nfrequency response at any given instant. It appears as a\nthin yellow line (see Graphical User Interface overview\non page 72) whose position will vary depending on the\ncurrent compression settings - but will never exceed the\namount of compression set with the Maximum\nReduction pop-up slider. The Current Compression\nIndicator appears in the EQ and Both view modes.\nGain Edit Control\nThe Gain Edit controls appear as small white three-\ndimensional balls within each compression band in the\ngraph display. These controls are used to adjust a\ncompression band's Gain level, and they correspond\nwith (and are linked to) the Gain slider in the band-\nspecific control area below the graph display area -\nmoving the Gain Edit control in the graph display also\nmoves that band's Gain slider, and vice-versa. The Gain\nEdit controls appear in EQ or Both View mode.\nEach band contains an upper and lower control\nball. The upper one controls Gain, and the lower\none controls the Maximum Reduction setting (see\nnext control description).\nMaximum Reduction Edit Control Balls\nThe Maximum Reduction Edit Controls appear as small\nwhite three-dimensional balls within each compression\nband in the graph display. These controls are used to\nadjust a compression band's Maximum Reduction, and\nthey correspond with (and are linked to) the Maximum\nReduction pop-up slider in the band-specific control\narea. Moving the Maximum Reduction Edit control in the\ngraph display also moves that band's Maximum\nReduction pop-up slider, and vice-versa. The Maximum\nReduction Edit controls appear in EQ or Both View\nmode.\nBand-Specific Controls\nIn addition to the global control discussed in the\nprevious section, band-specific controls are also\nincluded. These allow fine-tuning of particular\ncompression characteristics that need to be made only\nwithin a certain frequency range.\nThreshold Slider\nThis control allows setting a threshold level - audio\nsignals that exceed this threshold are processed with the\ncurrent compression settings. Signals that fall below the\nthreshold are not affected by the band's compression\nsettings.\nBy default, Threshold Sliders are set to 0dB, and have a\nrange of 0 to -90dB.\nThreshold Input Meter\nEach band features an input level meter, which is specific\nto the frequencies that fall within the range of that band.\nThese meters are useful for setting the Threshold Sliders\nwithin each band.\nGain Slider\nThis control can be used to manually make up gain that\nmay be lost as a result of compression settings within a\ngiven band.\nChapter 8: Sqweez-3 & -5\n\nBy default, the Gain Sliders are set to 0dB, and have a\nrange of -12 to 12dB.\nRatio Pop-Up Slider\nThis control determines how much a signal is reduced\nwhen it exceeds the threshold level for that band. For\nexample, using a 3:1 ratio means that every 3dB over the\nthreshold level results in a signal that is 1dB over the\nthreshold, which is a reduction of 2dB.\nBy default, the Ratio Pop-Up Sliders are set to a value of\n2:1, and have a range of 2:1 to 50:1.\nMaximum Reduction Pop-Up Slider\nThis control allows setting a maximum reduction value\nfor a given band. Some ratio and threshold settings may\nresult in unrealistic reduction values. This slider allows\nsetting a user-defined maximum amount of reduction.\nBy default, the Maximum Reduction sliders are set to\n0dB, and have a range of 0 to 60dB.\nAttack Pop-Up Slider\nThis control determines how quickly compression is\napplied, when a signal exceeds the threshold for that\nband.\nBy default, the Attack Pop-Up Sliders are set to 30ms, and\nhave a range of 0 to 200ms.\nRelease Pop-Up Slider\nThis control determines how quickly compression effect\nis released, once a signal falls below the threshold level\nfor that band.\nBy default, the Release Pop-Up Sliders are set to 200ms,\nand have a range of 0 to 200ms.\nKnee Pop-Up Slider\nThis control determines how hard (dramatic) or soft\n(transparent) the knee of the compression curve is at the\nthreshold point.\nBy default, the Knee Pop-Up Sliders are set to .50dB, and\nhave a range of .50 to 3.00dB. (This value corresponds\nto the interval on which the compression curve is\nsmoothed around the threshold.)\nBypass Checkbox\nThe Bypass checkbox is used to temporarily disable a\nspecific compression band. When a band is bypassed,\naudio within its frequency range is not affected by\ncompression settings. The presence of a check means\nthat band is bypassed.\nSolo Checkbox\nThe Solo checkbox is used to temporarily disable all\nother compression bands. When a band is soloed, only\naudio within its frequency range is affected by\ncompression settings. The presence of a check means\nthat band is soloed.\nGroup Controls\nThis set of controls is used to apply common Ratio,\nMaximum Reduction, Attack, Release, and Knee settings\nto all bands simultaneously.\nMaster Perfection Suite User's Guide\n\nUsing Sqweez-3 & -5\nThis section contains some basic \"hands-on\" getting\nstarted tips for using Sqweez-3 & -5.\nTo Apply Compression (Basic Steps):\n1.\nInstantiate Sqweez-3 or -5 in Peak, open an audio\ndocument, and start playback.\n2.\nIn each compression band, use the input meter to\nhelp gauge the appropriate Threshold level - and\nset this using the Threshold slider. The amount of\ncompression applied depends on how far the\nThreshold slider is set below the meter's highest\nreading.\n3.\nClick the Gain Compensation button (or use the\nMaster Gain Slider) to make up for overall output\nlevel reduction introduced by the compression\nsettings.\n4.\nIn each band:\n-\nAdjust the Gain slider to a level that suits the\ncontent in that band.\n-\nAdjust the Ratio, Attack and Release to suit\nyour audio material.\nTo Fine-Tune Compression Settings:\n1.\nClick and drag the Filter Crossover Indicators to\ncreate compression bands that span frequency\nranges best suited for the audio material you are\nworking with.\nThe Spectrograph Display can help to visualize the\naudio material's frequency spectrum, and is\nuseful in determining the ideal position for each\nfilter crossover.\n2.\nCheck the Soft Clip Checkbox to prevent\nunwanted clipping.\n3.\nUse each band's Bypass and Solo controls to\naudition changes to each band's settings.\n4.\nFor a more dramatic compression effect, try the\nfollowing:\n-\nDecrease the Attack or Release values.\n-\nSet the Knee to a higher value.\n-\nSet the Ratio to a higher value.\n-\nIncrease the Maximum Reduction level.\nConclusion\nYou should now be familiar with the various plug-ins in\nthe Master Perfection Suite, and their basic operation.\nFor more information, or for additional help, please visit\nthe BIAS website, where you can find tutorials, access\ntechnical support, and search through a database of\nfrequently asked technical questions.\nWe hope you enjoy the Master Perfection Suite!\nChapter 8: Sqweez-3 & -5\nOther Noise Reduction Techniques:\n1. Peak has a fairly successful click removal DSP function.\n2. You can carefully filter out unwanted frequencies, say, caused by a feedback loop. This can be done in a live situation\n(preferably) as well as when composing.\n3. You can use band-delimited noise gates. We can't do that yet, but we do in the advanced class."
    },
    {
      "category": "Resource",
      "title": "lab3_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/29d33f2b61c938be36c77f1f791b91c0_lab3_3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 3.3: Other Pro Tools Inserts; Bouncing With Reverb; Automating Inserts; Dynamics; Peak To Pro Tools and\nvice versa; DC Offset Removal; Time/Pitch Shift with Correct Formants\nFirstly...\nCan you please clean up your folders, in other words, remove everything except files you think you might use for\nfuture assignments (e.g. your assignment 3.2 sounds might be useful for assignment 3.3). You might want to back\nyour files up rather than delete them. The Mac's CD drive is actually a DVD-R writer. I will clear out everyone's\nfolders in a week unless the word '-keep' is appended to their name (of the folder, not every nested folder). There is\nnow a firewire drive called 'Enemy'; you can back things up to the folder 'student-back-up.'\nOther Pro Tools Inserts:\nYou have used delay and reverb. There are (obviously) other inserts, pitchshift, for instance. Audiosuite operations\nchange selections or regions of sound, as you know; inserts act in real time, as you also know. This section deals\nwith inserts.\nThe effects of inserts can be heard live, they are applied when you bounce, and also when you bus them and record\nto a different track, they pass to auxiliary input tracks, and their settings are remembered. When bouncing, clearly you\ncannot alter the settings, since Pro Tools stops all user interaction, and all but a clock visually. But when you bus\nthem to another track and record, you can alter the settings and the changes will be saved. For instance, you can\nslowly change the pitchshift interval, and you will have a new file with a portamento.\nThe main advantage of inserts is that they can be automated (see below). Under EQ, there are excellent filters,\nespecially the 7-filter one. It functions rather like SuperFreq-10, except two of the filters are LP and HP, not\ngraphically represented, and the left and rightmost graphical filters can be peaks or shelves. As in Peak, Q has to be\nset by the knobs. Alter input/output to avoid clipping due to boosting too many frequency bands. We will be looking at\nthe set of dynamic inserts below.\nPlaylists:\nIn the Pro Tools tricks section in Lab 3.1 Notes, I included an entry on multiple playlists per track. Do experiment with\nthis; since learning about them myself, I have found it very helpful to try different versions of tracks without\nnecessarily saving the session under a different name.\nBouncing With Reverb:\nIf you do not select a small amount of time after the end of your audio, the reverb will just clunk off. You need to select\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\na certain amount of extra time (err on the side of caution, and you can trim it later in Pro Tools or Peak) at the tail of\nyour audio; you can work out how much extra time you need by playing your tracks to be bounced and observing\nwhen the reverb has faded to nothing.\nAutomating Inserts:\nJust as you can automate pan and volume, and record, in real time, changes using write/touch/latch (see previous\nlab notes; I won't go over it again), you can select parameters of Pro Tools inserts and automate them. In an insert\nwindow, select the auto button, and choose which parameters you want. For example, in pitchshift, ratio is a useful\none; in the 7-band filter, the various midrange gains and frequencies are useful. You add them to the list by double\nclicking on them, or single clicking and pressing add. You can also remove them. (There is an option in Pro\nTools>Preferences.. which adds all parameters automatically, but I have disabled it.)\nWhen the parameters have been selected, the slider or knob in the insert window will be green or have a green light\nnear it, meaning that there is now data to be read. You can see this where it says waveform/volume/pan; now the\nparameters for the particular effect are listed, under the effect name, and able to be viewed as automation lines on\nthe track. As with recording volume/pan automation, you need to select write or touch or latch, and play the audio; the\ngreen sliders/knobs will now be red to indicate they are being recorded. As with volume and pan, you can edit the\ninformation in the track, and even draw in data.\nIf you are happy with the recorded automation for a plug-in, you can select 'safe,' and this will protect it from\naccidental writings of data over the current data. I have mentioned previously that editing audio data in waveform\nview will edit automation data, but editing automation data, e.g. copying and pasting, or cutting, will not alter the\naudio data. If using multiple playlists on the same track, as described above (actually, in Lab 3.1 Notes), there is in\nfact only one set of automation data (in the reference manual, called automation playlists), not one for each audio (or\nedit, as it is called in the reference manual) playlist.\nI described read, write, latch, and touch in previous notes. There is also trim, which for us will work only on volume\nautomation. Trim changes data relatively, not absolutely, and works in conjunction with touch or latch. In those\nmodes, any new data you change is slapped onto the automation playlist absolutely, e.g. a move to -10dB will be a\nmove to -10dB. And it is sometimes hard to 'chase' the slider, since it is already moving about according to what is\nalready written. Trim disengages the sliders from following data, sets them to 0dB, and any changes you make are\nrelative to what is already there. For example, a -10dB change will not set the data to -10dB, but will subtract 10dB\nfrom whatever the data is during the time it is applied.\nDynamics:\nDynamic inserts or Audiosuite effects alter the dynamic range or extremes of an audio region or track (or multiples of\nthem, or one in relation to another). There are two basic types, compression/limiting, and expansion/gating. We've\nalready looked at noise gating, last week, when covering noise reduction.\nDynamic compression is a useful or cheesy tool. Pro Tools has a compressor as an insert under the dynamics sub\n\nmenu. Dynamic compression is useful for compressing the dynamic range (range of soft to loud) so that you can\nincrease the overall volume without clipping. If, for instance, there are spikes in your otherwise very quiet sound that\nalmost max out the amplitude, then you cannot increase the gain by much. Dynamic compression allows you to set a\nthreshold in dB, and to set a ratio that the dynamic envelope is reduced above that threshold. Attack and release\nwork as they do with the Peak plug-ins we looked at last week. In general, be careful with compression. Disco music\nis heavily compressed; most radio music is compressed at every frequency band by the radio station, hence all\nsongs sort of sound the same on a radio station, even if on the CDs they sound quite different. Classical music is\njudiciously compressed; generally the dynamic range is broader than in pop music, and therefore has to be played\nlouder, though the really loud bits can be extremely loud. Our electronic music should generally maintain a wide\ndynamic range, if that is how it was composed.\nDynamic expansion decreases the levels of sounds that fall below a threshold.\nAn interesting and useful feature of dynamic modification is using side-chains. Briefly, this lets you use the volume of\none track affect compression/expansion/etc. of another. You can also filter a sound before, say, compressing, then\nusing that information to control the compression of the original track. I will play an example in lab, or in class: it will\nconsist of a percussion track (thank Anna!) and some drone; when the percussion sounds, its high frequencies\ncontrol the limiting (extreme compression) of the drone, so the drone all but disappears when there is a bright\npercussive sound.\nAll this is explained in detail below. Being lazy again, and knowing you won't look in the Pro Tools manual, I have\nincluded the appropriate section here. There is more of my writing to follow these pages, so please don't overlook\nthat.\n\nText and image content removed due to copyright restrictions.\nPages from Digidesign DigiRack Plug-ins Guide.\n\nPeak To Pro Tools, and vice versa:\nYou can use the Peak SuperFreq-10 plug-in and record filter sweeps dynamically. I told you last week that it wasn't\npossible, since all you could do is bounce the effect at fixed settings. But you can play Peak out the built-in\nsoundcard (chosen through Audio>Sound Out>CoreAudio etc. as explained in a previous week's notes); patch Mac\nOut L&R to 96 In 1&2 on the patchbay, have Pro Tools open, and record enabled on the tracks with Ins 1&2. If you do\nnot record enable those tracks, you will not hear what is happening in Peak, since the Mac Outs are not going to the\nmixing board. The best way to do all this is to open Pro Tools first, then Peak (which might give an error message),\nthen correct Peak's audio. Record in Pro Tools, and play in Peak, playing with the filter, or whichever other plug-in.\nThis idea was especially relevant before Pro Tools had decent EQs/filters.\nDoing this the other way around is fairly obvious: run Pro Tools, run Peak and set it to Built-in audio in and out, set\nrecord information and get ready to record, take the 96 outs on the patchbay to Mac in (which, ooooops, I don't think\nI've set up...), etc. This might be useful, say, to record scrubbing in Pro Tools--the Pro Tools playback engine can\nonly do things at one speed, and recording scrubbing isn't possible anyway.\nDC Offset Removal:\nIf a waveform is strangely above, or below, the 0 line, on average, then there is a DC (direct current). Some external\ninstruments cause this, say vacuum tube devices, or some DSP operations. Sometimes you can see a straight-ish\nline not surrounding 0. This is clear evidence of DC. This can cause problems. If, say, you wanted to increase the\ngain of a sine wave that sat between -0.5 and +0.5, then you could easily double the amplitude. But if the same sine\nwave was centered around 0.5, its range would be 0 to 1.0. This would still sound like a sine wave, no clipping. But\nany attempt to increase the gain would cause clipping. That's when DC offset removal becomes necessary. It can be\nfound under Audiosuite>Other.\nExcellent Time Shift and Pitchshifting:\nUnder Audiosuite>Pitch Shift is something called Time Shift. It is a high quality time compression and expansion\nalgorithm, and can pitchshift with formants retained. This is especially useful for accurate looping (the time aspect),\nand transposing vocal tracks (the pitch aspect)--the chipmunk affect is minimized through its formant feature. Here is\nmore laziness.\n\nText and image content removed due to copyright restrictions.\nPages from Digidesign DigiRack Plug-ins Guide."
    },
    {
      "category": "Resource",
      "title": "lab4_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/34a339662817d3df32e2b2827a5e5e31_lab4_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 4.1: Basic Max/MSP\nFirstly (for the second time)... <-------- READ !!!!!!!!\nCan you please clean up your folders, in other words, remove everything except files you think you might use for\nfuture assignments (e.g. your assignment 3.2 sounds might be useful for assignment 3.3). You might want to back\nyour files up rather than delete them. The Mac's CD drive is actually a DVD-R writer. I will clear out everyone's\nfolders in a week unless the word '-keep' is appended to their name (of the folder, not every nested folder). There is\nnow a firewire drive called 'Enemy'; you can back things up to the folder 'student-back-up.' Only one of you has\nfollowed this instruction from last week. Next week I will be clearing the hard drive up to avoid running out of space.\nThanks.\nMax/MSP basics:\n0. You should have already gone to http://www.cycling74.com/downloads/maxmsp for a 30-day trial full version.\n1. When installing, make sure you also install documentation. This will include pdfs for Max and MSP separately,\nfor reference, for tutorials, some other stuff, and folders of patches for each set of tutorials. You should already have\ngone over some of the Max tutorials; MSP tutorials are a little more difficult, as they introduce new things faster, but if\nread and played with in conjunction with the tutorial and reference pdfs (NB. there different Max and MSP pdfs) they\nmight make sense.\n2. In lab, we looked at the basics of Max/MSP and went over certain messages and objects. I shall list those below,\nbarely explaining them; you can use manuals and help files. The Max Overview pdf might be useful to read.\n3. Command-n opens a new patch (NB. patch=patcher). The Max window is for debugging. If it vanishes or gets\nburied, use command-m. To clear the Max window, focus on it and type command-x. To change the font size of the\npatch windows, focus on the Max window, choose the font size from the Font menu, and any new patches will use\nthat font size. It is not applied to patches that are already open. You can change the font size of an existing patch by\nhighlighting everything and changing the font size; if the Auto Fix Width option is checked in Options, the boxes won't\nhave line breaks, but they might be smashed together.\n4. There are two modes of operation in Max/MSP: edit mode and run mode. Edit mode allows you to build patches,\nrun mode allows you (or someone else) to run patches. You can also run patches in edit mode, as will be\ndemonstrated in a second. Everything in these labs is geared towards Mac users; Windoze users take note that\noption(mac)==alt(windoze) and command(mac)==control(windoze) Command-e alternates between edit and run\nmodes. Edit mode is obvious: you have a set of icons at the top of the patch window. Run mode, no icons. You can\nalso alternate by command-clicking on the background of a patch. That's what I do. Better still, when you are in edit\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\nmode, hold down command and operate on an object; it won't move it about as expected in edit mode; it will do what\nit would do in run mode. I tend to stay in edit mode almost all the time, and use command-click-object to fake run\nmode.\n5. Help. Option-clicking on an object brings up a help patch. A help patch is a patch, so if you put it in edit mode,\nchange it, and close it, do not save the changes. The help patches can be fairly useless and random. Use also the\nreference manual, which is far better. Also, in edit mode if you hover above inlets and outlets to objects, their\nfunction and data types and possible ranges will be displayed in the lower left part of the patch. You will shortly\nread about messages. An object can take certain messages. You can find out what these are by option-control\nleft-clicking on the object.\n6. Operational things. To check the correct soundcard is being used, go to Options>DSP Status... and make sure the\ndriver and input and set to Digidesign. Don't worry about the lack of entry in output. Ignore the rest. In the Options\nmenu, selecting New Object List will cause Max to bring up a window (without correct scroll bars for each column...)\nwith all possible objects when you place a new object (actually, it's not a complete list, but it's pretty good, especially\nas it puts the objects into categories). I personally don't use New Object List, but it is very useful when starting out.\nMost people don't like segmented patch cords, but I do. Without them, you have to hold down the mouse to connect\nobjects/messages. With segmented patch cords you can make crazy Max art, and you don't have to hold down the\nmouse. Also, have help in locked patches checked; don't worry what this means yet. Auto fix width is also useful to\nhave checked. So is Extended File Preview, Max Window at Startup, Float Display Correction, and Assistance.\n7. There are three basic things in Max/MSP: objects, messages, and comments. They are the three leftmost\nicons, in that order. Note their different appearances: comments are dotted boxes, messages are single line boxes,\nand objects have double lines on top and bottom. Comments are, well, comments; they do nothing functionally. But\nyou have to comment your patches liberally, for your own sake--so you know what is going on and will remember in\na year's time--for my sake--so I know you are not copying and pasting from some other sources--and for other\nusers of your interactive patches. Sometimes it's just interesting to know how something works. Messages are just\ndata--numbers, strings, lists--that are pushed around the Max flowchart. (Audio data is a little different; it's not really\ndata.) Objects do things. Like add, play, filter, draw, decide, count, etc.\n8. You place a new object by clicking on its icon on the tool bar, and clicking it where you want it to go on your\npatch. Apple-d duplicates a highlighted object, or set of objects and their cables, option-dragging an object will\ncopy it. Right-clicking on the object icon on the toolbar will bring up a list of objects you have already used and\nyou can select from that lift with a left-click.\n9. You connect outlets to inlets. When there is an outlet, hovering the mouse over it will make the tiny black\nrectangle larger, and when you have a cable in the making, an inlet will get bigger if it is of the right (data) kind.\n10. To delete an object, message, or comment, draw a rectangle around it and hit delete. To delete a patch cord,\nhighlight it, it will turn bold (or red if it is an audio cord), and hit delete. Max (data) cords are black lines, MSP (audio)\ncords are yellow squiggles. You can delete multiple patch cords by holding down option and drawing a rectangle\naround the patch cords you wish to annihilate. If you want to abandon a patch cord while making one, hit escape. If\n\nyou want to abandon an object, message, etc., while it is still floating about before being placed, hit delete.\nMax/MSP objects and messages:\n0. In these notes, [square brackets] mean an object, and |vertical bars| mean a message. Don't forget numbers\ncan act as messages, but I won't put them between vertical bars.\n1. [print] will print to the Max window. [print arg] will identify what you have printed by arg. This is useful for\ndebugging.\n2. Clicking on a message will send the message. (You will learn later that \"set\"ting a message will send it, but will\nstop it at its next message point.) The special message [bang] means \"do it\"; it makes certain objects do things; it is\nthe message resulting from certain objects; it is the same as clicking on a message if that is what it is connected to.\nBang is also the round button inside a tiny square that blinks yellow when clicked on or activated by some other\nprocess in Max. To see a message, you can print it using [print]; or you can divert it to the object/argument\n[prepend set] and then to an empty message box. That way you can see the message as a message. If you want to\nuse that message, don't take it from the second message box (following the prepend), rather, straight from the\nsource.\nCourtesy of Cycling '74. Used with permission.\n3. There are two number types: integers and floats (decimals). They can be found as the icons with > signs; the\none with a dot is floats. In run mode you can scroll these; scrolling floats depends on whether you do it to the left or to\nthe right of the decimal point. Number boxes can initiate messages, or can show the result of operations. There is\na special window in Max called the Inspector. Some graphical objects have attributes that can be controlled by\nmessages; for example the maximum and minimum values of a number box can be set. But this can be set from the\nInspector window. One option of the number Inspector is Output Only on Mouse-Up. This means the number won't\nchange until you unclick the mouse. In run mode, a number box can be clicked on and a number entered rather than\nscrolled to. When this happens, the triangle turns yellow. Something to note: a number box does not automatically\nload data into an object when a patch opens, and, additionally, the value of a number box is not stored when a patch\nis saved. (This can be done using [preset] which we cover in Lab 4.3.\n4. Arithmetic: not so simple. In many Max objects, all the right inlets put information in registers (memory), and\nthe leftmost inlet will do the same, but also bang the object, i.e., make it do its thing. This is true for arithmetic\n\nobjects, e.g. [+] [-] [*] [/] and others. Read the manual carefully on how this works; it will cause you at some point to\nget unexpected results, and correcting any error will give you the results you expected.\n5. Right-to-left. Max works top-to-bottom by virtue of being a flowchart; an object below an other graphically might be\non top of it conceptually if that is what the cables say. The left-to-right thing is trickier; read the manual carefully on\nthis. It can be the cause of problems (even now, it throws me occasionally). Next week we will learn [trigger] or [t] for\nshort, which forces the order of events, independent of graphical representation. From next week, that is what I will\ninsist upon.\n6. [x] is called toggle; it produces a 0 or 1 when clicked. Bang alternates it, just as clicking it does; 0 sets it to 0,\nany non-zero number sets it; but all numbers passe through. A string will return an error (see Max window for\nthis when it happens). [x] is used to start and stop various objects, such as [dac~], [sfplay~], and metro. NB. [x] isn't\nan object with an 'x' in it; it is just convenient shorthand for the toggle box, since they kind of look the same.\n7. [metro] is a metronome. The optional argument is time in ms. The right inlet overrides this, and can be changed\non the fly. [x] starts or stops the metronome; the output is a bang, used to trigger other objects.\n8. Bang causes certain events to happen: an example is [random]. The optional argument is the integer value such\nthat [random] will output a random integer between 0 and n-1. You will have to use clever arithmetic to get, say, a\nrandom value between 0.5 and 7.5 in increments of 0.2. (Remember that +1 is sometimes need for inclusive ranges.)\n9. [delay] (or [del])receives a bang, and delays the output of that bang by the argument in ms, which can be\noverridden by the right inlet. Stringing delays together is better than initiating a number of them, since it means only\none clock in the Mac scheduler is required. An integer to the left inlet initiates a delay of that value in ms.\n10. [gate] can be switched on or off using [x] in the left inlet; when it is on, a message (including a number)\nreceived in the right inlet will be passed to the output. If the gate is off and a message is passed to it, then the gate is\nswitched on, the message won't be passed; it doesn't store values. Gates can have many outputs; rather than using\n[x] you can send it a number, which refers to which output the input (from the right inlet) will go to.\n11. The tutorials tell you about [slider]; prefer [uslider] instead, whose size is independent of its range, etc. Access\nrange information by highlighting the [uslider] (the graphic thingy], and typing command-i (for inspector). Other\nmessage or things that have inspectors include number boxes; you can set range, for instance.\n12. Now for MSP objects. These differ from Max objects because they are audio. They are not data that are sent\non demand, or according to a clock; if audio is on (by turning on [dac~] or [adc~]), audio is continually being passed\naround the patch at the audio rate, which is usually set to 44.1kHz. [dac~ 1 2] is the object that receives left and right\nchannel audio, to be routed to 96 out 1&2. Don't use [ezdac]. Often Max/MSP objects need or can take special\nmessages in their left inlets; for [dac~], [x], or 0 or 1, or start or stop, or startwindow, are required. There are no outlets\nto [dac~], since their output is through the soundcard (eventually). 0 or 1 (or [x] or |stop| or |start|) stop and start all\naudio. That means anything with a yellow squiggly patch cord will run, whether or not it is audio--some information,\nsuch as output by [line~], is audio rate, even though it is not (usually) sound. In other words, [line~] won't work if the\n\naudio is off, even if you didn't need to hear anything. 0 or 1 etc. affect audio in all open windows (patches). If you\nopen the help patch for [cycle~] and you have audio on, you will now hear sounds not coming from your patch, but\nfrom the help patch. |startwindow| starts the audio only in that patch, but any 0 will stop all audio. There are a couple\nof buggy anomalies you will discover with all this.\n13. [noise~] is a white noise generator. [pink~] is a pink noise generator. [cycle~ freq] is a sine tone generator\n(actually a cosine generator, so that at frequency=0, it is a constant 1). The left input is frequency, overriding the\nargument, and can be float or signal (we'll cover the difference next week, but you can experiment with it if you like,\ne.g. for FM synthesis, which we will also be doing next week). The right inlet controls phase.\n14. [sfplay~ 2] is a stereo (hence the 2) soundfile player. Its left two outputs are left and right stereo channels, and\nthe right outlet bangs when the soundfile is finished. The inlet takes several messages; |open| is required to choose\nthe soundfile--clicking on [open] will give you a dialog box; [x] starts and stops the soundfile, playing from the\nbeginning; |seek| will play part of the file; |loop 0| or |loop 1| will not loop or will loop the soundfile (you can see how\n$1 as an argument works buried deeply in the [sfplay~] help patch); [pause] and [resume] are also useful. Delve\ndeeper into the help file for more tricks.\n14. [selector~ arg] (or [sel]) takes arg number of audio inputs (the rightmost inlets), and the left inlet determines\nwhich inlet is sent to the outlet. 0 means nothing is passed.\n15. [meter~] is a VU (level) meter. [gain~] is a logarithmic signal (audio) fader. These are well-used together. Unity\ngain is when the value of [gain~] (obtainable from the right outlet) is 127; up to 157 is amplification, and will distort a\nnormal signal. Both these objects are examples of objects that turn into graphical symbols. You will also learn how to\nmanipulate the size and shape of objects with these ones: hovering the mouse over the bottom right, but on the side,\nof most objects will reveal a tiny square, and the cursor will turn into arrows. You can chance the appearance of\nobjects by dragging on the tiny square.\nCourtesy of Cycling '74. Used with permission.\n16. [+~] adds audio signals. This automatically happens at [dac~] inlets, in fact, at any audio input. [*~] multiplies\naudio signals; if you multiply an audio signal by a float, it attenuates or amplifies the signal. If you have three\n[cycle~]s heading for the same inlet of a [dac~], it is wise to use [*~ 0.33] to avoid clipping."
    },
    {
      "category": "Resource",
      "title": "lab4_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-361-composing-with-computers-i-electronic-music-composition-spring-2008/3f45cd1f274f03bcaaa1b69210600974_lab4_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.361 Composing with Computers I (Electronic Music Composition)\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLab 4.2: More Max/MSP\n1. [trigger] or [t] is one of the most important objects in Max. It triggers events in a right-to-left order, so you don't\nhave to rely on graphical right-to-left precedence. [t b i] will have two outlets, since there are two arguments. When\na number is received (float or integer), it outputs from the [trigger] right-to-left: first an integer (even an integer version\nof a float) is output through the right outlet, and once that chain of events has completed, the number causes a |bang|\nto be output through the left outlet. You can many arguments to [t]; data types can be represented by i (integer), f\n(float), s (symbol), b (bang), and l (list). Actual values can be set, too; [t b 45.3 banana f] will pass a float, the\nmessage|banana|, the float 45.3, and a bang, in that order. You have to understand the concept of chain of events\nto understand [t] fully. Once an event starts, e.g. the number 3 is passed down a patch cord, all that can be done\ndown that branch of the tree (like a family tree) will be done, then the scheduler moves up to the last junction not\ninitiated. (This will be revealed in lab, and I'll write it up next lab.) An example of [t] will show up when we look at\n[pack] in relation to [sfplay~].\n2. [loadbang] sends a |bang| when the patch is loaded, or when it is double-clicked; [loadmess args] sends args\nright-to-left when the patch loads. [bangbang] or [b] sends two bangs, right-to-left; [b int] sends int bangs right-\nto-left.\n3. AM synthesis. The amplitude of a modulating oscillator modulates the amplitude (hence Amplitude Modulation) of\na carrier oscillator. In the more general case, the modulator and carrier need not be oscillators, but any signal (i.e.,\nsound). For example you can amplitude modulate two soundfiles. AM is commutative; the convention is that the\ncarrier is the more constant of the signals (as in AM radio broadcast). Simply have the output of two oscillators (or\nother signals) multiplied together. (For those interested, AM is real-time--not whole sample--convolution in the\nfrequency domain, i.e., multiplication in the time domain.)\n4. FM synthesis. The amplitude of a modulating oscillator modulates the frequency (hence Frequency Modulation)\nof a carrier oscillator. Again, this can apply to any signal (for very interesting results). Using just oscillators,\nCourtesy of Cycling '74. Used with permission.\n21M.361: Composing with Computers I (Electronic Music Composition)\nPeter Whincop\nSpring 2008 OCW\n[All lab notes are being significantly revised for next term to reflect upgrades in software, different organization, and\nthe incorporation of my own notes on DSP.]\n\ninteresting timbres can be developed. The simplest way to make an FM instrument is to have a number box feeding\ninto the frequency input of a (modulating) [cycle~], [*~] multiply by the width above and below the center frequency of\nthe carrier, [+~] add to the center frequency, and send to the output. A slow modulator will produce a siren; higher\nmodulating frequencies will produce more complex timbres.\nCourtesy of Cycling '74. Used with permission.\n5. More complicated FM synthesis. Still just with two oscillators, more complex timbres can be created. Rather than\nusing modulation frequency, width of modulation, and center frequency as your parameters, use carrier frequency,\nharmonicity ratio, and modulation index. A little math with these parameters will describe how many 'sidebands' and\nwhere they will be found in relation to the carrier frequency. Sidebands are other quieter frequencies that surround\nthe center frequency. See MSP tutorial PDF 11 for a description of this; see the actual tutorial patch for how the\nparameters are connected. The actual FMing is carried out in the sub-patch called SimpleFM; double clicking on it\nwill bring it up (not able to be edited) or you can find SimpleFM in the MSP tutorial folder, below the tutorials. If you\nuse [SimpleFM] in your patch, don't forget to include the abstraction. I would prefer it if you wouldn't computer copy it,\nrather, reconstruct it yourself. In 21M.540 we look at the theory behind sidebands, using Bessel functions. Also, for\nnow, don't try to understand the # argument in [SimpleFM].\n6. [adc~ 1 2] means analog-to-digital converter, channels 1&2. The outputs are signals. The input is just like for\n[dac~] (aside from audio input to the latter): [x], or [startwindow] etc. You only need one [adc~] in your patch, just as\nyou need only one [dac~]. And between them you need only one way of starting or stop audio.\n7. [sfrecord~ 2] records its inputs to a stereo soundfile. As with [sfplay~] it requires an |open| message, and [x] to\nstart and stop. Sometimes you will find yourself with a ton of patchchords going into a [dac~], and when you want to\nadd an [sfrecord~] you then have to duplicate all those patchchords, this time going to the record object. This can be\nmessy, and it is easy to forget to attach all chords. So it is helpful in these cases to have a [+~] above each input of\n[dac~], with everything being collected by the [+~]--one for each channel. From here you can attach the outputs to\nthe [dac~] and to [sfrecord~]. Alternatively, you can use the [adoutput~] object; it intercepts all output to any [dac~] in\n\nany window. I usually use [adoutput~] to feed [sfrecord~], just to keep things neat, especially if i have several active\nwindows open at a time and I forgot to collect the signal all in one place. (Kind of sloppy, but it's a last resort.)\n8. [patcher name] or [p name] will make a patch(er) within a patch. It is used to keep things neat and modular. As\nsoon as you create the object, a new patch window will open, with the name in square brackets, meaning it is\nembedded. You use inlets and outlets in this sub-patch; creating them will create inlets and outlets in the parent-\npatch. They are read left-to-right for both inlets and outlets; if you change the order of them once you have created\nthem, you will have to change the way you have patched to the [p] object in the parent-patch. [p] is used for one-off\ndeals. If you want to make a sub-patch that can be used many times, either in one patch, or across many, then create\na separate patch, using inlets and outlets. Save it in the same directory. In the main patch, creating an object with the\nname of the sub-patch, e.g. [SimpleFM] in the FM tutorial, will create an object with correct number of inlets and\noutlets, corresponding left-to-right in the sub-patch. Every time you use this new 'object' (it's called an abstraction in\nMax/MSP-talk, which is just a way of saying you have created a reusable patch that functions like an object), it is an\nindependent instance of the sub-patch, functioning as if an object. Just as with [cycle~] being used many times in the\nsame patch, or in many concurrent windows, the parameters are not confused between the instances. If you double-\nclick on an abstraction in a window, the sub-patch will appear, with its name in square brackets; you will not be able\nto edit it, though it will show data pertinent to that particular instance. To edit it you must open the sub-patch itself, as\na normal patch; any changes made must be saved.\n9. [send name] and [receive name], or [s name] and [r name] for short, will send a message (number, symbol, list,\netc.) to every instance of the correspondingly named [r] object. It is global in scope, meaning it passes across\nwindows, and into sub-patches and abstractions. (There are ways of finessing this when various instances require\ndifferent names, also using the pound key-symbol; I'll teach that in the advanced course with the [poly~] object.)\nAudio signals can be sent and received with [send~ name] and [receive~ name]; there are no abbreviations.\nUsing send and receive keeps things tidy, and allow communication between patches without the need for inlets and\noutlets.\n10. [pack] packs individual data into a list. The arguments of [pack] are the default values/data types; the number of\narguments will determine the number of inputs to [pack] and the length of the list to be output. It cannot be changed\ndynamically. For example, [pack 0 1 peter 2.] means that the pack values are two integers, a symbol, and a float, with\ndefault values as given. Sending data into all but the left inlet will just store the value, rather as in arithmetic\noperations; sending data to the left inlet will store the value and bang the [pack] to output the list. (Recall that you can\nsee the list by having a branch from the output that goes to the [prepend set] object leading to an empty message\nbox.) Banging the pack object will send the list, which may or may not still have its default values. [unpack] unpacks\ndata from a list. For example [unpack 0 1 peter 2.] expects a message (list if it has more than one component) of the\nform int int symbol float. There will be four outlets, since there are four arguments. If the data types of the list do not\ncorrespond to the data type of the arguments of [unpack], various things happen. A symbol going to a number will be\noutput as 0, a number going to a symbol will not be output; numbers will be converted to the argument's type. One\nfinal thing: [pak] (apparently pronounced 'pock') bangs with any input, not just through the left inlet. (I should\npoint out that I have been using 'symbol' a little freely as a data type; more on that in 21M.540.)\n\nCourtesy of Cycling '74. Used with permission.\n11. [value name] ([v] for short) stores a value (of any data type); banging it will send it. You can have other\n[value] objects with the same name; banging those (even without inputs) will send whatever value was sent to any\nother [value] of the same name. [int] and [float] ([i] and [f]) accept integers and floats; into the left inlet they pass\nthe value through; into the right inlet they store the value until banged. [sig~] converts control data into a\nconstant audio signal; this type of data-type conversion is necessary under certain circumstances. See, for instance,\nMSP tutorial 11, FM synthesis. In the sub-patch, [*~] is expecting a signal, but the value you choose in the parent-\npatch is a number box; [sig~] changes it to an audio rate version of the constant.\n12. [line] accepts a message in the form [init-value, end-value time-in-ms] e.g. [440, 880 2000]. If you fed the last\nmessage into [line], then into [cycle~], then clicked on the message or banged it, [cycle~] would oscillate at 440Hz,\nimmediately to rise to 880Hz over a period of 2 seconds. [line init-value] can be sent a message in the form [end\nvalue time-in-ms]. [line~] does the same, but at the audio rate, therefore more subtly and more usefully. Unlike\n[line] it can accept lists of values, like a breakpoint function, e.g. [440, 880 2000 220 500 1320 3000]. Read the\nvalues after the comma in pairs.\n13. [function] will give you a breakpoint function box. See the manual or the help patch for its subtleties. It is usually\n\nused to drive [line~], which is done so through the second output. See MSP tutorial 11 (FM synthesis) for an\nexample. It is very useful for making envelopes (amplitude, anything else).\n14. [phasor~] can be used as a saw-tooth generator, though [saw~] is better. Use [phasor~] to drive objects that\nrequire a ramping input. [phasor~] outputs at the audio rate a ramp from 0 to 1 at the given frequency.\n[triangle~] produces a triangle wave. To make a square wave, wait for next week's section on audio-date\nconditionals, or you can use [rect~]. All the common waveforms can be made by additive synthesis of sines (or\ncosines) in some harmonic relation, with amplitudes in such relationships as 1/n or (n-1)/n^2, etc.\n15. [scope~] gives you an oscilloscope. It is therefore a time-domain representation of a signal. At low frequencies\nyou won't have to feed it parameters; at higher frequencies you will have to set its parameters. [spectroscope~]\ngives you a frequency-domain representation (Fourier transform) of a signal.\n16. [select] and [route] do what they say. [route] compares the first item of a list with an argument, and sends the\nrest of the list down that argument's outlet. For example, |peter 100 10| sent to [route 1 2 peter] will result in |100\n10| being sent from the third outlet, corresponding to |peter|. If there is no match, the whole input list is output through\nthe right outlet. [route] is a useful way to traffic data as if they are attributes around a patch. [select] or [sel]\ncompares its arguments with an input, and bangs the appropriate outlet. For example, if |22| were sent to [select\ntEp 22 omg] then the second outlet would bang. If there is no match, the input (not a bang) is sent to the right outlet.\n17. Arguments and keywords in messages. A messages can say (almost) anything, but a message box can only\nreceive messages that begin with a keyword, such as |append ...| or |set ...|. |set| in particular will set the new\nmessage box to the message (list etc.) but will stop the message from being sent any further. This is useful for\nsetting up a value for later use, say, to deal with timing/scheduling issues, and a bang later to the new message box\nwill send it. (In other words, |bang| is another keyword that message boxes understand.) Argument placeholders\ntake the form $1, $2. An example would best demonstrate this:\nCourtesy of Cycling '74. Used with permission.\nUse backslash for literals. The best way to format a message is with [sprintf] which uses the standard C library for\nprintf (the manual of which you will have to look up; it isn't in the Max manual). If you are trying to manipulate data,\nand you can't quite get it right, email me, and I'll try to get it into the correct format.\n\n18. Aliasing is frequency reflection. Frequencies reflect around 0Hz, i.e., -50Hz is the same as 50Hz (though phase\nis inverted); and frequencies reflect around the Nyquist frequency. The Nyquist frequency is half the sampling rate.\nThe idea is that all frequencies can be represented up until half the sampling rate. Our sampling rate is 44.1kHz, so\nanything up to 22.05kHz (pretty much to top end of human hearing, hence it is the CD sampling rate) can be\nrepresented. Anything above it is reflected, so 22.2kHz comes out as 22.1kHz. You might notice this when\ntransposing (which we haven't done yet), and especially with sidebands in FM synthesis.\n19. If you are even more daring, you can use [buffer~] and all its related objects, and [pfft~] for frequency domain\nwork. I won't be teaching it in this course; it's reserved for 21M.540. Please don't try to race ahead too far; leave me\nsomething to teach in the advanced course! But I'll help if you ask."
    }
  ]
}