{
  "course_name": "Composing for Jazz Orchestra",
  "course_description": "This class explores composition and arrangement for the large jazz ensemble from 1920s foundations to current postmodern practice. Consideration given to a variety of styles and to the interaction of improvisation and composition. Study of works by Basie, Ellington, Evans, Gillespie, Golson, Mingus, Morris, Nelson, Williams, and others. Open rehearsals, workshops, and performances of student compositions by the MIT Festival Jazz Ensemble and the Aardvark Jazz Orchestra.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPlus required outside events\n\nCourse Overview\n\nThis course explores composing and arranging for large jazz ensembles from the 1920s to current postmodern approaches. A wide variety of styles and techniques will be considered as well as the interaction of improvisation with composition. Illustrative examples will be drawn from the repertories of Anthony Braxton, Duke Ellington, Count Basie, Gil Evans, Dizzy Gillespie, Benny Golson, Woody Herman, Thad Jones, Stan Kenton, Gerry Mulligan, Oliver Nelson, George Russell, Mary Lou Williams and others.\n\nSkills to be developed will include listening, score analysis, and original compositional work.\n\nThree special features of this course are:\n\nObservation\nand learning based upon attendance at open rehearsals and performances by our two resident large jazz ensembles, the MIT Festival Jazz Ensemble and the Aardvark Jazz Orchestra\n\nPerformance\nof Mid Term and Final Projects by these ensembles\n\nGuest lecturers\n, including Dr. Fred Harris, director of the Festival Jazz Ensemble, experts on the blending of Afro-Cuban and Ethiopian music with jazz, and the Gil Evans / Miles Davis collaborations, as well as the internationally renowned composer Walter Thompson.\n\nMark Harvey bio page\n\nTextbook\n\nBoras, Tom.\nJazz Composition and Arranging\n. New York, NY: Schirmer, 2004. ISBN: 9780534252618.\n\nRequirements\n\nClass attendance and participation (please bring music paper to each class)\n\nWeekly listening, analysis, and composition assignments\n\nAttendance at and reports on open rehearsals and performances by the\nMIT Festival Jazz Ensemble\n[FJE] and the\nAardvark Jazz Orchestra\n[AJO] as scheduled throughout the term\n\nA mid-term project to be performed by members of the AJO\n\nA final project to be performed by the AJO or the FJE as concluding class sessions\n\nGrading\n\nReferring to the above listed requirements, grading will be based approximately on the following proportions:\n\nAssignments and participation (1 & 2) = 25%\n\nRehearsal and performance reports (3) = 25%\n\nMidterm and final projects (4 & 5) = 50%\n\nAs with any course, individual effort and other factors will be factored into the determination of the final grade for the subject.\n\nSchedule\n\nSession Key:\n\nL = Lecture\n\nE = Required event outside of class: rehearsal, workshop or performance\n\nFJE:\nMIT Festival Jazz Ensemble\n\nAJO:\nAardvark Jazz Orchestra\n\nSES #\n\nTOPICS\n\nL1\n\nIntroduction\n\nTonal concepts and theory\n\nL2\n\nOverview of the jazz orchestra\n\nL3\n\nMelody and harmony\n\nBlues form\n\nL4\n\nComposing and arranging\n\nE1\n\nFJE open rehearsal\n\nL5\n\nSectional form\n\nL6\n\nHarmony and voicing\n\nL7\n\nSaxophone writing\n\nMid-term assignment\n\nE2\n\nAJO open rehearsal\n\nL8\n\nReview of concepts\n\nE3\n\nAJO concert at Regattabar\n\nL9\n\nPutting it all together: score and parts\n\nE4\n\nFJE open rehearsal\n\nL10\n\nSketches: individual review sessions\n\nE5\n\nAJO performs mid-term projects\n\nExpansions and innovations\n\nL11\n\nPreview of FJE concert, with analysis of some repetoire (Guest lecturer: Fred Harris, Musical Director of MIT FJE)\n\nE6\n\nFJE open rehearsal\n\nL12\n\nThad Jones / Bob Brookmeyer / Oliver Nelson\n\nE7\n\nFJE concert at MIT Kresge Auditorium\n\nL13\n\nEthiopian jazz and the Either/Orchestra (Guest lecturers: Mulatu Astatke and Russ Gershon)\n\nL14\n\nCharles Mingus\n\nE8\n\nAJO open rehearsal followed by concert\n\nL15\n\nDuke Ellington I\n\nL16\n\nGil Evans / Miles Davis collaborations (Guest lecturer: Steve Lajoie)\n\nL17\n\nGeorge Russell and modal jazz\n\nL18\n\nAfro-Cuban music and bebop (Guest lecturer: Bill Lowe)\n\nToward the final project\n\nL19\n\nDuke Ellington II\n\nE9\n\nFJE concert at Kresge Auditorium\n\nL20\n\nPostmodern approaches\n\nL21\n\nSoundpainting (Guest lecturer: Walter Thompson)\n\nE10\n\nSoundpaining workshop with FJE and Walter Thompson\n\nL22\n\nSketches for final project\n\nL23\n\nFinal sketches: individual review sessions\n\nE11\n\nFJE performs final projects\n\nE12\n\nFJE performs final projects (cont.)\n\nDuring the subsequent Spring 2009 term, Walter Thompson returned to MIT for a Soundpainting performance with the Aardvark Jazz Orchestra. See the\nVideo and Audio Classes\npage for a recording of this concert.",
  "files": []
}