{
  "course_name": "Comparative Security and Sustainability",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Political Science",
    "Comparative Politics",
    "International Relations",
    "Public Administration",
    "Security Studies",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Political Science",
    "Comparative Politics",
    "International Relations",
    "Public Administration",
    "Security Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Summary\n\nThis course is in three parts with each part consisting of seminar sessions focusing on specific topics. Together they cover aspects of theory, methods, and empirical analysis within security and substainability of states in international relations.\n\nPart I: Framework and Approach\n\nFocuses on comparative approaches to security and sustainability in national and international contexts, with special emphasis on constraints and options, as well as strategies and policy choice. Theoretical foundations include: definitions of core concepts; implications of underlying assumptions and causal logic. Alternative frameworks for theory, research and policy are examined. The focus is on explanatory and predictive potentials.\n\nPart II: Cases and Comparisons\n\nComparisons are undertaken in terms of levels and locations (countries, regions, localities); systems (social, environmental, economic, political technological); methods and models (analytical, empirical and historical); time frame (past, present and future). Coverage includes developing and industrial contexts encompassed in a global perspective. The emphasis on specific countries reflects distinctive patterns of dilemmas and decision.\n\nPart III: Implications and Inferences\n\nMany of the issues examined involve trade-offs, inter-temporal effects, and the creation of new problems as well as possibilities. The challenge is to anticipate the possibilities of creating security as well as sustainability.\n\nCourse Requirements\n\nCourse requirements include\n\nThe written requirement\n\nA mid-term exam\n\nRegular reading of the assigned materials\n\nActive class participation and discussion\n\nDetails about the written requirement can be found in the\nassignments\nsection.\n\nMid-term Exam\n\nEveryone is expected to take the mid-term exam. It is intended to allow the instructor to give you feedback. The mid-term is take home, open book, and questions with choice. If you do well, it will be counted for you. If you do not do well, it will not be counted against you.\n\nGrading Criteria\n\nThe grading scheme follows the course requirement format and will be weighted as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten Requirement\n\n50%\n\nMid-term Exam\n\n10%\n\nRegular Reading of the Assigned Materials\n\n20%\n\nActive Class Participation and Discussion\n\n20%\n\nCourse Materials\n\nAll reading assignments are listed in the\nreadings\nsection. Other readings may be assigned from other books during the term. Copies of the books are on reserve at Dewey library.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nPart I: Framework and Approach\n\nIntroduction\n\nConcepts and Theories\n\nModes of (In)security and (Un)sustainability\n\nLocal Conditions and Global Dilemmas\n\nPart II: Cases and Comparisons\n\nWhen People Move or Boundaries Shift\n\nWhen Resources are \"Scarce\"\n\nWhen Environments \"Strain\"\n\nWhen Regimes Fail or States Collapse\n\nWhen Wars Happen\n\nPart III: Implications and Inferences\n\nTechnology Imperatives\n\nManaging Security and Sustainability\n\nDesign Systems for Security and Sustainability",
  "files": []
}