{
  "course_name": "Concept-Centered Teaching",
  "course_description": "Do you like teaching, but find yourself frustrated by how little students seem to learn? Would you like to try teaching, but are nervous about whether you will be any good at it? Are you interested in new research on science education? Research in science education shows that the greatest obstacle to student learning is the failure to identify and confront the misconceptions with which the students enter the class or those that they acquire during their studies. This weekly seminar course focuses on developing the participants’ ability to uncover and confront student misconceptions and to foster student understanding and retention of key concepts. Participants read primary literature on science education, uncover basic concepts often overlooked when teaching biology, and lead a small weekly discussion session for students currently enrolled in introductory biology classes.\nThe instructor for this course, Dr. Kosinski-Collins, is a member of the HHMI Education Group.",
  "topics": [
    "Science",
    "Biology",
    "Teaching and Education",
    "Curriculum and Teaching",
    "Science",
    "Biology",
    "Teaching and Education",
    "Curriculum and Teaching"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nDo you like teaching, but find yourself frustrated by how little students seem to learn? Would you like to try teaching, but are nervous about whether you will be any good at it? Are you interested in new research on science education? If so, 7.391 is the course for you!\n\n7.391 is a weekly seminar on science education open to both graduate and undergraduate students. Participants will read primary literature on science education, uncover basic concepts often overlooked when teaching biology, and lead a small weekly discussion session for students in MIT course 7.02. Students will be encouraged to review lecture material posted on the web for 7.014 or attend review sessions for 7.02 to obtain a first-hand view of the material being covered. Current students will be paired with mentors from last semester's course.\n\nResearch in science education shows that the greatest obstacle to student learning is the failure to identify and confront the misconceptions with which the students enter the class or those that they acquire during their studies. This course focuses on developing the participants' ability to uncover and confront student misconceptions and to foster student understanding and retention of key concepts.\n\nParticipants are encouraged to remain in the program as mentors for the fall semester.\n\nCourse Format\n\nThe course will have three components, reading primary literature in science education, discussing key concepts in select areas of biology, and leading a discussion group for the students taking Introductory Biology lab or lecture (7.014 or 7.02).\n\nWe will discuss at least one original paper each week. The papers must be read in advance of the class. Our goal will be to critically analyze these papers. To help us achieve that goal, each of you will be expected to email to the instructor two discussion questions for the article covered that day by the morning of the class. In discussing the papers, we will focus on articulating the main points of the paper, identifying conditions under which the data was collected and assumptions used in interpreting the data, and discussing how the results could be applied to the teaching environment at MIT.\n\nStarting in the third week of class, seminar participants will lead a small (no more than 5 students) discussion groups for students enrolled in 7.014 or 7.02. There will be one session of each discussion group a week and each session will last approximately an hour. A mentor from last semester's class will be partnered with you to help facilitate the discussion. Students leading discussions for 7.02 will be required to attend bi-weekly meetings with the 7.02 staff to orient themselves with the material to be presented. Students leading discussions for 7.014 will be asked to attend lecture if possible or review old lecture material.\n\nAttendance\n\nThis is a discussion class, so attendance is mandatory. You are allowed to miss one of the 15 sessions of the class, but please notify the instructors ahead of time. You will also need to arrange to pick up the paper for the next week from the course instructor. If you need to miss a second class, you must talk to the instructors ahead of time so we can arrange an appropriate make-up assignment.\n\nAssignments\n\nClass participants are required to lead a discussion session with currently enrolled introductory biology students. There are writing assignments based on preparation work for these discussion sessions. Participants will also be required to give several oral presentations on class readings and run a selected concept discussion during a portion of the seminar.\n\nGrading\n\nThe course is pass/fail. Participation in class discussion, completion of the assignments above, and satisfactory attendance will result in a passing grade.",
  "files": [
    {
      "category": "Resource",
      "title": "assess.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/21e19078d50c9316361d02bf2b90dbbe_assess.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 10: May 3, 2006\n\nActivity 1\n\n- Ask the students to brainstorm the different ways in which they have been graded\nin the past.\n- Discuss the type of class in which these methods were used and which method\nthey feel was most effective in determining how much they learned.\n\nAssessment\n\nI. Basic Tools for Assessment\n\n1. How many students do you need for a good sample size?\n\n2. What is the best way to ensure your students are benefiting from new teaching\ntools?\n\n3. What are the different types of assessments and what are the pros and cons of\neach?\n\n4. Is retention an important tool in assessment? How do you gauge retention?\n\n5. Some schools are moving to all pass/fail classes. Is this type of assessment better\nor worse for students? What type(s) of student(s) excel in these circumstances?\n\n6. Is grade assignment necessary? What is the purpose of grades?\n\n7. Is scaling a useful process? Who does it benefit? Who does it harm? Have you\nbeen in scaled classes before? What is your impression of the process?\n\n8. What are the different methods of scaling? Discuss the pros and cons of each\nmethod."
    },
    {
      "category": "Resource",
      "title": "bcf.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/f1cc0e40cbfaa724e84a4fe665c9dac8_bcf.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 3: March 1, 2006\n\nActivity 1\n\n- Ask the class to come up with a list of topics they feel are vital for students to\nlearn in introductory biology.\n- Write down all topics on the board whether or not everyone agrees.\n- Go through the list one by one and discuss whether or not the entire class agrees\non the inclusion of the topic.\n- Discuss how this exercise represents the problems faced when establishing a\nnational curriculum\n\nActivity 2 (time permitting)\n\n- The shape game\n\nConcept Inventory\n\nI. The MIT BCF\n\n1. Should students be given this framework of organized topics? Why or why not?\n\n2. Is this framework useful for others outside the realm of MIT? Why or why not?\n\n3. How is this method of topic organization useful? What is problematic about it?\n\n4. The suggestion was made to increase the scope of the BCF to include upper level\nclasses like genetics, biochemistry and molecular biology? How feasible is this\nplan? Do you think having a BCF for upper level classes would be useful?\n\nII. Using the Concept Framework idea in the outside world\n\n1. How do you chose what concepts should be included? Is the list exhaustive in\nterms of details or does it just deal with major concepts and issues?\n\n2. Who should provide input as to what gets included in the framework? Do you\nthink the input of nonbiologists is useful? If not, why? If so, in what way(s)?\n\n3. Producing a framework like this seems like a really good exercise for\ninstructors to do to make themselves tease apart the many concepts they want\nto teach, prioritize them, and communicate them to their fellow teachers,\nbut it is also a lot of work. Can you reach most of the same goals\nby conceptual teaching without an organized framework or not? How?\n\nMSKC 2006\n\n4. Should we have a national biology curriculum? If so, what topics should a\nnational curriculum include? How would we assess that all of our students were\ngetting all the information?\n\n5. Should all students be required to learn the same \"core\" group of biology topics?\n\n6. People have begun to suggest standardized tests should be used at the\nlevel. Could frameworks like this be used as the foundation for better\nstandardized tests, ones that could focus on conceptual learning rather than\nregurgitation? How hard would it be to get a broad consensus on what biological\nconcepts students should master if, say, a national college-level biology exam\nwere to be written?\n\n7. Is it valuable to have a majors class and non-majors class? Would the non-majors\nbe better served by getting the hierarchical concepts in a class that relates to\neveryday life and how it relates to biology?\n\n8. Is it better to test cross-referenced concepts together or to test concepts in a\nhierarchical manner? Is there a preference for students to learn in one particular\nmanner?\n\n9. As students many of us have been condition to learn my memorization, Do\nstudents have a hard time adjusting to learning by this concept-mapping\ntechniques?"
    },
    {
      "category": "Resource",
      "title": "casestud.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/ba6d1d06c02c0e4bcd093d9e42b77c3d_casestud.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 6: April 5, 2006\n\nActivity\n\n- Have the students brainstorm possible topics in biology that would lend\nthemselves to case study format.\n- Make the students choose one topic and design a scenario for it in the classroom.\n\nCase Studies\n\nI. Legistics\n\n1. Should case studies be worked in or out of class?\n\n2. Should students work together or alone? Why?\n\n3. How do you grade case studies?\n\nII. Case Studies\n\n1. Do certain topics in biology lend themselves to case studies? If so which ones\nand why?\n\n2. How effective is a case study module for teaching large courses?\n\n3. Should lecture be used to supplement information presented in case studies?\n\n4. Allowing studies to design their own experiments for the case study becomes very\nexpensive. Is there a way to do this and keep the cost down?\n\n5. In high school, could a case study class take the place of multiple subjects? A\ncollege nonmajors science class?\n\n6. How often would a case study based class have to meet? More or less often than\na traditional lecture?\n\n7. How can you use case studies in large lecture classes?\n\n8. In what context do you use case studies? To supplement lecture? Instead of\nlecture? Is the use topic dependent?"
    },
    {
      "category": "Resource",
      "title": "conceptmap.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/25007bc28f24a6fed155f69be4e477e9_conceptmap.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 5: April 12, 2006\n\nActivity\n\n- Ask the students to develop a crude concept map using the basic concepts of\nbiology under the headings \"Genetics\", \"Biochemistry\", and \"Molecular\nBiology.\"\n- Discuss the possible impact of such maps on student understand of the big picture\nin introductory biology.\n\nConcept Mapping\n\nI. Group Dynamics\n\n1. For concept mapping is it better to have the students in the same groups all year or\nto mix the groups up?\n\n2. Should concept-mapping be done alone or as a group?\n\n3. How should groups be assigned for this type of activity?\n\nII. Creating a concept map\n\n1. Should you teach your students how to do a model concept map in class so they\nknow how to do it before assigning the individual concept map?\n\n2. Which students benefit the most by concept mapping? The struggling students or\nthe \"smart\" ones?\n\n3. Would this approach work better or worse in a setting including a group of\nstudents with diverse science backgrounds?\n\n4. Are there certain subjects in biology that lend themselves better to concept\nmapping than others? Which ones? Why?\n\n5. Should the teacher periodically go over the maps with the students or allow them\nto work on their own?\n\n6. Will the students benefit from trading maps?\n\n7. How do you make sure all students are participating?\n\nMSKC 2006\n8. How do you make sure that the concept map is not seeding misconceptions as\nopposed to reinforcing truths?\n\n9. How do you grade a concept map?\n\n10. Is concept mapping or the group learning component that increases student\nlearning?"
    },
    {
      "category": "Resource",
      "title": "coop.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/4ad2bda8fe8729dbe11429d49c90ded5_coop.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 5: March 22, 2006\n\nActivity\n\n- Ask the students to think of the different ways they were assigned to groups and\nwrite down the methods on the board.\n- Discuss the pros and cons of each method and what their personal impressions\nwere of each style.\n\nCooperative Learning\n\nI. Assigning Groups\n\n1. What is the best way to assign groups?\n\n2. What are the problems involved in assigning group work?\n\n3. What are the benefits of group work?\n\n4. How do you assess the contribution of each member of the group and ensure that\nthe students are not having one excellent student do the work for them?\n\n5. Is it better to have students of varying degrees of understanding working together\nor a more uniform understanding of biology?\n\n6. How can cooperative learning be used in a lecture classroom?\n\n7. How do you know your cooperative learning efforts have had a positive impact on\nstudent performance?"
    },
    {
      "category": "Resource",
      "title": "evolution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/c7e1e58d5e5d841a97ae14c172812127_evolution.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 12: May 17, 2006\n\nActivity\n\n- Have the students design their own end-of-term evaluation sheet\n- Have them copy the evaluation down and submit it after class. Be sure to\nemphasize that all points of view are important and valid!\n\nEvolution\n\nI. The Evolution Controversy\n\n1. Should evolution be taught in public schools? Should rationale design be taught?\n\n2. In which grade should we begin teaching evolution? At what age are students\ncapable of understanding evolution?\n\n3. Is biology the only subject that should address evolution? If not, where else does\nit fit in a school curriculum?\n\n4. Should students whose religious beliefs conflict with evolution be allowed to\nabstain from this portion of the curriculum?\n\n5. When and where was evolution introduced to you? Was a religious component\nincluded as well?\n\n6. Should textbooks include chapters on evolution? Discuss the disclaimer stickers\nbeing applied to books in some communities.\n\n7. How has the media influenced the evolution argument?\n\n8. What is the difference between a scientific theory and a normal \"theory\"? How\ndo we enforce the different meanings?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecturelab.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/63e3f9194d09a3ece66db544f15c62b4_lecturelab.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 8: April 19, 2006\n\nActivity\n\n- Ask the students to brainstorm the different ways in which a laboratory could be\nincorporated into a school curriculum as a stand alone class, in addition to lecture,\nas a project lab, etc.\n- Discuss the pros and cons of each format\n- Ask the class to come to a consensus as to which is the best method\n\nLaboratories\n\nI. Concept Laboratories\n\n1. Is it practical to design an entire semester-based concept lab?\n\n2. Can a concept-based lab be used in a large lecture hall?\n\n3. Do you think in class demonstrations can replace lab?\n\n4. Why is it so hard to design \"good\" labs?\n\n5. Should students be required to design their own experiments? Is this practical?\nHow do you ensure they are understanding the concept at hand?\n\n6. How can teachers of AP biology use labs more effectively?\n\n7. Should discussions be a required component of lab?\n\n8. Should labs be graded? Why or why not?"
    },
    {
      "category": "Resource",
      "title": "miscon.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/b059bbecbfdb04af7e9af41e2618bd3c_miscon.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 2: February 22, 2006\n\nDecide on Discussion Group Times\n\nWednesday 4 pm\n\nThursday 4 pm\n\nFriday 2 pm\n\nActivity\n\n- Ask the students to come up with a concept taught in introductory-level biology.\n- Write the concept on the board and have the class break the statement down into\nindividual concepts.\n- Discuss how students in an intro class can get confused by complex ideas that we\ntake for granted and the levels of understanding it takes to explain the original\nconcept.\n\nConfronting Student Misconceptions\n\nI. Background about misconceptions\n\n1. At what age do students develop misconceptions?\n\n2. How are these misconceptions seeded?\n\n3. Is a student more likely to have misconceptions in science classes than in other\nsubjects?\n\n4. Do certain groups of students come into a class with different misconceptions\nbased on race, gender, social status, etc.?\n\nII. What are misconceptions?\n\n1. How can we identify what misconceptions our students have in a timely manner\nbefore the class begins?\n\n2. How can we confront the misconceptions that our students have?\n\n3. How can we make our students aware of their misconceptions?\n\n4. How do we reinforce truths?\n\n5. How can we design a curriculum that enforces concept-centered teaching?\n\nMSKC 2006\n\n6. Does concept-centered teaching work for all ages?\n\n7. If we make our students aware of their misconceptions, do we actually risk\ncausing the misconception to take a greater hold?\n\n8. How do we combat misconceptions, when those very same thoughts may be\nreinforced in other settings?\n\nIII. Questions specific to the readings\n\n1. How are two-tiered questions used in these studies? Do you feel these types of\nquestions are effective means of assessing student misconceptions? How do\n\"strategic test-takers\" fair in these assessments?\n\n2. Did the teachers in these examples bias the results by his/her bias towards the\neffectiveness of concept-centered teaching? Are the assessment methods\nappropriate?\n\n3. How were the questions to test misconceptions formulated? How do you pin-\npoint misconceptions if you do not know what your students do not understand?\n\n4. Because different scientific disciplines teach the same processes, like diffusion\nand osmosis, from different angles, can we write exams that keep in mind all the\ndifferent views of the same processes?\n\n5. How could we apply the conceptual change method to larger classroom settings?\n\n6. Is the conceptual change method a new way of teaching, or just a way of\nsystematically doing what effective teachers do automatically?\n\n7. Can such a method be used by high school teachers that were only forced to\n\"know\" material in college, and never really came to \"understand\" the material\nthemselves?\n\n8. How do you delineate between what people \"know\" and what they \"understand\"?"
    },
    {
      "category": "Resource",
      "title": "multintel.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/2c3d652ce0256da52dd0431c8da630e2_multintel.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 4: March 8, 2006\n\nActivity\n\n- Go around the room and ask each student to decide which intelligence most\naccurately reflects them. Encourage them to give multiple categories if they think\ntheir personality is reflected by more than one. Write all the categories on the\nboard.\n- Discuss as a class any trends observed in the categories and whether or not they\nfeel biology majors tend to be a particular intelligence.\n\nMultiple Intelligences\n\nI. Multiple Intelligences\n\n1. 1. Does anyone really fall into one category or are we a combination of many\ntypes of intelligences of varying degree?\n\n2. Who is Piaget and what were his theories on intelligence and development?\n\n3. Is visual intelligence really separate from logical intelligence if it allows one to\nsolve puzzles?\n\n4. Are there other intelligence theories or is the Garner theory the most accepted?\n\n5. When do people reach the peak end-state of these intelligences? How do you\nassess the peak?\n\nII. MI and Biology\n\n1. How can we determine at the beginning of a course in which intelligence our\nstudents excel?\n\n2. What types of activities and exercises can be designed in biology for students of\ndifferent intelligences?\n\n3. Which intelligences are most developed in students who major in biology?\n\n4. Do current methods of teaching biology cater and/or select for certain\nintelligences?\n\n5. How can MI be used in concept-centered teaching?\n\nMSKC 2006\n\n6. Can a teacher really teach in different ways to cater to all of his/her students'\ndifferent intelligences?\n\n7. Should teachers try and develop weaker intelligences in their students? How?\n\n8. Does our society value some intelligences over others?\n\n9. Should teachers try to teach to a student's particular intelligence or should\nteachers try to help the student become more adept at their weaker intelligences?\n\n10. Is teaching to multiple intelligences realistic in large lecture classrooms?"
    },
    {
      "category": "Resource",
      "title": "predictors.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-391-concept-centered-teaching-spring-2006/427ef3cd2fb28e1177093976fc3adefc_predictors.pdf",
      "content": "MSKC 2006\n7.391 Concept-Centered Teaching\nSemester I\n\nDiscussion Day 9: April 26, 2006\n\nActivity\n\n- Ask the class to brainstorm topics we covered in high school physics\n- Discuss what we do and don't remember and discuss if asking college students to\nremember high school is the best way to assess predictors of college success.\n\nLaboratories\n\nI. Predictors of Success in College\n\n1. How important do you think race, ethnicity, gender, social economic class, etc.\nare in predicting someone's success in biology? What can teachers do to help\nstudents overcome these variables?\n\n2. How do we retain minorities in science? Are there programs specifically\ndesigned to do this?\n\n3. Do you think particular textbooks are better or worse in preparing students for\ncollege biology or the faculty involved is more important?\n\n4. The paper suggests changes in high school physics courses that could help better\nprepare students. Could these changes be applied to college, too?\n\n5. A movement has now been made to include TEAL-like classrooms or class talk in\ncollege physics classrooms. Do you think these devices and methods are\neffective?\n\n6. This paper uses college grades as a measure of success. Are grades the only\nmeasure of success? What about retention? How do we assess these ideas?\n\n7. Why does having a professor of the same gender as the student increase the\nstudent's performance?\n\n8. How can covering fewer topics help the students understanding and retention?\n\n9. Why are homework problems negatively correlated with students' grades?\n\n10. Why do demonstrations and demonstration discussions not help students learn\nphysics?\n\n11. Are all of the correlations and regressions really useful values?"
    }
  ]
}