{
  "course_name": "Contemporary French Film and Social Issues",
  "course_description": "This course covers issues in contemporary French society as expressed through movies made in the 2000s. Topics include France’s national self-image, the women’s movement, sexuality and gender, family life and class structure, post-colonialism and immigration, and American cultural imperialism. Films by Lelouch, Audiard, Doillon, Denis, Klapisch, Resnais, Rouan, Balasko, Collard, Dridi, Kassovitz, and others. Readings from French periodicals. Films shown with English subtitles. Taught in French.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Society",
    "European and Russian Studies",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nPrerequisites\n\nOne intermediate subject in French or permission of instructor.\n\nLe cours\n\nDans ce cours, nous allons explorer plusieurs aspects de la societe francaise contemporaine a travers l'etude des films (et des emissions televisees) recents qui abordent trois grands themes : (1) la race, la classe sociale, et l'immigration ; (2) le sexe, le genre, et l'amour ; et (3) l'histoire et la famille. Avec l'aide des textes - critiques de film et articles de presse - ces films nous aiderons a mieux comprendre le cinema, la societe, et la culture de la France contemporaine. En plus, les etudiants apprendront le langage necessaire pour parler des films et amelioreront leur expression a l'orale et a l'ecrite. Films projetes en francais avec des sous-titres en francais. Cours entierement en francais.\n\nNotes finales\n\nACTIVITES\n\nPERCENTAGES\n\nParticipation\n\n20%\n\nReponses\n\n20%\n\nDiscussion\n\n15%\n\nPapiers\n\n35%\n\nPresentation\n\n10%\n\nParticipation\n\nVotre presence et participation en classe sont essentielles et obligatoires. Les discussions sont essentielles pour comprendre ce que nous regardons ensemble et ameliorer votre francais parle. Votre note de participation prend en compte non seulement votre presence mais la qualite (et pas simplement la quantite) de votre participation dans les discussions.\n\nReponses :\nChaque semaine vous ecrirez une reponse ecrite au film(s) de 500 mots. Je demande que ces reponses articulent un argument sur le film et la societe francaise. Je vous donnerai une question a laquelle vous pouvez repondre. Ils seront notes ✔+, ✔, ou ✔-.\n\nDiscussion Leader\n: Vous allez, avec un de vos collegues de classe, etre responsable de mener la discussion pour une classe. C'est a dire, vous allez preparer des questions a poser au group, les activites a faire, les textes a lire et discuter, les scenes a regarder de plus pres.... La semaine ou vous etes responsable de discussion vous n'avez pas de reponse a rendre.\n\nPapiers et Presentation\n\nMy French Film Festival\n(10%) : Regardez tous les courts metrages en competition et choisissez le film qui vous parle le plus de la societe francaise contemporaine. Ensuite vous allez ecrire une critique (1 500 mots) du film. En justifiant votre choix, prenez bien en compte les autres films. Utilisez au maximum les techniques d'analyse de film et les idees du cours et modelez votre critique sur les critiques que nous avons lus en cours.\n\nPapier de recherche (25%) : Dans ce papier vous allez approfondir votre comprehension d'un des themes du cours (2 500 mots). Vous allez lire des textes sur le sujet de votre choix et regarder 4 films de plus. Vous pouvez vous concentrer sur un realisateur, un theme, une annee, ou suivre un sujet au cours des annees.\n\nPresentation de projet de film (10%) : Vous allez travailler en groupes de 3. Vous etes realisateurs et vous venez de savoir que l'annee prochaine Canal+ va subventionner une serie de 5 films sur la societe francaise contemporaine. Vous avez une envie folle d'etre choisis. Quel sujet choisissez-vous ? De la fiction ou du documentaire ? Qui sont les personnages principaux ? Ou allez-vous tourner ? Vous avez 10 minutes (et pas plus) pour utiliser des images (qui communiquent le choix de lieux, couleurs, personnages, ton), de la musique, et vos paroles les plus persuasives de vendre l'importance artistique et sociale de votre projet a Canal+.\n\nProgramme du cours\n\nSess #\n\nSujets\n\nDates Cles\n\nIntroduction\n\n2, 3\n\nRace, classe sociale et immigration\n\nReponse 1 a rendre\n\nSociete a la television\n\nReponse 2 a rendre\n\n5, 6\n\nRace, classe sociale et immigration\n\nReponse 3 a rendre\n\nPremier papier a rendre\n\n7, 8\n\nRace, classe sociale et immigration\n\n9, 10\n\nSexe, genre, et amour avec invitee Genevieve Sellier\n\nReponse 4 a rendre\n\n11, 12\n\nSexe, genre, et amour\n\nReponse 5 a rendre\n\n13, 14\n\nSexe, genre, et amour (cont.)\n\nReponse 6 a rendre\n\n15, 16\n\nHistoire et famille\n\nReponse 7 a rendre\n\nPlan de projet de recherche a rendre\n\nHistoire\n\nHistoire (cont.)\n\nReponse 8 a rendre\n\nPapier de recherche a rendre\n\n19, 20\n\nHistoire et famille\n\n21, 22\n\nHistoire et famille (cont.)\n\nReponse 9 a rendre\n\nCours annule\n\nPresentations de projets de film\n\nPresentations",
  "files": []
}