{
  "course_name": "Contemporary Literature: British Novels Now",
  "course_description": "What is Britain now? Its metropolises are increasingly multicultural. Its hold over its distant colonies is a thing of the past. Its sway within the global political arena is weak. Its command over Northern Ireland, Wales, and Scotland is broken or threatened. What have novelists made of all this? What are they writing as the old empire fades away and as new social and political formations emerge? These are the questions that will concern us in this course.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "Fiction",
    "Philosophy",
    "Humanities",
    "Literature",
    "Criticism",
    "Fiction",
    "Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWhat is Britain now? Its metropolises are increasingly multicultural. Its hold over its distant colonies is a thing of the past. Its sway within the global political arena is weak. Its command over Northern Ireland, Wales, and Scotland is broken or threatened. What have novelists made of all this? What are they writing as the old empire fades away and as new social and political formations emerge? These are the questions that will concern us in this course. Our material will come from the Guardian newspaper's recent list of the best British, Irish, and commonwealth novels of the past 25 years, and will include JM Coetzee, Kazuo Ishiguro, Martin Amis, Margaret Atwood, Yann Martel, and Zadie Smith. Major contexts will be immigration and the multicultural metropolis, political devolution, post-industrialism and the EU, and the New American Empire.\n\nCourse Objectives\n\nThis is a seminar, which means that much of our time will be spent speaking to one another about our common experience of reading fiction and wondering about how to make the best sense of it. My own goal is not to teach you some absolute and predetermined facts, but to figure out what knowledge you already have and to help you develop that in order to create more. To this end, I want you to view yourselves as\nactive\nreaders and seminar participants, and as people committed to improving their skills as readers and as writers. I will provide you with a set of tools (really, mental equipment) that will help make this all happen. Since much of our time will be spent in active debate and conversation, I will expect each student to behave professionally and respectfully in this setting, as well as in all communications that stem from your involvement in this course (i.e. online forums, emails, or study group activities).\n\nGrading and Assignments\n\nREQUIREMENTS\n\nPERCENTAGES\n\nThree argument-based essays (20% each)\n\n60%\n\nTwo presentations (10% each)\n\n20%\n\nMini-conference paper\n\n10%\n\nActive participation\n\n10%\n\nThree Argument-Based Essays\n\nEssay 1: 3 pages\n\nEssay 2: 4-5 pages\n\nFinal paper: 8-10 pages\n\nPlease see\nassignments\nfor criteria and guidelines for your papers. The assignment will be broad enough to allow you to explore your specific ideas and interests, but will demand close analysis of short passages from the\nreadings\n.\n\nOn the assigned due date bring one paper copy to class or to my mailbox by 5pm. I can only provide extensive commentary on your writing and argument - and\nI will\n- if I receive your materials on time. Late papers will also lose 1% (of the course total 100%) each working day; they should be brought to the main Literature office, during working hours, and dated by the administrative assistant.\n\nPlease read and understand the following policy statement: \"Plagiarism - use of another's intellectual work without acknowledgement - is a serious offense.\" It is the policy of the Literature Faculty that students who plagiarize will receive an\nF\nin the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work.\nF\nFor further guidance on the proper forms of attribution, consult the style guides available at\nMIT Writing and Communication Center\nand the\nMIT Academic Integrity\n.\n\nTwo Presentations\n\nOne on a critical reading (see\nreadings\n)\n\nOne leading our discussion of a novel\n\nMini-Conference Paper\n\nBetween 5 and 10 minutes, telling the class about your final paper\n\nAttendance\n\nAttendance in this class is mandatory. Provided I have been alerted, each student will be allowed two absences. As the third absence is reached the student will lose 1% (of the course total 100%) for each incident. Being late is a form of absence, and I will use my discretion to decide when a sufficient number of late arrivals becomes equivalent to one day of absence.\n\nPlease do not bring food, cell phones, or laptops to class. I will make an exception for your laptop if its use is class-related.",
  "files": [
    {
      "category": "Resource",
      "title": "Characteristics of Contemporary Literature",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-488-contemporary-literature-british-novels-now-spring-2007/da92a1286f31e5d301d3e796acc8eb25_contemp_lit.pdf",
      "content": "21L.488\nContemporary Literature\nSpring 2007\n\nCharacteristics of Contemporary Literature\n(constructed, collectively, throughout the course)\n\n1. Uses code switching between elevated literary language and \"lower\" forms,\nbetween high art and low art\n2. Deploys metafictional techniques to draw our attention to the work's relationship\n(or non-relationship) to \"reality\"\n3. Emphasizes performative nature of our identities; they aren't \"true\" or natural\nbut just seem that way because they are consistent and persistent\n4. Emphasizes fragmentation in human experience of postmodern culture, and as\nan artistic strategy\n5. Breaks down our faith in the supremacy of the rational, scientific human being\n(e.g. comparisons between animals and humans and machines)\n6. Questions our ability to understand ourselves and our culture\n7. Questions omniscience by questioning our ability to accurately see reality\n8. Questions the link between language and reality (everything is a biased\nrepresentation)\n9. Depicts border-crossing and migration as fundamental to human experience\n10. Emphasizes the permeability of old boundaries: between men and women;\nbetween the East and the West; between high and low culture\n11. Shows people struggling to find meaning in a world that doesn't offer us the old\nassurances (of either faith or science)\n\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on\n[DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "postmodernism.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-488-contemporary-literature-british-novels-now-spring-2007/dd592c77975c8e8894076564795c4333_postmodernism.pdf",
      "content": "Sarah Brouillette\n21L.488, Spring 2007\nPostmodernism in 30 Minutes\n\nImage: Richard Hamilton, Just What Is It That Makes Today's Home So Different, So\nAppealing? (1956, Collage)\n\nWhat is (was?) Modernism?\n\n1. Early 20th-century aesthetic movement (esp. 1910-30): TS Eliot, Virginia Woolf,\nJames Joyce, Marcel Proust, Franz Kafka, etc.\n\n2. Rejected Victorian notions of art: its purposes, its formal features, and its\nrelationship to its audience\n\n3. Emphasizes individual experience and perception (impressionism); concern with\nhow the world is experienced (rather than what the world is). Think stream-of-\nconsciousness writing.\n\n4. Movement away from fixed narrative points of view, like omniscient \"all seeing,\nall knowing\" narrators.\n\n5. Interest in blurring the boundaries between poetry and prose: less obviously\ndistinct than they once were\n\n6. Interest in fragmentation and collage\n\n7. An emphasis on self-reflexivity: the work of art draws attention to itself as a work\nof art\n\n8. Blurring of the boundaries between popular art forms (photography, advertising,\nlater film) and 'high art' categories\n\nWhat is Postmodernism?\n\n1. Later 20th-century aesthetic movement, ongoing now\n\n2. Rejected Victorian notions of art: its purposes, its formal features, and its\nrelationship to its audience\n\n3. Emphasizes individual experience and perception (impressionism); concern with\nhow the world is experienced (rather than what the world is). Think stream-of-\nconsciousness writing.\n\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nSarah Brouillette\n21L.488, Spring 2007\n4. Movement away from fixed narrative points of view, like omniscient \"all seeing,\nall knowing\" narrators.\n\n5. Interest in blurring the boundaries between poetry and prose: less obviously\ndistinct than they once were\n\n6. Interest in fragmentation and collage\n\n7. An emphasis on self-reflexivity: the work of art draws attention to itself as a work\nof art\n\n8. Blurring of the boundaries between popular art forms (photography, advertising,\nfilm, digital media) and \"high art\" categories\n\nSo What's the Difference?\nModernism\ny laments fragmentation and\ndisorder as decay\ny art offers a respite from the\nperils of life in a mass society\nPostmodernism\ny celebrates bricolage and\npastiche as play\ny art is helpless, but fun!\n\nEnlightenment Ideas\n\n1. I have a stable and coherent self who is rational and universal\n\n2. I know the world through reason and rationality\n\n3. I produce objective truth or \"science\" that isn't constrained by me\n\n4. This truth is what leads to progress and improvement\n\n5. Reason, truth, and \"the good\" are synonymous\n\n6. Science is the best application of my rationality: it is neutral and objective and\nunbiased\n\n7. Language is how rationality is expressed and its discoveries communicated; it is\n\"transparent\" and can objectively represent the reality or the world (think\nphotography)\n\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY].\n\nSarah Brouillette\n21L.488, Spring 2007\n8. There is no difference between objects in the world and the words used to name\nthem in language\n\n9. These premises stand behind and support EVERYTHING: democracy, law,\nethics, and aesthetics\n\nBack to Our Question: What is Postmodernism?\n\n1. a challenge to order\n\n2. a dismantling of enlightenment ideas behind modern culture\n\n3. the end of \"master narratives\" - the grand stories we tell ourselves about\nourselves and our culture: Progress; Science; Rationality; God\n\n4. the recognition of small, provisional kinds of knowledge\n\n5. no stable rational self observing the world\n\n6. self is fragmented and doesn't understand its own ways of operating, has a deep\npsychology that splits it into many bits and parts\n\n7. the observing self influences the creation of \"knowledge\" (the observer effect;\nSchrodinger's cat experiment)\n\n8. language doesn't \"represent\" reality; it constructs it and construes it\n\n9. no necessary relationship between words and the objects they name\n\n10. all culture and information is positional; it isn't necessarily \"subjective\" but it\nisn't objective and entirely \"true\" and universal either\n\n11. Human identity is positional too; it isn't natural and \"true\"; it is a performance,\na putting on of a COSTUME that isn't a disguise: The consume IS ALL THERE\nIS\n\nSources:\n\nWitcombefont, Christopher L. C. E. \"Modernism and Postmodernism.\" 2000.\nhttp://witcombe.sbc.edu/modernism/modpostmod.html\n\nKlages, Mary. \"Postmodernism.\" 2003.\nhttp://www.colorado.edu/English/courses/ENGL2012Klages/pomo.html\n\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring\n2007. MIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology.\nDownloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "Postcolonialism 101",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-488-contemporary-literature-british-novels-now-spring-2007/bcbd57aebe9bb2879ac8641e27bd402f_postcolonialism.pdf",
      "content": "Sarah Brouillette\n21L.488, Spring 2007\nPostcolonialism 101\nWhat does the term mean to you?\n1. Labels an historical epoch:\n- The period after the major movement toward decolonization in the former\nEuropean colonies in Africa and India (mostly).\n- Raises the question, what is colonialism?\n- Long process most concentrated in the 19th-century: expansion of the major\nEuropean powers into the rest of the world, establish foreign territories /\nsettlements\n- Propelled by many things\n- Eg. capitalism - the pursuit of new markets for European products, new materials\nto create these products, new things to export:\n- Also religious arrogance; racist theories about the inferiority of other peoples,\nwhich in basic terms meant the white races vs. the other races.\n- Colonial peoples resisted this dominance; in the mid-20th century they started to\nsuccessfully shrug it off.\n- India in 1947; soon followed by Ghana, formerly the Gold Coast, a British colony,\nthe first African nation to decolonize\n- So, then, our contemporary period is postcolonial. We are living in the world after\ncolonialism.\n- South Africa was colonized by the Dutch and the British, as we learned; Canada,\nwhere Yann Martel comes from, was a British settlement; a settler society rather\nthan a colony (what's the difference and why does it matter); Ireland, which we'll\ntalk about when we discuss Roddy Doyle in coming weeks, was a British colony,\nand until very recently many people would have said that Northern Ireland still\nis. So the British have made a mark in all these areas...\n- Problems with this idea?\n1. neo-colonialism\n2. persistence of legacies of postcolonialism\n3. new American Empire (Remains of the Day).\n2. An epistemology / approach to knowledge: a decolonization of\ncertain kinds of thinking to go along with actual decolonization.\n- J. L. Gerome, The Snake Charmer (1870)\no Painting of a naked boy with a snake, a man playing the flute, and an\naudience of men. Muslim architecture in the background.\no Spend a few minutes: write down 5 things you notice about this image\n- Painted in Constantinople in the late 1860s, part of the Ottoman Empire (itself\nmodernizing at this time - what is \"modern\"?)\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY].\n\nSarah Brouillette\n21L.488, Spring 2007\n- Rigid binaries: exotic vs. domestic; rational vs. irrational; science vs. religion;\nenlightened vs. backward; correct vs. immoral or amoral; etc. [relates to\ncharacteristics of Enlightenment modernity].\n- Stemming from an idea popularized by Edward Said and his book Orientalism\n(1978): how certain kinds of European knowledge about \"the rest\" of the world\nmade actual colonial domination possible\n- According to Said, the Occidental world, meaning the Western world, didn't\nrepresent the reality of the East but rather the romantic notion of the \"Orient.\"\nThe Middle East and Asia were viewed with prejudice and racism. They were\ndepicted as backward and unaware of their own history and culture. Western\nwriters and thinkers took on the task of filling this void that they themselves\nimagined, creating a culture, history, and future promise for them.\n- These forms of knowledge need to be dismantled; here there is some overlap with\npostmodernism, as scholars have pointed out that there was no unbiased\nrepresentation of the colonized parts of the world: the act of writing about those\nworlds was always determined by political interest and causes and by the basic\nsocialization of the people doing the writing.\n- Colonized peoples were doing this kind of thinking long before the actual\npostcolonial period, though; so in a way there were \"postcolonial\" ways of\nthinking long before actual decolonization\n- ie. Franz Fanon, who was writing while Algeria was still under French rule\n- So, to sum up #2, \"postcolonialism\" is a way of thinking about knowledge\nproduction, and how certain kinds of knowledge about other peoples can act as a\nprop to economic or military or physical domination. And producing alternative\nideas about these colonized groups can be a very political thing.\n3. A trend in literary studies.\n- After Said especially.\n- He was writing from a position within the Western academy.\n- And writing not about \"native\" forms of knowledge produced by colonized\npeople, but about the Western canon of literary texts and how it produced\nknowledge about the \"other\" parts of the world.\n- So the inequalities of colonialism carry on as a kind of arrangement of the\nproduction of knowledge.\n- The nexus for the production of deconstructing or countering discourses that\nchallenge the dominance of colonialist thought or practice is the WEST.\n- This is an especially sore point for Marxists, who said hey wait a minute,\ncolonialism didn't happen because of certain ideas that Europeans had about the\nrest of the world; colonialism happened because people in the West had more\nmilitary might and more money and could therefore impose themselves on others\nmore successfully.\n- It isn't ideas that make the world turn, it is economics.\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY].\n\nSarah Brouillette\n21L.488, Spring 2007\n- So, in this definition of postcolonialism, it is a movement in the Western\nacademy, something that happens after a bunch of people from formerly\ncolonized nations move to the West and start writing about colonialism, and start\ntalking about Western canonical texts that propped up colonialism\n- and eventually start talking about and teaching texts written mostly by other\nthird world migrants to the first world, and sometimes by writers who continue to\nlive in the third world.\n4. A certain kind of literature; a \"brand\" - the reader will have\ncertain expectations about before reading.\n- at first writers who were considered postcolonial wouldn't be writing with the\nknowledge that there was such a category\n- Salman Rushdie's Midnight Children and Bharati Mukherjee's Jasmine\n- now there are expected tropes and themes that these books will return to, and\nthere is a niche within the publishing industry for just this kind of writing.\n- Products tagged \"postcolonial fiction\" on amazon.com\n- What are the characteristics of this literature? We'll find out, but here are a few\nthings:\no Challenging binaries; championing hybridity and border-crossing of\nhuman identities\no often about migrancy (the post-colonialism influx of formerly colonized\npeoples into the one-time colonial metropolitan centers)\no often uses strategies from postmodernism to achieve its ends\no But we'll talk much more about this in future weeks\n\nCite as: Sarah Brouillette, course materials for 21L.488 Contemporary Literature: British Novels Now, Spring 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD\nMonth YYYY]."
    }
  ]
}