{
  "course_name": "Cosmology",
  "course_description": "This course provides an overview of astrophysical cosmology with emphasis on the Cosmic Microwave Background (CMB) radiation, galaxies and related phenomena at high redshift, and cosmic structure formation. Additional topics include cosmic inflation, nucleosynthesis and baryosynthesis, quasar (QSO) absorption lines, and gamma-ray bursts. Some background in general relativity is assumed.",
  "topics": [
    "Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\n8.942 is the graduate astrophysics version of cosmology and is complementary to 8.952 (Particle Physics of the Early Universe), which emphasizes early universe physics. This course treats modern observational cosmology in some detail, including the Cosmic Microwave Background radiation, galaxies and related phenomena at high redshift, and cosmic structure formation.\n\nPrerequisites\n\nThere are no prerequisites for this course, but permission of the instructor is required.\n\nTextbook\n\nPeacock, John A.\nCosmological Physics,\nCambridge University Press, 1998. ISBN: 9780521422703\n\nGrading\n\n2/3 of the grade will be based on 10 problem sets.\n\n1/3 of the grade will be based on a term paper (approximately 8 pages double-spaced) on a cosmology topic of your choice, due on the last day of class.\n\nThere will be no final exam or other assignments.\n\nHomework Policy\n\nYou may work on the problem sets with other students but must write up the solutions yourself. The problem sets are intended to help you learn the material more than for me to grade you. The problem sets require some background in general relativity and an ability to solve differential equations numerically using MATLAB(r), Maple(r), or Mathematica(r) or other software of your choosing.",
  "files": [
    {
      "category": "Resource",
      "title": "ps0.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/3c2ff0a33ddab96d1e442b63b332cde6_ps0.pdf",
      "content": "Problem Set 0. Not to be turned in.\nThis assignment gives some background reading to prepare you for thinking about\ncosmological models. Problem Set 1 will have problems to hand in. It will be posted by\nTuesday, September 11, and due in class one week later.\n\n1. Browse the links in the Readings section to find what is there. Be sure you know\nhow to download a paper posted to astro-ph. Similarly, be sure you know how to\nfind an astrophysics publication using THE NASA ASTROPHYSICS DATA\nSYSTEM (http://adswww.harvard.edu/). Test yourself by finding an article\npublished in 1998 by Zaldarriaga, Seljak, and myself. (It gives an advanced\ntreatment of cosmic microwave background anisotropies - it isn't meant to be read\nin this course!)\n2. If you have any personal favorite cosmology web pages that aren't listed at the\n8.942 readings page, please email me so that I may add them to the links page.\n3. Read the excellent non-technical synopsis of modern physical cosmology\nprepared for the National Academy of Sciences, Cosmology: A Research Briefing\n(http://books.nap.edu/html/cosmology/). While reading, keep in mind the\nCosmological Principle, an assumption that the Universe is smooth (homogeneous\nand isotropic) on large scales. Clearly the universe is strongly inhomogeneous on\nsmall scales; the closure density is about 30 orders of magnitude less dense than\nthe earth. How might this be compatible with the assumptions underlying standard\ncosmology?\nRead the light overview of cosmology by Michael Turner, \"A Sober Assessment\nof Cosmology at the New Millenium\", PASP, 113, 653 (2001), available at THE\nNASA ASTROPHYSICS DATA SYSTEM (http://adswww.harvard.edu/) and in\npreprint form at astro-ph/0102057 (http://arxiv.org/abs/astro-ph/0102057).\n4. Skim the thorough article \"Final Results from the Hubble Space Telescope Key\nProject to Measure the Hubble Constant\", ApJ, 553, 47 (2001), available at THE\nNASA ASTROPHYSICS DATA SYSTEM (http://adswww.harvard.edu/) and in\npreprint form at astro-ph/0012376 (http://xxx.lanl.gov/abs/astro-ph/0012376).\n5. Review Peacock chapters 1 and 2 in preparation for our foray into relativistic\ncosmological models starting Thursday, September 13."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/ad0dd786fb8a1bbeeacfdc5741bf9de6_ps1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #1\nDue in class Tuesday, September 18, 2001.\n1. Conserved Momenta\nShow the following: If ∂αgμν = 0 for all {μ, ν}, then Pα is conserved along a geodesic\nxμ(λ), where Pα ≡gαβ dxβ /dλ.\n2. RobertsonWalker Metric\nConsider the general RobertsonWalker metric, written in the form\n\" dr2\n#\nds2 = -dt2 + a (t) 1 -kr2 + r (dθ2 + sin2 θ dφ2)\n.\n(i)\nNote that for k > 0 the complete spacetime has two copies of the domain 0 ≤r ≤k-1/2 ,\njust as a unit sphere has two copies of the cylindrical coordinate range 0 ≤√x2 + y ≤1\n(the northern and southern hemispheres).\nFind coordinate transformations that will put the line element in the following forms:\nds2 = a (τ )\nh\n-dτ 2 + dχ2 + r (χ)(dθ2 + sin2 θ dφ2)\ni\n,\n(ii)\n⎡\n⎤\nds2 = a (τ ) ⎣-dτ 2 + dr 2 + r 2(dθ2 + sin2 θ dφ2)\n⎢\n⎥,\n(iii)\n1 + 1kr 2\n⎦\n\"\nk\nds2 = -dt2 + a (t) 1 +\nx + y + z 2 #-2 3\ndx2 + dy2 + dz2\n.\n(iv)\nFor each case, indicate the full range of the variables. Give explicit formulae for r(χ)\nand r(r). (Hint: Different forms may be required for k > 0, k < 0, and k = 0. Note also\nthat a(τ ) is not the same function of its argument as a(t).)\n3. Cosmological and Doppler Redshifts\nConsider an object with radial coordinate χe in a RobertsonWalker spacetime (using the\nform ii given in Problem 2). The object emits a burst of nearly monochromatic radiation\nat time τe with wavelength λe in its own rest frame. A fundamental (comoving) observer\nis at χ = 0 with 4velocity ~Vo = a-1~eτ . The observer detects the radiation at time τo\nwith wavelength λo. The redshift is defined as z ≡(λo/λe) -1.\n\na) Assume that the emitter is comoving (i.e. at fixed spatial coordinates) so\nthat its fourvelocity is ~\nVe = a-1~eτ where ae ≡ a(τe). Evaluate the redshift\ne\nin terms of the expansion scale factor a(τ ).\nb) Now suppose that the emitter is no longer comoving. Instead, it has a radial\n\"peculiar\" velocity component vr , which is the radial threevelocity measured\nby a comoving observer at χe.\n(In other words, vr is the radial velocity\ncomponent in an orthonormal basis fixed at χe.)\nWhat are the emitter's\nfourvelocity components V τ and V χ in terms of vr and ae? Show that your\ne\ne\nresult makes sense in the noncosmological limit a(τ ) = constant. (Do not\nassume v ¿ 1.)\nr\nc) Continuing part b), what is the object's redshift as seen by the observer?\nShow that if a(τ ) = constant, you recover the radial Doppler shift formula of\nspecial relativity while if vr = 0 you recover part a).\nd) Now suppose that the emitter also has a tangential velocity (relative to the\ncomoving frame) with orthonormal components vθ and vφ, i.e. the peculiar\nvelocity has arbitrary direction. Show that the redshift is given by\nao 1 + vr\n1 + z =\n.\nae\n√\n1 - v\ne) (Bonus challenge): Suppose that the observer at χ = 0 is no longer comoving\nbut has a threevelocity v\nrelative to the comoving frame. How is 1 + z\no\nmodified from part d)?\n4. An Empty Universe\nFor a k = -1 RobertsonWalker spacetime with ρ = p = 0 show from the Friedmann\nand energy conservation equations that the line element becomes\nds2 = -dt2 + t2 h\ndχ2 + sinh2 χ\ndθ2 + sin2 θ dφ2 i\n.\nFind an explicit coordinate transformation to show that this metric describ es Minkowski\nspacetime."
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/6f7bc82c0a1838c5622544c9d881cd64_ps2.pdf",
      "content": "A\n!\nMassachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #2\nDue in class Tuesday, September 25, 2001.\n1. Cosmological Redshift as a Doppler Shift\nFor nearby objects with recession speed Hr ¿ c, the first-order Doppler shift gives\nλo/λe = 1 + Hr/c. To get the redshift factor R ≡ λo/λe for a distant object, we can\nbreak the light path into many small segments such that HΔr ¿ c for each, where Δr is\nthe proper length of a segment. Multiplying together the redshift factors for all segments\ngives the net redshift factor R = R1R2 · · · Rn.\na) Using the first-order Doppler shift, show that for one segment, lasting in time\nfrom t to t + dt, the redshift factor is\n1 da\nRt = exp\ndt\n.\n(1)\na dt\nb) Multiply the results from all segments to obtain the usual cosmological red\nshift formula λo/λe = ao/ae (where usually one sets ao = 1).\n2. Cosmic Time-Redshift-Distance Relation\nNewspaper articles presenting cosmological discoveries of distant objects usually do not\nquote redshifts, but instead give the time since the big bang. One such account reported\nthat a galaxy has been found to be fully formed a mere 1 billion years after the big bang.\nSuppose that you are asked by an astronomer friend what redshift was measured for the\ngalaxy. Additionally, a non-astronomer friend asks you the distance to the galaxy in\nlight-years. After explaining that distance is ambiguous, your friend says alright, just\ntell me the comoving distance in light-years.\nEstimate the redshift and the comoving distance using the following three cosmolog\nical models. In each case, assume that the Hubble constant is 72 km s-1 Mpc-1 .\na) SCDM: flat Ωcdm = 1, ΩΛ = 0;\nb) OCDM: open Ωcdm = 0.35, ΩΛ = 0;\nc) ΛCDM: flat Ωcdm = 0.35, ΩΛ = 0.65.\n\nNote: you may have to perform a numerical integral. The 8.942 webpage has links to\ninformation on using Mathematica, Matlab, Maple, as well as a function (C and F77) to\nperform numerical integration.\n3. Angular Size vs. Redshift\nAn object of linear size L (perpendicular to the line of sight) subtends a small angle\nα. Suppose that the object and the observer are both comoving and that the redshift\nof the object is z. For a fixed linear size the angle is a function of redshift: α = α(z).\nFor α2 ¿ 1, α ∝ L. Find the constant of proportionality in terms of τe and τo (the\nconformal times when light is emitted by the object and received by the observer). For\nan Einstein-de Sitter universe (k = 0 and a ∝t2/3), α(z)/L has a minimum at a certain\nredshift. What is that redshift? If galaxies formed long ago and all have about the same\ntypical size, say 5 kpc, what is the minimum angular size of a galaxy in an Einstein-de\nSitter universe, in arcseconds? Assume a Hubble constant of 72 km s-1 Mpc-1 .\n4. Number Counts\nSuppose that there exists a population of luminous sources distributed homogeneously\nthroughout space. For simplicity, assume that all sources have identical proper bolomet\nric luminosity L and that they emit isotropically. (If the sources have a distribution of\nluminosities we could integrate over that later.) The comoving number density of these\nsources is n(t), i.e., the proper number density at cosmic time t is (a0/a)3 n(t) where\na(t) is the expansion scale factor and a = a0 today. A terrestrial astronomer surveys the\nentire sky and finds N sources with measured bolometric flux greater than S. Assuming\nthat we live in a Robertson-Walker universe, find N (S). Evaluate it fully in the sim\nple case n(t) = constant and an Einstein-de Sitter universe (k = 0 matter-dominated).\nShow that as S →inf, N (S) approximates the Euclidean result N = (4πn/3)(L/4πS)3/2 .\nWhy? In the opposite limit, S →0, what is the behavior of N (S), and why?"
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/ea713490da5a5f9bbecbdf7c330eb1e1_ps3.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #3\nDue in class Tuesday, October 2, 2001.\n1. Horizons\nThe particle (or causal) horizon distance lH (t) is defined to be the coordinate distance\nχ travelled by a photon on a radial geodesic since t = 0, using the RobertsonWalker\nmetric with line element in the form\nds2 = -dt2 + a (t)\nh\ndχ2 + r (χ)(dθ2 + sin2 θdφ2)\ni\n.\n(1)\nFor simplicity consider the k = 0 case so that r(χ) = χ. Find lH (t) for the following\ncases: (1) a(t) ∝ t2/3 (Einsteinde Sitter, matter dominated universe); (2) a(t) ∝ t1/2\n(radiation dominated universe); and (3) a(t) ∝ exp(Ht) with H =constant (vacuum\nenergy dominated universe, known also as the de Sitter universe). Show that in cases (1)\nand (2), a photon emitted at t = t0 can reach any coordinate distance given sufficient\ntime but not so in the de Sitter universe. This result shows that the de Sitter universe\nhas an event horizon. Draw a spacetime diagram to explain what is going on.\n2. Angle subtended by causal horizon\nConsider two comoving observers A and B, each at the same comoving distance χ from\nyou, the observer. At conformal time τe, A and B come into causal contact for the first\ntime: a photon emitted by A at τ = 0 reaches B (and vice versa) at τ = τe. At τ = τe\nboth A and B emit photons along radial paths toward you which you receive today at\nτ = τ0. For simplicity, ignore the gravitational effect of radiation in the universe; this is\na fair approximation after z = 104 .\na) Assuming that you live in an Einsteinde Sitter universe, what angular separa\ntion do you measure between A and B? (You may use smallangle formulae.)\nb) Evaluate the angle in degrees if 1 + ze = 1100 so that A and B are on\nthe cosmic photosphere at recombination (when the cosmic plasma became\ntransparent). Without an earlier inflationary era, places on the photosphere\nseparated by more than this amount are causally disconnected.\nc) Redo part b) for the OCDM and ΛCDM models of Problem Set 2. For the\nsame Ωm in both models, does the angle subtended by the causal horizon at\nrecombination depend more strongly on Ωk or ΩΛ?\n\n3. PowerLaw Inflation: Peacock 11.1\nVerify that the potential\nAs\n16π\n!\nV (φ) ∝ exp\nφ\npmPl\np\nleads to inflation with a scalefactor dependence a(t) ∝ t . (Here mPl = G-1/2 is the\n\nPlanck mass in units where c = h = 1.) Since this is not de Sitter space, why does the\nresulting behavior still lead to zero comoving spatial curvature?\n4. The Future of Inflation\na) Show that inflation can keep the observed universe homogeneous only for a\ntime t < tcrit where\nti\ntcrit\nexp 2H(tf - ti)\n∼ tf\nwhere ti and tf are the times at which inflation started and ended and H is\nthe Hubble parameter during inflation.\nb) Consider a k > 0 universe which went through an inflationary phase and never\ninflates thereafter. Since such a model is expected to recollapse eventually,\nobservations will eventually reveal that Ω > 1 at, say, t > T. Estimate T."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/65620229ca3bc912fbbfeb7219605f7b_ps4.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #4\nDue in class Tuesday, October 16, 2001.\n1. Temperature vs. time\nAssume that we live in a Robertson-Walker universe with matter, radiation and curva\nture. The present mass density is ρm = 3Ω0H0\n2/(8πG), where H0 = 100 h km s -1 Mpc -1\nand Ω0(1+ρr,0/ρm,0) ≤ 1 (i.e., k ≤ 0). The present radiation temperature is T0 = 2.725 K.\nAssume that only photons, with present temperature T0 = 2.725 K contribute to the ra\ndiation; ignore neutrinos in this problem.\na) At what redshift did the radiation energy density equal the matter density?\nHow old was the universe then and what was the radiation temperature?\nYour answers should scale appropriately with Ωm and h.\nb) How old was the universe when the radiation temperature was 1 MeV? 1\nGeV? 1014 GeV? (Hint: you need g∗, the effective number of relativistic spin\nstates contributing to the energy density. At 1 GeV g∗ = 61.75 and at 1014\nGeV, g∗ = 106.75 without supersymmetry or double this with SUSY.)\n2. Massless and massive neutrinos\nBesides photons, there are 3 flavors of neutrinos, each with 2 spin states (neglecting\nright-handed neutrinos) which may be relativistic today. Assume that the numbers of\nneutrinos and antineutrinos of each flavor are equal.\na) Assuming that all neutrinos are massless and that the photon temperature is\nincreased by a factor (11/4)1/3 as a result of e+e- annihilation, derive zeq, the\nredshift at which (nonrelativistic) matter and radiation (relativistic particles,\nincluding photons and neutrinos), have equal energy densities (Peacock eq.\n9.3.) What is the ratio of energy densities in neutrinos and photons?\nb) Now suppose that one neutrino flavor (e.g., ντ and ντ ) has nonzero rest mass.\nDerive the neutrino mass that is needed to close the universe, assuming that\nthe contribution made by other massive particles (nucleons and cold dark\nmatter) is small (Peacock eq. 9.31). Note that the shape of the phase space\ndistribution is invariant after neutrino decoupling. (This calculation was first\nmade by Cowsik and McClelland 1972, Phys. Rev. Lett., 29, 669.)\n\n3. Equilibrium recombination\nIn terms of the conserved baryon/photon ratio η (eq. 9.83 of Peacock), find the CMB\ntemperature and redshift at which recombination ended, as defined by the condition that\nthe photon mean-free scattering rate equals the expansion rate, neσTc = H. Use the\nSaha equation, eq. 9.45 of Peacock, assuming the parameters of the ΛCDM model of\nProblem Sets 2 and 3 plus the present CMB temperature T0 = 2.725 K and the baryon\nabundance ΩB h2 = 0.02. (See Burles et al. 2001, ApJ 552, L1 for conversion of ΩB h2\nto η.) Compare your resulting electron fraction and redshift with the graphs presented\nin Seager et al., ApJS 128, 407. Is your recombination redshift too high or too low\ncompared with an exact calculation? Why?\n4. Nonstandard nucleosynthesis\nUnder which of the following suppositions would primordial nucleosynthesis have pro\nduced less 4He than the standard model? Less 2H (deuterium)?\na) Suppose that the baryond density in the universe today is larger than we\nthink.\nb) Suppose that there is a fourth neutrino flavor with mass much less than 1\nMeV. (It must be \"sterile,\" e.g. right-handed, not to have been detected in\nZ0 decay at LEP.)\nc) Suppose that there are many more neutrinos than antineutrinos or photons\nin the cosmic background today.\nd) Suppose that there are many more antineutrinos than neutrinos or photons\nin the cosmic background today.\ne) Suppose that there is a significant contribution of gravitational radiation to\nthe total energy density of the universe, comparable in magnitude with the\nenergy density of the microwave background radiation."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/e0ead8325949f1acbb30ccac2e50f08e_ps5.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #5\nDue in class Tuesday, October 23, 2001.\n1. Thomson optical depth\na) Peacock equation (18.38) gives the Thomson optical depth along the line of\nsight from the observer out to redshift z for a matterdominated model with\nno cosmological constant. Derive the correct expression for a general model\nincluding matter, vacuum energy, radiation, and curvature.\nAssume that\nhelium is neutral but hydrogen is partially ionized with ionization fraction\nxe. Your answer should depend on z, xe, Ωm, ΩB , ΩΛ, aeq, h, and Y .\nb) Numerically integrate the result of part a) for the flat ΛCDM model with\nΩΛ = 0.65, Ωm = 0.35, ΩB h2 = 0.02, and h = 0.72, for a A aeq. At what\nredshift would the Thomson optical depth equal unity if recombination never\noccurred, i.e. xe = 1? Compare your answer with that for the OCDM model\n(Ωk = 0.65 instead of ΩΛ = 0.65) using Peacock's equation (18.41).\n2. Kompaneets Equation and Inverse Compton Cooling\na) Given Peacock equations (12.75)-(12.77), complete the steps to derive the\nKompaneets equation (Peacock eq.\n12.79) for the modification of a pho\nton spectrum by Compton scattering with a uniform gas of nonrelativistic\nelectrons.\nb) Consider a gas of blackbody radiation at temperature Tγ which is scattered by\nthermal electrons with temperature Te > Tγ . From the Kompaneets equation\nderive the rate of energy transfer per unit volume between the electrons and\nphotons, ρ γ . Your result should be proportional to (Te - Tγ )ργ .\nc) Energy conservation implies that the photon heating is accompanied by elec\ntron cooling.\nSuppose that helium is neutral and that particle collisions\nmaintain thermal equilibrium among electrons, protons, hydrogen atoms,\nand helium atoms. One can then define an inverse Compton cooling time\n\ntIC = -ρB /ρ e where ρB is the thermal energy density of the baryons (not the\nrest mass density) and ρ e = -ρ γ is the electron energy loss rate. Derive an\nexpression for tIC and evaluate it using the parameters of the CMB and the\nΛCDM model. If the gas is fully ionized, the inverse Compton cooling time\nis shorter than the Hubble time H-1 for z > zIC. Determine zIC.\n3. CMB Spectral Distortions\na) Starting from the Kompaneets equation, show that the equilibrium solution\nfor the photon occupation number n is a BoseEinstein distribution with an\narbitrary nonzero chemical potential. (The equilibrium solution corresponds\nto the limit of large Thomson optical depth.)\nb) Under what conditions could the CMB have a nonzero μ? (Hint: Comp\nton scattering conserves photon number but not photon energy, as energy is\nexchanged with electrons.)\nc) In the limit of small Thomson optical depth, fill in the steps Peacock omits\nto derive his equation (12.82) for the SunyaevZel'dovich effect. Check that\nin the RayleighJeans regime (hν ¿ kT ), the brightness temperature change\nis ΔT /T = -2y for y ¿ 1. Why is the photon temperature decreased by\nscattering from hotter electrons?\nd) In the limit of small chemical potential, μ ¿ kT , linearize the BoseEinstein\nphase space density.\nWhat is the predicted ΔT /T in the RayleighJeans\nregime? Referring to Figure 9.1 of Peacock, explain qualitatively how the\nmeasured CMB brightness temperature versus frequency constrains models\nof cosmological energy input (Wright et al. 1994, ApJ, 420, 450).\n4. Gravitational perturbations on photons\nIgnoring gravitational radiation and gravitomagnetism, the metric of a weaklyperturbed\nRobertsonWalker spacetime may be written\nds2 = a (τ )\nh\n-(1 + 2φ)dτ 2 + (1 - 2ψ)dl2i\n(1)\nwhere φ(xi, τ ) and ψ(xi, τ ) are small gravitational potentials (φ2 ¿ 1 and ψ2 ¿ 1) and\ndl2 is the spatial line element of a RobertsonWalker model (e.g. dl2 = dχ2 + r2dΩ2).\nThroughout this problem we drop terms quadratic in φ and ψ.\na) Let E and pi = Eni be the proper energy and momentum of a photon mea\nsured by an observer at fixed spatial coordinates. In other words, the photon\n~\neˆ\n4momentum is P = E~0 + pi~eˆ where {~μ} is an orthonormal basis. From\ni\neˆ\n\nthe geodesic equation, show that the photon energy changes with conformal\ntime along its trajectory according to\nd ln(aE) = -n i∂iφ + ∂τ ψ .\n(2)\ndτ\nIdentify the terms corresponding to the standard cosmological and static\ngravitational redshifts. Show also that dni/dτ is independent of E and there\nfore the photon tra jectory is unaffected by its energy.\nb) The CMB anisotropy is fully described (in the absence of polarization) by\nthe brightness temperature Tbr(xμ, E, ni) for photons of proper energy E\ntraveling in direction ni at spacetime point xμ. Recall that the brightness\ntemperature is defined by Iν = Bν (Tbr) where Bν (T ) is the Planck function.\nDefining the anisotropy Δ by TB = a-1(τ )T0(1 + Δ), show that equation (2)\nimplies that gravitational perturbations multiply the energy of every photon\ntraveling along a given ray by the same factor and therefore Δ is independent\nof E."
    },
    {
      "category": "Resource",
      "title": "ps6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/82acc90354251e071e2b259e91f1e28f_ps6.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #6\nDue in class Tuesday, October 30, 2001.\n1. SachsWolfe Angular Power Spectrum\nThe 8.942 notes Cosmic Microwave Background Anisotropy give give a formula for the\nangular power spectrum Cl as an integral over the threedimensional power spectrum of\ngravitational potential fluctuations. In the SachsWolfe approximation, the largescale\n(low l) anisotropy in observed direction n is Δ0(n) = 3φ(-χen, τe).\na) Complete the steps of the SachsWolfe derivation in the notes to derive\nthe angular power spectrum for a primordial scaleinvariant spectrum Pφ =\nA(c/H0)3(ck/H0)n-4 ,\nΓ(3 - n) Γ\n2l+n-1\n(1)\nCl ∝\nΓ2\n4-n\nΓ\n2l+5-n\nand find the constant of proportionality in terms of A. (Hint: be sure to\ninclude the factor 0.9 relating the potential between y ¿ 1 and y A 1 for a\nmatter plus radiation universe as discussed in the notes.)\nb) Verify Peacock equation (18.31) and find the relation between Qrms-PS (Pea\ncock eq. 18.33) and A.\nc) Suppose that the primeval spectrum has a tilt with n = 0.8 over the range\nof scales probed by the CMB. What is the predicted ratio between l(l + 1)Cl\nat l = 20 and l = 2?\nHint: for part a) you will need\n0+ν+1\nπ2ν-2Γ(1 - ν)Γ\nl+l\n(2)\nZ inf\nx ν jl(x)jl (x) dx =\nΓ\nl-l0-ν+2\nΓ\nl0 -l-ν+2\nΓ\nl+l0 -ν+3\nwhich is valid for -(l + l0 + 1) < ν < 1.\n2. Cosmic Variance of the CMB Quadrupole\nAs Peacock discusses on page 595, the Q2\nderived in Problem 1 is the mean of a\nrms\nstatistically fluctuating quantity. Because each spherical harmonic component of the\n\n| i\nanisotropy has a Gaussian distribution with zero mean and with variance Cl ≡ h|alm 2 ,\nthe low degree harmonic coefficients are expected to show large statistical fluctuations.\n(We can only measure one CMB sky; no matter how precise the measurement, we can\nnever get more than 2l + 1 measurements of degree l.) For the quadrupole the situation\nis even worse because emission from the plane of our own galaxy practically eliminates\none component, so that the observational estimate of Qrms = 10.7 μK (Kogut et al\n1996, ApJ, 464, L5) is drawn from a distribution that is effectively chisquared with four\ndegrees of freedom. Given this fact, determine 95%confidence upper and lower limits\nfor the ensemble mean Qrms-PS. Does the low observed quadrupole rule out Qrms-PS =\n18 μK, the bestfit value based on fitting the entire angular power spectrum? (Hint:\nThe chisquare distribution with four degrees of freedom has one parameter, namely\nQrms-PS. Tune this parameter so that the measured value lies at the 5% and 95% values\nof the cumulative distribution, which you can find in any elementary statistics book. See\nHinshaw et al 1996, ApJ, 464, L17 for discussion.)\n3. CMBFAST\nDownload and build the numerical code CMBFAST (available at the 8.942 links page\n-- note you must have access to a f77 compiler, e.g. on MIT\nmachines). Before\nrunning cmbfast you will need to run jlgen and/or ujlgen. Read the online documentation\ncarefully.\na) Run CMBFAST on the three standard models (SCDM, ΛCDM, OCDM) of\nProblem Set 2.\n(Use the default parameters given by cmbfast in square\nbrackets whenever you are unsure.) Compare with Figure 2 of Miller et al\n(1999, ApJ, 524, L1). This will require you to change the Cl to temperature\nunits.\nserver\nb) Holding fixed ΩΛ = 0 and other parameters (e.g. H0 = 72, ΩB h2 = .02, and\nn = 1), vary Ω over the range (0.1, 1). Make a graph of lmax (Ω), the location\nof the first acoustic peak. Then hold fixed Ω = 1 (i.e. spatially flat models)\nand vary ΩΛ over the same range. Superpose the lmax (Ωm = 1 - ΩΛ). Are\nthe results consistent with Problem 2 of Problem Set 3?\nc) Run CMBFAST with a tilt n = 0.8 and compare the ratio of l(l + 1)Cl at\nl = 2 and l = 20 with the SachsWolfe result from Problem 1.\n4. Gamma Ray Burst Luminosity\nGamma ray burst 990123 occurred in a galaxy of redshift z = 1.60. The measured fluence\nwas 3.0 × 10-4 erg cm-2 for photon energies above 20 keV (Briggs et al 1999, ApJ, 524,\n82). Convert this to a total emitted burst energy in units of M c2 assuming isotropic\nemission. You will need to calculate the luminosity distance to z = 1.60. Evaluate it for\nthe three models of Problem Set 2 with h = 0.72. You will have to perform a numerical\nintegral for the ΛCDM model. You may use whatever is convenient, e.g. Matlab, Maple,\nor Mathematica on\n--\nsee the 8.942 links for documentation.\nMIT servers"
    },
    {
      "category": "Resource",
      "title": "ps7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/ef8447def89ed19fe12a5c1a7c239eb7_ps7.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #7\nDue in class Tuesday, November 6, 2001.\n1. Galaxy Number Counts\nThe differential number counts of galaxies have been measured to faint magnitudes in\nthe Hubble Deep Field (Williams et al 1996, AJ 112, 1335). At B = 29, the HDF results\ngive dN/dm = 105.54 galaxies per magnitude and per square degree.\na) Assuming isotropy, convert the observed number counts to the total counts\nover the whole sky -dN/d ln S where S is the flux in the HST blue band\npass. (See Peacock Chapter 13 for the relation between flux and magnitude.)\nExtrapolate this to get N (S), the total number of galaxies in the universe\nvisible to us with B ≤ 29. (You may approximate the source counts assuming\na constant logarithmic slope d ln N/d ln S = -β.)\nb) Let us naively assume that the galaxy luminosity function does not evolve\nand that there is no Kcorrection (Peacock p. 395). Suppose that the blue\nluminosity function is a Schechter function with α = -1, φ∗ = 0.015h3\nMpc-3, and M ∗ = -19.50 + 5 log10 h. At B = 29, what is the luminosity\ndistance (in h-1 Mpc) for a galaxy of luminosity L∗? Call this number d∗\n29.\nc) Show that the differential counts at B = 29 in a flat universe with α = -1\nare\ndN\nμ c ¶3\nZ H0τ0\n29)2i\nx 2 dx\n(1)\n- d ln S = 4π\nH0\nφ∗\nexp\nh\n-(dL/d∗\nwhere x = H0χ/c and the luminosity distance is a function of χ(z) (dL ≈ χ\nfor x ¿ 1).\nd) Show that for an Einsteinde Sitter universe, H0dL/c = 4x/(2 - x)2 . Then\nnumerically integrate equation (1) to get the predicted differential source\ncounts at B = 29.\nCompare with your result of part a) from the HDF\nmeasurement.\n2. GunnPeterson Effect\nNeutral hydrogen at redshift z absorbs background quasar light at a wavelength 121.6\nnm, creating absorption at a wavelength 121.6(1 + z) nm as measured today at redshift\n\nzero. Treating the Lyman alpha line as being infinitely narrow, the absorption cross\nsection per neutral hydrogen atom is\nπe2\nσ(ν) = σα δ(ν - να) ,\nσα =\nfα\n(2)\nmec\nwhere ν = c/λ is frequency, να = c/(121.6 nm) is the Lyman alpha frequency, fα = 0.416\nis the oscillator strength, and cgs units are used in writing σα (cf. Peacock eq. 12.36). In\nthis problem we neglect peculiar velocities. The original reference by Gunn & Peterson\n(1965, ApJ, 142 1633) is a very readable guide to this problem (though beware it has\nsome typos).\na) Derive the absorption optical depth at observed frequency ν0 due to neutral\nhydrogen at 1 + z = να/ν0. Your result should depend on σα, c, να, nHI,\nand H (the Hubble parameter at z). Compare your result with Peacock eq.\n(12.41) for a Friedmann universe.\nb) The measured optical depth versus frequency is not uniform but varies (the\nLyman alpha forest) with nHI along the line of sight. The mean optical depth\nis unity at z ≈ 3. Assuming ΩBh2 = 0.019, h = 0.65, Y = 0.24 (with helium\nneutral), and the flat ΛCDM model with ΩΛ = 0.65, what is the mean neutral\nfraction 1 - xe of hydrogen atoms at z = 3? Compare with Peacock p. 364.\nc) In equilibrium, hydrogen atoms are photoionized and recombine at equal\nrates, implying\nnHα(2)(T )\nnHIβ = nenpα(2)(T )\nor\n1 - xe =\n(3)\nx2\nβ\ne\nwhere nH = (1 - Y )ρB/mH and\ndν\nβ =\nZ inf\n4πJν σi(ν) hν ≈ 3 × 10-12 J-21 s-1 ;\nνL\nA\nhνL\n!\nα(2)\n= 2.06 × 10-11T -1/2φ2(T ) cm s-1 ,\nφ2(T ) = 0.448 ln\n1 +\n. (4)\nkT\nHere, hνL = 13.6 eV is the ionization energy of hydrogen, σi is the ionization\ncrosssection, T is the temperature in Kelvin, and J-21 is the mean intensity\nat frequencies just above νL (in units of 10-21 erg cm-2 s-1 Hz-1 ster-1). The\nα(2) excludes recombinations directly to the ground state (Case B recombi\nnation). For the ΛCDM model, assuming the gas temperature is 104 K, what\nJ-21 is needed to ionize the gas to the level determined in part b)?"
    },
    {
      "category": "Resource",
      "title": "ps8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/10b8898c262347bebc172c98cc2be147_ps8.pdf",
      "content": "f\nMassachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #8\nDue in class Tuesday, November 13, 2001.\n1. Power Spectrum and Window Functions\nNote: this problem set uses the Fourier transform convention of equation (1) below.\na) Starting from the twopoint correlation function in kspace,\nD\nδ(~k1) δ(~k2)\nE\n=\nP(k1) δ3\nD(~k1 +~k2), show that the correlation function and power spectrum are\nFourier transform pairs:\nk ~\nξ(r) =\nZ\nd3k e i~·x P(k)\n(1)\nwhere r = ~x . (We assume that space is flat and use the usual notation for\n| |\n3vectors.) This is known as the WienerKhintchine theorem.\nb) Suppose that we filter δ(~x ) by convolving with a smoothing kernel f\nW(~x ):\nδ(~x ) =\nR d x0 W(~\nx 0) δ(~\n3 W(~x ) = 1. Show that\n\nf x - ~\nx 0) where\nR d x f\nδ (~k ) = δ(~k )W(~k )\n(2)\nand give an expression for W(~k ), called the window function, in terms of\nW(~x ). What is W(0)?\nW(~x ) = 3/(4πR3) for r < R and f\nc) Suppose that f\nW(~x ) = 0 for r > R. This is\ncalled a \"spherical tophat\" in cosmology. What is the corresponding window\nfunction? You should derive a closedform expression as a function of kR.\nd) Suppose that f\nW(~x ) ∝ exp(-r2/2R2) is a Gaussian of width R. What is the\ncorresponding window function?\n2. Normalization of the power spectrum\nPeacock gives an empirical fit to the \"linear\" power spectrum of mass fluctuations in\nhis equations (16.137) and (16.138) where Δ2(k) ≡ 4πk3P(k). This problem requires\nnumerical integrations over the power spectrum. You may use Matlab, Maple, Mathe\nmatica, rombint.c, etc. for this. Be sure to truncate the integrals at a sufficiently high k\nso that you get numerical errors smaller than one percent.\n\na) Using Peacock's spectrum, compute σ8 =\nD\nδ 2E1/2 where δ is the density\nperturbation filtered with a spherical tophat of radius 8 h-1 Mpc. Compare\nwith Peacock equation (16.136) for Ωm = 0.35.\nb) Using the cosmological Poisson equation r2φ = 4πGρ mδ for a = 1, determine\nthe power spectrum of the gravitational potential in terms of Peacock's Δ2(k).\nShow that k3Pφ(k) → constant as k → 0. Assuming that the gravitational\npotential has decayed by a factor g(Ωm) < 1 since recombination, compute\nQrms-PS in the SachsWolfe approximation (Problem 1 of Problem Set 6) and\ncompare with the COBE measurement Qrms-PS = 18 μK."
    },
    {
      "category": "Resource",
      "title": "ps9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-942-cosmology-fall-2001/acbea8f01d358afa04eab70accec9a31_ps9.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.942\nFall 2001\nProblem Set #9\nDue in class Tuesday, November 20, 2001.\n1. CDM density perturbation growth\nFor wavelengths much less than the Hubble length (kc A H), the Fourier transform of\nthe density perturbation for nonrelativistic matter, δ(~k, τ), obeys the wellknown linear\nwave equation for smallamplitude, isentropic, longitudinal perturbations:\n\na\nρa2\nδ = 0\n(1)\nδ +\nδ +\nk2 cs - 4πG\na\nwhere dots denote conformal time derivatives.\na) Consider a universe dominated by cold dark matter (CDM) with cs = 0, but\nalso including radiation. Ignoring the radiation perturbations -- a useful\napproximation on scales smaller than the Hubble distance -- equation (1)\nis valid for the CDM throughout the radiation and matterdominated eras\n(with ρ on the righthand side being the mean density of the CDM). Using\nthe solution of the Friedmann equation for a(τ) in a flat matter+radiation\nuniverse, a(τ) = a1τ + a2τ 2 (be sure to express a1 and a2 in terms of H0 and\naeq = [1+zeq]-1), show that the growing mode solution is δ ∝ 1+(3/2)(a/aeq).\nInterpret this result physically for a < aeq as well as a > aeq.\nb) Rewrite the wave equation given above in terms of the gravitational potential\nperturbation φ(~k, τ). Show that φ = 0 for growingmode density perturba\ntions in a Ω = 1 CDMdominated universe, implying that in real space,\nφ = φ(~x). What happens to φ if Ω = 1 or cs = 0? Now consider an iso\nlated, gravitationally bound, relaxed system (e.g., the Milky Way galaxy),\nwhose mass and proper size do not change with time. Assuming that the\ngravitational potential at the center is finite, does it change with time? Can\none, therefore, estimate the initial gravitational potential fluctuations from\nthe gravitational potential well depths of galaxies and clusters?\n2. Hot Dark Matter\nSuppose that the universe is closed by one flavor of massive neutrino with Ων = 1. The\nneutrinos stream freely (without scattering) since decoupling at T ≈ 1 MeV. The proper\nmomentum of a typical neutrino is p = (1 + z) kBTν0/c where Tν0 = (4/11)1/3 T0 is the\npresent neutrino \"temperature.\"\n\na) Show that the proper distance travelled by a typical neutrino (the \"free\nstreaming distance\") is\nZ τ0\nkBTν0\nLfs = a0c\ndτ α (1 + z)\nh\n1 + α2 (1 + z)2i-1/2 where α ≡\n(2)\nmν c2\nand z = z(τ ) through the usual relation 1 + z = a0/a(τ ).\nb) At what redshift does the massive neutrino become nonrelativistic? Assuming\nthat this occurs before zeq, compute zeq for an Ω = 1 universe with two flavors\nof massless neutrinos and one flavor of massive nonrelativistic neutrino. (cf.\nProblem 1 of Problem Set 4.)\nc) Using the exact z(τ ) for a K = 0 matter+radiation universe with two flavors\nof massless neutrinos and one flavor of massive nonrelativistic neutrino, and\nwith h = 0.72, compute the exact freestreaming distance in Mpc by numer\nically integrating equation (2). How doe the results scale with mν and h if\nα ¿ aeq? If massive neutrinos are the dark matter, freestreaming erases\nprimordial fluctuations for wavelengths up to about Lfs.\n3. Spherical infall model\nThe nonlinear evolution of spherically symmetric perturbations of a FriedmannRob ertson\nWalker (zero pressure) universe is most easily describ ed by integrating the trajectories\nof spherical shells containing fixed enclosed mass M .\na) Show that the solution R(t) for the proper radius of a sphere enclosing fixed\nmass is given parametrically by R = A(1 -cos η), t = B(η -sin η). What is\nthe value of A3/B2?\nb) By comparing R(t) with the result for an unperturbed Ω = 1 Einsteinde\nSitter universe, obtain the exact nonlinear solution (in parametric form) for\n\nδ(t) ≡M/M (t) -1, where M = (4π/3) ρR3 . (Hint: Follow a shell of fixed M\n\nand ask how much mass it would enclose, M (t), if the density were uniform\n\nand equal to the critical density ρ . Note that δ is the volumeaverage of the\ndensity perturbation ρ/ρ -1.)\nc) If the enclosed mass remains constant and the initial energy is negative,\nR →0 implying δ →inf. Show that this occurs for growingmode initial\n\nperturbations when linear perturbation theory would predict δ = δc ≈1.69.\nFind the exact expression for δc in terms of π and simple numbers.\n4. Zel'dovich Approximation\nThe Zel'dovich approximation is to write the tra jectories of pressureless matter (dark\nmatter, or baryons on scales larger than the Jeans length) as\nq, τ ) = ~\nψ (~\n~x (~\nq + D+(τ )~ q ) ,\n(3)\n\n|~ |\n~\nr\nr\nwhere ψ (~\n~ q ) is determined by the initial conditions and D+(τ ) is the zeropressure linear\ngrowing mode growth factor.\na) Consider a spherically symmetric density perturbation of the form\n1⁄2 δi > 0 ,\n~x < q0\nδ(~x, τi) =\n(4)\n0 ,\n|\nx\n|\n> q0\nFind the radial displacement field ψ (~q ) corresponding to this density field\nto lowest order in δi. Show that the Zel'dovich approximation gives δ( ~x <\n| |\nq0, τ ) →infat some finite τ = τc. What is the corresponding prediction for\nδ(τc) from linear perturbation theory? Does the Zel'dovich approximation\nagree with the exact solution of the spherical infall model from Problem 3\nabove?\nb) The Zel'dovich approximation is exact for planeparallel perturbations for\ntra jectories that have not intersected others.\nShow this by considering a\nonedimensional density field ρ(x, τ ) with corresponding displacement field\nψx(qx) and gravitational potential φ(x, τ ) obeying the Poisson equation ∂2φ =\nx\n4πGa2(ρ-ρ ). Hint: substitute the Zel'dovich approximation trajectories into\nthe exact equation of motion d2~x/dτ 2 + ( a/a)d~x/dτ = -~ φ. Show that the\n~ φ implied by this equation agrees with the solution of the Poisson equation\nassuming mass conservation."
    }
  ]
}