{
  "course_name": "Cross-Cultural Leadership",
  "course_description": "Cross Cultural Leadership is a collaborative research seminar that examines what constitutes “effective” leadership across cultures. It is collaborative because the students are expected to provide some of the content. The weekly readings target particular aspects of cultural differentiation. Working within those topics, students are asked to describe aspects of leadership in particular cultures based on their research and/or personal experiences. The goal of the course is to help prepare students for business assignments outside of their native countries.\nCourse deliverables include: active participation in the class, contribution of class content on a weekly basis and an end of course paper that explores some aspect of leadership across cultures.",
  "topics": [
    "Business",
    "Leadership",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Business",
    "Leadership",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nCross Cultural Leadership is a collaborative research seminar that examines what constitutes \"effective\" leadership across cultures. The underlying theme of this course is that the skills and behaviors that are perceived as effective leadership characteristics in one culture are not necessarily those that will be effective in a different culture. By exploring the ways in which specific characteristics are valued differently by different cultures, the students acquire frameworks for assessing how to approach a work assignment in a culture that is not their own.\n\nThis course is collaborative because the students are expected to provide some of the content. The weekly readings target particular aspects of cultural differentiation. Working within those topics, teams of students are asked to describe aspects of leadership in particular cultures based on their research and/or personal experiences. Students use both formal presentations and informal discussions to engage each other in learning about different cultural expectations. The goal of the course is to help prepare students for business assignments outside of their native countries.\n\nPrerequisites\n\nNone\n\nSummary of Major Assignments\n\nClass participation\n\nContribution of class content\n\nCross-cultural dialogues\n\nEnd of course paper\n\nDescription of Major Assignments\n\nClass participation - I look for attentive, active participation in class. Missing more than one class will jeopardize a student's grade.\n\nContribution of class content - each week the class focuses on a different topic based on the assigned readings. The class is grouped into teams; each team is responsible for expressing how that aspect is experienced in a specific geographic region. The team contribution is based on research and/or personal experience. Sometimes the team will make a formal presentation; sometimes the team will contribute to the discussion without making a formal presentation. Whether a formal presentation or informal discussion - the team point of view is made available to the class (and only to the class) via an online MIT forum called Sloan Space.\n\nCross-cultural dialogues - most weeks a pair of teams will explain how their countries/regions would handle a situation that is relevant to the current readings. After each of those teams makes a BRIEF formal presentation, there is a class discussion on that topic. Therefore, each team is expected to have a point of view on this additional topic.\n\nEnd of course paper on some aspect of leadership across cultures - Compare/contrast some aspect(s) of leadership (the ability to influence people in a business context) from at least two cultures/regions. Ideally the students will pick topics that are useful to them, something that has value to them and their future plans. They can do it individually or in small groups, no more than three people in a group.\n\nCourse Format\n\nThis is an interactive seminar. Most weeks we follow a similar format: a discussion of the theory for the week, informal presentations and discussions of how each team's region maps to the theory under discussion and a further discussion on a specific situation that is led by two teams that do presentations on that topic.\n\nBasis for Grade\n\nThis course is graded Pass/Fail. As is true in so many things, the students will get out of this course what they put into it. In order to Pass, all assignments must be completed and handed in on the last day of class with appropriate effort.",
  "files": [
    {
      "category": "Resource",
      "title": "final_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/53635f1a5088eb5c8aa957fce37a5846_final_paper.pdf",
      "content": "15.996 Cross-Cultural Leadership\nEnd of Course Paper\nPaper - 5 to 10 pages\nDue on the last day of class. You will present a summary of your paper in\nclass.\nYou may do it on your own or as part of a small group, no more than three\npeople in a group.\nCompare/contrast some aspect(s) of leadership (the ability to influence\npeople in a business context) from at least 2 cultures/regions.\nIdeally, you will pick a topic that is useful to you. Write a paper that has\nvalue to you and your future plans.\n- Do you plan to work in the country X after you leave Sloan?\nCompare some worrisome aspect of leadership in that country to that\nin your native country and/or a different country\n- Are you concerned about issues of access and status? Pick countries\nwith different approaches and discuss the pros and cons.\n- Was there a recent article/book examining the effectiveness of a\nparticular business person? Analyze the cultural issues and discuss\nwhich aspects of this person's style would be effective/not effective in\na different cultural situations.\nPlease contact me if you want to discuss potential topics with me.\nDue by the 4th class - your topic and the names of the people in your group.\n15.996 End of Course Paper Assignment\nPage 1"
    },
    {
      "category": "Resource",
      "title": "assign1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/78fe51280ba3630ebfea208896d5ffb4_assign1.pdf",
      "content": "15.996 Cross-Cultural Leadership\nAssignment for 2nd class - Interacting with People\n- Universalism vs Particularism\n- Individualism vs Communitarianism (Collectivism)\n- Neutral vs Emotional\n- Achievement vs Ascription\nRead (in your packet):\n- Trompenaars, Fons and Hampden-Turner, Charles. Riding the Waves of\nCulture: Understanding Cultural Diversity in Global Business (2nd edition).\nNew York: McGraw-Hill, 1998, pages: 1-10, 29-37, 49-53, 68-75, 80-82, 105-\n111, 121-122.\nFor the 2nd class, the organizing principle will be each of the dimensions (not the\nregions) we are discussing. I will introduce a dimension - then each team will discuss\nhow its region/country maps to that dimension. Your team should\n- Determine where your country/region is on each dimension (eg: extremely\nneutral, in the middle, extremely emotional)\n- Come up with one anecdote for each dimension\n- Email your presentation/notes to me. I will post it on the server.\nIf your team is taking a lead part on the Cross-Cultural Dialogue on Hiring and\nCompensation ...\nThe topic is how to make a hiring decision. This presumes a multi-national company\nwhere a hiring decision crosses national boundaries. The purpose of this dialogue is to\nillustrate the cultural assumptions about what constitutes \"good hiring practices\" and to\nunderscore where the differences between those assumptions can lead to disagreement or\nmisunderstanding.\n- Prepare a presentation of \"good hiring practices\" for your country/region.\n- Include expectations on how an appropriate compensation level will be\ndetermined\nOther teams\n- Know what constitutes \"good hiring practices\" for your country/region.\n- Know how appropriate compensation levels are determined.\n- Be prepared to describe how your country/region differs or is the same as the\ntwo lead teams.\n15.996 Assignment for 2nd class\nPage 1"
    },
    {
      "category": "Resource",
      "title": "assign2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/6149dbafb8a500ed57ba8a391c05239b_assign2.pdf",
      "content": "15.996 Cross-Cultural Leadership\nAssignment for 3rd class - Social Dimensions\n- Uncertainty avoidance\n- Power distance\n- Assertiveness\n- Gender Differentiation\n- Cross cultural dialogue - Firing\nRead (in packet):\n- Javidan, Mansour and House, Robert J. \"Cultural Acumen for the Global\nManager: Lessons from Project GLOBE.\" Organizational Dynamics, Vol 29, No.\n4, pages 289-305, Spring 2001.\n- House, Robert J.; Hanges, Paul J.; Javidan, Mansour; Dorfman, Peter W. and\nGupta, Vipin. Culture, Leadership, and Organizations: The GLOBE Study of 62\nSocieties. Thousand Oaks, California, 2004, pages: 410, 365, 622, 539.\n- Schneider, Susan and Barsoux, Jean-Louis. Managing Across Cultures (2nd\nedition). Essex, England: Pearson Education Limited, 2003, pages 87-94.\nFor the next class, the organizing principle will be each of the dimensions (not the\nregions) we are discussing. I will introduce a dimension - then each team will discuss\nhow its region/country maps to that dimension. This is an informal discussion. You are\nNOT expected to make a presentation. Your team should\n- Determine where your country/region is on each dimension (eg: extremely\nassertive, in the middle, extremely cooperative and attentive)\n- Come up with one anecdote for each dimension\n- Write up your point of view briefly.\n15.996 Assignment for 3rd class\nPage 1\n\nCross-Cultural Dialogue: Can someone be fired? Why or why not? What are\nconsidered valid reasons? If so, how is it done?\nIf you are in a Lead Team:\nThe topic is how to make a firing decision. This presumes a multi-national company\nwhere a firing decision crosses national boundaries. The purpose of this dialogue is to\nillustrate the cultural assumptions around why and how a person gets fired and to\nunderscore where the differences between those assumptions can lead to disagreement or\nmisunderstanding.\n- Prepare a presentation on \"how to fire someone\" for your country/region.\n- Include a framework on when it is possible and when it is not possible to fire\nsomeone\n- What are considered \"good\" reasons for firing someone\n- How would you go about terminating someone's employment\nOther teams\n- Know whether, why and how someone might be fired in your country/region.\n- Be prepared to describe how your country/region differs or is the same as the\ntwo lead teams.\n15.996 Assignment for 3rd class\nPage 2"
    },
    {
      "category": "Resource",
      "title": "assign3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/99a14fb19d75c71d6bf8f3fca8790281_assign3.pdf",
      "content": "15.996 Cross-Cultural Leadership\nAssignment for 4th class - Orientation to Time and Space\n- Focus on past, present or future\n- Monochronic or polychronic activities\no Rigid or fluid schedules\n- Short- or long-term horizon\n- Space - public, mixed, private.\nRead (in your packet):\n- Trompenaars, Fons and Hampden-Turner, Charles. Riding the Waves of Culture:\nUnderstanding Cultural Diversity in Global Business (2nd edition). New York:\nMcGraw-Hill, 1998, pages 123 - 144.\n- Gesteland, Richard R. Cross-Cultural Business Behavior: Marketing, Negotiating\nand Managing across Cultures (2nd edition). Copenhagen: Copenhagen Business\nSchool Press, 2000, pages 55-62.\nFor the 4th class, the organizing principle will be each of the dimensions we are\ndiscussing. I will introduce a dimension - then each team will discuss how its\nregion/country maps to that dimension. Your team should\n- Determine where your country/region is on each dimension\n- Come up with one story or anecdote to illustrate each dimension\nDUE by the 4th class - your paper topics and teams\n15.996 Assignment for 4th class\nPage 1\n\nCross-Cultural Dialogue: How do teams in your region successfully complete a\nlarge complex project? What constitutes \"success?\" How is a project framed to\nbest achieve success? If there is a project plan, what does it look like?\nIf you are in a Lead Team:\nThe topic is how to successfully complete a large complex project. This presumes a\nmulti-national company where the sub-groups of the larger team come from different\ngeographic areas. The purpose of this dialogue is to illustrate the cultural assumptions\naround definitions of \"success\" and ways of achieving that success and to underscore\nwhere the differences between those assumptions can lead to disagreement or\nmisunderstanding.\n- Prepare a presentation illustrating how to complete a large project successfully\nfor your country/region.\n- Include the parameters for success\n- Include examples of how to best achieve success\n- This may include some kind of project planning framework\n- Include your expectations around communications between different sub-\ngroups and across the group as a whole\nOther teams\n- Know the hallmarks of a successful complex project in your country/region.\n- Be prepared to describe how your country/region differs or is the same as the\ntwo lead teams.\n15.996 Assignment for 4th class\nPage 2"
    },
    {
      "category": "Resource",
      "title": "assign4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/b0622568f5f2b311a525796eaa64b4a9_assign4.pdf",
      "content": "15.996 Cross-Cultural Leadership\nAssignment for 5th class - Leadership Effectiveness\n- Leadership Traits\n- Leadership Styles\n- Presentations on Leadership Effectiveness\n- Presentation of student papers\n- Critique of course\nRead:\n- Welch, Jack. \"Four E's (a Jolly Good Fellow),\" Wall Street Journal, January 23,\n2004, page A14.\n- Goleman, Daniel. \"Leadership that Gets Results.\" Harvard Business Review,\nMarch-April 2000, pages 78-90.\n- Graham, John l. and Lam, N. Mark. \"The Chinese Negotiation.\" Harvard\nBusiness Review, October 2003, pages 82-91.\n- Derr, C. Brooklyn; Roussillon, Sylvie and Bournois, Frank. Cross-Cultural\nApproaches to Leadership Development. Westport, Connecticut: Quorum Books,\n2002, pages 290-292.\nFor the 5th class, the organizing principle will be geography. Each team will give a\npresentation on what constitutes effective leadership in its region. The audience for this\npresentation are the ex-pats coming to your region into leadership roles. Your job is to\ngive them guidelines to help them be successful in their roles.\nTime permitting, each team (or person) will explain their paper topic and summarize their\nkey findings.\nPapers are due to me by 4pm on the last day of class.\n15.996 Assignment for 5th class\nPage 1"
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/a4b73b7b1a5c1fddbb6d77dca70c7847_lec1.pdf",
      "content": "Cross Cultural Leadership - 15.996\nLecture Notes\nClass One - Introduction and Overview\n- Set the baseline. What understanding of leaders and leadership has each of us already\nacquired? How does that reflect our global experiences?\n- Identify teams\n- Team introductory presentation of the team's region: geography, history, regional\ndifferences, politics, economic issues\n- Brief overview of the theories and themes in this course\nAgenda\n- Welcome - agenda, purpose of class\n- Class Introductions -\nname, class, work experience, what cultural background?\n- Create teams\n- Introductory presentation by each team\nGive teams 20 minutes to prepare\nPresentation is short (5 minutes): 30,000 foot\nWhat do you think might be distinctive about your region?\nGeography, history, politics, economic issues, regional differences\n- (if time permits)Brief overview of theories and themes\n- Explanation of Syllabus and Next Week's Assignment\nCross-Cultural L'ship\nFall 2004\nPage 1\n\nOverview and Purpose of Class\n- Explain Agenda\n- Purpose - to examine what constitutes \"effective\" leadership across cultures.\no My definition of leadership - use this as your default definition until you find\nsomething you feel is more compelling\no Leadership - the ability to influence a group of people to achieve a shared goal\n- Assumption of class: If someone's behaviors and skills enable them to be an \"effective\nleader\" in a particular setting/culture - that those same behaviors and skills will not\nnecessarily enable that person to be effective elsewhere\no That is - what is experienced as \"effective leadership\" is contingent on the context.\nWhat industry, what phase the company is in (start-up, growth, blue chip, etc),\ncorporate culture, economic context, regional (ethnic, cultural) context.\no We will focus on regional context\n- Pragmatic Goal - to prepare you for business assignments outside of your native country/\nculture. (At least you will know some of the parameters to watch out for)\n- Roadmap -\no You will form teams. Each team will focus on a particular region/culture.\no Each week\nthe class is structured around an aspect of what it's like to work in a culture\nthat various theorists have identified as differentiated. Something that is not\nthe same across cultures. Notions of time. Notions of power.\nWe will discuss what was in the readings.\nEach team will present stories/anecdotes that help to illustrate how your\nculture/region responds to the aspect of the week. Sometimes as a stand-up\npresentation, others as round-robin informal presentations\nUsually one pair of teams will prepare a \"Cross-cultural dialogue.\" Each team\nwill present how its region handles a specific situation. For example: hiring.\nOther teams are expected to provide content as well. All comment/discuss.\nIf something's not working, let me know and we will change it.\n- Caveat about stereotypes. These are anecdotes. May not be indicative of the norm of the\nculture.\no Do not take offense.\no Offer alternate concepts. Offer alternate interpretations\no This is toolkit and framework - sonar to help you improve your own international\nnavigation - but what we do here (based on anecdotes and personal viewpoints) - may\nnot be what you encounter.\n- Course Evaluation -\no Graded Pass/Fail\no Class participation and attendance\no Team presentations/notes\no End of course paper (may be done by self or by small group (no more than 3). Must\ncompare/contrast some aspect of leadership (influencing people in a business context)\nfrom at least 2 cultures/regions. 5 - 10 pages. Due last day of class.\nCross-Cultural L'ship\nFall 2004\nPage 2\n\nCreate Teams\nI do this real time. When I ask them (earlier) to introduce themselves, I ask particularly that they\nstate where in the world they have lived. Then at this point in the class I create teams based on a\nblend of supply and demand.\nFirst I determine the demand - I ask for a list of places the class would like to learn about, expecting\nthey will remember the places mentioned during the introductions. I write down the places that they\nmention on the board. \"Europe\" is clearly too broad and \"Ghana\" too narrow. But for the most part\nI just write down what they say.\nThen we explore the supply. Of the countries/regions listed - how many students have lived/worked\nin each? I'm looking for a minimum of two students for each country/region; individuals who have\nlived/worked in the area long enough that they can be spokespeople for the culture. I've tried teams\nanchored by people who are \"really interested\" or \"have friends who live there\" -- but that hasn't\nworked. Those teams just cannot provide a thick, rich description or answer the questions the other\nstudents have. I am open to experiment. For example - having one person from Saudi Arabia and\none from Yemen (even though those are culturally distinct countries) makes a perfectly adequate base\nfor a \"Middle East\" team. Especially since most of the students in my class have very little personal\nknowledge of that area of the world.\nThen I step back and see what we have. I'm looking for 5 to 8 teams. Fewer teams means each team\ngets more time to speak. More teams mean that more of the world is discussed and I have to do a lot\nof active time management. I decide what regions we will use. (For example: US, Germany, China,\nJapan, and Mexico).\nI then write the names of each team across the board - so that there is space underneath each team\nname. I invite the students then to come up and choose teams. I set minimum and maximum team\nsizes. For example, if there are 8 teams and 35 students I say that a team must have at least 3 and no\nmore than 5 members.\nOnce the teams are created, I give them the first assignment. They are given 20 minutes to create\noverview presentations about their countries/regions. I ask them to briefly describe the geography,\nhistory, politics, economic issues, and regional differences of their target area. Usually a 5 minute\npresentation with 5-10 minutes Q&A is fine. At this point I'm looking at the clock - I try to have\nevery team present their overview in this class. Some teams use PowerPoint. Others use flip charts\nthat I have available to them.\nCross-Cultural L'ship\nFall 2004\nPage 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/7ca67139396e6820bd588e27f24e0738_lec2.pdf",
      "content": "Cross Cultural Leadership - 15.996\nLecture Notes\nClass Two - Cultural Styles\n- Universalism vs. Particularism\n- Individualism vs. Collectivism\n- Neutral vs. Emotional\n- Achievement vs. Ascription\n- Dialogue: making a joint hiring decision including compensation\nRead:\n- Trompenaars, Fons and Hampden-Turner, Charles. Riding the Waves of Culture:\nUnderstanding Cultural Diversity in Global Business (2nd edition). New York: McGraw-Hill,\n1998, pages: 1-10, 29-36, 49-53, 68-75, 80-81, 105-111, 121-122.\nAgenda\n- Welcome. Explanation of End of Course Paper Assignment\n- Theories and Themes\n- Universalism vs. Particularism\n- Individualism vs. Collectivism (Communtarianism)\n- Neutral vs. Emotional\n- Achievement vs. Ascription\n- Cross-Cultural Dialogue\n- Next Week's Assignment\nTheories and Themes\nA brief overview of the theorists whose ideas are the framework for this course.\nLate 1950s - Edward Hall\n- Anthropologist. World War II -- U.S. Army in Europe and the Philippines. Later, Director\nof the Foreign Service Institute training program. He observed first hand the many\ndifficulties created by failures of intercultural communication.\n- Proxemics - human use of space within the context of culture\n- Personal space and community (town) space\n- Also looked at monochromic and polychromic time\nLate 1960s - Geert Hofstede\nFounded and managed personnel research dept of IBM Europe.\n- Surveyed 116,000 IBM employees in 40 countries on preferences around management\nstyle and work environment\n- 4 dimensions where differences by country were significant\no power distance\no uncertainty avoidance\no individualism/collectivism\nCross-Cultural L'ship\nFall 2004\nPage 1\n\no masculinity/femininity\no later discussed a 5th dimension = long term view (Asia)\nLate 1980s Fons Trompenaars and Charles Hampden-Turner\nConsultants\nBy 1998: 15 years of research - questionnaire based. Framework from Talcott Parsons, US\nSociologist (Harvard 1927-1973)\n- 30 companies, 50 countries, 30,000 people\n- 7 fundamental dimensions of culture:\nrelationships with people\nuniversalism vs. particularism\nindividualism vs. communitarianism (collectivism)\nneutral vs. emotional\nspecific vs. diffuse\nachievement vs. ascription\nunderstanding of time\nattitudes toward environment\nLate 1990s Robert J House et al - Project GLOBE\nProfessor at Wharton since 1988.\n- by 2004: 10 years of research, 150 researchers, 18,000 managers in 62 countries.\nQuestionnaire. A few industries.\n- 9 cultural dimensions\no assertiveness\no future orientation\no gender differentiation\no uncertainty avoidance\no power distance\no collectivism vs. individualism\no in-group collectivism\no performance orientation\no humane orientation\n- Plus looking for leadership traits that are consistent across cultures - charisma\nToday's topics:\nFons Trompenaars and Charles Hampden-Turner\n- 4 of their 7 fundamental dimensions of culture:\nrelationships with people\nuniversalism vs. particularism\nindividualism vs. communitarianism (collectivism)\nneutral vs. emotional\nspecific vs. diffuse\nachievement vs. ascription\nProcess:\nI use flip-chart sheets. I post four sheets, one for each dimension. I draw a line at the top of each\npage indicating a continuum for a dimension, for example from universalism to particularism. I then\nlabel the ends of each line.\nCross-Cultural L'ship\nFall 2004\nPage 2\n\nAs part of the discussion I expect each team to tell me where their country/region falls on each\ncontinuum. I also expect each team to tell me a story that illustrates why that point of the continuum\nis appropriate. For example the US team may point to the how contracts are used and how pervasive\nthey are as illustration of the universalist nature of the US culture.\nI look to hear from each team for each dimension. The more stories the better. The more the\nstudents are querying each other, the better.\nBefore we start, I reiterate some caveats:\n- There will be anecdotes and stereotypes. Show each other respect. Try not to offend each\nother.\n- This is about NOT making assumptions!!!\n- These continua are frameworks. Lenses through which you can assess a situation AND\nyourself. Do not expect your own experiences to map perfectly to the anecdotes you hear.\n- This course looks to build your awareness that the same action/activity/situation may very\nwell have different meanings. (Is stating your earned degree appropriate or rude?)\nContent:\nUniversalism vs. Particularism -- universal standards and rules vs. particular people and particular\nsituations. Contracts vs. relationships.\nIndividualism vs. Collectivism/Communitarianism - the wants and needs of the individual vs. the\ninterests of the group. Your group can be local or more general. Community = classmates, left-\nhanders, US. I vs. we. Pervasive teamwork of hi tech consulting is at odds with \"watching out for\n#1\" tradition in US.\nNeutral vs. Emotional - show little emotion vs. show emotions readily in many different situations.\nControlled vs. animated. Humor gets very tricky here...\nAchievement vs. Ascription - what you have done vs. who you are. The importance of the right\nschool in France (Ascription) vs. the importance of what you did yesterday (US - achievement).\nCross Cultural Dialogue\nEach lead team does a presentation. Five minutes plus Q&A is fine. I look for themes and\nvariations. Then I lead a discussion - looking for similarities across cultures as well as differences.\nAnd always - stories, stories, stories.\nIf there is not enough time for discussion, I will hold that over for the next week.\nCross-Cultural L'ship\nFall 2004\nPage 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/0755d75b5c8c19884b1c236c1e7bf4c2_lec3.pdf",
      "content": "Cross Cultural Leadership - 15.996\nLecture Notes\n\nClass Three - Social Dimensions\n\n- Assertiveness\n- Gender Differentiation\n- Uncertainty Avoidance\n- Power Distance\n- Cross-cultural dialogue\n\nRead:\n- Javidan, Mansour and House, Robert J. \"Cultural Acumen for the Global Manager: Lessons\nfrom Project GLOBE.\" Organizational Dynamics, Vol. 29, No. 4, pages 289-304, Spring\n2001.\n- House, Robert J.; Hanges, Paul J.; Javidan, Mansour; Dorfman, Peter W. and Gupta, Vipin.\nCulture, Leadership, and Organizations: The GLOBE Study of 62 Societies. Thousand Oaks,\nCalifornia, 2004, pages: 410, 411; 365, 366; 622, 623; 539, 540; 250, 251; 573, 574.\n- Schneider, Susan and Barsoux, Jean-Louis. Managing Across Cultures (2nd edition). Essex,\nEngland: Pearson Education Limited, 2003, pages 87-95.\n\nAgenda\n\n- Welcome.\n- Context for this week's theory\n- Assertiveness\n- Gender Differentiation\n- Uncertainty Avoidance\n- Power Distance\n- Cross-Cultural Dialogue\n- Next Week's Assignment\nCross-Cultural L'ship\nFall 2004\nPage 1\n\nContext for this week's theory\n\nReminder -- Late 1960s - Geert Hofstede\nFounded and managed personnel research dept of IBM Europe.\nSurveyed 116,000 IBM employees in 40 countries on preferences around management style and\nwork environment\n- 4 dimensions where differences by country were significant\no power distance\no uncertainty avoidance\no individualism/collectivism\no masculinity/femininity\no 5th = long term view (Asia)\n\nGLOBE takes \"masculine/feminine\" and creates 2 categories\no assertiveness\no gender differentiation\n\nAdditional studies did not always get the same results. Dimensions still useful - even though results\nvariable. (World is different - not just IBM being studied)\n\nProcess:\n\nSame as last week. Dimensions posted on board. Teams explain where their regions fit along the\ndimension and tell stories.\n\nContent:\nAssertiveness and Gender Differentiation\n(Schneider & Barsoux) High masculine\n1. Task not relationships\n2. Motivation by money and things, not quality of life\n3. Leadership - ensure bottom line profits and set targets\n4. \"Feminine\" leader would safe-guard employee well-being and demonstrate\nconcern for social responsibility\n(GLOBE) - Gender Differentiation = society maximizes gender role differentiation. Who gets status\nand decision-making power\n(GLOBE) Assertive = society encourages people to be tough, confrontational, assertive and\ncompetitive (not modest and tender). Can-do vs. cooperation and harmony.\n\nUncertainty avoidance deals with a society's tolerance for uncertainty and ambiguity.\n(Schneider & Barsoux) High uncertainty avoidance\n1. More formalization, more written rules and regs\n2. Risk avoidance\nCross-Cultural L'ship\nFall 2004\nPage 2\n\n3. Motivated by stability and security\n4. Leaders - plan, organize, coordinate, control\n\n(GLOBE) society seeks orderliness, consistency, structure\n\nNOTE - Be explicit about difference between discomfort in unstructured situations (are there traffic\nrules for crossing the street) and \"risk avoidance\"\n\nPower distance, the extent to which the less powerful members of organizations and institutions (like\nthe family) accept and expect that power is distributed unequally.\n(Schneider and Barsoux) High power distance\n1. More hierarchy\n2. More supervision (narrow span of control)\n3. More centralized decision-making\n4. Motivated by status and power\n5. Leaders revered or obeyed as authorities\n\n(GLOBE) - expectation that power is shared Unequally.\n\nCorrelation across two dimensions:\n\nHofstede found that there was a correlation between power distance and uncertainty avoidance that\nprovided insight into the kinds of organization that tend to be successful in those environments.\n\nCross Cultural Dialogue\n\nEach lead team does a presentation. Five minutes plus Q&A is fine. I look for themes and\nvariations. Then I lead a discussion - looking for similarities across cultures as well as differences.\nAnd always - stories, stories, stories.\n\nIf there is not enough time for discussion, I will hold that over for the next week.\nCross-Cultural L'ship\nFall 2004\nPage 3\nSee chart, p. 93 in:\n\nSchneider, Susan, and Jean-Louis Barsoux. Managing Across Cultures. 2nd ed.\nEssex, England: Pearson Education Limited, 2003, pp. 87-95."
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/46152f06dc86cd48b23407e75b84acd2_lec4.pdf",
      "content": "Cross Cultural Leadership - 15.996\nLecture Notes\nClass Four - Orientation to Time and Space\n- Focus on past, present or future\no Short- or long-term horizon\n- Monochronic or polychronic activities\no Rigid or fluid schedules\n- Space: public, private or mixed\n- Cross-cultural dialogue\nRead:\n- Trompenaars, Fons and Hampden-Turner, Charles. Riding the Waves of Culture:\nUnderstanding Cultural Diversity in Global Business (2nd edition). New York:\nMcGraw-Hill, 1998, pages 123-128, 132-144.\n- Gesteland, Richard R. Cross-Cultural Business Behavior: Marketing,\nNegotiating and Managing across Cultures (2nd edition). Copenhagen:\nCopenhagen Business School Press, 2000, pages 55-62.\nAgenda\n- Welcome. Reminder on Course Paper Assignment\n- Time\no Past vs. Present vs. Future\no Monochronic or Polychronic\n- Space\n- Cross-Cultural Dialogue\n- Next Week's Assignment\nProcess:\nSame as last week. Dimensions posted on board. Teams explain where their regions fit\nalong the dimension and tell stories.\nContent:\nTime\nPast vs. present vs. Future - Know what matters!\nAscription vs. current achievement vs. potential\nHistory as determinant (bloodlines)\nCurrent abilities as determinant (current race)\nCross-Cultural L'ship\nFall 2004\nPage 1\n\nPotential as determinant (aspirations, training plans)\nMonochronic - Polychronic - Richard Gesteland\nNumber of concurrent tasks: Single task to multi-task\nFlexibility of schedule - time allocation AND sequencing: rigid to fluid\nDegree of punctuality: absolute to absent\nSpace\nSize of \"personal bubble\" - Edward Hall\n- What is \"too close\" in what situations?\n\nClose family\n\nClose friends\n\nBusiness partners\n\nSocial acquaintances\n\nBusiness acquaintances\n\nStrangers\n\nWhat is \"private?\"\n-\nIf I work with you, how much access do you expect to have to my office space,\nmy personal life and home? re: Specific vs. Diffuse -- (level of involvement) -\naccess is to a specific portion of someone's life - or diffuse - access to one\nprivate area is access to all private areas. Plus wide range of delineation of what\nis public (shared readily) and what is private (your refrigerator or your car?).\nSeparation of business and private vs. merging of biz and private.\n-\nHow do you create a private space? (physical barriers, visual delineations, aural\ncues, eye contact, etc)\nCross Cultural Dialogue\nEach lead team does a presentation. Five minutes plus Q&A is fine. I look for themes\nand variations. Then I lead a discussion - looking for similarities across cultures as well\nas differences. And always - stories, stories, stories.\nIf there is not enough time for discussion, I will hold that over for the next week.\nCross-Cultural L'ship\nFall 2004\nPage 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-996-cross-cultural-leadership-fall-2004/998bbb2bb3a1493c3950bfc11e2a1643_lec5.pdf",
      "content": "Cross Cultural Leadership - 15.996\nLecture Notes\nClass Five - Leadership Effectiveness\n- Leadership Traits\n- Leadership Styles\n- Presentations on Leadership Effectiveness\n- Presentation of student papers\n- Critique of course\nRead:\n- Kouzes, James and Posner, Barry. The Leadership Challenge. San Francisco:\nJossey-Bass, 2002 (3rd edition), pages 13 - 22, 24-25.\n- Goleman, Daniel. \"Leadership that Gets Results.\" Harvard Business Review,\nMarch-April 2000, pages 78-90.\n- Derr, C. Brooklyn; Roussillon, Sylvie and Bournois, Frank. Cross-Cultural\nApproaches to Leadership Development. Westport, Connecticut: Quorum Books,\n2002, pages 290-292.\n- Graham, John l. and Lam, N. Mark. \"The Chinese Negotiation.\" Harvard\nBusiness Review, October 2003, pages 82-91.\nAgenda\n- Welcome.\n- This week's theories\n- Leadership Presentations\n- Summary of Paper Topics\n- Closing Comments\n- Feedback on Course\nThis week's theories\nHere I just briefly walk through the leadership skills and behaviors mentioned in the\nreadings. I use this to set the stage for the presentations.\nKouzes & Posner\n- Model the Way - behavior that wins you respect, lead from own values, examples\nare often on the simple things - spending time with people, working side by side,\ntelling stories, being visible during crisis/uncertainty\nCross-Cultural L'ship\nFall 2004\nPage 1\n\n- Inspire a Shared Vision - vision of what could be, total belief in making that\nvision a reality, AND can inspire commitment to that vision in others. Forging a\nunity of purpose. Incredibly enthusiastic\n- Challenge the Process - take risk. Pioneer. Willing to step into the unknown and\nchange the status quo. Don't have to invent - do have to adopt early. Help others\nfeel safe in risk-taking. Problems shape leaders - who learn from failure (and\nsuccesses).\n- Enable others to Act - trust, empowerment, teamwork. Give people the chance of\nautonomy, discretion, authority. Provide both the resources and the safety net.\n- Encourage the Heart - help others feel strong and capable. Show appreciation.\nCreate celebration. Recognition. (from the heart). Lship IS about strong and\nsustainable relationships.\nK&P list (top four)\n- Honest\n- Forward Looking\n- Competent\n- Inspiring\nGoleman\n- Threshold capabilities (intelligence, appropriate skills, cognitive skills - big-\npicture thinking, long-term vision)\n- Emotional Intelligence (twice as important for outstanding performance)\no Self-awareness\no Self-regulation - reasonable people create an environment of trust and\nfairness. Roll with the changes.\no Motivation - achieve for the sake of achievement\no Empathy\no Social Skill - knack for building rapport\nWelch (4 E's)\n- Integrity\n- Intelligence (breadth of knowledge plus emotional intelligence)\n- Energy\n- Energize\n- Edge (courage to make tough decisions)\n- Execute\n- Passion\nLeadership metaphors\nDerr, Rousillon and Bournois:\n- USA - The Free Agent, superstar\n- Latin America - The General, strong man in charge\n- France - The Genius, intellectual elite\nCross-Cultural L'ship\nFall 2004\nPage 2\n\n- UK - The Diplomat\n- Germany - The Master, expert in field\n- Japan - Senior Statesman\n- China - Warlord, has local power\nTraits of Chinese Leader\nGraham and Lam (Chinese Negotiation):\n- Guanxi (Personal connections and individual social capital)\n- Zhongjian Ren (The intermediary)\n- Shehui Dengji (Social status and deference to superiors)\n- Renji Hexie (Interpersonal harmony)\n- Zhengti Guannian (Holistic thinking)\n- Jiejian (Thrift)\n- Mianzi (Face)\n- Chiku Nailao (Endurance)\nLeadership Presentations\nIn this section each team gives a presentation. They imagine the audience is a group of\nex-pats just arrived to the team's region/country. The presentation is advice to these ex-\npats on how to be recognized as a strong, effective leader in that country/region. As ever,\na short presentation with room for Q&A works best.\nSummary of Paper Topics\nIf there is time, I ask each student (or group) to describe their paper topics and share with\nthe class the key learning of the paper.\nCross-Cultural L'ship\nFall 2004\nPage 3"
    }
  ]
}