{
  "course_name": "Cross-Cultural Perspectives on Contemporary French Society",
  "course_description": "This course is an intermediate subject designed to help students gradually build an in-depth understanding of France. The course focuses on French attitudes and values regarding education, work, family and institutions, and deals with the differing notions that underlie interpersonal interactions and communication styles, such as politeness, friendship and formality. Using a Web comparative, cross-cultural approach, students explore a variety of French and American materials, then analyze and compare them using questionnaires, opinion polls, news reports (in different media), as well as a variety of historical, anthropological and literary texts. Throughout the course, attention is given to the development of relevant linguistics skills. This course is recommended for students planning to study and work in France and is taught in French.",
  "topics": [
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nCe cours s'adresse aux etudiants qui ont suivi le cours de Francais 4 ou qui ont etudie le francais au moins 4 ans au lycee ou 4 semestres a l'universite.\n\nObjectif et Contenu\n\nL'objectif de ce cours est de vous aider a mieux connaitre et comprendre la societe francaise actuelle. Vous lirez de nombreux chapitres du livre\nLes Francais\n*, de Lawrence Wylie et Jean-Francois Briere (qu'il faut acheter). Ce livre explore les grands traits de la culture francaise contemporaine, et les place dans une perspective historique pour mieux les comprendre. Il adopte aussi une approche comparative entre les cultures francaise et americaine.\n\n*Wylie, Laurence, and Jean-Francois Briere.\nLes Francais\n. 3rd ed. Prentice Hall, 2000. ISBN: 9780130307743.\n\nVous lirez egalement des textes, articles et documents divers qui vous seront distribues ou auxquels vous aurez acces en ligne. Il y aura egalement quelques videos a voir.\n\nJe vous encourage a regarder des films francais en ligne (sur Netflix par exemple) ou sur place au Foreign Languages Resource Center. Le catalogue est a:\nhttp://fll.mit.edu/materials/catalogue/French\n. Il y a souvent des films francais recents au Kendall theater, je les annoncerai.\n\nPendant toute la duree du semestre, vous devrez regulierement lire la presse (\nLe Figaro\n,\nLe Monde\n,\nLiberation\n) ou regarder des journaux televises (\nFrance 2\n,\nTV5\n) , ou la radio (\nRadio France Internationale\n).\n\nIl y aura, en parallele, un travail de developpement du vocabulaire (par le biais de vos lectures et des listes de vocabulaire que vous etablirez) et de grammaire communicative, en function de vos besoins. Il y a d'excellents sites de grammaire et de conjugaison en ligne (\nTex's French Grammar, Le Point du FLE, Exercices ELFE\n), apprenez a les utiliser. Nous en explorerons quelques-uns ensemble pour que vous puissiez travailler independamment.\n\nProcurez-vous un dictionnaire francais (monolingue) et un dictionnaire anglais/francais. Parmi les dictionnaires en ligne, je vous recommande\nLe Dictionnaire multifonctions de TV5\n.\n\nApproche du cours\n\nIl s'agit d'une approche constructiviste, c'est a dire que vous construirez progressivement votre comprehension de la culture francaise en analysant des documents bruts et en elaborant des hypotheses. Les textes et documents que vous lirez vous aideront a etayer ou modifier vos observations, qui seront ensuite reprises dans les discussions en classe.\n\nTravail a faire\n\nUn programme hebdomadaire detaille sera poste sur le site du cours a la fin de chaque semaine, vous indiquant le travail a fournir pour la semaine suivante: lectures, travail d'analyse, revue de presse, exercices linguistiques, videos a visionner, etc.\n\nChacun d'entre vous devra aussi:\n\nfaire de courts exposes oraux\n\nparticiper au forum de la classe\n\necrire trois petits textes pour faire le point sur les notions etudiees (les sujets seront donnes sous forme de trois tests de 30 minutes environ)\n\ntravailler sur un projet de recherche comparatif pendant la seconde moitie du semestre. Ce projet debouchera sur une presentation orale en fin de semestre (avec un/e partenaire) et un rapport ecrit (individuel). Le sujet sera au choix de chacun, mais devra recevoir mon approbation initiale.\n\nJe ramasse votre travail ecrit systematiquement et je vous le rends, en general, au cours suivant. Pour cette raison je ne peux pas accepter de devoirs en retard. Aucun devoir ne sera accepte au-dela du dernier cours.\n\nPresence en classe\n\nElle est obligatoire, car une grande partie du travail se fera en classe. Pendant le cours il faudra etre actif, c'est-a dire qu'il faudra participer, prendre des notes et poser des questions. Toute absence ou retard aura des consequences sur votre note finale. Si des le debut du semestre vous savez que vous devez vous absenter pour des competitions sportives ou des entretiens d'embauche, merci de me communiquer ces dates a l'avance par email.\n\nNotation\n\nACTIVITIES\n\n% FINAL GRADE\n\nPresence, participation active en classe\n\n30%\n\nQualite de votre preparation et devoirs ecrits\n\n25%\n\nPresentations orales en classe\n\n10%\n\n3 petits tests en classe\n\n15%\n\nProjet final (presentation 15%+ rapport ecrit 5%)\n\n20%\n\nVotre note dependra egalement des progres faits au cours du semestre.\n\nImportant\n\nLe travail que vous me rendez doit absolument etre votre travail personnel. Il n'est pas acceptable d'utiliser un texte ecrit par quelqu'un d'autre sans mentionner le nom de l'auteur, de traduire et presenter comme votre un texte trouve en ligne dans une langue etrangere, d'acheter un devoir, ou de faire ecrire, relire ou corriger votre travail par une autre personne, d'utilser les traducteurs en ligne pour 'traduire' vos devoirs en francais.\n\nCheating, plagiarism, unauthorized collaboration, deliberate interference with the integrity of the work of others, fabrication or falsification of data, and other forms of academic dishonesty are considered serious offenses [...]. (MIT Policies and Procedures)\n\nPour toute question supplementaire, vous pouvez consulter\nhttp://integrity.mit.edu/\n\nBienvenue dans le cours et bon semestre!\n\nProgramme du cours\n\nCe programme vous est donne a titre indicatif et sera modifie si necessaire au cours du semestre.\n\nWEEK #\n\nTOPICS\n\nLa France en septembre 2011. De qui et de quoi parlent les medias?\n\nLes grands symboles\n\nFondation de l'identite culturelle: la famille\n\nFondation de l'identite culturelle: l'ecole\n\nLa religion et la laicite\n\nL'immigration\n\nL'economie, le travail et les loisirs\n\nLes jeunes\n\nLes femmes\n\nLe systeme judiciaire: droit, loi, justice\n\nLe systeme politique: la France et l'Europe\n\nTravail sur le projet comparatif, presentations",
  "files": [
    {
      "category": "Resource",
      "title": "Week 2 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/4451e519aec3fe92aa244233a644d9fd_MIT21G_315F11_hmkwk2.pdf",
      "content": "La France en septembre 2011. De qui et de quoi parlent les medias?\n\nPour le mardi 13 septembre\nTravail a faire avec les journaux (Le Figaro, Le Monde et Liberation). Regardez la page 2 de ces\ndevoirs.\n\nPour le jeudi 15 septembre\nTravail a faire au sujet de l'actualite a la television. Regardez la page 3 de ces devoirs. N'attendez pas la\nderniere minute pour faire ce devoir.\n\nIMPORTANT:\nTous vos devoirs ecrits sont l'occasion de travailler la langue. Utilisez un dictionnaire et les ressources\nen ligne. Je n'accepterai pas de devoirs avec des errreurs de base telles que le genre des noms,\nl'accord sujet/verbe, l'accord nom/adjectif, le choix de l'article, les contractions (du, des, au, aux),\nl'apostrophe (l', d', n', qu', etc.) et les formes des verbes.\n\nSi certains sujets de grammaire vous posent probleme regulierement, consultez les sites de\ngrammaire en ligne indiques sur la page Related Resources. Les explications de Tex's French Grammar\nen particulier sont tres bonnes. Venez aussi me voir pour que je vous recommande des exercices.\n\nPour le mardi 13 septembre\nRegardez les gros titres de plusieurs journaux francais en ligne : Le Figaro, Le Monde et Liberation.\n\n1. Notez les noms des personnalites francaises mentionnees dans les gros-titres et que vous\nconnaissiez (vous avez deja entendu parler d'elles, meme si vous ne savez pas beaucoup de choses a\nleur sujet):\n\n-\n\n...\n\n...\n\n2. Notez le nom de deux personnalites francaises mentionnees dans les gros-titres mais\nque vous ne connaissiez pas.\n\n1.\n2.\n\n- Lisez les articles qui les mentionnent ou cherchez sur Google.fr qui sont ces personnalites,\nquel est leur domaine, pourquoi on parle d'elles en ce moment.\n\n- -\n\n3. Notez deux sigles.\n\n1.\n2.\n\n- Cherchez dans l'article ou sur google.fr ce que veulent dire ces sigles. Notez a la fois l'explication en\nclair, et quelques mots pour montrer que vous comprenez vraiment: ex: IFOP: Institut Francais\nd'Opinion Publique (un organisme qui fait des sondages d'opinion sur des sujets divers, dont les\nresultats sont souvent publies dans les journaux).\n\n- sigle 1:\n\n- sigle 2:\n\n4. Regardez la categorie \"Societe\" des journaux en ligne, et notez deux sujets\nd'actualite importants pour la societe francaise en ce moment. Attention: ne vous contentez\npas de recopier des phrases ou des gros-titres. Vous devez comprendre ce que vous ecrivez\npour pouvoir l'expliquer en termes simples oralement en classe sans lire vos notes.\n\nSujet d'actualite 1: -\n\nSujet d'actualite 2: -\n\nPour le jeudi 15 septembre\nTravail sur l'actualite televisee.\n\n1. Allez sur le site de France 2 http://www.france2.fr\nSur la ligne L'INFO A LA UNE, selectionnez 20 heures. Vous pouvez ensuite choisir de\nregarder le journal televise le plus recent, ou bien choisir un autre jour. Notez quel jour vous\navez regarde: -\n\n2. Relevez les titres de l'actualite (les sujets annonces au debut):\n\n-\n\n...\n3. Ensuite ecoutez le reste du journal, et notez le plus d'informations possibles sur UN des\nsujets annonces au debut. Vous n'avez pas besoin de transcrire ce que disent les\npresentateurs, notez simplement des mots-cles pour pouvoir resumer l'information pour les\nautres oralement.\n\n-\n\n4. Finalement, allez sur un des sites de journaux (Le Figaro, Le Monde ou Liberation), et\ncherchez un article qui parle du meme sujet pour trouver quelques informations\nsupplementaires et mieux comprendre le sujet.\n\nNotez ici ces informations supplementaires:\nDites quel journal vous avez lu, et quel jour :\n-\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 3 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/c07a18da00fcd92604e298bcc753247c_MIT21G_315F11_hmkwk3.pdf",
      "content": "[GƐ OƌAYEƐ ƐLJwdZuGƐ\n\nPour le mardi 20 septembre\n1. Les symboles. Regardez la page de photos que je vous ai donnee en classe le jeudi 15.\n(For the content in this handout, please see: Meyer, D. Icones culturelles. From \"Cles pour\nla France en 80 icones culturelles.\" Paris, Hachette, 2010.) Notez quels symboles vos photos\nrepresentent. Vous pouvez utiliser la liste page 2 si besoin pour vous aider.\n\n2. Lisez dans Les Francais les pages 254 a 260. Faites le travail indique page 3.\n\nPour le jeudi 22 septembre\n\nLisez, dans Les Francais, les pages 1 a 8, sur les stereotypes des Americains au sujet des Francais et\nles pages 309 a 314, sur les stereotypes des Francais au sujet des Americains. Notez les plus\nimportants et ajoutez vos commentaires, page 4.\n\nPour le mardi 20 septembre - Les symboles de la France.\n\nRegardez la page de photos que je vous ai donnee en classe le jeudi 15. (For the content in this handout,\nplease see: Meyer, D. Icones culturelles. From \"Cles pour la France en 80 icones culturelles.\" Paris, Hachette,\n2010.) Notez quels symboles vos photos representent.\n\n2 CV\nAbbe Pierre\nAcademie\nAccordeon\nAlsacienne\nANPE\nAperitif\nAsterix et Obelix\nBaguette et beret\nBleus\nBricolage\nBrigitte Bardot\nCafe et croissant\nCanard Enchaine\nCarotte\nCatherine Deneuve\nChampagne\nCharles de Gaulle\nChiens et chats\nClocher\nCoco Chanel\nConcierge\nCoq\nEdith Piaf\nEscargots et grenouilles\nFestival de Cannes\nFrites\nFromages\nGainsbourg\nGrandes Ecoles\nGuignols\nJacques Derrida\nJeanne d'Arc\nLe Monde\nLegion d'honneur\nLouis Vuitton\nMai 68\nMarcel Marceau\nMarianne\nMarseillaise\nMaurice Chevalier\nMichelin\nNapoleon\nPerrier\nPetanque\nPrix Goncourt\nRentree\nRoland Bartes\nSalutations\nSecurite Sociale\nSolex\nTGV\nTierce et Loto\nTintin\nTour de France\nTour Eiffel\nVacances\nVache qui rit\nVictor Hugo\nVins\n\nPour le mardi 20 septembre\n\nLisez dans Les Francais les pages 254 a 260: les symboles francais.\n\nNotez deux remarques que vous trouvez particulierement interessantes (avec quelques details a\nl'appui). Attention, ne recopiez pas des paragraphes entiers. Prenez des citations courtes mais bien\nchoisies.\n\nRemarque 1:\nRemarque 2:\n-\n\nPour le jeudi 22 septembre\n\nLisez, dans Les Francais, les pages 1 a 8, sur les stereotypes des Americains au sujet des Francais et\nles pages 309 a 314, sur les stereotypes des Francais au sujet des Americains. Notez les plus\nimportants et ajoutez vos commentaries.\n\nLes Americains au sujet des\nFrancais (page 1 a 8)\nLes Francais au sujet des\nAmericains (page 309 a 314)\n\nVos commentaires\n\nCertains de ces steteotypes vous surprennent-ils? Lesquels?\n\n-\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 4 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/19f2453b3d84716c28611e46435584e1_MIT21G_315F11_hmkwk4.pdf",
      "content": "Fondation de l'identite culturelle: la famille\n\nPour le mardi 27 septembre\n\n1. Lisez dans Les Francais les pages 81 a 85, sur la famille traditionnelle. Repondez aux\nquestions page 2.\n\n2. Lisez \"Enfance et premiere education\" page 86 a 96. Notez 3 contrastes entre l‟education\na l‟americaine et l‟education a la francaise sur la fiche jointe page 3.\n\nPour le jeudi 29 septembre\n\n1. Allez regarder au choix UN document parmi les suivants et notez page 4 deux informations\nqui confirment ou contredisent ce que vous aviez lu ou vu jusqu‟a present au sujet de la\nfamille ou de la societe francaise.\n\nSerafini, T. \"Le bebe, exception francaise.\" Liberation, 5 janvier 2009.\nhttp://www.liberation.fr/societe/0101309409-le-bebe-exception-francaise\n\n\"3,3 millions d'enfants ne vivent plus avec leurs deux parents.\" Liberation, 9 octobre 2009.\nhttp://www.liberation.fr/vous/0101596159-3-3-million-d-enfants-ne-vivent-plus-avec-leurs-\ndeux-parents\n\nde Mallevoue, D. \"Les parents toujours adeptes de la fessee.\" Le Figaro, 6 juin 2007.\nhttp://www.lefigaro.fr/actualites/2007/12/06/01001-20071206ARTFIG00010-les-parents-\ntoujours-adeptes-de-la-fessee.php\n\nChemin, A. \"Enfants, mariages, divorces: la revolution familiale.\" Le Monde, 27 javier 2006.\nhttp://www.lemonde.fr/web/imprimer_element/0,40-0@2-3230,50-734959,0.html\n\n2. Lisez dans Les Francais \"Socialisation et modes d‟evasion,\" page 97 a 109. Repondez aux\nquestions page 5.\n\nIMPORTANT: Quand vous repondez a des questions au sujet du livre \"Les Francais\", NE\nRECOPIEZ PAS DE LONGUES PHRASES DU LIVRE. Ceci est un exercice de comprehension ET\nd‟ecriture. Lisez les pages indiquees en vous assurant que vous les comprenez (et en notant le\nvocabulaire nouveau), et ensuite repondez aux questions sans regarder le livre. Utilisez votre\ndictionnaire si besoin.\n\nPour le mardi 27 septembre (page 1 de 2)\n\nLisez dans Les Francais les pages 81 a 85, sur la famille traditionnelle.\n\n1. Quelle valeur „bourgeoise‟ la famille traditionnelle soutenait-elle?\n\n-\n\n2. Quelles etaient, selon les auteurs, les quatre fonctions de la famille traditionnelle?\nEnumerez-les.\n\n1.\n\n2.\n\n3.\n\n4.\n\n3. Que veut dire l‟auteur quand il parle de „mur invisible‟?\n\n-\n\nPour le mardi 27 septembre (page 2 de 2)\n\nLisez les pages 86 a 96 dans Les Francais. Notez 3 contrastes mentionnes par les auteurs\nentre l‟education a l‟americaine et l‟education a la francaise, dans les passages indiques plus\nbas. Indiquez votre reaction personnelle a ces contrastes.\n\n1. Education a la francaise, education a l‟americaine (pages 87 a 89)\n\nEtats-Unis\n\nFrance\n\nReaction personnelle: -\n\n2. L‟enfant francais „produit‟ de ses parents (pages 89 a 91)\n\nEtats-Unis\n\nFrance\n\nReaction personnelle: -\n\n3. L‟apprentissage des regles (page 91 a 96)\n\nEtats-Unis\n\nFrance\n\nReaction personnelle: -\n\nPour le jeudi 29 septembre (page 1 de 2)\nApres avoir lu UN des articles proposes page 1, notez deux informations qui confirment ou\ncontredisent ce que vous aviez lu ou vu jusqu‟a present au sujet de la famille ou de la societe\nfrancaise.\n\nTitre de l'article que vous avez choisi: ...\n\nInformation 1: confirme / contredit\n\n-\n\nInformation 2: confirme / contredit\n\n-\n\nPour le jeudi 29 septembre (page 2 de 2)\nLisez les pages 97 a 109. Repondez aux questions sur UN des passages suivants au choix (1\nou 2 ou 3).\n\n1. Pages 98-99 (de \"Dans la societe americaine\"... a \"... qui etait impose a tout le monde.\")\n\na. Pourquoi, selon les auteurs, certains Francais considerent-ils qu‟il y a moins de liberte aux\nEtats-Unis qu‟en France?\n\n-\n\n___________\n\n2. Pages 102-103 (de \"Contrairement a ce qui se passe\"... a \"... trop facilement blesse.\")\n\na. Pourquoi, selon les auteurs, est-ce que les jeunes Francais peuvent accepter les critiques\nplus facilement que les jeunes Americains?\n\n-\n\nb. Quel exemple particulier donnent-ils pour illustrer ce qu'ils disent?\n\n-\n\n______________\n\n3. Pages 106-107 (de \"L'apprentissage de la defensive\"... a \"de la langue et de la culture\nfrancaises dans le monde\".\n\na. Contre quoi se defendent les enfants francais ?\n\n-\n\nb. Contre quoi se defendent les adultes ?\n\n-\n\nc. Comment s'exprime et s'organise cette defense ?\n\n-\n\nd. Pourquoi, selon les auteurs, les Francais eprouvent-ils le besoin de se defendre ?\n\n-\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 5 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/b5e5f72358bbe220369b6e89cd6cb3c8_MIT21G_315F11_hmkwk5.pdf",
      "content": "Devoirs, semaine du 18 octobre\nLa situation des immigres en France\nPour le mardi 18 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum une photo en\nrapport avec le theme etudie cette semaine. Regarde page 12 pour voir comment proceder.\n\n2. Lisez dans Les Francais les pages 117 a 119 (de \"La hausse de la natalite apres la Seconde\nGuerre mondiale...\" a \"... noms a consonnance etrangere\") et repondez aux questions page 2.\n\n3. Lisez dans Les Francais les pages 244 a 252 (de \"La situation des immigres\" a \"... pour\nsavoir comment la situation evoluera\"). Repondez aux questions page 3.\n\nPour le jeudi 20 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum une photo en\nrapport avec le theme etudie cette semaine. Regarde page 5 pour voir comment proceder.\n\n3. Ecoutez un des morceaux de musique indiques page 4, et faites le travail correspondant.\n\nSi vous avez besoin de travailler l'utilisation des temps du passe ou le subjonctif, regardez\nces exercices suivants sur les temps du passe:\n\nTex's French Grammar:\n\n- Utilisation\n- Plus-que-parfait\n\nELFE:\n\n- Imperfect and Passe Compose I\n- Imperfect and Passe Compose II\n- Imperfect and Passe Compose III\n- Translate: Imperfect\n\nExercices sur le Subjonctif\n\n- Choisissez les differents liens au sujet du subjonctif sur Tex's French Grammar: les explications\nsont bonnes, et les sujets organises par categories.\n\nSi vous faites des exercices, imprimez-les et apportez-les moi, ou recopiez les phrases qui vous\nposent des problemes pour que je puisse en parler avec vous et vous donner des explications supplementaires.\n\nPour le mardi 18 octobre (1 de 2)\n\nLisez dans Les Francais les pages 117 a 119 (de \"La hausse de la natalite apres la Seconde\nGuerre mondiale...\" a \"... noms a consonnance etrangere\") et repondez aux questions.\n\n1. Pourquoi l'immigration a-t-elle ete encouragee de 1945 a 1974?\n\n-\n2. De quels pays venaient les immigres?\n\n-\n3. Selon les auteurs, pour quelle raison l'integration a-t-elle ete plus difficile pour les immigres\ndu Maghreb (c'est a dire venant d'Algerie, de Tunisie et du Maroc) que pour les autres\nimmigres?\n\n-\n\nPour le mardi 18 octobre (2 de 2)\n\nLisez dans Les Francais les pages 244 a 252 (de \"La situation des immigres\" a \"... pour savoir\ncomment la situation evoluera\") et repondez aux questions.\n\n1. Etes-vous d'accord avec l'affirmation selon laquelle \"ce qui unit les Americains est politique\net non pas racial, culturel ou religieux\".\n\n-\n\n2. Quelle est la consequence, pour les etrangers, que la France soit un pays\n\"assimilationniste\"?\n\n-\n3. Qu'est-ce que l'universalisme\"?\n\n-\n\n4. Quelle est la consequence de \"l'universalisme\" sur la politique d'immigration?\n\n-\n\n5. Pourquoi l'auteur cite-t-il la phrase \"Nos ancetres les Gaulois\"? Que veut-il demontrer?\n\n-\n\nPour le jeudi 20 octobre\nTravaillez sur un des morceaux suivants. Regardez la video, lisez les paroles. Essayez de\ncomprendre l'essentiel. IMPORTANT: Je ne vous demande pas de pouvoir traduire ces\nchansons, mais surtout de comprendre le message principal.\n\n1. Je crois que ca va pas etre possible, de Zebda\n\n2. Je suis un jeune de banlieue, Disiz la Peste\n\n3. J'y suis j'y reste, Zebda\n\n4. Ma France a moi, Diam's\nPour le morceau sur lequel vous travaillez, repondez aux deux questions suivantes:\n\n1. Quelle situation est decrite (dans la video et dans les paroles), quel est le message\nprincipal de la chanson?\n\n-\n\n2. Quel est le rapport entre ce que vous avez lu sur l'immigration en France et ce qu'exprime\ncet artiste?\n\n-\n\nLe forum de la classe\n\nVu dans l‟actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 6 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/cfea3adf6d1b3ad514e8f2fdeb2ff311_MIT21G_315F11_hmkwk6.pdf",
      "content": "Devoirs pour le 13 octobre\n\nPas de cours le mardi 11 octobre (Columbus Day)\n\nN'oubliez pas que le mercredi 12 octobre, a 5:00 heures, il y a une session\nd'information sur MIT-France.\n\nRegardez http://web.mit.edu/misti/mit-france si vous voulez plus d'informations.\n\nPour le jeudi 13 octobre\n\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un\ndocument en rapport avec le theme etudie cette semaine. Regarde page 3 pour voir\ncomment proceder.\n\n2. Lisez les pages 261 a 273 dans Les Francais, sur la religion, et repondez aux questions\npage 2.\n\nApportez vos livres en classe aujourd'hui\n\nPour le jeudi 13 octobre\nLisez les pages 261 a 273 et repondez aux questions. Faites attention a la langue. Ne\nrecopiez pas des phrases entieres. Donnez des reponses breves qui me montrent que\nvous comprenez tout ce que vous ecrivez.\n\n1. De quoi parle l'auteur quand il evoque \"une sorte de guerre civile larvee qui divisa\nles Francais de la Revolution a 1945\"?\n\n-\n\ndans quel contexte avez-vous deja rencontre cette notion de \"guerre\"?\n\n-\n\n2. Depuis la Revolution et jusqu'en 1905, l'Etat subventionnait les religions. Pourquoi?\n\n-\n\n3. Pourquoi la religion est-elle vue comme un facteur de division sociale?\n\n-\n\n4. Pourquoi l'auteur dit-il que \"la France est un pays catholique peuple\nd'agnostiques\"?\n\n-\n\n5. Quelles sont les raisons evoquees par l'auteur, quand il dit que la pratique de la\nreligion reste plus forte aux Etats-Unis [qu'en France] \" pour des raisons qui ne sont\npas uniquement religieuses\"?\n\n-\n\n6. Faites une recherche sur google.fr et notez les chiffres essentiels pour les groupes\nreligieux suivants en France.\n\nLes catholiques: -\n\nLes juifs: -\n\nLes musulmans: -\n\nLes protestants: -\n\n7. Vers la fin du chapitre, l'auteur explique que la religion a de moins en moins\nd'influence dans la societe francaise, et que ce n'est plus la religion qui enseigne la\nmorale. Dans ce cas, qui enseigne la morale?\n\n-\n\nLe forum de la classe\n\nVu dans l'actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 7 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/db09276277e7104c605a656c7e79f622_MIT21G_315F11_hmkwk7.pdf",
      "content": "Devoirs, semaine du 18 octobre\nLa situation des immigres en France\nPour le mardi 18 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum une photo en\nrapport avec le theme etudie cette semaine. Regarde page 12 pour voir comment proceder.\n\n2. Lisez dans Les Francais les pages 117 a 119 (de \"La hausse de la natalite apres la Seconde\nGuerre mondiale...\" a \"... noms a consonnance etrangere\") et repondez aux questions page 2.\n\n3. Lisez dans Les Francais les pages 244 a 252 (de \"La situation des immigres\" a \"... pour\nsavoir comment la situation evoluera\"). Repondez aux questions page 3.\n\nPour le jeudi 20 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum une photo en\nrapport avec le theme etudie cette semaine. Regarde page 5 pour voir comment proceder.\n\n3. Ecoutez un des morceaux de musique indiques page 4, et faites le travail correspondant.\nSi vous avez besoin de travailler l'utilisation des temps du passe ou le subjonctif, regardez\nsous Related Resources \"Exercises sur les Temps du Passe.\"\n\nSi vous faites des exercices, imprimez-les et apportez-les moi, ou recopiez les phrases qui\nvous posent des problemes pour que je puisse en parler avec vous et vous donner des\nexplications supplementaires.\n\nPour le mardi 18 octobre (1 de 2)\n\nLisez dans Les Francais les pages 117 a 119 (de \"La hausse de la natalite apres la Seconde\nGuerre mondiale...\" a \"... noms a consonnance etrangere\") et repondez aux questions.\n\n1. Pourquoi l'immigration a-t-elle ete encouragee de 1945 a 1974?\n\n-\n2. De quels pays venaient les immigres?\n\n-\n3. Selon les auteurs, pour quelle raison l'integration a-t-elle ete plus difficile pour les immigres\ndu Maghreb (c'est a dire venant d'Algerie, de Tunisie et du Maroc) que pour les autres\nimmigres?\n\n-\n\nPour le mardi 18 octobre (2 de 2)\n\nLisez dans Les Francais les pages 244 a 252 (de \"La situation des immigres\" a \"... pour savoir\ncomment la situation evoluera\") et repondez aux questions.\n\n1. Etes-vous d'accord avec l'affirmation selon laquelle \"ce qui unit les Americains est politique\net non pas racial, culturel ou religieux\".\n\n-\n\n2. Quelle est la consequence, pour les etrangers, que la France soit un pays\n\"assimilationniste\"?\n\n-\n3. Qu'est-ce que l'universalisme\"?\n\n-\n\n4. Quelle est la consequence de \"l'universalisme\" sur la politique d'immigration?\n\n-\n\n5. Pourquoi l'auteur cite-t-il la phrase \"Nos ancetres les Gaulois\"? Que veut-il demontrer?\n\n-\n\nPour le jeudi 20 octobre\nTravaillez sur un des morceaux suivants. Regardez la video, lisez les paroles. Essayez de\ncomprendre l'essentiel. IMPORTANT: Je ne vous demande pas de pouvoir traduire ces\nchansons, mais surtout de comprendre le message principal.\n\n1. Je crois que ca va pas etre possible, de Zebda\n\n2. Je suis un jeune de banlieue, Disiz la Peste\n\n3. J'y suis j'y reste, Zebda\n\n4. Ma France a moi, Diam's\nPour le morceau sur lequel vous travaillez, repondez aux deux questions suivantes:\n\n1. Quelle situation est decrite (dans la video et dans les paroles), quel est le message\nprincipal de la chanson?\n\n-\n\n2. Quel est le rapport entre ce que vous avez lu sur l'immigration en France et ce qu'exprime\ncet artiste?\n\n-\n\nLe forum de la classe\n\nVu dans l‟actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 8 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/b425f71ad4d9cc343caa65402ac6d4fc_MIT21G_315F11_hmkwk8.pdf",
      "content": "Devoirs, 25 et 27 octobre - le travail et les loisirs\n\nPour le mardi 25 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un document\nen rapport avec le theme etudie cette semaine. Regarde page 6 pour voir comment proceder.\n\n2. Lisez dans Les Francais les pages 210 a 220. Repondez aux questions page 2.\n\n3. Lisez aussi les pages 221 a 227, a partir de \"La France a longtemps ete un pays ou...\").\nRepondez aux questions page 3.\n\nPour le jeudi 27 octobre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un document\nen rapport avec le theme etudie cette semaine. Regarde page 3 pour voir comment proceder.\n\n2. Lisez dans Les Francais les pages 288 a 294, jusqu'a \"vont sejourner chez des parents ou\ndes amis.\" Repondez aux questions page 4.\n\n3. Faites le travail page 5, apres avoir lu un des articles suivants:\n\n- Meda, D. \"Les Francais et le travail.\" Le Nouvel Observateur, 22 avril 2010.\n- \"Productivite: les Etats-Unis et la France sont en tete et creusent l'ecart.\" AFP, 20 septembre\n2011.\n- Leveque, E. \"Ce que Mitterrand a legue a l'economie francaise.\" L'Expansion, 10 mai 2011.\n\nAnnonce preliminaire: Le projet de fin de semestre\n\nPour le projet final, vous ferez un travail comparatif entre la France et les Etats-Unis a propos\nd'un sujet precis. Commencez a penser a des sujets de comparaison qui vous interessent et\nque vous pourriez approfondir. Il sera important de pouvoir trouver facilement des\ninformations sur ce sujet a la fois du cote americain et du cote francais.\n\nLa semaine prochaine, je vous demanderai de preciser vos sujets.\n\nVous travaillerez avec un/e partenaire. Il y aura des presentations de groupe les deux derniers\njours de cours, et une partie ecrite a faire individuellement. Je vous donnerai du temps en\ncours pour y travailler.\n\nPour le mardi 25 octobre (1 de 2)\nLisez dans Les Francais les pages 210 a 220 et repondez brievement aux questions\nsuivantes. NE RECOPIEZ PAS DES PHRASES ENTIERES DU LIVRE.\n\n1. Pourquoi l'auteur dit-il qu'en France \"la richesse ne doit jamais s'etaler de maniere trop\nvisible\"?\n\n-\n\n2. Expliquez le principe de \"stabilite\". Pourquoi est-ce que principe a marque le capitalisme en\nFrance?\n\n-\n\n3. Quelle periode a ete particulierement prospere economiquement en France? Quel nom a-t-\non donne a cette periode?\n\n-\n\n4. Comment s'exprime l'ambivalence des Francais aussi bien a l'egard du capitalisme qu'a\nl'egard de l'economie etatisee?\n\n-\n\n5. Pourquoi l'auteur dit-il que la monarchie et l'Etat ont un role similaire dans le domaine\neconomique?\n\n-\n\n6. Quel est le point commun entre le pain, le lait, les cigarettes, l'essence, les tarifs medicaux?\n\n-\n\n7. Les auteurs font une comparaison entre la responsabilite des employeurs et la\nresponsabilite des parents. Que veulent-ils demontrer?\n\n-\n\nPour le mardi 25 octobre (2 de 2)\nLisez, dans Les Francais, les pages 220 a 227 (a partir de \"La France a longtemps ete un pays\nou...\"). Repondez brievement aux questions. NE RECOPIEZ PAS DES PHRASES ENTIERES DU\nLIVRE.\n\n1. Nommez trois des secteurs les plus developpes de l'industrie francaise. Verifiez cette\ninformation en ligne sur google.fr\n\n-\n\n2. Nommez deux secteurs de l'industrie francaise qui sont en declin.\n\n-\n\n3. Quel probleme veut illustrer l'auteur, en prenant l'exemple du Concorde?\n\n-\n\n4. Dans les annees 30 et 40, les salaries ont obtenu deux droits importants. Lesquels?\n\n-\n\n-\n\n5. L'auteur dit qu'il y a peu de syndiques en France. Comment se fait-il, alors, qu'il y ait\nsouvent des greves en France pour defendre les salaires ou les conditions de travail?\n\n-\n\n6. Quel etait le taux de chomage, au moment ou Les Francais a ete publie? Quel est le taux\nmaintenant? Regardez sur google quels sont les chiffres correspondants pour les Etats-Unis.\n\n-\n\n7. Quelle loi importante pour la regulation du travail a-t-elle ete adoptee en 1998? Quel\nprobleme cette loi devait-elle aider a resoudre?\n\n-\n\nPour le jeudi 27 octobre (1 de 2)\n\nLisez dans Les Francais les pages 288 a 294 (jusqu'a \"vont sejourner chez des parents ou des\namis\"). Repondez aux questions.\n\n1. D'ou vient l'idee selon laquelle \"la vraie vie est dans les loisirs\"?\n\n-\n\n2. D'ou vient l'idee selon laquelle \"travailler est grand, beau et honorable\"? (page 289)\n\n-\n\n3. Laquelle de ces idees est dominante aux Etats-Unis? Et en France?\n\n-\n\n4. Qu'y a-t-il de commun entre l'attitude des Francais a l'egard des vacances et le fait que les\nFrancais prennent le temps de dejeuner a midi? (page 290)\n\n-\n\n6. Pourquoi les Francais qui partent en vacances partent-ils tous en meme temps, selon\nl'auteur?\n\n-\n\nPour le jeudi 27 octobre (2 de 2)\n\nLisez un des articles suivants:\n\n- Meda, D. \"Les Francais et le travail.\" Le Nouvel Observateur, 22 avril 2010.\n- \"Productivite: les Etats-Unis et la France sont en tete et creusent l'ecart.\" AFP, 20 septembre\n2011.\n- Leveque, E. \"Ce que Mitterrand a legue a l'economie francaise.\" L'Expansion, 10 mai 2011.\n\nImprimez l'article que vous avez choisi, soulignez les idees importantes.\n\nEst-ce que cet article confirme ou contredit ce que vous saviez sur les Francais et le travail?\nExpliquez. Donnez des details. Notez votre reaction en quelques phrases:\n\n-\n\nLe forum de la classe\n\nVu dans l'actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 9 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/780f74dcc27e2dae5083b383efad884c_MIT21G_315F11_hmkwk9.pdf",
      "content": "Devoirs, 1 et 3 novembre - Les jeunes en France\n\nPour le mardi 1er novembre\nPetit test, pendant les 30 premieres minutes de cours. Relisez le livre, vos notes et vos devoirs\ndes semaines passees sur la religion, l'immigration, le travail. Vous pouvez apporter un\ndictionnaire si vous voulez. Le format sera le meme que pour le premier test.\n\nPas d'autre travail a preparer pour aujourd'hui. Nous travaillerons a partir de documents que\nje vous donnerai en classe.\n\nPour le jeudi 3 novembre\n\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un document\nen rapport avec le theme etudie cette semaine. Regarde page 4 pour voir comment proceder.\n\n2. Regardez sur Readings l'enquete realisee par la Fondation pour l'innovation politique sur \"\nLes jeunesses face a leur avenir\". Ell e compare l'attitude des jeunes dans 17 pays. Les pages\n104 a 112 parlent plus particulierement des jeunes Francais, et les pages 143 a 146 parlent\ndes jeunes Americains. Repondez aux questions pages 2 et 3.\n\n3. Regardez page 4 la description du projet de fin de semestre. Notez par ecrit page 4 deux sujets\npossibles sur lesquels vous aimeriez travailler.\n\nPour le jeudi 3 novembre\n\nRegardez sur Readings l'enquete realisee par la Fondation pour l'innovation politique sur \"Les jeunesses\nface a leur avenir\". Elle compare l'attitude des jeunes dans 17\n\npays. Les pages 104 a 112 parlent plus\nparticulierement des jeunes Francais, et les pages 143 a 146 des jeunes Americains.\n\nCe document etant assez long, je vous indique les pages specifiques ou vous trouverez les reponses a\nmes questions precises, mais n'hesitez pas a lire plus, selon votre curiosite. Approfondissez au moins\nun sujet au-dela des questions que je vous pose et notez-le dans la partie III.\n\nI. Repondez a quatre (4) questions parmi les questions 1 a 9.\n\n1. L'auteur dit que les Francais n'ont pas confiance entre les institutions. En quelle institution\nen particulier n'ont-ils pas confiance? (page 105)\n\n-\n\n2. Quel exemple l'auteur utilise-t-il pour montrer ce manque de confiance? (page 106)\n\n-\n\n3. Que veut dire l'auteur quand il dit que \"les criteres d'age\" sont tres importants en France?\ndonnez deux exemples pour expliquer. (page 107)\n\n-\n\n-\n\n4. Pour les jeunes Francais, qu'est-ce qu'une \"belle vie\"? Notez ce que vous pensez que les\nFrancais ont repondu. Ensuite allez verifier (pages 107 et 108)\n\n- ce que je pense qu'ils ont repondu:\n\n- ce qu'ils ont dit:\n\n5. Au sujet des questions posees aux jeunes Francais sur leur carriere a venir, pourquoi est-ce\nque leurs reponses semblent contredire \"le modele etatiste-egalitariste\", qui \"met en avant\nl'egalite plutot que le merite\"? (page 108)\n\n-\n\n6. L'auteur dit que les jeunes Francais votent moins que les generations precedentes.\nComment s'expriment-ils, alors? (page 109)\n\n-\n\n7. Pourquoi les jeunes Francais sont-ils pessimistes, selon l'auteur? (page 110)\n\n-\n\n8. Pourquoi l'attitude des jeunes Francais a l'egard de leur famille est-elle surprenante?\nComment l'auteur explique-t-il cette attitude? (page 110)\n\n-\n\n-\n\n9. Quelle est la difference entre la participation civique et l'engagement politique? (page 111)\n\n-\n\n-\n\nII. Repondez tous aux questions 10 et 11. Ecrivez sur une feuille separee si besoin.\n\n10. Lisez la page 112 et resumez les 3 idees principales avec vos propres mots.\n\n-\n\n-\n\n-\n\n11. Lisez les pages 143 a 148 sur les jeunes Americains. Les resultats vous\nsurprennent-ils? Expliquez.\n\n-\n\nIII. Notez ici quel sujet vous avez approfondi personnellement et dites ce que vous\navez appris.\n\n-\n\nLe projet de fin de semestre est un travail comparatif entre la France et les Etats-Unis a\npropos d'un sujet precis.\n\nNotez deux sujets de comparaison qui vous interessent et que vous pourriez approfondir. Il\nsera important de pouvoir trouver des informations sur ce sujet a la fois du cote americain et\ndu cote francais. En classe aujourd'hui vous chercherez un/e partenaire avec qui vous pourriez\ntravailler.\n\n-\n\n-\n\nVous ferez votre recherche avec un/e partenaire. Les presentations seront le 6, le 8 et le 13\ndecembre. Vous travaillerez ensemble a la presentation, et me donnerez chacun une\ncomposition ecrite individuellement sur votre sujet de comparaison. Cela permettra de ne pas\ntout dire pendant la presentation (car vous aurez 10 a 15 minutes environ), mais de\ndevelopper votre sujet par ecrit.\n\n-\n\nLe forum de la classe\n\nVu dans l'actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 10 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/1924c1521d16c2988461c62181f0cb7c_MIT21G_315F11_hmkwk10.pdf",
      "content": "Devoirs, 8 et 10 novembre\n\nPour le mardi 8 novembre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un document\nen rapport avec le theme etudie aujourd'hui. Regarde page 5 pour voir comment proceder.\n\n2. Regardez le document suivant: Fourquet, J. \"Barometre Jeunesse: Vague 3.\" IFOP,\n2011. Faites le travail indique page 2.\n\nEn classe aujourd'hui vous essaierez de preciser votre sujet pour le projet de fin de semestre\net de trouver un partenaire.\n\nPour le jeudi 10 novembre\n1. Vu dans l'actualite. Un/e volontaire (designe/e a l'avance) poste sur le Forum un document\nen rapport avec le theme etudie aujourd'hui. Regarde page 5 pour voir comment proceder.\n\n2. Lisez Les Francais, de la page 135 (\"Les Americains qui sejournent en France...\") a la page\n140 (\"... et a vivre en cohabitation avec leur nouveau partenaire\"). Repondez aux questions\npage 3.\n\n3. Regardez les chiffres publies en 2008 dans l'article suivant: Levenson, C.\n\"Hommes/femmes: des rapports opposes entre les Etats-Unis et la France.\" Slate.fr,\n1 juin 2011. Trouvez des chiffres comparatifs pour 2 de ces categories aux Etats-Unis.\n\n4. Developpez votre projet de fin de semestre. Regardez page 4.\n\nPour le mardi 8 novembre\n\nRegardez le document \"Chiffres barometre jeunesse vague 3\" poste avec ces devoirs.\nChoisissez UNE page parmi les suivantes: page 7, ou 9, ou 13, ou 15, ou 20, ou 30, ou 32\n\n1. Notez quel sujet vous avez regarde plus en detail:\n\n-\n\n2. Resumez l'information principale en deux ou trois phrases:\n\n-\n\n3. Est-ce que ces resultats confirment ou contredisent ce que vous savez sur les jeunes en\nFrance et sur la societe francaise? Expliquez.\n\n-\n\nPour le jeudi 10 novembre\n\nLisez Les Francais, de la page 135 (\"Les Americains qui sejournent en France...\") a la page\n140 (\"... et a vivre en cohabitation avec leur nouveau partenaire\".) Repondez aux questions.\n\n1. Quelles sont les deux influences qui definissent la perception des femmes en France?\n\n-\n\n2. Comment s'explique la mefiance des Francaises a l'egard du feminisme?\n\n-\n\n3. L'auteur dit que les Americaines ont ete, dans l'histoire des Etats-Unis, plus independantes.\nPar la suite les femmes americaines ont recherche l'egalite avec les hommes. Qu'est-ce que\nles Francaises ont recherche, plutot que l'egalite?\n\n-\n\n4. Comment les femmes en France ont-elles obtenu des droits, si ce n'est pas par les\nmouvements a la base (grassroot movement) comme aux Etats-Unis?\n\n-\n\n5. Est-ce que les sexes se melangent socialement plus, moins, ou autant en France qu'aux\nEtats-Unis?\n\n-\n\n6. L'auteur dit que les Francais n'approuvent pas l'infidelite conjugale. Pourtant, cela semble\nles choquer moins que les Americains. Pourquoi?\n\n-\n\nPour le jeudi 10 novembre\n\nDeveloppez votre projet de fin de semestre: finalisez votre sujet, confirmez qui est votre\npartenaire, commencez a chercher des ressources en ligne pour voir si votre sujet est\nfaisable.\n\nApportez une feuille avec une premiere liste de ressources qui vont vous aider a advancer.\nNotez les addresses exactes de vos sources en ligne, dites de quel type de document il s'agit, qui l'a\npublie, quand, et indiquez en quelques mots ce qu'il vous apprend sur votre sujet.\n\nIl est important, meme si vous trouvez tous vos documents en ligne, de varier vos sources: articles\nde journaux, extraits de livres, videos, photos, statistiques, etc.\n\nTravaillez avec des documents premiers (c'est a dire des documents que vous analysez vous-\nmemes). Il y a beaucoup d'analyses comparatives entre les Etats-Unis et la France accessibles en\nligne, s'il vous plait ne les copiez pas.\n\nN'hesitez pas a me contacter si vous avez des questions sur un sujet possible.\n\nSujet:\n\nPartenaire:\n\nRessources en ligne\nNotez l'adresse, dites de quel type de document il s'agit, qui l'a publie, quand, et indiquez en\nquelques mots ce qu'il vous apprend sur votre sujet.\n\n-\n\n-\n\n-\n\n-\n\n-\n\n...\n\nLe forum de la classe\n\nVu dans l'actualite. Postez une photo (accompagnee d'un titre et d'un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d'un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines\n\nde television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 11 Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-315-cross-cultural-perspectives-on-contemporary-french-society-fall-2011/161d557652ee1e79b276c91920cfc720_MIT21G_315F11_hmkwk11.pdf",
      "content": "Devoirs, 15 et 17 novembre\n\nPour le mardi 15 novembre\n1. Un/e volontaire (designe/e a l‟avance) poste sur le Forum un document en rapport avec le\ntheme etudie aujourd‟hui. Regarde page 8 pour voir comment proceder.\n\n2. Lisez les pages 148 a 157 sur le systeme judiciaire francais. Repondez aux questions pages 2 et 3.\n\n3. Lisez un des textes notes page 4 et faites le travail indique.\n\n4. Travaillez a votre projet de fin de semestre. Cherchez des sources supplementaires. Notez\nles premiers points de comparaison que vous pensez developper. Apportez vos documents en\nclasse pour pouvoir travailler avec votre partenaire.\n\nPour le jeudi 17 novembre\n1. Un/e volontaire (designe/e a l‟avance) poste sur le Forum un document en rapport avec le\ntheme etudie aujourd‟hui Regardez page 8 pour voir comment proceder.\n\n2. Dans Les Francais, lisez les pages 158-164 et 167-169 sur le gouvernement. Repondez aux\nquestions pages 5 et 6.\n\n3. Que s‟est-il passe lors des elections de 2002? Faites les travail indique page 7.\n\n4. Avancez votre travail sur votre projet. Apportez vos documents en classe pour pouvoir\ntravailler avec votre partenaire.\n\nPour le mardi 15 novembre - Lisez les pages 148 a 157. Repondez a DIX questions. Ne\nrecopiez pas de phrases entieres du livre, ecrivez des reponses courtes.\n\n1. L'organisation de la justice (page 149 a 151)\n1. Quelle est la difference entre les magistrats et les avocats?\n\n-\n\n2. Qu‟est-ce que le \"Barreau\"?\n\n-\n\n3. Qu‟est-ce que le \"Parquet\"?\n\n-\n\n4. Qu‟est-ce que \"le Garde des sceaux\"\n\n-\n\n5. Comment devient-on juge en France?\n\n-\n\n6. Qu‟est-ce qui garantit, theoriquement, l‟independance des juges?\n\n-\n\n7. Comment est-ce que le gouvernement reussit a influencer la justice?\n\n-\n\n8. Que veulent demontrer les auteurs, quand ils disent que les juges americains doivent avoir\nune immense bibliotheque? Pourquoi n‟est-ce pas le cas des juges francais?\n\n-\n\n9. Les auteurs disent qu‟en France on veut que le gouvernement protege la societe contre les\nindividus dangereux. Quel sont les deux exemples qu‟ils utilisent pour le demontrer?\n\n-\n\n-\n\n2. Les juridictions (pages 152 et 153)\n\n10. Les auteurs disent que les fonctions de la Cour Supreme sont remplies par trois cours\ndifferentes en France. A quelle cour s‟adresse un citoyen s‟il veut se defendre contre l‟Etat?\n\n-\n\n3. Les juristes (page 153)\n\n11. Quelle particularite du systeme francais force les etudiants en droit a choisir tres tot une\ncarriere?\n\n-\n\nLa police\n\n12. Pourquoi les Francais voient-ils la police comme au service du gouvernement, plutot que\ndes citoyens? (page)\n\n-\n\nLes poursuites et les condamnations (page 155\n\n13. Qu‟est-ce que\" l‟immunite parlementaire\"? Quel est son but?\n\n-\n\n14. Comment se fait-il qu‟une grande partie des gens qui sont emprisonnes en France n‟ont\npas encore ete juges?\n\n-\n\n15. Pourquoi les auteurs disent-ils que \"Le systeme judiciaire americain est moins dur pour les\naccuses, mais il est plus dur pour les gens qui sont reconnus coupables\"?\n\n-\n\n16. Notez deux contrastes entre la procedure d‟instruction des cas criminels en France et aux\nEtats-Unis\n\nen France\n\naux Etats-Unis\n\n-\n\n-\n\n-\n\n-\n\nPour le mardi 15 novembre\n\nLisez UN des trois textes indiques ci-dessous. Tous contrastent le systeme juridique francais\net americain.\n\n-\nCohen, M. \"Dominique Strauss-Kahn: la negociation de sa vie.\" CitizenSide\nBlog, 19 mai 2011.\n-\n\"Affaire DSK : justice americaine, mode d'emploi.\" Le Post, 18 mai 2011.\n-\nBouin, J. \"Affaire DSK: la gauche critique la justice americaine.\" Le Figaro, 17\nmai 2011.\n\n- annotez votre texte, cherchez le vocabulaire que vous ne connaissez pas\n- indiquez sur le tableau quels sont les contrastes les plus importants\n- que disent ces differences sur les deux cultures? quels aspects du systeme francais vous\netonnent-ils le plus? Que pensez-vous des critiques portant sur le systeme americain?\n\nAux Etats-Unis\n\nEn France\n\n-\n\n-\n\n-\n\n-\n\n-\n\n-\n\n...\n\n- Vos commentaires:\n\nPour le jeudi 17 novembre\n\nI. Le gouvernement. Lisez les pages 158 a 164 dans Les Francais.\n\n1. Qu‟est-ce que la 5eme republique?\n\n-\n\n2. Comment devient-on president?\n\n-\n\n3. Comment devient-on Premier Ministre?\n\n-\n\n4. Comment devient-on ministre?\n\n-\n\n5. Comment devient-on membre de l‟Assemblee nationale?\n\n-\n\n6. A quoi sert l‟Assemblee?\n\n-\n\n7. Comment devient-on membre du Senat?\n\n-\n\n8. A quoi sert le Senat?\n\n-\n\n9. Quand un journal francais mentionne l‟Elysee, de quoi ou de qui parle-t-il?\n\n-\n\n10. Quand un journal francais mentionne Matignon, de quoi ou de qui parle-t-il?\n\n-\n\n11. Qu‟est-ce que „le quinquennat‟?\n\n-\n\nII. Les elections. Lisez du milieu de la page 167: \"En France comme ailleurs ...\" a la page\n169 \"... que l'on sait etre fausses.\"\n\n1. Selon les auteurs, pourquoi est-ce que l‟Ouest de la France a longtemps vote a droite?\n\n-\n\n2. Pourquoi est-ce que les regions du Nord votaient a gauche?\n\n-\n\n3. Les auteurs disent que l‟election presidentielle ou parlementaire \"se fait en deux tours\"\n(p.167). Pourquoi est-ce necessaire?\n\n-\n\n4. Pourquoi est-ce que les partis doivent s‟unir au deuxieme tour?\n\n-\n\n5. Pourquoi les depenses electorales sont-elles strictement limitees? (p.168)\n\n-\n\n6. Les auteurs disent que le monde politique \"reste massivement domine par les hommes\".\nEn quoi consiste la \"loi sur la parite\", votee par l‟Assemblee en 2000?\n\n-\n\n7. Nommez deux raisons pour lesquelles la vie privee de la classe politique en France est\nprotegee du public.\n\n-\n\nPour le jeudi 17 novembre\n\nFaites une recherche en ligne sur google.fr, repondez brievement aux questions:\n\n1. Que s‟est-il passe le 21 avril 2002, lors des elections presidentielles francaises?\n\n-\n\n2. Pourquoi cette date represente-t-elle ce que certains ont appele \"le cauchemar des\ncandidats\"?\n\n-\n\nLe forum de la classe\n\nVu dans l'actualite. Postez une photo (accompagnee d‟un titre et d‟un commentaire court) sur\nle forum de la classe. Cette photo doit etre en rapport avec le theme etudie cette semaine, et\nvenir d‟un article de journal (regardez plus bas quelles sources vous pouvez utiliser).\n\nPreparez-vous a commenter cette photo oralement devant la classe en 5 minutes environ:\nvous nous direz quel aspect du theme de la semaine est presente dans ce document, et vous\nindiquerez votre reaction a ce document.\n\nQuelles sources pouvez-vous utiliser?\nTous les medias en ligne que vous trouverez sur la page Related Resources: grands journaux\nquotidiens (Le Figaro, Liberation, Le Monde) et chaines de television (France 2 et TV5Monde).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.315 Cross-Cultural Perspectives on Contemporary French Society\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}