{
  "course_name": "Cultural Pluralism in Modern Middle East",
  "course_description": "This seminar considers “difference” and “sameness” as they have been conceived, experienced, and regulated by peoples of the Middle East, with a focus on the 19th and 20th centuries. The first half discusses the Ottoman Empire by exploring how this multiethnic, polyglot empire survived for several relatively peaceful centuries and what happened when its formula for existence was challenged by politics based on mono-ethnic states. The second half of the course focuses on post-Ottoman nation-states, such as Turkey and Egypt, and Western-mandated Arab states, such as Syria, Lebanon, Palestine, and Iraq. Finally, the course concludes with a case analysis of Israel.",
  "topics": [
    "Humanities",
    "History",
    "Middle Eastern History",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Middle Eastern Studies",
    "Humanities",
    "History",
    "Middle Eastern History",
    "Modern History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Middle Eastern Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 weeks / sessions, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nDescription\n\nHow did societies of the Middle East deal with ethnic and religious diversity? What is the role of Islam in the governing principles related to inter-communal contact? How did the Ottomans Ottoman Empire (1299-1922), who had ruled over most of what we now call the \"Middle East\" for about half a millennium, regulate its vast populations' difference without imposing on a single \"nationhood\"? What happened when this formula got challenged in the 19\nth\ncentury when the ideas of nation-state emerged and eventually, along with Western economic and military advance, brought an end to the Ottoman dynasty's rule? This seminar will explore the answers to these questions. We will start with classical Islam, move to early modern Ottomans and then to the modern era because the basic assumption of the course is that history matters and to understand the modern we need to look at its roots. We will discuss the meanings and limits of concepts such as \"cosmopolitanism,\" \"tolerance,\" \"coexistence,\" and \"pluralism,\" and will not shy away making comparisons between the Middle East and the racial and ethnic relations here and now.\n\nPolicy on Laptops and Their Varieties\n\nMIT leaves decisions regarding classroom use of laptops and other internet-connected devices up to the instructor. In this class, laptops and tablets are allowed, but only for note-taking. Cell phones are not allowed.\n\nPolicy on Plagiarism\n\nPlagiarism - the use of another's intellectual work without acknowledgement - is a serious offense. Students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations, including images or texts in other media and for materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\n. Review MIT's online\nAcademic Integrity Handbook\n.\n\nRequirements\n\nParticipation:\nYou should come to class having read the assigned texts and ready to discuss them. Two undocumented absences will result in the lowering of the final course grade.\n\nDiscussion Question:\nStarting from session 4, students will post a discussion question on the class website (see below). Each week, discussion questions are only required for the second session. Questions must be posted by 10pm the night before class.\n\n\"You are the Me\" Day:\nDuring the semester each student will once take the role of the instructor, introduce the topic to the class, and facilitate discussion. Consider this as role playing. Come prepared. The presenter will not have to post a discussion question for that week. The instructor--the student for a day--will instead.\n\nFinal Paper:\nNo final exam but a final research or historiographical paper..\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and participation\n\nDiscussion questions (10 in total)\n\nPresentation and discussion facilitation\n\nFinal paper draft\n\nFinal paper",
  "files": []
}