{
  "course_name": "Culture Tech",
  "course_description": "This class is divided into a series of sections or “modules”, each of which concentrates on a particular large technology-related topic in a cultural context. The class will start with a four-week module on Samurai Swords and Blacksmithing, followed by smaller units on Chinese Cooking, the Invention of Clocks, and Andean Weaving, and end with a four-week module on Automobiles and Engines. In addition, there will be a series of hands-on projects that tie theory and practice together. The class discussions range across anthropology, history, and individual development, emphasizing recurring themes, such as the interaction between technology and culture and the relation between “skill” knowledge and “craft” knowledge.\n\nCulture Tech evolved from a more extensive, two-semester course which formed the centerpiece of the Integrated Studies Program at MIT.  For 13 years, ISP was an alternative first-year program combining humanities, physics, learning-by-doing, and weekly luncheons.  Culture Tech represents the core principles of ISP distilled into a 6-unit seminar. Although many collections of topics have been used over the years, the modules presented here are a representative sequence.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Social Science",
    "Anthropology",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Social Science",
    "Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\n1 session / week, 1 hour / session\n\n1 session / week, 2 hours / session\n\nEach session is either used as a lecture (discussion) or a lab, but which session is used for which purpose changes weekly.\n\nFormat\n\nThe\nExperimental Study Group\n(ESG) is an alternative academic program that offers experimental, small group learning in the core freshmen subjects within a community-based setting. This course, as part of the ESG Seminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Students James Rising (S.B. '05, Philosophy) and Amilio Aviles (S.B. '03, Aero-Astro) taught this seminar, loosely supervised by ESG faculty. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nBackground\n\nCulture Tech evolved from a more extensive, two-semester course which formed the centerpiece of the Integrated Studies Program at MIT. For 13 years, ISP was an alternative first-year program combining humanities, physics, learning-by-doing, and weekly luncheons. Culture Tech represents the core principles of ISP distilled into a 6-unit seminar. Although many collections of topics have been used over the years, the modules presented here are a representative sequence.\n\nStructure\n\nThis class is divided into a series of sections or \"modules,\" each of which concentrates on a large technology-related topic in a cultural context. We will use most of two modules previously developed by the ISP program for depth and parts of three others for variety. The class starts with a four-week module on Samurai Swords and Blacksmithing, followed by smaller units on Chinese Cooking, the Invention of Clocks, and Andean Weaving, and ends with a four-week module on Automobiles and Engines.\n\nThere are two class meetings per week, at which assigned readings and related topics are discussed. In addition, there will be a series of hands-on projects that tie theory and practice together. The discussions range across anthropology, history, and individual development, emphasizing recurring themes, such as the interaction between technology and culture and the relations between \"skill\" knowledge and \"craft\" knowledge.\n\nRequirements\n\nThe 6 units for this class are divided as follows:\n\nMeeting Times - 3 hours per week, divided into one 1-hour meeting and one 2-hour meeting\n\nReading - 2 hours per week, or about 40 pages per week\n\nWriting - 1 hour per week, or a total of about 10 pages for the semester\n\nThe writing is split up into one 4-5 page paper, one 2-3 page paper, and a series of evaluation topic questions to help us track students' reading. The papers are largely on topics of the students' choice. The topic questions ask for short answers (1-2 paragraphs) which require information from the readings, and will be administered (as take-home assignments) every week or two.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n40%\n\nShort Paper\n\n10%\n\nLong Paper\n\n30%\n\nTopic Questions\n\n20%\n\nSchedule\n\nThis list is organized as a sequence of class meetings (of which each two make a week). Each class time has associated readings and discussion. Citations and questions for the readings and details about lab activities can be found on each module page.\n\nSES #\n\nTOPICS\n\nThe Samurai Sword and Blacksmithing\n\nIntroduction to Japan\n\nThe katana\n\nThe samurai's cultural origins\n\nThe code of the samurai\n\nZen and the samurai\n\nCivil war and unification\n\nGiving up the gun\n\nThe Tokugawa state\n\nChinese Cooking and Food\n\nThe context of Chinese food\n\nThe interplay between Chinese food and culture\n\nJohn Harrison and Clocks\n\nHarrison and the longitude problem\n\nClock design issues and engineering\n\nAndean Weaving\n\nPeruvian textiles and culture\n\nQuipus\n\nPeruvian textile techniques\n\nTextiles and their functions\n\nAutomobiles and Engines\n\nEarly history of the automobile\n\nEngine design and engineering\n\nSuburbanization\n\nAmerican rites of passage\n\nFast food and American culture\n\nScientific thinking, Zen, and motorcycles\n\nCultural change and progress",
  "files": []
}