{
  "course_name": "Current Debates in Media",
  "course_description": "This class addresses important, current debates in media with in-depth discussion of popular perceptions and policy implications. Students will engage in the critical study of the economic, political, social, and cultural significance of media, and learn to identify, analyze, and understand the complex relations among media texts, policies, institutions, industries, and infrastructures. This class offers the opportunity to discuss, in stimulating and challenging ways, topics such as ideology, propaganda, net neutrality, big data, digital hacktivism, digital rebellion, media violence, gamification, collective intelligence, participatory culture, intellectual property, artificial intelligence, etc., from historical, transcultural, and multiple methodological perspectives.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Philosophy",
    "Social Science",
    "Communication",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Society",
    "Gender Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Philosophy",
    "Social Science",
    "Communication",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Society",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis class addresses important, current debates in media with in-depth discussion of popular perceptions and policy implications. Students will engage in the critical study of the economic, political, social, and cultural significance of media, and learn to identify, analyze, and understand the complex relations among media texts, policies, institutions, industries, and infrastructures. This class offers the opportunity to discuss, in stimulating and challenging ways, topics such as ideology, propaganda, net neutrality, big data, digital hacktivism, digital rebellion, media violence, gamification, collective intelligence, participatory culture, intellectual property, artificial intelligence, etc., from historical, transcultural, and multiple methodological perspectives. We will examine the framing of these issues, their ethical and policy implications, as well as strategies for repositioning the debates.\n\nPrerequisites\n\nCMS.100 Introduction to Media Studies\n\nLearning Objectives\n\nDemonstrating, through oral presentations, discussions, and written works, an understanding of the current debates in media;\n\nEngaging with complex ideas, opening up to different perspectives, and developing critical thinking skills;\n\nLearning how to discriminate between reliable and unreliable sources of information;\n\nAnalyzing cultural objects critically and situating this analysis in a particular theoretical framework;\n\nUsing the thesis / antithesis / synthesis method to build a strong and nuanced argumentation.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n15%\n\nClass Presentation\n\n35%\n\nDissertation\n\n40%\n\nParticipation in the Class Project\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "CMS.701s15 Dissertation Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/da163d6d24a736fcf998146d37ca9f34_MITCMS_701S15_Dissrtation.pdf",
      "content": "DISSERTATION\nInt\n\nroduction\n-\n-\n-\nBring up the topi\nSummarize your argumentation\nState your thesis o\nc\nr ask a question\n\nDevel\n\nPart 1\no\n-\np\nThesis\nment\n-\n-\nArgument\n: Defen\n-\nExample #1\n#1\nd you\n\nr position\n-\nArgument #2\n\nExample #2\nPart\n-\n\n-\n- Antithesis:\nArgument #1\nCha\n-\nCou\n\nllenge or consider opposing viewpoints\n\n-\nExample #1\nnter-‐argument #1\nArgument #2\nCounter-‐argument #2\n\nPart\n-\n- Example #2\n-\n-\n\n- T\nArgument\nhesis: Reconcile both position\n#1\ns or reinforce your position\n\n-\n-\nConclusion\nExample\nExample #1\nArgument #2\n\n#2\n\n-\n-\nSummarize your argumentation\n\nOpen up the topic: mention other avenues for research\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms"
    },
    {
      "category": "Exam",
      "title": "CMS.701s15 Final Paper Student Examples",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/65f2cf9661c7fef8e826ab8b6addec66_MITCMS_701S15_FinalPaper.pdf",
      "content": "Current Debates\nIn Digital Media\n\nUndergraduate Students Final Papers\n\nEdited by\nGabrielle Trepanier-Jobin\n\nAugust, 2015\n\nTable of Content\n\nIntroduction\nGabrielle Trepanier-Jobin\n\nCHAPTER 1\nYouTube's Participatory Culture: Online Communities, Social Engagement, and the Value of\nCuriosity\nBy an MIT student. Used with permission.\n\nCHAPTER 2\nExploring Online Anonymity: Enabler of Harassment or Valuable Community-Building Tool?\nBy an MIT student. Used with permission.\n\nCHAPTER 3\nWhen EleGiggle Met E-sports: Why Twitch-Based E-Sports Has Changed\nBy an MIT student. Used with permission.\n\nCHAPTER 4\nNegotiating Ideologies in E-Sports\nBy Ryan Alexander\n\nCHAPTER 5\nThe Moral Grey Area of Manga Scanlations\nBy an MIT student. Used with permission.\n\nCHAPTER 6\nThe Importance of Distinguishing Act from Actor: A Look into the the Culture and Operations of\nAnonymous\nBy Hannah Wood\n\nINTRODUCTION\n\nBy Gabrielle Trepanier-Jobin, PhD\n\nAt the end of the course CMS 701 Current Debates in Media, students were asked to submit a\n15 pages dissertation on the current debate of their choice. They had to discuss this debate by\nusing the thesis/antithesis/synthesis method and by referring to class materials or other reliable\nsources. Each paper had to include a clear thesis statement, supporting evidence, original ideas,\ncounter-arguments, and examples that illustrate their point of view.\n\nThe quality and the diversity of the papers were very impressive. The passion of the students for\ntheir topic was palpable and their knowledge on social networks, e-sports, copyright\ninfringment and hacktivism was remarkable. The texts published in this virtual booklet all\nreceived the highest grade and very good comments. They provide interesting insights on\ncurrent issues with social media and digital technologies.\n\nEnjoy!\n\nChapter 1\n\nYouTube's Participatory Culture:\nOnline Communities, Social Engagement,\nand the Value of Curiosity\n\nBy an MIT student\n\nThe Advent of YouTube\n\nThe rapidly increasing availability of technology has allowed online communities to grow and\nevolve in parallel with traditional media outlets. The innovation of YouTube, a video sharing\nwebsite established in 2005, offered new mechanisms for sharing and discussing amateur\nmedia, thus allowing a specific kind of participatory culture to develop. At the website's\ninception, there was little-to-no divide between the content creators and the audiences that\nengaged with video content. Even now, when that divide is more pronounced, YouTube\ncontinues to be shaped by its users. Its role as a social network and entertainment hub on the\nInternet depends entirely upon the people who upload videos, whether they are casual users,\nprofessional vloggers (video bloggers), YouTube partners, traditional media companies\nbranching out into new media, or commercial multi-channel networks.\n\nYouTube continues to thrive because of a growing, widespread desire to create and watch\nonline video. But is YouTube a media that empowers content creators and fosters the formation\nof Internet communities? Does YouTube allow marginalized voices to reach audiences better\nthan traditional media outlets, and does it encourage experimentation with the video medium?\nOr is this idea of an open platform for media sharing and archiving another utopian fantasy for\nthe Internet; does 'new media' ultimately have the same problems as 'old media' because of\nusers' inherent social biases and the fact that YouTube is ultimately a corporation, one that is\nsusceptible to commercialization and the effects of capitalism?\n\nThis essay will argue that YouTube remains an active space for individuals to engage in online\ncommunities and participatory culture, despite criticisms from traditional media outlets and the\nsometimes-mixed motivations of participants. YouTube has a great amount of complexity and\ndiversity in its contemporary uses, from cell-phone cat videos to artistic films and casual vlogs to\nsemi-professional news shows, and, as such, YouTube cannot be judged by any one type of\nonline video. This discussion will focus on the impact of vlogging personalities and personal\nYouTube channels on online communities, in addition to the evolution of educational media on\nthis platform.\n\nVideo Blogging and Fan Communities\n\nYouTube concurrently developed as a video sharing website and a social media website, so\nmany users feel a sense of community with fellow YouTubers and their audience, interacting\nthrough video uploads, comments, and vlogs. By vlogging, anyone has the ability to speak to an\n\nonline community through the safety of their computer while using gestures, vocal inflections,\nand other characteristics of offline communication to express themselves (Proulx 2011: 6).\nIdeally, YouTube provides a platform where what Hall might consider \"subordinate classes\" can\nexpress their ideologies despite the dominant hegemonic codes of society (1977). Female\nvloggers can talk about sexism, people of color can discuss systemic racism, queer and\ntransgender users can share their personal experiences - and every individual can choose how\nto present themselves online, whether they make carefully scripted content, emotional rants, or\nsome combination of entertaining and thoughtful videos.\n\nOnce a content creator uploads a video, whether it's a silly song or a serious discussion of\ncurrent events, they may promote their video and engage with viewers in the comments.\nYouTube has grown since the 2005-to-2010 era in which most of online community knew each\nother, conversed, and filled the roles of both content creators and fans. Many consistent users\nstill do connect with one another; the platform has just become so massive that it is impossible\nfor one content creator to personally interact with everyone else anymore. However, this\nincrease in YouTube participants has largely been a positive change. More people involved in\nonline video leads to a greater diversity of voices on YouTube and has also allowed fan\ncommunities, generally measured through 'subscribers' to channels, to develop around content\ncreators. These fandoms, consisting of spectators and other creators alike, form because they\nidentify with the vlogger's opinions or find their videos entertaining. These fans then have the\npower to connect with one another to talk about the video in the comments or on other forums\n- many YouTube channels also have Reddit threads, for example - and widen the content\ncreator's audience by sharing their videos. The ideal consumer of YouTube videos is an engaged\nfan, not a passive consumer (Jenkins 2013: 357), because participants socialize based upon their\naffinities and interactions with one another. This is different from some social media sites that\nform communities based on common pasts or offline connections. While many individuals do\nuse YouTube casually, it is more interesting to look at the people who use the website as a\nsocial network in addition to entertainment or education.\n\nAlthough most widely-known channels outside of the YouTube community are so-called\nYouTube 'celebrities,' people who generally have millions of subscribers, there are many smaller\ncontent creators with hundreds or a few thousand subscribers who also consistently foster a\nstrong fan community. For example, channels like NerdyAndQuirky and TheThirdPew are both\ncreated by high school students who also make online videos. They are well spoken, have small\nfanbases with whom they interact regularly, and make videos on topical events but also dabble\nin comedy and entertainment. These users are examples of smaller vloggers who started\nYouTube as a hobby and did not expect any sort of fame, yet they have created videos that have\nsparked conversation and resonated with some audiences. As both ethnic minorities and legal\nminors, both of them are less likely to have their voices heard in normal society or traditional\nmedia platforms. But YouTube allowed people in the online community to find and connect with\nthem based solely on the quality of their content and ideas.\n\nParticipatory Culture Can Lead to Civic Engagement\n\nWhile lesser-known YouTubers generally have more intimate fan communities, some YouTube\n'celebrities' have massive fan communities that can be mobilized to affect society outside of the\nonline space. People turn to Internet communities to create new social norms because they are\ndissatisfied with mainstream norms, or they use the Internet as a platform to raise awareness\nand communicate with people who also care about particular issues (Kahn and Keller 2004: 93).\nKahn and Kellner argue that online communities can have an effect not just on group members,\nbut also the larger society They note that Internet campaigns are often grassroots movements\nthat work to challenge the status quo. And one such example of a community that began with\nYouTube and now contributes to positive global impact is Nerdfighteria, started by John and\nHank Green.\n\nThis community began with fans of a project entitled Brotherhood 2.0, in which John and Hank\nGreen publicly vlogged to each other every day on YouTube for one year, starting January 1st,\n2007. Their channel, Vlogbrothers, eventually gained a fan following, whose name arose after\nJohn saw the game Aero Fighters in the airport and misread the title as \"Nerd Fighters.\" In a\nvideo called \"How to be a Nerdfighter: A Vlogbrothers FAQ\" (Green 2009), John defined a\nNerdfighter as \"a person who, instead of being made out of, like, bones and skin and tissue is\nmade entirely of awesome,\" clarifying that this community, called Nerdfighteria, is \"clearly pro-\nnerd.\" Hank then described Nerdfighteria as a community of people who \"get together and try\nto do awesome things and have a good time and fight against World Suck... which is, like, the\namount of suck in the world.\" Because the community has low barriers of entry - anyone who\nwatches Vlogbrothers videos is implicitly invited to join - Nerdfighteria continues to expand to a\nglobal fan base whose members actively participate in projects that benefit both U.S. charity\norganizations and international causes, evolving from a passive audience to a group of\nindependent creators and activists.\n\nFandoms like Nerdfighteria demonstrate how an emphasis on participatory culture in online\ncommunity can encourage people to engage in important offline issues and think critically,\nespecially the younger audiences who are still developing visions of how they fit into and can\nimpact the world. Perhaps the most significant instance of Nerdfighteria aiding charitable\norganizations is the annual Project for Awesome, created by the Vlogbrothers in 2007. Every\nDecember, all YouTube community members--even people who have never created content\nbefore--are invited to create a video about any charity they think is important, explaining why\nthe non-profit organization deserves support. During the Project for Awesome, John and Hank\nhost a 48-hour live stream to help promote the videos and raise money through video views,\nindividual donations, and purchases of 'perks' such as calendars, handwritten notes, and\nartwork donated by various YouTubers. After the live stream ends, there is an open poll where\nanyone can vote on which charitable organizations receive a portion of the total money raised.\nThe impact on communities that receive support from these charities is just as important as the\ndevelopment of the activist mindset in Nerdfighters. Nerdfighteria encourages every individual,\nno matter how young, to participate in matters of political and civic significance by voicing their\nopinions on which causes they believe are currently most important to society.\n\nThese interactions shows how Nerdfighters are not only involved in participatory culture, but\nalso participatory politics, or \"interactive, peer-base acts through which individuals and groups\nseek to exert both voice and influence on issues of public concern\" (Kligler-Vilenchik 2013: 36).\nAnd because of this real-world engagement, Nerdfighters are no longer just a passive audience\nto the Vlogbrothers, and \"can instead be conceptualized as a 'public'\" (Jenkins 2013). This\nnetwork of fans not only enjoys the range of content that John and Hank Green produce, but\nalso encourages its members to actively think about, produce, and circulate media content. In\nthis sense, YouTube not only empowers content creators to spread messages, but the\nparticipatory culture that permeates the site helps build communities of young people who are\nbeginning to enter roles as politically and intellectually engaged citizens.\n\nAlong these lines, YouTube also enables content creators to experiment with the medium of\nonline video, which led to the creation of educational YouTube channels that engage a\ncommunity of curious people online and promote learning through entertainment. As Jenkins\nwrites in The Future of Fandom, \"we have to face the reality that in an age where differences\nproliferate, where old gatekeepers wither, there may no longer be a 'normal' way of consuming\nmedia\" (2013: 361), and therefore it is possible for educational YouTube channels like Crash\nCourse, Veritasium, Vsauce, Minute Physics, The Brain Scoop, Smarter Every Day, or\nSexplanations to exist and thrive online. Even an entertainment piece like The Lizzie Bennet\nDiaries shows how remixing classical literature can be done intelligently, as the series maintains\nthe integrity of the story and themes within Jane Austen's Pride and Prejudice. The medium of\nonline video is now allowing people, both young and old, to keep learning outside of traditional\nclassroom settings and combine education with entertainment in experimental ways.\n\nMoreover, YouTube allows biologists and physicists, historians and literary experts to create\ncontent without having to conform to a traditional media network's editorial power. These\nusers can create educational videos on topics that interest them or instigate curiosity in their\naudience, without being forced to cater their content to a specific demographic. Decisions\nabout selecting topics and scripting presentations of complex ideas are left completely up to the\ncreator, rather than being filtered through the lens of what advertisers and media executives\nthink would be most appropriate for their networks. And because of the participatory culture\nsurrounding YouTube videos, people can gather across geographical and cultural differences to\nwatch, discuss, and learn together. Oftentimes these communities even work together to close-\ncaption these educational videos in more languages to increase accessibility. This idea of\nspreading free, open, and high-quality information to anyone who has Internet access is a step\ntowards the utopian fantasy of the capabilities of new media; as more educational content is\nbeing produced and archived, individuals have a greater ability to learn what interests them at\nany time. Although educational online video is currently a new technology, time will reveal\nwhether digital learning becomes a new standard for education or if the technology will face\nproblems in the future due to the massive quantity of archived - and perhaps eventually\noutdated - educational video that was produced during the present day.\n\nThe Tension between 'Old' and 'New' Media\n\nDespite the optimism surrounding YouTube content creators and the engaged online\ncommunities that form as a result of the platform, YouTube is ultimately a media company with\nflaws. Therefore, one must address the criticisms of YouTube's platform and content in order to\ndraw better conclusions about the website's net positive or negative impact on Internet\ncommunities, the spread of information, and the empowerment of content creators and fans\nalike.\n\nBecause YouTube and online video is a form of 'new media' and despite the fact that it is\nbecoming part of mainstream culture, there is still a divide between YouTube as a platform and\nthe traditional media outlets that dominate the mass market. As Hall writes, \"quantitatively and\nqualitatively, in twentieth-century advanced capitalism, the media have established a decisive\nand fundamental leadership in the cultural sphere,\" meaning that legacy media has a greater\ninfluence on what cultural channels are considered most 'acceptable' for people to watch -\ndespite the actual reliability of these mass media outlets (1977: 340). By existing on the\nInternet, a relatively new and open means of communication, and gaining in popularity,\nYouTube poses a threat to traditional news sources by drawing a younger and generally more\nskeptical audience.\n\nIn response, legacy media is desperately trying to understand and evaluate online media in\norder to figure out how it works. Traditional news coverage has depicted YouTube as an\nunprecedented expansion of grassroots creativity, but it has also devalued YouTube as a\nplatform for superfluous prank videos and unintelligent content. This love/hate relationship\ntowards online video fluctuates depending on how the YouTube content fits in with their\nregular programming - if a documented act of kindness or an insightful vlog becomes popular\novernight, a traditional news outlet likely feels the pressure to report on the phenomena or else\nmiss out on a current news event. However, traditional media companies appear to maintain a\ncertain level of disdain for online media because they want to keep their current audience and\ncontinue circulating their own messages, rather than losing even more viewership to the\nresource-abundant online world. In addition, established media is trying to anticipate a formula\nfor producing creative content in order to capture the 'young audience' that has grown up being\nmore skeptical of mass media (Lotz 2013). The advertising industry provides many examples of\nthis, from companies like Taco Bell maintaining Snapchat accounts to Denny's Tumblr posts that\nincorporate recent memes. But, ultimately, \"the contemporary focus on the 'viral' nature of\ncirculation expresses media companies' and brands' utter terror of the unknown cultural\nprocesses now influencing all aspects of the media and entertainment industries\" (Jenkins, Ford,\nand Green 2013: 291). This obsession with online media by traditional media seems to stem\nfrom a fear of becoming irrelevant.\n\nThe corporations' fear may also extend to a general disdain for 'millenials,' criticizing a\ngeneration of people for establishing different media standards for online video and content\ncreation. For example, in an opinion piece about the current state of YouTube, Andrew Baron\nwrites \"you will begin to see that the Millennial YouTuber style is to use the jump-cut to such\n\nan extreme in natural conversation, it has become a crutch, and that it does not ultimately\nwork in conjunction with the extreme use of attempting to appear naturally bright, down-to-\nearth, conversational, real and unproduced\" (2014). This article is criticizing the lie of\ninauthenticity in much of online video and how only millenials are 'inexperienced' enough to\nthink that this type of content is 'good' content.\n\nHowever, this sort of reasoning is again reducing YouTube, a broad community of fans and\ncontent creators, to a single type of video, when it actually remains a place with a huge\ndiversity of content. True, some creators hide the 'lie' of the script in their editing, while\nothers improvise and edit very little. But this is no different than the variation of content on\nany other media platform. Editors make jump cuts in fiction like TV series or movies, and some\nshows, like reality television, are very heavily produced. Media creators and producers are\nattempting many things and audiences are responding in many ways, and because online\nvideo doesn't have the same structure or industry as television networks, for example, users\nare encouraged to evolve and iterate and experiment more with their creations. Thus,\nYouTube videos should not even necessarily be evaluated with the same criteria as traditional\nmedia, because the content is oftentimes created for fundamentally different purposes and\naudiences. The arguable appeal of online video to millenials and other audiences, for that\nmatter, is that YouTube provides a community with diverse content that has far more genres\nand experiments than one could ever find on network television. And the personal connection\none feels with vloggers or filmmakers through interacting with them and their work might\nhelp online video feel much more impactful and real than something like reality TV.\n\nA recent example of the conflict between 'old media' and 'new media' is when The White\nHouse invited three YouTubers, Hank Green, Bethany Mota, and Glozell Green, to interview\nBarack Obama. After the event occurred, the legacy media coverage was very skeptical of the\nevent and tried to discredit the YouTube talents, ignoring their thoughtful questions for the\nPresident and instead focusing on irrelevant details about their online personas:\n\nCNN intro'd and outro'd every segment with Glozell in a bathtub full of cereal, as did ABC's morning\nshow... Even new media companies like Vice were dismissive: 'Think of it as a teeny-bopper AMA... The\ninterviewers will be GloZell Green, who's perhaps best known for sitting in a tub full of cereal; a 19-\nyear-old who gives beauty advice named Bethany Mota; and Hank Green, a notorious YouTube ranter\nwhose brother wrote The Fault in Our Stars' (Green 2015).\n\nBy discrediting YouTubers, mass media outlets might hope to make themselves appear more\nlegitimate to older audiences. Legacy media does not necessarily understand online video or\nthe 'millenial' generation, and older generations may occasionally share that opinion.\nHowever, the consequence is that legacy media \"accuses young people of being apathetic\nwhile actively attempting to remove them from the discussion\" (Green 2015). The arguments\nthat traditional media outlets make are merely a continuation of the fact that they are losing\nrelevance and legitimacy, even though they want to remain at the pinnacle of media\nconsumption. Audiences are gravitating towards satiric news shows and online video because\nthey trust the people who are delivering information. And YouTube enables people like Glozell\nGreen and Bethany Mota and Hank Green to cultivate a community and gain that trust by\n\nmaking honest vlogs and entertaining videos and participating in discussions alongside their\nfans. Thus, this platform contributes heavily to a shift in media consumption to the Internet\nbecause of growing, deep-rooted skepticism in audiences.\n\nThe Pervasiveness of Celebrity Culture\n\nThe idea of audiences placing their trust in certain content creators ties into a possible criticism\nof YouTube's celebrity culture and gradual commercialization. While certain spaces on the\nplatform very much encourage community building and creator-audience interaction, some\npeople view YouTube \"as literally a way to 'broadcast yourself' into fame and fortune,\" and\nactively maintain the growing divide between audience and creator (Burgess and Green 2010:\n22). There is a general distaste in some YouTube communities when YouTubers who once made\ncreative or heartfelt videos have transitioned into advertising products or churning out videos\nwith clickbait headlines and very little substance. While these types of YouTubers oftentimes\ncreate 'viral' videos that reach a wide audience and appeal to mass consumer culture, some\nlong-time fans or YouTube community members may see them as compromising the creative\nintegrity that gained them fame in the first place.\n\nThis concern with YouTubers only desiring fame and being undeserving of their popularity also\nfeeds into the criticism that YouTube is becoming increasingly commercial. The YouTube User-\nPartner program, in which YouTube \"gave partnered creators 55% of the revenue generated by\n[their] videos,\" is generally supported; content creators could begin making a full-time living off\nof YouTube and fans would receive more videos (Green 2015). But additional changes started to\naffect more, generally smaller, YouTube content creators and their ability to engage fans and\nsupport online community formation. Around 2012, YouTube began introducing an algorithm to\nfilter users' subscription feeds and promote famous creators who make more advertising\nrevenue for the company, so fans began missing videos put out by smaller channels. A\ndepression in ad rates and several management decisions led to the creation of YouTube\nchannel conglomerates called Multi-Channel Networks (or MCNs), which \"take 20% to 50% of a\nchannel's revenue\" and \"many of which have now been acquired by legacy media companies...\nto become extremely important and powerful forces in the world of online video\" (Green 2015).\nSo, recently, YouTube has shifted from a community and culture of economically productive\ncreators to introducing a layer of industry that is trying to extract value and monetize talents.\nThis is not necessarily an objectively bad thing for the platform, so much as it is an example of\nhow subcultures are oftentimes reincorporated into the dominant market. The relationship\nbetween content creators and audiences is shifting in some cases, so that some people are\ndiversifying their content to other video platforms like Twitch or Vine or Tumblr in order to\nreestablish these interpersonal connections.\n\nThe changing nature of YouTube is a valid concern when it comes to empowering new creators\nwho are not already involved in the industry of online video and YouTube's online communities.\nIt seems more difficult than ever to start creating online video and find an audience, now that\nthe field is considered a legitimate career rather than the social experiment it was in 2005.\nThere will be people who only watch online video for the crazy pranks or alluring titles, and\n\nthere will be content creators that only make those kinds of videos in order to keep YouTube as\na full time job. However, this is not true of all content creators, and there are still communities\nwithin YouTube where vloggers actively try and maintain personal connections with their\naudiences, or filmmakers continue to push the boundaries of what people can do with online\nvideo. As much as the site supports broadcasting-like activities, for many users the site is still\nmostly about discussion, response, and interaction with audiences and friends.\n\nTake a content creator like Tyler Oakley, for example. He has risen to fame because of YouTube\nthrough the \"internal system of celebrity based on and reflecting values that don't necessarily\nmatch up neatly with those of the 'dominant' media\" (Burgess and Green 2010: 23). He\nregularly promotes his videos and earns a living wage from the ad revenue, but he also\ngenuinely tries to interact with fans as much as possible in comments and on other social media\nplatforms like Twitter. Some of his videos are collaborations with other 'popular' YouTubers or\ninclude a sponsored product recommendation, but most of the time his videos are not carefully\nconstructed narratives. He is simultaneously \"within the system of celebrity native to, and\ncontrolled by, the mass media\" (Burgess and Green 2010: 23) because uses his influence to raise\nmoney for The Trevor Project, a charity organization that provides support for LGBTQ youth,\nand wins pop culture awards, but he is also inherently an Internet celebrity who vlogs and\nunderstands meme culture and encourages critical thinking and personal growth in his viewers\nthrough this unique platform.\n\nSeparately, you have the media companies that are struggling to figure out the magic\ncommercial success formula for online video that does not actually exist. For example,\nDreamWorks invested money in an entire series of Shrek vlogs in order to connect to an online\naudience and branch out into transmedia entertainment, but few people take those videos\nseriously. The videos feel like a satire of the vlog format; the same feeling that regular YouTube\nor Internet users get when they see corporations trying to emulate meme culture to 'fit in' and\n'reach the younger generation.' Ford and Green's clinical description of meme culture - \"trolls\nhave sought to manufacture and spread 'memes' for their own malicious joy and to disrupt the\noperations of groups which take the web too seriously\" (2013: 292) - shows one such\nincomplete understanding of Internet culture by academia. In a literary context, the analysis\nseems sound, much like the Shrek vlogs idea appears sound on paper. But their definition of\nmeme culture might feel misrepresentative to many people who spend large amounts of time\nonline. Ultimately, because people continue to return to YouTube to support their favorite\ncreators or find new vloggers or participate in fannish activities, the online communities and\ncreator-audience relationships will still survive and flourish despite the growth of industrial and\ncommercial influence.\n\nOnline Harassment and Abuse of Power\n\nBesides the celebrity and commercial culture surrounding YouTube, another valid criticism is the\nharassment that exists in online communities. As Burgess and Green explain, \"this media panic\nconvergence is exemplified by stories about 'cyberbullying' - the use of digital technologies to\nbully others, especially by posting humiliating or insulting videos, or by using video to document\n\nand celebrate acts of violence\" (2010: 19). Cyberbulling can extend beyond these examples to\nan abuse of power from either audience or creator. With every online video, there may be a\nslough of hurtful comments directed at the content creator or other people involved in the\ndiscussion. Or the videos themselves might be indirect forms of harassment; influential people\ncan upload videos that contain harmful messages of sexism, racism, or other forms of prejudice\nthat could negatively impact, or 'bully,' viewers. Because the Internet makes it possible to\npublicize a wide range of opinions, these dissenting and oftentimes problematic viewpoints will\nappear on every website, and YouTube is no exception.\n\nOne fairly recent example is of Nash Grier, a teenager who rose to fame through carefully\nscripted content on Vine and YouTube. He especially gained a large following of American\nteenage and pre-teen girls, who looked up to him and his content. However, he is also known to\nbe sexist, racist, and homophobic by people who look more objectively at his media content.\nMost controversially, he and two other social media stars made a video entitled \"What Guys\nLook for in Girls,\" in which they reinforced extreme societal beauty and behavioral standards\nlike 'you must shave your arm hair to be attractive' and released it to their audience of mostly\nyoung women, who already systemically battle with low-self esteem and societal pressures on a\ndaily basis. Because this message came from a celebrity that these individuals admired and\ntrusted, it could be more damaging to their self-esteem than if the criticisms came from a\nmiddle school bully that they have learned to ignore.\n\nWhile the initial video was clearly horrible, as these 'celebrities' used their influence and the\nYouTube platform to reinforce sexist stereotypes, the public nature of the video gave all other\ncontent creators the ability to criticize him and speak out against Grier's messages. There were\ntens, if not hundreds, of videos made immediately in response by content creators from various\nspheres of influence, and these videos enabled YouTube communities to come together and\ndiscuss topics like sexism and misogyny. Even though YouTube the corporation does not have a\ngreat system in place to filter for harassment in video content or comments, the massive\nresponse and complaints from community members eventually led to the takedown of Grier's\nvideo.\n\nThus, YouTube does have inherent problems that lie in all forms of media and celebrity culture -\nthe opportunity for people with or without influence to spread harassment and hatred. But\nthere are plenty of people involved in the YouTube community, both content creators and\naudience members, who are striving to create a safe and supportive platform and start\nconversations about subjects like respect, cyberbullying, and unhealthy celebrity culture\ninvolving YouTubers. Even though \"the repetitive framing of YouTube as an amateur 'free-for-\nall' rather than a place for community of artistic experimentation, for instance, situates it as a\nspace where the public or the masses are rising up from the bottom\" (Burgess and Green 2010:\n16), one must have faith in the public to form communities and learn and grow together\nthrough productive discussions.\n\nReconciling YouTube's Imperfections and Inherent Value\n\nYouTube as a new media platform is problematic because all media is inherently problematic\nand incorporates long-standing prejudices and shared biases that exist within our society.\nYouTube does empower content creators to speak from a platform that allows for more direct\nsocial media interactions between creators and fans, both of whom are enthusiastic participants\nin the culture. This active discussion enables audience members to \"'buy into' a cultural\neconomy which rewards their participation\" (Jenkins, Ford, and Green 2013: 294), encourages\ngreater support for independent media producers, and allows for continuous discussion about\nsocietal issues that ought to be discussed, like sexism, racism, homophobia, and transphobia.\n\nBut the system that empowers content creators is far from perfect, because legacy media still\nheavily influences YouTube and our media consumption practices. There is still a dominance of\nthe white, male, European/American celebrity even in online video. But gradually creators from\ntypically marginalized demographics, such as women and people-of-color like Akilah Hughes,\nChescaleigh, and MarinaShutUp, are having their voices amplified and heard by wider\naudiences. Oftentimes smaller yet passionate creators like them are more involved with fans\nand create the more valuable subsections of YouTube - the people who come to the platform\nto become a part of a community instead of to follow a single celebrity, and the people who\ndiscuss difficult topics in order to educate themselves and become more productive and\nconsiderate members of society.\n\nEven though there is a growing imbalance between creators and fans, the YouTube\ncommunity and corporation have the opportunity to grow and change. There is nothing wrong\nwith people who stop by the website to share a viral video or find some quick entertainment,\nbut the real cultural value of the platform is how content creators and \"audience members are\nusing the media texts at their disposal to forge connections with each other, to mediate social\nrelations and make meaning of the world around them\" (Jenkins, Ford, and Green 2013: 294).\nYouTubers are encouraged to evolve, iterate, and experiment with their videos and provide\nfeedback on other peoples' creations. Users push each other to question and discuss ideas,\nrather than blindly being bombarded with media messages, or get involved with projects and\ncommunities, rather than only watching carefully curated commercial videos. YouTube helps\ngive more agency to the creators and viewers if they want to take a more active role in the\nonline media that exist, although it is up to the individual to decide how much they want to\nparticipate.\n\nAdditionally, many influential YouTube content creators tend to promote critical thinking, social\nengagement, creativity, and education, either directly or indirectly through their own actions.\nThe impacts of Nerdfighteria and Tyler Oakley's contributions to The Trevor Project are only two\nsuch examples - Hannah Hart's fans organize volunteer trips to food banks, KickthePJ\nencourages everyone to use their imaginations to dream up films and games, SciShow and The\nBrain Scoop show how interesting accurate science information and museums can be, and Kat\nBlaque's animated videos and current events analyses help guide fans to become more\nsociopolitically aware. As Cory Doctorow writes:\n\nCreators usually start doing what they do for love. There are some creators who say, 'If I couldn't earn a\nliving making art, I'd do something else,\" but it's hard to take this seriously. Pursuing an arts career is not\nthe move of a rational mercenary. Almost everyone who sets out to earn a living from the arts will fail.\nEntering the arts because you want to get rich is like buying lottery tickets because you want to get rich. It\nmight work, but it almost certainly won't. Though, of course, someone always wins the lottery. (Doctorow\n68)\n\nAnd that remains the truth for many influential YouTube creators - they began making online\nvideo as a hobby or because they wanted to express an opinion or share some encouragement;\nthey did not necessarily want to be famous or even conceive that as an option at first. True,\nthere will always be some social media stars that set out to create viral videos and attract fame\nbecause of that, but they fail to have the meaningful interactions with a community that some\nother content creators do.\n\nThe Future of Online Video, Educational Media, Creators, and Communities\n\nOnline video as an educational tool has the power to be incredibly influential, especially when\nimpacting a younger generation or a technologically-savvy older one, and is still being further\nexplored. Educational videos, those that promote creativity and critical thinking, do not incite as\nmuch conflict with legacy media; these videos are rarely in competition with big network\nprogramming and sometimes are even collaborative. Science videos produced by Crash Course\ncan coexist with those sponsored by PBS and Discovery, and both of those companies can\ncoexist with an independent video maker like MinutePhysics because everyone is pushing the\nmedium in different directions and experimenting with different ways to teach. The\nindependent content creators who are familiar with the Internet, whether they are new to\nonline video or not, have the power in this situation because \"as marketers and other content\ncreators enter these spaces, they must think about questions of transparency and authenticity\nand the differences in their own commercial motivations and the social motivations of\ncommunity members\" (Jenkins, Ford, and Green 2013: 296). As an individual, you inherently\nhave this authenticity and therefore have more freedom with experimentation in developing\nyour online persona, what types of content you want to produce, and for whom you want to\nmake things and have conversations with.\n\nYouTube remains a powerful platform for creators, fans, and casual Internet-browsers of all\nages to involve themselves in participatory culture and active online communities. There are\nspaces on the website that are bound to conflict with ideals of traditional media outlets, and\nevery participant has a different motivation to be involved with YouTube - from fame to\nfriendship and trolling to intellectual growth. YouTube has a great amount of complexity and\ndiversity in its contemporary uses and great potential to grow beyond what it is today.\nAlternatively, if the industrial influence in online video expands and the corporate hand of\nYouTube constricts individual creativity and expression, people will find other platforms to host\ntheir content and experiment with online video. If \"technology [magnifies] the power of the\npowerful - not just governments, but the record companies, the movie studios, and the online\nintermediaries who are increasingly shaping the creative sphere themselves - to the\n\ndisadvantage of everyone else,\" society will most likely find a way to oppose it or continue\ncreating despite it (Doctorow 2014: 160).\n\nTo continue looking at the projected future of YouTube, it would be interesting to more\nrigorously compare the myriad types of online video being produced. \"The everyday, often\nmundane decisions each of us makes about what to pass along, who to share it with, and the\ncontext under which we share that material is fundamentally altering the processes of how\nmedia is circulated,\" and that causes a great variation in how people are experimenting with\nonline video creation, adaptation, and remixing (Jenkins, Ford, and Green 2013: 304). Is there,\nperhaps, a greater shift towards searching for the secret to 'viral' videos and spreadable media\nthan this paper suggests? Or do people truly keep returning to online video because of the\npersonalities, because of trust and authenticity and a shared human condition. On that note, it\nwould also be interesting to explore whether YouTube celebrities influence people, especially\nyounger generations, as much as more traditional celebrities - and, for that matter, if the\nYouTube influences are any more positive because they encourage discussion and activism\ninstead of just consumerism?\n\nJenkins, Ford, and Green suggest that \"the spreading of media texts helps us articulate who we\nare, bolster our personal and professional relationships, strengthen our relationships with one\nanother, and build community and awareness around the subjects we care about,\" (2013: 304)\nand YouTube, as a tool, empowers people to create and spread media as well as build\ncommunity. Online video has the power to transcend cultural boundaries and allow us to\nexperience the life of someone else or listen to another perspective, just as it has the power to\nbe six seconds of forgettable entertainment. And the power of online video lies in its ability to\nempower viewers, to encourage them to create their own content, participate in discussions,\nfeed their curiosity, and build a more informed and engaged society.\n\nAs Doctorow succinctly puts it: \"no matter who you are, remember that this Internet thing is\nbigger than the arts, bigger than the entertainment business - it's the nervous system of the\ntwenty-first century, and, depending on how we use it, it can set us free, or it can enslave us\"\n(2014: 162). The Internet, from online video and YouTube to other social media platforms or\nnews articles, has a future ahead of it that no one person can predict. We humans can only\nchoose to participate and use it as a tool to learn and grow from each other, to contribute our\nown thoughts and creative endeavors to this shared space. We must continue working for a\nworld with more critical thinking, more open access to ideas and knowledge, and more\nconsideration for others. And online media may be a stepping-stone to that better world.\n\nReferences\n\nBaron, Andrew. \"YouTube Nation.\" Medium.18 Dec. 2014.\n\nBurgess, Jean E. and Joshua B. Green. \"Agency and Controversy in the YouTube\n\nCommunity.\" In Proceedings IR 9.0: Rethinking Communities, Rethinking Place -\nAssociation of Internet Researchers (AoIR) conference, IT. University of Copenhagen,\nDenmark, 2008. http://eprints.qut.edu.au/15383\n\nBurgess, Jean, and Joshua Green. \"YouTube and the Mainstream Media.\" Youtube: Online Video\nand Participatory Culture. Cambridge: Polity, 2010. 15-37.\n\nDoctorow, Cory, Amanda Palmer, and Neil Gaiman. Information Doesn't Want to Be Free: Laws\nfor the Internet Age. McSweeney's, 2014.\n\nGreen, Hank. \"A Decade Later, YouTube Remains a Mystery, Especially to Itself.\" Medium. 23\nFeb. 2015. https://medium.com/@hankgreen/a-decade-later-youtube-remains-a-\nmystery-especially-to-itself-80a1c38feeaf\n\nGreen, Hank. \"Holy Shit, I Interviewed the President.\" Medium. 24 Jan. 2015. Web.\nhttps://medium.com/message/holy-shit-i-interviewed-the-president-fa3e8fb44d16\n\nGreen, John and Hank Green. \"How To Be a Nerdfighter: A Vlogbrothers FAQ.\" YouTube, 3:59.\nPosted December 27, 2009. <https://www.youtube.com/watch?v=FyQi79aYfxU>\n\nHall, Stuart. \"Culture, the media and the ideological effect,\" in J. Curran, M. Gurevitch and J.\nWoollacott, eds., Mass Communication and Society, London: Edward Arnold, 1977.\n\nJenkins, Henry. \"Afterword: The Future of Fandom.\" Fan Culture: Essays on\nParticipatory Fandom in the 21st Century. By Kristin Michael Barton, Jonathan Malcolm\nLampley, and Stephen J. Sansweet, 2013: 357-64.\n\nJenkins, Henry. \"\"Decreasing World Suck\": Fan Communities, Mechanisms of\n\nTranslation, and Participatory Politics.\" Confessions of an AcaFan. 26 Jun. 2013.\nhttp://henryjenkins.org/2013/06/decreasing-world-suck-fan-communities-mechanisms-\nof-translation-and-participatory-politics.html\n\nJenkins, Henry, Sam Ford, and Joshua Green. \"Conclusion.\" Spreadable Media: Creating Value\nand Meaning in a Networked Culture. NYU, 2013. 290-308.\n\nKahn, Richard, and Douglas Kellner. \"New Media and Internet Activism: From the\n'Battle of Seattle' to Blogging.\" New Media & Society 6.1, 2004: 87-95.\n\nKligler-Vilenchik, Nita. \"Decreasing World Suck\": Fan Communities, Mechanisms of Translation,\nand Participatory Politics. Annenberg School for Communication and Journalism,\nUniversity of Southern California. Jun. 2013.\nhttp://ypp.dmlcentral.net/sites/default/files/publications/Decreasing_World\n_Suck_6.25.13_0.pdf\n\nLotz, Amanda. \"What Old Media Can Teach New Media.\" Spreadable Media. 7 Jan. 2013.\nhttp://spreadablemedia.org/essays/lotz/#.VVGp5tpViko\n\nProulx, Caroline. \"Made of Awesome: The Online Culture of Nerdfighteria.\" Thesis, Saint Mary's\nCollege, 2011. <https://www.saintmarys.edu/files/Made%20of%20Awesome--\nCaroline%20Proulx.pdf>\n\nChapter 2\n\nExploring online anonymity:\nEnabler of harassment or\nvaluable community-building tool?\n\nBy an MIT student\n\nThreatening behavior, flaming, and cyberbullying have come into the public eye over the past\nseveral years, elucidating the hazards of anonymous online communication. Whether one visits\nsocial media sites, article comment sections, or online forums, it is not unusual to come across\nexamples of harassment and negative behavior. These problems have long been attributed to\nthe anonymity of the Internet. Instinctively this makes sense, as most online communication\nmodes divorce traditional personal identifiers (such as name, location, gender, age, and race)\nfrom online personas (often characterized by email addresses and usernames). Through school\nassemblies and news coverage, it has become common knowledge that anyone can claim to be\nanyone or anything online: the opinionated pretend to be experts, the average claim to be\nextraordinary.\n\nSimultaneously, there are communities that thrive in anonymity, and every Internet user has\nlikely used a site that enables some level of anonymity, whether or not they utilize it. Being\nunidentifiable makes talking about controversial or sensitive topics easier, allowing people who\nwould not like their friends or family to know about their opinions or interests to participate.\nAnonymity enables people to create multiple user personalities online, recognizing the\nmultifaceted nature of individuals. Furthermore, anonymity can strengthen community ties and\nfoster a sense of belonging. Site developers with an important and unique set of challenges in\ndetermining what type of community usage to allow, ranging from relatively anonymous to fully\nrooted in offline identities. Each of these decisions shapes user experience, creating myriad\npossibilities for site usage. Since much criticism of online anonymity has come about recently,\nthis paper will explore the assertion that anonymity is harmful to online interactions, and that it\nshould be minimized.\n\nThe factors of anonymity\n\nTraditionally, when people speak of anonymity in the offline world, they are referring to several\ndifferent qualities, including namelessness, lack of visual identification, and lack of personal\ndetails. Anonymity could consist of each individually or any combination thereof. As such, one\ncould be visually identifiable but practically anonymous; a man on a beach would be seen by\nother beachgoers, but without knowing a name or personal information, he would be difficult to\nidentify. Alternatively, two people could have a conversation and divulge their age, gender,\nfamilial situation, and other details, yet never know each other's name and thus not be\ntraceable. Online, however, the criteria for anonymity change somewhat. Internet privacy and\nsecurity scholars would be wont to point out that true online anonymity is never possible, given\n\nthat sites collect data on IP addresses and that browsers give up much information about your\nweb browsing habits. And although there are numerous ways to reduce how closely your\nactions are tracked online, these methods are often outside the realm of average user skills\n(Gold 2013). As a result, here 'online anonymity' will refer to Internet usage that is characterized\nby the user's feeling of untraceability; whether one is actually untraceable or otherwise\nunidentifiable is irrelevant, as it is people's perception of the online world that affects how they\ncommunicate. Online, although the factors of offline anonymity still apply, this untraceability\nand anonymity encompasses some examples not present in offline interactions. The inability (by\nan average user) to connect an email address or user account to its real-world owner, for\nexample, is a mark of online anonymity. Others include inability to find the location from which\na message was sent or a comment was posted. Usernames, additionally, are recognized as being\npseudonyms, making them irrelevant as methods of offline identification, further enabling\nanonymity. It is important to keep these factors in mind when discussing online anonymity, as\nthey affect the myriad reasons people behave as they do online.\n\n4chan and Gamergate: negative effects of anonymity\n\nOnline anonymity has a variety of problems; it encourages cyberbullying, harassment, and\ngenerally creating a negative environment. The perceived lack of accountability for one's actions\nand the fact that the other individuals are invisible to you (and vice versa) are thought to be part\nof this. Even before the popularization of the Internet, researchers were examining the effects\nof anonymity on human behavior and interactions. The feeling of being invisible to others, in\nparticular, was linked to the willingness to administer greater shock levels to other people\n(Lapidot-Lefler and Barak 2012). More recently, the online disinhibition effect has been used to\ndescribe the negative consequences of anonymity online; those who feel they are unidentifiable\nor otherwise anonymous are less likely to feel they are accountable for their negative behavior,\nand are thus more likely to act poorly (Chang 2008, Chiu 2014). Since this theory was developed,\na variety of other factors have been discussed to pinpoint the problems with online anonymity.\nLapidot-Lefler and Barak (2012) emphasize the importance of unidentifiability, invisibility, and\nlack of eye-contact in toxic online inhibition. They posit that feeling unidentifiable (more than\nactually being unidentifiable), not feeling watched by others, and not having to make eye\ncontact with correspondents lead to increased flaming behavior. Chui (2014) and Misoch (2015)\nsuggest that visual anonymity (being visually identical to other participants) and untraceable\nanonymity (being able to act without connection to your offline self) are the two crucial pieces\nof online anonymity that lead to negative disinhibition. Another theory, The Social Identity\nmodel of Deindividualization Effects (SIDE), states that visual anonymity can increase group\nsalience, which can in turn create bias and hostility toward the stereotyped out-group (Chang\n2008, Chui 2014).\n\nOne of the most famous recent cases of cyberbullying and online harassment comes from the\nGamergate controversy. Although the controversy was complicated and disjointed, Gamergate\nbegan with a few users on 4chan, an anonymous message board, who concocted a story of\nfailed journalistic ethics in order to target harassment at a feminist game developer, Zoe Quinn\n(Johnston 2014). Soon after, Anita Sarkeesian, who had been producing videos about\n\nmisogynistic tropes in video games as part of her Feminist Frequency nonprofit, began receiving\ndeath threats from people who identified under the Gamergate banner. Both women (and a\nnumber of others) were harassed and threatened with bodily harm, rape, and murder for\nexpressing opinions objectionable to the members of the Gamergate movement (i.e. for being\nfeminists). The threats towards Sarkeesian and her family became so severe that she left her\nhome fearing for her safety (Wofford 2014). This harassment was aided by the affordances of\nthe sites on which the Gamergaters acted. 4chan neither allows users to make accounts nor\nmandates a username in order to post to boards. Reddit requires only a username and\npassword (no email) to post, and new accounts can be made in seconds. Twitter requires an\nemail address in order to post, but burner email accounts are easy to make, and without posting\nother identifiable information (such as hometown and real name), it is possible to be effectively\nanonymous on the site.\n\nUsing the SIDE model, one can see how a close-knit community on 4chan can create a toxic\nenvironment. Users feel a strong connection to the anonymous online communities to which\nthey belong. These particular 4chan and Reddit boards are heavily dominated by young male\ngamers, whom SIDE predicts will form negative stereotypes of the out-group (in this case,\nfeminist game critics). Users also feel a much stronger connection to the community because\nthey are posting anonymously, making them more likely to act if they feel their community is\nbeing threatened. In the case of Gamergate, 4chan users felt that Quinn's game Depression\nQuest, Sarkeesian's \"Tropes vs. Women\", and perceived criticism of existing popular games\nthreatened the traditional gamer community and the close-knit culture of the particular 4chan\nboards. These negative perceptions led to increased hostility, and through the online\ndisinhibition model, it becomes apparent how intense online harassment occurred. Since their\nonline accounts cannot be traced back to offline identities, 4chan users did not feel accountable\nfor their actions. They were not forced to personally confront their victims or look them in the\neye, making inappropriate, aggressive, and violent comments more likely. Although the\norganization of Gamergate mostly occurred on 4chan, many of the hateful comments Quinn and\nSarkeesian received were via Twitter, which also does not require that one's real identity be\nused. Yet many, if not most, people do use their real identity, creating an imbalance of\nknowledge; Internet trolls from 4chan knew the identities of Quinn and Sarkeesian from their\nTwitter accounts, but the women knew nothing about those harassing them. It is this\ndiscrepancy that makes online harassment especially terrifying, as it leaves the harassed\nextremely vulnerable while the harassers face no punishment. Limiting online anonymity on\nthese sites would drastically reduce the imbalance in power between the harassers and\nharassed, making it easier to track down, ban, and otherwise punish those who behave poorly\nonline.\n\nOnline anonymity does not only beget harassment of a few individuals, but also can create\ngenerally negative online environments. Lapidot-Lefler and Barak (2012) did a series of\nexperiments in which expert evaluations, textual analysis, and self-reporting were used to\ndetermine the degree of toxic online disinhibition effect occurring during online debates\nbetween pairs of subjects. In this study, three facets of online communication (anonymity,\nvisibility, eye-contact) were studied to determine their effects on the conversations. The\n\nresearchers found that anonymity (not knowing any identifying information, just an arbitrarily\nassigned username), invisibility (no webcam to view partner), and a lack of eye-contact (no eye-\nlevel webcam with instructed eye contact) produced the greatest levels of flaming. All of these\nconditions are satisfied in many typical online communities: sites like 4chan, Reddit, YouTube,\nand chat sites do not encourage (and often discourage) use of personally identifying information\nand do not usually have affordances built in to allow eye-contact. The research shows that these\nfactors generally led to more negative communities, which is not desirable when participating in\nonline communication. Anonymity has a negative effect on online communication and should,\ntherefore, be minimized to reduce harassment and foster a more positive environment.\n\nMaking the case for close-knit anonymous communities\n\nYet many hail Reddit and other anonymous forums as wonderful online communities. These\narguments often rely on two factors - moderation and close-knit supportiveness - to make the\ncase for the importance of anonymity. Although by no means perfect, Reddit in particular has\ncultivated strong online communities on the basis of anonymity. As Carr (2012) said, \"Links are\nvoted up or down by a community that is full of pseudonyms, which has the odd effect of\nprompting users to be very intimate and remarkably candid, albeit as avatars.\" Couts (2012)\nagrees, saying \"the 'me' I am on Reddit - the communities I'm a part of, the conversations I\nhave with others - is closer to the 'me' I am offline than anywhere else on the Web. I can say\nwhat I want without fear of retribution (save some embarrassing downvotes).\" SIDE suggests\nthat these online communities within Reddit work because their anonymity encourages\npersonal sharing, making the communities more tight-knit and encouraging people to identify\nwith the group. Furthermore, the different forums within Reddit encompass an enormously\nlarge variety of topics and interests, enabling users to find the particular groups on the site that\nsuit them best.\n\nAlthough critics of anonymity state that it provides a space for harassment, the guidelines and\nnorms of subreddits have proven especially helpful in combatting hate speech in topically\nsensitive communities. The affordances and the benefits of the anonymous nature of these\ncommunities make anonymity worthwhile despite its potential to enable harassment. Reddit's\ndiscussions are organized into a near infinite list of 'subreddits' on different topics, each with its\nown threads and lists. Additionally, as Carr (2012) and Couts (2012) both touched upon, the up-\n/down-voting mechanism allows users within a subreddit to democratically define what things\nare and are not acceptable to users, systematically silencing those who seek to harass users.\nMany subreddits have strong community standards and moderators to enforce them, which\nhelp establish social norms and prevent trolling by outsiders. The right side of the screen\ncontains a pane that reminds users what the rules of the subreddit are, and often give a\ndescription of the type of community they are trying to foster. With this information, new\nvisitors to the subreddit can determine whether they would like to spend more time there,\nhelping steer away people who do not want to participate according to the guidelines.\n\nSubreddits relating to sex positivity and queer identities are especially good examples. As\ncommunities that often experience discrimination, anonymous online forums provide safe\n\nspaces to discuss issues related to their sexual identities. Since the subreddits are designed to\nbe safe spaces, community moderation helps remove negative content or ban those who post\nbigoted things. Because of their more niche discussion topics, these subreddits are usually only\nvisited by those who wish to participate, and moderators make it quite clear that offensive and\nunkind behavior will not be tolerated. More importantly, because Reddit allows users to\ndecouple online and offline identities, members are willing to share personal detail without\nworry of their comments being traced back to their offline life.\n\nThe subreddit r/bisexual, for example, contains a number of posts by users discussing their\nexperiences coming out (or not) to their friends and families. Users who might not want their\nfamilies to know about their sexual orientation, for example, can post without connection to\neven an email address. Even after sharing a significant amount of information about themselves\nand their lives, users can choose not to provide a legal name or location, retaining a sense of\nanonymity. User MarieAntwatnet (2015) posted hundreds of words regarding her family\nsituation and her fears about coming out under the cover of anonymity, and asked Reddit\nwhether they could give her any advice. Other posts like this one abound on the subreddit,\nproviding what might seem to be incredibly intimate information regarding family, identity,\nsexuality, and sexual practices to a community of strangers. Yet as SIDE suggests, this anonymity\nbrings the community closer together, allowing people to share their thoughts with likeminded\nindividuals without fear of revelation to the people in their offline lives. As a result of this, it is\nnot possible to conclude that anonymity necessarily results in cyberbullying; anonymity is too\nbeneficial in some contexts to be unilaterally banned.\n\nIn addition to well-known anonymous online forums, there are numerous others that provide\nsmaller or niche communities. Contrary to producing a negative environment or flaming,\nanonymity fosters closeness between users and a strong sense of community. Online networks\nthat connect cancer patients were studied by Frost et al. (2014). In these communities, cancer\npatients can share tips for managing symptoms and treatments and can seek support from\nother patients. Medical data, however, is highly sensitive, and privacy concerns among patients\nabound. In this study, shareable information was categorized into three groups: clinical\ninformation, daily life experiences, and personal information. Researchers found that patients\nwere very willing to share clinical information, less likely to share daily life experiences, and\nunlikely to share personal information. Clinical information was deemed the most relevant to\ntheir participation in the network and the most beneficial to share. Furthermore, without\npersonal identifying information, which might be contained in daily anecdotes but is definitely\ndisclosed through personal identity information, clinical information would not be easily linked\nto their offline selves. This disconnect further cemented the preference to share clinical\ninformation, and drastically inhibited the willingness of users to share personal information,\nwhich would betray their anonymity. For users of a site concerned with sharing medical advice\nand anecdotes, anonymity results from a privacy concern; the importance of keeping clinical\ndata separate from specific individuals is crucial to the success of such a community. Anonymity,\ntherefore, is not a hindrance to the group, but a crucial feature to its functioning, so anonymity\nshould not be severely restricted.\n\nAnonymity as a user experience design decision\n\nIt seems, then, that although the negative consequences of online anonymity are easily seen,\nthey do not always outweigh the benefits for online communities, and anonymity should be\nneither unilaterally condemned nor praised. No level of anonymity is without criticism, so web\ndesigners should consider carefully the particular uses and affordances of their sites to\ndetermine whether online anonymity would be harmful or beneficial. Users, too, should\nquestion whether utilizing anonymous features on forums or largely anonymous communities\nwill help facilitate their desired online interactions. Furthermore, it has been shown that there\nare a variety of motivations for utilizing anonymity and reasons why people may feel\nanonymous online. The inclusion of anonymity is not a binary decision, and developers should\nbe encouraged to consider whether to adopt a strict policy against it, a haven for it, or some\nmiddle ground between the two. If any degree of anonymity is permitted, however, affordances\nfor preventing trolls, flaming, and cyberbullying should be considered.\n\nFacebook provides an example for the benefits and pitfalls of steering away from anonymity\ncompletely. The company has determined that fake identities are too problematic to be\nworthwhile, and now requires users to provide their real names, saying that \"having people use\ntheir authentic names makes them more accountable, and also helps us root out accounts\ncreated for malicious purposes, like harassment, fraud, impersonation and hate speech\" (Philip\n2015). The company has decided that the ability to use false names makes people virtually\nunidentifiable, and that simply requiring an email address to sign up would not sufficiently link\npeople to their offline selves, which would greatly increase online harassment. Since Facebook\nis about connecting users and providing an online platform for social interactions, fake accounts\ndetract heavily from the intended environment of the site. It is difficult for users to find each\nother when people are not using their real names, and it also poses a safety risk for young\nteenagers making friends online whom they have never met in person. Furthermore, it detracts\nfrom Facebook's ability to sell data based on real users and thus anonymity does not make\nsense from a business perspective, either.\n\nYet attempting to remove anonymity is not without its own problems. Facebook has\nencountered a significant amount of opposition to its name-verification process, which users\nhave to go through if their account is flagged as likely being fake. The process required providing\nphotographic proof of government documents to verify identity and get one's account\nreactivated. For many transgender people and drag queens, however, this restriction was a\nsource of stress, as many do not go by their government names during daily life. Similarly, some\nNative Americans, whose names often violate Facebook's name policy for use of words or\nphrases, have been having difficulty getting their real names verified (Philip 2015, \"What names\nare allowed on Facebook\" 2015). Beyond concerns about the real identity policy itself, Facebook\nusers, especially teens, are still the targets for cyberbullying; anonymity is not the only reason\nfor online bullying, and children will often bully those they know on social media without\nconcern about being known to the victims (Gayle 2013). This unintended consequence of\nbanning anonymity and pseudonyms serves as a lesson that even well-reasoned choices\nregarding anonymity will not necessarily be easy to implement well.\n\nOther sites have taken drastically different approaches to online anonymity. Gawker Media\nowns a large variety of news blog sites, including Deadspin (sports), Kokatu (video games), io9\n(science fiction/technology) and Jezebel (feminism/celebrity). All sites within this network\nfollow similar commenting policies, in which users may post anonymously, but whose\ncomments are subject to moderation. This moderation prevents trolling and flaming comments,\nwhile allowing users whose first comment is approved to comment on any future articles\nwithout moderation, in order to save time for the bloggers themselves (\"Gawker Comments\nFAQ\" 2007). This attempt to balance the desire for anonymity (an email address is requested\nbut not required for signup) and the need to prevent trolls is not perfect, but shows a very\ndifferent compromise than Facebook's choice. Unlike Facebook, whose focus is the users\nthemselves and the connections between them, Gawker sites are focused on responses to the\nparticular content produced by the staff writers. The content focus mitigates the danger of\ndirected, sustained cyberbullying, making anonymity a feasible choice. Additionally, the use of\nmoderation allows a large, loose-knit community to post responses anonymously without the\ndevelopment of a hostile environment. Commenters often complain, however, that their\ncomments go unseen, and if they do not receive moderator review and approval, it is very\ndifficult for other readers to see their comments. Some worry that since the authors are the\nmoderators on their own articles, contrary opinions are censored, preventing readers from\ngaining a nuanced perspective on a topic or knowing what criticism for the author's work exists.\nGawker has worked to fix these issues by allowing viewers to see all comments, even those that\nhave not received approval, but this is not the default state and thus the compromise does not\nplease all users.\n\nOn the other end of the spectrum, 4chan has taken a very hands-off, anything-goes approach to\nonline anonymous communities. 4chan boards have little moderation, and all new content\nautomatically appears at the top of the thread, giving each user a strong, uncensored voice\n(Kushner 2015). Users do not need to use an email address or even a pseudonym to post, nor\ncan they connect directly with other users outside the posts themselves; there is no private\nmessaging system. Users are free to act in contradictory ways, potentially posting many times\non the same thread with differing opinions (to cause a flame war) or the same (to make their\nown viewpoint seem supported). Old threads expire a set time after their original posting,\nstrengthening the perception of impermanence that users feel. Overall, this creates a user\nculture that, while all are devoted to the site and its freedom of speech, is often cited as being a\nhotbed for questionable and illegal activity. Gamergate, as previously mentioned, saw its\nbeginnings on a 4chan forum, as did the hacks revealing celebrity nude photos and various acts\nby Anonymous. Illegal activity, too, from copyright infringement to child pornography exists in\nthe depths of 4chan image boards (Dewey 2014). More than likely any other site, 4chan is\nknown for its lack of rules and its anonymity. Both of these facts often bring out the worst in the\ncommunity, as no one can be held accountable for anything they do on 4chan, even among\nother 4chan users. As described by the SIDE model, 4chan users experience a very strong\nconnection to the site as a result of its anonymity. Yet this tight-knit community, which is very\nsupportive of its members, paradoxically, breeds hatred toward out-groups. The 4chan\ncommunity is thus full of tension, exemplifying both the best and worst of online anonymity.\n\nOnline anonymity is a highly nuanced, complex topic. Stating that anonymity unilaterally causes\nharassment, cyberbullying, and negative online environments does not accurately depict the\nreality of many Internet sites, which cultivate close-knit and caring communities. Yet even on\nsites that take a middle ground between anonymity and verified identity, the benefits and\npitfalls of anonymous communication are hard to navigate. SIDE illustrates this sentiment quite\nwell: the tendency of anonymous sites to create strong communities is ostensibly a positive\neffect, but it can often lead to negative behavior toward and stereotyping of out-groups.\nAlthough it is easy to experience a knee-jerk reaction to the horrible harassment that occurs via\nanonymous forums and advocate for their discontinuance, it is important to recognize that not\nall online communities produce such hateful posts and that the abuse of the system by some\ndoes not invalidate the entire system. The threats that Quinn and Sarkeesian experienced\nduring Gamergate surely show off the worst that online anonymity has to offer, and no one\nshould have to experience the vitriolic words that they did. At the same time, cancer patients\nand closeted queer individuals have benefited significantly from the anonymity their online\ncommunities provide. The ability to share clinical or personal information with a group of others\nwithout fear of identification is important for the privacy of these people. Furthermore, sites\nwith verified identities still may not prevent hostile environments and bullying. These examples\nhave shown that neither anonymity nor the lack thereof can alone provide the perfect online\ncommunity. Given the examples explored here, it is encouraged for site developers to consider\nthe purpose of the sites when building comment systems, considering a middle ground and\nincluding features for moderating or banning toxic users.\n\nReferences\nBaraniuk, Chris. \"End of anonymity.\" New Scientist 26 Oct. 2013: 34-38.\nCarr, David. \"Left Alone by Its Owner, Reddit Soars.\" The New York Times 2 Sept. 2012. Web.\nhttp://www.nytimes.com/2012/09/03/business/media/reddit-thrives-after-advance-\npublications-let-it-sink-or-swim.html.\nCouts, Andrew. \"State of the Web: Reddit, the World's Best Anonymous Social Network.\" Digital\nTrends 11 Sept. 2012. Web. http://www.digitaltrends.com/opinion/reddit-worlds-best-\nanonymous-social-network/.\nDewey, Caitlin. \"Absolutely everything you need to know to understand 4chan, the Internet's\nown bogeyman.\" The Washington Post 25 Sept. 2014. Web.\nhttp://www.washingtonpost.com/news/the-intersect/wp/2014/09/25/absolutely-\neverything-you-need-to-know-to-understand-4chan-the-internets-own-bogeyman/.\nJenna Chang, \"The Role of Anonymity in Deindividuated Behavior: A Comparison of\nDeindividuation Theory and the Social Identity Model of Deindividuation Effects (SIDE).\"\nUndergraduate Journal of Baylor University 6.1 (2008): Web.\nhttp://www.baylor.edu/content/services/document.php?id=77099.\nChui, Rebecca. \"A Multi-faceted Approach to Anonymity Online: Examining the Relations\nbetween Anonymity and Antisocial Behavior.\" Journal of Virtual Worlds Research 7.2\n(2014): Web.\nFrost, J, Vermeulen, IE, Beerers, N. \"Anonymity versus privacy: selective information sharing in\nonline cancer communities.\" Journal of Medical Internet Research 16.5 (2014): Web.\nGayle, Damien. \"Facebook is the worst social network for bullying with 19-year-old BOYS the\nmost common victims.\" Daily Mail 18 Mar. 2013. Web.\nhttp://www.dailymail.co.uk/sciencetech/article-2294023/Facebook-worst-\nsocial-network-bullying-New-survey-shows-youngsters-targeted-online-\nelse.html.\n\"Gawker Comments FAQ.\" Gawker. Gawker Media. 1 Nov. 2007. Web.\nhttp://gawker.com/126529/gawker-comments-faq.\nGold, Steve. \"Getting lost on the Internet: the problem with anonymity.\" Network Security\n2013.6 (2013): 10-13. Web.\nJohnston, Casey. \"Chat logs show how 4chan users created #GamerGate controversy.\" Ars\nTechnica 9 Sept. 2014. Web. http://arstechnica.com/gaming/2014/09/new-chat-\nlogs-show-how-4chan-users-pushed-gamergate-into-the-national-spotlight/.\n\nKushner, David. \"4chan's Overlord Christopher Poole Reveals Why He Walked Away.\" Rolling\nStone 13 Mar. 2015. Web. http://www.rollingstone.com/culture/features/4chans-\noverlord-christopher-poole-reveals-why-he-walked-away-20150313.\n\nLapidot-Lefler, Noam and Azy Barak. \"Effects of anonymity, invisibility, and lack of eye-contact\non toxic online disinhibition.\" Computers in Human Behavior 28. (2012): 434-443.\n\nMarieAntwatnet. \"17 [F] and I have some concerns about coming out..\" Reddit.com. Reddit, Inc.,\n11 May 2015. Web.\nhttp://www.reddit.com/r/bisexual/comments/35i0w9/17_f_and_i_have_some_concern\ns_about_coming_out/.\n\nMisoch, Sabrina. \"Stranger on the internet: Online self-disclosure and the role of visual\nanonymity.\" Computers in Human Behavior 48. (2015): 535-541.\n\nPhilip, Abby. \"Online 'authenticity' and how Facebook's 'real name' policy hurts Native\nAmericans.\" Washington Post 10 Feb. 2015. Web.\nhttp://www.washingtonpost.com/news/morning-mix/wp/2015/02/10/online-\nauthenticity-and-how-facebooks-real-name-policy-hurts-native-americans/.\n\n\"What names are allowed on Facebook?\" Facebook (2015): Web.\nhttps://www.facebook.com/help/112146705538576.\n\nWofford, Taylor. \"Who is Anita Sarkeesian, One of the Women at the Center of #GamerGate?\"\nNewsweek 17 Oct. 2014. Web. http://www.newsweek.com/who-anita-sarkeesian-one-\nwomen-center-gamergate-278063.\n\nCHAPTER 3\n\nWhen EleGiggle Met E-sports:\nWhy Twitch-Based E-sports Has Changed\n\nBy an MIT student\n\nE-sports is far from a new endeavor. Long before Twitch.tv was a registered domain name,\nevents like DreamHack were bringing together gamers in a quest to distinguish the best of the\nbest in live competitions. Games like Quake and Counter-Strike have been around long enough\nto have multiple generations of pro players contribute to, and make their eternal mark on, the\nscene for the next wave of serious neophytes.\n\nAlthough electronic gaming is a relatively new pastime, it still might be tempting to view it\nthrough some of the older lenses of interpreting media. For instance, Lasswell's formula of\nmedia is an old classic that might have been of merit in the early days of e-sports. Using this\nmodel the communicating party had all of the persuasion on their side, such that the recipient\nonly received influence, and never participated in an exchange so much as just absorbed what\ncame at them (Berger). When e-sports events were fledgling, and events were reserved for the\nfew that could afford to travel to them, perhaps their influence on the community could be\nviewed as unidirectional. Those with the means or the skill to attend would bring back tales of\ntriumphs and strategies from the larger LAN events. But the recent inclusion of streaming\nservices into the medium of e-sports, specifically Twitch.tv in the last four years, has\nfundamentally changed that relationship.\n\nTwitch.tv is an offshoot of Justin.tv, a streaming service opened in 2007 to allow users to\nbroadcast their lives to a waiting audience. While Justin.tv allowed the streamer freedom to\nbroadcast nearly anything, Twitch.tv is streaming service intended to cater to the broadcasting\nof games to a willing audience of viewers. Opened in 2011, and later purchased by Amazon in\n2014, the service beat out it major competitor in Own3d.tv in 2013 to become the premier\nsource of online broadcast gaming (Wikipedia). It is a service that allows any individual with the\nnetwork connection necessary to upload video and charisma, to maintain and develop a viewer\nbase and the ability to become a micro-celebrity. These days, many turn to Twitch.tv with hopes\nto make money by live streaming the video of their online or offline exploits to waiting viewers,\nand in turn become a full time streamer who can focus just on streaming and playing their\ngame. Viewers can interact with a streamer through an in-browser IRC channel complete with\ncustom emoticons and its own pervasive force of moderators and bots, and have the freedom\nto watch any live stream at any time. This environment made up of millions of active viewers\nhas proved to be a veritable cocoon that has prompted quite the metamorphosis upon the\nworld of e-sports.\n\nSpecifically, I believe that Twitch.tv has pushed the world of e-sports to be an almost exclusively\nparticipatory designed field. Meaning that an e-sports event today is much more dependent on\na symbiotic interaction between its consumers and producers because of the influences of\n\nTwitch.tv. Twitch has transformed from the earlier versions of hypodermic needle-like\ninjections of culture from producers, or the more prevalent encoder-decoder schemes of media\nthat still clearly distinguish the two sides, to a completely new paradigm. Twitch.tv has caused\nactors from every part of the process of an e-sports event, from production to viewership, to\ndirectly, explicitly trade influence and shape the execution of the event and as a result has\nchanged the industry culture even when divorced from Twitch.tv itself.\n\nTo illustrate my point, it is perhaps most appropriate to first look at the elements of Twitch.tv\nthat lend themselves to a participatory design, and how in turn these elements have directly\ninfluenced e-sports events when hosted through Twtich.tv.\n\nThe themes explored by Jenkins, Ford and Green in discussing what makes a media form\n\"spreadable\" are also applicable to what would encourage a participatory culture around a\nmedia artifact. If members are encouraged to become contributors by sharing and spreading\nthe media artifact, then they are participating in its execution. Twitch has biases for 3 of the\nelements of \"spreadable media\" built into the website and its services directly. Because of these\nbiases, viewers and other streamers of Twitch.tv are invited to participate in advertising and\nfacilitating the performance of e-sports on Twitch and in turn become part of the collection of\nactors that produce an e-sports event.\n\nFirst among these biases is Twitch.tv's promotion of diversified experiences, which is\nsummarized as providing content tailored for the niche audience that might consume it no only\nby the producer but by other consumers as well (Jenkins, Ford and Green). In essence, Twitch.tv\nis fundamentally built for the niche audience of gamers. But, the open streaming of e-sports\nmatches has permitted an even greater niche to develop within the greater gaming community.\nCasters have become a face of the e-sports community on the level of recognition of\nprofessional players themselves. These casters provide the play-by-play analysis and color\ncommentary for tournaments, and often do interviews with players and host miniature talk\nshows revolving around the professional scene and its developments.\n\nMany of these monolithic casters get their start on Twitch by taking tournaments that do not\nprovide a broadcast in their native language and re-streaming the tournament with their own\ncommentary. Take for example Dota 2's EpiCommentary, a German caster who broke into the\ne-sports scene by providing German language casts of English tournaments (EpiDota2). While\nthe practice has been restricted in the last year or so in efforts to protect the IP of tournament\nhosts, leading to many of Epi's early videos being removed, the practice has transfigured e-\nsports.\n\nIt is common now for larger e-sports events like DreamHack and StarLadder to have 3 or 4\nchannels broadcasting the same tournament in multiple languages to facilitate viewership from\naround the globe. And even now smaller tournaments often partner with fledgling casters who\ntouch different viewerships due to language or style to re-broadcasts them for greater exposure\nin exchange for the use of their footage. In this way, casters, from the neophyte to the veteran,\n\nhave been pulled into participating the production of e-sports, even when they are not directly\nhired for the events.\n\nSecond, the blurring of producer and consumer expressed as an eventual collaboration between\nroles is a natural part of Twitch.tv (Jenkins, Ford and Green). Fundamentally, Twitch allows any\nmotivated individual to become a producer by making their own gaming-related stream and\nbroadcasting their own content. But just because any consumer can become a producer does\nnot mean that they expressly collaborate, in fact there are thousands of streams that will never\nexceed 100 or so viewers. Where this freedom to move between roles can have an impact on e-\nsports is in ways that Twitch.tv encourages streamers to advertise and promote one another.\n\nA popular streamer in the Twitch.tv community is given the ability to \"host\" another streamer\nwhen they decide to end their streaming session. By \"hosting\" another streamer, one\nvoluntarily re-directs their viewers to the page of another broadcaster and has their personal\nTwitch.tv URL reflect the content of another user. For professional players and influential\ncasters who stream, it is common to \"host\" a tournament they are intending to watch, or that a\nfavorite player or caster of theirs is participating in. By doing so, the streamer fluidly transfers\nfrom producer, to consumer of a stream and also becomes an advertiser for an e-sports event,\nmoving viewers that might have otherwise floated on to another stream or another site directly\nto the e-sports online venue. This \"hosting\" mechanism is not one-dimensional either, popular\ntournaments will sometimes \"host\" up and coming professional players and casters that\ncontributed to their events, in return becoming advocates for the next set of e-sports\nparticipants.\n\nThrough this mechanism, the already blurred line between producer and consumer in the\n\"anyone can be a streamer\" market of Twitch.tv is further smudged for e-sports. E-sports\nevents are often advertised not just by the tournament itself, but also by other prominent\nstreams, sometimes even other tournaments themselves. In addition, popular professional\nplayers, casters and personalities are given a power over tournaments, if they are not chosen to\nparticipate in an event; they could easily influence the viewership of an event by starting up\ntheir own stream.\n\nIn an extension of the last two points, Twitch is a service that is built for sharing and spreading\nthe e-sports phenomenon (Jenkins, Ford and Green). Many actors participate in expanding the\nvisibility of an e-sports event by exercising their power over a viewership on Twitch, and this\npower can be wielded both positively and negatively with respect to the event.\n\nBut beyond just those influential streamers, we also have the power of the viewership itself\never represented through a scrolling chat window that accompanies every stream. Viewers of a\nstream are given the power to communicate in real time, often sharing details on the event as it\ntakes place, cheering and jeering like a real time crowd and sweeping up fledgling viewers into\nthe hype of the event. It is not uncommon for questions like \"Who won last round?\" or \"Who is\nthat player?\" to be answered not by casters or event staff on moderation duty, but by other\nviewers engaged in the event. When particularly large e-sports events occur, the results often\n\nspill outwards into other streams across the site, the echo of the winning team or a big play may\nmake waves in chats for other games and streamers for weeks after the event has played out.\n\nAnd when the event is over, Twitch provides video archives of events and allows producers to\nexport their events to services like YouTube to allow repeated or belated viewing of the event.\nExternal communities of fans on sites like Reddit and TeamLiquid often share links to the\narchived videos from Twitch.tv of popular e-sports events for those that could not watch live,\nand create survival guides for new viewers to reference explaining when and where to watch\nthe games, as well as what supplementary material will enrich the experience (0Hellspawn0).\n\nIt is unfair, however, to say that the viewership only contributes meaningful content to an e-\nsports event because of Twitch.tv. For every insightful comment and answered question\nspawned in a Twitch chat, there can be thousands of indistinguishable spam messages and\nmemes. The influence of these messages can be far reaching, as there are sites dedicated to\ncataloging and archiving these spam artifacts, and numerous bots and auto moderators\ndesigned to curb the ever-encroaching tide of spam messages. However, even these seemingly\nuseless spam messages contribute to the participatory culture being impressed upon e-sports\nby Twitch.\n\nIn his book, Spam: A Shadow History of the Internet, Brunton repeatedly contests that the\nefforts made by users on the Internet to combat spam is an integral part of shaping the\nlandscape of the Internet in the modern age (Brunton). Similarly, all the moderators and bots\nthat e-sports streams use to try to police their chats have shaped e-sports and other events\nhosted through Twitch.tv in return. Because some forms of spam, like reactionary emotes to\nbig plays and comical chants in reference to players, are permitted while other actions get bans,\nthe viewership of a stream is constantly fighting with moderation to see what is permissible.\nThe production staff of an event is ever reacting to their audience, balancing between what they\nsee as meaningful jeers and cheers within the \"venue\" of a Twitch.tv e-sports event that lies\nwithin the chat window to the right of the broadcast and risking losing viewers by banning too\nmany jests and jeers and having their stream be deemed unfit for viewer contribution. If the\nchat is the body of Twitch-based e-sports then spam are the invasive bacterial, important to\ngrowing a healthy immune system, but dangerous in excess.\n\nThus, even when the chat for a major event is flying by with multiple deleted messages and\nreaction emotes weaved between discussions and questions, every viewer that types a line is\nstill contributing. Like the crowd at a normal professional sporting event, every voice\nrepresented in chat makes up the tapestry of background noise that makes the experience\nunique. It would not be a home game if the fans did not jeer the visiting team, and it is not an\ne-sports event if the viewers are not fighting the moderators and criticizing the players too.\n\nI want to emphasize that it really is viewers contributing to e-sports because of Twitch.tv,\nbeyond just forcing moderators to react to the cries of the masses or being helpful to other\nfans. When T.L Taylor discussed the assemblage of play, she mentioned a range of contributing\nactors from the system itself and its affordances (discussed above) to the community around\n\nthe game itself (Taylor). Twitch might have all the affordances necessary to force participatory\ndesigns onto e-sports, but it means nothing if the community does not contribute directly to the\nevents themselves through Twitch.\n\nTo make a long story short, they have. For example, in Dota 2 when a player pauses a\nprofessional game in the tensest of scenarios, it's a \"Puppey Pause\" - named after professional\nDota 2 player Puppey, after the chat began spamming \"Puppey Pause\" during a particularly\noffensive stoppage time that changed the course of a nail-biting match (joinDota). Since then,\nevery caster in the professional scene knows that term birthed from a Twitch chat, it is even\nsometimes jokingly used in other games due to its popularity. Other neologisms from chat\ninclude many of the names for locations in Counter Strike maps, often reflexively named after\nplayers who had moments of glory or failure around those locations that followed them in fame\nor infamy through memes created by chat participants. Chat acts like a Grecian chorus,\nreflecting the action that takes place during an event and often spawning cultural artifacts out\nof this repetition and tomfoolery (Encyclopedia Britannica).\n\nBut viewers and Twitch do not only create neologisms for e-sports, they uplift players and teams\ninto the scene itself. Recently, one major Dota 2 tournament decided to have a fan vote for the\nlast qualifying position in their LAN event, which prompted many professional players to speak\nout on social media, popular forums and even their own streams about their preferred team to\nreceive the final coveted spot. Before that, smaller tournaments would often send their invites\nto well recognized teams with rosters including popular players in hopes of securing more\nviewership to ensure profitability. And when a player is given the power to re-direct their\nviewership towards and e-sports even through hosting the best measure of recognition for\nevent hosts is Twitch.tv viewership that can become viewers for their events.\n\nIn many ways, a professional player, a commentator, a micro-celebrity in e-sports becomes\nknown for their interactions through social mediums, and foremost among those is often the\nstream. The ability in live time for jokes and memes to take place there, exchanges with the\ncommunity to be facilitated there and their handle to spread to viewers far and wide is massive.\nMirroring the avatars of popular MMOs, for an e-sports professional, a Twitch stream could be\nlikened to their embodied form on the Internet (Taylor, Living Digitally: Embodiment in Virtual\nWorlds). A player or a caster can be slingshotted into fame and recognition by the size of their\nviewership. Moreover, E-sports is forced to respond to them because, as mentioned before,\nthey can influence those same viewers' decisions to participate in an event as well.\n\nI can vouch for this personally as well. A very good friend of mine goes by the Twitch name\nBananaSlamJamma (Twitch.tv/bananaslamjamma). At his behest, I helped him craft a media\npersona around the game of Dota 2, wherein he was recognized as a good player upon winning\na premier in-house league. By interacting with an audience through streaming and navigating\nthat terrain effectively, he was able to secure himself a spot on an up-and-coming North\nAmerican Dota 2 team, and recently played in one LAN event and might even be able to\ncompete for the biggest prize in Dota 2 history (Strom). Twitch.tv enabled him to participate in\n\nthe big e-sports dance himself, by re-shaping e-sports into a media where many factors and\nmany actors contribute to the production of every event.\n\nAll this is well and good if one believes it. Twitch as I depicted it is certainly a force for\nparticipatory design. As one might expect of a platform in the vein of YouTube, where anyone\ncan be a contributor, much of the way the service is designed and the effects on its streamers\nforces participation. But saying that Twitch.tv encourages a participatory design for the events\ncreated through it says little about why it is affecting e-sports as a whole. After all e-sports has\nbeen around far longer than Twitch.tv has, and many events are not hosted through Twitch.tv\nservices. To address this, I will focus on why for e-sports the affects it has had on the e-sports\nevents that have subscribed to Twitch.tv has had a rippling effect on the industry as a whole.\n\nThe less extreme of two options would be to address using Twitch.tv as a service without selling\nyour service out to a participatory design. Considering for now that this is a possible avenue of\naction, imagine if one could host a stream on Twitch.tv without interacting with the viewership\nat all. In essence a completely automated streaming environment.\n\nThere was a popular project that did almost just this, it was known as Twitch Plays Pokemon\n(Twitch Plays Pokemon). A user made a stream where in the chat controlled an emulator\nthrough inputting commands in plain text, and its creator could summarize his interaction with\nthe audience as turning the stream on initially and keeping the server running. Its very close to\nthe concept of a \"Design from Nowhere\", an anonymous design freed from biases or\nimplications, which would be what you would need to really enact a one-way transfer of design\nfrom the producer to the consumer (Suchman). It gained a massive wave of interest as a purely\nchat-centric experience; an event where in the producer had embedded his message into the\nvery code of the system and then left the viewers to experience it. Plenty of imitators emerged,\nwith similar streams built around other gimmicks and titles like \"Fish Plays Pokemon\" or \"Fish\nPlays Street Fighter\". The approach seemed feasible at this point, a producer had gained the\nattention of consumers without ever reacting to them, and instead being content letting them\ncontrol a bot in a chat while he raked in viewership.\n\nThis story was not meant to last however, as his system had flaws, like any code it was injected\nwith his biases and chat was quick to acknowledge this and cry out for change. In the evolution\nof Twitch Plays Pokemon, the creator of the system was quickly drawn into a debate between\nthe viewers of the stream facilitated by other external forums and through images posted as\nlinks into the chat. The debate can be summarized as a choice between allowing voting to\ninfluence the game on stream, or sticking to the original system of random choice of read\ncommand from the deluge of chat message, a choice between democracy and anarchy. The\ncommunity had acknowledged what was being forced upon them and had begun to push back\nto try to influence the producer to change the system for their benefit. At this moment, the\ngame on stream was stuck in a portion of the game that required a long sequence of very\nspecific button presses, an even that would be almost impossible with the current system\nlimitations. The viewership of the stream was waning in response to the seemingly impossible\ntask, and the novelty of the stream was wearing thin, so the producer was forced into a choice.\n\nEither give in to the participatory culture by acknowledging the community and modifying the\nsystem, or stand firm in the one-way transfer of content and risk losing the influence given by\nviewership itself.\n\nE-sports is usually given a similar catch-22 when attempting to participate in Twitch.tv without\nresponding to the viewership. If one tries to host a tournament without participating in the\nculture of Twitch itself - using the memes they have made, promoting some form of chat,\nproviding emoticons for subscribing viewers and encouraging subscription through various\nmeans and perks - then one risks losing viewership by not conforming to the understood\nelements of success through Twitch.tv. Because this participatory culture is accepted in much\nof the rest of Twitch.tv, it is expected when one participates in a new stream, and the backlash\nto being denied contributions due to chat bans or a lack of viewer incentives is often a loss of a\nviewer.\n\nSo, if an event hosted through Twitch.tv must bow to Twitch.tv viewers' expectations of\nparticipation why then, can e-sports not just avoid Twitch.tv in general? If it is accepted that it\nis nearly impossible to participate successfully in Twitch without ceding some of your event or\nstream design to the masses, then just avoid the service all together. After all for a system to be\nparticipatory designed, the designers themselves must make the first secession to actually use\nthe participatory system (Lowgren and Stolterman).\n\nThat is definitely an option, as Twitch.tv was not always the only major streaming service\navailable, and it certainly is not the only one accessible now. But, I contest that even managing\nto avoid Twitch.tv does not free an e-sports even from the influence of Twitch.tv and the shift in\ne-sports to a participatory design. That is to say that the damage has already been done to the\ndesign of an e-sports event, such that if Twitch.tv were to cease to exist tomorrow, e-sports\nwould still be forever changed.\n\nFor my example, I will take the e-sport of Dota 2 that I have discussed up to this point. In its\ninfancy, Dota 2 was thrust into the e-sports scene with a million dollar tournament hosted by\nValve during Gamescom in 2011. Such an event was almost unprecedented; e-sports\ntournaments did not usually offer that much of a prize for winners, and it quickly drew the\nattention of many e-sports journalists (Sullivan). Yet now, if you look at the highest paid e-\nsports players 17 of the top 20 come from Dota 2, with each new year of tournaments creating\neven more highly paid e-sports stars (E-Sports Earnings). So, where did all that money come\nfrom? The answer is the viewers themselves, as Valve embraced the concept of incentivizing\nviewership of tournaments in conjunction with Twitch.tv as a service. They turned viewer\nparticipation into viewer contribution to the prize pool for tournaments, and thus let people\nvote with more than just their attention to a stream, they voted with their wallets.\n\nValve released an in-game ticketing service for Dota 2, which allowed a viewer interested in a\ntournament to purchase a ticket which would increase the prize pool of a tournament by some\npercentage of the sale in exchange for allowing the viewer to watch the game through a linked\nTwitch account with the added bonus of potentially receiving an in-game prize during the\n\nmatches. This meant that a viewer could now directly support the tournaments that they\npreferred to watch with monetary investment in the event, in exchange for the potential of\nobtaining in-game prizes associated with that tournament and the players participating in it. It\nencouraged tournaments to secure popular players and casters who would in turn produce\nmore profitable items for viewers, and it encouraged viewers to directly support tournaments\nto gamble at striking it big with autographed items.\n\nThe system has been revised multiple times since then. Now popular artists often provide\nfurther in-game incentives in the form of cosmetic items that come bundled with tickets. These\nartists sometimes use Twitch.tv to stream the creation of their cosmetic items for further\nexposure, broadcasting the tournament that the final item will be affiliated with in the process.\nThis has caused this new division of popular artists to gain their own footing in influencing and\nparticipating in the generation of an e-sports event by manipulating their own band of followers\nof their cosmetic items (Khaw).\n\nOther games have followed suit in different manners. While not ever game offers the linked\ncosmetics through viewership, it is common for tournaments to reward viewers with incentives\nfor viewing and contributing to crowd funded tournaments. Raffles for in-game items,\nKickstarter rewards for backers and custom emoticons for subscribers who pay for perks on\nTwitch.tv to increase the prize pool of tournaments or facilitate more events are all now\ncommon occurrences (Beyond The Summit). What this means is that e-sports events are quickly\ngrowing in prize pool and reach by relying on participation from a dedicated viewership. To\nforsake that viewership is to lose that additional funding and thus lose prize pool and influence\nfor your tournament.\n\nThere are many criticisms of this design in Dota 2, and its adoption in tournaments, but its\nexistence is undeniable. It has made the ever-competitive realm of securing sponsorship and\nteams for an e-sports tournament even harder, as the expectations grow with the size of the\nprize-pools, to try to subvert the participatory design emergent from Twitch is to take a path of\ngreater resistance. Let alone trying to privately fund a multi-million dollar tournament like The\nInternational is now, without relying on the contribution of viewers and other members of the\ncommunity (Valve Corporation).\n\nThe take away from all of this I hope is clear; Twitch.tv has pushed e-sports into a participatory\nmodel as a result of depending on the service for so long. Its hard now to see a tournament\nsucceed without facilitating or employing crowd funding, offering a raffle, having a fantasy\nleague, a bundled set of community created cosmetics or at the very least having an\naccompanying chat full of rowdy viewers and careful mods interacting with the commentators\nand the event itself. I think that what Leigh Star says about formal systems like what has settled\nin for e-sports is true, there is definitely a great value in the tournaments and events in e-sports\nthat have managed to avoid the system and biases that come with participatory e-sports, but\nthey are few and far between (Star). It is difficult to envision them because they are not\nprevalent in the community, they are not re-broadcast by fledgling casters looking to make a\nmark, or re-posted in forums by contributing community members looking to flaunt their\n\ninfluence; they rely only on the voice that they construct to represent them, and thus lag behind\nthe ever surging monster of fan and community driven representation and re-appropriation.\nFor every other e-sports event that exists right now, it is broadcast on Twitch, or a service that\nseeks to mimic it, and thus it plays by these rules of participant design and contribution. Rules\nthat as paraphrased from Xangold, staff programmer for Twitch.tv and creator of the first major\nchat bot xanbot, go as follows.\n\nYou want more viewers on Twitch? Be constantly talking to and with your viewers, watch other\nstreams and take notes, partner up with popular people and mutually advertise each other\n(Xangold). To be successful Twitch.tv the expectation is simple, you need to buy into a\nparticipatory design for your content, and E-sports has been widely successful by exploiting and\nemploying everything Twitch.tv has to offer.\n\nReferences\n\n0Hellspawn0. 2015 Red Bull Battle Grounds Playoffs and Finals Survival Guide. 10 May 2015. 10\nMay 2015\n<http://www.reddit.com/r/DotA2/comments/34vydr/2015_red_bull_battle_grounds_pla\nyoffs_and_finals/>.\n\nBerger, Arthur Asa. Essentials of Mass Communication Theory. San Francisco: SAGE Publications,\nInc, 1995.\n\nBeyond The Summit. BEYOND THE SUMMIT - ESPORTS STUDIO. 10 March 2013. 10 May 2015\n<https://www.indiegogo.com/projects/beyond-the-summit-esports-studio>.\n\nBrunton, Finn. Spam: A Shadow History of the Internet. Cambridge: MIT Press, 2013.\nEncyclopedia Britannica. Chorus. 10 May 2015. 10 May 2015\n<http://www.britannica.com/EBchecked/topic/114599/chorus>.\n\nEpiDota2. EpiCommentary VoDs. 1 November 2014. 10 May 2015\n<https://www.youtube.com/user/EpiDota2/videos>.\n\nE-Sports Earnings. Highest Overall Earnings. 10 May 2015. 10 May 2015\n<http://www.esportsearnings.com/players>.\n\nJenkins, Henry, Sam Ford and Joshua Green. \"Conclusion.\" Jenkins, Henry, Sam Ford and Joshua\nGreen. Spreadable Media. Creating Value and Meaning in a Neworked Culture. New York:\nUniversity Press, 2013. 291-305.\n\njoinDota. Puppey pause? December 2014. 10 May 2015\n<http://www.joindota.com/en/forums/701-competitive-dota/705-teams-and-\nplayers/222725-puppey-pause>.\n\nKhaw, Cassandra. Meet the item creators: pro and self-taught artists making millions from Dota\n2. 28 June 2013. 10 May 2015 <http://www.pcgamer.com/dnp-meet-the-dota-2-item-\ncreators/#page-3>.\n\nLowgren, Jonas and Erik Stolterman. Thoughtful Interaction Design. Cambridge: MIT Press, 2004.\n\nStar, Susan Leigh. Ecologies of Knowledge: Work and Politics in Science and Technology. Albany:\nSUNY Press, 1995.\n\nStrom, Steven. Champions of Summer's Rift: A Product of NA Dota. 4 May 2015. 10 May 2015\n<http://www.redbull.com/us/en/esports/stories/1331721005452/champions-of-summer-\ns-rift-a-product-of-na-dota>.\nSuchman, Lucy. \"Located Accountabilities in Technology.\" Computer-Supported Cooperative\nWork 2 (1994): 21-39.\n\nSullivan, Lucas. Valve to hold $1,000,000 Dota 2 tournament at Gamescom. 31 July 2011. 10\nMay 2015 <http://www.pcgamer.com/valve-to-hold-1000000-dota-2-tournament-at-\ngamescom/>.\n\nTaylor, T. L. \"Living Digitally: Embodiment in Virtual Worlds.\" Shroeder, R. The Social Life of\nAvatars: Presence and Interaction in Shared Virtual Environments. London: Springer-\nVerlag, 2002.\n\nTaylor, T. L. \"The Assemblage of Play.\" Games and Culture 4.4 (2009): 331-339.\n\nTwitch Plays Pokemon. Twitch Plays Pokemon. 10 May 2015. 10 May 2015\n<http://www.twitch.tv/twitchplayspokemon>.\n\nValve Corporation. Dota 2 The International. 10 May 2015. 10 May 2015\n<http://www.dota2.com/international/compendium/>.\n\nWikipedia. Twitch.tv. 10 May 2015. 10 May 2015 <http://en.wikipedia.org/wiki/Twitch.tv>.\n\nXangold. How to get more viewers on Twitch? 28 January 2013. 10 May 2015\n<http://help.twitch.tv/customer/portal/questions/769282-how-to-get-more-viewers-on-\ntwitch->.\n\nCHAPTER 4\n\nNEGOTIATING IDEOLOGIES IN E-SPORTS :\nTHE GOOD, THE BAD, AND THE RISKY IN FOLLOWING IN THE\nFOOTSTEPS OF PROFESSIONAL PHYSICAL SPORTS\n\nBy Ryan Alexander\n\nLess than ten years ago, the term eSports would have meant nothing to most people. The idea\nof a professional video game player would have seemed laughable or downright paradoxical.\nBut today, organized professional video game competitions, collectively referred to as eSports,\nare incredibly popular. Millions of people watch international tournaments in games like League\nof Legends, Dota 2, Counter-Strike, Halo and Call of Duty. The prize pools for those tournaments\nare also now in the millions (E-Sports Earnings). Viewers cheer on their favorite professional\nplayers, bet on games, and even take part in fantasy team events. Professional players have\nbecome celebrities to them and fans will flock to live streaming sites, most often Twitch.tv, to\nwatch players play casual games with friends on a daily basis. In fact, Twitch reports that more\nthan 100 million viewers a month on average tune in to watch everything from casual games to\nlivestreamed tournament games (Twitch). Companies like Redbull, SteelSeries, Gigabyte, Asus,\nSamsung, Kingston, Coca-Cola, and Logitech are all scrambling to sponsor events, individual\nplayers, and teams.\n\nClearly, the eSports scene is not the same as it was just a few years ago. One cannot help but\ndraw parallels to professional physical sports leagues such as the NFL or the NBA. Those leagues\nare obviously very successful and while the rapid changes that have been made in the eSports\nscene have clearly attracted more viewers and garnered financial benefits, such rapid growth\ncan have consequences. E-Sports has been around long before the multi-million dollar\ntournaments and corporate sponsorships. There is a culture associated with competitive video\ngame playing that has slowly been degraded in favor of pursuing the same trajectory that\nprofessional physical sports have taken - namely, an emphasis on media attention and monetary\nbenefits. Which this ideology is not inherently harmful to eSports, sacrificing the culture of its\norigins to adopt cultural aspects of other spaces in the hopes of mimicking their success is a\nrisky move and might end up hurting eSports in the long run.\n\nThere are two major cultural aspects of competitive gaming that I fear will be abandoned if the\nscene continues to mimic professional physical sports. The first is the idea that gaming\ntournaments prioritize the competition over the media potential. If the focus of eSports shifts to\nthe media and monetary centric foci that physical sports have, the integrity of the competition\nmay no longer be maintained. The second cultural aspect that I believe is at risk is very nature of\nwhat a professional player is. In order to be recognized as a professional gamer, one previously\nonly needed to demonstrate sufficient skill, but now the media attention a player can provide is\nso highly valued, recognition within the community might overshadow skill as the primary asset\nof a professional player.\n\nAttending a professional football game is an electrifying experience. As you approach the\nstadium surrounded by thousands of fans, the loudspeakers pumping out music, the smell of\nhot dogs in the air, you can't help but get swept away in the experience. You're there to watch\nthe game, to witness the athletic competition that is about to take place. It somehow feels so\nmuch more authentic than watching the pre-game show on TV. On television, there are\nadvertisements cutting into coverage, logos are constantly being shown on screen, and you are\nconstantly reminded that the halftime show will be brought to you by Subway and that\nGoodyear is bringing you the overhead view from a blimp floating high above the crowds. Game\nday for the millions of viewers who tune in from home every weekend is not just about the\nathletic competition. Instead, the \"hypercommodification\" of these physical sports have\nrendered games into massive media spectacles (Giulianotti). Viewers get to enjoy flying camera\nshots and impossibly close images from the field in exchange for being reminded every few\nminutes about just how good Coors Light is when it's cold. They get to watch famous analysts\ndiscuss the game's finer points and watch the pre-taped interviews with their favorite players,\ncommitting to watching the 4 hour show that will only contain an hour of actual football. As\nsoon as the leagues were created, NFL, NBA, NHL, etc., this has been the norm for professional\nphysical sports. These leagues require the players to be present for a certain number of press\nevents and mandate that teams must produce a certain amount of content for their fans\n(Florio). The yearly football championship, the Super Bowl, is the most heavily aggrandized.\nAdvertisements during the Super Bowl are incredibly sought after despite the multimillion dollar\nprice tag for a few seconds of air time. Before the game day, the NFL requires that all players\nmust be present for interviews with the press for an entire day (Florio). You would think that the\nfew days leading up to the Super Bowl would be completely focused on training for the players,\nbut the press day is absolutely mandatory. Most players are not pleased with the requirement,\nexemplified by Seattle Seahawks player Marshawn Lynch's infamous interview before the last\nSuper Bowl during which he only answered \"I'm just here so I don't get fined.\" to every\nquestion. Even the traditions after winning the Super Bowl have been commercialized. The\ntraditional question asked to the victors is \"Now that you've won the Super Bowl, what are you\ngoing to do next?\" and the response is always \"We're going to Disney World!\" All the media\nattention is not necessarily harmful to the game, and it definitely allows more people to be a\npart of the sport. However, it is abundantly clear that the main purpose for the league is to\nmake a profit, not to host a competition.\n\nThere are very few people who remember football before the NFL took over back in the early\n1900s and before the league, there was not much of a culture beyond the rules and traditions of\nthe game itself. This is not the case when it comes to eSports. Because eSports began a\nrelatively short time ago and because it has grown so quickly, a great deal of eSports fans\nremember the early DreamHack and Evo events. These events were not media spectacles by\nany means, even after the technology for livestreaming became available. They were\nopportunities to surround yourself with likeminded individuals who enjoyed playing the same\ngames as you (Taylor). The competitions at these events were open to everyone and if you were\ngood enough, you could move through the bracket and reach the finals. Nothing else was\n\nrequired. You could be a totally new player with no friends and still be eligible to play at the\nhighest levels. At these events, the only relevant factor was your skill level.\n\nHowever, in the last five years, studios and companies have swooped in to invest in these\nevents. Simple halls filled with gamers were replaced with well decorated arenas, full of banner\nadvertisements, loud music, and lots of food and drinks. The exciting atmosphere and shared\ninterest in gaming remained, but the experience was much more refined and a lot of the\nchanges were gladly welcomed. Walking into Dreamhack and walking into football stadium on a\ngame day were suddenly not so different. Attendance spiked and studios began to livestream\nthe entire event for all those could not make it. Every year, the events moved to larger halls and\nthis year the ESL One tournament was actually held in a soccer stadium in Germany (ESLOne).\nThe International, the Dota 2 yearly championship, had to move from a concert hall to a full\nsized arena in order to accommodate all those who wanted to watch the event in person and\ntickets still sold out in minutes (Pereira). The production value of the live streams skyrocketed\nand we began seeing the same visual effects, instant replays, and multi-language casting that\npreviously had only existed in the sphere of physical sports.\n\nNow, most of these changes were quite beneficial. The competitions were being streamed to\nhundreds of thousands of viewers, prize pools increased exponentially providing incentive for\nthe now well-known teams around the world to come and play, and the in person experience\nwas generally improved. But the cost for all these improvements was the transformation from a\ncompetition centric event to a media centric one. The space of eSports can no longer be limited\nto the pursuit of glory through gameplay. The requirements of capitalist pursuits have been\nallowed to impress themselves upon the space of play (Crawford). Now that the companies and\norganizers had spent a good deal of money improving the event, they needed to be able to turn\na profit. Tournament organizers began pressuring professional players to spend a certain\namount of time at photo shoots, meeting fans in person, and sitting for interviews (Valve, The\nInternational Event) (Redbull). These media events often take place a few days before the\ncompetition kicks off, striking a remarkable resemblance to the Super Bowl presser mandates.\nThe shift in focus away from the competition itself and towards management of the media\nevent is a high price to pay for the comforts of financial support. The underlying principle that\nanyone could participate as long as they were skilled enough has been eroded by the mandate\nthat the professional players should be media objects themselves. After all, a well-known player\nwho is adored by the community is much more profitable than someone no one knows,\nregardless of skill. Event organizers now focus solely on getting established teams to participate.\nAmateur tournaments are kept entirely separate and often are not even streamed (joinDota,\nAmateur Event Rules). It is no longer possible to show up at Dreamhack with only your\ncomputer and participate in the main tournament. In a few short years, eSports events have\nabandoned elements of their culture in exchange for pomp and circumstance and as a result,\nhave lost some of what makes eSports unique. While the number of fans who became\ndisillusioned as a result of these changes are far less than the massive influx of new fans, as time\npasses and the viewership stabilizes, we could see more and more people leaving the scene\nevery year and these issues would eventually have to be addressed.\n\nAlong with abandoning some of their founding principles, these new media-centric eSports\nevents have also begun to sacrifice the integrity of their competitions. Ideally, championship\nevents would extend invitations to the teams that are currently performing exceedingly well\nbecause the goal of a championship tournament is to determine who the best team is currently.\nBut the best teams are not necessarily the most popular and thus are not the most profitable.\nFurthermore, in order to incentivize viewers from around the world to watch these\ntournaments most event organizers will invite teams from every region in order to promote\ndiversity and to prevent any one region from feeling alienated. Therefore, the teams that end\nup participating in these competitions may not even be the top teams, but that is preferable\nbecause they will be the most profitable teams. This change has not been welcomed by the\ncommunity and this year's International Dota 2 championship invitations drew a lot of criticism\nfor inviting last year's winners to return, despite their extremely lackluster performance as of\nlate and for inviting a popular team from South East Asia that did not demonstrate the roster\nstability that is supposedly required (Noxville).\n\nThe League of Legends championships (LCS) are not any better as Riot, the creators of League of\nLegends (LoL), requires all eligible professional team be part of their league, which means all\nchampionships will only consist of existing teams that have been around for a certain period of\ntime. Riot approved teams have to adhere to strict rules that severely limit roster changes, so it\nis also difficult to enter the league as a brand new player (Riot, LCS Official Rules). Of course, as\nin the other cases we have discussed, there is a tradeoff. Professional LoL players are paid a\nguaranteed salary by Riot and can focus entirely on playing even if their team does not have the\nmost generous sponsors. This model of an inter-league championship whose victors are\nunilaterally declared the best team in the world, ignoring the potential for outside challengers,\nis same model that the NFL follows. However, at least it is unlikely that a player who never\nplayed in college or plays in the minor leagues can become good enough to play football at the\nprofessional level. Getting to the professional level in a video game by yourself is not\nuncommon, but Riot makes it very difficult for new players to enter the scene.\n\nValve, the creators of Dota 2, are a bit more flexible in this area because they do not require\nprofessional Dota 2 players to be in a league. The tradeoff here is that Valve does not directly\npay professional players any form of salary. But just because there are no formal restrictions to\nnew players entering the pro scene does not mean there aren't any barriers to entry in practice.\nAs mentioned previously, professional players are now pressured into becoming media icons.\nThe notion of \"strategic self-presentation\" in order to become a \"micro-celebrity\" has become a\npertinent job skill in this field (Boyd). Similar to computer scientists maintaining a sample of\ntheir work on a GitHub page or graphic designers keeping a portfolio of their designs,\nprofessional eSports players curate a presence within the community via social media and\nthrough their Twitch streams. After all, just like in any professional field, your past work helps\nyou land a new job. When the time comes for a player to leave a team it's not only their skills,\nbut their relevance within the scene that helps them find a new team. When eSports players\nretire, if the community already respects them and is aware of their experience and knowledge,\nthey can transition into becoming full time casters or analysis as two long time players, Maelk\nand SyndererN, have done. As a result of this new emphasis on becoming a media asset and a\n\nmicro-celebrity, players who are seeking to break into the professional scene now find it almost\nnecessary to establish a stream and gain recognition within the community in order to get\nnoticed by existing teams.\n\nJust a few years ago, even after the focus of eSports switch to a more media centric approach,\nthis was not a requirement. For instance, there was a player who went by the name of\nAdmiralBulldog. Bulldog was not a professional player, but was very talented. When\nprofessional players would play regular matchmaking games for practice, they would often get\nmatched with him and over time got to know who he was. One of the professional players that\nwas impressed by Bulldog was Dendi, star of Na'Vi, the Ukrainian Dota team that won the very\nfirst International. Na'Vi was playing in a tournament and one of their players couldn't make the\ngame, so Dendi had Bulldog play as a stand in (Na'Vi.Dota2). Bulldog performed extremely well\nin his first professional game and eventually got picked up by another Dota team, [A]lliance. A\nyear later, they won the third International tournament, winning 2.8 million dollars. Bulldog,\nwho a year ago, was just a casual player, became known as one of the best players in his\nposition and instantly gained a large following within the community. This Cinderella story\nespouses the same ideals that early eSports culture was all about. Sadly, these stories are, for\nthe most part, resigned to the history books. For one thing, stand in players are now heavily\ndiscouraged in professional games in an effort to enforce the same roster stability that all\nphysical sports teams have (joinDota, Professional Event Rules). Secondly, demonstrating a high\nlevel of skill at the game is no longer enough for professional teams to take on a new player.\nBecause teams are not salaried, they need corporate sponsors in order to fund their careers.\nThese sponsors prefer to back teams that can win games, but even more valuable than these\nplayers' skill is their clout. If they back popular players, they will be able to directly advertise to\nall those players' fans. Therefore, teams look to pick up players that have demonstrated both a\nhigh level of skill and have shown that they can be valuable media assets. For example, Redbull\nsponsors a player known as DeMoN, who until recently, wasn't even on a team. He was just a\npopular figure in the community and thus it made sense to sponsor him, even if he wasn't\nactively playing in the professional scene (Smith).\n\nOne of my friends is currently a professional Dota 2 player (who is actually on the same team as\nDeMoN) by the name of BananaSlamJamma, or BSJ for short. Just like Bulldog, BSJ was a very\nhighly ranked player and frequently played with professional players. He spent months trying to\nget on a team, but was unable to find anyone willing to take him on. So with help from a few of\nhis friends and myself, BSJ created a Twitch account (http://www.twitch.tv/bananaslamjamma)\nand began to stream his gameplay. He would provide in depth commentary on his actions in-\ngame and established his role in the community as an instructor. Players came to his stream not\nnecessarily to laugh or to be dazzled by high level play, but to learn. He filled a niche in the\ncommunity and as a result, his stream became fairly popular. Unsurprisingly, a few weeks after\nproving his value as a media object, BSJ was picked up by a professional team.\n\nThe divide between a professional eSportsman and a normal player is getting larger as the\ncommunity comes to expect a certain semi-distinguished, media friendly behavior from the\nprofessional players (Mora). Given the incredibly vast divide between professional physical\n\nsports players and fans, this trend makes sense. While there are many obvious benefits to\nadopting artifacts from physical sports culture, the fact that eSports will have to sacrifice its core\ntenant of inclusiveness is worrisome. If barriers to entry into the professional sphere continue\nto be raised, the eSports scene will soon stagnate and fresh talent will be hard to find,\nregardless of how much production value goes into the streams or how much gourmet food the\nevents offer.\n\nOf course, some eSports events are successfully negotiating the requirements of taking a media-\ncentric approach while maintaining the original competitive and inclusive culture of competitive\ngaming. This year's International, although not without its issues, has included the opportunity\nfor open qualifiers. The qualifiers allow any team of five players to enter in a massive bracketed\ntournament. The team that wins will compete in the qualifiers with professional teams and if\nthey can win there, they will earn a trip to the International (Face-It, Open Qualifiers). Of course,\nno one really expects the open qualifier winners to even make it to the main event, much less\nperform well there, but the point is that it is a possibility. Riot has also introduced the LCS\nChallenger Series which allows the top 20 teams from regular matchmaking to compete with\nthe winner advancing to the LCS tournament (Riot, Challenger Series). As long as you give\nplayers a chance to prove themselves, to bypass all the media requirements and compete solely\non the basis of their skills, you are keeping the original spirit of competitive gaming alive.\n\nIt is also important to note that the open qualifiers for this year's International are being held by\nthird party studios that have demonstrated an ability to provide coverage for previous\ntournaments. Valve could not possibly coordinate all of the open qualifier games while ensuring\nthat all games were played fairly. However, the studios, FaceIt and PerfectWorld, have already\ninvested so much into the eSports scene that they have the automated tools and personnel\nneeded to run such a large tournament (Face-It, How it Works). Furthermore, by broadcasting\nthese games on Twitch, they can continue to generate profit. Essentially then, we have a studio\nwho thrives on the new media-centric eSports model sponsoring an open qualifier that\nespouses the values of the old competition-centric model illustrating that it is indeed possible to\nprioritize one approach without completely disregarding the other as long as a few extra\nmeasures are taken.\n\nIn the same vein, there are teams that recognize talent and will pick players up regardless of\nwhether or not they've proven to be capable of being a popular icon or not. It no longer\nhappens often, but there are a few examples of this occurring quite recently. A few months ago,\nthe American Dota team Evil Geniuses (EG) picked up a 15 year old Pakistani player by the name\nof Suma1L. Shortly afterwards, the team went to China and won an event there, earning a little\nover 1.2 million dollars (Valve, DAC Results). Suma1L's story is even more dramatic than\nAdmiralBulldog's and it occurred well after teams began focusing on acquiring media-ready\nplayers, illustrating that it is not impossible to transition from gamer to an eSportsman in a short\nperiod of time. However, a lot of stars had to align in order for Suma1L to get his break. EG had\njust lost their mid player (the position that Suma1L plays) and needed to fill the slot quickly due\nto upcoming the Chinese tournament. Using a stand in player from another team was not a\npossibility since virtually every team would be attending the same tournament. So EG tuned to\n\nthe leaderboards and played with a few of the top ranked mid players before settling on\nSuma1L. Fortunately for EG, one of their players, Fear, is extremely experienced and can\nactually play any role in the game. This additional flexibility allowed them to alter their playstyle\nto complement Suma1L's (GosuGamers). So to reiterate, the original idea that any gamer can\nbecome a professional is still alive in the current eSports scene, but it is not thriving. Still, it\nproves that the changes the scene has undergone have not entirely destroyed its original\nculture and that is possible to blend the two ideologies.\n\nUntil now, we have kept our discussion focused on the players, the teams, and the sponsors but\nwe haven't talked about the shout casters and what effect the changes in the eSports scene\nhave had on spectatorship. In the earliest days of competitive gaming, the audience simply\nwatched the players play. Shoutcasting began quite naturally when a few experienced players\ngrabbed microphones and began discussing the game. As the competitive scene grew, shout\ncasters became a permanent fixture. However, since their role is to \"shape the viewing\nexperience of other spectators by providing a running commentary\" and to improve the\nviewers' experience of watching professional gameplay, as eSports began to mimic physical\nsports, the quality of the casts improved dramatically (Cheung). Previously, the only\nrequirements for casting were that you were actually capable of speaking and you knew enough\nabout the game to make intelligent comments. Now, with the focus on production value and\nappeal, casters have not only be capable and intelligent, they have to be humorous, personable,\nand have to be able to keep a chat with hundreds of thousands of viewers entertained even\nthrough pauses in gameplay or during slow paced games. The scene also has a lot more casters\nin general. This is particularly helpful when tournaments overlap. In fact, since the media-centric\nchanges have taken effect, there has not been a single major professional game that was unable\nto be casted due to a lack of available casters. Furthermore, most games are casted in multiple\nlanguages, most often English, Chinese, and Russian. At the International, along with all the\nvarious language casts, there was also a cast specifically for those who were unfamiliar with the\ngame (McWhertor). One the biggest problems with bringing in non-players to watch eSports is\nthat it can be extremely confusing to watch. With the addition of a caster who purposefully\nexplains what is happening to those who are completely new, a lot more viewers may retain\ninterest in the game. In this regard, the shift in eSports has actually improved casting and\nspectatorship with no real negative repercussions. Again, this is unsurprising given that the\ncasters are inspired by the announcers who cast professional physical sports who have virtually\nperfected the art.\n\nThe evolution of eSports is quite complex. This is not unexpected given how many actors are at\nplay within the field of eSports and while the situation should not be over simplified, there are a\nfew vital cultural factors at work. The major concern here is that the focus of eSports has lured\naway from its competition-based roots by the affluence of a media-centric ideology. We can see\nhowever, that while media appeal has become the top priority, the old values have not been\ncompletely replaced. The largest eSports tournaments are still willing to offer unknown players\na chance to compete at the highest levels, but the majority of events do not give players this\nopportunity because in most cases, the event organizers simply cannot afford it. Now days,\npeople will not be content with a simple tournament held in an unadorned hall. Players,\n\nattendees, and viewers have come to expect a certain amount of panache. Free food and\nelaborate stage design are now the standard for eSports events, not to mention a six figure\nprize pool at the very least. It is simply no longer possible to host such an event on a budget.\nNow, if you are able to get a lot of popular players to compete, you will have better ticket sales\nand more viewers online, meaning you can make the money you invested back and then some.\nBut if you spend half your tournament catering to unknown players, your income will be\nsignificantly reduced and you might not even break even, much less a profit. This means it's up\nto the larger tournaments to go out of their way to include open qualifiers in order to keep the\nspirit of open competition alive. While Riot and Valve have taken great pains to ensure the\ngrowth of eSports, their profit margins will be their primary concern, leaving the primary\ncustodians of the community's culture to the community itself.\n\nFortunately, the community has a fair amount of agency, especially by exercising media\nadvocacy, and it is possible for the community to push for continued support of open qualifiers.\nThey are capable of realizing when an entity within the sphere of eSports has made a poor\ndecision and have the ability to use social media to loudly and persuasively call for change.\nDespite the fact that the game developers and event organizers essentially form a hegemony,\ntheir media-centric models motivate them to pay attention to the community they rely upon\n(Hall).\n\nFor example, a few years ago, most Dota players thought that Valve was going to release a\nspecial game mode for Halloween called Diretide because they had done so last year. When\nHalloween came and went with no game mode release and no word from Valve, Dota players\nbegan to protest online, uniting under the phrase \"Give Diretide\". The Dota2 subreddit was\nfilled with requests for the game mode and in the span of a few days, players posted complaints\nto the social media and Metacritic pages for Valve and Dota 2 and even went as far as to post\nthe request for Diretide to the social media pages of the car manufacturer Volvo (simply\nbecause their name sounds like Valve). Eventually, Valve posted a statement apologizing for\nbeing radio silent on the matter and explaining that they were not planning on releasing\nDiretide because they were focusing on improving the game, but after seeing how passionate\nthe community was about the matter, they put out the holiday mode. This event has actually\ncaused Valve to redesign their public relations policy and now the company is much more open\nabout delays and special events (Valve, Not My Best Work!).\n\nWe can see that we essentially have some form of checks and balances within the eSports\nsphere. As developers, event organizers, and casting studios push for more media-focused\ncultural aspects in order to raise profit margins, the community can push back to keep\ncompetition-focused artifacts intact. This will ensure that skill level of professional players\nremains relevant. Even if attaining micro-celebrity status is now essentially a prerequisite to\nbecoming a successful professional gamer, as long as the skill requirement is still firmly in place,\nthe ideals of eSports are not being betrayed and will allow future players to possibly follow in\nthe footsteps of AdmiralBulldog and Suma1L. Furthermore, as video games become more\npopular, more and more people will attempt to transition from gamers to eSportsmen, but\ntournaments and events can only support a limited number of professional teams Already we\n\nhave tens of millions of unique players who are actively playing Dota 2 and League of Legends\nwith only 20-30 top tier five person teams in each game. Adding a few more barriers to entry\ninto the exclusive club of professional players may in fact be necessary. However, it is important\nto note that if the community fails to challenge the acting hegemony in this sphere, these\nbarriers could become too high to overcome, discouraging new players from even attempting to\ngo pro, which will only lead to a stagnating professional scene.\n\nIt is unsurprising, given the explosive growth of the eSports, that capitalism has come to exert\nits influence on the space. And certainly, without financial support, eSports could not have\ngrown in to what it is today. In reality, the effect of capitalism does not need to be destructive,\nbut only if counterbalanced by stubbornly holding on to the initial culture of the space. I believe\nthat eSports' tendency to move forward and address economical necessities by incorporating\nartifacts from professional physical sports, including the prioritization of a media-centric\napproach, is a risky move that could have dire consequences for the space. However, it is\nobvious that such changes have had positive effects on the space and it would be just as\ndamaging if eSports rejected the changes now. The standard for LAN events has increased,\nmaking it much more desirable to physically attend tournaments and the production value of\nstreams for viewers who cannot attend in person has vastly improved the spectatorship\nexperience. There is support for a truly international scene, with players, casters, organizations,\nand events coming from around the world. Third party organizations like Twitch and FaceIt help\nsustain a large amount of tournaments and allow players and events to generate income. Game\ndevelopers and event organizers are given ample opportunities to invest in this space,\nincreasing prize pools, attracting larger audiences and in return, generating more profits.\n\nThe risk comes when these changes overpower the culture of the space. When a tournament\nfocuses so much on being a media spectacle, they neglect to maintain the integrity of the\ncompetition itself. When winning takes a back seat to simply being a public figure. When players\nare glorified not for demonstrating skill, but by gaining popularity. When only well-known\nfigures can impact the scene. If the culture of eSports is lost, the space will lose its uniqueness.\nIt will simply become yet another facet of our vast network of entertaining content being mass\nproduced in this digital age. The space will lose its vitality, its fluidity and interest will eventually\ndecline with nothing to captivate new audiences.\n\nFortunately, there is a way to embrace and even prioritize media-centric and financially\nbeneficial changes while ensuring that the space does not have to sacrifice its core cultural\ntenants. The eSports community is now extremely large and because of the technical nature of\nthe games themselves, most members of the community are somewhat technologically literate.\nThey have shown that they have the ability to quickly bring issues to the attention of the space's\nhegemony, which is mostly composed of the game developers, event organizers, and casting\nstudios. The eSports community has successfully exercised media advocacy in the past and as\nlong as they retain the willingness and ability to exercise it in the future, they will have a say in\nwhat elements of the space remain untouched. Melding two ideologies in order to shape the\nsphere of eSports is a difficult task, but it can be accomplished and I believe it will allow the\nscene to grow while remaining true to its origins.\n\nReferences\n\nCheung, Gifford, and Jeff Huang. \"Starcraft from the Stands: Understanding the Game\nSpectator.\" University of Washington. Web.\n<http://jeffhuang.com/Final_StarcraftSpectator_CHI11.pdf>.\n\nCrawford, G. \"Is It in the Game? Reconsidering Play Spaces, Game Definitions, Theming, and\nSports Videogames.\" Games and Culture (2015). Print.\n\n\"E-Sports Earnings.\" 2015. Web. <http://www.esportsearnings.com/tournaments>.\n\nESLOne. \"One Stadium. Pure Dota 2.\" 2015. Web. <http://www.esl-one.com/dota2/frankfurt-\n2015/>.\n\nFaceIt. \"How It Works.\" Web. 14 May 2015. <http://play.faceit.com/how-does-it-work/>.\n\nFaceIt. \"The International 5 Open Qualifiers on FACEIT.\" 7 May 2015. Web.\n<http://play.faceit.com/the-international-5-open-qualifiers-on-faceit/>.\n\nFlorio, Mike. \"Like It or Not, NFL's Media Policy Is Clear.\" NBC Sports. 20 Nov. 2014. Web.\n<http://profootballtalk.nbcsports.com/2014/11/20/like-it-or-not-nfls-media-policy-is-\nclear/>.\nGiulianotti, R. \"Supporters, Followers, Fans, and Flaneurs: A Taxonomy of Spectator Identities in\nFootball.\" Journal of Sport & Social Issues (2002): 25-46. Print.\n\nGosuGamers. \"EG SumaiL Interview @ DAC 2015.\" YouTube. 3 Feb. 2015. Web.\n<https://www.youtube.com/watch?v=7tl4TXAjal0>.\n\nHall, Stuart. 1979. \"Culture, the Media, and the 'Ideological Effect'\". Chap in. J. Curran, M.\nGurevitch, and J.Woollacott (eds) Mass Communication and Society, pp. 315-348. Beverly\nHills: Sage Publications.\n\nJoinDota. \"General Rules for Amateur Dota 2 Competitions.\" JoinDota. 9 Jan. 2015. Web. 1 May\n2015. <http://www.joindota.com/en/statics/rules_ama>.\n\nJoinDota. \"General Rules for Professional Dota 2 Competitions.\" JoinDota. 9 Jan. 2015. Web. 1\nMay 2015. <http://www.joindota.com/en/statics/rules_pro>.\n\nMarwick, A., and D. Boyd. \"To See and Be Seen: Celebrity Practice on Twitter.\" Convergence:\nThe International Journal of Research into New Media Technologies (2011): 139-58. Print.\n\nMcWhertor, Michael. \"The International Dota 2 Tournament Watched by More than 20M\nViewers, Valve Says.\" Polygon. 29 July 2014. Web.\n\n<http://www.polygon.com/2014/7/29/5949773/dota-2-the-international-tournament-20-\nmillion-viewers>.\n\nMora, Philippe, and Stephane Heas. \"From videogamer to e-sportsman : Toward a growing\nprofessionalism of world-class players?\" In Doom: Giocare in Prima Persona, by Matteo\nBittanti and Sue Morris. 2005.\n\nNa'vi.Dota2. \"Interview with AdmiralBulldog @ DreamHack Winter 2012.\" YouTube. 23 Nov.\n2012. Web. <https://www.youtube.com/watch?v=rMRu0akZip4>.\n\nNoxville. \"Average ELO Ratings.\" Reddit. 7 May 2015. Web. 14 May 2015.\n<https://www.reddit.com/r/DotA2/comments/356ftn/average_elo_ratings>.\n\nPereira, Chris. \"It Took 10 Minutes for Dota 2's International Tickets to Sell Out.\" Gamespot. 28\nMar. 2015. Web. <http://www.gamespot.com/articles/it-took-10-minutes-for-dota-2-s-\ninternational-tick/1100-6426219/>\n\nRedbull. \"Redbull BattleGrounds Event Information.\" 2015. Web.\n<https://www.eventbrite.com/e/red-bull-battle-grounds-dota-2-grand-finals-live-tickets-\n16210811975> .\n\nRiot. \"Challenger Series Structure & Format.\" League Of Legends. 2015. Web.\n<http://2015.na.lolesports.com/na-cs/2015/summer/about>.\n\nRiot. \"League of Legends Championship Series Official Rules.\" 8 Jan. 2015. Web. <https://riot-\nweb-static.s3.amazonaws.com/lolesports/Rule Sets/2015_LCS_Rule_Set_2.01.pdf>.\n\nSmith, Ryan. \"The Buy Back: The Resurrection of Jimmy \"DeMoN\" Ho.\" Redbull.US. 9 Apr. 2014.\nWeb. <http://www.redbull.com/us/en/esports/stories/1331644482280/the-buy-back-\nthe-resurrection-of-jimmy-demon-ho>.\n\nTaylor, T. L., and Emma Witkowski. \"This Is How We Play It.\" Proceedings of the Fifth\nInternational Conference on the Foundations of Digital Games - FDG '10. Print.\n\nTwitch. \"Two Thousand MOREteen.\" 2014. Web. <http://www.twitch.tv/year/2014>.\n\nValve. \"The International Event.\" Dota2.com. 2013. Web. 14 May 2015.\n<http://www.dota2.com/international2013/home/atevent/>.\n\nValve. \"Not My Best Work!\" Dota2.com. 8 Nov. 2013. Web.\n<http://blog.dota2.com/2013/11/not-my-best-work/>.\n\nValve. \"DAC Results.\" Dota2.com. 2015. Web.\n<http://dac.dota2.com.cn/watch/live_result_eng.htm>.\n\nCHAPTER 5\n\nThe Moral Grey Area of Manga Scanlations\n\nBy an MIT student\n\nThe Internet made it easy to share media with each other, which turned the innocent act of\nlending a favorite movie to a friend into an entire organized industry where people get money\nnot for making content but for sharing it. It's become so normalized that the people who pay\nthe creators for content are laughed at, while the ones who bypass the law and give ad revenue\nto content hosts are seen as the more reasonable ones. It's hard to tell which method is really\nbetter, given that most of the creators we hear about in the media still seem to be doing fine.\nBoth the music and movie industries have adapted to the public's new consumer patterns and\nare able to balance creator needs and consumer desires, but the manga industry struggles to\nkeep up.\n\nManga, Japanese comics, are brought to an English audience in a variety of ways. One way is\npublishers license a series and release physical and/or digital copies, translated and edited by\npaid professionals. This process is usually slow, since the English publisher has to get the license\nfrom the Japanese publisher, which can take months or even years. Another way manga makes\nit to the English-speaking world is fans de-bind, scan, translate, and painstakingly edit the\nvolume and share it for free online, a process called scanlating. Since these are done by fans for\nfans, they are faster and often better than the official releases from publishers. These two\nmethods are always in conflict, since publishers say scanlations take away from their and the\ncreators' profits while scanlators say that they are causing no harm and can actually be a huge\nasset to the industry.\n\nThe scanlation scene is large and more complicated than movie and music piracy, since it\ninvolves more work from the distributors. It has its own factions and many people within the\ncommunity have different opinions on the practice and consumption (Deppey), but I argue that\npeople who work on and provide this pirated manga only do it for their love of the media.\n\nIn this paper I will go over the motives of scanlators and how their content sharing patterns are\nnot too different from what people have been doing from decades. I'll look into how sometimes\ntheir actions don't match their pure intentions, but analyze why that may not be the fault of the\nscanlators themselves. The manga scene in the US is large and looking at it as just scanlators\nversus publishers ignores much of the complexity and interplay between the two. If both sides\nrefuse to recognize these nuances, the issue of manga piracy will remain convoluted and it will\ntake a long time to reach some sort of resolution.\n\nNoble Intentions\n\nCulture of Sharing\n\nAlthough it seems like scanlations and content piracy are new phenomena with the rise of the\nInternet, these kinds of sharing practices have been common for years. Friends naturally share\ncontent with other friends. A single book or movie can be passed around a group of friends and\nonly one person ever had to spend money on it. It's normal to ask the people you know if they\nalready have a book you want to read. These kinds of practices have been the backbone of fan\ncommunities, since they not only allow the media to reach a wider audience but also foster a\ncommunity around them. If you got a book from your friend, you know at least one person who\nyou can talk to about that book, and you don't have to actively seek out a community to interact\nwith.\n\nWith foreign media like manga, both finding the content and the community can be tough.\nThere is a barrier to entry to the medium and it is not universal. Many people are not used to\nreading comics, and on top of that are not used to reading from right to left (the original reading\ndirection manga are drawn in). There are also a lot of cultural differences in manga that may\nthrow people off. For all these reasons, it is hard to introduce people to the medium if they\nhave to pay for the content, so sharing books is a natural conclusion. To go one step further,\nwith the Internet as a natural tool for connecting people with niche hobbies or backgrounds, it\nmakes sense that people would start reaching out on the Internet to find like-minded readers.\n\nAlthough the transition to the Internet makes sense, sharing manga digitally gets complicated.\nBecause manga is not common and many stores don't stock it, just recommending a title and\nsuggesting users buy it themself is not always feasible. Another issue is that manga are comics,\nand the art and image quality are an integral part of the content. On top of that, the foreign\nnature of manga plays an important role here. If someone wants to share a manga but it is not\navailable in English yet, they're going to have to take extra steps in order to spread the content\nthey feel so passionately about (gum). All of these factors show how manga sharing evolved\nfrom lending physical books to digital distribution. Not only is it easier to transfer image files\nand translate dialogue digitally, it's natural to want your work to pay off by reaching a larger\naudience and creating a community (Lee 1016). In fact, most scanlation groups used to operate\nvia IRC channels, like open group chats. When readers downloaded the latest release, they\ncould chat about their impressions and talk with the scanlators.\n\nThe work that scanlators put into the content they share is indicative of the fact that much of\nthe content wouldn't be available if the scanlators didn't provide it. A lot of the series that\nscanlators work on are obscure or old, and therefore have no chance of being released officially\nin English. For these cases, it's clear that the only motivation behind their actions would be to\nshare the comics that they love so much to people who may not be able to read them\notherwise. For many scanlators, this is the prime reason they started scanlating (Deppey).\n\nArtist exposure\n\nFor many scanlators, it goes beyond just sharing a single series that they like. Many of them\nwant to promote specific artists and make readers overseas more aware of them (Lee 1016).\nThis can mean either scanlating the older works of an already well-known artist, or releasing the\nwork of new artists. Although this is similar and certainly related to the act of sharing a favorite\nbook, the intentions behind it are a little different. The motivation behind it is promotion.\nJenkins talks about amateur film makers, who make fan-made versions of commercial media.\n\"More often, these amateur filmmakers see themselves as actively promoting media texts that\nthey admire.\" (Jenkins 301) We can also draw similarities from the music piracy scene, and how\npiracy actually introduced many people to a wider variety of music and helped the music\nindustry grow (Hart-Davis).\n\nFor series that do eventually get licensed, many scanlators argue that the original artists would\nnever have gotten released in English unless the scanlators had released their work online and\nbuilt up the hype. Condry brings up the idea of \"market disobedience\", similar to civil\ndisobedience, as a way for fans to influence or force the industry (Condry 203). Although he\nbrings it up in the context of fan-subbing, and the anime industry is much different from the\nmanga industry, fan-subbing is probably the practice that is most similar to scanlating. Both fan-\nsubbers and scanlators only wish to expand the English-speaking audience and help the industry\ngrow.\n\nThere are many examples of groups that stop scanlating a series when it gets licensed, or groups\nthat take down their own hosted files and download links of a series after it's released officially\nin English. From this it's clear they don't want to be fighting the publishers and just want to\nmake sure that the content is out there in English. One group, September Scanlations, has even\nhad direct and productive conversations with the English publishers. When one of the bigger\nseries they were scanlating, No. 6, got licensed by Kodansha USA, they decided to take down all\ntheir existing releases and only provide future chapters for a limited time. However, after\nspeaking with a representative from Kodansha USA, they decided not to provide future chapters\nat all and instead give summaries and teaser images, similar to a book review. This way, fans\nwhom have been keeping up with the series won't have to wait months to find out what\nhappens next from the official editions, but they will still be highly motivated to purchase the\nmanga. A big concern about licensing for both fans and scanlators is the wait time between\nJapanese releases and English releases, so September Scanlations struck a balance between\ngiving fans what they wanted and supporting the original creators through official releases. This\nbalance has worked out, and Kodansha USA has said multiple times on their Tumblr that the No.\n6 fanbase has been amazing at supporting the series.\n\nFor series that never get licensed, there are even more reasons to scanlate. Not only does it do\nno harm to the English manga market, it leads to more possible profit for the original artist. The\noverlap between the English-speaking audience and Japanese-speaking audience is very small,\nso it's unlikely that many of the people who read scanlations are potential Japanese edition\nbuyers that the industry is losing. And if there is no English edition to purchase, then there is no\n\nprofit lost there. But not all of it is about just avoiding profit loss--this actually can generate\nprofit for the original creators. Scanlation readers who fall in love with the series enough will be\nmotivated to buy the raw Japanese versions despite not being able to read it directly. Many\nscanlators actively encourage this; Bunny's Scans always notes the publisher and ISBN in its\nreleases, and also has multiple links for where to purchase the Japanese edition, both print and\ndigital, for all their projects on their website.\n\nThe Real World Consequences\n\nOnline Readers\n\nAggregate online readers have changed the English-speaking manga scene drastically. Aggregate\nsites host both scanlated and scans of licensed manga, which don't involve any work from\nscanlators and are direct rips of official editions. Aggregate sites, both for just downloads and\nfor online reading, cropped up in the late 2000s and changed how readers interacted with the\ncontent they were reading, the scanlators that brought them that content, and the original\ncreators.\n\nAggregate online readers collect various series and put them all in one place for users to access.\nThey also don't require readers to download or sign up for anything, and are extremely\naccessible. Because of this, online readers have become extremely popular. One of the most\npopular ones at the beginning of this boom, OneManga, was even among the world's 1,000\nmost-visited websites (Melrose). Online reading removed many of the barriers of entry into the\nscanlation scene, since now users didn't have to figure out IRC or seek out specific groups to\nfind a certain series.\n\nSince aggregate online readers made it extremely easy to find and read manga online, it\nchanged the system of sharing content. Rather than it being a model of friends sharing a single\nbook, it became more like large library that anyone could take and keep from. Instead of acting\nas friends who are excited to share their favorite series with each other, it's turned into a more\ncommercial model of sharing. There is no longer any fan-passion behind any of the content\ndistribution.\n\nThis also effects how communities form around these interests. There is no reason for readers\nto interact with each other if they are just reading the same files on an online reader, so\ncommunities are harder to build around these shared interests. What was once one of the most\nimportant parts of scanlation is now one of the most ignored, and people have to look\nelsewhere to find people to talk to about the latest update.\n\nThe Actual Fate of the Original Artist\n\nAlthough one of the main arguments for scanlations is artist exposure, often their actions do not\nmatch with their ideals. Many scanlators claim that their work does not affect official publishers\nsince they stop releases when a series is licensed, but in reality, that doesn't stop the online\n\npiracy of the manga. For example, the scanlation group Tsundere Service Providers has\nrecognized the official license of one of their projects, and will take down the downloads of their\ncontent when the official version comes out, but will still keep on scanlating future chapters and\nreleasing them on online readers. Although they may not be delivering the content directly into\nreaders' laps via downloads anymore, most people are unlikely to purchase the book and give\nback to the original creators if the content is already online.\n\nIt's not just publishers and scanlators involved with these issues, though; the original creators\nmust be considered too. Since the original Japanese publisher basically functions as a wall\nbetween reader and creator, it's hard for average fans to get directly to the creator, but that\ndoesn't mean the creator's wishes should be ignored. When Libre Publishing sent out cease-\nand-desist letters to various scan groups, they said they were acting to protect the rights of the\noriginal creators (\"Publisher Libre Confirms...\" Anime News Network), so we can view the\nJapanese publishers as the voice of the original artists. Vertical Comics has said on their Tumblr\nand Ask.FM (which has since been deleted and moved) that much of what they have over\nscanlators is direct contact with the artist through the original Japanese publisher. The original\nartist can request cover design changes, translation edits, etc, but it's the Japanese publisher\nthat is responsible for relaying that information to the American side of production. For\nVertical's title Chi's Sweet Home, they have been working closely with the original publisher and\nartist, who have a huge amount of influence over the production (Alverson).\n\nWith independent productions like scanlations, there is almost never contact with the original\nartist. So despite saying that they are working on releasing those projects just for the artist to\nget exposure, they may be going against the original artist's wishes just by sharing the content.\nThere are many examples of this with Pixiv comics. Pixiv is an image sharing site, similar to\nDeviantArt, where users have a profile and can upload galleries of images that they've created.\nIt's used primarily by Japanese people to share fanart and fan comics. In the past two years,\nmany English-speaking fans have taken, translated and edited the comics and put them up on\nother sites, mainly Tumblr. There was a big debate on how ethical this process was, since it\ndivorced the work from the creator and garnered popularity for the sharer or translator rather\nthan the original artist, who had done the bulk of the work. Fans who asked the artists for\npermission to edit and repost were often met with rejection.\n\nSeveral Japanese-speaking fans talked with the original artists about their reasons behind their\nunwillingness to share. The issue of editing someone else's work came up. The artists felt they\nhad worked hard on their creations to be a specific way and did not want them to be altered.\nHowever, even without image editing, some artists are against translations of their comics. They\nmentioned that they were worried about the lack of control they had over their own creations\nin other contexts. Having created the work with nuanced meanings in Japanese, they did not\ntrust that the same message would carry across languages (brumalbreeze). Even those these are\nindependently created and distributed mini comics, from this example we can see why artists\nwould want more control over how their content makes it across seas.\n\nBut Who's Fault is it Really?\n\nOnline Readers are a Separate Issue\n\nAlthough aggregate online readers have undoubtedly changed the manga licensing situation,\nthe people behind them are not the same people who actually scanlate manga. Online readers\nare a good example of the negative effects of scanlation, but are not indicative of the original\nintentions or the core ideals of the scanlation scene. In fact, there has been a lot of fighting\nbetween scanlators and online readers, and many scanlators hate online readers just as much as\nEnglish publishers do.\n\nOne big issue is that aggregate readers actually make a profit from ad revenue. Each page of\nmanga is a different web page with new ads, which are often cleverly placed so that readers\naccidentally click them. With these, online readers are actually making money off of both the\noriginal artist and the scanlator's work. Online readers are also not focused on providing readers\nwith top quality content, they mostly exist solely to generate ad revenue. They downsize images\nand choose worse-quality scanlations just to get the latest chapter up. Most scanlators do not\nallow online reader sites to host their releases, but most reader sites do not comply with these\nwishes and defy the scanlators.\n\nAside from these more individual reasons, scanlators also dislike online readers since they feel it\ndissipates the community. Scanlators are still focused on creating a community of people with\nmutual interests, and when online readers take the audience away from the scanlator, that\ncommunity is lost (gum). The scanlation teams themselves then have trouble attracting new\nmembers, which causes that sub-community to shrink as well.\n\nAlthough scanlators disapprove of online readers, that tension is not enough to make them stop\nscanlating. In fact, many groups are adapting to the audience's new habits in order to fight back\nagainst online readers. Most groups continue to ban uploads to online readers, and instead\nhave their own online readers which host their images in high quality and have no ads. This\nmethod of sharing content brings online reading back into the scope of sharing books among\nfriends, rather than a mass-distribution system like a library.\n\nHow Much is the Artist Really Losing?\n\nReturning back to the topic of the effect of scanlating on the original creator, we have to think\nabout how much the creator is actually losing, and how much we can expect the community to\ncare. As mentioned in the first part, for artists who are obscure or draw non-mainstream\nmanga, it's likely that their work will never make it into English via official methods. For them,\nthey are losing zero potential customers and maybe even gaining some.\n\nFor artists who do get official releases in the US, it's hard to tell how much of their overall\nsuccess is due to the purchases of overseas fans. Many times when fans whine about how the\nJapanese industry is not considering American fans, others point out how ridiculous it would be\n\nif they were. So much of their profits come from Japanese fans; it would be a waste to divert\ntheir focus and attempt to please the small amount of American fans that care enough to\npurchase official goods. Whether we like to admit it or not, manga is still a pretty niche interest\nin America and it would be hard to make enough noise to sway the original Japanese publishers\nand creators, who are busy dealing with the local fans. It's hard to find any artist opinions on\nscanlations, the news has been more dominated by artists who are frustrated with Japanese\nfans' tendencies to get their content by illegal means (\"Black Lagoon, Hellsing creators...\" Anime\nNews Network).\n\nSo profit-wise, we can say that the original artist isn't losing much through the circulation of\nscanlations. We can also argue that although the original artist's original intent behind the piece\nmay not be the same after it is scanlated, since the artist's main concern is not the overseas\nfans, that issue is also not a big problem. However, if we discount both these things, then we\nmust reevaluate the motivation of the scanlator. One of the reasons scanlators give for\nscanlating is to promote an artist so that they gain popularity and hopefully more fans, which\nleads to more profit and success for the artist. If we take this out of the picture, then the\nmotivation for scanlators is to share content that they are passionate about. This in itself isn't a\nproblem, but if they are not considering the artist, then we can say that their sharing is actually\nharming someone, both morally and economically. It isn't the same as creating an independent\npiece of fanart, with your own ideas entwined in it. Many scholars have studied these kinds of\npractices and we can see that they can act more purely as promiting source material (Jenkins\n301). However, since the scanlators are sharing source material, it affects the original creators\nmore directly, and they must take this into consideration.\n\nConclusion\n\nIn the first section, we can see that scanlators have pure intentions and their passion carries\nthem to share their favorite works. Their tendencies are not unique to manga or scanlation;\nthey are just one example of how fans share their love for the media they consume. However,\nthese pure intentions do not mean that their every action is without consequences. The effects\nof their work cannot be controlled the way that they hope to be. The strength of their passion\nfor this media led them to reach out to larger communities, but those communities have taken\ntheir work and expanded it beyond anyone's reach. Much of this is not direct fault of the\nscanlators, who are often on the same side as the official publishers.\n\nThat being said, these effects cannot be ignored. Sure, scanlators have started to deal with\nonline readers in small ways, by pleading with their fans or hosting their own readers, but they\nhave done little else about the other issues in the manga industry. Their passion for the media\naffects their priorities, and they continue to focus on providing and sharing content rather than\nthinking about what the original creator wants. With an ocean separating them and both\ncultural and language barriers, scanlators have kind of invented their own ideas of what's best\nfor the artist without actually consulting them.\n\nIn the future it would be interesting to look at other points of views of scanlators, namely those\nwho do it more for artistic purposes and value quality of their work over anything else. We can\nalso look into the actual work that goes into scanlations, and how they are a sort of middle\nground between straightforward Hollywood movie uploads and the more involved creation of\nfanart and fanfiction. Scanlations done by different people are going to be different, while\nAmerican movies uploaded and shared by different people will always be the same. However,\nscanlators cannot claim the same amount of ownership over their work as fanartists do. The\nbalance that scanlations have between these two worlds is one of the reasons that they remain\nmore of a moral grey area, and would be interesting to explore.\n\nReferences\n\nAlverson, Brigid. \"Anime Boston | Vertical panel.\" Comic Book Resources. Web. 13 May 2015.\n<http://robot6.comicbookresources.com/2010/04/anime-boston-vertical-panel/>\n\n\"Black Lagoon, Hellsing Creators Discuss Illegal Uploads.\" Anime News Network. Web. 13 May\n2015. <http://www.animenewsnetwork.com/interest/2010-08-22/black-lagoon-hellsing-\ncreators-discuss-illegal-uploads>\n\nbrumalbreeze. \"Why You Shouldn't Translate Doujinshi Without Permission\". Web. 13 May\n2015. <http://brumalbreeze.tumblr.com/post/67930119669/why-you-shouldnt-\ntranslate-doujinshi-without>\n\nCondry, Ian. \"Dark Energy: What Fansubs Reveal about the Copyright Wars.\"Fanthropologies.\nEd. Lunny, Frenchy. Minneapolis: University of Minnesota Press, 2010. 193-207. Web. 13\nMay 2015.\n<https://books.google.com/books?id=5d0Q9fdinQUC&printsec=frontcover&source=gbs\n_ge_summary_r&cad=0#v=onepage&q&f=false>\n\nDeppey, Dirk. \"Scanlation Nation: Amateur Manga Translators Tell Their Stories.\" The Comics\nJournal. #269: 13 Jul 2005. Web. 13 May 2015.\n<http://web.archive.org/web/20060505014917/http://www.tcj.com/269/n_scan.html>\n\ngum. \"Online Reading and Direct Downloads.\" Inside Scanlation. Web. 13 May 2015.\n<http://www.insidescanlation.com/history/history-3-4.html>\n\n\"Horimiya Chapter 49.\" Tsundere Service Providers. Web. 13 May 2015.\n<http://www.tsundere.services/2015/03/horimiya-chapter-49.html>\n\nJenkins, Henry. Rethinking Media Change : The Aesthetics Of Transition. Cambridge, Mass: MIT\nPress, 2003. eBook Collection (EBSCOhost). Web. 13 May 2015.\n\nKodansha Comics. Web. 13 May 2015. <http://kodanshacomics.tumblr.com/>\n\nLee, Hye-Kyung. \"Between fan culture and copyright infringement: manga scanlation.\" Media,\nCulture & Society. SAGE Publications: 2009. Vol. 31(6): 1011-1022. Web. 13 May 2015.\n<http://mcs.sagepub.com/content/31/6/1011>\n\nMelrose, Kevin. \"One Manga among world's 1,000 most-visited websites.\" Comic Book\nResources. Web. 13 May 2015. <http://robot6.comicbookresources.com/2010/05/one-\nmanga-among-worlds-1000-most-visited-websites/>\n\nNachi. \"Current Projects.\" Bunny's Scans. Web. 13 May 2015. <http://bns.shounen-\nai.net/index.php?topic=7.0>\n\n\"Publisher Libre Confirms Notices to Manga Scan Groups.\" Anime News Network. Web. 13 May\n2015. <http://www.animenewsnetwork.com/news/2010-09-25/publisher-libre-\nconfirms-notices-to-manga-scan-groups>\n\n\"So About That No.6 Scanlation.\" September Scanlations. Web. 13 May 2015.\n<http://september.strawberrywine.org/archives/1082>\n\n\"The Diagonal.\" Vertical Comics. Web. 13 May 2015. <http://vertical-inc.tumblr.com/>\n\nCHAPTER 6\n\nThe Importance of Distinguishing Act from Actor:\nA Look into the the Culture\nand Operations of Anonymous\n\nBy Hannah Wood\n\n\"How did we get to a point where people expect a gang of young geeks with nanosecond\nattention spans wearing masks from an action movie, who write manifestos in faux-\nrevolutionary prose and play amateur detective in chat rooms, to help a fraught social cause like\nFerguson?\" This is the response from Adrian Chen, a writer for The Nation, to Anonymous's\nreactions to the controversy surrounding Michael Brown and Officer Wilson. In 2014,\nAnonymous, a collection of internet activists and trolls dedicated to both fostering \"internet\nmotherfuckery\" and spreading awareness of valid social issues, had scheduled a \"National Day\nof Rage\" gathering as a protest of the Ferguson shootings on the same day as a previously\nplanned protest, the \"National Moment of Silence,\" an event organized by Feminista Jones (a\nfamous black, feminist blogger) to support the very same cause under a very different attitude.\nJones, obviously dismayed by the seemingly intentional planning, asserted that this shows\nAnonymous's lack of care about \"the safety and well-being of Black people.\" Anonymous then\nwent on to falsely yet confidently claim that they had found the officer who actually killed\nMichael Brown (Chen).\n\nSome networks initially commended their gusto, and others condemned their blatant disrespect\nand immaturity: reactions quite representative of the strong feelings of those who have ever\nfollowed any part of their polarizing history. There are supporters and haters everywhere; The\nGuardian called them \"Digital Culture's Protest Heroes\" while Fox News very early in\nAnonymous's career labeled them the \"Internet Hate Machine\" (Eordogh). Justin Bieber has\neven been seen in public wearing a Guy Fawkes mask (one of Anonymous's multiple symbols of\neither support or membership) (Stone). They have made a reputation for themselves as being\nhacktivists and masked heroes while simultaneously wreaking havoc on the lives of innocent\nweb-dwellers. But should their future arguments be invalidated by their past malice? Although\nAnonymous has a history of carrying out destructive operations while fostering an anti-gay, anti-\nwomen, anti-anything-you-can-think-of culture, many of their actions should be taken seriously\nand individual campaigns should garner support or opposition based solely on that individual\ncampaign. In other words, their attempt to generate lulz doesn't necessarily have to\novershadow the role Anonymous can play in political and social issues. Then again, their role in\nthese issues, no matter how respectable, does not excuse the racism, homophobia, and sexism\nthat persists on many Anonymous channels. Separating the issues and observing them\nindependently is the best way to parse, and therefore make judgments on them.\n\n\"Lulz\", which is a corruption of \"lol\", \"lolz\", or \"laughing out loud\", supposedly originated in the\nsame deep dark corner of the internet as Anonymous: 4chan (aka, \"The Asshole of the\n\nInternetz\"), the image board with minimum moderation and maximum eccentricity. Lulz,\nessentially an adaptation of the German word schadenfreude, is defined as humor at the\nexpense of others, despite the consequences or moral implications. Encyclopedia Dramatica\nelaborates on the meaning of \"lulz\" saying that it is \"engaged in by Internet users who have\nwitnessed one major economic/environmental/political disaster too many, and who thus view a\nstate of voluntary, gleeful sociopathy over the world's current apocalyptic state, as superior to\nbeing continually emo\" (\"Encyclopedia Dramatica\"). Anonymous became Anonymous by\nreaching just a couple ethically questionable steps beyond the acceptable intensity of heckling.\nThey aren't your average trolls. In fact, their first act as a collective, and what brought them into\nexistence, was the incident at the Habbo Hotel in July of 2006: organized in 4chan's random\nboard, aka \"/b/\" (an even deeper darker corner of the internet), a group of members decided to\ntroll the users of Habbo Hotel, a virtual world/social network where members interact through\npersonalized avatars. Each Anon (someone who affiliates him/herself with Anonymous) joined\nthe site and customized their avatar as a suited, black man with an afro; together the trolls\nformed swastikas with their avatars, blocking real users, who were mostly kids, from entering\nthe hotel pool. When other Habbo users would ask for a reason, Anons would simply respond\nwith \"due to fail and AIDS\" (Coleman 4).\n\nIn January of 2008, Anonymous put its name onto the map by launching \"Project Chanology,\"\nthe intense, multi-year assault on the Church of Scientology that included constant distributed\ndenial-of-service attacks (DDoS) on their main website, calling for unpaid pizza and escorts to\nvarious church locations, leaking the personal information of some of the higher-ups (doxxing),\nand eventually physically protesting outside of churches (Coleman 5). Considering these events,\nwhy would anyone take Anonymous seriously? They ceaselessly torment innocent people (in\nthese cases, children and Scientologists) behind the innate security of being anonymous. But\nwhat people often miss regarding Anons' actions is that although \"the lulz\" is supposedly a\nsignificant motivating factor in their decision-making process, there is usually a cause or an\nincident that ignites their fury. In the case of Habbo hotel, a few 4chan members asserted that\nHabbo moderators were arbitrarily banning users who created dark-skinned avatars; the\nforthcoming raid was, to at least some members, a response to those actions, a protest in a\nway. Project Chanology was prompted by the Church's attempt to hide a very revealing and\nembarrassing video of an interview of Tom Cruise spouting off-putting statements regarding\nScientology. The Church has a discordant past with a subset of the internet community due to a\nhistory of attempts at ridding some sites of revealing information about the Church. In doing\neverything they could to prevent this video from proliferating, they pushed the boundaries yet\nagain and offended the group that hates censorship the most: Anonymous. One could say the\nAnons' response was more an act of \"freedom fighting\" to preserve their rights than an attempt\nto solely induce the lulz. And this seems to be the direction they have gone since 2008 (Coleman\n5). Over the past 7 years, Anonymous has been the face of many social justice and political\nissues regarding causes from threatened freedom of speech to rape cases, but is this so-called\n\"freedom fighting\" actually benefitting anyone?\n\nIn 2010, at the tail end of Project Chanology, Julian Assange was becoming a household name\nfor his whistleblowing site, Wikileaks, leaking thousand of documents, videos, and other\n\nclassified media to the public. On November 28th, Wikileaks released 220 classified US\ngovernment cables, a leak so influential it earned the title \"Cablegate\" (Coleman 118). From this\nwe learned that the US government was launching secret missile attacks on supposed terrorists\nin Yemen, that North Korea gifted Iran a large number of deadly missiles, that Secretary of State\nHillary Clinton ordered her underlings to collect personal information, such as credit card\nnumbers, on foreign government officials, that the US was in alliance with Hamid Karzai, a drug\nlord and brother to the Afghan president, and even more astonishing behind-the-scenes trades,\ndeals, alliances, and secrets (Coleman 119). The world was mortified, and the US government\nwas not happy. Julian Assange became one of most influential (and therefore most feared) men\nin the world and consequently became the target of political rage. Politicians from all sides\ndeclared his acts \"despicable\" and that he should be hunted down \"with the same urgency we\npursue al-Qaeda\" (Coleman 120). As a result, Senator Joe Lieberman and his staff urged Amazon\nto ban Wikileaks from its servers, and although Wikileaks and Assange had not been ruled guilty\nof any charge, Amazon complied causing the site to be inaccessible. Paypal, MasterCard, and\nother corporations followed suit and disallowed the site from accepting donations through their\nchannels. Consequently, the outrage expressed by the government was matched by the outrage\nof the most passionate of dissenters, Anonymous. Their favorite and most effective weapon, the\nLow Orbit Ion Cannon (LIOC), a denial-of-service attack application used to take down websites,\nwas downloaded over a hundred thousand times by Anons and their affiliates all over the world\nto support the DDoS campaigns against corporations such as PayPal, MasterCard, Visa,\nEveryDNS, and politicians Joe Lieberman and Sarah Palin (Coleman 118). Anonymous was\nresponding to the harsh reality of the situation: \"the Internet, so often experienced as a public\nspace, is in fact a privatized zone, with the Amazons and PayPals of the world able to shut down\nconversation and commerce\" (Coleman 128). People were baffled at the lack of these\ncorporations' justification for providing services to organizations like the KKK while Wikileaks,\nwhich had not violated any terms of service or been convicted of anything illegal, was deemed\nunfit for their business (Coleman 127).\n\nInitially, Anonymous was simply a voice for many outraged citizens, but it soon became their\ntool. This era of Anonymous's history saw an enormous growth in membership (if you can call it\nthat). No longer was this a small subset of internet trolls organized on /b/; Anonymous was a\nfull-fledged dis-organization filled with what seemed to be impassioned anarchists and anti-\ncensorship activists. They got the attention of all major news outlets and quickly found their\nway into the political spotlight. They proved hacktivism can be a valid form a protest and made\nit clear that people are very protective of their internet rights.\n\nSome say it's difficult to don Anonymous with the \"activist\" hat due to their ever-changing\nvalues, nonexistent membership requirements, and no defined organizational hierarchy. They\nmay be a big name in internet rights advocacy, but they have a varied network of members and\nhave been known to fuel a culture of sexism, racism, and homophobia. In December 2013, one\nof Anonymous' Twitter accounts announced a campaign against \"feminazis instigating an evil\nTrollocaust against free speech\" founded on the baseless claim that some feminist bloggers had\ninfluence in getting others' Twitter accounts suspended (O'Toole). Weev, one of the most well-\nknown and influential Anons, made statements such as, \"all the social sciences have become an\n\nelaborate scheme for giving white kids racial inferiority complexes, or destroying the gender\nroles that make our society work,\" and went on to say that Jews \"abused our compassion to\nbuild an empire of wickedness the likes the world has never seen,\" and has announced his\nallegiance to neo-Nazism (Chen) (Coleman 28). Anonymous discussion boards are riddled with\nevery slur you could think of, and women and minorities are unsurprisingly barely present and,\nwhen their identities are revealed, often bullied off the scene. The lulzy attitude fosters a\nculture of irresponsibility, and the innate value of being anonymous is being able to avoid\ndealing with the consequences of your actions. Much of their protest is carried out illegally;\ndoxxing and DDoSing are very much against the law and their execution raises many ethical\nconcerns. Many of our most prevalent social problems are thriving at the very heart of some\nAnonymous communities. Misogyny, racism, classism, rape culture, and other prominent social\nissues are proliferating in these corners of the internet and therefore in the minds of the people\ninvolved, mostly of the white male sort.\n\nOne of Anonymous's most concerning aspects is also one of its most defining qualities: it's not a\nunified group; it is a collective where \"Anonymous\" is merely an umbrella term for anyone\nclaiming to be a part of it. The lack of formal membership standards and moderation prevent\nthe group from having a unified front. Quinn Norton from Wired defines their style saying,\n\"Individuals propose actions, others join in (or not), and then the Anonymous flag is flown over\nthe result. There's no one to grant permission, no promise of praise or credit, so every action\nmust be its own reward\" (Norton). This is naturally going to attract those whose behavior is\nsocially unacceptable because individuals aren't held accountable. The praise or the blame is\nhardly ever attributed to a single Anon and instead the responsibility is held in the hands of the\nentire collective. But this is troublesome because the collective is a chaotic mass of a diverse-\nthinking individuals who are unable to come to a conclusion on what Anonymous ultimately\nstands for. The contradiction here lies in the question of whose hands should the\nresponsibility/blame/credit fall to? Individuals, by definition of the group, have no identity and\nin most cases can't carry out an effective protest solo and therefore can easily avoid the\nresponsibility. Anonymous as a whole is defined as anyone who claims to be Anonymous, but\nnot specifically those involved in a certain task or issue. So is the name itself the culprit? No, but\nthat's the stance of most onlookers. The inside operations of Anonymous to spectators (which\nsince Operation Avenge Assange has been the entire world) are quite difficult to fully\ncomprehend. Gabriella Coleman, an anthropologist focused on digital activism and an\nAnonymous expert observes this trend saying, \"The number of relationships, fiefdoms, and\ncliques in simultaneous existence is largely invisible to the public, which tends to see\nAnonymous from the vantage point of carefully sculpted propaganda and the media's rather\npredictable gaze\" (Coleman 115). So how can we choose either to ignore or discount the actions\nof one Anonymous group based on a the actions of different group under the same name?\n\nEven if you believe that merely claiming the name creates enough of an affiliation that all self-\nprofessing Anons are responsible for the actions of each other, is invalidating their current\nactions based on prior offenses not an example of ad hominem? Attacking the perceived\n\"character\" of the group and discrediting them based on small subsets of the collective or\ncontroversial personal stances, like Weev's misogynistic, white supremacist attitude, the\n\nreaction to Ferguson, or the ruthless doxxing of religious leaders, instead of forming an opinion\nbased on a single argument is simply wrong. But this goes both ways. One cannot excuse the\nwrongdoings of an Anon because he or she is supportive his stance. Coleman herself and other\nAnonymous advocates are guilty of this. In her book, \"Hacker, Hoaxer, Whistleblower, Spy,\" she\nwrites about the 6 years she spent studying the ins and outs of Anonymous. Given her devotion,\nshe got very emotionally involved and therefore defends their exclusivity and \"boys' club\"\nculture and praises their diversity by calling attention to the participation of both Irish college\nstudents and an English 20-something (young, white males from two different European\ncountries? Wow!) (Coleman 173). She argues that \"by cloaking markers of the self, like ethnicity,\nclass, and age, all sorts of different possibilities are opened up\" (Coleman 174). But this does not\nexplain why over the 6 years she studied this group, she discovered a total of zero female\nhackers. She goes on saying, \"Occasionally, hearing constant belittling of female contributions\nfrom certain Anons, I would find myself wondering, 'Is this sexism or just trolling?'\" (Coleman\n175). Just as someone cannot totally devalue their arguments on social issues based on their\nonline behavior, Coleman cannot excuse their online behavior based on her support of their\narguments. It is very important in situations like this to be able to decouple the activist from the\nactivism.\n\nWhat the media have shied away from (by distracting themselves with either being impressed\nby their intrepid attitude or focused on their lulz-centered culture) is actually valuing a cause or\ncampaign based on both its merit and effectiveness, and unfortunately for Anonymous, it often\nlacks both. In the case of Chanology, one emerging theme was Anonymous's aversion towards\nthe Church's desire to censor content in order create a carefully designed public face. The\ninterview footage was stolen material and leaked online, and the Church's response was a\nnatural though ineffective one: to remove the embarrassing content. Anonymous's response\nseemed to become more a petty act of revenge against an organization who was trying to take\nback their stolen property than an empowering anti-censorship campaign. But regardless of\nintentions, what exactly came from this? Swaths of Scientology critics dedicated to raising\nawareness of the Church's human rights violations saw these actions as anti-productive and,\nironically, a violation of the Church's freedom of speech (George-Cosh). In the end, the Church\nwas able to play the victim and some young Anons who were in it for the lulz ended up getting\narrested.\n\nEven regarding seemingly more meaningful campaigns like OpTunisia, the hacking of Tunisian\ngovernment websites in response to the country's strict censorship laws, there is a gross lack of\nevidence that their operations accomplished anything significant (Chen). Operation Payback, the\nmother campaign of Operation Avenge Assange, which was an attack on many anti-piracy and\npro-copyright groups and organizations, was unsuccessful beyond getting their name and cause\ninto the media. The corporations they attacked experienced minimal downtime, and no long-\nterm damage was felt by any of their victims. When the UK Intellectual Property Office site was\nDDoSed, people were perplexed because the most significant result of the attack was\npreventing UK citizens from accessing information they had a democratic right to access (\"CMU\nWebsite\"). There are speculations as to why these digital protests most often lead to dead ends.\nSome say that it's because most Anons' intentions are in the wrong place. If the activist\n\npopulation of Anons is anything like the original Habbo Hotel Anons, the intentions are less\nfocused on positive results and more focused on creating chaos in the world, and that's often\nwhat these campaigns seem to fueled by. Some condemn their uncritical and undying\nadmiration for the internet and modern technology and how they believe it excuses their\nmisconduct and empty results. Adrian Chen, quoted in the introduction, believes that \"the\nshallowness of their politics and their uncritical embrace of technology means this energy is\neasily channeled into Silicon Valley's parody of revolution: a techno-liberation from the\ndoldrums of day jobs with health insurance and steady benefits, in favor of the radical freedom\nand flexibility to pilot an Uber under contract.\" He goes on to assert that \"Internet activism is at\nits most effective as an extension of real-world solidarity,\" something Anonymous can boast\nvery little of. So it's the intrinsic pieces of their culture (the lack of organization, consistency,\nand groundwork) that will prevent them from ever creating any social change, according to\nChen. Some say that the importance of Anonymous lies in their pioneering of internet weapons,\nsuch as the LOIC and DDoS. Coleman states that these weapons are \"a modality of politics\nexercised by a class of privileged and visible actors who often lie at the center of economic\nlife...who were taking political matters into their own hands and making their voices heard.\" It's\ngood to know that \"privileged...actors...at the center of economic life\" are finally getting out\nthere and \"making their voices heard\"!\n\nSo what can we non-Anonymous-ers take away from all this? We must separate the issues and\nanalyze the outcomes in order to come to a decision. Researching Anonymous bewildered me\ndue to the unwritten standard that I had to be either a \"yes\" or a \"no\". Each article I read either\npraised the heroism of Anonymous and simultaneously used it to justify their grievances, or\ndenounced the entire collective regardless of positive awareness they spread. I felt myself going\nforwards and backwards and became awash with seasickness. What I finally ended on a was a\nbalance of disdain for much of their culture, a respect for many of the causes they have stood\nfor, and a curiosity for how they can manage to carry out these campaigns more effectively in\nthe future. They aren't exclusively trolls nor are they \"Digital Culture's Protest Heroes\".\nAnonymous, the community that started a campaign to seek justice for Rehtaeh Parsons, a 17-\nyear-old gang rape victim, is also the community that spawned the \"Rick Roll\" (Norton). I have\nno choice but to maintain a multi-faceted view of them.\n\nReferences\n\nChen, Adrian. \"The Truth About Anonymous's Activism.\" The Truth About Anonymous's\nActivism. The Nation, 11 Nov. 2014. Web. 13 May 2015.\n\nColeman, E. Gabriella. Hacker, Hoaxer, Whistleblower, Spy: The Many Faces of Anonymous.\nLondon: Verso, 2014. Print.\n\n\"Encyclopedia Dramatica.\" Lulz -. N.p., n.d. Web. 13 May 2015.\n\nEordogh, Fruzsina. \"How Anonymous Have Become Digital Culture's Protest\nHeroes.\"http://www.theguardian.com/. The Guardian, 15 Apr. 2013. Web. 13 May 2015.\n\nGeorge-Cosh, David. \"National Post.\" WayBack Machine. N.p., 26 Jan. 2008. Web. 13 May\n2015.\n\nNorton, Quinn. \"How Anonymous Picks Targets, Launches Attacks, and Takes Powerful\nOrganizations Down.\" Wired.com. Conde Nast Digital, 3 July 2012. Web. 13 May 2015.\n\nO'Toole, Emer. \"The Anonymous Problem with Feminism.\" Www.theguardian.com. The\nGuardian, 7 Dec. 2013. Web. 13 May 2015.\n\n\"RIAA Site Goes down following LimeWire Win.\" The CMU Website. CMU, 1 Nov. 2010.\nWeb. 13 May 2015.\n\nStone, Michael. \"Justin Bieber Supports Anonymous with Guy Fawkes Mask.\" Examiner.com.\nThe Examiner, 2 Aug. 2013. Web. 13 May 2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701 Media Violence Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/3727dffb890677ad69d590bece21e669_MITCMS_701S15_Mediavoil.pdf",
      "content": "Media violence is a serious problem\n\nVS\n\nThe problem of media violence is exaggerated\nRef. Haugen & Musser, 2009\n\nMedia Violence Should Be More Regulated\n\nVS\n\nMedia Violence Should Not Be More Regulated\nRef. Haugen & Musser, 2009\n\nVideo game violence is a serious problem\n\nVS\n\nThe problem of video game\nviolence is exaggerated\nRef. Haugen & Musser, 2009\n\nMedia violence is evaluated on the basis of different\ncriteria:\n\n- Modality\n- Explicitness\n- Visibility of injuries\n- Use of weapons\n- Type of character involved\n- Perceived acceptability\n- Etc.\n\nRef. Boyle, 2005: xi\n\nDefinition: \"Depiction of a credible threat of\nphysical force or the actual use of such force\nintended to physically harm an animate being of\na group of beings\" (Wilson and al. in Boyle,\n2005: 23)\n\nCritique: Neglects non-physical\nviolence (verbal aggressions,\npsychological abuses, stalking, etc.)\n\n- Slapstick physical violence (cartoons, comedies)\n- Fictional violence (psychological thrillers, slasher\nfilms, action movies, horror movies)\n- News reporting of real-world violence\n- Religious texts\n- Sports coverage\n- Video games (repetitive and immersive)\n- etc.\n\n- Perpetrator is depicted as a deviant or\na hero\n\n- Victim is depicted as deserving or\nundeserving\n\n- Violence is glamorized or criticized\n\n- Violence is moralized (right/wrong) or\npurely aesthetic\n\n- Violence is contextualized or\ndecontextualized\n\nRef. Boyle, 2005\n\n\"Violence is a behavior that takes on\nparticular meanings (for the perpetrator,\nvictim and others) in relation to the specific\nsocial, political and cultural context in which\nit is enacted\" (Boyle, 2005: xiii)\n\n- People do not necessarily agree on the\ndefinition of violence\n\n- People can have different perceptions of a\nviolent media production\n\nSome statistical studies show\ncorrelations between media\nviolence and aggressive\nbehaviors\n\nBUT\n\nCorrelation does not\nnecessarily imply causation\nRef. Boyle, 2005: 5\n\n- Ignores that viewers are able to\nmake choices and that they\nshould be held responsible for\ntheir actions\n\n- Considers that viewers are\npassive and uncritically accepting\nof media content\n\n- Is concerned by what media texts\nare doing to people instead of by\nwhat people are doing with\nmedia texts\nRef. Boyle, 2007: 15\n\nBlaming media for real-life violence is a way to\navoid public debates about :\n\n- association of masculinity with aggressiveness\n- mental health problems\n- access to firearms control\n- etc.\n\n- Media violence shapes and reflects the way\nwe make sense of violence, crime, and\njustice in the context of our daily lives.\n\n- Story-telling and image-making can distort\nreal life experiences of violence.\n\nRef. Boyle, 2007: 13, 183\n\n- Black and ethnic minority perpetrators OR victims\nof serial murders are underepresented in media\ntexts, because the serial killer is often elevated to\nthe status of folk hero\n\n- There is no reluctance to represent black and\nethnic minority men as perpetrators of other\nviolent or sexual crimes\n\n- Black or ethnic minority victims from both sexes\nare underepresented\nRef. Boyle, 2005: 62\n\n- The way we define violence and criminal acts\nreflects our positioning in other debates on\ngender and sexuality\n\n- Men are perpetrators and victims of violence\n96% of the time\n\nRef. Boyle, 2005: xii, 7\n\n-\nViolent representations construct men as powerful, dominant, and\naggressive and women as vulnerable and passive\n\n-\nMarital rape, child abuse, and domestic violence remain mostly\ninvisible in fictions\n\n-\nOnly women's deaths are sexualized in fictions\n\n-\nIn television news, the gender of male perpetrators and victims is\nrarely pointed out while the gender of female abusers is often\nemphasized and their femininity put into question\n\n-\nMen's violence is generally normalized, while women's violence is\nproblematized or stigmatized\n\nRef. Boyle, 2005\n\nViolent women are:\n\n- guilty of both breaking the law and transgressing\ngender norms\n\n- threats to the essentialist definition of women as\nbiologically nurturing, passive, and vulnerable\n\n- threats to the patriarchal society based on\ngender binaries and on the domination of men\nRef. Boyle, 2005: 94-100\n\nWork to contain these threats by:\n\n- denying violent women's agency and focusing\non their victim status (Homolka)\nOR\n- denying their gender and depicting them as\nunnatural women (Charlton)\nRef. Boyle, 2005: 101-108\n\n- Women's violence is socially accepted when it\ncomes to saving or avenging children\n\n- Women's violence is considered the most\n'unnatural' when it comes to harming or\nkilling children (infanticide)\nRef. Boyle, 2005: 118-119\n\n- Sexualize women's deaths\n\n- Normalize male dominance and violence\n\nBUT\n\n- Viewers are not encouraged to identify with\nthe killer, but rather with the female survivor\n\nRef. Clover, 1992\n\nImage courtesy of Wikimedia Commons\nand is in the public domain.\nImage courtesy of Wikimedia Commons\nand is in the public domain.\nImage courtesy of Wikimedia Commons\nand is in the public domain.\n\nImage courtesy of W1N9Zr0 on flickr. License CC-BY-NC-SA.\n\nANTI-PORNOGRAPHY\n\n-\nThere is a causal relationship\nbetween pornography and male\nviolence against women\n-\nPornography is violence against\nwomen\n-\nWomen enjoying pornography are\nconditioned to see gender\ninequalities as sexy\n-\nPornography should be eradicated\nor censored\n\nANTI-CENSORSHIP\n\n-\nThere is no direct link between\npornography and male violence\nagainst women\n-\nRepresentations of rape or\nmurder cannot be considered\nas 'real' rape or 'real' murder\n-\nThe problem of violence in\npornography is exaggerated\n-\nWe should acknowledge the\nagency of female performers,\nmen's responsibility for their\nactions and the complex\npleasure that pornography can\nprovide\n\nRef. Boyle, 2005: 29-40\n\nMost of heterosexual and commercial\npornography:\n\n- depicts sexuality in a male-dominant\nframework and teaches attitudes about\ngender, sexuality, pleasure, and resistance\n(Jensen in Boyle, 2005: 38)\n\n- Normalizes violent acts in a way that can\ndiscourage women from saying \"no\"\n\n- Because of the Internet's lack\nof regulation, violent videos\nand photos are easily\naccessible online\n\n- Violent videos and photos are\nsometimes imposed on\nInternet users\n\n- Online anonymity encourages\npeople to watch, share, or post\nviolent material\n\nRef. Farhi in Haugen and Musser, 2009: 181\n\nBoyle, Karen. 2005. Media and Violence. London,\nThousand Oaks and New Delhi: Sage publications.\n\nClover, Carol. 1992. Men, Women and Chain Saws.\nGender in the Modern Horror Film. Princeton:\nPrinceton University Press.\n\nHaugen, David M. and Susan Musser (eds). 2009. Media\nViolence. Farmington Hills: Greenhaven Press.\n\nStaiger, Janet. 2005. \"Violence, Horror and Sexually\nExplicit Images\". Chap in Media Reception Studies,\npp. 164-185. New York/London: New York University\nPress.\n\nAdditional Resources\n- Portrayals of violent women:\n- Baise-moi (2000)\n- Examples of femme fatales in Neo-noir:\n- Fatal Attraction (1987)\n- Basic Instinct (1992)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Big Data Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/3e5b607d25218d6bcb24aea5b49ed6d6_MITCMS_701S15_BigData.pdf",
      "content": "Surveillance and Privacy in the Information Age\nImage courtesy of Josh Bancroft on flickr. License CC-BY-NC.\n\nBasic attributes (Kitchin, 2014)\n\n- High-volume\n- High-velocity\n- High-variety\n- Exhaustivity (n=all)\n- Fine resolution\n- Relationality\n- Flexibility\n\nRef. Bollier, 2010 and Kitchin, 2014\n(c) IBM. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nNew York City\nCourtesy of Mayor's Office of Data Analytics. Used with permission.\n\nTotal Information Awareness program\nThis image is in the public domain.\n\nFuture Attribute Screening Technology\nThis image is in the public domain.\n\nRichard Berk's algorithm that predicts if a criminal released from jail will be involved\nin an homicide.\n\n(c) John Wiley & Sons, Inc. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n(c) Google. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n(c) Microsoft. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nNASA Center for Climate Simulation\n\n(c) NASA. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nPotential consequences of Big data misuses and\nabuses (Bollier, 2010):\n\n- imperil consumer freedom\n- imperil civil security\n- imperil personal privacy\n- imperil of civil liberties\n\nDefinition: \"systematic monitoring of people or\ngroups, by means of personal data systems, in\norder to regulate or govern their behavior.\"\n(Degli Esposti, 2014)\n\nApplications:\n- Recruitment and retention\n- Customer loyalty\n- Supply chain efficiency\n- Security and risk prevention\n\n(Ref. Degli Esposti, 2014)\n(c) Surveillance & Society (Sara Degli Esposti). All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMain problems:\n\n- unequal relationship between cie & customers\n- happens without our knowledge (panopticon)\n\n(Ref. Degli Esposti, 2014)\n\nPeople could eventually:\n\n- pay more for health insurance\n- be excluded from health coverage\n- be denied a loan\n- be subjected to profiling or extra scrutiny\n- be kept in jail\n- be arrested before committing a crime\n- be found guilty by association\n(Ref. Mayer-Schonberger and Cukier, 2014)\n\nAccusing a person of a possible behavior\nwould:\n- negate the very foundation of our justice\n(presumption of innocence and\nresponsibility of people)\n- deny human volition and free will\n- exonerate us from any responsibility\n\n(Ref. Mayer-Schonberger and Cukier, 2014)\n\nShould we accept to limit our individual\nfreedom and rely on big data analytics for\nthe common good?\n\nCan big data analytics help us to avoid\ngender discrimination and racial profiling?\n\n(Ref. Mayer-Schonberger and Cukier, 2014)\n\nStrategies currently in place:\n\n- notice and individual consent\n- opting-out\n- anonymization\n- hacking privacy violators\n(Ref. Mayer-Schonberger and Cukier, 2014)\n\nPotential solutions:\n\n- shifting from 'privacy by consent' to 'privacy by\naccountability'\n- defining new regulations (government or market?)\n- redefining the notion of justice to preserve human agency\n- opening the access to datasets and algorithms (transparency)\n- mandating impartial experts to certify the algorithms and the\ninterpretations\n- blurring datasets (differential privacy)\n- specifying how people can disprove a prediction about them\n\n(Ref. Mayer-Schonberger and Cukier, 2014)\n\nPotential solutions (Bollier, 2010):\n\n- erasing data after a given period of time\n- giving to people the right to take possession of their data\n- limiting data collection to what is needed\n- favouring self-discipline by introducing new social norms\n- gaming the system by voluntarily altering our behavior\n(Nissenbaum)\n- being proactive\n\nParadigm shift - Big data requires researchers to:\n\n- deal with the abundance and embrace messiness\n- conduct research with no precise question in mind\n- gain insights from data (induction) instead of testing\ntheories by analyzing data (deduction)\n- use hundreds of algorithms instead of selecting one\n- stop obsessing with causality and be satisfied with\ncorrelations\n(Ref. Kitchin, 2014)\n\nAdvantages of big data compared to traditional scientific\nmethods:\n\n- reduces the risk of error and bias associated with\nsampling (but can also face problems)\n- provides the opportunity to create more dynamic and\nsophisticated models (but does not offer certainties)\n- helps finding correlations that no theory can identify\n(but can lead to serious fallacies)\n- allows to consider data once perceived as \"noise\"\n(Ref. Kitchin, 2014)\n\nTWO SCHOOLS OF THOUGHT\n\nEmpiricist (business):\n\n-\nBig data can speak for themselves without the need of theories, models or\nhypothesis (fallacious)\n-\nBig data analytics are free of human bias. They can be interpreted by\nanyone and their meanings transcend contexts (fallacious)\n\nData-driven science (academia)\n\n-\nUse of existing theories and concepts to analyze the datasets\n-\nUse of big data to identify good questions and formulate hypothesis\n-\nUse of datasets for answering questions that these datasets were not\ndesigned to answer (problem)\n(Ref. Kitchin, 2014)\n\nAlternative path suggested by Kitchin (2014):\n\n- Drawing on critical theory to frame how the\nresearch is conducted and how the results are\ninterpreted.\n\n- Admitting that research is never ideologically\nneutral and objective.\n\n- Complementing big data studies with small data\nstudies.\n\nBollier, David. 2010. The Promise and Peril of Big Data.\nQueenstown: The Aspen Institute.\n\nDegli Esposti, Sara. 2014. \"When Big Data Meets\nDataveillance: The Hidden Side of Analytics\".\nSurveillance & Society, vol. 12, no 2, pp. 209-225.\n\nKitchin, Rob. 2014. \"Big Data, New Epistemologies and\nParadigms Shifts\". Big Data & Society, April-June,\npp.1-12.\n\nMayer-Schonberger, Viktor and Kenneth Cukier. 2014. Big\nData. New York: Mariner Books.\n\nAdditional Resources\n-\nExamples of Big Data:\n- Public Health\n-\nFlu trends from around the world\n-\nPatients Like Me\n-\nCareCloud\n-\nMini-Sentinel\n-\n23 and me\n-\nRateMDs\n- Security\n-\nCentrifuge Systems\n-\nTransHeat Application\n-\nCensors in car seats\n- Finance & Business\n-\nI Know First - Daily Market Forecast\n-\nFarmVille 2\n-\nThe Numbers - Where Data and Movie Business Meet\n\nAdditional Resources cont.\n- Services\n-\nInrix\n-\nTripAdvisor\n-\nCitySense\n- Research\n-\nMarine Explore\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Collective Intelligence vs. the Expert Paradigm Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/7554df3c1c500bef6921539711fa2b91_MITCMS_701S15_ColleIntelli.pdf",
      "content": "Collective Intelligence\nVersus the Expert Paradigm\nImage courtesy of Marc Wathieu on flickr. License CC-BY-NC.\n\n\"A form of universally distributed intelligence,\nconstantly enhanced, coordinated in real time,\nand resulting in the effective mobilization of\nskills\" based on \"the mutual recognition and\nenrichment of individuals rather than the cult of\nfetishized or hypostatized communities.\"\n\n- Levy, 1997: 13\n\nCollective Intelligence\n\nAnthropological spaces\nTerritorial\nSpace\nCommodity\nSpace\nKnowledge\nSpace\n10 200 BC\nRef. Levy, 1997: 6-8\n\nKnowledge Space\nRef. Levy, 1997: 8-9\nKnowledge became predominant in our\ntechnological era for three reasons:\n\n- Speed: the evolution rate of knowledge has been\ngrowing exponentially\n- Mass: the massive amount of knowledge cannot\nbe limited to specialists anymore\n- Tools: instruments are invented to filter data,\nfacilitate connections, and orientate people\nwithin the flux of information\n\nRef. Levy, 1997: 10-14\nThe Role of\nCommunication Technologies\nTechnologies allow us to:\n\n- navigate and filter the mass of information\n- coordinate interactions in the virtual knowledge\nspace\n- find solutions to complex problems in real-time\n- share knowledge with others in an unbiased and\ndemocratic cyberspace\n- expand our intellectual capacities (Hypercortex)\n\nSocial Implications\nof Collective Intelligence\nCollective intelligence allows:\n\n- humanity to enter a new phase of its\nintellectual and social evolution\n- information to be \"universally distributed and\ncoordinated\" instead of being the privilege of\nseparate groups\n- the mutual development and enhancement of\nour social and cognitive potential\nRef. Levy, 1997\n\nSocial Implications\nof Collective Intelligence\n- Replaces the cogito (I think therefore I am) by\na cogitamus (we think therefore we are)\n- Reshapes social structures by increasing our\nsense of community and facilitating\ncooperation\n- Gives rise to a new kind of political power that\nchallenges the hegemony of the state and\ncorporate capitalism\nRef. Levy, 1997\n\nCollective Intelligence & Democracy\nConsidering that \"no one knows everything\" but\n\"everyone knows something\":\n\n- everyone can participate to this information\nutopia\n- others should be considered sources of\npotential enrichment\n- people can combine their skills to accomplish\nsomething greater together\nRef. Levy, 1997: 12-14\n\nWhat Collective Intelligence Is Not\nImage courtesy of James Yu on flickr. License CC-BY-NC-SA.\n\nWhat Collective Intelligence Is\n\"Far from merging individual intelligence into\nsome indistinguishable magma, collective\nintelligence is a process of growth,\ndifferentiation, and the mutual revival of\nsingularities.\"\n\n- Levy, 1997: 17\n\nIs Levy's utopia of collective\nintelligence achievable?\n\nExamples of\nCollective Intelligence\n\nImage courtesy of Wikipedia.org and is in the public domain.\n\nLevy's \"Cosmopedia\"\nNew organization of knowledge that:\n\n-\nrelies on the possibilities of computer technology\n\n-\ncombines different types of expression (\"static images, video,\nsound, interactive simulations, interactive maps, expert systems,\ndynamic ideographs, virtual reality, artificial life, etc.\")\n\n-\nis characterized by its non-separation: \" knowledge is a continuum,\na large patchwork quilt in which each point can be folded over on\nany other\"\n\n-\ndissolves rigid borders between specialized fields of knowledge\nRef. Levy, 1993: 215-217\n\nLevy's \"Cosmopedia\"\n\n\"The members of a thinking community search, inscribe,\nconnect, consult, explore. Their collective knowledge is\nmaterialized in an immense multidimensional electronic\nimage, perpetually metamorphosing, [...] Not only does the\ncosmopedia make available to the collective intellect all the\npertinent knowledge available to it at a given moment, but it\nalso serves as a site of collective discussion, negotiation, and\ndevelopment. [...] hierarchies between users and designers,\nauthors and readers, are inverted. A person who decides to\nlearn about a topic [...] will be capable of supplying new\ninformation about a given sector [...] in which he or she\nhappens to specialize.\"\n\n- Levy, 1997: 216-218\n\nLevy's \"Cosmopedia\"\n\n\"In contrast to the expanding complexity that we attempt\nto organize through transcendence or distribute within\nincreasingly inextricable networks, the cosmopedia\nprovides a new kind of simplicity. [...] It is through the\nsimplicity of our immersion that we escape its complexity,\nits labyrinthine networks. Once within, the member of\nthe collective intellect swims around (navigates, consults,\nquestions, inscribes, etc.), then leaves. [...] Each one helps\nbuild and order a space of shared signification by diving\nin, swimming around, and simply living in it.\"\n\n- Levy, 1993: 218-219\n\nSpoiling Survivor\nSocial implications:\n\n- Helps participants to understand the new\nkinds of power emerging from participation\n- Trains participants to live in the knowledge\nspace\n\nRef. Jenkins, 2006: 29\n\nChallenging assumptions about\ncollective intelligence\n\n- Collective intelligence can be harmful to some\npeople (stalking, erroneous information, etc.)\n\n- Collective intelligence does not necessarily lead\nto the end of expertise (formation of \"brain\ntrusts\", secret clubs, and hierarchies)\n\n- Knowledge communities do not have to be\nhorizontal and leaderless (\"brain trusts\" protect\nprivacy and ensure a higher degree of accuracy)\n\nRef. Jenkins, 2006\n\n- Collective intelligence works best when\nparticipants doubt and contest every claim\n\n- Collective intelligence is not only a goal but\nalso a process\n\n- Knowledge communities are also regulated by\ndisciplinary rules (that participants constantly\ndebate)\n\nChallenging assumptions about\ncollective intelligence\n\nConceptual mapping\n\"The Authority of Wikipedia\"\n(Goodwin, 2009)\n\nConceptual mapping\n\"La sensibilite epistemique face a Wikipedia \"\n(Dumais, 2010)\n\nReferences\nDumais, Fabien. 2010. \"La sensibilite epistemique face a\nWikipedia\". Chap in Web Social. Mutation de la\ncommunication, pp. 341-352. Quebec: PUQ.\n\nGoodwin, Jean. 2009. \"The Authority of Wikipedia\". In\nArgument Cultures: Proceedings of OSSA 09, Ritola, J. (Ed.)\nCD-ROM. pp. 1-21\n\nJenkins, Henry. 2006. \"Spoiling Survivor\". Chap in Convergence\nCulture. Where Old and New Media Collide, pp. 25-59.\nNew York: New York University Press.\n\nLevy, Pierre. 1997. Collective Intelligence. Mankind's Emerging\nWorld in Cyberspace. Cambridge: Perseus Books.\n\nAdditional Resources\n- What collective intelligence is not:\n- Ants form a daisy chain to pull food\n\n- Examples of collective intelligence:\n- Foldit: Solve Puzzles for Science\n- Folding@home\n- Threadless\n- Eric Whitacre's Virtual Choir\n- Survivor Spoilers Forum\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Course Ideologies and Conceptual Maps Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/f23043dd29cecfbaf21e82c058833d70_MITCMS_701S15_Ideologies.pdf",
      "content": "Culture, the Media and the\n'Ideological Effect'\n(Stuart Hall, 1977)\n\n-\nAccording to Marx, the type of collaboration that humans favor to\nappropriate nature and produce material goods shapes a\nsociety/culture's ideologies, discourses, knowledge and institutions.\n\n-\nIn return, these ideologies, discourses, knowledge, and institutions\nsustain this society/culture's mode of production.\n\n-\nIn a capitalist system, this collaboration and mode of production\nrevolve around the exploitation of the working class by the ruling\nclass within specific historical conditions.\n\nPART 1\nHistorical Materialist Conception of\nSociety (Marx) and Culture (Hall)\n\n(Ref. Hall, 1977, pp. 315-319)\n\n(c) Sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n-\nSocial subjects can have a false consciousness of the conditions in\nwhich they live because of the displacing function of dominant\nideologies.\n\n-\nIn a capitalist system, social subjects make sense of their life situation\nthrough the lens of the market ideology, which operates via discourses\nabout wages, contracts, bargains, consumers, democracy, etc. that:\n\n-\nBringing to consciousness common ideas' hidden premises, by\nreasoning and arguing, is a revolutionary act in itself.\n\nPART 2\nDisplacing Function of Ideology\nand False Consciousness\n\n(Ref. Hall, 1977, pp. 321-327)\n\n-\nmake one kind of relation (exploitation) appear as the opposite kind of relation\n(individualism, independence and equality) (Camera Obscura)\n-\nmake one aspect of the relation (negotiation of wages) stand for the whole relation (equality\nbetween managers and workers) (Fetichism)\n-\nmask the foundations of common ideas (Concealment)\n\n(c) Sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nDominant ideologies operate through language, which is a socially-\nconstructed system of signs that:\n\n- mediates our thinking process\n- allows things to mean something\n- refracts 'reality' and distorts it to varying degrees.\n\nIn the capitalist system, the exploitation of the working class by the\nruling class is refracted by language and appears as an equal\nrelationship legitimizing social inequalities.\nPART 3\nIdeological Role of Language\n\n(Ref. Hall, 1977, pp. 327-331)\n\n(c) Sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n1)\nWilliam: There is more than one ideology in a society. The dominance of some\nideologies is determined by who controls the \"process of incorporation,\" that is to say\nthe selection of ideas that are valued and the interpretation of dissident ideas as\ndeviances.\n\n2)\nGramsci: The ruling class cannot achieve dominance and hegemony only through\ncoercion (police, laws, army). Rulers also have to win the consent of subordinate\nclasses through ideologies and achieve a complex alliance of class fractions.\n\nHegemony is not given and permanent: it can be lost and has to be constantly\nsecured with the preservation of an unstable equilibrium. The ruling class has\nto make concessions to win consent and legitimacy.\n\nDissident ideas are easily contained when opposing groups are not organized and\nstrong enough to act as a counter-hegemonic forces and intervene in the\nprocess of incorporation.\n\n3) Althusser: Unlike coercive states, the ideological state apparatuses rule by\nreproducing the ideology of the ruling class, which is not simple and unified, but a\ncomplex set of contradictory ideas that reflect class struggles.\n\nPART 4\nThree Concepts of Domination\n\n(Ref. Hall, 1977, pp. 331-336)\n\n(c) Sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nThe ruling class does not exert control over society directly, but\nthrough the civil society's market ideology, as well as through the\nstate's ideologies of justice, democracy, and freedom, which all\noperate through three mechanisms:\n\n- fragmenting\n- uniting\n- masking\n\nThese ideologies legitimate the hegemony of the ruling class and\ncreate the illusion of a consensus.\nPART 5\nCapitalist Societies Ideologies and Their Mechanism\n\n(Ref. Hall, 1977, pp. 336-341)\n\n(c) Sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n-\nIn the context of monopoly capitalism, mass media become the main producers and\ndistributers of culture, as well as the most influential ideological apparatus.\n\n-\nThe state and the ruling class do not control the media directly, but rather through dominant\nideologies. This allows media to gain legitimacy.\n\n-\nThe broadcasting principles of objectivity and neutrality encourage encoders to present\ndifferent ideas, opinions, practices, and lifestyles.\n\n-\nHowever, encoders internalize dominant ideologies and unconsciously select, rank, and\ninterpret these different ideas as either as permitted and meaningful or as deviant and\nmeaningless.\n\n-\nEncoders also present these different ideas, opinions, practices and lifestyles as part of a\ncoherent society that makes room for minorities and in which different opinions can be\ndebated. This produces the illusion of a consensus that has been reached rationally.\n\n-\nDecoders are free to negotiate the meanings of mass media messages and interpret them in\ncounter-hegemonic ways, but they are strongly encouraged, by visual and verbal\ntechniques, to interpret mass media messages within the limits of dominant ideologies.\n\n-\nMoreover, the possibility of negotiating meanings legitimizes mass media by producing the\nillusion of a consensus that has been reached rationally.\n\n(Ref. Hall, 1977, pp. 342-346)\n\nPART 6\nIdeological Role of Mass Media\n\nHall, Stuart. 1979. \"Culture, the Media and the 'Ideological\nEffect'\". Chap in. J. Curran, M. Gurevitch, and\nJ.Woollacott (eds) Mass Communication and Society,\npp. 315-348. Beverly Hills: Sage Publications.\n\nNote: The sources for the background\nimages in slides 4, 6, 8, 10, and 13 are\nunknown. This content is excluded from\nour Creative Commons license. For more\ninformation, see\nhttp://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Participatory Culture Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/6289b553f44922c1332f49073c3ce600_MITCMS_701S15_PartCulture.pdf",
      "content": "Intellectual Property, Media Panics and Micro-Celebrity\nParticipatory Culture\n\nby Gabrielle Trepanier-Jobin\n\nWide definition: Culture in which \"fans and other consumers are\ninvited to actively participate in the creation and circulation of\nnew content\" (Jenkins, 2006a: 290)\n\nNarrow definition: \"link between more accessible digital\ntechnologies, user-created content, and some kind of shift in the\npower relation between media industries and their consumers\"\n(Burgess & Green, 2009: 10)\nParticipatory Culture\n\nIs not about lowering the barriers to participation with the help\nof digital technologies\n\nIs about creating social incentives to produce and share media\ncontent\nParticipatory Culture\n\n(Jenkins, 2006a: 116)\n\nIs not directly caused by digital technologies\n\nIs made more accessible by digital technologies\nParticipatory Culture\n\n(Jenkins, 2006a: 112)\n\nViral model: connotes the proliferation of something negative\n(germs) that self-replicates passively\n\nSpreadable model: takes into account the agency exerted by\nparticipants as they actively share and discuss media content\nParticipatory Culture\n\n(Jenkins and al., 2013: 293-294)\n\nParticipants do \"not simply pass along static texts; they\ntransform the material through active production processes or\nthrough their own critiques and commentary, so that it better\nserves their own social and expressive needs\"\n\n(Jenkins and al., 2013: 294)\nParticipatory Culture\n\nDisruption of the traditional media business model\n\nYouTube led to the development of new vernacular genres\nYouTube is used to reach niche audiences and distribute controversial\nmaterial without having to negotiate with cable or television channels\nYouTube plays an important role in grassroots political campaigns\nYouTube is used to experiment with technologies and media conventions\n(Burgess & Green, 2009)\n\nDisruption of the \"stickiness\" media business model\n\nStickiness Model\ncounting isolated audience members\nputting material in a centralized\nlocation\nlimiting personalization\nintegrating pre-structured interactive\ngames, quizzes and polls\nfavoring one-to-many communication\nYouTube Model\nsocial connections among individuals\neasy-to-share format that can be\nspread across the Internet\nhaving your own unique experience\nletting the audience use content in\nunanticipated ways\nfavoring peer-to-peer communication\n(Jenkins in Burgess & Green, 2009)\n\nReproduction of the traditional media business model\n\nYouTube also functions as a top-down platform for the\ndistribution of commercial culture\nYouTube has reached the status of mainstream media\nThe agency of YouTubers takes place at the nexus of a\ncorporate-controlled technological system\nMass media adapted their business model to the growing\nparticipatory culture\n(Burgess & Green, 2009)\n\nAstroturfing\nMasking the sponsor or the organization behind a message\nby making it appear as if it was created by grassroots\nproducers\n\nExample of Astroturfing - Al Gore's Penguin Army\n\n(Jenkins & al., 2013: 296)\n\nTensions between commercial interests and public good\n\nCompanies' attempts to gain more control (blocking or\nmoderating comments) go against the participatory culture's\nethos\nSome YouTubers claim that corporations do not care about the\n\"youtubeness\" of YouTube\nSome Youtubers fear that sensationalist big budget videos shift\nthe focus away from creative amateur videos\n(Burgess & Green, 2009)\n\nTensions between commercial interests and public good\n\nthe advertising industry complains about the lack of a\nguarantee regarding the neutrality of the content\nmembers of the YouTube community accuse this commodity\nlogic of altering social relationships\nsome people claim that the commercial logic of YouTube\nthreatens the traditional model of innovation (coming from\nthe margins)\n(Burgess & Green, 2009)\n\nPopular culture and resistance\n\"one of the sites where this struggle for and against a\nculture of the powerful is engaged [...] It is the arena of\nconsent and resistance. It is partly where hegemony\narises, and where it is secured. It is not a sphere where\nsocialism [...] might be simply 'expressed'. But it is one\nof the places where socialism might be constituted\"\n\n(Hall, 1981: 239)\n\nThe importance of digital media literacy\n\nEarlier concerns focused on:\nthe \"digital divide\" (access or lack of access to technologies)\n\nRecent concerns focus on:\nthe \"participation gap\" (level of engagement)\n(Burgess & Green, 2009: 70-71)\n\nMedia literacy\nTwo different visions of literacy have competed since the advent\nof print media:\n\n1. the \"enlightenment view\" ( literacy = democratizing)\n\n1. the \"critical view\" (literacy = discriminatory)\n\n(Livingstone, 2004)\n\nCurrent definitions of new media literacy range from:\n\n1.\nthe tautological one: computer literacy is the ability to use\ncomputers\n2. the idealistic one: shorthand for cultural ideals ranging from\neconomic development, to personal fulfillment and moral strength\n3. the widely adopted one: ability to access, analyze, evaluate, and\ncreate messages in a variety of forms (skills-based approach)\n\n(Livingstone, 2004)\nNew media literacy\n\nSkills-based approach to media literacy\n\ndoes not take into account the specific type of media and\ntechnology\nprioritizes the abilities of individuals over the knowledge\narrangements of a society\n(Livingstone, 2004)\n\nLiteracy and Ideology\n\"literacy is not and never has been a personal attribute\nor ideologically inert \"skill\" simply to be \"acquired\" by\nindividual persons... It is ideologically and politically\ncharged - it can be used as a means of social control or\nregulation, but also as a progressive weapon in the\nstruggle for emancipation\"\n\n(Hartley in Livingstone, 2004: 10)\n\nSystem-based approach to media literacy\nConsiders media literacy as:\nmedium-dependent\na system that enables and shapes participation\na social practice that emerges from the interaction between\ntechnologies and their users\na bottom-up approach: what skills are users developing?\n(Livingstone, 2004 and Burgess & Green, 2009)\n\nVlogger: Geriatric1927\nVideo #1 - First Try\nVideo #36 - Telling It All\n\nOld media vs new media\n\nMisconception: digital media are colliding with traditional media\nand replacing them\n\nOther conception: the relation between old and new media should\nbe seen in terms of co-evolution, co-existence and convergence\nmost videos from traditional media are uploaded by people\noutside of the media industry\nold and new media converge in hybrid media forms (mashup,\nsemi-professional video, machinima, etc.)\n(Burgess & Green, 2009)\n\nMany machinimas parody old media forms\nCounter-Strike for Kids by Machinima on\nYouTube.\n\nThe co-existence and convergence of old and new media on\nYouTube sometimes leads to frictions\nNalts on Oprah? Noprah. By nalts on YouTube.\n\nDebates around copyright issues\n\nArguments of the media conglomerates\n\nYouTube makes profit on their back\nYouTube threatens the mass media industry\n\n(Burgess & Green, 2009)\n\nDebates around copyright issues\n\nCounter-arguments\n\nthe appropriation of media texts by consumers has been normalized and\nmedia corporations should adjust their business model accordingly\nmedia conglomerates have benefited from the visibility of their shows on\nYouTube\nselecting and editing existing media content should be considered a\ncreative act\n\n(Burgess & Green, 2009)\n\nDebates around copyright issues\n\nSome people are concerned with the way platform providers profit\nfrom YouTube users' creativity and use them as \"free labor\". But,\nconsumers should also conform to the participatory culture norms\nand let corporations appropriate their creative work\ntraditional theories on the exploitation of labor are not useful to\nunderstand this particular situation\n\n(Burgess & Green, 2009)\n\nThe myth of newly active audience\nMisconception: digital media allow media consumers to become active\n\nOther conception: books, movies, and TV shows are not passively accepted by\nthe audience:\nreaders/viewers interpret and negotiate meanings according to their\ncultural background and life experiences (Hall, 1980)\nfans are actively engaging with media content, discussing and\nappropriating it (Jenkins, 2006b)\n\nit provides a favorable environment for reflexivity by\nencouraging viewers to comment on videos and post replies\na small portion of YouTubers use the video-sharing platform as\na social network\nit constitutes \"a normal, calm, established appropriation of\nspeech\" (Levy, 1997)\nWhat is new about YouTube\n(Burgess & Green, 2009)\n\nEveryday School Makeup *SPOOF* by\nWonderlandMakeup on YouTube\n\nHarry Potter and the Dark Lord Waldemart by Wal-\nMart Watch on YouTube\n\nMedia panics around YouTube's morality\n\nYouTube is seen by many as an unethical website that:\n\nencourages pathological behavior and puts the youth at risk\nprovides a platform for exhibitionists, voyeurs, hooligans,\npropaganda, violent footage, etc.\nencourages reprehensible practices such as car surfing, happy-\nslapping, vandalism, schoolyard fights, etc.\nfacilitates cyberbullying, abusive comments, and trolling\n(Burgess & Green, 2009)\n\nMedia panics around YouTube's morality\n\nIn response to these claims, Burgess and Green remind us that:\n\nthe proportion and popularity of offensive and \"slice of life\" videos is\noverstated\nthese videos do not have much visibility until the mass media expose them\nthese media panics mirror past concerns about tools that make media\nproduction available to ordinary people\nvlogs are a means of social networking that invite feedback and create\nintimate spaces where difficult topics can be discussed\n(Burgess & Green, 2009)\n\nMedia panics around YouTube's morality\n\nIn response to these claims, Burgess and Green remind us that:\n\nbedroom dance videos have been normalized in YouTube and\nconsidered an empowered form of exhibitionism\napparent anti-social behaviors, such as trolling, have also been\nnormalized\nmoderating and banning comments would go against\nYouTube's ethos of openness\n(Burgess & Green, 2009)\n\nMedia panics around YouTube's morality\n\nIn response to these claims, Burgess and Green remind us that:\n\nthe YouTube community actively negotiates and contests the\nsocial norms of participation on the video-sharing platform\nattempts to shape the ethics of online behavior from an\ninsider position are probably more effective than top-down\nenforcements of new regulations\n\n(Burgess & Green, 2009)\n\nDon't Read the Comments by BrainCraft on YouTube\n\nDebates around the archiving function of YouTube\n\nYouTube has no obligation to store these data beyond their\ncommercial viability\nCultural institutions cannot re-archive YouTube's material because\nof the website's Terms of Use\nYouTube's archive remains unfiltered, disorganized, and\nheterogeneous because it is constituted through a bottom up\nprocess\n(Burgess & Green, 2009)\n\nDebates around the archiving function of YouTube\n\nSome people argue that:\nYouTube content is filtered in use\nYouTube's editors and web designers are actively working on\nbetter strategies to filter YouTube's archive\n\n(Burgess & Green, 2009)\n\nDebates around the archiving function of YouTube\n\nWhat are the risks of counting on a commercial organization to\npreserve our cultural heritage?\nCan we count on a community of ordinary citizens to do the\nwork of librarians and curators?\nShould we reconsider the criteria according to which cultural\nheritage should be constituted and preserved?\n\n(Burgess & Green, 2009: 89-90)\n\nYouTube and Micro-celebrity\n\nCommon assumption: YouTube's star system is more democratic than the mass\nmedia star system\nOther conception: having your voice heard does not guarantee an empathic\naudience and visibility on YouTube does not guarantee success\nCorrection: the micro-celebrities' success is measured by \"their capacity to\npass through the gate-keeping mechanisms of old media\"\n\n(Burgess & Green, 2009: 24, 39)\n\nBurgess, Jean and Joshua Green. 2009. YouTube. Malden: Polity Press.\n\nHall, Stuart. 1981. \"Note on Deconstructing the 'Popular'\". Chap in People's History and Socialist Theory, pp.\n227-240. London & New York: Routledge & Kegan Paul.\n\nHall, Stuart. 1980. \"Encoding/Decoding\". Chap in Culture, Media, Language edited by Stuart Hall, Dorothy\nHobson and Andre Love, pp. 128-138. London: Hutchinson.\n\nJenkins, Henry, Sam Ford and Joshua Green. 2013. Spreadable Media. Creating Value and Meaning in a\nNetworked Culture. New York: New York University Press.\n\nJenkins, Henry. 2006a. Convergence Culture. Where Old and New Media Collide. New York: New York University\nPress.\n\nJenkins, Henry. 2006b. Fan, Bloggers, and Gamers. Exploring Participatory Culture. New York: New York\nUniversity Press.\n\nLivingstone, Sonia. 2004. \"Media Literacy and the Challenge of New Information and Communication\nTechnologies\". Communication Review, vol. 1, no 1, pp. 3-14.\nReferences\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Propaganda and Censorship Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/29cb02caea9861b8f7cde7b5159048d0_MITCMS_701S15_Propaganda.pdf",
      "content": "Image is in the public domain.\n\n\"Set of methods employed by an organized group that\nwants to bring about the active or passive\nparticipation in its actions of a mass of individuals,\npsychologically unified through psychological\nmanipulations and incorporated in an organization.\"\n\n(Jacques Ellul, 1973)\nImage is in the public domain.\n\nProgaganda: \"deliberate and systematic attempt to shape\nperceptions, manipulate cognitions, and direct behavior to\nachieve a response that furthers the desired intent of the\npropagandist.\"\n\nPersuasion: \"interactive attempt to satisfy the needs of both\npersuader and persuadee.\"\n\n(Jowett and O'Donnell, 2011)\nImage is in the public domain.\n\nProgaganda: intentional actions and conscious efforts to\nchange peoples' ideas and behaviors.\n\nIdeology: set of values, meanings and ideas that\nunconsciously influence the choices of producers,\ngatekeepers and journalists, as well as the interpretations\nof the viewers.\n\nImage is in the public domain.\n\nPeople from all horizons can use propaganda techniques\nto defend a cause that they consider noble.\nImage is in the public domain.\n\nPeople from all horizons are affected by propaganda\nto varying degrees.\nImage is in the public domain.\n\nImage is in the public domain.\n\n1) Becoming a source of information (creating news events,\npress releases, press kits, talk show apperances, books,\nposters, badges, slogans, advertisements, etc.).\n\n2) Excluding undesirable sources of information by shaping\nmedia policies or imposing censorships (direct, indirect,\npolitical, moral, commercial).\n\n3) Media concentration, centralization, globalization.\nRef. Patrick, 2013, p. 29-45 8\n\nImage is in the public domain.\n\nCreating the illusion of democracy, participation and\nconsensus (polling, surveys, marchings, crowds, mass\nspectacles, slogans, uniforms, etc.) and inviting people\nto join those on the road to victory, in order to provoke\na contagion effect.\n\nAmerican politicians\nCourtesy of EL Gringo on flickr. Used with permission. License CC-BY-NC-SA.\n\nAppealing to the people's values, common\nknowledge and stereotypes or making them\nbelieve that they are threatened.\n\nUsing generalities to describe complex phenomena\nwhile masking nuances and differences (stories, myths,\nparables, stereotypes, anecdotes, slogans, visuals,\ngraphics, etc.).\n\nReinforcing oppositions (good/evil, rich/poor,\nblack/white, liberal/conservative, west/east,\nterrorism/civilization, men/women,\ncapitalist/communist, etc.).\n\nEntrance of Auschwitz-Birkenau\nconcentration camp\n\nCourtesy of Chris Brown on flickr. Used with permission. License CC-BY.\n\nTwisting the facts in favour of the propagandist without\ndirectly lying. Embellishing or aggravating reality by\nshowing only one aspect of it or by presenting it from a\ncertain angle.\n\nReplacing an expression by another to empty its\nmeaning or emotional charge. Using euphemisms such\nas negative growth, market correction, re-deployment,\nreorganization, collateral damage, etc. or dysphemisms\nsuch as clan, insurgents, person of interest, etc.\n\nMaking sure that a message is noticed and retained by\nusing attractive elements (sex, stricking symbols,\nhumor, graphics, etc.), novelty (controversies,\nconspiracy theories, revelations, forbidden elements,\nbuzzwords, trends, etc.) and by repeating it (branding,\nacronyms, slogan etc.).\n\nDisguising propaganda as news, talk shows, educative\nfilms, documentaries, scientific reports, government\nleaks, blogs, etc.\n\nUsing front organizations such as university research\ngroups or charity organizations in order to gain\nlegitimacy.\n\nEvoking the people's corporal needs (food, sex, shelter,\netc.), psychological needs (economic programs, lower\ntaxes, better neighbourhoods, etc.) or social needs\n(ready-made identities, patriotism, etc.) or making\nthem believe that they are threatened.\n\nTransforming a person into a symbol to make him/her\nseem virtuous, praiseworthy, admirable or crazy, evil,\ncriminal, violent, greedy, etc. (Lincoln, Hitler, Tojo,\nLuther King, Hussein, Bin Laden, etc.).\n\n(c) TIME. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nTransforming people into animals or objects (vermin,\nmachines, monsters, vultures, pigs, etc.) to make them\nless likeable and devalue their life.\n\nQuoting or showing celebrities, experts, consultants,\nrespected public figures or prestigious institutions to\nsupport a position and gain credibility.\n\nShowing evidences (statistics, facts, data, surveys,\nreports, logical arguments, scientific findings, economic\nindices, etc.).\n\nOmitting information that contradicts the\npropagandist's ideas, cause or regime.\n\nForcing relations between things, ideas, people or\ngroups, by juxtaposing several images, images and\ntexts, images and narration, etc.\n\nIntroducing false information, rumors and lies.\n\nAppropriating myths, cultural referents, collective\nfears, hopes or resentment, in order to serve the\npropagandist cause.\n\nCreating emotions and touch people's heart instead\nof stimulating reasoning and critical thinking.\n\nImage is in the public domain.\n\nVictims of the enemy states benefit from more\nsensitive media coverage than victims of the United\nStates and its allies (use of words such as 'genocide',\n'massacre', etc.).\n\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nForeign elections that are not supported by the US\ngovernment are depicted as 'sham', 'rigged', 'fraudulent',\n'imperfect', and elections that are supported by the US\ngovernment are depicted as 'encouraging', 'a step toward\ndemocracy', 'remarkable achievement' while flaws and\nfrauds are ignored.\n\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nWhen the United States are at war, American media:\n\n-\nhighlight the noble intentions of the US government (protecting the\npeople)\n-\navoid using terms such as 'aggression' to describe the US intervention\n-\nfail to report illegal actions (chemical attacks, policy of starvation, etc.)\n-\navoid questioning the government right to intervene\n-\nwhile demonizing the victims (focusing on US army casualties and war\nprisoners).\n\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nAmerican media are ignoring dictators that are\ninstrumental to the US government, while demonizing\ndictators that are not useful to the US government (use\nof words such as 'killer', 'war criminal', 'mass\nmurderer', 'dictator', etc.).\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nWhen it comes to national politics, American media are\nlimiting the debates to the terms defined by the two\nmain political parties and excluding issues that these\nparties agree on (unions, large defense budget, trade\nagreements, use of chemical, etc.).\n\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nFor local issues, media are ignoring polls that show\nopposition to issues on which major investors in political\nparties agree. Media coverage is often hostile to protesters\n(use of words such as 'all-purpose agitators',\n'troublemakers'), while downplaying the police provocation\nand violence (use of chemical weapons and rubber bullets).\n\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nMass media propagandize on behalf of the social\ninterests that control and finance them.\nRef. Herman & Chomsky, 2002\nImage is in the public domain.\n\nImage is in the public domain.\n\nDomenach, Jean-Marie. 1992. La propagande politique. Paris: PUF.\n\nHerman, Edward S. and Noam Chomsky. 2002. Manufacturing Consent. New\nYork: Pantheon Books.\n\nPatrick, Brian Anse. 2013. The Ten Commandments of Propaganda. London:\nArktos.\n\nRoland, Jon. 1998. \"Propaganda Technique\". Constitution Society. Website:\nhttp://www.constitution.org/col/propaganda_army.htm.\n\nTchakhotine, Serge. 1992. Le viol des foules par la propagande politique. Paris:\nGallimard.\n\nExamples of propaganda:\n- Triumph of the Will\n- Animated Soviet Propaganda\n- Why We Fight\n- The Eternal Jew\n- L'oeil de Vichy\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "CMS.701s15 Propaganda Survival Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/07a91bc5afb840228a010f7873c66506_MITCMS_701S15_SrvivalGuid.pdf",
      "content": "Propaganda Survival Guide\n\nBandwagon and Inevitable Victory: Creating the illusion of democracy, participation, and consensus with\npolling, surveys, marching, crowds, mass spectacles, slogans, uniforms, etc. Inviting people to join those on the\nroad to victory, in order to provoke a contagion effect.\n\nReflecting the values of the audience: Appealing to the people's values, common knowledge, and stereotypes\nor making them believe that they are threatened.\n\nSimplification: Using generalities to describe complex phenomena while masking nuances and differences\n(stories, myths, parables, stereotypes, anecdotes, slogans, visuals, graphics, etc.). Reinforcing oppositions\n(good/evil, rich/poor, black/white, liberal/conservative, west/east, terrorism/civilization, men/women,\ncapitalist/communist, etc.).\n\nDistortion: Twisting the facts in favor of the propagandist without directly lying. Embellishing or worsening\nreality by showing only one aspect of it or by presenting it from a certain angle.\n\nSemantic shifts: Replacing an expression by another to empty its meaning or emotional charge. Using\neuphemisms such as negative growth, market correction, re-deployment, reorganization, collateral damage,\netc. or dysphemisms such as clan, insurgents, person of interest, etc.\n\nCognitive penetration and stickiness: Making sure that a message is noticed and retained by using attractive\nelements (sex, striking symbols, humor, graphics, etc.), novelty (controversies, conspiracy theories, revelations,\nforbidden elements, buzzwords, trends, etc.) and by repeating it (branding, acronyms, slogan etc.).\n\nDistancing the message from its source: Disguising propaganda as news, talk shows, educative films,\ndocumentaries, scientific reports, government leaks, blogs, etc. or using front organizations such as university\nresearch groups or charity organizations in order to gain legitimacy.\n\nAddressing the audience's needs: Evoking the people's corporal needs (food, sex, shelter, etc.), psychological\nneeds (economic programs, lower taxes, better neighborhoods, etc.) or social needs (ready-made identities,\npatriotism, etc.) or making them believe that they are threatened.\n\nPersonalizing (Negatively or positively): Transforming a person into a symbol to make him/her seem virtuous,\npraiseworthy, admirable or crazy, evil, criminal, violent, greedy, etc. (Lincoln, Hitler, Tojo, Luther King, Hussein,\nBin Laden, etc.).\n\nDehumanizing: Transforming people into animals or objects (vermin, machines, monsters, vultures, pigs, etc.)\nto make them less likeable and devalue their life.\n\nAppeal to authority: Quoting or showing celebrities, experts, consultants, respected public figures or\nprestigious institutions to support a position and gain credibility. Showing evidence (statistics, facts, data,\nsurveys, reports, logical arguments, scientific findings, economic indices, etc.).\n\nConcealment: Omitting information that contradicts the propagandist's ideas, cause, or regime.\n\nAssociation: Forcing relations between things, ideas, people, or groups by juxtaposing several images, images\nand texts, images and narration, etc.\n\nDisinformation: Introducing false information, rumors and lies.\n\nRecuperation: Appropriating myths, cultural referents, collective fears, hopes or resentment, in order to serve\nthe propagandist cause.\n\nAppeal to the heartstrings: Creating emotions and touching people's hearts instead of stimulating reasoning\nand critical thinking.\n\nReferences\n\nDomenach, Jean-Marie. 1992. La propagande politique. Paris: PUF.\n\nHerman, Edward S. and Noam Chomsky. 2002. Manufacturing Consent. New York: Pantheon Books.\n\nPatrick, Brian Anse. 2013. The Ten Commandments of Propaganda. London: Arktos.\n\nRoland, Jon. 1998. \"Propaganda Technique\". Constitution Society. Website:\nhttp://www.constitution.org/col/propaganda_army.htm\n\nTchakhotine, Serge. 1992. Le viol des foules par la propagande politique. Paris: Gallimard.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Socialization and Intimacy in Digital Environments Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/ba9638c3851746cdafca7f26b77af3f0_MITCMS_701S15_Socializtion.pdf",
      "content": "Socialization and Intimacy in\nDigital Environments\n\nMotivations to use Facebook\n- Desire for sociality in itself\n- Desire to sustain connections with close ties\n- Desire to overcome the loss of distant and\nestranged ties\n- Desire to make some friendships more tangible\n- Desire to increase or enhance self-esteem and\npopularity\n- Desire to express or explore identities\n- Desire to overcome a negative offline identity by\nre-creating oneself online\n\nRef. Lambert, 2013\n\nMotivations to use Facebook\n- Desire to find a framework of belonging\n- Desire to conform\n- Desire to express pride or to get self-gratification\n- Desire to materialize memories\n- Desire to bridge and bond social capital\n- Desire for easy means of communication\n- Desire to be surprised, reminded or informed\n- Desire to spread information\nRef. Lambert, 2013\n\nCriticisms of Facebook\n1. Facebook encourages and normalizes a\npathological form of narcissism\n2. Facebook isolates people from meaningful\nrelations and true friendships\n3. Facebook is an inauthentic space where\npeople do not reveal their true selves\nRef. Lambert, 2013: 18-23\n\nMisconception\n'Virtual' World\n'Real' World\nOwn Norms\nOwn Norms\nOwn Rules\nOwn Rules\nOwn Signs\nOwn Signs\n\nMy Conception\n'Virtual' World\n'Real' World\nNorms\nNorms\nRules\nRules\nSigns\nSigns\n\nFriendship\nAuthors who criticize Facebook tend to evaluate\nonline friendship on the basis of traditional\ncriteria:\n\n- Shared interests\n- Mutual trust\n- Revelation of intimate details\n- Physical proximity\n\nFriendship\nCriterion #3: Revelation of intimate details\n\nFriendship is a private emotionally\nexpressive bound that is precious in the\ncontext of globalization (Giddens, 1991).\n\nFriendship is a relation constructed around\nintimate disclosure and a safe haven against\ncompetitiveness in our urban and\nindustrialized societies (Jamieson,1998).\n\nRef. Lambert, 2013: 19-23\n\n-\n-\n-\n\nFriendship\nCriterion #3: Revelation of intimate details\n\nIn the context of social networks, friendship\nshould be redefined outside of its bound to\nprivacy\nFriendship has not always been bound to\nprivacy throughout history\nFor Aristotle, friendship is public and political,\nbecause it cements civic order and society\n\nRef. Lambert, 2013: 26-28\n\nFriendship\nCriterion #3: Revelation of intimate details\n\n- The opposition between intimacy and public\nlife is a false dichotomy\n- The existence of social networks proves the\npossibility of public intimacy\n\nRef. Lambert, 2013: 26-28\n\nFriendship\nCriterion #3: Revelation of intimate details\n\n- In MMORPGs, sharing personal information is\nnot a condition to establish a friendship, but\nthe possible consequence of a friendship\n\nRef. Bonenfant, 2011: 220\n\n-\n-\n-\n\nFriendship\nCriterion #4: Physical Proximity\n\nPhysical presence and non-verbal communication\nare replaced by chat, emotes, avatar gestures that\nsignal online presence and communicate feelings\nOnline interactions are as \"real\" as physical\ninteractions since they generate tangible emotions\nIn MMORPGs, physical proximity is not a condition\nto establish a friendship, but the possible\nconsequence of online friendship\n\nRef. Bonenfant, 2011: 207-214\n\nSocialization\nSocial networks are not leading to social\ndeskilling, but forcing people to develop new\nsocial skills, such as:\n\n- bureaucratisation of social ties\n- Interpreting signs provided by the online\ncontext\n- presenting themselves and performing their\nsocial role online\nRef. Lambert, 2013: 12, 65\n\nSocialization\nSocial Performance: individuals who present\nthemselves to others \"tend to incorporate and\nexemplify the officially accredited values of the\nsociety.\" (Goffman, 1959: 35)\n\nDifferent social contexts require that we perform\ndifferent roles (Front regions = decorum / Back\nregions = step out of character) (Goffman, 1959)\n\nRef. Lambert, 2013: 37-39\n\nSocialization\nFacebook generates a new mode of \"narrative\nperformance\" that differs from Goffman's\nconception of social performances in many ways:\n\n- Users can see their own performance mirror\nback at them and edit it\n- Performances are subjected to an open-ended\nprocess of resignification\n- Some people may only observe performances\nwithout reciprocating\n\nRef. Lambert, 2013: 40-45\n\nSocialization\nAlso...\n- Romantic relationship status signifies that\ntwo persons are in a relationship, while inside\njokes and tags signify a friendship\n- People have to present themselves in front of\nmultiple audiences at the same time\n- People are not in total control of their self-\nperformance\n\nRef. Lambert, 2013: 42, 69, 74\n\nSocialization\nFacebook platform regulates the relationship\nbetween users by controlling:\n\n- how people give news (through status)\n- how people keep in touch (reading timelines)\n- how people give their approbation (with\nlikes)\n\nRef. Lambert, 2013: 127-130\n\nNarcissism\nScholars identify online behaviors with typical\ntraits of narcissisms, defined by psychologists as\nthe:\n\n\"highly inflated, positive but unrealistic self-\nconcept, a lack of interest in forming strong\ninterpersonal relationships, and an\nengagement in self-regulatory strategies to\naffirm [...] positive self-views\" (Ong and al. in\nLambert, 2013: 25)\n\nNarcissism\nThey tend to ignore that:\n\n- Many users are annoyed by trivial or overly\nemotional posts\n- Norms of self-disclosure are more permissive on\nFacebook.\n- What is culturally appropriated in terms of public\nself-disclosure keeps changing\n- Users are constantly negotiating this evolving\nsocial contract by controlling the flow of\ninformation\nRef. Lambert, 2013\n\nNarcissism\nThey also tend to ignore that:\n\n- Different Facebook users are negotiating\ndisclosure of information differently\n- In social networks, participation requires\nconstant self-presentation\n- Contemporary American culture blurred the\nboundaries between private and public life\nbefore the advent of social networks (with reality\nshows, talk shows, TV doctors)\nRef. Lambert, 2013\n\nSocialization\nThey finally tend to ignore that:\n\n- Not all users willingly accept the gaze of\ninvisible Facebook users\n- Failure to capture the attention of a Facebook\naudience can be felt as a lack of social\nrecognition\n- In our capitalist societies, the boundaries\nbetween subjects and objects are already\nblurred (self-branding)\nRef. Lambert, 2013\n\nPrivacy and Surveillance\nPrivacy is defined in the legal domain as:\n\n- the right to protect our \"domestic sphere from the\nstate and the media intrusion\", as well as the right to\ncontrol access to our personal information (Lambert,\n2013: 29)\n\nThe perception of what is private and public depends of\nthe cultural context:\n\n- \"Something considered public in relation to one realm\nmay be private in relation to another\" depending on\nthe \"norms of appropriateness\" (Nissenbaum in\nLambert, 2013: 36)\n\nPrivacy and Surveillance\nBehaviors that would be considered as stalking\nor as pathological voyeurism in the offline\nworld are socially accepted on Facebook.\n\nSkimming profiles and scrolling timelines\nbecame routinized behavior that only become\nmore self-conscious when curiosity drives us to\n\"spy\" on weak ties.\nRef. Lambert, 2013: 95-102\n\nPrivacy and Surveillance\nTraditional\nFacebook\nPanopticon\n\"Participatory Panopticon\"\nRef. Lambert, 2013: 17\nTwo circular diagrams of panopticons - one showing people being watched from the center and the other showing people observing each other.\nImage by MIT OpenCourseWare.\n\nPrivacy and Surveillance\nFacebook users are increasingly aware of\nprivacy risks, but are not concerned\nVS\nFacebook users are aware, concerned and\nactive to counteract privacy risks\nRef. Lambert, 2013: 30-31\n\nPrivacy and Surveillance\nFacebook users get used to privacy\nrisks after a while\n\nVS\n\nFacebook users become more sensitive to\nprivacy issues over time\nRef. Lambert, 2013: 33-36\n\nEmbodiment\nWidespread conception: offline world\nexperiences are embodied while online world\nexperiences are disembodied.\n\nTaylor's conception: avatars and users' profiles\nserve as the 'material' through which online\nembodiment occurs. (2006: 40-41)\n\nO\n\nf\n\n-\n-\n\nEmbodiment\nnline embodiment is however different than\nace-to-face embodiment:\nWhile the presence of a physical body is\nexperienced as constant, presence on\nFacebook must be continually reaffirmed\n(Lambert, 2013)\nAvatars' presence is more unstable than\noffline presence because of glitches and\n\"ghost state\" (Taylor, 2002: 41)\n\nIdentity\nTraditional definition: set of characteristics\nwhich allows the sameness, coherence and\ncontinuity of a person over time (static)\n\nPoststructuralist definition: social construction\nthat constantly evolves over the course of new\nlife experiences and under the influence of\nsocial norms that people interiorize and\nnegotiate (fluid)\n\nIdentity\nEarly studies on social networks: focus on\npeople's profiles and \"about me\" sections.\n\nLambert's studies on Facebook: focuses on\nhow identity emerges from social interactions:\n\"people who exist within and through\nconnections.\" (2013: 60)\n\nIdentity\nEarly studies on MMORPGs conceive avatars mostly as\nrepresentations of the player in the game environment.\n\nGee conceives customized avatar as a \"projective\nidentity\": the type of person that the player wants his\navatar to become. (in Waggoner, 2009: 15)\n\nTrepanier believes that the avatar is performative: it\nconstructs the identity of the player that it is supposed\nto represent. (2012: 150)\n\nTaylor believes that avatars alter our phenomenal body.\n(2002: 58)\n\nIdentity\nCriteria used to define someone's identity in the\nphysical world do not have the same importance\nonline:\n\nOFFLINE\nMMORPGs\n\n- Age\n- Performance\n- Race\n- Presence\n- Social class\n- Punctuality\n- Gender\n- Social interactions\n\nIdentity\nWidespread misconception: Internet users can\ncreate the online identities of their choice\n\nTends to ignore that:\n- identity experimentations are often contested\nin online spaces\n- most users don't take these experimentations\nseriously (identity tourism)\n- game systems limit the choices of features\nand align them with social norms\n\nRef. Taylor, 2002\n\nIdentity\nFacebook as a \"technique of the self\"\n(Bonenfant & Farmer, 2012)\n\nHupomnemata: a notebook used by Ancient\nGreeks not \"to reveal the hidden\" or the\n\"unsaid, but on the contrary to capture the\nalready said, to collect what one has managed\nto hear or read, and for a purpose that is\nnothing less than the shaping of the self\"\n(Foucault, Ethics: 210-211).\n\nD\nF\n-\n-\n-\nIdentity\nifferences between a hupomnemata and a\nacebook page:\nPeople are not the only author of their\nFacebook page\nPeople can easily compare their Facebook\npage with those of others\nFacebook is a rigid platform structured by\ncapitalist interests and social norms\nRef. Bonenfant & Farmer, 2012: 121-130\n\nBonenfant, Maude and Yanick Farmer. 2012. \"Je suis libre moi non plus\". Chap in Mobilisation de\nl'objet technique dans la production de soi, pp. 121-142. Montreal: PUQ.\n\nBonenfant, Maude. 2011. \"Pour un changement de paradigme\". Chap in Socialisation et\ncommunication dans les jeux video, pp. 205-225. Montreal: PUM.\n\nGoffman, Erving. 1959. The Presentation of Self in Everyday Life. New York: Anchor Book.\n\nLambert, Alex. 2013. Intimacy and Friendship on Facebook. New York: Palgrave Macmillan.\n\nTaylor, TL. 2002. \"Living Digitally: Embodiment in Virtual Worlds\". Chap in The Social Life of Avatar:\nPresence and Interaction in Shared Virtual Environments. London: Springer-Verlag.\n\nTrepanier-Jobin, Gabrielle. 2012. \"Mobilisation de l'avatar dans la (de)construction de l'identite de\ngenre\". Chap in Mobilisation de l'objet technique dans la production de soi, pp. 143-163.\nMontreal: PUQ.\n\nWaggoner, Zack. 2009. My Avatar, My Self. Jefferson: MacFarland & Company Inc.\nReferences\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "CMS.701s15 Stereotypes and Agency Lecture Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-701-current-debates-in-media-spring-2015/daf7941e00a4c12ae85f76dd2c8f839d_MITCMS_701S15_Stereotype.pdf",
      "content": "The term refers to:\nthe capacity of social agents to\nmake choices and act within the\nsystem constraints.\n\nThe term is used as:\nan alternative to 'freedom' and\n'liberty' which imply that social\nsubjects can escape power\nstructures and dominant\nideologies.\n\nImage is in the public domain.\n\nPsychology & Cognitive sciences\n\nBroad definition: Pictures in our head that condense,\nschematize and simplify our conception of the world.\n(Lippmann, 1922)\n\nNarrow definition: Conventional ideas of people who\nbelong to certain groups (race, nation, profession,\nclass, gender, etc.). (Schweinitz, 2011 and Perkins,\n1979)\n\nFilm studies, litterature & art\n\nBroad definition: Recurrent patterns of narration,\nplot structure, acting, visual style, music, etc.\n(Schweinitz, 2011)\n\nNarrow definition: Types of characters that are\ndefined by a limited set of characteristics and do not\nevolve throughout the story (Dyer, 1993)\n\nPROS\n\n- Facilitate cognition and\ncommunication (cognitive\nrelief)\n- Reduce the buzzing\nconfusion of the world\n(simplification)\n- Build consensus among\ncommunities\n- Create and maintain the\ngroup identities\nCONS\n\n- Standardize our perceptions\nof groups and people\n- Stabilize what is changing\n- Erase nuances and\ndifferences\n- Lead to judgements and\nintolerance\n- Replace critical thinking\n- Align our beliefs with\ndominant ideologies\n\nPROS\n\n- Help the audience to\nmake sense of media\ncontent and understand\nthe story\n- Increase chances to make\nprofit with a production\nCONS\n\n- Standardize productions\ninto ready-made\nformulae\n- Homogenize culture\n- Make viewers more\nintelorant towards\ninnovation\n\nRepetition\nDifference\nConservation zone\n(potential of denaturalization)\nInnovation zone\n(potential of denaturalization)\nEquilibrium zone\n(potential of naturalization)\nRef. Trepanier-Jobin, 2013\n\nRef. Trepanier-Jobin, 2013\nRepetition\nDifference\nConservation zone\n(potential of denaturalization)\nInnovation zone\n(potential of denaturalization)\nEquilibrium zone\n(potential of naturalization)\n\nRef. Trepanier-Jobin, 2013\nRepetition\nDifference\nConservation zone\n(potential of denaturalization)\nInnovation zone\n(potential of denaturalization)\nEquilibrium zone\n(potential of naturalization)\n\nRef. Trepanier-Jobin, 2013\nRepetition\nDifference\nConservation zone\n(potential of denaturalization)\nInnovation zone\n(potential of denaturalization)\nEquilibrium zone\n(potential of naturalization)\n\nDyer, Richard. 1993. \"The Role of Stereotypes\" and \"Seen to Be Believed\". Chap in The\nMatter of Images, pp. 11-51. London: Routledge.\n\nLippmann, Walter. 1922. Public Opinion. Minneapolis: Filiquarian Publishing LLC.\n\nPerkins, Tessa. E. 1979. Rethinking Stereotypes. Chap in Ideology and Cultural\nProduction, pp. 135-159. London: Croom Helms.\n\nSchweinitz, Jorg. 2011. Film and Stereotype : A Challenge for Cinema and Theory. New\nYork: Columbia University Press.\n\nTrepanier-Jobin, Gabrielle. 2013. Le role de la parodie dans la denaturalisation des\nstereotypes de genre. PhD Thesis. UQAM:\nhttp://www.archipel.uqam.ca/6435/1/D2619.pdf\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.701 / CMS.901 Current Debates in Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}