{
  "course_name": "Current Events and Social Issues",
  "course_description": "The goal of this seminar is to have open discussions of controversial political and social issues and raise awareness of current world events in an informal setting. Discussions for the first part of each class will focus on current events from that week, while in the second part of class students will discuss a scheduled issue in greater detail. Scheduled issues include the wars in Iraq and Afghanistan, the regulation of marijuana, how our society should punish criminals, genocide in Rwanda and Sudan, discrimination in our society today, the future of social security, whether pornography is sexist, and where we can go from here in the Arab/Israeli Conflict. Discussions will be supplemented by readings, films, and public speakers. Students will also be encouraged to read news media from around the world.",
  "topics": [
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Sociology",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Sociology"
  ],
  "syllabus_content": "This course, as part of the\nExperimental Study Group\nSeminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Students Claudia Gold (B.S. 07 Political Science) and Jocelyn Rodal (B.S. 06 Literature) taught this seminar in cooperation with Dr. Lee Perlman, Lecturer in the Experimental Study Group. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nCourse Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nWelcome to Current Events and Social Issues. Our goal in this seminar is to have open discussions of political and social issues and to raise awareness of current events in an informal setting. We are hoping to have students from a variety of political persuasions. We want you to feel free to disagree with our own political opinions, which for the sake of openness we will not keep secret.\n\nFor the first part of each meeting, our discussion will focus on current events from that week. The second half will be supplemented by readings, films, and guest speakers. Students are expected to read the news from multiple sources every day of the week, and we encourage you to read news media from around the world.\n\nCourse Calendar\n\nWEEK #\n\nTopics\n\nIntroduction and Political Systems of Thought\n\nWhat is a just war? Were the wars in Iraq and Afghanistan just?\n\nWhat is a just war? Were the wars in Iraq and Afghanistan just? (cont.)\n\nIs pornography sexist? Should it be regulated?\n\nHow should we treat criminals? What constitutes \"cruel and unusual\" punishment?\n\nShould we legalize marijuana? How should we treat other drugs?\n\nWhat is the future of Social Security?\n\nGuest Speaker: Toh Ne Win from Goldman Sachs\n\nIn what forms does discrimination exist in our society today? Should the government step in to stop discrimination?\n\nIs outsourcing of jobs a problem? If so, what should we do?\n\nThe Arab-Israeli Conflict: Where can we go from here?\n\nShould abortion be regulated?\n\nGenocide in Rwanda and Sudan: How should we react?\n\nIs it ever right to break the law?",
  "files": []
}