{
  "course_name": "D-Lab: Energy",
  "course_description": "D-Lab: Energy offers a hands-on, project-based approach that engages students in understanding and addressing the applications of small-scale, sustainable energy technology in developing countries where compact, robust, low-cost systems for generating power are required. Projects may include micro-hydro, solar, or wind turbine generators along with theoretical analysis, design, prototype construction, evaluation and implementation. Students will have the opportunity both to travel to Nicaragua during spring break to identify and implement projects.\nD-Lab: Energy is part of MIT’s D-Lab program, which fosters the development of appropriate technologies and sustainable solutions within the framework of international development.\nThis course is an elective subject in MIT’s undergraduate Energy Studies Minor. This Institute-wide program complements the deep expertise obtained in any major with a broad understanding of the interlinked realms of science, technology, and social sciences as they relate to energy and associated environmental challenges.",
  "topics": [
    "Energy",
    "Engineering",
    "Electrical Engineering",
    "Electric Power",
    "Science",
    "Earth Science",
    "Sustainability",
    "Society",
    "The Developing World",
    "Energy",
    "Engineering",
    "Electrical Engineering",
    "Electric Power",
    "Science",
    "Earth Science",
    "Sustainability",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nLabs: 1 session / week, 3 hours / session\n\nCourse Aims\n\nEnergy literacy\n\nKnowledge of energy usage and challenges in developing regions\n\nReal-world capability to design, build, implement, and evaluate off-grid energy systems\n\nCourse Objectives\n\nHave physical intuition for different energy sources and associated units.\n\nUnderstand the engineering principles behind and have direct hands-on experience with a variety of energy technologies common in developing regions (e.g., biomass-based cooking fuels, diesel generators, micro-hydropower, solar photovoltaics, small wind turbines, etc.).\n\nEvaluate the utility and trade-offs for different energy options in a multi-objective environment, including system-level considerations.\n\nUnderstand the practice of design for the other 90% including consideration of local adaptability and socio-economic impacts.\n\nDesign & build simple, off-grid energy system using co-creation with local stakeholders.\n\nCourse Structure\n\nThe course is comprised of three sections based on the aims and objectives described above.\n\nDuring the first seven weeks, the focus of lecture and lab sessions will be a hands-on experience developing energy literacy, knowledge of energy usage and associated challenges in developing regions, and the capability to build, model, and analyze off-grid energy systems.\n\nDuring spring break, students will have the opportunity to travel to Nicaragua and El Salvador to learn first-hand about energy in a developing country, implement small projects or trainings, and identify larger projects to be worked on in the remainder of the class and beyond. This trip is entirely optional and not a formal, credit-bearing part of the class, but highly recommended. Students are expected to contribute $500 toward the cost of the trip; if that amount is prohibitive due to a financial hardship, you should make an appointment with Amy Banzaert to discuss.\n\nFor the remainder of the class, students will implement projects in conjunction with their community partners in Nicaragua and El Salvador. There will be one formal design review associated with the project; final presentations both in class and then in the group presentations for all\nD-Lab classes\nat the end of the term.\n\nCredit & Grading\n\nD-Lab Energy\nis a 12-unit undergraduate class: 3 hours/week in lecture, 3 hours/week in lab, and 6 hours/week on homework, readings, language, and design projects. Your presence and attendance in class is essential: every session will involve in-class activities that are very difficult to replicate or make up outside of class.\n\nThis seminar is graded on an A/B/C/D/F basis; furthermore it is a class where your work is impacting the lives of people in Nicaragua and we expect an appropriate level of commitment.\n\nCOURSE WORK\n\nGRADE WEIGHTS\n\nCourse engagement (attendance, participation in both in-class and online activities)\n\n25%\n\nAssignments (readings, homework, labs)\n\n25%\n\nQuizzes\n\n20%\n\nDesign project (10% final prototype & report, 10% participation, 10% assignments)\n\n30%\n\nReadings\n\nRequired text: [Polak] = Polak, Paul.\nOut of Poverty: What Works When Traditional Approaches Fail\n. Berrett-Koehler Publishers, 2008. ISBN: 9781576754498\n\nOther readings will be assigned for individual topics and class sessions.\n\nHablamos Espangles\n\nBecause we will be traveling to Nicaragua and El Salvador over spring break and working with Spanish-speaking community partners, it is important that all students know at least a tiny bit of Spanish. If you don't speak Spanish fluently, you should plan to spend no less than 20 minutes/week working on your Spanish. We recommend\nCoffee Break Spanish\n, a free podcast for beginners to intermediate speakers (starting at whatever week seems like it matches your skill), or\nShow Time Spanish\n, a free podcast for more advanced speakers. Each show is 15-20 minutes long. 20 minutes/week won't get you very far, so if you can sneak in more, please do so (with the podcast format, it's easy to listen while walking around campus).\n\nIn addition, we will speak \"Spanglish\" in\nD-Lab Energy\n. The usage will be very basic and relatively infrequent but will give a taste of Spanish. Students who speak Spanish well are encouraged to help everyone else in the class (including instructors!) improve their Spanish.\n\nMuddy Cards\n\nAfter each class, students will submit \"muddy cards\" to request more discussion or clarification, and to provide frequent and timely feedback to the instructors. This reference gives background about the goals and methodology of using muddy cards:\n\nWorldwide CDIO Initiative.\nMuddiest Point in the Lecture (Muddy Cards)\n(PDF)\n\nGuidelines for Project Work During 2\nnd\nHalf of Term\n\nThere will be a lot of \"free\" time in class for project work. You still need to come to class on time and work for the entire time; instructors and mentors will be stopping by regularly to meet with your team and help you. If you will not be working in the classroom, you should leave a note on the classroom whiteboard stating where your team will be and including a cell phone we can use to track you down if need be.\n\nWiki Design Notebook\n\nEach week, your team should update your team's Wiki page.\n\nDesign Review\n\nYour design review will include 10 minutes to present your project, and then 15 minutes for discussion and questions. You should bring and demonstrate your working prototype.\n\nFinal Presentations\n\nThe final presentation session will consist of three parts: A 1 minute presentation, a poster session, and finally a 20 minutes design review (10 minutes of presentation followed by 10 minutes for discussion). You should bring a working, good-looking prototype for demonstrations.\n\nCalendar\n\nPart 1: Foundations - Lectures and Labs\n\nWEEK #\n\nCLASSES\n\nLABS\n\nASSIGNMENTS DUE*\n\nLecture 1. Introduction: Energy, units, estimation, energy usage world-wide\n\nLab 1. Human Power\n\nProblem Set 0 (Lantern)\n\nLecture 2. Energy storage & micro grids\n\nInitial trip planning\n\nLab 2. Energy Storage\n\nReading reaction\n\nProblem Set 1\n\nLab 1 write-up\n\nTrip project survey\n\nLecture 3. Lighting\n\nCommunity partner introduction\n\nLab 3. Biogas & biodiesel lecture & construction\n\nProblem Set 2\n\nLab 2 write-up\n\nLecture 4. Solar thermal & PV\n\nQuiz I\n\nLab 4. Solar panel construction, installation, and operation\n\nReading reaction\n\nCommunity partner outreach\n\nLecture 5. Wind & micro-hydro\n\nTrip planning\n\nLab 5. Savonius wind turbine construction & testing\n\nReading reaction\n\nProblem Set 3\n\nLab 4 write-up\n\n1st brainstorm pictures\n\nLiterature search\n\nLecture 6. Cooking, stoves, & fuel\n\nBiogas digester testing\n\nLab 6. Charcoal making & stove testing\n\nReading reaction\n\nLab 3 and Lab 5 write-ups\n\nInitial project specifications\n\n2nd brainstorm pictures\n\nMaterials list for trip\n\nLecture 7. Trip plan presentations\n\nTrip preparation\n\nLab 6 write-up\n\nRevised project specifications\n\nRevised 2nd brainstorm pictures\n\nTrip questions\n\nSpring break trip to Nicaragua and El Salvador community partners\n\n* Assignments are due each week on the Lab day unless otherwise noted. Students should anticipate spending 6 hours per week on assignments, including listening to no less than one ~20-minute Spanish podcast/week.\n\nPart II: Project Work\n\nWEEK #\n\nCLASS TOPICS & PROJECT WORK\n\nProject Milestones\n\nLecture 8. Design Process\n\nTrip presentations, project evaluations\n\nTeam formation & brainstorming\n\nTrip report\n\nSelect project\n\nTeam roles assigned\n\nQuiz 2\n\nLibrarian visit\n\nExperimentation overview\n\nConcept review\n\nWiki Design Notebook report: best brainstormed ideas, Pugh charts\n\nProject specifications due\n\nSystem-level design\n\nSystem spec review\n\nWiki Design Notebook report: sketch models & experimentation\n\nDetailed design and build\n\nInitial design review presentations\n\nCritical design review with initial working prototype\n\nWiki Design Notebook report\n\nTesting and refinement\n\nWiki Design Notebook report\n\nTesting and refinement\n\nFinal design review presentations\n\nFinal presentation and review at the D-Lab Showcase\n\nProduction ramp-up\n\nFinal project report & team assessment",
  "files": [
    {
      "category": "Resource",
      "title": "Barrel on Fire",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/e39f6e11e20a4ab9c3d0adfd836c580e_MITEC_711S11_proj_rptfire.pdf",
      "content": "Barrel on Fire,\nCharcoal Desire\nD-Lab: Energy (SP.775)\nSpring 2011\n\nJessica Artiles\nVivian Dien\nKurt Tsuo\n\nI. Abstract\n\nCharcoal made from agricultural waste is a source of fuel that does not require\ndeforestation and has an energy density that is comparable to other cooking fuels\ncommonly used in developing countries. However, the process of making this charcoal\nprovides some safety risks and uncomfortable exposure to heat. By placing the barrel of\nburning waste on a dugout with air channels rather than mounting it on bricks, the risk of\nthe barrel toppling can be eliminated. To allow the waste to carbonize, the air channels can\nbe sealed from a distance using metal sheets, which reduces heat exposure.\n\nTo maximize the metal seals' ease of usage, several designs were tested.\nExperiments were also conducted to ensure that high quality charcoal could still be\nproduced with the dugout and metal seal solution. The possibility of insulating the barrel\nwith different materials was investigated to provide suggestions for future work on heat\nreduction during the charcoal making process.\n\nII. Problem Statement\n\nFrom March 20, 2011 to March 26, 2011, we traveled to a small rural community in\nnorthern Nicaragua called Sabana Grande. We collaborated with Las Mujeres Solares de\nTotogalpa (Solar Women of Totogalpa), a cooperative dedicated to promoting the use of\nrenewable energy technologies in the community. They operate in liaison with the\nNicaraguan-based non-profit organization, Grupofenix, and the Alternative Energy\nProgram of the National Engineering University of Nicaragua.\n\nOur time spent working with these women was aimed at understanding the existing\nenergy needs of the community in hopes of gaining perspective on how we could make a\nrelevant contribution. As a team, we demonstrated the process of making agri-waste\ncharcoal. The women have high hopes for the success of this charcoal in their community as\nan alternative to cooking over wood fires as well as a viable business tool for their up-and\ncoming \"Solar Restaurant.\"\n\nAfter two successful burns, the third burn was problematic. The Women did not\ncoordinate when dismounting the barrel from the bricks. During this \"tip-and-kick\"\nmethod, one woman pushed the barrel in one direction and the second woman kicked the\nbarrel out from under it directly making it fall on her (See Fig. 1).\nWe recognized the Women were still a long way from feeling comfortable enough\nwith the charcoal burn to use it at high production levels for their restaurant. The Women\ntold us that \"The burn is the most difficult [part] especially covering the barrel. It gets so\nhot which means that we cannot bathe afterwards with the normal cold water, as it will\nmake us sick.\" And, when asked what we focus our project on, they asked that we \"work\nwith the barrel, making some sort of insulation so that it wouldn't feel so hot.\"\n\nFigure 1 - The barrel of burning biomass toppling over from poor coordination\n\nWith this feedback, we focused our attention on improving the safety risks and the\nheat exposure of the charcoal making process. After many iterative design cycles, our final\ndesign was sent to the Women for their testing and feedback. Ultimately, our design was a\nsuccess with the women and has brought down the barriers of charcoal implementation\nthey once had. Figure 2 depicts our involvement with charcoal making and the influence\nour work has had with the Women.\n\nFigure 2 - Our team's involvement with charcoal and its influence on the Women of Totogalpa\n\nIII. Design Specifications\n\nOur project scope was very dynamic, since this was the first anybody had tried to\naddress these safety and heat issues in the charcoal making process. Although it was\nunclear what solution would solve both the safety and heat issues, there were certain\ndesign specifications that our solution would have to meet. The design specifications\nbelow in Table 1 were crafted as the qualities of a good solution. We considered these\nspecifications at each stage of our design process to make sure to keep our designs aligned\nwith our ultimate goals.\n\nIn drafting our design specifications, we had to be sensitive to the fact that the\ncharcoal process is such a subjective one that requires qualitative measurements to\nproduce the best charcoal. We were careful not to make the charcoal process scientifically\nmore complex than it already is since most of the Women lack a technical background.\nSpecifications like cost, maintained burn quality, and ease of use needed to be prioritized\nsince they were already limited motivation for charcoal making before our solutions.\n\nTable 1 - Design specifications\nCustomer Need\nProduct\nAttribute\nSpecs- Metric\nSpecs- Unit\nSpecs- Value\nDecrease # of\npeople needed to\ntend to drum\nLess Manpower\nTime\nMan hours\n< Current (1\nWoman hour\nCost\nCheap\nMoney\nCordoba\nProfitable\nDurable\nHeat Resistant\nThermal\nresistance\nK/m^2\n>0\nCan be left\noutside\nWeather-\nresistant\nCoated/rust-\nresistant\nBinary\nYes\nEase of Use\nAll handling\nparts easy to use\nForce\nNewton\n\nRepairable\nLocal materials\nused & simple\ndesign\nDistance to\nsupplier\nKm\n<20\nNeeds to be safe\nChildproof\n\nEqual or\nincreased burn\nquality\nCharcoal yield\nWeight\nKg\n>3.6\nCharcoal quality\nTime to\nlight/duration\nMinutes\n<5\nDecrease\nexposure to\nheated barrel\nLess manpower\nTime\nMan Hours\n< Current\n\nIV. Brief Review of Design Concepts Considered\n\nFour categories of design concepts were considered to solve the issues of heat exposure\nand safety risks to the user:\n\n1. Sheath\nThe concepts in this category of designs all entail type of sheath that seals off the airflow to\nthe bottom of the barrel, which is still sitting on top of bricks a few inches above ground.\nOne example is a sheath that encircles the entire barrel, sitting around the barrel while\nairflow is required and sliding down to the ground to seal the barrel once airflow is no\nlonger required.\nProblems: Too expensive to construct a large, barrel-encircling sheath out of sheet\nmetal. It was too difficult to create an airtight seal using only the sheath.\n\n2. Handles\nThese designs call for 2-3 handles that are attached to some part of the barrel through a\ngripping mechanism. The handles can then be used to more safely maneuver the barrel off\nthe 3 supporting bricks when the airflow needs to be sealed, and the sealing process can be\ndone at a distance. For instance, if two handles are located directly across from each other\n(180 deg.) on the outside of the barrel, then using two long sticks, two users could lift the\nbarrel in between them (with the sticks lifting the handles), off the bricks, and onto a flat\nsurface to seal it.\nProblems: Metal for the handles is expensive. It was difficult to find an appropriate\nattachment mechanism to the barrel that can withstand multiple thermal cycles and\npossible rusting.\n\n3. Rotating Disk\nThis concept involves having a sliding disk that covers the air holes punched out from the\nbottom of the barrel. The disk sits right up against the bottom of the barrel and has the\nsame holes as the barrel so that air can flow through when the holes are aligned. Then, to\nseal the barrel, the user can turn a handle attached to the disk, sliding the solid portions of\nthe disk over the barrel as the disk rotates in place. The disk is attached to the bottom of\nthe barrel through some kind of clasping mechanism.\nProblems: In order to seal the bottom of the barrel, the disk must be held up very\nclose to the bottom of the barrel but still be able to rotate in place. This calls for a\ncomplicated attachment mechanism, which would be both costly and likely to break\nwhen the barrel is being handled.\n\n4. Radiation Shields\nThis design concept grew out of our experimentation, which showed that most of the heat\nemanating from the burning barrel takes the form of thermal radiation and not convection.\nAs such, we considered radiation various radiation shields as a way of reducing heat\nexposure. Two shields that were considered were wrapping the barrel in multiple rolls of\neither aluminum window screening or steel mesh.\n\nProblems: The two tested materials did not decrease radiation enough to justify\ntheir cost. Wrapping the barrel 6 times in either material only decreased radiation\nby 40% relative to the emittance of a naked radiation source.\n\nV. Experimentation\n\nExperimentation occurred across three areas that all contributed to our final design in\ncrucial ways:\n\n1. Dug-out Testing:\n\nBefore settling on the final dug-out design, we experimented with three designs and\nassessed each across four factors:\n- Cost - is the design costly?\n- Load Bearing Capacity - can the design hold the weight of a loaded barrel?\n- Durability - is the design durable to multiple thermal cycles and constant removal\nand re-placement of the barrel?\n- Other Factors\n\nHow each design measured up on each factors is not, strictly speaking, entirely the result of\nour own experimentation (for instance, cost). However, when experimenting with building\nand using these designs, we took all of these four factors into account at the same time, so\nthey are all included here together.\n\nTable 2 shows experimentation results and Fig. 3 shows pictures of all three designs.\n\nTable 2 - Experimentation results\nDesign\n\nCost\nLoad-Bearing\nCapacity\nDurability\nOther Factors\nCross-shaped dug\nout\nLow, no bricks\nrequired\nSufficient\nPossible erosion\nof soil\nPossibly\nsacrilegious\ndesign\nCircular dug out\nwith three dirt\nchannels\nLow, no bricks\nrequired\nSufficient\nPossible erosion\nof soil\n\nCircular dug out\nwith three brick-\nlined channels\nSix bricks\nrequired, but cost\nstill low relatively\nspeaking\nSufficient\nNo worry of\nerosion because\nbarrel is sitting\non the bricks\n\nFigure 3 - Counter-clockwise from top right: Circular dugout with 3 dirt channels, Cross-shaped dugout,\nand circular dugout with 3 brick-lined channels\n\nAs a result of experimentation, we settled on the last design because we felt that the\ndurability consideration was most important, and the cost of bricks was negligible.\n\n2. Metal Seals Testing:\n\nThe metal seals for sealing the air channels varied in four ways, each of which we tested by\nassessing (1) the ease with which that design characteristic could be constructed and (2)\nthe degree to which it affected the experience of using the plate to seal the barrel:\n- Type of sheet metal\n- Size of plate\n- Type of handle\n- Type of edge\nThe following table shows the qualitative results of experimenting with both the\nconstruction and usage of plates with the different design characteristics:\n\nTable 3 - Design characteristics of Metal Plate Seals\nCharacteristic\nSpecific Design Choice\nConstruction Considerations\nUser Considerations\nType of sheet\nmetal\nThin\nCan be cut with just shears.\nAvailable in Sabana Grande.\nLightweight\nThick\nCannot be cut with just shears;\nrequires heavy machinery.\nHeavy\nSize of plate\n10\" length, 10\" width\nCan be cut with just shears.\nAvailable in Sabana Grande,\nUse less material\nToo small to cover bricks\nand air channel\n13'' length, 12'' width\nCan be cut with just shears.\nAvailable in Sabana Grande,\n\nCould sacrifice width\n13'' length, 14'' width\nCan be cut with just shears.\nAvailable in Sabana Grande,\n\nCould Sacrifice width\n16'' length, 14'' width\nCannot be cut w/ shears\nToo heavy\nType of handle\n90 deg. to plate\nRequires multiple spot welds\nImpossible to lift; very\ndifficult to maneuver\n45 deg. to plate\nRequires multiple spot welds\nDifficult to lift or\nmaneuver\n45 deg. to plate + lipped\nhandle\nRequires multiple spot welds\nEasiest to lift given the\nlips on the handle pieces,\nstill hard to maneuver\nCylindrical\nDoes not require welding, only\nriveting\nVery easy to lift and\nmaneuver\nType of edge\nTriangular\nEasy to cut\nSame as semi-circular\nSemi-Circular\nHard to cut into exact semi-circle\nSame as triangular\n\nIn Table 3, the specific design choices that are part of the final design are bolded.\n\nFigure 4 - Plate with a spot-welded handle that sits 45 deg. to the plate, with a semi-circular edge.\n3. Heat Insulation Testing\n\nIn order to test whether the heat from the barrel came from thermal radiation or\nconvection, we covered part of the barrel with tin foil (a radiation shield) and felt around\nthe barrel. The heat was greatly reduced relative to the un-covered barrel. Then, to test\nfor convection, we lit a cigarette next to the bottom of the mounted barrel. The smoke from\nthe cigarette flowed toward the barrel regardless of where we held it, indicating that cool\nair was being drawn into the barrel, away from the user, and no hot air was flowing out\nfrom underneath the barrel toward the user.\n\nIn order to test radiation shields, we set up an experiment with a thermopile. The details of\nthe experimental set-up and the results (tabular and graphical) are below:\n\nExperimental Set-up: Turned on a hot plate with a thermal mass over it. Measured the\nheat of the hot plate using a data logger and thermocouple; readings showed that the\ntemperature of the hot plate was constant within a few degrees throughout the course of\nthe experiment (95C - 106C). Attached a thermopile to a voltmeter, and taped the reader\nto the top of a brick. Experimenter placed the brick-thermopile apparatus in the same\nlocation on top of the thermal mass for each reading so that the thermopile was always\nreading in the same spot, regardless of the type or quantity of radiation shield being used.\nThe brick-thermopile apparatus would sit on top of the radiation shields. The thermal was\nthen recorded off the voltmeter in millivolts.\n\nFigure 5 - Left: TPS 334 Thermopile; Right: Thermopile mounted on foam and connected to voltmeter\n\nFigure 6 - Thermopile setup mounted to brick and set over very crinkled foil; entire setup on top of\nhotplate\n\nTable 4 - Experimentation results\nRadiation Shield\nThermopile reading\nTrial #1 (mV)\nTrial #2 (mV)\nNothing\nFoil - slightly crinkled\nFoil - very crinkled\nAluminum Screening - 1 layer\nAluminum Screening - 2 layers\nAluminum Screening - 3 layers\nAluminum Screening - 4 layers\nAluminum Screening - 5 layers\nAluminum Screening - 6 layers\nAluminum Screening - 7 layers\nMetal Mesh (.25'' holes) - 1 layer\nMetal Mesh (.25'' holes) - 2 layers\nMetal Mesh (.25'' holes) - 3 layers\nMetal Mesh (.25'' holes) - 4 layers\n\nMetal Mesh (.25'' holes) - 5 layer\nMetal Mesh (.25'' holes) - 6 layers\n\nFigure 7\n\nWe concluded that the if six layers of aluminum screening or steel mesh could not even\nreduce the heat by 40% (See Fig. 5), then it would not be worthwhile to use either material\nas a radiation shield.\n\nVI. Design Description\n\nIn the charcoal making process, an alternative method can be used for the barrel\nsetup. Rather than mounting the barrel on top of three bricks, this alternative method\nallows the barrel to rest at ground level and does not require the barrel to be dismounted\nduring the burn. This alternative method involves a circular dugout with three air channels,\nas well as metal seals that are used to cover the air channels.\n\nCircular dugout\n\nThe barrel sits at ground level above a circular dugout that is 4\" deep with a slightly\nsmaller circumference than the barrel. This allows the barrel to create a seal with the\nground. There are three channels that extend from the dugout and two bricks are mounted\nin each channel to provide a level surface upon which the barrel stands. When the barrel is\nresting on top of the dugout, the area of channel exposed must be large enough to allow the\nnecessary amount of airflow to reach the biomass through holes in bottom of barrel. The\nholes in the bottom of the barrel that we worked with had a total area of about 72 sq. in.\nBetween the three air channels, each channel would have to expose 24 sq. in. It was\n-20.00%\n0.00%\n20.00%\n40.00%\n60.00%\n80.00%\n100.00%\nPercentage of Heat Reduction\nNo. of Layers\nEffect of Radiation Shielding on\nHeat Reduction\nAluminum Screening\nMetal Mesh\nFoil slightly crinkled\nFoil very crinkled\n\nconcluded that each channel needed to be roughly 6 in. measured radially from the barrel,\nand 4 in. across (see Figure 8).\n\nFigure 8 - Circular dugout with (right) and without (left) the barrel on top\n\nMetal Seals\n\nThree separate metal seals are needed to seal the three air channels. Each seal is\npentagon shaped (OǤͳͲʒʒato the\nbottom are both 6ʒʒͷǤͶʒʒǤThe handle is cylindrical and is\nattached to the bottom edge of the seal. The cylindrical handle has a height ʹʒʒ\nʹǤͷʒʒǤ\n\n6''\n5.4'\n2.5'\n2''\nFigure 9 - Final product: pentagonal metal seal w/ cylindrical handle\n\nProcedure for Making the Metal Seal\n\n1. ͳͲʒʒa\ncutting metal.\na. Mark ʹʒʒ in from the edge of one side of the square and draw a line so that a\nͳͲʒʒʹʒʒ for the handle. ͵Ǥͷʒʒa\nʹǤͷʒʒa\nat which the handle and the seal are attached.\n2. At the opposite end of the square, mark the midpoint. On the two adjacent sides of\naʹʒʒǤ\nmidpoint of the one end of the square to the mark made on each adjacent side. This\nshould create the pointed end of the seal.\n3. Cut along the lines marked for the pointed end of the seal. Also cut along the two\n͵ǤͷʒʒǤ\n\n4. aͲǤͷʒʒǤ around\nand rivet them together to create a circular handle.\n\n2''\n3.75''\n3.75''\n2''\nFigure 10 - Metal seal w/ measurements before handle is\nconstructed\n\nFigure 11 - Bending and riveting the sheet metal to create the handle\n\n5. Bend the entire handle up to form about a 45° angle with the plane of the seal.\n\nWhen the barrel is ready to be cut off from airflow, the users can use the back of shovel,\nbroom, or even the stick used to create the chimney in the biomass to move the metal seals\ninto place. They are pushed right in between the barrel and the bricks, and then later\nsealed with sand for additional airtightness.\n\nFigure 12 - Metal seals inserted between bricks/ground and the barrel\n\nThis design was chosen because the shape is simple enough to create with metal\nshears, assuming that the sheet metal is thin enough. Only one piece of sheet metal is\nneeded, and there is no need to weld the metal. Many other developing communities in\ndeveloping countries have the capabilities of riveting. The pointed edge allows for easier\ninsertion into the air channel and the angled handle allows for a more natural movement\nfor the user.\n\nVII. Assessment\n\nOur final design meets most of design specifications we set for our project in the\nbeginning and actually improves the process in a few ways that we had not originally\n\nconsidered. With the previous method, at least two people are required to dismount the\nbarrel from the bricks. The dugout and metal seal solution only requires a single person to\npush all three metal seals under the barrel. This can be done in an amount of time that is\ncomparable to the time it takes to dismount the barrel using the tip and kick method. This\nsolution also meets the safety specification because there is no need to move or handle the\nbarrel while the biomass is on fire. Heat exposure is also reduced because the seal can be\nmade from about 1 meter away, and flames are no longer being emitted from the bottom of\nʒǤ\n\nThe construction of the metal seals is feasible in developing countries, and\nparticularly so for the Mujeres Solares. Sheet metal is readily available to them because it is\na material that is also used in the construction of their solar ovens. It costs about $8 for a 3\nft. x 12 ft. sheet. They are also able to rivet metal together, which is a technology that is\nneither bulky, complicated, nor does it require electricity.\n\nProducing a similar quality of charcoal as the previous method is perhaps the most\nimportant specification for us to meet. In our experimentation, we were able to produce\ncarbonized material that was not too ashy, and could make acceptable briquettes.\n\nFigure 13 - Parts of the charcoal making process that we were able to improve\n\nVIII. Community Partner Feedback\n\nOur team was fortunate enough to maintain communication with the women\nconstantly throughout our design process. We asked them for costs and descriptions of the\n\nmaterials locally available to them in order to do a near-realistic cost analysis of barrel\ninsulation options. We compiled a document of our final instructions with on how to make\nthe dugout and the simple concept behind the sheet metal seals. We left out specific\ninstructions on how to make the sheet metal seals in order to allow for their creativity of\ndesign. As expected, they designed a seal of sheet metal (Figure 14) different from ours and\nlater mentioned they already had second designs in line for a second draft of sheet metals.\n\nFigure 14 - The metal seal the Women used that did not include handles\n\nThey followed our instructions in making the dugout for the barrel and successfully\ncarried out a charcoal burn. Their comments, below, were very encouraging to our design\nand marks of our success in addressing these issues for the Women.\n\nFigure 15 - A charcoal burn that the women conducted after integrating our solutions\n\nDirect Testimonials From the Mujeres\n\n\"I ate tortilla with the carbon we made!!! ...the tortillas were delicious!\"\n\"It was really easy and fast to align the holes with the channels. We barely got\nany ashes or undercarbonized material, all the hearts were black\"\n\n\"The burn went really well! This way is much better because there's no risk that\nit will fall, so now we don't get burn. Both things are important, but it's more\nimportant that the barrel is safer than that it's not as hot.\"\n\n\"I think the sheet metal design is easy. We made them almost just like yours, but\nwe put a handle on the plate. But we don't feel as hot so it's fine to get close and\nthen cover it with sand...very good work because now we don't feel the heat!\"\n\næͷͽʒ\nday! With [your] new technology we can make a lot of carbon and sell it at the\nfair! Our fear was that it would topple over, ʒ\nǤʒǤ\nElia really feels like a Charcoal Captain.\"\n\nThe women did run a second burn with our design solution, but this run did not\nproceed as flawlessly as the others. They had reported back to us through a phone call that\nthey had done everything just as they had in the previous burn and left the biomass to\ncarbonize for two hours. As they uncovered the top and the bottom seals, the biomass had\nsuddenly erupted in flames again. The fire was safely put out with water. However, this\ndevastated and confused the women. After careful consideration and consultation with or\nproject mentors and professor, we were able to respond to their concerns. It was concluded\nthat the seal must have not been completely airtight. This is the only way in which the\nflames could have been reignited. It is important to note that this situation was not\nparticularly a fault of our design, and could have arisen in any other burn using any other\nmethod of sealing. We assured this to the women in hopes of restoring their confidence in\nthe charcoal making process.\n\nIX. Acknowledgements\n\nWe would like to give special thanks to our community partners at Grupofenix, the\nAlternative Energy Program, Las Mujeres Solares de Totogalpa and Lyndsey Chapman for\nǤʒ\nproject mentors, Amelia Servi and Steve Banzaert for guiding us through all aspects of our\nproject; Ken McEnaney and Amy Banzaert for making significant contributions to our\nsuccess; and Amit Gandhi, Gwyn Jones, Dennis Nagle, Dr. Barbara Hughey, Jonh DiFava,\nDaniel Caterino & Mike Tarkanian without whom this project would not have been\npossible.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Dehusking Insert",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/09af6dbe00f3e660d48ad65898730f49_MITEC_711S11_proj_rpthusk.pdf",
      "content": "Dehusking Rice with a Leather Insert in a Molino\nD-Lab: Energy Final Report\n\nBenji Moncivaiz, Bensey Schnip, Missy Showers, MIT Student\n11 May 2011\n\nTable of Contents\nABSTRACT .................................................................................................................................... 3\nPROBLEM STATEMENT ............................................................................................................. 3\nDESIGN SPECIFICATIONS ......................................................................................................... 3\nEfficient....................................................................................................................................... 4\nTimely ......................................................................................................................................... 4\nGentle .......................................................................................................................................... 4\nSafe ............................................................................................................................................. 4\nAffordable ................................................................................................................................... 4\nAssemblable ................................................................................................................................ 4\nDurable ........................................................................................................................................ 4\nBeautiful ...................................................................................................................................... 5\nDESIGN CONCEPTS CONSIDERED .......................................................................................... 5\nMortar and Pestle ........................................................................................................................ 5\nPlates rubbed together ................................................................................................................. 5\nPepper Grinder ............................................................................................................................ 5\nVictoria Grain Mill (Molino) ...................................................................................................... 6\nDesign Decision .......................................................................................................................... 6\nINITIAL EXPERIMENTATION ................................................................................................... 7\nMATERIAL SELECTION ............................................................................................................. 8\nPROCESS OPTIMIZATION.......................................................................................................... 9\nDESCRIPTION OF PROCESS DESIGNED ............................................................................... 10\nDISCUSSION ............................................................................................................................... 12\nCOMMUNITY PARTNER .......................................................................................................... 13\n\nABSTRACT\nASAPROSAR is currently introducing rice cultivation in the communities of La Magdalena\ndistrict of El Salvador both as a source of nutrition and income. Since current methods for\nprocessing rice are both time and money intensive, we worked to develop a cheap and local\nalternative method. After preliminary research and brainstorming, we focused on modifying a\nVictoria Mill molino by inserting a different material which husks rice grains without crushing\nthem. We tested several different materials and varied the spacing between the molino plates and\ninsert, concluding that leather is the most appropriate insert. Through an extensive\nexperimentation and optimization, we developed a 12-step process of husking that is cheap and\ndurable.\nPROBLEM STATEMENT\nCurrently, processing rice is expensive and time consuming due to high costs of transportation\nand price of dehusking at the milling factories. It costs $5.50 for 25 pounds of rice ($3 of which\nis due to transportation). The roundtrip to the mill can take a full day (up to six hours on the bus\nalone) and cost more than a day's salary ($4), making the process inefficient. The process needs\nto be local, cheap, quick, and durable to allow for communities to process rice.\nDESIGN SPECIFICATIONS\nIn order to introduce a new process in the La Magdalena area, our team sought to develop a\nmethodology that is efficient, timely, gentle, safe, affordable, assemblable, durable, and\nbeautiful. The product specifications for our product are found in Table 1 below.\nTable 1. Product specifications for rice dehusking method to be recommended to ASAPROSAR for use\nin Santa Ana, El Salvador.\nAttribute\nMetric\nUnit\nValue\nEfficiency\nAmount of rice successfully dehusked\n%\n>90\nTimely\nThroughput\nlbs/min\n1/3\nGentle\nAmount of rice crushed / cut in half\n%\n<10\nSafe\nHazardous residue\nbinary\nNo\nAffordable\nCost\n$\nAssemblable\nSpeed of assembly\nminute\nDurable\nLifetime of insert\nlbs. of rice\nBeautiful\nAesthetically acceptable\nBinary\nYes\n\nEfficient\nProcessing rice in any way takes effort and the new method should make the most efficient use\nof the human power input. Efficient rice processing should remove husks from at least 90% of\nthe rice grains. The output from processing at the mill still contains some husked rice, so our\nprocess should be equivalent or better than the mill efficiency to make a user's power input\nworthwhile.\nTimely\nWhile processing at the mill takes up to a day with transportation and processing, processing the\nrice in the community should not be time consuming. It is essential that community members are\nnot discouraged from processing their own rice because of time concerns. A typical family in the\nLa Magdalena area goes through 1 to 4 pounds of rice a week, depending upon income -- we\nrequired the throughput of rice to be 1 pound to 3 minutes or less. This is certainly an\nimprovement over a day's trip to a processing mill.\nGentle\nDehusking rice has the hidden intricacy of being rough enough to remove the husk yet gentle\nenough to not crack or break the rice. Previous models had cracked or crushed the rice grains to\nthe point where eating them would not be acceptable and would be a waste of the grown rice in\nthe community. We desire to have the amount of rice crushed or cut in half to be less than 10%\nof the total processed rice. Processing at the mill does produce crushed rice as well, so our\nprocess should be equivalent or similar to the ratio from the mill.\nSafe\nOne of the main concerns with the previous prototype, a black piece of inner tube adhered to the\ngrinding plate on the molino, is the residue that is left on the grains of rice. Families were\nconcerned that the black color left on the rice was not healthy. Undoubtedly, it is essential for\nprocessing to not leave hazardous residue on the rice as the rice will be consumed by the families\nand/or sold to others for income.\nAffordable\nIt is vital that the communities have the financial means to buy the technology. One of the\nreasons for introducing rice is to introduce an additional source of income. The project would be\nmoot if the material we selected as an insert worked beautifully, but the community members\nwere not able to afford it. Therefore, we wanted process selected to cost under $2.\nAssemblable\nThe dehusking product should be easily assembled so the community members would not be\ndiscouraged from using it. Our goal was to be able to put the product together in 3 minutes. Our\nultimate goal is to provide an easier way to remove the rice husk; this requires a simple and\nquick assembly process.\nDurable\nWe want our technology to last as long as possible so that families will spend less money and\ntime to obtain a replacement. Our goal is for the insert to withstand 200 pounds of rice\nthroughput. Since each family consumes 1-4 pounds of rice per week and there are about 10\n\nfamilies per home-group, or \"casero\", this lifetime would enable the insert to serve the\ncommunity for roughly five or six weeks.\nBeautiful\nAlthough this specification is not as critical as some of others that were previously stated, we\nhope to make the dehusking product as aesthetically pleasing as possible. Experience has shown\nthat individuals are more likely to choose a less effective aesthetically pleasing product over a\nmore effective but less appealing product. We want to encourage the community members to use\nthis product as much as possible and take pride in their rice dehuskers.\nDESIGN CONCEPTS CONSIDERED\nIn order to explore various methods for dehusking the rice, we brainstormed various concepts\nand ideas. We also researched some existing technologies, both simple and more technologically\nadvanced, that communities in rice-growing regions have used over the years. The various\nmethods settled upon were compared via a Pugh chart, seen in Table 2 below. The essential\nfunction of each design is to apply the necessary friction to the rice in order to remove the husks.\nThe following sketches reveal the ideas.\nMortar and Pestle\nThe mortar and pestle method is one of the most common and basic methods for\ndehusking rice in developing countries. A forceful pound with a stick or rod is\nenough to remove the husk. Our diagram resembles the traditional mortar and\npestle concept, with a stone bowl and wooden stick. This method is technically\nsimple and very cheap, but also energy intensive. Additionally, only small\namounts of rice can be processed at a time.\nPlates rubbed together\nThis method dehusks rice by placing the rice between a layer of\nchicken wire and of wood which are moved back and forth. The\nmotion would provide enough friction to remove the husks. This\nis similar to the concept of the molino that has been experimented\nwith in the communities of La Magdalena (see below). The\nmotion should be enough to pull the husks off the rice. This\nconcept is promising, but we were concerned about the price of\nmaterials; wood is very expensive and chicken wire is both\nexpensive and hard to acquire. The process should work well and\nthe system is easy to assemble.\nPepper Grinder\nThis idea was inspired by a pepper grinder. It consists of using a cylinder shell\nand a shaft with a handle. Rice is poured into the shell and the shaft is\ninserted. The shaft is then turned. The shell and the shaft both have a rough\nsurface to create friction and catch the rice husk. One limitation is the fact that\nonly a small amount of rice is able to be dehusked at a time. The construction\ndoes not require complicated or expensive mechanisms.\nFigure 1.\nFigure 2.\nFigure 3.\n\nVictoria Grain Mill (Molino)\nThis is a mill that is currently used introduced in La Magdalena region as a\ncorn grinder by ASAPROSAR. Amy Smith had the idea of adding a rubber\ninsert between the metal plates of the molino. Although a rubber insert may not\nbe the best insert, the concept of modifying the molino by incorporating an\ninsert struck us as an idea with strong potential. The molinos are readily\navailable for $20 in the markets of Santa Ana. They require little assembly and\nare considerably durabile. Additionally, the molino could continue to be used\nfor milling other foods, such as yucca and corn. The molino has the added\nbonus of being easy to use and capable of processing a large amount of rice at\none time. The only draw back would be the initial $20 cost as well as the\nASAPROSAR-dependent availability and price of the material insert.\nTable 2. Pugh chart delineating dehusking methods\n\nPepper\nCrusher\nFlat Plates\n(Back/Forth)\nMortar\n& Pestle\nMolino Plates\n(Around)\nEfficiency\nS\n-\n-\nS\nEase of Fabrication\n-\n-\n+\nS\nPhysical Labor\nS\n-\n-\nS\nCost\n+\n-\n+\nS\nDurability\n-\n-\n+\nS\nAlternative Uses\n-\n-\nS\nS\nPossible for our team\n-\nS\n-\nS\n\nDesign Decision\nUltimately, it was most feasible and efficient to adapt the molino and create a process for the\ndehusking. The molino is locally available in marketplaces in El Salvador and is already being\ndistributed in the communities by ASAPROSAR. It is most economically feasible to make use of\nthe already present equipment, as materials like metal and wood are expensive for initial costs of\nthe product. It is possible to maintain the molino‟s original purpose, allowing for a multi-\npurpose initial investment. The construction of the molino is very durable and allows for a long\nlifetime for the product. Finally, with the short timespan of our project, it would be most efficient\nto be able to have a working deliverable to send to ASAPROSAR as opposed to an inefficient\nprototype. Therefore, we chose to pursue the adaptation of the molino with the material insert as\nour design.\n\nFigure 4.\n\nINITIAL EXPERIMENTATION\nWindmill Rice in Arkansas donated a 50 kg bag of whole rice to the project. This rice was used\nfor all testing; it was similar in size and texture to the rice brought back from El Salvador. The\nfirst goal was to choose a material to place between the molino plates. Table 3 shows a Pugh\nchart comparing all materials initially considered, whether experimented with or not.\nTable 3. Pugh chart comparing materials to use as an insert to molino\n\nLeather Rubber Metal Wood Fabric\nCost\n+\nS\n+\n-\n+\nResidue\n+\nS\nS\n+\nS\nDurability\n-\nS\n+\n-\n-\nAvailability S\nS\nS\n-\n+\n\nThe following materials were tested:\n- 1 piece of leather\no untied and allowed to rotate\no tied onto the plate attached to the shaft to prevent relative rotation\no tied onto the plate attached to the shaft to prevent relative rotation, with a 2-mm\nthick craft foam behind the leather to provide cushion\n- 2 pieces of leather hot-glued together\no untied and allowed to rotate (hot glue was only for prototyping purposes and\nfailed after a few rounds)\n- 1 piece of 5-mm thick honeycomb pattern polyurethane rubber\no tied onto the plate attached to the shaft to prevent relative rotation\no untied and allowed to rotate\n- 1 piece of 5-mm thick flat side of the honeycomb pattern polyurethane rubber\no untied and allowed to rotate\n- Flat piece of the body of the molino\nThe leather and rubber were purchased in a shoe store near the ASAPROSAR headquarters in\nSanta Ana.\nWith each of the materials tested, we varied the number of turns of the main knob from all the\nway tight, varying the loosening from 2 turns to 6 turns. By varying the number of turns, we\ncontrolled the spacing between the insert and the molino plates. Both the materials and number\nof turns were not systematically tested, but rather combined variably to get a good intuition\nbehind how the rice was being treated and to expedite initial experimentation. Each test ran 50 g\nof rice through the molino to quickly gauge which was the most promising combination of\nmaterial and number of turns. We winnowed each of the tests. With the most promising results,\nwe proceeded to manually separate the whole rice, the dehusked rice, the broken rice, and the\npowdery rest. Each element of the processed rice was weighed to find which had the greatest\nratio of dehusked rice to whole and broken rice. Those measurements are seen in Table 4. below.\n\nTable 4. Results of initial experimentation\nMaterial\nTightness Mass (all) Mass (w/ husks) Mass (broken)\nMass (Whole)\nRubber (Honeycomb side) 2.25 turns 50 g\n1 g\n15 g\n14 g\nRubber (Honeycomb side) 2.5 turns\n50 g\n9 g\n11 g\n13 g\nRubber (Flat side)\n2.5 turns\n50 g\n1 g\n14 g\n12 g\n\nThrough these tests we learned three things:\n- Dehusking results are similar across materials\n- The number of turns (space between plates) is the biggest contributor to dehusking\nperformance\n- Softer materials reduce the amount of rice broken while dehusking\nMATERIAL SELECTION\nAfter our initial material selection experimentation, it was found that dehusking results were very\nsimilar across the different materials and overall, softer materials worked best. We decided to\npursue leather, as it was cheap, durable, and available locally in El Salvador. We found leather\nthat was unattached to the molino produced similar results as if it were attached. This allows the\nmolino to be flexible for other uses in the community, like making cornmeal or grinding yucca,\nas the insert can be easily removed and inserted. In addition, without needing a hazardous\nadhesive or intensive sewing process, the insert will be less hazardous and less costly to attach.\nAlthough we tested leather with multiple layers, we found that one layer seemed to produce\nsimilar results as two or more pieces. One layer wore and stretched a similar amount as two\nlayers, so we expected one layer to be as durable. In terms of feasibility, one layer of leather is\nmore optimal for our community. One layer of leather (cut to fit the molino) will cost a user\nabout $.50, whereas two layers would cost $1.00 plus the cost of adhesive. The best method to\nattach the two pieces of leather together was using a rubber cement glue, which is costly and\npotentially hazardous.\nOne concern our group had surrounding the leather insert was its level of toxicity, and if it could\npotentially leave hazardous residue on the rice. One of the most toxic chemicals found in leather\nfrom the tanning process is Chromium. The Agency for Toxic Substances and Disease puts a\nlimit of 100 μg chromium/L water on consumed products.1 We found this to be equal to eating\n7 of our leather inserts a day and concluded that any residue left on the rice would not be enough\nto contaminate it. In all, it made the most sense to progress with our optimization using leather,\nspecifically targeting using a single piece.\n\n1 Yu M.D., Dianyi. \"Chromium Toxicity\". WB 146, Agency for Toxic Substances and Disease Registry, Online\nhttp://www.atsdr.cdc.gov/csem/chromium/docs/chromium.pdf, Accessed 3 May 2011. page 13.\n\nPROCESS OPTIMIZATION\nIn order to optimize our final process, we conducted a series of larger volume experiments,\nprocessing about 850 grams of rice per test for a grand total of 15 kg processed throughout this\noptimization. We tested rubber and various leather inserts, reported in Table 5 below. For each\ninsert, we conducted an experiment with a tightness of 4.5 turns and a tightness of 5 turns. The\nresults of our experiments are also listed in Table 5. In addition to the number of turns, we noted\nthe amount of the rice left after winnowing, the amount rice and husks that were crushed beyond\nuse, the processing rate (in pounds per minute) and the percent of rice that was successfully\ndehusked.\nTable 5. Process optimization results. Experiments 5 and 6 show the results of the selected material.\nExperiment 3 with the rubber failed because it stretched too much, disallowing its analysis.\n#\nMaterial\nTurns\nOriginal\nweight (g)\nPost-\nwinnow\n(g)\nBroken\n(g)\nThroughput\n(lb/min)\n%\ndehusked\nLeather (2pc)\n4.5\n848 g\n518 g\n58 g\n0.405\n96%\nLeather (2pc)\n866 g\n546 g\n61 g\n0.576\n94%\n2* Leather (2pc) (Processed 2x) 5\n225 g\n214 g\n9 g\n0.295\n96%\nRubber (1pc)\n4.5\n860 g\n--\n--\n--\n--\nLeather (2pc)\n4.75\n854 g\n572 g\n50 g\n0.344\n94%\nLeather (1pc)\n4.5\n851 g\n570 g\n48 g\n0.478\n94%\nLeather (1pc)\n847 g\n412 g\n64 g\n0.44\n96%\nLeather (2 pc glued)\n4.5\n856 g\n507 g\n68 g\n0.54\n98%\nLeather (2 pc glued)\n849 g\n486 g\n84 g\n0.442\n96%\n\nBy processing a larger quantity of rice, we were able to eliminate rubber from the list of potential\nmaterials. The force of 850 g of rice caused the rubber to stretch significantly, up and over the\nedge of the molino plates. The whole rice passed through the molino unprocessed and the rubber\njammed in the plates so the handle could not be turned.\nDetermining the percent of rice that was successfully dehusked in a time-efficient manner\nrequired some problem solving, as we did not want to manually separate almost a kg of rice.\nInstead, we took a 50-g sample of each experiment, separated the whole rice from the dehusked\nrice in that small sample, and weighed the amount of whole rice. In order to confirm that this was\nan accurate sampling, we separated all 850 g of the rice from the experiment 1 (two leather\npieces, 4.5 turns) and measured how many grams of rice were still whole compared to the entire\namount of processed rice. Then, we compared that ratio to the ratio found from the 50-g sample\nof the same experiment; the two efficiencies were the same. Therefore, we knew we could use a\n50-gram sample to determine the percent of dehusked rice for the rest of the experiments.\nIn the process of using the sieves to separate the completely crushed rice and husks, we\ndiscovered that the rice that was still whole collected at the top of the sifter as we shook the\nsieves back and forth. We were able to easily scoop out most of the whole rice. In this manner,\n\nwe were able to increase the efficiency of our process. In one instance, we took the experiment\nwith the worst efficiency (5 out of 50 grams of rice still whole) and used the shaking method to\nseparate the whole rice. After scooping out the whole rice, we discovered that only 3 out of 50\ngrams of rice were now still whole. The shaking method allowed us to increase the efficiency\nfrom 90% to 94%.\nWe conducted various experiments regarding the shaking method to determine what was\nrequired to make the shaking method consistently work. We used various types of containers\nwith varying amounts of rice in the container. We found that the best container had a flat bottom\nwith rigid sides. The ratio of rice depth to the container diameter was 1:20. That is, the rice is\nrelatively shallow in the container.\nAs a result of our eight experiments, we concluded that the optimal material insert would be a\nsingle piece of leather. We noticed that all the processes yielded about the same amount of post-\nwinnowed rice and had roughly the same efficiency. Since there was negligible difference\nbetween using two or one piece of leather, we decided that one piece was the better insert since it\nis cheaper. Additionally, we would not have to worry about the potential toxicity of the glue\nconnecting the two leather pieces.\nWe additionally concluded that the optimal number of turns was between 4.5 and 5. Five turns\nyielded some more whole rice, and four and a half turns yielded more broken rice. Ultimately, it\nis the decision of the communities to decide which they prefer. They must determine their\noptimal dehusking process by their own experience. We were tentative to make the process more\nspecific for fear that our process would not work exactly for the other molinos distributed by\nASAPROSAR.\nDESCRIPTION OF PROCESS DESIGNED\nThe process developed includes simple steps, including gathering a piece of leather and 10\nwashers. Figure 5. shows the 12 step program we will propose to ASAPROSAR.\nFigure 5. The 12 step de-husking process proposed\n\n12-step rice dehusking process using a leather insert in a Victoria mill\n1. Leather can be obtained at the local shoe store or supplied from ASAPROSAR.\n2. The shape was easily cut using metal snips, though any scissors would suffice. The\nleather is there to cover the entire surface of the molino plates, so was 10-cm diameter\nwith a 3-cm hole in the center for our work with the Victoria molino.\n3. The molino has a screw on the bottom in order to clamp around a horizontal surface such\nas a table. The setup of the molino may be made more permanent by also bolting the\nmolino onto a stand through the two tabs on the side.\n4. All parts are ready and the assembly process begins. Place the insert onto the threaded\nshaft. The insert may have to be \"screwed\" onto the shaft if it is a bit tight. The hole\ndoes not have to fit exactly around the base of the shaft; within reason, the insert may\nshift around if the hole is larger or become warped if the hole is smaller.\n5. Finish the assembly by attaching the grain reservoir and securing the handle with the\ntabbed screw.\n6. Add about five (5) standard washers to each of the threaded \"screws\" on the C-brace.\nOne can add any spacer that is available, as long as it provides about 1 cm (or a bit less\nthan the width of a finger) more space between the body of the molino and the C-brace.\nThese spacers cause the metal mill places to be separated even when the side knobs on\nthe C-brace are tightened all the way. If these spacers are not there, the C-brace may fall\noff while processing.\n7. Tighten the main knob in all the way to get no space between the insert and metal mill\nplates.\n8. Increase the spacing between the plates by loosening the main knob 4-5 turns. Loose\nspacing (5 turns) will give more grains with the husk still on and fewer broken grains,\nwhile tight spacing (4 turns) will give more broken grains and fewer grains with the husk.\n9. Add the rice to the molino and turn the handle to process all the rice.\n10. Winnow the rice to remove husks.\n11. Gently shake the rice back and forth in a shallow container for about twenty (20) seconds\nand you will notice that many of the rice grains with the husk still on it will surface to the\ntop. Scoop out these grains and place them aside to run them through the mill again or to\nstore for later. Continue to shake the container back and forth again in twenty (20)\nsecond intervals to remove most of the rice with husks.\n12. The rice is processed.\n\nDISCUSSION\nOverall, we are proud of our final design. It worked very well and met nearly all of our project\nspecifications. Where it did fall short, it was by a small amount.\nTable 6. The process's fulfillment of the product specifications. Shaded boxes indicate the places of\nimprovement.\nATTRIBUTE\nMETRIC\nUNIT\nDESIRED\nVALUE\nACTUAL\n(4.5 turns)\nACTUAL\n(5 turns)\nEfficiency\nAmount of rice\nsuccessfully dehusked\n%\n>90\nTimely\nThroughput\nLbs/min\n1/3\n.478\n.44\nGentle\nAmount of rice crushed or\ncut in half\n%\n<10\n8.4\n15.5\nSafe\nHazardous residue\nBinary\nNo\nNo\nNo\nAffordable\nCost\n$\n0.50\n0.50\nAssemblable\nSpeed of assembly\nMin.\n3:00\n2:01 min\n2:01 min\nDurable\nLifetime of insert\nLbs. rice\n160 lb. +\n160 lb. +\nBeautiful\nAesthetically acceptable\nBinary\nYes\nYes\nYes\n\nOur first project specification was efficiency. We wanted at least ninety percent of the husks to\nbe removed from the rice. Our final system was 94-96% efficient.\nOur second project specification was throughput, or how fast the rice could be processed. Our\ngoal was to be able to process one pound of rice in three minutes. We were able to process about\n850g (1.87 pounds) of rice in roughly 3.5 minutes. This corresponds to a rate of over 1.5 pounds\nof rice in three minutes.\nOur third project specification was gentleness. We wanted less than ten percent of the rice to be\nbroken. About one third of the rice was broken in our final design. Although we surpassed our\ntargeted percentage, we are aware that the rice that is processed at the mill in El Salvador has a\npercentage of crushed rice as well. Moreover, since broken rice may still be eaten, we do not\nbelieve that this shortcoming will prevent the communities of La Magdalena from using our\nprototype. In order to address this shortcoming, we could attempt to further optimize the number\nof turns. However, the tightness may vary with each molino. We discovered that a large part of\nthe efficiency is „getting the feel‟ for the molino. Ultimately, the community must decide what\nratio of whole rice to dehusked rice to crushed rice is appropriate. We do not want to be too\nspecific with our instructions in case it does not work optimally in the community. We might\nconsider optimizing the cranking method. Perhaps it would prove beneficial to turn the handle\nslower or turn it twice forwards and once back.\nOur fourth project specification was safety. We wanted to make sure that if the material insert\nleft residue on the rice, it would not be toxic. Concerns arose regarding the tanning process for\nthe leather, but upon careful analysis, we determined that a community member would have to\n\neat seven leather inserts per day to suffer from the toxicity. Additionally, we processed a\nconsiderable amount of rice on one leather insert without much observed wear. There was no\nchange in mass. Therefore, we concluded that not only would the residue left on the rice be safe,\nbut there was very little residue left on the rice in the first place. We successfully met this project\nspecification.\nOur fifth project specification was affordability. Our aim was to have the cost be less than $2.\nLeather costs $4 per square foot. This corresponds to a price of about $0.50 per insert, which is\nfour times less than our specified price.\nOur sixth project specification was speed of assembly. We wanted the product to be assembled in\nthree minutes. It takes about a minute to replace the material insert once the molino is completely\nset up. To set up the molino from scratch takes about three minutes. Mostly likely, the molino\nwill be left set up in the communities, which we observed when we visited over spring break.\nThus, the overall assembly time is about a minute.\nOur sixth project specification was durability. Our goal was to have the insert last long enough\nfor 200 pounds of rice to be processed. We did not have 200 pounds of rice to test this\nspecification. However, we processed over 7.5 kilograms of rice (16.5 pounds) with little visible\nwear on the insert. From this, we predicted that the insert should be able to process at least 160\npounds of rice, or the equivalent of a community‟s monthly consumption of rice. We do not\nknow if the insert will last 200 pounds of rice. In order to determine if the insert lasts as long as\nwe predict, we would have to process about 200 pounds of rice and observe how it fares (this\nwould necessitate another generous contribution from Will Floyd of two more 50kg rice bags). If\nthe leather fails significantly earlier than expected, we could test with other types of leather and\ncontinue to explore other materials if it proves to be a serious problem. However, based on our\nobservations, we believe that the leather will endure a large quantity of rice.\nOur last project specification was beauty. We wanted the design to be aesthetically pleasing to\nencourage its use. Since our design concept incorporates the molino, which the community\nalready uses, we concluded that the final product was aesthetically pleasing. The molino is clean\nin structure and appearance and the leather insert is fine.\nCOMMUNITY PARTNER\nASAPROSAR is a human development NGO based in Santa Ana, El Salvador. It works in rural\nareas to improve the quality of life by providing environmental and nutrition education, micro-\ncredit opportunities, and general community development work. The organization is interested in\nhelping communities while making them aware of environmental issues and teaching them the\nimportance of respecting the surrounding natural world. Some of the issues that ASAPROSAR is\naddressing involve cooking with charcoal to reduce smoke, disposing of waste in particular areas\nto avoid contaminating soil and water, and harvesting sugar canes without setting fires.\nWhile ASAPROSAR was interested in the development of many projects (lighting conditions,\ncharcoal stoves, ventilation), they also expressed interest in a rice dehusking project. On one of\nour visits to the community of La Magdalena, we were introduced to families who were currently\ngrowing rice and were looking for ways to dehusk it more conveniently. Currently, one member\nof the family needs to take a 6-hour round trip bus ride to the nearest mill which costs $3.00 and\npay an additional $2.50 for processing 25 lbs of rice. The trip is very time and money intensive\nand the amount of rice lasts for one month per family on average. ASAPROSAR is really\n\ninterested in helping with a dehusking method as it would greatly contribute to the rice\ncultivation project they have been trying to implement in the communities. The project will\nallow many families to improve their nutrition and hopefully generate income by selling the rice.\nASAPROSAR have been really helpful with answering our numerous questions about the rice\nthey grow, the advantages and challenges they have with it and general community needs.\nIncluded at the end of this section is a copy of our correspondence with them.\nIn order to ensure that our product design reaches ASAPROSAR, we will be in touch with Juan\nCarlos. Since it is sometimes difficult to communicate electronically with international\ncommunity partners, we are going to mail a package to ASAPROSAR as well. The package will\ninclude the detailed instructions (with images) for assembling and using the molino in addition to\nthe actual leather insert pieces. We will send an old and a new piece to demonstrate the expected\nlevel of ware. We are hoping that by mailing the prototypes and instruction manuals, we will\nfacilitate the implementation of the project in a timelier manner. We will encourage Juan Carlos\nand Elena to keep us informed of the project along with the successes and challenges that the\ncommunity members are dealing with. Although none of us are planning on traveling to El\nSalvador in the near future, we are hoping that the package we mail and the report we send will\nbe sufficient for ASAPROSAR to take the project and introduce it to the communities they are\nworking with. The simplicity of the product will make it easy for people to learn and use it fairly\nquickly. In any case, we will encourage ASAPROSAR to contact Yuliya if any further questions\narise and Juan Carlos has her contact information. If the communities notice any challenges with\nthe product, we can introduce the project for further optimization in future D-Lab classes.\nQuestions(in English):\n1. What type of rice is grown in El Salvador?\ncebada and liveral\n2. When is the planting and the harvesting season?\nMay - November\n3. When is the planting and harvesting season for corn?\nNovember - July/August\n4. Before cooking the rice, is it processed? Or is the husk just taken off?\njust husk is taken off\n5. Is the rice washed before it is cooked?\nyes\n6. How is it cooked? Steamed or boiled?\nboiled\n7. How much rice does a family eat in a week?\n4 lbs per week (if there is money), as little as 1 lbs\n8. How much rice can a family grow in one season?\ndepending on the land they have, 25 lbs or more\n9. Do they want to grow rice for food or to sell it? Or both?\nboth\n10. How much does it cost now to process rice - transportation to the mill and the payment at\nthe mill?\n$2.50 for processing + $3.00 for transportation\n11. How many people/families have a molino?\n10 families per community\n\n12. Will the molino be used by each family or will there be one for the community?\nthe whole community will use the molino\n13. When taken to the mill, are some rice grains broken? Are there any husked ones?\nthere are some broken ones and there are few husked ones\n14. Is the leather treated with chemicals?\nyes it is\n\nQuestions (Espanol):\n1. ¿Que tipo de arroz se cultiva en El Salvador?\nCebada y Liveral\n2. ¿Cuando se siembra y cuando se cosecha maiz?\nMayo - Noviembre\n3. ¿Y el arroz?\nNoviembre - Julio, Agosto\n4. ¿Antes de comer el arroz, se procesa mas que quitando la cascara?\nsolo quitando la cascara\n5. ¿Se lava el arroz antes de que se cocina?\nsi\n6. ¿Como se cocina? Al vapor o hervido?\nhervido\n7. ¿Cuanto arroz se come una familia en una semana?\n4 libras si les pagan por semana pero si no es asi 1 libra por semana\n8. ¿Cuanto arroz se puede crecer por una familia en una temporada?\ndepende del espacio que tengan algunos solo 25 libras otros mas\n9. ¿Quieren cultivar arroz para comer o vender? O las dos cosas?\nlas dos cosas\n10. ¿Cuanto cuesta ahora para procesar el arroz - el transporte a la\nplanta y el pago en la fabrica?\n$2.50 por 25 libras mas transporte $3.00\n11. ¿Cuantas personas / familias tienen un molino?\n10 familias por caserio si no tienen pagan $0.40 por cada 5 libras de maiz\n12. ¿El molino seria utilizada por cada familia o habra sola una para\nla comunidad?\nel de arroz seria utilizado por toda la comunidad\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Design Project grading rubric used by instructors",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/16c217375a56941c0f49bf3df639d86d_MITEC_711S11_proj_rubric.pdf",
      "content": "TECH 931 Energy Systems in the Developing World\nAmy Banzaert\nThis file contains material adapted from MIT course SP.775 D-Lab Energy. It may contain references to the MIT\nversion of the course that will need to be removed or revised before use in other contexts. For a list of frequently-\noccurring references, or more information about this document, please consult the SUTD Project Intranet at http://\nweb.mit.edu/sutd\nThis file and its contents are provided under license from MIT and its faculty, under the terms of the MIT-SUTD\nCollaboration. Any derivative use of this material, including excerpts, remixing, and adaptations, should cite this\nsource as follows:\nBanzaert, Amy. Course materials for TECH 931, Energy Systems in the Developing World. MIT-SUTD\nCollaboration, 2011.\nMIT SP.775 Spring 2011\n\nD-Lab: Energy\nOverall Grade\nGRADE/100\nTimeliness\nTIME/10\n- exactly on time or just a bit short\n9-10\n- somewhat short or long\n6-8\n- excessively short or long\n0-5\nPreparation\nPREP/15\n- clearly well-prepared\n- a bit rough\n10-14\n- very unprepared and disorganized\n0-10\nLooks-Like Prototype\nLOOKS/20\n- outstanding: aesthetically pleasing, form follows function\n19-20\n- good: decent aesthetics with some room for improvement\n16-18\n- weak: minimal aesthetics\n10-15\n- non-existent\nWorks-Like Prototype\nWORKS/20\n- outstanding: function matches design specifications extremely well and\noperates well\n19-20\n- good: decent function with some room for improvement\n16-18\n- weak: works sort-of\n10-15\n- does not function or non-existent\nPresentation\nPRES/25\n- outstanding: clear explanation of project motivation and community partner\nneeds, current implementation, next steps\n24-25\n- good: decent explanation of most of the following: project motivation and\ncommunity partner needs, current implementation, next steps\n20-23\n- weak: missing key presentation parts or very unclear\n0-19\nQuestions\nQUES/10\n- outstanding: responded to questions thoughtfully and clearly\n9-10\n- good: responded to questions relatively thoughtfully and clearly\n7-8\n- weak: responded to questions defensively or without thought\n0-6\nMIT SP.775 Spring 2011\n\nD-Lab: Energy\nFinal Presentations\nOverall Grade\nGRADE/100\nTimeliness\nTIME/10\n- exactly on time or just a bit short\n9-10\n- somewhat short or long\n6-8\n- excessively short or long\n0-5\nPreparation\nPREP/10\n- clearly well-prepared\n9-10\n- a bit rough\n6-8\n- very unprepared and disorganized\n0-5\nPrototype\nLOOKS/25\n- outstanding: aesthetically pleasing, form follows function, function matches\ndesign specifications extremely well and operates well\n24-25\n- good: decent aesthetics and function with some room for improvement\n20-23\n- weak: minimal aesthetics and minimal function\n0-19\nPresentation\nPRES/25\n- outstanding: clear explanation of project motivation and community partner\nneeds, current implementation, next steps\n24-25\n- good: decent explanation of most of the following: project motivation and\ncommunity partner needs, current implementation, next steps\n20-23\n- weak: missing key presentation parts or very unclear\n0-19\nQuestions\nQUES/10\n- outstanding: responded to questions thoughtfully and clearly\n9-10\n- good: responded to questions relatively thoughtfully and clearly\n7-8\n- weak: responded to questions defensively or without thought\n0-6\nPoster\nPOS/10\n- outstanding: clear overview of project motivation and community partner needs,\ncurrent implementation, next steps; well laid out; good use of photos, text, and\nwhite space\n9-10\n- good: decent overview of project motivation and community partner needs,\ncurrent implementation, next steps; use of photos, text, and white space\n7-8\n- weak: unclear project motivation and community partner needs, current\nimplementation, next steps; poorly laid out; limited use of photos, text, and white\nspace\n0-6\n1-minute presentation\nMIN/10\n- outstanding: engaging, compelling, clear project overview, well-rehearsed\n9-10\n- good: somewhat engaging, compelling, project overview, rehearsed\n7-8\n- weak: not engaging, unclear project overview, not rehearsed\n0-6\nMIT SP.775 Spring 2011\n\nD-Lab: Energy\nFinal Report\nOverall Grade\nGRADE/100\nAbstract\nTIME/10\n- outstanding summary, representative photo included\n9-10\n- good summary, representative photo included\n7-8\n- weak summary, no photo\n1-6\n- nonexistent\nProblem Statement\nPREP/10\n- very clear problem statement, well-defined, includes community partner details\n9-10\n- somewhat clear problem statement, includes community partner details\n7-8\n- weak problem statement, minimal community partner details\n1-6\n- nonexistent\nDesign Specifications\nLOOKS/10\n- outstanding: appropriate specs that are well-defined and matched to community\nneeds\n9-10\n- good: decent specs that are pretty well-defined and somewhat matched to\ncommunity needs\n7-8\n- weak: poor specs that are poorly defined and poorly matched to community needs\n1-6\n- nonexistent\nDesign Concepts & Selection Process\nPRES/10\n- outstanding: range of concepts presented, clear explanation of concepts, and clear,\nsensible selection process\n9-10\n- good: a reasonable set of concepts presented, decent explanation concepts, and\nsomewhat sensible selection process\n7-8\n- weak: few concepts presented, unclear explanation, weak selection process\n1-6\n- nonexistent\nDetailed Design Description\nQUES/15\n- outstanding: design well-described, design decisions clear, excellent pictures and\ndrawings, clear and appropriate calculations, excellent instructions\n14-15\n- good: design described, design decisions relatively clear, pictures and drawings,\ncalculations, decent instructions\n12-13\n- weak: design poorly described, design decisions unclear, weak pictures and\ndrawings, weak calculations, weak instructions\n10-11\n- nonexistent\n0-9\nExperiments & Results\nPOS/10\n- outstanding: clear explanation of experimental methodologies and results;\nexperiments were ideal for the design process open questions\n9-10\nMIT SP.775 Spring 2011\n\nD-Lab: Energy\nFinal Report\n- good: explanation of experimental methodologies and results; experiments were\nappropriate for the design process open questions\n7-8\n- outstanding: weak explanation of experimental methodologies and results;\nexperiments were not appropriate for the design process open questions\n1-6\n- nonexistent\nDiscussion of Design Match to Specifications\nMIN/10\n- outstanding: clear link from design to specs, shortfalls well-identified\n9-10\n- good: link from design to specs, shortfalls identified\n7-8\n- weak: limited link from design to specs, shortfalls not identified\n1-6\n- nonexistent\nCommunity Partner Receipt and Follow-Up Discussion\nMIN/15\n- outstanding: strong discussion of how design has been received by community\npartner, clear follow-up needs and associated plan\n14-15\n- good: good discussion of how design has been received by community partner,\nfollow-up needs and associated plan included\n12-13\n- weak: unclear discussion of how design has been received by community partner,\nfollow-up needs and associated plan unclear or limited\n10-11\n- nonexistent\n0-9\nWriting Practices\nMIN/10\n- outstanding: cohesive and clear document, well-edited, sources cited properly\n9-10\n- good: cohesive document, editing evident, sources cited\n7-8\n- weak: un-cohesive document, editing poor, some sources not cited\n0-6\nMIT SP.775 Spring 2011\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Orange Juice Sealer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/1494323b6c9e7f35cd886582d22ab20a_MITEC_711S11_proj_rptseal.pdf",
      "content": "THE\nRANGE JUICE\nSEALER\nJuice to store. Juice to sell. Providing opportunities\nall year round.\nTeam:\nCarter Chang, Brianna Conrad,\nBus Leonard, Emily Rosser\nMentor: Ken McEnaney\n\nThe\nD-Lab: Energy, Spring 2011\nrange Juice Sealer\nTable of Contents:\nPage\nI.\nAbstract and Project Summary\nII.\nProblem Statement\nIII. Design Specifications\nIV. Design Concepts and Selection Process\nV.\nDesign Description\nVI. Methodologies and Results of Prototype Testing\nVII. Final Design Selection to Match Specifications\nVIII. Conclusion and Implementation Plan\nList of Tables\nTable 1 - Improvements to Prototype 1.0\nTable 2 - Bag Sealer Design Specifications\nTable 3 - Orientation Pugh Chart\nTable 4 - Cost Chart\nList of Figures\nFigure 1 - The Data Collection, Prototype, and Process Overview\nFigure 2 - Bag Sealer 1.0\nFigure 3 - Design Options\nFigure 4 - Rough \"works like\" Prototype\nFigure 5 - Slanted \"looks like\" Prototype\nFigure 6 - Combination of \"works like\" and \"looks like\" Prototype\nFigure 7 - Final Prototype with Spill Collection Bowl\nFigure 8A - Summarized Results of Time Tests\nFigure 8B - Visual Timing Test Results\nFigure 9 - CAD Model Image\nFigure 10 - Photo of Final Product\nFigure 11 - Timing Circuit Diagram\nAppendices:\nAppendix A: Reference to Wiki\nAppendix B: Advice for Future groups working on Projects in the Developing World\nAppendix C: Timing Test Data\nAppendix D: User Manual (English)\nAppendix E: User Manual (Spanish)\nWorks Cited\n\nI. Abstract and Project Summary\nThis plastic bag sealer project was developed over the spring semester for D-Lab\nEnergy Class at MIT in partnership with AsoFenix, an NGO based in Managua, Nicaragua.\nAn earlier design of this project was developed by students in the class the previous\nsemester, but new requirements for the device were learned from our community partner\nand the people in the community during our spring break class trip. This bag sealer heat\nseals plastic together to create an airtight seal. It has been specifically designed for the\nNicaraguan community of El Roblar to seal bags of orange juice, but is its features are such\nthat it can be easily transferred to other communities that want to preserve other materials.\nThis report discusses the motivating problem, the design decision process, testing processes,\nand results that led to the final Bag Sealer 2.0.\nFigure 1 - The Data Collection, Prototype, and Process Overview\n\nII. Problem Statement\nAsoFenix, a Nicaraguan NGO (Non-Governmental Agency), works with many\ncommunities in rural Nicaragua, the second-poorest country in the Western Hemisphere.1\nAsoFenix develops sustainable energy and engineering projects tailored to community needs\nin the form of solar and hydro power projects, improved cooking methods, and educational\nprograms, emphasizing community involvement in managing and implementing these\ntechnologies.\nFor the second consecutive year, the D-Lab: Energy class has partnered with\nAsoFenix to develop a project that either fits a specific need in a given community or is\nadaptable to serve several different communities in Nicaragua. We saw many of the same\nproblems faced by rural Nicaraguan communities that last year's team of D-Lab students\nobserved while working with AsoFenix. These students were: Shannon Liburd, Kate Turner,\nJustin Sharps, and Janet He (see their model illustrated in Figure 2).\nIn particular, we visited the community of El Roblar, where hardworking farming\nfamilies grow as many as 80,000 oranges per year over the course of two harvests.2 In\naddition to using the oranges themselves, families generate income by transporting the\noranges to the nearest town and offering them for sale. However, the influx of oranges in the\nregion can pose a financial problem: during the orange harvesting seasons, the market is\nflooded with orange products, and 100 oranges can be sold for only approximately one dollar\ntotal.3\nLast year's D-Lab: Energy class noticed this problem and, along with Asofenix,\ndevised a creative solution. If the surplus oranges could be made into juice and put through\na pasteurization process, they could be sold after the peak of the season, providing more\nincome for the growers and their families. The challenge here lies in creating a reliable,\nsanitary storage and transport method for getting the juice to market.\nA plastic bag sealer--very similar to commercially available impulse sealers--was\ndeveloped by last year's class to preserve the orange juice produced and pasteurized by the\nfamilies of El Roblar. This device enables the women of El Roblar to store juice in disposable,\nsingle-serving plastic bags and sell it in the off-season, generating a larger profit than simply\nselling the raw oranges. Sealed correctly, these pouches can keep juice safely stored during\ntransport to market, and the leftover oranges that would otherwise spoil are put to good use.\nThe market for these juice bags already exists in many different venues in Nicaragua; one\ncannot ride for twenty minutes on a bus without hearing vendors shout \"Jugo! Jugo! Jugo!\"\nas they hand bags of cool drinks up to the bus windows. The families in El Roblar also hoped\nto sell their juice in larger bag sizes to restaurants in the nearby town.\nOur original purpose of visiting El Roblar this year was to deliver the plastic bag\nsealer prototype that was developed by last year's team. Upon arrival in El Roblar, we\nencountered a change in the resources of the community. Prototype 1.0 (built by last year's\nteam, Figure 1) was designed to run on 12 Volts of direct current (DC) from a deep-cycle\n1 \"Background Note: Nicaragua.\" http://www.state.gov/r/pa/ei/bgn/1850.htm\n2 \"Low Energy Bag Sealer Final Report.\" Liburd, Shannon et al. MIT D-Lab: Energy.\n3 \"Low Energy Bag Sealer Final Report.\" Liburd, Shannon et al. MIT D-Lab: Energy.\n\nbattery. This made sense at the time, since El Roblar did not have access to grid power and\nrelied on these batteries, charged by solar panels, for their electricity needs. Since last year's\nvisit, however, AsoFenix had helped the village install a dam and micro-hydro power grid.\nNow, because the families had easy access to 120 Volt alternating current (AC) from wall\noutlets in their own homes, 12 V batteries are not as common. The few remaining batteries\nwe found had been drained to an irrevocably low voltage, rendering them useless as power\nsources for the sealer.\nDisappointingly, we left El Roblar with Prototype 1.0 in-hand because it was no\nlonger useful to the community after the change in their power source. We resolved to\naddress these new requirements, fix the minor problems we observed with Prototype 1.0, and\nreturn with a more appropriate device to fit the community's needs, helping them put their\nsurplus orange crop to good use.\nThe focus of our project is to develop a plastic bag sealer that can be powered by both\n120 V AC current and 12 V DC current. To build off of last year's model, we also intend to\nremove all of the air from the bag during the sealing process to better preserve the juice. We\nalso plan to alter the sealer design to meet the user specifications we observed first-hand\nduring our field work in Nicaragua.\n\nIII. Design Specifications\nMany of the preliminary design decisions (such as the initial idea of heat sealing,\nmodeling the device on a conventional impulse sealer, etc.) were already made over the\ncourse of last year's design process. We had not only the written report and specifications of\nlast year's team, but we had the useful asset of a functioning, compact, and well-made\nmachine to use for ourselves, experience the drawbacks and beneficial features firsthand,\nand observe the first impressions of the target users.4 Such a head-start was an invaluable\nboon to our team, and we thank and acknowledge the previous year's team for their hard\nwork.\nFigure 2 - Bag Sealer 1.0\nStarting with an established design gave us a clear jumping point. When first\nconsidering our design specifications: we were able to simply ask, \"What function of this\ndevice needs to be improved?\" With that in mind, we created the following list, based on our\nexperiences in Nicaragua (see Table 1).\n4 \"Low Energy Bag Sealer Final Report.\" Liburd, Shannon et al. MIT D-Lab: Energy.\n\nTable 1 - Improvements to Prototype 1.0\nFeature\nDrawbacks\nImprovements for\nPrototype 2.0\nImprovement\nrequirements\nPower Supply (12 V\nDC)\nIncompatible with\nvarying power\nsources (can easily\ndiffer between\ncommunities)\nAdaptable for 12 V\nDC or 120 V AC\npower\nRedesigning and\nrewiring timing\ncircuit and electric\nsystem\nTiming Circuit\nExpensive and pre\nfabricated: half the\ncost of the device and\ndifficult to\nmodify/repair\nModular, custom\ntiming circuit\nDesign a simpler\ncircuit and build\nusing basic, cheaper\ncomponents\nSealing strip\nOrientation and\npressure applied does\nnot get air out of bag,\ndefeating the\npurpose of\npasteurization.\nOther geometry for\nsealing strip that\nremoves air.\nDetermine optimum\nsealing orientation,\ngeometry, and\npressure for sealing\nstrip.\nGeneral ergonomics:\nlatch, means to\ncollect spills,\nmounting to work\nsurface, etc.\nWire handle of latch\nwas difficult to\nrelease, horizontal\norientation led to\nmessy spills, solid\n4x4\" block had no\nway to mount onto\ntable.\nSmoother mechanic\naction for latch, a\nmeans to collect and\nreuse spilled juice,\nmeans to mount\ndevice to work\nsurface\nDetermine optimum\nconfiguration for\nease of use.\nSome other desired features were also identified, although these weren't improvements\non the previous design so much as additional features we had discovered need for:\n● Build 5-8 circuit boards for easy replacement.\n● Create a manual for the AC and DC current models of the device, and provide these\nmanuals in both clear Spanish and English.\n● Improve the DC power requirements to account for the need to expel the air from the\nsystem.\n● Make sure that the parts used in the construction process are parts that can be easily\nreplaced using available supplies at a typical hardware store in Nicaragua.\n● Make the device operable by one person.\n● Lower the overall cost of the device.\n● To be able to seal multiple size bags. Large bags for sale to restaurants and small\nbags for individual sale.\n\nTo transform these guidelines into clear, concrete goals, the desired features we\nassigned the following metrics. By specifying quantitatively what we wanted the device to\naccomplish, we set some clear engineering goals and thresholds for a design success:\nTable 2 - Bag Sealer Design Specifications\nAttribute\nMetric\nUnit\nValue\npower source\n120V AC\nbinary\nyes\nseals with and without juice in\nthe way\nbinary\nyes\nallows all air to be removed\nvisible air in bag\nbinary\nno\nsafe to touch\nhas indication of when temperature is\nsafe to touch\n°C\n<55\nlow cost\ncost to build\nUS$\n<50\nlow power\npower consumption while sealing\nW\n<250\nwater resistance\nno opportunity for spills to short\nelectronics\nworks w/ a variety of plastics\nbinary\nyes\nFast to seal\ntime\nseconds\n<20\nDurable Seal\nMax pressure the seal can withstand\nPa\nTBD\nVariable Power Source\nAC/DC compatible\nbinary\n??\nWith these numerical goals in mind, we began the brainstorming process, exploring\nways to make features capable of these goals a reality.\n\nIV. Design Concepts and Selection Process\nGoing into the project, we had the distinct advantage of already handling and\nanalyzing a working model. Based on the performance of the past year's design, we\ndetermined that our two main criteria were:\n● To power the device with both 12 V DC current and 120 V AC current (ie, both \"wall\npower\" and a deep-cycle battery).\n● To remove as much air as possible from the bag during the sealing process, in order\nto preserve the pasteurized juice.\nOutside of these two main objectives, we wanted to maintain--or, preferably, improve\nupon--the durability, cost, usability, functionality, and power requirements of last year's\nmodel.\nThe first design challenge we examined was how to remove the air from the bag\nduring sealing. We considered several different options for sealing the bags without trapping\nair, but we did not explore any options outside of the original sealing mechanism: a nichrome\nheating strip, pressed with even pressure against the bag with a insulating sealing strip.\nBecause we had encountered no major problems with this method, and because previous D-\nLab research told us this was a viable and inexpensive mechanism, we wanted to continue\nwith this original design. This meant that the air-removal system, whatever that would be,\nwould have to be built around this basic nichrome strip layout.\nFirst, we envisioned a vacuum, attached to the device, that could suck all of the air\nout of the bag. The device would seal in the juice in the bag after the vacuum removed the\nair. This method was too complicated for one user to operate both the heat sealer and the\nvacuum; thus, it did not meet our general guideline of a single-operator device. Also, the\nvacuum would be energy and cost intensive, and--if it required any sort of sealed, pressurized\ncompressor--potentially more complicated to construct than the heat sealer itself.\nOur second proposed method to seal the bag without air was to simply fill the bag a\nlittle higher than the level of the intended seal. Then, applying pressure with the lever arm,\na seal could be made through the middle of the juice. Since the juice level would be entirely\nabove and around the seal, there would be no room for air to enter. Although this seems like\nthe easiest, simplest method, it did present some obstacles. For one, the heat seal would\nneed to be made with liquid around the sealing area, which can affect the operating\ntemperature of the nichrome wire. This surrounding liquid could potentially become an easy\nconductive route for heat loss from the wire, which would naturally lead to a weaker seal.\nIn order to best achieve a seal without trapping air inside, we also needed to consider\nanother element: the best orientation for the lever arm in order to minimize spilling and best\nseal the bag. We debated heavily between the three orientations of the lever arm shown\nbelow: a horizontal orientation, a handheld device, and a vertically oriented device. These\ndesign options are sketched below in Figure 3.\n\nFigure 3 - Design Options\nWith the sealing arm moving in the vertical plane, part of the bag will be hanging off\nthe side of the sealing platform, but a part of the bag will also be lying horizontally on the\nsealing surface. The fact that the bag would be resting on the sealing surface presented a\nproblem because the pressure from the horizontal surface would force some juice out and\nlimit the amount of juice you can fit in a given bag. This orientation would lead to more\nspilled juice that would need to be captured for reuse in our final design. With the\nhorizontal, flat sealing surface, there was also a higher probability that the juice would find\nit's way to the circuit if something breaks on the device or a watertight seal fails.\nWith the seal arm rotating horizontally and the bag free to hang vertically, there\nwould be less chance spilling because the seal could be placed in a more precise\nposition. One drawback to this method, however, was that we did not know exactly what size\nbags would be sealed in El Roblar, or any other community that the sealer might be\nimplemented in. With larger bags, the force of the lever arm pushing against the nichrome\nwire might not be enough to hold up the weight of the full bag of juice. This makes the task\nmore difficult for one user to perform, since they have to hold the bag flat, close the arm,\npush the button to turn the sealer on, and support the weight of the bag throughout the\nentire sealing process. In the interest of developing a versatile and adaptable design, it was\nimperative for our design to accommodate a large size range of bags.\nThe third option we investigated was a handheld sealer. We decided not to proceed\nwith this design because the design featured too many moving parts and parts that might\nnot be readily available in Nicaragua for easy maintenance (see the below Pugh chart, Table\n3). This sealer would also not be hands free and would require a second operator--something\nwe wanted to avoid, according to our design guidelines.\nIn order to weigh the benefits and drawbacks of each orientation (a factor that would\nheavily influence the rest of our design), we completed a Pugh chart, with Prototype 1.0 set\nas the standard.\nThe most apparent conclusion we drew from this chart was that the handheld clamp\nidea has the most drawbacks. As a result, we ceased developing that design and focused\ninstead on combining the best traits of the other two (clearly very similar, based on the\nresults of the Pugh chart) to explore as prototype construction began.\n\nTable 3 - Orientation Pugh Chart\nCriterion\nOriginal Design\n(horizontal)\nHand-held\nclamps\nVertical\norientation\nTime to seal\nCost\nPower consumption\nEnergy consumption\nSize\n+\nPower source variability\nMaterial availability (in field)\n-\nEase of use\n+\n+\nRepeatability/consistency\n-\nServiceability\n-\nService lifetime\n-\nSecondary power supply\nneeded?\nVersatility between different\nbag thicknesses?\nAdaptability\n+\nEase of construction\n-\n\nV. Design Description\nAfter gaining a rough idea of what each a sealer of orientation would entail, we still\nhad several variables to consider, along with how they would contribute to making strong\nseals on our final device. These variables included:\n-\ntemperature output of nichrome strip\n-\npower usage\n-\npressure applied to sealing strip\nSeveral \"dummy\" prototype sealers were created and used for testing these\nvariables. First was a very simple, basic sealer that could be used to test power and\ntemperature output on empty bags:\nFigure 4 - Rough \"works like\" Prototype\nThen came the exploration of combining both vertical and horizontal orientations to\nobserve how a full bag would hang from the device:\nFigure 5 - Slanted \"looks like\" Prototype\nLastly, a larger, functional angled sealer was built to finally create full, sealed bags\nat a full scale:\n\nFigure 6 - Combination of \"works like\" and \"looks like\" Prototype\nNow that we had confirmed the layout and functionality of the sealer, it was time to\nconcentrate details that were non-critical to the task of sealing a bag, but make the sealer\neasy and safe for the user. These features included:\n-\nType of mechanical latch\n-\nOne sealing strip vs. two\n-\nLocation of circuitry\n-\nLocation of controls:\no\nButton access\no\nLED indication (including cooling time for safety)\no\nKnob/slider/3-way switch for timing\n-\nLength of Nichrome strip\n-\nJuice collection in case of spills\nFigure 7 shows the use of a bowl to collect liquid spillage, one of the features we\nincorporated to minimize losses. One of our goals was to develop a product that can be\ncheaply implemented in Nicaragua. As such, we recorded the costs of all of our materials in\nTable 4.\nFigure 7 - Final Prototype with Spill Collection Bowl\n\nTable 4 - Cost Chart\nMaterials\nVersion 1.0 Costs\nVersion 2.0 Costs\nWood\n$2\n$1\nHinge\n$5\n-\nSilicone\n$12\n$4\nTeflon Tape\n$1\n$1\nNichrome Wire\n$5\n$5\nHardware\n$1\n-\nMetal Lever Arm\n$3\n$2\nCircuitry\n$26\n$9\nAdapter\n-\n$5\nCircuitry Casing\n$2\n$1\nDeep Cycle Battery\n$36\n-\nTotal\n$96\n$28\n\nVI. Methodologies and Results of Prototype Testing\nBefore fabricating the final prototype, there were certain tests that needed to be\nconducted in order to finalize our product. The parameters that needed to be determined\nwere the optimal sealing temperature, what an ideal seal looks like, the pressure required to\ncreate an ideal seal, and the time necessary to seal the bag.\nHeating\nIn order to determine the ideal temperature, we used a commercial Uline impulse\nsealer as our model bag sealer and a thermocouple for measurements. When sealing a\nplastic bag with a thickness of 0.0045\", the impulse sealer produced seals at 194.7°C for an\nimpulse of 0.53 seconds. When the bag was filled with water, the seals on the bag were of\nthe same quality. This was also true on our tests on the 0.0025\" thickness bag. The original\nBag Sealer Team recorded that the minimum temperature to get a seal was 80°C, but when\ntesting at that temperature, there was no firm seal produced. Looking at the material\nproperties of low-density polyethylene (LPDE), the type of plastic material used in El Roblar,\nwe found that the melting point to be at 120°C.5 This gave us confidence in our thermal tests\nand we continued on with our experiments.\nIdeal Seal\nFor our ideal seal, we used a visual test in addition to a squeeze test to determine\ndurability. Our ideal seal was a seal that appeared to be melted without any crimps or\ndimples along the seal. Also, the seal must be durable enough to withstand a firm two-\nhanded squeeze from the user.\nPressure\nThe amount of applied pressure was a crucial parameter to explore. Without the\nright amount of pressure, the sealer would not be usable. If the applied pressure was too\nlow, the bag would not have a uniform seal and result in a seal with intermittent gaps. If\nthere was too much pressure, the lever arm would have a significant amount of resistance\ndue to the springs and give the user a hard time pressing down the the arm until it is latched\nin. Using a Vernier Force Plate, we determined the amount of pressure that our lever arm\napplies when the arm is latched into place. Our current configuration applies 57.4 N +/- 1.2\nN over our silicone rubber strip. With our strip being 20.7 cm x 1.0 cm, the force per unit\nlength was 277.3 N/m. This resulted in 2.7 kPa applied on the nichrome wire.\nTiming Tests\nIn order to experiment with changing variables, a \"dummy sealer\" (the most basic\nparts of the heating element and sealing strip system, Figure 4) was constructed and used\nwith a laboratory DC power supply. Two different voltages were observed for varying plastic\nthicknesses at two different force loads on the sealing strip (see Figure 8).\nFrom qualitatively examining the seals created in each test, two timing ranges, one\nfor each voltage setting, were observed as the optimum sealing time. At 10.0 V, 15-20\nseconds was the ideal length, while at 12.0 V, 8-13 seconds produced an ideal seal. One can\nsee when the bag was overheated and started to melt as indicated by the red highlighted\n5 Plastic Properties of Low Density Polyethylene (LDPE) http://www.dynalabcorp.com/technical_info_ld_polyethylene.asp\n\nstrip in Figure 8. Since the shorter time range is obviously preferable during the bagging\nprocess, this data helped decide the ultimate voltage input.\nThe full data sheets are available in Appendix C. Photo references of poor seals are\nlocated in Appendix D and Appendix E.\nFigure 8A - Summarized Results of Time Test\n\nFigure 8B - Visual Timing Test Results\n\n!\"\n#\"\n$%\"\n$&\"\n$!\"\n$#\"\n'%\"\n'&\"\n'!\"\n!\"#$%&'()*(+,#$(\n-%.,(-,/&/(0%&1(2#3%)\"/(2)$&#4,/(\n$%\"(\"\n$'\"(\"\n\nVII. Final Design Selection to Match Specifications\nThe final prototype was a culmination of this air-removal methodology, and its\nfeatures were specifically selected to support the original design goals and guidelines.\nFigures 9 and 10 are respectively a CAD model and photo of our final design.\nFigure 9 - CAD Model Image\nFigure 10 - Photo of Final Product\n● Heating element:\n○ Nichrome strip- Doubled for extra heat and further resistance. We used\nthe smallest size nichrome strip available in small quantities, which gave us\na resistance of 2 ohms/foot. At 4 ohms, and 12 Volts, the power per foot was\nappropriate for sealing the bags. This required 2 feet of wire, was doubled\nover the one-foot length of the device. The nichrome strip heats and cools\nquickly and provides a very narrow application of intense heat to the plastic.\n○ Teflon tape- A Teflon- and nylon-weave tape holds the nichrome strip\nsecurely in place, also heating and cooling quickly to prevent burns from\nresidual heat. The smooth surface provided by the tape also makes cleaning\njuice off the sealing area quick and easy.\n\n● Pressure-applying system:\n○ Silicone sealing strip- Held to the lever arm with household silicone putty\nadhesive. Wide, flat geometry provides a constant pressure, pushing juice\nout of the way in order to make a strong, airtight seal. Strip is approximately\n1⁄2\" wider than the nichrome wire to give extra space clearance, minimizing\nheat lost due to surrounding juice.\n○ Spring-loaded lever arm- Two inset U-shaped channels are separated by\nsprings at each end. When compressed and latched into position against the\nheating element, the springs exert an even force on the silicone sealing strip.\nEven pressure helps squeeze out juice from the sealing area and flattens bag\nfor a smooth, continuous, and repeatable seal.\n○ Latch- An L-shaped piece of scrap steel is held with a simple screw and\nspring. The lip that holds the lever arm in place is filed smooth on the upper\nedge so the arm can be pushed into place with one hand. Once the lever arm\nis down, the latch will hold the it and its compressed springs securely in\nplace. A section of scrap bicycle inner tube is slid over the other side of the\n\"L\" for a handle. The handle is easy to depress, and the arm springs up so\nthe user can safely remove the bag. The latch has what has been described\nby D-Lab shop managers as \"satisfying action.\"\n○ Hinge- Replacing the store-bought, flimsy hinge of Prototype 1.0, we\nmachined a simple hinge out of two sheet metal scraps and three bolts. This\nhinge should be easy to construct out of any available sheet metal; plus, it's\nmuch more effective at preventing \"wobbling\" as the arm is pushed down into\nthe latched position. (This guidance is important because if the sealing strip\nis not evenly pressed on the heating element, the quality of the seal could be\ndrastically affected.) The hinge bracket facing the front of the sealer extends\nupwards approximately 1 1⁄2\" higher than the back bracket, since gravity\ntends to pull the arm in that direction. This extension, in addition to the\nsturdy hinge, guides the arm into its correct place.\n● Base:\n○ Material- Prototype 2.0 is constructed out a scrap board, but any available\nlumber can be utilized to construct the base. Two coats of finishing\nvarnish/lacquer were applied to the prototype to waterproof the wood, but\nthis is not a vital step.\n○ Slanted Orientation- A compromise between the \"Horizontal\" (Figure 2)\nand \"Vertical\" (Figure 2) orientations, the entire sealer is slanted at 45\ndegrees. This angle makes it easy to direct excess juice flow to the bowl\nbelow, to allow the full bag to hang below, and to press the arm easily into\nplace.\n○ Elevated- A troublesome problem with the Horizontally-oriented, table-top\nPrototype 1.0 was its messiness: lying a bag flat in order to seal it led to\nmany spills. Out new methodology to seal a bag without air dictates that\njuice needs to be displaced with every seal; in a way, spilling the bag is\nnecessary. A simple way to collect this runoff juice and avoid wasted spillage\nis to catch the runoff in a bowl or pot. Prototype 2.0 provides ample space for\nsuch a receptacle in the space under the elevated sealer.\n\n● Circuitry:\n○ Housing- To protect the circuitry, the housing must be as waterproof as\npossible, but also easy to access to change the time setting via the\npotentiometer wheel. A section of PVC pipe with a removable end cap is\nsealed with household Silicone putty to keep splashes of juice out of the\nelectronics.\n○ User controls- Three controls are needed to operate the device: An LED\nindicator, a potentiometer to adjust time settings, and a push-button. Two\nout of the three controls (the LED and button) are clearly visible on the\noutside of the housing, sealed with silicone. The potentiometer wheel, a\nmuch harder component to waterproof, is contained within the housing.\nSince the time required to make a seal varies with plastic thickness and juice\ntemperature, this setting should only have to be changed once or twice per\nsealing session.\n○ Redesigned timing circuit- At $26, the timing circuit was a significant\nportion of the cost of the first version. Using a fairly common 555 timer and\nappropriate valued capacitors and resistors (including a variable one, for\nadjusting timing), we made a circuit that turned on the nichrome heating\nelement for a time ranging from 3 to 30 seconds. In the original version, an\nLED would turn on for as long as the heating element was on, and the\ninstructions were to count to five after the LED went off before opening the\nsealer and removing the bag. However, we found that both in our own\ntesting and in demonstrations in the field, it was difficult for users to\nremember to wait this time. Therefore in our new timing circuit, we added a\nRC delay block that keeps the LED on for about 5 seconds after the heating\nelement is off, meaning the user can remove the bag immediately on the\nvisual cue. The circuit diagram is shown in Figure 11.\nFigure 11 - Timing Circuit Diagram\n\nVIII. Conclusion and Implementation Plan\nTo implement this project in rural communities of Nicaragua, we plan on sending the\ndevice down to AsoFenix in Nicaragua for them to distribute to the community of El Roblar\nbefore the harvesting season in January. After receiving feedback from the community on\nthe functionality of the device, AsoFenix may decide that another iteration of design is\nnecessary for the bag sealer, or they might decide that the product does not need altering. In\nthis case, they can develop a program with the community of El Roblar or another\ncommunity where these sealers are fabricated and sold to other communities that have\npreservation needs. Amy Banzaert is going down to Nicaragua this summer and has offered\nto bring our device with her to AsoFenix.\nAfter sending pictures of the final prototype and a description of the construction\nprocess to Aaron Liss, our community partner contact for AsoFenix, we received very positive\nfeedback. Aaron is confident that this sealer is durable and will function reliably in the field\n-so confident that the prototype will be taken to El Roblar in its current state for use by the\nfamilies there. The upcoming growing season, due to start in August, will be the ultimate\ntrial of how the device withstands the demands of a long bagging session.\nIn the course of this project we learned a lot about best practices for projects such as\nthese and have included a list of tips/advice that we would like to offer to future groups doing\nsimilar work. These Tips are located in Appendix B.\nLooking back at our design Pugh Charts and Specification Sheets, we accomplished\nwhat we set out to accomplish and hope that the device will be well received in El Roblar.\nHowever, this device is not just something that fits into one community, it can be\nimplemented in many different regions where sealing a bag is necessary. Of the many\nalternative uses we thought of are sealing other liquids, grain, coffee beans, or even\nimportant papers to protect them from the elements.\n\nAppendix A: Reference to Wiki Page\nAccess can be granted to our wiki website, which documents our decision process,\nclass notes, photos from the trip, and presentations given throughout the semester. Request\naccess from Amy Banzeart in D-Lab.\n\nAppendix B: Advice for Future groups working on Projects in the Developing\nWorld\nWe don't consider ourselves experts on projects in the developing world, but we\nlearned a lot leading up to our Spring Break trip, during our time in Nicaragua, and over the\ncourse of developing our project. Here's a bulleted list of tips that we would tell ourselves if\nwe were to start the process anew.\n-\nAlways ask questions, never underestimate the importance of good\ncommunication with your community partner. Communities are constantly\nchanging. Don't assume that everything will remain exactly as you experience it or\nhow you have heard it described to you. If we had known to ask about the available\npower sources in El Roblar before we went down to deliver the bag sealer, we may\nhave had time to alter the previous design and deliver a working model. But instead,\nwe had to leave El Roblar carrying the device. A special Thank you to Aaron at\nAsoFenix for being a great communicator and helping us along with our project.\n-\nAlways ask questions of the people in the communities. Never assume\nanything about a process or task that is performed in the communities that you visit.\nWe went down expecting to build a washing machine in one community, but went\ndown to find that this project was not appealing to the people in the community\nbecause the way they currently wash their clothes in the river is free, and labor time\nis not limiting.\n-\nTry to learn the language! Being able to communicate without the help of someone\ntranslating for you will make gathering information so much easier. It will also\nmake your visit that much more enjoyable because you are able to interact with the\namazing people you will meet in the community.\n-\nBring a small pocket sized notebook. Being able to write stuff down quickly and\nwithout interrupting a conversation is invaluable. Whether it's a local word you\nhaven't heard before or a specification for a project you're thinking of developing, you\nwill constantly be wanting to jot an observation down.\n-\nKeep Things Simple, Build and Test Early. Upon your return to D-Lab, you don't\nhave much time to develop a working project. Get a prototype built as soon as you\ncan so you can perform all the necessary tests. Each iteration of the model will get\nbetter.\n-\nDocument All Processes Well. Doing this will help you write your final report and\nmore importantly will help build the foundation for future teams to build off of your\nwork.\n\nAppendix C: Timing Test Data\nPlease see the following charts.\n\n! \" # $\n%\n%\n& %'( '\n%\n\n)\n)\n%\n%\n& %'( '\n*\n\n)\n)\n%\n%\n& %'( '\n\n)\n) +\n%\n%\n& %'( '\n*\n,\n) +\n%\n%\n& %'( '\n'\n,\n) +\n%\n%\n& %'( '\n\n,\n- . ! / +\n%\n%\n& %'( '\n%\n,\n/ ! 0 . - +\n%\n%\n& %'( '\n,\n/ ! 0 . - +\n-\n\n$\n%\n\n'( &1 '\n%\n\n/ ! 0 . -\n%\n\n'( &1 '\n*\n\n/ ! $ \" \" !\n%\n\n'( &1 '\n\n/ ! $ \" \" ! +\n%\n\n'( &1 '\n\n$22 + \" \" + $ \"\n%\n\n'( &1 '\n%\n/ ! 22 + \" \" +\n%\n\n'( &1 '\n*\n! 2 \" / !\n%\n\n'( &1 '\n'\n! 2 \" / !\n$\n\n$\n%\n(\n1%\n'\n%\n\n/ ! $ \" \"\n%\n(\n1%\n'\n*\n\n/ ! $ \" \" ! +\n%\n(\n1%\n'\n\n$22 + \" \" + $ \"\n%\n(\n1%\n'\n\n! 2 \" $22 + \" \" +\n' /\n\n-\n)-\n\n+ ).\n%-#\n\n\"\n#\n\n%& $-\n-%\n#\n\n+ , * )\n#\n\n%& $-\n-%\n'\n\n+ \" ! ! (\n#\n\n%& $-\n-%\n\n\".. ( ! ! ( \" !\n#\n\n%& $-\n-%\n\n\".. / 0. ! . !*\n#\n\n%& $-\n-%\n#\n\".. / * .1\n#\n\n%& $-\n-%\n'\n\".. / * .12 !. #\n)- 3\n\n\"\n#\n\n%& $-\n-%\n%\n\".. / * .1\n#\n\n%& $-\n-%\n%\n\".. / * .1 +\n#\n\n%& $-\n-%\n%#\n. ! \"..\n\"-\n\n\"\n#\n&\n-#\n-%\n#\n\n\".. / 0. ! . !*\n#\n&\n-#\n-%\n'\n\n\".. / * .1\n#\n&\n-#\n-%\n\n\".. /\n#\n&\n-#\n-%\n\n\".. / +\n#\n&\n-#\n-%\n#\n. ! \"..\n+\n\nAppendix D: User Manual (English)\nPlease see the following manual.\n\nMIT D-Lab:Energy in partnership with AsoFenix\nPlastic Bag Sealer Manual: May 10, 2011\nProcess 1.\nPowering the Device.\nStep 1.\nPlug into 120 V AC wall outlet if available.\nIf no wall outlet, acquire 12V battery and attach to lead wires.\nProcess 2.\nCalibrating for the specific type of plastic.\nStep 1. Rotate the adjustment wheel[\n]clockwise to seal for longer time (thicker\nplastic), and counter clockwise for a shorter sealing time (thinner plastic).\nStep 2. Sealing Bags\nStep 3. Analyze seal. Melted Plastic or a break in the bag means you are sealing too\nlong. A perforated seal or a weak seal means you are sealing for too short of a time.\nStep 1.if the seal is not desirable.\nExample of melted seal\nExample of perforated seal\nProcess 3.\nSealing Bags\nStep 1. Make sure the circuit box is sealed closed. Step 2. Place bag along sealing edge.\nStep 3. Close lever arm through the part of the bag with liquid about 1 inch below the top\nof the fluid, try to keep the bag from folding up.\nStep 4. Press button. LED lights up.\nStep 5. When LED turns off, release excess liquid into spill pot, pull latch to open the\nlever arm, and remove bag.\n\nAppendix E: User Manual (Spanish)\nPlease see the following manual.\n\n!\"#$%&'()*+,-./0($-,$123()2.(145,$12,$6728-,49$\n\",7:.;1142,-7$<(.($-3$=-33(>2.$>-$?237(7*$@A$!(B2$CA@@$\n!\"#$%&#'()'*+,-#'./%$0\"1$1-+-'+/'2%//+-#\")'\n!+&#'()'\n=4$<2774)3-D$-,1E;F-$-3$(>(<:2.$(3$@CA$G$6HI$\n=4$,2$E(B$.-1-<:2.D$12,-1:-$327$1()3-7$($;,($)(:-.0($>-$@CGI$\n!\"#$%&#'3)'456&0+,-#'%/'2%//+-#\"'7#\"'%/'817#'-%'!/9&01$#)'\n!+&#'()'%-3-$J;-3:($K$$$$$$$$L$($3($>-.-1E($($3($.;->($>-$1(34).(145,$<(.($(;M-,:(.$-3$:4-M<2$>-$\n7-33(.$N<(.($<3O7:412$MO7$/.;-72PD$2$>-3-$J;-3:($($3($4QR;4-.>($($3($.;->($>-$1(34).(145,$<(.($\n>4M4,;4.$-3$:4-M<2$>-$7-33(.$N<(.($<3O7:412$MO7$>-3/(>2PI$\n!+&#'3)'+D]HOSURFHVR 2%//+,-#':#/&+&μ$\n!+&#';)$$!4.-$(3$7-332I$$S3O7:412$>-..-:4>2D$2$<3O7:412$.2:2$74/,4F41($R;-$-3$:4-M<2$>-$7-33(.$-7$\n>-M(74(>2$3(./2I$$T,$7-332$<-.F2.(>2D$2$;,$7-332$>U)43D$4,>41($R;-$-3$:4-M<2$>-$7-33(.$-7$\nGHPDVLDGRFRUWR5HSLWD !+&#'()μVLHOVHOORQRHVWiELHQ$\n'''''''!+&#'3)$$S2,$3($)237($($:.(JU7$>-3$M(./-,$>-3$$$$$$$\n$$$$$$$7-33(>2.I$\n$$$\n'\n'\n'\n'\n$$$$\nI$\n$\n$\n+V-M<32$>-$;,$7-332$>-..-:4>2$$$$$$$$$$$$$$$$+V-M<32$>-$;,$7-332$<-.F2.(>2$\n!\"#$%&#';)'2%//+,-#':#/&+&)'\n!+&#'()$$67-/;.-7-$R;-$3($1(V($>-3$14.1;4:2$-7:O$1-..(>(I$\n$$$$$$\n'\n!+&#';)$$H4-..-$-3$).(Q2D$<(7(,>2$($:.(JU7$>-$3($<(.:-$>-$3($)237($R;-$33-J($V;/2I$$%-)-$-7:(.$\n(<.294M(>(M-,:-$>27$1-,:4M-:.27$N;,($<;3/(>(P$>-)(V2$>-3$,4J-3$>-3$V;/2I$$+J4:-$(..;/(7$-,$\n-3$<3O7:412\n!+&#'<)'$#2R;-$-3$)2:5,I$$'($3;Q$-,1-,>-.OI$\n'\n'\n'\n'\n!+&#'=)''H;(,>2$(<(/;-$3($3;QD$)2:-$-3$-91-72$>-$V;/2$($3($233(D$-M<;V-$-3$1-..2V2D$().($-3$\n).(Q2D$B$7(R;-$3($)237(I$\n$\n$\n$\n$\n\nWorks Cited\n\"Background Note: Nicaragua.\" United States Department of State. January 18, 2011.\nAccessed\nMay 1, 2011. http://www.state.gov/r/pa/ei/bgn/1850.htm\n\"Low Energy Bag Sealer Final Report.\" Liburd, Shannon et al. MIT D-Lab: Energy. May\n12, 2010.\n\"Plastic Properties of Low Density Polyethylene.\" Dynalab Corporation. Accessed May 4,\n2011.\nhttp://www.dynalabcorp.com/technical_info_ld_polyethylene.asp\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Solar Cellphone Charger",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/98bd865f3f4ffaeeb99fbc1c3c3c18be_MITEC_711S11_proj_rptchrg.pdf",
      "content": "Abstract\nFollowing a research trip to Sabana Grande, Nicaragua during which we looked into a\nvariety of different problems faced by the local population, we worked towards designing\na solar-powered cell phone charger that can be built indigenously. This was found to be\nof primary importance because of the large number of cell phone owners in Sabana\nGrande with no access to grid electricity, meaning that they are forced to pay C$ 5-10\nper charge for their cell phone, which adds up to a significant investment over time.\n\nTo address this concern, our team worked with a cooperative in Sabana Grande who\nalready make and install large solar panels in the town. We designed a small charger\npanel and the associated circuitry to eliminate the need to cut the solar cells, getting the\nappropriate voltage and power output through a DC-DC step-up converter. We designed\na final prototype that should be able to charge any of the commonly used local phones in\n10-12 hours of direct sunlight.\n\nProblem Statement\nCommunity Background\nThe area where the project will be implemented is located in the district of Sabana\nGrande in the Northern part of Nicaragua. The closest city is Ocotal, accessible via a 15-\n20 minute bus ride made relatively frequently by a number of Sabana Grande\ninhabitants. The region is home to the 'Solar Center' which is a building complex where\nthe locals make PV Panels for use in the community. 20 women and two men from the\narea make up a cooperative called the Solar Women of Totogalpa, a group dedicated to\nthe research and implementation of sustainable energy systems. Together with a\nManagua-based group called GrupoFenix, whose mission includes helping such\ncommunities, the Solar Women have created a center in which their research can be\ncontinued.\n\nOne such research project includes the implementation of homemade solar panels built\nby the two male technicians in the cooperative. Made from industrial reject PV cells that\nthey can buy for an affordable price, these panels have brought electrical power to many\nhomes in the surrounding area that would otherwise be without access to electricity.\n\nThe current method for making these solar panels involves cutting solar cells into even\nquarters which they then connect in series. Since each quarter outputs the same voltage\nas the original cell, they do this to step up the overall voltage output. They then\nencapsulate this assembly in silicone and cover it with a glass casing within an\naluminum frame.\n\nThe PV cells and Silicone Encapsulation are shipped in from the States by their\nAmerican contacts. Each of the solar cells they ship in measures 8X15 cm and has a\nvoltage output of 0.5V and a max current output of 2 A. They split the cells into four parts\nand then connect them in series to step up the voltage output from the complete\nassembly to 6 volts.\n\nCurrently they have already manufactured one panel for recharging cell phones. These\npanels are made using 3 original cells that are split into 4 smaller cells each (Making 12\nsmall cells in total) which are wired in series for a voltage output of 6 V. The voltage is\ndropped over a resistor to the required voltage to recharge the battery.\nUnfortunately, when the cells are cut, many of them break and hence are cost\nineffective. They do not have access to laser cutting technology and mechanically\ncutting the cells leads to a large amount of wastage. The cells must also be cut larger\nthan the theoretical area because of the efficiency lost at the cut edges.\nTo solve this problem, we have developed a circuitry attachment that can be attached to\na panel consisting of three 'original cells,' which together will output 1.5V. The\nattachment will step up the voltage to the required amount (5V) while regulating the\ncurrent during the charging process. It will hence eliminate the need for them to cut cells\nand hence save money.\nDesign Specifications\nThese were the considerations we took into account while designing our project:\n1) The finished product should cost less than $20 in order to compete with the $20\nChina-made model available in Managua\n\n2) The entire system should be built indigenously built in order to provide jobs and a self-\nsustaining production system\n3) The product should be easy to visualize and should minimize design complexity, but\nshould be durable and able to resist damage when handled on a daily basis\n4) It should be aesthetically appealing and easy to use so that the public can use it\nwithout assistance\n5) The product should be able to charge a cell phone in a similar time frame to the\ncurrent method, meaning within 6 hours for a complete charge cycle.\n6) The product should be versatile and charge the different cell phone brands available\nin the community\n\nFinal Design\n\nOverview of Design\n\nFig. 1: Final Prototype\n\nThe prototype uses a simple hinged system which serves two purposes:\n1) To angle the panel towards the sun so as to maintain a perpendicular planar angle.\nThe panel is held in position by a notched wedge system\n2) To protect the circuitry and phone from any light rain that may begin before the user\nhas a chance to bring the system indoors.\n\nIts compact design makes it portable, while its easy-to-use plug makes it simple for\nanyone to use. Three solar cells (shown below left) produce a voltage difference of 1.5V.\n\nThis is fed into the internal circuitry which is covered by the metal panel next to the hinge\n(shown below right) where it is stepped up to an even 5V using a differential amplifier in\nconjunction with the required circuitry (See Fig 5). This is the required voltage input to\ncharge any of the cell phones we encountered in Sabana Grande.\n\nFig. 2: Top Panel, 3 Solar Cells Fig. 3: Inside, Circuitry under metal panel\n\nIndigenously Designed\nThe system is designed so that it can be assembled completely from scratch with the\nresources available to our community partners. Some components (namely the solar\ncells and some circuitry components) need to be imported into the community by their\nAmerican contacts but, since this occurs anyway, we do not think it will be a problem.\n\nFig. 4: Images of Solar Panels currently in production\n\nSimplicity\nWe designed our system and internal circuitry so that it could be easily reproduced given\ndesign schematics. The actual building process does not involve complex machining or\nelectronics. The external design is intuitive and easy to understand while the internal\ncircuitry is easy to assemble given a circuit diagram.\nThe circuit itself, shown below, can easily be built by the local engineer. The circuit\ndiagram at its left is a very simple one, with all parts except the step-up chip itself\navailable locally.\n\nFig. 5: Circuit Diagram and Final Circuit using this Setup\n\nAesthetics, Durability, and Usability\nThe design is compact and robust. It is not overly ornate but looks clean and efficient,\nsuch that the public will enjoy using it. It is a very clean and simple product which will not\nrequire people to change the way they approach charging their cell phones since we\nhave included the same ports that are sold with grid adapters. If any problems occur, it is\neasy to take apart for the engineer to troubleshoot. That being said, the design itself is\nhardy and will not come apart easily\n\nRather than using moving parts to adjust the angle, we developed a simple wedge\nsystem. Both visually attractive and more robust than more typical angle adjusting\nsystems, this ability lets the panel maintain a steady angle to the sun, with minimal effort\nrequired for adjustment.\n\nFig. 6: Notch and Wedge Adjustment System\n\nIn talking to our community partners and studying surveys on mobile phone usage, we\ncame to the conclusion that there are two main models of cell phones people use in\nSabana Grande. Our design allows for both compatible ports to be attached to our\ncharging port so as to charge both types of phones.\n\nEconomic Viability\n\nFig. 7: Cost Breakdown\n\nCost of Labor: $4\nCost of Solar Cells: $3\nCost of Circuit: $6.10\nCost of Mechanical Parts: $8.60\n\nThis translates to our product selling for $21.70 when built locally, which is a little above\nour design specification. However, we think we can cut down on this price using the\n'Green Hours' system which eliminates labor costs by allowing members of the\ncooperative to earn their own chargers by working for the cooperative for a certain\nnumber of hours. We could also potentially cut down on the costs for mechanical parts\nby using scrap material and makeshift hinges although this might adversely affect the\naesthetic appeal.\n\nMeeting the Specifications\n\nOur final design (see above) incorporates our design specifications to the greatest extent\npossible. Its cost has been maintained at just over the $20 specified (see below) through\nthe use of low-cost and locally available materials. For instance, protoboards are not\n\neasily available in Sabana Grande, but breadboards are, so our final design has\nincorporated a breadboard, made more permanent with the addition of hot glue and tape\nto keep the pieces in place.\n\nThe local engineer is more than capable of assembling this system, there might even be\na possible way to create a handmade DC-DC step up circuit which would circumvent the\nmicrochip and decrease costs by an estimated $5.\n\nThe simple hinged design lets the user set the angle of the panel perpendicular to the\nsun, adjusting it as necessary throughout the day, while using durable materials with as\nfew moving parts as possible. Rather than hinged levers to set the angle, we developed\na wedge system to simplify the system and lower costs. While the panel can still be\nadjusted to any angle, our system eliminates pieces that may break with use.\n\nBecause of its simple design and no naked circuitry, the system can be used by the\npublic without fear of breaking or damaging it. They only need to plug in the phone,\nadjust the angle, and point it towards the sun. If troubleshooting is required, the engineer\nat the Solar Center should be able to easily access the internal circuitry to hone in on the\nproblem.\n\nThe main shortcoming of the current design is that it takes roughly 10 hours to charge a\ncell phone. While this does not meet our initial 6-hour specification, we are hopeful that\nwhen exposed to tropical sunlight, the time to complete a charge cycle might drop to\napproximately 8 hours.\n\nBecause of the ease with which a port can be attached to the output leads, the\npossibility to attach multiple connectors to a single device remains, giving our product\nversatility in terms of charging different cell phone brands.\n\nTesting and Results\nOnce the solar cell phone charger prototype was completed, it was necessary to test its\nreal life performance. Our main goal at the beginning of this project was to have a cell\nphone charger that could charge a fully discharged cell phone in less than 6 hours. To\ntest if our model could fulfill this task, we measured the power coming out of our circuit\nand into the cell phone and compared it to the energy capacity of the battery we were\ncharging.\n\nCharging Time\nThe energy capacity of the cell phone batteries is 800 mAh. If we test the amperage\noutput of our charger, we could figure out around how long it would take for the cell\nphone battery to charge completely.\n\nExperimental set up:\nIt was necessary to understand the amount of power going in to our circuit from the solar\ncells, and the amount of power coming out of the circuit and into the cell phone. To find\nboth of these values, our device was set up as seen in figure 8 below.\n\nFig. 8: Experimentation Images\n\nWe attached two digital multimeters that measured the current and voltage output in real\ntime from the leads coming out of the solar cells so that we could calculate the power\ninput when the device was working. Moreover, we also attached two multimeters that\nmeasured the current and voltage output from our internal circuit, which allowed us to\ncalculate the power output.\n\nUsing this data, we could contrast the values and make an estimate of the efficiency of\nour circuit and of the time needed to charge the battery. Once the apparatus was set up,\nwe used varying amounts of light to shine on the solar panel. We then measured the\ndifferent input and output power values. We did this for 8 different amounts of light,\nincluding 2 different lamps, and sunlight.\n\nResults:\nThe graph below plots the power data in Watts for the input power, or power that was\nmeasured out of the solar cells, and output power, or powered that was measured out of\nthe circuit. The slope shows the efficiency of the circuit, and how much power is lost in\nthe circuit.\n\nFig. 9: Input-Output Data Graph. Figure above shows the\ninput and output data for the solar cell phone charger. Note\nthe linear fit on the input over output data.\n\nFrom data that was collected while in Nicaragua, we were to estimate how much power\nthe circuit would output if it was in Nicaragua. This data is shown in the graph below.\n\nFig. 10: Input-Output Data Graph Extended. Figure showing\nthe projected efficiency calculated using data of solar panel\noutput from Nicaragua\n\nConclusions of testing\nThe experimental data lead us to conclude that the output Amperage of the circuit, if\nused in Nicaraguan sun, could be about 80 to 100 milliamps. From this data, we\nestimate that if a cell phone battery were fully discharged, it would take about 10-12\nhours for it to fully charge (the battery has an energy capacity of 800mAh). Realistically,\nmost cell phone batteries are charged from half charge, reducing the time needed to\ncharge.\n\nConclusion\nWe consider the project to be a successful attempt at supplementing their energy\nrequirements while maintaining economic viability. Our initial goal was only to develop\nthe economically viable circuitry required to step up the 1.5V to 5V. On developing the\ncircuitry, we decided to prototype the entire system and did so successfully.\n\nThere are a number of ways to further optimize this system. We intend on sharing our\nresearch with our community partner and working with them to continue development on\nthe system. The project has a lot of potential to be implemented in the community and\nwe are eager to see it in action.\n\nBased on our conversations with the community, they seem to have received the design\nvery well. Mauricio and Lindsey of the Solar cooperative have agreed to work with us\nduring the month of June to try and develop a version of our charger that can be built\nusing only locally available parts (as opposed to importing the microchip).\n\nAs of now, we plan on sending them detailed schematics of our product along with the\ncomponents required to build their version of our prototype. We could then work with\nthem on further optimizing the model to suit their specific needs.\n\nWe highly recommend that another D-lab group take up this project and work on further\noptimizing it and reducing costs, possibly developing alternative ways to step up the\nvoltage without the use of expensive components like the differential amplifier.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teamwork self-assessment rubric",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/90f493cdd582cf2a1cde3aec846fda5a_MITEC_711S11_proj_teamass.pdf",
      "content": "Attendance\nPreparation\nParticipation\nQuality of\nWork\n5 - Attended all meetings, or\nif they missed one, they had\na good excuse, contacted\nyou and made up what they\nmissed\n4 - Attended all but one or\ntwo meetings, generally let\nyou know in advance, but\ndidn't make up the work that\nthey missed\n3 - Missed several meetings,\nand seemed to have good\nexcuses, but after the fact\n2 - Missed the majority of\nthe meetings and never let\nyou know\n1 - Who is this?\n5 - Came prepared, did\neverything that they said\nthey would and even a bit\nmore...\n4 - Came prepared, did most\nof what they were assigned,\nseemed to have good\nexcuses when they weren't\nprepared\n3 - Was usually unprepared,\nbut at least made an effort to\npretend that they had done\nsome work\n2 - Was always unprepared,\nand really didn't seem to\ncare\n1 - Who is this?\n5 - Was proactive and took\n5 -Consistently\nthe lead on projects and at\ndid excellent\nmeetings and did more than work\nwas asked of them\n4 - Did everything that was\n4 - Did good\nasked of them, volunteered\nwork\nat the meetings\n3 - Was there, but didn't\n3 - Did\nreally volunteer, did things\nmediocre work\ngrudgingly when asked\n2 - Never volunteered, did\n2 - Did poor\nnot contribute to projects,\nwork\nwas more of a negative\ninfluence than a positive\none\n1 - Who is this?\n1 - Who is this?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 8: Presentations & the Design Process",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-711-d-lab-energy-spring-2011/354861c275307274f72816ce94549d27_MITEC_711S11_lec8.pdf",
      "content": "D-Lab: Energy\nWeek 8: Presentations &\nthe Design Process\nFinal presentations in 6 weeks!\nFriday, August 5, 2011\n\nAGENDA\n- Presentations\n- Quick Design Process Review\n- Brainstorming & Project Pugh Charting\n- Follow-up Presentations\nFriday, August 5, 2011\n\nDESIGN IS HARD...\n- Tradeoffs\n- Dynamics\n- Details\n- Time Pressures\n- Economics\nFriday, August 5, 2011\n\nDESIGN IS HARD...\n- Tradeoffs\n- Knowledge of the user\n- Dynamics\n- Experience with the need\n- Details\n- Ethical concerns\n- Time Pressures\n- Extreme design constraints\n- Economics\n- $, robustness, usability, mfg & distribution\nstrategy, transparency\nespecially for\ndeveloping countries\nFriday, August 5, 2011\n\nDESIGN IS HARD...\nand rewarding... especially for\ndeveloping countries\n- Tradeoffs\n- Knowledge of the user\n- Dynamics\n- Experience with the need\n- Details\n- Ethical concerns\n- Time Pressures\n- Extreme design constraints\n- Economics\n- $, robustness, usability, mfg & distribution\nstrategy, transparency\nFriday, August 5, 2011\n\nTHE DESIGN PROCESS\nFriday, August 5, 2011\n\nTHE DESIGN PROCESS\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Concept Evaluation\n- Analysis & Experimentation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\nFriday, August 5, 2011\n\nTHE DESIGN PROCESS\n- Planning\n- Mission Approval\n- Concept Development\n- Concept Review\n- System-Level Design\n- System Spec Review\n- Detail Design\n- Critical Design Review\n- Testing & Refinement\n- Production Approval\n- Production Ramp-up\nFriday, August 5, 2011\n\nTHE DESIGN PROCESS\n- Information Gathering\n- Planning\n- Problem Definition\n- Mission Approval\n- Design Specifications\n- Concept Development\n- Idea Generation\n- Concept Review\n- Concept Evaluation\n- System-Level Design\n- Analysis & Experimentation\n- System Spec Review\n- Detail Design\n- Detail Design\n- Fabrication\n- Critical Design Review\n- Testing & Evaluation\n- Testing & Refinement\n- Production Approval\n- Production Ramp-up\nFriday, August 5, 2011\n\nPUGH CHART\nImage removed due to copyright restrictions.\nSee http://web.mit.edu/2.009/www/labs/lab2picture.jpg\nFriday, August 5, 2011\n\nGANTT CHART\nImage removed due to copyright restrictions.\nSee http://upload.wikimedia.org/wikipedia/en/7/73/Pert_example_gantt_chart.gif\nFriday, August 5, 2011\n\nBEST PRACTICES\n- timeline minder\n- are we hitting our dates? what can we do RIGHT NOW?\n- goal minder\n- is what we're doing getting us closer to our goal?\n- community partner liaison\n- documentation (photos & wiki)\n- fail fast\n- prototype early\n- identify your dealbreakers immediately (physical\nimpossibilities)\nFriday, August 5, 2011\n\nOUR DESIGN PROCESS\n- Planning\nEverything until today\n- Mission Approval\ntoday-4/1\n- Concept Development\n4/1-4/8\n- Concept Review\n4/8 project spec. disc.\n- System-Level Design\n4/9-4/15\n- System Spec Review\n4/15 Design Review\n- Detail Design\n4/16-4/22\n- Critical Design Review\n4/22 Design Review\n- Testing & Refinement\n4/22-5/6\n- Production Approval\n5/7 Final Presentation\n- Production Ramp-up\n[plans in final report]\nFriday, August 5, 2011\n\nREMAINING DELIVERABLES\nFriday, August 5, 2011\n\nNOW\n- finalize problem definitions for D-Lab Energy-relevant projects\n- compare using Pugh chart method\n- criteria??\n- 2:30 - 1-minute pitches for each possible final project and 3 minutes\non Pugh chart pros/cons\nFriday, August 5, 2011\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.711 D-Lab: Energy\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}