{
  "course_name": "D-Lab II: Design",
  "course_description": "D-Lab: Design addresses problems faced by undeserved communities with a focus on design, experimentation, and prototyping processes. Particular attention is placed on constraints faced when designing for developing countries. Multidisciplinary teams work on semester-long projects in collaboration with community partners, field practitioners, and experts in relevant fields. Topics covered include design for affordability, design for manufacture, sustainability, and strategies for working effectively with community partners and customers. Students may continue projects begun in EC.701J D-Lab I: Development.",
  "topics": [
    "Engineering",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "Society",
    "The Developing World",
    "Engineering",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\n2 sessions / week, 1.5 hours / session: a mix of lectures, in-class activities, labs, guest speakers, and project work.\n\nPrerequisites\n\n2.670 Mechanical Engineering Tools\nor permission of the instructor.\n\nThis course builds on\nEC.701J/11.025J/11.472 D-Lab: Development\n; however, it is not a prerequisite.\n\nCourse Goals\n\nTo learn about the design process\n\nTo develop technical solutions for underserved communities\n\nTo practice creative design in a real-world context\n\nTo learn hands-on prototyping and manufacturing skills\n\nTo develop problem solving and critical thinking skills\n\nTo recognize the potential impact of engineers in the world\n\nOverview\n\nIntroduction\n\nD-Lab courses fall into three main categories: development, design, and dissemination. D-Lab: Design is a design studio course in which students learn about design and work to create technologies with underserved communities. Unlike other sector-specific courses, D-Lab: Design projects may address challenges in health, energy, agriculture, shelter, transportation, water, sanitation, and more. The course consists of case studies, hands-on labs, guest speakers, and a guided design process with biweekly review sessions with experts and professionals in development and design. Students work in multidisciplinary teams on term-long projects in collaboration with community partners, field practitioners, and experts in relevant fields. Students are exposed to many hands-on fabrication and prototyping skills relevant to product development at MIT and manufacturing in their partner community.\n\nMini Project\n\nThe mini projects help students gain more familiarity with the creative design process in a short period of time, while getting to know and bond with their classmates by working in teams.\n\nWe believe in learning by doing, and mini project teams are encouraged to try going through the entire design cycle for as many iterations as possible. It is incredibly difficult to get very far on a challenge in such a short time, but by the end of the mini project, teams usually have at least learned more about a topic and have built rough prototypes / models. Please see the\nmini project assignments\nfor more information.\n\nDesign Challenges\n\nAs this is a project-based course, the instructors provide a selection of design challenges that are connected to strong community partners and are appropriate for a team of undergraduate students to make good progress on within a semester.\n\nThe challenges are often proposed directly by community partners or identified when D-Lab teams are working in the field. Students select challenges based on their skills and interest, and are grouped into teams that have a diverse set of skills and backgrounds represented. Considerations include making sure that each team has at least one person with strong fabrication skills who can help the team learn how to prototype, or at least one person with the necessary language skills to communicate with the community partner when applicable. In areas where teams may have limited knowledge and experience, they can consult with D-Lab mentors, design reviewers, staff, and other local experts.\n\nIt is important for teams to be in good, regular contact with their community partner throughout the semester, as the design project is a collaborative process and will not turn out well without input from people who are facing the challenges being addressed. After the semester, students may choose to continue their project by applying for summer fellowships to travel to their community partners and taking their work into one of the D-Lab classes focused on dissemination, such as\nDevelopment Ventures\n,\nD-Lab: Dissemination\n, and\nD-Lab: Supply Chains\n.\n\nBuild-It Modules\n\nBuild-It modules are hands-on opportunities to learn how to use a variety hand tools, machine tools and prototyping equipment in project-based training sessions.\n\nStudents increase their level of comfort and confidence with working safely in the shop, while making devices that can be useful in the field, such as hand-held corn shellers and charcoal-powered heat sealers. Each project teaches a different set of skills, providing instruction in topics such as welding, sheet metal fabrication, water jet cutting, basic machining, computer-aided design and other topics that are particularly relevant to prototyping the design projects. Students choose which module to take based on their interest in the project / skills taught, and are encouraged to coordinate with their teams to gain a variety of experiences that they can then share with each other.\n\nCase Studies and Guest Lectures\n\nInstructors and guest speakers offer lectures and case studies on a variety of technologies and how they relate to design in developing countries. Students are then asked to apply the material presented in class to their own design projects. This aspect of the course varies from year to year; see the\ncalendar\nfor more information about what was covered this year.\n\nDesign Review Sessions\n\nThese are biweekly design reviews where teams present their progress and show their latest prototype to a panel of consultants, who offer feedback and guide students through the design process. Reviewers have included instructors from different fields, experts from industry, development workers and even D-Lab alumni, bringing a diverse range of experiences and perspectives from design, manufacturing, and field work.\n\nFinal Presentations\n\nTeams show their final prototypes during the D-Lab Spring Showcase, held at the MIT Museum on a Saturday near the end of the term. The Spring Showcase is an annual event where D-Lab classes share their work from the spring semester with the MIT and greater Boston community. Student teams give short presentations/pitches and hands-on demonstrations of their projects. This is an opportunity for students to get questions and feedback from a larger audience and see what other D-Lab classes have been doing. The event is open to the public.\n\nMore about the Spring Showcase:\nD-Lab Showcases Technologies That Students Developed to Impact Our World\n\nTextbooks\n\nThe required textbook is Polak, Paul.\nOut of Poverty\n. Berrett-Koehler Publishers, 2008. ISBN: 9781576754498.\n\nReadings\nfrom a variety of other sources are also assigned throughout the course.\n\nCourse Logistics\n\nDesign Team Meetings\n\nThe design projects are an integral part of the class and will be done in teams of four students. Each group will schedule a project meeting time and will meet regularly throughout the semester. Meeting spaces at D-Lab are available for teams to use and tend to be stocked with white boards, flip charts, post-its, colorful markers, props and devices to fidget with, books and other resources to help with brainstorming and sharing ideas. The hallway also has boards for teams to post up sketches, ideas, questions and challenges to invite feedback from people passing by.\n\nCollaborative Use of Work Spaces\n\nThe D-Lab workshop provides teams with access to prototyping equipment and space, as well as many different types of materials (including wood, metal, plastics, electronics, and agricultural substances).\n\nThere is also a D-Lab library with reference books and videos on many topics in development, which can be checked out. For any specialized equipment or resources that D-Lab does not have, students have access to other workshops and libraries on campus. Each team also has a small budget to purchase additional tools, materials and resources. There are transparent containers on shelves for project storage and a labeling system using colored tape for items that are difficult to move. Teams are asked to be respectful of the shared space, equipment, and materials by checking in about any uncertain items before using them, as the shop can be in a state of creative disorder when many people are working in there at once (including teams from multiple classes, D-Lab staff and student researchers). A shared space also provides many opportunities for collaboration - innovative new ideas often happen when people working on different things collide and cross-pollinate.\n\nSafety\n\nSafety is taken very seriously at D-Lab, and all students receive training and agree to the D-Shop rules before working in the shop. While students have the key code for 24-hour access the workshop, they cannot work alone and need to have a staff member present any time they are using unfamiliar equipment.\n\nShop Rules (\nPDF\n)\n\nAttendance and Participation\n\nA student's presence and involvement in class is important, as most sessions involve discussion, hands-on activities and exercises. Much of this work is also done in teams and would be affected by absent students. For the design projects, the level of a student's commitment and engagement will matter not only to the team, but to specific communities. As Amy often says, D-Lab is about working on real projects with real people, and with that comes a real responsibility.\n\nGrading\n\nThis is a twelve-unit class: three hours a week will be spent in class, two hours will be spent in scheduled group meetings and the remaining time will be spent on readings, homework and design projects.\n\nBecause much of the work for this class will be done during class time, attendance is essential. Students missing a class meeting should notify the instructors in advance and make arrangements to make up the work. Missing more than two sessions (classes or project team meetings) without making up the work will result in a reduced grade.\n\nThis class is graded on an A/B/C/F basis. Furthermore, it is a class where your work is impacting the lives of people around the world and we expect an appropriate level of commitment.\n\nACTIVITIES\n\nGRADE %\n\nClass participation and attendance\n\n15%\n\nHomework assignments and design notebooks\n\n30%\n\nMini project\n\n10%\n\nDesign review session\n\n25%\n\nFinal design/prototype\n\n20%",
  "files": [
    {
      "category": "Assignment",
      "title": "Book Group assignment sample: paper on Gaviotas",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/29d74e7c40987b1f91f08f3ba4535780_MITEC_720JS10_hw16Gaviots.pdf",
      "content": "Gaviotas is the story of a visionary settlement built in barren savannas of eastern Columbia,\nbased on the concept that if people could find a way to survive sustainably there, they could do\nso anywhere. Over the years, many engineers, teachers, doctors, and students (mostly from\nColumbia, instead of foreigners) found their way to Gaviotas, often with the help of Paolo\nLugari, the founder of Gaviotas. Many of them were so charmed by the sense of community and\ntheir own sense of purpose in Gaviotas that they extended their visits to many years - some even\nstayed for decades. The result of their living in Gaviotas is an impressive collection of innovative\nideas for sustainable life, ranging from solar water heaters to low-cost windmills, from solar-\npowered passively-cooled hospitals to methods of replanting rainforest in a way that generates\nprofit.\nThe book Gaviotas tells the stories of these inventions, the people who made them possible,\nthe cultural and environmental context in which they were developed, and the obstacles that\nGaviotas faced in implementing their ideas on a large scale. Besides enjoying the story it tells,\nwe can also learn from the success and failures of Gaviotas.\nLugari emphasized multiple times that he was not trying to create a utopia, but instead a atopia\nmeaning 'a place,' Somewhere to simply prove to the world that sustainable methods of living\nwere possible and comfortable, even in conflict-ridden Columbia, where a long history of\npolitical conflict and drug trafficing had drained people of hope for the future.\nBecause most Gaviotans were Columbians, including Guahibo indians native to the regions\nsurrounding Gaviotas, they had a personal stake in understanding and solving the many problems\nthey faced. Inhabitants were provided with living quarters and food. Many were so content with\nthe often minimal lifestyle that they were willing to go months without pay during hard financial\ntimes. Many engineers who found their way to Gaviotas could not get enough of the hands-on\nprototype-over-sketches approach to problem solving that Gaviotas fostered. Ideas were\nfrequently discussed openly among people of all all disciplines, whereafter people went straight\nto the machine shop to realize their ideas in physical form. Even as violence broke out nearby,\nGaviotas remained immune to conflict through decades of turmoil because even the guerrillas\nrecognized the value of their work.\nThese things are indeed factors in their success, but they will be hard for us to use in D-Lab.\nWe can use many of the ideas they have sprinkled into the book about building things. For\ninstance, when they needed to create a drainage culvert, they used a large plastic bag filled with\nwater to fill the space they didn't want cement to be. Then they poured cement around it and let\nit harden. When they opened the bag and let the water drain out, they were able to remove it and\nwere left with the correct shape in the concrete. This and many, many more useful ideas are\nscattered throughout the pages of the book. If anyone is looking for inspiration, flipping through\nthe pages of this book could be useful.\nOne of the most important things that can be gained from this book is the realization that\ndesigning innovations to make the world a better place does not require a formal education. One\nof the head engineers at Gaviotas did not have a college education but was brilliant at designing\nthings. Children at the Gaviotas school put forward ideas for inventions; youths in Columbian\ncities built the Gaviotas solar water heaters after a short training period. What was important for\ncreating successful inventions at Gavatiotas was not formal education but enthusiasm, hard work,\ncollaboration with others, and a willingness and try out and refine wild new ideas.\nGaviotas found many ways to make the deserted llanos more habitable. They not only adapted\nways to live in a barren place, but also learned to make the place less barren. They undertook\n\nsignificant reforestation projects, and brought many species back to the area. By carefully\ncultivating foreign species of trees over several years, they were ultimately able to recreate a rain\nforest. As native plants took over the area, the older plants died, creating real soil which was\nmuch more fertile than the original sand, and encouraging further ecological diversification.\nThey also learned to make themselves sustainable with respect to money as well as fuel. They\ncreated so many inventions and products that one was bound to take off. In the end, they were\nable to sell pine resin as well as water to sustain themselves.\nGaviotas is the story of many people working together for a better future, for themselves and\nfor the world. It is an inspiring story; hopefully the ambition of the Gaviotans as well as their\nideas will continue to spread.\nQuestions:\n1) The Gaviotas community is relatively unique. While there are other \"ecovillages\" that aim to\ncreate environmentally sustainable communities, few have been as successful as Gaviotas in\ncreating and disseminating inventions. In the realm of innovation, how universal is Gaviotas?\nCould such a community be created anywhere, or are there specific characteristics of the people,\nthe llanos, or the Colombian political situation that make Gaviotas difficult to recreate elsewhere\nin practice?\n2) Have you seen a community similar to Gaviotas in the US? If so, in what ways did it differ\nfrom Gaviotas? If not, what aspects of the way Gaviotas works might need to change for it to be\nfeasible in the US (or other developed coutries)?\n3) Gaviotas is very community oriented. How does this effect Gaviotas's scalability? How large\ndo you think a place like Gaviotas could grow to be?\n4) From reading Gaviotas, it seemed many engineers there did not draw out their ideas in detail\nbefore attempting to create and test them. In what situations is this practice effective? In what\nsituations would it be a hindrance to creating and testing new ideas?\n5) Gaviotas was constantly threatened by lack of funding. Although the village tried constantly,\nthey were often not able to make enough profit to sustain their research and development\nventures. This was the case even though the devices they created were useful and locally\nappropriate. What might Paul Polak say about the need for aid to the village? Is aid for R&D\ninto appropriate technology different from aid for other purposes, such as simply providing\nvaccines or food?\n6) What are some obstacles to the creation of more Gaviotas-like communities? How would you\ncounter these obstacles?\n7) In developing a community like Gaviotas, which do you think is initially more important,\nenvironmental sustainability or economic sustainability? Which is more important in the long\nterm?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Cradle to Cradle - Remaking the Way We Make Things",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/3a5e69f0c604224be1699642b38110d0_MITEC_720JS10_hw16_cradle.pdf",
      "content": "Cradle to Cradle\nRemaking the Way We Make Things\n\nSummary\n- Cradle to Cradle instead of Cradle to\nGrave\n- Consumers actually use very little; the rest\nis thrown away--but there is no \"away\"\n- Waste is Food\n-\"Biomemetic\"s- Example of Ants\n\nKey Words\n- Technical Nutrients: Synthetic product that,\nalthough not part of the natural world, can be\nreused infinitely and thus do not contribute\nwaste.\n- Biological Nutrients: Organic matter that, even if\nit is waste, contributes nutrients, food, etc. to the\nnatural world.\n- Downcyling: recycling materials into lesser\nproducts, with each iteration less useful and\nmore wasteful\n\nExamples\n- Eating utensils made out of non-toxic, organic,\ncompletely biodegradable materials that \"you\ncan feel good about throwing away\" (instead of\nguilty)\n- Shoes made out of 2 parts: Sole of rubber\n(\"technical nutrient\") and upper of\nbiodegradeable material (\"biological nutrient\")\nthat you rent instead of buy; when it is worn out,\nyou return it to the manufacturer, who disposes\nof upper and reuses sole\n\n5 Steps\n- Get Free of Known Culprits\n- Follow Informed Personal Preferences\n- Create lists of materials according to their safety\nlevel\n- X List - known hazardous materials that must be\nphased out\n- Gray List - unknown or somewhat problematic\nmaterials\n- P List - known non toxic or safe materials\n- Activate the list (keep P, remove X, study Gray)\n- Reinvent-redesign of the former system\nText directly from the book\n\nQuestions!\n- Cradle to Cradle mentions the example of\ncreating carpeting out of recycled plastic\ncontainers. What could be the downside of\nsuch a project?\n\nQuestions!\n- What is the difference between upcycling\nand downcycling? Pros? Cons?\n\nQuestions!\n- What is the difference between efficiency\nand effectiveness, especially when\npertaining to eco-friendly design?\n\nQuestions!\n- Where can we get inspiration for waste-\nfree, or nearly waste free, cycling of\nmaterials?\n\nQuestions!\n- What is the danger of mixing technical and\nbiological nutrients?\n\nQuestions!\n- Cradle to Cradle mentions the example of\ncreating carpeting out of recycled plastic\ncontainers. What could be the downside of\nsuch a project?\n\nQuestions!\n- If a cherry tree would design a building,\nwhat would it be like?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework: Wheelchairs and Cook Stoves Assessment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/31ef0cd45324415016f33bc63f764da3_MITEC_720JS10_hw17.pdf",
      "content": "List the design features of each of the wheelchairs and cook stoves shown below that were driven by\nName:\neach of the 'bilities that we discussed in class. Refer to the reading assignments for additional\ninformation on the materials, techniques and processes used in the manufacture of both wheelchairs and\ncook stoves. On a separate page, discuss what you think were the major drivers of each design, and what trade-offs were made.\nWheelchairs\nStoves\nZambian\nVietnamese Child's\nFree Wheelchair\nKenyan Ceramic Jiko\nGhanaian Coalpot\nPeruvian \"Pulley\"\n\"Kavuluvulu\"\nWheelchair\nMission Chair\nStove\nstove\nDesign for\nUsability\nDesign for\nAffordability\nDesign for\nManufacturability\nDesign for\nSustainability\nDesign for\nRe-Usability\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Technology Critique Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/af9dab7cdf149584a0e98be651ea268b_MITEC_720JS10_hw3.pdf",
      "content": "Name: ____________________________\n\nTechnology: ________________________\n\n1. What are your first impressions on the technology you have just\ninteracted with? What has crossed your mind when you first read about it?\nDid you opinion change after actually using the device? Reflect on the pros\nand cons of its design.\n2. Do you think it is a successful technology? Why or why not?\nThis is the end of this part of the exercise. When you finish, stop here.\nDon't turn the page, yet!\nTechnology Critique\nDue: Feb 11, 2009\n\nWorking in your group, discuss the following issues and answer the following questions.\nAs a group, discuss the following questions.\n\n1. What problem does the technology address?\n\n2. How does it work?\n\n3. Is it a complete solution to the problem?\n\n4. Among the considerations for designing for developing countries that came up from\nthe brainstorming session last week, were:\n- Ease of use (Intuitive? Self-explanatory? Requires manuals to operate?)\n- Cost (How much does it cost? How will the user pay for it?)\n- Locally available materials/supply chains (Where was it built? How will reach\nintended audience?)\n- Income generation (Will the adoption of this technology impact the income level of\nthe user? If so, how?)\nComment on the importance and relevance of each of these criteria\n\n5. What are the benefits of this technology?\n\n7. What sort of behavioral changes does this technology require?\n\n8. What are the improvements over other existing technologies?\n\n9. What are some ways that this technology might malfunction?\n\n10. Can you think of any potential negative side effects?\n\nFor your reference, these are the market prices of the showcased technologies:\n\nIDE Drip Irrigation Kit\n\n$2.50\n\nLifeStraw\n\n$3\n\nSolar Cooker\n\n$29\n\nFreePlay Radio\n\n$50\n\nQ-Drum\n\n$50\n\nTreadle Pump\n\n$60\n\nAs homework, please answer the following questions individually:\n\n1. Research and find out what has been the impact of this technology, and present your\nfindings below. Argue why this technology has or has not been successful. (feel free to\nattach additional pages)\n\n2. Has your opinion of the technology changed at all? How?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Cast Corn Sheller (Solid Works Tutorial)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/4974d72f6e55f3b812da88af46058e3a_MITEC_720JS10_bldit_cncst.pdf",
      "content": "BUILDIT\nCast Corn Sheller\nThis project is a low-cost device for removing corn kernels from the cob. It is cast in aluminum using a\ncasting pattern made on the 3-D printer. This project is inspired by a plastic corn sheller from Malawi\nand a cast aluminum sheller from Ghana. In order to make it you will need to make a solid model of\nthe part and print it on the 3-D printer. You will use this as a casting pattern to make a cast aluminum\nsheller. To make it, you will learn to use the 3-D printer, sand blaster and various hand tools.\nMaterials Needed\nTools/Machines Needed\nABS and support material\nInduction Furnace\nfor 3D Printer\n3-D Printer\nCasting Flask\nSolidworks Modeling Program\nSand\nSand Blaster\nAluminum\nHack Saw\nFile\nRuler\nCalipers\nBUILD-IT\n\nSession 1\nEdgerton Student Shop\n& MechE Cluster\n3-D printers make three-dimensional parts by depositing material one layer\nat a time. Since each layer is put down independently of previous layers, it\nallows you to make very complicated parts with great ease.\nDifferent types of 3-D printers use different materials for making the parts.\nThe 3-D printer at the Edgerton Shop uses ABS (acrylonitrile butadiene\nstyrene) which is a tough plastic and therefore the parts it produces can\nactually be functional. However there are some limitations on the level of\ndetail that you can produce, furthermore the parts are not as strong as if\nthey were printed from solid ABS. Other 3-D printers print starch, which\nproduces parts that are more fragile, but have greater detail. We will be\nmaking a 3-D printed version of the corn sheller to use it as a casting pattern\nfor an aluminum corn sheller.\nPrinting the sheller\nA tutorial for making the SolidWorks model of the sheller can be found at the\nend of this handout. The tutorial instructs you in making a basic sheller you\nmay also add ridges or other features to the outside surface of the sheller.\nThe model should be completed before class so that it can be printed during\nclass. You will need to sand the surface of the part to make it smooth so that\nthe sand won't stick to it while making the mold for the casting. Sand paper\nis available in D-Lab.\nExamples of objects made with a 3D printer.\n\nSession 2\nFoundry\nSand cast parts are made by packing sand around a pattern, removing\nthe pattern to form a cavity in the sand and then pouring molten metal into\nthe cavity. The sand has been mixed with additives such as clay so that it\nretains the shape of the pattern. After the metal has cooled, the part can\nbe removed.\nForming the cavity and pouring the metal\nWe will form the cavity in two parts, pressing the outside surface into one\nbox of sand, and build up the inside surface on the other. Then we will join\nthe two halves together. The molten metal can then be poured into the mold.\nSession 3\nFinishing the sheller\nThe excess metal from where the metal was poured in (the sprue) should\nbe cut off, as should any metal that leaked out from the pattern cavity (the\nflash). In addition, the part can be sand blasted to give it a nice finish.\nMolds for sandcasing a corn sheller at\nSuame Magazine, Ghana, Africa.\nPouring molten metal into the molds.\nA cast corn sheller with sprues attached.\n\nSolidworks Tutorial\nby Jessica Leon, updated by Mike Kozlowski, February 2010\nSolidWorks is installed on MechE computer clusters in the following labs:\nRalph Cross Lab, der Torossian Lab, Ralph Cross Lounge, Papallardo Lab,\nMechatronics Lab, AMP Lab.\nStarting Solidworks\nOpen Solidworks 2007 SP5.0 by going to:\nStart > All Documents > Solidworks 2007 SP5.0 > Solidworks 2007\nStart a new document by clicking on the new document button or File >\nNew Document. In the menu click on New Part - a 3D representation of\na single design component. Run through the Solidworks Tutorial lessons\n1 and 2 to practice making simple objects and assemblies.\nScreenshots of SolidWorks menus (c) SolidWorks Corp. All rights reserv\nThis content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/fairuse.\ned.\nMIT computer cluster.\n\nMaking the Solid Model of the Sheller\nChose a plane to draw your object on\n- Click on Front Plane in the left side tool bar, then Sketch in the toolbar.\n- It helps if you draw while Normal To the plane\nDraw the cross section of the cone\n- Draw a Horizontal Centerline through the origin of the plane and another\none 2 inches above it for drawing reference. This represents the height of\nthe sheller.\nDraw the base lines\nOne on the bottom centerline and one on the top centerline. Smart\nDimension the length of one line to be 0.25\". Add a Relation to the lines to\nmake them equal. Smart Dimension the distance between the origin and\nthe inside edge to be 1 inch.\n\nConnect the lines on each side and Smart Dimension one by clicking on\nthe angled line and then the centerline to make the angle 85 degrees.\nYour cross section is now done.\nRevolve your piece\n- Draw the line that will be the axis of rotation going from the origin to the\ntop centerline.\n- Go to the toolbar and click on Features. A new toolbar will appear. Click\non Revolved Boss/Base.\n- Choose the axis you just drew to be the center of rotation and rotate 360\ndegrees\nDraw the cross section of the fin\nIn a new Sketch on the Front Plane, make the cross section of the fin.\nTrace the profile of the sheller body with lines. Add a Relation to make the\nlines parallel slanting. Smart Dimension the inside edge to be 5/8\" (0.63\")\nfrom the origin.\n\nRotate the fin\n- Click Revolved Boss/Base and choose the angled line nearest to the\norigin as the center of rotation.\n- Choose Two Direction, and set the rotation to 45 degrees for each\nAdd multiple fins\n- Insert an Axis of rotation in the Reference Geometry window.\n- Click on the Cylindrical/Conical Face option and choosing the inside\nface of the body of the sheller.\n- Click on Revolve 2 in the left-hand side bar to select the fin you just drew\nthen select Circular Pattern in the top tool bar. Revolve around the Axis\nyou added. Choose 5 fins with Equal Spacing.\n\nClean up the top surface\n- Create a Reference Geometry Plane 2 inches from the top plane.\n- Make a drawing on this plane of a circle the diameter of the sheller's\nouter edge.\n- Extrude cut upwards through all.\nYou're Done!\nSave the file as a Solidworks Part (.sldprt) and then Save As an STL (.stl)\nfile since this is the format processed by the 3D printer.\nThese materials are provided under the Attribution-Non-Commercial 3.0Creative Commons\nLicense, http://creativecommons.org/licenses/by-nc/3.0/. If you choose to reuse or repost the\nmaterials, you must give proper attribution to MIT, and you must include a copy of the non-\ncommercial Creative Commons license, or a reasonable link to its url with every copy of the\nMIT materials or the derivative work you create from it.\nPlease use the following citation format:\nD-Lab Cast Corn Sheller Build-It Copyright (c) Massachusetts Institute\nof Technology (Accessed on [insert date]).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Charcoal Press Build-It (with Teaching Notes)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/449159c23d3552f73d7d59c5808c7f55_MITEC_720JS10_bldit_chrc.pdf",
      "content": "Materials Needed\n1/2\"\nSteel Pipe\n2\"\nSteel Pipe\n1/8\"\nSteel Plate\n4\"x4\" Wood\nTools/Machines Needed\nWater Jet Cutter\nWelder\nDrill Press and Bits (15/16\")\nBelt Sander\nHacksaw or Bandsaw\nFiles (round and flat)\nRuler\nCalipers\nThis project is a very low-cost device for forming charcoal briquettes. It is composed of three welded\nmetal parts and a wooden block. To make it, you will learn to use a band saw, a sander, a drill press,\nthe OMAX water jet cutter and several hand tools. You will also learn to do some basic welding.\nCharcoal Press\nBUILD IT\nTeaching Notes\n\nThe Build-It modules were designed to give students experience\nwith a variety of tools and manufacturing techniques while at the same time\nexposing them to some simple, appropriate technologies. These modules\nshow them both the rapid prototyping equipment that is available at MIT\nas well as techniques that are used in workshops in the developing world.\nWe have developed four modules that cover a broad range of tools and\ntechniques:\nThese modules were designed to demonstrate and use equipment at\nMIT that we wanted our students to learn how to use. They can easily be\nadapted to use other tools and equipment. Design teams in D-Lab II are\nmade up of four students, so each team had one student doing each of the\ndifferent modules, thus ensuring that the team had seen all of the different\ntools and techniques. In the spirit of sustainability, the end result of the\nmodule is that students produce a useful item that will be disseminated to\ncommunity partners in future D-Lab trips as they learn how to use the tools\nand equipment.\nEach of these projects takes three 1.5-hour sessions; it is best that these\nsessions are a full week apart, to give the students time to finish the\nnecessary work before the next session. It is intended that the projects\nare done as part of a hands-on tutorial, with plenty of guidance from the\nteacher. Some instructions are given in the text of the exercise, but it is\nassumed that the teacher will go over basic safety and training for each\npiece of equipment prior to the students using it. If the students do not\nhave a lot of machine experience, you may want to do the projects in small\ngroups (4 to 8), so that the students can be closely supervised. It is often\nuseful for the students to work together in pairs to help each other through\nthe process. This document includes notes from our experiences at MIT,\nif you have any comments or insights to share, please e.mail them to me\n(Amy Smith, abs@mit.edu).\nTeaching Notes\nBuild-It Background\nNotes on the charcoal press:\nThe students in D-Lab II have all been exposed\nto the charcoal project as a case study on the\ndesign process. The evolution of the design\nis an interesting one, and eventually leads\nto the following insight: \"If you want to make\nsomething ten times cheaper, remove 90% of\nthe material\". A collection of photographs is\nincluded at the end of this note.\nThe material you will need for each press is\nroughly as follows:\n1⁄2\" steel pipe (~1 foot)\n2\" steel pipe (~3 inches)\n1/8\" steel plate (~7\" x 3\")\n4\" x 4\" wood (~6\")\nDon't cut the pieces to length for the students,\nbut rather have them cut pieces off of longer\npieces of stock--it's important that they get\nused to starting from the material in it's raw\nform.\nCharcoal\nPress\ndrilling\nsawing\nsanding\nfiling\nwelding\nwater jet cutting\nCorn Sheller\n(cast)\n3-D printing\ncasting\nsawing\nfiling\nsand blasting\n\nCorn Sheller\n(sheet)\nwater jet cutting\nsheet metal\nfabrication\nspot welding\nriveting\nfasteners\n\nWater Filter\nsawing\ndrilling\nceramics\nsanding\nfiling\n\nCutting the pipe:\nYou will need two pieces of 1⁄2\" pipe, one 7.5\" long, one 2.5\" long. You can\ncut it using a hacksaw or a band saw.\nIf using a band saw to cut the pipe, be very careful that the pipe is firmly\ngripped--the saw teeth will catch on the surface of the pipe it can cause the\npart to spin (with a surprising amount of force). You can use a vise to hold\nthe part so that it won't spin.\nTo cut steel, the band saw should be set at a cutting speed of about\n100 ft/sec. Be sure that the guard is set to the right height before beginning\nto cut.\nOnce the initial cut is made, turning the pipe slowly as you cut into it makes\na cleaner, squarer cut.\nIf you are using a hack saw to cut the pieces, be sure that the pipe is held\nfirmly in a vise, near the place where you are making the cut.\nYou will also need to cut a piece of 2\" pipe that is 2.5\" long for the cup.\nCutting and drilling the wooden block:\nCut a 6\" long piece of 4\" x 4\" wood. You can use either the band saw or a\nhand saw to cut the wooden block.\nA coarser blade may be used to cut the wood, but it is not necessary. You\ncan use the belt sander to smooth and bevel the edges.\nMark the middle of the block (you can do this by drawing diagonal lines from\ncorner to corner, or by measuring.\nPut a 15/16\" drill bit in the drill press and line the tip up with the center of\nthe block. A Forstner bit is a good option for this application, as it leaves\na clean, smooth, flat bottom to the hole. If you use a twist drill, you should\nstep up to the 15/16\" hole, that is start by drilling a smaller hole, then move\nup to the larger bit size.\nDrill the hole at least 2.6 inches deep, so that the ejector can easily fit into\nthe hole when the briquettes are being formed.\nSession 1\nFig 1 The four components of the $2\ncharcoal press\nPlunger\nCup\nEjector\nBlock\nAdditional Teaching Notes\nYou may also want to talk with the students\nabout pipe nomenclature--in the case of\nsteel pipe, 1⁄2\" refers to the inner diameter.\nYou can also explain the difference between\nwelded pipe, which will have a small ridge\nrunning through it (which can be a problem\nif something needs to be rotated inside of it),\nand seamless pipe. You can also talk about\nthe different materials that pipe is made from\nand what the merits are of each.\nYou might want to try to have the students do\nsome cuts with the hack saw as well, so that\nthey can see that sometimes it's just faster to\ndo things by hand.\n\nCutting the end plates:\nThe end plates of the two plungers must fit easily inside the cup. Measure\nthe inner diameter of the large pipe and allow for 1/16\" radial clearance.\nYou will need two of these parts. You will also need an endplate for the cup.\nIn one method, the end plate will be press fit in and then welded along\nthe seam, as shown in Figure 2a. For this, you will need a more precise\nmeasurement of the inner diameter: allow for a 0.002\" interference fit,\nmeaning that the inner part is slightly larger than the outer part, and will\ntherefore stay in place when forced into position. The larger the interference,\nthe tighter the fit; if the interference is too great, then the parts will not be\nable to be fit together. We will be welding the two parts together, so the fit\nneed only hold the part in place while we are welding it, and the interference\ncan be relatively small. Also note that more compliant materials, such as\nwood and plastic, can have larger interferences.\nThe other method for making the cup is to make a end plate which is slightly\nlarger than the pipe, and then welded where they rest together, as shown\nin Figure 2b.\nFor this, you can have a greater tolerance on the diameter of the end plate,\nas it merely needs to be bigger than the pipe, it does not need to fit precisely\ninside. There should be about 1/16\" overhang, in order to make the welding\neasier. It will be necessary to hold this part in place when welding.\nThink about the pros and cons of each method of forming the cup and\nchoose one of these methods and determine the dimensions of the three\nend plates.\nThe end plate of the cup will have a 0.8\" hole in the center so that the ejector\ncan fit through it. We will use the water jet cutter to make these parts. If\nyou are unfamiliar with the OMAX software and other CAD programs, you\nmay want to run through the tutorial before starting. Use the OMAX Layout\nprogram to generate the tool path for the three end plates. You will be\nshown how to use the water jet cutter in class.\nSession 2\nFig 2a Press fit an endplate configuration\nFig 2b Overhang endplate configuration\n\nWelding the parts:\nNow that the pieces are cut to size you will put them together to make the\nfinal parts. Welding is the process of joining two pieces by melting the\nadjacent material and having it re-solidify to form a joint. In some cases, a\nfiller material is added.\nThere are four types of welding that we can do at the welding shop: oxy-\nacetylene welding, arc-welding, MIG welding and TIG welding, of which the\nfirst two are most widely available in the developing world.\nWelding is easiest to do if the two pieces are of a similar material and of\nsimilar thickness. Otherwise, one part may melt completely while the other\nheating up. If one part is bigger than the other, it is necessary to adjust the\napplication of heat so that the two parts melt at the same time.\nWhen welding, it is very important that the pieces are held together firmly\nbefore you start welding, so that adjacent material will melt together and\nform a good joint and so the pieces do not move during the welding process.\nYou will use the welding fixtures in the shop to hold the pieces together\nwhile you weld them.\nBe sure to use protective clothing and goggles, as the radiation and extreme\nlight can be dangerous to your skin and eyes\nSession 3\nFig 3a Welding in Haiti: Oxyacetylene\nwelding in a village without electricity\nFig 3b Using electricity from utility pole to\narc weld on the side of the street\nThese materials are provided under the Attribution-Non-Commercial 3.0Creative Commons\nLicense, http://creativecommons.org/licenses/by-nc/3.0/. If you choose to reuse or repost the\nmaterials, you must give proper attribution to MIT, and you must include a copy of the non-\ncommercial Creative Commons license, or a reasonable link to its url with every copy of the\nMIT materials or the derivative work you create from it.\nPlease use the following citation format:\nD-Lab Charcoal Press Build-It Teachers Notes Copyright (c)\nMassachusetts Institute of Technology (Accessed on [insert date]).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class Notebook",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/af6f962569b6b3a9c9d788b5a751a73c_MITEC_720JS10_class_notebk.pdf",
      "content": "D-Lab: Design\nSpring 2010 - Class Notes\n\nD-Lab: Design\nSpring 2010 - Class Notes\n\nIntroduction\nAmy Smith and Victor Serrat\nD-Lab divided into:\nDEVELOPMENT, the theory and practice\nDESIGN, making prototypes and technological solutions\nDISSEMINATION, bringing technologies to those who need them\nClass Overview\nIntroduction, Mini-Project, Design Challenges, Build-It Modules,\nCase Studies, Design Review Sessions, Final Presentations\nCourse Goals\nTeaching the Design Process\n\nGoal of instructors is to guide students through the\n\ndesign of these technologies. Will have mentors to\n\ncome during the class and assist in this.\nAmy and Victor\nEnjoy co-teaching because of good cop/bad cop dynamic.\nExample of past projects:\nSoy Milk Maker for orphanage in Peru\nVac-Cast in India with Jaipur Foot\n\nHas since moved forward to the Vac-Soc using\n\npolyurethane beads instead of sand as form medium\nTo work on a project that allows an organization to do what\nit does (faster and better to boot) is a wonderful thing.\n2010.02.03\n\nD-Lab Philosophy\nTraditional development in 1950s and 1960s have an urban\nindustrial focus, with cheap labor. And then with the Green\nRevolution in the 60s having an urban focus with high inputs\nand high outputs. 1970s has appropriate technology approach\n(Schumaker's Small is Beautiful).\n\nParticipatory Development to involve people in the\n\nappropriate technology use.\n\nCreative Capacity Building is making the community\ncreators of technology, and this will enable co-creation.\nThe story of Bernard Kiwia.\n\"I used to fix bicycles, and now I make things.\"\nChlorine Dosing in Honduras and the spread of ideas through\nDon Hermon. Has slowly been taken up by communities and is now\ndesigned into new system installations.\nGuiding Principles\nWe will always strive for simplicity in this class. Through\nunderstanding the functional requirements. Simplicity is often\nlooked over far too often.\nValue indigenous knowledge and promote local innovation.\nStrive for sustainability because of our responsibility to do so,\nand the state of the world.\n\nDesign, Innovation & Technology\nInvention - to be the first to make or use something\n\nThe vanguard\nDesign - working out the details form and structure\nThis is D-Lab Design, not I-Lab Invent\n\nYou don't have to have an invention in order\n\nfor it to be a design\nInnovation - looking at something, and using it in a new way. Not\nnecessarily the first to use it, but in a certain way.\nDesign examples:\nHumdinger Windbelt\nInspired by design constraints in Haiti\nShawn Frayne - Harder problems lead to better inventions\nChallenges in Design\nTradeoffs - there is no right answer\nDynamic Life - there is no one time solution, consider design\nfor failure\nDetails\nTime - deadlines for market, competitors\nEconomics - one of the biggest driving forces in design\npossibilities in developing world\nUse and Misuse - how is device likely to be used and misused\n\nThe litigious nature of design in the United States\n\nConsideration of more than functional requirements\nEthics - what are the potential uses for things\nBen Linder says stay away from product porn - use up materials,\ntake up design time, and add little value to society\n2010.02.08\nCreativity Caveat of Design Process\nThe process is to help you go through steps, but don't let the\nprocess detract you from the product. The process is there\nbecause we are not always struck by massively creative ideas.\nIt is a check and balance to go through the process. But don't\nworry if you are wonderfully creative and just come up with\nan idea.\n*where did Amy get the Changing Approach diagram?\nDesign Process\nInformation Gathering\n\nGetting an idea for the context\n\nObtaining breadth on the problem you are viewing\nProblem Definition\n\nStating clearly and concisely the problem you are\naddressing\n\nFunctional needs without implying solutions\n\nWho? User What? Device and function Where?\n\nContext implementation\nDesign Specifications\n\nMeasurable design requirements to test final product\n\nTranslating customer needs (into real tangible goals)\nIdea Generation\n\nBrainstorming - try to generate useful information\n\nDefer judgment\n\nBuild on ideas of others\n\nOne conversation at a time\n\nStay focused on topic\n\nEncourage wild ideas - helps you jump design spaces\n\nAnalysis & Experimentation\nConcept Evaluation\nPugh Chart\n\nTo analyze ideas against a standard (s,+,-)\n\nCharacteristics can be weighted\nDetail Design\n\nStart thinking about, how will I build this\n\nDetail drawing with dimensions and tolerances\nFabrication\n\nBuilding it\n\nCan be easier if Detail design is done well\nTesting & Evaluation\nDesign Requirements for Developing Countries:\nIf this were the US, which of these design principles should we cross off?\nGOOD DESIGN IS GOOD DESIGN\nCost\nMaterials\nPortability\nSimplicity\nMaintenance & Repair\nCultural Acceptance\nEfficiency\nErgonomics\nTransparency\nSourcing\nReusability\nUser Needs\nUser Familiarity\nScalable\nDesirability\nProfitability\nLifetime\nEfficiency\nDurability\nSocial Impact\nEnvironmental Impact\nManufacture/Assembly\n\nD-Lab: Health Title\nAgenda & Logistics\n\nProject Selections (Mar 1)\n\nDesign challenge descriptions due Feb 17 (Wednesday)\n\nSample design challenges will be emailed out\n\nSlides due noon, Feb 24 (Wednesday)\nKurt Kornbluth Quote\n\"Brute force engineering options often meet the criteria\nbut somewhere there is a profound solution, which is simple,\ncheap, and beautiful. Hold out for this as long as possible.\"\n\nD-Lab hold true this.\nCase study of Charcoal Project\n\n2.4 Billion people rely on wood charcoal for fuel\n\nD-Lab originally in Haiti, recognized the need\n\nfor an alternative fuel\n\nTurning bagasse into charcoal briquettes\n\nBurning bagasse in oil drum, combining with binder,\n\nhand making into briquettes. The problem\n\nof fragile briquettes.\n\nFound mechanized briquette maker... for $8k\n\nWanted to make a more individual level machine\n\nNeeded a machine with higher force than\n\nforming by hand\n\nFound that impact force was enough to\n\ncreate briquettes\n2010.02.10\nIn Class demonstration of First Prototype ($25)\n\n4-5 Briquettes per minute, this is slow\n\nVideoed different people using device\n\nDocumented the time people spent\n\ndoing different tasks\n\nEject 42%, Hammer 24%, Load 34%, Cleaning 17%\n\nUsed this as a talking point for \"what do we do next?\"\nIn Class demonstration of Second Prototype ($30)\n\n6-8 Briquettes per minute\n\nMore expensive because there is more material\n\nThought that price could be reduced by\n\nreducing material\nShowcased features of Second Prototype B ($20)\n\nSubstituting angle iron and other less costly\n\nelements for more expensive components\n\nPeople in Haiti liked this new design, but it was\n\nstill too expensive\nIn Class demonstration of Third Prototype ($2)\n\n10-12 Briquettes per minute\n\nA dramatic decrease in cost that\n\nincreased performance\n\nEnded up being that perfectly beautiful solution\n\"If you want to make something 10x cheaper,\nremove 90% of the material\" -Amy\nShowcase of Third Prototype B (by Kenny in Zambia)\n\nA manufacturing improvement over previous design\n\nSquare tubing is more readily available\nShowcase of Third Prototype C (in Haiti)\n\nSheet metal that was available to blacksmith in Haiti\n\nSheet metal is cheaper than square tubing\n\n(cost not listed)\n\nYou can't make things too cheap\nThird Prototype is the best design of original designs. Have to\nkeep thinking of how to go about it.\nWhen designing for a place, stick with designing for that\nplace, and leave dissemination in other areas for future design\niterations. Don't try to do a universal solution at first.\nStudent Presentations on Technologies\nStudents say their Name, Major, and what they bring to the\nclass\nTreadle Pump\nOriginally developed by IDE. There are x million of treadle pumps\nout in the field. Result in an 6 fold increase in crop production.\nImplementation in Africa different than India an Asia, because\nAfrica has deeper ground water, and pump is made for shallow\nwater. Takes getting used to, IDE did have many implementation\nprograms. Thumbs up for IDEs implementation program, briefly\nmention IDEs bollywood movie dissemination program.\nSolar Cooker\nThe cardboard is fragile, and might be subject to breaking.\nThe glass pot is also an item that is fragile, and might be\nhard to replace. Really prevalent in refugee camps and some\nbusinesses formed around it. Individuals, once they know the\ngeneral principles can make their own. Problem with adoption\nis that it doesn't fit in with people's traditional cooking or\ntaste preferences. It is also very slow.\nFreeplay Radio\nInteresting implementation model, to give to an individual in a\ngroup to make sure that it is taken care of. It is $50, which\nis expensive enough in the US. It has elements that might not\nbe transparent in design, and impede maintenance. The idea\nof hand cranked radio, to overcome the information barrier\nof people in rural areas, is nice, but the implementation is\nquestionable. The technology could be improved upon in the\nfuture.\nLifestraw\nA man wanting to work in Africa as an adventurer, with\nassistance from his father who was a hotel entreprenuer,\nbut discovered the humanitarian element later on. Had evolving\ndesign parameters, that are interesting to make note of. It\nis not their responsibility to make these sort of things, but\nbecause it can have an impact, it is their obligation to do so.\nAddress issues of unsafe water and its results, such as diarrhea.\nThe product doesn't prevent viruses or metal, which are also\nissues for people in developing areas. Other critiques on design\nis that it doesn't prevent the need of people to travel to\nwater among with previous mentioned notes. The straw works\nthrough series of mesh layers and iodine, with carbon to absorb\niodine. Costs $3.50. One element that is good is its intuitive use,\nno worrying about how much chlorine to add.\n\nDrip Irrigation\nLost cost system that reduces water waste by direct root\nirrigation. Increases crop yields. Marketed towards increasing\nnutrition value in families through crops that would add to\nthat end. Only costs $2.50, which makes it much cheaper than\nother irrigation methods. A concern that the material is only\ntough garbage bag material, it is easy to fix.\nBag is meant to collect rainwater. Holes can be poked in piping\nat users discretion to deliver water to plants. There is a\nconcern that how easy it is to poke holes works two ways.\nThere was an intentional design trade-off for a low cost\nsystem. The manual is very technocratic engineering manual\nover a more easy to understand pictoral based instruction\nmanual.\nQ Drum\nVery transparent design, grab rope, drag to water, pop the\ncap, fill it up. It is very heavy, at half full, it was a lot to\nuse. The manufacturing process is expensive, using HDPE and\nrotational molding. Those who need it, can't afford it, those\nwho don't can. It is not being marketed in a sustainable way.\nThe Q Drum has won a number of design awards, and raised\nawareness about difficult it is to gather water. But its\nexpense ($50) is far out of reach of those who need it.\nDistribution of Give & Gain system, only 10 drums have been\ndonated in the past 6 months.\nMarketed as taking the burden off women... and onto children.\nIn contact with ground, may roll over waste and contaminate\nwater and those who touch it. At full weight, 110lbs, could\noverwhelm a weaker person. It is extremely difficult to unload.\nCan be used to hold fuel and dried goods.\nDesign Mini Project\nBackground and Inspiration\n\nVillage of Pestel in Haiti\n\nPeople can't afford rainwater from sisterns, and\nhave to go elsewhere.\n\nPlastic polytanks (as alternatives) are also expensive.\n\nPeople end up going to the ocean for water\n\nsometimes as well.\nPossible inspirations\n\nSodis, and plastic films for storages\n\n(as well as disinfection)\n\nTippy Tap\n\nPaul Polaks divisible horse\n\nBuying only part of a device when you\n\ncan afford it, then more as get\n\nadditional money\n\nBrainstorming\nGoal of mini-project: to go through the entire process so\nyou've tried it before. And when we start doing the big project,\npeople can move a pace that fits their project then, rather\nthan be forced through all the steps.\nBackground of Rain Water Harvesting\nPestel, Haiti\nRainwater harvesting in the area, done with cisterns, that are\ncost prohibitive to some people. Contamination during storage\nis a problem for some cisterns. Polytanks as an alternative\nto cisterns, are also cost prohibitive for all to have. Cost of\nstorage for a family for time in between rainy seasons.\nAlternatives to storage\nSodis - UV disinfecting process\nTippy Tap - hand washing\nCan't buy part of a horse\nMini-Project (in 3 main parts)\nInformation\nIdeas\nImplementation\n2010.02.16\nBrainstorming\nA particular way of thinking of ideas\nBrainstorming Rules:\nDefer Judgment (don't say no, don't think no)\nEncourage Wild Ideas\nBe Visual (write it down, draw it out)\nBuild on the ideas of others (?)\nGo for quantity (60 in an hour)\nStay focused\nOne conversation at a time (listen)\nBe optimistic (think that everything is possible)\nBisociation\n- Respirators & Food, running oxygen through soup bubbles\n- Charcoal and Shoes > and eventually come up with something\nthat is a reasonable idea\nContext shifting\nChange your point of view\nLook at things, play!\nBack to basics, naivete\nStart with a broad design space that is loosely defined. And\nthen after on you can narrow it down. It is easier to start\nbroad and narrow, than start narrow and broad.\n\nDesign Process...\nA brief conversation on things what will guide the overall design:\nWe would like it to be:\n\nVery low cost\nYou can reduce materials\nReduce lifetime of product\n\nWorks well for refugee situations\n\nIf it saves money vs lifespan (cost $1/saves $20year)\n\nModular/Buy in parts\n\nSystem that uses rooftop harvesting system\n\nSystem to be set up anywhere\n\"universal\" fitting system between designs\nDesign individual bags for each use OR\nUse one bag (egg bag), with different attachments.\n\nFitment attachments for hand washing, showering, etc\nBag use considerations\n\nDrinking Water, Washing water, irrigation water, etc\n\nHaving identification between bags (no mixing)\nClean water?\nAssuming that rain water is kept clean\nConsider the surfaces that water comes in contact with\nAmount of water used?\nDifferent uses require different amounts of water\nDoes this mean different sized bags, stacking bags, etc?\n2010.02.17\nPUGH CHART\nThis is part of the concept evaluation phase.\nSelecting different criteria to measure across different\ndesigns\nChoosing one of the designs as a Daytum (standard) to measure\nthe others against. Then marking other designs as =, +, -\nIt is a good thing to keep a limited number of criteria (50\nwould definitely be too many).\nPLASTIC FILM PROTOTYPING\nScissors are excellent cutters, and very flexible. If you need\nstraight lines, a box cutter and a ruler work well.\nPlastic Sealers\nImpulse sealer - easy to use, applies current for user set\namount of time\nClip Sealer - super heavy duty sealer\nIron Sealer - for curved and compound lines\n\nShowed the technique of using paper to prevent\nsections of plastic from sealing. A one-wave valve was\ndemonstrated as well.\n\nMini Project Presentations\nRain Water Solutions\nHarvesting\nFinal Design Parameters: Large Surface Area / Easy to\nAssemble /\nFinal design was made out of a single piece of plastic with a\nnumber of cuts and folds, for easy of construction\nBag Filling System\nDesign Criteria: Capacity / Cost / Flow Rate / Manufacturability\n/ Durability\nDesign Manifold was the main idea\nTransportation\n6 Categories of Ideas\nbackpack / hook / modified Q-drum / cargo bike / life vest /\nzip line\nBoth prototypes were made of the same basic materials\n2010.02.24\nIrrigation\nHow to get water out of the bag? GRAVITY / pump / weight\nHow to get water into the field? VINYL / pipes / chains / trenches\nHow to get water to the plant? Drip / Sprinkler / Animal / HOLES(pipes)\nIDE spent 8 years developing their design, and it still holds\nup. This student team has made a few small modifications to\nimprove the design.\nHand Washing\nHand washing is an important way to prevent disease transmission\nin developing countries.\nDesign Considerations: Clamp design / Clinching Design / Flow Control / Counterweight\nWanted to have a \"foot pedal\" design, that is naturally closed,\nand opens with foot pedal depression. Their design has the\nadvantage of being able to be filled naturally by connecting\nto another rainwater harvesting system.\nDomestic Use\nDrinking / Cooking\nCheap / Easy to make / Easy to handle / control of flow /\nminimize water waste\nOpted that gravity is one of the best ways to control the flow\nSodis style valve on one end, so it doesn't leak when turned\nover\n\nDiscussion on going through the Design Process:\nIdea generation in multiple sessions was beneficial to coming up\nwith quality ideas. (A subtext to that is letting ideas simmer in\ndowntime).\nUsing the Pugh Chart to help combine features; it is an\nevaluation tool as well as an idea generation tool.\nExperimentation leads to better Evaluation. Hands on\nprototyping aided in understanding what issue were important,\nand contribute to evaluation.\nStretching imagination to think of new and non obvious solutions.\nLateral thinking so as to not be fixated on constraints.\nConstraints allowed to more innovation in specific directions\nDesign specs as references/evaluation tool\nInformation / Ideation / Implementation / Iteration\nFinish early so you can make more iterations\nA big part of design is design for manufacturing. It is not a\nglamorous part of design, but it is extremely important, and is\nthe difference between a product and a prototype.\nDiscussion around \"Caution in Design\nfor Developing Countries\":\nLifestraw example; get feedback before its too late to do\n\nanything about it\nCurious about D-Lab failures... D-Lab doesn't have many\ntechnologies out there in the world. Combining Academia and\nDevelopment is possibly one of the slowest project tunnels\none could imagine.\n\nMaking anything and disseminating is difficult, it took\nPaul Polak X years to sell a million treadle pumps. People think\nits easy, when its not. These things don't happen overnight\n(very few things do).\nPeople should consider what they can bring to the field. What\nskillsets can they add and use to aid a community they intend\nto visit.\nHow do we refer to \"developing countries\" alternative to that\nphrase?\n\nDesign Challenge Selection\nAgenda of upcoming classes\nBuild-It Module (Mon + Wed)/\nTeam Presentations (Wed)\nDesign for Manufacture (Mon)\n/ Team Presentations (Wed)\nProject Presentations\nProposals have been\nreviewed by students\nbefore class\n\nGoal of session is question and answer\n\nThese are only design challenges, how each team goes\n\nabout designing the solution is up to them, and doesn't\n\nhave to be in the same way the project is presented.\n\nHandouts for students to choose top 6 projects\nBamboo Pencil Maker\n\nWill utilize mechanical engineering skill set/interest\n\nFinal solution will be \"gadgety\"\n\nCommunity partner has good email contact\n2010.03.01\nBraille Typewriter\n\nComplex and challenging device\nCharcoal Briquette Maker\n\nPeople looking to scale up briquette making business\nChlorinator Generator\nInterested in making lower cast\nversions for the developing world\nOne of the biggest aspects to\naddress is batteries\nAmy sells \"supercaps\"\nClay Molder\n- This is the shape that sells\n- Altering the shape not an option\n- People eat clay for its high calcium -\ncontent (especially when pregnant)\nForestry Growth Management\n- Rebuilding forest after tragedy of\nVietnam War\n- Align incentives for farmers to manage\n- No direct reward for management\n- Develop system to monitor growth, with\nsome kind of device\n\nLow CO Stove\n\nThere has been a lot of work done in last 5 years\n\nThere are very few with ACTUAL improvements\n\nLooking for a low cost fuel efficient charcoal stove\n\nMany other designs are based on wood\n\nIndoor/Outdoor? Many people cook indoors\nMaize Sheller Attachment\nWorking with Global Cycle Solutions\nRedesigning a sheller that can be made locally in Tanzania\nPaper Bag Making\n\nGroup of women in India\n\nFor domestic and export use\n\nEverything is done by hand\n\nLooking for machinery to speed up the process\n\nTrade-off of cost::ouput ratio\nPine-Needle Stove\n\nFinding a way to burn pine needles\n\nWhat would people be cooking on it?\n\nHot fast? Slow? Open Flame?\nPortable Pedal-Powered\nWashing Machine\n\nTrying to make a portable\nmachine for women who go from house\nto house washing clothes. Previous\ndesigns work, but have aspects that\ndon't fit this niche\nSoda Bottle Chipper\nWaste pickers could get a higher\n\nprice for chipped bottles\nPET soda bottles\nPossible applications in local\n\nCambridge environment!!!\nStraw Chopper\n\nFirst Mushroom based D-Lab project\n\nThere is a big interest in mushroom and vermicomposting\n\nas income generation in developing world\nVegetable Cutter\n\nBack to the orphanage in Lima, Peru, and trying to\nimprove their nutrition\nWater Siting Instrument\n\nDesign Review Presentations\nGroups will present on what they have done so far.\nInformation\nGathering,\nProblem\nFraming\nand\nProblem\nStatement.\nMentors present with various specialties to aid students with\ntheir expertise. They will be present for all the design reviews.\nIt is a bit of an experiment.\nBenjamin Linder - faculty at Olin, focusing on Sustainability and Design\nChick Davis - I don't look good on paper, but can do all kinds of\n\nstuff, an intuitive seat of the pants guy.\nDennis Nagle - you can call me Nagle, runs the D-Lab shop and how to use tools.\nMike K - serving as a mentor and knows the design process well.\nAmy - I've been to a lot of places where these projects work.\n2010.03.10\nBamboo Pencil Manufacturing\nProject\nmotivation,\ncurrent\nmanufacturing\nis\nvery\nindustrialized, trying to bring the scale or production down.\nThere is a large market around the world.\nOverview of the industrial pencil making process.\nLooked at the example of homemade pencil construction\n(science for kids style)\nResearch on bamboo.\nDifferent problem framing ideas:\nGrow skinny bamboo.\nProcess bamboo into slats\nFinal choice, change the process for the unique shape of\nbamboo\nDesign specifications, where are they coming from?\n\nThese were given to them by the design challenge\n\nThere is an opportunity to challenge this\nNeed to come up with a more precise problem statement\n\nRecommend playing with bamboo\n\nVegetable Cutter\nRequested by long time partner of D-Lab. An orphanage in\nLima, Peru, that has about 600+ children and only 30 staff.\nThey have a desire to improve the nutrition and diet of\nchildren by having a vegetable cutter to process them faster.\nProblem Framing\nNutrition\n\nConsidering alternative nutrition sources to vegetables\nEfficiency\n\nJust not enough people, making the process more\nefficient through the tools. Increase the number of people\nsome how (children help out)\nVegetable Size\n\nCan they get smaller vegetables, breeding smaller varieties\nFocused on efficiency and looked at related tools\n\nAffordable / Non-electric / Safe / Working together\n/ Efficient / Repariable\nConsider the cleaning of the device\n\n(time to clean as a specification)\nResource poor environment of Cambridge soup kitchens for\nfeedback on project\nMaking calls on the VOIP 9 001 then country code and number\nPine Needle Stove\nPine Needles are very acidic\nBeing developed for Uttarakhand\nDid lots of research on stoves\nStove design parameters\nCooking vs Heating and Inside vs. Outside\nDurability / Materials / Cost / Health / Safety / Heat Control /\nEase of Use / Quantity of pine needles / Pine needle processing\n\nDesign for Manufacture\nVictor goes over rescheduling the deliverable due dates\nSpring Break Reading\nSmall is Beautiful - argument against scale as a source\nGaviotas - a village in ... made to address the problems of\nurbanism\nCradle to Cradle - manifesto on sustainability\nFortune at the Bottom of the Pyramid - 12 Innovations for\nBOP Markets\nManufacture - the use of machines tools and labor\nto make any kind of thing, usually at a large scale for sale\nand distribution.\nDesign for Manufacture - adapting a design to make\nit easy to manufacture and to reduce manufacture costs.\nIt is easier to incorporate DfM in the design phase, so you\ndon't have to redesign in later stages of the design process.\nDfM gains more and more importance with each step of the\ndesign process.\nConsiderations:\nJob Creation / Resource Availability / Replicability / Scale\n2010.03.15\nManufacturing Costs:\nComponents - get worn down over time and\n\ncost different parts\n\nCustom vs Off-the-Shelf Part\n\nRaw Materials / Labor / Tooling & Equipment\nAssembly -\n4 Paradigms\n1. manufactured locally + Assembled Locally + Maintained Locally\n2.Manufactured in Urban + Assembled Locally + Maintained Locally\n3. Manufacture in Urban + Assembled Urban + Maintained Locally\n4. Urban + Urban\nPhoto of man manufacturing hinges by hand\nWelding is widely prevalent in the world,\nbecause it is of such a great need\nJigs and Fixtures for manufacturing multiple parts quickly\nConsider how the products you design can be manufactured,\nand how you can come up with efficient (time saving, resource\nefficient, etc) processes.\n\nKeys to DfM in Developing Countries\n\nUnderstand manufacturing capabilities\n\nIncorporate the most accessible and\n\naffordable manufacturing techniques\n\nThis is not easy to get the first time\n\nMay be required to build a prototype,\n\nthen redesign with manufacture in mind\nDesign for Assembly\n\nReduce the cost\n\nImprove quality\n\nReduce part inventory\n\nReduce equipment necessary\nGuidelines\nMinimize different parts,\n\nuse standardized parts\nMinimize the number of parts\nTry to use symmetrical parts\n(reduce orientation specifics)\n\nNo Spare Parts\nVideo on manufacturing in Ghana\nSuame Magazine one of the largest informal manufacturing\nareas in the world\n\nIdea Generation\nDesign Review\nHow are things going with contact and community partners?\nHow is experimentation and idea generation coming along?\nBamboo Pencil Manufacturing\nIdea Generation\nRole bamboo paper around the led\nConcept Evaluation\nDecided that pulp and mold was the best idea\nOr\nCutting thin pieces and making a homemade pencil\nExperimental Results\nMade some shapes that could be used for pencils\nHeating up bamboo\n\nBoiling bamboo wasn't too successful\nGrow thinner bamboo\nWhat if you soaked the bamboo for a long time in water? Would\nthis soften it? Even without heat, this would be a low energy,\nhigh impact solution, it it worked. What about adding salt or\nsome other additive. That could then be removed through\ndrying.\nGeneral Notes\nWhat is the reasoning for individual design specifications?\n\nPortability, something people think is valuable, but isn't\nrequired or desired. Things like this need to be confirmed by\nthe community partner.\n\nPencil specs vs Machine specs\n2010.03.17\nVegetable Cutter\nIdea Generation\nLooked for ways to power device\nCrazy ideas! Piano wires as cutting device, while learning music!\nConsidered the resulting shapes of what you wanted to cut\nConcept Evaluation\nExperimental Results\nTested different devices and videoed it\n\nAs a restult, reconsidered the force necessary\n\nWhat was the sharpness of the blades?\nSlap chop\n\nYou get weird shapes and things get stuck\nGeneral Notes\nRevised problem statement\nFocusing on corer/slicer devices\n\nHow does this relate to community partner needs?\nVegetable sizes/shapes, types/ budget\nScale of the device you are working on\nWhat is the lifecycle the partner is working in?\n\nHe wants to package and sell this stuff, what does this\nmean?\n\nPackaging?\nPreservation?\nSanitation?\nTabletop\ncutting? Etc\nI have some links on some German hand powered kitchen\ndevices.\n\nPine Needle Stove\nIdea Generation\nFeeding Methods... something about this makes me feel like it's\non the wrong path\nMy concern for the ideas here is that they are not considering\nthe user interaction enough. Some of the ideas are very\nspecific, which Is good but very specific very early. And it will\nbe harder to expand your ideas later on in the process.\nConcept Evaluation\nExperimental Results\nPacking pine needles into logs\nGeneral Notes\nOptimal Burning - Fuel/Temp/Air (balance)\nWhat groups did was initial experimentation and idea generation.\nThis was good, and gives students a direction to think about\ngoing, and focus on new ideas based around this.\n\nHuman Factors\nSuprio Das - Designer in\nResidence\nEngineer, then started working with\nan NGO on water remediation when he\ngave up his job. And has been using his\nengineering skills on various projects\nsince. Currently working on automatic\nchlorine dosing, and will be around D-Lab\nuntil early May.\nCommunity Involvement in Technology Development\nConsider involving as much as possible in the design process.\n\nTaking photos and sending them to them\n\nTalking on the phone about what you are up to\n\nCome up with another way to do so!\nHuman Factors\nUseful - something that serves a purpose\nUsable - something that is understandable\nDesirable - something that people want\nBanana Slicer - Useable + Desirable - Useful\nUseful + Usable are the things on the shelves that don't get\nsold\n2010.03.29\nPrinciples of Good Design\n(from Human Factors Standpoint)\n\nTaken from Donald Norman\n1. Visibility (experiment to turn on Osciliscope)\n2. Good Conceptual Model (30seconds Microwave Experiment)\n3. Clear Mapping\n4. Feedback\nLabels are a quick fix, and are language dependent. A good\ndesign would be intuitive in form to hint at function.\n\nDesign for [X]\n\"There are no solutions, there are only trade-offs\"\nUSABILITY\nSolar Water Disinfection\n\nClear water in sunlight can be disinfected with UV\n(within a day)\n\nBy destroying pathogens\n\nTransportation Issue of getting bottles from A to B\n\nMaking a plastic bag as a solution, non-usability of\noriginal bag\n\nSodis design by Shawn Frayne\n\nCharacteristics of the original bag:\n\nHard to fill / painful handle / stressed corners\nIs there some sense to the device, how do people understand it\nMake sure that people get feedback when using the device\nTrade-offs of cost and performance\n2010.03.31\nAFFORDABILITY\nCharcoal Press was done be reducing the material\nIDE Drip Irrigation Kit\n\nLooked to cut costs everywhere\n\nUsed a plastic bag + rice bag to make an inexpensive\ncontainer\n\nUsed cheap thin wall tubing for piping\nDon't want to go so far in one direction that you make a\ntrade-off of quality into the realm of unusability\n\nMethods\n\nRemove material\n\nMaterial Selection\n\nReduce part count\n\nIncrease scale of production\n\nWhen producing in the scale of millions,\nyou're paying for material and labor is negligible\n\nTrade-Offs\n\nThe appearance of \"quality\" (lead in parts)\n\nOur perceptions of quality\nLowering cost and reducing \"quality\" can increase accessibility,\nas in the case of the drip irrigation kit.\n\nMANUFACTURABILITY\nPhase Change Incubator\n\nGoing from making 100s (plastic canisters) to making\n1000s (phase change balls) decreased the price. Going to\nplastic bags reduced the cost even further, costing only\npennies.\n\nMethods\n\nEase of manufacture\n\nScale of Production\n\nProcesses and material selection\n\nTooling, jigs and fixtures\n\nTrade-Offs\n\nEconomic Benefits - who is making the money\nfrom your making the product. Hand crafted has distributed\neconomic benefit of local manufactures. While making it en\nmasse can make it cheaper and more accessible.\n\nEnvironmental Impact - often cheaper to make\nit at a cost to the environment\n\nCapital Investment - an injection molding\nmachine costs a lot of money (1000s), while a forge doesn't\ncost a lot (100s)\nSUSTAINABILITY\nWill be covered in detail by Benjamin Linder in a few weeks\n\nMethods:\n\nMaterial Choice, what are the impacts of it\n\nManufacturing Process\n\nSystem Design - what is the system in which this item works\n\nLife Cycle Analysis - not the just the materials\nin the device, but the energy and material used to make those\nmaterials. Defining boundaries is very difficult to do.\n\nTrade-Offs:\n\nCost\n\nPerformance\n\nIf done right, you don't have to have these trade-\noffs. Often these things are in conflict, but it is not a given.\nRE-USE\nThnking about the product at its end of life. Either re-using\nor easy disassembling for re-use.\nFAILURE\nPlow made to fail in specific point so that farmers can fix in\nthe field when they hit the rock. Design a device that fails in\nsuch a way that it is easy to fix.\n\nHow will it fail? (it will fail)\n\nHow will it fail first?\n\nWhat is the best failure mode?\n\nWhat is the worst failure mode?\nModeling something very well, you can predict how it will fail,\nand isolate the uncertainty in specific areas. You can be more\nefficient in areas, using less material. Take advantage of\nyour failure modes.\n\nPaul Polak & Shawn Frayne\nPaul Polak Background\n\nAuthor of the book students have been reading\nin class. Founder and former President of IDE. One of the\nmost successful disseminators of technology in the realm of\ndevelopment.\nShawn Frayne Background\n\nGeneration One D-Lab student and inventor of\nHumdinger. Uses an interesting market based approach to\ntechnology dissemination through licensing.\nWill be interesting to here how these two people have found\ninteresting niches to make a living in this field. It doesn't\nhappen that students go to the career fair and pick up 15\nbrochures on how to continue development work.\nShawn Frayne Talks\nAlways\nappreciated\nsimplicity\nin\ntechnology, and always thought\nhe would go into clean tech. Was in\nthe original D-Lab class when it was\ncalled the Haiti class. How to take\nsomething and design something\nto fit the constraints of Haiti. A\nlong process of marching towards\nsimplicity (7+ years).\nIn designing for the developing\nworld, the constraints come up with\ninteresting technologies that in\ntheir simplicity have applications\ntowards the developed world.\n2010.04.05\nCurrently, Humdinger is based in Hong Kong. The goal moving\nforward, is how to make this into a global invention factory.\nFor now, you have to create your own business to work in\nthis field. Maybe ten years from now there will be a packed\ncareer fair, with GEs in this field.\nThe nice thing about development type technologies is that\ntheir pretty cheap to make.\nPaul Polak:\n\"It is it true what I heard that you can\nget a lot of dough from bakeries?\"\nSources of inspiration? D-Lab was just getting started back\nthen. But the phase change incubator was amazing, and I think\nit has applications in the developed world, and licensing could\nmake a lot of money.\nI'm an inventor, so I'm inspired by technologies, rather than\nbusiness models, which might be a problem, and something he's\nworking on.\nWhy Hong Kong? There is infrastructure to make multiple\nprototypes quickly. A chasm to overcome.\nPaul Polak Talks\nWas working as a shrink. The\nmost important thing that\nhappened, his love of Scuba\nDiving, where he met some\npeople. He met a man, Willard,\nwho augmented his work as\na lighthouse operator, with\nfishing. Got interested in\nhelping Willard with his fishing\nbusiness. Paul originally used his\nown money, from real estate\ninvestments as a shrink.\n\nHow did you find your way? I believe in erratic, the Harvard\nbusiness plan sucks. People often try to plan things, but if you\njust let it go and are honest, you'll find your way. Learned to\ngive up control, and take advantage of opportunities. When\nyou give up control and let things you happen, you gain a lot\nof power.\nDo you need one great idea? Before you have a business? I\ndon't believe in ideas, so much as having a vision. What I do now,\nhas changed so much since when I started. You have to be willing\nto commit to a vision and let it evolve, and understand that it\nwill evolve in a way you can't control. And sometimes, there will\nopen big opportunities.\nThings don't work by having a big idea\nand making it happen. [it's a myth].\nAmy: Serendipity plays a huge part In things, having a vision\nallows you to choose opportunities based upon the vision you\nwant to achieve.\nSean: It's nice to have something you're working on, while\nyou're in the \"sea.\" But there is a lot of interesting stuff\nthat comes along the way.\nDon't bother... are you undercutting a population with this?\nThe idea is not to say, things that reach two thousand people\naren't good enough. However, if you built a good bridge design,\nhow many could you make? I'm not saying its useless to help a\nsmall number of people. But one of the scarce things, is your\ntime and money. If you go to a village, you can come up with\ntwenty problems. My point is, in the interest of helping people,\nwhy not pick up the two problems that are applicable to 1000\nvillages.\nDonations? You can't donate people out of poverty.\nDoesn't mean there isn't room for investment or some donation\nplans. Development as a whole, was focused on donation based\nsystem [when I wrote the book]. For wheelchairs, consider the\ncost of mobility vs immobility.\nWhat do you do when people don't want help? I've encountered\npeople who were so accustomed to getting free things, they\ndidn't want to pay. People always do things for a good reason.\nWhat are the reasons that people might not want help?\nI was thinking that people didn't want to interfere with their\ntraditions/culture. That depends who you are. If you wander\naround with an idea, versus sitting down to learn and learning\nfrom them.\nPeople aren't going to turn away from opportunities to\nimprove their livelihoods. So it depends what you are offering\nand how it is perceived.\n\nWhat are some organizations that are doing it right (similar to\nIDE)? It is all matter of degree. When IDE started, it was a shot\nin the dark, now there are many more. Hefer International,\nnot perfect, but it works. CARE as an organization is doing\nsome things that are very market based. There are many\nmore organizations doing things more market based, if not\nthe whole organization, then part.\nAmy: the infuriating aspect for me is people introducing\nproducts that aren't appropriate to the context in which\nthey are working. Imposing rather than introducing, and not\nutilizing local resources, expertise, creativity or supply chains.\nIn the long run, these may not be successful.\nPaul: donated tools are ??? (I missed this!!!). If you have to design\na hand pump that people are going to pay for, as a designer\nyou will design to that. (Rather than donated government wells\nmade of steel that are x inches wide).\nTo find out how much... Ask people how much they pay for\ntreating bad water? But before that, ask people how many\nof them know the effects of bad water. When I talk about\ntalking to twenty five farmers, its much more than just going\nwith your product, and asking people what they think about.\n\"I don't give a shit what the facts are, what matters is people's\nperception.\"\nIt's not just talking to the people, its understanding the\nsystem and context around the \"problem\".\nMillenium Development Goals? I think they've done\nmore harm than good. Overall, people have the idea that more\nmoney will solve the problems. JUST throwing money at the\nproblem, will attract the crooks, and when money is gone, the\nproblems remain.\nForeign Aid can be useful. It has to be disciplined and market\ndriven.\nCan big business do good?\nCoca-cola selling smaller bottles isn't helping anyone. It's a\nrotten product to begin with. Changing the packaging isn't\nalways good. Water sachets in Ghana litter the ground.\nMultinationals can make a contribution, but they have to go\nthrough a radical change to do so.\nProducts for the GE of Emerging Markets? Starting with\ndrinking water.\n\nDesign Review\nPine Needle Stove\nWorked on a feeder for pushing pine needles into the stove.\nLooked at gasification, took a 70 minutes before it even\nstarted gasifying\nSpiral Prototype\nWill know to put more fuel in by seeing the fire, as it dies down,\nadd more needles.\nPot doesn't have to cover the stove completely, but without a\npot on, the stove design doesn't work effectively.\nBamboo Pencils\nExperimented with slats\n\nCommunity partner is working on a big industrial scale\nPulping Bamboo\n\nThe process so far:\n\nGrate bamboo\n\nMix w/ Adhesive\nNeed to decide what adhesive to use.\n\nIdeally want to use long fibers\nVegetable Cutter\nBrainstormed and then looked for devices that embodied what\nthey were looking for.\nWhat do the potatoes in Peru look like?\n\nAre currently basing it off the russet\nA potato grater...\nCan you start to consider the process? Grating potatoes and\nautomatically dropping them in a bucket of water.\n2010.04.07\n\nGreen Engineering\nBenjamin Linder\nSustainability is rarely talked about\naround product design in developing\nworld. More typically it is talked\nabout in the context of the US\n(the West).\nTwo common definitions, from Our\nCommon Future, Brundlent Report,\nand from John Elkington, People\nProfit Planet.\nA typical flaw of representing the triple bottom line as a ven\ndiagram says that sustainability lies in the intersection of the\n3. (society/economy/environment or people/profit/planet)\nActually, the economy is a subset of society,\nwhich is a subset of the environment.\n2010.04.12\nWWF Living Planet Report 2006\n2.5Acres per Hectare\nCuba's position on the map is interesting\n\nAn\nisland\nsociety\nand\neconomy, that was completely\nisolated in the Cold War. They\nhad a great deal of resources\nthat were subsidized, and suddenly\nstopped at the collapse of the\nSoviet Union. A society supported\nby outside resources, that had to\nrapidly change and adapt.\nSustainability can be seen as moving\npeople across the graph in two ways,\nless impact, or more human development.\n\nCarrying Capacity\nWe are using more Earth's than are available\nSustainability is a lot about rates, how things balance out\nDepleting resources faster than they can replenish themselves\n\nCutting off tree branches vs chopping down the tree\nSource vs Sink\nResources consuming in vs Resources putting out\nWill the planet run of oil first, or will the world warm up too\nmuch before we run out of oil. A simultaneous problem.\nCod in and waste out.\nCarrying Capacity\nCopper only has so much, there is no renewable rate for it, it\nis a STOCK\nThe problem with carrying capacity is that we don't know\nwhere it is, there is no line in reality showing when to stop\nconsuming Cod.\nThe only way to get below carrying capacity rapidly is to\nstop consumption completely. And drop below the line. Human\nbehavior isn't so straight forward though.\nCan we raise the bar of carrying capacity?\nCombining Fossil Fuels (nitrogen) and Wheat to raise the\ncarrying capacity of wheat, is only combing the carrying\ncapacity, not actually raising the overall capacity of the\nplanet. The idea that the carrying capacity of life is raised\nis an illusion.\nCan the market self correct\nfor dwindling resources?\nThe example of cod, we didn't pay attention to the price\nsignals, and collapsed the Atlantic source of cod. Markets\naren't perfect systems, and don't have enough information\nto respond. Markets are not as effective as we'd like them\nto be.\nThe example of copper. Price over the last 200 years has\nnot significantly reduced consumption. We have substituted PVC\nfor pipes in houses, but started laying down telecommunications\nlines.\nTechniques\n0. Know what resources you're using\n\nWhat is the context\n\n- Don't talk about general Cod, but cod in the Atlantic\n\nWater Pump in New Longoro\n\nMaterials to build\n\nHuman Power to Operate\n\nMachines to Make\n\nWater\n\nTransportation\n\nFuel\n\nBuilt Land Use\n\n(the land you used, can only be used for this now)\n1. Measure Carrying Capacity\n\nWater Pump\n\nMeasure ground Water rates\n2. Stay below Carrying Capacity\n3. Adapt Quickly\n4. Population\n\nGreen Engineering 2\nBen Linder\nThere is hope because the WWF Quality\nof Life / Environmental Impact Graph\napproaches a sustainable area.\n- Some people need to increase\n\ntheir consumption\n- Some people need to decrease\n\ntheir consumption\nHow much Energy can a person output?\n100w is an aggressive schedule of mechanical work\n\nHow many equivalent oil laborers is that?\n\n50 Oil Laborers per Person in US\nCalculating Biocapacity\nA certain number of people need a certain number of land.\nDifferent lands have different capacitys (grassland vs\nforest).\nLooking at Africa and people cooking with solid fuel\n80-95% of the cooking fuels in Africa are wood\n\nArgument that a big part of the\nstandard of living is tied to fossil fuel\nuse (increased fossil fuel increases\nstandard of living)\nIt takes energy to make energy\n\nUS in 1970s, for a gallon of oil\nwould get 100\n2010.04.14\nGhana\nWealthy Kitchen > High quality aluminum pots is a give\naway of the wealth (embodied in them).\nThree Stone Fire\nNot very efficient at getting heat from\nwood fire to water\n(is efficient at getting heat out\n\nof wood though)\nmost of it ends up in the air\nResponse to this:\n\nMore efficient stove...\n\nOr... I missed this ;(\nLife Cycle Analysis / Life Cycle Assessment Exercise\nRaw materials > manufacture > distribution >\nproduct use > end of life\nDo basic material and energy use in each step\n\nWhat is the fate of each\n\nCalculate relative impacts\nGoal is to get a handle on where the impacts are, and attempt\nto modify the design based upon this.\nThe basic idea of a LCA is easy, in practice it is very complicated\nDoing an LCA for the stove\nCeramic + Steel: 3.5kg\nSteel: 2.25kg\nCeramic ~ 1.25kg\n\nSmall discussion on setting a scope.\nThe data set provided is one that is primarily used by the\nconstruction industry. A cradle to gate data set (raw materials\n> manufacture). Construction data is almost always cradle to\ngate, means some distribution is folded in.\nLCAs are just coming online with\ndifferent design and engineering firms\n\nMost large design firms like IDEO and Continuum have\nmaybe 2 people dedicated to LCA out of their entire business.\nVery few projects get this though. Firms might go out to\nother firms to get this work done.\n\nThe reason to do LCA may come from various sources,\npersonal beliefs, market pressure, public criticism, etc.\nDoing a lifecycle analysis aids in product design:\nExample of changing the thickness of the steel to bring\nimpact down (which might also bring cost down)\nMake/Use\nIs the product 80/20 or 20/80\nThe strategies for improving a product depend on which type\nof product it is\nStoves don't matter what they are made out of. They will\nuse so much energy over the course of its life, the materials\ndon't matter.\n\n> 71mj to make it\n\n> 250,000mj to use it\nUsing less fuel, is that much time women\nare not out collecting fire wood. And\nthat much wood that isn't burned.\n\nPrototype Presentation\nGuest Mentor Ralph Hotchkiss\nStove Design\nSpiral Design for a longer burn, concentrated underneath\nwhere the pot goes\nTesting efficiency with a cold start and a hot start.\nSafety concerns of current design\n\nConsiderations of two people operating\nVegetable Cutter\nHave community partner feedback, they want 1cm cubed\npotatoes\n\nWhy? Don't know. Small pieces cook quickly, but\npreparation is longer.\nBig questions:\nWhy 1cm cubes? (I'll be satisfied not knowing this)\nHow hard is it to manufacture knives/grates?\n\n(this seems key, but high precision)\nRalf's suggestion of using old car parts instead of old bike\nparts for the precision of a camshaft at low cost.\nBamboo Pencils\n2 Different Ideas\n\nBamboo fiber mats that are very malleable\n2010.04.21\n\nSuprio Das\nVictor asked him to share some\nof the projects he works on. Also\nasked to reflect on how innovation\nhappens in the field in India.\nMotivation. How did I get into this?\nThe billion rupee garland versus island cyclone\nInspiration from the everyday.\nCow dung cakes on a wall. Cow dung kabobs (a recent innovation).\nClever innovations that are necessary.\nBicycle Rickshaw innovation. Date Palm innovaton.\nThere are interesting things everywhere\nif you just give it a second look.\nDugwells for Arsenic Safe Water\nWhat are the options for the villagers?\n\nSurface water with bacteria\n\nGround water with arsenic\nIt is complex to remove arsenic, and difficult to dispose.\nThere are known methods to remove bacteria.\n2010.04.26\nThe technology has to be appropriate to the people.\n\nProblem of bringing in foreign machine, dependent on\nforeign parts when breaking down.\nGoing into villages and seeing other problems.\nEducation.Health.Lighting.Etc\nDomestic power through human powered devices.\n\nBicycle with change over switch and charger.\n\nGetting power from Hand Water Pumps\n\nHow to convert\nrandom amplitude motion\nto circular motion.\n\nI ended up re-\ninventing the wheel\n\nThere is a scope of invention. It is not so bad to reinvent the\nwheel, so long as you find a new purpose for it.\n\nChlorine Doser\nIt is not necessary to be an expert in\neverything I do. Use the knowledge you\nshare in some field, apply it to another,\nand then ask those who know.\nDesigning for Failure\nExample of the bolt in a plow.\nElectrical Fuses\nThink of other examples.\nBeams in a building (so you can see it before concrete fails)\nCars are designed to compact and crush.\nThis process of thinking helps\nkeep your brain healthy and active.\nThere are more issues beyond design that come into play.\n\nWhen I designed the bike light, at first it was great\nfor the rickshaw cyclists. And then they got used to having\nlight, and realized it was easier for them to steal it. So the\nproject was successful, but had an unintended result.\n\"Common Sense is common.\nWanting to do something isn't.\"\nDifference between MIT and Village Solutions\n\nBecause people don't have education, often solutions\nare simple. At MIT, have more resources, so should take\nadvantage of those\n\nBernard Kiwia\nVictor Introduction - What does it take to\nbe an inventor in Tanzania, and how does he\nsee it changing over the coming years.\nBernard Talks\nBackground in bike mechanics, 3 years\nbefore IDDS. After IDDS, switched from bike mechanics, to\nmaking things, for the community and myself. Now now works\nwith Global Cycle Solutions. Have cellphone charger and\ncorn sheller. Now are working on grinding corn to make corn\nflour for Ugali. Looking to make a cellphone charger for\nmotorcycles.\nWhat people in Tanzania like, and things to keep\nin consideration when designing for them:\n\n- People like things that last a long time\n\n- Things that they can repair\n\n> How are people going to repair\n\n> General tools are better\n\nHammer, saw, welder > drill press\n\n- Greater ideas (you have access to more knowledge)\nAfter seeing what Carlos [from Maya Pedal] did with the\nbicycles, inspired him me to do something with it too.\n\nInstead of just selling bicycle parts for scrap, start\nmaking things out of them to sell for a higher price.\n\nFirst product: bicycle wheel truer\n\nFollowing products: adjustable chair, water heater,\ntoilet paper holder, water pump, picture frame, windmill, pedal\npowered drill press\nWater Pump, taking advantage of children playing on it. Locate\nit near the river and then have them pump the water for you.\n2010.04.28\nCellphone charger user feedback:\nPeople are aware of how long it takes to charge a cellphone\nnow that they are charging while on the bike. Before they\njust plug it in the wall, and don't think about it.\nPeople like to wrap the wire, and it breaks if you do that.\nTrying to make the cellphone cheap enough, that its not\nworth stealing.\nCurrently costs 5USD, about 7,000 Shillings.\n\nElectric chargers costs about 2USD\n\nPeople have to travel to get phone charged costs\n200 Shillings.\nFocusing on quality and price (to make it tough for competition)\nAll of these come from my head.\nNeed to know what people need.\nFor me, its easy, because I live\nthere, and now what problems\npeople face. For you, you have\nto do a lot of research.\nFor instance, I used to have\ncold water everyday. And it\ncosts a good amount of money\nfor kerosene. That is why I\nsearched for a way to make a\nhot water heater. Don't make\nfor someone else, make it for\nyourself. If you like it, then\nsomeone else might like it. If\nyou don't like your idea, then\nnobody else will.\n\nHow do you make these\nthings? Do you read books\nor...\nSometimes,\nI\nsee\none\nthing, and apply it to\nanother. Coming across a\nthing, and think how can\nit be used somewhere else.\nFresh ideas are difficult\nto come across. The goal\nis to modify it.\n\"You need to try things.\"\nA lot of people have ideas, but they don't try them. When I\nthink of something, I like to try it. Some people have lots of\nquestions, and have ideas, and ask you to try it, but are not\nwilling to do it themselves.\nDesign something that you know. That is just for you. Now\nassume you are in Africa, will that device help you when you\nare there.\nI want to try because I know that I can do it. If I don't think I\ncan do it, I don't try.\nWhat is missing in other people that they don't want to try.\nFor you, I don't worry about you, because you come to this\nclass. From the beginning, not all MIT students are here. But\nyou are here, because you want to design something. From\nthat point, that is where you can start designing.\nSomething you can do as a designer, is\nsee how things work, and ask people.\nHow do you want to move forward?\nFor me, I like a challenge. I want to work with people. I need\nmore challenge. I need to sit with people with the ideas also.\nWorking with people, who maybe tried, and have failed, and\nthat is when you start to think about how to solve it.\nWhat do want to be doing 25 years from now?\nI want challenge, so that I can make something that is great.\nSo people remember it.\nAfter first IDDS, I was on the magazine, so I thought, I go\nthere the first time, and do good, so I have to keep working\non challenges.\n\nScaling Up\nSaafWater - Providing affordable clean water to urban poor\nSarah Bird (from the original Haiti class before it became the D-Lab)\nIts tough to make testing\nwater a interesting case.\nBreakthrough thought of tying\ntogether water treatment with\nwater testing. Having a woman walk\naround and testing water, and selling\nwater treatment products when she\ncomes across dirty water.\nBecame a failed attempt at selling\na phase change incubator, because it\nwasn't necessary to convince people\nthat their water was dirty.\nSaaf Water closed at the end of\nNovember last year. We weren't\non the road to scalability, we were\nloosing money. So it didn't make sense\nanymore. We learned a lot, and have\nlessons learned.\nIf you want to have impact, and if\nyou want it to be scalable, you really\nhave to think about how you're going\nto get to that level.\nMost of the problems that we're concerned with this in this\nroom, are problems that have been solved, they just haven't\nbeen solved in context. They depend on executing in specific\nmanner.\n2010.05.03\nStarted in Kurachi in Pakistan, with women going door to door\nwith chlorine tablets. Weren't prepared to deal with a day to\nday structure that included rocket propelled grenades, so it\nmade us realize that we shouldn't have our eggs in one basket.\nWere doing really well, and our graph looked like you wanted\nit to, when you're about to break even. Securing the deal\nwith the new supplier. Then started supplying to USAID and\nRefugee camps from Afghanistan. Then USAID pulled out with\nfour days notice.\nProblems we could have prevented:\n1. Extension of paying for product\nTried to crack down on this. And it backfired, got a number\nof half used bags back. Came to realize customers weren't\nusing product as much as they should.\nIt's not hard to keep track of numbers, we should have done\nthis.\n\nProctor & Gamble's Pur?\nWas a competitive product, but failed for a number of\nreasons. Process was hard to do, customers didn't like it. Saaf\ndid benefit from P&Gs marketing campaigns to tell people\nthey had dirty water. Saaf tablets were half price of Pur,\nbut perceptually the same (5Rupees to clean 10L Pur or 20L\nSaaf)\nRunning a venture like this\n\"Its just a little worse than being an undergrad at\nMIT, but more lonely... and everybody hates you\"\nRescuing Saaf from the position it was in (no investors, no\ncustomers, no product) was not possible within in the time\nframe I could deal with (emotionally or financially after the\nhaving stock stolen and multiple investors pulling out).\nUSAID pulling out, is something I am upset about. There were\n200,000 households getting clean water everyday, and that\njust ended, as USAID pulled out deals they had going on in\nPakistan in preparation for the next gravy train rolling in\n(change of Ambassador, President).\nStarted Saaf water to do one thing well, and lost sight of\nthat (focusing on the community based sales). I take blame for\nthat, its my fault.\nWhy not get some number crunching job to make a lot of\nmoney, then go do this with your own money (given the risk of\ncountries like Saaf)?\nI'd rather kill myself. I want to spend every day of my life\ndoing what I want and what makes me happy. That works for\nsome people, it wouldn't work for me.\nIf you had been wildly successful, you couldn't take all the\ncredit. Having a spectacular failure, you can't take all the\nblame. Write down your lessons learned. [so I did] And there was\nnothing I wrote down that I shouldn't have known.\nYou can't read a recipe and be a gourmet chef.\nStart a business, because there is an opportunity, not because\nyou want to just do something.\n\nGwyn Jones\nCo-Founder Merlin Bikes (late 1980s)\nIn preparation for today, I stared reading Art of the Start\nby Guy Kawasaki (recommended by Paul Hudnut).\nWhen Merlin started, there was a limit to high bikes of being\nabout $1500. Anything more, and you're paying for expensive\npaint job. We started using a titanium alloy that was used in\naircraft hydraulics. People had tried to make titanium bike\nframes before, but they didn't have this alloy. We pitched it\nto the mountain bike company we were working for. Didn't\npersuade them, but realized we persuaded ourselves.\nHarish Hande and Selco, talked about being afraid of growth,\nbecause what they're good at is knowing their customer.\nFinding your customer can be a defining focus for a business.\nYou really have to listen to your customers with complaints. In\nthe bike industry, if you're bikes aren't breaking, then there\nis a problem, because people aren't riding them. I got tired of\ndealing with warranty issues.\nTried to build them up, work with the customers who are really\npushing the bike to its limits, and use that to make the bikes\nbetter.\nGuy Kawasaki talks about this, and having the customer do the\ntesting. Ultimately, the customer is going to do the testing.\nWorking with the customer this way was something I felt we\ndid differently, and that made a difference. Typically in the\nbike industry, companies are defensive about problems like\nthat, because it could be problems for the rest of the line.\nSeizing an opportunity vs coming up with a technology\n(windows)?\nIf you look at successful entrepreneurs, most of them have\nother start ups that have failed in their history. Most people\nare successful have done it before [and failed].\nDesign is such a small part of the project, and\nhow its implemented counts for so much more.\n\nPenultimania\nSaturday's Presentations\n- What's next\n- Working in the community\n- Evaluations\nWhat's Next?\nProject Work\n\nPrototyping\n\nResearch and Development\n\nTesting\nTeam Work\n\nCommitment\n\nResources\nFunding\nTravel\nWorking with Communities\nEncourage Participation\n\nHow can you empower people to bring their stuff to\nthe table?\n\nIt takes conscious thought\n\nBring communities up to date with what you have learned\nover semester\n2010.05.10\nUganda Results\nOur Creative Capacity Building Workshop\n\nIt's like trying to squeeze this entire course into 3\ndays... in a foreign language\nExercises\n\nIce Breaker (corn paper stacking)\n\nBuild-It Module (corn sheller)\nWhat people did 4 months later\n\n- pedal powered knife sharpener\n\n- water cart\n\n- rat traps\n\n- grinder\n\n- ground nut thresher\nIt was interesting to watch the change of ethos in people.\nWater Carrier, can take 8 Jerry Cans instead of a woman\ncarrying one. Water source is 3km a day, so this device allows\none trip to get water for the entire day in one trip.\nNext goal was to use technology to address gender disparity,\nmen want to make a paste maker so that they can help the\nwomen with their work. Men don't want to do it the traditional\nway, but do want to help the women with their work.\nIts not just about the technology, its\nabout people and creating engagement.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sheet Metal Corn Sheller Build-It",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/1fab1f92881a2a0aa9ee50b0154a1960_MITEC_720JS10_bldit_csm.pdf",
      "content": "Materials Needed\nSteel Sheet Metal\nRivets\nNails\nTools/Machines Needed\nWater Jet Cutter\nBending Jig\nSpot-Welder\nRivet Gun\nPunch\nFile\nRuler\nCalipers\nThis project is a low-cost device for removing corn kernels from the cob. It is made from a piece\nof sheet metal which is formed and then joined together. This device was developed by Marco\nVillagarcia, an engineer from Cusco, Peru, based on an injection molded plastic corn sheller from\nMalawi. It is made from a single piece of sheet metal. To make it, you will learn to use a spot-welder,\na rivet gun, the OMAX water jet cutter, a bending jig and a variety of sheet metal fabrication tools.\nCorn Sheller\nBUILD-IT\n\nCutting the sheet metal\nMaking parts from sheet metal often requires that you form three-\ndimensional objects from two-dimensional starting material.\nThink carefully about the shape of the corn sheller and draw a template.\nCut this shape out of card stock to be sure that it produces the shape that\nyou want. Be sure to account for the extra length required to make the\nridges and leave a tab that will allow you to attach the ends when you form\nthe truncated cone.\nWe will use the water jet cutter to cut the sheet metal parts. If you are\nunfamiliar with the OMAX software and other CAD programs, run through\nthe OMAX tutorial before class (there is a copy of the OMAX software\nthat you can download onto your laptop or you can use one of the D-Lab\nlaptops). Use the OMAX Layout program to generate the tool path for the\nparts and cut your part out before the next class.\n\nDuring this session, in addition to forming your sheller, you will learn how\nto use a variety of other sheet metal fabrication equipment.\nForming the Ridges\nYou will use a special die to bend the ridges in the sheet metal. Either an\narbor press or vice can be used to generate sufficient force to bend the\nmetal. Mark the position of the ridges on your part and then use the die to\nbend the ridges.\nForming the Cone\nYou can form the cone by bending it over an anvil or a piece of pipe, by\nhand or with a hammer or you can bend the whole things by hand. Be\ncareful not to damage the ridges as you form the cone.\nSession 1\nThe Hobby Shop\nRoom W31-031\nSession 2\nD-Lab Annex\nRoom ???\nFig 1 The sheet metal sheller, made\nat the Fainsa workshop (right) and\nthe original plastic sheller that is was\nmodeled after (left).\n\nThere are a variety of methods that you could use for fastening the\nends of the sheller together. Chose one of the methods below for joining\nyour sheller.\nRiveting\nRivets are simple fasteners that can be used to join two pieces of sheet\nmetal. Solid rivets have a pre-formed head on one end; once the parts are\nassembled, the other end is deformed so that the pieces are permanently\njoined. Ad hoc rivets can be made from nails or welding rods.\nBlind rivets, or pop rivets, can be used when there is access to only one\nside of the part. The rivet extends through holes in both sheets, then a\nrivet gun is used to pull on the mandrel, which deforms the inside end of\nthe rivet so that it will hold the two sheets together.\nDrill or punch the holes in the sheller, making sure that they will line up\nwhen the sheller is fully formed. For solid rivets, put the head on the\ninside, then hammer the other end to deform it; this will also make the\nshaft of the rivet expand, which also helps hold the sheets together. For\nthe blind rivets, insert the rivet into the gun and then into the hole; press\nthe handles of the rivet gun until the mandrel pops loose.\n\nSpot-welding\nWelding is the process by which two pieces are joined through a melting\nand re-solidification process. Spot-welding allows rapid welding of\nthin materials that do not require a complete weld seam. Two copper\nelectrodes hold the sheets together and then deliver enough current\nthrough the sheets in a concentrated area that the sheets melt together\nat that spot. Spot welding is not appropriate for all materials, however the\nsheet metal that we are using can easily be welded using the spot welder\nin the Pappalardo Lab.\nFinishing the sheller\nIn order to finish your sheller, you will want to be sure that all the edges\nare smooth. File away any burrs or sharp corners that could cut the user.\nSession 3\nD-Lab Annex\nRoom ???\nFig 2a solid rivet\nFig 2b blind rivet\nThese materials are provided under the Attribution-Non-Commercial 3.0Creative Commons\nLicense, http://creativecommons.org/licenses/by-nc/3.0/. If you choose to reuse or repost the\nmaterials, you must give proper attribution to MIT, and you must include a copy of the non-\ncommercial Creative Commons license, or a reasonable link to its url with every copy of the\nMIT materials or the derivative work you create from it.\nPlease use the following citation format:\nD-Lab Sheet Metal Corn Sheller Build-It Copyright (c) Massachusetts\nInstitute of Technology (Accessed on [insert date]).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 1: Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/cd705ed13dc6e85b7e786d456896bb42_MITEC_720JS10_lec01.pdf",
      "content": "D-Lab\n\nSpring\n\nDevelopment through\nDialogue, Design and Dissemination\n\nD-Lab Offerings\n\nDevelopment\nIntroduction to\nInt'l Development\nD-Lab:\nDevelopment\nD-Lab:\nUrban\nD-Lab:\nDesign\nD-Lab ICT\nD-Lab\nHealth\nWheelchair\nDesign\nProsthetics\nDesign\nCycle\nVentures\nD-Lab:\nEnergy\nD-Lab:\nDiscovery\nDesign\nPrototyping and\nProduct Development\nD-Lab III:\nDissemination\nDevelopment\nVentures\nDissemination\nImplementation and\nBusiness Models\n\nSpring Class Overview\n\n- Introduction\n- Mini-Project\n- Design Challenges\n- Build-It Modules\n- Case studies and guest lectures\n- Design Review sessions\n- Final Presentations\n\nCourse Goals\n\n- To learn about the design process\n- To develop technical solutions for underserved\ncommunities\n- To practice creative design in a real-world context\n- To learn hands-on prototyping and manufacturing\nskills\n- To develop problem solving and critical thinking\nskills\n- To recognize the potential impact of engineers in\nthe world\n\nCourse Staff\n\n- Instructors\n- Victor Grau Serrat\n- Amy Smith\n- Teaching Assistant\n- Mike Kozlowski\n- Shop Manager\n- Dennis Nagle\n- Design Mentors\n\nCourse Logistics\n\n- Main Text:\n- Out of Poverty by Paul Polak\n- Other Texts:\n- Cradle to Cradle by William McDonough and\nMichael Braungart\n- The Fortune at the Bottom of the Pyramid by C.\nK. Prahaland\n- Small is Beautiful by Ernst Schumacher\n- Gaviotas by Alan Weisman\n\nCourse Logistics\n\n- Prerequisite\n- Design team meetings\n- Meeting Space\n- Work Space\n- Safety\n- Collaborative Use\n- Attendance\n\nGrading\n\n- Class participation and attendance\n15%\n- Homework assignments\nand design notebooks\n30%\n- Mini project\n10%\n- Design review sessions\n25%\n- Final design/prototype\n20%\n\nD-Lab Projects:\n\nSoy Milk Maker\n\nD-Lab Projects:\n\nVac-Cast\n\nThe Jaipur Foot Organization\n\nCourtesy of Dr. Pooja Mukul, Bhagwan Mahaveer Viklang Sahayata\nSamiti - Jaipur Foot Organization, Jaipur, India. Used with permission.\n\nThe D-Lab Philosophy\n\nTraditional Approaches to\n\nTechnology in Development\n\n- 1950's & 60's: Industrial Development\n- Urban focus\n- Large scale manufacturing\n- Competitive advantage of cheap labor\n- 1960's: The Green Revolution\n- Rural focus\n- Large scale farming with hi-tech inputs\n\nMovements that Shape D-Lab's\n\nApproach to Development\n\n- 1970's & 80's: Appropriate\nTechnology\n- 1980's & 90's: Participatory\nDevelopment\n- 2000's: Creative Capacity Building (?)\n\nAppropriate Technology\n\n- Low cost\n- Locally available materials\n- Small scale\n- Improves livelihood\n- Can be understood, maintained and\nrepaired locally\n- Environmentally sustainable\n- Open source\n\nAppropriate Technology\nPhotos removed due to copyright restrictions:\n- \"Pot in Pot\" for temperature controlled food storage\n- treadle water pump\n- weaving cloth on a home loom\n\nParticipatory Development\n\n- Working with communities to identify needs\nand resources\n- Decentralization of decision-making\n- Building local capacity\n\nCreative Capacity Building\n\n- Promotes co-creation in the\ndevelopment context\n- Enables people to be involved in the\nentire design process\n- Builds upon Appropriate Technology\nand Participatory Development\n\nChlorination System in\n\nHonduras\n\nCommunity Involvement in\n\nTechnology Development\n\nCommunity Involvement\nCommunity Involvement\nProblem\nSolution\n\nGuiding Principles\n\n- Identify functional requirements\n- Encourage participatory\ndevelopment\n- Value indigenous knowledge\n- Promote local innovation\n- Strive for sustainability\n\nDesign...\n\nThere's no solutions, there\n\nare only trade-offs.\n\n-- T Sowell\n\nDesign Boxes\n\n- Which is your favorite example\nand why?\n- What drove the design of each\nexample?\n- What trade-offs were made?\n\nComing up...\n\n- Class Lottery-- results by e.mail on Friday\n- Project Selection (Feb 24)\n- Design challenge descriptions due for review by\nWednesday, Feb 17\n- Slides due by noon on Friday, Feb 19\n- Readings on course website\n- Homework 1 (due Feb 10)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2: Design process and case studies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/0544f53d0d8501e7ea1e16d5dba634ba_MITEC_720JS10_lec02.pdf",
      "content": "D-Lab\nSpring\n\nDevelopment through\nDialogue, Design and Dissemination\n\nToday's Class\n- Logistics\n- Design Box Presentations\n- Design, Innovation, Invention and the\nDesign Process\n- Discussion\n- Readings\n- Case Studies\n\nSome Logistics\n- Turning in Homework\n- Course website\n- Textbooks\n\nTechnology Boxes\n- Which one is your favorite?\n- Which one exempifies the trade-offs\nthat were made\n\n- 2 minutes or less!\n\nDesign, Innovation\nand Invention\n\ninvent: to be the first to think of, make, or\nuse something\ndesign: to work out or create the form or\nstructure of something\n\nSource: Encarta(r) World English Dictionary (c) 1999 Microsoft Corporation.\nAll rights reserved. Developed for Microsoft by Bloomsbury\nPublishing Plc. This content is excluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse .\n\nInnovation\nClear plastic bottles poking through\nroof capture sunlight to illuminate\nwindowless rooms\nhttp://www.youtube.com/watch?v=C\nS3764DmIP4\n\nHarder problems lead to\nbetter inventions\nShawn Frayne\n\nChallenges in Design\n- Tradeoffs\n- Dynamics and long-term effects of use\n- Details\n- Time Pressures\n- Economics\n- Use and mis-use\n- Ethics\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Creativity Caveat\n- Don't let the process detract\nfrom the product\n\nThe Changing Approach\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nDesign Specifications\n- Translate customer needs into\nquantitative design performance\ntargets\n- Define internal basis for measuring\nsuccess\n- Capture the necessary characteristics\nfor a successful product\n- Provide a basis for resolving trade-offs\n\nTranslating Customer\nNeeds\nNeed\nDesign\nAttribute\nUnits\nOwner\nEasy\nassembly\nAssembly time\nseconds\nFloyd\nSafe\nStructural safety\nfactor\nLisa\nSafe\nFatigue life\ncycles\nNathan\nMagical\nWorks like magic subjective\nMeta\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nBrainstorming Method\n- generate lots of ideas\n- explore all classes of solutions\n- develop new perspectives\n- generate usable information\n\nBrainstorming Rules\n- Defer judgment\n\n- Build upon the ideas of others\n\n- One conversation at a time\n\n- Stay focused on the topic\n\n- Encourage wild ideas\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nPugh Chart\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nThe Design Process\n- Information Gathering\n- Problem Definition\n- Design Specifications\n- Idea Generation\n- Analysis & Experimentation\n- Concept Evaluation\n- Detail Design\n- Fabrication\n- Testing & Evaluation\n\nProblem\nSolution\nThink of ideas\nChoose the best idea\nWork out details\nBuild\nTest\nGather Information\nExperiment\nGet feedback\nThe Design Process\n\nDesign for Developing\nCountries\n\n\"Brute force engineering options\noften\nmeet\nthe\ncriteria\nbut\nsomewhere there is a profound\nsolution, which is simple, cheap,\nand beautiful. Hold out for this as\nlong\nas\npossible.\"\n-Kurt\nKornbluth\nformer D-Lab Instructor\n\nBattery-operated\nfield incubator\n$1250\nPhase change\nincubator\n$100\nThermo-electric\nfield incubator\n$500\nCommercial incubator photos (left and center) (c) source unknown.\nAll rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nThe Phase Change Incubator\nTime\nTemperature\n---\nSol\nid\nLiquid\n\nGuiding Principles for\nDfDC\n- Identify functional requirements\n- Encourage participatory development\n- Value indigenous knowledge\n- Promote local innovation\n- Strive for sustainability\n\nTechnology Case\nStudies\n\nComing up...\n- Project Selection (Mar 1)\n- Design challenge descriptions due for review by\nWednesday, Feb 17\n- Slides due by noon on Wednesday, Feb 24\n- Readings on course website\n- Homework 1 (due Feb 10)\n- Homework 3 (due Feb 10)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3: Case studies, Mini-Project introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/4eb0375b0510c8988071071133302de5_MITEC_720JS10_lec03.pdf",
      "content": "D-Lab\nSpring\n\nDevelopment through\nDialogue, Design and Dissemination\n\nToday's Class\n- Logistics\n- Charcoal Press Case Study\n- Technology Case Studies\n- Introduction to Mini Project\n\nLogistics\n- Project Selection (Mar 1)\n- Design challenge descriptions due for\nreview by Wednesday, Feb 17\n- Slides due by noon on Wednesday, Feb\n\n\"Brute force engineering options\noften\nmeet\nthe\ncriteria\nbut\nsomewhere there is a profound\nsolution, which is simple, cheap,\nand beautiful. Hold out for this as\nlong\nas\npossible.\"\n- Kurt Kornbluth\nFormer D-Lab Instructor\n\nFuel from the Fields\nCharcoal Project\n\nForming Briquettes by Hand\n\nFragile Briquettes\n\nMechanized Briquette Maker\n~$8,000\n\nThe First Prototype: ~$25\n\n4 - 5 Briquettes/minute\n\nTime Study\nHammer, 24%\nLoad, 34%\nCleaning, 17%\nEject, 42%\n\n6 - 8 Briquettes/minute, $30\n\n$30\n\n$20\n\n$20\n$2\n\n10 - 12 Briquettes/min\n\n\"If you want to make something\n10 times as cheap, remove 90%\nof\nthe\nmaterial.\"\n\n- Amy Smith\n\nD-Lab Instructor\n\n\"Brute force engineering options\noften\nmeet\nthe\ncriteria\nbut\nsomewhere there is a profound\nsolution, which is simple, cheap,\nand beautiful. Hold out for this as\nlong\nas\npossible.\"\n\n- Kurt Kornbluth\n\nFormer D-Lab Instructor\n\n\"Everything should be made as\nsimple\nas\npossible,\nbut\nnot\nsimpler.\"\n\n- Albert Einstein\n\n\"Simplicity\nis\nthe\nultimate\nsophistication.\"\n- Leonardo Da Vinci\n\nNow, Even Simpler\n\nDesign Mini Project\nAffordable Rainwater\nHarvesting\n\nBackground and\nInspiration\n- Pestel, Haiti\n- Rainwater Harvesting Systems\n- Cisterns\n- Polytanks\n- SODIS bags\n- Tippy Tap\n- IDE Drip Kits\n- Paul Polak's divisible horse\n- Pigs\n\nPestel, Haiti\n\nPestel, Haiti\n\nPestel, Haiti\n\nPestel, Haiti\n\nPestel, Haiti\n\nOther Storage Methods\n\nSodis\n\nTippy Tap\n\nPaul Polak's Divisible Horse\nPhoto of pack horse carrying water cans\nremoved due to copyright restrictions.\n\nPigs\nPhoto courtesy of gurdonark on Flickr.\n\nPigs\n\nComing up...\n- Design Packet (v. 1.0)\n- Mini Project\n- Information\n- Initial Ideas\n- Project Selection (Mar 1)\n- Design challenge descriptions due for review by\nWednesday, Feb 17\n- Slides due by noon on Wednesday, Feb 24\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 12: Design for Manufacture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/31bc1da7c60661b5848601aa2f9eba07_MITEC_720JS10_lec12.pdf",
      "content": "D-Lab\nSpring 2010\n\nToday in class:\n- Review of the Design Process\n- Design for Manufacture\n- No Spare Parts\n- Books Assignment\n- Readings\n\nD-Lab\nDesign for Manufacture\n\nDfM Definition:\nAdapting a design to make it more\neasily manufactured and to reduce\nits manufacturing costs.\n\nDfM Definition:\nTo give consideration at the design\nphase of a product how it will be\nmanufactured.\n\nPlanning\nProduction\nTesting and\nRefinement\nDetail\nDesign\nSystem-Level\nDesign\nConcept\nDevelopment\nDfM in the Product\nDevelopment Process\n\nSpecial Considerations\nfor Developing Countries\n- Job creation\n- Resource availability\n- Supply chains\n- Scale\n- Replicability\n\nRaw Materials\nEquipment\n& Tooling\nOff-the-Shelf\nManufacturing Costs\nOverhead\nAssembly\nComponents\nLabor\nCustom\nLabor\nEquipment\n& Tooling\n\nFour Paradigms\n- Manufactured locally\nAssembled locally\nMaintained locally\n\n- Manufactured in urban\ncenters\nAssembled locally\nMaintained locally\n\n- Manufactured in urban\ncenters\nAssembled in urban\ncenters\nMaintained locally\n\n- Manufactured in urban\ncenters\nMaintained in urban\ncenters\n\nCommonly Available Materials\nGet pictures of:\n\nroofing material\n\ncar parts\n(c) source unknown. All rights reserved.\nThis content is excluded from our Creative\nCommons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n\nCar Parts\n\nBicycle Parts\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nBest Live-Action\nManufacturing\nin Developing\nCountries\nShort Film\nImage of \"Oscar\" film award trophy\nremoved due to copyright restrictions.\n\nJigs & Fixtures\n\nKeys to DfM in\nDeveloping Countries\n- Understand manufacturing\ncapabilities\n- Incorporate the most\naccessible, affordable\nmanufacturing techniques into\nyour detailed design\n\nDesign for Assembly\n\"a process for improving product\ndesign for easy and low-cost\nassembly, focusing on functionality\nand on assemblability\nconcurrently.\"\n--Vincent Chan & Filippo A. Salustri\n\nDesign for Assembly\n- Reduce cost of assembly\n- Improve quality and reliability\n- Reduce part inventory\n- Reduce production equipment\n\nSpecial Considerations for\nDeveloping Countries\n- Job Creation\n- Resource Availability\n- Scale\n- Repeatability\n\nAssembly Methods\n- Manual assembly\n- Fixed automatic\nassembly\n- Flexible automatic\nassembly\nGraphs of cost per produ\nct vs. production volume,\ncomparing manua\nl assembly, aut\nomatic assembly and robotic assembly.\nImage by MIT OpenCourseWare.\n\nDesign Guidelines for Manual\nAssembly\n- eliminate the need for workers to make\ndecisions or adjustments.\n- ensure accessibility and visibility.\n- eliminate the need for assembly tools and\ngauges (i.e. prefer self-locating parts).\n\nBasic DFA Guidelines\n- minimize the number of different parts -\nuse \"standard\" parts.\n- minimize the number of parts.\n- avoid or minimize part orientation during\nassembly (i.e. prefer symmetrical parts).\n- prefer easily handled parts that do not\ntangle or nest within one another.\n\nBasic DFA Guidelines\n- Minimize part count by incorporating\nmultiple functions into single parts\n- Modularize multiple parts into single\nsubassemblies\n- Assemble in open space, not in confined\nspaces; never bury important\ncomponents or components that require\nmaintenance\n- Make parts such that it is easy to\nidentify how they should be oriented for\ninsertion\n\nBasic DFA Guidelines\n- Prefer self-locating parts\n- Provide alignment features\n- Eliminate fasteners\n- Don't put fasteners in places where you\ncan't get access to\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 15: Design for [X]: usability, affordability, sustainability, reuse, failure",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/cef8fe1b2174970fb9af067051b2c407_MITEC_720JS10_lec15.pdf",
      "content": "D-Lab\n\nSpring\n\nDesign for [x]\n\nToday's Class\n\n- Logistics\n- Design for...\n- Usability\n- Affordability\n- Manufacturability\n- Sustainability\n- Reuse\n- Failure\n\n\"There are no solutions,\n\nthere are only trade-offs\"\n\nDesign for...\n\nUsability\n\nSolar Water Disinfection\n\nSolar Water Disinfection\n\nDesign for Usability\n\n- Ergonomics\n- User interface\n- User interaction and understanding\n- Feedback\n- Trade-offs\n- Cost\n- Performance\n\nDesign for...\n\nAffordability\n\nCharcoal Press\n\nIDE Drip Irrigation\n\nCourtesy of iDE. Used with permission.\n\nIDE Drip Irrigation\nIDE Drip Irrigation\nCourtesy of iDE. Used with permission.\n\nDesign for Affordability\n\n- Remove material\n- Material selection\n- Reduce part count\n- Increase scale of production\n- Trade-offs\n- Product life\n- Flexibility\n- \"Quality\"\n\nDesign for...\n\nManufacturability\n\nManufacturing in Ghana\n\nManufacturing in Ghana\n\nManufacturing in Ghana\n\nManufacturing in Ghana\n\nPhase Change Incubator\n\nDesign for\n\nManufacturability\n\n- Ease of manufacture\n- Scale of production\n- Processes and material selection\n- Tooling, jigs and fixtures\n- Trade-offs\n- Economic benefits\n- Environmental impact\n- Capital investment\n\nDesign for...\n\nSustainability\n\nDesign for Sustainability\n\n- Material choice\n- Manufacturing processes\n- Systems design\n- Life cycle analysis\n- Trade-offs\n- Cost\n- Performance\n\nDesign for...\n\nRe-Use\n\nCar Parts\nCar Parts\n\nEmergency Shelters\n\n(c) http://www.dometents.com. Courtesy of Shelter Systems. Used with permission.\n\nDesign Trade-Offs\n\n- Which \"design-fors\" will dominate\nthe design of your project?\n- What are the trade-offs?\n\nDesign for...\n\n- Usability\n- Affordability\n- Manufacturability\n- Sustainability\n- Re-Use\n- Failure\n\nDesign for...\n\nFailure\n\nPlow\n\n(c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nDesign for Failure\n\n- How will your device fail*?\n- How will it fail first?\n- What is the best failure mode?\n- What is the worst failure mode?\n* it will fail\n\nWhere are we now?\n\n- If you haven't chosen your final\nconcept, do so soon!\n- Finish experimenting\n- Run through a selection matrix\n- Run it by your design mentors and\ninstructors\n- Next week's design review\n- How exactly will you go about your project\n- Think of ideas\n- Experiment\n- Choose the best one\n- Work out the details\n- Test... 31\n\nComing up...\n\n- Paul Polak\n- Discussion Questions\n- Wheelchair and Stove Homework\n- Design Reviews (April 7)\n- ID Night at the Museum (April 9)\n- Save the date for Awesomeness\n(April 21)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 26: Penultimania, what's next?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/7cefdcc8ebc8a427e1a8ed5b8e5a89a1_MITEC_720JS10_lec26.pdf",
      "content": "D-Lab\nSpring\n\nPenultimania\n\nToday's Class\n- Saturday's presentations\n- What's next\n- Working in the community\n- Evaluations\n\nFall D-Lab classes\n- SP.721/11.025 D-Lab: Development\n\nMWF 3:30 - 5\n- MAS.665/15-375 Development Ventures\n\nR 4 - 6\n- SP.712 D-Lab: Cycle Ventures\n\nMW 3:30 - 5\n- SP.719 D-Lab: ICT\n\nMW 2 F 2 - 4\n- SP.707/SP.731 D-Lab: Discovery\n\nT 3 - 5\n\nPlanning What's Next\n- Project work\n- Prototyping\n- Research and Development\n- Testing\n- Team work\n- Commitment\n- Resources\n- Funding\n- Travel\n\nWorking with Communities\n- Encourage participation\n- Testing and feedback\n- Development and design\n- Resources\n- D-Lab library\n- D-Lab staff\n\nFour months later...\n\nComing Up\n- Final Class\n- Discussion of this terms innovations\n- Hand Tool Olympics\n- Final Reports\n- Evaluations\n- End of term\n- Mini Project\n- Build-It Modules\n- Paper Evaluations\n- Mentors\n- Team\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Design Packet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/2c6149f5a276a531264f04657539f064_MITEC_720JS10_design_packt.pdf",
      "content": "Design Packet\nSpring 2010\nIntroduction\nThe design process is both an art and a science. The following steps may help get you on the\nroad; they can be used as a way to track and document the design process and can give you\nideas for how to proceed. \"Brute force\" engineering options often meet the criteria but\nsomewhere there is a profound solution, which is simple, cheap, and beautiful. Hold out for this\nas long as possible. The design process is generally considered to be a combination of the\nfollowing stages:\n-\nInformation gathering\n-\nProblem definition\n-\nDesign specifications\n-\nIdea generation\n-\nAnalysis & experimentation\n-\nConcept evaluation\n-\nDetail design\n-\nFabrication\n-\nTesting & evaluation\nThe process is not a linear one, however, as it is often necessary to go back to revisit earlier\nstages in light of information which you discover as you proceed. Experience has shown that the\nmore time spent on the initial stages of the design, the easier the later stages become. In this\nclass you will learn the design process by applying it to a real technological challenge. This\npacket describes the design assignments for the semester.\nWe will move through the design process over the course of the semester, and you will report\nyour progress in a series of design review sessions. While each project will proceed at different\nrates, we expect that you will have achieved the following milestones for each design review\nsession.\nSESSIONS\nDESIGN REVIEW MILESTONES\nSession #11\nPhase 1: project background, problem definition and design\nspecifications (aka Homeworks 10 and 11)\nSession #13\nPhase 2: idea generation, experimental results, concept evaluation and\nfinal concept (aka Homework 14)\nSession #17\nPhase 3, part 1: detail design, analysis and experimental results (aka\nHomework 15)\nSession #20\nPhase 3, part 2: Prototypes\nSession #24\nPractice presentations for MIT Museum D-Lab showcase\nAfter each review session, each team should meet to discuss the feedback they received and\nwrite a one to two-page document summarizing comments and criticisms on your project. The\ndocument should contain all comments made by reviewers and should outline what your team\nbelieves to be the most pertinent criticisms and how you plan to incorporate them as you move\nforward. These feedback summaries should be kept on the wiki and referred to often throughout\nthe design process.\n\nPhase 1: Information\nInformation Gathering\nWe will begin with the information gathering and problem definition phase. As a team, you will\ncollect information about the project, especially in terms of the following:\n-\nSpecifications for performance of the device\n-\nThe context in which it will be used\n-\nThe current state of the art\n-\nRelated technologies\nAlthough the internet is a good source of information, it should not be your only source.\nDatabases and reference texts such as the World Bank Development Indicators, The\nEconomist Intelligence Unit Country Profiles and others can provide valuable background\ninformation.\nThe following reference materials are among those suggested by the MIT Libraries:\n-\nDarrow Ken, and Mike Saxenian, editors. Appropriate Technology Sourcebook. Village\nEarth. http://villageearth.org/appropriate-technology/appropriate-technology-sourcebook\n-\nCIA World Factbook - http://www.cia.gov/cia/publications/factbook/index.html\n-\nStatistics from Food and Agricultural Organization of the United Nations (FOA)\nhttp://www.fao.org/corp/statistics/en/\n(Note: here's the MIT Libraries' full list of D-Lab research references, if you're at MIT or have\naccess to an academic library. Most of these are available only with an institutional\nsubscription.)\nMost importantly, try to consult your community partners and those people who have helped to\ndevelop your challenge. These people will be familiar with the context, needs and users for\nwhom you are designing.\nDeliverable (Homework 10)\nThis information will be incorporated into the project background presented at the Session #11\ndesign review. Each team member should turn in a one to two-page summary of their research\nfindings at the review session.\nProblem Framing\nNow that you have a good background about the challenge, it's important to frame the problem.\nWhat aspect of the problem will you be addressing? Who are your users? Who are your\ncustomers? (they are not always the same). What do your users and/or customers actually\nneed? It may be different than what they say they want--they may have framed the problem in\na way that suggests a solution. It is important to go back to the basic requirements and build\nupon that. Think carefully about the stakeholders who are involved in this project, and those that\nyou are including in your solution. Think of several different problem framings and collect more\ninformation about each so that you can choose the best one.\n\nDeliverable\nEach team should present their problem framings at the Session #11 design review and\ndescribe which one they chose and why.\nProblem Statement\nThe problem statement should be a concise description of the design problem and its context. It\nshould include only the functional requirements of the device and not components of the\nsolution. The aim of problem definition is to clearly outline the problem on which the team will\nfocus. Be sure that the problem defined is measurable and observable. Address the following\nquestions:\n-\nwho (the user)\n-\nwhat (the functionality of the device)\nwhere (the environment)\nDon't state the problem as a question or give a solution or cause of the problem in the\nstatement.\nDeliverable (Homework 11)\nAs a team, develop a concise problem description to be presented at the Session #11 review\nsession.\nDesign Specifications\nNow that you have an idea of the scope of your project, it is necessary to determine the user's\nneeds and convert them into specific design requirements. Start by generating a list of client\nneeds. When possible, try to get information directly from the people who will be using your\nproduct. If this is not possible, then identify several people who are knowledgeable about the\ntopic and get their input. Once you have the list of customer needs, decide upon the metrics\n(measurement methods) that you will use to determine whether you have met these needs.\nAssign acceptable and ideal values to these metrics and use this to create the design\nspecifications for your project.\nDeliverable (Homework 11)\nAs a team, develop a spreadsheet or other clear document that outlines all critical design\nspecifications, metrics used and acceptable/goal values. This should be posted on the team\nwiki, and summarized and presented at the Session #11 design review. Each team should also\nprint out a copy of this document and turn it in at the review session.\nwhere (the environment)\n\nPhase 2: Ideas\nIdea Generation\nNow that your design problem has been clearly defined and the specifications have been set\nout, it is time to concentrate on thinking of solutions. When there is an existing solution to your\nproblem or a similar one there are three basic types of design ideas that you may generate:\nscaled designs, evolutionary designs or revolutionary designs. A scaled design can be derived\nfrom an existing design that does the job well, and just needs to be scaled for your application.\nAn evolutionary design can be created when an existing design is pretty good, but fundamental\nimprovements can be made. A revolutionary design is a totally new approach used to achieve\nthe same function as an existing design, but with better performance. All three approaches can\nhave successful results. In fact, your final design will probably be a combination of all of them.\nBegin by generating ideas on your own (you may have already done a little of this while you\nwere doing research into the problem definition). Try to think of as many different ways as\npossible to solve the problem. Be sure that you do not focus on a single approach. Use\nsketches and notes in your design notebook to record your ideas. Be sure to use large, well-\nlabeled sketches so that others will be able to understand them. Some ideas will be at the\nsystem level and others at a more detailed level. Keep track of them all. Think of at least ten\nideas for your project and record them in your design notebook. They may be ideas for the\noverall system or for the sub-systems. Use these ideas as a starting point in your group idea\ngeneration session.\nAs a team, you will have a group brainstorming session, chose one or two people to record\ninformation. Before you start, be sure that you agree on the problem, and state it clearly. Each\nperson should have a packet of sticky notes, and as you come up with new ideas, write them\ndown and add them to the work surface (wall, table, floor, or whatever is comfortable for you).\nThis allows you to capture your ideas as they come in without interrupting others. You should\nstart by giving each team member the opportunity to share an idea from their individual list.\nBuild off each idea as it is presented, and see where that goes. New ideas will emerge, don't\npass judgment at this point, and encourage all new ideas. You will evaluate and critique ideas at\na later stage. In order to ensure a productive brainstorming session, keep it under one hour, and\nfollow the Rules of Brainstorming (it is highly recommended that you put them up on one of the\nwalls where you are meeting or on a whiteboard):\n-\nDefer judgment (don't dismiss or criticize any ideas)\n-\nBuild on the ideas of others (no \"buts\", only \"ands\")\n-\nEncourage wild ideas (think naively, keeping all engineering knowledge of what is\nfeasible to the side. Embrace the most out-of-the-box notions because they can be key\nto solutions)\n-\nGo for quantity (aim for as many ideas as possible: in a good session, up to 100 ideas\nare generated in 60 minutes)\n-\nBe visual (use color markers to write on big Post-its that are put on the work surface)\n-\nStay focused on the topic\n-\nOne conversation at a time (no interrupting, no dismissing, no disrespect, no rudeness\n-\nBe optimistic\n\nOnce you feel like have exhausted your ideas, try to generate more. One way to do this is\nthrough a process called bisociation. In this approach, you choose a topic that may seem\nunrelated to your topic, and then think of ideas that bring these two ideas together. For example,\nyou may be generating ideas for the charcoal project, and choose the bisociation topic of shoes.\nThen you might think of how you could use shoes as a material to make the press, how a shoe\ncould operate the press, how the shape of the shoe could be incorporated into the press design,\nhow shoe manufacturing methods could be adapted to make charcoal, how charcoal could be\nused in making shoes, or how it might be used to absorb odors in shoes. And then you might\ndecide to follow up on one of the more promising ideas. How charcoal might absorb odors, or\nperhaps other contaminants, perhaps chemicals in water, perhaps removing pesticides from\nground water, and perhaps the charcoal could be formed into a briquettes in a way that you\ncould regulate the pore size, and then it could filter bacteria from the water as well. Which\nleaves you with the idea of making charcoal water filters for removing chemical and bacterial\ncontaminants. Which might actually be a good idea (let's go make one and try it out!!!). You may\nchoose to do bisociation with additional topics if you don't get fruitful results from the first.\nThere are many strategies for creative idea generation, brainstorming and bisociation are just a\ncouple.\nAt the end of your session, group your ideas together into similar approaches and write up a\nbrief summary of each approach. As a team, choose five to ten approaches that you think are\nworth following up on.\nDeliverable (Homework 14)\nThe results of your idea generation sessions should be summarized and presented at the\nSession #13 design review.\nAnalysis & Experimentation\nNow that you have sorted through your ideas, you will need to start the process of choosing the\nbest approach. It is often necessary to investigate the approach further in order to make that\ndecision. Go through each approach and think of the key things that you would need to know in\norder to effectively evaluate the approach. Think of simple experiments that you could do to find\nout this information if it is not possible to get the information through additional research or\nthrough analysis. Devise an experimental procedure, and perform the tests to get the\ninformation you need. At this stage, you need to go fast, build mock-ups quickly and cheaply\nthat will provide you with the results you need. Don't waste time on complicated concepts at this\nstage, and don't sweat the details.\nDeliverable (Homework 14)\nEach team should present the results of the research, analysis and experiments for each\napproach at the Session #13 design review.\nConcept Evaluation\nYour next task is to choose which of your many ideas you will concentrate on in your design\nsolution. It is often difficult to do this as ideas tend to take on a life of their own and you will find\nthat you each have favorites. It is important to judge as objectively as possible. You will need to\n\nconsolidate your various ideas into designs that you can compare. You might consider group\ntogether ideas that are similar and combine them into a single solution. Try to narrow it down to\nthree to five different concepts, each of which may be a marriage between several of your\noriginal ideas.\nPugh Chart Analysis\nA Pugh chart is a tool that helps evaluate ideas by setting up a list of characteristics and judging\neach idea in terms of the individual criteria. This helps to create a more objective and structured\nselection process.\nOne idea is chosen as the datum, or the idea to which all others will be compared. It is a good\napproach to choose a fairly simple idea as the datum, as it will be easier to do the comparisons\nthan if you choose one of your more complicated ideas. Revisit your problem statement and\nyour list of design specifications to determine the criteria and characteristics that you will use to\njudge your potential solutions. For each of the criteria, decide if the option you are evaluating is\nthe same (0), better (+) or worse (-) than your datum. Tally the results for each option and\ndetermine which idea is the best. You may want to weight some of the criteria more heavily (for\nexample, safety might be deemed more important than portability when evaluating your idea,\nand therefore you may choose to double the weight of that criterion). You may also find that\nwhen you make your final selection, you will choose characteristics from several of your options\nand combine them to form the final design; however you should be careful not to make your\nproject too complex.\nDeliverable (Homework 14)\nEach team should present the results of their concept evaluation at the Session #13 design\nreview.\n\nPhase 3: Implementation\nAnalysis & Experimentation\nNow that you have chosen the final concept, it is necessary to establish that critical subsystems\nwill perform as required. In many cases, performance can be predicted by calculations using\ndata obtained during the research phase. In others, experimentation will be required. The\nexperimental setup may closely resemble the contemplated prototype (in which case it's\nsometimes called a \"breadboard\" after the practice, in the early days of radio, of building the\ncircuit up on a wooden board used for cutting bread). Or, it might be much simpler, simply\ncontaining the functional element to be tested. For example, a phase-change incubator will\nrequire testing to determine the optimal geometry and quantity of phase change material. It\nmight be enclosed in plastic spheres of the intended size and number, or it might simply be\ncontained in a laboratory beaker. The choice would depend on the information needed and the\nresources available. Another example might be a mechanical linkage. If linkage dynamics are\nimportant, an accurate breadboard would be necessary. If only kinematics are required, a Lego\nmodel, or even cardboard model might be sufficient.\nDeliverable (Homework 15)\nEach team member should choose a critical subsystem of your chosen concept and perform the\nnecessary analyses and experiments to ensure that it can work according to specifications.\nIdeally, each person on the team should choose a different component or subsystem, but if\nthere aren't enough, independent work on the same component is acceptable. Present a\nsummary of this work at the Session #17 design review.\nDetail Design\nOnce the performance potential of the critical subsystems is established, it is necessary to work\nout all the details that will make a workable prototype. This will vary greatly from project to\nproject but includes aspects such as: dimensions and tolerances, material selection, kinematics\nof assemblies and sub-assemblies, and calculations of energy and power requirements. Every\ncomponent of your project should be designed to best fulfill its purpose. Your first layout will not\nbe your final one; continual refinement is possible until you run out of time, but the difference in\nquality from the first layout to the last can be enormous.\nKeeping all these considerations in mind, start the process of producing technical drawings of\nyour proposed design. Make sure to have all critical custom-made components drawn up either\nby hand or using computer programs such as SolidWorks, Pro/Engineer or AutoCAD (we don't\nneed drawings of screws, nuts, off-the shelf parts or banana leaves!). Also, with each drawing\nmake a list of materials that you will need in order to fabricate the parts you have designed, a\nlist of processes needed to fabricate each part and denote where they will be made (a small-\nscale machine shop, a large plastics factory, etc.).\nDeliverable (Homework 15)\nEach member of the team should choose a different component of the design and turn in the\ndetail drawing and materials list for that part. Even though each team member turns in just one\n\npart, this process should be done for all parts of the design. Present this information at the\nSession #17 design review.\nFabrication\nNow it is time to turn your ideas into reality--generally one begins by building a proof of concept\nprototype. In this case, the parts are typically fabricated on an individual basis and may not be\nmade in the same way, or of the same material, as the final product. A careful planning of this\nphase will save you valuable time, unnecessary waiting times for your raw materials or\ncomponents, and stressful last-minute hard-work.\nDeliverable\nAs a group, make a plan that outlines how you propose to complete your prototype during the\nnext three weeks. Sketch out the main steps in a Gantt chart or timeline, including milestones.\nList all the materials you will need in the fabrication of your prototype, and make a preliminary\nbudget detailing where you plan to obtain all your materials. Present this plan and the progress\nyou have made to date at the Session #17 design review.\nTesting and Evaluation\nOnce you have built a prototype, it is necessary to test it and see if it does what it is supposed to\ndo. Now is the time to go back to the design specifications outlined in the early stages of the\ndesign process and verify that the device works according to the given specifications. Devise\ntechniques for measuring the performance of your device for each of your design specifications.\nAs part of this exercise, think of how your device could be improved. Are there ways you can\nmake it cheaper, faster, better? Try to lower the part count or remove material. Is it as simple as\npossible (but not simpler? Not only should the technical performance of the device be tested,\nbut also the human factors; test for usability and ergonomics. Have people try your device and\nget their feedback. Whenever possible, have the actual users try the device, if this is not\nfeasible, try to find people with as close to the same background as possible. Have users try\nyour device without as little instruction or guidance as possible, and analyze their interactions.\nYou can observe how intuitive, easy and/or safe the device is to use.\nUse all the information gathered at this stage to inform the next iteration of the design process.\nConsider revising the design specifications and the original ideal and desired values. Identify the\nsubcomponents that need to be revisited or redesigned, and outline the goals for how to move\nthe project forward.\nDeliverable\nSummarize the results of your tests and present them at the Session #20 design review. Videos\nof people using the machine are an especially effective presentation technique. Include\nrecommendations for moving forward with the project.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Project Report: Movilavadora (Portable Bicilavadora)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/c6819704fd32f1ecc8002d2de0d0aa47_MITEC_720JS10_ProjWashFin.pdf",
      "content": "S p e c i a l T h a n k s t o . . .\nN a t e C o o k e\nV i c t o r G r a u - S e r r a t\nG w y n d a f J o n e s\nB e r n a r d K i w i a\nK a t h l e e n L i\nS u p r i o D a s\nD e n n i s N a g l e\nA m y S m i t h\nL i s a Ta c o r o n t e\nA d a m Ta l s m a\nM i k e Ta r k a n i a n\na n d a l l o t h e r D - L a b m e n t o r s !\nA l s o ,\nN a t e a n d J e s s i c a ' s o f f i c e\nT h a t s l e e p i n g b a g i n t h e D - L a b l o u n g e\n\" B r a i n s t o r m i n g \" w a l k s\nT h e M - L a b w e l d i n g m a c h i n e\n\nTa b l e o f C o n t e n t s\n0 . E x e c u t i v e S u m m a r y\n1 . P r i o r A r t\n1.1\nWashing Clothes\n1.2\nHand Washing and the Technology Gap\n1.3\nThe Washing Machine\n1.4\nHuman-powered Washing Machines\n1.4.1.\nMaya Pedal\n1.4.2.\nRadu Raduta\n1.4.3.\nRemya Jose\n1.4.4.\nLisa Tacoronte\n1.4.5.\nKathleen Li\n1.4.6.\nAdam Talsma\n2 . E v o l u t i o n o f a n I d e a\n3 . E x p e r i m e n t a t i o n a n d E v a l u a t i o n\n3.1\nDe-watering Experiments\n3.2\nBrief Prototype Testing\n4 . F i n a l C o n c e p t\n4.1\nObjective\n4.2\nDesign Specifications\n4.3\nOur Design\n4.3.1.\nOuter Drum\n4.3.2.\nInner Drum\n4.3.2.1.\nFrame\n4.3.2.2.\nWeave\n4.3.2.3.\nAssembly\n4.3.2.4.\nReasonning\n4.3.2.5.\nImprovements\n4.3.3.\nBicycle\n4.3.4.\nMobility Structure\n5 . N e x t S t e p s\n6 . A p p e n d i c e s\n6.1\nPugh Charts\n6.1.1.\nWashing Method\n6.1.2.\nDrying Method\n6.1.3.\nTransport\n6.2 Visual Comparison between inner drums\n6.3 Design Specifications from Initial Planning\n6.4 Rough Line Item Budget\n\n0 . E x e c u t i v e S u m m a r y\nP r o b l e m S t a t e m e n t\nTo design an economically-viable, human-powered washing machine that can be used by the average\nPeruvian woman entrepreneur. The machine must clean as well as or better than, and in less time\nthan hand-washing, and be compact yet stable enough to be transported by foot in an urban setting.\nDesign Specifications\nThe movilavadora's design specifications are divided into 6 major groups: form, portability,\neffectiveness, cultural acceptability, resource consumption, and economics. After reviewing interviews\nwith Guatemalan women, our main concern was that the customer would not be comfortable pedaling\nthe bicycle on the sidewalk. Therefore we aimed to accommodate their needs by reducing the\nmovilavadora's width so that it could be brought inside for more private use. We also aimed to\ntransform the current bulky design into something easy to turn, to move long distances, and to\nstabilize for the wash mode. In order to be more financially viable, we also worked to reduce the\nmaterials and processes needed for the product. To reduce environmental impact, we aimed to\nincrease the washer's efficiency so that less soap and water are needed. Overall we tried to balance\npeople, profit, and planet for the most sustainable project possible.\nPrior Work\nHuman-powered laundry machines have been designed and implemented at a small-scale in Peru,\nGuatemala, the Philippines, the US, and other countries. There are several crank-powered, compact\nmachines that are commercially available and target bachelors, business women, and other single-\nserve on-the-go lifestyles. On the other hand, the bicycle-powered machine has adapted for many\nenvironments and many demographics (men, children, etc). To our knowledge, four MIT teams have\nalso implemented bicycle-powered washing machines. All the models are horizontal axis washer, but\nthat is where the similarity ends. One has used plastic for both the inner and outer drum, one\ncombines a plastic inner with a metal outer, another uses a concrete basin with plastic inner drum, and\nthe final uses sheet metal to construct both. The most recent design by Lisa Tacorante incorporates\nthe seat into the design while the others rely on the user to find appropriately positioned seating.\nConcepts Evaluation\nThe movilavadora's functions can be broken into different categories: washing method, de-watering\nmethod, power source, and portability. Our initial challenge was to make the 2009 bicilavadora more\nportable. However, we began by investigating each of these categories to ensure that the use of the\n2009 bicilavadora would be a good foundation for the portable iteration. The main competing ideas\nwere (1) the Hippo roller which de-waters using compression (2) the fold-up suitcase design that\nutilizes netting as the inner drum and does not provide a seat from which to pedal, and (3) the washing\nmachine that is transported, powered, and dewatered by bicycle. After many Pugh charts, the 2009\nbicilavadora won out in all categories except for the inner drum. The previous team designed a\nmodular inner drum that is meant to be thermoformed and constructed for large-scale distribution.\nThermoforming requires huge initial investments; therefore, this was an unacceptable solution for our\nintermediate technology.\nProposed Solution\nRecognizing that the inner drum is a weakness in most pedal-powered machines, we decided to focus\nour attention on creating an inner drum from locally available materials. For us, it didn't make sense to\ngive portability to a machine with fundamental flaws. We brainstormed local materials that could\nprovide a strong, permeable inner drum. As a coastal town, Lima is home to many fishermen who are\ncapable of making durable netting that could be used as part of the inner drum. The inner drum is\nmade from wood and netting. As compared to the rest of the metal machine, this component can be\neasily removed, repaired, and replaced. This innovation is cheap as compared to plastic and rust-free\n\nas compared to metal.\nWe based our design for the movilavadora's portable structure off of the common food carts found in\nPeruvian streets. Women sell tea and sandwiches from large, boxy carts that are pushed forward from\ngut height. Our design fits a dolly to the movilavadora so that the wheels act as transportation while\nmoving from house-to-house and stabilizing shocks during wash cycles. The wheels are independent\nof one another, which allows for a small turning radius, and are large enough to manage a 5\" curb\ndrop-off.\nFuture Work\nIn general, our next steps concern market identification and product feedback. In particular, we will be\ncoordinating with Limakids to determine how our project can work with their aims and needs.\nHowever, we believe that we need to expand beyond LimaKids in order to reach our targeted\ndemographic. Before summer 2010, our team will draft a survey that will be used in Guatemala and\nSouthern Peru by Connie Lu and Brooke Jarrett, respectively. We will collect data concerning work\nhabits, typical income, etc. so that we can modify the design accordingly. If time permits, it would be\nbest to build a prototype in order to gather specific feedback about user interface. In the fall of 2010,\nBenji Moncivaiz will use the movilavadora for his 2.671 class. Here, we hope to detail a standardized\nexperimental procedure. This will then be used to establish baseline statistics for comparison to future\nprototypes.\n\n1 . P r i o r A r t\n1 . 1 W a s h i n g C l o t h e s\nThree major components are required in clothes washing: water, chemical surfactants and\nmechanical agitation. Heat speeds up the removal of soil from the clothing, but it is not absolutely\nessential for most types of soiled clothes. During washing, clothes are first submerged in water and\nchemical surfactant, and the mixture is mechanically agitated. The mechanical agitation lifts most dirt\nparticles from the clothes into the water. Chemical surfactants surround and loosen stubborn particles\nfrom fabric, and keep them suspended particles suspended in the water. After a period of mechanical\nagitation, the water and suspended dirt particles are drained. The clothes are then again submerged\nin clean water, and mechanically agitated to lift remaining dirt and chemical surfactant. This rinse\nwater is then drained. Rinse water can be reused. Finally, either wringing or fast, vigorous spinning\ndries the wet clothes.\n1 . 2 H a n d W a s h i n g a n d Te c h n o l o g y G a p\nThere is large technology gap between traditional hand washing and electric washing\nmachines. In communities around the world, many cannot afford to buy electric washing machines,\nwhich cost at least two hundred US dollars. Even if people had the initial purchasing power, many\ntimes they cannot afford the electricity required to operate these machines. The lack of sufficient\nwater pressure in many developing countries also deteriorates utility of most electric washers. Thus, it\nis very common for women to wash clothes by hand. Washing clothes by hand costs very little\nmonetarily, but is an extremely time consuming process. Moreover, repeated washing is harmful to\nhands due to prolonged exposure to harsh chemical surfactants combined with deliberate agitation.\nCold weather makes hand washing especially painful. The chemicals and agitation causes dryness\nand cracking of the skin that makes it difficult for women to do other daily activities. If clean water is\nnot easily available, women often wash laundry in contaminated waters, which can cause infections\nthrough the broken skin. Additionally, the posture required for hand washing clothes can cause back\npains, also hindering their daily activities. In both Peru and Guatemala, and most likely in many other\ncountries, some women earn their livelihood by washing clothes by hand for wealthier households.\nFor these women especially, the effects of harsh chemicals and agitation are magnified because they\nwash clothes very frequently. Moreover, the fact that hand washing is time-consuming means that their\nproductivity and income are narrowly limited.\n1 . 3 W a s h i n g M a c h i n e s\nMany types of washing machines have been invented and used, but the two designs that have\nproven to be most effective are the vertical axis (top-loading) and the horizontal axis (traditionally\nfront-loading) machines. In the vertical axis washer, clothes are fully submerged in water and the\nvertical drum rotates back and forth to separate and agitate clothing. In the horizontal axis washer, the\ndrum is only filled to approximately one-third of the full volume. The horizontal drum rotates\ncontinuously in one direction. Fins on the side of the drum pick up the clothing and drop them back\ndown, agitating and separating the clothes. Recently, horizontal axis washers have become more\npopular because they use significantly less water and potentially less power than vertical axis\nwashers. Rotating the drum in a single direction uses rotational momentum in its favor, whereas\nturning the drum back and forth requires a significant amount of impulse to change the momentum\nwith each switch in direction. However, it has been recognized that the horizontal axis drum needs to\nbe significantly stiffer and more robust to withstand the large amount of force that the pounding of wet\nclothes exerts on the drum walls. Moreover, horizontal axis washers generate more vibrations than\nvertical axis washers do.1 The understanding of the relative benefits and disadvantages of vertical\nand horizontal axis drums that has been gathered during the development of electric washing\nRaduta, Radu. \"Design for Dissemination of a Low Cost Washing Machine for Developing Countries.\"\nBachelors Thesis, Massachusetts Institute of Technology, Cambridge, 2008.\n\nmachines can be translated to human-powered washing machines.\n1 . 4 H u m a n - P o w e r e d W a s h i n g M a c h i n e s\none machine that is hand-crank powered. The WonderWash is a small plastic washing machine that\nwashes up to 5 pounds of clothes and is powered by a hand crank (Illustration 2). Commercially at\nless than $50 per unit, the WonderWash is targeted at campers, single people and businesspeople\nbecause of its portability and compact form.\n1 . 4 . 1 M a y a P e d a l\nThe NGO Maya Pedal in Guatemala attempted its first bicilavadora in 2005. This bicilavadora\nhad a vertical-axis and top-loading (Illustration 3). It tended to rip clothes and was hard to power, and\nas a result the project was abandoned.\nIllustration 3:Vertical-axis bicilavadora built by Maya Pedal. Image Credit: Raduta, 2005.\nIllustration 1: Household electric\nwashing machine converted to\npedal power (via exercise bike.)\nImage Credit: http://www.humboldt.edu\nIllustration 2: WonderWash hand-\ncranked washing machine is\nmarketed for campers, single people,\nand business people and washes up\nto 5 pounds of clothes at a time.\nImage Credit: http://www.dallasnews.com\n(c) Laundry Alternative. All rights reserved.\nThis content is excluded from our Creative\nCommons license. For more information,\nsee http://ocw.mit.edu/fairuse.\nThere have been\nmany efforts to create\nhuman-powered washing\nmachines. Some of these\nefforts have arisen out of\nenvironmental awareness,\nand several technologies\nhave been focused on\napplication in developing\ncountries. At Humboldt\nUniversity, two human\npowered washing\nmachines have been built.\nBoth of these adapt\nhousehold washing electric\nmachines to pedal power\n(Illustration 1). While most\nexamples of human-\npowered washing\nmachines have been pedal\npowered, there is at 2least\n2http://www.laundry-alternative.com/wonderwash.htm\n(c) Bart Orlando. All rights reserved. This\ncontent is excluded from our Creative\nCommons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n\n1 . 4 . 2 R a d u R a d u t a\nThe bicilavadora development was picked up again in 2006 when Radu Raduta and several\nother MIT students helped to continue the project at Maya Pedal. This MIT team worked with Maya\nPedal to build a proof-of-concept horizontal axis washer solely out of materials that could be found in\nGuatemala (Illustration 4). The MIT team first constructed a prototype on campus, and won an\nInternational Technology Award from the IDEAS competition in 2005 (Raduta). They were successful\nin building a very similar protytype at Maya Pedal as well, and materials were locally available, but\nsome materials were not locally abundant.\nIllustration 4: Horizontal-axis bicilavadoras built by MIT team and Maya Pedal in 2006. Left is\noriginal MIT prototype design. Similar prototype was built at MIT for IDEAS competition. Right is\nlocal adaptation from original design. Image Credit: Raduta, 2005.\nRadu continued to look thoroughly into washing clothes and the mechanisms of\nwashing machines in order to continue the bicilavadora project as his master's thesis in 2007. In this\nthesis, Radu focused primarily on the large-scale dissemination of the bicilavadora and on the design\nof the inner drum. Radu suggested a business model that was inspired by International Development\nEnterprises' (IDE) model of centralized manufacturing with local assembly. The inner drum of the\nbicilavadoras would be made in a centralized factory setting, and a kit containing only the parts\nnecessary to build the inner drum would be sold at local markets by stand owners who currently sold\nchemical washing powders. Radu suggested a marketing partnership between the bicilavadora and a\nspecific brand of chemical detergent. The partnership would be mutually beneficial, Radu believes,\nbecause the chemical detergent company would distinguish itself from a large field of competitors with\na \"novel way to promote...products\" and the bicilavadora company would \"increase adoption rates and\nfurther promote their brand.3\" The consumer or a middleman would be instructed on how to assemble\nthe parts, and to devise a system to catch water and secure the drum. In designing the inner drum,\nRadu explored different materials that could be used to make the inner drum and developed a\nfunctional and easily transported shape for the final inner drum. Radu ruled out metal for the inner\ndrum because metal corrodes easily. He also built a test inner drum entirely out of relatively water-\nresistant (oily) wood, but found the construction to be \"expensive, cumbersome and exceedingly\nheavy.\" See Appendix. He settled on making the drum from ABS, thermoformed into the shape he\ninvestigated.\nRaduta, Radu. \"Design for Dissemination of a Low Cost Washing Machine for Developing Countries.\"\nBachelors Thesis, Massachusetts Institute of Technology, Cambridge, 2008.\n\n1 . 4 . 3\nR e m y a J o s e\nA student named Remya Jose in India also\nengineered a clothes-washing machine that\nconsisted of a cylindrical drum made out of wire\nmesh inside of a custom-welded aluminum box\ncasing. Pedals on either side of the washing\nmachine directly drive the turning of the inner\ndrum, and the seat is detached (Illustration 5).\nRemya's father brought the original designs to an\nengineering workshop for manufacturing, and it\nappears that Remya's family has been using the\nresulting washing machine. Remya's story and the\ntechnology she created received attention from\nthe Indian government and a legal firm, which\nhelped Remya submit her design for patenting.\nHowever, it seems that the patent never came\nthrough and the design has not been\ndisseminated commercially.\nImage removed due to copyright restrictions.\nStill image from video clip, see full video at\nhttp://www.youtube.com/watch?v=VhlUVdbU9Lk\n1 . 4 . 4 L i s a T a c o r o n t e\nLisa Tacoronte built a bicilavadora using one of the\nABS drums designed by Radu during the winter of 2009. This\nbicilavadora was implemented during a D-Lab: Development\ntrip at an orphanage called Sagrada Familia in Lima, Peru.\nWhen we visited a year after the implementation, the\nbicilavadora was in use, although not well maintained. The\nbicilavadora was extremely well received, and very useful in\nhelping with the huge volume of laundry at Sagrada Familia\n(there are approximately 800 children who are housed and\nschooled at this orphanage). The community requested that\nD-Lab students bring more of the ABS drums and build more\nbicilavadoras, but had not taken the initiative to find alternative\ninner drums or build additional bicilavadoras on its own. For\nwhatever reasons, this model seems to be the most well\nknown bicilavadora, and has been documented in many news\nchannels like CBS.4\nIllustration 6: Lisa Tacoronte standing\namong the kids at La Familia Sangrada\nwith her bicilavadora. Image Credit:\nGwyndaf Jones, 2009.\nSee: http://web.mit.edu/newsoffice/2009/itw-bicilavadora-0219.html\nhttp://www.cbsnews.com/stories/2009/04/22/eveningnews/main4962435.shtml\n(c) Gwyndaf Jones. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse.\n\n1 . 4 . 5 K a t h l e e n L i\nKathleen Li also built a pedal-powered washing machine\nduring a trip to India in summer 2009. Because it is relatively\ninexpensive to have local craftsman make custom parts in the\ncommunity where Kathleen was working, the inner and outer\ndrum, as well as several other parts were manufactured to\norder, primarily out of sheet metal. Unlike Lisa's design, this\nwashing machine had a detached seat (See Illustration 7). One\nemployee at the NGO where the washing machine was built\nlikes using the machine to wash her clothes regularly, but it is\nunclear whether it has been used extensively by the community\nas intended.\n1 . 4 . 6 A d a m T a l s m a\nAdam Talsma, William Chin and Josh Geltman built a\npedal-powered washing machine prototype at MIT in Spring\n2008 through CityDays, and implemented an improved\nprototype in Tambo de Mora, Peru the following summer. The\nwashing machine had a detached seat, simple steel frame, and\nplastic barrels for the inner drum (see Illustration 8) The\nCityDays team was able to find appropriately sized plastic\nbarrels, but it has been noted in Radu's thesis that even when\na few barrels can be obtained, the supply is likely to be too\nlimited to accommodate scale-up. The construction process for\nthis washing machine is very well-documented. However, the\nwashing machine, as far as the team is aware, was not used\nafter they left Tambo de Mora.\nIllustration 7: A woman testing out the\nmachine. This is a still taken from a\nvideo. In it, the chain falls off several\ntimes. Image source: Li, 2009.\nCourtesy of Kathleen Li.\nUsed with permission.\nIllustration 8: Nested Drums. Image\nCredit: Talsma, 2007.\n(c) Adam Talsma. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse.\n\n2. Evolution of an Idea\nThe movilavadora's functions can be broken into different categories: washing method, de-\nwatering method, power source, and portability. Our initial challenge was to make the\n2009 bicilavadora more portable. However, we began by investigating each of these categories to\nensure that the use of the 2009 bicilavadora would be a good foundation on which to base our\nmodifications. The following table compartmentalizes our brainstorming sessions and research by\ncategory.\nWashing\nWater agitation\nScrubbing by friction\nImpact (rotational)\nImpact (pounding)\nPressurized air through\nmaterial\nDe-Watering\nHang wringing\nPressing together\n(direct)\nPressing together\n(rollers)\nSpin\nHeat\nWhip effect\nPower Source\nBicycle Pedal\nCrank\nSewing pedal\nRolling drum (ie Q-\nDrum)\nMotor\nManual shaking\nPortability\nBackpack / Briefcase\nBicycle\nPush cart / wheelbarrow\nRolling washer\nUsing a Pugh chart for each category, we concluded that spin washing, press de-watering, and\nbackpack transportation were the best solutions (power source was not discussed in detail until later in\nthe design process). These Pugh charts can be found in Appendix 6.1. Despite the results, certain\nideas and methods continued to persuade us in ways that the numbers could not. For example, in our\ndiscussion about press de-watering, our visual concept of pressing revolved around a single piece of\nclothing. Thus we put a plus next in this cell. If one considers an entire mountain of clothes, however,\nthe press de-watering becomes a less effective option.\nTherefore, over Spring Break 2010, each team member was tasked with detailing an integrated\ndesign that combined his or her favorite components of wash, de-watering, power, and portability\nstructure. The resulting ideas, their benefits, and\ndisadvantages are described below:\n(1) A Hippo roller which de-waters using\ncompression. The handles for pushing/pulling the\nmachine fold out to become the base of the machine\nduring wash mode. The method for powering was\nnot yet developed.\nBenefits: Simplicity. Many parts are multi-functional.\nDisadvantages: Instability and locking\ncomplications. Having the handles function as both a\npushing device as well as a stand has advantages,\nbut it is not optimal for creating a stable base. The\nmembers would need to be rigidly connected to the\nIllustration 9: Computer sketch of the Improved\nHippo Roller concept. Image Credit: Moncivaiz,\n\ndrum while also having the capacity for rotating. This would be difficult to achieve without a thoroughly\nengineered member, which would likely be expensive.\n(2) A collapsible suitcase design that utilizes netting as the inner drum. The pedals would fit on top of\nthe suitcase and be detached for wash mode. The user would need to find his or her seating from\nwhich to pedal. In wash mode, the\nhandle would fold over to prevent\nthe machine from sliding out further.\nBenefits: Compactness.\nUnhindered travel is optimized for\nthose who need to walk and take\nthe bus. This is a likely situation\nsince the washing woman will\nprobably not live in the same high-\nincome bracket neighborhood as\nher client.\nDisadvantages: Sealing issues\nand abundance of moving parts.\nEach of the sections would need a\ntight seal against other sections\nwhen expanded to wash mode. As\na result, the manufacturing would\nneed to be fairly precise to ensure\nproper alignment of pieces against\none another. Moving parts are inherently vulnerable points especially if they are used often. Sheer\nfriction and repeated use would significantly weaken the machine. This would possibly result in a\nshorter expected lifespan.\nIllustration 10: Sketch up model of the collapsible concept\nImage Credit: Hasan, 2010\n(3) A washing machine that attaches to the back of a wheelchair. The seat detaches from the\nwheelchair, using the front casters and metal back\nlegs (originally the armrests). The drum is placed\nbetween the wheels which act to stabilize the drum\nas it spins (not reflected in diagram). The entire thing\nis powered by hot water pressure that pushes the\nsuds of soap through the cloth.\nBenefits: Compactness and ability to carry washing\naccessories. The wheelchair could be used to stack\nlaundry, detergent, or other related items.\nDisadvantages: Use of an expensive wheelchair\nwith an able-bodied person. Modifying a wheelchair\nis not ideal. It would be best to take the basic\ncomponents of a wheelchair (seating, push cart\nhandles, and wheels) and design around local\nmaterials. Additionally the wheelchair is an\nunnecessary transportation mechanism if the person is already capable of walking.\nIllustration 11: Diagram of wheelchair idea, Image\nCredit: Jarrett, 2010\n\n(4(4) Building off of the Q-Drum concept,\nthis design is suspended off the ground.\nThe bicycle wheels support the drum, turn\nit, and allow it to go over rough terrain.\nHere, the clothes would be washed/dried\nas one walks. The ends of the handles\nhave two pegs on which the drum can be\ncentered. Each peg creates a different\ngear ratio, allowing for a transition\nbetween wash and transportation modes.\nBenefits: Simplicity of using a single drum\ninstead of requiring inner and outer drums.\nDisadvantages: Being required to walk in\norder to wash.\nIllustration 12: Sketch to describe the transition between\nwash and spin modes.\nImage Credit: Lu, 2010\n(5) A washing machine that is transported, powered, and dewatered by bicycle.\nBenefits: Ease of transportability.\nDisadvantages: The device is bulky and\nwould require some fairly complicated\nPhoto of bicycle-powered ice cream push cart removed due to copyright\nmechanisms for engaging and\nrestrictions. See http://www.hollywire.com/the-news-dump/change-\ndisengaging the chain between\nthe-world-one-hot-dog-taco-and-cupcake-at-a-time\nwash and transportation modes.\nThe inner drum has varied across all of the bicycle powered machines that have been\ndescribed so far. Please see Appendix 6.2 or a visual comparison between the variations. Previous\ndesigns have incorporated a number of materials such as ABS, wood, plastic water barrel, sheet\nmetal, and metal mesh (resembling chicken wire). We immediately ruled out ABS since it is not\n\nfinancially sustainable on a small-scale. The plastic water barrel is only available in certain parts of\nPeru and cannot be depended on for consistent sizing. Sheet metal will rust, but there are methods of\npreserving it such as using varnish or car body coatings. We decided against this alternative for\nenvironmental and health reasons. We decided on using a combination of a mesh (metal / rope) and\nwood for our inner drum design. Being locally available, easy to work with, and cheap, these materials\nwere ideal for the conditions in Peru.\nThe derailleurs are another weakness in the 2009 bicilavadora (Tacoronte's) design. This\nsystem is not immediately intuitive to someone who has never ridden a bike before. This is a likely\nscenario in Peru where women are not often found riding bikes. The system is also not easy to build\naround due to the precision and knowledge necessary to install the derailleur successfully. If it breaks,\nthe women will need to seek help for repairs. To top it all off, the chain must wrap around as the bike\nfolds into transportation mode. For these reasons, we tried to come up with a good alternative to the\nderailleur. The retro-direct is the best alternative at this point. However, we decided not to pursue the\nretro-direct since we knew it would involve expensive, unusual gear ratios. Additionally, time was\nlimited and so we were forced to prioritize.\nThe five ideas from Spring Break inspired a final concept. Based off of several experiments\nthat are detailed in section three, we shaped this concept into our final design which is described in\nsection four. This design incorporates the idea of the pushcart, wheels as stabilizers, fishermen's rope\nfor the inner drum, and bicycle power.\n\n3 . E x p e r i m e n t a t i o n a n d E v a l u a t i o n\n3 . 1 D e - w a t e r i n g\nHand wringing is one of the hardest stages in hand washing clothes, thus removing water after\na wash cycle is one of main challenges in creating a good washing machine. We tested different\nmethods of de-watering our clothes by using a small towel which we wet to saturation. From its soppy\nstate, we measured the amount of water we were able to remove using different methods. Our\nstandard test was hand-wringing, for which we folded the towel and twisted it to remove the water for\n30 seconds.\nMost modern day washers use a spin cycle to remove water after a wash. In order to simulate\nthe spin cycle of a washer the towel was suspended inside a mesh pocket inside of a bucket and was\nmanually spun around on the vertical axis as fast as possible. A similar test was also preformed while\nspinning on the horizontal axis.\nIllustration 14: Different methods tested for de-watering. Wringing by hand (right), horizontal axis spinning\n(middle), and vertical axis (left). Image Credit: Lu and Jarrett, 2010.\nA method to remove water before the introduction of a spin cycle was a press. We tried three\nmethods of press drying (see Illustration 15. First, the towel was placed between two planks of wood\nand full body weight was put on it by stepped on it. The stepper rocked back and forth for about 30\nseconds and then measured the amount of water that is in our flat bin. The second was similar but the\ntowel was pressed mechanically by clamping towel between two planks until it would no longer\ntighten. Finally, using a 4\" diameter cylinder, we rolled over the folded towel four times back and forth\nand measured the amount of water squeezed out.\nIllustration 15: Different methods tested for de-watering. Vertical pressing via weight (right), vertical\npressing via clamp (middle), and pressing with roller (left). Image Credit: Moncivaiz and Hasan\n\nThe results of these are as follows:\nHand\nVertical\nHorizontal\nHuman\nMechanical\nRolling Pin6\nWringing\nSpin\nSpin\npress\nPress\nTester\nJarrett and Lu1\nHasan and Moncivaiz2\nTest 1\n610mL\n450mL3\n500mL5\nTest 2\n580mL\n485mL4\n380mL3\nTest 3\n540mL\nn/a\nn/a\nMean\n576.6mL\n445mL\n472.5mL\n720mL\n720mL\n600mL\n800mL\n800mL\n620mL\n800mL\n800mL\n650mL\n773.3mL\n773.3mL\n623.3mL\n1 Weight of water used to measure the amount of water removed, using 1mL/g as the conversion\nfactor.\n2 Volume of water used to measure the amount of water removed, in mL.\n3 Was spun for 20 seconds.\n4 Was spun for 30 seconds.\n5 Was spun for 25 seconds.\n6The cylinder was somewhat hollow so full force could not be applied.\nIllustration 16: Final Results from testing.\n3 . 2 B r i e f P r o t o t y p e Te s t i n g\nAs part of our experimentation, we did two informal tests to determine how our machine\nworked. Due to time constraints, we were not able to use the machine multiple times. Instead, we\nused these moments to quickly identify obvious issues and to better understand the design challenge\nfrom the user's point of view.\nOur first prototype testing occurred early on in the process. We wanted to see how well the\n2009 bicilavadora was able to wash clothing. We learned that the outer drum needs a clever way to\nseal all of the holes that are made for bolted connections. We first tested the inner drum with a window\nscreen that we stapled at as many points as possible along the radius. It tore in under fourteen\nminutes of washing and spinning. Then we tested two kinds of ropes. We were able to determine\nappropriate spacing between the ropes through iterative wrappings and found that the polyethylene\nrope was superior to the others tested. The final realization was that the drain took more than 15\nminutes to drain, adding a significant amount of time to the washing process.\nThe second test occurred on the night of May 7th, 2010, the dawn of our presentation. We\nwashed and dried a full load of laundry to test the drum's effectiveness as a washing machine. This\nbrought our attention to many other flaws in the design. First, the machine continued to leak. While\nfilling, water poured out generously. Once it had filled a decent amount, however, the springs of water\nebbed to a slow drip. We hypothesize that this is due to an auto-seal from the weight of the water\nplacing pressure on the inner tube washers. Since the leaks appeared again once the drum was being\nemptied, we think that this is sufficient evidence to prove our theory. Improvements could be made by\nusing plumber's epoxy on permanent holes, but we do not yet have detailed ideas of how to seal it\ntemporarily without using o-rings or other expensive parts. Another issue was the distance between\nwrappings. Despite calculating the distance needed between each turn of the rope, small items like\nsocks and underwear still fell through. We later noticed that one shirt sleeve had even torn. In\nconclusion, we would need to either decrease the distance between each wrapping or \"cross-tie\"\nadditional rope perpendicular to the main wrapping, as well as cut down the bolts so that no loose\nsleeves catch. There is no way of knowing when clothing falls through the cracks unless one opens\nthe drum. Hopefully this will not be an issue once the inner drum's rope spacing has been perfected.\nFrom simply using the machine, we realized other user interface issues. We would like for our\ndoor to move more smoothly so that it does not inconvenience the customer. Additionally, a stop\nneeds to be added so that the chain automatically lines up for easier gear changes. Easier gear\nchanges can also be aided by keeping the movilavadora in low gear when ending each dry cycle so\nthat the next wash cycle starts up quickly and without effort. This should be mentioned in whatever\nguide accompanies the machine. Finally, we would like to point out that the bottom derailleur confused\nand frustrated us on several occasions. In our opinion, any attempt to change this part of the system\nwould greatly improve the design.\n\n4 F i n a l C o n c e p t , E x e c u t i o n , a n d C r i t i c i s m\n4 . 1 O b j e c t i v e\nTo design an economically-viable, pedal-powered washing machine that can be used by the\naverage adult Peruvian woman entrepreneur. The machine must clean as well or better, and in less\ntime than hand-washing and be compact enough for travel by foot in an urban or peri-urban setting.\n4 . 2 D e s i g n S p e c i f i c a t i o n s\nA detailed version of the design specifications can be found in appendix 6.3. The\nmovilavadora's design specifications are divided into 6 major groups: form, portability, effectiveness,\ncultural acceptability, resource consumption, and economics. After reviewing interviews with\nGuatemalan women, our main concern was that the customer would not be comfortable pedaling the\nbicycle on the sidewalk. Therefore we aimed to accommodate their needs by reducing the\nmovilavadora's width so that it could be brought inside for more private use. We also aimed to\ntransform the current bulky design into something easy to turn, to move long distances, and to\nstabilize for the wash mode. In order to be more financial viable, we also worked to reduce the\nmaterials and processes needed for the product. To reduce environmental impact, we aimed to\nincrease the washer's efficiency so that less soap and water are needed. Overall we tried to balance\npeople, profit, and planet for the most sustainable project possible.\nSince we spent so much time on planning and building our prototype, we have not yet had\nsufficient time to measure our machine's capabilities. Thus the design specifications acted more as\nguidelines than hard requirements. There are certain things that we can assume work the same as\nTacorante's 2009 model such as \"water requirement\" or \"blacksmith capability\" since there has been\nno modifications to the outer drum. The other areas of our design specifications require further\ninvestigation to ensure that they meet the standards we originally set out.\nWe can, however, compare basic differences between the movilavadora to an electric washer.\nIllustration 17: Comparison to a typical electric washing machine.\nThe comparison for cost is based on a one-time investment and is not adjusted for the lifetime of each\nproduct since there is not sufficient data on how long the movilavadora lasts in the field. However, we\ncan make a rough estimate that the movilavadora would last 3 years before needing to be repaired\nbased on the year-long,intensive stay that La Familia Sangrada has given Tacorante's 2009 model.\nThe typical washing machine, on the other hand, tends to last approximately 7 years based on\nConsumer Reports' website.5 Thus, the movilavadora costs $100/year. This cost is identical to less\nexpensive washing machines. More expensive washing machines would cost $390/year.\nSince our design is meant to be more affordable and portable than an electric washer but more\nhttp://askville.amazon.com/Average-lifetime-clothes-washer/AnswerViewer.do?requestId=9178005\n\neffective or faster than washing by hand, we can only comment that it achieves an equal or better\nfinancial viability as well as vastly improved portability. Observations in the field are needed to obtain\nreliable data about normal hand washing habits and to gather feedback on the current design's\ncultural acceptability, performance, user interface, and maneuverability.\n4 . 3 O u r D e s i g n\nThe machine can be broken up into five major groups: inner drum, outer drum, bicycle,\nportable structure, and connections. This section will describe the components in each with\ndimensions included in pictures, their reasoning, and the specific areas needing improvement. Many\nof the basic components of the movilavadora had already been fabricated so our team does not know\nall of the exact steps of their construction. To learn more, please contact Lisa Tacoronte or refer to the\nmaterials inside the folder marked \"1PriorArt/2009_Tacoronte_DLab.\"\nBicycle power was chosen over two other alternatives: the hand crank and the sewing pedal.\nLegs are one of the strongest parts of our bodies so we are able to pedal more quickly and powerfully\nthan we would be able to do with our arms. Additionally, the bicycle is ubiquitous in Lima, Peru. This\nmeans that bicycle parts should be abundant. Again, this prefabricated bike frame can be ordered\nstraight from companies at a wholesale price. Getting them straight from a factory ensures quality and\nconsistency as opposed to buying them recycled. This reliability allows us to manufacture much\nquicker than if we needed to measure and remeasure to account for variabilities that are inevitable\nwith handmade products.\n4 . 3 . 1 O u t e r D r u m\nIllustration 18: The final machine with dimensions. Image Credit: Lu, 2010.\nThe outer drum is made with a used 50-gallon drum. A middle section is cut out and the drum\nis re-welded together. Special care should be taken to ensure that the weld is made leak-proof and\nstraight. Holes are made on the flat, circle sides of the drum and a door is cut out. The door is made\nby gently bending a piece of thin iron stock to match the curve of the drum and then attaching a bike\ncup to it. The door is lined with a frame made of t-iron. As can be seen in the illustration below, an\nlong piece of thin flat stock is welded onto the inside of the t-iron to hold and guide the door.\nAfterwards, the sleeve bearings should be attached to angle iron and centered on the flat side\nof each drum (see illustration 26). These will support and hold the inner drum's axis. Whenever\nsomething needed to be connected to the outer drum, we opted to use bolts as opposed to welds for\n\nsimplicity and to avoid weakening it unnecessarily.\nThese holes were closed by pushing the bolt\nthrough a layer of bicycle inner tube and a washer\non either side of the drum and tightening to seal.\nThe drum was chosen because it is heavy\nenough to provide the washer with significant\nstability. Unlike Talsma's 2008 version made of\nnested plastic barrels, the 50-gallon drum does not\nneed to be bolted to the ground for use. We tried to\nreduce our environmental impact in two ways: (1) As\na top loading design, the movilavadora uses 1/3 of\nthe water needed for top loaders, and (2) Using\nrecycled parts such as the oil drum. Finally the oil\ndrum was chosen because the volume is large\nenough to accommodate most family's needs.\nImprovements can be made. Despite the\nuse of bicycle inner tubes to line the holes needed to\nbolt, there is still leaking. The use of silicon sealant\nor plumber's epoxy would be useful here. The door\nalso needs to be made more exactly to prevent\nleaking. This could also be fixed by adding round rubber tubing to the door's edges for a tighter seal\nagainst the slides. Although we were losing water out of these holes quickly, the drain did not\nevacuate the inner drum quickly enough. This could be fixed by enlarging the hole or using a siphon\nsystem that removes water from the top door. A siphon would also help solve the issue of the drain's\nheight. Where it is currently attached, there is no clearance or height for someone to hold a bucket\nunderneath it. Finally, the drum is not very aesthetically pleasing. It is not immediately obvious what\nthe movilavadora is meant to do unless told or shown. This could be easily rectified by painting\n\"Lavadora\" on the side.\n4 . 3 . 3\nI n n e r D r u m\nWe chose to focus on design for affordability and manufacturability for the inner drum. The inner\ndrum's components are currently made out of wood planks (2 X 4s and 1 X 1s), 1⁄4\" plywood, 1⁄4\"\npolyethylene rope, and hardware as mentioned below.\nIllustration 19: Detailed look at how the door sits on\nthe frame. The knob made from the bike knob is\nalso visible on the right. This was accomplished by\nplacing a washer inside and cutting a bolt to length.\nThis way the bolt does not catch on the frame.\nImage Credit: Lu, 2010.\nIllustration 20: The inner drum. Image Credit: Lu, 2010.\n\n4 . 3 . 3 . 1\nF r a m e\nTo begin construction, we cut two circular pieces of 1⁄4\" thick plywood to serve as ends of the\ninner drum. A 3\" difference in diameter between the outer and inner drum left 1.5\" of space all around\nthe inner drum when inside the outer drum. These plywood circles lie parallel to the circular part of the\nouter drum. A heavy metal collar and a small piece of sheet metal were placed at the center of either\nside of each plywood circle, to provide a robust connection between the movilavadora drive axis and\nthe inner drum. The metal collar has three screws that can be tightened to secure the drive axis,\nwithout having the axis go through the inner drum. Both ends of the drive axis were extended through\na sleeve on the outer drum. One end was connected to the bike chain via a freewheel. A freewheel\nwas attached by first welding a cup (which had matching threads to the freewheel) onto the pipe\ncoming from the inner drum. The weld was ground down in order to allow the pipe to easily slide in\nand out of the sleeve bearing on which the inner drum rotates.\nThe wood planks were cut to length and secured, becoming the ribs/fins of the inner drum. The\nribs/fins were screwed in the circumference of both circle plywood pieces, and oriented so that they\nwould move the clothing around during the wash cycle. Three 2 X 4s and three 1 X 1s were used,\nbecause we felt that three fins were sufficient for cleaning purposes and we wanted to maximize the\nspace inside the inner drum in order to be able to wash more clothing. The length of the planks is\nimportant because if they are too long, the inner drum will not fit inside, and if too short, too much\n\"wiggle\" room is allowed for the inner drum to shift back and forth when inside the outer drum. This\nmakes it difficult for the chain to stay on the drum consistently. Since we did make the mistake of\ncutting the 2 X 4s too short, we compensated for missing length in the assembly process, as\ndescribed later.\n4 . 3 . 3 . 2\nW e a v e\nWe notched the wood planks every 3⁄4\". The notches maintained the spacing between the\nropes, and therefore allowed us to save on the amount of rope used and improve the affordability of\nthe inner drum. The rope was tied around one of the 2 X 4s, and woven around the drum, using the\nnotches as guides. We pulled the rope as tight as we could to ensure that the maximum strength in\nthe rope could be utilized to maintain the shape of the rope \"cage.\" We went around for 1/3 of the way\nspiraling the rope down the sides of the drum. Then, in order to provide access into the inner drum, we\ncreated a hole in the weaving. We changed directions by swinging around a 2 X 4. When we reached\nthe other side of the hole, we turned around the adjacent fins and then repeated the process. After the\nwidth of the hole is created, a continuous spiral was adopted for the final 1/3 of the way down. Care\nwas taken to maintain the rope always parallel to itself and parallel to the ends of the inner drum, so\nthat we did not have unnecessarily large holes. To make the rope more taut, we cross-tied additional\nlengths of rope down the middle of each \"panel.\"\n\n4 . 3 . 3 . 3\nA s s e m b l y\nNormally, the inner drum and drive axis can simply\nbe placed into the outer drum, through the sleeves.\nHowever, because we cut the planks too short,\nmetal \"washers\" (made of pipe larger than the pipe\nused as the axle) were installed on either side of the\ncollar that supports the inner drum. One washer\nspaces the inner drum's collar and the sleeve, and\nthe other spaces the inner drum freewheel and the\nsleeve. Please see illustration 21.\n4 . 3 . 3 . 4\nR e a s o n i n g\nWe chose to construct the inner drum out of\nwood and rope because these materials are cheap\nand readily available. We chose to use rope\nbecause fishing expertise (and, therefore net-\nmaking knowledge) is common in Peru, and we believe that local net-makers can improve on our\ndesign. Because the materials are widely available, the inner drum is easily replaceable and\nrepairable. There is legitimate concern that wood would rot because it is getting cyclically exposed to\nwater and air. However, if there is sufficient ventilation to air-dry the wood quickly enough, it will likely\nstay robust. We do realize that in the field, the user should not have to worry about where to put the\nmovilavadora so that the inner drum does not rot. Thoughts on this improvement is expounded on\nbelow.\n4 . 3 . 3 . 5\nI m p r o v e m e n t s\nFuture improvements to the wood construction include making the 2 X 4 structure easier to\npush through water (for example, drill holes into the board). This way, when washing, the force needed\nto spin the fins through the water is decreased and the person does not have to work as hard to push\nthe inner drum through the water. It would be ideal if the only resistance were coming from the clothing\nbeing forced through the water. Also, we would recommend using a more oily and durable wood. Pine,\nwhich most planks are currently made of, is too wearable. We believe that an oily wood, such as\ncypress, would improve the lifetime of the inner drum dramatically. The wood poses another problem.\nIt splinters very easily because it is softened by the exposure to water. Residues are left on the\nclothing. If the pine were replaced with a harder wood, this problem may be solved as well.\nWhen the U-shaped bracket that serves to secure the folded bike was attached, nuts and bolts\nwere used. These nuts and bolts protruded into the drum and began to hit the door of the inner drum\nwhen we started spinning. With every hit, the door became looser and looser. Currently, the way to\nsecure the inner drum's door is simply by tying it in position with rope. A more clever and quick-change\ntype of system to open the door of the inner drum should be considered instead of simply tying it in\nplace.\nThe collars that make the transition from the plywood circles to the pipe axle are specialized\nhardware. It would be ideal to come up with a way to connect the inner drum to the chain (we did it\nwith a collar and pipe) so that no specialized pieces such as the collar were used. Efforts can be\naimed at figuring out a different way to mate the pipe to the plywood circle.\nBecause of the current arrangement of the rope, socks and underwear escape through the\ninner drum during the spin cycle. Once they fall out, they get caught or torn on bolts protruding through\nthe outer drum. Clothing is most likely to escape from the edge, near the circular plywood. One would\nthink that simply putting the ropes closer together would easily solve the problem, but the problem with\nthis \"solution\" is that the wood between the notches in the wood will get thinner and thinner. Care must\nbe taken to ensure that the strips left between notches is stable and will not simply fall off with any sort\nof reasonable load. One solution could be to increase the amount \"cross-tying\" done, increasing from\nthe current one to a possible three times.\nIllustration 21: The sleeve that holds the inner drums\naxle. Image credit: Lu, 2010.\n\n4 . 3 . 3 B i c y c l e\nBicycles in Peru are typically made\nof cheap steel and sold for new at as little as\n$ 40 USD. Since specific parts of the bike are\nneeded, it would be best to strike a deal with\na local manufacturing company so as to\ncreate demand for those specific pieces\nrather than a wasteful demand for the entire\nbike. But the frame can be taken from a\nbicycle that is no longer functioning as well.\nThis reuses materials that might have\notherwise been thrown away. The back part\nshould be cut off as indicated in illustration\n22.\nThe bicycle needs to be attached to\nthe outer drum at an angle as seen in\nIllustration 23: Side view of the movilavadora in washing mode\nwith dimensions. Image credit: Lu 2010.\nIllustration 24: Close-up of the bike to\ndrum connection. Photo Credit: Lu 2010.\nIllustration 22: Cut on the line and leave a bit of material on\nthe bottom of the frame, behind the bottom bracket, so that\nthere is ample material remaining to weld the stand to.\nImage Credit: Jarrett, 2010.\nillustrations 23 and 24 This is so that the pedals do not hit the ground. This connection is made by\nwelding the tube from the bike's fork at the angle necessary such that the rest of the bike can rotate\nabout this fixed point. This is reinforced by welding on all sides. A close up is shown in illustration 24.\nThe chain connects from the bottom bracket of the bike to the freewheel on the inner drum's\naxle. After the freewheel has been attached, the derailleur can be installed. The derailleur system\nshould be fit on the movilavadora upside down as seen in illustration 24. The L-piece in illustration 26\nis made from two pieces of angle iron. The derailleur is one of the most challenging parts of the\ndesign, but the tension in the shifters is somewhat forgiving of imprecise welds. The L shape should\nbe brought as close to the free wheel as possible, otherwise it will need to be bent to reach further\ngears.\nThe detachable stand/lock needs two tubes to be welded onto the bottom of the bike frame,\nperpendicular to ground as seen in illustration 27. These tubes are capped by welding flat stock to the\ntops. An appropriately sized piece of rebar should be taken and bent into a \"U\" shape so that the arms\nof the \"U\" are sized to slide into the tubes at the back of the bike frame. This distance should be the\nsame as the distance from the outside of the top tube to the outside of the inner drum as seen in\nillustration x so that the stand can double as a lock. After measuring the height from the caps to the\n\nIllustration 26: Top view of the derailleur with\ndimensions. Image credit: Lu 2010.\nIllustration 25: Upside down derailleur. Image credit: Lu,\n2010.\nground, one should add a few 1/16ths of an inch on to account for the elasticity of the steel. This new\nheight should indicate where to bend the bike stand/lock to make a foot on which it sits as seen in\nillustration 28.\nIllustration 27: Close-up of the removable stand with dimensions.\nImage credit: Lu 2010.\nIllustration 28: The removable stand\ndoubles as a lock when the movilavadora is\nin transportation mode. Photo credit: Lu\n2010.\nThere are other benefits to using a bicycle. The machine relies on pedal power as opposed to\nfossil fuels. Unfortunately it is unlikely that enough people using electric washing machine users will\nswitch to the movilavadora for a measurable benefit for the environment. The machine works without\nthe derailleur, which is a fussy and complicated part of our design. This means that the manufacturer\ncould opt out of using it in order to make it affordable to people with lower incomes.\nThe bicycle will be the main user interface once our product is disseminated. Once the\nmachine was assembled, we had limited time using it as it might be used on the field. Based off of\n\nthese short experiences, we are already able to see needs for improvements:\n-The seat is uncomfortable after prolonged use. This may be an issue given that the women\nare likely to work often and without breaks. This can be fixed by adding cushioning or replacing\nthe seat altogether.\n-The bike handles are not located in a very ergonomic position. One needs to hunch over and\nlean on the palms. By doing something similar to the handles on the dolly, it may be more\ncomfortable.\n-The transition presents a number of issues:\n*The rotation of the bike is not constrained during transition from transportation to\nwashing mode. It just keeps rotating. There needs to be a physical stop so that the\nchain is fed into the derailleur straight.\n*The chain bends a bit when folded up for transportation mode. The tension could be\nrelieved by somehow increasing the chain's length before folding so that it sags and\nturns instead of bending on its inflexible axis.\n*The pedals have to be in a certain position for the transition to be successful. When\nthe pedal is rotated correctly, it does not rub against the wheels. The method for\ntransitioning needs to contain as few steps as possible.\n-The derailleur can be finicky to install and is non-intuitive to non-bike users. We should further\ndevelop the retro-direct or consider other alternatives to the derailleur. Additionally, a low cost\nyet durable way needs to be developed to keep the derailleur housing in place. It is currently\nstuck on with duct tape. It works, but something more permanent would be nice.\n4 . 3 . 4\nM o b i l i t y s t r u c t u r e\nThe innovation of our design is adding\nmobility to the bicilavadora. This is accomplished\nby attaching the drum to the frame of a dolly as\nseen in illustration 29. There are four connections\nmade with bolts and washers. We chose to\nconnect at points rather than flat stock such that\ndeformities that occurred would be isolated and\nnot rip off sections of the outer drum.\nThe dolly was serendipitously found in D-\nLab and was chopped up to fit our needs. We kept\nthe wheels, removed most of the lateral supports,\nand altered the handles to be more comfortable to\npush and pull the movilavadora across different\nkinds of terrains. The dolly was also modified to\naccommodate the removal of the inner drum for\nmaintenance or in case something that has fallen\nbetween the ropes needs to be retrieved.\nThe main structure of the dolly is two\nparallel bars on which the drum rests. The wheel's\naxle provide one point of lateral stability. The\nlaundry basket holder and the feet of the drum\nprovide further support. We made the feet of the\ndrum's bike-side lower than the height of the\nwheels, as seen in illustration 30, so that the water would drain out more effectively than in a flat\nsurfaced barrel. Then, the original handles were cut and reattached. The new arrangement provides\n22\" of space so that someone can walk between them comfortably as seen in illustration 23.\nIllustration 29: Diagram of how the drum attaches to\nthe dolly. The angle iron is welded onto four points on\nthe dolly and then, the drum is bolted down. A washer\nis cut from a bike inner tube to seal on either side of\neach nut. Image credit: Jarrett 2010.\n\nIllustration 30: The movilavadora from side to demonstrate the detail\nand dimensions of the handle which is meant to be an ergonomic\nadaption of a wheelbarrow for the average Peruvian woman of 5 1 .\nImage credit: Lu 2010.\n\nThe dolly provides many\nbenefits. While the wheelbarrow is\neasily maneuverable, the lack of\nbalance makes it a much more\ndifficult task to man for long\ndistances. On the other hand, a\ncart design would be more\nexpensive and possibly over stable.\nTwo wheels offer a good balance\nbetween these two options. The\ncenter of mass is low enough that\nour system feels ultra-light, but the\nhandles are low enough to offer\nenough control over the machine.\nAnd with two independently moving\nwheels, the turning radius is not\ncompromised noticeably.\nMobile business such as knife-\nsharpeners and fruit smoothie\nmakers are common in Peru. The\nmovilavadora's structure is also a\n\"push-cart\" technology that is\nidentical is functionality to the\naforementioned mobile businesses.\n' \"\nIllustration 31: movilavadora from the side with dimensions. Note the tilt\ndownwards which helps the water drain to the spigot. Photo credit: Lu\n2010.\nInstead of biking with the washer, as one might do with a cycle rickshaw, a woman can comfortably\nwalk with the machine, just like other businesses.\nIn the future, it would be better to start our dolly from scratch, using local materials like angle\niron, flat stock, and rebar. In this way, we could reduce our costs considerably. For example, we\nestimate that our $ 80 USD dolly could have been made for under $ 10 USD in almost any metal shop\nnear Lima. There are two other issues with this prototype's structure: the outer drum door is difficult to\nremove while the oil drum is bolted to the dolly and the structure is not as easily moved in tight spaces\nas we would like it to be. If we had started from scratch, it is unlikely that we would have come across\nthese two issues since we would have designed for them. However, working with a pre-existing object\nmeant that we had to modify it to our needs instead. What if we could invent a way to fold the pedals\nin or to rotate the drum for transportation mode such that the bicycle sat on top of the outer drum\ninstead of folding to the side? Obviously, further improvements are possible!\n\n4 . N e x t S t e p s\nIn general, our next steps concern market identification and product feedback. In particular, we\nwill be coordinating with Limakids to determine how our project can work with their aims and needs.\nHowever, we believe that we need to expand beyond LimaKids in order to reach our targeted\ndemographic. We would also like to identify and observe other house-to-house businesses. If there\nare other cart-based services that we could model ourselves after, it would be useful to document their\nbusiness models for later reference.\nBefore summer 2010, our team is drafting a survey that will be used in Guatemala and\nSouthern Peru by Connie Lu and Brooke Jarrett, respectively. We will collect data concerning work\nhabits, typical income, etc. so that we can modify the design accordingly. If time permits, it would be\nbest to build a prototype in order to gather specific feedback about user interface. In particular, the\ndata could be used to create a cost-benefit analysis. This would further our design by knowing where\nwe can cut our costs and what tradeoffs would be acceptable.\nIn the fall of 2010, Benji Moncivaiz will use the movilavadora for his 2.671 class. Here, we\nhope to detail a standardized experimental procedure. This will then be used to establish baseline\nstatistics for comparison to future prototypes. In hopes that our document will serve as instructions for\ncreating more pedal-powered washing machines, it will be brought to Peru and Guatemala to be\nreviewed by random samples of welding shops to survey whether they believe they would be able to\ncopy the design based off of the information given. If there are negative responses, we will determine\nwhat is missing in order to complete this document.\n\nAppendix 6.1: Pugh Charts\n\nempty page for fun\n\nAppendix 6.2: Visual comparison between inner drum designs\nImage removed due to copyright restrictions.\nStill image from video clip, see full video at\nhttp://www.youtube.com/watch?v=VhlUVdbU9Lk\nIllustration 33: Wood from Radu Raduta for\nGuatemala (2005)\nIllustration 34: Sheet Metal from Kathleen Li in India (2009)\nIllustration 35: Plastic Barrel\nIllustration 36: ABS from Radu Raduta for Peru (2005)\nfrom Adam Talsma in Peru (2008)\n(c) Adam Talsma. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse.\n\nAppendix 6.3: Design Specifications from Initial Planning\n\nAppendix 6.4: Rough Line Item Budget\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II:\nDesign Spring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Project Report: Spiral Pine Needle Stove",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/4b70af48056f59c67f485cda9736d93f_MITEC_720JS10_ProjStoveFin.pdf",
      "content": "Spiral\nPine\nNeedle\nStove\nD-Lab Design, Spring 2010\nBy four MIT students\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nTABLE OF CONTENTS\nSummary..............................................................................................3\nPrior\nWork...................................................................................................... 5\nDesign Parameters\nMethodologies and\n...............................................................................................8\nDesign Ideas........................................................................................ 9\nDesign Description.............................................................................. 13\nResults............................................................................................... 16\nAppendix.............................................................................................19\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nSummary\nPROBLEM STATEMENT\nDesign a cook stove that viably uses pine needles as an alternative fuel source for\nthe AVANI community in Uttarakand, India; it must be as easy and efficient to use as their\ncurrent cook stoves, involving minimal preprocessing of the needles.\nDESIGN SPECIFICATIONS\nThe main design parameters we wanted our stove to concentrate on were\ndurability, locally available materials, low cost, health and fire safety, control of heat for\ncooking, ease of use, efficiency, and pine needle processing. The design specifications\nthat were most important was that the CO and particulate matter emissions could not\nexceed 10 ppm (50 ppm being the standard level of health hazard) and 0.150 mg/ m3 ,\nrespectively, and needs to compete against 30-50% efficient wood stoves.\nPRIOR WORK\nResearch was conducted into different types of stove designs (wood, charcoal, and\nbrick) that could potentially be modified into stoves capable of using pine needles as the\nprimary fuel source. Portable and permanent structure stoves were looked at. Of the\nstoves, the Anila gasification and Rocket Stoves were two of the more applicable stove\ndesigns to our design work. These two stoves became testing prototypes and points of\ncomparison throughout our design process.\nCONCEPT EVALUATION\nThe three major factors of a successful stove design guided our design process\nwhen trying to find the optimal way to tame the unruly nature of the pine needle burn; fuel,\ntemperature, and air. We explored burning pine needles as a primary fuel in different\nforms- loose, compact, and \"log\" forms- with varying airflows. We also considered the\nuse of pine needles as a secondary fuel, gasifying them to prolong the burn of a primary\nfuel. As we wanted to find a way to use pine needles as a sole alternative fuel without\nundergoing further processing, we pursued designs utilizing the pine needle as a primary\nfuel, meanwhile seeking to harness the volumes of fuel gas emitted to increase the\nefficiency of the burn. We used a fireplace and current charcoal stoves, and built\nprototypes of gasifiers and feed-mechanism-stoves, before focusing on the our final spiral\ndesign.\nPROPOSED SOLUTION\nThis stove design facilitates two burn stages--a primary burn in a firebox, and a\nsecondary burn within a spiral. For the primary burn, unprocessed pine needles are\ncompressed and fed into an insulated firebox. Strategically placed air inlets allow proper\nairflow. As the pine needles burn, gasification occurs. The flames and gases then travel\nupwards, entering the spiral via a central hole. The draft from the chimney pulls the\ngases around the spiral, and because the firebox heats the spiral from underneath, the\ngases ignite and a secondary burn ensues. The feeding system allows for a steady\nprimary burn, while the spiral's elongated burn path harnesses energy that is normally lost\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nto gasification.\nFrom current testing, the stove was determined to have an average efficiency of\n23.75% during three cold starts with a maximum efficiency of 28.61%, and an average\nefficiency of 22.49% during three hot starts with a maximum efficiency of 24.90%. The\ntime it took to boil 5L water ranged from 16-22 minutes, with an average of 20:08 minutes.\nFUTURE WORK\nNow that an effective burn method has been established, further work to be done\non the stove includes optimizing the parameters at which the pine needles burn best in\nboth the firebox and spiral. The parameters to be adjusted and tested for the spiral\ninclude its length, alignment, path width and height from the top of the firebox. The\nparameters to be adjusted and tested for the firebox include its size and shape, and that\nfor the shoot include its length and opening size. Even though our cost analysis revealed\nonly $0.85 above our original price, it would be valuable to lessen the amount of metal\nused in the design. As of now, there is excess metal as it is, with parts that could be\nmade with a cheaper material. Once these parameters have been optimized this stove\nwill be ready to be tested in the field.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nPrior Work\nWhen we first began our research into using pine needles as a stove fuel, not many\nresearch or articles turned up. Pine needles had never really been tried successfully as a\nfuel source except in the form of charcoal briquettes. Therefore, in order to generate\nideas for our stove design we researched current stove designs for developing countries\nto see if there were any current wood or charcoal stoves (in addition to existing pine\nneedle fuel models) that could potentially be modified to burn pine needles.\nPortable Stove Designs\nOne of our team members was a part of the Dlab Peru team last semester, and\nsince they had already done some research on portable improved cookstove design, we\ndecided to start our search there. Two of the main types of stoves they worked with were\na clay pot skirt/stand type of design, which involved making a clay combustion chamber\nwhich allowed for a pot to sit on top of it, the fuel is then put in at the bottom of the clay\npot and lit, and the clay holder creates a combustion chamber that forces the heat upward\nto the pot, and the other design the team worked with was making an L-shaped\ncombustion chamber out of bricks that are either stacked together or held together by an\nexterior container or adhesive. Both of these got good reception in the Amazonian\ncommunity the Peru team was working with over IAP, and could be used for any form of\npine needle fuel our team might develop. The clay and brick combustion chambers are\nshown below.\nFigure: Clay Pot Skirt Shown on the Left, Brick Combustion Chamber on Right\nThe Nixtamalera stove, created by the Reinhardt Foundation, is a pot that uses an\nL-shaped combustion chamber, but instead of needing a certain size pot, they fix this\nchamber inside of a mixture of cement and gravel and surround it with an aluminum pot\nskirt so that as the bricks get hot all of these conduct heat from it to creating a one size\nfits all stove, for any shape pot.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nAnother stove design researched was the Anila gasifier stove. This stove model\ncharcoalizes biomass such as pine needles through means of gasification of the particles\nas explained by the model shown below. We really liked this stove design and decided to\ntest a stove model like this ourselves, the results of which are discussed in a later section.\nFigure: Combustion Process for the Anila Stove\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nCourtesy of HELPS International, http://www.helpsintl.org. Used with permission.\nFigure: The Nixtamalera Stove\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nThe other main portable stove design we researched was the Rocket Stove. This stove\ndesign is an L-shape combustion chamber design with insulating material that is most\nnotable for it's high efficiencies (around 55%). A schematic of this stove design is shown\nbelow.\nFigure: Diagram of the Rocket Stove Combustion Process.\n\nPermanent Stove Designs\nWe also looked into more permanent structure stoves for this project. We first looked at\nantique wood burning stoves, like those used in the 18th/19th/early 20th centuries in the\nUS, as well as similar designs that have been created by the Reinhardt Foundation such\nas the Olin Stove. The Olin design is interesting in that it elongates the burn path for the\nwood smoke. Both designs incorporate a chimney system, which is very effective in\nreducing indoor air pollution for the community, and could be used indoors or outdoors\ndepending on where the food is normally prepared within the community.\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/fairuse.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nCourtesy of Maya Relief Foundation. Used with permission.\nPhoto courtesy of btmspox on Flickr.\nFigure: Left: An antique wood stove. Right: The Onila woodburning stove\nAnother design, that is currently being used in more southern India involves a more\nadobe/mud/clay stove, that is a permanent structure attachment to the home. Fuel is lit at\none end of it, but the stove has multiple pot points so that you can cook directly over the\nflame, but keep things warm or simmering right off the flame as the heated smoke makes\nits way to the chimney.\nFigure: Southern Indian Mud Stove\nDESIGN PARAMETERS\n-\nDesigns for sustainability\no Pine needles are a renewable energy source\no Alternative to wood, which is a diminishing fuel\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\no Fuel comes from \"waste\" that is harmful to the environment\no Ability to change the ecosystem positively, by improving environment\n-\nDesign for affordability\no Materials currently costs $15.85\no Used a lot of metal, which is readily availability and is a specialized labor\nskill in the area\no Simple design that minimizes volume and variation of material\no Tools that were used were very simple: welding and hacksaw, die forming\n-\nDesign for failure\no Does not have to be optimal conditions to function- allows for tolerance\no (Warping is a problem)\no Easy to replace and repair\n-\nThe design is highly modular- you can replace just the parts that\nrequired\n-\nDesign for human use\no Focused highly on minimizing the amount of attention required to keep the\nstove burning- compressed pine needles that needed to be inched in every\n4 minutes. Shoot needed refilling after 10 minutes\no Very quick start\no Chimney ensured very low CO and particulate matter results\no The air inlets allowed the user to easily monitor the fire without having to\nlook at spiral\no Added an ash drawer to easily remove ashes from the firebox\n-\nDesign for manufacturability\no Used simple manufacturing processes: welding, hack sawing, dire forming\no Community highly skilled in metal work that is required for the\nmanufacturing for the stove.\no Future step will include finding insulating materials more available to the\ncommunity\n-\nDesign for assembly\no Modular- requires simply bolts and welding to assemble\no Currently, the stove can be used independently, however, in the future, if the\nstove is incorporated into the design of the house, certain materials required\nto hold the stove together could be eliminated if the stove was built in to the\nclay structure that is often seen in wood stoves.\nDESIGN IDEAS\nThe main design parameters we wanted our stove to concentrate on were durability,\nlocally available materials, low cost, health and fire safety, control of heat for cooking,\nease of use, efficiency, and pine needle processing. The design specifications that were\nmost important was that the CO and particulate matter emissions could not exceed 10\nppm (50 ppm being the standard level of health hazard) and 0.150 mg/ m3 , respectively,\nand needs to compete against 30-50% efficient wood stoves.\nWe first began our design process by exploring the burn properties of pine needles;\nfamiliarizing ourselves with the fuel we wanted to manipulate for our stove. We spent\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\ntime discovering the characteristic behavior of pine needles and found that they burned\nvery differently depending on the conditions. In the controlled environment of a fireplace,\nwe burnt handfuls of tangled pine needles, pine needle \"logs\" tied together with string,\npacked pine needles in a pipe, chopped pine needles on a mesh grate, with varying\nairflow and volume. We found that the fire stays located (i.e. does not spread across the\nvolume of the pine needles), especially with higher density, compact, volumes. The\nhigher density the pine needles were burnt in, the more concentrated airflow was required\nto maintain the fire. The pine needles released a lot of gas in all cases, especially as the\nfire died and began smoldering. The pine needles caught fire quickly, but also lost its\nheat very rapidly (we were able to touch the ashes with our hands soon after the fire had\nextinguished without getting burnt). The fire needed to be tended to continuously, and for\nthe loose pine needles, constant feeding was required. In many ways we could draw\nanalogies with liquid burners, concerning the continuous fuel feed and air source meeting\nto create a burn.\nThereafter, we began the process of designing the stove that would successfully tame the\nwild nature of the pine needle burn and allow someone to practically use it for cooking.\nWe discussed whether to place it inside or outside, and understood from our community\npartner that the most common place for cooking was inside, especially due to the cold\nclimate it Uttakarand in the winter months. Keeping the design parameters mentioned in\nthe introduction in mind, we brainstormed how to best apply the major three factors of a\nsuccessful stove design to pine needles.\nFor fuel, we needed to determine the best form that the pine needles should be burnt,\ngiven our initial exploration of pine needle burn characteristics. Higher density meant a\nlonger burn, more control, and less fuss but required more air, whereas loose pine\nneedles needed less air but constant attention and feeding. Furthermore, we heavily\ndiscussed whether to use pine needles as a primary fuel source and/or as a secondary\nfuel source (i.e using the gas of the pine needles to sustain a burn created by another\nfuel). We essentially pursued four major different design ideas before we narrowed (or\nrather accidentally stumbled upon) our final design concept: using a normal charcoal\nstove with loose needles, \"logs\", a feeder, and a gasifier.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nLoose needles\nWe wanted to verify any possibility of using completely\nunprocessed needles with existing charcoal stoves\nand found quickly this was not a practical or viable\noption as the pine needles burnt uncontrollably,\nsmoked greatly, and required constant attention.\nBelow is a picture of one of the tests executed.\nLog stove\nSimilarly, we wanted to test for same concept of\nusing existing stove technologies and simulating a\nwooden log with the pine needles by aligning the\npine needles and wrapping them with string. If the\nlogs were placed in a TP, the would burn better\nbecause there was more air that could flow through,\nhowever, in general it was difficult to maintain the\nfire. We also wanted to shy away from having to\nprocess the pine needles into log forms.\nFeed stove\nWe built a stove that fed unprocessed, loose pine needles into\na shoot and burn\nthem in a more\ncontrolled manner\nthan the first design\nidea. Pine needles\nwould have to be\nconstantly fed, and\nrealized that the\nmanual feeder would\nhave to be\nautomated if we\nwere to pursue this\nidea, which would\nadd another dimension of complexity and cost.\nDue to the angled shoot, smoke would escape\nfrom the shoot and begin burning the supply along the tube. Even with a short chimney,\nthere was not enough controlled airflow, and the gas released by the pine needles, was\ninefficiently being unused and escaped.\nGasifier\nFinally we pursued the idea of using pine needles as a secondary fuel source in\ngasification. This spun from two sources: old technology of tile stoves, very popular in\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nScandinavia, and existing biomass gasifiers in the field. Tile stoves use channels that\nmaintain the gas released by burning fuel inside the system, which efficiently uses the\ngas released also a secondary fuel and retains the high temperature inside the stove\nbefore it is released. These stoves are able to use minimal fuel to heat up rooms and\nburn for a long time.\nCourtesy of victorious felines on Flickr.\nWe prototyped the Anila gasifier stove in order to get a better\nunderstanding of pine needles' role as a secondary fuel. The main\nconcept consisted of a primary fuel source created by wood,\nsurrounded by a chamber of biomass (pine needles) that would begin\nto gasify at high temperatures and continuously reignite/feed the\nprimary burn. This saved fuel and would yield high temperatures.\nAlthough this was a first pass at replicating the stove, we found some\nfundamental design flaws that stimulated our creativity and pushed us\ntowards our final concept. Firstly, it would take too long of a time for\nthe pine needles to begin gasifying and the stove was therefore an\ninefficient version of a woodstove for the largest part of the burn time.\nMoreover, the stove worked on a batch system, in that the stove\nneeded to be loaded once before its use (by flipping it over, removing\nthe base, and filling it with pine needles as seen by the left picture),\nand then would have to wait until the end of its use and for it to cool,\nbefore you could remove the biomass and reload.\n\nSpiral Pine Needle Stove\nMIT D-Lab Design Spring 2010\nWe wanted therefore to tackle the problem of 1) decreasing\nthe amount of time for it to gasify and 2) being able to feed\npine needles during stove use.\nIn response to 1), we wanted to place the primary fuel\nunderneath the biomass and then have a spiral structure\n(horizontal channel system) that would spread the fire\nunderneath the entire bottom surface area of pine needles,\nand retain the heat in the system, like the tile stoves.\nWith that, we began thinking about removing the secondary\nchamber and simply keeping the firebox and the\nspiral on top, but using the pine needle as a\nprimary fuel source and a secondary fuel source.\nThe spiral would allow for the latter to occur, by\nelongating the burn path and creating a\nhorizontal channel. The pine needles needed to\nbe compacted to control the burn, but there was\nno pre-processing required.\nWe tested the idea and found that it clicked; it\nworked considerably better than all of our prior\nidea pursuits, required no processing, controlled\nthe fire, incorporated a chimney into the design (a\nrequirement we decided for), and used the\nprinciples of fuel vs. airflow, retained temperature, and gasification. We therefore decided\nto continue exploring this one and refine the air inlets and dimensions. The first rough\nprototype that convinced us is shown below.\nDESIGN DESCRIPTION\nFirebox\nCritical to any good fire is the right balance\nof air, fuel, and temperature. The firebox\nprovides a space where these three\nparameters can be adjusted to optimize the\nenvironmental conditions, thus facilitating a\nstrong, primary burn. A steady source of\ncompacted fuel enters the firebox via the\nfuel shoot; air flows into the firebox via\nFigure 1. Schematic of a stove burn.\nadjustable air inlets, drawn by a chimney\ninduced draft; and insulated walls keep the temperatures high within the firebox. After the\nclass embodied energy exercise, we felt it was important to insulate the chamber as much\nas possible. Consequently, the firebox is made out of firebricks, held together by\nthreaded rod and nuts.\n\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nSpiral\nDuring the primary burn, a great deal of\ngasification occurs. The gases released\nby the fire get pulled up into and around\nthe spiral, due to the draft from the\nchimney. In Figure 2a, one can see the\ncentral hole through which the flames\nand gases enter the spiral, and the\nchimney exit at the end of the spiral.\nSince the spiral is heated from the\nfirebox below, the gases ignite and a\nsecondary burn occurs. The flames\nextinguish before they reach the end of\nthe spiral, once all the gases are burned up. This results in a clean burn with heat\ngenerated directly beneath the cook pot. The motivations behind this spiral design were\nto (1) elongate the burn path, (2) reheat the gases enough to cause a secondary burn,\nand (3) distribute heat evenly under the cook pot.\nChimney\nA chimney is critical to this design, and generally speaking, chimneys play a significant\nrole in reducing indoor air pollution from fire smoke. From the beginning, we wanted to\nincorporate a chimney for its health benefits. In this design, the chimney creates a strong\ndraft that draws air into the firebox via the air inlets, and then up and around the spiral.\nWithout the draw from the chimney, this system would not work. Currently, an acceptable\nchimney size for this stove is 4 inches in diameter, 9 to 12 feet in length.\nAir Inlets\nGood airflow depends on both the chimney and the air inlets;\nhowever, it is much easier to manipulate air inlets than a\nchimney. This stove has four air inlets placed around the\nfirebox, allowing the user to adjust the airflow to optimize\nconditions. Depending on the outside ambient conditions (the\namount of wind, humidity, etc), and depending on the state\ninside the firebox (the temperature, the amount of fuel, if the\nfuel has turned into charcoal, etc), the fire requires different\namounts of air, and sometimes air from different directions. The\nmultiple inlets give the user control over the fire. Additionally,\nthe air inlets serve as viewing portals into the firebox, allowing\nthe user to monitor the primary burn. The ability to view into the\nfirebox is very important in running the stove, because it\nprovides visual queues for when the fire needs more fuel or air,\nor if ashes need to be cleared out.\nFigure 4. The hand in this photo is\npointing at an air inlet. Below that is the\nash tray.\nFigure 2a. Top view of the spiral component.\nFigure 2b. Flames of the secondary burn traveling around the spiral.\n\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nFuel Shoot\nPine needles are plunged into the firebox via the fuel shoot, with no preprocessing steps\nrequired. We found that for our purposes, pine needles burn best when compacted\ntogether--the burn relatively hot and controlled, so long as an adequate air supply is\navailable. This plunging system allows the user to compact the needles appropriately into\nin the firebox. Furthermore, it allows the user to safely and easily add fuel without\ndisturbing the burn and without releasing smoke or ashes into the room.\nAsh Tray\nAs pine needles burn in the firebox, charcoal develops and eventually ashes form. The\nuser needs to be able to clear out the firebox to make room for new fuel; if we consider\nthe case in which the stove is run for several hours on end, one needs to be able to\nperform this clearing out process even when the stove is still running. Consequently, we\ndesigned an agitating floor into the firebox and placed an ash tray below it, so that the\nuser can easily clear out the debris from the firebox as necessary. Additionally, the ash\ntray serves as an extra air inlet, allowing bottom-to-top airflow if ash drawer is left ajar.\nFigure 5. Plunging pine needles into the fuel shoot.\n\nMETHODOLOGIES AND RESULTS OF TESTS\nFirst Spiral Prototype\nAs we narrowed our design concept to a firebox with the spiral directly on top of it, we\nmade a quick first prototype of this and used the method of stuffing the square of bricks\nunderneath it with fire and lighting it. From this we were able to boil four cups of water\nin 13 minutes. Although this result seemed promising, we realized that an easier method\nof feed the pine needles was needed for both safety purposes and ease of usability. We\nalso realized that much of the flame that traveled around the spiral made its way into the\nchimney, thus making the chimney very hot, and this was problematic for two reasons.\nThe first is in regards to safety--a hot chimney is not a great surface to be exposed to the\nuser, and the second is that most of the heat is not concentrated where the pot would be\nplaced. For this reason we elongated the spiral length for our next prototype.\nSecond Spiral Prototype\nOur second spiral prototype consisted on an enclosed firebox made of firebrick, a long\nshoot extended at one end, and the elongated spiral configuration located on top of the\nfirebox with a chimney extended from the back in an L-shape. The height of the spiral\nwas lowered by a few inches in this design so as to minimize the gap between the firebox\nand the pot. The firebox was also sealed more properly with a caulking gun at the cracks\nso that smoke could not easily escape. We initially tested this with a grate located\nunderneath the area in which the pine needles would be pushed in, but to much dismay,\nfound that this was of no help. From this, we decided to stick with a solid metal floor, and\neventually moved into a floor that could be opened and closed for air circulation from\nunderneath.\nAfter running this stove a few times, there were a few problems that arose that led us our\nfinal prototype design. The first problem was that when the pine needles were pushed\npast the center spiral hole in the firebox, the fire would go out, as the center spiral hole\nwas clogged with pine needles--the air had no way of getting through, which is what was\nkeeping the fire aflame. Because of this, we added a small metal lip to the side of the\nspiral to keep the pine needles from directly clogging the hole, yet still allowing room for\nthe pine needles to move into the firebox, creating a slightly slanted wall of fire. With the\nFigure 6. Front view of the stove.\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nfirebox being completely sealed off, it was difficult to access it and to evaluate what was\nhappening with the burnt pine needles. The ashes of charcoal were thus cluttering the\nfirebox, as the air inlet did not serve as ash and charcoal outlets. Because of this, we\ndesigned our third prototype to be modular. We shaped and fit the bricks closely together\nso that caulking was not necessary to keep the heat and smoke inside the firebox. We\nthus used long screws on the outside of the firebox to hold together the (now slightly\nwarped) metal spiral and the firebox, and added a metal drawer to the bottom of the\nfirebox to allow for easy removal of the ashes and charcoal.\nThird Spiral Prototype\nBefore any quantitative testing was done, we first dealt with the ease of usability issues\nand smoke emissions issues through practice of running the stove and observing its\nbehavior throughout the process. Through this method of testing our first two prototypes,\nwe were able to refine our third prototype (given the time allowed), to have a smaller\nfeeding shoot than the second, as we realized it was not necessary to have a four-foot\nlong shoot full of pine needles, to have another air inlet was added opposite the direction\nin which the pine needles were being fed so as to better keep the flame going when\nneeded, and to have an insulating layer (made of fiberfrax, then firebrick) on the outside\nof the outermost spiral so as to minimize heat loss, in addition to the other changes\nmentioned above.\nIt was with this third prototype that we did our most extensive quantitative testing. We\nbegan by performing a water boiling test, from both a cold and hot start, through which\nthe stove's efficiency could also be calculated. We calculated the average efficiency of\nthree cold starts to be 23.75%, with the highest efficiency to be 28.61%, and the average\nefficiency of three hot starts to be 22.49%, with the highest efficiency to be 24.90%.\nDuring this test, we also used three to four thermocouples, located at various places of\nthe stove, in order to track the temperature profile at these locations during use. These\nlocations include the end of the spiral, the center of the spiral, the base of the chimney,\nthe center of the firebox, and the pot of water to be boiled. From these tests, we\ndiscovered that the temperature inside the chimney was lower than that at the center of\nthe spiral, which was thus an improvement from our first spiral prototype--the elongated\nspiral path worked. We also discovered that the time it takes to boil 5L of water ranges\nfrom 16-22 minutes, with an average of 20:08 minutes. This range of boiling times was\nmainly dependent on the atmospheric conditions (i.e. wind, air temperature, etc.) of when\nthe test was taken.\n\n!\"#$%&'()'\n*+'%,(--%.-+$%/01\n234+%'\"%5\"3#%\n677383+98:\n!\n\"#$\n$!%&'\n;<=>?@\n$\n()&\n$!%*(\n?A=BA@\n&\n*#)\n$!%&'\n;B=;?@\nC\"'%&'()'\n*+'%,(--%.-+$%/01\n234+%'\"%5\"3#%\n677383+98:\n!\n*+#\n!+%#)\n;;=DE@\n$\n*+(\n$)%&+%''\n;F=AD@\n&\n*\"#\n!(%''\n;D=EB@\nG39+%*++$#+%&'\"H+\n6IIJ!J6*!K%LM2M\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nIn addition to the water boiling test we performed a carbon monoxide (CO) emissions test,\nas well as a particulate test with a dust tracker. When running for thirty minutes, the CO\nemissions test revealed that the average value of CO was 2.96 ppm (parts per million),\nwhich was very good for a first test, considering that the standard level for being a health\nhazard is 50 ppm. When there was no cover on the spiral, the pure burning flame\nresulted in an average CO emission of 15.6ppm. The particulate test revealed the\naverage value to be 0.251 mg/m3, with three outliers that reach above 1.000 mg/m3. Not\nconsidering the outlying values, the average particulate test gave a measure of 0.148 mg/\nm3, which is under the 24 hour standards required for particulate matter; 0.150 mg/ m3.\nHowever it did go above during certain peaks (the outliers). These peaks of particulate\nemission coincided with the plunging of the pine needles into the firebox, and since then,\nwe have learned to steadily push the needles in, rather than plunging them in with a lot of\nforce at one time.\nFrom these tests, we hope to continue to lower the value of the time it takes to lower\nwater, as well as the CO and particulate emissions values. This will be done by\ncontinuing to optimize the shape and parameters of the firebox, spiral length and height,\nchimney height and diameter, and the feeding shoot.\nREFERENCES\nRajnish Jain (Avani NGO, India)\nBen Linder\nJic Davis\nBrydem, et al. \"Design Principles for Wood Burning Cook stoves,\" Aprovecho Research Center, Shell\nFoundation, Partnership for Clean Indoor Air\n\"Particulate Matter\", U.S. Environmental Protection Agency. Last updated April 16, 2010.\n\nAPPEN\nChimney\nFirebox\nCenter of spiral\nWater\nTime\nWater\n9.9\n9.8\n234.4\n595.9\n7.26\n282.2\n712.2\n352.6\n355.1\n748.8\n320.7\n529.1\n20.5\n324.9\n530.1\n690.1\n21.5\nTest 1: Cold Start - 4/29/2010 (Thursday evening)\n* added more needles at 11 minutes\n!\"\"\n#\"\"\n$\"\"\n%\"\"\n&\"\"\n'\"\"\n\"#$\"%&'(%\")*+,-\n!\".')/0),123)4'&%'\n()*+,-.\n/*0-123\n(-,4-0 26 78*09:\n\"\n;\"\"\n<\"\"\n!\"\"\n#\"\"\n$\"\"\n%\"\"\n&\"\"\n'\"\"\n\"\n<\n&\n;<\n;&\n;=\n<\">$\n<;>$\n!\"#$\"%&'(%\")*+,-\n!5#\")*#56-\n!\".')/0),123)4'&%'\n()*+,-.\n/*0-123\n(-,4-0526578*09:\n?94-0\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nDIX: Charts and Graphs of Efficiency and Temperature Tests\n\nTest 2: Cold Start - 5/1/2010 (Saturday morning)\nChimney\nCenter\nSpiral\nFirebox Center\nPot of\nTime\nWater\n11:10am\n11:12\n752.5\n392.3\n497.6\n11:15\n282.8\n642.8\n475.4\n450.2\n11:20\n460.9\n648.3\n682.8\n525.4\n11:25\n371.1\n654.7\n444.6\n557.2\n11:30\n336.4\n709.2\n504.3\n605.3\n11:32\n21:56\n225.4\n679.6\n559.8\n635.8\nTest 2: Hot Start 1 - 5/1/2010 (Saturday morning)\nChimney\nCenter\nSpiral\nFirebox Center\nPot of\nTi\nTim\nmee\nWa\nWatteerr\n11:56am\n57.7\n94.5\n56.1\n68.0\n11:58\n291.3\n616.7\n579.3\n655.3\n12:01\n366.2\n699.3\n484.8\n759.4\n12:06\n417.4\n747.1\n447.7\n759.2\n12:08\n402.1\n755.2\n495.9\n748.1\n12:10\n362.9\n677.3\n557.9\n729.7\n12:12\n358.4\n601.6\n430.3\n718.3\n12:14\n351.2\n756.3\n406.3\n672.0\n12:15\n19:47\n325.1\n703.2\n398.4\n565.8\n!\n\"!!\n#!!\n$!!\n%!!\n&!!\n'!!\n(!!\n)!!\n!\n#\n&\n\"!\n\"&\n#!\n#\"*&'\n!\"#$\"%&'(%\")*+,-\n!.#\")*#./-\n!\"0')12),345)6'&%'\n+,-./01\n23-456\n+0/70489:823-456\n;-40<9=8+0/704\n>5704\n!\n\"!!\n#!!\n$!!\n%!!\n&!!\n'!!\n(!!\n)!!\n!\n#\n&\n\"!\n\"&\n#!\n#\"*&'\n!\"#$\"%&'(%\")*+,-\n!.#\")*#./-\n!\"0')12),345)6'&%'\n+,-./01\n23-456\n+0/70489:823-456\n;-40<9=8+0/704\n>5704\n!\n\"!!\n#!!\n$!!\n%!!\n&!!\n'!!\n(!!\n)!!\n!\n#\n&\n\"!\n\"#\n\"%\n\"'\n\")\n\"?*%(\n!\"#$\"%&'(%\")*+,-\n!.#\")*#./-\n!\"0')12)73')6'&%')8\n+,-./01\n+0/704\n23-456\n;-40<9=8+0/704\n>5704\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\nTest 2: Hot Start 2 - 5/1/2010 (Saturday morning)\nChimney\nCenter\nSpiral\nFirebox Center\nPot of\nTime\nWater\n12:37\n62.5\n129.7\n55.5\n117.3\n12:39\n407.8\n589.2\n420.4\n563.2\n12:41\n272.8\n683.2\n380.1\n658.4\n12:43\n281.9\n704.8\n420.9\n745.2\n12:45\n301.8\n740.1\n440.4\n732.8\n12:47\n319.3\n751.3\n450.8\n702.1\n12:49\n326.6\n689.6\n481.9\n558.2\n12:51\n305.4\n579.2\n472.7\n407.2\n12:53\n304.1\n449.9\n454.1\n634.9\n12:55\n296.4\n599.3\n465.8\n598.0\n12:57\n273.1\n632.1\n418.7\n447.2\n12:59\n255.5\n595.0\n367.2\n551.4\n1:01\n254.3\n691.9\n362.3\n643.9\n1:03\n266.2\n769.8\n396.8\n743.8\n1:04\n27.65\n281.2\n753.2\n402.8\n722.2\n!\"\"\n#\"\"\n$\"\"\n%\"\"\n&\"\"\n'\"\"\n(\"\"\n)\"\"\n*\"\"\n!\"#$\"%&'(%\")*+,-\n!\".')/0)12')3'&%')/\n+,-./01\n+0/203\n45-367\n8-309:;<+0/203\n\"\n!\"\"\n#\"\"\n$\"\"\n%\"\"\n&\"\"\n'\"\"\n(\"\"\n)\"\"\n*\"\"\n\"\n#\n%\n'\n)\n!\"\n!#\n!%\n!'\n!)\n#\"\n##\n#%\n#'\n#(='&\n!\"#$\"%&'(%\")*+,-\n!4#\")*#45-\n!\".')/0)12')3'&%')/\n+,-./01\n+0/203\n45-367\n8-309:;<+0/203\n>6203\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\nTest 3: Cold Start - 5/3/2010 (Monday morning)\nFirebox\ninner spiral outside spiral\nChimney\nPot of\nTime\nWater\n21.5\n21.6\n21.7\n21.3\n616.0\n707.9\n296.7\n197.7\n700.0\n747.8\n404.7\n319.3\n577.9\n708.3\n383.7\n314.9\n386.6\n728.4\n448.6\n364.7\n500.1\n680.9\n397.3\n361.3\n621.3\n731.5\n398.7\n363.4\n21.5\n658.2\n737.1\n492.2\n375.0\nTe\nTesstt 33:: HHoott SSttaarrtt -- 55//33//22001100 ((M\nMoonnddaayy m\nmoorrnniinngg))\nFirebox\ninner spiral outside spiral\nChimney\nPot of\nTime\nWater\n195.4\n141.7\n99.3\n78.1\n657.9\n746.1\n411.2\n332.4\n751.8\n724.4\n443.3\n358.0\n755.2\n740.3\n561.7\n455.7\n699.1\n734.2\n558.8\n404.7\n640.2\n742.9\n477.6\n393.0\n689.0\n699.1\n447.5\n397.6\n!\"!\n#!!\"!\n$!!\"!\n%!!\"!\n&!!\"!\n'!!\"!\n(!!\"!\n)!!\"!\n*!!\"!\n!\n$\n)\n#$\n#)\n$!\n$#\n$#\"'\n!\"#$\"%&'(%\")*+,-\n!.#\")*#./-\n!\"0')12),345)6'&%'\n+,-./01\n233.-456,-78\n9:;<,=.456,-78\n>?,@3.A\nB7;.-\n!\"!\n#!!\"!\n$!!\"!\n%!!\"!\n&!!\"!\n'!!\"!\n(!!\"!\n)!!\"!\n*!!\"!\n!\n$\n)\n#$\n#)\n$!\n$#\n$#\"'\n!\"#$\"%&'(%\")*+,-\n!.#\")*#./-\n!\"0')12),345)6'&%'\n+,-./01\n233.-456,-78\n9:;<,=.456,-78\n>?,@3.A\nB7;.-\n!\"!\n#!!\"!\n$!!\"!\n%!!\"!\n&!!\"!\n'!!\"!\n(!!\"!\n)!!\"!\n*!!\"!\n!\n$\n)\n#$\n#&\n#'\n#(\n!\"#$\"%&'(%\")*+,)-\n!.#\")*#./-\n!\"0')12)73')6'&%'\n+,-./01\n233.-456,-78\n9:;<,=.456,-78\n>?,@3.A\nB7;.-\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\nTime\nCO\n(ppm)\nDT\n(mg/m3)\nO2 (%)\n20.9\n20.9\n2.96428571\n0.251\n!\n\"\n#\n$\n%\n&\n'\n(\n)\n!\n%\n'\n*\n\"\"\n\"$\n\"&\n\"(\n\"*\n#\"\n#$\n#&\n#(\n#*\n!\"#$%%&'\n()&*#$&)+'\n!\n\"\n#\n$\n%\n&\n'\n(\n)\n!\n%\n'\n*\n\"\"\n\"$\n\"&\n\"(\n\"*\n#\"\n#$\n#&\n#(\n#*\n!\"#$%%&'\n()&*#$&)+'\n0.113\n0.309\n0.254\n0.167\n0.143\n1.100\n0.168\n0.126\n0.105\n0.139\n0.176\n0.218\n0.198\n0.191\n0.150\n0.157\n0.124\n0.097\n0.011\n0.102\n0.097\n0.117\n1.000\n1.210\n0.126\n0 213\n!+%!!\n!+'!!\n!+)!!\n\"+!!!\n\"+#!!\n\"+%!!\n,-./)012-/*#$&34&5'\n!+!!!\n!+#!!\n!+%!!\n!+'!!\n!+)!!\n\"+!!!\n\"+#!!\n\"+%!!\n!\n%\n'\n*\n\"\"\n\"$\n\"&\n\"(\n\"*\n#\"\n#$\n#&\n#(\n#*\n,-./)012-/*#$&34&5'\n()&*#$&)+'\n0.213\n0.109\n0.097\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\nDust Tracker Data - 5/3/10 (Monday morning)\n\n!\"#$%&'()'%*\n!\"#\"$%#%\n&'()*+,-.-/)0).1\n234-5+63'5'*7+,3'*0\n8! 9:\n:;\n<=#>! ?@\"?7\n$$A% ?@\"?7\n,B+C*).7D+:3*0)*0\n#>%%% ?@\"?7\n:3*E'0'3*1\nF'.+G)/;\n$! 9:\nHI01'E)+\nJ-./+KI0+L'*ED\n+,,-!-+.!/%$('(\n,'*)+B))E5)1\nM-11+N1)E\n#%$O 7\nM-11+:P-.43-5+2)Q0\nR!< 7\n.+'%0(&&%1&+$\n234 5\nJ-0).\nS0-.0+M-11\n<8#< 7\nC*E+M-11\n<A$# 7\nM-11+C(-;3.=\n$8R 7\nS0-.0+G)/;\n#R 9:\nC*E+G)/;\n8! 9:\n:P-*7)+'*+G)/;\n>$ 9:\n'678%9:%;:6<\n*=%76>%?2%@8A\nCQQ'4')*4')1\nC'*\n#$##< ?@\nC3I0\n$R<>=!$ ?@\n+BB6A68>AC\n=DE4DF\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\n!\"#$%&'()'%*\n!\"#$%#$&'&\n()*+,!-./.0+1+/2\n345.6!74)6),8!-4),1\n%9 :;\n;<\n\"='>9 ?@#?8\n$$A& ?@#?8\n-B!C,+/8D!;4,1+,1\n'>&&& ?@#?8\n;4,E)1)4,2\nF)/!G+0<\n'' :;\nHI12)E+\nR+/D!546E!.,E!\n26)8L16D!S),ED\n,DDE!E,+!F%$('(\n-),+!B++E6+2\nJ.22!K2+E\n'&A& 8\nJ.22!;L./54.6!3+M1\n$'> 8\n+,'%-(&&%.&,$\n/01 2\nN.1+/\nO1./1!J.22\n\"P9> 8\nC,E!J.22\nQ9>> 8\nJ.22!C*.<4/=\n''P& 8\nO1./1!G+0<\n'& :;\nC,E!G+0<\n%9 :;\n;L.,8+!),!G+0<\n>9 :;\n'345%67%8739\n1*43:%;<=5>\nCMM)5)+,5)+2\nC),\n'9'9A ?@\nC4I1\n\"QQA=P\" ?@\n,??3>35:>@\n1/AB*C\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\n!\"#$%&'()(*$+$),\n-./(0&1.\"0\"%2&'.\"%+\n34 56\n89:;4 <=><2\n-\n??@A <=><2\n'B&C%$)2D&6.%+$%+\n:;AAA <=><2\n6.%E\"+\".%,\nF\")&G$*7\n?4 56\nHI+,\"E$&\nRI*\"ES&T()*S&\n%.&T\"%E\n,BBC!C,+!D%$('(\n'\"%$&B$$E0$,\nJ(,,&K,$E\n;A: 2\nJ(,,&6L()/.(0&-$M+\n?48 2\n+,'%-(&&%.&,$\n/01 2\nN(+$)\nO+()+&J(,,\n4AP; 2\nC%E&J(,,\n8Q@8 2\nJ(,,&C#(7.)9\n?Q8 2\nO+()+&G$*7\n:@ 56\nC%E&G$*7\n34 56\n6L(%2$&\"%&G$*7\nQ3 56\n'345%67%8739\n:;</ 43=\nCMM\"/\"$%/\"$,\nC\"%\n3;8@ <=\nC.I+\n??;89;; <=\n,>>3?35=?@\n:*<:;A\n&&\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n!\"#$%&'()'%*\n\n!\"#$%#&'#$(\n!\"#\"$%#%\n&'()*+,-.-/)0).1\n234-5+63'5'*7+,3'*0\n8! 9:\n:;\n<=#>! ?@\"?7\n$$A% ?@\"?7\n,B+C*).7D+:3*0)*0\n#>%%% ?@\"?7\n:3*E'0'3*1\nF'.+G)/;\n$! 9:\nHI01'E)\nJ-./+KI0+L'*ED\n)**+,+)-,.$/&#&\n,'*)+B))E5)1\nM-11+N1)E\n8!8 7\nM-11+:O-.43-5+2)P0\nQAQ 7\n-)#$0&%%$1%)/\n234 5\nJ-0).\nR0-.0+M-11\n!%AA 7\nC*E+M-11\n<A$! 7\nM-11+C(-;3.=\n<<# 7\nR0-.0+G)/;\n#A 9:\nC*E+G)/;\n8! 9:\n:O-*7)+'*+G)/;\nS8 9:\n#678$9:$;:6<\n(=$76>$?3$@8A\nCPP'4')*4')1\nC'*\n#%S$> ?@\nC3I0\n$AS#=!A ?@\n)BB6A68>AC\n(DE3FG\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n!\"#$%#&'#$(\n!\"#$%&'()(*$+$),\n-./(0&1.\"0\"%2&'.\"%+\n34 56\n89:;4 <=><2\n-\n??@A <=><2\n'B&C%$)2D&6.%+$%+\n:;AAA <=><2\n6.%E\"+\".%,\nF\")&G$*7\n?4 56\nHI+,\"E$\nRI*\"ES&T()*S&\n%.&T\"%E\n)**+,+)-,.$/&#&\n'\"%$&B$$E0$,\nJ(,,&K,$E\n3@3 2\nJ(,,&6L()/.(0&-$M+\nN;4 2\n-)#$0&%%$1%)/\n234 5\nO(+$)\nP+()+&J(,,\n4A8Q 2\nC%E&J(,,\n8;?: 2\nJ(,,&C#(7.)9\n??@ 2\nP+()+&G$*7\n:Q 56\nC%E&G$*7\n34 56\n6L(%2$&\"%&G$*7\nQ; 56\n#678$9:$;:6<\n=>$76?\nCMM\"/\"$%/\"$,\nC\"%\n:A4:? <=\nC.I+\n?:4;9?4 <=\n)@@6A68?AB\nCDE2(F\n\nSpiral Pine Needle Stove MIT D-Lab Design Spring 2010\n!\"#$%#&'#$(\n!\"#\"$%#%\n&'()*+,-.-/)0).1\n234-5+63'5'*7+,3'*0\n8! 9:\n:;\n<=#>! ?@\"?7\n$$A% ?@\"?7\n,B+C*).7D+:3*0)*0\n#>%%% ?@\"?7\n:3*E'0'3*1\nF'.+G)/;\n$! 9:\nHI01'E)+\nJ-./+KI0+L'*ED\n)**+,+)-,.$/&#&\n,'*)+B))E5)1\nM-11+N1)E\n8>O 7\nM-11+:P-.43-5+2)Q0\nR8R 7\n-)#$0&%%$1%)/\n234 5\nJ-0).\nS0-.0+M-11\n!%!$ 7\nC*E+M-11\n<O<> 7\nM-11+C(-;3.=\nR%< 7\nS0-.0+G)/;\n#A 9:\nC*E+G)/;\n8! 9:\n:P-*7)+'*+G)/;\nO8 9:\n#678$9:$;:6<\n(3$76=$4>$?8@\nCQQ'4')*4')1\nC'*\n#%A8$ ?@\nC3I0\n$R!O=R# ?@\n)AA6@68=@B\nCCDE2F\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Follow-up form",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/fcb50f112938287cd63fc6c1b9546a69_MITEC_720JS10_proj_folwup.pdf",
      "content": "commitment to the project, what are your goals and how will you continue working with\nthe rest of your team? Please mention any funding, grants or awards that you have\nreceived or are applying for to continue working on your project.\n\n2. Do you plan to continue your involvement in development-related work in the future?\nIf so, please tell us about your plans.\n\n3. How can D-Lab assist you with your plans (personal and/or project-wise)?\n\nD\n\nFollow\n\n-Lab\n-up\n\nName: ________________________\n\nProject: _______________________\n\n1. Do you plan to continue working on your D-Lab project? If so, what is your\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Project Selection Form",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/ae362a9f5714fa97d2577a4491e38896_MITEC_720JS10_proj_select.pdf",
      "content": "Project\nExplanation\nSkills and experiences\nAreas of interest\nProject Selection Form\nPlease indicate your top six choices of the proposed design challenges, indicating your relative preference for each choice.\nBe sure that you provide an explanation for why you want to work on each project and describe the skills or experiences that\nyou have that are especially relevant. In addition, indicate which aspect of the project you are most interested in working on.\nYou can make additional comments on the next page.\n\nAdditional comments or considerations:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Selected Design Challenges for 2010",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-720j-d-lab-ii-design-spring-2010/56062fff203cfff9c2c9c62fecadd6a0_MITEC_720JS10_comp_desc.pdf",
      "content": "Bamboo Pencil Maker\nProject Motivation: Pencils are a common and universally used product with vast domestic\nand international markets. They are conventionally produced from wooden slats that are then\nmachined into 12 pencil halves and filled with pencil lead. The Indian market alone consume\nan estimated 1.5 billion pencils per year, with an annual growth of 20%. Rural communities do\nnot currently benefit from pencil making or the market. Furthermore, wood is in short supply\nand its usage leads to deforestation. Bamboo is often grown as a reforestation crop; it grows\nquickly and produces strong, wood-like stalks. Bamboo-based pencils have been produced.\nThey look and function like regular pencils, including sharpening. The challenge in using\nbamboo is that it is round in form, hollow, and thin walled compared to solid timber. If pencils\ncould be made in large numbers from bamboo, very large numbers of poor rural communities\nwould benefit.\nBamboo stalks\nConventional manufacturing stages of pencils\nTechnical Description: A new approach for making the pencils is to use three identical\nparallelograms to form the hexagonal shape of the pencil and leaving a cavity for the lead.\nThere is a need for an inexpensive tool set or small human-powered machine to produce\nthese pieces that will yield a pencil that is 5.5mm thick x 185mm. Another tool set is needed\nto construct the pencils by gluing these parts together with the lead inserted. The daily\nproduction capacity should be 500 pieces per hour, and the tool set and machines for either\napplication should cost less than $500.\nCommunity: The International Network for Bamboo and Rattan (INBAR) (www.inbar.int) is an\ninternational organization working through several NGOs for the benefit of poor rural\ncommunities. INBAR is interested in producing such machines to enable rural communities to\nleverage local bamboo resources and provide income generating opportunities.\nProject Status: An initial set of prototypes to produce conventional slats was developed in\nD-Lab: Design class in 2008, but the project was not completed.\n\nChlorine Generator\nProject Motivation: More than 1 billion people lack access to safe drinking water. This\nunacceptable reality causes over 1.5 million deaths each year from water-borne diseases, with\nthe vast majority of these deaths being among children under the age of five. Point-of-use\nwater treatment has recently emerged as a promising approach within comprehensive water\nquality improvement strategies. Local chlorination can be a low-cost, rapidly implemented, and\neffective technology. However, treatment with chlorine presents supply chain challenges in\nmany areas, and even though it is relatively low-cost, chlorination can consume 5-10% of a\nperson's income in communities where the average income is $1 a day. Local production of\nchlorine using the electrolysis of salt water has the potential to provide safe drinking water,\nwhile also eliminating the supply chain concerns that arise with other chlorine products.\nA riverside scene on the Black Volta,\nSuper capacitors\nUsing the Miox tungsten electrode chlorination pen in\nGhana\nPeru\nTechnical Description: There is a need for an affordable electrolysis-based chlorine generator\nthat does not use batteries as an energy source, an alternative is a device that uses super\ncapacitors to store energy. The device must be safe to use, durable enough for frequent use\nand treat a useful amount of water for household use.\nCommunity: There are numerous communities that work in partnership with D-Lab throughout\nthe world where this prototype can be field-tested. The potential for application of the project is\nvirtually limitless, given the severity of the worldwide water crisis.\nProject Status: This is a new project, although a related project was developed at IDDS 2010.\nd-lab.scripts.mit.edu/documentation/index.php/designs/detail/43\n\nSoda Bottle Chipper\nProject Motivation: The Brazilian union of catadores (wastepickers) currently sell\nplastic soda bottles made of PET to processors who cut them into flakes that are of a\nsize that is useful to manufacturers. This is the first step of the PET recycling process;\nthe chippers then sell the flakes to manufacturers that either pelletize the flakes or use\nflakes to make new products. The process is currently done on an industrial level; all the\nmachines used are big and expensive. The challenge is to develop a low cost solution\nthat would enable the catadores union to process the bottles themselves and then sell\ndirectly to the manufacturers.\nPET soda bottle\nIndustrial plastic chipper\nSamples of plastic flakes\nTechnical Description: There is a need for an inexpensive, easy-to-use, human-\npowered machine to produce flakes with a mean size of 12-16mm. The initial goal is to\ndeploy a machine into a centrally located cooperative that would then serve a network\nof twenty other Sao Paulo recycling co-ops. The capacity of the machine needs to align\nwith the throughput and financial resources of each of the recycling co-ops.\nCommunity: Rede CataSampa, http://www.catasampa.org/, is the local Sao Paulo chapter of\nthe national Brazilian organization of catadores, http://www.mncr.org.br/. With an income of\nonly two-thirds of the Brazilian minimum wage of $10USD per day, catadores represents one\nof the most marginalized segments of Brazilian society.\nProject Status: This is a new project.\n\nPortable PedalPowered Washing Machine\nProject Motivation: In Peru, many women earn their living by washing clothes. They go to on e\nhouse and wash the clothes of the residents, then move on to the next house. They wash the\nclothes by hand, which limits the amount of laundry they can do each day. A portable, pedal-\npowered washing machine would allow them to wash more clothes with less effort, thus\nincreasing their income.\nThe first D-Lab Bicilavadora\nThe second Bicilavadora, built at\nA portable pedal-powered grinding whee\nMayaPedal in Guatemmala\nTechnical Description: The portable washer needs to quickly switch between a\nwheelbarrow-like, transport mode to a washing mode. In transport mode it needs to be easily\nmoved by a small adult in an urban environment that includes well maintained sidewalks and\nrough unpaved back streets. It needs to be able to wash and wring out a range of clothing\nincluding jeans. The machine needs to increase productivity enough and be sufficiently\ninexpensive that it pays for itself in 6 months. Water will be supplied by hose or bucket at the\nwashing location.\nCommunity: PRISMA is a non-government organization in Peru that focuses on capacity\nbuilding and micro-credit opportunities for the poor. LimaKids is a PRISMA project that works\nwith homeless children and orphanages and is looking for business opportunities for young\nadults, with poor job prospects, to transition to supporting themselves through legal and\ndignified work.\nProject Status: This is a new project.\n\nPine Needle Stove\nProject Motivation: In the foothills of the Himalayas, forests of introduced pine trees have led\nto many environmental problems. The pine needles cause acidification of the soil, lead to\nexcessive rainwater run-off and pose a risk of forest fires. The needles do, however, have a\nhigh energy content, and could be used as fuel for either cooking or heating.\nPine needle litter\nBurning unprocessed pine needles\nTechnical Description: This project is to build a stove that uses pine needles as fuel. The\nstove may be used for cooking or heating (or both) and should be safe to use and cost less\nthan $15 to produce. The pine needles may be processed prior to use, however if this is the\ncase, the design should include processing equipment as well.\nCommunity: Avani develops and disseminates appropriate technologies in the Kumaon region\nof Uttaranchal, India. They also promote craft and farm-based livelihood opportunities in the\narea.\nProject Status: This is a new project.\n\nVegetable Cutter\nProject Motivation: The Sagrada Familia orphanage in Lima, Peru provides a home for\nnearly seven hundred children in the greater capital city area. Feeding such a large number\nof children is a daunting task for the orphanage's staff, and must be done on a daily basis.\nDespite this, the leader of the orphanage is looking to promote healthier diets by introducing\nmore variety in meals. He now has the resources available to purchase and transport more\nvegetables to the orphanage but is looking for a faster way to prepare the large quantities of\nfood. A more efficient cutter for vegetables would allow the orphanage to provide better\nnutrition for its children and help promote healthier lifestyles.\nThe kitchen at Sagrada Familia\nSagrada Familia\nOne of the children\ncompound\nTechnical Description: Providing healthy options for the children requires quick preparation\nfor large amounts of vegetables. Tools that would help cut and slide these vegetable would\nallow Sagrada Familia to provide these nutritious meals on a more regular basis to the\nchildren. For some perspective, if the staff wants to feed a salad to each of the children\nconsisting of lettuce, three tomatoes and two carrots they would be required to wash and\nslice over 2100 tomatoes and 1400 carrots. The new cutting tool or mechanism would\nhandle large quantities of food at one time, be capable of handling multiple types of\nvegetables, and provide a variety of cutting options (e.g. slicing, quartering). Ultimately, the\nmachine must increase their vegetable or salad throughput.\nCommunity: The Comunidad de Ninos Sagrada Familia is an orphanage located in\nVentinilla, Peru outside of Lima which houses and cares of children mainly from the Lima and\nCuzco regions of the country. At the orphanage they learn values, attend school, do chores,\nand practice skills (baking, ceramics, and carpentry) which help them in the future.\nProject Status: This is a new project.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.720J / 2.722J D-Lab II: Design\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}