{
  "course_name": "D-Lab: Medical Technologies for the Developing World",
  "course_description": "D-Lab Health provides a multidisciplinary approach to global health technology design via guest lectures and a major project based on fieldwork. We will explore the current state of global health challenges and learn how to design medical technologies that address those problems. Students may travel to Nicaragua during spring break to work with health professionals, using medical technology design kits to gain field experience for their device challenge. As a final class deliverable, you will create a product design solution to address challenges observed in the field. The resulting designs are prototyped in the summer for continued evaluation and testing.",
  "topics": [
    "Health and Medicine",
    "Biomedicine",
    "Public Health",
    "Society",
    "The Developing World",
    "Health and Medicine",
    "Biomedicine",
    "Public Health",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nFirst Half of Semester\n\nLectures: 2 sessions / week, 1 hour / session\n\nLabs: 1 session / week, 2 hours / session\n\nSpring Break\n\nField trip to Nicaragua\n\nSecond Half of Semester\n\nOccasional lectures and local field trips during class time\n\nProject team work: meeting times determined by teams\n\nCourse Goals\n\nLearn about the distinctive medical challenges of the developing world\n\nLearn to identify medical improvisations in the field\n\nLearn hands-on prototyping and medical device design skills\n\nLearn how to address safety, regulatory, and ethical challenges in device design\n\nCourse Structure\n\nThe semester is divided into two halves. The first half of the semester will focus on a survey of global health challenges and accelerated training on five medical device categories:\n\nDrug delivery\n\nDiagnostics\n\nInstrumentation\n\nVital signs monitoring\n\nMicrofluidics\n\nStudents explore each device category through instructional lectures and hands-on activities during two-hour lab sessions on Fridays. Students complete weekly lab assignments due the following Friday.\n\nIn between the first half and second halves of the semester, during spring break, students will travel to Nicaragua to observe, identify, and report public health and medical challenges that might be effectively addressed by appropriate medical technologies.\n\nUpon returning from Nicaragua, students form teams around needs identified during the spring break trip. Students focus on device design and prototyping during the second half of the semester, advised by expert mentors and course instructors. A final poster and device prototypes will be presented during a capstone poster session at the MIT Museum at the conclusion of the semester.\n\nCourse Text\n\nHilts, Philip J.\nRx for Survival: Why We Must Rise to the Global Health Challenge\n. New York, NY: Penguin, 2007 (reprint). ISBN: 9780143037989.\n\nThis text is supplemented by papers and resources listed on the\nLectures and Readings\nand\nLabs and Readings\npages.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation and attendance\n\n20%\n\nHomework assignments\n\n15%\n\nLab notebooks and assignments\n\n25%\n\nPresentations and design reviews\n\n25%\n\nFinal design/prototype\n\n15%\n\nCalendar\n\nEach week is composed of two lectures and a lab session. Homework is assigned during the first lecture of the week, and due on the first lecture of the following week. Similarly, lab homework is assigned during lab and due one week later at the following lab session.\n\nLEC #\n\nLECTURE TOPICS\n\nLAB TOPICS\n\nKEY DATES\n\nPart I: Survey of global health challenges and medical device categories\n\nIntroduction, global health overview\n\nLab 1: Drug delivery\n\nHomework 1 due\n\nDrug delivery overview\n\nInfectious diseases\n\nLab 2: Diagnostics\n\nHomework 2 due\n\nLab 1 homework due\n\nNon-communicable diseases\n\nCapturing heart and lung sounds on a mobile phone - guest lecture by Katherine Kuan\n\nLab 3: Instrumentation\n\nLab 2 homework due\n\nAdvances in telemedicine and patient monitoring\n\nVaccines\n\nLab 4: Vital signs monitoring\n\nLab 3 homework due\n\nArduous Arduino - guest lecture by Paul Hlebowitsh\n\nWeek\n\n#8: Spring break, Nicaragua trip\n\nPart II: Project design and development\n\nUser and setting-driven innovations to advance global healthcare - guest lecture by Kris Olson\n\nLab 5: Microfluidics\n\nHomework 3 due\n\nLab 4 homework due\n\nPrototyping of medical devices\n\nNeglected tropical diseases\n\nVisit to Shriners Hospital for Children, Boston, MA\n\nLab 5 homework due\n\nDisabilities in the developing world\n\nProject team formation\n\nProject team work\n\nLab 6 homework due\n\nFDA approvals\n\nFDA 510(k) homework due\n\nProject brainstorming\n\nVisit to MIT laser cutter and 3-D printer\n\nProject team work\n\nProject team work\n\nProject team work\n\nProject team work\n\nBlog/Lab notebook review Sketch model due\n\nProject team work\n\nProject team work\n\nRole-playing simulation games\n\nFinal prototype due at MIT Museum at D-Lab Finale\n\nProject team work, Sketch model review feedback\n\nProject team work\n\nNo lab\n\nProject wrap-up",
  "files": [
    {
      "category": "Resource",
      "title": "Design Challenge Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/d26e04a5cbe19c3c7a731ec339b9c70c_MITEC_710S10_DsgnChlngWrk.pdf",
      "content": "Problem or need:\nBackground information (Why do you use this equipment, what is the treatment that is sought,\nwhat does the entire process entail):\nTechnical description/specifications:\nHow is the local user community approaching the problem? What type of improvised, or local\nsolutions are being used?\nWho is the primary contact for this challenge?\nWho are the key stakeholders (do you have their contact info? if not, get it...)\nName & Phone/Email\nRole\nCopyright 2010 | Jose Gomez-Marquez & Anna Young | iih.mit.edu\n\nWhat relevant resources are available? Consider materials (not just local materials, if they are imported, then just\nnote it. Don't get hung up in price. Cost is best defined as how difficult it is to obtain. Difficulty MAY include price, but may also be\naffected by other issues. Also consider resources to obtain relevant training, and frequency of supply. Use the parameter table.\nWhat resources may be needed?\nWhat are the potential benefits of solving this challenge?\nWhat are the potential obstacles?\nWhat are the risks of undertaking this project?\nHow can you get the local user community involved in the process?\nCopyright 2010 | Jose Gomez-Marquez & Anna Young | iih.mit.edu\n\n-\nWhat photographs and videos should you take? (take them!!)\nWhat additional information should you collect? (collect it!!)\n- Checklist\n-\nDid you see the patient?\n-\nDid you see the user go through the process?\n-\nWhere you able to get some \"alone time\" with the user to make sure they spoke candidly?\n-\nWhere you able to deflect \"preventative\" measures that do not address the problem at hand? (e.g., clean\nwater to avoid cholera instead of a better IV for the patient once he has cholera)\n-\nWhere you able to deflect big science solutions that are far away from solving the problem at hand? (e.g.,\nthose in the upper right hand of the Global Health Innovation Compass; those that rely on fancy\ntechnology that is years and millions of dollars away being delivered)\n-\nDid they share some anecdotal \"war stories\" on how they deal with the issue?\n-\nDid you go through the parameters of design to obtain a vantage point from each parameter?\n-\nDid you look at the design strategies so brainstorm some potential solutions?\n-\nWhere you able to share some initial ideas with your user?\n-\nDid you sketch out the problem?\nInnovations in International Health Medical Device Design Attributes\nEssential\n-SAFE\n-Accurate\n-Robust\n-Longevity\n-Cheap\n-Reliable\n-Reusable/Disposabl\n-Redundant\nEnhancing\n-Mobile\n-Connected\n-Smart\n-Plug n' Play\nLong Term\n-Local\nManufacturing\n-Local Innovation\nInnovations in International Health Medical Device Design Strategies\n-\nHybridization = Two types of technologies mashup up\n-\nVintage Technologies + Smart Design/Tech = New Solutions\n-\nFinding an invention in an improvised solution and sprinkling some engineering\n-\nBottom up observation: What are the people telling you? What are the users saying?\n-\nBe trendsetting, not trendy\n-\nContext shifting\n-\nDistributed Systems: Decentralizing solutions by using many nodes that talk to each other\n-\nCrowdsourcing: Using many individuals working as a passionate army to arrive at a solution\nCopyright 2010 | Jose Gomez-Marquez & Anna Young | iih.mit.edu\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Diagnostics Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/38c044ff9a0cbdf2c8507e38f665eac9_MITEC_710S10_labonchp_hmwk.pdf",
      "content": "!\"#$%&'($)*+&,&-.&!(/012&)$%&3\n\n!\"#$%&'($)*+&,&-.&!(/012&)$%&3\n\nD-Lab Health | dx Design lab 2\nLab-on-a-chip devices for global health: Past studies and future opportunities\nCurtis D. Chin, Vincent Linder, Samuel K. Sia, Lab Chip, 2007, (1),41-57\nDOI: 10.1039/b611455e\nLow-cost rapid prototyping of flexible microfluidic devices using a desktop digital craft cutter\nPo Ki Yuen, Vasiliy N. Goral, Lab Chip, 2010, (3),384-387\nDOI: 10.1039/b918089c\nRapid prototyping of microfluidic devices with a wax printer\nGovind V. Kaigala, Sunny Ho, Roel Penterman, Christopher J. Backhouse, Lab Chip, 2007, (3),384-387\nDOI: 10.1039/b617764f\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Instrumentation Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/a0f1f1818e4ee1fe1505e30e6a7883b9_MITEC_710S10_instrumn_lab.pdf",
      "content": "Photos and designs by Katherine Kuan.\n\nAssignment\nAssignment\n1. Make a device that can amplify (without electronics)\nMake a device that can amplify (without electronics)\nheart and lung sounds for recording on a cell phone\n2.2. Email recording to yourself, or use USB cord to\nEmail recording to yourself, or use USB cord to\ntransfer it to the computer\n3. Convert to WAV format using\nhttp://download.cnet.com/PeonySoft‐WAV‐\nConverter/3000‐2140_4‐10911514.html\n4. Look at its waveform in MATLAB\ny = wavread('hello.wav');\nplot(y)\n5. Can you see the heart beats or breaths? ((Mayy be hard\nto tell without further signal processing)\n\nTesting Your Device\nTesting Your Device\nCheck that the heartbeats/breaths are audible\nCheck that the heartbeats/breaths are audible\nfrom someone listening on the computer (full\nl\nith h\nd\n)\nvolume, with headphhones)\nHeart sounds: Try the ppulmonaryy\nLung Sounds: Tryy the trachea ((over\nand mitral locations\nthe front of the throat) and the 6\nlocations on the back of the chest\nCourtesy of Arcot Chandrasekhar. Used with\npermission.\n\nResources\nResources\n- Low‐Cost Technologies in Rural Areas\nhttp://www.healthwrights.org/books/HHWL/HHWLchapt16.pdf\n- Make a Homemade Stethoscope\nhttp:////www.csiro.au/helix//sciencemail//activities//Stethoscope.html\n- What Makes a Good Stethoscope\nhtt\nhttp://\n//revi iews.ebbay.com/St\n/Steth\nthoscope‐Basics\nB\ni\n‐Wh\nWhat t‐makes‐a‐Goo\nG\nd‐\nStethoscope_W0QQugidZ10000000004429816\n-All about Stethoscopes\n-All about Stethoscopes\nhttp://www.asahi‐net.or.jp/~ig2s‐kzm/allabout.html\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Pulse Oximetry & Microcontrollers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/9798f931ac068017d688addf60109430_MITEC_710S10_pulseox.pdf",
      "content": "Pulse Oximetry &\nPulse Oximetry &\nMicrocontrollers\nD‐Lab: Health\nD Lab: Health\n5 March 2010\n\nPulse Oximetry Purpose\nPulse Oximetry Purpose\n- Detect oxygen saturation of a patient's blood.\n- While you're at it, detect pulse rate.\nWhile you re at it, detect pulse rate.\nImage of pulse oximeter with handheld digital device removed due to copyright restrictions.\n\nHow It's Done\nHow It s Done\n- Red Blood Cells carry oxygen using hemoglobin\n- Hemoglobin changes shape when it picks up oxygen\n- This shape changes how the protein absorbs light\nImages of oxyhemoglobin and deoxyhemoglobin removed due to copyright restrictions.\n\n-\nHow It's Done\nHow It s Done\n- A PulseOx transmits two different wavelengths of\nlight through a thin part of the body and measures\nthe difference in intensity.\n- Calibrated curves\ntranslate this to O2Sat.\n- Detect pulse by seeing\nDetect pulse by seeing\nperiodic changes in\nintensity\nGraph\nshowi\nng red and\ninfra\nred\nab\nsor\npt\nion\nch\nara\ncte\nrist\nics.\nImage by MIT OpenCourseWare.\n\nMicrocontrollers\nMicrocontrollers\n- Small computers built on integrated circuits.\n- Take inputs, do processing, create outputs.\nTake inputs, do processing, create outputs.\nImage by marzzelo from Flickr.\n\nArduino\nArduino\n- A single‐board microprocessor system.\nInputs and\n\nOutputs\nUSB\n\nplug\n\nMicrocontrol\nPower\nPower\nplug\nler\nImage by adafruit on Flickr.\n\nProgramming\nArduino\n- A lot like C++\n- Program on\nProgram on\nyour computer,\nthen load\nthen load\nsoftware onto\nmicrocontroller,\nwhich runs in a\nloop\n\nMore on Arduinos\nMore on Arduinos\n- Arduino plug‐in expansion \"shields\":\nhttp://www.spparkfun.com/commerce/categgori\nes.php?c=103\n- Arduino Project Examples\nArduino Project Examples\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sample Design Challenge Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/9dcecfcd1cfda45b5de1e7a8077b563b_MITEC_710S10_DesChlWs_smpl.pdf",
      "content": "!\nProblem or need:\nPatients with severe burns require skin grafts. Surgeons use a\ntool called a dermatome that can cut away very thin layers of skin for self-\ntransplantation. The existing tools break often and are very difficult to replace. They\nare very expensive. The parts are made out of surgical steel which complicates on-\nsite repair.\nBackground information (Why do you use this equipment, what is the treatment that is sought,\nwhat does the entire process entail): The instruments is essential to be able to take\nspecific layer of skin and transplant it to another part of the body of a burn patient.\nIn addition, they are also used to excise diseased skin which needs to be removed.\nTechnical description/specifications: Pneumatic power. Runs on nitrogen gas. Local\ndoctors have been able to use a Caufield compressor running at 12hp with 80 PSI.\nLower PSI induces resonance and vibration. Perhaps this is why the parts break\noff?? A broken one is being taken back to MIT for dissection. Dr. Sheridan suspects\nthe cams are the weakest link. They are made out of a compound materials. Part\nsurgical steel, and some other ABS plastic. It does DOES NOT show sign of wear\nand tear on the outside.\nHow is the local user community approaching the problem? What type of improvised, or local\nsolutions are being used? A nurse aide in Honduras dunked the entire apparatus in liquid\nnitrogen for 30 second every 30 minutes. This seems to stabilize the parts and they\nclaim to make them last longer. The problem is that they also run out of liquid\nnitrogen. A German titanium coated version is in use and has not broken, but that is\n$18,000!!\nWho is the primary contact for this challenge? Dr. Sheridan and Dr. Lopez\nWho are the key stakeholders (do you have their contact info? if not, get it...)\nName\nRole\nLuis Medina\nLocal biomedical tech!\nSarai Funez\nHonduran nurse aide - Nitrogen dunking!\n\n!\nWhat relevant resources are available? Consider materials (not just local materials, if they are imported, then just\nnote it. Don't get hung up in price. Cost is best defined as how difficult it is to obtain. Difficulty MAY include price, but may also be\naffected by other issues. Also consider resources to obtain relevant training, and frequency of supply. Use the parameter table.\nThere are machine shops on the outskirts, but mostly focus on automotive parts.\nNO precision fabrication. There is an abundance of precision parts for the printing\nindustry (mostly high speed photocopiers). We may be able to borrow some high\nspeed cams to compare the wear and tear. Compressors are widely available.\n\nWhat resources may be needed?\nCompressors. Pneumatic connectors. Safety valves.\nPrecision machine fab shops. Cheap injection molding.\nExpert help with: plastic cutting, compression of materials, biosafety of plastics in\nsurgery. Can someone at Gillete help us? Local manufacturing of either the blade or\nthe cam might be an option. Operator training and an autoclave that won't\ncompromise material strength is also important.\n\nWhat are the potential benefits of solving this challenge? Locally available sources for\nparts make this device more sustainable. Also, if the device is reliably available, more\npatients can be saved.\n\nWhat are the potential obstacles?\nWe are concerned with long-term quality control.\nThe point is to have a disposable cam that is cheap. If it is reused it could break.\nCurrently, very little research has been in plastics that cut AND can be autoclaved.\nMore information on sterilization options is necessary. If the device has a different\nfeel given that we may have to lower the PSI, then surgical retraining might be\nnecessary.\n\nWhat are the risks of undertaking this project?\nThis is high risk surgery that requires\nprecision. Contamination of a reused disposable product could lead to infection. !\nCan we get an antibacterial coating??? Can you \"sterlize\" it...or does that defeat the\npurpose?\n\nHow can you get the local user community involved in the process? Learn about locally\navailable sterilization options. They have some advances with material pre-processing\n(the nitrogen) that could be essential to understanding how to lengthen tool life.\nThey are the doctors, and they can continue to show us their surgical techniques\nto co-design a better instrument.\n\n!\nWhat photographs and videos should you take? (take them!!)\n\nWhat additional information should you collect? (collect it!!)\n\n\" Checklist\n# Did you see the patient?\n# Did you see the user go through the process?\n# Did you inteview people high and low along the solution chain?\n# Where you able to deflect \"preventative\" measures that do not address the problem at hand?\n(e.g., clean water to avoid cholera instead of a better IV for the patient once he has cholera)\n# Where you able to deflect big science solutions that are far away from solving the problem at\nhand? (e.g., those in the upper right hand of the Global Health Innovation Compass; those that\nrely on fancy technology that is years and millions of dollars away being delivered)\n# Did they share some anecdotal \"war stories\" on how they deal with the issue?\n# Did you go through the parameters of design to obtain a vantage point from each parameter?\n# Did you look at the design strategies so brainstorm some potential solutions?\n# Where you able to share some initial ideas with your user?\n# Did you sketch out the problem?\nD-Lab Health Medical Device Design Attributes\n\nD-Lab Health Medical Device Design Strategies\n$\nHybridization = Two types of technologies mashup up\n$\nVintage Technologies + Smart Design/Tech = New Solutions\n$\nFinding an invention in an improvised solution and sprinkling some engineering\n$\nBottom up observation: What are the people telling you? What are the users saying?\n$\nBe trendsetting, not trendy\n$\nContext shifting\n$\nDistributed Systems: Decentralizing solutions by using many nodes that talk to each other\n$\nCrowdsourcing: Using many individuals working as a passionate army to arrive at a solution\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Simulation Game",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/7b3c64a105ce8d9b26b5d785c2440f75_MITEC_710S10_simlgame.pdf",
      "content": "United States:\nThe Entrepreneur\nYou have invented a Gizmo and you are convinced that it has an application in the developing world.\nThe FDA just told you that it would cost around $650,000 to get it approved for use in America.\nUnfortunately, you only have about $100,000 left after you paid for the R&D required to launch your\ndevice. You are hoping to be able to sell it at a reduced, but sustainable price in a low‐resource\nsetting where your product has its maximum impact. In your first voyage outside Kansas, you are off\nto Brazil to convince the local authorities to let you distribute 100 prototypes that you can sell to an\ninterested doctor that you met from Brazil. Part of the $100,000 paid for a small scale set of trials at\nthe University of Wheat that show your machine works the way it's supposed to. You are in Brazil to\nget more data and hope to make some sales while you are at it.\nAmerican IRB Officer\nYou are the clinical trial police. Your job is to ensure full compliance of ethical and clinical standards\nso that that the University doesn't get in trouble. This means long hours drafting 20 page IRB\nproposals that involve multiple parties. Your office just suffered a series of cutbacks so you are\noverwhelmed with proposals.\nBrazil:\nRegulatory\nYou are a medical device approval officer at ANVISA, the local medical device regulatory agency. By\ndefault your main job is protect the Brazilian population and ensure a good standard of health.\nIn order for products to be accepted in Brazilian customs, it is a legal requirement for the products to\nhave directions for use in Portuguese and to have Portuguese product labels. Each of the following\nitems must be included:\n-\nProduct name and intended use.\n-\nManufacturing and sterilization date.\n-\nMethod of sterilization.\n-\nExpiration date.\n-\nMOH registration number.\n-\nName and registration number of responsible technical person at the Brazilian distributor's\noffice.\n-\nManufacturer and distributor names (the distributor holding the registration) and\naddresses.\nIf a clinical trial is involved you want the terms of the IRB, and you demand that the IRB is authored\nand harmonized locally in Portuguese. It's a medical device that is not FDA approved, you want to\nclinical trial data that doesn't begin with Brazilians because they aren't Guinea Pigs.\nIf a clinical device will be used in Brazil you need to company to become a Brazilian company with\nlocal distributers and local manufacturing.\nYour job will typically take about 6 months, but in reality, things take about 12 months. You should\nnot disclose that though, because it will make sound like your office is too slow and you may get fired.\nOne of the things you need to control is the overabundance of imported medical devices. The reason\nfor this is that you want to control the national trade deficit as mandated by a central federal\n\ngovernment. If presented with a foreign company that presents you with an excellent device and a\nlocal company with an okay device, you prefer to go with a local company for approval. Intellectual\nproperty is less of a concern to you. In fact and should be the company's problem. Access to care is\nyour mandate.\nIf you're careful, and your slick, you can earn some extra money by greasing the wheels on the\nprocess. Be creative, the country seems to be very lax on corruption enforcement standards.\nYou are extremely wary of foreign imports. This is in part due to your upbringing in an oil services\ntown where the foreign multinational polluted the local water system throughout the years.\ntechnology was brought in from Switzerland to provide accessible chlorination to the town, but he\njust resulted in inexpensive purchase of hardware. Moreover an extra tax was levied on your family\nand the rest of the town to pay for the failed project. The engineers that came in from the capital\nhired by the company look down on your neighbors because they didn't have as much education as\nthey did. Since then he seem to have a chip on your shoulder to try to true foreigners and Brazilians\ncan do it better.\nConsultant to Regulatory\nYou are the head of biomedical engineering at the University of Manaus. You have invented three\ndifferent devices that are used to combat inflammation resulting from snakebites. Furthermore\nyou've offered about 500 papers involving different types of uses for these devices. They have all\nbeen papers published in Brazilian journals. You have made the footnote of an article in Nature and\nyou are very proud of that.\nThe reason you consult with ANVISA is to supplement your income because a professor salary in\nBrazil doesn't go very far. ANVISA pays by the hour and passes on the cost to the applicant, so the\nlonger it takes the better it is for you.\nGenerally you're on the fence about foreigners. On one hand you really want impressive them\nbecause you never really got into a very good university outside Brazil. On the other hand, you know\nBrazil and they don't. You really get annoyed when they tell you that something is the way it is\nsupposed to be after they have just arrived into town.\nYour primary job is to review the technical details a device and make sure that they match the IRB. If\nthey don't match, then the company has to start all over again.\nLocal Entrepreneur and Medical Device Factory\nYour family has a small pharmaceutical factory in the heart of Brazil that supplies mostly over the\ncounter painkillers in topical medications to the Brazilian market. Five years ago you graduated from\nthe University of Window with a degree in Chemical Engineering and a minor in business. In your\nfourth year, you saw a medical device company go public and your dream is to follow in their\nfootsteps. Your parents have given you some freedom in running a portion of the company. You want\nto move things into the medical device arena, because you think aspirin is boring.\nYou like Brazil, you are a king in that country, but you feel a little stifled. On the other hand, you\ndidn't like any of the regular business rules or intellectual property rights that the US had to offer\nwhen you lived there. At the end of the day, you know that pursuing a patent in Brazil will take years\nfor the litigant to get anything done any seen most of your friends violate IP protections and make a\nlot of money. Everyone sleeps at night because they know that at the end of the day patients are\ngetting treated. Depending on the person he basically flip a coin and decide how to get to that\njuncture in the road if it ever comes to you.\nRepublic of Tocoa\n\nDoctor\nYour patients are dying all around because they don't have access to X. Your training in the US\nincluded a class at MIT that taught students how to design appropriate medical technology. You\nknow that there's a better way to address the lack of this technology but no one listens to you. You\nare trying to find the right partners that share your vision. Your cousin is the director of the local\nFDA, but he/she isn't very knowledgeable about these matters and will generally be bi‐polar about\nthese decisions. You work in a country hospital because you like the people that you treat but hope to\ncome back to the capital eventually. In the meantime, you are a bit frustrated with the local\nauthorities because the procurement process is endless and you never seem to get any of the\nequipment or instruments that you request.\nTocoan Regulatory Ministry\nYou are a medical device approval officer at TRM, the local medical device regulatory agency. By\ndefault your main job is protect the TRM population and ensure a good standard of health. You have\nnever approved a medical device in your life. Your main job is to ensure that fake pharmaceuticals\ndon't get into the country.\nIn order for products to be accepted in Tocoan customs, it is a legal requirement for the products to\nhave directions for use in Portuguese and to have Portuguese product labels. Each of the following\nitems must be included:\n-\nProduct name and intended use.\n-\nManufacturing and sterilization date.\n-\nMethod of sterilization.\n-\nExpiration date.\n-\nMOH registration number.\n-\nName and registration number of responsible technical person at the Brazilian distributor's\noffice.\n-\nManufacturer and distributor names (the distributor holding the registration) and\naddresses.\nIf a clinical trial is involved you want the terms of the IRB, and you demand that the IRB is authored\nand harmonized locally in Tocoan. It's a medical device that is not FDA approved, you want to clinical\ntrial data that doesn't begin with Tocoans because they aren't Guinea Pigs.\nYour job will typically take about 6 months, but in reality, things take about 12 months. You should\nnot disclose that though, because it will make sound like your office is too slow and you may get fired.\nYou are totally in awe of foreign technology and love American and German brands. Tocoa just got\ninvited to be part of the Central American Free Trade Organization. This has implications in the\nregulatory affairs of the country because the United States wants to make sure that any products\ngetting exported out of Tocoa and into the US do not harm Americans. They have just given you a free\n2‐week seminar on FDA best practices and you have determined that it is the gold standard for\napproving products. You wish that your agency had the capacity to do that rigorous amount of work,\nbut you don't get paid enough to do it, so you always start by demanding FDA approval.\nIf you're careful, and your slick, you can earn some extra money by greasing the wheels on the\nprocess. Be creative, the country seems to be very lax on corruption enforcement standards. On the\nother hand, if patients get hurt on your watch they will fire you and because our appointment is a\npolitical one, they will lay off other members of your family. Risk is not of your favorite pastimes.\n\nLocal Entrepreneur and Medical Device Factory\nYour family in the small pharmaceutical factory in the heart of Tocoa supplies mostly over‐the\ncounter painkillers in topical medications to the Tocoan market. Five years ago you graduated from\nthe University of Window with a degree in Chemical Engineering and a minor in business. In your\nfourth year, you saw a medical device company go public and your dream is to follow in their\nfootsteps. Your parents have given you some freedom in running a portion of the company. You want\nto move things into the medical device arena, because you think aspirin is boring.\nYou like Tocoa, you are a king in that country, but you feel a little stifled. On the other hand, you\ndidn't like any of the regular business rules or intellectual property rights that the US had to offer\nwhen you lived there. At the end of the day you know that pursuing a patent in Brazil will take years\nfor the litigant to get anything done any seen most of your friends violate IP protections and make a\nlot of money. Everyone sleeps at night because they know that at the end of the day patients are\ngetting treated. Depending on the person, he basically flips a coin and decides how to get to that\njuncture in the road if it ever comes to you.\nDirector of Physicians College\nYour regulatory body is in charge of advising the TRM to make sure they know what types of\ntherapies they should be approving. You recognize that approval is basically a rubber stamp, and you\nare concerned about the power and relevance of your organization. Your mandate is to keep the 500\nnew MD graduates of the country employed. If something hinders that, then you take action. You\nthink American doctors are too much in love with technology, so you take a lot of pride in the fact\nthat you can do things by pure skill. That makes a true measure of a doctor. You are tired of gizmos\nthat break down an in general look down on new ones. Your power is based on the recommendations\nthat you make to TRM on whether to pursue something or not. You generally try to supplement your\nincome by finding business opportunities with your friends. Most recently, you became a part time\nmedical officer for a pharmaceutical company and that has paid off handsomely. That ended in\nChristmas and you are open to new side gigs.\nDoctor\nYou are a gadget freak. Even though you studied medicine you really wanted to study engineering\nbut it really didn't pay that well. Instead you became an internist and are now handsomely being\npaid by your private practice. You are really good friends with XXXXXXXXX and offer advice\nwhenever you guys get together. Most of the XXXXXXXXX to serve as a de facto consultant whenever\nthey can't figure it out. You were born in the capital, had a fairly privileged upbringing, and know\nvery little about the countryside except that it's full of poor people that you rarely see because your\npatients are mostly part of the professional class. You are a subscriber to Technology Review and\nkeep a framed picture of the MIT dome from when you got invited to a conference on Physics with\nyour High School.\nMinistry of Health Finance Officer\nYour job entails (1) getting money from donors, and (2) spending money from donors.\nIn the last 10 years, you have gotten very good at getting donations of medical equipment. You also\nmanage medical supply procurement. Your financing arms (World Bank and IADB) only allow for\nmedicines to be bought, so 90% of your purchases are drugs. You basically get to decide whether a\nhospital gets to buy something or not.\nThe Bank\nYour job is to provide venture loans to promising companies. You have to assess risk which includes:\n\n-\nSoundness of business plan\n-\nCountry risk\n-\nIntellectual property protection\n-\nMarket size\nBig Multinational Organization Financier\nYou have an MBA from the University of Monee and you are an expert at making loans. You have\nlearned to calculate risk and get most of your money back from countries in the developing world\nwho usually default on all their loans. Recently you put in place a very specialized dating system that\nI'll only approved an established manufacturers of medical supplies to make it into the procurement\nprocess. Your dream system is one in which you will two main groups of items for purchase:\nMedications which are usually recommendation by international bodies and Equipment. For\nequipment, the MBA inside you wants to harmonize everything so that there are about 250 essential\nmedical devices around the world that every country must purchase as part of their aid package.\nWhenever there's a new manufacturer generally rely on your network of friends who went to really\ncool universities to find out if they are legitimate or not. Your friends are now all in banking\nhowever it's been a long time since he worked in the lab so they generally go by name association.\nPatient\nYou are really poor. The last time you ever went to the doctor was because you couldn't stand the\npain from a broken tooth and it almost got your fired. When health is concerned, affordability is\nparamount. You basically only go to the doctor when things hurt. You have three children and you\nmake no exceptions when it comes to their health.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "FDA 510(k) Homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-710-d-lab-medical-technologies-for-the-developing-world-spring-2010/47a0088d00647273527f10c4c74eb7c0_MITEC_710S10_510k_homework.pdf",
      "content": "SCROLl DOWN\n\nType a generic device\nname\n\nPick a device classification.\n\nThis is the actual letter the FDA\nsends.\n\nThis is the predicate device.\n\nFind the letter for the predicate\ndevice.\n\nAnd continue the chain\nAnd continue the chain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nEC.710 D-Lab: Medical Technologies for the Developing World\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}