{
  "course_name": "D-Lab: Water, Climate Change, and Health",
  "course_description": "D-Lab: Water, Climate Change, and Health is a project-based, experiential, and transdisciplinary course. Together with peers and experts, we will explore the vitally important interface of water, climate change, and health. This course addresses mitigation and adaptation to climate change as it pertains to water and health. Water-borne illness, malnutrition, and vector-borne diseases represent the top three causes of morbidity and mortality in regions of our focus. Students submit a term project, setting the stage for a lifelong commitment to communicating climate science to a broad public.",
  "topics": [
    "Health and Medicine",
    "Public Health",
    "Science",
    "Earth Science",
    "Climate Studies",
    "Environmental Science",
    "Sustainability",
    "Health and Medicine",
    "Public Health",
    "Science",
    "Earth Science",
    "Climate Studies",
    "Environmental Science",
    "Sustainability"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week; 3 hrs / session\n\nPrerequisites\n\nNone\n\nCourse Description\n\nWe began this class four years ago focused on water and climate change. There was only one class on this topic at that time in the world! In 2018, we expanded our focus to include health, both human health and planetary health. Realizing that all people are vulnerable to climate change and all regions are impacted, we added health to emphasize the life-affirming aspects and hope inherent in a cooperative and solutions-based approach to climate change.\n\nClimate science is comprised of a huge diversity of disciplines: physics, chemistry, biology, paleoclimatology, astronomy, geology, meteorology, oceanography, glaciology, and more! We will take an Earth Systems approach in order to establish a solid climate science foundation. The first two months will be devoted to covering fundamental concepts, so that we are all on common ground.\n\nMIT exposes us to multiple disciplines. Water, Climate Change, and Health requires not only multi-disciplinary (within academia) but also transdisciplinary (beyond academia) perspectives that include equity and justice, which is to say concern for vulnerable people and other life on Earth. For example, we focus on people and specific locales where waterborne and vector-borne diseases, hunger, malnutrition, and poverty are exacerbated by climate change--challenges that will worsen with increased temperatures, precipitation, flooding, drought, overcrowding, and displacement. These factors are top causes of morbidity and mortality due to climate change. At the same time, we recognize that we are all on this planet together, so all life on Earth is vulnerable to climate change impacts.\n\nThese challenges are also opportunities for creativity and innovation. The intersection of water, climate change, and health is a call for action. Responses and actions today, as in no other time in Earth's recorded history, affect our human and planetary future.\n\nWith this awareness and seriousness of purpose, our class will include a Term Project of your choice, as well as numerous lectures, tutorials, class discussions, demos, games, and field trips. We will explore solutions though real-world engagements. Presentations by water, climate, and health experts, innovators, and climate activists will offer stimuli for teams to co-create solutions. Co-creation is a\nMIT D-Lab\nsignature approach to engagement and international development.\n\nField trips get us out of the classroom and into the world. We will visit the Blue Hill Meteorological Observatory and learn about its history, its MIT alumnus founder, continuous temperature records extending back to the 19th century, and its historic instrumentation still in use together with modern instrumentation. Next, we will visit some of the Massachusetts Water Resources Authority's storm-water management sites, including the Charles River dam and some combined sewer overflows. Our third field trip will be to the town of Hull, which produces 10% of the town electricity needs, the equivalent of 1,100 homes and all of the traffic lights. It does so through Hull Wind 1--a 150-foot tall structure with a 0.66-megawatt generating capacity--which is the first of two wind turbines, and Hull Wind 2 installed in 2006 in a different part of town. Our final field trip will be to Susan's home to see, in action, a home-based solar electric, solar thermal, and geothermal system. All of these field trips will enrich our appreciation of water's role in ecosystem function and climate science, adaptation, mitigation, and transformation opportunities.\n\nWe welcome students of all ages, nationalities, religions, and gender orientations, both undergraduate and graduate, from MIT and beyond MIT. We are excited to engage with you in co-creating a meaningful and memorable class this spring 2019!\n\nCourse Highlights\n\nProject-based, experiential learning and close mentoring\n\nTransdisciplinary approaches\n\nHuman and planetary health foci\n\nCo-creation principles applied in designing Term Project solutions\n\nSeminars, discussions & guest lectures\n\nSelected water/climate/health film series offered on selected nights (optional attendance, bring your dinner!)\n\nField trips to local water/climate change/health sites: e.g. Blue Hill Meteorological Observatory, MWRA storm water management infrastructure, Hull Wind energy system, City Nature Challenge, and a low-carbon home visit\n\nTextbooks\n\nHawken, Paul. ed.\nDrawdown: The Most Comprehensive Plan Ever Proposed to Reverse Global Warming.\nPenguin Books, New York, 2017. ISBN: 9780143130444.\n\nMaslin, Mark.\nClimate Change: A Very Short Introduction.\n3rd Edition. Oxford University Press, Oxford, UK, 2014. ISBN: 9780198719045.\n\nGrading\n\nAssignment\n\npercentage\n\nParticipation\n\n30%\n\nTutorial\n\n10%\n\nTerm Project\n\n40%\n\nD-Lab Showcase Final Event\n\n15%\n\nExtra Credit\n\n5%\n\nActive Participation\n\nActive class participation is highly valued and reflected in your grade. Participation includes regular attendance and engagement in the assignments, active involvement in class discussions, group exercises, and teamwork. Class participation also includes completing assignments on-time and being ontime to class. Students missing a class are asked to inform the instructors. Attendance at field trips during class time is required. Attendance at field trips during non-class time is optional, but strongly encouraged.\n\nTutorial\n\nThe tutorial is an opportunity to pick a topic of your choice from the universe of topics pertaining to the subjects of water, climate change, and health and share that with the class. The tutorial will be undertaken either with one teammate, or individually. It can be done in any format of your choice, with creative, non-traditional pedagogies (eg. demos, games, workshops, or other activities) most welcome.\n\nTerm Project\n\nIn teams or individually, students will develop small- or global-scale term projects on water, climate change, and health solutions. You and your team decide on the format--a model, a video, a website, an app, a proposal, an artistic expression, a research paper, a competition entry. This can take any form. Each person or team will receive close mentoring as projects evolve. Every class project will have three deliverables, one per month of the term. There will be opportunities to present your term projects and get feedback from the class and/or mentors in varying stages of project evolution.\n\nD-Lab Showcase\n\nThe D-Lab Showcase will feature all the spring term D-Lab class projects. Mark your calendars! This is a required event! It will be an opportunity to present the \"final\" version of your Term Project. Course instructors and peers will provide feedback on your work.\n\nExtra Credit\n\nStudents will receive a feedback on their second and third deliverables (see\nCalendar\n). After receiving their third deliverable feedback, students will have an opportunity for students to further develop their work for extra credit and hand it in one final time. There is no final exam in this course.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate Change, and Health, Lec 9: One Health",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/6b77b056c8059d0b5a5b003c99be3d75_MITEC_719S19_lec9.pdf",
      "content": "ONE HEALTH\nHellen Amuguni DVM, MA, PhD\nDepartment of Infectious Disease and Global Health\n\nONE HEALTH GOALS\n(c) United Nations. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nONE HEALTH\nTake 3 minutes to think about and legibly\nwrite down on separate post-it notes the\nanswers to the following questions:\nTake\nDefine what One Health approach means\nDefine\nIdentify two examples of One Health in\npractice\nIdentify\nIdentify two advantages to multiple disciplines\nworking together to promote One Health\nIdentify\n\nONE HEALTH\nCollaborative effort of multiple disciplines\nworking locally, nationally and globally to\nattain optimal health for humans, animals and\nthe environment\n- AVMA One Health Initiative Task Force\nOne Health approach has been advocated as\nthe global framework for strengthening\ncollaboration and capacities of the sectors\nand actors involved in health service delivery.\n\nGOAL\n- Foster an understanding of One Health principles and concepts and how One Health\ncan be applied to create stronger and more efficient integrated health systems with\ninputs from multiple stakeholders in addressing global health issues\n- Gain an understanding of the interactions of humans, animals and environment in an\necosystem, appreciate the influence of these interactions on health of humans, animals\nand environment as well as the risks of disrupted ecosystem services on human and\nanimal health and some of the policies governing ecosystem health\n\nCHARACTERISTICS\nHARACTERISTIC\nOF WICKED\nOF WICKED\nOF WICKED\nPROBLEMS\nToo complex to\nfully understand\nNo simple\ntechnical\n\"solution\"\nActions precipitate\nunanticipated and\nunintended\nconsequences\nCompelling and\ndemand action\nRequire innovative\napproaches\n\nSYSTEMS THINKING IS\nIMPORTANT\n- In deciphering the complexity of\npublic health issues\n- Identifying multifaceted problems\n- In applying this understanding to\ndesign and evaluate\ninterventions\n- Generate solutions\n- Way forward for operating\nmore effectively and successfully\nin complex real world settings\n\nASIAN VULTURE CRISIS\n- https://www.youtube.com/watch?v=3hMMrTw621w\n-\nhttps://www.youtube.com/watch?v=59OIdukZQZY\n\nRAPID RESEARCH TOPICS\n- Will these efforts be sufficient to preserve\nthe vultures? Why/why not?\n- What other concerns are there which\nremain unaddressed or insufficiently\naddressed?\n- Why have vulture populations continued\nto decline at 30-70% per year?\n- What challenges/ international\nimplications does the use of NSAIDS in\nlivestock present in India? In Africa?\nGlobally?\n\nPART A\n- What value do vultures bring to the\nsubcontinental ecosystems?\n- Besides a virus, what could be killing\nvultures?\n- What other steps should the teams\ntake to discern the cause of the\nvultures' decline?\n\nPART B\n- What are the challenges to reducing\nthe vultures' exposure to diclofenac?\n- What strategies should be used to\nkeep vulture populations at ecologically\nfunctional levels in the subcontinent?\n- What are some possible solutions to\nthe crisis?\n\nCASE STORY\n- By 2007 ,India had lost 97% of its vultures\n- Dead and dying vultures- collapsed from trees\n- India, Pakistan, Nepal and Now Europe\n- Their absence has affected many sectors, including human health, the\nfertilizer production industry, water provision, and waste management.\n- Losing vultures has cost India an estimated 34 billion dollars in damages\n((RSBP) 2013).\n- Contaminated by residual pharmacologic agent given to livestock\n- Diclofenac-NSAID-highly effective, low cost\n- Widely used in humans- pain /arthritis and animals\n\nTHEMES\n- Use of Diclofenac: NSAID: What is the pharmacology, use, mechanism of action of\nthis drug and other NSAID and effects/long and short term\n- Elimination of the vulture and consequences\n- Obligate scavengers\n- Cultural and religious implications: Vultures culturally respected in India-Hinduism-\nto the level of a god, Parsee religion- disposition of dead bodies\n- Keystone species: Provides a valuable ecosystem service- consuming dead animals:\nThe estimated 100 million plus vultures living in India in the 1990s consumed\napproximately 20 million tons of carrion each year ((SAVE) 2016\n- Carcass clean up of bones for fertilizer use\n- Stakeholders: governments, conservation groups, drug companies, religious groups,\nfertilizer companies\n- Scientific evidence to affect conservation efforts and policy implications\n\nTHEMES CONTINUED\n- The potential impacts: water and sanitation concerns, dog bites, and increased rat populations.\n-\nVultures are not affected by anthrax due to their specialized digestive systems, and their speedy\nconsumption of carcasses reduces the opportunity for anthrax bacteria to sporulate and contaminate\nthe environment (Pain et al. 2003).\n- Feral dog and rat populations increased, begun taking over carcass dumps in the absence of vultures .\nIncreased numbers of feral dogs and rats represented potential problems in rabies and bubonic\nplague control. These human health risks amplified the importance of India's vultures to the human\necosystem, in addition to their role in the larger ecosystem.\n- In 2014, the World Health Organization reported that 36% of all rabies cases globally occurred in\nIndia alone, or 18-20,000 deaths from rabies\n- Political and legal changes, as well as effective enforcement of any new laws.\n- August 2006, manufacture of diclofenac for veterinary use was formally banned by the Drug\nController General of India\n- Compliance-still available for human use\n\nEXAMPLES OF ID THREATS OF ONE\nHEALTH SIGNIFICANCE\n\nPLAGUE IN MADAGASCAR\nImage is in the public domain.\n\nSALMONELLA\nINFECTIONS\nLINKED WITH\nMARADOL PAPAYAS\nHIT 23 STATES\nCourtesy of wuestenigel on Flickr Used under CC BY..\n\nMARBURG VIRUS\nIN UGANDA\nCourtesy of CDC/Frederick Murphy. Image is in the public domain.\n\nMONKEY\nPOX IN\nNIGERIA\n\nAVIAN\nINFLUENZA\nRETURNED TO\nCHINA\nCourtesy of CDC/ Shuqing Zhao, China.\nImage is in the public domain.\n\nCourtesy of Wolters Kluwer Medknow Publications. Used under CC BY-NC-SA.\n\nCourtesy of /\"4\". *NBge is in tIe QuCMiD doNBin.\n\nMONKEY POX OUTBREAK IN THE US IN\nhttps://www.youtube.com/watch?v=6Ui3gs56p2I\n\na /BtioOBM\"DBEeNZoG4DieODes. \"MM rigIts reserWed. 5Iis\nDontent is eYDMuded froN our CreBtiWe CoNNons MiDense.\n'or Nore inforNBtion see\nIttQsoDw.Nit.eEVIeMQGBRGBirVse\n\nCATS IN BORNEO\nhttps://www.youtube.com/watch?v=17BP9n6g1F0\n\n(c) Timothy Bouley/PreventionWeb. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nCHARACTERISTICS\nHARACTERISTIC\nOF WICKED\nOF WICKED\nOF WICKED\nPROBLEMS\nToo complex to\nfully understand\nNo simple\ntechnical\n\"solution\"\nActions precipitate\nunanticipated and\nunintended\nconsequences\nCompelling and\ndemand action\nRequire innovative\napproaches\n\nONE HEALTH\nCollaborative effort of multiple disciplines\nworking locally, nationally and globally to\nattain optimal health for humans, animals and\nthe environment\n- AVMA One Health Initiative Task Force\nOne Health approach has been advocated as\nthe global framework for strengthening\ncollaboration and capacities of the sectors\nand actors involved in health service delivery.\n\nONE HEALTH\n- An interdisciplinary strategy to address health from an\nintegrated perspective rather than a discipline-based\nfragmented perspective ....\n- Is not a discipline, it's an approach\n\nONE HEALTH IN ACTION\nhttps://www.youtube.com/watch?v=TG0pduAYESA\n\nWHY DO WE NEED AN INTEGRATED\nAPPROACH?\n\nEMERGING\nINFECTIOUS\nDISEASES: MAJOR\nGLOBAL THREAT\nWolfe et al.\nOrigins of\nmajor\nhuman\ninfectious\ndiseases\nNew evidence on origins of human\nmalaria\nJones, et al\nGlobal\ntrends in\nemerging\ninfectious\ndiseases\nOn the rise - 335 (1940-2004)\n60.3% are zoonotic\n- 71.8% from wildlife\n\nEMERGING DISEASES\nNOT JUST HUMANS....\n- Avian Influenza H5N1\n- 475 humans : how many birds ?\n- BSE & Chronic Wasting Disease\n- Tuberculosis in wildlife reservoirs\n- Chytridiomycosis in amphibians\n- Morbillivirus in marine mammals\n- White-Nose Syndrome in bats\n\nSHRINKING HABITATS\nMacaques and transmission of malaria\nin Indonesia\nCourtesy of jinterwas on Flickr. Used under CC BY.\n\nPOLLUTION\nCourtesy of David Burdick/NOAA. Image is in the public domain.\n\nLOSS OF\nBIODIVERSITY\n\nCLIMATE\nCHANGE\n\nGLOBALIZATION AND TRAVEL\na sourDe unLnown. \"MM rigIts reserWed. 5Iis Dontent is eYDMuded froN our CreBtiWe CoNNons MiDense.\n'or Nore inforNBtion seeIttQsoDw.Nit.eEVIeMQGBRGBirVse\n\nGLOBAL TRADE OF WILDLIFE\nTiger: Courtesy of Dave Pape at English Wikipedia. Used with permission.\nApe: Courtesy of deepphoto on Flickr. Used under CC BY.\nTurtle: Courtesy of mentalblock on Flickr. Used under CC BY-NC-SA.\n\nBIO-TERRORISM\nAS PART OF THE\nTHREAT\nCourtesy of CDC/Laura Rose. Image is in the public domain.\n\nHUMAN BEHAVIOR\n- Sexually transmitted diseases increased three fold when\nminimum age for teenagers having sex dropped\n- The development of complacent attitudes and lack of basic\nknowledge about risks have led to re-emergence of Syphilis\nin the UK\n- Sharing of blood contaminated needles by drug users has\nled to spread of hepatitis B and C\n- Increased popularity of body piercings and tattoos provides\nan opportunity for the spread of blood borne viruses\n\"Human behavior flows from\nthree main sources: desire,\nemotion, and knowledge.\"\n- Plato\n\nCourtesy of www.iiste.org. Used under CC BY.\n\nANIMAL HEALTH, HUMAN HEALTH, AND\nENVIRONMENTAL HEALTH ARE AT THE CORE OF\nONE HEALTH\nAnimal\nhealth\nHuman\nhealth\nEnvironmental\nhealth\nWater\nsanitation &\nhygiene\nFood safety &\nsecurity\nSustainable\nAgriculture\nPolicy\nClimate change\nClean energy\nsolutions\nUrbanization\nOccupational\nhealth\nBiotechnology\nDisease\nsurveillance\nZoonotic\ndisease\nmanagement\nVector born disease\nand entomology\nHow we enter One\nHealth\nAreas of focus within\nOne health\nWho is involved\nBiosecurity\nAnti-microbial\nresistance\nDrivers of One Health include...\n-\nLand Use\n-\nEconomic Development\n-\nGlobalization\n-\nEnergy Use\n-\nMigration\nInfluences of One\nHealth include...\n-\nCulture\n-\nEconomics\n-\nPolicy\n-\nBehavior\n-\nEducation\nA number of fields are\ninvolved within and\nbeyond health...\n-\nComparative medicine\n-\nSocial science\n-\nEcology\n-\nEngineering\n-\nEarth science\n-\nPrivate sector\n-\nPolitics\n-\nMany more...\n\nSCOPE OF ONE HEALTH\nCombating existing and emerging diseases and zoonosis, biomedical research\nand clinical medicine, conservation medicine, diagnosis ,surveillance, control ,\nresponse and recovery directed at natural and or intentional threats that are\nchemical , toxicological or radiological in nature, ethics, entomology food safety\nand security, global food and water systems, global trade and commerce, health\nof the environment and environmental conservation, implications of climate\nchange, infectious disease ecology and integrated systems for disease detection,\nland use production systems and practice, mental and occupational health,\npublic health , awareness and communication, support of biodiversity, wildlife\npromotion and conservation\n\nREDEFINING HEALTH\nTHROUGH\nTRANSDISCIPLINARY\nCOLLABORATION\nSocial\nCultural\nEnvironmental\nPhysical\nCharacteristics of human animal and environmental health\n\nTHANK YOU!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate Change, and Health, Lecture 5: Climate Modelling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/fd0ec78d51355bc019bc18007098da9f_MITEC_719S19_lec5.pdf",
      "content": "Atmospheric and Oceanic\nGeneral Circulation Models\n(AOGCMs)\nKasturi Shah\n\nQuick introductions:\n1. Name\n2. What you study\n3. UG/G\n4. Why this class?\n5. Any particular interest in\natmospheric/ocean/climate circulation?\n\nStructure of the lecture:\n-\nWeather versus climate\n-\nHow are climate models used?\n-\nClimate modelling under RCP scenarios (reading)\n-\nBreaking down a climate model\n-\nGoverning equations\n-\nBroad atmospheric/oceanic circulation patterns\n-\nPiecing components together\n-\nWhat does it cost to run a climate model?\n-\nSources of uncertainty in climate models\n-\nExample: Possible climate transitions from breakup of stratocumulus decks\nunder greenhouse warming, Nature, 2019.\n\nWeather v.s. Climate\nCourtesy of Climate Central. Used with permission.\n\nHow are climate models used?\n-\nDecision-making:\n-\nHow high to build a sea-wall in Miami FL?\n-\nNeed to know: how high sea level is rising and how storm surge is change over the next\n30 to 70 years.\n-\nHow large to make an irrigation dam in Egypt?\n-\nNeed to know: how precipitation frequency and intensity is changing and how\nevaporation is changing\n-\nWhat global emissions target should be set to keep global temperature rise under 2oC\n-\nNeed to know climate sensitivity.\n-\nHow does changing climate affect food security in India?\n-\nHierarchy of models: Need to know how temperature and precipitation will change over\nnext few decades, sensitivity of main crops to these parameters, whether growing\nregions of crops are in areas prone to changing climate and/or extreme weather\n-\nHow likely is it that a hurricane like Hurricane Harvey will occur again? Which will be\nthe worst affected areas?\n\nHow are climate models used?\n-\nScientific enquiry:\n-\nHow do volcanic eruptions affect the formation and destruction of stratospheric ozone?\n-\nHow do changing climate conditions affect glacial mass balance and freshwater supply?\n-\nHow do increasing temperatures affect the spread of ticks?\nCourtesy of Climate Central. Used with permission.\n\nRCPs:\nRepresentative Concentration Pathways\n\nRCPs: Radiative Balance\nRadiative forcing is the\ndifference between\nthe amount of energy\nfrom the sun entering\nthe earth system vs\nthe amount reflected\nback.\nCourtesy of 7renEerth and )asullo. Used under CC %<.\nTrenberth et al., 2009\n\nRepresentative Concentration Pathways (RCP)\n2.6\n4.5\n6.0\n8.5\nEmissions\nTemperatures\nExtreme weather\nEnd of civilisation\n\nShared Socioeconomic Pathways (SSPs)\nWhy new scenarios for climate change research?\n·\nSocio-economic scenarios used to derive emissions without (baseline scenarios) and with\nclimate policies (mitigation scenarios)\n·\nEmissions scenarios used to derive climate chang eprojectsion\n·\nClimate change projectsions and socio-economic scenarios used to evaluate climate\nimpacts and adaptation measures\nPrevious set of socio-economic scenarious are 15 years old (SRES, 2000).\nNew socio-economic scenarios are needed (SSPs)\nUNFCC\n\nShared Socioeconomic Pathways (SSPs)\nCourtesy of O'Neill et al. Used under CC-BY.\nSSP1: low challenges for mitigation\n(resource efficiency) and adaptation\n(rapid development)\nSSP3: high challenges for mitigation\n(regionalized energy / land policies)\nand adaptation (slow development)\nSSP4: low challenges for mitigation\n(global high tech economy), high for\nadapt. (regional low tech economies)\nSSP5: high challenges for mitigation\n(resource / fossil fuel intensive) and\nlow for adapt. (rapid development)\nFrom \"The Shared Socio‐Economic Pathways UNFCC\n(SSPs): An Overview\"\n\nBreaking down a climate model:\nGoverning equations\n\nAtmosphere and ocean are thin fluids\n10km atmosphere\n10km ocean\nEarth radius\n6371 km\n\nEquation of motion for rotating fluid: Navier-Stokes\nadvection\ntime-derivative\npressure gradient\nCentrifugal force\nCoriolis force\ndiffusion\nMass continuity:\n\nFor the atmosphere, thermodynamic considerations:\n3 main thermo\nvariables:\nTemperature\nMoisture\nEntropy\nVallis Notes\n\nOne-dimensional radiative-convective model\nThe equilibrium state of an atmospheric column for which any net loss or gain of radiant\nenergy is balanced by the vertical transport of latent or sensible heat.\nINPUT PARAMETERS:\nOUTPUT:\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nOne-dimensional radiative-convective model\nSTRATOSPHERE\nTROPOSPHERE\n\nIn each of the boxes we\nsolve the following\nequations, applying\nboundary conditions\nand where appropriate\nmaking\napproximations:\n- Momentum eqn\n- Mass continuity eqn\n- Thermodynamic eqn\n- Chemical continuity eqns\n(c) John Wiley & Sons, Inc. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\nSlide courtesy of\nMegan Lickley\n\nWhat goes into a general circulation model (GCM)?\n- Atmosphere general circulation model\n- Ocean general circulation model\n- Sea ice model\n- Land model\n- Chemistry\nAdapted from Prof. Kerry Emanuel\n\ngfdl.noaa.gov\n-\n3D model\n-\nHighly complex and\ncomputationally expensive\n-\nEach model differs in resolution\nCourtesy of NOAA. Image is in the public domain.\n\nAtmospheric Circulation\nNASA\n\"FERREL\nCELL\"\n\"FERREL\nCELL\"\nCourtesy of NASA. ,maJe is in the puEliF domain.\n\nWhat exactly does a climate model compute?\n- At each grid point:\n- 10-15 variables\n- 20 levels\n- Grid points spaced ~ 120 km apart\n- → 1,000,000 - 5,000,000 variables over the globe\n- Typical time step: 20 minutes\n- → 70,000,000 - 350,000,000 variables simulated per day\nEstimates by Prof Kerry Emanuel, Fall 2017\n\nWhat exactly does a climate model compute?\nCourtesy of けんけん +*5. Used under CC %<.\nEarth simulator at JAMSTEC Yokohama Institute for Earth Sciences\n\nCourtesy of 1$6$. ,maJe is in the puEliF domain.\n\nSources of Uncertainty in Climate\nModels\n\nSources of Uncertainty in Climate Models\n- Cloud microphysics\n- Thin/broken clouds\n- Convection\n- Boundary layer (e.g.\natmosphere/ocean)\n- Aerosols and chemistry\n- Turbulence\n- Sea ice\n- Land ice\n\nPropagating uncertainty in climate models\n-\nToo coarse of a time step\n-\nToo coarse of spatial resolution\n-\nIncomplete/inaccurate representation of feedbacks\n-\nNatural variability\n-\nKnown unknowns\n-\nUnknown unknowns\nSlide courtesy of Megan Lickley\n\nSee video of LES simulation\nat https://doi.org/10.1038/\ns41561-019-0310-1\n\nAny questions?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate Change, and Health, Lecture 7: Climate Change, Human, and Planetary Health Through the Lens of Water",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/10939816b6f33c7474646f98f74755ca_MITEC_719S19_lec7.pdf",
      "content": "Climate Change, Human and Planetary Health\nthrough the Lens of Water\nSusan Murcott\nD-Lab: Water, Climate Change and Health\n\nhttps://www.weforum.org/agenda/2019/01/our-house-is-on-fire-16-year-old-greta-thunberg-speaks-truth-to-power/\n16 year-old Greta Thunberg at the Davos World Economic Forum\nJan. 25, 2019\n(c) World Economic Forum. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nhttps://www.youtube.com/watch?v=EAmmUIEsN9A\nGreta Thunberg, Stockholm\nSchool strike for climate - save the world by changing the rules\n(c) TEDx Talks. All rights reserved.\nThis content is excluded from our Creative Commons\nlicense. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nLecture Outline\n- How much water on Earth?\n- A Living Planet? What is Life?\n- Some Conditions for Life on Earth\n- Climate Change Impacts, esp. the Role of Water\n- Human Health, Planetary Health\n- Solutions\n- Water, Climate Change & Health Actions\n- Puerto Rico\n- Nepal\n\nHow much Water on Earth?\n- Large sphere= all water on earth; 860-\nmiles in diameter sphere (1.4 Billion\nkm3).\n- Medium sphere = freshwater on earth\n= groundwater & surface water; 170\nmiles in diameter (11 Million km3) .\n- Small sphere = surface fresh water on\nearth; 34.9 miles in diameter (93,000\nkm3).\n- Ave. depth of ocean ≈ 1.7 mi. (2.7 km)\nhttps://www.usgs.gov/media/images/all-earths-water-a-single-sphere\n(c) Howard Perlman, Hydrologist, USGS, Jack Cook, Woods Hole Oceanographic Institution, Adam Nieman,\nIgor Shiklamonov. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nHow much Water on Earth? (MORE DETAIL)\nLarge sphere= all water on earth (1.4 Billion km3). Medium sphere = freshwater on\nearth (11 Million km3) . Small sphere = surface fresh water on earth (93,000 km3).\n-\nLarge sphere: represents all the water on earth - in\noceans, ice caps, lakes, rivers, groundwater, the\natmosphere, and living things. It has a diameter of\nabout 860 miles. That 860-mile-high sphere is the\nlargest bubble in the picture, which stretches from\nSalt Lake City, Utah to Topeka, Kan. It has a volume of\nover 332 million cubic miles.\n-\nThe 2nd, smaller blue sphere, over Kentucky - is\nabout 170 miles in diameter. It represents the world's\nliquid freshwater, including groundwater, lakes,\nswamp water, and rivers. However, 99 percent of that\nsphere is groundwater, much of which is not\naccessible to humans.\n-\nThe smallest sphere, represents the freshwater, all\nthe lakes and rivers on the planet. Most of the water\nthat people and ecosystems use every day comes\nfrom these surface-water sources. The diameter of\nthis sphere is a mere 34.9 miles, with a volume of a\nlittle over 22,000 cubic miles.\n(c) Howard Perlman, Hydrologist, USGS, Jack Cook, Woods Hole Oceanographic Institution, Adam Nieman,\nIgor Shiklamonov. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nBlue Marble -\nA Living Planet?\nEarth seen from\nApollo 17 on\nDec. 7, 1972\nCourtesy of NASA. Image is in the public domain.\n\nWhat is life?\n- Physicist's view: a reduction in entropy\n- Neo-Darwinist's view: organic growth and reproduction, with errors\ncorrected through natural selection\n- Biochemist's view: able to utilize energy, either from sunlight or food\nand to grow according to genetic instructions\n- Geophysiologist's view: a bounded homeostatic system, keeping its\ninternal conditions constant, despite changing external conditions.\nJ. Lovelock, Healing Gaia, 1991\n\nCharacteristics of Life Forms\nCharacteristic\nBacteria\nMammal\nTree\nBeehive\nLiving Planet\nEarth\nReproduction\n+\n+\n+\n-\n-\nMetabolism\n+\n+\n+\n+\n+\nEvolution\n+\n+\n+\n+\n+\nThermostasis\n-\n+\n-\n+\n+\nChemostatis\n+\n+\n+\n-\n+\nSelf-healing\n+\n+\n+\n+\n+\nJ. Lovelock, Healing Gaia, 1991\n\nSome Conditions for Life on Earth\n- Earth must be a certain distance from the sun for sufficient sunlight and\nheat\n- Relatively narrow temperature range\n- A supply of needed elements\n- Living creatures primarily composed of 4 elements: carbon, nitrogen,\noxygen and hydrogen.\n- Life requires materials that move about, permitting cycles.\n- Continual access to new sources of materials and the movement of used\nmaterials we call \"wastes\" to species that can use them for their own\npurposes\n- 4 great cycles\nLiebes Sidney et al., A Walk Through Time, 1998.\n\n4 Great Cycles on Earth\n-Lithosphere,\n-Hydrosphere\n-Atmosphere\n-Biosphere\n\nLithosphere, rock cycle\n- The lithosphere lies below\nthe crust.\n- Magma erupts from the\nlithosphere. Crust thickens\nand forms tectonic plates.\nPlates edges pushed up or\nunder other plates, melting\nmagma, which again erupts.\nLiebes Sidney et al., A Walk Through Time, 1998.\nhttp://www.differencebetween.net/science/differ\nences-between-the-earths-lithosphere-and-\nasthenosphere/\nThis work has been released into the public domain by its author, Booyabazooka at English Wikipedia.\n\nCrust\n-The Earth's crust ranges from\n5-70 kilometres (3.1-43.5 mi)\nin depth and is the outermost\nlayer. The thin parts are the\noceanic crust, which underlie\nthe ocean basins (5-10 km)\nand are composed of dense\n(mafic) iron magnesium\nsilicate igneous rocks, like\nbasalt.\nCourtesLJ of EA^A. /mage is in the pudlic domain.\n\nhttp://www.differencebetween.net/science/differences-between-the-earths-lithosphere-and-asthenosphere/\nLithosphere\nAsthenosphere\nThe lithosphere concept was proposed in 1911\nThe asthenosphere concept was proposed in 1926\nLithosphere is composed of the crust and upper most solid\nmantle\nAsthenosphere is composed of the upper most weaker part\nof the mantle\nLies beneath the atmosphere and above the asthenosphere Lies beneath the lithosphere and above the mesosphere\nThe physical structure consists of a rigid outer layer that is\ndivided by tectonic plates. It is regarded as rigid, brittle, and\nelastic.\nThe physical structure is mostly solid with some regions\ncontaining partially molten rock, which exhibits plastic\nproperties\nCharacterized as elastic and less ductile\nHas a higher degree of ductility than the lithosphere\nRanges from a depth of 80km and 200 km below the earths\nsurface\nExtends to a depth of 700km below the earths' surface\nApproximate temperature of 400 degrees Celsius\nApproximate temperature ranging from 300 to 500 degrees\nCelsius\nHas a lower density than the asthenosphere\nAsthenosphere is denser than the lithosphere\nAllows for conductive heat transfer\nAllows for advective heat transfer\nSeismic waves travel at faster speeds across lithosphere\nSeismic waves travel 5 to 10% slower in asthenosphere\nthan in lithosphere\nRocks are under much less pressure forces\nRocks are under immense pressure forces\nChemical composition consists of 80 elements and\napproximately 2000 minerals\nAsthenosphere is mainly composed of iron-magnesium\nsilicates\nDifferences between the Earth's Lithosphere and Asthenosphere:\n\nHydrosphere - Water Cycle\n- Begins with steam released from magma. As the earth cools the\nsteam condenses into rain. Rain forms rivers and pours into seas. As\nthe seas form, the surface water evaporates into clouds under the\nSun's heat, creating a cycle of weather driven by solar energy.\n- Later, living systems take an active role in the weather cycle. H2S gas,\nproduced by plankton, rises into the atmosphere. The molecules of\nthis gas form nuclei that attract water molecules and form raindrops.\nThus plankton seed the clouds.\n- Humans, huge consumers of plankton, keep it in check. But humans\nkill whales, while at the same time chemical runoff into the sea feed\nhuge blooms of new ocean plankton.\nLiebes Sidney et al., A Walk Through Time, 1998.\n\nWater is a Vital Component of the Climate Cycle\nOceans contain over 97% of Earth's water, 2% is in glacial ice, less than 1% in all the rest of Earth's reservoirs.\nThe hydrologic cycle, the continual recycling of water among all these reservoirs, including much smaller amounts cycling\nin the atmosphere, in plants, in lakes, in rivers, and in soil, is vital to the operation of the climate system.\nCourtesy of USGS. Image is in the public\ndomain.\n\nAtmosphere\n- Early Earth atmosphere may have\nbeen hot and loaded with\nmethane, ammonia, nitrogen,\ncarbon dioxide and water\n(scientists differ on its\ncomposition).\n- Large organic molecules formed\nfrom the early compounds.\n- Today's atmospheric composition\nis dramatically different, as it is\nbreathed in and out by living\nsystems\nLiebes Sidney et al., A Walk Through Time, 1998.\nhttps://scied.ucar.edu/atmosphere-layers\nCourtesy of NOAA. Image is in the public domain.\n\nBiosphere\n- Science has been largely reductionist, focusing on\nindividual units, on parts of system.\n- James Hutton, in 1785 called the Earth a living\nsuperorganism.\n- Another exception is the Russian geologist Vladimir\nVernadsky, who defined life as a geochemical\nprocess, Earth's crustal rock in solid form or as\nsand and dust transforming into living matter, then\nback into rock, a kind of planetary metabolism or\nbiochemical process.\n- James Lovelock updated these ideas with his\ncontroversial \"Gaia hypothesis,\" stating that living\nand non-living systems of Earth are tightly coupled\nand that life creates its optimal conditions by\nregulating surface temperatures and chemical\nbalance in soils, seas and atmosphere.\nLiebes Sidney et al., A Walk Through Time, 1998.\nThis view of Earth highlights biological activity -\nspecifically, the amount of photosynthesis happening.\nHigher chlorophyll concentrations in the ocean are\nindicated with green, yellow, and red colors. The\namount of vegitation on land is indicated with\nincresingly deep shades of green. (SeaWiFS Project,\nNASA/Goddard)\nImage is in the public domain.\n\nClimate Change Impacts,\nespecially the Role of Water\n\nClimate Change Impacts\nM. Maslin, Ch. 5.\n- Coastal flooding\n- Storms and floods\n- Heat waves and drought\n- Human health\n- Biodiversity\n- Agriculture\n- Ocean acidification\n[Graph of hunger, malaria, and flooding risk vs. global\ntemperature increase removed due to copyright\nrestrictions. Maslin, Mark. Climate Change: A Very\nShort Introduction. 3rd Edition. Oxford University\nPress, Oxford, UK, 2014. Ch. 5.]\n\nClimate Change Impacts\nRisk of Water Shortage\nM. Maslin, Ch. 5. p. 70\nThis figure shows that the\nrisk of water shortage\nchanges dramatically at a\nglobal temperature increase\nabove pre-industrial levels\nover 2 degrees C.\n[Graph of water shortage risk vs. global temperature\nincrease removed due to copyright restrictions.\nMaslin, Mark. Climate Change: A Very Short\nIntroduction. 3rd Edition. Oxford University Press,\nOxford, UK, 2014. Ch. 5.]\n\nIPCC 2014 Climate-Related Drivers of Impacts\n- 7 of 10 climate-related drivers of impacts pertain directly to water.\n- This suggests that it is vitally important to understand the role of\nwater in climate change.\nClimate Change - 2014. IPCC AR5, WGII \"Impacts, Adaptation & Vulnerability\" p.21\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nWater-Related Drivers of Impacts\n(subset from previous slide)\n- Drying trends\n- Precipitation / Extreme\nprecipitation\n- Snow cover\n- Damaging cyclones\n- Sea level rise\n- Ocean acidification\nClimate Change - 2014. IPCC AR5, WGII \"Impacts, Adaptation & Vulnerability\" p.21\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAssessment Box SPM.2 Table 1,\nIPCC_AR5_WG2_pp.21-25\n- Stress on water resources\n- Stress on freshwater and terrestrial ecosystems\n- Food production\n- Vector and water borne diseases\n- Flooding\n- Water availability in arid and glacial meltwater areas\n\nAssessment Box SPM.2 Table 1 | Key regional risks from climate change and the potential for reducing risks through adaptation and\nmitigation. Each key risk is characterized as very low to very high for three timeframes: the present, near term (here, assessed over\n2030-2040), and longer term (here, assessed over 2080-2100). In the near term, projected levels of global mean temperature\nincrease do not diverge substantially for different emission scenarios. For the longer term, risk levels are presented for two\nscenarios of global mean temperature increase (2°C and 4°C above preindustrial levels). These scenarios illustrate the potential for\nmitigation and adaptation to reduce the risks related to climate change. Climate-related drivers of impacts are indicated by icons.\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAssessment Box SPM.2 Table 1, IPCC_AR5_WG2_pp.21-25\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAssessment Box SPM.2 Table 1 | Key regional risks from climate change and the potential for reducing risks through adaptation and mitigation. Each key risk is\ncharacterized as very low to very high for three timeframes: the present, near term (here, assessed over 2030-2040), and longer term (here, assessed over 2080-2100).\nIn the near term, projected levels of global mean temperature increase do not diverge substantially for different emission scenarios. For the longer term, risk levels are\npresented for two scenarios of global mean temperature increase (2°C and 4°C above preindustrial levels). These scenarios illustrate the potential for mitigation and\nadaptation to reduce the risks related to climate change. Climate-related drivers of impacts are indicated by icons.\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAssessment Box SPM.2 Table 1, IPCC_AR5_WG2_pp.21-25\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nAssessment Box SPM.2 Table 1, IPCC_AR5_WG2_pp.21-25\n(c) IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nClimate Change, Water & Sanitation (2016)\nWater Risks\nSanitation Risks\nFlooding damage to water supply infrastructure\nFlooding damage to sanitation infrastructure\nWater scarcity (due to changing patterns of\nprecipitation and increased demand pressure)\nReduced carrying capacity of bodies of water receiving\nwastewater\nWater quality change\n\"Climate change represents the most significant challenge of the 21st c and poses a\nrisk to water and sanitation\" p. 253\n\"Relatively little attention has been paid to how these threats will impact drinking\nwater and sanitation, despite their importance to human health.\" p. 255\nRef: Howard, G. et al. Climate Change and Water & Sanitation (2016)\n\nClimate Change and Human Health\n- Increased temperature -> increased diarrheal disease\n- Extreme weather -> outbreaks due to drinking water contamination\n- Climate change will likely increase cholera outbreaks in Bengal Delta\n- Climate change may affect non-communicable diseases, such as\nhypertension (p 257)\n- Significant association was found between patients with\ngastrointestinal disease and floods in Mass.\nRef: Howard, G. et al. Climate Change and Water & Sanitation (2016)\n\n1. Water-related diseases\n2. Water & food shortages\n3. Impact on water for multiple (productive) uses\n4. Impact on surface and ground waters\n5. Impacts on oceans & fisheries\nSome water-related\n& health-related risks\nfrom climate change,\narranged on a scale,\nfrom human-scale to\nplanetary- scale\n6. Infrastructure damage from extreme\nweather, floods, sea level rise\n7. Impact on watersheds, ecosystem services\n8. Biodiversity\n9. Impact on atmosphere\n10. Impact on planetary health\n\nSome Frameworks for Action on Climate Change\nSolutions\nIPCC AR5,\nWG2 & WG3\n(1)\n(3)\n(2)\nDrawdown: The\nMost\nComprehensive\nPlan Ever\nProposed to\nReverse Global\nWarming\nStabilization Wedges:\nSolving the Climate\nProblem for the Next\n50 Years with Current\nTechnologies\n\n-\nOn September 25th 2015, 193 member countries adopted a set of goals to end poverty, protect the planet,\nand ensure prosperity for all as part of a new sustainable development agenda.\n-\nEach goal has specific targets to be achieved over the next 15 years.\n(4)\n(c) United Nations. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nSDG Goal 6 - Clean Water and Sanitation\nSDG 6 defines \"safely managed drinking water\" as:\n-\nLocated on premises\n-\nAvailable when needed\n-\nFree from fecal contamination and priority chemical contamination (e.g. arsenic and fluoride)\n(c) United Nations. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nLancet\nCommission on\nPlanetary Health\nFramework\nHuman Health is\nDependent on\nEnabling\nInfrastructure and\nthe Natural\nEnvironment\n(Planetary Health)\nFig. 20. Sustainable Development Goals Arranged by Themes --Human Health, Infrastructure and\nNatural Environment (Planetary Health)\nNote: Goal 17 is outside the framework as it is an enabling goal. Adapted from Waage & colleagues.\n(5)\nCourtesy of Waage et al. Used under CC-BY.\n\n(6) ONE HEALTH\nCollaborative effort of multiple\ndisciplines working locally, nationally and\nglobally to attain optimal health for\nhumans, animals and the environment\nAVMA One Health Initiative Task Force\nHellen Amuguni\nAsst Prof. Infectious Diseases and Global Health\nCummings School of Veterinary Medicine, Tufts\n\nDiscussion Questions: Planetary Paradigms\n- Copernicus and Galileo: Scientific evidence for a heliocentric\nsolar system vs. Christian Biblical faith paradigm\n- Scientific evidence for climate change vs. Political and financial\nand consumer material well-being dependent on fossil fuels.\n- Why is \"Gaia Hypothesis\" controversial?\n\nTwo Water Case Studies (Susan's work)\n-Puerto Rico - 2017-2018\n-Nepal 2000-2005 & Jan. 2019\n\nCase Study - Impacts of Hurricane Maria in\nPuerto Rico\nImmediate/Short-term impacts:\n- physical injury or death\n- drowning\nMedium- and long-term impacts:\n- limited access to food and safe water\n- contamination of water and food sources from waste, debris, and other pollution\n- disruption of services at hospitals, clinics, and other care facilities\n- reduced ability to access health care, medicines or other essential health items\n- increased risk from infectious diseases due to lack of safe water, adequate hygiene, and sanitation\n- growing burden from unaddressed chronic disease care needs, such as cancer and diabetes\n- mental health issues including stress, depression and suicide\nRef: Website of the Kaiser Family Foundation: https://www.kff.org/other/issue-\nbrief/public-health-in-puerto-rico-after-hurricane-maria/\n\nSome Design & Development\nDefinitions\n\nPhilosophy - Creative Capacity\nBuilding\nPertains to\n2nd case\nstudy on the\narsenic\nremediation\ndone by\nSusan's MIT\nteam, and\nespecially by\nLumbini\nFilter\nIndustries\n\nArsenic Biosand Filter and the Kanchan Filter in\nNepal\nThis picture shows a Terai-\nregion school-girl drinking safe\nwater from the Kanchan\nArsenic Filter.\nHaving \"discovered\" arsenic in\ndrinking water in the Terai\nregion of Nepal, the arsenic\nbiosand filter and the Kanchan\nfilter was invented by my team\nto address it.\n\nI learned about the need for safe and accessible\nwater from these women and others like them\n\n2nd Intern'l Women & Water Conference - Kathmandu, Nepal\nSeptember 1998\n\nParasi, Nepal,\nIAP, 2001\nAmy Smith, Jessie Hurd, Tim Harrison\nMeghan Smith Jessie Hurd, Susan\nMurcott (not shown: Lincoln Lee Nat\nPaynter\n\nJan. 2001: Amy & Jessie lived here in Parasi, Lumbini\nZone, Nawalparasi District during, mostly on the porch\n\nBy coincidence, the well in the back yard of this house in Parasi,\nNepal, had the highest arsenic found to date at that time in Nepal.\n\nJessie Hurd applied irons filings (from PA) in her arsenic treatment\npilot study, the first arsenic remediation studies in Nepal, and Susan &\nJessie searched for local iron products to substitute for the \"imported\"\narsenic adsorption media\nLocal market street where Susan\nand Jessie shopped for\nappropriate for iron products\n\nJessie's Three-Kolshi (Gagri) System\nRaw water\nIron\nfilings\nFine\nsand\nFiltered\nwater\n\nFrom 2001-2005, we researched and tested\n8 different arsenic removal technologies\n- (1) 3 Kolshi (in Nepali = 3 Gagri with zero valent iron\nfilings);\n- (2) Iron filings in jerry can;\n- (3) Coagulation/Filtration (2-Kolshi based on Chakraborti's\narsenic removal system);\n- (4) Iron oxide coated sand;\n- (5) Activated alumina metal oxide #1 (Apyron Inc.);\n- (6) Activated alumina metal oxide #2 (Aquatic Treatment\nSystems Inc.);\n- (7) Arsenic treatment plant;\n- (8) KanchanTM Arsenic Filter\n\nJerry Can\n1. Fill 10 L plastic jug\nwith raw water.\n2. Add iron\nfilings\n3. Wait 3 hours\n4. Decant treated\nwater\n\nCoagulation/Filtration (2-Kolshi)\nRaw Water\nChemical packet\nMixing & Settling\nFiltration\nTreated\nWater\n\nIron Oxide Coated Sand (IOCS)\nRaw Water\nSand and gravel\nIron Oxide Coated\nSand (IOCS)\nTreated Water\n\nActivated Alumina Metal Oxide #1\n(Apyron Aqua-Bind Media)\nInfluent\nEffluent\nGAC\nSand\nActivated\nAlumina\nRaw Water\nTreated Water\n\nRaw Water\nAlumina Manganese\nOxide (A/M)\nTreated\nWater\nActivated Alumina Metal Oxide #2\n(Aquatic Treatment Systems, Inc.)\nActivated Alumina Metal Oxide #2\n\nArsenic Treatment Plants (ATPs)\nAeration\nChamber\nSand\nFilter\nStorage\nTreated Water\n\nKanchanTM Arsenic Filter (KAF) -\ninvented by Tommy Ngai & team in 2002\n\nArsenic Biosand Filter Components\n\nPlastic Version of the Arsenic\nBiosand Filter (branded \"Kanchan\")\n\nCoagulation/\nfiltration\nSystem\n(2-Kolshi)\nArsenic\nBiosand\nFilter\n3 Kolshi\n12 Month Pilot Study of 3 Arsenic Removal Technologies\ny\n\nPhase II Evaluation Summary\n= poor\n= moderate\n= good\nBest\n3rd\n2nd\nOverall Ranking\nLow running cost\nUser acceptance\nLow initial cost\nLong-term sustainability\nSimple O&M\nEasy construction\nMaterials availability\n10-15L/hr\n1-5L/hr\n3-5L/hr\nFlow rate\n93-99%\nNot tested\nNot tested\nIron removal\n90-95%\n80-90%\n95-99%\nArsenic removal\nAs Biosand\n2-Kolshi\n3-Kolshi\ny\n\nTechnical Indicators\nAverage Results\nArsenic Removal\n93 %\nTotal Coliform Removal\n58 %\nE. Coli Removal\n64 %\nIron Removal\n93 %\nFlow Rate\n14 L/hr\nArsenic Biosand Filter 12 Mo. Pilot Study Results\n(n=16)\n\nEntrepreneur factory yard -\nNawalparasi, Nepal\n\nThe Arsenic Biosand Filter was\nrecognized by various awards ...\n-MIT IDEAS Competitions - (2002, 2003, 2005)\n-World Bank Development Marketplace Competition\n* Wall Street Journal\nTechnology Innovation Award -\nEnvironment Category (2005)\n* St. Andrews Prize for the\nEnvironment - 2nd Prize (2006)\n* Kyoto Water Prize - Top Ten\nFinalists (2006)\n\nTommy Ngai, Susan's former MIT MEng student, and Narayan Panday, one of the filter entrepreneurs Tommy trained in 2003-2007\n\nTommy Ngai and I visited Narayan Pandy & family on\nJan. 29, 2019. Narayan's highly success social\nbusiness is called \"Lumbini Filter Industries.\"\n\n2005 original home and business site of Narayan\nPandey and Lumbini Filter Industries (left photo)\n2019 mansion (same site - right photo)\n\n2005 conveyance, by bike.\n2019 conveyance, by truck\n\n2005 filters painted blue\n2019 filters with ceramic\ntiles & safe storage container\n\nConveyor System for Arsenic Biosand Filter Transport - another\nindigenous innovation of Lumbini Filter Industries\n\nLumbini Filter Industries Phone Number on\neach unit. 10 Year Warrantee/Follow-up\n\nLumbini Filter Industries' Educational Posters on\nHow the Filter Works and How to Operate It.\n\nLocal prosperous homes of Lumbini Filter Industries\ncustomers, each with their own private well in front\nyear. Location: Rupendehi, Nepal.\n\nMany impressive homes in this upwardly mobile neighborhood in Rupendehi,\nNepal have Arsenic Biosand Filters from Lumbini Filter Industries\n\nA filter producers association has standardized on a common diffuser\nbasin of their own design, improving on the earlier the original MIT-\nENPHO team recommended.\n\nRupendehi resident and customer of Lumbini Filter\nIndustries\n\nLocal Shop in Parasi, Nepal selling Arsenic\nBiosand Filters, among other housewares\n\nGyanshampur Village, Nawalparasi District. The man on crutches has had\nhis leg amputated due to the mistaken idea that it can cure him of his\narsenicosis. Five family members suffer the same.\n\n1st School with Arsenic Biosand scaled up system\nwe visited. This one was working well.\nCourtesy of\nTommy Ngai.\nUsed with\npermission.\n\nArsenic Treatment System -- 1st School We Visited\n\nPictures showing well and public\nsink at 1st school with arsenic\nbiosand filter we visited in\nNawalparasi District\n\nArsenic Contamination in the World\n- Worldwide estimated 226+ million people are\nexposed to arsenic contamination from drinking\nwater or food. (Murcott, 2012)\n- At least 105 countries in the world where people\nare potentially exposed to arsenic in drinking\nwater or food.\nhttp://www.iwapublishing.com/books/9781780400389/arsenic-contamination-world\nInternational Water Assn.\nPublishers, 2012\n\nTake-aways from Arsenic in Nepal Case Study\n- Narayan Pandey has made \"a biosand filter for every family in Nepal\" his life work.\n- Lumbini Filter Industries is an outstanding example of \"design for/design with/design by,\"\nhaving taken an original idea, innovated on it, and built his life around this innovation.\n- There is still work to do in the region, people are still getting arsenicosis (arsenic\npoisoning).*\n- Scale up is happening to address arsenic in drinking water in schools. Some successful,\nsome less successful. More work is needed.\n- Worldwide the arsenic contamination problem is largely invisible.\n* Cutaneous manifestations (melanosis, keratosis, and cutaneous cancers) are essential clues in the diagnosis\n\nPhoto Credit: Benton James, Madison County Soil Conservation District, Tennessee\nInfiltration vs. Runoff & Erosion in a Rain Simulator\nNotice 10 glass jars:\n5 back jars receive\ninfiltration water\n5 front jars receive surface\nrunoff\n5 trays have varying\ndegrees of tilled soil on\nright all the way to deeply\nrooted soil microbiology\nand plant life\n(c) Benton James. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nRay Archuleta, USDA scientist demonstrating the\nSoil Stability Test of two exact same soils, except...\nOn the left is 35 yr old conventionally farmed soil, with chemicals and fertilizer\nOn the right is 40 year old healthy soil with diverse biota.\nSee the difference when added to water columns\n- https://www.facebook.com/drbuzkloot/videos/vb.197148037353808\n/707664362917959/?type=2&theater\n(1 minute)\n(c) Dr. Buz Kloot. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate, and Health, Lec 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/63b2fd3191080df38fe379d388226963_MITEC_719S19_lec1.pdf",
      "content": "D-Lab: Water, Climate and Health\nEC-Kit (for E.coli testing)\nHurricane Maria, Puerto Rico\nSusan Murcott and Julie Simpson\nFeb. 7, 2019\nMiddle: Courtesy of Bureau of Land Management. This image is in the public domain.\n\nDefinitions\nWeather:the state of the atmosphere at a place and time with respect to it's properties\n(temperature, wind speed, barometric pressure, etc.)\nClimate: average weather, typically over a period of decades or longer, identified using\nstatistical tests by changes in the mean and/or variability of its properties\n(temperature, wind, cloudiness, moisture, pressure, etc.)\n\nMy Extreme Weather Story\nI spent my honeymoon in Poipu, Hawaii, which is where the eye of Hurricane Iwa struck on Nov. 23, 1982\n(c) Nick Galante (left) and Reed Saxon (right). All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nBlue Hill Meteorological\nObservatory\nApril 1, 2017 Snow Blizzard!\n\nCourse Description\n- 1st course at MIT (or almost anywhere) combining\nwater, climate change and health\n- Action learning, field trips\n- Mix of student's diverse disciplines, grads &\nundergrads, various nationalities, MIT, Harvard,\nWellesley and more!\n\nSyllabus\n- Climate Science:\n- Climate Policy: Guest lectures on global circulation models,\ncarbon sequestration and game-playing with the C-ROADS World\nClimate Simulation to test emission reduction policies\n- Field trips: Blue Hill Meterological Observatory, Hull Wind Energy\nBoston-Cambridge flood control, zero carbon home\n- Projects: class solutions to water, climate change & health\nchallenges.\n\nWorld Climate Simulation\nC-ROADS World Climate Simulation game to test global\nemissions reduction policies\n\nSome Past Highlights\nArnold Arboretum -\n\"Tree Architecture\"\n\nBoston People's Climate\nMovement - April 29, 2017\n\nTidmarsh Restoration & Living Observatory\nhttp://tidmarsh.media.mit.edu/\nTransforming a 100+ year old commercial cranberry bog and restoring its natural river flow\nand wetlands to enhance habitat, biodiversity and coastal protection from sea level rise.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate, and Health, Lec 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/26f9d6ca20f7933987405db464ef013b_MITEC_719S19_lec2.pdf",
      "content": "Water, Climate Change and Health\nPhoto: Apollo 8 image of \"Earthrise\" by William Anders, AS8-14-2383, Dec. 24, 1968\nSusan Murcott,\nWeek 2 --D-Lab: Water, Climate Change and Health\nZƵƌƚGƐLJZIE^./wAOGiƐinƚSGƉƵduiĐEZwAin.\n\n4 Challenging Questions (add answers on index card)\n1. Define \"life.\"\n2. Complete this sentence: \"Planet Earth is ill because...\"\n3. What makes a planet habitable?\n4. In honor of Valentines Day: complete this sentence:\n\"Love [in relation to Water, Climate Change\nand Health] is...\"\n\nOutline\n- Human Health, Planetary Health, Planetary Boundaries\n- Comparing Venus, Earth and Mars\n- What Makes a Planet Habitable?\n- Inside Story of Paris Agreement\n- Solutions (Maslin, Ch 8) & Terminology\n- Adaptation\n- Mitigation\n- Geoengineering\n- Solar Radiation Management\n\nHuman Body Temperature\n- For a typical adult: 97 F to 99 F.\n- Infants and children: 97.9 F to 100.4 F.\n- A body temperature higher than your normal range is a fever.\n- Hypothermia is when the body temperature dips too low.\n- Either extreme is a medical emergency\n(c) source unknown. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nHuman Health - Example of a healthy individual, with each of the\nparameters falling within an standard average range\nComprehensive Metabolic Panel - Details\nFeb. 4, 2019\n\nIs the Earth a living planet?\nIs it ill?\n- In many ways, climate change for Earth can be seen in the same\nway as illness and the human body.\nMark Maslin, Climate Change p 162.\nI have asked that you take on for discussion that the Earth is in some\nsense alive and that the diagnosis and treatment of its ills become\nan empirical practice...The notion of the planet visiting a doctor is\nodd. It assumes, for a start, that the planet - in this case Earth - is\ncapable of being ill and so is in some sense alive. It assumes that\nthere is a suitable doctor to visit. A physician, in fact, trained in\nplanetary medicine... It is with the need for such a practice of\nplanetary medicine that this book is concerned. Its system science\nwill be physiology, the systems science of living organisms, or rather\ngeophysiology, the systems science of the Earth.\"\nJames Lovelock, Gaia, Medicine for an Ailing Planet, 2005\n\nPlanetary\nBoundaries\nThe Planetary Boundaries concept identifies nine global priorities relating to human-induced changes to the environment. The science shows that these\nnine processes and systems regulate the stability and resilience of the Earth System -- the interactions of land, ocean, atmosphere and life that together\nprovide conditions upon which our societies depend.\nFour of nine planetary boundaries have now been crossed as a result of human activity: climate change, loss of biosphere integrity, land-system change,\naltered biogeochemical cycles (nitrogen and phosphorus).\nhttp://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-research/the-nine-planetary-boundaries.html\n(c) AAAS. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nPlanetary\nBoundaries\nFigure\nExplanation\nThe green zone is the safe operating space (below the boundary), yellow represents the zone of uncertainty (increasing risk), and red is the high-risk zone.\nThe planetary boundary itself lies at the inner red circle. The control variables have been normalized for the zone of uncertainty (between the two red\ncircles); the center of the figure therefore does not represent values of zero for the control variables. The control variable shown for climate change is\natmospheric carbon dioxide concentration. The term novel entities represents the growing awareness that, in addition to toxic synthetic substances, other\npotentially systemic global risks exist, such as the release of radioactive materials or nanomaterials. Processes for which global-level boundaries cannot yet\nbe quantified are represented by grey wedges; these are atmospheric aerosol loading, novel entities, and the functional role of biosphere integrity.\nhttp://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-research/the-nine-planetary-boundaries.html\n(c) AAAS. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\n4 Boundaries\nCurrently Crossed:\nExcerpt of Table 6\nfrom our Reading...\n(Maslin, 2014, p. 167)\nyes\nUpdate since\nMaslin, 2014\n\nClimate Change\n2 parts: (1) CO2 Conc & (2) Radiative Forcing\n(1) CO2 Concentration\n- Recent evidence suggests that the Earth, now passing 410 ppm CO2\nin the atmosphere, has already transgressed the planetary boundary\n- We have reached a point at which the loss of summer polar sea-ice is\nalmost certainly irreversible.\n- Weakening of terrestrial carbon sinks, e.g. destruction of the world's\nrainforests, is another potential tipping point.\n- A major question is how long we can remain over this boundary\nbefore large, irreversible changes become unavoidable.\nhttps://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-\nresearch/the-nine-planetary-boundaries.html\n\n(1) CO2 Concentration: Carbon dioxide levels\ntoday are higher than at any point in at least the\npast 800,000 years.\nImage courtesy of NOAA. Image is in the public domain.\nhttps://www.climate.gov/news-features/understanding-climate/climate-change-atmospheric-carbon-dioxide\n\nEarth's CO2 Home Page https://www.co2.earth/\nAtmospheric CO2\nJanuary 2019\n410.92\nparts per million (ppm)\nMauna Loa Observatory, Hawaii\n\nRadiative Forcing Components\n\"Radiative forcing is a measure of\nthe influence a factor has in\naltering the balance of incoming\nand outgoing energy in the Earth-\natmosphere system and is an\nindex of the importance of the\nfactor as a potential climate\nchange mechanism.\nIn this report radiative forcing\nvalues are for changes relative to\npreindustrial conditions defined\nat 1750 and are expressed in\nWatts per square meter (W/m2).\"\nRadiative Forcings, IPCC AR4, 2007.\n(c) Leland McInnes. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nRadiative\nForcing\nRadiative forcing\n(watts per square\nmeter), represents\nthe size of the\nenergy imbalance in\nthe atmosphere.\nThis figure shows the\namount of radiative\nforcing caused by\nvarious greenhouse\ngases, based on the\nchange in\nconcentration of\nthese gases in the\nEarth's atmosphere\nsince 1750.\nOn the right side of\nthe graph, radiative\nforcing has been\nconverted to the\nAnnual Greenhouse\nGas Index, which is\nset to a value of 1.0\nfor 1990\nImage courtesy of EPA. Image is in the public domain.\n\nBiodiversity Loss/ Extinction Rate/ Biodiversity Integrity\n- The Millennium Ecosystem Assessment of 2005 concluded that changes to\necosystems due to human activities were more rapid in the past 50 years\nthan at any time in human history.\n- The main drivers of change are the demand for food, water, and natural\nresources, causing severe biodiversity loss and leading to changes in\necosystem services.\n- We include biodiversity (in the latest scientific update, Steffen et al., 2015,\ndefined as biosphere integrity to emphasize the functional and regulatory\nrole of biodiversity for ecosystem stability) as a planetary boundary on the\nscientific ground that the biosphere interacts with the climate system,\nhydrological cycle and other biogeochemical cycles in the Earth system, and\nthereby contributes to the regulation of the state of the Earth system.\nhttps://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-\nresearch/the-nine-planetary-boundaries.html\n\nMillenium Assessment (MA) 2005\n- Over the past 50 years, humans have changed ecosystems more rapidly and extensively than in any comparable\nperiod of time in human history, largely to meet rapidly growing demands for food, fresh water, timber, fiber and\nfuel. This has resulted in a substantial and largely irreversible loss in the diversity of life on Earth.\n- The changes to ecosystems have contributed to substantial net gains in human well-being and economic\ndevelopment, but these gains have been achieved at growing costs in the form of the degradation of many\necosystem services, increased risks of nonlinear changes, and the exacerbation of poverty for some groups of\npeople. These problems, unless addressed, will substantially diminish the benefits that future generations obtain\nfrom ecosystems.\n- The degradation of ecosystem services could grow significantly worse during the first half of this century.\n- The challenge of reversing the degradation of ecosystem while meeting increasing demands for services can be\npartially met under some scenarios considered by the MA, but will involve significant changes in policies,\ninstitutions and practices that are not currently under way. Many options exist to conserve or enhance specific\necosystem services in ways that reduce negative trade-offs or that provide positive synergies with other\necosystem services.\n- The bottom line of the MA findings has been that human actions are depleting Earth's natural capital, putting such\nstrain on the environment, that the ability of the planet's ecosystems to sustain future generations can no longer\nbe taken for granted. At the same time, the assessment shows that with appropriate actions it is possible to\nreverse the degradation of many ecosystem services over the next 50 years, but the changes in policy and practice\nrequired are substantial and not currently underway.\nhttps://www.millenniumassessment.org/en/index.html\n\nLand System Change\n- Land is converted to human use all over the planet. Forests, grasslands, wetlands\nand other vegetation types have primarily been converted to agricultural land.\n- This land-use change is one driving force behind the serious reductions in\nbiodiversity, and it has impacts on water flows and on the biogeochemical cycling\nof carbon, nitrogen and phosphorus and other important elements.\n- While each incident of land cover change occurs on a local scale, the aggregated\nimpacts can have consequences for Earth system processes on a global scale.\n- A boundary for human changes to land systems needs to reflect not just the\nabsolute quantity of land, but also its function, quality and spatial distribution.\n- Forests play a particularly important role in controlling the linked dynamics of\nland use and climate, and is the focus of the boundary for land system change\nhttps://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-\nresearch/the-nine-planetary-boundaries.html\n\nBiogeochemical - Nitrogen & Phosphorus\n- The biogeochemical cycles of nitrogen and phosphorus have been radically changed by humans as\na result of many industrial and agricultural processes.\n- Nitrogen and phosphorus are both essential elements for plant growth, so fertilizer production\nand application is the main concern.\n- Human activities now convert more atmospheric nitrogen into reactive forms than all of the\nEarth's terrestrial processes combined. Much of this new reactive nitrogen is emitted to the\natmosphere in various forms rather than taken up by crops.\n- When it is rained out, it pollutes waterways and coastal zones or accumulates in the terrestrial\nbiosphere.\n- A significant fraction of the applied nitrogen and phosphorus makes its way to the sea, and can\npush marine and aquatic systems across ecological thresholds of their own.\nhttps://www.stockholmresilience.org/research/planetary-boundaries/planetary-boundaries/about-the-\nresearch/the-nine-planetary-boundaries.html\n\nDead zone - Gulf of Mexico \"Largest ever\nmeasured.\" Size of New Jersey\nDead zones are\nhypoxic (low-\noxygen) areas in the\nworld's oceans and\nlarge lakes, caused\nby excessive\nnutrient pollution\nfrom human\nactivities coupled\nwith other factors\nthat deplete the\noxygen required to\nsupport most\nmarine life in\nbottom and near-\nbottom water.\nTop: Courtesy of NASA.\nBottom: Courtesy of LSU/LUMCON and NOAA.\nImages are in the public domain.\n\nComparing Gases on Venus, Earth and Mars\n0.04\nCourtesy of NASA. Images are in the public domain.\n\nComparing Venus and Earth: Venus is the 2nd planet from the sun, and is called Earth's \"sister:\" Both planets\nare similar in size, mass, density and geologic composition.\nVenus Earth Mars\n- Venus' atmosphere is\ncomposed of 96.5%\nCO2!\n- 645 degrees C at\nsurface (860*F)\n- This is a scorched\nplanet, hot enough to\nmelt lead.\n- Venus does not have\nwater and is\ncompletely\nuninhabitable!\nCourtesy of NASA. Image is in the public domain.\n(c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nCompare Venus and Earth: Both planets are similar in size, mass, density and geologic composition.\n- Earth has\nWATER! We can\nlive on Earth!\n(c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nBecause Earth is \"not too hot, not too cold,\" which allows us to have has\nliquid water, we have life (as we know it) on Earth.\n\nComparing Venus & Earth\n- Venus' surface temperature is 460*C (860*F)\n- Earth's surface temperature is 15*C (57*F).\n- CO2 on Venus: 96.5%;\n- CO2 on Earth = 0.04%.\n- Venus receives almost twice as much solar radiation from the Sun\nas Earth, but dense clouds on Venus permits LESS radiation to\npenetrate the surface.\n- Yet, Venus is much HOTTER than Earth because its CO2-enriched\natmosphere creates a much stronger greenhouse effect than on\nEarth.\n80%\nreflected\n26%\nreflected\n(c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nComparing Earth and Mars...\n- Mars is the other most Earth-like other planet in our solar\nsystem.\n- Same internal structure:\n- an inner core of metal;\n- surrounded by a mantle of rock;\n- thin crust covers the mantle.\n- Both planets have large, sustained polar caps.\n- Current thinking is that both have substantial amounts of\nfrozen ice.\nEARTH\nMARS\nCourtesy of NASA, J. Bell (Cornell U.) and M. Wolff\n(SSI) and NASA/JHUAPL/Carnegie Institution of\nWashington/USGS/Arizona State University. Images\nare in the public domain.\n\nMars is NOT (easily) HABITABLE!\n- Mars' atmosphere -- extremely high in CO2 concentration = 95%\n- Dust storms are common!\n- Temperature: Planet-wide: - 55 *C (- 67 *F)\n\nBut...\n- Mars seems to have been a planet with an atmosphere.\nbut the atmosphere was stripped away by solar wind.\n- Mars had liquid surface water, perhaps intermittently,\nbut Mars' surface waters became acid, charged with sulfates.\nand most of the water evaporated and was carried off into space.\n- The scant water left was frozen into permafrost and ice-caps.\nEARTH\nMARS\nCourtesy of NASA, J. Bell (Cornell U.) and M. Wolff\n(SSI) and NASA/JHUAPL/Carnegie Institution of\nWashington/USGS/Arizona State University. Images\nare in the public domain.\n\nCNN news today! Water on Mars!\nhttps://www.cnn.com/2019/02/13/world/nasa-\nmars-opportunity-rover-trnd/index.html\nRecommended Reading: How to Build a\nHabitable Planet. Charles Langmuir.\nWally Broecker.\n\nSara Seager - Living in the Goldilocks Zone:\nClimate Essentials for a Habitable Planet (1/27/16)\n- https://eapsweb.mit.edu/events/2016/climate-symposium\n- Watch minutes: 3:17 - 10:50 min\n(c) MIT. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nWhat Makes a Planet Habitable?\nThis list taken from Prof. Sara Seager - see video reference\n1. Liquid water/liquid ocean\n2. Earth's average surface temp is 57 degrees F (\"Not too hot; not too cold\")\n3. Greenhouse gases (GHG), esp. water vapor (H2O), carbon dioxide (CO2),\nnitrous oxide (N2O) & methane (CH4) have strong absorption and that\nmeans that they trap the sun's heat within earth's atmosphere\n4. Relative humidity - a range is allowed in the atmosphere\n5. Clouds - every planet has clouds! On Earth, water vapor affects clouds and\nadd a lot of complexity. We care about clouds, aerosols, haze... but clouds\nare a unique characteristic.\n6. Atmospheric dynamics: If the planet has one permanent day-side and one\npermanent night-side (like our moon) then you need a certain size of\natmosphere ≥ Mars, so that atmosphere is well mixed.\n\nWhat Makes a Planet Habitable?\nQuoted from Prof. Sara Seager - see reference slide\n\"All life as we know it needs liquid water: so we are taking this\nhabitable condition to mean planets with surface temperatures that\ncan maintain a liquid ocean.\nWhat We Think Happened to Venus: Some planets are closer to the\nstar, and they are receiving so much energy that they will be hot. Water\nvapor will reach the upper areas of the atmosphere where it would be\nphoto-dissociated by starlight or sunlight and hydrogen would escape\nto space, with oxygen and other molecules and surface minerals\nthereby getting rid of the planet's oceans. We think that's what\nhappened to Venus.\"\n\nWhat Makes a Planet Habitable?\nQuoted from Prof. Sara Seager - see reference slide\n\"What Happened to Mars?: On the outer edge of the habitable zone,\nactually the gases that we are worried about, our greenhouse gases,\nwould freeze out, water and carbon dioxide, making the planet too cold\nfor liquid water and too cold for life as we know it. We think that's, in\npart, what happened to Mars.\"\n\nCourtesy of US EPA. Image is in the public domain.\nEarth's Radiation Budget: Solar radiation arriving at the top of Earth's atmosphere averages 340 W/m2 , indicated here as 100% (upper left). About 30% of the\nincoming radiation is reflected and scattered back to space, and the other 238 W/m2 (70%) enters the climate system. Some of this entering radiation warms Earth's\nsurface and causes it to radiate heat upward (right). The greenhouse effect (lower right) retains 95% of the heat radiated back from Earth's heated surface and\nwarms Earth by 318C.\n1,362 W/m2\nShort wave\n(visible)\nGreenhouse gases, carbon dioxide, methane, nitrous oxides, CFCs,\nothers, act as a blanket, trapping the sun's energy.\n\nRadiation Balance\n- Almost all of the energy that affects Earth's climate is received as radiant energy\nfrom the Sun. The planet and its atmosphere absorb and reflect some of the\nenergy, while long-wave energy is radiated back into space. The balance between\nabsorbed and radiated energy determines the average global temperature.\nBecause the atmosphere absorbs some of the re-radiated long-wave energy, the\nplanet is warmer than it would be in the absence of the atmosphere: (see\ngreenhouse effect).\n- The radiation balance is altered by such factors as the intensity of solar energy,\nreflectivity of clouds or gases, absorption by various greenhouse gases or surfaces\nand heat emission by various materials. Any such alteration is a radiative forcing,\nand changes the balance. This happens continuously as sunlight hits the surface,\nclouds and aerosols form, the concentrations of atmospheric gases vary and\nseasons alter the groundcover.\nhttps://en.wikipedia.org/wiki/Radiative_forcing\n\nSpectra of Major Greenhouse Gases\nhttp://learningweather.psu.edu/node/22\n(click on \"Absorbtivity Graphic\" link)\n1 m = 106 micron\nUltraviolet (10 nm - 0.4 μ) Visible (0.4 - 0.7 μ)\nInfrared (0.7 μ - 1000 μ\nImage courtesy of The Pennsylvania State University.\nUsed under CC-BY-NC-SA.\n\nText for Howard et al, 1959 slide only (Slide 10):\nReference: http://www.meteor.iastate.edu/gccourse/forcing/spectrum.html\n- For each gas is given a plot of the absorption of the gas, ranging from 0 to 1, for each wavelength.\n- As an example, if we look at the plot for oxygen and ozone, we see that the absorption is very high in the ultraviolet\nregion but essentially zero in the visible and infrared regions, except for isolated peaks. We interpret this to mean\nthat this gas absorbs essentially all radiation in the ultraviolet but is transparent in the visible and mostly\ntransparent in infrared portions of the spectrum. This gas then is responsible for shielding earth-based biological\nsystems from lethal ultraviolet radiation, radiation with wavelengths less than 0.3 micrometers (or 300\nnanometers), but allows visible light and infrared radiation to pass through without much absorption.\n- Other gases have much different absorption properties. Methane (CH4), for example, has a couple of very small\nwavelength regions in which it absorbs strongly and these occur at about 3.5 and 8 microns, which are in the\ninfrared region. Nitrous oxide, N2O, having peaks at about 5 and 8 microns, absorbs in fairly narrow wavelength\nranges.\n- Carbon dioxide has a more complex absorption spectrum with isolated peaks at about 2.6 and 4 microns and a\nshoulder, or complete blockout, of infrared radiation beyond about 13 microns. From this we see that carbon\ndioxide is a very strong absorber of infrared radiation. The plot for water vapor shows an absorption spectrum more\ncomplex even than carbon dioxide, with numerous broad peaks in the infrared region between 0.8 and 10 microns.\n- The total spectrum of all atmospheric gases is given in the bottom plot. This shows a \"window\" between 0.3 and 0.8\nmicrons (the visible window), which allows solar radiation (without the lethal UV component) to reach the earth's\nsurface. \"Earth radiation\", the upwelling infrared radiation emitted by the earth's surface, has a maximum near 10\nmicrons. The total atmosphere plot shows that a narrow window (except for an oxygen spike) exists in the range of\nwavelengths near 10 microns.\n- Note: The CFCs are not plotted here but will be considered separately.\n\nAbsorption Patterns of Water Vapor and CO2\nImage courtesy of NASA. Image is in the public domain.\n\nParis Climate Agreement Inside Story\nhttps://www.ted.com/talks/christiana_figueres_the_inside_story_of_the_paris_climate_agreement#t-496370 (15\nmin total. Show 9:15 minutes in class)\n-\nRelentless optimism\n-\nTechnology esp. renewable energy\n-\nEconomy - economic advantages to the new economy\n-\nBroad participation\n-\nNational benefits from action\n(c) TED. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nParis Agreement (Dec 2015)\n\"Holding the increase in the global average temperature\nto well below 2 °C above pre-industrial levels and to\npursue efforts to limit the temperature increase to 1.5 °C\nabove pre-industrial levels, recognizing that this would\nsignificantly reduce the risks and impacts of climate\nchange.\"\n\n\"Solutions\" to Climate Change:\nTerminology and Categories\n\"Early\"\n(1980s,\n1990s)\nPrevention\nMitigation\nAdaptation\nToday\nMitigation\nAdaptation\nGeoengineering\nSolar Radiation\nMgt. (SRM)\n\n-\n\"The process of reducing emissions or enhancing\nsinks of greenhouse gases in the atmosphere so\nas to limit future climate change.\"\n(IPCC Synthesis Rpt \"Topic 3\" p.76)\n-\nMitigation is reducing our carbon footprint and\nthus reversing the trend of... GHG emissions.\n(Mark Maslin, Ch. 8 Solutions, p. 136)\n-\nMitigation Definitions\n\nAdaptation Definitions\n- \"Adaptation is providing protection to the population.\" (Maslin, 2014, Ch. 8 )\n- \"Adaptation is adjustments in the ecological-social-economic systems in\nresponse to... climate stimuli\" (Jamieson, 2000, p 202)\n- \"Adjustment to climate and its effects to avoid harm. (IPCC, 2014 SYN, Topic 3, p. 76)\n\nGeoengineering is the general term\nfor technologies that could be used\nto either remove GHG from the\natmosphere or change the climate\nof the Earth.\" (Maslin, 2014 p. 156)\n-\nGeoengineering Definition\n\nSolar Radiation Management Definitions\nSolar radiation management (SRM) or\nsolar geoengineering is a theoretical approach to reducing\nsome of the impacts of climate change by reflecting a\nsmall amount of inbound sunlight back out into space.\nIt is in the early stages of research, but it is already a\ncontroversial topic. It is clear that SRM has the potential\nto be very helpful or very damaging for those people and\nspecies most threatened by climate change, but it is very\nunclear what its full effects would be.\nhttp://www.srmgi.org/what-is-srm/\n\nANNEX -\nEunice Foote and John Tyndall\n\nEunice Newton Foote (1819 - 1888)\n- Conducted experimental work on the warming effect\nof the sun on air, and how warming increased by\nwater vapor and carbonic acid gas (carbon dioxide).\n- Her experimental work was presented by Prof. Joseph\nHenry at the 8th annual American Association for the\nAdvancement of Science (AAAS) meeting in 1856,\n(because women weren't allow to present).\n- Foote was the 2nd female member of AAAS.\n- The 1st was the famous astronomer Maria Mitchell,\nwho was Ellen Swallow Richard's professor at Vassar.\nNo known photo exists of\nEunice Newton Foote.\nBut there is a photo of her\ndaughter, Mary Foote\nHenderson\nImage is in the public domain.\n\nJohn Tyndall (1820 - 1893)\n- Tyndall explained the heat in the Earth's atmosphere in terms of the\ncapacities of the various gases in the air to absorb radiant heat, also\nknown as infrared radiation. His measuring device, which used\nthermopile technology, is an early landmark in the history of absorption\nspectroscopy of gases.\n- He was the first [or 2nd if credit goes to Eunice Foote] to correctly\nmeasure the relative infrared absorptive powers of the gases nitrogen,\noxygen, water vapour, carbon dioxide, ozone, methane, in the 1859\n(four years after Eunice Foote's work).\n- He concluded that water vapor is the strongest absorber of radiant heat\nin the atmosphere and is the principal gas controlling air temperature.\nAbsorption by the other gases is not negligible but relatively small.\n- Prior to Tyndall it was widely surmised that the Earth's atmosphere has\na Greenhouse Effect, but he was considered to be the first to prove it.\nThe proof was that water vapor strongly absorbed infrared radiation.\n- [Eunice Newton Foote's experimental work is only recently discovered].\nImage courtesy of the Smithsonian. Image is in the public domain.\n\nTyndall's Experimental Set-up\nImage is in the public domain.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 D-Lab: Water, Climate, and Health, Lec 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/da5b16a8ff17ff98b1f85455e084aa44_MITEC_719S19_lec4.pdf",
      "content": "Earth's climate has always changed; human\ncivilization is new.\n- 12,000 years ago glaciers receded\n- Unusually long stable climate period\n- <0.5°C change, globally\n- Sudden development of humans from\nStone Age hunter-gatherers to modern\nsocieties\n- agriculture\n- permanent dwellings\n- growth of villages, specialization of roles\n- megafaunal extinctions?\nLascaux cave painting, 20,000 ybp, Field Museum.\nThis image is in the public domain.\n\nNow there's a lot more in harm's way.\n- 2,500,000 - first evidence of stone tool use\n- 200,000 - development of Homo sapiens\n- 12,000 - development of agriculture, society,\npermanent residences\n- 200 - development of industry, use of fossil fuels\n- 20 - internet\nHuman culture advances on order of magnitude\ntime scales (YBP):\n\n- Evidence that early agriculture increased\natmospheric CO2 and CH4 as early as\n5000 YBP\n- Rice irrigation began 5000 YPB, increase\nin irrigated area correlates with CH4 rise\n- Europe, Asia, deforestation for\nagriculture already widespread by 1086,\nlikely earlier\nPre-industrial climate change\nHumans began altering the climate.\n\nClimate Change since 1850\nInformation sources:\n- Instrumental records\n- Satellite observations\n- Sea level rise + attribution\nLiving stromatolites in Shark Bay, Western\nAustralia\nLiving stromatolites in Shark Bay, Western\nAustralia\nIPCC AR4, Fig. 3.1\n(c) /WCC. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nClimate Change since 1850\nInformation sources:\n- Instrumental records\n- Satellite observations\n- Sea level rise + attribution\nComplications in interpreting records: climate oscillations\n- El Nino Southern Oscillation\n- Pacific Decadal Oscillation\n- North Atlantic Oscillation\nLiving stromatolites in Shark Bay,\nWestern Australia\nLiving stromatolites in Shark Bay,\nWestern Australia\nIPCC AR4, Fig. 3.1\n(c) /WCC. All rights reserved. This content is excluded from our Creative Commons license. For\nmore information, see https://ocw.mit.edu/help/faq-fair-use/\n\nInstrumental records\n- Surface thermometers\n- Radio sondes\n- Subsurface ocean temperatures\n- Widespread melt of mountain glaciers\n\nInstrumental records\nSurface thermometers\n- Coverage has increased significantly since\n1800's\n- Must be corrected for urban heat island effect\n(many stations are near population centers)\n- Historical sea surface temps must be calibrated\nto modern methods (buckets, engine rooms)\n- Global average increase of 0.9°C since 1900\n\nRadiosonde being launched by NOAA Earth\nSystem Research Lab\nRadiosonde or weather balloon\n- Instrument package includes temp,\nhumidity, pressure, GPS coordinates;\ntransmit data to ground station in real\ntime during ascent\n- Can ascend up to 35 km, ~2 hr flight\n- Launched 2x/day at over 800 locations\nglobally; data shared through international\nagreements\n- Record adjusted for solar heating on\ninstrument casing (daylight launches only)\nRadiosonde locations worldwide\nCourtesy of National Weather Service. Image is in the public domain.\nCourtesy of NOAA. Image is in the public domain.\n\nInstrumental records\nSubsurface ocean temperatures\n- \"Surface\" = top 100m, typically well-mixed\n- Measurements since ~1955\n- Heat moved by diffusion, sinking water masses\n- 0.07°C increase since 1950s represents large\namount of heat storage (more than 10x\natmospheric storage)\n\nInstrumental records\nWidespread melt of mountain glaciers\n- Mountain glaciers = 4% of surface land ice\n- Glaciers measured from 1860 - 1900 already showed\nretreat\n- Almost every glacier measured is retreating; some\nhave melted entirely\n- Global average of 1.5 km of retreat since 1800s\n- In 1850, 150 glaciers in Glacier National Park. By\n2015, only 26 remain\n\nSatellite Observations\n- Arctic warming\n- Melting ice sheets\n- Disagreement between satellite and\nground stations: resolved\nNASA GRACE satellite, artist's rendition (NASA/JPL)\nDisko Bay, Greenland (NASA), /an :oughin, hniversitLJ of Washington\n/mages are in the public domain.\n\nSatellite Observations\nSeasonal trends in Arctic sea ice volume, with\nhypothetical projections. NSIDC/Staniford\nArctic warming\n- Arctic is warming 2x faster than global average\n- Sept. sea ice reduced by 40% since 1970s\n- Reductions in both cover and thickness of ice\n- Growing season in Alaska two weeks longer\nnow than in 1960s\n- Northwest Passage now open in fall months\nFigures courtesLJ of the Eational ^now and /ce ata Center, hniversitLJ of\nColorado, oulder. This content is in the public domain.\n\nSatellite Observations\n>oss of ice mass from Greenland as\nmeasured by GRACE\nMelting ice sheets\n- Since 2002, measured with GRACE satellites; measures\ngravitational pull, essentially \"weighs\" ice sheets\n- Greenland shows decline and increasing rate of decline\n- Antarctica is more variable, higher uncertainty (also order\nof magnitude more ice than Greenland\nCourtesLJ of EA^A. /mage is in the public domain.\n\nSatellite Observations\nMelting ice sheets\n- Since 2002, measured with GRACE satellites;\nmeasures gravitational pull, essentially \"weighs\"\nice sheets\n- Greenland shows decline and increasing rate of\ndecline\n- Antarctica is more variable, higher uncertainty,\nbut melt rate appears to be increasing there too\nRignot et al. 2019. Red = ice loss, blue = ice gain; size of\ncircle proportional to absolute magnitude of anomaly.\n(c) Rignot, et al. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nSatellite Observations\nMelting ice sheets\n- Greenland shows decline\n- Antarctica is more variable, high uncertainty\n- Since 2002 measured with GRACE satellite;\nmeasures gravitational pull, essentially\n\"weighs\" ice sheets\nNASA GRACE findings for change in mass of Greenland and Antarctic ice sheets; note different\nscale on y-axis.\n- Greenland shows decline\n- Antarctica is more variable, high uncertainty\n- Since 2002 measured with GRACE satellite;\nmeasures gravitational pull, essentially\n\"weighs\" ice sheets\nNASA / R. Braithwaite\n(c) American 'eophLJsical hnion. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n/mage is in the public domain.\n\nSatellite Observations\nCorrected satellite data correlate well with land/sea surface measurements.\nDisagreement between satellite and ground\nstations: resolved\n- Satellites measure temperatures throughout air\ncolumn; ground stations measure ground temps\n- Satellites measure energy emissions of O2,\ncorrelated with air temperature; requires\nsubstantial correction and calibration\n- As satellite data analysis has improved,\nagreement with ground data increased\nUncorrected satellite data (UAH global)\ncompared with land/sea surface measurements\n(HadCRUT4); satellite data show lower warming\ntrend. From EuanMearns.com\n(c) euanmearns.com All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n(c) Robert A. Rohde on Wikipedia. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nSea Level Rise\nVenice, 2008; high tide\n- Since there have been oceans, sea level has been\nin flux (e.g., 125m lower during last glaciation,\nbut 7m higher during previous interglacial warm\nperiod)\n- Melting Greenland's ice sheet would result in\nglobal SLR of 7m\n- Melting Antarctica's ice sheets could result in\nglobal SLR of 57m\nCourtesLJ of massimo riserbo on Flickr. hsed under CC z-EC.\n\nSatellites since 1993 (Topex, Jasons 1,2,3)\nTide gauges since ~1870\nHow do we measure SLR?\nRelative SLR is sensitive to local conditions\n(uplift, subsidence, ocean bedrock sinking\nunder weight of glacial meltwater)\n\"Relative\" SLR is relative to\nbenchmark on land\n\"Absolute\" SLR is relative to the center\nof the earth\n(c) University of Colorado. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nGlobal average sea level change since 1992; NOAA/NESDIS\nBy any measurement, global sea\nlevels are rising.\nGlobal average sea level change as measured by tide gauges\nThe rate of SLR is increasing:\nRise since 1900: 20 cm\nCurrent rate of rise: 3.2 cm/decade\nCourtesLJ of EKAA. This image is in the public domain.\nCourtesLJ of EA^A. /mage is in the public domain.\n\nSea level change since 1993; NOAA/NESDIS\nSea level rise is not uniform, and\nhas multiple causes:\n1. Thermal expansion of water\n2. Melting of mountain glaciers\n3. Greenland and Antarctic ice melt\nAs glaciers disappear and Greenland\nand Antarctica melt rates increase,\nthis hierarchy will change.\n/mage is in the public domain.\n\nEmanuel, 2016\nMultiple, independently calculated\nlarge data sets show a picture of rapid\nwarming over last 100 years\n(c) Berkeley Earth. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nNOAA/NCDC\nModern direct\nmeasurements show\nclose correlation between\nCO2, and atmospheric\ntemperature\n(10 year time scales)\nDid global warming stop here?\nCourtesy of NOAA. This image is in the public domain.\n\nNOAA/NCDC\nGlobal warming did not stop there.\nCourtesy of NOAA. This image is in the public domain.\nCourtesy of Climate Central. Used with permission.\n\nWhy has the warming been so small?\nDelayed warming: ocean thermal inertia\nOceans have absorbed much of the heat\nThat heat is not \"felt\" by atmosphere yet\nUpper ocean layer (0-100m depth)\nresponds over years to decades\nDeeper ocean responds over\ndecades to centuries\n(c) Nucitelli et al. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nWhy has the warming been so small?\nCooling from aerosols:\n- Industrial processes emit SO2 aerosols\n- particles scatter light, reflect incoming\nradiation\n- nucleate clouds, reflect radiation\n- may offset up to 25% of GG forcing\n- Lots of uncertainty.\n[Ruddiman Fig. 19-18 removed due to copyright restrictions.\nRuddiman, William F. Earth's Climate: Past and Future. 3rd Edition.\nW.F. Freeman and Co., New York. 2014.]\n\nClimate Oscillations\nNOAA Pacific Marine Environmental Lab\nEl Nino Southern Oscillation\n- Warm ocean temps in east-central tropical\nPacific\n- Reduced precipitation in west tropical\nPacific\n- Irregular, 2-7 year recurrence\n- Typically results in elevated global avg.\ntemps\n(c) American Association for the Advancement of ^cience. All rights reserved. This\ncontent is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nClimate Oscillations\n[Ruddiman Fig. 18-22; A: positive PDO phase, B: time scale of\noscillation removed due to copyright restrictions. Ruddiman, William\nF. Earth's Climate: Past and Future. 3rd Edition. W.F. Freeman and Co.,\nNew York. 2014.]\nPacific Decadal Oscillation\n- Flips between \"positive\" and \"negative\"\nphases\n- Positive means warm ocean temps in\neastern Pacific, cooler temps in\nnorthwestern Pacific\n- Negative has opposite pattern\n- Years to decades time scale\n\nClimate Oscillations\n[ Ruddiman Fig. 18-23 removed due to copyright restrictions.\nRuddiman, William F. Earth's Climate: Past and Future. 3rd Edition.\nW.F. Freeman and Co., New York. 2014.]\nNorth Atlantic Oscillation\n- Also flips between \"positive\" and\n\"negative\" phases, with varying strength\n- Positive means warmer, wetter weather in\nNorth Atlantic, cooler in tropics\n- Negative has opposite pattern (-ish... it's\ncomplicated)\n- Years to decades time scale\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "EC.719 Water, Climate Change, and Health, Lec 3: Climate 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-719-d-lab-water-climate-change-and-health-spring-2019/8e30e236fd88fef1cafbf780d2d0f2ec_MITEC_719S19_lec3.pdf",
      "content": "Definitions\nClimate: the composite or generally prevailing weather conditions of a\nregion, throughout the year, averaged over a series of years.\nWeather: the state of the atmosphere at a place and time with respect to\nwind, temperature, cloudiness, moisture, pressure, etc.\n\nDefinitions\nClimate: your personality\nWeather: your mood today\n(Dr. Marshall Shepherd, former President AMS)\n\nEarth is 4.5 billion years old (ish)\nA timeline, in billions of years ago:\n- 3.8: solid rocks and archaea\n- 3.5: cyanobacteria and photosynthesis (anoxygenic)\n- by 2.3: first eukaryotes appear and oxygen begins to accumulate\n(\"Great Oxidation Event\" - rust layers in sea floor)\n- 1.0: first multicellular life (oxygen dependent)\n- by 0.5: first vertebrates, trilobites, vascular plants\nLiving stromatolites in Shark Bay,\nWestern Australia\nCourtesy of jsjgeology on Flickr. Used under CC-BY.\nCourtesy of madelinebird on Flickr.\nUsed under CC BY-NC-SA.\n\nEarth is 4.5 billion years old (ish)\nTimeline of Earth's History\nEarth formed\n(~4.65 bya)\nOldest\nbacteria\nfossils\nBacterial\nEcosystems\nSulphate\nreducing\nbacteria\nSingle-\ncelled\neukaryotes\nMulti-\ncellular\neukaryotes\nHigher\nalgae\nEdiacaran\nfauna\nCambrian\nperiod\nFlowers\nFish\nLand\nplants\nEarly\nreptiles\nModern\nmammals\nTime (billions of years ago from present)\nOxygen levels\nincrease\n1.0\n2.0\n3.0\n4.0\n0.0\nMajor\nextinctions\n70% to > 90%\nOldest\nrocks\n\nApollo 8 image of Earth by William Anders, AS8-14-2383\nWe are on a rock hurtling\nthrough space.\nWhat makes life possible?\nCourtesy of NASA. Image is in the public domain.\n\nWe are on a rock hurtling\nthrough space.\nWhat makes life possible?\nCompare Mars: diurnal\ntemperature varies from\n0 to -80°C (32 to -112°F).\nNASA\nCourtesy of NASA, J. Bell (Cornell U.) and M. Wolff (SSI). Images are in the public domain.\n\nWe are on a rock hurtling\nthrough space.\nWhat makes life possible?\nCompare Mars: diurnal\ntemperature varies from\n0 to -80°C (32 to -112°F).\nOr Mercury: 430°C during\nday, -170°C at night\nNASA\nCourtesy of NASA, J. Bell (Cornell U.) and M. Wolff (SSI) and NASA/JHUAPL/Carnegie Institution of Washington/\nUSGS/Arizona State University. Images are in the public domain.\n\nVenus vs. Earth:\nthe greenhouse effect\n- Venus' surface temperature is 460* C (860* F)\n- Earth's surface temperature is 14*C (57* F).\n- Venus receives almost twice as much solar radiation from\nthe Sun as Earth; 80% is reflected by dense clouds, vs.\n26% from Earth.\n- CO2 on Venus: 96.5%; CO2 on Earth = 0.04%.\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nUS EPA, 2014\nGreenhouse gases act as a blanket, trapping the sun's energy.\nMajor greenhouse gases:\nCarbon dioxide\nMethane\nNitrous oxides\nCFCs\nwater vapor\nCourtesy of US EPA. Image is in the public domain.\n\nBecause Earth is warm and temperate, we have liquid water.\nBecause we have liquid water, we have life (as we know it).\nLiquid Water\nWater Vapor\nIce\nVenus\nEarth\nJupiter\nUranus\nPluto\nMars\n-300\n10,000\n0.01\n0.0001\nPressure (atm)\nTemperature (C)\n\nA quick introduction to\nglobal carbon cycling\n- most carbon in sediments and rocks\n- \"fast\" cycling through surface pools,\natmosphere, biosphere (months to\ncenturies)\n- slow cycling between rocks and surface\n(millions to billions of years)\n[Figure removed due to copyright restrictions. Ruddiman, William F. Earth's\nClimate: Past and Future. 3rd Edition. W.F. Freeman and Co., New York. 2014.]\n\nA quick introduction to\nglobal carbon cycling\nSlow cycling between rocks and surface pools:\nCarbon enters atmosphere through volcanoes,\nhot springs\nCarbon leaves surface pools via rock\nweathering, transport, deposition\n*This process is climate-dependent*\n[Figure removed due to copyright restrictions. Ruddiman, William F. Earth's\nClimate: Past and Future. 3rd Edition. W.F. Freeman and Co., New York. 2014.]\n\nSchematic of global ocean circulation associated with the Meridional\nOverturning Circulation, a.k.a. thermohaline circulation. From Kuhlbrodt et\nal. 2007 via Delworth et al., 2008\n- Water warms at equator\n- Evaporation increases\nsalinity\n- Surface water flows\nnorth, releases heat at\nhigher latitudes\n- Dense, cold, high-salinity\nwater sinks and flows\nsouth toward Antarctica.\nOceans are major heat transport systems\n(c) American Geophysical Union. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nEarth's temperature and climate have always changed.\nNASA graph by Robert Simmon, based on data from Jouzel et al., 2007\nCourtesy of NASA. Image is in the public domain.\n\nAnd CO2 concentrations correlate with temps\nCourtesy of NASA. Image is in the public domain.\n(c) Scripps Institution of Oceanography, UC San\nDiego. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more\ninformation, see\nhttps://ocw.mit.edu/help/faq-fair-use/\n\nIce core samples show close\ncorrelation between CO2, CH4,\nand atmospheric temperature\n(100,000 year time scales)\n(c) Sam Carana. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\n\nIPCC/Michael Mann, 2015\nOverall trend toward cooling, until industrialization:\n(c) Michael Mann/IPCC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nOverall trend toward cooling, particularly pronounced in the Arctic\n(c) ARCUS. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nHow do we know what we know?\n\nEarly climate research:\n\nJoseph Fourier, 1827: visible light infrared when absorbed by a surface;\natmosphere is transparent to visible but opaque to IR (light comes in but heat can't\nget out).\nEunice Newton Foote, 1856: water vapor and CO2 warm more than other gases,\ncomposition of atmosphere affects temperature\nJohn Tyndall, 1861: expanded on Foote's work, didn't cite her, gets all the credit\nSvante Arrhenius, 1896: calculated climate sensitivity, described water vapor and ice\nalbedo feedback mechanisms, thought a warmer world would be kind of nice\nCharles David Keeling, 1957-2005: invented atmospheric CO2 analyzer, started\nmeasurement program on Mauna Loa\nWally Broeker, 1975 - 2019: developed theory of thermohaline circulation,\npopularized term \"global warming\"\n\nEunice Newton Foote (1819 - 1888)\n- Conducted experimental work on the warming effect of the sun\non air, and how warming increased by water vapor and\ncarbonic acid gas (carbon dioxide).\n- Her experimental work was presented by Prof. Joseph Henry at\nthe 8th annual American Association for the Advancement of\nScience (AAAS) meeting in 1856, (because women weren't\nallow to present).\n- Foote was the 2nd female member of AAAS.\n- The 1st was the famous astronomer Maria Mitchell, who was\nEllen Swallow Richard's professor at Vassar.\nNo known photo exists of\nEunice Newton Foote.\nBut there is a photo of her\ndaughter, Mary Foote\nHenderson\nImage is in the public domain.\n\nJohn Tyndall (1820 - 1893)\n- Tyndall explained the heat in the Earth's atmosphere in terms of the\ncapacities of the various gases in the air to absorb radiant heat, also\nknown as infrared radiation. His measuring device, which used\nthermopile technology, is an early landmark in the history of absorption\nspectroscopy of gases.\n- He was the first [or 2nd if credit goes to Eunice Foote] to correctly\nmeasure the relative infrared absorptive powers of the gases nitrogen,\noxygen, water vapour, carbon dioxide, ozone, methane, in the 1859\n(four years after Eunice Foote's work).\n- He concluded that water vapor is the strongest absorber of radiant heat\nin the atmosphere and is the principal gas controlling air temperature.\nAbsorption by the other gases is not negligible but relatively small.\n- Prior to Tyndall it was widely surmised that the Earth's atmosphere has\na Greenhouse Effect, but he was considered to be the first to prove it.\nThe proof was that water vapor strongly absorbed infrared radiation.\n- [Eunice Newton Foote's experimental work is only recently discovered].\nImage courtesy of the Smithsonian. Image is in the public domain.\n\nMajor climate archives, data from:\n- Sediments\n- Ice cores\n- Corals\n- Trees\n- Historical\n- Instrumental\n\nRuddiman, W. F. Earth's Climate: Past and Future, 2014.\n\"Like written chronicles of human history, climate archives hold the story of climate change for those\nwho can read them.\"\nQuestions:\n1. Why does the importance of different climate archives change for different time scales?\n2. How does the method of dating climate records vary with the type of archive?\n\nSediments:\n- Lakes, coastal ocean, deep ocean\n- Pollen record, diatoms and foraminifera\nrepresent climate conditions (temperature,\nO2 availability, ocean circulation)\n- Dated with radioisotopes, volcanic ash\nGlobotruncana falsostuarti, 75 million years old. Brian Huber/Smithsonian\nImage is in the public domain.\n\nCoral reefs:\n- Corals form annual bands like tree rings\n- Thickness represents temperature, water\nclarity, nutrient availability\n- Chemistry represents temperature, rainfall\nX-ray image Thomas Felis, Research Center Ocean\nMargins, Bremen\nOxygen isotope ratios in corals correlate well\nwith the Southern Oscillation Index (\"El Nino\").\nCole et al., Science, 1993\nCourtesy of NASA. Images are in the public domain.\n\nIce cores:\n- Mountain glaciers, Greenland, Antarctica;\ngas bubbles trapped in ice\n- Dated by counting layers, volcanic ash,\nradioisotopes, ice flow models\n- Directly measure gas concentrations, infer\nclimate from stable isotopes\n- Hundreds to 800,000 years BP\n\nTree rings:\n- Annual rings, width represents temperature,\nwater availability\n- Can build records up to 9,000 year BP\nNASA\nBristlecone pines can\nlive >4,000 years.\nImage: National Park\nService\nImages are in the public domain.\n\nInstrumental and Historical\n- 100 years of reliable instrumental data\n(weather stations, buoys)\n- Satellites since 1970s\n- Several hundred years of historical\nrecords, often require calibration\n\nExample 1: Historical Archives\nMassachusetts - Blue Hill Observatory\n\"Home of the Oldest Climate Record in the USA\"\nBuilt: 1885. Oldest, continuously operated weather Observatory in the United States\nhttp://bluehill.org/observatory/about-us/history/\nCourtesy of John Phelan (Faolin42) on Wikipedia. Used under CC BY.\n\n(c) Blue Hill Observatory. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nExample 2: Historical Archives\nfrom: Henry David Thoreau's\ndetailed records of the 1850s\n\"I often visited a particular plant four\nor five miles distant, half a dozen times\nwithin a fortnight, that I might know\nexactly when it opened.\"\nH.D. Thoreau Journal, Dec.1856\nCourtesy of terryballard on Flickr. Used under CC BY.\n\nHenry David Thoreau's journals from 1851-1858\nHighbush blueberry\nVaccinium corymbosum\nCourtesy of Richard Primack. Used with permission. \"Climate Change Comes to Concord.\" Arnold\nArboretum Presentation 3/26/16\nCourtesy of anitagould on Flickr. Used under CC BY-NC.\nThoreau's writing is in black and Richard Primack's notes are in blue.\n\nFirst Flowering Day in Concord;\nThoreau (1850s), Hosmer (1890s), Primack & Miller-Rushing (2004-2012)\nfrom a paper by Elizabeth Ellwood published in PLOS One in 2013\nCourtesy of Richard Primack. Used with permission. \"Climate Change Comes to Concord.\" Arnold Arboretum Presentation 3/26/16\n\nTopex Poseidon\n\"Topex/Poseidon revolutionized the\nstudy of Earth's oceans, providing the\nfirst continuous, global coverage of\nocean surface topography and allowing\nus to see important week-to-week\noceanic variations,\" said Dr. Mary\nCleave, associate administrator for\nNASA's Science Mission Directorate. \"Its\ndata made a huge difference in our\nunderstanding of the oceans and their\neffect on global climatic conditions.\"\nArtist's concept of Topex/Poseidon. Image credit: NASA/JPL\nImage is in the public domain.\n\nTopex Poseidon\n- Verified and corrected ocean\ncirculation models\n- Accurately measured global sea levels\n- Planned 3 year mission, operated for\n>10 years\n- Mission continues with Jasons 1, 2,\nand 3\nArtist's concept of Topex/Poseidon. Image credit: NASA/JPL\nImage is in the public domain.\n\nNASA Earth Observing System (partnership with space agencies of Japan,\nFrance, Germany, Argentina, E.U., others), includes:\n- GRACE - presence and movement of water and ice\n- CALIPSO - clouds and aerosols\n- OCO-2 (Orbiting Carbon Observatory) - atmospheric CO2\n- Aqua and Terra - clouds and radiative energy, sea surface temperature (and\ngorgeous images)\nGalapagos Islands as viewed by Aqua MODIS, image: Jeff Schmalz, NASA.\nImage is in the public domain.\nCourtesy of NASA. Image is in the public domain.\n\nNOAA Paleoclimate Data\nhttps://www.ncdc.noaa.gov/data-access/paleoclimatology-data/datasets\nCarbon Dioxide Information\nAnalysis Center\nhttp://cdiac.ornl.gov/mission.html\n\nData Focus Areas:\nFossil-Fuel CO2 Emissions\nTrace Gas Emissions\nAtmospheric Trace Gases & Aerosols\nOceanic Trace Gases\nCarbon Cycle\nTerrestrial Carbon Management\nVegetation Response to CO2 & Climate\nClimate\nLand-Use & Ecosystems\nMost data curated and freely accessible!\nCourtesy of NOAA. Image is in the public domain.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nEC.719 D-Lab: Weather, Climate Change, and Health\nSpring 2019\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}