{
  "course_name": "Dance Theory and Composition",
  "course_description": "This course introduces students to the art and formal ideologies of contemporary dance. We explore the aesthetic and technical underpinnings of contemporary dance composition. Basic compositional techniques are discussed and practiced, with an emphasis on principles such as weight, space, time, effort, and shape. Principles of musicality are considered and developed by each student. Working with each other as the raw material of the dance, students develop short compositions that reveal their understanding of basic techniques. Hopefully, students come to understand a range of compositional possibilities available to artists who work with the medium of the human body.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music Theory",
    "Performance Arts",
    "Dance",
    "Fine Arts",
    "Music",
    "Music Theory",
    "Performance Arts",
    "Dance"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nDescription\n\nThis course will introduce students to the art and formal ideologies of contemporary dance. We will explore the aesthetic and technical underpinnings of contemporary dance composition. Basic compositional techniques will be discussed and practiced, with an emphasis on principles such as weight, space, time, effort, and shape. Principles of musicality will be considered and developed by each student. Working with each other as the raw material of the dance, students will develop short compositions that reveal their understanding of basic techniques. Hopefully, students will come to understand a range of compositional possibilities available to artists who work with the medium of the human body.\n\nThe class will be conducted as a workshop, with strength and coordination exercises leading to exploratory exercises in each class meeting. Selected viewing and reading exercises will augment classroom work. In addition, the class will attend at least two professional dance events in the Boston area.\n\nThis course will be an intermediate-level offering. Students with no dance background should take Introduction to Acting before enrolling. Students with dance background may petition the instructor to enroll.\n\nThere is no required text for this class.\n\nRequirements\n\nContribution to the Warmup\n\nAt two or three intervals during the semester, each student will contribute movement to the warmup sequence of the class. The contribution could involve any of the following:\n\nFocusing Sequence\n\nMovements designed to aid in relaxation, breath control, and careful focus of energy into specific body parts.\n\nStretching Sequence\n\nMovements designed to stretch particular body parts such as spine, neck, and legs.\n\nStrengthening Sequence\n\nMovements designed to strengthen particular muscle groups, such as those in the arms, abdomen, and legs.\n\nBalancing Sequence\n\nMovements designed to challenge sustained mastery of balance.\n\nCompositions\n\nEach student will present four composition fragments over the course of the semester. The first will be performed in silence; the second with minimal rhythmic accompaniment; the third with music of the choreographer's choice; the fourth with music composed in collaboration with Akili Jamal Haynes, course musician. The first fragment will deal with the concept of time; the second with the concept of weight; the third with the concept of space; and the fourth will offer a synthesis of work from the entire semester.\n\nWritten Documentation - Journal\n\nEach student will keep a journal of her explorations in the class. The journal may include choreographic notes, drawings, literary ideas, or technical exercises. But it\nmust\ninclude the following:\n\nA periodic \"check in\" with your body, as in what feels how, when, and possibly why. This discussion should take the form of a series of questions and statements, as in \"my back felt very tight this morning, no doubt because of my 8.01 exam. How can I articulate the space between my vertebrae as I sit in that overcrowded classroom?\" Or, \"Walking down the Infinite Corridor today, I noticed that my hands were stretching and contracting in rhythm with my steps. What if I made a phrase out of only my hand movements?\"\n\nThe longhand literary descriptions of your choreographic plans. The texts (poems, statements, drawings, newspaper articles) that inspire and inform your compositions.\n\nYour own assessment of your dances. What sections were you satisfied with? Why? Which sections would you like to continue working on? Why?\n\nThe journal will be collected three times during the semester, after your showing of each short composition.\n\nGrading\n\nGrading will be determined by an assessment of class participation, the extent to which exercises are fully explored, and the achievement of self-imposed challenges set out for each student. There will be at least one performance event: an informal end-of-term showing of material.",
  "files": [
    {
      "category": "Resource",
      "title": "“Name Map” Phrase",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-675-dance-theory-and-composition-fall-2003/b0c64af03dc13dce3644dcebd8494fae_assignment_02.pdf",
      "content": "Dance Theory and Composition\n21M.675 Fall, 2003\nThomas F. DeFrantz\n\n\"Name Map\" Phrase\n\nOn a large sheet of paper, write out your entire name, including all middle names\nand surnames, in any script you like. The script must be in the form of a single\nline; that is, the line must begin on one side of the page and end on the other\nwithout interruption.\n\nYour script should be in one color, as in black ink on white paper.\n\nWe will use your script as the basis for a movement phrase as follows: imagine\nthe floor as the sheet of paper. Trace the script of your name in one movement\nphrase moving across the floor. You should create and vary your movements\naccording to level (on the floor, on supports of hands or feet, in the air) and\ntempo (slow, medium, and fast). All six variations of movement should be evident\nin your finished phrase. Note that tracing the path on the floor should provide the\nimpulse for all of the movement that you create."
    },
    {
      "category": "Resource",
      "title": "Accumulation Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-675-dance-theory-and-composition-fall-2003/3c9348d5ce3a9d0e4358eabf37a3c344_assignment_01.pdf",
      "content": "Dance Theory and Composition\n21M.675 Fall, 2003\nThomas F. DeFrantz\n\nAccumulation Exercise\n\nThe details of the accumulation assignment are these:\n\nYour accumulation must have at least 6 parts. There may be as many\nmore as you like\n\nYour accumulation series must rise and fall in one of two patterns: 1, 12,\n123, 1234, 12345, 123456, 12345, 1234, 123, 12, 1 or 1, 121, 12321,\n1234321, 123454321, 12345654321, 123454321, 1234321, 12321, 121,\n1. note that it must both rise and fall back to 1.\n\nYour accumulation must incorporate text as an element. The text element\nmay be additional to the gestures you devise or it may be a 'gesture' in\nitself in the accumulation (that is, text may be a 'number' in the series so\nlong as it repeats). Text which is not a 'gesture' needn't repeat.\n\nYour accumulation gestures should always return to a recognizable,\nneutral position.\n\nYour accumulation gestures must be constructed first of equal\nperformance duration - in essence, one count to a gesture.\n\nAfter you compose your gestures, you must vary the tempo of the\ngestures to create a rhythmic contrast in the series. Some gestures should\nbe extended, some should be compressed, and some should be one to a\ncount.\n\nYou are welcome to insert additional gestures or text anywhere in the\nseries that you like\n\nThe 'finished' accumulation series will be shown in class."
    },
    {
      "category": "Resource",
      "title": "Image Map",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-675-dance-theory-and-composition-fall-2003/01c61e3eaa107547a237fdd0b2a72e9f_assignment_03.pdf",
      "content": "Dance Theory and Composition\n21M.675 Fall, 2003\nThomas F. DeFrantz\n\nImage Map\n\nFind a representation of a color painting of any era that attracts you. Bring six\ncopies to class.\n\nWe will use the xerox as the basis for a movement phrase as follows:\n\nWorking with classmates as dancers, create a movement phrase that varies\nelements of composition from the entire semester. Each dancer should somehow\nrepresent a particular area of the image, a color or range of hues, or a series of\nlines that outline shapes or figures on the image."
    },
    {
      "category": "Resource",
      "title": "Word Phrase",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-675-dance-theory-and-composition-fall-2003/9514056fecacb60c3d509e75b3c9a0ff_assignment_04.pdf",
      "content": "Dance Theory and Composition\n21M.675 Fall, 2003\nThomas F. DeFrantz\n\nWord Phrase\n\nIn your journal, write an entry of at least two pages that describes, in some detail, a\nstrong memory of dance. Your might describe your first strong memories of dance\nclass; a family event where you danced as a child; an early performance at your grade\nschool or dance studio; or events around dance at a high school prom.\n\nWe will use the journal entry as the basis for a movement phrase as follows:\n\nCreate a movement for each syllable of each word of the first paragraph of your entry.\nEach syllable must have a corresponding gesture; the gestures need not have any\nrelation to the words or their meaning. We will work in class on performing the phrase\nyou create with a tempo approximating speech."
    }
  ]
}