{
  "course_name": "Darwin and Design",
  "course_description": "Humans are social animals; social demands, both cooperative and competitive, structure our development, our brain and our mind. This course covers social development, social behaviour, social cognition and social neuroscience, in both human and non-human social animals. Topics include altruism, empathy, communication, theory of mind, aggression, power, groups, mating, and morality. Methods include evolutionary biology, neuroscience, cognitive science, social psychology and anthropology.",
  "topics": [
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Philosophy",
    "Metaphysics",
    "Science",
    "Cognitive Science",
    "Humanities",
    "History",
    "Intellectual History",
    "Literature",
    "Philosophy",
    "Metaphysics",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nIn the\nOrigin of Species\n(1859), Charles Darwin gave us a model for understanding how natural objects and systems can evidence design without positing a designer: how purpose and mechanism can exist without intelligent agency. Texts in this course deal with pre- and post-Darwinian treatment of this topic within literature and speculative thought since the eighteenth century. We will give some attention to the modern study of feedback mechanisms in artificial intelligence. Our reading will be in Hume, Voltaire, Malthus, Darwin, Butler, H. G. Wells, and Turing.\n\nCourse Requirements\n\nClass Format\n\nOur format will be two 1 1/2 hour general meetings with in-class discussion of readings and exploration of issues raised by them. This is primarily a reading course, with a special emphasis on writing. Our focus is on books and interpretation.\n\nThis course consists of four topics:\n\n1. William Paley's problem: Does the existence of design (organized, self-sustaining, or self-reproducing systems) argue that there is a designer or organizer, an intelligent agency responsible for its creation?\n\n2. Alan Turing and John Searle's problem: Can such allegedly designed systems be credited with intelligence themselves?\n\n3. The place of Darwin's Origin and his idea of Natural Selection in the course of debates on the first two problems.\n\n4. The implication of Darwin and Darwinism for ideas of nature and of mankind's place therein, as well as collateral, and often independent, manifestations of such undesigned worlds in literary texts.\n\nReadings\n\nReadings consist of textbooks and selections. Your reading and discussion of authors who have considered this question will help provide you with a historical foundation for understanding a rich literary tradition, as well as many assumptions held by people in many contemporary cultures.\n\nAssignments\n\nThere will be about 100 pages of weekly reading - sometimes less, sometimes more.\n\nThe class will place extra emphasis on writing and speaking.\nThere will be 3 papers: two 5-page, and one 10-page. You will be asked to revise the 10 page paper.\nSuggested topics for writing are given below. Late papers will be penalized unless extensions are granted in advance of the paper deadline.\n\nDiscussion will be our main means of exploring the class topic. Everyone should contribute to class discussions. To encourage discussion, we will hold panel discussions and break into small discussion groups from time to time.\n\nYou will also be asked to introduce a class discussion during the term, to participate in a panel discussion, and to give a short class oral presentation on your main paper.\n\nAttendance\n\nTwo unexcused absences are ok, but more will result in a lower grade.\n\nGrading\n\nThere may be occasional\nquizzes\nto help you maintain your reading discipline.\n\nThere will be\nno final exam\nin the class.\n\nClass participation will be factored into your final grade as a plus, minus, or neutral.\n\nACTIVITIES\n\nPERCENTAGES\n\nEssays\n\n80%\n\nTalk\n\n20%\n\nMIT Literature Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCourse Calendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction: Wordsworth's\nTintern Abbey\nand the idea of design in nature.\n\nCarroll,\nAlice's Adventures in Wonderland\n. The fantasy world of anti-design.\n\nAristotle,\nGenesis\n. Selections from the Physics. Pattern recognition, narrative and analytical, in nature in the ancient world.\n\nVoltaire,\nCandide\n. The Accidental World.\n\nHume,\nDialogues Concerning Natural Religion\n: Three theories of world origins.\n\nHume,\nDialogues\n(cont.): Is the world a Rube Goldberg machine?\n\nPaley,\nNatural Theology\n: Intelligent Design Theory.\n\nEssay 1 due\n\nAdam Smith,\nWealth of Nations_\n: S_elf-Organized Complexity?\n\nMalthus,\nAn Essay on the Principle of Population\n: Compound Interest in the biological realm.\n\nMalthus,\nPrinciple of Population\n.\n\nDarwin,\nOn the Origin of Species\n.\n\nDarwin,\nOrigin\n(cont.)\n\nDarwin,\nOrigin\n(cont.)\n\nDarwin,\nDescent of Man\n(selections)\n\nButler,\nErewhon\nor\nOver the Range\n.\n\nEssay 2 due\n\nButler,\nErewhon\n(cont.)\n\nWiener,\nGod and Golem, Inc.\n(selections)\n\nTuring and Searle Essays on computers and evolutionary issues\n\nTuring, Searle (cont.)\n\nStevenson,\nThe Strange Case of Dr. Jekyll and Mr. Hyde\n.\n\nHuxley,\nProlegomena to Evolution and Ethics\n.\nClass oral presentations\n\nH. G. Wells,\nThe Time Machine\n.\n\nDraft of essay 3 due\n\nWilliam Gibson,\nNeuromancer\n.\nClass oral presentations (cont.)\n\nWilliam Gibson,\nNeuromancer\n(cont.)\nClass oral presentations (cont.)\n\nWilliam Gibson,\nNeuromancer\n(cont.)\nClass oral presentations (cont.)\n\nWilliam Gibson,\nNeuromancer\n(cont.)\nClass oral presentations (cont.)\n\nFinal version of essay 3 due",
  "files": []
}