{
  "course_name": "Data, Models, and Decisions",
  "course_description": "No description found.",
  "topics": [
    "Business",
    "Management",
    "Operations Management",
    "Supply Chain Management",
    "Engineering",
    "Computer Science",
    "Data Mining",
    "Systems Engineering",
    "Systems Optimization",
    "Mathematics",
    "Probability and Statistics",
    "Business",
    "Management",
    "Operations Management",
    "Supply Chain Management",
    "Engineering",
    "Computer Science",
    "Data Mining",
    "Systems Engineering",
    "Systems Optimization",
    "Mathematics",
    "Probability and Statistics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 sessions / week, 1 hour / session\n\nCourse Description\n\nMany managerial decisions--regardless of their functional orientation--are increasingly based on analysis using\nquantitative\nmodels from the discipline of management science. Management science tools, techniques and concepts (e.g., data, models, and software programs) have dramatically changed the way businesses operate in manufacturing, service operations, marketing, transportation, and finance. This subject is designed to introduce first-year Sloan students to the fundamental techniques of using data to make informed management decisions. In particular, we will focus on various ways of modeling, or thinking structurally about, decision problems in order to enhance decision-making skills.\n\nRather than survey all of the techniques of management science, we stress those fundamental concepts that we believe are most important for the practical analysis of management decisions. Consequently, we focus on evaluating uncertainty explicitly, understanding the dynamic nature of decision-making, using historical data and limited information effectively, simulating complex systems, and optimally allocating resources. The implementation of these tools has been facilitated considerably by the development of spreadsheet-based software packages, and so we will make liberal use of spreadsheet models.\n\nIt is impossible to teach you all there is to know about management science techniques in only one semester; rather, our goal is to enable you to become intelligent users of management science techniques. In that vein, emphasis will be placed on how, what and why certain techniques and tools are useful, and what their ramifications would be when used in practice, all in concert with the overarching goal for you to become excellent managers. This will necessitate some mechanical manipulations of formulas and data, but it is not our goal for you to become adept handlers of mathematical equations and computer software.\n\nTo give you a perspective on how management science is used in practice, much of the material will be presented in the context of practical business situations from a variety of settings. We hope that this illustrative material will help you in selecting future subjects.\n\nGrading\n\nYour course grade will be based on a final exam, a quiz, case write-ups, homework assignments, and class participation, as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nFinal Exam (3-hour exam)\n\n40%\n\nCase Write-ups and Homework Assignments\n\n30%\n\nQuiz (1.5-hour test held in class)\n\n20%\n\nClass Participation\n\n10%\n\nBy definition, class participation will be subjectively evaluated (\nsee below\n).\n\nMuch of your education will take place outside the classroom, as you study, review, and apply the topics to which you are introduced in class.\n\nCase Write-Ups:\nCase write-ups should consist of a memo that is no more than two pages of text, single-sided. The memo should be void of calculations and written in a managerial style; the memo should clearly articulate your recommendations and proposals. Up to six pages of supporting documents (charts, figures, calculations, etc.) may be appended to the memo. We recommend that no more than 8 hours be devoted to any case write-up. There will be two types of case write-ups (team assignments as well as individual case write-ups). For team assignments, you should work as a team and submit one case write-up per team. Individual case write-ups on the other hand should represent only the work of a single student. You may discuss the case with other students in your team, the teaching assistants, or the professors of the course, but the memo and the analysis should represent only your own work.\n\nHomework Assignments:\nHomework assignments are designed to help you learn the mechanics of the methods discussed in class and to give you an opportunity to apply these concepts in a straightforward manner. Because mastery of the basic mechanics is necessary for effective and discerning usage of the concepts, we require that you do the homework assignments individually.\n\nIn addition to their value as learning exercises, doing a careful and thorough job on the homework assignments is the best preparation for the final examination of the course.\n\nThere are three types of assignments:\nRead\n,\nPrepare\nand\nHand In\n.\n\nRead:\nWhen the assignment is to\nRead\nsome material, this reading is an important introduction to the topics to be discussed in class. We will proceed on the assumption that you have done the reading before class and have understood much (but not necessarily all) of it. When the assignment is to\nRead\na problem, that problem will often be used in class to introduce new concepts. You should be familiar with the problem, but you will not be expected to have fully analyzed it before the discussion in class.\n\nPrepare:\nFully analyze the problem. Be ready to discuss it in class, with model equations formulated, the numbers computed, etc. We will cold-call on people, so please be ready.\n\nHand In:\nThe same as Prepare, but you must turn in your analysis. All written assignments must be handed in at the beginning of class on the day they are due, and so you will probably want to make a copy of your assignment for reference during class. All written assignments will be graded and returned to you.\n\nTeam Work\n\nThere are three types of assignments: (i) team cases (these should be done as a team and you only need to hand in one write-up per team), (ii) individual homeworks and (iii) individual case write-ups (the latter two need to be done individually). Nevertheless, even for (ii) and (iii), you may find it useful to discuss broad conceptual issues and general solution procedures with others. If this is the case, then we enthusiastically recommend that you do so. The objective here is to learn. In our opinion (and personal experiences), the material of this class is best learned through individual practice and exposure to a variety of application contexts. The syllabus specifies clearly which of the assignments are team cases.\n\nOn the first type of assignment (team case) we want you to work as a team. On the two other types of assignments we only allow \"Type 1 collaboration\". This means that collaboration is allowed, but the final product must be individual. You are allowed to discuss the assignment with other team members and work through the problems together. What you turn in, however, must be your own product, written in your own handwriting, or in a computer file of which you are the sole author. Copying another's work or electronic file is not acceptable.\n\nRequired Materials\n\nTextbook\n\nBertsimas, Dimitris, and Robert Freund.\nData, Models, and Decisions: The Fundamentals of Management Science\n. Dynamic Ideas, 2004. ISBN: 9780975914601.\n\nRecitations\n\nRecitation periods are used to review and reinforce material covered in the lectures, and to review the ins and outs of using modeling software for the course. Recitation attendance is encouraged, but it is not mandatory. Some students find the recitation period a very efficient time to absorb and reinforce the class material, while other students may prefer to absorb the class material at their own desired time. All recitations are run by the Teaching Assistants.\n\nClass Participation and Conduct\n\nYour class participation will be evaluated subjectively, but will rely upon measures of punctuality, attendance, familiarity with the required readings, relevance and insight reflected in classroom questions, and commentary. Your class participation will be judged by what you add to the class environment, regardless of your technical background. Although several lectures will be didactic, we will rely heavily upon interactive discussion within the class. Students will be expected to be familiar with the readings, even though they might not understand all of the material in advance. In general, questions and comments are encouraged. Comments should be limited to the important aspects of earlier points made, and reflect knowledge of the readings. We may call on you periodically to answer questions about either the homework or classroom developments. We will evaluate your classroom participation based on the extent to which you contribute to the learning environment. (Demonstration of mastery of advanced topics at inappropriate times does not help create a positive learning environment.) However, correcting the professor when he / she makes a mistake and asking what appear to be \"dumb questions\" about what is being covered both do help! In the case of so-called \"dumb questions,\" very often half of the class will have the same questions in mind and are relieved to have them asked.\n\nConsistent with Classroom Values@MITSloan, we have the following policies:\n\nStudents are expected to arrive promptly on time and to stay for the entire class.\n\nLaptops and e-readers are not to be open in the classroom.\n\nCell phones and PDAs are not to be used or permitted to ring in the classroom.\n\nStudents are expected to attend all classes.\n\nMaintenance of a professional atmosphere by using respectful comments and respectful humor.\n\nRefraining from distracting or disrespectful activities (e.g., avoiding side conversations and games).\n\nCourtesy towards all participants in the classroom.\n\nObservance of the most conservative standards when one is unsure about which norms apply.\n\nPlease refer to the Values@MITSloan materials for more details. Violations of Values@MITSloan policies will be marked. Three or more violations will result in an automatic penalty of a letter grade.",
  "files": [
    {
      "category": "Resource",
      "title": "Homework 1: Probability - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/c95f9a0b3d39bffea2e907a09e9a03c3_MIT15_060F14_HW1-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 1\nDue: MONDAY, September 15, 2014\n1. The number of hits per hour at the website http://thenextbigthing.com is a ran\ndom variable. The probability distribution of the number of hits per hour at this site\nis shown in Table 2.34.\nHits per Hour Probability\nxi\npi\n0.03\n0.09\n0.24\n0.27\n0.25\n0.09\n0.03\nTable 2.34: Probability distribution of hits per hour at the website\nhttp://thenextbigthing.com .\n(a) For a given hour, what is the probability that the number of hits will be between\n3 and 5 ?\n(b) Compute the mean, the variance, and the standard deviation of the number of\nhits per hour.\n2. It is estimated that 70% of all visitors to a given website are college students. The\nremaining 30% are either college graduates or have not attended college. Suppose\nthe website had twelve visitors in the last two hours.\n(a) Let X be the number of visitors (among the twelve) who are college students.\nWhat assumptions need to be satisfied in order for X to obey a binomial distri\nbution?\n(b) Modeling X as a binomially distributed random variable, what is n and what is\np in this case?\n\n(c) What is the probability that exactly eight of the twelve visitors are college\nstudents?\n(d) What is the expected number of visitors (of the twelve) who are college stu\ndents? What is the standard deviation of the number of visitors who are college\nstudents?\n3. The website http://MEGA-Retail.com features a huge variety of fitness products for\nupscale consumers. These consumers are segmented into \"smartphone consumers\"\nand \"desktop\" consumers depending on whether or not the majority of their purchases\nare conducted via their smartphones or a less-mobile device such as a desktop or lap\ntop computer. Indeed, 38% of the MEGA-Retail.com's consumer base are smartphone\nconsumers, with the remaining 62% being desktop consumers. The Consumer Fraud\nDivision of the Department of Justice has begun a preliminary investigation into the\nonline practices of MEGA-Retail.com after a newspaper article exposed complaints\nof padded charges. Their first task is to choose a random sample of 20 customers for\ninterviews and data collection regarding their transactions with MEGA-Retail.com.\n(a) What is the probability that 7 of the 20 randomly chosen consumers will be\nsmartphone consumers?\n(b) What is the probability that between 12 and 14 of the 20 randomly chosen\nconsumers will be desktop consumers?\n(c) What is the probability that 3 or fewer of the randomly chosen consumers will\nbe desktop consumers?\n4. You have made it to the final round of a game show. The announcer asks you the final\nmultiple choice question, which has four possible answers: (a), (b), (c), or (d). If you\nanswer the question correctly, you win $1,000,000. After listening to the question,\nyou realize you are not sure of the answer! Rather, you think the answer is either\nchoice (a) with probability 60%, or choice (b) with probability 40%. You know for\nsure the answer is not choices (c) or (d). You have three options at this point:\n- Choose not to answer the question. In this case, you walk away with $500,000.\n- Select an answer (either (a) or (b)). If you are correct, you win the $1,000,000.\nIf you are incorrect, you only win $32,000.\n- Phone a friend. In this option, the announcer allows you to phone your friend\nand ask her/him for help. After listening to your friend's response, you then\nwill need to answer the question. You know that:\n\n- Given that the correct answer is (a), your friend will say \"a\" with probability\n80%.\n- Given that the correct answer is (b), your friend will say \"b\" with probability\n80%.\n(a) What is the probability your friend says the answer is \"a\"? Hint: It may help\nto make a probability table.\n(b) What is the probability that the true answer is \"b\" given that your friend says\nit is \"b\"?\n(c) Make a decision tree to find your best strategy. In words, what should your\nstrategy be? How much money do you expect to win?\n5. A medical test for malaria is subject to some error. Given a person who has malaria,\nthe probability that the test will fail to reveal the malaria is 0.06. Given a person\nwho does not have malaria, the test will correctly identify that the person does not\nhave malaria with probability 0.91.\n(a) If someone has malaria, what is the probability that the test will identify that\nperson as having malaria?\n(b) Suppose three unrelated individuals who are not infected with malaria take the\ntest. What is the probability that at least one of the three individuals will be\nidentified by the test as having malaria?\n(c) In a particular area of a particular country, 20% of the population suffers from\nmalaria. If a random person from this area is tested and his test results indicate\nthat he has malaria, what is the chance that he actually has malaria?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 2: Simulation - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/1755a2ec1c66a998b1e2f13264dfa9fc_MIT15_060F14_HW2_Work.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 2\nDue: MONDAY, September 22, 2014\n1. The amount of yogurt sold by Clover each day (for their lovely yogurt parfaits) obeys\na continuous uniform distribution between 400 ounces and 600 ounces.\n(a) What is the probability that tomorrow Clover will sell between 450 and 500\nounces of yogurt?\n(b) What is the probability that tomorrow Clover will sell between 300 and 350\nounces of yogurt?\n2. Assume that the net revenue per day for a certain e-store is approximately obeys a\nNormal distribution with mean μ = $10,000 and standard deviation ( = $6,500.\n(a) What is the probability that tomorrow's net revenue will exceed $9,500?\n(b) Suppose that the probability that today's net revenue exceeds the value b is\nexactly 0.60. What is the value of b?\n(c) What proportion of the days does the store have negative net revenue?\n3. Your company melts bars of gold to produce liquid gold. The daily production of\nmelted gold approximately obeys a Normal distribution with mean μ = 50 tons and\nstandard deviation ( = 10 tons. Compute the quantiles of the daily production of\nmelted gold. More specifically:\n(a) If the probability that daily production is less than a tons is 0.25, then what is\na?\n(b) If the probability that daily production is at least b tons is 0.25, then what is b?\n(c) If the probability that daily production is at least c tons is 0.50, then what is c?\nAnd here is a slightly more challenging question:\n(d) What is the probability that daily production will be either more than 70 tons\nor less than 30 tons? (In other words, what is the probability that our Normally\ndistributed random variable will be least 2 standard deviations away from its\nmean?)\n\n4. JoAnne has gathered data on stock prices and rates of return for companies A and B,\nand has converted this data into the joint probability distribution of rates of return\nfor the two companies shown in Table 1.\nProbability\n(pi)\nAnnual Rate of\nReturn of Asset A (%)\n(xi)\nAnnual Rate of\nReturn of Asset B (%)\n(yi)\n0.04\n5.1\n6.9\n0.09\n5.3\n6.1\n0.16\n7.8\n8.3\n0.19\n8.2\n9.2\n0.17\n7.7\n7.9\n0.15\n9.0\n7.1\n0.10\n10.7\n9.3\n0.10\n11.1\n11.4\nTable 1: Joint probability distribution of the rates of return of companies A and B.\n(a) Compute the mean, variance, and the standard deviation of the rate of return\nof company A.\n(b) Compute the mean, variance, and the standard deviation of the rate of return\nof company B.\n(c) Compute the covariance and correlation of rates of the return of companies A\nand B.\n5. The website http://HelpingHomeowners.com offers a variety of information to assist\nhomeowners in repair and maintenance. The site features banner display ads of local\nservice companies and local home product companies, for which HelpingHomewners\nreceives ad revenues based on click-thrus. Let X denote the daily number of click\nthrus of display ads of homeowner service companies on the site, and let Y denote\nthe daily number of click-thrus of display ads of home product companies on the site.\nSuppose that μX = 254.1 and (X = 88.7, and μY = 177.5 and (Y = 85.2. Suppose\nfurther that CORR(X, Y ) = 0.63.\n(a) Suppose that revenue to HelpingHomewners from click-thrus is $0.04/click-thru\nfor service ads and also $0.04/click-thru for product ads. Compute the mean and\n\nstandard deviation of total daily revenues. Compare the relative risk associated\nwith revenues from service companies, revenues from home product companies,\nand total revenues. What do you observe?\n(b) Suppose that revenue to HelpingHomewners from click-thrus is $0.03/click-thru\nfor service ads and is $0.07/click-thru for product ads. Compute the mean and\nstandard deviation of total daily revenues. Compare the relative risk associated\nwith revenues from service companies, revenues from home product companies,\nand total revenues. What do you observe?\n6. You are tasked with constructing a portfolio out of three assets: A, B and C. The\nannual returns, risk, and correlations between the returns on these assets are given in\nTable 2. The requirements of the portfolio are: (i) it should be composed of exactly\ntwo assets, (ii) the funds should be invested 50% in each asset, and (iii) the expected\nannual return of the portfolio should be at least 10%.\nAsset\nAnnual Expected\nReturn(%)\nRisk\n(%)\nCorrelation\nA\nB\nC\nA\nB\nC\n-\n-0.20\n-0.15\n-0.20\n-\n0.30\n-0.15\n0.30\n-\nTable 2: Annual returns, risk, and correlation between the returns of assets A, B, and C.\n(a) Find the portfolio that satisfies all of requirements and has the minimum risk.\n(b) [Challenge] Can you find a portfolio with less risk if you can invest any percentage\nin each of the two assets (while still satisfying the minimum 10% expected return\nrequirement)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 3: EXEC-PAY Spreadsheet - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/0eeb8cec7214b4f154bc6f9e12a2bbf3_MIT15_060F14_HW3_EXEC.pdf",
      "content": "Company\nNumber\nTotal Compensation ($thousand)\nYears in current position\nChange in stock price from previous year (%)\nChange in Company's sales from Previous Year (%)\n-15\n-67\n-12\n3,067\n-27\n2,971\n-7\n-7\n1,564\n-4\n1,272\n-21\n-20\n-24\n-5\n-58\n1,066\n-73\n1,295\n1,844\n-4\n1,738\n1,732\n-5\n2,362\n1,565\n-36\n2,309\n2,913\n-18\n-16\n3,029\n1,567\n-7\n2,060\n-14\n-41\n-17\n-35\n1,989\n2,307\n-48\n1,409\n1,929\n-11\n2,243\n-12\n1,261\n-17\n-18\n2,403\n2,006\n1,753\n-24\n-41\n1,283\n-34\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 3: Regression I - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/dd6c861e4a13517d284b382d31cb4c22_MIT15_060F14_HW3-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 3\nDue: WEDNESDAY, October 1, 2014\n1. The spreadsheet EXEC-PAY.xls contains data on the annual compensation of CEOs\nof 43 publicly-traded corporations, as well the number of years that the executive\nhas been the CEO of the company, the percentage change in the stock price of the\ncompany from the previous year, and the percentage change in the company's sales\nfrom the previous year.\n.\n(a) Download the spreadsheet EXEC-PAY.xls Then construct and run a regression\nmodel to predict the CEO compensation as a function of the three independent\nvariables indicated in the spreadsheet.\n(b) What is the R2 of the regression? In your opinion is this value low or high?\n(c) What is the standard error of the regression?\n(d) What is the regression equation produced by your linear regression model?\n(e) What is the predicted CEO compensation for a CEO who has been with her\ncompany for 6 years, and for which the company's stock price has increased by\n34% in the last year, while the company's sales have decreased by 3% in the last\nyear?\n(f) Do you notice anything unusual about your regression model that might make\nyou less confident about the validity of the model?\n2. The Sloan Caf e bakes crumpets that are sold only in the afternoons. Suppose Jill\nPreisig would like to predict the sales of afternoon crumpets in order to improve\nefficiencies in the baking operation. Jill has collected daily data on sales of afternoon\ncrumpets and has run a regression model with the following independent/explanatory\nvariables:\n- the number of students who park in the Sloan parking lot on the given day\n- the outside temperature, in degrees Fahrenheit, at noon on the given day\n- the number of croissants sold at breakfast in the morning of the given day\n- the number of crumpets sold the previous afternoon of that day\n- the number of cases due in any Core class on that day\nBelow is the regression model output from Jill's model.\n\n(a) What is the regression equation of Jill's model?\n(b) What is the R2 of Jill's regression? In your opinion is this value low or high?\n(c) According to Jill's model, what is the prediction of daily crumpet sales if 40\nstudents parked in the Sloan lot that day, the temperature is 65*F, the number\nof croissants sold at breakfast was 40, the number of crumpets sold yesterday\nwas 10, and there was one Core class case due today?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.060 Data, Models, and Decisions\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 4: Hubbard Brewing Company Spreadsheet - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/897f808a43802e19fcb9f2cbab7d5b23_MIT15_060F14_HW4-HBC.pdf",
      "content": "Annual\nHops\nMalt\nAnnual\nInitial\nBeer\nSales\n(ounces\n(pounds\nAdvertising\nBitterness\nInvestment\nNumber\n($ thousand)\nper keg)\nper keg)\n($)\nScale\n($ million)\n4,800\n9.0\n8.0\n180,000\n1.4\n5,100\n9.0\n8.0\n180,000\n0.6\n5,100\n8.0\n8.0\n180,000\n0.7\n1,900\n9.0\n7.0\n140,000\n2.4\n5,300\n8.0\n8.0\n180,000\n2.3\n2,000\n12.0\n7.0\n140,000\n1.0\n3,400\n6.0\n7.0\n170,000\n1.5\n2,700\n8.0\n6.0\n180,000\n1.8\n2,100\n12.0\n7.0\n140,000\n0.7\n2,600\n5.0\n6.0\n180,000\n1.3\n3,600\n10.0\n7.0\n170,000\n1.9\n2,650\n9.0\n6.0\n180,000\n0.5\n2,200\n6.0\n7.0\n140,000\n2.1\n3,750\n12.0\n7.0\n170,000\n2.1\n2,800\n7.0\n6.0\n180,000\n2.4\n4,600\n6.0\n8.0\n160,000\n2.0\n3,700\n8.0\n7.0\n170,000\n1.7\n4,650\n11.0\n8.0\n160,000\n0.7\n5,900\n11.0\n8.0\n180,000\n1.6\n5,900\n12.0\n8.0\n180,000\n0.9\n4,700\n6.0\n8.0\n160,000\n1.1\n3,800\n6.0\n7.0\n170,000\n1.1\n3,900\n12.0\n7.0\n170,000\n1.1\n4,800\n7.0\n8.0\n160,000\n2.5\n6,050\n11.0\n8.0\n180,000\n1.7\n1,750\n13.0\n6.0\n150,000\n2.3\n5,800\n8.0\n8.0\n180,000\n0.5\n1,600\n5.0\n6.0\n150,000\n0.8\n1,700\n10.0\n6.0\n150,000\n0.8\n1,800\n14.0\n6.0\n150,000\n0.9\n4,200\n6.0\n7.0\n170,000\n2.4\n4,100\n6.0\n7.0\n170,000\n1.4\n6,200\n9.0\n8.0\n180,000\n2.1\n2,400\n13.0\n7.0\n130,000\n1.4\n5,400\n17.0\n7.0\n190,000\n2.2\n2,300\n5.0\n7.0\n130,000\n1.2\n2,500\n12.0\n7.0\n130,000\n0.9\n2,550\n12.0\n7.0\n130,000\n1.9\n6,000\n9.0\n8.0\n170,000\n1.7\n5,500\n11.0\n7.0\n190,000\n2.2\n5,800\n8.0\n8.0\n170,000\n0.6\n6,000\n8.0\n8.0\n170,000\n2.2\n6,100\n8.0\n8.0\n170,000\n2.1\n5,600\n6.0\n7.0\n190,000\n1.5\n5,700\n17.0\n7.0\n190,000\n1.3\n6,250\n8.0\n8.0\n170,000\n1.2\n4,900\n5.0\n7.0\n170,000\n1.5\n5,000\n5.0\n7.0\n170,000\n1.6\n5,100\n8.0\n7.0\n170,000\n1.4\n5,200\n8.0\n7.0\n170,000\n0.5\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 4: Regression II - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/38d6a3553d40418100e433671f70ac8c_MIT15_060F14_HW4-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 4\ndue FRIDAY, October 3, 2014: CANCELLED\nWe ENCOURAGE you to do this assignment and hand it in on either October\n3 or October 6.\n1. Exercise 6.6 of the DMD textbook. Answer questions (a)-(f). The spreadsheet for\nthis question is\nPlease note:\n\n- For question (b), you should run the regression model on your computer and\nreport the 95% confidence intervals from your regression output.\n2. Read the two regression cases entitled \"Predicting Heating Oil Consumption at\nOILPLUS\" and \"Executive Compensation\" on pages 295-299 of the textbook, and\nbe prepared to discuss how you might use regression models in these two cases. You\ndo not need to perform the analysis questions in these cases.\nprovided.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 5:  Linear Optimization - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/12c10ecc482968654258a0306a074104_MIT15_060F14_HW5-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 5\nDue: WEDNESDAY, October 29, 2014\n1. Exercise 7.2 of the DMD textbook. Answer questions (a), (b), and (c).\n2. Exercise 7.7 of the DMD textbook. Answer question (a) only, where you should write\ndown (or type) your formulation of the optimization problem. You are not expected\nto solve this linear optimization problem, only to construct the formulation of the\nmodel.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 6: Jordan Alloy Table 7.38 - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/50364d52d6c12b17a08eb18b3351a079_MIT15_060F14_HW6-Jordan.pdf",
      "content": "Metal\nW\nX\nY\nZ\nAvailability\n(tons/month)\nAluminum\n0.30\n0.40\n0.10\n0.15\nCopper\n0.30\n0.10\n0.25\n0.40\nMagnesium\n0.40\n0.50\n0.65\n0.45\nContribution to Earnings ($/ton)\n35.00\n47.00\n60.00\n140.00\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 6: Production Management  - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/efae3d03433ee2e521f96064b2bf9907_MIT15_060F14_HW6-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 6\nDue: MONDAY, November 3, 2014\n1. Read and analyze the Filatoi Riuniti case at the end of Chapter 7 of the text. Con\nstruct a linear optimization model. Write up and hand in your answers to questions\n(a), (b), (c), (f), (g), (h), and (i), at the end of the case.\n2. Exercise 7.7, continuation.\n(i). Answer question (b) of Exercise 7.7 by constructing and solving your linear\noptimization model on your computer. For your added convenience, we have\nprovided a spreadsheet that contains Table 7.38. This spreadsheet contains\nother data needed in this exercise as well.\n(ii). What is the value to Jordan Alloy Corporation of an extra ton per month of\ncopper?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 7: Discrete Optimization - 15.060 Data, Models, and Decisions - Fall 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-060-data-models-and-decisions-fall-2014/e03d0fa1a0a4b0bae7aac6095fd6bde6_MIT15_060F14_HW7-F14.pdf",
      "content": "15.060 Data, Models, and Decisions\nHomework 7\nDue: MONDAY, November 24, 2014\n1. Exercise 9.3, parts (a) and (b).\n2. Solve the optimization problem described in \"National Basketball Dream Team\" on\npages 476-478 of the textbook. Answer questions (a) and (b). You do NOT need to\nanswer question (c). The spreadsheet for this question is provided.\n3. Read the case International Industries, Inc. at the end of Chapter 9, and be prepared\nto discuss the case in class on Monday. You do NOT need to build or solve the model\nfor the case.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n'DWD0RGHOVDQG'HFLVLRQV\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}