{
  "course_name": "Design for Demining",
  "course_description": "Humanitarian Demining is the process of detecting, removing and disposing of landmines. Millions of landmines are buried in more than 80 countries resulting in more than 10,000 civilian victims every year. MIT Design for Demining is a design course that spans the entire product design and development process from identification of needs and idea generation to prototyping and blast testing to manufacture and deployment. Technical, business and customer aspects are addressed. Students learn about demining while they design, develop and deliver devices to aid the demining community. Past students have invented or improved hand tools, protective gear, safety equipment, educational graphics and teaching materials. Some tools designed in previous years are in use worldwide in the thousands. Course work is informed by a class field trip to a U.S. Army base for demining training and guest expert speakers.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering"
  ],
  "syllabus_content": "Description\n\nHumanitarian Demining is the process of detecting, removing and disposing of landmines. Millions of landmines are buried in more than 80 countries resulting in 20,000 civilian victims every year. MIT Design for Demining is a design course that spans the entire product design and development process from identification of needs and idea generation to prototyping and blast testing to manufacture and deployment. Technical, business and customer aspects are addressed. Students learn about demining while they design, develop and deliver devices to aid the demining community. Past students have invented or improved hand tools, protective gear, safety equipment, educational graphics and teaching materials. Some tools designed in previous years are in use worldwide in the thousands. Course work is informed by a class field trip to a U.S. Army base for demining training and guest expert speakers.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nIndividual assignments\n\n20%\n\nProject proposal\n\n10%\n\nDesign review 1\n\n15%\n\nDesign review 2\n\n20%\n\nProject report\n\n25%\n\nAttendance and participation\n\n10%\n\nInstructors use the marks obtained by a student and their discretion to determine a final course grade.\n\nDiscretionary considerations include attention to personal development, ethical practice, respect for others, active involvement with your work and recognition of design ability not reflected in the assessment marks given out.\n\nAssignments are available in the\nassignments\nsection.\n\nIntellectual Property Considerations\n\nMIT Policies and Procedures indicate that students own the intellectual property they create while taking MIT courses, provided the work is not developed in the course of or pursuant to a sponsored research or other agreement, not created as a \"work-for-hire\" by operation of copyright law, and not developed with the significant use of funds or facilities administered by MIT.\n\nIn all likelihood, you will own the intellectual property you create in this class. Students only occasionally combine their class work with their research or their employment work. From a legal perspective, you will not be using significant MIT funds or facilities.\n\nGiven the service nature of this course, an effective mechanism for providing service is to place final student class work in the public domain. In some cases, it is the only way to provide a community a service.\n\nAs the need arises, we will discuss intellectual property plans in further detail for individual projects. In any event, do not hesitate to talk with us if you have any questions regarding this information.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nCourse overview and logistics\n\nHomework 1 out\n\nMines and mined areas\n\nHomework 1 due\n\nHomework 2 out\n\nDemining technologies\n\nHomework 2 due\n\nHomework 3 out\n\nDemining processes\n\nHomework 3 due\n\nHomework 4 and 5 out\n\nHomework 5 out\n\nAccidents\n\nHomework 4 and 5 due\n\nHomework 6 out\n\nCommunity\n\nHomework 6 due\n\nNeeds and ideas\n\nHomework 8 out, due next day\n\nTrip to Humanitarian Demining Training Center at Ft. Leonard Wood, MO (2 days)\n\nConcept development\n\nHomework 9 out\n\nProjects and proposals\n\nHomework 9 due\n\nHomework 10 out\n\nCustomer contacts\n\nHomework 10 due\n\nHomework 11 out\n\nManufacturing\n\nHomework 11 due\n\nFinancing\n\nHomework 12 out\n\n14-15\n\nProject work\n\nDesign review 1\n\nHomework 12 due\n\n17-21\n\nProject work (cont.)\n\nHomework 13 out in Ses #20\n\nDesign review 2\n\nHomework 13 due\n\n23-26\n\nProject work (cont.)\n\nHomework 14 out in Ses #25\n\nProject report due\n\nHomework 14 due",
  "files": [
    {
      "category": "Resource",
      "title": "Report Template",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/69f38ba355b86265b24a20774279f412_MITEC_S06S07_14template.pdf",
      "content": "Project Name\nTeam member names\nCourse title\nDate\nIntroduction\nProvide a brief description of the general problem faced by deminers. Highlight the\naspect of the problem that has been addressed by you or your group.\nDesign\nProvide a brief description of the design you have developed and how it would be used.\nHighlight the principle features that enable the design to address the problem stated in the\noverview. Identify the three or so key customer requirements that drive the design.\nIdentify any known marketing issues that may influence acceptance of the design.\nMinimally, include a picture of the final prototype.\nTesting\nBriefly describe the experiments or tests that were performed, include information on\nexperimental conditions. Summarize the results, including comparisons to any controls\nthat were used. Rate the overall performance of the design or solution selected. Include\npictures when possible.\nManufacture\nDiscuss the manufacture of the prototype verses the intended manufacture of the final\ndesign. Indicate desired manufacturing methods and materials. Highlight any critical\nmanufacturing aspects, such as those aspects that strongly influence safety, performance\nor reliability. Identify key specifications that should be met in the manufacture of the\ndesign.\nFuture work\nOutline the future work that needs to be done to complete this project. This work may\ninclude addition design efforts, prototyping or experiment. Identify any outstanding\nconcerns that should be addressed.\nAppendices\nInclude an appendix for each category of substantial information that should be preserved\nfor future use on the project. Use one catchall appendix if there is limited information to\npass on. Possible topics for appendices include existing solutions, concepts considered,\nprimary scenario used, intermediate prototypes and detailed experimental data.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sample Report",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/334425b79afa114c5d9f4e04586370c9_MITEC_S06S07_14sample_repo.pdf",
      "content": "Long-handled clippers\nMIT Humanitarian Deming Course\nJanuary 6, 2004\nIntroduction\nDeminers are frequently confronted with vegetation that must be removed before demining operations\ncan continue. Deminers use mechanical vegetation clearance equipment and manual vegetation\nclearance hand tools to address this challenge. Several hand-held tools are currently used, including\ngarden clippers, shears and saws. Of these, there are no known one-handed clippers in use with long\nhandles. Long handles improve the safety of tools by keeping the operators hands away from a blast\nduring an accident. The long-handled clippers were developed to make available a safer one-handed\nclipper.\nAlthough two-handed clippers are available with long handles, they do not obviate the need for one-\nhanded clippers. Clippers are designed to cut larger vegetation such as thick stems, small branches and\nroots, which cannot readily be cut with shears. One-handed clippers are used for medium sized\nvegetation that does not require the effort of two-handed clippers. They are often used for careful work\nrequiring increased control. Finally, some people show a preference for one-handed clippers and a safer\nversion would make such a preference a safer one.\nDesign\nThe long-handled clippers are show in Figure 1. Figure 2 indicates one way the clippers would be held\nduring normal use. The clippers can be held in one hand in various orientations to cut vegetation close to\nthe ground. They may also be used to cut vegetation in other situations, but they are designed primarily\nfor cutting in an area where a blast may occur.\nFigure 1. The long-handled clippers including a top view\nand a side view.\nFigure 2. A person holding the long-\nhandled clippers in a position of normal\nuse.\nThe distance between the operating hand and the tip of the tool is substantially increased over that of\nconventional clippers, which distances the hand from a potential blast. Furthermore, the orientation of\n\nthe tool places the hand low to the ground and significantly away from the cone of a potential blast. This\nconfiguration appears to be unique and new to demining. A knife and anvil style cutting head is used to\navoid transmitting pulling forces to vegetation. These pulling forces can be created by shear style cutting\nheads and can potentially set of mines. Mechanical components, such as springs, that are often found in\nthe heads of conventional clippers have been moved to the handle area to prevent them from becoming\nprojectiles that could injure a deminer in the case of an accident.\nTesting\nThe long-handled clippers were tested on stems and roots in the Boston Massachusetts area. The cutters\nwere deemed to be versatile enough to handle the basic tasks accomplished with traditional clippers.\nThey were found to be too heavy and possibly too long, given that the operating hand is close to the\nground and out of the way. The handle orientation confounds the hand forces applied to hold the device\nin place and those applied to actuate the device. As a result, a large spring was needed to keep the\nclippers from closing while being held, which increased the clipping force and fatigue during repeated\nactuation.\nManufacture\nThe frame and fixed handle of the clippers would be made from one piece of metal. It is possible that the\nanvil could also be incorporated into this part. Additional parts would be needed for the cutting blade,\npivots, pull rod, lever and spring, giving a total part count of seven, possibly eight, pieces if integral\nfasteners are used. A significant number of pieces are attributable to the knife and anvil cutting head.\nHowever, there are current clippers that have this type of cutting head that have survived blast testing\nsuccessfully, so this high part count may not be a limiting aspect of the design. The manufacture of the\ndevice is limited to those locations with the ability to produce existing clipper designs. No new materials\nor technologies are required.\nFuture work\nThe next step in the development of the clippers is to get feedback from the demining community. If this\nfeedback is favorable, then further development work should follow, as the design presented here is an\ninitial concept prototype. Issues to be addressed include lowering the weight, improving balance,\nadjusting the sizing and decoupling positional forces from actuation forces. It is likely that a supporting\nbrace will be needed and possibly a change in handle orientation as well. Alternatives were considered\nbut not implemented in this prototype. Further consideration should be given to the location of the free\nhand during operation. Deminers may frequently place their free hand near a potential blast area to\nremove clippings as they are cut. One possibility is a feature that would allow the removal of clippings\nwith the tool in one motion. Some effort should also be made to further reduce the number of parts at the\nhead of the device, or at least to ensure that integral fasteners will be fully feasible.\nCredits\nRoshan Baliga designed the long-handled clippers in the MIT Humanitarian Demining Course taught in\nthe Spring of 2003 by Andrew Heafitz and Benjamin Linder. Benjamin Linder took the photos and\nwrote this report.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Angle Controlled Prodding",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/b15035a571df732a98e3498bd12ac200_MITEC_S06S07_angle_ctrl.pdf",
      "content": "Angle & Force Controlled Prodding\nSmitha Raghunathan\nHelen Tsai\nInstructors: Benjamin Linder & Andrew Heafitz\nSP.776 Design for Demining\nMarch 10, 2005\n\n1.0 Introduction\nThis report is intended to show the preliminary research and considerations we\ntook in the development of an Angle & Force Controlled Prodding (AFCP) tool. This\nproject was explored in conjunction with the MagRake product, and only MagRake was\npursued in greater detail to the end of the semester. However, we did make significant\nprogress in the concept development of an AFCP tool.\nThe need for this product stems from the training time for proper prodding\ntechnique and the disregard of this training when in the field. This tool would act as a\nconstant training reminder via auditory, visual or physical reminders of proper prodding\nprocedure. Additionally, this would allow a monitoring manager to note which deminers\nkeep with proper procedure, and which ones ignore it.\n2.0 Design\nThe product we considered would have to be extremely economical, as\nconventional prodders have negligible cost to demining organizations. Therefore, the\ndesigns we explored to control angle and force were simple mechanical indicators,\nimplementing no electronics (which would significantly boost cost).\nOne possible solution for monitoring force application would be the use of a\nspring placed in the barrel of the prod; once this spring was compressed a certain distance\n(corresponding to a specified application of force to the ground by the user) a simple\nbicycle bell could be rung, notifying the user of his dangerous actions. Additionally, the\nbell would also serve as an auditory cue to a manager of a break in procedure.\nThere were several offered solutions to the problem of angle maintenance while\nprodding. First was the creation of a prodding platform made of thermoformed plastic\nthat would serve as a guide for use. This would most likely be used in a training\nenvironment rather than in the field. However, there are possibilities for field use by\ncoupling this platform with a blast shield or a knee pad. Another, more field-applicable\nsolution to this problem was a similar auditory cue for misconduct as the force sensor. A\nball placed at the transition of the handle to metal probe would maintain its position at\nthat location until the handle was turned past a safe 30o orientation. At that time, the ball\n(made of some metal) would roll towards the end of the handle were it would impact a\nhollowed out shell of metal. This would act as the hammer and bell, creating a sound to\nindicate dangerous angle of use. The nature of this solution would offer auditory warning\nonly if the deminer used the prod at a dangerous angle for more than a moment. This\nwould prevent unnecessary warnings for short breaches in protocol. Also, the ball rolling\nwithin the handle would cause a subtle shift in the center of mass of the tool, thereby\nwarning the user in a physical as well as auditory manner.\nThere are many simple mechanical solutions to these problems that we have\nundoubtedly overlooked, and we are sure that some of these resolutions will one day lead\nto a product that will strongly impact the demining community.\n\n3.0 Future Work\nOne of the major issues to be addressed with this product is the demining\ncommunity's receptiveness to the idea. The main reason this product was not pursued\nover the MagRake was because we could not find a sponsor in demining community that\nadvocated the pursuit of this idea. This needs to be addressed, and it is important to find\nsomeone with experience in demining and its organizations who likes the idea of\ncontrolling angle and force of prodding in a cheap, effective manner.\nAnother issue is whether to focus the product on training or in the field. We\nbelieve there are possibilities in each area, but a strong case for the development of this\nproduct can be made for use in the field. However, even if this product was not used in\nthe field, the auditory and visual reminders of improper procedure would act as additional\ninstructors in a training environment, facilitating better use of manpower and a faster\nlearning process.\nThe final issue we considered was cost. The only way this product could be\nsuccessful in the demining community is if its cost was comparable to current demining\nprobes. This requires a very clever, low-cost, robust and reliable product. We feel this is\nwithin the grasp of students at MIT, and strongly recommend the pursuit of this product if\nan advocate in the demining community can be acquired.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Blast Testing Debrief",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/f5d9f8643326a559fc9f899d23746115_MITEC_S06S07_dem_blast.pdf",
      "content": "Blast testing debrief\n\nBlast 1\n--------------------\n200 gram 50/50% PETN/TNT\nPick prod #1\nBack hand clean, maybe do not need rear hand shield\nFront hand rubber glove split down the side\nRear handle bent, most likely based on hitting the wall in the mine\nProd is bent somewhat but is fully connected\nHand shield is damaged in multiple places on the outside\nInside is clean, Kevlar leaking out near bottom, stitching and seams coming apart a little bit\nShield is sliding is down on handle\n\nMIT clipper #1\nMetal anvil free part is missing\nArm support cuff is folded over and dinged up on the back edge, possible due to wall hit\nHinge bolt is gone, this one was a through hole, not threaded, so blade was released\nVegetation holder is mostly gone, torn off\nMushroom head on pull rod held and pull rod head, so blade was retained\nFixed blade is bent back 90 degrees or so, pull tore through part of main tube\nTape over back end of tube blew out, suggesting blast ducking\nFixed handle is almost torn off completely, unclear if this is a result of blast ducting or wall hit\nSpring stayed in place\nHinge bolt stayed in place\nThe pull rod pin stayed in place, but is somewhat exposed, perhaps overlap with pin and wall could be\nbetter\nBlast shield is completely gone, nylon exterior ripped open, Kevlar came out, need to stitch through outer\nshell\nHand was shredded, no more piano playing\n\nGerman clipper\nMain tube bent, may be due to wall hit as well as direct blast coupling\nLost the serrated vegetation retainer, bolts stayed but heads are missing, threaded bolts tend to stay in their\nholes\nPiece of plastic at the head mount disappeared\nKink in the tube at the rear adjustment slot\nRetaining clip on the handles was lost, may be due to wall hit\nHandles were bent over some, may be due to wall hit\nMain tube leading edge is somewhat damaged\nTube is dirty inside\nClipper generally did well\n\nBlast 2\n--------------------\n240 grams\nPick prod #2\nMuch like the first, but bent more\nSome seam ripping at the bottom edge\nSome stitching coming apart on the back face\nRear hand is OK\nFront hand is missing two pieces of rubber, quarter sized and JFK half dollar sized, rubber is missing, this\nparts of the hand were not behind the blast shield and might have been hit\n\nVisor\nAnti fog clip came off and was lost\n\nRoll bar was pushed up to the top of the visor just over the edge and stopped\nVisor is pitted and scratching\nPretty dirty\nFog deflector is marked up somewhat, but is fully intact\n\nVest\nVelcro opened up\nNumerous small holes in the outer fabric layer\nApparently no holes in the black fabric on the shield layer inside\nOne plastic clip broke apart\n\nHead\nSome dissolving of foam and flat nose are form solvent spray and from shipping\nLots of pitting on the neck\nPink foam in the neck hole is damaged\nPink foam is cracked in many places, possibly from rapid expansion\n\nBlast ducting tests\n1 Control - open tube\nTape blown out and round disk is gone\nHalf tube bent somewhat\n\n2 drilled holes\nTape blown out and round disk is gone\nDid not bend at all\n\n3 cut and pressed vents\nTape blown out and round disk is gone\nBent at all of the slits, were pointed up or might have torn in half\n\nBlast 3\n--------------------\n100 grams\n\nMIT Clipper #2\nPolycarbonate is completely gone\nRivet holding it on is gone too\nThreaded hole on fixed blade is cracked to outside edge but held\nSpring vegetation holder is attached but straightened out, flying in the wind\nClipper head bent up 90 degrees\nNut is loose but retained (polycarbonate was missing)\nDuct reducing shield on front of tube stayed\nTape over back end of main tube is blown out, tape was masking tape\nFree handle smashed into the back end of the main tube and was bent and creased somewhat\nBack handle separated, welds on gussets ripped off, handle pushes up tearing the bottom of the weld first\nSpring came out, probably because parts separated, spring might be used as a secondary attachment\nHand has 4 holes or tears on the back, these may have been where the hand was not covered by the shield\nSome char on hand near the blast ducting\nShield came off completely, but was probably there protecting the hand, might not have been bolted\nthrough the plastic\nShield took many hits and was very dirty even though it separated\nPlastic from the shield came out and was gone\nVelcro tore right off\n\nBlast 4\n--------------------\n50 grams\n\nMIT Clipper #3\nHead is bent up 90 degrees\nPolycarbonate anvil and rivet are gone\nVegetation holding spring is completely gone, looks like a bad weld, could be a real QC issue\nBolts hold, rivets do not, welds mostly do if done right\nDucting tape is mostly intact and is in place, cut along half of the edge, possible from sucking back in\nStuff blown out maybe give flaps so all tape was sucked and cut\nPlastic is missing from the hand guard\nHand is intact\nNo blast ducting marks\nFrames intact but is somewhat twisted\n\nRemaining 6 duct tests\nAll tape blew out again, including one mostly covered, not clear that ducting was the problem or the low\npressure wave pulled them off\n\nOther notes:\nNext time, if we do these small charge sizes, we can do them outside the mine\nFigure out what bolts are, they came from Fred's shop\nTry a bent tube to see if the blast can be ducted around a bend\nTry filling the tube with material\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Report Cards",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/d6d38b7dd4df984a5c101ddbeb30999c_MITEC_S06S07_card_deck.pdf",
      "content": "Landmine Awareness Card Deck\nMIT Humanitarian Demining Course\nRosalind Takata\nMay 10, 2005\nIntroduction\nPeople living in non-mined countries are generally not aware of the extent of the\nproblems generated by landmines. While most people understand that a landmine will maim,\nor even kill, its victim, most are not aware of the economic and social problems associated\nwith landmines, including loss of livelihood for victims - and loss of a provider for the\nvictims' families, denial of farm land and grazing land to users because of the presence of\nmines, and denial of a home to return to for refugees, whose homes are often mined when\nthey are away. Also, most people know very little about demining - what difficulties are\ninvolved, why manual demining is preferred over machines, what the cost of clearing an acre\nof land might be.\nA deck of cards, along with a simple activity, was designed to address this problem.\nThe game will help increase landmine awareness, and also aid in fund raising efforts.\nSpecifically, it was designed for social fundraising events such as the Night of 1000 Dinners\ncampaign, in which dinner parties are held to raise funds for demining (the organizers for this\ngroup expressed interest in having a card game that could be played at their events).\nDesign\nThe card deck and activity are meant to give an introduction to landmine issues - they\ndo not go into great depth or attempt to encompass every problem. The limited information\ngiven in the cards is chosen both to address the major problems associated with landmines\nand to interest users and make them want to learn more.\nThe deck is made up of card pairs. Each pair of cards, when looked at together, gives\none \"idea\" about landmine issues. For example, one card might show a picture of a toy\nrocket on the front, and another might show a picture of the blu 97 submunition, which looks\nnot unlike a toy rocket, and, like the rocket, attracts children. Together, (with the assistance\nof text on each card, along with the pictures), the card pair would provide the idea that the blu\n97 submunition is a major problem for children, because they think it is a toy, play with it,\nand are injured.\nThe general idea of any activity involving the deck would be to match up the pairs,\nand in doing so to provide one simple, but important, concept related to landmine issues.\nAfter this is done, further activities can be done to learn more ideas or create a more coherent\neducational story, but this is not necessary.\nOne possible scenario of play can take place during the early, mingling phase of a\nsocial fundraising event like Night of 1000 Dinners. The cards can be handed out at the door\nor distributed to guests when a certain number of people have arrived. Each person is then\ninstructed to find the match for his/her card. This activity should fit well into a dinner or\nsimilar scenario because it is a relatively short activity and helps in \"breaking the ice\" if\nguests do not know each other - it is a good social game as well as an educational activity.\nAny further complexity of the activity depends on the situation - the host can decide\nhow involved the game should be. It could simply end when pairs are found, or, once the\npairs are found, each couple could take turns describing their \"idea\" to the group. Possibly\nall of the pairs together could form some kind of coherent story or narrative relating to\nlandmine issues. The play of the game is really up to the host running the activity - many\nways of pairing up cards and possibly continuing play are possible.\nOne issue is that the host needs to know which cards match each other, so that the\n\ncards can be passed out appropriately (i.e., no one will be left without a match). It is likely\nthat it will be pretty obvious, because of similarities between pictures, which cards are\nmatches, but another method for the host to find the matches might be needed.\nTesting\nUnfortunately, the card-matching card game and card deck have not been tested in a\nrealistic situation. People told about the idea and method of play of the game, and shown\nvarious pairs of cards, were generally positive. However, no one has actually played the full\ngame, and it has not been tested in an actual social or fund-raising context.\nPrevious game concepts and cards have been tested, and a lot of feedback has been\ncollected. Some of the most useful comments/observations were:\n- Even though the activity may not take a long time itself, it can (and should) inspire a\nconversation about landmines and landmines issues. In all of the game trials done, the game\ntook less than 10 minutes to complete, but the conversation about landmine issues following\nwent on for an hour or more. For these situations, it is useful if there is an \"expert\" in the\ncrowd who can answer questions and provide useful information.\n- No one wants to play a game if there is no hope of winning/no one wants to play a game if\nit is all luck, there should be some skill involved. In the original version of the game, which\nwas a role-playing game in which the player was \"walking\" in a mined area, the goal was\ndifficult to reach, and winning was mostly luck - a coin flip determined if you were injured\nby a mine or not. Most people did not enjoy this version.\n- If there are words/text on the card that are not necessary for game play, the words will\nprobably not be read. When people are playing the game, they are goal-oriented towards\ngetting the game played, the words are a distraction. Several people said they were \"too\nbusy\" playing the game to read the cards while playing, but were interested to go back and\nread when the game was finished. Others just thought there were too many words.\n- Some of the facts mentioned on the first version of the cards were so unpleasant that some\npeople did not believe them - they thought they had just been made up for shock value and\nwere not actually true. (For example, one showed a family whose yard was mined, some\npeople could not believe that people would live in a home, knowing that mines were in the\nyard). Be careful of creating disbelief, or making people think you are exaggerating.\nManufacture\nThe card deck should be relatively easy to manufacture, once the design of the cards\nis established, by a local printing company. The cost may be relatively high if traditional\nprinting is used because each card is different, but this may not be an issue if the number of\ndifferent cards is small enough or the total number of decks made is large enough. Also,\ncompanies that print cards using computer printers rather than traditional printing presses do\nnot have the added cost associated with setting up many different designs.\nFuture work\nIf more or different card pairs than those provided in Appendix A are desired, more\ncards should be designed, to make a complete deck. 16-20 cards seems like a reasonable size\nfor a deck, at least initially. Larger events can use several decks if necessary.\nOnly minimal effort has been put into the graphic design of the cards so far. A\ngraphic designer should be consulted on the card design and possibly also the card images\n(current images were taken from websites, there may or may not be legal issues involved with\nusing these pictures if they are to be sold, probably the original photographers should at least\nbe contacted if new images aren't found). Once a whole deck has been designed, several\ncopies should be made and distributed for evaluation and testing.\n\nAppendix A - Cards\nThe text underneath each card is intended to appear on the back of that card. Pairs are next to\neach other.\nWarning: not all facts are very well backed up. These are suggestions for the kinds of\nfacts that should go on the cards - most numbers were found on webpages, and are not\nnecessarily totally accurate. US population information is from the US census website,\nAfghanistan mine density information is from the Journal of Mine Action, \"Global\nFocus on Landmines in Afghanistan,\" by Joe Lokey. The 75% of Cambodians live on\nsubsistence farming quote is from the CIA world factbook, the 40% of rice fields are\nmined number came from a website I can't find right now.... The numbers about\nbleeding to death and getting to a clinic I mostly just made up, based on vastly different\nnumbers that can be found on the web. The statistic for number of blu bomblets\ndropped on Cambodia is from this webpage: http://www.rawa.org/cluster2.htm.\nNumbers about Mozambique are from the Mozambique Mine Action Programme\nAnnual Report for 2003.\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\nThis is a population density map of the US. This is a landmine density map of\nThe average population density in the US\nAfghanistan. The average landmine\nis about 80 people per square mile.\ndensity in Afghanistan is about 30\nlandmines per square mile.\n\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\nThe skull and crossbones is the standard\nmine warning sign, world-wide.\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\nLarge numbers of people are displaced\nduring conflict. When the fighting is over,\nthey attempt to return to their homes and\nfarms.\nThe skull and crossbones is considered a\ngood luck symbol in Cambodia.\nResidential and agricultural areas are\noften mined during conflict, as defensive\npositions and to deny use of the land to\nothers.\n\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\nAbout 75 % of Cambodia's population is\nsupported by subsistence farming. Rice\nis a main crop.\nImage removed due to\ncopyright considerations.\nLandmines usually cause very traumatic\ninjuries, such as loss of limbs, that bleed\nprofusely and are highly prone to\ninfection. It can take less than an hour for\na mine victim to bleed to death.\nAbout 40% of Cambodia's rice fields are\nmined. Farmers either abandon the land\nor often attempt to use it anyway.\nImage removed due to\ncopyright considerations.\nMost mined countries have poor health\nsystems and clinics are rare and poorly\nstocked. Vehicles to act as ambulances are\nalso difficult to find. In rural areas, it can\ntake several days to reach the nearest\nclinic.\n\nImage removed due to\ncopyright considerations.\nWells are very important resources in\nmost countries. Not only are they an\nimportant social gathering place, they are\noften the only local source of water. The\nwell makes living in the area possible.\nImage removed due to\ncopyright considerations.\nChildren in Cambodia have very few toys,\nmost play with what they can find in the\nlocal area. A brightly colored toy rocket,\nwith a parachute, like this one, would be\nvery popular, and much more exciting\nthan local toys.\n(this was the best picture I could find -\nobviously not the best...)\nImage removed due to\ncopyright considerations.\nWells are frequently mined during\nfighting because of their strategic\nimportance - if the use of the well is\ndenied to an enemy, the enemy has no\nwater source. After the fighting is over,\nthe landmines remain.\nImage removed due to\ncopyright considerations.\nOver 100 million blu 97 submunitions\nwere dropped on Cambodia. It is\nestimated that 8-12% of them failed to go\noff and are laying exposed on the ground.\nThey are bright yellow and have a\nparachute for being air-dropped.\n\nImage removed due to\ncopyright considerations.\nIn 2003, deminers cleared about 7 million\nsquare meters of land in Mozambique,\nallowing about 50,000 people to resettle\nthere and regain access to local natural\nresources.\nImage removed due to\ncopyright considerations.\nIn 2004, about 360 square kilometers of\nagricultural land remain to be cleared of\nlandmine threat in Mozambique.\n\nAppendix B - other activities\n1. A much more complex game could be made, probably a board game, in which players\nwould have to make decisions and interact with a mined environment in the same way that\npeople in mined areas would. One possible scenario for such a game would be a \"village\"\nscenario, in which every player has a role in the village, (farmer, etc.) and together the group\nis trying to survive, make money, demine, etc. Players would have skills, could perhaps learn\nnew skills, there could be \"chance\" cards, etc. This would be a very complex game possibly\nalong the lines of other civilization-building games like Settlers of Cataan or Puerto Rico,\nexcept with landmines. One alternative to each player being a single person in the village\nwould be for each player to be the head of a village, or some other group, and thus be able to\ncontrol more resources and get more done (the other version could possibly go very slowly).\nThis would also be good because then stepping on a landmine would not eliminate a given\nplayer from the game - the game could give a good idea of how many people are injured or\nkilled by landmines without actually killing off any of the players.\nIt is unclear what the value of such a game would be in terms of fundraising, unless it\nwere successful enough that people would actually pay to buy it. It would increase awareness\nabout landmine issues among players, and might be a good educational tool for adults and\nolder students (high school, college).\nIf a realistic enough game is created, a suggestion has been made (by the deminer Bob\nKeeley) to use such a game as an educational tool for demining supervisors and others who\nare involved in demining but may not have a good idea about what is going on in the daily\nlives of deminers and others living in mined areas.\n2. Post cards - Several people thought that the cards for an early version of the game, which\nlooked like postcards, with information on the back, would be effective on their own. Similar\nto the pairs of cards described above, these postcards would provide a small amount of\ninformation about a single landmine related issue, and also list a website where more\ninformation could be found. These would be easy to distribute, and most likely not very\nexpensive to print. (One issue here is - what would the website be where more information\nwould be found? Would there be a designated agency that would receive donations?). The\nkey with these cards would be to have an intriguing image, that would make people want to\nread the back, and then an interesting story that would make people want to learn more.\n3. Various other games. Suggestions during testing sessions included: \"Mine-opoly\" - just\nlike Monopoly except some of the properties are mined. Maybe paying for demining costs\nthe same as a hotel, or something. A computer version of the role-playing game described in\n#1. A very sneaky and guilt-inducing game: you play a game (online) in which you are in the\narmy, for example, or for some other reason have the need or the opportunity to plant\nlandmines. Several months later, you get an e-mail that says \"one person stepped on a\nlandmine in the minefield you planted, they had an above-the-knee amputation.\" Etc. This\nwould continue for a while, until you went back and demined your field.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Fog Deflectors",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/bddf7a9d13392fd4a43accbc69d930f3_MITEC_S06S07_fog_deflector.pdf",
      "content": "Fog Deflectors\nVictoria Chou & Jessica Lowell\nSP.776\nMay 16, 2007\nIntroduction\nWhen people think of the safety hazards that deminers face, their minds jump to\nthe most obvious and dramatic - the accidental setting off of mines, with the\nresulting possible injuries or death. But there are more subtle hazards that can\ncontribute to the likelihood of this or other accidents - small things that sufficiently\ndistract or impede deminers to make them less likely to be safe.\nOne such subtle hazard, in certain weather conditions, is that of visor fogging. In\ncold or humid weather, the normal breathing by a deminer on his or her visor can\nfog the visor to the point that the deminer cannot see properly. This lack of vision\ncan lead to possibly devastating mistakes. To improve their visibility, deminers\nmay be tempted to raise his or her visor, risking face or throat injury or death\nfrom shrapnel if a mine is triggered.\nWe have addressed this problem of visor fogging through the design of a breath\ndeflector which will prevent the deminer's breath from reaching the visor and\ncausing fog, and which will not injure the deminer in the event of an explosion.\nDesign\nWe have designed a fog deflector that uses super-magnets to attach itself to a\nstandard demining visor. It is primarily made out of clear PVC film. It is slightly\ncupped so that it will hold its shape and has a large, flat area for attachment to\nthe visor.\nPictures of our final design.\n\nThis design addresses our issues of durability, comfort, and image. The super-\nmagnets are extremely effective at holding the visor in place, work well in dirty\nconditions, and do not lose their attachment property over time. The deflector's\nshape allows it to rest lightly on or above the wearer's nose and does not weigh\nheavily on nor stifle the speech of the wearer. We also plan to add a small strip of\ncloth at the top of the deflector where it touches the wearer's nose in order to\nmake it even more comfortable. Finally, by making the visor clear, the wearer's\nface is not obscured. It also allows us to see when fog accumulates on the\ndeflector, showing users that it is being effective.\nBecause our design has a small part that lies outside the visor, there is a small\nchance that it will not survive blast testing. Should this happen, we have an\nalternate design that uses a suction cup to attach the deflector to the visor.\nHowever, this attachment method is not quite as durable so it is not our first\npreference.\nPictures of the alternative, suction cup-based design.\nThe shape of this design is similar to the magnet version's design. However, the\nattachment point between the deflector and visor is pointed instead of flat in order\nto facilitate attaching the suction cup to the deflector.\nTesting\nA previous team had already designed a breath deflector attached to the visor by\na metal clip, but when their breath deflector was blast-tested, the metal clip\ndisappeared, indicating that it would probably be unsafe for actual use in the\n\nfield. We started with their design and worked on trying to fix the method of\nattachment.\nWe made prototypes using last year's mask design and hard orange felt but with\nvarious different attachment mechanisms both on and off the face. Eventually we\ndecided that attaching the deflector with a magnet would be the top alternative.\nUsing a suction cup to attach the deflector came in as a close second choice.\nOur experiments are detailed in the Appendix.\nThis early prototype, made of sewn hard felt, illustrates the original breath deflector shape, which\nhad a substantial pucker in the middle and a heart-like shape at the top. Here we are testing both\nthe magnet and suction cup methods of attachment.\nThe bright orange prototypes also made us think more about what we wanted the\nfinal material and appearance of the deflector to be. After some discussion and\nmore prototypes, we decided the a transparent deflector would be best.\nYou can see a clear deflector working.\n\nOver the course of the making of prototypes, we also discovered that the original\nshape of the breath deflector was not always comfortable to wear - for some\npeople's face shapes it worked fine, for others less so - and the ridges on the top\npushed towards the wearer's eyes, possibly risking damage to them in an\naccident. As a result, we made another round of prototypes with differently\nshaped masks.\nWe ended up choosing a shape that was smaller and had fewer contact points\nwith a wearer's face. We also discovered that by strongly angling the deflector\ndownward, we could direct a wearer's breath downward. As a result, we could\nblock more fog with less material. This discovery is reflected in our final design.\nIn an attempt to reduce the cost of the magnet model, we tested prototypes of\ndeflectors that used different configurations of smaller magnets to attach\nthemselves. However, the small magnets were too weak to hold the deflector up.\nWith each prototype, we had at least two people try it on with the demining visor\nand try to fog up the visor. We also ran some tests in a humid restroom.\nManufacture\nDiscuss the manufacture of the prototype verses the intended manufacture of the\nfinal design. Indicate desired manufacturing methods and materials. Highlight\nany critical manufacturing aspects, such as those aspects that strongly influence\nsafety, performance or reliability. Identify key specifications that should be met in\nthe manufacture of the design.\nOur final design uses two 0.7'' D x 0.11'' neodymium disc magnets, two pieces of\n.02'' thick, clear PVC (Type I) heavy-duty film, and a bit of cloth. It also uses a\nstrip of .012'' thick, clear PVC film to hold the outside magnet. The two thicker\npieces of film are pressed together, holding the magnet between them in the\nappropriate spot. We also wedge one end of the thin flim strip at the bottom of\nthe deflector. Then we then used a soldering iron to hold the magnet in place and\nweld the joints together. Finally, we used glue to attach the soft bit of cloth at the\ntop of the deflector.\nOur alternative design uses one medium OOK Suction Cup, two pieces of .02''\nthick, clear PVC (Type I) heavy-duty film, a bit of cloth, and some glue. Again we\nstuck the two pieces of film together and used a soldering iron to weld the two\nends of the film in order to make a cup shape. We then squeezed the suction cup\ninto a hole we left at the top of the weld and added some glue to keep it at the\ncorrect angle and to hold the bit of cloth on.\nWe expect manufacturers to come up with a better way of welding the PVC\ntogether and to sew in the cloth. For the suction cup design, manufacturers\nshould just use one piece of .04'' film instead of two pieces of .02'' film.\n\nManufacturers have to be careful when placing the magnet (or suction cup)\nbecause slight variations can significantly change the angle of the deflector. If the\nangle is off, it might become uncomfortable or ineffective at deflecting fog.\nCloth patterns for the deflectors.\nFuture work\nThree or four breath deflectors should be manufactured to send to demining\nleaders and organizations for field use. If they engender positive feedback, a\nmanufacturing protocol will need to be developed and sent to demining\nequipment manufacturing organizations so that the breath deflectors can be\nwidely distributed.\nAppendices\nAppendix 1: Considered Attachment Mechanisms for Breath Deflector\n\nAttachment by magnets on either side of visor - selected for functionality,\ndurability, comfort (they were easily adjustable)\nSuction cup attachment - selected for safety, functionality, low cost\nTying around the head - rejected for discomfort\nGlasses-style hooks over ears - rejected for holding deflector against face\nuncomfortably\nVelcro attachment - rejected for lack of adequate functionality, especially when it\ngets dirty\n\nAttachment by plug embedded in visor - rejected for being too destructive to visor\nAppendix 2 - Evolution of Deflector Shape\n1.\n2.\n\n3.\n4.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Fog Drops",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/238f5eebfadfd000d8d0171e5d0d56fb_MITEC_S06S07_fog_drops.pdf",
      "content": "Anti-Fog Drops\nVictoria Chou & Jessica Lowell\nSP.776\nMay 16, 2007\nIntroduction\nWhen people think of the safety hazards that deminers face, their minds jump to\nthe most obvious and dramatic - the accidental setting off of mines, with the\nresulting possible injuries or death. But there are more subtle hazards that can\ncontribute to the likelihood of this or other accidents - small things that sufficiently\ndistract or impede deminers to make them less likely to be safe.\nOne such subtle hazard, in certain weather conditions, is that of visor fogging. In\ncold or humid weather, the normal breathing by a deminer on his or her visor can\nfog the visor to the point that the deminer cannot see properly. This lack of vision\ncan lead to possibly devastating mistakes. To improve their visibility, deminers\nmay be tempted to raise his or her visor, risking face or throat injury or death\nfrom shrapnel if a mine is triggered.\nWe have addressed this problem of visor fogging through the testing of chemical\ndefoggers already available on the market, to determine which, if any, would be\nsuitable for demining needs.\nDefogger Selection\nBased on reports from the previous group to work on defogging, three chemical\ndefoggers were chosen - Fogtech Advanced Anti-Fog Solution, which was\ndeveloped for industrial use, TYR Anti-Fog Drops, which were developed for use\non swim goggles, and Cat Crap by EK, which was developed for glasses,\ngoggles, and binoculars. These defoggers were tested for anti-fog capabilities\nand endurance, as detailed in the Testing section.\nBoth Fogtech and the TYR drops met our qualifications well, but the TYR drops\nare substantially lower in cost, an important consideration for deminers, and thus\nwere chosen to be sent to the Fort Leonard Wood Humanitarian Demining\nTraining Center for further testing.\nTesting\nSince the team from last term already tested the effectiveness of the drops, we\nfocused on testing how durable and deployable the anti-fog drops.\nTo test how durable the drops were, we partitioned a piece of polycarbonate into\nfour sections and coated each section with a different defogger that was\nrecommended from last year. We saved the last section as a control. We then\n\nperiodically tested that the defogger was still effective. A few days in, we also\ntried wiping the polycarbonate and exposing it to water.\nOut of the three defoggers we tested, Cat Crap was the only one that allowed fog\nto form without our physical interference in our test. The FogTech drops stopped\nblocking fog after it had been exposed to water. As a result, we decided to go\nwith TYR drops for deployment.\nFuture work\nIf the results from the testing at Fort Leonard Wood demonstrate that the TYR\ndrops are effective, bottles of the drops will need to be sent to demining\norganizations so that those organizations may try them in the field. If they prove\nto be effective in the field, they can be ordered online for less than $3/bottle by\ndemining organizations. A protocol for the application of the drops will need to be\nsent to demining organizations to give to their field supervisors, who will be\nresponsible for applying the drops once a week.\nAppendices\nAppendix 1: Testing Procedure given to Fort Leonard Wood\nChemical Defogger Experiment for Ft. Leonard Wood\nMIT Design For Demining\nVictoria Chou and Jessie Lowell\nPurpose:\nDetermine whether having a chemical defogger on deminers' visors\nwould improve how well they can see when demining.\nExperiment Plan:\nThe plan is to coat half of the inside surface of every visor with a\ndefogging solution. Then let some trainees use the visors. Finally, ask\nthem if they noticed that one side of the visor was easier to see\nthrough.\nThe hope is that the trainees will tell us that the side with the\ndefogging solution was noticeably easier to see through because the\nother side kept on fogging up when they breathed. However, we have\nto be careful not to bias their answers for this experiment.\nMaterials:\n1. Defogging solution\n2. Clean cloth\n3. Visors\n4. Paper+Tape (or something to cover half the visor)\n5. Questionnaires\n\nMethod:\n1. Wipe down the visors such that there is no dirt on them.\n2. Cover the right side of the inside surface of the visor with a piece\nof paper. If necessary, use tape to hold it in place.\n3. Follow the instructions on the back of the TYR anti-fog bottle and\napply the solution to the left (uncovered) side of the inside surface\nof the visor. Make sure none of the solution gets on the right\n(covered) side of the visor.\n[Copied from back of TYR Anti-Fog Lens Cleaner bottle]\n1. Evenly apply spray to inside of lens.\n2. Wipe with a clean, soft cloth until the visor is dry and clear.\n4. Remove the paper from the right side of the visor.\n5. Pass out visors to trainees.\n6. Go through standard demining training.\n7. Immediately after the training and while the trainees still have\naccess to their visors, ask the trainees to fill out the questionnaire.\n8. After the questionnaire has been collected, tell the trainees what we\nwere testing and ask if they have any comments. Ask them to write\ntheir comments on the back of the questionnaire.\n1. Did you have any visibility issues with your visor during the\ntraining? If so, what?\n2. Did you notice any visibility difference between the right and left\nside of your visor?\n(The following questions only apply if you noticed a visibility\ndifference.)\n3. Which side could you see through better?\n4. Was the difference significant?\n5. What made it harder to see out of the bad side of the visor? (e.g.\nscratches, poor fit, fogging)"
    },
    {
      "category": "Resource",
      "title": "MagRake",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/e2ea83ed0714bdb3d96133a0bfd3977f_MITEC_S06S07_mag_rake.pdf",
      "content": "MagRake\nSmitha Raghunathan\nHelen Tsai\nInstructors: Benjamin Linder & Andrew Heafitz\nSP.776 Design for Demining\nMarch 10, 2005\n\n1.0 Introduction\nThe MagRake is a tool that employs magnets to reduce the problem of ferrous fragments in\ndemining areas. This is a major problem in several areas of the world dealing with landmine problems, and\nwarrants the development of a tool that addresses this issue. The presence of ferrous fragments in areas of\ndemining causes many false positives when using a metal detector; these force deminers to excavate the\narea carefully, treating the fragment as if it were a mine. This greatly increases demining time, as\nexcavation becomes a time-consuming process when coupled with numerous frags per square meter.\nThe tool developed over the course of this semester aims to eliminate ferrous frags from the\ndemining area, thereby reducing the repetitions of excavation for non-mine material. A rake was chosen to\nbe used in conjunction with magnets in order to unearth fragments so they could better be drawn to the\nmagnet(s) on the tool. The main goal this semester was to justify the use of this tool, and determine\ncharacteristics of its design in order to make it worthwhile to use. This was important as the use of this tool\ninvolves the creation of an extra step in the SOP (Standard Operating Procedures) of the Demining Process.\nAs change is not accepted readily by the established demining organizations, there needs to be clear-cut\nadvantages to using this tool that will make the demining process noticeably better.\n2.0 Design: Product & Model Creation\n2.1 Model Design\nThe purpose of the model was to determine whether or not the insertion of the MagRake tool into\nthe SOP was feasible. This was an extremely important process in the work for this semester as since most\nof the demining industries are well established, and resistant to change without legitimate reason.\nTherefore, it was necessary to prove that using our product would cause a significant improvement in the\ndemining process via the reduction of time.\nThe model that we created was based on real figures from papers and experiments by Andy Smith\nand Bob Keeley. We detailed the various times it takes a deminer to accomplish their tasks. First regular\ndemining procedures were examined and quantified: brush clearance, metal detecting, probing and\nexcavating. Additionally, the change from metal the detection/probing method to an excavation based\nmethod was included in the model in the case of highly fragmented areas. Likewise, we wanted our model\nto depict the raking process and see if there is a clear region of use for the rake. We used estimated times\nfrom our experiment for this aspect of the model. Running the model for a series of different fragment\nconcentrations and rake efficiencies led to the creation of a product with 50% rake efficiency. Appendix C\ncontains the graphs and charts detailing the model.\n2.2 Product Design\nThe design of MagRake followed closely from the testing that is outlined in the proceeding\nsection. The product implemented magnets, placed on the body of the rake so as to maximize their\nseparation from the point of mine detonation (where the tips of the tines are located). Another feature was\nthe flexibility of the tines, which were employed in order to better control the application of force to the\nground. The final feature was the hand-held nature of the rake which was used in order to encourage a safer\nkneeling or squatting position and increase user control. As discussed in the Model Design section above,\nwe determined that it was possible to create a 50% efficient rake as per our results to the tests we conducted\n(see Appendix D)\n3.0 Testing: The Product and the Model\n3.1 The Model\n3.11 Experiment Setup\nApart from the mechanical properties of our product, it also needed to be tested with the model in\nmind. This was necessary in order to see if the MagRake was capable of the efficiency the model predicted\nwas required in order for it to be a viable product in the demining marketplace.\nFrom the model, we concluded that a rake with 50% efficiency was needed to make the project\nworthwhile. Therefore, our first step was to make sure we could do so before continuing with the project. It\nis important to note that Andy Smith's magnetic rake is 88% efficient (a rake we based the idea of our\nproduct off). However, unlike Andy, we decided to implement a handheld rake.\n\nWe tested for 50% efficiency for two different scenarios (pure sand and a mix of sand, mulch, and\nwater). Fragments were placed at three different depths; the number of frags at each depth, and their\nlocation on an 80cm by 20cm grid were determined using a random number generator (www.random.org).\n3.12 Experimental Results\nThe resulting averaged times for the experiments were: pass without picking up fragments = 35\nseconds, and time to remove fragments = 8-12 seconds. Apart from these direct results from the testing,\nincluding the charts shown in Appendix C, there were two situations that were illuminated during the\ntesting: cleaning of frags from the rake and depth of penetration of the tines.\nThe deminer cleared the metal fragments off the rake when she noticed them; but at times she\nfailed to do so. Therefore, some fragments were lost when she proceeded to rake with metal still on the\ntines. This situation points out the advantages of some autonomous cleaning system that ensures a fast,\nthorough and rapid clearance of fragments from the rake between every cycle.\nThe second issue regarded the size of the tips of the tines. The 2.5 inch tips used in our set of\nexperiments caused an unnecessarily large separation between the magnet and the ground. This resulted in\na greater degree of passes over the same ground before the magnet was close enough to attract fragments\n(due to the exponential decay of a magnet's strength with distance). This situation was aggravated by the\nharder ground of the second trial, which resulted in a total of 11 (as opposed to the 4 in pure sand) passes in\norder to pick up a significant number of fragments.\n3.2 MagRake\nThere were several possible designs considered throughout the course of the semester. These were\nbased on choices between several key factors of the product: placement of the magnet(s), stiffness of rake\ntines and position of user.\nEarly testing was done to see if strategic placement of magnets could magnetize the rake tines.\nUpon experimentation, it was determined that this was not possible to a degree that would actually aid in\nthe collection of ferrous fragments, and the idea was abandoned. After that issue was addressed, next was\nthe consideration of safety. One of the major concerns of this project is safety, and therefore consideration\nwas give to the issue of magnets in a landmine blast. It was determined that magnets should be placed on\nthe body of the rake as opposed to directly on the tines, thereby separating them from a possible blast to\nsome extent. Appendix A contains pictures from the testing of magnet placement on MagRake.\nSafety was also an issue of consideration when looking at the stiffness of the rake tines. This was\nof concern because stiffness directly correlates to the amount of force that is put on the ground. By using a\nrake with more flexible tines, an upper threshold can be somewhat maintained. This is possible because the\ntines absorb some of the force the user imparts in a similar manner as a spring. Therefore, for the user to\npush on the ground with a certain force, they must first deflect the tines (springs) a certain amount. The\nspring equation of F = kx is translated into F = (stiffness of rake tines) (bending of tines) for a rake. This\nsituation makes it more difficult to push on the ground without noticing, as the tines will bend significantly.\nThis was determined to be a favorable situation compared to infinitely stiff tines, as that is more likely to\ncause unfavorable pressures to be exerted on the ground.\nThe final major consideration when designing this product was how the user would be situated\nwhen using it. MagRake could be used either standing up (using a full-sized rake) or kneeling/squatting\n(using a hand rake). This issue was decided by looking at: safety during a blast, user comfort and ease of\ntool use. Safety was facilitated by a lower user stance, owing to the spreading of the blast perimeter with\nincreased distance from origin (increase in height). User comfort and ease of tool use were not looked at in\ngreat detail and need to be tested more. Appendix B contains pictures from the testing of user stance for\nMagRake.\n4.0 Manufacturing\nThe prototypes for this semester's work were made mostly by using pre-existing rakes, and\nmodifying them in some manner or another. The main modifications that were made were a reduction in\nrake-head size and the number of tines. Additionally, magnets were attached to the rake by simple electrical\ntape coupled with the attraction between the ferrous tines and the magnet.\n\n55.0 Future Work\nThere are three major issues that need to be addressed as this project continues: limitation to the\namount of force the rake places on the ground, the interaction with the mines and magnets, and the nature\nof the raking motion (standing or kneeling).\nThe force the rake places on the ground is a key issue to the success of the MagRake. A delicate\nbalance needs to be maintained between force the rake places on the ground, and the amount of frags that it\npicks up. The force needs to be high in order to penetrate the ground and pick up as many frags as possible\nwith the least passes as possible (limiting time); but it also needs to be low enough in order to not set off\nmines.\nThe second major issue is the interaction between magnets and mines. One of the major\nconsiderations in the design of any demining product is its reaction to a blast from a landmine. The ideal\nsituation is for the tool to bend and deform as opposed to shatter. The concern with magnets is their\nceramic construction. This composition results in a shattering during a mine blast, possibly causing great\nharm to a deminer. One promising solution is a separation between the tines touching the ground and the\nplacement of the magnets. If this distance is set correctly, shattering during a blast may be avoided.\nAnother solution would be a protective casing around the magnets. These situations should be explored in\norder to determine whether or not they are viable in the demining industry.\nThe final issue is the stance of the user while using our product. The only issue that was looked at\nthoroughly was user safety during a blast. While this issue clearly led to a kneeling or squatting stance, the\nother two issues were not explored in enough detail to point in one direction or another. User comfort and\nease of use tests were run on a very small pool of individuals, and needs to be expanded to get more\nreliable results.\nIn addition to these fundamental problems, there are also improvements that can be made to the\ntests conducted. First is to test a greater variety of ground types and range of harnesses. This will help\ndetermine what environments MagRake works best in. Second is the environment for testing. Limitations\nwere encountered due to the size and shape of the container used to place the experimentally simulated\nground and fragments. A deeper, wider container, causing no impedance to user motion would create more\nrealistic results.\n\nAppendices\nAppendix A: Magnet Placement\n\nAppendix B - Stance using rake\n\nAppendix C - graphs for model design and sources for data\n% improvement from current\n% improvement with MagRake\n-10\n-20\n\nRake Efficiency (%)\n10 frags/m2\n3 frags/m2\n50 frags/m2\nFigure 1: Rake efficiency vs. percent improvement\nsituation\n-10\n-20\n\n50% MagRake Efficiency\n25% MagRake Efficiency\n75% MagRake Eficiency\nTime (min)\nFigure 2: Time vs. percent improvement with different efficiencies in MagRake\nTable 1: Data source for numbers in model\nData on Model\nSource\nConventional Demining Cycle for 20cm\n20 - 30 min\nBob\npg 21\nAverage Advance/meter with Standard Metal Detecting\n47-60 min\nAndy\npg 23\nTime to investigate signal\n1-21 min\nAndy\npg 44 - 54\nAverage Advance/meter with Magnetic rake (Region Flailed beforehand)\n18-22 min\nAndy\npg 26\nTrench Making\n25-28 min\nAndy\npg 32\nAverage Advance/meter with Excavation (without Trench making\nfactored in)\n44 min\nAndy\npg 32\n* Bob Keeley \"Understanding Landmines and Mine Action\" = Bob\n* Andy Smith's \"Comparatative trials of manual mine clearance techniques in Mozambique, 2004\" = Andy\n\nAppendix D - Model Testing Results\nSurface Fragments\nVerticle Placement (cm)\nFragments Burried at 1 cm\nFragments Burried at 2 cm\n\nHorizontal Placement (cm)\nFigure 3: Location of buried fragments for all testing\nFigure 4: Ground type I results [sand] - circles indicate fragments picked up and numbers indicate\nwhat pass\n\nTable 2: Results from ground type I testing [sand]\nPass\nFragment\nPicked Up\nTime/Pass\n1:07\n1:53\n:52\n1:08\n9/9 Surface Frags Picked up\n8/9 Surface Frags Picked up on First Pass\n6/7 Frags Buried at 1cm Picked up\n0/14 Frags Buried at 2cm Picked up\nFigure 5: Ground type II testing [sand, mulch & water] - circles indicate fragments picked up and\nnumbers indicate what pass\n\nTable 3: Results from ground type II testing [sand, mulch & water]\nPass\nFragment Picked Up\nTime/Pass\n:34\n:41\n:41\n:34\n:44\n:36\n:30\nPass\nFragment Picked Up\nTime/Pass\n:28\n:41\n:55\n:40\n:40\n:42\n:36\n7/9 Surface Frags Picked up\n* At first we stopped after 4 passes and we took out a surface fragment that we\ncould see, but later resumed the trial\n5/7 Frags Buried at 1cm Picked up\n7/14 Frags Buried at 2 cm picked up\n19/30 Total Frags picked up\nFigure 6: Time to remove metal fragments\n*Shaded Teal Area = Region Where Rake Would Be Used\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT Pick Prod",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/9a5bc849506115b01d952b7270ec0db3_MITEC_S06S07_mit_pick.pdf",
      "content": "MIT Pick Prod\nDesign for Demining, Spring 2005\nAron Zingman, Rosalind Takata, Katherine Rorschach\nIntroduction\nIt is difficult for deminers to excavate metal detector signals in hard ground, which is found in\nmany mined areas (Afghanistan, for example). Mines buried in hard ground can be set off\naccidentally, when deminers use excessive force or unsafe tools in an attempt to penetrate the ground.\nThey can also be missed and later stepped on, when the ground is just too hard to penetrate to the\ndepth of a deeply buried mine.\nSome existing tools, such as Andy Smith's pick prod, cannot penetrate very hard ground\neasily, although they are generally safe since they are meant to be used with slow, controlled\nmovements. Other tools such as regular pick axes are more effective at breaking up the earth but\nencourage hard, uncontrolled striking at the ground, where the tool approaches the earth from above\nand the user is in an upright position. All of these factors make such tools very unsafe.\nThe MIT pick prod uses momentum to make ground-breaking easier, like a regular pick-axe,\nbut is designed to be used at a low angle and from a kneeling position, making it much safer. It is\nhoped that this tool will help deminers to penetrate hard ground more easily while maintaining safety\nstandards.\nDesign\nThe current prototype (shown in figures 1 and 2) has a 3 foot angle steel body (1/8 inch\nthickness.) The handles are D-shaped, with doubled steel tubes (3/4 inch diameter) as grips. The\nshield is black rubber (1/2 inch, butyl). This model is the result of feedback from members of the\ndemining community, including Bob Keeley and staff of Fort Leonard Wood.\nWe incorporated several improvements to enhance safety, usability, comfort, production, and\nmarketability. The body was changed from square steel to angle, which improves manufacturability in\ndeveloping countries, allows us to increase the thickness for greater durability, and eliminates the\nsafety hazard from a possible barrel effect. We also moved to a symmetric rubber shield, which\nimproved product image and usability. The new handles retain the double tube grip, but are now\noriented to allow easier swing and better angle of impact.\nFigure 1. The MIT pick prod in use.\nFigure 2. The D-handle pick prod.\nTesting\nSeveral versions of the pick prod were tested in rocky ground in the Cambridge area. One\ntimed trial was done, comparing the time to dig an approximately 10cm x 10cm square to a depth of\napproximately 15cm for different tools. The tools compared were the right-handed version of the\nMIT pick prod, the symmetric \"V\" straight-handled version of the MIT pick prod, a regular garden\ntrowel and Andy Smith's pick prod. Both MIT pick prods showed much quicker excavation times\nthan the other tools, mostly for their ability to penetrate deeply into the ground and then scoop in a\nsingle motion. Although the results are approximate (the size of the excavation was not well-\ncontrolled), there is a significant difference between the MIT pick-prod times and the other tools.\n\nResults are shown in table 1.\nTrial 1\nTrial 2\nRight-handed pick prod\n9 sec\n10 sec\n\nV straight-handle pick prod\n10 sec\n11 sec\nTrowel\n39 sec\n29 sec\nA. Smith pick prod\n51 sec\n45 sec\nSeveral trials were also performed to assess the utility and comfort of different handle and shield\nconfigurations. Various models of the pick prod were tested in rocky, although not incredibly hard,\nsoil. Issues noted during use were:\nLarge tube handle (front)\n-\nHandle encourages excavating at a steep angle (greater than 30o), which is unsafe.\n-\nThe tube is too large to hold comfortably: the weight of the pick is held more by the fingertips\nthan the whole hand.\n-\nThe user's fingers are \"visible\" to the blast on the underside of the tool.\n-\nThe knuckles may scrape against the ground during the swing (although this did not occur\nduring testing.)\nTo address these issues, it is recommended that a version with the tube replaced by a sideways D\nhandle (see Appendix 1 for figure) be tested, where the smaller handle diameter will be more\ncomfortable to grip and the elevated handle will correct the other problems noted.\nVertical handles (front and back)\n-\nThe forward handle is uncomfortable to use. Trying to maintain a full grip on the vertical\nhandle caused contortion in the wrist and arm.\nTo address this issue, it is recommended that a version with an angled forward handle (see Appendix\n2 for figure) be tested.\nGeneral\n-\nComfort and correct use were found to vary with the size of the user. For example, if the\nhandles are far apart it is difficult for small users to be able to bring the tool far enough away\nfrom the ground to use the swinging action that makes the tool effective, but if the handles are\nclose together it is easy for larger users to use the tool incorrectly by prodding forwards,\ntowards a mine, rather than sideways.\nTo address this, the tool should have at least a general fit with the user's size (i.e., small, medium and\nlarge versions).\nManufacture\nThe main structure of the pick is manufactured out of type 304 stainless steel. 304 stainless is\ncorrosion resistant, easy to weld, and ductile enough that it is expected to warp in a blast, rather than\nshatter. All materials (including the angle steel used for the body of the tool, the steel strap used in\nthe D-handles and shield brackets, the steel tubing used in the handles, and the rubber for the shield)\ncan be cut with either a hacksaw or a band saw. The tip of the tool is sharpened using a grinder, and\nthe V-shaped cut in the shield rubber is made by first drilling slightly oversized holes at the corners\nand then cutting between them with a small coping saw. In all cases, the strap was bent using a sheet\nmetal break, but it could also be shaped with a vise and hammer. All metal parts are welded together\nto avoid fragmentation in a blast, and the rubber shield is firmly sandwiched between two L-brackets\nso it cannot be removed. The double tubes used for the D-handles encourage a proper grip on the\ntool. Additionally, the shield is located so that it is between the user's hand and a possible blast, and\nso that the standoff distance between the user and a mine is greater than 30cm.\nFuture Work\nFuture students need to decide on a handle design. We recommended prototyping the\nvariation of the D-shaped handles shown in the appendix. Three prototypes of two final designs need\n\nto be blast-tested at the Energetic Materials Research and Testing Center in New Mexico. If the shield\nis effective and the tool does not fragment, the design should be field tested in Afghanistan before\nbeing commercially produced.\nCredits\nThe pick prod team includes Rosalind Takata, Aron Zingman, and Katherine Rorschach.\nPictures by Aron and Katherine, and Solidworks models by Rosalind.\nAppendix 1\nAppendix 2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Personal Protection Equipment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/09827333be89123b7f4b329d50fbba06_MITEC_S06S07_ppe.pdf",
      "content": "Michael Scott & Jorge Renjifo\nDemining Final Report\nProblem\nPersonal Protective Equipment (PPE) is a deminer's last defense against landmine\nand unexploded ordnance (UXO) detonation. Specifically, PPE is effective against blast\nmine explosions, which are by far the most common in occurrence, and \"secondary\"\n(rock, sand, etc.) fragmentation. Fragmentation landmines are much more difficult to\nprotect against, requiring more expensive, expansive, and heavy solutions. These\nhowever are also easier to detect, having extensive amounts of metal, and are utilized less\noften due to cost.\nCurrently there is a great need for more comfortable and useable personal\nprotective equipment. The main problem is not that the equipment is ineffective, but\nrather that the equipment does not promote proper use. For face protection, there is one\nmain option in the form of the visor. This consists of a molded polycarbonate sheet\nsupported by a head strap or helmet. The current design is heavy causing substantial\nneck strain and promoting removal. Further, the visor suffers from fogging due to\nenvironmental humidity and more commonly the user's breath, promoting lifting the\nvisor for unimpeded viewing. The visor also suffers from excessive scratching due to\nimproper care , which again leads to lifting the visor for clear vision. Finally, the design\nputs a large barrier in front of one's mouth, impeding proper communication and once\nagain encouraging raising the visor. All this visor lifting and removal makes for a\ncumbersome user experience and more importantly negates the purpose of the visor.\nDeminer body armor is slightly better at accomplishing its purpose, coming in the\nform of an apron that protects from the lower neck down to the knees. This part of the\nPPE currently suffers from overheating problems, limited shoulder protection, no arm\nprotection, and cumbersome rear straps, but is overall acceptable.\nThe current combination of individual visor protection and upper body protection\ndoes create one egregious problem, the disconnect that occurs in the neck region of the\nuser. This occasionally fatal gap has been acknowledged as being a significant problem\narea, and is currently addressed by the addition of a \"blast collar\", the effectiveness of\nwhich is questionable.\nCost within such operations is a large issue, with tight budgets third world\nimplementation requiring inexpensive and low maintenance equipment. Current visors\nare priced in the low-$100s, with aprons in the mid-$100s, and any replacement solutions\nwould have to be no more expensive.\nFinally, we acknowledge that there are similar projects being tested by Rofi at this\ntime, namely an \"all-in-one\" design and an \"ice hockey styled\" mask, however, our group\nfeels these designs still have outstanding issues and that therefore the project is still worth\npursuing. (Appendix I)\n\nProcess\nThe current problems found in the personal protective equipment used for\nhumanitarian demining, have lead this group to propose a new protection option through\nthe integration of the visor and upper body protection. Having identified the problems\nwe wish to address and having conducted research on general humanitarian demining,\nPPE, and to a limited extent on the needs and wants of the deminer, we followed by\ninvestigating various conceptual solutions with open minds, considering both the\nsophisticated and simplistic. (Appendix A)\nThough the main emphasis of this project was generating a new design, in doing\nso there were various possible changes considered including: interchanging\npolycarbonate for Kevlar to reduce cost, adding padding to the inside of a visor to serve\nas an impact dampener during an explosion, leaving a side opening for communication,\nadding an internal attachment to eliminate fogging around the visually essential areas,\nadding reflective material to increase the visibility of deminers to others, attaching\nstacking \"feet\" to prevent visor scratching during storage, and adding interchangeable\nfront face plates for less expensive scratch maintenance.\nThe next step in our product development was to use a set of criteria to narrow\nour concepts to the three most viable solutions. The criteria evaluated the design with\nrespect to the issues outlined above, with each criterion evaluated on a scale of 2, and\nthe concepts with the highest total score were chosen for further development.\n(Appendix C) The chosen concepts are shown below:\nFigure 1: Basic-T\nFigure 2: Shoulder-Mounted\nFigure 3: Back-Mounted\nThe back-mounted design scored lowest of the three chosen designs and an initial\ncardboard mockup verified this, showing the design to be cumbersome and impractical.\nThe decision was taken at this point to discontinue this design.\nThe basic-T design scored well on the criteria in part due to its simple and\nstraightforward design. Unfortunately during the design process it proved extremely\ndifficult to implement the concept without removing this simplicity and so the concept\n\nwas not developed further. The group feels that the basic-T design still has good potential\nif the implementation issue can be overcome.\nThe initial cardboard mockup of the shoulder-mounted design showed that the\ndesign certainly had potential. The next stage of the design process was to produce an\nacrylic prototype. Acrylic was chosen as it is easy to work with.\nDesign\nFirst Iteration\nThe first iteration of the shoulder-mounted prototype was manufactured from a\nsingle sheet of acrylic. The design was promising but had a number of lesser problems\nsuch as: shoulder and chest adjustability, sufficiency of side protection, visual\nimpairment (due to a bend in the line of sight), comfort, weight, ventilation, snagging,\nand over-engineering (Lexan \"straps\" are unnecessary).\nLessons Learnt\nThe major lesson learned from the first iteration were that the shoulder-mounted\ndesign is viable, but not as a one-piece design. While this would be elegant from a\nmanufacturing viewpoint, the compromise results in an issue of loose shoulder \"straps\",\nwhich would not hold the visor during a blast and a susceptibility to cold bending on the\nflat surfaces.\nSecond Iteration\nThe second iteration aimed to address three major issues: looseness, cold bending,\nand vision impairment. To achieve these goals it was decided to move to a three piece\ndesign with the pieces joined using bolts. To address the problem of looseness the\nshoulder straps were moved closer together and depth adjustability was added. The\ngeometry of the design was also altered so that the various components would reinforce\neach other and the dimensions and angles of the design were altered to improve visibility.\nLessons Learnt 2\nThe second iteration successfully addressed several of the issues from the first\niteration. In particular the design substantially improved on fit and visibility. The issue of\ncold bending was partially addressed but concerns with regard to the over-engineering of\nthe \"straps\" remain. The iteration also increased in weight and still lacked proper side\nprotection particularly during rotational movements that occur when feeling for prongs.\n(Appendix H)\nFurther Work\nThe next stage in the project would be to address the persisting issues from the\nsecond iteration, mainly side protection. Once all the existing issues have been addressed,\na Lexan prototype should follow. This must be blast tested to ensure effectiveness and\nthen it must be determined exactly how the product would be produced given available\nmanufacturing resources.\n\nOne possibility that was not pursued further is the addition of removable\nfaceplates. This would reduce the impact of scratching as the faceplate could be replaced\nif it became scratched. Additionally if the faceplate can be easily raised it might help to\nreadily address communication and ventilation problems.\nThe group developed a couple new rough concepts after the second iteration for\nconsidering in future iterations. (Appendix G)\nAs mentioned previously the group believes the basic-T design still has great\npotential and that any future groups should also consider this concept.\nFurthermore it may be worth considering some of the other initial concepts, in\nparticular the \"diving helmet\", as some of the features in these concepts might be useful\nin future designs and iterations.\nLessons\nA number of lessons were learned over the course of the semester. First, acrylic\ndisplays no visible signs of change upon heating and is bendable after approximately 30\nseconds of heating per inch of bend length at a standard quarter inch material thickness\nwhen using a 1100W heat gun. Lexan, on the other hand, bubbles when heated and\ninitial tests suggest it requires longer heating times than acrylic. Finally, as a cautionary\nnote acrylic is extremely brittle and great care should be taken when handling it. The\ngroup managed to inadvertently shear several acrylic parts over the course of the\nsemester.\n\nAppendices\nAppendices have been removed due to proprietary and copyrighted content.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Vegetation Clipper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/b5681e8e9f0edb22587c572db4bd173f_MITEC_S06S07_clipper_2006.pdf",
      "content": "Vegetation Clipper\nJongmin Baek, Aaron Doody\nSP.776 Design for Demining\nMay 18, 2006\nIntroduction\nVegetation removal is an essential component of a complete demining process. A large portion of time\nis spent on removal of vegetation in order to prepare the field for metal detection and excavation. While\nmechanized vegetation clearance is available, many hand tools remain in wide use because of low cost\nand easy maintenance. These include shears, loppers, pruners, sickles and secateurs, but they encounter\na significant shortcoming of forcing the deminer close to the blast in case of accidental detonations.\nA previously developed prototype, pictured below, overcame this problem by providing a standoff tube\nand blastproof body, but several key features were further desired: a gripper to hold onto a cut\nvegetation in order to facilitate disposal and ensure that the vegetation does not fall into the danger\narea; a handshield to provide additional protection; and a method to prevent blast ducting. These key\nfeatures were considered and appropriately implemented onto the original prototype, shown in Picture\n1.\nPicture 1: Previously developed prototype. This prototype was inherited from the previous year.\nDesign\nThe design of the vegetation clipper began with brainstorming and sketching of various concepts, and a\nthorough survey of commercially available vegetation clippers.\nThe key functional components in our design are the cutting\nblade, the anvil, the vegetation gripper, and the handle.\nThe blade and anvil must work together to cut the vegetation.\nIn order to prevent excessive dulling of the blade, the stainless\nsteel anvil is faced with polycarbonate. The polycarbonate\nserves a second function, it keeps the blade and anvil parallel\nwhen fully closed. After the blade has been sharpened multiple\ntimes, the polycarbonate can be replaced with a slightly thicker\npiece, which will compensate for the removal of material from\nthe blade. The sharpening of the blade is important as well; the\nblade has been sharpened with the bevel facing down. This\nPicture 2: View of the final gripper design.\n\nprevents vegetation from being forcefully ejected from the blade when it snaps closed. Finally, each\ninternal corner on both the blade and anvil has a radius, to prevent stress concentrations which could\ncause failure resulting from a mine blast or normal operation.\nThe vegetation gripper, as shown above, was designed after testing three commercially available\ncutting tools, two which included compliance springs and one that used a rigid gripper fixed to the top\nof the blade. It was found that the spring-based gripper designs were highly reliable. It was decided that\na cantilevered compliance spring would work well for our application. The spring is designed to follow\nthe profile of the blade, in this way the spring is protected from distortion during transportation and lies\nin the shadow of the blade in the event of a mine blast.\nThe handle was designed with safety and ergonomics as the primary considerations. A 30-cm standoff\ntube moves the operators hand and body further from the explosion in the case of an accident. The\nstandoff tube may pose the danger of channeling the blast towards the user. To alleviate this danger, the\nend of the tube near the the cutter is capped to prevent blast gases from entering. A forearm support\nhelps to support the weight of the cutter to prevent fatigue and enable one-handed operation.\n(Photograph)\nTop view of the clipper\n(Photograph)\nProfile of the clipper with someone holding it\nPicture 3: The newly developed vegetation clipper.\nThe handshield is another principle addition to the prototype, aimed to protect the deminer's hand. It is\ndesigned to afford the desired protection while not hindering the regular operation of the vegetation\nclipper. In order to provide adequate protection, the handshield uses kevlar, which is the material of\nchoice for personal protection equipments. To afford the necessary flexibility without sacrificing\nthickness of the material, layers of kevlar is stored in a pouch in front of the hand, as shown in Picture\n4, and the rest of the handshield is made with a fabric of choice. The top and bottom ends of the pouch\nthin out and respectively connect to the standoff tube and the trigger.\n\nPicture 4: Handshield design for the clipper. From top left clockwise: the back view, with the pouch\nvisible; the front view; the handshield incorporated into the clipper; the handshield in actual use.\nManufacture\nThe tools used to manufacture the parts of the prototype included a drill press, band saw, grinder, and\nsheet-metal sheer, as well as basic hand tools such as pliers, a ball-peen hammer, and hack saw. No\nmills or lathes were used, and CNC machining is not necessary. The design was constrained by the\ntools listed above, so that any machine shop would be suitably equipped to manufacture our clipper.\nThe material used was stainless steel. Other types of steel should not be substituted, because the\nstainless steel selected as passed blast-tests without fracture, due to its high toughness and ductility. It\nalso has the favorable property of resisting corrosion when maintained and stored properly.\nThe parts, when possible, were welded together. Welds are typically stronger and less likely to fracture\nthan other attachment methods such as rivets, bolts, and adhesives. The internal corners of all parts\nwere drilled, prior to being cut with the band saw, to provide a radius at the corner. The radius of the\ncorner helps to prevent stress concentrations that could become a sight of cracking and failure.\nTesting\nSeveral prototypes of the clippers were developed and tested along with commercially available\nproducts, seen in Picture 6. Thick and thin branches were defined as in Picture 7, and the gripper\nfunctionality was tested against a set number of branches of either type. The test revealed that any\ncantilever-spring design performs better than any other designs, and that the blade face should be on\nthe bottom in order to avoid ejecting cut branches. The blade works well otherwise, though it does not\ncut as readily as commercial products. The clipper should perform satisfactorily on vegetation clipping.\nThe handshield interacts with the clipper prototype smoothly, but it remains to be seen how effective it\nwill be in a blast test.\n\nFuture Work\nFuture work should proceed logically from the current design. Feedback from demining experts, and\nfield tests may reveal potential design improvements. For example, the current design is an anvil style\ncutter, which effectively cuts wood and stems, but is unable to cut some fibrous or thin vegetations\nsuch as grass and weeds. To ease transportation, it may be necessary to make the forearm support\ncollapsible. Further iterations of the design may also wish to explore refinement of the trigger, perhaps\nincorporating a prefabricated mechanism such as a bicycle brake handle.\nAcknowledgment\nWe express our gratitude to Andrew Brooks (a.k.a. Zoz) for leaving us a fabulous prototype to work\nwith, and also to Benjamin Linder and Andrew Heafitz for teaching the demining course and their\nenthusiastic support and guidance. Finally, we thank Mr. Charlie McFarlane at U.N. And Mr. Fred\nEstall in Afghanistan for consultation.\n\nAppendices\nA. Various Gripper Designs\nPicture 5: Various gripper design proposed. From top left clockwise: a coil-spring actuated gripper, a\nvertical cantilever spring gripper, a horizontal cantilever spring gripper that wraps out backward, and a\nregular horizontal cantilever spring gripper.\n\nB. Commercial Prototypes\nPicture 6: Commercial products examined. From top left clockwise: Corona BP6210 bypass pruner,\nCorona CH7720 cut-n-hold pruner, Victorinox F65009 rose shear, Berger 4075 long-reach shear.\nC. Testing\nPicture 7: Pictures from field tests. From left to right: a depiction of branches classified as thin and thick,\nwith a pen as a reference; a cantilever spring gripper is demonstrated with the Corona CH7720 pruner.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Farming Minefields",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/0b8e4d8b8889fe0fc06037b00372c99b_MITEC_S06S07_06farmi.pdf",
      "content": "Farming minefields: economics of remediating land with\nmoderate landmine and UXO contamination\nJames Trevelyan*, Sabbia Tilli++, Bradley Parks+ and Teng Han Chiat+\n*Chief Investigator, Demining Research Project,\n++Researcher, Demining Research Project\n+Student,\nDepartment of Mechanical and Materials Engineering, The University of Western Australia\nAbstract\nA significant proportion of the available agricultural land in many countries cannot be used because it is\ncontaminated by landmines and other unexploded ordnance (UXO). Demining with current methods is slow and\nexpensive. Aid agencies and governments need to support large refugee populations for several years because\nthe threat of landmines has forced them off their land. Also, long delays in demining cause loss of fertility and\ndegradation that could avoided if the land was used.\nExperience in Afghanistan and other countries has shown that commercial agricultural and construction\nmachinery can be modified to withstand the effects of antipersonnel landmine and small unexploded ordnance\nexplosions, and provide effective operator protection.\nThis study looks at an alternative strategy to conventional humanitarian demining: to use modified commercial\nmachinery for mechanised agriculture or forestry on contaminated land. The modifications ensure that operators\nand machinery are protected from landmine and ordnance explosions. In many regions, local farmers are doing\nthis already without adequate protection: they accept the risk because the only alternative is destitution.\nBy using this strategy displaced local farmers could generate crop revenue sooner and reduce their dependence\non aid funding. When not being used for agriculture, the machinery could be used to provide mechanical\nassistance for demining operations, particularly for vegetation clearance.\nThe economic model developed in this study is our first attempt to calculate the economics of the approach\nproposed by this study. This report outlines a set of variables that can be used to assess the viability of this\nalternative in comparison with conventional demining methods.\nPreliminary results using conservative cost data from Afghanistan are encouraging. Further studies based on real\ndata with more detailed analysis would give a more precise indication of the viability of this approach.\nHowever, the results of preliminary modelling show sufficient advantage to justify further research on this\napproach.\n1.0 Introduction\nLandmines are a major problem in many countries such as Afghanistan, Croatia, Cambodia and Vietnam. In such\ndeveloping countries where agriculture is a major source of livelihood and export revenue, the presence of mine-\ncontaminated agricultural land represents a major obstacle in social and economic reconstruction efforts.\nCurrent demining of agricultural land first requires the clearance of vegetation with either hand tools or\nmechanically with vegetation cutters, flails, or similar equipment. This is always followed by manual demining\noperations (possibly assisted by mine-detection dogs). Agricultural activities are not permitted until after\ndemining has been completed. However, in Cambodia and other countries, land holders are either farming\nmined land, or are clearing the land for themselves with significant risks to themselves and others (Bottomley\n2001). This is because they cannot afford to wait (possibly for a decade or more) for organized demining teams\nto arrive.\n\nWith scarce resources, demining operations are planned using quantitative socio-economic decision making tools\n(World Bank 2001). Progress reported in Afghanistan before September 2001 suggests that it may take up to 10\nmore years before all designated high-priority areas can begin to be cultivated. This long clearance period\npresents problems in terms of depreciation in the economic value of the land, particularly as fruit trees are an\nimportant component of agriculture in Afghanistan, and it will take years to re-establish productive orchards.\nThe idea for this research project originated with the observation that the damage to agricultural machinery from\nanti-personnel mines is no greater than the damage occurring from normal farming accidents when machines\ncollide with stumps, rocks etc. Modified commercial tractors with back-hoe and bucket excavators have been\nused in mine clearance operations for many years in several countries. Experience in Afghanistan and elsewhere\nhas shown that modest protection measures can provide operator safety from anti-personnel landmine and small\nUXO explosions (Trevelyan 1999). Therefore, it is worth considering the costs and benefits from farming land\nwith low residual mine contamination, without the expensive and time consuming manual demining process.\nInstead of the current manual demining methods used in most countries, we are proposing a radically different\napproach in four basic steps:\n1. A survey to locate suitable agricultural land and select crops that can be grown and harvested using\nentirely mechanised methods,\n2. Preparation with a flail or armoured vegetation cutter to remove vegetation and allow landmine and\nUXO contamination levels to be measured and assessed,\n3. Restoration of the soil by ripping and possibly hoeing with modified commercial machinery to\nremove unwanted root systems and condition the soil, restoration of irrigation and drainage\ninfrastructure, and\n4. Mechanised cultivation, sowing or planting followed by mechanised crop harvesting, using suitably\nmodified commercial machinery.\nWe have assumed that all operations on contaminated land would be fully mechanised using modified tractors\nand other commercial machinery following standard agricultural or forestry practises routinely used in most\ncountries. The operator cabins and other vital components would require modifications to provide full protection.\nYears or experience in many countries1 has provided a wealth of practical knowledge to design the required\nmodifications.\nThis paper describes an economic model that could be used to explore the feasibility of this alternative approach.\nOur model is based on the recent socio-economic modelling of mine action programs in Afghanistan by the\nWorld Bank (2001). Field data for a specific region or country would be needed for the model to be used in\npractice. A detailed feasibility study will be needed to obtain more accurate results before any trials are carried\nout.\n2.0 How Mines Affect Agricultural Land\nMany people in nations with landmine problems depend on their agricultural land for livelihood. The suspected\npresence of mines, whether on agricultural land itself or denying access to supporting infrastructure such as\nirrigation canals, would make the land unattractive to cultivate due to perceived risks2.\nThe immediate socio-economic effects of mined agricultural land are numerous. These include loss of income\nfor the local population leading to migration and refugee problems, aid dependency and cost of providing\nalternative supporting infrastructure such as irrigation water. These problems are well recognised.\n\n1 Demining machinery and mine-resistant vehicles are produced in several countries. South Africa has the longest\nexperience. Other countries with expertise include Australia, Finland, Germany and United Kingdom.\n2 Land that is thought to be mined is often found to be completely safe in subsequent demining operations. However, it is the\nperception of risk that affects human behaviour, not the actual risk.\n\nHowever, there are other effects caused by neglect arising from the perceived landmine risks which may pose\nincreasingly serious problems. Examples of such problems are:-\nGradual loss of fertility of agricultural land due to reduction in nutrient levels caused by leaching.\nTop soil loss caused by erosion,\nDeposition of silt and debris trapped by (unwanted) vegetation during seasonal floods,\nNutrient loss caused by weed invasion,\nWater logging caused by damage to or clogging of drainage systems,\nLoss of fencing, irrigation pipes and other man-made infrastructure,\nInfestation of soil weed seeds and runners and potentially destructive insect pests,\nGrowth of unwanted vegetation such as brambles, scrub, trees, vines etc.\nSteadily increasing cost and difficulty of restoring land to fertile condition by removing vegetation, root\nsystems, weed and insect infestations, and restoring nutrient levels.\nLong term damage to remaining uncontaminated land that results from overgrazing and repeated high\nintensity cropping.\nAll these problems are compounded by delays in demining agricultural land. Further, they can make subsequent\nmine clearance considerably more difficult.\n3.0 An Alternative Way to Manage Mined Agricultural Land\nAs outlined in the introduction, we are suggesting an alternative approach that would substantially reduce the\nlong term damage to agricultural land and restore the livelihoods of the people who depend on it much sooner.\nWe are proposing the use of anti-personnel mine resistant agricultural vehicles, such as suitably armoured\ntractors, to directly cultivate the mined land after appropriate risk assessment and mechanised ground preparation\nmechanised means such as flails.\nMechanised agriculture is not uncommon amongst countries with mine problems like Afghanistan. Local\nfarmers already have the necessary equipment and knowledge to operate farming machinery. However, the\npresent position of aid donors is that land can only be used after demining because unexploded ordnance poses a\nrisk to both the machinery and operators. As mentioned preciously, demining is slow. By modifying local\ntractors to provide protection from the effects of remaining unexploded mines or other ordnance, cultivation\ncould start without the need for costly manual demining. In fact, this direct cultivation strategy is already\npursued by some farmers who take risks by cultivating potentially mined areas using unprotected equipment.\nTo save costs, we propose to armour the tractor only to resist anti-personnel mines and small UXO. Normally,\nanti-personnel mines are the most common types found on agricultural land. Anti-vehicle mines are less of a\nproblem as they are more costly and tend to be laid along roads and tracks to interfere with vehicle movements.\nStep 1: Survey, Selection and Risk Assessment\nAccessibility, fertility, infrastructure and crop type are the four main factors that determine the selection of land.\nFirstly, the designated plot of agricultural land should be fertile and accessible to both a flail for initial clearance\nand tractor for ripping and cultivation. This suggests that the land should be relatively flat and have at least the\npotential for road access to be developed to reach critical infrastructure and markets. In addition, the climate\nshould also suit crops that are suitable for mechanised agriculture, for example wheat or forestry. However, for\nmaximum returns from the investment, several additional factors should be considered.\nMinefields are typically surrounded by uncontaminated land or areas with unknown contamination which may\nalso be suitable for cultivation with protected machinery. The layout of a typical area for which this approach\nmay be considered is illustrated below.\n\nFig. 1: Illustrative Layout of a Potentially Cultivatable Area\nThe tractor locus is the cultivable area over which it can be effectively used. It is affected by the speed at which\nthe tractor can travel between its storage location and the area to be cultivated and other modifiers of transit time\nsuch as vegetation, availability or access tracks etc. The locus could be affected by the presence of roads or\nother means of transporting the tractor quickly. Ideally, maximum benefits are obtained when both the\npercentage of cultivable, contaminated land and the presence of minefields within the tractor's locus are high.\nThe final stage in selection is risk assessment. We suspect that the cost of anti-vehicle mine resistant machinery\nwill be too high for most applications. Therefore, it is important to ensure that there is no possibility of\nencountering anti-vehicle mines in the selected areas. This requires assessment by experienced mine clearance\nstaff. Also, risks will be lower if the initial level of mine contamination is low: this can also be assessed by\nexperienced staff.\nStep 2: Ground Preparation and Risk Assessment\nThe initial ground preparation using flail machines serves two purposes.\nFirst, the flail destroys surface vegetation. This is an essential step in restoring the productive capacity of the\nland. The flail also destroys trip wires and will cause a proportion of mines and unexploded ordnance to be\ndetonated. If used correctly the proportion of unexploded devices remaining after treatment is quite small.\nSecond, flail clearance also helps with risk assessment as skilled observers can usually determine the varieties\nand estimate the number of mines in an area with reasonable accuracy after clearing the first 20%. Should the\nlevel of risk be found to be acceptable, for instance, and one can be certain that no large UXO or anti-vehicle\nmines are present, reconditioning of the land could proceed using the modified tractors.\nThe number of explosions noted during flail clearance indicates the level of mine contamination, and will\nconfirm the required absence of anti-vehicle mines. Given the appropriate use different clearance strategies and\nstatistical analysis tools, this data will indicate the residual mine contamination level. For example, if the flail\nmachine does not cause any explosions, and a subsequent check by using manual demining on selected (small)\nareas fails to find any mines, the risk of mine contamination would be assessed as being very low. However, this\n\ncan only be done by highly skilled and experienced assessors who know where landmines are likely to be laid3 in\na given area of land.\nFlail clearance is essential if the mine contamination levels are unknown or too high for armoured tractors to be\nused without prior risk reduction. Provided the area is accessible, mechanised clearance can be carried out using\nflails run on the ground rather than slightly above it as practised in most demining operations where manual\ndemining is to follow.\nNot all the land may be covered with thick vegetation. In Cambodia, for instance, many mined areas are farmed\nalready by people desperate for a means to support themselves, or who are prepared to accept the risks in return\nfor eventual land ownership. They graze their animals and even plough rice padis in known minefields. These\nfactors can affect land selection and restoration costs.\nAfter clearance, the land will have to be marked and fenced. Most people in mine-affected regions assume that\ncultivated land is free from mine contamination. Any project of this kind would need to be designed to ensure\nthat people do not enter the cultivated areas with mine contamination as agricultural work would definitely result\nin resurfaced and possibly disoriented mines. Fencing, marking or other natural barriers would be needed in\nconjunction with community awareness. The community-based minefield marking project in Cambodia\n(associated with CMAC) provides some useful models and experience in this aspect.\nStep 3: Restoration\nThis step requires the use of mechanical rippers or hoes to remove unwanted root systems and condition the soil\nfor cultivation. This is a well-established practice when opening new land for cultivation in many countries.\nHowever, in some regions, no new land has been opened for agriculture for a long time and equipment may have\nto be brought in from other regions. This process will almost certainly result in residual mines and ordnance\ncoming to the surface. If operators observe this, they can use flags and low cost GPS equipment to mark the\nlocations so that manual deminers can destroy the mines and ordnance exposed in this way.\nAfter restoration, the land would be left for some time to allow weed seeds to germinate and suckers to sprout.\nIn some cases nutrient fertilizer and a germination agent may be needed to encourage a high enough proportion\nof seeds to germinate. A herbicide such as glyphosphate (\"Round Up\") could then be used before planting or\nseeding.\nBefore seeding or planting, irrigation and drainage infrastructure would have to be replaced or repaired. Again\nthis would have to be done using mechanized equipment, suitably protected. A back-hoe and bucket loader\ncould be used for most tasks. However, in some selected (and small) areas manual demining may be required\nwhere protected mechanized equipment cannot be used, or where unprotected machines must be used.\nStep 4: Cultivation\nThe next step in this process is to begin cultivation. Ploughing\nand tilling can be carried out with a plough or tiller. This is\nfollowed by planting which is carried an air-seeder or\nequivalent planting machinery. After the crop has been\nplanted, crop maintenance can be carried out periodically\nwhile the crop germinates. Pesticides, fertilizers and other\nchemicals can be mechanically applied. When the armoured\ntractor is not in use during this period, it can participate in\nother demining activities such as rolling or vegetation\nclearance. This will be detailed in a later section.\nFig.2: Inter 511 Tillage Implement\nThe last step is mechanical harvesting when the crop is ready.\nThroughout this process, maintenance will be needed for the tractor and implements. The tractor and accessories\nare expected to set off various AP mines or other small ordnance during farming operations. Although the\n\n3 For example, in western Cambodia, landmines were often almost entirely in small ditches and depressions and along river\nbanks in otherwise flat land.\n\ndesign will reduce mine and UXO damage to a minimum, some repairs are likely to be needed as in any farming\noperation. Parts for the normal maintenance of the tractors should be available due to the use of local machinery,\nequipment and expertise.\nThe crop yield is unlikely to be fully restored in the first season. The presence of weed seeds, inexperience with\n100% mechanised farming, and the need to restore nutrient levels over several years will mean that one could\nexpect gradual improvement in yield over several seasons.\nStep 5: Mine Clearance\nLastly, when all other high priority land has been demined, conventional or manual demining can be started on\nthe areas previously cultivated by the AP mine resistant tractor. However, the cost of demining land being used\nfor cultivation will be less because there would be no need to remove vegetation.\nOttawa Treaty Implications\nSeveral articles of the Ottawa Treaty (ICBL 1997) require that all mines have to be destroyed by December 2007\n(Article 1 clause 2, Article 5 clause 1). Other articles in the treaty permit extensions of the time limit (Article 5\nclauses 3, 4 and 6). Some may argue that these clauses were not drafted to permit the kind of approach we are\nadvocating now, and that to use the extension clauses in this way might infringe the spirit of the treaty. The next\nreview conference for the treaty is not due until 2008. However, we believe that this gives sufficient time to run\na trial and obtain sufficient results to justify this alternative method of dealing with mined agricultural land.\nShould widespread implementation prove to be feasible in the future, then the treaty could be amended to allow\nthis alternative approach.\n4.0 Operator and Machinery Protection\nWe assume that all operations require a driver and possibly a second\noperator in a tractor cab. This space requires protection from AP\nblast mines and fragmentation mines as well as small UXO effects.\nWhile the specific design of the armouring on the tractor is not\nconsidered in depth in this paper, we will look briefly at the basic\ndesign necessary and some materials that might be considered.\nThe tractor, which should be locally available, would be modified to\na level such that it would only be protected from AP mines and small\nUXO explosions. Generally these would be AP Blast Mines or\nFragmentation Mines, grenades or other unexploded ordnance. The\ndamage from an AP blast mine is mostly from secondary\nfragmentation. The wheels of the tractor would cause the majority of\nmine detonations. The initial blast would be sufficient to blow a\nconventional tyre. The damage caused by the rubber (secondary\nfragmentation) would be fairly minimal and could easily be\naverted with a blast shield under the vehicle near the wheels to\ndeflect the pieces.\nFig. 3: Polycarbonate Windows on a Armoured\nBackhoe Cab\nSource: Landmine Research at UWA Website\nOriginal Photo courtesy of UNOCHA Islamabad\nBlowing a tyre is still expensive and it is desirable to minimise\nthe repair cost. Instead of a conventional tyre, there are 3\nalternatives. Solid rubber tyres could be used: the vehicle can\ncontinue after it has hit a mine, because the tyre will not be\ndeflated. Steel wheels can be used with an open structural\ndesign. The force from a blast mine would be insufficient to\ndestroy/fragment the steel wheels, so the mine would not damage\nthe vehicle. Lastly, conventional tyres can be covered in a chain-\nmail-like covering to protect the tyre from blasts GICHD (2001).\nFigure 4\nTypical agricultural spray equipment used for\nchemical control of weeds and insect pests, or for\napplying chemical crop treatments.\nFragmentation mines and small UXO are potentially more\ndamaging. Some shielding would be necessary to protect the\nunderside of the vehicle. An appropriately designed plate inside\nthe wheel arch can be used to deflect fragments.\n\nThe armour would be required to protect vulnerable areas of the vehicle and the operator. As the explosion is\ngenerally directly under the vehicle the vehicle mass could be exploited to protect the operator from any blast.\nThe motor and fuel would obviously need to be protected. Experience suggests that exposed hydraulic hoses are\nsufficiently robust and do not require shielding.\n6 mm thickness BisAlloy (or comparable steel) is sufficient for protecting the operator cabin. Composites could\nalso be considered. They may provide low cost alternatives that could be 'sacrificed' in the event of a\ndetonation, and cheaply replaced. Pineapple fibre for instance is strong and inexpensive and in a polypropylene\nmatrix it can provide a high strength low mass composite armour. Experience in Afghanistan suggests that glass\nwindows in the cabin would be replaced with 25 mm thick polycarbonate, with a further 3 mm layer on the\noutside that can be replaced cheaply if it becomes scratched (Edwards 1998).\nSecondary fragmentation could also occur from the equipment attached to or towed by the tractor and this must\nbe taken into account when designing armour for the cabin. Consequently some modification may also be\nrequired for ploughs, seeders, spreaders and harvesters which must survive the blast as well as deflect secondary\nfragmentation away from the cabin. Once again, experience in Afghanistan has shown that this is less of a\nproblem than originally expected.\n6.0 Methods of Financing and Tractor Ownership\nWe are proposing that donor funds would be used to acquire machinery for projects of this kind.\nAlthough we suggest the use and modification of locally owned and available tractors, this may not be possible\nin all situations. In addition, the provision of accessories and implements for mechanised agriculture may not be\npossible at prices affordable to the local population. However, there is a large world market for second-hand\nagricultural and construction machinery so this would not pose serious difficulties. However, the cost of\nobtaining such accessories would be one of the most significant factors in determining the success of this\nproposal.\nAnother option for financing the machinery cost is through microcredit or similar low interest lease\narrangements. These may be partially subsidised to make the machinery more accessible to the local population.\nTilli (2000) suggests that if an appropriate source of finance is available, individuals with land affected by\nlandmines may be willing to finance the cost of clearance, especially if the waiting time for clearance is\nsubstantially reduced.\nThe main focus of this study is to explore the economics of farming mine-contaminated land so we have not\nexamined all the possible ways to handle tractor ownership and financing. However, the options we proposed\nabove are currently the most practical and would be worthwhile subjects of further study. In any case, local\nconditions and practice would provide the best framework applicable in any particular country so that\nlandowners would be familiar with the arrangements.\n8.0 Factors to Consider for Implementing a Test Trial\nA carefully planned trial would be needed to establish all the detailed\nprocesses needed to make this alternate approach work in practice.\nFirstly, a partner organisation would be needed to carry out the project\non a trial basis. Possible candidates possessing the necessary experience\nand organisational infrastructure may be Ronco Inc. and Halo Trust. In\nparticular, GICHD (2001) in their recent report on Guidance to\nmechanical mine clearance/ground preparation using commercial tractors\nand front loaders has demonstrated that they have previous experience\nusing modified commercial tractors for demining work. In Afghanistan,\nATC (Afghan Technical Consultants) have experience with armoured\ntractors, but they are not involved with farming operations and would\nneed partners to provide the agricultural expertise required.\nThe economic model developed in this study would help with the initial\nselection of attractive trial locations but further feasibility studies as well as community based consultation and\ndecision making would be needed. In addition, an agricultural consultant would be needed to help with the crop\nselection as well as refine or adapt local cultivation techniques. Depending on the local state of affairs,\nFig. 5: A Belarus 300 Series Tractor\n\nAfghanistan might be a suitable country to conduct a test trial because farming land is relatively flat and clear of\nvegetation. In addition, Afghanistan is also well equipped with Belarus and other Russian tractors, and the\nexpertise to support their use.\nAt least two modified tractors are needed to operate together, or within a short distance of each other. This is\nnecessary in the event of a tractor breakdown due to mechanical failure or damage from exploding ordnance.\nThe second tractor would be needed for rescue and recovery operations. Practical experience necessitates the\navailability of a third modified tractor so that maintenance and repairs can be performed on one tractor without\naffecting interrupting operations in contaminated areas.\nMine-resistant tractors are already commercially available. The Pearson survivable demining tractor available\nfrom Pearson Engineering is one such example. Bucat and Neric (2001) in their review of the commercial mine\nresistant vehicles suggest that the Pearson survivable demining tractor would be a suitable candidate for\nagricultural activities. Although such commercially available mine resistant vehicles are useful candidates for a\ntest trial, we note that most current commercially available mine-resistant vehicles are designed to survive anti-\nvehicle mines4. Hence, they may be too costly to expect reasonable commercial returns with this approach. By\noperating in areas without anti-vehicle mines, the cost of protecting the vehicle can be substantially reduced.\nLastly, the security and storage of the tractor and equipment would have to be considered in the test trials. A\ncentral location would be needed to allow the vehicles to move easily to areas where they are required while at\nthe same time ensure that they are secure during periods of storage.\n9.0 Other Uses for Modified Machinery\nSince a tractor is a versatile piece of machinery which can be coupled with many different attachments and\naccessories, the use of a AP mine resistant tractor would not be limited to agricultural activities. With\nattachments such as a front-end loader or a back hoe, the tractor can participate in mine clearance activities such\nas unblocking and repairing irrigation canals, repairing roads, restoration of electric power and drainage and\nother services to the local community. The recent GICHD (2001) report Guidance to mechanical mine\nclearance/ground preparation using commercial tractors and front loaders shows that such armoured tractors\ncan play useful roles in many demining operations. Indeed, the provision of an AP mine resistant tractor would\nhave numerous secondary benefits besides being able to engage in direct cultivation. Tractors could be leased\nout to commercial demining operators as a source of revenue to recoup the initial cost outlay.\n10.0 Economic Model\nThe model we present here is a preliminary one. There are many simplifying assumptions, and further work is\nneeded to obtain a more accurate forecast of cash flows.\nWe have used a Net Present Value (NPV) cash flow analysis. Cash flows over the life of a project are and are\nthen discounted using an appropriate expected rate of return to account for the time value of money. The\nresultant NPV represents the returns expected over and above the discount rate in 'today's dollars' or real terms.\nIt follows the bigger or less negative the NPV, the more effective the use of donor funds.\nThe model only calculates the project NPV for the donor. The approach we are advocating has clear advantages\nfor the population: they generate income from farming operations much sooner than with the current demining\napproach. However, this benefit is not included in the model because the cash benefit accrues to the local\npopulation, not the donor. The donor benefit arises from savings in aid expenses needed to support the local\npopulation dependent on the land, offset by the investment in machinery. If the model predicts that the alternate\nmethod is more expensive for the donor over time, then we would have to model the benefits to the local\npopulation as well. However, as we shall see, there are direct benefits to the donor from the alternative method\nproposed here.\nSumming all the variables at their present values will give us a cost to remediate contaminated land in a given\narea and re-introduce the displaced local population. We have developed two calculations: one for the current\nmethod of demining and another for the alternative we have proposed here.\n\n4 Anti-vehicle mines are much larger than anti-personnel mines and will totally destroy any normal machinery or vehicles.\n\nThe cost structure for Afghanistan was selected to examine the effectiveness of this alternate approach. We\nchose Afghanistan because the economic and cost data from the World Bank (2001) report was available to us.\nWhere required values for cost variables in Afghanistan were not available, we assumed local Australian cost\nfactors based on the purchasing power parity theorem5. While this may not give us absolutely accurate results,\nwe recognise that the aim of the model is to give an indication of the relative effectiveness of this project, not the\nactual dollar returns.\nThe Net Present Value or cost of remediating a contaminated area under both current and the alternate method is\nbasically calculated as:\nNPV = PV (annual demining cost)\n+ PV (clearance and restoration costs incurred at some point in time)\n+ PV (aid cost for supporting population dependent on the land until they become self-sufficient)\nDetailed formulas for the calculation of the NPV under both methods are provided in Appendix A of this paper.\nThe main difference in NPV between the current and the alternate method proposed in this study arises from the\npotential savings in aid. This would come sooner under the alternative method due to earlier self-sufficiency of\nthe local farmers because they do not have to wait for demining ro be finished before they can start working their\nland. It must be noted that under the alternate method, the potentially contaminated agricultural land which is\ncultivated using the tractor is still demined, but only after the local demining team has fulfilled all other\ndemining commitments in the region. This is offset by the capital investment needed for machinery purchase\nand modifications.\nAn Excel spreadsheet was created to perform the calculations. This sets out the formulas and inputs for\nevaluating the NPV of clearing a contaminated agricultural area under both the current practise and the alternate\nmethod. The details are included in the appendix.\n11.0 Model Results\nUsing the costs from Afghanistan, we used the following variable values:\nReference\nName of Variable\nAssumed\nValue\nB2\nRequired Rate of Return\n5%\nB3\nUnmined Agricultural Land Currently In Use\n10 km^2\nB4\nMined Agricultural Land In Region\n4 km^2\nB5\nOther Mined Land In Region\n2 km^2\nB7\nDemining Cost\n$0.6/m^2\nB8\nDemining Rate\nm^2/day\nB9\nDays/Year Demining Activities are carried out\n300 days\n/year\nB11\nRelocation Cost over entire area\n$200000\nB12\nReconditioning Cost over entire area\n$200000\nB13\nAnnual Cost of paying Deminer Teams (in addition to demining cost B7)\n$0 /year\nB15\nAid Expense incurred over entire area (Refugee cost, medical expenses,\nalternate housing costs, food, etc.)\n$200000\n/year\nB17\nHow many years from now is the mined agricultural land expected to be\ncleared (current method)?\n12 years\n\n5 The purchasing power parity theorem states that in an efficient market, when factors like interest rates, inflation and exchange rates are\naccounted for, the price of goods between two countries are actually the same as the absolute purchasing power of currency does not vary.\n\ncleared (current method)?\nB18\nTotal Capital Cost of armouring Tractors over entire area\n$20000\nB19\nCost of Using a Flail\n$0.30/m^2\nB20\nCost of Using a Ripper\n$0.30 /m^2\nB21\nCost of using tractor for demining activities\n$0.20 /m^2\nB22\nRate of Tractor Demining Clearance\nm^2/day\nB23\nCost of Subsequent Mine Clearance (on cultivated areas)\n$0.30 / m^2\nB24\nRate of Subsequent Mine Clearance (on cultivated areas)\n1200 m^2\n/day\nB26\nhow many days a year can the tractor work\n300 days\nB27\nNumber of tractors\nB28\nTractor Speed\n3 km/hr\nB29\nHours Working Per Day\n10 hours\nB30\nTiller Width\n6 m\nB31\nSeeder Width\n6 m\nB32\nSprayer Width\n6 m\nE32\nNumber of passes for spraying of fertisliser and pesticides.\n3 passes\nB33\nHarvester Width\n6 m\nB35\nHow much (%) of the \"Other Mined Land\" will the tractor be helpful on?\n0.7 (70%)\nB38\nThe tractor can be leased out for $/day to private deminers or farmers\n$100 /day\nB39\nDays per year demand expected\nB45\nHow many years between crops\nB46\nWhat percentage of productivity is expected initially?\n0.5\nB47\nHow many crops until near full (95%) productivity is expected\nUsing the above values, we calculated the NPV of remediating the mined agricultural land under both methods.\nUnder the current demining practice, the model results in a NPV cost of $5,749,838 to the donor to remediate an\nagricultural area of 16km2 (of which 6km2 is mined). This includes the aid cost to support the displaced\npopulation in that location there in terms of aid and housing until they are self sufficient. The major components\nof this are (in $ values at the start of the project):\nDemining cost over 20\nyears\nAid cost over 12 years\nFurther aid cost\nCost of restoring farming\nland\n2,243,198\n1,878,715\n68,780\n1,559,145\nThe alternate method yields a NPV cost of $4,650,970 to the donor for the same area. The major components\nare:\nDemining cost\nover 9 years\nAid until first\ncrop\nFurther aid\ncost\nLand restoration at\ncommencement\nCapital cost Tractor hire income\n1,775,914\n190,476\n123,603\n2,800,000\n259023.85\nAlthough we have no access to current field data, the principal values we have estimated above already yield a\nsignificant saving in cost of approximately $1 million for the above region of 16km2. This result shows that the\ndirect cultivation approach proposed by this study is worthy of further research.\n\nIt should be noted that the land restoration cost (determined by the cost of using the flail and ripper, at a total of\n$0-60 per sq metre) is a major component of these costs. This cost depends very much on the initial condition of\nthe land: we have chosen relatively high costs assuming the land is in poor condition.\nIt should also be noted that many of the costs we have included in the model are not normally part of demining\nprojects. However, we have to take an overall view of the problem of restoring a productive community to\nassess the relative benefits of our approach.\n12.0 Sensitivity Analysis\nSensitivity analysis of four key variables that affect the two models differently can be varied to find the influence\nof some major variables. Some of these variables may be hard to determine. However, if they do not\nsignificantly change the result over a wide range of values, then we need not be concerned. We looked at\nRequired rate of return, Capital cost, Annual aid cost, and the Projected time to clear the mined agricultural\nland.\nRequired rate of return determines the amount that future cash flows are discounted, to account for the time\nvalue of money. A higher required rate of return means future cash flows are more heavily discounted.\nThis may be due to higher rates of interest, inflation or other factors. So delaying demining expenses, or\nspreading them out over several years means they are discounted and thus 'cheaper' than spending the\nmoney now. Consequently the large initial outlay on capital required under the alternative method and the\nfact that demining is completed more quickly (so expenses incurred more rapidly) increase the NPV expense\nof this method with a high required rate of return. But for lower required rates of return, the fact the total\nmonetary outlay in smaller under the alternative method mean that this saving is more heavily weighted than\nthe timing of the savings. Given that the money used to fund the demining operations are donated, a low\nrequired rate if return is very likely.\nNumber of years before mined agricultural land is cleared using\ncurrent method\nTotal cost to donor (NPV million)\nCurrent method\nAlternate method\nThe sensitivity of this factor is demonstrated by varying the required rate of return while holding other\nvalues the same. The exact point of indifference between the two models (when the total cost to the donor is\nthe same) will vary depending upon the other variables.\nCapital Cost of purchasing and armouring tractors has simple linear effect on the NPV of the alternative\nmethod: the cost is expended at the start of the project. Increasing the capital cost by $100,000 increases the\nNPV of the alternate method by the same amount.\nAs the cost of purchasing and armouring the tractors becomes more significant, this approach is less\nattractive. For this reason it would be preferable to armour tractors that are already in service in the area and\narmour them, so that farmers can cultivate previously unworkable mined land. Some arrangement could\nalso be made to allow the tractors to be used in demining activities when they are not in use.\n\nAnnual aid expense is a very significant expenditure under either method. But the alternative method allows\ncultivation of mined agricultural land to begin almost immediately, so aid expenditure is only required until\nthe first crop is harvested and sold. Under the current method, people who would normally be dependant\nupon the mined agricultural land are entirely dependant on aid until that land is cleared.\nThe greater the cost of supporting displaced people, the more attractive the alternate method becomes.\nIf the land is to be used for forestry, the first crop will not be available for several years, resulting in\nsignificant aid dependency. This could be dealt with in two ways. First, the aid could be financed by long\nterm loans repayable when the tree crop is harvested. Second, the forestry could be arranged such that part\nof the area is used for producing short-term products such as fresh or dried fruit, bamboo, brushwood or\nthinnings for fuel etc.\nThe projected time to clear the mined agricultural land under the current method also has a significant\neffect. The longer the delay in clearing the mined agricultural land the longer people will be dependant\nupon aid. However, the NPV cost of restoring the land is deferred as well, and depending on the rate of\nreturn (or discounting), this will offset the aid cost to a greater or lesser extent. However, the socio-\neconomic benefits to the region will be far greater because the value of crop production would normally far\nexceed the subsistence cost of aid for displaced people. However, the crop production value is not modelled\nhere because this model looks only at the costs to the donor: the donor would not normally expect income\nfrom the sale of crops.\nYears before agriculture area ready\nProject cost (NPV millions)\nTotal cost\nAid cost\nLand restoration\ncost\nWe have assumed the same land restoration cost under both the alternate and current methods: use of a flail\nor other machine to remove above ground vegetation, and then the use of a hoe or ripper to remove roots\nand condition the soil. However this is a highly conservative assumption. Given the extended period that\nwill pass before demining and land restoration occurs using current methods, the extent of above ground and\nbelow ground vegetation will be far greater, the actual cost of treatment will be far higher than we have\nestimated.\nThe alternative method is of most benefits when required rates of return are low, capital cost is minimised by\narmouring tractors already in service and when the aid expense is high, and would continue for a longer period\nof time before the mined agricultural land would otherwise be cleared. The alternative method is also more\nbeneficial when the tractor is able to be used a high proportion of 'Other mined Land' to enable maximum\nbenefit.\n13.0 Socio-Economic Benefits\nThe economic model developed looks purely at the costs and benefits for the donor of these two methods of land\nremediation. However, there are other benefits of the alternative method that are less quantifiable or do not\nbenefit the donor directly.\n\nMany people in countries affected by mines are dependant on agricultural land. Mines spread across agricultural\nland rob people of their living. In many regions people are so desperate that they will cultivate the agricultural\nland despite the risk the mines pose with no protection. The proposed alternative method would allow\ncultivation to be undertaken safely. The alternative method would possibly reduce the amount of deaths and\ninjuries, yielding benefits that could be calculated using methods proposed by the World Bank (2001).\nAgricultural in many regions may not be mechanise to any significant extentd. The alternative method requires\nthat all stages of cultivation in a mined agricultural area be mechanised to ensure the safety of the farmers. This\nwould allow the new equipment to be used on other (non contaminated) agricultural land in the area when it is\nnot being used on mined land. There would be a potential increase in productivity and time saving for these\nfarmers as well. This means that the benefits would extend beyond the immediate area of the project.\nIn addition, the alternative method would allow cultivation to start almost immediately. This would provide an\nimmediate stimulus to an entire community and improvements in their sense of well-being. Deminers have often\ncommented to us about this intangible benefit: one that our proposed alternative would bring much sooner.\nLastly, there are benefits in terms of improved travel time, more people returning to their original homes sooner,\nand reduced loss of livestock due to mines. The World Bank (2001) report examines these socio-economic\nbenefits in greater depth and the alternative method proposed allows many of these benefits to be realised\nsooner, hence increasing their time value.\n14.0 Further Study\nThe financial modelling in this study concentrated on the economic aspects of remediating landmine\ncontaminated land with respect to the donor. Many other socio-economic benefits, for instance the value of\nsaving human lives, are not quantified by this model. We propose that a more detailed model should be\ndeveloped that includes benefits to the local community. Should the opportunity costs between both the current\nand the alternate approach prove to be very significant, real options analysis should be used instead of the\ncurrent NPV analysis.\nA full feasibility study focussing on the technical issues of this alternate approach is also recommended before\ncommencement of the first trials. This should focus on issues such as the recommended type of crop, tractor\nfinancing and ownership details, safety and security issues as well as engineering proposals for armouring the\ntractor. The aid of various consultants in each of the specialised fields of study should be sought to obtain a more\nprecise estimate of the benefits associated with the alternate approach.\n15.0 Conclusions\nLandmines are a major obstacle to social and economic reform in many formerly war-torn countries. As there is\na large amount of work involved in demining with limited funding available, the importance of alternate\napproaches to demining cannot be over emphasized.\nThe economic modelling in this study has shown that direct cultivation of mined agricultural land with modified\ncommercial machinery, as proposed in this study, is one alternate approach that would probably save both time\nand money. This method has the potential to reduce the cost of landmine remediation, and complete the process\nfaster, while at the same time allowing the community dependant on the land to begin to function more\nindependently.\nThere are other socio-economic benefits derived from this method of demining that we have not quantified or do\nnot apply to the donor directly, and as such are not included in our modelling of costs and benefits of mine\nclearance.\nFurther evaluations of this method with field data will hopefully verify these results and justify a field trial.\nThere is also scope to extend the economic model to take the particular circumstances (e.g. cropping patterns) of\na proposed trial area into account.\n16.0 References\nBottomley, R (2001) Returning life to field and forest: demining by villagers in Cambodia, Journal of Mine\nAction, Special Issue: Landmines in South East Asia, v5.1, available at http://maic.jmu.edu/.\n\nBucat, M. & Neric, D. 2001, Cultivating Mined Agricultural Land Using Mine Resistant Vehicles, 3rd Year\nMechanical Engineering Project, University of Western Australia.\nEdwards, D. 1998. (Former regional manager for Mine Action Centre for Afghanistan) Personal\nCommunication.\nGeneva International Center for Humanitarian Demining 2002, Mechanical Demining Equipment Catalogue,\nGeneva International Center for Humanitarian, Geneva, Switzerland. (http://www.gichd.ch/)\nGICHD 2001 Guidance to mechanical mine clearance/ground preparation using commercial tractors and front\nloaders, Technical Notes for Mine Action 09.50/01, Geneva International Centre for Humanitarian Demining.\nICBL (1997). Convention On The Prohibition Of The Use, Stockpiling, Production And Transfer Of Anti-\nPersonnel Mines And On Their Destruction, available from http://www.icbl.org/.\nTilli, S. 2000, Microcredit Funding for Landmine Clearance, Department of Mechanical and Materials\nEngineering, University of Western Australia.\nTrevelyan, J. P. (2000a) Landmines in Croatia and Bosnia Herzegovina [Online], Available:\nhttp://www.mech.uwa.edu.au/jpt/demining/ or from the authors.\nTrevelyan, J. P. 1999, Afghanistan Country Report, [Online]. Available:\nhttp://www.mech.uwa.edu.au/jpt/demining/ or from the authors.\nWorld Bank / UNDP 2001, Study of the Socio-economic Impact of Mine Action in Afghanistan (SIMAA), (Draft\ncopy, available from MAPA, Islamabad, copy with Sabbia Tilli, Department of Mechanical Engineering)\n17.0\nBibliography\nTrevelyan, J. P. 2000b, New Technologies and New Ways of Thinking about Mine Action, Department of\nMechanical and Materials Engineering, University of Western Australia\n\nAppendix A - Details of NPV Analysis\nExplanation of Financial Terms and Values Used in Model\nNote: the spreadsheet is available as a compressed zip file as:\nhttp://www.mech.uwa.edu.au/jpt/npv-alt-2002.zip\nThis method determines the Net Present Value (NPV) of remediating land for a given area under two methods,\nthe current demining method and the proposed alternative method. The net present value method calculates the\ncash flows over the life of the project and discounts them to today's dollar terms. Future cash flows are\ndiscounted due to the fact that money has a time value. An example of this is that if one dollar is needed in one\nyears time, 91 cents can be taken now and put it in the bank at 10% interest and at the end of the year $1 will be\nreceived. Similarly if there is a known cash inflow of 1 dollar in a years time , 91c can be borrowed now at 10%,\nto spend now. At the end of the year one dollar will be owed and can be paid with the one dollar received. So\nfuture cash inflows and outflows can be discounted to take this into account.\nDiscount Factors are a common financial tool. They are a multiplier to determine the dollar value today of a\ncash flow in n years time, when I can borrow or lend at r% interest.\nDiscount factor (n,r) =\nr\n+\n(\n)n\n\nThese discount factors are embedded in the excel file, and can be called by the function df(n,r) where n and r are\ncells containing the years that will pass before the cash flow and r the interest rate. This is multiplied by the cash\nflow to determine its present value.\nAnnuity factors are another common financial multiplier. If there is a known cash inflow or out flow received at\neach of the next n years, then each payment could be discounted by the appropriate discount factor depending on\nwhen the cash flow occurs. It can be show that the sum of these discount factors can be simplified to\nAnnuity factor (n,r) =\n\nr\nr\n+\n(\n)n\n-\n\n\n\nThese annuity factors are embedded in the excel file and can be called by the command af(n,r) where n and r are\ncells containing the number of years over which the cash flow will occur and r is the interest rate. This is\nmultiplied by the annual cash flow to determine its present value.\nExplanation of Variables, by cell\n[B2]\nRequired Rate of Return is the percentage return (r) required by the investor. Given that the money is\ndonated this value would be better evaluated as the interest rate for bank deposits.\n[B3]\nAgricultural Land Currently in Use is the area of land in the selected area that is not contaminated with\nmines and UXO and currently in use for agricultural crop production (Ac).\n[B4]\nMined agricultural land is the amount of land in the selected area that had previously been used for\nagricultural activity, and is marked as mined (Ag).\n[B5]\nOther Mined land is land not used for agricultural, eg roads and residential areas, that are suspected to\nbe mined and require demining (Am).\n[B7]\nDemining cost is the cost of clearing a square metre of mined land, using the current method (cd).\n[B8]\nDemining rate is the area in square metres that the demining team can clear in one day (ac).\n\n[B9]\nDays demining per year, this should take into account that teams might not work weekends or in certain\nperiods of the year when the weather is unsuitable (dd).\n[B10]\nAnnual Demining Cost is evaluated as (cd ac dd)\n[B11]\nRelocation cost is the entire cost of bringing all displaced persons back onto the mined agricultural land\nafter demining (CRL). This would potentially include costs of rebuilding or repairing housing.\n[B12]\nRestoration Cost is the cost of restoration needed before cultivation can commence (CRC). This\nincludes a fertilizer and chemical subsidy and the cost of infrastructure restoration. The costs of clearing the\nland using a flail and a ripper to remove roots are calculated separately. This is the cost for the whole area of\nland Ag.\n[B13]\nDemining Personnel Cost is the annual cost of paying deminer salaries. (This is added to the demining\ncost calculated above only if salaries were not originally included. As salaries and all other costs are normally\nincluded in the cost per square metre cd, this value would normally be zero.)\n[B15]\nAnnual Aid Expense is the annual cost incurred by the donor organisation to people displaced from, or\ndependent on the mined agricultural land. This includes shelter, food, medical aid, and any other expenses\nincurred by the donor organisation to support these people.\n[B17]\nTime to demine land represents the estimated number of years (yd) before demining resources will be\navailable to clear the mined agricultural land.\n[B18]\nMachinery capital cost is the cost of purchasing sufficient tractors and machinery and modifying them,\nor simply (preferably) the cost of modifying equipment already in service in the region. Some additional\nequipment might also need to be purchased for the tractors to allow them to perform useful demining and land\nrestoration tasks.\n[B19] & [B20] flail costs and ripper costs These represent the cost of initial land clearance per square metre.\nThe flail would be needed to clear the land of vegetation and, in the case of the alternative method, to reduce\nmine contamination in the mined agricultural area. The ripper would be used to tear up root systems and trees\nleft by the flail.\n[B21] Tractor demining costs is the cost of using the tractor for demining per meter square as well as any\nhiring fee incurred from the farmer who owns the tractor as the tractor may still remain within the ownership of\nthe farmer who wishes to be reimbursed for leasing it out to external agencies.\n[B22]\nTractor clearance rate is the amount of land on which the tractor can usefully be used for demining or\nvegetation clearance in one day (at).\n[B23]\nCost of Subsequent Mine Clearance is the subsequent cost (per metre) of clearing the land after it has\nbeen worked by the tractors (cdt).\n[B24]\nRate of subsequent mine clearance is the improved rate of mine clearance that would be expected after\nclearing of vegetation by the modified tractors. This would improve the rate manual demining teams can work\nat. (adt)\n[B26]\nTotal Tractor Days is the days a year a tractor can work due to climate variations, working weeks and\nany other restrictions. This should be the total amount of days the tractor can work at any activity, including\nagricultural activities. (dt)\n[B27]\nNumber of Tractors. This variable represents the number of tractors that are being used. Practicality,\nthis would suggest a minimum of two or three, so that one can be repaired without significant disruption, and to\nallow rescue if the other tractor stops after a mine blast or breakdown (nt).\n[B28]\nTractor Speed. The speed of the tractor, in km/h is used to calculate how long it will take the tractor to\ndo its agricultural activities (vt).\n[B29]\nWorking hours per day is used to determine the amount of time it will take the tractor to complete its\ndemining activities (hdt).\n\n[B30] to [B33] Tiller, Seeder, Sprayer and Harvester width are again used to determine how long many days the\ntractor will be take to perform its agricultural activities. All parts of the agricultural process will need to be\nmechanised, to make the cultivated mined agricultural land safe (wt, wsd, wsp, wh).\n[E32]\nNumber of Sprayer / Spreader Passes Required. The sprayer/spreader implement might need to be\ntowed through the cultivated several times during a crop cycle to apply pesticides and weed control chemicals.\n(nsp)\n[B34]\nDays available after agricultural activities. This is a calculated result representing the days each tractor\nhas available after completing its agricultural activities. It is determined by the difference between the Total\nDays Available and the days to perform tilling, seeding, spraying & harvesting considering the number of\ntractors available, given tractor speed and implement size as well as for a given crop frequency (see below),\nover both the mined and non-mined agricultural Land.\nThe Days to perform tilling can be calculated as:\n\"Mined Agricultutal Land\"\n\"Agricultural Land\"\n+\n(\n)\n\n\"Days Tractor Can Work\"\n\"Tractor Speed\"\n\n\n\"Tiller Width\"\n\n\"No. Tractors\"\n\n\"Years between harvests\"\n\n(\n)\nSimilar equations are determined for each of the other activities, namely seeding, spraying and harvesting.\nThe resulting final equation (after re-arranging) is;\n\"Total Tractor Days\"\n\"Tiller Width\"\n\"Seeder Width\"\n+\n\"Sprayer Width\"\n+\n\"Harvestor Width\"\n+\n\n-\n\nx\n\"Mined Agricultutal Land\"\n\"Agricultural Land\"\n+\n(\n)\n\n\"Days Tractor Can Work\" \"Tractor Speed\"\n\n\n\"No. Tractors\"\n\n\"Years between harvests\"\n\n(\n)\nIn the Excel Spreadsheet, this is represented by\n=\n\nB26\nB33\nB32\n+\nB31\n+\nB30\n+\n\nB3\nB4\n+\n(\n)\n\nB45\n\nB28\n\nB29\n\nB27\n\n(\n)\n\n\n\n-\n\n(Note: factors of 1000000 and 1000 are used for converting to metre units)\n[B35] Land Suitability Multiplier (%). This factor is a percentage modifier the amount of other mined land\n(non-agricultural) the tractor can work on to support demining operations. Steep slopes, rocky land, residential\nareas and forests will be areas where tractors could not be used to support demining operations. These areas will\nhave to demined at the higher manual demining cost and slower rate. This information is also used to determine\nhow much land there is for the demining tractor to work on, and how much time this will take per year. Areas\nthat should be excluded by this modifier are excessively rugged terrain and areas potentially mined with AV\nmines, as the tractors can only withstand blasts from AP mines.\n[B36]\nAnnual demining cost of the alternative method is calculated as the number of years taken to complete\nall the demining in the subject area with the associated costs involved.\nThe Annual demining cost is;\nThe amount 'Other Mined Land' suitable for tractor work, cleared per year, at the cost of using the tractor and\nthe subsequent manual demining plus;\nThe cost of demining the remaining 'other Mined Land' using conventional manual demining method and costs\nper year plus;\nThe cost of clearing the mined agricultural land at the reduced cost of subsequent mine clearance, after the all\nother land has been cleared.\n\nThe resulting equation is;\n\"Land Suitability Modifier\"\n\"Other Mined Land\"\n\"Years to Complete Demining\"\n\n\"Tractor Demining Cost\"\n\"Cost of Subsequent Mine Clearance\"\n+\n(\n)\n\n\n\n\n+\n\"Suitability Modifier\"\n-\n(\n)\n\"Other Mined Land\"\n\"Years to Complete Demining\"\n\n\"Demining Cost\"\n\n\n\n\n+\n\"Mined Agricultural Land\"\n\"Years to Complete Demining\"\n\n\"Cost of Subsequent Mine Clearance)\"\n\n\nIn the Excel Spreadsheet, this is represented by\n= B35\nB5\nB54\n\nB21\nB23\n+\n(\n)\n\n\n\nB35\n-\n(\n)\nB5\nB54\n\nB7\n\n\n\n+\nB4\nB54\n\nB23\n\n+\n\n[B37]\nThe Days Tractor Idle is the number of days in a year the tractor is available after it has completed its\ndemining and agricultural activities. This is calculated by;\n\"Days Available after Agricultural Activities\" -\n\"Land Suitability Modifier\"\n\"Other Mined Land\"\n\n\"Years to Complete Demining\"\n\n\"Number of Tractors\"\n\n\"Tractor Clearance Rate\"\n\n\nIn the Excel Spreadsheet, this is represented by\n= B34\nB35\nB5\n\nB54\nB27\n\nB22\n\n(\n)\n\n\n-\n\n[B38]\nTractor Fee. If the tractor is owned by the donor organisation, it may be hired out to private farmers or\ndeminer's for a daily fee. This is the fee charged per day. If the tractor is not owned or leased to third parties\nthis value should be entered as 0.\n[B39]\nDays of External Demand. This represents the expected demand for the tractor from external agencies\nor individuals in terms of number of days per year. This can be more than 365 if there several tractors. The\nExcel spreadsheet will determine if there is sufficient time available for this level of demand.\n[B40]\nDays per year the tractor will be leased out is determined to be the lesser of: a) Days of External\nDemand for tractors and b) the Days Tractor Idle multiplied by the number of tractors. This value can be greater\nthan 365 if there are several tractors.\nIn the Excel Spreadsheet, this is represented by\n=MIN(B27*B37,B39)\n[B41]\nAnnual Revenue from leasing tractor is evaluated as (Days per year the tractor will be leased out) x\n(Tractor Fee).\nIn the provided Excel Spreadsheet, this is entered as\n=B38*B40\n[B45] to [B47],[F45] & [F46],[B51],[B56] These variables are used to calculate the potential aid savings\nexpected as the locals become self sufficient due to crop revenue. As full crop yield is not expected during the\nfirst year of cultivation perhaps due to factors such as inexperience, weeds or insufficient land reconditioning,\nthe reduction is aid is expected to be gradual and is modelled here as an exponentially decaying function.\nThe two values ([B45]-[B46]) entered are inter-related. The amount of aid required to support the people is\ndependant upon the (area of) mined agricultural land and will be constant until they produce their first crop on\nthis land. This crop will be assumed to have a reduced productivity because the land has lain idle for some\n\nyears. Therefore the people will still need some aid to make up for the short-fall. The amount will be reduced\nafter several crop cycles and tends to zero in the long term.\n[B45]\nYears between Crops. This factor represents the number of years between crops. If a crop is expected\nonce a year this would be 1, is there are 2 crop a year this would be 0.5 and so on.\n[B46]\n% Initial Productivity represents the initial productivity expected in the first year of cultivation. For\nexample, 0% productivity = 0 and 100% productivity = 1.\n[B47]\nCrop cycles to Achieve 95% Productivity. This variable represents the number of crop cycles will it take\nto achieve 95% productivity where the local farmers are expected to be able to support themselves.\nUsing these three values the amount of percentage of the annual aid expenditure in year (t) is modelled as an\nexponential decay;\nexp(-A*t+B), where it can be shown;\nA =\nln 1\n\"% Initial Productivity\"\n-\n(\n)\nln 0.05\n(\n)\n-\n\"Years Between Crops\"\n\"Crop Cycles to Acheive 95% Productivity\"\n\n+\n(\n)\n\nIn this Excel Spreadsheet provided, 'A' is entered in cell [F45] as\n\n=\n\nln 1\nB46\n-\n(\n)\nln 0.05\n(\n)\n-\n(\n)\nB45\nB47\n-\n(\n)\n\n\nIn a similar manner, the variable B is\nB = ln 0.05\n(\n)\nA\n\"Year Between Crops\"\n\"Crop Cycles to Acheive 95% Productivity\"\n+\n(\n)\n\n[\n]\n\n+\n\nThis is entered in cell [F46] of the Excel Spreadsheet as\n=LN(0.05)+F45*(B47+1)*B45\n[B51] & [B56] Using the exponential decay factor calculated previously, we can determine what is essentially an\nannuity factor that also takes into account the fact that the cash flow in each year is decaying according to the\nabove rule.\nThe DecayedAidNPV in cell [B51] and [B56] represents this decayed annuity factor. It is evaluated in macro\n\"Calc\" and calculated as\n\"Year of First Harvest\"\n\"Year Demining is Complete\"\nn\n\"Discount factor (in that year)\" \"Decay Function (in that year)\"\n\n(\n)\n\n=\n\n[B49]\nYears to complete under the current method. This represents the amount of time needed to complete\ndemining under the current practice. This is evaluated as;\n\"Other Mined Land\"\n\"Mined Agricultural Land\"\n+\n(\n)\n\n\"Demining Rate\"\n\"Days Demining per Year\"\n\n\nThis is formula entered in cell [B49] of the Excel Spreadsheet is\n=(B5+B4)*1000000/(B8*B9)\n[B50]\nThe NPV of the current method is the net present value or cost of demining using current practises. It is\nevaluated as;\n\n= -1* Annuity Factor(Year to Complete Demining) * Annual Demining Cost;\nsubtract Annuity Factor(Year first crop is grown) * Annual Aid Expense;\nsubtract Discount Factor(Year Mined Agricultural Land is Cleared) *(Flail Cost + Ripper Cost +\nRelocation Cost + Reconditioning Cost);\nsubtract Discount Factor(Year First Crop is grown) * Decayed Aid NPV * Annual Aid Cost ;\nsubtract Annuity Factor(Year to Complete Demining)* Annual Demining Teams Salary;\nIn the Excel Spreadsheet provided, this is entered in cell [B50] as:\n=-af(B49,B2)*B10\n-af((B17+B45),B2)*B15\n-df(B17+B45,B2)*B51*B15\n-df(B17,B2)*(B20*B4*1000000+B11+B12)\n-af(B49,B2)*B13\n[B54]\nYears to complete under the Alternative Method. This variable is a calculated value representing the\namount of time needed to complete demining under the alternate approach of farming with a protected tractor. It\nis essentially:\n= Years to clear agricultural mined land at improved clearance rate;\nplus Years to clear part of 'other mined land' at improved clearance rate due to tractor\nplus Years to clear remaining 'other mined land' at the original demining rate.\nIn this model, the value is calculated as:\n= \"Mined Agricultural Land\"\n\n\"Suitability Factor\"\n\"Other Mined Land\"\n\n\n(\n)\n+\n\"Rate of Subsequent Mine Clearance\" \"Days Demining per Year\"\n\n\n+\n\n\"Suitability Factor\"\n-\n(\n)\n\"Other Mined Land\"\n\n\n\"Clearance Rate\" \"Days Demining per Year\"\n\n\nIn the Excel Spreadsheet, this is represented in cell [B54] as:\n=\nB35\nB5\n\nB4\n+\n(\n)\n\nB24\nB9\n\n(\n)\nB35\n-\n(\n)\nB5\n-\n(\n)\n\nB8\nB9\n\n+\n\n[B55]\nAlternative Method NPV. The net present value of this alternate approach to demining is calculated as:\nAnnuity factor(Years to complete demining) * tractor revenue;\nsubtract Annuity factor(Years to complete demining) * Annual Demining Cost;\nsubtract Discount factor(Year of first crop) * Decayed NPV * Aid Expense;\nsubtract Annuity factor(Year of first crop) * Aid expense;\nsubtract Capital Cost of Armouring Tractor;\n\nsubtract Cost of flail and ripper for Mined agricultural land;\nsubtract Cost of relocation;\nsubtract Cost of Reconditioning of Land;\nsubtract Annuity factor(Years to complete demining)* Annual Demining Teams Salary\nIn the Excel Spreadsheet provided, this is represented in cell [B55] by:\n= -af(B54,B2)*B36\n-df(B45,B2)*B56*B15\n+af(B54,B2)*B41\n-B18\n-B4*1000000*(B19+B20)\n-af(B45,B2)*B15\n-B11\n-B12\n-af(B54,B2)*B13\nBoth of the NPV's evaluated would be negative and as they are both outflows in cash which represent the\namount required from a donor to pay for clearing of the land. Thus the method with the least negative NPV is\nthe cheapest method to demine the area for the donor. The NPV represents the amount the donor would have to\ndonate now to pay for all the tasks over the time it takes to clear the mined area. If this money is held with an\ninterest rate equivalent to the require rate of return and withdrawn as the expenses are incurred, all costs will be\ncovered.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Technical Proposal Rapid Technical Surveys by Roger Hess",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/f708ef6a94c72ee4c3e36e7eef482491_MITEC_S06S07_06draft.pdf",
      "content": "Technical Proposal\nRapid Technical Surveys using the Wide Area Detection and\nExplosive Scent Tracing\nBy R. Hess\n1 Objectives\n1.1 Develop a cost-effective system that can be quickly deployed to a Landmine and\nUXO affected country that will rapidly identify potential high threat and/or confirm\nlow threat areas. The system must be able to:\n- Perform rapid, objective-based site sampling against all potential threat munitions\nto a minimum depth of minus one meter.\n- Accurately record and map the sampling zones in a manner that can be quickly\nentered into the Mine Action GIS Data-base.\n- Able to work in tropical, arid, and moderate-cool environments\n- Have the ability to mount on the various prime movers commonly found in\ndeveloping countries.\n- Remove the potential for human-error to the maximum amount possible.\n- Multi-lingual capable\n2 Background\n2.1 Identifying and separating potentially hazardous from non-hazardous areas is one\nof the most difficult tasks a Mine Action Manager is faced with. The most common\nmethodology employed for an Impact survey involves roving teams using a\nquestionnaire based system. While considerable amounts of socio-economic\ninformation is gathered, areas that are \"Surveyed-out\" as low threat are based on a\nsubjective assessments rather then objective sampling. The potential margin for\nerror for an impact survey is very high and areas are often incorrectly assessed.\n2.2 Even with highly successful impact surveys, such as the Canadian-funded Level-1\nin Cambodia, there is still a very wide margin of error potential in data gathering\nprocess. The human factor is both the strongest asset and the weakest link of any\nproject; the data gathered is only as good as the people who do it. If a person is\nnot in good health, misunderstands the answers given, or asks the wrong type of\nquestion, critical information is lost or never collected.\n2.3 Contrary to the previously beliefs, threat munitions are often located far deeper\nthen what the normal search methodologies could detect. The Mine Action\ncommunity as a whole has reconsidered its previous stance of 10-20cm clearance\nand are now classifying areas in accordance with the end land use (ELU). Cluster\nmunitions, artillery, mortars, gravity bombs, and deep-buried landmines have been\nlocated in areas that were technically \"cleared\".\n3 Concept\n\n3.1 Incorporate commercial, off the shelf (COTS) Ion Scanning Explosive\nDetection systems into the sampling process\nThe commercial homeland defense industries have made in\nsubstantial improvements in explosive trace detection.\nAirport security, customs departments and forensics\nlaboratories across the world were in need of a reliable\nsystem that could quickly identify the presence of\nexplosives and as a result, Ion Scanning systems can now\nreliably detect explosive traces down to the Picogram level\n(one-trillionth of a gram), the new Fido system can detect\neven lower.\nThis is equal to or better then many well-trained biosensor\nsystem, however the machine are not affected by altitude\nchanges, background traces (stinging plants, oil, etc), long\nworking days, or low humidity/high heat conditions\nThese systems are man-portable, contain no hazardous\ncomponents, and can be flown to any site on commercial flights as excess baggage.\n3.2 Construct the sampling system utilizing commonly available components.\nThis type of trace sensing process only requires small amounts explosive particles to be\ntrapped on a Fiberglas filter for analysis. Filters in various sizes and shapes designed\nfor air sampling are commonly available from VWR Scientific and are rated at\ntemperatures of up to 140o f. The filter itself can be removed from the holder and tested\nthough the Ion Scanning device in the same manner as the filters supplied by the\nmanufacturer.\nGas powered lawn vacuums are also commercially available, inexpensive, can draw up\nto 400cfm of air through the hose. The engine and vacuum assembly is simply\ndismounted from the standard chassis and\nmounted either directly to the prime mover or\non a pallet assembly that can be carried in a\nscoop bucket.\nPVC pipe and flexible, ribbed radiator hoses\nare used to connect the vacuum unit to the\nsampling nozzles on whatever prime mover is\nused.\n3.3 Incorporate a flexible, accurate digital geophysical map of the area sampled.\nRecently, various wide area detection systems have proven to be effective against\nmetallic mines in actual clearance operations. This system shown below is currently in\nuse and has proven itself as a highly versatile and extremely cost effective means of\nassessing the potential deep-buried Landmine and UXO contamination.\n\nThis is a modular system that\nincorporates commercial, off-the\nshelf (COTS) technologies from the\nindustrial sectors to produce a fast\nand cost-effective search and survey\ntool. This system incorporates the\nrecent improvements in high\nprecision\nsatellite\npositioning\nsystems,\nground\nconductivity\nsensors, laptop computing, and\nGeographic Information System (GIS) technology into a portable, rapid data collection\nand analysis platform with \"follow-the bullet\" navigational software to ensure the correct\ncourse is maintained and recorded.\nThe system records the data directly into a\ncommercial laptop at 20 times per second, which\nallows a faster recording over conventional data-\nlogging systems and less chance of human error. The\ndata is stored directly into an Access database file for\nprojection into standard GIS systems.\nAs it is a modular system, it can be mounted on a\nvariety of prime movers. These include Mine\nResistant Vehicles (MRV, as shown above), small All-\nTerrain Vehicles, or commercial construction and\nagricultural equipment.\nThe system can use either active or passive detection\nsystems to accommodate the terrain, threat, and\nspecific needs.\n3.4 Accurately track and map the route and areas being surveyed and sampled\nThe Geo-Physical Survey System (GeoSvy) provides three interoperable and\ninterchangeable phases of field operations, survey planning, real-time operations, and\npost-collection analysis of results.\nmaps of the survey area. This display is\nused as the basis for a highly interactive\nsurvey planning capability. The job\nplanner establishes a survey area and\nalignment lines at a specified resolution.\nWide area DGPS satellite tracking\nsystem (Omni-star) allows the KIMS to\nrapidly move along roadways with +/\none-meter accuracy without relocating\nand recalibrating a transmitter every 3-4\nkm. This ensures mobility along long\nstretches of road and provides accurate\ntracking of the system moving back and\nforth across large open areas.\n- Real-time positioning data for\nThe Graphic vector-based display shows current\n\nlarge open areas is provided by a centimeter-level accuracy Z-surveyor. This\nutilizes a base station at a known surveyed position and connected via radio link\nto the roving survey vehicle. Position information is passed from the GPS\nreceiver to the computer using a NMEA standard GPGGA serial message. The\nlaptop computer receives serial messages from the towed sensors through\nPCMCIA interfaces.\n- The GPS data is received at a rate of once per second and the sensor data at 8\ntimes per second. The position associated with a particular sensor reading is\ninterpolated between sequential GPS readings.\n- As data is collected, the vehicle operator is guided along the preplanned\nalignment lines by a graphic display showing the alignment center-line, a\nrepresentation of the vehicle's position relative to the center-line, and a direction\narrow showing the direction to turn to get back on-line. This display is also color-\ncoded by alignment offset to allow for at-a-glance vehicle operation. While on\nline all of the alignment view graphics are shown in green. As the alignment\noffset increases all of the graphics turn yellow and then to red for larger offsets.\n3.5 Employ the correct prime mover for the environment\nTo be effective, the combined system cannot be vehicle-specific and must be mountable\nto various prime movers. Each country has its own logistical challenges and unique\nvehicles require special considerations for maintenance and spare parts. The system\nmust be flexible enough to be mounted on the vehicles that are most commonly\navailable in the host nation.\n4 Proposed Test Locations\n4.1\nCambodia.\nThe US has Funded 12 month project with CMAC in the Pailin region. Very few\nclearance activities have been conducted in this area and the landmine and UXO\ncontamination is extremely high.\n4.2 Eritrea/Ethiopia Temporary Security Zone\nThe UN has a contract to conduct a rapid road verification project in this region. The\ncurrent equipment list includes four Mine Resistant Vehicle, an Armored 5.5 ton\nExcavator, a fully operational wide-area detection system, a Manual Clearance Team,\nand an MDDT.\n\n5 Cambodia Equipment\n5.1 DTW Tempest Mini-Flail\nTempest side view\nThe vehicle is remotely guided only through line-of-sight with the use of a simple hand-held control\npanel. All gauges and power indicators are located on the rear of the vehicle. The vehicle can\neffectively cut through heavy grass and bushes and is very useful as a vegetation and tripwire\nreduction tool.\nBefore\nAfter\nExample of Vegetation Conditions\nEmploying the Tempest in a wide-area EST role will involve a two-stage process. The only\nmodifications required is building a platform to replace the flail, which would hold the EST filters\nand Vacuum assembly. This can be transported as part of the Tempest package to the field.\n5.2 Mine Resistant Vehicles:\nThe preferred MRV's be two of the WMF WerWolf systems from Namibia or South African\nCasspirs. This range of vehicles is extremely mobile, has good power-weight ratios, and is\nextremely survivable against AT Mine blasts.\nThe alternate choice would be the Mine Protected Range of South African Samil vehicles. These\nare used vehicles however they can be purchased in a fully recondition/reconditioned\nconfiguration. While not as powerful as the Werwolf, they are extremely durable vehicles and\ncost approximately _ of the price.\n\nDue to the harsh road conditions in Cambodia, heavier MRV's will have mobility problems. Both\nthe Werwolf and the Samil 20 & 50 series vehicles are small enough to cross the bridges and\nstill able to maneuver through the local conditions.\n5.3 Configurations: Werwolf\n5.3.1\nCommand vehicle & KIMS/EST Vehicle for roadways\nA standard troop carrier configuration would be employed as a command and control platform\nfor the Tempest and as the prime mover for the KIMS/EST is used in a road survey capacity.\nThe troop cab is more then sufficient to configure all of the required equipment to operate both\nsystems.\n5.3.2\nRecovery and Tow Vehicle\nThe second vehicle will have a recovery platform installed in place of Troop carrier pallet and a\nwinch, it can serve as both the Cargo and recovery vehicle. The other would retain the armored\ntroop carrier pallet and work as a Command & Control vehicle for the Tempest while it's\nsearching and can also be used as a REST sampling platform itself along roadways and\nimproved trails that are wide enough.\nExtension on the Bed\nto carry the Tempest\nThe actual tracking and mapping of the operation would also be a two-phase operation. One\nwould be a simple working map of the area and the other would be through the 'Missing Link\"\nsystem developed by GeoSpatial and used by the Forest Industry in Canada.\nThe Missing link system accurately records and tracks the progress of skidders moving the logs\nbeing harvested and can be downloaded into a GIS. This would allow accurate tracking of where\nthe REST samples were taken and be able to record them into the Level-1 database, therefore\nassisting in the land management effort during and after the clearance efforts.\nThe working map is a simple drawing of site and used as a planning tool and for command and\ncontrol. This will also be used to compare the results of the REST samples once they are tested.\n\nThe first step will be to cut U-shaped lanes evenly spaced at 10 to 15 meters apart across the\narea to be sampled. If we're working a grid system, then the grids can be 50x50 or 100x100\nmeters.\nTempest in Area Preparation\nMRV/Transport and\nRecovery Vehicle\nMRV/Command\nVehicle\n10 Meters\n10 Meters\n10 Meters\nShould no detonation occur during the area prep process, enough time will be allowed for any\nfumes to clear and the REST Pallet would be attached in place of the Flail Device. The lanes\nwould be number sequentially and marked on the working map.\n\nOnce the area is ready, the REST pallet is installed on the Tempest in place of the flail. The\nVacuum assembly can be as simple as the motor from one of the back-pack MEDDS linking in\ntwo sets of filters mounted on each side of the pallet.\nEach time the Tempest returns to the road, the filters are changed and marked accordingly.\nTempest in REST Sampling role.\nMRV/Command\nVehicle\n10 Meters\n10 Meters\n10 Meters\nMRV/Transport and\nRecovery Vehicle\nIf the Tempest breaks down in the lane or has a disabling Mine-strike, the Recovery WerWolf\ncan safely drive directly down the lane and attach a chain or tow bar to the rear or front and drag\nit out.\nIf an oversized, strong eyebolt is attached to the front and rear of the Tempest for these\nsituations, then a long metal bar with a spring-loaded snatch hook can be used to hook it up to\nthe Werwolf. The operators would never need to dismount from the vehicle during the entire\nrecovery operation.\n\nBy incorporating the Missing Link technology, the system should be able to link the data into the\nGIS system. If a good aerial photograph system is already in place with the GIS, then we'll be\nable to produce maps that will look like the two below.\nThis technology has already been used in US clearance programs (hence the maps below) and\nduring talks with GeoSpatial, this will be easy enough to do in macro to micro level to support\nmine action programs in developing countries\nThe Overview can be broken down into larger grids, which would be highlighted when\nthe REST filters indicate a presence of explosives. The individual 50x50 or 100x100\nsub-grids can then be identified through the higher resolution settings. Anything\nobviously noticeable would also be entered on the map, so a living system is developed\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Understanding Landmines and Mine Action",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/ec-s06-design-for-demining-spring-2007/5a0b4f3ae5cc682880d4cab176e29381_MITEC_S06S07_01understan.pdf",
      "content": "Understanding Landmines\nand Mine Action\nRobert Keeley\nSeptember 2003\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nUnderstanding Landmines and Mine Action\nSer\nItem\nPage No\nIntroduction\nLandmines and Unexploded Ordnance: definitions and\ndescriptions\nHow landmines are used\nTypical landmine injuries\nMine action programs\nLandmine clearance\nThe Application of Technology\nPersonal Protective Equipment (PPE)\nAnnexes:\nAnnex A: Generic landmine design\nAnnex B: Statement of principles for humanitarian mine action\nAnnex C: Anti-landmine campaigns and the 1997 Ottawa\nTreaty\nThe aim of this document\nIn order to conduct any analysis of mine action programs, or to propose the use\nof new technologies, it is first important to review the background of the mine\naction sector since its first inception in 19881.These notes set out an\nintroduction to the problems of landmines, explain how mine action programs\nare organised, and provide a short explanation of how mine clearance is carried\nout. A brief summary of the campaign to ban antipersonnel mines is also\nincluded.\nAny questions or requests for further technical advice may be submitted to the\nauthor via the following email address: BobKeeley@compuserve.com\nNote: this document is intended to provide an introduction to the issue of\nlandmine contamination and the structure of mine clearance programs. It\nis not designed to provide safety advice and is not a replacement for\nformal safety training.\nThe first humanitarian mine clearance project was carried out by a British Non-government\norganisation (NGO) 'The HALO Trust' in Afghanistan 1988 (source: presentation by Paul Jefferson, ex-\nHALO deminer and project manager)\nPrepared by Robert Keeley\nPage ii\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nUnderstanding Landmines and Mine Action\nIntroduction\nAccording to the International Campaign to Ban Landmines (ICBL)1:\n\"Landmines are now a daily threat in Afghanistan, Angola, Bosnia, Cambodia,\nChechnya, Croatia, Iraq, Mozambique, Nicaragua, Somalia, and dozens of other\ncountries. Mines recognize no cease-fire and long after the fighting has stopped they\ncontinue to maim or kill. Mines also render large tracts of agricultural land unusable,\nwreaking environmental and economic devastation. Refugees returning to their war-\nravaged countries face this life-threatening obstacle to rebuilding their lives\nThose who survive the initial blast usually require amputations, long hospital stays, and\nextensive rehabilitative services. In Cambodia alone there are over 35,000 amputees\ninjured by landmines--and they are the survivors. Many others die in the fields from\nloss of blood or lack of transport to get medical help. Mine deaths and injuries in the\npast few decades total in the hundreds of thousands.\"\nLandmine and unexploded ordnance (UXO)2 contamination have significant\nhumanitarian implications. Mines can hamper reconstruction after conflict,\nperhaps by blocking the route of a new highway or a power line. Mines can\ndeny the use of agricultural land or riverbanks. They can even prevent tourism\nbringing in valuable foreign currency through denying access to cultural heritage\nsites. Development project personnel who are not warned of the dangers can\nbecome casualties.\nHowever, most of all, mines effect the poor3. Mine contamination denies the\nsafe use of agricultural land. Many people leave the land and drift to the towns;\nothers, often the poorest elements of society in mine-affected countries, have to\ntake risks to survive: many people living in mine-affected countries engage in\nvarious kinds of deliberate risk-taking activities, such as gathering firewood or\nherding cattle in areas they know to be mined, simply because they have no\nchoice. Faced with stark economic imperatives, some people even take on 'do\nit-yourself' demining to clear land for their own use or to salvage the metal\ncases of weapons for sale as scrap metal4.\nUnfortunately, such activities only add to the burden to the country caused by\ncasualties, the large numbers of which can overwhelm the limited resources of\nrural health centres. Casualties cannot support their families; they become\nbeggars and drift to the towns. Women who become mine casualties can suffer\nan extra burden: they may lose the chance to get married, or their husbands\nmight desert them. Furthermore, curious children are also particularly at risk.\nSurviving casualties often lose limbs, and the prosthetic support they need for\nthe rest of their lives can often only be met with external support.\n1 http://www.icbl.org/\n2 For the purposes of clarity, the terms 'mine action'? and 'mine clearance' include clearance of\nunexploded ordnance (UXO).\n3 See the UN website http://www.mineaction.org/misc/dynamic_overview.cfm?did=140\n4 Handicap International covered the issue of such 'spontaneous demining' in research in 1999-2000.\nPrepared by Robert Keeley\nPage 1\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nLandmines and Unexploded Ordnance: definitions and descriptions\nLandmines\nAccording to International Mine Action Standards (IMAS)5, a (land)mine is a\n'munition designed to be placed under, on or near the ground or other surface\narea and to be exploded by the presence, proximity or contact of a person or a\nvehicle'6.\nMines can be either designed as 'anti-personnel' or 'anti-tank'. Anti-personnel\n(AP) mines are designed to be activated by people, whilst anti-tank (AT) mines\nare intended to defeat tanks or other armoured vehicles.\nAnti-personnel (AP) mines\nThere are hundreds of different types of AP mine7, though probably only about\n50 or so are found in any significant numbers in the mine affected countries\naround the world. All AP mines can be broken into 2 groups. These are:\n AP blast mines\n AP fragmentation mines\nAP blast mines. AP blast mines tend to be\nsmall, flat and cylindrical, typically 60-140 mm\nin diameter. They rely on the effect of explosive\nblast to damage the victim, and are designed to\ndetonate when the victim steps on them. They\nare often buried in order to camouflage their\npresence. AP blast mines are deliberately\ndesigned to be small: this makes them cheaper and easier to store, carry and\ndeploy. Furthermore, the small size means that the wounds are generally not\nimmediately fatal. In combat this means that more soldiers are needed to\nevacuate and care for the casualty, whereas a bigger mine that causes an\nimmediately fatal wound only removes one soldier8.\n5 The United Nations has a general responsibility for enabling and encouraging the effective\nmanagement of mine action programmes, including the development and maintenance of\nstandards. UNMAS is the office within the United Nations Secretariat responsible for the\ndevelopment and maintenance of international mine action standards (IMAS). The work of preparing,\nreviewing and revising these standards is conducted by technical committees, with the support of\ninternational, governmental and non-governmental organizations. The latest version of each standard,\ntogether with information on the work of the technical committees, can be found at\nwww.mineactionstandards.org (source: IMAS Glossary of Terms).\n6 IMAS definition 3.120\n7 'Jane's Mines and Mine Clearance' compiled by Colin King\n8 Some further detail about the design of anti-personnel mines is included at Annex A\nFigure 1. The key is placed next\nto this Yugoslavian AP mine to\ngive an idea of its size (Photo by\nthe author, 1996)\nPrepared by Robert Keeley\nPage 2\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAP fragmentation mines. AP fragmentation\nmines use the detonation of their explosive\ncontent to drive metal fragments into their\nvictims. They are usually able to be initiated\nby the victim walking into a tripwire, and can\nthus often kill or injure several victims at\nonce9. The simplest design of an AP\nfragmentation mine is basically a hand\ngrenade mounted on a stake driven into the\nground, with a trip wire attached to a pin.\nWhen the trip wire is pulled, the pin is\nwithdrawn and the mine functions. However,\nthere are two main variations on this basic\ntheme. These are:\n Bounding fragmentation mines . Unlike\nsimple 'stake' mines, bounding\nfragmentation mines are buried, making\nthem harder to detect. When initiated, the\nfirst explosive charge propels the mine\ncasing into the air to a height of\napproximately 1 metre, where it detonates.\nThese mines are some of the most\ndramatic - and devastating - as they are\ncamouflaged like AP blast mines but can\nalso strike anybody who is in the danger\narea.\n Directional fragmentation mines . This\ndevice is crafted in such a way that the\nmain explosive force is directed outwards\n(the original, American version of this mine\n- the M18 'Claymore' - even includes the\nhelpful direction 'front towards enemy' cast\ninto its plastic casing!) and was originally\ndesigned to be placed in front of defensive\npositions and command detonated in the\nface of human-wave type frontal assaults.\nThe Claymore was soon fitted with the\nmeans to fit a trip-wire (thus making it a\n'mine' by modern definitions) and has been\nwidely copied around the world. Such\nmines tend to have a lethal arc of about 45\ndegrees.\nFigure 2. The wooden stake of this\nYugoslavian anti-personnel\nfragmentation mine is driven into the\nground, the mine placed on top, and\na tripwire run out from the fuse on\nthe top of the mine (photo by the\nauthor, 1996)\nFigure 3. A selection of bounding\nfragmentation mines found in\nCambodia. These examples have\nbeen neutralised and kept by the\ndemining program for training\npurposes (photo by the author, 1999)\nFigure 4. A selection of\ndirectional fragmentation mines\non display in Cambodia. The\ncap in the foreground gives an\nidea of scale (photo by the\nauthor, 1999)\n9 The lethal range of an AP fragmentation range is around 15-25 metres, though they can be dangerous\nout to a range of 100 metres or so (King, 1997).\nPrepared by Robert Keeley\nPage 3\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnti-tank (AT) mines\nThe main difference between an AP and\nAT mines is that an AT mine is much larger\nand filled with more explosive, hence\nmaking it able to defeat a tank. Usually (but\nnot always) AT mines are also designed to\nhave a minimum operating pressure so\nthat, unlike AP mines, people do not set\nthem off10. The usual aim of AT mines is to\nachieve a 'mobility kill' by blowing the track\nFigure 5. This Yugoslavian mine has the\noff a tank, immobilising it and thus making\nshape and size of a typical anti-tank\nit an easier target, though there are some\nmine. (photo by the author, 1996)\nAT mines that are also designed to\ndetonate under the belly of the tank.\nUnexploded Ordnance and Ammunition\nAn item of unexploded ordnance is, in\nessence, a piece of explosive ordnance or\nammunition11 that has 'failed to function as\nintended'. UXO may include all natures of\nexplosive ordnance including naval\nordnance, land-service ammunition and air\ndropped weapons. Typically, only the latter\ntwo of these categories are relevant to humanitarian programs12.\nBattlefields may be strewn with any number of items of UXO, which vary greatly\nin size from hand grenades the size of an apple to large aircraft bombs\nweighing more than 1000kg. Although they have failed to function as intended,\nUXO can sometimes require only the slightest disturbance to detonate. Their\nage and appearance can be deceptive - lethal items are still found in France\nand Belgium from the First World War13, and although rusty on the outside, are\noften found to be in perfect working order.\n10 This was not for any particular humanitarian purpose; an AT mine is more expensive than an AP mine,\nrequires more resources to store, transport and deploy, and would, in the 'science of killing' that\nunderpins modern war-fighting doctrine, be 'wasted' if it was detonated by a person and not a tank.\n11 In military terminology, the term 'explosive ordnance' is used to describe weapons that have some sort\nof explosive content, thus leading to the terms 'unexploded ordnance' for the left over items and\n'explosive ordnance disposal' (EOD) for the teams that clear up such items. However, because landmines\nare items of explosive ordnance but not items of UXO (as they haven't been activated yet) this can get\nvery confusing for non-specialists. There is a growing tendency for non-specialists who are active in\nadvocacy issues to use the term 'explosive remnants or war' (ERW) to cover both landmines and UXO.\n12 A figure that is commonly quoted by some EOD specialists is \"10% of all ordnance\". The provenance\nof this figure is difficult to determine exactly but it is believed to come from a technical assessment\ncarried out by German weapon designers after the Spanish Civil War.\n13 \"Every year we handle approximately 250 tons of ammunition from these wars. Within these 250 tons,\nsome 20 tons are doubtful ammunitions which could be chemical shells from WWI.\" Michel Lambrechts,\nquoted in Mine Action Information Centre Journal Edition 4.2, 2000\n(http://maic.jmu.edu/journal/4.2/Features/ww2/ww2.htm)\nFigure 6. Items ordnance from the First\nWorld War unearthed in Belgium\n(Published on line at the Belgian WWI\narchaeological website (www.diggers.be))\nPrepared by Robert Keeley\nPage 4\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nThe problem caused by UXO may\nbe exacerbated by their\nunpredictability. Two apparently\nidentical items of ordnance might\nbehave very differently when\nhandled, depending on what has\nhappened to that item before it is\ndiscovered.\nCluster-bombs, submunitions and\nbomblets\nThese items of ordnance have\nreceived a great deal of media attention\nin the last few years and are worth a\nbrief explanation. In the Second World\nWar, German weapon designers realised\nthat the effect of a typical aircraft load of\nbombs could be dramatically increased if\nbombs were designed to carry a number\nof small 'sub-munitions' that could\nspread evenly over a larger footprint\nthan that affected by a single large bomb\nof the same total weight14. This idea was\nput to the test in a series of air raids on\nEngland and the concept has been\nwidely copied by a number of nations in\nthe years since. The large carrying\ncanister is generally now called a 'cluster\nbomb unit' whilst the submunitions are\nFigure 7. A selection\nof aircraft bomb\ncasings kept in a\nmuseum in Vietnam.\nThe large tail fins at\nthe rear of the bomb\nin the centre are\ndesigned to slow\ndown the bomb so\nthat it explodes\nbehind the low-\nflying aircraft that\ndrops it (photo by\nthe author 2000)\nFigure 8. This American air-delivered\nsubmunition, found in Kuwait after the first\nGulf War, is about the size as a soft drink\ncan. Recently (in Afghanistan) its bright\nyellow packaging was often confused with\nyellow emergency food parcels dropped\n(photo by the Author, 1991)\nthe items that it dispenses. Submunitions can come in two main types -\n'bomblets' (i.e. small bombs that are designed to explode on impact or after a\nshort delay) or 'scatterable mines' (i.e. devices that are intended to be initiated\nby the victim). Many bomblets fail to function as intended and thus become\nUXO.\nIt should also\nbe noted that\nsubmunitions\ncould also be\ndelivered by\nartillery.\nFigure 9. This type of submunition can\nbe delivered by artillery or surface-to\nsurface rocket. It is about the size of a\nU2 (type D) battery, but its small size\nbelies its deadliness - it is regarded by\nEOD specialists as one of the most\nsensitive and dangerous items of UXO\nthat can be encountered (photo from\nthe UN Mine Action Centre Croatia,\n1995)\n14 Briefing from the UK Defence Explosive Ordnance Disposal School, 1988\nPrepared by Robert Keeley\nPage 5\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAbandoned ammunition\nOne problem that is often encountered soon after\na conflict is the stockpiles of abandoned,\nunexpended ammunition left over from the conflict.\nWhilst this is not 'unexploded ordnance' as such\nas it has not been expended, it can and does pose\na hazard as items of abandoned ordnance will\ndeteriorate over time and can become unsafe to\nmove. This is particularly the case with poor\nquality or old ammunition items and the problem\ncan also be exacerbated by conditions of high\ntemperature. There is an additional problem where\nstocks of abandoned ordnance include small arms\nand their ammunition, which can be plundered by\narmed gangs seeking to exploit lawless conditions\nat the end of an armed conflict.15\nFigure 11. The effects of high\ntemperatures exacerbate the risk of\naccidental detonation of abandoned\nammunition. These items were found in\nthe Kuwaiti desert where they had lain\nin the sun for several months (photo by\nthe author 1991)\nFigure 10. An ammunition\nstockpile in the town of\nSrebrenica, Bosnia and\nHerzegovina. Poor ammunition\nmanagement can increase the\nrisk of accidental detonation\n(photo by the author, 1994)\n15 This is a common problem in Iraq at the time of writing (Source: email posting by Roger Hess on the\nMenschen Gegen Minen (MgM) website June 2003) but it has been a problem for many years\n(discussions with Professor Branko Kopjar, then of the University of Oslo, 1996).\nPrepared by Robert Keeley\nPage 6\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nHow landmines are used\nHistory of landmines\nAlthough the history of mines can be traced back as far as Roman times16 it\nwas the introduction of tanks in the First World War that led to the development\nof the first modern mines. Anti-tank mines were introduced to provide defending\ntroops with the means to create an obstacle to armoured vehicles that were\nseemingly unstoppable by the conventional barriers of ditch and wire. Later, as\nattacking troops learned to pick up these anti-tank mines in the path of their\ntanks, the anti-tank mines were protected in turn by the introduction of anti\npersonnel mines. These would slow down the progress of engineers sent into\nthe minefields to breach paths through the minefield and their detonation would\nalso alert the defenders to the fact that an attack was in progress. Mine warfare\nreached its peak in the North African campaign in World War II when the desert\nprovided few other obstacles to manoeuvring armies, and huge minefields,\nextending many miles, were built. The lessons of mine warfare were well\nlearned by post war armies, and the armies of both NATO and the Warsaw Pact\nincorporated tactics of employing minefields and also breaching them under fire.\nMine clearance techniques are covered below.\nEconomics of mine warfare\nLandmines are cheap, simple technology. One figure commonly quoted in anti\nlandmine advocacy literature is '$3 to make17.' Although this figure grows\nsignificantly when modern, western mines are taken into account (one American\ntype of AP mine is reported to cost $38618) It is certainly true that landmines can\nbe one of the 'lowest-tech' weapons available today: one common example, the\nChinese-made Type 72A has only one moving part, and there is no precision\nengineering required of the sort needed to machine a rifle bullet. Furthermore,\nbecause of their low technology landmines are easy to store compared to some\nmore complicated weapons, and usually require nothing more than a shovel to\nemplace19. In military parlance, landmines act as 'force multipliers' in that they\n16 The Romans would deploy 'caltrops,' spiked tetrahedrons that would pierce the feet of attacking troops\nand thus work in much the same way as anti-personnel mines would some two thousand years later. For\nmore on the historical elements see \"The History of Landmines\" by Mike Croll.\n17 Commonly quoted in International Campaign to Ban landmines (ICBL) literature in the leadup to the\n1997 Ottawa Treaty banning anti-personnel landmines. The $3 price is understood to be the price of one\nof the simplest anti-personnel blast mines, the Chinese Type 72A. However, the same quote also usually\ngoes on to say \"...a thousand dollars to clear\", which while spuriously accurate (it was apparently arrived\nat by dividing one year's budget from a demining program in Cambodia by the numbers of mines\nreported cleared that year) it can easily be shown that this figure is actually almost meaningless, as it costs\nnearly as much to clear a square kilometre with one mine in it as it does to clear the same area of a\nthousand mines. The extra cost of actually dealing with detected mines is only one of a number of costs\n(both fixed and variable) incurred in mine action.\n18 The M74 AP mine (US Munitions Command)\n19 Many NATO and Warsaw Pact nations developed a number of more complicated landmine delivery\nsystems, such as the BARMINE and RANGER systems developed by the British. Artillery, helicopter\nand fixed-wing aircraft can also deliver 'scatterable' mines, usually when contained as 'submunitions'\nwithin a 'cluster bomb unit'.\nPrepared by Robert Keeley\nPage 7\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\ncan help a small defending force defeat a larger attacking force, and can do so\nmore cost effectively than other weapons, particularly more expensive modern\nanti-tank weapons20. It is for this reason that nations who were willing to\nendorse the 1997 Ottawa Treaty to ban AP mines were unwilling to extend the\ntreaty to cover AT mines.21\nThe simplicity and cost-effectiveness of mines is also a major factor in\nexplaining the widespread use of mines throughout the numerous countries that\nare now faced with dealing with the mine contamination problem. Indeed, as\none of the earliest humanitarian deminers said \"a landmine is the perfect\nsoldier: Ever courageous, never sleeps, never misses22\"\nConventional minefields\nAccording to International Mine Action Standards (IMAS)23, a 'minefield' is an\narea of ground containing mines laid with or without a pattern24.\nTypical burying depth\nMines tend to be buried, in order to camouflage them from attacking troops. In\norder to achieve this, soldiers may only need to excavate a few centimetres to\naccommodate the mine. It is clearly quicker for the soldier to bury the mine as\nshallowly as possible, and in most cases mines are found very close to the\nsurface25.\nTypical minefield components\nA typical, 'conventional26' mixed minefield (i.e. one with both AT and AP mines)\nconsists of:\n20 In the conventional sense, minefields and direct-fire weapons (i.e. weapons fired in line-of-sight) are\nintended to be used together. The minefield acts best when attacking forces are stopped short by a\nminefield, or forced to change direction to manoeuvre around the obstacle. It is easier to hit a stationary\ntarget than a moving one, and armoured vehicles tend to be less heavily armoured on their flanks, exposed\nwhen turning, than on their front.\n21 Comments of delegates to the author during the Oslo Conference in September 1997 to draft the Ottawa\nTreaty\n22 Paul Jefferson, 1991\n23 The United Nations has a general responsibility for enabling and encouraging the effective\nmanagement of mine action programmes, including the development and maintenance of\nstandards. UNMAS is the office within the United Nations Secretariat responsible for the\ndevelopment and maintenance of international mine action standards (IMAS). The work of preparing,\nreviewing and revising these standards is conducted by technical committees, with the support of\ninternational, governmental and non-governmental organizations. The latest version of each standard,\ntogether with information on the work of the technical committees, can be found at\nwww.mineactionstandards.org (source: IMAS Glossary of Terms).\n24 IMAS definition 3.132\n25 However, mines can sometimes be found at quite deep depths. This is covered in more detail below.\n26 In this case, the word 'conventional' is used to refer to minefields compliant with Protocol II of the\nConvention on Conventional Weapons (CCW)(1980 amended in 1996). As will be shown below, mines\nused in many countries rarely complied with these requirements.\nPrepared by Robert Keeley\nPage 8\n\nUnderstanding Landmines and Mine Action\nJuly 2003\n Anti-personnel (AP) mines to act as an obstacle to troops, and hence delay\nclearance of anti-tank mines\n A boundary fence and markers to indicate the presence of mines28\nTypical conventional minefield layouts\nMixed Minefields. Within a boundary fence, a\nconventional mixed minefield might consist of a\nnumber of rows of AT mines. A main minefield\ndesigned to act as a barrier to advancing troops\nmight consist of some six rows of AT mines,\nwith the AT mines some 5-6 metres apart29.\nThere could be anything from 10-100 metres\nbetween mine rows30 and between the first and\nlast mine rows and the perimeter fence. The front rows of the minefield might\ninclude special fuses designed to help defeat minefield breaching machines\nsuch as tanks fitted with rollers or ploughs.\nSome armies trained soldiers to place AP mines\nin a 'cluster' around AT mines. Such a cluster\ncould consist of 3 AP mines, placed at\napproximately 10, 12 and 2 o'clock. There was\nmuch variation: sometimes the AP mines would\nonly be clustered around the front AT mine row.\nThis technique was found by deminers to have\nbeen used by Iraqi forces in Kuwait in 1990. The\nIraqis also fenced and marked their minefields.\nHowever, as well be described below, the\nexperience of humanitarian demining teams\nsuggests that these conventional minefields are\nFigure 13. Typical NATO\nrarely encountered elsewhere.\nATAP mine cluster (pre 1997)\nFigure 12. A typical NATO (pre\n1997) mixed minefield layout\n1 km\n27 An anti-tank mine is one that is exploded by the presence, proximity or contact with a vehicle but not\nthrough the presence, proximity or contact with a person unless that person undertakes a deliberate act to\nmove or dismantle the mine.\n28 Both NATO and the Warsaw Pact included mine marking as part of their operational doctrine;\nsurprising as it may seem, both alliances realised that the minefield fence acted as a powerful deterrent\nand could cause the attacking troops to hesitate or deviate from their intended course, so improving the\ndefenders' ability to shoot at them. Indeed, the use of minefield fences without any mines to utilise this\neffect was a recognised tactic (in NATO this was referred to as a \"Phoney Minefield). CCW also requires\nstates party to map and record mined areas; however in many cases (especially where mines are used by\nnon-state actors) this is not done. Even when minefield records have been produced, they are often of\ndubious quality: \"Like any other country, the real mine situation is confused. The infantry laid mines but\nfailed to record them, some engineer records have been destroyed, lost or are incomplete and the LTTE\noccasionally infiltrated the army's positions and laid mines among them\" (comment on the MgM\ndemining website, July 2003).\n29 Clearly the smaller the distance between mines, the more mines there are in a given sized minefield, but\nthis has obvious resource implications. Mine spacing and the number of rows were the result of involved\noperational analysis calculations by the potential users, to get the most resource-effective 'stopping\npower.' Use of patterns helped ensure that the minefield achieved the correct balance.\n30 The minimum distance between rows would be dictated primarily by the need for the mine-layers to\nmaintain a safe distance between rows whilst rowing. The bigger the distance between the rows, the\nlonger a potential attacker would have to search for mines.\nPrepared by Robert Keeley\nPage 9\n\nUnderstanding Landmines and Mine Action\nJuly 2003\nLarge mixed minefields could be\nused, as they had been in the North\nAfrican campaign of the Second\nWorld War, to place obstacles across\nlarge areas of featureless terrain.\nHowever, in many cases minefields\nwould be 'tied in' to natural features\nto enhance their value as an obstacle\nTable 1 - Typical mined areas31\n Routes and lines of advance (especially at\nchoke points such a bridges, tunnels or\nfords\n Check points\n (Abandoned) defensive positions\n Infrastructure (power lines, dams)\nto attackers. Thus, terrain must be taken into account when planning clearance\nof such mined areas. For example, mines might be placed on the banks of a\nriver either side of a ford or a demolished bridge, mines might be placed in a\nnarrow valley or cutting where attackers cannot avoid them, or around an\nobstacle such as an 'abatis' (a pile of felled trees) across a road, to harass\ntroops attempting to clear the obstacle. Mines might also be used to deny the\nuse of 'dead ground' (ground that cannot be seen from the defensive position)\nto an attacking enemy. Table 1 provides a summary of places where troops\nmight use landmines\nAnti-personnel minefields. Smaller designs\nmight be employed, often without AT mines,\nas 'protective' minefields in front of\ndefensive positions, intended to harass\nattacking infantry assaulting the position.\nFor example, a typical Vietnamese\nprotective minefield (as used in Cambodia\nbetween 1979-89) might consist of two rows\nof AP mines, with 1m spacing between each\nmine, and 1m spacing between the mine\nFigure 14. A deminer clears an AP\nrows. In the former Yugoslavia protective\nminefield in Cambodia. The minefield\nminefields might consist of a row of AP\nconsisted of two rows of AP mines, 1\nfragmentation mines, with directional\nmetre apart. The mines are buried a few\nmillimetres below the surface and there\nfragmentation mines at either end of the\nwas no minefield fence (photo by the\nrow, followed up by a row of AP blast mines.\nauthor, 1999)\nUse of AP fragmentation mines operated by\ntripwire meant that it was possible to spread out these mines to the limit of their\n'killing area', so such mines might be spaced 20-30m apart.\nProtective minefields can be very small: for example, in the fighting in\nCambodia Khmer Rouge raiding parties might carry a small number of AP\nmines to put out every night around their positions to provide early warning of\nany attempts at infiltration32. Although such mines were supposed to be picked\nup again every time they moved on, any number of reasons might have\nprevented this from happening, not least soldiers forgetting where they placed\nall of the mines! Mines can therefore be expected around any area that was\noccupied by a defending force for any length of time.\n31 From a mine awareness briefing prepared for the Register of Engineers for Disaster Relief (RedR) on\nbehalf of Handicap International, 1997\n32 \"The War of the Mines\" by Paul Davies and Nic Dunlop\nPrepared by Robert Keeley\nPage 10\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nUnconventional minelaying\nEffect of not having fences\nAlthough both NATO and\nthe Warsaw pact trained to\nfence their minefields33, in\npractice users of mines\nsince the Second World\nWar have rarely used\nfences, and most\nminefields in place in the\nworld today are unmarked.\nThis means that, although\npeople still talk about\n'minefields' the problem is\nthat deminers are faced by\nclearing large areas34,\nusually without defined\nboundaries. This can mean\nthat far more resources are employed to clear mined areas than is actually\nnecessary.\nDeep buried mines\nAlthough there has been little systematic\nand independent research on the question\nof deep buried mines, there are three main\nexplanatory variables that explains the\nphenomenon of deep buried mines. These\nare set out below.\nFigure 15. In the foreground of this photograph is a typical\nminefield fence in the Falkland Islands (the penguins are\nevidently not heavy enough to set off the mines!) However,\nBritish military engineers erected this fence after the end of\nthe war (photo by the author 1984)\n Mines that become buried over time . The\nFigure 16. Minefields in the former\nfirst explanation of deep buried mines is\nYugoslavia were rarely marked at the\ntime of laying, though there were\nthat they can start off near the surface\nattempts after the fighting to mark\nbut become buried over time. This is\nhazardous areas. The white police tape\noften through landslips or subsidence,\nused here (ineffective against the winter\nbut there are other possible causes,\nbackground) was observed after the end\nsimilar to the geographical effects that\nof the war in Croatia (photo by the\nauthor 1996)\ncauses stones to rise in ploughed fields\n33 However, CCW 1980 (and NATO and Warsaw Pact doctrine) also allowed for the deployment of 'non\npre-planned' minefields that did not require marking, and mines have been emplaced by remote delivery\nmeans, notably the use of helicopters by the Soviet forces to deliver mines in Afghanistan between 1979\n89, and the use of air-delivered scatterable mines by the coalition forces in the first Gulf War, 1990-91.\n34 The IMAS definition of a 'mined area' is an area which is dangerous due to the presence or suspected\npresence of mines (IMAS 04.10 Para 3.131)\nPrepared by Robert Keeley\nPage 11\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\n Mines that are deliberately buried deeply .\nThere have been some reports that mines are\nburied deeply to defeat conventional mine\ndetection techniques. One such deep buried\nmethod is shown in the diagram opposite. It is\nclearly much more labour intensive to dig\nmines in like this, it increases the risk of the\nperpetrator being caught and it adds no value\nfor strikes on normal vehicles. It does\nhowever reduce confidence in the clearance\nwork, as it might mean that such a mine\nblows up after a demining team has passed\nthat way.\n Missed mines. There is a third possible\nexplanation for mines that are reported as\n'deep buried' mines after they detonate under\na vehicle passing over an apparently cleared\narea - perhaps the mine was indeed missed\nby the clearance team. Again, there has been\nlittle or no systematic, independent research\nof this issue.\nThe effect of time\nThe most evident effect of time on\nmined areas is the growth of\nvegetation. Land not in use, because\nof fighting or because of the fear of\nmines being present, quickly\nbecomes overgrown. A large\nproportion of the time spent in the\nfield by deminers is spent clearing\nvegetation so that they can search for\nmines.\nThe second effect of time, as referred\nFigure 17. In this diagram an\nanti-tank mine has been buried\ndeeper than usual, in order to\ntake it out of the range of mine\ndetectors. A wooden plate and\npost are used to transmit the\npressure from the target vehicle\nto the mine's pressure plate. In\norder to make up for the\nattenuation of blast caused by\nthe deeper depth, the mine has\nbeen 'double stacked'\nto above, is the possible variation on\nFigure 18. This photograph, taken in Cambodia,\nburying depth. It is believed that\nshows the degree to which vegetation can overgrow\nmines may move in the soil over\na mined area (photo by the author 1999)\nyears. However, there is little\nscientific research in this area at present.\nPrepared by Robert Keeley\nPage 12\n\nAV Smith: posting on \"blast effects\" on the MgM website, 2003\nUnderstanding Landmines and Mine Action\nSeptember 2003\nTypical landmine injuries\nThe force of the explosion attenuates as the distance from the explosion's\ncentre increases (the explosive force is inversely proportional to the cube of the\ndistance from the explosion's centre35) and thus it is very possible to sustain a\nmajor injury from a small explosive charge in close contact (such as an anti\npersonnel mine under the foot) whilst experiencing much less injury from a\nmuch larger explosive charge several metres away. There is hence an\nenormous variety in the range of explosive injuries from landmines and UXO.\nNevertheless, the International Committee of the Red Cross (ICRC) has been\nable to identify three main patterns of landmine injury36. These are:\n Pattern One Injury. Traumatic\namputation of one or both legs,\nusually caused by stepping on an\nAP blast mine. The resulting\nexplosion destroys the foot and\noften part of the leg. The explosion\nalso drives fragments of the mine\ncasing and parts of the victim's\nown shoe and clothing into the\nwound, along with other debris\nsuch as soil and vegetation. The\nresulting injuries can easily\nbecome infected and the victim\ncan require several operations.\nTraumatic amputation of the\naffected leg is the usual result.37\n Pattern Two Injury. Multiple\nlacerations caused by\nfragmentation. Usually caused as a\nresult of the victim being in the\nvicinity of a detonating AP\nfragmentation mine or item of\nunexploded ordnance. It is believed\nthat many of the most severely\ninjured pattern 2 casualties do not\nsurvive the trip to the nearest\nhospital.\n36 Source: ICRC Video: \"Anti Personnel Mine Injuries Surgical Management (1993)\"\n37 The extent of the injuries varies with the size of the mine and of the victim. A small mine may only\ntake of part of a foot of an adult wearing strong footwear such as army -issued boots, whilst some of the\nlargest AP mines may take off both legs; injuries to children can be particularly severe.\nFigure 19. Bilateral below-knee amputation\nresulting from a landmine injury. (Photo from UN\nMine Action Centre Croatia 1996)\nFigure 20. Scars left from multiple lacerations\ncaused by an exploding UXO. The severity of\nPattern 2 injuries will vary with the proximity and\nsize of the explosion (photo: Project RENEW,\nVietnam 2002)\nPrepared by Robert Keeley\nPage 13\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\n Pattern Three Injury. Traumatic amputation of one or both hands,\naccompanied by injuries to the face and eyes. Such injuries are usually\ncaused by handling landmines or items of unexploded ordnance.\nFigure 21. These casualties are examples of Pattern 3 wounds and show the range of injuries\npossible. The man on the left was in close proximity to the detonation of a mid-range UXO; the\nman in the centre, picked up a small UXO out of curiosity (apart from losing his right hand, he\nwas also blinded), whilst the third man escaped with light scarring whilst searching for buried\nUXO with a home-made mine detector (All photos by the author 1998-2001)\nImpact of mine injuries\nMine/UXO injuries have two main impacts. Firstly, they affect the lives of the\ncasualty and their family; secondly they have impacts on the medical\ninfrastructure of the affected country.\nThe main economic effect on the victim is the limiting of ability to earn income to\nsupport themselves and their family.38After suffering an injury the ability of the\ncasualty to make a living is greatly curtailed. As well as obvious physical\ninjuries, the casualty may suffer psychological damage. Female casualties are\nregarded as being particularly vulnerable as the extensive physical damage can\nseverely limit their chances of marriage. Even when married at the time of the\naccident, organisations specialising in mine victim assistance report that it is\ncommon for husbands to desert the casualty.\nThe effects are not limited to the casualty or their immediate families. Treating\nmine injuries drains the local medical infrastructure of developing countries, as\nthese sorts of wounds inevitably become infected and usually require 2-3\noperations to debride the wounds of debris and necrotic tissue. Pattern 1\ncasualties will require a prosthesis or a wheelchair if they are to regain any\nmobility and, in the case of prostheses, will also need intensive physiotherapy to\nlearn how to use the artificial limb. Furthermore, most amputees will require a\nnew limb ever 2-3 years as the old ones wear out. Where the casualties are\nchildren, the situation is exacerbated, as growing children will need their limbs\nadjusted or replaced several times each year.\n38 Farmers using contaminated land are usually already among the poorest of their society, hence they\nhave no choice but to take the risk of using the land - even, in many cases, when they know the land is\ncontaminated.\nPrepared by Robert Keeley\nPage 14\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nMine action programs\nThe increasing understanding of the global impact of land mines on non\ncombatants has encouraged the development of mine clearance programmes\ndesigned with humanitarian concerns in mind. In many cases, for a variety of\nreasons, aid managers have not always been able to coordinate their\nrequirements with the local military (see below), and professional demining\norganizations have taken the lead in conducting wide-scale humanitarian mine\nclearance. For the purpose of these notes, Mine Action39 is defined as a\n\"comprehensive, structured approach to dealing with the tangible consequences\nof mine and UXO contamination, involving mine survey, mine awareness and\nmine clearance\"40.\nThe Inter-relationship of Mine Action Programme Elements\nDemining\nThe core element of an effective mine action programme is the clearance of\nmines and unexploded ordnance. No matter what effort is spent on mine risk\nreduction education, survey, victim assistance or campaigns to ban mines, the\nmines and UXO that are in the ground must at some time be removed in order\nto remove the threat that they pose. The large-scale clearance of land of mines\nand/or UXO is called 'mine clearance' or 'demining'. However, in order to make\ndemining cost-effective, and maximise the effect of limit resources available to\nmost demining programmes it is necessary to carry out several other ancillary\nactivities. These are explained below. The inter-relation of these components is\nshown in the diagram at Figure 22 below.\nArea Reduction\nThe use of suitably trained dogs and specialist dog handlers can also speed up\noverall productivity by helping project managers to determine the extent of\ncontamination and thus ensuring that deminers are only deployed in areas that\nactually contain mines and UXO. The use of suitable machines in an\nappropriate manner can reduce the overall cost of some projects as it can\nspeed up the mine clearance process and make ground accessible to dogs and\ndeminers. See notes on the use of dogs and machines in the section on mine\nclearance.\n39 Further detail on principles of humanitarian mine action was set out by Handicap International, Mines\nAdvisory Group and Norwegian People's Aid on 22 Nov 1997. A precis is included at Annex B. Further\nbackground may be gained from the ICRC Code of Conduct for Disaster Relief and the Bad Honnef\nDeclaration 1997 (coordinated by Medico International).\n40 International mine action standards (IMAS) published in 2001 include a wider definition of mine action\nthat includes mine victim assistance and anti-landmine advocacy. However, these notes use the earlier,\nnarrower definition as it more closely encapsulates the activities directly related to mine clearance.\nPrepared by Robert Keeley\nPage 15\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nMine Risk Education\nMine risk education (MRE) can assist in reducing casualties by providing\npractical advice about safe behaviour. It can be optimised for any target group.\nExplosive Ordnance Disposal (EOD)\nSmall mobile EOD teams can be deployed quickly to deal with reports of one or\ntwo items of ordnance as they are reported. These teams normally have more\ntechnical skills than normal deminers and can deal with a variety of more\ncomplex items of ordnance, including, for example, unexploded aircraft bombs.\nGeneral Survey\nA General Survey is a deductive process intended to provide an approximate\nguide to the extent of contamination by mines and UXO. When socio-economic\nfactors are included, the 'impact' of the contamination can be assessed. The\ncore to most general surveys is a community-based data gathering process\nintended to gain basic information about location and impact. This community\ndata-gathering process can be augmented by other data such as hospital\nrecords of casualties and historical information about the conduct of the conflict.\nWhen this information is processed using a geographic information system\n(GIS) it is possible to print the locations of reported contamination and victim\nincidents on a local map. This can then be compared with information about\npopulation densities and development needs and priorities for clearance\nestablished. The GIS system also acts as the basis for an historical archive that\nallows future development to find out what type of clearance has already been\ndone in a particular area.\nOther related activities\nIn common with any similar activity, mine action programmes also need\nmanagement, training, logistics and administrative support and a quality system\nin order to make sure that they are effectively supported and directed. These\nelements are effectively 'overheads' on the 'productive' elements of the mine\naction program.\nMine action implementing organisations\nDemining NGOs\nWork to redress the humanitarian impact of mine contamination started in 1988,\nwith a project in Afghanistan carried out by the 'HALO Trust', a British non\ngovernment organisation (NGO). There are now a number of NGOs active in\nmine action with many more active in mine victim assistance and anti-landmine\nadvocacy activities41.\n41 A summary of the anti-landmine campaign is included at Annex C.\nPrepared by Robert Keeley\nPage 16\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nGeneral Survey\nCapacity\nMine Risk\nEducation\nExplosive\nOrdnance\nDisposal\nTechnical Survey/\nArea Reduction\nMine Clearance\nSocio\neconomic\ndata\nMine\nInformation\nCasualty\nInformation\nPrioritization\n(Internal)\nTasking\nRecording\nGIS System\nAdministration\nand Logistics\nTraining\nManagement and\nQuality Assurance\nInput by\nTasking\nAuthority\nHandover\nInternal\nResource\nAllocation\ntime\nQuality\nControl\nSampling\nMine Risk\nEducation\nQuality\nAssurance\nRecording\nKey\nOutside Input\nElement\nActivity\nFigure 22. The inter-relationship of mine action components in a mine action program (John Dingley and Robert Keeley, 1998)\nPrepared by Robert Keeley\nPage 17\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nCommercial Demining organisations\nAlthough a number of area clearance projects have been carried out under\ncontract for many years, contract demining started in Kuwait in 1991 after the\nfirst Gulf War. A number of companies have been active in humanitarian\ndemining ever since.\nMine Action Centres\nThe need of a body to coordinate mine action projects was recognised from the\nearliest days of mine action. Most countries with an active mine action program\nnow have a 'mine action centre' (MAC) to carry out this role. There are two main\nstructures used: the first structure, as used, for example, in Laos and (until\nrecently) Cambodia, saw demining programs integrate the coordination element\ninto a vertically-integrated structure along with the implementing elements; the\nsecond form (as used in Kosovo) sees the coordination body separated from\nthe implementing agencies.\nThe role of the United Nations\nThe United Nations is mandated to have a role in mine action by votes in the\nUN Security Council. A number of UN agencies contribute to mine action\nthrough the provision of technical assistance42 and assistance in fund-raising.\nMilitary contributions\nAnyone who watches the opening minutes of the film \"Saving Private Ryan\" will\nsee the intense pressure for armies to seek high speed demining solutions.\nBecause mines are used as obstacles to attackers, and minefields may be\ncovered by weapons fire from the defending forces, armies need to minimise\nthe time needed to get through the minefield. This has traditionally led armies to\nconcentrate on 'minefield breaching' techniques that is willing to take some\nrisks43 in breaching the minefield in order to minimise casualties from defending\nfire44 though recent problems with mine contamination in a number of\npeacekeeping missions has led to the increasing attention to more careful mine\nclearance.\nIn developing countries, armies may not have the training or the resources to\naddress the problem of widespread mine contamination, and many donors may\nnot be willing or able to provide resources to local military units. For example,\nneither the World Bank nor Asian Development Bank is allowed to deal directly\nwith local military units45. The United States is a notable exception, as the US\nhas provided resources to military-run demining programs in Thailand and\nCentral America.\n42 In many cases this technical assistance consists of provision of expatriate technical advisors - usually\nex-military engineers or bomb disposal officers.\n43 A NATO planning rate for manual mine breaching is square metre a minute - this is some thirty times\nfaster than common humanitarian mine action progress rates.\n44 See \"Churchill's Secret Weapons\" by Patrick Delaforce published by Hale, 1998\n45 Interviews with bank officials in Laos and Vietnam, 2002\nPrepared by Robert Keeley\nPage 18\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nLandmine clearance\nThere are many variations to the drills and procedures used by different\ndemining organizations in different parts of the world; the common elements of\na systematic manual demining process are set out below46.\nComposition of a demining team\nThere are also almost as many variations to the composition of a demining\nteam as there are demining organizations. The terminology is also confusing,\nwith a number of terms such as 'platoons' being borrowed from military\nvocabulary. In essence, there are 4 elements to a demining team. These are:\n A control element with a leader qualified to supervise all elements of the task\nunder his/her control and communicate with all elements of the team and\nany external parties\n The deminers, who may be sub divided into smaller sub-teams or groups on\nlarge task sites. They often work in shifts, depending on the procedures\nfollowed by the demining organization.\n A medical team capable of providing first aid to any casualties\n Site sentries who can assist in restricting ingress of local populations into\ndangerous areas, especially when demolitions are in progress47.\nDemining Team\nLeader\nSection Leader\nDemining Section\nDriver/medic x2\nDeminer\nDeminer\nDeminer\nDeminer\nDeminer\nDeminer\ndemining Section\nDemining Section\nDemining Section\nFigure 23. Typical demining team\n46 International Mine Action Standards (IMAS) provide guidance on the standards of demining\noperations, including levels of medical support and evacuation guidelines.\n47 Site sentries may be found from resting deminers or from local police or security organisations.\nPrepared by Robert Keeley\nPage 19\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nThe Demining Cycle\nThe demining process is a cycle. Working from a\nknown safe area, the deminer moves forwards\nalong a 1-metre wide lane that is marked as he\ngoes. The lanes are spaced about 20m apart to\nminimise the risk of nearby deminers being hurt\nby an explosion, and only one person works in\nthe lane at a time.\nVegetation clearance\nThe deminer begins from a base line, often\nmarked by a stick laid across the lane. The first\nstep in the process is to clear the vegetation\nahead of the deminer. He does this by using\nhand tools to cut the vegetation out to about\n20cm ahead. Because of the risk of initiating a\nmine operated by a tripwire48, he may use a\n'tripwire' feeler to first feel for any tripwires\nacross his path. This process involves pushing a\nthin metal rod or wire horizontally ahead (about\n20cm), and lifting it slowly to feel for any\nresistance from a tripwire. In thick vegetation this\nis impractical and hand tools are used to cut the\nvegetation away. The vegetation clearance\nprocess is very, very slow.\nUsing the mine detector\nOnce the area immediately to the front of the base\nline marker has been checked for trip wires and\ncleared of vegetation, the deminer will use a mine\ndetector49 to search this area. The search head is\npassed over the area, and any metal present will\ncause the detector to alarm. The detector is used\nto pinpoint the source of the alarm as much as\npossible and the site is marked.\nProdding for mines\nThe detector is then moved to the rear and the\ndeminer now begins to search the area for the\nFigure 24. The systematic\napproach to demining can be seen\nin this photograph of a deminer\npreparing to start work in\nMozambique. The wooden stick\nnext to the deminer's left foot is the\nbase line that marks the forward\nedge of the cleared area. The area\nto the front of the deminer has\nalready been cleared (as can seen\nfrom the shorter vegetation). The\ndeminer's protective equipment\nand mine detector are laid out in\nthe cleared area (photo by the\nauthor, 1997)\nFigure 25. The extent of the\nvegetation problem is seen in\nthis photograph of a minefield\nfence in Mozambique. The\nbrush has nearly completely\nobscured the mine marking\nsign in the centre of the\nphotograph (photo by the\nauthor, 1997)\n48 This part of the process may be dispensed with if the demining team are confident that there is no risk\nof tripwire-operated mines. They may be able to make this decision if they have definite intelligence that\nsuch mines were not used, or if a machine has already been used on that site to clear vegetation and\ntripwires (see below for notes on mechanical assistance).\n49 At the time of writing, the terms terms 'mine detector' and 'metal detector' are often used\ninterchangeably as metal detection is still the prime search technology. See notes on new technology\nbelow.\nPrepared by Robert Keeley\nPage 20\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nsource of the signal. It is assumed at this stage, for safety purposes, that the\nmetal content of a buried mine has generated the signal.\nIn the most common search technique, a strong thin metal probe (a \"prodder\")\nis inserted into the ground in order to feel for hard objects that may be mines.\nThe prodder is inserted at an angle of 300, every\n3cm along the baseline, perhaps to a depth of\n10cm. The angular attack is used to minimise the\nrisk of hitting the pressure plate on the top of a\nburied mine. Once a hard object is found, it is\nexcavated using a trowel.\nOnce the entire piece of ground in front of the\nbaseline marker has been checked out to a\ndistance of about 20cm, the baseline marker is\nmoved forwards to the far side of the area that\nhas just been searched. It is placed on the ground\nand marker pegs placed at the ends. The deminer\nnow moves forwards, up to the baseline marker in\nits new position, and begins the cycle again. The\ncycle takes about 15-30 minutes to complete.\nDealing with a mine once found\nOnce the object has been uncovered it is\nexamined. If it is a mine, it is marked for\ndemolition and is not further disturbed. The lane is\nclosed and the deminer moves back to the safe\narea and starts work on the next lane. If it is not a\nmine, the search continues as above.\nAt the end of the day, the team leader will usually\nblow up all of the mines that have been found that\nday. This prevents the mines being re-used or\ncurious onlookers disturbing them after the team\nFigure 26. The demining cycle in\nhave gone home for the day.\nCambodia. In the first picture,\nthe deminer searches the ground\nimmediately to the front of the\nIf no mine is found\nbaseline with his mine detector\n(this team uses a second stick to\nOnce the area around the location of the mine\nmark the forward edge of the\ndetector's alarm is checked for objects, and if\nsearch area). In the second\nnone is found, the chances are this is a piece of\nphotograph the deminer uses a\nmetal scrap rather than a mine. However, the\nprodder to investigate a detector\nsignal by probing for a possible\ndeminer may spend more time, alternating\nburied mine (the prodder is just\nbetween use of the detector, the prodder and the\nvisible under his left hand). In\ntrowel to find and remove the fragment. This is\nthe third photograph the deminer\nbecause in many projects the production of a\nhas found and excavated the\nmine using a trowel (photos by\n'metal free area' is used as a way of proving to\nthe author, 1998).\nquality control inspection teams that the area has\nbeen completely searched.\nPrepared by Robert Keeley\nPage 21\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nThe estimates of fragments found\nper mine vary greatly: one example\nof such variation is \"1000:1 in\nYugoslavia to 10:1 in Cambodia50\".\nThere may be a lot more metal\nscrap found in built up areas, and in\nthe former Yugoslavia a lot of the\nfighting (and hence the mine-\nlaying) took place in built-up areas\nsuch as Mostar, Sarajevo and\nVukovar. Indeed, in Bosnia and\nCroatia it is not uncommon for\ndeminers to give up on their metal\ndetectors entirely and revert solely\nFigure 27. Metal scrap recovered from a\nminefield in Cambodia around an old defensive\nto prodding.\nposition. Much of the contamination is waste\nmaterial discarded by the inhabitants. However,\nA second explanation for these\nnote the large number of caltrops also used! This\nhuge variations in reported\nancient weapon was resurrected in a war where\nnumbers of false alarms may be\nmost of the combatants wore simple open sandals\ndue to the way that the numbers of\n(photo by the author, 1999).\nfragments may be counted. For example, if a demining team is searching an\narea of a square kilometre for an unmarked mine field that is only a few hundred\nsquare metres, then all the area around the minefield (and indeed, between the\nmines) has to be searched. A\nsuperficial division of the amount of\nmetal found in the whole search\narea by the number of mines\neventually found may produce a\nlarge ratio of fragmentation to\nmines, even in an undeveloped\nagricultural area51.\nFigure 28. Deminers working in built up areas,\nsuch as this area outside Mostar in Bosnia, may\nsometimes abandon their metal detectors because\nof the large number of false alarms caused by\nmetal scrap and fragments in the area (photo by\nthe author, 2001).\n50. Discussions with Andrew Heafitz, MIT, 2003\n51 The average density of fragment per square metre in agricultural areas (which is a more useful figure)\nmay actually be much lower, perhaps 2-3 pieces per m2\nPrepared by Robert Keeley\nPage 22\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nDemining and Explosive Ordnance Disposal\n(EOD)\nMost minefields are found in places where\nconflict has taken place and, as a result,\ndeminers will encounter a variety of items of\nunexploded ordnance (UXO). Demining teams\ntherefore need to have access to some level of\nEOD support. This is provided in a number of\nways, either by providing the senior deminers\nwith EOD training or by having specialist EOD\nteams available on call to assist.\nFigure 30. A team clearing an\narea contaminated by submunitions\nin Laos (photo by the author, 2002)\nFigure 29. An EOD team works on\nan unexploded aircraft bomb in\nCambodia (photo by the author\n1998).\nIn some areas, such as in Kuwait, Laos or in Kosovo, most of the area\nclearance is actually conducted in areas contaminated by unexploded\nsubmunitions or 'bomblets' rather than true landmines. In such areas the\nprocedures are, in effect, an amalgam of EOD and conventional demining\nprocedures. EOD teams will also generally conduct mobile operations clearing\nUXO reported by members of the public, local authorities or non-government\norganizations (NGO).\nFigure 31. EOD teams may be used to respond to more\ncomplicated tasks than conventional mine clearance. For\nexample, clearing abandoned armoured vehicles (above) or\nabandoned ammunition stockpiles (right). Note that the EOD\nteam has marked this vehicle to show it has been cleared.\nPrepared by Robert Keeley\nPage 23\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nThe Application of Technology\nThe clearance of mines by manual means (i.e. a man using a mine detector and\na probe to find mines) is slow. If the deminer is not highly trained and stringently\nsupervised, there is also considerable risk52 involved. This has led to a\nwidespread interest in the application of new technology. Although this has\nprovided some assistance it is, in general, only valuable when used to support\nmanual demining techniques, which remain to this day the only means by which\nthe desired standard of clearance can be achieved. Some notes about the use\nof new technology are included here as an introduction to the issue.\nAdvanced mine detection devices\nThe conventional method of detecting mines involves the use of a metal\ndetector to find mines. However, with the widespread use of plastic-cased,\nminimum metal content mines, the use of metal detectors is less effective in\nsome areas. This has resulted in a drive to develop and introduce new means\nof finding mines. There have been many technologies tried (ever since the use\nof plastic mines in the Falklands conflict in 1982), including ground penetrating\nradar, magnetic resonance imaging and infrared detection, and many are\nrevealed to the world every year. However, they are always described as being\n\"close to completion\" and, at the time of writing this, no advanced mine\ndetection system has been developed that is capable of operating in the field\nand achieving the necessary levels of confidence53.\nMine detecting dogs\nAll dogs can smell explosives, and it is\npossible to train dogs to react in a\nparticular way when they smell the\nexplosives contained in mines. However\ndogs have a limited attention span, the\ntraining is complicated and there are a\nvariety of environmental factors that mean\nthat dogs are not always 100% effective at\nfinding individual mines. Even when they\nreact, there is an area of several square\nmetres that must be searched by a\ndeminer who must then take care of the\nmine or item of unexploded ordnance that\nthe dog has detected. Properly trained dogs can make a valuable contribution\nto determining the edges of contaminated areas.\n52 However, with the correct use of the right techniques, good supervision and effective protective equipment, the risk\ncan be minimised (discussions with Tim Lardner of Cranfield Mine Action, April 2003).\n53 The most promising new technology appears to be a combination of metal detection and ground\npenetrating radar (GPR), where the GPR is used to check the area around the source of the metal signal to\nsee if it is different to the surrounding soil. However, at the time of writing, such devices are still only in\nthe prototype stage and it is by no means clear if they will actually work.\nFigure 32. Dogs being used in Somalia.\nNote the protective equipment used by the\nhandler (photo by European Landmine\nSolutions)\nPrepared by Robert Keeley\nPage 24\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nDemining machines\nThe Allied forces developed a series of\ndemining machines in the Second World\nWar to assist them in breaching paths\nthrough enemy minefields. However,\nthese machines were often ineffective\nand sometimes many of them would be\ndestroyed just to make a single lane of a\nfew hundred metres in length54. The\nresulting lanes were also not 100% free\nfrom mines.\nIn the last twenty years, a wide number\nof demining machines have been\nproduced, and a summary of the most\ncommon types is included below. Some machines can be very expensive, can\nbe limited by the terrain and in some cases can be less cost-effective than\nmanual deminers55.\nFigure 34. Machines may\nbe less effective over\nirregular ground than\nover flat surfaces: mines\nlaid in the bottom of holes\n(1), behind rocks or other\nobstacles, or close to\nfences, walls or other\nboundary markers (3) may\nbe missed by machines.\nOperators of remote\ncotnrolled machines may\nalso have trouble seeing\nwhen small areas of land\nhave been missed.\nEven in terrain that is suitable to demining machines, small obstacles (such as\nin Fig 34 above) can reduce their\neffectiveness. The situation may be\nexacerbated by the presence of 'blast\nresistant' mines, such as the Italian VS-50\nmine and the PMN2 developed by the\nformer Soviet Union56. These were\noriginally designed to resist explosive over\npressure but have been found to also be\nresistant to sudden impacts such as those\ngenerated by flail machines.\n54 See \"Churchill's Secret Weapons\" by Patrick Delaforce published by Hale, 1998\n55 Discussions in May-Sep 2003 with David Lewis of Qinetic, the British defence research agency\nresponsible for collaborating with the International Test and Evaluation Program (ITEP) to develop an\ninternationally-agreed standard for mechanical demining equipment testing.\n56 See \"Jane's Mines and Mine Clearance\" for more technical detail on mine types and design.\nFigure 33. The TEMPEST vegetation-cutting\nmachine working in Cambodia. The\nTEMPEST was designed and built by\nDevelopment Technology Workshop (DTW)\n(photograph by DTW).\nFigure 35. The PMN2 AP blast mine\n(photo by the author, 1998)\nPrepared by Robert Keeley\nPage 25\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nMine Rollers\nMine rollers are heavy wheels pushed along a route by an armoured vehicle.\nRollers actuate mines on or just under the surface and can be designed to cope\nwith some undulation but may not be able to deal with deep buried mines or\nirregularities in the surface produced by rocks, ditches or hedges. The vehicles\ncarrying the rollers may be difficult to operate in soft ground or in areas where\nmanoeuvrability may be restricted by trees or walls.\nMine Flails\nMine flails actuate, disrupt or destroy\nmines by punching them with weighted\nchains hung from a revolving drum\nheld in front of an armoured vehicle.\nFlails are less effective in soft soils,\nand against sustained-pressure or\ndeep buried mines, and can throw\nintact mines out into a previously\ncleared area. Flails are also vulnerable\nto entanglement in wire obstacles and\nFigure 36. A flail machine being used in Kuwait.\nNote the chains rotating around the central\nfences. Note that there is also a\ndrum and the use of a protective shield between\nvariation in size with many small flail\nthe flail and the rest of the vehicle (photo by the\nmachines operated by remote control.\nauthor, 1991).\nTillers\nA 'Tiller' (sometimes called a 'soil mill') is\na generic term for a recent series of\nmechanical mine clearance devices that\nall use a similar concept. At a first glance\ntillers can look like mine rollers but\noperate completely differently: they use\nan active, powered rotating drum that is\nfitted with a series of spaced teeth. The\nteeth eat into the soil ahead of the\nvehicle and detonate or destroy the\nFigure 37. Diagrammatic representation of a\nmine. Tillers share many of the\ntiller ready to be mounted on the front of a\nvehicle. The arrow shows direction of travel.\nadvantages of flails and, additionally, do\nSome of the mechanism (1) is very close to\nnot scatter mines as flails can. However,\nthe potential site o f a detonation\ntillers are susceptible to directional AT\nmines and the immense power needed to drive the drum can make the vehicle\nvery heavy and susceptible to mechanical failures.\nTillers can deal with most vegetation (they were originally designed to 'mulch'\nold forestry areas containing tree stumps) and can cope with small undulations\n(such as furrows in ploughed fields) but are susceptible to problems when\nencountering very rocky or uneven ground). Furthermore, if the teeth are not\n'sacrificial' their replacement can be very difficult.\nPrepared by Robert Keeley\nPage 26\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nMine Ploughs\nMine ploughs are not intended to clear\nmines; they merely move them out of the\nway of the tracks of the vehicle to which\nthey are attached. They are more suited to\nuse in military mine breaching operations\nthan in humanitarian mine clearance as the\nmines end up at the side of the ploughed\nroute in heaped soil berms which can be\nmore difficult to clear than the original,\nFigure 38. This machine is mounted on a\ntank body and uses a roller and plough in\nunploughed field.\ncombination. It suffers from many of the\ndisadvantages of both tools (photo by the\nArmoured Plant - Excavators\nauthor, 1996).\nArmoured plant can be very useful,\nparticularly for the clearance of building\nrubble thought either to contain UXO, or\nthat might have collapsed onto a mined\narea. They have limited uses elsewhere\nin demining operations unless tools such\nas flails or tillers can be mounted on\nthem.\nFigure 39. This piece of armoured plant is\nbeing used to build fortifications for a UN\npeacekeeping unit in Bosnia. However, the\nmain of such equipment in a humanitarian\ndemining context is rubble removal in built\nup areas (photo by the author, 1994).\nAn integrated approach to mine clearance\nThe most appropriate application of mine detecting dogs and demining\nmachines is most commonly recognised as part of an integrated approach57\nwhere they are used to support - but not replace - manual deminers. Machines\ncan be good at removing the vegetation that hampers deminers, and dogs can\nbe effective at determining the boundaries of contaminated areas where\nminefields are not marked.\n57 Discussions with Henry Hirst, Chief of Operations of European Landmine Solutions, Oct 2002.\nPrepared by Robert Keeley\nPage 27\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nPersonal Protective Equipment (PPE)\nDemining agencies have a duty of care to protect their deminers, and\ninternational humanitarian demining standards have been very careful in\nattempts to set out targets for protection. The aim of demining PPE is to ensure\nno deminer will be hurt by an anti-personnel mine that he initiates whilst\nfollowing correct mine clearance procedures. PPE must be comfortable and\nmust be designed to be ergonomically compatible with the activities carried out\nby the wearer (see notes on the demining cycle above).\nEye Protection\nAccording to IMAS, eye\nprotection should be\nprovided by a\npolycarbonate visor (the\nnorm is about 5mm).\nBody protection\nBody protection (when\nprovided) is generally\nprovided by a Kevlar-type\njacket or apron. The eye\nprotection will stop fragment\nand soil particles being\ndriven into the eyes and\nface by an antipersonnel mine being detonated by the deminer. The body\nprotection will protect the vital organs from the same threat and also protect the\ndeminer from a nearby detonation of a fragmentation mine, perhaps by another\ndeminer.\nHand tools\nIt is now also widely recognised that the deminer's hand tools should be\nrecognised as a form of PPE. Long handled tools (i.e. with a handle of around\n30cm) help keep the deminer's hand away from blast if he58 accidentally\ndetonates a mine. The tools should also be made of a metal that deforms rather\nthan shatters in the event of an explosion.\nFull details of the requirements for personal protection are included in IMAS.\n58 The use of the word 'he' is for convenience as there is no technical reason why a deminer should not be\nfemale; indeed many organisations have employed female deminers to great success.\nFigure 40. One type of PPE ensemble provided for use in\nCambodia. The simple apron provides ground-to-neck\nprotection to a kneeling or squatting deminer, with a\nsimple polycarbonate visor to provide eye and face\nprotection. Note the overlap between apron and visor, and\nthe wimgs to facilitate arm movement.\nPrepared by Robert Keeley\nPage 28\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex A\nAnnex A: Generic landmine design\nA brief explanation of the construction of typical landmines is included here.\nThis may aid the reader's understanding of mine detection and clearance\ntechniques and technologies59.\nAP blast mines\nThe diagram at Fig A-1\nshows the construction of a\ntypical AP blast mine. The\nmine is not armed until the\ndetonator is inserted and\nthe safety pin removed. At\nthis point the mine can be\nactivated with a pressure\nto the pressure plate at the\ntop of a mine. In many\ncases a pressure of just a\nfew kilograms is sufficient.\nThe downward force drives\nthe striker pin onto a\npercussion cap, which\nignites, firing the detonator,\nwhich then initiates the explosive fill. It is not always possible to replace the\nfiring pin or safely remove the detonator once mines have been armed. In some\ncases the metal firing pin is the only metal content of such mines.\nNotes on 'plastic' mines\nPlastic-cased mines were cheaper to produce than metal cased mines; they\nhave longer shelf lives and are lighter, and are hence easier to store and to\ntransport. They are also easier to deploy (light plastic designs aid dissemination\nby helicopter as well as by hand). However, buried plastic-cased mines also\nhave the unfortunate (dis)advantage of being harder to find by metal detector,\nwhich would further slow down the progress of advancing armies through\nminefields60. However, nearly all plastic-cased mines have some metal in them\n(they are thus sometimes referred to as \"minimum metal\" mines) and can be\nfound by sensitive metal detectors. This does mean that, however, when such\nmines are deployed in areas that have metal scrap (or even metallic soils) there\nare many false alarms - indeed, increasing sensitivity of detectors increases the\nnumber of false alarms.\nFigure A-1. Typical AP blast mine construction\n59 More comprehensive detail on mine construction can be found in \"Warsaw Pact Mines\" by Paul\nJefferson, 1992, and \"Janes Mines And Mine Clearance 1996-2002\" Edited by Colin King\n60 The proof that this attribute was recognised by manufacturers can be seen by the addition of removable\nmetal elements that could be taken off the plastic case on deployment. One example of such a mine was\nthe C3 'Elsie' mine produced in Canada.\nPrepared by Robert Keeley\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex A\nAP fragmentation mines\nThe diagram at Fig A-2 shows\nthe construction of a typical AP\nfragmentation mine. It has\nsimilar components to an AP\nblast mine though in this case\nthe mine is triggered by a trip\nwire that is attached to one of\nthe pins in the ignitor mechanism\nscrewed into the top of the mine.\nThe mine is armed when the\nsecond pin is removed. The\nmine casing is generally made of\nmetal, though some examples of\nimprovised mines using concrete\nfragmentation casing were used\nin the former Yugoslavia. Again,\nit is not always possible to replace the firing pin and safely remove the igniter.\nComplex mine designs\nMost mines found in mine affected countries have simple designs such as\ndescribed above. However, there are a significant proportion of mines that\ninclude more complex designs, though comparatively few of these more\ncomplex models have been deployed in mine\naffected countries in large numbers61\nThe mine in figure A-3 includes an anti-handling\ndevice that operates when the mine is tilted a few\ndegrees from the horizontal. Once the safety pins\nare removed, this mine is indistinguishable from a\nsimilar model that contains no anti-handling device\nFigure A-2. Typical AP fragmentation mine\nconstruction\nFigure A-3. This Chinese AP mine\nincludes an electronic anti-\nhandling device (photo by the\nauthor, Cambodia 1998)\n61 See Janes Mines And Mine Clearance for a comprehensive list of mine types and summaries of where\nthese different types have been deployed.\nPrepared by Robert Keeley\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex B\nAnnex B: Statement of principles for humanitarian mine action62\nHumanitarian Mine Action programmes should address the following:\n The need for objective analysis of the requirements of affected communities,\nand the structuring and conduct of operations to meet these requirements;\n The need to take account of cultural sensitivities;\n A responsible approach to the welfare of personnel employed by these\nagencies involved in mine action;\n A commitment to the continued development of existing methodologies;\n A realistic and objective approach to mine clearance technologies and\nmethodologies;\n The need to avoid impractical, \"quick-fix solutions\"\n A commitment to continual improvement of quality; and\n The need to support the principle of transfer of competence to the affected\ncommunities.\n62 The following principles were developed by Handicap International, Mines Advisory Group and\nNorwegian People's Aid in Brussels, November 1997\nPrepared by Robert Keeley\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex C\nAnnex C: Anti-landmine campaigns and the 1997 Ottawa Treaty63\nBackground\nAid workers and other observers of a number of civil wars (or 'wars of national\nliberation') in the late 1980s and early 1990s, were appalled by the sight of mine\ncasualties, and a number of Non-Government Organisations (NGO)64\ncooperated to form a campaign against landmines. The International Campaign\nto Ban Landmines (ICBL) as it become known, worked for several years to\nadvocate a ban of these weapons65, on the grounds that they were 'excessively\ninjurious' and 'indiscriminate,'66 both of which had been used in previous articles\nof international law to regulate use of weapons in conflicts. A weapon that is\n'excessively injurious' creates more suffering than is needed to place a\ncombatant 'out of combat' whilst indiscriminate weapons cannot be targeted\nspecifically at combatants. The ICBL - and particularly, the ICRC - made a case\nthat landmines were covered by both of these criteria, particularly as landmines\ncould remain active decades after wars had ceased.\nUntil 1996 landmines had been regulated by the UN 'Convention on\nConventional Weapons (CCW)67 and the ICBL was excluded from meetings to\nreview and amend CCW in Geneva in 1996. They were however, very active in\nthe margins, and immediately after CCW 1996 concluded (with a number of\ncomparatively narrow, technical revisions that fell far short of the ban demanded\nby ICBL) the then Foreign Minister of Canada, Lloyd Axworthy, called on\nlikeminded nations to join Canada in a 'fast track' approach to achieve an\nabsolute ban by December of 1997. Canada was soon joined by a number of\nother countries, such as Belgium, that took up the aims of the ICBL as national\npolicy68.\nHowever, although many members of the ICBL wished it to be an absolute ban\ncovering all landmines and 'mine like' weapons69 such as cluster bombs, some\nserious horse-trading had to be undertaken to get the proposed treaty accepted.\nAnti-tank mines were largely excluded, as were anti-handling devices that are\nincorporated into some AT mines to prevent dismantling by attacking soldiers,\nbecause many of the countries that were prepared to forgo use of AP mines still\nwanted to keep AT mines for their own defence. Claymore type weapons that\nrequired a 'man in the loop' were also not covered by this ban, as the process of\n63 This section was reviewed by Robin Collins of Mines Action Canada, an organisation that has had a\nkey part in the Ottawa process,\n64 The six founders were: Handicap International (France and Belgium), Human Rights Watch (USA),\nMedico International (Germany), Mines Advisory Group (UK), Physicians For human rights (USA) and\nVietnam Veterans of America Foundation (USA) (Source: Mines Action Canada 2003)\n65 The campaign was assisted greatly by the International Committee of the Red Cross, which, although it\nnever formally joined the ICBL, worked in parallel, and was mainly responsible for work on the legal\narguments, which are summarised above.\n66 Numerous ICRC publications 1996-1997. One key example is \"Friend or Foe\" 1996\n67 Specifically, Protocol II of the United Nations 1980 Convention on Conventional Weapons\n68 Some countries included a mine ban as part of national policy as early as 1996, including Austria,\nBelgium Canada, Denmark, Ireland, Mexico, Norway and Switzerland.\n69 UXO that have similar effects as anti-personnel mines, but were not intended to do so\nPrepared by Robert Keeley\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex C\nadding a trip wire and fuse to a claymore mine could also be done to just about\nany other type of weapon, and there was no international support for a treaty\nthat would thus make all weapons illegal.\nThere was a sustained attempt by some countries, particularly the Americans,\nto allow AP mines that had a 'limited laid life' through the use of self-destruct or\nself-neutralising mechanisms. The Americans argued that such mines were less\nindiscriminate as they would not remain active for long. However, such\narguments were unsuccessful as they were felt to generate too many loopholes,\nnot least in the difficulty in developing suitable definitions for what constituted a\n'smart' enough mine. The 1997 Ottawa Treaty was the result of this initiative.\nThe Ottawa Treaty and its Requirements70\nTo date, 146 countries have signed and 131 countries have ratified the Ottawa\nTreaty71.\nThe Ottawa Treaty requires states party to:\n Cease the production, stockpiling, trade and use of AP landmines\n Mark all minefields on their territories within 4 years, and\n Clear all minefields within 10 years of accession to the Treaty.\nIt also allows countries to maintain a small stock of AP mines for the purpose of\ndeveloping and training in new technologies and techniques for mine clearance.\nAchievements and limitations of the Ottawa Process\nThe Ottawa process did:\n Develop a workable definition of what constituted an anti-personnel mine\n Create a normative framework that has stigmatised the use of landmines\nand limited their deployment even by non-signatories\n Involve 'civil society' in a major piece of international legislation, notably in\nthe recognition of campaigning efforts of national groups in persuading their\ngovernments to accede to the Treaty\n Establish a process that should reduce the number of new mines in\ncirculation and thus available for deployment\n70 The full text of the treaty can be found at http://www.icbl.org/\n71 As of 8 July 2003. Source: http://www.minesactioncanada.org/home/index.cfm?lang=e\nPrepared by Robert Keeley\n\nUnderstanding Landmines and Mine Action\nSeptember 2003\nAnnex C\n?? Establish an independent research body (the \"Landmine Monitor\") to\nobserve and report on compliance\nThe Ottawa process did not:\n Cover all landmines, as anti-tank mines were not included in the ban\n Get support from many of the major mine-producing countries, such as\nChina, India, Israel, Pakistan, Russia and the USA72\n Cover 'mine-like' weapons\n Directly effect the number of mines already in the ground73\nThe future\nOne major product of the campaign process is the creation of an international\nmonitoring process, which provides a source of information, the \"Landmine\nMonitor74\"about mine problems in affected countries and on compliance with\nOttawa Treaty requirements.\nThere continues to be efforts to address some of the areas that were not\ncovered by the Ottawa Treaty. In particular, work is under way to develop a\ntreaty to cover the long-term effects of 'mine-like' weapons and other\nunexploded ordnance, referred to in this new campaign as 'explosive remnants\nof war (ERW)'75.\n72 Although some of these countries have introduced bilateral moratoria on the export of mines.\n73 Although the Treaty did, as stated above, establish a normative requirement for states party to deal with\nmines, it was widely recognised at the time that the ability of affected countries to do so would be\ndependent on the availability of funds. According to Mines Action Canada, It could be argued that the\npolitical pressure inherent in becoming a signatory has encouraged donor nations to maintain funding\nlevels for mine action programs\n74 See http://www.icbl.org/lm/\n75 See the notes on the ICRC website:\nhttp://www.icrc.org/Web/Eng/siteeng0.nsf/htmlall/57JRGS?OpenDocument\nPrepared by Robert Keeley\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\nEC.S06 Design for Demining\nSpring 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}