{
  "course_name": "Designing Paths to Peace",
  "course_description": "Teaches creative design based on the scientific method through the design, engineering, and manufacture of a detailed inlaid tile. This is an introductory lecture/studio course designed to teach students the basic principles of design and expose them to the design process. Throughout the course, students will be introduced to the terminology and concepts that underlie all forms of visual art; which–in many ways–forms the basis for the design of all physical objects. Along with learning mechanical skills, thinking both critically and visually, and working with different media, the students will consider how the arts grow out of and respond to particular cultural contexts and ideas; and how these thinking patterns can be applied to virtually all types of design.\nPresentations, lectures, demonstrations, discussions and various artistic works will be used to show students how other artists and designers have dealt with the same issues they will be facing in lab.  Each class will begin with a critique of the students’ homework, followed by a discussion (and presentation when appropriate) of the pertinent issues of that week. All aspects of the course will aid the teams of students in designing and building a major inlaid tile whose elements are designed as digital solid models and manufactured on an abrasive waterjet machining center. The course will conclude with an exhibit of the completed tiles open to the MIT and the Greater-Boston public. Enrollment is limited to 16 students who will be divided into groups of 4 students each. Preference will be given to students who attend the first day of class in a pre-selected team of 4.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design",
    "Fine Arts",
    "Visual Arts",
    "Graphic Design",
    "Engineering",
    "Mechanical Engineering",
    "Mechanical Design",
    "Systems Engineering",
    "Systems Design",
    "Fine Arts",
    "Visual Arts",
    "Graphic Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nLabs: 1 session / week, 2 hours / session\n\nCourse Objective\n\nThe objective of the course is to enable students through lecture and hands-on experience designing an inlaid tile to:\n\nLearn Peer Review Engineering Process (PREP), based on the scientific method, to turn ideas into robust reality:\n\nIdentification, selection, and development of ideas.\n\nGeneration & creation of design strategies, concepts, and modules.\n\nCompleting, documenting, and exhibiting an original design.\n\nLearn to think both critically and visually, and to work with different media.\n\nLearn solid modeling and other drawing tools, and learn to go from a computer model to a machined component using an abrasive waterjet machining center.\n\nLearn how to assess risk, resort to countermeasures when risk becomes too great, and manage projects to be \"on-time\" and \"on-budget\".\n\nPractice professionalism, be safety conscious, and maintain high ethical standards.\n\nCourse Project\n\nThe focus of this course is to learn the Peer Review Evaluation Process by creating inlaid tiles that are of deep significant meaning to the team members that create them. The homework projects will help teams of three students to design and build their tile projects whose elements are manufactured by students on an abrasive waterjet machining center from digital solid models of the tiles that the teams create. At the end of the course, the tiles will be exhibited in the student art gallery. To help students learn the tools they will use for their team project, each student will make a small project: a solid model and manufacture of an inlay created in a standard 12\" marble tile that will itself be inlaid into a wooden frame the students also make.\n\nSoftware Tools\n\nWe will introduce the students to a number of different solid modeling and design tools. In addition to commercial professional design tools such as SolidWorks\n(r)\nand CorelDRAW\n(r)\n, the students will be introduced to a new design environment where the objects in the design can be parameterized algorithmically. The students will be asked to provide critical feedback on the merits of our tool as compared to other tools that they will use in the course and will be invited to offer enhanced/improved design specifications for our tool based on their design experiences with all the different tools.\n\nIn addition, on-line Peer Review Evaluation Process (PREP) tools will be made available so students can evaluate each other's ideas from the comfort of any internet accessible location.",
  "files": [
    {
      "category": "Resource",
      "title": "Pathways To Peace",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-993-designing-paths-to-peace-fall-2002/aa22df160964b988bb4dea57322ea6e0_pathways_course_outline.pdf",
      "content": "Pathways To Peace: Teach People to Design & they\nwill Solve More of Their Own problems\n-\nDesign is a word that has many meanings, but in essence, everything we do, from\ndeciding which clothes to wear and what to eat, is a design project\n- Seemingly simple actions can often have complex consequences\n- The design was not well thought out!\n-\nHypothesis: There is a process by which design can be taught, and it can be applied in\neveryday life from personal to professional design problems\n- The design process is essentially the scientific method with the addition of risk analysis:\n- Observe a problem and study its \"physics\" and boundary conditions\n- Develop a hypothesis about how to solve it\n- Analyze the possible solutions, and run preliminary Bench Level Experiments\n- Study references and iterate on the solutions\n- Assess the risks\n- Develop countermeasures\n- Implement, test, ponder!\n-\nWhen people feel they have a path to develop solutions to their problems, they are\nmore likely to be at peace with themselves and others\n- We propose to develop a course, using the design process itself, to teach the design\nprocess!\nDRAFT\n\nPathways To Peace: Teach the Design Process in the\nContext of Personal Expression\n-\nRational scientific thought processes are learned by many, but practiced by\nfew in the context of their everyday lives\n- \"Enthusiasm is one of the most powerful engines of success. When you do a\nthing, do it with all your might. Put your whole soul into it. Stamp it with your\nown personality. Be active, be energetic, be enthusiastic and faithful and you will\naccomplish your object. Nothing great was ever achieved without enthusiasm\"\nRalph Waldo Emerson\n-\nWe propose to teach the design process in the context of having students\ndesign an inlaid or mosaic tile that illustrates something of deep personal or\ncultural meaning to them\n-\nAn artist in residence will be a key team-member\n-\nThe designs will be posted on the internet, and we hope this course will spread\nto schools around the world\nDRAFT\n\nPathways To Peace: Teach the Design Process in the\nContext of Technical Design & Manufacturing\n-\nWe propose to teach the design process in the context of having students\ndesign an inlaid or mosaic tile that is precise and can withstand the rigors of\ntime\n-\nAn Artists-in-Residence will help teach the students about artistic expression\nand how to critique and evolve their designs\n-\nThe physical design and manufacturing and installation, either has a hanging\npiece of art, a table-top, or as a sidewalk tile, will be a highly technical project\n- Topics will include CAD, CNC abrasive waterjet cutting, materials, structures on\nelastic foundations, tolerancing and error budgets...\n- The designs and their manufacturing plans will be posted on the internet, and\nas this course spreads around the world, the first part of the course will evolve\nto be a period were students make tiles that other students have designed, so\nthat tiles from around the world can be created and installed to build new\nPathways To Peace\nDRAFT\n\nPathways To Peace: Course Schedule\nPrepare for the display\nDocument the solution\nTeams develop solutions to\nthe problem\nDocument the solution\nTeams develop solutions to\nthe problem\nEvolve design as needed\nFinalize design, create CAM\nfiles for manufacturing\nSelect materials and size\nelements\nCreate Pathways To Peace\ntile design\nCAD exercises, think of next\ndesign\nTeam evaluation and\nevolution of the designs\nCreate simple design\nHomework\nDisplay\nClosure\nFinal assembly\nComplete the solution\nBegin final assembly\nApply the design process to a\nworld problem\nManufacture the parts\nComplete the solution\nManufacture the parts\nApply the design process to a\nworld problem\nManufacture the parts\nDebugging techniques\nMake most critical (challenging)\nelement\nAdvanced manufacturing\ntechniques\nWooden model of the design,\ndisplay and group critiquing\nStructural analysis\nDisplay, evaluate and learn from\nfirst design\nCritiquing and evolving a design\nComplete first design\nCAD: Technical and artistic\nMake simple designs\nArtforms: Inlays, mosaics, stencils\nLearn to use Waterjet and shop tools\nThe Design Process\nLaboratory Activity\nClassroom Topic\nWeek\nDRAFT\n\nPathways To Peace: On-Line Journal\n-\nThe tiles that are developed and their manufacturing plans will be posted on-\nline\n- Students will also be encouraged to create food, music, plays, costumes...to create\na celebration around their tile\n- When other students make the tile, they can celebrate its creation with a party\nin the local flavor in which the tile was created!\n-\nThe world problems that are identified and \"solved\" using the design process\nwill be documented and posted for discussion\n- Maybe world leaders might even find use for some of the suggestions!\nDRAFT\n\nDesign Process: Essential Elements\nIdeas or plan to\nmitigate each\nrisk, including\nuse of off-the-\nshelf known\nsolutions\nHigh,\nMedium, Low\n(explain why)\nrisk of\ndevelopment\nassessment for\neach DP\nAnything that\ncan help\ndevelop the idea\nincluding\npersonal\ncontacts,\narticles, patents,\nweb sites....\nEconomic (financial\nor maximizing score\netc), time & motion,\npower, stress...\nEACH DP's\nFEASABILITY\nMUST BE\nPROVEN.\nAnalysis can be\nused to create DPs!\nIdeally\nindependent\nmeans to\naccomplish each\nFR. AN FR CAN\nHAVE\nSEVERAL\nPOTENTIAL\nDPs. The \"best\none\" ultimately\nmust be selected\nA list of\nindependent\nfunctions that\nthe design is to\naccomplish.\nSeries (1,2,3...)\nand Parallel (4a,\n4b..) FRs\n(Events) can be\nlisted to create\nthe Function\nStructure\nCounter-\nmeasures\nWords,\nDrawings,\nAnalysis...\nRisk\nWords,\nDrawings,\nAnalysis...\nReferences\nHistorical\ndocuments,\nwww...\nAnalysis\nExperiments,\nWords, FEA,\nEquations,\nSpreadsheets...\nDesign\nParameters\n(Idea)\nWords &\nDrawings\nFunctional\nRequirements\n(Events)\nWords\n- To actually use the FRDPARRC Table:\n- Create one actual table that becomes your development roadmap\n- Dedicate one sheet to each FR/DP pair\nDRAFT\n\nDesign Process: Tradeoffs\n-\nEverything performs (in some way) and has a cost (of some sort)\n- If you spend all your time on a single tree, you will have no time for the forest\n- If you do not pay attention to the trees, soon you will have no forest!\n- You have to pay attention to the overall system and to the details\n-\nSuccessful projects keep a close watch on budgets (time, money, performance...)\n- Do not spend a lot of effort (money) to get a small increase in performance\n- \"Bleeding edge\" designs can drain you!\n- Do not be shy about taking all the performance you can get for the same cost!\n-\nStay nimble (modular!) and be ready to switch streams\n- It is at the intersection of the streams that things often get exciting!\nDRAFT\n\nDRAFT\nDesign Process: Idea Development StrategiesConceptsModulesComponents\n-\nDeterministic Design leaves\nLOTS of room for the wild\nfree creative spirit, and LOTS\nof room for experimentation\nand play\n-\nDeterministic Design is a\ncatalyst to funnel creativity\ninto a successful design\n-\nIt is OK to iterate...\n-\nA goal is to never have to\nbacktrack\n-\nA good designer,\nhowever, knows when\nits time to let go...\n\nEvolving Systems: Individual Thought\n-\nIndividual thought is often the most creative\n- Do leisurely things (e.g., long walks) that you know inspire creative thought.\n- Look at what other people have created\n- Look in your home, stores, www, patents\n- Get out of traffic and take alternate routes\n- Sketch ideas and the ideas' principal components\n- Cut out the principal components and pretend they are modular elements\n- Like toy building blocks, try different combinations of components to make\ndifferent products\n- Pit one idea against another and imagine strategies for winning\n- Take the best from different ideas and evolve them into the best 2 or 3 ideas\n-\nUpdate the FRDPARRC table and create a Milestone Report or Press Release\nfor your favorite ideas\n- The FRDPARCC Table (ONE DP per FR) and a large annotated sketch makes an\neffective infomercial\nA random person should be able to read your press release and fully\nunderstand your idea without your having to explain it to them\nThese sheets will be shared with your teammates in the next stage...\n-\n-\n\nEvolving Systems: Rohrbach's 635 Method\n-\nSix (N) people circulate their Milestone Reports or Press Releases to the other five (N-\n1) for comments\n- A written record is thus also made of who first had the idea, so personality conflicts are more\neasily avoided\n- NO TALKING: people make written constructive comments on each other's papers, until\neveryone has read everyone else's press releases\n-\nThis creates a collective mind, so everybody knows what everyone else has been\nthinking\n- The group mind then works together in a more efficient manner when brainstorming...\n- Very useful for developing strategies, concepts, & modules\nWhy are these people\nmissing an ear?!\nDRAFT\n\nEvolving Systems:Group Brainstorming\n-\nBrainstorming helps teams solve personal creativity deadlocks and help to\nensure something hasn't been overlooked\n-\nInitially let everyone voice their suggestions, then distill ideas\n-\nGroup personality factors must be considered:\n- Shy individuals getting run over\n- Aggressive individuals always driving\n-\nAn individual's personality often has nothing to do with creativity\n- Careful to avoid conflicts over the issue of who first thought of the idea\n- The people in the group must be willing to take praise or scolding as a group\n- NO pure negatives, only observations with suggestions for improvement:\n- \"That design sucks!\"\n- \"I see a low pressure region that can be alleviated by making it blue\"\n\nEvolving Systems: Design Comparison Methods\n-\nThere are many systematic methods available for evaluating design alternatives\n- The simplest method is a linear weighting scheme:\n- You may want to use the list of FRs as the evaluation parameters\n- Apply a relative importance weight to each evaluation parameter\n-\n- Easiest to use provided user bias can be minimized\nPick one design as a \"baseline\" (all zeros), and compare the rest (+ or -)\n- When you find the \"best\" design, look at other designs that have higher weights and see\nhow those characteristics can be transferred to the \"best\" design to make it even better!\n- A \"Pugh\" chart is similar, except that it does NOT use the weighting column!\n- A linear weighting scheme (a series of +, -, 0 wrt a baseline design) will give equal\nweighting to attributes\nDRAFT"
    },
    {
      "category": "Resource",
      "title": "Pathways to Peace: From Heart to Art to Part",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-993-designing-paths-to-peace-fall-2002/40b2beea7b7e33d0329ff942d2fa3a8b_pathways_course_outline1.pdf",
      "content": "Pathways to Peace: IAP 2002\nFrom Heart to Art to Part\nAn Experimental 6 unit course run during IAP 2002\nThe Goal:\nTo provide students with\nan artistic means of\nexpressing their thoughts\non peace and allow them\nto create lasting symbols\nthereof.\nDRAFT\n\nChoosing a Concept\nAn Engineering Approach\nStudents generated 5\nconcepts for their tiles.\nUsing the Rohrbach technique,\nstudents evaluated other\nstudents' concepts.\nBased on the constructive\ncriticism, students picked\ntheir final concept.\nDRAFT\n\nLearning from the Experts\nArtist and Architect Experience\nLinda Miller\nOne of the few waterjet artists\nin existence, Linda spent one\nweek with the students.\nLinda's input was pivotal in\nguiding the students.\nWasma Charbouchi\nA faculty member of Harvard's\nIslamic Architecture department,\nWasma taught the beauty of\ncultural art and art making.\nDRAFT\n\nConverting Art to Engineering\nMoving from the Ideal to the Practical\nDRAFT\nThe most challenging part of this exercise\nwas converting the concepts embedded in\nthe drawings to usable engineering files.\nA combination of programs were used\nto vectorize the drawings and create\nfiles compatible with the waterjet.\n\nCreating the Parts\nWaterjetting\nUsing a high-pressure\nstream of water with\nentrained abrasive, the\nstudents created all tile\nparts on a waterjet\nmachine.\nDRAFT\n\nLaying out the tiles\nDRAFT\n\nBuilding the Tiles\nMortar and Grout\nThe students all\nworked together to\nbuild the tiles into\ntheir final design\n\nFinished Tiles!\nDRAFT\n\nDid the Students Enjoy & Learn?\nSee the website www.pathstopeace.org for the presentations\neach student did to explain their tiles\n\"I took the opportunity of taking the Pathways to Peace\nclass as a chance to create something permanent, which\nreflects my culture and background. [W]e should be able\nto live together and tolerate each other. Our 'differences'\nmake life just that bit more interesting.\" -Nur Aida\nAbdulRahman, Cambridge-MIT Exchange Student\n\"When I read about Pathways to Peace in the course catalog, I\nthought it sounded like a really exciting idea. I registered right\naway for it, but I thought that there wasn't a possibility of\nactually participating in the class because it was limited to 6-12\nstudents, and I'm only a freshman. Participating in this class\nhas been an eye-opening experience. It made me question how\nI identify myself, and what parts of my background I consider\nmore important.\"-Monica Rush, MIT freshman\n\"I feel that it has helped me learn more about\nother students in a way that would never have\nbeen possible without this experience.\nPathways to Peace allowed each of us to\nexpress our cultures and personalities through\nboth tangible and intangible means.\" -Ming-Fai\nFong, MIT freshman\n\"The Pathways to Peace\nproject has allowed me to\nrepresent my background as a\nChinese-American in a way\nthat is not only beautiful, but\nalso useful.\"-Frances Wong MIT\njunior, course 3\nDRAFT\n\nResources Required\n-\nFirst year costs:\n- Staff:\n- Engineering faculty: (1 summer month)\n- Arts faculty\n- 1 Teaching Assistant (net cost $50k)\n- Summer 2002 to help develop course materials\n- Fall 2002 to help run the course\n- Spring 2003 to help students install their tiles; to help evolve the course\nand have it ready for Fall 2003; and to write an article to submit for\npublication in an education journal\n- Hobby Shop ($10k for materials, instructor time, and student membership)\n- Abrasive Waterjet Machining Center to be installed in the Hobby Shop ($50k)\n-\nSubsequent years:\n- 1 TA (Fall) and $10k for Hobby Shop time and materials\nDRAFT"
    },
    {
      "category": "Resource",
      "title": "Name Plate Design Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-993-designing-paths-to-peace-fall-2002/c567ab2f245b11f07e6ed19f60808128_waterjettutorial.pdf",
      "content": "from heart to art to part\nPaths to Peace\nName Plate Design Exercise\nFALL 2002. MIT\n\nfrom heart to art to part\nTile\nDuring the course there will be a\nseries of homework exercises\nthat will help the students\ndesign and build a major inlaid\ntile. The elements of the tile are\nmanufactured by the students\non an OMAX abrasive water jet\nmachine using CAD models\nthat the students will create.\n\nfrom heart to art to part\nName Plate\nz\nAs an exercise to get to know the operation of the OMAX machine\neach student will have to design and fabricate a name plate\n1.\nThe first part of the exercise will be test the design using 17\"x17\"\naluminum plates. Each student will be given two plates, one will be\nused to cut the design pattern and the other to cut the design\ncomponents.\n2.\nAfter finishing part 1, each student will be given a 12\"x12\" marble\nplate and 5\"x5\" aluminum plates to apply design with the new\nmaterial.\n3.\nNow the students will do a wood frame for the plate in the hobby\nshop.\n\nfrom heart to art to part\nName Plate\nz\nThis presentation with all its links is designed to help you\nfinish the first exercise, that requires:\n1.\nDesigning the plate on Solid Works.\n2.\nLoading the design on OMAX layout software and adding\nfeatures.\n3.\nWorking on the OMAX machine.\n\nfrom heart to art to part\nPart I _Solid Works\nSolid Works assembly sketch\nDesigning the plate on Solid\nWorks: After deciding on the text\nthat you will place on the plate,\nmake an assembly sketch of how\nthe plate will look like at the end.\n\nfrom heart to art to part\nPart I _ Solid Works\nDo a drawing of your\nassembly and save it as a\n.dxf file\nSolid Works assembly drawing\n\nfrom heart to art to part\nPart I _ Solid Works\nz Your final part\nshould be\nsomething like\nthis.\n\nfrom heart to art to part\nPart II _ OMAX layout\nOMAX Layout:\nz\nYou need to import the file:\nFile>Import from other CAD>\n.dxf file\nz\nResize your design to the plate\nsize:12\"x12\". Size>height = 12\"\n>width = 12\".\nz\nErase everything except\nfor the name design. Erase>\nYou can right click on Erase and\nchoose many options.\nz\nSelect the parts. Select>\nz\nMove the name design into the\ngrid. Move>\nOMAX Layout drawings\n\nfrom heart to art to part\nPart II _ OMAX layout\nz\nSet the quality of your cut, the higher the better. Right click on Quality\n> Set quality= > 3\nz\nThe OMAX machine follows paths that you can draw or just set them\nautomatically. Right click on Lead i/o > AutoPath (Advanced)...> the\nfollowing window will open\nOMAX Layout drawing\n\nfrom heart to art to part\nPart II _ OMAX layout\nThe window that opens is very important for 2 reasons:\n1.\nNotice how the path of the cutting nozzle changed directions\ninside the circle under the exclamation mark, and this means\nthat while cutting the plate, the cut signs will show on the\nmaterial cut from the plate, this is what we want while doing\nthe plate and what we don't want while doing the letters.\nITherefore an easy way to design the plate is to leave a square\naround the design, and hence choosing Lead i/o, will place\nthe cut signs inside the letters. Then for the letters erase the\nsquare and Lead i/o will place the cut signs outside the letters\nleaving them intact.\nExamples will be shown in class to make the point clearer.\n\nfrom heart to art to part\nPart II _ OMAX layout\n2.\nThe External Direction/ Internal Direction selection in the\nwindow is very important for it will specify which side of the\npath the water jet will cut. Usually for the plate we choose the\ncutting to be from the outside and for the letters from the\ninside. This way there will be more offset in opposing\ndirections so that the letters will fit into the plate.\nAfter setting the options, select GO>\nz\nIf you are doing the plate Erase the box that we drawn to set\nthe cutting signs outside the letters.\n\nfrom heart to art to part\nPart II _ OMAX layout\nOMAX Layout drawing\nz\nNotice that the starting and\nfinishing leads are not in a nice\nlocation, for it is usually better\nto start on the origin at the\nbottom left corner. Erase> the\nstarting and ending leads.\nRedraw the starting lead from\nthe origin to the point where the\nfirst one ended, and the\nfinishing lead from where the\nfirst one started to any where.\nWe don't care where the\ncutting handle goes after it\nfinishes the job.\n\nfrom heart to art to part\nPart II _ OMAX layout\nz\nClean the drawing. Clean > OK\n>\nz\nPath > set the starting point to\nthe origin (bottom left corner) >\nSave > OMAX creates a .ord\nversion of your file.\nz\nBefore pressing save in the\nPath window Zoom in to the\npart and notice the red region\nnear the path. This is the side\nthe machine will be cutting on.\nOMAX Layout drawing\n\nfrom heart to art to part\nPart II _ OMAX layout\nz\nAdvice tips:\n1.\nWhen ever you have a small thing in\nyour design, always use tabs in the\ndesign because small parts can fall\ninto the machine and can't be\nrecovered afterwards. To do tabs in\nOMAX layout software erase some\nsmall connections between the\nletters and the plate.\n2.\nThere are many keyboard shortcuts\nto use.\n3.\nPlace the tab in a thick place of the\npart So that the whole thing wont\nbreak.\n\nfrom heart to art to part\nPart III_ OMAX machine\nz\nAn OMAX\nAbrasive Water\nJet Cutter found\nin the hobby\nShop will be\nused.\n\nfrom heart to art to part\nPart III_ OMAX machine\nOn the OMAX machine:\nz Load the machine with file. File Path > Open file .ord\nz Input the material code and the thickness of the plate\nz Place the plate at the bottom left part of the machine's working\narea.\nz Bring the jet arm to the bottom left corner of the working area\nusing the arrow keys on the key board.\n\nfrom heart to art to part\nPart III_ OMAX machine\nz\nHere are some images of\nthe jet handle. With the\nimportant parts indicated.\n2. Level Indicator.\n1. Position Arm.\n\nfrom heart to art to part\nThe drawing on the right is a simple\nrepresentation of the jet handle.\nz Unlock the jet handle by moving the\nlock arm downwards.\nz Lower the jet handle by rotating the\nposition arm until the level indicator just\nmoves up. Rotate the position arm half\na rotation for thick plates and 3⁄4 of a\nrotation for thin ones.\nz Lock the jet handle.\nLock Arm\n\nfrom heart to art to part\nPart III_ OMAX machine\nz Put on the plate some\nweights and clamps if\nnecessary, to reduce\nvibration and fix the plate.\nz Elevate the water level to\nabout an inch above the\nplate.\n1. Elevate water\nbutton.\n\nfrom heart to art to part\nPart III_ OMAX machine\nz Wear your safety goggles.\nz Press start.\nz The machine will ask if you want to set the current\nposition to the abs zero one, Press YES.\nz Be very careful and watch the machine so that it\nwon't hit any obstacle, whenever there is something\nwrong press the SPACE BAR, this holds the\nmachine's action on pause.\n\nfrom heart to art to part\nPart III_ OMAX machine\nAfter the machine finishes its job:\nz Move the jet handle away from the plate.\nz Lower the water level.\nz Remove the weights and clamps.\nz Release the lock.\nz Elevate the jet handle.\nz Lock the jet handle.\nz Some machining might be required to remove the tabs and\nimprove the surface finish of the part.\n\nfrom heart to art to part\nImp.\nz\nHope that you will enjoy this exercise and always remember.\n1.\nThe space bar stops the machine.\n2.\nSave your files always, especially in OMAX layout.\n3.\nWear your safety goggles.\n\nfrom heart to art to part\nPathways to Peace\nThe aim of this course is to provide\nstudents with an artistic means\nof expressing their thoughts on\npeace and allow them to create\nlasting symbols thereof.\nArt is the language of all people,\nthe tile will be an everlasting\nmessage from you to the world."
    }
  ]
}