{
  "course_name": "Developmental Cognitive Neuroscience",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Biology",
    "Neuroscience",
    "Cognitive Science",
    "Science",
    "Biology",
    "Neuroscience",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3.5 hours / session (with a half hour break)\n\nDescription\n\nThis course will ask how neuroscientific methods and discoveries have been, or could be, or should be, used to address fundamental theoretical issues concerning the development of cognition in human childhood. We will consider questions like the role of experience and of innate biological predisposition, the range of plasticity, and the functional specialization of domain specific mechanisms, in the development of cognition. Topic areas will include face perception, navigation, language, memory, number, object representations, and social and moral cognition. We will also examine the influence of the development of the domain general mechanisms of executive functions on conceptual development. Neuroscientific methods surveyed will include MRI, fMRI, EEG, MEG, NIRS, lesion studies and electrophysiology.\n\nRequirements\n\nOpen to graduate students in developmental psychology, cognitive science or cognitive neuroscience. Students will be required to give in-class presentations, write responses to weekly papers, and to write a final paper.\n\nThis course welcomes auditors, but they will be required to participate, including written and oral responses to the weekly readings.\n\nSchedule\n\nThis table outlines the topics covered in each session. After the first class, students will submit response papers based on the reading assigned for that topic. Three specific subtopics will be covered each week. For each of these topics, one participant will prepare a presentation.\n\nThe final class will have a different format. Each student's response paper will be a proposal for how neuroscience could contribute to our understanding of these kinds of learning. There will be no preassigned presenters, but we will call on people to present/discuss their proposal, so everyone should be ready to talk about their idea. In the second half of class, we will then reflect on the general lessons we have learned about the role of cognitive neuroscience in understanding development.\n\nSES #\n\nTOPICS\n\nIntroduction & assignment of presentations for first 6 weeks\n\nGeometry and navigation--a candidate innate representation\n\nFaces--another candidate innate representation\n\nActivity-dependent and experience-dependent change\n\nFaces 2--experience hones representations\n\nWords & reading--cultural experience creates new representations\n\nWhat is innate about language\n\nLearning as declarative memory\n\nLearning as exploration\n\nExecutive function\n\nHow executive function development affects other cognitive functions\n\nConceptual change",
  "files": [
    {
      "category": "Resource",
      "title": "Executive Function",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-s915-developmental-cognitive-neuroscience-spring-2012/f737e8bdcf54f0ed0845f5d6c40d9166_MIT9_S915S12_sample_wk10.pdf",
      "content": "Executive Function\n\nOne overarching question this week is: What are the origins of individual differences in\nexecutive function?\n\nThe behavioral data can take us pretty far on this issue. Firstly, a wide range of\nbehavioral data has shown that there is developmental continuity in EF skill level: Individual\ndifferences in EF tasks and related abilities in infancy and early childhood predict EF abilities\nlater in childhood as well as in adulthood (e.g. Friedman et al). These individual differences\nthemselves are largely genetic (e.g. Friedman et al., 2008; Rothbard & Rueda, 2005), and the\nlongitudinal associations between infant and adult EF performance appears to be in large part\nexplained by genetic factors -- as shown by the MZ vs DZ twin data (and rather opaque\nstructural equation modeling) in Friedman et al. However, experience and training also plays an\nimportant role in EF, especially when strong interventions are provided: Children's EF abilities\nimprove with training (particularly those who start out with low EF performance), such as Adele\nDiamond's Tools of the Mind program or similar activities requiring EF engagement in\nMontessori schools. Thus, EF abilities are not fixed at birth or even in infancy.\n\nOverall, behavioral data can provide the \"bones\" of an answer: In populations with\ntypical Western experiences, much of the variance in individual performance is attributable to\ngenetics, and some is due to (shared or not-shared) experiences. When individuals' experiences\ninclude consciously-designed, 'high-dosage' intervention/training programs, this experience can\nresult in substantial increases in EF skill.\n\nGenetics can begin to put some meat on these explanatory bones, by identifying genes\nthat differ between individuals with low and high EF, and exploring their effects on the\nmolecular level. The work we read cited a few particular genes that are associated with EF\nabilities-- for instance, polymorphisms related to the dopamine system (DAT1, COMT val/ met,\nmentioned by Friedman et al); and SNPs (single nucleotide polymorphisms) related to\nglucocorticoid and catecholamine activity in the prefrontal cortex (mentioned by Blair). Even\nmore tantalizing are recent findings from epigenetics -- a field that has shown us that DNA\nexpression is itself affected by early experience. Our experiences turn genes on and off, breaking\nthe traditional model in that experience appears to affect our (expressed) genotype, not just our\nphenotype. In the case of EF, the effects of early stress on subsequent EF abilities are produced\nthrough epigenetic mechanisms-- changing activity levels of gene expression that result in\nchanges in glucocorticoid receptor density in the hippocampus (see below).\nThis epigenetic mechanism brings us to the crucial role of neuroscience data in providing\na satisfying explanation for EF individual differences. Ultimately, the effects of genetics and\nexperience on behavior are mediated through the brain: Our genes plus our experience generate\nour individual neural structures, the activities of which generate our behavior. Thus, while\nbehavioral data provides the 'bones' of a satisfying explanation for individual differences - by\nspecifying the relative importance of genetics and what experience can change -- neuroscience is\nneeded, in addition to genetic and behavioral data, to flesh out the answer into a satisfying\nexplanation of the phenomenon.\n\nIn the case of EF, one particular explanation in our reading bridged all of these levels of\nanalysis (in the Blair paper), and thus seemed particularly satisfying to me. Although I'm not sure\nI can do the neural explanation justice here in one paragraph, here's the basic story.\n\nThe behavioral phenomenon is that individuals raised in stressful environments in early\nlife typically have lower EF abilities later in life. The neural data give one major part of a\n\nsatisfying explanation for this phenomenon: In early life, high stress results in high levels of\ncortisol (in humans) or corticosteroids (in rodents). This influences the development of specific\nbrain structures important for EF, by programming the stress response systems and the PFC to\nengage in reactive/reflexive processes rather than reflective self-regulation. We even can explain\nhow this works: At very high levels of stress hormones, a specific type of receptor primarily\nlocated in the PFC becomes saturated, and another type of receptor, which is mostly present in\nsub-cortical and posterior regions, becomes active, promoting a reflexive instead of reflective\nresponse. Genetics and epigenetics adds an additional piece to this explanation, by showing that\nexperience not only affects hormonal/neural systems directly, but also affects these systems by\nchanging gene expression: typical development of the neural stress-response system is mediated\nthrough epigenetic effects on genes coding for glucocorticoid receptor density.\n\nThus, adding the neural level of analysis allows us to flesh out our answer regarding the\norigins of individual differences in EF, and provide a much more satisfying explanation for how\ngenetic predispositions and environmental effects interact to produce different levels of EF\nability across individuals.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n9.S915 Developmental Cognitive Neuroscience\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Geometry and Navigation—A Candidate Innate Representation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-s915-developmental-cognitive-neuroscience-spring-2012/8c17c08aaa5b5205b54c854ea2e0ba01_MIT9_S915S12_sample_wk2.pdf",
      "content": "9.915S\nNavigation\nIn the domain of spatal navigaton, the neuroscience literature largely converges with the\ndevelopmental literature, and, in the domain of geometry-based navigaton, pushes beyond\nbehavioral data.\nThis convergence happens on two fronts. First, and most generally, the behavioral and\nneuroscience literature converge on the fact that certain aspects of spatal navigaton are\nprivileged in development. Behavioral work in young children and animals suggests that basic\nnavigaton is early-developing or even core: young humans, rates, and birds all show successful\norientng based on geometric propertes of a room, such as wall length (e.g. Chiandet et al\n2009; see Lee & Spelke, 2010, and Vallortgara et al, 2009, for a review). Similarly, early work\nin neuroscience found a specifc region in vertebrates, including humans, uniquely involved in\nspatal processing, memory, and navigaton: the hippocampus. This region contains neurons\nthat are specifcally tuned for various aspects of spatal navigaton, and which are functonally\nspecifed from very early on, at least in rats (Willis et al, 2010; Langston et al, 2010).\nSecond, the developmental literature, combining human child and controlled rearing\nexperiments, makes a strong argument that this early, privileged system of navigaton relies\nprimarily on geometric cues, as opposed to feature-based or object-based navigaton. For\nexample, young children will orient based on room shape (short and long walls), and structural\nfeatures of a room (e.g. alcoves), but not always to feature-based cues, (e.g. objects ofset from\nthe wall, or colored walls; see much work by Spelke and colleagues). This (surprising) result is\nsupported by the neuroscience literature: both human and animal studies suggest distnct\nneural circuits for spatal versus feature-based navigaton. For example, Doeller et al. 2007\nfound using fMRI that human adults show hippocampal actvaton when making navigaton\ndecisions based on spatal boundaries, but dorsal striatal actvity when making decisions based\non landmarks. (It is, however, important to note the interpretaton of this neuroscience\nliterature is informed by the developmental literature: many of the texture and color cue versus\nboundary experiments were run precisely because of the developmental results.) This\ndissociaton seems supported by patent literature as well: while certain lesion sites lead to\nspecifc failure to encode or use landmarks (e.g. Takahashi et al 1997), others lead to difculty\nin path integraton (Habin & Sirigu, 1987). Recently Iaria et al (2009, 2010) discovered a set of\nindividuals who experienced severe impairment in navigaton, despite a preserved ability to\nrecognize familiar places and environmental landmarks, and Lakusta et al (2009) reported that\nsome individuals with Williams syndrome show an ability to navigate using feature-based cues\n(colored wall), but not geometric cues (room shape); exactly the opposite profle of children.\nFinally, in the domain of geometry-based navigaton, the neuroscience literature goes beyond\npurely behavioral measures. The discovery of at least three diferent profles of actvity in\nhippocampus -- place, directon, and grid cells -- suggests ways of getng tracton for more\nprecise characterizatons of \"geometry-based\" navigaton. As well as having distnct functonal\nprofles, the development of these neurons in rats suggests that, while geometric navigaton as\na whole comes very early, the sub-components come online and become refned at slightly\ndiferent rates (Willis et al, 2010; Langston et al, 2010). Understanding these profles and how\nthey interact will hopefully inform further questons about navigaton: what are the\ncomputatons and representatons, what makes something in the world a geometric cue vs a\nlandmark, and what does a model of navigaton that makes use of place, directon, and interval\nlocaton (grids) look like?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n9.S915 Developmental Cognitive Neuroscience\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Learning as Exploration",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-s915-developmental-cognitive-neuroscience-spring-2012/d399fd16040e4b58b49fd0ad09602421_MIT9_S915S12_sample_wk9.pdf",
      "content": "If one important aspect of learning is how one might store relevant information and\nretrieve it for later use (as in last week's discussion), perhaps an even more\nfundamental challenge for learning is how one might acquire relevant information\nin the first place. The Schulz paper advances the analogy between a child and a\nscientist and proposes that the inferential abilities characteristic of scientific\npractices are, in fact, fundamental properties of the human learning mechanism.\nIn this regard, one of the main questions that arise from this week's reading is\nwhether there's something fundamentally different in the way human children\nexplore and learn about the world, from the way other animals do. Is there a\nuniquely human aspect in the learning mechanism that promotes hypothesis\ngeneration and theory-driven explorations, or is this capacity deeply rooted in a\nother evolutionarily ancient mechanisms involved in simple motor sequence\nlearning (e.g., songbirds in Fee paper) or foraging decisions (e.g., monkeys in\nHayden paper)?\n\nThere are simpler kinds of of human learning that seem genuinely similar to the way\nin which songbirds learn songs and monkeys weigh the options to stay or to explore\n(e.g., playing music instruments, riding bicycles, slot machine behaviors, etc.).\nHowever, these cases of learning are fundamentally limited in their explanatory\npower to capture the full scope of the human ability to construct hypotheses,\ngenerate evidence, and move in hypothesis space based on evidence.\n\n(1) The Fee paper puts forward an extremely interesting proposal about a learning\nmechanism in songbirds that has a clear end state (e.g., producing a song that\nsounds like the tutor song) and well-defined neural structures that support this\nlearning. Not only is the idea of a learning mechanism that generates \"noise\" in\nbehavior that is \"biased\" in a direction that is more likely to produce the correct\nbehavior conceptually intriguing, but the precise details known about each one of\nthese neural structures that perform these computations is amazing. However,\ndespite its awesomeness, I think the kind of learning discussed in this paper is\nstrictly constrained to cases where there is a \"correct behavior\" or a template to\nwhich the behavior is matched and reinforced. Human children's tendency to show\nmore variability in play when there is ambiguity or uncertainty (thus higher\npotential informational gain) may seem superficially similar to Fee's birds, but their\nexploration gets the causal structure right even when the initial evidence observed\nis sparse and far from the \"right template\". Part of what's special in human\nexploration seems to be the ability to generate hypotheses about causal structures\nand perform effective interventions to yield informative evidence. The Ullman paper\nproposes a mechanism by which the correct can be generated via stochastic search -\nwhich seems to operate at a fundamentally different level from behavioral\nvariability in the songbirds.\n\n(2) The Hayden paper suggests how firing rates of neurons in dACC may represent the\nrelative value of (a) staying and exploiting the current resource and (b) incurring a cost\nto move to a different resource. In this foraging decision task, monkeys were presented\nwith precise information about the expected rewards for staying (constant depletion\n\nrate) and for switching (visual representation of length of delay and fixed magnitude of\nreward from replenished source). While the Hills paper suggest a striking (to the extent\nthat it's almost unbelievable) relationship between spatial search and search in\nconceptual space, such foraging model in the Hayden paper seems to be way too\nsimplified to account for foraging in hypothesis space where information is harvested\nand hypotheses are revised accordingly. Critically, it does not explain how humans select\nor generate \"where to forage next\". In order to apply this framework in explaining\nhuman exploration and learning, we need to understand how value of information (e.g.,\nevidence generated by an intervention) can be calculated with respect to the learner's\nuncertainty in the current hypothesis, probability of observing such evidence, and the\ncosts for generating such information. Despite these limitations, I think there is real\npotential in understanding how these variables are represented in the brain, and dACC,\nalong with a few other areas in the prefrontal cortex, is an interesting region that may\nserve as the final destination where all these decision variables are integrated to\ngenerate a behavior.\n\nAnimal models of learning are important in their own right, and can explain a lot in\nhuman learning as well. However, there are at least three aspects of human learning that\nset us apart from non-human animals, and thus cannot be captured in these models.\nFirst, humans possess a powerful mechanism for making inductive inferences. Second,\nhuman species have unprecedented ability to represent abstract (even unobservable)\nvariables and construct hypotheses to guide their behavior. Finally, humans seem to\nhave the motivation to learn about causal structures in the world, which perhaps might\nbe what makes humans most distinct from other animals.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n9.S915 Developmental Cognitive Neuroscience\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}