{
  "course_name": "Development, Planning, and Implementation: The Dialectic of Theory and Practice",
  "course_description": "No description found.",
  "topics": [
    "Social Science",
    "Public Administration",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Regional Planning",
    "Urban Planning",
    "Social Science",
    "Public Administration",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Regional Planning",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Overview\n\nThis is an advanced seminar that will analyze the effectiveness of development and planning theories from the perspective of practitioners who implement projects and policies based on such theories. The course will be organized around eleven implementation puzzles / course topics, which should be considered for re-theorizing both developmental and planning processes. The course will begin with a review of conventional theories of Development, Planning, and Implementation to set the stage for critical reviews of how such theories actually unfolded in practice. Then, drawing on the implementation experiences of projects and policies, the conventional theories will be revised particularly to fit organizational constraints which influence implementation outcomes. The ultimate goal is to create new planning sensibilities, which theorize from practice, not the other way around. Students will be required to focus on any one of the twelve implementation puzzles discussed in the class and write a paper on the multiple facets of any such puzzle. This kind of an understanding can lead to re-conceptualization of the developmental process, as nations develop, cities grow, and planning is practiced by professionals who do not conceptualize the process as either \"top-down\" or \"bottom-up\", but seek an understanding of the connection between the two levels. Since the central purpose of the course is to cultivate a conversation between theory and practice, this class will be open to both graduate students and\nSpecial Program for Urban and Regional Studies (SPURS) / Humphrey Fellows\n.\n\nPrerequisites\n\nMIT students were required to obtain permission of the instructors.\n\nLearning Objectives\n\nThe choice of a dialectic approach to study the relationship between development, planning, and implementation is intended to foster critical thinking. Specifically, we expect students attending 11.S940 to develop two critical skills, which are the\nability to understand conventional development and planning theories\n, then question the conventional understanding by looking at actual outcomes, and finally revise theory building in a way that is useful for practitioners. Even if this process sounds very clear-cut, the process is likely to be dialogic, and will rely on students reflecting on their own professional experience.\n\nThe main goal is not to replace conventional theories with non-conventional ones, but identify under what conditions any set of theoretical propositions hold. Hence, identifying conditions which determine development and planning outcomes is crucial.\n\nOne assumption that underlies this pedagogical approach is that it encourages unconventional thinking, and reflection in action--and not planning prescriptions based on pre-conceived ideas.\n\nCourse Format & Structure\n\nThe classes will start with lecture on each of the debates, followed by a seminar style discussion, in which students are expected to participate actively. The students will need to read the assigned material in advance as a way to prepare for an extensive in-class discussion. The weekly meetings will be organized around the twelve implementation debates, with the co-instructors taking the lead.\n\nStudents will be required to attend four panel discussions at\nThe Department of Urban Studies & Planning (DUSP)\non issues of implementation by leading scholars in the field.\n\nWe will also use online resources for information sharing, and to promote discussions on the challenges of implementation development policies and projects. These include the course website and group emails, as well as one alternative online platform created exclusively for the class. Students will decide collectively in the beginning of the semester their favorite option, such as a Facebook group, or a class blog. The engagement with the class through this alternative platform will be voluntary, but active participants will receive extra credit toward their final grade. All activities will be guided by appropriate codes of conduct and privacy procedures.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nImplementation Puzzle\n\n10%\n\nMid-term\n\n25%\n\nFinal Paper\n\n40%\n\nClass Participation\n\n25%\n\nExtra Credit (Online Activities)\n\nAn additional level grade to the final grade (i.e., a B becomes a B+)\n\nGrade Levels\n\nGRADES\n\nPERCENTAGES\n\nA\n\n93-100%\n\nA-\n\n90-92%\n\nB+\n\n87-89%\n\nB\n\n83-86%\n\nB-\n\n80-82%\n\nC+\n\n77-79%\n\nC\n\n73-76%\n\nC-\n\n70-72%\n\nD+\n\n67-69%\n\nD\n\n63-66%\n\nD-\n\n60-62%\n\nF\n\nbelow 60",
  "files": [
    {
      "category": "Resource",
      "title": "The Case of Forest City and Singapore",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-s940-development-planning-and-implementation-the-dialectic-of-theory-and-practice-fall-2015/76728e484af362f4980aa1090ff52337_MIT11_S940F15_FinalPaper.pdf",
      "content": "The Case of Forest City and Singapore\n\nIntroduction:\n\nFor much of its history Johor, Malaysia has been a scrappy border town across from\nbooming Singapore. Yet over the past decade Johor has been the site of an explosion in large real\nestate projects by Chinese developers, many of them involving extensive land reclamation. Despite\na great deal of experience and deep pockets, the Chinese have found themselves repeatedly beset\nby problems as they expand in Malaysia. The case of one development, Forest City, illustrates this\nsituation well. The sheer scale of the project is astounding, with plans for thousands of acres of new\nland and housing for hundreds of thousands of people, but perhaps most importantly is was located\nnear the Singapore border along the Straights of Johor. For two nations that are economically\nintertwined but politically contentious, this siting in a trans-boundary context set the stage for a\nhigh-level dispute.\nThe project began auspiciously enough as its developer, Country Garden Ltd., received tacit\nassurances from the powerful Sultan of Johor that their project would sail through the regulatory\nand approval portions of the development process. After beginning land reclamation work,\nhowever, neighboring Singapore issued a formal protest on environmental and sovereignty\ngrounds. The future of the project was thrust into doubt as it became embroiled in an international\ncontroversy. After several diplomatic exchanges, the Malaysian federal government eventually\nforced the project through more intensive environmental review, which resulted in significant\nchanges to Forest City. While a range of factors contributed to this outcome, Singapore seems to\nhave played the defining role in shaping the future of the project. The case serves as a poignant\nreminder that such projects, especially those in a transboundary setting, are entangled in a web of\npolitical relationships. It also serves as excellent evidence for how external accountability can force\ninstitutions to uphold laws and act in the interest of their citizens.\n\nRationale for Project:\nCountry Garden's interest in Malaysia has been explained as a need to seek returns overseas\namid a slowing domestic property market and higher barriers to investing elsewhere. Lower prices\nand fewer market restrictions than Hong Kong or neighboring Singapore make the region\nattractive. Compared to other East Asian nations, Malaysia is politically stable and has relatively\ngood relations with China.1\nThe southern state of Johor, with its proximity to Singapore, was seen as the ideal site for\ntheir first Malaysian venture. While Singapore is an island, it is far from isolated. Economic and\nlabor linkages between Johor and Singapore are already very tight; over two hundred thousand\npeople cross the causeway between the two nations every day as there is a large community that\nlives in Johor but commutes to work in Singapore. Dramatically lower housing costs in Johor justify\nfor many the prospect of a two-hour crossing. Through its own economic dynamism, Singapore\ncreated the fundamental demand for housing near its borders.2 In many ways its \"hinterland\" is\nMalaysia, where many industries have moved and supplies are sourced. Even a growing number of\nSingaporean firms have moved their back offices to Johor as part of an effort to cut costs.\nThe Sultan of Johor, one of Malaysia's traditional monarchs who act as stewards of Islam,\nprovided the official invitation for Country Garden to embark on a project in his state. The Sultans\nof Malaysia, while officially just figureheads, in practice wield considerable political and economic\npower. The Sultan of Johor in particular had proven himself an active businessman who had found\nhis way into a number of deals worth billions of dollars.3 A professor of hydrology at UTM\n(Universiti Teknologi Malaysia) I interviewed, Dr. Maketab Mohamad, who had a deep reading on\nthe political scene in Johor described the Sultan as \"the key player that made this project happen.\"4\n\n1 Bei Shan, Ng. \"Stormy Property Landscape.\"\n2 Tan, Ck. \"Malaysia-Singapore commute a daily grind.\"\n3 Aw, Nigel. \"Johor Sultan 'initiated' Forest City mega project.\"\n4 Interview with Dr. Maketab Muhamad\n\nHe said that there was something unwritten that all major decisions require the tacit approval of\nthe Sultan--part of an invisible yet intractable power structure.\nAccording to media reports, the Sultan was concerned about an imbalance in the\ndevelopment of eastern and western Johor and therefore sought a project to direct investment into\nthe western side. In any case, the Sultan took a substantial financial stake in what was to be a multi-\nbillion dollar project. It is possible that the Sultan saw the project as an (albeit odd) expression of\nMalaysian nationalism; in a later media interview he claimed that \"the coastline in strategic,\" and\nthat \"if Johor does not carry out reclamation, Singapore will and has been doing so.\"5 The appeal to\na political rivalry is bizarre, considering that each nation is clearly constrained by its international\nborders and reclamation on one side of the border presumably doesn't affect reclamation efforts on\nthe other.\nCountry Garden entered the scene with plans for a massive new development involving a\n2000 ha reclaimed island that would host a lifestyle luxury development for some 500000 people.\nTargeting \"international buyers,\" it would be by far the largest such project in Malaysia.6 It was\nreported to be \"very high end,\" with \"dazzling water features\" and a number of destination\nattractions. All this was to be within easy access to Singapore via the second link bridge. The site of\nthe project was quite rural, home to a number of sleeping fishing villages. Residents plied their\ntrade among the mangroves of the shoreline, an ecologically rich environment. Home to the largest\nseagrass bed in peninsular Malaysia, the area had for some time been considered for designation as\nan environmentally sensitive area.\nSome commentators had questioned the need for land reclamation when Johor clearly has\nno shortage of open development sites. An executive at a rival Chinese firm I interviewed, Dr.\nJeffrey Yee, explained that in order to attract high-value international buyers, the developments\nneeded to be by the sea. \"You can't just put up a cluster of towers in the middle of JB [Johor Bahru,\n\n5 Chun Wai, Wong and Benjamin, Nelson. \"Sultan of Johor speaks his mind.\"\n6 Bei Shan, Ng. \"Country Garden, KPRJ plan massive reclamation development for luxury homes.\"\n\nthe largest city in Johor] and expect to attract that much attention,\"7 he noted. Presumably,\nreclaiming new land allows the developer to maximize the number of units near the water and\nhence their overall development value.\n\nContext from Previous Dispute:\nThe role Singapore played in the Forest City project was inevitably colored by a previous\ndispute over land reclamation in 2003. In that case, the positions essentially reversed as Malaysia\nprotested Singapore's reclamation work at Tuas and Pulau Teekong. Attempts at a negotiated\nresolution broke down after Malaysia demanded that Singapore suspend reclamation as a\nprecondition of any subsequent talks. Singapore refused, and Malaysia responded by bringing its\ncase to the International Tribunal for the Law of the Sea (ITLOS). 8\nMalaysia argued that Singapore's land reclamation was causing irreversible damage to the\nmarine environment. In particular, they were concerned that the works would cause changes to the\n\"flow regime\" and increases in sedimentation. They argued that the impacts would fall unequally on\nMalaysia. Singapore questioned the technical basis for Malaysia's case, calling it \"rife with\nspeculation,\"9 and arguing that it failed to establish a causal link between observed impacts on the\nmarine environment and Singapore's actions. Responding to claims that Malaysia was not\nsufficiently informed or consulted on the reclamation projects, Singapore maintained that it had\nprovided the relevant information and was prepared to consult with Malaysia should the need\narise. It also questioned why Malaysia waited for years after having learned of the reclamation\nplans from Singapore to refer its grievances to the tribunal. Singapore made a number of\nassurances that it would carefully study Malaysia's evidence of adverse effects and consider\nchanges if it found such evidence compelling.\n\n7 Interview with Dr. Jeffrey Yee\n8Rao, Chandrasekhara. \"Separate Opinion\" ITLOS Case No. 12.\n9 Nelson, Dolliver. \"Declaration of President Nelson\" ITLOS Case No. 12.\n\nIn ITLOS's unanimous judgement, the court refused to grant the stay in reclamation\nactivities Malaysia was seeking and instead required the two parties to establish a group of\nindependent experts to conduct a study on the reclamation works. The group would determine\nwithin a year the effects of Singapore's activities and propose measures to deal with any adverse\neffects. In essence, the court was compelling Malaysia and Singapore to cooperate and resolve their\ndifferences on the basis of an objective study by independent experts. Tommy Koh, one of the lead\nnegotiators for Singapore, praised the outcome, stating that \"the whole process worked out very\nwell.\" Malaysia and Singapore were forced to collaborate on the study, which in turn fostered a\n\"relationship of mutual respect.\"10 After completing the study and following through further rounds\nof negotiations, the two nations finally signed a settlement agreement in 2005, marking an amicable\nend to the dispute. Yet, despite the precedent set by this case and the commitment to cooperate on\nprojects with transboundary impacts, conflict would arise again, this time over the Forest City case.\n\nEarly Chronology:\nSince Country Garden's Forest City project was highly complex and involved extensive land\nreclamation, the project and its required approvals were broken into multiple phases. Phase one of\nthe reclamation involved 49.3 ha of new land consisting of an irregularly-shaped parcel close to the\ninternational border and a causeway linking the site to the mainland.11 The figure of 49 ha is\nsuspect, representing an evident attempt to skirt national environmental regulations. According to\nthe Environmental Quality Order 1978 and Environmental Quality Act 1974, coastal reclamation\nprojects over 50 ha in size require detailed EIA reports. Since the overall size of the project was\nmany times larger than 50 ha, breaking it into smaller phases was at best disingenuous.\nIn spite of this clear attempt to exploit a loophole, the Johor Department of the Environment\n(DOE) duly issued Country Garden its approval in January 2014. Country Garden began reclamation\n\n10 Koh, Tommy. \"The Land Reclamation Case: Thoughts and Reflections by Tommy Koh.\"\n11 Dr. Nik and Associates Sdn. Bhd.\n\njust days later, evidence that they were all but certain of the outcome and had massed their\nresources in anticipation.12 Speculatively, the Sultan and other politically powerful figures with a\npersonal interest in the project used their influence to speed it through the approvals process,\ndisregarding requirements for environmental review. It is hard to conceive that officials at the\nstate's DOE would have otherwise failed to recognize the site's environmental sensitivity and\nallowed it to proceed with so little scrutiny.\nReclamation proceeded quietly for the following months. An MP from Gelang Petah (the\nconstituency nearest Forest City), Lim Kit Siang and a few fishermen protested, but their appeals\nfailed to gain traction.13 In May, however, Singapore began making its concerns clear. It first sent a\ndiplomatic note asking for \"all the relevant information\" about the project, including an EIA report\nand timeline for the project's completion.\nEvidently, this was more than sufficient to attract Malaysia's attention. In response to the\ndiplomatic note, Johor Mentri Besar (chief minster) Khaled Nordin made assurances that the\nproject would not affect the environment. He said that the state government had notified Country\nGarden that they had to prepare an action plan and clear any sediment that was dislodged resulting\nfrom the reclamation work. Singapore fired back with a request \"clarification and explanation\" of\nthese remarks in a second diplomatic note.14 By late May, the prime minister of Malaysia Najib\nRazak was apparently facing a dilemma over how to deal with Singapore's concerns. Environmental\nissues fall under the purview of the federal government in Putrajaya, while land matters are under\nthe jurisdiction of the Johor state government, highlighting the possibility of contention between\nthe federal and state governments.15\nThe fact that Singapore was pursuing the matter through multiple channels suggests that\nthey took the matter very seriously. That they chose to address their concerns on a federal,\n\n12 Ibid.\n13 How, Cheo Yee. \"Disagreement with the proposed Forest City project.\"\n14 Zulfakar, Mergawati. \"Singapore Concern over Johor Project.\"\n15 \"Land reclamation project linked to royalty set to ruffle Malaysia-Singapore ties, says report.\"\n\ngovernment-to-government level speaks to the perceived gravity of the situation. Singapore's\ninvolvement had the effect of internationalizing the issue and wresting control of the matter away\nfrom authorities in Johor. According to a source cited in a Star article, \"It becomes a federal matter\nwhen transboundary and environmental issues are involved.\"16\nA spokesman for the Singapore Ministry of Foreign Affairs (MFA) later issued a statement\naddressing the Forest City project: \"Given Johor's close proximity to Singapore, we are naturally\nconcerned about any possible transboundary impacts on Singapore from property development\nprojects that involve reclamation works in the Straits of Johor. There are also international\nobligations for both Malaysia and Singapore authorities to work closely on such matters. We have\nasked the Malaysian authorities to provide more information so that we can undertake a study as\nsoon as possible on the impacts of these reclamation works on Singapore and the Straits.\"17\n\nNature of Singapore's Concerns:\nDan Freiss, an assistant professor at the National University of Singapore with a specialty in\nmarine ecology, shared with me some of his reasoning for why Singapore had objected to the\nproject. The primary concern, he said is for trans-boundary environmental impacts. More\nspecifically, sedimentation and erosion arising from the reshaping of the coastline and resulting\nchange in hydrology. Since sand \"tends not to float very far\" the primary worry involves changes in\ncurrents brought about by the new islands. These are the same impacts that Malaysia emphasized\nin its earlier UNCLOS protest. Still, sand from reclamation has the potential to smother mangrove\nroots and corals.18\nThe Singapore foreign minister Masagos Zulkifli set out his nations' position succinctly in a\nresponse to parliamentary questions on the Forest City development. He noted that countries are\n\n16 Zulfakar, Mergawati. \"Singapore Concern over Johor Project.\"\n17 \"Singapore wants more information on Johor project: MFA.\"\n18 Interview with Dr. Daniel Freiss\n\nobliged under UNCLOS \"not to cause harm or permit activities within their jurisdiction to cause\ntransboundary harm to their neighbors.\"19 Malaysia, in permitting large-scale reclamation activities\nso close to the international border has a duty to conduct an environmental impact assessment and\ninform Singapore of any expected transboundary damage. Singapore was not given prior\ninformation the Forest City project, so proceeded to convey its concerns through a variety of\nchannels. Masagos noted that they were worried that the reclamation would lead to an increase in\ncurrent velocity within the Straits of Johor, which would impact navigation and lead to increased\nerosion. This could undermine the second link bridge and threaten Singapore's shoreline. He also\nexpressed concern that water quality would suffer, which would impact fish farms and other water-\ndependent industries.\nThe sheer time scale of the development--estimated at 30 years--had also raised\neyebrows. The environment can sustain stress for limited periods of time and recover, he said, but\nnot anywhere near the time needed to build something so large. Even once the development was\ncompleted, there were concerns about pollution and the treatment of sewage from the project.\nFundamentally, it is impossible to host half a million people without significant impacts.20\n\nContinued Chronology:\nMalaysia seems to have heard Singapore's concerns loud and clear. Shortly thereafter, the\nDOE Johor issued a letter to Country Garden for \"mitigation\" work to be done on the reclamation\nsite. It is unclear what exactly this entailed, but it presumably reflects a growing pressure for\naccountability amid concerns from Singapore. With reclamation still underway, this was followed\nwith a stronger letter requesting a detailed environmental impact assessment. Since Johor had\npreviously issued a preliminary site approval, this about-face represents an acknowledgement that\n\n19 Yong, Charissa. \"KL has reassured Singapore over reclamation concerns: MFA.\"\n20 Interview with Dr. Daniel Friess\n\nMalaysia was finally forcing the project to play by the (environmental) rules.21 Malaysia eventually\nresponded to Singapore's request for clarification with \"preliminary general information\" and a\npromise to share other information as it became available. It also reiterated its commitment to\ninternational law.22\nThe Malaysian federal government did its best to patch relations with Singapore. The\nMalaysian Foreign Minister Seri Anifah Aman said that they had been engaging with Singapore and\nconfirmed his commitment to international law, particularly the 1982 United Nations Convention\non the Law of the Sea. He also acknowledged the history of land reclamation disputes between the\ntwo nations, and said that the federal DOE was in \"close consultation\" with the Johor government\nand developers, and that the foreign ministry was also involved.23 Tightening the screws on the\ndeveloper, the DOE sent an immediate notice to Country Garden to undertake a number of\nmitigating measures. This included immediate maintenance on the existing silt curtain, instillation\nof a new double-layered silt curtain, submission of a water quality monitoring report and the\nappointment of an environmental officer. In its most drastic move yet, the Malaysian government\nfinally issued a stop work order for the reclamation activities in mid-June.24\nBetween the period when the stop-work order was issued and the project's final approval in\nJanuary 2015, the project saw significant changes. Country Garden hired an environmental\nconsultant to perform a proper detailed environmental impact assessment, an expensive\nproposition that would take months to complete. The results from this and other studies motivated\na significant change in the landform of the project, from a single, monolithic island to a cluster of\nfour islands linked by bridges that would ostensibly leave the seagrass bed intact. The developer\neven agreed to establish the seagrass bed as a protected area. As a sign of Singapore's influence, the\n\n21 Dr. Nik and Associates Sdn. Bhd. P. 12\n22Zulkifli, Masagos. \"MFA Press Release: Transcript of Senior Minister of State for Foreign Affairs\n23 \"Johor Straits Project: KL affirms commitment to international law.\"\n24 Dr. Nik and Associates Sdn. Bhd. P. 12\n\nnew landform was also driven by a desire to remain at least 1 km from the international border.\nThe overall area of the project was reduced by a third.25\nCountry Garden was forced to treat those it stood to impact with more care and respect. It\nheld several community engagement meetings and gathered input from villagers through a number\nof local workshops. In addition, a new law was passed that taxed developers for every square foot\nof reclaimed land and used the proceeds to create a fund for fishermen impacted by the reclamation\nworks. Approximately $30 million was projected to be collected, including from projects already\nunderway. The Johor chief minister championed the program as evidence that Johor was taking\ncare of its fishermen.26\n\nAnalysis:\nMultiple people I interviewed believed firmly that the Malaysian government finally\ncapitulated and required an EIA only after Singapore complained to Malaysia through diplomatic\nchannels. Opposition politicians learned of the project at an early stage and immediately began\nprotesting it on their blogs, but in general their commentary was ignored. A handful even visited\nthe reclamation site to document what was happening there. Still, \"it was only after the Singaporean\ngovernment raised their concerns a number of times that a stop work order was issued in June\n2014\" according to DAP (an opposition party) Johor spokesman Cheo Yee How in an online\nstatement.27\nProf. Maketab Muhamad, a professor of hydrology I interviewed, concurred with this\nassessment: \"when Singapore made noise, they stopped.\"28 A village teacher living near the\nreclamation site, Bakhtiar Jaffar, came to about the same conclusion in a separate interview.29 He\n\n25 Ng, Pauline. \"Report on Forest City project gets nod from M'sian environment department.\"\n26 \"Johor to impose 30 sen payment for every sq ft of sea reclamation.\"\n27 How, Cheo Yee. \"Disagreement with the proposed Forest City project.\"\n28 Interview with Dr. Maketab Mohamad\n29 Interview with Bakhtiar Jaffar\n\nheld that Country Garden performed the environmental impact assessment solely because of\nSingapore's diplomacy. What can be said for certain is that media coverage of the case increased\nexponentially after Singapore made its stance clear. This may have had a secondary effect of\ngalvanizing opposition for the project within Malaysia itself. Singapore's concerns forced Malaysia\nto affirm its commitment to international law and cooperation, precedents for which had been\nestablished in the 2003 ITLOS dispute. Otherwise, Malaysia faced a blow to its credibility. While\nSingapore was clearly not the only factor influencing decisions on the project at the local and\nnational levels of government in Malaysia, its intervention almost certainly played a decisive role.\n\nSome of those who had a clear reason to protest remained relatively quiet. Fishermen I\ninterviewed (through an interpreter) were hesitant to protest even if the project would clearly\nthreaten their livelihoods since it was widely seen as the \"Sultan's project.\"30 Among the fishermen,\nthe Sultan was held in high regard for his role as a sort of local steward of Islam. A lack of\ninformation complicated the situation. County Garden never notified fishermen or villagers of the\ndramatic changes slated for their backyard. The developer had neglected to erect so much as a\nsingle sign announcing the project and presenting its vision. Until later, more complete reports\nemerged, villagers and fishermen never had a clear sense of what they would be protesting.\nTo me this is relatively clear evidence that a bottom-up, grassroots protest to the project\nwould have been ineffectual. There was clearly a wide base of discontent with the project and how\nit was presented, but the combined voices of opposition politicians, fishermen and\nenvironmentalists were not sufficient to attract any significant response. Singapore, by contrast,\nhad the political leverage to demand an immediate response. Even once the project became much\nmore widely known and protests had become more organized, the actors negotiating changes to the\nproject were all high-ranking officials in Singapore and Malaysia who acted mostly without regard\n\n30 Interview with Abu Talib bin Khamis\n\nto grassroots actors.31 The move to set up a fund for the fishermen is perhaps the most prominent\nexception.\nThis case presents as clear evidence as any for the integral role of politics in planning. As\nNorman Krumholtz notes, planners inevitably work within a web of political relationships, in this\ncase those of international relations.32 Country Garden, the developer of Forest City, lost substantial\ncontrol of its project as it became the focus of international diplomacy. As Singapore\n\"internationalized\" the matter, Country Garden suddenly had the Malaysian federal government--\nnot merely the Johor government--speaking on its behalf. The developer and its local partners\nfailed to account for their position within a broader political system in which another nation could\ndramatically turn the tables on their project's feasibility.\nFor local planners in Johor, especially at the Iskandar Regional Development Agency (IRDA)\ntasked with managing growth in the region, the episode was a reminder of their position within\nJohor's political system. The Forest City project was not in IRDA's master plan, but the agency was\nnonetheless forced to incorporate the project into its activities and predictions. Realizing the\nlimitations of its powers, IRDA made the best of the situation by serving a facilitation and\nconsultation role. It worked with the developer and state government by providing expertise and\nplanning assistance, helping integrate the project with their other initiatives. From interviews with\nsome of its staff, I learned that IRDA also provided a neutral forum for various agencies and\nstakeholders to communicate their priorities and concerns.33\nThe case also speaks to the conditions in which public sector institutions, namely the local\ngovernment of Johor and the Malaysian environmental ministry, do well. Singapore's intervention\nheld Malaysia externally accountable for its actions on the environment, even if the interventions\nwere self-interested. It is unlikely, for example, that the project would have undergone much\n\n31 Dr. Nik and Associates Sdn. Bhd.\n32 Krumholz, N. (2011). Making equity planning work: Leadership in the public sector. Ch 14\n33 Interview with Hana Badriah\n\nenvironmental review had Singapore not applied its own pressure. The project had the support of\nsome of Johor's most politically connected and powerful actors, who had the ability to speed the\nproject through its various regulatory hurdles. Media attention and broader scrutiny resulting from\nSingapore's intervention may have contributed indirectly to this accountability. Singapore\nconsistently couched its arguments in terms of international law, forcing Malaysia's institutions to\nrespond in kind if they were to maintain their legitimacy.\n\nComparison to Princess Cove Project:\nAnother project along the Straits of Johor by a rival Chinese developer provides a useful\npoint of comparison for the Forest City project. Princess Cove, a new luxury development by\nGuangzhou R&F, shares surprisingly many similarities with Forest City, but attracted relatively\nlittle controversy and engendered a muted response from Singapore. Princess Cove also involved\nextensive reclamation in the Straits that encroached on the international border with Singapore. In\nfact, Princess Cove planned to encroach even more than Forest City, leaving just 290 meters to the\nborder. Both projects targeted at affluent international buyers and positioned themselves as\naffordable luxury developments with quick access to Singapore. To this end, both were sited close\nto the key transportation connecting the island state to Malaysia. While Princess Cove was not\nnearly on the scale of Forest City, it also planned to bring thousands of new units to market and sold\nitself as a self-contained mixed-use community where residents could \"live, work and play.\"34\nEven the chronology of the development is nearly identical to Forest City. Land for the\nproject was acquired from the Sultan in a high-profile deal in which the Sultan stood to profit\nimmensely. The company rapidly received its initial approvals and shortly thereafter began\nreclamation. The same stop work order that halted reclamation on Forest City was also applied to\n\n34 Bei Shan, Ng. \"Country Garden, KPRJ plan massive reclamation development for luxury homes.\"\n\nPrincess Cove. The company was similarly forced to complete a DEIA to address environmental\nconcerns, but was eventually cleared to resume.35\nThe similarities--and outcomes--end there. Princess Cove involved a combination of both\nexisting and new land. They planned to develop the existing shoreline first, enabling them to get the\nproject off the ground even if the reclamation component encountered obstacles. As the\ndevelopment would proceed in stages, the reclaimed land would be allowed to settle for an\nextended period before being built upon. Unlike Forest City, Princess Cove was located in an area\nnear downtown Johor Bahru that was already quite built-up. It did not encroach on an\nenvironmentally sensitive area nor did it risk affecting the livelihoods of any large group of people.\nWith plans to reclaim only 37 ha total, well below the 50 ha threshold, it was at least partially\njustified in beginning reclamation without conducting a DEIA. There was not the sense that it\nattempted to exploit loopholes or otherwise use creative project phasing to skirt environmental\nregulations. Guangzhou R&F widely publicized their project and were never secretive about their\nintentions.\nWhile reclamation work was halted, construction continued elsewhere on the site.\nEnvironmental review resulted in few, if any significant changes to the project. Singapore had\nrequested additional information on the project, but that was the extent of their involvement.\nLooking forward, the project was scaled such that it would not require immense new investments\nin infrastructure. As Guangzhou R&F executive Dr. Jeffrey Yee told me, the stop work order had\nbeen just a \"hiccup\" in their operations. Asked what he thought of the Forest City project, he\ndescribed it as \"very aggressive,\" but was baffled as to why it involved new islands instead of simply\nextending the shoreline. He wondered whether they were trying to copy the palms of Dubai, but\nadmitted he \"couldn't appreciate the vision.\"36\n\n35 Lee, Marissa. \"Malaysia gives nod for reclamation project in Johor Strait to resume.\"\n36 Interview with Dr. Jeffrey Yee\n\nIronically, while developers are in competition with each other, their fates are also bound\ntogether. The high-profile failure of an overambitious development could discourage further\ninvestment and reduce the property value of neighboring developments. As Dr. Yee noted, \"One\nfailure could undermine the whole premise of development here.\"37\n\nConclusion:\nSingapore's influence in the Forest City case can hardly be overstated. What was a striking\nmega-development waived through its approvals process by the Sultan was suddenly subjected to\nthe full weight of environmental regulation. Having failed to account for cross-border politics, the\nproject emerged from the process scaled down and dramatically altered in form. Forest City's\nlocation near the border seemingly made all the difference. While other factors were definitely at\nplay, it is hard to imagine the project being subjected to the same scrutiny if it were a hundred\nkilometers up the coast. Arguably, Singapore's pressure made Malaysian institutions perform\nbetter, forced Malaysia to uphold its own laws and probably benefited thousands of residents near\nthe project. While a number of parties no doubt resented Singapore's interference, the affair was\nultimately an exercise in cooperation between the two nations. Unlike in 2003, neither party\nreferred or even threatened to refer the case to an international tribunal. The Forest City project\nwas resolved amicably and is currently under construction, but it will remain a case that holds\nmany lessons for trans-boundary development.\n\n37 Ibid.\n\nBibliography:\nBei Shan, Ng. \"Stormy Property Landscape.\" The Star (Malaysia). June 21, 2014\n<http://m.thestar.com.my/story.aspx?hl=Stormy+property+landscape&sec=business&id={539C8AC2-\nAF72-409D-B1A0-32F2C7158FBC}>\nTan, Ck. \"Malaysia-Singapore commute a daily grind.\" Nikkei Asian Review. March 12, 2015\n<http://asia.nikkei.com/magazine/20150312-ASEAN-Linked-lands-meshed-markets/On-the-\nCover/Malaysia-Singapore-commute-a-daily-grind>\nAw, Nigel. \"Johor Sultan 'initiated' Forest City mega project.\" Malaysiakini. May 23, 2015\n<http://www.malaysiakini.com/news/292541>\nChun Wai, Wong and Benjamin, Nelson. \"Sultan of Johor speaks his mind.\" The Star . March 18, 2015.\n<http://www.thestar.com.my/News/Nation/2015/03/18/Sultan-of-Johor-speaks-his-mind-Ruler-\ngives-a-special-no-holds-barred-interview-on-a-wide-range-of-t/>\n\nBei Shan, Ng. \"Country Garden, KPRJ plan massive reclamation development for luxury homes.\" The\nStar (Malaysia). March 19, 2014 <http://www.thestar.com.my/Business/Business-\nNews/2014/03/19/Country-Garden-KPRJ-plan-massive-reclamation-development-for-luxury-\nhomes/?style=biz>\nRao, Chandrasekhara. \"Separate Opinion\" ITLOS Case No. 12. October 8, 2013.\n<https://www.itlos.org/fileadmin/itlos/documents/cases/case_no_12/12_order_081003_sep_op_Ch_R\nao_en.pdf>\nNelso, Dolliver. \"Declaration of President Nelson\" ITLOS Case No. 12. October 8, 2013.\n<https://www.itlos.org/fileadmin/itlos/documents/cases/case_no_12/12_order_081003_dec_Nels\non_en.pdf>\n\nKoh, Tommy. \"The Land Reclamation Case: Thoughts and Reflections by Tommy Koh.\" 2006 Year\nBook of International Law. Volume X, 2006. 10 SYBIL 1-7 <https://lkyspp.nus.edu.sg/wp-\ncontent/uploads/2013/04/pa_tk_The-Land-Reclamation-Case-Thoughts-and-Reflections-\n_2007.pdf>\nDr. Nik and Associates Sdn. Bhd. \"The Proposed Forest City Island Reclamation and Mixed\nDevelopment, Johor: Detailed Environmental Impact Assessment: Executive Summary.\" Country\nGarden Pacificview. October 2014.\n\nHow, Cheo Yee. \"Disagreement with the proposed Forest City project.\" DAP Malaysia. September 22,\n2014.<http://dapmalaysia.org/en/statements/2014/09/22/19174/>\n\nZulfakar, Mergawati. \"Singapore Concern over Johor Project.\" The Star (Malaysia). June 21, 2014.\n<http://www.thestar.com.my/News/Nation/2014/06/21/Spore-concern-over-Johor-project-Land-\nreclamation-work-near-Second-Link-may-have-potential-transboun/>\n\n\"Land reclamation project linked to royalty set to ruffle Malaysia-Singapore ties, says report.\" The\nMalaysian Insider. May 30, 2014. < https://sg.news.yahoo.com/land-reclamation-project-linked-\nroyalty-set-ruffle-malaysia-051032013.html>\n\n\"Singapore wants more information on Johor project: MFA.\" The Star (Malaysia). Jun 22, 2014.\n<http://news.asiaone.com/news/singapore/singapore-wants-more-information-johor-project-mfa>\n\nYong, Charissa. \"KL has reassured Singapore over reclamation concerns: MFA.\" The Straits Times.\nJuly 10, 2014. <http://www.straitstimes.com/singapore/kl-has-reassured-singapore-over-\nreclamation-concerns-mfa>\nZulkifli, Masagos. \"MFA Press Release: Transcript of Senior Minister of State for Foreign Affairs\nMasagos Zulkfli's reply to Parliamentary questions.\" Singapore Ministry of Foreign Affairs. July 9,\n2014.\n<http://www.mfa.gov.sg/content/mfa/media_centre/press_room/pr/2014/201407/press_20140709.\nprintable.html?status=1>\n\n\"Johor Straits Project: KL affirms commitment to international law.\" Today Online (Singapore). June\n26, 2014. <http://www.todayonline.com/world/asia/johor-straits-project-kl-affirms-commitment-\ninternational-law>\nNg, Pauline. \"Report on Forest City project gets nod from M'sian environment department.\" The\nBusiness Times (Singapore). January 14, 2015. <http://www.businesstimes.com.sg/real-\nestate/report-on-forest-city-project-gets-nod-from-msian-environment-department>\n\n\"Johor to impose 30 sen payment for every sq ft of sea reclamation.\" The Star (Malaysia). July 6,\n2014. <http://www.thestar.com.my/News/Nation/2014/07/06/Johor-sea-reclamation/>\n\nKrumholz, N. (2011). Making equity planning work: Leadership in the public sector. Ch 14\n\nLee, Marissa. \"Malaysia gives nod for reclamation project in Johor Strait to resume.\" The Straits\nTimes. January 15, 2015. <http://www.straitstimes.com/business/malaysia-gives-nod-for-\nreclamation-project-in-johor-strait-to-resume>\n\nInterviews:\nBadriah, Hana Zulkifli. In-person interview. 19 Aug. 2015.\nMaketab, Mohamad. In-person interview. 6 Aug. 2015.\nJaffar, Bakhtiar. In-person interview. 1 Aug. 2015.\nBin Khamis, Abu Talib. In-person interview. 15 Aug. 2015.\nYee, Jeffrey. In-person interview. 13 Aug. 2015.\nFreiss, Daniel. In-person interview. 14 Jul. 2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n11.S940 Development, Planning, and Implementation: The Dialectic of Theory and Practice\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Urban Villages: Lessons for Village-Centric Urban Growth",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-s940-development-planning-and-implementation-the-dialectic-of-theory-and-practice-fall-2015/fdf95347c45dcf07ce0c636c638431bb_MIT11_S940F15_UrbanVill.pdf",
      "content": "1!\nMayank Ojha\nDevelopment, planning & implementation,\nThe dialectic of theory & practice\n5 December 2015\nUrban Villages\nLessons for village-centric urban growth\nABSTRACT\nThe paper analyses the construct of village as opposed to a city and agricultural\nland, as a result of prevalent land systems and revenue mechanisms in the Indian\nstate of Punjab. It traces the evolution of urban villages in Chandigarh as\nexcluded places from the realm of planning, since the colonial era to its nested\nco-existence within the urban fabric. Reflecting upon the lessons learnt in the\nprocess - the potentials offered and challenges faced, it explains factors\nresponsible for their unique development trajectory. The paper concludes with\nsuggestions for an alternative development pathway which can enable a smooth\ntransition of the place from a rural, agricultural settlement to an integrated node\nwithin the city.\n(c) Google. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n!\nBACKGROUND - VILLAGES & PLANNING\nThe delineation of villages in northern-Indian provinces, with particular respect to the state's\nplanning apparatuses, can be traced back to pre-colonial times. This process was a result of\nsubjecting the existing agrarian settlements to changing land systems and revenue mechanisms.\nAround the sixteenth century, the Mughals had introduced a patwar system for the assessment\nand procurement of revenue from the agricultural produce. A patwari - an appointed village\naccountant, was entrusted with the task of surveying and maintaining a village field map, known\nas a shajra, along with a field register (khasra). The latter bore the names of the proprietor and\ncultivating labor, the crops grown and means of irrigation along with demarcations of individual\nproperties (Powell, Henry. 1892: p39). After the annexation of Punjab by the British, the patwar\nsystem was adopted for its extensive reach and the quality of data furnished by the patwaris.\nOver the second half of the nineteenth century, modern cadastral survey methods were employed\nwhile the process and terminologies of the system were institutionalised by the Punjab Land\nRevenue Act (XVII) of 1887 and continue to be in existence till date.\nWithin these territories, the inhabited areas of a village were charted as excluded spaces\nthroughout British rule of India as well as in the decades following it's independence in 1947. As\nthe primary objective of the colonial government was to maximise its revenue from the\nfarmlands, a decentralised control was exercised over the villages with the help of cartographic\nexercises and the patwar system. In their documentation of land systems during British India,\nPowell & Henry (1892: p557) take note of the villages as being exempt from the levying of land\nrevenue. Human habitation itself was confined within a rigid boundary, defined by the Revenue\nOfficer in conjunction with the village patwari, preventing any construction related to non\n\n!\nfarming activities beyond this limit. No mapping of properties within these boundaries was\nconducted, which included privately owned land as well as land for village commons. In the\nyears following the independence from British rule, and the consequent partitioning of the Punjab\nprovince, land reforms were executed to consolidate and defragment landholdings. Agricultural\nproperties were redrawn, oriented to cardinal directions, and surplus land was allocated to tenant\nfarmers and refugees from West Punjab. Even though the village limits were expanded, the young\nnation's government followed in its predecessors footsteps in viewing the villages as enclaves\nwithin the revenue generating land.\nTHE MODERNISATION PROJECT\nThe post-independence period gave rise to a rich debate with regards to the sites where the state\nshould focus its energies, both as a nation-building measure as well as for its attempts to trigger\nsocial modernisation. In Hind Swaraj, Gandhi (1939) envisioned a modern India from a\nperspective of the villages, as spaces with resilience and a potential for development. For him,\ncities were connected with everything he regarded as cancerous for the Indian civilisation -\nmodern machinery, politics; even as his utopian visions required modern science and technology\nto \"refashion\" the village of his dreams. Nehru, India's first prime minister on the other hand\napproached the 'city' and planned urbanisation as a catalyst for modernisation. Even though he\ndid believe that modernisation of villages hold the key to restrict rural to urban migration, his\nsites for development were neither located in small villages, nor in major cities, but in the\nrelations between villages and cities (Prakash, 2002: p3). To affect these relations, he sought\nstate-sponsored, large scale planning as an instrument to address these issues. Furthermore, as\nGlover (2012) argues, these ideas fostered a distinction between 'improvement' and\n'development' with regards to the sites in consideration, the village and a city, respectively. He\n\n!\nwrites, \"Improvement is addressed communities tied together through bonds of kindship, culture\nand shared history in a particular place; development, conversely, is concerned with the proper\ndistribution of 'beings [and activities] on a territory' in accord with normative standards and\ngoals.\" It was Nehru's socialist ideology and his belief in planned 'development' that came to\ndominate the chosen paths for independent India's modernisation project in the second half of the\ntwentieth century.\nThe need for a new administrative capital for the eastern half of the Punjab province provided an\nopportunity for Nehru to realise and demonstrate this ideology. In his oft quoted speech, he\nwanted it to be \"a new city, unfettered by the past, a symbol of the nation's faith in the\nfuture\" (Prakash, 2013: 12-52). Le Corbusier, the chosen architect for the new city of\nChandigarh, had concomitantly asserted the role of experts in addressing the goals of modern\nurbanism, as highlighted in the Athens Charter (1943) along with other members of CIAM in\nearly twentieth century. 1 Nehru's imperatives meshed perfectly with Corbusier's normative\nvisions for a modern city (Perera, 2004: p179). Chandigarh as well as various other state-\nsponsored mega-projects - dams, steel plants and their townships, were thus developed within the\nideological framework that these \"modern temples\", urbanisation and industrialisation would\nusher a new age for India.\nThe rationalist planning of the first phase of Chandigarh embodied the imperatives of Nehru and\nCorbusier in the form of a 'state paternalism'. Sarin (1982: p58) discusses the extent of\ndevelopmental and regulatory frameworks proposed by Corbusier's team for a total control of the\n1 The Athens Charter was a manifesto about urban planning based upon the works of Le Corbusier and\nmembers of the Congres International d'Architecture Moderne (CIAM). It was highly influential in post-\nWWII new town developments around the world.\n\n!\nstate in matters of urbanisation. According to Corbusier, she quotes, \"all land within the plan area\nshould be acquired, developed and sold by the government.\" The objective put forth in support\nwas to prevent land speculation and accumulation of wealth by private landowners and restrict\nunregulated urban growth. The master plan further required the state to exercise its legislative\npowers to ensure conformity in accordance with the designs. A semi-autonomous, non-elected\nparastatal in the form of a development authority - the Capital Project Organisation (CPO), was\ncreated to develop and manage the city. Also, a Capital of Punjab (Development & Regulation)\nAct of 1952 was instituted, vesting the Chief Administrator of the CPO with powers to specify\nzoning, legislate and enforce building controls and bye-laws, and in related matters of\nurbanisation. Consequently the CPO, through its exercise of eminent domain, acquired sixteen\nexisting agricultural villages with their inhabitants compensated and resettled in other peripheral\nvillages.\nCONTESTING 'RATIONALITY'\nWhile Prakash (2002: p5) argues that such a power granted to technocratic elites and experts\nremoved state-led \"planning\" from the scrutiny of democratic politics, the evolution of 'urban\nvillages' in Chandigarh signify the opposite. As the subsequent phases of the new city were being\ndeveloped, inhabitants of four villages located at its then southern periphery came together to\nform a pind bachao (save the village) committee in 1969. It led massive protests against land\nacquisitions and demanded their rights to retain their homesteads and possessions, places of\nworship and community areas, which enabled their communities to have a shared identity. The\nstate was confronted with a choice between pursuing its modernisation project for aspiring\nsubjects, migrating from other rural areas to a growing city and village communities, who had\nremained excluded from the same. The numerical dominance of the communities in a democratic\n\n!\nsetup allowed them to resist the acquisition of the non-revenue areas within the village\nboundaries, although their farmlands were nevertheless acquired for urban development.\nThe confrontation between the modernisation project with traditional forms of settlement got\nmanifested on various fronts in the 'urban village' typology - as a by-product of rationalist\nplanning and a space between the extremes of formality and informality. Roy (2012: p149) in her\npaper on planning and informality argues that the legal apparatus of the state exercises its\nreproduces its power by deeming which spaces and processes are formal or informal, as well as\nwhat can be planned or is unplannable.\nFig. 1: Way finding signage at the entry point for Sector 45 showing Burail as an enclave, its existence\nunacknowledged by the planners.\n\n!\nSubsequent generations of government employed town planners and urban developers had\nencountered a novel situation, which contradicted the theories of modern urbanism as propagated\nby Corbusier and were internalised by his local team. In their attempt to arrive at a solution, a\nnew periphery for the village was demarcated with the construction of a circumferential avenue.\nIt once again repeated the process wherein the state's planning focus was limited to territories\nbeyond the rural enclave. Even though the village physically became a contiguous part of the\nurban fabric, the Capital of Punjab Act, which was the prime instrument in regulating growth of\nthe city, was not extended to encompass areas of the village within the revised boundary. The\nsuspension of state legislature with respect to planning and development thus triggered an\nunregulated, accelerated village urbanisation process with the logics of the economy governing\nthe resultant form and organisation of the 'new village'.\nThe following section analyses some primary, inter-related causes along with their desired and\nundesired implications emerging out of this nesting of traditional village settlements within a\nplanned territory. It focuses on village Burail, the oldest and largest among all villages to which a\nmajority of the pind bachao committee leadership belonged.\nA. SUPPLY SIDE GAPS IN AFFORDABLE HOUSING\nThe modernist rational planning envisioned a city as a finite organism, with scientific, linear\nprojections for population growth while the planning for development strived to curtail deviations\nand non-linearities. In Chandigarh's master plan, the planners had devised a system of state\nowned housing for employees of the administration to be appended by privately developed\nhousing on long-term leased lots to be governed by the market. However, unpredictable influxes\nof migrating populations, a second trifurcation of Punjab leading to the city becoming an\n\n!\nadministrative capital of three territories, resulted in an acute shortage of housing in terms of\nquantity and diversity. While the already overburdened state owned housing stock faced a surge\nof new applicants, property prices in the privately developed areas rapidly increased beyond the\nreach of middle and lower income groups. The latter especially were left with no choice other\nthan having to reside in temporary squatter settlements or labour colonies, and wait to become\neligible in order to apply for housing schemes for economically weaker sections.\nBurail in such a scenario acted as a refuge to absorb the development pressures, allowing time for\nthe authorities to raise the housing stock while preventing a proliferation and consolidation of\nslum settlements. It was favoured over the latter for it provided access to goods and services in its\nexisting marketplaces, basic utilities as well as a close-knit community environment. Dormitories\nand tenements constructed by village inhabitants offered a well located supply of low cost rental\nhousing, in proximity of places of employment without the need to depend on a still developing\npublic transport system.\nB. ECONOMIC COMPETITIVENESS\nWhile the inclusion of Burail within the urban system spawned a host of economic activities,\noperating from within its boundaries, changing dynamics in the planned parts as external stimuli,\nthe village witnessed several transformations in its form and on-going processes. Prior to urban\ndevelopment in the region, the villages formed a constellation of families mostly engaged in\nagriculture related activities. Its demographic mix primarily comprised of landowners and\nagricultural labour. With the acquisition of the farmlands and the loss of a source of regular\nincome, entrepreneurial individuals set up trades and services to profit from a readily available\nurban market in its surroundings. Initially, these comprised of dairy farms within homesteads,\nsmall-scale workshops providing carpentry, metal related services aiding in the construction\n\n!\nactivity, and storage warehouses for building material. Over the years, a growing number of\nbovines in the middle of the city led to traffic accidents, and contestations between village and\ncity residents as green spaces meant for recreational activities were used as grazing fields.\nEnforced bans on rearing cattle within urban villages once again stripped off its inhabitants of\ntheir livelihoods. However, this time they capitalised on the difference in land values and\ninvested in construction of retail, office spaces and bed-and-breakfast hotels. A majority of back-\nend processing jobs for the city's enterprises moved their base to Burail and other villages to save\non overhead costs and benefit from the readily available labour. While the surrounding 'formal'\nfabric which remained adherent to the masterplan and its zoning norms, Burail in contrast,\npropelled by individual actions, constantly regenerated itself, and together with other villages\nacted as a network of specialised commercial hubs.\nC. DIFFERENCE IN REGULATORY ENVIRONMENT\nA lack of stringent regulations to which the surrounding territory was subjected, catalysed the\nadaptability of urban villages and generated flows of excluded people and processes towards\nthese enclaves. In compliance with the principles of CIAM, the Capital of Punjab Act empowered\nlocal authorities to control urban growth in the city with the help of architectural controls, land-\nuse designations and density caps. It enforced a pavilionisation of programs, referring to the\nAthens Charter where the idea was propagated, for every activity to be housed in a separate\nbuilding. Shane (2005: 47) takes note that such an ideology owes its lineage to the design of\nmedical facilities, hospitals and quarantine areas. Any attempt for its application at an urban scale\nrequires powerful control and implementation, yet it would fail in scope due to its spatial and\ntemporal bounds. In Chandigarh, activities and processes deemed non-conforming by the\ngoverning legislatures for their co-existence with the city's fabric, flowed into the villages and\n\n!\ntransformed their physical and social environment. Micro-industries, warehouses, workshops,\nrepair centres and motor garages - posing nuisance in terms of air and noise pollution to the\nmodern urban residents, began operating out of the densely populated, unplanned village. At the\nsame time, migrant labour, urban poor as well as people indulging in activities that were\nunacceptable to the citizens sought refuge in these areas.\nTHE CHALLENGES\nThese processes and flows strengthened over time in the form of a positive feedback loop, as\ncheap labour and economic activities attracted each other. As a result, Burail as it exists today\nharboured, its own set of issues emerging from its unique trajectory of urbanisation and the\ninterplay of forces responsible for it. A 'free-for-all' style of bottom-up development meant that\nfootfalls, vehicular accessibility, lot sizes and the topography governed the density and land-use\nwithin its boundaries. Most of the commercial activities agglomerated in specialised ribbons\nalong the external fringe of Burail, interfacing with the surrounding neighbourhoods. The\nspillover from these logistics intensive activities led to severe traffic congestions and prevents\nentry of vehicles other than cycles or two-wheelers within the village, further restricted by its\nnarrow by-lanes and overcrowding. Haphazard developments and incremental additions,\nmodifications to the built fabric pose fire hazards and lack structural stability. The fragile\ncommunity fabric of the village, organised around chaupals, public spaces for socio-cultural\ngatherings, celebrations constructed and maintained by communities themselves, was destructed\nby an onslaught of migrants and commercial activities. Moreover, most of the its original\ninhabitants who fought against its demolition eventually moved out and settled in other parts of\nthe city as Burail in popular perception came to be associated with chaos, unsanitary environment\n- a place for migrants, the urban poor, as well as unlawful citizens.\n\n!\nSuch concerns about the village degrading into an urban backyard, taking on slum-like\ncharacteristics were not only limited to its average residents, but also members of the pind\nbachao committee leadership. My interactions with a few members who still reside in the village\nrevealed their disappointment with the way things unfolded. They mentioned that in retrospect,\nthey would have rather had the entire village being acquired and demolished than fight for its\nexistence in its current state. They had highlighted these concerns with the city's authorities\nwhich led to extension of municipal services over unacquired village areas in 1996 and framing\nof a separate village by-laws around 2010, to regulate growth within these areas. However, the\nenforcement of the latter is remains a major challenge and is close to impossible, as the village\nnow is contested between multiple stakeholders, far removed from the erstwhile homogenous,\nclose-knit agricultural community which took part in the civil society movement. Vested interests\nof business communities who want to exploit its legislative status and location as a prime real\nestate in an ever growing city resist such changes, whereas immigrant workers, who now happen\nto be in a numerical superiority, are ready to protest against changes fearing that a triggered\ngentrification process will drive them out.\nTAKE-AWAYS\nThe stalemate situation in terms of development of the village area and addressing issues it faces\ncurrently, contradicts both the imperatives of the community to resist acquisition and those of the\nstate that employs planning as an instrument of urban development. As it became a norm for\nplanners to only acquire farmlands around villages, community groups inhabiting them and\nelected village local bodies ceased to engage with planning authorities. This has resulted in a\nspatio-temporal void wherein the development trajectory of village sites in urban peripheries\n2 The primary research work including face-to-face interviews with residents of Burail was undertaken as\npart of my undergraduate thesis project, 2011.\n\n!\ninevitably encounters a phase when rapid, haphazard growth takes place in the absence of\nsupporting infrastructure, up until the village is surrounded by newer developments and it\nreceives a municipal status. At this point, owing to an earlier attitude of apathy by the authorities\nand the village not being a focus of urbanism, a planning paralyses prevents them for intervening.\nThe case of urban villages in Chandigarh offers important lessons for planners and development\nauthorities as they seek to plan for urban growth and development in regions all over the\ndeveloping world, where dense pockets of existing agricultural villages surround urban centres.\nThe typology itself is essentially a post-modern condition that emerges from the rationalist\nplanning methodology, specifically associated with the modernist ideas of town planning which\nsolely focuses on physical planning (Teotia. 2013: p2). In the Indian context, even though this\nmodel has fallen out of favour due to growing anti-acquisition movements for urban\ndevelopment, and with the introduction of land-pooling mechanisms for town planning schemes,\nthe juxtaposition of new developments against existing village fabric continues to carve out urban\nvillages. This is evident in more recent developments, both in new cities - administrative capitals\nor industrial cities, as well as satellite towns and expansion plans for existing cities.\nThe co-existence of villages in an urbanising territory stabilises the urban system. As explained\nearlier, these areas are repositories absorbing the in-migrating population, offer commercial\nservices and goods as well as affordable housing. It also allows for the local population to\nparticipate in the development process and directly benefit from urbanisation. While the\nchallenges emerging in process need to be addressed, the planning authorities to develop\nstrategies for incorporating such potentials offered as lessons for future urbanisation. The debate\nbetween villages as sites for equitable, inclusive development - and a focus of state apparatuses,\n\n!\nhas been reinvigorated - with national level policies such as PURA (Providing urban amenities to\nrural areas) and USP (Unified settlement planning). A successful implementation of these\npolicies, especially for peripheral villages in urbanising territories to benefit from them, requires\nthat the development authorities acknowledge their potentials and expand their scope to include\nthese sites within their purview.\nALTERNATE DEVELOPMENT PATHWAYS\nIn conclusion, the analysis of the urban villages phenomena warrants the need to explore\nalternatives which exploit the potentials it offers and addresses the consequent challenges that\nshall be faced. One such alternative applicable in the context of expanding cities and newer urban\ndevelopments alike, is to enable the development of urban villages as a network of integrated\nnodes specialising in different programs and catering to a diverse mix of urban residents. This can\nbe achieved by a multi-stage process, a combination of participatory, incremental planning\ninitiatives within a larger, comprehensive framework for development. A foremost requirement\nfor exploring alternative trajectories mandates approaching the existing agrarian settlements as\n'seeds' for future urbanisation, rather than as 'other' spaces - outside the realms of urban planning\nand development.\nStage One: The first step would be to identify the critical stage itself, when a peripheral village\nundergoes stimulated transformations in response to urbanisation in the territory. For the\nauthorities to identify this stage, charting of territories beyond the urban municipal boundaries\nneeds to be undertaken. Spatial analytics mapping physical growth, census data on demographics\nand employment statistics - such as increasing ratio of non-agricultural workers to agricultural\nworkers, etc. can aid the pre-transformation charting processes.\n\n!\nStage Two: At this stage, the city authorities should prepare a 'decision tree', either internally or\nwith the help of specialised consultants. Based on the existing socio-physical conditions of the\nvillage - housing stock, circulation patterns, demographic mix, etc., the decision tree would\ninclude potential trajectories to arrive at a set of medium-term goals. The latter would conform to\nthe larger, prospective development plan which is prepared by development authorities for 15-20\nyear terms. While the goals can vary between density parameters, such as - high-density new\ndevelopment involving voluntary relocation, partial redevelopment, or medium-density in-situ\ndevelopments; socio-cultural specialisations or commercial hubs, etc.; the trajectories may\ncomprise of policy frameworks and role of various stakeholders, financing strategies, etc.\nStage Three: Engaging with the communities and their elected bodies, city authorities can then\ndiscuss the decision tree and the choice of a trajectory which the community deems suitable with\nregards to their aspirations.\nStage Four: Based on the selected trajectory, the city planners may then plan for newer\ndevelopments in the areas surrounding the village in ways that shall foster symbiotic relations\nbetween the village inhabitants and newly settled residents. This must involve development of\ncomplementary programs - if village community opts for a high-density residential development,\nthe surrounding area could include more commercial areas, etc. At the same time, development of\nutility networks and infrastructure to support the physical growth of the village and its future\nneeds should be instigated.\n\n!\nREFERENCES\nActs & legislatures: (India), Punjab, and Sir Charles Lewis Tupper. Punjab Customary Law. Office of the\nsuperintendent of government printing, 1881.\nBaden-Powell, Baden Henry. \"The Land Systems of British India: Book 3. The System of Village of Mahai\nSettlements.\" Clarendon Press, 1892.\nGandhi, Mohandas Karamchand. \"Hind Swaraj, Or, Indian Home Rule.\" Ahmedabad: Navajivan Publish\ning House, 1939.\nGlover, William J. \"The Troubled Passage from 'village Communities' to Planned New Town Develop\nments in Mid-Twentieth-Century South Asia.\" Urban History 39, no. 01 (February 2012): 108-27. doi:\n10.1017/S0963926811000800.\nPerera, Nihal. \"Contesting Visions: Hybridity, Liminality and Authorship of the Chandigarh Plan.\" Plan\nning Perspectives 19, no. 2 (April 2004): 175-99. doi:10.1080/0266543042000192466.\nPrakash, Gyan. \"The Urban Turn.\" Sarai Reader 2 (2002): 2-7.\nPrakash, Vikramaditya. \"Many Names of Chandigarh.\" In Transcultural Modernisms, 12:58-59. Publica\ntions Series of the Academy of Fine Arts Vienna. Sternberg Press, 2013.\nRoy, Ananya. \"Urban Informality: Toward an Epistemology of Planning.\" Journal of the American Plan\nning Association 71, no. 2 (June 30, 2005): 147-58. doi:10.1080/01944360508976689.\nSarin, Madhu. \"Urban Planning in the Third World: The Chandigarh Experience.\" London : Bronx, N.Y:\nMansell Pub. ; Distributed in the U.S. and Canada by H.W. Wilson Co, 1982.\nShane, David Grahame. Recombinant Urbanism: Conceptual Modeling in Architecture, Urban Design,\nand City Theory. Wiley Academy, UK [u.a.], 2005.\nTeotia, Manoj Kumar. \"Planning for the Urban Poor in Northwestern India: Emerging Policies, Practices\nand Issues (A Case Study of Chandigarh).\" Centre for Research in Rural and Industrial Development,\nMarch 2013.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n11.S940 Development, Planning, and Implementation: The Dialectic of Theory and Practice\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}