{
  "course_name": "Developing Musical Structures",
  "course_description": "No description found.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music Performance",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music Performance",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nSyllabus (\nPDF\n)\n\n\"When we go about the spontaneous, intuitive performance of the actions of everyday life, we show ourselves to be knowledgeable in a special way. Often we cannot say what it is that we know. When we try to describe it we find ourselves at a loss, or we produce descriptions that are obviously inappropriate. Our knowing is ordinarily tacit, implicit in our patterns of action and in our feel for the stuff with which we are dealing. It seems right to say that our knowledge is in our action.\"\n\nDon Schon:\nThe Reflective Practitioner\n\n\"The secret of what anything means to us depends on how we've connected it to all the other things we know. That's why it's almost always wrong to seek the \"real meaning\" of anything. A thing with just one meaning has scarcely any meaning at all.\n\nRich meaning-networks, however, give you many different ways to go: if you can't solve a problem one way, you can try another. True, too many indiscriminate connections will turn your mind to mush. But well-connected meaning structures let you turn ideas around in your mind, to consider alternatives and envision things from many perspectives until you find one that works. And that's what we mean by thinking!\"\n\nMarvin Minsky:\nSociety of Mind\n\nTexts\n\nBamberger, J.\nDeveloping Musical Intuitions.\nNew York: Oxford University Press, 2000. (DMI)\n\nBamberger, J.\nThe Mind Behind the Musical Ear.\nCambridge: Harvard University Press, 1995. (MBME)\n\nIntroduction\n\nThe goal of this class is practical: to interrogate,\nmake explicit\n, and thus to develop the powerful musical intuitions that are at work as you make sense of the music all around you.\n\nThe title of the course is intended as a three-way pun. Developing Musical Structures means:\n\nyour own musical compositions as developing, emergent structures.\n\ncomplex musical compositions developing, evolving, becoming, structuring over time.\n\nmental musical structures developing and learning as they guide musical intuitions.\n\nThese developing musical structures will be pursued through four kinds of activities. While the primary focus may be on only one activity at any given moment, the others will always be hovering nearby:\n\nTo carry out this agenda, you will be involved in four closely interrelated activities and the questions they will raise. The process is modeled (as much as possible) on the kind of learning that occurs quite naturally in informal settings through observation, questioning, practicing and experimenting, probing for and trying to account for how and why an object, a system, or a living organism behaves as it does.\n\nExperiments in musical composition:\n\nComposition projects facilitated by the computer music environment,\nImpromptu\n, will be a source for interrogating your own musical intuitions. You will explore rhythmic structuring, melodic structuring, scales, intervals, harmony, structural hierarchy, and developmental transformations. Students' compositions will be discussed and performed in class.\n\n**Alternative approaches to musical analysis:\n\n**Differing approaches to analysis of complex musical works will be considered and actively tested.\n\nWhat are musical objects of attention? How can you tell?\n\nWhat features and relations shape the boundaries of musical entities? How are these influenced by context?\n\nHow can we account for why people hear \"the same\" piece differently?\n\nHow does analysis influence \"hearings?\"\n\nIs there such a thing as an \"appropriate hearing\" of a given composition?\n\nMusical cognition and development:\n\nWhat does music cognition research tell us - for instance:\n\nHow does musical intuition/knowledge develop and change?\n\nDoes musical development relate to development in other fields?\n\nIs there a \"musical intelligence?\"\n\nWhat musical parameters are given preference at differing stages of musical development and in differing styles of music?\n\nHow do the above concerns interact with/influence musical?\n\n**Representation:\n\n**Notations, graphics, computer languages and procedural descriptions:\n\nWhat kinds of entities and relations does each capture?\n\nHow does each reveal or conceal, what we hear - even what we believe to exist as musical objects?\n\nWhy do descriptions (notations, analytic categories) often obscure\nwhat\nis intuitively heard and\nhow\nwe intuitively perform?\n\nWhat are the differences between \"units of perception\" and \"units of description?\"\n\nThe semester culminates in a final project. Students may choose one of three types, a combination thereof, or propose an original design:\n\nAn experimental research project (cognition, perception, meaning-making)\n\nA musical analysis project\n\nA performance and analysis of a composition\n\nThe Final Project\n\nThe Final Project will bring together all the other activities in the course. The project should be chosen early on in the semester with its evolution an essential part of the work. For instance:\n\nIf you choose an experimental research project, your questions and your methodology should be developed by mid-term leaving time to carry out the project during the second part of the semester.\n\nIf you choose to analyze and compare recorded performances of a piece, the piece should be chosen early in the semester, so that you can trace the development of questions that arise.\n\nFor students who choose to study and perform a piece, the piece you choose (in consultation with the instructor) should be one that you find interesting and challenging, and one that is sufficiently complex so as to require thoughtful analysis. Keeping a log of your progress in learning your piece, you will note the problems and puzzles you confront as you go along, how they are resolved, new insights that occur along the way, and how your \"hearing\" of the piece changes. This log\ntogether with an analysis of the piece\nwill be the bases for your final paper.\n\nLog Keeping\n\nThroughout the semester you will be reminded to keep a running log of your work. It's purpose is to help you reflect on your work - for instance, to interrogate your decision-making in composing or re-composing, to pay attention to surprises, to question and try to account for your responses.\n\nLooking for patterns and generalizations as derived from observing the results of your work is particularly important when going on to the listening examples. For instance, paying attention to commonly recurring organizing patterns, you will begin to notice that larger and more complex works are elaborations of the same structural aspects you have found in the simple tunes you have been working with.",
  "files": [
    {
      "category": "Resource",
      "title": "ambrosian.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-113-developing-musical-structures-fall-2002/e9bd367e1659fa56b5ee4446be3d092b_ambrosian.pdf",
      "content": "AMBROSIAN\n(My comments in italics and underlinings also mine.)\nThe final composition was made using the tuneblocks\nnamed Ambrosian. I started by listening to each of the\nblocks once and then going through each of them a\nsecond time. During this second run-through, I analyzed\npossible positions and combinations that each block\ncould fill. I noticed how blocks 1 and 3 began with the\nsame three notes. (?) I thought perhaps that they could\nmake a combination together. I also noticed that, of\nthe five e blocks, only block 3 seemed to make a\nsuitable ending. Therefore, I tentatively called block\n3 my ending block. I thought that both blocks 2 and 4\nwould probably be middle blocks and that block 5 seemed\nto make a good beginning.\nAfter listening to the blocks, I noticed how they all\nshared the same tempo. (Actually, set of durations or\n\"rhythm\"). By this I mean, the duration between each of\nthe notes was equal for all the notes in every\ntuneblock (Yes). This actually made the song seem very\nmonotonous and boring. This feeling of monotony was\nprobably strengthened by my observations that after\nlooking at the pitch contour, I saw that none of the\nblocks seemed to have any large jumps down or up. This\ngave the feeling that the tune sort of hovered around\none note and the constant stepwise movement was\nactually too boring for my ears. Continual stepwise\nmovement (or something close to it) left my ears\nwanting some excitement and actually needing to hear\njumps to widely spaced apart pitches. In contrast to\nthe previous pieces I constructed, where I actually\nlooked for stepwise movement to calm down a song, the\nconstant stepwise movement of these tuneblocks had just\nbecome too boring.\n(Really very clear and close observations and good\ncomparisons. You have grabbed onto features that you\n\"need\" for a tune that you like.)\nI decided to start with the combination of block 5\ngoing to block 1. I liked the sound of block 5 as a\n\nbeginning because it had a wide range, which I seem to\nlean towards when choosing a beginning. I guess to my\nears, the sense of starting something is best portrayed\nwith a block which seems to go in different directions-\n-up and down. However, I also noticed that block 1 was\na sort of incomplete block. It sounded like it wanted\nto go somewhere but was stopped abruptly halfway there.\nI considered this block to be a sort of question that\nneeded an answer.\n(Good description. We'll need to think about what the\nrelations are that generate that function/feeling. Did\nyou notice that 5 is like a continuation and expansion\nof 1?)\nSo to utilize this potential call and answer format, I\nplaced block 1 before block 5. I decided to repeat\nblock 1 because the repetition seemed to give it more\nof a sense of a half finished idea. At this point I\nwanted to break up the monotony of the tempo, so I\ndecided to modify block 1 so that the fifth note was\nheld for the same amount of time as the first four\nnotes combined. Immediately, this changed the character\nof the piece and placed an emphasis on the first note\nand fifth note of the block. The long holding of the\nnote also added to the anticipation I had of hearing\nsomething else. In my ears, I felt that there should be\nsomething that answered the call of the repeated\nblocks. Block 5 was a very good start to the answer\nbecause it began the same as block 1 but instead of\nstopping halfway through, it continued forward and\nseemed to finally get somewhere.\n(See comment, above--you got it. Also, your new 1 is\nequal in total time to block 5!(8 beats)).\nThe next thing I did was try and find the continuation\nof the answer. I tried both blocks 2 and 4 and they\nboth sounded correct after block 5. I didn't like the\nway block 3 sounded because it felt too much like the\nending of the piece and I didn't feel that my song\ncould finish there because there had been no\ndevelopment yet. I decided to keep block 2 after block\n5. Block 5 seemed to naturally divide into groups of 4\n\nnotes with the strong beat being on the 1st and 5th\nnotes as it had in block 1.\n(Thus, you now feel regular meter--you have generated\nmeter.)\nTo keep with this trend, I modified block 2 so that the\nfinal note would be the same duration as the first four\nnotes combined.\nI then repeated block 5 so that I could form an\nantecedent-consequent phrase. I was starting to get an\nidea of how I wanted the form of my piece to be. Block\n1 is introduced as the start of something that we\nhaven't figured out yet. It gets repeated again but it\ndoesn't really get any further. Finally, with the\naddition of block 5, we get the movement of the piece\ninto an actual idea. However, we throw in a second\nblock which doesn't quite finish off the idea (block\n2). If we play block 5 again, we can see that we have\nan antecedent-consequent phrase that needs to be\ncompleted.\nThe final thing to do was complete the antecedent\nconsequent phrase using the final two blocks. I still\nheard block 3 as the only block which seemed to\nconclude as an ending so I placed it at the end and put\nblock 4 before it. The order of the song was now 1 1 5\n2 5 2 3. I decided that I didn't like having the note\nthat is shared between blocks 4 & 3 being repeated four\ntimes because it was almost like a stop in the motion\nof the piece. I switched blocks 2 and 4 (again\nmodifying block 4 so that the final note was the same\nduration as the four previous notes combined), but\nstill had the problem of that same note being played 3\ntimes. To get rid of this problem, I tried repeating\nblock 2 so that it would have more motion preceding the\nrepeated note but this made that part of the song seem\nboring. Next, I deleted the fifth note of the block so\nthat there would be a constant upward and then downward\nstepwise progression of notes without any repetition in\nthe middle. This was my first modification of block 2.\nMy next song looked like this: 1 1 5 4 5 2a 2a 3.\n\nAfter hearing this, I was faced with an additional\nproblem. I didn't like how each notes of the last part\nof the song ( 5 2a 2a 3) were played with exactly the\nsame duration. It seemed rather boring and dull. I\nexperimented with changing the duration of the notes\nand found that in order to keep the music going\nforward, I would have to \"quicken\" the tempo in that\nregion. To quicken, I mean to make the duration of\ntime, before the next note is played, shorter.\nI kept the repetition of block 2 but decided to change\nthe block so that the first two notes get played twice\nand \"twice\" as quick (block 2b). Although, adding the\nextra notes helped keep the piece moving, I suffered\nfrom the same problem that the repetition of the blocks\nin that manner was rather unexciting. I decided that I\nwould play block 2a once and follow that with block 2b.\nIn addition, I extended the last note of block 3 so\nthat it would make a more convincing ending and I was\nleft with the final song looking like this: 1a 1a 5 4a\n5 2 (first modification) 2 (second modification) 3a.\nThe letter 'a' denotes where I changed the rhythm so\nthat the duration of the last note was longer. By using\n2(1st)2(2nd), I had the sense that just as I was about\nto get bored with the rhythm, there was a sudden\nquickening of the tempo that pushes the song forward to\nthe end.\nThe structural hierarchy of this song was similar to\nwhat I made with the Vienna blocks. There is a brief\nintroduction followed by the antecedent phrase and a\nconsequent phrase. In this case, the consequent phrase\nis longer than the antecedent phrase and made up of\nmore blocks.\n(This is a quite fantastic paper. You have really\ntraced your whole composition process, made clear what\ntriggered your decisions and your specific changes.\nYour accounting for why also goes very far into depth,\nbut there is still more to discuss in class.)"
    },
    {
      "category": "Resource",
      "title": "becky.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-113-developing-musical-structures-fall-2002/853045f26bc22f197b48d591c0ba88b9_becky.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "BECKYSFRENCH.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-113-developing-musical-structures-fall-2002/8a2576c9c412449f6b071ee3f11c790c_BECKYSFRENCH.pdf",
      "content": "BECKY'S FRENCH\n(c) Oxford University Press. Used with permission.\nBECKY'S PAPER\nComments (from my log)\nBlock 1. Sounds like a middle piece; it is short.\nBlock 2. Unsure--sounds different; too long.\nBlock 3. Sounds like an ending; goes high to low.\nBlock 4. Sounds like a beginning.\nBlock 5. Similar to 1; sounds like a middle piece; it is short.\nBuilding the tune\na. Started with 4 (it was the only one that sounded like a beginning).\nb. 4 1_1 (used 1 twice because it was 1/2 as long as 4).\nc. 4 1_1 4 3 (used 4 to repeat and 3 to end phrase--varied repetition!)\n<END OF PHRASE 1>\nd. 4 5_5 4 3 (repeated phrase using 5 instead of 1, since they are similar.\n<END OF PHRASE 2>\ne. 2_5 2_1 2_5 3 (needed to use block 2 - it's longer so I combined it with either 1 or 5 to get the\nright timing)\n[My comment: Actually, it's the same as 1 or 5--more notes makes it sound longer--i.e., more\nhappens.]\n\nf. change e to 2_1 2_5 2_1 3 (now matches previous ordering using 1\nthen 5)\n<END OF PHRASE 3)\nANALYSIS: Looking back on my tune and listening to it, I can see that it is very structured (as\neveryone in class commented).\n[This can mean many things. What do you mean?]\nIt has 3 main parts of equal length (as measured by tapping my foot). The structure is:\nEach of the circles on the bottom represents equal length (2 taps),\ntherefore A, B, and C are 3 phrases of length 8 each. Although this is true,\nI notice that C seems faster--it speeds up to form the end (development).\nIn addition, the use of 5-5 in B instead of 1-1 in A represents a break from\nthe expectation of the listener, who might expect to hear A repeated\nexactly again in B. This break seems to give the tune a more ending\nsound, since 1->5 is high->low. I used that concept again in c.\nTo play this tune on the keyboard, the easiest way was to figure out the notes by their letter\nnames using the magnifying glass on the blocks. For example, I learned that Block 1 was\nFDD, while 2 was EDEFG...(Remember I have no real formal music training). Once I got\nstarted, it was easier to figure the rest of it out.\nCONCLUSIONS:\nI can see that I like structure in music. In all three of my tunes there is evidence of some type\nof structure. In creating all of the tunes I attempted (whether consciously or subconsciously)\nto create sub-tunes of equal lengths and then putting them together to form a whole tune. In\naddition, I use a lot of repetition, whether varied or literal, to add continuity to the tunes.\nWhen I hear other people's tunes, I tend not to see (hear?) the structure immediately,\ntherefore causing the tunes to sound \"wrong\" to me. |\nComment: A big question in my mind: what makes a certain sequence of notes, blocks--sound\nlike an ending? We see that most people agree on what things have ending sounds, so what\nmakes it that way?\nMy comments on Becky's paper:\nOr is it that \"structure \" can be generated in many different ways, depending on which aspects one selects\nto focus on? You have mentioned several: equal phrase lengths, repetition of pitch contour (sequence),\nliteral repetition, varied pairings, etc."
    },
    {
      "category": "Resource",
      "title": "GLENNSAMBROSIAN.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-113-developing-musical-structures-fall-2002/e10544f3ea6de1bdbcb214cdde13fdb4_GLENNSAMBROSIAN.pdf",
      "content": "GLENN'S AMBROSIAN\n(c) Oxford University Press. Used with permission.\nGlenn's paper\nFinding features was tough--there was not any rhythmic pattern, no pitch shape to\nspeak of, no harmonic structure. Each block as perhaps one note. Attempts to latch\nonto features other than this seemed fruitless. So I made my own!\nRepeating a good moving block, 3, four times, introduced a regularity and served to\nmotivate the piece by virtue of skipping a beat each time. The result was an African\ndrum motif which continues as an undercurrent to the whole piece.\nAny change from this \"beat\" is very noticeable so it must be very delicately handled\nat first--one block at a time, always restating the beat on both sides.\nI tried to force on these blocks the feeling that more than one sequential line of\nmusic was happening at once.\n3 3 3 3 1 3 3 5 3 3 5-1-1-5 3 3 4 3 3 2-4-4 3 3 3 3 ......\nBlock 3 sets the stage. 1 is an attempt to break out of the \"beat.\" It is frustrated\nby the return of 3-3. The 5, a longer version of 1, with the same result, setting 3 up\nas a very strong force.\nFinally 1 breaks out of the mold, 5-1-1-5, very assertive because of the adjacent 1's\nand the break of the beat twice by 5.\n\nBut then the beat returns, played off against the similar block, 4. Somehow this\nsection, 2-4-4, does not require a concluding 2. perhaps because 3 has lost some of\nits strength through repeated intervening of other blocks. These two groups are seen\nas definite tonal assertions within a sea of droning rhythm.\nThe ending, simply a further reaffirmation of 3, is sort of a fade-out which\ncan be heard to continue on, perhaps repeating the whole as it started."
    },
    {
      "category": "Resource",
      "title": "LINZSAMBROSIAN.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-113-developing-musical-structures-fall-2002/5a4d2baa9909b76c122af29f7612b15e_LINZSAMBROSIAN.pdf",
      "content": "LINZ'S AMBROSIAN\n(c) Oxford University Press. Used with permission.\nLINZ'S PAPER\nThe final composition was made using the tuneblocks named Ambrosian. I started\nby listening to each of the blocks once and then going through each of them a\nsecond time. During this second run-through, I analyzed possible positions and\ncombinations that each block could fill. I noticed how blocks 1 and 5 began with the\nsame three notes. I thought perhaps that they could make a combination together.\nI also noticed that, of the five blocks, only block 3 seemed to make a suitable\nending. Therefore, I tentatively called block 3 my ending block. I thought that both\nblocks 2 and 4 would probably be middle blocks and that block 5 seemed to make a\ngood beginning. After listening to the blocks, I noticed how they all shared the\nsame tempo.\n[Do you mean same set of durations or same \"rhythm\"?]\nBy this I mean, the duration between each of the notes was equal for all the notes\nin every tuneblock [Yes.] This actually made the song seem very monotonous and\nboring.\nThis feeling of monotony was probably strengthened by my observations that after\nlooking at the pitch contour, I saw that none of the blocks seemed to have any\nlarge jumps down or up. This gave the feeling that the tune sort of hovered around\none note and the constant stepwise movement was actually too boring for my ears.\nContinual stepwise movement (or something close to it) left my ears wanting some\nexcitement and actually needing to hear jumps to widely spaced apart pitches. In\ncontrast to the previous pieces I constructed, where I actually looked for stepwise\nmovement to calm down a song, the constant stepwise movement of these\ntuneblocks had just become too boring.\n\n(Really very clear and close observations and good comparisons. You have grabbed\nonto features that you \"need\" for a tune that you like.)\nI decided to start with the combination of block 5 going to block 1. I liked the\nsound of block 5 as a beginning because it had a wide range which I seem to lean\ntowards when choosing a beginning. I guess to my ears, the sense of starting\nsomething is best portrayed with a block which seems to go in different directions-\n-up and down. However, I also noticed that block 1 was a sort of incomplete block.\nIt sounded like it wanted to go somewhere but was stopped abruptly halfway\nthere. I considered this block to be a sort of question that needed an answer.\n(Good description. We'll need to think about what the relations are that generate\nthat function/feeling. Did you notice that 5 is like a continuation and expansion of\n1?)\nSo to utilize this potential call and answer format, I placed block 1 before block 5. I\ndecided to repeat block 1 because the repetition seemed to give it more of a sense\nof a half finished idea. At this point I wanted to break up the monotony of the\ntempo, so I decided to modify block 1 so that the fifth note was held for the same\namount of time as the first four notes combined.\nImmediately, this changed the character of the piece and placed an emphasis on the\nfirst note and fifth note of the block. The long holding of the note also added to the\nanticipation I had of hearing something else. In my ears, I felt that there should be\nsomething that answered the call of the repeated blocks. Block 5 was a very good\nstart to the answer because it began the same as block 1 but instead of stopping\nhalfway through, it continued forward and seemed to finally get somewhere.\n(See comment, above--you got it.. Also, your new 1 is equal in total time to Block 5!\n(8 beats)\n.\nThe next thing I did was try and find the continuation of the answer. I tried both\nblocks 2 and 4 and they both sounded correct after block 5. I didn't like the way\n\nblock 3 sounded because it felt too much like the ending of the piece and I didn't\nfeel that my song could finish there because there had been no development yet. I\ndecided to keep block 2 after block 5. Block 5 seemed to naturally divide into\ngroups of 4 notes with the strong beat being on the 1st and 5th notes as it had in\nblock 1. (Thus, you now feel regular meter--you have generated meter.)\n\nTo keep with this trend, I modified block 2 so that the final note would be the same\nduration as the first four notes combined.\nI then repeated block 5 so that I could form an antecedent consequent phrase. I\nwas starting to get an idea of how I wanted the form of my piece to be. Block 1 is\nintroduced as the start of something that we haven't figured out yet. It gets\nrepeated again but it doesn't really get any further. Finally, with the addition of\nblock 5, we get the movement of the piece into an actual idea. However, we throw\nin a second block which doesn't quite finish off the idea (block 2). If we play block 5\nagain, we can see that we have an antecedent consequent phrase that needs to be\ncompleted.\n\nThe final thing to do was complete the antecedent consequent phrase using the final\ntwo blocks. I still heard block 3 as the only block which seemed to conclude as an\nending so I placed it at the end and put block 4 before it. The order of the song was\nnow 1 1 5 2 5 2 3. I decided that I didn't like having the note that is shared\nbetween blocks 4 & 3 being repeated four times because it was almost like a stop in\nthe motion of the piece. I switched blocks 2 and 4 (again modifying block 4 so that\nthe final note was the same duration as the four previous notes combined) but still\nhad the problem of that same note being played 3 times. To get rid of this problem,\nI tried repeating block 2 so that it would have more motion preceding the repeated\nnote but this made that part of the song seem boring. Next, I deleted the fifth\nnote of the block so that there would a constant upward and then downward\nstepwise progression of notes without any repetition in the middle. This was my\nfirst modification of block 2. My next song looked like this: 1a 1a 5 4a 5 2aa 2aa 3.\n\nAfter hearing this, I was faced with an additional problem. I didn't like how each\nnotes of the last part of the song ( 5 2aa 2aa 3) were played with exactly the same\nduration. It seemed rather boring and dull. I experimented with changing the\nduration of the notes and found that in order to keep the music going forward, I\nwould have to \"quicken\" the tempo in that region. To quicken, I mean to make the\nduration of time, before the next not is played, shorter.\nI kept the repetition of block 2aa but decided to change the block so that the first\ntwo notes get played twice and \"twice\" as quick (block 2b).\nAlthough, adding the extra notes helped keep the piece moving, I suffered from the\nsame problem that the repetition of the blocks in that manner was rather\nunexciting. I decided that I would play block 2aa once and follow that with block\n2b. In addition, I extended the last note of block 3 so that it would make a more\nconvincing ending and I was left with the final song looking like this: 1a 1a 5 4a 5\n2aa (first modification) 2b (second modification) 3a. The letter 'a' denotes where I\nchanged the rhythm so that the duration of the last note was longer. By using 2aa\n(1st) 2b (2nd), I had the sense that just as I was about to get bored with the\nrhythm, there was a sudden quickening of the tempo that pushes the song forward\nto the end.\n\nThe structural hierarchy of this song was similar to what I made with the Vienna\nblocks. There is a brief introduction followed by the antecedent phrase and a\nconsequent phrase. In this case, the consequent phrase is longer than the\nantecedent phrase and made up of more blocks.\n(This is a quite fantastic paper. You have really traced your whole composition\nprocess, made clear what triggered your decisions and your specific changes . Your\naccounting for why also goes very far into depth , but there is still more to discuss in\nclass.)"
    }
  ]
}