{
  "course_name": "Developmental Biology",
  "course_description": "This graduate and advanced undergraduate level lecture and literature discussion course covers the current understanding of the molecular mechanisms that regulate animal development. Evolutionary mechanisms are emphasized as well as the discussion of relevant diseases. Vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models are covered. Specific topics include formation of early body plan, cell type determination, organogenesis, morphogenesis, stem cells, cloning, and issues in human development.",
  "topics": [
    "Science",
    "Biology",
    "Developmental Biology",
    "Science",
    "Biology",
    "Developmental Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nClass Format\n\nThe goal of this course is to introduce you to the very broad field of developmental biology. A particular emphasis is the intimate connection between developmental biology and evolution, which will be a theme throughout the course. Additional emphasis is on the connection between mechanisms of normal development and disease etiology. The course will cover general principles of development and current important issues. Relevant ethical issues will be discussed. Both invertebrate and vertebrate model systems will be covered, including Drosophila, C. elegans, chick, frog, zebrafish, mice and human.\n\nThe course will be divided into multiple topics, each of which will be covered by two hours of lecture and two hours of discussion of research papers. In some cases, guest lecturers working in a specific area will teach a topic. One review article and one research paper will be handed out one week ahead of time and will be relevant to that week's lecture topic. Groups of students will be responsible for leading discussion of research papers. Instruction on how to structure these discussions will be given.\n\nAnother emphasis of the course is to teach you how to experimentally approach the topics of development. We will therefore emphasize how to formulate and test hypotheses. Students will become familiar with cutting edge molecular, genetic and imaging techniques that are applicable to analysis of many aspects of development.\n\nFinally, since development is a three (and four) dimensional subject, modeling materials will be used in some sessions. We will also discuss current news and movies relevant to the lecture material. Prof. Sive will offer an optional additional discussion module using the book\nJurassic Park\nas a tool to approach ethical and experimental issues in developmental biology research.\n\nRecommended Texts and Other Readings\n\nThe following book is a very useful text, and recommended. Selected readings will be suggested for some topics.\n\nGilbert, Scott F.\nDevelopmental Biology\n. 7th ed. Sunderland, MA: Sinauer Associates, 2003. ISBN: 9780878932580.\n\nBackground will be provided for students who have not studied development before, and Microsoft(r) PowerPoint(r) presentations will be made accessible to the class.\n\nSee the\nreadings\nsection for a complete list of recommended texts.\n\nAssignments\n\nAssignments for both undergraduate and graduate students include presenting primary literature material and leading weekly paper discussions for the class. Undergraduate students also must complete two exams and a final exam. Graduate students must complete a written review of a recent paper as a final project.\n\nCourse Requirements\n\nAll Students\n\nActive participation is expected, and questions are encouraged in both lecture and paper review sessions. However, do not be intimidated - you are here to learn! Naive questions are encouraged and no question will be considered stupid. It is also expected that you will have read and considered all papers before the discussion session.\n\nYou will be asked to keep a written record of techniques relevant to specific questions as the course proceeds. We will give you clear guidelines about how to put together such a compendium of techniques, which will serve as a useful future reference.\n\nGraduate Students\n\nPass/Fail. Attendance at all classes, active participation in class, and leading discussions as assigned is expected, as well as completion of the final project.\n\nUndergraduate Students\n\nThe course will be graded or can be taken Pass/Fail. Attendance at all classes, active participation in class, and leading discussions as assigned is expected. Two exams will be given during the semester, during recitation times or at some other mutually acceptable time. A final will be given during exam week. Practice exam material will be available. Exams will strongly emphasize formulation of hypotheses and design of experimental approaches to test these.\n\nGrading\n\nGraduate Students\n\nThis course is graded on a pass/fail basis for graduate students.\n\nUndergraduate Students\n\nACTIVITIES\n\nDISTRIBUTION\n\nClass Attendance, Participation, and Student Led Discussion Sessions\n\n1/3\n\nTwo Exams\n\n1/3\n\nFinal Exam\n\n1/3",
  "files": [
    {
      "category": "Resource",
      "title": "guideline.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/ea7a014d78d6d2e05d7294f2d5b8b23f_guideline.pdf",
      "content": "Reading research papers- some guidelines\nIn reading papers, it is useful to ask the following:\n-\nWhat is the background to the paper- that is, the historical context? What was\nknown before the present study was performed?\n-\nWhat is the broad question that the authors wish to ask- for example, how does\nthe embryo decide to form a neural tube?\n-\nWhat is the specific question that the authors ask- for example, what is the role of\nthe actin gene in regulating neural tube formation?\n-\nWhat hypotheses are proposed and tested?\n-\nWhat experimental approach is taken to ask the specific hypotheses? That is, for\neach figure what experiments were performed? What aspect of the specific\nquestion does each experiment address?\n-\nAre the experimental approaches appropriate, or would some other approach have\nbeen more definitive?\n-\nHave appropriate controls been performed?\n-\nAre you convinced by the conclusions that the authors draw from each\nexperiment?\n-\nAre the hypotheses made supported or not supported?\n-\nHave the authors answered the specific question they set out to? Do you think\nthey have contributed a substantial or just a small increase to understanding the\nbroad question?\n-\nWhat experiments would logically follow from this study?\n\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton"
    },
    {
      "category": "Resource",
      "title": "synthesis.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/1247886a4c7ac3b018aefe93b912754b_synthesis.pdf",
      "content": "7.22/7.72 Development and Evolution: Synthesis - Fall 2005\n11.28.05\nThe goal of this project is to put together a list of the general and evolutionarily relevant\nprinciples that direct Development. Specifically, we would like you to synthesize what\nyou have learned into some general principles. You have been exposed to these\nprinciples through the lectures and readings.\nWe will collate and augment your thoughts to make a class synthesis that will be posted.\nAt the beginning of various classes, we will spend a few minutes discussing some ideas.\nYou should hand in your list on Wed Dec 7. This will not be graded, but we would like to\ncheck that you have grappled with this challenge.\n1. Without referring to your notes or readings, think carefully about what you have\nlearned, and list principles of Development. Use plain English in defining these\nprinciples, but be sure to append any relevant terms at the end.\n2. Then, go through your notes and papers from each module to help you find other\nrelevant principles.\nFor example, today in class we came up with the following:\na. Communication is essential. Could be between cells or between cells and the\nenvironment (ECM, for example). This refers to the process of induction.\nb. Opposing inhibitory and stimulatory signals are often involved in controlling\ncell fate.\nc. There are many steps between a naive cell and its final fate. This refers to\nthe progression from determination to differentiation.\nHere are some (overlapping) categories to work with, but do not be constrained by\nthese!\n(Animal) embryo organization\nAxes (position)\nCell type formation\nOrgan formation\nInducers\nMorphogens\nMorphogenesis\nCell movement\nStem cells\nCloning\nEpigenesis\nEvolutionary conservation\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton"
    },
    {
      "category": "Exam",
      "title": "exam1_answers.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/6027dec18a8a022b3cdc3c20a0388ef7_exam1_answers.pdf",
      "content": "1 of 4\n7.22 Fall 2005\nExam 1 answers\n7.22 Exam I\nOctober 13 and 14 2005\nRead the entire question carefully before answering. Please provide\ncomplete answers limiting yourself to the space provided.\nScenario 1 (50 points):\n1.1 The vulva is a structure on the ventral surface of the adult nematode,\nCaenorhabditis elegans, which connects the gonad to the outside environment. It\nhas been determined that six cells, known as Pnp cells, give rise to the vulva.\n1.1a (5 points) Describe an experiment that might have been performed to\nshow that the Pnp cells give rise to the vulva.\nInject early developing worms with a vital dye and watch which\ncells give rise to the vulva.\n1.1b (1 point) What is the term that you would use to describe this type of\nexperiment?\nFate mapping\n1.2 Studies using lasers to ablate (i.e. kill) individual cells in the developing worm\nindicate that a single cell, known as the anchor cell, is required for the formation\nof the vulva. The anchor cell does not contribute to the final vulva (i.e. it is not a\nPnp cell).\n1.2a (5 points) Formulate a hypothesis suggesting a role for the anchor\ncell in vulval development.\nThe anchor cell secretes some factor that causes the Pnp\ncells to form the vulva.\n1.2b (1 point) What is the developmental term that describes the action of\nthe anchor cell?\nInduction.\n1.3 You have identified a gene named lin-3 that you believe to be important for\nvulval development. lin-3 encodes a growth factor that acts through a receptor\ntyrosine kinase known as let-23.\n1.3a (5 points) Describe an experiment that would ask whether expression\nof lin-3 correlates with vulval development. You may use any reagents you\nwish to.\nRaise an antibody to lin-3. Use this antibody to do\nimmunocytochemistry on developing worms, looking\nspecifically at the vulva.\n1.3b (4 points) Describe a result that would support (be consistent with)\nthis correlation.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\n\n7.22 Fall 2005\nExam 1 answers\n2 of 4\nlin-3 is expressed in the anchor cell (and not in other cells) of\ndeveloping worms.\n1.3c (4 points) Describe a result that would not support (be inconsistent\nwith) this correlation.\nlin-3 is not expressed in either the anchor cell or the Pnp\ncells of developing worms.\n1.4 You hypothesize that lin-3 is necessary for vulval development.\n1.4a (4 points) Describe an experiment to test the necessity of lin-3 in vulval\ndevelopment. You may use any reagents you wish to.\nFind a worm with a mutation in the lin-3 gene by mutational\nscreen that completely blocks lin-3 function (i.e. knock it out)\nand look at vulval development.\n1.4b (4 points) Describe a result consistent with this hypothesis.\nThe mutant worm does not form a normal vulva at all.\n1.4c (4 points) Describe a result inconsistent with this hypothesis.\nThe mutant worm forms a vulva normally (at the right time\nand place).\n1.5 You hypothesize that lin-3 is sufficient to direct vulval development.\n1.5a (5 points) Describe an experiment to test the sufficiency of lin-3 to direct\nvulval development. You may use any reagents you wish to.\nAblate the anchor cell with a laser. Place a bead coated with\npurified lin-3 protein in the ablated worm (in the location of\nthe anchor cell) and look at vulval formation.\n1.5b (4 points) Describe a result consistent with this hypothesis.\nPlacing the purified lin-3 protein in the ablated worm leads to\nnormal vulval formation.\n1.5c (4 points) Describe a result inconsistent with this hypothesis.\nPlacing the purified lin-3 protein in the ablated worm leads to\nworms developing with no vulvas.\nScenario 2 (50 points):\n2.1 You discover a mouse mutant called \"gutless\", where the gut fails to form and\nembryos die early due to multiple problems. Initial analyses indicate that the\ntranscription factor otx2 is expressed in all cells of the mutant, whereas in wild\ntype embryos, otx2 is expressed only in the nervous system.\n2.1a (2 points) The gut comes from one of the three earliest cell types in the\nembryo. What are these called collectively?\n\n7.22 Fall 2005\nExam 1 answers\n3 of 4\nGerm layers\n2.1b (2 points) The gut is one fate arising from the endodermal lineage.\nDefine cell fate.\nThe ultimate differentiated state to which a cell has become\ncommitted.\n2.1c (4 points) Does the \"gutless\" mutant necessarily correspond to a\nmutation in the otx2 gene? Explain your answer.\nNo! The mutation could lie in a different gene that acts to\nactivate the expression of otx2. A mutation that leads to\noverexpression of the upstream gene would lead to\noverexpression of otx2.\n2.1d (4 points) Assuming that the gutless mutation does lie in the otx2 gene,\ndescribe two regions in the otx2 gene that, when mutated, could lead to its\nexpression throughout the embryo (ubiquitous expression)? For each region,\nlist a mechanism by which gene expression could be altered.\nGene region mutated\nMechanism leading to\nubiquitous otx2 expression\nPromoter Region\nIncreases the binding of RNA\npolymerase leading to\nincreased otx2 transcription\nCoding Region\nIncreases the stability of the\notx2 mRNA leading to more\ntranslation (i.e. more protein).\n2.2 You wonder about the normal function of otx2.\n2.2a (5 points) Formulate a hypothesis regarding a role for otx2 in normal\ndevelopment.\notx2 is required in the nervous system to repress expression\nof gut genes.\n2.2b (5 points) Describe a loss of function experiment that would test this\nhypothesis. You may use any reagents you wish to.\nProduce a mouse knockout of the otx2 gene by homologous\nrecombination. Look at nervous system development in the\nknockout.\n2.2c (4 points) Describe a result from this experiment that would be\ninconsistent with your hypothesis.\nThe nervous system of the knockout mouse develops\ncompletely normally.\n\n7.22 Fall 2005\nExam 1 answers\n4 of 4\n2.2d (4 points) Describe a result from this experiment would be consistent\nwith your hypothesis.\nThe nervous system of the knockout mouse expresses genes\nnormally only seen in the gut.\n2.3 You wonder also about how ubiquitous otx2 expression in \"gutless\" caused\nthe mutant phenotype.\n2.3a (5 points) Formulate a hypothesis to explain why gut formation did not\noccur in this mutant.\nExpression of otx2 in a cell leads that cell to adopt a nervous\nsystem fate.\n2.3b (5 points) Describe a correlation experiment to test this hypothesis. You\nmay use any reagents you wish to.\nLook at the expression of nervous system genes in the\nubiquitous otx2 mutant.\n2.3c (5 points) Describe a result consistent with your hypothesis.\nNervous system genes are expressed throughout the embryo\nin the ubiquitous otx2 mutant.\n2.3d (5 points) Describe a result inconsistent with your hypothesis.\nNervous system genes are expressed only in the nervous\nsystem in the ubiquitous otx2 mutant."
    },
    {
      "category": "Exam",
      "title": "exam1prac_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/f8998ebe8fbbc53db90a6e7eb1f663ac_exam1prac_ans.pdf",
      "content": "1 of 10\n7.22 Fall 2005\nsample exam 1 - KEY\n7.22 Example Problems for Exam 1\nThe exam will be of this format. It will consist of 2-3 sets scenarios.\n1. The Observation\nDuring the first cleavage division of the nematode Parascaris aequorum, special\ncytoplasm, termed the germ plasm, is segregated into one specific daughter cell. Cells\nthat do not inherit the germ plasm undergo a process called chromosome diminution\n(the chromosomes fragment and much of each chromosome is lost at subsequent\ndivisions). All germ cells are descended from the cell that does inherit the germ plasm\nand these cells retain their full complement of DNA.\nThe Tasks\n1.1 Offer a hypothesis about the molecular mechanism (involving, for example, a\nspecific protein or RNA- feel free to give this(these) a name(s)) that might be\nresponsible for the phenomenon (germ plasm vs chromosome fragmentation) described\nabove.\nA protein X, present in the cell that inherits the germ plasm, prevents\nchromosome fragmentation.\n1.2a Describe an experiment to determine if the mechanism you have hypothesized and\nthe phenomenon are correlated (correlation; \"show it\").\nRaise an antibody to protein X and do immunocytochemistry with this\nantibody on Paracaris embryos.\n1.2b Describe a result that is consistent with your hypothesis.\nProtein X localizes to the cell containing the germ plasm.\n1.2c Describe a result that is inconsistent with your hypothesis.\nProtein X does not localize to the cell containing the germ plasm.\n1.3a Describe an experiment to determine if the mechanism you have hypothesized is\nnecessary for the phenomenon to occur (loss-of-function; \"block it\").\nProduce a mutant worm that is deficient for protein X (or do RNAi against\nprotein X prior to fertilization).\n1.3b Describe a result that is consistent with your hypothesis.\nThe mutant has chromosome fragmentation in the cell containing the germ\nplasm.\n1.3c Describe a result that is inconsistent with your hypothesis.\nThe mutant does not show chromosome fragmentation in the cell\ncontaining the germ plasm (i.e. the wild-type phenotype).\n1.4a Describe an experiment to determine if the mechanism you have hypothesized is\nsufficient to the phenomenon to happen (gain-of-function; \"move it\").\nInject RNA of the gene coding protein X into the somatic (i.e. non-germ\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\n\n7.22 Fall 2005\nsample exam 1 - KEY\n2 of 10\nplasm inheriting) cells of the embryo.\n1.4b Describe a result that is consistent with your hypothesis.\nThe injected worms do not fragment their chromosomes in the somatic\ncells of the embryo.\n1.4c Describe a result that is inconsistent with your hypothesis.\nThe injected worms fragment their chromosomes normally in the somatic\ncells of the embryo.\n2. The Observation\nA key question in evolution and development is how the front (fore) limbs and back\n(hind) limbs become different from one another. That is, how their identity is established.\nOne possible clue comes from expression of the Tbx5 transcription factor, which is\nnormally expressed in the developing forelimbs, but not the developing hindlimb.\nThe Tasks\n2.1 Formulate a hypothesis regarding the possible function of Tbx5 in directing limb\nidentity.\nTbx5 activates expression of genes that produce the forelimb.\n2.2a Describe an experiment to determine if Tbx5 is necessary for the function you have\nhypothesized (loss-of-function; \"block it\").\nProduce a mutant deficient for the Tbx5 gene.\n2.2b Describe a result that is consistent with your hypothesis.\nThe Tbx5 deficient embryos have forelimbs that look like hindlimbs (or that\nlook like neither hind- nor forelimbs).\n2.2c Describe a result that is inconsistent with your hypothesis.\nThe Tbx5 deficient embryos have normal forelimb development.\n2.3a Describe an experiment to determine if Tbx5 is sufficient to cause the function you\nhave hypothesized (gain-of-function; \"move it\").\nInduce expression of Tbx5 in the developing hindlimbs.\n2.3b Describe a result that is consistent with your hypothesis.\nThe injected embryos develop hindlimbs that look like forelimbs.\n2.3c Describe a result that is inconsistent with your hypothesis.\nThe injected embryos develop normal hindlimbs.\n3. The observation\n\n7.22 Fall 2005\nsample exam 1 - KEY\n3 of 10\nIn classic \"transplant\" experiments, the future neural plate (nervous system) of a frog\nembryo was moved from its usual dorsal position to the ventral region of a host embryo.\nThe host and donor embryos were either at the early gastrula or late gastrula stage\nwhen the transplant was performed and all were examined when embryos reached mid\nneurula stage. Note: rewording!!\nWhen the future neural plate of an early gastrula donor is transplanted, it develops as\nnon-neural tissue (epidermis) on the ventral side of the host. However, when the future\nneural plate of a late gastrula donor is transplanted, it develops as a second neural\nplate on the ventral side of the host, as diagrammed below.\nThe Tasks\n3.1 In order to perform this experiment, you need to know which piece of tissue is going\nto give rise to the normal neural plate, How would you determine this? What is this type\nof experiment called?\nInject a vital dye into the blastula stage embryo and ask later which\nbecome the neural plate. This is called a fate mapping experiment.\nFigure by MIT OCW.\nEarly Gastrula\nLate Gastrula\nPresumptive neural ectoderm\nNeural plate\nNeural plate tissue forms\nPresumptive epidermis\nPresumptive neural ectoderm\nNeural plate\nEpidermis forms\nPresumptive epidermis\n\n7.22 Fall 2005\nsample exam 1 - KEY\n4 of 10\n3.2 Formulate two possible hypotheses that would explain the results described.\n1. The early gastrula epidermis inhibits the early gastrula neural ectoderm\nfrom forming a second neural plate, whereas the late gastrula epidermis\nhad lost the ability to inhibit the late gastrula neural ectoderm from\nbecoming a neural plate.\n2. The early gastrula neural ectoderm was not yet determined as neural plate,\nwhereas the late gastrula neural ectoderm was determined as neural plate.\n3.3 The transcription factor NeuroD is expressed in late gastrula neural plate.\n3.3a Describe an experiment to test correlation of NeuroD expression with the ability to\nform a neural plate (show it).\nPerform in situ hybridization experiments on early and late gastrula stage\nembryos using a probe for NeuroD.\n3.3b Describe a result consistent with this correlation.\nNeuroD is not expressed in early stage gastrula, but is expressed in the\nlate gastrula.\n3.3c Describe a result inconsistent with this correlation.\nNeuroD is expressed in both early and late gastrula stages, in the neural\nectoderm. Note: This inconsistency would be stronger if one was monitoring\nprotein expression by immunocytochemistry.\n3.4a Describe a gain of function experiment to test function of NeuroD in neural plate\nformation (move it).\nInject RNA encoding NeuroD protein into the ventral side of an early\nembryo and ask whether you get ventral neural plate formation. Note: This will\nproduce NeuroD where it is not normally made.\n3.4b Describe a result consistent with this function.\nThe injected embryos form an extra neural plate on the ventral side.\n3.4c Describe a result inconsistent with this function.\nThe injected embryos develop normally.\n3.5a Describe a loss of function experiment to test function of NeuroD in neural plate\nformation (lose it).\nInject the dorsal sides of early embryos with an antisense oligonucleotide\nto NeuroD RNA.\n3.5b Describe a result consistent with this function.\nThe injected embryos do not form a neural plate.\n3.5c Describe a result inconsistent with this function.\nThe injected embryos develop normally.\n\n7.22 Fall 2005\nsample exam 1 - KEY\n5 of 10\n4. The Observation\nIn an example we discussed in class, it was shown that while the animal half of an early\nsea urchin embryo does not form a normal pluteus larva, the micromeres can\nrescue development of the animal half. However, the micromeres contribute to only a\nfew of the rescued embryos tissues.\nThe Tasks\n4.1 What major process does this observation illustrate?\nInduction.\n4.2 What is an \"organizer\"? Do you think this phenomenon could illustrate the activity of\nan organizer? Why?\nA group of cells with profound inducing activity, that likely secrete multiple\ninducers. This could be an organizer because it is able to induce a large number\nof changes in the structure of the developing embryo.\nFigure by MIT OCW.\nNormal Development\nAnimal\nhemisphere\nAnimal Half Alone\nMicromeres\nPluteus larva\nDauerblastula\nComplete animalization\nAnimal Half And\nMicromeres\nRecognizable larva\nveg1\nan1\nveg2\nan2\n\n7.22 Fall 2005\nsample exam 1 - KEY\n6 of 10\n4.3 The Delta protein is expressed in the micromeres of an intact sea urchin embryo.\nDelta is a secreted protein that acts on cells directly touching the secreting cell, via the\nNotch receptor.\n4.3a Formulate a hypothesis concerning activity of Delta in the micromeres.\nDelta is secreted by the micromeres and acts on the animal cells via the\nNotch receptor. The signal is then transduced to the nucleus and leads to\ntranscription of factors that change the fate of the animal cells.\n4.4a Describe an experiment to analyze correlation of Delta expression with the\nrescuing activity of the micromeres.\nUse a Delta antibody to analyze the expression of Delta protein in the\nnormal, defective and rescued embryos.\n4.4b Describe a result consistent with your hypothesis.\nDelta protein is expressed in micromeres of normal and rescued embryos,\nbut not in the defective animal half embryos.\n4.4c Describe a result inconsistent with your hypothesis.\nDelta protein is expressed in the defective animal half embryos.\n4.5a Describe an experiment to analyze necessity of Delta in rescuing activity of the\nmicromeres.\nRemove Delta protein from the precursors to the micromeres (using\nantisense oligonucleotides or a blocking antibody).\n4.5b Describe a result consistent with your hypothesis.\nThe injected embryos look like defective animal half embryos.\n4.5c Describe a result inconsistent with your hypothesis.\nThe injected embryos develop normally.\n4.6a Describe an experiment to analyze sufficiency of Delta in rescuing activity of the\nmicromeres.\nIncubate the animal half embryos with purified Delta protein.\n4.6b Describe a result consistent with your hypothesis.\nThe treated animal half embryos develop normally.\n4.6c Describe a result inconsistent with your hypothesis.\nThe treated animal half embryos still form abnormal dauerblastulas.\n5. First observation\nDuring the early stages of mouse lung formation, a group of epithelial cells divides and\nforms \"primary (1o) tubules\" which then branch and form additional secondary (2o)\n\n7.22 Fall 2005\nsample exam 1 - KEY\n7 of 10\ntubules, and eventually tertiary (3o) tubules. The epithelial cells touch a different cell\ntype, the lung mesenchyme.\nNOTE: Lung mesenchyme is present\nthroughout the period of lung tubule\nformation\nSecond observation\nThe lung mesenchyme can be removed and/or substituted with kidney mesenchyme, as\ndiagrammed below. In either case, tubules do not form.\nEpithelium\nEpithelium\nRemove lung mesenchyme\nand add kidney mesenchyme\nRemove lung mesenchyme\nOR\n1o\n3o\n2o\nEpithelium\nLung mesenchyme\nFigure by MIT OCW.\nFigure by MIT OCW.\n\n7.22 Fall 2005\nsample exam 1 - KEY\n8 of 10\nThe tasks\na. 10 points. Formulate a hypothesis regarding the roles of epithelium and\nmesenchyme in primary lung tubule formation that takes the above\nobservations into account.\nThe lung mesenchyme sends out a secreted signal that induces the\nepithelium to form tubules. There is a specific signal from the lung\nmesenchyme that cannot be substituted by the kidney mesenchyme.\nb. 1 point. What fundamental process of developmental biology do these\nobservations illustrate? (one word)\nInduction\nc. 15 points. The Fgf protein is expressed in the lung mesenchyme. Fgf is a\nsecreted protein (a ligand) that acts through a receptor tyrosine kinase.\nDescribe an experiment to examine correlation of Fgf expression with lung\ntubule formation.\nDevelop an antibody to Fgf protein. Look at Fgf protein expression in\ndeveloping lung and kidney tissue using immunocytochemistry.\nDescribe a result consistent with this correlation.\nFgf protein is expressed in lung mesenchyme, but not in kidney\nmesenchyme.\nDescribe a result inconsistent with this correlation.\nFgf protein is expressed in both lung and kidney mesenchyme.\nd. 15 points. Loss of function tests:\nDescribe an experiment to test necessity (loss of function) of Fgf for lung\ntubule formation.\nCreate a mouse knockout of the Fgf gene, thus blocking production of\nthe Fgf protein.\nDescribe a result consistent with necessity.\nFgf knockout mice do not form lung tubules.\nDescribe a result inconsistent with necessity.\nFgf knockout mice have normal lung tubule formation.\ne. 15 points. Gain of function tests:\nDescribe an experiment to test sufficiency (gain of function) of Fgf in lung\ntubule formation.\nIncubate the lung epithelium with purified Fgf protein.\n\n7.22 Fall 2005\nsample exam 1 - KEY\n9 of 10\nDescribe a result consistent with sufficiency.\nLung epithelium incubated with purified Fgf protein forms lung tubules.\nDescribe a result inconsistent with sufficiency.\nLung epithelium incubated with purified Fgf protein does not form lung\ntubules.\nf. 10 points. Where might you expect the Fgf receptor protein to be localized?\nInclude the cell types and expected subcellular localization.\nOn the plasma membranes of lung epithelial cells.\nHow would you test this expectation?\nProduce an antibody against the Fgf receptor. Perform\nimmunocytochemistry on lung tissue to determine where the receptor is\nlocalized.\ng. 10 points. While Fgf promotes lung tubule outgrowth, the lung mesenchyme\nalso produces the secreted Sprouty protein, that inhibits outgrowth of the\nprimary lung tubules. The dual action of Fgf and Sprouty therefore lead to\nprimary tubules of the correct length.\nFormulate a hypothesis regarding the molecular mechanism by which Sprouty\nand Fgf might function together to regulate primary lung tubule formation.\nA high level of secreted Fgf protein activates expression of Sprouty.\n6. The observations\nIn vertebrates there are at least 19 different Fgf ligands and 4 different Fgf\nreceptors! Fgf8 is is expressed in the developing hindbrain, that will give rise to\nthe medulla and cerbellum. Fgf8 is essential for normal hindbrain development.\nFgf8 is also expressed in the developing limbs, where it is essential for normal\nlimb development.\nThe tasks\na. 10 points. Limb and hindbrain have very different functions. In what general\nways is hindbrain different from limb? Give an answer that uses your\nknowledge of cell and molecular biology.\nThe cell types are different, because they express different sets of gene\nproducts.\nb. I point. The limb develops primarily from mesoderm, the hindbrain from\nectoderm. What is the developmental biological term that describes\ncollectively the ectoderm, mesoderm and endoderm? (two words)\nGerm layers\n\n7.22 Fall 2005\nsample exam 1 - KEY\n10 of 10\nc. 15 points. If pure Fgf8 protein is applied to isolated ectoderm, the ectoderm\ngoes on to form a rudimentary hindbrain. If Fgf8 protein is applied to isolated\nmesoderm, the mesoderm goes on to form the beginnings of limbs.\nGive the developmental biological term that describes differences in the ability\nof a tissue to respond to the same stimulus. (one word)\nCompetence\nFormulate a hypothesis regarding the molecular mechanism by which the\nectoderm and mesoderm respond differently to applied Fgf8 protein.\nFgf8 binds to an Fgf receptor and the signal is transduced to the\nnucleus. In the nucleus the transcription factors activated by the Fgf\nsignal interact with different co-factors that are present in ectoderm or\nmesoderm, and thus turn on different down-stream genes."
    },
    {
      "category": "Exam",
      "title": "exam1pracprob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/00042cfaf9ed4d42a1245ad5a09326be_exam1pracprob.pdf",
      "content": "1 of 10\n7.22 fall 2005\npractice - exam 1\n7.22 Example Problems for Exam 1\nThe exam will be of this format. It will consist of 2-3 sets scenarios.\n1. The Observation\nDuring the first cleavage division of the nematode Parascaris aequorum, special\ncytoplasm, termed the germ plasm, is segregated into one specific daughter cell. Cells\nthat do not inherit the germ plasm undergo a process called chromosome diminution\n(the chromosomes fragment and much of each chromosome is lost at subsequent\ndivisions). All germ cells are descended from the cell that does inherit the germ plasm\nand these cells retain their full complement of DNA.\nThe Tasks\n1.1 Offer a hypothesis about the molecular mechanism (involving, for example, a\nspecific protein or RNA- feel free to give this(these) a name(s)) that might be\nresponsible for the phenomenon (germ plasm vs chromosome fragmentation) described\nabove.\n1.2a Describe an experiment to determine if the mechanism you have hypothesized and\nthe phenomenon are correlated (correlation; \"show it\").\n1.2b Describe a result that is consistent with your hypothesis.\n1.2c Describe a result that is inconsistent with your hypothesis.\n1.3a Describe an experiment to determine if the mechanism you have hypothesized is\nnecessary for the phenomenon to occur (loss-of-function; \"block it\").\n1.3b Describe a result that is consistent with your hypothesis.\n1.3c Describe a result that is inconsistent with your hypothesis.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\n\n7.22 fall 2005\npractice - exam 1\n2 of 10\n1.4a Describe an experiment to determine if the mechanism you have hypothesized is\nsufficient to the phenomenon to happen (gain-of-function; \"move it\").\n1.4b Describe a result that is consistent with your hypothesis.\n1.4c Describe a result that is inconsistent with your hypothesis.\n2. The Observation\nA key question in evolution and development is how the front (fore) limbs and back\n(hind) limbs become different from one another. That is, how their identity is established.\nOne possible clue comes from expression of the Tbx5 transcription factor, which is\nnormally expressed in the developing forelimbs, but not the developing hindlimb.\nThe Tasks\n2.1 Formulate a hypothesis regarding the possible function of Tbx5 in directing limb\nidentity.\n2.2a Describe an experiment to determine if Tbx5 is necessary for the function you have\nhypothesized (loss-of-function; \"block it\").\n2.2b Describe a result that is consistent with your hypothesis.\n2.2c Describe a result that is inconsistent with your hypothesis.\n2.3a Describe an experiment to determine if Tbx5 is sufficient to cause the function you\nhave hypothesized (gain-of-function; \"move it\").\n\n7.22 fall 2005\npractice - exam 1\n3 of 10\n2.3b Describe a result that is consistent with your hypothesis.\n2.3c Describe a result that is inconsistent with your hypothesis.\n3. The observation\nIn classic \"transplant\" experiments, the future neural plate (nervous system) of a frog\nembryo was moved from its usual dorsal position to the ventral region of a host embryo.\nThe host and donor embryos were either at the early gastrula or late gastrula stage\nwhen the transplant was performed.\nWhen the future neural plate of an early gastrula donor is transplanted, it develops as\nnon-neural tissue (epidermis) on the ventral side of the host. However, when the future\nneural plate of a late gastrula donor is transplanted, it develops as a second neural\nplate on the ventral side of the host, as diagrammed below.\nFigure by MIT OCW.\nEarly Gastrula\nLate Gastrula\nPresumptive neural ectoderm\nNeural plate\nNeural plate tissue forms\nPresumptive epidermis\nPresumptive neural ectoderm\nNeural plate\nEpidermis forms\nPresumptive epidermis\n\n7.22 fall 2005\npractice - exam 1\n4 of 10\nThe Tasks\n3.1 In order to perform this experiment, you need to know which piece of tissue is going\nto give rise to the normal neural plate, How would you determine this? What is this type\nof experiment called?\n3.2 Formulate two possible hypotheses that would explain the results described.\n3.3 The transcription factor NeuroD is expressed in late gastrula neural plate.\n3.3a Describe an experiment to test correlation of NeuroD expression with the ability to\nform a neural plate (show it).\n3.3b Describe a result consistent with this correlation.\n3.3c Describe a result inconsistent with this correlation.\n3.4a Describe a gain of function experiment to test function of NeuroD in neural plate\nformation (move it)\n3.4b Describe a result consistent with this function.\n3.4c Describe a result inconsistent with this function.\n3.5a Describe a loss of function experiment to test function of NeuroD in neural plate\nformation (lose it)\n3.5b Describe a result consistent with this function.\n\n7.22 fall 2005\npractice - exam 1\n3.5c Describe a result inconsistent with this function.\n4. The Observation\nIn an example we discussed in class, it was shown that while the animal half of an early\nsea urchin embryo does not form a normal pluteus larva, the micromeres can\nrescue development of the animal half. However, the micromeres contribute to only a\nfew of the rescued embryos tissues.\nFigure by MIT OCW.\n5 of 10\nNormal Development\nAnimal\nhemisphere\nAnimal Half Alone\nMicromeres\nPluteus larva\nDauerblastula\nComplete animalization\nAnimal Half And\nMicromeres\nRecognizable larva\nveg1\nan1\nveg2\nan2\n\n7.22 fall 2005\npractice - exam 1\n6 of 10\n4.2 What is an \"organizer\"? Do you think this phenomenon could illustrate the activity of\nan organizer? Why?\n4.3 The Delta protein is expressed in the micromeres of an intact sea urchin embryo.\nDelta is a secreted protein that acts on cells directly touching the secreting cell, via the\nNotch receptor.\n4.3a Formulate a hypothesis concerning activity of Delta in the micromeres.\n4.4a Describe an experiment to analyze correlation of Delta expression with the\nrescuing activity of the micromeres.\n4.4b Describe a result consistent with your hypothesis.\n4.4c Describe a result inconsistent with your hypothesis.\n4.5a Describe an experiment to analyze necessity of Delta in rescuing activity of the\nmicromeres.\n4.5b Describe a result consistent with your hypothesis.\n4.5c Describe a result inconsistent with your hypothesis.\n4.6a Describe an experiment to analyze sufficiency of Delta in rescuing activity of the\nmicromeres.\n4.6b Describe a result consistent with your hypothesis.\nThe Tasks\n4.1 What major process does this observation illustrate?\n\n7.22 fall 2005\npractice - exam 1\n4.6c Describe a result inconsistent with your hypothesis.\n5. First observation\nDuring the early stages of mouse lung formation, a group of epithelial cells divides and\nforms \"primary (1o) tubules\" which then branch and form additional secondary (2o)\ntubules, and eventually tertiary (3o) tubules. The epithelial cells touch a different cell\ntype, the lung mesenchyme.\nNOTE: Lung mesenchyme is present\nthroughout the period of lung tubule\nformation\nSecond observation\nThe lung mesenchyme can be removed and/or substituted with kidney mesenchyme, as\ndiagrammed below. In either case, tubules do not form.\n1o\n3o\n2o\nEpithelium\nLung mesenchyme\nEpithelium\nEpithelium\nRemove lung mesenchyme\nand add kidney mesenchyme\nRemove lung mesenchyme\nOR\nFigure by MIT OCW.\nFigure by MIT OCW.\n7 of 10\n\n7.22 fall 2005\npractice - exam 1\n8 of 10\nThe tasks\na. 10 points. Formulate a hypothesis regarding the roles of epithelium and\nmesenchyme in primary lung tubule formation, that takes the above\nobservations into account.\nb. 1 point. What fundamental process of developmental biology do these\nobservations illustrate? (one word)\nc. 15 points. The Fgf protein is expressed in the lung mesenchyme. Fgf is a\nsecreted protein (a ligand) that acts through a receptor tyrosine kinase.\nDescribe an experiment to examine correlation of Fgf expression with lung\ntubule formation.\nDescribe a result consistent with this correlation.\nDescribe a result inconsistent with this correlation.\nd. 15 points. Loss of function tests:\nDescribe an experiment to test necessity (loss of function) of Fgf for lung\ntubule formation.\n\n7.22 fall 2005\npractice - exam 1\n9 of 10\nDescribe a result consistent with necessity.\nDescribe a result inconsistent with necessity.\ne. 15 points. Gain of function tests:\nDescribe an experiment to test sufficiency (gain of function) of Fgf in lung\ntubule formation.\nDescribe a result consistent with sufficiency.\nDescribe a result inconsistent with sufficiency.\nf. 10 points. Where might you expect the Fgf receptor protein to be localized?\nInclude the cell types and expected subcellular localization.\nHow would you test this expectation?\n\n7.22 fall 2005\npractice - exam 1\ng. 10 points. While Fgf promotes lung tubule outgrowth, the lung mesenchyme\nalso produces the secreted Sprouty protein, that inhibits outgrowth of the\nprimary lung tubules. The dual action of Fgf and Sprouty therefore lead to\nprimary tubules of the correct length.\nFormulate a hypothesis regarding the molecular mechanism by which Sprouty and\nFgf might function together to regulate primary lung tubule formation.\n6. The observations\nIn vertebrates there are at least 19 different Fgf ligands and 4 different Fgf\nreceptors! Fgf8 is is expressed in the developing hindbrain, that will give rise to\nthe medulla and cerbellum. Fgf8 is essential for normal hindbrain development.\nFgf8 is also expressed in the developing limbs, where it is essential for normal\nlimb development.\nThe tasks\na. 10 points. Limb and hindbrain have very different functions. In what general\nways is hindbrain different from limb? Give an answer that uses your\nknowledge of cell and molecular biology.\nb. I point. The limb develops primarily from mesoderm, the hindbrain from\nectoderm. What is the developmental biological term that describes\ncollectively the ectoderm, mesoderm and endoderm? (one word)\nc. 15 points. If pure Fgf8 protein is applied to isolated ectoderm, the ectoderm\ngoes on to form a rudimentary hindbrain. If Fgf8 protein is applied to isolated\nmesoderm, the mesoderm goes on to form the beginnings of limbs.\nGive the developmental biological term that describes differences in the ability\nof a tissue to respond to the same stimulus. (one word)\nFormulate a hypothesis regarding the molecular mechanism by which the\nectoderm and mesoderm respond differently to applied Fgf8 protein.\n10 of 10"
    },
    {
      "category": "Exam",
      "title": "exam2_study_mcp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/b7fc676ea496c2843fa189d25db398e4_exam2_study_mcp.pdf",
      "content": "1 of 3\n7.22 Fall 2005\nstudy questions for exam 2\nThree Study Questions from MCP for Exam II 7.22 Nov 7,\n1) You are interested in establishing the beginning and end of the period in the cerebral\ncortex of the tasmanian devil (a fierce marsupial found in Tasmania Australia) when\ncerebral cortex neurons are first born and when neurogenesis is complete. You would\nalso like to establish whether the pattern of cell migration and settling is the same in the\ntasmanian devil and in mammals such as the ferret, mouse and rhesus monkey.\nConsequently using bromodeoxyuridine you pulse label tasmanian devils in utero\nbeginning on embryonic day 24, another litter is pulse-labeled at embryonic day 29\nanother set of newborns are pulse-labeled on the day of birth and a final set of animals\nare pulse labeled on postnatal day 4. You find the following pattern of\nbromodeoxyuridine labeled cells when the cortices of these devils are examined as young\njuveniles.\na)When are cortical layer 6 cells born?\nb)When are cortical layer 2/3 cells born?\nVentricle\nVentricle\nVentricle\nVentricle\nBrain surface\nBrain surface\nBrain surface\nBrain surface\nCortical layers\nCortical layers\nCortical layers\nCortical layers\nPULSED AT E24\nPULSED AT E29\nPULSED AT P0\nPULSED AT P4\nFigure by MIT OCW.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\n\n7.22 Fall 2005\nstudy questions for exam 2\n2 of 3\nc)Which cells have the longest migration path?\nd)You compare your pulse labeling pattern with that of ferrets pulsed at comparable\nstages of development.You find that young juvenile ferrets have no labeled cells above\nlayer 2/3 or below layer 6 when pulsed at a stage comparable to E24 in the tasmanian\ndevils. However you are surprised to find when you examine younger (P6) ferrets pulsed\nat the \"E24\" stage that they show the same bilayer pattern of expression as the tasmanian\ndevil. Can you suggest an explanation for what is going on between the P6 and young\njuvenile stage in the ferret cerebral cortex that is not going on in the young tasmanian\ndevils cortex?\ne)Suggest an experiment that would test your hypothesis.\nf)Would you have detected the bilayer pattern of cell genesis after an E24 pulse of BrdU\nif you had instead used a retrovirus with a reporter gene to label a few progenitors at\nE24?\n2) Exposure of Xenopus embryos to retinoic acid (RA) results in expansion of the Xhox 6\ngene into presumptive midbrain regions of the animal and a \"posteriorization\" of the\nembryos.\nYou obtain the upstream flanking region of the Xhox 6 gene and use restriction\nenzymes R, N K and B to produce the constructs illustrated below that you introduce into\nXenopus neural tube stage embryos bilaterally using electroporation.\nYou next take the groups of these embryos transfected with these constructs and\ndivide each construct group into 2 experimental groups: those treated with exogenous RA\n(w/RA) and those not treated with exogenous RA (w/o RA). You obtain the following\nMB = midbrain r = rhombdomere\ndata on LacZ expression in the midbrain and forebrain.\nR N\nR\nR\nN\n35 KB\nK\nB\nN\nK\nB\nMB-r2\nr3\nr4-r8\nw/RA\nw/o RA\nw/o RA\nw/o RA\nw/RA\nw/RA\nFigure by MIT OCW.\n\n7.22 Fall 2005\nstudy questions for exam 2\n3 of 3\na) What region of this 5' sequence appears to confer restriction of Xhox6 to r4-r8 in the\n'normal' embryos (the embryos untreated with RA)? Explain your reasoning.\nb) Where in this regulatory region is the retinoic acid responsive element (RARE)?\nExplain your reasoning.\n3. A variety of reagents and approaches are frequently used by developmental biologists\nto understand the tissue interactions and molecular signaling pathways involved in\nparticular aspects of development. Several of these approaches or reagents are listed\nbelow. To determine how well you understand \"how we know what we know\" in\nsystems where the forward genetics used in fruit flys and worms is difficult (at best) find\none example from your reading and lecture notes where this type of approach was used to\ndemonstrate and important developmental principle. Give the example and the\ndevelopmental principle illustrated.\na) Over-expression of a mRNA in the Xenopus zygote.\nb) Cross-species injection of an orthologous gene from Drosophila into a developing\nvertebrate embryo.\nc) Transgenic mouse carrying the entire regulatory region of Hoxb1 in front of the\nreporter gene LacZ.\nd) Knockout mouse for a known patterning gene.\ne) An incapacitated retrovirus with a strong promotor driving LacZ or green flourescent\nprotein genes.\nf) Exposure of a specified but undetermined tissue to different \"inducing\" tissues\nhypothesized to change the prospective fate of cells."
    },
    {
      "category": "Exam",
      "title": "exam2prac_answer.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/948319c73e0af53970e7475f7f599d6a_exam2prac_answer.pdf",
      "content": "1 of 9\n7.22 Fall 2005\nexam 2 practice - answers\n7.22 Exam II Practice Problems\n100 points (105 possible)\nRead the questions carefully! You will get more credit if you propose experiments\nappropriate for the organism involved and the stage of development assayed.\n1. 40 points Retinoic acid (structure below) is a small hydrophobic molecule that is\nderived from vitamin A.\nIt is synthesized as indicated below.\nAs diagrammed below, retinoic acid binds to a nuclear receptor dimer\n(RAR+RXR) displacing a transcriptional corepressor. The retinoic acid/receptor\ncomplex binds a coactivator and then changes the transcription of target genes\nby binding to a promoter sequence, the RARE, present in all target promoters.\nCOOH\nFigure by MIT OCW.\nFigure by MIT OCW.\nFigure by MIT OCW.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\nNO LIGAND\nRARE\nRXR\nRA\nCorepressor\nX\nLIGAND\nRetinoic Acid\nRARE\nRXR RAR\nCoactivator\n\n7.22 Fall 2005\nexam 2 practice - answers\n2 of 9\nPutting gastrula stage (10 hours after fertilization) frog embryos into a solution of retinoic\nacid leads to huge expansion of the embryonic heart, as assayed at hatching stage (48\nhours after fertilization).\na. 5 points What can you conclude from this result, regarding the normal\nfunction of retinoic acid in heart formation? Explain your answer.\nConclude that retinoic acid can change heart development, however this does not\nindicate it is normally involved in heart formation. One would need to show\nretinoic acid is present in the correct region at the correct time, and is required for\nheart development.\nb. 20 points total How would you ask whether endogenous retinoic acid is\nrequired for heart formation? Suggest a plausible experiment based on\nabove information, remembering that retinoic acid is not a protein.\n10 points.\nCan ablate function of the synthetic enzyme, retinaldehyde dehydrogenase and\nask whether heart formation is affected. I would inject morpholino antisense\noligonucleotides into the one cell embryo, directed against retinaldehyde\ndehydrogenase mRNA. These will prevent translation of the protein. Later, I will\nask whether heart formation is affected. If retinoic acid is required for this\nprocess, its synthesis should have been ablated and levels therefore depleted.\nAnother good way would be to inject mRNA encoding a dominant negative RAR or\nRXR that would prevent retinoic acid from acting to change transcription.\nDescribe a positive control for this experiment and explain the purpose of\nthe control. 5 points.\nMy positive controls would check that retinoic acid was depleted by inhibition of\nthe synthetic enzyme. Check for the presence of retinoic acid in the embryo after\nretinaldehyde dehydrogenase inhibition. Can do this by homogenizing embryos\nand isolating the retinoic acid and monitoring its concentration. This should be\npresent at much lower levels after MO treatment than in control embryos.\nAnother way is to examine the expression of a gene you know to be normally\nactivated by retinoic acid. Such a gene should not be expressed if endogenous\nretinoids have been depleted. This would show that the embryo can no longer\nrespond to retinoic acid.\nDescribe a negative control for this experiment and explain the purpose of\nthe control. 5 points.\nInject a control MO oligo at the same concentrations used for the experiment.\nMonitor heart formation, this should be normal. This control will indicate that any\neffects seen are not a non-specific result of the MO.\n\n7.22 Fall 2005\nexam 2 practice - answers\n3 of 9\nThe heart forms by interaction of mesoderm and endoderm, beginning at early gastrula,\nand extending for 48 hours in frogs, until hatching stages when the heart begins to beat.\nc. 1 point What is the term for the process of organ formation?\norganogenesis\nd. 4 points Distinguish between\nDifferentiation and\nThe process by which a cell assumes its final fate.\nDetermination\nThe process by which a cell decides its fate.\ne. 10 points. Assuming retinoic acid is important for normal heart formation,\ndescribe an experiment (or a series of related experiments) to ask when\nretinoic acid is important?\nOne would want to remove retinoic acid at various times of development.\nOne way would be to add a soluble retinoic acid inhibitor at different times\n(blastula, gastrula, neurula and tailbud for example) and ask when later heart\ndevelopment is disrupted. For example, 4-oxo retinoic acid can inhibit retinoic\nacid function. One could use this as an inhibitor.\nAnother way is to have a dominant negative RAR or RXR under inducible control,\nand activate it at different times of development. For example, one could make a\ntransgenic frog expressing dominant negative RAR under a heat shock inducible\npromoter. Embryos could be heat shocked at various times after fertilization to\ninterrupt retinoic acid signaling, and heart formation later examined.\n2. 60 points (65 possible) Tooth loss is an important medical problem, since in\nhumans, permanent teeth do not regenerate. There is therefore considerable\ninterest in understanding tooth formation, with a view to getting teeth to regrow.\na. Teeth develop from the neural crest.\n3 points. From what organ does the \"neural crest\" arise?\nNeural tube\n\n7.22 Fall 2005\nexam 2 practice - answers\n4 of 9\n2 points Of what germ layer is it part?\nEctoderm\nAs diagrammed above, the tooth primordium forms from an interaction between\nmandibular (jaw) epithelium and mesenchyme. In mouse embryos, at E12 (12 days after\nfertilization), the dental mesenchyme (dm) induces (arrow) the dental epithelium (de) to\nform a bud. At E13, condensed mesenchymal cells (dm) surround the epithelial bud (de),\nand the dental epithelium now signals (arrow) the mesenchyme to form at E14, an\nenamel knot (ek). This is a non-dividing group of cells that induces (arrows) subsequent\ntooth formation. Ablation (removal) of the enamel knot prevents tooth formation.\nSeveral genes have been identified that when deleted lead to absence of teeth in the\nnewborn mouse (born at 21 days after fertilization). Three of these genes encode the\ntranscription factors Lef1, Msx1 and Runx2.\nb. 20 points total. Describe a simple experiment that would indicate\nwhether Lef1, Msx1 and Runx2 are likely to act simultaneously or\nsequentially during tooth development. 10 points\nAsk when each gene is expressed (most important) and where. Perform in situ\nhybridization for Lef1, Msx1 and Runx2 mRNA expression. Use antisense (RNA)\nprobes labeled with a nucleotide that can later be detected. Could also use\nantibodies to each and perform immunocytochemistry to detect protein. Incubate\nembryos (or tooth primordia) of different stages with each probe. Ask whether the\ngenes are expressed sequentially, which would indicate they are likely to act\nsequentially. Can also ask whether the proteins are expressed in different regions\nof the tooth primordium which would give more information regarding the tissues\nin which each acts.\nDescribe a positive control and indicate the purpose of this. 5 points\nFigure by MIT OCW.\nde\nde\nde\ndm\ndm\ndp\nek\nE12\nE13\nE14\n\n7.22 Fall 2005\nexam 2 practice - answers\n5 of 9\nPerform in situ hybridization or immunocytochemistry with a probe to a gene(s)\nknown to be expressed at each time of development assayed. This will indicate\nthe experimental protocol is working.\nDescribe a negative control and indicate the purpose of this. 5 points\nUse a sense probe (for each gene tested) or preimmune serum at each stage\nassayed. This will indicate that any signal seen is not a result of non-specific\nstaining.\nThe enamel knot expresses Fgf3, Shh and BMP2. In the Runx2 mutant, teeth do not\nform. In this mutant, Fgf3 expression is absent, but BMP2 and Shh are expressed\nnormally. In the Msx1 mutant, Fgf3 expression is normal, but teeth do not form.\nc. 25 points Based on the above information, formulate a hypothesis\nregarding genetic circuitry involving Runx2, Msx1, Fgf3, Shh and BMP2.\nUse a diagram to illustrate your hypothesis. 5 points\nRunx2 >>> Fgf3\nMsx1>>> Shh + BMP2\nFgf3 +Shh + BMP2 >>> tooth formation\nPropose an experiment to test this hypothesis. 10 points\nAsk in an Msx1 mutant whether Shh and/or BMP2 are expressed. Can use in situ\nhybridization or immunocytochemistry as described for b.\nDescribe a result consistent with your hypothesis. 5 points\nBMP2 and/or Shh are not expressed in the Msx1 mutant\nDescribe a result inconsistent with your hypothesis. 5 points\nBMP2 and Shh are expressed normally, at the protein level, in the Msx1 mutant.\n(Knowing just RNA expression is normal is less conclusive than knowing protein\nexpression is normal).\n\n7.22 Fall 2005\nexam 2 practice - answers\n6 of 9\nIn lower vertebrates, including the zebrafish, teeth regenerate continuously, suggesting\ninvolvement of stem cells.\nd. 15 points total. What is a stem cell? 4 points\nA stem cell is self-renewing and also gives rise to progeny\ndetermined for a particular cell lineage.\nWhat simple experiment would you perform to detect the position of potential\nstem cells in the zebrafish tooth region? 7 points\nLook for the presence of dividing cells in the developing tooth\nregion. Use BrdU (a Thymidine analog) to label fish tooth primordial\nduring tooth formation. As new teeth form, the putative stem cells\nwill divide, to renew themselves and to give rise to the future tooth\nepithelium and/or mesenchyme. Other regions may also divide and\nthis may complicate the analysis. One addition to this experiment\nthat would help is to look where the BrdU labeled cells move to- the\nstem cells should stay in place, the cells that are renewing the tooth\nshould move away. Thus a pulse/chase experiment with BrdU is\nbest.\nDescribe the idea behind an experiment to test whether the cells you have\nidentified are tooth stem cells. You do not need to go into detail. 4 points\nIsolate the putative stem cells by dissection. Transplant these to the jaw region of\na fish defective in tooth formation (a Runx2 mutant, for example). Could also do\nthis in wild type fish. Use labeled putative stem cells (for example, labeled with\nGFP) and ask whether green teeth form after the transplant.\n3.) Below is a long practice question that will reflect the type of exam question\nyou will see tomorrow. I will send you answers later.\nIn mouse mutants resulting from a chemical mutagenesis screen involving the\nmutagen ethyl nitrosourea (ENU), mutation of the CBFA1 transcription factor is\n\n7.22 Fall 2005\nexam 2 practice - answers\n7 of 9\ncorrelated with failure of the embryonic skeleton to make bone, when assayed in\nF2 embryos.\na. Can you say with certainty that CBFA1 is causal of bone formation?\nExplain your answer. Describe an experiment that would change\nyour answer. Include a positive and negative control, and indicate\nwhat each is controlling for.\nNo, you cannot say this. Since chemical mutagenesis affects multiple genes,\nmany generations of outcrossing to wild type strains is necessary to isolate the\nmutant of interest from other mutations that co-segregate.\nIn order to have greater confidence in a role for CBFA1 in bone formation, I\nwould perform an outcrossing experiment over many generations and\nscreen for retention of the CBFA1 mutant allele. Any animals homozygous\nfor mutant CBFA1 should have the bone phenotype.\nOne positive control would show that animals without the CBFA1 mutant\ngene have normal bone. This would further confirm that CBFA1 is required\nfor bone formation, and that the mutagenesis did not cause weird effects\nthat led to widespread bone disruption.\nOne negative control would be to show that unmutagenized animals do not\ndisplay bone defects. This would indicate that there is a very low\nbackground of mutant genes prior to application of the chemical, and help\nconfirm that mutant CBFA1 is causal of the phenotype.\nb. Describe a different experimental approach that would make you\nmore certain that the CBFA1 gene is necessary for bone formation.\nMake a targeted deletion of the CBFA1 gene in a wild type mouse strain, using\nhomologous recombination.\n\n7.22 Fall 2005\nexam 2 practice - answers\n8 of 9\nc. How would you determine whether CBFA1 activity is likely to play a\ndirect role in bone formation (that is, in the future bone cells)? This\nis a correlation question. Describe a positive and negative control\nfor the experiment you propose, and indicate what each is\ncontrolling for.\nPerform in situ hybridization for CBFA1 RNA. Use an antisense probe labeled with\na modified nucleotide that can be detected later in a color reaction. This will\nhybridize with endogenous CBFA1 RNA. Ask whether color is observed in future\nbone cells.\nPositive control. Use a probe for another gene that should be expressed at\nthe same time of development, preferably in the same region of the\nembryo. This will show the in situ method is working.\nNegative control. Use a sense probe from the CBFA1 cDNA. No signal\nshould be observed. This will indicate the hybridization observed is\nspecific for CBFA1.\nd. How would you determine whether CBFA1 is sufficient to cause\nbone formation? Describe a plausible experiment and the most\nimportant positive and negative controls (one of each) that you\nwould perform. Indicate the purpose of each control.\nExpress CBFA1 protein in non-bone cells. This can be done in mouse embryos by\ninjecting an inducible promoter-driven CBFA1 DNA vector into the zygote and\nactivating expression later. One can do this in a tissue-specific way. I would\nexpress CBFA1 in the somites from which most bone is derived and ask whether I\nlater see extra bone made.\nAs a positive control, I would express a protein known to be bioactive via a\nsimilar vector. This would indicate that the embryo can respond to proteins\nexpressed ectopically.\nAs a negative control, I would inject the vector alone, or one\nexpressing what should be a non-bioactive protein, such as GFP.\ne. Mutants in BMP2 also fail to form bone. What is BMP2? Briefly\ndescribe the pathway by which it acts.\nBMP2 is a ligand of the TGFbeta superfamily. It binds to serine/threonine kinase\nreceptors. When occupied, these phosphorylate Smads, transcription factors that\ncan translocate to the nucleus when phosphorylated and alter transcription.\nf. How would you determine whether BMP2 and CBFA1 act in the\nsame or different pathways? Describe an experimental approach,\n\n7.22 Fall 2005\nexam 2 practice - answers\n9 of 9\npossible results and interpretations of each result. For the\nexperimental approach, include one positive and one negative\ncontrol, and indicate the purpose of each.\nOne hypothesis is that if these proteins act in the same pathway, one might\nactivate expression of the other. Examine BMP2 mutant embryos for CBFA1 RNA\nexpression and vice versa. If CBFA1 expression is lost in BMP2 mutants (or vice\nversa), that is consistent with these proteins acting in the same pathway.\nPositive control. Examine RNA expression of another gene known to be\ndownstream of BMP2, and this should be lost in a BMP2 mutant. This\nwould show that the mutant does have an effect on gene expression, and\nwould also control for the in situ procedure working.\nNegative control. Show that expression of genes known not be\ndownstream of BMP2 is unaffected. Would indicate that BMP2 is not having\na generally deleterious effect on the embryo."
    },
    {
      "category": "Exam",
      "title": "exam2pracprobs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/cb817683cbb7a0188a9b0f03568357d1_exam2pracprobs.pdf",
      "content": "7.22 Fall 2005\nexam 2 practice\n1 of 9\n7.22 Exam II Practice Problems\n100 points (105 possible)\nRead the questions carefully! You will get more credit if you propose experiments\nappropriate for the organism involved and the stage of development assayed.\n1. 40 points Retinoic acid (structure below) is a small hydrophobic molecule that is\nderived from vitamin A.\nIt is synthesized as indicated below.\nAs diagrammed below, retinoic acid binds to a nuclear receptor dimer\n(RAR+RXR) displacing a transcriptional corepressor. The retinoic acid/receptor\ncomplex binds a coactivator and then changes the transcription of target genes\nby binding to a promoter sequence, t\nCOOH\nFigure by MIT OCW.\nFigure by MIT OCW.\nFigure by MIT OCW.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\nLIGAND\nRetinoic Acid\nRARE\nRXR RAR\nCoactivator\nNO LIGAND\nRARE\nRXR\nRA\nCorepressor\nX\n\n7.22 Fall 2005\nexam 2 practice\n2 of 9\nPutting gastrula stage (10 hours after fertilization) frog embryos into a solution of retinoic\nacid leads to huge expansion of the embryonic heart, as assayed at hatching stage (48\nhours after fertilization).\na. 5 points What can you conclude from this result, regarding the normal\nfunction of retinoic acid in heart formation? Explain your answer.\nb. 20 points total How would you ask whether endogenous retinoic acid is\nrequired for heart formation? Suggest a plausible experiment based on\nabove information, remembering that retinoic acid is not a protein.\n10 points.\nDescribe a positive control for this experiment and explain the purpose of\nthe control. 5 points.\nDescribe a negative control for this experiment and explain the purpose of\nthe control. 5 points.\nThe heart forms by interaction of mesoderm and endoderm, beginning at early gastrula,\nand extending for 48 hours in frogs, until hatching stages when the heart begins to beat.\n\n7.22 Fall 2005\nexam 2 practice\n3 of 9\nc. 1 point What is the term for the process of organ formation?\nd. 4 points Distinguish between\nDifferentiation and\nDetermination\ne. 10 points. Assuming retinoic acid is important for normal heart formation,\ndescribe an experiment (or a series of related experiments) to ask when\nretinoic acid is important?\n\n7.22 Fall 2005\nexam 2 practice\n4 of 9\n2. 60 points (65 possible) Tooth loss is an important medical problem, since in\nhumans, permanent teeth do not regenerate. There is therefore considerable\ninterest in understanding tooth formation, with a view to getting teeth to regrow.\na. Teeth develop from the neural crest.\n3 points. From what organ does the \"neural crest\" arise?\n2 points Of what germ layer is it part?\nAs diagrammed above, the tooth primordium forms from an interaction between\nmandibular (jaw) epithelium and mesenchyme. In mouse embryos, at E12 (12 days after\nfertilization), the dental mesenchyme (dm) induces (arrow) the dental epithelium (de) to\nform a bud. At E13, condensed mesenchymal cells (dm) surround the epithelial bud (de),\nand the dental epithelium now signals (arrow) the mesenchyme to form at E14, an\nenamel knot (ek). This is a non-dividing group of cells that induces (arrows) subsequent\ntooth formation. Ablation (removal) of the enamel knot prevents tooth formation.\nFigure by MIT OCW.\nde\nde\nde\ndm\ndm\ndp\nek\nE12\nE13\nE14\n\n7.22 Fall 2005\nexam 2 practice\n5 of 9\nSeveral genes have been identified that when deleted lead to absence of teeth in the\nnewborn mouse (born at 21 days after fertilization). Three of these genes encode the\ntranscription factors Lef1, Msx1 and Runx2.\nb. 20 points total. Describe a simple experiment that would indicate\nwhether Lef1, Msx1 and Runx2 are likely to act simultaneously or\nsequentially during tooth development. 10 points\nDescribe a positive control and indicate the purpose of this. 5 points\nDescribe a negative control and indicate the purpose of this. 5 points\n\n7.22 Fall 2005\nexam 2 practice\n6 of 9\nThe enamel knot expresses Fgf3, Shh and BMP2. In the Runx2 mutant, teeth do not\nform. In this mutant, Fgf3 expression is absent, but BMP2 and Shh are expressed\nnormally. In the Msx1 mutant, Fgf3 expression is normal, but teeth do not form.\nc. 25 points Based on the above information, formulate a hypothesis\nregarding genetic circuitry involving Runx2, Msx1, Fgf3, Shh and BMP2.\nUse a diagram to illustrate your hypothesis. 5 points\nPropose an experiment to test this hypothesis. 10 points\nDescribe a result consistent with your hypothesis. 5 points\nDescribe a result inconsistent with your hypothesis. 5 points\n\n7.22 Fall 2005\nexam 2 practice\n7 of 9\nIn lower vertebrates, including the zebrafish, teeth regenerate continuously, suggesting\ninvolvement of stem cells.\nd. 15 points What is a stem cell? 4 points\nWhat simple experiment would you perform to detect the position of potential\nstem cells in the zebrafish tooth region? 7 points\nDescribe the idea behind an experiment to test whether the cells you have\nidentified are tooth stem cells. You do not need to go into detail. 4 points\n\n7.22 Fall 2005\nexam 2 practice\n8 of 9\n3.) In mouse mutants resulting from a chemical mutagenesis screen involving the\nmutagen ethyl nitrosourea (ENU), mutation of the CBFA1 transcription factor is\ncorrelated with failure of the embryonic skeleton to make bone, when assayed in\nF2 embryos.\na. Can you say with certainty that CBFA1 is causal of bone formation?\nExplain your answer. Describe an experiment that would change\nyour answer. Include a positive and negative control, and indicate\nwhat each is controlling for.\nb. Describe a different experimental approach that would make you\nmore certain that the CBFA1 gene is necessary for bone formation.\nc. How would you determine whether CBFA1 activity is likely to play a\ndirect role in bone formation (that is, in the future bone cells)? This\nis a correlation question. Describe a positive and negative control\nfor the experiment you propose, and indicate what each is\ncontrolling for.\n\n7.22 Fall 2005\nexam 2 practice\n9 of 9\nd. How would you determine whether CBFA1 is sufficient to cause\nbone formation? Describe a plausible experiment and the most\nimportant positive and negative controls (one of each) that you\nwould perform. Indicate the purpose of each control.\ne. Mutants in BMP2 also fail to form bone. What is BMP2? Briefly\ndescribe the pathway by which it acts.\nf. How would you determine whether BMP2 and CBFA1 act in the\nsame or different pathways? Describe an experimental approach,\npossible results and interpretations of each result. For the\nexperimental approach, include one positive and one negative\ncontrol, and indicate the purpose of each."
    },
    {
      "category": "Exam",
      "title": "exam2studymcpans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/c184e73b63e5dce5e3d62615f58d2cca_exam2studymcpans.pdf",
      "content": "1 of 4\n7.22 Fall 2005\nMCP - example problems - ANS\n1) You are interested in establishing the beginning and end of the period in the cerebral\ncortex of the tasmanian devil (a fierce marsuptial found in northeastern Australia) when\ncerebral cortex neurons are first born and when neurogenesis is complete. You would\nalso like to establish whether the pattern of cell migration and settling is the same in the\ntasmainian devil and in mammals such as the ferret mouse and rhesus monkey.\nConsequently using bromodeoxyuridine you pulse label tasmanian devils in utero\nbeginning on embryonic day 24, another litter is pulse-labeled at embryonic day 29\nanother set of newborns are pulse labeled on the day of birth and a final set of animals are\npulse labeled on postnatal day 4. You find the following pattern of bromodeoxyuridine\nlabeled cells when the cortices of these ferrets are examined as young juveniles.\na)When are cortical layer 6 cells born? Would be E29\nb)When are cortical layer 2/3 cells born? On the day of birth PO\nVentricle\nVentricle\nVentricle\nVentricle\nBrain surface\nBrain surface\nBrain surface\nBrain surface\nCortical layers\nCortical layers\nCortical layers\nCortical layers\nPULSED AT E24\nPULSED AT E29\nPULSED AT P0\nPULSED AT P4\nFigure by MIT OCW.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton\n\n7.22 Fall 2005\nMCP - example problems - ANS\n2 of 4\nc)Which cells have the longest migration path? The cells born on P0\nYou compare your pulse labeling pattern with that of ferrets pulsed at comparable stages\nof development.\nd)You find that young juvenile ferrets have no labeled cells above layer 2/3 or below layer 6\nwhen pulsed at a stage comparable to E24 in the tasmanian devils. However you are surprised to\nfind when you examine younger (P6) ferrets pulsed at the \"E24\" stage that they show the same\nbilayer pattern of expression as the tasmanian devil. Can you suggest an explanation for what is\ngoing on between the P6 and young juvenile stage in the ferret cerebral cortex that is not going\non in the young tasmanian devils cortex?\nOne of 2 things either the top and bottom cells are dying between P6 and the young\njuvenile or they start to divide in early postnatal life and dilute out their label.\ne)Suggest an experiment that would test your hypothesis.\nIf they started to divide between P6 and the young juvenile a pulse given at say P12\nshould produce some heavily labeled cell when the cortex is examined a day later. If\ncells were undergoing programed cell death they might express vertebrate orthologs\nof c elegans cell death genes.\nf)Would you have detected the bilayer pattern of cell genesis after and E24 pulse of\nBrdU if you had used a retrovirus with a reporter gene to label a few progenitors at E24?\nNo because the retrovirus will label the progeny of dividing cells but because it will\nnot become diluted out with subsequent cell division all progeny of the stem cell will\nbe labeled not just those cell that leave the mitotic cycle soon after labeling.\n2) Exposure of Xenopus embryos to retinoic acid (RA) results in expansion of the Xhox 6\ngene into presumptive midbrain regions of the animal and a \"posteriorization\" of the\nembryos.\nYou obtain the upstream flanking region of the Xhox 6 gene and use restriction\nenzymes R, N K and B to produce the constructs illustrated below that you introduce into\nXenopus neural tube stage embryos bilaterally using electroporation.\nYou next take the groups of these embryos transfected with these constructs and\ndivide each construct group into 2 experimental groups: those treated with exogenous RA\nMB = midbrain r = rhombdomere\n(w/RA) and those not treated with exogenous RA (w/o RA). You obtain the following\nR N\nR\nR\nN\n35 KB\nK\nB\nN\nK\nB\nMB-r2\nr3\nr4-r8\nw/RA\nw/o RA\nw/o RA\nw/o RA\nw/RA\nw/RA\nFigure by MIT OCW.\n\n7.22 Fall 2005\nMCP - example problems - ANS\n3 of 4\ndata on LacZ expression in the midbrain and forebrain.\na) What region of this 5' sequence appears to confer restriction of Xhox6 to r4-r8 in the\n'normal' embryos (the embryos untreated with RA)? Explain your reasoning. K-B\nbecause expression in animals without RA treatment is restricted to r4-r6 only\nwhen the fragment R-K is present not when either R-N or N-K is present.\nb) Where in this regulatory region is the retinoic acid responsive element (RARE)?\nExplain your reasoning. RN because given that there is negative regulatory element in\nKB R-K should not show expression in either MB-r2 or r3 with RA unless their was\na positive RARE in one of the other regulatory fragment. The only regulatory\nfragment that shows Xhox 6 expression in anterior segments in the absence of the\ninhibitory fragment KB is RN\n3). A variety of reagents and approaches are frequently used by developmental biologists\nto understand the tissue interactions and molecular signaling pathways involved in\nparticular aspects of development. Several of these approaches or reagents are listed\nbelow. To determine how well you understand \"how we know what we know\" in\nsystems where the forward genetics used in fruit flys and worms is difficult (at best) find\none example from your reading and lecture notes where this type of approach was used to\ndemonstrate and important developmental principle. Give the example and the\ndevelopmental principle illustrated.\na) Over-expression of a mRNA in the Xenopus zygote. Over expression of BMP4\nventralizes the embryo; overexpression of goosecoid dorsalizes the embryo;\noverexpression of a mutant FGF receptor subunit anteriorizes the embryo etc.\nb) Trans-species injection of an orthologous gene from Drosophila into a developing\nvertebrate embryo. Injection of Sog into the belly region of of Xenopus early gastrula\nstage embryos induces a second embryonic axis. Sog and Chordin are orthologous\nprotein that have also retained a similar function. Could also use the Dickkopf\nexample that is stated in guestion 4 below.\nc) Transgenic mouse carrying the entire regulatory region of Hoxb1 in front of the\nreporter gene LacZ. LacZ product is obvious in an anterior rhobdomere and then in\nthe last 2 rhombomeres with a slowly decreasing expression down the spinal cord.\n\n7.22 Fall 2005\nMCP - example problems - ANS\n4 of 4\nd) Knockout mouse for a known patterning gene. Lim1 knockout mouse blocks head\nformation. Pups are born headless and then die. Hoxc8 knockout shows a homeotic\ntransformation of the first lumbar vertebrae into a rib-bearing chest vertebrae. (etc)\ne) An incapacitated retrovirus with a strong promotor driving LacZ or green flourescent\nprotein genes. A non-diluting lineage tracer. Could label cells in the posterior\nmarginal zone of early chick embryos and show that the label winds up in the\nnotochord and paraxial mesoderm. Could label a cell in the expanding progenitor\npopulation of the cerebral lobes in a mouse embryo and find that a large \"wedge\" of\ncortex is labeled when the animals are examined after birth,\nf) Exposure of a specified but undetermined tissue to different \"inducing\" tissues\nhypothesized to change the prospective fate of cells. Xenopus \"animal cap\" exposed to\nventral/ventral endoderm blastomeres. Get ventral to ventral lateral mesoderm\ndifferentiating eg blood, kidney."
    },
    {
      "category": "Exam",
      "title": "self_quiz_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/2f4ee1e0b5bf18ff1fe0ab4ee106c313_self_quiz_05.pdf",
      "content": "7.22/ 7.72 Self Quiz\nMon Sep 26, 2005\n1. Class challenge 1: UV irradiation prevents microtubule polymerization. What is\nthe target of UV?\n2. Class challenge 2: In general terms, what are \"antisense\" techniques?\n3. Class challenge 3: Formation of the brain (anterior) seems to involve many\ninhibitors. Any ideas why this might be so? Consider that the forebrain may have\nevolved after the hindbrain.\n4. Distinguish the concepts of \"determination\" and \"differentiation\"\n5. The typical four part signaling pathway includes:\nligand, receptor, connectors, targets\nFor the Wnt pathway, which component corresponds to which part:\nFrizzled, b-catenin, Wnt, siamois?\nFor the TGFb pathway, which corresponds to which part:\nSmads, activin, nodal?\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton"
    },
    {
      "category": "Exam",
      "title": "self_quiz_ans_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/9c40b6dad278c2dea153dad3972a6a78_self_quiz_ans_05.pdf",
      "content": "7.22/ 7.72 Self Quiz Answers\nMon Sep 26, 2005\n1. Class challenge 1: UV irradiation prevents microtubule polymerization. What is\nthe target of UV?\nThe GTP \"cap\" on the growing end of the microtubule that is essential for\npolymerization is removed by UV.\n2. Class challenge 2: In general terms, what are \"antisense\" techniques?\nTechniques that exploit nucleic acid base pairing to inhibit translation or\nsplicing, to destabilize RNAs, or sometimes to inhibit transcription.\nAntisense nucleic acid is oligonucleotides (usually modified to increase\nstability) or RNAs.\n3. Class challenge 3: Formation of the brain (anterior) seems to involve many\ninhibitors. Any ideas why this might be so? Consider that the forebrain may have\nevolved after the hindbrain.\nStill under discussion!\n4. Distinguish the concepts of \"determination\" and \"differentiation\"\nDetermination is the decision making process that a cell undergoes on the\npathway to its final fate. Differentiation is the final functional fate.\nThere are many steps in determination, and even the final fate may be\ndifficult to identify.\n5. The typical four part signaling pathway includes:\nligand, receptor, connectors, targets\nFor the Wnt pathway, which component corresponds to which part:\nFrizzled, b-catenin, Wnt, siamois?\nReceptor, connector, ligand, target\nFor the TGFb pathway, which corresponds to which part:\nSmads, activin, nodal?\nConnector, ligand, ligand\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton"
    },
    {
      "category": "Exam",
      "title": "quiz_10_5_05ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/ecc9f49a515ccc6d2adca26aaa27d35a_quiz_10_5_05ans.pdf",
      "content": "7.22/ 7.72 Self quiz- answers\nWed Oct 5, 2005\n1. In developmental biology, what is meant by the term \"axis\"?\nA set of positional coordinates, that define the relative positions of a\nspecific set of tissues or organs within the embryo.\n2. Consider these terms in the context of development and evolution.\nWhat is a homolog?\nA DNA sequence in one organism that is similar to that in another\norganism, and is believed to be evolutionary related.\nWhat is a paralog?\nA DNA sequence related to another in the same species, that is believed to\nhave formed by duplication of an ancestral copy.\nWhat is an ortholog?\nA DNA sequence in one organism corresponding to precisely the same\nfunctional sequence in another organism. That is, orthologs are very\nclosely related homologs.\nWhat is an analog?\nSomething with a similar function to something else, but that may be\nunrelated. For example, a bat wing and insect wing. Not usually used in an\nevolutionary sense, although that is debatable.\n3. When thinking about experimental design, what is a control?\nWhat is a positive control?\nWhat is a negative control?\nConsider the example of in situ hybridization (what is this?) for the gene cyp26.\nDescribe a positive and negative control for this analysis.\nMassachusetts Institute of Technology\nDepartment of Biology\n7.22, Fall 2005 - Developmental Biology\nInstructors: Professor Hazel Sive, Professor Martha Constantine-Paton"
    },
    {
      "category": "Resource",
      "title": "principles_devel.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-22-developmental-biology-fall-2005/8672ffadbde8b5d4f03ed5408c7a400c_principles_devel.pdf",
      "content": "Principles of Development\n7.22/7.72 Fall 2005\nPrinciples are in boldface, specific terms you should know are in boldface italic.\n1. Development occurs in four dimensions: in three-dimensional space and over time.\n2. Complexity of the embryo increases over time, in a stepwise, hierarchical fashion.\n3. Symmetry must repeatedly be broken to allow formation of different daughter cells or\nfunctionally distinct regions.\n4. The progression of a naive cell towards its final function (fate) includes the decision\nto assume a fate (determination) and formation of the final fate (differentiation).\n5. Determination and differentiation each involve multiple, sequential steps.\n6. There are many possible cell fates.\n7. Information that controls cell type can be distinct from information that indicates\nthe position or shape of a cell in an embryo.\n8. Development is controlled by spatially and temporally regulated differential gene\nexpression.\n9. Different cells express different regulatory genes that control fate decisions, and\ndifferent differentiation genes that control final cell function.\n10. A combinatorial code of gene expression allows many different developmental\ndecisions using a limited number of genes.\n11. Gene function is conserved through evolution (homologs, orthologs).\n12. Chromatin structure plays a crucial role in regulating gene expression (epigenetics).\n13. Embryonic regulatory molecules may be stored in the egg (maternal factors) or\nproduced by new transcription after fertilization (zygotic factors).\n14. Cells can read and interpret chemical, electrical and mechanical signals originating\nfrom other cells or the environment.\n15. Cell communication can alter cell fate (induction). Thus, regulatory molecules can\nact between cells, that is, non-autonomously (inducers).\n16. Cell fate can be controlled by inherited regulatory molecules, which act cell\nautonomously (determinants).\n7.22/7.72 Fall 2005\n1 of 2\n\nDevelopmental Principles 2005\n17. Cells respond differently to the same signal when it is presented at different\nconcentrations (morphogen). Continuous information contained within a concentration\ngradient is converted to a discrete outcome through thresholds of activation.\n18. Cell fate can be regulated by independent initiation and maintenance mechanisms.\n19. The number of cell fates that a cell has the potential to assume progressively\ndiminishes as development proceeds (potency).\n20. Cell fate decisions are generally stable.\n21. Cells can have restricted temporal and spatial ability to respond to signals\n(competence).\n22. Groups of cells have the potential to assume a particular fate (equivalence group,\nfield), but often only part of the group does so.\n23. Cell fate decisions often involve both stimulatory and inhibitory signals. Stimulatory\nsignals encourage cells to adopt a specific fate whereas inhibitory signals prevent a cell\nfrom adopting an alternate fate.\n24. Cells may inhibit their neighbors from assuming the same fate (lateral inhibition).\n25. Similar cells may cooperate to promote formation of their fate (community effect).\n26. Cells that can generate replacements for a specific cell type may be present in many\nembryonic and adult tissues (stem cells).\n27. Development requires both cell division (proliferation) and cell death (apoptosis).\n28. Cells can form sheets (epithelia) or persist as single cells (mesenchyme).\n29. Single cells can move (migrate). Direction of migration can be regulated (guidance\nmolecules).\n30. Cells can sort into groups of like cells, through selective adherence to each other and to\nthe extracellular matrix.\n31. Groups of similar cells can become a functional unit (tissue).\n32. Boundaries are established to keep cells where they need to be (compartments).\n33. Groups of tissues can work together for a common function (organ).\n34. Cells move or change shape to build three-dimensional structures (morphogenesis).\n35. Three-dimensional organization of tissues is required for organ function\n(morphogenesis)."
    }
  ]
}