{
  "course_name": "Differential Equations",
  "course_description": "Differential Equations are the language in which the laws of nature are expressed. Understanding properties of solutions of differential equations is fundamental to much of contemporary science and engineering. Ordinary differential equations (ODE’s) deal with functions of one variable, which can often be thought of as time.",
  "topics": [
    "Mathematics",
    "Differential Equations",
    "Linear Algebra",
    "Mathematics",
    "Differential Equations",
    "Linear Algebra"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nPrerequisites/Corequisites\n\n18.03 Differential Equations\nhas\n18.01 Single Variable Calculus\nas a prerequisite.\n18.02 Multivariable Calculus\nis a corequisite, meaning students can take 18.02 and 18.03 simultaneously.\n\nTexts\n\nEdwards, C., and D. Penney.\nElementary Differential Equations with Boundary Value Problems\n. 6th ed. Upper Saddle River, NJ: Prentice Hall, 2003. ISBN: 9780136006138.\n\nNote: The 5th Edition (ISBN: 9780131457744) will serve as well.\n\nStudents also need two sets of notes \"\n18.03: Notes and Exercises\n\" by Arthur Mattuck, and \"\n18.03 Supplementary Notes\n\" by Haynes Miller.\n\nDescription\n\nThis course is a study of Ordinary Differential Equations (ODE's), including modeling physical systems.\n\nTopics include:\n\nSolution of First-order ODE's by Analytical, Graphical and Numerical Methods;\n\nLinear ODE's, Especially Second Order with Constant Coefficients;\n\nUndetermined Coefficients and Variation of Parameters;\n\nSinusoidal and Exponential Signals: Oscillations, Damping, Resonance;\n\nComplex Numbers and Exponentials;\n\nFourier Series, Periodic Solutions;\n\nDelta Functions, Convolution, and Laplace Transform Methods;\n\nMatrix and First-order Linear Systems: Eigenvalues and Eigenvectors; and\n\nNon-linear Autonomous Systems: Critical Point Analysis and Phase Plane Diagrams.\n\nFormat\n\nThe lecture period is used to help students gain expertise in understanding, constructing, solving, and interpreting differential equations. Students must come to lecture prepared to participate actively. At the first recitation, students are given a set of flashcards to bring to each lecture. They are used during class sessions to vote on answers to questions posed occasionally in the lecture. In case of divided opinions, a discussion follows. As a further element of active participation in class, students will often be asked to spend a minute responding to a short feedback question at the end of the lecture.\n\nRecitations\n\nThese small groups meet twice a week to discuss and gain experience with the course material. Even more than the lectures, the recitations involve active participation. The recitation leader may begin by asking for questions or hand out problems to work on in small groups. Students are encouraged to ask questions early and often. Recitation leaders also hold office hours.\n\nTutoring\n\nAnother resource of great value to students is the tutoring room. This is staffed by experienced undergraduates. Extra staff is added before hour exams. This is a good place to go to work on homework.\n\nThe Ten Essential Skills\n\nStudents should strive for personal mastery over the following skills. These are the skills that are used in other courses at MIT. This list of skills is widely disseminated among the faculty teaching courses listing 18.03 as a prerequisite. At the moment, 140 courses at MIT list 18.03 as a prerequisite or a corequisite.\n\nModel a simple system to obtain a first order ODE. Visualize solutions using direction fields and isoclines, and approximate them using Euler's method.\n\nSolve a first order linear ODE by the method of integrating factors or variation of parameter.\n\nCalculate with complex numbers and exponentials.\n\nSolve a constant coefficient second order linear initial value problem with driving term exponential times polynomial. If the input signal is sinusoidal, compute amplitude gain and phase shift.\n\nCompute Fourier coefficients, and find periodic solutions of linear ODEs by means of Fourier series.\n\nUtilize Delta functions to model abrupt phenomena, compute the unit impulse response, and express the system response to a general signal by means of the convolution integral.\n\nFind the weight function or unit impulse response and solve constant coefficient linear initial value problems using the Laplace transform together with tables of standard values. Relate the pole diagram of the transfer function to damping characteristics and the frequency response curve.\n\nCalculate eigenvalues, eigenvectors, and matrix exponentials, and use them to solve first order linear systems. Relate first order systems with higher-order ODEs.\n\nRecreate the phase portrait of a two-dimensional linear autonomous system from trace and determinant.\n\nDetermine the qualitative behavior of an autonomous nonlinear two-dimensional system by means of an analysis of behavior near critical points.\n\nThe Ten Essential Skills is also available as a (\nPDF\n).\n\nHomework\n\nEach homework assignment has two parts: a first part drawn from the book or notes, and a second part consisting of problems which will be handed out. Both parts are keyed closely to the lectures. Students should form the habit of doing the relevant problems between successive lectures and not try to do the whole set the night before they are due.\n\nExams\n\nThere are 3 one-hour exams held during lecture session and a three-hour comprehensive final examination.\n\nGrading\n\nThe final grade will be based on a cumulative total of 885 points computed as follows:\n\nACTIVITIES\n\nPOINTS\n\nNine homework assignments\n\nThree hour exams\n\nOne final exam\n\nODE Manipulatives (\"Mathlets\")\n\nThis course employs a series of specially written JavaTM applets, or\nMathlets\n. They are used in lecture occasionally, and each problem set contains a problem based around one or another of them.",
  "files": [
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/ca6cfb455bee70fba44d246c0ee22936_MIT18_03S10_ps1.pdf",
      "content": "18.03 Problem Set 1\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades for\nhomework you have not thought through translate to poor grades on exams. You must\nturn in your own writeups of all problems, and, if you do collaborate, you must\nwrite on the front of your solution sheet the names of the students you worked\nwith.\nBecause the solutions will be available immediately after the problem sets are due, no ex\ntensions will be possible.\nPart I of each problem set will consist of problems which are either rather routine or for\nwhich solutions are available in the back of the book, or in 18.03 Notes and Exercises.\nPart II contains more challenging and novel problems. They will be graded with care (Com\nplain if they are not!) and contribute the bulk of the Homework grade. They will help you\ndevelop an understanding of the material.\nProblems in both parts are keyed closely to the lectures, and numbered to match them. Try\nthe problems as soon as you can after the indicated lecture. Most problem sets correspond\nto four lectures, through the Monday or Wednesday before the set is due. Each problem set\nis graded out of 100 points. Each day counts 24 points. The grader has 4 points to give or\nwithhold based on neatness and clarity of the answers. (Problem sets 6 and 7 relate to only\nthree lectures, and each day in them counts 32 points.)\nI. First-order differential equations\nR1 T 2 Feb\nNatural growth models and separable equations: EP 1.1, 1.4.\nL1\nW 3 Feb\nDirection fields, existence and uniqueness of solutions:\nEP 1.2, 1.3; Notes G.1; SN 1.\nR2 Th 4 Feb\nIsoclines, separatrix, extrema of solutions: Notes G.1, D.\nL2\nF 5 Feb\nNumerical methods: EP 6.1, 6.2; Notes G.2.\nL3\nM 8 Feb\nLinear equations: models: EP 1.5; SN 2.\nR3 T 9 Feb\nMixing problems, half-life.\nL4\nW 10 Feb Solution of linear equations, integrating factors: EP 1.5; SN 3.\nPart I.\n0. (T 2 Feb) [Natural growth, separable equations] Notes 1A-5c; EP 1.1: 32, 33, 35; EP\n1.4: 39, 66; EP 1.5: 1, 9, 20.\n1. (W 3 Feb) [Direction fields, isoclines] Notes 1C-1abe.\n2. (F 5 Feb) [Euler's method] Notes 1C-4.\n3. (M 8 Feb) [Linear models] EP 1.5: 33, 45. (In both, be sure to write out the differential\nequation.)\n\nZ\nPart II.\n0. (T 2 Feb) [Natural growth, separable equations] In recitation a population model was\nstudied in which the natural growth rate of the population of oryx was a constant k > 0, so\nthat for small time intervals Δt the population change x(t + Δt) - x(t) is well approximated\nby kx(t)Δt. (You also studied the effect of hunting them, but in this problem we will leave\nthat aside.) Measure time in years and the population in kilo-oryx (ko).\nA mysterious virus infects the oryxes of the Tana River area in Kenya, which causes the\ngrowth rate to decrease as time goes on according to the formula k(t) = k0/(a+ t)2 for t ≥ 0,\nwhere a and k0 are certain positive constants.\n(a) What are the units of the constant a in \"a + t,\" and of the constant k0?\n(b) Write down the differential equation modeling this situation.\n(c) Write down the general solution to your differential equation. Don't restrict yourself to\nthe values of t and of x that are relevant to the oryx problem; take care of all values of these\ndx\nvariables. Points to be careful about: use absolute values in\nx = ln |x| + c correctly, and\ndon't forget about any \"lost\" solutions.\n(d) Now suppose that at t = 0 there is a positive population x0 of oryx. Does the progressive\ndecline in growth rate cause the population stabilize for large time, or does it grow without\nbound? If it does stabilize, what is the limiting population as t →inf?\n1. (W 3 Feb) [Direction fields, isoclines] In this problem you will study solutions of the\ndifferential equation\ndy\ndx = y - x .\nSolutions of this equation do not admit expressions in terms of the standard functions of\ncalculus, but we can study them anyway using the direction field.\n(a) Draw a large pair of axes and mark off units from -4 to +4 on both. Sketch the direction\nfield given by our equation. Do this by first sketching the isoclines for slopes m = -1, m = 0,\nm = 1, and m = 2. On this same graph, sketch, as best you can, a couple of solutions, using\njust the information given by these four isoclines.\nHaving done this, you will continue to investigate this equation using one of the Mathlets. So\ninvoke http://math.mit.edu/mathlets/mathlets in a web browser and select Isoclines\nfrom the menu. (To run the applet from this window, click the little black box with a white\ntriangle inside.) Play around with this applet for a little while. The Mathlets have many\nfeatures in common, and once you get used to one it will be quicker to learn how to operate\nthe next one. Clicking on \"Help\" pops up a window with a brief description of the applet's\nfunctionalities.\nSelect from the pull-down menu our differential equation y0 = y2 - x. Move the m slider to\nm = -2 and release it; the m = -2 isocline is drawn. Do the same for m = 0, m = 1, and\nm = 2. Compare with your sketches. Then depress the mousekey over the graphing window\nand drag it around; you see a variety of solutions. How do they compare with what you\ndrew earlier?\n(b) A separatrix is a curve such that above it solutions behave (as x increases) in one\nway, while below it solutions behave (as x increases) in quite a different way. There is a\nseparatrix for this equation such that solutions above it grow without bound (as x increases)\n\nwhile solutions below it eventually decrease (as x increases). Use the applet to find its graph,\nand submit a sketch of your result.\n(c) Suppose y(x) is a solution to this differential equation whose graph is tangent to the\nm = -1 isocline: it touches the m = -1 isocline at a point (a, b), and the two curves have\nthe same slope at that point. Find this point on the applet, and then calculuate the values\nof a and b.\n(d) Now suppose that y(x) is a solution to the equation for which y(a) < b, where (a, b)\nis the point you found in (c). What happens to it as x →inf? More specifically, give an\nexplicit function f(x) whose graph is asymptotic to the graph of the function y(x). For large\nx, is y(x) > f(x), y(x) < f(x), or does the answer depend on the value of y(a)?\nThe following observations will be useful in justifying your claims. Please explain as clearly\nas you can why each is true.\n(i) The graph of y(x) can't cross the m = -1 isocline at a point (x, y) with x > a.\n(ii) If the graph of y(x) is below the m = 1 isocline for x = a, it will eventually (as x grows)\ncross the m = 1 isocline.\n(iii) The graph of y(x) must eventually cross the nullcline.\n(e) Suppose a solution y(x) has a critical point at (c, d)--that is, y0(c) = 0 and y(c) = d.\nWhat can you say about the relationship between c and d? The applet can be very helpful\nhere, but verify your answer.\n(f) It appears from the applet that all critical points are local maxima. Is that true?\n2. (F 5 Feb) [Euler's method] (a) Write y for the solution to y0 = 2x with y(0) = 0. What\nis y(1)? What is the Euler approximation for y(1), using 2 equal steps? 3 equal steps? What\nabout n steps, where n can now be any natural number? (It will be useful to know that\n1 + 2 +\n+ (n - 1) = n(n - 1)/2.) As n →inf, these approximations should converge to\n· · ·\ny(1). Do they?\n(b) In the text and in class it was claimed that for small h, Euler's method for stepsize h has\nan error which is at most proportional to h. The n-step approximation for y(1) has h = 1/n.\nWhat is the exact value of the difference between y(1) and the n-step Euler approximation?\nDoes this conform to the prediction?\n3. (M 8 Feb) [Linear models] Scrooge McDuck wants to set up a trust fund for his nephew\nDon. He has fool-proof investments which make a constant interest rate of I, measured in\nunits of (years)-1 (so I = 0.05 means 5% per year), and he proposes to dole out the money\nto his profligate nephew at a constant rate q dollars per year.\n(a) Model this process by a differential equation. (Use the symbols I and q, rather than\nspecific values for them.) Explain your steps.\n(b) Then find the general solution to this differential equation.\n(c) Now take I = 0.05. If Uncle Scrooge wanted to fund the trust so as to provide his\nnephew with $1000 per month in perpetuity, while maintaining a constant balance in the\nfund, how much should he invest?\n(d) But in fact Uncle Scrooge wants to teach his nephew the virtues of self-reliance, and\nso plans on having the trust fund run entirely out of money in exactly twenty years. If he\nwants to give his nephew $1000 per month, how much should he fund the trust with at the\noutset? Give the answer to the nearest penny (as Scrooge would insist on).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps1s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/ae29d457a4b5ac5bb350dd3a9925243d_MIT18_03S10_ps1s.pdf",
      "content": "18.03 Problem Set 1: Part II Solutions\nPart I points: 0. 9, 1. 6, 2. 4, 3. 4.\n0. (T 5 Feb) (a) [4] The growth rate k(t) has units years-1 (so that k(t)x(t)Δt has the\nsame units as x(t)). The variable t has units years, so the a added to it must have the\nsame units, and k0 must have units years in order for the units of the fraction to work\nout.\n(b) [3] x(t + Δt) ' x(t) + k(t)x(t)Δt, so x = k0x/(a + t)2 .\n(c) [4] Separate: dx/x = k0(a + t)-2dt.\nIntegrate: ln |x| + c1 = -k0(a + t)-1 + c2.\nAmalgamate constants and exponentiate:\nx = ece-k0/(a+t).\nEliminate the absolute\nc\n| |\nvalue: x = Ce-k0/(a+t), where C = ±e . Reintroduce the solution we lost by dividing by\nx in the first step: allow C = 0. So the general solution is x = Ce-k0/(a+t). (Note that\nthe exponent -k0/(a + t) is dimensionless, as an exponent must be.)\n(d) [4] When t gets very large, the exponent gets very near to zero, so there is a finite\nlimiting population: xinf = C. Thus x(t) = xinfe-k0/(a+t). Take t = 0 in the solution:\n-k0/a\nk0/a\nx0 = xinfe\n, or xinf = e\nx0.\n1. (W 6 Feb) (a) [3] (The picture lacks the m = 1 isocline, sorry.)\n(b)[3] The separatrix is the elbow curve that other integral curves snuggle up to to\nthe left and separate from as things move to the right.\n[Here are some facts about\nsolutions to this differential equation, some of which are contained in later parts of this\nproblem: Every solution has a \"starting time\" (if I think of x as time) before which it\ndoes not exist--every integral curve is asymptotic to a vertical straight line to its left.\nEvery solution above the separatrix has an \"ending time\" after which it does not exist--\nit is asymptotic to a different vertical straight line to its right. Every solution below\nthe separatrix survives forever, and becomes asymptotic (from above) to the graph of\ny = -√x. These are also exactly the solutions with a critical point--each has one local\nmaximum. The separatrix itself is a solution, a very special one: it is the only solution\n\nwhich lives forever but has no maximum and is not asympotic to y = -√x. Instead it is\nasymototic to y = √x.]\n(c) [3] The point of tangency occurs where the tangent line to the m = -1 isocline has\nslope -1. The m = -1 isocline is the locus of x = y2 + 1. Differentiate implicitly (using\nthe chain rule) 1 = 2yy0, so if y0 = -1 then y = -1/2. The equation then gives x = 5/4,\nso (a, b) = (5/4, -1/2).\n(d) [3] f(x) = -√x, or indeed f(x) = -√x + m for any m. The rest of the problem\ndepends on using f(x) = -√x, though, as noted on the website. For large x, y(x) >\n-√x, but if m < 0 there will be solutions of the type we are considering such that\ny(x) < -√x + m for some x > a.\n(i) Follow the solution from the x = a line. Suppose that it does cross the m = -1\nisocline, and suppose that the first crossing is at a point (x, y). Since it started below\nthe m = -1 isocline, it must be crossing it from below. This means that the slope of the\nsolution must be greater than the slope of the isocline at the crossing point. The slope\nof the isocline at the crossing point is greater than -1, so the slope of the solution at the\ncrossing point must be greater than -1 too. But when a solution crosses the -1 isocline,\nit must cross it with slope exactly -1. So it can't cross it at all.\nIt will be clearer if I don't try to follow (ii) and (iii) (as explained on the website).\n(i) shows that solutions y(x) such that y(a) < b are trapped below the -1 isocline.\nNow I want to say that if a solution is above the lower branch of the nullcline at some\npoint (x, y(x)), then it stays above the nullcline forever more. The slope of the nullcline\nis negative; the first crossing must be from above; so at the crossing the slope of the\nsolution must be even more negative; but when it crosses the nullcline it must have slope\nzero.\nFinally I claim that if (a, y(a)) is below the nullcline, then the integral curve must even\ntually cross the nullcline. Until it does, it is in the region where the direction field has\npositive slopes. So it is increasing. But the lower branch of the nullcline is is falling; so\nthe two curves must eventually intersect.\nOne can also argue that if the solution never crosses the nullcline then, after rising at\nthe start it must eventually start to fall, since the nullcline does. So it must reach a\nmaximum somewhere in between. But all maxima of solutions occur along the nullcline.\n(e) [3] Critical points of solutions of y0 = y2\nx occur when y0 = 0, that is, along the\n-\nnull-cline: so if there is one at (c, d) then c = d2 .\n(f) [3] Yes. Here are two arguments: All solutions are increasing for small values of\nx. From what we can see, the solutions with critical points are the ones which become\nasymototic to the graph of y = -√x, which decreases. Also they seem to have just one\ncritical point, which must therefore be a maximum. More complete argument: Compute\n(as in (c)) y00 = 2yy0 -1. So at a critical point, where y0 = 0, we see that y00 = -1. This\nmeans maximum.\n2. (F 8 Feb) [2] y = x2, so y(1) = 1.\nEuler's method with stepsize h for this equation: xk = kh, yk+1 = yk + 2xkh.\n\nk\n[5] With n = 2, h = 1/2:\nk\n[5] With n = 3, h = 1/3:\n[8] With n arbitrary, h = 1/n:\nSo yn = 2(1 + 2 +\n+ (n -1))h2 =\n· · ·\nxk\n1/2\nxk\n1/3\n2/3\nk\n. . .\nyk\n1/2\nyk\n2/9\n2/3\nmk = -yk\nhmk\n1/2\nmk = -yk\nhmk\n2/3\n2/9\n4/3\n4/9\nxk\nh\n2h\n3h\n4h\n. . .\nyk\n2h2\n2h2 + 4h2\n2h2 + 4h2 + 6h2\n. . .\nmk = 2xk\nmkh\n2h\n2h2\n4h\n4h2\n6h\n6h2\n8h\n8h2\n.\n.\n.\n.\n.\n.\nfor y(1): n(n -1)/n2 = (n -1)/n. The limit of this as n →infis 1, which is good, and\nthe error is 1/n, which is exactly h.\n3. (M 11 Feb) (a) [5] Pick a letter to denote the number of years after the fund is set\nup--say t. Pick a letter to denote function of t giving the value of the fund at time t--say\nx. In a small time interval from t to t + Δt, the fund increases in value by Ix(t)Δt, but\ndecreases in value by qΔt: x(t + Δt) -x(t) ' Ix(t)Δt -qΔt. Divide by Δt and take the\nlimit: x = Ix -q.\n(b) [5] Separate: dx/(Ix -q) = dt. Integrate: I-1 ln Ix -q + c1 = t + c2. Amalgamate\n|\n|\nc It\nconstants and multiply by I: ln |Ix -q| = It + c.\nExponentiate: |Ix\nCe\n-\nIt\nq| = e e .\nEliminate the absolute value and reintroduce the lost solution: Ix -q =\n. Solve for\nx: x = (q/I) + CeIt (where this C is the earlier one divided by I).\n(c) [5] Constant trust value means x = 0, which says Ix = q or x = q/I. So with\nq = 12,000 dollars/year and I = 0.05, x = $240,000. (If Scrooge socks away more than\nthis, then the trust fund could pay out the $1000/month and still grow. But this wouldn't\nbe Scrooge.)\n(d) [5] We want to find the constant of integration which makes x(T) = 0, where T = 20:\n0 = x(T) = (q/I) + CeIT, or C = -(q/I)e-IT . Thus x = (q/I)(1 -e-ITeIt). Now we\ncan set t = 0 to find the required initial value of the trust: x(0) = (q/I)(1 -e-IT). With\nT = 20 and I = 0.05, 1 -e-IT = 1 -e-1 ' 0.63212056. Thus the initial funding is about\n63% of what it was in (c): x(0) ' ($240,000)(.63212056) ' $151,708.93.\nn(n -1)h2 . With h = 1/n this gives our estimate\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/f6f9a502e444bb002f9e64e090f4b8ad_MIT18_03S10_ps2.pdf",
      "content": "18.03 Problem Set 2\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades\nfor homework you have not thought through translate to poor grades on exams. You\nmust turn in your own writeups of all problems, and, if you do collaborate,\nyou must write on the front of your solution sheet the names of the students\nyou worked with.\nBecause the solutions will be available immediately after the problem sets are due, no\nextensions will be possible.\nI. First-order differential equations\nL4\nW 13 Feb\nSolution of linear equations; integrating factors: EP 1.5, SN 3.\nR4 Th 14 Feb Ditto\nL5\nF 15 Feb\nComplex numbers, roots of unity: SN 5-6; Notes C.1-3.\nL6\nT 19 Feb\nComplex exponentials; sinusoidal functions:\nNotes C.4; SN 4; Notes IR.6.\nL7\nW 20 Feb\nLinear system response to exponential and sinusoidal input;\ngain, phase lag: SN 4, Notes IR.6.\nR5 Th 21 Feb Sinusoids; complex numbers and exponentials.\nL8\nF 22 Feb\nAutonomous equations; the phase line, stability: EP 1.7, 7.1.\nPart I.\n4. (W 13 Feb) [Solutions to linear equations] EP 1.5: 1, 2, 5. Remember to check\nwhether the equation is separable first.\n5. (F 15 Feb) [Complex numbers, roots of unity] Notes 2E-1, 2, 7.\n6. (T 19 Feb) [Complex exponentials, Sinusoids] (a) Notes 2E-9, 10.\n(b) Write each of the following functions f(t) in the form A cos(ωt - φ). In each case,\nbegin by drawing a right triangle as in the Supplementary Note SN4 (on the course\nwebsite) and as in Lecture 6.\nπ\nπ\n(i) cos(2t) + sin(2t). (ii) cos(πt) -\n√\n3 sin(πt). (iii) cos(t - ) + sin(t - ).\n7. (W 20 Feb) [First order harmonic response] (a) 2E-15.\n(b) (i) Find a solution of x + 2x = e3t of the form Be3t . Then write down the general\nsolution. (ii) Now do the same for the complex-valued differential equation x +2x = e3it .\n\nPart II.\n4. (W 13 Feb) [Solutions to linear equations] Almost all the radon in the world today\nwas created within the past week or so by a chain of radioactive decays beginning mainly\nfrom uranium, which has been part of the earth since it was formed. This cascade of\ndecaying elements is quite common, and in this problem we study a \"toy model\" in\nwhich the numbers work out decently. This is about Tatooine, a small world endowed\nwith unusual elements.\nA certain isotope of Startium, symbol St, decays with a half-life tS . Strangely enough,\nit decays with equal probability into a certain isotope of either Midium, Mi, or into the\nlittle known stable element Endium. Midium is also radioactive, and decays with half-life\ntM into Endium. All the St was in the star-stuff that condensed into Tatooine, and all\nthe Mi and En arise from the decay route described. Also, tM = tS .\nUse the notation x(t), y(t), and z(t), for the amount of St, Mi, and En on Tatooine, in\nunits so that x(0) = 1.\n(a) Make rough sketches of graphs of x, y, z, as functions of t. What are the limiting\nvalues as t →inf?\n(b) Write down the differential equations controlling x, y, and z. Be sure to express the\nconstants that occur in these equations correctly in terms of the relevant decay constants.\nUse the notation σ (Greek letter sigma) for the decay constant for St and μ (Greek letter\nmu) for the decay constant for Mi. Your first step is to relate σ to tS and μ to tM . A\ncheck on your answers: the sum x+y +z is constant, and so we should have x+ y + z = 0.\n(c) Solve these equations, successively, for x, y, and z.\n(d) At what time does the quantity of Midium peak? (This will depend upon σ and μ.)\n(e) Suppose that instead of x(0) = 1, we had x(0) = 2. What change will this make to\nx(t), y(t), and z(t)?\n(f) Unrelated question: Suppose that x(t) = et is a solution to the differential equation\ntx + 2x = q(t). What is q(t)? What is the general solution?\n5. (F 15 Feb) [Complex numbers, roots of unity] (a) Make a table with three columns.\nEach row will contain three representations of a complex number z: the \"rectangular\"\nexpression z = a + bi (with a and b real); the \"polar\" expression |z|, Arg(z); and a little\npicture of the complex plane with the complex number marked on it. There are five rows,\ncontaining, in one column or another, the following complex numbers:\n(i) 1 - i\n(ii) z such that |z| = 2 and Arg(z) = π/6\n(iii) A square root of i with negative imaginary part\n(iv) A sixth root of 1 with argument θ such that 0 < θ < π/2\n(v) ((1 + i)/\n√\n2)-13 .\n(b) Find the complex roots of the following equations: z4 + 4 = 0; z2 + 2z + 2 = 0.\n6. (T 19 Feb) [Complex exponentials, Sinusoids] (a) Add a fourth column to table you\nmade in 5 (a) by giving the exponential representation z = Aeiθ (with A and θ real).\n(b) Find all complex numbers z = a + bi such that ez = -2.\n(c) Find an expression for cos(4t) in terms of sums of powers of sin t and cos t by using\n(eit)4 = e4it and Euler's formula.\n\n(d) The Mathlet Complex Exponential will probably be useful in understanding the\nrest of this problem. Open it and explore its functionalities. The Help button lists most\nof them. Notice that in the left window, the real part a ranges between -1 and 1, while\nthe imaginary part b ranges from -8 to 8. You use the left-hand window to pick out a\ncomplex number a + bi. When you do, a portion of the line through it and zero is drawn.\nThis line is parametrized by (a + bi)t. At the same time, the curve parametrized by the\ncomplex-valued function e(a+bi)t is drawn on the right window.\nFor each of the following functions f(t), make a sketch of the graph (in a convenient\nrange), find a value of w = a + bi such that Re(ewt) = f(t), and sketch the trajectory of\nthe complex valued function ewt (i.e. its set of values).\n(i) f(t) = cos(2πt)\n(ii) f(t) = e-t\n(iii) f(t) = e-t cos(2πt).\n(iv) The constant function with value 1.\n3it\ne\n7. (W 20 Feb) [Sinusoidal input and output] (a) Express Re\nin the form\n√\n3 + i\na cos(3t) + b sin(3t). Then rewrite this in the form A cos(3t - φ). Now find this same\nanswer by a different route: By finding its modulus and argument, write 2 + 2i in the\nform Aeiφ . Substitute this into e2it/(2 + 2i), and then use properties of the exponential\n3it\ne\nfunction to find B and φ such that\n= Bei(3t-φ). Finally, take the real part of this\n√\n3 + i\nnew expression.\n(b) Find a solution of the differential equation z + 3z = e2it of the form we2it, where w\nis some complex number. What is the general solution?\n(c) Finally, find a solution of x + 3x = cos(2t) by relating this ODE to the one in (b).\nWhat is the general solution?\nAnswers\nπ\nI. 6 (b): (i)\n√\n2 cos(2t - ).\n(ii) 2 cos(πt + π\n3 ).\n3t\n(iii)\n√\n2 cos(t - ).\n3t\nI. 7 (b) (i) e\n+ ce-2t .\n3it\n(ii) e\n+ ce-2t .\n2 + 3i\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps2s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/65aed74e3d0fa6928d8f04ec4fef028c_MIT18_03S10_ps2s.pdf",
      "content": "18.03 Problem Set 2: Part II Solutions\nPart I points: 4. 4, 5. 6 , 6. 8, 7. 6.\n4. (a) [2] x falls; y rises and then falls; and z rises. With = .1, μ = .2:\n(b) [4] Startium obeys the natural decay equation, x = -x, with solution x = x(0)e-t .\nTo relate to its half-life, solve for it in x(0)/2 = x(0)e-tS to find = (ln 2)/tS .\nSimilarly, μ = (ln 2)/tM .\nMidium decays as well, but in each small time interval gets half the decayed Startium\nadded: so y(t + t) ' -μy(t)t + 2\n1 x(t)t. Thus y = -μy + 2\n1 x. Endium receives\nhalf the decayed Startium and all the decayed Midium: z = 1\n2 x + μy. Adding these\nthree equations gives x + y + z = 0.\n(c) [4] Using x(0) = 1, we know that x = e-t . Thus y + μy = 1\n2 e-t . An integrating\nfactor is given by eμt: d (eμty) = 1 e(μ-)t . Integrating, eμty = 1 e(μ-)t + c or y =\ndt\n2 μ-\n1 e-t +ce-μt. The initial condition is y(0) = 0, so c = -1 : y = 1 (e-t -e-μt).\n2 μ-\n2 μ-\n2 μ-\nWe could solve for z in the same way, but it's easier to calculate z = 1 - x - y =\n1 + /2-μ e-t + /2 e-μt\nμ-\nμ-\n(d) [4] From the differential equation for y, we know that a critical point occurs when\nμy = 1 e-t . Substitute the value for y: μ 1 (e-t - e-μt) = 1 e-t . Some algebra\n2 μ-\nt = μe-μt\n(μ-)t\nln μ-ln\nleads to e-\n, so e\n= μ/, so tmax =\n.\nμ-\n(e) [2] Everything gets doubled.\n(f) [4] If x = et then q(t) = tx + 2x = tet + 2et = (t + 2)et . The associated homogeneous\nequation is tx + 2x = 0, which is separable: dx/x = -2dt/t, so ln |x| = -2 ln |t| + c =\nln(t-2) + c and x = C/t2 . So the general solution of the original equation is et + C/t2 .\n\np\n5. (a) [10] and 6. (a) The rectangular expression gives the coordinates for the little\npictures. Any angle may be altered by adding a multiple of 2.\n1 - i\np\n3 + i\n(-1 - i)/\np\n(1 +\np\n3i)/2\n(-1 + i)/\np\np\n2, -/4\n2, /6\n1, 5/4\n1, /3\n1, 3/4\ni/4\np\n2e-\n2ei/6\n5i/4\ne\ni/3\ne\n3i/4\ne\nki/4\n(b) [8] (i) ±1 ± i; or\np\n2e\nwhere k = 1, 3, 5, 7. (ii) -1 ± i.\n6. (a) [2] above.\n(b) [3] ea+bi = eaebi so |ea+bi| = |ea||ebi| = ea . Since | - 2| = 2, a = ln 2. Arg(ea+bi) = b\nup to adding multiples of 2. Arg(-1) = , so b is any odd multiple of . Answer:\nln 2 + bi, b = ±1, ±3, . . ..\n(c) [3] cos(4t) = Ree4it = Re((eit)4) = Re((cos t + i sin t)4). By the binomial theorem,\n(a+bi)4 = a4 +4a3bi-6a2b2 -4ab3i+b4, so we find cos(4t) = cos4 t-6 cos2 t sin2 t+sin4 t.\n(d) [8] (i) w = 2i. The trajectory is the unit circle.\n(ii) w = -1. The trajectory is the positive real axis.\n(iii) w = -1 + 2i. The trajectory is a spiral, spiralling in towards the origin in a\ncounterclockwise direction and passing though 1.\n(iv) w = 0. The trajectory is the single point 1.\n3it\n7. (a) [8] pe\n3 + i = (\np\n- i)(cos(3t) + i sin(3t)) has real part\np\n3 cos(3t) + 1\n4 sin(3t).\nForm the right triangle with sides a = 4\n3 and b = 4\n1 . The hypotenuse is A = 1/2 and\nthe angle is = /6.\np\n3+i = 2ei/6 (by essentially the same triangle), so\ne3it\n= 1\n6 ,\np\n3 + i\n2 e i(3t-/6): B = 1 , =\nand Re(Bei(3t-)) = B cos(3t - ), so you get the same answer.\n(b) [5] Substituting z = we2it , e2it = w2ie2it +3we2it, so 1 = w(2i+3) or w =\n1 = 3-2i .\n2i+3\n3-2i 2it\n3t\nThus a solution of the desired form is zp = 13 e\n. The general solution is zp + ce-.\n3-2i 2it\n(c) [5] If x = Rez, the real part of z + 3z = e2it is x + 3x = cos(2t). Now zp = 13 e\n=\n3-2i (cos(2t) + i sin(2t)) has real part xp = 1 (3 cos(2t) + 2 sin(2t)). The general solution\nis then x = xp + ce-3t .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps3a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/7adb0902ea7d2511690530514ef57ad5_MIT18_03S10_ps3a.pdf",
      "content": "18.03 Problem Set 3: First Half\nThis is the first two problems of PS3. The rest will be available on February 26.\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades for\nhomework you have not thought through will translate to poor grades on exams. You\nmust turn in your own writeups of all problems, and, if you do collaborate,\nyou must write on the front of your solution sheet the names of the students\nyou worked with.\nBecause the solutions will be available immediately after the problem sets are due, no\nextensions will be possible.\nI. First-order differential equations\nL8\nF 19 Feb\nAutonomous equations; the phase line, stability: EP 1.7, 7.1.\nL9\nM 22 Feb\nWrap-up: Linear vs Nonlinear.\nR6\nT 23 Feb\nExam preparation.\nL10 W 24 Feb\nHour Exam I\nII. Second-order linear equations\nR7\nTh 25 Feb Harmonic oscillator, superposition\nL11 F 26 Feb\nThe spring-mass-dashpot model; characteristic polynomial;\nSolution in real root case: EP 2.1, 2.2.\nPart I.\n8. (F 19 Feb) Notes: 1E-1.\n9. (M 22 Feb) Consider the differential equation x + 2x = 1.\n(a) Find the general solution (i) by separation; (ii) by use of an integrating factor; (iii)\nby regarding the right hand side as e0t and using the method of optimism (i.e. look for\na solution of the form Ae0t) to find a particular solution, and then adding in a transient.\n(b) This equation is also autonomous. Sketch its phase line and some solutions (including\nthe equilibrium solution). Is the equilibrium stable, unstable, or neither?\n(c) Use Euler's method with three steps to estimate the value of the solution with initial\ncondition x(0) = 0 at t = 1.\nPart II.\n8. (F 19 Feb) [Autonomous Equations] This problem will use the Mathlet Phase\nLines. Open the applet and understand its use and conventions. Click on [Phase Line]\nto see a representation of the phase line. Note the color coding: a green dot represents a\n\nstable or attracting equilibrium; red represents an unstable or repelling equilibrium; and\nblue represents a \"semi-stable\" equilibrium.\nThe Kenyan government has a game preserve that, in the absence of hunting, supports\nan oryx population that follows the logistic equation with a stable population of one\nkilo-oryx (one thousand animals). Kenya wishes to investigate the effect on the oryx\npopulation of various rates hunting, a.\n(a) This situation is well modeled by the top menu item in Phase Lines. Explain why\nthis is a good model. The rest of this problem will use this equation.\n(b) It appears that there is a pair of equilibria for some values of a, only one for at least\none other value of a, and none for still other values of a. Calculate which values of a\nbehave in which way; for each a find the critical values of y, and in each case say whether\nthe critical points involved are stable, unstable, or semi-stable.\n(c) The Kenyan government hopes to allow 187.5 oryx to be killed in an average year.\nDetermine for them what the resulting stable population will be. If this strategy is\nadopted, what is the critical oryx population below which the population will crash (if\nthe same harvest rate continues to be allowed)?\n(d) For this value of a, there are five different behaviors possible for the oryx population.\n(Two solutions exhibit the \"same behavior\" if one is a time-translate of the other). Sketch\none solution of each of the five types. Your sketch should make it clear what the behavior\nof the solution is as t gets small and as t gets large. Match each one up with a portion\nof the phase line.\n(e) Invoke the Bifurcation Diagram for this autonomous equation. Move a along its\nslider to see the variety of behaviors of the phase line of as a varies. The green and red\ncurve in the newly displayed bifurcation plane represents the equilibrium points for those\nequations, for various values of a. Give an equation for that curve.\n9. (M 22 Feb) [Linear vs Nonlinear] Still working with the equation y = (1-y)y -a\nwith a = 3 , let y0 be the stable critical point. Write u = y - y0 for the population excess\nover equilibrium (so u < 0 if the population is less than the equilibrium value).\n(a) Rewrite the differential equation as a differential equation for u. Check that the new\nequation is again autonomous and that u = 0 is a critical point for it.\n(b) For small u we can neglect higher powers of u (such as u2). This process is \"lin\nearization near equilibrium.\" What is the linearized equation near u = 0? What is the\ngeneral solution of this linear autonomous equation?\n(c) At least in this case, when solutions of the original autonomous equation get near\nequilibrium, they are well modeled by solutions of the linearization. Give an approxima\ntion of y near equilibrium. Use it to answer this question: if y(10) - y0 = b, estimate\ny(11) and y(12).\n(d) Suppose that the linear equation x + p(t)x = q(t) is autonomous. What can you say\nabout p(t) and q(t)?\nPart I solutions. 9(a)(iii) e0t = 1 so we are seeking a constant solution x = A:\nx + 2x = 2A so A = 1 .\n9(c) 13 .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps3s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/c90f9302014d8285df35efecb9884b4f_MIT18_03S10_ps3s.pdf",
      "content": "q\n18.03 Problem Set 3: Part II Solutions\nPart I points: 8. 8, 9. 12, 11. 9, 12. 7.\n8. (a) [3] The general logistic equation with small-population growth rate k0 and equi\nlibrium population p is y = k0(1 - (y/p))y, The top menu choice is y = (1 - y)y - a,\nwhich is the case k0 = 1 and p = 1 together with a hunt rate of a. The only added\nassumption is k0 = 1.\n(b) [3] 0 = (1 - y)y - a is the same as y2 - y + a = 0, which by the quadratic formula\nhas solutions y = 2\n1 ±\n1 - a. Thus when a > 4\n1 there are no equilibria; when a = 4\nthere is one, namely y0 = 1\n2 , and it is semi-stable; and when a < 1\n4 there are two, the top\none stable and the bottom one unstable.\n1 ± 1\n(c) [3] 187.5 oryx is 16 kilo-oryx, and a = 16 leads to critical points 2\n4 or 4 and 4 .\nSo the stable equilibrium population is 750 animals, and the critical population below\nwhich it will crash is 250.\n(d) [5]\n(e) [2] y2 - y - a = 0.\n9. (a) [3] y0 = 3/4, from (b) above: y = u+ 3 , so 1-y = 1 -u and u = ( 1 -u)(u-3 )- 3 =\n-1 u - u2 . No explicit time dependence, so autonomous; and if u = 0 then u = 0.\n(b) [3] The linearized equation is u = -1\n2 u. The general solution to this is u = ce-t/2 .\n(c) [3] Thus y is well approximated by 4\n3 + ce-t/2: the population decays, or relaxes,\nexponentially (with decay rate 2\n1 ) to the equilibrium value.\n(d) [3] Both p(t) and q(t) must be constants.\n\np\np\np\np\n\np\np\n11. (a) [4] p(s) = 1\n2 s2 + 3\n2 s + 5\n8 = 1\n2 (s2 + 3s + 5\n4 ). One way to find the roots is by\ncompleting the square: s2 + 3s + 5\n4 = (s + 3\n2 )2 - 1, which clearly has roots -3\n2 ± 1, or -1\nand -5\n2 . This is what is shown on the applet.\n(b) [4] x = c1e-t/2 + c2e-5t/2 . So x = -1\n2 c1e-t/2 - 5\n2 c2e-5t/2, and x0 = c1 + c2, x 0 =\n-1\n2 c1 - 5\n2 c2. Thus x0 +2 x0 = -4c2 so c2 = -1\n4 (x0 +2 x0). Then c1 = x0 -c2 = 1\n4 (5x0 +2 x0).\n(c) [3] x is purely exponential when either c1 = 0--so 5x0 +2 x0 = 0--or when c2 = 0--so\nx0 + 2 x0 = 0.\n(d)[4] Try to solve for t in 0 = x(t) = c1e-t/2 + c2e-5t/2 . This leads to c2/c1 = -e2t . This\nadmits a solution for some t exactly when c1 and c2 are of opposite sign. To get positive\nt, you need c2/c1 < -1: so either -c2 > c1 > 0 or -c2 < c1 < 0. In terms of x0, x 0, this\nsays either x0 + 2 x0 > 5x0 + 2 x0 > 0, or x0 + 2 x0 < 5x0 + 2 x0 < 0, i.e. either x0 < 0 and\nx 0 > 5\n2 (-x0), or x0 > 0 and x0 < -2\n5 x0. This is borne out by the applet.\n12. (a) [6] p(s) = 1\n2 (s2 + 2bs + 5\n4 ) = 1\n2 ((s + b)2 + ( 5\n4 - b2)) has a double root when\n5 = b2 or b =\n5 . (We don't allow b < 0.) Then the root is -b, so the general solution\nis (a + ct)e-bt .\n(b) [6] When b = 1 , p(s) = 1 (s2 + 1 s + 5 ) = 1 ((s + 1 )2 + 19 ) has roots -1 ±\n19 i '\n\n-0.25 ± (1.0897)i. The general solution is thus e-t/4 a cos\n19 t + b sin\n19 t\n=\nAe-t/4 cos\n19 t - . (Either form suffices.)\n(c) [5] My measurements are: 0.00, 2.93, 5.76, 8.69, 11.52. The successive differences are\n2.93, 2.83, 2.93, 2.83--pretty close to constant. This is half the period of the sinusoid\ninvolved in the solution, which has circular frequency ! =\n19 and hence half-period\n\n= p\n' 2.8829231. Not bad agreement! The oscillations are constant over time\n!\n(though the amplitude decreases). Successive differences of zeros of other solutions should\nbe the same.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/268ebe344c04b75858e269130be407de_MIT18_03S10_ps4.pdf",
      "content": "18.03 Problem Set 4\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades for\nhomework you have not thought through will translate to poor grades on exams. You\nmust turn in your own writeups of all problems, and, if you do collaborate,\nyou must write on the front of your solution sheet the names of the students\nyou worked with.\nBecause the solutions will be available immediately after the problem sets are due, no\nextensions will be possible.\nII. Second-order linear equations\nL13\nW 3 Mar\nForced systems: superposition, Exponential Response Formula,\ndriving through the spring: Notes O.4; EP 2.6, pp. 162-164\n(157-159 in 5th ed) only--see SN 7 for beats.\nR09 Th 4 Mar\nSinusoidal solutions: amplitude and phase.\nL14\nF 5 Mar\nPolar approach to phase lag, complex gain, driving through\nthe dashpot: SN 14.2, EP 2.6, pp. 167-169 (165-167 in 5th ed).\nL15\nM 8 Mar\nOperators, undetermined coefficients, resonance:\nSN 10, SN 11, EP 2.5 pp. 148-157 (144-153 in 5th ed).\nR10 T 9 Mar\nDitto.\nL16\nW 10 Mar\nFrequency response, RLC circuits: SN 14, SN 8, EP 2.7.\nR11 Th 11 Mar Ditto.\nL17\nF 12 Mar\nLTI systems, superposition, review.\nL18\nM 15 Mar\nEngineering examples: an interview with Prof. Kim Vandiver\nR12 T 16 Mar\nExam review.\nL19\nW 17 Mar\nHour Exam II.\nPart I.\n13. (W 3 Mar) Notes 2-F6bcd.\nd3x\n14. (F 5 Mar) Find the general solution of\n- x = e 2t .\ndt3\n15. (M 8 Mar) Notes 2-C8cd; EP 2.5: 2, 8, 11, 14.\n16. (W 10 Mar) EP 2.6: 17.\n\nPart II.\n13. (W 3 Mar) [Superposition; exponential response formula] Find the general real\nsolution of:\n(a) x + 2x = e3t cos(4t). (You could do this using an integrating factor, but it's easier to\nwrite the equation as the real part of a complex-valued equation with exponential right\nhand side, and use the ERF.)\n(b) x + x + 2x = cos t. (Express the sinusoidal solution of this equation in two ways: as\na cos t + b sin t, and as A cos(t - φ).)\nNow open the Mathlet Forced Damped Vibrations. As in Damped Vibrations, the\ninitial conditions are set by the box at left. There is now a forcing term, A cos(ωt), and\nthe values of A and ω are adjustable by sliders, as are the values of the mass, damping\nconstant, and spring constant. The force in this system is applied directly to the mass\n(rather than being mediated by the spring or the dashpot).\nSet m = 1.00, b = 1.00, and k = 2.00.\n(c) Start by setting A = 0.00, so you are looking at the homogeneous case. Set the\ninitial condition to x(0) = 0 and x(0) = 1, select the Solution curve only, and measure\nthe pseudoperiod. (Notice that a slider above the graphing window lets you adjust the\nvertical scale.) How well does your measurement agree with what you found in (b)?\n(d) Now set A = 1.00 and ω = 1.00. Select the green Steady State curve. Measure its\namplitude and the value at t = 0. You computed this solution in (b). Compare the\ncomputed amplitude and value at t = 0 with what you measured. Also compute xp(0).\n(e) Finally, select initial condition x(0) = 0, x(0) = 0: so-called rest initial conditions.\n(Clicking on a hashmark gives the exact value.) If you select Steady State, Transient,\nand Solution, you can see all three: x = xp + xh. Please compute xh.\n14. (F 5 Mar) [Models and complex gain] This problem employs the Mathlet Amplitude\nand Phase: Second Order I, which illustrates the steady state sinusoidal system re\nsponse of a spring/mass/dashpot system driven through the spring, as discussed in Lec\nture 13. The amplitude of the input signal is 1, so the amplitude of the system response\nis the gain. Select b = 0.5, k = 4.00, and ω = 2.00. Animate the system.\n(a) Verify the displayed values of time lag and gain.\n(b) The input signal in this system is the position y(t) = cos(ωt) of the top of the spring\n(the cyan box). The system response is the position of the mass (the yellow box), and we\nare looking just at the steady state solution x(t). Determine the complex gain for this\nsystem. From it determine the gain of the system, as a function of ω. Finally determine\ntan φ where φ is the phase lag.\n15. (M 8 Mar) [Operators, resonance, undetermined coefficients] Find the general real\nsolution of:\n(a) x + x = e-t . (Use the Resonant ERF.)\nd3x\ndx\n(b) dt3 - dt = t2 + 1.\n(c) 2 x + x = (t2 + 1)e2t .\n\n16. (W 10 Mar) [Frequency response] This problem will use the applet Amplitude\nand Phase: Second Order I again. Set k = 4.00, b = 0.50, as in II.14. These settings\nwill be in force for parts (a) through (c).\n(a) In II.14 you studied the response of this system when ω = 2.00. The gain is pretty\nlarge with that setting. Let's investigate the gain for other values of ω. You can see\na graph of the gain as a function of the input circular frequency ω by invoking [Bode\nPlots]. The top window shows the gain as a function of ω, and the bottom window\ngraphs -φ as a function of ω. Move the ω slider and verify that these readings correspond\nto the graph of the system response at left. You can see a readout of the value of the\ngain and the phase lag for the selected value of ω by rolling the cursor over the relevant\nwindow.\nFrom your experimentation with the applet, do you believe that the gain maximal for\nω = 2.00, or is the \"practical resonance\" peak at a different value of ω?\nIn II.14(b) you wrote down a formula for the gain as a function of ω (for these values of\nk and b), g(ω). Now find the value ω = ωr which maximizes g(ω). (Hint: it'll be easier\nto minimize the square of the denominator.) Is it at ω = 2? Finally, what is the maximal\ngain?\n(b) Experiment to find the value of ω giving phase lag as close to 45* as you can. In\nII.14(b) you also gave a formula for tan φ. Determine the positive value of ω for which\nthe phase lag equals 45*. Compare.\n(c) Now invoke the [Nyquist Plot]. This shows the trajectory of the complex gain\nH(ω) as ω runs from 0 to inf. The value of H(ω) corresponding to the selected value of\nω is shown as a yellow diamond. This means that the length of the yellow strut equals\nthe gain, and the size of the green arc equals the phase lag. Again grab the ω slider and\nmove it slowly from 0 to 4. Please submit a sketch of the Nyquist plot with ω such that\nφ(ω) is as close to π\n4 as you can get it.\n(d) Finally, set ω = 2 and leave k = 4.00, but adjust the value of b by grabbing the b\nslider. What do you observe about the position of the yellow strut in the Nyquist plot?\nTry setting k to a different value, and adjust ω so that the phase lag is close to π\n2 . Now\nvary b and comment on what happens to the phase lag. Please explain this observation\nas follows. Write down a formula for the complex gain H(ω) for general values of b, k,\nand ω. What does φ = π\n2 say about the complex gain? Finally, what relationship does\nthis imply about b, k, and ω? Does this relationship explain your observation?\n\nPart I answers. 14. 7\n1 e2t + c1et + e-t/2 c2 cos\n√\n3 t + c3 sin\n√\n3 t\nor\n√\n7 e2t + c1et + Ae-t/2 cos\n2 t - φ .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps4s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/1f814b2ae2b3fe9ab45e5b0954ca98fe_MIT18_03S10_ps4s.pdf",
      "content": "18.03 Problem Set 4: Part II Solutions\nPart I points: 13. 3, 14. 8, 15. 5, 16. 4.\n(3+4i)t\n5+4i\n13. (a) [4] z + 2z = e\nhas solution zp = e(3+4i)t/((3 + 4i) + 2) = 25+16 e3t(cos(4t) +\ni sin(4t)) so xp = Re(zp) = e3t( 5 cos(4t) + 4 sin(4t)). The homogeneous equation has\ngeneral solution xh = ce-2t, so x = e3t( 3 cos(4t) + 4 sin(4t)) + ce-2t .\n(b) [4] z + z + 2z = eit has solution zp = eit/p(i); p(i) = -1 + i + 2 = 1 + i so\nit\n1-i\nzp = 1+i e\n=\n2 (cos t + i sin t) and xp = 2 cos t + 2 sin t. We can also write p(i) =\n1 + i =\n√\n2eiπ/4, so zp = 1 e-iπ/4eit =\n√\n2 ei(t-π/4) and xp = Re(zp) =\n√\n2 cos(t - π ). The\n√\ncharacteristic polynomial is p(s) = s2 + s + 2 = (s + 1 )2 + 7 with roots -1\n√\n7 , so\ne\n-t/2 4\n√\n2 ± √2\nthe homogeneous equation has general solution xh =\na cos\n2 t + b sin\n2 t\nor xh = Ae-t/2 cos\n√\n7 t - φ . The general solution is x = xp + xh.\n(c) [4] I measure the first six zeros to be 2.36, 4.76, 7.12, 9.48, 11.89, 14.19. The successive\ndifferences are 2.40, 2.36, 2.36, 2.41, 2.30, with an average of 2.366. My measured pseu\n√\ndoperiod is twice this, 4.73. The damped circular frequency of this system is ωd = 2 so\nthe pseudoperiod is 2π = 4π ' 4.7496. Not bad agreement.\nωd\n√\n(d) [4] I measure the amplitude as 0.71. It looks like xp(0) ' 0.50. Computed amplitude\n√\n√\nπ\nis\n' 0.707. Computed value is xp(0) =\ncos(-) = . Good agreement! x p(t) =\n-\n√2\n2 sin(t - π ) so x p(0) = -\n√\n2 sin(-π ) = 1 .\n(e) [5] We need to select xh so that xh(0) = -xp(0) = -1 and xh(0) = -x p(0) = -1 . It's\nmore convenient to use the rectangular expression for xh for this. xh(0) = a so a = -1 .\n\nx h = e-t/2\n1 a +\n√\n7 b cos\n√\n7 t + (\n) sin\n√\n7 t\nso x h(0) = -1 a +\n√\n7 b. Thus b =\n\n-\n\n· · ·\n\n√2\n7 x h(0) + 1\n2 a = √2\n7 -1\n2 - 1\n4 = -2\n√3\n7 . xh = e-t/2 -1\n2 cos\n√\n7 t - 2\n√3\n7 sin\n√\n7 t\n.\n14. (a) [8] Since the input signal has amplitude 1, the gain is the amplitude of the\nsystem response. The equation is x + 1\n2 x + 4x = 4 cos(2t). The complex replacement is\nz + 1\n2 z + 4z = 4e2it . Since p(2i) = (2i)2 + 1\n2 (2i) + 4 = i, zp = 4e2it/i, so xp = Re(zp) =\n4 sin(2t): the gain is 4. Also the phase lag of the sine behind the cosine is φ = π\n2 . The\ntime lag is t0 = φ = π ' 0.7854.\nω\n(b) [8] H(ω) =\n=\n. The gain is H(ω) = q\n.\np(iω)\n4 - ω2 + 2 iω\n|\n|\n(4 - ω2)2 + 1 ω2\nIm(p(iω))\nω/2\nThe phase lag φ is -Arg(H(ω)) = Arg(p(iω)) so tan φ = Re(p(iω)) = 4 - ω2 .\n15. (a) [6] p(s) = s + 1 and p(-1) = 0, so we are in resonance. p0(s) = 1 so the\nERF/Resonant gives xp = te-t .\n(b) [6] We can't apply undetermined coefficients directly since p(0) = 0. Let u = x , so\nu - u = t2 + 1. Try u = at2 + bt + c, so u = 2a and t2 + 1 = u - u = -at2 - bt + (2a - c)\nimplies a = -1, b = 0, 2a - c = 1 or c = -3: so up = -t2 - 3. Then xp is the integral of\nup: xp = -3\n1 t3 - 3t. To solve the homogeneous equation, factor p(s) = s(s - 1)(s + 1) so\nxh = c1 + c2et + c3e-t . x = xp + xh.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps5a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/f05baf64aec53622f95372fd8c607af6_MIT18_03S10_ps5a.pdf",
      "content": "18.03 Problem Set 5, First Half\nThe second half will be available by Monday, March 29.\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades for\nhomework you have not thought through will translate to poor grades on exams. You\nmust turn in your own writeups of all problems, and, if you do collaborate,\nyou must write on the front of your solution sheet the names of the students\nyou worked with.\nBecause the solutions will be available immediately after the problem sets are due, no\nextensions will be possible.\nII. Second-order linear equations\nL17\nF 12 Mar\nLTI systems, superposition, review.\nL18\nM 15 Mar\nEngineering examples: an interview with Prof. Kim Vandiver:\nDamping ratio, review.\nR12 T 16 Mar\nExam review.\nL19\nW 17 Mar\nHour Exam II.\nR13 Th 18 Mar Getting ready for Fourier series\nL20\nF 19 Mar\nFourier Series: EP 8.1\nL21\nM 29 Mar\nOperations on Fourier Series: EP 8.2, 8.3.\nR14 T 30 Mar\nDitto.\nL22\nW 31 Mar\nPeriodic solutions, resonance: EP 8.3, 8.4.\nR15 Th 1 Apr\nDitto.\nL23\nF 2 Apr\nStep function and delta function: SN 17.\nPart I.\n17. (F 12 Mar) EP 2.5: 8. Also: Find a solution to x + x = t2 + cos(2t - 1).\n18. (M 15 Mar) Nothing new.\n19. (W 17 Mar) Hour exam.\nPart II.\n17. (F 12 Mar) [Series RLC circuits; amplitude and phase] Open the Mathlet Series\nRLC Circuit. This applet is used also in 8.02, where the voltage drops are important.\nWe will focus entirely on the current response, so it will be clearer if the check boxes\nlabelled VR, VL, VC , are left unchecked. But click twice on the I box, to make a green\ncurve appear in the graphing window, representing the current through any point in the\ncircuit as a function of time.\n\np\nThe Mathlet uses the International System of Units, SI, formerly known as the mks\n(meter-kilogram-second) system. The equation\nLI + RI + (1/C)I = V\nis correct when:\nthe resistance R is measured in ohms, Ω,\nthe inductance L is measured in H, henries,\nthe capacitance C is measured in farads, F,\nthe voltgage V is measured in volts, also denoted V,\nthe current I is measured in amperes, A.\nThe slider displays millihenries, mH (1 mH= 10-3 H) and microfarads, μF (1μF= 10-6\nF), and milliseconds, ms (1 ms = 10-3 sec).\nThe Mathlet studies a sinusoidal input signal V (t) = V0 sin(ωt). Play around with the\nvarious sliders and watch the effect on the (blue) voltage curve and the (green) current\ncurve.\n(a) By experimenting, identify a few values of the system parameters R, L, C, V0, ω, for\nwhich the current and the voltage are perfectly in phase. For example, if L = 500 mH\nand ω = 200 radians/second, what values of R, C, and V0 put I in phase with V ?\n(b) Now calculate the relationship between the system parameters which leads to I and\nV being in phase. Do your experiments align with your calculations?\n(c) Set R = 100 Ω, L = 1000 mH, C = 100 μF, V0 = 500 V. Vary ω and watch the\naction. For what value of ω is the amplitude of I(t) maximal? What is that amplitude\n(in amps)? What is the phase lag between the input signal, V0 sin(ωt), and the system\nresponse, I(t), for that value of ω?\n(d) Verify the three observations made in (c) computationally. You should be able to\ndo this for general values of R, L, C, V0.\n18. (M 15 Mar) Short problem on damping ratio: We called ωn =\nk/m the natural\nfrequency of the system modeled by the homogeneous equation mx +bx +kx = 0. Critical\ndamping occurs at b/m = 2ωn. Write b/m as a multiple of critical damping: b/m = 2ωnζ.\nThe system is overdamped if the \"damping ratio\" ζ > 1, underdamped if ζ < 1.\nSuppose the system is underdamped, and that a solution is observed to decrease in\namplitude by a factor of two (that is, the exponential factor in the solution decreases\nto half its value at t = 0) after n cycles. Calculate ζ in terms of n and the constant\nα = ln 2/2π ' 0.1103178. If n = 10, what is ζ? Compare this exact value to the\nengineer's approximation α/n.\n19. (W 10 Mar) Hour exam.\nPart I answers. 17. x = (t2 - 1 ) - 3\n1 cos(2t - 1).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ps5b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/36cb2f010ad6b3a708b5d7b0fbd91d41_MIT18_03S10_ps5b.pdf",
      "content": "18.03 Problem Set 5, Second Half\nThe first half of this problem set was handed out on March 12 and is available on the\nweb.\n\nI encourage collaboration on homework in this course. However, if you do your homework\nin a group, be sure it works to your advantage rather than against you. Good grades for\nhomework you have not thought through will translate to poor grades on exams. You\nmust turn in your own writeups of all problems, and, if you do collaborate,\nyou must write on the front of your solution sheet the names of the students\nyou worked with.\nBecause the solutions will be available immediately after the problem sets are due, no\nextensions will be possible.\nL17\nF 12 Mar\nLTI systems, superposition, review\nL18\nM 15 Mar\nEngineering examples: an interview with Prof. Kim Vandiver:\nDamping ratio, review\nR12 T 16 Mar\nExam review\nL19\nW 17 Mar\nHour Exam II\nIII. Fourier series, Dirac delta function, and Laplace transform\nR13 Th 18 Mar Getting ready for Fourier series\nL20\nF 19 Mar\nFourier Series: EP 8.1\nL21\nM 29 Mar\nOperations on Fourier Series: EP 8.2, 8.3\nR14 T 30 Mar\nDitto\nL22\nW 31 Mar\nPeriodic solutions, resonance: EP 8.3, 8.4\nR15 Th 1 Apr\nDitto\nL23\nF 2 Apr\nStep function and delta function: SN 17\nPart I. 20. (F 19 Mar) Notes 7A-1, 7A-2a.\n21. (M 29 Mar) (a) Notes 7A-2a again, by writing the function in terms of sq(t).\n(b) Notes 7A-2b, by integrating the Fourier series of the derivative.\nPart I.17 answer. (correction) x = (t2 - 2) - 1 cos(2t - 1).\nPart II. 20. (F 19 Mar) [Fourier Series] This problem will use the Mathlet Fourier\nCoefficients at http://math.mit.edu/mathlets. When the applet opens you are\npresented with a series of sliders labeled bn. By pressing the [Formula] radio button\nyou can see that they are coefficients of sines in a Fourier series made up entirely of sine\nfunctions. If you press the [Cosine] radio button you'll see an's, coefficients of cosines.\nMove one of the slider handles: a cosine or sine curve appears and changes amplitude.\nRelease it at some value and move another one. The white curves shows the new sinusoid,\n\nand the yellow curve shows the sum of the two. By moving more sliders you can build\nup more complicated sums and more complicated functions.\nNow select the Target [B]. Is it an even function or an odd function? Based on this,\ndecide whether to appoximate it using sines or cosines. Select one or the other appro\npriately (using [All terms]) and do the best you can by eyeballing the result to get\nthe best approximation you can to the green target curve. Does it appear that only\neven terms are needed? Only odd term? or both? The [Odd terms] and [Even terms]\nbuttons allow you to choose just the even terms or the odd terms, and gives you more of\nthe one you select. If it seems that just the even or odd terms will be useful, explain (in\nwords) why. (Supplementary Notes §16.1 may be helpful to you here.)\n(a) Write down these values of the coefficients.\n(b) The target function [B] is the periodic function with period 2π which is given by\nπ\nfor -\nFourier coefficients for this function, using the integral formulas for them, and compare\nπ\nπ\nπ\nπ\nπ\nπ\nf(t)\n, f(t)\nfor\n, and f(± ) = 0. Compute the\n< t <\n< t <\n-\n=\n=\nwith your answers from (a). Reset the sliders to the computed values and see if it looks\nlike a better fit.\n(c) Now set the sliders to some random set of values. Still with target function [B]\ndisplayed, select the [Distance] button. A number appears at the upper right corner\nof the screen. This is the \"root mean square\" distance from the target function to the\nselected finite Fourier sum. You can read about this distance in Supplementary Notes\n16.4, but perhaps it is enough to know that it is a measure of goodness of fit. Instead of\neyeballing the fit as before, start from the bottom and successively adjust the sliders to\nminimize the distance. Write down the optimal values of the coefficients. Compare with\nthe computed values.\nLessons: (1) The Fourier coefficients are the coefficients resulting in the best possible\nfit, and (2) the process of optimizing one coefficient is independent of the process of\noptimizing any of the others. (This is \"orthogonality.\")\nπ\n21. (M 29 Mar) [Fourier Series] (a) Find the Fourier series for 2 sin(t -\nfunction of period 2π has just one expression as a linear combination of cos(mt)'s and\n) (Hint: A\nsin(nt)'s.)\nThe square wave sq(t) is the odd function of period 2π such that sq(t) = 1 for 0 < t < π\nand sq(π) = 0. In class we calculated its Fourier series.\n(b) sq(t) has minimal period 2π, but it is also a function of period 4π. Use the integral\nexpressions (EP 8.2 (6)-(8)) for the Fourier coefficients to calculate its Fourier series,\nregarded as a function of period 4π. Comment on the relationship between your answer\nand the Fourier series for sq(t).\nUse the Fourier series for sq(t), along with calculus and algebraic manipulations, to\ncompute the Fourier series of each of the following functions without evaluating any of\nthe integrals for the Fourier coefficients. In each case, sketch a graph of the function, as\nwell, and give the minimal period.\nπ\n(c) sq(t -\n(f) The periodic function g(t) with period 2π such that g(t)\n).\n(d) 1 + 2 sq(2πt).\n(e) The f(t) of [B] in the Mathlet.\nπ\n2 ≤ t ≤ π\nt for -\n(Hint: what is g0(t) in terms of f(t)?)\nand\n=\ng(t) = π - t for π\n2 ≤ t ≤ π\n3 .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/fab886971f8a958c04aaac2954bff947_MIT18_03S10_ex1.pdf",
      "content": "18.03 Hour Exam I\nFebruary 24, 2010\nYour Name\nYour Recitation Leader's Name\nYour Recitation Time\nProblem\nPoints\nTotal\nDo not open this booklet till told to do so. There are five problems. Use your test-\ntaking skills--be sure you get to all the problems. Do all your work on these pages.\nNo calculators or notes may be used. The point value (out of 100) of each problem\nis marked in the margin. Solutions will be available on the web after 4:00 today, and\nat recitation.\n\n[8]\n1. (a) In a perfect environment, the population of Norway rat that breeds on the MIT\ncampus increases by a factor of e ' 2.718281828459045 . . . each year. Model this natural\ngrowth by a differential equation.\nWhat is the growth rate k?\n[4]\n(b) MIT is a limited environment, with a maximal sustainable Norway rat population\nof R = 1000 rats. Write down the logistic equation modeling this. (You may use \"k\" for\nthe natural growth rate here if you failed to find it in (a).)\n[8]\n(c) The MIT pest control service intends to control these rats by killing them at a\nconstant rate of a rats per year. If it wants to limit the rat population to 75% of the\nmaximal sustainable population, what rate a it should aim for (in rats per year)?\n\n2. For the autonomous equation x = x(x - 1)(x + 2), please sketch:\n[4]\n(a) the phase line, identifying the critical points and whether they are stable, unstable,\nor neither.\n[4]\n(b) at least one solution of each basic type (so that every solution is a time-translate of\none you have drawn)\nBelow is a diagram of a direction field of the differential equation y0 = (1/4)(x - y2). On\nit please plot and label:\n[3]\n(c) the nullcline\n[3]\n(d) at least two quite different solutions\n[3]\n(e) the separatrix (if there is one)\n[3]\n(f) True or false: If y(x) is a solution with a minimum, then for all large enough x,\ny(x) < √x. (No explanation needed: just circle one.)\n\n[10]\n3. (a) Use Euler's method with stepsize h = 1/2 to estimate the value at x = 3/2 of the\nsolution to y0 = x + y such y(0) = 1.\n[10]\n(b) Find the solution of tx + x = cos t such that x(π) = 1.\n\n[3]\n4. (a) Find real a, b such that\n= a + bi.\n3 + 2i\n[3]\n(b) Find real r, θ such that 1 - i = reiθ .\n[3]\n(c) Find real a, b such that (1 - i)8 = a + bi.\n[3]\n(d) Find real a, b such that b > 0 and a + bi is a cube root of -1.\n[3]\n(e) Find real a, b such that eln 2+iπ = a + bi.\n[5]\n(f) Write f(t) = 2 cos(4t) - 2 sin(4t) in the form A cos(ωt - φ).\n\n[5]\n5. (a) Find a particular solution to the equation x + 3x = e2t .\n[5]\n(b) Find the solution to the same equation such that x(0) = 1.\n[5]\n(c) Write down a linear equation with exponential right hand side of which\nx + 3x = cos(2t) is the real part.\n[5]\n(d) Find a particular solution to the equation x + 3x = cos(2t).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex1s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/9c1b19091f3dbc9dc8fc520fc5449d43_MIT18_03S10_ex1s.pdf",
      "content": "18.03 Hour Exam I Solutions: February 24, 2010\n1. (a) x(t) = number of rats at time t; t measured in years. x = kx. So x(t) = x(0)ekt . ex(0) = x(1) =\nx(0)ekt implies k = 1.\nx\nx\n(b) x = k 1 -R\nx =\n1 -1000\nx.\nx\n(c) x =\n1 -R\nx -a. The pest control people hope for an equilibrium at x = 4\n3 R. x = 0 at equilib\nrium, so a = (1 -3 ) 3 R =\n3 R = 375.\n2. (a) The phase line shows unstable critical points at x = -2 and x = 1 and a stable critical point at\nx = 0. The arrows of time are directed up above 1 and between -2 and 0, and down between 0 and 1\nand below -2.\n(b) There are seven basic solution types: three equilibria; a solution rising above x = 1, a solution\nfalling from 1 towards 0, a solution rising from -2 towards 0, and a solution falling away from -2.\n(f) True. After the solution crosses the nullcline, it is \"inside\" the parabola and its derivative is positive.\nIf it were to cross the nullcline again it would have to cross the upper branch, from below. But the slope\nof the nullcline is positive, while at the moment of crossing the slope of the solution would have to be\nzero. So it does not cross again; it stays below the upper branch of the nullcline, which has equation\ny = √x.\nk\n3. (a) 1\nxk\n1/2\n3/2\nyk\n3/2\n5/2\n17/4\nmk = xk + yk\n7/2\nhmk\n1/2\nAns: 17/4.\n7/4\nc + sin t\nc\n(b) The equation is\nd (tx) = cos t, so tx = sin t + c and x =\n. 1 = x(π) =\nso c = π and\ndt\nπ\nt\nπ + sin t\nx =\n.\nt\n3-2i\n4. (a) 3+2i = 32 +22 : a = 13 , b = -13 .\nπ\n(b) r = |1 -i| =\n√\n2. θ = Arg(1 -i) = -4 .\nπ\n8 π\n(c) |1 -i| =\n√\n2 and Arg(1 -i) =\n4 , so |(1 -i)8| = (\n√\n2)8 = 16 and Arg((1 -i)8) =\n4 = 2π, so\n(1 -i)8 = 16: a = 16, b = 0.\n(d) If (a+bi)3 = -1 then a+bi 3 = (a+bi)3 =\n= 1 so a+bi = 1, and 3Arg(a+bi) = Arg(-1) = π\n|\n|\nπ\n|\n|\n5π\n|-1|\n|\n|\n(or 3π or 5π) so Arg(a + bi) =\n3 or π or\n3 . The first is the one with positive imaginary part, so\n√\na = cos π\n3 = 1\n2 , b = sin π\n3 =\n3 .\n(e) eln 2+iπ = eln 2eiπ = 2(-1) = -2: a = -2, b = 0.\nπ\n(f) A, φ are the polar coordinates of (a, b) = (2, -2): A = 2\n√\n2, φ = -4\n5. (a) Try x = Ae2t, so that x = A2e2t and e2t = A2e2t + 3Ae2t = 5Ae2t so A = 1\n5 : xp = 1\n5 e2t . The\n\ntransient is ce-3t, so x = 1\n5 e2t + ce-3t is a valid solution for any c as well.\n(b) 1 = x(0) = 5\n1 + c implies c = 5\n4 : this particular solution is x = 5\n1 e2t + 5\n4 e-3t\n(c) z + 3z = e2it .\nAe2it\nA2ie2it\n2it\n2it\n(d) Try z =\n: z =\n, so e\n= z + 3z = A(3 + 2i)e\n. This gives A = 3+2i and solution\n2it\n3-2i\nzp = 3+2ie\n=\n13 (cos(2t) + i sin(2t)), which has real part xp = 13 cos(2t) + 13 sin(2t).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/93229a9bbb9cb30fe717488a8b12d856_MIT18_03S10_ex2.pdf",
      "content": "18.03 Hour Exam II\nMarch 17, 2010\nYour Name\nYour Recitation Leader's Name\nYour Recitation Time\nProblem\nPoints\nTotal\nDo not open this booklet till told to do so. There are five problems. Use your test-\ntaking skills--be sure you get to all the problems. Do all your work on these pages.\nNo calculators or notes may be used. The point value (out of 100) of each problem\nis marked in the margin. Solutions will be available on the web after 4:00 today, and\nat recitation.\n\n[8]\n1. (a) For what value of k is the system represented by x+ x+kx = 0 critically damped?\n[4]\n(b) For k greater than that value, is the system overdamped or underdamped?\n[8]\n(c) Suppose a solution of x + x + kx = 0 vanishes at t = 1, and then again for t = 2 (but\nnot in between). What is k?\n\n[10]\n2. (a) Find a solution of x + x = 5te2t .\n[10]\n(b) Suppose that y(t) is a solution of the same equation, x+x = 5te2t, such that y(0) = 1\nand y(0) = 2. (This is probably not the solution you found in (a).) Use y(t) and other\nfunctions to write down a solution x(t) such that x(0) = 3 and x(0) = 5.\n\n[10]\n3. (a) Consider the equation x + bx + kx = cos(ωt). We will vary the spring constant\nbut keep b fixed. For what value of k is the amplitude of the sinusoidal solution of\nx + bx + kx = cos(ωt) maximal? (Your answer will be a function of ω and may depend\nupon b as well.)\nd3x\ndx\n[10]\n(b) (Unrelated to the above.) Find the general solution of\n= 0.\ndt3 - dt\n\n4. A certain system has input signal y and system response x related by the differential\nequation x + x + 6x = 6y. It is subjected to a sinusoidal input signal.\n[10]\n(a) Calculate the complex gain H(ω).\n[5]\n(b) Compute the gain at ω = 2.\n[5]\n(c) Compute the phase lag at ω = 2.\n\n5. Suppose that 1\n2 t sin(2t) is a solution to a certain equation mx + bx + kx = 4 cos(2t).\n[4]\n(a) Write down a solution to mx + bx + kx = 4 cos(2t - 1).\n[4]\n(b) Write down a solution to mx + bx + kx = 8 cos(2t).\n[12]\n(c) Determine m, b, and k.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex2s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/16fb444abaa452beb58ff4719e4a57cd_MIT18_03S10_ex2s.pdf",
      "content": "18.03 Hour Exam II Solutions: March 17, 2010\n\n1. (a) The characteristic polynomial is p(s) = s2 + s + k = s + 1\n+ k - 1\n4 . This has\na repeated root when k = 4\n1 .\n(b) If k is larger, the contents of the square root become negative and the roots become\nnon-real: so underdamped. (Note that this does not require the solution to (a).)\n(c) Vanishing twice implies underdamped. The pseudoperiod is 2 (since a damped si\nnusoid vanishes twice for each period), so ωd = 2\nπ = π. From p(s) = s2 + s + k =\n\nq\ns + 2\n+ k - 4\n1 we find ωd =\nk - 4\n1 , so k = π2 + 4\n1 .\n2. (a) Variation of parameters: x = ue2t . x = ( u + 2u)e2t , x = ( u + 4 u + 4u)e2t, so\nx + x = ( u +4 u +5u)e2t, and u must satisfy u +4 u +5u = 5t. Undetermined coefficients:\nup = at +\nb,\n2t\nu p = a, u p = 0, so 4a + 5(at + b) = 5t, a = 1, b = -5\n4 : up = t - 5\n4 ,\nxp = (t - )e .\n(b) The homogeneous equation has general solution a cos t+b sin t, so the general solution\nof x + x = 5te2t is x = y + a cos t + b sin t. 3 = x(0) = y(0) + a = 1 + a so a = 2.\n5 = x (0) = y (0) + b = 2 + b so b = 3: x = y + 2 cos(t) + 3 sin(t).\niωt\ne\n3. (a) The complex replacement z + bz + kz = eiωt has exponential solution zp =\n.\np(iω)\nThe amplitude of Re(zp) is\n, so we find what value of k minimizes p(iω) . p(iω) =\n|p(iω)|\n|\n|\n(k - ω2) + biω, so k = ω2 minimizes the absolute value. [This is interesting; the spring\nconstant resulting in largest gain is the one resulting in a system whose natural frequency\nmatches the driving frequency, independent of the damping constant.]\n(b) p(s) = s3 - s = s(s - 1)(s + 1), so the modes are e0t = 1, et, and e-t . The general\nsolution is ae-t + b + cet .\n4. (a) By time invariance and linearity we can suppose the input signal is cos(ωt).\nThe complex input is ycx = eiωt , and z + z + 6z = 6eiωt has exponential solution\niωt\nzp =\ne\n=\nycx, so the complex gain is H(ω) =\n=\n.\np(iω)\np(iω)\np(iω)\n(6 - ω2) + iω\n(b) H(2) = (6-4)+2i = 1+i , so g(2) = |H(2)| = √\n2 .\n(c) φ = -Arg(H)(ω) = Arg(1 + i) = π .\n5. (a) If we write q(t) = 4 cos(2t), the new input signal is 4 cos(2t - 1) = q(t - 1 ), so by\ntime-invariance, x = 1\n2 (t - 1\n2 ) sin(2(t - 1\n2 )) solves the new equation.\n(b) By linearity, x = t sin(2t).\n(c) The form of the solution indicates resonance: so ±2i are roots of the characteristic\npolynomial, which must thus be p(s) = m(s - 2i)(s + 2i) = m(s2 + 4). Thus b = 0 and\nk = 4m. By the Exponential Response Formula with resonance, mz + kz = 4e2it has\n4t\n4t\nt\nsolution\ne 2it =\ne 2it =\ne 2it, so the original equation has solution 1 t sin(2t).\np0(2i)\n4mi\nmi\nm\nThus m = 2, b = 0, k = 8.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/8abf410e1b106bc5c9d7dfdc95cf2bad_MIT18_03S10_ex3.pdf",
      "content": "18.03 Hour Exam III\nApril 23, 2010\nYour Name\nYour Recitation Leader's Name\nYour Recitation Time\n\nProblem\nPoints\nTotal\nDo not open this booklet till told to do so. There are five problems. Use your test-\ntaking skills--be sure you get to all the problems. Do all your work on these pages.\nNo calculators or notes may be used. The point value (out of 100) of each problem\nis marked in the margin. Solutions will be available on the web after 4:00 today, and\nat recitation.\nThere is a page of formulas at the back of the exam.\n\n1. A certain periodic function has Fourier series\ncos(πt)\ncos(2πt)\ncos(3πt)\ncos(4πt)\nf(t) = 1 +\n+\n+\n+\n+\n· · ·\n[4]\n(a) What is the minimal period of f(t)?\n[4]\n(b) Is f(t) even, odd, neither, or both?\n[8]\n(c) Please give the Fourier series of a periodic solution (if one exists) of\nx + ωn\n2 x = f(t)\n[4]\n(d) For what values of ωn is there no periodic solution?\n\n2. Let f(t) = (u(t + 1) - u(t - 1))t.\n[6]\n(a) Sketch a graph of f(t).\n[6]\n(b) Sketch a graph of the generalized derivative f 0(t).\n[8]\n(c) Write a formula for the generalized derivative f 0(t), and identify in your formula the\nregular part fr\n0(t) and the singular part fs\n0(t).\n\n3. Let p(D) be the operator whose unit impulse response is given by w(t) = e-t - e-3t .\n[10]\n(a) Using convolution, find the unit step response of this operator: the solution to\np(D)v = u(t) with rest initial conditions.\n[5]\n(b) What is the transfer function W (s) of the operator p(D)?\n[5]\n(c) What is the characteristic polynomial p(s)?\n\ne-s(s - 1)\n[10]\n4 (a) Find a generalized function f(t) with Laplace transform F (s) =\n.\ns\ns + 10\n[10]\n(b) Find a function f(t) with Laplace transform F (s) =\n.\ns3 + 2s2 + 10s\n\ns + 10\n5. Let W (s) =\n.\ns3 + 2s2 + 10s\n[10]\n(a) Sketch the pole diagram of W (s).\n[10]\n(b) If p(D) is the operator with transfer function W (s), what is the Laplace transform\nof the solution, with rest initial conditions, of p(D)x = sin(2t)?\n\nZ\n\nZ\n\nProperties of the Laplace transform\ninf\n0. Definition:\nL[f(t)] = F (s) =\nf(t)e-st dt\nfor Re s >> 0.\n0-\n1. Linearity:\nL[af(t) + bg(t)] = aF (s) + bG(s).\n2. Inverse transform: F (s) essentially determines f(t).\n3. s-shift rule:\nL[eatf(t)] = F (s - a).\n4. t-shift rule:\nL[fa(t)] = e-asF (s),\nfa(t) =\nf(t - a) if t > a .\nif t < a\n5. s-derivative rule:\nL[tf(t)] = -F 0(s).\n6. t-derivative rule:\nL[f 0(t)] = sF (s), where f 0(t) denotes the generalized derivative.\nL[fr\n0(t)] = sF (s) - f(0+) if f(t) is continuous for t > 0.\nt\n7. Convolution rule:\nL[f(t) ∗ g(t)] = F (s)G(s), f(t) ∗ g(t) =\nf(t - τ)g(τ)d τ.\n8. Weight function:\nL[w(t)] = W (s) = 1/p(s), w(t) the unit impulse response.\nFormulas for the Laplace transform\nn!\nL[1] = s\nL[e at] = s - a\nL[tn] = sn+1\ns\nω\nL[cos(ωt)] = s2 + ω2\nL[sin(ωt)] = s2 + ω2\nL[t cos(ωt)] =\n2ωs\nL[t sin(ωt)] = s2 - ω2\n(s2 + ω2)2\n(s2 + ω2)2\nFourier coefficients for periodic functions of period 2π:\na0\nf(t) =\n+ a1 cos(t) + a2 cos(2t) +\n+ b1 sin(t) + b2 sin(2t) +\n· · ·\n· · ·\nZ π\nZ π\nam =\nf(t) cos(mt) dt,\nbm =\nf(t) sin(mt) dt\nπ\nπ\n-π\n-π\nIf sq(t) is the odd function of period 2π which has value 1 between 0 and π, then\nsin(3t)\nsin(5t)\nsq(t) =\nsin(t) +\n+\n+\nπ\n· · ·\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_ex3s.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/1e4551f505ac91c2ef71e98142255f3d_MIT18_03S10_ex3s.pdf",
      "content": "Z\nZ\n\n18.03 Hour Exam III Solutions: April 23, 2010\n1. (a) The miminal period is 2.\n(b) f(t) is even.\ncos(πt)\ncos(2πt)\ncos(3πt)\n(c) xp(t) = ωn\n2 + 2(ωn\n2 - π2) + 4(ωn\n2 - 4π2) + 8(ωn\n2 - 9π2) + · · ·\n(d) There is no periodic solution when ωn = 0, π, 2π, 3π, . . ..\n2. (a)\n\nor\n\n(b)\n?\n?\nor\n-1\n-1\n(c) f 0(t) = (u(t + 1) - u(t - 1)) - δ(t + 1) - δ(t - 1); f 0(t) = u(t + 1) - u(t - 1),\nr\nf 0(t) = -δ(t + 1) - δ(t - 1).\ns\nw(t - τ)u(τ) dτ =\nt\nt\n(e-(t-τ) - e-3(t-τ )) dτ\n3. (a) v(t) = w(t) ∗ u(t) =\nt\n3τ\n1 - e-3t\n= 2\n3 - e-t + e-3t\n= e-t\nτ t\ne\ne |0 - e-3t\n= (1 - e-t) -\n.\n(b) W (s) = L[w(t)] = s + 1 - s + 3 .\n(c) W (s) = (s + 3) - (s + 1) =\n, so p(s) = 1\n2 (s2 + 4s + 3).\n(s + 1)(s + 3)\ns2 + 4s + 3\n4. (a) s - 1 = 1 - 1 δ(t) - u(t), so e-s(s - 1) δ(t - 1) - u(t - 1).\ns\ns\ns\ns + 10\na\nb(s + 1) + c\n(b) F (s) =\n=\n+\n. By coverup, a =\n= 1. By complex\ns3 + 2s2 + 10s\ns\n(s + 1)2 + 9\ncoverup (multiply through by (s + 1)2 + 9 and set s to be a root, say -1+3i), b(3i)+ c =\ns + 1\n9+3i\n-1+3i = -3i, so b = -1, c = 0, and F (s) = s - (s + 1)2 + 9, which is the Laplace\ntransform of 1 - e-t cos(3t).\n5. (a) {0, -1 + 3i, -1 - 3i}.\n\ns + 10\n(b) X(s) = W (s)F (s). F (s) = s2 + 4, so X(s) =\ns3 + 2s2 + 10s\ns2 + 4 .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/4c539d9db4ad9792b86137a66ed7626b_MIT18_03S10_final.pdf",
      "content": "18.03 Final Examination\n9:00-12:00, May 18, 2010\nYour Name\nRecitation Leader\nRecitation Time\nDo not turn the page until you are instructed to do so.\nWrite your name, your recitation leader's name, and the time of your recitation. Show\nall your work on this exam booklet. When a particular method is requested you must\nuse it. No calculators or notes may be used, but there is a table of Laplace transforms\nand other information at the end of this exam booklet. Point values (out of a total\nof 360) are marked on the left margin. The problems are numbered 1 through 10.\n\n1. (a) and (b) concern the tritium that is leaking from the Oyster Creek Nuclear Generating\nStation into the aquifer in New Jersey at a certain rate, which we will assume is one kilogram\nper year. The half life of tritium is 12 years.\n[6]\n(a) Ignoring other effects (other sources or sinks of the tritium), set up a differential equation\nfor the amount of tritium in the aquifer as a function of time. (For full credit, determine\nany constants in the equation.)\n[6]\n(b) If this leak goes on for a long time, what will the tritium load in the aquifer be? (How\nmany kilograms?)\ndy\ny2\nParts (c)-(g) of this problem will concern the differential equation\n= x -\n.\ndx\n[6]\n(c) Let y(x) denote the solution to this equation such that y(1) = 0. Use Euler's method\nwith step size 1\n2 to estimate y(2).\n\ndy\ny2\n1. Continuing with\n= x -\ndx\n[3]\n(d) Sketch the isoclines for slopes m = -1, m = 0, and m = 1, on the plane below.\n[3]\n(e) On the same plane, sketch the graph of the solution y(x) with y(1) = 0.\n[6]\n(f) For this same solution, suppose that y(x) achieves a minimum at x = a. What is y(a)\n(in terms of a)?\n[6]\n(g) Estimate the value of y(100).\n\n2. In (a)-(c) we consider the autonomous equation x = x3 -x2 -2x.\n[10]\n(a) On the vertical line below, sketch the phase line of this equation.\n[10]\n(b) Sketch the graphs of some solutions. Be sure to include at least one solution with values\nin each interval above, below, and between the critical points.\n[6]\n(c) Suppose x(0) is quite small, say 0.1. For t > 0, x(t) is best approximated by (0.1)eat for\nwhat value of a?\ndy\nsin(x)\n[10]\n(d) Solve the initial value problem x\n+ 2y = -\n, y(π) = 0.\ndx\nx\n\n[6]\n3. (a) Find a complex number r (expressed as r = a + bi with a, b real) and a positive real\neiωt\n\nπ\nnumber ω such that Re\n= 2 cos 2t -\n.\nr\n[6]\n(b) Express the cube roots of -8i in the form a + bi (with a and b real).\n[8]\n(c) What is the pseudoperiod of a nonzero solution to x + 2 x + 10x = 0?\n\n[8]\n3. (continued) (d) At what circular frequency ω = ωr does the sinusoidal solution to\nx + 2 x + 10x = cos(ωt) have the largest amplitude?\n[8]\n(e) At what circular frequency ω = ωp is the phase lag of the solution to x +2 x+10x = cos(ωt)\nequal to π\n2 ?\n\n4. Let p(D) = D2 + 4D + 8I.\n[10]\n(a) Find one solution to p(D)x = 8t2 .\n[10]\n(b) Find one solution to p(D)x = e-t .\nIn (c) and (d), suppose that x = t3 is a solution to p(D)x = q(t)\n(where still p(D) = D2 + 4D + 8I).\n[8]\n(c) What is q(t)?\n[8]\n(d) What is the solution to p(D)x = q(t) such that x(0) = 0 and x(0) = 2?\n\n[15]\n5. (a) Find a periodic solution to x + ωn\n2 x = sq(2t) if one exists.\n[6]\n(b)-(c) concern the function f(t), periodic of period 2π, with f(t) = |t| -π\n(b) Is f(t) even, odd, or neither?\nWhat is its average value?\nGraph f(t).\nfor |t| ≤π.\n[15]\n(c) What is the Fourier series of f(t)?\n\n@\n@\n@\n\n@\n@\n@\n\n@\n@\n@\n\n@\n@\n@\n\n@\n@\n@\n\n@\n@\n@\n6. (a)-(b) The function f(t) is defined by the following graph, in which the hashmarks are\nat unit spacing.\n[6]\n(a) Graph the generalized derivative f ′(t).\n[8]\n(b) Write a formula for f ′(t), using step and delta functions as necessary. Identify in your\nformula the regular part fr\n′ (t) and the singular part fs\n′ (t).\n\n6. (continued) Suppose that the unit impulse response of a certain operator p(D) is\nw(t) = u(t)e-t sin(2t).\n[8]\n(c) Please calculate the solution to p(D)x = u(t)e-t, with rest initial conditions.\n[6]\n(d) What is the solution to p(D)x = δ(t -1) with rest initial conditions?\n[8]\n(e) What is the characteristic polynomial p(s)?\n\n7. (a)-(c) concern the operator p(D) = D3 + D.\n[8]\n(a) What is the transfer function of the operator p(D)?\n[10]\n(b) What is the unit impulse response of this operator?\n[10]\n(c) What is the Laplace transform X(s) of the solution to p(D)x = cos(2t) with rest initial\nconditions?\n(s + 1)e-s\n[8]\n(d) Sketch the pole diagram of s3 + 2s2 + 2s\n\n-1\n8. In (a) and (b), A =\n.\n-1\n[8]\n(a) What are the eigenvalues of A?\n[8]\n(b) For each eigenvalue, find a nonzero eigenvector.\n(c)-(e) concern a certain 2 × 2 matrix B, whose eigenvalues are known to be 2 and -2.\n[6]\n(c) What is the trace of B?\nWhat is the determinant of B?\n[8]\n(d) Suppose also that\nis an eigenvector for value 2 and\nis an eigenvector for\nvalue -2. Calculate eBt .\n\n[6]\n(e) What is the solution to u = Bu with u(0) =\n?\n\n9. Let A =\n, and consider the homogeneous linear system u = Au.\n-2\na\n[6]\n(a) On the (Tr,Det) plane below, sketch the critical parabola (where the matrix has repeated\neigenvalues) and sketch line corresponding to the matrices A as a varies.\n[30]\n(b) For each of the following conditions, indicate the values of a (if any) for which the phase\nportrait satisfies the condition.\n(i) Saddle\n(ii) Stable node = nodal sink\n(iii) Unstable node = nodal source\n(iv) Stable spiral = spiral sink\n(v) Unstable spiral = spiral source\n(vi) Stable defective node = defective nodal sink\n(vii) Unstable defective node = defective nodal source\n(viii) Star\n(ix) Center\n(x) Degenerate case\n\nx = (y + 1)(y -x + 1)\n10. This problem concerns the nonlinear autonomous system\n.\ny = (x -3)(x + y -1)\n[12]\n(a) Find the equilibria of this system and plot them on the (x, y) plane below.\n\nx = (y + 1)(y -x + 1)\n10. (continued)\n.\ny = (x -3)(x + y -1)\n[12]\n(b) One equilibrium is at (1, 0). Find the Jacobian matrix at this equilibrium.\n[12]\n(c) The equilibrium at (1, 0) is a stable spiral. For large t, the solutions which converge to\nthis equilibrium have y-coordinate well-approximated by the function Aeat cos(ωt - φ) for\nsome constants A, φ, a, and ω. Some of these constants depend upon the particular solution,\nand some are common to all solutions of this type. Find the values of the ones which are\ncommon to all such solutions.\n\nZ\n\nZ\n\nOperator Formulas\n- Exponential Response Formula: xp = Aert/p(r) solves p(D)x = Aert provided p(r) = 0.\n- Resonant Response Formula: If p(r) = 0 then xp = Atert/p′(r) solves p(D)x = Aert\nprovided p ′(r) = 0.\nDefective matrix formula\nIf A is a defective 2 × 2 matrix with eigenvalue λ1 and nonzero eigenvector v1, then you can\nsolve for w in (A -λ1I)w = v1 and u = eλ1t(tv1 + w) is a solution to u = Au.\nProperties of the Laplace transform\ninf\n0. Definition:\nL[f(t)] = F(s) =\nf(t)e -st dt\nfor\nRe(s) >> 0.\n0-\n1. Linearity:\nL[af(t) + bg(t)] = aF(s) + bG(s).\n2. Inverse transform:\nF(s) essentially determines f(t).\n3. s-shift rule:\nL[eatf(t)] = F(s -a).\n4. t-shift rule:\nL[fa(t)] = e-asF(s),\nfa(t) =\nf(t -a)\nif t > a .\nif t < a\n5. s-derivative rule:\nL[tf(t)] = -F ′ (s).\n6. t-derivative rule:\nL[f ′(t)] = sF(s)\n[generalized derivative]\nL[fr\n′ (t)] = sF(s) -f(0+)\n[f(t) continuous for t > 0]\nZ t\n7. Convolution rule:\nL[f(t) ∗ g(t)] = F(s)G(s), f(t) ∗ g(t) =\nf(τ)g(t -τ)d τ.\n8. Weight function:\nL[w(t)] = W(s) =\n,\nw(t) the unit impulse response.\np(s)\nFormulas for the Laplace transform\nn!\nL[1] =\nL[e at] =\nL[tn] = sn+1\nL[δa(t)] = e -as\ns\ns -a\ns\nω\ne-as\nL[cos(ωt)] =\nL[sin(ωt)] =\nL[ua(t)] =\ns2 + ω2\ns2 + ω2\ns\nFourier series f(t) = a\n0 + a1 cos(t) + a2 cos(2t) + · · · + b1 sin(t) + b2 sin(2t) + · · ·\n1 Z π\nπ\nam =\nf(t) cos(mt) dt,\nbm =\nf(t) sin(mt) dt\nπ\n-π\nπ\n-π\nIf sq(t) is the odd function of period 2π which has value 1 between 0 and π, then\nsin(3t)\nsin(5t)\nsq(t) =\nsin(t) +\n+\n+ · · ·\nπ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_prex_02_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/a3417a05f84f8249ce343adad2d61bba_MIT18_03S10_prex_02_guide.pdf",
      "content": "18.03 Study Guide and Practice Hour Exam II, March, 2010\nStudy guide\n1. Models. A linear dierential equation is one of the form an(t)x(n) +\n+ a1(t) x +\n· · ·\na0(t)x = q(t). The ak(t) are coecients. The left side models a system, q(t) arises from\nan input signal, and solutions x(t) provide the system response. In this course the system\nis unchangingtime-invariantso the coecients are constant. Then the equation can\nbe written in terms of the characteristic polynomial p(s) = ansn +\n+ a1s + a0 as\n· · ·\np(D)x = q(t).\nSpring system: p(s) = ms2 + bs + k. System response x is position of the mass. If driven\ndirectly, q(t) = Fext(t). If driven through the spring, q(t) = ky(t) (y(t) the position of\nthe far end of the spring). If driven throught the dashpot, q(t) = my (y=position of far\nend of dashpot).\n2. Homogeneous equations. The mode ert solves p(D)x = 0 exactly when p(r) = 0.\nIf r is a double root one needs tert also (etc.). The general solution is a linear combination\nof these (Super I). If the coecients are real and r = a + bi with b = 0 then eat cos(bt)\nand eat sin(bt) are independent real solutions. If all roots have negative real part then all\nsolutions decay to zero as t →inf and are called transients. In case p(s) = ms2 + bs + k\nwith m > 0 and b, k ≥ 0, the equation is overdamped if the roots are real and distinct\n(k < b2/4m), underdamped if the roots are not real (k > b2/4m), and critically damped\nif there is just one (repeated) root (k = b2\nq/4m). In the underdamped case the general\nsolution is e-bt/2m cos(ωdt - φ) where ωd =\nk - ( b )2 is the damped circular frequency.\nm\n2m\n3. Linearity. Superposition III: if p(D)x1 = q1(t) and p(D)x2 = q2(t), then x =\nc1x1 + c2x2 solves p(D)x = c1q1(t) + c2q2(t) (c1, c2 constant). Consequence (Super II):\nthe general solution to p(D)x = q(t) is x = xp + xh where xp is a solution and xh is the\ngeneral solution to p(D)x = 0.\n4. Exponential response formula: If p(r) = 0 then Aert/p(r) solves p(D)x = Aert.\nIf p(r) = 0 but p0(r) = 0\nthen Atkert/p0(r) solves p(D)x = Aert. (Etc.)\n5. Complex replacement: If p(s) has real coecients then solutions of p(D)x =\nAert cos(ωt) are real parts of solutions of p(D)z = Ae(r+iω)t.\n6. Undetermined coecients: With p(s) = ansn +\n+ a1s + a0, if a0 = 0 then\n· · ·\np(D)x = bktk +\n+ b1t + b0 has exactly one polynomial solution, which has degree at\n· · ·\nmost k. If ak is the rst nonzero coecient, then make the substitution u = x(k) and\nproceed (reduction of order). For xp you can take constants of integration to be zero.\n7. Variation of parameters: To solve p(D)x = f(t)ert, try x = uert. This leads to a\ndierent equation for u with right hand side f(t).\n8. Time invariance: If p(D)x = q(t), then y = x(t - a) solves p(D)y = q(t - a). This\nlets you convert any sinusoidal term in q(t) to a cosine.\n9. Frequency response: An input signal y determines q(t) in p(D)x = q(t). With\ny = ycx = eiωt, an exponential system response has the form H(ω)eiωt for some complex\nnumber H(ω), calculated using ERF. (If ERF fails then the complex gain is innite.)\nThen with y = A cos(ωt), xp = g cos(ωt - φ) where g = |H(ω)| is the gain and φ =\n-Arg (H(ω)) is the phase lag. By time invariance the gain and phase lag are the same\nfor any sinusoidal input signal of circular frequency ω.\n\nPractice Hour Exam\n1. The mass and spring constant in a certain mass/spring/dashpot system are known\nm = 1, k = 25but the damping constant b is not known. It's observed that for a certain\nsolution x(t) of x + bx + 25x = 0, x(π\n) = 0, but x(t) > 0 for π\n6 < t < π .\n) = 0 and x(π\n(a) Is the system underdamped, critically damped, or overdamped?\n(b) Determine the value of b.\n2. Find a solution of 3 x + 2 x + x = t2.\n3. Find a solution to x + 3 x + 2x = e-t.\n4. This problem concerns the sinusoidal solution x(t) of x + 4 x + 9x = cos(ωt).\n(a) For what value of ω is the amplitude of ( ) maximal?\nt\nx\nπ\n(b) For what value of ω is the phase lag exactly ?\n5. The equation 2 x + x + x = y models a certain system in which the input signal is\ny and the system response is x. We drive it with a sinusoidal input signal of circular\nfrequency ω. Determine the complex gain as a function of ω, and the gain and phase lag\nat ω = 1.\nd3x\n6. Find a solution to\n+ x = e-t cos t.\ndt3\n7. Assume that cos t and t are both solutions of the equation p(D)x = q(t), for a certain\npolynomial p(s) and a certain function q(t).\n(a) Write down a nonzero solution of the equation p(D)x = 0.\n(b) Write down a solution x(t) of p(D)x = q(t) such that x(0) = 2.\n(c) Write down a solution of the equation p(D)x = q(t - 1).\n\nSolutions\n1. (a) Underdamped.\n(b) The pseudoperiod is 2(π - π ) = 2π . Thus ωd =\n2π = 3, 9 = ω2 = k - (b/2)2 =\n2π/3\nd\n25 - (b/2)2, so (b/2)2 = 25 - 9 = 16, b/2 = 4, b = 8.\n1]\nx\n= at2\n+\nbt\n+\nc\n2]\nx\n=\n2at\n+\nb\n2. 3]\nx\n=\n2a\nt2\n= at2\n+\n(b + 4a)t + c + 2b + 6a\nso a = 1, b + 4a = 0, c + 2b + 6a = 0, b = -4, c = 2: xp = t2 - 4t + 2.\n3. p(s) = s2 + 3s + 2, p(-1) = (-1)2 + 3(-1) + 2 = 0, so ERF fails. p0(s) = 2s + 3,\np0(-1) = 1, xp = te-t.\n4. (a) The amplitude is 1/|p(iω)|. p(iω) = (k-mω2)+biω = (9-ω2)+4iω. To maximize\nthe amplitude we can minimize |p(iω)|2 = (9 - ω2)2 + 16ω2. Now\nd\ndω |p(iω)|2 = 2(9 - ω2)(-2ω) + 2 · 16ω is zero when ω = 0 and when (9 - ω2) = 8, or\nω = ±1. Thus ωr = 1.\n(b) The phase lag is the argument of p(iω). This is π\n4 when the real and imaginary parts\nare equal and positive. So 9 - ω2 = 4ω, or ω2 + 4ω - 9 = 0, i.e. (ω + 2)2 - 13. This is\nzero when ω = -2 ±\n√\n13. Choose the + for a positive value: ω =\n√\n13 - 2.\n5. By time-invariance, we can suppose that the input signal is y = A cos(ωt). Replace y\nwith ycx = Aeiωt. The equation is then 2 z + z + z = Aiωeiωt. p(iω) = (1 - 2ω2) + iω, so\nAiω\niω\nby the ERF zp =\ne iωt. So H(ω) =\n. With ω = 1, H(1) =\n(1 - 2ω2) + iω\n(1 - 2ω2) + iω\ni\n-1+i = 1+i , which has magnitude g(1) = √\n2 . The phase lag is -Arg (H(1)) = π\n4 .\nd3z\n6. This is the real part of\n+ z = e(-1+i)t. The characteristic polynomial is p(s) =\ndt3\ns3 + 1, and p(-1 + i) = 2(1 + i) + 1 = 3 + 2i. So zp = e(-1+i)t\n= e-t 3 - 2ie it, and\n3 + 2i\nxp = Re (zp) = 1 e-t(3 cos t+2 sin t) (This can also be done using variation of paramters.)\n7. (a) By linearity, p(D)(cos t - t) = p(D) cos t - p(D)t = q(t) - q(t) = 0. In fact\na(cos t - t) will work for any a (except a = 0, since we wanted a nonzero solution).\n(b) By linearity, we can add any homogeneous solution and get a new solution. If we\nstart with xp = t, we can add xh = 2(cos t - t): x = 2 cos t - t.\n(c) By time-invariance, x(t - 1) will work, for any solution x(t) of p(D)x = q(t). So t - 1\nand cos(t - 1) work, as does a cos(t - 1) + (1 - a)(t - 1) for any a.\nActually, LTI implies that if one sinusoidal function of circular frequency 1 is a solution\nof p(D)x = 0, then any sinusoidal function of circular frequency 1 is too, so there are\neven more choices of answers to all these questions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_prex_03_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/f28ebfb36a4e555b61735e279051fa41_MIT18_03S10_prex_03_guide.pdf",
      "content": "18.03 Study Guide and Practice Hour Exam III, April, 2010\nStudy Guide on Step, Delta, Convolution, Laplace\nYou can think of the step function u(t) as any nice smooth function which is 0 for t < -a\nand 1 for t > a, where a is a positive number which is much smaller than any time scale\nwe care about in the context we are studying at the moment. Similarly, the best way for\nyou to understand the delta function is to think of it as any smooth function which is\nzero except in the immediate neighborhood of t = 0 and which has integral 1.\nt\nSo u (t - b) = δ(t - b) and if a < b then\n\nδ(τ - a) dτ = u(t - a).\na\nA function f(t) is regular or piecewise smooth if it can be broken into pieces each\nhaving all higher derivatives and such that at each breakpoint f (n)(a-) and f (n)(a+)\nexist. A singularity function is a linear combination of shifted delta functions. A\ngeneralized function f(t) is a sum f(t) = fr(t) + fs(t) of a regular function and a\nsingularity function. Any regular function f(t) has a generalized derivative f 0(t), with\nregular part fr\n0(t) the regular derivative of f(t) whereever it exists, and singular part\nfs\n0(t) given by a sum of terms (f(a+) - f(a-))δ(t - a), one for each break in the graph\nof f(t).\nThen\nc f 0(t) dt = f(c) - f(a). (To be more precise,\nc+ f 0(t) dt = f(c+) - f(a-).)\na\na-\nFor the rest of this unit, all signals (functions of t) are supposed to be zero for t < 0. We\nlook for solutions to the dierential equation p(D)x = q(t), especially with rest initial\nconditions, so that x(t) = 0 for t < 0 and x has as many derivatives as possible.\nThe unit impulse response or weight function of the operator p(D) is the solution w(t)\nto the equation p(D)w = δ(t), with rest initial conditions. If p(s) = ansn +\n+ a0 with\n· · ·\nan = 0\n, and x is such that p(D)x = 0 and x(0) = · · · = x(n-2)(0) = 0 and x(n-1)(0) = a\nn ,\nthen w(t) = u(t)x(t). The unit step response is the solution to p(D)v = u(t) with rest\ninitial conditions; for t > 0 this coincides with the solution to p(D)x = 1 such that\nx(0) =\n= x(n-1)(0) = 0. Since u (t) = δ(t), v (t) = w(t).\n· · ·\nThe response to a unit impulse determines the system response to any other input signal\n(with rest initial conditions): the solution to p(D)x = q(t) is given by x(t) = w(t) ∗ q(t),\nt\nwhere the asterisk indicates the convolution product f(t) ∗ g(t) =\n\nf(t - τ)g(τ) dτ.\nThe convolution product has properties analogous to the ordinary product: f ∗ (g ∗ h) =\n(f ∗ g) ∗ h, f ∗ (ag + bh) = a(f ∗ g) + b(f ∗ h), f ∗ g = g ∗ f. Also f(t) ∗ δ(t) = f(t). If you\nfeed the output of a system (with unit impulse response g(t)) into another system (with\nunit impulse response f(t)), you get a composite system with unit impulse response\nf(t) ∗ g(t).\nThe Laplace transform carries a generalized function (with f(t) = 0 for t < 0) to a\nfunction F (s) of a complex variable s. It obeys a bunch of rules, the most important of\nwhich are linearity and the t-derivative rule L[f 0(t)] = sF (s), where here f 0(t) denotes the\ngeneralized derivative. There are standard computations, too, including L[δ(t)] = 1 (the\nconstant function of s). These already imply that the unit impulse response w(t) of p(D)\nsatises L[w(t)] =\n1 . W (s) = L[w(t)] is the transfer function of the operator p(D).\np(s)\nAlso the solution to p(D)x = f(t) with rest initial conditions has Laplace transform\nX(s) = W (s)F (s). This relates to the formula L[f(t) ∗ g(t)] = F (s)G(s).\nIf f(t) and g(t) have the same Laplace transform, then f(a-) = g(a-) and f(a+) =\n\ng(a+) for every a ≥ 0.\nIf F (s) is a rational function (quotient of a polynomial by a polynomial), continued\nfractions provides standard way to nd f(t). Coverup is an ecient way to compute\nsome of the coecietns. This couples with completing the square and the s-shift rule.\nThe pole diagram of F (s) is the set of complex numbers s at which |F (s)| becomes\ninnite. This is the set of uncancelled zeros in the its denominator. The pole diagram of\nF (s) = L[f(t)] determines the region of convergence of the integral: it is the region to\nthe right of the vertical line through the rightmost pole. The pole diagram also controls\nmuch of the behavior of f(t) for large t (while saying nothing about behavior for small\nt). The rightmost poles dominate. A pole at a + iω leads to exponential growth/decay\nlike eat (or some polynomial times eat) and oscillation of circular frequency ω.\nThe transfer function occured earlier in the course: the exponential solution to p(D)z =\nert is zp = W (r)ert. So the sinusoidal solution to p(D)x = cos(ωt) is xp = |W (iω)| cos(ωt-\nφ), where φ = -Arg (W (iω)): W (iω) is the complex gain if ert itself is regarded as the\ninput signal), and |W (iω)| is the gain. The amplitude response curve is obtained by\nintersecting the graph of |W (s)| with the plane above the imaginary axis.\nPractice Hour Exam\n1. Let ω be a positive constant. We drive a harmonic oscillator with a square wave of\ncircular frequency ω: x + 4x = sq(ωt).\n(a) Write down a periodic solution to the equation, if ω is such that there is one.\n(b) For what values of ω does there fail to be a periodic solution?\n2. Let f(t) =\n⎧\n⎪\n⎨\n⎪\n⎩\nfor t < 0\n1 - t for 0 < t < 1\nfor\n.\nt > 1\n(a) Sketch the graph of f(t).\n(b) Sketch the graph of the generalized derivative f 0(t).\n(c) Write down a formula for f 0(t) in terms of step and delta functions.\n3. (a) Compute the convolution product t ∗ t6.\n(b) A certain operator p(D) has unit impulse response w(t) = 2u(t)te-t. What is the\nsolution to p(D)x = e-t with rest initial conditions?\n4. (a) What is the Laplace transform of the solution to the equation x + 2 x + 2x = 1\nhaving rest initial conditions?\n2s\n(b) What function f(t) has Laplace transform F (s) =\n?\n(s + 1)(s2 + 2s + 5)\n5. (a) Sketch the pole diagram for the function F (s) =\n.\n(s + 1)(s2 + 2s + 5)\n(b) Give an example of a function f(t) whose Laplace transform has poles at s = 2 and\ns = -3 ± 4i and nowhere else.\n\n(\n\n!\nProperties of the Laplace transform\ninf\n0. Denition:\nL[f(t)] = F (s) =\nˆ\nf(t)e-st dt\nfor Re s >> 0.\n0-\n1. Linearity:\nL[af(t) + bg(t)] = aF (s) + bG(s).\n2. Inverse transform: F (s) essentially determines f(t).\n3. s-shift rule:\nL[eatf(t)] = F (s - a).\n4. t-shift rule:\nL[fa(t)] = e-asF (s),\nfa(t) =\nf(t - a) ift > a .\nift < a\n5. s-derivative rule:\nL[tf(t)] = -F 0(s).\n6. t-derivative rule:\nL[f 0(t)] = sF (s), where f 0(t) denotes the generalized derivative.\nL[fr\n0(t)] = sF (s) - f(0+) if f(t) is continuous for t > 0.\nt\n7. Convolution rule:\nL[f(t) ∗ g(t)] = F (s)G(s), f(t) ∗ g(t) =\nˆ\nf(t - τ)g(τ )d τ.\n8. Weight function:\nL[w(t)] = W (s) = 1/p(s), w(t) the unit impulse response.\nFormulas for the Laplace transform\nn!\nL[1] = s\nL[e at] = s - a\nL[tn] = sn+1\ns\nω\nL[cos(ωt)] =\nL[sin(ωt)] =\ns2 + ω2\ns2 + ω2\nL[t sin(ωt)] =\n+\nωs\nω2)2\nL[t cos(ωt)] = s\n+\n-\nω\nω\n)2\n(s\n(s\nFourier coecients for periodic functions of period 2π:\na0\nf(t) =\n+ a1 cos(t) + a2 cos(2t) +\n+ b1 sin(t) + b2 sin(2t) +\n· · ·\n· · ·\n1 ˆ π\n1 ˆ π\nam =\nf(t) cos(mt) dt,\nbm =\nf(t) sin(mt) dt\nπ\nπ\n-π\n-π\nIf sq(t) is the odd function of period 2π which has value 1 between 0 and π, then\nsin(3t)\nsin(5t)\nsq(t) =\nsin(t) +\n+\n+\nπ\n· · ·\n\n!\n\n!\n\nSolutions\nsin(3ωt)\nsin(5ωt)\n1. (a) sq(ωt) =\nsin(ωt) +\n+\n+\n. Using superposition and the\nπ\n· · ·\nsin(ωt)\nfact that x + 4x = A sin(ωt) has solution xp = A\n,\n4 - ω2\nsin(ωt)\nsin(3ωt)\nsin(5ωt)\nxp =\n+\n+\n+\nπ\n4 - ω2\n3(4 - 9ω2)\n5(4 - 25ω2)\n· · ·\n(b) This solution does not exist if ω = 2/(odd integer).\n@\n@\n@\n@\n2. (a)\n@\nor\n@\n@\n@\n@\n@\n2. (b)\nor\n(c) f 0(t) = -(u(t) - u(t - 1)) + δ(t) + δ(t - 1).\nt\nt\nτ 7\nτ 8\nt8\n3. (a) t ∗ t6 =\nˆ\n(t - τ)τ 6 dτ =\nˆ\n(tτ 6 - τ 7) dτ =\n\"\nt 7 - 8\n#t\n= t8\n7 - 8 = 56 .\nt\nt\nh\nit\n(b) x(t) = w(t) ∗ e-t =\nˆ\n2(t - τ)e-(t-τ)e-τ dτ = e-t\nˆ\n2(t - τ ) dτ = e-t -(t - τ)2\n= t2 e-t\n4. (a) s 2X + 2sX + 2X = , so X =\n.\ns\ns(s2 + 2s + 2)\n2s\na\nb(s + 1) + c\n(b)\n=\n+\n.\n(s + 1)(s2 + 2s + 5)\ns + 1\n(s + 1)2 + 4\nBy coverup, a =\n2(-1)\n= - 1 , b(2i) + c = 2(-1 + 2i) = 2 + i so b = 2 and\n(-1)2 + 2(-1) + 5\n2i\nc = 2. Thus f(t) = -2\n1 e-t + e-t\n1 cos(2t) + sin(2t) .\n5. (a) Poles at s = -1 and at s = -1 ± 2i.\n(b) e2t + e-3t sin(4t), or many others.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_prex1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/b44599bd7273f67ef42750054c1ab121_MIT18_03S10_prex1.pdf",
      "content": "18.03 Practice Hour Exam I (2010)\n1. A certain computer chip sheds heat at a rate proportional to the difference between\nits temperature and that of its environment.\n(a) Write down a differential equation controlling the temperature of the chip, as a\nfunction of time measured in minutes, if the temperature in the environment is a constant\n20*C. Your equation will have a constant in it which can't be determined from the data\ngiven so far.\n(b) What is the general solution of this equation? (This will still involve the unknown\nconstant).\n(c) It is observed that if the chip is powered down at t = 0 at a temperature of 70*C in\na room at 20*C, its temperature at t = 10 minutes is 60*C. Use this new information to\ncomplete the determination of the differential equation.\n2. Estimate y(2.2) where y is the solution of the differential equation y0 = y2\nx2 with\n-\ny(2) = 0, using Euler's method with step size 0.1.\n3. This problem concerns the differential equation y0 = y2 -x2 . Part of its direction field\nis shown below.\n(a) On the diagram, sketch and label the isoclines for slope m = -4, m = 0, and m = 4.\n(b) On the diagram, sketch the graph of the solution of the equation with y(2) = 0.\ny ' = y2 - x2\n-6\n-4\n-2\ny\n-6\n-4\n-2\nx\n(c) Estimate the value y(100) of the solution with y(2) = 0. Is your estimate too large\nor too small?\n(d) A certain solution y has a local extremum at x = -1. What can you say about\ny(-1)? Is the extremum a maximum or a minimum? For full credit, make a relevant\ncalculation, rather than merely relying on the picture.\n\n4. (a) Find the general solution of tx + 2x = t2 .\n(b) Find a sinusoidal solution to the differential equation x+2x = cos(2t). Express your\nanswer as a sum of sines and cosines. You may use any method to find this solution.\n5. (a) Express each of the cube roots of -8i first in the form Aeiθ and then in the form\na + bi.\n(b)-(e) relate to the sinusoidal function f(t) = -cos( πt) -sin( πt).\n(b) Find positive real numbers A and φ such that f(t) = A cos( πt -φ).\n(c) What is the period P of this sinusoidal function?\n(d) What is the time lag t0 of this sinusoidal function?\n(e) Please sketch a graph of this function below, marking on the diagram A, P, and t0.\n6. This problem concerns the autonomous equation y = y3 -y.\n(a) Sketch the phase line for this equation. Mark on it all critical points. Label each\ncritical point as stable, unstable, or neither.\n(b) Sketch some solutions for this equation, enough so that for any b between -2 and\n+2 you show a solution y such that y(t) = b for some t.\n(c) Determine where points of inflection occur in solutions to this equation. (A function\nf(t) has a point of inflection at (a, b) if f(a) = b and f 00(a) = 0.)\nSolutions\n1. (a) Let x(t) be the temperature of the chip in degrees C. x = (20-x), or x+kx = 20.\n(b) x = 20 + Ce-kt .\n(c) The data gives 70 = x(0) = 20 + C, so C = 50 and 60 = x(10) = 20 + 50e-10k, so\n-10k = ln(40) -ln(50) or k = (ln(50) -ln(40))/10.\n\n2.\nn\nxn\nyn\nAn = yn\n2 -x2\nn\nhAn = An\n-4.0\n-0.4\n2.1\n-0.4\n0.16 -4.41 = -4.25\n-0.425\n2.2\n-0.825\n3. (a) The nullcline is the pair of crossed\nlines y = ±1. The m = 2 isocline is the up\nper/lower hyperbola; the m = -2 isocline\nis the left/right hyperbola.\n(c) The graphed solution is trapped by\nthe funnel having the nullcline as its lower\nfence and the m = -2 isocline as the up\nper fence, y(100) is very near to -100, but\nslightly larger.\n(d) Extrema occur when y = 0; that is, along the nullcline. y = 2yy -2x, which is -2x\non the nullcline. At x = -1 this is positive, so we have a minimum.\n4. (a) Multiply through by t: d (t2 x) = t3 . Thus t2x = t4/4 + c so x = t2/4 + c/t2 .\ndt\n(b) First solve the complex-valued equation z + 2z = e2it . One way to solve this is to\ntry zp = Ae2it and solving for A: (2i + 2)A = 1, or A =\n= 2-2i = 1-i . The real part\n2+2i\nof 1-i e2it is\n= 1(cos(2t) + sin(2t)).\nxp\n5. (a) -8i = 8e3πi/2 so its cube roots all have modulus equal to the postive number\nwhose cube is 8, namely 2. The arguments are π\n2, π\n2 + 2\nπ = 7\nπ, and π\n2 + 4\nπ = 11\nπ, so the\nπi/2\n7πi/6\n11πi/6\nroots are 2e\n= 2i, 2e\n= -\n√\n3 -i, and 2e\n=\n√\n3 -i.\n(b) The point (a, b) = (-1, -1) has polar coordinates A =\n√\n2 and φ = 5π/4.\n2π\n2π\n(c) P = ω = π/2 = 4.\n(d) t0 = φ/ω = 5\nπ/ π\n2 = 5\n2.\n(e) Amplitude\n√\n2, period 4, trough at 1/2, peak at 5/2.\n6. (a), (b)\n(c) y = 3y2y -y = (3y2 -1) y is zero if\neither y = 0--that is, y = 0 or y = ±1--or\n3y -1 = 0--that is, y = ±1/\n√\n3.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Complex Numbers, Roots of Unity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/de3c1be9517c0adac4aca1d173d918f9_MIT18_03S10_c05.pdf",
      "content": "18.03 Class 5, Feb 15, 2008\n\nComplex Numbers, roots of unity\n\n[1] Complex algebra\n[2] Complex conjugation\n[3] Polar multiplication\n\nComplex numbers provide a tool for expressing aspects of the real world.\nAnything with an amplitude and a phase is secretly a complex number,\nand it is worthwhile bringing that secret identity out in the open.\n\n[1] Complex Algebra\n\nWe think of the real numbers as filling out a line.\nThe complex numbers fill out a plane. The point up one unit\nfrom 0 is written i (but written j by many engineers).\nAddition and multiplication by real numbers is as\nvectors. The new thing is i^2 = -1 . The usual rules of algebra apply.\nFor example FOIL:\n\n(1 + i)(1 + 2i) = 1 + 2i + i - 2 = -1 + 3i.\n\nEvery complex number can be written as a + bi with a and b real.\n\na = Re(a+bi) the real part\nb = Im(a+bi) the imaginary part: NB this is a real number.\n\nMaybe complex numbers seem obscure because you are used to imagining\nnumbers by giving them units: 5 cars, or -3 degrees. Complex numbers do\nnot accept units. Also, there is no ordering on complex numbers, no \"<.\"\n\nQuestion 1. Multiplication by i has the following effect\non a complex number.\n\n1. It rotates the number around the origin by 90 degrees counterclockwise.\n\n2. It rotates the number around the origin by 90 degrees clockwise.\n\n3. It takes a number to the number pointing in the opposite direction\nwith the same distance from the origin.\n\n4. It reflects the number across the imaginary axis.\n\n5. It reflects the number across the real axis.\n\n6. None of the above.\n\nBlank: Don't know.\n\nCompute: i(a + bi) = -b + ai ,\nwhich is rotated by 90 degrees counterclockwise: Ans: 1.\n\n[2] Complex conjugation\n\nNotice the formula\n\n(a+bi)(a-bi) = a^2 - (bi)^2 = a^2 + b^2 (*)\n\n(which is the square of the distance to the origin).\n\nThis lets us divide by a complex number: For example\n\ni/(1+2i) = (i/(1+2i)) ((1-2i)/(1-2i))\n\n= (i+2)/(1+4) = (2+i)/5 .\n\n(*) suggests that we give a special name to the quantity a-bi :\nit is the \"complex conjugate\" of a+bi and is denoted by an overline:\n____\na+bi = a-bi : reflect across the real axis.\n___ _ _ __ _ _ =\nConjugation satisfies w+z = w + z , wz = w.z , z = z\n\nProofs: w = a+bi , z = c+di .\n_ _ ___\nw + z = (a-bi) + (c-di) = (a+c) - (b+d)i = w+z\n_ _\nw.z = (a-bi)(c-di) = (ac-bd) - (ad+bc)i\n\nw.z = (ac-bd) + (ad+bc)i\n\nwhich conjugates to the line above.\n\n_\nQuestion 2: If z = -z , then\n\n1. z is purely imaginary\n\n2. z is real\n\n3. z lies on the unit circle\n\n4. z = 0\n\n5. None of the above\n\nBlank. Don't know\n\nAns: 1.\n\n[3] Polar multiplication\n\nBeing points in the plane, complex numbers have polar descriptions.\nThe distance of z from zero is\n\n| z| = \"absolute value\" = \"modulus\" = \"magnitude\" of z.\n_\n\nThe angle up from the positive real axis is\n\nArg(z) = \"argument\" = \"angle\" of z. As usual, it's only well defined\nup to adding multiples of 2 pi.\n\nFor example Arg(1) = 0 , Arg(i) = pi/2 , Arg(-1) = pi.\n_\n| z|^2 = z z and tan(Arg(z)) = b/a = Im(z)/Re(z) .\n\n- Magnitudes Multiply : |wz| = |w||z| .\n\nproof: It's not pleasant to compute absolute values - they involve square\nroots - but it's easy to compute squares:\n____ __ _ _\n| wz|^2 = (wz)(wz) = wzwz = wwzz = |w|^2|z|^2 = (|w||z|)^2\n\nIt follows that |wz| = |w||z| since both sides are positive.\n\nFor example, the product of complex numbers on the unit circle lies again\non the unit circle. I drew a picture.\n\n- Angles Add: Arg(wz) = Arg(w) + Arg(z)\n\nI'll check this in case w and z are both on the unit circle. Then:\n\n(cos a + i sin a)(cos b + i sin b) =\n\n((cos a)(cos b) - (sin a)(sin b)) + i ((cos a)(sin b) + (sin a)(cos b))\n\n= cos(a+b) + i sin(a+b)\n\nusing the angle addition formulas for cos and sin .\n\nIn fact multiplication of complex numbers contains in it the angle\naddition formulas for sin and cos , and if you understand complex\nnumbers you'll never have to memorize those formulas again.\n\nThis checks with our question about multiplication by i above.\nHere's another question about multiplication:\n\nQuestion 3. (1+i)^4 =\n\n1. - 1\n\n2. 4\n\n3. - 4\n\n4. - sqrt(2)\n\n5. 4 i\n\n6. None of the above\n\nBlank: Don't know\n\nModulus Argument a+bi\n\n(1+i)^0 1 0 1\n\n(1+i)^1 sqrt(2) pi/4 1+i\n\n(1+i)^2 2 pi/2 2i\n\n(1+i)^3 2 sqrt(2) 3pi/4 -2+2i\n\n(1+i)^4 4 pio -4\n\nThese powers of (1+i) spiral away from the origin.\n\nThe powers all lie on a spiral emanating from the origin. Ans: (3) .\nThus 1 + i is a fourth root of -4.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/ac15cc566ae39698e03ae11db0f270c2_MIT18_03S10_c01.pdf",
      "content": "18.03 Class 1, Feb 3, 2010\n\nIntroduction and first methods\n\n[1] Introduction\n[2] What and Why\n[3] Separable equations\n[4] Geometric methods\n\n[1] Welcome to 18.03.\n\nI hope you've picked up an information sheet and syllabus, and a problem set\nwhen you came in. All this is also available on the web.\n\nOn the PSet you will see reference to:\n\nEP = Edwards and Penney, (6th or 5th ed). The very similar to the each other\nand to the 4th. I'll try to be sure to give the numbering from both.\n\nNotes = Notes and Exercises. Available from CopyTech in the basement of\nBuilding 11, though it is also available (in small pieces) through the\ncourse website.\n\nSN = Supplementary Notes. Available in sections through the course website.\n\nThe first PSet is due Friday, Feb 12, at 12:45, in the cubbies at 2-106,\nnext to the UMO.\n\nI also hope you went to recitation on Tuesday, where these yellow booklets\nwere handed out. More are available here. Usually I ask students to manufacture\nthe booklet themselves, but the UMO was kind enough to do that for you\nalready. Yea! We'll use them for a primitive but effective form\nof communication between us. It's private; really I'm the only one who can\nsee the numbers you put up. Today, only one question. More later.\n\nIf you need to change recitation, go to the website and follow the link to\nthe \"grade management system,\" which is on Stellar. The sizes are limited.\n\nThere are two lecture times for this course, 1:00 and 2:00. You can attend\neither lecture, BUT you should register in the hour at which you plan to\ntake the hour exams.\n\nThe information sheet and the website contain lots of other information.\nFor example, my OFFICE HOURS are Wednesdays 3:15 - 5:15 : e.g., this afternoon.\n\nAny questions?\n\nYou should also have picked up the listing of the 10 essential skills at\nyour recitation. Teachers of these courses know the list of skills.\nThey expect you will know how to do these things.\n\nHere's a list of some of the larger courses listing 18.03 as a pre-requisite\nor co-requisite.\n\n2.001 Mechanics and Materials I\n\n2.003 Dynamics and Vibrations\n\n2.005 Thermal-Fluids Engineering\n\n2.016 Hydrodynamics\n\n3.23 Electrical, Optical, and Magnetic Properties of Materials\n\n6.002 Circuits and Electronics\n\n6.021 Quantitative Physiology: Cells and Tissues\n\n8.04 Quantum Physics I\n\n10.301\nFluid Mechanics\n\n12.005\nApplications of Continuum Mechanics to Earth, Atmospheric, and\nPlanetary Sciences\n\n16.01 Unified Engineering\n\n18.100\nAnalysis I\n\n18.330\nIntroduction to Numerical Analysis\n\n20.309 Biological Engineering II\n\n22.05 Neutron Science and Reactor Physics\n\nAltogether 140 courses at MIT list 18.03 as a prerequisite or a co-requisite.\n\n[2] A DIFFERENTIAL EQUATION is a relation between a function and its\nderivatives.\n\nDifferential equations form the language in which the basic laws of\nscience are expressed. The science tells us how the system at hand\nchanges \"from one instant to the next.\" The challenge addressed by the\ntheory of differential equations is to take this short-term\ninformation and obtain information about long-term overall behavior.\nSo the art and practice of differential equations involves the following\nsequence of steps: one \"models\" a system (physical, chemical, biological,\neconomic, or even mathematical) by means of a differential equation;\none then attempts to gain information about solutions of this equation;\nand one then translates this mathematical information back into the\nscientific context.\n\nSolve\nDifferential Equation: _______________\\ Behavior over time\nShort term information /\n\n/\\\n\\ /\n\\ /\n\nModel \\ / Interpret\n\\ /\n\\ /\n\\/\n\nPhysical World\n\nA basic example is given by Newton's law, F = ma. a = acceleration,\nthe second derivative of x = position. Forces don't effect x directly,\nbut only through its derivatives. This is a second order ODE, and we\nwill study second order ODEs extensively later in the course.\n\n[3] In this first Unit we will study ODEs involving only the first derivative:\nfirst order: y' = F(x,y) .\n\nExample 1: y' = 2x Solution by integrating: y = x^2 + c.\n\nNotice that there are many solutions.\nAn expression like this, involving a constant (c here) is called the\nGENERAL SOLUTION. The constant is a \"constant of integration.\"\n\nExample 2: y' = ky. General Solution: y = Ce^{kx} . MEMORIZE THIS\n\n- it's the central example in this course.\n\n(In fact, a good definition of the exponential function e^x is that it is\nthe solution of the differential equation y' = y such that y(0) = 1 .)\n\nQ1: What is the general solution to the ODE dy/dx = 2y+1 ?\n\n1. y = Ce^{2x} - 1\n\n2. y = Ce^{x/2} - 2\n\n3. x = y^2 + y + c\n\n4. y = e^{x/2} + C\n\n5. y = Ce^{2x} - 1\n\n6. y = Ce^{2x} - 1/2\n\n7. y = e^{2x} + c\n\n8. None of the above\n\nBlank: Don't know\n\nThe method: \"separation of variables.\" You studied this in recitation\nyesterday. Recall the method: Put all the x 's on one side and y 's\non the other (if possible):\n\ndy/(2y+1) = dx\n\nIntegrate both sides:\n\n(1/2) ln|2y+1| + c1 = x + c2\n\nAmalgamate the constants and (if possible) solve for y in terms of x :\n\nln|2y+1| = 2x + c , |2y+1| = e^c e^{2x} , 2y+1 = C e^{2x}\n\ny = C e^{2x} - 1/2\n\nSo the answer is: 6\n\nWe can check this!: y' = 2 C e^{2x} = 2(y + 1/2) = 2y+1\n\nIt's a nice feature of differential equations in general: it's easy to\ncheck your answer!\n\nQ1.2. Is y' + xy = x separable?\n\n1. Yes\n\n2. No\n\nBlank: don't know.\n\nWell, y' = x - xy = x(1-y) so dy/(1-y) = x dx : YES.\n\nWe could go on to solve this, but you can do that on your own.\n\nWe will see many other methods of solving various types of equations.\nUnfortunately, most real life equations aren't explicitly solvable,\nand often you don't actually care as much about the explicit solution\nas about the general properties. That's one place where today's topic\nis helpful.\n\n[4] Graphical approach\n\nThe ODE y' = F(x,y) specifies a derivative - that is, a slope - at every\npoint in the plane. This is a DIRECTION FIELD or SLOPE FIELD.\n\nEg y' = 2x : I drew some of the direction field. Notice that the slope\nF(x,y) does not depend on y here: It is invariant under vertical\ntranslation.\n\nA SOLUTION of the differential equation is a function whose graph has the\ngiven slope at every point it goes through. I drew some. The graphs of\nsolutions are INTEGRAL CURVES. They are vertically nested parabolas.\nThe translation invariance of the direction field is reflected in the\nfact that a vertical translate of a solution is another solution.\n\nTo specify a particular solution of an ODE you have to give an INITIAL\nCONDITION: when x takes on a certain value, y takes on a specified\nvalue.\n\nEg y' = y : I drew some of the direction field. Notice that the slope\nF(x,y) does not depend on x here: It is invariant under horizontal\ntranslation.\n\nGraphs of solutions are now horizontal translates of each other.\n\nExample 3: y' = y^2 - x.\n\nThis equation does not admit solutions in elementary functions.\nNevertheless we can say interesting things about its solutions.\n\nTo draw the direction field, find where F(x,y) is constant, say m .\nThis is an ISOCLINE. Eg\n\nm = 0 : x = y^2. I drew in the direction field.\n\nm = 1 : x = y^2 - 1\n\nm = -1 : x = y^2 + 1 .\n\nI invoked the Mathlet Isoclines and showed the example.\n\nI drew some solution curves. We have seen in action the\n\nEXISTENCE AND UNIQUENESS THEOREM FOR ODEs:\ny' = F(x,y) has exactly one solution such that y(a) = b ,\nfor any (a,b) in the region where F is defined.\n(The solution y(x) may only exist for x near to a .)\n\n(You actually have to put some technical conditions on F -- see EP.)\n\nThe E and U theorem says that there is just one integral curve through\neach point:\n\nEVERY POINT LIES ON JUST ONE INTEGRAL CURVE: NO CROSSING ALLOWED.\n\nThe applet makes it look like many solutions coalesce, but this is just\na pixel problem. In reality they are separate, but very close to each other.\n\nMany seem to bunch up along the bottom\nbranch of the parabola. Can we explain this?\n\nI cleared the solutions and drew in just the isoclines m = -1 and m = 0.\nOnce a solution gets between these two parabolas, it can never escape.\nThe poor thing can't cross the m = -1 parabola because it would have\nto have slope greater than -1 when it does; and it can't cross the m = 0\nparabola because it would have to have slope less than zero when it does.\nThis is a FUNNEL.\n\nSo solutions in that region stay in that region: they are trapped\n\nbetween those two parabolas, which are asymptotic as x ---> infinity.\nAll these solutions become very close to the function - sqrt(x)\nfor large x . This is an ideal situation! - we know, approximately,\nbut with increasing accuracy, about the long term behavior of these\nsolutions, and the answer doesn't depend on initial conditions (as long\nas you are in this range). This is \"stability.\" (Of course if the solution\ndoesn't get trapped, it's a different story.)\n\nDirection fields let you visualize the qualitative behavior of solutions\nto differential equations, and this is often what you want to know.\nBut we also want to be able to solve ODEs \"analytically,\" that is,\nusing formulas.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/e3df34d59f3f16db89d2043b7125c7aa_MIT18_03S10_c02.pdf",
      "content": "18.03 Class 2, Feb 3, 2010\n\nNumerical Methods\n\n[1] How do you know the value of e?\n[2] Euler's method\n[3] Sources of error\n[4] Higher order methods\n\n[1] The study of differential equations has three parts:\n\n. Analytic, exact, symbolic methods\n\n. Quantitative methods (direction fields, isoclines ....)\n\n. Numerical methods\n\nEven if we can solve symbolically, the question of computing values\nremains. The number e is the value y(1) of the solution to\ny' = y with y(0) = 1. But how do you find that in fact\ne = 2.718282828459045.... ? The answer is: numerical methods.\n(Euler already computed e to at least 18 decimal places. It is\nnow known to some 200 billion places, but I won't write them all out here.)\n\nAs an example, take the first order ODE\n\ny' = y^2 - x = F(x,y) with initial condition y(0) = -1\n\n-- an Initial Value Problem, IVP.\n\nFor example: what is y(1) ?\n\nI invoked the Euler's Method Mathlet, and selected F(x,y) = y^2 - x .\nThe slope field appears. I selected the initial condition (0,-1) ,\nand then invoked \"actual.\"\n\nThis solution is one of those trapped in the funnel,\nso for large x , the graph of y(x) is close to the graph of\n- \\sqrt(x) : y(100) is very close to -10 .\n\nBut what about y(1) ?\n\nThe listing says y(1) = -.83 . How did the computer know this?\n\n[2] The tangent line approximation gives one approach.\n\nRecall: We have a function y(x), and a point (a,y0) on its graph\n(so y(a) = y0 ). The tangent line to the graph at this point has slope\ny'(a), which I will denote m_0 . The tangent line approximation is\n\ny(a+h) ~ y0 + m0 h\n\nThe right hand side is the y-coordinate of a point on the tangent line\ndirectly above or below (a+h , y(a+h)).\n\nIn our case, we do know the derivative of y at x = 0 :\n\ny'(0) = F(0,-1) = (-1)^2 + 0 = 1\n\nSo the tangent line at (0,-1) has slope 1 , and we find the tangent line\napproximation y(1) ~ -1 + 1 = 0. I showed this on the applet.\n\nOf course this is a really bad appromation, because we took such a big hop.\nThe tangent line approximation works much better if h is small.\n\nThe idea then is to take a *small* hop, and then use the direction field\nat the end point of that line segment to decide where to go next.\nKeep it up till you get where you want to go.\n\nLet's set this up more generally. You have an initial value problem\n\ny' = F(x,y) , y(a) = y0 .\n\nYou want to estimate y(b) where b > a . Divide the interval from\na to b into small hops each of width h . Give names to the hash marks:\n\nx0 = a , x1 = a+h , ... , xk = a+kh , ... b\n\nThen we build a polygon starting at (x0,y0). The first segment\nends at (x1,y1) where y1 = y0 + m0 h , m_0 = F(x0,y0) .\nThe second ends at (x2,y2) where y2 = y1 + m1 h , m1 = F(x1,y1) .\nAnd so on.\n\nI call the line segments \"Euler struts\" and the whole thing the\nEuler polygon. It's supposed to be an approximation to the graph of y.\n\nNotes: (1) x_1, ... and y1, ... depend on h .\n(2) y0 = y(x0) , but y1 is not y(x1); it is only an approxiation to it.\n\nLet's do this for our example, with h = 1/2 : so two steps.\n\nKeep this calculation organized in a table.\n\nh = .5\n\nk\n\nxk\n\nyk\n\nmk = yk^2 - xk\nmk h\n__________________________________________________________________________\n\n-1\n\n.5\n\n.5\n\n-.5\n\n-.25\n-.125\n\n1.0\n\n-.625\n\nI checked this on the applet and then showed some more Euler polygons for this\nequation.\n\nh = 1\nestimate of y(1) is 0.00\nh = .5\n-.62\n\nh = .25 -.75\n\nh = .125 -.80\n\"actual\" -.83\n\n[3] Euler's method is rarely exact. Let's identify some sources for error.\nMuch of numerical analysis is understanding and bounding potential error.\n\n(1) Round off accumulation. Each computation involves a small error,\nfrom round off, and these errors accumulate. So you want to use the fewest\nnumber of steps possible. On the other hand making the stepsize small\nkeeps the polygonal approximation close to the actual solution. There is\na tension here.\n\nUsually more important than this is:\n\n(2) The Euler polygon is not an exact solution, and the direction field\nat its vertices differs more and more from the direction field under the\nactual solution. At places where the direction field is changing rapidly,\nthis produces very bad approximations quickly.\n\nThe variation of the direction field causes the integral curves to bend\naway from the Euler strut.\n\nCan we predict whether the Euler approximation is too big or too small?\nIn this example they are too big. This is because the solution if curving\ndown and leaving the polygons above it.\n\nHow would we know without a picture whether the solution is\n\nconvex = bending up or\nconcave = bending down ?\n\nWell there's y\"(0) > 0 convex at (0,-1)\ny\"(0) < 0 concave at (0,-1)\n\nHow to find y\" ? well, y' = y^2 - x\ny\" = 2yy' - 1\n\nso y\"(0) = 2(-1)(1) - 1 = -3 : concave : as we see in the picture.\n\nIf y\"(x_0) < 0 , Euler's estimate is too high\nif y\"(x_0) > 0 , Euler's estimate is too low.\n\n[4] Theory shows that for small h , the error in Euler's method is\nat most C1 h for some constant C1 . It is a \"first order method\"\n(no relation with \"first order equation.\") Of course if you knew in\nadvance exactly what the error was, you'd be rich and famous.\n\nMaking h smaller is one way to decrease the error caused by the\nvariability of the direction field. But there are more clever ways which\nturn out to be even better.\n\nHere is one: RK2 = improved Euler = Heun:\nPoll the slope field at the end of the Euler strut and use the average.\n\nQ2.1 What is the first slope for the RK2 polygon for y' = y^2 - x\nwith h = 1/2 and initial condition y(0) = -1 ?\n\n1. 1\n2. 1/2\n3. -1/4\n4. 3/8\n5. 5/8\n6. Don't know\n\nThe needed data is present in the h = 1/2 Euler table:\nF(0,-1) = 1. The end of this Euler strut is (1/2,-1/2).\nF(1/2,-1/2) = -1/4 . The average is 3/8 : [4] is correct.\n\n[Almost everyone offering an answer got this right.]\n\nThis brings us down closer to the actual solution curve.\n\nRK2 is *second order*: for small h the error is at most C2 h^2 for\nsome constant C2 .\n\nEach evaluation of the direction field costs money - it takes time.\nEuler polls once per step, RK2 polls twice per step.\n\nSo if we want to compare efficiencies, we should compare Euler with h\nand RK2 with 2h . The error with Euler is around C1 h .\nThe error with RK2 is around C2 (2h)^2 = 4C2 h^2 . If h is small enough,\nthe the RK2 error will definitely be smaller than the Euler error,\neven if C2 is larger than C1. In fact, C2 tends to be smaller than C1,\nso RK2 wins for two reasons.\n\nThere is an RK4 method too, which polls the direction field 4 times before\ndeciding which way to head out. It's a \"fourth order method,\" and its error\nis approximately C4 h^4. To make a comparison with Euler(h) you should use\nRK4(4h), but again C4 (4h)^4 = 64 C4 h^4 will be less than 4C2 h^2\nor C1 h for h small enough; and in fact C4 itself is usually smaller\nthan C2 and C1.\n\nHere's some data using the ODE y' = y, y(0) = 1; the solution is\ny = e^x, and we study y(1) = e. Number of evaluations of the\ndirection field = 1000.\n\nMethod\n\nStepsize\nError\n\nRK1 = Euler .001\n\n1.3 x 10^{-3}\n\nRK2 = Heun .002\n\n1.8 x 10^{-6}\n\nRK4\n\n.004\n\n8.0 x 10^{-15}\n\nFrom this you can conclude that the constants (for this particular IVP)\nare about\n\nC1 ~ 1.3 C2 ~ 0.45 C4 ~ .00012\n\nThe moral is that for good accuracy Euler is essentially useless,\nand RK4 will always win. There are still higher order methods,\nbut they involve more overhead as well and experience has shown\nthat RK4 is a good compromise.\n\nFurther note: The initial value problem y' = f(x) , y(a) = y0 has solution\n\ny(x) = y0 + int_a^x f(t) dt\n\nWhen you apply these methods to approximate y(x),\n\nEuler's method is the left end-point Riemann sum\nRK2 is the trapezoidal rule\nRK4 is Simpson's rule.\n\nHere's an example of how bad the errors can get: Catastrophic overshoot.\n\nI selected Euler 1.00 again and followed the Euler polygon. The very fact\nthat the slope field is funnelling causes catastrophic overshoot.\n\nODE solvers are tricky and avoid things like this. One trick:\nwhen the direction field is steep, use smaller stepsizes.\n\nPlease complete and hand in the Muddy Cards!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/17828cb4e899b98aa351a2d6d6f8da2e_MIT18_03S10_c03.pdf",
      "content": "18.03 Class 3, Feb 8, 2010\n\nFirst order linear equations; systems and signals perspective\n\n[1] First order linear ODEs\n[2] Bank Accounts; rate and cumulative total\n[3] Systems and signals language\n[4] RC circuits\n\n[1] If I had to name the most important general class of differential\nequations it would be \"linear equations.\" They will occupy most of this course.\nToday I'll show you how to model two real world systems by first order linear\nequations. Both of them involve systems evolving in time. The independent\nvariable is time, t . If we write x or x(t) for the dependent variable,\nwe'll write x-dot for its time-derivative. In these ascii notes I'll\ncontinue to write x' the deriviative, though.\n\nDefinition: A \"linear first order ODE\" is one that can be put in the\n\"standard form\"\n\n_____________________________________\n| |\n| r(t) x'(t) + p(t) x(t) = q(t) |\n|_____________________________________|\n\nThere is a general analytic method for solving this equation. I'll talk\non Wednesday about that. For now note that if p, q, and r are *constant*\nthen the equation is separable --\n\nr dx / ( q - px ) = dt\n\nExample 0: From recitation: Oryxes with constant growth rate, hunting allowed\n\nx' = kx - h h = harvest rate\n\nas in Recitation 1. Notice that in the physical system both k and h\ncan vary with time, and that the modeling process is fine with that.\n\nThe slide shows an Oryx.\n\n[2] Bank account: I have a bank account. It has x dollars in it.\nx is a function of time. I can deposit money in the account and make\nwithdrawals from it. The bank pays me rent for the money I deposit!\nThis is called interest.\n\nIn the old days a bank would pay interest at the end of the month on\nthe balance at the beginning of the month. We can model this\nmathematically:\n\nWith Delta t = 1/12 , the statement at the end of the month will read:\n\nx( t + Delta t ) = x(t) + I x(t) Delta t\n+ [deposits - withdrawals between t and t+Delta t]\n\nI has units (year)^{-1} . These days I is typically very small, say\n1% = 0.01 . You don't get 1% each month! you get 1/12 of that.\n\nYou can think of a withdrawal as a negative deposit, so I will call everything\na deposit.\n\nNowadays interest is usually computed daily. This is a step on the path\nto the enlightenment afforded by calculus, in which Delta t ---> 0 .\n\nIn order to reach enlightenment, I want to record deposits minus withdrawals\nas a *rate*, in dollars per year. Suppose I contribute $100 sometime every\nmonth, and make no withdrawals. So my total deposits up to time t - my\n\"cumulative total\" deposit - has a graph like this\n\nQ\n| ____|\n| ___|\n| __|\n|__|__________________________\n| | | | | | | t\n\nIn keeping with letting Delta t ---> 0 , we should imagine that I am making\nthis contribution continually, at the constant rate of $1200/year: graph like\nthis\n\nQ\n| .\n| .\n| .\n|_____________________________\n| | | | t\n\n-- a straight line with slope 1/1200 : Q'(t) = q(t) is constant.\n\nIn general, say I deposit at the rate of q(t) dollars per year.\nq(t) might vary over time, and might be negative too, from time to time,\nbecause withdrawals are merely negative deposits.\n\nQ3.1. At the indicated point of the graph of Q(t) am I making\n\n(1) deposits\n(2) withdrawals\n\n|\n| __\n| / \\ /\n| / \\ /\n_____|/______\\______/_________________________________\n| \\ /<---- here\n\\__/\n\nAnswer: when the slope is positive, not necessarily when Q is positive: (1).\n\nSo (assuming q(t) is continuous)\n\nx ( t + Delta t ) ~ x(t) + I x(t) Delta t + q(t) Delta t\n\nNow subtract x(t) and divide by Delta t :\n\nx ( t + Delta t ) - x(t)\n------------------------ ~ I x + q\nDelta t\n\nNow is the moment to let the interest period Delta t tend to zero:\n\nx' = I x + q\n\nNote: q(t) can certainly vary in time. The interest rate can too.\nIn fact the interest rate might depend upon x as well: a larger\naccount will probably earn a better interest rate. Neither feature\naffects the derivation of this equation, but if I does depend upon\nx as well as t , then the equation we are looking at is no longer linear.\nSo let's say I = I(t) , q = q(t) .\n\nWe can put the ODE into standard form:\n\nx' - I x = q\n\nEach symbol represents a function of t .\n\n[3] Systems and signals language\n\nIn the standard form, the left hand side represents the SYSTEM: the bank.\n\nThe right hand side represents an outside influence on the system:\nit's a SIGNAL, the \"input signal.\" A \"signal\" is just a function of time.\nHere it is my rate of savings.\n\nThe system responds to the input signal and yields the function x(t),\nthe \"output signal\" or SYSTEM RESPONSE. Here's a picture:\n\ninitial condition\n|\n|\n|\nV\n______________\n| |\n--------------> | System | -------------->\n|______________|\n\ninput output\n\nFor example,\n\nx(0)\n|\n|\n|\nV\n______________\n| |\n--------------> | Bank | -------------->\nq(0) |______________| x(t)\n\nWe will develop a theory of linear equations, complete with an algorithm\nfor solving them. It's important to recognize them when you see them.\n\nQuestion 3.2. Which of the following are linear ODE's?\n(a) $\\dot x+x^2=t$\n(b) $\\dot x=(t^2+1)(x-1)$\n(c) $\\dot x+x=t^2$\n\n1. None\n2. (a) only\n3. (b) only\n4. (c) only\n5. All\n6. All but (a)\n7. All but (b)\n8. All but (c)\nBlank. Don't know.\n\nAnswer: (b) and (c) are linear, (a) is not: 6\n\n[4] RC circuits. Suppose we have an electrical circuit like this:\n\n_ _ ||\n______ / \\______/\\/\\/\\/\\__________||__________\n| \\___/ || |\n| power source resistor capacitor |\n| |\n|________________________________________________|\n\nIt has a resistor, a capacitor, and a voltage source: it's an RC circuit.\nThis is not a course in electromagnetism or in circuits, but I will use\nwords from that subject. Let's pretend we understand what they mean!\n\nCurrent flows around the circuit. (Confusingly, if the current flows to\nthe right, the actual electrons flow to the left, because they are negatively\ncharged. It's confusing. Sorry, I didn't invent this.) The current is measured\nin \"amperes\" and is denoted by I . (I don't know what language has a word\nfor current starts with an I!) In this \"series\" circuit, the current is the\n\nsame everywhere but it may vary with time.\n\nLet's say the positive direction in the circuit is clockwise (ie to the\nright over the top, for digital clock users). So if current is flowing\ncounterclockwise along the wire, an ammeter would give a negative reading.\n\nThe system is powered by a variable power source, which creates a \"voltage\nincrease\" across it. This what makes current move. Write V(t) for\nthe voltage INCREASE from the bottom to the top of the source. Write\nV_R and V_C for the voltage DROPs across resistor and capacitor.\n\n\"Kirchhoff's voltage law\" states that\n\nV(t) = V_R(t) + V_C(t)\n\nI drew a little graph like this:\n\n_____________\n| |\n| |_____________\n| |\n-------- -----------\n\n_ _ ||\n______ / \\______/\\/\\/\\/\\__________||__________\n| \\___/ || |\n| |\n|________________________________________________|\n\nto illustrate the KVL.\n\nThere is a relationship between the voltage drop across each circuit\nelement and the current flowing through it. The relationship is different\nfor resistors and capacitors:\n\nResistor: V_R(t) = R I(t) for a constant R, the \"resistance\"\n\nCapacitor: V'_C(t) = (1/C) I(t) for a constant C, the \"capacitance\"\n\nSo:\n\n- The voltage drop across the resistor is proportional to the current\nflowing through it. High resistance means big voltage drop.\n\n- The voltage drop across the capacitor is proportional to the *integral*\nof the current; it results from a buildup of charge on the two plates of\nthe capacitor. High capacitance means lots of space for the charge.\nA very large capacitor is like no capacitor at all.\n\nTo relate these, differentiate KVL:\n\nV'(t) = V'_R(t) + V'_C(t) = R I'(t) + (1/C) I(t)\n\nThis is a first order linear differential equation for I(t) :\nIn standard form:\n\nR I'(t) + (1/C) I(t) = V'(t)\n\nThe circuit is the system and it is represented by the left hand side.\nThe input signal is V , the voltage increase across the power source.\n\nI(0)\n|\n|\n|\nV\n______________\n| |\n--------------> | Circuit | -------------->\nV(t) |______________| I(t)\n\nThe *derivative* of the input signal is what occurs on the right of the\nequation.\n\nThe system response is the current.\n\nThe system is the circuit.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/17138787c3f8592b01dbdc312765cc7a_MIT18_03S10_c04.pdf",
      "content": "18.03 Class 4, Feb 10, 2010\n\nFirst order linear equations: integrating factors\n\n[1] First order homogeneous linear equations\n[2] Newtonian cooling\n[3] Integrating factor (IF)\n[4] Particular solution, transient, initial condition\n[5] General formula for IF\n\nDefinition: A \"linear ODE\" is one that can be put in the \"standard form\"\n\n_______________________________\n| |\n| r(t)x' + p(t)x = q(t) | x = x(t)\n|_______________________________|\n\nr(t), p(t) are the \"coefficients\" [I may have called q(t) also a coefficient\nalso on Monday; this is not correct, fix it if I did.]\n\nThe left hand side represents the \"system,\" and the right hand side\narises from an \"input signal.\" A solution x(t) is a \"system response\"\nor \"output signal.\"\n\nWe can always divide through by r(t), to get an equation of the\nReduced standard form:\n\n_______________________________\n| |\n| x' + p(t)x = q(t) | x = x(t) (*)\n|_______________________________|\n\nThe equation is \"homogEneous\" if q is the \"null signal,\" q(t) = 0 .\nThis corresponds to letting the system evolve in isolation:\nIn the bank example, no deposits and no withdrawals.\nIn the RC example, the power source is not providing any voltage increase.\n\nThe homogeneous linear equation\n\nx' + p(t) x = 0\n\n(*)_h\n\nis separable. Here's the solution,\nin general on the left, with an example (with p(t) = 2t ) on the right:\n\nx' + p(t)x = 0 x' + 2tx = 0\n\nSeparate: dx/x = - p(t) dt dx/x = - 2t dt\n\nIntegrate: ln|x| = - int p(t) dt + c ln|x| = - t^2 + c\n\nExponentiate: |x| = e^c e^{ - int p(t) dt } |x| = e^c e^{-t^2}\n\nEliminate the absolute value and reintroduce the lost solution:\n\nx = C e^{- int p(t) dt} x = C e^{-t^2}\n\nIn the example, we chose a particular anti-derivative of k , namely kt.\nThat is what I really have in mind to do in general. The constant of\nintegration is taken care of by the constant C .\n\nSo the general solution to (*)_h has the form C x_h , where x_h is\n*any* nonzero solution:\n\nx_h = e^{- int p(t) dt} , x = C x_h\n\nWe will see that the general case can be solved by an algebraic\ntrick that produces a sequence of two integrations.\n\n[2] Example: Diffusion, e.g. of heat.\n\nAbout this time of year I start to think about summer. I put my rootbeer\nin a cooler but it still gets warm. Let's model its temperature by an ODE.\n\nx(t) = root beer temperature at time t .\n\nThe greater the temperature difference between inside and outside, the\nfaster x(t) changes.\n\nSimplest (\"linear\") model of this:\n\nx'(t) = k ( T_ext(t) - x(t) )\n\nwhere T_ext(t) is the \"external\" temperature. Sanity check: When\nT_ext(t) > T(t), x'(t) > 0 (assuming k > 0 ). We get a linear equation:\n\nx' - k x = k T_ext\n\nThis is \"Newton's law of cooling.\" k could depend upon t and we would\nstill have a linear equation, but let's suppose that we are not watching\nthe process for so long that the insulation of the cooler starts to break\ndown!\n\nSystems and signals analysis:\nThe system is the cooler.\nThe output signal = system response is x(t) , the temperature in the cooler.\nThe input signal is the external temperature T_ext(t) .\n\nNote that the right-hand side is k times the input signal, not the input\nsignal itself.\n\nWhat constitutes the input and output signals is a matter of the\ninterpretation of the equation, not of the equation itself.\n\nQuestion 4.1: k large means\n1. good insulation\n2. bad insulation\nBlank. don't know.\n\nk is small when the insulation is good, large when it is bad.\nIt's zero when the insulation is perfect. k is a COUPLING CONSTANT\nWhen it is zero, the temperature inside the cooler is decoupled from\nthe temperature outside. In the construction industry, a number like\nk is pasted on windows; it's called the U-value of the window.\n\nLet's take k = 1/3 , for example.\n\nSuppose the temperature outside is rising at a constant rate: say\n\nT_ext = 60 + 6t (in hours after 10:00)\n\nand we need an initial condition: let's say x(0) = 32 .\n\nSo the IVP is x' + (1/3) x = 20 + 2t , x(0) = 32 . (cooler)\n\nThis isn't separable: it's something new. We'll describe a method which\nworks for ANY first order linear ODE.\n\n[3] Method: Integrating factors (Euler)\n\nThis method is based on the product rule for differentiation:\n\n(d/dt) ( u x ) = ux' + u'x\n\nFor example, suppose we have the equation\n\nt x' + 2 x = t\n\n(This is not separable; it is linear and in standard form, but not reduced\nstandard form.) Here's a *trick*. Multiply both sides by t :\n\nt^2 x' + 2t x = t^2\n\nThe left hand side is now the derivative of a product:\n\n(d/dt) (t^2 x) = t^2\n\nWe can solve this by integrating:\n\nt^2 x = t^3/3 + c\n\nso x = t/3 + c t^{-2}\n\n[In the first lecture, I posed this (with a different righthand side)\nas a flashcard problem, but I did it just after describing the calculation\nof an integrating factor for a *reduced* equation. The reduced equation is\nx' + 2x/t = 1 , and this has integrating factor t^2 . So it was a poorly\nplaced question.]\n\nThat was great! The factor t we multiplied by is an \"integrating factor.\"\nI guessed it here. Often you can. The factor to use in the cooler equation\nand other equations may not be so obvious. Here's a calculation, for a linear\nequation in reduced form,\n\nx' + p(t)x = q(t)\n\nMultiply both sides by u\n\nu x' + p u x = u q\n\nIn order for the right hand side to be (d/dt)(ux) = ux' + u'x,\nthe function u must satisfy the differential equation\n\nu' = p u\n\nThis is separable, and we'll carry out the separation in general in a minute.\nIn the cooler equation, the coefficient p(t) is constant.\nIn that case we have the natural growth equation!\n\nu = e^{pt}\n\n(I am choosing a value for the constant of integration, because I need just\none integrating factor, any one.)\n\nIn the case of the cooler problem, p = 1/3 , so we have:\n\n(d/dt) (e^{t/3} x) = (20 + 2t) e^{t/3}\n\nIntegrate:\n\ne^{t/3} x = 60 e^{t/3} + \\int 2t e^{t/3} dt\n\nUm. Parts: \\int u dv = uv - \\int v du\n\nu = 2t , dv = e^{t/3} dt\ndu = 2dt , v = 3 e^{t/3}\n\ne^{t/3} x = 60 e^{t/3} + 6 t e^{t/3} - 18 e^{t/3} + c\n\n= ( 42 + 6 t ) e^{t/3} + c\n\nSolve for x:\n\nx = ( 42 + 6t ) + c e^{-t/3}\n\nThat's the general solution. Remember, you can check it easily.\n\nu is an \"integrating factor.\"\n\n[4] We still should finish the IVP process:\n\n32 = x(0) = 42 + c so c = -10 :\n\nx = 42 + 6t - 10 e^{-t/3}\n\nWe just want one u , not the general u : so the exponent could be any\nantiderivative of p . In the example, p = 1/3 was constant and we took\nu = e^{t/3} .\n\nNote the structure of the genearal solution:\n\nx = x_p + c u^{-1} where\n\n. x_p is a solution, *any solution*. It's called a PARTICULAR SOLUTION\nbut this is a very poor name, because there is nothing particular about it.\nI this case we chose one with a pretty simple formula -- x_p = 42 + 6t .)\n\n. u is an integrating factor.\n\nVery often x_h approaches zero with time, as this one does. It is then\ncalled a TRANSIENT. All solutions come to look more and more alike as\ntime goes on. This is a funnel!\n\nI graphed the solutions 42 + 6t and x , and some others along with T_ext .\nIf the temperature in the cooler is more than 60 degrees at the start,\nthen it declines at first, crosses the nullcline x = 60 + 6t where it\nis momentarily in equilibrium with the outside, and then rises to become\nasymptotic to 42 + 6t like every other solution.\n\n[5] Let's compute an integrating factor for the general first order linear\nequation (*) : we are to solve u' = up .\n\nThis is a separable equation: du/u = p dt\n\nln|u| = int p dt\n\nThe constant of integration is in the indefinite integral.\n\n|u| = e^{int p dt}\n\nNow there is a choice of sign. Pick one and go with it; say\n\nu = e^{int p dt}\n\nThat gives you an integrating factor. Any nonzero multiple serves as well.\n\nNote that this is the reciprocal of a solution to the homogeneous equation:\n\nu = xh^{-1}\n\nThis gets fed into the solution for x :\n\nx = u^{-1} int u q dt\n\nand the constant of integration in the integral lets us write\n\nx = x_p + c x_h\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/863ef679a1924d20a267d6dec8251250_MIT18_03S10_c06.pdf",
      "content": "18.03 Class 6, Feb 16, 2010\n\nComplex exponential\n\n[1] Complex roots\n[2] Complex exponential, Euler's formula\n[3] Euler's formula continued\n\n[1] More practice with complex numbers:\n\nMagnitudes Multiply: |zw| = |z||w|\nArguments Add: Arg(zw) = Arg(z) + Arg(w)\n\nso: |z^n| = |z|^n and Arg(z^n) = n Arg(z)\n\nFor example:\n\nLet's take some powers of z = 1+i .\n|z| = sqrt 2 Arg(z) = pi/4\n|z^2| = 2 Arg(z^2) = pi/2\n|z^3| = 2 sqrt 2 Arg(z^3) = 3pi/4\n|z^4| = 4 Arg(z^4) = pi\n\nNotice that these numbers march out along a spiral. This continues\nfor all powers of 1+i , even negative ones.\n\nHow about fractional powers? i.e. roots: of unity, first.\n\nWhat are the cube roots of 1? Well 1 is one. If z is one, then\n|z|^3 = |z^3| = 1 , so it lies on the unit circle.\n\nThe argument has to be so that 3 times it is zero - or 2pi, or 4pi, or ....\nThus the argument is\n0 , giving 1 , or\n2pi/3 , giving (-1+sqrt(3)i)/2 or\n4pi/3 , giving (-1-sqrt(3)i)/2 .\n\nThe nth roots of unity divide the unit circle into n equal pieces.\n\nHow about cube roots of -8 . If z^3 = -8 , then |z|^3 = |z^3| = 8 .\n|z| is a positive real number so |z| = 2 : all cube roots of -8\nlie on the circle with center 0 and radius 2.\n\nThe argument of -8 is pi , giving a cube root with argument pi/3\nor 3pi giving a cube root with argument pi\nor 5pi giving a cube root with argument 5pi/3\n\nThese again divide the circle evenly. The second is -2, and the others are\n1+sqrt(3)i and 1-sqrt(3)i .\n\nI gave a little demo with the Complex Roots applet.\n\nWe have been studying roots of equations like z^n - a = 0 .\n\nA \"polynomial\" is a function of the form\n\nf(z) = an z^n + a{n-1} z^{n-1} + ... + a1 z + a0 , an not 0\n\nThe \"degree\" is the top nonzero coefficient ak .\n\nFundamental theorem of algebra (Gauss,...): Any polynomial of degree > 0\nhas a complex root.\n\nIn fact any polynomial factors as\n\nf(z) = an (z - r1) (z - r2) ... (z - rn)\n\nIt has n complex roots (some of which may coincide).\n\n[2] Complex exponential\n\nThe complex valued function z(t) = a(t) + i b(t) parametrizes a directed\ncurve in the plane. For example\n\nz = t + i parametrizes a line running horizontally through i , directed\ntowards the right.\n\nThe derivative is computed for each component, and gives you the velocity\nvector. Here this is 1 : horizontal.\n\nHere's an ODE we can try to solve: z' = iz , z(0) = 1. (**)\n\nIn lecture 1 we saw that e^{kt} is the solution to x' = kx, x(0) = 1.\nSo we will write the solution to (**) as z = e^{it} .\n\nOn the other hand we found out that multiplication by i is rotation by\n90 degrees; so the solution is a curve such that the velocity vector is\nalways perpendicular to the radius vector. This is a circle, and if we\nadd the initial condition it is the unit circle, traversed counterclockwise\nwith speed 1:\n\nz = cos t + i sin t\n\nTo check, compute\n\nz' = - sin t + i cos t\n\niz = i cos t - sin t\n\nand they agree. Thus:\n\ne^{it} = cos t + i sin t.\n\"Euler's formula.\"\n\nThis function parametrizes the unit circle, directed counterclockwise.\nThis is the *definition* of e^{it} .\n\nIn fact, for any complex number a+bi you can compute that the solution\nto z' = (a+bi)z , z(0) = 1 , is\n\ne^{(a+bi)t} = e^{at} (cos(bt) + i sin(bt))\n\nThat is, the magnitude of e^{(a+bi)t} is e^{at}\nand the argument of e^{(a+bi)t} is bt\n\nWhen a > 0 and b > 0 , we have a spiral moving counterclockwise away\nfrom the origin.\n\nQ6.1 The curve in the complex plane traced out by e^{(1+2\\pi i)t}\nmost closely resembles which of the following?\n\n(1) A straight ray along the positive real axis\n(2) A circle of radius e and center at the origin.\n(3) A circle of radius 1 and center at the origin.\n(4) A spiral moving inwards and counterclockwise\n(5) A spiral moving outwards and counterclockwise\n(6) A spiral moving inwards and clockwise\n(7) A spiral moving outwards and clockwise\n\n(Blank) Don't know.\n\nAns: (5) .\n\n[3] This definition (*) satisfies the expected exponential rule:\n\ne^{(z+w)t} = e^{wt} e^{zt}\n\nYou can see this using the usual rule for real exponentials together\nwith the angle addition formulas, or by using the uniqueness theorem\nfor solutions to ODEs. See the Supplementary Notes.\n\nGeneral fact about complex numbers:\n_ _\nz + z z - z\n----- = Re(z) ----- = Im(z)\n2 2 i\n\nProof by diagram.\n______\nApply this to z = e^{it}. I will need to know what e^{it} is.\nSince complex conjugation preserves modulus and reverses angle,\n______\ne^{it} = e^{-it} .\n\nFrom Euler's formula (**) and the \"general fact\" we find\n\ne^{it} + e^{-it} e^{it} - e^{-it}\ncos(t) = ---------------- sin(t) = ----------------\n2 2 i\n\nSometimes these are also called Euler's Formulas.\n\nAnything you want to know about sines and cosines can be obtained from\nproperties of the (complex) exponential function.\n\nNeat examples: e^{pi i} = -1\ne^{2k pi i} = 1 for any whole number k\ne^{pi i / 2} = i\ne^{(k/n)2 pi i} = nth roots of unity.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/79c78a34f2f1b8b0470b6426de9c34f0_MIT18_03S10_c07.pdf",
      "content": "18.03 Class 7, Feb 17, 2010\n\nExponential and Sinusoidal input and output\n\n[1] Sinusoidal functions\n[2] Trig sum formula\n[3] Integration of complex valued functions\n[4] Linear equations with sinusoidal input signal\n[5] Complex replacement\n\nEuler: Re e^{(a+bi)t} = e^{at} cos(bt)\nIm e^{(a+bi)t} = e^{at} sin(bt)\n\n[1] Sinusoids\n\nA \"sinusoidal function\" f(t) is one whose graph is a (co)sine wave.\n\nI drew a large general sinusoidal function, f(t) .\n\nI drew the graph of cos(theta) ; this is our model example of a sinusoid.\n\nA sinusoidal function is entirely determined by just three measurements,\nor parameters, which determine it in terms of cos(theta) .\n\nA = Amplitude = height of its maxima = depth of its minima\n\nP = Period = elapsed time till it repeats\n(or, in spatial terms, lambda = wavelength = the distance between repeats)\n\nt_0 = Time lag = time of first maximum\n\nf(t) can be written in terms of cosine. Clearly, f(t) = A cos(theta).\nTo work out how, express theta as a function of t . I started drew\na t-axis horizontally and a theta-axis vertically.\nWhen t = t_0 , theta = 0 . When t = t_0 + P , theta = 2pi .\nI marked these data points on all three graphs.\n\nThe graph of theta as a function of t is a straight line; otherwise\nthe cosine would get distorted, bunched up. So:\n\ntheta = (2pi/P) ( t - t_0 )\n\nand so f(t) = A cos( (2pi/P) ( t - t_0 ))\n\nThe frequency is nu = 1/P , measured in \"cycles/unit time.\" More useful is:\nthe circular frequency omega = 2pi/P = omega , measured in radians/unit time.\n\nSo theta = omega ( t - t_0 )\n\nThe \"phase lag\" is\n\nphi = omega t_0 = (2 pi/P) t_0 .\n\nIt measures the radian measure corresponding to t = 0 .\nIn terms of omega and phi ,\n\nf(t) = A cos(omega t - phi)\n\nFor example,\n\nsin(omega t) = cos(omega t - pi/2) .\n\n-- the sine lags one quarter cycle behind the cosine.\n\nQuestion 7.1. A graph of a sinusoidal function is displayed.\nThe problem is to express it in the \"standard form\" above.\n\n1. 2 cos(4pi t + pi/4)\n2. 2 cos((pi/4)t + pi/4)\n3. 2 cos(4pi t - pi/4)\n4. 2 cos((pi/4)t - pi/4)\n5. 2 cos(4t+1)\n6. 2 cos(4t-1)\n\nP = 8, t_0 = -1 , A = 2 :\n\nf(t) = 2 cos( (2pi/8) ( t + 1 )) = 2 cos( (pi/4) t + pi/4 )\n\nomega = pi/4 , phi = - pi/4 .\n\nAns: 2.\n\n[2] Trig sum: a cos(omega t) + b sin(omega t)\n\nI showed the Trig Id applet. This sum seems always to be another sinusoidal\nfunction! How can we find its \"standard form\" A cos(omega t - phi) ?\n\nRecall the cosine difference identity:\n\ncos(theta - phi) = cos(phi) cos(theta) + sin(phi) sin(theta)\n\ncos(omega t - phi) = cos(phi) cos(omega t) + sin(phi) sin(omega t)\n\nNow construct a right triangle with hypotenuse the segment in the plane\njoining (0,0) to (a,b) . If A is the hypotenuse and phi the angle\nat the origin, then\n\nA = sqrt(a^2 + b^2)\na = A cos(phi)\nb = A sin(phi)\n\nand\n\nA cos(omega t - phi) = a cos(omega t) + b sin(omega t)\n\nQuestion 7.2. What are the amplitude, circular frequency, and phase lag:\nA , omega , and phi in A cos(omega t - phi) , for the sinusoid\n\ncos(omega t) + sqrt(3) sin(omega t)\n\n1. 2 cos(\\omega t-\\frac{\\pi}{4})\n2. sqrt(3) cos(omega (t - pi/3))\n3. 2 cos(omega(t- pi/3))\n4. 2 cos(omega t - pi/3)\n5. sqrt(3) cos(omega t - pi/3)\n6. sqrt(3) cos(omega t - pi/4)\nBlank. Don't know.\n\nAns: A = 2, phi = pi/3 : 4.\n\n[3] Integration\n\nRemember how to integrate e^{2t} cos(t) ?\n\nUse parts twice. Or:\n\nDifferentiating a complex valued function is done separately on the real and\nimaginary parts. Same for integrating.\n\ne^{2t} cos(t) = Re e^{(2+i)t} so\n\nint e^{2t} cos(t) dt = Re int e^{(2+i)t} dt\n\nand we can integrate exponentials because we know how to differentiate\nthem! -\n\nint e^{(2+i)t} dt = (1/(2+i)) e^{(2+i)t} + c\n\nWe need the real part.\n\nExpand everything out: 1/(2+i) = (2-i)/5\n\ne^{(2+i)t} = e^{2t} (cos(t) + i sin(t))\n\nso the real part of the product is\n\n(1/5) e^{2t} (2 cos(t) + sin(t)) + c\n\nMore direct than the high school method!\n\n[4] Linear constant coefficient ODEs with exponential input signal\n\nLet's try x' + 2x = 4 e^{3t}\n\nWe could use our integrating factor, but instead\nlet's use the method of \"optimism,\" or the inspired guess. The inspiration\nhere is based on the fact that differentiation reproduces exponentials:\n\nd\n-- e^{rt} = r e^{rt}\ndt\n\nSince the right hand side is an exponential, maybe the output signal x\nwill be too: TRY x = A e^{3t} . This is not going to be the general\n\nsolution, so I'll write x_p for it. I don't know what A is yet, but:\n\n2 x_p = 2 A e^{3t}\n\nx_p' = A 3 e^{3t}\n\n-----------------\n\n4 e^{3t} = A (3+2) e^{3t}\n\nwhich is OK as long as A = 4/5: x_p = (4/5) e^{3t} is one solution.\nThe general solution is this plus a transient:\n\nx = (4/5) e^{3t} + c e^{-2t} .\n\n[6] Replacing sinusoidal signals with exponential ones\n\nLet'e go back to the original ODE\n\nx' + 2x = 2 cos(t)\n\nThis equation is the real part of a complex valued ODE:\n\nz' + 2z = 2 e^{it}\n\nThis is a different ODE, and I use a different variable name, z(t) .\n\nWe just saw how to get an exponential solution: z_p = A e^{it}\n\n2 zp = 2 A e^{it}\n\nzp' = i A e^{it}\n\n-----------------------\n\n2 e^{it} = A (2+i) e^{it}\n\nso z_p = 2/(i+2) e^{it}\n\nTo get a solution to the original equation we should take the real part\nof this! Expand each factor in real and imaginary parts:\n\nz_p = (2(2-i)/5) ( cos(t) + i sin(t) )\n\nx_p = Re(z_p) = (4/5) cos(t) + (2/5) sin(t)\n\nThis is the only sinusoidal solution. To get the general solution we add\na transient:\n\nx = x_p + c x_h\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/8bb1f3122af8170cb6e480a7b4bdc889_MIT18_03S10_c08.pdf",
      "content": "18.03 Class 8, Feb 19, 2010\n\nAutonomous equations\n\n[1] Logistic equation\n[2] Phase line\n[3] Extrema, points of inflection\n\nAnnouncements:\n\nFinal Tuesday, May 18, 9:00 - 12:00, Johnson Track\n\nHour exam next Wednesday: Rooms to be announced Monday.\nPlease go to the hour you are registered for. 50 minutes.\n\n[1] Back to qualitative study of differential equations.\n\nI'll use (t,y) today. The general first order equation is\n\ny'(t) = F(t,y)\n\nAutonomous ODE: y'(t) = g(y) .\n\nAutonomous means conditions are constant in time, though they may depend\non the current value of y .\n\nEg [Natural growth/decay] Constant growth rate: so y' = k0 y .\n\nEg Bank account with interest rate NOT depending on time but possibly\ndepending upon current balance, and constant savings rate: y' = I(y) y + q .\n\nExtended example: Population model with variable growth rate k(y) depending\non the current population but NOT ON TIME; so y' = k(y) y.\n\nSuppose that when y is small the growth rate is approximately k0 , but\nthat there is a maximal sustainable population p , and as y gets near\nto p the growth rate decreases to zero. When y > p , the growth rate\nbecomes negative; the population declines back to the maximal sustainable\npopulation.\n\nIn the simplest version of this, when you graph of k(y) against y you\nget a straight line with vertical intercept k0 and horizontal intercept p :\n\nk(y) = k0 (1 - (y/p)).\n\nso k(0) = k0 , and k(p) = 0 . When y > p , k(y) < 0 .\n\nThe Logistic Equation is y' = k0 (1 - (y/p)) y = g(y) .\n\nThis is more realistic than Natural Growth when you want to account for\nlimits to growth. It is nonlinear but it IS autonomoous.\n\nAutonomous equations are always separable, but we aim for a qualitative grasp\nof solutions. I sketched the nullcline: y = 0 and y = p .\nClearly all the isoclines will be collections of horizontal straight lines\n- the differential equation is constant in time.\n\nTo get a clear idea of the other isoclines, I will draw a graph of g(y)\nas a function of y . It's a parabola opening downward, meeting the horizontal\naxis at y = 0 and y = p .\n\nThis says that for y < 0 the slopes are negative\nfor 0 < y < p the slopes are positive\nfor y > p the slopes are positive.\n\nI drew more isoclines and some solution curves. The bounded solutions\nare \"logistic curves\" or \"S-curves.\" The represent the population drifting\nfrom just above one equilibrium (no oryx) towards the stable population\n(p oryx).\n\nIf the population exceeds the maximal stable population, it falls back\ntowards it. The max stable population is a \"stable equilibrium;\"\nthe zero population is \"unstable.\"\n\nValues of y for which g(y) = 0 are called \"critical points\" of\nthe differential equation y' = g(y) . The are also called \"equilibria.\"\n\n[2] Phase line\n\nSince the direction field is constant horizontally, its essential content\ncan be conveyed more efficiently. Draw a vertical line. Mark on it the\nequilibria, where g(y) = 0. In between them, draw an upward pointing arrow\nif g(y) > 0 and a downward pointing arrow if g(y) < 0 . This simple\ndiagram tells you roughly how the system behaves. It's called the \"phase line.\"\n\nQuestion 8.1. In the autonomous equation y' = g(y) , where g(y) has\na graph which I sketch, looking like g(y) = y^3 - y , is the rightmost\ncritical point\n\n1. Stable\n2. Unstable\n3. Can't tell, could be either\nBlank: don't know\n\nThis can be made clear by sketching the phase line. Ans: Unstable.\n\nIn terms of the graph of g(y), the stable equilibria occur when\ng'(p) < 0 , unstable when g'(p) > 0.\n\nNow, the Kenyan government wants to establish a game preserve on which\nit will allow the hunting of oryx. It wants to sell licenses to kill\n250 oryx each year and wants to know how big a preserve to establish to\nguarantee that this is sustainable. It's known that the population\n(measured in kilo-oryx, without hunting) follows the logistic equation\n\ny' = (a-y)y\n\nHere a is the stable population of oryx, in the absence of hunting.\nIt is proportional to the area of the preserve. With our 1/4 kilo-oryx\nper year hunt, then, we have\n\ny' = g(y) =(a-y)y - 1/4 = - ( y^2 - ay + 1/4 )\n\nI invoked the Mathlet <Phase Lines> to visualize what happens.\n\nFor small a , the population crashes.\n\nWhen a is increased to a critical size, a single equilibrium appears,\nwhich is \"semistable.\" You can watch the graph of g(y) at the lower left\nof the applet; it's a parabola, opening downward, and it rises as a increases\ntill at a = 1 it has a single root.\n\nWe can solve for where the critical points are, using the quadratic formula:\n\ny = a/2 +- (1/2)(sqrt(a^2 - 1))\n\nThere is just one exactly when the square root is zero, ie a = 1 (or a = -1 ).\n\nSo the Kenyan Chamber of Commerce recommends a preserve of this size, a = 1.\n\nIs this wise? if the population falls every so slightly below the critical\npopulation (which seems to be y = 1/2), it crashes.\n\nWhen you increase a further, things get better. There are two critical\npoints. The farther they are from each other, the more stable the population\nsystem is.\n\nI returned a to zero and opened the Bifurcation Diagram. and watched\nwhat happened as a increased. The bifurcation diagram puts all the\nphase lines, for various a , together.\n\n[3] In an autonomous equation y' = g(y) , the conditions represented by\nthe ODE are constant in time. Direction fields are constant in the horizontal\ndirection. Consequently, any horizontal (time) translate of a solution is\nanother solution. A \"time translate\" of a function y(t) is a function\ny(t-t_0): the graph gets shifted horizontally (to the right) by t_0 units.\n\nEx. Solutions of y' = k_0 y exhibit three different behaviors,\nillustrated by\n\ny = e^{k_0 t} , y = 0 , y = - e^{k_0 t}\n\nAny solution is a horizontal translate of one of them: any solution is either\n\ny = e^{k_0 (t - t_0)} ,\n\ny = 0 (whose only time-translate is itself) , or\n\ny = - e^{{k_0 (t - t_0)}\n\nQuestion 8.2. Solutions of autonomous equations can have a\n\nstrict local maximum.\n\n(A strict local maximum for f(t) is a time t = a such that\nf(a) > f(t) for all t near but not equal to a . )\n\n1. True\n2. False\n\nExtreme points occur where y' = 0 , i.e. where g(y) = 0. These\nare the constant solutions, and they don't have strict maxima or minima.\nSo it's true, solutions can't have strict extrema.\n\nQuestion 8.3. Nonconstant solutions of the autonomous ODE y' = g(y)\nhave inflection points at y for which:\n\n1. g(y)=0\n2. g'(y)=0\n3. g''(y)=0\n\ny\" = g'(y) y' by the chain rule. So if y\" = 0 at y = c then either\ng'(c) = 0 (constant solutions) or g'(c) = 0 there. So (2) is the case.\nYou can see it on the S curve.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/d9996f62045a189420da381edb2543eb_MIT18_03S10_c09.pdf",
      "content": "18.03 Class 9, Feb 22, 2010\n\nLinear vs Nonlinear: a debate\n\n[1] Linearization near equilibrium\n[2] Exponential Response Formula (first order)\n[3] Potential blow-up of solutions to a nonlinear equation\n\nHour Exam I Wednesday. Locations for both lectures:\n\n10-250 A -- G\nWalker H -- Z\n\nOffice hours as usual on Wednesday\n\nReview: Nonlinear vs Linear\n\ny'(t) = F(t,y(t)) vs r(t) x'(t) + p(t) x(t) = q(t)\n\nThis is in the form of a debate, between Linn E. R. (on the right)\nand Chao S. (on the left). I'll take a vote at the end.\n\nLinn: I'd like to begin by making the point that there is a solution\nprocedure for linear equations, which reduces solution of any linear\nequation to integration: Multiply the equation through by a factor so that\nthe two terms become the two terms in (d/dx)(ux) . Then integrate.\n\nSometimes you can just *see* this: t^2 x' + 2t x = (d/dt)(t^2 x) for example.\n\nIf we are in *reduced* standard form, so r = 1 , then this can be done\nsystematically:\n\nWe seek u(t) such that u (x' + px) = (d/dt) (ux)\ni.e. pu = u' : separable, with solution u = e^{\\int p(t) dt}\n(any constant of integration will do here). Then integrate both sides of\n\n(d/dt) (ux) = uq : x = u^{-t} int uq dt\n\nThe constant of integration is in this integral, so the general solution\nhas the form\n\nx = x_p + c u^{-1} .\n\nAnother lovely feature of linear equations is that the constant of integration\nin the solution of a linear equation always appears right there.\n\nThe \"associated homogeneous equation\" is x' + px = 0 : separable,\nwith solution x_h = e^{-\\int p(t) dt} . Look! this is the reciprocal of\nthe integrating factor! Wonderful!\n\nIn most applications, u{-1} falls off to zero\nas t gets large; the term c u^{-1} is a \"transient.\"\n\nChao: That's a lot of integration .... I'm more interested in the general\n\nbehavior of solutions, rather than an incomprehensible expression of them\nas integrals or a boring expression of them in terms of sin, cos, exponential.\n\nI prefer arguments like this: take an equation like y' = y^2 - x .\nThis doesn't have a single solution which you, Linn, in your linear cave,\nhave anything to say about. But I can look at the direction field,\nrecognize that there is a funnel along y = -\\sqrt(x) , so all solutions\nnear there are trapped and are asymptotic to - sqrt(x) .... and even argue\nthat they are all ultimately a bit larger than - sqrt(x) . No integration\ninvolved, but very good information.\n\nOr take an equation like the logistic equation\n\ny' = k_0 ( 1 - y/p) y\n\nThis is an auotomous equation, and remains so even if I allow a harvest\nrate, even one depending up on y :\n\ny' = k_0 ( 1 - y/p) y - a(y)\n\nThis equation gives genuine insight into real population dynamics.\nBy looking at the phase line it is easy to analyze the behavior of\nsolutions, in a way useful for policy makers.\n\nLinn: Well, now, most of the time a system is near equilibrium.\nEngineers get very anxious when their systems get too far from\nequilibrium. Let's look at your nice nonlinear logistic equation.\nAs you said, there's a critical point at y = p , and so an equilibrium\nsolution. Just how does the system relax to this equilibrium?\n\nLet's write y = p + u and change variables:\n\n1 - y/p = - u/p\n\nu' = - k_0 u/p (p-u) = - k_0 u + k_0 u^2/p\n\nFor small u the second term is *very* small, and can be ignored.\nThis is called LINEARIZING the equation near equilibrium. Near equilbrium\nsolutions to the nonlinear equation behave a lot like p + u where\nu is a solution to the *linear* equation\n\nu' = - k_0 u\n\nso we can say that the population relaxes to equilibrium exponentially,\nas e^{-k_0 t} approaches 0.\n\nChao: There you go again with your fancy exponentials. You think you\nknow all about them, but your computer has to compute their values, after\nall, and the methods it uses are no different than the methods used to\ncompute the values of linear equations: Euler's method, or its fancier\nvariants.\n\nLinn: Speaking of fancy exponentials, I'd like to point out that\nsmart people almost never use integrating factors to integrate linear\n\nequations with constant coefficients:\n\nx' + k x = q(t)\n\nYeah, the integrating factor is e^{kt} , but even I don't like the\nintegrals that come out. But there are these great tricks, Chao! Suppose\nq(t) = B e^{rt} . Then, be optimistic! maybe there's an exponential\nsolution!\nx_p = A e^{rt}\n\nx_p' = A r e^{rt}\n-----------------\n\nB e^{rt} = A (k+r) e^{rt}\n\nso A = B / (k+r) :\n\nERF x_p = B e^{rt} / (k+r) is a solution to x' + kx = B e^{rt}\n\nThis is the \"Exponential Response Formula.\" It works as long as k+r is not 0.\n\nChao: Bravo.\n\nLinn: And what's better, did I ever tell you about the complex exponential?\nr can be a complex number! Euler told us that\n\ne^{i theta} = cos(theta) + i sin(theta)\n\n-- it's a point on the unit circle in the complex plane --- so trig functions\nare incorporated into the complex exponential!!\n\nSo to solve x' - x = 3 cos(t)\n\nI replace it by a different equation\n\nz' - z = 3 e^{it}\n\nof which it is the real part. Then use optimism or the ERF\n(with k = -1 , r = i , B = 3 ):\n\nz_p = 3 e^{it} / (-1+i)\n\nand just find the real part x_p = Re(z_p)\n\nz_p = 3 (-1-i)/2 (cos(t) + i sin(t))\n\nso x_p = -(3/2) cos(t) + (3/2) sin(t)\n\nFor the general solution we just add in the general sol to the homogeneous\nequation, which is c e^t . It's a little funny to call this a \"transient,\"\nand I don't, but it does give you the general solution.\n\nChao: You know, this method results in these sums of sines and cosines,\nwhich is very nice but I want to know what they look like. The \"nonlinear\"\n\nview of sines and cosines writes\n\na cos(omega t) + b sin(omega t) = A cos(omega t - phi)\n\nwhere A, phi are the polar coordinates of the point (a,b) .\n\nIn your example, A = 3 sqrt(2)/2 and phi = 3 pi/4 : so the solution is\neasy to draw and compare with the input signal.\n\nLinn, I want to point out another charming feature of solutions to many\nnonlinear equations. ... Take a simple one like y' = y^2\nfor example. This is separable: y^{-2} dy = dx , - y^{-1} = x + c ,\n\ny = 1 / (c - x)\n\nSo the IVP with y(0) = 1 has c = 1 , y = 1/(1-x) . Its graph is\nasymptotic to the vertical line at x = 1 : it goes off to infinity in\nfinite time. It ENDS. The equation y = 1/(1-x) actually represents TWO\nsolutions: one for x < 1 , and another for x > 1 . If we are to say that\na solution of a differential equation is determined by an initial value,\nwe have to require that the graph be connected.\n\nLinn: You call that a feature? That never happens to solutions to my\nequations. If they are going to go south on me, I know it from the\ncoefficients or the input signal. As long as p(t) and q(t) are\nnice and finite (and r(t) is nonzero) so are all solutions.\nThey live as long as I do!\n\nChao: Well, the world really is nonlinear. Newton's law of gravitation is\nhighly nonlinear. This kind of explosion actually happens in the case of\nNewton's laws: Jeff Xia showed that in a certain 5-planet system two of the\nplanets behaves more or less like (1/t) sin(1/t) , oscillating with\nincreasing amplitude and increasing frequency as t ---> 0 (from t < 0 ) .\n\nSolutions to linear equations are not nearly as diverse and exciting!\n\nWho wins? Linn E. R. or Chao S.?\n\nIn both classes, Linear won but Nonlinear was more enthusiastic.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_c11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/1283839fb9d8c815f9362c3703b80878_MIT18_03S10_c11.pdf",
      "content": "18.03 Class 11, Feb 26, 2010\n\nSecond order linear equations:\nPhysical model, solutions in homogeneous case.\nCharacteristic polynomial, distinct real roots.\n\n[1] Springs and masses\n[2] Dashpots\n[3] Second order linear equations\n[4] Solutions in homogeneous case: Superposition I\n[5] Exponential solutions: characteristic polynomial\n\n[1] Second order equations are the basis of analysis of mechanical\nand electrical systems. We'll build this up slowly.\n\nA spring is attached to a wall and a cart:\n\nspring mass\n\n|\n|| |-------> F_ext\n|| |\n|| ___|___\n|| | |\n||---VVVVVVV---| |\n|| |_______|\n|| O | O\n|| |\n|------->\n| x\n\nSet up the coordinate system so that at x = 0 the spring is relaxed,\nwhich means that it is exerting no force.\n\nIn addition to the spring, suppose that there is another force acting\non the cart -- an \"external force,\" maybe wind blowing on a sail attached\nto it, maybe gravity, or some other force. Then\n\nmx\" = F_spr + F_ext\n\nThe spring force is characterized by the fact that it depends only on\nposition. In fact:\n\nIf x > 0 , F_spr(x) < 0\nIf x = 0 , F_spr(x) = 0\nIf x < 0 , F_spr(x) > 0\n\nI sketched a graph of F_spr(x) as a function of x .\nThe simplest way to model this behavior (and one which is valid in general\nfor small x , by the tangent line approximation) is\n\nF_spr(x) = -kx k > 0 the \"spring constant.\" \"Hooke's Law\"\n\nThis is another example of the linear approximation that Linn was\n\ndiscussing on Monday. So we get\n\nmx\" + kx = F_ext .\n\nI displayed a weight on a rubber band. This is not a spring, as you\nusually think of one, but it behaves like one, at least in a range.\nLay a rubber band laid out on a table. Fix the right end of it and set x = 0\nwhere the left end is in a relaxed state, then the graph of the force\nexerted by the rubber band looks something like this ...\n\n|\n|\n|| .------- fastened here\n|| |\n|| linear spring |\n|| | |\n|| | | .---- end of unstretched band\n| \\ | | |\n| \\ /__/ | |\n| \\ \\ V V\n| \\\n| \\ *=========*\n| \\\n______________| \\__________.__________ ________________\n\\ |\n\\ |\n\\ |\nlinear spring -----> \\ |\n\\ |\n\\ |\n\\ |\n||\n||\n||\n||\n||\n|\n|\n|\n|\n\n^\n|\n|\nthe rubber band breaks! -----\n\n[2] Any real mechanical system has friction. Friction takes many forms.\nIt is characterized by the fact that it depends on the motion of the mass.\nWe will suppose that it depends only on the velocity of the mass and\nnot on its position. Often the damping is controlled by a \"dashpot.\"\nThis is a cylinder filled with oil, that a piston moves through.\nDoor dampers and car shock absorbers often actually work this way.\nWrite F_dash(x').\n\nIt acts against the velocity:\n\nIf x' > 0 , F_Dash(x') < 0\nIf x' = 0 , F_Dash(x') = 0\nIf x' < 0 , F_Dash(x') > 0\n\nThe simplest way to model this behavior (and one which is valid in general\nfor small x' , by the tangent line approximation) is\n\nF_fric(x) = -bx b > 0 the \"damping constant.\"\n\nThis is \"linear damping.\" Altogether the equation is\n\nmx\" + bx' + kx = F_ext\n\nDiagrammatically:\n\nspring mass dashpot\n\n|\n|| |-------> F_ext ||\n|| | ||\n|| ___|___ _____________ ||\n|| | | _____ | ||\n||---VVVVVVV---| |------|_____| |-------||\n|| |_______| _____________| ||\n|| O | O ||\n|| | ||\n|------->\n| x\n\n[3] A linear differential equation is one of the following form:\n\na_n x^(n) + a_{n-1} x^(n-1) + ... + a_1 x' + a_0 = q(t)\n\n(no constant term on the left hand side!) The a_k's are the \"coefficients.\"\nThey may depend upon t (but not on x ). If a_n is not zero, this is\n\"of order n.\"\n\nOur spring system is an example of a *second order* linear equation.\n(Two springs in series will give a fourth order equation.)\n\nThe left hand side represents the SYSTEM, the spring/mass/dashpot system.\nThe right hand side encodes the INPUT SIGNAL, an external force at work.\nThe coefficients represent parameters of the system -- for example,\nmass, damping constant, spring constant. In general they may\ndepend upon time: maybe the force is actually a rocket, and the fuel burns\nso m decreases. Maybe the spring gets softer as it ages. Maybe the\nhoney in the dashpot gets stiffer with time.\n\nMost of the time we will assume that the coefficients\nare CONSTANT: the timescale of their variation is much longer than\nthe timescale of the dynamical variable x .\nBut the external force F_ext(t) can certainly vary (maybe sinusoidally).\n\nWe can see physically that there are many solutions with fixed\n\ninitial value of x , x(t_0) = x_0 . So many different solution\ncurves of a second order equation pass through a given point.\nBut, also on physical grounds, the initial position together with\nthe initial vecocity determine the solution: \"initial position\" data\nfor a second order equation consist of both position and velocity\nat a give instant. This is a version of the existence/uniqueness theorem.\nIn an n-th order equation, you need to know n numbers:\nx(t_0), x'(t_0), ... x^(n-1)(t_0) .\n\n[4] We'll begin with F_ext = 0 : the system is allowed to\nevolve on its own, without outside interference.\n\nmx\" + bx' + kx = 0 , m nonzero (*)\n\nThink of a saloon door swinging. This is a *homogeneous* equation.\n\nSpecial case (from recitation): the harmonic oscillator: b = 0, k > 0 :\n\nx\" + (k/m) x = 0\n\nSolutions come from simple facts about sines and cosines:\n\ncos(omega t) ---> - omega sin(omega t) ---> - omega^2 cos(omega t)\nsin(omega t) ---> omega cos(omega t) ---> - omega^2 sin(omega t)\n\nSo if omega^2 = k/m , so that our equation is x\" + omega^2 x = 0 ,\n\nthen x = cos(omega t) and x = sin(omega t) are solutions:\n\nANOTHER FUNDAMENTAL FACT TO MEMORIZE!\n\nIn fact, you showed that any sinusoid of circular frequency omega,\n\nx = a cos(omega t) + b sin(omega t) = A cos(omega t - phi) (*)\n\nis also a solution. In fact these are the only solutions, because\n\nx(0) = a\n\nx'(0) = omega b\n\nand so you can solve (uniquely) for a and b to give any desired\ninitial condition: you don't need more.\n\nQ11.1. What is the period of a nonzero solution of x\" + 4x = 0 ?\n\n1. Depends upon the solution\n2. 2\n3. pi\n4. 4\n5. 2pi\n6. pi/2\nBlank. Don't know.\n\nAns: : think of what t has to do to take (2t) from 0 to 2pi.\nOr use P = 2pi/omega, with omega = 2 . Ans: 3: pi.\n\nThe fact that cos(omega t) and sin(omega t) are solutions implies that\n(*) is also a solution, via\n\nSuperposition I: If x_1 and x_2 are two solutions of the homogeneous\nlinear equation, then so is\n\nx = c_1 x_1 + c_2 x_2\n\nCheck (in second order case mx\" + bx' + kx = 0 ):\n\nm(c_1x_1 + c_2x_2)\" + b(c_1x_1 + c_2x_2) + k(c_1x_1 + c_2x_2)\n\n= m(c_1x_1\" + c_2x_2\") + b(c_1x_1' + c_2x_2') + k(c_1x_1 + c_2x_2)\n\n= c_1(mx_1\" + bx_1' + kx_1) + c_2(mx_2\" + bx_2' + kx_2)\n\n= c_1 ( 0 ) + c_2 ( 0 ) = 0 .\n\n[5] The equation mx\" + bx' + kx = 0 , for m, b, k constant,\nis a lot like x' + kx = 0 , which has as solution x = e^{-kt}\n(and more generally multiples of this). It makes sense to try for\nexponential solutions of (*): e^{rt} for some as yet undetermined\nconstant and r .\n\nTo see which r might work, plug x = e^{rt} into (*). Organize the\ncalculation: the k] , b] , m] are flags indicating that I should\nmultiply the corresponding line by this number.\n\nk ] x = c e^{rt}\nb ] x' = c r e^{rt}\nm ] x\" = c r^2 e^{rt}\n___________________\n\n0 = mx\" + bx' + kx = c ( mr^2 + br + k ) e^{rt}\n\nAn exponential is never zero, so we can cancel to see that c e^{rt} is a\nsolution to (*) for any c exactly when r is a root of the\n\"characteristic polynomial\"\n\np(s) = ms^2 + bs + k\n\nExample. x\" + 5x' + 4x = 0\n\nThe characteristic polynomial s^2 + 5s + 4 . We want the roots. One reason\nI wanted to write out the polynomial was to remember that you can find\nroots by factoring it. This one factors as (s + 1)(s + 4)\nso the roots are r = -1 and r = -4 . The corresponding exponential\nsolutions are e^{-t} and e^{-4t} .\n\nBy superposition, the \"linear combination\"\n\nx(t) = c_1 e^{-t} + c_2 e^{-4t}\n\nis a solution as well. This is the general solution.\n\nSuppose we know also that x(0) = 2 and x'(0) = - 5 . To use the second\ncondition we'll need to know\n\nx(t) = - c_1 e^{-t} - 4 c_2 e^{-4t}\n\nThen\n\n2 = c_1 + c_2\n- 5 = - c_1 - 4 c_2\n-------------------\n-3 = - 3 c_2 so c_2 = 1 and then c_1 = 1:\n\nx(t) = e^{-t} + e^{-4t}\n\nGeneral picture: A linear equation of degree n\n\na_n x^(n) + ... + a_1 x' + a_0 x = q(t)\n\nwith constant coefficients has a characteristic polynomial,\n\np(s) = a_n s^n + ... + a_1 s + a_0\n\ne^{rt} is a solution if and only if r is a root of p(s) : p(r) = 0 .\n\nBy superposition, any linear combination of these exponentials is also a\nsolution.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "MIT18_03S10_Reading_Lec29.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/2f55994351a6524953ac067bea36e80f_MIT18_03S10_Reading_Lec29.pdf",
      "content": "18.03 Difference Equations and Z-Transforms\nJeremy Orloff\nDifference equations are analogous to 18.03, but without calculus. On the last page\nis a summary listing the main ideas and giving the familiar 18.03 analog. The two\nline summary is:\n1. In 18.03 the answer is eat, and for difference equations the answer is an.\n2. The differential operator D has both algebraic and analytic analogs in difference\nequations.\nSequences\nx[n]\n(also called signals or discrete functions)\nExamples:\na)\n. . .\n-\n-\n-\n-\n-\n-2\n-1\n. . .\nx[n] = (1/2)n\n⇒. . . x[-2] = 4, x[-1] = 2,\nx[0] = 1, x[1] = 1/2, . . .\nb)\n. . . -\n-\n-\n-\n-\n-2\n-1\n. . .\nx[n] =\nif n < 0\n2n\nif n ≥0\nc) Unit sample:\nδ[n] =\nif n = 0\notherwise\n. . .\n-\n-\n-\n-\n-\n-2\n-1\n. . .\nd) Unit step:\nu[n] =\nif n < 0\nif n ≥0\n. . .\n-\n-\n-\n-\n-\n-2\n-1\n. . .\nDifference Equations\nExample 1:\ny[n] -y[n -1] = x[n].\n(x = input,\ny = output)\nExample 2:\ny[n] + 8y[n -1] + 7y[n -2] = x[n].\nExample 3:\ny[n] + 8y[n -1] + 7y[n -2] = x[n] -x[n -1].\nExample 4:\ny[n] -ny[n -1] = x[n]\nExamples 1-3 are constant coefficient equations, i.e.\nlinear time invariant (LTI).\nExample 4 is not constant coefficient. We will focus on constant coefficient equations.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nIn practice it's easy to compute as many terms of the output as you want: the\ndifference equation is the algorithm.\nExample: For the difference equation\ny[n] -1\n2y[n -1] = u[n] find y[n] for n ≥0.\nAssume rest IC y[-1] = 0.\n(Here u[n] is the unit step function.)\nanswer: Rewrite the equation as y[n] = u[n] + 1\n2y[n -1].\nMake a table:\nn\n-1\n. . .\nu[n]\n. . .\ny[n]\n3/2\n7/4\n15/8\n31/16\n. . .\nWe have already seen difference equations with Euler's formula. For example the IVP\ny′ = ky; y(0) = 1 becomes the difference equation\nyn+1 = yn + khyn = (1 + kh)yn ⇔yn+1 -(1 + kh)yn = 0.\nHere instead of y[n] we wrote yn\nZ-transform\n(analog of Laplace transform)\nLet x[n] be a sequence. Its z-transform is\nX(z) =\nX\nn\nx[n]z-n.\n(analogous to F(s) =\nZ inf\nf(t)e-st dt; e-s ↔z-1.)\nWhen it's useful we will denote the z-transform of x by Zx\n(similar to using Lx for Laplace).\nExample 1:\nz-transform of δ[n] is 1.\nExample 2:\nz-transform of u[n] is U(z) =\ninf\nX\nn=0\nz-n = 1 + z-1 + z-2 + . . . =\n1 -z-1.\nExample 3:\nIf x[n] = 0 for n < 0 and x[n] = an for n ≥0 then X(z) =\ninf\nX\nn=0\nanz-n =\n1 -az-1.\nConvolution\nStart with two sequences x[n] and y[n] their convolution is defined as\n(x ∗y)[n] =\nX\nk\nx[k] y[n -k].\nThis arises in the following way.\nX(z) =\nX\nk\nx[k]z-k,\nY (z) =\nX\nm\ny[m]z-m.\n⇒X(z)Y (z) =\nX\nk\nx[k]z-k\n! X\nm\ny[m]z-m\n!\n=\nX\nk\nX\nm\nx[k]y[m]z-k-m =\nX\nn\nX\nk\nx[k]y[n -k]\n!\nz-n\ni.e.,\nX(z)Y (z) = Z(x ∗y).\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nDelay Operator (algebraic analog of D)\nDelay operator:\n(Ry)[n] = y[n -1].\n(Also called right shift operator.)\nSo, (R2y)[n] = y[n -2] etc.\nAlgebraically we work with R in difference equations\nand Z-transforms in much the same way we work with D in differential equations\nand Laplace transforms.\nExample:\ny =\n-\n-\n-\n-\n-\n-\n-3\n-2\n-1\nRy =\n-\n-\n-\n-\n-\n-\n-\n-3\n-2\n-1\nTheorem:\n(Z-transform of R)\nZ(Rx) = z-1X.\nProof:\nZ(Rx) =\nX\nn\n(Rx)[n]z-n =\nX\nn\nx[n -1]z-n\n= z-1 X\nn\nx[n -1]z-(n-1) = z-1 X\nm\nx[m]z-(m) = z-1X(z).\nQED\nGeneral constant coefficient difference equations and the z-transform.\nGeneral form:\nP(R)y = Q(R)x.\nz-transform P(z-1)Y = Q(z-1)X.\nx is called the input and y is the output or response.\nExample: Example 3 above has\n(1 + 8R + 7R2)y = (1 -R)x\nUsing the formula for the z-transform of R we get (1+8z-1 +7z-2)Y = (1-z-1)X.\nSystem (or transfer) function\nTheorem:\nThe difference equation\nP(R)y = Q(R)x\nwith initial conditions\nx[n] = 0 and y[n] = 0 for n < 0 (called rest initial conditions) satisfies Y = Q(z-1)\nP(z-1) X.\nWe call\nQ(z-1)\nP(z-1)\nthe system function. Often, we will denote it H(z).\nThus, with rest IC, Y (z) = X(z)H(z).\n(The need for rest IC is explained in the odds and ends section later in these notes.)\nUnit sample response\nBy definition, the unit sample response satisfies the equation\nP(R)h = Q(R)δ with rest IC. It's easy to see that Z(h) = H is the system function.\nTheorem:\nThe equation P(R)y = Q(R)x with rest IC has solution y = x ∗h,\nwhere h is the unit sample response of the system.\nProof:\nFrom above we know Y (z) = X(z)H(z) = Z(x ∗h).\nQED\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nExample: Solve y[n] -ay[n -1] = δ[n],\nwith rest IC.\nZ-transform:\n(1 -az-1)Y = 1 ⇒Y =\n1 -az-1 = 1 + az-1 + (az-1)2 + . . ..\n⇒y[n] =\nfor n < 0\nan\nfor n ≥0\nPoles, stability and homogeneous equations\nThe system P(R)y = Q(R)x has system function H(z) = Q(z-1)\nP(z-1).\nSo the poles of H(z) are exactly the roots of P(z-1).\n(We need to assume P and Q have no common factors.)\nAs in differential equations these poles give us the solutions to the corresponding\nhomogeneous equation, i.e.,\nP(R)y = 0.\nExample: Solve the homogeneous equation P(R)y = y[n]+8y[n-1]+7y[n-2] = 0.\nTrial solution:\ny[n] = an.\nSubstitution:\nan + 8an-1 + 7an-2 = 0 ⇒an-2(a2 + 8a + 7) = 0.\nCharacteristic equation:\na2 + 8a + 7 = 0.\nRoots:\na = -7, -1.\nTwo solutions:\ny1[n] = (-7)n,\ny2[n] = (-1)n.\nGeneral solution:\ny = c1y1 + c2y2.\n(This follows from the linearity of P(R).)\n(Below we will discuss the existence and uniqueness theorem that guarantees this\ngives all possible solutions.)\nNote,\nP(z-1) =\n1 + 8z-1 + 7z-2 =\nz2\nz2 + 8z + 7.\nSo the roots of the characteristic\nequation are the same as the zeros of the denominator which are the poles of the\nsystem function.\nStability\nAs in 18.03, we say the system P(R)y = Q(R)x is stable if the homogeneous solution\nyh[n] →0 as n →inf\nno matter what the initial conditions.\nThat is, the initial conditions don't affect the long-term behavior of the system.\nTheorem:\nThe system\nP(R)y = Q(R)x\nis stable if and only if all the poles of\nthe system function have magnitude < 1. (We assume P and Q have no common\nfactors.)\nProof:\nAs in the example just above, the general homogenous solution is a linear\ncombination of sequences of the form yj[n] = an\nj , where aj is a pole of the system\nfunction. This goes to 0 if and only if |aj| < 1.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nGraphically the system is stable if all the poles are inside the unit circle. (Compare\nthis with differential equations where the homogeneous solution is built from functions\nof the form yj(t) = eat, so we need a in the left half-plane.)\nExample:\nDifference equations:\nRe\nIm\n×\n×\n×\n×\nStable discrete system\nRe\nIm\n×\n×\n×\n×\nUnstable discrete system\nDifferential equations:\nRe\nIm\n×\n×\n×\n×\nStable continuous system\nRe\nIm\n×\n×\n××\nUnstable continuous system\nOdds and ends\nCausality:\nCausality means the future doesn't affect the past.\nOur systems\nP(R)y = Q(R)x are causal because y[n] depends only on y[k] and x[k] for k ≤n.\nLinearity:\nP(R) is linear, i.e. P(R)(c1y1 + c2y2) = c1P(R)y1 + c2P(R)y2.\nProof:\nImmediate from the definition of R and P(R).\nUsing linearity we see that the general solution to P(R)y = Q(R)x is given by\ny = yp + yh, where yp is any particular solution and yh is the general homogeneous\nsolution.\nExample: Find the general solution to y[n] -1\n2y[n -1] = u[n].\nHomogeneous solution: Characteristic equation: a -1\n2 = 0 ⇒a = 1\n2 ⇒yh[n] = c\nn\n.\nParticular solution:\nUse rest IC, so y[n] = 0 for n < 0.\nWe could find y[n] for n ≥0 directly, instead we'll find it using the z-transform.\n(1 -1\n2z-1)Y =\n1 -z-1 ⇒Y =\n(1 -1\n2z-1)(1 -z-1) =\nA\n1 -1\n2z-1 +\nB\n1 -z-1.\nUsing coverup we find A = -1,\nB = 2 ⇒yp[n] =\nfor n < 0\n2 -(1/2)n\nfor n ≥0\nNote, for n ≥0 we can write the answer in the form yp[n] = 1 + 1\n2 + 1\n4 + · · · +\nn\n.\nFinally, the general solution is y = yp + yh.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nTransient:\nIf a system is stable then yh[n] →0 for all initial conditions. In this\ncase we call yh the transient.\nExponential Input Theorem:\nA solution to P(R)y = an is y[n] =\nan\nP(a-1).\nProof:\nRan = an-1 = a-1an ⇒P(R)an = P(a-1)an.\n(see below for the extended version of this theorem)\nDiscretizing DEs:\nIn previous sections we have seen the algebraic analogy between\nthe differential operator D and the right shift operator R. That is, the algebra is\nsimilar when dealing with either of these operators.\nBut, for numerical methods\nwe need more than this.\nTo discretize a differential equation we need to replace\nD by something that is analytically analogous. You have already seen this when\nwe learned Euler's method. Here we will discretize DEs two different ways: using\nforward differences and using backward differences. We will relate them to numerical\nmethods you have already learned. We will also discuss issues of stability.\nLet yc(t) be a function of the continuous variable t.\nWe can discretize yc by picking a stepsize h and a start time t0 and letting\ny[n] = yc(t0 + nh).\nHere are two ways to discretize the differential operator D (using the same stepsize h).\nForward difference:\n(∆f y)[n] = y[n + 1] -y[n]\nh\n, i.e. ∆f = L -I\nh\n, where L is the\nleft shift operator.\nBackward difference:\n(∆b y)[n] = y[n] -y[n -1]\nh\n, i.e. ∆b = I -R\nh\n.\nExample: Use forward and backward differences to discretize the first order constant\ncoefficient IVP.\n(C)\ny′\nc + kyy = fc(t),\nyc(0) = 1.\nPick a stepsize h > 0 and discretize fc(t) by f[n] = fc(nh).\nUsing forward differences replace\nD\nby\n∆f. Then yc(nh) ≈y[n], where\n(∆f y)[n] + k y[n] = f[n],\ny[0] = 1.\n⇒y[n + 1] -y[n]\nh\n+ k y[n] = f[n] ⇔\n(F)\ny[n + 1] -(1 -hk) y[n] = hf[n].\nUsing backward differences replace\nD\nby\n∆b. Then yc(nh) ≈y[n], where\n(∆b y)[n] + k y[n] = f[n],\ny[0] = 1.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\n⇒y[n] -y[n -1]\nh\n+ k y[n] = f[n] ⇔(1 + hk) y[n] -y[n -1] = hf[n] ⇔\n(B)\ny[n] -\n1 + hk y[n -1] =\nh\n1 + hk f[n].\nExample: (continued) Examine the stability of the original continuous system (C)\nand its discretized versions (F), (B).\nThe continuous system (C) has system function\ns + k.\nwhich has a pole at s = -k.\nThe homogeneous equation (the DE with fc(t) = 0) has solution\nyc = Ce-kt.\nLooking at either the poles or the homogeneous solution we conclude the system is\nstable for k > 0.\nThe discrete system (F) has system function\n1 -(1 -hk)z-1.\nThe system has a pole at z = 1 -hk ⇒it's stable if |1 -hk| < 1.\nIf k > 0 then we need 0 < h < 2/k for stability. Thus, even when (C) is stable, (F)\nis only stable for small h.\nThe discrete system (B) has system function\n1 -z-1/(1 + hk).\nThe system has a pole at z = 1/(1 + hk) ⇒it's stable if 1/|1 + hk| < 1.\nIf k > 0 then (B) is stable for all h > 0. Thus, when (C) is stable so is (B) for any h.\nWe can see the above results graphically by discretizing the homogeneous equations\nusing various values of h. In all of the plots below, the black exponential curve is the\ncontinuous solution yc(t) = e-kt. Notice how, when discretizing a stable DE, forward\ndifferences change quality as h decreases, while the backward differences do not.\n(CH)\ny′\nc + ky = 0;\nyc(0) = 1\n⇒yc(t) = e-kt.\n(FH)\ny[n + 1] -(1 -hk) y[n] = 0;\ny[0] = 1\n⇒y[n] = (1 -hk)n\n(BH)\ny[n] -\n1 + hk y[n -1] = 0;\ny[0] = 1\n⇒y[n] = (1 + hk)-n\nForward difference: k = 1.0, h = 2.1\nUnstable: 1-hk = -1.1\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nBackward difference: k = 1.0, h = 2.1\nStable: 1/(1+hk) = 0.3\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nForward difference: k = 1.0, h = 2.0\nUnstable: 1-hk = -1.0\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nBackward difference: k = 1.0, h = 2.0\nStable: 1/(1+hk) = 0.3\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nForward difference: k = 1.0, h = 1.5\nStable, oscillatory: 1-hk = -0.5\nG\nG\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nBackward difference: k = 1.0, h = 1.5\nStable: 1/(1+hk) = 0.4\nG\nG\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nForward difference: k = 1.0, h = 0.8\nStable: 1-hk = 0.2\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\nBackward difference: k = 1.0, h = 0.8\nStable: 1/(1+hk) = 0.6\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\nG\n0.5\nt\ny\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nForward difference: k = 1.0, h = 0.3\nStable: 1-hk = 0.7\nG\nG\nG\nG\nG\nG\nGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG\n0.5\nt\ny\nBackward difference: k = 1.0, h = 0.3\nStable: 1/(1+hk) = 0.8\nG\nG\nG\nG\nG\nG\nG\nGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG\n0.5\nt\ny\nRelation to numerical methods for solving differential equations\nIn the examples above we can write y′\nc = F(yc, t) = -kyc + f(t). The discretizations\nare specific cases of the following methods.\nForward differences ↔Euler's method:\nt[n] = nh\nand\ny[n + 1] = y[n] + h F(y[n], t[n]).\nBackward differences ↔Backward Euler:\nt[n] = nh\nand\ny[n + 1] = y[n] + h F(y[n + 1], t[n + 1]).\nThe Backward Euler is also called implicit Euler because it only gives an implicit\nformula for y[n + 1].\nIn general, for a constant coefficient linear DE Euler's method corresponds to dis-\ncretizing D using ∆f and implicit Euler corresponds to using ∆b. Backward Euler\nmaintains stability for any stepsize, while (forward) Euler only maintains stabiliy for\nsmall stepsize. This is why, despite the extra computation the implicit techniques are\noften preferable.\nLikewise, there are forward and backward Runge-Kutta methods and the discussion\nof stability holds for them also.\nAnalogies with differential equations\n1. Algebraic analogy:\nMost often in 18.03 our system was P(D)y = f, but some-\ntimes we had P(D)y = Q(D)f. For example, for LRC circuits we have differential\nequations in q (the charge on the capacitor) and i (the current in the circuit). The\ninput voltage E is handled slightly differently in each equation.\ni.\nLq′′ + Rq′ + 1\nCq = E.\nInput = E is used as is.\nii.\nLi′′ + Ri′ + 1\nCi = E′.\nInput = E is modified.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nIn (i) we have P(D)q = E. In (ii) we have the more general P(D)i = Q(D)E, which\nhas system function Q(s)\nP(s). This is algebraically analogous to the difference equation\nP(R)y = Q(R)x with system function Q(z-1)\nP(z-1).\n2. Analytic analogy:\nThis is covered in the section 'Discretizing DEs' above. There\nwe saw two ways to discretize D,\nD →∆b\nand\nD →∆f.\nTheorem: (Existence and uniqueness)\nIf P(R) has degree m then the IVP\nP(R)y = 0;\ny[0] = b0, y[1] = b1, . . . , y[m -1] = bn-1\nhas a unique solution.\nProof: This is clear. Simply solve for y[n] recursively as we did in the first order example.\nWe show a degree two example.\nExample: Solve y[n] + a1y[n -1] + a2y[n -2] = 0,\ny[0] = b1,\ny[1] = b1.\nGeneral equation:\ny[n] = -a1y[n -1] -a2y[n -2].\ny[0] = b0, y[1] = b1 ⇒y[2] = -a1b0 -a2b2 ⇒y[3] = -a1y[2] -a2y[1], etc.\nWe see that y[n] is uniquely determined.\nConvolution formula as a result of linear time invariance\nConsider the equation P(R)y[n] = Q(R)x[n] with rest IC. Let h be the unit sample\nresponse. We will rederive the formula y = x ∗h using linearity and time invariance.\nLet y[n] = (x ∗h)[n] =\nX\nk\nx[k]h[n -k].\nThe sequence h[n] is the solution to the equation\nP(R)y[n] = Q(R)δ[n].\nTime invariance means that h[n -k] is a solution to P(R)y[n] = Q(R)δ[n -k].\nWe can write x[n] =\nX\nk\nx[k]δ[n -k], so by linearity we have\nP(R)y[n] = P(R)\nX\nk\nx[k]h[n -k] =\nX\nk\nx[k]P(R)h[n -k] =\nX\nk\nx[k]Q(R)δ[n -k]\n= Q(R)\nX\nk\nx[k]δ[n -k] = Q(R)x[n]\nWe have shown that y = x ∗h is a solution.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nGrowth and decay rates\nIf a is a complex number then if |a| < 1 the rate that an decays to 0 depends on\n|a|, the closer to 1 the slower an decays. Likewise if |a| > 1 the rate that an grows\ndepends on |a|.\nIf a1, a2, . . . , am are complex numbers then the growth or decay rate of the linear\ncombination y[n] = P cjan\nj is given by the biggest value of |aj|. If all |aj| < 1 then it\nis a decay rate and the bigger the rate (the closer to 1) the slower y[n] decays.\nExample: Both systems are stable. System A has a faster decay rate than system\nB, i.e., the transient disappears faster for system A than for system B.\nRe\nIm\n×\n×\nSystem A\nRe\nIm\n×\n×\nSystem B\nThe need for rest IC:\nIf y[n] is the solution to P(R)y = Q(R)δ then we needed\nrest IC to write Y (z) = Q(z-1)\nP(z-1). We'll explain this using a simple example.\nConsider P(R)y[n] = y[n] -y[n -1] = δ[n].\nParticular solution with rest IC:\nyp[n] =\nfor n < 0\nfor n ≥0 .\nHomogeneous solution:\nyh[n] = c.\nGeneral solution:\ny[n] = yp[n] + yh[n] =\nc\nfor n < 0\n1 + c\nfor n ≥0 .\nSince P(R)(yp + yh) = δ the z-transform gives P(z-1)(Yp + Yh) = 1. The reason we\ncan't simply divide by P(z-1) is because P(z-1)Yh(z) = (1 -z-1)\ninf\nX\nn=-inf\ncz-n = 0.\nAlgebraically we say that P(z-1) and Yh(z) are zero divisors, that is, they are non-\nzero but when multiplied together they give 0. Just like dividing by 0, we have to\nbe careful doing division with zero divisors. By demanding rest IC we only consider\nz-transforms of sequences y with y[n] = 0 for n < 0. It is easy to see that this set\n(called a ring) does not have zero divisors.\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nExtended Exponential Input Theorem\nShift Law:\nLet v[n] be a sequence and w[n] = anv[n] then (1-aR)w = an(1-R)v.\n(Proof is easy algebra).\nExample: Solve (1 -aR)x = an.\nThe exponential input theorem fails because P(a-1) = 1 -aa-1 = 0.\nTry x = anv. Substituting x into the equation and using the shift law gives\n(1 -aR)x = an ⇔(1 -aR)(anv) = an(1 -R)v = an ⇔(1 -R)v = 1\n⇒v[n] = n ⇒x[n] = nan.\n(If we want we can add the homogeneous solution xh[n] = Can to x.)\nExample: Solve (1 -aR)2x = an.\nAgain, try the solution x = anv. Substituting gives\n(1 -aR)2x = an ⇔an(1 -R)2v = an ⇔(1 -R)2v = 1 ⇒(1 -R)v = n\n⇒v[n] = n(n + 1)\n⇒x[n] = n(n + 1)\nan.\nDefine Sk[n] as S0[n] = 1, and Sk[n] = n(n + 1) · · · (n + k -1)\nk!\nfor k ≥1.\nNote: Sk[0] = 0 and Sk[1] = 1.\nLemma:\n(1 -R)Sk = Sk-1.\nProof:\n(1 -R)(Sk)[n] = Sk[n] -Sk[n -1] = n(n + 1) · · · (n + k -1) -(n -1)n · · · (n + k -2)\nk!\n= [(n + k -1) -(n -1)]n(n + 1) · · · (n + k -2)\nk!\n= n(n + 1) · · · (n + k -2)\n(k -1)!\n= Sk-1[n].\nTheorem (extended exponential input)\nSuppose Q(s) is a polynomial and Q(a-1) = 0 then the difference equation\nQ(R)(1 -aR)kx = an has solution x[n] =\nan\nQ(a-1)Sk[n].\nProof:\nBy the shift law and the lemma (1 -aR)kx =\nan\nQ(a-1)(1 -aR)kSk =\nan\nQ(a-1)S0 =\nan\nQ(a-1).\nTherefore Q(R)(1 -aR)kx = Q(R)\nan\nQ(a-1) = an.\nOne-sided sequences\nWe state without proof some 'one-sided' results.\n1. (1 -R)x = u[n] has solution x[n] = (n + 1)u[n].\n2. (1 -R)kx = u[n] has solution x[n] = Sk[n + 1]u[n].\n3. (1 -aR)kx = anu[n] has solution x[n] = anSk[n + 1]u[n].\n(continued)\n\n18.03 Difference Equations and Z-Transforms\nSummary\n(correspondence between difference and differential equations)\nDifference equations\nDifferential equations\nSequences:\nx[n]\nFunctions:\nx(t)\nz-transform:\nZ(x) = X(z) =\nX\nn\nx[n]z-n\nLaplace transform:\nL(x) = X(s) =\nZ inf\nx(t)e-st dt\nConvolution:\n(x ∗y)[n] =\nX\nk\nx[k]y[n -k]\n(x ∗y)(t) =\nZ t\nx(u)y(t -u) du\nZ(x ∗y)(z) = X(z)Y (z)\nL(x ∗y) = X(s)Y (s)\nOperators\nR\n=\ndelay = right shift\n∆b\n=\nbackward difference\n∆f\n=\nforward difference\n\nD = derivative\n(Rx)[n]\n=\nx[n -1]\n(∆bx)[n]\n=\nx[n] -x[n -1]\nh\n(∆fx)[n]\n=\nx[n + 1] -x[n]\nh\n\nDx = x′\n(The correspondence R ↔D is an algebraic one and ∆f, ∆b ↔D is an analytic one.)\nCausal LTI system: P(R)y = Q(R)x\nP(D)y = Q(D)x\n(18.03 usually: P(D)y = x)\n(x = input,\ny = response,\nassume P and Q have no common factors.)\nSystem function:\nH(z) = Q(z-1)\nP(z-1)\nH(s) = Q(s)\nP(s)\nUnit sample resp.: P(R)h = Q(R)δ, rest IC\nUnit impulse resp.: P(D)h = Q(D)δ, rest IC\nZ(h) = H\nL(h) = H\nP(R)y = Q(R)x; rest IC\nP(D)y = Q(D)x; rest IC\n⇒Y = XH,\ny = x ∗h\n⇒Y = XH,\ny = x ∗h\nStability: poles of H inside unit circle\npoles of H in left half-plane\nDecay rate of transient determined by pole\nwith greatest magnitude\ndecay rate determined by right most pole\n(greatest real part)\n(In 6.01 they also write Q(R)\nP(R) for the system function.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Fourier Series: Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/37249e018851dd9563057320a8e0bf01_MIT18_03S10_rec_13.pdf",
      "content": "Fourier Series: Introduction\n1. What is the general solution to x + ω2 x = 0? [Quick!]\nn\n2. Discuss why (as long as ω = ±ωn)\nx + ωn\n2 x = a cos(ωt) has solution xp = a cos(ωt)\nωn\n2 - ω2\nsin(ωt)\nx + ωn\n2 x = b sin(ωt) has solution xp = b ωn\n2 - ω2\n3. What about x + ωn\n2 x = cos(ωnt)? What is a particular solution? What is\nthe general solution? Are there any solutions x(t) such that |x(t)| < 106 for\nall t? Are there any periodic solutions?\nA function is periodic if there is a number P > 0 such that f(t + P ) = f(t) for\nall t. Such a number P is then a period of f(t). If f(t) is a periodic function\nwhich is continuous and not constant, then there is a smallest period, often\ncalled the period.\n4. On the same set of axes, sketch graphs of sin(t), sin(2t). Then sketch the\ngraph of f(t) = sin(t) + sin(2t). Some pointers: f(t) is easy to evaluate when\none of the terms is zero. What is the derivative at points where both terms\nare zero? This information should be enough to let you make a rough sketch.\nWhat are the periods of these three functions?\n5. For what values of ωn is there a periodic solution to the equation\nx + ωn\n2 x = b1 sin(t) + b2 sin(2t)\n(where b1 and b2 are nonzero)? Name one if it exists.\n6. (very tricky) For what values of ω is sin(t) + sin(ωt) periodic? And the\nperiods?\nRecitation 13, March 18, 2010\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Fourier Series: Introduction (Solutions)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/4161da51f68f551c7c411e9733a88579_MIT18_03S10_rec_13_sol.pdf",
      "content": "Fourier Series: Introduction\n1. What is the general solution to x + ω2 x = 0? [Quick!]\nn\nThe characteristic polynomial is p(s) = s2 + ω2 , with roots ±iωn. The\nn\ngeneral complex solution is aeiωnt + be-iωnt, and the general real solution is\nx = c1 cos(ωnt) + c2 sin(ωnt).\n2. Discuss why (as long as ω =6\n±ωn)\nx + ωn\n2 x = a cos(ωt) has solution xp = a cos(ωt)\nωn\n2 - ω2\nx + ωn\n2 x = b sin(ωt) has solution xp = b sin(ωt)\nωn\n2 - ω2\nAssume ω = ωn, then the rst equation is the real part of the equation z +\na\nωn\n2 z = aeiωt. By the exponential response formula, z = ω2\niωt. Taking\nn-ω2 e\ncos(ωt)\nthe real part yields solution xp = aω2\n. Similarly, the second equation\nn-ω2\nis the imaginary part of the equation z + ω2 z = beiωt, which has a solution\nn\nb\n= b sin(ωt)\nz = ω2\niωt. Taking the imaginary part yields xp\nω2\n.\nn-ω2 e\nn-ω2\n3. What about x + ωn\n2 x = cos(ωnt)? What is a particular solution? What is\nthe general solution? Are there any solutions x(t) such that |x(t)| < 106 for\nall t? Are there any periodic solutions?\nAssume ωn = 0, otherwise the equation becomes trivial. Again we take the\ncomplex replacement of the equation and get z +ωn\n2 z = eiωnt. Since p(iωn) = 0,\np0(iωn) = 2iωn =6\n0, then by RERF, the particular solution is zp (t) = teiωnt .\n2iωn\nTaking the real part yields xp (t) = t sin(ωnt) . The solution of the homogeneous\n2ωn\nequation is given by problem 1, so the general solution of this equation is\nx(t) = t sin(ωnt) + c1 cos(ωnt) + c2 sin(ωnt).\n2ωn\nDue to the factor t in xp, any solution x (t) will exit the range (-106 , 106)\nwhen t is large enough. To see this, consider tk = 2k+1/2 π for k ∈ N. Then\nωn\nsin (ωntk) = sin (2kπ + π/2) = 1 and cos (ωntk) = cos (2kπ + π/2) = 0, so\nx (tk) = 2k+1/2 π + c2. Therefore for any c2, we can always choose suciently\n2ω2\nn\n2k+1/2\nlarge integer k , such that x (tk) =\n2ω2 π + c2 > 106. So there will be NO\nn\nsolution x(t) such that |x (t)| < 106 for all t.\nc1 cos(ωnt) + c2 sin(ωnt) is a periodic function with period 2π/ωn, but xp (t) =\nt sin(ωnt) is not periodic since the magnitude increases as t increases. So the\n2ωn\nRecitation 13, March 18, 2010\n\n(\ngeneral solution x(t) = xp (t) + c1 cos(ωnt) + c2 sin(ωnt) is not periodic. There\nis NO periodic solution.\n4. On the same set of axes, sketch graphs of sin t, sin(2t). Then sketch the\ngraph of f(t) = sin t + sin(2t). Some pointers: f(t) is easy to evaluate when\none of the terms is zero. What is the derivative at points where both terms\nare zero? This information should be enough to let you make a rough sketch.\nWhat are the periods of these three functions?\nsin t has period 2π, and sin(2t) has period π. Both sin t and sin (2t) will\nvanish at t = kπ for k ∈ Z. f 0 (t) = cos t + 2 cos (2t), so at those points,\n1, k odd,\nf 0 (kπ) = (-1)k + 2 =\nf (t) is a linear combination of sin t and\n3, k even.\nsin (2t), so its period is the least common multiple of the periods of sin t and\nsin (2t), i.e., 2π.\n5. For what values of ωn is there a periodic solution to the equation\nx + ωn\n2 x = b1 sin t + b2 sin(2t)\n(where b1 and b2 are nonzero)? Name one if it exists.\nConsider the complex replacement of the equation z +ωn\n2 z = b1eit +b2e2it. The\ncharacteristic polynomial is p(s) = s2 + ωn\n2 . By linearity, a solution to this\nequation is given by the sum of a solution to z + ωn\n2 z = b1eit and a solution to\nz +ω2 z = b2e2it. When ωn = 1, z +ω2 z = b1eit has the solution b1eit/ (ωn\n2 - 1);\nn\nn\nwhen ωn =6\n2, z + ω2 z =\nb2e2it has the solution b2e2it/ (ωn\n2 - 4). So if both\nn\nωn = 1 and ωn = 2 are satised, a complex solution of the original equation\nit\n2it\nb1e\nb\n2e\nb1 sin t\nb2 sin(2t)\nwill be ω2\n+ ω2\n. Taking the imaginary part yields xp = ω2\n+\nω2\n,\nn-1\nn-4\nn-1\nn-4\nwhich is a periodic solution with period 2π.\n6. (very tricky) For what values of ω is sin t + sin(ωt) periodic? And the\nperiods?\nWhen ω = 0, the function is simply sin t which is periodic with period 2π. Now\nassume ω = 0, then sin (ωt) is periodic with period 2π/ω. Since the period of\nsin t is 2π, then if sin t + sin (ωt) is about to be periodic, its period must be\n2kπ for some positive integer k ∈ N, which also has to be an integer multiple\nof the period of sin (ωt). Therefore if sin t + sin (ωt) is periodic, then there\nexist positive k ∈ N and positive n ∈ N, such that 2kπ = n 2π , i.e., ω = n/k.\nω\nOn the other hand, for any choice of a pair of positive integers k and n, set\n2kπ\nω = n/k, then sin t + sin (ωt) will be periodic with period (k, n) , where (k, n)\ndenotes the greatest common divisor of k and n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_01_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/45b4ee5cbaeb1056439243557f14f785_MIT18_03S10_rec_01_sol.pdf",
      "content": "Natural growth and decay, review of logarithm\nSolution suggestions\n1. Write down a model for the oryx population.\nTo x symbols, let's say at time t, the oryx population is x (t). Since the\nharvesting rate is a oryx(es) per year, let's assume t has unit year(s) and x (t)\nhas unit oryx(es). The natural growth rate is k, meaning that after some short\ntime Δt year(s) passes, we expect k x (t) Δt new oryxes to appear. However,\nmeanwhile the population is reduced by aΔt oryxes due to the harvesting.\nTherefore, we are led to\nx(t + Δt) ' x(t) + k x(t) Δt - aΔt,\nand the unit on both sides is oryx(es). If we let Δt approach 0, then we get\nthe dierential equation\ndx = kx - a.\ndt\n2. Suppose a = 0, what is the doubling time?\nWhen a = 0, the dierential equation becomes x = kx. To solve it, cross\nmultiply to get\ndx = k dt,\nx\nand then integrate both sides. We will get that ln x (t) = kt + c, where c\nkt.\n|\n|\nis a constant, and hence x (t) = ±ece\nTaking into account the missing\nsolution x ≡ 0, we can summarize that the general solution to x = kx is\ngiven by x (t) = Cekt, where C is a constant. In fact, C is the initial value\nx (0). Therefore, the doubling time is given by the time T when x(T ) = 2C,\nwhich is equivalent to ekT = 2 if C is not 0. Hence,\nln 2\nT =\n.\nk\n3. Find the general solution of this equation.\nIf k = 0, then we have x = -a, with solution x (t) = -at + C, with initial\nvalue C.\nIf k 6= 0, we do a variable substitution rst. Let u = x - a/k, so u = x . Then\nthe equation becomes u = ku, which has solutions u (t) = Cekt as we discussed\nin the previous question. Substituting back, we nd that x = u + a/k, or\nx(t) = Cekt + a.\nk\nRecitation 1, February 2, 2010\n\nThe initial value is x (0) = C + a/k.\n4. Check that the proposed solution satises the ODE.\nFor k = 0, we have x (t) = -a = kx - a.\nFor k = 0\n, we have x (t) = Ckekt = k(Cekt + a/k) - a = kx - a.\n5. There is a steady state (also known as constant, or equilibrium) solution.\nFind it. Does the way the solution depends upon k and a make sense? (That\nis: do the units come out right? Does it behave right when a is large, or small,\nand when k is large, or small?)\nThe constant solution is the one for which x ≡ 0. If k = 0, this only exists\nin the absence of harvesting, i.e., when a = 0, but then all solutions are\nsteady state. If k =6\n0, we have to solve: Ckekt ≡ 0, so C = 0. This means\nx (t) = a/k for all time t. In other words, x ≡ a/k is the steady state, which\nhas unit oryx(es) on both sides. Furthermore, this is equivalent to kx ≡ a.\nThe population is increasing by kx oryx(es) per year because of the natural\ngrowth, and decreasing by a oryx(es) per year due to the hunting. Intuitively,\nwhen the increasing rate is equal to the decreasing rate, the population\nis steady. Therefore, the way the steady solution depends on k and a makes\nsense.\n6. Graph the steady state solution and some others, and comment on what\nthey signify. The equilibrium is unstable. For initial values less than the\nequlibrium, the solutions stop having meanings in terms of this problem when\nthey become negative. (Of course, this is true for all initial values, but for\nsomewhat dierent reasons.) In that case, predict the time t0 at which oryxes\nwill be extirpated. For example, suppose that x0 is half the steady state: what\nis t0 (in terms of k)?\nFor initial oryx populations above a/k, the harvesting does not cancel out the\ngrowth, and the popluation increases without bound. For initial populations\nbelow a/k, the harvesting overtakes the growth rate, and the population goes\nto zero. If we let x0 denote the initial population, then we can nd the extinc-\ntion time using the following equations: x0 = x(0) = Ce0k + a/k = C + a/k.\nFor x0 < a/k, we have C = x0 - a/k < 0. Solving\nx(t0) = (x0 - a/k)e kt0 + a/k = 0\nfor t0, we have\na\nt0 =\nln\n.\nk\na - kx0\na\nWhen x0 =\n, t0 is given by ln 2 .\n2k\nk\nThe following are the graphs of x (t) when k = 2, a = 2000 and C =\n-1000, -500, 0, 500, 1000 respectively.\n\nFigure 1: x (t) = Ce2t + 1000\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/f1901b911223dcf75b6d4b21e2b40e1d_MIT18_03S10_rec_01.pdf",
      "content": "Introduction, natural growth and decay, review of logarithm\nAn African government is trying to come up with good policy regarding the\nhunting of oryx. They are using the following model: the oryx population has\na natural growth rate of k, and we suppose a constant harvesting rate of a\noryxes per year.\nTasks:\n1. Write down a model for the oryx population. [First step: choose symbols\nand units.]\n2. Suppose a = 0. What is the doubling time?\n3. Find the general solution of this equation.\n4. Check that the proposed solution satises the ODE.\n5. There is a steady state (also known as constant, or equilibrium) solution.\nFind it. Does the way the solution depends upon k and a make sense? (That\nis: do the units come out right? Does it behave right when a is large, or small,\nand when k is large, or small?)\n6. Graph the steady state solution and some others, and solicit comments on\nwhat they signify. The equilibrium is unstable. For initial values less than\nthe equlibrium, the solutions stop having meanings in terms of this problem\nwhen they become negative. (Of course, this is true for all initial values, but\nfor somewhat dierent reasons.) In that case, predict the time t0 at which\noryxes will be extirpated. For example, suppose that x0 is half the steady\nstate: what is t0 (in terms of k)?\n18.03 Recitation 1: February 2, 2010\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_02_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/d8031807cb4c49f9db099faa6d6cca8a_MIT18_03S10_rec_02_sol.pdf",
      "content": "Direction elds, integral curves, isoclines, separatrices, funnels\nSolution suggestions\n1. Draw a big axis system and plot some isoclines, especially the nullcline.\nUse them to illustrate the direction eld. Using the direction eld, plot a few\nsolutions.\nHaving done on paper, use a Java-capable browser, go to http://math.mit.edu/mathlets/mathlets\nand select the \"Isoclines\" applet. Set the equation to be y0 = x - 2y. Move\nthe m slider on the right to generate dierent isoclines (yellow lines), and click\non the axis system to plot the solutions (blue curves). Compare the results\nwith what you drew earlier.\n2. One of the integral curves seems to be a straight line. Is this true? What\nstraight line is it? (i.e., for what m and b is y = mx + b a solution?)\nYes, one of the curves is a straight line. The function y =\nis a solution\nx -\n). Therefore, m =\nto the equation, since y0 = 1\n2 = x - 2( 1\nand b = - .\nx -\n3. In general for the general dierential equation y0 = F (x, y) if a straight\nline is an integral curve, how is it related to the isoclines of the equation? What\nhappens in our example?\nIf a straight line is an integral curve, then it is part of the isocline for its slope.\nIn our example, the line in question 2 forms the entire y0 = 1\n2 isocline.\n4. It seems that all the solutions become asymptotic as x →inf. We will see\nlater that this is true, but for now, explain why solutions get trapped between\nparallel lines of xed slope.\nSince the isoclines have the form m = x - 2y, the isoclines are lines of slope\n, any solution through a point on this isocline must pass from\n. When m >\nthe region below the line to the region above it. In particular, no solution\ncan cross in the other direction. Similarly, when m < 1\n2, any solution through\na point on the y0 = m isocline must pass from the region above the line to\nthe region below it. Since the y0 =\nm\nm isocline has the form y\n, the\nx -\n, while the isoclines for m <\n=\nisoclines for m >\nlie below the line y = x -\nlie above it. This traps solutions between any two isoclines that surround the\nline y = x -.\n5. Where are the critical points of the solutions of y0 = x - 2y? How many\ncritical points can a single solution have? For what values of y0 does the\nsolution y with y(0) = y0 have a critical point? When there is one, is it a\nRecitation 2, February 4, 2010\n\nminimum or a maximum? You can see an answer to this from your picture.\nCan you also use the second derivative test to be sure?\nThe critical points of the solutions lie on the y0 = 0 isocline. Since this isocline\nis a line of slope 1 , any solution through a point on it must pass from the\nregion above it to the region below it. Therefore, these solutions pass through\nthe nullcline exactly once, so they have exactly one critical point. Solutions\nthat lie below the line y = 1 x - 1 always have slope greater than 1 , since the\nisoclines of lower slope lie above that line. These solutions, along with the line\ny = 1\n2 x - 1\n4 , have no critical points.\nA solution will have a critical point if and only if it lies above the line y =\n2 x - 4 , so the admissible values of y0 are those greater than -4 .\nAll of the critical points are minima.\nTo use the second derivative test, we take the derivative of both sides of the\nequation: y00 = 1 - 2y0. Since y0 = 0 at the critical point, we have y00 = 1. The\nsecond derivative is positive, so at least the critical point is a local minimum.\nHowever, for any solution that lies above the line y = 1\n2 x - 1\n4 , before it crosses\nthe line x - 2y = 0, y decreases since y0 < 0, and afte the crossing, y increases\nsince y0 > 0. Hence, the critical point is actually a global minimum\n6. For another example, take y0 = y2-x2. (This is on the Isoclines Mathlet.)\nAgain, make a BIG picture of some isoclines and use them to sketch the\ndirection eld, and then sketch a few solutions.\nSet the equation to be y0 = y2 -x2 in the applet, and follow the same procedure\nas in question 1.\n7. A separatrix is a solution such that solutions above it have a fate (as x\nincreases) entirely dierent from solutions below it. The equation y0 = y2 - x2\nexhibits a separatrix. Sketch it and describe the diering behaviors of solutions\nabove it and below it.\nYou can draw something resembling the separatrix in the applet by clicking\nnear the top right of the picture (e.g., click near (3.70, 3.84)). Solutions above\nit rapidly increase without bound. Solutions below it approach the lower right\nasymptote of the y0 = -1 isocline, which lies on the hyperbola y2 = x2 - 1.\n8. The equation y0 = y2 - x2 also exhibits a funnel, where solutions get\ntrapped as x increases, and many solutions are asymptotic to each other. Ex-\nplain this using a couple of isoclines. There is a function with a simple formula\n(not a solution to the equation, though) which all these trapped solutions get\nnear to as x gets large. What is it?\nSolutions below the separatrix approach the y0 = -1 isocline. This is a hyper-\nbola, whose lower right asymptote is the line y = -x + 1.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/d432af1b64b38585c9a5c060f00ec917_MIT18_03S10_rec_02.pdf",
      "content": "Direction elds, integral curves, isoclines, separatrices, funnels\ndy\nAn isocline of the dierential equation\n= F (x, y) is the solution set of the\ndx\nequation F (x, y) = m, for some xed m. A good way to create direction elds\nis to plot a few isoclines (especially the nullcline, where F (x, y) = 0). An\nintegral curve is the graph of a solution. At every point on an integral curve,\nthe slope of the tangent line is given by the value of F (x, y) at that point.\nAs an example, take the ODE y0 = x - 2y.\n1. Draw a big axis system and plot some isoclines, especially the nullcline.\nUse them to illustrate the direction eld. Using the direction eld, plot a few\nsolutions.\n2. One of the integral curves seems to be a straight line. Is this true? What\nstraight line is it? (i.e. for what m and b is y = mx + b a solution?)\n3. In generalfor the general dierential equation y0 = F (x, y)if a straight\nline is an integral curve, how is it related to the isoclines of the equation?\nWhat happens in our example?\n4. It seems that all the solutions become asymptotic to each other as x →inf.\nWe will see later that this is true, but for now explain why solutions get trapped\nbetween parallel lines of some xed slope.\n5. Where are the critical points of the solutions of y0 = x - 2y? How many\ncritical points can a single solution have? For what values of y0 does the\nsolution y with y(0) = y0 have a critical point? When there is one, is it a\nminimum or a maximum? You can see an answer to this from your picture.\nCan you also use the second derivative test to be sure?\n6. For another example, take y0 = y2-x2. (This is on the Isoclines Mathlet.)\nAgain, make a BIG picture of some isoclines and use them to sketch the\ndirection eld, and then sketch a few solutions.\n7. A separatrix is a solution such that solutions above it have a fate (as x\nincreases) entirely dierent from solutions below it. The equation y0 = y2 - x2\nexhibits a separatrix. Sketch it and describe the diering behaviors of solutions\nabove it and below it.\nRecitation 2, February 4, 2010\n\n8. The equation y0 = y2 - x2 also exhibits a funnel, where solutions get\ntrapped as x increases, and many solutions are asymptotic to each other. Ex-\nplain this using a couple of isoclines. There is a function with a simple formula\n(not a solution to the equation, though) which all these trapped solutions get\nnear to as x gets large. What is it?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_03_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/2ed47d1eda45f82d89e9416e3bbb5222_MIT18_03S10_rec_03_sol.pdf",
      "content": "Euler's method; Linear models\nSolution suggestions\n1. Use Euler's method to estimate the value at x = 1.5 of the solution of\ny0 = y2 - x2 = F (x, y) at y(0) = -1. Use h = 0.5. Recall the notation x0 = 0,\ny0 = -1, xn+1 = xh + h, yn+1 = yn + mnh, mn = F (xn, yn). Make a table with\ncolumns n, xn, yn, mn, mnh. Draw the Euler polygon.\nn\nxn\nyn\n-1\n1 0.5\n-0.5\n2 1.0\n-0.5\n3 1.5 -0.875\nmn\n-0.75\nmnh\n0.5\n-0.375\n2. Is the estimate from 1. likely to be too large or too small?\nIt is likely to be too large. One way of seeing this intuitively is to take the\nderivative of the equation, and note that y is negative on the points in question\n1. Since any tangent to a concave function lies above the function, this suggests\nthe Euler estimate is greater than the actual solution. To prove it, it suces\nto show that the slope eld always crosses the Euler approximate solution in a\ndownward direction, i.e., y' is at most the slope of the line segment connecting\ntwo successive points. You can do this by parametrizing the line segments,\nfeeding the points into the dierential equation to get y' as a function of x,\nthen comparing to the slopes of the line segments.\nFirst: y = x - 1 with slope 1, so y0 = y2 - x2 = (x - 1)2 - x2 = -2x + 1.\nWhen x ∈ [0, 0.5], -2x + 1 ≤ 1.\nSecond: y = -0.5 with slope zero, so y0 = y2 - x2 = 0.25 - x2. When\nx ∈ [0.5, 1], this is nonpositive.\nThird: y = -0.75x + 0.25 with slope -0.75, so y0 = y2 - x2 = -0.4375x2 -\n0.375x + 0.0625. We would like to compare this with -0.75 in the interval\n[1, 1.5]. At x = 1, we have equality, so it suces to show that the rst\nderivative of y0 on the segment, or y\" = -0.875x - 0.375, is nonpositive for\nx ∈ [1, 1.5], and it is.\n3. Here's a mixing problem. A tank holds V liters of salt water. Suppose\nthat a saline solution with concentration of c gm/liter is added at the rate of r\nliters/minute. A mixer keeps the salt essentially uniformly distributed in the\ntank. A pipe lets solution out of the tank at the same rate of r liters/minute.\nWrite down the dierential equation for the amount of salt in the tank. [Not\nRecitation 3, February 9, 2010\n\nthe concentration!] Use the notation x(t) or the number of grams of salt in\nthe tank at time t. Check the units in your equation! Write it in standard\nlinear form.\nThe concentration of salt at any given time is x(t)/V gm/liter, so for small\nΔt, we lose rx(t)Δt/V gm from the exit pipe, and we gain rcΔt gm from the\ninput pipe. The equation is x0(t) = rc - rx(t) , and in standard linear form, it\nV\nis\nr\nx0 +\nx - rc = 0.\nV\n4. Now assume that c and r are constant; in fact, assume that V = 1 and\nr = 2. Solve this equation, under the assumption that x(0) = 0. What is the\nlimiting amount of salt in the tank? Does your result jibe with simple logic?\nWhen will the tank contain half that amount?\nOur new equation is x0 + 2x - 2c = 0. We substitute: u = x - c, so u0 = x0 =\n-2x+2c = -2u. Solving gives us u = Ce-2t, and x = u+ c = Ce-2t + c. With\nthe initial value x(0) = 0, we have Ce0 +c = 0, or C = -c, so x(t) = -ce-2t +c.\nThe limiting amount of salt is c = cV gm, and that is what we should expect,\nsince the concentration should approach that of the inow. To get half the\nln 2\nsalt, we solve -ce-2t + c = c/2, which yields t = 2 .\n5. Now suppose that the out-ow from this tank leads into another tank, also\nof volume 1, and that at time t = 1 the water in it has no salt in it. Again\nthere is a mixer and an outow. Write down a dierential equation for the\namount of salt in this second tank, as a function of time.\nAssume the amount of salt in the second tank at moment t is given by y (t).\nWe use the equation for the rst tank, but the concentration of the inow has\nbecome x(t). The dierential equation for y (t) is\ny0 + ry - rx(t) = 0.\n6. Draw a picture of the circuit with a voltage source, a resistor, and a\ncapacitor, in series. Denote by I(t) the current (where the positive direction\nis, say, clockwise) in the circuit and by V (t) the voltage increase across the\nvoltage source, at time t. Denote by R the resistance of the resistor and C\nthe capacitance of the capacitor (in units which we will not specify)both\npositive numbers. Then\nRI + 1 I = V\nC\nSuppose that V is constant, V (t) = V0. Solve for I(t), with initial condition\nI(0).\nIt is common to write the solution in the form ce-t/τ . Calculate c and τ. Note\nthat τ is measured in the same units as t (in order for the exponent to be\ndimensionless). It is called the characteristic time for the system. What is\nI(t + τ) in terms of I(t)?\n\nTurn to EP page 173 for a picture of an electrical circuit, but the circuit in\nquestion 6 is without an inductor.\nWhen V is constant, the equation becomes RI + 1 I = 0, which is separable.\nC\nSolving gives us\nt\nI (t) = I (0) e- CR ,\nand c = I (0), τ = CR. I (t + τ) = ce- τ\nt e-1 = I (t) /e.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/21a92ea1df3a681eb70838b71d50426a_MIT18_03S10_rec_03.pdf",
      "content": "Euler's method; Linear models\n1. Use Euler's method to estimate the value at x = 1.5 of the solution of\ny0 = y2 - x2 = F (x, y) at y(0) = -1. Use h = 0.5. Recall the notation x0 = 0,\ny0 = -1, xn+1 = xn + h, yn+1 = yn + mnh, mn = F (xn, yn). Make a table with\ncolumns n, xn, yn, mn, mnh. Draw the Euler polygon.\n2. Is the estimate from 1. likely to be too large or too small?\n3. Here's a mixing problem. A tank holds V liters of salt water. Suppose\nthat a saline solution with concentration of c gm/liter is added at the rate of r\nliters/minute. A mixer keeps the salt essentially uniformly distributed in the\ntank. A pipe lets solution out of the tank at the same rate of r liters/minute.\nWrite down the dierential equation for the amount of salt in the tank. [Not\nthe concentration!] Use the notation x(t) for the number of grams of salt in\nthe tank at time t. Check the units in your equation! Write it in standard\nlinear form.\n4. Now assume that c and r are constant; in fact, assume that V = 1 and\nr = 2. Solve this equation, under the assumption that x(0) = 0.\nWhat is the limiting amount of salt in the tank? Does your result jibe with\nsimple logic? When will the tank contain half that amount?\n5. Now suppose that the out-ow from this tank leads into another tank, also\nof volume 1, and that at time t = 1 the water in it has no salt in it. Again\nthere is a mixer and an outow. Write down a dierential equation for the\namount of salt in this second tank, as a function of time.\n6. Draw a picture of the circuit with a voltage source, a resistor, and a\ncapacitor, in series. Denote by I(t) the current (where the positive direction\nis, say, clockwise) in the circuit and by V (t) the voltage increase across the\nvoltage source, at time t. Denote by R the resistance of the resistor and C\nthe capacitance of the capacitor (in units which we will not specify)both\npositive numbers. Then\nRI + 1 I = V\nC\nSuppose that V is constant, V (t) = V0. Solve for I(t), with initial condition\nI(0).\nIt is common to write the solution in the form ce-t/τ . Calculate c and τ. Note\nthat τ is measured in the same units as t (in order for the exponent to be\ndimensionless). It is called the characteristic time for the system. What is\nI(t + τ) in terms of I(t)?\nRecitation 3, February 9, 2010\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_04_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/57575889b3a13b25d9ff1124895b91f0_MIT18_03S10_rec_04_sol.pdf",
      "content": "First order Linear ODEs: Integrating factors\nSolution suggestions\n1. Around here, the ocean experiences tides. About twice a day the ocean\nlevel rises and falls by several feet. This is why small boats are often tied up\nto oating docks.\nA salt pond on Cape Cod is connected to the ocean by means of a narrow\nchannel. This problem will explore how the water level in the pond varies.\nIn roughest terms, the water level in the bay increases, over a small time\ninterval, by an amount which is proportional to (1) the dierence between the\nocean level and the bay level and (2) the length of the small time interval.\n(a) Write y(t) for the height of the ocean, measured against some zero mark,\nand x(t) for the height of the bay, measured against the same mark. Set up\nthe rst order linear equation that describes this model. What is the system\nhere? What part of the ODE represents it? What function is the input\nsignal? What is the output signal?\nWe are given that over a small time interval, Δx is proportional to (y - x)Δt.\nLet us call the proportionality constant k. Then our dierential equation is\nx0(t) = k(y(t) - x(t)). In standard form, this is\nx0 + kx = ky\nThe system is the bay (or salt pond), and its behavior is described by the left\nhand side. The input signal is the height of the ocean, and the output signal\nis the height of the bay.\n(b) Assume that the tide is high exactly every 4π hoursnot a bad approx-\nimation. Suppose that the ocean height is given by y(t) = cos(ωt) (in meters\nand hours). What value does ω take?\nWhen t = 0, cos(ω0) = cos 0 = 1 is a maximum, so the tide is high. The tide\nbecomes high again when cos(ωt) = 1 again, i.e., when ωt = 2π. At this time,\nt = 4π, so ω = 1/2.\n(c) Find a solution of your dierential equation using integrating factors. You\nmay nd the following integral useful, a consequence, you will recall, of two\nintegration by parts:\nˆ\ne kt cos(ωt) dt =\ne kt(k cos(ωt) + ω sin(ωt)) + c.\nk2 + ω2\nRecitation 4, February 11, 2010\n\nd\nWe want a function u such that ux0 + ukx = dt (ux). Solving u0 = ku yields\nd\nu = Cekt. Multiplying our dierential equation by u yields dt (ux) = uky, or\n-1\n\nx = Cekt\nCektky dt = e-kt\nektk cos(t/2)dt. Set ω = 1/2 in the integral\nabove, we then have\n2k sin(t/2) + 4k2 cos(t/2) + ce-kt\nx (t) =\n.\n1 + 4k2\ncos(t/2)-2k sin(t/2)\nTo check against the original equation, we dierentiate: x0 = k\n1+4k2\n-\ncke-kt, so x0 + kx = k cos(t/2)+4k2 cos(t/2) = ky.\n1+4k2\nFrom the standpoint of a physical model of tides, we may assume that c = 0 if\nk = 0, since otherwise, the solution in the distant past or distant future would\nbe unrealistically large. For the case k = 0 (no ow between the pond and\nocean), our equation becomes x0 = 0, so solutions are constant.\n(d) Your solution probably had the form a cos(ωt) + b sin(ωt) for constants\na, b. Find it a second time by subsituting this expression into the dierential\nequation and solving for a and b.\nLet's assume c = 0 from above. Then x = a cos(t/2) + b sin(t/2) and x0 =\n-a/2 sin(t/2) + b/2 cos(t/2). We nd that x0 + kx = (ak + b/2) cos(t/2) +\n(bk - a/2) sin(t/2) = k cos(t/2) = ky. When t = 0, we have ak + b/2 = k, so\nb = -2ka +2k. When t = π, we have bk - a/2 = 0, so a = 2bk = -4k2a +4k2.\nThen a =\n4k2 and b =\n2k .\n1+4k2\n1+4k2\n2. In Recitation 2 you studied the direction eld of the dierential equation\ny0 = x - 2y. Now nd the general solution of this equation analytically. In\nRecitation 2 you found a straight line solution. Does it occur within your\ngeneral solution? Plot it and several other solutions, using your expression for\nthe general solution. Do you have a funnel? Find the particular solution with\ninitial value y(0) = 1.\nWe use integrating factors: In standard form, y0 + 2y = x, so u = Ce2x.\nThen y = u-1\nux dx = e-2x\nxe2xdx. Integrating by parts yields\n\nxe2xdx =\nx e2x\ne2xdx = x e2x\n1 e2x + c. Therefore, y = x/2 - 1/4 + ce-2x.\n- 2\n- 4\nThe straight line solution occurs when c = 0. There is a funnel coming from\nthe exponentially decaying term.\n3. Recognize the left hand side as the derivative of a product in order to nd\nthe general solution of x2y0 + 2xy = sin(2x).\nWe see that (x2y)0 = x2y0 + 2xy. Thus, x2y = -2\n1 cos(2x) + c, and y =\ncos(2x)\ncx-2\n2x\n.\n-\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT18_03S10_rec_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-03-differential-equations-spring-2010/76ef4987494d7c2cde8534fba1154de1_MIT18_03S10_rec_04.pdf",
      "content": "First order Linear ODEs: Integrating factors\nReduced standard form: x (t) + p(t)x(t) = q(t), briey x + px = q\n(∗)\nd\nIntegrating factor: a function u(t) such that ux + upx =\n(ux).\n\ndt\nComputation: Thus pu = u , or u = e\np(t) dt\nd\nˆ\nMultiply (*) by u:\n(ux) = uq, so x = u-1\nuq dt\ndt\nThe general solution of (*) has the form x = xp + cxh where xh = u-1 is a nonzero\nsolution of the homogeneous equation x + px = 0.\n1. (a) Around here, the ocean experiences tides. About twice a day the ocean level rises\nand falls by several feet. This is why small boats are often tied up to oating docks.\nA salt pond on Cape Cod is connected to the ocean by means of a narrow channel. This\nproblem will explore how the water level in the pond varies.\nIn roughest terms, the water level in the bay increases, over a small time interval, by an\namount which is proportional to (1) the dierence between the ocean level and the bay\nlevel and (2) the length of the small time interval.\nWrite y(t) for the height of the ocean, measured against some zero mark, and x(t) for the\nheight of the bay, measured against the same mark. Set up the rst order linear equation\nthat describes this model. What is the system here? What part of the ODE represents\nit? What function is the input signal? What is the output signal?\n(b) Assume that the tide is high exactly every 4π hoursnot a bad approximation.\nSuppose that the ocean height is given by y(t) = cos(ωt) (in meters and hours). What\nvalue does ω take?\n(c) Find a solution of your dierential equation using integrating factors. You may nd\nthe following integral useful, a consequence, you will recall, of two integration by parts:\nˆ\ne kt cos(ωt) dt =\ne kt(k cos(ωt) + ω sin(ωt)) + c\nk2 + ω2\n(d) Your solution probably had the form a cos(ωt) + b sin(ωt) for constants a, b. Find it\nsecond time by subsituting this expression into the dierential equation and solving for\na and b.\n2. In Recitation 2 you studied the direction eld of the dierential equation y0 = x - 2y.\nNow nd the general solution of this equation analytically. In Recitation 2 you found\na straight line solution. Does it occur within your general solution? Plot it and several\nother solutions, using your expression for the general solution. Do you have a funnel?\nFind the particular solution with initial value y(0) = 1.\n3. Recognize the left hand side as the derivative of a product in order to nd the general\nsolution of x2y0 + 2xy = sin(2x).\nRecitation 4, February 11, 2010\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.03 Differential Equations\n\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}