{
  "course_name": "Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?",
  "course_description": "This course is an introduction to the cross-cultural study of biomedical ethics, examining moral foundations of the science and practice of Western biomedicine through case studies of abortion, contraception, cloning, organ transplantation and other issues. It evaluates challenges that new medical technologies pose to the practice and availability of medical services around the globe, and to cross-cultural ideas of kinship and personhood. Also discussed are critiques of the biomedical tradition from anthropological, feminist, legal, religious, and cross-cultural theorists.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Society",
    "African American Studies",
    "Gender Studies",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Society",
    "African American Studies",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nBio-medical researchers, physicians, and other health practitioners across the globe are constantly faced with the ethical challenges that new medical technologies provide. These technologies promote the health of individuals, and can protect and extend life. New biotechnologies force us to reconsider our notions of relatedness and the \"naturalness\" of the body. Many of these techniques raise questions about how we conceptualize life, personhood, and embodiment; sexuality, morality, and ethics; race and ethnicity; and kinship and gender in cross-cultural contexts. As these technologies travel across borders, they are interpreted and incorporated into existing sets of historical, political, and economic relations of power between nations, institutions, families, and individuals. At the same time, limited resources, worldwide disparities in access to care, and other moral constraints force researchers, doctors,\nand\npatients to make choices about the care that is sought and provided. This course will explore the way in which culture, religion, politics, and economics are among some of the factors affecting the politics of abortion, contraception, reproductive technologies, the availability of pharmaceuticals, end of life care, and others. These cases reveal the day-to-day ethical dilemmas in medical research and healing practices.\n\nCourse Structure and Requirements\n\nThe course will be run primarily as a seminar, with approximately 20 minutes of lecture to introduce each new section followed by presentations and discussion of the subject or ethnographic context under review.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation and reading preparation\n\n15%\n\nPresentations\n\n10%\n\nPapers (3)\n\n75%\n\nFor more information on the class activities, please see the\nAssignments\nsection.\n\nStatement on Academic Integrity\n\nIn this class you are to present your own original ideas, and oral and written work that has been completed without collaboration with others. Be sure to cite ideas that are derived from other sources accurately. If you have questions about how to cite sources properly, please consult\nAcademic Integrity at the Massachusetts Institute of Technology: A Handbook for Students (PDF - 1.4MB)\nor the instructor.\n\nRequired Texts\n\nBridges, Khiara M.\nReproducing Race: An Ethnography of Pregnancy as a Site of Racialization\n. University of California Press, 2011. ISBN: 9780520268951. [Preview with\nGoogle Books\n]\n\nLivingston, Julie.\nImprovising Medicine: An African Oncology Ward in an Emerging Cancer Epidemic\n. Duke University Press, 2012. ISBN: 9780822353423. [Preview with\nGoogle Books\n]\n\nRedfield, Peter.\nLife in Crisis: The Ethical Journey of Doctors without Borders\n. University of California Press, 2013. ISBN: 9780520274853. [Preview with\nGoogle Books\n]\n\nRoberts, Dorothy.\nKilling the Black Body: Race, Reproduction, and the Meaning of Liberty\n. Vintage Books, 1998. ISBN: 9780679758693.\n\nRoberts, Elizabeth F. S.\nGod's Laboratory: Assisted Reproduction in the Andes\n. University of California Press, 2012. ISBN: 9780520270831. [Preview with\nGoogle Books\n]\n\nWendland, Claire L.\nA Heart for the Work: Journeys through an African Medical School\n. University Of Chicago Press, 2010. ISBN: 9780226893273. [Preview with\nGoogle Books\n]\n\nFor additional readings, please see the table in the\nReadings\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "Guidelines for Reading and Discussion in “Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-302j-dilemmas-in-bio-medical-ethics-playing-god-or-doing-good-fall-2013/f4e9d6ba23dad287fb909956fd294ada_MIT21A_302JF13_Guidelines.pdf",
      "content": "Guidelines for Reading and Discussion in\n\"Dilemmas in Bio-Medical Ethics:\nPlaying God or Doing Good?\"\n21A.302J/WGS.271J\nR1-4\nE53-354\nFall 2013\nErica Caple James\n(Adapted with permission from Suzanne T. Lane's \"Guideline for Opening the Discussion in 'Black Matters'\")\nIn this class, you will each have an opportunity to help frame our understanding of the complex issues of bio\nmedical ethics through analysis of the course readings and summary of the class discussion. \"Framing\" the\ndiscussion means both opening and closing a class session. To introduce and conclude the class discussion, you'll\nneed to read the course material carefully and strategically. Strategic reading attends to how texts work-- to\nintroductions and conclusions, to structural patterns, to how central terms are defined, and to the relationship\nbetween claims and evidence. In these regards, texts in different disciplines work according to different principles.\nSuggestions for reading a text:\nSo how do you find the play of ideas in a text that might at first seem either straightforward or even confusing? As\nyou read, ask yourself these questions:\n- What is this writer's main claim? What is he or she trying to convince me of? (A brief statement of the\ntext's main idea is a great way to begin your introduction).\n- Who disagrees with this claim, and why? What counterarguments or alternative views does this writer argue\nagainst? (Highlighting these will help you identify what's at stake in the text's main idea, and help you\nunderstand how the ideas of one text relate to those of another).\n- What key concepts or terms does this writer use? What do they mean in this context? Do they seem clear\nand stable, or do they shift meaning throughout the text?\n- What structural patterns can you find in the text? How does the structure work with the text's main idea\n(or does it seem not to work with it)? What links different sections?\nSuggestions for oral presentations:\nWhen it is your turn to guide the discussion, you will give a brief background on the author(s) of the reading, a\nsummary of the main points, reflections on how the readings relate to previous material, and most importantly, to\ndescribe how your analysis of the reading(s) generates a set of 4 to 5 questions that you will provide for our\ndiscussion. Please prepare a short handout to be distributed to the class that will be emailed to the instructor no\nlater than 9 am the day of class.\nYour insights are welcome, as are your critiques. You are not expected to have complete and sophisticated answers\nin these presentations. Indeed, to launch the discussion effectively, it's often more useful to have sophisticated\nquestions.\n\nSuggestions for developing strong questions:\n- Good questions generally ask why some part of the reading takes the form it does or how its empirical\nexamples, claims from an argument, or other evidence might fit a concept or theory. Because they ask for\ninterpretation, \"how\" and \"why\" questions lead to higher order thinking (analysis, synthesis, comparison,\nevaluation) about the work and the issues it raises, and about how the specific claims or evidence from this\nwork link to those from the other readings.\n- Good questions are open-ended, meaning that they invite multiple responses. These kinds of questions\nrecognize that readers will have different perspectives and interpretations and such questions attempt to\nengage readers in dialogue with each other.\n- Good discussion questions are also specific--they don't try to ask about the text as a whole, but instead\nhighlight and isolate particular examples, claims, or passages and ask people to look at them closely and\ndraw connections between these passages and the rest of the work. Constructing strong questions depends\non a careful reading of the text.\n- They are also \"live\" questions, in that they are questions that you're really wondering about and grappling\nwith. A good starting point is to highlight intriguing, surprising, confusing, or contentious claims as you\nread. How are these claims supported and developed? How does the evidence fit the concepts or claims it\npresents? Where does this reading align with or seem to conflict with other readings from the class?\n- Good discussion questions are clearly stated. They do not need to be repeated or reworded to be understood.\n- A good guide in formulating discussion questions is to ask yourself if the question will stimulate debate,\narguments, and different opinions, and whether you yourself are looking forward to hearing what a variety\nof your classmates have to say in response. If so, it will probably be a good question.\nSuggestions for closing summary:\nAt the end of the class, the same presenter(s) will be expected to provide a brief report outlining the main points of\nour conversation, then assessing whether or not we answered the questions raised and what new issues the class\ngenerated for future discussion.\n- What ideas or issues from the text most captured the class's attention? Which claims from an article caused\nthe most confusion or questions?\n- What ideas developed in discussion? (perhaps a new understanding of a text's significance, or a new\ncounterargument, or a link between one text and another)\n- Who made interesting claims or asked good questions? Try to acknowledge your classmates' contributions\nby name. Everyone likes to be recognized, and citing your sources is a key feature of academic discourse.\n- What questions remain unresolved?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.302J / WGS.271J Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-302j-dilemmas-in-bio-medical-ethics-playing-god-or-doing-good-fall-2013/8713a424e221e4393c664465eb7d5990_MIT21A_302JF13_Paper_1.pdf",
      "content": "Dilemmas in Bio-Medical Ethics:\nPlaying God or Doing Good?\n21A.302J/WGS.271J\nFall 2013\nProfessor Erica Caple James\nPaper Topic #1\nByron Good and Mary-Jo DelVecchio Good both describe the way in which American\nbiomedicine is a materialist, scientific endeavor that not only constructs its object, the\nbody, through particular techniques and practices, but also constructs physicians in a\nprofessional realm that possesses its own moral order.\nClaire L. Wendland affirms, \"[a] substantial and high-quality body of research on the\nprocess of medical socialization ... seems to argue strongly for the existence--and\npersistence--of a durable moral order in medicine\" (21). Wendland also argues, however,\n\"the values that underlie medical science are far more culturally specific than previously\nunderstood, and therefore not consistently and inevitably reproduced across locations\nwhere medicine is taught and practiced\" (23-24).\nIn your ~2500 word paper (not including notes and the bibliography), compare and\ncontrast the medical socialization processes (and structural conditions of practice) between\nthe U.S. and Malawi, as described in the works of Good, Good, and Wendland. As you\nwrite, discuss to what extent biomedicine is a \"cultural product\" or a \"culture-neutral\ntechnology\" (Wendland 2010: 8).\nUse a standard citation style with (author date: page) citations in parenthesis (as above) and\ngive the full reference in a bibliography. Draw upon the introductory readings you have\nbeen studying to support your argument. Use the terms that we have been discussing if\nappropriate (i.e. the \"three bodies,\" \" \"medical/clinical gaze,\" \"clinician competence,\" the\n\"professional moral voice,\" \"habitus,\" etc.).\nGood luck!\nECJ\n(c) University of Chicago Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.302J / WGS.271J Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-302j-dilemmas-in-bio-medical-ethics-playing-god-or-doing-good-fall-2013/94e009d6f737710a7a403cef3ddcf760_MIT21A_302JF13_Paper_2.pdf",
      "content": "Dilemmas in Bio-Medical Ethics:\nPlaying God or Doing Good?\n21A.302J/WGS.271J\nFall 2013\nProfessor Erica Caple James\nPaper Topic #2,\nIn her poignant study of the emerging cancer epidemic in Botswana, Julie Livingston\nanalyzes how the moral economy of care arises from an historical context of colonialism,\nlocal understandings of embodiment, complex social relationships, and amidst enduring\npolitical, economic, and institutional fragility. She states the following:\nPaternalism, if we are to call it that, lies somewhere at the heart of\ninternational (now global) health--and it can be very dangerous. From the\nperils of medical experimentation to outright concern, at its worst, medical\npaternalism threatens to foreclose the types of lay questioning, critique, and\nself-determination that are necessary to check the tremendous power\nclinicians and policy-makers have over the sick. In recent debates, increased\npatient autonomy has been posited as progress, by those seeking rights as\npatients and by ethicists alike, as the proper response to the potential\nproblems posed by medical paternalism. Yet, in Botswana, a surging interest\nin technomedicine as progress has not been accompanied by an easy turn to\nautonomy (2012: 164)\nIn your ~2500 word paper (not including notes and the bibliography), craft an argument\nthat debates the extent to which \"medical paternalism,\" as you define it, can be a positive\nor negative factor that influences doctor/patient relationships, medical research and\nexperimentation, and the development and availability of medical technologies and\ntherapies.\nAs you build your argument, compare and contrast the historical and cross-cultural cases\ndiscussed in the readings from Oct. 3 through (and including) October 24. You may also\nuse the films to support your thesis. Do include a variety of cases that you analyze in depth\nthroughout the essay and give a strong conclusion.\nAs in paper 1, use a standard citation style with (author date: page) citations in parenthesis\n(as above) and give the full reference in a bibliography. Draw upon the theoretical and\nbioethical terms we have been studying to support your argument wherever appropriate\n(i.e. political economy of hope, medical/biological citizenship, habitus, autonomy,\ndisclosure, prognosis, etc.).\nGood luck!\nECJ\n(c) Duke University Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.302J / WGS.271J Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-302j-dilemmas-in-bio-medical-ethics-playing-god-or-doing-good-fall-2013/04b9624b2ac47a97354a89f3587a0b87_MIT21A_302JF13_Paper_3.pdf",
      "content": "Dilemmas in Bio-Medical Ethics:\nPlaying God or Doing Good?\n21A.302J/WGS.271J\nFall 2013\nProfessor Erica Caple James\nPaper #3 officially due 12/5 at 11:59 pm\nbut will be accepted until 12/13/13 at 11:59 pm without penalty.\nIn your final, ~2500-word, double-spaced paper, using standard citation style and\nincluding a bibliography, construct an essay that draws on specific, cross-cultural cases\n(see below) to make an argument that addresses the following questions:\nHow does an institution's perception/conception of a \"population\" shape the way\nthat medical practices and technologies are applied toward that population? How do\nculture, history, politics, and economics influence these dynamics? To what degree\ndo individuals have agency or power to resist or use technologies and interventions\nto further their own ends?\nIn your papers, write on each of the following topics: 1) the politics of reproduction\n(readings from October 31-Nov. 14 on pregnancy, abortion and contraception, and IVF\nand films) and 2) humanitarianism (Redfield book, James article, MSF film, etc.).\nProvide a strong thesis statement in your introduction, note the cases you will examine,\nand provide a strong conclusion. Define your terms as you use them. Please do not\nsimply answer each question above, but develop your own argument about bioethics,\nbiopolitics, and embodiment. I will be looking for a good critique of the readings and\ncourse materials in these papers.\nGood luck!!\nECJ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.302J / WGS.271J Dilemmas in Bio-Medical Ethics: Playing God or Doing Good?\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}