{
  "course_name": "Disease and Health: Culture, Society, and Ethics",
  "course_description": "This course examines how medicine is practiced cross-culturally, with particular emphasis on Western biomedicine. Students analyze medical practice as a cultural system, focusing on the human, as opposed to the biological, side of things. Also considered is how people in different cultures think of disease, health, body, and mind.",
  "topics": [
    "Humanities",
    "History",
    "History of Science and Technology",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course looks at medicine from a cross-cultural perspective, focusing on the human, as opposed to biological, side of things. Students examine the role of society and culture in sickness and healing, learning how to analyze and contextualize various kinds of medical practice. Particular emphasis is placed on Western (bio-) medicine; students examine the foundational premises of biomedicine and its understanding of disease, health, body, and mind. Students learn about medical institutions (e.g., hospitals, medical schools) and how they articulate with other institutions, national (e.g., pharmaceutical and insurance companies, Congress), and international (e.g., World Health Organization). Other topics include notions about symbolic healing (and harming), shamanism, organ harvesting, and new reproductive technologies.\n\nRequirements\n\nIn addition to doing all of the reading (approximately 100 pages a week), you will write three short (7+ pp.) papers on topics assigned during the semester. The first two will be returned to you for revision and re-read and graded at that point. There is no midterm or final exam. In addition to the formal papers, you will write a brief\nReader Response\nto one of the readings each week. These should be an actual\nresponse\nto the piece--your own reaction to it, rather than a summary or analysis. They should be posted on the course's site in the\nForum\nsection by 9:00 AM on the day of the class in which the reading is assigned. These are not graded, but they are required. Discussion of Reader Responses will constitute part of class discussion on Thursdays.\n\nLate papers lose a letter grade per day unless you have secured an written extension from me\nat least 24 hours prior\nto the due date, along with a new due date. Paper extensions can be obtained via e-mail.\n\nAttendance is\nrequired\n. The course's discussion component is crucial; you must come to class prepared to discuss the assigned reading. Do\nnot\ntake this course if you plan on cutting classes--you will receive a failing grade.\n\nGrading will be based as follows: participation in class discussion and reading response write-ups (collectively) 25%; each paper: 25%. Students will present a summary of their third paper in class at the end of the course. These oral presentations will not be graded.\n\nCriteria for HASS CI Subjects\n\nCommunication intensive subjects in the humanities, arts, and social sciences should require at least 20 pages of writing divided among 3-5 assignments. Of these 3-5 assignments, at least one should be revised and resubmitted. HASS CI subjects should further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation. In order to guarantee sufficient attention to student writing and substantial opportunity for oral expression, the maximum number of students per section in a HASS CI subject is 18, except in the case of a subject taught without sections (where the faculty member in charge is the only instructor). In that case, enrollments can rise to 25, if a writing fellow is attached to the subject.\n\nWarning: Plagiarism\n\nPlagiarism, presenting someone else's work as your own, comes in two forms, both extremely serious. The first involves using the words of a source, exactly or in very close paraphrase, without proper citation. If you are citing word-for-word, it does not suffice to footnote the source you must use quotation marks. If you are paraphrasing someone's work, you must fully cite the work,\nincluding the exact page number of the page on which the material appears.\nDo not think that just because work is \"in the public domain, \"on the Internet, etc., you do not need to provide a full citation. If it's someone else's work, then it's not your work and you need to fully cite the source.\n\nThe second form of plagiarism involves taking ideas from a source without footnoting the source.\n\nAlthough sanctions for plagiarism in this course depend on its severity, failing the course is a distinct possibility. I have failed students in the past; some have also had to appear before the Committee on Discipline. Bottom line: this course takes plagiarism very seriously. Suspicious papers receive immediate attention.\n\nIf you have questions about how to cite sources, see me. The readings for the course provide good examples of proper citation practice.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction to the Course\n\nIntroduction to Basic Issues\n\n\"Irrational\" Beliefs in Disease Causation and Treatment\n\n\"Irrational\" Beliefs, Continued\n\nSymbolic Healing and Harming\n\nThe Cultural Construction of Disease\n\nTheoretical Frames\n\nMeaning, Medicine, and Illness\n\nTopics for 1\nst\npaper discussed in class\n\nThe Institution(s) of Medicine I\n\nWatch:\nBack from Madness\n\nThe Institution(s) of Medicine II\n\nst\npaper due\n\nThe Institution(s) of Medicine III\n\nThe Institution(s) of Medicine IV\n\nst\npaper handed back\n\nWatch:\nDeadly Deception\n\nThe Institution(s) of Medicine V\n\nTopics for second paper discussed in class\n\nThe Institution(s) of Medicine VI\n\nRevised 1\nst\npaper due\n\nWatch:\nThe Search for Satan\n\nThe Institution(s) of Medicine VII\n\nHealth, Disease and Healing in the Larger Social Context I\n\nnd\npaper due\n\nWatch:\nSimple Courage\n\nHealth, Disease and Healing in the Larger Social Context II\n\nHealth, Disease and Healing in the Larger Social Context III\n\nnd\npaper handed back\n\nHealth, Disease and Healing in the Larger Social Context IV\n\nTopics for 3\nrd\npaper discussed in class\n\nHealth, Disease and Healing in the Larger Social Context V\n\nRevised 2\nnd\npaper due\n\nOptional: 3\nrd\npaper draft due\n\nStigma, Responsibility, and Blame\n\nThe Challenge of Chronic Illness\n\nOptional: 3\nrd\npaper draft handed back\n\nNew Reproductive Technologies\n\nWatch:\nThe Lynchburg Story\n\nNew Medical Technologies\n\nrd\npaper due\n\nStudent Presentations\n\nReports on Third Paper in class\n\nStudent Presentations (cont.)\n\nReports on Third Paper in class (cont.)",
  "files": [
    {
      "category": "Resource",
      "title": "New Reproductive Technologies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/b7034c6cc437d46a0b94056c288fed4c_MIT21A_215S12_lecture_23.pdf",
      "content": "New Reproductive Technologies 2012 10/9/2012\nNew Reproductive Technologies\n\nRead: Inhorn, \"Quest for conception: Gender, infertility, and Egyptian medical traditions\"\n\nRapp: \"Constructing amniocentesis: Maternal and medical discourses\"\n\nCussins: \"Ontological choreography: Agency for women patients in an infertility clinic\"\n\nI.\nThe issue of unwanted pregnancies\n\nA.\nBirth control\n\n1.\nOld technologies: condom, diaphragm\n\n2.\nNewer ones: the Pill, Intrauterine Devices (IUDs), Norplant\n\na.\nExample of roles played by institutions\n\n1)\nJudge in California giving crack-addicted\nmother of several neglected children the choice of Norplant\nfor 5 years or jail\n\na)\nLater was ruled unconstitutional\n\n3.\nAbortion\n\na.\nWhen pregnancy is unwanted\n\nb.\nWhen pregnancy is wanted, but not this\nembryo/fetus, following testing\n\n1)\nRayna Rapp was the first to study the social\nand cultural context of these new technologies\n\n2)\n\"Right to death\" issue in France--\"Right not\nto be born,\" \"wrongful birth\"\n\na)\n\nA legal matter using rights discourse:\nparents or child sue obstetrician for not providing\nenough information\n\n4.\nSterilization\n\na.\nAbused, used deceptively in this country and abroad\n\nb.\nLynchburg\n\n5.\nNew issues with birth control\n\na.\nIf a woman promised to use birth control and didn't,\nis this \"fraud\"?\n\n1)\nPretty funny given that men have been\ngetting women pregnant for centuries\n\n2)\nMost unwed mothers get no child support,\nnot much sympathy either, are seen as wanting sex but not\nwanting the pregnancy\n\n3)\nBut we do have the new phenomenon of\nunmarried women choosing to get pregnant\n\nB.\nAt the national level: state policy\n\n1.\nChina: One Child policy1\n\na.\nCoerced abortions\n\nb.\nDISCUSS: it was successful in slowing population\ngrowth\n\nAnn Anagnost, 1995. A surfeit of bodies: population and the rationality of the state in post-Mao China. In\nFaye D. Ginsburg and Rayna Rapp, eds., Conceiving the New World Order: The Global Politics of Reproduction.\nBerkeley: U. Calif. Press, 22-41.\n\n1)\nResulted in a skewed sex ratio\n\n2.\nOther countries: pro-natalist state policies; birth control practice\nperceived to be a problem\n\na.\nGreece: highest abortion rate in Europe2\n\n1)\nNot a problem of lack of education\n\n2)\nNor $$: birth control is free\n\n3)\n\"Selfish\" women denounced by government\n\nb.\nSimilar situation in Italy: government pronatalist\npolicies, denounces \"selfish,\" \"unpatriotic\" women\n\nc.\nN. Europe: policies offering inducements\n\n1)\nFrance: free day care\n\n2)\nMany countries: financial aid\n\nHeather Paxson, 2004: Making Modern Mothers: Ethics and Family Planning in Urban Greece. Berkeley:\nU Calif. Press. Alexandra Halkias, 2004. The Empty Cradle of Democracy: Sex, Abortion, and Nationalism in\nModern Greece. Durham: Duke University Press.\n\n3)\nSoviet Union: \"Mother Russia\" prizes to\nmothers of large families\n\nd.\nRomania under dictator Ceausescu (1974-1989): no\nbirth control available3\n\n1)\nVery pro-natalist regime\n\na)\nOrphanages bursting with children\nabandoned as newborn infants\n\n2)\nPolicy of \"strengthening\" these babies by\ngiving them blood transfusions\n\n3)\nMany became infected with HIV/AIDS\n\ne.\nNationalist fears about \"the wrong people\" increasing\n\n1)\nImmigrants, even third-generation ones\n(Turks in Germany, etc.)\n\n2)\nPhrases like \"they breed like rabbits\" crop up\n\nGail Kligman, 1995. Political demography: the banning of abortion in Ceausescu's Romania. In Faye D.\nGinsburg and Rayna Rapp, eds., Conceiving the New World Order: The Global Politics of Reproduction. Berkeley:\nU. Calif. Press, 234-255.\n\n3.\nOther institutions\n\na.\nCatholic Church against birth control and abortion\n\nII.\nWanted pregnancies\n\nA.\nArtificial insemination\n\n1.\nKnown about, practiced for a long time\n\na.\nAnimal breeding\n\n2.\nNew practices\n\na.\nUnmarried women, lesbians using it\n\n3.\nNew technologies\n\na.\nSelling sperm, marketing it\n\n1)\nDenmark: largest lab in the world\n\nb.\nGo online to find a donor\n\nc.\nDonor catalogues\n\n4.\nCultural, political context: fertility clinics in Israel\n\na.\nNotions of Jewishness as raced can be quite\npronounced among some groups of Jews\n\n1)\nSo there will be rulings, for instance,\nabout organ transplants\n\nb.\nSusan Kahn's book on the employment of new\nreproductive technologies in Israel4\n\n1)\nFascinating study of the centrality of\nreproduction in Judaism and Jewish culture\n\n2)\nThe state makes such treatments\navailable to all Israelis, even unmarried secular women\n\n3)\nOrthodox Jews are not supposed to participate\n\n4)\nBut question is asked, why not help\nOrthodox couples fulfill their dreams, to \"be fruitful and\nmultiply\"?\n\nKahn, Susan Martha, 2000. Reproducing Jews: A Cultural Account of Assisted Conception in Israel.\nDurham: Duke University Press.\n\na)\nHusband can cast off wife after 10\nyears of failure\n\n5.\nSperm of dead men\n\na.\nSaving sperm of men immediately following death\n\nb.\nLegal hassles: widow wants to become inseminated;\npartner hadn't given permission\n\nB.\nFertility clinics\n\n1.\nTechnologies to aid a couple having trouble\n\na.\nIVF (in vitro fertilization)5\n\n2.\nTechnologies involving more persons than the infertile couple\n\n3.\nUnlike maternity, which was thought to be unmistakable,\nestablishing paternity used to be difficult\n\na.\nRoyalty in England\n\nSarah Franklin, 1997. Embodied Progress: A cultural account of Assisted Conception. London:\nRoutledge. Sharon Redmayne and Rudolf Klein, 1997. Rationing in practice: the case of in vitro fertilisation. In\nGail E Henderson, Nancy M.P. King, Ronald P. Strauss, Sue E. Estroff, Larry R. Churchill, eds., The Social\nMedicine Reader. Durham: Duke Univ. Press: 475-480.\n\n1)\nRequirement that a court official witness the\nbirth to make sure infant did come out of the right\nwoman--no substitutions could be made\n\n4.\nNow that DNA tests establish paternity beyond the shadow of a\ndoubt\n\na.\nIt's maternity that's confused\n\n5.\nNow 3 kinds of mothers: egg donor, gestational surrogate, social\nmother\n\na.\nSocial mother differs from adoptive mother in that\nsocial mother will say things like she conceived the baby \"in the\nheart\"\n\n6.\nOur ideology has no problem with couples that want a child, and\nhave trouble getting pregnant or bringing a pregnancy to term\n\na.\nAnd use assisted reproduction--general idea is that\neveryone is entitled to have a child\n\n1)\nRemember eugenics movement?\n\nb.\nWhere the envelope is pushed as to who is entitled to get pregnant:\n\n1)\nPost-menopausal women\n\n2)\nFertility treatments but refusing selective\nabortion of \"extra\" embryos\n\n7.\nSurrogacy: problems and contradictions\n\na.\nCritics have claimed that surrogacy is a form of\n\"slavery\"\n\n1)\nPoor and third world women tend to be surrogates\n\n2)\nGujarat, India: illiterate peasant women stay\nin a dorm throughout pregnancy\n\na)\nTo monitor progress, make sure\nproper nutrition\n\nb)\nEgg often from Scandinavia, sperm\nfrom the husband\n\nc)\nCouples are usually American\n\n(1)\nCompanies offer\npackage deals that include airfare for 2 trips\nto India, with time for tourism\n\n(2)\nMuch cheaper than in USA\n\nd)\nWoman doesn't get the $$ for herself,\nit may go to pay for\n\n(1)\nTreating a family\nmember's illness, or a dowry\n\nb.\nOvertones of adultery: husband of surrogate mother\nhas to give up a lot\n\n1)\nSurrogate cannot have sex with her\nhusband--this is in the contract\n\n2)\nTraditionally the woman carrying a man's\nchild is supposed to be his wife\n\n3)\nIn one case, a client thought he was going to\nsleep with the surrogate\n\nc.\n\"Expenses\" and remuneration\n\n1)\nIn states that don't permit fees for surrogate\nmother, everyone else gets paid (clinic, lawyers)\n\n2)\nIt's often assumed that surrogate mothers do\nit for the money\n\n3)\nOpinions change when find out this isn't\nnecessarily true\n\n8.\nWhen things go wrong is when we see the workings of culture\nmost clearly\n\na.\nThe case of \"Baby M\"\n\nb.\nNowadays egg very seldom comes from the\ngestational surrogate--to avoid possibility of the surrogate making\nclaims\n\nc.\nThe \"child without a parent\" case\n\n1)\nJohn Buzzanca and Luanne Buzzanca pay\n\na)\nConception in a Petri dish using\nsperm and egg of anonymous donors, gestation by\nanother person\n\n2)\nWhen they divorced, John was ruled not\nlegal father, Luanne not \"entitled\" to be the legal mother\n\n3)\nAppellate court ruled against earlier\ndecision, saying that intention made them parents\n\nC.\nSelecting the kind of child\n\n1.\nBack to genetic testing\n\na.\nRapp's research6\n\nb.\nIssue of social pressures to abort in case of birth defects\n\n2.\nObstetrical ultrasound7\n\na.\nAbort unwanted embryos\n\nb.\nSex selection\n\n1)\nSerious consequences in India and China\n\n2)\nSkewed sex ratios not a problem in U.S.--\nparents choose male and female with equal frequency\n\n3.\nChoosing donor eggs--ads on MIT bulletin boards\n\nD.\nEmbryos\n\nRayna Rapp, 1997. \"Constructing amniocentesis: Maternal and medical discourses.\" In Louise Lamphere,\nHelena Ragone and Patricia Zavella, eds., Situated Lives: Gender and Culture in Everyday Life. London: Routledge:\n128-141.\nJanelle S. Taylor, \"Image of contradiction: Obstetrical ultrasound in American culture.\" In Sara Franklin\nand Helena Ragone, eds., 1998. Reproducing Reproduction: Kinship, Power, and Technological Innovation.\nPhiladelphia: U Penn. Press: 15-45.\n\n1.\nEmbryos conceived for the purpose of aiding a sibling with a\ndisease\n\na.\nCell transplants\n\n2.\nSelling embryos for \"adoption\"\n\na.\nCan even pick ancestry for $2,750\n\n3.\nImplanting embryos conceived with ex-husband, without his\nconsent\n\na.\nEmbryos in a divorce case: are they joint property\nor offspring?\n\n4.\n\"Designer babies\"\n\nE.\nCloning8\n\n1.\nWhen Dolly the sheep was announced\n\na.\nNewspaper article said \"men not needed anymore\"\n\nFinn Bowring, 2006. Therapeutic and reproductive cloning: A critique. In Elizabeth D. Whitaker, ed.,\nHealth and Healing in Comparative Perspective. Upper Saddle River, N.J., Pearson/Prentice Hall, 568-579. Source:\nSocial Science and Medicine, 58, 2004: 401-409.\n\nb.\nA very old theme (Amazons)\n\nIII.\nOther new medical technologies involved in reproduction\n\nA.\nFetal monitoring, etc., during labor\n\nB.\nDISCUSS: others?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 1 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/2dba6ed11486083a0e74c60ac08e55d5_MIT21A_215S12_lecture_01.pdf",
      "content": "Lecture 1 2012 10/09/12\n21A.215\nINTRODUCTION\n\nHousekeeping\n\nA.\nPass around list for students to fill out\n\nB.\nBooks\n\n1.\nFarmer, Luhrmann, Lock, Fadiman\n\nC.\nNature of course\n\n1.\nNo prerequisites\n\n2.\nLots of discussion\n\n3.\nFairly easy written assignments\n\na.\nA CI-H course\n\n4.\nBut a lot of reading\n\na.\nAs it says on the syllabus, you must do the reading\n\n5.\nThe syllabus may look like too much reading\n\na.\nI don't think it is, but in any case, students have told me to\nassign larger amounts of reading in the beginning, before everything\nstarted getting real scary\n\nb.\nReader responses are due each week--a few sentences, a\nparagraph, nothing you can't do in 15 minutes, after doing the\nreadings\n\n1)\nThey can be about any of the reading for that week\n\n2)\nBut they have to be about the reading--not\nabout lectures, your thoughts, etc.\n\na)\nYou can interact with each\nother--respond to something someone else has\nwritten\n\n3)\nStudy questions will be given to students\n\na)\nYou'll be asked to discuss any\none in class at random\n\nD.\nThrust of Course\n\n1.\nNext class will introduce the content of the course\n\n2.\nWe'll begin reading the Fadiman book\n\na.\nIs very readable, and introduces many of the issues we'll be\ndiscussing during the semester\n\nb.\nIn fact, it plunges you into them\n\n3.\nThen we'll explore the anthropological perspective on health and disease\nlooking at some cross-cultural materials\n\na.\nLook at causation (magic, witchcraft--symbolic causation)\n\nb.\nLook at the classic concerns in medical anthropology\n\n1)\nFor instance, about the role of ritual in healing,\nmorality, keeping the world in balance (preventive medicine)\n\nc.\nAt the links between religion (what is religion??) and ideas\nabout health and disease in a given culture\n\nd.\nAnd you'll be introduced to the art and science of healing,\ncross-culturally\n\ne.\nShamanic practice, for instance--mentioned in the Fadiman book\n\nf.\nSymbolic healing\n\ng.\nAlways with the goal of making links to modern medicine as\npracticed in the West\n\n1)\nFor example, what does shamanism share\nwith modern medicine and how do these two healing systems\ndiffer?\n\nh.\nI would like class to participate as much as possible\nwhenever cross-cultural issues come up and you have something to\ncontribute from your own culture\n\n1)\nFor example, one student brought newspaper articles on\nwitchcraft accusations in his country--Nigeria\n\n2)\nAnother student knew something of the\nAyurvedic tradition\n\n3)\nAnother student spoke of her parents healing her with\ntraditional Chinese herbal medicines\n\nE.\nThen we'll look at some theory: \"Theoretical Frames\"\n\n1.\nEasier to understand after you've had some orientation to just what medical\nanthropology is all about\n\n2.\nFor example, we'll begin talking about the notion of \"the cultural\nconstruction of disease\"\n\na.\nYou may be dealing with this topic in your first written\nassignment\n\nF.\nWe then look at issues of meaning\n\n1.\nWhat illness/disease/sickness means to the ill/sick/diseased and their families,\nand what it means to Western health care practitioners\n\n2.\nAnd introduce a theme present throughout the course:\n\na.\nThat we need to examine science itself as a system of knowledge,\nand understand how it is operationalized in medical science and\napplied in clinical medicine\n\n1)\nNeed to examine the concept of biomedicine: what it is, what\nmetaphors it uses, how it is passed on to the new generation,\netc.\n\nb.\nIn short, we will hold this branch of science up for scrutiny\n\n1)\nWe will not simply assume that it is \"the truth,\" but we will\ndeconstruct it, examine it, as it were, under the microscope\n\n2)\nThis is going to be a challenge for some of you\n\nc.\nWe will explore biomedicine's foundations\n\n1)\nFor example, mind-body dualism\n\nG.\nWe will continue to discuss cross-cultural cases throughout the course, but from this\npoint on, all of them will be illustrations of some kind of penetration by western\nmedicine into a traditional healing system\n\nH.\nWe then move to a section on medicine as an institutioin\n\n1.\nWe'll begin by looking at psychotherapy and its relation to \"somatic,\"\n\"physical\" medicine as well\n\n2.\nReading the Luhrmann book\n\n3.\nVery much illustrates medicine as an institution\n\na.\nThe preparation of physicians: interns, residents\n\nb.\nStudents have liked it in previous years--it's about people only a\nlittle older than they\n\nI. What does examining biomedicine as an institution consist of?\n\n1.\nYou can see from the titles of the readings what sorts of questions we'll ask,\nwhat contrasts we'll make\n\na.\nFor example, for you, what is the difference between \"curing\" and\n\"healing?\"\n\n2.\nWe'll discuss not just biomedicine narrowly defined, but our general cultural\nassumptions about the body, about how to live in a healthy way\n\n3.\nWe will be critiquing certain aspects of modern medicine\n\na.\nWith the goal of understanding how it is embedded in the larger\nsociety\n\nb.\nDiscussing very briefly some of the competing\nsystems\n\n1)\nHomeopathic medicine, chiropractic, etc.\n\nc.\nLearning some social science concepts\n\n1)\nAbout institutions in general\n\n2)\nAbout speech used in a hospital setting, about\ninstitutional self-protection, about how health care\ninstitutions interact with other institutions\n\nJ.\nWe'll then look at health, disease and healing in the larger social context\n\n1.\nLook briefly at some of the more problematic areas of medicine...where it is\nnot so successful or where policy, in particular bioethical policy haven't kept\nup with technological changes\n\na.\nMedical research on patients\n\nb.\nOrgan trafficking on a global scale\n\n2.\nWestern medicine in the international context\n\n3.\nSocial, political, economic factors affecting health status globally\n\n4.\nWe'll read the Farmer book\n\nK.\nThen we'll discuss stigma, responsibility, blame in the medical context\n\nL.\nFollowed by a brief look at gender, sexuality and reproduction, in particular new\nreproductive technologies\n\n1.\nInfertility, prenatal testing\n\nM.\nThe final section is on new medical technologies\n\n1.\nIllustrated by the Sharp book\n\nNow we'll go around the room, and students will introduce themselves.\n\nName, major, year. Why are you taking the course? Previous experience with\nanthropological topics? What topics would you like to discuss? Are you planning for a\ncareer in health care?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/3f5b3603eb9cfa99a3258c1b58165e6e_MIT21A_215S12_lecture_02.pdf",
      "content": "Introduction to Basic Issues 2012 10/09/12\nINTRODUCTION TO BASIC ISSUES\n\nReading for today: Fadiman 3-105\n\nThe concepts of disease and illness\n\nA.\nLet's make distinctions that will help us understand how our society (and others)\nunderstands unwanted states of body and mind--what I'll call \"disorders\"\n\n1.\nUnderstanding the illness/disease distinction will help us with our analysis\n\n2.\nWe will define \"illness\" as subjective lived experience of a disorder1\n\na.\nDISCUSS: examples of illness using this definition?\n\nb.\nIllness involves the appraisal , the assessment of bodily and mental\nprocesses as 1) normal and expectable, 2) abnormal, or 3) seriously\nwrong and requiring treatment\n\nc.\nIf we're looking at illness experience we must include the sick\nperson's judgments about how best to cope\n\nDiscussion of these terms found in Arthur Kleinman, \"What is specific to biomedicine?\"\nChapter 2 in Writing at the Margin: Discourse between Anthropology and Medicine. Berkeley:\nU Cal Press, 1995: 21-40.\n\n1)\nThese judgments, appraisals, are based on history...of\nprevious episodes, of what has been learned (in the family as\na child, in reading materials, on T.V.)...culture--you name it\n\n3.\nDisease\n\na.\nIs what the practitioner creates in the recasting of illness in\nterms of theories of disorder\n\n1)\nWhat they have been trained to see through the theoretical\nlenses of their particular form of practice\n\nb.\nThey have been socialized to be men or women, Americans,\nsoutherners, etc.\n\n1)\nBut then they are further socialized as practitioners\n\na)\nDISCUSS: examples of\npractitioner socialization...in our own society or\nothers\n\nc.\nThe biomedical model refigures disease only as an alteration in\nbiological structure or functioning\n\nd.\nDISCUSS: examples of diseases?\n\n4.\nKleinman pushes the distinction further:\n\na.\nBiomedicine presses the practitioner to construct disease--\nbiological processes--as the object of study and treatment\n\n1)\nTheir complaints are regarded as subjective\nself-reports, inherently biased accounts\n\n2)\nThe physician's task is to replace these\nbiased observations with objective data\n\na)\nVerified and verifiable measurements\n\nb)\nWhich are not considered to\ndepend on a given context to be valid, they are just\n\"true\"\n\nb.\nThe doctor is supposed to decode the untrustworthy story of illness\nas experience for the evidence of that which is considered authentic,\ndisease as biological pathology\n\nc.\nWe are seeing this happening in the Fadiman book\n\nd.\nBut this sort of reconfiguration does not happen in other healing\nsystems\n\n1)\nEven though in these other systems the health specialist\nknows things other people don't know, and can engage in\npractices regular people neither can know nor do, just like\nours\n\n2)\nEven though the practitioner may disagree\nwith the patient\n\n3)\nDISCUSS: examples of other healing systems?\n\n5.\nKleinman says when illness is recast as disease, something essential to the\nexperience of illness, especially chronic illness, is lost\n\na.\nBecause chronic illness is by definition not cured\n\n1)\nChronic illness presents a good foil for us to use to examine\nbiomedicine\n\n2)\nDISCUSS: examples?\n\n3)\nDISCUSS: In what ways does Lia have a\nchronic disease? An acute disease?\n\nB.\nBoth Arthur Kleinman and Robert Hahn (you'll read their work) distinguish\n\"sickness\" from both \"illness\" and \"disease\"\n\n1.\nThe understanding of a disorder in its generic sense across a population\n\na.\nIn relation to macrosocial (e.g., economic, political) forces2\n\nb.\nDISCUSS: examples?\n\n2.\nWhat is epidemiology? How does this notion of \"sickness\" similar to the\nnotion of epidemiology?\n\nC.\nBiomedicine\n\n1.\nKleinman: the \"radically materialist pursuit of the biological mechanism of\ndisease\"3\n\na.\nDISCUSS: what does \"materialist\" mean here?\n\nArthur Kleinman, 1988, The Illness Narratives: Suffering, Healing & the Human\nCondition. New York: Basic Books: 6.\nKleinman 1988: 9.\n\n2.\nDISCUSS: What are the positive elements of taking this perspective?\na\n\n3.\nDISCUSS: What might be some negative consequences?\n\na.\nOn the part of the sufferer, one negative consequence can be\na too intensely morbid preoccupation with painful bodily processes\n\nb.\nOn the part of the technician: a too technically narrow and\ntherefore dehumanizing vision of treatment\n\nAnalytic approaches I: Cause and effect\n\nA.\nDISCUSS: what causes AIDS?\n\n1.\nFirst we have to define the unit of study\n\na.\nIs it a single individual?\n\nb.\nA population?\n\nc.\nOr are we studying the history of a specific disorder?\n\nB.\nWhat does it mean to speak of a single, specific cause?\n\n1.\nDISCUSS: examples?\n\nC.\nExample 1: Exercise: what \"caused\" the Black Plague?\n\n1.\nA chain of causes: microbe, vector (flea), rats, deforestation\n\na.\nWhen are we talking about individual cases and when are we\ntalking about populations (epidemiology)?\n\n2.\nA student wrote a paper outlining how public health measures in plague-\nstricken England actually exacerbated the problem\n\na.\nShould this kind of public health measures be considered a\ncause? Or would we think of the cause as something else?\n\nD.\nExample 2: the introduction of the concept of \"battered child syndrome\"\n\n1.\nDeveloped by a physician, Kendall, in the early 1960s\n\na.\nThe introduction of the concept led to health care\nprofessionals being required by law to report suspicions of cases of\nchronically battered children\n\n1)\nIf, for instance, they found indications in X-\nrays of previous injuries\n\n2)\nThese lesions may have healed, but they\nindicated that the disorder was something bigger than the\npresenting problem emergency staff was to treat\n\nb.\nWe have here a more expansive definition of cause\n\n2.\nThe development of the concept of battered child syndrome is an example\nof medicalization\n\na.\nDefining a behavior or set of behaviors as a medical problem\n\n3.\nThe first time a claim was made that the state needed to pay attention to\nchild abuse occurred in the beginning of the 20th century\n\n4.\nThe line of argument held that, as children are animals, they deserve\nprotection just as much as other animals\n\na.\nThe SPCA (Society for the Protection of Animals) had\nscored some successes\n\n5.\nThe notion of child abuse had not been medicalized yet\n\nAnalytic approaches II: Meaning\n\nA.\nWhat is bubonic plague? AIDS? Battered Child Syndrome? What do these\ndisorders mean?\n\n1.\nA core meaning component in the West is the distinction between the\n\"natural\" and the social/cultural\n\n2.\nKleinman contends that:\n\na.\n\"...biological processes are known only through socially\nconstructed categories that constrain experience as much as does\ndisordered physiology\"4\n\nb.\nSuch processes have meaning; meanings are culturally\nderived\n\nB.\nExample: BODIES: What is the meaning of our body?\n\n1.\nDISCUSS: metaphors of the body?\n\n2.\nOne basic Western metaphor of the body is a machine, composed of\nphysical matter, and bounded by the skin\n\nKleinman 1988: 17.\n\n3.\nIn contrast:\n\n\"For...non-Westerners the body is an open system linking social relations to the self,\na vital balance between interrelated elements in a holistic cosmos. Emotion and\ncognition are integrated into bodily processes. The body-self is not a secularized\nprivate domain of the individual person but an organic part of a sacred, sociocentric\nworld; a communication system involving exchanges with others (including the\ndivine)\"5\n\n4.\nSome Australian Aborigines receive \"skin names\" following a person's\ntotem being \"embroidered\" into the skin through ritual scarification\n\na.\nDISCUSS: ways we inscribe \"social meaning\" onto our\nbodies?\n\n1)\nHow did the corset express values and\ninscribe them on the body?\n\n5.\nDISCUSS: Examples from Fadiman?\n\n6.\nDISCUSS: what in American culture resonates with this non-Western view?\n\n7.\nExample: for some, the individual pregnant woman is an organic part of a\n\nKleinman 1988: 11.\n\nlarger world, because the fetus and she are in a communication system\n\na.\nSome people see two humans inside of the pregnant\nwoman's skin\n\nb.\nPregnant women have been jailed for taking drugs or\ndrinking alcoholic beverages\n\nC.\nIllness always has moral meaning; does disease?\n\n1.\nDISCUSS: for example, do we see everyone as entitled to medical service?\n\na.\nThis was true--on the books, at least, and sometimes in\npractice--even in South Africa during apartheid\n\nb.\nWhat if people can't pay for it?\n\n2.\nIn this country we have very ambivalent attitudes toward this issue\n\na.\nSome people seem to be more entitled than others, a moral\nissue\n\nb.\nExamples in the media indicating people who are less\nentitled:\n\n1)\nPeople who have gone to prenatal genetic\ncounseling but decide to have the baby anyway, one who\nwill cost the state millions\n\n2)\nPeople who smoke or abuse alcohol and get sick\n\na)\nThere was a debate over\nwhether to provide the famous baseball player,\nMickey Mantle, with a liver transplant because his\ndiseased liver was produced by alcoholism\n\n3)\nDeciding who is entitled to dialysis machines for failing\nkidneys takes all kinds of factors into account\n\nD.\nMedicalization as a kind of meaning\n\n1.\nDISCUSS: examples?\n\na.\nAlcoholism; what was it before it was medicalized?\n\nb.\nPost Traumatic Stress Disorder\n\nc.\nTo what degree do we medicalize aging? Menopause?\n\n2.\nWe usually see medicalization as progress\n\na.\nWe no longer burn witches--we now have a separation of Church\nand state, we no longer believe in witches, and we see misfortune as\ndue to other causes\n\nb.\nWe have moved from a moral and religious explanation to a\nmedical one\n\nE.\nThe body/self dichotomy, and the mind/body dichotomy play a role in constructing\nthe meaning of illness\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/75bdfe8d5325956b001a54f08a82eb89_MIT21A_215S12_lecture_03.pdf",
      "content": "Irrational Beliefs I 2012 10/09/12\n21A.215\n\"Irrational\" Beliefs in Disease Causation and Treatment I\n\nI.\nSymbolic healing (and harming)\n\nA.\nFadiman notes: \"I was suspended in a large bowl of Fish Soup. Medicine was\nreligion. Religion was society. Society was medicine.\" (p. 60)\n\n1.\nDISCUSS: contrast with Western medicine\n\n2.\nOther readings will provide similar examples from other societies:\nthe Wikan article about Bali is one\n\nB.\nWe need to talk about symbolic healing in order to understand how medicine\nmight be religion, religion might be society and society might be medicine\n\n1.\nDISCUSS: examples of symbolic healing and harming?\n\nC.\nBiomedicine's premises hold that symbolic healing and harming cannot occur\n\n1.\nThat what appears to be symbolic healing/harming is in fact\nhealing/harming through another mechanism\n\na.\nOr the conclusion is drawn that in fact a physical, organic\npathology is absent--the cause is psychiatric pathology of some sort\n\n2.\nRemember, when we speak of biomedicine's premises, we are discussing a\nphilosophical system: a set of assertions based on underlying premises\n\na.\nNot necessarily what actually happens in medical practice\n\n1)\nNot necessarily what individual physicians\nand nurses think and do\n\nb.\nNot necessarily what we in this room believe actually\nhappens in a given illness episode and treatment\n\n1)\nProbably none of us accept\nbiomedicine's premises 100%\n\nc.\nAnd there's a huge amount of research using\nmethodologies acceptable to biomedicine\n\n1)\nThat shows that the final cause of an organic\npathology is, in fact, symbolic\n\n3.\nDISCUSS: examples you have heard of?\n\n4.\nSymbolic healing/harming cannot be biomedical healing/harming because it\noccurs through symbols, and by definition symbols are not physical,\nmaterial\n\na.\nSymbols have meaning only by being interpreted\n\nb.\nThey have no existence \"out there\"\n\n1)\nIf a symbol is divorced from a given culture and language, it\nloses its meaning and disappears\n\n2)\nNote that not all symbols are verbal\n\na)\nDISCUSS: examples of non-verbal symbols?\n\n3)\nBut all symbols, by definition, are meaningful\n\nc.\nBiomedicine holds that biological, chemical and physical processes\ndo not depend on cultural interpretation to make them agentive--\nable to cause harming or healing\n\n4.\nExamples in our own culture of statements based on beliefs about symbolic\nhealing/harming:\n\na.\n\"Step on a crack, break your mother's back\"\n\nb.\n\"He's a pain in the neck\"\n\nc.\nGod sent the illness\n\n5.\nSuch explanations of causes of harm find no comfortable place within\nbiomedicine, because they do, at some stage, depend on symbols\n\na.\nWe can medicalize these explanations a bit\n\n1)\nWe can say that stress from interacting with that horrible\nperson produces my pain in the neck\n\n2)\nHere stress is medicalized\n\n3)\nBut we still can't biomedically account for\nhow hearing and observing another person, entirely through\nsymbols, produces the physical symptoms\n\na)\nBiomedicine cannot account for\n\"psychosomatic\" disease, even though medicine\ndiagnoses it and treats it all the time\n\n4)\nClinical medicine in general concerns itself\nwith the proximate causes of illness or wellness, and not\nwith more distal ones\n\nb.\nGod sending an illness, or death, is not an acceptable\nexplanation within biomedicine\n\n1)\nAlthough many people, including physicians,\nbelieve that God does act in the world\n\nc.\n\"Step on a crack\" makes us giggle\n\n1)\nThe implied etiology is a form of magic, and\nbiomedicine doesn't accept magic\n\n2)\n\"Etiology\" means cause of a disorder\n\nD.\nNo other healing/harming philosophical system postulates a human body that is so\nmechanical, so biological, so bounded, and so secular. Remember Kleinman's\npoint:\n\n\"For...non-Westerners the body is an open system linking social relations to\nthe self, a vital balance between interrelated elements in a holistic cosmos.\nEmotion and cognition are integrated into bodily processes. The body-self\nis not a secularized private domain of the individual person but an organic\npart of a sacred, sociocentric world; a communication system involving\nexchanges with others (including the divine)\"1\n\nKleinman 1988 Illness Narratives: 11.\n\nE.\nWe use the labels like \"superstition,\" \"religion,\" \"magic,\" etc., to characterize other\nphilosophical systems that explain the causes of unwanted conditions and provide\nways to restore health\n\nIII.\nReligious and Symbolic Etiology and Healing\n\nA.\nDISCUSS: what is religion?\n\nB.\nAnthropological characterization:\n\n1.\nFirst: it explains the world: how it works, how it began, what it means\n\na.\nIt confronts and explains death\n\n2.\nSecond: it provides a code for moral behavior\n\n3.\nThird: it provides a framework for feelings, experiences we consider\nspiritual or religious\n\na.\nTranscendence, ecstasy\n\nb.\nAttaining spiritual self-hood\n\nC.\nThese general characteristics of religion have hypothesized functions embedded in\nthem (I'm giving the outsider, anthropological view, not an insider's view)\n\n1.\nWhat are these hypotheses? The most frequently cited ones are\npsychological:\n\na.\nThat humans need an explanation of the world, and hence\nreligious beliefs appeared\n\nb.\nThat we need a code for conduct, and sanctions\n\n1)\nThat such a code functions to keep people on the straight and\nnarrow because they are afraid of the consequences if they\ndon't\n\nc.\nThat we have psychophysiological needs to feel and express\ncertain emotions, and religion functions in this manner\n\n2.\nOther functions that scholars have hypothesized:\n\na.\nThat religion reduces anxiety by explaining the unknown\n\n1)\nIs reassuring: supernatural aid will be available in times of\ncrisis\n\nb.\nThat by providing notions of right and wrong, religion helps to\nregulate, organize, and structure relationships and expectations\n\n1)\nAlso to regulate change: for example, the seasons, the stages\nof an individual's life\n\n2)\nAnd to prevent or enhance some changes:\nrainmakers, prayers for good harvests, prayers to stop\nplagues\n\n3)\nBoth psychological and social functions are\ncontained in these hypotheses\n\nc.\nThat religion serves to justify certain actions, like punishing children\nor wrongdoers\n\n1)\nReligion can take the burden of decision-making from\nindividuals to supernatural powers\n\nd.\nThat religion builds social solidarity in a number of ways\n\ne.\nThat religion reinforces the status quo--the current system\n\n1)\nOne school of thought says that a given religion is a mirror\nof that society\n\na)\nSupernatural beings do have\nan uncanny way of resembling (sometimes by being\nthe opposite) our assumptions about what people are\nlike\n\n(1)\nThey have familiar human lusts, jealousies\n\n(a)\nThink of Greek myths\n\n(b)\nGod is often spoken of as having\nhuman-like emotions\n\n(c)\n\"For I thy God\n\n2)\nExceptions to this function of reinforcing the\nstatus quo:\n\na)\nNew religions, millenarian religions always\nchallenge the status quo\n\nD.\nWhat does religion consist of in terms of behavior, events?\n\n1.\nRituals--prayers, songs, dances, offerings, sacrifices\n\na.\nPeople try to manipulate supernatural beings and powers\n\nb.\nThese can be gods or goddesses, ancestral ghosts and other\nspirits, or impersonal powers\n\n1)\nDISCUSS: examples in Fadiman?\n\n2.\nReligious specialists\n\na.\nPriests, priestesses, shamans\n\n1)\nPriests are full-time specialists\n\na)\nYou need a complex enough\nsociety for this role\n\nb)\nSomeone else has to work to\nprovide the priest and priestesses with food, etc.\n\n2)\nShamans are often found in small-scale\nsocieties\n\na)\nShamans are seen to have\nspecial religious power, acquired through their own\ninitiative, and special abilities to deal with\nsupernatural beings and powers\n\nb)\nIn particular: divination,\nhealing, reestablishing balance of the cosmos to\nprevent illness from happening\n\n(1)\nPriests do this, too\n\nc)\nAnother way to contrast the\ntwo is to say that the clients of shamans are humans\nwho enlist their help; the clients of priests and\npriestesses are deities\n\n3.\nLore, especially sacred lore, in the form of oral tradition (myths which are\nrecounted) or texts\n\nE.\nWhat's the difference between religion and magic? Here is one scheme:\n\n1.\nMagic does not depend on mediation by supernatural beings\n\na.\nI shoot 3 arrows into 3 rocks and say my incantation, and a\nman breaks out in boils\n\n2.\nContagious magic and sympathetic magic\n\na.\n\"Step on a crack, break your mother's back, step on a line,\nbreak your mother's spine\"\n\n1)\nIs an example of sympathetic magic\n\nb.\nMagic that uses nail clippings, hair (\"voodoo dolls\") is\ncontagious\n\n3.\nRelics that accomplish miracles (bones, pieces of wood) can have elements\nof both sympathetic and contagious magic--if they themselves accomplish\nthe healing, rather than a deity\n\n4.\nDISCUSS: How do you feel about clothing, etc., that once belonged to\nsomeone?\n\na.\nIf it has blood on it?\n\nb.\nOnly that it's dirty?\n\nc.\nOr is there a sense of \"contagion\" there as well?\n\nd.\nIf there is anything more to the feeling in addition to the\nsense of dirt\n\n1)\nThen we have an example of \"irrational\"\nbeliefs\n\n5.\nBut dislike and fear of dirt is rational, correct?\n\n6.\nIn fact, dirt is not a thing; it's a symbol\n\na.\nHair on butter, butter on hair\n\n1)\nNeither is dirty in itself; they become dirty\nwhen they become matter out of place\n\nb.\nDirt itself isn't dirty until it gets onto someone's clothes or\nskin--is out of place\n\n1)\nFirst page of Fadiman: \"The floor was dirt,\nbut it was clean.\"\n\nc.\nThink about spitting into a glass of water and then drinking it\n\nIV.\nMany people in the West don't accept biomedicine's radically disenchanted view of the\nworld and our bodies' place in it\n\nA.\nDISCUSS: examples?\n\n1.\nAlternative, complementary medicine is an example--those parts that are\nbased on faith\n\n2.\nHow many use astrology, or channeling for health concerns?\n\na.\nHuge numbers, in fact2\n\nV.\nBiomedical science's attempts to explain religion\n\nA.\nAn issue of Newsweek on science and spirituality showed how PET scanning\nreveals different areas of the brain becoming hyper or dormant when religious\nadepts achieve an altered state of consciousness\n\n1.\nScientists measured the brain function of nuns and the Dalai Lama when\nthey were experiencing cosmic oneness, or the dissolution of the body and\nself into the divine\n\n2.\nA perfect illustration of biomedicine's radically physical and secular\npremises\n\na.\nThose experiences are not produced by the divinity, the nun\nis not one with the universe, it's glucose levels\n\n3.\nThis article (and the research) is a good example of outsider vs. insider\nviewpoints\n\nSee Michael F. Brown, 1997, The Channeling Zone: American Spirituality in an Anxious\nAge. Cambridge: Harvard\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/48b48a7d6cddd434b66fcd3d435814d1_MIT21A_215S12_lecture_05.pdf",
      "content": "Symbolic Healing 2012 Brown, Ong, Csordas, Miner 10/9/2012\nSYMBOLIC HEALING AND HARMING\n\nRead:\n\nBrown:\nShamanism and its discontents\n\nOng: The production of possession: spirits and the multinational corporation in Malaysia\n\nCsordas: \"Elements of charismatic persuasion and healing.\"\n\nMiner: Body ritual among the Nacirema\n\nI.\nLourdes in southwestern France offers an example of religious, symbolic healing\n\nA.\nDivine intervention--St. Bernadette had a vision of the Virgin Mary\n\n1.\nThe pilgrimage has been going on since 1858\n\n2.\nThe initial vision said nothing about the spring‟s healing powers\n\nB.\nToday\n\n1.\nLourdes receives over 2 million visitors annually, including over 30,000\nsick\n\n2.\nAs happens with other forms of religious healing, cures validate it, but\nfailures cannot disprove it\n\n3.\nPilgrims are the chronically ill who, usually, fail to respond to medical\nremedies\n\na.\nThey experience despair, their lives are severely disrupted\n\nb.\nThe decision to travel changes their lives: their families are\nenergized, money is raised, perhaps by an congregation, the\npreparation and journey are a dramatic break in routine\n\nc.\nExcept for the initial cures in the 19th century, Lourdes has failed\nto cure those living in its vicinity\n\nd.\nUpon arrival, pilgrims are plunged into a \"city of pilgrims\"\n\n1)\nPrevious cures are all that is talked about, there is evidence\neverywhere--discarded crutches, etc.; the ritual begins with\na validation of the shrine‟s power\n\n2)\nDays are filled with trips to the grotto and religious services\n\n3)\nGroup processions can be as large as 40 or 50 thousand,\npraying for others\n\na)\nThe majority of sick do not experience a cure, but\nmany say they feel better; clearly there are\npsychological benefits from the experience\n\nb)\nOne gains merit by making the trip: \"The trip to\nLourdes is never made in vain\"\n\nc)\nThose who help who are not sick gain merit\n\nC.\nIn the Church‟s view, \"miraculous\" healings at Lourdes are few: less than 100--\nthey require stringent documentation\n\n1.\nBut there are well-documented cures\n\n2.\nNote that inexplicable cures of serious organic disease occur in everyday\nmedical practice; any physician can provide examples\n\n3.\nAt Lourdes, healing takes place as it does elsewhere\n\na.\nNo one regrows an amputated limb\n\nb.\nThe paralyzed may get up and walk, but weight gain takes\nplace over weeks, any restored skin is scar tissue, etc.\n\nD.\nA great deal of literature disputes these cures\n\n1.\nBecause it is assumed that to accept them means one has to believe what\nCatholic theology says is happening.\n\nE.\nBut Lourdes shows parallels with religious healing elsewhere:\n\n1.\nSuch healing involves a coming together of the patient, his/her family, the\nlarger group, and the supernatural world by means of a dramatic,\nemotionally charged, aesthetically rich ritual that expresses and reinforces\na shared ideology\n\n2.\nDISCUSS: compare to Brown‟s discussion of Aguaruna shamanic healing\n\n3.\nDISCUSS: compare to Csordas‟s account\n\nII.\nMethods of symbolic healing often highlight:\n\nA.\nThe close interplay of bodily systems and emotional states\n\nB.\nThe intimate relation of both body and mind to health and illness\n\nC.\nThe parallel between inner disorganization and disturbed relations with one‟s\ngroup (or a disturbed cosmos, etc.)\n\nD.\nSuch methods indicate how a patterned interaction between patient, healer, and\ngroup, within the framework of a local set of assumptions, can promote healing\n\n1.\nAll the articles for today provide illustrations of symbolic harm and\nhealing\n\na.\nIn all of them, the supernatural is clearly involved\n\nE.\nThe above assumptions about symbolic healing continue in modern society,\nalthough transformed\n\n1.\nAlthough if you assume a very \"outsider\" position, as Miner does, you\nwill conclude that the Nacirema reveal very strong underlying beliefs\nabout symbolic harm and healing, much of it supernaturally caused, or at\nleast influenced\n\nF.\nThese healing systems often co-exist with naturalistic treatment: herbs,\nmanipulations, surgical operations\n\n1.\nAnd co-exist with the local version of biomedicine\n\n2.\nCsordas‟s 2 case studies: ECT and psychiatry are chosen\n\nIII.\nCharacteristics of etiology, diagnosis, and treatment in systems that stress symbolic\nhealing and harming:\n\nA.\nThese belief systems tend to assume that illness is a misfortune involving the\nentire person\n\n1.\nThe consequences have to do with the sick person‟s relationships with the\nspirit world and other members of the group\n\n2.\nIllness classifications often bear no resemblance to those of Western\nmedicine\n\na.\nIn particular, these systems don‟t distinguish sharply between\nmental and bodily illness, or between illnesses due to natural\ncauses and those due to supernatural causes\n\n1)\nBoth natural and supernatural causes can contribute\n\nB.\nAnthropologists often interpret such sicknesses as symbolic expressions of\ninternal conflicts or disturbed relationships to others (or both)\n\n1.\nDiagnoses of soul loss, possession by an evil spirit, magical insertion of a\nharmful object by a sorcerer, machinations of offended or malicious\nancestral ghosts\n\n2.\nOften it‟s assumed that the patient laid her/himself open to these\ncalamities through some witting or unwitting transgression against the\nsupernatural world\n\na.\nDISCUSS: Examples from Ong? Fadiman? Csordas?\n\n3.\nOr through incurring the enmity of a sorcerer or other enemy who\nemployed a sorcerer\n\na.\nBrown‟s essay\n\n4.\nMaybe the transgressor wasn‟t even the sufferer, but a kinsman\n\nC.\nHow such illnesses are healed reveals underlying assumptions\n\n1.\nOftentimes there is an attempt to correct the disturbance, the dis-order\n\n2.\nCorrections, the restoration of order, may be carried out by shamans\n\na.\nAn intermediary between humans and the supernatural\n\nb.\nShamanic curing: usually a group is involved in the\ntreatment session, not just the curer and the patient\n\nc.\nThe shamans in the Ong and Brown articles perform public\nrituals\n\n1)\nCuring is restoring order: the shaman makes a place, a\ncommunity, \"safe\" again\n\nd.\nResponsibility falls, to some degree, on the individual\n\n1)\nThe Ong piece: those who unknowingly urinate on an\ninhabited site and fall sick are not as \"resistant\" as others\n\n2)\nOr they didn‟t eat any breakfast, so they‟re vulnerable\n\nD.\nThe group healing ritual\n\n1.\nMight be led by a religious practitioner, but what brings about healing is\ndifferent--the group itself is seen to do it\n\n2.\nMay involve ancestral or other spirits\n\n3.\nWe can find such rituals in many US churches\n\na.\nCharismatic Catholics, for example, described by Csordas\n\n4.\nRitual (public ritual) can be seen to involve members of a culture sending\nmessages to one another about their lives, the meaning of life, what‟s\nimportant, etc.\n\n5.\nAnd rituals accomplish things\n\nIV.\nSymbolic Harming: further discussion of \"Voodoo Death\"1\n\nA.\nSymbolic harm at the level of society--caused by society\n\n1.\nSociety is organized to communicate to everyone who is a member and who\nis not; who is alive and who is de facto dead\n\na.\nA form of shunning occurs--behaving as though the cursed\nindividual is already dead\n\n1)\nIt communicates that s/he is already socially\ndead\n\nB. Another famous article, \"Witchcraft explains unfortunate events\" by EE. Evans-\nPritchard, explains Azande (an African society) witchcraft, sorcery beliefs\n\n1.\nThis article is a good example of an attempt to find \"rationality\" in what\nappear to be irrational beliefs\n\na.\nThe system is logical except for its faulty premises\n\nWalter Cannon, 1942. \"„Voodoo‟ Death.\" American Anthropologist 44: 169-181.\n\nb.\nExamples of unfortunate events:\n\n1)\nAzande granaries are elevated\n\n2)\nPeople sit under them in the shade\n\n3)\nGranaries have a habit of collapsing\n\n4)\nSometimes they collapse on people, killing them\n\nc.\nAzande understand this cause-and-effect chain perfectly well\n\n1)\nBut why did this happen to my mother, why\ndid it collapse just when she‟s sitting under it?\n\n2.\nEvans-Pritchard looks for psychological and social explanations underlying\nsuch beliefs\n\na.\nOn the individual level: such beliefs reassure people there\nare reasons for unfortunate events\n\n1)\nThese beliefs, Evans-Pritchard argues,\nexplain the world--make sense of it\n\nb.\nSocietal level explanations proposed in the literature:\n\n1)\nA leveling mechanism: if a man finds three\nhoney-combs in one day, he will be accused of witchcraft\n\n2)\nSuch potential accusations, Evans-Pritchard\nargues, militate against a person striving very hard for\nsuccess because the possibility of accusations when one is\nsuccessful creates a \"leveling\" effect\n\n3)\nAnother explanation might be that conflict is\ndirected to outside the extended family via beliefs that a non-\nkin enemy is practicing witchcraft\n\na)\nThis explanation won‟t work\nfor some societies, where the person bewitching you\ncould be your in-laws, or even your close blood kin\n\n4)\nAnother hypothesis: accusations absorb latent\nhostilities (seen to be good for individual, good for society)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/9106316d4a4d1eeb4e2ada8acbe292a1_MIT21A_215S12_lecture_06.pdf",
      "content": "Cultural Construction of Disease 2012 10/12/2012\nThe Cultural Construction of Disease\nRead:\nFavret-Saada:\nUnbewitching as therapy1\nWikan:\n\nManaging the heart to brighten face and soul: Emotions in\nBalinese morality and health care\nDavis:\n\nThe cultural constructions of the premenstrual and\nmenopause syndromes\nI.\nThe Cultural Construction of Disease\nA\nWe have been looking at how other cultures construct disease\n1.\nAnd, more broadly, how they understand--\"construct\"--the body as\nsusceptible to disease\n2.\nThe Balinese construction of disease etiologies is radically different from\nours\nB.\nUnderstanding the notion of construction is difficult; but it is crucial for this\ncourse\n1.\nFollowing Hahn, the first writing assignment states that:\n\nSt. Therese of Lisieux is mentioned in Faavret-Saada's article. Lisieux is a\n\nThe culture of a society constructs the way...members think and feel about sickness\nand healing...members...are taught...about different sicknesses and their names,\ntheir characteristic symptoms and courses, their causes and mitigating circumstances,\ntheir cosmological and moral significance, and appropriate responses\nThe metaphor of construction suggests that reality is a structure of ideas built by\nsociety through social interaction that may include informal as well as formal\neducation. The reality constructed by society makes sense of the experience of\nsickness and healing to its members.2\n[text is found in your reading assignment for March 1]\nII.\nWays in which diseases are constructed\nA.\nWe are speaking about disease, not illness\n\n1.\nDisease is a concept we have in the West that is concerned with\nunderlying core physical pathology\n\nB.\nDiseases are constructed with respect to cause (etiology)\n1.\nWe see malaria as caused by a microbe\n2.\nEarlier it was thought to be unhealthy night air\n\na.\n\"Roman fever\"\n\nb.\nDISCUSS: other examples?\n3.\nBoth of these explanations of malaria are cultural constructions, even\nthough we see one as untrue, mistaken, and the other as correct, true\nC.\nIn what way can something we know to be true, real, and \"out there,\"--something\nthat is caused by an agent like a microbe--be spoken of as a construction?\n1.\nFirst, \"malaria\" is not a disease; it is a word, a word we use when speaking\nEnglish and certain other languages\na.\n\"Malaria\" refers to a disorder that happens in humans that\nresults from a chain of causes, and one link involves a microbe\nb.\nWhat we see under the microscope is an image produced by\na cultural artifact\n\n1)\nIt is not the \"thing\" itself, nakedly \"out there\" in the\nworld\nc.\nThe word points to, refers to, signals the \"thing\" that is \"out\nthere\"\nd.\nMalarial symptoms also point to, indicate, a disease, but we\ndon't see them as the disease itself\n2.\nWe know there is a particular biological cause; we know malaria's etiology,\nso we say we know\na.\nBut our knowledge is not total, and knowledge is in our\nheads; knowledge is cultural\n1)\nThe way we learned about it, the way we\ntalk about it, study it, treat it involve culture, even the way\nwe experience it when we're sick with malaria affect our\nknowledge\n2)\nWe cannot ever experience \"pure\" biology\nwithout culture mediating it\nb.\n\"Biology\" itself is another word that we use to refer to a set\nof ideas we have about the world\n3.\nAnother way to think of this approach is to consider how the knowledge\nwe have in 2010 will be thought of and discussed 100 years from now\n\na.\nProbably very similar to how we look at medicine as it was\npracticed 100 years ago\n1)\nPerhaps 100 years from now people will be\nseeing our understanding of malaria to be as outdated as we\nconsider the etiology of bad night air to be\nb.\nWe see medical knowledge in 1908 as being in part true, or\nat least on the right track, and in part false\n1)\nAnd we know that some of the mistaken\nideas aren't simply due to lack of knowledge\n\na)\nThe mistakes systematically\nreflect the larger context in which the knowledge\ndeveloped\nc.\nExample: historian of medicine Evelynn Hammonds' work\non the diphtheria epidemic in three US cities3\n1)\nBecause of racial prejudice, they handled the\nepidemic poorly because they didn't treat important\nsegments of the population who were contagious\na)\nWhen the vaccine was being introduced\n\n2)\nWe can say that the epidemic was, to some\ndegree, socially produced\n4.\nDo you now see why we have to say the cause of any disease is always\nculturally constructed?\na.\nThis doesn't mean the disease isn't real, that the cause isn't\nalso biological\nb.\nIt means that coming to understand things like disease\ncauses is a culturally mediated process\n\n1)\nBecause in all societies the culture constructs the\nway members understand what causes sickness and healing\n\n2)\nThey are taught about different sicknesses, their names, etc.\nc.\nIt's very important to get this straight\nd.\nConstruction does NOT mean imagined, invented,\nfabricated, incorrect, not acting in the actual world\nD.\nIn addition to etiology, notions about what constitutes a disease are cultural\nconstructions\n1.\nIs \"old age\" a disease? (\"He died of old age\")\n\na.\nNo. It won't be put on a death certificate\nb.\nBut we do see death as pathological\nc.\nAnd we do think of human bodies as dying at some point\n\"in the natural order of things\"\nd.\nThe last book we will read, by Leslie Sharp\n1)\nIs about changes in the cultural construction\nof death brought about by new technologies allowing\norgans to be harvested\n2.\nIs pregnancy a disease?\na.\nAgain, most would say no\nb.\nAnd yet we treat pregnant women very much like ill\npersons: pregnancy has been medicalized\n1)\nEspecially when we compare our approach\nto that of other cultures\n2)\nWhen a woman in labor arrives at a hospital,\nshe is immediately put in a wheelchair even though she\nmay be perfectly capable of walking\n\nc.\nDISCUSS: other ways pregnant women are constructed as\n\"sick\"?\n3.\nAs Davis illustrates, we treat menopause much more like a disease than\nhappens anywhere else\na.\nHormone Replacement Therapy was prescribed for tens of\nthousands of women until a large study revealed problems\nb.\nWe see menopause as an unfortunate physical condition,\nsomething debilitating that produces all kinds of disruptions in\nfunction in some women\nc.\nDavis notes the differences between our construction of it\nand Japan's\n4.\nIs a broken leg a disease?\n5.\nBirth defects?\n\na.\nDISCUSS: how are they like diseases, and how\nunlike?\nE.\nTreatment is also part of the cultural construction of a disease\n1.\nHow the Txiv Neebs in Fadiman diagnosed and treated Lia shows us how\nthe Hmong culturally constructed her malady\n\na.\nAnd about their overall understanding of treatment\n2.\nSome diseases in the West appear when a treatment is found\na.\nDavis discusses instances in which the treatment--usually\na medication--constructs the disease\nb.\nDISCUSS: examples?\n\n3.\nSome diseases are fully recognized as such even though we feel we don't\nknow enough about them, haven't discovered the perfect treatments\n\na.\nAIDS in the late 1980s\nb.\nDiabetes\nc.\nHeart disease\nd.\nCancer\n4.\nBut other ailments pose problems in treatment because they haven't been\nfully constructed into diseases\na.\nEither because we don't know what they are\n\nb.\nOr, because they don't (as yet) completely fall into the\n\"disease\" category\nc.\nDISCUSS: examples?\n1)\nAttention Deficit Hyperactivity Disorder\n2)\nGulf War Syndrome\n3)\nChronic Fatigue Syndrome\n4)\nFibromyalgia\nF.\nLessons from the past can be instructive here\n1.\nTourette's syndrome\na.\nEarlier it was sometimes seen as demonic possession,\nneeding exorcism\nb.\nSeen to indicate that the body and mind needed discipline\n1)\nResulting in horrible treatments\nc.\nBecause of lack of knowledge about the specific cause (e.g.,\na biological cause they could make sense of)\n\n2.\nDISCUSS: witchcraft as an etiology\nG.\nThe moral and even aesthetic aspects of a disease are also part of its cultural\nconstruction\n1.\nPregnancy is an altered physical state, it puts women at risk in many ways,\nbut in the abstract it is considered to be a desired state\na.\nClearly the medicines and devices to avoid it tell us that\neach instance of pregnancy, each possibility of it, is not always\ndesired\nb.\nSome pregnancies are desired by the parents but not society\nc.\nSo we chastise or temporarily sterilize those who we feel\nshouldn't be parents\nd.\nOne California judge said to a mother with a drug problem\naccused of child neglect, \"Norplant or you go to jail\"\n\n1)\nNorplant is a contraceptive inserted under\nthe skin on the upper arm; it works for 5 years\ne.\nEarlier, poor black women in the rural US South were\nbeing sterilized without their knowledge or consent\n1)\n\"Mississippi appendectomy\"\n\nf.\nThe mentally ill and retarded used to be sterilized\ng.\nAnd we will see in a video The Lynchburg Story that\nthousands of Virginians were sterilized because they were poor\nand deemed to be feeble-minded\n\n1)\nA kind of preventive medicine for future\ngenerations--eugenics\n2)\nThese operations happened in most US states\n3)\nI've posted a couple of newspaper articles\nabout these policies\n2.\nSexually transmitted diseases\na.\nA big part of their cultural construction is the moral\nopprobrium surrounding them\nb.\nWe'll see another video about syphilis research in rural\nAlabama on African Americans that required their remaining\nuntreated--and ignorant about this research requirement\nH.\nPreventive medicine practices derive from culturally constructed disease notions\n1.\nExamples?\n\na.\nVaccines\n1)\nMoral loading: \"Typhoid Mary\"\na)\nDirty, diseased, contagious\nb.\nThe fight over fluoride in the drinking water\nc.\nPolicies to prevent fertile women from working in factories\nwith toxic chemicals\n1)\nThat other kinds of workers are exposed is\napparently OK\nIII.\nWe all agree that diseases have underlying biological conditions\nA.\nBut in these papers, if you choose cultural construction (as opposed to social\nproduction) you are being asked to:\n1.\nLook at all the ways in which disease is not only that underlying biology,\nbut also a set of words, concepts, values embedded in a cultural, social,\npolitical context\n2.\nWhen choosing your paper topic, try to see yourself stepping back from\nyour notions of a disease as biological, physical, \"natural\"\n\na.\nAnd take an \"outsider\" position; become an anthropologist\nb.\nFor example, you can write about a disease outbreak that\nhappened long ago\n1)\nOne student did an excellent paper on how\nLondon responded to the bubonic plague\n2)\nThis was a paper on social production\nc.\nOr you can examine a disease by comparing its present\nconstruction with its construction in the recent past--how the\nconstruction has changed\n1)\nOne student did lung cancer\nd.\nOr you can examine constructions in progress\n1)\nGulf War Syndrome\n2)\nMultiple Chemical Sensitivity\nB.\nGo to the \"Supplementary Reading\" section on the class website for other\nexamples\n1.\nMarch 1 we'll discuss your topics\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/25de5fbd3cb979e7ecfedab799ab005e_MIT21A_215S12_lecture_07.pdf",
      "content": "Theoretical Frames Hahn 76-98, Scheper-Hughes and Lock, Katz 2012 10/09/12\nTheoretical Frames\n\nRead: Hahn, 76-98, \"The role of society and culture in sickness and healing\"\nScheper-Hughes and Lock, \"The mindful body\"\nPearl Katz: \"Ritual in the Operating Room.\"\n\nHow do we see bodies; how do other cultures see them? Lock and Scheper-Hughes' \"three\nbodies\"\n\nA.\nFirst: the individual body\n\n1.\nThis is the image we conjure up when we think of the body; the\nbody as experienced\n\n2.\nDISCUSS: \"Natural,\" \"Organic,\" \"Physical,\" \"Biological\"\n\na.\nHow is culture is inscribed on the body?\n\nb.\nIt lives in an environment that is highly social and\ncultural\n\nc.\nEven our notions of a \"natural\" body, \"natural\"\nfoods, are cultural constructs\n\nd.\nDISCUSS: are \"natural foods\" natural?\n\n1)\nOrganic foods?\n\n3.\nThe now-familiar Cartesian legacy\n\na.\nA dichotomy, an opposition that goes back to\nAristotle, even though the name refers to the 17th century\nphilosopher Descartes\n\nb.\nWhat was Descartes trying to do with his insistence\non visibility, palpability?\n\n1)\nRid medicine of its religio-magical thinking\n\n4.\nOur need to dichotomize, to think of things as opposites, is\npervasive\n\n5.\nDISCUSS: do we see ourselves as egocentric drives, impulses,\nwishes and needs that are opposed to the demands of the social and moral\norder?\n\n6.\nDISCUSS: do you see culture as something very different from,\neven opposed to, the individual/body?\n\n7.\nWhat is the cultural input to our emotions?\n\n8.\nExample of feral, \"cultureless\" children: the \"wild child\" of\nAveyron, a region in S. France (19th century)\n\na.\nThey were thought to be \"natural\" humans, with no\ncultural overlay\n\nb.\nSo by studying them we could find out about \"true,\"\n\"natural\" \"core\" humanity\n\nc.\nWhat they in fact were is pathological; what they\nillustrated is how much human babies and children depend on\ninteracting with other humans in order to develop properly\n\n9.\nOther cultural systems' ways of constructing the human body don't\nset up binary oppositions in this manner\n\na.\nE.g., the Chinese pair of yin and yang posit a\ncomplementarity, not opposition\n\nb.\nAgain, the theme of harmony, balance\n\nc.\nDISCUSS: does the West have anything comparable?\n\n1)\nThe human body as needing balance, harmony?\n\nd.\nNotions of Planet Earth, Mother Earth, the Gaia\nhypothesis, holism\n\n10.\nHow does this body reside in society?\n\na.\nSome well-known thinkers:\n\nb.\nFreud: saw the individual at war with himself: saw\nnatural, biological drives locking horns with the domesticating\nrequirements of the social and moral order\n\n1)\nDISCUSS: examples of this\nviewpoint in the West's cultural production? (plays, novels)\n\nc.\nMarx: what makes us human is producing our own\nmeans of subsistence\n\n1)\nAgain, a concern about what we do with our\nbodies\n\n2)\nLabor is seen to humanize, and domesticate nature\n\nd.\nDISCUSS: How do we see our selves as not\nbelonging to the body, as not belonging to nature?\n\n11.\nWe have already discussed how the Western concept of the self is\none with far more impervious, clearly demarcated boundaries--more\nsharply set off from the environment (physical and social)--than is the\ncase in many other cultures\n\n12.\nOur notion of human development as \"naturally\" being a process\nof separation, even estrangement from parents and other family members\n\na.\nThis is definitely not the way many other cultures\nunderstand child development\n\nb.\nWe focus on the individual: human rights are\nconceptualized in terms of individual rights\n\nc.\nWhereas, as Scheper-Hughes and Lock point out,\nthe tensions in Japan are between the state and the family, not the\nindividual and state or the individual and family\n\nd.\nIn Japan, one reason for not telling someone he/she\nis dying is that the death is a family matter, not something the\nindividual is going through\n\n1)\nSo why should the dying person\ndecide how it should proceed?\n\n13.\nThe permeable self\n\na.\nIn societies lacking a highly individualized or\narticulated conception of the body-self\n\n1)\nSickness is often explained or\nattributed to malevolent social relations or the breaking of\nsocial and moral codes\n\nb.\nIn healing, too, the patient is almost inconsequential\nsometimes\n\nc.\nDissociation and possession (going into trance)\n\nd.\nIn general, for us, the self needs to be present\n(except when sleeping), or something's wrong\n\ne.\nDISCUSS: Hypnosis\n\nf.\nDISCUSS: exceptions?\n\nB.\nSecond: the social and cultural body\n\n1.\nThe notion of \"natural symbols\"\n\na.\nMauss, a famous French anthropologist\n\n1)\n\"The body is the first and most\nnatural tool of man\"\n\nb.\nHow do we use our bodies to understand and\ndescribe our world?\n\n2.\nDifferent cultures utilize images of the body and its parts to\nrepresent other things\n\na.\nBowels, liver, backbone, blood\n\nb.\nReproduction is a very powerful, widely\nappropriated natural symbol\n\n1)\nDISCUSS: Birth1\n\na)\nExamples in the West?\n\nb)\n\"Ye must be born again\"\n\nc)\nFind the birth\nimagery in Christian baptism\n\nd)\nFor starters, godparents\n\n2)\nInitiates in many societies at certain\nstages of the ritual are treated like newborns in all kinds of\nclever ways\n\n3.\nA \"natural symbols\" analysis can go beyond the body, arguing that\nthe material world is the source for many meanings, metaphors\n\na.\nDISCUSS: why the color red \"naturally\" has such\npronounced symbolic importance cross-culturally\n\n1)\nArguments made in the literature:\n\nSee, for example, Warren Shapiro and Uli Linke, 1996, Denying Biology: Essays on Gender and Pseudo-\nProcreation. University Presses of America.\n\n2)\n#1: blood (the body as \"natural symbol\")\n\n3)\n#2: the color red occurs infrequently\n(\"natural symbol\" derived from scarcity in the environment)\n\n4)\n#3: optics--red lies at one end of the\nvisible spectrum\n\na)\nThis last explanation\nis the reverse of the \"natural symbol\" explanation\n\nb)\nHere it's the\nphysiology of the body that's seen to determine the\nphenomenon\n\n4.\nThe social and cultural body: the reverse: how we construct our\nbodies utilizing society and culture\n\na.\nDISCUSS: blood\n\n1)\nWhy is menstrual blood so evocative\nand assigned so much meaning?\n\n2)\nIn many places it's seen as dangerous, pollution\n\n3)\nWhere I did fieldwork in the\nNorthwest Amazon, among Tukanoans, menstrual blood is\nseen as a source of relative immortality for women\n\n4)\nLike snakes and insects who shed\ntheir skins periodically, Tukanoan women are seen as much\nhealthier because they shed an inner lining in the form of\nblood each month\n\n5)\nIn several societies men ritually\nimitate female menstruation and other reproductive\nprocesses\n\nb.\nDISCUSS: the corpse\n\n1)\nThink of all the reasons corpses are\nthought of as either dangerous or in need of control,\nelaboration\n\n2)\n#1: Sources of infection (our explanation)\n\n3)\n#2: Seeing a corpse is scary--will\nour group die out?\n\na)\nWe're reminded that we will\ndie someday\n\n4)\n#3: A corpse is liminal: betwixt and\nbetween (see below)\n\n5)\nDISCUSS: why, do you think, do\nsome societies practice ritual cannibalism?\n\n6)\nDISCUSS: what does our treatment\nof corpses tell us about ourselves?\n\n5.\nSo, the body can serve as a source for meanings or vice versa\n\n6.\nThe body as liminal\n\na.\n\"Betwixt and between\" phenomena are often seen\nas negative; sometimes positive\n\nb.\nVery frequently they are culturally elaborated,\nhighlighted\n\nc.\nThe corpse: a body without its owner is liminal\n\nd.\nParts of the body that were of the body but are now\ndetached are liminal\n\n1)\nBlood, milk, tears, semen, urine,\nsweat, excreta (feces), hair\n\nC.\nThe body politic\n\n1.\nA difficult concept to grasp: be sure you understand it\n\n2.\nWays in which bodies are regulated?\n\n3.\nReproduction\n\na.\nThe example mentioned in an earlier lecture\n\n1)\nA California judge required the\ninsertion of the contraceptive Norplant as an option in place\nof a jail sentence for a crack-addicted mother of 6 who was\nneglecting the ones she already had\n\nb.\nI mentioned a video, \"The Lynchburg Story\" we\nwill watch\n\n1)\nAbout institutionalized sterilization in Virginia\n\n4.\nOther kinds of unruly, unregulated behavior needing regulation\n\na.\nA search for an \"anti-violence\" drug following\nurban unrest in the mid 1960s\n\nb.\nCambridge police saying pepper spray is less\neffective on Hispanic populations because they eat lots of hot chile\npeppers--so the police apply a greater quantity\n\n1)\nHere we have\nethnicity and class stratification being \"read\" onto brown\nbodies\n\nc.\nSociety's regulation of appearance?\n\n1)\nThe correct body for the nation: both\nsexes: lean, strong, androgenous, physically \"fit\" form\nthrough which the core cultural values of autonomy,\ntoughness, competitiveness, youth, and self-control are\nreadily manifest\n\nd.\nThe notion that regulation of the body will produce\ngood citizens\n\n1)\nThe ideology of Boy Scouts: earlier and today\n\n2)\nNational Socialism (Nazis):\npublished lots of literature on the importance of building\ncorrect bodies (and minds)\n\n5.\nThe self-regulated body\n\na.\nProper bodies, like health itself, are achieved\n\nb.\nContradictions?\n\n1)\nFitness may suggest self-\ncontrol\n\n2)\nYet such attention to the\nbody can also suggest:\n\na)\nSelf-\nindulgence\n\nb)\nPleasure-seeking\nconsumers, especially women\n\nc)\nOr liberation from\nsocietal constraints--example of the video\n\"Pumping Iron II\" about female body builders\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/8ec3c505758427c02ab20f2c1a4436de_MIT21A_215S12_lecture_08.pdf",
      "content": "Meaning Moerman, Obeyesekere, Jackson 2012 10/09/12\nMEANING, MEDICINE AND ILLNESS\n\nRead:\nDaniel Moerman and Wayne Jonas: \"Deconstructing the placebo effect and\nfinding the meaning response\"\n\nObeyesekere, \"Depression, Buddhism and the work of culture in Sri Lanka\"\n\nJean Jackson: \"Pain and Bodies\"\n\nI.\nMeaning\n\nA.\n\"Meaning\" both in modern society and cross-culturally\n\n1.\n\"The work of culture\": in the Obeyesekere piece, refers to the\ntransformation of feelings, affects (e.g., suffering), into symbols and\nmeanings\n\na.\nWhen you analyze your dreams you‟re doing this kind of\nwork, using cultural symbols like language, visual images\n\n2.\nWe can see \"the work of culture\" being analyzed in the Jackson piece as\nwell: a process of \"making sense\" of pain\n\na.\nTranslating aversive sensations and accompanying emotions,\ninto ideas we can think about and communicate with\n\nB.\nLooking at the Obeyesekere piece, we must ask\n\n1.\nTo what degree do the members of a culture need to collectively understand\n\"depression\" in order for them as individuals to \"really\" be depressed?\n\na.\nIs this condition equivalent to hypertension? That is, that it‟s\nthere, no matter what the individual who has it thinks?\n\n2.\nThe book cited at beginning of Obeyesekere‟s article1 is about poor British\nwomen who are depressed, according to clinicians, but many of them don‟t\nknow it\n\na.\nThe clinicians have the authority to say they are, no matter\nwhat these women think about it (remember the distinction between\ndisease and illness?)\n\nb.\nObeyesekere asks, what is the truth status of this conclusion?\n\n1) He gives other examples of Ashanti and Yoruba individuals who\nare seen to \"perversely refuse\" to conform to Western\npsychiatric norms of depression\n\nBrown, G. S., and T. Harris, 1978, The Social Origins of Depression: A Study of Psychiatric Disorder in\nWomen. NY: The Free Press.\n\na)\nThese individuals interpret their situation as an\nexistential condition due to \"natural\" results of the\nvicissitudes of life\n\nc.\nWhat happens when no one in the culture accepts such a\ndiagnosis? When the diagnosis is meaningless to everyone--to\npeople with symptoms, people without them, native healers,\neveryone?\n\n1)\nWhere does the meaning lie in such cases?\n\n2)\nDoes it disappear, or can some other\nauthority establish the \"true\" meaning?\n\n3.\nThis puzzle derives mainly from the fact that depression is not nearly as\nculturally constructed in the West as, say, diabetes\n\na.\nWhere does a malady like depression fit into biomedicine‟s\nunderstanding of the body (including the brain)?\n\nb.\nLook at the letters to the editor of Newsweek2\n\nposted on the class website\nresponding to a cover article about teen-age depression\n\nOct. 21, 2002, pp. 17-18.\n\n1)\nOne letter says teen-age depression is on the\nrise because such an increase is beneficial to those who treat\nit--pharmaceutical companies and clinicians\n\n2)\nWhereas another letter says that it‟s tragic\nthat there aren‟t enough clinicians specializing in adolescent\npsychiatry\n\n3)\nAnother letter warns against depression\nbecoming the \"illness du jour,\" when what‟s really\nhappening is an adolescent failing to fit in at school\n\na)\nThis letter‟s author draws a\nparallel with what she says is over-diagnosis of\nAttention Deficit Hyperactivity Disorder and over-\nprescribing of Ritalin\n\n4)\nAnother letter-writer blames society: given\nwhat sorts of adult behavior teenagers are seeing around\nthem, who wouldn't be depressed? (i.e., they aren‟t sick,\nthey‟re normal and simply observant)\n\na)\nInteresting parallels with the\nAshanti case, no?\n\nb)\nAs well as some of the\nwomen‟s self-analysis in the Brown and Harris study\n\n5)\nAnother letter suggests than many teenagers\nmay have more than one malady, and lists other possible\nconditions found to co-occur with depression\n\n6)\nAnd still another suggests that teenagers need\nto find out how to cope and not rely on pills\n\n7)\nAnother writer says perhaps teenagers are\ndepressed because they‟re finding out that life just can‟t\ndeliver what the \"greedy media\" have convinced them it\nshould\n\n8)\nAnother says she had serious symptoms,\nincluding being suicidal and \"to this day, my mother doesn‟t\nunderstand what I was so upset about\"\n\n4.\nAs some of you are discovering, if for your papers you choose a disease\nthat‟s still in the process of being culturally constructed:\n\na.\nYour task is not as easy as, say, writing a paper on the\ncultural construction of malaria in the early 20th century\n\nb.\nLike those Newsweek letter-writers, we all have our own\nindividual opinions about what‟s \"really\" going on, and so we tend\nto see the task to be one of arguing in favor of a particular\nexplanation being true, rather than analyzing the phenomenon\n\nc.\nWe‟re may not be distant enough from the phenomenon\nwe‟re studying to easily describe how it is culturally constructed\n\n1)\nIf the concepts we‟re working with are still\ncontested, we know they‟re not shared enough to allow us to\ndescribe them as fully constructed\n\n5.\nNotice that Obeyesekere says that even well-understood diseases like\nmalaria aren‟t simply \"out there\" either:\n\na.\n\"...symptoms are not disarticulated entities that have a\nphenomenological reality independent of culture, even though it is\nthe culture of contemporary science. Here, too, symptoms are\n„fused into a conception,‟ which is the disease known as „malaria.‟\"\n(p. 150)\n\nb.\nHahn makes a point about the difference between exposure\nto Mycobacterium tuberculosis and the disease T.B. in the chapter\nyou read last week (p. 79)\n\n1)\nSome of the difference is due to meaning construction\n\nII.\nMeaning Construction\n\nA.\nThe placebo response: Moerman and Jonas‟s \"meaning response\"\n\n1.\nDISCUSS: examples of the \"nocebo\" effect?\n\nB.\nMetaphors and their characteristics\n\n1.\nMetaphors help us understand something we don‟t completely understand\n\n2.\nBut we have to remember that a metaphor helps comprehension of only\nsome aspects of the new topic\n\na.\nBecause the metaphor is never identical to the new topic,\nsome of its elements help us understand the phenomenon the\nmetaphor is being likened to\n\nb.\nWhile other aspects are obscured, even distorted\n\nC.\nDISCUSS: all the ways pain can serve as a metaphor\n\nD.\nDISCUSS: Descartes‟ „body as machine‟ metaphor\n\nI want you to consider that all these functions in this machine follow naturally\nfrom the disposition of its organs alone, just as the movement of a clock or\nanother automat follow from the disposition of its counterweights and wheels; so\nthat to explain its functions it is not necessary to imagine a vegetative or sensitive\nsoul in the machine, or any other principle of movement and life other than its\nblood and spirits agitated by the fire which burns continually in its heart and\nwhich differs in nothing from all the fire in inanimate bodies. (Descartes, as cited\np. 223 in Osherson and AmaraSingham3)\n\n1.\nDISCUSS: What features of this definition still work?\n\n2.\nWhat would you change?\n\na.\nWe carry around many foreigners--bacteria, etc.--some of\nwhich are necessary and some of which are pathogens\n\n1)\nHahn‟s example of the T.B. bacillus\n\nb.\nAutoimmune diseases are, finally, about the self attacking self...a\nmore complicated process within the complex life unit than\n\nSamuel Osherson and Lorna AmaraSingham: \"The machine metaphor in medicine.\" In Mishler et al., Social\nContexts of Health, Illness, & Patient Care, Cambridge, Cambridge University Press, 1981: 218-244.\n\nhappens with machines\n\nc.\nInvasion by parasites requires a degree of adaptation\nbetween the body and the pathogen: a completely foreign organism\nwould find no receptors\n\n3.\nWhat gets lost in the machine metaphor?\n\na.\nEmotions\n\nb.\nThe larger social context\n\nc.\nThese absences help explain the nature of the confusion and\ndisagreements between all those Newsweek letter-writers regarding\nteenage depression\n\n4.\nDISCUSS: metaphor of the body as machine and chronic pain\n\n5.\nHow does the machine metaphor not work when bodies are donor cadavers?\n\na.\nMargaret Lock: \"Maintaining organs for transplantation\nactually necessitates treating dead patients in many respects as if\n\nthey were alive\"4\n\nb.\nCompare the „living cadaver‟ to a machine; does the\nmetaphor work?\n\n1)\nA machine runs, a machine breaks down\n\nc.\nAn intensivist (person working on the intensive care ward)\nsays that sometimes \"my rational mind is sure [a patient is really\ndead], but some nagging, irrational doubt seeps in\"\n\n1)\nThe interviewee reports these nagging doubts\ncoming to him when he is lying in bed at night after sending\na brain dead body for organ procurement\n\n2)\nHow is a \"rational mind\" like and not like a\nmachine when compared to his irrational doubt?\n\n3)\n\"The body wants to die\" How is this\nmachine-like? How not?\n\nYounger, p. 243, as cited in Margaret Lock: \"On dying twice: Culture, technology and the determination of\ndeath.\" In M. Lock, A. Young and A. Cambrosio, eds.,: Living and Working with the New Medical Technologies:\nIntersections of Inquiry. Cambridge: Cambridge University Press, 2000: 233-262.\n\n6.\nThe intensivists‟ metaphors\n\na.\nWhat is left of the brain dead donor is an empty container\n\nb.\nA nurse: ...\"There‟s only an envelope of a person left...\"\n\nIII.\nLet‟s look at the meaning-construction in the following:\n\nA.\nExamination of 27 general gynecology texts published in U.S. since 19435\n\nB.\nVery negative (and incorrect) views of women\n\n1.\nPersistent bias toward greater concern with the patient‟s husband than\npatient herself\n\n2.\nWomen: anatomically destined to reproduce, nurture, and keep their\nhusbands happy\n\n3.\n\"The fundamental biologic factor in women is the urge of motherhood\n\nDiana Scully and Pauline Bart, 1973. \"A funny thing happened on the way to the orifice: Women in\nGynecology textbooks. In Joan Huber, ed., Changing Women in a Changing Society. Chicago, University of\nChicago Press: 283-288.\n\nbalanced by the fact that sexual pleasure is entirely secondary or even\nabsent.\" (1943)\n\n4.\nWomen are assumed \"to be generally frigid...[the male] is created to\nfertilize as many females as possible and has an infinite appetite and\ncapacity for intercourse\" (1943)\n\n5.\nGynecologists advised to recommend to patients to fake orgasm\n\na.\n\"It is good advice to recommend to the women the\nadvantage of innocent simulation of sex responsiveness, and as a\nmatter of fact many women in their desire to please their husbands\nlearned the advantage of such innocent deception\" (1953)\n\n6.\nBut even if she is \"truly frigid...the marital relations may proceed without\ndisturbing either partner\" (1962)\n\n7.\n\"An important feature of sex desire in the man is the urge to dominate the\nwoman and subjugate her to his will; in the women acquiescence to the\nmasterful takes a high place\" (1967)\n\n8.\n\"The traits that compose the core of the female personality are feminine\nnarcissism, masochism and passivity (1971)\n\n9.\n\"The frequency of intercourse depends entirely upon the male sex\n\ndrive...The bride should be advised to allow her husband‟s sex drive to set\ntheir pace and she should attempt to gear hers satisfactorily to his. If she\nfinds after several months or years that this is not possible, she is advised\nto consult her physician as soon as she realizes there is a real problem\"\n(1970)\n\n10.\n\"If like all human beings, he [the gynecologist] is made in the image of the\nAlmighty, and if he is kind, then his kindness and concern for his patient\nmay provide her with a glimpse of God‟s image\" (1968)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 10 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/99708769df414d6789ee24a1553d77de_MIT21A_215S12_lecture_10.pdf",
      "content": "Institutions II, Introduction 2012 10/09/12\nTHE INSTITUTION(S) OF MEDICINE\n\nRead: Hahn, 173-208; Luhrmann 25-83\n\nThis section of the course looks at Western medicine as an institution\n\nI.\nLet's look at institutions in general. What are they? A sociological analysis:\n\nA.\nA set of behaviors that are seen by the members of a culture as organized and\nconnected--that form part of a unit\n\n1.\nThis is a looser definition than most of us would come up with when asked\nto define an institution\n\na.\nOur prototype would be something like MIT--a \"real\" institution,\nwith buildings\n\n2.\nHowever, if we are to speak of the \"institution of marriage\" (which can be a\nuseful exercise) we need a looser definition\n\nB.\nBehaviors are organized in institutions:\n\n1.\nThere may be an explicit hierarchy or not\n\n2.\nThere will be ways to recruit members\n\na.\nAnd train new members\n\n1)\nApprenticeships, etc.\n\nb.\nAs well as ways to de-recruit apostates\n\n1)\nExcommunication\n\n2)\n\"Drum out of the corps\"\n\na)\nDISCUSS: MIT examples?\n\n3)\nThere are always in-between stages before\nfinal ejection\n\na)\nIn medicine, censure, etc.,\nwill be applied before taking away the license\n\nb)\nNote that here, as is often the case, two institutions\nare involved in ejecting members (the state and the\nmedical boards)\n\nc)\nBecause, as is most often the case, institutions cannot\npolice themselves properly\n\n(1)\nExample: the news several years ago carried\nstories about the apprehension of a nurse who\nhad killed many people1\n\n(2)\nThe hospitals\nthat hired him didn't prosecute, just fired him,\nand he would easily find work elsewhere\n\n(3)\nHis colleagues\nin one hospital even gave him a nickname\nthat referred to murder (they didn't use it to\nhis face)\n\n3.\nThe set of behaviors comprising an institution includes provision for an\norderly succession of office\n\n4.\nThere will be ways to advance in the institution\n\na.\nDISCUSS: How do faculty in a university advance?\n\nRichard Pena, \"Hospitals didn't share records of a nurse accused in killings.\" New York\nTimes Dec. 17, 2003.\n\nb.\nDISCUSS: What are the ways to advance in medicine?\n\n5.\nThere will be ways to build loyalty and commitment\n\na.\nCelebrating ancestral figures is one way\n\nb.\nDISCUSS: ways medicine builds loyalty and commitment?\n\n6.\nInstitutions have orderly ways to change themselves over time\n\na.\nNote Hahn's point that specialties within medicine have resulted not\nonly from technical advances and new knowledge but also from\nintense struggles for recognition by practitioners\n\nb.\nTo some degree these struggles continue: there is always\njockeying for turf, for resources, and for recognition in all\ninstitutions\n\nC.\nThere will be a place where the behaviors take place\n\n1.\nA physical place is not required--for example, members of some\ninstitutions meet in cyberspace\n\n2.\nDISCUSS: examples of medical locales?\n\nD.\nInstitutions need funding: some form of wealth to finance the activities\n\n1.\nDISCUSS: medicine?\n\nII.\nLet's look at the meaning side of things\n\nA.\nMembers want the institutions they belong to:\n\n1.\nTo be worth their time, to enhance their self-image or otherwise promote\ntheir interests\n\na.\nTo be \"good\" institutions--to be worthy, effective, well thought of\n\nb.\nThis applies to illegal and counter-cultural organizations as well\n\n1)\nFor example, the Mafia\n\n2)\nDISCUSS; ways in which institutions\npromoting alternative medicine differ from biomedicine in\nthis regard?\n\n2.\nHow is meaning constructed within institutions?\n\na.\nOne way is via myths and stories\n\n1)\nMedical schools will have portraits of founding fathers and\nstories about them\n\n2)\nDISCUSS: other examples in medicine?\n\nb.\nAnother way is via rituals that happen during get-togethers,\nrallies\n\n1)\nThe American Medical Association's plenary\nsessions during their conventions, its named lecture series,\netc.\n\n2)\nDISCUSS: MIT rituals that construct and\nreconfirm meaning about MIT?\n\nc.\nThese meaning constructions inform both members and outsiders\nabout the institution's history, where they collectively are now, and\nwhere they're headed\n\nd.\nThese meanings also help define boundaries--who is a member and\nwho isn't, in normative terms (\"good\" and \"bad\" members)\n\n3.\nValues\n\na.\nValues have a purpose: they legitimate and justify the institution--\nthey are often seen as self-serving in this respect\n\n1)\nHealth policy debates in Congress reveal legislators' values,\nthe White House's values\n\na)\nDISCUSS: values of\ninstitutions that intersect with medicine?\n\n(1)\nAmerican\nAssociation of Retired Persons (AARP) with\nrespect to prescription medicines\n\n(2)\nPension plans\nwanting to buy drugs in Canada\n\n(3)\nBig Pharma\n\n2)\nWhere is the \"institution of medicine\" in\nthese debates?\n\na)\nWhat values are revealed in such\nnegotiations?\n\nb.\nHahn discusses biomedical values extensively\n\n4.\nOther activities that serve the needs of the members?\n\na.\nNewsletters, bulletin boards, credit unions, hotlines, contests with\nprizes, organized travel, reunions/ conferences/ conventions/\nmeetings\n\n1)\nSuch activities can be seen to promote a feeling of belonging,\nsolidarity\n\n2)\nA distinct language or dialect/argot:\n\na)\nBeing able to speak\nmedicalese (liberal use of technical terms) can be\nseen to reinforce the exclusivity of the institution and\nsignal shared values\n\n3)\nHelps provide a sense of security and affirm\nmembers' high social status\n\nb.\nAll the social, financial, informational, etc. activities\n\n1)\nCan be seen to be multi-purpose\n\n2)\nFor these activities also affirm and contribute\nto the institution's meaning to its members\n\nIII.\nMedicine as an institution is embedded in the larger society\n\nA.\nRelates to (competes with, complements) other institutions\n\n1.\nSuch as non bio-medicine medical practices\n\na.\nOsteopathy, chiropractic, homeopathic (osteopathy is closest)\n\nb.\nFor the most part, they are seen as competitors\n\n2.\nDISCUSS: other institutions that intersect with medicine?\n\na.\nMedical science--linked to government research agencies,\ngovernment funding agencies, U.S. Congress, etc.\n\nb.\nPharmaceutical industry; manufacturers of medical equipment\n\nc.\nInsurance industry (HMOs)\n\nd.\nSocial service institutions\n\ne.\nLegal institutions\n\nf.\nInternational public health institutions: WHO\n\nB.\nInstitutions are embedded in a culture as well\n\n1.\nAs is true of all institutions, medicine conflicts with parts of the overall\nculture\n\na.\nWe are discussing cases throughout the course\n\n2.\nMedicine is a window onto some other parts of the society\n\na.\nE.g., values: our way of valuing science, for instance, are displayed\n\nb.\nOur dependence on expert knowledge is revealed: how we expect\nexperts to take care of our children and other dependents\n\n1)\nSchools, counselors, other advice-givers\n\nc.\nHow we value certain kinds of people and denigrate other kinds is\nrevealed\n\n1)\nHahn's point about discrimination within biomedical\ninstitutions against minority patients, women, the elderly,\nand the poor\n\n2)\nPrejudice against kinds of people with\nrespect to degree of responsibility and sometimes blame for\ntheir ailment\n\na)\nAlcoholism, drug addiction, HIV/AIDS\n\n3)\nAnd kinds of people with respect to their\nappearance and behavior while in health care settings\n\na)\n\"Crocks,\" for example\n\nb)\nYou will read D.P. Gordon's\npiece on hospital slang that analyzes this language\n\nd.\nHow we value our bodies, especially specific parts of our bodies is\nrevealed\n\n1)\nJokes about proctologists, gynecologists\n\n2)\nHahn points out that the differential status of\nmedical specialties\n\na)\nIs thought to derive from the\nsymbolic value ascribed to the treated body part and\nfunction\n\nb)\nI would add that the symbolic\nvalue of the person possessing the body part\ncontributes as well\n\nc)\nObstetrician/Gynecologist\nused to be pretty low in status\n\n(1)\nI don't know what it is at present\n\nd)\nThe degree of control the\nspecialty is seen to have in the patients' lives also\nvery probably plays a role\n\ne.\nStatus value: medicine is a high-status occupation...the joke about\n\"my son the doctor's brother\"\n\n1)\nHigh earning power, other kinds of authority\n\n2)\nHMOs have decreased physicians' authority\n\nV.\nFinal remarks\n\nA.\nInstitutions have a logic to them\n\n1.\nThey don't self-destruct, they look after their own interests, etc.\n\nB.\nThe DVDs we are seeing illustrate institutions\n\n1.\n\"Lynchburg Story\": about both the specific institution at Lynchburg in\nVirginia that sterilized people,\n\na.\nAnd the eugenics movement as a whole\n\n2.\n\"Back from Madness\": MGH presenting itself as providing state-of-the-art\nbiomedical interventions for psychiatric disease\n\n3.\n\"The Search for Satan\" we'll see the North Shore Hospital in the Chicago\narea\n\na.\nIn its response to the \"epidemic\" of satanic abuse of children\n\n4.\n\"Deadly Deception\" is about the medical science practiced by the institution\nof the US Public Health Service,\n\na.\nUSPHS ran a long-term study of syphilis in the \"untreated\nNegro male\"\n\n1)\nThe study continued for decades even though\na very effective treatment had been found for syphilis\n\n5.\n\"Simple Courage\" deals with several institutions' response to leprosy in\nHawaii during this century and part of the last\n\na.\nThe US as a colonial power\n\nC.\nThe point is to understand institutions, not to find out about \"bad\" institutions and\n\"bad\" physicians\n\n1.\nOne can learn a lot about the structure and functioning of institutions by\nexamining those that are dysfunctional\n\na.\nThis is why we often look at institutional failures, or\ninstitutional successes that later on seem to be wrong-headed\n\n2.\nWe are not out to \"doctor-bash\" or \"institution-bash\"\n\na.\nOf course it is important to examine why all the hospitals failed to\nprosecute the murdering nurse, or, when he moved on,\n\n1)\nWhy the new hospital failed to adequately\ncheck on his record when he was being hired\n\n3.\nBut it's more important to learn how institutions operate, what they are\n\na. Because too often people condemn specific institutions, without\nunderstanding that part of what happened was typical institutional\nbehavior\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 11 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-215-disease-and-health-culture-society-and-ethics-spring-2012/75a2e6c1838ec6a071435d4eda237e0f_MIT21A_215S12_lecture_11.pdf",
      "content": "Institutions III Gordon, Luhrmann 84-118 2012 10/09/12\nThe Institution(s) of Medicine III\n\nRead: D.P. Gordon: Hospital slang for patients\n\nLuhrmann 84-118\n\nI.\nToday we focus on how we study institutions--describe them, analyze them--and consider\nsome theoretical issues\n\nA.\nPossible methodologies:\n\n1.\nExamine the institution itself\n\na.\nFor example, the institution of American psychiatry\n\n1)\nDISCUSS: what did we learn about Mass General's\npsychiatry unit from the video \"Back from Madness\"?\n\na)\nHow reliable is our\ninformation?\n\nb)\nWhat are some possible\nsources of bias in the video?\n\nc)\nAlways keep in mind the\nnature of your sources of information\n\ne)\nHow does the video convey\nthe impression that a balanced, objective, informative\npicture was being drawn, as opposed to one created\nby a public relations firm?\n\nf)\nWhat are areas you think were\nnot covered because they would produce an\nunfavorable impression of MGH?\n\nb.\nThe Rosenhan et al. article you will read later on analyzes\ninpatient psychiatric units from a critical, \"outsider\" perspective\n\n1)\nDISCUSS: how much analysis of institutions\ndoes Luhrmann provide?\n\n2)\nLuhrmann studied a number of inpatient psychiatric\ninstitutions\n\n3)\nHer main concern is to examine the\ninstitution of psychiatry as a whole\n\n2.\nSecond approach: looking at an institution over time\n\na.\nInstitutions may be studied over time both ethnographically\nand historically, through archival documents\n\n1)\nThe Fadiman and Farmer books present both\npresent-day and historical material\n\na)\nThe authors rely on what's\ncalled oral history as well--living people's accounts\nof the past\n\nb)\nDISCUSS: what institutions\nwere analyzed in Fadiman?\n\n2)\nThe video we'll see called \"The Lynchburg\nStory,\" on compulsory sterilization in Virginia, relies on\narchives and oral history\n\n3)\nThe video we'll see titled \"Simple Courage,\"\non leprosy in Hawai'i in the 19th and 20th centuries relies on\nthose two and interviews about the present\n\n4)\nDISCUSS: Hahn's methodology of\nfollowing the internist Barry around\n\na)\nWhat kinds of information\ncan Hahn gather about the institutions of medicine,\nhospitals, and internal medicine that historians\nworking in archives can't?\n\nb)\nWhat are the drawbacks to the\nkind of \"shadowing\" research Hahn employs?\n\n3.\nThird approach: compare several similar institutions\n\na.\nLuhrmann does this\n\n4.\nFourth: examine the way a given institution relates to, is embedded in, other\ninstitutions\n\na.\nWe'll see in Farmer a concern with how medicine intersects with\npolitics\n\nb.\nA film about the first decade of the AIDS epidemic in the\nUS, \"And the Band Played On,\" shows the inner workings of\nresearch science and epidemiology\n\n1)\nShows government agencies like the Center\nfor Disease Control trying to get more funding\n\nc.\nThe Davis piece we read on PMS looks at psychiatric and\nbiological research\n\n5.\nFifth: cross-cultural comparison: compare institutions that are really not\nvery similar\n\na.\nThe Obeyesekere piece: Sri Lanka and the West\n\nb.\nAnd of course Fadiman is an example of cross-cultural\ncomparison as methodology\n\nc.\nThe Payer article we'll read later on looks at medicine in\nfour Western countries\n\n1)\nAlthough all four countries subscribe to\nWestern medicine, practices and policies vary from country\nto country due to cultural differences, albeit slight ones\n\n6.\nSixth: doing close readings of a society's texts, or careful examination of its\nrituals, to uncover meanings, values\n\na.\nResearch on the gynecology textbooks I discussed in a\nprevious lecture is an example\n\nb.\nGordon's close reading of hospital slang employs this\napproach\n\nc.\nThe Katz article \"Ritual in the Operating Room\" is another\nexample\n\n1)\nHere the author \"reads\" the operating room\n\nbehavior as if it were a text, looking for symbols, analyzing\nthe behavior as ritual\n\nd\nAll of these \"reading\" examples are what's called\ninterpretive analysis\n\nII.\nWhy study the institution of medicine?\n\nA.\nFirst reason is obvious: it is important in itself\n\nB.\nSecond reason: provides a window on the world\n\n1.\nFor example, doctors in the US and Great Britain used to perform\ncliterodectomies1\n\na.\nWe see these as mistakes. But they aren't random mistakes,\nand so they are revealing\n\n1)\nDISCUSS: speculate why would physicians\never think that excision of the clitoris would restore a\nwoman to health?\n\nSee Elizabeth A. Sheehan, \"Victorian clitoridectomy: Isaac Baker Brown and his harmless operative\nprocedure.\" In Roger Lancaster & Micaela di Leonardo, The Gender Sexuality Reader: Culture, History, Political\nEconomy. New York: Routledge, 1997: 325-334.\n\nb.\nAgain, you'll miss the point if you see these doctors, as bad,\nor simply mistaken, and leave it at that\n\nIII.\nTheories concerned with power are necessary for understanding institutions\n\nA.\nIdeology2\n\n1.\nA system of meanings and values which are the expression or projection of\na particular class interest (one of several possible definitions)\n\na.\nI mentioned the sterilization of over 70,000 people in this\ncountry\n\nb.\nThese programs reveal an ideology\n\n1)\nThat inspired a movement: Eugenics\n\n2)\nVery pervasive at the time\n\nc.\nDISCUSS: why so pervasive, do you think?\n\nd.\nWhat are some examples of 21st century behavior driven by\n\nDiscussion from Raymond Williams, Marxism and Literature. Oxford University Press, 1977.\n\neugenic ideology?\n\n2.\nThe differences between the sterilization programs and contemporary\n\"eugenic ideologies\":\n\na.\nLynchburg involved clinicians and lawmakers deciding that\nsome people were not fit to be parents\n\nb.\nAnd coercively sterilizing them\n\n1)\nIn some cases deceptively\n\nc.\nToday we have the phenomenon of \"designer babies\"--egg\ndonation, amniocentesis possibly followed by abortion\n\nd.\nDifferences:\n\n1)\nWho is making the decision, and the goal\n\na)\nScreening couples in order to\navoid Tay-Sachs disease among Ashkenazic Jews--\nincidence has dramatically decreased\n\n2)\nNowadays it is parents who decide about egg\ndonation, and whether a fetus is an acceptable one or not\n\n3)\nContrasts with explicit eugenics legislation,\nwhich works to prevent a population from ever reproducing\n\n4)\nWhereas today, would-be parents might try\nagain to have a child\n\ne.\nIf enough people engage in this kind of selective behavior,\nthe overall profile of the population might be affected eventually\n\nf.\nDISCUSS: international examples?\n\n1)\nSex selection in India and China has had very\npronounced effects on the population\n\n2)\nSingapore's pronatalist policies were founded\non explicitly eugenicist principles\n\na)\nOstensibly to encourage\nhighly educated women to reproduce more, and\npoorly educated women to reproduce less--to\nimprove the gene pool\n\nb)\nThe policies were in fact\ndriven by ethnic nationalist goals:\n\n(1)\nHighly\neducated women in Singapore are\ndisproportionately Chinese; poorly educated\nwomen are Hindi and Malay3\n\n3.\nDISCUSS: other medical examples revealing ideology at work?\n\na.\nWhy do people buy into an ideology of thinness so\nthoroughly that it can result in death?\n\nb.\nWhy do women (and men) inject a poison, botox, into their\nforeheads?\n\nc.\nDISCUSS: examples from your papers?\n\nB.\nLet's employ Antonio Gramsci's notion of hegemony to explore this issue of\nideology further\n\n1.\nIt is is a more supple, nuanced concept than the concept of ideology\n\na.\nOne with greater explanatory power\n\nGeraldine Heng and Janadas Devan: \"State fatherhood: The politics of nationalism, sexuality, and race in\nSingapore,\" in Roger Lancaster & Micaela di Leonardo, The Gender Sexuality Reader: Culture, History, Political\nEconomy. New York: Routledge, 1997: 107-121.\n\n2.\n\"Ideology\" can be too static a concept for these kinds of analysis: hegemony\nis conceived of as a process\n\n3.\nThe notion of hegemonic power (hegemony) looks at:\n\na.\nThe way people choose to participate in power relations\neven though they do not seem to be in their best interest\n\nb.\nWhy do they accept systems of dominance, even fervently\nbelieve in them?\n\n1)\nDISCUSS: examples in medicine?\n\n4.\nSo if we try to figure out why people inject poison into themselves\n\na.\nWe might discuss the hegemonic position of powerful\nmultinational Big Pharma corporations\n\n1)\nWhen they try to sell the drugs and devices\nthey manufacture\n\n2)\nThey do market research and figure out how\nto do it most successfully\n\nb.\nIf we're studying pharmaceutical multinational corporations\nas hegemonic institutions\n\n1)\nWe have to figure out what's in it for the\nconsumers in these exchanges (a successful advertisement\ninspires a response--the consumer buys the product; this is\nan exchange)\n\n2)\nFigure out what are the benefits\n\n3)\nBecause if there always are benefits, we can't\nconclude that these people are simply duped.\n\n4)\nThey're making \"reasonable\" choices, given\ntheir goals, even though we disagree with these choices and\nconsider them disadvantageous to the people making the\nchoices\n\n5.\nNote that hegemony has to continually be renewed, recreated, defended, and\nmodified\n\na.\nAnd that it is also continually resisted, limited, altered,\nchallenged:\n\n1)\nWherever there is hegemony there is counter-\nhegemony--resistance to the power structure, the choices it\nprovides, the choices it encourages\n\nb.\nDISCUSS: examples of counter-hegemony in medicine?\n\nIV.\nAnother approach: formulate hypotheses about what health care institutions do, what they\naccomplish\n\nA.\nFirst is the obvious one: when successful they restore sick people to health\n\nB.\nSecond: analyze psychological processes\n\n1.\nThe D.P. Gordon piece analyzes the psychology of slang\n\na.\nHe says the hypothesis that the function of derogatory\nlanguage is to release tension is not true--the most seriously ill are\nnot joked about\n\nb.\nRather, he argues that such slang expresses frustration over\ncare that is given but not needed, not deserved, or not useful\n(because they're going to die anyway)\n\n2.\nFavret-Saada suggests that beliefs in witchcraft and the possibility of\nbecoming un-bewitched--restoring the farm to health--has gendered\npsychological implications\n\nC.\nThird: social processes: Gordon: slang helps the group build rapport\n\n1.\n\"...not support the claim that hospital slang for patients is an outlet for\npersonal reactions to illness and suffering, but the group concern of hospital\n\nstaff to provide meaningful, useful service\"\n\n2.\nGordon also suggests the slang helps build distance between individuals,\nespecially the superior to the subordinate\n\n3.\nPossible social control processes in therapeutic institutions:\n\na.\nThe nurses and bomohs administering to victims of spirit\npossession in Aiwa Ong's analysis of a multinational factory in\nMalaysia\n\n1)\nAre engaged in a form of social control that\nserves the company's economic interests\n\n2)\nThis is control, strict control, but not coercion\nitself\n\nb.\nCliterodectomies can be seen as a form of social control:\n\n1)\nAttempt to control the behavior of those who\nunderwent surgery\n\n2)\nAnd, presumably, the behavior of other\nwomen who know about the procedure and the symptoms\nthat lead a physician to recommend the surgery\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.215 Disease and Health: Culture, Society, and Ethics\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}