{
  "course_name": "Disease and Society in America",
  "course_description": "This course examines the growing importance of medicine in culture, economics and politics. It uses an historical approach to examine the changing patterns of disease, the causes of morbidity and mortality, the evolution of medical theory and practice, the development of hospitals and the medical profession, the rise of the biomedical research industry, and the ethics of health care in America.",
  "topics": [
    "Health and Medicine",
    "Epidemiology",
    "Public Health",
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Social Science",
    "Political Science",
    "American Politics",
    "Sociology",
    "Health and Medicine",
    "Epidemiology",
    "Public Health",
    "Humanities",
    "History",
    "American History",
    "History of Science and Technology",
    "Social Science",
    "Political Science",
    "American Politics",
    "Sociology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nDescription\n\nThe balance between health and disease is a central feature of human life and society. Over the past 500 years there have been major changes in the prevalence and experience of diseases, from epidemics of smallpox and tuberculosis, to the chronic afflictions of obesity, heart disease, and mental illness. At the same time there has been enormous growth in the role of medicine in culture, economics, and politics. Health care is now a major sector of the American economy and it will certainly be a dominant political issue for the 21st century. This course will use a historical approach to explore the changing interactions between disease and society in America, examining: changing patterns of disease, the causes of morbidity and mortality, the evolution of medical theory and practice, the development of hospitals and the medical profession, the rise of the biomedical research industry, and the ethics of health care in America.\n\nRequirements\n\nAs a HASS-CI course, emphasis is placed on oral and written communication. The course thus requires:\n\nActive participation in both lectures and weekly recitation sections.\n\nA series of written assignments.\n\nRecitation Sections\n\nEach week's readings must be read prior to recitation section. Active participation in the discussions is required. Each student will also co-lead one section. This will involve:\n\nEmailing the other members of the section in advance with a list of likely discussion topics.\n\nProviding a 5-10 minute summary of the readings.\n\nLeading the discussions (with help from the section leader).\n\nWeekly Writing Exercises\n\nThere will be a short (200 words or less) writing assignment for each week. The assignments will develop specific reading and writing skills. They must be submitted prior to section each week.\n\nPapers\n\nThree papers are required, for a minimum of 20 pages total. As a HASS-CI class, one of these papers must be rewritten and resubmitted.\n\nGrading\n\nEach of the six requirements (section participation, weekly assignments, three papers, one rewrite) will be weighed equally.",
  "files": [
    {
      "category": "Resource",
      "title": "intro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/f9d79604bf1e5bea865bbdc00d3d9f3e_intro.pdf",
      "content": "Weekly Writing Assignments:\nIntroduction & Goals\n\nSTS.005 requires you to submit short, weekly, writing assignments. These\nassignments have several goals:\n\n1) Help us gauge what you are getting from the readings.\n\n2) Develop specific reading and writing skills for historical analysis.\n\nThe assignments each week will be different. Future assignments will respond to\nhow well previous assignments have worked, areas that need further practice,\nspecific skills that will be required for the longer papers, etc.\n\nWhatever the exact assignment, we are looking for very concise responses,\nideally 200 words, 300 words max (less than one page, double spaced). If you do\nthe reading carefully, it should not take too much additional time to complete the\nwriting assignments. The mechanics will be more informal than for the papers:\nwhile your submissions should be well written (e.g. organized, grammatically\ncorrect, etc.), they do not require formal citations when you refer to the readings.\nHowever, if you do refer to a specific passage from the readings, please include\nthe page number (e.g. Jones's essay was okay until p. 20, when...).\n\nThe assignments will be designed so that there is not one correct answer.\nInstead, we are hoping that you will respond thoughtfully and imaginatively.\n\nEveryone must answer the first assignment. Over the remainder of the semester\n(10 sets of readings), each student may skip ONE assignment."
    },
    {
      "category": "Resource",
      "title": "pap_asgmt1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/01a57e226139f74b5fd5e426617bb07d_pap_asgmt1.pdf",
      "content": "STS.005: Disease and Society in America\nFirst Paper Assignment\n\nHealth Care Policy\n\nDue at start of Lecture: 13 October 2005\n\nYour weekly writing assignments have made you a famous health consultant.\nOne day the phone at your Cambridge office rings -- it's President Bush. After\njoking with you about the Red Sox, he gets down to business. \"Doc,\" he says,\n\"things are getting expensive. We have to rebuild Afghanistan, Iraq, and now\nNew Orleans. We need hundreds of billions of dollars, and I promised that I'd\nnever raise taxes. You don't need a Harvard MBA to realize that I'm in a tight\nspot. I was looking at the budget the other day and I realized that health care has\ngotten expensive. When I was born, we only spent 5% of the GDP on healthcare.\nNow it's 15%. And I don't think we're getting our money's worth.\"\n\nYou ask him to explain his concern about health care. He faxes you some\nnumbers that his advisors have pulled together.\n\nPer\nCapita\nIncome\nPer-capita\nhealthcare\nspending\n% of GDP\nspent on\nhealthcare\nInfant\nMortality\nRate\n(deaths/1000)\nLife\nExpectancy\n(at Birth)\n\nIceland\n$31,900\n$3,115\n10.5\n2.4\n80.6\nJapan\n$29,400\n$2,139\n7.9\n3.0\n81.8\nMexico\n$9,600\n$583\n6.2\n20.1\n74.9\nSlovak Republic\n$14,500\n$777\n5.9\n7.9\n73.9\nSweden\n$28,400\n$2,594\n9.2\n3.1\n80.2\nUnited Kingdom\n$29,600\n$2,231\n7.7\n5.3\n78.5\nUnited States\n$40,100\n$5,635\n15.0\n7.0\n77.2\n(Data from www.oecd.org)\n\nAfter giving you a minute to glance over the data, he starts talking again. \"I\nlooked at these numbers and had an idea. I think we should cut our per capita\nhealth care spending in half, and be like Japan: spend half as much money and\nget another four more years. I betcha no Democrat has thought of that!\" As you\nstruggle to come up with a good response he says, \"don't worry, I don't need an\nanswer right now. I'm meeting with my advisors on October 13th, and you can\ntell me then. Remember, I'm a politician and a scholar. I want to know both\nwhat the ideal solution is, and what a more realistic compromise might be.\"\n\nDrawing on your knowledge of the determinants of health and disease, write a\n2000-word (6-8 page) essay that evaluates the President's data and plan.\n\nFirst, describe some of the interesting patterns and features in the data. Are there\nclear associations between income, health care spending, and health outcomes?\nAre there patterns between different countries?\n\nSecond, suggest possible explanations for the patterns (or lack of patterns) in the\ndata. Do income and health care influence infant mortality and life expectancy?\nWhat other factors contribute to the health outcomes? Think broadly about the\nrange of political, economic, demographic, social, and cultural factors that we\nhave discussed in the course so far.\n\nThird, evaluate the President's proposal and suggest alternatives. If you reject\nhis plan, explain what level of per capita spending in the United States might be\njustified and what would need to be done to improve health outcomes other than\nsimply cutting spending. Remember the President's parting request: what\nwould be ideal, and what would be realistic.\n\nAs you formulate your answers, follow these guidelines:\n\n- You must make a clear argument, defended with correct and relevant evidence.\nYour essays must be well organized and clearly written.\n\n- You do not need to use all of the data from all of the countries. You can pick\nand choose data to defend your arguments, but the President might notice if\nyour arguments are undermined by data that you ignored.\n\n- You do not need to do any outside research. However, there is abundant\nadditional data in the lectures and readings.\n\n- We are not looking for statistical analysis: no T-tests, linear regressions, etc.\n\n- You must use material from at least three of the readings covered so far, and\nyour sources cannot all be from the week on Epidemiological Transitions.\n\n- You must use material from throughout the course (early America to present).\n\n- Please cite all sources (course readings, lectures, other readings if any)\ncorrectly. If you have any questions, see the information at the MIT Writing\nCenter website (http://web.mit.edu/writing/). You can pick your own style\n(e.g. CMS, parenthetical citations, etc.) -- just be accurate, consistent, complete.\n\n- Please put your name on a title page, but not on any pages of the body of the\npaper, so that we may grade the papers blind.\n\nDebates about health care policy are extremely politicized. As with the writing\nassignments, we are not looking for one correct answer. Many different answers,\neach completely incompatible with the other, could be good answers. You will\nnot be graded on the basis of how closely your answer fits with our own\npersonal beliefs on the subject. Instead, you will be graded on the basis of how\nwell you present a clear, well-reasoned, and well-defended analysis of the data."
    },
    {
      "category": "Resource",
      "title": "week1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/c9b277def20a87165fb20304dc527706_week1.pdf",
      "content": "Weekly Writing Assignment #1:\nIdentifying and Understanding Arguments\n\n-- Due in Section, week of 9/13-9/15 --\n\nAs explained in the guide to this week's readings, good secondary sources do not\nsimply reconstruct a chronology of past events. While this is a precondition to\ngood history, it rarely is good history on its own. Instead, good historians use\ntheir sources (whether primary texts, skeletal remains, or anything else that is\nuseful) to make arguments about how and why historical events unfolded as\nthey did. Just as physicists argue that moving electrons generate electromagnetic\nfields, historians try and argue that X, Y, or Z caused the event being studied\n(e.g. slavery caused the US civil war; the American Revolution about economic\nfreedom, not political freedom; FEMA responded adequately in New Orleans).\n\nBecause historical events are always complex, there are very few cases where the\ncauses are simple and clear-cut (few historians would except my above examples\nas adequate explanations). As a result, historians have much more wiggle room\nfor argument and disagreement than is often true in scientific research. There are\nmany examples where conflicting interpretations have been produced by careful,\ndiligent historical analysis, each supported with credible sources. While this can\nbe frustrating, especially for people accustomed to finding the right answer on a\nproblem set, it is a fact of life in the humanities and social sciences. In this\ncourse, you will hopefully become skilled consumers and producers of historical\narguments. One of the goals of the weekly writing assignments is to teach you to\nread, interpret, and evaluate historical arguments. The three papers will focus\non the task of producing good historical arguments.\n\nSo, for this week... Crosby makes a series of specific claims about why the\nSpanish and other European groups were able to conquer American populations\nwith seeming ease. His work in this chapter, and his other writings, formalized\nthe concept of virgin soil epidemics. In my article, I argue that advocates of\nvirgin soil theories overstate their case and overlook other crucial factors.\n\nIn this week's writing assignment, describe / predict / imagine how Crosby\nwould respond to my essay. Would he agree with me? Would he disagree?\nWhat particular parts might he support or condemn? Are their specific\nweaknesses in my argument that he might attack?\n\nAs stated in the introduction to the writing assignments, there is not a right or\nwrong answer (unless any of you have ESP and can read Crosby's mind).\nInstead, we are checking whether you can decipher and understand the\n\narguments and perspectives of two historians well enough to be able to predict\nhow one would respond to the other."
    },
    {
      "category": "Resource",
      "title": "pap_asgmt2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/426729eccd8bb317beac733831e55950_pap_asgmt2.pdf",
      "content": "STS.005: Disease and Society in America\nSecond Paper Assignment\n\nThe Roles of Medicine\n\nDue at start of Lecture: 3 November 2005\n\nThe year is 1777. Harvard College is in turmoil. The University of Pennsylvania\nand King's College have both opened medical schools, the first two in the British\nColonies. Wanting to regain its status as the colonies' premier educational\ninstitution, Harvard appoints a committee of prominent physicians to develop\nplans for its own medical school. Their report is nearly complete when two\nthings go wrong. First, when war broke out in 1775, Cambridge became the\nheadquarters of the Continental Army. Although the British retreated from\nBoston in 1776, things have not yet returned to normal. Second, an anonymous\nbroadside was published in 1777. The mysterious authors, who signed the piece\n\"M&M,\" argued that medicine was a waste of money. The citizens of\nMassachusetts spent more and more of their hard earned money on physicians,\nsurgeons, midwives, apothecaries, herbalists, bone-setters, preachers, and so\nforth, but had nothing to show for it. Life expectancy was low, around 35 years.\nInfant mortality was high, with 20% of children dying before their first birthday.\nDiseases thrived, with people suffering from fevers, fluxes, aches, smallpox,\ncolic, measles, and diphtheria. \"M&M\" had clear advice for the President and\nFellows of Harvard: don't waste your money on a medical school.\n\nThe committee's physicians are outraged. Several had trained in England and\nhad mastered all that clinical science could offer. Many had worked for decades,\ntending to the sick in Boston. All had large numbers of grateful and appreciative\npatients. Clearly \"M&M\" did not understand the role of medicine. They decide\nto fund an analysis of the complex roles of healers in colonial America. They\nhave many questions. What kinds of healers exist? In what ways do they help\ntheir patients? How else do they contribute to society and public health? What\nis their source of expertise and authority? Wanting to do this discreetly, they\nlook for a college student who will do all the work but allow them to take credit\nfor it. One Tuesday they knock on your door and make their proposal:\n\nWrite a 2000-word (6-8 page) essay that describes the roles of healers in colonial\nsociety. They have a series of specific requests:\n\nFirst, describe the range of healers working in colonial America.\n\nSecond, provide detailed studies of Martha Ballard and two other healers. For\n\neach, describe the nature of their training, their practice, and their roles in their\nsociety. In what different ways did they help their patients?\n\nThird, integrate this material into a concise summary that defends the role of\nhealers in colonial society. Is there more to medicine than data about life\nexpectancy and infant mortality?\n\nAs you formulate your answers, follow these guidelines:\n\n- You can write from the perspective of 1777, 1807, or 2005; just make sure your\nchronological position is clear and consistent.\n\n- The three healers: One of your detailed studies MUST BE of Martha Ballard.\nThe other two can be your choice from the range of individual or groups of\nhealers discussed so far. The readings have provided information about many\nindividual healers, including John Josselyn, William Buchan, Cotton Mather,\nZabdiel Boylston, William Douglas, Benjamin Rush, Daniel Cony, and several\nothers. They have also provided more general information about groups of\nhealers, such as Indian doctors, Indian jugglers, Republican and Federalist\nphysicians in Philadelphia, etc. Pick cases that are described in sufficient detail\nto support your analysis, and that are interesting to you.\n\n- You must make clear arguments, defended with correct, relevant, and specific\nevidence.\n\n- Your essays must be well organized and clearly written.\n\n- You should not need to do any outside research. There is abundant material in\nthe readings and the lectures.\n\n- You must use material from at least three readings, from any of the weeks.\n\n- You do not need to make the case for a medical school. The Committee will\nsteal your ideas and make that case themselves.\n\n- You MUST cite all sources (course readings, lectures, other readings if any)\ncorrectly, this includes both the source and the specific page number. If you\nhave any questions, see the information at the MIT Writing Center website\n(http://web.mit.edu/writing/). You can pick your own style (e.g. CMS,\nparenthetical citations, etc.) -- just be accurate, consistent, complete.\n\n- Please put your name on a title page, but not on any pages of the body of the\npaper, so that we may grade the papers blind.\n\nMany different approaches can be taken to this assignment. You could\nemphasize a single role as most important. You could emphasize the broad\nrange of roles. You will be graded on the basis of how well you present a clear,\ninsightful, and well-documented discussion of the role of healers."
    },
    {
      "category": "Resource",
      "title": "week2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/325e7cf27b896edf1e6f641fddbcf8eb_week2.pdf",
      "content": "Weekly Writing Assignment #2:\nReading Primary Sources\n\n-- Due in Section, week of 9/20 - 9/22 --\n\nPrimary sources -- materials written at the time of the event being studied -- are\nthe basic resource for historians. Primary sources can provide everything from\nchronologies and narratives of specific events, to theories about why something\nhappened or who was responsible. A good primary source can reveal, in an\nimperfect way, the inner workings of the minds of people long deceased.\nHowever, primary sources are never perfect. Suppose you wanted to find out\nhow English colonists explained disease in 1634. Ideally, a colonist would have\nwritten a book, Disease Theories of Massachusetts Bay Colonists. If this existed, the\nhistorians' task would be easy. Unfortunately, no such book exists. The earliest\nmedical treatise in the English colonies was written in the early 1700s, by Cotton\nMather. And even this book does not tell you what you want to know: it reveals\nonly what Mather thought about disease. Is he representative? Would someone\nfrom Virginia have had the same theory? What about someone who was not\ncollege educated? What about someone who was not a Puritan minister? etc.\n\nWhat historians end up having to do, at least for early America, is read things\nthat are not primarily medical texts -- diaries, journals, descriptions of\nexplorations, letters written to relatives in England -- and mine them for clues\nabout theories of disease and medicine. This can often be low yield: a 200-page\nbook might include only two or three sentences about disease. But when these\nscattered statements are compiled, you can reconstruct a broad view of the\nmedical theories of early America. As you will see in the readings by Wood and\nFlint, you need to read actively, paying less attention to the material unrelated to\nhealth, but reading carefully enough so that you find all the relevant material.\n\nSo, for this week... imagine yourself a Cambridge resident in 1840, weary of the\ncold, dreary winters. You and your family start talking about moving to the\nsouth or far west (the Mississippi River was then the western frontier). A friend\ngives you a copy of Flint's book, explaining that the book was written as a guide\nfor potential migrants. You read through the introduction, and flip through his\ncomments about some of the specific states (Florida, Alabama, etc.). As an\nambitious farmer, you are interested in the agricultural potential of these areas.\nBut you are also concerned about ensuring the health of you and your family.\nBased on your reading of Flint's excerpts, which state would you choose, and\nwhy? Within that state, what locale would you choose (e.g. port, forest, swamp,\nhilltop, floodplain, etc.), and why?\n\nAs with all of these assignments, keep it short (target: 200 words). There are no\nright or wrong answers; we are interested in your ability to understand the\nsources and think creatively about them. If you mention specific material from\nthe text, or use quotations, please provide page numbers."
    },
    {
      "category": "Resource",
      "title": "pap_asgmt3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/6da9ac76888ddbaef8f7486325df4b42_pap_asgmt3.pdf",
      "content": "STS.005: Disease and Society in America\nThird Paper Assignment\n\nCodes of Ethics\n\nDue at start of Lecture: 22 November 2005\n\nThe medical profession faced a crisis in the mid-19th century. Doctors doubted\nthe value of their treatments. Patients feared hospitals. Competition between\nmedical schools eroded educational standards. Few states bothered to regulate\nmedical practice. Unorthodox practitioners tempted patients with promises of\nsafer remedies. Many doctors looked for ways to reform their profession.\n\nIn 1846 a small group of doctors created the American Medical Association. The\nAMA quickly did two things: it appointed a committee on education reform and\nit adopted a Code of Medical Ethics. This was not the first time a group of\ndoctors had created such a code. The most famous example, the Hippocratic\nOath, was written by an unknown doctor around 400 B.C. Nor was it the last:\nthe AMA regularly revises the code to keep it relevant. For one example see the\n1957 Principles of Medical Ethics.\n\nA Code of Ethics is many things. It defines an ideal: what is an ideal doctor, and\nhow does a doctor behave? It reflects concern about image: how did doctors\nwant to be perceived by patients, practitioners, and governments? It exposes\ntransgressions: misbehaviors that are mentioned must not have been uncommon.\nCodes also leave much unsaid: what is missing can be as revealing as what is\nsaid. A code can reveal both the hopes and anxieties of a profession.\n\nWrite a 2000-word (6-8 page) essay that uses these three codes to explore and\nexplain the medical profession.\n\nStart with the 1847 Code of Ethics:\n\nFirst, what did its authors identify as the most important problems facing\nthe profession? What conflicts did doctors perceive? Devise a way to classify\ntheir concerns (e.g. disease theories, therapeutic practices, financial\narrangements, patient-doctor relationships, or whatever else you find in it).\nWhich concerns get the most attention?\n\nSecond, why did these concerns emerge? Why did doctors worry about\nthese issues in 1847? What does this reveal about the profession and its leaders?\n\nThird, examine the specific advice in the Code. What behaviors did the\nauthors recommend? How would these practices address the various concerns\nand anxieties and make medicine more credible and more appealing?\n\nThen answer one of the following sets of questions:\n\nOption One: compare the 1847 Code to the Hippocratic Oath and the 1957\nPrinciples. What anxieties persist? What does this reveal about medicine? Are\nthere important concerns that appear in one code but not in the others? If so,\nwhy? Medical ethicists now struggle with abortion, euthanasia, rationing, etc.\nDo any of these appear in the Codes? Why and why not? Feel free to speculate.\n\nOption Two: pick two of the practitioners whom we have discussed and\nexamine how well their behavior conforms to the ideals contained in the codes.\nDoes Martha Ballard embody the Hippocratic ideals? What would the authors of\nthe 1847 Code say about the interactions between Mather, Boylston, and\nDouglas? Between Ballard and Cony? Between Rush and his patients and his\npeers? Feel free to transgress temporal boundaries.\n\nOption Three: the readings and lectures have discussed many issues that\nhistorians have identified as ethical problems (medical racism; exclusion of\nwomen; Tuskegee; asylums and institutionalization; inoculation, etc.). Compare\ntwo specific cases to what you find in the ethics codes. Are these issues within\nthe scope of the codes? Do the codes address the range of problematic behavior\nin medicine? Are there significant blind spots in the codes? Why or why not?\nWhat do you think the codes' authors would say if asked about these issues?\n\nAs you formulate your answers, consider these guidelines and disclaimers:\n\n- Some of you have found past assignments too constrictive. If, after reading the\nthree codes, you have a different idea for an interesting paper about the codes\nand the profession, go for it. Just bounce the idea off your TA in advance.\n\n- The 1847 Code is long. You do not need to discuss every specific issue.\nIdentify a few major underlying concerns, justify your choice, and focus on them.\n\n- The AMA in 1847 did not represent the profession. Most doctors did not\nbelong. So be careful in your writing: do not simply generalize from \"the\nauthors of the code...\" to \"all doctors in 1847...\"\n\n- The three different codes were produced in radically different contexts.\nMedicine in 1957 was as different from medicine in 1847 as medicine in 1847 was\nfrom medicine in 400 BC. We have taught you nothing about Greek medicine,\nand have not yet gotten to 1957, so we are not expecting detailed, contextualized\nunderstandings of medicine in Greece or the 1950s. But don't just speculate\nblindly: make some effort to defend or document your assertions.\n\n- Make clear arguments, defended with specific, correct, and relevant evidence.\n\n- Your essays must be well organized and clearly written.\n\n- You must use material from at least three readings, from any of the weeks.\nPaul Starr might be especially helpful.\n\n- You must cite all sources (course readings, lectures, other readings) correctly,\nwith both the complete source and specific page number. If you have any\nquestions, see the information at the MIT Writing Center website. You can pick\nyour own style (e.g. CMS, parenthetical citations, etc.) -- just be accurate,\nconsistent, and complete.\n\n- Please put your name on a title page, but not on any pages of the body of the\npaper, so that we may grade the papers blind."
    },
    {
      "category": "Resource",
      "title": "week3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/f6e645f341eef823a7b77ade258aea1e_week3.pdf",
      "content": "Weekly Writing Assignment #3:\nReading Carefully\n\n-- Due in Section, week of 9/27 - 9/29 --\n\nThe first writing assignment asked you to imagine what Crosby would say about\nJones, with respect to virgin soil epidemics. Answering that question well\nrequired understanding the most important arguments made by each. Many of\nthe responses to the assignment instead picked one or two things said by each --\noften not the most important points -- and used those to predict how Crosby\nwould respond. This might be a correct answer, but it is not an ideal answer.\nThis assignment revisits the task of distilling the central arguments of secondary\nsources, something that will be crucial as the semester goes along, and something\nthat will improve your ability to make clear and important arguments in your\nown writing.\n\nThe year is 1834 and the mayor of New York City is running for re-election. His\nopponents are blaming him for the disastrous cholera epidemic of 1832, saying\nthat he failed to show leadership during a crisis. He hires you as a consultant,\nbecause of your expertise as a historian of medicine and public health, to help\nhim answer these attacks. He wants you to provide him with some brief talking\npoints about the epidemic and the government's response. Did anyone know\nthat the epidemic would strike? Could anything have been done to prevent the\nappearance of cholera in New York? Once the disease broke out in the city, were\nthere steps that city officials could have taken to contain the epidemic? Consider\nboth what could have been done in an ideal world, and what would have been\nrealistic in New York City in 1832. Feel free either to answer this question as you\nthink Rosenberg would answer, or to provide different answers based on what\nyou have learned from Rosenberg and filtered with your own creativity.\n\nAny similarity to the current debate about Katrina responses is not a coincidence,\nbut please stay focused on cholera in New York City.\n\nAs with all of these assignments, keep your advice short (target: 200 words).\nThere are no right or wrong answers; we are interested in your ability to\nunderstand the sources and think creatively about them. If you mention specific\nmaterial from the text, or use quotations, please provide page numbers."
    },
    {
      "category": "Resource",
      "title": "pap_asgmt4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/86c3caf6b36cb2259d6f8ee0ad51313e_pap_asgmt4.pdf",
      "content": "STS.005: Disease and Society in America\nFourth Paper Assignment\n\nDisease and Individual Responsibility\n\nDue at start of Lecture: 13 December 2005\n\nSocieties often respond to disease by holding individuals responsible for the\ndiseases that afflict them. This occurs both with explanations of disease and with\nresponses to disease, during dramatic epidemics and in the routine ailments of\neveryday life. Throughout the course we have seen countless examples. Virgin\nsoil theorists blamed Indian epidemics on deficiencies of Indian immune\nsystems. Timothy Flint urged settlers to take care as they exposed themselves to\nexotic environments. Health officials in San Francisco in 1900 blamed plague on\nChinese residents and quarantined Chinatown to contain the epidemic. Most\nrecently, HIV, tobacco, and obesity have all fueled controversies about individual\nresponsibilities, rights, and obligations.\n\nDrawing on what you have learned in this course, write a 2000-word (6-8 page)\nessay that answers the following two sets of questions:\n\n- First, in what ways are individuals responsible for the diseases that afflict\nthem? Does the level of responsibility differ between different diseases? Does\nthe way in which a disease is acquired (e.g. genetic, environmental, contagious,\netc.) matter in determining responsibility? Is it possible to develop a just and\nappropriate method for assigning responsibility in any given illness episode?\n\n- Second, should responsibility have consequences? Should the level of an\nindividual's responsibility for an illness determine how that illness is managed?\nConsider everything from coercive measures (e.g. quarantine), to assigning\npriority for treatment, determining cost of treatment, and deciding who pays for\ntreatment. If responsibility carries consequences, does that simply justify new\nforms of discrimination? Is it possible to distinguish between appropriate\nconsequences and punitive stigmatization?\n\nAs you formulate your answers, follow these guidelines.\n\n- Your answers to these questions must include clear and specific arguments.\n\n- Defend your arguments with specific examples drawn from the history of\nmedicine. You must discuss at least three different diseases. You must draw on\nmaterial from at least two different centuries.\n\n- You must use material from at least three (and preferably more) of the readings\nfrom this course. Many have obvious relevance, including: Crosby, Jones, Flint,\nValencius, Pernick, Rosenberg, Marmot, Wilkinson, Ulrich, Blake, Buchan, Starr,\nClarke, Jackson, Jones, Brandt, \"Discussion on the Advisability of the\nRegistration of Tuberculosis,\" Leavitt, Treichler, Specter, Jones & Brandt, and\nBrandt. Be sure to distinguish between primary and secondary sources and to\nuse each appropriately.\n\n- Your essays must be well organized and clearly written.\n\n- You must cite all sources (course readings, lectures, other readings if any)\ncorrectly; this includes both the source and the specific page number. If you\nhave any questions, see the information at the MIT Writing Center website\n(http://web.mit.edu/writing/). You can pick your own style (e.g. CMS,\nparenthetical citations, etc.) -- just be accurate, consistent, complete.\n\n- Please put your name on a title page, but not on any pages of the body of the\npaper, so that we may grade the papers blind."
    },
    {
      "category": "Resource",
      "title": "week4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/6fd543e9756f28e52790d3714ba61ec1_week4.pdf",
      "content": "Weekly Writing Assignment #4:\nGraphs, Graphs, Graphs!\n\n-- Due in Section, week of 10/04 - 10/06 --\n\nThe assignments so far have focused on extracting arguments from secondary\nsources and finding meaning in primary sources. The readings for this week go\nin a different direction: analysis of quantitative health information. As explained\nin the study guide for the readings, quantitative analysis has many appeals and\npitfalls. Good data can answer questions that cannot be addressed with written\nsources. But data can be incomplete or flawed, and even if the data are correct,\nthey might not actually support the conclusions being drawn. Your job is to\nbecome a skillful consumer of health data, especially when that data is\ntransformed into its most common form, a graph. As you will see, the readings\nthis week are full of them: Omran has sixteen, the McKinlays twelve, Wilkinson\nseven, and Marmot six.\n\nYour advice to the Mayor of New York about cholera epidemics helped him win\nre-election in 1832. You stay on as his health policy advisor and follow the twists\nand turns in his long career until the present day. He is now a senator, again up\nfor re-election. The first debate did not go well. \"We kept getting questions\nabout health policy. My opponent must have been prepped. He kept putting up\ngraph, after graph, after graph to prove his points. I didn't have any, I didn't\nunderstand his, and so I looked like an idiot. This morning I went to MIT's Open\nCourseware site and found a bunch of articles that had lots of graphs, but there\nare too many of them for me to sort out. Can you help?\"\n\nSpecifically, the Senator wants you to sift through the articles and find the ONE\ngraph that you think is most important, most useful, most interesting, or most\nsurprising. He wants you to interpret the graph for him, identify its strengths\nand weaknesses, and explain why you chose that graph. Whenever his opponent\npulls out graphs in the future, the Senator wants to be able to pull out your\ngraph, say \"what's actually important is...\" and end up sounding like a\nsophisticated health policy analyst.\n\nThe Senator's attention span still has not improved, so keep your advice concise\n(200 words). Many of the graphs are important, useful, interesting, surprising --\nthere is not a right or wrong choice. We are interested in what caught your eye,\nand why. If you mention specific material from the text, or use quotations,\nplease provide page numbers."
    },
    {
      "category": "Resource",
      "title": "week5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/4f2a8655c29e870706b3caedddd9fa2d_week5.pdf",
      "content": "Weekly Writing Assignment #5:\n\nThere are no new readings for this week, and no new writing assignment.\nInstead, please focus your efforts on the first paper assignment."
    },
    {
      "category": "Resource",
      "title": "hel_dis_bef_col.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/4ca419cd7576758e88bd1537190f0ec8_hel_dis_bef_col.pdf",
      "content": "09/13 Health and Disease before Columbus\n\nOrigins of Americans\n\nBering land bridge and the problem of pre-Clovis remains\n\nSkeletal evidence\n\nLinguistic evidence\n\nGenetic evidence\n\nModern debates\n\nOverview of American Societies\n\nOlmec\n\nTiwanaku\n\nCahokia\n\nInca\n\nAztec: Tenochtitlan larger than Paris in 1490\n\nOverall population: 44,000,000?\n\nHealth of Americans\n\nPaleopathology: Backbone of History\n\nDangerous lives of hunter-gatherers\n\nAgricultural transition: a threat to health?\n\nUrbanization: crowding, malnutrition, violence, and disease\n\nCoastal populations: remarkable health\n\nHealth index and life expectancy: declining health over time before 1492"
    },
    {
      "category": "Resource",
      "title": "intro_dis_med.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/01f1efef3bb3032afd20eb949596234a_intro_dis_med.pdf",
      "content": "09/08 Introduction: Disease, Medicine, and Society\n\nDisease and Medicine in 1900 vs. 2000\n\nRole of hospitals\n\nStatus of doctors\n\nLeading causes of disease\n\nWhat Is a Disease?\n\nSymptoms, etiology, treatments\n\nResponses to Disease: Much that Is Odd and Unexpected\n\nTerry Schiavo\n\nHemorrhagic fevers\n\nSARS and Bird Flu\n\nBiDil and racial medicine\n\nKatrina and hospitals in New Orleans\n\nRising price of health insurance\n\nOur Goal: Understand the Changing World of Disease and Medicine"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/8163e7537653bb295888f868a9915c22_lec_3.pdf",
      "content": "09/15 Virgin Soil Epidemics\n\nDisease Before Columbus\n\nDisease-free paradise vs. evidence of infectious diseases\n\nEncounter and Devastation\n\nHispaniola: Las Casas\n\nTenochtitlan & Broken Spears: from 25,000,000 to 1,000,000\n\nQuebec\n\nRoanoke\n\nNew England: 1616-1619, 1633-1634\n\nOverall, 90% decline in first century after contact\n\nEpidemics and demoralization?\n\nImpact on Europeans: corn, potatoes, tomatoes, and tobacco...\n\nHow Many Died?\n\nHistorical records\n\nArcheological evidence\n\nEcological theories\n\nEpidemiological extrapolations\n\nWhy Did They Die?\n\nEvidence of infections\n\nWhy were Indians susceptible?\n\nNatural selection and virgin soil theory\n\nRole of malnutrition\n\nContingency and social causation\n\nHealth Disparities Today: Biological and Social Explanations"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/3d9434932e201d5f4df243b27407c096_lec_4.pdf",
      "content": "09/20 The Health of Colonists\n\nHealth Conditions in Early Modern Europe\n\nLaw of Natural Urban Decline\n\nEpidemics: Bubonic Plague and Smallpox\n\nEndemic disease: low life expectancy\n\nDisparities: rich vs. poor, urban vs. rural\n\nColonization and Health\n\nSea voyages: invigorating or abysmal?\n\nArrival, exposure, and high mortality\n\nRoanoke: vanishing colonies\n\nPemaquid: abandoned\n\nJamestown: 80% mortality 1607-1625\n\nPlymouth: 50% die first winter\n\nMassachusetts Bay: initial failures, eventual success\n\nDemographic Trajectories\n\nNew England Indians: steady and dramatic decline\n\nMassachusetts Bay: 2.7% growth over 17th century\n\nMiddle Colonies: immigration and growth\n\nChesapeake Colonies: population not able to reproduce itself until 1700\n\nAfricans in America: the slave trade\n\nHealth Disparities\n\nUrban vs. rural\n\nNorth vs. south\n\nMortality and Culture: Providence and Faith"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/52361e33f03166a3ccb14558714bf519_lec_5.pdf",
      "content": "09/22 Disease and the Environment\n\nHealth Intuition\n\nDoes getting cold and wet increase your risk of getting a cold?\n\nAre people raised in warm climates less tolerant of cold weather?\n\nColonial Perspectives\n\nEnvironment as source of health and disease\n\nDangers of New England winters\n\nDangers of Virginia summers\n\nSources of health: clear air, fresh water, summer breezes, corn\n\nMigration, new environments, and seasoning\n\nDisease Theory in Colonial America\n\nHippocrates, Airs, Waters, Places\n\nHumoralism\n\nAdjustment of bodies to environments\n\nDangerous environments, or unwise behaviors?\n\nWere Environments Dangerous? Modern Perspectives\n\nRace, Environment, and Disease\n\nInitial ideas of racial similarity\n\nDisease and emergence of ideas of racial difference"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/30dc0dd9eb0bbc8d46d1211a8039bdda_lec_6.pdf",
      "content": "09/27 Urbanization and Public Health\n\nHealth Environments\n\nNatural vs. urban environments\n\nHow many hours are you outside each day?\n\nUrbanization\n\n1700: 90% of Americans live in towns < 5000\n\nBoston, New York, Philadelphia, and Charleston\n\nImmigration and urban growth in the 19th century\n\nBoston\n\nNew York\n\nNew Orleans\n\nHealth of Cities\n\nSubstantial urban vs. rural disparities\n\nMortality increased with increasing immigration\n\nSqualor: garbage, sewage, animals: only 20% take one bath per year\n\nEpidemics: smallpox, measles, yellow fever, cholera\n\nEpidemiology 101\n\nEpidemics vs. endemic\n\nVirulence\n\nDisease Theories in the 19th century\n\nMiasmatism vs. contagionism\n\nConstitution\n\nMorality and religion\n\nResponding to Epidemics\n\nMiasmatists: flee environment, or change environment: sanitation\n\nContagionists: quarantine, isolation, disinfection\n\nCase: Cholera Years\n\nChanging theories of disease: John Snow\n\nRise of effective government responses\n\nHealth and Environments: Hurricane Katrina"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/6aac7f188f5794890e056cd907f6ff6b_lec_7.pdf",
      "content": "09/29 The Decline of Tuberculosis\n\nEpidemiology 101\n\nImportance of mechanism of spread\n\nWater- and food-borne pathogens: Jack in the Box\n\nSexually transmitted infections\n\nAirborne pathogens\n\nDifferent routes of spread require different responses\n\nTuberculosis\n\nEpidemiology: 2,000,000,000 people infected\n\nPathophysiology: consumption\n\nInfection vs. disease\n\nChronicity\n\nSocial determinants of mortality\n\nTuberculosis in the 19th Century\n\nAncient origins: Egyptian and Andean mummies\n\nRise to dominance\n\nDisparities between rich and poor\n\nCulture of tuberculosis: Keats, Shelley, Bronte Sisters, Poe, Les Miserables\n\nResponses: treatments, sanatoria, health migrants\n\nDecline of Tuberculosis\n\nNot caused by natural selection: Lipsitch & Sousa\n\nMedical care and the McKeown hypothesis\n\nPublic health and sanitation?\n\nMalnutrition?\n\nPolitics and socioeconomic change?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/84f442c7fd1d3566a3653c076e28ae60_lec_8.pdf",
      "content": "10/04 Epidemiological Transitions and Health Disparities\n\nPopulation Growth\n\n1800: 1,000,000,000\n\n1927: 2,000,000,000\n\n1974: 4,000,000,000\n\n1999: 6,000,000,000\n\n2005: 3 people born each second, 10,000 per hour\n\nCauses of Growth\n\nIncreased fertility vs. decreased mortality\n\nEpidemiological Transitions: Abdel Omran\n\nAge of Pestilence and Famine\n\nAge of Receding Pandemics\n\nAge of Degenerative and Man-Made Diseases\n\nImpact on culture: changing ideas about marriage and children\n\nWhy Did Infectious Diseases Decline?\n\nMcKinlay & McKinlay and the role of medicine\n\nDifferent models for different countries\n\nMultifactorial explanations\n\nThe Rise (?) of Chronic Diseases\n\nUnmasked by an aging population\n\nOr created by changed conditions of life? -- \"diseases of civilization\"\n\nCase: mental illness\n\nImplications for Health Policy\n\nPredicting future patterns of disease and mortality\n\nThe role of medicine\n\nIs the Transition Reversible?\n\nCase: HIV and sub-Saharan Africa\n\nCase: Russia\n\nCase: obesity and the US in the 21st century?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/54472da286479a8e6e2f4045f7466a3b_lec_9.pdf",
      "content": "10/06 The Determinants of Health and Disease\n\nOmran's Model and the Subtleties of Health Disparities\n\nNorth-south, urban rural, white-nonwhite differential\n\nIndia: extreme internal heterogeneity\n\nHistories of Health Disparities\n\nPre-Columbian America: urban vs. coastal, social hierarchies\n\nVirgin Soil Epidemics: mortality varied from population to population\n\nHealth of Colonists: urban vs. rural, north vs. south\n\nHealth and Environment: white-black-Indian differentials\n\nUrbanization: immigration, poverty, and ill-health\n\nTuberculosis: rich vs. poor\n\nEpidemiological Transitions: developed vs. developing countries\n\nDisparities in 2005\n\nWhite-Indian\n\nWhite-Black\n\nRich-poor: the politics of data collection in the US\n\nCause of Disparities\n\nRace?\n\nEducation\n\nSES\n\nHealth behaviors\n\nWilkinson: ill-health and relative disparity\n\nMarmot: ill-health and social hierarchies\n\nSocial capital, social control\n\nImplications for Health Policy\n\nIf not redistribution of wealth, then what?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-005-disease-and-society-in-america-fall-2005/4e2e4d84a50e53906819849bd23a1e7f_lec_10.pdf",
      "content": "10/13 Debate: Disease History and Health Policy\n\nDiscussion of the first paper assignment"
    }
  ]
}