{
  "course_name": "Doctoral Seminar in Research Methods I",
  "course_description": "This course is designed to lay the foundations of good empirical research in the social sciences. It does not deal with specific techniques per se, but rather with the assumptions and the logic underlying social research. Students become acquainted with a variety of approaches to research design, and are helped to develop their own research projects and to evaluate the products of empirical research.",
  "topics": [
    "Social Science",
    "Social Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nInstructors\n\nProfessor Lotte Bailyn\n\nProfessor Jesper B. Sorensen\n\nCourse Overview\n\nThis course is designed to lay the foundations of good empirical research in the social sciences. It does not deal with specific techniques per se, but rather with the assumptions and the logic underlying social research. Students become acquainted with a variety of approaches to research design, and are helped to develop their own research projects and to evaluate the products of empirical research.\n\nStudents will work in groups to design and carry out a small research project. Group results will be presented orally to the class at various points during the semester, with a final public presentation that will be open to the Sloan community. A group written report is due at the end of the semester. There will also be 2 individual assignments.\n\nTextbook\n\nOne text is available at the bookstore and also on reserve in the library:\n\nSingleton, R. A., Jr., and Bruce C. Straits.\nApproaches to Social Research\n. 3rd ed. New York: Oxford University Press, 1999. ISBN: 0195105257. (S&S)\n\nReadings will also be made available.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nGroup Project\n\n50%\n\nAssignment I\n\n15%\n\nAssignment II\n\n15%\n\nParticipation\n\n20%\n\nIndividual Assignments\n\nDue five days after lecture 6 (15% of grade)\n\nYou will be asked to write a paragraph analyzing some data you will be given in lecture 6. You will attach one table (in presentational form) to the paragraph and should refer to this table in your paragraph. It is not necessary to do any statistical tests for this assignment. Two copies should be handed in five days after lecture 6, one for discussion (anonymously) in lecture 7, and one to be corrected, commented on, and graded.\n\nDue in lecture 11 (15% of grade)\n\nYou will be asked to do a methodological analysis of an article, which will be given out in lecture 9. You will have four articles to choose from for this assignment.",
  "files": [
    {
      "category": "Resource",
      "title": "Group Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-347-doctoral-seminar-in-research-methods-i-fall-2004/ea26459996d26be4c8fc00b06e65c9dd_group_project.pdf",
      "content": "Group Project\nIn scholarly communities, the significance of a piece of research is judged by the extent\nto which it advances existing knowledge about a particular theoretical process or\nempirical phenomenon, or establishes a new line of inquiry. As a step toward developing\nthe skills necessary for making a scholarly contribution, the main assignment in the\ncourse is design a small research project to be carried out during the semester.\nThe research project should be conceived as a (potential) contribution to an existing body\nof research. As first-year students, you are of course unlikely to be deeply familiar with\nexisting bodies of research. We will therefore provide several (short) reading lists that\nhighlight some central pieces of argument and evidence in a particular line of work. The\nparticular research question that you choose to pursue is up to the group. You are not\nobligated to restrict yourself to the reading lists that we provide. However, in designing\nthe research project, you are required to define how the research might contribute to an\nexisting body of knowledge.\nAfter deciding on a research question, you then need to decide how you are going to go\nabout gathering the data you need to answer the question. Then you have to find a source\nof data to carry out your research. This could involve collecting original data from any\nsetting, e.g., a class, a store, a committee, a community organization. You may also use\nan already existing data set if you do so creatively. Finally you need to analyze your data\nand write up your results.\nThe project is meant to be small in two ways. First, you must design the project so that it\nis doable in this semester. Second, it will not be necessary to do a full literature review:\nyou can also use your experience, things you've read in other classes, your hunches, etc.,\nto give context to your project.\nDoing a project in a group has both advantages and disadvantages. Working in a group\nmeans that time needs to be spent up front to get to know each other, understand the task,\nand decide how to proceed. On the other hand, having a number of people can ease the\nassignment by dividing initial responsibilities and tasks. Note, however, that this is a\ngroup product and will be graded in that way.\nThe timing is guided by the presentations in class:\nOctober 7\nResearch proposal reports - here each group will describe to the\nclass the question they want to investigate and the way they think they will go\nabout getting data; this is a good occasion to get help from the class in\nformulating a final design\nNote: prior to this first report, each group needs to make an out-of-class\nappointment to go over their preliminary ideas\nNovember 18 Progress reports - each group will report on their progress - again\n\nthis is a chance to get help from the class\nDecember 4 Final public group reports - each group will\ngive a final formal presentation on their research project\nDecember 11 final written group report is due"
    },
    {
      "category": "Assignment",
      "title": "Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-347-doctoral-seminar-in-research-methods-i-fall-2004/13a5d7e3ac8d7dc03f375a773526afd0_assignment_1.pdf",
      "content": "15.347\nWrite a succinct paragraph that tells the story embodied in the attached data. To support\nyour story, devise an appropriate table and refer to this table in your paragraph. Be sure\nto attach your table to your paragraph.\nYou may assume that measurement is reliable and valid. You do NOT need to use any\nstatistical tests.\nHand in 2 copies on September 14 (TUESDAY) or send by email\nData:\nThese data stem from a survey of male MIT graduates from classes in the 1950s. The\ndata were collected in 1970. Three variables are used:\nSatisfaction with current job: based on a 5 point scale with 5=very great\nsatisfaction and 1-3=not great\nPlans to stay: based on answers to an open ended question asking how long he\nthought he would remain with the organization he was currently working for\nAccommodation of work to family: based on an index with two components\n1. 2 family questions: importance of job which leaves enough time for\nfamily and personal life; relative greater satisfaction from family than\ncareer\n2. 2 work questions: not high aspirations for career; success at work not\nvery important\nAssignment 1\n\nAccommodation\nHigh\nLow\nSatisfaction with job:\nGreat\nNot Great\nGreat\nNot Great\nRemaining in present\norganization:\ndefinitely plan\nto stay\nnot sure, but\npossibly leave"
    },
    {
      "category": "Assignment",
      "title": "Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-347-doctoral-seminar-in-research-methods-i-fall-2004/ad43d6c188cd35c73baabddbcfe5d6bb_assignment_2.pdf",
      "content": "15.347\nAssignment 2\nSelect the article you want to review and respond to the following questions:\n1.\nWhat is the research question? Why is this research question important?\n2.\nWhat is the author's conceptual model of the phenomenon? Describe the\nconceptual model in writing, and also provide a sketch of the key conceptual\nrelationships.\n3.\nConsider the author's empirical model of the phenomenon. What are the key\nempirical indicators of the concepts? Sketch the observed relationship between\nthe key empirical indicators.\n4.\nHow good is the match between the conceptual model and the empirical model?\nDoes the empirical evidence give you more or less confidence in the conceptual\nmodel, or is it indeterminate?\n5.\nHow did the author arrive at his or her evidence? What are the key advantages of\nthe chosen research design? What are the key disadvantages?\n6.\nSuggest a (feasible) way to address the shortcomings you see in this research,\neither using the available data or by collecting additional evidence.\n7.\nAny other comments on the methodology in the article you have chosen?\nNote: This is an individual assignment. What this means is that you are expected to\nwrite this paper on your own. However, you may partner with one person who is doing\nthe same article to discuss the above questions. If you decide to do this, please put the\nname of your partner on your final paper."
    }
  ]
}