{
  "course_name": "Downtown Management Organizations",
  "course_description": "This course focuses on the origins, functions, and implications of downtown management organizations (DMOs), such as business improvement districts, in a variety of national contexts including the United States, Canada, South Africa, and the United Kingdom. It critically examines how a range of urban theories provide a rationale for the establishment and design of DMOs; the evolution and transnational transfer of DMO policy; and the spatial and political externalities associated with the local proliferation of DMOs. Particular emphasis is given to the role of DMOs in securing public space.",
  "topics": [
    "Social Science",
    "Public Administration",
    "Regional Politics",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Social Science",
    "Public Administration",
    "Regional Politics",
    "Sociology",
    "Community Development",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis course focuses on the origins, functions, and implications of downtown management organizations (DMOs). Students who take this course will explore a variety of arrangements for managing and governing the downtown, including but not limited to, downtown business associations, business improvement districts (BIDs), and joint municipal authorities. By reading and discussing a rich and diverse set of scholarly papers and speaking with experts (both practitioners and academics), students will come to understand the underlying rationale and contemporary challenges associated with implementing these schemes in the United States, Canada, South Africa, and the United Kingdom. Finally, students will apply their knowledge by generating a set of recommendations for revitalizing the French Quarter of New Orleans.\n\nCourse Objectives\n\nThis is a seminar course about downtowns - their initial dominance, their subsequent decline, and the tools and practices that have contributed to their recent revitalization. It is also a course that offers students an opportunity to put their knowledge into action by contributing to the revitalization of New Orleans. The major questions addressed in this seminar are as follows.\n\nWhat are downtowns? When and why did they prosper? When and why did they decline?\n\nIs there ample evidence to support the argument that downtowns are making a comeback?\n\nWhen, why, and in what ways have downtowns been revitalized?\n\nWhich downtown revitalization tools and practices appear to be most effective?\n\nIn what ways are these tools and practices ineffective and/or controversial?\n\nHow do downtown revitalization tools and practices vary in the U.S.? Across national contexts?\n\nHow can we apply this knowledge to the revitalization of the French Quarter in New Orleans?\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten Assignments\n\n50%\n\nContribution to Group Project\n\n30%\n\nClass Participation\n\n20%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/3642fd013ebcca90a7a045e34d30bd91_lecture1.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.422 Business Improvement Districts\nLecture One\nOverview\n-Introduction to the Course\n-What is a BID?\n-Other Revitalization Strategies\n- Theoretical Framework for Understanding the BID Movement\nIntroduction to the Course\n-Who Are We and Why Are We Here?\nSign-in Sheet\nPersonal Introductions\n-Beyond the Topic of Business Improvement Districts\nThe Notion of Urban Revitalization\nThe Proliferation of BIDs\nYour Role in Shaping the World\n-The Next 14 Weeks\nCourse Syllabus\nOrganization of Course: Three Parts (Flow Diagram)\nPart One: Case Studies (Lectures, Participation and Assignments 1 & 2)\nPart Two: Critical Evaluation (Lectures, Participation and Assignments 2 & 3)\nPart Three: The Future (Lectures, Participation and Assignment 4)\nWhat is a BID?\n-No Naming Convention\nVariations include, \"self-supported municipal improvement districts (Iowa),\"\n\"special improvement districts (New Jersey),\" \"special business districts (Missouri),\"\n\"public improvement districts (Texas),\" \"economic improvement districts\n(Oregon),\"\n\"parking and business improvement associations (Washington),\" \"improvement districts\nfor enhanced municipal services (Arizona),\" and \"municipal special services districts\n(Connecticut).\"\nAs well as, \"Business Improvement Areas (Canada),\" and \"City Improvement\nDistricts (South Africa).\"\n-No Standard Definition\n\nGeneral:\nself-imposed\nfinancing\nmechanisms\nimplemented\nby\nbusiness\nand\nproperty owners for local improvements, specifically the enhancement of public\nservices\nHoustoun: may rely solely on voluntary donations\nMitchell: must impose an added tax or fee on all the properties and/or businesses\nHoyt: Publicly endowed and privately managed organizations with geographically-based\nand compulsory memberships whose principal funding source is a self-taxing\nmechanism. Typically, these organizations provide services to improve the pedestrian\nexperience with the expectation of increasing revenues and property values.\nLevy: See Readings\nBriffault: See Readings\n-Assignment One: Due in Week Three.\nOther Revitalization Strategies\n-Special Purpose Districts\nSimilarities: A class of government to which the state grants certain powers; citizens\nform these governments to perform specific functions, entity possesses a unique\ngeographic scope, membership, and purpose; legally independent of other local\ngovernments and typically establish boards to govern their activities.\nDifferences: Special purpose districts rely upon a variety of revenue sources including\nproperty tax levies, funds from bond issues, grants, user fees, rents, special assessments,\nand other taxes, while most BIDs generate the majority of their revenue by imposing an\nadditional tax on property owners within their boundaries. Special purpose districts\nprovide such services as fire protection, sewer, transit, water, housing, drainage, libraries,\nparks, and sanitation, while BIDs focus on marketing, sanitation, streetscape\nimprovement, security, transportation and social services.\n-Special Assessment Districts\nSimilarities: The special assessment district is a form of specialized government that\nfunctions at the local level. They are \"coercive\" monetary collection mechanism.\nDifferences: Monies are typically used to finance capital improvements for the expansion\nof roads, sidewalks, sewers, and utilities in new residential areas. They are not\nindependent legal entities.\n-Special Zoning Districts\nSimilarities: With the power granted to local governments, municipalities can institute\nzoning districts to improve the pedestrian environment.\n\nDifferences: The zoning power allows for the municipality to mandate land use and\ndesign guidelines.\n-Main Street Programs\nSimilarities: Aim to improve all aspects of commercial areas by improving economic\nmanagement, strengthening public participation, making downtown a fun place to visit\nattracting new businesses, rehabilitating buildings, expanding parking, etc.\nDifferences: Programs often rely on state and local funding; they are not entirely self-\nsustaining.\n-Tax Increment Financing Districts\nSimilarities: Mechanism authorized by state statute and adopted by municipalities that\nallows the city to designate an area for improvement.\nDifferences: TIF allows reallocation of property tax revenues (does not impose a new\ntax) such that future growth in property tax revenues are forwarded to the TIF authority\nto finance debt. Often used for property acquisition, condemnation, infrastructure\nimprovements, sports facilities, etc.\n-Miscellaneous (UDAG, Urban Renewal, HOPE VI, Enterprise and Empowerment Zones etc.)\nTheoretical Framework for Understanding \"The BID Movement\"\n-Why Policy Network Theory? (Marsh and Rhodes, 1992)\n-Movement is evidence of a transnational urban spatial/economic development policy network\n-Policy transfer (acquisition and utilization of knowledge about policies elsewhere\n-Transfer takes place within a network\n-What is a Policy Network?\n-Networks are not formal organizations, rather loose patterns of communication\n- Principle Elements: Membership, Structure, and Capacity\n-Consist of actors involved in policy making\n-Actors can facilitate or impede policy learning (openness to new knowledge)\n-What causes actors to act? Perception of the situation (crisis? opportunity?)\n-Policy Transfer: \"Emergence\" Versus \"Success\""
    },
    {
      "category": "Resource",
      "title": "ausnz2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/1d0c657231c9acce0015b88e9c6481f8_ausnz2.pdf",
      "content": "Mainstreets and Town center Associations in\nMainstreets and Town center Associations in\nin Australia and New Zealand\nin Australia and New Zealand\nNew Zealand\nNew Zealand\n\nBackground\nBackground\n\nThe emergence of Main streets Associations and Town center\nThe emergence of Main streets Associations and Town center\nAssociations\nAssociations\n\nInstitutional Actors\nInstitutional Actors\n\nCase Example :\nCase Example : Tapakuna\nTapakuna Beach\nBeach\n\nRole of local governments\nRole of local governments\n\nFuture Trends\nFuture Trends\nSpanish Mission Building and Hastings Tourism Office, Hastings, New\nZealand\n\nNew Zealand\nNew Zealand\nBackground\nBackground\n\nProliferation of suburban malls from the 1960\nProliferation of suburban malls from the 1960''s to 1980\ns to 1980''s hollowed out\ns hollowed out\nthe traditional town centers\nthe traditional town centers\n\nThe response of traditional town centers was the importation of\nThe response of traditional town centers was the importation of the\nthe\n\"\"Mainstreet\nMainstreet\"\" model for town center revitalization\nmodel for town center revitalization\n\nThe Mainstreet Program in New Zealand was promoted primarily by\nThe Mainstreet Program in New Zealand was promoted primarily by\ncity center business, council planners, urban designers and heri\ncity center business, council planners, urban designers and heritage\ntage\npreservationists.\npreservationists.\n\nImprovements in the built environment as well as promotional ev\nImprovements in the built environment as well as promotional events\nents\nand branding were the main focus.\nand branding were the main focus.\n\nCurrently, there are about 150 Mainstreets and Town center\nCurrently, there are about 150 Mainstreets and Town center\nOrganizations in New Zealand\nOrganizations in New Zealand\n\nThe Mainstreets Five Point Plan\nThe Mainstreets Five Point Plan\n\nBuilt Environment/ Landscape and Design\nBuilt Environment/ Landscape and Design\n\nHeritage and Environment\nHeritage and Environment\n\nBusiness Improvement\nBusiness Improvement\n\nMarketing\n\nPromotions\nProblems:\nProblems:\n\nOperations and financial sustainability were neglected\nOperations and financial sustainability were neglected\n\nUrban design and improvements in the built environment were\nUrban design and improvements in the built environment were\nemphasized over local community development\nemphasized over local community development\n\nInitially, most Councils granted\nInitially, most Councils granted sums of $10,000\nsums of $10,000--$30,000 to their town center\n$30,000 to their town center\nBusiness Associations, to assist them to function.\nBusiness Associations, to assist them to function.\nCurrent thinking is that Town Centers can achieve financial sust\nCurrent thinking is that Town Centers can achieve financial sustainability\nainability\nthrough the self\nthrough the self--funding mechanism of Separate Rating (SR). Separate\nfunding mechanism of Separate Rating (SR). Separate\nRating is acknowledged by virtually all town center organization\nRating is acknowledged by virtually all town center organizations as the only\ns as the only\nmeans possible for them to become competitive with the encroachm\nmeans possible for them to become competitive with the encroachment and\nent and\nproliferation of mall development in New Zealand.\nproliferation of mall development in New Zealand.\nCurrently in New Zealand there are approximately forty to fifty\nCurrently in New Zealand there are approximately forty to fifty town centers\ntown centers\nwhich have self\nwhich have self--funding Town Centers.\nfunding Town Centers.\nFinancing Town and City Centers\nFinancing Town and City Centers\n\nWhat does Separate Rating imply?\nWhat does Separate Rating imply?\n\nSeparate rating policy is implemented to enable the local\nSeparate rating policy is implemented to enable the local\ncommercial center to implement business improvement and\ncommercial center to implement business improvement and\nmarketing initiatives for the town center as well as undertake\nmarketing initiatives for the town center as well as undertake\nstrategic issues.\nstrategic issues.\n\nA separate rate is a levy, or rate is imposed on a defined\nA separate rate is a levy, or rate is imposed on a defined\ncommercial sector of a town or city. The rate often based on a\ncommercial sector of a town or city. The rate often based on a\npercentage of land value and must meet the pre\npercentage of land value and must meet the pre--determined policy\ndetermined policy\nor policies of the local Council to be implemented.\nor policies of the local Council to be implemented.\n\nFor a separate rate to be stuck on a commercial sector, the Loca\nFor a separate rate to be stuck on a commercial sector, the Locall\nCouncil legally must have a policy in place to determine the\nCouncil legally must have a policy in place to determine the\nframework within which the rate can be struck.\nframework within which the rate can be struck.\n\nThe Town Centre Development Group is the principle advocacy\nThe Town Centre Development Group is the principle advocacy\ngroup that lobbies local governments to put in place Separate Ra\ngroup that lobbies local governments to put in place Separate Rating\nting\npolicies\npolicies\n\nCase Example:\nCase Example: Takapuna\nTakapuna Business Development\nBusiness Development\nConcept\nConcept\nThe\nThe Takapuna\nTakapuna Business\nBusiness\nDevelopment concept was\nDevelopment concept was\ndeveloped by the Town Centre\ndeveloped by the Town Centre\nDevelopment Group , an\nDevelopment Group , an\nassociation of professionals who\nassociation of professionals who\nwork together in separate but\nwork together in separate but\nrelated disciplines in the\nrelated disciplines in the\ndevelopment of town and city\ndevelopment of town and city\ncenters and community\ncenters and community\norganizations.\norganizations.\n\nTakapuna\nTakapuna Business Development Concept\nBusiness Development Concept\n\nIn 1999 a foot traffic count taken in\nIn 1999 a foot traffic count taken in Takapuna\nTakapuna found that of 13 areas\nfound that of 13 areas\nin\nin Takapuna\nTakapuna CBD area, all were in decline with 12 empty shops in\nCBD area, all were in decline with 12 empty shops in\nHurstmere\nHurstmere Road, which once was considered the prime shopping\nRoad, which once was considered the prime shopping\ncentre of North Shore City.\ncentre of North Shore City.\n\nT\nhe\nTakapuna Bus\niness As sociation had been concerned about the\ndecline for many years and had over a 5 year period had attempte\nd\nto raise interest and give profile to separate rating (SR). In 2\n000 the\nTakapuna\nBusines s Association gained funding from North Shore\nCity Council, contracted Town Centre Development Group (TCDG)\nCity Council, contracted Town Centre Development Group (TCDG)\nto undertake the SR process which was successful. The rate was\nto undertake the SR process which was successful. The rate was\nimplemented in July 2001.\nimplemented in July 2001.\n\nTakapuna\nTakapuna Business Development Concept\nBusiness Development Concept\n\nThe main focuses of the Development concept were architecture\nThe main focuses of the Development concept were architecture\nand physical environment,\nand physical environment, ''branding\nbranding'', and creating a sense of place.\n, and creating a sense of place.\n\nOne of problems identified was that the beach frontage was cut\nOne of problems identified was that the beach frontage was cut off\noff\nfrom the CBD area with all commercial buildings backing onto the\nfrom the CBD area with all commercial buildings backing onto the\nbeach.\nThe plan saw the need to create physical links betwee\nbeach.\nThe plan saw the need to create physical links betweenn\nthe\nthe Takapuna\nTakapuna CBD area and the beach.\nCBD area and the beach.\n\nTo begin the process of creating a sense of place and developing\nTo begin the process of creating a sense of place and developing\nTakapuna\nTakapuna as a destination, it was decided to undertake a branding\nas a destination, it was decided to undertake a branding\nexercise. Though they decided to preserve enclaves of interest s\nexercise. Though they decided to preserve enclaves of interest such\nuch\nas\nas-- arts/theatre precinct; financial/professional precinct; shoppin\narts/theatre precinct; financial/professional precinct; shoppingg\nprecinct;\nprecinct; Takapuna\nTakapuna required unifying or branding to bring it together\nrequired unifying or branding to bring it together\nas an overarching\nas an overarching ''whole\nwhole''..\n\nBranding workshops were undertaken with members of the local\nBranding workshops were undertaken with members of the local\ncommunity,\ncommunity, Takapuna\nTakapuna Business Association and members of the\nBusiness Association and members of the\nlocal Council. The branding workshops identified\nlocal Council. The branding workshops identified Takapuna\nTakapuna''ss\npersonality as conservative, individual and described as\npersonality as conservative, individual and described as ''a comfy old\na comfy old\nslipper\nslipper''..\n\nThe vision for the new\nThe vision for the new Takapuna\nTakapuna was a dynamic, vibrant place to\nwas a dynamic, vibrant place to\n''live well, play well and work well\nlive well, play well and work well'' -- values which encompassed the\nvalues which encompassed the\ncommunity and business sectors alike\ncommunity and business sectors alike\nTakapuna\nTakapuna Business Development Concept\nBusiness Development Concept\n\nT\naking the l ong white sand beach alongside the CBD area as the\nkey icon, the first step was a name change for\nTakapuna to\nTakapuna\nBeach.\n\nT\nhe\nTakapuna Bea\nch Busin ess Association's (TBBA) e\narly task was\nto create ambience in the CBD area\n-through street performance,\ncolorful flags and banners in a marine theme.\n\nIn the first year of operation , $60,000 was spent town centre\nIn the first year of operation , $60,000 was spent town centre\ndevelopment. The first year of operations also featured street\ndevelopment. The first year of operations also featured street\nperformance and music on the streets, which began to create a\nperformance and music on the streets, which began to create a\nsense of interest. Commercial vacancies had been reduced from 12\nsense of interest. Commercial vacancies had been reduced from 12\nto 2.\nto 2.\n\nThe Role of Local Government\n\nT\no assist selected town and Local Authorities to undertake much-\nneeded capital works\nprogrammes which will (1) unde\nrpin local\nidentity/brand and (2) create local benefits socially, environme\nntally\nand economically.\n\nT\nhe self-\nfunding mechanism of SR should be matched dollar to\ndollar by local government, because the resultant\ncommunity and\npublic benefits.\n\nAt present, there is an overlapping of functions between local\nAt present, there is an overlapping of functions between local\ngovernment and Town Centre organizations, with local governments\ngovernment and Town Centre organizations, with local governments\ninvolved in brand building and tourism promotion as well.\ninvolved in brand building and tourism promotion as well.\n\nFuture Trends?\ncenters economically, socially and environmentally, which\n\nthey believe are not yet being realized. The paper was\n\napproved and adopted by the NZLP prior to the last election\n\nand is currently being developed as policy.\n\nThe Town center Development Group wrote a discussion\nThe Town center Development Group wrote a discussion\npolicy paper for the New Zealand\npolicy paper for the New Zealand Labour\nLabour Party. The paper\nParty. The paper\ndiscusses the potential of New Zealand traditional town\ndiscusses the potential of New Zealand traditional town\n\nSome of the key points from the Town Centre Development\n\nGroups vision statement follow\nGroups vision statement follow\n\nOpportunities for Town and City Centers in New\nOpportunities for Town and City Centers in New\nZealand\nZealand\n\nTown and City Centers (TCC) can function as tourism destinations\nTown and City Centers (TCC) can function as tourism destinations\nin their own right.\nin their own right.\n\nTCCs\nTCCs can be peripheral economies, complementary to existing\ncan be peripheral economies, complementary to existing\ntourism attractions\ntourism attractions\n\nEconomic generators\nEconomic generators -- TCCs\nTCCs Organizations can facilitate true\nOrganizations can facilitate true\nprivate/public sector partnerships and relationships.\nprivate/public sector partnerships and relationships. TCCs\nTCCs that have\nthat have\na professional organizational structure and sustainable finance\na professional organizational structure and sustainable finance can\ncan\nattract significant support from the private sector\nattract significant support from the private sector\n\nOpportunities for Town and City Centers in New\nOpportunities for Town and City Centers in New\nZealand\nZealand\n\nCommunity and civic functions\nCommunity and civic functions -- town centers provide significant\ntown centers provide significant\nresources to community groups, local schools, and local artists\nresources to community groups, local schools, and local artists on a\non a\nweekly basis\nweekly basis\n\nTCC Orgs can provide employment opportunities (retail is one of\nTCC Orgs can provide employment opportunities (retail is one of the\nthe\nlargest employers including providing entr\nlargest employers including providing entreee to employment for low\ne to employment for low\nskilled people\nskilled people\n\nMinor crime problems such as graffiti ,underage prostitution, gl\nMinor crime problems such as graffiti ,underage prostitution, glue\nue\nsniffing, homeless and marginalized people, are few of the poss\nsniffing, homeless and marginalized people, are few of the possible\nible\nareas of involvement.\nareas of involvement.\n\nOpportunities for Town and City Centers in New\nOpportunities for Town and City Centers in New\nZealand\nZealand\n\nDevelop relationships with\nDevelop relationships with Iwi\nIwi and in some instances, work with\nand in some instances, work with Iwi\nIwi\non economic and social\non economic and social programmes\nprogrammes and projects such as tourism\nand projects such as tourism\nand employment.\nand employment.\n\nSome Town Centers have taken a responsible and pro\nSome Town Centers have taken a responsible and pro--active\nactive\napproach on environmental concerns.\napproach on environmental concerns.\n\nMain Streets and Town Centers in Australia\nMain Streets and Town Centers in Australia\n\nBackground\nBackground\n\nNew South Wales Main Streets Programs\nNew South Wales Main Streets Programs\n\nCase Example\nCase Example\n\nFuture trends\nFuture trends\n\nNew South Wales Mainstreets Program\nNew South Wales Mainstreets Program\nCurrently 130 towns\nCurrently 130 towns\nand small cities all\nand small cities all\nover New South\nover New South\nWales are\nWales are\nparticipating in the\nparticipating in the\nMainstreets Program\nMainstreets Program\n\nNew South Wales Mainstreets Program\nNew South Wales Mainstreets Program\n\nIn New South Wales , the Mains Streets Revitalization drive is a\nIn New South Wales , the Mains Streets Revitalization drive is a\nstate government initiative\nstate government initiative\n\nThe New South Wales Department of State and Regional\nThe New South Wales Department of State and Regional\nDevelopment began the Main Streets/ Small Towns Program to\nDevelopment began the Main Streets/ Small Towns Program to\nrevitalize town centers in 1994.\nrevitalize town centers in 1994.\n\nTo be eligible for community planning and/or project implementat\nion\nassistance a local program should generally have a population ov\ner\n1,500\n1,500\n\nCurrently, 130 town metropolitan and regional communities are\nCurrently, 130 town metropolitan and regional communities are\nparticipating in the program\nparticipating in the program\n\nThe programs offer a community planning process which aims to\nThe programs offer a community planning process which aims to\nbring together local government , business and community\nbring together local government , business and community\nrepresentatives to develop a strategic plan.\nrepresentatives to develop a strategic plan.\n\nObjectives of the Program\nObjectives of the Program\nThis program is a self\nThis program is a self--help program. DSRD assistance is only\nhelp program. DSRD assistance is only\ndesigned to\ndesigned to \"\"kick\nkick--start\nstart\"\" local programs. From the early stages serious\nlocal programs. From the early stages serious\nconsideration is given to how the local program can become\nconsideration is given to how the local program can become\nself\nself--sustaining through sponsorship, special rates levied by local\nsustaining through sponsorship, special rates levied by local\ncouncil, membership fees and consolidation of the operations of\ncouncil, membership fees and consolidation of the operations of\norganisations involved in economic development/promotional activ\norganisations involved in economic development/promotional activities.\nities.\nIn considering applications, DSRD takes into account :\n\nlikely outcomes such as employment, local partnerships\n\nThe level of local support/involvement/commitment (local counci\nThe level of local support/involvement/commitment (local council,l,\nbusiness and the community\nbusiness and the community\n\nGeographic coverage of the local program\nGeographic coverage of the local program\n\nSpecific hardships or difficulties being faced by the local\nSpecific hardships or difficulties being faced by the local\ncommunity\ncommunity\n\nThe level of previous DSRD funds provided in the area and\nThe level of previous DSRD funds provided in the area and\nsurrounds\nsurrounds\n\nThe Process\nThe Process\n\nThe sponsoring organisation can be a local Council, Chamber of\nThe sponsoring organisation can be a local Council, Chamber of\nCommerce or an incorporated community/business association,\nCommerce or an incorporated community/business association,\nwhich applies for funding to the\nwhich applies for funding to the Mainstreets\nMainstreets Program\nProgram\n\nThe Mainstreets program begins with a survey of the local\nThe Mainstreets program begins with a survey of the local\neconomy\n\nT\nhe Business Retention and Expansion Survey collects\ninformation on the make\n-up of the local economy and the needs\nand plans of local businesses\n\nProjects are identified and implemented in the community\nProjects are identified and implemented in the community\nstrategic plan.\nstrategic plan.\n\nOnce the plan is completed, funding is available under the Main\nOnce the plan is completed, funding is available under the Main\nStreets Small Towns Program on a matching cash\nStreets Small Towns Program on a matching cash--basis to\nbasis to\nemploy a co\nemploy a co--ordinator\nordinator to implement the plan.\nto implement the plan.\n\nThe Community Planning Process:\nThe Community Planning Process:\nActivities Undertaken and Funding Structure\nActivities Undertaken and Funding Structure\n\nBusiness Retention & Expansion Survey\nBusiness Retention & Expansion Survey\nGrant of\nGrant of $4,000\n$4,000\n\nEconomic Assessment\nEconomic Assessment\nGrant of\nGrant of $3,000\n$3,000\n\nInitial Community Workshop facilitation\nInitial Community Workshop facilitation\nFacilitation\nFacilitation Only*\nOnly*\n\nInitial Community Workshop\nInitial Community Workshop\nGrant of up to\nGrant of up to\n$3,000\n$3,000\n\nStrategic Planning Workshop facilitation\nStrategic Planning Workshop facilitation\nFacilitation\nFacilitation Only*\nOnly*\n\nStrategic Planning Workshop\nStrategic Planning Workshop\nGrant of up to\nGrant of up to\n$3,000\n$3,000\n\nInterim Planning Co\n-ordination Grant of up to $6,0\n\nStrategic Plan Review Workshop facilitation\nFacilitation Only*\n\nStrategic Plan Review Workshop\nGrant of up to $3,000\n\nSpecialist Workshop eg. Organisation structure\nSpecialist Workshop eg. Organisation structure\nGrant\nGrant\nof up to\nof up to\n$3,000\n$3,000\n\nOrganisation set\nOrganisation set--up costs eg. Incorporation costs\nup costs eg. Incorporation costs\nGrant\nGrant\nof up to\nof up to\n$1,000\n$1,000\n\nBusiness Retention & Expansion Survey review\nBusiness Retention & Expansion Survey review\nGrant\nGrant\nof\nof $3,000\n$3,000\n\nBusiness Marketing Workshop for business owners\nBusiness Marketing Workshop for business owners\nGrant\nGrant\nof up to\nof up to\n$3,000\n$3,000\n\nStrategic Plan/Project Implementation\nStrategic Plan/Project Implementation\nDSRD may match local cash contributions up to $25,000 per project for\nproject implementation.\nTypes of Projects\nthe development of an investment prospectus\ntraining for local business operators;\nintroduction of business awards\nestablishing marketing cooperatives , events or projects\nDeveloping information technology and telecommunication capacity.\n\nPublicity for the DSRD?\nPublicity for the DSRD?\nPrior approval must be sought from DSRD for the content of the f\nPrior approval must be sought from DSRD for the content of the first\nirst\nlocal press release announcing assistance. DSRD reserves the ri\nlocal press release announcing assistance. DSRD reserves the right to\nght to\nissue this press release.\nissue this press release.\nDSRD must be acknowledged as a\n\nmajor sponsor and financial contributor to the event in all rela\nted\npublicity including the prominent display of the DSRD logo:\n\nOn stage at all launches or events\n\nOn all publicity and printed material\n\nOn all reports produced in association with this project.\nOn all reports produced in association with this project.\n\nCase Example: Toronto Mainstreets Program\nCase Example: Toronto Mainstreets Program\n\nThe town of Toronto is located at Lake Macquarie in the Hunter\nThe town of Toronto is located at Lake Macquarie in the Hunter\nValley region. As well as having the largest population within t\nValley region. As well as having the largest population within the\nhe\nHunter Valley, the City of Lake Macquarie is home to the largest\nHunter Valley, the City of Lake Macquarie is home to the largest\nsaltwater lake in the southern hemisphere. Toronto itself has a\nsaltwater lake in the southern hemisphere. Toronto itself has a\npopulation of about 30,000. The majority of its 714 businesses a\npopulation of about 30,000. The majority of its 714 businesses are\nre\nsmall and locally owned.\nsmall and locally owned.\n\nThe Toronto Chamber of Commerce implemented the Main\nThe Toronto Chamber of Commerce implemented the Main\nStreet/Small Towns Program in 1993 after the town's chamber of\nStreet/Small Towns Program in 1993 after the town's chamber of\ncommerce decided the town needed revitalization.\ncommerce decided the town needed revitalization.\n\nThe two chief concerns were city beautification, and local econo\nThe two chief concerns were city beautification, and local economic\nmic\ndevelopment\ndevelopment\n\nToronto Main Streets Program\nToronto Main Streets Program\n\nBeautification\nBeautification\nAs a result of the original Main Street program strategy, Toront\nAs a result of the original Main Street program strategy, Torontoo\nunderwent significant streetscape improvements, including\nunderwent significant streetscape improvements, including\nlandscaping and tree planting, which have changed the whole imag\nlandscaping and tree planting, which have changed the whole imagee\nof the town centre. Improvements have also been made to the\n\nlandscaping of Regatta Park on the Lake Macquarie foreshore.\n\nThanks to the new town image, Toronto now enjoys a very high\n\noccupancy rate for commercial premises, including a 99% occupanc\ny\nrate for the past four years.\n\nDuring the past two years, approximately $30 million worth of\nDuring the past two years, approximately $30 million worth of\ndevelopment in Toronto has produced a new courthouse, two new\ndevelopment in Toronto has produced a new courthouse, two new\nshopping centre, serviced apartments on the foreshore, a new fir\nshopping centre, serviced apartments on the foreshore, a new firee\nstation and numerous multi\nstation and numerous multi--dwelling residential developments.\ndwelling residential developments.\n\nToronto Mains Streets Program\nToronto Mains Streets Program\n\nEvent Planning and Economic development\nEvent Planning and Economic development\nMajor annual events held at Toronto each year include the Lake\nMajor annual events held at Toronto each year include the Lake\nMacquarie Heritage Afloat Festival, the Toronto Village Fair, th\nMacquarie Heritage Afloat Festival, the Toronto Village Fair, the Buy\ne Buy\nLocal Campaign, the Business and Community Awards and\nLocal Campaign, the Business and Community Awards and\nSupercruise\nSupercruise 2001.\n2001.\nA promotional brochure was developed to promote\n\nbusiness/industry opportunities and events within Toronto.\n\nThe Toronto community also implemented the Business Retention\nThe Toronto community also implemented the Business Retention\nand Expansion Program assist the business community to identify\nand Expansion Program assist the business community to identify\nneeds and gaps in the business mix.\nneeds and gaps in the business mix.\nInitiated a\nInitiated a \"\"Buy Local\nBuy Local\"\" Campaign. The Business community\nCampaign. The Business community\nbenefited from the inaugural campaign in 2000 with many\nbenefited from the inaugural campaign in 2000 with many\nbusinesses reporting an increase in customer flow and trade.\nbusinesses reporting an increase in customer flow and trade.\n\nFuture Trends?\nFuture Trends?\nAccording to coordinator Jacinta Outlaw, Toronto is a good examp\nAccording to coordinator Jacinta Outlaw, Toronto is a good example\nle\nof a community economic development program that has been\nof a community economic development program that has been\nshowcased in various arenas. The annual review of the strategic\nshowcased in various arenas. The annual review of the strategic\nToronto Mains Streets Program\nToronto Mains Streets Program\nplan allows Toronto to continually reflect on events and strateg\nies\nthat have community endorsement.\n\n'Through the continued partnership of business, community and\n\ngovernment departments, the Toronto Main Street program will\n\ncontinue to grow,'\n\n'We are in a win\n'We are in a win win\nwin situation, everyone\nsituation, everyone recognises\nrecognises our past\nour past\nsuccesses and they are all looking forward to many more successe\nsuccesses and they are all looking forward to many more successess\nin the future.'\nin the future.'\n\nFuture Programs?\nFuture Programs?\nThe success of the Mainstreets Program has prompted the DSRD sta\nThe success of the Mainstreets Program has prompted the DSRD startrt\nfunding programmes for smaller towns and villages. These will s\nfunding programmes for smaller towns and villages. These will support\nupport\ncommunity planning initiatives and partnerships between small\ncommunity planning initiatives and partnerships between small\nbusinesses, local governments and community groups.\nThese includes the Town Life Development\nProgramme, to foster\neconomic growth and job creation in small regional communities\nand the \"Sense of Place\" Program, which is an extension of the\nMainstreets Programs with the twin objectives of economic and\nMainstreets Programs with the twin objectives of economic and\ncommunity development\ncommunity development"
    },
    {
      "category": "Resource",
      "title": "coventry2b2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/9a519f4a66f73924e1ed1c7d50a34b4b_coventry2b2.pdf",
      "content": "British\nBritish BIDs\nBIDs\n\nBritish \"\nBritish \"BIDs\nBIDs\"\"\n\nDifferences between US & British\nDifferences between US & British BIDs\nBIDs\n\nContext (Historic, Political, Economic)\nContext (Historic, Political, Economic)\n\nBID Legislation\nBID Legislation\n\nCoventry's Example\nCoventry's Example\n\nClosing Remarks\nClosing Remarks\n\nTCMs\nTCMs to Pilot\nto Pilot BIDs\nBIDs\n\nIn Britain Town Centre Management\nIn Britain Town Centre Management\norganizations or\norganizations or TCMs\nTCMs are locally funded\nare locally funded\norganizations that typically provide clean\norganizations that typically provide clean\nand safe activities for the a town's city\nand safe activities for the a town's city\ncenter\ncenter\n\nMost\nMost TCM's\nTCM's are funded almost entirely from\nare funded almost entirely from\nthe local government\n\nThe Benefit of\nBIDs in Britain:\n-\n-\n\"\"BIDs\nBIDs provide sustainable funding for an\nprovide sustainable funding for an\nagreed period of time. There is no\n\n\"freeloading\"\n-those who vote have a\nvoice, pay the levy and will benefit. It is a\n\ntransparent, clear and democratic process.\ntransparent, clear and democratic process.\nIt allows self\nIt allows self--management and self\nmanagement and self--\nfunding with no red tape or bureaucracy.\nfunding with no red tape or bureaucracy.\nIt provides practical services to ensure a\nIt provides practical services to ensure a\nclean, safe, well marketed, attractive\nclean, safe, well marketed, attractive\nenvironment. In the long term it will\nenvironment. In the long term it will\ndeliver significant economic and quality of\ndeliver significant economic and quality of\nlife benefits.\"\nlife benefits.\" -- Association of Town Centre\nAssociation of Town Centre\nManagement (ATCM)\nManagement (ATCM)\n\nBritish Pilot\nBritish Pilot BIDs\nBIDs\n\nCurrent legislation will allow for the creation of Business Impr\nCurrent legislation will allow for the creation of Business Improvement\novement\nDistricts (\nDistricts (BIDs\nBIDs) in select British Cities and Towns (2004)\n) in select British Cities and Towns (2004)\n\n22 British\n22 British TCMs\nTCMs have been chosen to be part of the PILOT BID\nhave been chosen to be part of the PILOT BID\nprogram\nprogram\n\nAn additional 5 are part of a\nAn additional 5 are part of a\n\nLondon based \"Circle Initiative\" to\nLondon based \"Circle Initiative\" to\nbegin the BID process.\n\nFunding Differences:\n\nAssessments:\n\nowner based in US vs.\ntenant based in Britain\ntenant based in Britain\n\nBecause they are tenant based,\nBecause they are tenant based,\nretailer concerns are their first\nretailer concerns are their first\npriority\npriority\n\nCoventry, Warwickshire\nCoventry, Warwickshire\nLocal Information\nLocal Information\n\nLocation: 1 1⁄2 hours northwest of London\nLocation: 1 1⁄2 hours northwest of London\n\nPopulation: 300,000 people\nPopulation: 300,000 people\n\nExperienced steady decline since the 1960s due\nto gradual deindustrialization\nA traditional manufacturing city which grew on\n\nthe back of Jaguar and other automobile related\nindustries\n\nEfforts underway to diversify the city's\nemployment base - high tech initiative\nPHOENIX INITIATIVE:\n\n-\nEffort to rebuild the built\nenvironment of the city centre,\nemphasizing streetscape and\npedestrian orientation\n\nCurrently engaged in the\n-\nlargest physical revitalization\ncampaign since the immediate\npost-war years\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\nCity Centre Company\nCity Centre Company\nCWP\nCWP\n\nDestination Marketing\nDestination Marketing\nTourism and Tourist\nTourism and Tourist\n\nIn April 2002, CV One was created when Coventry\nIn April 2002, CV One was created when Coventry\nCity Centre and Coventry & Warwickshire Promotions\nCity Centre and Coventry & Warwickshire Promotions\n(CWP) merged.\n(CWP) merged.\n\nCity Centre Management\nInformation\n\nParking Management\nSales\n\nEnvironmental\nEvents Prog\nramming\n-\n- 18 events including a jazz\n18 events including a jazz\nfestival and a\nGodiva\nfestival\n\nM\narketing\n\nR\negional and National\nImage\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\n\nIndependent private company\nIndependent private company\n\nPublic / private sector board\nPublic / private sector board\n\nNot for profit\nNot for profit\n\n£7.7 million operating budget\n£7.7 million operating budget\n-- City Council £5.7 million\nCity Council £5.7 million\n-- Commercial income £1.0\nCommercial income £1.0\nmillion\nmillion\n-- Grant Funding £0.8 million\nGrant Funding £0.8 million\n-- Sponsorship/Other £0.13\nSponsorship/Other £0.13\nmillion\nmillion\n\nOperational role\nOperational role\n-- 80+ staff\n80+ staff\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\nSix Strategic Priorities\nSix Strategic Priorities\n\nUnderstanding and addressing\ncustomer needs\n\nAchieving excellence through\npeople\n\nChanging PERCEPTIONS\n\nChanging REALITY\n\nGenerating sustainable funding\n\nGenerating third party investment\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\nOperational Responsibilities\nOperational Responsibilities\n\nCustomer service\nCustomer service\n-- Car parks\nCar parks\n-- City centre\nCity centre\n\nOperations support\n\n-- Cleansing & maintenance\nCleansing & maintenance\n-- CCTV monitoring\nCCTV monitoring\n-- Crime\nCrime Reduction Package\nReduction Package\n\nMarketing & Promotions\n\nCommercial Development\nCommercial Development\n\nProject Liaison\nProject Liaison\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\n46%\n46%\nTOTAL\nTOTAL\n39%\n39%\n£333\nA&B\nA&B\n44%\n44%\n£540\nCC\n76%\n76%\n£1,000\nD\nD\n100%\n100%\n£2,500\nEE\n100%\n100%\n£ 6,700\n6,700\nFF\n% of Total\n% of Total\nRetail\nRetail\nEstablishment\nEstablishment\ns that are CV\ns that are CV\nOne Members\nOne Members\nMembership\nMembership\nCost per Year\nCost per Year\nMember\nMember\nRetail\nRetail\nEstablishment\nEstablishment\nss\nTotal Retail\nTotal Retail\nEstablishment\nEstablishment\nss\nLevel\nLevel\nRetail Membership (2002)\n\nCV ONE Ltd.\nCV ONE Ltd. -- Coventry\nCoventry\nWhy Coventry\nWhy Coventry''s existing format is perfect for a transition to a BID\ns existing format is perfect for a transition to a BID\n\nCV One\nCV One''s autonomy is unique among British\ns autonomy is unique among British\nPilot\nPilot BIDs\nBIDs\n\nValue of membership attracts members\nValue of membership attracts members\n\nLarge membership percentage existing\nLarge membership percentage existing\n\nAll large retailers are members\nAll large retailers are members\n\nIn general there is a\nIn general there is a ''disincentive\ndisincentive'' not to\nnot to\nbelong to CV One\nbelong to CV One -- overcoming\novercoming \"\"Free\nFree\nRider\nRider\"\" problem\nproblem\n\nBenefits are specific to members\nBenefits are specific to members\n--\nSome of the services that CV One provides cannot be\nSome of the services that CV One provides cannot be\nenjoyed by non\nenjoyed by non--members (i.e. security provisions).\nmembers (i.e. security provisions).\nSecurity provision through a CCTV system is the most\nSecurity provision through a CCTV system is the most\nimportant membership incentive.\nimportant membership incentive.\n\nThe pricing has been calculated to maximize\nThe pricing has been calculated to maximize\nthe greatest number of members ~50%,\nthe greatest number of members ~50%,\npredicting a successful BID vote in the\npredicting a successful BID vote in the\nfuture.\nfuture.\n\nGovernment support has been crucial.\nGovernment support has been crucial.\n\nCV One is a not-for-profit, unlike other public\nTCMs.\n\nThe company is already delivering benefits\nto stakeholders of the type that a BID will\nneed to deliver\n\nLighting Fixtures, right?\nLighting Fixtures, right?\n\nRight?\nRight?\n\nSecurity and CCTV\nSecurity and CCTV\n\n400 Camera's stationed\n400 Camera's stationed\nthroughout city centre\nthroughout city centre\n\n24 hour monitoring\n24 hour monitoring\n\nMonitoring station has radio\nMonitoring station has radio\nconnection with member\nconnection with member\norganizations\norganizations\n\nCCTV viewers alert member\nCCTV viewers alert member\norganizations and police if\norganizations and police if\nsuspicious activities are viewed\nsuspicious activities are viewed\n\nMembers have to sign\nMembers have to sign\n\nCrime is mostly theft or drug\nCrime is mostly theft or drug\nrelated in Coventry\nrelated in Coventry\n\nNot much violent crime\nNot much violent crime\n\nPOLICE - overall accountability\n- Public servants\nEvening Ambassadors\n- Early evening to morning\n- Eyes and Ears\n- Customer Service\nStreet Crime Warden (Nationally Funded)\n- \"Robust Role\" - according to CV One\n- Will reduce the need for regular police\n- Ability to hold suspect for up to 30 minutes\nCustomer Service\n- Uniformed CV One Employees\nSecurity Chain of Command\nSecurity Chain of Command\n\nConcluding Thoughts\nConcluding Thoughts\n\nBritish Pilot\nBritish Pilot BIDs\nBIDs fund most of\nfund most of\ntheir operations from the public\ntheir operations from the public\nsector\nsector\n\nThe tenant assessment provides\nThe tenant assessment provides\nfor a different set of objectives\nfor a different set of objectives\nand responsibilities\nand responsibilities\n\nPrimary impetus for forming a\nPrimary impetus for forming a\nBID is escaping bureaucracy and\nBID is escaping bureaucracy and\nachieving sustainable funding and\n\nadministration\n\nC\noventry is the model for\nBIDs in\nBritain\n\nM\nost Pilot-\nBIDs are not pri\nvate\nnon\nnon--profit companies like CV One\nprofit companies like CV One"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/a0be061c3f7e7a589ec2f564a4b89eb9_lecture2.pdf",
      "content": "Canada's\nCanada's BIDs\nBIDs\n\nToronto's\nToronto's BIDs\nBIDs\n\nWhat is a BIA?\nWhat is a BIA?\n\nWorld's First BID\nWorld's First BID\nThe Origins of the BID Movement\nThe Origins of the BID Movement\n\nWest\nBloor Vil\nlage BIA\n\nBloor\nYork ville BIA\n\nContext (Historic, Political, Economic)\n\nProvincial Enabling Legislation\n\nPolicy Formulation\nPolicy Formulation\n\nPolicy Transfer\nPolicy Transfer\n\nInternational BID Project\nInternational BID Project\n\nPreliminary Results\nPreliminary Results\n\nProvincial Enabling Legislation\n\nBIA typically originates with a group of interested\nbusiness people\n\nThe\nBIA Office at\nToronto C ity Hall can provide assistance\n\nSteering committee\nforms to propose program and budget\n\nCity staff assesses the proposed budget and\ncalculates levy\n\nCity Clerk's office mails\nnotice to all businesses within proposed BIA\n\nBusinesses have\ntwo months to respond\n\nCity Council will enact a By\n-law proclaiming the new BIA\n\nDesignation is rejected if\none-third of the assessed lan\nd value ob\nject\n\nCommittee calls a meeting to explain\nCommittee calls a meeting to explain how a BIA works\nhow a BIA works\nBoard of Management (BM) is elected and appointed\nBoard of Management (BM) is elected and appointed\n\nBM submits a\nBM submits a budget\nbudget\n\nCity Council passes a Levying By\nCity Council passes a Levying By--law\nlaw\n\nLevies may be collected from members by City's Finance Dept.\nLevies may be collected from members by City's Finance Dept.\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\n\nHow does a BIA operate?\nHow does a BIA operate?\n\nAdministered by a volunteer Board of Management (BM)\nAdministered by a volunteer Board of Management (BM)\n\nBMs are elected by BIA members, approved by City Council\nBMs are elected by BIA members, approved by City Council\n\nEach year the BM proposes a program of activities and a budget\nBoard of Management\n(BM)\nBIA\nMembers\nCity\nCouncil\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\n\nHow is an individual member's levy determined?\nHow is an individual member's levy determined?\n\nEvery business member is charged a share of the annual budget,\nEvery business member is charged a share of the annual budget,\nbased on that member's share of the\nbased on that member's share of the BIA's\nBIA's total commercial realty\ntotal commercial realty\nassessment.\nassessment.\n\nI\nf a business's commercial realty assessment is $6,000, and the\ntotal commercial realty assessment of all businesses in the BIA\nis\n$2,000,000, and the\nBIA's annual budget is $\n100,0 00, then that\nbusiness's BIA levy is: $6,000 X $100,000/$2,000,000= $300\n\nCurrently the average Toronto BIA member is assessed a levy of\nCurrently the average Toronto BIA member is assessed a levy of\nslightly over $300 per year.\nslightly over $300 per year.\n\nWhich actors were instrumental in the process of\nWhich actors were instrumental in the process of\npolicy formulation?\npolicy formulation?\nFormulation\nFormulation\n\nMembers of the\nMembers of the Bloor\nBloor--Jane\nJane--Runnymede Businessmen's Association\nRunnymede Businessmen's Association\n\nCity of Toronto Planning Board\nCity of Toronto Planning Board\n\nCity Surveyors Department\nCity Surveyors Department\n\nCity Real Estate Dept\nCity Real Estate Dept\n\nDepartment of Public Works\nDepartment of Public Works\n\nCity Legal Department\nCity Legal Department\n\nDepartment of Streets\nDepartment of Streets\n\nMetro Roads and Traffic Department\nMetro Roads and Traffic Department\n\nThe Parking Authority of Toronto\nThe Parking Authority of Toronto\n\nDevelopment Department\nDevelopment Department\n\nCouncil of the City of Toronto\nCouncil of the City of Toronto\n\nToronto Transit Commission\nToronto Transit Commission\n\nToronto Hydro Electric Commission\nToronto Hydro Electric Commission\n\nOntario Hydro\nOntario Hydro\n\nWhich actors were instrumental in the process of\nWhich actors were instrumental in the process of\npolicy transfer?\npolicy transfer?\nTransfer\nTransfer\n\n\"The\n\"The Bloor\nBloor West Village concept was presented to a seminar of the\nWest Village concept was presented to a seminar of the\nCanadian Association of Renewal Officials in Toronto on Nov. 26t\nCanadian Association of Renewal Officials in Toronto on Nov. 26th,\nh,\n1971.\"\n1971.\"\n\n\"Even after his retirement, he [Neil\n\"Even after his retirement, he [Neil McLellan\nMcLellan] traveled across the\n] traveled across the\nprovince and the country preaching the BIA gospel.\"\nprovince and the country preaching the BIA gospel.\"\n\nFormed in 1980, the Toronto Association of Business Improvement\nFormed in 1980, the Toronto Association of Business Improvement\nAreas (TABIA) is a formalized organization that began by promoti\nAreas (TABIA) is a formalized organization that began by promoting\nng\nBIAs\nBIAs and now works with Provincial and City Government (BIA\nand now works with Provincial and City Government (BIA\nOffice in City Hall) on legislation\nOffice in City Hall) on legislation\n\nInternational BID Project\n\nS\ntaff:\nDevika Gopal,\nTodd Leibe\nrman, Shana\nna Chataraj, and\n\nNoriko Komiyama\n\nPrincipal Investigator, Prof. Hoyt\nPrincipal Investigator, Prof. Hoyt\n\nFunding from HASS Fund\nFunding from HASS Fund\nSupport from the International Downtown Association\nSupport from the International Downtown Association\n\nMethodology: Identification,\nSurvey, and Site Vis\nit\n\nAugust 2002\n- May 2003\n\nTo critically evaluate...\n\n(1) this new form of urban governance,\n(1) this new form of urban governance,\n(2) the origin, distribution and evolution of BID policy,\n(2) the origin, distribution and evolution of BID policy,\n(3) the role of business in revitalizing urban areas and\n(3) the role of business in revitalizing urban areas and\n(4) innovative efforts to improve the pedestrian experience\n(4) innovative efforts to improve the pedestrian experience\n\nPreliminary Results\nPreliminary Results\n\nCanada...\nCanada...\n\n333 organizations successfully identified\n333 organizations successfully identified\n\nResponse rate = 26%\nResponse rate = 26%\n\nToronto...\n\n41 organizations successfully identified\n\nResponse rate = 20%\nResponse rate = 20%\n\nHow do these organizations vary?\nHow do these organizations vary?\nBIAs\nBIAs\nBIDs\nBIDs\n\nNumber Identified\nNumber Identified\n\nFormed Before 1990\nFormed Before 1990\n73%\n73%\n13%\n13%\n\nBudget\n$3 Tho\nusand to $8 Th\nousand to\n$2 Million\n$15 Milli\non\n\nSize\nSize\n22--125 Blocks\n125 Blocks\n11--300 Blocks\n300 Blocks\n\nPerformance Evaluation\nPerformance Evaluation\n33%\n33%\n54%\n54%"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2canada.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/de46885d713cdb7fcd8b135e85f028e1_lecture2canada.pdf",
      "content": "The Origins of the BID Movement\nThe Origins of the BID Movement\n\nCanada's\nCanada's BIDs\nBIDs\n\nToronto's\nToronto's BIDs\nBIDs\n\nWhat is a BIA?\nWhat is a BIA?\n\nWorld's First BID\nWorld's First BID\n\nWest\nBloor Vil\nlage BIA\n\nBloor\nYork ville BIA\n\nContext (Historic, Political, Economic)\n\nProvincial Enabling Legislation\n\nPolicy Formulation\nPolicy Formulation\n\nPolicy Transfer\nPolicy Transfer\n\nInternational BID Project\nInternational BID Project\n\nPreliminary Results\nPreliminary Results\n\nClosing Remarks\nClosing Remarks\n\nCanada's\nCanada's BIDs\nBIDs\n(Business Improvement Areas)\n(Business Improvement Areas)\n\nMore than\nMore than 230\n230 BIAs\nBIAs in the Province of Ontario\nin the Province of Ontario\n\nThere are approximately\nThere are approximately 300\n300 BIAs\nBIAs in Canada\nin Canada\n\nToronto's\nBIDs\n(Business Improvement Areas)\n\nThese businesses employ approximately 450,000 people\n\nThey pay close to $100,000,000 in realty/business taxes to the C\nity\n\nPartner with City in an annual $5 million, 50/50 cost\n-sharing program\n\nOrganize events that generate over $2.1 million in sales\n\nContribute more than 21,000 hours of volunteer time\n\nRepresent commercially assessed properties with value of $4 bill\nRepresent commercially assessed properties with value of $4 billion\nion\n\nWhat is a BIA?\nWhat is a BIA?\n\nAn association of business people within a specified district\nAn association of business people within a specified district\n\nUnite with official approval from the City\nUnite with official approval from the City\n\nOperate a self\nOperate a self--help program aimed at stimulating local business\nhelp program aimed at stimulating local business\n\nFocus on attracting prospective customers to their area\nFocus on attracting prospective customers to their area\nImprove the attractiveness and promote the area\nImprove the attractiveness and promote the area\n\nOnce approved, membership is compulsory\n\nSeek to benefit adjacent neighborhoods and the City\n\nWorld's First BID\ning commerci\nal area\n\nline\n\nBloor\n-Jane-Runne\nymede Business M\nen's Assoc iation (voluntary)\n\nCommittee formed and drafted legislation (w/support from local\ngovt)\n\nProposed a self\n-imposed tax on local business and property owners\n\nIn May, 1970, the City of Toronto passed By\n-law No. 170-70\n\nOntario Municipal Board approved the\nBloor-Jane-Runnymede BIA\n\nFocused on streetscape improvements and special events\nFocused on streetscape improvements and special events\n\nToday, WBV BIA is a vibrant neighborhood oriented commercial are\nToday, WBV BIA is a vibrant neighborhood oriented commercial areaa\n\nWest\nBloor Vil\nlage\n\nM\naintenance = $100,000 (tree lighting and decorations, flower planting, boxes and\nbenches, snow clearing, flags and banners)\n\nC\napital Improvement 50/50 with City= $50,000\n\nWest\nWest Bloor\nBloor Village\nVillage -- 2002\nRunnymede/\nRunnymede/Bloor\nBloor West Neighborhood\nWest Neighborhood\nWestern Portion of Toronto\nWestern Portion of Toronto\nMiddle class neighborhood\nMiddle class neighborhood\n1991 population = 24,256\n1991 population = 24,256\nCommunity Services Public Health,\nCommunity Services Public Health,\nNeighborhood Profiles 1997\n\n\"\"Looking Ahead: The Story of Ward One and Its\nLooking Ahead: The Story of Ward One and Its\nBusinessmen Looking Ahead in 1968\"\nBusinessmen Looking Ahead in 1968\"\n\nBoytchuk\nBoytchuk, William.\n, William. Bloor\nBloor West Villager\nWest Villager (May 1971) No. 5, Vol. 4,\n(May 1971) No. 5, Vol. 4,\nPage 2\nPage 2\n\n\"Our problem was the\n\"Our problem was the quality of life\nquality of life on\non Bloor\nBloor Street, the nature of\nStreet, the nature of\nthe environment, and the necessity of assuring that life in the\nthe environment, and the necessity of assuring that life in the area\narea\ndid not deteriorate in the face of\ndid not deteriorate in the face of the onslaught of the\nthe onslaught of the Bloor\nBloor Street\nStreet\nsubway\nsubway and the ensuing threats to our residential neighborhoods\nand the ensuing threats to our residential neighborhoods\nand commercial districts. Confronted with these formidable issue\nand commercial districts. Confronted with these formidable issues,\ns,\nthe members of the\nthe members of the Bloor\nBloor--Jane\nJane--Runnymede Businessmen's\nRunnymede Businessmen's\nAssociation and local politicians reached the eminently simple a\nAssociation and local politicians reached the eminently simple and\nnd\nsensible conclusion that all change does not have to be for the\nsensible conclusion that all change does not have to be for the\nworse.\"\nworse.\"\n\n\"The members of the businessmen's association set about to\n\"The members of the businessmen's association set about to\nachieve what they knew was possible. In 1968, they drafted\nachieve what they knew was possible. In 1968, they drafted\nlegislation which they presented to City Hall asking that both s\nlegislation which they presented to City Hall asking that both sides\nides\nof\nof Bloor\nBloor Street from\nStreet from Glendonwynne\nGlendonwynne Road to South Kingsway, be\nRoad to South Kingsway, be\ndesignated as an improvement area. They quickly won the\ndesignated as an improvement area. They quickly won the\npoliticians to their side and their recommendations were heartil\npoliticians to their side and their recommendations were heartilyy\nendorsed by both the City and Provincial Governments.\"\nendorsed by both the City and Provincial Governments.\"\n\n\"\"The\nThe legislation became a model\nlegislation became a model that many other areas of the City\nthat many other areas of the City\nare now trying to follow. Among other things, it provided for th\nare now trying to follow. Among other things, it provided for the area\ne area\nto the extent that the quality of life for those who both lived\nto the extent that the quality of life for those who both lived and\nand\nshopped there was considerably enhanced. Trees were planted,\nshopped there was considerably enhanced. Trees were planted,\nbenches installed, objectionable signs removed and many other\nbenches installed, objectionable signs removed and many other\nchanges effected. The process continues. Shopping on\nchanges effected. The process continues. Shopping on Bloor\nBloor Street\nStreet\nwas always a pleasant experience, now it is absolutely groovy an\nwas always a pleasant experience, now it is absolutely groovy andd\nshould improve.\"\nshould improve.\"\n\n\"To whom do we owe the credit? To our merchants and\n\"To whom do we owe the credit? To our merchants and\nbusinessmen of course! As well as proposing the improvements,\nbusinessmen of course! As well as proposing the improvements,\nthey also proposed to foot the bill themselves. Is it possible t\nthey also proposed to foot the bill themselves. Is it possible that\nhat\nsomeone went to City Hall asking permission to do something and\nsomeone went to City Hall asking permission to do something and\noffer to pay for it on their own? Our men did and the cost of al\noffer to pay for it on their own? Our men did and the cost of all these\nl these\nimprovements is added to their business tax bill every year thro\nimprovements is added to their business tax bill every year through\nugh\na special arrangement made with the city. The area now has a bri\na special arrangement made with the city. The area now has a bright\nght\nnew name to complement its image, \"the\nnew name to complement its image, \"the Bloor\nBloor West Village.\" It\nWest Village.\" It\nbelongs to the residents of Ward One who should enjoy it and\nbelongs to the residents of Ward One who should enjoy it and\npatronize the businesses that made it possible. After all, there\npatronize the businesses that made it possible. After all, there are\nare\nother parts of the city that want one like it.\"\nother parts of the city that want one like it.\"\n\"\"Looking Ahead: The Story of Ward One and Its\nLooking Ahead: The Story of Ward One and Its\nBusinessmen Looking Ahead in 1968\"\nBusinessmen Looking Ahead in 1968\"\n\n\"\"Merchants Upset with Street Vendors\"\nMerchants Upset with Street Vendors\"\nOctober 1985,\nOctober 1985, The\nThe Bloor\nBloor West Villager\nWest Villager\n\nMerchants complain that street vendors are stealing business\nMerchants complain that street vendors are stealing business\n\nStarted with hot dog vendors and jewelry stands\nStarted with hot dog vendors and jewelry stands\n\nFear that an influx of other types of vendors will occur\nFear that an influx of other types of vendors will occur\n\n\"It's just not right that they can come in here like that. They\n\"It's just not right that they can come in here like that. They don't pay\ndon't pay\nthe high rent.\"\nthe high rent.\"\n\n\"They don't pay taxes or put money into the BIA. They get the\n\nbenefits of our work into the area without paying.\"\n\n\"\"Thirty Years Later\"\nThirty Years Later\"\nAugust 1998,\nAugust 1998, The\nThe Bloor\nBloor West Villager\nWest Villager\n\n\"\"My family and I have been shopping in\nMy family and I have been shopping in Bloor\nBloor West Village for two\nWest Village for two\ndecades. For me the village has everything you could possibly wa\nnt\nall crowed into tightly delineated and walk able, shopping area\ntwo\nthirds of a mile long between High Park and the Humber River.\"\n\n\"\nFresh butcher shops, European bakeries, neighborhood\npharmacists, book stores, quality grocery stores, kid's stores,\n\ndoctors, dentists, veterinarians, a public library, movie theate\nrs,\nvideo stores, ice cream stores, restaurants and coffee shops.\"\n\n\"Chapters Book Store is replacing the Bingo Theatre and the Body\n\"Chapters Book Store is replacing the Bingo Theatre and the Body\nShop recently rented space on the corner. Outsiders are driving\nShop recently rented space on the corner. Outsiders are driving up\nup\nthe neighborhood rents and pushing the Mom and Pop stores out.\"\nthe neighborhood rents and pushing the Mom and Pop stores out.\"\n\nBloor\nBloor Yorkville BIA\nYorkville BIA\n\nBloor\nBloor--Yorkville is Toronto's largest BIA\nYorkville is Toronto's largest BIA\n\n2,500+ members and an annual budget of over $1 million\n2,500+ members and an annual budget of over $1 million\n\nDovercourt\nDovercourt Village is its smallest BIA (42 members, budget of $5,000)\nVillage is its smallest BIA (42 members, budget of $5,000)\n\nBloor\nBloor--Yorkville BIA was founded in July 1985\nYorkville BIA was founded in July 1985\n\nIt has 21 Board Members\nIt has 21 Board Members\n\nFull\nFull--time, salaried General Manager\ntime, salaried General Manager\n\nFull\n-time BIA Staff\n\nSeveral management committees\n\nBloor\nYork ville Web Site\n\nCanada's\nCanada's BIDs\nBIDs\n\nToronto's\nToronto's BIDs\nBIDs\n\nWhat is a BIA?\nWhat is a BIA?\n\nWorld's First BID\nWorld's First BID\nThe Origins of the BID Movement\nThe Origins of the BID Movement\n\nWest\nBloor Vil\nlage BIA\n\nBloor\nYork ville BIA\n\nContext (Historic, Political, Economic)\n\nProvincial Enabling Legislation\n\nPolicy Formulation\nPolicy Formulation\n\nPolicy Transfer\nPolicy Transfer\n\nInternational BID Project\nInternational BID Project\n\nPreliminary Results\nPreliminary Results\n\nClosing Remarks\nClosing Remarks\n\nContext\n(Historic, Political, and Economic)\n\nBy 1971, 1 of every 3 Canadians lived in Montreal/Toronto/Vancou\nver\n\nThese cities experienced a 90% increase from 1951 to 1971\n\nTotal\nYear\nPop\nulation*\n5,3\n8,7\n11,\n18,\n24,\n27,\nUrban\n\nPopulation\n% Urban\n2,014\n37.5\n\n4,352\n49.5\n\n6,271\n54.5\n\n12,700\n69.6\n18,346\n75.5\n21,008\n77.0\n*In thousands\n\n(Census of Canada)\n\nContext\n(Historic, Political, and Economic)\n\nPopulation and jobs grew in cities at phenomenal rate\n\nFederal initiatives to redevelop downtowns devolve to Provincial\nlevel\n\nIncreased demands for housing and consumer goods, services,\n\neducation, health care, etc.\n\nPostwar immigrants intensify growth and demand\n1950s\n1950s\n\nCities grew and spread\nCities grew and spread\n\nShifts to suburbs as government facilitates low density developm\nShifts to suburbs as government facilitates low density development\nent\n\nContext\nContext\n(Historic, Political, and Economic)\n(Historic, Political, and Economic)\n1960s\n1960s\n\nGrowth of auto sector and widespread use of the automobile\nGrowth of auto sector and widespread use of the automobile\n\nRapid suburbanization affects downtown\nRapid suburbanization affects downtown\nLow growth rates in retail sales/Increased demand for public ser\nLow growth rates in retail sales/Increased demand for public services\nvices\n1970s\n\nManufacturing relocates to urban fringe\nManufacturing relocates to urban fringe\n\nLeaders recognize the rapid decline of inner\nLeaders recognize the rapid decline of inner--city areas in many US cities\ncity areas in many US cities\n\nProvincial authorities reinvest in old inner\nProvincial authorities reinvest in old inner--city shopping districts\ncity shopping districts\n1980s\n1980s\n\nSharp rise in unemployment\nSharp rise in unemployment\n\nState spending at all levels decreases\nState spending at all levels decreases\n\nContext\n(Historic, Political, and Economic)\n\nDid not experience the social/economic disparities of other citi\nes\n\nIt transformed into the dominant financial and industrial center\n\nReputation as a vibrant city\n-region with a safe and diverse urban core\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\n\nSection 217 of the Municipal Act\nSection 217 of the Municipal Act\n\nEmpowers BIA members to use their own money (1) to promote\nEmpowers BIA members to use their own money (1) to promote\ntheir BIA and (2) to make physical improvements to their area in\ntheir BIA and (2) to make physical improvements to their area in\norder to attract more customers\norder to attract more customers\n\nMandates organizational and operational issues\n\nProvincial Enabling Legislation\n\n\"A local municipality\nmay designate an are a as an improvement\narea and establish a board of management, to\narea and establish a board of management, to oversee the\noversee the\nimprovement, beautification and maintenance\nof municipally-owned\nland, buildings and structures in the area beyond that provided\nat\nthe expense of the municipality generally;\nand to promote the area\nas a business or shopping area.\"\n\n\"A\nboard of management i\ns a corporation con sisting of the number\nof directors established by the municipality.\"\n\n\"A\nboard of management s\nhall not, spend any money unless it is\nincluded in the budget approved by the municipality, incur any\nindebtedness extending beyond the current year without the prior\nindebtedness extending beyond the current year without the prior\napproval of the municipality.\"\napproval of the municipality.\"\n\nAA board of management\nboard of management shall submit its annual report that includes\nshall submit its annual report that includes\naudited financial statements\naudited financial statements\n\nBIA Members\nBIA Members consist of persons who are assessed\nconsist of persons who are assessed\n\nEach member of an improvement area has one vote\nEach member of an improvement area has one vote"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/6afc9cb29ba92323f93c46377f9e287c_lecture3.pdf",
      "content": "The Advancement of the BID Movement\nThe Advancement of the BID Movement\n\nBIDs\nBIDs in the United States\nin the United States\n\nContext (Historic, Political, Economic)\nContext (Historic, Political, Economic)\n\nThe Emergence of the BID in Philadelphia\nThe Emergence of the BID in Philadelphia\n\nCenter City District\nCenter City District\n\nState Enabling Legislation\n\nOther\nBIDs in P\nhila delphia\n\nEmpirical Work on\nBIDs\n\nClosing Remarks\n\nBusiness Improvement Districts and Innovative Service Delivery,\nBusiness Improvement Districts and Innovative Service Delivery, 1999\n\nIdentifies 404\nIdentifies 404 BIDs\nBIDs in the United States\nin the United States\n\n42 states have enabling statutes, several are crafting legislati\n42 states have enabling statutes, several are crafting legislation\non\n\nCalifornia, New York, and Wisconsin have the highest number of\nCalifornia, New York, and Wisconsin have the highest number of BIDs\nBIDs\n\nBIDs\nBIDs cluster in large cities, but also exist in small towns and subu\ncluster in large cities, but also exist in small towns and suburbs\nrbs\nBIDs\nBIDs in the United States\nin the United States\nState\nState\n# of\n# of BIDs\nBIDs\nCalifornia\nCalifornia\nNew York\nNew York\nWisconsin\nWisconsin\nNew Jersey\nNew Jersey\nNorth Carolina\nNorth Carolina\nFlorida\nFlorida\nPennsylvania\nPennsylvania\nIllinois\nIllinois\nGeorgia\nGeorgia\nTexas\nTexas\nIowa\nIowa\nVirginia\nVirginia\nCity\nCity\n# of\n# of BIDs\nBIDs\nNew York\nNew York\nLos Angeles\nLos Angeles\n17 (21 under consideration)\n(21 under consideration)\nSan\nSan Deigo\nDeigo\n(Correspondence from Mitchell, May 24, 2000)\n(Correspondence from Mitchell, May 24, 2000)\n\nContext\nContext\n(Historic, Political, and Economic)\n(Historic, Political, and Economic)\n\nBy 1920, more than half of all Americans lived in urban areas\nBy 1920, more than half of all Americans lived in urban areas\n\nEconomic engines, social hubs, political influence\nEconomic engines, social hubs, political influence\n\nPhiladelphia was no exception, but trend shifts in 1950s\nPhiladelphia was no exception, but trend shifts in 1950s\n\nBy 1990, the nation was in the midst of an economic recession, a\nnd\n\nThe City was virtually insolvent...\n\nPopulation (In Millions), 1940\nPopulation (In Millions), 1940 -- 2000\nPhiladelphia\nPhiladelphia\nInside\n1.9\n2.1\n2.0\n1.9\n1.7\n1.6\n1.5\nOutside\n1.3\n1.6\n2.3\n2.9\n3.0\n3.6\n3.9\nUnited States Census Bureau\n\nThe Emergence of the BID in Philadelphia\nThe Emergence of the BID in Philadelphia\nWhich actors were instrumental in the policy transfer process?\nWhich actors were instrumental in the policy transfer process?\n\nCentral Philadelphia Development Corporation (CPDC), 1956\nCentral Philadelphia Development Corporation (CPDC), 1956\n\nIn 1985, Richard Fleming, President of the Downtown Partnership\nIn 1985, Richard Fleming, President of the Downtown Partnership\n\nGreater Philadelphia Chamber of Commerce, Chestnut Street\nGreater Philadelphia Chamber of Commerce, Chestnut Street\nAssociation, Foundation for Architecture\n\nPeter Wiley, studied legislation, networked with NYC\n\nDept of Public Property/City Planning Commission promote BID ide\na\n\nMayor Wilson Goode and Police Commissioner Kevin Tucker\n\nStockton Strawbridge of Strawbridge and Clothier (since 1875)\nStockton Strawbridge of Strawbridge and Clothier (since 1875)\n\nRonald Rubin agrees to simplified agenda, \"Clean and Safe\"\nRonald Rubin agrees to simplified agenda, \"Clean and Safe\"\n\nPaul Levy, CPDC in 1990\nPaul Levy, CPDC in 1990\n\n\"\"Nineteen ninety was one of the low points within the city's\nNineteen ninety was one of the low points within the city's\nadministration. The city was close to\nadministration. The city was close to bankrupsy\nbankrupsy, and the credibility\n, and the credibility\nof government was low. So, we had two huge negatives that,\nof government was low. So, we had two huge negatives that,\nThe Emergence of the BID in Philadelphia\nThe Emergence of the BID in Philadelphia\nfrankly, worked to our advantage. One, the place was filthy. T\nwo,\nthere was a total lack of confidence in city government. We nee\nded\nan alternative to get this done.\"\n[1]\n[1]\n[1]Paul Levy. Interview by\nPaul Levy. Interview by Lorlene\nLorlene Hoyt, 2000.\nHoyt, 2000.\n\nCenter City District (CCD)\nCenter City District (CCD)\nBudget\nBudget\n2002 = $12 Million\n2002 = $12 Million (1995 = $7; 1996 = $7.6; 1997 = $8; 1998 = $8.3;\n(1995 = $7; 1996 = $7.6; 1997 = $8; 1998 = $8.3; 1999 = $8.7\n1999 = $8.7))\nPhiladelphia's first and largest BID (approximately 100 city blo\nPhiladelphia's first and largest BID (approximately 100 city blocks)\ncks)\n\nCollects mandatory assessments\n(5-6% of the real estate propert\ny tax)\n\nNumber of properties = 2,752\n\nPercent of assessments collected\n(88% to 96%)\n\nNumber of Liens Filed\n(4% to 6% of properties)\n\nAuthorized until 2015\nVoluntary donations\n(Academy of Music, Thomas Jefferson University, University of\nthe Arts, the Archdiocese of Philadelphia, etc.)\n\nBID Survey 2000;\nLorlene Hoyt\n\nSanitation in 1999 = $3,764,000\nSanitation in 1999 = $3,764,000\n\n68 staff, 365 days a year\n68 staff, 365 days a year\n\nMost\nMost BIDs\nBIDs provide sanitation services\nprovide sanitation services\n\nDeploy street sweeping/graffiti removal staff\nDeploy street sweeping/graffiti removal staff\n\nSupplement public sanitation services\nSupplement public sanitation services\n\nset high standards (every sidewalk 3 times/day)\nset high standards (every sidewalk 3 times/day)\n\nAdminister their own sanitation program, or\nAdminister their own sanitation program, or\n\nFee\nFee--for\nfor--service arrangement\nservice arrangement\n\"Security will also enhanced by the constant\n\"Security will also enhanced by the constant\npresence of the district's uniformed maintenance\npresence of the district's uniformed maintenance\nworkers and supervisors performing their\nworkers and supervisors performing their\nsidewalk\nsidewalk--cleaning duties. Merely by placing\ncleaning duties. Merely by placing\nthese individuals on the streets for several hours\nthese individuals on the streets for several hours\neach day, we expect to significantly deter graffiti,\neach day, we expect to significantly deter graffiti,\ncar break\ncar break--ins, and other crimes.\"\nins, and other crimes.\" [1]\n[1]\n[1]\n[1] OCD Public Transcripts of the Old City Special Services Distric\nOCD Public Transcripts of the Old City Special Services District. May 27, 1998.\nt. May 27, 1998.\nCenter City\nCenter City District\nDistrict\n\nSecurity in 1999 = $1,943,000\nSecurity in 1999 = $1,943,000\n\nSupplemental security services\nSupplemental security services\n\n44 ambassador patrols (\n44 ambassador patrols (CSRs\nCSRs and\nand SAs\nSAs))\n\nUniformed and unarmed civilian foot patrols\nUniformed and unarmed civilian foot patrols\n\nModeled after the National Park Rangers\nModeled after the National Park Rangers\n\nHospitality and security\nHospitality and security\nCenter City\nCenter City District\nDistrict\n\nTrained in public relations and speaking, etc.\n\nCSRs\nser ve as the \"eyes and ears\" of the police\n\nNo power to arrest, no powers to investigate\n\nCan call the police department's 911 system\n\nCCDs\ndis patcher to deploy from the substation\n\nVisible and mobile\nVisible and mobile\n\nCenter City\nDistrict\n\nWilliams testified on behalf of the CCD, asserting,\nWilliams testified on behalf of the CCD, asserting,\n\"It's almost like the broken window theory. If you don't attend\n\"It's almost like the broken window theory. If you don't attend to the\nto the\nfirst window, another one gets broken then trashed et cetera. It\nfirst window, another one gets broken then trashed et cetera. It's the\n's the\nsame philosophy that we try to do in our neighborhoods through o\nur\nTown Watch. Stand on the corners, turn your lights on, leave yo\nur\ndoors open with the lights on in the summer. Let someone who\n\ncomes to that block think they're being observed and they'll eit\nher\nchange their mind or, hopefully a very small percent, they'll go\n\nsomewhere else.\"\n[1]\n[1]\n[1]Public Transcripts Approving the Plan of the Special Services Di\nPublic Transcripts Approving the Plan of the Special Services District of Central\nstrict of Central\nPhiladelphia (Bill No. 1069). October 10, 1990, p. 47.\nPhiladelphia (Bill No. 1069). October 10, 1990, p. 47.\n\nFormal partnerships with the Police Department\nFormal partnerships with the Police Department\n\nProvide office space/equipment to support police sub\nProvide office space/equipment to support police sub--and mini\nand mini--stations\nstations\n\nEvery morning\nEvery morning CSRs\nCSRs attend the normal roll call briefings\nattend the normal roll call briefings\n\nPolice officers and\nPolice officers and CSRs\nCSRs exchange crime trend information\nexchange crime trend information\n\nThe CCD started with 52 officers, and at one time had as many as\nThe CCD started with 52 officers, and at one time had as many as 72\n\nCCD has foot beats, bike officers; SSHD has mounted patrol\nCCD has foot beats, bike officers; SSHD has mounted patrol\n\nCCD implemented the first computerized crime mapping system in 1\nCCD implemented the first computerized crime mapping system in 1993\n\nOther\nOther BIDs\nBIDs (GSSD and MSSD) have informal arrangements with District Captai\n(GSSD and MSSD) have informal arrangements with District Captains\nns\nCenter City\nCenter City District\nDistrict\n\nCenter City\nDistrict\n\nMost\nBIDs dis\ntrib ute newsletters, host websites, hang banners, use slogans\n\nUnite business owners and reinforce a shared identity\n\n\"Make it Center City\"\n\nMarketing in 1999 = $334,000\nMarketing in 1999 = $334,000\n\nPromote the image of \"clean and safe\" through a formal marketing\nPromote the image of \"clean and safe\" through a formal marketing campaign\ncampaign\n\nBoard members decide on an image\nBoard members decide on an image\n\nA name for the BID, a logo, a color palette (uniforms, vehicles,\nA name for the BID, a logo, a color palette (uniforms, vehicles, signage, etc.)\nsignage, etc.)\nIn 1999, Philadelphia's\nIn 1999, Philadelphia's BIDs\nBIDs spent close to $800 thousand on advertising\nspent close to $800 thousand on advertising\n\nMany\nMany BIDs\nBIDs manage streetscape improvement programs\nmanage streetscape improvement programs\n\nLighting, benches, trash receptacles, bicycle racks, sidewalks,\nLighting, benches, trash receptacles, bicycle racks, sidewalks, curbing,\ncurbing,\nstreet trees, bus shelters, entryways, signage, banners and mura\nstreet trees, bus shelters, entryways, signage, banners and muralsls\nCenter City\nCenter City District\nDistrict\n\nCenter City\nDistrict\nissue\n-if you push beneath the surface -of m\narket share and the need to be\ncompetitive\n.\" -Levy\nA final note on BID programs:\nA final note on BID programs:\n\n\"We did not put the district together because Philadelphia neede\n\"We did not put the district together because Philadelphia needed a janitorial\nd a janitorial\ncompany or a security company, what was really driving people wa\ncompany or a security company, what was really driving people was the\ns the\n\n\"A lot of districts across the country got started around clean\nand safe,\nprimarily because these were the chief obstacles to being compet\nprimarily because these were the chief obstacles to being competitive.\"\nitive.\" -- Levy\nLevy\n\nMore than $15 Million\nMore than $15 Million\n\nMore than 700 city blocks\nMore than 700 city blocks\nOther\nOther BIDs\nBIDs in Philadelphia\nin Philadelphia\nName\nName\nStart\nStart\nBudget\nBudget\nSize\nSize\nP/FTE\nP/FTE\nBM\nBM\nProperties\nProperties\nCCD\n$8,700,000\n10/26\n2,752\nSSHD\n$ 380,000\n1/1\nGSSD\n$ 110,000\n1/0\nFSSD\n$ 226,000\n1/0\nMSSD\n$\n89,000\n0/0\nUCD\n$3,800,000\n10/0\nN/A\nOCD\n$ 447,000\n1/0\n1,182\nCASSD\n$ 825,000\n1/1\nMHWPSSD\n$ 511,000\n0/0\nN/A\nBID Survey 2000;\nBID Survey 2000; Lorlene\nLorlene Hoyt\nHoyt\n\nOther\nOther BIDs\nBIDs in Philadelphia\nin Philadelphia\nName\nName\nServices\nServices\nCCD\nMarketing, Sanitation, Security, Streetscape, Police\nSSHD\nMarketing, Sanitation, Police\nGSSD\nMarketing, Sanitation\nFSSD\nMarketing, Sanitation, Security, Streetscape\nMSSD\nMarketing, Streetscape\nUCD\nMarketing, Sanitation, Security, Streetscape, Police, Transportation\nOCD\nMarketing, Sanitation\nCASSD\nMarketing, Security, Streetscape, Transportation\nMHWPSSD\nMarketing, Sanitation\nBID Survey 2000;\nBID Survey 2000; Lorlene\nLorlene Hoyt\nHoyt\n\nMarketing is the most common activity\nMarketing is the most common activity\n\nBID organizations are flexible; can respond to local need\nBID organizations are flexible; can respond to local need\n\nThe Advancement of the BID Movement\nThe Advancement of the BID Movement\n\nBIDs\nBIDs in the United States\nin the United States\n\nContext (Historic, Political, Economic)\nContext (Historic, Political, Economic)\n\nThe Emergence of the BID in Philadelphia\nThe Emergence of the BID in Philadelphia\n\nCenter City District\nCenter City District\n\nOther\nBIDs in P\nhila delphia\n\nState Enabling Legislation\n\nEmpirical Work on\nBIDs\n\nClosing Remarks"
    },
    {
      "category": "Lecture Notes",
      "title": "lect4empirical1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/abe008aedc970b2275f309df2730d25d_lect4empirical1.pdf",
      "content": "The Advancement of the BID Movement\nThe Advancement of the BID Movement\n\nBIDs\nBIDs in the United States\nin the United States\n\nContext (Historic, Political, Economic)\nContext (Historic, Political, Economic)\n\nThe Emergence of the BID in Philadelphia\nThe Emergence of the BID in Philadelphia\n\nCenter City District\nCenter City District\n\nOther\nBIDs in P\nhila delphia\n\nState Enabling Legislation\n(comparative analysis)\n\nEmpirical Work on\nBIDs\n\nEmpirical\nWork on\nBI\nDs\n\nSTUDY TWO\n\nI\nf so, do BID services push criminal activity to adjacent\nneighborhoods?\n\nStudy One\nStudy One\n\nMethod: Regression Analysis\nMethod: Regression Analysis\n\nResearch Questions:\nResearch Questions:\nDo BID services discourage crime (clusters)?\nDo BID services discourage crime (clusters)?\nResearch Design\nResearch Design\nData Sources: Crime (1998 & 1999), Cartographic, Census, etc.\n\nProperty = Burglary, Theft, Auto Theft\n\nViolent = Rape, Robbery, Aggravated Assault\nViolent = Rape, Robbery, Aggravated Assault\n\nRelated Research: Kelling, Jacobs, Knox and Mantel\nRelated Research: Kelling, Jacobs, Knox and Mantel\n\nRationale/Context\nRationale/Context\n\nenhancing\nenhancing informal\ninformal surveillance\nsurveillance\n\nenhancing\nenhancing formal\nformal surveillance\nsurveillance\n\"A deserted city street\nis apt to be unsafe.\"\n\n-Jane Jacobs\nBIDs focus on\nBIDs focus on \"\"clean and safe\nclean and safe\"\" by\nby...\n...\n\nContext\nContext\n\nCity of Philadelphia\nCity of Philadelphia\n\nIntegrated Municipal GIS\nIntegrated Municipal GIS\n\nNo Data Layer for 9\nNo Data Layer for 9 BIDs\nBIDs\n\nPrimary Data Collection\nPrimary Data Collection -- Surveys and Interviews\nSurveys and Interviews\n\nCrime Hot Spots\nCrime Hot Spots\nSpatial Clusters\nSpatial Clusters\n(Area, Grid, and Point)\n(Area, Grid, and Point)\nSpace\nSpace--time Clusters\ntime Clusters\n(Knox, Mantel, and K\n(Knox, Mantel, and K--function)\nfunction)\n\nCustomized GIS\nCustomized GIS\nConceptual Framework\nConceptual Framework\n\nA new point\nA new point--level method of\nlevel method of analyis\nanalyis\n\nSimultaneously considers space and time\nSimultaneously considers space and time\n\nCaptures information about how a pattern grows\nCaptures information about how a pattern grows\nOperational Framework\n\nUnit of analysis is the individual crime event\n\nGIS calculates a cluster value\n(using Avenue)\n\nAnalyst determines spatial and temporal parameters\n\nTreats each incident as if it initiated the cluster\n\nExcludes those crimes already counted\nExcludes those crimes already counted\nNote\nNote\n\nGIS can compute cluster values for 10,000 records in 4 minutes\nGIS can compute cluster values for 10,000 records in 4 minutes\n\nX,Y,Z\nSpace\nZ\nTime\nSpatio\nSpatio--temporal Analysis\ntemporal Analysis\n\nSpace\nZ\nTime\nSpatio\nSpatio--temporal Analysis\ntemporal Analysis\n\nSpace\nZ\nTime\nSpatio\nSpatio--temporal Analysis\ntemporal Analysis\n\nCalculating Cluster Value\nCalculating Cluster Value\n500 Foot Radius; 30 Days\n500 Foot Radius; 30 Days\n\nFirst crime is Jan 4th\nFirst crime is Jan 4th\nSpatial cluster = 11\nSpatial cluster = 11\nSS--T cluster value = 8\nT cluster value = 8\nCalculating Cluster Value\nCalculating Cluster Value\n\nNext crime is Jan 12th\nNext crime is Jan 12th\nSpatial cluster = 10\nSpatial cluster = 10\nSS--T cluster value = 4? or 0?\nT cluster value = 4? or 0?\nCalculating Cluster Value\nCalculating Cluster Value\n\nNext crime is Jan 14th\nNext crime is Jan 14th\nSpatial cluster = 4\nSpatial cluster = 4\nSS--T cluster value = 3\nT cluster value = 3\nCalculating Cluster Value\nCalculating Cluster Value\n\nData\nData\nDependent Variable:\nDependent Variable:\nViolent Crime Clusters\nViolent Crime Clusters\nProperty Crime Clusters\nProperty Crime Clusters\nIndependent Variables:\nIndependent Variables:\nSecurity Staff (FTE)\nSecurity Staff (FTE)\nSanitation Staff (FTE)\nControl Variables:\nNumber of Busines\nses\nZoned Residential\n\nMedian Household Income\n\nFindings\nFindings\nPROPERTY CRIME\nPROPERTY CRIME\n\nExplanatory power of model is .297 (R\nExplanatory power of model is .297 (R--squared)\nsquared)\n\nSecurity regression\nSecurity regression coeficient\ncoeficient is negative and significant\nis negative and significant\n\nSanitation is positive and significant\nSanitation is positive and significant\nVIOLENT CRIME\n\nExplanatory power of model is .085 (R\n-squared)\n\nClusters are an inappropriate measure for predicting violent cri\nClusters are an inappropriate measure for predicting violent crime\nme\n\nStudy Two\nStudy Two\n\nMethods: Summary\nMethods: Summary Statisitcs\nStatisitcs & Time Series Analysis\n& Time Series Analysis\n\nResearch Question:\nResearch Question:\nResearch Design\nResearch Design\nDo BID services push criminal activity to adjacent\n\nneighborhoods?\n\nData Sources: Crime (1998 through 2001) and Cartographic\n\nProperty = Robbery, Burglary, Theft, Auto Theft\n\nQuality of Life = Vandalism, Prostitution, Drug Activity,\nDrunkeness, Disorderly Conduct\n\nRelated Research: McIver, Spiegel, and\nRelated Research: McIver, Spiegel, and Hellman\nHellman\n\nContext\nContext\n\n9 Business Improvement Districts\n9 Business Improvement Districts\n\n33 Large Commercial Areas\n33 Large Commercial Areas\n\n500 Foot Buffer\n500 Foot Buffer\n\nProperty Crimes in\nProperty Crimes in BIDs\nBIDs and Commercial Areas\nand Commercial Areas\nEmpirical Work on\nEmpirical Work on BIDs\nBIDs\n-9%\n4,071\n4,019\n4,421\n4,470\nCommercial Areas\nBusiness Improvement Districts\nCenter City District\nSouth Street\nGermantown\nFrankford\nManayunk\nCity Ave\nOld City\nUniversity City\nMercy-Health\nTotal\n5,771\n3,537\n1,990\n14,526\n5,162\n3,490\n2,136\n13,652\n4,336\n4,000\n1,833\n12,765\n4,328\n-25%\n-34%\n-34%\n4%\n-33%\n-43%\n-26%\n3,590\n1%\n1,686\n-15%\n11,907\n-18%\n\nProperty Crimes adjacent to\nProperty Crimes adjacent to BIDs\nBIDs and Commercial Areas\nand Commercial Areas\nEmpirical Work on\nEmpirical Work on BIDs\nBIDs\n-1%\n2,803\n2,817\n2,956\n2,832\nAdjacent Commercial Areas\nAdjacent Business Improvement Districts\nAdjacent Center City District\n-38%\nAdjacent South Street\n-39%\nAdjacentGermantown\n-46%\nAdjacent Frankford\n-10%\nAdjacent Manayunk\n-31%\nAdjacent City Ave\n-25%\nAdjacent Old City\n-58%\nAdjacent University City\n-20%\nAdjacent Mercy-Health\n-27%\nTotal\n3,143\n2,693\n2,287\n2,105\n-33%\n\nQuality of Life Crimes in\nQuality of Life Crimes in BIDs\nBIDs and Commercial Areas\nand Commercial Areas\nEmpirical Work on\nEmpirical Work on BIDs\nBIDs\n-9%\n5,734\n4,675\n4,999\n6,314\nTotal\n36%\n1,627\n1,063\n1,191\n1,199\nMercy-Health\n-1%\n1,266\n1,164\n1,173\n1,280\nUniversity City\n6%\nOld City\n-28%\nCity Ave\n-45%\nManayunk\n-40%\nFrankford\n13%\nGermantown\n6%\nSouth Street\n-35%\n1,389\n1,011\n1,200\n2,132\nCenter City District\nBusiness Improvement Districts\n12%\n3,335\n3,017\n3,007\n2,980\nCommercial Areas\n\nQuality of Life Crimes adjacent to\nQuality of Life Crimes adjacent to BIDs\nBIDs and Commercial Areas\nand Commercial Areas\nEmpirical Work on\nEmpirical Work on BIDs\nBIDs\n15%\n3,283\n2,587\n3,161\n2,859\nAdjacent Commercial Areas\nAdjacent Business Improvement Districts\nAdjacent Center City District\n-38%\nAdjacent South Street\n-10%\nAdjacentGermantown\n-6%\nAdjacent Frankford\n-5%\nAdjacent Manayunk\n-36%\nAdjacent City Ave\n54%\nAdjacent Old City\n-50%\nAdjacent University City\n-21%\nAdjacent Mercy-Health\n34%\nTotal\n1,699\n1,233\n1,229\n1,462\n-14%\n\nFindings\nFindings\nPROPERTY CRIME\nPROPERTY CRIME\n\nRate is decreasing more rapidly in\nRate is decreasing more rapidly in BIDs\nBIDs than in commercial areas\nthan in commercial areas\n(9% in Commercial Areas, 18% in\n(9% in Commercial Areas, 18% in BIDs\nBIDs))\n\nRate is significantly lower in neighborhoods adjacent\nRate is significantly lower in neighborhoods adjacent BIDs\nBIDs\n(Down 35% overall)\n(Down 35% overall)\n\nSteady in neighborhoods adjacent commercial areas\nSteady in neighborhoods adjacent commercial areas\nQUALITY OF LIFE CRIME\nQUALITY OF LIFE CRIME\n\nRate is up in commercial areas and adjacent neighborhoods\nRate is up in commercial areas and adjacent neighborhoods\n(12% AND 15%, respectively)\n(12% AND 15%, respectively)\n\nRate is down in\nRate is down in BIDs\nBIDs and adjacent neighborhoods\nand adjacent neighborhoods\n(9% AND 14%, respectively)\n(9% AND 14%, respectively)\n\nSummary\nSummary\n\nBID organizations have a positive impact within the BID\nBID organizations have a positive impact within the BID\n\nBIDs\nBIDs not have a (negative) impact around the BID\nnot have a (negative) impact around the BID\n\nNeed to look beyond Philadelphia\nNeed to look beyond Philadelphia\n\nNeed to move beyond crime\nNeed to move beyond crime"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/a914719049764314ab076c896abeee71_lecture5.pdf",
      "content": "Crossing the Ocean:\nCrossing the Ocean:\nBID Policy in the Republic of South Africa\nBID Policy in the Republic of South Africa\n\nThe Emergence of the BID in South Africa\nThe Emergence of the BID in South Africa\n\nJohannesburg's BIDs\nJohannesburg's BIDs\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\n\nCape Town's BIDs\nCape Town's BIDs\n\nGreen Point BID\n\nCentral CID\n\nPerformance Evaluation\n\nClosing Remarks\n\nThe Emergence of the BID in South Africa\nThe Emergence of the BID in South Africa\n(City Improvement Districts)\n(City Improvement Districts)\nWhich actors were instrumental in the policy transfer process?\nWhich actors were instrumental in the policy transfer process?\n\nInner City Strategic Workshop in November 1991\nInner City Strategic Workshop in November 1991\n\nIn 1992, Central Johannesburg Partnership (CJP) was established\nIn 1992, Central Johannesburg Partnership (CJP) was established\n\nKey issues were security, informal trading, and sanitation\nKey issues were security, informal trading, and sanitation\n\nIn 1993, CJP Director visits New York, Philadelphia, and Baltimo\nIn 1993, CJP Director visits New York, Philadelphia, and Baltimore\nre\n\nVoluntary Pilot BID (no legislation existed) for crime, grime, e\nVoluntary Pilot BID (no legislation existed) for crime, grime, etc.\ntc.\n\nIn 1996, the CJP, IDA and ATCM planned a tour (US and UK)\nIn 1996, the CJP, IDA and ATCM planned a tour (US and UK)\n\nCJP asked to assist with CID legislation (complete\nCJP asked to assist with CID legislation (complete--1997, passed\n1997, passed--1999)\n1999)\nQ:\nQ: \"\"I imagine you relied on other models?\nI imagine you relied on other models?\"\"\nA:\nA: \"\"Heavily on the models from the states.\nHeavily on the models from the states.\"\"\n-Interview with Neil Fraser in January 2003\nInterview with Neil Fraser in January 2003\n\nThe Emergence of the BID in South Africa\nThe Emergence of the BID in South Africa\n(City Improvement Districts)\n(City Improvement Districts)\nWhich actors transferred BID policy to Pretoria? To Cape Town?\nWhich actors transferred BID policy to Pretoria? To Cape Town?\n\nIn 1998, Partnerships for Urban Renewal (PUR) was established\nIn 1998, Partnerships for Urban Renewal (PUR) was established\n\nPUR worked with property owners in Rosebank, Midrand, and Sandto\nPUR worked with property owners in Rosebank, Midrand, and Sandtonn\n\nIn 1999, Cape Town Partnership (CTP) formed\nIn 1999, Cape Town Partnership (CTP) formed\n\nCTP researched Denver, New York, Washington, D.C., and Seattle\nCTP researched Denver, New York, Washington, D.C., and Seattle\n\nCTP modeled BIDs after Coventry CCP, United Kingdom\nCTP modeled BIDs after Coventry CCP, United Kingdom\n\nJohannesburg's BIDs\nJohannesburg's BIDs\n\nToday, there are 11 formal BIDs within the Johannesburg area\nToday, there are 11 formal BIDs within the Johannesburg area\nPretoria\nSunnyside\nPretoria\nMidrand\nPretoria\nChurch Street\nPretoria\nArcadia\nJohannesburg\nSouth Western Improvement District\nJohannesburg\nSandton City Management District\nJohannesburg\nSandton Business Improvement District\nJohannesburg\nRosebank Management District\nJohannesburg\nNorthern Improvement District\nJohannesburg\nCentral\nDurbanville\nDurbanville\nCity\nBID Name\n\nJohannesburg's BIDs\nJohannesburg's BIDs\n\nThere are more than 10 \"pending\" BIDs the Johannesburg area\nThere are more than 10 \"pending\" BIDs the Johannesburg area\nPretoria\nHatfield\nPretoria\nBrooklyn\nJohannesburg\nSports\nJohannesburg\nSloan\nJohannesburg\nRetail\nJohannesburg\nNewtowne\nJohannesburg\nIllovo\nJohannesburg\nFashion\nJohannesburg\nConstitution Hill\nJohannesburg\nBraamfontein\nCity\nBID Name\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\nReasons for the bill\nReasons for the bill\n\nSustainable city/town centres are important for the development\nSustainable city/town centres are important for the development of\nof\nSouth Africa\nSouth Africa\n\nMany centres of our cities/towns are caught in a state of degene\nMany centres of our cities/towns are caught in a state of degeneration\nration\n\nAlthough this is cause for concern for all of our citizens, and\nAlthough this is cause for concern for all of our citizens, and isis\naccordingly being addressed at national, provincial and local\naccordingly being addressed at national, provincial and local\ngovernment level, it is of particular concern for the property o\ngovernment level, it is of particular concern for the property owners and\nwners and\nresidents in city and town centres\nresidents in city and town centres\n\nThe legislation establishes a mechanism where property owners wi\nThe legislation establishes a mechanism where property owners will be\nll be\nencouraged to participate in the processes of sustainable develo\nencouraged to participate in the processes of sustainable development\npment\n\nIt recognises the unique needs and challenges facing different\nIt recognises the unique needs and challenges facing different\ngeographic areas and allows for individualised targeting of thos\ngeographic areas and allows for individualised targeting of those needs\ne needs\n\nCape Town's BIDs\nCape Town's BIDs\n\n9 BIDs within the Cape Town Metropolitan Area\n9 BIDs within the Cape Town Metropolitan Area\n\nCape Town relies on municipal by\nCape Town relies on municipal by--law instead of provincial act\nlaw instead of provincial act\n\nThe combined annual budget is more than R 25 million\nThe combined annual budget is more than R 25 million (or $3 million)\n(or $3 million)\n1,360,000\nJul-02\nSea Point\n1,320,000\nFeb-02\nOranje-Kloof\n440,000\nNov-01\nMuizenberg\n1,000,000\nAug-01\nParow\n1,360,000\nJul-01\nGreen Point\n2,800,000\nNov-00\nClaremont\n15,900,000\nNov-00\nCentral\n900,000\nOct-00\nWynberg\n150,000\nSep-00\nFish Hoek\nR per/yr\nEst.\nBID Name\n\nCape Town's BIDs\nCape Town's BIDs\nWynberg Village\nWelgemoed Residential\nUpper City Bowl\nSomerset West\nRichwood Village\nPaarden Eiland\nObservatory\nLower Gardens\nKenilworth\nEpping I and II\nCamps Bay\nBlackhealth Industrial\nBeaconvale\nAirport\nPending BIDs\n\n14 BIDs pending within the Cape Town Metropolitan Area\n14 BIDs pending within the Cape Town Metropolitan Area\n\nThe potential combined annual budget could double?\nThe potential combined annual budget could double? (to $6 million)\n(to $6 million)\n\nCape Town's Green Point BID\nCape Town's Green Point BID\n\nAnnual budget of R1,400,000\nAnnual budget of R1,400,000\n\nEstablished in 2001 (City of Cape Town's second BID)\nEstablished in 2001 (City of Cape Town's second BID)\n\nFocus on security, sanitation and marketing\nFocus on security, sanitation and marketing\n\n13% levy on rates\n13% levy on rates\nServices the Green Point business district...\nServices the Green Point business district...\n\nGreen Point BID\nGreen Point BID -- 2003\nand De Waterkant residential area...\n\nGreen Point BID\nGreen Point BID -- 2003\nand looking to expand!\n\nGreen Point BID\nGreen Point BID -- 2003\nSupplemental Sanitation Services = \"Cleansing Program\"\nSupplemental Sanitation Services = \"Cleansing Program\"\n\n6 Minizu staff\n6 Minizu staff\n\nSweep streets, remove waste and posters, tend to landscape\nSweep streets, remove waste and posters, tend to landscape\n\n8:00 am to 4:30 pm; 6 Days/Week\n8:00 am to 4:30 pm; 6 Days/Week\n\n1,100 to 1,200 bags/day\n1,100 to 1,200 bags/day\n\nGreen Point BID\nGreen Point BID -- 2003\nSupplemental Sanitation Services = \"Cleansing Program\"\nSupplemental Sanitation Services = \"Cleansing Program\"\n\nPerception is that Council funded cleaners are ineffective\nPerception is that Council funded cleaners are ineffective\n\nBID manager monitors service level agreements with local governm\nBID manager monitors service level agreements with local government\nent\n\nMinizu contracts with homeless shelter\nMinizu contracts with homeless shelter\n\nStaff are sensitive to people living on the streets\nStaff are sensitive to people living on the streets\n\nGreen Point BID\nGreen Point BID -- 2003\nSupplemental Security Services\nSupplemental Security Services\n\nTwo year model (started Feb. 2002)\nTwo year model (started Feb. 2002)\n\nTo deter burglary, robbery, theft from vehicle\nTo deter burglary, robbery, theft from vehicle\n\nSAP tour in tandem with BID security\nSAP tour in tandem with BID security\n\nBID pays SAP salary (four teams)\nBID pays SAP salary (four teams)\nSecurity is armed\nSecurity is armed\n\nSecurity cannot arrest suspects\n\nCrossing the Ocean:\nCrossing the Ocean:\nBID Policy in the Republic of South Africa\nBID Policy in the Republic of South Africa\n\nThe Emergence of the BID in South Africa\nThe Emergence of the BID in South Africa\n\nJohannesburg's BIDs\nJohannesburg's BIDs\n\nProvincial Enabling Legislation\nProvincial Enabling Legislation\n\nCape Town's BIDs\nCape Town's BIDs\n\nGreen Point BID\n\nCentral CID\n\nPerformance Evaluation\n\nClosing Remarks\n\nCentral City Improvement District\nCentral City Improvement District\n\nAnnual budget of R15,900,000\nAnnual budget of R15,900,000\n\nEstablished in 2000 (City of Cape Town's first BID)\nEstablished in 2000 (City of Cape Town's first BID)\n\nFocus on security, sanitation and marketing\nFocus on security, sanitation and marketing\n\nCentral City Improvement District\nCentral City Improvement District\nWorkforce of more than 1.3 million\nWorkforce of more than 1.3 million\nWorld\nWorld--renowned tourist destination\nrenowned tourist destination\nInflux of immigrants\nInflux of immigrants\nInadequate public resources\nInadequate public resources\n\nCentral CID\nCentral CID\nParking shortage in CBD\nParking shortage in CBD\nProblems with informal parking attendants\nProblems with informal parking attendants\nCity appoints CTP to manage parking\nCity appoints CTP to manage parking\nPilot program begins Dec. 2001\nPilot program begins Dec. 2001\n50 uniformed and trained parking marshals\n50 uniformed and trained parking marshals\nSystem of cash cards to register meter time\nSystem of cash cards to register meter time\n\nCentral CID\nCentral CID\n80 Community Patrol Officers (SAP Reservists)\n80 Community Patrol Officers (SAP Reservists)\n18 Foot Patrol (Private Security)\n18 Foot Patrol (Private Security)\n10 Mounted Patrol (Private Security)\n10 Mounted Patrol (Private Security)\n6 Vehicular Patrol (Private Security)\n6 Vehicular Patrol (Private Security)\n50% of all crime is committed by juveniles\n50% of all crime is committed by juveniles\n(under 18 cannot be incarcerated or placed in a detention facili\n(under 18 cannot be incarcerated or placed in a detention facility)\nty)\n\nCentral CID\nCentral CID\n2001 -- crime dropped 40%\ncrime dropped 40%\n2002 -- crime dropped 20%\ncrime dropped 20%\n72 surveillance cameras\n72 surveillance cameras\n17 sanitation staff\n17 sanitation staff\n\nPerformance Evaluation\nPerformance Evaluation\n(Cape Town CIDs)\n(Cape Town CIDs)\nBy\nBy--law mandates CID/Council service level agreements\nlaw mandates CID/Council service level agreements\nSANITATION (\"CLEANSING\")\nSANITATION (\"CLEANSING\")\n\nDomestic/Commercial/Industrial refuse removal\nDomestic/Commercial/Industrial refuse removal\n\nStreet Cleaning including servicing/provision of bins, removal o\nStreet Cleaning including servicing/provision of bins, removal of graffiti\nf graffiti\nSECURITY (\"PROTECTION SERVICES\")\nSECURITY (\"PROTECTION SERVICES\")\n\nCombating of street crime\nCombating of street crime\n\nIllegal parking, trading, and dumping\nIllegal parking, trading, and dumping\nPUBLIC INFRASTRUCTURE MAINTENANCE\nPUBLIC INFRASTRUCTURE MAINTENANCE\n\nWater, sewerage, electricity\nWater, sewerage, electricity\n\nRoads, pavements, traffic lights, street lights, signage, etc.\nRoads, pavements, traffic lights, street lights, signage, etc.\n\nSafety inspections\nSafety inspections\nWhat is the response time? What is the frequency?\nWhat is the response time? What is the frequency?\n\nAnnual Report to Council\nAnnual Report to Council\n(Center CID)\n(Center CID)\nTotal Survey Sample\nTotal Survey Sample\n\nRandom intercept\n\n--\npublic\npublic\n\n--\nbusiness\nbusiness\nTargeted sample\nTargeted sample\n\nRating Security by Sector\nGeneral public\n\n50%\n40%\n34.4%\n29.5%\n30%\n23.3%\n22.7%\n20.3%\n19.7%\n20%\n15.0%\n13.9%\n10%\n4.7%\n0.0%\n0%\nTotally\nNeither\nTotally\nAcceptable\nUnacceptable\n\nRating Security by Sector\nRating Security by Sector\nBusiness\nBusiness\n37.3%\n38.1%\n12.7%\n0.0%\n9.3%\n0.9%\n9.7%\n27.4%\n56.6%\n5.3%\n0%\n20%\n40%\n60%\nTotally\nAcceptable\nNeither\nTotally\nUnacceptable\n\nFeelings of Danger\n71.6%\n68.6%\n\nLoiterers\n60.8%\n\nDrug Dealers\n41.2%\n\nInformal Parking Attendants\n33.6%\n\nAttitude to Hawking by Sector\nGeneral public\n\n50%\n40%\n29.8%\n30%\n27.4%\n26.4%\n23.0%\n19.3%\n20.3%\n20%\n14.0%\n13.6%\n9.3%\n9.5%\n10%\n0%\nStrongly\nPositive\nNeutral\nNegative\nStrongly\npositive\nNegative\n\nAttitude to Hawking by Sector\nAttitude to Hawking by Sector\nBusiness\nBusiness\n3.4%\n22.9%\n28.8%\n40.7%\n32.2%\n11.9%\n24.8%\n19.5%\n12.4%\n2.7%\n0%\n10%\n20%\n30%\n40%\n50%\nStrongly\npositive\nPositive\nNeutral\nNegative\nStrongly\nNegative\n\nClosing Remarks\nClosing Remarks\nSouth African Policy\nSouth African Policy\n\nPositive vote (25% of property owners for plan, 51% for approval\nPositive vote (25% of property owners for plan, 51% for approval))\n\nServices must supplement those provided by local government\nServices must supplement those provided by local government\n\nAllows inclusion of residential properties\nAllows inclusion of residential properties\n\nShorter term limits (3 years)\nShorter term limits (3 years)\nSouth African Practices\nSouth African Practices\n\nEmphasis on Safe and Clean (rather than clean and safe)\nEmphasis on Safe and Clean (rather than clean and safe)\n\nMuch higher concentration of security staff per block\nMuch higher concentration of security staff per block\n\nReliance on surveillance cameras\nReliance on surveillance cameras\n\nStart up monies from local government\nStart up monies from local government\n\nInformal parking, illegal traders, and homeless children\nInformal parking, illegal traders, and homeless children\n\nMore sophisticated system for service level agreements\nMore sophisticated system for service level agreements\n\nOrganizations forming at rapid pace\nOrganizations forming at rapid pace\n\nIncreasingly popular on urban fringe and suburban areas\nIncreasingly popular on urban fringe and suburban areas\n\nCoordinated by partnership concerned with wide scale development\nCoordinated by partnership concerned with wide scale development"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture6findings.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/1bab84225a0fa2f80eddd908ddb852b2_lecture6findings.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.422 Business Improvement Districts\nLecture Six\nFindings from lectures 1 through 5:\n⇒ An examination of the BID movement provides evidence of a transnational urban development policy network\n⇒ The BID movement is characterized by (1) the diffusion of BID policy, (2) the proliferation of BID organizations and (3) the\npersistence of individual BID organizations\n⇒ Evidence shows that BID policy diffused from Canada to the United States to South Africa (policy success), as well as the\nUnited Kingdom, Japan and Brazil (policy emergence)\n⇒ Evidence shows that BID organizations proliferate in a variety of urban contexts (Toronto, Philadelphia, Cape Town)\n⇒ Individual BID organizations persist as evidenced by expanding budgets, boundaries, and term limits\nWhat are the advantages and disadvantages of transnational policy transfer to spatial management and development?\nSaid another way, how does the BID movement impact urban management and development?\nMANAGEMENT\nImpacts\nAdvantages\nDisadvantages\nBIDs raise money from\nprivate sector interests\nBIDs give business and property owners an\nopportunity to respond positively to urban\nfiscal crisis (diminished financial assistance\nfrom federal and state governments) and\nattempt to fill funding gaps\nBIDs allow business and property owners to influence\nthe management of public spaces\nBIDs provide\nsupplemental public\nservices\nBID services contribute to the cleanliness and\nsafety of commercial districts\nBIDs promote accountability by reinforcing\nthe nexus between taxation and service\nprovision and developing baseline service\nBIDs decrease the demand for city services (Moshe\nAdler, 2002)\nBIDs create wealth-based inequalities in service\ndelivery (Briffault, 1999)\n\nagreements with local government\nBIDs create jobs and provide job training to\nlow skilled workers\nBIDs allow municipality to focus attention on\nother areas of the city\nBIDs create space-based inequalities in service\ndelivery\nBIDs create jobs that undermine union positions and\nreinforce minimum wage standards\nBIDs are singularly focused and services may\ndetrimentally affect other neighborhoods (ie. crime\nspillover)\nBIDs represent a new\nform of urban governance\nBIDs represent a more focused and flexible\nform of urban governance (Levy, 2001)\nBID organizations are privately managed and\noperate with considerable autonomy\nBIDs are new governments, political actors,\nthat effectively advocate change and\ninfluence local decision-making processes\nBIDs contribute to the spatial and political\nfragmentation of the urban realm\nBIDs call into question the notion of democratic\naccountability (Briffault, 1999)\nBIDs are a new and powerful constituency that\nrepresent commercial, rather than residential interests\nBIDs are self-empowered\norganizations\nBIDs organizations provide a framework for\nbuilding social capital while avoiding the free\nrider problem\nBIDs provide evidence of eroding social capital\nbecause they encourage civic minded leaders to\nindulge in self-promotion\n\nDEVELOPMENT\nImpacts\nAdvantages\nDisadvantages\nBID alter perceptions of\nthe urban environment\nBIDs foster a changing attitude in the approach to\nrevitalization (Garrett, 2003)\nBIDs develop niche markets and work to promote\nbusiness attraction, retention and expansion\nBID organizations over simplify the\nproblems facing cities by focusing on\n\"clean and safe\"\nMultiple BID images can dilute or\ncontradict municipality's image\nBIDs alter the physical\nnature of the urban\nenvironment\nBID streetscape improvement programs visually and\nphysically unify public spaces, creating a sense of place.\nBIDs have the power to float bonds for significant capital\nimprovements.\nBIDs allow business and property owners\nto influence the character of public spaces\nand programs often encourage generic\ndesign schemes\nBID proliferation may detrimentally\nimpact the comprehensive plan or\nundermine long term development\nstrategies\nBIDs focus attention to\ndiscrete geographical\nboundaries\nBID activities are intended to draw people into public\nurban spaces; hence, BIDs invite rather than exclude\npeople.\nBIDs are effective because they focus on the health of a\nparticular community.\nBIDs seek to control social behavior in\npublic spaces, and discriminate against\npeople who live on the street as well as\nmerchants that target low income\ncustomers (ie. dollar stores, etc.)\nBIDs do not concern themselves with city-\nwide or regional issues.\nComprehensive Planning\n\nClosing Remarks\nLike Briffault, we concluded that BIDs are a sign of the times and are fundamentally \"good.\" While there is little empirical\nevidence examining the impact of BIDs, we concluded that the collective and net impact of BIDs in most municipalities is likely\npositive. Further, we will continue the discussion with a focus on new metrics for performance evaluation and mechanisms that\nrequire individual BIDs to coordinate activities across municipal jurisdictions."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/ad6b023420ec8610df069c23c8e2fec0_lecture7.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Urban Studies and Planning\n11.422 Business Improvement Districts\nLecture Seven\nGuest Speaker, Jerry Mitchell\nProfessor of Public Administration, Baruch College, City University of New York\n\"Business Improvement Districts, Friend or Foe?\"\n-What is downtown?\n-What is main street?\n-Are there instances when they are the same?\n-What do you like about downtown?\n-What do you dislike about downtown?\n-What is your downtown (Boston, Manhattan, etc.)?\n-Is the BID movement successful?\n-Through the promotion of clean and safe, do BIDs create dull and predictable\nenvironments? Through the promotion of entertainment, do they seek to make\ndowntowns more like Disney Land?\n-What if BIDs focused more attention on civic activities? What if they partnered with\nfaith-based congregations and set the stage for protests against the war on Iraq?\n-BIDs will exacerbate national economic trends. BIDs haven't yet experienced a major\neconomic down turn."
    },
    {
      "category": "Resource",
      "title": "gautenglegislation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/d623ed6a94ea07de50550d5160713202_gautenglegislation.pdf",
      "content": "GAUTENG PROVINCIAL LEGISLATURE\nGAUTENG\nCITY IMPROVEMENT\nDISTRICTS BILL\n(As introduced)\n(MEMBER OF THE EXECUTIVE COUNCIL FOR DEVELOPMENT PLANNING AND LOCAL GOVERNMENT)\n[G008--97]\nNo. of copies printed ....................................... 200\n\nBILL\nTo provide procedures for the formation and independent management of city\nimprovement districts to fund the provision of services in addition to those which\na municipality ordinarily provides in order to facilitate investment in the city\nimprovement district, to halt further degeneration of cities and to promote\neconomic growth and sustainable development within cities.\nB\nE IT ENACTED by the Provincial Legislature of Gauteng as follows:--\nDEFINITIONS\n1. In this Act, unless the context otherwise indicates--\n(i)\n''city improvement district'' means a geographic district approved in\nterms of section 3 of this Act;\n(ii)\n''MEC'' means the member of Executive Council responsible for\nDevelopment Planning and Local Government;\n(iii)\n''management body'' means the management body of a city improve\nment district established in terms of section 4 of this Act;\n(iv)\n''municipality'' means, subject to section 2(2), the municipality with the\nauthority to levy and recover property rates in respect of immovable\nproperty in the area of jurisdiction concerned;\n(v)\n''prescribe'' means prescribe by regulation in terms of Section 9 of this\nAct;\n(vi)\n''rates base in value'' means the total value of all immovable property\nwithin the boundaries of a city improvement district formed or proposed\nto be formed in terms of this Act, as appears from the valuation roll\nprepared in accordance with the Local Authorities Rating Ordinance (11\nof 1977);\n(vii)\n''rateable property'' means immovable property on which a rate or\nrates may be levied in accordance with the Local Authorities Rating\nOrdinance (11 of 1977);\n(viii)\n''regulation'' means a regulation prescribed in terms of this Act;\n(ix)\n''this Act'' includes the regulations.\nPETITION FOR FORMATION OF CITY IMPROVEMENT DISTRICT\n2. (1) A municipal council must, on receipt of a petition indicating the support of 25\npercent of owners of rateable properties within the boundaries of a proposed\ncity improvement district, consider the formation of a city improvement\ndistrict in accordance with the provisions of this Act.\n(2) A petitioner must make a petition to the municipal council of the municipality,\nsubject to subsection (3), within whose jurisdiction the proposed city\nimprovement district falls.\n(3) If the proposed city improvement district falls within the boundaries of two or\nmore municipalities, the municipal councils of these municipalities must,\nupon request by the petitioner, either--\n\n(a) agree to reallocate the powers and functions provided for in terms of this\nAct to one of such municipal councils; or\n(b) agree to form a committee made up of representatives of each municipal\ncouncil to exercise the powers and perform the functions provided for in\nterms of this Act.\n(4) A petition must take the form of a city improvement district plan, covering a\nthree year period taking into account the requirements of this Act, and must be\nin a form and must include the requirements prescribed.\n(5) The petitioner, after having received written acknowledgement of the petition\nby the municipal council, must notify the public of its petition and invite\ncomment from the public to be received by the municipal council, in\naccordance with subsection (6).\n(6) The petitioner must in the prescribed time and form cause to be published a\nnotice of the petition once in the Gauteng Provincial Gazette and once in a\ndaily newspaper circulating in or near the vicinity of the proposed city\nimprovement district.\n(7) The petitioner must in the prescribed time and form notify every owner of\nrateable property within the boundaries of the proposed city improvement\ndistrict of the petition by registered mail.\n(8) The petitioner must take reasonable steps to advertise notification of the\npetition within the boundaries of the proposed city improvement district.\n(9) The municipal council must make available for inspection a petition and any\ncomments and objections received by any interested party in respect of a\npetition.\n(10) The municipal council must consider the petition together with comments and\nobjections received at a public hearing at which the municipal council may\nallow members of the public to make oral representations to it regarding the\nformation of a city improvement district.\nDECISION ON PETITION FOR CITY IMPROVEMENT DISTRICT\n3. (1) In reaching a decision on a petition, a municipal council may take into account\nany matter prescribed or which is in the public interest and must take into\naccount the following--\n(a) the extent to which owners of rateable property in the proposed district\nare up to date with the payment of rates; and\n(b) whether the formation of the city improvement district is consistent with\nthe land development objectives set for the relevant area in terms of the\nDevelopment Facilitation Act (67 of 1995).\n(2) A municipal council may--\n(a) approve the formation of a city improvement district and a city\nimprovement district plan;\n(b) approve the formation of a city improvement district and a city\nimprovement district plan with amendments or conditions as the\nmunicipal council considers in the public interest; and\n(c) refer the petition back to the petitioners with written reasons for not\napproving the formation of a city improvement district or city improve\nment district plan indicating that the petition may be resubmitted to the\nmunicipal council in the time period prescribed, provided that if the\nresubmitted petition proposes an increased levy for any owner of rateable\nproperty, the petitioner must notify such owner by registered mail.\nFORMATION OF CITY IMPROVEMENT DISTRICT AND MANAGEMENT\nBODY\n4. (1) After a petition is approved in terms of section 3, the city improvement district\nmay be formed only after written proof in the prescribed form is provided to\nthe municipal council by the petitioner indicating that more than 50 percent of\nthe owners of rateable property who represent more than 50 percent of the rate\nbase in value of the property in the city improvement district, approve the\nformation of the city improvement district and city improvement district plan\nas approved by the municipal council.\n\n(2) After the written proof mentioned in subsection (1) is acknowledged by the\nmunicipal council, a city improvement district management body must be\nformed and incorporated in terms of section 21 of the Companies Act (61 of\n1973) or as any other legal entity approved by the MEC.\n(3) Owners of rateable property and tenants within the boundaries of the city\nimprovement district are entitled to be members of the management body,\nprovided that the votes of members may be weighted in proportion to the levy\npayable by them and provided further that the weighting accorded to any one\nmember or a group of members under common ownership or control may not\nexceed one third of the total number of votes which may be cast.\n(4) The board of directors of the management body must include at least three\nrepresentatives of the owners of rateable property and one representative of\nthe municipality, provided that the owners of rateable property must always be\nin the majority on the board.\nPOWERS AND DUTIES OF MANAGEMENT BODY\n5. (1) Within one month after collection of the first levy and in accordance with the\nbudget of the city improvement district plan, the management body must\nprovide the services that are indicated in the city improvement district plan.\n(2) Services provided for in the city improvement district plan and financed by\nthe levy charged to the owners of rateable property must be in addition to or\nan enhancement of those provided by the municipality.\n(3) On written application from an owner of rateable property within the city\nimprovement district, the management body may agree that the owner may\nmake non-monetary contributions to the city improvement district in\nsubstitution of part or all of the levy as the case may be: provided that the\nagreement must be in writing and clearly specify the obligations of the owner\nof rateable property.\n(4) The levy due in terms of this Act will be a debt due to the management body\nconcerned, and the management body may sue for and recover the amount by\naction in any competent court: provided that the management body may in its\ndiscretion recover the amount in the Magistrates Court in the area in which the\ncity improvement district is situated.\n(5) The management body must provide the municipality with its annual audited\nfinancial statements and a report on progress in the implementation of the city\nimprovement district plan within 3 months of the financial year-end of the\nmanagement body.\nPOWERS AND DUTIES OF MUNICIPALITY\n6. (1) Once a city improvement district has been formed, a municipality must levy\nan amount on behalf of the management body from the owners of rateable\nproperty in the city improvement district in accordance with the approved\nplan.\n(2) Such amount must be levied together with other amounts which the\nmunicipality may levy from the owners of rateable property in respect of rates\nand taxes but the purpose of the amount must be indicated as a separate item\nfrom other rates and taxes levied by the municipality.\n(3) The levies collected by the municipality for the city improvement district must\nbe paid on a monthly basis to the management body free of any deductions or\nset-off for the purpose of implementing the city improvement district plan.\nAMENDMENT OF CITY IMPROVEMENT DISTRICT PLAN\n7. (1) At any time after the formation of a city improvement district, the city\nimprovement district plan may be amended by the municipal council on\nrecommendation of the management body.\n(2) Amendments in terms of subsection (1) which the municipal council\nconsiders to be immaterial may be made by the municipal council after the\nmanagement body has given notice of its intention to amend the plan, by\nadvertisement in a daily newspaper circulating in the city improvement\ndistrict.\n\n(3) If the amendment is, in the opinion of the municipal council, a material\namendment or affects the levy to be charged in respect of the city\nimprovement district or changes the boundaries of the city improvement\ndistrict area then the management body must:\n(a) notify the public of the proposed amendment and invite comment from\nthe public to be received by the municipal council, by--\n(i) causing the publication of the notice referred to in subsection (a)\nonce in the Gauteng Provincial Gazette and once in a daily\nnewspaper circulating in or near the vicinity of the city\nimprovement district;\n(ii) notifying every owner of rateable property within the boundaries\nof the city improvement district of the amendment by registered\nmail; and\n(iii) advertising notification of the amendment within the boundaries\nof the city improvement district.\n(b) The proposed amendment and comments and objections received by the\nmunicipal council in respect of the proposed amendment must be made\navailable for inspection by any interested party.\n(c) The municipal council must consider the proposed amendment together\nwith comments or objections received at a public hearing at which the\nmunicipal council may allow members of the public to make oral\nrepresentations to it regarding the proposed amendment.\n(4) Section 3 will apply to decisions of the municipal council regarding proposed\namendments in terms of subsection (3) and section 4(1) will apply to approved\namendments.\nDISSOLUTION OF CITY IMPROVEMENT DISTRICT\n8. (1) In the case of insolvency of a management body, or on written petition in the\nprescribed form of more than 50 percent of the owners of rateable property\nand who represent more than 50 percent of the rates base in value within the\nboundaries of a city improvement district, a municipal council may\ndisestablish a city improvement district.\n(2) Subject to any applicable laws relating to insolvency, the municipal council\nmust cause the management body to be wound up and, if applicable, cause its\nnet assets remaining after satisfying its creditors to be transferred to the\nmunicipality or municipalities concerned.\nREGULATIONS\n9. The MEC must make regulations in respect of any matter required to be prescribed\nby this Act and may make any other regulations required for carrying out the\nprovisions of this Act.\nSHORT TITLE AND DATE OF COMMENCEMENT\n10. This Act will be called the City Improvement Districts Act and will come into\noperation on a date to be proclaimed by the MEC in the Gauteng Provincial\nGazette.\n\nMEMORANDUM IN TERMS OF RULE 137 OF THE STANDING\nRULES OF THE PROVINCIAL LEGISLATURE ON THE\nCITY IMPROVEMENT DISTRICTS BILL, 1997\n(i) Reasons for the bill\nSustainable city and town centres are important for the development of South Africa.\nThey have been recognized by the Gauteng provincial government as especially\nimportant to development in Gauteng. For various historical and current reasons,\nmany centres of our cities and towns are caught in a state of degeneration.\nAlthough this is cause for concern for all of our citizens, and is accordingly being\naddressed at national, provincial and local government level, it is of particular\nconcern for the property owners and residents in city and town centres.\nThe legislation, therefore, establishes a mechanism where property owners will be\nencouraged to participate in the processes of sustainable development. It recognises\nthe unique needs and challenges facing different geographic areas and allows for\nindividualised targeting of those needs.\n(ii) Effects of the bill\nThe bill establishes a mechanism where municipalities can formally recognise\ngeographic districts--termed city improvement districts--in order that such districts\nmay provide services in addition to those provided by the municipality. The services\nwill be funded from levies collected from the property owners within the city\nimprovement district. The services will be provided and the levies will be collected\nin accordance with a plan approved by the municipal council and administered by the\nmanagement body of the city improvement district representing property owners,\ntenants, and the municipality. Additional services could include:\n- services which enhance the security of persons and property within the district;\n- training projects for personnel involved in the provision of services;\n- enhanced sanitation services;\n- beautification projects including construction and installation of landscaping,\nplanting and park areas;\n- improved signage and lighting;\n- promotional activities and tourism services in respect of the district;\n- capital expenditure on improvements such as the erection of bus shelters, hawkers'\nstands, construction of parking facilities and other structures;\n- services which assist vagrants or homeless people; and\n- management of capital improvements and projects provided or initiated by the\nmunicipality, by agreement with the municipality.\n(iii) Environmental impact\nThe environment may be impacted depending on the nature of the city improvement\ndistrict plans approved by municipal councils.\n(iv) Financial implications\nMunicipalities will incur marginal costs in collecting services levies on behalf of the\ncity improvement district management bodies.\n(v) Comments\nThe bill has not been published for comment.\n(vi) Clause-by-clause explanations\n(aa) Certain terms are defined in clause 1.\n(bb) Clause 2 provides procedures for consideration of petitions for formation of\ncity improvement districts by municipal councils.\n\n(cc) Clause 3 details criteria to be used by municipal councils in making decisions\nwith regard to petitions for city improvement districts. It also details the types\nof decisions which can be made.\n(dd) Clause 4 provides that city improvement districts may only be established\nafter proof of support from the majority of owners of property in the district,\nis shown. It also makes provision for the formation of management bodies of\ncity improvement districts.\n(ee) Clause 5 details the powers and duties of the management bodies of city\nimprovement districts.\n(ff) Clause 6 details the powers and duties of the municipality with regard to\nformed city improvement districts.\n(gg) Clause 7 provides procedures for consideration of amendments to city\nimprovement districts by municipal councils.\n(hh) Clause 8 provides for disestablishment of city improvement districts.\n(ii) Clause 9 concerns the promulgation of regulations.\n(jj) Clause 10 concerns the short title and commencement.\nMEMORANDUM REGARDING CONSULTATION\nIn the development of this bill, the following were consulted:\nLocal Authorities in Gauteng\nGauteng Planning and Development Forum\nJohannesburg Inner City Development Forum\nPretoria Inner City Partnership\nNational Business Initiative\nSouth African Property Owners Association\nCentral Johannesburg Partnership\nGauteng Chamber of Commerce and Industry\n\n------------------------------------\nPrinted by Creda Press"
    },
    {
      "category": "Resource",
      "title": "gautenglegsltion.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/3b90647a2f619ae13af411226144bcea_gautenglegsltion.pdf",
      "content": "GAUTENG PROVINCIAL LEGISLATURE\nGAUTENG\nCITY IMPROVEMENT\nDISTRICTS BILL\n(As introduced)\n(MEMBER OF THE EXECUTIVE COUNCIL FOR DEVELOPMENT PLANNING AND LOCAL GOVERNMENT)\n[G008--97]\nNo. of copies printed ....................................... 200\n\nBILL\nTo provide procedures for the formation and independent management of city\nimprovement districts to fund the provision of services in addition to those which\na municipality ordinarily provides in order to facilitate investment in the city\nimprovement district, to halt further degeneration of cities and to promote\neconomic growth and sustainable development within cities.\nB\nE IT ENACTED by the Provincial Legislature of Gauteng as follows:--\nDEFINITIONS\n1. In this Act, unless the context otherwise indicates--\n(i)\n''city improvement district'' means a geographic district approved in\nterms of section 3 of this Act;\n(ii)\n''MEC'' means the member of Executive Council responsible for\nDevelopment Planning and Local Government;\n(iii)\n''management body'' means the management body of a city improve\nment district established in terms of section 4 of this Act;\n(iv)\n''municipality'' means, subject to section 2(2), the municipality with the\nauthority to levy and recover property rates in respect of immovable\nproperty in the area of jurisdiction concerned;\n(v)\n''prescribe'' means prescribe by regulation in terms of Section 9 of this\nAct;\n(vi)\n''rates base in value'' means the total value of all immovable property\nwithin the boundaries of a city improvement district formed or proposed\nto be formed in terms of this Act, as appears from the valuation roll\nprepared in accordance with the Local Authorities Rating Ordinance (11\nof 1977);\n(vii)\n''rateable property'' means immovable property on which a rate or\nrates may be levied in accordance with the Local Authorities Rating\nOrdinance (11 of 1977);\n(viii)\n''regulation'' means a regulation prescribed in terms of this Act;\n(ix)\n''this Act'' includes the regulations.\nPETITION FOR FORMATION OF CITY IMPROVEMENT DISTRICT\n2. (1) A municipal council must, on receipt of a petition indicating the support of 25\npercent of owners of rateable properties within the boundaries of a proposed\ncity improvement district, consider the formation of a city improvement\ndistrict in accordance with the provisions of this Act.\n(2) A petitioner must make a petition to the municipal council of the municipality,\nsubject to subsection (3), within whose jurisdiction the proposed city\nimprovement district falls.\n(3) If the proposed city improvement district falls within the boundaries of two or\nmore municipalities, the municipal councils of these municipalities must,\nupon request by the petitioner, either--\n\n(a) agree to reallocate the powers and functions provided for in terms of this\nAct to one of such municipal councils; or\n(b) agree to form a committee made up of representatives of each municipal\ncouncil to exercise the powers and perform the functions provided for in\nterms of this Act.\n(4) A petition must take the form of a city improvement district plan, covering a\nthree year period taking into account the requirements of this Act, and must be\nin a form and must include the requirements prescribed.\n(5) The petitioner, after having received written acknowledgement of the petition\nby the municipal council, must notify the public of its petition and invite\ncomment from the public to be received by the municipal council, in\naccordance with subsection (6).\n(6) The petitioner must in the prescribed time and form cause to be published a\nnotice of the petition once in the Gauteng Provincial Gazette and once in a\ndaily newspaper circulating in or near the vicinity of the proposed city\nimprovement district.\n(7) The petitioner must in the prescribed time and form notify every owner of\nrateable property within the boundaries of the proposed city improvement\ndistrict of the petition by registered mail.\n(8) The petitioner must take reasonable steps to advertise notification of the\npetition within the boundaries of the proposed city improvement district.\n(9) The municipal council must make available for inspection a petition and any\ncomments and objections received by any interested party in respect of a\npetition.\n(10) The municipal council must consider the petition together with comments and\nobjections received at a public hearing at which the municipal council may\nallow members of the public to make oral representations to it regarding the\nformation of a city improvement district.\nDECISION ON PETITION FOR CITY IMPROVEMENT DISTRICT\n3. (1) In reaching a decision on a petition, a municipal council may take into account\nany matter prescribed or which is in the public interest and must take into\naccount the following--\n(a) the extent to which owners of rateable property in the proposed district\nare up to date with the payment of rates; and\n(b) whether the formation of the city improvement district is consistent with\nthe land development objectives set for the relevant area in terms of the\nDevelopment Facilitation Act (67 of 1995).\n(2) A municipal council may--\n(a) approve the formation of a city improvement district and a city\nimprovement district plan;\n(b) approve the formation of a city improvement district and a city\nimprovement district plan with amendments or conditions as the\nmunicipal council considers in the public interest; and\n(c) refer the petition back to the petitioners with written reasons for not\napproving the formation of a city improvement district or city improve\nment district plan indicating that the petition may be resubmitted to the\nmunicipal council in the time period prescribed, provided that if the\nresubmitted petition proposes an increased levy for any owner of rateable\nproperty, the petitioner must notify such owner by registered mail.\nFORMATION OF CITY IMPROVEMENT DISTRICT AND MANAGEMENT\nBODY\n4. (1) After a petition is approved in terms of section 3, the city improvement district\nmay be formed only after written proof in the prescribed form is provided to\nthe municipal council by the petitioner indicating that more than 50 percent of\nthe owners of rateable property who represent more than 50 percent of the rate\nbase in value of the property in the city improvement district, approve the\nformation of the city improvement district and city improvement district plan\nas approved by the municipal council.\n\n(2) After the written proof mentioned in subsection (1) is acknowledged by the\nmunicipal council, a city improvement district management body must be\nformed and incorporated in terms of section 21 of the Companies Act (61 of\n1973) or as any other legal entity approved by the MEC.\n(3) Owners of rateable property and tenants within the boundaries of the city\nimprovement district are entitled to be members of the management body,\nprovided that the votes of members may be weighted in proportion to the levy\npayable by them and provided further that the weighting accorded to any one\nmember or a group of members under common ownership or control may not\nexceed one third of the total number of votes which may be cast.\n(4) The board of directors of the management body must include at least three\nrepresentatives of the owners of rateable property and one representative of\nthe municipality, provided that the owners of rateable property must always be\nin the majority on the board.\nPOWERS AND DUTIES OF MANAGEMENT BODY\n5. (1) Within one month after collection of the first levy and in accordance with the\nbudget of the city improvement district plan, the management body must\nprovide the services that are indicated in the city improvement district plan.\n(2) Services provided for in the city improvement district plan and financed by\nthe levy charged to the owners of rateable property must be in addition to or\nan enhancement of those provided by the municipality.\n(3) On written application from an owner of rateable property within the city\nimprovement district, the management body may agree that the owner may\nmake non-monetary contributions to the city improvement district in\nsubstitution of part or all of the levy as the case may be: provided that the\nagreement must be in writing and clearly specify the obligations of the owner\nof rateable property.\n(4) The levy due in terms of this Act will be a debt due to the management body\nconcerned, and the management body may sue for and recover the amount by\naction in any competent court: provided that the management body may in its\ndiscretion recover the amount in the Magistrates Court in the area in which the\ncity improvement district is situated.\n(5) The management body must provide the municipality with its annual audited\nfinancial statements and a report on progress in the implementation of the city\nimprovement district plan within 3 months of the financial year-end of the\nmanagement body.\nPOWERS AND DUTIES OF MUNICIPALITY\n6. (1) Once a city improvement district has been formed, a municipality must levy\nan amount on behalf of the management body from the owners of rateable\nproperty in the city improvement district in accordance with the approved\nplan.\n(2) Such amount must be levied together with other amounts which the\nmunicipality may levy from the owners of rateable property in respect of rates\nand taxes but the purpose of the amount must be indicated as a separate item\nfrom other rates and taxes levied by the municipality.\n(3) The levies collected by the municipality for the city improvement district must\nbe paid on a monthly basis to the management body free of any deductions or\nset-off for the purpose of implementing the city improvement district plan.\nAMENDMENT OF CITY IMPROVEMENT DISTRICT PLAN\n7. (1) At any time after the formation of a city improvement district, the city\nimprovement district plan may be amended by the municipal council on\nrecommendation of the management body.\n(2) Amendments in terms of subsection (1) which the municipal council\nconsiders to be immaterial may be made by the municipal council after the\nmanagement body has given notice of its intention to amend the plan, by\nadvertisement in a daily newspaper circulating in the city improvement\ndistrict.\n\n(3) If the amendment is, in the opinion of the municipal council, a material\namendment or affects the levy to be charged in respect of the city\nimprovement district or changes the boundaries of the city improvement\ndistrict area then the management body must:\n(a) notify the public of the proposed amendment and invite comment from\nthe public to be received by the municipal council, by--\n(i) causing the publication of the notice referred to in subsection (a)\nonce in the Gauteng Provincial Gazette and once in a daily\nnewspaper circulating in or near the vicinity of the city\nimprovement district;\n(ii) notifying every owner of rateable property within the boundaries\nof the city improvement district of the amendment by registered\nmail; and\n(iii) advertising notification of the amendment within the boundaries\nof the city improvement district.\n(b) The proposed amendment and comments and objections received by the\nmunicipal council in respect of the proposed amendment must be made\navailable for inspection by any interested party.\n(c) The municipal council must consider the proposed amendment together\nwith comments or objections received at a public hearing at which the\nmunicipal council may allow members of the public to make oral\nrepresentations to it regarding the proposed amendment.\n(4) Section 3 will apply to decisions of the municipal council regarding proposed\namendments in terms of subsection (3) and section 4(1) will apply to approved\namendments.\nDISSOLUTION OF CITY IMPROVEMENT DISTRICT\n8. (1) In the case of insolvency of a management body, or on written petition in the\nprescribed form of more than 50 percent of the owners of rateable property\nand who represent more than 50 percent of the rates base in value within the\nboundaries of a city improvement district, a municipal council may\ndisestablish a city improvement district.\n(2) Subject to any applicable laws relating to insolvency, the municipal council\nmust cause the management body to be wound up and, if applicable, cause its\nnet assets remaining after satisfying its creditors to be transferred to the\nmunicipality or municipalities concerned.\nREGULATIONS\n9. The MEC must make regulations in respect of any matter required to be prescribed\nby this Act and may make any other regulations required for carrying out the\nprovisions of this Act.\nSHORT TITLE AND DATE OF COMMENCEMENT\n10. This Act will be called the City Improvement Districts Act and will come into\noperation on a date to be proclaimed by the MEC in the Gauteng Provincial\nGazette.\n\nMEMORANDUM IN TERMS OF RULE 137 OF THE STANDING\nRULES OF THE PROVINCIAL LEGISLATURE ON THE\nCITY IMPROVEMENT DISTRICTS BILL, 1997\n(i) Reasons for the bill\nSustainable city and town centres are important for the development of South Africa.\nThey have been recognized by the Gauteng provincial government as especially\nimportant to development in Gauteng. For various historical and current reasons,\nmany centres of our cities and towns are caught in a state of degeneration.\nAlthough this is cause for concern for all of our citizens, and is accordingly being\naddressed at national, provincial and local government level, it is of particular\nconcern for the property owners and residents in city and town centres.\nThe legislation, therefore, establishes a mechanism where property owners will be\nencouraged to participate in the processes of sustainable development. It recognises\nthe unique needs and challenges facing different geographic areas and allows for\nindividualised targeting of those needs.\n(ii) Effects of the bill\nThe bill establishes a mechanism where municipalities can formally recognise\ngeographic districts--termed city improvement districts--in order that such districts\nmay provide services in addition to those provided by the municipality. The services\nwill be funded from levies collected from the property owners within the city\nimprovement district. The services will be provided and the levies will be collected\nin accordance with a plan approved by the municipal council and administered by the\nmanagement body of the city improvement district representing property owners,\ntenants, and the municipality. Additional services could include:\n- services which enhance the security of persons and property within the district;\n- training projects for personnel involved in the provision of services;\n- enhanced sanitation services;\n- beautification projects including construction and installation of landscaping,\nplanting and park areas;\n- improved signage and lighting;\n- promotional activities and tourism services in respect of the district;\n- capital expenditure on improvements such as the erection of bus shelters, hawkers'\nstands, construction of parking facilities and other structures;\n- services which assist vagrants or homeless people; and\n- management of capital improvements and projects provided or initiated by the\nmunicipality, by agreement with the municipality.\n(iii) Environmental impact\nThe environment may be impacted depending on the nature of the city improvement\ndistrict plans approved by municipal councils.\n(iv) Financial implications\nMunicipalities will incur marginal costs in collecting services levies on behalf of the\ncity improvement district management bodies.\n(v) Comments\nThe bill has not been published for comment.\n(vi) Clause-by-clause explanations\n(aa) Certain terms are defined in clause 1.\n(bb) Clause 2 provides procedures for consideration of petitions for formation of\ncity improvement districts by municipal councils.\n\n(cc) Clause 3 details criteria to be used by municipal councils in making decisions\nwith regard to petitions for city improvement districts. It also details the types\nof decisions which can be made.\n(dd) Clause 4 provides that city improvement districts may only be established\nafter proof of support from the majority of owners of property in the district,\nis shown. It also makes provision for the formation of management bodies of\ncity improvement districts.\n(ee) Clause 5 details the powers and duties of the management bodies of city\nimprovement districts.\n(ff) Clause 6 details the powers and duties of the municipality with regard to\nformed city improvement districts.\n(gg) Clause 7 provides procedures for consideration of amendments to city\nimprovement districts by municipal councils.\n(hh) Clause 8 provides for disestablishment of city improvement districts.\n(ii) Clause 9 concerns the promulgation of regulations.\n(jj) Clause 10 concerns the short title and commencement.\nMEMORANDUM REGARDING CONSULTATION\nIn the development of this bill, the following were consulted:\nLocal Authorities in Gauteng\nGauteng Planning and Development Forum\nJohannesburg Inner City Development Forum\nPretoria Inner City Partnership\nNational Business Initiative\nSouth African Property Owners Association\nCentral Johannesburg Partnership\nGauteng Chamber of Commerce and Industry\n\n------------------------------------\nPrinted by Creda Press"
    },
    {
      "category": "Resource",
      "title": "bid398.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/08cbc26034132851610a9fcbd9cd2228_bid398.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "panid11998.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/8860b2795309196a8b0d2c0de8a17815_panid11998.pdf",
      "content": "SENATE AMENDED\nPRIOR PRINTER'S NOS. 3961, 4059, 4145\nPRINTER'S NO. 4194\nTHE GENERAL ASSEMBLY OF PENNSYLVANIA\nHOUSE BILL\nSession of\nNo. 2858 1998\nINTRODUCED BY REINARD, PETRONE, J. TAYLOR, MARSICO, PIPPY, LEH\nAND STURLA, OCTOBER 6, 1998\nAS AMENDED ON THIRD CONSIDERATION, IN SENATE, NOVEMBER 24, 1998\nAN ACT\n1 Establishing RELATING TO CITIES OF THE FIRST CLASS, ESTABLISHING <\nNeighborhood Improvement Districts; conferring powers and\nduties on municipal corporations and neighborhood improvement\ndistricts; AND providing for annual audits; and making\n<\nrepeals. AND FOR TOURISM AND MARKETING.\n<\nTABLE OF CONTENTS\n7 Section 1. Short title.\n8 Section 2. Legislative findings.\n9 Section 3. Definitions.\n10 Section 4. Powers of municipal corporation.\n11 Section 5. Creation of neighborhood improvement district.\n12 Section 6. Creation of neighborhood improvement district\nmanagement association.\n14 Section 7. Powers of neighborhood improvement district\nmanagement association.\n16 Section 8. Dissolution of neighborhood improvement district\nmanagement association and neighborhood\nimprovement district.\n\nSection 9. Annual audit; report.\nSection 10. Applicability.\n<\nSection 11. Effective date.\nSECTION 10. TOURISM AND MARKETING TAX.\n<\nSECTION 11. SPECIAL TOURISM AND MARKETING TAX FUND.\nSECTION 12. APPLICABILITY.\nSECTION 13. EFFECTIVE DATE.\nThe General Assembly of the Commonwealth of Pennsylvania\nhereby enacts as follows:\nSection 1. Short title.\nThis act shall be known and may be cited as the Neighborhood\n<\nCOMMUNITY AND ECONOMIC Improvement District Act.\n<\nSection 2. Legislative findings.\nThe General Assembly finds that:\n(1) Existing tax rates in many municipalities are at or\nnear their statutory cap.\n(2) The General Fund revenue derived from these taxes\nmany times is not sufficient to provide adequate municipal\nservices or additional services needed in specific geographic\nareas within the municipality, including, but not limited to,\ndowntown commercial districts.\n(3) As a result, municipalities should be encouraged to\ncreate, where feasible and desired, assessment-based\nneighborhood improvement districts which would include, but\nnot be limited to, downtown commercial districts. Designated\ndistrict management associations would initiate and\nadminister programs to promote and enhance more attractive\nand safer commercial, industrial, residential and mixed-use\nneighborhoods; economic growth; increased employment\nopportunities; and improved commercial, industrial, business\n19980H2858B4194\n- 2 -\n\ndistricts and business climates.\n(4) Municipalities should be given the broadest possible\ndiscretion in establishing by local ordinance the type of\nassessment-based programs most consistent with neighborhood\nneeds, goals and objectives, as determined and expressed by\nproperty owners in the designated district.\nSection 3. Definitions.\nThe following words and phrases when used in this act shall\nhave the meanings given to them in this section unless the\ncontext clearly indicates otherwise:\n\"Authority.\" A body politic and corporate, created pursuant\nto the act of May 2, 1945 (P.L.382, No.164), known as the\nMunicipality Authorities Act of 1945.\n\"Benefited property.\" Those properties located within a\nneighborhood improvement district which profit from district\nimprovements based on a rational nexus test. Properties need not\nprofit equally to be considered to have benefited.\n\"Bonds.\" The term shall include the notes, bonds and other\nevidence of indebtedness or obligations which each municipal\ncorporation is authorized to issue under section 4(5).\n\"Business improvement.\" In the case of neighborhood\nimprovement district management associations created for the\npurpose of making improvements or providing administrative\nservices within a neighborhood improvement district, the term\nshall mean those improvements needed in specific areas or to\nindividual properties, including, but not limited to, sidewalks,\nretaining walls, street paving, parks, recreational equipment\nand facilities, open space, street lighting, parking lots,\nparking garages, trees and shrubbery, pedestrian walks, sewers,\nwater lines, rest areas and the acquisition and rehabilitation\n19980H2858B4194\n- 3 -\n\nor demolition of blighted buildings or structures.\n\"Business improvement district.\" A business improvement\ndistrict (BID) created prior to the effective date of this act\ngoverned by the act of May 2, 1945 (P.L.382, No.164), known as\nthe Municipality Authorities Act of 1945, insofar as it relates\nto business improvement districts or 53 Pa.C.S. Ch. 54 (relating\nto business improvement districts). On or after the effective\ndate of this act, the term shall mean a limited, geographical\narea comprised of real property which is used for any for-profit\nactivity involving trade and traffic, or commerce in general.\n\"Commercial.\" Relating to or associated with any for-profit\nactivity involving trade and traffic, or commerce in general.\n\"Construction expenditures.\" Property and right-of-way\nacquisition costs where applicable.\n\"Costs of improvements.\" The term includes architectural\nfees, engineering fees, attorney fees, consulting fees,\nprofessional fees, preliminary planning expenditures,\nfeasibility study expenditures, financing costs and any other\nexpenditures necessary and incidental to the development,\nconstruction or completion of the improvement.\n\"District Advisory Council.\" A committee comprised of\nproperty owners from a neighborhood improvement district\nestablished under section 7(a), for the purpose of providing\nguidance and direction to the neighborhood improvement district\nmanagement association concerning association activities within\nthe district.\n\"Industrial district.\" A limited, geographical area\ncomprised of real property which is used predominantly for\nmanufacturing, commercial or any other activity related to the\ndistribution of goods and services and intermediate and final\n19980H2858B4194\n- 4 -\n\nproducts, including, but not limited to, warehousing, shipping,\ntransportation, remanufacturing, stockpiling of raw materials,\nrepair and maintenance of machinery and equipment, storage,\nadministration or business activities, and research and\ndevelopment.\n\"Institution.\" The term includes, but is not limited to,\ncolleges, universities, schools, hospitals, museums, theaters,\nchurches, synagogues, art centers or similar facilities.\n\"Institutional district.\" A limited, geographical area\ncomprised predominantly of real property on which educational,\nhealth-related or cultural activities occur within buildings and\nstructures, including, but not limited to, colleges,\nuniversities, schools, hospitals, museums, theaters, churches,\nsynagogues and art centers.\n\"Mixed-use district.\" A limited, geographical area comprised\nof real property used for any or all purposes contained within a\nbusiness, residential, industrial or institutional district.\n\"Municipal corporation.\" The body or board authorized by law\nto enact ordinances or adopt resolutions for the particular\n<\nmunicipality A CITY OF THE FIRST CLASS.\n<\n\"Municipality.\" Any city, borough, incorporated town,\n<\ntownship, home rule, optional plan or optional charter\nmunicipality, OF THE FIRST CLASS located within this\n<\nCommonwealth.\n\"Neighborhood.\" A limited geographic area within a\nmunicipality establishing a neighborhood improvement district,\nthe limits of which form the neighborhood improvement district\nboundary.\n\"Neighborhood improvement.\" Improvements needed in specific\ngeographic areas or to individual properties within those areas,\n19980H2858B4194\n- 5 -\n\nincluding, but not limited to, sidewalks, retaining walls,\nstreet paving, parks, recreational equipment and facilities,\nopen space, street lighting, parking lots, trees and shrubbery,\nsewers, water lines, rest areas and the acquisition and\nrehabilitation or demolition of deteriorated buildings or\nstructures.\n\"Neighborhood improvement district.\" A limited geographic\narea within a municipality, in which a special assessment is\nlevied on all designated property, other than tax-exempt\nproperty, for the purpose of promoting the economic and general\nwelfare of the district and the municipality, hereinafter\nreferred to as NID. Such districts shall be referred to\ngenerally as neighborhood improvement district (NID) and\nspecifically as: business improvement district (BID);\nresidential improvement district (RID); industrial improvement\ndistrict (IID); institutional improvement district (INID); or\nmixed-use improvement district (MID) depending on the type\ndistrict established.\n\"Neighborhood improvement district management association.\"\nThe governing body which oversees the management of neighborhood\nimprovement districts in a municipality as established under\nsection 5 which hereinafter shall be referred to as the NIDMA.\nSuch body shall be incorporated as a nonprofit corporation in\nthis Commonwealth or an authority as established pursuant to the\nact of May 2, 1945 (P.L.382, No.164), known as the Municipality\nAuthorities Act of 1945.\n\"Neighborhood improvement district plan.\" The strategic plan\nfor neighborhood improvements required by section 5, hereinafter\nreferred to as NIDP, and all projects, programs and supplemental\nservices to be provided within the district to implement the\n19980H2858B4194\n- 6 -\n\nplan by the neighborhood improvement district management\nassociation.\n\"Neighborhood improvement district services.\" In the case of\nneighborhood improvement district management associations\ncreated for the purpose of making improvements or providing\nexpanded services within any neighborhood business improvement\ndistricts established, the term shall include, but not be\nlimited to, those services which improve the ability of the\ncommercial establishments within the district to serve the\nconsumer, such as free or reduced-fee parking for customers,\ntransportation-related expenses, public relations programs,\ngroup advertising, and district maintenance and security\nservices. For services provided within any residential,\nindustrial, institutional, or mixed-use neighborhood improvement\ndistrict, the term shall include, but not be limited to, those\nservices which improve the ability of property owners to enjoy a\nsafer and more attractive neighborhood through the provision of\nincreased or expanded services, including street lighting,\nstreet cleaning, street maintenance, parks, recreational\nequipment and facilities, open space and/or security services.\n\"Nonprofit corporation.\" A legal entity that is incorporated\nwithin this Commonwealth and specifies in its charter or bylaws\nthat no part of the net earnings may benefit any private\nshareholder or individual holding interest in such entity.\n\"Private security officer.\" Any person or firm employed by\nthe neighborhood improvement district management association for\nthe purpose of providing increased security or protective patrol\nservices within the neighborhood improvement district. The term\nmay include off-duty police officers provided that the use of\nsuch officers for this purpose is approved by the governing body\n19980H2858B4194\n- 7 -\n\nof the municipality in which the neighborhood improvement\ndistrict is located or the municipality where the officer is\nemployed if different.\n\"Project.\" The acquisition, development, construction,\nimprovement, rehabilitation, operation and/or maintenance of any\nbuilding, facility, equipment or structure, by purchase, lease\nor contract, by a neighborhood improvement district management\nassociation to facilitate neighborhood and business improvements\nas authorized by this act.\n\"Rational nexus.\" The legal principle which requires that\nthere is a rational, definable benefit which accrues to any\nproperty owner assessed a fee for said benefit in a neighborhood\nimprovement district created under this act. All property owners\nwithin a designated neighborhood improvement district paying a\nspecial assessment fee must benefit directly or indirectly from\nfacilities or services provided by a neighborhood improvement\ndistrict management association within the neighborhood\nimprovement district, provided, however, that property owners\nneed not benefit equally.\n\"REGIONAL ATTRACTIONS MARKETING AGENCY.\" THE AGENCY\n<\nDESIGNATED BY THE COUNCIL OF THE CITY IN WHICH THE CONVENTION\nCENTER IS LOCATED TO SERVE AS THE REGIONAL MARKETING\nORGANIZATION FOR TOURISM AND RELATED MATTERS. IN CITIES OF THE\nFIRST CLASS, THE GREATER PHILADELPHIA TOURISM MARKETING\nCORPORATION SHALL SERVE AS THE REGIONAL ATTRACTIONS MARKETING\nAGENCY.\n\"Residential district.\" A limited, geographical area\ncomprised of real property consisting predominantly of buildings\nand structures for housing individuals and families, including,\nbut not limited to, single family detached homes, single family\n19980H2858B4194\n- 8 -\n\nsemi-detached homes, townhouses, condominiums, apartments,\nmanufactured homes, modular homes or any combination of same.\n\"Service area.\" The area within the boundaries of the\nneighborhood improvement district established by a municipality\nunder this act, in which the neighborhood improvement district\nmanagement association provides programs, services and\nimprovements. The term may also include an area outside of the\nneighborhood improvement district where services are being\nprovided by the neighborhood improvement district management\nassociation under contract.\n\"Special assessment fee.\" The fee assessed on property\nowners within a neighborhood improvement district, levied by the\nmunicipality establishing a neighborhood improvement district,\nunder section 4(8), for the purposes of providing programs,\nimprovements and services, under section 7.\n\"Sunset provision.\" The term means a provision in the\nneighborhood improvement district plan, under section 5(c),\nestablishing a neighborhood improvement district, which provides\nfor the automatic termination of the neighborhood improvement\ndistrict on a date specified in the neighborhood improvement\ndistrict plan and in the municipal ordinance establishing the\nneighborhood improvement district. The neighborhood improvement\ndistrict may be continued beyond that date, provided the\nmunicipal enabling ordinance creating the original neighborhood\nimprovement district is reenacted, following a review of the\nneighborhood improvement district and the neighborhood\nimprovement district management association programs and\nservices provided within the neighborhood improvement district,\nby the municipality.\nSection 4. Powers of municipal corporation.\n19980H2858B4194\n- 9 -\n\nEvery municipal corporation shall have the power:\n(1) To establish within the municipality an area or\nareas designated as an NID.\n(2) To establish an authority to administer the NID or\nto designate an existing community development corporation or\nother existing nonprofit corporation to administer same or to\ncreate a community development corporation or other nonprofit\ncorporation to administer same, under sections 6 and 7.\n(3) To appropriate and expend, in accordance with the\nspecific provisions of the municipal enabling ordinance,\nmunicipal funds as may be required to:\n(i) Acquire by purchase or lease real or personal\nproperty deemed necessary to effectuate the purposes of\nthe NID.\n(ii) Prepare or have prepared preliminary planning\nor feasibility studies to determine needed improvements\nin an NID, including, but not limited to, capital\nimprovements, traditional streetscape and building\nrenovations, retaining walls, street paving, street\nlighting, parking lots, parking garages, trees and\nshrubbery, pedestrian walks, sewers, water lines, rest\nareas, acquisition, rehabilitation or demolition of\nblighted buildings and structures, graffiti removal,\nsecurity, marketing, promotions, advertising, business\nretention and recruitment activities, master leasing and\nproperty management, joint advertising, research and\nplanning, as well as the provision of additional services\nto supplement, not replace, existing municipal services\nprovided within the NID.\n(4) To advance funds to a NIDMA as may be required to\n19980H2858B4194\n- 10 -\n\ncarry out the purposes of this act.\n(5) To collect special property assessments on behalf of\nthe NIDMA levied on designated property owners within the\nNID, and to employ any legal methods to insure collection of\nthe assessments.\n(6) To acquire by gift, purchase or eminent domain,\nland, real property, or rights-of way, which may be needed\nfor the purposes of making physical improvements within the\nNID.\n(7) To issue bonds, notes or guarantees, in accordance\nwith the provisions of general laws in the amounts and for\nthe periods necessary, to finance needed improvements within\nany NID.\n(8) To review all proposed expenditures of funds within\nNIDs by NIDMAs and suggest changes to same where a nonprofit\ncorporation is the NIDMA.\n(9) To include a sunset provision of no less than five\nyears in the municipal enabling ordinance creating the NID\nand in the contract with the NIDMA.\n(10) To levy an assessment fee on property owners\nlocated within an NID needed to finance additional\nsupplemental programs, services and improvements to be\nprovided or made by the NIDMA.\nSection 5. Creation of neighborhood improvement district.\n(a) Establishment.-\n(1) The governing body of the municipality, or any\nmunicipal businesses, or residents, or combination thereof,\nmay initiate action to establish an NID or NIDs within the\nmunicipality, under this act.\n(2) In the case of businesses, or residents, or both\n19980H2858B4194\n- 11 -\n\ndesiring to establish an NID, where the municipality has not\ntaken action to do so, the governing body of the municipality\nmay be petitioned to establish an NID, under the procedures\nprovided for by this act.\n(3) In no case, where the governing body of a\nmunicipality is petitioned to establish an NID under\nparagraph (2), shall the municipality be required to\nestablish an NID.\n(b) Specific procedures.-\n(1) A copy of everything required under this section, as\nwell as the date, location and time of any public hearing\nrequired by this act, shall be provided by the municipal\ncorporation to all property owners and lessees of property\nowners located in the proposed NID, at least 30 days prior to\nthe first public hearing required by this section.\n(2) At least one public hearing, no earlier than 15 days\napart, for the purpose of receiving public comment from\naffected property owners within the proposed NID, on the\nproposed NIDP, shall be held by the municipality before the\nestablishment of an NID. Notice of the hearing shall be\nadvertised at least ten days prior thereto in a newspaper of\ngeneral circulation in the municipality.\n(3) Any objections by property owners within the\nproposed NID must be made in writing, by persons representing\nthe ownership of 51%, in numbers, of the benefited properties\nwithin the NID, or by property owners within the proposed NID\nwhose property valuation, as assessed for taxable purposes,\nshall amount to 51% of the total property valuation within\nthe NID. Objections must be signed by the property owner and\nfiled in the office of the clerk for the governing body of\n19980H2858B4194\n- 12 -\n\nthe municipality in which the NID is proposed.\n(c) Contents of preliminary plan.--The plan shall include\nthe following:\n(1) A map indicating the boundaries by street of the\nproposed NID.\n(2) A written report from the municipality containing:\n(i) The name of the proposed district.\n(ii) A detailed description of the service areas of\nthe proposed district.\n(iii) A list of all properties to be assessed.\n(iv) A list of proposed improvements within the NID,\nand their estimated cost.\n(v) A proposed budget for the first fiscal year,\nincluding, but not limited to, the following: personnel\nand administration, programs and services, maintenance\nand operation, and capital expenditures.\n(vi) The proposed revenue sources for financing all\nproposed improvements, programs and services.\n(vii) The estimated time for implementation and\ncompletion of all proposed improvements, programs and\nservices.\n(viii) A statement identifying the administrative\nbody which will govern and administer the NID.\n(ix) Any other information, including the statutory\nauthority, or, in the case of a nonprofit corporation,\nthe bylaws, which describe the powers and duties of and\nthe method for making decisions by the NIDMA.\n(x) The method of determining the amount of the\nassessment fee to be levied on property owners within the\nNID under section 7.\n19980H2858B4194\n- 13 -\n\n(3) In addition, the plan shall also:\n(i) Identify in detail the specific duties and\nresponsibilities of both the NIDMA and the municipal\ncorporation with respect to the NID.\n(ii) Require that a written agreement be signed by\nthe municipal corporation and the NIDMA describing in\ndetail their respective duties and responsibilities.\n(iii) Allow for and encourage tax-exempt property\nowners located within the NID to provide in-kind services\nor a financial contribution to the NIDMA, if not\nassessed, in lieu of a property assessment fee.\n(iv) Require in the agreement between the municipal\ncorporation and the NIDMA that the municipality must\nmaintain the same level of municipal programs and\nservices provided within the NID before NID designation\nas after NID designation.\n(v) Allow the municipal corporation the right to\ninclude in the agreement with the NIDMA and in the\nenabling ordinance establishing the NID a sunset\nprovision of no less than five years for renewal of the\nagreement.\n(vi) Require in the agreement with the NIDMA that\nthe municipality establishing an NID shall be responsible\nfor the collection of all property assessment fees levied\nwithin the NID, if so desired by the NIDMA.\n(vii) Provide that a negative vote of at least 51%\nof the property owners within the NID, or property owners\nwithin the NID whose property valuation as assessed for\ntaxable purposes amounts to 51% of the total property\nvaluation located within the NID proposed in the final\n19980H2858B4194\n- 14 -\n\nplan, shall be required to defeat the establishment of\nthe proposed NID by filing objections with the clerk for\nthe governing body of the municipality within 45 days of\npresentation of the final plan, where the governing body\nof municipality is inclined to establish the NID.\n(d) Final plan.--Prior to the establishment of an NID, the\nmunicipality shall submit a revised final plan to property\nowners located within the proposed NID, which incorporates\nchanges made to the plan, based on comments from affected\nproperty owners within the NID, provided at the public hearings\nor at some other time. Changes to the final plan, which differ\nfrom the preliminary plan, shall also be so indicated in an\neasily discernible method for the reader, including, but not\nlimited to, changes being in boldfaced or italicized type.\n(e) Public hearing.--At least one public hearing for the\npurpose of receiving public comment on any revisions to the\npreliminary plan made following suggestions by affected property\nowners within the proposed NID and reflected in the final NIDP\nshall be held by the municipal corporation before enacting an\nordinance establishing an NID. Notice of the hearing shall be\nadvertised at least ten days prior thereto in a newspaper of\ngeneral circulation in the municipality.\n(f) Veto of final plan for NID.-\n(1) Following the last public hearing required under\nsubsection (e) or under subsection (g), if an amendment to\nthe final plan, affected property owners located within a\nproposed NID shall have 45 days from the date of the hearing\nto object to and disapprove the final plan or any amendment\nto the final plan under the requirements of subsection\n(b)(3).\n19980H2858B4194\n- 15 -\n\n(2) If 51% or more of the affected property owners or\nproperty owners whose property valuation as assessed for\ntaxable purposes amounts to 51% of the total property\nvaluation within the proposed NID fail to register their\ndisapproval of the final plan or amendment to the final plan\nin writing with the clerk of the governing body of the\nmunicipality in which the NID is proposed, the governing body\nof the municipality may, following the 45-day period, enact a\nmunicipal ordinance establishing an NID under this act, or in\nthe case of an amendment to the final plan, adopt any\namendments to the ordinance.\n(g) Amendments to final plan.-\n(1) The final plan may be amended by the NIDMA any time\nafter the establishment of an NID, pursuant to the provisions\nof this act, upon the recommendation of the NIDMA board,\nprovided there is concurrence with the owners of at least 51%\nof the assessed valuation of all property within the NID or\n51% of the property owners within the NID.\n(2) Amendments to the final plan which also require the\napproval of the governing body of the municipality\nestablishing the NID, include:\n(i) Substantially changed or added programs,\nimprovements and/or services to be provided in the NID.\n(ii) Increased expenditures affecting more than 25%\nof the total NIDMA budget for the fiscal year.\n(iii) Incurring increased indebtedness.\n(iv) Changing the assessment fee structure levied on\nproperty owners in the NID.\n(v) Changing the legal entity (NIDMA) which provides\nprograms, improvements and services within the NID.\n19980H2858B4194\n- 16 -\n\n(vi) Changing the NID service area boundary.\nPrior to the governing body of the municipality approving any\nof the changes in this paragraph, the governing body shall\nhold at least one public hearing to determine that such\nchanges are in the public interest as it relates to affected\nproperty owners within the NID.\n(3) The municipality shall provide public notice of the\nhearing for any amendments, by publication of a notice, in at\nleast one newspaper having a general circulation in the NID,\nspecifying the time and the place of such hearing and the\namendments to be considered. This notice shall be published\nonce at least 10 days prior to the date of the hearing.\n(4) The governing body of the municipality may, within\n30 days following the public hearing and at its sole\ndiscretion, approve or disapprove of any amendments to the\nplan. If approved, such amendments shall be effective upon\nthe date of such approval.\n(5) Prior to the adoption of any amendment to the NID\nboundary which increases the size of the NID, any owner of\nproperty to be added to the NID shall be notified of the\ndate, time and location of the public hearing on the proposed\namendment to the final plan, and provided all information\nrequired by subsection (c).\nSection 6. Creation of neighborhood improvement district\nmanagement association.\n(a) Association designated.--When a municipality establishes\nan NID under this act, a neighborhood improvement district\nmanagement association shall be designated by the governing body\nof the municipality in which the NID is to be located to\nadminister programs, improvements and services within the NID.\n19980H2858B4194\n- 17 -\n\n(b) Administration.-\n(1) NIDs created pursuant to this act shall be\nadministered by an NIDMA which shall be an authority created\npursuant to the act of May 2, 1945 (P.L.382, No.164), known\nas the Municipality Authorities Act of 1945, an existing\nnonprofit development corporation, an existing nonprofit\ncorporation or a nonprofit development corporation or\nnonprofit corporation established by the governing body or\nauthorized to be established by the governing body of the\nmunicipality in which the NID is to be located, to administer\nthe NIDP.\n(2) If an active nonprofit development corporation\nalready exists within the geographic boundaries of the NID\nand formally indicates its interest to the governing body of\nthe municipality to become the designated NIDMA, the\ngoverning body of the municipality shall grant that request\nunless 51% or more of the affected property owners or\nproperty owners whose property valuation as assessed for\ntaxable purposes amounts to 51% of the total property\nvaluation within the proposed NID register their disapproval\nof this designation in writing with the clerk of the\ngoverning body within a 45-day period following the formal\nwritten request for designation by the nonprofit development\ncorporation to become the NIDMA.\n(c) Powers.--An NIDMA created under this act shall assume\nall powers provided for in section 7 immediately upon the\neffective date of the municipal ordinance enacted under section\n4 creating an NID.\n(d) Board.--Every NIDMA shall have an administrative board.\n(1) Where an authority created pursuant to the\n19980H2858B4194\n- 18 -\n\nMunicipality Authorities Act of 1945 serves as the NIDMA, the\nboard shall be appointed pursuant to the Municipality\nAuthorities Act of 1945.\n(2) Where an existing nonprofit development corporation\nor other nonprofit corporation is to serve as the NIDMA, the\nboard shall be appointed according to the bylaws of the NIDMA\nfiled with the Department of State.\n(3) Where a nonprofit development corporation or other\nnonprofit corporation is established to serve as the NIDMA\nfor an NID, the board shall be comprised of an odd number of\nmembers, between five and nine, with at least one member\nrepresenting the municipal corporation in which the NID is\nlocated.\n(4) In all cases, NIDMA boards shall include a\nrepresentative of property owners located in the NID,\nbusiness owners located in the NID and any institutions\nlocated in the NID. Institutional members may appoint a\ndesignee to represent them. All board members need not be\nresidents of the NID.\nSection 7. Powers of neighborhood improvement district\nmanagement association.\n(a) General powers.--A NIDMA shall have, in addition to any\nother powers provided pursuant to the act of May 2, 1945\n(P.L.382, No.164), known as the Municipality Authorities Act of\n1945, where the NIDMA is an authority, or in addition to any\nother powers provided pursuant to the charter establishing a\nnonprofit development corporation or other nonprofit\ncorporation, where the NIDMA is a nonprofit development\ncorporation or other nonprofit corporation, the power to:\n(1) Sue or be sued, implead or be impleaded, complain\n19980H2858B4194\n- 19 -\n\nand defend in all courts.\n(2) Employ an executive director or administrator and\nany necessary supporting staff or contract for the provision\nof same.\n(3) Prepare planning or feasibility studies or contract\nfor the preparation of same, to determine needed capital\nimprovements or administrative programs and services within\nthe NID.\n(4) Make capital improvements or provide administrative\nprograms and services within an NID.\n(5) Purchase, own, construct, renovate, develop,\noperate, rehabilitate, manage, sell and/or dispose of real\nproperty.\n(6) Contract with existing businesses within the NID.\n(7) Contract for the provision of products or services\nby the NIDMA to clients located inside and outside of the\nNID, including billing and collection of assessment fees by\nanother NIDMA.\n(8) Appropriate and expend NID funds which would include\nany Federal, State or municipal funds received by the NIDMA.\nThe funds shall be expended in accordance with any specific\nprovisions contained in the municipal enabling ordinance\nestablishing the NID and may be used:\n(i) To acquire by purchase or lease real or personal\nproperty to effectuate the purposes of this act,\nincluding making common improvements within the NID,\nincluding, but not limited to, sidewalks, retaining\nwalls, street paving, parks, recreational equipment and\nfacilities, open space, street lighting, parking lots,\nparking garages, trees and shrubbery, pedestrian walks,\n19980H2858B4194\n- 20 -\n\nsewers, water lines, rest areas and the acquisition,\nrehabilitation or demolition of blighted buildings or\ncomparable structures.\n(ii) To provide free or reduced-fee parking for\ncustomers of businesses within the NID; transportation-\nrelated expenditures, public relations programs, group\nadvertising and NID maintenance and security services.\n(iii) To impose special assessment fees.\n(9) Solicit in-kind services or financial contributions\nfrom tax-exempt property owners within the NID in lieu of\nproperty assessment fees. This may include entering into\nvoluntary multiyear agreements (VMAs) between the NIDMA and\ntax-exempt property owners located within an NID, for the\nprovision of same.\n(10) Impose liens on property for the nonpayment of\nproperty assessments. NIDs administered by nonprofit\ncorporations would have any such liens filed by the municipal\ncorporation.\n(11) Hire additional off-duty police officers or private\nsecurity officers, whose patrol area responsibilities would\nbe limited to the geographical area incorporated within the\ndesignated NID service area and whose responsibility would be\nto support existing municipal and volunteer efforts aimed at\nreducing crime and improving security in the NID.\n(12) Designate a district advisory committee, referred\nto as the DAC, for each NID established within the\nmunicipality. Each DAC shall consist of an odd number of\nmembers, between five and nine, who shall be representative\nof the neighborhood's character, including, but not limited\nto, age, sex and cultural diversity.\n19980H2858B4194\n- 21 -\n\n(b) Assessments.-\n(1) The NIDMA shall, upon approval by the governing body\nof the municipality, have the power to assess property owners\nwithin the NID a special property assessment fee. Revenues\nfrom the fee shall be accounted for and used by the NIDMA to\nmake improvements and provide programs and services within\nthe NID as authorized by this act. Where the district\nestablished is a BID, the NIDMA shall have the authority to\nexempt residential property owners from any special\nassessment fees levied.\n(2) All assessments authorized under this section shall\nbe calculated using January 1 as the first day of the fiscal\nyear.\n(3) All special property assessment fees shall be based\nupon the estimated cost of the programs, improvements or\nservices to be provided in such NID as stated in the final\nplan under section 5(d). In no case shall the aggregate\namount of all fees levied by the NIDMA during the year exceed\nthe estimated cost of proposed programs, improvements and\nservices for the year.\n(4) In the case of an NID which contains a combination\nof business, residential, industrial and/or institutional\nareas and uses, a weighted assessment may be instituted. In\nsuch case, the fee levied on property owners generally may be\nweighted higher for business, industrial or institutional\nproperties than that levied on residential property owners,\nprovided the basis for the calculation of the fee meets the\nrational nexus test.\n(5) The total costs of improvements, programs and\nadministrative services provided by the NIDMA shall be\n19980H2858B4194\n- 22 -\n\nassessed to all designated properties within the NID by one\nof the following methods:\n(i) An assessment determined by multiplying the\ntotal service and improvement costs by the ratio of the\nassessed value of the benefited property to the total\nassessed valuation of all designated benefited properties\nin the NID.\n(ii) An assessment upon the several properties in\nthe NID in proportion to benefits as ascertained by\nviewers appointed in accordance with law.\n(iii) Any method that equitably apportions costs\namong benefiting properties.\n(iv) In the case of improvements benefiting\nproperties abutting the NID by the front-foot method,\nwith equitable adjustments for corner properties and\nother cases provided for in the municipal ordinance. Any\nproperty which cannot be equitably assessed by the front-\nfoot method may be assessed by any of the above methods.\n(c) Payment.--The governing body may by ordinance authorize\nthe payment of the assessment in equal annual or more frequent\ninstallments, over such time and bearing interest at the rate\nspecified in the municipal ordinance. If bonds have been issued\nand sold, or notes or guarantees have been given or issued, to\nprovide for the cost of the services and improvements, the\nassessment in equal installments shall not be payable beyond the\nterm for which the bonds, notes or guarantees are payable.\n(d) Liens.-\n(1) Notwithstanding the filing of the claims, all\nassessments which are made payable in installments shall\nconstitute liens and encumbrances upon the respective\n19980H2858B4194\n- 23 -\n\nbenefited properties at the beginning of each calendar year,\nexcept as provided in subsection (c), and only in an amount\nequal to the sum of:\n(i) the annual or other installments becoming\npayable in such year, with interest and penalties, if\nany, thereon; and\n(ii) the total of all installments, with interest\nand penalties thereon, which became due during prior\nyears and which remain due and unpaid at the beginning of\nthe current year.\n(2) In the case of default in the payment of any\ninstallment and interest for a period of 90 days after the\npayment becomes due, the assessment ordinance may provide\neither for the entire assessment, with accrued interest and\npenalties to become due and become a lien from the due date\nof the installment, or may provide solely for the enforcement\nof the claim as to the overdue installment, with interest and\npenalties, in which case the ordinance shall further provide\nthat, if any installment or portion thereof remains due and\nunpaid for one year after it has become due and payable, then\nthe entire assessment with accrued interest and penalties\nshall become due and become a lien from the due date of the\ninstallment.\n(3) No action taken to enforce a claim for any\ninstallment or installments shall affect the status of any\nsubsequent installment of the same assessment, each of which\nshall continue to become a lien upon the property annually\npursuant to paragraph (1).\n(4) The ordinance may contain any other provision\nrelating to installment assessments which is not inconsistent\n19980H2858B4194\n- 24 -\n\nwith applicable law.\n(5) Any owner of property against whom an assessment has\nbeen made may pay the assessment in full at any time, with\naccrued interest and costs thereon, and such a payment shall\ndischarge the lien of the assessment, or installments then\nconstituting a lien, and shall also release the claim to any\nlater installments.\n(6) Claims to secure the assessments shall be entered in\nthe prothonotary's office of the county at the same time, and\nin the same form, and collected in the same manner, as\nmunicipal tax claims are filed and collected, notwithstanding\nthe provisions of this section as to installment payments.\nSection 8. Dissolution of neighborhood improvement district\nmanagement association and neighborhood\nimprovement district.\n(a) Conveying projects.--When any NIDMA shall have finally\npaid and discharged all bonds which, together with the interest\ndue thereon, shall have been secured by a pledge of any of the\nrevenues or receipts of a project, it may, subject to any\nagreements concerning the operation or disposition of such\nproject and the NIDMA bylaws, convey such project or projects to\nthe municipal corporation which established or had established\nthe NIDMA.\n(b) Request for termination.--Any request for the\ntermination of the NID and NIDMA approved by 51% of the assessed\nproperty owners, in numbers, located in the NID, shall be\nsubmitted to the governing body of the municipality in writing.\nThe governing body shall hold a hearing on the merits of same,\npursuant to section 5(b)(2) as it relates to the required\nprocedure of holding a hearing. Such written request shall be\n19980H2858B4194\n- 25 -\n\nconsidered by the governing body of the municipality. If the\nrequest is approved by the governing body of the municipality,\nthen a resolution to that effect shall be filed with the\nSecretary of the Commonwealth, and the secretary shall note the\ntermination of the existence on the record of incorporation and\nreturn the resolution with his or her approval shown on the\nresolution to the municipal corporation. Then, the property of\nthe NIDMA shall pass to the municipal corporation, as the case\nmay be, and the NIDMA and NID shall cease to exist. Any request\nfor the termination of the NID and NIDMA by the governing body\nof the municipality in which the NID is located shall result in\na hearing on the merits of same, pursuant to section 5(b)(2) as\nit relates to the required procedure for holding a hearing.\nBefore the decision to terminate an NID and NIDMA is made, such\ntermination must be approved by 51% of the assessed property\nowners, in numbers, located in the NID, and shall be submitted\nto the governing body of the municipality in writing. Such\nwritten request shall be considered by the governing body of the\nmunicipality. If the request is approved by the governing body\nof the municipality, then a resolution to that effect shall be\nfiled with the Secretary of the Commonwealth, and the secretary\nshall note the termination of the existence on the record of\nincorporation and return the resolution with his or her approval\nshown to the municipal corporation. The property of the NIDMA\nshall pass to the municipal corporation, as the case may be, and\nthe NIDMA and NID shall cease to exist.\nSection 9. Annual audit; report.\nThe NIDMA shall annually:\n(1) submit an audit of all income and expenditures to\nthe Department of Community and Economic Development and the\n19980H2858B4194\n- 26 -\n\ngoverning body of the municipality in which the NID is\nlocated within 120 days after the end of each fiscal year;\nand\n(2) submit a report, including financial and\nprogrammatic information, including a summary of audit\nfindings, to the governing body of the municipality in which\nthe NID is located and to all assessed property owners\nlocated in the NID.\nSECTION 10. TOURISM AND MARKETING TAX.\n<\nIN ADDITION TO THE HOTEL ROOM RENTAL TAX IMPOSED UNDER\nSECTION 23 OF THE ACT OF JUNE 27, 1986 (P.L.267, NO.70), KNOWN\nAS THE PENNSYLVANIA CONVENTION CENTER AUTHORITY ACT, AND UNDER\nSECTION 202 OF THE ACT OF MARCH 4, 1971 (P.L.6, NO.2), KNOWN AS\nTHE TAX REFORM CODE OF 1971, THE COUNCIL OF THE CITY IN WHICH A\nCONVENTION CENTER IS LOCATED IS HEREBY AUTHORIZED TO IMPOSE AN\nEXCISE TAX ON THE CONSIDERATION RECEIVED BY EACH OPERATOR OF A\nHOTEL WITHIN THE CITY FROM EACH TRANSACTION OF RENTING A ROOM OR\nROOMS TO ACCOMMODATE TRANSIENTS. THE TAX SHALL BE COLLECTED BY\nTHE OPERATOR FROM THE PATRON OF THE ROOM AND PAID OVER TO THE\nCITY PURSUANT TO SECTION 11, AND SHALL BE KNOWN AS THE TOURISM\nAND MARKETING TAX. THE RATE OF TAX IMPOSED UNDER THIS SECTION BY\nTHE COUNCIL OF THE CITY IN WHICH THE CONVENTION CENTER IS\nLOCATED SHALL NOT EXCEED 1%.\nSECTION 11. SPECIAL TOURISM AND MARKETING TAX FUND.\nTHERE SHALL BE DEPOSITED ANNUALLY IN A SPECIAL FUND,\nESTABLISHED PURSUANT TO SECTION 23(E) OF THE ACT OF JUNE 27,\n1986 (P.L.267, NO.70), KNOWN AS THE PENNSYLVANIA CONVENTION\nCENTER AUTHORITY ACT, FOR THE USE OF THE REGIONAL ATTRACTIONS\nMARKETING AGENCY, ALL REVENUES RECEIVED FROM THE TAX IMPOSED\nUNDER SECTION 10. ALL EXPENDITURES FROM THE SPECIAL FUND\n19980H2858B4194\n- 27 -\n\nESTABLISHED UNDER SECTION 23(E) OF THE PENNSYLVANIA CONVENTION\nCENTER AUTHORITY ACT SHALL BE USED BY THE REGIONAL ATTRACTIONS\nMARKETING AGENCY FOR DIRECT ADVERTISING EFFORTS DIRECTED TOWARDS\nADVERTISING AND PUBLICIZING TOURIST ATTRACTIONS IN THE AREA\nSERVED BY THE AGENCY; PROMOTING AND ATTRACTING TOURISM TO\nFACILITIES IN THE AREA SERVED BY THE AGENCY; AND PROMOTING AND\nOTHERWISE ENCOURAGING THE USE OF THE FACILITIES IN THE AREA\nSERVED BY THE AGENCY BY THE PUBLIC AS A WHOLE.\nSection 10 12. Applicability.\n<\n(a) Existing commercial business improvement districts.--The\nprovisions of this act shall not apply to a business improvement\ndistrict established pursuant to the act of May 2, 1945\n(P.L.382, No.164), known as the Municipality Authorities Act of\n1945, in existence in whole or in part in a city of the first\nclass prior to the effective date of this act.\n(b) Existing districts.--Except as provided for in\nsubsection (e), any existing business improvement district or\ndowntown improvement district established prior to the effective\ndate of this act shall remain in existence and shall be governed\nby the Municipality Authorities Act of 1945, insofar as it\nrelates to business improvement districts or 53 Pa.C.S. Ch. 54\n(relating to business improvement districts).\n(c) Districts created subsequently.--Any NID established\nsubsequent to the effective date of this act shall be governed\nby the provisions of this act.\n(d) Previously terminated districts.--Any business\nimprovement district or downtown improvement district in\nexistence prior to the effective date of this act which is\nterminated shall, upon its reestablishment, be governed by the\nprovisions of this act. This shall include any termination\n19980H2858B4194\n- 28 -\n\nresulting from a sunset provision in any municipal agreement or\nordinance.\n(e) Additional requirements.--Any business improvement\ndistrict or downtown improvement district in existence on the\neffective date of this act shall:\n(1) be required to carry out any duty or responsibility\nimposed on NIDs under this act; and\n(2) possess any additional power given to NIDs under\nthis act without having to restructure or reorganize under\nthis act.\nSection 11 13. Effective date.\n<\nThis act shall take effect in 60 days.\nI22L53JLW/19980H2858B4194\n- 29 -"
    },
    {
      "category": "Resource",
      "title": "panid21999.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-422-downtown-management-organizations-fall-2006/e7161156437c203d1ebc3327ff702720_panid21999.pdf",
      "content": "SENATE AMENDED\nPRIOR PRINTER'S NOS. 1290, 2558\nPRINTER'S NO. 3337\nTHE GENERAL ASSEMBLY OF PENNSYLVANIA\nHOUSE BILL\nSession of\nNo. 1142 1999\nINTRODUCED BY REINARD, PETRONE, J. TAYLOR, MARSICO, PIPPY, LEH,\nSTURLA, YOUNGBLOOD, CORRIGAN, RAMOS, ROSS, ARGALL,\nL. I. COHEN, COSTA, BUNT, WRIGHT, FICHTER, READSHAW, FREEMAN,\nMcILHINNEY, MANDERINO, THOMAS, STEELMAN, E. Z. TAYLOR,\nWILLIAMS, BROWNE AND WASHINGTON, MARCH 29, 1999\nSENATOR PUNT, COMMUNITY AND ECONOMIC DEVELOPMENT, AS AMENDED,\nAPRIL 11, 2000\nAN ACT\n1 Establishing Neighborhood Improvement Districts; conferring\npowers and duties on municipal corporations and neighborhood\nimprovement districts; providing for annual audits; and\nmaking repeals.\nTABLE OF CONTENTS\n6 Section 1. Short title.\n7 Section 2. Legislative findings.\n8 Section 3. Definitions.\n9 Section 4. Powers of municipal corporation.\n10 Section 5. Creation of neighborhood improvement district.\n11 Section 6. Creation of neighborhood improvement district\nmanagement association.\n13 Section 7. Powers of neighborhood improvement district\nmanagement association.\n15 Section 8. Dissolution of neighborhood improvement district\nmanagement association and neighborhood\n\nimprovement district.\nSection 9. Annual audit; report.\nSection 10. Applicability.\nSection 11. Effective date.\nThe General Assembly of the Commonwealth of Pennsylvania\nhereby enacts as follows:\nSection 1. Short title.\nThis act shall be known and may be cited as the Neighborhood\nImprovement District Act.\nSection 2. Legislative findings.\nThe General Assembly finds that:\n(1) Existing tax rates in many municipalities are at or\nnear their statutory cap.\n(2) The General Fund revenue derived from these taxes\nmany times is not sufficient to provide adequate municipal\nservices or additional services needed in specific geographic\nareas within the municipality, including, but not limited to,\ndowntown commercial districts.\n(3) As a result, municipalities should be encouraged to\ncreate, where feasible and desired, assessment-based\nneighborhood improvement districts which would include, but\nnot be limited to, downtown commercial districts. Designated\ndistrict management associations would initiate and\nadminister programs to promote and enhance more attractive\nand safer commercial, industrial, residential and mixed-use\nneighborhoods; economic growth; increased employment\nopportunities; and improved commercial, industrial, business\ndistricts and business climates.\n(4) Municipalities should be given the broadest possible\ndiscretion in establishing by local ordinance the type of\n19990H1142B3337\n- 2 -\n\nassessment-based programs most consistent with neighborhood\nneeds, goals and objectives, as determined and expressed by\nproperty owners in the designated district.\nSection 3. Definitions.\nThe following words and phrases when used in this act shall\nhave the meanings given to them in this section unless the\ncontext clearly indicates otherwise:\n\"Authority.\" A body politic and corporate, created pursuant\nto the act of May 2, 1945 (P.L.382, No.164), known as the\nMunicipality Authorities Act of 1945.\n\"Benefited property.\" Those properties located within a\nneighborhood improvement district which profit from district\nimprovements based on a rational nexus test. Properties need not\nprofit equally to be considered to have benefited.\n\"Bonds.\" The term shall include the notes, bonds and other\nevidence of indebtedness or obligations which each municipal\ncorporation is authorized to issue under section 4(5).\n\"Business improvement.\" In the case of neighborhood\nimprovement district management associations created for the\npurpose of making improvements or providing administrative\nservices within a neighborhood improvement district, the term\nshall mean those improvements needed in specific areas or to\nindividual properties, including, but not limited to, sidewalks,\nretaining walls, street paving, parks, recreational equipment\nand facilities, open space, street lighting, parking lots,\nparking garages, trees and shrubbery, pedestrian walks, sewers,\nwater lines, rest areas and the acquisition and rehabilitation\nor demolition of blighted buildings or structures.\n\"Business improvement district.\" A business improvement\ndistrict (BID) created prior to the effective date of this act\n19990H1142B3337\n- 3 -\n\ngoverned by the act of May 2, 1945 (P.L.382, No.164), known as\nthe Municipality Authorities Act of 1945, insofar as it relates\nto business improvement districts or 53 Pa.C.S. Ch. 54 (relating\nto business improvement districts). On or after the effective\ndate of this act, the term shall mean a limited, geographical\narea comprised of real property which is used for any for-profit\nactivity involving trade and traffic, or commerce in general.\n\"Commercial.\" Relating to or associated with any for-profit\nactivity involving trade and traffic, or commerce in general.\n\"Construction expenditures.\" Property and right-of-way\nacquisition costs where applicable.\n\"Costs of improvements.\" The term includes architectural\nfees, engineering fees, attorney fees, consulting fees,\nprofessional fees, preliminary planning expenditures,\nfeasibility study expenditures, financing costs and any other\nexpenditures necessary and incidental to the development,\nconstruction or completion of the improvement.\n\"District Advisory Council.\" A committee comprised of\nproperty owners from a neighborhood improvement district\nestablished under section 7(a), for the purpose of providing\nguidance and direction to the neighborhood improvement district\nmanagement association concerning association activities within\nthe district.\n\"Industrial district.\" A limited, geographical area\ncomprised of real property which is used predominantly for\nmanufacturing, commercial or any other activity related to the\ndistribution of goods and services and intermediate and final\nproducts, including, but not limited to, warehousing, shipping,\ntransportation, remanufacturing, stockpiling of raw materials,\nrepair and maintenance of machinery and equipment, storage,\n19990H1142B3337\n- 4 -\n\nadministration or business activities, and research and\ndevelopment.\n\"Institution.\" The term includes, but is not limited to,\ncolleges, universities, schools, hospitals, museums, theaters,\nchurches, synagogues, art centers or similar facilities.\n\"Institutional district.\" A limited, geographical area\ncomprised predominantly of real property on which educational,\nhealth-related or cultural activities occur within buildings and\nstructures, including, but not limited to, colleges,\nuniversities, schools, hospitals, museums, theaters, churches,\nsynagogues and art centers.\n\"Mixed-use district.\" A limited, geographical area comprised\nof real property used for any or all purposes contained within a\nbusiness, residential, industrial or institutional district.\n\"Municipal corporation.\" The body or board authorized by law\nto enact ordinances or adopt resolutions for the particular\nmunicipality.\n\"Municipality.\" With the exception of cities of the first\nclass, any city, borough, incorporated town, township, home\nrule, optional plan or optional charter municipality, located\nwithin this Commonwealth.\n\"Neighborhood.\" A limited geographic area within a\nmunicipality establishing a neighborhood improvement district,\nthe limits of which form the neighborhood improvement district\nboundary.\n\"Neighborhood improvement.\" Improvements needed in specific\ngeographic areas or to individual properties within those areas,\nincluding, but not limited to, sidewalks, retaining walls,\nstreet paving, parks, recreational equipment and facilities,\nopen space, street lighting, parking lots, trees and shrubbery,\n19990H1142B3337\n- 5 -\n\nsewers, water lines, rest areas and the acquisition and\nrehabilitation or demolition of deteriorated buildings or\nstructures.\n\"Neighborhood improvement district.\" A limited geographic\narea within a municipality, in which a special assessment is\nlevied on all designated property, other than tax-exempt\nproperty, for the purpose of promoting the economic and general\nwelfare of the district and the municipality, hereinafter\nreferred to as NID. Such districts shall be referred to\ngenerally as neighborhood improvement district (NID) and\nspecifically as: business improvement district (BID);\nresidential improvement district (RID); industrial improvement\ndistrict (IID); institutional improvement district (INID); or\nmixed-use improvement district (MID) depending on the type\ndistrict established. A designated property may not be included\nin more than one neighborhood improvement district.\n\"Neighborhood improvement district management association.\"\nThe governing body which oversees the management of neighborhood\nimprovement districts in a municipality as established under\nsection 5 which hereinafter shall be referred to as the NIDMA.\nSuch body shall be incorporated as a nonprofit corporation in\nthis Commonwealth or an authority as established pursuant to the\nact of May 2, 1945 (P.L.382, No.164), known as the Municipality\nAuthorities Act of 1945.\n\"Neighborhood improvement district plan.\" The strategic plan\nfor neighborhood improvements required by section 5, hereinafter\nreferred to as NIDP, and all projects, programs and supplemental\nservices to be provided within the district to implement the\nplan by the neighborhood improvement district management\nassociation.\n19990H1142B3337\n- 6 -\n\n\"Neighborhood improvement district services.\" In the case of\nneighborhood improvement district management associations\ncreated for the purpose of making improvements or providing\nexpanded services within any neighborhood business improvement\ndistricts established, the term shall include, but not be\nlimited to, those services which improve the ability of the\ncommercial establishments within the district to serve the\nconsumer, such as free or reduced-fee parking for customers,\ntransportation-related expenses, public relations programs,\ngroup advertising, and district maintenance and security\nservices. For services provided within any residential,\nindustrial, institutional, or mixed-use neighborhood improvement\ndistrict, the term shall include, but not be limited to, those\nservices which improve the ability of property owners to enjoy a\nsafer and more attractive neighborhood through the provision of\nincreased or expanded services, including street lighting,\nstreet cleaning, street maintenance, parks, recreational\nequipment and facilities, open space and/or security services.\n\"Nonprofit corporation.\" A legal entity that is incorporated\nwithin this Commonwealth and specifies in its charter or bylaws\nthat no part of the net earnings may benefit any private\nshareholder or individual holding interest in such entity.\n\"Private security officer.\" Any person or firm employed by\nthe neighborhood improvement district management association for\nthe purpose of providing increased security or protective patrol\nservices within the neighborhood improvement district. The term\nmay include off-duty police officers provided that the use of\nsuch officers for this purpose is approved by the governing body\nof the municipality in which the neighborhood improvement\ndistrict is located or the municipality where the officer is\n19990H1142B3337\n- 7 -\n\nemployed if different.\n\"Project.\" The acquisition, development, construction,\nimprovement, rehabilitation, operation and/or maintenance of any\nbuilding, facility, equipment or structure, by purchase, lease\nor contract, by a neighborhood improvement district management\nassociation to facilitate neighborhood and business improvements\nas authorized by this act.\n\"Rational nexus.\" The legal principle which requires that\nthere is a rational, definable benefit which accrues to any\nproperty owner assessed a fee for said benefit in a neighborhood\nimprovement district created under this act. All property owners\nwithin a designated neighborhood improvement district paying a\nspecial assessment fee must benefit directly or indirectly from\nfacilities or services provided by a neighborhood improvement\ndistrict management association within the neighborhood\nimprovement district, provided, however, that property owners\nneed not benefit equally.\n\"Residential district.\" A limited, geographical area\ncomprised of real property consisting predominantly of buildings\nand structures for housing individuals and families, including,\nbut not limited to, single family detached homes, single family\nsemi-detached homes, townhouses, condominiums, apartments,\nmanufactured homes, modular homes or any combination of same.\n\"Service area.\" The area within the boundaries of the\nneighborhood improvement district established by a municipality\nunder this act, in which the neighborhood improvement district\nmanagement association provides programs, services and\nimprovements. The term may also include an area outside of the\nneighborhood improvement district where services are being\nprovided by the neighborhood improvement district management\n19990H1142B3337\n- 8 -\n\nassociation under contract.\n\"Special assessment fee.\" The fee assessed on property\nowners within a neighborhood improvement district, levied by the\nmunicipality establishing a neighborhood improvement district,\nunder section 4(8), for the purposes of providing programs,\nimprovements and services, under section 7.\n\"Sunset provision.\" The term means a provision in the\nneighborhood improvement district plan, under section 5(c),\nestablishing a neighborhood improvement district, which provides\nfor the automatic termination of the neighborhood improvement\ndistrict on a date specified in the neighborhood improvement\ndistrict plan and in the municipal ordinance establishing the\nneighborhood improvement district. The neighborhood improvement\ndistrict may be continued beyond that date, provided the\nmunicipal enabling ordinance creating the original neighborhood\nimprovement district is reenacted, following a review of the\nneighborhood improvement district and the neighborhood\nimprovement district management association programs and\nservices provided within the neighborhood improvement district,\nby the municipality.\nSection 4. Powers of municipal corporation.\nEvery municipal corporation shall have the power:\n(1) To establish within the municipality an area or\nareas designated as an NID.\n(2) To establish an authority to administer the NID or\nto designate an existing community development corporation or\nother existing nonprofit corporation to administer same or to\ncreate a community development corporation or other nonprofit\ncorporation to administer same, under sections 6 and 7.\n(3) To appropriate and expend, in accordance with the\n19990H1142B3337\n- 9 -\n\nspecific provisions of the municipal enabling ordinance,\nmunicipal funds as may be required to:\n(i) Acquire by purchase or lease real or personal\nproperty deemed necessary to effectuate the purposes of\nthe NID.\n(ii) Prepare or have prepared preliminary planning\nor feasibility studies to determine needed improvements\nin an NID, including, but not limited to, capital\nimprovements, traditional streetscape and building\nrenovations, retaining walls, street paving, street\nlighting, parking lots, parking garages, trees and\nshrubbery, pedestrian walks, sewers, water lines, rest\nareas, acquisition, rehabilitation or demolition of\nblighted buildings and structures, graffiti removal,\nsecurity, marketing, promotions, advertising, business\nretention and recruitment activities, master leasing and\nproperty management, joint advertising, research and\nplanning, as well as the provision of additional services\nto supplement, not replace, existing municipal services\nprovided within the NID.\n(4) To advance funds to a NIDMA as may be required to\ncarry out the purposes of this act.\n(5) To collect special property assessments on behalf of\nthe NIDMA levied on designated property owners within the\nNID, and to employ any legal methods to insure collection of\nthe assessments.\n(6) To acquire by gift, purchase or eminent domain,\nland, real property, or rights-of way, which may be needed\nfor the purposes of making physical improvements within the\nNID.\n19990H1142B3337\n- 10 -\n\n(7) To issue bonds, notes or guarantees, in accordance\nwith the provisions of general laws in the amounts and for\nthe periods necessary, to finance needed improvements within\nany NID.\n(8) To review all proposed expenditures of funds within\nNIDs by NIDMAs and suggest changes to same where a nonprofit\ncorporation is the NIDMA.\n(9) To include a sunset provision of no less than five\nyears in the municipal enabling ordinance creating the NID\nand in the contract with the NIDMA.\n(10) To levy an assessment fee on property owners\nlocated within an NID needed to finance additional\nsupplemental programs, services and improvements to be\nprovided or made by the NIDMA.\nSection 5. Creation of neighborhood improvement district.\n(a) Establishment.-\n(1) The governing body of the municipality, or any\nmunicipal businesses, or residents, or combination thereof,\nmay initiate action to establish an NID or NIDs within the\nmunicipality, under this act.\n(2) In the case of businesses, or residents, or both\ndesiring to establish an NID, where the municipality has not\ntaken action to do so, the governing body of the municipality\nmay be petitioned to establish an NID, under the procedures\nprovided for by this act.\n(3) In no case, where the governing body of a\nmunicipality is petitioned to establish an NID under\nparagraph (2), shall the municipality be required to\nestablish an NID.\n(b) Specific procedures.--\n19990H1142B3337\n- 11 -\n\n(1) A copy of everything required under this section, as\nwell as the date, location and time of any public hearing\nrequired by this act, shall be provided by the municipal\ncorporation to all property owners and lessees of property\nowners located in the proposed NID, at least 30 days prior to\nthe first public hearing required by this section.\n(2) At least one public hearing, no earlier than 15 days\napart, for the purpose of receiving public comment from\naffected property owners within the proposed NID, on the\nproposed NIDP, shall be held by the municipality before the\nestablishment of an NID. Notice of the hearing shall be\nadvertised at least ten days prior thereto in a newspaper of\ngeneral circulation in the municipality.\n(3) Any objections by property owners within the\nproposed NID must be made in writing, by persons representing\nthe ownership of 51% 40%, in numbers, of the benefited\n<\nproperties within the NID., or by property owners within the\n<\nproposed NID whose property valuation, as assessed for\ntaxable purposes, shall amount to 51% of the total property\nvaluation within the NID. Objections must be signed by the\nproperty owner and filed in the office of the clerk for the\ngoverning body of the municipality in which the NID is\nproposed.\n(c) Contents of preliminary plan.--The plan shall include\nthe following:\n(1) A map indicating the boundaries by street of the\nproposed NID, however, a designated property may not be\nincluded in more than one NID.\n(2) A written report from the municipality containing:\n(i) The name of the proposed district.\n19990H1142B3337\n- 12 -\n\n(ii) A detailed description of the service areas of\nthe proposed district.\n(iii) A list of all properties to be assessed.\n(iv) A list of proposed improvements within the NID,\nand their estimated cost.\n(v) A proposed budget for the first fiscal year,\nincluding, but not limited to, the following: personnel\nand administration, programs and services, maintenance\nand operation, and capital expenditures.\n(vi) The proposed revenue sources for financing all\nproposed improvements, programs and services.\n(vii) The estimated time for implementation and\ncompletion of all proposed improvements, programs and\nservices.\n(viii) A statement identifying the administrative\nbody which will govern and administer the NID.\n(ix) Any other information, including the statutory\nauthority, or, in the case of a nonprofit corporation,\nthe bylaws, which describe the powers and duties of and\nthe method for making decisions by the NIDMA.\n(x) The method of determining the amount of the\nassessment fee to be levied on property owners within the\nNID under section 7.\n(3) In addition, the plan shall also:\n(i) Identify in detail the specific duties and\nresponsibilities of both the NIDMA and the municipal\ncorporation with respect to the NID.\n(ii) Require that a written agreement be signed by\nthe municipal corporation and the NIDMA describing in\ndetail their respective duties and responsibilities.\n19990H1142B3337\n- 13 -\n\n(iii) Allow for and encourage tax-exempt property\nowners located within the NID to provide in-kind services\nor a financial contribution to the NIDMA, if not\nassessed, in lieu of a property assessment fee.\n(iv) Require in the agreement between the municipal\ncorporation and the NIDMA that the municipality must\nmaintain the same level of municipal programs and\nservices provided within the NID before NID designation\nas after NID designation.\n(v) Allow the municipal corporation the right to\ninclude in the agreement with the NIDMA and in the\nenabling ordinance establishing the NID a sunset\nprovision of no less than five years for renewal of the\nagreement.\n(vi) Require in the agreement with the NIDMA that\nthe municipality establishing an NID shall be responsible\nfor the collection of all property assessment fees levied\nwithin the NID, if so desired by the NIDMA.\n(vii) Provide that a negative vote of at least 51%\n<\n40% of the property owners within the NID, or property\n<\nowners within the NID whose property valuation as\nassessed for taxable purposes amounts to 51% of the total\nproperty valuation located within the NID proposed in the\nfinal plan, shall be required to defeat the establishment\nof the proposed NID by filing objections with the clerk\nfor the governing body of the municipality within 45 days\nof presentation of the final plan, where the governing\nbody of municipality is inclined to establish the NID.\n(d) Final plan.--Prior to the establishment of an NID, the\nmunicipality shall submit a revised final plan to property\n19990H1142B3337\n- 14 -\n\nowners located within the proposed NID, which incorporates\nchanges made to the plan, based on comments from affected\nproperty owners within the NID, provided at the public hearings\nor at some other time. Changes to the final plan, which differ\nfrom the preliminary plan, shall also be so indicated in an\neasily discernible method for the reader, including, but not\nlimited to, changes being in boldfaced or italicized type.\n(e) Public hearing.--At least one public hearing for the\npurpose of receiving public comment on any revisions to the\npreliminary plan made following suggestions by affected property\nowners within the proposed NID and reflected in the final NIDP\nshall be held by the municipal corporation before enacting an\nordinance establishing an NID. Notice of the hearing shall be\nadvertised at least ten days prior thereto in a newspaper of\ngeneral circulation in the municipality.\n(f) Veto of final plan for NID.-\n(1) Following the last public hearing required under\nsubsection (e) or under subsection (g), if an amendment to\nthe final plan, affected property owners located within a\nproposed NID shall have 45 days from the date of the hearing\nto object to and disapprove the final plan or any amendment\nto the final plan under the requirements of subsection\n(b)(3).\n(2) If 51% 40% or more of the affected property owners\n<\nor property owners whose property valuation as assessed for\n<\ntaxable purposes amounts to 51% of the total property\nvaluation within the proposed NID fail to register their\ndisapproval of the final plan or amendment to the final plan\nin writing with the clerk of the governing body of the\nmunicipality in which the NID is proposed, the governing body\n19990H1142B3337\n- 15 -\n\nof the municipality may, following the 45-day period, enact a\nmunicipal ordinance establishing an NID under this act, or in\nthe case of an amendment to the final plan, adopt any\namendments to the ordinance.\n(g) Amendments to final plan.-\n(1) The final plan may be amended by the NIDMA any time\nafter the establishment of an NID, pursuant to the provisions\nof this act, upon the recommendation of the NIDMA board,\nprovided there is concurrence with the owners of at least 51% <\nof the assessed valuation of all property within the NID or\n51% 60% of the property owners within the NID.\n<\n(2) Amendments to the final plan which also require the\napproval of the governing body of the municipality\nestablishing the NID, include:\n(i) Substantially changed or added programs,\nimprovements and/or services to be provided in the NID.\n(ii) Increased expenditures affecting more than 25%\nof the total NIDMA budget for the fiscal year.\n(iii) Incurring increased indebtedness.\n(iv) Changing the assessment fee structure levied on\nproperty owners in the NID.\n(v) Changing the legal entity (NIDMA) which provides\nprograms, improvements and services within the NID.\n(vi) Changing the NID service area boundary.\nPrior to the governing body of the municipality approving any\nof the changes in this paragraph, the governing body shall\nhold at least one public hearing to determine that such\nchanges are in the public interest as it relates to affected\nproperty owners within the NID.\n(3) The municipality shall provide public notice of the\n19990H1142B3337\n- 16 -\n\nhearing for any amendments, by publication of a notice, in at\nleast one newspaper having a general circulation in the NID,\nspecifying the time and the place of such hearing and the\namendments to be considered. This notice shall be published\nonce at least 10 days prior to the date of the hearing.\n(4) The governing body of the municipality may, within\n30 days following the public hearing and at its sole\ndiscretion, approve or disapprove of any amendments to the\nplan. If approved, such amendments shall be effective upon\nthe date of such approval.\n(5) Prior to the adoption of any amendment to the NID\nboundary which increases the size of the NID, any owner of\nproperty to be added to the NID shall be notified of the\ndate, time and location of the public hearing on the proposed\namendment to the final plan, and provided all information\nrequired by subsection (c).\nSection 6. Creation of neighborhood improvement district\nmanagement association.\n(a) Association designated.--When a municipality establishes\nan NID under this act, a neighborhood improvement district\nmanagement association shall be designated by the governing body\nof the municipality in which the NID is to be located to\nadminister programs, improvements and services within the NID.\n(b) Administration.-\n(1) NIDs created pursuant to this act shall be\nadministered by an NIDMA which shall be an authority created\npursuant to the act of May 2, 1945 (P.L.382, No.164), known\nas the Municipality Authorities Act of 1945, an existing\nnonprofit development corporation, an existing nonprofit\ncorporation or a nonprofit development corporation or\n19990H1142B3337\n- 17 -\n\nnonprofit corporation established by the governing body or\nauthorized to be established by the governing body of the\nmunicipality in which the NID is to be located, to administer\nthe NIDP.\n(2) If an active nonprofit development corporation\nalready exists within the geographic boundaries of the NID\nand formally indicates its interest to the governing body of\nthe municipality to become the designated NIDMA, the\ngoverning body of the municipality shall grant that request\nunless 51% 40% or more of the affected property owners or\n<\nproperty owners whose property valuation as assessed for\ntaxable purposes amounts to 51% of the total property\nvaluation within the proposed NID register their disapproval\nof this designation in writing with the clerk of the\ngoverning body within a 45-day period following the formal\nwritten request for designation by the nonprofit development\ncorporation to become the NIDMA.\n(c) Powers.--An NIDMA created under this act shall assume\nall powers provided for in section 7 immediately upon the\neffective date of the municipal ordinance enacted under section\n4 creating an NID.\n(d) Board.--Every NIDMA shall have an administrative board.\n(1) Where an authority created pursuant to the\nMunicipality Authorities Act of 1945 serves as the NIDMA, the\nboard shall be appointed pursuant to the Municipality\nAuthorities Act of 1945.\n(2) Where an existing nonprofit development corporation\nor other nonprofit corporation is to serve as the NIDMA, the\nboard shall be appointed according to the bylaws of the NIDMA\nfiled with the Department of State.\n19990H1142B3337\n- 18 -\n\n(3) Where a nonprofit development corporation or other\nnonprofit corporation is established to serve as the NIDMA\nfor an NID, the board shall be comprised of an odd number of\nmembers, between five and nine, with at least one member\nrepresenting the municipal corporation in which the NID is\nlocated.\n(4) In all cases, NIDMA boards shall include a\nrepresentative of property owners located in the NID,\nbusiness owners located in the NID and any institutions\nlocated in the NID. Institutional members may appoint a\ndesignee to represent them. All board members need not be\nresidents of the NID.\nSection 7. Powers of neighborhood improvement district\nmanagement association.\n(a) General powers.--A NIDMA shall have, in addition to any\nother powers provided pursuant to the act of May 2, 1945\n(P.L.382, No.164), known as the Municipality Authorities Act of\n1945, where the NIDMA is an authority, or in addition to any\nother powers provided pursuant to the charter establishing a\nnonprofit development corporation or other nonprofit\ncorporation, where the NIDMA is a nonprofit development\ncorporation or other nonprofit corporation, the power to:\n(1) Sue or be sued, implead or be impleaded, complain\nand defend in all courts.\n(2) Employ an executive director or administrator and\nany necessary supporting staff or contract for the provision\nof same.\n(3) Prepare planning or feasibility studies or contract\nfor the preparation of same, to determine needed capital\nimprovements or administrative programs and services within\n19990H1142B3337\n- 19 -\n\nthe NID.\n(4) Make capital improvements or provide administrative\nprograms and services within an NID.\n(5) Purchase, own, construct, renovate, develop,\noperate, rehabilitate, manage, sell and/or dispose of real\nproperty.\n(6) Contract with existing businesses within the NID.\n(7) Contract for the provision of products or services\nby the NIDMA to clients located inside and outside of the\nNID, including billing and collection of assessment fees by\nanother NIDMA.\n(8) Appropriate and expend NID funds which would include\nany Federal, State or municipal funds received by the NIDMA.\nThe funds shall be expended in accordance with any specific\nprovisions contained in the municipal enabling ordinance\nestablishing the NID and may be used:\n(i) To acquire by purchase or lease real or personal\nproperty to effectuate the purposes of this act,\nincluding making common improvements within the NID,\nincluding, but not limited to, sidewalks, retaining\nwalls, street paving, parks, recreational equipment and\nfacilities, open space, street lighting, parking lots,\nparking garages, trees and shrubbery, pedestrian walks,\nsewers, water lines, rest areas and the acquisition,\nrehabilitation or demolition of blighted buildings or\ncomparable structures.\n(ii) To provide free or reduced-fee parking for\ncustomers of businesses within the NID; transportation-\nrelated expenditures, public relations programs, group\nadvertising and NID maintenance and security services.\n19990H1142B3337\n- 20 -\n\n(iii) To impose special assessment fees.\n(9) Solicit in-kind services or financial contributions\nfrom tax-exempt property owners within the NID in lieu of\nproperty assessment fees. This may include entering into\nvoluntary multiyear agreements (VMAs) between the NIDMA and\ntax-exempt property owners located within an NID, for the\nprovision of same.\n(10) Impose liens on property for the nonpayment of\nproperty assessments. NIDs administered by nonprofit\ncorporations would have any such liens filed by the municipal\ncorporation.\n(11) Hire additional off-duty police officers or private\nsecurity officers, whose patrol area responsibilities would\nbe limited to the geographical area incorporated within the\ndesignated NID service area and whose responsibility would be\nto support existing municipal and volunteer efforts aimed at\nreducing crime and improving security in the NID.\n(12) Designate a district advisory committee, referred\nto as the DAC, for each NID established within the\nmunicipality. Each DAC shall consist of an odd number of\nmembers, between five and nine, who shall be representative\nof the neighborhood's character, including, but not limited\nto, age, sex and cultural diversity.\n(b) Assessments.-\n(1) The NIDMA shall, upon approval by the governing body\nof the municipality, have the power to assess property owners\nwithin the NID a special property assessment fee. Revenues\nfrom the fee shall be accounted for and used by the NIDMA to\nmake improvements and provide programs and services within\nthe NID as authorized by this act. Where the district\n19990H1142B3337\n- 21 -\n\nestablished is a BID, the NIDMA shall have the authority to\nexempt residential property owners from any special\nassessment fees levied.\n(2) All assessments authorized under this section shall\nbe calculated using January 1 as the first day of the fiscal\nyear.\n(3) All special property assessment fees shall be based\nupon the estimated cost of the programs, improvements or\nservices to be provided in such NID as stated in the final\nplan under section 5(d). In no case shall the aggregate\namount of all fees levied by the NIDMA during the year exceed\nthe estimated cost of proposed programs, improvements and\nservices for the year.\n(4) In the case of an NID which contains a combination\nof business, residential, industrial and/or institutional\nareas and uses, a weighted assessment may be instituted. In\nsuch case, the fee levied on property owners generally may be\nweighted higher for business, industrial or institutional\nproperties than that levied on residential property owners,\nprovided the basis for the calculation of the fee meets the\nrational nexus test.\n(5) The total costs of improvements, programs and\nadministrative services provided by the NIDMA shall be\nassessed to all designated properties within the NID by one\nof the following methods:\n(i) An assessment determined by multiplying the\ntotal service and improvement costs by the ratio of the\nassessed value of the benefited property to the total\nassessed valuation of all designated benefited properties\nin the NID.\n19990H1142B3337\n- 22 -\n\n(ii) An assessment upon the several properties in\nthe NID in proportion to benefits as ascertained by\nviewers appointed in accordance with law.\n(iii) Any method that equitably apportions costs\namong benefiting properties.\n(iv) In the case of improvements benefiting\nproperties abutting the NID by the front-foot method,\nwith equitable adjustments for corner properties and\nother cases provided for in the municipal ordinance. Any\nproperty which cannot be equitably assessed by the front-\nfoot method may be assessed by any of the above methods.\n(c) Payment.--The governing body may by ordinance authorize\nthe payment of the assessment in equal annual or more frequent\ninstallments, over such time and bearing interest at the rate\nspecified in the municipal ordinance. If bonds have been issued\nand sold, or notes or guarantees have been given or issued, to\nprovide for the cost of the services and improvements, the\nassessment in equal installments shall not be payable beyond the\nterm for which the bonds, notes or guarantees are payable.\n(d) Liens.-\n(1) Notwithstanding the filing of the claims, all\nassessments which are made payable in installments shall\nconstitute liens and encumbrances upon the respective\nbenefited properties at the beginning of each calendar year,\nexcept as provided in subsection (c), and only in an amount\nequal to the sum of:\n(i) the annual or other installments becoming\npayable in such year, with interest and penalties, if\nany, thereon; and\n(ii) the total of all installments, with interest\n19990H1142B3337\n- 23 -\n\nand penalties thereon, which became due during prior\nyears and which remain due and unpaid at the beginning of\nthe current year.\n(2) In the case of default in the payment of any\ninstallment and interest for a period of 90 days after the\npayment becomes due, the assessment ordinance may provide\neither for the entire assessment, with accrued interest and\npenalties to become due and become a lien from the due date\nof the installment, or may provide solely for the enforcement\nof the claim as to the overdue installment, with interest and\npenalties, in which case the ordinance shall further provide\nthat, if any installment or portion thereof remains due and\nunpaid for one year after it has become due and payable, then\nthe entire assessment with accrued interest and penalties\nshall become due and become a lien from the due date of the\ninstallment.\n(3) No action taken to enforce a claim for any\ninstallment or installments shall affect the status of any\nsubsequent installment of the same assessment, each of which\nshall continue to become a lien upon the property annually\npursuant to paragraph (1).\n(4) The ordinance may contain any other provision\nrelating to installment assessments which is not inconsistent\nwith applicable law.\n(5) Any owner of property against whom an assessment has\nbeen made may pay the assessment in full at any time, with\naccrued interest and costs thereon, and such a payment shall\ndischarge the lien of the assessment, or installments then\nconstituting a lien, and shall also release the claim to any\nlater installments.\n19990H1142B3337\n- 24 -\n\n(6) Claims to secure the assessments shall be entered in\nthe prothonotary's office of the county at the same time, and\nin the same form, and collected in the same manner, as\nmunicipal tax claims are filed and collected, notwithstanding\nthe provisions of this section as to installment payments.\nSection 8. Dissolution of neighborhood improvement district\nmanagement association and neighborhood\nimprovement district.\n(a) Conveying projects.--When any NIDMA shall have finally\npaid and discharged all bonds which, together with the interest\ndue thereon, shall have been secured by a pledge of any of the\nrevenues or receipts of a project, it may, subject to any\nagreements concerning the operation or disposition of such\nproject and the NIDMA bylaws, convey such project or projects to\nthe municipal corporation which established or had established\nthe NIDMA.\n(b) Request for termination.--Any request for the\ntermination of the NID and NIDMA approved by 51% 40% of the\n<\nassessed property owners, in numbers, located in the NID, shall\nbe submitted to the governing body of the municipality in\nwriting. The governing body shall hold a hearing on the merits\nof same, pursuant to section 5(b)(2) as it relates to the\nrequired procedure of holding a hearing. Such written request\nshall be considered by the governing body of the municipality.\nIf the request is approved by the governing body of the\nmunicipality, then a resolution to that effect shall be filed\nwith the Secretary of the Commonwealth, and the secretary shall\nnote the termination of the existence on the record of\nincorporation and return the resolution with his or her approval\nshown on the resolution to the municipal corporation. Then, the\n19990H1142B3337\n- 25 -\n\nproperty of the NIDMA shall pass to the municipal corporation,\nas the case may be, and the NIDMA and NID shall cease to exist.\nAny request for the termination of the NID and NIDMA by the\ngoverning body of the municipality in which the NID is located\nshall result in a hearing on the merits of same, pursuant to\nsection 5(b)(2) as it relates to the required procedure for\nholding a hearing. Before the decision to terminate an NID and\nNIDMA is made, such termination must be approved by 51% 40% of\n<\nthe assessed property owners, in numbers, located in the NID,\nand shall be submitted to the governing body of the municipality\nin writing. Such written request shall be considered by the\ngoverning body of the municipality. If the request is approved\nby the governing body of the municipality, then a resolution to\nthat effect shall be filed with the Secretary of the\nCommonwealth, and the secretary shall note the termination of\nthe existence on the record of incorporation and return the\nresolution with his or her approval shown to the municipal\ncorporation. The property of the NIDMA shall pass to the\nmunicipal corporation, as the case may be, and the NIDMA and NID\nshall cease to exist.\nSection 9. Annual audit; report.\nThe NIDMA shall annually:\n(1) submit an audit of all income and expenditures to\nthe Department of Community and Economic Development and the\ngoverning body of the municipality in which the NID is\nlocated within 120 days after the end of each fiscal year;\nand\n(2) submit a report, including financial and\nprogrammatic information, including a summary of audit\nfindings, to the governing body of the municipality in which\n19990H1142B3337\n- 26 -\n\nthe NID is located and to all assessed property owners\nlocated in the NID.\nSection 10. Applicability.\n(a) Existing districts.--Except as provided for in\nsubsection (d), any existing business improvement district or\ndowntown improvement district established prior to the effective\ndate of this act shall remain in existence and shall be governed\nby the Municipality Authorities Act of 1945, insofar as it\nrelates to business improvement districts or 53 Pa.C.S. Ch. 54\n(relating to business improvement districts).\n(b) Districts created subsequently.--Any NID established\nsubsequent to the effective date of this act shall be governed\nby the provisions of this act.\n(c) Previously terminated districts.--Any business\nimprovement district or downtown improvement district in\nexistence prior to the effective date of this act which is\nterminated shall, upon its reestablishment, be governed by the\nprovisions of this act. This shall include any termination\nresulting from a sunset provision in any municipal agreement or\nordinance.\n(d) Additional requirements.--Any business improvement\ndistrict or downtown improvement district in existence on the\neffective date of this act shall:\n(1) be required to carry out any duty or responsibility\nimposed on NIDs under this act; and\n(2) possess any additional power given to NIDs under\nthis act without having to restructure or reorganize under\nthis act.\nSection 11. Effective date.\nThis act shall take effect in 60 days.\nB11L53JLW/19990H1142B3337\n- 27 -"
    }
  ]
}