{
  "course_name": "DV Lab: Documenting Science Through Video and New Media",
  "course_description": "This course is an introductory exploration of documentary film theory and production, focusing on documentaries about science, engineering, and related fields. Students engage in digital video production as well as social and media analysis of science documentaries. Readings are drawn from social studies of science as well as from documentary film theory. The courses uses documentary video making as a tool to explore the worlds of science and engineering, as well as a tool for thinking analytically about media itself and the social worlds in which science is embedded. The course includes a hands-on lab component devoted to digital video production, in addition to classroom lectures and in-class film screenings.",
  "topics": [
    "Engineering",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Science",
    "Social Science",
    "Anthropology",
    "Engineering",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Science",
    "Social Science",
    "Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nIn this class, we will\nmake\nas well as\nanalyze\ndocumentaries that focus on science and engineering broadly defined. One of the classic contributions of the discipline of science and technology studies (STS) has been to consider science not simply in terms of its end product, (i.e. what it learns or makes), but as a\nsocial process\nin its own right. Who becomes a scientist or an engineer and why? What are the social milieus that shape the kinds of projects scientists engage in? What are the everyday social and work practices of scientists and engineers? What are the settings in which science and engineering are done? What are the implications of engineering and scientific practices in societal terms? In terms of everyday life? How might they differ from public preconceptions about \"science\"? In this class, we seek to break down rigid distinctions between\nanalysis\nand\ndoing\nnot only for the fields of science and engineering, but for documentary film and video. In short, just as science studies scholars focus on science as a\nsocial process\n, in this class we will consider documentary filmmaking as a form of social practice in which it is impossible to separate out theory from the making of films. Like STS studies more broadly, we will consider how the social conditions in which documentary films are made are an intrinsic part of their meaning.\n\nIn this class, we will ask a range of questions: What kinds of historically changing ideas about \"truth\" or reality come to be encapsulated in documentary film? How do these ideas emerge in particular ways in films about science and engineering? In what ways have scientists and engineers sought to use non-fiction film and how have they been portrayed in them? What kinds of narratives about science and technology have documentary filmmakers employed and what have been their effects upon their audiences? How have historical changes in technologies relating to film and video transformed the kinds of films - and their meanings - that have been made? What kinds of relationships are at work among filmmakers, subjects, and audiences? How do visual images and what they can capture differ from what can be captured in the written word? How do documentary films about science shape - and, in turn, come to be shaped by - other forms of filmmaking or analysis? How do they affect how we think about the larger social worlds in which we live?\n\nFrom our vantage point within MIT, we will explore what video cameras allow us to capture about the social worlds of science and engineering. How might cameras encourage us to rethink what it's like to work in a laboratory? What might we learn by filming the process of conceiving and engineering a new kind of robot or a solar-powered vehicle or a clean water technology for developing countries? How can cameras help us capture the symbolic meanings of \"science\" through documenting the architectural layout of MIT or the tourists who pour through the infinite corridor? How might video help us capture how science and technology become part of everyday worlds far beyond MIT, from community health programs, to the circulation of garbage on and off campus, to the far-flung social settings in which inventions made by\nD-Lab\nstudents may operate?\n\nThe class meets twice a week for three hours. Wednesday classes will focus on documentary film analysis and we will watch clips of classic documentaries particularly those focusing on science. Friday's class is devoted to a lab focusing on video production. Students will engage in short production exercises that will familiarize them with video equipment and will also allow them to understand the theoretical discussions at a deeper level. Students will also engage in a final project that will track some aspect of science and engineering (broadly defined) in practice. Given the limited scope of this class, we can only offer a taste of the full-fledged production process. However, we hope that this class can offer a stimulating foray into the social worlds of documentary filmmaking.\n\nRequirements\n\nAttendance in class is crucial. Class content and particularly production experience cannot be replicated outside of class-time. Course materials must be read for the assigned day in class.\n\nAssignments\n\nClass assignments include:\n\nOne 3-5 page paper in which students should discuss the readings and offer in-depth discussion of relevant films in their paper. (30% of total grade),\n\nVideo Homework exercises and class participation (30% of total grade)\n\nFinal projects (40% of total grade). If you're happy with the outcome of your final video project this is all you need submit. If you are not completely satisfied with the final project, you can submit a 5 page paper along with the video project, outlining what you tried to do, how you went about it, why it didn't fully capture what you were trying to do, and possibilities for reworking the video that could address the issues you raise. You will be graded on the paper as well as the final project (i.e. even if the final project isn't a complete success, you can still earn a good grade by offering a perceptive, well-argued analysis of what can be learned from this experience).\n\nReadings\n\nRequired Books\n\nBarnouw, Eric.\nDocumentary: A History of the Non-fiction Film\n. 2nd ed. Oxford University Press, 1993. ISBN: 9780195078985. [Preview with\nGoogle Books\n]\n\nAscher, Steven, and Edward Pincus.\nThe Filmmaker's Handbook: A Comprehensive Guide for the Digital Age: 2013 Edition\n. Plume Publishers/Penguin, 2012. ISBN: 9780452297289.\n\nBrenneis, Lisa, and M. Wohl.\nFinal Cut Pro X: Visual QuickStart Guide\n. Peachpit Press, 2011. ISBN: 9780321774668. [Preview with\nGoogle Books\n]\n\nReadings in these books are complemented by selections from other books and journals. Graduate students are expected to read additional papers and chapters each week.\n\nOn lab days, there is often optional background reading on camera and filmmaking techniques or Final Cut Pro(r). This is truly optional. You will be given instruction on how to use the equipment and editing software during class time.\nThe Filmmaker's Handbook\nand\nFinal Cut Pro X: Visual QuickPro Guide\nare intended as reference guides if you need assistance figuring out a problem (with designated chapters to suggest likely places to look for aid). You are not expected to read these chapters straight through.\n\nFilms\n\nEach class lecture session includes time for screening excerpts of films along with class discussion. Students are strongly encouraged to view the complete versions of the these films outside of class time.\n\nEquipment\n\nRecording\n\nWe have several recording kits that students can borrow. Each consists of a camera, tripod, audio kit (including lavalier microphone, boom pole, shotgun microphone, and headphones), and an external computer hard drive.\n(Please note that the hard drives are extremely delicate and take care when transporting them)\n.\n\nYou will need to sign out and return the equipment with Dave Stripinis. Camera and audio equipment must be returned within 48 hours (or by Monday if borrowing over the weekend) to our equipment room and in the condition in which it was received. You will be able to sign out and return equipment at specified times on Mondays, Wednesdays and Fridays. Further procedures for borrowing and caring for equipment will be discussed in class.\n\nEditing\n\nStudents will be able to access editing equipment in two places.\n\nTwo Mac computers will be available for students in this class in our equipment room, to be scheduled with one of the instructors or the TA.\n\nEditing equipment (Mac computers loaded with Final Cut Pro) is also available at the MIT New Media Center.\n\nCalendar\n\nSession Key:\n\nLec = Lecture\n\nLab = Lab\n\nSES #\n\nTOPICS\n\nASSIGNMENTS\n\nLEC 1\n\nIntroduction: Doing science and making documentary-film\n\nLAB 1\n\nIntroduction to the camera with in-class exercise\n\nLEC 2\n\nDocumentary and ways of seeing\n\nLAB 2\n\nScreen camera exercises\n\nIntroduction to sound with in-class exercise\n\nLab 2 homework: short production exercise in which students shoot a scene\n\nLEC 3\n\nScience and seeing\n\nLAB 3\n\nExercise:\nMIT Infinite Corridor\nwalk\n\nLEC 4\n\nEthnographic film as science and beyond: from narration to dialogue\n\nPaper due two days before LEC 4\n\nLAB 4\n\nProduction exercise: shoot a scene with sound and picture\n\nLEC 5\n\nEthnographic film: the work of Jean Rouch\n\nLAB 5\n\nIntroduction to editing\n\nLab 5 homework: edit a previously shot scene\n\nLEC 6\n\nFilmmaking as process; Direct Cinema\n\nLAB 6\n\nScreen Lab 5 editing homework\n\nLab 6 homework: Direct Cinema exercise\n\nLEC 7\n\nThe Interview: Errol Morris' window onto science\n\nLAB 7\n\nScreen Lab 6 Direct Cinema homework\n\nInterviewing techniques\n\nLab 7 homework: interview exercise\n\nLEC 8\n\nNew directions in ethnographic film: Sensory ethnographic approaches\n\nLAB 8\n\nScreen Lab 7 interview homework\n\nPresent 3 ideas for final projects\n\nLEC 9\n\nReflecting (on) Nature: The power of documentary narrative\n\nLAB 9\n\nPresent final film project ideas\n\nLEC 10\n\nScience and the environment: alternative ways of knowing\n\nLAB 10\n\nIntroduction to lighting (with guest instructor\nDavid Tames\n)\n\nLEC 11\n\nPicturing science: The personal, the political and the virtual\n\nLAB 11\n\nNew online interactive documentary formats\n\nLEC 12\n\nDocumentary filmmaking as process\n\nLEC 13\n\nOther worlds: From science fact to science fiction and back again\n\nLAB 12\n\nScreen rough cuts of final projects (1/2 class); continue editing in the MIT New Media Center\n\nLEC 14\n\nEditing of final projects; individual meetings\n\nLAB 13\n\nEditing of final projects; individual meetings (cont.)\n\nLEC 15\n\nScreen final projects",
  "files": []
}