{
  "course_name": "Dynamics",
  "course_description": "This course reviews momentum and energy principles, and then covers the following topics: Hamilton’s principle and Lagrange’s equations; three-dimensional kinematics and dynamics of rigid bodies; steady motions and small deviations therefrom, gyroscopic effects, and causes of instability; free and forced vibrations of lumped-parameter and continuous systems; nonlinear oscillations and the phase plane; nonholonomic systems; and an introduction to wave propagation in continuous systems.\nThis course was originally developed by Professor T. Akylas.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Dynamics and Control",
    "Science",
    "Physics",
    "Classical Mechanics",
    "Quantum Mechanics",
    "Engineering",
    "Mechanical Engineering",
    "Dynamics and Control",
    "Science",
    "Physics",
    "Classical Mechanics",
    "Quantum Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Outline\n\nTopics will be covered in the following order:\n\nI. Introduction\n\nII. Kinematics of 3-D Motion of Rigid Bodies\n\nIII. Momentum Principles for Rigid Bodies\n\nIV. Variational Formulation\n\nV. Stability of Motion\n\nVI. Vibration Analysis\n\nVII. Continuous Systems\n\nTextbooks\n\nThe course will be based on the material presented in the lectures. There is no required textbook, although the following books are recommended and will be placed on library reserve.\n\nBaruh, H.\nAnalytical Dynamics\n. New York, NY: McGraw-Hill, 1998. ISBN: 9780073659770.\n\nGinsberg, J. H.\nAdvanced Engineering Dynamics.\n2nd ed. Cambridge, UK: Cambridge University Press, 1995. ISBN: 9780521470216.\n\nCrandall, S. H., D. C. Karnopp, E. F. Kurtz, Jr., and D. C. Pridmore-Brown.\nDynamics of Mechanical and Electromechanical Systems\n. Malabar, FL: Krieger, 1982. ISBN: 9780898745290.\n\nMoon, F. C.\nApplied Dynamics\n. New York, NY: Wiley, 1998. ISBN: 9780471138280.\n\nGreenwood, D. T.\nClassical Dynamics\n. New York, NY: Dover Publications, 1997. ISBN: 9780486696904.\n\n------.\nPrinciples of Dynamics\n. Upper Saddle River, NJ: Prentice-Hall, 1987. ISBN: 9780137099818.\n\nHomework\n\nThere will be about 10 problem sets; you will have a week to work on each. Some problems will require the use of a computer, and familiarity with MATLAB(r) would be helpful. No late homework will be accepted. You may discuss problems with others in the class but you must (a) write up your eventual solution independently, and (b) list the names of students with whom you discussed the problem set.\n\nExams\n\nThere will be two in-class closed-book exams. There will be no final exam.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n20%\n\nExams\n\n80%",
  "files": [
    {
      "category": "Resource",
      "title": "dyn1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/764c0402a6c9032ebebbe2676886453a_dyn1.pdf",
      "content": "2.032\nDYNAMICS\nFall 2004\nProblem Set No. 1\nOut: Wednesday, September 15, 2004\nDue: Wednesday, September 22, 2004 at the beginning of class\nProblem 1\n(Doctoral Exam, 1999)\nA pendulum is constructed by attaching a mass m to an extensionless string of fixed\nlength l. The upper end of the string is connected to the uppermost point of a vertical\nfixed disk of radius R (R < l/π), as shown below. At t = 0 the mass hangs at rest at\nthe equilibrium position θ = 0, when it is given an initial velocity v0 along the horizontal.\nDerive expressions for the two extreme deflections (in terms of θ) of the pendulum resulting\nfrom this initial perturbation. Do not make a small-angle approximation.\ng\nv0\nR\nm\nθ\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 2\nA point mass moves without friction on a horizontal plane. A massless inextensible string\nis attached to the point mass and led through a hole (see figure below). At time = t0 the\nmass moves along a circle with constant velocity v0. We gradually pull the free end of the\nstring downwards until, at time t1, we have |r(t1)| = L0/2. What is the velocity of the\nmass at time t1?\n\nPlane\n(no friction)\nr(t)\nString\nm\nO\n\nProblem 3\nA particle of mass m1 is attached to a massless rod of length L which is pivoted at O and\nis free to rotate in the vertical plane as shown below. A bead of mass m2 is free to slide\nalong the smooth rod under the action of a spring of stiffness k and unstretched length\nL0. (a) Choose a complete and independent set of generalized coordinates. (b) Derive the\ngoverning equations of motion by applying momentum principles.\nm1\nm2\nk\ng\nL\nO\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 4\n(adapted from Crandall et al., 2-35)\nConsider the system shown below under the assumption that the pendulum arm connect-\ning m2 and m3 is massless. By applying momentum principles, obtain the differential\nequations of motion for the generalized coordinates x1, x2 and θ.\nm3\nθ\nm2\nx2\nx1\nk2\nk1\nm1\ng\n\nProblem 5\n(Doctoral Exam, 1999)\nTwo identical rods of length l, that have equal masses m attached at their ends, are\nclamped at an angle θ to a shaft as shown. (The shaft and the rods are in the same\nplane.) What reaction forces must the bearings be able to withstand, if the angle θ can\nbe set anywhere from zero to 90*and the maximum angular velocity of the shaft is ω?\n(For simplicity, you may neglect the mass of the rods and ignore the effects of gravity.)\nm\nl\nd\nl\nθ\nm\nω\nCourtesy of Prof. T. Akylas. Used with permission."
    },
    {
      "category": "Resource",
      "title": "pss01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/bfcd3ea4eea7505664df6e15752aa6e5_pss01.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "dyn2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/bbfebc42a6f04ffff3022a6c3ea7ba2e_dyn2.pdf",
      "content": "2.032 DYNAMICS\nFall 2004\nProblem Set No. 2\nOut: Wednesday, September 22, 2004\nDue: Wednesday, September 29, 2004 at the beginning of class\nProblem 1\nShow that for any 3 × 3 skew-symmetric matrix A, there exists a 3-dimensional vector ω\nsuch that for any three-dimensional vector x ,\nAx = ω × x .\nProblem 2\nConsider the coupled pendula shown in the figure below. Both rods are massless, with\npoint masses m attached to their ends. Both joints shown in the figure are frictionless. The\nexternal force F encloses a fixed angle γ with the line of the pendulum shown. The masses\nnever collide. The constant of gravity is g.\nQuestions:\n- Identify the constraints.\n- Determine the number of degrees of freedom.\n- Find the equations of motion for φ and ψ.\n- Find the constraint forces.\n- Is the system conservative? (Why?)\nm\nF\nm\nl1\nl2\nl3\nψ\nφ\nγ\ng\n\nProblem 3\nDetermine the angular velocity of a cone rolling on the XY -plane without slipping, as\nshown.\nFigure by OCW.\n\nProblem 4 (adapted from Ginsberg, 3-22)\nThe disk rotates at ω1 about its axis, and the rotation rate of the forked shaft is ω2. Both\nrates are constant. Determine the velocity and acceleration of an arbitrarily selected point B\non the perimeter. Describe the results in terms of components relative to the xyz axes in the\nsketch.\nx\ny\nA\nB\nz\nθ\nω\nω\nFigure by OCW. After 3-22 in Ginsberg, J. H. Advanced Engineering Dynamics. 2nd ed. New York: Cambridge University Press, 1998."
    },
    {
      "category": "Resource",
      "title": "pss02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/833b772d69b1e9b4294dafc194423afe_pss02.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "dyn3c.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/24b17a836f68c2bd6c1bde46acb130d5_dyn3c.pdf",
      "content": "2.032 DYNAMICS\nFall 2004\nProblem Set No. 3\nOut: Wednesday, September 29, 2004\nDue: Wednesday, October 6, 2004 at the beginning of class\nProblem 1\nA pendulum consists of a rod of length L with a frictionless pivot at one end. The pendulum\nis suspended from a . ywheel of radius R which rotates with . xed angular velocity ω, as\nshown below.\n(a) Determine the angular velocity of the rod in terms of ω and the generalized\ncoordinate θ indicated in the sketch.\n(b) Calculate the velocity of the mid point C of the rod.\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 2 (adapted from Doctoral Qualifying Exam 2002)\nIn the system sketched below, the rigid cylinder of radius R is moving to the right such that\nits center C has velocity v. There is no slipping between the cylinder and the bar BD, but\nthere is slipping between the cylinder and the ground. In the position shown,\n(a) Determine the angular velocity of the bar BD.\n(b) Determine the velocity of the cylinder at the point where it contacts the ground.\n.\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 3\nConsider the Cardan drive shown in the figure below. Determine the outgoing angular\nvelocity ω2 in terms of the angular velocity ω1, and angles α and ψ. Note that angular\nvelocity γ& is perpendicular to both ω2 and φ& .\nProblem 4\nConsider the rocking chair problem discussed earlier in the class. Plot qualitatively the\ntrajectories in the phase plane.\nx\nz\ny\n1 =\n.\n.\n.\n.\n.\nα\nφ\nγ\nω\nω\nω\nψ\nψ\nψ\nFigure by OCW."
    },
    {
      "category": "Resource",
      "title": "pss03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/9044f5826f099bc4a3400a817cfb6412_pss03.pdf",
      "content": "x\nz\ny\n.\n1 =\n.\n.\n.\n.\nα\nφ\nγ\nω\nω\nω\nψ\nψ\nψ\nFigure by OCW.\nAfter Problem 4-14 in Crandall, S. H., et al. Dynamics of Mechanical and Electromechanical Systems. Malabar, FL: Krieger, 1982."
    },
    {
      "category": "Resource",
      "title": "dyn4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/95f249368aeb0dd4e9fad4bc33d7c5eb_dyn4.pdf",
      "content": "2.032\nDYNAMICS\nFall 2004\nProblem Set No. 4\nOut: Wednesday, October 6, 2004\nDue: Wednesday, October 13, 2004 at the beginning of class\nProblem 1\nA rigid circular cylinder of radius a has a hole of radius 1\n2a cut out. Assume that the\ncylinder rolls without slipping on the floor.\n(i) Compute the kinetic energy and the potential energy of the cylinder using the\ngeneralized coordinate θ defined below.\n(ii) By suitably approximating the kinetic and potential energy expressions in (i),\ndeduce the frequency of small rocking oscillations of the cylinder about the equilibrium\nposition θ = 0.\n(iii) Use the potential to plot trajectories qualitatively on the (θ, θ) phase plane.\nθ\ng\na\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 2\nA billiard ball, initially at rest, is given a sharp impulse by a cue.\nThe cue is held\nhorizontally a distance h above the centerline. The ball leaves the cue with a speed v0 and\neventually acquires a final speed of 9\n7v0. Show that h = 4\n5R, where R is the radius of the\nball.\nProblem 3\nDetermine the principal centroidal moments of inertia for the following homogeneous bod-\nies:\n(a) a sphere of radius R,\n(b) a circular cone of height h and base radius R.\nProblem 4\n(adapted from Crandall et al., 4-14)\nThe uniform rod of length L and mass M is pivoted, without friction, to the shaft OA,\nwhich revolves in fixed bearings at the steady rate ω0. The rod is constrained to remain\nin a plane through OA which rotates with the shaft.\n(a) Formulate an equation of motion for θ(t).\n(b) For each value of ω0 there is at least one stationary angle θ0 which the rod can\nmaintain while steadily precessing at the rate ω0. Find all stationary configurations as\nfunctions of ω0.\nL\nM\nA\ng\nO\nθ\nω\nFigure by OCW. After Problem 4-14 in Crandall, S. H., et al. Dynamics of Mechanical and Electromechanical Systems. Malabar, FL: Krieger, 1982."
    },
    {
      "category": "Resource",
      "title": "pss04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/a23dfcaf93cdd81d93db09b5bf949da8_pss04.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "dyn5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/103ed8cdd11d18b286fee5f3c800d738_dyn5.pdf",
      "content": "2.032\nDYNAMICS\nFall 2004\nProblem Set No. 5\nOut: Wednesday, October 13, 2004\nDue: Wednesday, October 20, 2004 at the beginning of class\nProblem 1\nConsider the motion of a car, as shown in the figure below. (Out of the four wheels only\ntwo are visible.) The mass of the body of the car is m3, and each wheel has radius r and\nmass m. The coefficient of static friction is μ0 i.e., the tangential force between the wheel\nand the ground is never greater than μ0 times the normal force. The torque transmitted\nfrom the body of the car to the rear wheel set is M0.\n(a) Assuming pure rolling, use the work-energy principle to find the acceleration of\nthe car.\n(b) What is the largest M0 for which the car does not slip?\n\nProblem 2\n(adapted from PhD Qualifying Exam 2003)\nA circular ring of radius a is fixed to a vertical shaft AB at O. The plane of the ring\nis inclined at 60*to the vertical as shown below so that the included angle COB is 60*,\nwhere C is the center of the ring. A particle P of mass m is free to slide without friction\non the ring. The position of the particle is measured by the included angle OCP, denoted\nθ as shown. The shaft is driven at constant angular velocity Ω.\nFind in terms of θ and θ the velocity of P.\nA\nB\nΩ\nC\nP\nO\n60ο\nB\nA\nP\nC\na\nO\nθ\nΩ\nCourtesy of Prof. T. Akylas. Used with permission.\n\nProblem 3\n(adapted from Crandall et al., 4-20)\nA rigid cone with apex half angle α rolls steadily without slip on a horizontal surface so\nthat it precesses about the Z axis at a constant angular rate Ω. The cone has mass M\nand principal moments of inertia I1, I1, and I3 at the tip.\n(a) Determine the angular momentum of the cone.\n(b) What forces and torques are required to maintain this motion?\nFigure by OCW. After problem 4-20 in Crandall, S. H., et al. Dynamics of Mechanical and Electromechanical Systems. Malabar, FL: Krieger, 1982.\n\nProblem 4\nThe heavy disk of mass M and centroidal principal moments of inertia I1 = I2, I3 rolls\nwithout slipping in contact with the inclined plane, as shown below. A ball joint at O\nholds the end of the massless shaft in place. The shaft makes angle β with the inclined\nplane. Derive an expression for the kinetic energy of the disk.\nO\na\nb\nα\nC\nCourtesy of Prof. T. Akylas. Used with permission."
    },
    {
      "category": "Resource",
      "title": "pss05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/5c8465f71ec16903d1e779b3a2f69381_pss05.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz1_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/fc2b7e04796878bb2483b10f362aba99_quiz1_soln.pdf",
      "content": "z\nOuter\ngimbal\nInner\ngimbal\ne1\ne2\ne3\n.\n.\nω\nφ\nψ\nω\nθ\nFigure by OCW."
    },
    {
      "category": "Exam",
      "title": "quiz1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/7a690158da1d473781a6c3d4b391465b_quiz1.pdf",
      "content": "2.032\nDYNAMICS\nFall 2004\nQuiz No. 1\nMonday, October 25, 2004\nThis is a CLOSED-BOOK, open-notes Quiz.\nProblem 1\n(20 points)\nServomotors make the flywheel spin at a constant rate ω2, and also impose a vertical\nrotation rate ω1 that is a function of time (see figure below). The center of mass of the\nflywheel is located on the z axis, and the centroidal moments of inertia are I1 about the\nspin axis and I2 transverse to that axis.\n(a) Derive the equations of motion for the system.\n(b) Determine the external torques necessary to maintain the above motion.\nz\nOuter\ngimbal\nInner gimbal\nω\nθ\nω\nFigure by OCW.\n\nProblem 2\n(20 points)\nA solid uniform cylinder of mass m and radius R is placed on top of a fixed cylinder of\nthe same radius, and it is slightly tipped, as shown in the figure. Find the value of the\nangle θ at which sliding begins as a function of the static friction coefficient μ."
    },
    {
      "category": "Exam",
      "title": "quiz2_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/8f6b466fb95ee3b4d2bad0bee5203cee_quiz2_soln.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/1988f4a8f544775bf49cade7c0a4889a_quiz2.pdf",
      "content": "Fall 2004\n2.032 DYNAMICS\n\nQuiz No.2\n\nWednesday, December 8, 2004\n\nThis is a CLOSED-BOOK, Open notes Quiz.\n\nProblem 1 (20 points)\n\nTwo small masses, m1 and m2, are constrained to move in a vertical plane by two\ninextensible strings, as shown in figure 1. The lengths of the two strings are R and L = ρ\n+ r, respectively. There is a force of magnitude F acting on the mass m2, with its line of\nattack always parallel to the string attached to m2. The constant of gravity is g. The pulley\nshown in the figure is small and frictionless.\n\n(a) Classify all constraints and forces (give reasoning). Determine the number of\ndegrees of freedom.\n(b) Derive the Lagrangian equations of motion in terms of φ1 and φ2.\n\nL\nρ\nm1\nR\nφ1\nr\nm2\nF\nφ2\ng\nFigure 1\n\nProblem 2 (20 points)\n\nA disk of radius r and mass M is placed on a fixed tube of radius R, as shown in Figure 2.\nThe center of the disk is at a distance l from the ceiling and is attached to the ceiling\nthrough a spring of stiffness k1 and unstretched length l0. At the same time, a block of\nmass m is hanging from the center of the disk on a spring of stiffness k2 and unstretched\nlength l0. We assume that the disk cannot slip on the tube and the lower spring remains\nvertical on any motion of the system. The constant of gravity is g.\nWithout deriving equations of motion, find sufficient and necessary conditions\nfor the stability of the equilibrium shown in Fig. 2.\n\nr\n\nm\nR\nk2\nFigure 2\nl\nk1\ng"
    },
    {
      "category": "Resource",
      "title": "session_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/7f6d487397c19a0a831072fc45f3ce51_session_1.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/a8de03f9975d95792f263ad678cab325_session_2.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/b07422353ca38edc4a548dd6c523522d_session_3.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/61ededd0162923dcd521ac410afe854b_session_4.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/2afe2763cc1066c49a26c3682eceb2fb_session_5.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/8bb2f455e9c796edd7e57398c9b46a3a_session_6.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/f448dbceb480502ba767ba96937f4f33_session_7.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/2169caf3c80389065d40d2acb55c0b27_session_8.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/df8005adfbaf72862ff1e0d53478c68b_session_9.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "session_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-032-dynamics-fall-2004/dc3f59a32c27cc891e3ea168dc2882ca_session_10.pdf",
      "content": "Page 1 for this lecture is not available."
    }
  ]
}