{
  "course_name": "Dynamics of the Atmosphere",
  "course_description": "This course begins with a study of the role of dynamics in the general physics of the atmosphere, the consideration of the differences between modeling and approximation, and the observed large-scale phenomenology of the atmosphere. Only then are the basic equations derived in rigorous manner. The equations are then applied to important problems and methodologies in meteorology and climate, with discussions of the history of the topics where appropriate. Problems include the Hadley circulation and its role in the general circulation, atmospheric waves including gravity and Rossby waves and their interaction with the mean flow, with specific applications to the stratospheric quasi-biennial oscillation, tides, the super-rotation of Venus’ atmosphere, the generation of atmospheric turbulence, and stationary waves among other problems. The quasi-geostrophic approximation is derived, and the resulting equations are used to examine the hydrodynamic stability of the circulation with applications ranging from convective adjustment to climate.",
  "topics": [
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Geophysics",
    "Planetary Science",
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Geophysics",
    "Planetary Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n12.800, 18.03\n\nCourse Description\n\nThis course begins with a study of the role of dynamics in the general physics of the atmosphere, the consideration of the differences between modeling and approximation, and the observed large-scale phenomenology of the atmosphere. Only then are the basic equations derived in rigorous manner. The equations are then applied to important problems and methodologies in meteorology and climate, with discussions of the history of the topics where appropriate. Problems include the Hadley circulation and its role in the general circulation, atmospheric waves including gravity and Rossby waves and their interaction with the mean flow, with specific applications to the stratospheric quasi-biennial oscillation, tides, the super-rotation of Venus' atmosphere, the generation of atmospheric turbulence, and stationary waves among other problems. The quasi-geostrophic approximation is derived, and the resulting equations are used to examine the hydrodynamic stability of the circulation with applications ranging from convective adjustment to climate.\n\nLearning Objectives\n\nDevelop an understanding of atmospheric dynamics in the context of observed phenomena.\n\nDevelop the theory of the steady symmetric circulation (i.e., the Hadley Circulation) and its role in the general circulation.\n\nDevelop the theory of internal gravity waves in general basic states, and develop the theory for how these waves interact with the mean flow. Applications to specific phenomena are emphasized.\n\nIsolate the impact of rotation in a spherical atmosphere, derive the quasi-geostrophic approximation, and apply this approximation to the study of Rossby waves. Again, applications (including the nature of stationary disturbances) are emphasized.\n\nConsider the instabilities of the atmosphere in a generalized context wherein instabilities include all eddies that extract their energy from the mean flow. Examine the role of these eddies in climate.\n\nHomework\n\nThe course notes have 13 chapters, and at the end of each (except the first introductory chapter) are exercises that constitute the homework for the course. Solutions to the exercises are due within two weeks of the completion of each chapter in class. This homework is graded though the grades are weighted according to their difficulty. In addition, there is a take home final exam.\n\nGrades\n\nThe final grade is determined by the grade on the take home exam, though if the homework grades are better than the grade on the final exam, the final grade will be improved.",
  "files": [
    {
      "category": "Resource",
      "title": "homework_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/e45dbba87e9a9a9d93251635b945bb93_homework_1.pdf",
      "content": "Simple energy balance climate models\nExercises\n2.1 Let α = 0.45. Keep A and B as given in the text.\n1. Determine β such that T remains unchanged.\n2. Determine C for the above choices of α and β.\n3. Compute Q(xs).\n4. Discuss any differences between these results and those obtained\nfor α = .4, β = .7. In particular, how has the global stability\nchanged and why?\n2.2 Trace the behavior in Figure 2.4 to the various assumptions -- especially\nthe use of annual averages. Was it appropriate to replace annual means\nwith equinoctial values? How would matters have changed, had we\ncorrectly taken means?"
    },
    {
      "category": "Resource",
      "title": "homework_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/149c27f1d39471cb457a20738c4ecf19_homework_2.pdf",
      "content": "!\n\n!\n\n!\n\n!\nDynamics in Atmospheric Physics\nExercise\n3.1\nIn terms of our 4-box model, take p1 = 52mb, p2 = 27mb, p3 = 2mb,\nand L = 4000km. Let V = 1m/s. From Figure 3.1, reasonable winter\nchoices for ( ρ\nρ\ni )j are\nρi\n=\n8ppm\nρ\nρi\n=\n3ppm\nρ\nρi\n=\n1ppm\nρ\nρi\n=\n3.5ppm\nρ\nand from Figure 3.3 reasonable choices for αj are\nα1\n=\n7 10-7 sec-1\nα2\n=\n2 10-7 sec-1\nα3\n=\n1.5 10-8 sec-1\nα4\n=\n2.5 10-8 sec-1 .\nEvaluate φj (for j = 1, 2, 3, 4), and compare roughly with Figure 3.2.\nAlso evaluate 'column' densities. Discuss differences from the results in\nFigure 3.4. What happens to your answers when the sign of the large-\nscale flow is reversed? Fool around with different choices for the various\nα's. For example, what happens when you set α4 to 2 × 10-7 sec-1?\nHow would you 'engineer' the choices of α so as to best simulate the\nobservations? To what extent could this provide guidance with respect\nto the physics and chemistry?\n\nEffect of transport on composition\nFigure 3.7: 6-box model.\nNote that the bottom of the 4-box model is at 52mb which does not\ninclude the bulk of the lower region in Figure 3.2 where the reversal in\nthe meridional gradient of ozone occurs. Thus, the column densities are\nnot expected to replicate those in Figure 3.4. If, instead of our 4-box\nmodel, we had a 6-box model of the sort shown in Figure 3.7we could\nchoose the bottom to be at 100mb. Try to rig the properties of the 6\nboxes (while not choosing values which are too unrealistic) in order to\nmatch Figure 3.4. What is needed? Again, try to 'engineer' choices\nof parameters to achieve a best simulation. Discuss the limitations of\nthese models."
    },
    {
      "category": "Resource",
      "title": "homework_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/2ff7bcf7dad9073d38d92860380b9db6_homework_3.pdf",
      "content": "'Statics' of a rotating system\nExercises\nProblems on geostrophy and hydrostaticity are pretty much standard in any\ntext on dynamic meteorology. Exercises 4.1-6 here are from Houghton (1977);\nExercise 4.7 is from Holton (1979).\n4.1\nWhat is the pressure gradient required at the earth's surface at 45*\nlatitude to maintain a geostrophic wind velocity of 30 ms-1? What\ndoes this suggest about typical pressure gradients?\n4.2\nThe atmospheric surface pressure at radius r0 from the center of a\ntornado rotating with constant angular velocity ω is p0. Show that the\nsurface pressure at the center of the tornado is\nω2r0\n2 !\np0 exp\n-2RT\nwhen the temperature is assumed constant.\n4.3\nFigure 4.4a is a cross section of part of a front. At a certain level, the\nair possesses temperatures T2 and T1 (T2 > T1), respectively, on the\ntwo sides of the front, which has a slope of α relative to the horizontal.\nApply the hydrostatic\nequation and the geostrophic wind equation to the region AB, together\nwith the condition that the pressure must be continuous across the\nfrontal surface. Show that in equilibrium the components of velocity\nv2 and v1 in the y-direction on the two sides of the front satisfy the\nrelation\n(T1 -T2)g tan α = (v2T1 -v1T2)f.\nIf T2 -T1 = 3K and v1 -v2 = 10ms-1, find α. The slopes of typical\nfronts vary from around 1/50 to 1/300. Note that if f = 0, that is, the\nearth were not rotating, the sloping surface could not be in equilibrium.\n4.4 From the sense of the velocity change given by the above equation, show\nthat the kink in the isobars is always cyclonic (viz. Figure 4.4b).\n\nDynamics in Atmospheric Physics\nFigure 4.4: (a) Cross section through a front. (b) Warm sector of a typical depression\nshowing warm and cold fronts. After Houghton (1977).\n4.5\nThe wind at the surface is from the west. At cloud level it is from the\nsouth. Do you expect the temperature to rise or fall?\n4.6\nIf the pole is 40K colder than the equator and the surface wind is zero,\nwhat wind would you expect at the 200mb pressure level? Compare\nthe temperature and wind fields in Chapter 5, and show that they are\nroughly consistent with your result.\n4.7\nThe planet Venus rotates about its axis so slowly that to a reason\nable approximation the Coriolis parameter may be set equal to zero.\nFor steady, frictionless motion parallel to latitude circles Equation 4.3\nreduces to\nu2 tan φ\n1 ∂p\na\n= -ρ ∂y .\n\n'Statics' of a rotating system\nBy transforming this expression to isobaric coordinates show that the\nthermal wind equation in this case can be expressed in the form\n-R ln(p0/p1) ∂< T >\nωr\n2(p1) -ωr\n2(p0) = (a sin φ cos φ)\n∂y\n,\nwhere R is the gas constant, a is the radius of the planet, and ωr ≡\nu/(a cos φ) is the relative angular velocity.\nHow must < T > (the\nvertically averaged temperature) vary with respect to latitude in order\nthat ωr be a function only of height? If the zonal velocity at ' 60km\nheight above the equator (p1 = 2.9 × 105 Pa) is 100ms-1 and the zonal\nvelocity vanishes at the surface of the planet (p0 = 9.5×106 Pa) what is\nthe vertically averaged temperature difference between the equator and\npole assuming that ωr depends only on height? The planetary radius\nis a = 6100 km, and the gas constant is R = 187J kg-1 K-1 ."
    },
    {
      "category": "Resource",
      "title": "homework_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/04166fa20704878ed1f263bfac85f326_homework_4.pdf",
      "content": "Dynamics in Atmospheric Physics\nExercise\n5.1\nWith reference to Figures 5.1-5.14, note significant differences between\nthe Northern and Southern Hemispheres. Comment on these differ\nences where possible. Pay particular attention to Figure 5.12. Com\nment on the different patterns of seasonality.\n5.2\nIn order to study the relative roles of eddy amplitude and mean flow\nintensity in determining whether or not the eddies will produce closed\nstreamline contours, consider the following simple expression for the\nsuperposition of a simple eddy and a mean zonal flow:\nΦ(x, y) = Ay + B sin(kx) sin(ly)\nLet k = 2π/7000km, l = π/5000km. Use some program to plot con\ntours of constant F, and play with values of A and B to see when you\nget opened and closed contours. Try to choose A and B to reproduce\nwhat is seen in maps for 500mb.\n5.3\nUsing figure 5.11, plot the distribution of T with latitude for the 1000,\n700, 500 and 300mb pressure levels during December-February and\nJune-August. Note the Equator-to-Pole temperature difference at each\nlevel for Northern and Southern Hemisphere in Winter and Summer."
    },
    {
      "category": "Resource",
      "title": "homework_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/8ba9dd25bb929bcc8b749f8cc6f4dda2_homework_5.pdf",
      "content": "Dynamics in Atmospheric Physics\nExercises\n6.1 Evaluate dissipation for both molecular and eddy coefficients of viscosity.\nFor what length scales does each reach 1 degree C per day?"
    },
    {
      "category": "Resource",
      "title": "homework_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/6fb748787f694841d5276101864ff690_homework_6.pdf",
      "content": "R\nR\nDynamics in Atmospheric Physics\nExercises\n7.1\nCalculate uM (the distribution of u associated with constant M in\nEquation 7.22) as a function of φ for uM(0) = 0.\n7.2\nHide's theorem states that in a symmetric circulation a maximum in\nangular momentum can only exist at the surface in a region of surface\neasterlies. Moreover, the absolute maximum of angular momentum will\nbe M = Ωa2, the value associated with zero relative flow at the equator.\nUsing a similar derivation, what can be said about the existence of a\nminimum in angular momentum in a symmetric circulation?\n7.3 Will the simplified approach to calculating zonal wind given by Equa\ntions 7.29 and 7.46 necessarily yield adherence to Hide's theorem?\n7.4\nDerive the equations for the simple model of asymmetric Hadley circu\nlation.\n7.5\nTry to incorporate the possibility that the angular momentum in the\nupper, outward flow in the Hadley cells is characteristic of a broad\nupward flowing region as in Figure 7.6.\nThis exercise is fairly open ended, but it can be approached relatively\nsimply. Needless to say, I don't expect a truly analytic solution, but\none can get fairly far with relatively simple calculations. Let's focus\non the simpler, symmetric case.\nLet φm be the latitude separating\nrising streamlines from descending stream lines. Let the upper pole-\nward branch of the Hadley circulation consist in a well mixed bundle\nof streamlines, whose angular momentum is characteristic of the angu\nlar momentum of the streamlines that have risen up to the latitude in\nconsideration: i.e., for φ < φm,\nφ\nM(φ) cos φdφ\nMb(φ) ≈ 0\nφ\ncos φdφ\n\nR\nR\nSymmetric circulation models\nwhere Mb(φ) is the angular momentum of the upper bundle of stream\nlines, and M(φ) is the angular momentum of a streamline originating at\nthe surface at latitude φ. For simplicity, we assume that there are equal\nupdrafts per unit area throughout the upwelling region. For φ > φm,\nφm\nM(φ) cos φdφ\nMb(φ) ≈\n.\nφm\ncos φdφ\nThe above allow us to calculate U(H) and Θ as in the original argu\nment, and to evaluate φH and Θ(0). For purposes of estimation, we\nmight choose φm ≈0.5φH. One might have to do a bit of iteration in\norder to get everything to work out. At this stage, you might want\nto see how well you are replicating Figure 7.6, and discuss remaining\ndifferences.\nThe asymmetric case is treated similarly, but is more complicated be\ncause the changes wrought by considering the bundle of streamlines are\nmuch greater so that iteration becomes more cumbersome. However,\nthere is not too much trouble in estimating how much the easterlies will\nbe reduced at the equator, and how the surface winds will be changed.\nAs you play with the problem in the above fashion, you will develop a\nbetter idea of how to do the problem correctly,' but the above should\nsuffice for the homework."
    },
    {
      "category": "Resource",
      "title": "homework_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/cf21e2c2adf5fedcccaf2592a30eb3cb_homework_7.pdf",
      "content": "Internal Gravity Waves: Basics\nExercises\n1. Equation 8.56, when Q is constant and J = 0, has two solutions propor\ntional to eiQz and e-iQz, respectively. One corresponds to an upward\npropagating wave, while the other corresponds to a downward propa\ngating wave. Requiring that the solution consist only in the former as\nz\nconstitutes the radiation condition. Show how to determine\n→inf\nwhich solution is which.\n2. The following figure shows a characteristic profile for temperature for\nthe atmosphere up to the thermosphere. The second figure shows the\nsame profile, but only up to about 100 km. Use Equation 8.57 to obtain\nan analytic approximation to this temperature profile.\n\nDynamics in Atmospheric Physics\n3. Equation 8.56 can be viewed as an equation for the perturbation ver\ntical velocity in a boussinesq fluid. For Q2 constant, analytic solutions\nare trivially obtained. Let Q = 2π/15km, wB = 1, and J = 0. Let\nzT = 60km. For the upper boundary condition, consider both a rigid\nlid where wT = 0, and an unbounded fluid with a radiation condition\nwhere w ∝eiQz or dw/dz = iQw. Obtain analytic solutions for these\ncases, and run the numerical model as well. Determine what happens\nwhen resolution is inadequate in each case, and determine how much\nresolution is sufficient.\n4. Repeat the above with a rigid lid. From the analytic solution determine\nthe values of Q which produce resonance. Use the numerical model to\nexamine the impact of resolution on resonance.\n5. Repeat Problem 2 with wB = 0, the radiation condition at zT, and\nJ = exp(-((z -30 km)2/(12 km)2). Vary Q so that the ratio of the\nvertical wavelength to 12 km varies from about 0.2 to 5. Try to get\nan analytic solution, but even if you can't, run the numerical model\n(with adequate resolution) in order to see what happens to the wave\namplitude at zT."
    },
    {
      "category": "Resource",
      "title": "homework_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/cc4065d8c49f1d995dcee08e2da79f7a_homework_8.pdf",
      "content": "Internal Gravity Waves\nExercises\n9.1\nExplain why Pekeris' temperature profile 'worked.'\n9.2\nShow that Equation 9.23 with J = 0 and T0 = constant has a solution\nwhich satisfies Equation 9.25 when h = γH. This solution is called a\n'Lamb wave'. For a planar geometry where f = 0 and v0 = 0 (solution\nindependent of y; viz. Equations 9.26 and 9.27) show that the Lamb\nwave is a horizontally propagating acoustic wave.\nDiscuss how the\nequations in log -p coordinates, which formally look like the equations\nfor an incompressible fluid, can still have acoustic waves. Hint: The\nanswer lies in the lower boundary condition.\n9.3\nConsider a thermally forced oscillation (viz. Equation 9.23) where the\nforcing consists of a given energy oscillation over a thin layer of thick\nness Δz; that is,\nρJΔz = Q = constant.\nFor simplicity, let T0 = constant and let Δz\nV WL. If the forcing\nis centred at a height zf, show that the response everywhere increases\nexponentially with zf. How is this possible?\n9.4 In Equation 9.33, σ = Ω for the diurnal tide and σ = 2Ω for the semid\niurnal tide. At the equator f = 0 and k = s/a (a = radius of Earth),\nwhere s = 1 for the diurnal tide and s = 2 for the semidiurnal tide.\nFor the positive equivalent depths in Table 9.1 calculate `n from Equa\ntion 9.33 and compare your results with the Hough functions shown in\nFigures 9.27 and 9.28. For the negative equivalent depth modes take\nf = 2Ω sin 60* and k = 1/(a cos φ) = 1/(a cos 60*) and calculate the `ns\nfor the negative hns given in Table 9.1. Again, compare your results\nwith actual Hough functions. (N.B. These are local approximations, so\nyou should compare your results in the neighbourhood of 0* (or 60*)\nwith the Hough functions in the same neighborhood.)"
    },
    {
      "category": "Resource",
      "title": "homework_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/5b84345047a28a134b2007a1dd2eec47_homework_9.pdf",
      "content": "Variable Basic States\nExercises\n10.1 Rederive the vertical structure equation when there is linear damping\nin Equation 10.4 but not in Equation 10.1. Find the imaginary part of\nλ and compare with Equation 10.32. Note that thermal damping alone\ncan lead to momentum flux deposition in the mean flow.\nThe following problems call for the use of the numerical gravity wave model\ndescribed in Chapter 1.\n10.2 WKBJ solution versus numerical solution\nConsider the following zonal wind profile\nwith the basic state temperature constant. Approximate this profile\nanalytically as described in Chapter 8. Investigate the WKBJ versus\nnumerical solution for various choices of the Richardson number (recall\nRi = N2/U0\nz) and damping.\nAlso investigate the impact of corner\nsharpness.\nThe following are some suggested parameter choices: number of levels\n= 500; wbot = 1; cr = -20 m/s; ci = 0; T0 = 300*K; ztop = 30 km;\nz1 = 10 km; z2 = 20 km; and U1 = -10 m/s. Set interior forcing to\nzero, and use the radiation condition at the top. Choose values of U2\nthat will correspond to Richardson numbers of 0.4, 1.0, and 5.0.\n\nInternal Gravity waves\n10.3 Numerical resolution of critical lines\nSpecify the phase velocity (cr) such that there is a critical level some\nwhere in the domain. Investigate the numerical solution for various\nchoices of the damping rate and number of levels. It is suggested that\nyou try 1000 levels, with the profile and boundary conditions in Prob\nlem 10.2 that corresponded to Ri = 5. Try choices of ci that do and\ndon't permit damping to dominate over the numerically resolved dis\ntance (viz. Equation 10.31).\n10.4 Show that for internal gravity wave propagation, in the presence of\nsmall damping, that the attenuation of the wave in the direction of\npropagation depends exponentially on the ratio of the wave travel time,\nas determined by the group velocity in the direction of propagation, to\nthe characteristic damping time."
    },
    {
      "category": "Resource",
      "title": "homework_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/9b3a7cfedae1d98645c750865268d1be_homework_10.pdf",
      "content": "!\nRossby waves\nExercises\n11.1 Using scale analysis, determine under what conditions the β-plane is\nan acceptable approximation to the rotating sphere.\n11.2 Assess the accuracy of geostrophic balance for Rossby waves.\n11.3 For the parameters used in connection with stationary waves (i.e., the\nvalues of d, n = 0, k, f, and β - and taking h = 10.4 km) find that\nvalue of k for which σ (for Rossby waves) is a maximum.\n11.4 Write down the horizontal momentum equations for perturbations u0, v0, p0\nin a form applicable to an equational β-plane, that is, with f = βy.\nAssume a solution with v0 = 0, and\nu0 = Re{u0\n0 exp i(wt -kx)}.\nShow that in this case the amplitude u0\n0 varies with the latitude as\n-βy2k\nexp\n2ω\nNote that for a satisfactory solution k must be positive, that is, the\nwave must be eastward moving. Plot the pressure field associated with\nthe variation in zonal velocity u0. These are equatorial Kelvin waves;\nthey have been observed in the stratosphere."
    },
    {
      "category": "Resource",
      "title": "postscript.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/2d500c3114bf7bce6ce3c79a6d731859_postscript.pdf",
      "content": "Postscript\nThese notes end (as do many courses) rather abruptly. I hope to leave the\nreader with the sense that he or she has learned a lot. But, I would hardly\nwish to disguise the fact that we have barely begun the exploration of at\nmospheric dynamics. The nonlinear evolution and possible equilibration of\ninstabilities which should give us the wave and flux magnitudes has only been\ntouched on - both in these notes and in current research. A major current\napproach to questions of the general circulation - namely, the use of large\nnumerical computer simulations - has not even been discussed. Areas whose\nimpact on large-scale dynamics is almost certainly major - like boundary\nlayer turbulence and convective cloud activity - have likewise been only pe\nripherally dealt with in these notes. Although we have come quite far in im\nproving our understanding of many of the phenomena and features described\nin Chapter 5, we are still far from a satisfactory state, and, as we have earlier\nnoted, there exists a world of important and challenging phenomema whose\nscales are smaller than those discussed in Chapter 5: hurricanes, fronts, thun\nderstorms, squalls, to name a few. Even those topics that we have dealt with\nin some detail have hardly been dealt with in any measure of completeness.\nWhole books (in most cases several) and countless articles have been devoted\nspecifically to instability, wave theory, the general circulation, and even tides.\nThe shear scope of problems which fall under the general rubric of at\nmospheric dynamics is so great as to lead, unfortunately, but inevitably, to\na high degree of specialization. Certainly the individual problems are great\nenough to warrant focussed scrutiny - yet I hope that these notes have shown\nin a modest way how one problem often has important implications for other\nproblems. Familiarity with topics beyond one's immediate interests is almost\nalways helpful.\nFinally, it must be clear by now that the likelihood that a reasonable\nnumber of graduate courses will serve to thoroughly cover atmospheric dy\n\nDynamics in Atmospheric Physics\nnamics is highly unlikely. In this field, as in most others, learning must\neventually transcend what is taught."
    },
    {
      "category": "Resource",
      "title": "preface.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/f649f503f7e387d80de4efe1b6a75ecf_preface.pdf",
      "content": "x\nDynamics in Atmospheric Physics\nPreface\nThe following notes have been used in one form or another for over 20\nyears.\nI am making them available as a pdf file in order to better allow\nchanges and corrections to be made. Much has changed in 20 years, though\nthe basic aspects of dynamics remain basic. That said, dynamics itself has,\nin many places been deemphasized with respect to modeling. This is, in\nmy opinion, unfortunate. Dynamics is crucial as a framework for modeling.\nIt provides both fundamental insights into otherwise difficult to interpret\nbehavior, and, more generally, an interpretive context for modeling.\nAlthough the notes are meant to be self-contained and introductory,\nmany of the topics covered are somewhat advanced for an introductory\ncourse. There are several reasons why they have been included (and why\nother more traditional topics have been neglected). First, I feel that many\ntopics are considered 'advanced' or 'elementary' for historical reasons and\nnot because they are particularly difficult or easy. The topics I have included\ndo not call on especially advanced mathematical skills (relatively elementary\nfamiliarity with ordinary and partial differential equations and fourier series\nis expected); they are, moreover, topics which I believe to be basic to the\ncontemporary study of atmospheric dynamics (wave-mean flow interaction,\nfor example). Second, this course has, as a prerequisite, 12.800, which cov\ners much of the traditional introductory material. That said, the material\nin these notes is in many instances conceptually demanding, and students\nshould not feel discouraged if they have difficulty following it. Some topics\nmay require considerable effort.\nBecause most of the students have already been introduced to the equa\ntions of motion, I have adopted a somewhat unusual approach to the deriva\ntion of the equations in Chapter 6. The derivation (which was used by L.N.\nHoward in his 1960 Woods Hole Lectures on Geophysical Fluid Dynamics -\nlectures which helped to introduce me to this field) is, I believe, due to\nSerrin (1958), and, personally, I have always found it thought provoking as\nwell as elegant.\nThe fact that the equations of motion are not derived until Chapter 6\nis discussed in Chapter 1, the Introduction. Three of the early chapters (2,\n3, and 5) are meant to provide some motivation for the study of dynamics.\n\nxi\nChapter 2 offers a simple example of modeling (of the role of the ice-albedo\nfeedback in climate stability) wherein the role of dynamics is crucial but\nwhere the treatment of the dynamics is via parameterization. Chapter 3\nintroduces a very simple model for the distribution of ozone where, again,\ndynamics plays a remarkable role, and where this role can be identified with\nout detailed treatment of the dynamics. Chapter 5 deals with observations\n(much too briefly). Ultimately, the study of dynamical meteorology has to\nbe motivated by observed phenomena. Chapter 4 differs from the other 3\nchapters we have just discussed. It introduces some (essentially static) force\nbalances (namely, hydrostaticity and geostrophy) which are so intrinsic to\nthe subject that they are actually needed in order to discuss observations.\nOnly after describing the observations are the dynamical equations de\nrived. Apart from the above reasons for this ordering, I also feel that it\nserves to emphasize the important fact that atmospheric dynamics is not\nsimply the derivation and application of equations. Rather, one should be\ngin by thinking about nature itself. Consistent with this attitude, I have at\ntwo points in these notes (namely, in Chapter 7 on the Hadley circulation and\nin Chapter 10 on tides) devoted considerable attention to the history of the\nsubject. Hopefully, this will give the student some idea of the context within\nwhich certain questions were asked and certain solutions proposed. Stated\nsomewhat differently, some attempt is made to help the student understand\nwhy we attempt to solve the problems we do.\nIt should be stressed that this volume consists in lecture notes for a par\nticular course. As such, the material covered is limited by the time available\nfor that course; the notes are not meant to be a comprehensive text or ref\nerence. Although this version of the notes does not have an index, the table\nof contents is sufficiently detailed to permit the reader to find most topics\nquickly.\nFinally, I wish to thank the various students, secretaries, and colleagues\nwho have contributed to the preparation of these notes over the years."
    },
    {
      "category": "Resource",
      "title": "references.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/39e6bd1fb7632733e6c689e3b46a11b9_references.pdf",
      "content": "References\nThe numbers in square brackets at the end of each reference listing refer to\nthe chapters in the present volume where the reference is cited.\nAmayenc, P. (1974). Tidal oscillations of the meridional neutral wind at\nmidlatitudes. Radio Sci. 9, 281-93 [9].\nAndrews, D. G., J. R. Holton, and C. B. Leovy (1987). Middle Atmosphere\nDynamics. New York: Academic [5].\nBartels, J. (1928). Gezeitenschwingungen der Atmosph are. Handbuch der\nExperimentalphysik 25 (Geophysik 1), 163-210 [9].\nBenney, D. J., and R. F. Bergeron (1969). A new class of nonlinear waves\nin parallel flows. Studies Appl. Math. 48, 181-204 [10].\nBeyers, N. J., B. T. Miers, and R. J. Reed (1966). Diurnal tidal motions\nnear the stratopause during 48 hours at White Sands Missile Range.\nJ. Atmos. Sci. 23, 325-33 [9].\nBjerknes, V. (1937). Application of line integral theorems to the hydrody\nnamics of terrestrial and cosmic vortices. Astrophys. Norv. 2, 263-339\n[7].\nBooker, J. R. and F. B. Bretherton (1967). The critical layer for internal\ngravity waves in a shear flow. J. Fluid Mech. 27, 513-39 [10].\nBudyko, M. I. (1969). The effect of solar radiation variations on the climate\nof the earth. Tellus 21, 611-19 [2]\nButler, S. T., and K. A. Small (1963). The excitation of atmospheric oscil\nlations. Proc. Roy. Soc. A274, 91-121 [9].\n\nDynamics in Atmospheric Physics\nChapman, S. (1918). An example of the determination of a minute periodic\nvariation as illustrative of the law of errors.\nMonthly Notices Roy.\nAstron. Soc. 78, 635-8 [9].\nChapman, S. (1924). The semi-diurnal oscillation of the atmosphere. Quart.\nJ. Roy. Met. Soc. 50, 165-95 [9].\nChapman, S. (1951). Atmospheric tides and oscillations. In Compendium\nof Meteorology, Boston: American Meteorological Society 262-74. [9].\nChapman, S., and R. S. Lindzen (l970). Atmospheric Tides. Dordrecht:\nReidel [9].\nChapman, S., and K. C. Westfold (1956). A comparison of the annual mean\nsolar and lunar atmospheric tides in barometric pressure as regards\ntheir world-wide distribution of amplitude and phase. J. Atmos. Terr.\nPhys. 8, 1-23 [9].\nCharney, J. G. (1947). The dynamics of long waves in a baroclinic westerly\ncurrent. J. Meteorol. 4, 135-62 [13].\nCharney, J. G. (1948). On the scale of atmospheric motions. Geofys. Publ.\n17(2), 371-85 [12].\nCharney, J. G. (1973). Planetary fluid dynamics. In Dynamic Meteorology,\ned. P. Morel. Dordrecht: Reidel [5].\nCharney, J. G., and P. G. Drazin (1961). Propagation of planetary-scale\ndisturbances from the lower into the upper atmosphere. J. Geophys.\nRes. 66, 83-110 [11].\nCharney, J. G., and M. E. Stern (1962. On the instability of internal baro\nclinic jets in a rotating atmosphere. J. Atmos. Sci. 19, 169-82 [13]\nEady, E. T. (1949). Long waves and cyclone waves. Tellus 1, 33-52 [13].\nElford, W. G. (1959). A study of winds between 80 and 100 km in medium\nlatitudes. Planetary Space Sci. 1, 94-101 [9].\nEliassen, A., and E. Palm (1961). On the transfer of energy in stationary\nmountain waves. Geofysiske Publ. 22, 1-23 [8].\n\nReferences\nFarrell, B. (1987). On developing disturbances in shear. J. Atmos. Sci. 42,\n2191-9 [13].\nFels, S. B. (1986). Analytic representations of standard atmospheric tem\nperature profiles. J. Atmos. Sci. 43, 219-21 [8].\nFerrel, W. (1856). An essay on the winds and the currents of the ocean.\nNashville J. Medicine and Surgery 11, 287-301 [7].\nGill, A. E. (1982). Atmosphere-Ocean Dynamics. New York: Academic [1].\nGlass, M., and A. Spizzichino (1974). Waves in the lower thermosphere:\nrecent experimental investigation. J. Atmos. Terr. Phys. 36, 1825-39\n[9].\nGreen, J. S. A. (1970). Transfer properties of the large scale eddies and the\ngeneral circulation of the atmosphere. Q.J. Roy. Met. Soc. 96, 157-85\n[2].\nGreenhow, J. S., and E. L. Neufeld (1961). Winds in the upper atmosphere.\nQ. J. Roy. Met. Soc. 87, 472-89 [9].\nHadley, G. (1735). Concerning the cause of the general trade winds. Phil.\nTrans. 29, 58-62 [7].\nHarris, M. F., F. G. Finger, and S. Teweles (1962). Diurnal variations of\nwind, pressure and temperature in the troposphere and stratosphere\nover the Azores. J. Atmos. Sci. 19, 136-49 [9].\nHaurwitz, B. (1956). The geographical distribution of the solar semidiurnal\npressure oscillation. Meteorol. Pap. 2(5), New York University [9].\nHaurwitz, B. (1965). The diurnal surface pressure oscillation. Archiv. Me\nteorol. Geophys. Biokl. A14, 361-79 [9].\nHeld, I. M., and A. Y. Hou (1980). Nonlinear axially symmetric circulations\nin a nearly inviscid atmosphere. J. Atmos. Sci. 37, 515-33 [7].\nHeld, I. M., and M. J. Suarez (1974). Simple albedo feedback models of the\nicecaps. Tellus 26, 613-29 [2].\n\nDynamics in Atmospheric Physics\nHines, C. O. (1966). Diurnal tide in the upper atmosphere. J. Geophys.\nRes. 72, 1453-59 [9].\nHolton, J. R., (1979). An Introduction to Dynamic Meteorology. New York:\nAcademic [1,3,4,6,8,12,13].\nHolton, J. R., and R. S. Lindzen (l972). An updated theory for the quasi\nbiennial cycle of the tropical stratosphere. J. Atmos. Sci. 29, l076-80\n[10].\nHoughton, J. T. (1977). The Physics of the Atmosphere. Cambridge: Cam\nbridge University Press [1,3,4,6,8,12,13].\nHsu, H.-H., and B. J. Hoskins (1989). Tidal fluctuations as seen in ECMWF\ndata. Q. J. Roy. Met. Soc. 115, 247-64 [9].\nJacchia, L. G., and Z. Kopal (1951).\nAtmospheric oscillations and the\ntemperature of the upper atmosphere. J. Meteorol. 9, 13-23 [9].\nKato, S. (1966). Diurnal atmospheric oscillation, 1, eigenvalues and Hough\nfunctions. J. Geophys. Res. 71, 3201-9 [9].\nKelvin, Lord (Thomson, W.) (1882). On the thermodynamic acceleration\nof the earth's rotation. Proc. Roy. Soc. Edinb. 11, 396-405 [9].\nKelvin, Lord (Thomson, W.) (1887). Stability of fluid motion: rectilinear\nmotion of viscous fluid between two parallel planes. Phil. Mag. 24,\n188-96 [13].\nKertz, W. (1956).\nComponents of the Semidiurnal Pressure Oscillation.\nSci. Rept. 4, Dept. of Meteor. and Ocean., New York University [9].\nKuo, H.-L. (1949). Dynamic instabilty of two-dimensonal nondivergent flow\nin a barotropic atmosphere. J. Meteor. 6, 105-22 [13].\nLamb, H. (1910).\nOn atmospheric oscillations. Proc. Roy. Soc. A84,\n551-72 [9].\nLamb, H. (1916).\nHydrodynamics, 4th edition.\nCambridge: Cambridge\nUniversity Press [9].\n\nReferences\nLau, N.-C., and A. H. Oort (1981). A comparative study of observed North\nern Hemisphere circulation statistics based on GFDL and NMC anal\nyses. Part I. The time-mean fields. Mon. Wea. Rev. 109, 1380-403\n[5].\nLindzen, R. S. (l966). On the theory of the diurnal tide. Mon. Wea. Rev.\n94, 295-30l [9].\nLindzen, R. S. (l967a). Planetary waves on beta planes. Mon. Wea. Rev.\n95, 44l-5l [9].\nLindzen, R. S. (l967). Thermally driven diurnal tide in the atmosphere.\nQ.J. Roy. Met. Soc. 93, l8-42 [9].\nLindzen, R. S. (l968). The application of classical atmospheric tidal theory.\nProc. Roy. Soc. A 303, 299-3l6 [9].\nLindzen, R. S. (l97l). Equatorial planetary waves in shear: Part I. J. Atmos.\nSci. 28, 609-22 [10].\nLindzen, R. S. (l973). Wave-mean flow interaction in the upper atmosphere.\nBound. Lay. Met. 4, 327-43 [8].\nLindzen, R. S. (l974). Stability of a Helmholtz velocity profile in a contin\nuously stratified infinite Boussinesq fluid - applications to a clear air\nturbulence. J. Atmos. Sci. 31, l507-l4 [13].\nLindzen, R. S. (l978). Effect of daily variations of cumulonimbus activity\non the atmospheric semidiurnal tide. Mon. Wea. Rev. l06, 526-33 [9].\nLindzen, R. S. (l979). Atmospheric Tides. An. Rev. Earth & Plan. Sci. 7,\nl99-225 [9].\nLindzen, R. S. (1981). Turbulence and stress due to gravity wave and tidal\nbreakdown. J. Geophys. Res. 86, 9707-14 [10,13].\nLindzen, R. S. (1988a). Instability of plane parallel shear flow (Towards a\nmechanistic picture of how it works). PAGEOPH 16, 103-21 [13].\nLindzen, R. S. (1988b). Some remarks on cumulus parameterization. PA\nGEOPH 16, 123-35 [7].\n\nDynamics in Atmospheric Physics\nLindzen, R. S., and S. Chapman (l969). Atmospheric tides. Space. Sci.\nRevs. l0, 3-l88 [9].\nLindzen, R. S., and B. F. Farrell (l977). Some realistic modifications of\nsimple climate models. J. Atmos. Sci. 34, l487-50l [2].\nLindzen, R. S., and B. F. Farrell (1980). The role of polar regions in global\nclimate, and the parameterization of global heat transport. Mon. Wea.\nRev. 108, 2064-79 [14].\nLindzen, R. S., and J. R. Holton (l968). A theory of quasi-biennial oscilla\ntion. J. Atmos. Sci. 26, l095-l07 [10].\nLindzen, R. S., and S.-S. Hong, (l974). Effects of mean winds and hori\nzonal temperature gradients on solar and lunar diurnal tides in the\natmosphere. J. Atmos. Sci. 31, l421-46 [9].\nLindzen, R. S. and A. Y. Hou (1988). Hadley circulations for zonally av\neraged heating centered off the equator. J. Atmos. Sci. 45, 2416-27\n[7].\nLindzen, R. S. and A. Rosenthal (l976). On the instability of Helmholtz\nvelocity profiles in stably stratified fluids when a lower boundary is\npresent. J. Geophys. Res. 81, l56l-7l [13].\nLorenz, E. N. (1955). Available potential energy and the maintenance of\nthe general circulation. Tellus 7, 157-67 [13].\nLorenz, E. N. (1967). The Nature and Theory of the General Circulation of\nthe Atmosphere. World Meteorological Organization Monograph No.\n218, TP 115 [5,7].\nManabe, S. and R. F. Strickler (1965). Simulated climatology of a general\ncirculation model with a hydrologic cycle. Mon. Wea. Rev. 93, 769-98\n[14].\nManabe, S. and T. B. Terpstra (1974). The effects of mountains on the\ngeneral circulation of the atmosphere as identified by numerical exper\niments. J. Atmos. Sci. 31, 3-42 [13].\nMargules, M. (1890).\nUber die Schwingungen periodisch erwamter Luft.\nSitzber. Akad. Wiss. Wien, Abt. IIa 99, 204-27 [9].\n\nReferences\nMargules, M. (1892). Luftbewegungen in einer rotierenden Sph aroidschale.\nSitzber. Akad. Wiss. Wien, Abt. IIa 101, 597-626 [9].\nMargules, M. (1893). Luftbewegungen in einer rotierenden Sph aroidschale.\nSitzber. Akad. Wiss. Wien, Abt. IIa 102, 11-56; 1369-1421 [9].\nMargules, M. (1903). Uber die Energie der St\n\nurme. Jahrb. Zentralanst.\nMeteor., Wien 1-26. In English translation in Abbe, C. (1910). The\nMechanics of the Earth's Atmosphere, 3rd Coll., 533-95. DC: Smith\nsonian Inst. [14].\nMartyn, D. F. and O. O. Pulley (1936). The temperatures and contituents\nof the upper atmosphere. Proc. Roy. Soc. A154, 455-86 [9].\nNewell, R. E., J. W. Kidson, D. G. Vincent, and G. J. Boer (1972). The\nGeneral Circulation of the Tropical Atmosphere and Interactions with\nExtratropical Latitudes, Vol. 1. Cambridge, MA: M.I.T. Press [5].\nNorth, G. R. (1975). Theory of energy balance climate models. J. Atmos.\nSci. 32, 2033-43 [2].\nOort, A. H. (1978). Adequacy of the rawinsonde network for global circula\ntion studes tested through numerical model output. Mon. Wea. Rev.\n106, 174-95 [5].\nOort, A. H. (1983). Global Atmospheric Circulation Statistics, 1958-1973.\nNOAA Professional Paper 14, U.S. Government Printing Office [7].\nOort, A. H., and E. M. Rasmusson (1970). On the annual variation of the\nmonthly mean meridional circulation. Mon. Wea. Rev. 98, 423-42 [7]\nOrr, W. M. F. (1907). The stability or instability of the steady motions of\na perfect liquid and of a viscous liquid. Proc. Roy. Irish Acad. A27,\n9-138 [13].\nPalm en, E. and C. W. Newton (1967). Atmospheric Circulation Sysems.\nNew York: Academic [5].\nPedlosky, J. (1979). Geophysical Fluid Dynamics. New York: Springer-\nVerlag [1,11,12].\n\nDynamics in Atmospheric Physics\nPedlosky, J. (2003). Waves in the ocean and atmosphere. Berlin: Springer-\nVerlag [8-13].\nPekeris, C. L. (1937). Atmospheric oscillations. Proc. Roy. Soc. A158,\n650-71 [9].\nPhillips, N. A. (1954). Energy transformations and meridional circulations\nassociated with simple baroclinic waves in a two-level, quasigeostrophic\nmodel. Tellus 6, 273-86 [13].\nPlumb, R. A. (1977). The interaction of two internal waves with the mean\nflow. J. Atmos. Sci. 34, 1847-58 [10].\nPlumb, R. A., and A. D. McEwan (1978). The instability of a forced stand\ning wave in a viscous, stratified fluid: A laboratory analogue of the\nquasi-biennial oscillation. J. Atmos. Sci. 35, 1827-39 [10].\nRayleigh, 3rd Baron (Strutt, J. W.) (1890). On the vibrations of an atmo\nsphere. Phil. Mag. (5) 29, 173-80 [9].\nReed, R. J.,and D. G. Rogers (1962). The circulation of the tropical strato\nsphere in the years 1954-1960. J. Atmos. Sci. 19, 127-35 [5].\nReed, R. J. (1967). Semidiurnal tidal motions between 30 and 60 km. J.\nAtmos. Sci. 24, 315-7 [9].\nReed, R. J., J. L. Wolfe, and H. Nishimoto (1963). A spectral analysis of\nthe energetics of the stratospheric sudden warming of early 1957. J.\nAtmos. Sci. 20, 256-75 [5].\nReed, R. J., M. J. Oard, and Marya Sieminski (1969). A comparison of\nobserved and theoretical diurnal tidal motions between 30 and 60 km.\nMon. Wea. Rev. 97, 456-9 [9].\nSarachik, E. S. (1985). A simple theory for the vertical structure of the\ntropical atmosphere. PAGEOPH 123, 261-71 [7].\nSawada, R. (1956). The atmospheric lunar tides and the Temperature pro\nfile in the upper atmosphere. Geophys. Mag. 27, 213-36 [9].\n\nReferences\nSchneider, E. (1977). Axially symmetric steady state models of the basic\nstate of instability and climate studies. Part II: Nonlinear calculations.\nJ. Atmos. Sci. 34, 280-96 [7].\nSchneider, E., and R. S. Lindzen (1976), A discussion of the parameteriza\ntion of momentum exchange by cumulus convection. J. Geophys. Res.,\n81, 3158-60 [7].\nSchneider, E., and R. S. Lindzen (1977), Axially symmetric steady state\nmodels of the basic state of instability and climate studies. Part I:\nLinearized calculations. J. Atmos. Sci. 34, 253-79 [7].\nSellers, W. D. (1969). A global climatic model based on the energy balance\nof the earth-atmosphere system. J. Appl. Meteorol. 8, 392-400 [2].\nSerrin, J. (1959). Mathematical principles of classical fluid mechancs. In\nHandb. d. Physik 8(1), Str omungsmechanik I, Springer-Verlag, 125\n263 [6].\nSiebert, M. (1961). Atmospheric tides. Advances in Geophysics 7, 105-82\n[9].\nStone, P. H. (1973). The effect of large-scale eddies on climatic change. J.\nAtmos. Sci. 30, 521-9 [2].\nTaylor, G. I. (1932).\nThe resonance theory of semidiurnal atmospheric\noscillations. Mem. Roy. Meteorol. Soc. 4, 41-52 [9].\nTaylor, G. I. (1936). The oscillations of the atmosphere. Proc. Roy. Soc.\nA156, 318-26 [9].\nTheon, J. S., W. Nordberg, L. B. Katchen, and J. J. Horvath (1967). Some\nobservations on the thermal behavior of the mesosphere. J. Atmos.\nSci. 24, 428-38 [5,10]\nThomson, J. (1857). Grand currents of atmospheric circulation. British\nAssociation Meeting, Dublin [7].\nU.S. Standard Atmosphere Supplements (1966). Washington, DC: U.S. Gov\nernment Printing Office [2].\n\nDynamics in Atmospheric Physics\nWallace, J. M. (1973). General circulation of the tropical lower stratosphere.\nRev. Geophys. Space Phys. 11, 191-222 [5].\nWallace, J. M., and F. R. Hartranft (1969). Diurnal wind variations; surface\nto 30 km. Mon. Wea. Rev. 96, 446-55 [9].\nWallace, J. M., and V. E. Kousky (1968). Observational evidence of Kelvin\nwaves in the tropical stratosphere. J. Atmos. Sci. 25, 900-7 [5].\nWallace, J. M., and R. F. Tadd (1974). Some further results concerning\nthe vertical structure of atmospheric tidal motions within the lowest\n30 kilometers. Mon. Wea. Rev. 102, 795-803 [9].\nWilkes, M. V. (1949). Oscillations of the Earth's Atmosphere. Cambridge:\nCambridge University Press [9]."
    },
    {
      "category": "Resource",
      "title": "table_of_contnt.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/52070caf3bd11daf5cd9104e43b81499_table_of_contnt.pdf",
      "content": "Contents\nPreface\nx\nIntroductory remarks\nSimple energy balance climate models\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nEffect of transport on composition.\n3.1\nGeneral considerations . . . . . . . . . . . . . . . . . . . . . .\n3.1.1\nEquations of continuity . . . . . . . . . . . . . . . . . .\n3.2\n4-box transport model . . . . . . . . . . . . . . . . . . . . . .\nExercise . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n'Statics' of a rotating system\n4.1\nGeostrophy and hydrostaticity . . . . . . . . . . . . . . . . . .\n4.2\nScale height and thickness . . . . . . . . . . . . . . . . . . . .\n4.3\nThermal wind and pressure\ncoordinates\n. . . . . . . . . . . . . . . . . . . . . . . . . . . .\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nObserved atmospheric structures\n5.1\nGeneral remarks . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.2\nDaily and monthly maps . . . . . . . . . . . . . . . . . . . . .\n5.3\nZonal means . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.3.1\nSeasonal means . . . . . . . . . . . . . . . . . . . . . .\n5.3.2\nZonal inhomogeneity and rˆole of analysis . . . . . . . .\n5.3.3\nMiddle atmosphere . . . . . . . . . . . . . . . . . . . .\n5.3.4\nQuasi-biennial and semiannual oscillations . . . . . . .\nv\n\nvi\nDynamics in Atmospheric Physics\n5.3.5\nStratospheric sudden warmings\n. . . . . . . . . . . . .\n5.4\nShort period phenomena . . . . . . . . . . . . . . . . . . . . .\nEquations of motion\n6.1\nCoordinate systems and\nconservation . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6.2\nNewton's second law - for fluids\n. . . . . . . . . . . . . . . .\n6.3\nEnergy . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6.4\nK~ and σij . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6.5\nEquations of state . . . . . . . . . . . . . . . . . . . . . . . . . 100\n6.6\nRotating coordinate frame . . . . . . . . . . . . . . . . . . . . 101\n6.7\nSpherical coordinates . . . . . . . . . . . . . . . . . . . . . . . 103\n6.8\nScaling . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 104\n6.9\nHydrostaticity . . . . . . . . . . . . . . . . . . . . . . . . . . . 106\n6.10 Geostrophy\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . 108\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 108\nSymmetric circulation models\n7.1\nHistorical review\n. . . . . . . . . . . . . . . . . . . . . . . . . 110\n7.2\nHeld and Hou calculations . . . . . . . . . . . . . . . . . . . . 118\n7.2.1\nHide's theorem and its application\n. . . . . . . . . . . 120\n7.2.2\nSimplified calculations . . . . . . . . . . . . . . . . . . 123\n7.2.3\nComparison of simple and numerical results\n. . . . . . 130\n7.3\nSummary and difficulties . . . . . . . . . . . . . . . . . . . . . 132\n7.3.1\nRemarks on cumulus convection . . . . . . . . . . . . . 135\n7.3.2\nPreliminary summary . . . . . . . . . . . . . . . . . . . 135\n7.4\nAsymmetry about the equator . . . . . . . . . . . . . . . . . . 136\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 146\nInternal Gravity Waves: Basics\n8.1\nSome general remarks on waves . . . . . . . . . . . . . . . . . 150\n8.1.1\nGroup and signal velocity\n. . . . . . . . . . . . . . . . 150\n8.2\nHeuristic theory (no rotation) . . . . . . . . . . . . . . . . . . 152\n8.3\nLinearization\n. . . . . . . . . . . . . . . . . . . . . . . . . . . 156\n8.4\nEliassen-Palm theorems\n. . . . . . . . . . . . . . . . . . . . . 157\n8.4.1\nSuper-rotation of Venus' atmosphere\n. . . . . . . . . . 161\n8.5\nEnergy flux\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . 162\n8.6\nA remark about 'eddies' . . . . . . . . . . . . . . . . . . . . . 163\n\nContents\nvii\n8.7\nFormal mathematical treatment . . . . . . . . . . . . . . . . . 164\n8.7.1\nShallow water limit and internal modes . . . . . . . . . 167\n8.7.2\nEquivalent depth . . . . . . . . . . . . . . . . . . . . . 168\nEquivalent depths . . . . . . . . . . . . . . . . . . . . . . . . . 168\n8.8\nNumerical algorithm\n. . . . . . . . . . . . . . . . . . . . . . . 168\n8.8.1\nSpecifying Basic States . . . . . . . . . . . . . . . . . . 168\n8.8.2\nFinite Difference Approximations . . . . . . . . . . . . 169\n8.8.3\nNumerical Algorithm . . . . . . . . . . . . . . . . . . . 171\n8.8.4\nTesting the Algorithm\n. . . . . . . . . . . . . . . . . . 172\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 173\nAtmospheric tides\n9.1\nHistory and the 'scientific method'\n. . . . . . . . . . . . . . . 176\n9.2\nObservations . . . . . . . . . . . . . . . . . . . . . . . . . . . . 184\n9.3\nTheory . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 198\n9.3.1\nLaplace's tidal equation\n. . . . . . . . . . . . . . . . . 201\n9.3.2\nVertical structure equation . . . . . . . . . . . . . . . . 202\n9.3.3\nSimplified Laplace's tidal equation\n. . . . . . . . . . . 203\n9.3.4\nOverall procedure . . . . . . . . . . . . . . . . . . . . . 207\n9.3.5\nSemidiurnal and diurnal solutions - Hough functions\n. 208\n9.3.6\nLunar semidiurnal tide . . . . . . . . . . . . . . . . . . 215\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 216\n10 Variable Basic States\n(Variable Basic States)\n10.1 WKBJ analysis . . . . . . . . . . . . . . . . . . . . . . . . . . 217\n10.2 Critical level behavior\n. . . . . . . . . . . . . . . . . . . . . . 221\n10.2.1 Richardson number . . . . . . . . . . . . . . . . . . . . 222\n10.2.2 Conditions for absorption\n. . . . . . . . . . . . . . . . 224\n10.2.3 Linear and nonlinear limits . . . . . . . . . . . . . . . . 225\n10.3 Damping and momentum\ndeposition . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 227\n10.3.1 Violation of the second Eliassen-Palm\ntheorem . . . . . . . . . . . . . . . . . . . . . . . . . . 228\n10.4 Quasi-biennial oscillation . . . . . . . . . . . . . . . . . . . . . 229\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 231\n\nviii\nDynamics in Atmospheric Physics\n11 Rossby waves\n11.1 Shallow water equations\n. . . . . . . . . . . . . . . . . . . . . 233\n11.2 Rossby waves . . . . . . . . . . . . . . . . . . . . . . . . . . . 236\n11.2.1 Planetary scale internal stationary waves . . . . . . . . 239\n11.2.2 Free oscillations . . . . . . . . . . . . . . . . . . . . . . 240\n11.3 Remark on Kelvin waves: The case of v0 ≡0. . . . . . . . . . . 241\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 243\n12 Vorticity and quasi-geostrophy\n12.1 Preliminary remarks\n. . . . . . . . . . . . . . . . . . . . . . . 245\n12.1.1 Interpretation of vorticity\n. . . . . . . . . . . . . . . . 245\n12.2 Vorticity in Shallow Water . . . . . . . . . . . . . . . . . . . . 247\n12.2.1 Filtered Rossby waves\n. . . . . . . . . . . . . . . . . . 249\n12.3 Quasi-geostrophic shallow\nwater theory . . . . . . . . . . . . . . . . . . . . . . . . . . . . 251\n12.3.1 Rossby radius . . . . . . . . . . . . . . . . . . . . . . . 254\n12.3.2 Rossby number expansion\n. . . . . . . . . . . . . . . . 254\n12.4 Quasi-geostrophy in a stratified,\ncompressible atmosphere . . . . . . . . . . . . . . . . . . . . . 256\n12.4.1 Pseudo potential vorticity . . . . . . . . . . . . . . . . 259\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 260\n13 The generation of eddies by instability\n13.1 Remarks . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 261\n13.2 Instability . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 262\n13.2.1 Buoyant convection . . . . . . . . . . . . . . . . . . . . 263\n13.2.2 Rayleigh-Benard instability . . . . . . . . . . . . . . . 264\n13.2.3 Convective adjustment and gravity wave breaking . . . 265\n13.2.4 Reversal of mesopause temperature\ngradient . . . . . . . . . . . . . . . . . . . . . . . . . . 266\n13.2.5 Kelvin-Helmholtz instability . . . . . . . . . . . . . . . 266\n13.2.6 Radiating and growing solutions . . . . . . . . . . . . . 268\n13.3 Instability of meteorological\ndisturbances; baroclinic and\nbarotropic instability . . . . . . . . . . . . . . . . . . . . . . . 269\n13.3.1 A necessary condition for instability . . . . . . . . . . . 272\n13.4 The Kelvin-Orr mechanism . . . . . . . . . . . . . . . . . . . . 275\n13.5 Two-level baroclinic model . . . . . . . . . . . . . . . . . . . . 280\n\nContents\nix\n13.6 Climate\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 284\n13.7 Geometric stabilization . . . . . . . . . . . . . . . . . . . . . . 288\n13.8 Energetics of meteorological\ndisturbances . . . . . . . . . . . . . . . . . . . . . . . . . . . . 289\n13.9 Available potential energy . . . . . . . . . . . . . . . . . . . . 294\n13.10Some things about energy to think about . . . . . . . . . . . . 297\nExercises . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 299\nPostscript\nReferences"
    },
    {
      "category": "Resource",
      "title": "chapter_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/98dffb6b886e4adb3350048f9e5408ac_chapter_1.pdf",
      "content": "Chapter 1\nIntroductory remarks\nMotion is manifest in the atmosphere in an almost infinite variety of ways\nincluding wind chill factors, anomalously cold winters, summer droughts, and\nso forth. We shall in these lectures somewhat loosely distinguish between mo\ntion systems themselves and the things motion systems do. A motion system\nwill be defined by the distributions in space and time of velocity, ~v; mean\ndensity, ρ; pressure, p; temperature, T ; and constituent densities, ρi. Exam\nples of what we will consider to be motion systems are cyclonic storms and\nstationary planetary scale patterns. The latter are intimately associated with\nanomalous seasonal weather patterns. Examples of things motion systems\ndo are the reduction of the pole-equator temperature differences to about\nhalf of what would be expected from purely radiative considerations, and the\ncreation of maximum column densities of ozone at high latitudes rather than\nin the tropics as would have been expected on the basis of photochemical\nequilibrium.\nIn attempting to discuss this topic in one semester, there is no hope of\ncompleteness. Moreover, any attempt to begin at the beginning will barely\ntranscend the beginning itself. Although some background in hydrodynamics\nis helpful, these lectures are formally self-contained. Also, from the begin\nning, we will deal with the integration of dynamics with other components of\natmospheric physics. Clearly, these lectures cannot be comprehensive. The\nuse of additional references (Houghton, 1977, Holton, 2004, Pedlosky, 1987,\nand Gill, 1982, Pedlosky, 2003) will be helpful though not essential.\nWe will begin these lectures by considering the rˆole of dynamics in several\nproblems where this rˆole can be established without detailed reference to the\ndynamics. The problems we will study are:\n\nDynamics in Atmospheric Physics\n1. The rˆole of dynamics in simple climate models; and\n2. The rˆole of dynamics in determining the distribution of chemically ac\ntive minor constituents.\nHaving demonstrated the importance of dynamics in the behavior of the\natmosphere, we will turn to the motions themselves. The observations will\nbe reviewed with primary, but not exclusive, emphasis on specific motion\nsystems rather than on measurement techniques and problems - though these\nissues will, of necessity, be referred to.\nFinally, we will turn to the development and use of the equations of\nmotion. It will be in these lectures that the text material will prove most\nuseful. Our emphasis will not be on the multitude of interesting (and less\ninteresting) properties of the equations themselves, but on the use of what\nthe equations tell us in order to understand various phenomena. Among the\nphenomena we will discuss are:\n1. The global distribution of surface easterly and westerly winds;\n2. Gravity waves and turbulence in the upper atmosphere;\n3. Atmospheric tides;\n4. The quasi-biennial oscillation of the stratosphere;\n5. Travelling and stationary weather systems;\nDon't worry if some of the above terms are unfamiliar to you. They will be\nexplained in the remainder of these notes.\nThe above discussions will emphasize physical concepts, with the hope\nthat interested students will delve further into the solution details (insofar\nas they exist). Finally, formal problems are set at the end of each chapter,\nand informal questions are proposed throughout the text. Dealing with both\nis integral to learning the material.\nIt should be noticed that the next four chapters do not even use the\nequations of motion. These are not, in fact, introduced until Chapter 6 -\nfollowing the discussion of observations in Chapter 5.\nSome hydrostatics\nrelevant to the atmosphere are introduced in Chapter 4, because they are\nessential to the discussion of observations. Chapters 2 and 3 deal with two\nproblems where dynamics is essential, but where the rˆole of dynamics can\n\nIntroductory remarks\nbe delineated without specific reference to details. The hope in introducing\nthe subject in this manner is to avoid the notion that dynamic meteorology\nis simply the derivation of equations and their subsequent solution. Rather,\nas the title of these notes suggests, dynamics is a central part (but still only\na part) of the total physics of the atmosphere.\nFinally, I hope, through this book, to communicate the obvious fact that\ndynamic meteorology is not so much a body of canonical results, but rather\nan active research field in a state of flux."
    },
    {
      "category": "Resource",
      "title": "chapter_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/52ad6fc3efcf862db8533ae52db01174_chapter_2.pdf",
      "content": "Chapter 2\nSimple energy balance climate\nmodels\nSupplemental reading:1\nBudyko (1969)\nHeld and Suarez (1974)\nLindzen and Farrell (1977)\nNorth (1975)\nSellers (1969)\nMy initial purpose in beginning with an energy balance climate model was\nto provide a simple model wherein the interactions of radiation (including\nthe effect of snow on albedo) and dynamic heat transport could be consid\nered. The above references mostly date back to the period where there was\nconcern over global cooling and the possibility of a new ice age. In the above\nreferences some attempt is made to justify the realism of the models. This is\ncertainly worth thinking about; however, as we will see, most of the attempts\namounted to little more than special pleading. Given the current popularity\nof global warming rather than global cooling, one might have thought that\n1A complete list of references is given at the end of this book. Those references that\nare particularly useful to a given chapter are listed at the beginning of that chapter.\nSometimes specific pages and/or chapters will be noted.\n\nDynamics in Atmospheric Physics\nthis model would have been largely forgotten. However, it has returned to\nsome popularity in connection with the debate over whether there were pe\nriods when the earth was totally ice covered (the so-called snowball earth\n). In this chapter, we will not discuss such matters in detail, since we are\nprimarily concerned with the illustrative aspects of this model rather than\ndetailed realism.\nAs far as this chapter is concerned, there are two major points to this\nexercise:\n1. To 'invent' a model which illustrates the impact of dynamic transport\non climate, and\n2. To consider the impact of seemingly innocent modeling assumptions.\nThis inevitably leads to a consideration of broader issues concerned with\nmodeling, and, in particular, with the profound difference between model\ning and approximation. Over the years, I have noticed that students often\nrespond to this exercise by attaching undue credibility to this model, and\nquickly fall into the trap of discussing the model output in terms of nature.\nIf such a trivial model can provoke such a response, there can be little surprise\nat the temptation to treat more complex models in a similar manner.\nThe specific models that we will work with are typically characterized\nas follows:\n1. Only latitude dependences are considered; that is, the models are spa\ntially one-dimensional (though time dependence is also sometimes con\nsidered).\n2. Global energy budgets are assumed to be expressible in terms of surface\ntemperatures.\n3. Planetary albedo is taken to depend primarily on ice and/or snow cover\nor the lack thereof.\n4. The convergence of dynamic heat fluxes is generally represented by\neither a simple diffusion law or by a linear heating law wherein local\nheating is proportional to deviations of the global mean temperature\nfrom the local surface temperature. The primary feature of the heat\ntransport is that it carries heat from warmer to colder regions. Both of\nthe above representations do this.\n\nSimple energy balance climate models\n5. Generally, only annual mean conditions are considered, although some\ntimes annual mean conditions are replace by equinoctial conditions.\n(It is worth pointing out, in passing, that all of the above modeling as\nsumptions are actually incorrect.) The starting point for such models is an\nequation of the form\n∂T (x, t)\nC\n=\nincoming solar radiation\n∂t\n-infrared cooling\n-divergence of heat flux,\n(2.1)\nwhere C is some heat capacity of the atmosphere-ocean system, T the surface\ntemperature (*C), t is time, and x = sin θ, where θ is the latitude. It is\nsomewhat more convenient to deal with x rather than θ.\nUnder the assumption that the total global energy budget can be ex\npressed in terms of the surface temperature, the first term on the right-hand\nside of Equation 2.1 is generally taken to be the total insolation as might be\ndetermined by a satellite above the atmosphere. It is typically written as\nincoming solar radiation = Qs(x)A(T ),\n(2.2)\nwhere Q is one quarter of the solar constant (Why?) and s(x) is a function\nwhose integral from the equator to the pole is unity and which represents the\nannually averaged latitude distribution of incoming radiation. This function\nis discussed in Held and Suarez (1974). Finally, A(T ) is 1 minus the planetary\nalbedo; A is allowed to depend on temperature.\nIn most simple climate\nmodels, a temperature Ts is identified with the onset of ice (snow) cover such\nthat for T > Ts there is no ice (snow), and for T < Ts there is. The most\nimportant change in A, in these models, is due to T passing through Ts. We\nwill specify A more explicitly later.\nAgain under the assumption that global energy budgets can be expressed\nin terms of surface temperature, one writes\ninfrared cooling = I(T ).\n(2.3)\nThe justification for Equation 2.3 is that temperature profiles have more\n\nDynamics in Atmospheric Physics\nor less the same shape at all latitudes. Hence cooling, which depends on\nthe temperature at all levels, ought to be expressible in terms of surface\ntemperature, since the temperature at all levels is related to the surface\ntemperature. In fact, temperature profiles at different latitudes are somewhat\ndifferent (viz. Figure 2.1). In principle, there would also need to be similarity\nwith latitude for water vapor, and that is certainly far from being satisfied.\nFigure 2.1: Vertical temperature profiles for various latitudes. (From U.S. Standard\nAtmosphere Supplements, 1966.\n\nSimple energy balance climate models\nMoreover, Held and Suarez (1974) have shown that 500mb temperatures\ncorrelate better with infrared emission than do surface temperatures. Nev\nertheless, it is the surface temperature which relates to the formation of ice,\nand which therefore must be used in simple climate models. (Note that such\ncompromises with the underlying physics in order that the resulting model\ndoes what we want it to do are not uncommon. Almost all parameterizations\nfall into this situation to some extent.) The fact that total infrared emission\nis not perfectly related to surface temperature is merely an indication that\na significant portion of the emitted radiation originates in the atmosphere\n(What is the reason for this?). Similarly, not all of the incoming radiation\nis absorbed at the surface; in practice, some of the incoming radiation is not\ndirectly involved in the surface energy budget.\nAs a rule, models based on Equation 2.1 take little account of clouds and\ncloud feedbacks. In truth we hardly know how to include such feedbacks. It\nis probably impossible in such a simple model. However, to the extent that\nclouds can be specified in terms of latitude and surface temperature, their\neffects on incoming radiation and on infrared emission can be included in\nEquations 2.2 and 2.3. In reality, this is almost certainly a bad approxima\ntion. Consider, for example, the difference in cloud cover between summer\nand winter; they are quite similar.\nThe divergence of atmospheric and oceanic heat flux must also be ex\npressed in terms of an operator on surface temperature; that is,\ndiv flux = -F [T ],\n(2.4)\nwhere F is some operator. Usually F is a linear operator, although Held and\nSuarez (1974) and North (1975) have also considered nonlinear operators as\nsuggested by Green (1970) and Stone (1973). The common choices for F [T ]\nare a linear relation first suggested by Budyko (1969):\n\nF [T ] = C (T -T ),\n(2.5)\nwhere T is the average of T over all latitudes2, and a diffusion law (first used\nin this context by Sellers (1969)):\n2A general constraint on F [T ] is that its integral over the globe be zero (Why?).\n\n\"\n#\n'\nDynamics in Atmospheric Physics\n∂\n∂T\nF [T ] =\n(1 -x 2)D\n,\n(2.6)\n∂x\n∂x\nwhere C and D in (2.5) and (2.6) are constants; they are generally chosen to\nsimulate some features of the existing climate.\nThe most common application of (2.1) involves assuming a steady state\nand seeking a relation between the equilibrium position of the ice line and\nthe solar constant. Usually, one linearizes (2.3) to obtain\nI = A + BT,\n(2.7)\nand replaces T by I as defined in (2.7). Equation 2.1 becomes3\nQs(x)A(I) -I + F ∗[I] = 0.\n(2.8)\nOne identifies the ice line with a temperature Ts, or equivalently Is = A+BTs.\nWe shall use xs to identify the value of x at I = Is. Moreover, variations in\nA are taken to be due solely to whether or not there is an ice surface, that\nis,\nA = A(x, xs).\n(2.9)\n'C' or 'D' in (2.4) will be chosen so that for the present climate T = Ts at\nthe present annually averaged value of xs (i.e., xs\n0.95). Obtaining the\ndependence of xs on Q (or more conveniently, the dependence of Q on xs) is\nstraightforward. If we write\nI = QI (x),\n(2.10)\nand assume F to be a linear operator, then we may divide (2.8) by Q, yielding\n-F ∗[I ] + I = s(x)A(x, xs).\n(2.11)\nFor any choice of xs we may solve (2.11) for I = I (x, xs). It is now a trivial\n3F ∗ ≡1 F\nB\n\nSimple energy balance climate models\nmatter to obtain the solar constant (or, equivalently, Q) as a function of xs.\nWe already have\nI(xs) = Is.\n(2.12)\nBut since\nI(xs) = I (xs, xs)Q,\n(2.13)\nby combining (2.12) and (2.13) we have\nQ\n=\n,\n(2.14)\nIs\nI (xs, xs)\nwhich is the desired relation.\nNormally, we expect advancing ice (decreasing xs) to be associated with\ndecreasing Q. Such a situation is generally stable in the sense that the time\ndependent version (2.1) indicates that perturbations away from the equilibria\ndefined by (2.14) decay in time. This stability is easy to understand intu\nitively. If, for example, one decreased xs while holding Q constant, then Q\nwould be larger than needed for that value of xs and the resulting warming\nwould cause xs to increase. This is, in fact, the situation when we do not\nhave transport. Surprisingly, the introduction of transport always leads to\nsome values of xs where decreasing xs is associated with increasing Q - an\nunstable situation leading to an ice covered earth (at least in the context of\nthe simple model).\nWe shall examine how this occurs under particularly simple conditions.\nFirst we shall use (2.5) for F [T ]. Next we shall take the following expression\nfor A:\nA\n=\nα for T < Ts\n(2.15)\nA\n=\nβ for T > Ts.\nCommon choices for α and β are:\n\nDynamics in Atmospheric Physics\nα =\n0.4\n(2.16)\nβ =\n0.7.\n(Note, that by letting there be a discrete jump in A at the latitude where\nT = Ts, we have implicitly replaced the annual mean with something like a\npermanent equinox. Why?) For Ts we, for the moment, take Ts = -10*C,\nand for the constants A and B in (2.7) we use A = 211.1 Wm-2, and B =\n1.55 Wm-2( *C)-1 . Hence, Is = 195.7 Wm-2 . For s(x) we use the annual\naverage function as approximated by North (1975):\ns(x) ≈ 1 -0.241(3x 2 -1).\n(2.17)\nFor the present solar constant,\nQ = 344 Wm-2 .\nFor the above choices, straightforward analytic solutions exist. Let us begin\nby neglecting all transport. Equation 2.8 becomes\nQs(x)A(x, xs) -A -BT = 0,\nor\nT = Qs(x)A(x, xs) -A.\n(2.18)\nB\nThis radiative equilibrium value of T depends only on the local radiative\nbudget. Its distribution is shown in Figure 2.2 as is the observed distribution.\nNote that the observed gradients are much smaller than in the equi\nlibrium distribution. The value of Q associated with xs is not unique. Any\nvalue of Q less than the value needed for T (xs) = Ts with A = α, and greater\nthan the value needed for T (xs) = Ts with A = β, is consistent with xs. This\nleads to the two curves for Q(xs) shown in Figure 2.3:\n\nSimple energy balance climate models\nFigure 2.2:\nT (φ) for radiative equilibrium.\nAlso shown is the observed T (φ).\nFor\nreference purposes, x as well as φ is shown. Taken from Lindzen and Farrell (1977).\n\nDynamics in Atmospheric Physics\nA + BTs\nQ+(xs)\n=\n,\n(2.19)\ns(xs)α\nA + BTs\nQ (xs)\n=\n.\n(2.20)\n-\ns(xs)β\nIt will be left to the student to figure out how xs will vary as Q is changed,\nbut it is evident that for both (2.19) and (2.20) that decreasing Q leads to\ndecreasing xs and vice versa. (Note that s(xs) decreases monotonically with\nxs.)\nFigure 2.3: Variation of q (q ≡Q/Is) vs. θs (sin-1 xs) for radiative equilibrium. The\ncurve q- represents T = Ts for the ice-free side of xs, while q+ represents T = Ts for\nthe ice-covered side of xs. Also shown is the curve obtained with a very small amount of\ndiffusive heat transport. From Held and Suarez (1974).\nIntroducing transport via Equation 2.5 does not eliminate the ambiguity\nin Q. A device for eliminating the ambiguity is to choose\n\nSimple energy balance climate models\nα + β\nA(xs) =\n.\n(2.21)\nThis device turns out to be almost equivalent to introducing a very small\nconductivity which, in turn, renders T continuous at xs (viz Figure 2.3).\nNow\n\nF (I ) = (C/B)( I -I)\n(2.22)\nand\nZ 1\nI =\ns(x) A(x, xs) dx\n(2.23)\n(Why?).\nEvaluating (2.23) (using (2.15) and (2.17)) we get\nI = (β -α)(1.241 xs -.241 x 3) + α.\n(2.24)\ns\nSubstituting (2.24) into (2.22), and (2.22) in (2.11), we get\nC\nI = BI(xs) + s(x\nC\n) A(x, xs) .\n(2.25)\n1 + B\nEquation 2.25 allows us to determine C such that I (.95) = I s for present\nconditions (C/B = 2.45 is obtained). Assuming this value of C remains\nconstant as Q varies, we then get from (2.14)\n(1 + C )(A + BTs)\nQ = C\nB\n.\n(2.26)\nI(xs) + s(xs)( α+β)\nB\nExamining the denominator of (2.26) in detail we get\nβ + α\nC\nden\n=\n× 1.241 + α\nB\nC\n+\n(β -α) × 1.241 xs\nB\n(β + α)\nC\n-\n× .723 xs\n2 -B (β -α) × .241 xs\n3 .\n(2.27)\n\nDynamics in Atmospheric Physics\nWhen C = 0, the denominator decreases as xs increases, as already noted.\nBut, when C = 0, there always exists some neighbourhood of xs = 0 where\nthe linear term in (2.27) dominates, and the denominator increases as xs\nincreases. This leads to the distribution of Q versus xs shown in Figure 2.4.\nFigure 2.4: Equilibrium ice line position xs as a function of normalized solar constant\nQ/Q0 (where Q0 is the current value of the solar constant) when Budyko-type heat trans\nport is used. The curve Q-/Q0 corresponds to T = Ts on the equatorward side of the\nice line, while Q+/Q0 corresponds to T = Ts on the poleward side. The single remaining\ncurve results from adding a small amount of diffusion to the Budyko-type transport.\nTwo features should be noted in Figure 2.4, both being due to the exis\ntence of horizontal heat transport:\n1. A much smaller value of Q is needed for ice/snow to onset at all. This\nrepresents the stabilizing effect of transport.\n2. There now exists some minimum Q, below which the climate will un\nstably proceed to an ice/snow covered earth. This represents the desta\nbilizing effect of transport.\nBoth the above effects result very generally from the sharing of heat\nbetween low and high latitudes. Clearly, heat transport from low latitudes\ninitially inhibits the onset of ice/snow at the poles. However, as the ice/snow\nline advances, the transport of heat out of warmer regions cools these regions\n\nSimple energy balance climate models\nto such an extent that Q must actually be increased to keep up with further\nadvances. This situation is clearly unstable. We shall refer to the percentage\nQ must be reduced from its present value to reach instability as the 'global\nstability'. The results in Figure 2.4 correspond to a global stability of only\n∼2%. To be sure, the solar constant might not vary this much. However, Q\ncan be viewed as a general measure of global heating. Changes in Q can be\nsimulated by changes in I and/or A, for example.\nAs will be seen in the exercise, the above estimate of global stability is\nhardly firm (even in the context of this model), but our only interest at this\npoint is in the general rˆole of heat transport."
    },
    {
      "category": "Resource",
      "title": "chapter_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/150705fe5687cdbf16e8dfe3f82329ed_chapter_3.pdf",
      "content": "Chapter 3\nEffect of transport on\ncomposition.\nSupplemental Reading:\nHolton (1979), pp. 40-4\nHoughton (1977), pp. 81-2, 55-8\n3.1\nGeneral considerations\nIn this chapter, we once again turn to a simple model. However, here we will\nbe closer to an approximation than we were in the previous chapter. The\nmodel here will provide greater scope to engage in simulating observations.\nIt also provides an example of how a model can, indeed, offer insights into\nthe physics.\nConsider a chemical constituent, i, with density ρi(z, θ) and a photo\nchemical equilibrium distribution ρi(z, θ). Let us consider an idealized situ\nation where, in the absence of transport,\n∂ρi = α(z, θ)(ρi(z, θ) -ρi(z, θ)),\n(3.1)\n∂t\nwhere z is altitude and θ is latitude. Equation 3.1 may be considered as a\nhighly idealized description of ozone.\n\nDynamics in Atmospheric Physics\nFigure 3.1: Photochemical equilibrium distributions of ozone mixing ratio with pressure\nat various latitudes for winter and summer. Note that this and the following three figures\nwere prepared by S. Wofsy in 1980. They are not state of the art calculations; this doesn't\nparticularly matter for the crude arguments of this chapter.\n\nEffect of transport on composition\nFigure 3.2: Observed distributions of ozone mixing ratio with pressure at various lati\ntudes for winter and summer.\n\nDynamics in Atmospheric Physics\nFigure 3.3: Photochemical relaxation rate for ozone as a function of pressure for various\nlatitudes. This rate is estimated by differentiating the difference between ozone loss and\nproduction with respect to changes in ozone.\n\nEffect of transport on composition\nFigure 3.1 shows the distribution of ρi(z, θ) (for ozone); Figure 3.2 shows\nthe observed distribution; Figure 3.3 shows the photochemical relaxation\ntime (α-1). A comparison of Figures 3.1 and 3.2 shows that atmospheric\nozone is, in most regions, not in photochemical equilibrium. A notable excep\ntion is the tropical upper stratosphere. The differences between the observed\nand photochemical equilibrium distributions become particularly clear when\nwe focus on column densities (i.e., the total ozone per unit area above a given\npoint).\nFigure 3.4: Observed and calculated (on the basis of photochemical equilibrium) distri\nbutions of ozone column density with latitude in the northern hemisphere for both winter\nand summer.\nThese are shown in Figure 3.4. We see that the equilibrium distribution\nhas a maximum over the equator, and decreases toward the poles in both\nsummer and winter - with the winter minimum being much deeper. The\nobserved distribution has a minimum at the equator and rises toward the\npoles, with the winter maximum being greater than the summer maximum.\n\n\"\n#\n\"\n#\n\"\n#\n\"\n#\n\"\n#\n\"\n#\nDynamics in Atmospheric Physics\n3.1.1\nEquations of continuity\nWe wish, now, to examine the rˆole of a large-scale motion field in causing\nρi to differ from ρi.\nTo do this we must introduce the equation of mass\ncontinuity.\nFigure 3.5: Schematic depiction of mass flow and continuity.\nConsider a fixed element of volume in cartesian coordinates (viz. Fig\nure 3.5):\n∂ρ δx δy δz\n=\n∂t\n∂\nδx\n∂\nδx\nρu -\n(ρu)\nδy δz -\nρu +\n(ρu)\nδy δz\n∂x\n∂x\n∂\nδy\n∂\nδy\n+ ρv -∂y (ρv) 2\nδx δz -\nρv + ∂y (ρv) 2\nδx δz\n∂\nδz\n∂\nδz\n+ ρw -\n(ρw)\nδx δy -\nρw +\n(ρw)\nδx δy.\n∂z\n∂z\nAs δx, δy, δz\n0, we get\n→\n\nEffect of transport on composition\n∂ρ\n∂t = -r · (ρ~u).\n(3.2)\nIn a similar manner (3.1) may be generalized to\n∂ρi\n∂t + r · (ρi~u) = α(ρi -ρi).\n(3.3)\nFigure 3.6: 4-box geometry for studying effect of transport on a chemically active con\nstituent.\n3.2\n4-box transport model\nWe next wish to apply (3.2) and (3.3) to a very simplified geometry where\n~u is specified (viz. Figure 3.6). Each of the four boxes has the same basic\nmass (i.e., p2 = p1 -Δp; p3 = p2 -Δp). At each interface we will assume the\nvelocity to have a characteristic magnitude V (at vertical surfaces) or W (at\nhorizontal surfaces). Finally, we assume that each box can be characterized\nby single values of αj, (ρi)j, (ρi)j, and ρj, where j = box number (Note, ρj\nrefers to the mean density of air in the jth box, (ρi)j to the density of the\nith constituent in the jth box, and (ρi)j to the photochemical equilibrium\ndensity of the ith component in the jth box.). This approach is, of course,\nextremely crude, but it is adequate for illustrative purposes.\n\nZ\nZ\n\n!\nDynamics in Atmospheric Physics\nLet us first integrate Equation 3.2 over box 1 (we are assuming a steady\nstate where\n∂ = 0):\n∂t\nbox 1 r · ρ~u dy dz =\nperimeter of box 1 ρun dl\n=\nρ1V ΔH1 -ρ4WL = 0.\nThis implies\nρ1V ΔH1 = ρ4WL = M.\n(3.4)\nMaking use of hydrostaticity1 ,\nΔP\nΔH1 ∼\nρ1g\n=\nso (3.4) becomes\nΔP V = ρ4WL = M.\n(3.5)\ng\nMore generally, the mass flux across each interface must equal M. (As a\npractical matter, W may have to be considered different according to whether\nit is going up or down.)\nIntegrating Equation 3.3 over box 1 we get\n(ρi)1V ΔH1 -(ρi)4WL = α1((ρi)1 -(ρi)1)LΔH1\n(3.6)\nand, using (3.5),\n(ρi)1\n(ρi)4\nΔP\n(ρi)1\n(ρi)1\nρ1\nM -\nρ4\nM = α1 g L\nρ1\n-\nρ1\nor, more generally,\n\n!\n\n!\n⎛\n!\n\n! ⎞\nρi\nρi\nΔP\nρi\nρi\nρ\nj\nM -\nρ\nj-1\nM = αj g L ⎝\nρ\nj\n-\nρ\nj\n⎠\n1If the reader doesn't know what this is, it is discussed in Chapter 4.\n\nEffect of transport on composition\nor, equivalently,\n⎡\n!\n\n!\n⎤\n⎛\n!\n\n! ⎞\nρi\nρi\nρi\nρi\nR ⎣\n⎦ = αj ⎝\n⎠\n(3.7)\nρ\n-\nρ\nρ\n-\nρ\nj\nj-1\nj\nj\nwhere\nMg\nV\nR =\n=\nΔP L\nL\nand\nj =\n1, 2, 3, 4\nj -1\n=\n4, 1, 2, 3\n(i.e., j is a cyclic index where j = j + 4).\nSeveral important points are to be noted concerning (3.7):\n1. The dimension of both R and αj is 1/[T ] (i.e., 1/time).\n2. The left-hand side of (3.7) represents the rate at which advection is\nacting to eliminate differences in ( ρ\nρ\ni ) between adjacent boxes. Note\nthat advection acts to homogenize the mixing ratio of constituent i,\n( ρ\nρ\ni ), rather than its density, ρi 2 .\n2A somewhat more elegant approach to this feature can be obtained directly from\nEquations 3.2 and 3.3. Rewrite\nρi\nρi =\nρ.\nρ\nThen\n∂ρi\n∂ ρi\n\nρi ∂ρ\n∂t + r · (ρi~u)\n=\nρ∂t\nρ\n+ ρ ∂t\nρi\n\nρi\n+ρ~\n+\n(ρ~u)\nu · r\nρ\nρ r ·\n\n!\n\n!\nDynamics in Atmospheric Physics\n3. The right-hand side of (3.7) represents the rate at which chemistry is\nacting to bring (ρ\nρ\ni) to its equilibrium value, ( ρ\nρ\ni).\n4. The non-dimensional parameter R/α represents the balance in the com\npetition between the two processes described in items (2) and (3).\n1, there is a tendency for ( ρi\nρ\nwhereas when R/α 1, there is a tendency for ( ρ\nρ\nchemical equilibrium value.\nWhen R/α\n)j to approach (ρ\nρ\ni)j-1,\ni )j to approach its\nOur object is to solve (3.7) for ( ρ\nρ\ni)j. This is facilitated by rewriting\n(3.7) as\n(R + αj)φj -αjφj = Rφj-1,\n(3.8)\nwhere\nρi\n.\nφj ≡\nρ\nj\nSuccessive substitution in (3.8) yields\nR4\n=\nαj\n+ Rαj-1φj-1\nφj\n1 -R1,2,3,4\nRj\nφj\nRj,j-1\nR2αj-2φj-2\nR3αj-3φj-3\n+\n+\n,\n(3.9)\nRj,j-1,j-2\nR1,2,3,4\nwhere\n∂ ρi\n\nρi\n\n=\nρ\n∂t\nρ\n+ ~u · r\nρ\n= α(ρi -ρi)\nand\n∂ ρi\n\nρi\n\nρi\nρi\n\n∂t\nρ\n+ ~u · r\nρ\n= α\nρ -ρ\n.\n\nEffect of transport on composition\nV\nR ≡\nL\nRj\n≡\n(R + αj)\nRj,k\n≡\n(R + αj)(R + αk)\nRj,k,l\n≡\n(R + αj)(R + αk)(R + αl)\nR1,2,3,4\n≡\n(R + α1)(R + α2)(R + α3)(R + α4).\nThe reader should attempt to interpret (3.9). For example, φj clearly\ndepends on the value of φ in each of the boxes, weighted by measures of\ntransport efficiency.\nA particularly interesting solution exists in the following limit:\nα1\nR\nα2, α3, α4\nR.\nThen\nR1\n+α1\n≈\nRj\nR for j = 1\n≈\nand from (3.9)\nφ1\nφ1\n≈\nφ2\nφ1\n≈\nφ3\nφ1\n≈\nφ4\nφ1\n≈\nNote, that in this limit, the answer does not depend on the sign of M (or\nV ). Also, in the event that φ1 φ2, φ3, the column density of 'ozone' below\nboxes 2 and 3 has been greatly increased by transport (beyond what would\nbe implied by photochemical equilibrium). (What would one have to do to\nmake the column density below boxes 2 and 3 greater than it is below boxes\n1 and 4? How might this relate to Figure 3.4?)"
    },
    {
      "category": "Resource",
      "title": "chapter_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/a55792047a5b8091d7aea0144ed878f0_chapter_4.pdf",
      "content": "Chapter 4\n'Statics' of a rotating system\nSupplemental reading:\nHolton (1979), chapter 1 and section 3.2\nHoughton (1977), sections 7.3-7.6\n4.1\nGeostrophy and hydrostaticity\nIn this chapter some terms are introduced which are needed for the subse\nquent review of observations. Specifically, we will review hydrostaticity and\nintroduce geostrophy - both involve static balances1 . Our approach will be\n'quick and dirty'. Matters will be approached more carefully in Chapter 6. In\nstatic balances, forces are balanced by pressure gradients: -rp. Consider a\nrotating fluid in a gravitational field (oriented parallel to the rotation vector;\nviz. Figure 4.1).\nLet the flow consist simply in rotation about the z-axis: Ω+ ω(r), where\nr = √x2 + y . Moreover, let the flow be steady. The force balance in the\nz-direction will simply be\n∂p = -ρg.\n(4.1)\n∂z\n1It is expected that most readers will be more or less familiar with the contents of this\nchapter. It is included for the few who may have need of it. Nevertheless, the material is\nessential. The reader is urged to make sure that all the exercises that follow this chapter\ncan be comfortably handled.\n\nDynamics in Atmospheric Physics\nFigure 4.1: Orientation of rotation and gravity in cartesian frame.\nThis balance is referred to as the hydrostatic balance. In the r-direction the\nradial pressure gradient must balance the centrifugal force:\nρ(Ω + ω)2 r = ∂p\n(4.2)\n∂r\nor\nρ(Ω2 + 2Ωω + ω2)r = ∂p .\n∂r\nLet\np = p0 + p0,\nwhere the following expression defines p0\nρΩ2\n∂p0\nr = ∂r\n(Ω2r serves to modify ~g in geophysical systems).\nSo\n\n'Statics' of a rotating system\nρ(2Ωω + ω2)r = ∂p0\n.\n(4.3)\n∂r\nIn general2 ,\nω Ω\nand\n2Ωωr ∼1 ∂p0\n(4.4)\n= ρ ∂r\nThe left-hand side of (4.4) is the Coriolis force per unit mass. This force\nis merely the linearization of the centrifugal force in a rotating coordinate\nframe. Equation 4.4 represents what is called geostrophic balance, while (4.3)\nis referred to as cyclostrophic balance.\nIt is sometimes convenient to express (4.4) in cartesian coordinates. Fig\nure 4.2 permits us to view the motion in the horizontal plane within the\nrotating system.\nAt point A, dr = dx, and ωr = v. Equation 4.4 becomes\n1 ∂p\n2Ωv =\n,\n(4.5)\nρ ∂x\nwhile at point B, dr = dy and ωr = -u, yielding\n1 ∂p\n2Ωu = -ρ ∂y ,\n(4.6)\nAs already mentioned, a more systematic presentation of the above will\nbe given in Chapter 6. The supplemental reading may also be useful to those\napproaching these topics for the first time.\nThe following remarks should be kept in mind:\n2N.B. The quantity ω/2Ω is known as the Rossby number. More generally, it represents\nthe relative importance of nonlinear inertial terms and the Coriolis force (based on the\nsystem rotation).\n\nDynamics in Atmospheric Physics\nFigure 4.2: Cartesian view of circular motion.\n1. Both hydrostaticity and geostrophy are static balances. It is, of course,\nslightly peculiar to refer to a force balance involving a moving fluid\nas 'static'. Nevertheless, as long as one refers to a centrifugal force,\nthen geostrophy is a statement that two forces balance rather than a\ndynamic (prognostic) statement.\n2. Neither hydrostaticity nor geostrophy is causal relation.\n3. Strictly speaking, Equation 4.1 is true only in the absence of verti\ncal acceleration (relative to the already rotating system) and friction.\nEquation 4.4 is always approximate. Nevertheless, for horizontal ac\ncelerations with time scales longer than a pendulum day (π/Ω) and\nvertical accelerations with time scales longer than the Brunt-Vaisala\nperiod3 (O(5 minutes)), (4.1) and (4.4) remain very nearly true. These\nconditions apply, for the most part, to the large-scale motions of the\natmosphere and oceans (at least away from frictional layers at bound\naries).\n4. For motions in the atmosphere and oceans the appropriate choice for\nΩ is its vertical component. The situation is illustrated in Figure 4.3.\n3This is a quantity which will be defined in Chapter 6. It is a measure of stratification.\n\n'Statics' of a rotating system\nFigure 4.3: The vertical component of the rotation vector on a sphere.\nIn (4.4), 2Ω is replaced by 2Ω sin φ. The quantity 2Ω sin φ is generally\ngiven the symbol f and is known as the Coriolis parameter.\n5. When (4.5) and (4.6) apply, r·ρ~v = 0 (Why?). Also, pressure contours\non a horizontal surface are streamlines. That is to say, geostrophic flow\nis along rather than across pressure contours. In this connection, the\nreader should confirm the Law of Buys-Ballot, namely, (in the Northern\nHemisphere) when one faces in the direction of geostrophic flow, high\npressure is on one's right.\nThe following sections contain some additional aspects of balanced flow\n(flow which satisfies (4.1), (4.5), and (4.6)) which will be used in Chapter 5\n(on observations).\n4.2\nScale height and thickness\nIn addition to the hydrostatic pressure relation (Equation 4.1) we have the\ngas law\np = ρRT.\n(4.7)\n\n!\nDynamics in Atmospheric Physics\nUsing (4.7), (4.1) becomes\n∂p\npg\n∂z = -RT\n(4.8)\nor\n∂ ln p\ng\n∂z = -H = -RT ,\n(4.9)\nwhere\nH ≡ RT\ng = local scale height\np = p(surface)e-x\n(4.10)\nand\nx ≡\nZ z\ndz\nH .\nThe quantity\nz∗ =\nH0\nln\npsurface\n(4.11)\n|{z}\np\ncharacteristic scale height\nis almost like height if H doesn't vary 'too much'. It is also the basis of\na popular coordinate system (log-p coordinates).\n(N.B. For a system in\ngeostrophic and hydrostatic balance, the p-field completely determines the\ntemperature and horizontal wind fields through Equations 4.9, 4.5, and 4.6.)\nThe hydrostatic relation can be rewritten\ndp = -ρg dz\nor\ng\nd ln p =\ndz,\n-RT\nyielding\n\n!\n\n!\n\n!\n\n!\n'Statics' of a rotating system\nZ z2\nZ p2 R\nz1\ndz ≡thickness = -\np1\ng T d ln p\n(4.12)\n('thickness' refers to the vertical separation of two isobaric surfaces).\nThe related quantity\nZ z\nZ p\nΦ ≡\n0 g dz = -\np0\nRT d ln p\n(4.13)\nis referred to as geopotential height. The quantity Φ/g is called the height\nfield.\n4.3\nThermal wind and pressure\ncoordinates\nIt is easily shown4 that\n∂p\n∂Φ\n=\n(4.14)\nρ ∂x\n∂x\nz\np\n∂p\n∂Φ\n=\n.\n(4.15)\nρ ∂y\nz\n∂y\np\np = p(x, y, z, t)\nand\n∂p\n∂p\n∂p\n∂p\ndp =\ndx +\ndy +\ndz +\ndt = 0,\n∂x\n∂y\n∂z\n∂t\nwhich implies\n∂z\n∂p\n∂p\n1 ∂p\n∂x = -\n∂x\nz\n/ ∂z\nx\n= ρg ∂x ,\nwhich in turn implies\n∂Φ\n1 ∂p\n=\n.\n∂x\nρ\n∂x\np\nz\n\n!\n\n!\n\n!\n\n!\nDynamics in Atmospheric Physics\nEquations 4.5 and 4.6 then become\n∂Φ\nfu =\n-∂y\n(4.16)\n∂Φ\nfv =\n+\n.\n(4.17)\n∂x\nNow from (4.13), ∂Φ =\nRT . So differentiating (4.16) and (4.17) with respect\n∂p\n-p\nto p yields\n∂v\nR\n∂T\n∂v\np∂p =\n-f\n∂x\np\n= ∂ ln p\n(4.18)\n∂u\nR\n∂T\n∂u\np\n=\n+\n=\n.\n(4.19)\n∂p\nf\n∂y\np\n∂ ln p\nEquations 4.18 and 4.19 may be rewritten to yield the thermal wind relations\n(in log -p coordinates):\n∂u\nH0 ∂u\ng\n∂T\nH ∂ ln p =\n-H ∂z∗ = + fT\n∂y\np\n(4.20)\n∂v\nH0 ∂v\ng\n∂T\nH ∂ ln p =\n-H ∂z∗ = -fT\n∂x\np\n.\n(4.21)\nUnder many circumstances H\nH\n0 ∼1, z∗ ∼z, and pressure surfaces are far\nmore horizontal than temperature surfaces. Then\n∂u\ng ∂T\n∂z ≈\n- fT ∂y\n(4.22)\n∂v\ng ∂T\n∂z ≈\n+ fT ∂x .\n(4.23)\nFrom the above expressions for the thermal wind we see that the counterpart\nof the Law of Buys-Ballot for shear is simply that if one is facing in the\ndirection in which wind is increasing upward, high temperature is on one's\nright (again for the Northern Hemisphere)."
    },
    {
      "category": "Resource",
      "title": "chapter_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/2e541bea775269022a32d183214febe0_chapter_5.pdf",
      "content": "Chapter 5\nObserved atmospheric\nstructures\nSupplemental reading:\nLorenz (1967)\nPalm en and Newton (1967)\nCharney (1973)\n5.1\nGeneral remarks\nOur introduction to the observed state of motion and temperature in the\natmosphere will be restricted (for the most part) to fairly gross features.\nAlmost no mention will be made of the numerous features most closely as\nsociated with the most common perceptions of weather: hurricanes, fronts,\nthunderstorms, tornadoes, and clear air turbulence, to name a few. While\nthere is something perhaps paradoxical and certainly regrettable about these\nomissions, the amount of detail required to cover them would far exceed both\nour time and our capacity for absorption of information. There is an addi\ntional reason for restricting ourselves to larger (synoptic) scales: namely, the\nconventional upper air data network does not resolve the smaller scales.\nThe question of resolution is not a simple one and before proceeding,\na few remarks on the nature of meteorological data are in order. Data, in\nthe sense used by experimental sciences (namely, single measurements of an\n\nDynamics in Atmospheric Physics\nisolated system), are inappropriate to meteorology. Temporal and spatial\nvariability are such inextricable features of meteorological phenomena that\nisolated measurements at a single location are at best inadequate - and\nFigure 5.1: Radiosonde station distribution (from Oort, 1978).\nusually useless. Figure 5.1 shows the distribution of radiosonde stations\nat which conventional meteorological balloon soundings are taken at least\nonce daily (and frequently twice daily at 0000Z and 1200Z). These sound\nings consist in pressure, temperature, and humidity measurements transmit\nted by small radio transmitters to the ground. In addition, the balloons are\ntracked by radar in order to obtain profiles of horizontal wind. In princi\nple, such data are available with fairly high vertical resolution (O(1 km)),\nbut usually the archived data sets list data only for a subset of the stan\ndard levels (surface, 1000mb, 850mb, 700mb, 500mb, 400mb, 300mb, 250mb,\n200mb, 150mb, 100mb, 50mb, 30mb, 20mb, 10mb)1 . From Figure 5.1 we see\nthat the horizontal distribution of stations - especially over the oceans and\nin the Southern Hemisphere - is inadequate to resolve any but the coarsest\nof features. The coverage, however, is extremely nonuniform, and over the\n1These are supposed to be standard levels. In addition levels at which extrema occur\nare supposed to be recorded as significant levels. Unfortunately data sets frequently omit\nsome of these levels.\n\nObserved atmospheric structures\nNorthern Hemisphere continents there is often fairly dense coverage. Tem\nporal coverage is barely adequate to resolve five-day periods (one usually\nneeds 4-6 points to resolve a period or wavelength), and height resolution,\nwhile adequate for some purposes, is usually inadequate for the resolution of\nboundary layers commonly observed (in more detailed measurements) below\n700mb.\nThe limitations imposed by the crude nature of our meteorological mea\nsurements are substantial - and real. Moreover, the 'raw' data in tabular\nform (or any digital form) is peculiarly uninformative. Indeed, if each sta\ntion produced an independent uncorrelated time series, it would be difficult\nto know where to begin any theoretical description (to be sure, we could then\nbegin to formulate statistics, and attempt to explain these statistics), but,\nfortunately, when the data are presented in the form of global or regional\nmaps, we see that patterns emerge which seem to evolve in a traceable man\nner2 . It is, in the form of these maps, that we usually study the data. Such\nmaps are the basis of much of this chapter. A quick glance at these maps\nshows representations which are continuous over the whole globe (or at least\na hemisphere), while the 'raw' data come from a relatively few isolated sta\ntions. Clearly, the maps are not exactly data; they include a very substantial\namount of interpolation - and this interpolation is rarely as straightforward\nas simple linear interpolation. Such maps are referred to as analyzed data.\nWhen the analysis is performed by hand by a synoptic meteorologist, it is\nreferred to as 'subjective' analysis. The contours drawn in data-free regions\nprobably contain useful information - especially when prepared by an expe\nrienced meteorologist - since much is known about the expected time and\nspace evolution of disturbances. However, there is no getting away from the\nfact that what is drawn is not data. This becomes particularly disturbing\nwhen the contours show substantial detail in data-free regions. In general,\nthese details will differ in different analyses.\nWhen the analysis is performed according to fixed rules and algorithms,\nthe analysis is referred to as 'objective'. The advantage of 'objective' analy\nses is their reproducibility, but there is no other a priori guaranty of greater\naccuracy than that found in subjective analyses. Recently, it has become\ncommon to analyze data with the aid of numerical weather prediction mod\n2As far as I can tell, this was first noted by Benjamin Franklin. He compared newspaper\nweather reports from various cities from the east coast to the Ohio basin, and observed\nthat weather systems travelled east although the storms were associated with northeasterly\nwinds.\n\nDynamics in Atmospheric Physics\nels.\nIterative use of predictions over short periods allows one to interpo\nlate the raw data in a manner which is somehow consistent with the model\nphysics. Moreover, such schemes allow the 'assimilation' of data other than\nthe standard radiosonde data obtained from the stations in Figure 5.1. Of\nprimary importance in this regard is the satellite obtained infrared radi\nance (from which coarse vertical temperature structure may be inferred)3 ,\nand winds obtained from jumbo jets with accurate inertial guidance sys\ntems. Such model based analysis-assimilation schemes are impressive. Tests\nshow that the interpolations are frequently surprisingly accurate. There is a\ngeneral consensus that these new objective analyses are consideraby better\nthan older subjective analyses - especially over the oceans. However, even\nthese analyses are limited by (among other things) the model physics and\nresolution. In general, such models have only primitive parameterizations of\ncumulus convection, turbulence, radiative transfer, and sub-grid transfers by\ngravity waves. The forecast skill of such models is frequently poor in the\ntropics. Analysis-assimilation schemes which emphasize compatibility with\nthe model physics often throw away actual data in order to produce a com\npatible analysis. Moreover, analyses based on different models frequently\ndiffer substantially (Lau and Oort, 1981).\nThe above description may be unduly critical. Nevertheless, there can\nbe no doubt that the comparison of theory and data is a more difficult propo\nsition in meteorology than in the traditional sciences. Science consists in a\ncreative tension between theory and data: theory explaining data -- data\ntesting theory. In each case, the data consists in numbers with error bars\nestimating the likely uncertainty of the data. Such error bars can be attached\nto the results of individual soundings, but no similar methodology is read\nily attached to analyzed data where whole weather systems may be missed\nwhile occasionally systems are drawn which in reality didn't exist. The sit\nuation becomes even more questionable when higher levels of analysis are\nintroduced: that is, spectral decompositions, correlations, etc. While such\nanalyses might be applied, in principle, to the raw data, the methods are\nfar better suited to regularly spaced data. In general, such regularly spaced,\n3The global coverage afforded by satellite radiance measurements would seem likely to\ngreatly improve global forecasts and analyses. This, in fact, has proven to be the case in\nthe Southern Hemisphere, where there is almost no other data. However, in the Northern\nHemisphere little or no improvement has been obtained. Apparently, inaccuracies and\npoor vertical resolution have limited the impact of satellite data when other data are\navailable.\n\nObserved atmospheric structures\n'gridded' data are obtained from analyzed maps. In this chapter, we will\navoid such products of higher level analyses - though the results can often\nbe informative and suggestive.\nAt this point it might appear that analyzed data is completely uncer\ntain. This is certainly untrue -- even though the quantitative measures of\nuncertainty have not been adequately developed. Certain important features\non maps appear regularly and clearly (high signal-to-noise ratio) and are\nreadily related to our tangible experience of weather. Analyzed data do, in\nfact, help us to isolate and quantify such features. However, 'data' as used in\nmeteorology are not quite so concrete as carefully obtained laboratory data\n- and may, on occasion, even be wrong!\nIn describing the large-scale structure of the atmosphere, I will assume\nthat the reader is already familiar with the variation of the horizontally\naveraged temperature with height. Similarly, the reader should be familiar\nwith the typical heights at which various pressures occur.\nFinally, more\ndetailed examination of the data for specific phenomena will be made in\nsome later chapters.\n5.2\nDaily and monthly maps\nWe begin our study with eight figures, each of which consists of a set of\nfour hemispheric maps: one for January 15, 1983, one for July 16, 1983, one\nfor the average over January 1983, and one for the average over July 1983.\nThe maps are all from the European Centre for Medium Range Weather\nForecasting (ECMWF). Figures 5.2 and 5.6 show pressure contours at sea\nlevel (corrected for topography) for the Northern and Southern Hemispheres,\nrespectively. Figures 5.3-5.5 show height fields for 500mb, 300mb, and 50mb\nin the Northern Hemisphere while Figures 5.7-5.9 show the same for the\nSouthern Hemisphere.\nSuch maps display many phenomena - though the maps presented here\nare insufficient to adequately isolate and quantitatively delineate such phe\nnomena. Nevertheless, the maps warrant close and thoughtful scrutiny. In\nthese notes, we will focus on the Northern Hemisphere maps - and even that\nwill be done briefly, simply indicating the kinds of things one might look for.\nThe reader should carefully study the Southern Hemisphere maps in order\nto see in what ways the meteorology of the Southern Hemisphere resembles\nand differs from that in the Northern Hemisphere.\n\nDynamics in Atmospheric Physics\nFigure 5.2:\nNorthern Hemisphere maps of sea level pressure contours (corrected for\ntopography) for January 15, 1983 and July 16, 1983 and monthly mean maps for January\nand July of 1983. Units are mb or hPa\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.3: Same as Figure 5.2, but for contours of height at 500mb. Units are decame\nters.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.4: Same as Figure 5.2, but for contours of height at 300mb. Units are decame\nters.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.5: Same as Figure 5.2, but for contours of height at 50mb. Units are decameters.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.6: Same as Figure 5.2, but for Southern Hemisphere.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.7: Same as Figure 5.3, but for Southern Hemisphere.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.8: Same as Figure 5.4, but for Southern Hemisphere.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.9: Same as Figure 5.5, but for Southern Hemisphere.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.2 shows maps of Northern Hemisphere sea level pressure. Note,\nfor example, the following:\n1. Daily maps show more fine-scale structure than do monthly means\nimplying that fine-scale structure is associated with shorter time scales\nthan a month.\n2. The intensity of structures is greater in winter than in summer.\n3. Note the large-scale lows over the oceans and highs over land in the\nJanuary mean. Note the reversal of this pattern in the July mean.\nIn Figure 5.3, which shows height contours at 500mb, note the following:\n1. Again note the loss of fine-scale structure in the monthly means.\n2. Fine-scale structure (especially for January 15) tends to be less associ\nated with closed contours than in Figure 5.2. This is not because these\nfeatures are weaker at 500mb; rather, it is due to the stronger mean\nzonal4 flow at 500mb5 .\n3. Again features are less intense in summer than in winter.\n4. Notice that in contrast to the results at the surface, the phase of the\nwaves in the monthly mean maps is much the same in both January\nand July.\nTurning to Figure 5.4, which shows height contours at 300mb, we see a\nrather substantial similarity to Figure 5.3 except for a general intensification\nof the zonal mean flow and the eddies (deviations from the zonal mean).\nIn moving to Figure 5.5, which shows height contours at 50mb, from\nFigure 5.4, we are moving across the tropopause. We now see a close simi\nlarity between the daily maps and the monthly means indicating a relative\nabsence of short-period features. We also see an increase in the dominant\nspatial scale. In the summer we see a pronounced reduction in both eddies\nand the zonal mean.\nThe reader can confirm from Figures 5.6-5.9 the presence of most of the\nabove features in the Southern Hemisphere. However, the monthly means\n4Zonal refers to the west-to-east direction along a latitude circle.\n5The reader should make sure that he understands this point. If necessary, synthesize\nsome contours for assumed wave and mean flow magnitudes.\n\nObserved atmospheric structures\nshow much less wave structure - presumably due to the relative absence of\nland in the Southern Hemisphere. Nevertheless, what wave structure there\nis in the monthly means for the Southern Hemisphere is much the same\nin both amplitude and phase for both January and July. In the Northern\nHemisphere, the monthly mean waves were significantly stronger in January.\n5.3\nZonal means\n5.3.1\nSeasonal means\nAs is evident from the preceding figures, maps display the superposition of\nmany phenomena and systems. As such, they are difficult to analyze un\nambiguously. It is usual to process the maps in such a manner as to isolate\nsome subset of what is going on. Taking monthly means is an example of\nsuch processing. Another example, of great historical importance in meteo\nrology, is the taking of zonal means in order to study the height and latitude\nvariations of such means. Figures 5.10 and 5.11 show the meridional sections\nof zonally averaged zonal wind and temperature for each season (from Newell\net al., 1972).\n\nDynamics in Atmospheric Physics\nFigure 5.10:\nMeridional section of zonally averaged zonal wind for each of the four\nseasons (from Newell, et al., 1972).\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.11: Same as Figure 5.10, but for zonally averaged temperature.\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nThe following are a few of the features which may be noted in these\nfigures:\n1. Regardless of season, surface winds tend to be easterly (from the east)\nwithin 30* of the equator and westerly poleward of 30*. Surface east\nerlies tend to be stronger on the winter side of the equator.\n2. The midlatitude troposphere is characterized by westerly jets in both\nhemispheres. The jet maxima occur at about 12km altitude (∼200mb).\nThe winter maxima are stronger (∼30 --50m/s) and occur near 30*\nlatitude. The summer maxima are weaker and occur further poleward\n(∼45* latitude).\n3. In the winter stratosphere, there is also a polar night westerly jet cen\ntered near 60*. This jet is generally stronger in the Southern Hemi\nsphere winter. It also lasts longer there. What might be going on?\n4. Zonally averaged zonal winds and temperatures are pretty nearly in\nthermal wind balance. Thus, below 12km, where westerly flow is in\ncreasing with altitude, temperatures are decreasing away from the equa\ntor. However, above 12km, where westerly winds are decreasing with\nheight,\nwe\nhave\nminimum\ntemperatures\nat\nthe\nequator. In the summer hemisphere, temperatures increase monoton\nically to the pole. However, in the winter hemisphere, a temperature\nmaximum is reached in the lower stratosphere near 50* and the tem\nperature falls rapidly poleward of this latitude (consistent with the\npresence of the polar night jet).\nFigure 5.12 shows the winter-summer differences in zonally averaged\ntemperature (taken from Newell et al., 1972). Not surprisingly, these differ\nences are small in the tropics and large at high latitudes. Notice as well the\ndifferences between the Northern and Southern Hemispheres (Why?).\n5.3.2\nZonal inhomogeneity and rˆole of analysis\nThe zonal wind at any given longitude will, of course, differ from the zonal\naverage. December-February sections for various longitudes are shown in\nFigure 5.13; June-August sections are shown in Figure 5.14. Inhomogeneity\nis greatest in the Northern Hemisphere where\n\nObserved atmospheric structures\nFigure 5.12: Winter-summer differences in zonally averaged temperature (from Newell\net al., 1972).\n\nDynamics in Atmospheric Physics\nFigure 5.13: Meridional sections of December-February zonal winds at specific longi\ntudes (From Newell et al., 1972).\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nFigure 5.14: Meridional sections of June-August zonal winds at specific longitudes (from\nNewell et al., 1972)\n\nObserved atmospheric structures\n\nDynamics in Atmospheric Physics\nvalues about double the zonal average may be found at some longitudes.\nThis is also seen in Figure 5.15, where Northern Hemisphere winter contours\nof zonal wind at 200mb are shown. Also, as already noted in the beginning\nof this chapter, the data we are dealing with are analyzed data. Figure 5.15\nshows the results of two different analyses (GFDL and NMC) and the differ\nences between the two analyses. The differences are on the order of 10-20%,\nwhich is a plausible measure of our uncertainty.\n5.3.3\nMiddle atmosphere\nSo far we have concentrated our attention on the zonally averaged zonal wind\nand temperature in the troposphere and lower stratosphere.\nFigure 5.16\nshows these quantities up to the lower thermosphere. The data is primarily\nNorthern Hemisphere data; the right and left halves of the sections corre\nspond to winter and summer. Note the monsoonal nature of the mesospheric\nwinds: winter is characterized by westerlies; summer by easterlies. Note also\nthat temperature increases monotonically from the winter pole to the sum\nmer pole at the stratopause (ca. 50km), but at the mesopause (ca. 83km)\nthe temperature is increasing monotonically from the summer pole to the\nwinter pole. This is again consistent with thermal wind balance.\n5.3.4\nQuasi-biennial and semiannual oscillations\nFigure 5.16 assumes that stratospheric and mesospheric winds are dominated\nby an annual (12 month) cycle. Near the equator this turns out to be un\ntrue. Figure 5.17 shows a time-height section of zonal wind at Canton Island\n(2*460S) (which turns out to be characteristic of the zonal average). Note\nthat zonal winds form a downward propagating wave-like structure with a\nperiod of about 26 months; this is referred to as the quasi-biennial oscilla\ntion which dominates the tropical zonal wind between 16km and 30km. The\nsituation up to 56km is shown in Figure 5.18. Here we see that above about\n32km, a semiannual oscillation is dominant. Figures 5.17 and 5.18 are based\non monthly means. It turns out that stratospheric tropical zonal winds also\nsometimes display important short period oscillations. In Figure 5.19 we see\nan oscillation with a period of about 12 days. This has been identified as an\nequatorial Kelvin wave6 .\n6We will explain what this is in Chapter 11.\n\nObserved atmospheric structures\nFigure 5.15:\nNorthern Hemisphere contours of 200mb zonal winds for two different\nanalyses (GFDL and NMC) as well as contours of the differences (from Lau and Oort,\n1981).\n\nDynamics in Atmospheric Physics\nFigure 5.16: Zonally averaged zonal winds and temperatures up to the lower thermo\nsphere (from Andrews, Holton, and Leovy, 1987).\n\nObserved atmospheric structures\nFigure 5.17: Time-height section of monthly-mean stratospheric zonal winds at Canton\nIsland (2*460S) (from Reed and Rogers, 1962).\n\nDynamics in Atmospheric Physics\nFigure 5.18: Time-height section of near-equatorial monthly mean zonal winds between\n16km and 56km (from Wallace, 1973). The solid contour intervals are 10 ms-1 . Shaded\nregions refer to westerlies and unshaded regions refer to easterlies.\n\nObserved atmospheric structures\nFigure 5.19: Time-height section of daily zonal winds over Kwajalein (from Wallace\nand Kousky, 1968). The contour intervals in Figure 5.19 are 5 ms-1 .\n\nDynamics in Atmospheric Physics\n5.3.5\nStratospheric sudden warmings\nFigures 5.5 and 5.16 suggest a rather regular seasonal behaviour in the mid\ndle and high latitude stratosphere. However, occasionally (every 1-4 years\nor so) in the Northern Hemisphere this pattern breaks down rather spectacu\nlarly in a midwinter stratospheric sudden warming where the winter pattern\nbreaks down and a summer pattern onsets - during the winter polar night.\nFigure 5.20 shows a Northern Hemisphere\nmap for January 25, 1957 - just prior to the onset of such a warming. The\npattern is almost identical to that in Figure 5.5. (Note that North America\nis at the bottom of Figure 5.20, while it is at the left in Figure 5.5; note also\nthat height in Figure 5.20 is in 100s of feet while in Figure 5.5 it is in tens\nof meters.) However, by February 4, 1957, Figure 5.21 shows a significant\nchange: zonal wavenumber two has amplified strongly and seems to have\ndrifted westward. This change is accompanied by a zonally averaged pole\nward heat flux which leads to the zonally averaged changes in zonal flow and\ntemperature shown in Figure 5.22. Observe the change of the temperature\nminimum at the pole into a temperature maximum. Note also the change\nfrom Arctic westerlies to easterlies.\n5.4\nShort period phenomena\nFinally we return briefly to our initial comment on the omission of shorter\nscale phenomena. It is increasingly recognized that some of these phenom\nena, in the form of vertically propagating waves, play an essential rˆole in the\nlarge scale circulation. This will be discussed in later chapters. Such waves\nhave been long noticed in rocket data, examples of which are shown in Fig\nure 5.23. Notice the large amplitude perturbations (∼20*C) with vertical\nwavelengths of from 10-15km. These perturbations tend to become obvious\nat lower altitudes in winter. Rocket data for day-night temperature differ\nences are also of some interest. Examples are shown in Figure 5.24. What\nstands out in these figures is the very large day-night differences observed\nin the upper mesosphere (O(20*C)) and the fact that as often as not, the\nnight is warmer. The reader should consider what this implies about how\nthe atmosphere behaves - and, in particular, how the atmosphere 'knows'\nwhen it is day or night. The implications are by no means restricted to the\nupper atmosphere.\n\nObserved atmospheric structures\nFigure 5.20: Northern Hemisphere 50mb height map for January 25, 1957 (from Reed,\nWolfe, and Nishimoto, 1963). The solid contours refer to height in 100's of feet. The\ndashed contours refer to temperature in oC. The solid contours refer to height in 100's of\nfeet. The dashed contours refer to temperature in units of *C.\n\nDynamics in Atmospheric Physics\nFigure 5.21: Same as Figure 5.20, but for February 4, 1957.\n\nObserved atmospheric structures\nFigure 5.22: Zonally averaged zonal winds and temperatures at 50mb as functions of\nlatitude for various times in the course of a sudden warming (from Reed et al., 1963).\n\nDynamics in Atmospheric Physics\nFigure 5.23: Rocket soundings of temperature over Wallops Island (38*N) (from Theon\net al., 1967).\n\nObserved atmospheric structures\nFigure 5.24:\nDay-night temperature difference profiles obtained from rockets (from\nTheon et al., 1967)."
    },
    {
      "category": "Resource",
      "title": "chapter_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-810-dynamics-of-the-atmosphere-spring-2008/2a3192bacaa7ab11a863ed9130049cd5_chapter_6.pdf",
      "content": "Chapter 6\nEquations of motion\nSupplemental reading:\nHolton (1979), chapters 2 and 3 deal with equations, section 2.3 deals with\nspherical coordinates, section 2.4 deals with scaling, and section 3.1\ndeals with pressure coordinates.\nHoughton (1977), Chapter 7 deals with equations, and Section 7.1 deals\nwith spherical coordinates.\nSerrin (1959)\nAs has been mentioned in the Introduction, it is expected that almost ev\neryone reading these lecture notes (and despite TEXification, these are only\nnotes) will have already seen a derivation of the equations. I have, there\nfore, decided to cover the equations using Serrin's somewhat less familiar\napproach.\n6.1\nCoordinate systems and\nconservation\nLet ~x = (x1, x2, x3) be a fixed spatial position; this will be referred to as\nan Eulerian coordinate system. Now, at some moment t = 0 let's look at a\nfluid and label each particle of the fluid X~ = X~ (t,~x) = (X1, X2, X3), where\nXi t=0 = xi; that is, we label each particle by its position at t = 0; this will\n|\n\n~\n~\n~\n\n!\nDynamics in Atmospheric Physics\nbe referred to as a Lagrangian coordinate system. In general, each coordinate\nsystem may, in principle, be transformed into the other:\nx( ~\nEulerian:\n~x, t ~x = ~ X, t)\nLagrangian:\nX, t X = X(~x, t)\nLet the velocity of a fluid 'particle' be ~u = (u1, u2, u3).\nDxi\n∂xi\nui =\n=\n.\nDt\n∂t\n~X constant\nSimilarly, let ~a be the acceleration of a fluid 'particle':\n\n∂2xi\n!\n∂ui\n∂ui Dxj\nai =\n=\n+\n,\n∂t2\n~\n∂t\n∂xj Dt\nX constant\nwhere the summation convention is used; that is, we sum over repeated\nindices.\nThe laws of physics are fundamentally conservation statements concern\ning\nD of something following the fluid. Let us, for the moment, deal with\nDt\nsome unspecified field f(xi, t) (per unit mass):\nDf\n∂f\n∂f Dxi\n=\n+\n.\nDt\n∂t\n∂xi Dt\nNow consider some region of space R(~x). We wish to evaluate\nD Z\nfρ d3 x,\nDt R(~x)\nwhere ρ is density. A difficulty arises since the fluid within R(~x) is changing.\nWe deal with this by switching to Lagrangian coordinates:\nD Z\nD Z\nfρ d3 x =\nfρJ d3X,\nDt R(x~)\nDt R(X~ )\nwhere\n\nZ\nZ\nZ\nZ\nEquations of motion\nJ = ∂(xi)\n∂(Xi) =\n∂x1\n∂x1\n∂x1\n∂X1\n∂X2\n∂X3\n∂x2\n∂x2\n∂x2\n∂X1\n∂X2\n∂X3\n∂x3\n∂x3\n∂x3\n∂X1\n∂X2\n∂X3\n.\nSince X~ is fixed in the moving fluid,\nD\nfρ d3 x =\nD\nDt R(~x)\nR(X~ ) Dt(fρJ) d3X.\nFor conservation of mass, we take f = 1. Then\nD\nρ d3 x =\nD\nDt R(~x)\nR( ~X) Dt\nand since R is arbitrary,\nD\n(ρJ) d3X = 0,\n(ρJ) = 0.\n(6.1)\nDt\nThis is a somewhat peculiar form of the continuity equation. It is, however,\neasily converted to the usual form:\nD\nDJ\nDρ\n(ρJ) = ρ\n+ J\n,\nDt\nDt\nDt\n∂(u1,x2,x3)\n∂(x1,u2,x3)\n∂(x1,x2,u3)\n1 DJ\n∂(X1,X2,X3)\n∂(X1,X2,X3)\n∂(X1,X2,X3)\n=\n+\n+\nJ Dt\n∂(x1,x2,x3)\n∂(x1,x2,x3)\n∂(x1,x2,x3)\n∂(X1,X2,X3)\n∂(X1,X2,X3)\n∂(X1,X2,X3)\n∂u1\n∂u2\n∂u3\n=\n+\n+\n=\n~u\n∂x1\n∂x2\n∂x3\nr ·\nand\nDρ\nDt + ρr · ~u = 0\n(6.2)\n\nZ\nZ\nZ\n|\n{z\n}\nZ\nZ\nZ\n|\n{z\n}\nZ\n|\n{z\n}\nZ\n|\n{z\n}\nR\nDynamics in Atmospheric Physics\nReturning to the general case\nD\nfρ d3 x =\nD\nDt R(~x)\nR(X~ ) Dt(fρJ) d3X\n⎧\n⎪\n⎪\n⎨Df\nD\n⎫\n⎪\n⎪\n⎬\nd3X\n=\nρJ + f\n(ρJ)\nDt\nDt\nR(X~ ) ⎪\n⎪\n⎩\n⎪\n⎪\n⎭\n=0\nDf ρJ d3X\n=\nR(X~ ) Dt\nDf ρ d3\n=\nx,\nR(~x) Dt\nthat is, we can move\nD\nDt inside an integral within Eulerian space. Note also,\nD is applied to f not ρf.\nDt\n6.2\nNewton's second law - for fluids\nNewton's second law for a volume of fluid, R, is\nD\nρui d3 x =\nρfi d3 x\nDt R\nR\nmomentum\nbody force\n+\nσijnj dS,\n(6.3)\nS\nforce exerted on surface of R by fluid outside R\nσijnj dS can be rewritten\nR\nS Fi dS, where the surface force, F~, is given\nN.B.\nS\nby Fi = σijnj (~n is the outward normal). The stress tensor, σij, represents\nthe flux of i-momentum in the minus j-direction (recall that ~n is the outward\nnormal whereas we are considering the force exerted on S by the fluid outside\nR.). Intuitively, we expect the flux of i-momentum in the i-direction to be\nrelated to pressure.\nNow,\n\nZ\nZ\n~\n~\nEquations of motion\nD Z\nZ\nDui\nρui d3 x =\nρ\nd3 x.\nDt R\nR\nDt\nAlso, by the divergence theorem,\nσijnj dS =\n∂σij d3 x.\nS\nR ∂xj\nFinally, since R is arbitrary, we have\nDui\n∂σij\nρ\n= ρfi +\n.\n(6.4)\nDt\n∂xj\nNote that ρ is outside the derivative. Equation 6.4 is not the usual form of the\nmomentum equation (in particular, the pressure gradient term is buried in\n∂σij ); as our first step in evaluating ∂σij , we will consider angular momentum:\n∂xj\n∂xj\nD Z\nZ\nZ\nDt R ~r × ρ~u d3 x =\nR ρ~r × f d3 x +\nS ~r × F dS,\n(6.5)\nwhere F~ = σijnjˆii 1 . (Note that (6.5) assumes no intrinsic torques.)\nRewriting (6.5),\nZ\nD\nZ\nZ\n∂\n~\nˆ\nR ρDt (~r × ~u) d3 x =\nR ρ~r × f d3 x +\nR ii∂xl\n(ijkxjσkl) d3 x\n.\n|\n{z\n}\n|\n{z\n}\n|\n{z\n}\nA\nB\nC\n1The quantity ˆii is a unit vector in the i-direction.\n2The quantity ijk is called an alternant and is defined as follows\nijk\n≡\n1 for ijk = 123, 231, 312\n≡\n-1 for ijk = 321, 213, 132\n≡\n0 when any two of ijk are equal.\nSimilarly, note that δij is the Kronecker Delta, where δij = 1 if i = j, and δij = 0 if i = j.\n\nZ\nDynamics in Atmospheric Physics\n⎡\n~u\n⎤\nA =\nZ\nR ρ\n⎢\n⎢\n⎢\n⎢\n⎣\nz}|{\nD~r\nDt ×~u\n| {z }\n+~r × D~u\nDt\n⎥\n⎥\n⎥\n⎥\n⎦ d3 x\n=0\nB =\nZ\nR ~r ×\n\nρ D~u\nDt - ∂σij\n∂xj\nˆii\n!\nd3 x\n|\n{z\n}\n= ~f from Newton's second law\nC =\nZ\nR\nˆii\n\"\nijkδjlσkl + ijkxj\n∂σkl\n∂xl\n#\nd3 x.\nAfter obvious cancellation, we are left with\nˆiiijkδjlσkl d3 x = 0\nR\nor\nˆiiijkδjlσkl = 0\nor\nˆi(σ32 -σ23) + ˆj(σ13 -σ31) + kˆ(σ12 -σ21) = 0.\nThus, in the absence of intrinsic torques\nσij = σji.\n(6.6)\n6.3\nEnergy\nLet us first look at the rate of change of mechanical energy. Take the mo\nmentum equation (6.4), multiply by ui and sum over i:\nD uiui\n\n∂σij\nρ\n= ρfiui + ui\n.\n(6.7)\nDt\n∂xj\nIntegrate (6.7) over region R\n\nZ\nZ\nEquations of motion\nA\nB\nz\n}|\n{\nz\n}|\n{\nD Z 1\nZ\nZ\n∂σij\nρuiui d3 x =\nρfiui d3 x +\nui\nd3 x.\nDt R 2\nR\nR\n∂xj\nThe last term can be rewritten\nZ\n∂σij\nZ\n∂\nZ ∂ui\nR ui ∂xj\nd3 x =\nR ∂xj\n(uiσij) d3 x -\nR ∂xj\nσij d3 x\nZ\nZ ∂ui\n=\nS uiσijnj dS -\nR ∂xj\nσij d3 x .\n|\n{z\n}\n|\n{z\n}\nC\nD\nThe labelled terms are interpreted as follows:\nTerm A: Time rate of change of mechanical energy.\nTerm B: Work done by body forces.\nTerm C: Work done by surface stresses.\nTerm D: Needs elucidation!\nRecall, there is no conservation of mechanical energy alone. What about\ntotal energy?\nD Z\nu2\n!\nZ\nZ\nρ\n+ e\nd3 x =\nρfiui d3 x +\nuiσijnj dS\nDt R\nR\nS\n+\nS -K~ · ~n dS +\nR ρQ d3 x\n(e = cV T , cV = heat capacity at constant volume, Q = external heating, and\nK~ = heat flux). In view of the arbitrariness of R,\nD\n\nu2\n!\n∂\nρDt\n2 + e = ρfiui + ∂xj\n(σijui) -r · K~ + ρQ.\nSubtract from the above the relation for kinetic energy:\n\n!\n\n!\nDynamics in Atmospheric Physics\nρDe =\n∂ui\nK~ + ρQ.\n(6.8)\nDt\nσij ∂xj\n-r ·\nEquations 6.2, 6.4, 6.6, and 6.8 are our equations of motion - so far.\n6.4\nK~ and σij\nThe nature of K~ and σij is usually (and properly) discussed in terms of molec\nular collisions and/or turbulent mixing. We will take a somewhat different\napproach here. Let us assume\nK~ = K~\nρ, T, ∂T\n.\n∂xi\nTaylor expanding in ∂T we get\n∂xi\n(0)\n∂T\nKi = Ki (ρ, T ) + Aij(ρ, T )\n+ . . . .\n∂xj\nIn general, Ki\n(0) = 0. If we also assume transport to be isotropic then Aij\nmust be proportional to δij; that is,\nAij = -k(ρ, T )δij,\nand\nK~ = -k(ρ, T )rT.\n(6.9)\nThis result is, of course, far more convincingly obtained by kinetic theory\nconsiderations.\nFollowing a similarly abstract approach for σij we will assume\n∂uk\nσij = σij\nρ, T,\n.\n∂xl\n(Fluids satisfying this assumption are known as Newtonian fluids.) Taylor\nexpanding the above relation we get\n\n|{z}\n\n!\n|\n{z\n}\nEquations of motion\n∂uk\nσij = Bij(ρ, T ) + Cijkl(ρ, T )\n+ . . . .\n∂xl\nAgain we want Bij and Cijkl to be isotropic tensors.\nBij = -\np\nδij\npressure\nCijkl = λδijδkl + μ (δikδjl + δjkδil) +ν (δikδjl -δjkδil)\n|\n{z\n}\n|\n{z\n}\nsymmetric in i,j\nantisymmetric in i,j\nSince σij = σji, ν ≡0 and\n∂ui\n∂uj\nσij = -pδij + λδijr · ~u + μ ∂xj\n+ ∂xi\n,\n(6.10)\nτij, the viscous stress tensor\nwhere μ ≡first viscosity and λ ≡second viscosity. The expression for τij is a\nlittle more complicated than the most common expressions. Stokes suggested\nthat average normal viscous stress should be zero; that is, τii = 3λr·~u+2μr·\n~u, which implies λ + (2/3)μ = 0. The quantity η = λ + (2/3)μ is called the\nbulk viscosity and is zero for spherical molecules - but not otherwise. Still,\nfor incompressible fluids where r ~u ≡0, the second viscosity is irrelevant.\n·\nAlso, if μ and λ are constant\n∂\n∂\n\n∂2ui\n∂2uj\n!\n∂xj\nτij = λ∂xi\n(r · ~u) + μ ∂xj ∂xj\n+ ∂xi ∂xj\nor\n∂τij\nˆii ∂xj\n= (λ + μ)r(r ~u) +\nμr2~u\n.\n·\n| {z }\nmost commonly considered term\n∂ui\nWith (6.10), σij ∂xj in (6.8) becomes\n∂ui\nσij ∂xj\n= -pr · ~u + Φ,\n\n!\nDynamics in Atmospheric Physics\nwhere Φ ≡τij\n∂ui . Φ represents dissipation by viscosity. It can be shown that\n∂xj\nΦ ≥0 if and only if μ ≥0, η ≥0. Using (6.9) and (6.10), and replacing fiˆii\nwith ~g, (6.4) and (6.8) become\nDui\n∂p\n∂τij\nρ Dt = ρgi -∂xi\n+ ∂xj\n(6.11)\nand\nDT\nρcV Dt + pr · ~u = r · (krT ) + ρQ + Φ.\n(6.12)\nNote that Φ is generally small for typical geophysical scales.\n6.5\nEquations of state\nEquations 6.2, 6.11, and 6.12 represent five equations in six unknowns ui, ρ, p, T .\nThe remaining equation is the equation of state. Several choices are com\nmonly made.\nPerfect gas:\np = ρRT\n(6.13)\nBoussinesq fluid:\nρ = ρ0(1 -α(T -T0)) (6.14)\nhomogeneous, incompressible fluid:\nρ = constant.\n(6.15)\nIn Equation 6.12 it is common to rewrite the left-hand side as follows:\nDT\nDT\np Dρ\nDS\nρcV\nu~ = ρcV\n= ρT\n,\nDt + pr ·\nDt -ρ Dt\nDt\nwhere S is entropy; note that thermodynamic equilibrium has been assumed.\nFor a perfect gas\nDS\ncv DT\nR Dρ\nDt\n=\nT Dt -ρ Dt\nD\nT cv\n=\nln\n.\n(6.16)\nDt\nρR\n\n|\n{z\n}\n|\n{z\n}\nEquations of motion\nThe relation between S and potential temperature (Θ ≡T cV /R/ρ) is obvi\nous. For the Boussinesq fluid, S is proportional to T (or ρ), while for an\nincompressible, homogeneous fluid S is irrelevant.\n6.6\nRotating coordinate frame\nConsider a rotating frame (x0, y0, z0). A given position ~r can be represented\n~r =\nx(t)ˆi + y(t)ˆj + z(t)kˆ\n(inertial frame)\n=\nx0ˆi0 + y0ˆj0 + z0kˆ0\n(rotating frame).\nThe velocity in the inertial frame can be written\nD~r\n~u =\nDt\n=\nDx0\nˆi0 + Dy0\nˆj0 + Dz0\nkˆ0\nDt\nDt\nDt\nvelocity in rotating frame\nDˆi0\nDˆj0\nDkˆ0\n+\nx0\n+ y0\n+ z0\n.\nDt\nDt\nDt\nvelocity of particle fixed in rotating frame: ω~ ×~r\nSo,\n~\n~0 + ~ω × ~r\nu = u\nand\nD\nD\nDt =\nDt rot + ~ω × .\nThus for\n~u = ~u0 + ω~ × ~r,\n\n!\n\n!\nDynamics in Atmospheric Physics\nD~u\nD~u\nD~r\nDt\n=\nDt\n+ ~ω × Dt\nrot\nD\n=\n(~u0 + ω~ × ~r) + ω × (~u0 + ~ω × ~r)\nDt rot\nD~u0\n=\n+ ω~ × ~u0 + ~ω × u~0 + ~ω × (ω~ × ~r) .\nDt\nrot\nNow,\n~ω × (~ω × ~r) = (~ω · ~r)~ω -ω2~r =\n-ω2(~r - ~ω(~ω · ~r)\nω2\n) = -ω2 ~R\n(viz Figure 6.1).\nFigure 6.1: Centrifugal contribution to geopotential.\nThus, in a rotating frame, (6.11) becomes\n\n|\n{z\n}\nEquations of motion\n⎛\nCoriolis force ⎞\nD~u0\nz }| {\nρ ⎜\n+\n2~ω\nu0\n⎟ =\n~τ\n⎝ Dt\n× ~\n⎠\n-rp + r ·\n\nω2R2 !\n+\nρ~g + ρr\n.\n(6.17)\nusually combined as -ρrΩ\nwhere Ω ≡ geopotential. Note that, because of isotropy, the viscous term is\nthe same in rotating and non-rotating systems.\n6.7\nSpherical coordinates\nWe shall not derive the spherical equations here. The task is straightfor\nward. The most direct approach involves transforming our equations into\nvector-invariant form (note that ~\nnot vector-invariant), and then em\nu · r is\nploying spherical forms for the invariant operations.\nHere we will merely\nwrite down equations discussed in Holton (his section 2.3; N.B. Holton uses\nan approach different from what we have just described). Holton considers\na quasi-cartesian system on the surface of the earth (see Figure 6.2).\nSphere\nCartesian tangent plane\nr = a + z\ndz\nw = dz\ndt\nλ\ndx = a cos φ dλ u = a cos φ dλ\ndt\nφ\ndy = a dφ\nv = a dφ\ndt\nIf we define\nd\n∂\n∂\n∂\n∂\ndt ≡∂t + u∂x + v∂y + w∂z ,\nthen the equations for u,v, and w become\n\nDynamics in Atmospheric Physics\nFigure 6.2: Spherical coordinates with cartesian tangent plane.\ndu\nuv tan φ\nuw\n1 ∂p\ndt -\na\n+ a\n=\n-ρ ∂x + 2Ωv sin φ\n-2Ωw cos φ +\n(r τ )x\n(6.18)\nρ\n·\ndv\nu2 tan φ\nvw\n1 ∂p\ndt +\na\n+ a = -ρ ∂y -2Ωu sin φ + ρ(r · τ )y\n(6.19)\ndw\nu2 + v2\n1 ∂p\ndt +\na\n= -ρ ∂z -g + 2Ωu cos φ + ρ(r · τ )z .\n(6.20)\n(What about equations for energy, continuity, and the gas law?)\n6.8\nScaling\nScaling is an approach to non-dimensionalization which ideally permits or\ndering terms in an equation according to their size. For any variable, f, we\n\nEquations of motion\nmay write\nf = Ff,\n\nwhere\nF\n=\ncharacteristic magnitude\nf\n=\nO(1) non-dimensional quantity .\nSuch a redefinition leads to non-dimensional parameters which indicate the\nrelative importance of various terms in equations. Some of the more famous\nnon-dimensional numbers, and the physical balances they represent, are\nU\ninertia\nRossby No.:\nRo = 2ΩL ∼Coriolis force\nFroude No.:\nF r = gL\nU2 ∼ gravity\ninertia\nLU\ninertia\nReynolds No.:\nRe =\nν ∼friction\nRo\nν\nfriction\nEkman No.:\nEk = Re = 2ΩL2 ∼Coriolis force ,\n(where ν ≡μ/ρ). Note that there is little sense in scaling pressure in the\nabsence of either data or the size of other numbers.\nThe following are some serious problems with scaling:\n1. Northerly, westerly, and vertical scales and velocities are not necessarily\nthe same.\n2. Several scales for a single variable may be present in a single problem.\n3. Not all variables are measured.\nUltimately, scaling actually requires that we already have knowledge of the\nanswer! The following sections deal with some specific examples of scaling.\n\nDynamics in Atmospheric Physics\n6.9\nHydrostaticity\nAs already noted, hydrostaticity is, in general, an approximation. We will\nuse scaling to estimate the conditions needed for hydrostaticity to be a good\napproximation. One is tempted to note that g turns out to be much larger\nthan any acceleration or stress in Equation 6.20 - at least for most meteo\nrological and oceanographic systems. Thus, one might argue that the only\nterm left to balance g is 1 ∂p . This would, however, be a possibly misleading\nρ ∂z\nstatement. To see why, let us write\np =\np0(z) + p0(x, y, z, t)\nρ =\nρ0(z) + ρ0(x, y, z, t) .\nThe quantities p0 and ρ0 represent horizontal and time averages; the primed\nquantities represent deviations from these averages. In general, the averaged\nquantities dominate the above expressions; however, for stable stratification3 ,\nthe averaged terms are not directly involved in the dynamics (which depends\non gradients of pressure, density, etc.). Scaling must be done after p0 and ρ0\n(and T0) have been subtracted from p and ρ (and T ). The evaluation of the\nterm ρ0g in Equation 6.20 then requires knowing how ρ0 is related to w, and\nso forth. It is here that one has to involve the energy equation in the scaling,\nand one discovers that a necessary condition for hydrostaticity to hold is that\nNτ 1 (where N is the Brunt-Vaisala frequency and τ is a characteristic\ntime scale).\nThis is most easily seen for a linearized adiabatic Boussinesq fluid where\n(6.20) becomes\n∂w\n∂p\nρ\n∼-gρ -\n.\n(6.21)\n∂t\n∂z\nNow, ρ = ρ0 + ρ0, and ∂p0 = -gρ0. Subtracting these from (6.21), we get for\n∂z\nour vertical momentum equation\n∂w\n∂p0\nρ0 ∂t ∼-gρ0 -∂z .\n3We'll explain what this means soon.\n\n!\n\nEquations of motion\nSimilarly, the Boussinesq energy equation becomes\n∂ρ0\ndρ0\n+ w\n∼0.\n∂t\ndz\nFor convenience, let our variables have the following time dependence: eiωt .\nThe last two equations become\n∂p0\nρ0iωw\n∼\n-gρ -∂z\ndρ0\niωρ0\n.\n∼\n-w dz\nEliminating w from the above equations yields\n\nρ ω\ndρ0\ndz\n∂p0\nρ0 ∼-gρ0 -∂z ,\nfrom which we see that hydrostaticity requires that\nρ0ω2\ndρ0\ng dz\n1,\nor\nω2\nN2 1,\nwhere N2\ng dρ0 . The quantity N is called the Brunt-Vaisala frequency\nρ0 dz\n≡-\nand is a measure of the stratification. When N2 < 0, the fluid is statically\nunstable (that is, we have heavier fluid on top of lighter fluid)4 .\n4We will have much more to say about both the Brunt-Vaisala frequency and static\nstability in later chapters.\n\nDynamics in Atmospheric Physics\n6.10\nGeostrophy\nIn terms of scaling, one commonly finds that Ro 1 and Ek 1 so that\npressure gradients primarily balance the Coriolis force.\nWe also saw this\ndirectly in the data. Nevertheless, the existence of this approximate balance,\nalone, does not permit us to calculate the time evolution of flow fields. In\norder to exploit Ro 1 to calculate the time evolution of almost geostrophic\nfields we will have to perform a more sophisticated scaling analysis (not too\ndifferent from what we just did in connection with hydrostaticity) which\nleads to what are called the quasi-geostrophic equations. We will defer this\nanalysis until a later chapter.\nBefore ending this chapter, an important aspect of geostrophic balance\nneeds to be mentioned and pondered: namely, in the absence of viscosity,\nthermal conductivity, and x-variation, the following geostrophic flow is an\nexact solution of the nonlinear equations:\nT (y, z)\nas determined from Q = 0; that is, radiative equilibrium;\np, ρ\nas determined from hydrostaticity and the gas law;\nu\nas determined from geostrophy; and\nv = w\n= 0 .\nThe intrinsic difficulties with the above solution will form the focus for much\nof our discussion in Chapter 7."
    }
  ]
}