{
  "course_name": "East Asia in the World",
  "course_description": "This subject examines the interactions of East Asia with the rest of the world and the relationships of each of the East Asian countries with each other, from ca. 1500 to 2000 A.D. Primary focus on China and Japan, with some reference to Korea, Vietnam, and Central Asia. Asks how international diplomatic, commercial, military, religious, and cultural relationships joined with internal processes to direct the development of East Asian societies. Subject addresses perceptions and misperceptions among East Asians and foreigners.",
  "topics": [
    "Business",
    "Globalization",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Society",
    "Asian Studies",
    "Business",
    "Globalization",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Political Science",
    "International Relations",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2008, Ian Chapman (\nPDF\n)\n\nOverview\n\nThis subject examines the interactions of East Asia with the rest of the world and the relationships of each of the East Asian countries with each other, from ca. 1500 to 2000 A.D. The primary focus is on China and Japan, with some reference to Korea, Vietnam, and Central Asia. We ask how international diplomatic, commercial, military, religious, and cultural relationships joined with internal processes to direct the development of East Asian societies, and we address perceptions and misperceptions of each other by East Asians and foreigners.\n\nThis subject sweeps over large regions of time and space. It aims to put the contemporary discussion of globalization in historical perspective by examining the long-lasting interactions of East Asian countries with each other and the rest of the world. These connections were economic, political, cultural, and psychological. Topics include: global silver and trade flows, warfare and military technology, imperial domination and revolutionary resistance, and the role of historical memory, as in Nanking or Hiroshima. Sources include historical documents, pictures, films, and memoirs.\n\nRequirements\n\nI expect from you:\n\nRegular attendance at class and completion of reading assignments, and participation in weekly discussion meetings.\n\nThree middle length papers (6-8 pages each) discussing the general themes of each section of the course. Sample questions will be provided in advance.\n\nMidterm exam: a quiz on basic geography and important dates.\n\nFinal Exam, covering the material taught during the term.\n\nGrade Determination\n\nACTIVITIES\n\nPERCENTAGES\n\n3 Papers\n\n15% each\n\nMidterm\n\n10%\n\nDiscussion\n\n20%\n\nFinal Exam\n\n25%\n\nA Note on Plagiarism: Using someone else's work without acknowledgment is plagiarism. If you commit this crime, you will at the least get a failing grade on the paper, and at worst fail the course and be taken to the Committee on Discipline.\nLater, I will give you more detailed instructions how to cite sources and how to avoid unintentional plagiarism.",
  "files": []
}