{
  "course_name": "Ecology II: Engineering for Sustainability",
  "course_description": "This course provides a review of physical, chemical, ecological, and economic principles used to examine interactions between humans and the natural environment. Mass balance concepts are applied to ecology, chemical kinetics, hydrology, and transportation; energy balance concepts are applied to building design, ecology, and climate change; and economic and life cycle concepts are applied to resource evaluation and engineering design. Numerical models are used to integrate concepts and to assess environmental impacts of human activities. Problem sets involve development of MATLAB® models for particular engineering applications. Some experience with computer programming is helpful but not essential.",
  "topics": [
    "Engineering",
    "Civil Engineering",
    "Science",
    "Biology",
    "Ecology",
    "Earth Science",
    "Environmental Science",
    "Sustainability",
    "Engineering",
    "Civil Engineering",
    "Science",
    "Biology",
    "Ecology",
    "Earth Science",
    "Environmental Science",
    "Sustainability"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 2 hours / session\n\nCourse Focus\n\nUse mathematical models to assess interactions between humans and the natural environment.\n\nDesired Learning Outcomes\n\nBy the end of the course, you should be able to formulate and use mathematical models to:\n\nAssess human impacts on the environment\n\nAssess the economic value of natural resources\n\nBeyond this course, you should be able to:\n\nExpand your modeling abilities as you gain new understanding in science, engineering, economics, and other areas.\n\nApply what you have learned here in your career (not just to develop and use models yourself but also to critically assess model predictions generated by others).\n\nCourse Logistics\n\nGeneral Topics (Modeling Building Blocks)\n\nMass balance\n\nEnergy balance\n\nMass and energy transport\n\nResource economics and life cycle analysis\n\nClass Format\n\nGenerally, the first half of each class will be a lecture on concepts and the second half will be a discussion of a related modeling application. All model codes presented in class will be made available.\n\nAssignments\n\nProblem sets and research presentation (team-based), in-class quizzes, 2 exams, research paper (individual).\n\nThere will be no final exam.\n\nTeam Formation\n\nYou can form your own teams of 3 people or contact the TA for help in forming a team. Teams should be identified by the first recitation.\n\nMATLAB(r)\n\nModeling in this class relies largely on MATLAB. You should have access to MATLAB software (Basic MATLAB and the Optimization Toolbox). See the\ntools\nsection for more information on MATLAB.\n\nRecitations\n\nMATLAB tutorials\n\nCommunication tutorials\n\nHelp with problem sets\n\nExam reviews\n\nAttendance\n\nAttendance is important and will be considered in grading.\n\nIn-class Quizzes\n\n15 minute quizzes (one question each) will be given most weeks, usually on Wednesday during the middle of class.\n\nLaptops\n\nNo laptops open during lectures (OK during recitation).\n\nContact us if you need access to a laptop during recitation. Power outlets are limited so please make sure your battery is charged.\n\nComments and Feedback\n\nPlease provide comments and suggestions (anonymous or otherwise) as soon as an issue arises so we can make adjustments if necessary. We plan to set up a suggestion box for this purpose.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n20%\n\nShort quizzes\n\n10%\n\nExam 1\n\n25%\n\nExam 2\n\n25%\n\nPaper and presentation\n\n20%",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1 – Salination in Irrigated Agriculture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/fab76443af9c4c9c5535280287f6cc92_assn1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n1.020 Ecology II: Engineering for Sustainability\nProblem Set 1 -Salination in Irrigated Agriculture\nDue: 5PM Tuesday Feb. 19, 2008\nProblem Description\nThis modeling exercise considers the problem of salt accumulation in irrigated\nagriculture. The system of interest includes a river and two farms that divert irrigation\nwater from the river and discharge drainage water back to the river. Water and salt\naccumulate in the soil below each farm. Relevant mass flows and storages are shown in\nthe figure below. Each box is a separate mass balance control volume.\nE1, S E1\nE2, SE2\nFarm 1 Soil\nFarm 2 Soil\nVS1, S S1\nVS 2, SS 2\nQ1, S R1\nD1, SS1\nQ2, S R2\nD2, SS 2\n1 , S R\nR\n1,\nR\nR S\nV\n2 , S R\nR\n2 ,\nR\nR S\nV\n3 , S R\nR\n3 ,\nR\nR S\nV\n4 , S R\nR\nRiver section 1\nRiver section 2\nRiver section 3\nVRi Volume of water in river section i (m3)\nSRi Salt concentration in river section i (mg L-1)\nRi\nFlow into river section i and out of river section i-1 (m3 sec-1)\nSR1 Upstream salt concentration (mg L-1)\nVSi Volume of water stored in soil at Farm i (m3)\nSSi\nSalt concentration in soil at Farm i (mg L-1)\nEi Evaporation rate from soil at Farm i (m3 sec-1)\nSEi Salt concentration in water evaporated from soil at Farm i (mg L-1) -- note SEi = 0\nDi Drainage rate from Farm i (m3 sec-1)\nQi Irrigation diversion rate into Farm i (m3 sec-1)\nModel Specifications\nConstruct a MATLAB model that simulates the salinity history in the soil at each farm\nand in each section of the river, over a 100 day period.\n\nAssume:\n- All water mass balances are in steady-state (time derivatives are zero) but salt\nbalances are dynamic (time derivatives are not zero)\n- River and farm soil salt concentrations at beginning of first day all = 30 mg/L\n- River section volumes each = 3000000 m3\n- Soil storage volumes each = 6000000 m3\n-\nS R1 = 30 mg/L\n-\nR1 = 15 m3/sec\n- Nominal values of E1 = E2 = 3.5 m3/sec\n- Nominal values of Q1 = Q2 = 7 m3/s\n- SEi = 0 for all i (plants do not evaporate salt)\n- Use 1 day time steps and assume salt concentrations in flows between control\nvolumes are equal to the concentration value computed at the beginning of the\nday, throughout the day.\n- The maximum soil salinity S si must always be less that 230 mg/L or the crop will\ndie. Make sure this requirement is met when you adjust Q1 and Q2 .\n- In the model code, derive crop revenue for each farmer from the following yield\nequation:\nNi = γEi exp ⎡\n⎢[- Ssi\n⎤\n⎥\n⎣\n2S0 ⎦\nwhere S si is the maximum salinity over the 100 day growing period and S0 = 36\nmg/L. .\n-\nγ = 0.015 $/(m3/day)\nUsing the Model\n1. Nominal case: Plot the time histories of soil salt concentration at each farm and in\neach river section for the nominal values of E1, E2,Q1 and Q2 given above. What are the\nnominal farm revenues N1 and N 2 for both farms?\n2. Alternative case: Suppose that Farm 1 doubles its production by irrigating more land.\nThen its evaporation increases to E1 = 7 m3/s. Adjust the Farm 1 diversion Q1 to ensure\nthat Q1 ≥E1 and that S s1 ≤ 230 mg/L. What are the new farm revenues for both farms\nwhen E2 and Q2 are held fixed at their nominal values? What is the penalty paid by Farm\n2 when Farm 1 increases production? What do you think is a fair way to deal with this\n\"externality\"?\nSubmit via Stellar your MATLAB source file, the requested plots (as *.fig files), and a\ntext file with a few sentences summarizing your answers to the questions in the \"Using\nthe Model\" section. Be sure to define all variables and to identify all major calculations in\ncomments included in your MATLAB file (comments will be considered in the grade)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2 – Species Competition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/7f8693b0e6fd6cc3100e15a342bf07b3_assn2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n\n1.020 Ecology II: Engineering for Sustainability\n\nProblem Set 2 - Species Competition\nDue: 5PM Monday March 3, 2008\n\nProblem Description\nThis problem builds on the class lectures about predator-prey ecosytems. Rather than\npredation, we consider two similar species competing for a common resource. We use\nthe Lotka-Volterra competition model, which embodies the \"competitive exclusion\"\nprinciple:\n\"If two competing species coexist in the same niche in a stable environment then one\nspecies will eventually crowd out the other.\"\nOr, as a Chinese proverb succintly states:\n\n\"One hill cannot shelter two tigers\"\n\n二虎相鬥必有一傷\n\nThe model is based on the following versions of the logistic growth equation:\n\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n=\nK\nX\nX\nX\nr\ndt\ndX\n\nh\nK\nX\nX\nX\nr\ndt\ndX\n-\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n=\n\n=\nh\nif\n\nnom\nh\nX\n2 ≤\nnom\nh\nh =\nif\n\nnom\nh\nX\n2 >\n\nX and\nare the population biomasses (kg) of the two competing species and h is a\nharveting rate (kg day\nX\n-1) that represents human removal of Species 2. Species 2 could\nrepresent a commercially attractive tree or fish species. Species 1 could represent a\nniusance species that is excluded by the harvested species unless the harveting rate is too\nhigh. Harvesting is not feasible if\nnom\nh\nX\n2 ≤\n.\n\nThe Lotka-Volterra competition model is based on an extension of the carrying capacity\nconcept. The sum of the two populations determines the pressure on a common resource\nthat can sustain\n(carrying capacity) of Species 1 or\n(carrying capacity) of Species\n2. The remaining model inputs are the growth rate coefficients\nand\n(days\nK\nK\n1r\n2r\n-1) and the\ninitial populations.\n\nModel Specifications\nConstruct a MATLAB model that simulates the two populations over the time period\nof 500 days. You may adjust this period if you feel it would be useful.\n\nYou should adapt one of the MATLAB codes provided for the predator-prey examples\nin class. In particular, use the ode45 solver to solve the 2 population equations given\nabove. Then your primary programming task will be to rewrite the function rhs.\n\nAssume:\n-\nday\n2.0\n=\n= r\nr\n-1\n-\nkg (initial populations)\n)\n(\n)\n(\n=\n=\nX\nX\n-\n,\nkg (the resource can sustain more of Species 2)\n1 =\nK\n2 =\nK\n- To start, specify simulation times to go from 0 to 500 days in steps of 0.01 days.\n\nUsing the Model\n\n1. Nominal case:\n- Set\n(no harvesting) and show by running your program that the\ncompetition model obeys the \"competitive exclusion\" principle (i.e. Species 1\ncollapses). Why is Species 1 the one that is eliminated?\n=\nnom\nh\n- Derive all possible steady-state (equilibrium) populations for this nominal\nproblem.\n- Provide time histories of the two species populations (on the same graph) and a\nphase plot. Make sure you plot for enough time to clearly show the extinction of\nSpecies 1.\n\n2. Alternative :\n- In this case you should find the largest harvesting rate\nmax\nh\nhnom =\nthat allows the\nSpecies 2 population to dominate (i.e. any larger rate will cause Species 2 to\ncollapse). This value of\nmax\nh\nhnom =\nis the maximum sustainable harvesting rate.\nYou can find\nby gradually increasing\nfrom zero until Species 2 just\ncollapses. What are\nand the steady state values (read off the plot) for\nand\nwhen\nexceeds\n?\nmax\nh\nnom\nh\nmax\nh\nX\nX\nnom\nh\nmax\nh\n- Provide time series and phase plots when\nis slightly larger than\n.\nnom\nh\nmax\nh\n\n3. Comments: Do you believe that the Lotka-Volterra competition model gives a\nreasonable (but not necessarily perfect) description of species competition for the case\nwhere \"two competing species coexist in the same niche in a stable environment\"? Why?\nIn either case (model reasonable or not) find a textbook or article on competition that\nsupports your assertion with data or an appropriate species-specific example. Most\nEcology texts discuss this topic. To get credit you must cite a textbook or a refereed\narticle (not a web site).\n\nSubmit via Stellar your MATLAB source file, the requested plots (as *.fig files), and a\ntext file with answers to the questions in the \"Using the Model\" section. Be sure to define\nall variables and to identify all major calculations in comments included in your\nMATLAB file (comments will be considered in the grade)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3 – Thermal analysis for a small house",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/4559df843c3e191fe8a53141f11723db_assn3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n\n1.020 Ecology II: Engineering for Sustainability\n\nProblem Set 3 - Thermal analysis for a small house\nDue: 5PM Friday March 21, 2008\n\nA. Introduction\nIn this problem set you will be evaluating the energy performance of a house using a MATLAB\nmodel you construct. Your model will include heat gains and losses from heat conduction,\nconvection, and radiation as well as heat gains from a thermostatically controlled furnace. You\nwill be examining the effect of changing windows, and other structural components.\n\nB. House Description\nThe house consists of a single room and an attic with a roof. It is located in Harvard, MA.\n\n1. House dimensions: 8m by 8m in plan, walls 4m high (see diagram)\n\n2. Window dimensions: 3 windows each 2m by 1m\n\n3. Door dimensions: 2.5m by 1m\n\n4. Roof: Surface area 80m2\n, maximum height above room ceiling 3m.\n\n8m\n8m\nRoom\nTh(t)\n\nElevation\nPlan\n4m\nTotal roof area\n80m2\nRoof Tr(t)\nRoom\nTh(t)\nGround Te\nAir Ta(t)\n3m\n5. Furnace: Supplies heat to the main room (but not the attic), generates 26 kW of heat when\nswitched on.\n\n6. Thermostat: Set to 18 °C (switches furnace on when interior temperature is below 18 °C,\notherwise switches furnace off).\n\n7. Meterological data for Harvard MA:\nData are given for every 6 hours during a typical year (1999) in the data file harvardmet.txt\nfound in the PS3 section of the 1.020 Stellar site.\n\nThe file contains four columns:\n\nColumn 1: Time in days\nColumn 2: Global (total incident shortwave) solar radiation in Wm-2\nColumn 3: Outside air temperature in °C\nColumn 4: Sky temperature for computing incoming longwave radiation in °C\nColumn 5: Ground temperature below floor in °C\n\nUse dlmread to import the data into the MATLAB code.\n\n8. Nominal house construction details and conductive heat transfer coefficients (R-values\nquantify resistance only to conductive heat transfer, R - values in SI units).\n\nWalls:\n\nSection through wall\nWood frame as viewed\nfrom within roon\nGypsum\nwallboard\nWood stud/\nFiberglass-filled cavity\nFiberglass\nsheathing\nBrick\nFacade\nWood studs\n(~15% of total\nwall area)\nCavities (~85%\nof total wall\narea)\n\nMaterial\n\ngypsum\nwallboard\nwood stud\ncavity-\nfiberglass\ninsulation\nfiberglass\nsheathing\nbrick\nfacade\nR[m2 K/w]\n0.10\n0.55\n1.38\n0.70\n0.08\n% of layer area\n100%\n15%\n85%\n100%\n100%\n\nRoom ceiling:\nWood stud/\nFiberglass-filled cavity\nGypsum\nwallboard\nBlown fiberglass\ninsulation\nCeiling Section\n\nMaterial\n\ngypsum\nwallboard\nwood stud\ncavity-\nfiberglass\ninsulation\nblown\nfiberglass\ninsulation\nR[m2 k/w]\n0.10\n0.55\n1.38\n2.32\n% of layer area\n100%\n15%\n85%\n100%\n\nRoof:\n\nFloor:\n\nMaterial\n\ncarpet\npoured\nconcrete\nR[m2 k/w]\n0.37\n0.34\n% of layer area\n100%\n100%\n\nMaterial\n\nwood stud\n\ncavity- air\nplywood\nsheathing\nasphalt\nshingles\nR[m2 k/w]\n0.55\n0.18\n0.17\n0.08\n% of layer area\n15%\n85%\n100%\n100%\nAsphalt\nshingles\nPlywood\nsheathing\nWood stud/\nair cavity\nRoof Section\n\nWindows in walls:\n\nMaterial\n\nsingle pane\nR[m2 k/w]\n0.16\n% of layer area\n100%\n\nDoor in wall:\n\nMaterial\n\nwood,\nhollow core\nR[m2 K/w]\n0.67\n% of layer area\n100%\n\n9. Convection Coefficients\n\noutdoor\nindoor\nh [W/(m2K)]\n\n10. Heat Capacities\n\npr\nC\nAttic/Roof\n8 × 107 J °K-1\n\nph\nC\nRoom\n8 × 109 J °K-1\n\n11. Roof radiation emissivity: 1.0 (unitless)\n\n12. Roof radiative transfer coefficient:\n, T\nsky\nrad\nT\nh\nεσ\n=\nsky from harvardmet.txt\n\nC. Model Formulation:\nThe MATLAB model you need for this problem set can be constructed by modifying the\nMATLAB code Lecture08_8.m on the 1.020 Stellar site.\n\n1. Use SI (metric) units throughout\n\n2. Your model should solve for the following unknowns in your model:\nTemperature in the main room °C\nTemperature in the attic °C\n\n3. You should account for the fact that the outside roof temperature that controls\nconduction and convection between the attic and outdoors is different than the air\ntemperature. This requires you to include the effects of shortwave and net longwave\nradiation incident to the roof (See Lecture08_8through10 notes).\n\n4. Include the following heat transfer processes in your model:\nInto the attic:\n- Conductive and convective heat transfer entering attic through room ceiling.\n- Effective conductive and convective heat transfer entering attic through roof (account for\nthe effects of net longwave radiation).\n- Effective radiative heat transfer into attic (account for the effects of shortwave radiation\nincident to roof).\n\nInto the room:\n- Conductive convective heat transfer into room through room ceiling.\n- Conductive and convective heat transfer into room through walls, windows, and door.\n- Conductive and convective heat transfer into room through floor.\n- Do not include the effects of long wave or short wave radiation to or from the room\nwalls.\n\n4. Total simulation time: 1 year (same as the year of data in harvardmet.txt). Your\nsimulation times should be the same as the times given in this file..\n\nD. Problem Set Tasks\n\n*** All of the information requested below should be compiled in a single MS Word (or\nequivalent) file with all your team member names clearly identified in the file name and\nsubmitted via the 1.020 Stellar site ***\n\nNominal Case\n\n1. Plot following temperatures vs. time on one set of labeled axes (one figure) every 6 hours\nfor the entire year:\n- Outside air temperature (from harvardmet.txt)\n- Room temperature\n- Attic temperature\nUse model inputs obtained from the \"House Description\" section above.\n\n2. Compute total Heating Degree Days (HDD) for Harvard MA, in °C days\n\nNote that\n\n∫Δ\n-\n=\ndt\nT\nHDD\n)\n(\n\nT\nΔ\nis the difference between the mean daily temperature and 18°C.\nCompute the time integral from days 1-90 and days 275-365 (a total of 180 winter days).\nNote that an average temperature must be computed for each day, and dt is in days.\nYou can use the MATLAB function trapz to compute integrals (see MATLAB help)\n\n3. Compute total energy generated by the furnace to heat the house over the year (in\nJoules) (see the Lecture08_8.m code on the 1.020 Stellar site).\n\n4. Compute the cost of using home heating oil to generate the furnace energy derived in 4.\nAssume that one gallon of home heating oil produces 140,000 kJ.\nUse current prices for home heating oil.\n\n5. Provide a copy of the MATLAB code you used to generate results for the nominal case.\n\nEnergy Conservation Case\n\n1. Decide upon new designs for the windows and floor that will reduce the amount of home\nheating oil required to heat the house. Illustrate your designs with sketches similar to those\nprovided above for the ceiling and walls.\n\n2. Specify the R-values for each material used in your new window and floor designs.\nDerive new inputs for your simulation model from these R-values.\n\n3. Plot following temperatures vs. time on one set of labeled axes (one figure) every 6 hours\nfor the entire year of data supplied in:\n- Outside air temperature (from harvardmet.txt)\n- Room temperature\n- Attic temperature\nRevise the nominal model inputs as required by the design you described in 1. above.\n\n4. Compute total energy produced by the furnace over the year (in Joules) (see the\nLecture08_8.m on the 1.020 Stellar site).\n\n5. Compute the cost of using home heating oil to produce the furnace energy derived in 4.\nAssume that one gallon of home heating oil produces 140,000 kJ.\nUse current prices for home heating oil\n\n6. Compute the difference in yearly fuel oil cost between the nominal and energy\nconservation cases.\n\n7. Provide a copy of the MATLAB code you used to generate results for the energy\nconservation case."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4 – MATLAB Practice",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/fc82f115212f63a74cd1dfc2b2f10ac2_assn4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n\n1.020 Ecology II: Engineering for Sustainability\n\nProblem Set 4 - MATLAB Practice\nDue: 5PM Friday April 4, 2008\n\nIntroduction\nThis problem set is designed to give you some practice with MATLAB programming. You should\ndevelop your own programs rather than modify those handed out in class. The programming\nproblems given here are based on simplified versions of the Exam 1 problems.\n\nWrite your programs as MATLAB scripts rather than functions and display as many of your\ncalculations as possible (i.e. use semi-colons only when needed to suppress large amounts of\noutput). Also, try using the debugger (see HELP) to check your program if it is working correctly.\n\nFor this Problem Set only, please hand in individual rather than team solutions. You are free\nto consult with others if you have difficulties but your final MATLAB codes should be your own.\nYou will learn more if you are able to find and correct mistakes on your own. Please provide\n(to Stellar) electronic copies of the MATLAB ( .m) and plot (.fig) files, where requested. Also,\nprovide (to Stellar) an electronic text file with answers to the questions and be sure to include your\nname on all files.\n\nProblem 1. Mass Balance -- Transportation\nDescription: The 3 link transportation network shown below has the following characteristics:\nLink lengths (km): L2 = 10\nLink flows (vehicles hr-1): x1 = 40, x3 = 20\nTravel time for Link 2 (hrs): t2 = .01 x2\nSpeed on Link 2:\nt\nL\nS =\nkm hr-1.\nQuestion:\n1. Write a MATLAB script that specifies the values for all input variables and then computes the\nvehicle speed on Link 2\n\nLink 1\nLink 2\nLink 3\nNode A\n\nProblem 2. Mass Balance -- NAPL dissolution\nDescription: This question conerns the dissolution of a non-aqueous phase liquid (NAPL)\ntrichlorethane (TCA, C2H3Cl3 ) to dichloroethane (DCA, C2H4Cl2) in a closed system.\n\n1 mole of NAPL TCA yields 1 mole of dissolved TCA.\nUnknowns:\n= NAPL TCA mass (mol),\n= Dissolved TCA concentration (mol L\nntca\nM\ndtca\nC\n-1)\nControl volume\n= = 2 L\ncv\nV\nInitial dissolved TCA concentration = 0 mol L-1.\nInitial NAPL TCA = 1 mol\nThe NAPL TCA mass dissolves in the water at a rate r (mol day-1) given by:\n\nntca\ndissol\ndissol\nM\nk\nr\n=\n.0\n=\ndissol\nk\nday-1\nQuestions:\n1. Write differential equations for the unknown NAPL TCA mass and dissolved TCA\nconcentrations.\n2. Write a MATLAB script that computes and plots (with labels) these two unknowns as functions\nof time. Do not use MATLAB ODE functions (such as ODE45) to solve the differential\nequations. Instead, discretize the equations in time by. approximating the derivatives as follows:\n\nt\nM\nM\ndt\nt\ndM\nt\nt\nΔ\n-\n≈\n+1\n)\n(\n\nCompute the unknowns by solving the discretized equations recursively using a for loop, as was\ndone in the Everglades example of Lectures 1 and 2. Select a time step and overall simulation time\ninterval that are reasonable for the problem inputs. Try checking your program by running only a\nsmall number of time steps so you can examine each calculation to make sure it is doing what you\nwant.\n\nProblem 3. Energy Balance\nDescription: An outdoor swimming pool has the following properties:\nPool surface area: A = 100 m2 Pool volume: V = 200 m3\nSpecific heat of pool water:\n=\n=\n=\np\nv\nc\nc\nc\n4 KJoules kg-1 °C-1\nDensity of water:\n=\nρ\n.0 kg L-1\nLongwave radiative heat fluxes:\n\nwatts\npool\nout\nAT\nQ\nσ\n=\n&\n\nwatts\nsky\nin\nAT\nQ\nσ\n=\n&\nStefan Bolzman constant:σ = 5.7 E-8 (Wm-2K-4)\nPool-air surface convection coefficent:\n=\nconv\nh\n5 watts °C-1 m-2\nAssume\n= 15 °C + a uniformly distributed random fluctuation between -4 and +4 °C\ngenerated independently at each time t.\n)\n(t\nTair\nsky\nT\n= 5 °C (constant)\nThe initial pool temperature = 15 °C .\nTime step\n1 hr.\n=\nΔt\nTotal simulation time = 8 hrs.\n\nNight time conditions (no incident shortwave solar radiation)\nQuestions:\n1. Write a differential equation for the unknown pool temperature (with\nleft as a symbolic\nvariable).\n)\n(t\nTair\n2. Write a MATLAB script that computes and plots (with labels) the pool temperature as a\nfunction of time. Do not use MATLAB ODE functions (such as ode45) to solve the differential\nequation. Instead, discretize the equations in time as in Problem 2 above. Obtain the\nvalues\nyou need with the MATLAB function rand, which generates a random number between 0 and 1\neach time it is called (you need to use the number you obtain from rand to compute a random\nvalue for time t that ranges between 11 °C and 19 °C). The rand function will genearte\ndifferent random numbers every time you run it. If you want to use the same numbers repeatedly\nfor testing display them (no semicolon) the first time and enter them as an array in subsequent\ntests.\n)\n(t\nTair\n)\n(t\nTair\n\nFor this problem you should be able to display the results at each hour to make sure your program\nis doing what you want. After it is working correctly decrease the time step to see how your results\nchange.\n\nProblem 4. Mass Balance -- Closed Cycle Ecosystem Model\nDescription: A simple closed cycle ecosystem is composed of the 2 compartments of nitrogen\nshown in the figure below:\n\nDeath\nNet Uptake\nDissolved\nNd (kg N)\nPhytoplankton\nN1 (kg N)\n\nThe mass rates that control the N mass transferred along each path in the diagram are:\nPhytoplankton net uptake rate =\n⎥⎦\n⎤\n⎢⎣\n⎡\n+\nd\nd\nN\nN\nday-1\nPhytoplankton death rate =\n= 0.2 day\n1k\n-1\nOther inputs are:\nInitial dissolved nitrogen = 3 kg:\nInitial phytoplankton nitrogen = 1 kg:\nIncrease the dissolved nitrogen to 5 kg at time = 10 days\nTotal simulation time = 20 days\nTime step = 0.02 days\n\nQuestions:\n\n1. Write differential equations for the two unknown Nitrogen masses in this problem.\n2. Write a MATLAB script that computes and plots (with labels) these two masses as a function\nof time. Do not use MATLAB ODE functions (such as ODE45) to solve the differential\nequations. Instead, discretize the equations in time as in Problems 2 and 3 above. Be sure to\nincrease the dissolved nitrogen to 5 kg at time = 10 days, within your program.\n\nThis program will produce too much output to display all the calculations at every time step.\nInstead, if you want to check your results print out only the first few time steps or temporarily\ndecrease the simulation time to a small number so you can display each calculation."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5 – Particulate transport",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/fe47f90baff48d6f7888ee45a71d647c_assn5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n1.020 Ecology II: Engineering for Sustainability\nProblem Set 5 - Particulate transport\nDue: 5PM Weds. April 16, 2008\nA. Introduction\nIn this problem set you will be simulating particulate emissions from a single vehicle moving\nalong a straight road with a cross wind. You will develop a particle tracking model to visualize the\nparticulate plume and to compute atmospheric concentrations.\nB. Vehicle Description\nThe road in question extends along the x axis for 120 km.\nThe vehicle is moving at 60 km hr-1\nParticulate emissons are generated continuously at a rate of E = 2 gm min-1.\nA wind is blowing towards the +y direction at Vy = 30 km hr-1.\nThe x and y dispersivities are: Dx = Dy = 25 km2 hr-1\nSimulation time = 2 hr.\nD. Problem Set Tasks\n*** All of the information requested below should be compiled in a single MS Word (or\nequivalent) file with all your team member names clearly identified in the file name and\nsubmitted via the 1.020 Stellar site ***\nConstruct your own two dimensional (2D) MATLAB model for this problem.\nYour model should do the following:\n1. Compute x and y coordinates for a number of particles emitted from the moving vehicle\nover each time step. You should select reasonable values for the number of particles emitted\nand the time step duration to balance the realism of the results with the computation time.\n2. Determine the common mass value m of emissions represented by each particle.\n3. Display the particle locations at each time step with a 2D scatterplot movie. Include the\nfinal frame of the movie with your Stellar submission.\n4. Compute the concentration (in parts per billion) at the end of the simulation time in a bin\nat a location of your choosing.\nBe sure to select a bin size that is large enough to contain many particles but is small enough to\ngive a reasonably local value. Be sure to place the bin at a location where there are particles. For\ncalculating the concentration assume that the particle plume extends vertically 50 m. above the\nground.\n5. Provide a copy of the MATLAB code you used to generate your results."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6 – Resource Allocation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/6b5fc7f65f22684cc6d0b7903aa9276a_assn6.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n1.020 Ecology II: Engineering for Sustainability\nProblem Set 6 - Resource Allocation\nDue: 5PM Weds. April 30, 2008\nA. Introduction\nThe objective of this problem is to allocate agricultural water to maximize profits, subject to\nenvironmental constraints.\nB. Problem Description\nThere are 3 farms, all growing rice.\nWater is allocated by an irrigation district to each farm to maximize district income (over all 3\nfarms)\nThe maximum land available for cultivation is specified for each farm.\nYield is enhanced by fertilizer application.\nFertilizer cost is negligible\nTotal nitrogen runoff must not exceed a specified threshold.\nVariable definitions:\nObjective: Maximize F = ∑ pYi Li = Net district revenue ($ season-1)\ni=1\np = Rice price ($ tonnes-1)\nLi = Crop area for Farm i (ha)\nYi = Y0i + γ iFi = Net yield Farm i (tonnes ha-1 season-1)\nY0i = Nominal yield Farm i (tonnes ha-1 season-1)\nγ i = Fertilizer enhanced yield coefficient for Farm i (tonnes crop (kg fertilizer)-1)\nFi = Amount of fertilizer applied to Farm i (kg ha-1 season-1)\nNi =ηi Fi Lmax i = Nitrogen runoff from Farm i (kg season-1)\nLmax i = Maximum land area Farm i\n[Note: As a simplification, above expression assumes fertilizer is applied to entire farm]\nηi = Fraction of applied nitrogen that runs off Farm i (unitless)\nR = ∑ Ni = Total nitrogen runoff (kg season-1)\ni= 1\nW = ∑Wi Li = Total water used (MCM season-1)\ni=1\nWi = Unit water requirement Farm i (MCM ha-1 season-1)\n\nResource and environmental constraints:\nWater:\nWavail\nW ≤\nLand:\niL\ni\nLmax\n≤\nfor each Farm i\nNitrogen runoff:\nmax\nR\nR ≤\nC. Inputs\nPrice p = 200 $ tonne-1\nNominal rice yield Y0i tonnes ha-1\nFarm1 Farm2 Farm3\nFertilizer coefficient γ i : tonnes kg-1\nFarm1 Farm2 Farm3\n0.9\n1.2\n1.1\nNitrate runoff fraction ηi : unitless\nFarm1 Farm2 Farm3\n0.4\n0.35\n0.45\nWater requirement Wi : m season-1\nFarm1 Farm2 Farm3\n1.0\n1.2\n0.9\nResource limits\nResource\nSymbol Value\nUnits\nWater\nWavail\n2.4\nMCM season-1\nLand Farm1\nmax,1\nL\nha\nLand Farm2\nmax,2\nL\nha\nLand Farm2\nmax,3\nL\nha\nN Runoff Limit\nmax\nR\n0-5000 kg season-1\n\nD. Problem Set Tasks\n*** All of the information requested below should be compiled in a single MS Word (or\nequivalent) file with all your team member names clearly identified in the file name and\nsubmitted via the 1.020 Stellar site ***\n1. Use MATLAB's quadprog function to find the set of crop land areas and amount of\nfertilizer applied that maximizes revenue when Rmax = 5000 kg season-1. [HINT: Make sure\nthat you include all land, water, and nitrogen runoff constraints. Also, make sure that the Hessian\nmatrix you construct is symmetric].\n2. Determine the increase in revenue obtained if Rmax is reduced. Do this by plotting 1) the\nrevenue and 2) the shadow price of the nitrogen runoff constraint vs. Rmax over the range\nRmax = 0 to Rmax = 5000. Use the MATLAB function subplot to put the two plots in the same\nfigure window.\n3. Explain why the shadow price of the runoff constraint increases as the maximum\npermitted nitrogen increases [Hint: Examine the fertilizer yield coefficients as well as changes\nin cropland allocations to see how the benefits of fertilizer increase as greater amounts are\npermitted]."
    },
    {
      "category": "Exam",
      "title": "Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/64a29069438d0214e790af913562d0cc_practice1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n1.020 Ecology II: Engineering for Sustainability\nPractice Questions and Solutions for Exam 1 on March 17, 2008\nExam Review Friday March 14th, 2008 9-11am\n1. Mass balance\nA deep reservoir with vertical sides has a surface area of Ar m2. Water (density ρw) enters the\nreservoir at a rate of qin. The depth of water at a given time is h. An outlet of cross sectional area\nApipe m2 is situated at the bottom of the reservoir, and the flow out of the pipe can be expressed as\n2ghApipe\nqout =\na) Write a conservation equation for the mass of the water in the reservoir:\n(i)\nas a difference equation\nM t+Δt - M t = ρ wqin -ρ wqout = ρ wqin Δt -ρ w 2ght Apipe Δt\n(ii)\nas a differential equation\ndM = ρ wqin -ρ w 2ghApipe\ndt\nLeave your answer in terms of the water mass, ρw, qin, Ar and Apipep.\nb) Using the relations given above rewrite the differential conservation equation to give the\nchange of water depth with time.\nM = ρ A h\nw\nr\ndM\ndh\n= ρ w Ar\n= ρ wqin -ρ w 2ghApipe\nsince ρ w and Ar are constant.\ndt\ndt\nApipe\ndh = qin - 2gh\ndt\nA\nA\nr\nr\n\n2. Chemical kinetics\nIn the absence of oxygen, certain bacteria are able to respire anaerobically, using acetic acid as a\nsubstrate. In addition to CO2, the bacteria give off methane (CH4) in the process, and so the\nrespiration process is also known as methanogenesis. In a closed volume V Liters (e.g. an anoxic\nregion fairly deep under a lake's bottom) the following reaction occurs:\nCH3COOH →CH4 + CO2\n\nAcetic acid\nmethane\nThe rate (per second) at which the number of moles of acetic acid is used is = k1VCCH3COOH , with\nCCH 3COOH in mol/L. The molecular masses of the three species are: CH3COOH 60 g/mol, CH4\n16 g/mol, CO2 44 g/mol. The system starts off with a concentration of 1 mole/L of CH3COOH.\na) Using the mass balance (stoichiometry of the reaction) write differential equations for the\nrate change in mass concentration (g/L) of acetic acid, methane and CO2. Leave your\nanswer in terms of k1.\nb) Draw a rough plot of the changes in masses of the three species with time.\nVdCCH3COOH = -k1VCCH3COOH\ndt\ndCCH COOH ⎡mol ⎤\nAcetic acid:\ndt\n⎢⎣ Ls ⎥⎦\n= -k1CCH3COOH\ndCCH COOH ⎡ g ⎤\ng\ndt\n⎢⎣ Ls ⎥⎦\n= -k1CCH3COOH 60 mol\ndCCH4 ⎡ g ⎤\ng\ndCCO2 ⎡ g ⎤\ng\nMethane:\ndt\n⎢⎣ Ls ⎥⎦\n= k1CCH COOH 16 mol\nCO2:\ndt\n⎢⎣ Ls ⎥⎦\n= k1CCH COOH 44 mol\nPlot of concentration evolution with time:\nt(s)\nc (g/L)\nCH4\nCO2\nCH3COOH\n\n3. Closed system, nutrient cycle: benthic layer nitrogen\nThe nutrient modeling example given in the Lecture08_5 outline turns out to far underestimate\nthe measured levels of nitrogen on the bottom of the ecosystem (benthic layer).\nIt is found that nitrogen fixing bacteria are present on particles in suspension. They uptake the\ndissolved nitrogen in a first order process (rate of uptake directly proportional to dissolved\nnitrogen mass), and then they settle to the bottom. In addition, a small fraction of the dead\nphytoplankton and zooplankton (denoted by f), instead of becoming dissolved nitrogen, directly\nenters the sediment.\nThe original model is shown below. Subscripts 1=dissolved N mass, 2 = N mass in\nphytoplankton, 3 = N mass in zooplankton.\nIf we introduce a fourth compartment 4 = N mass in sediment, write down the rate equation for\nthe sediment nitrogen mass. Also, update the above three equations of this closed system model.\nSolution: Let the first order removal of dissolved N be equal sM1. Since we have a closed system,\nthe sink terms in one compartment must enter as source terms in the other compartments. The\nfour new equations, with the added terms in bold, are:\n\nLink 1\nLink 2\nxin = 66 vehicles hr-1\nxout = 66 vehicles hr-1\nNode 1\nNode 2\nx1, t1\nx2, t2\nLink 3\nLink 4\nx3, t3\nx4, t4\nNode 3\nNode 4\ndM = m&\n+ (1- f)(d M +d M )- g ⎜⎜⎛\nM\n⎟⎟⎞M + (1-ε )g ⎜⎜⎛\nM\n⎟⎟⎞M - sM\ndt\nboundary,1\n2 M + M\n3 M\n+ M\n⎝\n1h\n1 ⎠\n⎝\n2h\n2 ⎠\ndM 2\n⎛\nM1\n⎞\n⎛\nM 2\n⎞\n= g 2 ⎜⎜\n⎟⎟M 2 -d 2M 2 - g3 ⎜⎜\n⎟⎟M 3\ndt\n⎝ M1h + M1 ⎠\n⎝ M 2h + M 2 ⎠\ndM 3\n⎛\nM 2\n⎞\n= εg3 ⎜⎜\n⎟⎟M 3 -d 3M 3\ndt\n⎝ M 2h + M 2 ⎠\ndM4 = f(d 2M2 +d 3M3 ) + sM1\ndt\n4. Transportation\nThe traffic network shown below consists of four links (1 to 4) and four nodes (1 to 4)\nYou are given the following information:\ni) The travel time/flow equations for each link must be satisfied:\nLink 1: t1 = 15 ;\nt1 = Link 1 travel time (hrs) , x1 = Link 1 traffic flow (vehicles hr-1)\nLink 2: t2 = 1 + 0.2x2 ;\nt2 = Link 2 travel time (hrs) , x2 = Link 2 traffic flow (vehicles hr-1)\nLink 2: t3 = ? ;\nt3 = Link 3 travel time (hrs) , x3 = Link 3 traffic flow (vehicles hr-1)\nLink 2: t4 = 2 + 0.1x4 ;\nt4 = Link 4 travel time (hrs) , x4 = Link 4 traffic flow (vehicles hr-1)\nThe equilibrium time taken for both routes = 24.4 hours.\na) Find t3, the travel time for Link 3.\nFrom the equilibrium condition,\n1.\nt1+t2 = t3+t4 Æ 15 + (1+0.2x2) = t3+(2+0.1x4) = 24.4 hours\nThis gives 16+0.2x2 = 24.4 Æ x2 = 42 vehicles hr-1 = x1.\nFor nodes\n2.\nNode 3: x3=x4;\n\n3.\nNode 2: x1=x2\n4.\nNode 4: x2+x4 = 66 Æ x4 = 66-42 = 24 = x3\nTherefore from (1), t3 = 24.4 - (2+0.1*24) = 20 hours\nb) If the link lengths are equal and all vehicles are identical, which link (1-2 or 3-4) do\nyou think has the greater CO emissions rate (in gm CO km-1 hr-1)?\nSince x2>x4, everything else being equal there is more traffic volume in the top route and\ntherefore has greater CO emissions.\n5. Heat Transfer\nA 1 kg aluminum pan (specific heat cp = 900 J kg-1K-1), of surface area 0.01 m2, is being heated\non a butane burner in a room of fixed temperature Ta=20 degrees C.\na) Write a differential equation describing the time change in temperature of the aluminum\npan. Assume that the pan's temperature is uniform.\nWe are taking the pan as the control volume, and assume that the temperature is uniform\nthroughout. This means that we can neglect any internal conduction effects of the pan.\nEnergy balance:\ndU = Q&\nradin - Q&\nradout - Q&\nconv + Q&\nburner\ndt\ndU\ndT\ndT\ndT\nThe change of internal energy can be expressed as\n= C\n= C\n= mc\ndt\nv dt\np dt\np dt\nCv and Cp are virtually identical for solids. We are also only dealing with one material\n(aluminum) for which we can look up a specific heat value.\nRadiative heat out =Q&\nradin = AεσTa\n4 ;\nRadiative heat in = Q&\nradout = AεσT 4\nConvective heat out = Q&\n= Ah(T - T )\nconv\na\nSubsituting into the balance equation of internal energy and heat flow rates:\nmc p\ndT = AεσT 4 - AεσT 4 - Ah(T - Ta ) + Q&\nburner\ndt\na\ndT = 1 (AεσTa\n4 - AεσT 4 - Ah(T - Ta ) + Q&\nburner )\nOr dt\nmc p\nb) Say that the pan is now at a steady 100 degrees C. What is the mass of butane required\nper second to maintain this temperature? The heat of combustion of butane is roughly\n50kJ/gram\n\nTake hconv = 10 Wm-2K-1, Emissivities ε = 1.0.\nFrom part a, mc p\ndT = AεσTa\n4 - AεσT 4 - Ah(T - Ta ) + Q&\nburner =0 at steady state.\ndt\nRearranging, - AεσTa\n4 + AεσT 4 + Ah(T - Ta ) = Q&\nburner\nRadiative heat in = Qradin = AεσTa\n4 = 0.01m2 ×1.0 × 5.7 ×10-8\nm\nW\n2K × (293K)4 = 4.2W\nRadiative heat out = Qradout = AεσT 4 = 0.01m2 ×1.0 × 5.7 ×10-8\nm\nW\n2 K × (373K)4 = 11.0W\nConvective heat out = Qconv = Ah(T - Ta ) = 0.01m2 ×10 m\nW\nK (373 - 293K) = 8.0W\nQ&\nburner = -4.2 +11.0 + 8.0W = 14.8W\n(Note that the net radiative loss is nearly half of the net heat loss by the pan)\nThe equivalent amount of fuel per second used is\n=14.814.8 J ×\ng\n= 2.96 ×10-4 g\ns\n50000J\ns\nThis is ~1 gram per hour."
    },
    {
      "category": "Exam",
      "title": "Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/958a0c71aabb78069b7e7bdb73a7be5f_practice2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Civil and Environmental Engineering\n1.020 Ecology II: Engineering for Sustainability\nPractice Questions and Solutions for Exam 2 on May 7, 2008 9:30-11am\nExam Review Friday May 2nd, 2008 9-11am, Monday May 5th, 2008, 7-9pm\n1. Open Systems\na) A stream of 5 m3/s of cooling water at 15 °C flows through a power plant and accepts 10 MW\nof heat before leaving. What is the final temperature of the cooling water if this is happening\nat steady state? Use the following values: cp of water = 4200 J kg-1 K-1; density = 1000 kg\nm-3. Assume the water inside the power plant is well mixed.\nSolution: Open system energy conservation:\nmpowerplantcv\ndTout = m hin - m hout + Q\ndt\ndTout = 0;\nm hin = ρqcpTin\nm hout = ρqcpTout\ndt\nÆ\n0 = ρqcpTin -ρqcpTout + Q\n0 = ρqcp (Tin - Tout ) + Q\nSolving for Tout, Tout = Tin + Q\n= 19.8 °C.\nρqcp\nb) A room initially at 20 degrees C has constant ventilation from an outside breeze that enters\nand leaves on opposite sides of the room. The walls and windows are good insulators of\nconduction and convection. The walls do not transmit the incoming solar radiation into the\nroom, however it can emit radiation from the room outward to the outside. The windows\ninitially have their blinds shut, blocking off solar radiation. In the middle of the day, you\nopen the blinds. Assume that the solar radiation received is uniform on all surfaces of the\nroom. Write a differential equation for the unknown temperature of the room T. Calculate\nthe initial rate of increase in the temperature of the room (degrees C s-1) given the following:\nConstant volume specific heat of air: cv = 0.716 joule gm-1 °C-1 (to compute internal energy)\nConstant pressure specific heat of air cp = 1.0 joule gm-1 °C-1 (to compute enthalpy)\nIncoming solar radiation Sg= 1000 W m-2\nStefan Boltzmann constant σ = 5.7 ×10-8 W m-2 K-4\nSky temperature Tsky = -5 °C\nEmissivity of sky εsky =1\n\nEmissivity of windows εwindow = 0.8\nEmissivity of walls εwall = 0.05\nFlow of draft through room = 0.3 m3 s-1\nDensity of air: 1100 gm m-3\nVolume of room: 300 m3\nSurface area of room (excluding windows) = 170 m2\nSurface area of windows = 15 m2\nOutside air temperature: 20 °C\nSolution: Open system energy conservation:\ndT\ndT\nmroomcv\n= m hin - m hout + Q\nor\nρairVroomcv\n= m hin - m hout + Q\ndt\ndt\nEnthalpy terms (energy from flow in/out of system) m hin = ρqc pTin ; m hout = ρqcpTout\nQ = radiative heat terms (J/s)\n= Sg Awindows + ( Awindow + Awall )σεskyTsky - AwindowσεwindowT - AwallσεwallT\nTherefore the differential equation for T is\ndT\n=\n(ρqcpTin -ρqcpT + Sg Awindows + ( Awindow + Awall )σεskyTsky - AwindowσεwindowT - AwallσεwallT )\ndt\nρairVroomcv\nAt t= 0, T = Tin = 293K\ndT\n⎛⎜1000 m\nw 15m2 + (15 + 170)m25.7 ×10-8\nm\nW\nK ×1.0 × (268K)4\n⎞⎟\n=\ndt\n1200 g 300m30.716 J ⎜⎜- 15m25.7 ×10-8\nW\n× 0.8 × (293K)4 - 170m25.7 ×10-8\nW\n× 0.05 × (293K)4 ⎟⎟\nm3\ngK ⎝\nm 2 K 4\nm 2 K 4\n⎠\n=+0.236°Cs-1\n2. Transport/Diffusion\nWe start with the Langevin equation that describes a Random walk of a particle i:\nxi\nj,n+1 = xi\nj,n + V j\ni\n,nΔt + d jωi\nj,n\nj = 1,2,3\nWhere d j = 2D j Δt = Dispersion distance in direction j (m), D j = Dispersion coefficient in\ndirection j (m2 sec-1). The random walk model can be very useful, but to more accurately depict\nreal life situations the model must account for certain physical or chemical behaviors. This\nquestion address two complications found in reality: the presence of boundaries and particle\ndecay.\na) Write a MATLAB pseudocode that will model a continuous source at (0,0,0) located on a\nboundary (e.g. a wall). The wall extends infinitely on the y-z plane and is described by x=0. The\nparticles are released at the origin and diffuses into the region x>0, and cannot cross the wall.\nThere is a flow in the y direction of 15 m/s. Include in your code how you would account for the\nfact that particles are not able to cross the boundary. In the code use the following numbers:\n\nx\nD = Dy = Dz = 25 m2s-1. [HINT: the function abs(x) in MATLAB gives the absolute value of\nx].\nWall at x=0\nx\nz\ny\nContinuous\nsource at (0,0,0)\nb) Say that the particles in the above problem represent a substance that undergoes first order\ndecay, i.e. the concentration is in the form C = C0 exp( kt) . As an approximation, we assume\nthat if the particle persists for longer than three times the e-folding time, they will disappear.\nAdd to the pseudocode in part a) to account for the described decay behavior.\n\n[example code not included in MIT OpenCourseWare materials]\n\n3. Economics\nSuppose that a hybrid car costs $2500 more than and has a gas mileage 10 mi/gallon greater than\na conventional alternative (28 mi/gallon). If gasoline is $3.5/gallon and you drive 10,000 miles\nper year, is the hybrid economically justified purchase, assuming an annual interest rate of 5%\nand a car lifetime of 10 years?\nSolution:\nYearly fuel cost of hybrid car = 10000mi gal 3.5$ = $921.05 / year\nyr\n38mi gal\nYearly fuel cost of conventional car = 10000mi gal 3.5$ = $1250 / year\nyr\n28mi gal\nYearly fuel savings by hybrid vehicle = 1250-921.05 = $328.95/year\nTo translate the yearly savings to a present value, use the following:\n1 - (1 + r)-N\nCRF =\nr\n1 - (1 + 0.05)-10\nCRF =\n=7.72\n0.05\nPresent value = CRF × Bt = 7.72 × $328.95 = $2539.49\nSince the present value of the saving is greater than the initial extra cost of the hybrid, buying the\nhybrid car is worthwhile.\n4. Optimization - Resource allocation\nSupplier A and B distributes natural gas to Destinations 1 2 and 3. Their maximum natural gas\nproduction are PmaxA and PmaxB. The costs of transporting the natural gas from each supplier to\neach destination are different due to the difference in distances. These are listed in the table\nbelow.\nSupplier Cost of distribution c($/ton) to Destination\nA\ncA1\ncA2\ncA3\nB\ncB1\ncB2\ncB3\nThe demand over one year of natural gas from the three destinations are as follows\nDestination\nNatural gas demand d (tons yr-1) d1\nd2\nd3\nSupplier A and B would like to collectively minimize costs ($ yr-1) of natural gas distribution\n(tons yr-1) while meeting the demands of each destination (tons yr-1).\n\nSet up this optimization problem by defining the decision variables, objective functions, and\nconstraints. Determine whether you should use linprog or quadprog (linear or quadratic\nprogramming) and provide all of the matrices (with the values in symbolic form) that you would\nenter into the appropriate MATLAB program.\nSolution:\nDecision variables x = [PA1\nPA2\nPA3\nPB1\nPB2\nPB3]\nGas distribution from each supplier to demand (ton yr-1)\nObjective function:\nMinimize\nCost(x, $yr-1)\nP\nA2PA2 + cA3PA3 + cB1PB + cB2PB2 + cB PB3\n+ c\nc\n= A1 A1\nx\nConstraints:\nP\nPA\nPA\nPA\n≤\n+\n+\nA1\nmax\nSupply:\nPB\nPB\nPB\nPB\n≤\n+\n+\n≥\nmax\nP\nPB\nd1\n+\nA1\nPA\nPB\nd\nDemand:\n≥\n+\nPA\nPB\nd\n≥\n+\n[PA1\nPA2\nPA3\nPB1\nPB2\nPB\nNon-negativity constraints (lower bound):\n] ≥ 0\nThe objective function is linear with respect to the decision variables, so we will use linprog in\nMATLAB.\nThe syntax of linprog is\n[X,FVAL,EXITFLAG,OUTPUT,LAMBDA]= LINPROG(f,A,b,Aeq,beq,LB,UB)\nSo in the example:\n⎡cA1⎤\n⎡ ⎤\nPA\n⎡\n⎤\n⎡\n⎤\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥⎦\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\ncA2\ncA3\ncB1\ncB2\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\nmax\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢⎣\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥⎦\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢⎣\nPB\nmax\nf =\n; A =\n; b =\nd1\n; Aeq=[]; beq=[]; lb =\n; ub=[];\n-\n-\n- 1\nd\n-\n0 - 1\n- 1\nd\n-\n- 1\n-\n⎣cB3\n5.\n⎣ ⎦\n⎦\nMultiple objective optimization\na) There are 3 farms, all growing rice.\nWater is allocated by an irrigation district to each farm to maximize district income\n(over all 3 farms)\nThe maximum land available for cultivation is specified for each farm.\n\nYield is enhanced by fertilizer application.\nFertilizer cost is negligible.\nThe objectives of this problem are to 1) allocate agricultural water to maximize profits, and 2)\nminimizing the nitrogen runoff from the farms\np = Rice price ($ tonnes-1)\nLi = Crop area for Farm i (ha)\nYi = Y0i + γ iFi = Net yield Farm i (tonnes ha-1 season-1)\nY0i = Nominal yield Farm i (tonnes ha-1 season-1)\nγ i = Fertilizer enhanced yield coefficient for Farm i (tonnes crop (kg fertilizer)-1)\nFi = Amount of fertilizer applied to Farm i (kg ha-1 season-1)\nNi = ηiFiLmax i = Nitrogen runoff from Farm i (kg season-1)\nLmax i = Maximum land area Farm i\n[Note: As a simplification, above expression assumes fertilizer is applied to entire farm]\nηi = Fraction of applied nitrogen that runs off Farm i (unitless)\nR = ∑ Ni = Total nitrogen runoff (kg season-1)\ni= 1\nW = ∑Wi Li = Total water used (MCM season-1)\ni=1\nWi = Unit water requirement Farm i (MCM ha-1 season-1)\nResource and environmental constraints:\nWater:\nW ≤ Wavail\nLand:\nLi ≤Lmax i for each Farm i\ni) Define the decision variables and the two objective functions\nii) Introduce the constraints such that the two objective functions are combined into one\nminimization problem.\niii) Sketch the Pareto frontier for the tradeoff of revenue and Nitrogen for this problem.\nSolution\nThe two objective functions are\nMaximize revenue:\nMaximize\nRevenue(x) ( $yr-1) = p(Yo1L1 + γ1F1L1 + Yo2L2 + γ 2F2 L2 + Yo3L3 + γ 3F3L3 )\nx\nMinimize nitrogen runoff.\nMinimize Runoff = ∑ Ni = ∑ ηiFiLmax i\ni =1\ni =1\n\nx\nγ\nL1\nL1\n0 ⎡\n⎤\n⎡\n⎤\n⎤\nγ 2\nL2\nL2\nγ\nL3\nL3\n⎡\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎣\n]\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n]\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\nL1\n[\n⎣\np Y[\n⎦\nL2\nL3\nF1\nF2\nF3\nYo\nYo\n= - p\n+ -\no1\nγ\nF1\nF2\nF1\nF2\nγ 2\nγ\nF3\nF3\n0 ⎣\n⎦\n⎦\n1 T\nf T x\nHx +\n= 2\nBased on the constraints\nL1\n⎡\n⎤\nW1\n⎡\nW2 W3\nWavail\n⎡\n⎤\n⎤\nwater\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\nL2\nL3\nF1\nF2\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢⎣\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥⎦\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢⎣\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥⎦\nL1max\n2 max\nland1\nland2\nland3\nnitrogen runoff (2nd Objective function)\n≤ L\nL3max\nη\nη\nη\nLmax1\nLmax 2\nLmax 3\nR\nmax\nF3\n⎣\n⎦\nAx ≤ b\nAnd the lower bounds are\nL1\n⎡\n⎡\n⎤\n⎤\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n⎢\n≥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\n⎥\nL2\nL3\nF1\nF2\nF3\n⎦\n⎣ ⎦\n⎣\nThere are no equality constraints or upper bounds defined here, so the Aeq, beq and ub matrices\nare empty [].\nThis is now formulated in the same way as Problem Set 6. The tradeoff curve for revenue and\nNitrogen is therefore the graph of Revenue against Rmax, reproduced from PS6 here.\n\n6. Life Cycle Analysis\nThe process of making flat glass is complex and involves several materials, including silica sand,\nsoda ash, limestone, dolomite and cullets (recycled glass fragments). The tables below provide a\nsimplified list of input/outputs for some of the processes involved in the production of flat glass.\nDraw a process flow chart, construct technology and environmental matrices for a Life Cycle\nAnalysis and calculate the total Antimony Emissions for a final total economic output of 20 kg of\nflat glass. (Note: antimony and its compounds are toxic in a similar way as arsenic).\nFinal product: 20 kg of flat glass\nSilica Sand mining\nOutput\nInput\nSilica Sand: 1 kg\nSilica Sand (resource):1.15 kg\nAntimony: 1.7E-13 Kg\nTransportation 16t truck\nOutput\nInput\n16t truck: 1 ton-km\nDiesel fuel:0.21 kg\nAntimony: 3.691E-9 Kg\nFlat Glass production\nOutput\nInput\nFlat Glass: 1 kg\nSilica Sand: 0.51 kg\nAntimony: 2.91E-10 Kg\nSoda Ash (resource): 0.16 kg\n16t truck: 0.13 ton-km\nSolution:\nProcess flow chart\nSilica sand\nproduction\nTransportation by\n16t truck\nFlat glass\nproduction\n= Exchange\nto/from\nenvironment\nBased on the Process Flow chart and inputs and output table,\nThe A matrix is (note: convention is to read down each column and account for the processes\nrequired on each row, and not vice versa)\n\nA matrix\nFlat Glass\nkg\nSilica sand\nkg\nTransportation\n16t truck\n1ton-km\nFlat Glass 1kg\nSilica sand kg\n-0.51\nTransportation\n16t truck\nton-km\n-0.13\nThe economic matrix f is accounts for what we want out of the process; in this case it is 20 kg of\nFlat glass.\nf matrix\nEconomic\nmatrix\nFlat Glass 1kg\nSilica sand kg\nTransportation\n16t truck\nton-km\nIn order to scale up the production from 1 kg to 20 kg of flat glass, we need to calculate a scaling\nmatrix (s) from the economic matrix (f) and the technology matrix (A).\n-\n1 f\n-\n⎤\n⎡\n⎢\n⎢\n⎢⎣\n⎡\n⎡\n⎤\n⎤\n⎢\n⎢\n⎢⎣\n⎥\n⎥\n⎥⎦\n⎥\n⎥\n⎥⎦\n⎢\n⎢\n⎢⎣\n10.2⎥\n⎥\n⎥⎦\nA\n-\n-\n0.51\n1 0\ns =\n=\n=\n0.13 0 1\n2.6\n\nThe environmental matrix B consists of the resources and environmental variables\nB matrix\nFlat Glass\nkg\nSilica sand\nkg\nTransportation\n16t truck\nton-km\nSilica sand\n(resource)\nkg\n-1.15\nDiesel fuel kg\n-0.21\nSoda ash\n(resource) kg\n-0.16\nAntimony\nkg\n2.91E-10\n1.7E-13\n3.691E-9\nNow the required matrices are complete for carrying out the LCA - the g matrix gives the net\nresources produced or taken to produce 20 kg of flat glass. This is calculated by\n-\nSo the results can be tabulated as follows:\n⎡\n⎢\n⎢\n⎢\n⎢\n- 1.15\n⎡ - 11.73\n⎡\n⎤\n⎤\n⎥\n⎥\n⎥\n⎥⎦\n20 ⎤\n⎥\n⎥\n⎥\n⎥⎦\n-\n⎢\n⎢\n⎢\n⎢⎣\n=\n1.54\n0.21\n- 0.546\n⎢\n⎢\n⎢⎣\n10.2⎥\n⎥\n⎥⎦\nBs\ng =\n=\n- 0.16\n3.2\n2.6\n2.91E\n⎣\n- 10 1.7 E - 13 3.691E - 9\nE -\ng matrix\nResources produced\nfor 20 kg Flat glass\nSilica sand\n(resource)\nkg\n-11.73\nDiesel fuel kg\n-0.546\nSoda ash\n(resource) kg\n-3.2\nAntimony\nkg\n1.54E-8"
    },
    {
      "category": "Resource",
      "title": "Basic Thermodynamic Concepts, Building Energy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/501c6576c7cdc411ae6ef3892ee92baf_lec8_9.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLectures 08_8 & 08_9 Outline: Basic Thermodynamic Concepts, Building Energy\n\nMotivation/Objective\nDevelop a model to determine how construction materials affect inside temperature and heat loss\nin a small house.\n\nApproach\n1. Define system, identify unknown (interior temperature\n)\niT\n2. Write energy balance equation (rate form)\n3. Relate terms in balance eq to unknown temperature and other inputs\n4. Specify heat capacities, thermal resistances, meteorological inputs, etc, solve energy balance\neq. for unknown interior temperature (MATLAB)\n5. Compute heat loss, examine impact of building material properties\n\nConcepts and Definitions Needed:\nRelevant thermodynamic properties: Mass, volume, internal energy, enthalpy, heat capacity,\ntemperature\nEnergy balance, First Law of Thermodynamics for a closed system:\nIncrease in system energy = Energy in across system boundary = Heat in - Work out:\nIncremental form:\n\nW\nQ\nU\nΔ\n-\nΔ\n=\nΔ\nInfinitesimal form:\nW\nQ\ndU\nδ\nδ\n-\n=\n\nRate form:\nW\nQ\ndt\ndU\n&\n& -\n=\n\nInternal energy term: Write in terms of constant volume heat capacity\ndt\ndT\nC\ndt\ndU\ni\nvh\n=\n\nHeat mechanisms:\nConduction, convection into system:\nia\ni\nair\nh\nconv\ncond\nR\nT\nT\nA\nQ\n)\n(\n,\n-\n=\n&\n\nOutgoing radiation:\n\ni\nrad\nT\nQ\nεσ\n=\n&\n\nWork done: Assume zero for house problem\n\nComplete balance eqs:\nConsider only conduction & convection through walls & roof (no net radiation into house):\nia\ni\nair\nr\nia\ni\nair\nw\nroof\nwall\ni\nvh\nR\nT\nT\nA\nR\nT\nT\nA\nQ\nQ\ndt\ndT\nC\n]\n[\n]\n[\n-\n+\n-\n=\n+\n=\n&\n&\n, specify\n\nair\nT\n\nModel Results\nNote energy saved as insulation is improved."
    },
    {
      "category": "Resource",
      "title": "Chemical Kinetics, Dechlorination",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/b2397a9e71703ab40218f3304b3d72bf_lec3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLecture 08_3 Outline: Chemical Kinetics, Dechlorination\n\nMotivation/Objective\nDevelop model to evaluate impact of source size and microbial degradation rates on time-\ndependent concentrations of chlorinated hydrocarbons (TCE and daughter products). System is\nopen -- flowing water dissolves NAPL and transports dissolved constitiuents out of system.\n\nApproach\n1. Define system (open), chemicals of interest (compartments). Identify unknowns (mass of non-\naqueous liquid trichlorethene\nand concentrations of dissolved tricholorethene\n,\ndichlorethene\n, vinyl chloride\n, and ethane\n).\ntrinapl\nM\ntri\nC\ndi\nC\nvc\nC\neth\nC\n2. Identify chemical reactions, write mass balance equation for each chemical (rate form)\n3. Relate gain and loss terms in each balance equation to unknowns.\n4. Specify inputs and solve the coupled mass balance eqs. for the unknowns (MATLAB).\n5. Examine impacts of initial NAPL mass and degradation rates on concentration time histories.\n\nConcepts and Definitions:\nDefine multiple system properties (e.g. chemical concentrations).\nWrite separate mass balance for each chemical/compartment ( i = trinapl, tri, di, vc, eth):\n\ni\nloss,\ni\ngain,\ni\nout\ni\nin\ni\nCV\nm\nm\nm\nm\ndt\ndM\n&\n&\n&\n&\n-\n+\n-\n=\n,\n,\n,\n\nExpress masses & concentrations in moles and then convert to kg after solving equations\nMass gain and loss rates are related to rate of chemical reaction:\nFor:\nReaction rate\nq\nP\nB\nA\nqC\npC\nbC\naC\n+\n→\n+\nV\nm\nq\nV\nm\np\nV\nm\nb\nV\nm\na\nr\nQ\ngain,\nP\ngain,\nB\nloss,\nA\nloss,\n&\n&\n&\n&\n=\n=\n=\n=\n\nr depends on concentrations, may be derived from law of mass action for elementary reactions.\n\nFor the dechlorination example:\n1 mole trinapl dissolves to form 1 mole tri at constant rate:\n\n,\n⎩\n⎨\n⎧\n=\n>\n=\n=\n,\n,\ntrinapl\ntrinapl\ns\ntri\ngain\ntrinapl\nloss\nM\nM\nqC\nm\nm\n&\n&\n,\n=\ntrinapl\ngain\nm&\n, (\n= flow rate,\n= solubility)\nq\ns\nC\neth\nvc\ndi\ntri\nC\nC\nC\nC\n→\n→\n→\n(1 mole reactant yields 1 mole product in each of 3 reactions).\nThese dechlorination reactions are first-order:\ntri\ntri\ntri\ndi\ngain,\ntri\nloss,\nC\nVk\nVr\nm\nm\n=\n=\n= &\n&\n\ndi\ndi\ndi\nvc\ngain,\ndi\nloss,\nC\nVk\nVr\nm\nm\n=\n=\n= &\n&\n\nvc\nvc\nvc\neth\ngain,\nvc\nloss,\nC\nVk\nVr\nm\nm\n=\n=\n= &\n&\n\neth\neth\neth\neth\nloss,\nC\nVk\nVr\nm\n=\n=\n&\n\ni\ni\nout\nqC\nm\n=\n,\n&\nfor dissolved chemicals,\n,\n=\ntrinapl\nout\nm&\n,\n=\ni\nin,\nm&\nfor all chemicals.\n\nComplete Mass Balance Equations:\nInsert\ninto mass balances for all 5 chemicals. See MATLAB code.\ni\nloss,\ni\ngain,\ni\nout\ni\nin\nm\nm\nm\nm\n&\n&\n&\n&\n,\n,\n,\n,\n,\n\nModel Results\nNote how inputs affect times required for decay, sequence of concentration peaks."
    },
    {
      "category": "Resource",
      "title": "Closed Cycles, Nutrient Enrichment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/a0dfb5fe3b4730f6a7de24d9f88201a6_lec5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLecture 08_5 Outline: Closed Cycles, Nutrient Enrichment\n\nMotivation/Objective\nDevelop a model to track nitrogen mass in dissolved, phytoplankton, and zooplankton\ncompartments. Assess impact of nutrient enrichment.\n\nApproach\n1. Define system, compartments, fluxes. Identify unknowns (dissolved nitrogen mass\n,\nphytoplankton nitrogen mass\n, and zooplankton nitrogen mass\n)\nd\nN\np\nN\nz\nN\n2. Write mass balance equation for each compartment (rate form)\n3. Relate terms in each balance eq. to unknowns and other inputs\n4. Specify growth, predation, and other coefficients, solve the set of coupled mass balance eqs.\nfor the unknowns (MATLAB)\n5. Examine time-dependence of compartment masses with and without nutrient enrichment.\n\nConcepts and Definitions:\nSystem compartments provide mass labels, chosen for convenience.\nEach compartment's unknown = mass of a specified conservative constituent in that\ncompartment.\nConstituent mass is conservative but can move between compartments: mass gains and losses\nmust sum to zero over all compartments.\nFor ecological modeling conservative constituent = limiting nutrient (in this example: nitrogen)\nArrange compartments in a closed cycle (all mass remains within system compartments)\nRelate compartments by specifying mass fluxes (such as uptake, grazing, death) between them.\n\nCompartment mass balance eqs:\nz\np\nph\np\nz\np\nd\ndh\nd\np\nz\nz\np\np\nboundary\nd\nN\nN\nN\nN\ng\nN\nN\nN\nN\ng\nM\nd\nN\nd\nm\ndt\ndN\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n+\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n+\n+\n=\n)\n1(\n1,\nε\n&\n\nPlankton death\nGrazing residue\nDissolved uptake\n\nz\np\nph\np\nz\np\np\np\nd\ndh\nd\np\np\nN\nN\nN\nN\ng\nN\nd\nN\nN\nN\nN\ng\ndt\ndN\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n-\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n=\n\nGrazing uptake\nDissolved uptake Phyto death\n\nz\nz\nz\np\nph\np\nz\nz\np\nph\np\nz\nz\nN\nd\nN\nN\nN\nN\ng\nN\nN\nN\nN\ng\ndt\ndN\n-\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n-\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n=\n)\n1(\nε\n\nGrazing residue\nGrazing uptake\nZoo death\n\nModel Results:\nNote effect of changing enrichment level and coefficients that control mass fluxes."
    },
    {
      "category": "Resource",
      "title": "Derived Supply, Equilibrium, Groundwater Pumping",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/19dbb80ebf7abf855a22fe6c82d0e800_lec19.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_19 Derived Supply, Equilibrium, Groundwater Pumping\n\nMotivation/Objective\nExtend the derived demand model of Lectures 08_16 & 08_17 to include the cost of supplying\nwater from a single groundwater well. Combine derived supply and demand to obtain an\nequilibrium solution.\n\nApproach\n1. Derive an expression for the marginal cost of supplying water from a single groundwater well.\nIdentify factors affecting pumping cost.\n2. Add the supply curve calculation to the MATLAB program of Lectures 08_16 & 08_17\n3. Identify the equilibrium solution (intersection of supply and demand curves)\n4. Consider how problem inputs (aquifer transmissivity, energy cost, etc.) affect solution.\n\nConcepts and Definitions Needed:\nPumping cost at supply well depends on flow rate and depth to water:\nQ\nh\nz\nt\ng\np\nt\nE\np\nF\ng\ncost\n)\n(\n-\nΔ\n=\nΔ\n=\nρ\n&\n($ season-1) p = energy price ($ joule-1)\nE& = power required to pump water (watts), t\nΔ = length of irrigation season (sec season-1)\n=\ni\nQ\nPumping rate at i (m3 sec-1) ,\n=\ngz\nground surface elev. (m)\n=\nh\ngroundwater elev. (m)\n\nPumping at the well affects\n. Derive\nusing rate form of mass balance eq in radial coords:\nh\n)\n(Q\nh\nMass rate pumped from well = mass rate flowing through soil toward well\nMass balance:\nrq\nQ\nπ\nρ\nρ\n=\n(kg sec-1)\ndr\nr\ndh\nT\nq\n)\n(\n=\n= radial flow per unit width (m3 m-1sec-1)\nT =Soil transmissivity (m2 sec-1)\nSubstitute q in mass balance to get differential eq. for h:\nrT\nQ\ndr\nQ\ndh\nπ\n)\n(\n=\nSolve for h(Q):\n⎥⎦\n⎤\n⎢⎣\n⎡\n+\n=\nln\n)\n(\nr\nr\nT\nQ\nh\nQ\nh\nw\nπ\n\nwr\nr >>\n=\nwr\nwell radius (m)\ndistance where\n=\n0r\n)\n(\nh\nQ\nh\n=\n= water level at well when Q = 0\nMarginal cost of supplying water:\n[\n]\n⎥\n⎦\n⎤\n⎢\n⎣\n⎡\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n-\nΔ\n=\n-\nΔ\n∂\n∂\n=\n∂\n∂\n=\nln\n)]\n(\n[\n)\n(\nr\nr\nT\nQ\nh\nz\nt\ng\np\nQ\nQ\nh\nz\nt\ng\np\nQ\nQ\nF\nQ\nw\ng\ng\ncost\nπ\nρ\nρ\nμ\n($ m-3)\nInclude this expression in crop allocation optimization code from Lectures 08_16 & 08_17.\nPlot of\n)\n(Q\nμ\nvs Q gives derived supply (a curve).\nIntersection of supply\n)\n(Q\nμ\nand demand\n)\n(Q\nλ\ndefines equilibrium solution [\n].\n,\neq\neq\nQ\nλ\n.\n\nCrop Allocation Results with Groundwater Supply Cost Included\nSupply curve is linear in Q. Note dependence of equilibrium solution on problem inputs (price,\ntransmissivity, unpumped depths to groundwater, etc.)"
    },
    {
      "category": "Resource",
      "title": "Discounting, Building Energy Revisited",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/cc07f0b044c65b68c690c07ea0a74e77_lec15.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_15 Outline: Discounting, Building Energy Revisited\n\nMotivation/Objective\nDetermine the economic benefits of installing more energy efficient windows in the small house\nanalyzed in Problem Set 3.\n\nApproach\n1. Use the model of Problem Set 3 to determine the heating fuel consumed with and without\nimproved (higher R value) windows.\n2. Add present value and amortization to house energy MATLAB code\n3. Compare present value of energy costs saved with improved windows vs. cost of purchasing\nand installing the windows.\n4. Alternatively, compare amortized monthly payment on loan to purchase windows with\nmonthly savings in heating bill\n\nConcepts and Definitions Needed:\nTemporal allocation of benefits and costs\nNet present value: convert all benefits and costs to a single value at beginning of time period.\nAmortization: Convert present benefits/costs to equal periodic (e.g. annual) payments\n\nEquations:\nInterest rate for each time period = r, number of time periods = N\nPresent value\nof benefit B\nPV\nB\nBt at end of period t:\n\nt\nt\nPV\nB\nr\nB\n-\n+\n=\n)\n1(\nPresent value\nof benefit C\nPV\nC\nt at end of period t:\n\nt\nt\nPV\nC\nr\nC\n-\n+\n=\n)\n1(\nNet present value of a stream of benefits (or costs) accrued over N periods:\n\n∑\n=\n-\n+\n+\n=\nN\nt\nt\nt\nNPV\nB\nr\nB\nB\n)\n1(\n∑\n=\n-\n+\n+\n=\nN\nt\nt\nt\nNPV\nC\nr\nC\nC\n)\n1(\nFor equal benfits (or costs) incurred every period after initial time:\nt\nNPV\nB\nCRF\nB\n)\n(\n=\n\nt\nNPV\nC\nCRF\nC\n)\n(\n=\nr\nr\nCRF\nN\n-\n+\n-\n=\n)\n1(\n\nAmortized amount\n(payment over each period) of amount\nborrowed or received at initial\ntime:\nt\nC\nC\nCRF\nC\nCt\n=\nTotal paid over N periods:\nCRF\nNC\nCtot\n=\n\nImplications\nClassical exponential discounting minimizes advantages of future benefits (e.g. abundant clean\nwater for the next generation) and disadvantages of future costs (e.g. increased sea levels due to\nclimate change). For this reason classical discounting has been criticized by some environmental\neconomists. Classical exponential discounting should be used with caution.\n\nModeling Example -- Improved Windows\nNote how much energy must be saved for investment in new windows to be justified."
    },
    {
      "category": "Resource",
      "title": "Economic Optimization, Derived Demand, Irrigation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/a3bc7242a1520912a349cd9b0c42d7ec_lec16_17.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_16 & 08_17 Economic Optimization, Derived Demand, Irrigation\n\nMotivation/Objective\nDevelop a model/optimization procedure to determine the most economically productive way to\nallocate limited resources (land and water) for a farm growing 2 crops.\n\nApproach\n1. Formulate allocation of limited resources as an optimization (quadratic programming)\nproblem. Define objective (maxmize crop revenue, $), decision variables (land for each crop,\nha), constraints (water and land limitations).\n2. Put problem in a form suitable for solution in MATLAB. Construct all matrices required by\nMATLAB quadprog function.\n3. Solve problem in MATLAB and evaluate sensitivities to resource constraints (also called\nshadow prices or Lagrange multipliers) for a range of water availabilities.\n4. Consider how problem inputs (crop yield, crop water demand, crop prices, etc.) affect\nsolution.\n\nConcepts and Definitions Needed:\nResource allocation -- to obtain derived demand we focus on effect of resource limits on crop\nrevenue.\nGeneral resource allocation optimization problem:\n)\nrevenue(\nNet\n\n)\n(\n\nx\nx\nF\nMaximize\nrev\nx\n=\n($)\n\nObjective function\nx = vector of quantities produced\n\nDecision variables\nSuch that following constraints hold for each resource:\nResource used (x) ≤ Resource available\n\nInequality constraints\nUpper and lower bounds on x\n\nInequality constraints\nPhysical constraints (e.g. mass, energy balance)\nEquality constraints\n\nFor 2 crop example this becomes:\nObjective:\nMaximize\n,\nPrice crop i ($ tonne\ni\ni\ni\nrev\nx\nY\np\nx\nF\n∑\n=\n=\ni\n\n)\n(\n=\nip\n-1)\n=\niY\nYield crop i (tonne ha-1 season-1)\n\n)\n(\n=\nx\nFrev\nrevenue ($ season-1 )\n]\n[\nx\nx\nx =\n,\n=\nix\nArea crop i (ha)\ni\ni\ni\ni\nx\nd\nY\nY\n-\n=\n\n= nominal yield (tonne ha\niY\n-1 season-1)\n=\nid\nyield reduction coef (tonne ha-2 season-1)\nConstraints: (MCM = 106 m3) ,\n=\ni\nw\nWater rqmt crop i (MCM ha-1 season-1 )\n\nWater:\n= water available (MCM season\nQ\nx\nw\ni\ni\ni\n≤\n∑\n=\n-1 )\n\nLand:\n= land available (ha)\navail\ni\ni\nL\nx ≤\n∑\n=\n\nNonnegativity: xi ≥ 0 i = 1, 2\n\nInput Arrays for MATLAB (quadprog):\nQuadprog format:\nx\nf\nHx\nx\nx\nF\nMinimize\nT\nT\nrev\nx\n+\n= 2\n)\n(\n\nFind decision variables x that minimize\n)\n(x\nFrev\n:\nsuch that\n\nInequality constraints\nb\nAx ≤\n\nEquality constraints\neq\neq\nb\nx\nA\n=\n\nLower and upper bound constraints\nub\nlb\nx\nx\nx\n≤\n≤\nFor 2 crop resource allocation problem (converted to minimization problem):\n]\n[\nY\np\nY\np\nf\n-\n=\n⎥⎦\n⎤\n⎢⎣\n⎡\n=\nd\np\nd\np\nH\n\n[0 0]\n⎥⎦\n⎤\n⎢⎣\n⎡\n=\nw\nw\nA\n⎥⎦\n⎤\n⎢⎣\n⎡\n=\navail\nL\nQ\nb\n=\nlb\nx\n[]\n=\n=\n=\nub\neq\neq\nx\nb\nA\n(unused for this example)\nMake sure that H is a symmetric matrix.\nShadow price of water =\nQ\nx\nF\nQ\nrev\n∂\n∂\n=\n)\n(\n)\n(\nλ\n, ($ m-3)\nPlot of\n)\n(Q\nλ\nvs\ngives derived demand (a curve).\nQ\n\nCrop Allocation Example Results\nCrop 2 (lower water rqmt) preferred over Crop 1 (higher value per ha), especially when water is\nlimited.\nPlots show that revenue increases at a diminishing rate as available water increases\nDemand for water decreases as available water increases\nResults depend strongly on yield loss coefficient"
    },
    {
      "category": "Resource",
      "title": "Introduction, Mass Balance, Everglades",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/860c054b34c45afc0d5520bdaad4a063_lec1_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nLectures 08_1 & 08_2 Outline: Introduction, Mass Balance, Everglades\n\nIntroduction: See course information sheet\n\nMotivation/Objective:\nDevelop a model to compute time-varying phosphorous concentrations in a stormwater detention\npond. Examine effect of pond size.\n\nApproach:\n1. Define system, control volume (CV), system properties, identify unknown (dissolved pond\nphosphorous concentration Ct at time t)\n2. Write mass balance equation (incremental, over a specified time interval)\n3. Relate boundary and gain/loss terms in mass balance equation to unknown Ct .\n4. Specify all inputs, solve mass balance equation for unknown (MATLAB)\n5. Use model to evaluate how different pond characteristics affect phosphorous concentration.\n\nConcepts and Definitions:\nDefinitions: system, surroundings, control volume\nDistinguish isolated, closed, open systems\nThermodynamic systems are described by bulk system properties, processes\nDistinguish mass inflows/outflows across CV boundary from internal gains/losses.\nMass Conservation:\nIncremental form:\nloss\ngain\nout\nin\ncv\nM\nM\nM\nM\nM\nΔ\n-\nΔ\n+\nΔ\n-\nΔ\n=\nΔ\nover [t, t+1]\n\nInstantaneous (or rate) form:\nloss\ngain\nout\nin\ncv\nm\nm\nm\nm\ndt\ndM\n&\n&\n&\n&\n-\n+\n-\n=\n\nSteady-state:\n=\n=\nΔ\ndt\ndM\nM\ncv\ncv\n\nDistinguish conservative vs non-conservative system properties.\nRelationship between mass and concentration:\ncv\ncv\ncv\nC\nV\nM\n=\n\nFor Everglades example (open system):\n\n,\n,\n,\n,\n,\n=\nΔ\nΔ\n=\nΔ\nΔ\n=\nΔ\nΔ\n=\nΔ\n-\n=\nΔ\n+\ngain\nloss\nt\nout\nt\nin\nin\nin\nt\nt\ncv\nM\nt\nC\nM\nt\nqC\nM\nt\nC\nq\nM\nVC\nVC\nM\nα\n\nq = flow rate (m3 hr-1) (inflow = outflow), Cin = phopsohorous concentration in inflow\n\nFinal Mass Balance Equation (expressed in terms of the unknown concentration Ct):\n\nq\nV\nC\nt\nt\nt\nC\nC\nt\nt\nin\nt\n=\nΔ\n-\nΔ\n-\n+\nΔ\n=\n+\nτ\nα\nτ\nτ\n,\n]\n1[\n,\n= residence time , Δt = interval (hrs) between t and t+1\n\nModel Results\nNote impact of pond volume and plant uptake rate on magnitude and variability of pond\nphosphorous concentrations."
    },
    {
      "category": "Resource",
      "title": "Life Cycle Assessment -- Concrete Production",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/5d1ef386d360eac948e57051f836ccbd_lec21_22.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_21 & 08_22 Life Cycle Assessment -- Concrete Production\n\nMotivation/Objective\nDevelop a Life Cycle Assessment (LCA) that identifies the resources consumed and waste\nproduced in the manufacture of 1 m3 of concrete.\n\nApproach\n1. Identify the product of interest (e.g. concrete), specify relevant processes, draw system\nboundaries to define scope of the LCA.\n2. Define inputs and outputs for the processes included in the LCA. Distinguish economic and\nenvironmental variables. Define units for all variables.\n3. Construct technology matrix (A) and environmental matrix (B). Estimate values for matrix\nelements from LCA data bases (available on-line for a fee).\n4. Use MATLAB to solve LCA matrix equations for environmental vector (g).\n5. Analyze environmental effects of production. Review analysis, refine boundaries, processes,\ndata as required.\n\nConcepts and Definitions Needed:\nConstruct process flow chart for specified product. Define system boundaries.\nEconomic variables: Describe products manufactured within system boundaries as well as\nenergy and transportation required.\nEnvironmental variables: Describe natural resources and wastes crossing system boundaries.\nLCA Model:\n\nEquation for evaluating scaling vector\nf\nAs =\n\nA = Specified economic matrix (square)\nValue in each element of A is amount of row variable (economic variable) required\nto produced 1 unit of column variable (economic variable).\nAll diagonal elements are +1, Other entries (inputs) are < 0.\n\nf = Specified economic output vector (specifies that 1 m3 concrete is to be produced)\ns = Scale vector (specifies amount of each economic variable produced/consumed to\nobtain 1 m3 of concrete).\n\ng\nf\nBA\nBs\n=\n=\n-1\nEquation for evaluating environmental vector\n\nB = Specified environmental matrix\nValue in each element of B is amount of row variable (environmental variable)\nproduced/consumed to obtain 1 unit of column variable (economic variable).\nEntries for resources consumed are < 0. Entries for wastes produced are > 0.\ng = Environmental output vector (specifies amount of each environmental variable\nproduced/consumed to obtain 1 m3 of concrete)\nSolve equations for s and g in MATLAB.\n\nResults for Concrete Example\nExamine A, B, s, and g arrays to determine impacts of different parts of the manufacturing\nprocess (see MATLAB code). Note 300 kg CO2 generated to produce 1 m3 concrete."
    },
    {
      "category": "Resource",
      "title": "Mass Transport, Diffusion, Air Quality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/2eab472726e2df656623a586d7bf1074_lec12_13.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_12 & 08_13 Outline: Mass Transport, Diffusion, Air Quality\n\nMotivation/Objective\nDevelop a model to examine spatial variations in the concentration of a chemical plume emitted\nfrom a line source (e.g. vehicles traveling on a road).\n\nApproach\n1. Generalize bulk system concept to provide for spatial variability. Define particles, identify\nsource, emission rate, diffusion/dispersion process.\n2. Construct rule for particle transport over time and space.\n3. Relate chemical concentration to particle density.\n4. Simulate transport in MATLAB and plot particles and concentrations.\n5. Examine impact of emissions rate, mean velocity and dispersion coefficient.\n\nConcepts and Definitions Needed:\nDefine point particles, each identified with a small fixed mass (m) of chemical and described by\nits changing spatial coordinates\n(particle i, time step n)\n]\n,\n,\n[\n,3\n,2\n,1\ni\nn\ni\nn\ni\nn\ni\nn\nx\nx\nx\n=\nx\nParticles move with fluid that contains them (advection). Fluid velocity =\n\nn\nV\nParticles move randomly within fluid due to molecular motion (diffusion) and small variations in\nfluid velocity not included in\n(dispersion).\nn\nV\nRandom particle displacement\n=\n\nn\nω\n]\n,\n,\n[\n,3\n,2\n,1\ni\nn\ni\nn\ni\nn\nω\nω\nω\nMean(\n)=0, Variance\n, all\nuncorrelated\ni\nn\nj,\nω\n)\n(\n,\n=\ni\nn\nj\nω\ni\nn\nj,\nω\nParticle transport eq. describes changes in particle coords. over time t\nΔ :\n\n,\n,\n\ni\nn\nn\ni\nn\ni\nn\nd\nt\nV\nx\nx\n,1\n,1\n,1\n,1\nω\n+\nΔ\n+\n=\n+\ni\nn\nn\ni\nn\ni\nn\nd\nt\nV\nx\nx\n,2\n,2\n,2\n,2\nω\n+\nΔ\n+\n=\n+\ni\nn\nn\ni\nt\ni\nn\nd\nt\nV\nx\nx\n,3\n,3\n,3\n,3\nω\n+\nΔ\n+\n=\n+\n\nt\nD\nd\nj\nj\nΔ\n=\n= Dispersion distance coord. j, (m),\n= Dispersion coef. coord. j (m\nj\nD\n2 sec-1)\nSpatial characteristics of sources: point vs distributed sources\nTemporal characteristics of sources: pulse vs continuous sources\nBulk properties of the plume can be described by its first and second spatial moments.\nFor point source, constant\n(see attached supplement for 1 dimensional derivation):\nn\nV\n\nFirst moment (plume center):\n\nt\nV\nx\nt,\nV\nx\nt,\nV\nx\n,n\n,,n\n,n\n=\n=\n=\n+\n+\n+\n,\nt\nn\nt\nΔ\n=\n\nSecond moment (plume length/width/height):\n\nt\nD\nt\nx\nt,\nD\nt\nS\nt,\nD\nt\nS\n,n\n,,n\n,n\n=\n=\n=\n=\n=\n=\nω\nω\nω\nσ\nσ\nσ\nConcentration computed from particles in specified volumes:\n\np\nnp\nV\nmN\nC\n≈\nnp\ngm m-3 = approximate chemical concentration in cell (pixel) p at time t\nModeling Example -- Air Quality\nNote how particle spreading depends on dispersion coefficient and mean velocity. Plot spatial\nmoments vs. time.\n\nSupplement: Derivation of spatial moments for point source in one dimension (x1):\n\nAssumptions:\n1) Point source at origin:\n\n,1\n=\nix\n2) Mean(\n) =\ni\nn,1\nω\n∑\n=\n=\n=\nP\ni\ni\nn\nn\nP\n,1\n,1\nω\nω\n\n3) Uncorrelated\n: Correlation =\ni\nn,1\nω\n∑\n=\n=\n=\n-\n-\nn\nm\nj\ni\nn\nj\nn\nm\ni\nm\nor\n\n,1\n,1\n,1\n,1\n)\n)(\n(\nω\nω\nω\nω\n\n4) Constant V1n = V1 (same for every particle at all times\n5) Variance(\n) =\ni\nn,1\nω\n∑\n∑\n=\n=\n=\n-\n=\nP\ni\ni\nn\nP\ni\nn\ni\nn\nP\nP\n,1\n,1\n,1\n)\n[(\n)\n[(\nω\nω\nω\nσ ω\n= 1\nIf ω is distributed uniformly betweeen\nmax\nω\n-\nand +\nmax\nω\n,\nmax =\nω\ngives\n\n2 =\nω\nσ\n\nFirst and second moments are derived from the solution to the particle transport equation:\n\ni\nn\ni\nn\ni\nn\nω\nd\nt\nV\nx\nx\n,1\n,1\n,1\n+\nΔ\n+\n=\n+\n→\n\n∑\n=\n+\nΔ\n=\nn\nm\ni\nm\ni\nn\nω\nd\nt\nn\nV\nx\n,1\n,1\n\nFirst spatial moment, invoke Assumption 2 :\nt\nV\nt\nn\nV\nω\nP\nd\nt\nn\nV\nω\nP\nd\nt\nn\nV\nx\nP\nx\nn\nm\nP\ni\ni\nm\nP\ni\nn\nm\ni\nm\nP\ni\ni\nn\nn\n,1\n,1\n,1\n,1\n=\nΔ\n=\n⎥⎦\n⎤\n⎢⎣\n⎡\n+\nΔ\n=\n⎥⎦\n⎤\n⎢⎣\n⎡\n+\nΔ\n=\n=\n∑\n∑\n∑∑\n∑\n=\n=\n=\n=\n=\n\nSecond spatial moment:\n∑∑∑\n∑∑\n∑\n∑\n∑\n=\n=\n=\n=\n=\n=\n=\n=\n=\n⎥⎦\n⎤\n⎢⎣\n⎡\n=\nΔ\n-\n+\nΔ\n=\n-\n=\nP\ni\nn\nl\nj\nm\nn\nm\ni\nl\nP\ni\nn\nm\ni\nm\nP\ni\nn\nm\ni\nm\nP\ni\nn\ni\nn\nn\nω\nP\nd\nω\nP\nd\nt\nn\nV\nω\nd\nt\nn\nV\nP\nx\nx\nP\nS\n,1\n,1\n,1\n,1\n,1\n,1\n,1\n)\n(\n)\n(\nω\n\nSeparate terms of final summation into 2 parts, invoke Assumption 3:\n\n[\n]\n[\n]\nt\nD\nt\nnD\nP\nnd\nP\nd\nP\nd\nω\nP\nd\nS\nP\ni\ni\nm\nP\ni\nn\nm\nj\ni\nj\nn\ni\nm\nP\ni\nn\nm\ni\nm\nP\ni\nn\nl\nj\nm\nn\nm\ni\nl\nn\n,1\nor\n\n,1\n,1\n,1\n,1\n,1\n,1\n=\nΔ\n=\n=\n⎥\n⎦\n⎤\n⎢\n⎣\n⎡\n+\n=\n=\n∑\n∑\n∑\n∑∑\n∑∑∑\n=\n=\n=\n=\n=\n=\n=\n=\n=\nω\nω\nω\nω\nω\n\nPlume characteristic \"size\" is square root of second moment:\nt\nD\nS\nL\nn\n,1\n=\n="
    },
    {
      "category": "Resource",
      "title": "Multiple Objectives, Pareto Optimality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-020-ecology-ii-engineering-for-sustainability-spring-2008/72600bfcad4aa6c8202148d7d49d9209_lec20.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.020 Ecology II: Engineering for Sustainability\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1.020 Ecology II: Engineering for Sustainability\n\nLectures 08_20 Multiple Objectives, Pareto Optimality\n\nMotivation/Objective\nDevelop a way to compare values of different resource uses. Consider tradeoff between using\nlimited water for farm revenue vs. using water for preservation of the riparian ecosystem.\n\nApproach\n1. Introduce a riparian ecological abundance measure as a second objective in the resource\nallocation problem of Lectures 8_16 and 08_17. This simplified measure assumes abundance is a\nlinear function of the flow downstream of the irrigation diversion. We would like to maximize\nboth revenue and abundance but these objectives conflict.\n2. Include abundance objective as a constraint in the resource allocation problem and use\nMATLAB to evaluate the tradeoff between revenue and diversity.\n3. Display tradeoff as a Pareto frontier (set of Pareto optimal solutions).\n4. Consider how tradeoff depends on technological inputs (e.g. water requirement, yield).\n\nConcepts and Definitions Needed:\nMultiobjective optimization problem:\n\n)\n(\n\n=\nx\nF\nMaximize\nrev\nx\nRevenue ($)\n\nObjective function 1\n\n)\n(\n\n=\nx\nF\nMaximize\nabd\nx\nEcological abundance (unitless 0-1)\nObjective function 2\nx = vector of decision variables\n\nDecision variables\nSuch that following constraints hold for each resource:\nResource used (x) ≤ Resource available\n\nInequality constraints\nUpper and lower bounds on x\n\nInequality constraints\nPhysical constraints (e.g. mass, energy balance)\nEquality constraints\n\nWe seek Pareto optimal solutions (solutions where one objective can be improved only at the\nexpense of the other). Other solutions are either infeasible or inferior.\n\nFor 2 crop example identify Pareto frontier by converting one objective (Objective 2) to a\nconstraint:\n\nabdmin\nabd\nF\nx\nF\n≥\n)\n(\n.\nPareto frontier is\nvs\ncurve. Points along frontier correspond to particular solutions (x).\nrev\nF\nabdmin\nF\nModify optimization problem of Lecture 08_16 & 08_17 to include upstream water limit and\nabundance constraint:\nMaximize\n\ni\ni\ni\nrev\nx\nY\np\nx\nF\n∑\n=\n=\ni\n\n)\n(\n]\n[\nD\nx\nx\nx =\n,\nArea crop i (ha), D = diversion to farm (MCM season\n=\nix\n-1)\ni\ni\ni\ni\nx\nd\nY\nY\n-\n=\n\n= nominal yield (tonne ha\niY\n-1 season-1)\n=\nid\nyield reduction coef (tonne ha-2 season-1)\nConstraints: (MCM = 106 m3) ,\n=\ni\nw\nWater rqmt crop i (MCM ha-1 season-1 )\n\nSupply\n= upstream flow (MCM season\nU\nD ≤\n-1 )\n\nWater:\n= water diverted to farm (MCM season\nD\nx\nw\ni\ni\ni\n≤\n∑\n=\n-1 )\n\nLand:\n= land available (ha)\navail\ni\ni\nL\nx ≤\n∑\n=\n\nAbundance:\nabdmin\nF\nD\nU\n≥\n-\n]\n[\nβ\n→\nabdmin\nF\nU\nD\n-\n≤β\nβ\n\nNonnegativity: xi ≥ 0 i = 1, 2, 3\n\nInput Arrays for MATLAB (quadprog):\nQuadprog format:\nx\nf\nHx\nx\nx\nF\nMinimize\nT\nT\nrev\nx\n+\n= 2\n)\n(\n\nFind decision variables x that minimize\n)\n(x\nFrev\n:\nsuch that\n\nInequality constraints\nb\nAx ≤\n\nEquality constraints\neq\neq\nb\nx\nA\n=\n\nLower and upper bound constraints\nub\nlb\nx\nx\nx\n≤\n≤\nFor multiobjective problem (converted to minimization problem):\n]\n[\nY\np\nY\np\nf\n-\n=\n\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\nd\np\nd\np\nH\n⎥\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\nβ\nw\nw\nA\n\n⎥\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\nabdmin\navail\nF\nU\nL\nU\nb\nβ\n=\nlb\nx\n[0 0 0]\n[]\n=\n=\n=\nub\neq\neq\nx\nb\nA\n(unused)\n\nMake sure that H is a symmetric matrix.\nPlot of\nvs\ngives Pareto frontier.\nrev\nF\nabdmin\nF\n\nTradeoff Results\nNote dependence of tradeoff curve problem inputs (farm inputs, β , etc.)"
    }
  ]
}