{
  "course_name": "Economic Development & Technical Capabilities",
  "course_description": "The economic growth of developing countries requires the acquisition of technological capabilities. In countries at the world technological frontier, such capabilities refer to cutting edge skills to innovate entirely new products. In developing countries, the requisite technological capabilities are broader, and include production engineering, project execution and incremental innovation to make borrowed technology work. Theories of technology acquisition are examined. The empirical evidence is taken from two sets of developing countries; the most advanced (Taiwan, Korea, India, China and Brazil) and the least advanced (Africa and Middle Eastern countries).",
  "topics": [
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Public Administration",
    "Science and Technology Policy",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Public Administration",
    "Science and Technology Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nDescription\n\nThe economic growth of developing countries requires the acquisition of technological capabilities. In countries at the world technological frontier, such capabilities refer to cutting edge skills to innovate entirely new products. In developing countries, the requisite technological capabilities are broader, and include production engineering, project execution and incremental innovation to make borrowed technology work. Theories of technology acquisition are examined in this course.\n\nThe empirical evidence is taken from two sets of developing countries; the most advanced (Taiwan, Korea, India, China and Brazil) and the least advanced (Africa and Middle Eastern countries).\n\nGrading\n\nGrades are based on a take-home final (handed out the final day of class and due back 48 hours later) and a 15 page double-spaced paper (due the day the final exam is officially scheduled to occur). Classroom participation is encouraged.\n\nIn addition, students must make presentations in class on an industry/technology that a developing country is trying to promote (eg., the software industry of India, the biotech industry of Taiwan). Papers may be based on the same topic as the classroom presentation.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Lecture 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-167-economic-development-technical-capabilities-spring-2004/988f05430ccacea0ff0c9350808b749b_lec_1.pdf",
      "content": "11.167 Economic Development & Technical Capabilities\n\nLecture 1\n\nLooked at syllabus, briefly discuss overview of course.\nTalked about the Middle East/Africa - Undeveloped because of lack of knowledge.\nTechnology now taught is very different from 10/15 years ago.\n\nIntroduction to Economic history.\n- Adam Smith - Thought of technology as perfectly available - i.e. a free good.\no The example of the pin factory, and that if anyone just looked in they\ncould figure out how to do it.\no Division of labor is limited by the size of the market.\no Division of labor becomes amazingly important in the context of\neconomic development\no Labor changes from: single person doing everything => multiple people\nworking on separate portions => mechanization\n\n- David Ricardo\no Wanted income redistribution from agriculture to industry\no Also wanted to trade with Portugal, and saw the benefits of such trade, as\ndepicted below:\nCircled products show comparative advantage\n\nThis model for comparative advantage assumes full employment in every country!\n- Types of developing countries\no Labor scarce\no Labor abundant\no Peasant export economies\no Regions of recent settlement\n\nLabor Scarce Countries\n- Africa is a prime example - rich natural resources but not enough people, as a\nresult labor costs rise\n\no Became poor because of imperialism, weren't poor before imperialism\no When imperialists came, first thing they did was impose a hut tax, which\nwas paid in foreign currency\no As a result, people were forced to work in mines or to produce cash crops\nand eliminating their self-sufficiency.\n\nLabor Abundant Countries\n- Age old empires (Chine, India, Egypt, Turkey)\n- Produced a lot of silk and textiles to sustain economy\n- Large markets, viable to be tapped.\n- To be continued next lecture . . ."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-167-economic-development-technical-capabilities-spring-2004/84d18a5dcdc472cade9ec3a0c771b368_lec_3.pdf",
      "content": "11.167 Economic Development & Technical Capabilities\n\nLecture 3\n\n18th Century Ideas\n\n- Adam Smith says to let the market decide the prices\n- David Ricardo says that trade will benefit all countries because of the laws of\ncomparative advantage\n- However, these models have implicit ASSUMPTIONS that are not true in real\nlife! (for example, full employment)\n\nPost-WWII\n- United States foreign policy slowly transfers from State Department to\nTreasury Department.\no State Department's first reconstruction task was the United States\npolicy in Japan.\nWanted to democratize and reform Japan to strengthen it\nagainst communism.\nState Department was very liberal in post-WWII era. It\ninstigated a lot of land reforms and promoted labor unions in\nJapan.\no Anti-communist movement in Congress (1951-52)\nEffectively purged the State Department via Mccarthyianism,\nbecause they acted too liberally in Japan.\no Stalin passes away in 1953, and Cold War shifts focus to the 3rd world.\nLarge ideological clash in the 3rd world. \"Good\" for the\ndeveloping world because they can double dip from both\ncapitalists and communists. Many countries took the position\nof \"non-aligned,\" and asked for $$$ from both sides.\no Treasury finally displaces State Department as dominant means of\nforeign policy.\n- Role of World Bank and IMF (multilateral organizations)\no Lots of restrictions on loaned $$$\no How do countries repay their debt?\nUse the loaned $$$ to expand economy to generate income\nContract government spending to save money\no How should they help developing countries?\nHard loans?\nSoft loans?\nGifts?\n- Era between 1945-1975\no United States was powerful. \"Two headed empire\"\no US had no real \"competition,\" controls 20% of World Bank and owns\ndirectorship of it.\no IMF generally controlled by non-US, but recently these multilateral\norganizations all aligning themselves.\n\n- United Nations\no Becomes a forum for developing world, because $$$ doesn't\ndetermine voting power, such as in the World Bank.\no UNCTAD, UNDP become more voices for the 3rd world\n\nDeveloping World Economies\n- Until 1960, foreign aid is tiny, however when Sputnik went into space, US\nstarted paying more attention to developing countries and as a result they\nstarted doing better\no More foreign aid from the US\no Population surges because of a reduced death rate.\nSmallpox vaccination\nMalaria control/DDT\n- Color bar is still a major problem\no The idea is that companies won't hire particular races for particular\noccupations.\no Severely hampers development\n- 1854 - Modern Indian textile industry begins\no Indians and Chinese develop modern cotton textile industries\no Artisans did most of the work pre-modernization\nThey were self-employed, but not innovators, and thus didn't\ncontribute toward a truly growing economy.\nDestroyed by the advent of mechanization.\no In today's world, small business workers/owners are innovators.\nHowever, small business workers in developing countries don't innovate\nlike those in the US\n- 1945-1975 - Foreign aid goes to big industry in developing countries\n- 1980-now\no Bias in favor of giving foreign aid on a small scale\no Created a conflict between development and growth vs. employment\no Mass production and big industry has less of an advantage in today's\nworld\n- Switzerland and Hong Kong\no Two examples of countries with huge technological assets, because of the\nway they developed\no Because of their technological assets, they can compete in the world\nmarket\n\nThe Peasant Export Economies (Ghana, Senegal, Haita, Burma, West coast of Africa are\nexamples)\n- Agrarian, exporters, small land holdings\no Why didn't they do better?\nWhen Imperialism came, they forced these people to create cash\ncrops. The problem with cash crops is that you are no longer self-\nsufficient in food.\n\nDuring seasons of bad weather, peasants are forced to borrow\nmoney at really high interest rates\nWhen they couldn't pay it back, they were ruined\no Therefore, division of labor is very dangerous in this type of economy."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-167-economic-development-technical-capabilities-spring-2004/8f4ea77b339ca7b7d04f8606b87b2c66_lec_5.pdf",
      "content": "11.167 Economic Development & Technical Capabilities\n\nLecture 5\n\nOutsourcing\n- Is Globalization good for developing countries?\no Example - Radiology\no X-rays sent offshore, because radiologist time is much cheaper\no Created a huge fiasco for the US, and actually became an issue in a\nPresidential campaign (i.e. what's going on with employment?)\n- What is outsourcing?\no Part of a company goes overseas (part of Foreign Direct Investment)\no FDI (Foreign Direct Investment)\ni.e. loaning $$$ to build a railroad, compared to going into a\ncountry and building it\nExport of services - outsourcing\n- How do we measure the amount of outsourcing?\no One method - look at a countries' balance of payments\no An indirect example for the US is higher education! Many foreign\ncountries \"export\" students to learn in US institutions.\n- Is the US right to object to outsourcing?\no In the past, lots of outsourcing came to the US, now a lot of outsourcing is\nleaving the US\no If we can show the in and out flows for the US, a concrete argument can\nbe made about outsourcing.\n\nImperialism\n- Many negative viewpoints, but there is a positive viewpoint\no Argues that colonial governments establish law/order, basic transportation\nand health, modern financial and legal institutions\no Is this true? No!\nImperialism driven by racism, greed by colonists\nLaw/order only brought about because it's necessary to safeguard\nthe cash flow\nMany developing countries already had law/order, but it was\ndifferent from the imperialist notions of law/order, thus the\nimperialists saw them as barbaric.\n- 12 Countries that succeeded after imperialism and WWII\no Argentina, Brazil, Chile, Mexico, Korea, Taiwan, China, Malaysia,\nIndonesia, Thailand, Turkey, India\no Succeeded primarily because of their pre-WWII manufacturing experience\nArgentina, Brazil, Chile, Mexico - developed primarily because of\nimmigration (\"neo-colonialist\")\nKorea, Taiwan, Malaysia, Indonesia, Thailand - help of a strong\nJapan\nChina, Turkey, India - Long history and nationalism\n\no These countries are all self-developed (domestic investment >> foreign\ninvestment)\no Decolonization brought opportunity to create national firms when the\nimperialist nations left.\n\nTechnology\n- As noted before, economic theory is modeled as if technology information is\nperfectly free (i.e. Adam Smith's Pin factory from Lecture 1).\n- What is technological knowledge?\no One of the most scarce resources for development\no Usually proprietary, which makes technology transfer difficult for\nbuyers/suppliers\no Buyers must be pro-active for development to succeed!\n- Where do you get knowledge from?\n\nTechnological Capabilities - 4 examples\n- Example: textile machinery\no Textiles are very good for developing countries, because the technology is\nin the machinery\no In general, foreign knowledge doesn't come with foreign investment\nunless it comes in the form of the product, such as the machinery\no Issue of knowledge of workers is very important\no How was this knowledge obtained?\nVisiting foreign textile companies\nHiring foreign skilled workers\n- Example: cement industry\no Like textile industry, it's a raw-material based industry, and technology\ntransfer occurs mainly within the machinery\no Quality of material varies, lots of regulation and quality control required\nfor a successful industry.\no Nowadays, jobs in the cement industry require computer knowledge to\nmanage the process, because the manual labor is almost all mechanized.\n- Example: steel industry\no Huge economies of scale, requires huge ovens/furnaces\no How did the technology transfer occur? Look at example of S. Korea.\nReceived knowledge from an elite Japanese steel mill\nNew manager of Korean mill went to Japan to work in a blast\nfurnace\nAlso worked with construction crew that built the furnace\nThus, technology transfer involved the Koreans going to Japan as\nwell as the Japanese coming to work for the Koreans\nExcellent example of the pro-active buyer which is essential for\nstrong economic growth.\n- Example: pulp and paper\no Stinks!!!\n\no Like the steel industry, requires a lot of huge machines as well as very\ncareful process control\no Machinery supplier crucial for technology transfer - important because\nthey are looking to help the customer, and thus assists greatly in the\ntechnology transfer\no Again, requires very pro-active work by the buyer of large machines to\nensure things are going smoothly."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-167-economic-development-technical-capabilities-spring-2004/6d5fe2f8623dd4f3dd84cd6403e3e89e_lec_7.pdf",
      "content": "11.167 Economic Development & Technical Capabilities\nLecture 7\n1) Three Elements to Technological Capabilities\nTechnological Capabilities refer to the ways that developing countries can\nimprove to keep up with the rest of the world. There are three major capabilities, and\nthey are production, project execution, and innovation.\n- Capability 1: Production\n- Countries that did production well - Japan, and East/SouthEast Asian countries.\n- A good example of a company is Hyundai motors - their technological successes\ncome all from efficiency in their production process, with very little actual\ninnovation. Hyundai implemented a lot of modern inventory control, quality\ncontrol, and thorough training to ensure the quality of its product.\n- One reason production is a successful way for underdeveloped countries to gain\nindustry is because it requires very little innovation to become a producer, as we\nsee from the Hyundai example.\n- As an aside, how does a country make themselves attractive for outsourcing\nfrom developed countries? The solution is \"export processing zones.\" These\nzones have duty free imports, and are usually focused to have 100% of its\nproduct exported out of the country. The main benefit for creating these \"export\nprocessing zones\" is strictly employment. It was started in Japan during the\nKorean war, when the United States wanted more companies in Japan to\nstrengthen its resistance to communism, as well as to get a closer footing near\nNorth Korea. The companies that participate in the export processing zones are\nalmost always foreign multi-national companies.\n- Capability 2: Project execution\n- Project execution refers to the manner or process that new companies or\ncountries go about developing a new industry or product.\n- Included things like pre-investment feasibility studies, project\nmanagement/engineering, basic engineering, procurement, constructing the\nplant, acquiring the machinery, and starting the operation smoothly.\n- Learning by doing is the only real way to acquire project execution skills. Let's\nlook back at the example of Hyundai again. In 1964 Hyundai began investing in\nthe cement industry back when they only did construction mainly as an exercise\nfor managers to learn project execution - by 1968 Hyundai was able to expand\nmuch more because they became experienced in project execution skills that\nthey learned from building the cement plant.\n- Capability 3: Innovation\n- Didn't play as large a part in developing countries, because of the lack of\ninfrastructure.\n- Some countries had moderate success in innovation, and their efforts are being\nrewarded now (note the May 3rd article from the New York Times about the\nUnited States losing its dominance in the sciences)\n- Example of South Korea - in 1966, South Korea started the Ministry of Science\nand Technology. At this time, Korea had roughly the same per capita as\n\nGuatemala, but now has far surpassed them. South Korea saw their investment\nin innovation as something essential towards their long term goals of being a\nfierce competitor in the global market, even though it didn't produce short term\nresults.\n2) How the mid-late 1900's changed the United States foreign policy from \"Security\nEconomics\" to \"Superpower Economics.\"\nIn the next lecture we'll discuss what exactly the \"Security Economics\" and\n\"Superpower Economics\" refers to. However, now we can observe that the events during\nthis time period drastically affected the United States view on the rest of the world.\nTimeline:\n1950's -\nStalin passes away. His successors decide that the developing world could\nbe a strong place for support, and as a result the United States starts to pay\nmore attention to the developing world as well.\n1950-70 -\nThe United States practices a policy of nonreciprocity, great for the\ndeveloping world. This means that the United States opened up its\nmarkets to the developing countries, but didn't force them to open their\nmarkets. This allowed many companies in the developing countries to\ndevelop and grow, and got them exposure to the strong United States\ndomestic market. This was great for developing countries.\n1970's -\nHorrible time for the United States. Three things contributed to the\ndecline of United States power and refocused their foreign policy.\nVietnam war\nOPEC\nUS humiliation by Japan in nearly every industry x/c chemistry\n3) World Trade Organization\nPartly a byproduct of this, the United States helped to develop the World Trade\nOrganization (WTO). The WTO was designed to make sure developing countries didnt'\nhave promotional measures for their industries. The WTO emphasized: No tariffs, no\nsubsidies, no local content, everything free market. However, this created a level playing\nfield in terms of opportunities, but not in terms of capabilities. The establishment of the\nWTO makes it difficult for the developing world, who rely on protection for their small\nindustries. However, there are two loopholes in the WTO that some countries are\nexploiting. They are:\n- A country can promote \"regional\" development. An example of this is in Southern\nChina (poor compared to Northern China), where there is some protection of the\ndeveloping industries there.\n- Science and Technology endeavors can be protected."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-167-economic-development-technical-capabilities-spring-2004/c222dc08b810d889eccc1979477057cc_lec_9.pdf",
      "content": "11.167 Economic Development & Technical Capabilities\nLecture 9\nRole of Advanced Countries\nIt is always the more advanced countries that provide the tools for the\nunderdeveloped countries to grow. For example, the British role in the East Indian\nCompany was like that of a Godfather, in that it made sure they were generally\nconducting business in if anything, at least a profitable manner.\nBefore WWII, the powers were France, England, Japan, Germany, and Holland,\nbut after WWII it's primarily the United States. However, unlike the pre-WWII days\nwhere a superpower would have direct control over its colonies, United States control is\nthrough indirect measures and pressures.\nThe American Empire\nReview of timeline:\n1941-45 -\nUnited States and Russia are allied, fighting the axis powers\n1947 -\nBerlin wall is erected, beginning of the Cold War\n1950 -\nRussia developes the nuclear bomb\n1953 -\nStalin dies, and Russia makes developing countries a focus - from\nthis\npoint the United States shifted their policy to \"security economics\"\n1955 -\nUnited States/CIA overthrow the democratically elected head of\nIran\n1957-8 -\nSputnik satellite launched into space by Russia. Doesn't really do much,\nbut freaks out the United States\n1958 -\nUnited States invades Lebanon, throws out elected leader as well\n1959 -\nCastro comes into power in Cuba, creates a socialist/communist\ncountry\n1965 -\nDominican Republic President thrown out\n1970's -\nHorrible time for the United States. Three things contributed to the\ndecline of United States power and refocused their foreign policy.\nVietnam war\nOPEC\nUS humiliation by Japan in nearly every industry x/c chemistry\n1973 -\nDemocratically elected Chile President assassinated\n\"Security Economics\"\nSecurity Economics refers to the policies enacted by the United States in the\nperiod following Stalin's death. These policies were designed for the purpose of\nstrengthening capitalist states, and while the leaders of the era claim they were for\n\"freedom\" and the \"free world,\" as we can see from the timeline above \"free world\"\nmeans a non-communist world. There were two major policies followed during this time:\n\n- Non-reciprocity - Referes to the fact that developing countries don't have to open\ntheir markets to the United States, but the US opens its markets for\ndeveloping countries. This is great for developing countries,\nbecause they're given all the benefits of access to the huge US\ndomestic market, yet can still put up tariffs and such to protect\ntheir industries.\n- Flexibility -\nDeveloping countries were pretty much left alone - thus, they had\nthe freedom to develop their own domestic and foreign policies.\nMany beneficial policies were enacted in developing countries because of security\neconomics. Performance standards and incentives were strictly enacted in many\nsuccessful developing countries, and thus many innovative methods of promoting\nindustry were developed. A great example is the Board of Investment of Thailand, which\nwas instrumental for developing their industry. In exchange for monetary support and\nguidance, one Thai company agreed to export 50% of output after 5 years of production.\nA foreign company who wanted to start a new venture in Thailand was restricted to only\nbringing three foreign managers, and then after several years those managers must leave,\nand have trained a Thai to take his/her place.\n\"Superpower Economics\"\nFairly different outlook of the developing world by the United States. The\nparadigm shift occurred because of the troubles the US started having in the 1970's\n(OPEC, Vietnam, etc.). The Federal Reserve decided to reduce the money supply in the\nlate 70's, which drove up interest rates and decreased investment. After this occurred, the\ninterest rates in developing countries skyrocketed, and it became really difficult for these\ncountries to pay back their existing loans. The concept of \"democracy\" is very tricky,\nmany stipulations put on by the US. Heavily promotes free market economics and no\nbarriers to trade, and call it a \"level playing field.\" Many elected officials are corrupt.\nThis policy of superpower economics is turning many areas of the world to a\nconcept of regionalism, i.e. Big trading blocks, such as the European Union, an East\nAsian bloc, etc.\nRole of Japan\nThe United States hatred for Japan's economic success is also a primary factor in\nthe US development of its superpower economics policy. The Japanese were destroying\nthe United States in almost every industry, and the US couldn't understand it. They\nblamed it on the protection and subsidies that Japan provided to its companies. Thus, the\nUS forced Japan to drop protection on its industries except for its agriculture.\nThe IMF and the World Bank\nThese are large international organizations that provide monetary support and\nstability around the world, or at least that's their purpose. Many developing countries\nhave varying opinions for both the IMF and the World Bank.\n\nIMF\n- Main constitutents are private banks\n- Developing countries use IMF money to repay outstanding debt that they can't\nthemselves\n- The IMF offers two ways to repay debt\n- Cut spending, which the IMF heavily favors\n- Use the money to develop more, and thus to make more money\n- Loaned money with stipulations that countries must open their markets\nWorld Bank\n- Supposed to lend for development purposes, but unfortunately now only lends for\npoverty alleviation\n- For example, we all want all the people in India to have easy access to cheap\nmedicine, but we would much rather have the people in India have easy access to\ncheap medicine produced in India.\n- The plan of poverty alleviation doesn't help to increase productivity\n- The reason the World Bank promotes poverty alleviation is because the US\ncongress said it wouldn't support the World Bank if it tried to promote businesses"
    }
  ]
}