{
  "course_name": "Educational Theory and Practice I",
  "course_description": "This course is designed to prepare you for a successful student teaching experience. Some of the major themes and activities are: analysis of yourself as a teacher and as a learner, subject knowledge, adolescent development, student learning styles, lesson planning, assessment strategies, classroom management techniques and differentiated instruction. The course requires significant personal involvement and time. You will observe high school classes, begin to pursue a more active role in the classroom in the latter part of the semester, do reflective writings on what you see and think (journal), design and teach a mini-lesson, design a major curriculum unit and engage in our classroom discussions and activities.",
  "topics": [
    "Teaching and Education",
    "Teaching and Education"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 2 sessions / week, 1.5 hours / session\n\nPrerequisite\n\nThere is no prerequisite, but there is a corequisite of\n11.124 Introduction to Teaching and Learning Mathematics and Science\n. (A corequisite is a course that must be or can be taken concurrently with a given course.)\n\nThe MIT/Wellesley Scheller Teacher Education Program\n\nThe\nMIT/Wellesley Scheller Teacher Education Program\n(STEP) prepares MIT and Wellesley College students to become teachers who are:\n\nCompetent to teach in their field and not afraid to challenge established norms\n\nAble to bridge the boundaries among disciplines\n\nEager to help students develop the desire to question and explore that is so much a part of the MIT experience.\n\nMain Activities\n\nReflect and write about your own educational experience both as a student and as a teacher.\n\nObserve and work in a secondary school classroom.\n\nKeep a weekly reflective journal (paper or electronic). Write about what you observe in the classroom(s). Be sure to include any questions/thoughts you have about what you see. These can be brought up in class discussion and/or your reflective papers. Date your entries and be specific about what you observe. Also keep a pre-practicum log of your visits (form provided).\n\nDemonstrate competence in the area of curriculum design and a variety of teaching issues such as setting student expectations, classroom management techniques, discipline, grading policies, assessment strategies, conducting the lab part of a course, curriculum/time issues (depth vs. breadth), being an effective communicator in the classroom and parent communications.\n\nDemonstrate competence in the area of adolescent development and effective communication skills.\n\nDemonstrate competence in your subject content in terms of the following: State Frameworks, MCAS, MTEL and a variety of typical student textbooks.\n\nBecome familiar with the Professional Teacher Standards.\n\nDemonstrate competence in the area of special education.\n\nDesign and teach a mini-lesson which will be followed by group feedback.\n\nDesign a major curriculum unit that you will use in your student teaching in January\n\nThe unit should include a table of contents, a general overview of the unit (one paragraph), a daily calendar stating learning objectives, reference to alignment with State Curriculum Frameworks, outline of what is to be taught day by day, homework assignments, relevant demonstrations and labs, and an assessment component(s).\n\nCourse Requirements\n\nClass attendance.\n\nField work in a local secondary school (50 hours for the semester). Detail your weekly observations in your reflective journal. Keep your written pre-practicum log up to date.\n\nAssignments will include the following:\n\nWritten reflections (journal)\n\nSelected readings (three major texts). Topics deal with issues such as student learning, adolescent development, subject matter knowledge, classroom management techniques, assessment issues, Curriculum Frameworks, MCAS student testing, MTEL teacher testing, and planning for your January teaching assignment.\n\nRequired documents for completion of licensure process\n\nTwo major reflective papers\n\nMini-lesson\n\nMajor curriculum project\n\nWorkshops on special education\n\nGrading\n\nYour grade is based on your completing all course requirement. The components are:\n\nPre-practicum work (high school observation and journal)\n\nMini-lesson\n\nDocuments for licensure\n\nPersonal statement, unofficial transcript, faculty recommendation, subject knowledge advising, pre-practicum log\n\nReflection papers\n\nCurriculum design project\n\nClass engagement (Points will be deducted for such things as absences, late attendance/early departures, being unprepared for class and lack of contribution to class discussion. For class absences, \"equivalent\" work must be submitted within seven days of absence. Work must be pre-approved by me.\n\nRegarding all written assignments: Papers must be typed and stapled or bound. Papers are due at the beginning of class. Work handed in late will be considered late and will be downgraded a full grade.\n\nGrading rubric (\nPDF\n)\n\nExpectations and Trust in the Classroom (\nPDF\n)",
  "files": []
}