{
  "course_name": "Eighteenth-Century Literature: Versions of the Self in 18th-C Britain",
  "course_description": "When John Locke declared (in the 1690 Essay Concerning Human Understanding) that knowledge was derived solely from experience, he raised the possibility that human understanding and identity were not the products of God’s will or of immutable laws of nature so much as of one’s personal history and background. If on the one hand Locke’s theory led some to pronounce that individuals could determine the course of their own lives, however, the idea that we are the products of our experience just as readily supported the conviction that we are nothing more than machines acting out lives whose destinies we do not control. This course will track the formulation of that problem, and a variety of responses to it, in the literature of the “long eighteenth century.” Readings will range widely across genre, from lyric poetry and the novel to diary entries, philosophical prose, and political essays, including texts by Alexander Pope, Jonathan Swift, Mary Astell, David Hume, Laurence Sterne, Olaudah Equiano, Mary Hays, and Mary Shelley. Topics to be discussed include the construction of gender identities; the individual in society; imagination and the poet’s work. There will be two essays, one 5-6 pages and one 8-10 pages in length, and required presentations.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Intellectual History",
    "Literature",
    "Philosophy",
    "Metaphysics",
    "Humanities",
    "History",
    "European History",
    "Intellectual History",
    "Literature",
    "Philosophy",
    "Metaphysics"
  ],
  "syllabus_content": "Texts\n\nBlake, William.\nSongs of Innocence and Experience.\nOxford: Oxford University Press, 1977.\n\nHays, Mary.\nMemoirs of Emma Courtney.\nOxford: Oxford University Press, 2001.\n\nShelley, Mary.\nFrankenstein.\nOxford: Oxford University Press, 2001.\n\nSterne, Laurence.\nA Sentimental Journey.\nNew York: Penguin, 2002.\n\nSwift, Jonathan.\nGulliver's Travels.\nNew York: Penguin, 2003.\n\nRequirements\n\nStudents are required to attend all class sessions and to participate. I do not evaluate class participation in terms of how many brilliant things you say in the course of the semester, but I require you to have read the texts thoroughly and to come to class prepared to talk about them. In addition, every student will be required to deliver at least one presentation on an assigned work during the semester. These presentations, between 15-20 minutes in length, should be conceived as exercises in literary interpretation through close analysis, and should ideally help to stimulate a discussion through arguments and questions. Finally, there will be two essays, one 5-6 pages and the other 8-10 pages in length.\n\nMIT Literature Department Statement on Plagiarism\n\nPlagiarism-use of another's intellectual work without acknowledgement-is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available in the\nWriting and Communication Center\n.\n\nMIT's academic honesty policy can be found at the following link:\nhttp://policies-procedures.mit.edu/academic-misconduct-and-dishonesty/",
  "files": []
}