{
  "course_name": "Electromagnetic Wave Theory",
  "course_description": "6.632 is a graduate subject on electromagnetic wave theory, emphasizing mathematical approaches, problem solving, and physical interpretation. Topics covered include: waves in media, equivalence principle, duality and complementarity, Huygens’ principle, Fresnel and Fraunhofer diffraction, dyadic Green’s functions, Lorentz transformation, and Maxwell-Minkowski theory. Examples deal with limiting cases of Maxwell’s theory and diffraction and scattering of electromagnetic waves.",
  "topics": [
    "Mathematics",
    "Applied Mathematics",
    "Science",
    "Physics",
    "Electromagnetism",
    "Mathematics",
    "Applied Mathematics",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hour / session\n\n6.632 Electromagnetic Wave Theory\n\nA graduate subject on electromagnetic wave theory, emphasizing mathematical approaches, problem solving, and physical interpretation. Topics include: waves in media, equivalence principle, duality and complementarity, Huygens' principle, Fresnel and Fraunhofer diffraction, dyadic Green's functions, Lorentz transformation, and Maxwell-Minkowski theory. Examples deal with limiting cases of Maxwell's theory and diffraction and scattering of electromagnetic waves.\n\nGrading\n\nProblem Sets: 34%\n\nQuiz 1: 33%\n\nQuiz 2: 33%\n\nHomeworks are due once a week on lecture day. The following describes the percentage of credit that will be given for late homework:\n\nTurned in on due date : 100% (homework box in the class)\n\nTurned in one day after the due date: 50%\n\nTurned in late: 25%\n\nSpecial cases should be discussed with your TA (preferably before the homework is officially due).",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set No. 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/9df5adebb7edb915a213adf42edeafe5_ps1.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 1\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 1.8, 3.1, 3.2, J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P1.1\nFor each of the following constitutive relations, state whether the given medium is\n(1) Isotropic/anisotropic/bianisotropic,\n(2) Linear/nonlinear,\n(3) Spatially/temporally dispersive,\n(4) Homogeneous/inhomogeneous.\n(a) Cholesteric liquid crystals can be modelled by a spiral structure with constitutive\nrelations given by\nD =\n\nε(1 + δ cos Kz)\nεδ sin Kz\n\nεδ sin Kz\nε(1 - δ cos Kz)\n\nεz\n\n· E\nwhere the spiral direction is along the z axis.\n(b) When a magnetic field B0 is applied to a conductor carrying a current, an electric field\nE is developed. This is called the Hall effect. Assuming the conduction carrier drifts\nwith a mean velocity v proportional to RσE, the constitutive relation that takes care\nof the Hall effect is given by\nJ = σ E + RσE × B0\nwhere σ is the conductivity and R is the Hall coefficient. For copper, σ ≈ 6.7 ×\n107 mho/m and R ≈-5.5 × 10-11 m3/coul .\n(c) An isotropic dielectric can exhibit the Kerr effect when placed in an electric field. In\nthis case the permittivity can be written as\nεij = εδij + σEiEj\nwhere ε is the unperturbed permittivity. The principal axis of εij coincides with the\nelectric field.\nProblem P1.2\n(a) The complex permittivity for bottom round steak is about ε = 40(1 + i0.3)εo at the\noperating frequency (2.5 GHz) of a microwave oven. What is the penetration depth?\n(b) Calculate loss tangents and skin depths for sea water at frequencies 60 Hz and 10 MHz.\nSea water can be characterized by conductivity σ = 4 mho/m , permittivity ε = 80ε0,\nand permeability μ = μo at those frequencies.\n\n(c) A 100-Hz electromagnetic wave is propagating down into the sea water with an electric\nfield intensity E of 1 V/m just beneath the sea surface. What is the intensity of E at\na depth of 100 m? What are the time-average Poynting's power densities just beneath\nthe surface and at a depth of 100 m?\nProblem P1.3\n(a) An ionized plasma is dispersive; derive its group velocity vg if μ = μ0 and ε =\nε0(1 - ω2\np /ω2) , where ωp =\nNe2/mεo, N is the number of free electrons per cubic\nmeter, e is the charge of an electron (coulombs), and m is the mass of an electron\n(kg).\n(b) What is the difference in arrival times between a flash of light (λ = 0.5μm) and\na simultaneous radio pulse (f = 10 MHz) seen through an idealized homogeneous\nionosphere where ωp = 2π × 8 MHz along a path of 100 km?\nProblem P1.4\nTo shield a room from radio interference, the room must be enclosed in a layer of\ncopper five skin-depths thick. If the frequency to be shielded against in 10 kHz to 1 GHz,\nwhat should be the thickness of the copper (in millimeters)? For copper, ε = ε0, μ = μ0\nand σ = 5.8 × 107 mho/m."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/0c8e7b537ea871a054bf2b4107389eee_ps2.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 2\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.2, 3.3 J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P2.1\nAn electromagnetic wave with the following electric field\nk\nk\nx sin √\n2(y + z) - ωt + √\n2 [Ayˆ + ˆ\nE = ˆ\nz] cos √\n2(y + z) - ωt\nis propagating in a plasma medium characterized by the dispersion relation\n1√\nk =\nω2 - 4π2 × 1012\nc\nwhere ω is the frequency in rad/sec, and c is the speed of light in free space.\n(a) What is the value of A ?\n(b) In which direction is the wave propagating and what is wave vector k ?\n(c) What is the polarization of the wave?\n(d) The permeability of the plasma medium is μo of free space, what is the permittivity\nε of the medium in terms of ω and permittivity of free space εo ?\n(e) What is the magnetic field vector of the wave ?\n(f) What is the Poynting power density vector of the wave ?\n(g) Show that the plasma frequency is fp = 106 Hz.\n√\n(h) If ω =\n5π × 106 rad/sec , what is k and what are the phase velocity vp and group\nvelocity√vg ?\n(i) If ω = √3π × 106 rad/sec , what is k and what is the expression for E ?\n(j) If ω =\n3π × 106 rad/sec , what is the time-averaged Poynting power density ?\nProblem P2.2\nConsider an electromagnetic wave propagating in the zˆ-direction with\nE = ˆ\nyey cos(kz - ωt + ψy )\nxex cos(kz - ωt + ψx) + ˆ\nwhere ex , ey , ψx , and ψy are all real numbers.\n(a) Let ex = 2, ey = 1, ψx = π/2, ψy = π/4. What is the polarization?\n(b) Let ex = 1, ey = ψx = 0. This is a linearly polarized wave. Prove that it can be\nexpressed as the superposition of a right-hand circularly polarized wave and a left-\nhand circularly polarized wave.\n(c) Let ex = 1, ψx = π/4, ψy = -π/4, ey = 1. This is a circularly polarized wave. Prove\nthat it can be decomposed into two linearly polarized waves.\nProblem P2.3\nIn a uniaxial medium with\n\nκ 0\n\nH = νB,\nE = κ · D,\nκ = 0 κ\nκz\n\na plane wave propagates in the yˆ -direction.\n(a) Write down the electric field vector of an ordinary wave. What is its spatial frequency\nk and its speed of propagation?\n(b) Write down the electric field vector of an extraordinary wave. What is its spatial\nfrequency k and its speed of propagation?\n(c) If κ is real and κz = -iK is purely imaginary, K ≫ κ , what are the penetration\ndepths of the ordinary and extraordinary waves?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/d64b5a3b5cf36b6a632aed82a50d6014_ps3.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 3\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.3 J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P3.1\nConsider a slab of material of thickness d , as shown in Figure P3.1, described by the\nfollowing permittivity and conductivity tensors:\nε =\n\nεx\nεy\nεz\n\nσ =\n\nσz\n\nwhere εx = 12εo , εy = εo , εz = 4εo , and μ = μo . The conductivity for polarized wave in\nz -direction is σz = 0.2εoω mho/meter.\nEinc\nu\nv\nw\nd\nFig. 3.1\nThis material can be used to make a polarizer, a quarter-wave plate, and a half-wave\nplate. Let the incident electric field propagate in the w direction.\nˆ\nPolarizer:\n(a) Assign x , y , z to u , v , w (not necessarily in that order) so that, for any arbitrarily-\npolarized incident electric field and sufficiently thick slab, the transmitted field is lin\nearly polarized.\n(b) Determine the minimum thickness d in free space wavelength such that the undesirable\ncomponent of the incident field is attenuated by 1/e .\nQuarter-wave plate:\n(c) Assign x , y , z to u , v , w (not necessarily in that order) so that, for a given linearly\npolarized incident electric field, the transmitted field is circularly polarized. Specify the\naxes so that there is no power absorption. Give an expression for an incident electric\nfield such that, given the correct thickness, the transmitted electric field is circularly\npolarized.\n(d) For the quarter-wave plate and the incident field of part (c), determine the smallest\nthickness d in free space wavelength such that the transmitted electric field is left-hand\ncircularly polarized.\n\nHalf-wave plate:\n(e) Assign x , y , z to u , v , w (not necessarily in that order) so that, for a given linearly\npolarized incident electric field, the transmitted field may be polarized in a direction\northogonal to the incident wave.\n(f) For the half-wave plate of part (e), determine the minimum thickness d in free space\nwavelength.\nProblem P3.2\nThe electric field energy in an anisotropic crystal with κij = κji is We = κij DiDj /2 .\nNote the notation:\nκij DiDj /2 =\ni=1\nj=1\nκij DiDj /2\nWriting in the principal coordinate system, show that D2\nx +D2\ny +Dz\n2/n2 = 2We. The\nx/n2\ny /n2\nz\nabove is identical to the defining equation of the index ellipsoid or the optical indicatrix.\nThe index ellipsoid is useful in finding the two indices of refraction and the two corre\nsponding directions of the D vector associated with the two characteristic waves. Find\nthe intersection ellipse between a plane through the origin of the index ellipsoid with the\nsurface normal along the direction of k. Let k be in the ˆe3 direction, show that the two\nprincipal axes of the ellipse are in the directions of the D vectors of the two characteristic\nwaves.\nProblem P3.3\nIn a ferrite, the magnetic moment M roughly obeys the relationship dM/dt = gμ0M ×\nH , where g is the gyromagnetic ratio. When a zˆ-directed dc magnetic field H0 (zeroth\nzH0 + H 1, M = ˆ\norder) is present, the total fields take the form H = ˆ\nzM0 + M 1 , and\nB = μ0(H + M ). Find dispersion relations for the first-order fields. Show that Faraday\nrotation exists in the ferrite."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/f32afcf89883ce68ac51de5228595f9c_ps4.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 4\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.3, 3.4 J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P4.1\nFor a bianisotropic medium with the constitutive relation\nD = ε · E + iχH\nB = μH - iχE\nwith ε given by (E3.1.2.1) (Page 309), derive the wave vector along the zˆ- direction and\ndiscuss the polarization states of the characteristic waves in the medium.\nProblem P4.2\nCompare the phenomena of total reflection for θ > θC and total transmission for θ = θB\nat an isotropic dielectric interface.\n(a) Total reflection occurs at a range of incident angles larger than the critical angle θC ;\ntotal transmission of TM waves occurs only at the Brewster angle θB .\n(b) Total reflection occurs only when the incident medium is denser than the transmitted\nmedium. The Brewster angle occurs for any two media.\n(c) When an unpolarized wave is totally reflected, the reflected wave is still unpolarized.\nWhen the TM wave components of an unpolarized wave are totally transmitted, the\nreflected wave contains only TE waves.\nSuppose a TM wave is incident at an angle θ such that θ = θB > θC . Then the wave is\ntotally transmitted and at the same time it is totally reflected. Explain what is happening.\nProblem P4.3\nThe direction of propagation of a wave becomes ambiguous in a complex medium.\nFrom Poynting's theorem, we have learned that the energy flow of an electromagnetic field\nis governed by Poynting's vector, S = E × H . The Poynting's vector divided by the total\nelectromagnetic energy is referred to as the energy velocity. The direction of the energy\nvelocity is thus perpendicular to both E and H . We have also learned that the direction of\nthe phase velocity is along k , which is perpendicular to both D and B . In a bianisotropic\nmedium, the directions of the energy velocity and the phase velocity k do not, in general,\ncoincide.\nThe Poynting power-flow direction is characterized by the ray vector s . We defined\nthe magnitude of s by\ns · k = 1\nwhere s is perpendicular to both E and H :\ns · E = 0\ns · H = 0\n\nε\nThe ray vector s has the dimension of length.\n(a) Use the vector identity s × (k × E) = k(s · E) - (k · s)E to show that\nE\nω\ns × B = -\nH\nω\ns × D =\n(b) Define ray surfaces similar to the wave surfaces. Show that\nω2με\nx + sy + sz =\ns\nfor the ordinary wave and\ns\nω2μεz\nx + sy + εz\ns 2\nz =\nfor the extraordinary wave. Plot the ray surfaces for the negative and the positive\nuniaxial media.\n(c) Since s is along the direction of energy velocity, s · δk = 0 ; namely the normal to the\nwave surface gives the direction of the corresponding ray vector. Prove that the normal\nto the ray surface gives the direction of the corresponding k vector.\nProblem P4.4\nThe ionosphere extends from approximately 50 km above the earth to several earth\nradii (mean earth radius is about 6371 km) with the maximum in ionization density at\nabout 300 km. For simplicity, assume that the ionosphere consists of a 40 km thick E layer\nwith electron density N = 1011 m-3 below a 200 km thick F layer with N = 6×1011 m-3 .\n(a) What are the plasma frequencies of the E and F layers ?\n(b) Consider a plane wave of 10 MHz incident at an angle θ upon the ionosphere from\nbelow the E layer, what is the angle θt of the wave in the ionospheric E layer ?\n(c) Let θ = 30* , below what frequency will the wave be totally reflected by the E layer\nand below what frequency will it be totally reflected by the F layer ?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/0a52091d9da907e79a0f59383f5cea88_ps5.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 5\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.3, 3.4 J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P5.1\nLet a plane wave be incident on a plane boundary from the inside of a negative uniaxial\ncrystal (see textbook, page 147). Consider the special case in which the optic axis is\nperpendicular to the plane of incidence. Find the range of θ such that there is only total\ninternal reflection for the ordinary wave and the transmitted waves are extraordinary\nwaves.\nProblem P5.2\nFor a highly conducting earth, assume σ/ωε ≫ 1, where σ is the conductivity of the\nearth. Consider a TM wave incident upon the boundary of the earth surface.\n(a) Write the magnetic and electric field components for RTM = 0 and then set RTM = 0.\nShow that\nkz = kzR + ikzI = ωε\nσ\nωμσ (1 - i)\nwhich propagates towards the surface and attenuates away from the surface. This\nis known as the Zenneck wave. Is the Zenneck wave a fast wave? A fast wave has\nRe (kx) < k.\n(b) Define a surface impedance\nRs - iXs = kz /ωε\nWhat is Rs and Xs ?\n(c) For an inductive surface characterized by Rs = 0, write down H with RTM = 0 and\ndiscuss the behavior of the resulting wave.\nProblem P5.3\nConsider a solid-state Fabry-Perot etalon filter made of an eight-layer stratified\nmedium. Regions 1, 3, 5, and 7 are made of magnesium fluoride (refractive index n = 1.35 )\nand are a quarter-wavelength thick. Regions 2, 4, and 6 are made of zinc sulfide (refractive\nindex n = 2.3 ). Regions 2 and 6 are a quarter-wavelength thick, but region 4 is a half-\nwavelength thick. What are the reflectivity and transmissivity for a plane wave normally\nincident upon this stratified medium? Explain why the structure can be used for filtering\npurposes.\n\nProblem P5.4\n(a) A plane wave in free space is incident at an angle θ on a half-space. For large ε ≫ εo\nshow that the transmitted wave is almost perpendicular to the boundary by finding\nθt .\n(b) A plane wave in free space is incident at an angle θ on a conducting half-space. For\nlarge σ/ωεo show that the transmitted wave is almost perpendicular to the boundary\nby finding θt ."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/5b3e5ea71293d059a19df14a314397d2_ps6.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 6\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.4, 3.5, J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P6.1\nAn AM radio in an automobile can not receive any signal when the car is inside a\ntunnel. Consider, for example, the Lincoln Tunnel under the Hudson River, which was\nbuilt in 1939. A cross-section of the tunnel is shown in the figure below. In your analysis,\nignore the air ducts, assume they are closed. Model the tunnel as a rectangular waveguide\nof dimension 6.55m × 4.19m .\n4.19m\nexhaust air duct\n6.55m\nfresh air duct\nFigure 6.1\n(a) Give the range of frequencies for which only the dominant mode, TE10 , may propagate.\n(b) Explain why AM signals can not be received.\n(c) Can FM signals be received? Above what frequencies?\nProblem P6.2\nd\nx\nz\nμo, ε1\nDielectric\nμ0, εp\nz = 0\nFig. 6.2\nAs shown in Fig. 6.2, a parallel-plate waveguide is filled with plasma medium for\nz > 0 and with dielectric medium for z < 0. The plasma medium has permittivity\nεp = ε0 1 - ω2\np /ω2 , and the dielectric medium has permittivity ε1 = 3ε0. Let d =\n\n√\n√\n15 π/(ω\nμ0ε0) .\n(a) Consider the case when εp = ε1 (namely the whole waveguide is filled with dielectric).\nHow many propagating TM modes can be guided?\n(b) Let ωp = (1/2)ω. For waves propagating in the +z direction, which of the above TM\nmodes will be totally reflected at the dielectric-plasma boundary? Why?\n(c) One of the above TM modes will be totally transmitted (no reflection). Which one and\nwhy?\n(d) For a given excitation frequency ω, at what plasma frequency ωp will all of the above\nTM modes be totally reflected?\nProblem P6.3\nAlthough waves are usually guided by at least two plane interfaces, it is also possible to\nguide a wave with a single plane interface between two media. Such waves are called surface\nwaves. Field components of a surface wave decay away from the interface exponentially.\nConsider a plane boundary surface at z = 0 separating two media with μ0, ε0 for z > 0\nand μ0, εp for z < 0.\n(a) For TE waves with\nE = ˆyE0e ikxx\ne-α0z\nz > 0\neαpz\nz < 0\nis it possible to have a TE surface wave? If so, find the dispersion relation.\n(b) For TM waves with\nH = ˆyH0e ikxx\ne-α0z\nz > 0\neαpz\nz < 0\nshow that it is possible to have TM surface waves only if the permittivities of the upper\nand lower regions are real and opposite in sign.\nProblem P6.4\nExplain the following question:\n(a) why there is no TE0 mode in a parellel-plate waveguide?\n(b) why there is no TMm0 or TM0n mode in a rectangular waveguide?\n(c) Is TE00 mode in a rectangular waveguide is a propogating mode?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/a5ab7b71d5f8b4adc0b0c01aff0ac23c_ps7.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 7\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 3.5, J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P7.1\n(a) Consider a 50Ω polyethylene ( ε = 2.25ε0 ) filled coaxial cable with an inner diameter\nof 0.81 mm and an outer diameter of 2.946 mm (Figure 7.1). The cutoff frequency of\nthe next higher-order waveguide mode above TEM is:\nvTEM\nfc ≃ π(a + b)\na\nb\nε\nFigure 7.1\nwhere vTEM is the velocity of the TEM waves in the medium that fills the space\nbetween the conductors. Calculate the cutoff frequency of the lowest high-order mode\nof the given coaxial cable.\n(b) In part (a), if the center conductor is removed and replaced by polyethylene, what\nis the lowest propagating mode? What is cutoff frequency of the lowest propagating\nmode? What is the next higher order propagating mode and its cutoff frequency? What\nis the single-mode operating frequency range of the dielectric-filled circular metallic\nwaveguide?\nProblem P7.2\nConsider an air-filled metallic rectangular waveguide operating at frequency f =\n7.5 GHz (k = 50π m-1) with dimensions a = 3 cm and b < a .\nˆ\nx\nˆ\ny\nˆ\nz\nσ →inf\nb\na\nFigure 7.2.1\n(a) For the fundamental mode ( TE10 mode), determine\n(i) the cutoff frequency\n(ii) the propagation constant kz\n(iii) the phase velocity\n(b) Consider a propagating mode inside the waveguide operating at the same frequency\nf = 7.5 GHz (k = 50π m-1) . The plots of E versus time t at z = 0 and z = 1 cm are\nshown below.\n\nE\nAt z = 0\nE\nAt z = 1 cm\nt\nt\nT\nto = 2 × 10-11 s\nFigure 7.2.2\n(i) Determine the period T.\n(ii) Calculate the phase velocity.\n(iii) Show that kz = 30π m-1 .\n(iv) Find the mode designation (i.e., TEmn, TMmn) for the propagating mode in the\nwaveguide by assigning numerical values to m and n .\n(v) Calculate the length b in cm.\nProblem P7.3\na\nb\nx\ny\nz\nConsider a metallic rectangular waveguide with the longer dimension a = 1.5cm .\n(a) What is the fundamental mode? What is the frequency range for single mode operation?\nWhat is the limitation on b in order to maximize the bandwidth?\n(b) Let the electric field in the waveguide,\nE = ˆyE0 sin kxxe ±ikz z\nbe the fundamental mode operating at 15GHz .\n(i) What is the group velocity vg , and phase velocity vp ?\n(ii) Find the current distribution J s(x) at z = 0 .\n(iii) The breakdown voltage of air is 30kV/cm , find the maximum time averaged power\ndeliverable by the waveguide at 15GHz in the positive z -direction, while maintaining\nmaximum single mode bandwidth. What is b ?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/c9f66b968928f69a16a7bbb3efb69073_ps8.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 8\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 4.1-4.3, J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P8.1 In the ˇCerenkov radiation, the total energy radiated by a cylinder of path l\nand radius ρ is\nSρ = μq2l\ninf\ndω ω 1 -\n4π\nn2β2\nSo, the energy lost per unit length per unit frequency band is\ndSρ = μq2\nω 1 -\ndl dω\n4π\nn2β2\n.\n(a) By Ephoton =\ndλ\nλ2\nhω and dω = 2πc , show that the number of photon radiated on unit\npath at wave length λ is\nd2N = q2c\nhμ(1 - n2\nβ2 )\ndl dλ\n2λ2\ndl\nλ2 sin2 θ , which gives the dependence of\nand show the frequently used formula dN ∝ dλ\nN on λ and θ .\n(b) Gas ˇCerenkov detector is widely used in particle experiment. The refractive index of\nthe gas n is typically 1.002. What will be the angle for the ˇCerenkov radiation in case\nof β = 1 ?\n(c) Most energy is radiated by the waves in the band 350 nm ∼ 550 nm. How many photons\ncan you get on unit path? In order to get 100 photons for the detector, how long is\nthe path ( l )? This is the size the detector should be. Note that the parameters are as\nfollows: h = 6.63 × 10-34/(2π)J · s/rad , q = 1.6 × 10-19C , β = 1 .\nProblem P8.2\n(a) Find the far field electric and magnetic vectors due to an infinitely long line current\nsource with I(z) = I0eikz z , placed along the z axis in free space. Show that the electric\nand magnetic fields in the far field are\nI0kρ\nρkz - ˆ\n4 )\nE(r) ≈ 4ωε\nπkρρ [ˆ\nzkρ]e i(kρ ρ+kz z- π\nˆ I0kρ\n4 )\nH(r) ≈ φ 4\nπkρρe i(kρρ+kz z- π\n(b) Evaluate the real part of the complex Poynting's vector in the far field. What happens\nif kz > k ?\n(c) Determine the equi-phase surfaces (phase fronts) in the far field, both for kz < k and\nkz > k . Is the real part of the Poynting's vector normal to the equi-phase surfaces?\n\nProblem P8.3\nThe electric field produced by a particle with charge q moving at a velocity vzˆ is\n-q\nω\nˆ\nE(r) = 8πωε zk2 + i ∇ H0\n(1)(kρρ)e iωz/v\nv\nIn the radiation zone, kρρ ≫ 1 , and H0\n(1)(kρρ) ≈\niπkρρ eikρρ .\n(a) Write the electric field in the radiation zone.\n(b) Write the wave vector k .\n(c) What is the range of speed v in which kρ is real?\n(d) Specify the polarization of the wave.\nProblem P8.4\nThe inner product or dot product between two column vector A and B , each repre\nsented as a n × 1 matrix a and b can be expressed as\nA · B = a T b\nand the outer product between A and B can be expressed as\nA B = abT\nLet A = (ˆ\ny + ˆ\nx + ˆ z) , so whereas\nA · A = 3\nis a scaler, the outer product of the two vector:\nA A\ngives\n\nxˆ\nˆy\nˆz\nˆx\nxˆ xˆ\n\nˆx\nyˆ yˆ\nyˆ\nˆy ˆz\n\nzˆ\nˆy\nˆx\nzˆ zˆzˆ\nEach column of the resulting dyadic can be view as a vector and operators that operate\non the dyadic operate in a column-wise fashion:\n\nxˆ\nˆy\nˆz\nˆx\nxˆ xˆ\n\nˆx\nyˆ yˆˆz = (∇· A)ˆ\ny + (∇· A)ˆ\n∇· yˆ\nˆy\nx + (∇· A)ˆ\nz\nzˆ\nˆx ˆzyˆ\nˆzzˆ\n(i) Show that ∇· I = ∇\n(ii) By taking the divergence of the equation\n∇× ∇× G - k2G = Iδ(r - r ′)\n(P1)\n\nshow that\n-k2∇· G = ∇δ(r - r ′)\n(iii) Expand (P1), show that\n(∇2 + k2)G = -Iδ(r - r ′) + ∇∇ · G\n(iv) Combine part (ii) and (iii), show that\n(∇2 + k2)G = - I +\n∇∇ δ(r - r ′)\nk2\nand hence by writting G = I + k\n2 ∇∇ g , all we need to solve is the scaler equation\n(∇2 + k2)g = -δ(r - r′) .\nProblem P8.5\nWhat is the differential equation that governs the one-dimensional scalar\nGreen's function in free space g(x, x′) ? Show that the one-dimensional Green's function\nis\ng(x, x ′) = ieik|x-x|\n2k\nProblem P8.6\nThe magnetic field H and electric field E of a Hertzian dipole at very large distances\n( kr ≫ 1 ) are\nˆ\nH = -φωkql sin θ cos(kr - ωt)\n4πr\nE = - ˆ\nθ k2ql sin θ cos(kr - ωt)\n4πεor\n(a) Find the Poynting's power density vector S as a function of time. What is the time-\naveraged power density vector S ?\n(b) By integrating the Poynting vector over the surface of a sphere of radius r , find the\ntime-averaged power P radiated by the Hertzian dipole.\n(c) The amplitude of the current in the Hertzian dipole is Io = ωq . By using P = 1\n2 Io\n2Rrad ,\nfind the radiation resistance Rrad of the Hertzian dipole."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/daf011ec8e3d96eee4c9fc8c65cb6b87_ps9.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 9\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 4.3-4.4, J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P9.1\nA turnstile antenna consists of two Hertzian dipoles positioned at right angles to each\nother with constant current distributions given by\nxIlδ(r)\nand\nJ 2 = ˆ\nJ 1 = ˆ\nyiIlδ(r)\nrespectively.\n(a) Show that the electric field produced by this antenna is\nikIleikr\ni\ni 2\nE = -η\ne iφ ˆ\n+\n2 sin θ\nr\n4πr\nkr\nkr\n\ni\ni\ni\n- ˆ\nθ 1 + i +\ncos θ - ˆ\nφ i 1 +\n+\nkr\nkr\nkr\nkr\n(b) Find the total electric field in the far-field (kρρ ≫ 1) in the x-y plane with θ =\nπ/2. Show that the real space-time dependence of the electric field is of the form\ncos(ωt - φ - kρρ). Note that\nˆ\nr cos φ sin θ - ˆ\nx = ˆ\nφ sin φ + ˆ\nθ cos φ cos θ\nr sin φ sin θ + ˆ\nyˆ = ˆ\nφ cos φ + θ ˆ sin φ cos θ\nWhat is the polarization of the radiated wave in the x-y plane?\n(c) Find the radiation power pattern in the x-y plane.\n(d) Find the total radiated electric field on the z axis. What is the polarization of the\nradiated wave in the zˆ direction?\n(e) Calculate the power density radiated in the +ˆ direction in the far field and compare\nz\nit with the radiated power density in the +ˆx direction.\nProblem P9.2\nIn magnetic resonance imaging (MRI) applications, assume the magnetic moment of\nx cos ωt + ˆ\na nucleus is M = M0(ˆ\ny sin ωt) , where the angular Larmor frequency ω = γB0\nand the static magnetic field B0 is in the zˆ direction.\n(a) Show that the magnetic field produced by the spinning nucleus in the vicinity of the\nnucleus is\nr(ˆ\nH(r) =4πr3 -M + 3ˆ r · M )\n(b) Find the x-component of the time-varying magnetic field linking a pickup coil placed\non the y-z plane at a distance x = d with its center lined up with the x-axis. The\n\ninduced voltage (magnetomotive force) on the pick-up coil can be determined using\nthe following formula\n∂\nV = -\ndaBx(r, t)\n∂t A\nShow that the induced voltage on the pick-up coil has the form\nV = U (ω) sin ωt\nFind the coefficient U (ω) . Why a large static magnetic field B0 is needed to obtain\nlarge induced voltage on the pick-up coil?\n(c) Consider two magnetic dipoles with the same gyromagnetic ratio γ placed on the\nz-axis with separation δ . Assume that the two magnetic dipoles are close to the\norigin so that the induced voltage due to each one can be approximated by Vi =\nU (ωi) sin ωit (i = 1, 2) . Using a radio-frequency (RF) pick-up coil, the Larmor fre\nquency ωi can be measured accurately. Let ω1 - ω2 = ∆ω . Find the difference of the\nstatic magnetic field B0 acting on the two magnetic dipole moments in terms of ∆ω\nand γ .\n(d) Let the static magnetic field be B0 = ˆz(b0 + b1z) and the difference of the Larmor\nfrequencies be ω1 - ω2 = ∆ω . Find the separation δ of the two magnetic dipole\nmoments in terms of ∆ω , γ , and b1 .\n(e) Assume that the magnetic dipoles are spinning protons of water at room temperature,\nand the gyromagnetic ratio of proton is γ = 2.7 × 108 T-1s-1 . Let the two protons\nlocate on the z-axis. The applied static magnetic field is B = ˆz(b0 + b1z) , where\nb0 = 1.0 T and b1 = 1.0 T/m . Find the frequency resolution in kHz of the pick-up coil\nto measure the two protons with separation δ = 0.5 mm on the z-axis.\nProblem P9.3\nTwo short dipoles, separated by a distance d = λ/4 , are positioned at right angles as\nshown in Figure 9.3. Dipole 1, located at y = d/2 , is oriented in the zˆ direction and has\nthe dipole moment I0l . Dipole 2, located at y = -d/2 , is oriented in the ˆx direction and\nhas the dipole moment I0l.\nz\ny\nx\ny = d/2\nI0l\nd = λ/4\ny = -d/2\nI0l\nFig. 9.3\n(a) Calculate the electric field vector E in the far field on the +y axis (θ = π/2, φ = π/2) .\nDescribe the polarization of E , sketch the polarization ellipse, and indicate the sense\nof rotation of E(t) in time at a fixed point.\n\n(b) Repeat (a) for the electric field E in the far field on the +x axis (θ = π/2, φ = 0) .\n(c) Calculate the time-average Poynting vector S(r, θ, φ) in the far field.\n(d) Calculate the total time-average power radiated from the two dipole system in terms\nof the radiation resistance Rrad of a single dipole. Note Rrad = 20(kl)2 .\nProblem P9.4\nA radio station is located on the coast, west of a city, as shown in Figure 9.5(a). The\ntransmitting antenna tower may be modeled as a Hertzian dipole antenna of dipole moment\nIol .\nN\nAntenna\ntower\nIol\nIol\nE\nIoleiψ\nd\nφ\nOcean\nCoast\n(a)\n(b)\nIol\nIoleiψ\nd\n(c)\nFig. 9.5\n(a) The radio station was able to erect another antenna tower. Relative to the first antenna\ntower, at what distance d should the second tower be placed and with what phase\ndifference ψ ( -π < ψ ≤ π ) should it be fed, so that there is a null in the radiation\npattern in the direction of the ocean and no \"dead\" spots in the reception area as\nshown in Figure 9.5(b).\n(b) As shown in Figure 9.5(c), consider another radio station which must serve two cities,\n\nsending most of the power over the land area and little power in the direction of the\nocean (a null at φ = 180* ), with maximum radiation in the direction of the two\ncities ( φ = ±60* ), and no nulls, or \"dead\" spots, in the reception area ( |φ| ≤ 90* ).\nDetermine the spacing d of these two antenna towers and the relative phase difference\nψ ( -π < ψ ≤ π ) to satisfy these requirements."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/35ceefc3266d13f76168bb9a985ca7f7_ps10.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\nProblem Set No. 10\n6.632 Electromagnetic Wave Theory\nSpring Term 2003\nReading assignment: Section 4.3, 4.4, 5.1 J. A. Kong, \"Electromagnetic Wave Theory\"\nProblem P10.1\nIn Magnetic Resonance Imaging (MRI) study, it is very useful to define a rotating\nframe of reference which rotates about the z axis at the Larmor frequency ( ω0 = γB0 ,\nγ is the gyromagnetic ratio). Consider the bulk magnetic moment M0zˆ placed in a DC\nmagnetic field B0 ˆz . When a MRI transmitting coil generates a magnetic field of frequency\nω1 , effective total magnetic field can be described as\nB = B0zˆ + B1(cos(ω1t)ˆ\ny)\nx - sin(ω1t)ˆ\nAnd the rotating coodinate can be defined as\nx ′ = ˆ\nˆ\nx cos(ω1t) - yˆ sin(ω1t)\nˆ′ = ˆ\ny cos(ω1t)\ny\nx sin(ω1t) + ˆ\nˆ′ = ˆ\nz\nz\n(1) Show that when ω1 = ω0 = γB0 (called \"on resonance\"), magnetic moment M will\nrespond to this B1 field as a rotation about the x′ axis in the rotating frame. In other\nˆ\nwords, the effective B1 field is B1x′ .\n(2) Also show that if ω1 = ω0 (called \"off resonance\"), the effective B1 is the vector sum\nˆ\nof B1x′ and ∆B0zˆ′ , where ∆B0 = (ω0 - ω1)/γ .\nProblem P10.2\n(a) In MRI, the resonance frequency (Larmor frequency) ω0 of a spin particle is related\nto the magnetic field B0 by gyromagnetic ratio, ω0 = γB0 . 1 H nucleus has two spin states.\nThe energy of the photon needed to cause a transition between the two spin states of 1 H\nnucleus in a 1.5T magnetic field is 4.23× 10-26 J. What is the gyromagnetic ration of 1 H?\n(Note that the energy E of a photon at frequency ω is E =\nh = 6.63 × 10-34\nhω , where\nJ s.)\n(b) A sample contains two small distinct water locations where there is 1 H spin density.\nIn a uniform field, each of the 1 H have the same Larmor frequency. However, if a linear\ngradient Gx is superimposed on the main magnetic filed B0 , the Larmor frequency will\ndepend on position along the x axis. ω = γ(B0 + xGx) = ω0 + γxGx . The MRI spectrum\ncontains frequencies of 63.872 MHz and 63.867 MHz when B0 is 1.5 T and Gx = 1 × 10-2\nT/m. What are the locations of the water?\nProblem P10.3\n(a) Consider an array of two out-of-phase but equal amplitude zˆ-directed Hertzian dipoles\nas shown in Fig. 10.3. The wavelength is λ.\n\nN\nW\nE\nIl\nS\nFig. 10.3\nShow that the array factor |F (φ)| may be expressed as\nkd\nψ\n|F (φ)| = 2 cos 2 sin φ - 2\n\n(b) A broadcast array of two vertical towers with equal current amplitude is to have a\nhorizontal plane pattern such that\n(i) maximum field intensity is to the north (φ = 90*)\n(ii) the only nulls are at φ = 225* and φ = 315* .\nSpecify the arrangement of the towers, their spacing and phasing.\nProblem P10.4\nAn electric dipole antenna with dipole moment Il is oriented in the ˆz direction and\nis placed at the corner of a wall as shown in the figure. The ground and the wall are\nconsidered to be perfectly conducting and their areas are assumed to be infinite.\nh\nd\nIl\nz\nθ\nx\nσ →inf\n\nr\nσ →inf\nFig. 10.4\n(a) Find the three images of the dipole antenna. Indicate the coordinates and the orienta\ntions of the images.\n(b) Explain why the radiation field from the dipole antenna is zero everywhere if d = 0 .\n(c) Let h = 0 . The radiation pattern of the electric field |E| is shown in Figure 10.4.c,\nwhere the maximum value |E|max appears at θ = 90* , and the nulls appear at θ = 0\nand θo .\nd\nφ\nIleiψ\n\nz\nx\nθo\n|E|\n|E|max\nFig. 10.4.c\n(i) What is the value of θo ?\n(ii) Find the distance d in terms of wavelength λ .\n(d) Let h = 0 . Find the value(s) of d in terms of wavelength λ such that the radiated\npower along the ˆx axis is zero.\n(e) What is the field in region z < 0 , and what is the field in region x < 0 ?\n(f) Let h = λ/2 and d = λ/4 . Using pattern multiplication technique, sketch the radiation\npattern on the xz-plane."
    },
    {
      "category": "Exam",
      "title": "Quiz No. 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/dc5cd73c9f6bc51111fe77a3c638a3c5_q1.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.632 Electromagnetic Wave Theory\nQuiz No. 1\nProblem 1(40%)\nConsider a plane wave incident on a planar boundary at x = 0 from a dielectric\nmedium with ε = 9εo as shown in the Fig. 1. The right-hand circularly polarized incident\nelectric field is\nEi = E0 2ˆy sin(kxx + kz z - ωt) + (\n√\n3ˆ\nx) cos(kxx + kz z - ωt)\nz - ˆ\nwhere E0 is a real constant. The reflected field is\nEr = E0[RTE 2ˆy sin(-kxx + kz z - ωt) + RTM (-\n√\n3ˆ\nx) cos(-kxx + kz z - ωt)]\nz - ˆ\nθ\nEi\nμo\nμo\nεo\nεt\nregion 1\nregion 2\n\nReflected wave\n,\n,\nz\nx\nFig. 1\n(a) Show that the incident angle is 30* .\n(b) For kz = 1 m-1 , find the frequency (in Hz) and the wavelength (in m) in region 1.\n(c) Find the value of εt ( 0 < εt/εo < inf ) for which the incident angle is equal to the\ncritical angle.\n(d) In the case of εt = 3εo , find the polarization of the reflected field.\nProblem 2(40%)\nConsider a circularly polarized electromagnetic wave normally incident upon a slab as\nshown in Fig. 2. The incident electric field is expressed by\nˆ\nEi = Eox cos (ky y - ωt) + αEozˆ cos (ky y - ωt + β) .\nIn this problem, neglect the reflection of the slab.\n\nz\nEt\ny\nx\nd\nFig. 2\n(a) Let the incident wave be left-hand circularly polarized and assume that both α and\nβ are positive, what is α and what is β ?\n(b) Let the slab be a uniaxial medium with the permittivity tensor\n\nεx\n\nε = 0\nεy\nεz\nwhere εx = εy = 4εo , εz = 9εo and the permeability μ = μo . Inside the uniaxial slab,\nˆ\nwhat is the wave number ky for the x-polarized electric wave in terms of the wave\n√\nnumber in free space ko , where ko = ω\nμoεo ?\n(c) For the uniaxial slab as in Part (b), let the incident wave be left-hand circularly po\nlarized, what is the minimum√thickness d in terms of the wavelength in free space\nλo , where λo = 2π/ko = 2π/ω μoεo , such that the output electric field is right-hand\ncircularly polarized?\nProblem 3(20%)\nConsider a rectangular waveguide with dimensions 1 cm × 0.5 cm.\n(a) What are the cutoff frequencies for the first five modes?\n(b) If the waveguide is excited at 20 GHz, what are the propagation modes? What are the\ncorresponding propagation constants kz ?\nEi\n\nki"
    },
    {
      "category": "Exam",
      "title": "Quiz No. 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-632-electromagnetic-wave-theory-spring-2003/8b6de07d9d935d830d57304f16c10197_Q2.pdf",
      "content": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.632 Electromagnetic Wave Theory\nQuiz No. 2\nProblem 1(40%)\nConsider the following two Hertzian dipoles as shown in Fig. 1 driven at an angular\nfrequency ω and with the same dipole moment. The first dipole is located at the origin\n(0, 0, 0) and oriented in the yˆ direction. The second dipole is located at (0, 0, -3λ/4) and\noriented in the ˆx direction.\nz\ny\nλ/4\nI0l\nI0l\nx\nFig. 1\n(a) Give the expression for the vector current moment f (θ, φ) . What are fθ and fφ ?\n(b) Show that in the far field the electric field is given by\neikr\n\nE = ikη0I0l 4πr θ cos θ(sin φ + cos φei cos θ 3\nπ ) + ˆ\nˆ\nφ(cos φ - sin φei cos θ 3\nπ )\n(c) What is the polarization of the radiated wave in the +zˆ direction?\nWhat is the polarization of the radiated wave in the -ˆz direction?\n(d) What is the polarization of the radiated wave in the +ˆx direction?\nWhat is the polarization of the radiated wave in the +ˆy direction?\nProblem 2(20%)\nIn this problem, we consider several equivalent situations for a plane wave propagation\nin the zˆ direction. Let the electric field be ˆx directed.\nxE0e\ny\nE = ˆ\nikz ,\nH = ˆ E0e ikz\nη\nand the region of interest be z > 0 .\n(a) Put an electric current sheet with J s = Aˆx . What is the value of A so that the same\nfield is preserved in the region of interest?\n(b) Put a magnetic current sheet with M s = Byˆ . What is the value of B so that the\nsame field is preserved in the region of interest?\n(c) Replace the region z < 0 with a perfect conductor. Place in front of the conductor an\nelectric sheet with J s = C ˆx and a magnetic current sheet with M s = Dyˆ . What is\nthe value of C and D so that the same field is preserved in the region of interest?\n\nProblem 3(40%)\nAn electric dipole antenna with dipole moment Il is oriented in the ˆz direction and\nis placed in the front of perfectly conducting wall as shown in the Fig. 2a. The wall is\nlocated at x = 0 and extends to infinity in both y and z directions. The dipole is located\nat (d, 0, 0) , where d = λ/4 .\nσ →inf\nd\nIl\nz\nθ\nx\nr\ny\nσ →inf\nd\nIl\nz\nθ\nx\nr\ny\nFig. 2a\nFig. 2b\n(a) Consider the case where the wall is removed in Fig. 2a.\nPlot the radiation pattern of the electric field |E| in the xz plane.\nPlot the radiation pattern of the electric field |E| in the xy plane.\n(b) The wall is still there as shown in the Fig. 2a. Plot the radiation pattern of the electric\nfield |E| in the xz plane.\nIn part (c), (d), (e), the dipole is oriented in x direction as shown in Fig. 2b.\n(c) Consider the case where the wall is removed in Fig. 2b.\nPlot the radiation pattern of the electric field |E| in the xz plane.\n(d) The wall is still there as shown in Fig. 2b. Plot the radiation pattern of the electric\nfield |E| in the xz plane.\n(e) If the dipole is located at d = 5λ/4 , give all the values of θ ( 0 ≤ θ ≤ π/2 ) at which\nthe null occurs for the far field."
    }
  ]
}