{
  "course_name": "Electron Microprobe Analysis",
  "course_description": "The electron microprobe provides a complete micrometer-scale quantitative chemical analysis of inorganic solids. The method is nondestructive and utilizes characteristic X-rays excited by an electron beam incident on a flat surface of the sample. This course provides an introduction to the theory of X-ray microanalysis through wavelength and energy dispersive spectrometry (WDS and EDS), ZAF matrix correction procedures and scanning electron imaging with back-scattered electron (BSE), secondary electron (SE), X-ray using WDS or EDS (elemental mapping), and cathodoluminescence (CL). Lab sessions involve hands-on use of the JEOL JXA-8200 Superprobe.",
  "topics": [
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Physical Chemistry",
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Physical Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week for 2 weeks, 4 hours / session\n\nDescription\n\nThe electron microprobe provides a complete micrometer-scale quantitative chemical analysis of inorganic solids. The method is nondestructive and utilizes characteristic X-rays excited by an electron beam incident on a flat surface of the sample. This course provides an introduction to the theory of X-ray microanalysis through wavelength and energy dispersive spectrometry (WDS and EDS), ZAF matrix correction procedures and scanning electron imaging with back-scattered electron (BSE), secondary electron (SE), X-ray using WDS or EDS (elemental mapping), and cathodoluminescence (CL). Lab sessions involve hands-on use of the JEOL JXA-8200 Superprobe.\n\nPrerequisites\n\nPermission of instructor.\n\nSyllabus\n\nTheory of X-ray Spectrometry\n\nElectron-specimen interactions\n\nElastic scattering: Electron backscattering\n\nInelastic scattering: Secondary electron excitation, Cathodoluminescence, Continuum X-ray generation, Characteristic X-ray generation\n\nInteraction volume\n\nMatrix corrections\n\nAtomic number, Absorption and Characteristic fluorescence corrections\n\nContinuum fluorescence correction\n\nφ(ρz) corrections\n\nInstrumentation\n\nDetectors in the electron microprobe\n\nElectron detectors: Everhart-Thornley and Solid-state diode detectors\n\nCathodoluminescence detector\n\nX-ray detectors: Energy dispersive and Wavelength dispersive spectrometers\n\nAnalyzing crystals and proportional counters in WDS\n\nImaging Techniques\n\nCompositional and topographic imaging\n\nElemental X-ray mapping\n\nCathodoluminescence imaging\n\nQuantitative Analysis\n\nSample preparation\n\nWavelength dispersive spectrometry\n\nBackground and peak overlap corrections\n\nRecommended Textbook\n\nGoldstein, J. I., D. E. Newbury, et al.\nScanning Electron Microscopy and X-ray Microanalysis\n. 3rd ed. Kluwer Academic/Plenum Publishers, 2003. ISBN: 9780306472923.\n\nGrading\n\nThe basis for the grade is completion of all the lab exercises (problem sets) and the quiz.",
  "files": [
    {
      "category": "Assignment",
      "title": "MIT12_141IAP12_pset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/c5687fcda5afec945356c0d5d13ecd2b_MIT12_141IAP12_pset1.pdf",
      "content": "Coourse 112.1411: Elecctron M\nMicropprobe\nAnnalysiss - Prooblem Set 1\n\nProbllem 1: Use bback-scattereed electron ((BSE) imagiing and enerrgy dispersivve spectromeetry\n(EDSS) to identifyy the phases in the samplle provided. Save the immage and appply identificaation\nlabelss. Use the foollowing eneergy dispersive spectra ass a guidelinee for phase identificationn.\n\nN. Chattterjee: January 20122, MIT, Cambridge , MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_141IAP12_pset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/0f5c8ceaca697c4c332f8b589df6f7fd_MIT12_141IAP12_pset2.pdf",
      "content": "Course 12.141: Electron Microprobe\nAnalysis - Problem Set 2\nProblem 2.1: Use wavelength dispersive spectrometry (WDS) to acquire X-ray spectra to\nidentify elements in each phase of the sample provided. Perform semi-quantitive analysis to\nobtain approximate composition of the phases.\nProblem 2.2: Acquire X-ray elemental maps of the polished sample provided with WDS and\nEDS. Identify the phases and use an image analysis software to find the area percent of each\nphase.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_141IAP12_pset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/280f89adb3beb8aee08a2abbbca06fb8_MIT12_141IAP12_pset3.pdf",
      "content": "Course 12.141: Electron Microprobe\nAnalysis - Problem Set 3\nProblem 3.1: Quantitative analysis of Fe and Ni in Fe-Ni alloys through wavelength\ndispersive spectrometry (WDS). For FeK (K=1.937A) and NiK (K=1.658A), use\nBragg's law to decide which diffracting crystal (TAP: 2d=25.757A; PET: 2d=8.742A; LIF\n2d=4.027A) would be the best to use to measure the X-ray intensities. The optimal range of\n2 for each crystal is between 30o and 130o and that the best peak shape is achieved near the\nmiddle of the 2 range of the spectrometer.\nPerform WDS analysis to determine the Fe and Ni contents of the five Fe-Ni alloy\npolished samples provided. Analyze five points in each sample using the K X-rays of Fe\nand Ni, an accelerating voltage of 15 kV and a beam current of 10 nA. The nominal\ncomposition of the samples are given below:\n\nSample\nFe (wt%)\n\nNi(wt%)\n\nFN-Ol-6\n98.12\n1.82\nFN-Ol-11\n88.07\n11.01\nFN-Ol-12\n51.95\n48.06\nFN-Ol-8\n25.1\n73.95\nMA8.50-003\n14.38\n87.01\nProblem 3.2: In the Ti-V system, the VK peak overlaps the TiK peak. Analyze the steel\nsample for Ti and V using their K X-rays, an accelerating voltage of 15 kV, a beam current\nof 10 nA and applying peak overlap corrections. The L-values of characteristic X-rays for Ti\nand V are given below:\nAnalyzing Crystal\nX-ray\nPET\nLIF\n\nTiK\n88.03\n191.12\n\nTiK\n\n80.52\n174.81\n\nVK\n\n80.19\n174.09\n\nVK\n\n73.17\n158.85\nThe L-value differences (peak separations) between VK and TiK are 0.33 with PET and\n0.72 with LIF. Since the difference is larger with LIF, it should be the preferred crystal for\nanalyzing Ti-V compounds. In this exercise, use both crystals for the measurements. The\nsample contains minor amounts of Ti and V. Set the counting times such that 5-10% standard\ndeviation of counts is achieved. Compare and explain the results obtained with the PET and\nthe LIF crystals.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_141IAP12_pset4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/9381dea75cf12acffe0c2c97edc73c2b_MIT12_141IAP12_pset4_sol.pdf",
      "content": "Course 12.141: Electron Microprobe\nAnalysis - Hints and solution for Problem\nSet 4\n(1) Note that in the equations, if \"i\" is the element being considered, \"j\" stands for all the other elements in the\nsample. Our samples have only two elements, Fe and Ni. So, when calculating parameters for Fe, \"i\" is Fe\nand \"j\" is Ni. For example, Si for Fe will be,\nSFe = CNi * SFe-Ni\nwhere,\nSFe-Ni = (const) [(2ZNi/ANi )/(E0+Ec(Fe K-shell))]ln[583(E0+Ec(Fe K-shell))/JNi ]\nSee p. 14, Eq 3.12 of Course Notes.\n(2) When calculating a parameter for the specimen, you need to find a concentration-weighted average. For\nexample,\n)FeK\n= CFe * ( )FeK + CNi * (\nFeK\n(\n)\nspecimen\n\nFe\nNi\nFeK\nNote when the concentrations of Fe and Ni are equal,( )specimen becomes a simple average,\n(\n\nFeK\n\nFeK\n\nFeK\n)Ni\n] / 2\n)Fe\n+ (\n)specimen = [(\n\nAlso note that the standards are pure metals. So,\n\nFeK\n\nFeK\n(\n)Fes tan dard = ( )Fe\n= 71.4 cm2/g\n\nFeK\n\nFeK\n( )Ni s tan dard = ( )Ni\n= 90 cm2/g\n(3) Note that fluorescence occurs only when the energy of the X-ray being absorbed is higher than the critical\nexcitation energy of the atomic shell of the element it is fluorescing. Since,\nEFeK (6.404 keV) < Ec (Ni K-shell) (8.332 keV),\nFeK cannot fluoresce Ni. So the fluorescence correction factor of Ni is equal 1.\n(4) Your graphs should show the following:\n(A) Atomic number correction deviates more and more from 1 as the composition of the sample deviates\nmore and more from the pure element standards.\n(B) There is a high positive absorption correction for NiK at high Fe contents because NiK is absorbed\nin Fe.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n(C) There is a high negative fluorescence correction for FeK at high Ni contents because NiK\nfluoresces FeK.\nFollowing are the graphs you should obtain:\n0.980\n0.985\n0.990\n0.995\n1.000\n1.005\n1.010\n1.015\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nN i ( wt - f rac)\nFeKa Z\nNiKa Z\nA\n0.990\n1.000\n1.010\n1.020\n1.030\n1.040\n1.050\n1.060\n1.070\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nN i ( wt - f rac)\nFeKa A\nNiKa A\nB\n0.750\n0.800\n0.850\n0.900\n0.950\n1.000\n1.050\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nN i ( wt - f rac)\nFeKa F\nNiKa F\nC\n0.800\n0.850\n0.900\n0.950\n1.000\n1.050\n1.100\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nN i ( wt - f rac)\nFeKa ZAF\nNiKa ZAF\nD\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT12_141IAP12_pset4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/64a21bfba7ca31ffb45e43d02d2334e4_MIT12_141IAP12_pset4.pdf",
      "content": "Coourse 112.1411: Elecctron M\nMicropprobe\nAnnalysiss - Prooblem Set 4\nNiK (EKK=7.478 keVV) is highly absorbed inn Fe (Ec(K-shelll)=7.111 keVV) with\n(/)Fe\nNiK=379.66 cm2/g. As a result, a poositive correection is appllied to the mmeasured k-raatios\nof NiiK in Fe-Ni alloys. On the other haand, FeK iss fluoresced as a consequuence of NiKK\nabsorrption. A neggative correcction is appliied to the meeasured k-raatios of FeK.\nProbllem 4.1: Usee the averagee results obttained in Prooblem 3.1 to plot graphs of Z, A, F, aand\ncombbined ZAF vversus compoosition. Expllain the variaations in Z, AA, F, and ZAAF with\ncompposition.\nProbllem 4.2: In aa single spott analysis, thhe measured k-ratios for FeK and NNiK are 0.5535\nand 00.488 respecttively. Use aan iterative pprocedure to calculate thhe concentrattions of Fe aand\nNi in the alloy.\nThe cconstants neeeded for the calculationss are as folloows:\nZ\nA (g/mole)\nEc(K-shell) (keVV)\nEo (keV)\n()i\nFeK (cm\nm2/g)\n()i\nNiK (cm22/g)\n(o)\n(K)\n(r-1)/r\nP\nFe\nFeK keV\n555.847\n77.111\n71.4\n3379.6\n00.347\n00.880\n1.000\nNi\nNiKK keVV\n58.71\n8.3322\n58.99\n0.4144\n0.8800\n1.0000\nN. Chattterjee: January 20122, MIT, Cambridge , MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_141IAP12_coursenotes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/258d0b0a9acf7a3678d6a99ddf91cc98_MIT12_141IAP12_coursenotes.pdf",
      "content": "Electron Microprobe Analysis\nCourse 12.141\nNotes\nDr. Nilanjan Chatterjee\nThe electron microprobe provides a complete micrometer-scale quantitative chemical\nanalysis of inorganic solids. The method is nondestructive and utilizes characteristic X-\nrays excited by an electron beam incident on a flat surface of the sample. This course\nprovides an introduction to the theory of X-ray microanalysis through wavelength and\nenergy dispersive spectrometry (WDS and EDS), ZAF matrix correction procedures and\nscanning electron imaging with back-scattered electron (BSE), secondary electron (SE),\nX-ray using WDS or EDS (elemental mapping), and cathodoluminescence (CL). Lab\nsessions involve hands-on use of the JEOL JXA-8200 Superprobe.\nMIT Electron Microprobe Facility\nMassachusetts Institute of Technology\nDepartment of Earth, Atmospheric & Planetary Sciences\nweb: http://web.mit.edu/e-probe/www/\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nTABLE OF CONTENTS\nPage number\n1. INTRODUCTION\n2. ELECTRON SPECIMEN INTERACTIONS\n2.1. ELASTIC SCATTERING\n2.1.1. Electron back-scattering\n2.1.2. Electron interaction volume\n2.2. INELASTIC SCATTERING\n2.2.1. Secondary electron excitation\n2.2.2. Characteristic X-ray generation inner-shell ionization\n2.2.3. X-ray production volume\n2.2.4. Bremsstrahlung or Continuum X-ray generation\n3. QUANTITATIVE X-RAY SPECTROMETRY\n3.1. MATRIX CORRECTION\n3.1.1. Atomic number correction (Z)\n3.1.2. Absorption correction (A)\n3.1.3. Characteristic fluorescence correction (F)\n3.1.4. Continuum fluorescence correction\n3.1.5. The φ(ρz) correction procedure\n4. DETECTORS IN THE ELECTRON MICROPROBE\n4.1. ELECTRON DETECTORS\n4.1.1. Everhart-Thornley (E-T) detector for topographic contrast\n4.1.2. Solid-state diode detector for compositional contrast\n4.2. CATHODOLUMINESCENCE DETECTOR\n4.3. X-RAY DETECTORS\n4.3.1. Energy Dispersive Spectrometer (EDS)\n4.3.2. Wavelength Dispersive Spectrometer (WDS)\n4.3.2.1. Diffracting crystal in WDS\n4.3.2.2. X-ray detector in WDS: proportional counter\n4.3.2.3. Signal processing in WDS: pulse height analysis (PHA)\n5. COMPOSITIONAL IMAGING BY WDS\n5.1. BACKGROUND CORRECTION IN WDS COMPOSITIONAL IMAGING\n5.2. DEFOCUSING IN BEAM-RASTERED WDS X-RAY MAPS\n6. QUANTITATIVE ANALYSIS WITH WDS\n6.1. SAMPLE PREPARATION\n6.2. QUALITATIVE ANALYSIS\n6.3. CALIBRATION AND UNKNOWN ANALYSIS\n6.3.1. Background and Peak Overlap Correction in WDS\n7. REFERENCES\n7.1. SOURCES AND RECOMMENDED READING\n7.2. ACKNOWLEDGEMENTS\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n1. INTRODUCTION\nThe electron microprobe, also known as the electron probe micro-analyzer\n(EPMA), uses X-ray spectrometry to identify and measure concentration of elements in\nmicroscopic volumes of the specimen. In the EPMA, a finely focused electron beam\ninteracts with the sample to generate back-scattered electrons (BSE), secondary electrons\n(SE), characteristic X-rays and light known as cathodoluminescence (CL). By scanning\nthe electron beam over a surface of the sample, these signals can be used to obtain high\nresolution scanning electron images, X-ray maps showing spatial distribution of\nelements, and CL images for phase (element and compound) identification, estimation of\nphase distribution and proportions, trace element compositional variation and surface\ntextural analysis of multi-phase composites. Characteristic X-rays generated from a\nmicroscopic volume in spot mode (i.e., beam not scanning) are utilized to obtain a\ncomplete quantitative chemical analysis. Sample preparation is minimal, but a well\npolished surface is required for accurate quantitative analysis. Although the EPMA is\nmostly used for studying inorganic materials, organic compounds such as polymers and\nbiological specimens can also be studied by following special procedures and sample\npreparation techniques.\nThe MIT electron microprobe facility has two JEOL Superprobes: a JXA-8200\nand a JXA-733. In these instruments, the electron beam is generated from a heated\ntungsten filament by thermionic emission in a potential difference typically between 10\nand 30 kV. The JXA-8200 has an option to use a LaB6 single crystal as a thermionic\nemission source that provides a highly stable, high intensity and smaller diameter\nelectron beam for higher resolution imaging and more reliable chemical analysis than\nwith the W filament. The beam is focused by two sets of coils, the condenser and the\nobjective lenses, and several apertures that produces a final beam diameter between 1 nm\nand 1 μm. Beam currents range between 1 pA and 1 μA. A reflected light optical\nmicroscope is mounted co-axially with the electron beam for accurately setting the\nworking distance, the distance between the sample and the objective lens. Both energy\ndispersive and wavelength dispersive spectrometers (EDS and WDS) are available on the\nmicroprobes for qualitative and quantitative analysis. The beam can be rastered over the\nsample to produce images in the magnification range of 40-360,000X. X-ray elemental\nmaps are obtained by using the emitted X-rays as the signal source instead of BE or SE.\nCL images are obtained by attaching a photomultiplier to the optical microscope port on\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nthe JXA-733. The JXA-8200 is equipped with the xClent system for high resolution,\ncolored CL imaging and spectrometry to identify and quantify dopants and impurities in\nnatural and synthetic semiconductors. The microprobes are maintained under high\nvacuum, typically in the pressure range of 2x10-5-10-6 torr (about one-billionth of the\natmospheric pressure), by a combination of mechanical and diffusion pumps.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n2. ELECTRON SPECIMEN INTERACTIONS\nWhen an electron beam strikes a target (that is, the sample), the electrons are\nscattered by the target atoms. There are two types of electron scattering:\nElastic Scattering\nInelastic Scattering\nE1 = E0, large φe\nE1<E0, small φi\n(φe>>φi)\nwhere, E0 is the energy of the incident electron; E1, the energy of the electron after\nscattering; φe, the elastic scattering angle; and φi, the inelastic scattering angle.\n2.1. ELASTIC SCATTERING\nElastic scattering affects trajectories of the beam electrons inside the specimen\nwithout significantly altering the kinetic energy of the electron (e.g., electron back-\nscattering). The scattering probability or cross-section of elastic scattering, Q for\nscattering angles greater than φe, is given by the screened Rutherford expression:\nQ(>φe) = 1.62x10-20 (Z2/E2)cot2(φe/2)\n(2.1)\nevents.cm2/e-.atom; where, Z is the atomic number; and E, the incident electron energy\n(keV). Q is thus proportional to the square of Z of the target, and inversely proportional to\nthe square of E of the electron beam.\n2.1.1. Electron back-scattering\nWhen the elastic scattering angle is greater than 90o, backscattering occurs. It may\nalso occur through multiple scattering at high angles. The back-scatter coefficient, η, is\nthe fraction of beam electrons scattered backward:\nη = nBSE/nB = iBSE/iB\n(2.2)\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nwhere, nB is the number of incident beam electrons and nBSE is the number of back-\nscattered electrons (i's denote current). For compounds, η is given as:\nη = Σj Cjηj\n(2.3)\nwhere, j denotes the constituent elements and Cj the concentration j in the compound. η\nincreases monotonically with atomic number and it is independent of beam energies\nabove 5 keV.\n2.1.2. Electron interaction volume\nThe electron range is the distance between the point where the beam electrons\nenter the specimen and the point where they lose all their energy and leave the specimen\nas sample current. The Kanaya-Okayama range takes into the account the combined\neffects of elastic and inelastic scattering and is given by:\nRKO = KE n\n0 /ρ\n(2.4)\n(μm), where, K = 0.0276A/Z0.889 , A (g/mole), the atomic weight, Z, the atomic number, ρ\n(g/cm3), the density, E0 (keV), the incident beam energy, and n = 1.67. Typical ranges (at\nperpendicular beam incidence and 15 keV beam energy) are 1.8 μm for C, 1.1 μm for Fe\nand 0.8 μm for U.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMonte Carlo electron-trajectory simulations have shown that the size of the\nelectron interaction volume in a specimen increases with the incident beam energy. There\nis less elastic scattering as beam energy increases (Eqn. 2.1) and the electrons are able to\npenetrate deeper into the specimen at higher beam energies. The interaction volume\ndecreases with increasing atomic number as predicted by Eqn. 2.1. Experiments suggest\nthat the interaction volume has a distinct pear shape for low atomic number targets,\nwhereas, it becomes spherical for larger atomic number targets. Most of the back-\nscattered electrons come from the top part of the interaction volume. For example, 90%\nof the back-scattering occurs in the top 17% of the depth of electron penetration in Au\nand the top 29% of the depth in C (at perpendicular beam incidence and 20 keV beam\nenergy).\n2.2. INELASTIC SCATTERING\nInelastic scattering involves transfer of energy from the beam electrons to the\natoms of the specimen (e.g., generation of secondary electrons, Auger electrons,\ncharacteristic X-rays and bremsstrahlung or continuum X-rays). The trajectory of the\nbeam electron is not altered significantly.\n2.2.1. Secondary electron excitation\nSome sample electrons mobilized through inelastic scattering by beam electrons\novercome the surface energy barrier and escape from the sample. These electrons are\nknown as secondary electrons. They have lower energies (<50 eV; majority <10 eV)\ncompared to back-scattered electrons.\nThe secondary electron coefficient, δ, is defined as\nδ = nSE/nB = iSE/iB\n(2.5)\nwhere, nB is the number of incident beam electrons and nSE is the number of secondary\nelectrons (i's denote current). Compared to the backscatter coefficient, δ is relatively\ninsensitive to the target atomic number. It generally increases with a decrease in the beam\nenergy.\nAlthough sample electrons are mobilized throughout the interaction volume, their\nescape probability from the surface of the sample decreases sharply with depth. The\nescape depth of secondary electrons is only about 1/100 of that for backscattered\nelectrons for incident beam energies in the range 10-30 keV. Hence, secondary electrons\nare useful in studying the surface characteristics of the sample. Samples are commonly\ncoated with a thin film of gold that enhances the secondary electron yield.\n2.2.2. Characteristic X-ray generation: inner-shell ionization\nX-rays are electromagnetic radiations in the energy range of about 0.12 to 120\nkeV (wavelength range: of 10 to 10-2 nanometer). The typical range of X-ray energies\nanalyzed in the EPMA are between 0.12 and 10 keV. An element is identified by its\ncharacteristic set of emitted X-ray energies.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe energy, E, of an X-ray is given by\nE = hν\n(2.6)\nWhere, h is the Planck's constant (6.626x10-34 Joule.sec=6.626x10-34 / 1.6021x10-16\nkeV.sec) and the frequency ν = c/λ, c being the speed of light in vacuum (2.99793x1017\nnm/sec) and λ being the wavelength. Thus, the wavelength is related to the energy as:\nλ = hc/E = 1.2398/E\n(2.7)\nwhere, λ is in nm and E is in keV.\nWhen the beam electrons scatter inelastically, tightly bound inner shell electrons\nmay be ejected from the target atoms if the beam energy is higher than the critical\nexcitation energy, Ec (also known as X-ray absorption edge energy), of the target atomic\nshell. The overvoltage, U, of the electron beam, expressed as:\nU = E/Ec\n(2.8)\nwhere, E is the beam energy, must be greater than unity for ionization to occur.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe energy of the beam electron is diminished by an amount equal to Ec and subsequent\nrelaxation of the target atom from its excited state involving the transfer of an outer shell\nelectron to the ionized inner shell, results in the generation of a characteristic X-ray. This\nX-ray may be emitted from the atom, or it may be internally absorbed while ejecting\nanother outer shell electron (an Auger electron). The fraction of X-rays emitted\n(characteristic X-ray yield or fluorescent yield, ω) for a specific shell increases with the\natomic number, whereas the Auger yield, α, decreases.\nCharacteristic X-rays are named as follows:\nKα: when vacancy in K-shell is filled by a transition from L-shell,\nKβ: when vacancy in K-shell is filled by a transition from M-shell,\nLα: when vacancy in L-shell is filled by a transition from M-shell,\nMα: when vacancy in M-shell is filled by a transition from N-shell, etc.\nThe cross-section of inner shell ionization is given by Bethe as follows:\nQ = 6.51x10-20[(nsbs)/(UEc\n2)]ln(csU)\n(2.9)\nionizations.cm2/e-.atom), where ns is the number of electrons in a shell or subshell (e.g.,\nns=2 for a K shell), bs and cs are constants for a particular shell, Ec (keV) is the critical\nexcitation energy of the shell, and U is the overvoltage. For the K-shell, the constants are\nbs=0.3 and cs=1 at U<4, and bs=0.9 and cs=0.65 at 4<U<25.\nEnergy lost by the beam electrons due to inelastic scatterings is given by Bethe as:\ndE/ds = -7.85x104 (Zρ/AEm)ln(1.166Em/J)\n(2.10)\nwhere, the constant is equal to 2πe4N0; e being the electronic charge and N0, the\nAvogadro's number; Z is the atomic number; A (g/mole), the atomic weight, ρ (g/cm3),\nthe density, Em (keV), the average energy along path segment s, and J, the mean\nionization potential given by Berger & Seltzer:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nJ (keV) = (9.76Z + 58.82 Z-0.19) x 10-3\n(2.11)\nThe electron stopping power of a material, S, is a function of its density and rate\nof energy loss of the beam electrons (Eqn. 2.10). It is defined by the following\nexpression:\nS = -(1/ρ)(dE/ds)\n(2.12)\nwhere, ρ is the density and dE/ds, the rate of electron energy loss with distance.\nThe cross-section of inner-shell ionization is maximum at overvoltage values\nbetween 3 and 5. Cross-sections of all types of inelastic scattering decrease with\nincreasing incident beam energy.\n2.2.3. X-ray production volume\nSince characteristic X-rays are produced only when the incident beam energy\nexceeds Ec, the X-ray range is always smaller than the electron range. The X-ray range\naccording to Anderson & Hassler is:\nR = K(E0\nn - Ec\nn)/ρ\n(2.13)\n(μm) where, K = 0.064, and n = 1.68. The range of primary X-ray generation is critical in\nestimating the sampling volume in X-ray microanalysis.\nThe distribution of X-ray generation sites within the interaction volume is given\nby the depth-distribution function, φ(ρz), which is a histogram showing the number of\nX-rays generated in layers of the specimen, each with a thickness of dz, relative to the\nnumber of X-rays the beam would produce in a freestanding layer of the same material of\nthickness dz.\ninf\nI generated = φ(Δρz)∫0 φ(ρz)d(ρz)\n(2.14)\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nwhere, φ(Δρz) is the intensity generated in a freestanding layer of thickness Δρz. The\nupper layers produce more X-rays than a freestanding layer because the incident electrons\ntravel randomly between layers by multiple scattering. With increasing depth, however,\nthe electrons lose their energy and finally, their ability to ionize inner-shells as the\ninstantaneous overvoltage drops below unity.\nValue of φ(ρz) at the surface, φ0; the maximum value of φ(ρz), φm; the depth at\nφm, Rm; and the maximum depth where φ(ρz) is zero, Rx are the parameters used to\ndescribe a φ(ρz) distribution. Both Rm and Rx decrease with atomic number (Z) and\nincrease with beam energy (E0). φ0 increases with E0.\n2.2.4. Bremsstrahlung or Continuum X-ray generation\nAs the beam electrons approach the target atoms, some of the electrons lose a part\nor all of their energy by deceleration in the Coulombic field created by the outer shell\nelectrons of the target atom. The energy lost by the beam electron is converted into\nbremsstrahlung or continuum X-rays with maximum energies up to the total initial energy\nof the beam electron. The maximum continuum X-ray energy, known as the Duane-Hunt\nlimit, provides a means for accurately measuring the energy of the electron beam.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n3. QUANTITATIVE X-RAY SPECTROMETRY\nThe primary generated characteristic X-ray intensities are roughly proportional to\nthe respective mass-fractions of the emitting elements.\nCi ∝Ii\n(3.1)\nwhere, Ci and Ii are the weight concentration and primary generated X-ray intensity of\nelement i. In quantitative analysis, the intensity is compared against the intensity of the\nsame element generated from a standard, I(i), with a known concentration C(i) of that\nelement. The ratio of the intensity from the sample and standard is known as the k-ratio.\nCi\nI\n∝\ni\n(3.2)\nC\nI\n(i)\n(i)\nwhere,\nIi = ki\n(3.3)\nI (i)\nBecause of interaction of the primary generated X-rays with the specimen atoms, the\nemitted X-rays have a different intensity from the generated intensity. This matrix effect\nis taken into account by modifying the above equation as:\nCi = ki ⋅[ZAF]\n(3.4)\nC\ni\n(i)\nwhere, [ZAF]i is the matrix correction factor for element i. However, the matrix\ncorrection depends on the composition of the specimen. Since the composition is\nunknown before the analysis, the ZAF factors are also unknown. Therefore, the\nconcentration Ci is determined through iteration. The measured k-ratios (ki) are used as a\nfirst estimate of the concentrations and the ZAF factors are calculated. The\nconcentrations (Ci) are then calculated by multiplying the k-ratios with the corresponding\nZAF factors calculated in the last step. A new set of ZAF factors are then calculated\nusing the Ci values obtained in the last step, and concentrations are recalculated by\nmultiplying the ZAF's with the original k-ratios. The process is repeated until the\ncalculated Ci does not change from the previous step. The following flow-chart\ndemonstrates the procedure:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n3.1. MATRIX CORRECTION\nThe atomic number correction, Z, the absorption correction, A, and the\nfluorescence correction, F are the three constituents of the matrix correction.\n3.1.1. Atomic number correction (Z)\nThe atomic number correction depends on the average atomic numbers of the\nspecimen and the standard. It is a function of the electron back-scattering factor (R) and\nthe electron stopping power (S, Eqn. 2.12). R is the ratio of number of X-rays actually\ngenerated to number of X-rays generated if there were no backscatter.\nThe atomic number correction Zi for element i is given by Duncumb & Reed\n(1968) as:\nE0 Q dE\nRi ∫ S\nc\nZi =\nE\n(3.5)\nE0 Q\n*\nR\ndE\ni ∫\n*\nS\nEc\nwhere, Q is the ionization cross-section (Eqn. 2.9), and R and S marked by * are for the\nspecimen (unmarked R and S are for the standard). The back-scattering factor, Ri, varies\nboth with the atomic number and the overvoltage (U). As the overvoltage decreases\ntoward unity, fewer electrons with energies greater than Ec are back-scattered and hence,\nmore electrons are available to cause ionization. Ri is expressed as:\nRi = Σj CjRij\n(3.6)\nwhere, j represents the elements present in the standard or the specimen. Yakowitz et al.\n(1973) express Rij as:\nRij = R'1 - R'2ln(R'3Zj+25)\n(3.7)\nwhere,\nR'1 = 8.73x10-3 U3 - 0.1669 U2 + 0.9662 U + 0.4523\n(3.8)\nR'2 = 2.703x10-3 U3 - 5.182x10-2 U2 + 0.302 U - 0.1836\n(3.9)\nR'3 = (0.887 U3 - 3.44 U2 + 9.33 U - 6.43)/U3\n(3.10)\nThe stopping power, Si, is expressed as:\nSi = Σj CjSij\n(3.11)\nwhere, j represents the elements present in the standard or the specimen. Thomas (1964)\napproximates the mean energy Em (Eqn. 2.10) as (E0+Ec)/2. Sij then becomes:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nSij = (const) [(2Zj/Aj )/(E0+Ec)]ln[583(E0+Ec)/Jj ]\n(3.12)\nQ is assumed to be constant and cancels out in the expression for Zi. The\nconstant in Eqn. 3.12 also cancels out. Further, avoiding the integration in Eqn. 3.5, Zi\ncan be approximately expressed as:\nZi = (RiSi*)/(Ri*Si)\n(3.13)\nTo demonstrate the effect of the atomic number difference between the specimen\nand the standard, the atomic number correction is calculated with the above equations for\na complete range of Cu-Al alloys with respect to metal standards (ZAl=13, ZCu=29) and a\nθ-phase (CuAl2; average atomic number, Z=21.6) standard. There is a large atomic\nnumber difference for Cu between the specimen and the Cu standard in the\nCu10wt%Al90wt% alloy (CCu=0.1; Z=14.6). Hence, the atomic number correction for CuKα\nis also large (ZCuKα =1.149 at E0=15 keV). The atomic number difference is small for Al\nin the same alloy. So, the correction for AlKα (ZAlKα =0.989 at E0=15 keV) is also small.\nWhen the θ-phase is used as a standard for the same alloy, the atomic number difference\nfor Cu decreases, whereas, it increases for Al. As a result, ZCuKα decreases to 1.045 (a\ndecrease of ~60%) and ZAlKα increases to 1.038 under the same beam energy condition.\nAn important conclusion from these graphs is that it is preferable to choose a standard\nwith a composition similar to the specimen so that the magnitude of Z is small.\nThe crossover at ~17 keV of the ZAlKα values in the one of the graphs may be an\nartifact of the complex polynomial fit of the Duncumb & Reed data by Yakowitz et al..\nYakowitz's equations probably fail to work above a certain value of U, UAl=9.62\n(corresponding to E0=15 keV) in this case. The relation between Zi and U is complex,\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nalthough in general, Zi decreases very slowly with an increase in U. The uncertainty in Zi\ndoes not change much as U increases. Since, as we will see later, high U values require\nlarge absorption corrections, a low U is preferable.\n3.1.2. Absorption correction (A)\nNot all the primary generated X-rays are emitted from the specimen. Some of the\nX-rays generated at depth are absorbed in the specimen by interacting with other\nspecimen atoms, which may become ionized as a result. The emitted intensity of element\ni is given as:\n(μ\ni energy\n) -\nIi(emitted) = Ii(generated)exp -\nρ specimen (ρx)\n(3.14)\nwhere,\nx = z cosecψ\n(3.15)\nis the distance traveled by the X-ray inside the sample along an angle ψ (angle measured\nfrom the sample surface, also known as the take-off angle), z is the depth and the electron\nμ\ni energy\n) -\nbeam is perpendicular to the surface of the sample. ( ρ specimen is known as the mass\nabsorption coefficient (cm2/g) of the specimen for the particular X-ray energy of element\ni.\nμ\nenergy\nThe ( )\nof the specimen decreases with increasing incident X-ray energy,\nspecimen\nρ\nuntil the incident energy is slightly higher than an absorption edge (or critical excitation\nμ\nenergy\nenergy) of an element present in the specimen, where ( )\njumps to a high value.\nspecimen\nρ\nThis means that absorption is maximum when the energy of the X-ray is slightly above\nthe critical excitation energy of the target atomic shell concerned. In the following\nexample, ZnKα is absorbed by Ni because the energy of ZnKα (8.632 keV) is slightly\nhigher than the critical excitation energy of the K-shell of Ni (Ec = 8.331 keV).\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nμ\nenergy\nEnergy\nEc(K-shell)\n( ρ)Ni\n(keV)\n(keV)\n(cm2/g)\nCoKα 6.925\nNiKα 7.472\n8.331\nCuKα 8.041\nZnKα 8.632\nThe total X-ray intensity emitted from an infinitesimal layer d(ρz) at a depth z can be\nexpressed in terms of the depth-distribution function φ(ρz) as:\nμ\ni energy\n) -\nspecimen (ρz cosec ψ)d(ρz)\n(3.16)\ndI'i = φi(ρz)exp -( ρ\nwhere, φi(ρz)d(ρz) is the intensity of x-ray generated in the layer d(ρz). The total emitted\nintensity thus becomes,\ninf\n-χi ρzd\nIi(emitted ) = φi (Δρz) ∫φi (ρz)exp\n(ρz)\n(3.17)\nwhere,\nμ\ni energy\n) -\nχi = ( ρ specimen cosec ψ\n(3.18)\nThe absorption function, f(χi), defined as the emitted fraction of the generated intensity,\nIi(emitted)/Ii(generated), is given by,\n-χ ρz\n∫infφ (ρz)exp\ni\nd(ρz)\nf (χi ) = 0\ni\n(3.19)\ninf\n∫φ (ρz)d(ρz)\ni\nThe absorption correction Ai for an element i in a compound is given by:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nf (χi )\nAi =\n(3.20)\nf (χi )*\nwhere, the specimen is noted by *. Philibert (1963) modeled the absorption function f(χi)\nsemi-empirically as:\n-1\n⎡⎛\n⎞⎛\n⎞⎤\nχi\nχi\nhi\nf (χi ) = ⎢⎜1+\n⎟⎟⎜1+\n⎟⎥\n(3.21)\n⎜\n⎜\n⎟\nσ\nσ 1+ h\n⎣⎝\ni ⎠⎝\ni\ni ⎠⎦\nwhere,\nhi = 1.2Ai/Zi\n(3.22)\nand\n1.65\n1.65)\nσi = 4.5x105 / (E0\n-Ei(c)\n(3.23)\nσ, which takes into account the accelerating voltage and the critical excitation energy, is\nknown as the Lenard coefficient and its formulation is given by Duncumb & Shields\nμ\ni energy\n) -\nspecimen are\n(1966) and Heinrich (1969). For compounds, the value of h, and ( ρ\nevaluated as follows:\nh\nh C\n(3.24)\ni = ∑ j\nj\nj\n(μ\ni-energy\nμ\ni-energy\n)specimen = Σ( )element 'j' C j\n(3.25)\nρ\nρ\nj\nPhilibert obtained his equation by empirically fitting φ(ρz) function of elements\navailable at that time, but simplified the fit by setting φ0=0 (the value of φ(ρz) at the\nsurface). However, φ0 is always >1 due to scattering of back-scattered electrons within\nthe sample. Hence, in cases where most of the X-rays are generated near the surface (e.g.,\nlight element (C,N,O) X-rays in a metal matrix (Ti,Fe,Cu)), the Philibert equation\nproduces erroneous results.\nThe absorption correction is a function of the mass absorption coefficients, the\ntake-off angle and the accelerating voltage. To understand the effect of these three\nparameters on the absorption correction, the Mg-Al binary alloy is considered. AlKα\nμ\nAlKα\n(EK=1.487 keV) is highly absorbed in Mg (Ec(K-shell)=1.303 keV) with ( ρ)Mg = 4168\ncm2/g. The following plots show calculated absorption corrections for AlKα (using Ec\nfrom Bearden, 1964 and (μ/ρ) from Heinrich, 1986) for different compositions of the\nMg-Al alloy under different E0 and ψ conditions. Three conclusions emerge from these\nplots: the absorption correction, AAlKα, increases with increasing operating voltage,\ndecreasing take-off angle and increasing Mg in the specimen. Shorter distances traveled\nby a primary X-ray within the sample lessens its absorption. Therfore, higher take-off\nangles and lower operating voltages lead to a lower absorption correction. Also, more Mg\nin the sample leads to a more efficient absorption of the AlKα. Most electron\nmicroprobes have fixed take-off angles. Hence, a low overvoltage should be used to\nminimize the absorption correction.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe error in the mass absorption coefficient propagates into the final result. The\neffect of uncertainties in mass absorption coefficients is low when the value of the\nabsorption function f(χ) is greater than 0.7.\n3.1.3. Characteristic fluorescence correction (F)\nX-ray fluorescence occurs as a consequence of photoelectric absorption of\nprimary X-rays as the target atom relaxes from an excited state. These secondary X-rays\nmay be generated both by characteristic or continuum x-rays. Since X-rays can travel\nlonger distances than electrons in matter, the range of fluoresced X-rays is also greater\n(~10 times) than the primary electron interaction range. The secondary X-ray interaction\nvolume may be as much as 1000 times greater than the primary interaction volume.\nElement\nEKα\nEKβ\nEc(K-shell)\n(μ\nNiKα\nabsorber\n)\nρ\n(Atomic No.)\n(keV)\n(keV)\n(keV)\n(cm2/g)\nMn(25)\n5.895\n6.492\n6.537\nFe(26)\n6.4\n7.059\n7.111\nCo(27)\n6.925\n7.649\n7.709\nNi(28)\n7.472\n8.265\n8.331\nCu(29)\n8.041\n8.907\n8.98\n65.5\nThe data in the above table indicates that NiKα, with an energy of 7.472 keV, will be\nefficiently absorbed in Fe and Mn, whose K-shell critical excitation energies are 7.111\nkeV and 6.537 keV, respectively. As a result, both Fe and Mn (Kα and Kβ) will be\nfluoresced by NiKα. The table also shows that NiKα and Kβ can only be fluoresced by\nCuKβ because only CuKβ has an energy (8.907 keV) greater than the Ni K-shell\nabsorption edge (8.331 keV). CuKβ will be absorbed in the process. The following table\nshows which X-rays will cause fluorescence in the different elements:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nElement\nRadiation causing fluorescence\nMn\nFeKβ, CoKα, CoKβ, NiKα, NiKβ, CuKα, CuKβ\nFe\nCoKβ, NiKα, NiKβ, CuKα, CuKβ\nCo\nNiKβ, CuKα, CuKβ\nNi\nCuKβ\nCu\nnone\nThe fluorescence correction for element i in a compound of j elements is as\nfollows:\n(3.26)\nwhere, I f\nij is the intensity of element i fluoresced by element j, and Ii is the primary X-ray\nintensity produced by the electron beam. For an elemental standard, the numerator\nreduces to unity. I f\nij/Ii is given by Castaing (1951) and modified by Reed (1965) as:\nI f\nij /Ii = CjY0Y1Y2Y3Pij\n(3.27)\nwhere,\nY0 = 0.5[(ri-1)/ri][ωjAi/Aj]\n(3.28)\nwhere, ri is the absorption edge jump-ratio; (ri-1)/ri is 0.88 for K-line, 0.75 for L-line; and\nωj is the fluorescent yield,\nY1 = [(Uj-1)/(Ui-1)]1.67\n(3.29)\nY2 = (μ/ρ)j\ni/(μ/ρ)j\nspec\n(3.30)\nwhere, (μ/ρ)j\ni is the mass absorption coefficient of element i for X-rays from element j;\nand (μ/ρ)j\nspec is the mass absorption coefficient of the specimen for X-rays from element\nj,\nY3 = [ln(1+u)]/u + [ln(1+v)]/v\n(3.31)\nwhere,\nu = [(μ/ρ)i\nspec/(μ/ρ)j\nspec] cosec ψ\n(3.32)\nand\n1.65\n1.65)(μ/ρ)j\nv = 3.3x105/[(E0\n-Ec\nspec]\n(3.33)\nand, Pij is a factor for the type of fluorescence occurring. For K X-ray fluorescing another\nK X-ray, Pij=1; for K fluorescing L, Pij=4.76; for L fluorescing K, Pij=0.24).\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe fluorescence correction thus depends on absorption edge jump-ratio (r), the\nfluorescent yield (ω) of the fluorescer X-ray, mass absorption coefficients, the take-off\nangle and the operating voltage. To understand the effect of ψ and E0 on the fluorescence\ncorrection, the Mg-Al binary alloy is again considered. Since AlKα (EK=1.487 keV) is\nAlKα>EMg\nhighly absorbed in Mg (Ec(K-shell)=1.303 keV) and EK\nc(K-shell), MgKα will be\nfluoresced. Using the above equations, ω from Bambynek et al. (1972), (μ/ρ) from\nHeinrich (1986) and Ec from Bearden (1964), FMgKα in a range of Mg-Al compositions is\ncalculated under different ψ and E0 conditions. The plots show that FMgKα increases with\nincreasing E0 and Al-content of the specimen. Changing ψ does not have a significant\neffect on the correction. A high ψ is preferred because it minimizes the absorption\ncorrection. Also, the error in the fluorescence correction is low at low ψ and does not\nincrease at high ψ . Therefore, a low E0 and high ψ angle is recommended.\n3.1.4. Continuum fluorescence correction\nEnergy of continuum X-rays range between 0 keV and E0. When the energy of the\ncontinuum X-rays is greater than the critical excitation energy of an atomic shell of an\nelement in the specimen, the element is fluoresced. Thus, continuum X-rays with\nenergies between Ec and E0 cause fluorescence and the fluorescence effect of all energies\nbetween Ec and E0 must be considered in continuum fluorescence correction. Myklebust\net al. (1979) concluded that continuum induced fluorescence may be ignored if f(χ) <\n0.95, Ci > 0.5 and Zstd (atomic number) is similar to Zspec. By choosing a low overvoltage\nand a high take-off angle continuum fluorescence correction can be avoided except while\nanalyzing a heavy component in a light matrix (e.g., U in a common silicate mineral)\nwhen f(χ) > 0.95. In such a case, a low energy characteristic X-ray of the element should\nbe analyzed (e.g., UMα).\n3.1.5. The φ(ρz) correction procedure\nThe φ(ρz) correction procedure uses experimentally measured depth-distribution\nof X-rays to model the atomic number and the absorption corrections with a single\nexpression. The equations for generated and emitted X-ray intensities (Eqn. 2.14 and\n3.14) are combined:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n-χ ρz\n∫infφ (ρz)exp\ni\nd(ρz)\nZi Ai = 0\ni\n(3.34)\ninf\ni\n-χ ρz\n∫φ *(ρz)exp\nd(ρz)\ni\nand modeled empirically in terms of α, β, γ and φ0 (Packwood and Brown, 1981), or\nsemi-empirically in terms of φ0, Rm, Rx and the integral of the φ(ρz) distribution (Pouchou\nand Pichoir, 1984). The fluorescence correction is calculated separately with the\nCastaing-Reed method (Eqn. 3.26) and combined with Eqn. 3.34 to obtain the full ZAF\ncorrection.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n4. DETECTORS IN THE ELECTRON MICROPROBE\nThe electron microprobe can be used to obtain high resolution scanned images of\nthe surface of a specimen by rastering the electron beam over an area of the surface. The\nsignal is plotted on the display monitor as the beam scans thus forming a scanning image.\nDepending on the signal used, an image can be a scanning electron image, an elemental\nX-ray map or a cathodoluminescence (CL) image. Scanning electron images utilize\nsecondary electrons (SE) or back-scattered electrons (BE). X-ray compositional maps\nutilize the characteristic X-rays of elements that may be obtained either through the\nwavelength dispersive spectrometers (WDS) or the energy dispersive spectrometer\n(EDS). A CL image uses the light signal generated in response to the electron beam.\n4.1. ELECTRON DETECTORS\nBack-scattered electrons have energies between 0 keV and E0. In contrast,\nsecondary electrons have energies in the range 0-50 eV, mostly between 3 and 5 eV.\nTherefore, different methods are required for the detection of the two types of electron\nsignal.\n4.1.1. Everhart-Thornley (E-T) detector for topographic contrast\nThe E-T detector consists of a scintillator maintained at a large positive potential\nof 10 to 12 kV to attract the incoming electrons. The electrons interact with the\nscintillator and produce light that travels through a light guide, a solid plastic or glass rod,\nto a photomultiplier. Light produces electric current in the photomultiplier and the current\nis amplified by an amplifier.\nThe scintillator is enclosed in a Faraday cage which can be biased to a negative or\npositive potential (-50 to +250 V). When the E-T detector is negatively biased, only the\nhigh energy back-scattered electrons are able to enter the detector, whereas, a positively\nbiased E-T detector intercepts both back-scattered and secondary electrons.\nThe E-T detector is mounted on one side of the sample chamber receiving a\nhighly directional view of the specimen. As a result, when imaging a fractured surface,\nthe faces directly in the line-of-sight of the detector appear brighter than the other faces.\nA negatively biased detector rejects the secondary electrons and the faces not in line-of\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nsight of the detector appear dark producing a shadowing effect. This harsh contrast is\nreduced when the detector is positively biased because secondary electrons produced on\nthe faces not in line-of-sight are also pulled into the detector. The E-T detector is thus a\nuseful tool for topographic imaging.\n4.1.2. Solid-state diode detector for compositional and topographic contrast\nThe solid-state diode detector is a semiconductor that tracks changes in voltage in\nan electrical circuit as a result of electron-hole production in the detector from\ninteractions with back-scattered electrons. It is a flat, annular wafer mounted on the pole-\npiece of the objective lens directly above the specimen. Low energy electrons such as\nsecondary electrons fail to produce electron-hole pairs in the diode and are not detected.\nThe annular detector is split two semi-circles, A and B. When signals from both\nparts are added (A+B mode), good compositional contrast results. The A-B mode is\nanalogous to a stereoscopic view and produces topographic contrast.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n4.2. CATHODOLUMINESCENCE DETECTOR\nWhen semiconductors interact with energetic electrons, they produce long-\nwavelength ultraviolet, visible and infrared radiations known as cathodoluminescence\n(CL). Cathodoluminescent materials have a filled valence band and empty conduction\nband separated by an energy gap, Egap, of forbidden energy states. When an energetic\nbeam electron scatters inelastically, an electron from the valence band may move to the\nconduction band leaving a hole in the valence band. When the electron and the hole\nrecombine, energy equal to Egap is released as a photon. This energy, Egap, can be used to\nidentify the specimen by CL spectrometry. Presence of impurity, however, creates\nadditional energy states in the energy gap and changes the wavelength and the intensity\nof the light. The light signal can thus be used to identify the impurity and obtain a CL\nimage to study the spatial distribution of the impurity.\nCL can also be excited by X-rays generated in the sample. Hence, the volume of\nCL excitation can be larger than the primary electron interaction volume resulting in\npoorer image spatial resolutions compared to scanning electron images. Thin films\nusually produce CL images with a better resolution than bulk samples.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nA CL spectrometer is attached to the optical microscope port of the electron\nmicroprobe. When studying CL, the optical microscope light source is turned off so that\nthe only light coming through the ocular is the light generated by the sample.\n4.3. X-RAY DETECTORS\nAn electron microprobe is usually equipped with an energy dispersive\nspectrometer (EDS) and several wavelength dispersive spectrometers (WDS) for X-ray\nspectrometry. An X-ray detector is a part of the EDS or WDS.\n4.3.1. Energy Dispersive Spectrometer (EDS)\nAn energy dispersive spectrometer (EDS) takes advantage of the phenomenon of\nelectron-hole production by energetic X-rays in a semiconducting lithium-drifted silicon\n(Si(Li)) or germanium detector. Electric current produced in the detector is proportional\nto the incident X-ray energy. A multichannel analyzer (MCA) is used to analyze the\nelectrical pulses and construct an X-ray spectrum for the entire energy range (0 keV to\nE0) in the form an energy histogram. Elements down to Be (Z=4) may be detected with a\nvery thin window or a window-less detector.\nPure Si is a semiconductor and a good material for a detector. However, Si\nusually contains some B as impurity that creates holes in the valence band of Si. This\nelectron deficiency makes Si a conductor. Since B is a p-type dopant, an n-type dopant\nsuch as Li is added to Si to compensate the electron deficiency created by B. Li is applied\non the surface of Si and allowed to diffuse into the crystal. This forms a micrometer-thick\np-n zone at the Si-Li interface that acts as an intrinsic semiconductor. Most of the Li is\nremoved from the surface to expose the p-n zone. A reverse bias is applied under liquid\nnitrogen temperature to the p-n zone, which enlarges the intrinsic zone to a thickness of a\nfew millimeters. Li is mobile under an applied bias at room temperature. Hence, a Si(Li)\ndetector should always be operated at liquid-nitrogen temperatures to prevent damage.\n4.3.2. Wavelength Dispersive Spectrometer (WDS)\nA WDS system consists of two components: an analyzing crystal and an X-ray\ndetector known as the proportional counter. WDS takes advantage of the Bragg\ndiffracting characteristics of an analyzing crystal to preferentially diffract the wavelength\nof interest toward the detector. Bragg's law is defined as:\nnλ = 2d sin θ\n(4.1)\nwhere, λ is the wavelength of the X-ray, d is the lattice spacing of the crystal, θ is the\nangle of incidence and diffraction and n is the order of reflection. X-rays are reinforced\nafter diffraction when the path lengths between two rays differ by an integral (n) of the\nwavelength. Combined reflections from a large number of lattice planes result in a\nnarrow intensity distribution around a peak. For example, the measured full-width half-\nmaximum (FWHM) energy interval of MnKα is about 10 eV compared to the natural\nvalue of 2 eV.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nIn WDS, the X-ray source (point of the sample from the X-rays are emitted), the\nanalyzing crystal and the detector are positioned on the circumference of a focusing circle\nknown as the Rowland circle. In a Johansson type fully focusing spectrometer, the crystal\nis curved to a radius of curvature of 2R and then ground to R, so that its lattice planes and\nthe focusing circle have the same curvature. The diffracted X-rays are thus fully focused\ninto the detector. In practice, crystals are not ground because it degrades the resolution of\nthe crystal. This compromise, known as Johann optics, does not seriously impair the\nspectrometer resolution. From the geometrical configuration of the instrument, λ is\nrelated to L, the distance between the sample and the analyzing crystal by the following\nrelation:\nL = nλ.R/d\n(4.2)\n(mm), where, R is the radius of the focusing circle (140 mm or 100 mm on JEOL).\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nTo detect different X-ray wavelengths, the crystal is moved in a straight line\ntoward or away from the sample at an angle, ψ (take-off angle), the angle between the\nspecimen-surface and the X-ray travel direction. The take-off angle is fixed by the design\nof the instrument. As the crystal moves, it also rotates so that the X-ray incidence angle,\nθ, changes. As a result, different wavelengths are diffracted. The detector moves\nsimultaneously so that it remains in path of the diffracted X-rays. The focusing circle\nchanges position, but its size remains the same.\n4.3.2.1. Diffracting crystal in WDS\nBecause of the characteristics of WDS, X-rays emitted from only a small elliptical\nvolume of the sample reaches the detector. The shape of this X-ray focus volume depends\non the shape of the analyzing crystal and is usually an extremely elongated ellipsoid. The\nmajor axis of the focusing ellipsoid is proportional to the width of the diffracting crystal\nand has a length of several millimeters.\nIn electron microprobes, WD spectrometers are usually mounted vertically so that\nthe focusing circle is vertical. In this configuration, the major axis of the focusing\nellipsoid is horizontal and in the plane of the specimen-surface. A small movement of the\nspecimen in the vertical direction may move the surface outside the focusing ellipsoid\nand the emitted X-rays will fail to reach the detector. Therefore, the surface is always\nfocused with an optical microscope coaxial with the electron beam during an analytical\nsession. The optical microscope has a shallow focus and the surface can be focused\naccurately. During routine maintenance, the spectrometer is slowly moved up or down\nwhile the surface is in optical focus until the X-ray counts are maximized, ensuring that\nthe major axis of the focusing ellipsoid is on the specimen-surface. At the start of an\nanalytical session, the surface is focused both with the optical microscope and the\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nobjective lens-controls of electron beam. This ensures that the specimen-surface is in X-\nrays focus when it is in optical focus.\nThe primary X-ray production volume is much smaller than the volume of the\nfocusing ellipsoid. Since X-ray fluorescence may occur from a much larger volume than\nthe primary X-ray volume, a vertical spectrometer will intercept a significant amount of\nthe fluoresced X-rays. This is a minor problem in a horizontal or inclined spectrometer.\nHowever, such configurations require low X-ray take-off angles to maximize the X-ray\nsignal in the detector (e.g., in the horizontal configuration, the Rowland circle is also\nhorizontal). Because of absorption and fluorescence correction issues, low take-off angles\nare not recommended.\nAnalyzing crystals available on the JEOL JXA Superprobes at MIT and elements\ncommonly analyzed with them are as follows:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n4.3.2.2. X-ray detector in WDS: proportional counter\nThe commonly used detector in WDS is known as a proportional counter and\nconsists of a gas filled tube with a thin tungsten wire along the tube-axis maintained at a\npotential of 1-3 kV. In a flow counter, gas flows through the tube. Sealed counters are\nalso used. X-rays enter the tube through a thin window and ionize the gas atoms. The\nelectron ejected from the gas atom may ionize other gas atoms. The tungsten wire\ncollects the charge and creates a voltage pulse that is amplified and counted by the\nelectronics.\nBecause one ionization in the gas can set off a chain of ionizations, the signal is\namplified internally resulting in count rates of 0-50,000 counts per second. The gas\namplification factor, a measure of the internal amplification, varies proportionally to the\napplied bias in the tungsten wire with a range of voltage known as the proportional\ncounter region.\nThe type of gas used in the counter depends on the wavelength of the X-ray to be\ndetected. The efficiency of detection, known as the quantum efficiency, of Xe is greater\nthan that of Ar for short wavelength X-rays. Since the LIF and PET crystals are\nappropriate for short wavelength detection, these crystals are combined with sealed Xe-\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\ncounters in WD spectrometers. The thin window on a sealed Xe-counter is made of Be.\nAr, diluted with 10% methane (P-10 gas), has a better quantum efficiency for long\nwavelength X-rays. Hence, flow-proportional counters with P-10 is combined with TAP\nor LDE for light element detection. The window material on a flow Ar-counter is usually\nan organic compound such as Formvar or cellulose nitrate. The efficiency of an Ar\ncounter may be improved by increasing the gas pressure to 2-3 atmospheres.\n4.3.2.3. Signal processing in WDS: pulse height analysis (PHA)\nThe signal generated in the proportional counter passes through a preamplifier to\nproduce a small negative voltage pulse. In turn, this pulse passes through the main\namplifier that inverts, amplifies and shapes the pulse such that its voltage has Gaussian\ndistribution. If the gas amplification factor, the preamplifier and amplifier gains and the\ncapacitance of the preamplifier are constant, the voltage of the amplifier output pulse is\ndirectly proportional to the energy of the X-ray that entered the proportional counter.\nOutput pulses from the amplifier now enter the single channel analyzer (SCA).\nAn SCA selects pulses within a preset voltage range and produces fixed rectangular\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\npulses of a fixed voltage and duration compatible with scalar and rate-meter input\nrequirements or the digital counting system. Selection of pulses within a predetermined\nvoltage range is known as pulse-height analysis (PHA). A baseline, EL, and a window\nvoltage, ΔE, are set such that any voltage pulse outside this voltage range is rejected by\nthe SCA. In the example shown in the figure, only pulses between 5 and 7 eV (pulse II)\nare accepted. The PHA settings may depend on the count rate.\nTo determine EL and ΔE an SCA scan is employed. The pulse-voltage distribution\nis obtained by selecting a small window voltage (ΔE of a few tenths of a volt) and slowly\nmoving the baseline over the whole SCA voltage range (0-10 V). A typical SCA scan\nshows noise near 0 V, an escape peak depending on the detector gas and the actual\nenergy peak. The escape peak corresponds to an energy equal to the actual energy minus\nthe characteristic energy of the detector gas (e.g., 2.96 keV for ArKα). Escape peaks are\nproduced when energy of characteristic X-rays generated in the detector gas (e.g. ArKα)\nby the X-rays entering the counter leaves the counter. The energy of the X-ray being\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nmeasured is diminished by an amount equal to the critical excitation energy for inner-\nshell ionization of the detector-gas.\nPHA is normally used to eliminate the low energy noise. In addition, PHA can\nalso be used to eliminate X-ray energies of interfering elements. This is especially useful\nwhen the analyzing crystal is positioned for background measurements. Higher order\n(n>1) X-rays of transition metals can be efficiently eliminated by optimizing the PHA\nsettings during light element analysis.\nThe percentage resolution of a proportional counter is the energy width of a peak\nat FWHM (full-width at half-maximum) divided by the mean peak energy multiplied by\n100. A properly functioning counter has Gaussian distribution of pulses and a resolution\nof between 15 and 20%.\nA finite time elapses during which an X-ray pulse processes by the detector\nsystem. During this time interval, known as the dead-time, the detector is unavailable to\nprocess subsequent pulses. The dead-time corrected count rate is given by N'/(1-τN'),\nwhere N' is the measured count rate, and τ is the dead time. One method of determining τ\nconsists of plotting N' versus the beam current. The beam current is proportional to the\ncount rate. A deviation from a straight line on the plot is due to the dead-time, which can\nbe modeled with a polynomial expression.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n5. COMPOSITIONAL IMAGING BY WDS\nThe output from the proportional counter of a WD spectrometer can be used to\nconstruct an X-ray image of the sample showing the spatial distribution of an element.\nElemental X-ray maps are acquired either by beam-rastering in which the electron beam\nrasters over the area to be imaged, or by stage-rastering in which the electron beam is\nstationary while the stage moves. A set of X-ray elemental maps can be used to estimate\nphase proportions and bulk chemical composition and studying textural relations in a\nmulti-phase composite sample.\nThe resolution of an X-ray map depends on the step-size of measurements as the\nbeam moves relative to the sample. Each point measurement corresponds to a pixel on\nthe image. The X-ray signal may be manipulated by setting an appropriate beam current\nand a dwell-time, the time the beam spends on each point for measurement. The quality\nof an X-ray map depends on the concentration of the element being mapped and the\ncontrast in the map depends on the difference in concentration of the element in the\ndifferent phases of the sample. The acquisition time of X-ray maps depends on the stage\nspeed. In addition to the hardware limitations (e.g., stage-motor capability), the stage\nspeed decreases for higher resolutions requiring more number of steps and as the dwell\ntime increases. A 30 mm x 15 mm area may typically be mapped overnight at a\nresolution of 20 μm/step and a dwell time of 30 msec/point.\nDigital compositional images may provide a complete quantitative analysis at\nevery pixel scanned if the pixel data are corrected for background, divided by standard\nintensities and corrected for matrix effects. By using several WD spectrometers, the\nmajor elements can be mapped simultaneously for matrix corrections. However, because\nof short dwell-times the chemical composition of each point will be relatively inaccurate.\nUsing long dwell-times may result in unacceptably long acquisition times.\n5.1. BACKGROUND CORRECTION IN WDS COMPOSITIONAL IMAGING\nX-ray maps not corrected for background may contain a continuum artifact.\nContinuum X-ray intensities generated by phases with different mean atomic numbers\nmay be different. Thus, a spurious image of an element may result even if that element is\nabsent in the sample.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe following example shows spectra of two phases present in the area of the\nsample being mapped. Cr counts are lower when the beam is on the first phase than when\nthe beam is on the second phase although Cr is not actually present in either phase. The\nsecond phase will appear brighter in the map leading to an incorrect interpretation that it\ncontains more Cr.\nThe spurious image may actually serve as a background map that can be used to\nsubtract the background intensity from the elemental maps. However, the background\nmap must be collected with the same spectrometer in a separate session. If many\nelements are present in the sample, more than one background map be required.\n5.2. DEFOCUSING IN BEAM-RASTERED WDS X-RAY MAPS\nIn beam-rastered X-ray mapping, the electron beam may move outside the X-ray\nfocusing ellipsoid of WDS. This will result in an X-ray intensity drop in the areas outside\nthe focusing ellipsoid. The map will show a band of high intensity corresponding to the\nlong axis of the focusing ellipsoid. This defocusing effect is greater at low magnifications\nbecause the beam rasters over a large area.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThere are four approaches to correct WDS defocusing (Newbury et al., 1990):\n- Stage scanning: Defocusing does not occur in stage-rastered maps because the beam\nis stationary and vertical during image acquisition.\n- Crystal rocking: The spectrometer crystal is rocked in synchronism with the beam\nscan to maintain X-ray focus, i.e., the beam is always incident on the center of the X-\nray focusing ellipsoid.\n- Standard mapping: The specimen and the standard are mapped under the same\nconditions so that defocusing is identical in both maps. When a k-ratio map is\ncalculated, the defocusing effects cancel out.\n- Peak modeling: A mathematical expression may be used to correct for the intensity\nloss in the image.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n6. QUANTITATIVE ANALYSIS WITH WDS\nQuantitative analysis with WDS involves careful sample preparation, qualitative\nidentification of elements with EDS, standard intensity measurement (calibration) and\nmeasurement of X-ray intensities in the specimen. K-ratios are calculated and the data are\nreduced through matrix corrections with the quantitative analysis software.\n6.1. SAMPLE PREPARATION\nFor qualitative analysis only, the sample may be mounted with double-stick\nconductive carbon tape on the sample holder. For precise WDS analysis, however,\ncareful sample preparation is essential.\nThe sample is cut and mounted in epoxy resin in the shape of 0.75\" or 1\" diameter\npellets. The sample mount is then polished first with coarse SiC-paper and then with fine\ndiamond paste or corundum (Al2O3) grit slurry. The final grit size should be at least 0.25\nμm and preferable 0.06 μm. For samples that dissolve in water, dry polishing with fine\npolishing paper is recommended. The polished sample is then washed with clean water in\nan ultrasonic cleaner to get rid of the polishing grit and other surface dirt. For water\nsoluble samples, this step is avoided. The sample is then dried in air and with blow-\nduster.\nElectrically insulating samples are carbon-coated to ensure conduction of the\nbeam electrons away from the sample. Conductive samples need not be coated.\nHowever, if they are mounted in a non-conductive material, carbon-coating is\nrecommended. Furthermore, the standards and the sample should be coated to the same\nthickness. Carbon coating is carried out by carbon evaporation under vacuum. A polished\nbrass block is used to monitor the thickness of carbon coat deposited on the specimens.\nAs the thickness of coat increases on the brass, it changes color from orange (150 A) to\nindigo red (200 A), blue (250 A) and bluish green (300 A). A thickness of about 225 A is\nrecommended for microprobe analysis at 15-20 kV accelerating voltage.\n6.2. QUALITATIVE ANALYSIS\nQuantitative analysis with WDS requires prior knowledge of which elements are\npresent and to be measured in the sample. Contrast in a back-scattered electron (BE)\nimage corresponds with the major compositional differences among phases in the sample.\nEDS provides a quick qualitative spectrum. Thus the combination of a BE image and\nEDS spectra provides a useful tool for quick qualitative analysis.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nThe EDS software includes a KLM marker database that can be used in peak\nidentification. EDS spectra, however, may fail to register trace elements and may contain\npeak overlaps. Depending on the window material, EDS detects elements only above a\ncertain atomic number. With a Be window, elements above atomic number 9 (F) are\ndetected. Wavelength scans with WDS over a small range of wavelength may be used to\nqualitatively identify F, O, N, C and B using a light element diffracting pseudo-crystal\n(e.g., LDE1 or LDEC). WDS scans may also be used to detect trace elements.\n6.3. CALIBRATION AND UNKNOWN ANALYSIS\nThe analytical conditions (e.g., accelerating voltage, beam current, etc.) are set in\nthe beginning and maintained throughout the session. Standard X-ray intensities of the\nelements to be measured are obtained on appropriately chosen standards. Different\nstandards may be used for different elements. Secondary standards may be analyzed to\ncheck if their known compositions are reproduced.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n6.3.1. Background and Peak Overlap Correction in WDS\nA typical X-ray spectrum acquired through EDS or WDS consists of\ncharacteristic X-ray peaks and a background comprised of continuum X-rays. X-ray\nspectrometry involves measurement of characteristic X-ray peak intensities corrected for\nbackground. The usual method to obtain background intensities is by interpolation. The\nspectrometer is set to measure count rates on two positions, one on each side of the peak,\nand the background under the peak is calculated by interpolating between the two\nmeasurements.\nThe peaks recorded in an X-ray spectrum are a convolution of the peak from the\ncharacteristic X-rays and the instrumental response. In EDS, the peaks are usually broad\ndue to a large instrumental effect. Because of good spectral resolution in WDS, the tall\nand narrow shape of the peaks are retained. Layered synthetic microstructures (e.g.,\nLDE1 or LDEC), however, yield broad peaks.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMeasured X-ray intensities must also be free of peak overlaps. Care must be taken\nto avoid interfering peaks of other elements both on the peak and the background\npositions. When a peak is broad, an overlap between adjacent peaks is possible. Even in\nthe case of partial overlaps, the tails of two adjacent peak may overlap. When broad\noverlapping peaks are present in the spectrum, background modeling using a polynomial\nfit may be more appropriate.\nIn case of unavoidable peak overlaps, the magnitude of an overlap can be\ncalculated by measuring the intensity of the overlapping peak on a standard that contains\nthe interfering element, but not the element of interest. For example, in the Ti-V-Cr\nsystem, there are two peak overlaps. The VKα and the CrKα peaks are overalapped by\nthe TiKβ and VKβ peaks, respectively. The intensity contributions from the TiKβ and\nVKβ peaks must be subtracted from the measured intensities of VKα and CrKα in order\nto obtain their true intensities. Following is a schematic representation of the X-ray\nspectrum of a Ti-V-Cr alloy showing the peak overlaps:\nThe intensities of the VKα and the CrKα may be corrected with to the following\nequations:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n(6.1)\n(6.2)\nwhere, I is intensity, \"corr\" is corrected, \"meas\" is measured and \"std\" is standard. To\ncorrect the intensity of VKα, IVKα\nTi-std is measured on pure Ti. Since pure Ti does not\nTi-std\nTi-std\ncontain V, the IVKα\nmeasured is because of the presence of TiKβ. IVKα\nis\nsubtracted from IVKα\nmeas measured in the sample after multiplying it with the k-ratio of\nmeas / ITiKα\nTiKα (=ITiKα\nTi-std) in the sample, which serves as a scaling factor. The correction\nfor CrKα is similar, except IVKα\ncorr is used in Eqn. 6.2 instead of IVKα\nmeas .\nThe transition metals Ti, V, Cr, Mn, Fe, Co and Ni, and the metals Zr, Nb and Mo\nemit X-rays at wavelengths similar to the characteristic wavelengths of the light elements\nsuch as F, O, N, C and B. The elements Zr, Nb and Mo also have absorption edges, which\ngreatly diminish the emitted intensities of the light elements. For example, the NKα (31.6\nA) is severely overlapped by TiL1 (31.4 A). It is thus extremely difficult to measure N in\nthe presence of Ti, specially if N is present in trace amounts. Correctly setting the PHA\nbaseline and window may filter out the higher order X-ray wavelengths. This is\ndemonstrated in the following wavelength scans, in which the higher order lines of Fe\nand Ni are efficiently subdued and the background lowered with optimal PHA settings\nfor carbon Kα:\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n7. REFERENCES\nAnderson, C.A. and Hasler, M.F. (1966) In Proc. 4th Intl. Conf. On X-ray Optics and\nMicroanalysis (R. Castaing, P. Deschamps and J. Philibert, eds.) Hermann: Paris, p.\n310.\nBambynek, W., Crasemann, B., Fink, R.W., Freund, H.U., Mark, H., Swift, S.D., Price,\nR.E. and Rao, P.V. (1972) Rev. Mod. Phys., 44, 716.\nBearden, J.A. (1964) \"X-ray Wavelengths\", Report NYO 10586, U.S. Atomic Energy\nCommission, Oak Ridge, Tennessee.\nBence, A.E. and Albee, A. (1968) J. Geol., 76, 382.\nBerger, M.J. and Seltzer, S.M. (1964) Nat. Acad. Sci./Nat. Res. Council Publ. 1133,\nWashington, 205.\nBethe, H. (1933) In Handbook of Physics. Springer: Berlin, 24, 273.\nCastaing, R. (1951) Ph.D. Thesis, University of Paris.\nDuncumb, P. and Reed, S.J.B. (1968) In Quantitative Electron Probe Microanalysis\n(K.F.J. Heinrich, ed.), Nat. Bureau Stand. Spl. Publ. 298, 133.\nDuncumb, P. and Shields, P.K. (1966) In The Electron Microprobe (T.D. McKinley,\nK.F.J. Heinrich and D.B. Wittry, eds.), Wiley: New York, p. 284.\nHeinrich, K.F.J. (1969) National Bureau of Standards, Technical Note 521.\nHeinrich, K.F.J. (1986) In Proc. 11th Intl. Conf. on X-ray Optics and Microanalysis\n(J.D. Brown and R.H. Packwood, eds.), Univ. Western Ontario, London, Ont. Canada,\np. 67.\nKanaya, K. and Okayama, S. (1972) J. Phys. D.: Appl. Phys., 5, 43.\nMyklebust, R.L., Fiori, C.E. and Heinrich, K.F.J. (1979) Nat. Bureau Stand. Tech. Note\n1106.\nNewbury, D.E., Fiori, C.E., Marinenko, R.B., Myklebust, R.L., Swyt, C.R. and Bright,\nD.S. (1990) Anal. Chem., 62, 1159A and 1245A.\nPackwood, R.H. and Brown, J.D. (1981) X-ray Spectrom., 10, 138.\nPhilibert, J. (1963) In Proc. 34th Intl. Symp. X-ray Optics and X-ray Microanalysis,\nStanford University (H.H. Pattee, V.E. Cosslett and A. Engstrom, eds.) Academic\nPress: New York, p. 379.\nPouchou, J.L. and Pichoir, F. (1984) Rech. Aerosp., 3, 13.\nReed, S.J.B. (1965) Br. J. Appl. Phys., 16, 913.\nShimizu, R., Kataoka, Y., Ikuta, T., Koshikawa, T. and Hashimoto, H. (1976) J. Phys. D.:\nAppl. Phys., 9, 101.\nThomas, P.M. (1964) U.K. Atomic Energy Auth. Rept. AERE-R 4593.\nYakowitz, H., Myklebust, R.L. and Heinrich, K.F.J. (1973) Nat. Bureau Stand. Tech.\nNote 796.\n7.1 SOURCES AND RECOMMENDED READING\n1) Goldstein, J.I., Newbury, D.E., Joy, D.C., Lyman, C.E., Echlin, P., Lifshin, E.,\nSawyer, L. and Michael, J.R. (2003) Scanning Electron Microscopy and X-ray\nMicroanalysis (Third Edition). Kluwer Academic/Plenum Publishers: New York.\n3) JEOL technical manuals.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\n7.2 ACKNOWLEDGEMENTS\nThe second edition of the text book by Goldstein et al. (item 1 in above list) was\nextensively used in preparing these notes. Some of the figures are from this book, but\nhave been altered to suit the needs of this course. A few of the figures are modified from\nfigures in the JEOL technical manuals.\nN. Chatterjee: January 2012, MIT, Cambridge, MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_141IAP12_slides_day1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/05c8da30b00f7a0612fbdffa2167c1f5_MIT12_141IAP12_slides_day1.pdf",
      "content": "Massachusetts Institute of Technology\n12.141\nElectron Microprobe Analysis\nNilanjan Chatterjee, Ph.D.\nPrincipal Research Scientist\nElectron Microprobe Facility\nDepartment of Earth, Atmospheric and Planetary Sciences\n\nElectron Microprobe\nor\nElectron Probe Microanalyzer (EPMA)\nSurface characterization of solids at the micrometer-scale:\n- Surface topography and compositional imaging\nComplete chemical analysis of microscopic volumes\n(Electron beam induced X-ray emission spectrometry)\n\nElectron\nbeam\nSignals produced in the\nElectron Microprobe\nCathodoluminescence (CL)\nBack-scattered electron (BSE)\nCharacteristic X-ray\nSecondary\nelectron (SE)\nSpecimen\n\nQualitative analysis\nVisual characterization and identification of\nphases in image (shape, size, surface relief,\netc.)\nconcentration measurement)\nIdentification of elements in each phase (no\n\nSpatial distribution of elements in an image\nSemi-quantitative analysis\nmeasurement without calibration\nQuick and approximate spot concentration\n\nQuantitative analysis\nFull quantitative micro-chemical analysis\nConcentration of all elements present at the spot\n- Elemental concentration mapping\npixel of the image\nConcentration of all elements present at each\n\nElectron-specimen interactions\nElastic Scattering\n- Back-scattered\nelectron\nInelastic Scattering\n- Characteristic X-rays\n- Secondary electron\n- Cathodoluminescence\n\nElectron interaction volume\n\n( A = atomic weight, = density )\nElectron interaction volume\n(Kanaya-Okayama range)\n- Increases with electron beam energy, E\n- Decreases with sample atomic number, Z\n.0\n.1\n.0\nZ\nA\nE\nR\n\nElectron interaction volume\nTypical ranges (15 kV, perpendicular beam):\nC (Z = 6)\n1.8 m\nFe (Z = 26)\n1.1 m\nU (Z = 92)\n0.8 m\nElectron range (nm)\nAtomic number\n5 keV\n15 keV\n25 keV\nC\nU\nFe\n\nElectron probe diameter\nand Electron interaction volume\n\nElectron range (nm)\nAtomic number\n5 keV\n15 keV\n25 keV\nC\nU\nFe\n\nElastic scattering cross-section\nFor a scattering angle >e, cross-section\n(events.cm2/e-.atom)\nQe = 1.62x10-20 (Z2/E2)cot2(e/2)\nZ: atomic number\nE: beam energy\ne: elastic scattering angle\n- Increases with sample atomic number, Z\n- Decreases with electron beam energy, E\nE1 = E0 , large e\n\nBack-scattered electron (BSE)\n(Elastic scattering)\nBeam electrons scattered backward from specimen\nsurface\nHigh energy electrons with energy about the same\nas that of the electron beam\nBSE image resolution improves with shrinking\nof the electron interaction volume through:\n1.\nDecrease in beam energy\n2.\nIncrease in specimen atomic number\n\nElectron backscatter coefficient\nBSE image contrast is better among low Atomic Number elements\n\nFunction of\ncomposition\nThin section\nBackscattered electron image\nBack-scattered electron\nPlane polarized transmitted light\nPolished surface\nFunction of optical\nproperties\nHigh-Z\nLow-Z elements\n\nThe X-ray spectrum\nCharacteristic X-rays\nContinuum X-rays\nCharacteristic X-rays\nContinuum X-rays\nCharacteristic X-rays\nContinuum X-rays\n\nPhase identification: EDS X-ray spectra\nIlmenite (ilm):\nFeTiO3\nplg:\nNa-Ca-Al-silicate\nhbl: hydrous\nCa-Fe-Mg-Al-silicate\nZ\nilm:\nO\nTi\nFe\ngrt:\nO\nMg Al\nSi\nCa\nFe\nbt:\nH\nO\nMg Al\nSi\nK\nFe\nhbl:\nH\nO\nMg Al\nSi\nCa\nFe\nplg:\nO\nNa\nAl\nSi\nCa\n\nJEOL JXA-8200 Superprobe\nElectron\ngun\nCondenser\nlens\nOptical\nMicroscope\nWDS\nLN2\nEDS\nSE\nObjective lens\nBSE\nStage\nHigh\nvacuum\nSample surface is perpendicular to the electron beam\nElectron\ngun\nLiq\nN2\nfor\nEDS\nEDS\nWDS\nical\nElectron\ngun\nLiq\nN2\nfor\nEDS\nEDS\nWDS\nOptical\nMicroscope\nSample\nexchange\nchamber\n\nBack-scattered electron detector\nLocated vertically above the specimen\nA split ring shape\nsolid-state diode\nObjective Lens\nBSE detector\nA\nB\n\nCompositional and topographic\nimaging with BSE detector\nA+B\nCompositional\nmode\nA-B\nTopographic\nmode\n\nEnergy Dispersive X-ray\nSpectrometer (EDS)\n\nEDS detector: a 'p-n' layer of intrinsic Si(Li)\nsemiconductor; Be window; aperture wheel\n\nMultichannel analyzer (MCA) processes the X-ray\nsignal\n\nSecondary electron (SE)\n(Inelastic scattering)\nElectrons from specimen surface are\nmobilized by beam electrons\nEmitted at low energies (typical: <10 eV)\n(recall BSE are high energy beam electrons that underwent\nelastic scattering, E1 =E0, E0 typically being 10-20 keV)\nE1<E0 , small i\n\nSecondary electron detector\nLocated on the side wall\nof the sample chamber\n(+ve bias)\n\nImaging with the E-T detector\n-ve Faraday cage bias\nonly BSE\nSurfaces in direct line of sight\nare illuminated\n+ve Faraday cage bias\nBSE + SE\nAll surfaces are illuminated\n\nCathodoluminescence (CL)\n\nPure material has an empty conduction band; does not conduct\n\nTrace impurities add additional energy levels in the band gap that\ncan accept electrons in the excited state\n\nCL photon is emitted as electron drops back to the valence band\nLight generated from semiconductor samples through electron beam interaction\n\nCathodoluminescence spectrometer\nOptical\nspectrometer\nOptical\nmicroscope\nlight (turned off)\nOptical\nmicroscope\ncamera (not used)\n\nCathodoluminescence\nspectrometry\nCL spectrum\nEnergy\nIntensity\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_141IAP12_slides_day2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/16d1b7bfdc88b67bbddb04cdc2d0ce2e_MIT12_141IAP12_slides_day2.pdf",
      "content": "Understanding X-rays:\nThe electromagnetic spectrum\nSiK\n1.74 keV\n0.71 nm\nUM\n3.17 keV\n0.39 nm\nE = h\nh : Planck's constant = 6.626x10-34 Joule.sec\n= 6.626x10-34/1.6021x10-16 keV.sec\n= h (c/)\n: frequency\nc : speed of light in vacuum = 2.99793x1017 nm/sec\n: wavelength\n(nm) = hc/E = 1.2398/E (keV)\n\nionization\nCharacteristic X-ray generation\nInner-shell\n\nX-ray nomenclature\nX-ray\nelectron transition\nK\nL to K-shell\nK\nM to K-shell\nL\nM to L-shell\nM\nN to M-shell\n\nX-ray energies\nX-ray\nelectron transition\nX-ray energy\nK\nLII+III to KI\nEK = Ec(KI) - Ec(LII+III)\nK\nMIII to KI\nEK = Ec(KI) - Ec(MIII)\nL\nMIV+V to LIII\nEL = Ec(LIII) - Ec(MIV+V)\nM\nNVII to MV\nEM = Ec(MV) - Ec(NVII)\n\nEc(K) = EK + Ec(L)\n= EK + EL + Ec(M)\n= EK + EL + EM + Ec(N)\n≈ EK + EL + EM\nX-ray energy and\nCritical excitation energy\n\nThe X-ray spectrum\nContinuum X-rays\nTi K\nFe K\nTi K\nFe K\nContinuum X-rays\nContinuum X-rays are generated by deceleration of beam electrons in the Coulombic\nfield of outer shells of target atoms. Maximum energy = electron beam energy\nCharacteristic X-rays\nContinuum X-rays\nTi K\nFe K\nTi K\nFe K\nContinuum X-rays\nCharacteristic X-rays\nContinuum X-rays\n\nCondition for Ionization:\nOvervoltage\nU = E/Ec\n> 1\nE : electron beam energy (~10-20 keV)\n: critical excitation energy of the shell\nBest analytical condition, U≈5\ncross-section of ionization\nEc\n\nCross-section of ionization\nQ = 6.51x10-20 [(nsbs)/(UEc\n2)] ln(csU )\nns : number of electrons in the shell\nbs,cs : constants\nAl\nK-shell\nEc= 1.84 keV\n\nX-ray production volume\nand maximum depth\n(Anderson-Hasler range)\n-Always smaller than electron range\nrecall analogous expression for electron range:\n-Depends on energy of ionized shell, Ec\n-Increases with electron beam energy, E\n\n)\n(\n.0\n.1\n.1\nray\n-\nX\nE\nE\nR\nc\n\n0.0276\n.1\n.0\nelectron\n)\n(\nE\nZ\nA\nR\n\nX-ray production volume:\nCastaing's formula\n\nX-ray depth-distribution:\nthe (z) function\n(z) = intensity from a freestanding layer of thickness 'z'\n(z) at depth z = intensity from depth 'z' divided by (z)\nwhere, = density, and z = depth\n\ncrystal\ndetector\nWavelength Dispersive Spectrometer\n(WDS)\ncrystal\ndetector\nfocusing\ncircle\n\nBragg's Law\n= path length ABC\n= angle of\ndiffraction\nd = lattice spacing\nn= 2d sin\n= angle of\ndiffraction\nd = lattice spacing\nn = order of reflection\n(any integer)\n\nDiffraction angle\nn = 2d sin1\nn = 2d sin2\n(Element 1)\n(Element 2)\nDiffraction angle changes with wavelength being\ndiffracted (for the same order of reflection, n)\nDifferent elements\n\nFirst and second order\ndiffractions\n1 = 2d sin1\n=ABC\n2 = 2d sin2\n=DEF\nA\nB\nC\nE\nD\nF\nn=1\nn=2\npath DEF = 2* path ABC\nSame element\nSame wavelength is being diffracted at different diffraction angles\n\nAnalyzing crystals\nwith different \"d\" spacings\n\nWDS: Focusing geometry\nL = n.R/d\ntake-off\nangle\nangle of\ndiffraction\n\nCurved diffracting crystals\nJohansson type\nbending curvature: 2R\npolished and ground to R\nJohan type\nonly bent to 2R,\nnot ground\nR\nFWHM of fully focusing Johansson-type crystal ~10 eV\nSome defocusing in Johan-type, but resolution is not compromised\n\nCrystal orientations\nVertical, horizontal and tilted spectrometers\n\nTungsten collection wire set at 1-3 kV bias\nFlow counter: 90% Ar +10% CH4 (P-10);\npoly-propylene window\nSealed counter: Xe; Be window\nWDS: X-ray detector\n(proportional counter)\n\nCollection wire bias range\n(applied potential): 1-3 kV\nBias is set so that amplification\nis in the proportional region\nAmplification in proportional counter\n(Bias)\n\nGas used for long wavelengths:\n90% Ar +10% CH4 (P-10)\nGas used for short wavelengths:\nXe\nCounting efficiency of gas in\nproportional counter\nLight\nelements\nHeavy\nelements\n\nWDS: changing the angle of\ndiffraction\n\nTheoretical and actual limits of\nspectrometer movement\n2R ≤ L ≤ 0\n\nWDS signal pr ocessing\nSingle channel analyzer (SCA)\nwindow\nbaseline\n\nPulse Height Analysis (PHA)\nSingle Channel Analyzer (SCA) scan\nbaseline\nwindow\n\nBeam-rastered image:\nelectron beam rasters over the area\nto be imaged\nStage-rastered image: electron\nbeam is stationary, stage moves\nImaging with X-rays:\ncompositional mapping\nMg\nCa\nNa\nTi\nNumber of point measurements: image resolution\nSignal: beam current and dwell time/point\n\nDefocusing in beam-rastered\nWDS X-ray maps\n\nZn-Sn composite\nX-ray image artifact: background\n\nContinuum X-rays: background artifact\nNeither material contains Cr\nBut background counts for Cr :\nin 1\nin 2\nTherefore, if a Cr X-ray map is acquired, material 2 will show higher Cr\nthan material 1\nA composite made of 2 materials is being mapped:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_141IAP12_slides_day3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/a4c135f9bbb1c74576e90a9f8c9c9b78_MIT12_141IAP12_slides_day3.pdf",
      "content": "Quantitative\nElectron Microprobe Analysis\nWavelength Dispersive X-ray Spectrometry (WDS)\nGoal: Measurement of concentration\nof elements in a microscopic volume\n\nWDS: X-ray intensity measurement\npeak minus background intensity\nPeak intensity\nBackground intensity\npeak - background\nIntensity\nWavelength\n\nBackground modeling in X-ray spectra\nincorrect\ncorrect\nA polynomial fit to the background\nmay be more accurate\n\nPeak overlap in X-ray spectra\nPeak 1\nPeak 2\nresultant peak\nOverlap between Peak 1 and Peak 2 results in a broad single peak\n\nWDS detector optimization with\npulse height analysis (PHA)\nSCA scan\nwide window\nPHA optimized\nwindow\nlower background and\nless peak overlap\n\nPeak overlap: K and K energies (keV)\nof Ti, V and Cr\nK\nK\nK\nK\n\nI\nI\nI\nI\nI\nstd\n-\nTi\nstd\n-\nTi\nmeas\nmeas\ncorr\nVK\nTiK\nTiK\nVK\nVK\n\nCrK\nCrK\nVK\nVK\nCrK\ncorr\nmeas\ncorr\nV - std\nV - std\n\nI\nI\nI\nI\nI\n\nPeak overlap corrections\n\nEPMA: Analytical procedure\nSample preparation\n- Qualitative analysis with EDS\n- Standard intensity measurement\n(calibration)\n- Measurement of X-ray\nintensities in the specimen\n- Data reduction through matrix\ncorrections\n\nSample preparation\nSample cut and mounted in epoxy\nPolished first with coarse SiC paper, then with\nalumina grit slurry (final size: ≤0.25 m) 1\nWashed with water in ultrasonic cleaner 2\nDried with blow duster and air\nCarbon coated 3\n1: diamond paste or colloidal silica for some samples; dry polishing paper for\nwater-soluble samples\n2: ethanol may be used sparingly; cleaned with blow duster and cloth for samples\nthat dissolve in water\n3: for insulators; if standards are coated, however, all samples must be coated\n\nCarbon coating\nTo monitor coat-thickness, a polished\nbrass block is coated with the samples\nVacuum vapor deposition\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT12_141IAP12_slides_day4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-141-electron-microprobe-analysis-january-iap-2012/b90db6b72144fc614dee4c4d0ffc42d8_MIT12_141IAP12_slides_day4.pdf",
      "content": "EPMA: Quantitative analysis\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\nk\nC\nC\nk\nI\nI\nwhere\nI\nI\nC\nC\n]\n[\n,\n)\n(\n)\n(\n)\n(\n)\n(\nZAF\n\nCi and C(i): concentration of element 'i' in sample and standard\nIi and I(i): measured X-ray intensities of element 'i' in sample and standard\nki : k-ratio of element 'i'\nZAF : matrix corrections\nWDS spectrum:\nIntensity is proportional\nto concentration\n\nMatrix (ZAF) corrections\nZ : atomic number correction\nA : absorption correction\nF : fluorescence correction\n\nAtomic number (Z) correction\n*\n*\ni\ni\ni\ni\ni\nS\nR\nS\nR\n\nZ\nR = CjRj\n[ R = #X-ray photons\ngenerated / #photons if\nthere were no back-scatter]\nS = CjSj\n[ S = -(1/)(dE/ds),\nstopping power]\n* sample\n\nDuncumb-Reed-Yakowitz method:\nRi = j CjRij\nRij = R' 1 - R' 2ln(R' 3Zj+25)\nR' 1 = 8.73x10-3 U3 - 0.1669 U2 + 0.9662 U + 0.4523\nR' 2 = 2.703x10-3 U3 - 5.182x10-2 U2 + 0.302 U - 0.1836\nR' 3 = (0.887 U3 - 3.44 U2 + 9.33 U - 6.43)/U3\nSi = j CjSij\nSij = (const) [(2Zj/Aj )/(E0+Ec)]ln[583(E0+Ec)/Jj ]\nwhere, J (keV) = (9.76Z + 58.82Z-0.19)x10-3\nZ, a function of E0 and composition\n\nZ, a function of E0 and composition\n0.8\n0.85\n0.9\n0.95\n1.05\n1.1\n1.15\n1.2\nZ AlK\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\nCCu\nPure metal standards\n0.8\n0.85\n0.9\n0.95\n1.05\n1.1\n1.15\n1.2\nZ CuK\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\nCCu\nPure metal standards\n0.8\n0.85\n0.9\n0.95\n1.05\n1.1\n1.15\n1.2\nZ AlK\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\nCCu\nCuAl2 standard\n0.8\n0.85\n0.9\n0.95\n1.05\n1.1\n1.15\n1.2\nZ CuK\nE0 (keV)\n0.1\n0.3\n0.5\n0.7\n0.9\nCCu\nCuAl2 standard\nAl-Cu alloy\n\nX-ray absorption\nI = I0 exp-(/)(x) = I0 exp-(/)(z cosec)\nI: Intensity emitted; I0: Intensity generated\n/: mass absorption coefficient\n: density; z: depth; : take-off angle\n\n-\n\nMass absorption coefficient,\nj\nenergy\n'\nelement 'j\nj\nenergy\ncompound\nC\n)\n(\n)\n(\n\nenergy\nabsorber\n)\n(\n\nFor compounds,\nEnergy\nEc(K shell)\nenergy\nNi)\n(\n\n(keV)\n\n(keV)\n(cm 2/g)\nCoK\n6.925\nNiK\n7.472\n8.331\nCuK\n8.041\nZnK\n8.632\nZnK is absorbed by Ni\nA function of energy being absorbed\n\nAbsorption (A) correction\nAi\n*)\n(\n)\n(\ni\ni\nf\nf\n\nAbsorption function,\nf(i) = Ii(emitted)/Ii(generated)\n* sample\n\nA, a function of E0, and\ncomposition\nPhilibert method:\n)\n(\n\ni\ni\ni\ni\ni\ni\ni\nh\nh\nf\n\nwhere,\ni =\nenergy\ni\nspecimen\n)\n(\n\ncosec\nhi = 1.2Ai/Zi\ni = 4.5x105 / (E0\n1.65-Ei(c)\n1.65)\nFor compounds:\n\nj\nj\nj\ni\nC\nh\nh\nj\nenergy\ni\n'\nelement 'j\nj\nenergy\ni\nspecimen\nC\n\n)\n(\n)\n(\n\nA, a function of E0, and\ncomposition\nANiKin Fe-Ni alloy\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\nANiKat 15.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKat 40o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKat 52.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n\nTotal X-ray intensity:\ngenerated versus emitted\nGenerated intensity\n\n)\n(\n)\n(\n)\n(\nz\nd\nz\nz\nI gen\n\ncosec\n)\n(\nre,\nwhe\n)\n(\nexp\n)\n(\n)\n(\nexp\n\nz\nd\nz\nz\nI\nI\nz\nz\ngen\nemit\nEmitted intensity\n\nEffect of matrix (mainly Cu) on the emitted intensity of\nAlK, which is highly absorbed in Cu;\n= 4837.5 cm2/g\nGenerated and emitted X-ray intensity\nvariation with depth: AlK in Al-Cu alloy\nAlKα\nCu)\n(\n\n(z) matrix correction\nThe combined atomic number and absorption corrections\nis the ratio of emitted intensities\nin standard (I emit) to sample (I *\nI emit (z)0\n(\n*\n\nIemit z\n\n)\n(\nexp\n)\n(\n*\n)\n(\nexp\n)\nz\nd\nz\nz\nd\nz\nz\nz\ni\ni\ni\n\n(\ni\n\nemit)\n\n)\n(\nz\n\n)\n(\nexp\n)\n(\n*\nz\nd\nz\n\nexp\n)z\nz\n\n)\n( z\nd\ni\ni A\nZ\n\n0 : the value of\n(z) at z=0\nRm : the depth at\nwhich (z) is\nmaximum (m)\nRx : the maximum\ndepth of X-ray\nproduction (X-ray\nrange)\n(z) matrix correction\nZiAi is modeled in terms of 0, Rm, Rx and the integral of the (z)\nfunction (Pouchou and Pichoir: PAP method)\n\nRm and Rx\n- decrease with\nincrease in atomic\nnumber, Z\n- increase with\nbeam energy, E0\n(0) increases with\nbeam energy, E0\n(z) dependence on Z and E0\n\nX-ray fluorescence\nAbsorber\nEK\nEK\nEc(K)\n\nNiK\nAbsorber\n)\n(\n(Atomic No.) (keV)\n(keV)\n(keV)\n(cm2/g)\nMn(25)*\n5.895\n6.492\n6.537\nFe(26)*\n6.4\n7.059\n7.111\nCo(27)\n6.925\n7.649\n7.709\nNi(28)\n7.472\n8.265\n8.331\nCu(29)\n8.041\n8.907\n8.98\n65.5\n* NiK fluoresces Mn and Fe\nElement\nRadiation causing fluorescence\nMn\nFeK, CoK, CoK, NiK, NiK, CuK, CuK\nFe\nCoK, NiK, NiK, CuK, CuK\nCo\nNiK, CuK, CuK\nNi\nCuK\nCu\nnone\nA consequence of X-ray absorption when\nEabsorbed X-ray > Ec(absorber shell)\n\nCharacteristic fluorescence (F)\ncorrection\n\n*\n\nj\ni\nf\nij\nj\ni\nf\nij\nI\nI\nI\nI\niF\nFluorescence correction for an element includes the\nsummation of fluoresced intensities by other\nelements in the compound\nIf\nij : intensity of X-ray 'i'\nfluoresced by element j\nIi : intensity of X-ray 'i'\ngenerated by electron\nbeam\n* sample\n\nCastaing-Reed method:\nI fij /Ii = CjY0Y1Y2Y3Pij\nY0 = 0.5[(ri-1)/ri][j Ai/Aj]\nj : fluorescent yield\nY1 = [(Uj-1)/(Ui-1)]1.67\nY2 = (/)j\ni/(/)j\nspec\nY3 = [ln(1+u)]/u + [ln(1+v)]/v\nu = [(/)i\nspec/(/)j\nspec] cosec\nv = 3.3x105/[(E0\n1.65-Ec\n1.65)(/)j\nspec]\nPij=1 for K fluorescing K;\n4.76 for K fluorescing L;\n0.24 for L fluorescing K\nF, a function of E0 and composition\n\nF, a function of E0 and composition\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\n1.7\nANiKat 15.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKat 40o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n1.1\n1.2\n1.3\n1.4\n1.5\n1.6\nANiKat 52.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n0.7\n0.8\n0.9\n1.1\nFFeKat 15.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n0.7\n0.8\n0.9\n1.1\nFFeKat 52.5o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\n0.7\n0.8\n0.9\n1.1\nFFeKat 40o\nE0 (keV)\nCFe\n0.1\n0.3\n0.5\n0.7\n0.9\nFFeKin Fe-Ni alloy\nANiKin Fe-Ni alloy\n\nMatrix correction flowchart\nk ------------ ZAF1 ----------- C1 ( = k * ZAF1)\nC1 ----------- ZAF2 ----------- C2 ( = k * ZAF2)\n(if C2 = C1, stop here)\nC2 ----------- ZAF3 ----------- C3 ( = k * ZAF3)\n(if C3 = C2, stop here)\nand so on....\nConcentrations are calculated through an iterative procedure:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.141 Electron Microprobe Analysis\nJanuary (IAP) 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}