{
  "course_name": "Electrical, Optical & Magnetic Materials and Devices",
  "course_description": "This course explores the relationships which exist between the performance of electrical, optical, and magnetic devices and the microstructural characteristics of the materials from which they are constructed. The class uses a device-motivated approach which emphasizes emerging technologies. Device applications of physical phenomena are considered, including electrical conductivity and doping, transistors, photodetectors and photovoltaics, luminescence, light emitting diodes, lasers, optical phenomena, photonics, ferromagnetism, and magnetoresistance.",
  "topics": [
    "Engineering",
    "Electrical Engineering",
    "Electronics",
    "Materials Science and Engineering",
    "Electronic Materials",
    "Science",
    "Physics",
    "Electromagnetism",
    "Engineering",
    "Electrical Engineering",
    "Electronics",
    "Materials Science and Engineering",
    "Electronic Materials",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nAssignments\n\nThere are two exams during class hours, and one final exam. A term paper is due in November. There will be problem sets due most weeks except for exam and term paper weeks.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nExam 1\n\n15%\n\nExam 2\n\n15%\n\nPaper\n\n30%\n\nFinal Exam\n\n30%\n\nProblem Sets\n\n10%\n\nStudents are encouraged to work in small groups (2-3 students) to complete the problem sets. Each student must work\nindividually\nto complete the paper and exams.\n\nABET Educational Objectives and Outcomes\n\nInstructional Objectives and Outcomes\n\nAnalyze the behavior of carriers (electrons and holes) in semiconductors in terms of drift, diffusion and recombination/generation.\n\nUnderstand the meaning of energy levels in semiconductors, including the position of the fermi level at equilibrium and out of equilibrium.\n\nDescribe the operation of a pn junction and apply this understanding to more complex situations (bipolar junction transistor, junction field effect transistor, solar cell, light emitting diode, laser diode, etc.)\n\nUnderstand the behavior of light in solids and how this can be incorporated into photonic devices, waveguides, optical fibers etc.\n\nUnderstand basic magnetic quantities (field, induction, and moment) and phenomena (e.g. induction) and apply to simple devices (D.C. motor, disk drive, and transformer).\n\nDemonstrate ability to select materials for device applications based on the desired optical, electrical or magnetic performance of the device.\n\nDemonstrate ability to research the literature and to summarize important findings in writing.\n\nStrategies\n\nLectures: 3 hours per week. Encouragement of classroom participation and discussion.\n\nHomework Assignment: Reading assignments to supplement lectures. Seven problem sets, at 1-2 week intervals, to practice application of concepts learned in lectures.\n\nTerm Paper: Each student researches a particular device to determine how the desired device performance governs the choice of material and processing route. 8-10 page written report.\n\nExams: Two during class time and one final exam, all closed book, to test understanding of concepts (rather than testing numerical problem solving).\n\nAssessment Methods\n\nPortfolio Analysis: Graded problem sets form a record from which a quantitative assessment of mastery of concepts can be made. These constitute 10% of final grade.\n\nExaminations: Two during class time, approximately 1/3 and 2/3 of the way through the lecture schedule, to test mastery of the first and second third of the material (15% of grade each). Final exam (30% of grade) tests synthesis of concepts.\n\nTerm Paper: (30% of final grade) assesses ability to research and summarize the literature and to apply materials selection criteria to electronic/optical/magnetic devices.\n\nSelf Assessment: Students will complete an evaluation to assess how well the objectives and outcomes were satisfied.\n\nInstructor Assessment: Instructor will prepare memorandum that summarizes the success of the subject and outlines suggestions for improvement.",
  "files": [
    {
      "category": "Resource",
      "title": "ps1_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/9365eacd5ea7254c7d858af1162f0f70_ps1_solution.pdf",
      "content": "p\n3.15 - Problem Set 1 Solutions\n2.\na. (i)\n(ii)\nb.\nni =\np\nNcNv exp -Eg\n2kT\nFor Si: ni = 1010cm 3 , Eg = 1.12eV\nTherefore:\nNcNv\n= 1010 exp(1.12/2 × 0.0258)\n=\n2.167 × 1019cm-3\nFor Ge: ni\n=\n2.167 × 1019 exp -(0.67/2 × 0.0258)\n=\n6.1 × 1013cm-3\nThis is 6000 times larger because band gap is smaller.\n-\n\nc.\nThis is compensated (donors and acceptors cancel). Since NA = ND, Ef = Ei,\nand n = p = ni. Difference between Ei and midgap:\nEi\n= midgap + 3 kT ln mp\n∗\nm∗n\n=\n4 × 0.0256 ln 100\n= 89 meV\nd. Lower because compenstated material's dopants scatter carriers, lowering\nmobility.\n\nProblem 3\na. As T increases, μ decreases\nAs doping level increases, μ decreases\nAs lattice defects increase, μ decreases\nAll since greater scattering μ = eτ . Also, μ is lower for heavier carriers.\nm∗\nb.\np type: p = NA = 1018cm-3 for both temperatures. Fully ionized.\nHot End: n = 105cm-3 = n2\ni /NA\nCold End: n = 102cm-3\nSo we have diffusion of electrons until the electric field balances the concentra\ntion gradient. Neglect hole diff.\nThermal R & G occurs everywhere, but more carriers at hot end.\ndn\nJn = eDn\n= enμn at steady state. Diffusion = Drift.\ndx\nConcentration Gradient = 106 - 102\ncm-3 ≈ 106cm-4\n1cm\nSubstitute:\nDn = kT μn/e\ndn\nTherefore, kT μn\n= enμn\ndx\nkT dn\n= en dx\nAt the hot end:\nn = 106cm-3, = kT\ne · 106cm-4\n106cm-3 = kT\ne = 0.026V/cm\n\nAt the cold end:\nn = 102cm-3, = 260V/cm.\n\nProblem 4\nIntrinsic - assume Ef is very close to midgap.\nElectrons\ndrift due to band slope.\nElectrons\n←\ndiffuse since more e- in narrow gap.\n→\nHoles\ndiffuse.\n→\nHoles\ndrift.\n←\nThe only R & G is thermal.\nx=0, 0.67 eV\nx=0.2, 0.76 eV\nx=0.8, 1.01 eV\nx=1.0, 1.1 eV\n\nProblem\nLight produces excess carriers at surface.\nIntrinsic so n = p. Area under curve decreases due to recombination. Curve\nspreads due to diffusion.\n∂n\n∂n\n=\n+ diffusion + R & G.\n∂t\n∂t drift\nDrift\n0 because no fields.\n→\n1 d2 n\nDiffusion → e rJ = e dx2 .\nR & G: dn = -ne where ne = excess carrier concentration.\ndt\nτ\ndn\nd2n\nne\ndt = Dn dx2 + - τ\nSame type of expression for holes.\nτ is due to recombination at traps, since it's intrinsic material. These are more\neffective than band to band recombination but there are relatively few of them.\nτ = 1/r2Nτ . r2 >> r but Nτ < typical."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/fe523d5db13a5c8f7d58a5ee06c1045e_ps1.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2006\nProblem Set #1\nSemiconductor Fundamentals\nDue Monday, September 18, 2005\nReference: Chapters 1-3 of Pierret.\n1. Review of 3.024. Write a brief (1 line) definition for each of the following:\nconduction & valence bands\ndrift velocity\nband gap\nthermal motion\neffective mass\ndrift current\nintrinsic & extrinsic semiconductors\nmobility\ndopant\nresistivity or conductivity\ndonors & acceptors\ndiffusion\nn-type & p-type materials\ndiffusion current\nn+ (or p+) material\ndiffusion coefficient\nmajority & minority carriers\nrecombination & generation\ndensity of states\ndirect thermal R-G\nFermi function\nphotogeneration\nFermi energy (or level)\nsteady state\ndegenerate semiconductor\nequilibrium\nextrinsic & intrinsic temperature regimes\nminority carrier lifetime\nfreeze-out\nminority carrier diffusion length\n2. a) Draw sketches showing gc(E), gv(E), f(E) and the carrier distributions for a semiconductor\nthat is (i) intrinsic, (ii) n-type. (make the sketches with the E axis vertical.)\nb) Germanium has the same crystal structure as silicon but its band gap is 0.67 eV.If the total\ndensity of states in the conduction band (Nc) and in the valence band (Nv) are the same as\nthey are for silicon, what value of ni would you expect for Ge at 300K?\nc) The Ge is now doped with B and with P. Both dopants have the same concentration. Assume\nthe B and P energy levels are each 40 meV from the band edge. If mn*/mp* = 0.01, draw\nthe band diagram of the doped Ge as accurately as you can, showing Eg, Ef and Ei.\n3. a) What factors affect the mobility of a carrier? (2-3 sentences)\nb) A piece of p-type Si with NA = 1018 cm -3 and a length of 1 cm is heated at one end. This affects\nthe value of ni as follows:\nHot\nCold\nni = 1012 cm -3\nni = 1010 cm -3\n\nConsider only the electrons in the Si, neglecting the motion of the holes. Where do drift and\ndiffusion of the electrons occur? Estimate the electric field at the cold end of the Si.\n4. Si and Ge can be mixed together to form a SixGe1-x semiconductor material. The band gap\nincreases linearly with x, from the value for pure Ge at x = 0 to the value for pure Si at x = 1.\nYou have a bar of intrinsic SiGe material, with x = 0.2 at one end and x = 0.8 at the other end.\nThe composition varies linearly with distance. Draw the equilibrium band structure in as much\ndetail as you can and explain whether there is any drift or diffusion or R&G taking place in the\nmaterial. (this should be a short answer)\n5. Light is flashed onto the surface of a piece of intrinsic semiconductor very quickly, then the\nlight is turned off. Draw a sketch to show how the concentration of carriers varies with distance\ninto the semiconductor, at different times after the light is turned off. Give an expression that\ndescribes this behavior (note - you do not have to solve this equation, just explain the various\nterms). What determines the recombination rate?"
    },
    {
      "category": "Resource",
      "title": "ps2_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/5d9ea184d37f786009a725bc8e02fb67_ps2_solution.pdf",
      "content": "3.15 - Problem Set 2 Solutions\nProblem 1\na. Light produces excess carriers at surface.\nintrinsic so n = p.\nArea under curve decreases due to recombination. Curve spreads due to diffu\nsion.\n∂n\n∂n\n=\n+ diffusion + R&G\n∂t\n∂t drift\n∂n\n= 0: No fields\n∂t drift\nd2 n\nDiffusion = 1\ne rJ = Dn dx2\nR & G: dn\nwhere ne is the excess carrier concentration.\ndt = - n\nτ\ne\ndn\nd2n\nne\ndt = Dn dx2 + - τ\nSame type of expression for holes.\nτ is due to recombination at traps, since it's intrinsic material. These are more\neffective than band to band recombination, but there are relatively few of them.\nτ = 1/r2NT . r2 >> r but NT less than typical doping levels.\n\nProblem 2\na.\nLight is absorbed through semicondunctor. Recombination and generation oc\ncur at all places inside the semiconductor but generation is strongest at the\nsurface.\nMore carriers created near surface\nDiffusion away from surface\nAlso, no drifrt since no E (n = p everywhere), neglecting difference in mobilities.\nb. 5 × 10-4W/cm2 . Each photon is λ = 0.75μm\n1.65 eV (1 eV = 1.24μm).\n# photons/cm2s.\n⇒\n⇒\n5 · 10-4\n1.65 · 1.6 · 10-19 = 1.9 · 1015/cm2 · s\nc.\nI\nI0\n= 0.05 = exp(-α · t)\n\nα t = - ln(0.05)\n·\nln 20\nt =\ncm ≈ 0.1mm\nMost absorption occurs near the surface.\nd.\nSince Ephoton > Eg, each photon makes 1 electron-hole pair. 2 × 1015 e-h\npairs/cm2s × 6cm2 = 1.1 × 1016/s.\ne.\nExcess carriers survive 2 × 10-4 seconds. In this time 2.4 × 1012 are produced\nin a volume of 2 × 3 × 0.3cm3 . Average δn =\n2.4 1012\n·\n= 1.3 1012 cm-3\n1.8\n·\nThe intrinsic ni for GaAs is ≈ 2 106cm-3 .\n·\ncm2\nσ = ne(μe + μh) = 1.3 1012 1.6 10-19 8900\nC\n·\n·\n·\n·\ncm3\nV s\nGaAs has ni ≈ 2 106cm-3 . When light shines, ni = Pl = 1012cm-3 so the\n·\nconductivity has increased by ≈ 106 .\n\nProblem 3\na.\nEquilibrium: again, fluxes in depl. region are equal and opposite.\nBiasing positive on left leads to a large electron current.\nBias other way: large hole diffusion current. Characteristic shows exponential\ncurrent increase in both directions.\n\nProblem 4.\na.\nI define pn,0 to be the expression for equilibrium hole concentration in the n+\nmaterial. pn,0 = ni\n2/ND. Note that since the material is n+ , ND is assumed to\nbe very high (> 1019), so pn,0 will be very small.\nThe peak-height is determined readily from the \"law of the junction\" for carrier\nconcentration at the junction edges in non-equilibrium conditions. Law of the\njunction:\nnp = ni\n2 exp(qVA/kT )[see Pierret p. 245]\nSo, our peak-height will be:\npn(x = 0) = pn,0 exp(qVA/kT )\nVA is the forward bias voltage being applied to the junction.\nMinority carrier concentration will fall exponentially from pn(x = 0) to pn,0\nalong the length from the depletion region edge into n+ bulk. Lpp is the diffu\nsion length of holes that characterizes that fall, defined as Lp =\nτpDp, where\nτp is minority carrier lifetime bulk and Dp is the diffusion coefficient. From\nPierret page 116, we know that a typical value for τp is 0.5 microseconds. The\nn+ region is heavily doped, so if we assume ND to be equal to 1019, mobil\nity (according to the plot on Pierret p. 80) would be about 70[cm2/V - s].\nDp = kT/q × u = 0.026 × 70 = 1.82[cm2/sec]. We can then estimate Lp =\n√\n.5 10-6 × 1.82cm = 9.5μm.\n·\nb.\nIn the ideal diode, we assume there is no voltage drop and resultantly no electric\nfield in the bulk. Carrier movement in this region is entirely driven by diffusion,\n\nas carriers flow down the concentration gradient.\nc.\nLp will decrease by a factor of\n√\n10, causing this exponential decrease of carrier\nconcentration in the material to occur over a shorter distance. See above plot.\nLp\nL\np = √\n10 .\nd.\nThe boundary condition at the end of the n-side is that of an ohmic contact,\nwhich forces carrier concentrations to their equilibrium value. This will result\nin an approximately linear carrier concentration profile:\ne.\nThe boundary condition at the ohmic contact forces a larger carrier-concentration\ngradient in the short diode, which will result in a larger current.\n\nZ\nZ\nProblem 5.\nNA = ND so dp = dA\nNA\ne =\ncx from\nx\n\n=\n-dA\n\nto\n\nx\n= dp\ndP\nx\nNA\n=\np(x)dx =\ne\nxdx up to x = dp\nDr\nDr\n-dn\ndn\n= -eNA (x - d2 ) Parabolic\n20rdp\nn\n\nZ\n\nx\nV\n= -\n(x)dx\nZinf\n=\nx\neNA (x 2 - d2 )dx\nn\n-\n-dA 20rdp\neNA\nx3\n2d3\nn\n=\n20rdp\n3 - d2\nnx - 3\nThis is cubic.\nPotential:"
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/2171ff421422eea3dd14e1d430ec776a_ps2.pdf",
      "content": "3.15 Electrical, Optical and Magnetic Materials and Devices\nProf. Caroline A. Ross\nFall 2006\nProblem Set 2 Carriers and pn junctions\nDue: Wednesday Sept. 27, 2005\nReference: Pierret chapers 5-6\n1.\n(Question 5 from PS 1, repeated)\nLight is flashed onto the surface of a piece of intrinsic semiconductor very quickly, then\nthe light is turned off. Draw a sketch to show how the concentration of carriers varies\nwith distance into the semiconductor, at different times after the light is turned off. Give\nan expression that describes this behavior (note - you do not have to solve this equation,\njust explain the various terms). What determines the recombination rate?\n2.\nA slab of intrinsic GaAs, 3 cm long, 2 cm wide and 0.3 cm thick is exposed to\nlight. The light is absorbed with an absorption coefficient of α = 500 cm-1 (this means\nthat the light intensity decreases in the material exponentially with distance t, and is\nproportional to exp (-αt)). The light is monochromatic with wavelength 750 nm and\nintensity 5 10 -4 W/cm2.\na) Explain where drift, diffusion, R and G occur.\nb) What photon flux is incident on the slab?\nc) At what depth does the intensity decrease to 5% of its initial value?\nd) Calculate the number of electron-hole pairs generated per second in the slab (state your\nassumptions).\ne) By how much does the conductivity change due to the light? (assume a recombination\ntime of 2 10-4 sec.)\n3.\nSuppose you could make a pn junction out of two intrinsic semiconductors A and\nB with different band gaps. The band diagram is shown below. What diffusion\nand drift currents are present in the structure at equilibrium and at small bias (i.e.\nat applied voltages less than the band gap of B)? What shape will the I-V curve\nhave?\nEc\nEf\nEv\nA\nB\nEg,A\nEg,B\n\n4.\nConsider the distribution of holes in the n-type region of a p - n+ junction under\nforward bias.\na)\nSketch the variation of minority carrier concentration with position from the edge of\nthe depletion region into the bulk n-type region under forward bias. Label the\ndiagram with appropriate dimensions (e.g. Lp, pn,o) and provide a quantitative\ndescription of the peak height. What is a typical value for Lp?\nb) Is drift or diffusion responsible for carrier movement in this region?\nc)\nHow does the sketch of part (a) change if the minority carrier lifetime is reduced by\na factor of 10?\nd) How does the sketch of part (a) change if the length of the n-side beyond the\ndepletion region were shorter than Lp? This case is called a 'short diode'.\ne)\nWould a short diode provide higher or lower current at the same forward bias than a\nstandard diode?\n5.\nIn a simple 'step' p-n junction like the one considered in class, we assume that the\ncharge density is constant in the depletion region. Consider now a more realistic case\nwhere the dopant concentration varies with position as shown below. Assume the width\nof this graded region is equal to the width of the depletion region, and NA = ND. Show\nhow the charge density, electric field and voltage vary across the junction.\ndopant concentration\nND\ndn\ndp\nNA"
    },
    {
      "category": "Resource",
      "title": "ps3_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/4f595c802b270d145a6062217b2244c8_ps3_solution.pdf",
      "content": "3.15 - Problem Set 3 Solutions\nProblem 1\na.\nForward Bias: e- injected into p side, leads to high e concentration near\ndepletion region, decays away with characteristic length Ln (10s of μm) slight\nreduction of electron concentrtion near depletion region of n side.\nReverse Bias: e collected from p side, pins n = 0. (Very slight increase in n on\nthe n side.)\nb.\nBreakdown: in depletion region = 105V/cm.\nAssume depletion approximation: if ND = NA, dn = dp.\nMax = NAedp or NDedn\nEDER\nEDER\n\n2EDERV0\nNA\nWe know: dn =\ne\nND(NA + ND)\nand\n\nq\nr\nkT\nNAND\n1015 1015\nV0 =\nln\n= 0.0258 ln\n·\ne\nn2\ni\nSo:\ndn\n=\n=\n2 × 1.05 · 10-12 × 0.59\n1.6 · 10-19\n6.2 × 10-5cm or 0.6μm\n×\n1015(2.5 × 1015)\nTherefore:\nNDedn\n· 10-19\n· 10-5\n=\n=\n× 1.6\n× 6\n= 0.9 104V/cm\nEDEr\n1.05 10-12\n·\n·\nFor breakdown, applying voltage VA extends the depletion region, and raises .\nV0+VA\ndn increases by a factor of\nV\nand so does .\nIf avalanche occurs at 105 V/cm:\nV0 + VA\n=\n0.9 × 104\nV0\nV0 + VA = 72.8V\nSo reverse bias of ≈72V is needed for breakdown.\nc.\nWe collect carriers in reverse bias pn jn so we might bias both jns in reverse.\nThen any holes produced in base will go across either EB or BC jn, depending\non which direction they go. A large hole current flows into E and C from B.\nElectrons flow out of the base contact. IB ∝ light intensity. (In fact it would\nwork even without bias.)\nNote: Putting EB in fwd bias means a large current already flows through E\nC,\nso the light-generated carriers would not add much to this.\n→\n\nProblem 2\na.\nb.\nThe E-B junction is forward-biased.\nThe C-B junction is reverse-biased.\n⇒ We are in the forward-active regime. IE ≈ IC >> IB .\nc.\n\nnp = ni\n2 exp(aVA/kT )\nAt E-B depl. region edges:\nnp(0) =\nni exp q0\n3kT\n= 109cm-3 e-inemitter\npn(0) = 104 exp q0\n3kT\n= 109cm-3h+inbase\nd.\nTo be consistent with nomenclature, we should refer to this current density at\nJCE . We have diffusion current in the base, from the emitter to the collector.\nND,B = 1016cm-3\nμp = 440; Dp = μ kT = 11.4 cm 2 .\nq\nsec\n⇒\nJCE = -qDp\ndp = -1.6 10-19 11.4 109\n= -3.65 μA\ndx\n·\n·\n5 10-4\ncm2\n·\nNote: holes flow from emitter to collector, so collector-to-emitter current is neg\native.\ne.\nThis would reverse-bias the E-B junction putting the device in the cut-offf\nregime, and causing ICE (JCE ) to cut-off (go to ≈ 0).\n\nProlbem 3\na.\nb.\n\"Is x in equilibrium?\"\n\"Is the fermi level flat within x?\" Within the semicon\n⇔\nductor the Fermi Level remains flat, meaning there is no tendency for charge to\nflow in either direction. The semiconductor, considered separately from the rest\nof the system is \"in equilibrium\" within itself. The additional band bending due\nto the applied MOS voltage is then considered to create a sort of new built-in\nvoltage, similar to what we saw in a pn junction.\n\nProblem 4\na.\nMaterial masked in black is oxide (SiO2)\nVG negative: initially electrons depleted from S/C, eventually goes into inver\nsion (becomes p type). Metal gate has depletion of electrons close to interface.\nVG positive: electrons accumulate in S/C and also in metal near interface.\nb.\nZero Vg:\npn junction at D is in large reverse bias, no current flows S-D.\nNegative Vg:\n\nAt threshold Vg , n goes into inversion and forms channel. Curren ISD flows,\nbut channel is narrower near D, and eventually pinches off\nlimits ISD.\n→\nPositive VG: No channel forms, no conduction from S to D.\n\nProblem 5\na.\nEquilibrium undoped - Ideal.\nLike MOS¡ the S/C - oxide band offsets are fixed, same for all doping levels.\nEquilibrium - Band bending casuses depletion near each interface.\nb.\nBias 'forward'\np side positive.\n→\n\nThis 'unbends' the bands near the interface. Each side has less depletion than\nthe unbiased case. A large bias could lead even to accumulation. Acts like a\ncapacitor.\nBias 'reverse'\nThis is where depletion increases - we can eventually get inversion.\nNo current flows in any of these since oxide doesn't conduct."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/c7c8cff783278473a74ad78936d38808_ps3.pdf",
      "content": "3.15 Electrical, Optical and Magnetic Materials and Devices\nProf. Caroline A. Ross\nFall 2006\nProblem Set 3 pn junctions, BJTs and MOS\nDue: Wednesday Oct. 18, 2006\nReference: Pierret chapers 10,15,16\nNote: The pn junction and BJT are included in Exam 1 on 11th Oct. Solutions to\nquestions 1-2 will be posted on 4 Oct, and will not be graded. However, it is strongly\nrecommended that you work on the problems for practice before looking at the solutions.\nQuestions 3-5 on MOS are due Oct. 18th and will be graded.\n1. a) For a pn junction, draw the electron and hole concentrations vs distance outside the\ndepletion region in the case of no bias, forward bias, and reverse bias, explaining\nbriefly the shapes of the graphs. (2-3 sentences)\nb) Estimate the voltage you would need to apply to cause avalanche breakdown in a Si pn\njunction with ND in the n-side = NA in the p-side = 1015 cm -3. Assume that\navalanche breakdown occurs at a field of 105 V cm-1, and state any other\nassumptions you make.\nc) A BJT can be used to detect light by allowing the light to fall on the base region. How\ncould you bias the two junctions in the BJT to get a good response to light? For\nyour biasing scheme, draw the band structure and explain where the current(s)\nflow.\n2. Consider a pnp bipolar junction transistor with an emitter doping level of 1018 cm -3, a\nbase doping level of 1016 cm -3, and a collector doping level of 1015 cm -3. The cross-\nsectional area of this device is 10-7 cm2. The width of the base is WB = 5 um, and WB <\nLDB the minority carrier diffusion length in the base. Assume also that widths of the\nemitter and collector are much longer than minority carrier diffusion lengths in those\nregions.\n(a) Sketch the equilibrium minority carrier concentration vs distance along the\ntransistor from the emitter to the collector, in every region except for the\ndepletion regions.\nVoltages of VEB = .3 volts and VCB = -2 volts are now applied to the device.\n(b) What regime of operation is the device in? What will be the relative values of IE,\nIB, and IC, compared to one another?\n(c) Sketch minority carrier concentration vs distance within the device, given the\napplied biases. Quantitatively label maximum and minimum concentrations\nwithin the emitter, base, and collector.\n(d) Neglecting the length of the depletion region within the base, determine the\ncurrent density flowing from the collector to the emitter, ICE.\n(e) If the polarity of VEB were reversed, how would ICE change (qualitatively)?\n\n3. An ideal MOS junction is shown below. Band bending has caused the fermi level to\ntouch the intrinsic level at the Si/SiO2 interface.\na) Sketch the charge buildup, the electrostatic potential, and the electric field inside the\nsemiconductor vs. position.\nb) Do equilibrium conditions prevail inside the semiconductor? Sketch the electron\nconcentration vs. distance inside the semiconductor.\n4. A MOSFET has the following structure:\noxide\nG\nw\nmetal\noxide semiconductor\nEc\nE f,semi\nEi\nEv\nE f,metal\nS\nD\np+\nn\np+\na) What happens when you apply a voltage VG to G (when S and D are grounded)?\nConsider both positive and negative voltages. Illustrate with a sketch of the MOS band\ndiagram.\nb) What happens when you apply a negative voltage VD to D, for different values of VG\n(zero, positive and negative)? (assume S is grounded.) Draw plots of current ISD vs VD\nfor different values of VG.\n5. A semiconductor-oxide-semiconductor (SOS) structure can be built similar to a MOS\nstructure. You can assume that all the bands are flat in the SOS structure when the\nsemiconductor is intrinsic, so it looks like this:\nintrinsic\noxide\nintrinsic\nEc\nEf\nEv\na) Suppose now that one layer is p-type and the other is n-type. Draw the SOS band\nstructure at equilibrium showing what is different compared to the picture above.\nb) Redraw the band structure under bias (in both directions).\nc) Explain what currents or carrier distributions might be expected in the device under\nthese three bias conditions."
    },
    {
      "category": "Resource",
      "title": "ps4_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/f865675bb6bbfe66874cf3254ccd638e_ps4_solution.pdf",
      "content": "3.15 - Problem Set 4 Solutions\nProblem 1\na.\nb.\nThe suggested way of looking at this problem was to realize that photocurrent\nis proportional to the light intensity. The intensity ration will then just be the\nratio of short circuit currents.\nISC,illum = 3.1A = 4.3\nISC,Expt\n0.72A\nSo the sum must be around 4.3 times brighter in order to reach full illumination.\nThis is possible during the summer months. Many of you also made the point\nthat because of the damaged condition of the solar cell that the cell will never\nreach full illumination which is probably true.\nc.\nMaximum power is determined by the largest possible IV product.\nPmax = (IV )max = 0.67A × 18.9V = 12.7W\nOperation time is then simply the desired energy divided by the maximum\npower.\nEnergy\n1kWhr\nt =\n=\n= 79hours\nPmax\n12.7V\nFor full illumination, the best power is 43.8 W. We want to match the load\nresistance such that the voltage dropped across the load corresponds exactly to\nthe voltage supplied by the cell. This is an impedance matching problem.\n\nResistance is then found by taking the voltage at maximum power andd diving\nby current at maximum power.\nV\n17.3V\nRload,opt =\n=\n= 6.8Ω\nI\n2.53A\nFor comparison, let's take a 40W light bulb.\nV 2\nV 2\n(120V )2\nP =\nR =\n=\n= 360Ω\nR ⇔\nP\n40W\nThe optimal load of our solar cell is much less than for a typical light bulb.\ne.\nConnecting the 36 cells in series or parallel will change the voltage and current\napplied to the load.\nWith the cells connected in parallel, Pmax is the same but V is 1/36 of the\noriginal value and I is 36 times the original value.\nRparallel = Rseries = 5.3mΩ\n(36)2\nIn parallel, the cell can be used to power low impedance devices.\nf.\nThe difference in current is due mainly to the large difference in juntion area\nbetween a diode and the solar cell. Current densities are roughly equivalent for\nboth but the large area of the solar cell allows for a much larger current from\nrelations V = IR and R = ρl/A.\ng.\nThe J0 value ⇒ mobility is ≈ 900 cm2/Vs. This is high ⇒ need good quality\nSi.\n\nProblem 2\nI (A)\n0.5\n1.5\n1.7\n1.8\n1.9\nFor I = 0:\nV\n0.38\n0.37\n0.36\n0.34\n0.33\n0.317\n0.299\neV\nI = I0 exp\n-1 +Ig\nkT\nI0 = 10-6 A, Ig = -2 A\n(RP V + RL) = V/I\nIV\n0.19\n0.36\n0.51\n0.56\n0.57\n0.5\neV\n10-6 exp kT - 10-6 - 2 = 0\n\nexp eV = 2 106 = 14.5\nkT\n·\neV = 0.025 × 14.5 = 0.38V\nIn general:\nV = 0.025 ln 106 × (2 - I)\nI = 0.5A\nV = 0.37V\nMax power when I = 1.8A, V = 0.317, gives 0.57W. For load resistance:\nRP R + RL =0.317/1.8 = 0.18Ω\nRL = 0.08Ω since RP R = 0.1Ω.\n⇒\nb.\nCell has limited efficienty. Solar spectrum has range of colors, and the higher\nenergy photos waste all energy > Eg. Not all of surface can absorb light due\nto conductor lines. Not all light absorbed within Ln or Lp or juntion surface\nmight be reflective.\n\nq\nProblem 3\nThere are many possible solutions to this problem. A number of factors must\nbe considered:\nThe principle of operation of a pin diode relies on a large amount of light being\nabsorbed in the i-region, which means that this region should be wirder than\nany other layer throught which light passes. However, a shorter Wi will enable\ncharge carriers to cross the region in less time. fmax ∝ W\ni\nWhen used in conjuntion with a resistor, an RC time constant also affects the\nfrequency response ∝ Wi (considering the pin structure to be similar to a ca\npacitor).\nThe device will operate at frequencies up to a certain cut-off, limited by those\nconsiderations.\nDevices of smaller width may have trouble absorbing longer wavelengths. To\ncompensate for this, we can employ materials layers that help confine the light\nto the i-region by reflection.\nDevice doping must be arranged such that during operation, the entire i-region\nis depleted.\nOne possible solution is given as follows:\nIf we assume ND = 1010cm-3 in the n-region and NA = 1019cm-3 in the p-\nregion, then we see that the i-region will deplete under the application of a small\nreverse bias. Considering the p+-i junction, xd =\n2ERE0 (Vbi - V ); xd ≈ 23μm\n4ND\n⇒ V ≈ 3.3 volts.\nWe will the set the n+ and p+ regions to be short, to reduce light absorption,\nbut long enought to support i-deplection. Wn+ = Wp+ = 1μm. Neglecting\nadsorption of incident light in the p+/n+ regions, and assuming that incident\nphotons are contained by the internally reflective layers, the wavelength range\nover which this device is effective is determined by the band structure. The\n1.24\noptimum wavelength will be just lower than λg = Eg = 1μm.\n\nThe expected frequency response will attenuate signals above the cut-off fre-\nVsat\nquency fmax = Wi = 4.4GHz.\nTo estimate minimum detectable light intnesity, note that the photogener\nated current must exceed the minimum current that can be detected by whatever\ndevice we use to measure it. This will be limited by noise in the system. If we\nassume a typical minimum current of Imin = 10-7A, then the corresponding\nlight intensity is given by:\n10-7A = 10-7 coulombs = q(n + p)e-h pairs\nsecond\nsecond\nnph = n = p = # photons\nnph\n= 6.25 1011\nsecond\n·\nnph\nphotons\n= 6.25 1013\ns area\n·\ns cm2\n·\n·\nAssume:\neV\nE ≈ 1.1photon\nWatts\nIntensity = 6.25 1013 1.1 1.6 10-19 = 1.1 10-6\nby conservation of energy\n·\n·\n·\n·\n·\ncm2\nWhen optimally designed, a p-i-n diode will absorb as much light at possible in\nits completely depleted i-region so that generated carriers can be immediately\naccelerated to vsat.\nfmas = Wi , Wi = intrinsic layer thickness\nvsat\nSmaller Wi ⇒ faster frequency response, however if we continue to decrease Wi,\nthe frequency response will become dominated by the RC time constant of the\nelectrical circuit.\n\nWi\nf =\n=\n=\nRC\nR E0 ERWi\nRE0ERA\nA\nTo find optimum intrinsic layer thickness with the given R:\nvsat\nWi\np\n=\nVsatRE0ERA = 23μm\nWi\nRE0ERA ⇒\nNote also that a wider Wi would allow more distance over which the light can\nbe absorbed by the Si however we can make up for this by employing an anti-\nreflective coating at the top of the device and a mirror at its bottom, to confine\nand absorb incident radiation.\nConsidering optimal doping, we know that the i-region must be very lightly\ndoped and the n+ and p+ regions must be heavily doped in order to completely\ndeplete the i-region in equilibrium (more necessarily, in reverse bias).\nLet us assume a minimum achievable dopant concentration in the i-layer of\n1013cm-3 donors."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/0f7e691bd62091722b01170147000dbc_ps4.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2006\nProblem Set #4\nPhotodevices\nOut 18 Oct, due 25 Oct. 2006\n1. This question concerns the solar panel which we examined in class.\na) Plot the I-V data which we measured on top of the darkened and fully-illuminated\ncurves (a copy is attached to this problem set).\nb) How many times brighter would the light have to be compared to what we measured\nfor the cell to be 'fully illuminated'? Is it reasonable to expect the panel to achieve full\nillumination at any time in the year?\nc) How long would the cell have to operate in Boston in October to obtain 1kWh power\n(i.e. about 20c worth of electricity)?\nd) What is the ideal resistance of the load for the cell to generate maximum power under\nfull illumination? Is this consistent with typical loads presented by, for example, an\nelectric light bulb or an electric motor?\ne) Why were the 36 cells connected in series? What would the optimum resistive load be\nif they were connected in parallel?\nf) Each cell passes about 60 mA under about 0.5 V forward bias in the dark. Previously\nwe found that a typical pn junction allows about 1 mA to pass under about 0.5 V forward\nbias. What is the reason for this difference?\ng) Jo for the cell in the dark is 2.5 10-12 A/cm2. Given typical doping levels, what does this\nimply about the quality of the silicon needed for the cell, as compared to microelectronic-\ngrade silicon?\n2. a) A photovoltaic cell has a value of Io = 10 -6 A and IG = -2A. Its internal resistance is\n0.1 ohm. Estimate the best choice of load resistance in order to get the most power out\nof the cell, and what the maximum power is. (You do not have to calculate it exactly).\nb) Why is the maximum efficiency of a Si solar cell only about 30%? Give at least 3\nreasons.\n3. Design a silicon pin photodiode of area 1 mm2 with as fast a response time as possible\nwhen used in conjunction with a 50 Ω load resistor. Take εr = 11.8 and vs, the electron\nsaturation drift velocity, as 105 m/s. Address the following points:\n- Determine the optimum thickness of each layer\n- Describe an optimum doping arrangement\n- Over what wavelength range would you expect the device to be most effective?\n- Describe the expected frequency response\n- Estimate the minimum detectable input light intensity\n\nThere is no one 'right' answer for this. To obtain credit, clearly explain your assumptions\nand reasoning. Solar Panel, voltage per ceASEll.\nSolar Panel, voltage\nper ceASEll.\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "ps5_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/10d7ad29082d12c0ce819ff6f768cbed_ps5_solution.pdf",
      "content": "3.15 - Problem Set 5 Solutions\nProblem\na.\nR = rnp = 10-10(1.8 106)2cm3s-1cm-3\n·\n= 324cm-3s-1\nb.\nEach photon is 1.42 eV approximately. Power = 460 eV/cm3s-1 . One eV =\n1.6 10-19 Joule\nPower = 7 10-17 W/cm3 .\n·\n⇒\n·\nc.\n2 μm piece of GaAs will emit 1.4 10-20 W/cm2 . Insignificant.\n·\nd.\nWe have 1017 carriers/cm3 extra, and they recombine in 50 ns. So the recom\nbination rate should be 5010-9 cm-3s-1 = 2 1024/Cr.\n·\ne.\nThis gives 2.8 1024eV/cm3s-1 = 450 kW/cm3 .\n·\nf.\n2 μm thickness\n90 kW/cm2 - high.\n→\ng.\nIt's still 180W, which is very large.\n\nProblem 5\na.\n980 nm - several choices of systems. Main concern is to find a suitable substrate.\nInP or GaAs look good - Need lattice match with active layer plus cladding must\nhave a higher band bap than active layer. Eg:\nOption\nSubstrate\nActive\nClad\nGaAs\n(GaIn)As with In ≈ 20%\nGaAs again\nGaAs\nGa(As,Sb) with Sb ≈ 20%\nGaAs\nInP\nIn(P,As) with As ≈ 10%\nGaAs\n\nAlAs\n(InGa)As with In ≈ 20%\nAlGaAs\nPoor choices: GaSb substrate with (Ga50Al50)Sb active layer - GaAlSb is indi\nrect.\nInP substrate with (InAl)As active layer - lattice match is worse than option 3.\nb.\nTake option 3 because the lattice match is best. We don't know band offsets\nbut ΔEc + ΔEv = 0.2eV.\n(The cladding thickness doesn't matter too much but you need the active layer\nto be thin enough so we can get a high density of photons. Also need to avoid\ndislocations forming due to misfit with substrate. Length of device governed by\nwhere you want the nodes due to cavity resonance.)\n\nc.\nTypical for slc laser\nd.\nReally need to know refractive index. Active layer should have a higher RI to\nconfine light inside the quantum well. So a plot of RI vs. comp. would be\nuseful. Also is there thermal expansion mismatch? How do materials cleave or\ncut? (to make shape for cavity)."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/1cb83a7fcfc5ffb8c45d73e5af167b17_ps5.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2006\nProblem Set 5 Lasers and LEDs\nDue: Weds Nov. 1 2005\nReference: Pierret chaper 9 (LEDs), Solymar and Walsh chap. 12 (lasers). Additional\nreading from MRS Bulletin\n1. Term paper topic\nPropose a topic for your term paper - for examples or inspiration see the first handout, or\nlook through copies of MRS Bulletin, Scientific American, Physics Today, etc (available\nin my office). Write a paragraph mentioning the major materials issues associated with\nyour device. Give the titles of 2 or 3 references (e.g scientific papers) about the topic.\n(The term paper is 8-10 pages long, due 20 Nov.)\n2. Read the articles from MRS Bulletin on organic photovoltaics and on lasers/LEDs for\nsome additional background not covered in Pierret.\n3. Consider the photon emission from GaAs in thermal equilibrium. For GaAs at room\ntemperature, ni=1.8x106/cm3 and the radiative electron-hole recombination rate r =\n10-10cm3/s.\n(a) Compute the electroluminescence rate (# of photons generated per cubic\ncentimeter per second).\n(b) Given the bandgap energy of GaAs as 1.42 eV, compute the optical power density\n(Watts/cm3) represented by this emission rate.\n(c) Compute the intensity of light emitted by a 2 μm thick layer of GaAs. Is this\nintensity significant?\nNow consider the photon emission from forward-biased GaAs p-n junction featuring\ninjection electroluminescence emission. Assume a minority carrier lifetime of 50 ns.\n(d) If the injected minority carriers give rise to a steady state increase in minority\ncarrier concentration of 1017/cm3, compute the electroluminescence rate.\n(e) Given the bandgap energy of GaAs of 1.42eV, compute the optical power density\nrepresented by this emission rate.\n(f) Compute the intensity of light emitted by a 2 μm thick layer of GaAs. Is this\nintensity significant?\n(g) What is the power emitted from a device of area 200 μm x 10 μm?\n4. Consider the design of a \"white\" LED like that offered in the catalog listing shown\nbelow. You will recall that \"white\" light is actually the combination of all visible\ncolors, and can be effectively modeled by the simultaneous presence of red, green,\nand blue (RGB). This RGB approach to white light is that used by your color\ntelevision and color computer monitor. Red light has a wavelength of approximately\n650 nm, green light is approximately 530 nm, and blue light is approximately 430\nnm.\nTwo design approaches are available for white light emission. One is to build three\nsmall, discrete devices (red, green, and blue), package them within a single LED\n\nScanned catalogue advertisement removed\ndue to copyright restrictions.\npackage, and operate them simultaneously to\nThe following text was displayed:\nyield the white light. The other is to create a\nBRIGHT WHITE LED\nsingle structure that simultaneously generates\n5mm T1-3/4\nphotons over the visible spectrum (as is the case\n3.6 - 4 VDC @ 20mA\nfor the filament of an incandescent light bulb).\nFull spectrum white\nWide angle beam\nDiscuss the pros and cons of these two\n2000 mcd typical luminosity\napproaches, and comment on the materials you\n25-353 -------- $3.99\nwould use in each case. Where possible, explain\nyour selections in terms of output wavelength, efficiency, substrate availability, and\nreliability, and in the second case, be clear about how a single device can be expected to\nsimultaneously produce a series of different wavelengths throughout the visible region.\nBe specific in your discussions. You may neglect issues such as how the discrete devices\nare actually mounted and how they electrically connected. (please be concise, 1 page\nmax.)\n5. Based on the following data, design a semiconductor laser to operate at 980 nm. In\nyour answer consider the following:\nAlAs\nGaP\nAlSb\nGaAs (D)\nInP(D)\nGaSb (D)\nInAs (D)\nSi\nGe\n0.65\n0.64\n0.63\n0.62\n0.61\n0.60\n0.59\n0.58\n0.57\n0.56\n0.55\n0.54\n0.2\n0.4\n0.8\n0.6\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\n2.6\n6.200\n3.100\n2.067\n1.550\n1.240\n1.033\n0.885\n0.775\n0.689\n0.620\n0.563\n0.517\n0.477\nInSb (D)\nWavelength (microns)\nLattice constant (nm)\nEnergy gap (eV)\nAlP\nIndirect band gap\nDirect band gap (D)\nEnergy Gap and Lattice Constants\nEnergy Gap and Lattice Constants (Fig. 14.3, after Cho, 1985).\nFigure by MIT OCW.\na) what substrate, core and cladding material to use? If there are several possible\ncombinations, which would you choose?\nb) what will the band structure look like? Draw it as accurately as you can, including the\neffect of doping, for the unbiased case.\nc) what factors affect the spectral output of the laser? Illustrate your answer with a sketch\nof how you expect the intensity of the output light to depend on wavelength (or\nfrequency).\nd) What other materials data would you like to have in order to complete your laser\ndesign, and why?"
    },
    {
      "category": "Resource",
      "title": "prac_final_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/9b33a8560d3c54c334f56858e8f65fe6_prac_final_sol.pdf",
      "content": "Sample Final - Solutions\nProblem 1\na.\nMaterial is multidomain.\nDomains in Co line up with c-axis. Hoop shape will depend on angle between\nco-axis and field.\nb.\nAdd a linear term mu0H.\nc.\nAssume thermal instability when kT ≈ energy needed to reverse particle.\nkT = 1.38 · 10-23 × 300J ≈ 25 Ku · 3 πr3\n\nr = 25\n1.38 · 10-23 × 300\nm = 3.7nm ifkV = kT\n· 4π\n5 105\n·\n\nFor r < rc since it's thermall unstable, Hc = 0 and time-averaged Mr = 0.\nd.\nAlnico: Small elongated single domain NiCo particles in AlNi nonmagn matrix\nhave high Hc because they cannot support a domain wall.\nSmCo5: has v. high Ku\nh\n→\na-FeSiB: very soft because Ki ≈ 0, no pinning sites for DWs.\n\nZ\nH\nProblem 2\na.\nAmpere's Law says:\nHdl = ni\n5Hcore + Hgap = 104\nForce we need to exert is 2 104 N.\n·\nMax. magnetization of car = Bs = 1T. B = μ0(H + M).\nSo:\nMs =\nBs =\nA/m = 0.08 107A/m or800kA/m\nμ0\n4π10-7\n·\nForce on car is: μ0HgapMsV = 2 104N so we need Hgap =\n2·104\nV .\n·\nμ0Ms\nVolume of steel is:\n500kg\n= 500 m3 = 0.2m3 .\n2.5g/cm3\nHgap = 2·104 = 105 A/m or 100 kA/m.\n0.2\nThis is quite a small field so should be possible to achieve.\nFrom Ampere: if Hgap = 105 A/m, 104 = 5Hcore + 105 .\nMax value of Hcore = μ\n0 Bcore, choose soft, high Bs core like Fe-Si.\nBcore = 2.1T\n2.1\nHcore =\nA/m = 107A/m = 1.67 106A/m\n4π10-7\n·\n2.1\n104 = 105 + 5 × 4π10-7 = 105 + 12 · 5 × 107 ≈ 8.5 · 106A\nSo need current of 850A.\nA lot of current needed, because the magnet is large and\nHdl is big\nget hot.\n⇒\n\nProblem 3\na.\n(i)\nOnly in depl. region:\nhole diffusion, e- drift\n→\n←ediffusion, h drift\nTherma R & G occurs everywhere.\n(ii)\nReverse Bias:\nhole diffusion is very small - neglect\n→\nholes diffuse away from depl. region\n(hole drift) holes diffuse to edge of\n←←←\ndepl region\nb.\n\ndn\ndn\ndn\ndn\ndn\n=\n+\n+\n+\n= 0 at steady state\ndt\ndt drift\ndt diff\ndt thermalRG\ndt otherRG\ndn\ndn\n= 0 no ,\n= 0 inside Si. Recombination.\ndt drift\ndt otherRG\ndn\nn - n0\n+\n= 0\ndt drift\nτ\nDn\nd2n + n - n0 = 0 has solutions (n - n0) = (nx=0 - n0 exp\n-x\ndx2\nτ\n√\nDt\nwhere n0 = equilibrium corner density and nx=0 determined by light intensity.\nc.\nIt decays so that nx=0(t) = nx=0(t = 0) exp -t/τ .\n\nProblem 4\na.\nLED makes 3.4 eV, 2.6, 2.2, 1.1 eV\n2.3,1.5, 1.1 eV\n1.2, 0.4\n0.8\n10 possible colors through some overlap. Intensity depends on transition prob\nability and number of carriers in the level' which depends on how manny states\nare present in gap. Since Er = 1%, the brightest line would be 3.4 eV and\nbroadest. Width is less for the others since energy levels sharper.\nb.\nThe peaks would be broader because there is a distribution of energy levels.\nc.\nPump with ≥ 3.4 eV (though ≥ 2.3 eV would also work, it would give fewer\ncarriers).\nColor:\n1.24\n0.8eV\nλ =\nμm = 1.55μm\n⇒\n0.8\n\nFrequency:\nc = vλ; v = 3 · 108 × 0.8 = 1.93 1014Hz\n1.24 × 106\n·\nCavity modes have frequency:\ndN\nv =\n, textrmNisaninteger.\n2d\nSpacing of cavity modes is c/2d =\n3×108\n= 1.5 1012 Hz.\n2×100 10-6\n·\n·\nSo the center frequency is 1.93 1014 Hz and modes are spaced at 0.015 1014\n·\n·\nHz. If spectral width is 2% of center frequency, we will see just 3 modes.\n\nProblem 5\na.\nAs material resolidifies - a fast quench\nshiny amorph. surface = 1, slow\nrough crystalline surface = 0.\n⇒\n⇒\nRead:\nLower power laser.\nb.\n\nMO material = ferrimagnetic a-RE-TM alloy. Antiferromag at Tcomp\nRT but\nstill high keff coeff.\nWrite: heat above compensation temp, allow to cool in field from coil.\nRead: measure Kerr rotation, need polarizer/analyzer and photodetector.\nc.\nLimited by diffraction size of laser spot or by heat transport (whichever is\nlarger).\nd.\nMO media more complex - needs external field as well as laser. Also readback\nis smaller signal since Kerr rotation is < 1* whereas reflectivity change in phase\nchange media is larger effect."
    },
    {
      "category": "Resource",
      "title": "sample_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/55993f8513d3c9228959d846ddd34be7_sample_final.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2005\n\nFinal Exam (6 pages)\nClosed book exam. Formulae and data are on the last 4 pages of the exam.\nThis takes 180 min and there are 180 points total. Be brief in your answers and use sketches.\n\n1. Magnetic materials [36]\na) Explain the shape of a M-H loop for a piece of single-crystal cobalt of macroscopic size (e.g. a\nfew mm diameter), for H applied parallel to the c axis. In your answer explain how the\nmagnetization varies inside the material as a function of H. What happens if H is\nperpendicular to c? [15]\n\nb) What would the B-H loop look like for H parallel to c? [3]\n\nc) The magnetization of a sufficiently small piece of cobalt becomes thermally unstable. For a\nspherical particle of Co, estimate the size below which this thermal instability occurs. In a\nthermally unstable particle, what do you expect the coercivity and remanence to be? [9]\n\nData: Co Ku = 5 x 105 J/m3.\n\nd) What is the physical basis of the coercivity for the following three materials (one sentence\neach)? [Note: coercivity data for these materials are given in the data sheet p6] [9]\n\nAlnico\n\nSmCo5\n\namorphous Fe-B-Si alloy\n\n2. Magnetic devices [36]\nWe want to build an electromagnet that can pick up a car in a scrapyard.\n\nAssume a car has a mass of 2000 kg of which 25% is made of steel (Bs =\n1 T, density 2.5 g/cm3). Assume that the maximum force on a magnetic\nmaterial of moment M and volume V in a field H is given by μoMHV.\nSuppose the core has a length of 5 m and the gap length is 1 m and\nthere are 10,000 turns of wire around the core. Choose a core material\nfrom the list in the data sheet (on p6) and assess the feasibility of\nbuilding an electromagnet strong enough to do the job.\n\nHint: Start by calculating how much field you would need to pick up the\ncar.\n\n3. Carriers [36]\na) In a pn junction, where is drift, diffusion and R&G occuring when the junction is\n(i) at equilibrium\n(ii) in reverse bias [12]\n\nb) We have a piece of p-type Si as follows:\n\nlight\n\nx=0\n\nx\n\nAssume that the light is all absorbed very near the surface. Show how you would derive an\nexpression for the electron density as a function of distance, n(x), explaining your\nreasoning. You do not have to solve the equation but show where it comes from and\nwhich terms it contains. Illustrate with a sketch of n vs. x. [18]\n\nc) Explain briefly what happens to n(x) after the light is turned off. (however, you do not need to\nderive the equation relating n to time) [6]\n\n4. Optics [36]\nErbium (Er) at concentrations of ~ 1% in a GaN semiconductor has the following energy levels:\n\nEc = 3.4eV\n\nEv\n2.3 eV\n1.2 eV\n0.8 eV\n\na) If you made it into a LED, what colors of light can this Er-doped GaN produce? Draw a sketch\nof light intensity vs photon energy. What factors influence how bright each color is and\nthe spectral width of the peaks? [16]\n\nb) If the GaN were amorphous instead of crystalline, how would this affect your answer? [4]\n\nc) We now want to make the Er-doped crystalline material into a laser. It turns out that the\ntransition from 0.8 eV level to the valence band is the slowest. How would you pump it,\nand what color light would the laser make?\nIf the active region of the laser is 100 microns long, and the laser light has a spectral width that is\n2% of the center frequency, what would the output of the laser look like as a function of\nfrequency? [16]\n\n5. Data storage devices [36]\na) Describe briefly the operation of a rewritable optical disk based on phase change material.\nIdentify what materials would be suitable for the data storage layer. [up to 3-4 sentences plus 1-\n2 figures!] [12]\nb) Describe briefly the operation of a rewritable optical disk based on magnetooptical material.\nIdentify what materials would be suitable for the data storage layer. [up to 3-4 sentences plus 1-2\nfigures!] [12]\nc) What limits the data density of each? [6]\nd) Why is phase change media now more important than magnetooptical media? [6]\n\nEquations\n\ngc (E) dE = mn*√{2mn*(E - Ec)} / (π2\n3)\n\n=\n\ngv (E) dE = mp*√{2mp*(Ev - E)} / (π2\n3)\n\n=\n\nf(E) = 1/ {1 + exp (E - Ef)/kT }\n\nn = ni exp (Ef - Ei)/kT,\np = ni exp (Ei - Ef)/kT\n\nni = Nc exp (Ei - Ec)/kT where Nc = 2{2πmn*kT/h2}3/2\nnp = ni\n2 at equilibrium\n\nni\n2 = Nc Nv exp (Ev - Ec)/kT = Nc Nv exp (-Eg)/kT\n\nEi = (Ev + Ec)/2 + 3/4 kT ln (mp*/ mn*)\n\nEf - Ei = kT ln (n/ ni) = - kT ln (p/ ni)\n\n~ kT ln (ND / ni) ntype or - kT ln (NA / ni) ptype\n\nDrift: thermal velocity\n\n1/2 mv2\nthermal = 3/2 kT\ndrift velocity\n\nvd = μE\nE = field\nCurrent density (electrons)\n\nJ = n e vd\nCurrent density (electrons & holes) J = e (n μn + p μh)E\nConductivity\n\nσ = J/E = e (n μn + p μh)\nDiffusion\n\nJ = eDn ∇n + eDp ∇p\nEinstein relation:\nDn/μn = kT/e\nR and G\n\nR = G = rnp = r ni\nat equilibrium\n\ndn/dt = dn/dtdrift + dn/dtdiffn + dn/dtthermal RG + dn/dtother RG\nFick's law\ndn/dtdiffn = 1/e ∇Jdiffn = Dnd2n/dx2\n\nso\ndn/dt = (1/e) ∇{Jdrift + Jdiffn} + G - R\ndn/dtthermal = - nl/τn or dp/dtthermal = - pl/τp\nτn = 1/rNA, or τp = 1/rND\n\nλn = √(τnDn) or λp = √(τpDp)\nIf traps dominate τ = 1/r2NT where r2 >> r\n\npn junction\nE = 1/εoεr ∫ ρ(x) dx\nwhere ρ = e(p - n + ND - NA)\nE = -dV/dx\neVo = (Ef - Ei)n-type - (Ef - Ei)p-type\n\n= kT/e ln (nn/np) or kT/e ln (NAND/ni\n2)\n\nE = NAe dp/εoεr = NDe dp/εoεr at x = 0\nVo = (e /2εoεr ) (NDdn\n2 + NAdp\n2)\ndn = √{(2εoεrVo/e) (NA/(ND(ND + NA))}\nd = dp + dn = √{(2εoεr(Vo + VA)/e) (ND + NA)/ NAND}\n\nJ = Jo{exp eVA/kT - 1} where Jo = eni\n2 {Dp/NDτp + Dn/NAτn}\nTransistor\nBJT gain β = IC /IB ~ IE /IB = NA,E / ND,B\n\nIE = (eDp/w) (ni\n2/ND,B) exp(eVEB/kT)\nJFET\nVSD, sat = (eNDt2/8εoεr) - (Vo + VG)\n\nPhotodiode and Photovoltaic:\n\nI = Io + IG\n\nV = I (RPV + RL)\nI = Io (exp(eV/kT) - 1) + IG\n\nPower = IV\nWavelength\n\nλ (μm) = 1.24/E (eV)\n\nBand structure\n\nEffective mass:\nm* = =2(∂2E /∂k 2)-1\n\nMomentum of an electron typically π/a ~ 1010 m-1\n\nMomentum of a photon = 2π/λ ~ 107 m-1\nUncertainly principle ΔxΔp ≥=\nLasers\nprobability of absorption = B13, stimulated emission = B31, spontaneous emission = A31\nN3 = N1 exp (-hν31 /kT)\nPlanck ρ(ν)dν = {8πhν3/c3 }/{exp (hν /kT) - 1} dν\n\nB13 = B31\nand\nA31/B31 = 8πhν3/c3\n(Einstein relations)\nCavity modes\nν = cN/2d, N an integer.\n\nOptical Properties\nLight\nc = νλ, in a material speed = c/n , n= refractive index\nAttenuation (dB/m) = {10/L} log(Pin/Pout)\n\nL = fiber length\nSnell's law:\nn sin φ = n' sin φ'\nDispersion coefft. Dλ= -{λo /c}(∂2n /∂λ2)λ= λo ps/km.nm\n\nσ t = σλ L Dλ\nPockels effect n = no - (1/2) r no\n3E n = refractive index, E = electric field, r = Pockels coefft.\nKerr effect\nn = no + λKE2\nK= Kerr coefft.\n\nMagnetism\ncurrent i in a wire produces field H = i/2 π r at radius r\nin free space\nB = μoH\n\nμo = 4π 10-7 Henry/m\ninside a material\nB = μo(H + M)\n\nor\n\nB = μo μrH\n\nμr = relative permeability\n\nor\n\nM = H(μr - 1)\n\nor\n\nM = χH\n\nχ = (μr - 1) = susceptibility\nOne electron has a moment of 1 μB (Bohr magneton) = 9.27 10-24 Am2\nIf spins make angle θ, exchange energy = A (1 - cos θ) where A is the exchange constant\n\nAnisotropy K\nUniaxial:\nE = Ku sin2 φ\nE = energy, φ = angle between M and easy axis\nCubic:\nE = K1 (cos2φ1cos2φ2 + cos2φ2cos2φ3 + cos2φ3cos2φ1) + higher order terms\nφi = angle between M and the i axis\nDomains\n\nwall width\nd = π\nA/2Ka (a = lattice parameter)\n\nwall energy\nEw = π 2AK /a\nThermal instability when KtotV < 25kT. (here V is the volume of the particle)\n\nMagnetostatic energy\n\nE = Kshape sin2 φ\n\nφ = angle between M and z axis\nwhere\n\nKshape = 0.5(Nx - Nz)Ms\nNi = demagnetizing factor along i axis\nThe field inside the object along the i axis due to its own magnetization is\n\nHd = -Ni Ms\n\nMs = saturation magnetization.\n\nInduction: current im through n turns of wire:\nH.dl = ni\n∫\nm\nInduced voltage\nV = -n' dφ/dt\nwhere φ = B.A (A = coil area), n' = number of\nturns of wire.\n\nIf a current i runs through a wire length l in a B field:\nForce F = Bil\nAnisotropic magnetoresistance\nR = Ro + ΔR cos2 θ; θ = angle between M and current\n\nPhysical Constants, Conversions, and Useful Combinations\n.\nFigure by MIT OCW.\n\nMagnetic materials\n\nTc/K\nBs/T\nHc / A/m\nμr\nFe\n2.2\n200,000\nFe-3%Si\n2.1\n40,000\na-FeBSi\n1.6\n100,000\nAlnico-5\n1.4\n64,000\nBaO.(Fe2O3)6\n0.4\n264,000\nSmCo5\n0.85\n600,000\nNd2Fe14B\n1.1\n890,000\n\nProperties\no\nf Si\n, Ga\nAs, SiO2, and Ge at 300 K\nFigure by MIT OCW."
    },
    {
      "category": "Exam",
      "title": "exam1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/4a21b572b1a1ffa9f3b08c94c0f89875_exam1_sol.pdf",
      "content": "2006 3.15 Exam 1\nProblem 1\nτ = 105s, D = 40cm2s-1\na.\nConcentration at x = 0: 1010/cm2s × 10\n4 /cm × 105s = 109/cm3 of photogener\nated carriers.\nTherefore:\np = 1018 + 1049 ≈ 1018cm-3 at surface\nn = 102 + 1049 ≈ 1090cm-3 at surface\nL =\n√\nDt =\np\n40 × 10-5 = 2\n√\n10-4cm or 0.02cm = 200μm\nb.\n\ndn\ndn\ndn\ndn\ndn\n=\n+\n+\n+\n= 0 at steady state\ndt\ndt drift\ndt diff\ndt thermalRG\ndt otherRG\ndn\ndn\n= 0 no ,\n= 0 except near surface\ndt drift\ndt otherRG\ndn\ndn\n=\n+\ndt diff\ndt thermal\nd2nD + -(n - np)\n=\ndx2\nτ\n-(n - np) = excess carrier concentration\nτ\nd2n = (n - np) gives the variation in n(x)\n⇒ dx2\nDτ\nThis has a solution:\n-x\n-x\n(n - np) = n(x = 0) exp √\nDt\n= 109 exp √\nDt\nc.\nThe Si is thinner than L, so the concentration of electrons does not drop off\nvery much as we go into the Si. It has dropped to exp - 1 ) = 0.6 of its initial\nvalue so on average the electron concentration is somewhere between 0.6 × 109\nand 1.11/cm3 .\nInitially: n = 102 , p = 1018 .\nWith light: n ≈ 0.8 × 109 , p = 1018 .\n0 = e(nμn + pμp) ∝ (n + p) if μ are the same.\nRatio is\n-109 + 1018\n102 + 1018\n≈ 1\nThe change is insignificant.\n\nProblem 2\na.\nThe EB jn is fwd biased\nlarge diffusion currents flow.\n⇒\nDiffusion current of holes from E\nB\n→\nDiffusion current of electrons from B\nE\n→\nMagnitude of hole current = NAE >> 1 by design.\ne current\nNDB\nIEC\nCurrent Gainβ = IEB\nIEB has 3 components: the diffusion current of electrons across BE, the drift\nof electrons from CB and a recombination current. In practice, the first term is\nlargest.\n⇒ IEC\nIEB\n= NAE\nNDB\nusually ≈ 100 or so.\nb.\nSaturated ⇒ both jns in fwd bias.\n\nLarge currents flow from E to B and from C to B. The current exits at B.\n\nProblem 3\nInSb\nEg = 0.2\nμn = 80000 cm2/Vs, m∗\nn = 0.001mo, NC = 1018cm-3\nμp = 750 cm2/Vs, mn\n∗ = 0.1mo, NC = 1019cm-3\na.\nn 2\n= NC NV exp(-Eg /kT )\ni\n0.2\n= 10181019 exp - 0.0258\n=\n4.3 1033\n·\nni = 6.5 1016cm-3\n·\nσ = (nμn+pμp)e = 1.6 10-19 ×(1018 ×80000+4.3 1015 ×750) = 1.3 104Ω-1cm-1\n·\n·\n·\nHere p = ni2/No = 4.3 1033/1018 = 4.3 1015cm-3.\n·\n·\nb.\ngc vaires more rapidly than gv because m∗\nn is smaller.\ngc(E (m∗\nn) 2 √\nE\n∝\n\nm∗\nEi\n= (midpoint) + kT ln\np\nm∗n\n= (midpoint) + 4 × 0.0258 ln 100\n=\n0.09eV\nIt is at 0.1 + 0.09 = 0.19 eV above Ev (near Ec).\nc.\nElectron currents and hole currents only in the depletion region. No net current."
    },
    {
      "category": "Exam",
      "title": "exam1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/25f98313bbef069af6e3bc968f8c77b9_exam1.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2006\n\nExam 1 (3 pages)\nClosed book exam. Formulae and data are on the last 2 pages of the exam.\nThis takes 80 min and there are 80 points total. Be brief in your answers and use sketches.\n\nAssume everything is at 300K unless otherwise noted.\n\n1. A thick slab of Si (p-type, NA = 1018 cm-3), is illuminated on one side with light. The light\ncreates an extra 1010 electron-hole pairs cm-2 s-1 in the top 1 μm of the Si. The lifetime of the\ncarriers is 10-5 s, and their diffusivity can be taken as 40 cm2 s-1 (neglect the difference between\nelectrons and holes).\n\na) Draw a plot of both p and n vs. distance x into the Si, as accurately as you can. You should\ncalculate the concentrations at the surface. [10]\n\nb) For the electrons, derive a steady-state expression that shows how their concentration varies\nwith distance into the Si, explaining your reasoning. [10]\n\nc) Suppose the Si is only 100 μm thick. Is there a significant change in conductivity due to the\nlight? Justify your answer with a calculation or estimate. [10]\n\n2. a) For a BJT in forward active mode, explain concisely what factor(s) determine the current\ngain β, and why. (3-4 sentences) [10]\n\nb) The BJT is now biased so that it is in the saturated mode. Draw a band structure of the biased\nBJT (assume it is pnp) and explain what is going on at each junction and where the current flows\nin the device. (3-4 sentences) [10]\n\n3. InSb is a semiconductor with a band gap of 0.2 eV and mobilities of 80,000 cm2 V-1 s-1 for\nelectrons and 750 cm2 V-1 s-1 for holes. The effective masses are 0.001mo for electrons and 0.1mo\nfor holes. Nc = 1018 cm-3 and Nv = 1019 cm-3.\n\na) What intrinsic carrier concentration would you expect in undoped InSb? For doped InSb\n(with ND = 1018 cm-3) what conductivity would you expect? [10]\n\nb) Draw a plot of density of states vs energy (with the energy axis vertical), indicating\nquantitatively where the Fermi energy is. Show schematically the occupation of the intrinsic\nelectrons and holes on this plot. [10]\n\nc) You now make a pn junction between n-type InSb and p-type Si. Draw a sketch of what the\nband structure might look like at equilibrium and show where there are diffusion and drift\ncurrents. [10]\n\nP\nroperties of Si, G\naAs, SiO2,\na\nnd G\ne at\n300 K.\nPhysical Constants, Conversions, and Useful Combinations\n.\n\nUseful equations\n\ngc (E) dE = mn*√{2mn*(E - Ec)} / (π2h3)\n\n(h = h-bar)\n\ngv (E) dE = mp*√{2mp*(Ev - E)} / (π2h3)\n\nf(E) = 1/ {1 + exp (E - Ef)/kT }\n\nn = ni exp (Ef - Ei)/kT,\np = ni exp (Ei - Ef)/kT\n\nni = Nc exp (Ei - Ec)/kT where Nc = 2{2πmn*kT/h2}3/2\nor\nni = Nv exp (Ev - Ei)/kT where Nv = 2{2πmp*kT/h2}3/2\nnp = ni\n2 at equilibrium\n\nni\n2 = Nc Nv exp (Ev - Ec)/kT = Nc Nv exp (-Eg)/kT\n\nEi = (Ev + Ec)/2 + 3/4 kT ln (mp*/ mn*)\n\nEf - Ei = kT ln (n/ ni) = - kT ln (p/ ni)\n\n~ kT ln (ND / ni) ntype or - kT ln (NA / ni) ptype\n\nDrift: thermal velocity\n\n1/2 mv2\nthermal = 3/2 kT\ndrift velocity\n\nvd = μE\nE = field\nCurrent density (electrons)\n\nJ = n e vd\nCurrent density (electrons & holes)\nJ = e (n μn + p μh)E\nConductivity\n\nσ = J/E = e (n μn + p μh)\nDiffusion\n\nJ = eDn ∇n + eDp ∇p\nEinstein relation:\n\nDn/μn = kT/e\nR and G\n\nR = G = rnp = r ni\n2 at equilibrium\n\ndn/dt = dn/dtdrift + dn/dtdiffn + dn/dtthermal RG + dn/dtother RG\nFick's law dn/dtdiffn = 1/e ∇Jdiffn = Dnd2n/dx2\n\nso\ndn/dt = (1/e) ∇{Jdrift + Jdiffn} + G - R\ndn/dtthermal = - nl/τn or dp/dtthermal = - pl/τp\nτn = 1/rNA, or τp = 1/rND\n\nLn = √τnDn, or Lp = √τpDp.\nIf traps dominate τ = 1/r2NT where r2 >> r\n\npn junction\nE = 1/εoεr ∫ ρ(x) dx where ρ = e(p - n + ND - NA)\nE = -dV/dx\neVo = (Ef - Ei)n-type - (Ef - Ei)p-type\n\n= kT/e ln (nn/np) or kT/e ln (NAND/ni\n2)\n\nE = NAe dp/εoεr = NDe dp/εoεr at x = 0\nVo = (e /2εoεr ) (NDdn\n2 + NAdp\n2)\ndn = √{(2εoεrVo/e) (NA/(ND(ND + NA))}\nd = dp + dn = √{(2εoεr(Vo + VA)/e) (ND + NA)/ NAND}\n\nJ = Jo{exp eVA/kT - 1} where Jo = eni\n2 {Dp/NDLp + Dn/NALn}\nTransistor\nBJT gain β = IC /IB ~ I\nB\nE /IB\nB\n\nIE = (eDp/w) (ni\n2/ND,B) exp(eVEB/kT)"
    },
    {
      "category": "Exam",
      "title": "quiz1_2006_qns.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/562c0b3fc836aff066a4040b1b57506c_quiz1_2006_qns.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.033\n17 October 2006\nQuiz 1\nName: (Last, First)\n(please print).\nRecitation number (circle one):\n- Record all answers and show all work in this exam booklet. If you need extra space, use the back\nof the opposing page.\n- All scratch paper must be handed in with the exam, but will not be graded.\n- No materials besides pencils and erasers are allowed (no calculators, notes, books, pets, etc.)\n- Whenever possible, try to solve problems using general analytic expressions. Plug in numbers only\nas a last step.\n- Please make sure to answer all sub-questions.\nGood luck!\n-\nProblem\nMax\nGrade\nGrader\nTotal\n\nQuestion 1: Quick answers\n[25 Points]\n(a). (4 pts) Professor F. Ishy claims to have discovered a new force of magnitude F = A|r1 + r2|\nbetween protons, where r1 and r2 are the position vectors of the protons and A is a constant\nthat he's trying to get named in his honor.\n(A) Is this force translationally invariant? YES / NO (circle one)\n(B) Is this force invariant under rotations around r = 0? YES / NO (circle one)\n(b). (4 pts) Professor C. Rank claims that a charge at (r1, t1) will contribute to the air pressure\nat (r2, t2) by an amount B sin[C(|r2 - r1|2 - c2|t2 - t1|2)], where B and C are constants.\n(A) Is this effect Galilean invariant? YES / NO (circle one)\n(B) Is this effect Lorentz invariant? YES / NO (circle one)\n(c). (1 pt) To 1 significant figure, the speed of light in meters/second is\n(d). (2 pts) From which two postulates did Einstein derive special relativity?\n(e). (11 pts) Indicate whether each of the following statements are true of false.\n(A) The proper length of a ruler is Lorentz invariant. TRUE / FALSE (circle one)\n(B) The wave equation is Galilean invariant. TRUE / FALSE (circle one)\n(C) The kinetic energy of a particle is Lorentz invariant. TRUE / FALSE (circle one)\n(D) The acceleration of a particle is Galilean invariant. TRUE / FALSE (circle one)\n(E) A ping-pong ball moving near the speed of light still looks spherical.\nTRUE / FALSE (circle one)\n(F) X-rays travel faster than microwaves. TRUE / FALSE (circle one)\n(G) If you could send a signal faster than light, then there's a frame where you could send a\nsignal backward in time. TRUE / FALSE (circle one)\n(H) If two twins are reunited, who is oldest may be frame-dependent.\nTRUE / FALSE (circle one)\n(I) No experiment inside an isolated sealed lab in space can determine its orientation.\nTRUE / FALSE (circle one)\n(J) No experiment inside an isolated sealed lab in space can determine its velocity.\nTRUE / FALSE (circle one)\n(K) No experiment inside an isolated sealed lab in space can determine its acceleration.\nTRUE / FALSE (circle one)\n(f). (3 pts) List three pieces of observational evidence supporting special relativity.\n\np\nQuestion 2: Pole Vaulter Deluxe\n[25 Points]\nYour goal in this problem is to completely fill out the table below.\nS (Chris)\nS0 (Zoe)\nS00 (Train)\nxB\nctB\nxC\nctC\nTo save time, note that all three frames have the same spacetime origin (at event A) and that\nthere is no need to draw spacetime diagrams.\n(a). (2 pts) Based on the text below, fill in the entries corresponding to XB and X0 in the table\nC\nabove (no calculation needed!). Chris is standing next to a barn taking measurements as Zoe\nruns through the barn in the x-direction holding a pole horizontally in the direction of motion.\nIn Zoe's frame S0, the pole has length L, the event when the rear of the pole is aligned with\nthe entrance to the barn is X0\nA = (x0\nA\nA, ct0 ) = (0, 0), and the location of the front of the pole\nat that same time is X0 = (L, 0). In Chris' frame S, Zoe is running at speed β1, the rear of\nC\nthe pole is aligned with the entrance to the barn (event A) at XA = (xA, ctA) = (0, 0), and\nthe front of the pole is aligned with the barn exit (event B) at XB = (xB , ctB ) = (L/γ1, 0),\nwhere γ1 = 1/ 1 - β1\n2 .\n(b). (7 pts) Compute X0 and XC and fill in the corresponding entries in the table above.\nB\n(c). (8 pts) A train with the rest of the 8.033 students passes by, and Chris measures its speed\nto be β2 in the x-direction. The train's frame S00 is aligned such that X00 = (0, 0). Compute\nA\nX00 and X00 in terms of L, γ1, β1, γ2, and β2, and fill in the corresponding entries in the\nB\nC\ntable above.\n(d). (4 pts) Show that for β2 = 0, the students on the train agree with Chris.\n(e). (4 pts) Show that for β2 = β1 the students on the train agree with Zoe.\n\nZ\n\np\nQuestion 3: Variational calculus: Newton's second law modified\n[25 Points]\nFor a particle of rest mass m0 in a potential V (x), show that out of all trajectories x(t) between\ntwo events A and B, the one maximizing the quantity\ntB\nV (x)\n+\ndt\nγ\nm0c2\ntA\nsatisfies the relation\nd (m0γx ) = -V 0(x)\ndt\n(the relativistic version of Newton's second law). Here γ ≡ 1/ 1 - x 2/c2, x ≡ dx/dt and V 0 =\ndV/dx.\n\nQuestion 4: Relativistic Red Sox\n[25 Points]\nIn a parallel universe, the Boston team made the playoffs.\n(a). (6 pts) Manny Relativirez hits the ball and starts running towards first base at speed β.\nHow fast is he running, given that he sees third base 45* to his left (as opposed to straight\nto his left before he started running)? Assume that he is still very close to home plate.\n(b). (7 pts) A player standing on third base is wearing red socks emitting light of wavelenght\nλred. What wavelength does Manny see? What color are the socks according to Manny, in\nthe approximation that λgreen = λred/21/4 , λblue = λred/\n√\n2, λviolet = λred/\n√\n3?\n(c). (5 pts) In Manny's frame, the ball is moving with speed c/\n√\n2 towards first base. How fast\nis it going in the rest frame of the stadium?\n(d). (5 pts) Later in the game, a squabble erupts. An outfielder catches a fly ball at (xA, yA, zA, ctA) =\n(50m, 40m, 2m, cT ) (event A) and Manny starts to run from second base at (xB , yB , zB , ctB ) =\n(30m, 30m, 0, 0) (event B), where cT = 30m, which corresponds to T ≈ 90 nanoseconds. The\noutfielder claims that Manny is out by virtue of running too soon, whereas Manny claims\nthat B preceded A is his frame. You are are the umpire and must settle this.\nCompute the spacetime interval between A and B and indicate whether it is (circle one)\nTIMELIKE / SPACELIKE / NULL\n(e). (2 pts) Is Manny correct? YES / NO / DEPENDS ON HIS VELOCITY (circle one)\nIn one sentence, why?"
    },
    {
      "category": "Exam",
      "title": "quiz1_2006_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/8ade761622b4926ba9346d6e0c44d50f_quiz1_2006_sol.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Physics\nPhysics 8.033\n17 October 2006\nQuiz 1\nName: (Last, First)\n(please print).\nRecitation number (circle one):\n- Record all answers and show all work in this exam booklet. If you need extra space, use the back\nof the opposing page.\n- All scratch paper must be handed in with the exam, but will not be graded.\n- No materials besides pencils and erasers are allowed (no calculators, notes, books, pets, etc.)\n- Whenever possible, try to solve problems using general analytic expressions. Plug in numbers only\nas a last step.\n- Please make sure to answer all sub-questions.\nGood luck!\n-\nProblem\nMax\nGrade\nGrader\nTotal\n\nQuestion 1: Quick answers\n[25 Points]\n(a). (4 pts) Professor F. Ishy claims to have discovered a new force of magnitude F = A|r1 + r2|\nbetween protons, where r1 and r2 are the position vectors of the protons and A is a constant\nthat he's trying to get named in his honor.\n(A) Is this force translationally invariant? YES / NO (circle one) No\n(B) Is this force invariant under rotations around r = 0? YES / NO (circle one) Yes\n(b). (4 pts) Professor C. Rank claims that a charge at (r1, t1) will contribute to the air pressure\nat (r2, t2) by an amount B sin[C(|r2 - r1|2 - c2|t2 - t1|2)], where B and C are constants.\n(A) Is this effect Galilean invariant? YES / NO (circle one) No\n(B) Is this effect Lorentz invariant? YES / NO (circle one) Yes\n(c). (1 pt) To 1 significant figure, the speed of light in meters/second is\nc =\n3 × 108 m/s\n(d). (2 pts) From which two postulates did Einstein derive special relativity?\n(a) Laws of physics must be valid in all intertial frames (b) The speed of light is a constant,\nindependent of observer\n(e). (11 pts) Indicate whether each of the following statements are true of false.\n(A) The proper length of a ruler is Lorentz invariant. TRUE / FALSE (circle one) True\n(B) The wave equation is Galilean invariant. TRUE / FALSE (circle one) False\n(C) The kinetic energy of a particle is Lorentz invariant. TRUE / FALSE (circle one) False\n(D) The acceleration of a particle is Galilean invariant. TRUE / FALSE (circle one) True\n(E) A ping-pong ball moving near the speed of light still looks spherical.\nTRUE / FALSE (circle one) True\n(F) X-rays travel faster than microwaves. TRUE / FALSE (circle one) False\n(G) If you could send a signal faster than light, then there's a frame where you could send a\nsignal backward in time. TRUE / FALSE (circle one) True\n(H) If two twins are reunited, who is oldest may be frame-dependent.\nTRUE / FALSE (circle one) False\n(I) No experiment inside an isolated sealed lab in space can determine its orientation.\nTRUE / FALSE (circle one) True\n(J) No experiment inside an isolated sealed lab in space can determine its velocity.\nTRUE / FALSE (circle one) True\n(K) No experiment inside an isolated sealed lab in space can determine its acceleration.\nTRUE / FALSE (circle one) False\n(f). (3 pts) List three pieces of observational evidence supporting special relativity.\nCosmic\nray muons, atomic bombs, GPS measuring time slowdown\n\np\nQuestion 2: Pole Vaulter Deluxe\n[25 Points]\nYour goal in this problem is to completely fill out the table below.\nS (Chris)\nS0 (Zoe)\nS00 (Train)\nxB\nL/γ1\nL\nLγ2/γ1\nctB\n-β1L\n-γ2β2L/γ1\nxC\nγ1L\nL\nγ1γ2L(1 - β1β2)\nctC\nγ1β1L\nγ1γ2L(β1 - β2)\nTo save time, note that all three frames have the same spacetime origin (at event A) and that\nthere is no need to draw spacetime diagrams.\n(a). (2 pts) Based on the text below, fill in the entries corresponding to XB and X0 in the table\nC\nabove (no calculation needed!). Chris is standing next to a barn taking measurements as Zoe\nruns through the barn in the x-direction holding a pole horizontally in the direction of motion.\nIn Zoe's frame S0, the pole has length L, the event when the rear of the pole is aligned with\nthe entrance to the barn is X0 = (x0\n) = (0, 0), and the location of the front of the pole\nA, ct0\nA\nA\nat that same time is X0 = (L, 0). In Chris' frame S, Zoe is running at speed β1, the rear of\nC\nthe pole is aligned with the entrance to the barn (event A) at XA = (xA, ctA) = (0, 0), and\nthe front of the pole is aligned with the barn exit (event B) at XB = (xB , ctB ) = (L/γ1, 0),\nwhere γ1 = 1/ 1 - β1\n2 .\n(b). (7 pts) Compute X0 and XC and fill in the corresponding entries in the table above.\nB\nx0 = γ1(xB - β1ctB ) = γ1L/γ1 = L\nB\nct0 = γ1(ctB - β1xB ) = -γ1β1L/γ1\nB\n= -β1L\nxC = γ1(x0 + β1ct0 ) = γ1L (Note inverse transform from S0 to S)\nC\nC\nctC = γ1(ct0 + β1x0 ) = γ1β1L (Note inverse transform from S0 to S)\nC\nC\n(c). (8 pts) A train with the rest of the 8.033 students passes by, and Chris measures its speed\nto be β2 in the x-direction. The train's frame S00 is aligned such that X00 = (0, 0). Compute\nA\nX00 and X00 in terms of L, γ1, β1, γ2, and β2, and fill in the corresponding entries in the\nB\nC\ntable above.\nThe trick here is to transform all events from the S frame to the S00 frame\nx00 = γ2(xB - β2ctB ) = γ2L/γ1\nB\nct00 = γ2(ctB - β2xB ) = -γ2β2L/γ1\nB\nx00 = γ2(xC - β2ctC ) = γ2(γ1L - β2γ1β1L) = γ1γ2L(1 - β1β2)\nC\nct00 = γ2(ctC - β2xC ) = γ2(-γ1β1L - β2γ1L) = γ1γ2L(β1 - β2)\nC\n(d). (4 pts) Show that for β2 = 0, the students on the train agree with Chris.\nβ2 = 0, γ2 = 1\nx00 = L/γ1\nB\nct00 = 0\nB\nx00 = γ1L\nC\nct00 = γ1β1L\nC\n(e). (4 pts) Show that for β2 = β1 the students on the train agree with Zoe.\nβ2 = β1, γ2 = γ1\nx00 = γ1L/γ1 = L\nB\nct00 = -γ1β1L/γ1\nB\n= -β1L\nx00 = γ1\n2L(1 - β1\n2) = L\nC\nct00 = γ1\n2L(β1 - β1) = 0\nC\n\nZ\n\np\nh\ni\nQuestion 3: Variational calculus: Newton's second law modified\n[25 Points]\nFor a particle of rest mass m0 in a potential V (x), show that out of all trajectories x(t) between\ntwo events A and B, the one maximizing the quantity\ntB\nV (x)\n+\ndt\nγ\nm0c2\ntA\nsatisfies the relation\nd (m0γx ) = -V 0(x)\ndt\n(the relativistic version of Newton's second law). Here γ ≡ 1/ 1 - x 2/c2, x ≡ dx/dt and V 0 =\ndV/dx.\nSolution: L(x) =\nγ + V (x)\nm0c2 . The Euler-Lagrange equation implies\n\nd\ndt\n∂L\n∂ x - ∂L\n∂x\n= 0\n(3.1)\n\"\n#\n⇒ d\ndt\nm0c2\np\n1 - x2/c2\nx\nc2\n\"\n+ ∂V\n∂x\n#\n= 0\n(3.2)\n⇒ d\ndt\nm0v\np\n1 - x2/c2\n= - dV\ndx\n(3.3)\n\np\nQuestion 4: Relativistic Red Sox\n[25 Points]\nIn a parallel universe, the Boston team made the playoffs.\n(a). (6 pts) Manny Relativirez hits the ball and starts running towards first base at speed β.\nHow fast is he running, given that he sees third base 45* to his left (as opposed to straight\nto his left before he started running)? Assume that he is still very close to home plate.\nUsing the aberration formula with cos θ0 = -1/\n√\n2, β = 1/\n√\n(b). (7 pts) A player standing on third base is wearing red socks emitting light of wavelenght\nλred. What wavelength does Manny see? What color are the socks according to Manny, in\nthe approximation that λgreen = λred/21/4 , λblue = λred/\n√\n2, λviolet = λred/\n√\n3?\nUsing the doppler shift formula, λ0 = λ/\n√\n(c). (5 pts) In Manny's frame, the ball is moving with speed c/\n√\n2 towards first base. How fast\nis it going in the rest frame of the stadium?\nUsing the relativistic velocity addition formula, β =\n8/9\n(d). (5 pts) Later in the game, a squabble erupts. An outfielder catches a fly ball at (xA, yA, zA, ctA) =\n(50m, 40m, 2m, cT ) (event A) and Manny starts to run from second base at (xB , yB , zB , ctB ) =\n(30m, 30m, 0, 0) (event B), where cT = 30m, which corresponds to T ≈ 90 nanoseconds. The\noutfielder claims that Manny is out by virtue of running too soon, whereas Manny claims\nthat B preceded A is his frame. You are are the umpire and must settle this. Compute the\nspacetime interval between A and B and indicate whether it is (circle one) TIMELIKE /\nSPACELIKE / NULL\nThe interval is timelike since Δt2 > Δr2 .\n(e). (2 pts) Is Manny correct? YES / NO / DEPENDS ON HIS VELOCITY (circle one)\nIn one sentence, why?\nNo, because there's no relativity of simulatneity for time like seperations."
    },
    {
      "category": "Exam",
      "title": "sample_exam1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/9ee5c104e24b7fa15902c8b2f1ddba83_sample_exam1.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2005\nExam 1 (4 pages)\nClosed book exam. Formulae and data are on the last 2.5 pages of the exam.\nThis takes 80 min and there are 80 points total. Be brief in your answers and use sketches.\nAssume everything is at 300K unless otherwise noted.\n1. [20 points]\na) Draw sketches showing gc(E), gv(E), f(E) and the carrier distributions for a semiconductor that\nis (i) intrinsic, (ii) n-type. (make the sketches with the E axis vertical.) [6]\nb) Germanium has the same crystal structure as silicon but its band gap is 0.67 eV.If the total\ndensity of states in the conduction band (Nc) and in the valence band (Nv) are the same as\nthey are for silicon, what value of ni would you expect for Ge at 300K? [6]\nc) The Ge is now doped with B and with P. Both dopants have the same concentration. Assume\nthe B and P energy levels are each 40 meV from the band edge. If mn*/mp* = 0.01, draw\nthe band diagram of the doped Ge as accurately as you can, showing Eg, Ef and Ei.\n[6]\nd) What electrical conductivity do you expect for the material in (c) compared to undoped Ge,\nand why? [2]\n2. [30 points]\na) For a pn junction, draw the electron and hole concentrations vs distance outside the depletion\nregion in the case of no bias, forward bias, and reverse bias, explaining briefly the shapes\nof the graphs. (2-3 sentences) [10]\nb) Estimate the voltage you would need to apply to cause avalanche breakdown in a Si pn\njunction with ND in the n-side = NA in the p-side = 1015 cm -3. Assume that avalanche\nbreakdown occurs at a field of 105 V cm-1, and state any other assumptions you make.\n[20]\n3. [30 points]\na) What factors affect the mobility of a carrier? (2-3 sentences) [6]\nb) A piece of p-type Si with NA = 1018 cm -3 and a length of 1 cm is heated at one end. This affects\nthe value of ni as follows:\n\nHot\nCold\nni = 1012 cm -3\nni = 1010 cm -3\nConsider only the electrons in the Si, neglecting the motion of the holes. Where do drift and\ndiffusion of the electrons occur? Estimate the electric field at the cold end of the Si. [16]\nc) A BJT can be used to detect light by allowing the light to fall on the base region. How could\nyou bias the two junctions in the BJT to get a good response to light? For your biasing scheme,\ndraw the band structure and explain where the current(s) flow. [8]\nProperties of Si,\nGaAs, SiO2\n,\nand\nGe a\nt 300 K.\n\nPhysical Constants, Conversions, and Useful Combinations\n.\nFigure by MIT OCW.\n\nUseful equations\ngc (E) dE = mn*√{2mn*(E - Ec)} / (π2h3)\n(h = h-bar)\ngv (E) dE = mp*√{2mp*(Ev - E)} / (π2h3)\nf(E) = 1/ {1 + exp (E - Ef)/kT }\nn = ni exp (Ef - Ei)/kT,\np = ni exp (Ei - Ef)/kT\nni = Nc exp (Ei - Ec)/kT where Nc = 2{2πmn*kT/h2}3/2\nnp = ni\n2 at equilibrium\nni\n2 = Nc Nv exp (Ev - Ec)/kT = Nc Nv exp (-Eg)/kT\nEi = (Ev + Ec)/2 + 3/4 kT ln (mp*/ mn*)\nEf - Ei = kT ln (n/ ni) = - kT ln (p/ ni)\n~ kT ln (ND / ni) ntype or - kT ln (NA / ni) ptype\nDrift: thermal velocity\n1/2 mv2\nthermal = 3/2 kT\ndrift velocity\nvd = μE\nE = field\nCurrent density (electrons)\nJ = n e vd\nCurrent density (electrons & holes)\nJ = e (n μn + p μh)E\nConductivity\nσ = J/E = e (n μn + p μh)\nDiffusion\nJ = eDn ∇n + eDp ∇p\nEinstein relation:\nDn/μn = kT/e\nR and G\nR = G = rnp = r ni\n2 at equilibrium\ndn/dt = dn/dtdrift + dn/dtdiffn + dn/dtthermal RG + dn/dtother RG\nFick's law dn/dtdiffn = 1/e ∇Jdiffn = Dnd2n/dx2\nso\ndn/dt = (1/e) ∇{Jdrift + Jdiffn} + G - R\ndn/dtthermal = - nl/τn\nor dp/dtthermal = - pl/τp\nτn = 1/rNA, or τp = 1/rND\nn = √τnDn, or p = √τpDp.\nIf traps dominate τ = 1/r2NT where r2 >> r\npn junction\nE = 1/εoεr ∫ρ(x) dx where ρ = e(p - n + ND - NA)\nE = -dV/dx\neVo = (Ef - Ei)n-type - (Ef - Ei)p-type\n= kT/e ln (nn/np) or kT/e ln (NAND/ni\n2)\nE = NAe dp/εoεr = NDe dp/εoεr\nat x = 0\nVo = (e /2εoεr ) (NDdn\n2 + NAdp\n2)\ndn = √{(2εoεrVo/e) (NA/(ND(ND + NA))}\nd = dp + dn = √{(2εoεr(Vo + VA)/e) (ND + NA)/ NAND}\nJ = Jo{exp eVA/kT - 1} where Jo = eni\n2 {Dp/ND p + Dn/NA n}\nTransistor\nBJT gain β = IC /IB ~ IE /IB = NA,E / ND,B\nIE = (eDp/w) (ni\n2/ND,B) exp(eVEB/kT)\nJFET\nVSD, sat = (eNDt2/8εoεr) - (Vo + VG)"
    },
    {
      "category": "Exam",
      "title": "sample_exam1sols.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/ab3fc7bf17fe0bc0a202de4327241fde_sample_exam1sols.pdf",
      "content": "p\nSample Exam 1 - Solutions\nProblem 1\na.\ni.\nii.\nb.\nni =\np\nNcNv exp -Eg\n2kT\nFor Si: ni = 1010cm3 , Eg = 1.12eV\nTherefore:\nNcNv\n= 1010 exp(1.12/2 × 0.0258)\n=\n2.167 × 1019cm-3\nFor Ge: ni\n=\n2.167 × 1019 exp -(0.67/2 × 0.0258)\n=\n6.1 × 1013cm-3\n\nThis is 6000 times larger because band gap is smaller.\nc. This is compensated (donors and acceptors cancel). Since NA = ND,\nEf = Ei, and n = p = ni. Difference between Ei and midgap:\nEi\n= midgap + 3\n4kT ln m∗\np\nm∗n\n=\n4 × 0.0256 ln 100\n= 89 meV\nd. Lower because compenstated material's dopants scatter carriers, lowering\nmobility.\n\nProblem 2\nProblem 1\na.\n**FIGURE**\nForward Bias: e- injected into p side, leads to high e concentration near de\npletion region, decays away with characteristic length Ln (10s of μm) slight\nreduction of electron concentrtion near depletion region of n side.\nReverse Bias: e collected from p side, pins n = 0. (Very slight increase in n on\nthe n side.)\nb.\nBreakdown: in depletion region = 105V/cm.\nAssume depletion approximation: if ND = NA, dn = dp.\nMax = NAedp or NDedn\nEDER\nEDER\n2EDERV0\nNA\nWe know: dn =\ne\nND(NA + ND)\nand\nkT\nNAND\n1015 1015\nV0 =\nln\n= 0.0258 ln\n·\ne\nni\nSo:\ndn\n=\n2 × 1.05 · 10-12 × 0.59\n1.6 10-19\n× 1015(2.5 × 1015)\n·\n=\n6.2 × 10-5cm or 0.6μm\nTherefore:\n\nq\nr\n= NDedn = 1015 × 1.6 · 10-19 × 6 · 10-5\n= 0.9 104V/cm\nEDEr\n1.05 10-12\n·\n·\nFor breakdown, applying voltage VA extends the depletion region, and raises .\ndn increases by a factor of\nV0+VA and so does .\nV\nIf avalanche occurs at 105 V/cm:\nV0 + VA\n=\n0.9 × 104\nV0\nV0 + VA = 72.8V\nSo reverse bias of ≈72V is needed for breakdown.\nc.\nWe collect carriers in reverse bias pn jn so we might bias both jns in reverse.\nThen any holes produced in base will go across either EB or BC jn, depending\non which direction they go. A large hole current flows into E and C from B.\nElectrons flow out of the base contact. IB ∝ light intensity. (In fact it would\nwork even without bias.)\nNote: Putting EB in fwd bias means a large current already flows through E\nC,\nso the light-generated carriers would not add much to this.\n→\n\n=\nProblem 3\na.\nAs T increases, μ decreases\nAs doping level increases, μ decreases\nAs lattice defects increase, μ decreases\nAll since greater scattering μ = eτ . Also, μ is lower for heavier carriers.\nm∗\nb.\np type: p = NA = 1018cm-3 for both temperatures. Fully ionized.\nHot End: n = 105cm-3 = ni\n2/NA\nCold End: n = 102cm-3\nSo we have diffusion of electrons until the electric field balances the concentra\ntion gradient. Neglect hole diff.\nThermal R & G occurs everywhere, but more carriers at hot end.\ndn\nJn = eDn\n= enμn at steady state. Diffusion = Drift.\ndx\nConcentration Gradient = 106 - 102\ncm-3 ≈ 106cm-4\n1cm\nSubstitute:\nDn = kT μn/e\ndn\nTherefore, kT μn\n= enμn\ndx\nkT dn\nen dx\n\nAt the hot end:\nn = 106cm-3, = kT\n106cm-4\n= kT = 0.026V/cm\ne · 106cm-3\ne\nAt the cold end:\nn = 102cm-3, = 260V/cm.\nd.\nWe collect carriers in reverse bias pn jn so we might bias both jns in reverse.\nThen any holes produced in base will go across either EB or BC jn, depending\non which direction they go. A large hole current flows into E and C from B.\nElectrons flow out of the base contact. IB ∝ light intensity. (In fact it would\nwork even without bias.)\nNote: Putting EB in fwd bias means a large current already flows through E\nC, so the light-generated carriers would not add much to this.\n→"
    },
    {
      "category": "Exam",
      "title": "exam2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/3ed5c907e64d5733eb48976d1f8cffba_exam2_sol.pdf",
      "content": "3.15 Exam 2 - 2006\nProblem 1\na.\nGate at zero volts: as VD becomes positive it puts the junctions into fwd bias\nlarge current flows to D.\n→\nFor negative VD, junctions are in reverse bias, can get pinch-off.\nb.\nA positive VG puts the jn in to reverse bias initially, so it doesn't take as much\nnegative VD to cause pinchoff. At some threshold VG the channel pinches off.\nA negative VG forward biases the jns to it takes more negative VD to cause\npinchoff. This will also increase current flow to drain for positive VD.\n\nFor positive VG, if we have a positive VD it will counteract the VG and current\nwill flow.\nc.\n- Easier to fabricate - channel width formed by inversion, not lithography.\n- Uses the Si-Si)2 interface which is well controlled.\n- Lower power use - by combining the p & n channel device get CMOS\nwhich is very low power.\nCan make MOS-capacitor at same time\nDRAM.\n-\n⇒\n\nProblem 2\na.\nPhosphor absorbs UV light and re-emits the energy at a wavelength determined\nby composition of phosphor. For example:\nBlue: ZnS + Ag\nGreen: (Zn,Cd)S + Cu\nRed: H2O2S + Eu, Tb\nThese are ≈ 1 μm particles. To get white, mix all three together at appropriate\nratios.\nb.\nFor exciting the blue phosphor, we need something with bandgap in near UV.\nFor example:\nZnS (3.6 eV)\nuse a Si substrate or ZnS. Blue = 460 nm = -2.7 eV.\n→\nThe only other options are MnSe or MnTe based materials which would be\ngrown as a heterostructure on MnSe or InP substrates for the MnSe laser or\nMnTe substrate for the MnTe heterostructure.\nWe can also use GaN - not shown on plot, but it grows on Al2O3 with 3.4 eV\nband gap.\nc.\nUse p-i-n structure: i material has lower gap.\nfwd bias: e enter potential well from n-side; holes from p side. They are trapped\n\nand must recombine.\nLED: width ≈ 1.8 kT (20 nm in red) due to excitons, fermi distribution.\nLaser: width few nm since amplification only of center frequencies.\nBoth show modes (2d = Nλ with N an integer.)\nd.\n0.1 mm laser\nonly get light output when v = cN/2d, (c = vλ)\nλ = 2d/N.\n⇒\n⇒\nIf we have eg 3 eV laser light, λ = 410 nm, then for 2d = 200 μm = 2 10-4m\n·\n= 2 105nm so N ≈ 487.8.\n·\nSo we will get modes like:\nN\nλ\n410.6 nm\n409.8 nm\n408.9 nm\nModes separated by about 0.9 nm in wavelength.\nWe probably get only a few modes because the output is typically only a few\nnm wide for a laser diode.\n\nProblem 3\na.\nI\nV\nPower (W)\n-9\n8.5\n10.5\n7.5\nbest\n←\nb.\nV = I(Rpv + RL)\n(Rpv + RL) =\n= 1.6Ω\nRL = 1.4Ω\n7.5\n⇒\nNote: This is a very low resistance so you can't connect any device across it\nyou have a large current, small voltage; possibly use to charge a battery, etc.\nc.\nFor a Si Cell: Antireflective coating on top surface. Dimples on top surface by\netching. Reflective lower surface. Transparent top contacts or make them as\nnarrow as practical. Mirrors to reflect light onto solar cell.\nNon-Si Cells: use multiple band gaps to get much higher efficiency.\nd.\nA Si has direct gap because carrier momentum is not well defined. This is\nbecause carriers are localized by the nonuniformities in the structure which\ngives a non-flat energy landscape. Since their position is determined (to some\nextent) then momentum has a nonzero uncertainty (δxδp ≥ h) and it is possible\nfor a direct absorption process to occur."
    },
    {
      "category": "Exam",
      "title": "exam2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/1706b27b379ef2b9ba9322d269887963_exam2.pdf",
      "content": "3.15 Electrical, Optical, and Magnetic Materials and Devices\nCaroline A. Ross\nFall Term, 2006\n\nExam 2 (6 pages)\nClosed book exam. Formulae and data are on the last 4 pages of the exam.\nThis takes 80 min and there are 80 points total. Be brief in your answers and use sketches.\nAssume everything is at 300K unless otherwise noted.\n\n1. [25 points] A JFET is constructed like this: the two gate regions are n+ and the rest of the\nmaterial is p type.\n\nn+\n\nSource\n\np\n\nDrain\n\nn+\n\nGate\na) Assume that the source is grounded (at zero volts). Draw a sketch of how the current ID\nflowing out of the drain varies with voltage VD when the gate is at zero volts. Consider\nboth positive and negative values of VD and explain the shape of your graph. (3-4\nsentences) [9]\n\nb) Now draw another sketch showing again ID vs. VD but this time draw different graphs\ncorresponding to different values of gate voltage VG (both positive and negative). Explain\nbriefly how gate voltage affects the I-V plot. [10]\n\nc) Give three reasons why a MOSFET is preferable to a JFET. [6]\n\n2. [33 points] In one of the problem sets we considered two ways of making white light using an\nLED. Here we will consider a third method. In this new scheme, the device looks like\nthis:\n\ncup coated inside with\nphosphor\n\nLED\ncontacts to the LED\n\na) What is the purpose of the phosphor-coated cup in this device? Explain how you can get white\nlight. [6]\n\nb) What color LED would you use? Choose a possible material and substrate for the LED,\nexplaining your choice. [7] (some of the data at the end of the exam may be helpful)\n\nc) Draw a possible band structure for your LED, in the unbiased case, and explain how bias\naffects the band structure. [7]\n\nd) Explain concisely the differences between the spectral output of an LED, such as the one you\njust drew, compared with a semiconductor laser. [6]\n\ne) If your LED is only 0.1 mm long, how does this affect its output? [7]\n\n3. [22 points] We are designing a photovoltaic system. The solar cell we have available\nproduces an output as shown below: its internal resistance is 0.2 ohms.\n\na) Estimate the maximum power we can produce from the solar cell. [6]\n-4 0 4 8 12 16 20 Voltage (V)\nCurrent (A)\n\n-4\n\n-8\n\n-12\n\nb) What load resistance would you use to maximize the output power? [4]\n\nc) Mention three methods to improve the efficiency of a solar cell. (1 sentence each). [6]\n\nd) Solar cells can be made from amorphous silicon, and are commonly used in devices such as\ncalculators. Explain the reason for using amorphous Si in place of crystal Si (3-4\nsentences). [6]\n\nData and Formulae\nE\nnerg\ny G\nap a\nnd Latti\nce Con\nstants.\nBan\nd Ga\np En\nerg\nies\nof\na I\nI-VI\nC\nom\npou\nnd a\nnd A\nlloy\nSem\nicon\nduct\nors.\n\nUseful equations\n\ngc (E) dE = mn*√{2mn*(E - Ec)} / (π2h3)\n\n(h = h-bar)\n\ngv (E) dE = mp*√{2mp*(Ev - E)} / (π2h3)\n\nf(E) = 1/ {1 + exp (E - Ef)/kT }\n\nn = ni exp (Ef - Ei)/kT,\np = ni exp (Ei - Ef)/kT\n\nni = Nc exp (Ei - Ec)/kT where Nc = 2{2πmn*kT/h2}3/2\nnp = ni\n2 at equilibrium\n\nni\n2 = Nc Nv exp (Ev - Ec)/kT = Nc Nv exp (-Eg)/kT\n\nEi = (Ev + Ec)/2 + 3/4 kT ln (mp*/ mn*)\n\nEf - Ei = kT ln (n/ ni) = - kT ln (p/ ni)\n\n~ kT ln (ND / ni) ntype or - kT ln (NA / ni) ptype\n\nDrift: thermal velocity\n\n1/2 mv2\nthermal = 3/2 kT\ndrift velocity\n\nvd = μE\nE = field\nCurrent density (electrons)\n\nJ = n e vd\nCurrent density (electrons & holes) J = e (n μn + p μh)E\nConductivity\n\nσ = J/E = e (n μn + p μh)\nDiffusion\n\nJ = eDn ∇n + eDp ∇p\nEinstein relation:\n\nDn/μn = kT/e\nR and G\n\nR = G = rnp = r ni\nat equilibrium\n\ndn/dt = dn/dtdrift + dn/dtdiffn + dn/dtthermal RG + dn/dtother RG\nFick's law\ndn/dtdiffn = 1/e ∇Jdiffn = Dnd2n/dx2\n\nso\ndn/dt = (1/e) ∇{Jdrift + Jdiffn} + G - R\ndn/dtthermal = - nl/τn or dp/dtthermal = - pl/τp\nτn = 1/rNA, or τp = 1/rND\n\nLn = √τnDn, or Lp = √τpDp.\nIf traps dominate τ = 1/r2NT where r2 >> r\nProperties\no\nf Si\n, Ga\nAs, SiO2, and Ge at 300 K.\n\npn junction\nE = 1/εoεr ∫ ρ(x) dx\nwhere ρ = e(p - n + ND - NA)\nE = -dV/dx\neVo = (Ef - Ei)n-type - (Ef - Ei)p-type\n\n= kT/e ln (nn/np) or kT/e ln (NAND/ni\n2)\n\nE = NAe dp/εoεr = NDe dp/εoεr at x = 0\nVo = (e /2εoεr ) (NDdn\n2 + NAdp\n2)\ndn = √{(2εoεrVo/e) (NA/(ND(ND + NA))}\nd = dp + dn = √{(2εoεr(Vo + VA)/e) (ND + NA)/ NAND}\n\nJ = Jo{exp eVA/kT - 1} where Jo = eni\n2 {Dp/NDLp + Dn/NALn}\nTransistor\nBJT gain β = IC /IB ~ I\nB\nE /IB = NA,E / ND,B\n\nIE = (eDp/w) (ni\n2/ND,B) exp(eVEB/kT)\nJFET\nVSD, sat = (eNDt2/8εoεr) - (Vo + VG)\n\nPhotodiode and photovoltaic\n\nI = Io + IG\n\nV = I (RPV + RL)\n\nI = Io{exp eV/kT - 1} + IG\nPower = IV\n\nWavelength\nλ(μm) = 1.24/Eg (eV)\n\nBand structure\n\nEffective mass:\nm* = =\n2(∂\n2E /∂k\n2)\n-1\n\nMomentum of an electron typically π/a ~ 1010 m-1\n\nMomentum of a photon = 2π/λ ~ 107 m-1\nUncertainly principle ΔxΔp ≥=\nLasers\nprobability of absorption = B13, stimulated emission = B31, spontaneous emission = A31\nN3 = N1 exp (-hν31 /kT)\nPlanck ρ(ν)dν = {8πhν3/c3 }/{exp (hν /kT) - 1} dν\n\nB13 = B31\nand\nA31/B31 = 8πhν3/c3\n(Einstein relations)\nCavity modes\nν = cN/2d, N an integer.\n\nFibers\nAttenuation (dB)\n= {10/L} log(Pin/Pout)\n\nL = fiber length\nSnell's law:\nn sin φ = n' sin φ'\nDispersion coefft. Dλ= -{λo /c}(∂2n /∂λ2)λ= λo ps/km.nm\n\nσ t = σλ L Dλ\n\nPhysical Constants, Conversions, and Useful Combinations\n."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/a3b94baf512eac5e3272b6f2f9b59467_lecture1.pdf",
      "content": "3.15\nCarrier Fundamentals\nC.A. Ross, Department of Materials Science and Engineering\nReference: Pierret, chapters 1-2.\nElectron and hole charge: e = 1.6 10-19 C\nEffective mass: m*, rest mass mo\nF = -eE = mo dv/dt\nin vacuum\nF = -eE = m* dv/dt\nin solid\nin Si, mn*/mo = 1.18, mh*/mo = 0.81 at 300K.\nIntrinsic properties\nin Si, n = p = 1010 cm -3 at 300K\nN = 5 1022 atoms cm-3\nExtrinsic properties\nDonors - group V\nAcceptors - group III\nB\nC\nN\nO\nAl\nSi\nP\nS\nGa\nGe\nAs\nSe\nIn\nSn\nSb\nTe\nTl\nPb\nBi\nPo\nBand diagrams: Ec = conduction band edge, Ev = valence band edge\nband gaps: Si\n1.12 eV\ndiamond\n5.4 eV\nsilica\n5 eV\nenergies of dopant levels, in meV, in silicon (kT = 26 meV @ 300K)\nP\nB\nAs\nAl\nGa\nHandout 1\n\nCarrier distributions (intrinsic)\ng(E) dE = density of electron states cm-3 in the interval (E, E+dE),\nunits #/eV.cm-3\ngc (E) dE = mn*√(2mn*(E - Ec)) / (π2\nh\nh\n) dE\ngv (E) dE = mp*√(2mp*(Ev - E)) / (π2\n3) dE\nIn these states, the electrons distribute according to Fermi function\nf(E) = 1/ {1 + exp (E - Ef)/kT }\nNumber of electrons in the interval (E, E+dE) is therefore f(E)g(E)dE.\nIn a doped semiconductor, the position of Ef with respect to the band gap\ndetermines whether there are more electrons or holes.\nTotal number of electrons: by integrating f(E)g(E)dE\nn = ni exp (Ef - Ei)/kT\np = ni exp (Ei - Ef)/kT\nwhere\nni = Nc exp (Ei - Ec)/kT\nNc = 2{2πmn*kT/h2}3/2 = 'effective density of conduction band states'\nEi is the position of the Fermi level in the intrinsic case.\nSimilarly for Nv.\nHence\nnp = ni\n2 at equilibrium\nni\n2 = Nc Nv exp (Ev - Ec)/kT = Nc Nv exp (-Eg)/kT\nIntrinsic case:\nEi = (Ev + Ec)/2 + 3/4 kT ln (mp*/ mn*)\nIn a doped material, where n ~ ND or p ~ NA\nEf - Ei = kT ln (n/ ni) = - kT ln (p/ ni)\n~ kT ln (ND / ni) or - kT ln (NA / ni)\nn-type\np-type\nHandout 1\n\nMayer and\nLau,\nElectronic\nMaterials\nScience\nHandout 1\nEner\ngy\nGap\nand Latt\nice Co\nnstants.\nProperties\no\nf Si\n, Ga\nAs, SiO2, and Ge at 300 K.\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nPhysical Constants, Conversions,\nand Useful Combinations.\n1 weber/m2 = lo4 gauss = 1 tesla\n1 pascal = 1 N/m2 = 7.5 X\ntorr\n1 erg = 10-'joule = 1 dyn-cm\nFigure by MIT OCW."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/b04f645a60771cb6e553fa9f612254a9_lecture2.pdf",
      "content": "3.15\nCarrier Drift, Diffusion and R&G\nC.A. Ross, Department of Materials Science and Engineering\nReference: Pierret, chapter 3.\nElectron and holes can drift, diffuse, and undergo generation and\nrecombination (R&G).\nDrift:\nthermal velocity\n1/2 mv2\nthermal = 3/2 kT\ndrift velocity,\nvd = μE\n(μ = mobility, E = field)\nCurrent density (electrons)\nJ = n e vd\nCurrent density (electrons & holes)\nJ = e (n μn + p μh)E\nConductivity\nσ = J/E = e (n μn + p μh)\nMagnitude of mobility (cm\nμn\nμh\nSi\nGe\nAg\n-\nGaAs\n2/Vs)\nTime between collisions is τ\nμ = eτ/m*\nDistance between collisions is l\nl = τvthermal\nDiffusion\nJ = eDn ∇n + eDp ∇p\nDerivation of the Einstein relation:\nDn/μn = kT/e\ntypical Dn in Si is 40 cm2/s\nCarrier R&G\nMechanisms:\nband-to-band (direct)\nRG centers or traps (indirect)\nThermal R and G\nat equilibrium: R = G\nexpect\nR = G = rnp = r ni\nr = rate constant\nHandout 2\n\nShining light, etc. on the semiconductor causes additional R. These excess\ncarriers nl and pl (nl = pl )decay once the light is turned off.\nIlluminated: n-type material\nn = ND + nl\n~ ND\np = ni\n2/ND + pl\n~ pl\nnet rate of change of carriers = R - G = rnp - r ni\nthe rate of recombination of the minority carriers is\n-dp/dt = r(NDp - ni\n2)\nbut ni\n2 = ND(p - pl )\n-dp/dt = rND(p - p + pl) = rNDpl\nThis has a solution pl = pl, t=0 exp (-t/τp), where τp = 1/rND = minority carrier\nlifetime.\nExample of Carrier Action - Formal solution\nA piece of p-type Si is illuminated at one end; how does the carrier\nconcentration vary with depth x?\ndn/dt = dn/dtdrift + dn/dtdiffn + dn/dtthermal RG + dn/dtother RG\n= 0 at steady state\nn = np + nl\nwhere np = ni\n2/NA\nInside the material there is only thermal R&G:\nGthermal = rni\n2 = r np NA\nRthermal = rnp ~ r nl NA\nR - G = r NA(nl - np) ~ r NAnl = nl/τn\nIn the steady state,\ndn/dt = dn/dtdiffn - (R - G) = 0\ndn/dt = 1/e ∇Jdiffn - (R - G) = 0\nd2nl /dx2 = nl /τnDn\n(since dn/dtdiffn = 1/e ∇Jdiffn = Dnd2n/dx2 from Fick's law)\nsolution:\nnl = nl, x=0 exp (-x/√τnDn )\nGenerally, if excess carrier concentrations are written as nl or pl, then\ndn/dtthermal = - nl/τn\nor dp/dtthermal = - pl/τp\nMinority carrier lifetimes are τn = 1/rNA, or τp = 1/rND,\nMinority carrier diffusion lengths are λn = √τnDn, or λp = √τpDp.\nIf traps dominate the recombination, then τ = 1/r2NT where r2 >> r\nHandout 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4_5_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/7cc1e94191cd88d82d1385eeac20bb98_lecture4_5_6.pdf",
      "content": "3.15\npn Junctions\nC.A. Ross, Department of Materials Science and Engineering\nReference: Pierret, chapter 5-6.\nUnbiased (equilibrium) pn junction\nImagine an abrupt pn junction. The p side has a high hole concentration and\nthe n side has a high electron concentration.\nThere is immediate diffusion of the carriers down the concentration\ngradient.\nThis leaves a space charge due to the ionized dopants. The resulting electric\nfield leads to drift of carriers in the opposite direction compared to the\ndiffusion flux.\nAt equilibrium the drift and diffusion currents are balanced.\np type\nn type\nelectron drift\nelectron diffusion\nEc\nEf\nEi\nhole drift\nhole diffusion\nEv\n+ve\ndp\n-ve\ncharge density ρ\np type\nND\nn type\ndn\ndistance x\nNA\nGauss' law E = 1/εoεr ∫ρ(x) dx\nwhere ρ = e(p - n + ND - NA)\nEnergy (i.e. position of energy bands) = eV; can be found from voltage vs\ndistance; calculate from E = -dV/dx\nDepletion region width d = dp + dn (some books use d = xp + xn)\nBuilt-in voltage Vo: from earlier,\nn = ni exp (Ef - Ei)/kT\nHandout 3\n\np = ni exp (Ei - Ef)/kT\nThe Fermi level is flat across the junction:\neVo = (Ef - Ei)n-type - (Ef - Ei)p-type\n= kT/e ln (nn/np) or kT/e ln (NAND/ni\n2)\nUsing the depletion approximation ρ = - NAe in the p-type and NDe in the n-\ntype:\nE = NAe dp/εoεr = NDe dp/εoεr\nat x = 0\nVo = (e /2εoεr ) (NDdn\n2 + NAdp\n2)\ndn = √{(2εoεrVo/e) (NA/(ND(ND + NA))}\nd = dp + dn = √{(2εoεrVo/e) (ND + NA)/ NAND}\nBiased pn junction (apply voltage VA)\nForward bias raises the n-side energy levels (or lowers the p-side)\nby applying -ve to the n-side (or +ve to p-side)\nThis reduces the voltage barrier. The quasi-Fermi level is higher on the n-\nside.\nThe diffusion term changes because the number of carriers eligible to diffuse\nincreases exponentially.\nThe drift term does not change.\nOutside the depletion region there is a net diffusion current.\nReverse bias lowers the n-side energy levels.\nDiffusion is reduced; drift is unchanged. Only a small reverse current flows.\nReverse bias increases the depletion width\nd = √{(2εoεr(Vo + VA)/e) (ND + NA)/ NAND}\nThe ideal diode equation\nIn forward bias the diffusion flux increases because more carriers are able to\ndiffuse. This comes from the Fermi function. When Ef is away from the band\nedge,\nf(E) = 1/ {1 + exp (E - Ef)/kT } ~ exp -(E - Ef)/kT\nIf we shift the energy levels by VA, we change the available number of\ncarriers by a factor\n{exp -(e(Vo - VA) - Ef)/kT} / {exp -(eVo - Ef)/kT}\n= exp eVA/kT\nHandout 3\n\nTherefore diffusion flux Jdiff = Jo exp eVA/kT\nTo evaluate Jo, we know that Jo = -Jdrift = Jdiff at VA = 0.\nConsider an asymmetric junction with NA >> ND, then the current is mainly\nholes, and their concentration decays in the n-type material (outside the\ndepletion region) over a distance λp = √(τpDp). The diffusion current\nJdiff = eDp ∇p = eDp (pn(x=0) - pno)/ λp\n(where pno = ni\n2 /ND)\n~ eDp (pn(x=0))/ λp\npn = pp exp -eVo/kT (unbiased)\nand pn = pp exp -e(Vo-VA)/kT (forward biased)\nso pn = pno exp -eVA/kT\nHence Jdiff = {eDp ni\n2 /NDλp} exp -eVA/kT = Jo exp eVA/kT\nInclude both electron and hole terms: Jo = eni\n2 {Dp/NDλp + Dn/NAλn}\nAlso, Jdrift = Jo gives an expression for Jdrift\nThe ideal diode equation is then\nJ = Jdiff + Jdrift = Jo {exp eVA/kT - 1}\nWhat happens in reverse bias? The current reaches a reverse saturation value\nof Jo (~10-12 A cm-2 in Si)\nAll minority carriers reaching the depletion region are sucked across (i.e. the\njunction 'collects' minority carriers). There is no diffusion flux across the\ndepletion region. There is a diffusion flux outside the depletion region that\nsupplies minority carriers to the junction: its value is just -eni\n2 { pnoDp/λp +\nnpo Dn/λn} = - Jo.\nReverse bias pn junction collects minority carriers\nForward bias pn junction injects minority carriers\nNon-idealities:\na) Reverse bias Zener breakdown, where carriers tunnel through a narrow\ndepletion width\nb) Avalanche diode, where impact ionization generates more carriers in the\ndepletion region.\nHandout 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/5d3ca8e27b90844252ee7d300b5c9c89_lecture7.pdf",
      "content": "3.15\nTransistors\nC.A. Ross, Department of Materials Science and Engineering\nReference: Pierret, chapter 10, 15.1-2, 16.1-2 and 17.1.\nTransistors are three-terminal devices that use a small voltage (or current)\napplied to one contact to modulate (i.e. control) a large voltage (or current)\nbetween the other two contacts.\nAn analogy is the vacuum tube from the 1900s. A small voltage applied to\nthe 'grid' modulates a large current between the anode and cathode.\nThe bipolar junction transistor\nThe BJT (1947) is a minority carrier device\nEmitter\np+\np\nCollector\nn\nBase\nFour modes (forward active, reverse active, saturation, cutoff)\nForward active operation (pnp transistor)\nThe emitter E emits minority carriers into the base B: EB is forward biased\nHoles survive their journey through the base\nThe collector C collects minority carriers from the base B: BC is reverse\nbiased.\nA small voltage (or current) at B has a large effect on the current IE\nIB << IE ~ IC\nw\nquasi-EF\np+\nn\np\nE\nB\nC\nholes injected\nholes collected\nHandout 4\n\nForward current IE\nAt the edge of the depletion region at the left of the base,\np = (ni\n2/ND,B) exp(eVEB/kT)\nAt the right of the base, p = 0\nCurrent across base IE = (eDp/w) (ni\n2/ND,B) exp(eVEB/kT)\nBase current IB\nThe base current << collector current, so most current goes straight through\nfrom E to C.\nCurrent gain α = IC /IE ~ 1, β = IC /IB ~ 100 - 1000\nIB = In (electrons going from B to E in forward bias)\n+ InC (electrons going from C to B in reverse bias -small)\n+ eRB (recombination in base -small)\nThe gain β = IC /IB ~ IE /IB = NA,E / ND,B is determined by doping.\n'Common base' circuit: by setting VEB and IE we control VCB and IC\n'Common emitter' circuit: by setting VEB and IB we control VEC and IC\nDigital logic: make the transistor act like a switch by running between\nsaturation and cutoff.\nJunction Field Effect Transistor\nApply a reverse voltage to gate G. This makes the depletion regions grow,\nalters the n-channel width and therefore alters its resistance, which changes\nthe source-drain voltage (for constant current). This is a voltage amplifier\nand also a majority carrier device.\np+\nS\nn\nD\nG\np+\nFor VG = 0 it is a linear resistor. However, applying VSD causes pinch-off\n(i.e. the depletion regions touch) and no more current ISD can flow.\nApplying a negative VG makes pinchoff occur earlier.\nBeyond pinchoff, a small change in VG causes a large change in VSD.\nFor depletion width d, channel length t, and initial channel width t,\nHandout 4\n\nat pinchoff,\nVSD, sat = (eNDt2/8εoεr) - (Vo + VG)\nMOS devices (metal - oxide - semiconductor)\nIdeal MOS bandstructure: where φ = χ s + (Ec - Ef), the Fermi level is flat\nwithout any band bending\nvacuum level Eo\nφ\nχs\nEc\nEf\nEv\nM\nO\nS (p-type)\nNegative voltage to the gate (i.e. to the metal) causes charge to accumulate\n(acts as a capacitor)\nSmall positive voltage to the gate causes charge to be depleted\nLarge positive voltage to the gate causes inversion: once all the mobile\ncarriers are depleted, carriers of the opposite sign are attracted to the region\nof the semiconductor next to the oxide. This creates a channel of opposite\ntype.\nMOSFET\nG\nS\nD\noxide\nn+\nn-channel\np-type substrate\nn+\ndepletion region\nSource and substrate are grounded. Applying a large positive VG creates an\nn-channel which conducts current between S and D.\nIf VD = 0, channel has uniform width.\nIf VD > 0, channel is thinner towards the D and may pinch-off; also the\ndepletion width is larger.\nAt pinch-off, the current ISD cannot increase any more.\nExample application: a DRAM (dynamic random access memory) stores one\nbit in a cell consisting of a MOSFET plus a MOS-capacitor. Opening the\nchannel of the MOSFET (by applying VG) allows the capacitor to be charged\nto represent '1' or uncharged for '0'.\nHandout 4\n\nHandout 4"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/1996e5617f952ee322c739d9e24f4ff9_lecture7b.pdf",
      "content": "3.15: Transistors in 'forward active' mode\nCommon base circuit Common base circuit.\nThis is the easiest to visualize, though of limited usefulness. We use one power supply to put EB\ninto forward bias (p side positive) and another one to put the BC into reverse bias (p side\nnegative). The figure is drawn for a pnp transistor.\nFirst, suppose we send a particular current IE into the emitter (IE is related of course to VEB).This\nis shown as a family of curved lines, each corresponding to a different IE. What happens as we\nvary VCB? We know that all of the IE current will be collected by the CB junction, provided that\nCB is in reverse bias. So the output, IC, is the same as the input IE for any value of reverse bias on\nCB, shown as the positive side of zero on the horizontal axis. In fact, CB will collect all of IE\neven if CB is unbiased, due to the built-in voltage. So the output does not start to drop until we\nstart to put forward bias onto CB, which prevents the collection of IE (shown at the negative side\nof zero on the horizontal axis).\nSuppose now we fix the voltage VCB (dotted vertical line). This puts a fixed reverse bias onto CB.\nCB collects all of IE so the output IC is just equal to the input IE. This does not provide any\namplification.\nCommon emitter circuit\nThis is a more useful circuit because it gives amplification (the previous circuit did not amplify,\nbecause the output IC was the same as the input IE). Suppose we connect one input power supply\nthat sends a current IB between the base and the emitter. The polarity is chosen so that EB is in\nforward bias. We connect another power supply between E and C (this is chosen to make sure BC\nis in reverse bias).\nThe base current IB is primarily composed of electrons that contribute to the forward current\nthrough EB. In the EB junction, there is a relation between the forward currents of holes and of\nelectrons. These currents are in the ratios of the doping levels of the sides of the junction. If E is\ndoped more heavily than B, a small electron current through EB implies that there is a large hole\ncurrent through EB. This hole current is collected by the reverse biased BC junction, and flows\nthrough to make up the output current IC. Therefore, a given IB leads to a much larger IC, with a\ngain of typically around 100 (that is, the ratio of doping levels in E and B). So to use this as a\ncurrent amplifier, set a fixed VEC (vertical dotted line), input IB and you will produce an\namplified output IC.\nC. Ross/ 3.15\nC\no\nm\nmon b\nase cir\ncuit.\nCommon\ne\nm\ni\ntter circ\nuit.\nFigure by MIT OCW.\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "ho9_magnetic_fund.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/7009df3d9c177d5865038f9d6a3377f4_ho9_magnetic_fundamentals.pdf",
      "content": "3.15 Magnetic Fundamentals\nC.A. Ross, DMSE, MIT\nReferences:\nJiles, Introduction to Magnetism and Magnetic Materials\nMagnetic quantities and units\nH = magnetic field, A/m -represents energy gradient, or torque on a dipole\nB = magnetic flux density, T or Wb/m\n-number of magnetic field lines per unit area\nM = magnetization, A/m -the magnetic moment, the response of a material to a field.\nH comes from a current: current i produces tangential field H = i/2 π r at radius r\nor from a magnetic material.\nB depends on H: in free space\nB = μoH\nμo = 4π 10-7 Henry/m\nbut inside a material\nB = μo(H + M)\nor\nB = μo μrH\nμr = relative permeability\nor\nM = H(μr- 1)\nor\nM = χH\nχ = (μr - 1) = susceptibility\nM and B both indicate how a material responds to a field H. Lines of B are continuous.\nNote the same relation expressed in cgs units:\nB (Gauss) = H (Oersted) + 4πM (emu/cc)\nwhere\n1 Oe = (1000/4π) A/m = 79.6 A/m\n1 G = 10\n-4\nT\n1 emu/cc = 1 kA/m\nDifferent types of materials\nDiamagnet: atom has no net magnetic moment, but a field induces a small moment opposite\nto the field. Susceptibility is negative (μr <1)\nParamagnet: atoms have a net moment but the spin directions are randomly arranged. An\napplied field can give weak alignment, hence a small susceptibility that varies with 1/T.\n(μr>1)\nFerromagnets have spontaneous magnetization, a large permeability which depends\non the history of the sample, and nonlinear, hysteretic behavior.\nOrigin of magnetic behavior\nAngular momentum of electrons produces magnetization due to moving charges.\nMagnetization comes from 1) electron spin, 2) electron orbital motion.\nContributions from paired electrons cancel out, so strong magnetic effects are found in\nmaterials with unpaired electrons.\nOne electron has a moment of 1 μBB (Bohr magneton) = 9.27 10\n-24\nAm\nStern-Gerlach and Zeeman experiments indicate the quantization of the magnetization in\natoms.\nWe expect large magnetic effects in transition metals (unfilled 3d) and rare earths (unfilled\n4f) because these can have a large net spin.\nHandout 9\n\ne.g.\nFe\n3+\nhas 3d\n: expect 5 μB per atom (neglecting orbital contributions)\nFe has 4s23d\n: in the metal, because of the way the s and d hybridize,\nthe structure is actually 4s0.95 3d7.05 with 4.62 spin-up and 2.42 spin-\ndown electrons, giving a net 2.2μB\nFerromagnets have spontaneous ordering of the spins in neighboring atoms due to\nexchange coupling. If spins make angle θ,\nexchange energy = A (1 - cos θ)\nwhere A is the exchange constant, e.g. 1.4 10\n-20\nJ for Fe\nNegative A gives antiparallel alignment: material is antiferromagnetic or ferrimagnetic.\nAbove the Curie temperature Tc, the spins are disordered, so kTc ~ A. (770 C for Fe)\nIn ferro/ferrimagnets, aligned spins form domains which usually point in different\ndirections, giving no net moment to the sample. However, the domains can be oriented (i.e.\nthe domain walls can be moved) by a relatively small field giving a large net moment, so\nthe permeability is very high. The shape of the M-H curve is hysteretic; important loop\nparameters include\narea within the curve (the energy expended as the field is cycled back and forth)\nsaturation magnetization (the magnetization in a large field)\nremanence (the magnetization remaining at zero field)\ncoercivity (field needed to bring the magnetization to zero).\nAnisotropy and Domains\nMagnetic energy consists of the following terms:\nexchange energy (minimise by having all spins parallel)\nmagnetostatic energy (minimise by having domains pointing in different directions so\nthere is no external field)\nZeeman energy (potential energy due to an external magnetic field, E = M.H)\nmagnetocrystalline energy (lower if the magnetization is pointing in certain\ncrystallographic directions, eg the c-axis in Co)\nDomain structures form to minimise energy. Domains are typically microns or larger;\ndomain wall widths ~ 100 nm.\nMagnetocrystalline anisotropy represents the energy needed to 'pull' the magnetization\naway from the preferred (easy) axis.\ne.g.\nCo K = 4.1 10\nJ/m\nuniaxial, [0001] is easy\nu\nFe K1 = 4.8 10\nJ/m\ncubic, <100> is easy\nNi K1 = -4.5 10\nJ/m\ncubic, <111> is easy\nUniaxial: energy E = K sin\nφ\nφ = angle between M and easy axis\nu\nCubic: E = K1 (cos\nφ1 cos\nφ2+ cos\nφ2 cos\nφ3 + cos\nφ3cos\nφ1) + higher order terms\nφi = angle between M and the i axis\nDomain wall width is determined by a balance between exchange (favors wide walls) and\nmagnetocrystalline anisotropy (favors narrow walls). (a = lattice parameter)\nHandout 9\n\nd =π\nwall width\nwall energy\nE w\nFor small enough particles it is not worth establishing a wall because the savings in\nmagnetostatic energy are less than the wall energy. These are 'single domain' particles.\nVery small particles are thermally unstable because the net magnetic energy\nKtotV < 25kT. (here V is the volume of the particle)\nMagnetostatic energy (a.k.a. self-energy or demagnetizing energy)\nThe energy in the field surrounding the magnetized object depends on the way the object is\nmagnetized. For instance, a long thin object has less magnetostatic energy if it is magnetized\nalong its length, compared to across its length. This can be expressed in the same way as a\nuniaxial anisotropy: if the long axis is z and the short axis is x then\nE = Kshape sin\nφ\nφ = angle between M and z axis\nwhere\nKshape = 0.5(Nx - Nz)Ms\nThe Ns are called demagnetizing factors and depend on the shape of the object. For instance\nfor an infinite cylinder with length in the z direction, N = 0 and N = N = 0.5.\nz\nx\ny\nThe field inside the object along the i axis due to its own magnetization is\nHd = -Ni M\nM = saturation magnetization.\ns\ns\nHard and soft materials\nIn a soft material, walls are easy to nucleate (low energy, i.e. low A and magnetocrystalline\nanisotropy) and move (few pinning sites), magnetization is easy to rotate (low\nmagnetocrystalline anisotropy). Hard materials have opposite properties: high energy walls,\npinning sites, high anisotropy, often made of single-domain particles.\nHandout 9"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/110ed969f7442b8ed4f4ff7a8e3d9026_lecture9.pdf",
      "content": "3.15\nPhotoconductors, Photovoltaics and Photodetectors\nC.A. Ross, Department of Materials Science and Engineering\nReference: Pierret, chapter 9.2 and 9.3\nPhotoconductors - conductivity a function of light\nPhotovoltaics - generate power from light\nPhotodetectors - use a pn junction to detect light\nPhotoconducting materials:\nCdS, ZnS for camera lightmeters, amorphous As,Se,Te for photocopiers\nPhotodiode and Photovoltaic (PV):\nCarriers created within Ln or Lp of junction contribute to reverse current:\nI = Io + IG\nPhotodiode operates in reverse bias. A PIN diode has a wide depletion\nregion; operates much faster than a pn junction photodetector because it\ndoesn not rely on diffusion.\nA PV operates in the fourth quadrant (positive V, negative I). When\nconnected to a load (e.g. a battery charger or a lightbulb) with resistance RL,\nV = I (RPV + RL)\nalso I = Io (exp(eV/kT) - 1) + IG\nthese two relations define the voltage and current that the PV produces.\nPower = IV\nSolar Cells: the PV must respond to the visible spectrum (400 - 700 nm,\nor 2 - 3 eV; note that l (mm) = 1.24/E (eV))\nIdeally we would use a bandgap of about 1.2 eV, but Si does not absorb light\nwell because it has an indirect band gap.\nDirect and indirect gap\nOn an E-k plot:\nm* = h\n2(∂2 E /∂k 2)-1\nMomentum of an electron typically p/a ~ 1010 m-1\nMomentum of a photon = 2p/l ~ 107 m-1\nIf the band gap is indirect, a phonon plus a photon are eeded to make an e-h\npair, so light absorption (and emission) is less efficient.\nAmorphous Si: uncertainly principle DxDp ≥ h\n-the localization of carriers gives them an uncertain momentum, so direct\nabsorption of light can occur. Use PIN design because mobility is low.\nHandout 5\n\nHandout 5\nScanned article removed due to copyright restrictions.\nPlease See \"This Month in Physics History, October 22, 1938: Invention of Xerography.\" APS News 12 (2003): 2.\n\nHandout 5\nSolar Panel, voltage\nper ceASEll.\nFigure by MIT OCW."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture11_12_13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/b8c5e774bd8ce5038bd28b87da0d439b_lecture11_12_13.pdf",
      "content": "3.15\nLEDs and Lasers\nC.A. Ross, Department of Materials Science and Engineering\nReferences: Pierret Chapter 9.4, article on LEDs from MRS BulletinOct.\n2001 p764, and Solymar and Walsh chapter 12 for lasers\nLuminescence mechanisms\nCathodoluminescence (light from electron bombardment)\nZnS +Ag (blue), (Zn,Cd)S +Cu (green), Y2O2S +Eu,Tb (red)\nPhotoluminescence (light from UV irradiation)\nphosphors, TiO2\nElectroluminescence (light from electrical excitation)\nLED or semiconductor laser\nLEDs: recombine e+h at a pn junction in forward bias: direct or indirect\nband-to-band recombination, at a trap or impurity center, or at an exciton.\nColor is determined by the band gap. Changing the composition of III-V or\nII-VI materials controls the band gap. Lattice parameter is important because\nit determines how well the material grows on a substrate, i.e. how many\ndefects may be present.\nRed: direct gap (AlxGa1-x)As; for 670 nm (1.85 eV) use x = 0.5\nGreen: N-doped indirect gap GaP, where the N introduces a trap level,\nor direct gap (AlInGa)P\nBlue: indirect SiC,\nor direct InGaN or AlGaN, 450 nm (2.75 eV)\nIR: InGaAsP for 1.1 - 1.7 eV\nUse heterojunctions to minimize reabsorption of light.\nLasers (light amplification by stimulated emission of radiation), an optical\namplifier:\nprobability of absorption = B13\nprobability of stimulated emission (makes coherent light) = B31\nprobability of spontaneous emission = A31\nLight can be amplified if stimulated emission exceeds spontaneous emission\nIf N1 atoms are at energy level 1, N3 are at energy level 3, E31 = hν 31 is the\nenergy difference between levels 1 and 3, and ρ (ν 31)dν represents the\nHandout 6\n\nnumber of photons present with frequency ν in a spectral band of width dν\n(i.e. ρ(ν) is the photon energy density) then\nrate of photon absorption in range dν R13 = N1 B13 ρ (ν 31)dν\nrate of photon emission in range dν\nR31 = N3 B31 ρ (ν 31)dν + N3A31dν\nat equilibrium,\nR13 = R31\nalso\nN3 = N1 exp (-hν 31 /kT)\ntherefore\nρ (ν 31)dν = A31/{ B13 exp (hν 31 /kT) - B31 } dν\nPlanck's expression for black body radiation gives the photon energy\ndistribution, for all ν\nρ (ν )dν = {8π hν 3/c3 }/{exp (hν /kT) - 1} dν\nComparing the two expressions implies\nB13 = B31\n3/c3\nand\nA31/B31 = 8π hν\n\n(Einstein relations)\nUsually N3 < N1 so absorption occurs more often than spontaneous emission.\nTo make an amplifier, we need a population inversion, i.e. N3 > N1, to\nproduce a gain > 1. N3 > N1 ensures that stimulated emission exceeds\nabsorption.\ngain = number of photons produced per incident photon\n∝ (N3 - N1) B31 ρ (ν 31)dν\nGain exceeds 1 over a small range of wavelengths around ν 31.\nA population inversion can be produced in a three or four level system by\npumping atoms up to a high energy level, from which they slowly decay into\na lower level. Pumping requires a higher energy than hν 31.\nEnergy states in a Nd3+ atom in Nd:YAG laser make a 4-level system,\nwhich lases at 1.064μ m (IR)\nEnergy states in a Cr3+ atom in ruby laser make a 3-level system,\nwhich lases at 693nm (red)\nTo raise gain we also need to increase ρ (ν 31)dν which is done by confining\nthe light inside a cavity, length d; this ensures that stimulated emission\nexceeds spontaneous emission.\ncavity modes exist when ν = c/2Nd, N an integer.\nHandout 6\n\nSemiconductor lasers\nA p+n+ degenerate junction can give a population inversion (need more\nelectrons in conduction band than in valence band for population inversion).\nAt low forward bias it acts as a LED, but when the applied voltage >\nbandgap it can act as a laser.\nMore efficient to use a heterostructure to trap carriers in a small region. Note\nin heterostructures when bands join, there is a band offset (Δ E or Δ Ev).\nc\nexample: n-AlGaAs - GaAs - p-AlGaAs laser.\ne&h are injected into the GaAs region and cannot escape. Light is also\nconfined due to the difference in refractive index. Cavity is defined by\ncleaving the crystal. Cladding and active region need a good lattice match to\navoid defects.\nBlue lasers: ZnSSe cladding, CdZnSe active, or\nAlGaN cladding, GaInN active.\nHandout 6"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/39b18424818b1face2ad6579a915e34b_lecture14.pdf",
      "content": "3.15\nDisplays\nC.A. Ross, DMSE, MIT\nReferences: Braithwaite and Weaver chapter 6.4\nDisplays can work by\n-emitting light, eg.\nIncandescence (light from heating a filament)\nCathodoluminescence (light from electron bombardment)\nZnS +Ag (blue), (Zn,Cd)S +Cu (green), Y2O2S +Eu,Tb (red) -excited by three\n20kV electron guns in a TV screen\nPhotoluminescence (light from UV irradiation), eg anti-theft printing on banknotes, black\nlights, etc. Use phosphors, TiO2\nElectroluminescence (light from electrical excitation)\nLED or semiconductor laser\nPlasma emission (light from electrically excited plasma). Sodium light, Hg lamp, neon\ntube. In a plasma screen, a small UV plasma excites a phosphor, similar to a fluorescent\nlight.\n-or modulating light, e.g. liquid crystal display, electrooptic modulator, micromirror\narray, etc.\nLiquid crystal displays\nStiff, rod-shaped organic molecules such as cyanobiphenyls which can order in different\nways:\nNematic (lined up parallel)\nCholesteric (helical, also called a chiral nematic) -pitch of helix is a fraction of a micron\nSmectic (layered arrangements, 8 different types)\nOptical properties are different parallel vs perpendicular to the molecule. Polarizability is\nhigher parallel to the molecule. The complex refractive index, dominated by electronic\npolarizability, is higher parallel to the molecule, so light with electric field parallel to the\nmolecule is transmitted better.\nTwisted nematic display consists of\nPolarizer/ front plate with electrode pattern /grooved polymer / ~10 mm nematic +\ncholesteric / grooved polymer / back plate /polarizer / mirror\nThe grooved polymer sheets are oriented perpendicular to each other and guide the\nnematic into a slow 90 twist; light is transmitted. Appling a vertical electric field (eg 3V)\nbetween the front and back plates aligns the nematic and light can no longer pass, so the\ndisplay is dark. Colors come from dyes or filters. Response time limited by viscosity.\nElectrode patterns are made from thin film transistors (TFTs) made on glass - these use\na-Si to make the channel region, with p-type source and drain doped with Al, and a Cr\ngate. The drain is connected to a pixel made from ITO (indium tin oxide, a transparent\nconductor).\nHandout 7"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture15_16.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-15-electrical-optical-magnetic-materials-and-devices-fall-2006/1b318e5a5a7d1ba5a21d9ddf6edc5c63_lecture15_16.pdf",
      "content": "3.15\nOptical Fibers and Photonic Deviccs\nC.A. Ross, DMSE, MIT\nReferences:\nBraithwnite and Weaver chapter 6.4 (fibers)\nSanger. How fiber optics works, The Industrial Physicist pl8. FebIMar 2002\nSavage. Linking lvith Light, IEEE Spectrum p32. Aug. 2002\nSaleh and Teich, Furldamentals of' Photonics. Wiley 199 I . Sec 8.3 (fibers). 18.1\n(r lectrooptics)\nJirannopolis st al, Photonic crystals. Princeton 1995\nOptical Fibers\nFibers are made of silica, doped with boron oxide to lower refractive index; germanium\noxide raises refractive index. Two major factors limit optical fiber performance.\n(1) Loss\nA tte~iuation (dB) = { 10/L) log(P,,/P,,,)\n-\nL = fiber length\nThe ~nini~num\nfor silica is 0.15 dBIkni. or 3.5%' power lass per km.\nPoIy~rlers - I OdB/km.\nLoss in silica is due to Absorption:\n- electron transitions acrross band gap (8.9 eV, 140 nm light)\n- excitation of electrons within Si and 0 atoms (IR)\n- absorption by impurities such as tr.ansition metals, < 1 ppb (UV. visible light)\n- excitation of bonds such as 0-H (eg 1400 nm) or Si-0 (3000 nm light)\nand Rayleigh scattering, proportional to l/h4\n(2) Dispersion\nSnells law:\nn sin $ = n' sin 4'\nTotal internal reflection when angle of incidence exceeds $<: sin $, = n/n'\nFibers rely on total internal reflection, with a very small An. e.g.\ncore n = 1.53, cladding n = 1.50 gives $, = 78.6'\nStep index fibers can have rrtohl dispersion: different modes of light traveling at\ndifferent angles traverse different path lengths so get out of phase. Leads to spreading of\npulses. A graded index fiber can cure this proble~n, or use a single-mode fiber. (core < 3\nmicrons diameter)\nMaterials dispersion: different wavelengths have different refractive index;\ndispersion coefft. = -(Ao /c)(d2rr / J A ~ ) , , - ~\nps/km.nrn\nFor silica this is zero at 1300 nln wavelength.\n1Vavegscide dispersion: even if materials dispersion is negligible, [here is still a dispersion\nof different wavelen~th signals because each mode spends a different amount of' time in\nthe core and cladding. Con~pensating materials and waveguide dispersion at 1500 nm\nwavelength gives lhe op[irt~um performance.\nHandout S\n\nR/vr.~-linear\ndisper.sion occurs at high light intensities wl~ere the refractive index becomes\nintcrlsity-cleperlde~it. Finally, for birefringent materials there call be poIarization-\ndeyerldent dispersion.\nPhotonics\nRefers to an cntire optical system in which the flow of photons is controlled (similar to\n(\"electronics\"). Light is:\ngenerated (lasers or laser diodes)\ntransmitted (waveguides, or free-space optics)\nniodul,ltcd (switched or scanned using electrical, optical or acoustic devices)\namplified or t'~.equency-converted (non linear materials)\ndetcclcd (PIN diodes)\nExample: Comrnrlnicntion system\nLocal: inexpensive rnultimode fibers, directly modulated LEDs, typically 850 nm\nwaveletlgth.\nLong distance: loss and dispersion are important. Single mode fiber, distributed feedback\nlaser, external ~notlulation. amplifiers every 100 km, dispersion compensation. 40\n\\vnvelengths simultnneously around 1550 nm. 10 Gbit/sec x 40 channels, spaced 0.8 nm\napart (I00 GHz).\nLaser -> Attenwitor -> Modulator -> Multiplexer ->fiber with amplifiers -> Add/drop\nniulriplexer -> Demultiplexer -> Attenuator -> PIN diode\nAt present these arc discrete components, but work is ongoing to integrate them onto a\nchip, e,g, the OADM project at MIT's Microphotonics Center.\nIncrease data rate by combining lower data rate signals:\nDWDM (dense wavelength division multiplexing) - each data stream on a different\nwavelength - I Tbitlsec\n?'DM (time division multiplexing) - data streams combined on same wavelength. Limited\nto 10 Gbitls\nElecfroop~ical\nmodulator: use a Mach Zehnder interferometer. Voltage changes refractive\nindex via Pockels effect (na E) or Kerr effect (~ia\nE2)\nFiber arnplfier C-band (1530-1560 nm) is amplified by a Iaser made by adding Er to\nthe silica fiber. Pump using 980 nrn laser diode.\nSimilarly, the 1300 nm wavelength can be amplified using a Yr-doped fiber.\nFiber Brags grarirrgs: a fiber with a periodically varying refractive index. Acts as a\nnarrow-band filter, s.g. to pull out (drop) one channel from a fiber.\nCouplers: different wavelength channels can be added to the fiber by bringing another\nfiber (or waveguide) close, allowing light to couple between the fibers.\nThir~filt~~filtcr,\ne.5 a tantalum oxide/silica rnultilayer. By designing the multilayer. it\ncan have a photonic band gap containing a sharp rransrnissioll peak (i.e. it is reflective\nexcept for one frequency which it transmirs). These can be used in a demultiplexer.\nHandout 8\n, .."
    }
  ]
}