{
  "course_name": "Energy Economics",
  "course_description": "This course explores the theoretical and empirical perspectives on individual and industrial demand for energy, energy supply, energy markets, and public policies affecting energy markets. It discusses aspects of the oil, natural gas, electricity, and nuclear power sectors and examines energy tax, price regulation, deregulation, energy efficiency and policies for controlling emission.",
  "topics": [
    "Energy",
    "Electricity",
    "Fossil Fuels",
    "Nuclear",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Microeconomics",
    "Political Economy",
    "Public Administration",
    "Environmental Policy",
    "Energy",
    "Electricity",
    "Fossil Fuels",
    "Nuclear",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Economics",
    "Microeconomics",
    "Political Economy",
    "Public Administration",
    "Environmental Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nPrerequisite\n\n14.01 Principles of Microeconomics\nor an equivalent intermediate microeconomics course taken elsewhere.\n\nRequirements\n\nThere are three hours of lectures each week (Monday and Wednesday) and a one hour section (Friday). Two or three lectures will also be given during the section on Friday. For students taking the subject as 14.44 there will be a midterm examination and a final examination. For students taking the subject as 14.444 there will be extra readings and a separate required question on the midterm and the final exams. There will also be approximately five problem sets for all students. The course will have quite a bit of background reading and an understanding of some basic material not covered in 14.01 will be necessary and require additional work.\n\nOverview\n\nThis course is an energy economics course not a general energy policy course. It will cover a variety of theoretical and empirical topics related to energy demand, energy supply, energy prices, environmental consequences of energy consumption and production, and various public policies affecting energy demand, supply, prices, and environmental effects. It is a new course and, as a result, it will have an experimental character to it. We have developed a preliminary reading list but we consider it to be dynamic. We will be seeking feedback from the students taking the course to help us to make it better. There is no textbook for this course.\n\nEnrollment Restriction\n\nThe enrollment in the course is limited to 30 students. We have limited the enrollment primarily because this is a new course and we want to encourage active student participation and feedback to refine the content and general quality of the course. We feel that we can do so best if we limit the size of the class. During the first class we will ask you to complete a form that provides us with information about you and your background. If there is excess demand for the course we will apply a rationing system. First priority will be given to MIT undergraduates who have completed 14.01 and are scheduled to graduate in Spring 2007. We will then take a stratified random group of the students meeting the pre-requisites to fill the remaining slots. You will be notified by email as to whether you can take the course.\n\nAcademic Honesty\n\nWe expect each student to complete his or her assignments and exams independently. If group work is permitted for specific assignments you will be informed about the relevant terms and conditions.\n\nGrading\n\nThe grading for the course will be as follows:\n\nCOMPONENTS\n\nPERCENTAGES\n\nMidterm Examination\n\n30%\n\nFinal Examination\n\n40%\n\nProblem Sets\n\n20%\n\nClass Participation\n\n10%\n\nTextbook\n\nThere is no textbook for this course. However, we will be assigning a few sections from Pindyck, R., and D. Rubinfeld (2005) primarily for review purposes:\n\nPindyck, R., and D. Rubinfeld.\nMicroeconomics\n. 6th ed. Upper Saddle River, NJ: Prentice Hall, 2005. ISBN: 0130084611.\n\nMany of you used this book in 14.01. If you used a previous edition you will find equivalent sections there. If you used a different intermediate microeconomics textbook you should find equivalent sections in it. If in doubt ask the TA. If you did not retain your intermediate economics textbook, we suggest that you buy a used copy for reference purposes. It will be useful.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nIntroduction and Background\n\nReview of the Basics of Supply, Demand and Price Formation in Competitive Markets\n\nEnergy Demand: Short Run and Long Run Price and Income Elasticities\n\nIntroduction to Multivariate Regression Analysis\n\nEnergy Supply and the Economics of Depletable Resources\n\nWorld Oil Markets and Energy Security\n\nNatural Gas Price Regulation, Deregulation and Markets\n\nElectricity\n\nRisk Management, Futures Markets and Derivatives\n\nEnergy and Climate Change\n\nInternalizing Environmental Externalities with a Focus on CO\nEmissions Cap and Trade Mechanisms\n\nCoal\n\nNuclear Power\n\nEnergy Efficiency Policies\n\nRenewable Energy Policies",
  "files": [
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/6bee9991a97e776be6205bacedf38c74_ps2.pdf",
      "content": "14.44/14.444 Energy Economics, Spring 2006\nProblem Set 2\nDue Friday February 23, 2006 in class\nLate problem sets are not accepted\nThis problem set reviews your knowledge of multivariate regression analysis. It re\nquires you to answer questions related to the article on the reading list \"Evidence of\na shift in the short-run price elasticity of gasoline demand\" by J. Hughes, C. Knittel\nand D. Sperling. Some of you may also find the article \"An introduction to regression\nanalysis\" by A. Sykes, also on the reading list, is a useful reference for the material.\n1. (60) In section 2 the authors estimate the following demand equation:\nln Gjt = β0 + β1 ln Pjt + β2 ln Yjt + εj + εjt\nwhere Gjt is per capita gasoline consumption in gallons in month j and year t, Pjt\nis thee real retail price of gasoline in month j and year t, Yjt is real per capita\ndisposable income in month j and year t, εj represents unobserved demand factors\nthat vary at the month level and εjt is a mean zero error term.\na) (10) What have the authors assumed about the price elasticity of demand when\nthey wrote down the demand equation in this form? Remember the price\nelasticity of demand Ep = ∂G P .\n∂P G\nb) (10) Go to table 1 in the appendix, now assuming the authors have obtained\nunbiased estimates of the parameters β0,β1 and β2 what do they mean? (eg.\nthe coefficient β1 is -0.335 in the period 1975-1980, this represents...)\n\nc) (10) Interpret the values of the monthly unobserved demand factors (εj )? What\nare these relative to? What can you say about the yearly pattern of gasoline\ndemand from these coefficients?\nd) (10) From the information presented in this table calculate the appropriate t-\nstatistics for each of the β0s to test if it is different from 0. You will need the\nstandard errors for each coefficient which are presented in brackets below the\nrespective coefficient value in the table. For instance the standard error for\nthe coefficient β1 in the period 1975-1980 is 0.024.\ne) (10) What do the *** next to some of the entries in the table indicate? How\nare they related to the t-statistics you calculated?\nf) (10) The table presents the adjusted R-squared statistic for the two regressions.\nWhat does this number mean? If we calculated the unadjusted R-squared\nvalues, can we say whether these are larger or smaller than the adjusted R-\nsquared values of 0.84 and 0.94 in this table?\n2. (30) In table 2 and table 3 in the appendix, two alternate specifications for the\ndemand equation are compared with the original double-log model.\na) (10) Under the linear specification for the period 1975-1980 the coefficient on the\nPrice variable is -7.252. What is the implied elasticity of demand, assuming\nthe linear model, if during a June month per capita demand was 40 gallons,\nand price was $1.70?\nb) (10) What is the implied elasticity of demand if during July demand is 5 gallons\nhigher (due to a month specific effect) and price is the same?\nc) (10) Under the linear demand specification the demand elasticity varies within\neach period. Therefore the authors calculate an \"average\" elasticity of demand\nacross each period. Do you think a time weighted or quantity weighted average\nis more reasonable and why?\n3. (20) In section 3.3 the authors' specify a model where there is an interaction be\ntween price and income\nln Gjt = β0 + β1 ln Pjt + β2 ln Yjt + β3 ln Pjt ln Yjt + εj + εjt\n\nwhere β3 is the coefficient on the interaction term.\na) (10) Derive the price elasticity of demand using this model specification. You\nshould get Ep = β1 + β3 ln Yjt. What would be the expression for the income\nelasticity of demand?\nb) (10) Interpret the values of β3 presented in table 7 in the appendix. What do\nthese tell you about the effect of income on the price elasticity of demand?\nHow has this changed from the 1975-80 period to today?\n4. (40) (14.444 students only) In section 3.2 the author's find that when the simul\ntaneity bias is accounted for in the period 2001-2006 the estimate for the elasticity\nof demand changes from -0.042 to -0.077 and this change is statistically significant.\nThe authors' conclude that this is encouraging and that the effects of simultaneity\nare small relative to other factors. Give a brief (1/2 a page max.) critique of the\nauthors' methodology for addressing the simultaneity bias."
    },
    {
      "category": "Resource",
      "title": "sol_ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/d7f82898bccba9546cc35ba2f4e3b355_sol_ps2.pdf",
      "content": "14.44/14.444 Energy Economics, Spring 2006\nProblem Set 2\nDue Friday February 23, 2006 in class or Arthur Campbell's mail folder\nLate problem sets are not accepted\nThis problem set reviews your knowledge of multivariate regression analysis. It re\nquires you to answer questions related to the article on the reading list \"Evidence of\na shift in the short-run price elasticity of gasoline demand\" by J. Hughes, C. Knittel\nand D. Sperling. Some of you may also find the article \"An introduction to regression\nanalysis\" by A. Sykes, also on the reading list, is a useful reference for the material.\n1. (60) In section 2 the authors estimate the following demand equation:\nln Gjt = β0 + β1 ln Pjt + β2 ln Yjt + εj + εjt\nwhere Gjt is per capita gasoline consumption in gallons in month j and year t, Pjt\nis thee real retail price of gasoline in month j and year t, Yjt is real per capita\ndisposable income in month j and year t, εj represents unobserved demand factors\nthat vary at the month level and εjt is a mean zero error term.\na) (10) What have the authors assumed about the price elasticity of demand when\nthey wrote down the demand equation in this form? Remember the price\nelasticity of demand Ep = ∂G P\n∂P G .\nAns:\nThe assumption made by the authors is that consumer demand for petrol\nhas a constant elasticity of demand at all points along the demand curve.\nb) (10) Go to table 1 in the appendix, now assuming the authors have obtained\nunbiased estimates of the parameters β0,β1 and β2 what do they mean? (eg.\nthe coefficient β1 is -0.335 in the period 1975-1980, this represents...)\n\nAns:\nThe coefficient β1 is the price elasticity of demand, in the period 1975\n1980 it is -0.335, this means that for a 1% increase in price in this period\ndemand will fall by 0.335%, similarly in the period 2001-2006 it is -0.042 so\nfor the same price change demand falls by 0.042%.\nThe coefficient β2 is the income elasticity of demand in the period 1975\n1980 it is 0.467, this means that for a 1% increase in income in this period\ndemand will increase by 0.467%, similarly in the period 2001-2006 it is 0.530\nso for the same change in income demand increases by 0.530%.\nThe coefficient β0 is the constant in the demand specification.\nThis\nscales the demand relation in such a way (holding demand elasticity con\nstant) larger values of β0 indicate larger per capita demand for the same price\nacross different time periods. The value of β0 decreases from -0.615 to -1.697\nfrom 1975-1980 to 2001-2006. This represents a fall in per-capita gasoline\nconsumption which is consistent with the data presented in Figure 1 of the\npaper.\nc) (10) Interpret the values of the monthly unobserved demand factors (εj )? What\nare these relative to? What can you say about the yearly pattern of gasoline\ndemand from these coefficients?\nThe values of the monthly unobserved demand factors can be interpreted\nin much the same way as the constant term β0. That is greater values of the\ncoefficient relative to other time periods or months indicates relatively higher\ndemand. The yearly pattern of gasoline demand is characterized by a peak\nduring August and a low during February and intermediate levels inbetween.\nThe monthly factors are relative to the level in December which is normalized\nto 0 by including the constant term and excluding the month dummy for\nDecember.\nd) (10) From the information presented in this table calculate the appropriate t-\nstatistics for each of the β0 s to test if it is different from 0. You will need the\nstandard errors for each coefficient which are presented in brackets below the\nrespective coefficient value in the table. For instance the standard error for\nthe coefficient β1 in the period 1975-1980 is 0.024.\n\nT-statistics are calculated by dividing the value of the co-efficient by the\nstandard deviation. They are used to test whether a coefficient is significantly\ndifferent from 0. For example the first entry in the table below is calculated\nby -0.615 = -0.662.\n0.929\n1975-1980\n2001-2006\nβ0\n-0.662\n-2.891\nβ1\n-13.958\n-4.667\nβ2\n4.865\n9.138\ne) (10) What do the *** next to some of the entries in the table indicate? How\nare they related to the t-statistics you calculated?\nThis indicates that the coefficient is significant at a level of 1%. The t-statistics\nare used along with the student-t distribution to determine at what level the\ncoefficient is significant\nf) (10) The table presents the adjusted R-squared statistic for the two regressions.\nWhat does this number mean? If we calculated the unadjusted R-squared\nvalues, can we say whether these are larger or smaller than the adjusted R-\nsquared values of 0.84 and 0.94 in this table?\nThe adjusted R-squared values represent the percentage of the variation\nin per-capita consumption is captured by the regression adjusted for the num\nber of variables in the regression. The unadjusted R-squared values will be\ngreater than the adjusted values.\n2. (30) In table 2 and table 3 in the appendix, two alternate specifications for the\ndemand equation are compared with the original double-log model.\na) (10) Under the linear specification for the period 1975-1980 the coefficient on the\nPrice variable is -7.252. What is the implied elasticity of demand, assuming\nthe linear model, if during a June month per capita demand was 40 gallons,\nand price was $1.70?\n∂G P\n1.7\nEp\n∂P G = -7.252 × 40 = -0.308\n=\nb) (10) What is the implied elasticity of demand if during July demand is 5 gallons\nhigher (due to a month specific effect) and price is the same?\n\n∂G P\n1.7\nEp\n∂P G = -7.252 × 45 = -0.274\n=\nc) (10) Under the linear demand specification the demand elasticity varies within\neach period. Therefore the authors calculate an \"average\" elasticity of demand\nacross each period. Do you think a time weighted or quantity weighted average\nis more reasonable and why?\nA quantity weighted average seems more reasonable since we are dealing\nwith elasticities. In terms of the amount of quantity demanded across the\nentire period and how this is affected by the overall price level then additional\nweight should be attached to periods/months during which there was more\ndemand. In the extreme case where only a couple of gallons are demanded\nin a month the very small changes which occur during this month should not\nhave as large an impact on the overall demand elasticity as say a month with\nvery large gasoline demand.\n3. (20) In section 3.3 the authors' specify a model where there is an interaction be\ntween price and income\nln Gjt = β0 + β1 ln Pjt + β2 ln Yjt + β3 ln Pjt ln Yjt + εj + εjt\nwhere β3 is the coefficient on the interaction term.\na) (10) Derive the price elasticity of demand using this model specification. You\nshould get Ep = β1 + β3 ln Yjt. What would be the expression for the income\nelasticity of demand?\nDifferentiating the demand relationship with respect to Pjt:\n1 ∂G\nβ1\nβ3 ln Yjt\n=\n+\nG ∂P\nPjt\nPjt\nwhich can be rearranged to get\nP ∂G\nEp =\n= β1 + β3 ln Yjt\nG ∂P\nsimilarly differentiating with respect to Yjt\n1 ∂G\nβ3\nβ3 ln Pjt\n=\n+\nG ∂Y\nYjt\nYjt\n\nonce more rearraging to get\nY ∂G\nEY =\n= β2 + β3 ln Pjt\nG ∂Y\nb) (10) Interpret the values of β3 presented in table 7 in the appendix. What do\nthese tell you about the effect of income on the price elasticity of demand?\nHow has this changed from the 1975-80 period to today?\nβ3 is -2.879 during 1975-80 and -1.014 during 2001-06.\nThis tells us\nthat the interaction between price and income has become weaker. That is\n% changes in price and income have relatively less impact on the elasticity of\ndemand wrt the other variable. The negative sign indicates that increases in\nincome decrease the elasticity of demand wrt price, because price elasticities\nare normally negative this in fact makes demand more elastic. On the other\nhand increases in prices decrease the elasticity of demand wrt income which\nis positive here and thus makes it more inelastic.\n4. (40) (14.444 students only) In section 3.2 the author's find that when the simul\ntaneity bias is accounted for in the period 2001-2006 the estimate for the elasticity\nof demand changes from -0.042 to -0.077 and this change is statistically significant.\nThe authors' conclude that this is encouraging and that the effects of simultaneity\nare small relative to other factors. Give a brief (1/2 a page max.) critique of the\nauthors' methodology for addressing the simultaneity bias.\nSo in this section I was just after a bit of a discussion of both the instrument\nthe authors' used to address the simulataneity bias and then what some of the assump\ntions are that would make their approach valid in the event that they had not introduced\na simultaneity bias through using a regression of quantity directly on price. In particular\nthis assumes that variation observed in the data is not coming from demand side shocks\nrather there are supply side shocks which provide the variation in prices and quantities\nwhich allow us to identify the demand elasticity."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/3da14fd12d8d0f17df200908921f5103_ps3.pdf",
      "content": "Spring 2007\n14.44-14.444\nProblem Set 3\nDue March 2, 2007\n\n1. a. What is the difference (conceptually) between the short run price and income\nelasticities of the demand for gasoline and the long run price and income elasticities of\nthe demand for gasoline?\n\nb. Why are measured long-run elasticities larger than measured short-run elasticities?\n\nc. Assume that the government offered a payments of (say) $1000 to car owners who\nscrapped cars older than 8 years. How would this affect the measured long-run price\nelasticity of the demand for gasoline?\n\n2. Assume that a consumer has a choice between the following three different air\nconditioner models that have the same cooling capacity but different energy efficiency\nratings. The air conditioners last for ten years\n\nModel\nPurchase Price\nAnnual Operating Cost\n\n$200\n\n$75\n\n$250\n\n$60\n\n$300\n\n$50\n\na. Calculate the total life-cycle cost for each model assuming that the AC unit is\npurchased at the beginning of year 1 and the annual interest rate is 10% per year\n\nb. Which model would a consumer with a 10% discount rate choose?\n\nc. Which model would a consumer with a 15% discount rate choose?\n\nd. How high would a consumer's discount rate have to be for her to choose Model #1?\n\n3. There is a fixed amount of coal (Q) available that can be consumed in period 1 (q1)\nand/or period 2 (q2). The demand function for coal in each period is the same and is\nqiven by\n\nq1 = 200 - p1\n\nq2 = 200 - p2\n\nQ = q1 + q2\n\nwhere p1 and p2 are the prices for coal in each period. Assume that the marginal\nextraction cost is zero.\n\na. Calculate the equilibrium price and quantity in each period assuming that Q = 169, the\ndiscount (interest) rate used by coal suppliers is 10% per year, and coal suppliers are\nprice takers (behaves competitively)\n\nb. Calculate the equilibrium price and quantity in each period assuming that Q = 169, the\ndiscount (interest) rate used by coal suppliers is 20% per year, and coal suppliers are\nprice takers (behaves competitively).\n\nc. Calculate the equilibrium price and quantity in each period assuming that Q = 400, the\ndiscount (interest) rate used by coal suppliers is 10% per year, and coal suppliers are\nprice takers (behaves competitively).\n\nd. How would an increase in the interest rate to 20% in (c) affect your answer and why?\n\ne. Calculate the equilibrium price and quantity in each period assuming that Q = 169,\nthere is a monopoly coal supplier that owns the entire resource, and the monopoly uses a\ndiscount (interest) rate of 10% per year.\n\n4. About 75 million barrels per day of oil were produced and consumed globally just\nprior to the war in Iraq and the world market price (P) was $30/barrel. At the beginning\nof the war in Iraq about 3.0 million barrels per day of Iraqi supplies were taken off of the\nmarket.\n\na. Assume that the short-run world demand (Qd) for oil can be characterized by the\nfollowing demand curve and that the short-run supply (Qs) of oil from other suppliers is\nperfectly inelastic:\n\nQD = 78.75 - .125P\n\nQS = 75 - curtailments\n\nWhat is the effect on world market prices of curtailments of 3 million barrels per day?\n\nb. Assume instead that there is some short run supply response that can be characterized\nby the short-run supply function:\n\nQS = (67.5 - curtailments) + .25P\n\nWhat is the effect on world oil prices of curtailments of 3 million barrels per day under\nthese short-run supply conditions?\n\n5. Adherents to Hubbert's \"peak oil\" theories have continually had to revise their\nprojections upward for the year that global supplies of petroleum would peak and begin\nto decline. List and discuss briefly four reasons for this phenomenon.\n\n6. Discuss (briefly) how you would go about determining empirically whether or not\nOPEC is an effective cartel?\n\nFor those enrolled in 14.444 only\n\n7. Discuss briefly the reasons why the rate of extraction of an exhaustible natural\nresource produced by profit maximizing firms in a competitive market may differ from\nthe socially optimal rate of extraction? In which direction is it likely to deviate and why?"
    },
    {
      "category": "Resource",
      "title": "sol_ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/f8523a6d045c38698665a17d62b8bcf3_sol_ps3.pdf",
      "content": "Spring 2007\n14.44-14.444\nProblem Set 3\nDue March 2, 2007\n1. a. What is the difference (conceptually) between the short run price and income\nelasticities of the demand for gasoline and the long run price and income elasticities of\nthe demand for gasoline?\nAns: Conceptually the difference lies in the how a consumer can change his/her\nbehaviour in the short versus the long run. In the case of gasoline the difference is usually\nin the choice of car or vehicle. In the short run the consumer can not change the vehicle\nwhich he/she drives however in the long run the consumer may switch to a more fuel\nefficient form of transport when the car is no longer useable\nb. Why are measured long-run elasticities larger than measured short-run elasticities?\nAns: Consumers can switch to more fuel efficient forms of transport in the long run\ncompared to the short run.\nc. Assume that the government offered a payments of (say) $1000 to car owners who\nscrapped cars older than 8 years. How would this affect the measured long-run price\nelasticity of the demand for gasoline?\nAns: This would make the long run price elasticity of demand more elastic. Consumers\nwould be more willing to scrap their old cars and switch to newer versions. Therefore the\nturn over of the capital (vehicle) stock would be on average faster so the responsiveness\nof demand would be greater to price changes.\n2. Assume that a consumer has a choice between the following three different air\nconditioner models that have the same cooling capacity but different energy efficiency\nratings. The air conditioners last for ten years\nModel\nPurchase Price\nAnnual Operating Cost\n$200\n$75\n$250\n$60\n$300\n$50\na. Calculate the total life-cycle cost for each model assuming that the AC unit is\npurchased at the beginning of year 1 and the annual interest rate is 10% per year\nAns:\nI assume that the operating costs are discounted at the end of the year in which\nthey are incurred.\n\nModel 1 = $660.84\nModel 2 = $618.67\nModel 3 = $607.23\nb. Which model would a consumer with a 10% discount rate choose?\nAns: Model 3\nc. Which model would a consumer with a 15% discount rate choose?\nAns:\nModel 1 = $576.41\nModel 2 = $551.13\nModel 3 = $550.94\nChooses Model 3\nd. How high would a consumer's discount rate have to be for her to choose Model #1?\nAns: 27.3%\n3. There is a fixed amount of coal (Q) available that can be consumed in period 1 (q1)\nand/or period 2 (q2). The demand function for coal in each period is the same and is\nqiven by\nq1 = 200 - p1\nq2 = 200 - p2\nQ = q1 + q2\nwhere p1 and p2 are the prices for coal in each period. Assume that the marginal\nextraction cost is zero.\na. Calculate the equilibrium price and quantity in each period assuming that Q = 169, the\ndiscount (interest) rate used by coal suppliers is 10% per year, and coal suppliers are\nprice takers (behaves competitively)\nAns: Use the no arbitrage condition: P1=P2/1.1\nSubstitute it into the above equations and use Q = 169 to get: 169 = 400-2.1P1\nSolution: P1 = 110; P2 = 121; q1 = 90; q2 = 79\nb. Calculate the equilibrium price and quantity in each period assuming that Q = 169, the\ndiscount (interest) rate used by coal suppliers is 20% per year, and coal suppliers are\nprice takers (behaves competitively).\n\nAns: Use the no arbitrage condition: P1=P2/1.2\nSubstitute it into the above equations and use Q = 169 to get: 169 = 400-2.2P1\nSolution: P1 = 105; P2 = 126; q1 = 95; q2 = 74\nc. Calculate the equilibrium price and quantity in each period assuming that Q = 400, the\ndiscount (interest) rate used by coal suppliers is 10% per year, and coal suppliers are\nprice takers (behaves competitively).\nAns: Use the no arbitrage condition: P1=P2/1.1\nSubstitute it into the above equations and use Q = 400 to get: 400 = 400-2.1P1\nSolution: P1 = 0; P2 = 0; q1 = 200; q2 = 200\nd. How would an increase in the interest rate to 20% in (c) affect your answer and why?\nAns: No here it would not because the market effectively clears at the same level it would\nabsent the resource constraint.\ne. Calculate the equilibrium price and quantity in each period assuming that Q = 169,\nthere is a monopoly coal supplier that owns the entire resource, and the monopoly uses a\ndiscount (interest) rate of 10% per year.\nAns: Use the no arbitrage condition: (MR1-c)=(MR2-c)/1.1\nNoting that c=0; MRi = 200-2qi;\nThen 1.1(200-2q1) = 200 - 2q2\nNow using 169 = q1 + q2 we can solve.\nP1 = 114.8; P2 = 116.2; q1 = 85.2; q2 = 83.8\n4. About 75 million barrels per day of oil were produced and consumed globally just\nprior to the war in Iraq and the world market price (P) was $30/barrel. At the beginning\nof the war in Iraq about 3.0 million barrels per day of Iraqi supplies were taken off of the\nmarket.\na. Assume that the short-run world demand (Qd) for oil can be characterized by the\nfollowing demand curve and that the short-run supply (Qs) of oil from other suppliers is\nperfectly inelastic:\nQD = 78.75 - .125P\n\nQS = 75 - curtailments\nWhat is the effect on world market prices of curtailments of 3 million barrels per day?\nAns: Supply is inelastic so the price must change to allow the market to clear.\ndQD/dP = -0.125 therefore if dQD = -3 then dP = -3/-0.125 = $24 increase\nb. Assume instead that there is some short run supply response that can be characterized\nby the short-run supply function:\nQS = (67.5 - curtailments) + .25P\nWhat is the effect on world oil prices of curtailments of 3 million barrels per day under\nthese short-run supply conditions?\nAns: Now both supply and demand can adjust so:\ndQD/dP - dQS/dP = -0.125 - 0.25 = -0.375\ndQ = 3 so dP = -3/-0.375 = $8 increase\n5. Adherents to Hubbert's \"peak oil\" theories have continually had to revise their\nprojections upward for the year that global supplies of petroleum would peak and begin\nto decline. List and discuss briefly four reasons for this phenomenon.\nAns:\nThis theory is primarily flawed because it uses a particularly myopic view of the world.\nThat is prices, technology, knowledge of fields etc will all remain fixed.\nSome problems with this are:\n1) Firstly these theories misunderstand what is meant by reserve. At any point in time the\nsize reserves is determined by current economic conditions (price of oil). As the price of\noil goes up it becomes economically viable to extract oil from many already known\nsources. An example given in class is the Alberta Tar sands which is not viable at low\nprices but above $40-$50 a barrel is viable.\n2) These theories also ignore the rationing of oil by the market so that if production falls\nthen basic economics tells us that prices increase to ration the oil. That is there is no\n\"short fall\" of oil but rather a higher price.\n3) When the production of oil begins to fall relative to demand (or demand increases\nrelative to supply) then the price of oil increases. This provides incentives for exploration\nand technological innovation. That is resources are devoted to increasing the efficiency of\noil extraction and finding new resources because the rewards to doing so are now greater.\n\n4) Furthermore even given existing prices there is learning from doing and investment in\ntechnological improvement which will increase the size of reserves in the future.\n6. Discuss (briefly) how you would go about determining empirically whether or not\nOPEC is an effective cartel?\nA good place to start for answering this question is Smith's article on the reading list. He\nobserves that perfect competition would entail frequent uncorrelated production\nadjustments between firms across time. On the other hand a cartel model of behaviour\nwould entails correlated production adjustments because the cartel acts in unison to\nchanging market conditions which symmetrically affect members. Note this is a\nparticular assumption the author is making about the type of cartel which exists. By\ntesting whether OPEC countries adjustments are more highly correlated with each other\nthan with non-OPEC countries the author can test for cartel like behaviour.\nFor those enrolled in 14.444 only\n7. Discuss briefly the reasons why the rate of extraction of an exhaustible natural\nresource produced by profit maximizing firms in a competitive market may differ\nfrom the socially optimal rate of extraction? In which direction is it likely to\ndeviate and why?\nAns:\nSo the primary reason we may think a competitive market may lead to a rate of\nextraction different from the socially optimal rate is that competitive firms may have\ndifferent discount rates from the discount rate of a social planner. Firms will use a\ndiscount rate equal to the cost of funds during any one period which is the interest rate.\nThe social discount rate could differ from this for any number of reasons. For instance if\nthere is an externality associated with the consumption of the natural resource then these\ntwo rates will not coincide. One obvious example of this is the emission of CO2 from the\nburning of fossil fuels, but it may also be applied to such things as habitat conservation\nand diversity of animal species. In this case the rate of extraction by the competitive firms\nwill be too fast."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/70067795fb59ff566e6bf4b833e7a7b3_ps4.pdf",
      "content": "14.44/444\nProblem Set #4\nDue March 9, 2007\n1. Suppose that you are trying to determine whether OPEC is an effective cartel.\nSuppose there is an exogenous and unanticipated shock to world oil supplies --- e.g.\npolitical unrest that causes oil exports from Venezuela to fall to zero. Discuss how you\nwould go about distinguishing between the following models of imperfect competition if\nyou could observe market prices, output levels for individual countries, and the short run\nmarginal oil production costs of individual countries before and after the demand shock.\na. Textbook cartel\nb. Dominant firm/fringe firm\nc. Cournot (quantity) competition\nd. Perfect competition\n2. If oil and natural gas are close substitutes discuss the effect of a negative shock to\nworld oil supplies as in (1) on field prices, import prices, quantities, and market clearing\nconditions for natural gas sold in the U.S. under the following conditions:\na. Field prices for natural gas produced in the U.S. and prices for\nimported gas are unregulated. Pipelines pass through the cost of the gas they purchase in\nthe field in the prices they charge to local distribution companies.\nb. The field price of natural gas produced in the U.S. is subject to a price\nceiling equal to the pre-shock domestic price of natural gas while imported gas prices are\nunregulated. Pipelines are required to charge the average prices they pay for domestic\nand imported gas to local distribution companies.\nc. The pipeline network in the U.S. was operating at full capacity prior to\nthe supply shock."
    },
    {
      "category": "Resource",
      "title": "sol_ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/7781ba17bfb1b372b913615c661e5921_sol_ps4.pdf",
      "content": "Question 1\nThe assumption that I'm making through out the question is that the objective\nof all countries is short term pro...t maximisation. One could convincingly ar-\ngue that OPEC's objectives are primarily long term pro...t maximisation which\ntranslates into rather di¤erent objectives in the short term such as the stability\nof the world oil market. However for the purposes of illustrating these models I\nwill assume short term pro...t maximisation is the objective\n1.1\nTextbook Cartel\nUnder the textbook cartel model countries maximise the sum of the pro...ts of\nall member countries. One could just as easily think of the countries acting as\na monopoly. If this is the case then the price in the market is the monopoly\nprice and production occurs in the countries with the lowest production costs\nsuch that the marginal cost of extracting an extra barrel of oil from any country\nproducing (q > 0) below its total capacity is equal. The e¤ect of production\nshock in Venezuala would be to shift the monopolies collective supply curve\ninwards S0 ! S1, see below. This would result in an increase in prices (P 0 !\nP 1) and a fall in quantity\nQ0 ! Q1\n. The fall in quantity from Venezuala\nwill be partially o¤set by other member countries of OPEC which increase\nproduction.\n\n1.2\nDominant ...rm with competitive fringe\nI will analyse the case shown below where the dominant ...rm has much lower\nproduction costs that the competitive fringe. I will also assume that Venezuala\nis part of the competitive fringe rather than the dominant ...rm. This situation\nis shown in the diagram. Note that in the diagram the dominant ...rm makes its\npricing decision o¤ the residual demand curve. The residual demand curve is the\ndemand curve minus whatever production the fringe will provide at that price.\nThe dominant ...rm then acts as a monopolist would if faced with the residual\ndemand curve. A shock to oil production in Venezuala would shift the supply\ncurve of the fringe to the left and subsequently push the residual demand curve\nto the right. When the dominant ...rm has much lower costs than the fringe\nwe see that unlike earlier the dominant ...rm reduces production compared to\nearlier where all other countries increased production in response to the shock.\nOtherwise market output falls prices rise and other fringe suppliers increase\nproduction. The marginal costs of production will be the same across all fringe\nsuppliers (equal to the market price) and much lower for the dominant supplier.\nG\nra\nph\ni\nll\nus\ntr\nating increase in price and supply, fall in quantity.\nF ig u r e b y M I T O C W .\n\n1.3\nCournot Competitiion\nCournot competition is where producers compete through choosing quantities.\nIn its simpliest form imagine a producer i with a cost function Ci (qi). De...ne\npro...ts i as\ni (qi) = P (Q) qi Ci (qi)\nwhere P (Q) is the demand curve and Q is the total market output Q = P\ni\nqi.\nEach producer maximises their individual pro...ts taking the output decisions of\nother producers as given. Their objective is therefore\nmax\nqi\ni\ntaking ...rst order conditions we get\nP\n0 (Q) qi + P (Q) @Ci\n@qi\n(qi) = 0\nrearranging\nP (Q) = @Ci\n@qi\n(qi) P\n0 (Q) qi\nnoting that the right hand side is increasing in qi it should be clear that pro-\nducers with the lower marginal costs of production will producer a greater\nproportion of total output Q.\nWhen there is a supply shock in Venezuala\nGraph illustr\nating sup\nply of fring\ne and dominant\nfirms and residual demand\n.\n\nqV enezuala = 0 ) Q # if no other countries change their production levels\nthen for all these other countries\nP (Q) > @Ci\n@qi\n(qi) P\n0 (Q) qi\nis now true because Q is smaller (so P (Q) has increased) and qi is unchanged.\nAll other countries will therefore have an incentive to increase their output\nat the next opportunity. This increase however will not completely o¤set the\nreduction from Venezuala. In conclusion Q # P \" and qi \". Also the marginal\ncost of production will di¤er across countries, it will be lower than the price and\nnegatively correlated with the countries share of total output.\n1.4\nPerfect competition\nThe e¤ect of a shock in Venezuala in a perfectly competitive market is the\nfamilar shifting of a supply curve. That is the market quantity goes down and\nthe price increases. Other countries will increase production to partial o¤set the\nfall in production however they will not completely do so. Price will be equal to\nmarginal costs of production which will be equal across countries with unused\ncapacity.\n1.5\nDi¤erentiating these models\nDi¤erentiating between these models on the basis of just these comparative\nstatics relies heavily on knowing the marginal costs of production which are for\nthe most part unobservable and otherwise di¢ cult to estimate. If we could only\nobserve the price and quantity movements then we would have some di¢ culty\ndistinguishing these models. With the exception of the dominant supplier in the\nsecond model whose output falls, all other movements are similar across models.\nQuestion 2\na) This is just a simple shift of the demand curve.\nPrices are all identical\nbecause costs are simply passed through so the shift in the demand curve\nincreases production and prices.\nb) Now there is a price ceiling on domestic ...eld prices. The e¤ect of this on the\naggregate supply curve is shown below. Any production above the level\nat the price ceiling must be met by imported natural gas. The e¤ect of\nthis on the supply curve is to make it steeper in the region above the price\nceiling compared to the supply curve without a price ceiling. Pipelines\nare regulated to charge the average price of imported prices and domestic\nprices which I assume is a quantity weighted average so that pipelines just\nbreak even. The market equilibrium is for import prices and quantities\nto increase, ...eld prices and quantities to remain the same, and consumer\n\nquantities and prices to increase. The price faced by consumers will be\nthe weighted average of the import and domestic gas prices.\nc) If the pipeline was operating at full capacity prior to the shock then we have\nthe situation shown below. Supply cannot respond to the demand increase\nso in order for the market to clear the price faced by consumers must\nincrease to P 1. In this case there is a congestion rent due to the di¤erence\nbetween P 1 and P 0. This can be captured by any of the distributers,\nproducers or the pipeline itself depending on the relative bargaining powers\nof each.\nG\nraph il\nlustrating relationship between\nsupply and price celiing\ns.\nF ig u r e b y M I T O C W .\n\nG\nraph illu\ns\ntrating relationshi\np between demand an\nd capa\nci\nty of network.\nF ig u r e b y M I T O C W ."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/e09cc3a1ff00bb3e5d175979dfe3df0f_ps5.pdf",
      "content": "14.44/444\nProblem Set 5\nDue March 16, 2007\n1. Consider a very simple \"two node\" model in which natural gas is produced in region\nA and is transported by pipeline to region B. The price of natural gas in Region B is $6\nper thousand cubic feet (Mcf) and the price of transportation service from Region A to\nRegion B is $1/Mcf.\na. If the market for producing gas in region A is perfectly competitive and there\nis a perfectly elastic supply of transportation service what will be the equilibrium price of\nnatural gas in Region A?\nb. What will happen if the government places a cap of $4/Mcf on price that\nproducers in Region A can charge for the natural gas they produce? Discuss how your\nassumptions about the shape of the competitive supply curve in Region A affects your\nanswer.\n2. Now consider a more complex natural gas supply and demand system such as the one\nwe have in North America. There are multiple gas production areas and many consuming\nareas that are remote from production areas and rely on pipelines to transport gas to them.\na. Assume that the price of natural gas at Henry Hub (Louisiana --- a gas\nproducing area) is $5/Mcf and assume that the price of natural gas in Los Angeles (a gas\nconsuming area) is $4/Mcf. Explain how such a price pattern can emerge?\nb. What incentives are there to expand pipeline capacity from producing areas in\nthe Western U.S. to consuming areas in the Eastern U.S.\n3. The United States maintains a Strategic Petroleum Reserve (SPR) that now contains\n700 million barrels of crude oil.\na. What factors would you take into account to design a policy to determine when\nand how much oil is released from the SPR?\nb. How would the expected supply behavior of OPEC affect your policy design?"
    },
    {
      "category": "Resource",
      "title": "sol_ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/03b0c080c46264bf56dc3b5516a2fda1_sol_ps5.pdf",
      "content": "Question 1\na) The price will be the price in region B minus the cost to transport the gas\nthere. $6 - $1 = $5\nb) The effect of the price cap will be to reduce the amount of gas that is\nsupplied in region A. The size of the reduction is related to the elasticity of\nthe supply of gas in Region A. The more elastic the supply curve the greater\nthe reduction will be. Now in Region B the gas is sold to distributors who can\nnow charge a much higher price to consumers than the $4 + $1 = $5 that was\npaid for the gas. The price charged will be the price which equates the quantity\ndemanded with the amount supplied from region A with the price cap. The\nmore elastic the supply in region A the higher this price will be.\nQuestion 2\na) For such a price pattern to emerge Los Angeles must get its gas from some\nwhere other than Henry Hub. The price in Henry Hub is greater than that in\nLos Angeles so there must be a cheaper source of gas which is going to Los\nAngeles to explain this price differential. Prices differ between regions due to\ndiffering extraction costs of the gas used in each region and/or (if the gas comes\nfrom the same source) differing costs of transporting the gas from the point of\nextraction to the point of use.\nb) The incentives for expanding pipeline capacity from the production ar\neas in the west to the consuming areas in the east are provided by the price\ndifferences between the two areas. If prices are high in the east and low in the\nwest a pipeline connecting the two can arbitrage this price difference by buying\ngas in the west and selling it at a profit in the east. This profit must be great\nenough to warrant the expenditure on the pipeline infrastructure for it to be\neconomically viable.\nQuestion 3\na) So things to consider here are firstly when to use the SPR? The reserve is 700\nmillion barrels so attempting to offset long term changes in world oil supplies is\nunrealistic, such as manipulating the world oil price for an extending period of\ntime. In terms of world oil supply the reserve is not such a significant player in\ncomparison to the nations in OPEC. Potential uses for the reserve however are\nto offset short term supply shocks or to potentially smooth out a transition after\na long term shock. This is a welfare improving strategy if we think that there\nare frictions in the economy which make it difficult for it to adjust to sudden\nchanges in oil prices and supplies. Policies governing the release of oil from the\nreserve should consider the type of shocks which occur and how long they will\nlast. Now depending on the length of the shock the policy then needs to specify\nsome sequence of releases from the reserve to either completely offset the shock\nif it is short term or a sequence to smooth the transition to higher prices.\n\nb) The timing and use of the reserve must certainly consider any response\nthat would come from other oil producing countries. If the policies of the SRP\nare going to be completely offset or even partially offset its effectiveness will be\ncompletely/greatly mitigated. The use of the reserve must therefore take into\nconsideration the form of competition in the world oil supply market and how\nthe objectives of those players are aligned or not with those of the SRP."
    },
    {
      "category": "Resource",
      "title": "ps6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/92bf5804b449bff414703a6af711225b_ps6.pdf",
      "content": "14.44/14.444\nProblem Set #6\nDue April 13, 2007\n1. An electric power system has the following mix of generating capacity installed on its\nnetwork which is owned by several competing generating firms:\nType\nMarginal Operating Cost\nCapacity\nNuclear\n$15/Mwh\n1000 Mw\nCoal\n$25/Mwh\n2500 Mw\nGas\n$60/Mwh\n1500 Mw\nTurbine\n$80/Mwh\n500 Mw\na. Draw the competitive supply curve for the production of electric energy on this system\nb. Assume that demand is 3000 Mw and is completely price inelastic in the very short\nrun. What would be the spot price in a perfectly competitive wholesale electricity\nmarket?\nc. Assume that demand is 4000 Mw and is completely price inelastic in the very short\nrun. What would be the spot price in a perfectly competitive wholesale electricity\nmarket?\nd. Assume that demand is 6000 Mw at a price of $80, but that 600 Mw of this demand\nwould be willing to be curtailed for a price of $4000/Mwh or more. What is the perfectly\ncompetitive market price in this case?\n2. Describe how you would use the information above regarding the attributes of the\ngenerating capacity on this system, along with information about actual market prices and\nsupplier behavior to measure whether or not market prices suggest that generators are\nexercising market power.\n3. In New England, spot electricity prices in Maine are often much higher than are spot\nelectricity prices in Boston even though they are part of the same regional network. How\ncan you explain these price differences assume that the market is perfectly competitive."
    },
    {
      "category": "Resource",
      "title": "ps7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/e061e4d8d404f7b58768fc579b50bbae_ps7.pdf",
      "content": "14.44/444\nProblem Set\nDue Friday, April 27, 2007\n1. Explain why the \"optimal\" level of CO2 emissions is not zero?\n2. The government is trying to choose between an emissions tax system and a cap and\ntrade system. (read the relevant sections of the Stern Review)\na. Assume that the government is certain about the shapes and location of the\nmarginal abatement cost and marginal damage cost functions associated with some\npollutant. How would you decide whether to use an emissions tax system or a cap and\ntrade system to internalize the pollution externality?\nb. Assume that the government is uncertain about the shapes and location of the\nmarginal abatement costs and marginal damage cost functions associated with some\npollutant. How would you now decide whether to use an emissions tax system or a cap\nand trade system to internalize the pollution externality.\n3. You are doing a cost-benefit analysis to determine whether, how much, and when\nCO2 emissions should be reduced from \"Business as Usual Levels\" over the next 100\nyears. (read the relevant sections of the Stern Review)\na. Explain why the discount rate chosen to calculate the present value of\nmitigation costs and damages of climate change can have a large effect on the results?\nb. What factors should go into choosing the correct discount rate."
    },
    {
      "category": "Resource",
      "title": "econometrics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-44-energy-economics-spring-2007/199ae1e6bc77d0ed5efc0cd2d83cc532_econometrics.pdf",
      "content": "Introduction to Econometrics\nArthur Campbell\nMIT\n16th February 2007\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n1 / 19\n\nToday's Recitation\nWhat is a Regression?\nRegression Equation\nRegression Coe¢ cients, Standard Errors, T-statistics, Level of\nSigni...cance, R2 values\nInteraction terms\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n2 / 19\n\nWhat is a Regression?\nIt is a statistical tool for understanding the relationship between\ndi¤erent variables\nUsually we want to know the causal e¤ect of one variable on another\nFor instance we might ask the question how much extra income do\npeople receive if they have had one more year of education all other\nthings equal?\nWhen I represents income and E education this is equivalent to asking\nwhat is ∂I\n∂E ?\nTo answer this question the econometrician collects data on income\nand education, and uses it to run a regression equation\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n3 / 19\n\nWhat is a Regression?\nThe most simple regression is a regression with a single explanatory\nvariable. In the case of income and education this could be\nI = β0 + β1E + ε\nI is called the dependent (endogenous) variable and E is known as\nthe explanatory (exogenous)\nβ0 and β1 are the regression co-e¢ cients\nε is the noise term\nThis regression equation will put a straight line through the data\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n4 / 19\n\nFitting the regression equation\nConsider the following set of data on income and education\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n5 / 19\nI\nE\nFigure by MIT OCW and adapted from:\nSykes, Alan. \"An introduction to regression analysis.\" Chicago Working Paper in Law and Economics 020 (October 1993): 4.\n\nFitting the regression equation\nThe regression will typically ...t the line which minimizes the sum of\nthe squared distances of the data points to the line\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n6 / 19\nI\nE\nFigure by MIT OCW and adapted from:\nSykes, Alan. \"An introduction to regression analysis.\" Chicago Working Paper in Law and Economics 020 (October 1993): 7.\n\nFitting the regression equation\nThe criteria we have used here is\nmin\nβ0β1 ∑(yi β0 β1Xi)2\nThis determines the values of β0 and β1 and hence the position of the\nline\nThere are many potential criteria we could use such\nmin\nβ0β1 ∑jyi β0 β1Xij\nHowever provided the noise term from earlier ε satis...es certain\nassumptions the sum of squared distances is optimal\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n7 / 19\n\nInterpreting the coe¢ cients in the linear regression model\nβ0 is the intercept of the line\nβ1 is the slope of the line or in other words is ∂I\n∂E\nIf for instance β1 = ∂I\n∂E = 15, 000 this would imply that for every\nadditional year of schooling an individual would on average earn\n$15,000 more\nFor a given level of income and education we could now work out the\nelasticity of income wrt education\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n8 / 19\n\nInterpreting the coe¢ cientsin the log-log regression model\nConsider now an isoelastic demand curve\nQD = β0P β1\nNow take the logarithm of both sides\nln QD = ln β0 + β1 ln P\nWe can estimate the following regression relationship\nln QD = ln β0 + β1 ln P + ε\nto determine β0 and β1\nHere each data point would be (ln QD, ln P) and the value of the\nintercept is ln β0 and the slope is β1\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n9 / 19\n\nInterpreting the coe¢ cients in the log-log regression model\nIn this log-log speci...cation β1 is again the derivative of the dependent\nvariable wrt the explanatory variable ∂ln QD\n∂ln P = ∂QD\n∂P\nP\nQ and has the\nnatural interpretation of the elasticity of demand with respect to price\nIn Problem Set 2 you will be asked to calculate elasticities from the\nregression results\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n10 / 19\n\nMultivariable regression\nThe regression may in fact contain more than one explanatory variable\nFor instance we might think that a person's income is in++uenced by\nboth the number of years of education and the number of years\nexperience in the labour force\nIn this case we might run the following multi-variable regression\nI = β0 + β1E + β2L\nHere we can ...nd the e¤ect education and labour force experience on\nincome separately\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n11 / 19\n\nResults of a regression\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n12 / 19\nDouble lo\ng showing values from t\nwo distinct\ntime p\neriods.\nFigure by MIT OCW and adapted from: Hughes, J., C. Knittel, and D. Sperling. \"Evidence of a shift in the short-run price elasticity of gasoline demand.\"\nCenter for the Study of Energy Markets Working Paper 159 (2006): Table 1.\n\nDummy variables and seasonality\nIn the previous slide the regression included 11 dummy variables for\nthe months Jan-Nov\nThese variables take a value of 1 if the data point was observed\nduring that month and 0 otherwise\nThey are included to remove any seasonality in the data, a positive\nvalue means that there was more (gasoline) consumed during that\nmonth compared to the month without a dummy variable (December)\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n13 / 19\n\nStandard Errors (s)\nWhen the error terms ε are normally distributed it is possible to show\nthat our estimates from the regression of the β0s are also normally\ndistributed\nStandard errors represent how accurately we have estimated a\ncoe¢ cient\nA very small standard error means it is a very accurate estimate\nIn the regression results from earlier these standard errors are typically\nreported in parantheses beneath the coe¢ cient's value\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n14 / 19\n\nt-statistic\nA t-statistic is used to measure how con...dent we are given the results\nof the regression that the true β is di¤erent from 0\nFor instance if we measured a very high value for β with a very small\nstandard error we would be very con...dent\nOn the other hand if we found a small value of β with a high standard\nerror we would be far less con...dent\nThe t-statistic is calculated as\nβ\ns\nThe magnitude of this term not the sign is what is important since β\ncan be positive or negative\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n15 / 19\n\nLevel of signi...cance (p)\nAssociated with a t-statistic is a level of signi...cance\nThe level of signi...cance is the probability we attach to the real value\nof β being 0 given the evidence we have found through our regression\nAs the magnitude of β\ns increases the level of signi...cance decreases\nThe signi...cance of an estimate is often indicated with a *,**, or ***\nthe meaning of these is usually indicated below the regression results\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n16 / 19\n\nGoodness of ...t (R-squared)\nThe goodnesss of ...t measure R2 is a measure of the extent to which\nthe variation of the dependent variable is explained by the explanatory\nvariable(s).\nThe formula for it is\nR2\n=\n1 sum of squared errors\nsum of deviations from mean\nR2\n=\n1 ∑i (yi β0 β1xi)2\n∑i (yi y)2\nwhere y is the average value of y\nsum of squared errors\nsum of deviations from mean is the amount of the total variation of y that\nis unexplained by the regression, so 1-\nsum of squared errors\nsum of deviations from mean is the\namount which is explained by the regression\nClearly R2 will be between 0 and 1, values close to 1 indicate good\nexplanatory power\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n17 / 19\n\nAdjusted R-squared\nAn obvious way to increase the R2 of a regression is to simply\nincrease the number of explanatory variables since including\nadditional variables cannot decrease its explanatory power\nThe adjusted R2 is a measure of explanatory power which is adjusted\nfor the number of explanatory variables included in the regression\nThe formula for the adjusted R2 is\nR2\nAdjusted = 1 1 R2\nn 1\nn m 1\nwhere n is the number of data points and m is the number of\nexplanatory variables\nThe adjusted R2 increases when a new variable is added if the new\nterm improves the model more than would be expected by chance\nIt is always less than the actual R2\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n18 / 19\n\nInteraction terms in a regression\nAn interaction term is where we construct a new explanatory variable\nfrom 2 or more underlying variables\nFor instance we could multiply two variables together, say Price and\nIncome\nThe regression equation we would estimate would then be\nQD = β0 + β1P + β2Y + β3PY\nWe do this if we think that the e¤ect of P on QD is di¤erent when Y\nis high or low, and similarly the e¤ect of Y on QD is di¤erent when P\nis high or low\nConsider the demand elasticity wrt price\nED = ∂QD\n∂P\nP\nQ = (β1 + β3Y ) P\nQD\nWe see here that holding everything else constant increasing Y by 1\nunit will increase ED by β3\nP\nQD .\nArthur Campbell (MIT)\nIntroduction to Econometrics\n02/16/07\n19 / 19"
    }
  ]
}