{
  "course_name": "Engineering of Nuclear Systems",
  "course_description": "In this course, students explore the engineering design of nuclear power plants using the basic principles of reactor physics, thermodynamics, fluid flow and heat transfer. Topics include reactor designs, thermal analysis of nuclear fuel, reactor coolant flow and heat transfer, power conversion cycles, nuclear safety, and reactor dynamic behavior.",
  "topics": [
    "Engineering",
    "Nuclear Engineering",
    "Nuclear Systems, Policy, and Economics",
    "Science",
    "Physics",
    "Nuclear Physics",
    "Engineering",
    "Nuclear Engineering",
    "Nuclear Systems, Policy, and Economics",
    "Science",
    "Physics",
    "Nuclear Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nIn this course, students explore the engineering design of nuclear power plants using the basic principles of reactor physics, thermodynamics, fluid flow and heat transfer. Topics include reactor designs, thermal analysis of nuclear fuel, reactor coolant flow and heat transfer, power conversion cycles, nuclear safety, and reactor dynamic behavior.\n\nCourse Structure\n\nTextbook\n\nKnief, R. A.\nNuclear Engineering: Theory and Technology of Commercial Nuclear Power\n. 2nd ed. La Grange Park, IL: ANS, 2008. ISBN: 9780894484582.\n\nUseful References\n\nHenry, A. F.\nNuclear-Reactor Analysis\n. Cambridge, MA: MIT Press, 1975. ISBN: 9780262080811.\n\nDuderstadt, J. J., and L. J. Hamilton.\nNuclear Reactor Analysis\n. Hoboken, NJ: John Wiley & Sons, Inc., 1976. ISBN: 9780471223634.\n\nCengel, Y., R. Turner, and J. Cimbala.\nFundamentals of Thermal-fluid Sciences\n. Columbus, OH: Mcgraw-Hill, 2011. ISBN: 9780077422400.\n\nWhalley, P. B.\nBoiling, Condensation, and Gas-Liquid Flow\n. New York, NY: Oxford University Press, 1990. ISBN: 9780198562344.\n\nTodreas, N. E., and M. Kazimi.\nNuclear Systems Volume I: Thermal Hydraulic Fundamentals\n. New York, NY: Taylor and Francis, 1989. ISBN: 9781560320517.\n\nAssignments\n\nUnits: You are to conform to recommended engineering practice by using units based on the International System (SI).\n\nIn writing your answers it is important that you supply enough information to show how you have solved the problem. It is not necessary to repeat derivations already given in enough detail in the text or lectures.\n\nIt is considered acceptable for you to work completely independently. However, do not adopt your solution directly from any outside source without being sure that you understand both concepts and calculations.\n\nComputer usage: Some homework problems may be solved efficiently using Matlab, Mathcad or other computer programs.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGE\n\nHomework\n\n30%\n\nMid-term quiz\n\n30%\n\nFinal exam\n\n40%\n\nMIT Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nCourse introduction\n\nNuclear power overview\n\nNuclear power overview (cont.)\n\nReactor physics review\n\nReactor physics review (cont.)\n\nPset 1 due\n\nThermal parameters + conservation equations\n\nPWR and BWR description\n\nPset 2 due\n\nOther reactor designs (heavy water, gas, liquid metal)\n\nThermal analysis of fuel elements (introduction to fuels and heat conduction equation)\n\nPset 3 due\n\nThermal analysis of fuel elements (temperature distributions + core max temperature)\n\nIdeal gas and incompressible fluid models + single-phase coolant flow (pressure drop and natural circulation)\n\nPset 4 due\n\nSingle-phase coolant heat transfer (correlations + heat exchangers)\n\nMid-term quiz\n\nPure substance model two-phase coolant flow (parameters)\n\nPset 5 due\n\nTwo-phase coolant flow and heat transfer (pressure drop + boiling)\n\nPset 6 due\n\nTwo-phase coolant heat transfer (boiling crises + demos)\n\nPower cycles (Rankine)\n\nPset 7 due\n\nPower cycles (Brayton)\n\nNuclear safety (pillars + thermal limits + protection system + ECCS + severe accidents + containment)\n\nPset 8 due\n\nStructural mechanics (elasticity fundamentals + thin-shell theory)\n\nPset 9 due\n\nStructural mechanics (stress limits)\n\nVisit to the Seabrook Nuclear Power Station\n\nDynamic behavior of PWR (with use of PRISM simulator)\n\nPset 10 due\n\nDynamic behavior of BWR (with use of IAEA simulator)\n\nAdvanced LWRs\n\nFinal exam review\n\nFinal exam",
  "files": [
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/d0671f852c9b195a1ca30f787825e5f5_MIT22_06F10_pset01.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 1\nNuclear Power Intro + Reactor Physics Review\nReference Textbooks:\n\n[RAK] = Knief, R. A. Nuclear Engineering: Theory and Technology of\nCommercial Nuclear Power. 2nd ed. La Grange Park, IL: ANS, 2008. ISBN: 9780894484582.\n\n1) [RAK] Chapter 1, Problems 1-10\n2) [RAK] Chapter 1, Problem 1-11\n\n3) On average, how many neutrons are born per second by fission in a reactor that is a cube 3 m\non a side an\n\nd that operates at 4000 MW? (Assume it is a thermal reactor fueled with U-235)\nDoes the physical size of the reactor matter in this problem?\n(Adapted from Henry text.)\n4) What is the probability per centimeter of travel that a neutron having energy 0.025 eV and\n\nmoving in pure Pu-239 (which has a density of 19.6 g/cm3) will be absorbed? (The\nabsorption cross section of Pu-239 for neutrons at 0.025 eV is 1011 b)\n(Adapted from Henry text.)\n\n5) In class we derived an expression (ndx) for the probability of interaction of a neutron with\nthe nuclei in a slice of material of thickness dx. One might think that for dx sufficiently\nlarge, the probability of an interaction could exceed unity. Why is this an invalid\nconclusion?\n(Adapted from Henry text.)\n\n6) Derive an expression for the intensity vs distance of a beam of parallel monoenergetic\nneutrons traveling through a material of given density n and microscopic cross section ?\n7) [RAK] Chapter 2, Problem 2-11 (Use the result from Problem 6 above)\n8) Consider a mixture of 10% (by volume) Pu-239 and 90% C (graphite). Relevant densities\nare 19.6 g/cm3 and 1.6 g/cm3, respectively. Assuming the neutron flux is 1014 n/cm2s,\ncalculate the rate (per unit volume) at which the following reactions occur within the\nmixture:\n\ni) Fission\nii) Absorption by Pu-239\niii) Absorption by graphite\niv) Scattering by graphite\n\nThe relevant neutron cross sections for this problem are as follows:\nPu-239: 743 b (fission), 1011 b (absorption), 10 b (scattering)\nC: 0.0034 b (absorption), 5 b (scattering)\n(Adapted from Henry text.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/cec5d141be20dbd0cb0ac6c937aacc57_MIT22_06F10_pset02.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 2\nReactor Physics Review + Thermal Parameters\nReference Textbooks:\n[RAK] = Knief, R. A. Nuclear Engineering: Theory and Technology of Commercial Nuclear Power\n2nd ed. La Grange Park, IL: ANS, 2008. ISBN: 9780894484582.\n1)\nA spherical reactor composed of U-235 metal is operating in a critical steady state. Using the\nkeff formula derived in class as your guide, discuss what probably happens to the\nmultiplication factor of the reactor and why, if the system is modified in the following ways\n(treat each modification separately, not cumulatively): (a) an overweight operator\naccidentally sits on the reactor, squashing it into an ellipsoidal shape, (b) a sheet of cadmium\nis inserted in the reactor, (c) another identical reactor is placed a short distance from the\noriginal reactor, and (d) one simply leaves the reactor alone for a period of time.\n\n2) What is the maximum value of the multiplication factor that can be achieved in any\nconceivable reactor design which uses U-235 as its fuel? What if one uses Pu-239 fuel?\n\nUseful information for this problem:\nIsotope\nNeutrons emitted\nper fission,\n\n4) Given the results in Problem 3 above, why is light water such a popular moderator?\n5) [RAK] Chapter 7, Problem 7-5\n\n6) [RAK] Chapter 7, Problem 7-10\n\nFission cross section\nCapture cross\n\n(b)\nsection (b)\nThermal\nFast\nThermal\nFast\nThermal\nFast\nU-235\n2.43\n2.65\n1.4\n0.25\nPu-239\n2.87\n3.15\n1.8\n0.26\n(Adapted from Duderstadt and Hamilton text.)\n(Adapted from Duderstadt and Hamilton text.)\n\n3) Consider an infinitely large homogeneous mixture of U-235 and a moderating material.\nDetermine the fuel-to-moderator ratio (i.e. ratio of number densities) that will render this\nsystem critical for the following moderators: (a) graphite, (b) beryllium, (c) water (H2O),\nand (d) heavy water (D2O). Assume f = 577 b and a = 678 b for U-235 + use the thermal\ncross section data given in the table below for H2O, D2O, Be and C.\n(Adapted from Duderstadt and Hamilton text.)\nUseful Reference - Table: 2200m/sec CROSS SECTIONS FOR NATURALLY OCCURRING\nELEMENTS [From Reactor Physics Constants, ANL-5800 (1963)].\nDuderstadt, J. J., and L. J. Hamilton. Nuclear Reactor Analysis. Hoboken, NJ: John\nWiley & Sons, Inc., 1976. ISBN: 9780471223634.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/0a865f0eaa920eebe343124312b47503_MIT22_06F10_pset03.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 3\nReactor Designs\n1) [RAK] Chapter 7, Problem 7-9 (NOTE: Pick the PWR(W) as the representative PWR design;\nskip the PTGR design)\n2) Table IV-1 in Appendix IV of the Knief textbook reports representative values of the core-\naveraged power density (power per unit core volume, or kW/L). What is the main reason for\nthe different values among the various reactor types (PWR, BWR, CANDU, HTGR and\nSFR)? What are the economic and safety implications of a high core power density?\n3) Explain and determine the sign of the reactivity feedbacks associated with the fuel, coolant\nand moderator in the PWR, BWR, CANDU, HTGR and SFR designs.\n4) Although the BWR design does not require the use of steam generators, explain\n(qualitatively) why the capital costs of BWR and PWR plants are very competitive.\nReference Textbook:\n[RAK] = Knief, R. A. Nuclear Engineering: Theory and Technology of Commercial Nuclear Power.\n2nd ed. La Grange Park, IL: ANS, 2008. ISBN: 9780894484582.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/29b0202b15300cd1d55bb80a48c24433_MIT22_06F10_pset04.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 4\nThermal Analysis of Fuel + Core Temperature Distributions\nReference Textbooks:\n\n[RAK] = Knief, R. A. Nuclear Engineering: Theory and Technology of Commercial Nuclear Power.\n2nd ed. La Grange Park, IL: ANS, 2008. ISBN: 9780894484582.\n\n[T&K] = Todreas, N. E., and M. Kazimi. Nuclear Systems Volume I: Thermal Hydraulic Fundamentals.\nNew York, NY: Taylor & Francis, 1989. ISBN: 9781560320517.\n\n1) [RAK] Chapter 7, Problem 7-6\n2) [RAK] Chapter 7, Problem 7-7\n3) Consider an annular cylindrical annular fuel pellet of length L, inside radius, RV,\nand outside radius Rfoc. It is operating at q′′′\nc , such that for a given outside surface\ntemperature, Tfo, the inside surface temperature, TV, is just at the fuel melting limit Tmelt.\nA fellow engineer claims that if the same volume of fuel is arranged as a sphere\nwith an inside voided region of radius RV and operated between the same two surface\ntemperature limits, i.e., TV and Tfo, more power can be extracted from the spherical fuel\nvolume then from a cylindrical fuel pellet. In both cases volumetric generation rate is\nradially constant.\nIs the claim correct? Prove or disprove it. Please use the nomenclature of Fig. 1.\nAssume no sintering occurs.\nGiven:\nThe one dimensional heat conduction equation in the radial direction in spherical\ncoordinates is: 1\nd ⎛ kr2 dT⎞+ q′′′ = 0\nr dr ⎝\ndr ⎠\nFor a sphere: VS = 4 πR3 and AS = 4πR2\n\nCylindrical Annular Fuel Pellet:\nSpherical Hollow Fuel Pellet:\nq′′′\nc\nqs ′′′\nRV = 0.25 cm\nRV = 0.25 cm\nRfoc = 1 cm\nL\nRfos = ?\nL = 1 cm\n(to be determined from\nthe problem statement)\nRV\nRV\nRfoc\nRfos\nCourtesy of Todreas, N. E. and Kazimi, M. S. Used with permission.\n4) Effect of internal cooling on fuel temperatures\nConsider the following three UO2 pellets:\n- Solid pellet\n- Annular pellet with only external cooling\n- Annular pellet with simultaneous internal and external cooling\nThe dimensions for all three pellets are in the table below. Assume that the fuel thermal\nconductivity is kf=3 W/mK (independent of temperature), the pellet surface temperature is\n700C and the linear power is q= 40 kW/m in all three cases.\nGeometry of the pellets\nID (mm)\nOD (mm)\nSolid pellet\nN/A\n8.2\nAnnular pellet with only external cooling\n2.0\n8.44\nAnnular pellet with internal and external\ncooling\n9.9\n14.1\ni) Calculate the maximum temperature for the solid pellet.\nii) Calculate the maximum temperature for the annular pellet with only external cooling.\niii) Calculate the maximum temperature for the annular pellet with simultaneous external\nand internal cooling.\niv) For the annular pellet with simultaneous internal and external cooling calculate also the\nheat flux at the inner and outer surfaces.\nv) What are in your judgment the advantages and drawbacks of the annular fuel pellet with\nsimultaneous internal and external cooling?\n\n5) Heated channel power limits (from T&K book)\nConsider a PWR with the following geometry and operating conditions:\nPressure: 15.5 MPa\nCoolant inlet temperature: 286C\nMass flow rate per fuel rod: 0.341 kg/s\nTotal number of fuel rods: 50,952\nFuel rod OD: 9.5 mm\nClad thickness: 0.57 mm\nGap: 0.08 mm\nActive fuel height: 3.66 m\nProperties\nCoolant specific heat: 5.6 kJ/kg-K\nFuel thermal conductivity (assumed constant): 2.163 W/m-K\nClad thermal conductivity (assumed constant): 13.85 W/m-K\nOther useful input\nHeat transfer coefficient: 34 kW/m2-K\nGap conductance: 5.7 kW/m2-K\nAssuming a typical cosine-shaped axial power profile, how much power can be removed\nfrom this PWR, if:\ni) The coolant exit temperature is to remain below 344.9C (i.e. the boiling point of water at\n15.5 MPa)?\nii) The maximum clad temperature is to remain below 344.9C (i.e. the boiling point of\nwater at 15.5 MPa)?\niii) The fuel maximum temperature is to remain below 2400C (i.e. the melting point of UO2\nfuel)?\n(Adapted from Todreas and Kazimi text.)\n\n6) Specification of power profile for a given clad temperature (from T&K book)\n\nConsider a fuel rod whose cladding outer radius is a. Heat is transferred from the fuel rod to\nthe coolant with constant heat transfer-coefficient h. The coolant mass flow rate along the\nrod is m. The coolant specific heat c is independent of temperature. It is desired that the\ntemperature of the outer surface of the fuel rod T (at radius a) be constant, independent of\ndistance z from the coolant inlet end of the fuel rod.\nDerive a formula showing how the linear power of the fuel rod q' should vary with z if the\ntemperature at the outer surface of the fuel rod is to be constant.\n\n(Adapted from Todreas and Kazimi text.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/66711dd2eba373203ed6ac13c3c1b96a_MIT22_06F10_pset05.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 5\nSingle-phase Coolant Flow and Heat Transfer\n1) Hydraulic Analysis of the Emergency Core Spray System in a BWR\nThe emergency spray system of a BWR delivers cold water to the core after a large-break\nloss of coolant accident has emptied the reactor vessel. The system comprises a large water\npool, a pump, a spray nozzle and connecting pipes (Figure 1). All pipes are smooth round\ntubes made of stainless steel with 10 cm internal diameter. The pipe lengths are shown in\nFigure 1. Two sharp 90 elbows connect the vertical pipe to the horizontal pipe and the\nhorizontal pipe to the spray nozzle. Each elbow has a form loss coefficient of 0.9. The spray\nnozzle has a total flow area of 26 cm2 and a form loss coefficient of 15. The suction pipe in\nthe pool has a sharp edged entrance with a form loss coefficient of 0.5.\n0.1 MPa\nCORE\n16.5 m\n0.1 MPa\nPump\n15 m\n2 m\nReactor vessel\n12 m\nSpray\nnozzle\nFigure 1. The emergency spray system.\nCalculate the pump \"head\" (i.e. the pressure rise created by the pump) required to deliver 50\nkg/s of cold water to the core. (Assume steady-state and constant water properties. Do not\nneglect the acceleration terms in the momentum equation. Neglect entry region effects in\ncalculating the friction factor. To calculate the irreversible term of the spray nozzle form\nloss, use the value of the mass flux in the pipe. Neglect the vertical dimension of the pump.\n\nProperties of water at room temperature (25C)\nProperty\nValue\nDensity\n997 kg/m3\nViscosity\n910-4 Pas\nThermal conductivity\n0.61 W/mK\nSpecific heat\n4.2 kJ/kgK\n2)\nAn innovative fast reactor concept uses molten lead as the coolant with the small hexagonal fuel-\nassembly design shown in Figure 1. The geometry and operating conditions of the fuel assembly\nare described in Table 1. Each fuel pin consists of a cylindrical slug made of U-Zr with a\nstainless steel cladding. Since U-Zr swells significantly under irradiation, a relatively large gap\nmust be provided for between the fuel slug and the cladding (Figure 1). The gap is filled with a\n\"thermal bond\" to prevent excessive temperatures in the fuel, when the reactor is at power. The\nthermal bond material is molten sodium. Useful properties for all materials in the fuel assembly\nare reported in Table 2 at the end of the problem statement.\nNa thermal bond\nU-Zr\nSS cladding\n51.1 mm\nFigure 1. Cross sectional view of the fuel assembly.\nTable 1. Operating conditions and geometry of the fuel assembly.\nParameter\nValue\nFuel assembly power (thermal)\n456 Kw\nInlet / outlet temperature\n400C / 550C\nLocal / axial peaking factor\n1.0 / 1.0\nFuel assembly inner width\n51.1 mm (see Figure 1)\nNumber of fuel pins\nFuel pin pitch\n11.0 mm\nFuel pin outer diameter\n9.0 mm\nCladding thickness\n0.6 mm\nFuel slug diameter\n6.8 mm\nActive fuel length\n1.2 m\ni) Calculate the coolant mass flow rate in the fuel assembly.\nii) Select a suitable heat transfer correlation from the Todreas&Kazimi handout. (Assume fully-\ndeveloped velocity and temperature profiles)\n\niii) Evaluate the length of the entry region for the fuel assembly, and comment on the accuracy of\nthe fully-developed velocity and temperature profiles assumption used in answering the\nprevious question. Will the actual heat transfer coefficient be over- or under-estimated if a\ncorrelation for fully-developed flow is used? Explain.\niv) Assuming a uniform axial power profile, sketch the coolant bulk temperature and the\ncladding outer temperature as a function of the axial coordinate. (Assume constant coolant\nproperties)\nv) Calculate the peak outer cladding temperature and the fuel centerline temperature. (In\ncalculating the temperature drop across the gap, consider only heat conduction).\nvi) Suppose the plant operator increases the reactor power by 10% without changing the coolant\nmass flow rate and the inlet temperature. How do the peak cladding temperature and fuel\ncenterline temperature change at these new operating conditions?\nvii) Wire wrapping is often used for fuel pin spacing in liquid-metal-cooled fast reactors. If this\napproach were used for the fuel assembly in Figure 1, would the coolant velocity, bulk\ntemperature, heat transfer coefficient and pressure drop increase, decrease or remain the\nsame? Why? (Assume that power, mass flow rate, inlet temperature and fuel pin geometry\nremain the same)\nTable 2. Properties (all properties independent of temperature)\nMaterial\n(kg/m3)\nk (W/mK)\n(Pas)\ncp (J/kgK)\nMolten Pb\n10,400\n1.910-3\nStainless steel\n8,000\n/\nMolten Na\n1.710-4\n1,300\nU-Zr\n16,000\n/\nHexagon area: A\nw\nHexagon perimeter: p 2 3w\nw\n\n3) Natural circulation flow\nWater is flowing in a loop with a single riser pipe and two downcomer pipes (see Figure 2).\nHeat is added at point A and rejected at point B, so that the temperature difference between\nthe riser and downcomer sections is 30C. The diameter of the two downcomer pipes is\nD1=10 cm and D2=5 cm, respectively.\nCalculate the mass flow rate in the loop.\nAssumptions:\n-\nNeglect all acceleration, friction and form pressure changes in the loop, except for the\nfriction pressure changes in the downcomer pipes.\n-\nTo calculate the friction factor in the pipes, ignore entrance effects, assume the flow\nis turbulent and use the McAdams correlation.\n-\nAssume water density is a linear function of temperature: (T ) c c (T Tc )\n(this is the so-called Boussinesq's approximation). ( = 310-4 K-1, c = 1000 kg/m3)\n-\nOther properties of water at the conditions of interest: = 810-4 Pas, k = 0.61 W/m-\nK, cp = 4.18 kJ/kg-K\nRiser\nA\nB\nH=10 m\ng\nHeat rejection\nHeat addition\nDowncomer\npipe # 1\nDowncomer\npipe # 2\nFigure 2. The natural circulation loop.\n\n4) Innovative intermediate heat exchanger design for sodium-cooled fast reactors\nIn an effort to reduce the capital cost of next-generation sodium-cooled fast reactors, some researchers are\nattempting to simplify the design. This entails a re-design of the intermediate heat exchanger. One\napproach involves using molten lead-bismuth (a chemically inert liquid metal) in lieu of the secondary\nsodium and helium (a chemically inert gas) in lieu of steam/water. The design is shown in Figure 3.\nThis design is a shell-and-tube counterflow heat exchanger. Sodium flows down 8,000 vertical stainless\nsteel tubes. Each sodium tube has a stainless steel clad with stagnant molten lead-bismuth in the gap\nbetween the tube and the clad. The dimensions of a sodium tube and its clad are shown in Figure 3.\nHelium flows upward along the tubes at a pressure of 8 MPa.\nSodium in\nFigure 3. Intermediate heat exchanger design.\nHelium in\nSodium out\nHelium out and on to turbine\n....\nL\nSodium\nHelium\n10 mm\nCross-sectional dimensions of a\nsodium tube and its clad (1 of 8,000)\nClad\n3 mm\nLead-bismuth gap\n1 mm\n1 mm\ni) The sodium flow rate, inlet and outlet temperatures are 2000 kg/s, 550C and 450C, respectively.\nThe helium inlet and outlet temperatures are 350 and 500C, respectively. Find the helium mass flow\nrate and the thermal power exchanged in the heat exchanger.\nii) Find the length (L) of the sodium tubes required for this heat exchanger. Use the following\nassumptions:\n-\nTreat helium as an ideal gas (RHe=2077 J/kg-K) and sodium as an incompressible fluid\n-\nOn the helium side use a heat transfer coefficient of 1500 W/m2-K\n-\nTo calculate the heat transfer coefficient within the sodium tubes, use the following correlation\nNu=5.0+0.025Pe0.8\n-\nHeat within the lead-bismuth gap is transferred only by conduction.\n\niii) Calculate the entropy generation rate ( S\ngen ) in the heat exchanger. (Neglect heat losses to the\nsurroundings. Assume no pressure losses on either the sodium or helium side)\nProperties of materials at the conditions of interest\nMaterial\n\n(kg/m3)\nk\n(W/m-K)\n\n(Pas)\ncp\n(J/kg-K)\nMolten sodium\n1.710-4\n1,300\nMolten lead-bismuth\n10,300\n1.610-3\nHelium\nFrom equation of state\n0.278\n3.510-5\n5,193\nStainless steel\n8,000\n/\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/48ba67ce688441bb69fa3e376327496e_MIT22_06F10_pset06.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 6\nPure Substance Model and Two-Phase Flow Basics\n1) Using the steam tables (or the phase diagram of water), identify the phases corresponding to\nthe following P-T combinations:\na) P=1.0 MPa, T=150C\nb) P=9.0 MPa, T=320C\nc) P=0.1 MPa, T=-10C\nSame as above for the following P-h combinations:\nd) P=9.0 MPa, h=1500 kJ/kg\ne) P=7.0 MPa, h=2100 kJ/kg\nf) P=7.0 MPa, h=3000 kJ/kg\n-\nDetermine the temperature and quality (x) for states d and e.\n-\nPut states a, b, d, e and f on a qualitative T-s diagram (show the isobar line for each\nstate).\n2) The coolant density in a BWR fuel assembly must be kept reasonably high to ensure\nsufficient neutron moderation. Assuming a minimum required coolant (mixture) density\nm=200 kg/m3, determine the maximum acceptable void fraction and flow quality in the\nBWR fuel assembly. Assume S=2; the BWR operating pressure is 7.0 MPa.\n3) In a BWR fuel assembly the flow quality ranges from zero (no steam) at the inlet to x0.13 at\nthe outlet. Using the two-phase flow map in Figure 1 below, determine the flow regime at\nthe following values of the flow quality, x=0.01, x=0.03 and x=0.10 (corresponding to\nvarious intermediate axial locations within the fuel assemblies). The coolant mass flow rate\nin the fuel assembly is m =16 kg/s; the fuel assembly flow area is A=91 cm2. The BWR\noperating pressure is 7.0 MPa.\n4) Consider the flow of a liquid-vapor mixture in a vertical channel. Using your physical\nintuition, determine whether S>1, S1 or S<1 for each of the following flow regimes:\n- Bubbly flow (upward)\n- Bubbly flow (downward)\n- Dispersed bubbly flow (upward)\n- Dispersed bubbly flow (downward)\n- Plug flow (upward)\n- Annular flow (upward)\n\n- Mist flow (upward)\n- Mist flow (downward)\nFlo\nw m\nap\nobt\nai\nn\ned f\nrom\nda\nta\nfor\nlo\nw-\np\nressure air-water\nmixtures and high-pres\nsure wa\nter-steam mix\ntures\nin smal\nl adi\nabati\nc tubes.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/0b59e2848773340c53237159774e9b31_MIT22_06F10_pset07.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 7\nTwo-phase flow and boiling heat transfer\n1) Void fraction and pressure drop in an isolation condenser.\nA modern BWR uses an isolation condenser to remove the decay heat from the core\nfollowing a feedwater pump trip. The isolation condenser receives 50 kg/s of saturated dry\nsteam at 280C and condenses it completely. The isolation condenser consists of 200\nhorizontal round tubes of 3-cm inner diameter and 12-m length. The condensing steam flows\ninside the tubes (Figure 1). The tubes sit in a pool of water at atmospheric pressure.\ni)\nCalculate the isolation condenser heat removal rate. (The properties of saturated water\nat 280C are reported in Table 1)\nii)\nSketch the axial profile of the void fraction in the tubes, assuming a linear variation of\nthe flow quality in the tubes.\niii)\nCalculate the acceleration, friction, gravity and total pressure drops within the tubes.\niv)\nHow would the acceleration, friction and gravity pressure drops within the tubes\nchange, if the tubes were vertical and the steam flow were downward? (A qualitative\nanswer is acceptable)\nTable 1. Properties of saturated water at 280C.\nSaturated\nSaturated\nLiquid Out\nFigure 1. Isolation condenser tubes.\nVapor In\nParameter\nValue\nf\n751 kg/m3\ng\n33 kg/m3\nhf\n1,237 kJ/kg\nhg\n2,780 kJ/kg\nf\n9.810-5 Pas\ng\n1.910-5 Pas\nkf\n0.574 W/(mC)\nkg\n0.061 W/(mC)\n\n2)\nDefine (two sentences max) the following two-phase flow and heat transfer terms, and mark if\nthe associated phenomena occur at normal operating conditions in the PWR core, BWR core, or\nboth.\nFlow boiling ..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\nSubcooled boiling..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\nNucleate boiling..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\nFilm boiling..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\nPool boiling..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\nDeparture from nucleate boiling (DNB) .................................................................\n.............................................. ......................................................................\nPWR....\nBWR....\nDryout..............................................................................................\n....................................................................................................................\nPWR....\nBWR....\n\n3) Departure from Nucleate Boiling in a PWR\nThe departure from nucleate boiling (DNB) heat flux and the operating heat flux in the hot\nchannel of a PWR at 100% power are sketched qualitatively in Figure 2, as functions of the\naxial location, z. If the reactor power were increased (without changing the mass flow rate,\npressure and inlet temperature), how would the curves of Figure 2 change?\nz\nL\nHeat flux\nq′′ DNB (100% power)\nq′′ (100% power)\nFigure 2. Axial variation of the DNB and operating heat fluxes in the PWR hot channel.\n4) Loss Of Flow Accident (LOFA) in a fast-spectrum BWR.\nTo achieve a fast neutron spectrum in a boiling water reactor, a nuclear engineer is analyzing a\nconcept with short fuel assemblies and a tight fuel pin pitch. First consider the nominal\noperation of one of these fuel assemblies. The hydraulic diameter of the fuel assembly is 0.01 m,\nthe flow area is 0.005 m2 and the length is 2.5 m. The operating pressure is 6.4 MPa. The inlet\ntemperature is 260C, and the outlet flow quality is 0.3. The fuel assembly power is 6 MW. The\nheat flux can be considered axially uniform.\ni)\nCalculate the mass flow rate in the fuel assembly. (Assume constant specific heat in\nthe subcooled region)\nii)\nCalculate the critical quality at the fuel assembly outlet. (Use the CISE-4 correlation\nand assume Pw=Ph)\niii)\nDue to malfunction of one of the recirculation pumps, the flow in the fuel assembly\nsuddenly drops and stabilizes at 50% of its nominal value, while the power, pressure\nand inlet temperature remain constant. Does the critical quality at the outlet increase\nor decrease? Does dryout occur?\n\niv)\nQualitatively describe the dominant heat transfer mechanisms at the fuel assembly\noutlet at the nominal conditions and at the reduced-flow conditions.\nv)\nConsider each term of the momentum equation (i.e., acceleration, friction, form and\ngravity pressure drop) and describe the effect that could cause that term to increase or\ndecrease as a result of the flow reduction. If there are two or more conflicting effects,\nlist them and identify which one is likely to be dominant. Provide a qualitative\nanswer.\nTable 2. Properties of saturated water at 6.4 MPa\nParameter\nValue\nTsat\n279.8C\nf\n751 kg/m3\ng\n33 kg/m3\nhf\n1,236 kJ/kg\nhg\n2,780 kJ/kg\nCp,f\n5.3 kJ/(kgC)\nCp,g\n5.0 kJ/(kgC)\nf\n9.810-5 Pas\ng\n1.910-5 Pas\nkf\n0.574 W/(mC)\nkg\n0.061 W/(mC)\n\n0.019 N/m\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/369ad27982d6f8e065bd0bf33d86d647_MIT22_06F10_pset08.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 8\nPower Cycles\n1) [T&K] Chapter 6, Problem 6-2\n\n2) [T&K] Chapter 6, Problem 6-3\n3) [T&K] Chapter 6, Problem 6-5\n4) Consider a helium Brayton Cycle with regeneration, pressure losses, and real machines.\nThese are characterized by the following parameters:\n\nξ = 0.92\nβ\n\n= 1.025\nηt = ηc = 0.92\n\nThe cycle operates at a pressure ratio of rp = 2.2 between limiting temperatures of\n\n303 K and 1083 K. For helium:\nγ = 1.66\n\ncp = 5.230 kJ/kg K\n\nFor this cycle, find the thermal efficiency, ηth.\nCourtesy of Todreas, N. E. and Kazimi, M. S. Used with permission.\n5) In Example 6-10 it is shown that the cycle thermal efficiency of the simple Brayton cycle shown in\nFigure 6-24 can be increased by utilizing regeneration. Specifically, it was found that, with the\naddition of a regenerator of effectiveness 0.75, the cycle thermal efficiency was increased from\n42.3% to 48.1%. Another way of improving the efficiency of the simple Brayton cycle is to use a\nbottoming cycle. To this end, consider the system shown in Figure 1. It shows the simple\nBrayton cycle with a Brayton bottoming cycle. For this system, the following parameters and\ninformation are known:\nReference Textbook:\n\n[T&K] = Todreas, N. E., and M. Kazimi.\nNuclear Systems Volume I: Thermal Hydraulic Fundamentals. New York, NY: Taylor & Francis, 1989.\nISBN: 9781560320517.\n\nT1 = 278 K\nrp for the simple Brayton cycle = 4.0\nT3 = 972 K\ncp for both cycles = 5230 J/kg K\nT9 = T1\nγ for both cycles = 1.658\n(Δ Tp)1 = pinch point of heat exchanger #1\nMass Flowrate for the simple Brayton cycle =\ntwice the mass flowrate for the Brayton\n= 15° C = T4-T7\nbottoming cycle\nAll turbine and compressors in both cycles\nNo duct pressure losses in either cycle\nare ideal\nReactor\nSimple Brayton Cycle\nCompressor #1\nTurbine #1\nHeat\nHeat\nExchanger\nExchanger\n#2\n#1\nWc1\nWt1\nBottoming\nTo Atmosphere\nBrayton Cycle\nWc2\nWt2\nHeat\nExchanger\nCompressor #2\n#3\nTurbine #2\nTo Atmosphere\nFigure 1\nQUESTIONS\nA . Draw the T-V diagram for the entire system.\nB . What must be the pressure ratio of Turbine #2 and Compressor #2 such that the cycle thermal\nefficiency of the entire system is maximized?\nC . What is the maximum cycle thermal efficiency?\nCourtesy of Todreas, N. E. and Kazimi, M. S. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/16bea7b898233ce6997a386d3f142dbc_MIT22_06F10_pset09.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 9\nNuclear Safety\n1) Consider the classification of design-basis accidents presented in class. How would you\nclassify the following abnormal events?\n-\nInadvertent dilution of boric acid concentration in PWR primary coolant\n-\nClosure of BWR main steam isolation valves (i.e. completely chocking the steam flow to\nthe turbine) while the reactor is operating at full power\n-\nMalfunction of online refueling machine in CANDU, resulting in significant spill of\nprimary coolant\n-\nBlockage of intakes of seawater used as condenser coolant in a CANDU station\n-\nTrip of primary sodium pumps in SFR\n-\nTrip of pumps in secondary sodium loop of SFR\n2) The schematic below shows a safety system meant to supply 100% capacity of low-pressure\nemergency coolant to the core of a PWR in case of a LB-LOCA. Does the system satisfy the\nrequirements of redundancy, diversity and physical separation for engineered safety systems\nin nuclear power plants? If not, propose appropriate design modifications to meet such\nrequirements.\n3) Compute the energy sources in a typical PWR, which the containment might have to\naccommodate following a LB-LOCA:\ni\nStored energy in primary coolant. Should enthalpy or internal energy be used?\nii Decay Heat - integrated release over a one hour shutdown period after infinite operation.\niii Chemical Reactions -\na. Reaction of 75% of the zirconium clad with water coolant.\nValve actuated by electric battery\nTo the core\nValve actuated by compressed air\nPump driven by\ndiesel generator\nWater tank\n\nb. Reaction of 25% of the zirconium clad with CO2\n*. Assume this reaction is constrained\nonly by amount of zirconium available.\niv Combustion of hydrogen product in (iii.a) above.\nAssumptions\nPrimary System: 306 m3 of coolant at 15.5 MPa and 305C\nReactor Power: 3411 MWt\nNumber of 17x17 fuel assemblies: 193\nFuel pin geometry: 9.5 mm (OD), 0.57 mm (clad thickness), 4 m (length)\nChemical Reactions\nZr + 2 H2O ZrO2 + 2 H2 + 6.057x105 J/mol of Zr\nZr + CO2 ZrO2 + C + 7.05x105 J/mol of Zr\nH2 + 1⁄2 O2 H2O + 2.4x105 J/mol of H2\n4) The figure below shows the containment and nuclear island of an advanced PWR design\n(Westinghouse's AP1000). Identify the function of each component indicated by the red\narrows and described in the text boxes.\nWater tank: can be\ndrained on top of steel\nshell\nSteel shell\nConcrete building\nHigh-pressure tank\nfilled with borated\nwater\nValve located on\ntop of pressurizer\n* CO2 comes from thermal decomposition of concrete in the containment basemat. This would occur during a\nhypothetical severe accident for which the core melts completely, penetrates through the bottom of the pressure\nvessel and finally relocates in the containment basemat.\nCourtesy of Westinghouse. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "MIT22_06F10_pset10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/9f37d22c732a1d1a75183cfa5b880634_MIT22_06F10_pset10.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS - Fall 2010\nProblem Set 10\nStructural Mechanics\n1)\n\n2)\n\nThe (uniaxial) tensile stress data listed in Table 1 are for a cylindrical coupon of initial\nlength and diameter, 50 mm and 7 mm, respectively. Calculate the following parameters:\n- Young's Modulus, E (GPa)\n- The Yield Stress, Sy (MPa)\n- The Ultimate Stress Su (MPa)\nTable I\nL (mm)\n\nForce\n\n(kN)\n50.000\n0.00\n50.012\n2.00\n50.025\n4.00\n50.038\n6.00\n50.057\n8.00\n50.131\n9.99\n50.501\n11.90\n52.113\n13.45\n55.467\n13.89\n69.751\n12.43\n129.415\n7.44\nTwo sections of stainless steel cylindrical piping of different wall thickness are\njoined by welding. Before an internal pressure pi (above atmospheric) is applied (assume\nno outside pressure above atmospheric), the geometry of the piping is as shown in Figure\n1.1. The numerical values of geometry and pressure pi are given in Table 1.1. You can\nassume the piping is capped at both ends to hold the internal pressure. Stainless steel\nproperties are given in Table 1.2.\n\nt1 Section 1\nt2 Section 2\nD\nt2 Section 2\nt1\nSection 1\nFig 1.1 (not to scale)\nTable 1.1\nD, cm = 100\nt1, cm = 4\nt2, cm = 2\npi, MPa = 7\nStainless Steel\nModulus of elasticity, E\n2 x 105 MPa\nPoisson's ratio,\n0.3\nDensity,\n8,000 kg/m3\n\nTable 1.2\nQuestions:\na)\nCalculate the principal stresses in both sections of the piping (far away from the\njunction) when the internal pressure pi is applied.\nb)\nSketch the geometry of the piping after internal pressure pi is applied. Your\nsketch should clearly show the relative displacements of the two pipe sections\nand rotations of the material about the location they are joined. Further you\nshould explain and justify the key features of your sketch in words.\n\nA stainless steel spherical vessel of dimensions shown in Fig. 3 is subjected to an\nexternal pressure of 0.5 MPa and an internal pressure, pi.\nQUESTIONS\nAssume failure is to be evaluated by the maximum elastic energy theory (i.e., Von\nMises theory) with a yield stress of 690 MPa.\n1) What is the maximum internal pressure that will not fail the vessel? Other\nstainless steel properties are given below.\n2) What is the radial displacement corresponding to the maximum internal pressure?\n2.0 m\n1.9 m\nFigure 3. (not to scale)\nStainless Steel\nModulus of elasticity, E\n200 GPa\nPoisson's ratio,\n0.3\nDensity,\n7,750 kg/m3\nCoefficient of linear expansion,\n1.6x10-5/°C\n3)\n\nConsider a PWR pressure vessel that operates at 15 MPa and 320C. The vessel is\nmade of carbon steel, and has a diameter of 4.5 m and a thickness of 200 mm. If due\nto a seismic event the vessel is also subjected temporarily to an external compressive\naxial force Fs, as shown in Figure 1, what is the maximum allowable value of Fs, so\nthat the Tresca limit for the stresses is not violated? (Sy = 270 MPa for carbon steel at\n320C)\nFs\nFs\nFig. 1. (not to scale)\n15 MPa\n4.5 m\nAssumptions\n1) Use a thin-shell approach to calculate the principal stresses.\n2) Neglect the external pressure.\n4)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT22_06F10_exam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/7ec544c07ee0e581aa8613a70c5c1f1e_MIT22_06F10_exam.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS\nOPEN BOOK\nFINAL EXAM\n3 HOURS\nShort Questions (10% each)\na) The specific power in a UO2 pellet of a certain LWR is q\"'=200 W/cm3. The fuel\n235U enrichment is 4 % by weight. The total density of uranium in the pellet is 9.3\ng/cm3.\nAssuming all energy generated comes from 235U fissions, calculate the\nneutron flux () in the pellet. Nuclear data for 235U: 200 MeV/fission, f = 577 b.\nb) Water flows in a round channel (diameter D= 2 cm, length L=2.5 m) at 0.5 kg/s and 5\nMPa. The flow is subject to a heat flux that varies axially as q (z) q\nsin z ,\nL\nwhere q =300 kW/m2. The inlet temperature is 260C.\nmax\n\nmax\ni) Find the axial location, zsat, at which the coolant becomes saturated. (Useful\nproperties of saturated water at 5 MPa: cp,f = 5 kJ/kg-K, hf=1155 kJ/kg, hg=2794\nkJ/kg, Tsat=264C)\nii) Find the steam quality at the channel outlet.\n\nc) Consider a PWR fuel assembly operating at nominal power, flow rate and inlet\ntemperature, with a cosine shape heat flux profile. Sketch qualitatively the curves\ndescribing the axial profile of the bulk coolant temperature, the operating heat flux\n( q ) and the DNB heat flux ( qDNB\n) at the following conditions:\ni) Higher flow rate, nominal power and inlet temperature\nz\nL\nHeat flux\nq′′ DNB at nominal\nconditions\nq′′ at nominal conditions\nz\nL\nTemperature\nBulk coolant temperature\nat nominal conditions\nDoes the MDNBR increase, decrease or stay the same with respect to the nominal\nconditions?\nii)\nHigher inlet temperature, nominal power and flow rate\nHeat flux\nq′′ DNB at nominal\nTemperature\nconditions\nBulk coolant temperature\nat nominal conditions\nq′′ at nominal conditions\nL\nz\nL\nz\nDoes the MDNBR increase, decrease or stay the same with respect to the nominal\nconditions?\n\nProblem 1 (50%) - Calculating the Mass Flow Rate for a Prescribed Pressure Drop\nTo improve the thermal-hydraulic performance of an Advanced High-Temperature\nReactor (AHTR), a vendor wishes to compare two alternative coolants, i.e., a liquid metal\n(Na) and a liquid salt (LiF-BeF2). In the AHTR core the coolant flows inside 10-m long\nround channels arranged in a hexagonal lattice and surrounded by a solid fuel matrix.\nConsider the unit cell of this core (Figure 1).\nThe friction pressure drop in the coolant channel, Pfric, is to be limited to 250 kPa.\ni)\nCalculate the maximum allowable mass flow rate for the two candidate\ncoolants. (30%)\nii)\nAssuming the bulk coolant temperature at the channel inlet is 600C, and the\nheat flux is equal to 200 kW/m2 (uniform axially and circumferentially),\ncalculate the maximum temperature of the channel surface for both coolants.\n(20%)\nAssumptions:\n-\nIn selecting a suitable friction factor correlation, you may assume Re > 30,000,\nneglect surface roughness and entry region effects.\n-\nIn selecting a suitable heat transfer correlation, you may neglect entry region effects.\nRelevant properties are reported in the table below.\nFuel matrix\nCoolant\n1 cm\nFigure 1. Cross sectional view of the core unit cell.\nCoolant properties (independent of temperature and pressure)\nMaterial\n(kg/m3)\nk (W/m-K)\n(Pas)\ncp (J/kg-K)\nLiquid Na\n1.710-4\n1,300\nLiquid LiF-BeF2\n1,940\n2.010-3\n2,410\n\nProblem 2 (20%) - Sizing the Silicon Carbide Layer in a TRISO Fuel Particle\nA TRISO fuel particle can be modeled as a small spherical pressure vessel of radius 280\nm and with the wall made of silicon carbide (SiC). The internal pressure is due to the\nbuild-up of fission gases, while the external pressure is a constant 8 MPa (i.e., the\npressure of the reactor coolant). At the end of the irradiation cycle the fuel particle\ncontains 0.1 mol (=10-7 moles) of fission gases and operates at 950C.\nEstimate the minimum required thickness of the SiC wall to prevent failure.\nAssumptions:\n-\nUse a thin-shell approximation and the Von Mises failure criterion for your analysis.\n-\nAssume the fission gases occupy only 30% of the volume within the fuel particle.\n-\nThe fission gases can be treated as a perfect gas (R=8.31 J/mol-K).\nProperties of SiC at 950C\nYield strength: 200 MPa\nDensity: 3200 kg/m3\nYoung's modulus: 400 GPa\nPoisson's ratio: 0.28\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT22_06F10_examsoln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/e9a8c38523dcc14d47624a46e9248473_MIT22_06F10_examsoln.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS\nOPEN BOOK\nFINAL EXAM (solutions)\nShort Questions (10% each)\na) The volumetric heat generation rate can be expressed as the product of the fission\nenergy (=200 MeV/fission) times the fission reaction rate (fissions/cm3-second):\nq\"' f N235\n\n(1)\n\nwhere q\"'=200 W/cm3, f = 577 b and the number density of 235U, can be found as\nfollows:\nN235 x235U Nav 9.51020 nuclei/cm3\n\n(2)\n\nA235\nwhere x235=0.04 is the weight enrichment, U=9.3 g/cm3 is the uranium density in the\nfuel, Nav=6.0221023 is Avogadro's number and A235=235 g/cm3 is the atomic weight\nof 235U. Thus, from Eq (1), we get 1.11013 n/cm2-s.\nb)\ni) The conservation of energy equation is:\nmdh q\"(z)D\n\n(3)\n\ndz\nwhere m =0.5 kg/s. This equation can be integrated between z=0 and z=zsat, to give:\nzsat\nm (h h ) D\nq\"(z)dz m (h h ) DLq 1 cos zsat\n(4)\nf\nin\n\nf\nin\nmax\nL\nwhere hin is the enthalpy at the inlet. The enthalpy difference on the LHS of Eq. (4) is\nhf -hin =cp,f (Tsat-Tin), with Tin=260C. Thus, solving for zsat in Eq. (4), we get:\nzsat L cos1\n1 m c p, f (Tsat Tin )\n0.98 m\n\nDLq\n\nmax\n\nii) Integrating Eq. (3) from z=0 to z=L, we get:\n\nL\nm(h\nh ) Dq\"(z)dz 2DLq\n(5)\nout\nin\nmax\nwhere hout is the enthalpy at the outlet, which can be expressed in terms of the outlet\nquality, xout, as hout xouthg (1xout )hf . The enthalpy difference on the LHS of Eq.\n(5) can then be re-written as:\nhout hin (hout hf ) (hf hin ) xouthfg c p, f (Tsat Tin )\n(6)\nSubstituting Eq. (6) into Eq. (5) and solving for xout, we get:\nmax\n2DLq\ncp, f (Tsat Tin )\nxout\nm\n0.024\nhfg\nc)\ni) Higher flow rate, nominal power and inlet temperature. The coolant temperature\nis lower, thus the DNB heat flux is higher. The operating heat flux does not\nchange. Therefore, the MDNBR is higher.\nz\nL\nHeat flux\nq′′ DNB at new\nconditions\nq′′ at nominal and new\nconditions\nq′′ DNB at nominal\nconditions\nz\nL\nTemperature\nCoolant temperature at\nnominal conditions\nCoolant temperature at\nnew conditions\nii)\nHigher inlet temperature, nominal power and flow rate. The coolant\ntemperature is higher, thus the DNB heat flux is lower. The operating heat\nflux does not change. Therefore, the MDNBR is lower.\n\nz\nL\nHeat flux\nq′′ DNB at nominal\nconditions\nq′′ at nominal and new\nconditions\nq′′ DNB at new\nconditions\nz\nL\nTemperature\nCoolant temperature at\nnew conditions\nCoolant temperature at\nnominal conditions\nProblem 1 (50%) - Calculating the Mass Flow Rate for a Prescribed Pressure Drop\ni)\nThe mass flow rate, m , is:\nm GA\nA π D2 =0.785 cm2 is the flow area, and D=1 cm. The mass flux, G, can be found from\nthe imposed friction pressure drop:\nL G2\nPfric f\n\n(7)\n\nD 2\nwhere L=10 m, is the coolant density and f is the friction factor. The problem statement\nsuggests to (i) assume Re>30000, (ii) neglect roughness and (iii) assume fully-developed\nflow. Under these assumptions, the friction factor can be calculated from the following\ncorrelation:\n0.184\n0.184\nf Re0.2 (GD / )0.2\n\n(8)\n\nSubstituting Eq. (8) into Eq. (7) and solving for G, one gets:\n2PfricD1.2\n1/1.8\nG\n\n(9)\n\n0.184L 0.2\n\nEq. (9) gives G5040 kg/m2-s and G6490 kg/m2-s, for sodium and liquid salt,\nrespectively. Thus, the mass flow rates are 0.404 kg/s and 0.509 kg/s, respectively. Note\nthat in both cases, the value of the Reynolds number is above 30000, thus that assumption\nis verified.\nii)\nSince the heat flux is uniform, the maximum surface temperature will occur at the\nchannel outlet and will be equal to (from Newton's law of cooling):\nTsurf Tout q\"\n\n(10)\n\nh\nwhere Tout is the bulk coolant temperature at the channel outlet, q\"=200 kW/m2 and h is\nthe heat transfer coefficient. From the conservation of energy equation (integrated\nbetween z=0 and z=L), we have:\nTout Tin q\"DL\n\n(11)\n\nm c p\nwhere Tin=600C and cp is the coolant specific heat. The outlet temperature is calculated\nfrom Eq. (11) to be 720 and 651C for sodium and the liquid salt, respectively. As for\nthe heat transfer coefficient, in the case of sodium (Pr=0.037<<1, turbulent, fully-\ndeveloped flow, constant heat flux in round channel) the correct correlation is\nNu=7+0.025 Pe0.8 (with PeRePr1114), from which we get h= 83.1 kW/m2-K,\nwhereas in the case of liquid salt (Pr=4.82>1, turbulent, fully-developed flow, constant\nheat flux in round channel) the Dittus-Boelter correlation is suitable, from which we get\nh 17.5 kW/m2-K. Substituting these values into Eq. (10), we get Tsurf 722 and 663C\nfor sodium and liquid salt, respectively. Note that, in spite of a much higher heat transfer\ncoefficient, the surface temperature in the sodium case is higher than in the liquid salt\ncase. This is due to the lower specific heat of sodium which results in a higher Tout.\nProblem 2 (20%) - Sizing the Silicon Carbide Layer in a TRISO Fuel Particle\nThe stresses for a thin spherical shell of radius Rs can be calculated as follows:\nr = -(pi+po)/2\n\n(12)\n\nθ = = (pi-po)Rs/(2 t)\nWhere Rs=280 m, po=8 MPa, t is the (unknown) thickness of the shell, and pi is the\ninternal pressure due to the fission gases. The fission gas pressure can be calculated from\nthe perfect gas equation as follows:\npi=NRT/VFG=36.8 MPa\n(13)\n\nWhere N=10-7 mol, R=8.31 J/mol-K, T=1223 K (950C) and VFG 0.3 4 Rs =2.810-11\nm3. The Von Mises failure criterion is expressed by the following inequality:\n2 (r ) ( r ) ( ) S y\n\n(14)\n\nwhere Sy=200 MPa for SiC at 950C. Noting that θ = , Eq. (14) becomes:\n( r ) S y\n\n(15)\n\nSubstituting Eqs. (12) into Eq. (15), one gets:\n(pi-po)Rs/(2 t)+(pi+po)/2<Sy\n\n(16)\n\nSolving Eq. (16) for t, one gets the minimum required value of the shell thickness to\nprevent failure:\ntmin Rs\npi po\n=22.7 m\n2S y ( pi po )\nNote that the use of the thin-shell theory is justified because Rs/tmin>10.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT22_06F10_quiz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/959f42e03195b5cf96e98a1e6f0e4407_MIT22_06F10_quiz.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS\nQUIZ 1\n1.5 HOURS\nName:\nCLOSED BOOK QUESTIONS (20%)\nFor each of the following drawings, identify the components indicated by the red arrows and\ndescribe (in one sentence!) their function.\nPWR\n___________________________________________ What is it ?\n___________________________________ What is its function ?\n___________________________________________ What is it ?\n___________________________________ What is its function ?\n__________________________________________ What is it ?\n__________________________________ What is its function ?\n_________________________________________ What is it ?\n__________________________________ What is its function ?\n__________________________________________ What is it ?\n__________________________________ What is its function ?\nWhat is it ? _______________________________________________\nCross-sectional view of\nWhat is its function ? _______________________________________\na PWR fuel pin\nWhat material is it made of ? ___________________________________\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat material is it made of ? ___________________________________\n.\n(c) University of CA press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nC\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat material is it made of ? ___________________________________\nPublic domain image from wikipedia.\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat material is it made of ? ___________________________________\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nS\nF\nT\nS D\nS S\nF F\nC\nD F\nJ P\nR\n\nP\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nBWR\nWhat is it ? _________________________________________\nWhat is its function ? _________________________________\nWhat is it ? _________________________________________\nWhat is its function ? _________________________________\nWhat is it ? _________________________________________\nWhat is its function ? _________________________________\nWhat is it ? _________________________________________\nWhat is its function ? _________________________________\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat material is it made of ? ___________________________________\nWhat is it ? _______________________________________________\nWhat is its function ? _______________________________________\nWhat material is it made of ? ___________________________________\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n22.06\nENGINEERING OF NUCLEAR SYSTEMS\nQUIZ 1\n1.5 HOURS\nOPEN BOOK QUESTIONS\nShort Questions (10% each) (adapted from Shultis & Faw textbook)\na) A nuclear reactor in a submarine delivers 18 MW of shaft power (work) at a cruising speed of\n20 knots (1 knot = 1.852 km/hr). If the power plant has a thermal efficiency (= work/heat) of\n25%, how much (in kg) of the 235U fuel is consumed on a 60,000 km trip around the world?\nIn answering this question, make use of the following 235U data: 200 MeV/fission, absorption\ncross section = 678 b, fission cross section = 577 b\nb) Following a reactor scram, how long is it before the reactor power decreases to 0.5% of the\nsteady-state power prior to shutdown? You may assume that the reactor had operated for an\ninfinitely long period of time prior to shutdown.\nc) A small homogeneous sample of mass m with atomic mass A is irradiated uniformly by a\nconstant neutron flux . The microscopic scattering cross section for the sample material is\ndenoted by s. Derive an expression for the time it takes all nuclei in the sample to scatter\nonce (on average) with the neutrons. State any assumptions made.\nProblem 2 (50%) - Temperature distribution within a fuel pellet with non-uniform\nheat generation (adapted from Duderstadt & Hamilton textbook)\nThe neutron flux depression within a cylindrical pellet can be modeled by assuming that the\nradial dependence of q is of the form q(r) q0[1\n( / R)2], where q0 is the volumetric\na r\nheat generation rate at the pellet centerline, r is the radial coordinate within the pellet, R is the\nradius of the pellet, and a is a constant.\ni) Derive an expression for the linear power in the pellet, q, in terms of q0 , R and a.\n(10%)\nii) Derive an expression for the centerline temperature as a function of the constant a, the\nlinear power q, the fuel thermal conductivity kf, and the fuel surface temperature Tfo.\n(25%)\niii) Compute the centerline temperature for the following values of the constants: a=0.12,\nq=25 kW/m, kf = 3 W/m-K and Tfo=400C. (5%)\niv) Compute the centerline temperature for the case of uniform heat generation rate and the\nsame values of q, kf and Tfo. Explain physically any difference you may see between the\nresults in 'iii' and 'iv'. (10%)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT22_06F10_quizsoln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-06-engineering-of-nuclear-systems-fall-2010/eee64935da4d9ebf167a053c53b4f803_MIT22_06F10_quizsoln.pdf",
      "content": "22.06\nENGINEERING OF NUCLEAR SYSTEMS\nQUIZ 1 (solutions)\n1.5 HOURS\nCLOSED BOOK QUESTIONS (20%)\nFor each of the following drawings, identify the components indicated by the red arrows and\ndescribe (in one sentence!) their function.\nPWR\nSteam generator transfers heat from primary to secondary coolant\nReactor coolant pump drives primary coolant flow through the core\nPressurizer controls pressure in primary system\nHot leg directs hot primary coolant to steam generator\nReactor pressure vessel houses core and reactor internals\nWhat is it ? What is its funtion? What material is it made of?\nCross-sectional view of\nFuel cladding encapsulates fuel pellets. It is made of Zircaloy.\na PWR fuel pin\nWhat is it ? What is its function? What material is it made of?\nFuel pellet, reactor fuel. It is made of uranium dioxide.\nWhat is it? What is its function?\nWhat is it? What is its function?\nWhat is it? What is its function?\nWhat is it? What is its function?\nWhat is it? What is its function?\n(c) University of CA press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nC\n.\nWhat is it? What is its function? What material is it made of?\nControl rod cluster (or spider) can be used to control power and shutdown reactor\nIt is made of neutron absorbers (B, Cd, In, Ag...)\nPublic domain image from wikipedia.\nWhat is it? What is its function? What material is it made of?\n\nSpacer grid prevents fuel rod vibration, promotes heat transfer.\nIt is made of Zircaloy.\nS\n\nJ P\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nS D\nS S\nD F\nR\nP\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nBWR\nWhat is it? What is its function?\nSteam dryer removes droplets from steam\nWhat is it? What is its function?\nSteam separators separates steam from liquid\nWhat is it? What is its function?\nRecirculation pump drives flow through the core\nWhat is it? What is its function?\nJet pump boosts flow through the core\nWhat is it? What is its function?\nWater rod enhances moderation in center of fuel assembly\nWhat is it? What is its function? What material is it made of?\nCruciform control blade used to control power and shutdown reactor\nIt is made of neutron absorbers\nWhat is it? What is its function? What material is it made of?\nFuel assembly duct prevent steam drifting from one fuel assembly\nto the next. It is made of Zircaloy.\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n22.06\nENGINEERING OF NUCLEAR SYSTEMS\nOPEN BOOK\nQUIZ 1 (solutions)\nShort Questions (10% each) (adapted from Shultis & Faw textbook)\na)\nThe duration of the trip is 60,000/(201.852) 1620 hr or 5.83106 s. The total electric energy\nneeded for the trip is 181065.83106 1.051014 J, which requires 1.051014/0.25 4.201014\nJ of thermal energy or 4.201014 /(200106 1.610-19) 1.3121025 fissions. Therefore, the total\nconsumption of U-235 (including fissions and parasitic captures) is 1.3121025(678/577)\n1.541025 atoms of U-235, which is 1.541025/(6.0221023)0.235 6 kg of U-235.\nb)\nThe decay power for a reactor that had operated for infinitely long time prior to shutdown is:\nQ\ndecay / Q\n0 0.066t 0.2\nSetting the LHS equal to 0.005 and solving for t, we get t=4.007105 s or 4.6 days.\nc)\nThe total number of target nuclei in the sample is Nav m/A, where Nav is the Avogadro's number.\nThe total reaction rate (scatterings per second) within the sample is (Nav m/A s ). Therefore, the\ntime it takes all target nuclei on average to scatter at least once is (Nav m/A)/(Nav m/A s ) = 1/(s\n). The implicit assumption made is that the absorption cross-section of the material is negligible,\nso that the total number of target nuclei does not change with time.\nProblem 1 (50%) - Temperature distribution within a fuel pellet with non-uniform\nheat generation (adapted from Duderstadt & Hamilton textbook)\ni)\nThe linear power can be obtained from the following integration:\nR\nR\nqq\nᄁ (r)2rdr q0\nᄁ [1 a(r / R)2]2rdr q0\nᄁR2(1 a / 2)\n(1)\nii)\nThe heat equation in the pellet (for constant thermal conductivity) is:\n1 d\ndT\nd\ndT\n\nk f r dr [r dr ] q\nᄁ (r) 0\n\ndr [r dr ] rq0 [1 a(r / R)2]\n(2)\nk f\nThe boundary conditions are as follows:\n\nT=Tfo\nat r=R\ndT 0\nat r=0\ndr\nIntegrate Eq 2 from r=0 and a generic location r, to get:\ndT\ndT\nr\nr\nq0[r 2\na r 4\n2 ]\ndT q0[r a r 3\n2 ]\n(3)\ndr\ndr\nk f\n4R\ndr\n2k f\n2R\nr0\nwhere the second boundary condition was imposed. Integrating Eq 3 from r=R and a generic\nlocation r, we get:\nT (r) Tfo q0[r 2\na r 4\n] q0[ R2\na R4\n2 ]\n(4)\n2k f\n8R2\n2k f\n8R\nWhere the first boundary condition was imposed. The centerline temperature is found by setting\nr=0 in Eq 4:\nTmax Tfo 4\nq\nk\n'\nf 4\n\na\na\n(5)\nwhere Eq 1 was used to substitute q0 with q.\niii)\nSubstituting the numerical values into Eq 5, we get Tmax1044C.\niv)\nAs derived in class, the centerline temperature for the case of uniform heat generation and\nconstant thermal conductivity is:\nTmax Tfo 4\nq\nk\n'\nf\n1063C\nThe temperature in the non-uniform case is lower because, on average, the energy (heat) has a\nshorter distance to 'travel' to the heat sink (coolant) than in the uniform heat generation case.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n22.06 Engineering of Nuclear Systems\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}