{
  "course_name": "Engineering Mechanics II",
  "course_description": "This subject provides an introduction to fluid mechanics. Students are introduced to and become familiar with all relevant physical properties and fundamental laws governing the behavior of fluids and learn how to solve a variety of problems of interest to civil and environmental engineers. While there is a chance to put skills from calculus and differential equations to use in this subject, the emphasis is on physical understanding of why a fluid behaves the way it does. The aim is to make the students think as a fluid. In addition to relating a working knowledge of fluid mechanics, the subject prepares students for higher-level subjects in fluid dynamics.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 2 hours / session\n\nThis subject provides an introduction to fluid mechanics. You will be introduced to and become familiar with all relevant physical properties and fundamental laws governing the behavior of fluids and you will learn how to solve a variety of problems of interest to civil and environmental engineers. While there will be a chance for you to put your mathematical skills obtained in MIT courses 18.01, 18.02, and 18.03 to use in this subject, the emphasis is on physical understanding of why a fluid behaves the way it does. The aim is to make you think as a fluid. In addition to giving you a working knowledge of fluid mechanics, the subject will prepare you for higher-level subjects in fluid dynamics.\n\nLectures\n\nLecture notes will be distributed for each lecture, usually covering \"theoretical\" aspects (derivations, etc.) in more detail or in a different manner than done during class or in text. The subject content is defined by the material presented in\nlecture notes\n,\nrecitations\n, and\nreadings\n, so regular attendance is advisable.\n\nRecitations\n\nRecitations will illustrate and/or expand on concepts presented in lectures by working through example problems or conducting simple experiments. Material covered in recitations is often related to homework assignments and is considered part of the subject content, so regular attendance at one of the two weekly recitations is advisable.\n\nText\n\nThe following book will be used as the text for the subject, supplemented by lecture notes:\n\nYoung, Donald F., Bruce R. Munson, and Theodore H. Okiishi.\nA Brief Introduction to Fluid Mechanics\n. 3rd ed. New York, NY: Wiley, 2003. ISBN: 0471457574.\n\nReading assignments are given in the\nreadings\nsection.\n\nHomework\n\nProblem sets will be distributed at regular intervals. Each problem set is designed to build upon the material covered in the preceding lectures. Homework assignments will be prepared by teams consisting of three students. Each team will hand in one solution, with the names of team-members who contributed indicated on the cover-page. Due dates for problem sets are\nfirm\nand homework assignments will be corrected and handed back (with solutions) no later than two lectures after the due date.\n\nExams\n\nThere will be three in-class hour exams. There will also be a three-hour scheduled final exam. The exams will be closed-book, but \"cheat-sheets\" will be handed out.\n\nGrade\n\nThe grade will be based on:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n25%\n\nIn-class Exams\n\n45%\n\nFinal Exam\n\n30%\n\nIn arriving at a final letter grade, two grades will be given:\n\na grade based on all assignments and exams, and\n\na grade based on the best 7 of 9 homework assignments, best 2 of 3 in-class exams, and the final exam.\n\nThe better of the two grades will be your final letter grade in 1.060.",
  "files": [
    {
      "category": "Resource",
      "title": "ps1_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/5288e468f1ffc727d83bbb8546b7a63c_ps1_solutions.pdf",
      "content": "Comments about Problem Set 1\n\nPROBLEM 1:\n\n- There were many different answers to part (c). Some groups argued that the reason for\nthe unexpected ability of Asafa Powell to run on water was that Asafa and the lizard have\na different ratio of weight (W) to feet sole area (A) (since the area increases with L2 and\nthe weight with L3). This argument is not correct: Both parameters W and A have been\nincluded in the analysis, and therefore it doesn't matter if their ratio changes. The key to\npart (c) was thinking of which variables had not been included in the analysis.\n\nPROBLEM 2:\n\n- Some groups stated that the absolute pressure at point A is equal to atmospheric. This is\nnot true: the absolute pressure in the fluid is atmospheric 10 meters below A, so the\nabsolute pressure in A is smaller than atmospheric. How can this be possible if the\npressure of the air slightly above A is atmospheric? This is due to surface tension effects.\nThe surface tension introduces a force on the surface of the fluid, which causes a\ndiscontinuity between the pressure in the air and the pressure in the fluid below the\nsurface. So why do we usually take pabs=patm at the surface of a body of water in contact\nwith the atmosphere? Because surface tension effects are only relevant very close to the\nsurface boundaries, and we usually have a free surface of a size much larger than the\ncross-section of a capillary tube.\n\n- Remember that 1kN = 1000 N, and 1 N = 0.001 kN. For some reason, some people got\nconfused with this twice in the problem, and obtained a tube diameter 1 million times\nlarger than the correct one (which you should notice!). Be careful when converting units.\nThe numerical value must become smaller (1 to 0.001) when the unit in which you\nmeasure becomes larger (N to kN).\n\nPROBLEM 3:\n\n- Many of you seemed confused about the meaning of the accuracy of an estimate. When\nyou have a series of measurements of an unknown parameter (μ in this problem), your\nbest estimate of the true value is the mean, and the accuracy is given in terms of the\nstandard deviation. Assuming the error to be normally distributed (which is generally the\ncase), the most precise way of giving the value of the unknown parameter is as\n\n(value of the parameter) = (mean) ± 2*(standard deviation)\n\nwhere 2*(standard deviation) is the accuracy of the estimate. Due to the properties of the\nnormal distribution, you can be 95% sure that the true value of the parameter will be\nwithin ± 2 standard deviations about the mean.\n\nGENERAL COMMENTS:\n\n- In general, we think that you give too little information about how you resolve the\nproblems. It is not enough to write some equations; you need to show the details of\nyour work and explain in words what you are doing. Along the same lines, please\navoid giving a numerical answer without an explanation of where it comes from. If you\ndon't show your calculations and your numerical answer is wrong, you'll most likely get\n0 points in that part. Even if your numerical answer is right, you probably won't get full\nscore, since you are not proving that you know how to do the problem. This also applies\nto solutions obtained with a spreadsheet (which some people used in problem 3): Show\nsample calculations, not just a print with the numerical answer! When the answer is\nqualitative, you also need to explain how you came up with it. For instance, in the\ncentrifuge problem, some groups wrote that the cream ends up at the center, on top of the\nmilk, without any explanation of why this is the case. This is considered an incomplete\nanswer.\n\n- Whenever possible, don't stop working at the numerical answer or final analytical\nexpression. Instead, you can do a number of things to explore the meaning of your result:\n\n● Explain the implications of the result: How does it answer to the question asked\nin the problem? (E.g., in problem three, part c, some people wrote down the\nvalue of the standard deviation... without commenting how it relates to the\naccuracy of the estimate).\n● Check that your solution is dimensionally correct. If your answer is an\nanalytical expression, check that the dimensions of the left and right hand sides\nare the same. If it is a number, check that the units match the magnitude you are\ncalculating (i.e., a pressure must be in Pa or another pressure unit).\n● If it is a numerical answer, comment about its magnitude. Is it big or small? Is it\na reasonable value? Did you expect a result of that order of magnitude? (E.g., in\nproblem 2, some people got a diameter of 3 meters... Even if you don't find any\nmistake in your calculations, you should realize that such a result is\nunreasonably big and comment about it).\n● If your answer is an analytical expression, comment whether the dependencies\nbetween variables make sense. (For instance, in problem 3, we expect ω to\nincrease with the applied torque, so it would be surprising if ω appeared in the\ndenominator of the right hand side of the expression).\n● If your answer is an analytical expression, you may be able to analyze particular\ncases and see if the result makes sense. (E.g., in the centrigufe problem, check\nfor a horizontal surface when ω = 0).\n● Represent your solution graphically whenever possible. If it is a vector, plot it.\nIf it is a function, represent it in an x-y diagram or similar. (For instance,\nrepresent the free surface in the centrifuge problem)\n\nThis kind of analysis will give you insight into the solution. From the grader's point of\nview, it will be clear that you understand the meaning of your answer (so you may even\nget some bonus points!)."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/f608e913371a3e898478accfb0a39417_ps1.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nProblem Set 1\nDue on Tuesday, February 21st\nImportant note: Please start a new sheet of paper for each problem in the problem\nset. Write the names of the group members who contributed to the solution at the\nbeginning of each problem.\nProblem 1\nThe basilisk lizard is an animal capable of running on water by supporting its weight by\nthrusting water downwards as it runs. The force exerted by thrusting water depends on the\nfeet's sole area, A, the density of the fluid, ρ, and the speed of the animal, U .\na) Apply dimensional analysis to deduce an expression for the maximum weight that the\nbasilisk lizard can support, W , as a function of A, ρ, and U .\nb) The fastest person in the world is Asafa Powell. His 100 meter world record is 9.77\nseconds. According to your result for part a, would he be able to run on water? (Note: In\nthe expression deduced in part a, assume the constant of proportionality between the left\nhand side and the right hand side to be 1).\nc) Do you think that the application of the expression deduced in part a to part b is correct?\nIf not, why not?\n1-1\n\nProblem 2\nWhen the pressure in a liquid gets below vapor pressure, vapor bubbles are formed. This\nphenomenon is called cavitation. If these bubbles are then dragged to regions of higher\npressure, they may suddenly collapse and cause damage to the container walls.\nFigure 1: Capillary tube in Problem 2.\na) What diameter D of clean glass tubing is required to get a rise of water at 20oC due to\ncapillary action of 10 m? (See Figure 1).\nb) What is the pressure inside the tube at point A? What is the vapor pressure? Will\ncavitation occur? Assume patm = 101.3 kP a.\n1-2\n\nProblem 3\nRi\nT\nw\nl\nRo\nLiquid\nFixed Outer\nCylinder\nRotating\nInner Cylinder\nFigure by MIT OCW.\n1-3\n\nThe viscosity of liquids can be measured through the use of rotating-cylinder viscosimeter of\nthe type shown in Figure 2. In this device, the outer cylinder is fixed and the inner cylinder\nis rotated with an angular frequency, ω. The torque, T , required to maintain a constant\nω is measured and the dynamic viscosity, μ, is calculated from these two measurements.\nBy neglecting end effects and assuming the velocity distribution in the gap to be linear, an\nequation relating μ, ω, T , l, R0, and Ri may be written as\n2πRi\n3lω\nT =\nμ.\nR0 - Ri\na) Derive this equation and show that it is dimensionally correct.\nThe following torque-angular velocity data were obtained with a rotating-cylinder viscosime\nter with R0 = 6.0 cm, Ri = 5.9 cm, and l = 25.0 cm:\nTorque (N\nm)\n0.178 0.353 0.536 0.715 0.880 1.066\n·\nAngular velocity (rad/s)\n1.0\n2.0\n3.0\n4.0\n5.0\n6.0\nb) Give your best estimate of the viscosity, μ.\nc) Indicate the accuracy of this estimate.\nd) Using Appendix B in Young et al.'s book, what fluid do you think was used if the\ntemperature of the fluid was 15oC?\nProblem 1.66 in Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. Fundamentals of Fluid Mechanics.\nInstructor's Manual. 2nd ed. New York, NY: John Wiley & Sons, Inc., 1994, pp. 1-49.\n\nProblem 4\nA triangular plate of base b and height h is submerged in water, as shown in Figure 3. We\nconsider four possible shapes of the plate, (i) to (iv), as represented in the figure.\na) For shape (i), calculate the pressure force exerted by the water on the surface AB1B2.\nDetermine the position of the center of pressure. What is the relative position of the center\nof pressure with respect to the center of gravity?\nb) For shape (ii), calculate the pressure force exerted by the water on the surface A1A2B.\nDetermine the position of the center of pressure. What is the relative position of the center\nof pressure with respect to the center of gravity?\nc) Using the results from a and b, repeat the exercise for shapes (iii) and (iv). (Note: You\ncan answer this part without doing any further calculations!)\nFigure 3: Submerged triangular plates in Problem 4.\n1-4\n\nProblem 5\nA centrifuge is a device that puts a fluid in rotation around a fixed axis, simulating a\ngravitational force. Centrifuges are used in biology and biochemistry to separate compounds\nof different molecular weights, in wastewater treatment to dry sludges, and in pilot and\nastronaut training to simulate the effect of accelerations above gravity. They could even be\nused in breakfast making to separate the cream from the milk.\nFigure 4: Centrifuge in Problem 5.\nConsider the centrifuge in Figure 4. The interior container is a cylinder of radius a, which\ncontains a liquid of density ρ. Initially, the liquid is at rest and its depth is h. The centrifuge\nstarts to rotate and eventually reaches a uniform angular velocity ω. Calculate the free\nsurface elevation with respect to the still water level, η(r), once the system is in steady\nstate. If used to separate cream from milk, where would the cream end up?\n1-5\n\nProblem 6\nFigure 5: Manometer in Problem 6.\nFigure 5 shows a two-fluid manometer used to measure small pressure differences in gases,\ni.e., pa and pb are gas pressures. The two manometer chambers (A and B in the figure)\ncontain the same fluid (a liquid of density ρ) and have circular horizontal cross sections of\ndiameter D. The manometer chambers are connected through a small diameter, d, glass\ntube that contains the manometer fluid (a liquid of density ρm > ρ).\nFor a particular measurement the surfaces in the manometer chambers are assumed to be at\nthe same elevation, i.e., zA = zB , whereas the elevation difference between the two surfaces\nof the manometer fluid, i.e., the actual manometer reading, is Δzm (see figure).\na) Derive an expression relating Δzm, manometer reading, to the pressure difference Δp =\npb - pa and the two-fluid manometer densities ρm and ρ.\nb) If you expect to accurately measure a pressure difference Δp = 1 Pa, would you use a two-\nfluid manometer with fresh water and mercury (ρ = 1000 kg/m3 and ρm = 13600 kg/m3)\nor one with fresh and salt water (ρ = 1000 kg/m3 and ρm = 1025 kg/m3)? (Justify your\nanswer in quantitative terms).\nc) Why do you think it is important that the manometers chambers' diameters, D, are\nmuch larger than the manometer tube diameter, d? (Hint: Think of how this relates to the\nassumption that zA = zB ).\n1-6"
    },
    {
      "category": "Resource",
      "title": "ps2_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/11463efa234a8595e0e9538af7f3f0f3_ps2_solutions.pdf",
      "content": "PROBLEM SET 2 - SOLUTIONS\n\nComments about Problem Set 2\n\nPROBLEM 1:\n\n- Please keep in mind what the meaning of \"line of action of a force\" is. When you calculate the resultant\npressure force, you impose it to cause the same total force (1), and to cause the same moment around any\npoint (2) as the real pressure distribution. Condition (1) yields the magnitude of the resultant force;\ncondition (2) yields the line of action. The h/3 (or 2h/3) that we always use for the position of the\nresultant force equivalent to a triangular distribution comes from applying condition (2). A condition\nsimilar to (2) also applies to determine centers of gravity. So please remember condition (2) (i..e.,\nequivalence of moments) whenever you have to determine lines of action of resultant forces or centers of\ngravity.\n\n- Many groups forgot the width of the dam (100 m) in their calculations, and treat the dam as if it had unit\nwidth. A good way to realize about this kind of mistake is to check dimensions. If you forget the width,\nyour force will have units of N/m instead of N. Note that even if you forget the width your value for \"h\"\nwill be right, because the width appears in all terms and cancels out. (This is why we often study\nproblems \"per unit width\").\n\n- Part b was graded considering whether your answer was consistent to your numerical result for the\nmaximum admissible water depth, \"h(max)\":\n● If you got h(max) < 30 m, you conclude that the dam was not properly designed, because it would\ntopple over for high values of \"h\" in the dam.\n● If you got h(max) > 30 m, then you conclude that the dam is properly designed (and you need to\nexplain why).\n● If you got h(max) >> 30 m, then you conclude that the dam is not properly designed, because\neven if it is safe (it won't topple over), it's probably overdimensioned (i.e., you could build a\ncheaper dam with less material by reducing the base).\n\nPROBLEM 2:\n\n- Please remember that pressure is a scalar magnitude, not a vector! With this I mean that, at a certain\npoint, it has the same magnitude in all directions (it is isotropic). It always acts perpendicularly to\nsurfaces (this is a consequence of the definition of pressure, and therefore it is not an assumption, as\nsome groups wrote). Now, if pressure is not a vector, why do we draw all those little arrows to represent\nits direction? Those little arrows represent the direction of the pressure force on the surface, which is\nnormal to it and therefore has a direction. The pressure itself is isotropic, so if we change the direction of\nthe surface, the pressure force will change direction to become perpendicular to the surface, but its\nmagnitude will remain constant. If you don't have these concepts clear, you should review the notes from\nRecitation 1 and Lectures 3 and 4.\n\nPROBLEM 3:\n\n- Please avoid writing your results with too many decimal values. Remember that your results have a\nprecision, and are not totally exact (e.g., you know gravity with an accuracy of ± 0.5%, and most of your\ndata have limited precision as well). So, for instance, don't write that the raft is submerged to a depth of\n0.496585365 m, but to 0.497 m. The second value makes more sense, because you are acknowledging\nthat you don't have enough precision to determine the four decimal place.\n\n- Some groups didn't know the meaning of the metacenter. They confused it with the center of buoyancy\nor the center of gravity. Please refer to the typed notes from Recitation 2 and to the solution to the\nproblem a few pages below.\n\n- A useful thing to remember from this problem is the following shortcut to calculate moments of inertia\nin symmetric sections: If the section is symmetric with respect to \"x\" or \"y\" (just one is enough), then it\nis always true that Ixy = 0 (since Ixy involves odd integration both in \"x\" and in \"y\"). Besides, it is also\nalways true that Ixx and Iyy are the principal moments of inertia, meaning that one is the maximum and\nthe other is the minimum. (This property is usually taught in Freshman Physics). In this particular case,\nwhere Ixx = Iyy, the maximum and the minimum are the same, so the moment of inertia with respect to\nany other axis is also the same.\n\nProblem #4\nGenerally, everyone did well with the derivations. The conclusions reached about the accuracy of the\napproximation (U) in part c could be made stronger by providing some error calculations. With the\nexception of one or two groups, all should make neater graphs (use Excel if possible).\n\nProblem #5\nGenerally, everyone did well on this problem. A few groups got tripped up on setting up the manometry\nand Bernoulli equations. For manometry, it's a good idea to start with pressure at one point and work\nyour way around to pressure at another point so that your signs are correct and to help ensure that you\ndon't leave anything out. It's easiest to use\nBernoulli along the streamline that runs through the centerline of the pipe; in this case, you can cancel out\nthe (rho*g*z) terms on both sides since z_a = z_b. One other thing to keep in mind to make future\ncalculations easier is that the density of air can usually be neglected in a problem like this because the\ndensity of air is much less than the density of water. (Note that I did not take points off if you included\nthe density of air in your calculations). It's also always a good idea to check the units of your answer to\nmake sure that\nyour answer makes sense.\n\nProblem #6\nThe concept that gave most groups trouble with this problem was in part b. Without any flow, the\npressure would vary hydrostatically and we could use Bernoulli to find that p_b is about 3780 Pa greater\nthan p_a. If the flow were to be directed uphill, the pressure at b would need to exceed this amount to\novercome the effects of gravity. Since the pressure difference between a and b is negligibly small\n(compare pressure difference to atmospheric pressure), the flow will be\ndirected from a to b (downhill). Some groups also did not fully explain why the pressure difference\nbetween A and B would be the same as between A' and B'. The flow is well-behaved, and the distances\nbetween A - A' and B - B' is equal. You can thus show using Bernoulli that pressure difference between\nA and B is the same as between A' and B'.\n\n6 :\n\nt"
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/214edd398a166e8e8a2d04212b68a37d_ps2.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nProblem Set 2\nDue on Monday, February 27th\nImportant note: Please start a new sheet of paper for each problem in the problem\nset. Write the names of the group members who contributed to the solution at the\nbeginning of each problem.\nProblem 1\nFigure 1: Dam in Problem 1.\nYou work in the quality control division for an engineering consulting firm. Your company\nhas been hired to design a concrete dam to aid in the creation of a new reservoir. A junior\nconsultant (an MIT grad) has submitted the final plans for the dam (See Figure 1). Your\njob is to check to make sure that the dam is properly designed and will not topple over\nabout its pivot point A (it is assumed that the dam will not slide). In order to do this, you\nneed to figure out at what water depth (h) the dam will topple over. You are given the\nfollowing data: The depth of the river downstream of the dam is 10 m and is kept constant,\nthe density of the concrete is 2300 kg/m3, the height of the dam is 30 m, the base of the\ndam is 15 m long, the dam and the reservoir are 100 m wide (into the page), and water\ncannot leak under the base of the dam.\na) At what water depth h will the dam topple over about its pivot point A?\nb) Is the dam properly designed?\n2-1\n\nProblem 2\nFigure 2: Gate in Problem 4.\nA senior engineer (a Harvard grad) designed the gate in Figure 2. The gate consists of a\nvertical section, AC, and an inclined section, CD, which are rigidly connected to each other\nat C. The gate is hinged at D, and is kept in place by a single wire EC. Assume the gate to be\nof 1 meter length into the plane of the paper. The weight of the gate is assumed negligible.\nThe gate ACD retains water, ρ = 1000 kg/m3, to its left. On the right of the gate, there is\nair.\na) Sketch the pressure distribution along ACD and specify the values of the pressure at\npoints A, B, C, and D.\nb) Determine the total pressure force acting on AC, FAC (magnitude, direction, line of\naction).\nc) Determine the total pressure force acting on CD, FCD (magnitude, direction, line of\naction).\nd) Determine the force exerted by the wire EC.\ne) Determine the horizontal and vertical forces acting on the hinge at D.\n2-2\n\nContent removed due to copyright reasons.\nPlease see:\nBonillo Martinez, Juan J., Jeronimo Puertas Agudo, and Ricardo Juncosa Rivera. Problemas de Hidraulica.\nEscuela Tecnica Superior de Ingenieros de Caminos, Canales y Puertos. Universidad de La Coruna. July, 2002.\n2-3\n\nContent removed due to copyright reasons.\nPlease see:\nBonillo Martinez, Juan J., Jeronimo Puertas Agudo, and Ricardo Juncosa Rivera. Problemas de Hidraulica.\nEscuela Tecnica Superior de Ingenieros de Caminos, Canales y Puertos. Universidad de La Coruna. July, 2002.\n2-4\n\nProblem 4\nFigure 4: Turbulent flow characteristics in Problem 4.\nFor a 2-D steady turbulent flow, the shear stress distribution is given by (see Figure 4)\nμ\ny ¶\nτyx = τ = τ0 1 -\n.\n(1)\nh\nShear stress is related to velocity gradient, just as in laminar flow, i.e.,\n∂u\nτ = ρνt\n(2)\n∂y\nbut for a turbulent flow the turbulent viscosity, νt, is not a material constant but a function\nof the flow itself. A widely accepted model is\ny\nνt = κu∗(y + y0)(1 - )\n(3)\nh\nin which κ = 0.4 is a constant (known as von Karman's constant), u∗ =\nq\nτ0/ρ is called the\nshear velocity, and y0 is the bottom roughness length, y0 ¿ h.\na) Combine (1) through (3) to obtain the equation governing the velocity profile for a tur\nbulent flow, u(y), and solve this equation for u(y) subject to the no-slip boundary condition,\nu = 0 at y = 0.\nb) Show that the depth-averaged velocity, U , can be expressed as\nu∗\nU - us = U - u(y = h) = - κ\nor\nU = u∗ ln h\nκ\ney0\nwhen y0 ¿ h is used.\nc) For u∗ = 4 cm/s, κ = 0.4, h = 2 m, and y0 = 0.3 mm, plot u(y) and compare it to U .\nComment on how comfortable you would be if you were to approximate u(y) by U .\n2-5\n\nProblem 5\nWater flows through the pipe contraction shown in Figure 5. The fluid in the manometer\ntube is air. For the given 0.2 m difference in the manometer level, determine the flowrate as\na function of the diameter of the small pipe, D.\nFigure 5: Pipe contraction in Problem 5.\n2-6\n\nProblem 6\nWater, ρ = 1000 kg/m3, is flowing in a circular pipe of diameter d = 5 cm (See Figure\n6). The pipe is inclined at an angle β = 10.9o to horizontal, and is connected to a mercury\nmanometer (ρm = 13.6ρ) through two pressure taps (A and B) located at a distance l = 2.0 m\napart at the highest point of the perimeter, i.e., a distance of 2.5 cm above the centerline of\nthe pipe (denoted by CL in sketch).\na) For a manometer reading of hm = 3.0 cm determine the pressure difference, pA - pB ,\nbetween the two pressure taps A and B.\nb) Sketch the streamlines for the flow in the pipe and indicate the direction of flows by\narrows (justify your choice of direction).\nc) Is the pressure difference between points A0 and B0 located on the centerline of the pipe\nthe same as the pressure difference obtained in a and, if so, why?\nFigure 6: Inclined pipe in Problem 6.\n2-7"
    },
    {
      "category": "Resource",
      "title": "ps3_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/3873ecc8a73ebba71a80fb5f4d0e5681_ps3_solutions.pdf",
      "content": "PROBLEM SET 3 - SOLUTIONS\n\nComments on Problem Set 3\n\nPROBLEM 1:\n\n- Remember that we want the flownet to be formed by square cells. Many of your flownet cells in the\nregion next to the gate didn't look very square. This means that your streamlines are not right (so you\nare not capturing how the fluid flows) and that you don't have enough precision to obtain vt from the\nflownet in part c. Some groups got a weird-looking flownet because they forced the streamlines to be\nequally spaced under the gate (see second sketch in next page). This doesn't happen in reality, so\nthese groups were unable to get square cells. In reality, the flow is only uniform far upstream and far\ndownstream the gate. In the gate region, since all the flow is forced to pass under the gate, we will\nhave a larger velocity next to the tip of the gate than next to the bottom of the duct. For this reason,\nthe streamlines are not equally spaced in this region, but closer to each other next to the tip of the\ngate.\n\n- In part b, v0 = v1 because of conservation of volume. The only condition required for conservation\nof volume to be true is that the fluid is incompressible. Some of you claimed that v0 = v1 only if we\nneglect viscosity. This is not the case: v0 = v1 is true even if we have viscous effects.\n\n- Bernoulli equation is only applicable\nbetween two points on the same streamline!!\nTo relate the pressure at \"T\" with the pressure\nat \"0T\" (see sketch) on part d, many groups\napplied Bernoulli between the point \"0T\" and\n\"T\". However, the flownet shows you that\n\"0T\" and \"T\" are on different streamlines, so\nyou cannot apply Bernoulli to relate their\npressure values! It happens that, in this\nproblem, the result you get by applying\nBernoulli between \"0T\" and \"T\" is the right\none (but this is by luck!) The reason of this\n\"lucky coincidence\" is that all points at the\ninflow (section I-I) have the same value of\np+ρgh (because flow is well behaved in I-I and pressure varies hydrostatically), and also the same\nvalue of the velocity (because flow is uniform at the inflow). However, this is just luck, and in\ngeneral you can only apply Bernoulli between two points on the same streamline.\n\n- Many people got confused about how to solve \"weirdos\" (the non-square looking cells next to\ncorners). Prof. Madsen said that you can check whether your \"weirdo\" is ok by subdividing it (i.e.,\ninterpolating one streamline and one equipotential line) and seeing if the \"sub-weirdos\" look square.\nHowever, this is only going to work if your \"weirdo\" has about the same \"horizontal\" and \"vertical\"\ndimensions to start with! Some of you got \"weirdos\" that looked very far from squares (with one\ndimension much larger than the other) and tried to justify that they were ok by interpolating a\nstreamline and dividing the rectangular \"weirdo\" into two squares... Nonononono... You have to\ninterpolate one streamline AND one equipotential line, otherwise you are cheating! If your \"weirdo\"\nlooks very non-square (i.e., long and thin) to start with, you have to modify your flownet. Let's\nanalyze a couple of examples:\n\nThis is an example of a reasonably good flownet. I have\nsubdivided the upper-right weirdo (the one inside the\ncircle) twice. First, I introduced a new streamline AND a\nnew equipotential line (both are drawn as solid lines) to\nget four sub-weirdos that look reasonably square. Again,\nI subdivided the two upper sub-weirdos (now I used\ndashed lines) and get sub-sub-weirdos that are again\nreasonably square. Therefore, I conclude that the\nflownet looks right.\n\nThis is an example of a bad flownet (copied from one of\nthe answers to the problem set). The upper right weirdos\nlook very long and thin, that is, not square at all. No\nmatter how you try to subdivide them, there is no way\nyou can get sub-weirdos that look square (unless you\ncheat interpolating streamlines only!). At the same time,\nthe lower right cells look quite short and fat. The way of\nfixing this flownet is by re-drawing the streamlines\nupwards,\nand\nmodifying\nthe\nequipotential\nlines\naccordingly, to get something similar to the flownet in\nthe previous example. Note that this correction is going\nto make the streamlines closer to each other near the tip\nof the gate, and therefore the value of vt from the\ncorrected flownet is going to be larger.\n\nPROBLEM 2:\n\n- Most groups did well on this problem. However, most of you didn't explain why the highest point\nof the siphon is the most critical one (i.e., has the smallest pressure). To justify this, you apply\nBernoulli along the pipe (you can do this because the streamlines go along the pipe). Since p+ ρgh +\nρv2/2 is constant along the pipe, and continuity dictates that velocity is the same everywhere, the\npressure will be smallest when h is highest, i.e., the smallest pressure happens at the highest point. I\nguess most of you knew this, but many of you didn't write it down (and lost a couple of points). As\nwe (David and Sal) have already said a few times, many of the groups should give more details about\ntheir assumptions and calculations.\n\nPROBLEM 3:\n\n- You also did pretty well on this one, in general. Remember that if V(centerline) is within 3% of\nV(average), this means that 0.97 V(ave) < V(cl) < 1.03 V(ave). Some groups considered only one of\nthe two limits. And again, try to give more detailed explanations of your solution procedure. Many\ngroups didn't explain very well how they got the result from the spreadsheet (the problem said \"be\nsure to include sample calculations\"!) And it's considered not being nice with the TA to hand in a\nproblem with a bunch of numbers and equations and not a single word...\n\nCOMMENTS ON PROBLEMS 4 TO 6:\n\nAlmost all groups made many careless math errors throughout (i.e. negative signs, etc). Always\nremember to go back and make sure your answer makes physical sense - this will help you catch\nsome of these errors.\n\nProblem #4:\nFor parts c and d, the change in H over change in time is equal to (-) w_i. A few groups forgot the\nnegative sign here - it indicates a downwards velocity (assuming positive is in the upwards direction).\nFor part f, many groups forgot the extra r when integrating over the area (2*pi*r*dr). Also, when\nsubstituting d_i/2 in for r in part f, some groups forgot to also raise the denominator to the power (i.e.\nr4 = d_i4/16).\n\nProblem #5:\nIt seemed that a few groups had a bit of trouble developing the underlying concept of the problem -\nthat the rate of change of the number of particles = (inflow + source) - (outflow + sink). Thus, the\ngoverning equation ends up as a differential equation.\n\nProblem #6:\nMany groups got a bit tripped up with calculating the angle in part b. This was mainly because of\nradian -> degree conversion or because they forgot to convert omega into rad/s from rps. On the last\npart, some groups got an incorrect value for lift force which made it seem like the model was valid\nmathematically. However, no qualitative reasoning were provided to back up the calculations.\nAlways revisit your assumptions when commenting on how well a model approximates. Even if you\nthink your answer is correct, taking a look at the assumptions (i.e. modeling a sphere as a cylinder)\nmight show some incosistency.\n\nGOOD LUCK ON THE TEST!\n\nContent removed due to copyright reasons.\nPlease see:\nProblem 3.22 in Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. Fundamentals of Fluid Mechanics.\nInstructor's Manual. 2nd ed. New York, NY: John Wiley & Sons, Inc., 1994, pp. 3-20."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/b62c73f0b4b973c4e03bd319cce3dfff_ps3.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nProblem Set 3\nDue on Monday, March 6th\nImportant note: Please start a new sheet of paper for each problem in the problem\nset. Write the names of the group members who contributed to the solution at the\nbeginning of each problem.\nProblem 1\nFigure 1: Rectangular duct in Problem 1.\nA gate of length h/2 is present in a horizontal wide rectangular duct, as shown in Figure 1.\na) Sketch a flow net using 4 stream tubes.\nb) In the figure, v0 and v1 are the velocities in the center of the duct far upstream and far\ndownstream the gate. Is v0 = v1?\nc) Estimate from your flow net the mean velocity slightly below the tip of the gate, vt,\nrelative to v0.\nd) Estimate the pressure slightly below the tip of the gate, relative to the pressure at the\nsame level far upstream.\n3-1\n\nContent removed due to copyright reasons.\nPlease see:\nProblem 3.56 in Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. Fundamentals of Fluid Mechanics.\nInstructor's Manual. 2nd ed. New York, NY: John Wiley & Sons, Inc., 1994, pp. 3-50.\n3-2\n\nContent removed due to copyright reasons.\nPlease see:\nProblem 3.22 in Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. Fundamentals of Fluid Mechanics.\nInstructor's Manual. 2nd ed. New York, NY: John Wiley & Sons, Inc., 1994, pp. 3-20.\n3-3\n\nProblem 4\nFigure 4: Concentric cylinders in Problem 4.\nFigure 4 shows an inner circular cylinder of diameter di placed concentrically inside an outer\ncylinder of diameter d0. The inner cylinder is being pushed vertically into the outer cylinder\nat a constant downward velocity of Wi. The outer cylinder was originally filled with a fluid\nof density ρ to a level of h0 above its bottom.\na) Sketch the streamlines of the flow under the inner cylinder as seen from the top (i.e., the\nstreamlines in the white circle in the \"Top view\" of Figure 4).\n3-4\n\nb) Denoting the height of the gap between the two cylinder bottoms by H, derive an ex\npression for the depth of water in the outer cylinder, h, for H ≤ h0 (assume the free surface\nto be horizontal).\nc) Derive an expression for Vi, the horizontal velocity in the radial direction averaged over\nthe gap height, H, at the outflow from under the inner cylinder, i.e., Vi at r = di/2.\nd) How does the gap-averaged radial velocity, V (r), vary with r for 0 ≤ r ≤ di/2?\ne) Assume that Vi and V (r) are known and that the pressure at the outflow corner of the\ninner cylinder, r = di/2, is pi = ρg(h - H). Obtain an expression for p(r) as a function of\nthe known values. For this part, you can neglect the pressure variation with z in the gap\nbetween the two cylinder bottoms and any effects of unsteadiness.\nf ) With what vertical force is the inner cylinder being pushed downwards? Neglect the inner\ncylinder's weight.\n3-5\n\nContent removed due to copyright reasons.\nPlease see:\nProblem 4.57 in Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. Fundamentals of Fluid Mechanics.\nInstructor's Manual. 2nd ed. New York, NY: John Wiley & Sons, Inc., 1994, pp. 4-51.\n3-6\n\nProblem 6\nTo throw a curveball, a pitcher has to put a spin on the ball. This spin causes the ball to\ndeflect from a straight trajectory, through a physical mechanism called the Magnus effect.\nFigure 6: Cylinder in Problem 6.\nWe will study a simplified 2-D version of this phenomenon, in which the ball will be modeled\nby a cylinder of the same radius. Figure 6 shows a cylinder of radius a spinning in counter\nclockwise direction at an angular speed Ω. In the far field, there is a uniform wind velocity\nU towards the left. For simplicity, we will adopt a 2-D polar coordinate system (r, θ) with\norigin at the center on the ball, as represented in the figure. In this coordinate system, the\nvelocity vector has components (ur , uθ ). Ignore the arrow marked with an L until part e.\nGravity is neglected in this problem.\nFor this flow, the velocity potential is given by\nA\na2 !\nφ = -U\nr +\ncos θ + a 2Ωθ.\nr\nIn 2-D polar coordinates, the velocity field is related to the velocity potential through\n∂φ\n1 ∂φ\nur =\n,\nuθ =\n.\n∂r\nr ∂θ\na) Deduce the expression for the velocity field, (ur , uθ ).\nb) The radius of a baseball ball is a = 3.75 cm. In a curveball, the ball moves at a speed of\nabout U = 30 m/s and rotates at an angular speed of Ω = 25 rps. Deduce the location of\nthe stagnation points in the flow for these values of the parameters.\nc) Based on your knowledge of the stagnation points and the far field velocity, sketch the\nstreamlines for the values of a, U, and Ω given in b.\n3-7\n\nd) By applying Bernoulli's theorem between a point in the far field, A, and a point on the\ncylinder surface, B, show that the pressure on the cylinder surface (r = a) is given by\np(r = a, θ) = ρ\nU 2(1 - 4 sin2 θ) - (aΩ)2 - 4aΩU sin θ\n\nwhere ρ is the air density.\ne) Calculate L, the lift force per unit length (perpendicular to the plane of the paper) exerted\nby the flow on the cylinder, by integrating the vertical contribution of the pressure force on\nthe cylinder surface.\nf ) Estimate the lift force on a baseball ball by assuming it equivalent to a cylinder of length\nl = 2a and taking the values of a, U , and Ω given in b. If the weight of a baseball ball is\n1.4 N , estimate the ratio between the lift force and the weight. Measurements show that,\nfor the given parameter values, the lift force in a real baseball ball is about 1/3 of its weight.\nHow well does our model work?\n3-8"
    },
    {
      "category": "Resource",
      "title": "ps4_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/0a7b54e335fc0ca6f636923234e8f94a_ps4_solutions.pdf",
      "content": "PROBLEM SET 3 - SOLUTIONS\n\nComments on Problem Set 4\n\nPROBLEM 1:\n\n- Be careful with the directions of the \"other forces\" when you apply momentum conservation in a control\nvolume. Typically, you draw and calculate the forces exerted by the surroundings on the control volume of\nfluid. At the end, you need calculate the forces exerted by the fluid on the surroundings (in this case on the\npipe), which have the same magnitude as the forces on the fluid but opposite direction. Many groups\ncalculated \"Fx\" and \"Fy\" without specifying if those were the forces on the fluid or the forces on the pipe,\nand some groups got confused because of this.\n\n- Onto the same issue, the best way to specify the direction of a force is to show it in a sketch.\n\nPROBLEM 2:\n\n- Remember that we have seen two ways of applying conservation of energy. First, you can apply Bernoulli\nbetween two points along a streamline. This is our good old expression:\n\nz1 + p1/(ρg) + v1\n2/(2g) = z2 + p2/(ρg) + v2\n2/(2g) + (losses between 1 and 2)\n\nwhere z1, p1, and v1 are the elevation, pressure, and velocity at point 1 (same for point 2). We used this many\ntimes in the old times (a.k.a. before test 1) when we assumed inviscid flow and didn't have losses. Now, we\nare dealing with real flows, in which there are usually losses. Furthermore, these real flows are not usually\nuniform in the cross-section, and we are not usually interested in determining velocities at specific points of\nthe cross-section. Rather, we are interested in determining the \"cross-sectional averaged\" properties of the\nflow, and thus we work with the cross-sectional average velocity, V. For this reason, we have developed the\ncontrol volume analysis, which deals with cross-sectional averaged quantities. The conservation of energy\nbetween the inflow and the outflow of a Control Volume reads\n\nz1,CG + p1,CG/(ρg) + V1\n2/(2g) = z2,CG + p2,CG/(ρg) + V2\n2/(2g) + (losses between 1 and 2)\n\nIt looks similar to our old good Bernoulli, but it is conceptually different! Now we apply conservation of\nenergy between two sections (not two points), which are the inflow and the outflow of our Control Volume.\nz1,CG is the elevation of the center of gravity of section 1, p1,CG the pressure at the center of gravity of section\n1, and V1 the average velocity in section 1 (not the velocity at a particular point). So, in the future, be\nexplicit about which version of Bernoulli you are applying, and between which and which section (or which\nand which point).\nNOTE: To apply conservation principles, the control volume must always be chosen so that the flow is well-\nbehaved both in the inflow and the outflow. For this reason, pressure is hydrostatic at these sections.\nTherefore, the piezometric head, z1,CG + p1,CG/(ρg), is constant in all the points on the inflow section (and\nsame for the outflow), and you can evaluate the sum of these two terms at any point, not necessarily at the\ncenter of gravity.\n\nPROBLEM 3:\n\n- Notice that the reason why we can neglect the headloss in problems 1 and 3 is because in both cases we\nhave a short transition of a converging flow. Since the transition is short, the friction loss is very small.\nSince the flow is always converging, there is no minor loss.\n\nProblem #4:\nA few groups didn't have the formula for head loss quite right - we must also take into account the elevation\ndifference from one side of the hydraulic jump to the other. The formula can easily be derived from the\nequation: H_1 = H_2 + HL_(1-->2). See solutions for details. A handful of groups also answered the last\npart incorrectly. Conceptually, if we lose energy going from 1 --> 2, we'd have to gain energy if we went\nfrom 2 --> 1 (by conservation of energy). This would yield a negative head loss and negative energy\ndissipation (which implies a head gain and energy gain). This situation is physically impossible, so the flow\nonly goes from 1 to 2. See solution for mathematical solutions.\n\nProblem #5:\nDon't ever assume that two graphs are the same simply by looking at a single plot! They may look the same\nwith the scale you've used, but there still may be large errors. Such is the case in this problem for values of y\nnear the bottom (y = 0) where errors reach 25%. Everyone lost a point or two on this. Also, use Excel or\nanother graphing program to make your plots. Handwritten plots are not acceptable (especially when units\nand other things are missing), especially for something like this where you have to be very accurate. If you\ndon't know how to make graphs in Excel, ask the TAs. It's an important skill that you'll be able to use\nthroughout your MIT life and beyond.\n\nProblem #6:\nDon't forget to explicitly say which way the force is acting.\n\n- PROBLEM No. 2:"
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/0e8b7af49e03a20f0ad58b73095ed29e_ps4.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nProblem Set 4\nDue on Monday, March 20th\nImportant note: Please start a new sheet of paper for each problem in the problem\nset. Write the names of the group members who contributed to the solution at the\nbeginning of each problem.\nProblem 1\nA converging elbow turns water through an angle of 90 degrees in a vertical plane, as shown\nin Figure 1. The flow cross-sectional diameter is 40 cm at the elbow inlet (section A), and\n20 cm at the elbow outlet (section B). The elbow flow passage volume is 0.15 m3 . An oil of\nspecific gravity 0.85 flows through the elbow. The elbow inlet pressure (section A) is 150 kP a\nand the elbow outlet pressure is 130 kP a. Sections A and B have the same elevation.\nFigure 1: Elbow junction in Problem 1.\nCalculate the horizontal (x-direction) and vertical (z-direction) forces exerted by the fluid\non the elbow. Neglect losses.\nNOTE: Gravity is acting in the -z direction.\n4-1\n\nProblem 2\nIn a hydraulic structure, known as a drop structure, a free surface flow in a rectangular\nchannel flows over a brink, drops in a free fall, and impacts the horizontal bottom of the\ndrop at an angle β. The plane jet's impact with the bottom causes it to split up into two\nseparate jets -one to the left, the other to the right. The impact of a plane jet at an angle\nβ to a surface forms an important part of the hydraulic analysis of a drop structure and is\nshown idealized in Figure 2. This is the problem you are asked to solve.\nFigure 2: Idealized impact in drop structure (Problem 2).\nThe velocity of the plane jet incident on the plate at angle β is U0 and its thickness is h0.\nThe jet splits into two with thicknesses and velocities hl, Ul and hr , Ur , respectively.\na) Neglecting gravity determine the vertical force (per unit length into paper) exerted by\nthe jet impact on the plate.\nb) Assuming that U0 = Ul = Ur and neglecting friction along the plate, determine the\nthicknesses of the split jets, hl and hr .\nc) If gravity (i.e., elevation head differences) and losses are neglected, show that application\nof Bernoulli's equation along streamlines leads to the assumption of U0 = Ul = Ur made in\npart b.\nd) If U0 = 14 m/s, how large could the vertical scale, lv (shown in the figure), be before you\nwould start worrying about having neglected gravity (elevation differences) in part c above?\n4-2\n\nProblem 3\nWater flow in open channels can be controlled and measured with a sluice gate. Water flows\nunder the gate in a wide channel as shown in Figure 3. Sections 1 (depth h1) and 2 (depth\nh2) are respectively located at moderate distances upstream and downstream of the gate.\nAt these sections, the flow is uniform and well behaved. The depth directly under the gate,\nd, is 1.00 m. The coefficient of contraction for the outlet of the gate is 0.61. Bottom friction\ncan be neglected.\nFigure 3: Sluice gate in Problem 3.\na) If h1 is measured and found to be 3.00 m, what is the discharge per unit width, Q?\nb) Find the depth along upstream face of gate, hA.\nc) For these flow conditions, what is the horizontal force on the gate due to the fluid?\nd) If the pressure variation on the gate were hydrostatic, what would be the total horizontal\nforce on the gate?\ne) Why is the force obtained for d different from the force obtained for c?\n4-3\n\nProblem 4\nFigure 4 shows the phenomenon of hydraulic jump in a rectangular channel, where a rather\nabrupt change occurs in the depth of the flow.\nFigure 4: Hydraulic jump in Problem 4.\na) The upstream depth and velocity are h1 = 1 m and V1 = 10 m/s. Use continuity and\nmomentum conservation (with no friction) to calculate the downstream depth and velocity,\nh2 and V2.\nb) For these flow conditions, calculate the headloss and the rate of energy dissipation in the\nhydraulic jump.\nc) If flow direction was changed, i.e., if flow was from right to left, and you knew h2 and V2\nto have the values obtained in a, show that h1 and V1 would also have the same values as in\na.\nd) Now, for the reversed flow (flow from right to left), what is the difference in total head\nbetween inflow and outflow? What is the rate of energy dissipation? What is wrong with\nthis picture?\n4-4\n\nProblem 5\nThe vertical velocity distribution for water flow in a wide rectangular open channel of depth\nh can be approximately described by a power-law profile\n¶1/n\nμ y\nu = us\n(1)\nh\nwith n ≥ 1, where us is the maximum velocity, which happens at the surface, and 0 ≤ y ≤ h\nis the vertical coordinate (y = 0 at channel bottom).\na) Find the depth-averaged velocity U as a function of n and us.\nb) Find the momentum coefficient Km as a function of n.\nc) Find the energy coefficient Ke as a function of n.\nIn Problem Set 2, Problem 4, we deduced that the velocity profile in an open channel\nis given by a logarithmic law. Now we want to approximate this logarithmic law by the\nsimpler power-law profile given by (1). Assume the flow characteristics given in Problem Set\n2 (u∗ = 4 cm/s, h = 2 m, and y0 = 0.3 mm) for the remainder of the problem.\nd) Taking us in the power-law profile equal to the surface velocity in the logarithmic profile,\ncalculate the value of n for which both profiles yield the same total discharge. Represent\nboth profiles on the same figure and comment on the accuracy of the approximation.\ne) Use your power-law profile approximation to estimate the values of Km and Ke for the\nlogarithmic profile.\n4-5\n\nProblem 6\nFigure 5 shows a section of a horizontal pipe in which a nozzle-sleeve is inserted. The pipe has\na square cross-section with a sidelength of ap = 10 cm, and the nozzle-sleeve introduces\na smooth transition that reduces this sidelength to aN = ap/2. A mercury manometer\n(ρm = 13.6ρ) is connected to the pipe as shown and gives a reading of hm = 6.1 cm. Effects\nof wall friction are neglected.\nFigure 5: Pipe with nozzle-sleeve in Problem 6.\na) Determine the discharge in the pipe, Q.\nb) Determine the headloss associated with the nozzle-sleeve inserted in the pipe.\nc) Determine the force exerted by the flow on the nozzle-sleeve. (Hint: Since you can\ncalculate the pressure difference between sections 1-1 and 3-3, you can obtain the force by\nanalyzing the control volume between these two sections).\n4-6"
    },
    {
      "category": "Resource",
      "title": "ps5_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/6b4d9b766feab083b0e9b55f24b80d5a_ps5_solutions.pdf",
      "content": "PROBLEM SET 5 - SOLUTIONS\n\nComments on Problem Set 5\n\nPROBLEM 1:\n\n- To solve part (a), you apply Bernoulli between the reservoir and the vena contracta location.\nThus, you calculate the velocity at vena contracta, VVC. The discharge is Q=VVCAVC, where\nAVC=CVAP is the area at vena contracta, AP=πD2/4, and CV=0.6 (or 0.61) is the contraction\ncoefficient. Some people applied Bernoulli between the reservoir and the center of the orifice, and\nthe multiplied the resulting velocity by AP to obtain Q. This is incorrect: You cannot apply\nBernoulli between the reservoir and the orifice because flow at the orifice is not well behaved\n(streamlines are not straight and parallel). For this reason, pressure is not linear, and the pressure\nat the center of gravity of the orifice is not atmospheric.\n\n- In part (c), pressure at vena contracta must be 0 (i.e., atmospheric). You could have predicted\nthis without doing any calculation: Since you chose the length of the pipe to give the same\ndischarge as in the free outflow, the conditions at vena contracta with and without pipe are\nidentical, and therefore the pressure is the same, 0.\n\n- Pipe velocities are on the order of 1 m/s. Values between 0.1 m/s and 10 m/s are thus\nreasonable. But if you obtain a pipe velocity of 0.001 m/s, you probably did something wrong\n(unless it's reasonable to expect almost no flow in the pipe). Same if you obtain a velocity of 100\nm/s.\n\n- Negative pressures in pipes are possible, since we are talking of gauge pressures (relative to\natmospheric). If you get negative pressures, you should check for cavitation. However, absolute\npressure is always positive (there is no traction in fluids!) and, for this reason, the minimum\ngauge pressure you can obtain is -patm (abs) ~ -101300 Pa. Therefore, if you obtain p=-200kPa,\nyou must have done something wrong, and you should check your calculations (or, if you are in a\ntest and have no time, write down that the result is obviously wrong for the reasons mentioned\nabove).\n\nPROBLEM 2:\n\n- To solve this problem, you apply Bernoulli between the section of the pipe right below the\nhouse (call it section 1) and the outflow (call it section 2). You cannot apply Bernoulli between\nthe basement of the house (the point at z = zb = 3 m) and the outflow, because these two points are\nnot on a streamline. In fact, the water in the vertical tube from the house is stagnant (hydrostatic\npressure). So, the tube it is working as a piezometer, indicating the value of z+p/(ρg)=zb. The total\nhead at section 1 is therefore zb + V2/(2g).\n\nPROBLEM 3:\n\n- In this problem you don't know the velocities in the pipes, so you cannot calculate the Reynolds\nnumbers necessary to determine f1 and f2 and you have to iterate. The best way to iterate is the\nfollowing: Assume rough turbulent flow (i.e., very large value of the Reynolds numbers). With\nthe relative roughnesses of the pipes, enter the Moody diagram and obtain a first estimate of f1\n\nand f2. Now you can calculate V1 and V2. With this, you calculate the Reynolds numbers and,\nusing the Moody diagram, you get new values of f1and f2. And you keep doing this until your\nresults converge.\n\n- The minor loss in a sudden expansion from a smaller to a larger conduit, such as point B, is\ngiven by (V1-V2)2/(2g). There is a graph in the book that gives the value of KL for this kind of\nexpansion as a function of A1/A2. But who wants to use a graph when you have the exact\nanalytical expression? (Particularly when the analytical expression is so simple as this one). Note\nthat you can relate V1=4V2 by continuity, and the previous analytical expression gives you KL1 (to\nbe multiplied by V1\n2/(2g)) or KL2 (to be multiplied by V2\n2/(2g)), as you prefer.\n\n- Please take a careful look of my plot of the EGL and the HGL, and make sure you understand\nhow to draw them, including all the detail features (minor losses, velocity head at vena contracta,\netc.)"
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/0d7885c07c8a0417736096e6338e2511_ps5.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nProblem Set 5\nDue on Wednesday, April 5th\nImportant note: Please start a new sheet of paper for each problem in the problem\nset. Write the names of the group members who contributed to the solution at the\nbeginning of each problem.\nProblem 1\nFigure 1: Outflow from a container in Problem 1.\nA very large container of water, ρ = 1000 kg/m3 and ν = 10-6 m2/s, has its free surface\nlocated a distance of h = 3 m above a sharp-edged circular orifice of diameter D = 10 cm.\nThe flow from the container proceeds, as sketched in Figure 1, through the orifice into a\nD = 10 cm diameter horizontal circular pipe of a roughness 2 = 0.2 mm and length l.\na) Determine the discharge, Q0, through the orifice if l = 0, i.e., there is no pipe.\nb) Determine the length of the pipe l > 0 required to give the same discharge, Ql = Q0 as\nobtained in a.\nc) For condition considered in b determine the pressure of the location of vena contracta for\nthe inflow to the pipe, and the pressure after the flow expands from vena contracta to the\nfull pipe.\nd) If l is smaller than the value obtained in b, would the discharge be larger or smaller than\nQ0?\n5-1\n\nProblem 2\nFigure 2 shows a main sewer pipe of diameter D = 0.60 m at a slope S0 = 10-4 (1 cm\nvertical drop over a distance of 100 m) carrying sewage from a small town and emptying into\na river at an elevation z0 = 1.0 m of the centerline of the sewer. The sewer pipe is concrete\nwith a roughness of 2 = 0.06 cm. The last house connected directly to the main sewer pipe\nis located l = 2000 m from the sewer outfall and has its basement drain located at elevation\nzb = 3.0 m. The sewage can be assumed to have the characteristics of water, i.e., density\nρ = 1000 kg/m3 and kinematic viscosity ν = 10-6 m2/s.\nDetermine the maximum discharge in the main sewer pipe for which the basement of the\nhouse will not be flooded by sewage from the town.\nFigure 2: Sewer pipe in Problem 2.\n5-2\n\nProblem 3\nTwo large reservoirs of water are connected by two horizontal pipes as shown in Figure 3\n(note the reentrant inflow at A). Both pipes have a roughness of 0.10 mm. The diameters\nand lengths of the pipes are D1 = 15 cm, L1 = 50 m, D2 = 30 cm, L2 = 100 m. The inlet\nat A, expansion at B and outlet at C all have sharp corners. There is a difference in water\nsurface elevation between the two large reservoirs of 12.5 m.\nFigure 3: Pipes connecting two reservoirs in Problem 3.\na) Determine the discharge in the pipes.\nb) Carefully draw the hydraulic grade line (HGL) and energy grade line (EGL) for this\nsystem.\n5-3\n\nContent removed due to copyright reasons.\nPlease see:\nBonillo Martinez, Juan J., Jeronimo Puertas Agudo, and Ricardo Juncosa Rivera. Problemas de Hidraulica.\nEscuela Tecnica Superior de Ingenieros de Caminos, Canales y Puertos. Universidad de La Coruna. July, 2002.\n5-4"
    },
    {
      "category": "Resource",
      "title": "final_aid.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/bc12218eb30b0e1a340eeae4d59e1f01_final_aid.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "final_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/4468505ad9367c8f4e81ff6e3c53559c_final_solutions.pdf",
      "content": "Wholly turbulent flow\nLaminar\nflow\nTransition range\nSmooth\n0.05\n0.04\n0.03\n0.04\n0.04\n0.01\n0.008\n0.006\n0.004\n0.002\n0.001\n0.0008\n0.0006\n0.0004\n0.0002\n0.0001\n0.00005\n0.00001\n0.1\n0.09\n0.08\n0.07\n0.06\n0.05\n0.04\n0.03\n0.025\n0.02\n0.015\n0.01\n0.009\n0.008\n2(103)\n2(104)\n2(105)\n2(106)\n2(107)\n6 8\n6 8\n6 8\nρVD\nμ\nε\nD\nf\n= υ\nRe =\nVD\nD = 4A\nρ = 4Rh\nGraph by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "sampletest_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/4f5cad59952ac0d31b3cbd007e45b94b_sampletest_1.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "test1_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/727758db350dea8ca35a94809ba3ba55_test1_solutions.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "sampletest_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/76dd466c82b4fd081432aa56f96553e8_sampletest_2.pdf",
      "content": "2cm - diameter\n45 cm\n6cm-diameter\nOil\nW\n3 cm\nF\nFigure by MIT OCW.\nSkirt\nVs\nVs\nPo\nPo\nQ\nVehicle\nPatm\nPatm\nh\nFan\nFigure by MIT OCW.\n\n2cm - diameter\n45 cm\n6cm-diameter = dj\nOil\nW\n3 cm\nF\nPj\nPj\nFigure by MIT OCW.\n\nSkirt\nVs\nVs\nPo\nPo\nQ\nVehicle\nh\nFan\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "test2_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/e2d2017bb2216603073df33ecfdbfaf1_test2_solutions.pdf",
      "content": "Wholly turbulent flow\nLaminar\nflow\nTransition range\nSmooth\n0.05\n0.04\n0.03\n0.04\n0.04\n0.01\n0.008\n0.006\n0.004\n0.002\n0.001\n0.0008\n0.0006\n0.0004\n0.0002\n0.0001\n0.00005\n0.00001\n0.1\n0.09\n0.08\n0.07\n0.06\n0.05\n0.04\n0.03\n0.025\n0.02\n0.015\n0.01\n0.009\n0.008\n2(103)\n2(104)\n2(105)\n2(106)\n2(107)\n6 8\n6 8\n6 8\nρVD\nμ\nε\nD\nf\n= υ\nRe =\nVD\nGraph by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "sampletest_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/73c0c520de9ff3e4fc1b85172e76dedb_sampletest_3.pdf",
      "content": "Wholly turbulent flow\nLaminar\nflow\nTransition range\nSmooth\n0.05\n0.04\n0.03\n0.04\n0.04\n0.01\n0.008\n0.006\n0.004\n0.002\n0.001\n0.0008\n0.0006\n0.0004\n0.0002\n0.0001\n0.00005\n0.00001\n0.1\n0.09\n0.08\n0.07\n0.06\n0.05\n0.04\n0.03\n0.025\n0.02\n0.015\n0.01\n0.009\n0.008\n2(103)\n2(104)\n2(105)\n2(106)\n2(107)\n6 8\n6 8\n6 8\nρVD\nμ\nε\nD\nf\nRe =\nGraph by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "test3_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/9232cc5820582b98ef8ab14afd8ce429_test3_solutions.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "sampletest_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/7eed8ae31d2a19290373aff1b43315ea_sampletest_4.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "final2004.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/b7c613a273b9da643dd44b9731b2fc72_final2004.pdf",
      "content": "Wholly turbulent flow\nLaminar\nflow\nTransition range\nSmooth\n0.05\n0.04\n0.03\n0.04\n0.04\n0.01\n0.008\n0.006\n0.004\n0.002\n0.001\n0.0008\n0.0006\n0.0004\n0.0002\n0.0001\n0.00005\n0.00001\n0.1\n0.09\n0.08\n0.07\n0.06\n0.05\n0.04\n0.03\n0.025\n0.02\n0.015\n0.01\n0.009\n0.008\n2(103)\n2(104)\n2(105)\n2(106)\n2(107)\n6 8\n6 8\n6 8\nρVD\nμ\nε\nD\nf\nμ = ρυ ; D = 4A\nρ = 4Rh\nRe =\nGraph by MIT OCW."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/6429bd7937c3799b82375ba1d9031821_lecture1.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/a41106137cd5e1792e8a4d52c1b0bddd_lecture2.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/2845cea3d48ce6ffdc571519351755de_lecture3.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/da2e492c2563d080a042c430eb3b0b0a_lecture4.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/d05497d6b724d6cf8bd95b7c3c3ee4e2_lecture5.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/2c631b28e2db69b9920546f576dcc98b_lecture6.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/9c06f3cd2a34e31f3c77b53f630d726b_lecture7.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/3f0c904fd7b45e855da54014e5e03536_lecture8.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/a20ae07928f1c3405f29468952b7329c_lecture9.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lecture10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/3a0d8d3f4f23ad9c15a5db3ec951b8a0_lecture10.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "cv_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/aec39c53efb96f467b7a7d0a94d1e2bd_cv_notes.pdf",
      "content": "Z\nSummary of Finite Control Volume Analysis in\nFluid Mechanics\nOle S. Madsen\nApril 6, 2006\nAt this point we have developed a set of tools from basic conservation prin\nciples for use in the analysis of fluid mechanics problems.\nWe have developed (derived) these tools (equations) by applying fundamen\ntal conservation laws (e.g. conservation of mass, volume, linear momentum and\nenergy) to finite control volumes as opposed to elementary representative vol\numes (ERVs). When properly applied, our finite control volume tools will result\nin the determination of bulk features of the fluid flow - the discharge, Q, the\naverage velocity, V = Q/A, and the total integrated force due to pressures and\nshear stresses, Fp and Fτ , etc. These bulk features are often sufficient to solve\npractical problems in hydraulics. If detailed flow features such as velocity dis\ntributions, v(y), pressure distributions, p(x, y), and shear stress distributions,\nτ (x, y), are required, then ERV analysis based on differential equations must be\nemployed (i.e. the tools of hydrodynamics).\nThe purpose of this write-up is to present a concise summary of the tools\nwe have at our disposal for the analysis of fluid flow problems, along with some\nsimplifications and guidance that should make it easier to apply these tools in\na proper fashion.\nPicking the Control Volume\nIn choosing the control volume for analysis, the most important decision is to\npick inflow and outflow areas, Ain and Aout, where the flow is well behaved.\nWell behaved flow implies that streamlines are straight and parallel. The\nflow area, A, is chosen so that it is perpendicular to the streamlines. With this\nchoice, the pressure varies hydrostatically in the direction perpendicular to the\nstreamlines. Thus, the pressure varies linearly over the flow area A, and the\npressure force on A is perpendicular to A with a magnitude of\nP =\np dA = pCG,A · A\n(1.1)\nA\nwhere\npCG = pressure at center of gravity (CG) of A.\n(1.2)\n\nZ\nFigure 1: Straight and parallel streamlines passing through the flow area (left);\nlinearly varying pressure (right).\nAlso, if the flow is well behaved, it must be nearly uniform\nin the vicinity of A such that the detailed velocity variation\nacross A, v, will not be excessive. Thus, we have\nQ = volume flow rate across A = Discharge\n=\nv dA = V A\n(1.3)\nA\nwhich defines the cross-sectional average velocity\nV = Q/A = average velocity.\n(1.4)\nOne can, with reasonable certainty, expect the local deviation of the velocity,\nv0 = v - V , to be relatively small compared to V over most of A. For example,\nif |v0/V = δm ≈ 0.1 over most of A, the momentum coefficient\n|\n1 Z\nμ v0 ¶2\nKm = 1 +\ndA ≈ 1 + δ2 ≈ 1 + 0.01 ≈ 1,\nA\nA\nV\nm\nand the energy coefficient\nKe ≈ 1 + 3δ2 ≈ 1 + 0.03 ≈ 1\nm\ncan, without actually knowing v, safely be taken as\nKm = Ke ≈ 1.\n(1.5)\nThese are the features that make the choice of inflow and outflow areas where\nflow is well-behaved a must when picking your finite control volume. The con\ntrol volume itself is everything between the inflow and outflow areas occupied\nby the fluid of interest.\n\nNotes of caution:\n1. If inflow and/or outflow areas have a free surface, the pressure starts at\np = 0 at the free surface, and pCG = ρghCG where hCG is the vertical\ndistance of CG of A below the free surface. Thus, pCG is known if the\nlocation of free surface is known.\n2. If the flow is in a closed conduit, the pressure at the top of the conduit is\np0 and this is not (necessarily) zero. So for a closed conduit (pipe) flow,\npCG = p0 + ρghCG, where hCG is the vertical distance from the top of the\nconduit to CG of A. This is not known unless p0 is known!\n3. If the flow area is a freely falling jet such that A has air around it and\nnothing to support its weight (such as a \"bottom\"), then the effect of\ngravity makes the fluid accelerate in the vertical direction, az = -g, and\nthe pressure is patm = 0 throughout the fluid. Thus pCG = 0 as long as A\nis chosen where flow is well behaved [at vena contracta].\nConservation of Mass and Volume\n\nWith M = rate of mass flow across A =\nR\nρv dA, mass conservation for a finite\nA\ncontrol volume states:\n\n∂\nX\nMin -\nX\nMout =\n[mass of fluid in CV]\n(2.1)\n∂t\n= 0 (for steady conditions).\nIf ρ is constant and the fluid is incompressible, conservation of volume (a.k.a.\ncontinuity) states:\n∂\nX\nQin -\nX\nQout =\n[volume of fluid in CV]\n(2.2)\n∂t\n= 0 (for steady conditions).\n\n2.1\nContinuity equation for a stream tube/conduit\nThe following applies only for one inflow area and one outflow area, and only\nunder steady conditions:\nQin = Qout = Q = Discharge = Constant\n(2.3)\nand with Q given by (1.3),\nQ\nQ = V A\nConstant\nV =\n.\n(2.4)\n⇒\n⇒\nA\nThus, along a streamline tube (conduit) of varying cross-sectional area, A, the\nvelocity V varies inversely proportional to A. This allows us to relate velocities\nat two flow areas\nQ = V1A1 = V2A2\n⇒\nV1 = A2\nA1\nV2\nor\nV2 = A1\nA2\nV1.\n(2.5)\nIf Q is known we can use (2.4) to obtain V wherever A is known. If Q is not\nknown, we can use (2.5) to express V1 in terms of V2 (or vice versa) thereby\nreducing the number of unknowns by one.\nNote: Continuity, i.e. Q = V A, is virtually always one of the tools that\nyou need to employ when solving a fluid mechanics problem.\nConservation of Momentum\nConservation of momentum for a finite control volume under steady conditions\nstates that\nX -→\ngravity force\n3⁄4\n+\n1⁄2\nall other ---→\n∂ ⎨Z\nρ~\n⎫\nMP +\n1⁄2 - -------→\nforces,\n3⁄4\n=\n⎧\nqd∀\n⎬\n= 0\non fluid in CV\non fluid in CV\n∂t ⎩\nCV\n⎭\n(3.1)\nwhere\nMP = thrust at flow area =\n¡\nKmρV 2 + pCG\n¢\nA\n(3.2)\nis perpendicular to A and points inwards (i.e. towards the CV), regardless of\nwhether the flow area is an inflow or outflow area. Note that Km ≈ 1 (see 1.5).\nSince the momentum principle (3.1) deals with forces, it is obviously of use when\nlooking for estimates of forces from a fluid on its surroundings\nf orces on fluid\n3⁄4\nX 1⁄2\nall other ----→\nX 1⁄2\nall other ----→\nf orces on fluid\n3⁄4\n=\nin CV from surroundings\n-\nin CV on surroundings\n(3.3)\nor, it may be used if \"all other ---→\ngravity force are known (or can\nforces\" and the - -------→\nbe estimated) to obtain a relationship between the MPs, i.e. velocities and pres\nsures, at inflow/outflow areas.\n\nImportant: (3.1) is a vector equation so it has 3 components (one in each\nof x, y, and z).\nMPx = MP cos θ\n(3.4)\nMPy = - MP sin θ\nWhen can gravity be neglected?\n1. When forces in the (x, y)-plane are desired since ~g acts in the negative\nz-direction.\n2. When the gravity force = ρg∀0 ¿ momentum force = ρV 2A, i.e. when\nV 2\n∀0/2 = a length ¿\n= velocity head.\n(3.5)\nA\n2g\nWhen can shear stress (frictional) forces be neglected?\n1. When the frictional force is ¿ momentum force, i.e. when\nτsAτ ¿ ρV 2A\nor with\nτs = 1\n8 ρf V 2\nwhen\nA = flow area\nAτ = wall area A f\n8 ≈ 0.02\n8 = 1\n400 .\n(3.6)\nwhere f is the Darcy-Weisbach friction factor ≈ 0.02. This corresponds\nto a \"short\" transition.\n\nThe momentum principle is used:\n1. to compute forces when MPs are known,\n2. to solve for ps and/or V s when forces are \"known\" (also need continuity),\n3. whenever there is an unknown head loss (expanding flow) and forces may\nbe approximately evaluated (or neglected).\nEnergy Conservation - Bernoulli Principle\nE = rate of flow of mechanical energy across A\n(4.1)\n= ρgQH\nH = Total Head = Ke\nV\n2g\n+ pCG + zCG\n(4.2)\nρg\nwhere Ke ≈ 1 [see (1.5)]\nV 2\n= (Q/A)2\n= Velocity Head\n2g\n2g\n(4.3)\npCG = Pressure Head (pCG = pressure at CG of A)\nρg\nzCG = Elevation Head (zCG = elevation of CG of A)\n⎫\n⎪\n⎬\n⎪\n⎭\n\n4.1\nConservation of Mechanical Energy\n\nX\nE in -\nX\nE out = Ediss + ∂ Z\nμ\nρgz + 1 ρ~ 2\n¶\nd∀\n(4.4)\n∂t\nCV\n2 q\n= E diss(for steady conditions)\n∂ Z\nμ\n¶\nρ~\nd∀ = rate of change of mechanical energy within CV\nρgz + 2 q\n∂t\nCV\nE diss = rate of dissipation of mechanical energy within CV\n(4.5)\nFor a streamtube (conduit) having one inflow area and one outflow area:\n\nE in - Eout = ρgQinHin - ρgQoutHout = Ediss\n(4.6)\nbut Qin = Qout = Q (2.3), so\nE diss\nHin - Hout =\n= ΔHCV\n(4.7)\nρgQ\nE diss\nΔHCV = head loss within CV =\n(4.8)\nρgQ\n4.2\nGeneralized Bernoulli Principle\nFlow is from (1) to (2):\nH1 = H2 +\nX\nΔH\n(4.9)\n→\n4.2.1\nFrictional Head Loss (in straight sections of length `)\nΔHf = τsP ` = f\n`\nV 2\n(4.10)\nρgA\n(4Rh) 2g\nV (4Rh)\nε\n¶\nf = f\nμ\nRe =\n,\n(4.11)\nν\n(4Rh)\n= Darcy-Weisbach Friction Factor (from Moody Diagram)\nFlow Area\nA\nRh = Hydraulic Radius =\n=\n(4.12)\nWetted Perimeter\nP\n4Rh = D = pipe diameter if the conduit is a circular pipe\n\n4.2.2\nMinor Head Loss\nV 2\nΔHm = KL\n(4.13)\n2g\nKL = minor loss coefficient\n(4.14)\nMinor losses are associated with expansions of flow.\n¶2 V2\nA1\n¶2 V1\nμ A2\n⎫\nΔHexp = (V1 - V2)2\n=\nμ\n1 -\n2g\nA2\n2g =\nA1\n- 1\n2g\n⎪\n\nV1\nIf A2 A A1 (outflow to large reservoir): ΔHm = 2g\n⎬\n(4.15)\nA1/A2 = CV = contraction coefficient for inflow with sharp edges: ⎪\n\n¶2 V2\nμ 1\nΔHm =\nCV\n- 1\n2g\n⎭\nWhen is H1 ≈ H2? or When is ΔH1\n2 ≈ 0?\n-\n→\nΔH ≈ 0 for a short transition of a converging flow. Short means that\n`\nV 2\nV 2\nΔHf = f 4Rh 2g ¿ 2g (friction is negligible).\n`P\nwall friction area\n=\n= 200\n(4.16)\nA\nflow area\n¿ f\n∼\n[Note: ∼ same as for momentum, (3.6)] Converging flow means velocity\nincreases (pressure decreases) in the direction of flow.\nWhen is ΔH1\n2 = 0?\n-\n→6\nWhenever the distance from (1) to (2) is not short (c.f. (4.16)) and fric\ntional losses therefore are non-negligible; or whenever there is a flow ex\npansion (decrease in velocity in flow direction) between (1) and (2).\n\nWhen can V 2 be neglected?\n2g\n-\nA2\nV1\nμ A2\n¶2 V2\nV1 =\nV2\n=\nA1\n⇒\n2g\nA1\n2g\nV1\nV2\nV1\nμ A2\n¶2\n2g ¿ 2g\n⇒\nA1\n¿ 1: 2g can be neglected.\n(4.17)\nWhen can elevation differences be neglected?\n-\nV2\n�μ V1\n¶�\nμ V 2 ¶\nz2 - z1 = Δz ¿\n2g - 2g\n≈ max\n2g\n: Δz can be neglected\n|\n|\n(4.18)\n4.3\nEnergy Grade Line (EGL)\nzEGL = total head = V\n2g\n+ pCG + zCG\n(4.19)\nρg\n4.4\nHydraulic Grade Line (HGL)\nzHGL = piezometric head = pCG + zCG = zEGL - V 2\n(4.20)\nρg\n2g\nIf there is no pump in the pipe system:\n1. zEGL always decreases in the direction of flow (ΔH > 0) or stays constant\n(in cases when ΔH ≈ 0).\n2. zHGL is always a distance of V 2/2g (one velocity head) below the EGL.\nzHGL can increase in the flow direction when V 2/2g decreases due to a\nflow expansion.\n(See figure on next page.)\n4.5\nApplication of Bernoulli Principle\nV1\nH1 =\n+ p1 + z1 = H2 +\nX\nΔH\n(4.21)\n2g\nρg\n→\nV2\n=\n+ p2 + z2 +\nX\nΔHf +\nX\nΔHm\n2g\nρg\n→\n→\n\n1. If H1 and H2 are known (e.g. free surface elevations in large reservoirs),\nthe head loss between (1) and (2) is known. Expressing all the head loss\nterms in terms of V 2/2g = (Q/A)2 /2g leads to an equation for V (or\nQ) that can be solved. Since frictional losses depend on \"f \" which in\nturn depends on Re= V (4Rh)/ν, i.e. on the unknown V = Q/A, an\niterative solution is required (e.g. guessing the value of \"f \" [0.02 or value\nfor fully rough turbulent flow f (2/(4Rh))] to get a preliminary value V1,\nthen improving the guess on \"f \", etc.)\n2. If the discharge Q is known, the head loss between (1) and (2) can be\nevaluated, and the necessary head, e.g. H1, required to drive the specified\nflow rate through the system can be obtained.\n3. If Q and H1 and H2 are given, the pipe system connecting (1) and (2) can\nbe dimensioned.\nConclusions\nAlways use Conservation of Mass/Conservation of Volume to reduce the\n-\nnumber of unknowns, Q = V A\nV1 = (A2/A1) V2 or V2 = (A1/A2) V1,\n⇒\nor to calculate velocities, V = Q/A, if Q is known.\nIf looking for an answer involving forces, always use Conservation of Mo\n-\nmentum. Also, use this when forces are known (or may be estimated\nwith confidence) to obtain the relationship between pressures and veloc\nities. Once solved, the Bernoulli Principle can be used to obtain head\nloss (which must always be ≥ zero). Prime example: Short transition of\nexpanding flow.\nIf head loss between (1) and (2) is known (or may be estimated with\n-\nconfidence, or expressed in terms of unknowns), use the Bernoulli Principle\nto get the relationship between the pressures and velocities at (1) and\n\n(2). Once solved, the Momentum Principle can be used to evaluate forces\non/from surroundings. Prime examples: short transition of converging\nflows (ΔH ≈ 0); pipe flow analysis (ΔH = ΔHf + ΔHm).\nSuccess depends crucially on the choice of CV ; in particular, well behaved\n-\nflow area identification."
    },
    {
      "category": "Resource",
      "title": "hin_on_prob_solv.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/af0c8f88693a80098ed1cb196dc2c60f_hin_on_prob_solv.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/3b6bd7c763c7278ab5d9878c27a14831_recitation1.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/a872567d4823e040173df0032ad35436_recitation2.pdf",
      "content": "\\"
    },
    {
      "category": "Resource",
      "title": "recitation3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/2c100b3ba605a3ec1e48cc4cc58c5045_recitation3.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/1588d18d28aeadc1a98d11dca9f95b40_recitation4.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/2b4ac3d074f03a750b6a61ff17d09501_recitation5.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nRecitation 5 - Problems\nMarch 16th and 17th\nFigure 1: Horizontal elbow and nozzle\nin Problem 1.\nFigure 2: Diffuser in Problem 2.\nProblem 1\nFigure 1 shows a horizontal elbow and a nozzle combination.\nThe flow in the elbow of\ndiameter d1 = 300 mm is Q = 90 l/s.\nThe nozzle has a diameter d2 = 100 mm and\ndischarges into the atmosphere.\na) Given that the pressure at section 1 is p1 = 70 kPa, find the x-component of the total\nforce on the flange bolts (Fx).\nb) Determine the head loss associated with the flow around the 180o-bend.\n(NOTE: 1 l = 1 liter = 1 dm3 = 0.001 m3).\nProblem 2\nFigure 2 illustrates a classic fluid mechanics experiment. A flow of water, ρ = 1000 kg/m3,\nexits vertically from a diffuser -a smooth contraction from diameter D1 = 3 cm to D0 =\n1 cm- into the atmosphere a short distance, 5 cm, above a horizontal plate. The horizontal\nplate is sufficiently large to completely deflect the flow so that this leaves the plate with a\npurely horizontal velocity. The pressure immediately before the diffuser (10 cm above the\nexit) is measured by a mercury manometer (ρm = 13.6 ρ).\na) How are the velocities V1, before the diffuser, and V0, at the diffuser exit, related?\nRecitation 5-1\n\nb) Why is it reasonable to apply Bernoulli principle without headloss to relate conditions at\nthe manometer pressure tap and the jet exit?\nc) If the fluid velocities of interest are of the order of 5 m/s or greater, why would it be\nreasonable to neglect elevation differences of the order of 10 cm or smaller?\nd) For a manometer reading of ∆zm = 10 cm estimate the pressure, p1, at the entrance of\nthe diffuser.\ne) Use Bernoulli, neglecting elevation differences and headlosses, to estimate the jet velocity,\nV0, at the exit from the diffuser.\nf) Estimate the total vertical force exerted by the jet impacting on the horizontal plate.\ng) If gravity (i.e., elevation head differences) and losses are neglected, obtain an expression\nfor the velocity, U(r), and thickness, h(r), of the fluid on the plate, as a function of the radial\ncoordinate, r.\n(NOTE: This is an old test problem).\nProblem 3\nThe vertical velocity distribution in a wide rectangular duct of height H can be expressed\nas\nu(z) = U + u′(z)\nwhere -H/2 ≤z ≤H/2 is the vertical coordinate, U is the depth-averaged velocity, and\nu′(z) is the velocity deviation with respect to the average. |u′(z)/U| is much smaller than 1\nfor most of the depth, as represented in Figure 3.\nFigure 3: Vertical velocity distribution in a rectangular duct (Problem 3).\na) What is the discharge in the duct (per unit width into the paper)?\nb) Show that the momentum coefficient is Km = 1 + δ2\nm, where\nδ2\nm = 1\nH\nZ H/2\n-H/2\nAu′\nU\n!2\ndz ≪1.\nc) Show that the energy coefficient is Ke = 1 + εe, where εe ≃3δ2\nm.\nRecitation 5-2"
    },
    {
      "category": "Resource",
      "title": "recitation6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/fb9c9834f8e8a5f8c29ff52b02333a83_recitation6.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nRecitation 6 - Problems\nMarch 23rd and 24th\nProblem 1\nFigure 1: Reservoir discharging through a pipe in Problem 1.\nA constant level reservoir (h1 = 10 m) of large surface area discharges water into the at-\nmosphere through a pipe (L = 1.5 m, D = 10 cm, ε = 0.1 mm) which has its centerline\nat z = hp = 8.5 m (see Figure 1). The sharp edged inflow corresponds to a contraction\ncoefficient Cv = 0.61.\na) Determine the pipe discharge, Q, and the velocity after the flow expands from vena\ncontracta to the full pipe, Vp.\nb) Determine the velocity and pressure at vena contracta, Vv and pv.\nc) Compare Vv with the velocity at vena contracta of a free outflow (i.e., a flow out of the\nreservoir through an orifice of diameter D = 10 cm, with no pipe).\nWhy do these two\nvelocities differ?\nd) Carefully draw the energy grade line (EGL) and hydraulic grade line (HGL) for the flow\nalong the pipe, from the sharp edged entrance to the pipe (x = 0) to the end (x = L).\nRecitation 6-1\n\nProblem 2\nFigure 2: Your Spanish house in Problem 2.\nInspired by your TA, you decide to move to Spain and live in a town next to the Mediter-\nranean Sea. After buying a cozy house from a local bullfighter (admire it in Figure 2), you\nfind out that there is no sewage system. You complain to the mayor of the town, who tells\nyou to design the sewage pipe yourself.\nThe pipe will be made of concrete (ε = 2 mm) and will have a length of l = 2000 m and a slope\nS0 = 10-3. It will discharge into the Mediterranean Sea (no tide, density ρsw = 1030 kg/m3),\nwhose free surface (zr = 0) is located 1.2 m above the centerline axis of the sewer pipe. The\nelevation of the basement floor in the house is zb = 2.0 m above the seawater level. The\nsewage can be assumed to have the characteristics of water (ρ = 1000 kg/m3, ν = 10-6 m2/s).\nThe available pipe diameters are 40 cm, 45 cm, 50 cm, 55 cm, 60 cm, 65 cm, 70 cm, 75 cm,\nand 80 cm.\nFor a discharge in the sewer of Q = 0.20 m3/s, determine the optimal pipe diameter to avoid\nflooding in the basement of your house.\nRecitation 6-2\n\nProblem 3\nFor each of the three pipes in the system sketched in Figure 3 determine the flow rate and\nthe direction of flow. The connections between the pipes and the large tanks are all very\nwell-rounded. Neglect the minor headloss at the junction E.\nThe lengths and diameters of the pipes are: L1 = L2 = 5 km, L3 = 3 km, D1 = 800 mm,\nD2 = 400 mm, D3 = 500 mm. The roughness of all pipes is 1 mm.\nFigure 3: System of pipes in Problem 3.\nFigure 4: Square conduit in Problem 4.\nProblem 4\nFigure 4 shows a piece of very long square conduit, of side length h = 0.30 m, carrying\nwater (through the whole cross-section) at a flow rate Q = 0.045 m3/s. The centerline of\nthe conduit, the x-axis, is inclined at an angle of β = 30*to horizontal in the direction of\nthe flow. Gravity acts in the x-y plane.\na) Determine the average velocity in the conduit.\nb) Determine the hydraulic radius of the conduit.\nc) Is the flow in the conduit laminar or turbulent? (Justify your answer).\nd) We want to determine the roughness of this conduit. To this end, we place two piezometers\nseparated by a distance of 10 m along the conduit. For the given flowrate, the difference\nof water elevation between the two piezometers is 8.5 mm. With this information, estimate\nthe roughness ε of the conduit.\ne) For the conditions described in d, what is the average shear stress in the conduit walls?\nRecitation 6-3\n\nRecitation 6-4"
    },
    {
      "category": "Resource",
      "title": "recitation7_prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/1d00345c6cd110e7dd61852cacece0f5_recitation7_prob.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nRecitation 7 - Problems\nApril 6th and 7th\nProblem 1\nFigure 1: Pump impulsion in Problem 1.\nA water flowrate Q = 0.5 m3/s is being pumped from a large reservoir A, where the free\nsurface elevation is z = 0, to a large reservoir B, where the free surface elevation is z =\n20 m. The pipe that connects the two reservoirs has diameter D = 50 cm and roughness\nε = 0.5 mm. The pump is located at elevation z = 2 m. The pipe length between A and the\npump is L1 = 100 m and the pipe length between the pump and B is L2 = 200 m. These\ncharacteristics are represented in Figure 1. Neglect minor losses.\na) Determine the pump head, Hp, necessary to pump the indicated flowrate.\nb) If the required NPSH of the pump is 6 m, would you worry about cavitation in the pump?\nAssume that the temperature is 20*C.\nc) Draw the energy grade line (EGL), specifying the relevant values.\nd) The efficiency of the pump is η = 0.8 and the cost of electricity is 10 cents per kWh.\nHow much does it cost to pump 1 m3 (258.1 gallons) from A to B?\nRecitation 7-1\n\nProblem 2\nA sphere of diameter D = 0.075 m and weight W = 1.37 N is moving through air (ρa =\n1.2 kg/m3, νa = 1.5 · 10-5 m2/s) at a speed of Vp = 42.5 m/s (95 mph).\na) What is the kinetic energy of the sphere?\nb) What is the Reynolds number upon which the sphere's coefficient, CD, depends?\nc) If CD = 0.3, determine the drag force, FD, acting on the sphere as it moves through the\nair.\nd) Determine the rate at which the sphere loses kinetic energy due to the air resistance.\ne) Assuming the rate of loss of kinetic energy determined in (d) to remain constant, estimate\nthe velocity of the sphere 0.4 s after it was given the initial velocity Vp = 42.5 m/s.\nRecitation 7-2"
    },
    {
      "category": "Resource",
      "title": "recitation7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/81dc82b1554411f54fb56ca9cc6c2e98_recitation7.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "recitation8_prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/b3694e9d435e4e03eae85c0b8f3488ec_recitation8_prob.pdf",
      "content": "1.060 Engineering Mechanics II\nSpring 2006\nRecitation 8 - Problems\nApril 20th and 21st\nProblem 1\nWater flows in a long straight channel whose trapezoidal cross section shown in Figure 1.\nThe horizontal bottom is finished concrete and the sides are weedy. The bottom slope is\nS0 = 0.001. The water depth over the horizontal bottom is 1 m.\na) Determine the discharge, Q.\nb) Determine the corresponding mean velocity, V .\nc) Determine the Froude number, Fr, of the flow.\nd) Is the flow super- or subcritical?\nFigure 1: Trapezoidal channel in Problem 1.\nProblem 2\nA long glass-walled laboratory flume has a rectangular cross-section of width 1 m, a slope\nof S0 = 10-4, and it discharges water at a flowrate Q = 0.5 m3/s.\na) Find the critical depth, hc.\nb) Find the normal depth, hn, corresponding to steady uniform flow.\nc) Does the normal depth correspond to super- or subcritical flow?\nRecitation 8-1\n\nRecitation 8-2\nValues of the Manning Coefficient, n (Ref 5)\nWetted Perimeter\nn\nNatural Channels\nClean and straight\nSluggish with deep pools\nMajor rivers\nFloodplains\nPasture, Farmland\nLight brush\nHeavy brush\nTrees\nExcavated Earth Channels\nClean\nGravelly\nWeedy\nStony, Cobbles\nArtifically lined channels\nGlass\nBrass\nSteel, Smooth\nSteel, Painted\nSteel, Riveted\nCast iron\nConcrete, Finished\nConcrete, Unfinished\nPlaned Wood\nClay tile\nBrickwork\nAsphalt\nCorrugated metal\nRubble masonry\n0.030\n0.040\n0.035\n0.035\n0.050\n0.075\n0.15\n0.022\n0.025\n0.030\n0.035\n0.010\n0.011\n0.012\n0.014\n0.015\n0.015\n0.016\n0.022\n0.025\n0.013\n0.012\n0.012\n0.014\n0.014\nTable by MIT OCW.\n\nRecitation 8-2\n0.05\n0.04\n0.03\n0.02\n0.015\n0.01\n0.008\n0.006\n0.004\n0.002\n0.001\n0.0008\n0.0006\n0.0004\n0.0002\n0.0001\n0.000.05\n0.000.01\n0.09\n0.08\n0.07\n0.06\n0.05\n0.04\n0.03\n0.025\n0.02\n0.015\n0.01\n0.009\n0.008\n2(103)\n2(104)\n2(105)\n2(106)\n2(107)\n5 6\n5 6\n5 6\nVD\nυ\n8 10\n600 800 1000\n20,000\n40,000\n60,000\n80,000\n100,000\n0.10\n0.1\n0.2\n0.4\n0.6 0.8 1\n8 10\n80 100\n600 800 1000\n10,000\nLaminar\nFlow\nCritical\nZone\nTransition\nZone\nComplete turbulence rough pipes\nSmooth Pipes\nLaminar Flow\nRe\nRe\nReynolds Number Re =\nε\nD\nRelative roughness\n= ε/(4Rh)\nε\nD = 0.000.005\nε\nD = 0.000.001\nFriction factor f -\nh\nL\nD\nV2\n2g\nD = 4A\nρ = 4Rh\nVD\nυ\nυ\nRe =\n=\nυ(4Rh)\nValues of (VD') for atmospheric air at 60o\nValues of (VD') for water at 60o F (velocity, ft/s, diameter.in)\nThe Moody chart for pipe friction with smooth and rough walls. This chart is identical to Eq. (6.64) for turbulent flow.\nf.\nGraph by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "recitation8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-060-engineering-mechanics-ii-spring-2006/b56ceea0db4293a95fa034155c4f1141_recitation8.pdf",
      "content": ""
    }
  ]
}