{
  "course_name": "Environmental Technologies in Buildings",
  "course_description": "This course focuses on the thermal, luminous, and acoustic behavior of buildings, examining the basic scientific principles underlying these phenomena and introducing students to technologies and analysis techniques for designing comfortable indoor environments. Students are challenged to apply these techniques and explore the role light, energy, and sound can play in shaping architecture.",
  "topics": [
    "Energy",
    "Buildings",
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Energy",
    "Buildings",
    "Fine Arts",
    "Architecture",
    "Environmental Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLabs: 1 session / week, 1 hour / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThe primary focus of this course is the study of the thermal, luminous, and acoustical behavior of buildings. The course examines the basic scientific principles underlying these phenomena and introduces students to a range of technologies and analysis techniques for designing comfortable indoor environments. Students will be challenged to apply these techniques and explore the role energy, light, and sound can play in shaping architecture.\n\nFollowing a review of how to analyze a site's climate and local energy mix, the course will introduce students to the art and science of lighting buildings along with rules of thumb and computer-based methods for analyzing daylight within and around buildings. The second part of the course is dedicated to the principles of heat storage and heat flow into and out of buildings. Basic manual and computer-based methods to predict the energy use of buildings will also be discussed. In order to introduce students to the effective use of computer simulations during design, a building optimization game that mimics a sustainable design charrette will be organized. During the game, students will compete in groups to develop the building with the lowest energy use within a given cost budget. The last part of the course provides an overview of building acoustics and sound attenuation.\n\nThe course format consists of semiweekly lectures and weekly labs. Individual and group assignments as well as in-class presentations and exercises will help students to study the use of environmental technologies in contemporary buildings.\n\nLearning Objectives\n\nThe course aims to help students to:\n\nunderstand and apply the scientific principles underlying the thermal, luminous, and acoustical behavior of buildings;\n\nlearn to evaluate the pros and cons of a range of technologies for creating comfortable indoor environments; and\n\nconduct a series of design analysis workflows regarding climate, building energy use, and daylighting and acquire the knowledge required to critically discuss/present the environmental concept of a building.\n\nRequirements\n\nThe following deliverables will be required to pass this class:\n\nAttendance of semiweekly lectures and labs.\n\nTimely completion of assignments. Late assignments will not be accepted.\n\nCompletion of a group course project. The course project will be to develop and present an environmental concept for a small office building.\n\nPreparation of 15 minute in-class group presentations on one of the American Institute of Architects (AIA) Committee on the Environment (COTE)\nTop Ten Projects\nfor the current year. Presentations should have the following format:\n\nOverview of the main environmental features of the building.\n\nDiscussion of predicted energy use. (Note: You do not have to explicitly model the building for energy use. You should rather review the predicted and actual energy use for the building--this is published for most of the AIA awarded buildings--and assess how they compare; also compare the data to typical buildings of the same type. The\nCommercial Buildings Energy Consumption Survey\n(CBECS) has data on energy usage for various building types in different parts of the country. How much better is your building than the average? What design strategies contribute the most to the savings?)\n\nDaylighting analysis of the building. Construct a simple 3D model of the whole or key spaces within the building. The model does not have to be very detailed, but should include the major facade openings and elements so that you can evaluate how light is being distributed in the space.\n\nDiscussion of what you like and/or dislike about the building and its environmental concept.\n\nActive participation in class discussions.\n\nGrading\n\nActivities\n\nPERCENTAGES\n\nQuality and timely submission of completed assignments\n\n45%\n\nCourse project presentation\n\n30%\n\nAIA case study presentation\n\n15%\n\nParticipation in class discussions\n\n10%\n\nPlease familiarize yourself with MIT's\nAcademic Integrity Expectations\n.",
  "files": [
    {
      "category": "Assignment",
      "title": "4.401 Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/d22ab095cde0ee5463d984784a55629c_MIT4_401f18_assignment1.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 1\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 2\nNote:\nThis is an individual assignment.\nMy Energy Essay\nOver the past decade environmental, 'green' building technologies have enjoyed\nunprecedented attention from building owners, the general public and design practitioners. As\na consequence, today's architects are under increasing pressure to position their built work within\nthis context. A convenient and popular method is to evaluate one's built work via building\nrating systems such as LEED in the US, BREEAM in the UK and CASBE in Japan. However,\nas we will see in class, this approach neither guarantees satisfying results nor does it give full\njustice to the larger societal debate on sustainability and the built environment. In this first\nassignment you are invited to reflect about your past and envision your future building\nenergy use.\nTask 1: Your past energy use\nPick an apartment or house in which you have lived in the past for which you have\naccess to annual energy bills for electricity, gas, oil etc. Estimate the floor area of the living\nunit and (same as in class) calculate the energy use intensity of the living unit, overall building\nenergy use per person and carbon emissions per person. Comment on your findings.\nTask 2: Essay - A sustainable building that suits your lifestyle\nWrite a position paper (about 1000 words) on what you - as a becoming designer -\nbelieve constitutes a successful sustainable building. To give your argument a personal note\nand make it thus more convincing, please initially describe the following: If everything goes\n\"according to plan\" for you, where and how would you like to live in 10 years? In the\ncountryside, the suburbs, a city? Do you want to live in a new single family house, an\napartment, a retrofit, a commune? How much traveling do you see yourself doing for work\n\nand pleasure (number of miles traveled per year via car, air and/or train)? How would you like\nto work? From home, in an office, at Starbucks, in your garage/makerspace?\nPlease describe a sustainable building that accommodates your lifestyle choices. Feel\nfree to use architectural precedents, anecdotes and any type of data to substantiate your\nwriting. The rating criteria for this assignment are the originality of your thoughts and\ncohesiveness of your writing. Be prepared to measure your final course project against the\ncriteria that you present in this first assignment.\nNote: This is an open assignment. Given that sustainability is such an all-encompassing term, the idea is for you\nto describe how you aspire to live and what type of buildings can satisfy those desires. There are no right or wrong\nanswers and you are not expected to provide a review of sustainable technologies in buildings. We will be covering\nthat in class.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/d6e0e979c5f62d4c3fab3ea921d4caed_MIT4_401f18_assignment2.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 2\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 3\nType:\nThis is an individual assignment.\nShading Studies and Sun Path Diagrams\nTask 1 Direct Shading\nThe objective of this assignment is to validate the results of direct shading studies\nprovided by DIVA/Radiance and other tools. To do so, you are asked to take a photo of an\nobject of your choice outside at least twice at different times of day under clear sky conditions.\nYou are then asked to model the object in Rhino and generate two clear sky visualizations\nunder the same sky conditions from about the same perspective as the photo. Present your\nfindings. Tips: (a) Remember that we are currently in daylight savings time. (b) Be sure to\ncarefully align your physical model using for example a smartphone compass. An example\nstudy is shown below.\nSeptember 8, 12pm Photo\nSeptember 8, 3:45pm Photo\n\nSeptember 8, 12pm DIVA/Radiance\nSeptember 8, 3:45pm DIVA/Radiance\n\nSeptember 8, 12pm DIVA/Grasshopper\n\nSeptember 8, 3:45pm DIVA/Grasshopper\n\nTask 2 Annual Sun path diagram\n\nShow an annual sun path diagram of your object using DIVA Grasshopper and mark\nthe two times in the year when the photos from Task 1 were taken. An example result is\nshown below.\n\nDaily Sunpath Diagram in DIVA 4\nSep 8 at noon\nSep 8 at 3:45PM\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/4cfe5b351f32c9a27932cfc4ec110224_MIT4_401f18_assignment3.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 3\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 4\nType:\nThis is a group assignment (project groups).\nVisual and Thermal Comfort\nThe objectives of this assignment are for you to develop a feeling for indoor environmental\nvariables that have an impact on thermal comfort and to compare your personal sensation to\ncomfort predictions based on thermal and lighting standards. The assignment is split into two\ncomponents:\n\nTask A: Using a data logger, measure \"your life\" on a psychrometric chart over a couple\nof days.\n\nTask B: Measure indoor environmental conditions in two spaces that you find\ncomfortable and uncomfortable and compare your assessments to that of current\nthermal comfort standards.\nTask A Psychrometric Chart\nA HOBO data logger (photo on the right)\ncollects time series of temperature and relative\nhumidity and comes with a software called HOBOware\nthat allows you to plot the data and/or export it to\nExcel. This type of data logger is widely used by\nbuilding commissioning teams as well as in museums\nor other spaces in which indoor environmental\nconditions have to be tightly monitored. For this part of the assignment carry one of the\nschool's HOBO data loggers around with you for around 72 hours and collect temperature\nand relative humidity data pairs in 15-minute time steps. Connect the HOBO data logger to\n\nyour computer using the provided USB cable and use the options in HOBOware's Device\nmenu to manage the data logger. (We recommend setting the measurement interval to 5\nminutes.) Plot the data using Excel and manually enter extreme points on a psychrometric\nchart. (A blank chart is provided further below.) 'Extreme' points are e.g. walking outside,\ncooking and/or laundry, a visit to an indoor pool etc.\n\nBe inventive, go places!\n\nBriefly describe the extreme points on the HOBOware printout. An example is provided on\npage 3 of this assignment. If you wish, you may use weather data from one of the sources\nlisted on page 4 to explain some of your measurements. For example, if it is a very cold day,\nthe relative humidity in your home will be low unless you have a humidifier.\n\nLogistics\n\nYou previously signed up for one of two measurement shifts for Assignment 3, week 3 or\nweek 4. Each group will receive a HOBO data logger, USB cable, and spot thermometer. The\nfirst groups to sign up will pick up the equipment during lab on the Friday of week 2 and\nreturn the data logger to the Building Technology Suites at 10 am on Friday of week 3.\nStudents in the second shift can pick up their kit after 11am on Friday of week 3. The last\ngroups should return the equipment in class on Monday of week 5.\n\nExample Printout using HOBOware\n\nPsychrometric Chart\np\n\nTask B Thermal and Visual Comfort Analysis of Two Daylit Spaces\n\nMeasure a series of indoor environmental variables in two situations, one of which you\nconsider to be comfortable and the other uncomfortable. You may either pick the same space\nat two different times or two different spaces. Translate your measurements into thermal\ncomfort predictions according to ASHRAE 55 (PMV and adaptive method) and compare those\npredictions against your initial, personal comfort assessment. Collect the following information\nfor each situation:\n\n-\nSubmit a photo that provides a general sense of the space\n-\nRecord the time, date, dry bulb temperature and relative humidity (HOBO data logger)\nand mean radiant temperature (spot thermometer). Go to the nearest weather station\nand mark down ambient temperature, relative humidity, wind and solar radiation.\n-\nDescribe why you picked the space and your general thermal sensations at the time\nwhen you took the measurements.\n-\nDerive Predicted Mean Vote and Adaptive Comfort from your measurements using the\nCBE Thermal Comfort Tool and discuss on your earlier observations vis-a-vis these two\ncomfort indices.\n\nThe figures below show an example comfort evaluation for a dry bulb temperature of 25.8oC,\nrelative humidity of 44.8% and mean radiation temperature of 27.3o C for Predicted Mean\nVote and Adaptive Thermal Comfort.\n\nFigure: Thermal comfort conditions according to PMV (top) and Adaptive Comfort theory (bottom)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/2a0d878698ed9717f8009689b04b2b50_MIT4_401f18_assignment4.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 4\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 5\nType:\nThis is an individual assignment.\nDesigning a PV System\nDuring assignment 1 you determined how much electricity you have used at some\npoint in your life living in an apartment or house. In this assignment you are going to design\na PV system that yields the same amount of electricity over the course of a year and calculate\nthe simple payback time required to get your investment back. The assignment is broken into\nthree parts.\n1.\nUse annual radiation maps of your building and its surroundings to place and orient\n1x1.5m2 panels on the roof, facades or in the garden of your building. Overall system yield\nshould approximate your annual electricity use from assignment 1.\n2.\nOnce the PV panels are in place, use DIVA4 (GH tutorial #07) to calculate the actual\nmonthly electricity yield of your system.\n3.\nCalculate total costs and payback for the PV system.\nTask 1 PV system placement and preliminary electricity yield calculation\nUsing radiation maps in DIVA4, visualize the annual solar radiation falling onto your\npanels (Fig 1) and verify that no partial shading occurs on Dec 21st at noon (Fig 2). An example\nradiation map in Anchorage is shown below. Estimate the annual AC electricity gain assuming\na panel efficiency of 18% and an inverter efficiency of 96%.\n\nFig 1 DIVA/Radiance radiation map of the \"design albatross\" with 10 PV panels\nFig 2 DIVA Visualization of direct shading on Dec. 21, 12pm, in Anchorage\nTask 2 DIVA4/Archsim Simulation\nOnce you are satisfied with your PV system design, model the monthly electricity gain\nin DIVA4/Archsim and report the results in a figure similarly to Fig 3. Comment on your\n\nfindings. (Remember, 1J = 1/3600000 kWh). Please pay attention to the orientation of the\nsurfaces in Rhino. (You can identify the surface orientation in Rhino using the \"dir\" command.\n\"flip\" changes the orientation.)\n\nFig 3 Monthly electricity yield of the PV system based on DIVA4/Archsim\n\nTask 3 Financial Analysis\n\nCalculate the simple payback time for your PV system. Each panel has a peak efficiency\nof 294Wp. Installed system costs are $US 3.50/Wp. Massachusetts provides you with a onetime\nState Tax Break of $1000 for the overall system. The Federal government further offers a tax\nbreak over 30% of the total system price. You are welcome to either use the above incentives\nfor Massachusetts, even if your building is located in a different jurisdiction, or you research\nthe actual incentives for your particular situation.\nIn terms of payback, you simply save $0.18 for every kWh that you generate and feed\nback into the grid (as long as you are not surpassing your own energy use). You will further\nreceive a Solar Renewable Energy Certificate (SREC) of $0.285 for every kWh that you feed\nback into the grid. Can you reduce your electricity bill to zero? How long will it take for your\nPV system to pay for itself?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/4a661a066142c53ab84981fa6b000619_MIT4_401f18_assignment5.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 5\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 7\nType:\nThis is a group assignment.\nDaylight Availability Study\nIn this assignment you will start working in groups on your final course project which is\nthe development of an environmental design concept for an about 3500m2 innovation/startup\nspace located in either Chicago, Houston or Seattle, depending on which city you previously\nsigned up for. Your building should accommodate work spaces for around 250 workers, a\nreception area, lavatory, two seminar rooms and a cafe (optional). It is up to you to define\nthe final program. You may pick any available site within your city and should also consider\nexternal factors such as a site's walkscore etc. Remember to include neighboring buildings in\nyour shading and daylighting analysis. The goal of this first assignment is to develop and\nevaluate a series of massing options and facade designs that you will then further refine in\nfuture assignments.\nTask 1: Site selection and climate analysis\nAs a first step browse different vacant lots throughout your city and pick a site. For\nyour selection it does not matter whether the site is actually for available for development.\nHowever, you should come up (and state) with a few reasons supporting your choice. These\nreasons may range from proximity of other businesses or educational facilities to access to\npublic transportation. Create a simple massing model of the surrounding buildings and\nevaluate the annual external shading situation for your site using sun path diagrams and/or\nradiation maps. Formulate three to four guiding principles for your design.\nTask 2: Daylight massing study\nExplore at least three different massing variants on your site with a generic window to\nwall ratio of 40%, calculate the spatial daylight autonomy (sDA300lux[50%]) for all three variants\nand decide which variant you want to continue working on going forward. Show visualizations\nof your sDA300lux[50%] calculations and report the percentage of your building that is \"daylit.\"\nTask 3: Window-to-wall ratio study\nFor your favorite massing variant from Task 2, explore at least three different window\nand skylight configurations to see in how improve the daylight availability throughout all\n\nregularly occupied spaces within the building. Possible interventions include changing window\nsizes and positions as well as adding light shelves or blinds. Discuss your findings.\n\nSimulation Assumptions\nMake sure that your Rhino file units are in meter. For the outside ground assume a\nreflectance of 20%. For interior surfaces, assume 50% for walls, 20% for floors and 80% for\nceilings. You may pick any glazing type of your liking. The grid of sensors should be 0.85m\nabove the floor with a spacing of 0.5m. Simulation parameters should at least be ab = 4 and\nad =1500 (see also the simulation checklist below).\n\nTable: Daylight Simulation Checklist.\nBefore you start\nDid you decide which daylighting performance metrics to simulate and how to\ninterpret the results?\nDo you have a general idea of what the results should look like? E.g. a mean\ndaylight factor in a standard sidelit space should lie between 2% and 5%; interior\nilluminance should lie between 100 lux and 3000 lux and daylight autonomies\nshould range from 60% to 90% throughout the space.\nHave you verified that the simulation program that you intend to use has been\nvalidated for the purpose that you intend to use it for, i.e. that the simulation\nengine produces reliable results and that the program supports the sky models\nrelated to your performance metric of choice? (An example would be the old CIE\novercast sky for daylight factor calculations.)\nHave you secured credible climate data for your building site? (This is only required\nfor climate-based daylighting performance metrics.)\nPreparing the\nScene\nDid you model all significant neighboring obstructions such as adjacent buildings\nand trees?\nDid you model the ground plane?\nDid you model wall thicknesses, interior partitions, hanging ceilings and larger\npieces of furniture? Try to model all space dimensions at least within a 5cm\ntolerance. Facade details should be modeled with a 2cm tolerance.\nDid you consider window frames and mullions by either modeling them\ngeometrically or by using reduced visual transmittances for windows and skylights?\nWindow glazings:\n- Did you check that all window glazings only consist of one surface? Several CAD\ntools model double/triple glazings as two/three closely spaced parallel surfaces\nwhereas daylight simulation programs tend to assign the optical properties of\nmultiple glazings to a single surface.\n\n- Did you check that all windows are 'inserted' into the wall planes and not\n\"overlaid\" on the wall surfaces? Several CAD tools suggest that you can create\nand visualize a window in many different ways, one simply being the placement\nof a window surface on top of a wall surface which case end up with two\ncoplanar surfaces. As a result the simulation program will either ignore the\nwindow or somehow 'guess' which surface to consider.\nDid you assign meaningful material properties to all scene components?\nDid you model any movable shading devices such as venetian blinds? If yes, do the\nresults make sense?\nSetting up the\nsimulation\nMake sure that you set up your project files correctly. This may involve:\n- Checking that your project directory and file names do not contain any blanks (\"\n\").\n- Verifying that all sensors have the correct orientation, i.e. work plane sensors are\nfacing up and ceiling sensors are facing down.\n- Setting the resolution of the work plane to 0.5m x 0.5m or 1ft x 1ft and placing it\naround 0.85m above the floor.\n- Selecting simulation parameters that correspond to the 'scene complexity'. To do\nso you should consult the technical manual of your simulation program.\n- Selecting the correct sky model (CIE, Perez, etc.).\n\n*) For a scene of low complexity (typical sidelit space with a standard window) the Radiance simulation\nparameters should be: ab= 4; ad =1500; ar=100, as=20; aa = 0.1; av=0 0 0.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/112aca2f2f0963ab54544229f6773b27_MIT4_401f18_assignment6.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 6\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 8\nType:\nThis is a group assignment.\nVisual Comfort and Electric Lighting Study\nThe goal of this assignment is check your final daylighting design from Assignment 5\nfor potential areas of glare and remedy them as well as to design an electric lighting concept\nfor your design. As a target level, the electric lighting should provide around 300lux on all key\nworking surfaces and around 150lux in all circulation areas.\nTask 1: Visual Comfort\nUse the Annual Solar Exposure Metric to get a sense of where lighting levels in your\nbuilding might exceed visual comfort levels. Decide whether the daylight in these areas needs\nto be critically controlled or not. For example, daylighting levels in the cafeteria or other\ncommon spaces can potentially be up to 2000lux without disturbing occupants. You may also\nargue that your furniture layout allows occupants to freely adapt their view positions. For at\nleast one critical position in your building conduct a few daylight glare probability simulations\n- e.g. during equinox and winter solstice at 9am, noon and 3pm - to get an sense of the\nseverity/occurrence of glare. Change your window layout and/or add a shading device if\nnecessary and repeat your daylight availability analysis from Assignment 5 to ensure that\ndaylighting levels in your updated space are still adequate.\nTask 2: Lighting Concept\nPick a series of luminaires from a lighting manufacturer catalogue, download the IES\nfiles and place the luminaires throughout your building. Detailed instructions of how to do\nthis are provided in DIVA/RhinoTutorial #5. You can also model electric lighting using DIVA\nGH. This will be demonstrated during Friday lab in week 7. For each luminaire provide the\nlisted power, a perspective view from the lighting catalogue and a screenshot of the luminous\nintensity distribution. (You can download a simple IES file viewer for this.) An example is\nprovided in Fig 1.\n\nFig 1: Perspective view of the luminaire plus luminous intensity distribution\n\nPlace the luminaires throughout the building and render a few perspective views of\nkey positions in your building. As shown in DIVA GH Tutorial 03, you can create a series of\nviews and animate through them. Readjust the lighting design until you are content with the\nresult. An example rendering for the MIT reference office is shown below.\n\nFig 2: Perspective view of the MIT reference office at MIT equipped with six direct/indirect suspended LED modules\n\nOnce all luminaires have been placed, calculate the illuminance distributions\n\nthroughout your building at nighttime. Show the illuminance contour plot (Fig. 3) and ensure\nthat your target illuminance levels are met throughout the building. Calculate the overall\nlighting power density for the buildings, i.e. the sum of all luminaire powers divided by the\noverall floor area.\n\nFig 3: Perspective view of the luminaire plus luminous intensity distribution\n\nTip: For the electric lighting simulations make sure that your model units are in meter to\nmatch the IES-file dimensions.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/ea268fdc900bdb9b8e195593363c14bf_MIT4_401f18_assignment7.pdf",
      "content": "4.464 Environmental Technologies in Buildings - Assignment 7\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 9\nType:\nThis is a group assignment.\nEnergy Explorations\nNow that you have a well daylit, visually comfortable building with an electric lighting\ndesign in place, we are turning our attention towards evaluating and improving the energy\nperformance of your design. In this assignment you will first create a baseline energy model\nof your building and then explore various energy updates.\nTask 1: Baseline Energy Use\nDevelop a simple thermal massing model of your final daylighting design from\nAssignment 6 assuming construction and usage practices for a typical medium sized office\nbuilding as per the US Department of Energy Commercial Reference Buildings. The zone\nproperties for Chicago, Houston and Seattle are stored within the Grasshopper Definition that\ncomes with this assignment.\nBuild a simple massing model of your design with at least one thermal zone per floor.\nFigure 1 shows an example of a daylighting (left) and a thermal (right) model of a \"typical\nNew England House.\"\n\nFigure 1: Daylighting (left) and two-zone thermal model of a residential house. The thermal model consists of\nbreps for the two stories, individual surfaces for the windows that are co-planar with the walls and two surfaces\nthat represent that porch roof.\n\nConduct the following steps to setup and run your thermal model:\n1.\nSet geometry: Select the\nbreps and surfaces for the\nthermal zones, windows\nand shading surfaces. In\ncase you do not have any\nexternal shading surfaces\nyou need to delete the\nshading geometry brep in\nGrasshopper.\n\n2.\nZone settings: Go to the\nThermal Zone component\nand under \"Settings as\nformatted string\" select\nyour city, i.e. 4c_Seattle.\n(\"4c\" is the ASHRAE climate\nzone for Seattle)\n\n3.\nWindow settings: Go to the\nWindow component. Under\nSettings>> Glazing\nConstruction select the\nwindow for your ASHRAE\nclimate zone.\n4.\nClimate file settings: Go to\nthe File Path component\nand select the *.epw file for\nyour city.\n5.\nRun the Simulations: Go to\nthe Simulation Engine\ncomponent and start the\nthermal simulation. A black\nDOS window should appear\nand run for 15 seconds or\nmore, depending on the\nnumber of zones in your\nmodel.\n6.\nSelect the simulation\noutput: Go to the Load\nResults File component and\nselect all zones in your\nmodel under Outputs.\n7.\nAnalyze results: Investigate\nthe monthly loads of your\nbuilding design for heating,\ncooling, equipment and\nlighting. Note down the\nannual energy uses for the\nbase variant for your\nbuilding. An example Excel\ntemplate is provided with\nthe assignment (Figure 2).\n\nTask 2: Explore Energy Upgrades\n\nTry to reduce the energy use of your building. As a first step set the lighting power density\nin your building to the level that you calculated in Assignment 6 (Thermal Zone component\nunder the Load Tab). You may then add continuous dimming controls and other upgrades to\nyour building. Note that once you selected various zone upgrades you have to save your\nsettings within the Thermal Zone component under \"Save as template.\" You then need to\nselect your new zone type as described above under step 2. Report annual energy uses for at\nleast two sets of building upgrades which may include changes to the building geometry\nand/or other zone properties.\n\nFigure 2: Annual energy use for the baseline energy use and two upgrades\n\nTable: Thermal Simulation Checklist.\nBefore you start\nDid you decide which daylighting performance metrics to simulate and how to\ninterpret the results?\nDo you have a general idea of what the results should look like? E.g. a mean\ndaylight factor in a standard sidelit space should lie between 2% and 5%; interior\nilluminance should lie between 100 lux and 3000 lux and daylight autonomies\nshould range from 60% to 90% throughout the space.\nHave you verified that the simulation program that you intend to use has been\nvalidated for the purpose that you intend to use it for, i.e. that the simulation\nengine produces reliable results and that the program supports the sky models\nrelated to your performance metric of choice? (An example would be the old CIE\novercast sky for daylight factor calculations.)\nHave you secured credible climate data for your building site? (This is only required\nfor climate-based daylighting performance metrics.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "4.401 Assignment 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/ea064154791a4eb5e144e76ceeca60a5_MIT4_401f18_assignment8.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Assignment 8\nInstructor:\nChristoph Reinhart\nDue Date:\nFriday of week 11\nType:\nThis is a group assignment.\nObjective\nThe objective of the game is to redesign your class project, with the lowest possible\noperational Source Energy Use Intensity (Source EUI, kWh/m2) as simulated in\nDIVA/Archsim/EnergyPlus. Starting off with an approximate thermal model of your latest\ndesign from Assignment 6, your task is to create a version of your building with the lowest\nSource EUI and a purchasing budget at or under $50 MIT dollars. The team with the largest\nproportional EUI reduction vis-a-vis their baseline design wins. Follow all rules below. When\ntime is up (after 80 minutes), your team must save all of your files and submit them along\nwith a detailed description of your final designs and how you arrived at your best performing\niteration (more details are provided under part 3).\nPart 1 - Baseline design\nCreate an approximate thermal model of your baseline daylit building from Assignment\n5. Run an energy simulation of the baseline file using no energy upgrades.\nPart 2 - Model, Simulate, Evaluate\nUsing the Grasshopper file called SimulationGame2018.gh provided on the course web\nsite, introduce upgrades to your baseline model which may be both geometric as well as\nbased on any combination of design upgrades offered in the Grasshopper file. The design\nupgrades are listed on the following pages. Each upgrade has an associated cost and you are\nlimited to a budget of $50 MIT dollars.\n\nThe floor to floor height of each building level must be at least 3m. Each level should\nbe modeled as at least one thermal zone. While the form is completely up to you, your zones\nmust consist of planar surfaces (no rounded, curved, or NURBS surfaces). Parametric\n(automated) windows by orientation (as well as automated horizontal shading) are included\nin the Grasshopper file. If you would like to have more control over the design of your windows\nand shading, you may disable automated windows and activate custom windows (instructions\nare in the Grasshopper file).\nEach time you simulate a design in Grasshopper, your Source EUI results will be\nrecorded in Rhino (Figure 1). Try to use previous simulation results to guide subsequent design\ndecisions.\nENVELOPE SETTINGS\nROOF INSULATION*\nDescription\nRelative Cost\nBase Building\nContinuous\nInsulation\nR-Factor: R20\nContinuous\nInsulation\nR-Factor: R30\n$\nContinuous\nInsulation\nR-Factor: R40\n$$\nContinuous\nInsulation\nR-Factor: R60\n$$$$\n* Note: the cost of Roof Insulation is also related to the area of roof in your building.\nEXTERIOR WALL INSULATION*\nDescription\nRelative Cost\nBase Building\nContinuous Insulation\nR-Factor: R13\nContinuous Insulation\nR-Factor: R19.5\n$\nContinuous Insulation\nR-Factor: R28.5\n$$$\n* Note: the cost of Wall Insulation is also related to the area of wall in your building\n\n* Note: the cost of windows is also related to the area of glazing in your building.\nEXTERIOR SHADING*\nDescription\nRelative Cost\nBase\nNo shading\nShading (depends on depth)\n$ - $$\n*Note: Shading is directly related to the amount modeled in your building. Simulations including exterior shading\nwill take longer to complete.\nSYSTEM SETTINGS\nLIGHTING POWER DENSITY\nDescription\nRelative Cost\nBase\nBuilding\n11 W/m2 during occupancy\n9 W/m2 during occupancy\n$\nDAYLIGHT SENSORS\nDescription\nRelative Cost\nBase Building\nNone\nWINDOW GLAZING TYPE*\nDescription\nU-Factor\nSHGC\nVLT\nRelative Cost\nBase - Double-Pane Argon-Filled\n2.55 SI\n(0.45)\n0.50\n0.70\nDouble-Pane Argon-Filled Low-e\n(High Solar Gain)\n1.44 SI\n(0.25)\n0.60\n0.78\n$$$\nDouble-Pane Argon-Filled Low-e\n(Low Solar Gain)\n1.36 SI\n(0.24)\n0.17\n0.25\n$$$\n\nPerimeter zones (0-4.5m from exterior wall) dim\nlinearly down to complete shut-off (0% power)\n(target work plane illuminance 300 lux)\n$\nHEATING + COOLING\nSYSTEM\nDescription\nFuel\nSource\nFactor\nCoefficient of\nPerformance\nRelative\nCost\nBase\nBuilding\nHeating: Electric Resistance\nHeating\nCooling: Direct Expansion A/C\nCooling\nElec (3.14)\nCOP 1.0\nCOP 3.1\nHeating: Boiler (hydronic heating)\nCooling: Direct Expansion A/C\nCooling\nGas (1.05)\nElec (3.14)\nCOP 0.90\nCOP 3.1\n$$\nHeating: Ground Source Heat\nPump\nCooling: Ground Source Heat\nPump\nElec (3.14)\nCOP 3.1\nCOP 3.93\n$$$$\nNote: Simulations including natural ventilation may take longer to complete.\nNATURAL VENTILATION\nDescription\nRelative\nCost\nBase Building\nNone\nAutomated natural ventilation tied into a\nbuilding management system.\n- Assumes a 40% operable window area\n- Operates when outdoor air is between 20C\nand 40C\n- System will close windows when 22C indoor air\ntemp is met\n$\n\nFig 1 Screenshot of iterative simulation results and building geometry in Rhino.\n--------------------------\nEnd of Game\nNote that each time you ran a simulation, a unique layer is created in Rhino that\ndocuments your geometry. See Figure 2.\nWhen the game is complete, you must bake your simulation results into your\nRhino file so that you have a graphic record of your simulation results in addition to your\ngeometry.\n1.\nIn the grasshopper file, \"bake\" the simulation results in the Rhino file by \"middle-\nclicking\" the twelve components on the right side of the Student Dashboard (labeled\n\"bake results at end of game\"). See Figure 3.\n2.\nSave this Rhino file in a safe place for your record.\nLastly the grasshopper file creates a C:\\SimulationGame folder, and a series of\nsubfolders for each simulation you ran. These subfolders are where all the \"behind the scenes\"\ninput/output simulation files are located. The only file you need to be aware of is the\n\n\"SettingsX.txt\" text file which contains a written documentation of the settings you chose for\neach iteration.\nFig 2 Screenshot of baked results and documented entry in Rhino.\nFig 3. Location of your \"settingsX.txt\" file in the numbered subfolders within the\nC:\\SimulationGame directory.\n\nPart 3 - Design description\nAlong with Rhino and Grasshopper files prepare a description of your simulation game\nexperience. You description should include:\n1.\nGraphic representation of your baseline design and at least four of your most\nimportant iterations (in perspective or axonometric) from Part 2 - they could include\nyour starting point, decisive moments in the middle where you decided to make a\nbig change, and/or your best performing scheme. Include the settings you used\n(reference the text file from Figure 3).\n2.\nSource EUI results of each scheme you present. These can be taken straight from\nRhino or you can create a new graph that shows how your performance evolved.\n3.\nComment on the following:\n-\nWhat strategy or upgrade worked the best in reducing Source EUI? What was\nleast effective?\n-\nDo you feel that the simulations helped you to improve the energy concept of\nyour building over your baseline design?\n-\nDo you trust your results as far as a comparative analysis is concerned? Would\nyou feel comfortable using your simulation skills in studio or during a design\ninternship in an architectural office?\n-\nHow will what you learnt during the simulation game impact for your final\nproject?\nGood luck and have fun!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/e7ce684bf283f16e21ca14755834116c_MIT4_401F18_lec1.pdf",
      "content": "Christoph Reinhart\nL01 Course Introduction | Energy Use in Society\n4.401/4.464 Environmental Technologies in\nBuildings\nMassachusetts Institute of Technology\nDepartment of Architecture\nBuilding Technology Program\nEnergy Considerations\n\n\"Our goal is to change current architectural design and urban planning practice by developing,\nvalidating and testing workflows and metrics that lead to improved building and neighborhoods\nregarding resident comfort and resource efficiency.\"\nweb.mit.edu/SustainableDesignLab\n\nCourse Description\nThe primary focus of this course is the study of the thermal, luminous, and\nacoustic behavior of buildings.\nThe course examines the basic scientific principles underlying these\nphenomena and introduces students to a range of technologies and analysis\ntechniques for designing comfortable indoor environments.\nStudents will be challenged to apply these techniques and explore the role light,\nenergy, and sound can play in shaping architecture.\n\nAt the end of the course you will be able to ...\nunderstand and apply the scientific principles underlying the thermal and\nluminous behavior of buildings,\nlearn to evaluate the pros and cons of a range of technologies for creating\ncomfortable indoor environments,\nconduct a series of design analysis workflows regarding climate, building\nenergy use, and daylighting,\nacquire the knowledge required to critically discuss/present the\nenvironmental concept of a building.\n\nBalance between physical principles and design analysis\ntechniques for a more evidence-based design approach.\nWe will be covering an enormous field. Are there any\nspecific topics of interest? Just ask!\nMy goal is to give you the skills that you need to design resource-efficient buildings with\nhigh occupant satisfaction.\nEducational Approach\n\nMechanics\nWeekly lectures on Mondays and Wednesdays from 11.00 to 12.30.\nFriday lab from 10.00 to 11.00 for 4.464 and 11 to noon for\n4.401.\nMy availability: After class and by appointment.\n\nCourse Requirements\nAttendance at all lectures and workshops is mandatory.\nAll assignments have to be submitted in time. Late assignments will not be accepted.\nPreparation of 20-minute in-class group presentation on one of this year's AIA Cote Top\nTen Projects.\nPresent a group course project in class on (4.401) or during exam week (4.464).\nActive participation in class discussions.\nParticipation in Simulation Game.\n\nCourse Evaluation\nQuality and timely submission of completed assignments\n(45%).\nCourse project presentation (30%)\nCase study presentation (15%).\nParticipation in class discussions (10%).\n\nCourse Project\nThe course project will be to develop and present an environmental concept for a\nmedium-sized office building/innovation space in Seattle, Chicago, or Houston. Project\npresentations should include:\nOverall design approach and environmental features\nDaylighting, glare, and electric lighting analysis\nThermal analysis and predicted energy use\n\nAIA/COTE Top Ten Green Projects\nNext week, we will form groups for the course project and AIA project presentations. Group sizes will\ndepend on final enrollment numbers.\n(c) AIA. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nSimulation Game\nPaper:\nC F Reinhart, T Dogan, D Ibarra and H W Samuelson, \"Learning by doing - Teaching energy simulation as a game,\" Journal of Building Performance Simulation,\nOctober 2011.\nC F Reinhart, J Geisinger, M Saratsis and T Dogan, Building Simulation 2015 in Hyderabad, December 2015.\n\nResources\n\nCourse Software\nYou will be needing the following programs (latest version always):\n-\nRhinoceros3d\n-\nDIVA4\n-\nClimate Consultant\n\nWorkflows - Rhino\nRhino and Grasshopper form the CAD backbone of all environmental analysis tools that we will be using in this class.\nYou should ideally have a working version of Rhinoceros 5 or 6 installed on your laptop or workstations.\n\nDIVA-for-Rhino is a daylighting and energy modeling plug-in for Rhinoceros 3D (www.Solemma.com). We will be using\nDIVA for assignments on solar radiation, daylighting and energy analysis. Students may request free licenses for their\nlaptops from the Solemma web site or use DIVA on the MIT lab computers. Please note that you need a Windows Version\nof Rhino 6.0 or higher to run DIVA.\n(c) Solemma LLC. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nDiva Shading Analysis\n(c) Solemma LLC. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\n(c) Solemma LLC. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nDiva Daylighting Analysis\n\nsimulations using the US department of Energy's EnergyPlus whole building simulation engine.\nThermal Analysis\n(c) ArchSim. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nArchSim is another Grasshopper plug-in that is part of DIVA 4 that supports detailed, dynamic, multi-zone thermal\n\nWorkflows - Grasshopper\nGrasshopper3d is Rhino's visual scripting environment.\nRhino 3D\nGrasshopper 3D\n\nAnimated Building Performance Simulation\nSimulation by Jeff Niemasz and Kera Lagios. Used by permission.\n\nClimate Consultant\n\nClima+\n\nCourse Book\nWork flows.\nPurchase on Amazon for $38 or directly from instructor for $20.\n\nDIVA Tutorials\nhttp://solemma.net/TrainingRhino.html\nhttps://www.solemma.com/TrainingGH.html\n\nLink to Studio\nUltimately, it is up to you and your studio critic to implement sustainable design\nfeatures in your projects.\nIf you need help with your design projects there is a group of students in Building\nTechnology who are prepared to help you. Some of the leading research on environmental\nbuilding performance analysis is done at MIT. Make use of that knowledge.\n\nThis Week's Reading and Tutorials\nChapter 1: Introduction\nDIVA GH 01: Visualizations\nDIVA RH 01: Visualizations\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/7d0075e4cfca2a38a0cf86a634ca4205_MIT4_401F18_lec10.pdf",
      "content": "Christoph Reinhart\nL10 Visual Comfort\n4.401/4.464 Environmental\nTechnologies in Buildings\nMassachusetts Institute of Technology\nDepartment of Architecture\nBuilding Technology Program\n\nLighting Module\nLight and Human Vision\nDaylighting Design Principles\nDaylight Simulations & Metrics\nVisual Comfort\nElectric Lighting\n√\n√\n√\n\nFramework for High-Performance\nBuildings\nVisual\nComfort\nDaylight\nAvailability\nEnergy\nOccupant Behavior\nControls\n\nVisual Comfort\n\nWhat is visual comfort?\nThe absence of visual discomfort = no occupant complaints .\nA more nuanced way to describe visual comfort is the balance between visual\nliabilities:\no\nGlare\no\nVeiling reflectances\no\nLack of privacy\nand visual assets:\no\nView\no\nAccess to daylight\no\nVisual connection to the outside\n\nDetecting Glare\n\nWhat is glare?\nGlare is a subjective human sensation that describes 'light within the field of\nvision that is brighter than the brightness to which the eyes are adapted'\n(HarperCollins 2002).\nImage courtesy of Zstardust on Wikipedia. This image is in the public domain.\n\nVisual Comfort\nThe human eye can see across twelve orders of magnitude.\nWe can adapt to about 2-3 orders of magnitude at a time via the iris.\nLarger ranges take time and require 'neural adaptation'.\n\nTypes of Glare\nGenerally we are distinguishing between three types of glare:\nDisability Glare: Glare that precludes a person from seeing an object. An example\nmight be the inability of a lifeguard to see all swimmers in a pool.\nDiscomfort Glare: An occupant can still see all objects of interest within a scene but\nthe overall brightness or luminance contrast within a scene cause strain of the eye\nwhich - over times- might lead to discomfort, premature tiring of the eye and other\neffects.\nVeiling Reflections: The latter is really a subset of the former two and corresponds\nto times when reflectances of specular surfaces act as glare sources.\n\nCase Study: Disability Glare\n'Walkie-Talkie' skyscraper, London, by Rafael Vinoly, 2014, Photo courtesy of Martin Pettitt on Flickr. License: CC BY.\nConcentrated sunlight melted parts of a nearby parked Jaguar.\n\ndynamic interaction of light and building form\n\nvoid plastic TestMaterial\n0.965 0.965 0.965 0.02 0\nRadiance Material 'Plastic'\nRed Green\nBlue\nSpecularity\nTake note\n'plastic' is a keyword that\ncannot be changed,\n'TestMaterial' can be any\nstring to describe the\nmaterial properties of the\nsurface. Such as\nwooden_table'.ii\nTypical reflectance values\n- floors 30%\n- wall 50%\n- ceiling 70 - 90%\nTypical specularity values:\n- matt 0\n- glossy 0.02\nRoughness\n\nLighting Materials for Simulation\n(c) SUTD Design for Climate and Comfort Lab. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nBanana\nyellow\n(just turned)\nTo use in your model:\nCopy into \"materials.rad\" file\nunder your Rhino file\\Rhino\nfile directory\\resources\n\nCase Study: Ruined aesthetics\nImage removed due to copyright restrictions.\nhttps://www.nytimes.com/2012/05/02/arts/design/renzo-pianos-nasher-museum-in-dallas-has-sunburn-\nproblem.html\nUnwanted reflections in the The Nasher Sculpture Center, Dallas, TX, by Re Piano, 2003.\nNearby apartment buildings caused unwanted reflections in a sculpture garden\n\nCase Study: Disability Glare at an Airport\nDisability glare in an airport control tower\nA large PV installation caused glare in an airport control tower.\nThe PV panels had to be covered with tarps.\n\nPredicting Disability Glare\nConsider forward scattering effects of PV panels.\n\nSolid angle of glare source > 30,000cd/m2\nPV panels rotated by 90 degrees towards the east\n\nGlare is hard to detect because it is\nview dependent\n\nGlare Indices\nDaylight glare probability formula\nA glare index is a numerical evaluation of\nhigh\ndynamic\nrange\nimages\nusing\na\nmathematical formula that has been derived\nfrom human subject studies. Example indices\ninclude the unified glare rating (UGR) and the\ndaylight glare index (DGI).\nDaylight glare probability (DGP) is becoming\nincreasingly widely used. DGP was developed\nbased on HDR photography measurements\ncombined with human subject evaluations.\nPaper:\nWienold\n&\nChristoffersen,\n\"Evaluation\nmethods\nand\ndevelopment\nof\na\nnew\nglare\nprediction\nmodel\nfor\ndaylight\nenvironments with the use of CCD cameras \" Energy & Buildings\n\nDaylight Glare Probability (DGP)\nDGP is a recently proposed discomfort glare index that was derived by\nWienold and Christoffersen from laboratory studies in daylit spaces using 72\ntest subjects in Denmark and Germany.\nTwo identical, side-by-side test rooms were used. In Room 1 a CCD camera\nbased luminance mapping technology was installed at the exact same position and\norientation as the head of the human subject in Room 2.\nPaper:\nWienold\n&\nChristoffersen,\n\"Evaluation\nmethods\nand\ndevelopment\nof\na\nnew\nglare\nprediction\nmodel\nfor\ndaylight\nenvironments with the use of CCD cameras.\" Energy & Buildings\n\nDGP Formula & Comfort Ranges\n\nDaylight Glare Probability Examples\nImages courtesy of Ammar Ahmed. Used with permission.\n\nDGP allows users to go back an forth between\nsimulation and reality through HDR photography\nHDR Image (Digital Camera)\nHDR Image (Radiance)\nevalglare program\ninstantaneous daylight glare probability\n\nAnnual Solar Exposure\nImage courtesy of Solemma. Used with permission..\n\nDaylight Availability\nImage courtesy of Solemma. Used with permission.\n\nDaylight Glare Probability\nImage courtesy of Solemma. Used with permission.\n\nAnnual Glare Analysis\nAnnual analysis of east view and west view.\nGlare in reference office\n\nThe formula makes sense. How plausible are\nDGP results compared to other glare indices?\n\nHow to analyze for visual discomfort?\nPaper: J A Jakubiec and C F Reinhart, 2011, \"The 'adaptive zone' - A concept for assessing glare throughout daylit spaces.\"\nLighting Research and Technology 44, pp. 149-170.\n\nConcept of the Adaptive Zone\nDesign: Jeff\nNiema\nsz\nThe concept helps to quantify the benefits of flexible furniture settings etc.\n\nAdaptive Visual Comfort\nRolex Center, Lausanne, Switzerland, Architecture Sanaa\n\nLong-Term Visual Comfort\nPaper: J A Jakubiec and C F Reinhart, 2016, \"A Concept for Predicting Occupants' Long-Term Visual Comfort\nwithin Daylit Spaces.\" LEUKOS, 12:4, pp. 185-202.\nDGP simulation along with the presence of direct sunlight at or near participants' studio\nspaces every ten minutes from Jan to Apr.\n97 students participated\n\nVeiling Reflectance\nContrast ratio\n\nLong-Term Visual Comfort\nPaper: J A Jakubiec and C F Reinhart, 2016, \"A Concept for Predicting Occupants' Long-\nTerm Visual Comfort within Daylit Spaces,\" LEUKOS 12:4, pp. 185-202\nIntegrate glare model predicts\nlong-term comfort evaluations with\nan accuracy of 73% to 87%,\ndepending on the time of day.\nFor Gund Hall it was found that the\nstudents tolerated: disturbing\nglare for 4% of time; direct sunlight\n(vertical eye illuminance >\n1000lux) for 5% and reduced\ncontrast (CR<4) for up to 24%\nMain idea: It does not have to be\ncomfortable all the time for people\nto be satisfied with a space.\n\nGund Hall Study - Results 8 AM to\nNoon\nDesign: Jeff\nNiema\nsz\nExact prediction 40%\nExact within one prediction 69%\n\nGund Hall Study - Results Noon to\n2 PM\nDesign: Jeff\nNiema\nsz\nExact prediction 64%\nExact within one prediction 85%\n\nGund Hall Study - Results 2 PM to 6\nPM\nDesign: Jeff\nNiema\nsz\nExact prediction 64%\nExact within one prediction 87%\n\nView\n\nWhat is a view?\n\nHow would you rate this view?\n\nHow would you rate this view?\n\nHow would you rate this view?\n\nViews\nA view is a universally recognized asset in architecture and real estate.\nBenefits of a window include occupants' ability to focus on a faraway point to a\ndirect link to the outside world.\nIt seems surprising that there are no well established metrics to evaluate a view.\nA view requires:\n*direct lines of sight between an inside observer and select outside objects\n*content\n*since views work two ways, a view may become a privacy concern\n\nCredit 8.2 Views for 90% of Spaces Achieve direct line of\nsight to vision glazing for building occupants in 90% of\nall\nregularly\noccupied\nspaces.\nExamples\nfor\nexceptions: copy rooms, storage areas, mechanical,\nlaundry and other low-occupancy support areas.\nView to the Outside in LEED I\n\nCredit 8.2 Views for 90% of Spaces View consists of a\nlocation that meets a minimum of two out of four\nrequirements:\nIt offers direct line of sight to a vision glazing in\nmultiple directions that span an angle of at least 90o .\nThe view contains objects of interest including flora\nand fauna or moving objects such as people.\nInterior view of a vision glazing must be unobstructed\nas evidenced by either distance to the building\nperimeter or a more detailed view factor rating\npromoted by the California Energy Commission.\nView to the Outside in LEED I\n\nLEED v4\n\nView - As a Formgiver\nPaper: H. Doraiswamy, N. Ferreira, M. Lage, H. T. Vo, L. Wilson, H. Werner, M. Park and C. Silva, 2015, \"Topology-based\nCatalogue Exploration Framework for Identifying View-Enhanced Tower Designs,\" ACM Transactions on Graphics, Proceedings\nof Siggraph Asia 2015, 34:6, pp. 230-247\nImage courtesy of ACM. Used with permission.\n\nResearch on Urban Views\nDefine view as a combination of three qualities.\nImage courtesy of Luc Wilson. Used with\npermission.\n\nKPF Research on Urban Views\nBig data increasingly allows us to apply building level analysis to\nurban settings.\nImage courtesy of Luc Wilson. Used with\npermission.\n\nComparative View of Two Facade Variants\nImage (c) Ennead Architects and Perkins Eastman. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHow about your own view?\nPhoto courtesy of Nan Zhao, MIT Media Lab. Used with permission.\n\nVisual Interest\n\nVisual Interest\nImages removed due to copyright restrictions.\n\nConnectivity\nImage courtesy of Irmak Turan. Used with permission.\n\nConnectivity\nImage courtesy of Irmak Turan. Used with permission.\n\nView and daylight area\n\nFacade Study\nDaylit Area 44%\nDAmean= 46%\nDaylit Area 69%\nDAmean= 65%\nDaylit Area 100%\nDAmean= 89%\nDaylit Area 73%\nDAmean= 69%\nDaylit Area 80%\nDAmean= 76%\n\nSplit Blind Study\nClose-up and interior view of a split blind\n\nSplit Blind Study\nDaylit Area 45%\nDAmean= 45%\nLighting = 7.8 kWh/m2 yr\nDaylit Area 69%\nDAmean= 65%\nLighting = 5.7 kWh/m2 yr\nDaylit Area 62%\nDAmean= 57%\nLighting = 6.3 kWh/m2 yr\n\nPerforated roller blinds maintain a view\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/9e1814f0e72c5b6b6748238570b34efe_MIT4_401F18_lec11.pdf",
      "content": "Christoph Reinhart\nL11 Occupant Behavior + Electric Lighting\n4.401/4.464 Environmental Technologies in\nBuildings\nMassachusetts Institute of Technology\nDepartment of Architecture\nBuilding Technology Program\nParty Mode in the BT Lab\n\nAssignment 3 - Thermal Comfort\nYou were comfortable and the standard...\nPredicted Mean\nVote\nAdaptive\nComfort\nAgreed √\nDisagreed ×\nAgreed √\nDisagreed ×\n74%\n88%\n26%\n12%\nPhoto courtesy of Rick on Flickr. License: CC BY-NC-SA.\n\nAssignment 3 - Thermal Comfort\nYou were uncomfortable and the standard...\nPredicted Mean\nVote\nAdaptive\nComfort\nAgreed √\nDisagreed ×\nAgreed √\nDisagreed ×\n76%\n24%\n24%\n76%\nApplicability of the adaptive comfort standard is not valid in indoor spaces with active cooling.\nOther environmental factors such as noise, poor daylight, and low indoor air quality could influence perception of\nthermal comfort.\nThermal history: The climate of the previous city you lived in may set your thermal expectations.\nPhoto courtesy of Steven Leckart on Flickr. License: CC BY-NC.\n\nLighting Module\nLight and Human Vision\nDaylighting Design Principles\nDaylight Simulations & Metrics\nVisual Comfort\nElectric Lighting\n√\n√\n√\n√\n√\n\nOccupant Behavior\n\nFramework for High-Performance Buildings\nVisual\nComfort\nDaylight\nAvailability\nEnergy\nOccupant Behavior\nControls\n\nOccupant Behavior\nOccupant use of lighting and shading controls matters.\nPriority one: switch lights off when nobody is present.\n\nEarth at Night\nPhoto courtesy of NASA. This image is in the public domain.\nNearly all the light that you see here does not serve any purpose.\n\nBlind & Lighting Use in NYC Classrooms\nImage removed due to copyright restrictions.\n183 teacher surveys, 9 participating schools\n\nBlind & Lighting Use in NYC Classrooms\n183 teacher surveys, 9 participating schools\nImage removed due to copyright restrictions.\n\nMonitoring User Behavior\nPaper: Reinhart C F, Voss K, \"Monitoring manual control of electric lighting and blinds.\" Lighting Research & Technology 35:3, pp. 243-260,\n2003.\n\nHOBO data logger\nIlluminance\nTemperature\noccupancy\nMonitoring Setup in the Offices\n\nreceiver\n2414.5 MHz\ndata acquisition\nEIB system\nBlind setting\nvideo surveillance camera\nMonitoring Blind Usage\n\nSwitch-on Probability\nElectric lighting tends to get switched on when occupants arrive.\n\nPeople are Consistent but Different\nTwo main behavior types, active and passive.\n\nSwitch-On Probability\nSurprising consistency at the building level.\n\nBehavioral patterns can change in the presence of automated controls\nSwitch-Off Probability\n\nIntermediate Switch-On Probability\n\nannual occupancy\nprofiles\nannual illuminance\nprofiles\nLightswitch 2002\nLightswitch Algorithm\n(stochastic)\nel. lighting/blinds profile\nModel Overview\nPaper: Reinhart C F, \"Lightswitch 2002: A model for manual control of electric lighting and blinds,\" Solar Energy 77:1, pp. 15-28, 2004\n\nLightswitch - Manual Lighting Control\n\nManual Blind Control\nOccupants tend to avoid direct sunlight stripes like this near the work place.\nPhoto courtesy of Mathias Wambsganss. Used with permission.\n\nManual Blind Control\nBlinds get lowered to avoid direct sunlight falling on the work plane.\n\nLightswitch - Manual Blind Control\n\nLightswitch - Manual Blind Control\nDefine work plane sensors that define where the occupants are usually located.\nAssociate sensors with shading groups. A shading group consists of a (set of) blinds that are opened and lowered\nat the same time.\nCheck when direct sunlight (>50 Wm-2) is incident on a work plan sensor.\nClose shading device if yes until occupant is away for more than an hour.\n\nDashboard\nReference Office\n\nElectric Lighting Design\n\nEnergy Use in Commercial Buildings\nIn 2014 11% of total U.S. electricity consumption was used for lighting by the residential and commercial sectors.\nIn residential buildings lighting contributed to 14% of total electricity consumption.\nIn the commercial sector (commercial and institutional buildings, public street and highway lighting) the portion was 19%\n\nLighting Design and LEED\n-\nASHRAE 90.1: The art of lighting is reduced to lighting power\ndensities (LPD) and power adjustment factors.\n-\nVery simplistic. What actually matters is\nActivation Time x LPD\nASHARE/IESNA Standard 90.1\noccupancy sensor\n\nLight Sources & Fixtures\n\nLight Direction\nLight travels in a straight line...radiates out from the source\nImage by MIT OpenCourseWare.A small circle with arrows radiating in every direction.\n\nLight Direction of Clear Lamps\nLight travels in a straight line...radiates out from the source\n.... add a clear enclosure or envelope around the source, the light will still travel in a straight line.\n31 Image by MIT OpenCourseWare.\n\nLight Direction of Frosted Lamps\nLight travels in a straight line...radiates out from the source\n.... add a coated or frosted enclosure or envelope\naround the source, the direction of light will bend and\nradiate from the surface of the enclosure\n32 Image by MIT OpenCourseWare.\n\nReflector Contours\nCircular\nSpecular\nRays diverge through light source\nReflector\n33 Image by MIT OpenCourseWare.\n\nReflector Contours\nParabolic\nSpecular\nRays parallel\nParabola\nReflector\nSlide courtesy of Conor Sampson.\nImage by MIT OpenCourseWare.\n\nReflector Contours\nEllipsoidal\nSpecular\nRays converge\n2 foci\nReflector\nSlide courtesy of Conor Sampson.\nImage by MIT OpenCourseWare.\n\nLamps for General Use\n\nThe higher the color temperature (CCT), the\n\"cooler\"\nthe color of the lamp is in appearance.\nThe lower the color temperature (CCT) the\n\"warmer\"\nthe color the lamp is in appearance.\nThis color temperature is measured in Kelvin.\nLamp Criteria: Color Temperature\n\nKelvin Range\n3000K\n3500K\n4100K\n5000K\nAssociated Effects\nand Moods\nFriendly Intimate\nPersonal Exclusive\nFriendly Inviting\nNon-threatening\nNeat\nClean\nEfficient\nBright Alert\nExacting\ncoloration\nAppropriate\nApplications\nRestaurants Hotels\nLobbies Boutiques\nLibraries Office areas\nRetail stores\nPublic reception areas\nShowrooms\nBookstores Office\nareas\nOffice areas\nConference rooms\nClassrooms Mass\nmerchandisers\nHospitals\nGalleries Museums\nJewelry stores\nMedical examination\nareas Printing\ncompanies\nCOLOR\nTEMPERATURE\nWARM\nNEUTRAL\nCOOL\nDAYLIGHT\nCorrelated Color Temperature\nNorth sky light >10,000 K\nImage by MIT OpenCourseWare.\n\nStandard Incandescent Lamps\nVaried wattages, sizes, shapes, and bases\nFinishes: clear, inside frosted, coated\nEconomical\nShort lamp life\nWarm light\nCan be dimmed\n\nHalogen Lamps (also Incandescent)\nVaried wattages, sizes, shapes, and bases\nFinishes: clear, inside frosted, coated\nSmall sources - Ideal for controlled optics\nOften low voltage and require transformers\nWhite light\nCan be dimmed\n\nFluorescent Lamp Design\nRapid start and starter switch fluorescent\nbulbs have two pins that slide against two\ncontact points in an electrical circuit.\nImage by MIT OpenCourseWare.\n\nBallasts perform three main functions:\nThey start the lamp.\nThey take the line voltage (120/240/277/480) and step it up or down as required by the\nlamp.\nThey make sure that the lamp operates in stable mode by regulating the current.\nBallasts can be electromagnetic (heavy coils) or electronic (lightweight and high frequency).\nThe Uniqueness Rule\nBallasts are made specifically for the lamp they are designed to operate. You cannot simply replace a lamp\nwith a different type without changing the ballast. Since it regulates the voltage it is designed for a specific\nlamp type and wattage.\nBallasts\n\nFluorescent Lamps\nVaried wattages, sizes, shapes, and bases\nFinishes: Coated only - coating determines color\nOperates with specific ballast\nLong life\nCool burning\nDimming: Yes, with dimming ballast and specific dimmers\n\nSpectral Intensity of Various Light Sources\n\nHow LEDs Work\nSlide courtesy of Conor Sampson.\n\nLED Replacements for\nIncandescents\n6W LED (~40W incandescent)\n$10 per bulb\nLifetime: 25,000 hours\n\nElectric Lighting Design\n\nLighting Design Step 1\n\nLighting Design Step 2\n\nLighting Design Step 3\n\nRelated Tutorial\n-\nDIVA RH 05: Electric Lighting\n\nLighting Controls\n\nFramework for High-Performance Buildings\nVisual\nComfort\nDaylight\nAvailability\nEnergy\nOccupant Behavior\nControls\n\nElectric Lighting Energy Use = LPD x Time Activated\n\nManual, automated, and automated with manual override\nBi-level switching\nManual dimming\nPhotocell-controlled on/off\nPhotocell-controlled dimming\nOccupancy sensors\nOverview of Traditional Lighting Controls\n\nTo tailor lighting conditions to occupant's changing need.\nTo raise occupant satisfaction.\nTo save energy.\nWhy Lighting Controls?\n\nCeiling mounted (classrooms, open offices)\nWall mounted (small spaces, single offices)\nDetecting Occupancy\n\nPhotocell Controlled Dimming\nfewer sensors\nless dependent on interior changes\nworks well for top lighting or in the absence of\na shading device\ngood solution for shared spaces (atria, retail,\nopen plan)\nmore sensors but more individualized\nconsiders blind setting\nsuitable for private offices\nrequires careful commissioning\n\nNew York Times Headquarters\nArchitects: Renzo Piano, Fox & Fowle\nResearch Project: Lawrence Berkeley National Laboratory\nPhoto courtesy of Eleanor Lee. Used with permission.\nAt the time (2001), the largest installation of automated lighting and dimming controls in North America. The size of the\nproject halved the price for electronic dimming ballasts.\n\nElectric Lighting\nReference Office\n\nModern Smartphone-Based Lighting\nA room like this has millions of different lighting settings.\n\nModern Smartphone-Based Lighting\nWe are typically reducing the number of settings to a handful.\n\nLighting Study\nEvaluate occupant preference for different scenes on 13 dimensions.\nHome screen\nOne time survey\nIs the current scene suitable for:\nsketching on paper\ninformal presentation with slides\ncoffee break\nbrainstorming in a group\nprogramming/CAD or video editing on a computer\nformal presentation with slides\ncreative task using a computer\nreading a magazine\nhand-craft\ninformal phone conversation\nformal phone conversation\nstudy/memorization\ncasual conversation with a friend\n(routine) email on computer\n\nLighting Study\nUsing principal component analysis we are mapping/grouping individual survey results on two axes.\nN Zhao, CF Reinhart and JA Paradiso, 2018, \"Image-based perceptual analysis of lit environments,\" Lighting Research & Technology, first published July\n19, 2018, https://doi.org/10.1177/1477153518786768\n\nResults for Multiple Users\n\nDemocratic Map\n\nExample\nThe lighting preference maps are offered as a complement to traditional scene selectors.\nIf no user is present who has defined his or her preferences, use the democratic map.\n\nExample\nThe lighting preference maps are offered as a complement to traditional scene selectors.\nIf no user is present who has defined his or her preferences, use the democratic map.\nIf a single user is present with a preference, use his or her individualized preference.\n\nExample\nThe lighting preference maps are offered as a complement to traditional scene selectors.\nIf no user is present who has defined his or her preferences, use the democratic map.\nIf a single user is present with a preference, use his or her individualized preference.\nOtherwise we combine the map for everybody in the room.\n\nTake your map with you...\nPeople can take their preference with them without sharing their data unless needed.\nPhoto courtesy of Christopher on Flickr. License: CC BY-NC.\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/c03cdb9ea591216d81a3f2febd616a3c_MIT4_401F18_lec12.pdf",
      "content": "Christoph Reinhart\nL12 Thermal Mass and Heat Flow\n4.401/4.464 Environmental Technologies in\nBuildings\n\nThermal Module\nThermal Mass & Heat Flow I\nHeat Flow II & Insulating Materials\nWindow Technologies & Shading\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\nSimulation Game\n\nThermal Mass\n\n'Heat' (Internal Energy)\nInternal energy is a form of energy that is stored in a material as molecular motion\n(sensible energy) or that is associated with the phase of the material (latent energy).\nSensible energy is measured in temperature (concept of absolute zero, degree Celsius,\ndegree Kelvin, degree Fahrenheit).\nLatent energy is the amount of heat energy released or absorbed by a substance during\na change of phase.\n\nWhat are the three thermal material properties that you want to know\nof a building material?\nThermal Material Properties\nASHRAE Handbook of Fundamentals (c) ASHRAE. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nDensity\nThermal conductivity\nSpecific heat\n\nSpecific Heat\nSpecific heat is the quantity of heat required to increase the temperature of a unit mass of a material by one\ndegree. Its units are J/kg K or BTU/lb oF. The specific heat of water is exactly one since 1 BTU is required raise\none pound of water by one degree Fahrenheit. Most other materials have a specific heat or heat capacity lower\nthan water.\nExample values :\n\nVolumetric Heat Capacity\nSince the quantity of a substance is often expressed in terms of its volume rather than its weight,\nthe volumetric heat capacity [VHC] describes the ability of a volume of substance to store internal\nenergy under a given temperature change. It may be derived by multiplying the density of a substance\nby its specific heat.\nExample values :\nNote: moving heat using air makes little sense.\n\nThermal Mass\nThermal Mass [TM] is the ability of a building component to store heat while experiencing a temperature change.\nThe thermal mass of an element depends on its volume as well as its volumetric heat capacity. It is simply defined\nas\nTM = Volume x VHC\n\nUS DOE Benchmark Small Office Building\nFloor area:\n511.1 m2\nWall area:\n225.7 m2\nRoof area:\n511.1 m2\nWindow area: 55. 8 m2\nUS Department of Energy Commercial Benchmark Building\nURL: https://www.energy.gov/eere/buildings/commercial-reference-buildings\n\nThermal Mass Example - Building Floor\nWhat is the thermal mass of a concrete floor with a thickness of\n0.1 m that extends across the Small Office Building?\nTM = Volume x VHC\nVolume = 27.69 m x 18.46 m x 0.1 m = 51.1 m3\nVHC = 2016 kJ/m3K\nResulting in:\nTM = 10,3049.3 kJ/K ~ 28.6 kWh/K\nwith 1 kJ = 1 kWs = 1 kW3600s/3600 = 1/3600 kWh\n\nThermal Mass Example - Enclosed Air\nWhat is the thermal mass of the enclosed air?\nTM = Volume x VHC\nVolume = 27.69 m x 18.46 m x 3.05 m = 1559 m3\nVHC = 1.2 kJ/m3K\nResulting in:\nTM = 1870.8 kJ/K ~ 0.5 kWh/K\nThermal mass of air is negligible.\nwith 1 kJ = 1 kWs = 1 kW3600s/3600 = 1/3600 kWh\n\nHeat\nThe heat/internal energy required to raise the temperature of an object (without changing its phase)\ncorresponds to the thermal mass of the object times the temperature difference.\nQ = TM x (Tbefore - Tafter)\nNote: A negative energy value indicates that energy is absorbed by the object.\nWhat is the energy required to raise the temperature of the concrete floor by 2 K?\nQ = TM x ∆T = -28.6 kWh/K x 2 K = -57.2 kWh\n\nLet's build our first\nbuilding.\n\nThe PASSYS Test Cells\nThe PASSYS test cells were developed in 1990 in Europe to systematically test the performance of the different\nsolar architectural facade solutions as well as to validate building performance simulation programs (BPS).\nBPS tools were developed to model the various heat and mass flows in and around buildings. Transient or dynamic\nPBS can also consider the effect of thermal mass.\nPhoto courtesy of Elsevier, Inc., https://www.sciencedirect.com. Used with permission.\n\nBuilding Technology Test Cell\n\nInitial BPS Validation through the PASSYS Test\nCells\nESP-r model\nESP-r simulation\nIf carefully calibrated, the ESP-r program was shown to reproduce measured temperature developments within the\nlimits of measurement accuracy for all simulation inputs.\nA future lecture will be dedicated to BPS.\nEuropean Commission, \"The PASSYS Test Cells: A COMMON EUROPEAN OUTDOOR TEST FACILITY FOR THERMAL AND SOLAR BUILDING RESEARCH,\" EU Bookshop EU-NA-12882-EN-C,\n1990, pp. 1-68.\nP. Stachan, Model Validation using the PASSYS Test Cells, Building and Environment, 28:2, pp. 53-165, 1993.\nCourtesy of Elsevier, Inc., https://www.sciencedirect.com. Used with permission.\n\nThermal Mass Study of a PASSYS Cell\nThermal mass dampens temperature swings and adds \"inertia\" to a space.\n\nAnnual Temperature Curves for Varying Concrete Thicknesses\nAs the thermal mass increases, the indoor temperature follows increasingly longer outside DBT\ntrends.\nFor a theoretical 1.6 m thick concrete envelope the lag time of thermal mass becomes visible.\n\nThermal Mass in Different Climates\nGo to www.ClimaPlus.net\nBoston\nSan Francisco\n\nTowards A More Comfortable Test Cell\n0.2 m thick concrete seems to be a \"practical\" thickness.\nUnfortunately, it does not seem to be very comfortable in our test cell.\nLet's explore what happens over the course of the year.\n\nFever Curve - No Insulation\nA fever curve is a graphical method to analyze temperature distributions over the course of a year. The curve\nshows the cumulative number of all (occupied) hours in a year during which a temperature is above a given\ntemperature.\nFever curves are frequently used to test the ability of different design to keep a space within a given comfort\nrange.\nThe operative temperature in\nthis space over is over 26O Cfor\nmore than 1000 hours a year.\nThe temperature is in\nthe comfort range\nbetween 20o C and 26o\nC for only 2000 hours\na year (3000 hours -\n1000 hours) .\nThe temperature in this space is over 20O C for about 3000\nhours a year. With 8760 hours in the year, the operative\ntemperature is below comfort range for more than 5000 hours.\n\n(c) Victor Olgyay\nPhoto by Dunnock_D on Flickr. License CC BY-NC.\nRomantic but uncomfortable. What can we do?\n\nTest Cell Fully Conditioned- No Insulation\nZone air temperature is controlled between 20o C and 26o C.\nThermal mass is only activated during the transition week.\n\nWIPO Conference Hall, Geneva, Switzerland\n(c) Benisch Architekten. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/.\nThermal mass may act as a liability to keep a space comfortable e.g. when\nit is only used intermittently.\n\nWIPO Conference Hall\n(c) Benisch Architekten. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHeat Balance of a Building\nIn order to understand the thermal behavior of a building, it is useful to think of the building as a system with a\nboundary with the boundary consisting of the building envelope (basement, external walls and roof). One can predict\nhow a building will behave over time by recalling the first law of thermodynamics, i.e. any excess energy crossing the\nbuilding envelope is going to be stored in the building's thermal mass.\nIf incoming and outgoing energy flows balance each other, then the system is in equilibrium and no energy is stored.\nsystem boundary\n-\n\nHeat Balance Equation\nTM x Tinside\n\nHeat Flow\n\nWhat happens to the temperature in the building if incoming and outgoing energy are the\nsame?\nIt remains constant.\n-\n\nWhat happens over time if Toutside =Tinside?\nHeat will 'flow' from hot to cold.\n\nHeat Flow\nHeat is energy in transit from one material to another material.\nThis transfer of energy or heat flow only happens spontaneously from an object with a high temperature to an\nobject with a lower temperature.\nAs water flows from a higher to a lower position, so heat flows from a higher temperature zone or object to a\nlower.\nThis principle is also called the 'Second Law of Thermodynamics'.\n\nWhat are the three forms of heat\nflow?\n\nHeat Flow\nHeat flow can take place in three forms :\nConduction: Heat flow within a body or through bodies in contact by the 'spread' of molecular motion.\nConvection: Heat flow from a solid to a fluid (gas or liquid) or vice versa. Convection involves the transport of\nheat from one surface to another via a moving fluid.\nRadiation: Transfer of electromagnetic energy from one body to another.\n\nConduction\n\nConduction\nIn buildings, conduction is a key contributor to heat losses and gains through the building\nenvelope.\nT1\nT2\nConduction occurs in solids when warmer molecules, which are vibrating faster than colder\nmolecules, transfer part of their energy to the colder molecules. It is a dynamic process.\n\nConduction\nThe simplest way to mathematically describe conduction through a material is its thermal\nconductivity. In general the conductivity, κ, of a material may vary in different directions\nwithin the material. However, in building science one usually assumes that materials have\nuniform thermal conductivity and that heat flows \"one dimensionally\" through a construction\nassembly. Units: W/mK\nExample values :\nNote that standing air is an excellent insulator.\n\nThe conductance through an 0.2 m (8\")thick concrete wall is\nUwall= 1.75 W/m K /0.2 m\n= 8.75 W/m2K\nConversion : 5.67446 W/m2K ≈1 BTU/h ft2·°F\nConductance\nConductance is a material property of a building element that describes how well the element\nconducts heat. Conductance is measured in W/m2K or BTU/h ft2 oF and is defined as:\nconductance = κ/material thickness\nConduction\n\nResistance\nResistance, R, is the inverse of conductance, C.\nR = 1/C\nConstruction assembly properties are often quoted in resistances since the total\nresistance of several layers in series can simply be added up.\nRTotal = RLayer 1+ RLayer 2 ...+ RLayer n\nNote that the order in which different layers are being arranged does not change the\noverall resistance of a construction assembly.\n\nExample - Wall Section of the DOE Small Office\nBuilding\nRWall = Rconcrete + Rfiberglass batt\n=\n0.025 m/0.69 W/mK + 0.2 m / 1.75 W/mK + 0.05 m / 0.043 m W/mK + 0.0125 m / 0.16 W/mK\n= 1.4 Km2/W\nConduction\n\n'R' Value and 'U' Value\nConductance and Resistance are rarely used in building physics. The quantities used instead are the 'U'-\nvalue and 'R' value because they also take surface effects (convection) into account. The 'R' value is the\ninverse of the 'U' value.\nConvection\noutside\nair node\ninside\nair node\nConvection\nConduction\n?\n?\n\nConvection\n\nSurface Effects - Convection\nConvection is heat flow through the movement of molecules within fluids (gas or liquid). This movement can\ntake place through diffusion (localized random movements) or larger scale movements (currents) within the\nfluid. Only the latter type of convection is effectively transporting heat.\nForced Convection describes a convective heat flow that is externally induced, e.g. through a fan.\nNatural Convection describes convective heat flow that is caused by the act of heating a fluid e.g. buoyancy.\nT1\n=\nT2\nBrownian Motion\nfan\nForced Convection\nT1\n=\nT2\nNatural Convection\n\nNatural and Surface Convection\nNatural Convection phenomena are difficult to quantify and can play a major role in naturally ventilated\nbuildings. Natural air movement in buildings occurs through density differences in the air.\nSurface Convection is heat flow from a solid to a fluid (gas or liquid) or vice versa.\n\nSurface Conductance/Resistance\nSurface Conductance is a measure of the time rate of heat flow across a surface. This heat flow is usually\ncaused by natural and wind-induced convection as well as radiation. Surface conductances are usually measured\nand can be found in surface property tables. Same as conductance for a material, surface conductance is\nmeasured in W/m2K or BTU/h ft2 oF.\nSurface Resistance is the inverse of surface conductance.\nSurface resistances according to ASHRAE Fundamentals Chapter 22 :\nRegular Wall:\nInner Surface: Rinside\n= 0.12 m2K/W = 0.68 h ft2 F/BTU]\nOuter Surface (15 MPH wind): Routside = 0.03 m2K/W = 0.17 h ft2 F/BTU]\nConversion : 1 m2K/W ≈5.67446 h ft2·F /Btu\n\nCalculation of the 'R' Value\nThe air-to-air 'R'-value (Ra-a) is a measure of the overall thermal resistance of a building element including\nsurface effects. It can be calculated by summing up all the resistances of all building element layers as well as\ncorresponding surface resistances: Ra-a = Rinside + Rwall + Routside\nRa-a = 0.12 K m2/W + 1.4 K m2/W + 0.03 K m2/W = 1.55 K m2/W = 8 h ft2 F/BTU\nUwall = 1/R = 0.66 W/K m2\nThis is an \"R-8\" wall.\nConvection\noutside\nair node\ninside\nair node\nConvection\nConduction\n?\n?\n\nOnline U-Value Calculator\n(c) ubakus.de. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\nhttps://www.ubakus.de/u-wert-rechner/\n\nU-Value Calculator in DIVA/Archsim\n\nExercise: Conduction Heat Loss through the Walls of the DOE Small\nOffice Building\nWhat is the heat flow through the insulated wall, assuming an outside temperature of -5oC and an inside\ntemperature of 22oC?\nQ' = ΣUA x (Tinside - Toutside)\nThe U value of the wall is Uwall = 0.66 W/m2 K; the area is A = 225.7 m2 and so\nQ' = Uwall x A x (22o C - (-5o C)) = 0.66 W/m2 K x 225.7 m2 x 27 K = 4 kW\nIf this temperature difference remains over the course of an hour, the heat loss through the walls is 4 kWh. Note:\nFor thermal simulations we usually consider temperature changes in one hour increments (using TMY files).\n\nExercise: Conduction Heat Loss through the Walls of the DOE Small\nOffice Building\nNow consider all heat losses including the roof (URoof = 0.19 W/m2K) and windows (UWindow = 3.24 W/m2K).\nWhat is the heat flow through the envelope assuming an outside temperature of -5o C and an inside\ntemperature of 22oC?\nQ' = ΣUA x (Tinside - Toutside)\nAnd so:\nUwallx A x (22o C - (-5o C)) = 0.66 W/m2 K x 225.7 m2 x 27 K = 4 kW\nURoofx A x (22oC - (-5oC)) = 0.19 W/m2 K x 511.1 m2 x 27 K = 2.6 kW\nUWindowx A x (22oC - (-5oC)) = 3.24 W/m2 K x 55.8 m2 x 27 K = 4.9 kW\nΣUA = 11.5 kW\nNote that the windows dominate even though their area is small.\n\nSlab-on-Grade Floors\nThe concept of the U value is only applicable in assemblies exposed to air on both sides. This includes\nfloors above a crawl space. For other types of floors such as slab-on-grade, it has been found that heat\nflow scales roughly linearly with floor perimeter length. Accordingly, empirical heat flow coefficients\nare expressed in W/mK.\n\nExample Slab-on-Grade Floor\nAssuming a an R-5 slab-on-grade floor for the DOE Small Office Building dimensions 27.69 m x 18.46 m and a heat\nflow coefficient (F2) of 1.21 W/m K.\nThe heat flow is 2 x (27.69 m + 18.46 m) x 1.21 W/m K = 0.1 kW/K\nΣUAEnvelope = 11.5 kW + 0.1 kW = 11.6 kW\n6.4m\n9.75m\n\n(c) Victor Olgyay\nShould the insulation be\ninside or outside of the\nthermal mass/structure?\n\nConcept of Active vs Passive Thermal Mass\nOnly the thermal mass inside of the insulation is 'active' , i.e. adds\nthermal inertia to a space.\nPassive thermal mass\nActive thermal mass\nNote, the insulation thickness is exaggerated.\nNote that inside air and insulation also add thermal inertia (albeit generally very little) to a space.\n1'' stucco\n\nHeat Balance Equation\nNote that this equation only considers one-dimensional heat flow.\n\nExample - Resiliency\nQ: Imagine that during a cold night the heating system in the DOE Small Office Building breaks. It is 22o C in the building\nand -5o C outside. How fast does the indoor temperature fall with and without the thermal mass floor if one ignores the\nthermal mass of the walls?\n11.5kW\nConcrete floor: 29.1kWh/K\nNo concrete floor: 0.5kWh/K\nA: With concrete floor, the indoor temperature falls at 11.5 kW/29.1 kWh/K = 0.4 K/h. Without the thermal mass of the\nfloor, the temperature is free-falling at 11.5 kW/0.5 kWh/K = 23 K/h.\n\nSummary: Thermal Mass\nIf the outside diurnal temperature swing frequently oscillates around a desired (balance point)\ntemperature, adding thermal mass may increase the hours of comfort in a given time interval.\nThermal mass may act as a liability to keep a space comfortable e.g. when it is only used\nintermittently.\nThermal mass has really no effect if the direction of heat flow through the building envelope stays\nconstant for extended periods of time.\n\nApplications\n\nSunspaces with Thermal Mass\nJacobs house by Frank Lloyd Wright. Photo (c) source unknown. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSunspace with Thermal Mass\nJacobs house by Frank Lloyd Wright. Photo (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSolarium with Thermal Mass\nHsu House by Epiphyte Lab. Images (c) Epiphyte Lab. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPhase Change Material (PCM)\nA 1.5-cm-thick PCM panel can have the equivalent thermal heat capacity of a 14-cm-thick concrete wall allowing\nfor lightweight construction with high thermal mass.\nA key challenge when combined with nighttime flushing is hysteresis.\nhttps://www.architectureanddesign.com.au/features/features-articles/the-state-of-phase-change-materials-in-australian\nImage removed due to copyright restrictions.\n\nTrombe Wall Example\nSolar radiation incident on an opaque element. Heat is released into the space with a time delay. Most effective with\nshading.\nPublic domain image courtesy of Leonard P. on Wikipedia..\nVilla Tannheim, Headquarters of the International Solar Energy Society, Freiburg, Germany\n(Architecture Heinzel). Photo (c) ISES. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 13",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/751a40da4408146a65f198fd3edeb8ee_MIT4_401F18_lec13.pdf",
      "content": "Christoph Reinhart\nL13 Insulation Materials & Windows\n4.401/4.464 Environmental Technologies in\nBuildings\n\nThermal Module\nThermal Mass & Heat Flow\nInsulating Materials & Window Technologies\nShading\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\nSimulation Game\n√\n\nInsulation Materials\n\nRecommended R- values\nConversion : 1 m2K/W ≈5.67446 h ft2·F /Btu\nPublic domain image courtesy of the US Department of Energy.\n\nThermal Bridging\nIn order to calculate the mean 'R' value of a construction that consists of different types of\nconstructions, i.e. a wood stud construction, one has to calculate the 'R' value for each individual\nconstruction and then calculate the area weighted mean as the heat flow through the two constructions\ngoes 'in parallel'.\n1/Rwall = 0.2/RWood Studs + 0.8 /REPS Insulation\nWood Studs (20%)\nEPS Insulation (80%)\n\nU-Value Analysis\nTemperature Profile\nhttp://www.u-wert.net/berechnung/u-wert-rechner/\n(c) Ubakus. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nMoisture Profile\n\nThermal Bridging in Archsim\n\nStatus of Commercial Energy Codes\nhttp://www.energycodes.gov/status-state-energy-code-adoption Public domain image courtesy of the US Department of Energy.\n\nStatus of Residential Energy Codes\nhttp://www.energycodes.gov/status-state-energy-code-adoption\nIECC = International Energy Conservation Code\nPublic domain image courtesy of the US Department of Energy.\n\nMassachusetts Stretch Code\n(c) Commonwealth of Massachusetts . All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSome Insulation Materials\n\nExpanded Polystyrene (EPS)\nGlass Fiber Board: ~5 R per inch\nEconomical\nLeft: photo (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\nRight: photo courtesy of Inspectapedia.com. Used with permission.\n\n(c) Owens Corning. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit. edu/help/faq-fair-use/.\n\nGlass Fiber\nGlass Fiber Batt: ~4 R per inch\nEconomical\nPhoto courtesy of Best And Worst Ever Photo Blog. License: CC BY.\n\nMineral Fiber/Wool\nMineral Fiber: ~4 R per inch\nMore pleasant to work with than glass fiber.\n(c) source unknown. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nCellulose\nCellulose: ~3.5 R per inch\nCan be blown into existing wall cavities during energy retrofits.\nCan fill cavities of any shape.\nMake sure that cavity is dry all year round.\nMake sure that the whole cavity gets equally filled.\n(c) source unknown. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use.\n\nStraw Bale\nStraw bale: ~2.7 R per inch - Can be built very thick (18\")\nPhoto courtesy of yanmicols on Flickr. License CC BY-NC.\n\nAir Space\nVermiculite\nPerlite\nCellulose\nMineral Fibre\nPolymeric\nFoam\nVIP\nR-Value Per Inch.\nVacuum Insulation Panels (VIP)\n\nVacuum Insulation Panels (VIP)\nVIP are typically installed where space is very limited, for example in a basement or for a retrofit\nin a room with limited floor-to-ceiling height.\n\nVacuum Insulation Panel (VIP)\nhttp://www.enob.info/en/new-technologies/projects/details/precast-concrete-units-with-vacuum-insulation/\nVIP: ~35 R per inch\nVIP are typically installed where space is very limited, for example in a basement or for a retrofit in a\nroom with limited floor-to-ceiling height.\nWith precast concrete units plus VIP, building assemblies can achieve a U-value of 0.15 W/m2K, which\ncomplies with the passive house standard, with a total thickness of only 27 cm as opposed to the more\nstandard 60 cm.\nSource ENOB (www.enob.info/en/new-technologies/projects/details/precast-concrete-units-with-vacuum-insulation/)\n\nTHERM Analysis\n\nWindows\n\nInteraction of Radiation with Windows\nSolar heat gain coefficient (SGHC): Fraction of incident total solar radiation that reaches the interior.\nVisual Transmittance (τ): Fraction of incident visible radiation that reaches the interior.\n\nAngle-Dependent Transmittance\nCoated glazings have a faster transmittance falloff with rising incidence angles than\nsingle pane windows.\n\nWindow Label NFRC\n(c) NFRC. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHeat Balance Equation with Solar Gains\n\nNew England Home\n\nFrom Architectural to Thermal Model\nIn a multi-zone thermal model we are treating each room as a well-mixed thermal entity.\nAll windows are modeled coincident with the walls that they belong to.\nExternal shading objects (entrance roof) are modeled separately.\nThe basement is being ignored and it is assumed that there is no heat flow between basement and the 1st floor.\nFriday's tutorial will discuss building a simple thermal model in Archsim.\nArchitectural model\nMulti zone thermal model\nN\nThermal model courtesy of Nathaniel Jones. Used with permission.\n\nGlazing Study using DIVA/Archsim\nTwo zone energy model.\nRhino viewport\nThermal model in Grasshopper\n\nGlazing Study of the New England House\nBase case (uninsulated) with single pane glazing\n\nGlazing Study using DIVA/Archsim\nTwo zone energy model.\nVarying glazing types. What is 'Sgl_Clr_6'?\nRhino viewport\nThermal model in Grasshopper\n\nSgl_Clr_6\nSingle pane glazing, 6 mm clear glass\n100%\n7%\nτvis=88.4%\nSHGC =81.8%\nR~1 (U= 5.818 W/m2K)\n\nDbl_Clr_6_6_Air\nDouble glazing: 6 mm clear glass, 6 mm air gap, 6 mm clear glass\n100%\nτvis=78.6%\nSHGC =70.2%\nR~2 (U= 3.114 W/m2K)\n\nDbl_Clr_6_13_Arg\nDouble glazing: 6 mm clear glass, 13 mm argon gap, 6 mm clear glass\n100%\nτvis=78.6%\nSHGC =70.5%\nR=2.2 (U= 2.531 W/m2K)\n\nDbl_Clr_6_1_Vacuum\nDouble glazing: 6 mm clear glass, 1 mm vacuum, 6 mm clear glass\n100%\nτvis=78.6%\nSHGC =70.6%\nR=2.5 (U= 2.238 W/m2K)\nVacuum effective to keep a glazing unit thin\n\nVacuum Glazing in Building 2\n\nSelective Coatings\nPublic domain image courtesy of US EPA.\n\nDbl_LoE3_high_solar_gains_Clr_6_12_Arg\nDouble glazing: 6 mm clear glass Low -ε coating high solar gains on 3rd surface, 13 mm argon gap, 6 mm clear glass\n100%\nτvis=76.2%\nSHGC =62.9%\nR=4 (U= 1.434 W/m2K)\nBased on Cardinal Glass low-e 180 on 6 mm\nSurfaces are counted from the outside. The coating is on surface 3.\n\nDbl_LoE2_high_solar_gains_Clr_6_12_Arg\nDouble glazing: 6 mm clear glass Low -ε coating high solar gains on 2nd surface, 13 mm argon gap, 6 mm clear glass\n100%\nτvis=76.2%\nSHGC =60.1%\nR=4 (U= 1.434 W/m2K)\nBased on Cardinal Glass low-e 180 on 6 mm\n\nLow-ε Locator\nTest\nSlide 40\nSurface 1\nSurface 2\nSurface 3\nSurface 4\n\nSelective Coatings\nResidential Windows by Carmody, Heschong, Selkowitz; 2nd edition (2000)\nImage courtesy of W.W. Norton & Co. Used with permission..\nLow-e low solar gain\nLow-e high solar gain\n\nDbl_LoE2_all_climates_Clr_6_12_Arg\nDouble glazing: 6 mm clear glass Low -ε coating all climates, 13 mm argon gap,\n6 mm clear glass\n100%\nτvis=62.8%\nSHGC =27.1%\nR=4.3 (U= 1.328W/m2K)\nBased on Cardinal Glass low-e 366 on 6 mm\n\nDbl_LoE2_solar_control_Clr_6_12_Arg\nDouble glazing: 6 mm clear glass Low -ε low solar gains, 13 mm argon gap,\n6 mm clear glass\n100%\nτvis=37.5%\nSHGC =18.0%\nR=4.2 (U= 1.343 W/m2K)\nBased on Cardinal low-e 340 on 6 mm\n\nTriple Trp_LoE5_high_solar_gains_Clr_6_1_Vacuum\nTriple glazing: 6mm clear glass, 1mm vacuum gap, 6mm clear glass, 1mm vacuum gap,\n6mm Low-e high solar gains on 6mm clear glass\n100%\nτvis=68.2%\nSHGC =52.9%\nR=9.3 (U= 0.611W/m2K)\nBased on Cardinal Glass low-e 180 on 6mm\n\nSummary Glazing Study\nWhy is the overall effect of replacing glazings moderate in this case?\n\nProperties for Common Glazing Types\n\nSkylights\nConventional Skylight\nInsulating Glass Skylight\nNanogel filled\nR-2\nU=2.8 W/m2K\nR-20\nU=0.28 W/m2K\nR-10\nU=0.5 W/m2K\nτvis = 62%\nSHGC= 0.25\n\nNanogel\n0.5 W/m2K ~ R-10\n\nOther Aspects\n0.5 W/m2K ~ R-10\n20% of window is frame.\nCenter of glazing vs. frame effects.\n\nHistoric R-Values for Windows\nPublic domain image courtesy of US Department of Energy\n\nPassive Solar Heating Potential\n\nHeating and Cooling Degree Hours\nSeattle\nBoston\nPhoenix\n\nRadiation Map During Heating Season (Nov 1\nto Mar 31)\n1177kWh/m2yr\n\nWindows lead to a net gain on the south; east and west are borderline; north windows\nlead to a net heat flow loss.\nPerspective view facing northwest\nPerspective view facing southeast\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 14",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/77107c99112f7c2e4f90e7e454200b66_MIT4_401F18_lec14.pdf",
      "content": "Christoph Reinhart\nL14 Shading + Integrated Facade Design\n4.401/4.464 Environmental Technologies in Buildings\n\nWeekly reading and tutorials\nChapter 7: How to design a static shading system\nChapter 16: Integrated facade design\n\nThermal Module\nThermal Mass & Heat Flow\nInsulating Materials + Window Technologies\nShading + Integrated Facade Design\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\nSimulation Game\n√\n√\n\nShading\n\nAvoidance of visual discomfort (glare).\nAvoidance of thermal discomfort (overheating).\nAvoidance of cooling loads (energy).\nWhy Shading?\nSolar gains needed to reduce heating loads.\nMaintain a view to the outside.\nWhy not Shading?\n\nGeneral Guidelines\nFins (west or east facades)\nLouvers (equator-facing facades)\n\nCombined Fins and Overhangs\nHarvard Science Center\n\nIconic Louvers\nNew York Times building, architecture R Piano, (Photo courtesy of Scallop Holden on Flickr. License CC BY-NC-SA.)\n\n(1)\nWhen is it desirable to have direct solar radiation incident on a window?\n(a) Find a start and end date.\n(b) Find a start and end time of day.\n(2) What form should a shading device have to fulfill the requirements from step (1)?\nThe task of designing a static shading device can be divided into two steps:\nStatic Shading: When, where, how?\n\n(1) When do we want to\nshade?\n\nFind a start and end date for the shading period:\n\nOption 1: The cooling period lasts from March 21 to September 21.\n\nOption 2: Crossover between heating and cooling degree hours.\n\nOption 3: Crossover between heating and cooling loads.\n(1) When is it desirable to have direct solar radiation\nincident on a window?\n\nHeating and Cooling Degree Hours\nShaded period has to be symmetrical around the summer solstice.\n\nFind a start and end date for the shading period:\n\nOption 1: The cooling period lasts from March 21 to September 21.\n\nOption 2: Crossover between heating and cooling degree hours.\n\nOption 3: Crossover between heating and cooling loads.\n(1) When is it desirable to have direct solar radiation\nincident on a window?\n\nOption 3 One Zone Thermal Simulation\n\nOption 3. One Zone Thermal Simulation\n\nFind a start and end time of day for the period from May 9 to August 3 such as:\n\n9 AM to 3 PM\n\n10 AM to 2 PM\n\nat noon\n(1) When is it desirable to have direct solar radiation\nincident on a window?\n\nTemporal solar radiation map\n\nRadiation during cooling period: May 9 to August 3\nSensitivity analysis using radiation maps\n\n65% of solar radiation is incident on the south facade from 9 am to 3 pm.\n\nDecreasing the shading period by two hours decreases the percentage by 20%.\n24 hours\n200 kWh/m2\n9 am - 3 pm\n135 kWh/m2\n10 am - 2 pm\n90 kWh/m2\n\nTemporal solar radiation map\n\nA temporal radiation map can be plotted in DIVA based on a grid-based\nradiation map generated via Daysim.\n\n(2) Form finding\n\nShading from neighboring obstructions\n\nOption 1: 2d for method for a simple overhang.\n(2) What form should a shading device have to fulfill the\nrequirements from step (1)?\n\nTraditional Architectural Language\nCite de Refuge, Paris, France\nArchitect: Le Corbusier\nPhoto courtesy of Fred Romero on Flickr. License CC BY.\n\nOption 2: 3d for method for a simple overhang.\n(2) What form should a shading device have to fulfill the\nrequirements from step (1)?\n\nOption 2: 3d using Ecotect Shading Wizard\n(2) What form should a shading device have to fulfill the\nrequirements from step (1)?\n\nOption 2: 3d using Ecotect Shading Wizard\n(2) What form should a shading device have to fulfill the\nrequirements from step (1)?\nUses bottom nodes of the window as reference points. (Marsh 2003)\nHorizontal Shade\nSurround Shade\n\nWhat are the limitations of existing methods?\nSurround Shade\n*Shade has\nconflicting\nthermal value at\ndifferent times of\nyear. Most\nexisting methods\nhave no way of\nweighing the\ngood vs. the bad.\n\nAqua Building in Chicago\nArchitecture: Gang Studio\nPhoto courtesy of Johnathan Lobel on Flickr. License: CC BY-NC-SA.\nThe sizing of the overhangs is guided by formal aspects rather than by environmental\nperformance.\n\nShaderade - A New Approach\n\nStatic Exterior Shading: SHADERADE\nNew Approach: Break shading volumes / surfaces\ninto small pixels, and assess the thermal value of one\npixel at a time.\nFor speed, we run one thermal simulation of the\nspace without shading, and then cast solar rays to\nfind all hours during which a pixel casts direct shade\non a window. Based on loads and transmitted solar\ngains at those hours, the pixel is given credit for\nreducing cooling or punished for increasing heating.\nSurround Shade\nPaper: J Sargent, J Niemasz, C F Reinhart, \"SHADERADE: Combining Rhinoceros and EnergyPlus for the design of static exterior shading devices,\" submitted to Building Simulation\n2011, Sydney, November 2011.\n\nStatic Exterior Shading: SHADERADE\nSurround Shade\n-\nRhino\n-\nEnergyPlus\n-\nGrasshopper\n\nStatic Exterior Shading: SHADERADE\nSurround Shade\nOnce the volume has been assessed, any surface\nwithin its bounds can be visualized:\nCourtesy of Jon Sargent, Jeff Niemasz, and Christoph Reinhart. Used with permission.\n\nStatic Exterior Shading: SHADERADE\nSurround Shade\nTrimming away regions with negative value (cutoff = 0):\nCourtesy of Jon Sargent, Jeff Niemasz, and Christoph Reinhart. Used with permission.\n\nStatic Exterior Shading: SHADERADE\nSurround Shade\nIncreasing cutoff produces more 'efficient' shade.\nHere 90% of total value remains after 50% area\nreduction:\nCourtesy of Jon Sargent, Jeff Niemasz, and Christoph Reinhart. Used with permission.\n\nStatic Exterior Shading: SHADERADE\nHorizontal and surround shades\nLoad optimized, 85% value trim:\nAnchorage\nBoston\nPhoenix\n\nHorizontal and surround shades,\nCarbon optimized, 85% value trim:\nStatic Exterior Shading: SHADERADE\nAnchorage\nBoston\nPhoenix\n(COP of 1.67, 0.83 for cooling,\nheating; carbon equivalent\nfactors of 0.232, 0.758 kg/kWh\nfor gas , electricity)\n\nHow does Shaderade compare to conventional\nmethods?\n\nResults\nPaper: J Sargent, J Niemasz, C F Reinhart, \"SHADERADE: Combining Rhinoceros and EnergyPlus for the design of static exterior shading devices\", Building Simulation 2011, Sydney, November 2011.\nSHADERADE is consistently in the top range.\nCourtesy of Jon Sargent, Jeff Niemasz, and Christoph Reinhart. Used with permission.\n\nStatic vs. Dynamic Shading\nBuilding does not require/allow for user intervention.\nArchitectural perception of exterior movable shading devices is that they look\n'messy' (Lam), are complicated to maintain, subject to freezing rain (climate dependant).\nMovable shading devices (venetian blinds) offer a dynamic response to a dynamic signal.\nTrees and other vegetation can function as a compromise.\nDynamic shading devices are 'risky' because occupant responses are difficult to predict.\n\nGreat! Now, let's build that shading system.\n\nCeramic Futures\nSupported by ASCER - Tiles of Spain\nCollaboration with the GSD Digital Fabrication Lab (M Bechthold)\nGoal\nTo design and build a flexible, high performance static external shading system made out of ceramics.\nImpact\nEstablish a feedback mechanism between design analysis and digital fabrication.\nPhase 1 - Design of a high performance shading system in DIVA-for-Rhino\nPhase 2 - Building a prototype using the robotic arm with a\ncustom-made extruder controlled by Rhino\nPaper: M Bechthold, J King, A Kane, J Niemasz, and C F Reinhart, \"Integrated Environmental Design and Robotic Fabrication Workflow for Ceramic Shading Systems,\" Proceedings of the International\nSymposium on Algorithms and Computation (ISAAC 2010) in June, South Korea, 2011.\nImages by Martin Bechthold and Christoph Reinhart. Used with permission.\n\nHauer meets DIVA\nThesis Project 2011 by Azadeh Omidfar, GSD MDesS\nThesis Advisor: C F Reinhart\nLoad Analysis\nCasting Prototype\nResult\nIt is possible to design an ornamental building skin that\nappropriately controls the sun's incoming radiation,\nprovides comfortable interior daylighting levels, and\noffers a transparent view to the outside.\nPaper: A Omidfar, \"DIVA meets Hauer: Combining aesthetics and energy efficiency using parametric variations in Grasshopper, Daysim and EnergyPlus.\" Building\nSimulation 2011, Sydney, Australia.\nImages courtesy of Azadeh Omidfar. Used with permission.\n\nShady\n\nIntegrated Facade Design\n\nFramework for High-Performance Buildings\nVisual\nComfort\nDaylight\nAvailability\nEnergy\nOccupant Behavior\nControls\n\nIntegrated Daylighting/Thermal Analysis\nThe lowest form of integration is through the exchange of schedules for occupancy, electric lighting, and shading devices.\nMore advanced forms of co-simulation are for example facilitated through energy management system application (EMS) of EnergyPlus or LBNL's Building\nControls Virtual Test Bed.\n\nDashboard\nReference Office\nLocated in Boston\n\nLighting Controls\nSmall effect overall.\nSelect vacancy + dimming since it is required by ASHRAE 90.1 (2016).\n\nHeating Load\nReduce infiltration rate\nImprove wall insulation\nInterior blinds\nHeat Pump + PV\n\nHeating Load\nReduce infiltration rate\nImprove wall insulation\nInterior blinds\nHeat Pump + PV\n\nDashboard\nZero Net Variant\n\nWhat can we do for the occupants?\n\nDashboard\nSplit blinds\nEnhanced daylit area and view outside\nSmall impact of HAVC loads\n\nDashboard\nAerogel\nEnhanced view outside, but risk for glare\n\nDashboard\nElectrochromic\nUnobstructed view all year round\n.\n(c) Saint-Gobain. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSwitchable Glazings\n\nA case for switchable glazings\nSHGC\n0.5 W/m2K ~ R-10\nnanogel\n\nElectrochromic Glazing - Physical Principle\n\nStudy of Thermotropic Glazings\nPhotos courtesy of Helge Hartwig. Used with permission.\nProject: research project at the Technical University of Munich (1999)\nProject Manager: Helge Hartwig\n\nDashboard Summary\nQuick overview of the tradeoffs for different facade solutions.\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 15",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/7b3aca8cb1f3a8f93a98efb1da6faa93_MIT4_401F18_lec15.pdf",
      "content": "Christoph Reinhart\nLec 15 Ventilation\n4.401/4.464 Environmental\nTechnologies in Buildings\n\nThermal Module\nThermal Mass & Heat Flow\nInsulating Materials + Window Technologies\nShading + Integrated Facade Design\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\nSimulation Game\n√\n√\n√\n\nWeekly reading and tutorials\nDIVA GH 8: DIVA/Archsim Single Zone\nDIVA GH 10: Multi-Zone Thermal Modeling\nDIVA GH 11: Natural Ventilation\n\nVentilation\n\nWhy do we ventilate buildings?\nTo breathe\nTo maintain indoor environmental quality\nTo control temperature & relative humidity\n\nTerminology\nAccording to the ASHRAE Handbook of Fundamentals, Chapter 27:\n\"Air exchange of outdoor air with the air already in a building can be divided into\ntwo broad classifications: ventilation and infiltration.\nVentilation air is air used to provide acceptable indoor air quality. It may be\ncomposed of forced or natural ventilation, infiltration, suitably treated re-circulated\nair, transfer air, or an appropriate combination. It includes the intentional\nintroduction of air from the outside into a building and is further subdivided into\nnatural ventilation and forced ventilation.\nNatural ventilation is the flow of air through open windows, doors, grilles, and other\nplanned building envelope penetrations.\nForced ventilation is the intentional movement of air into and out of a building\nusing fans and intake and exhaust vents.\nInfiltration is the flow of outdoor air into a building through cracks and other\nunintentional openings. Infiltration is also known as 'air leakage' into a building.\"\n(c) ASHRAE. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nseehttps://ocw.mit.edu/help/faq-fair-use/.\n\nGeneral Comments\nInfiltration and ventilation have to be controlled to provide thermal\ncomfort and indoor air quality to building occupants.\nIndoor air quality issues relating to contaminants in the air (such as\nvolatile organic compounds) will be addressed in a later lecture.\nCommercial buildings in the US tend to be ventilated using forced air.\nThese buildings tend to be sealed (have no operable windows) and use\neconomizer cycles to cool the air if desired. There always has to be a\npercentage of outside air of at least 10%.\nWe will discuss different HVAC systems later this term.\n\nHow much fresh air do we need?\n\nVentilation/Infiltration Rates\nThe amount of infiltration in a building is usually expressed in terms of\nair exchanges per hour\n(ACH), the number of times all air within a\nbuilding is being exchanged with outside air over the course of an hour.\nHygienic\nfresh\nair\nrequirements\nper\nperson\nare\nexpressed\nin\n'feet3/minute person' or in 'liters/second person'. Typical fresh air supply\nrequirements are:\n15 ft3/minute person or 10 liter/second person\n\nBlower Door Tests\nAre used to determine air leakage of building envelopes. Results are\nexpressed in m3/m2h @ 50 Pa.\nThere is a difference between ACH50 and ACHnat. You want to reach\nan ACH50 <3.\nAn ACH50<1.5 means that your house requires mechanical ventilation.\nLeft: photo courtesy of Natural Spaces Domes. Used with permission.\nRight: (c) source unknown. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nInfiltration Values - Residential\nEnergy efficient houses have been found to have an average ACHnat of 0.5 h-1 (range\n0.02 h-1 to 1.63 h-1), compared to 0.9 h-1 for 'normal new construction houses'.\n\nVentilation Losses\nEnergy loads on a building due to infiltration and ventilation are\ndependent on the amount of air changes per hour:\nWhere:\nρ = Density of Air 1.2 kg/m3\nc = Specific Heat Capacity of Air (20°C) ~ 1000 J/kg K\nQinfiltration= (ACH x volume x c x ρ) x (Tinside-Toutside)\n\nHeat Balance Equation\nACH = Air change per hour\nVolume = Volume of air in conditioned space\n\nUS DOE Benchmark Small Office Building\nFloor area: 511.1 m2\nWall area:\n225.7 m2\nRoof area:\n511.1 m2\nWindow area:\n55.8 m2\nTMWith concrete floor = 19.1 kWh/K\nΣUAEnvelope = 11.6 kW\nVentilation Losses?\n0.19 kW/K\n\nVentilation Losses for DOE Small Office\nEnergy loads on a building due to infiltration and ventilation are\ndependent on the amount of air changes per hour:\nWhere:\nρ = Density of air 1.2 kg/m3\nc = Specific Heat Capacity of Air (20°C) ~ 1000 J/kg K\nFor the US DOE Small Office Building:\nAssuming an ACH of 0.36/h and a volume of 1559 m3\nQinfiltration= (ACH x volume x c x ρ) x (Tinside-Toutside)\nQinfiltration= (0.36/h x 1559 m3 x 1000 J/kgK x 1.2 kg/m3 x ∆T\n= 673,488680 J/hK x ∆T = 0.2 kW/K x ∆T\nThis is very low.\n\nResidential Weatherization Techniques\nReduce cracks in window and door frames etc.\nPublic domain photo by Staff Sergeant Courtney Richardson, courtesy of US Air Force.\n\nUS DOE Benchmark Small Office Building\nFloor area:\n511.1 m2\nWall area:\n225.7 m2\nRoof area:\n511.1 m2\nWindow area:\n55. 8 m2\nTMWith concrete floor = 19.1 kWh/K\nΣUAEnvelope = 11.6 kW\nACH x Vol x c x ρ = 0.2 kW\n\nDo we need additional ventilation?\nAssuming an ACH of 0.36/h, a volume of 1559 m3 and 27 occupants, the\nfresh air supply per person [pp] is:\nA 1000 liter of air = 1m3 of air\nThere is insufficient fresh air in the non-weatherized building to provide\nthe required hygienic ventilation to all occupants through infiltration\nwhen the windows are closed.\n1559 m3 x 0.36/h /27 pp= 20.1 m3/h pp\nFresh air per person = 20100 l/3600 s person ~ 6 l/s pp\n\nSizing an Air Handling Unit\nHow much fresh air does a forced air system need to supply?\n27 occupants need 20 x 10 l = 270 l/s = 0.27 m3/s.\nA 0.1 m2 duct typically delivers around 0.13 m3/s. This means that the building\nneeds around 0.2 m2 of supply ducts.\nA central, roof-mounted Air Handling Unit (AHU) requires roughly equally sized\nsupply and return ducts, i.e. 2 x 0.2 m2= 0.4 m2.\n\nNatural\nVentilation\n\nExcellent Reference\nCIBSE manual AM10: Natural Ventilation in Non-domestic Buildings\nISBN 978-1903287569\n\nWhy are we so excited about\nnatural ventilation?\n\nEnergy Used for Cooling and Ventilation\nin US Commercial Buildings\nSlide courtesy of Diego Ibarra. Used with permission.\n\nUnfortunately, it gets a little warm...\n\nSummer Design Week (July 7th to 13th)\nOf course, the reason why we do not simply discard our active cooling systems is that indoor\ntemperatures rise. The figure compares temperatures in the New England Home with and without\nactive cooling. In the no-cooling scenario the windows are permanently closed (no natural ventilation).\nAt what point are the interior temperatures too high to be comfortable?\n\nAcceptable Operative Temperature\nRanges for Naturally Conditioned Spaces\nGraph (c) ASHRAE. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\nBoston for\nJuly\nThe mean monthly temperature in Boston for the month of July is around 23o C. According\nto ASHRAE 55 this means that occupants are comfortable between 21o C and 28o C.\n\nCan we reduce the inside temperature by\nopening the window?\n\nSummer Design Week\nThe operative temperature for active cooling is just in the comfort range. The outdoor\ntemperature is mostly above the comfort range so natural ventilation will not help during those\nsituations.\nASHRAE 55 comfort range\n\nTypical Design Week\nAs a rule of thumb, we want the outside air at least 3 K below the maximum\ncomfortable indoor temperature. During the typical summer week this is mostly the case,\ni.e. there is potential for natural ventilation during that week.\nASHRAE 55 comfort range\n\nWhat is the required cooling load?\nAs will be established in Lecture 16, the mean hourly internal loads and\nsolar gains are 2008 W and 6140 W, respectively. Given a floor area of\n511 m2, the typical load that has to be cooled away is:\nAverage load = (2008 W + 6140 W)/511 m2 ~ 16 W/m2\n\nCooling From Natural Ventilation\nFor a required cooling load of 16 Wm-2 and a temperature difference between\ninside and outside air (3K) the required air exchange rate is ACH ~6.\nSource: Natural Ventilation in Non-Domestic Buildings (c) CIBSE. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPotential for Natural Ventilation\nThere is some wind (5 m/s) when outdoor temperatures are high.\n\nOutdoor Dry Bulb Air Temperature vs. ASHRAE\n55 Maximum Indoor Temperature\n\nOutdoor Dry Bulb Air Temperature vs. ASHRAE\n55 Maximum Indoor Temperature\n\nOutdoor Dry Bulb Air Temperature vs. ASHRAE\n55 Maximum Indoor Temperature\n\nDo we want the outside air?\n\nNatural Ventilation\nBased on the example it becomes apparent that we have to know the following:\nOccupant Behavior: When are occupants opening and closing their windows and\nby how much?\nAir Exchange Rate: What is the air exchange rate resulting from the occupants\nopening their windows? This air exchange rate depends on:\nIndoor Temperature\nOutdoor Temperature\nWindow Arrangement\nAmbient Wind pattern (direction and speed)\n\nOccupant Behavior - What do we know?\nOccupants open and close their windows consciously and consistently.\nThe goal of opening the windows is to\n*create a connection to the outside (pleasant sounds, smells) and to\n*improve indoor environmental conditions (flush out VOCs, induce some\nair movement, replace inside air with fresh outside air).\n\nFachhochschule Bonn-Rhein-Sieg\nCompleted 1999, HMP Architekten. (Public domain photo courtesy of Stefan Knauf on Wikipedia.)\nWhen the operable windows are opened the heating system shuts off.\n\nSyracuse Center of Excellence\nCompleted in 2010, Toshiko Mori Architect\nOccupants get a visual signal when opening windows is\nadequate due to benign outdoor conditions (low traffic).\n\nHow do we get air to move?\n\nAir Flow\nAir flow or air movement is usually expressed through a volume flow\nrate, q. Typical units used are cubic feet per minute (cfm) and liters per\nsecond (L/s). Sometimes, the ventilation rate is also expressed on a\nper person or per unit floor area basis, such as cfm/p or cfm/ft2.\nA\nv\nq = area * velocity\nNote: When designing a ventilation system, the ventilation rates are required to\ndetermine the sizes of fans, openings, and air ducts.\n\nWhat causes air flow?\nAir flow is caused by a pressure difference. Air will flow from a zone of\nhigh pressure to a zone of low pressure.\nP1 = P2\nno flow\nP1 > P2\nair flow\n\nAir Flow and Air Exchange Rate\nAir flow, q , and air exchange rates, ACH, are closely related. The\nrequired air exchange rate during the typical summer week is 5 ACH.\nThe volume of the house is 1559 m3 so\nRequired flow rate = 6 h-1 x 1559 m3 ~2.6 m3/s\n+\n\nDriving Forces for Airflow in Buildings\nSlide courtesy of Diego Ibarra. Used with permission.\n\nDriving Forces for Airflow in Buildings\nSlide courtesy of Diego Ibarra. Used with permission.\n\nDriving Forces for Airflow in Buildings\nSlide courtesy of Diego Ibarra. Used with permission.\n\nBuoyancy\n\nHydrostatic Pressure\n\nThink of a diver under water.\n\nSame as water, the weight of the atmosphere also exerts\npressure on objects at sea level.\nP = h x g x ρ + Pa hydrostatic pressure\nWhere:\ng\n= gravitational acceleration = 9.81 m/s2\nh\n= depth under water [m]\nρ\n= density of water kg/m3\nPa\n= Atmospheric Pressure\nwater surface\nh\nPhoto courtesy of Mario R on Flickr. License CC BY-NC-SA.\n\nAir Flow - Stack Effect (Chimney Effect)\nT1\nT2\nT2\nT2= T1\nWhat happens to the air in the cylinder?\n\nAir Flow - Stack Effect (Chimney Effect)\nT1\nT2\nh\nT2\nT2< T1\nWarm air has a lower density than colder air (more particle\nmovements => less particles per space).\n\nAir Flow - Stack Effect (Chimney Effect)\nT1\nT2\nT2\nT2< T1\nIn a cylinder with heated inside air the warmer/lighter inside air rises\nand the cooler/heavier air flow in through the bottom opening.\n\nAir Flow - Stack Effect (Chimney Effect)\nT1\nT2\nT2\nT2< T1\nNow think of the cylinder as a building. There will be one height at\nwhich there is no pressure difference between the outside and\nthe inside. This is called the neutral pressure level.\nDuring the winter the inside temperature is higher than the ambient temperature and the\nbase of the building is depressurized whereas the top is pressurized. During the summer\nthe relationship is reversed. As a consequence basements draw in cool air in the winter.\nDuring the summer moist air from the main living areas is pushed into the basement,\nwhich tends to be cooler than the rest of the house, which may in turn lead to\ncondensation. The consequence is that dehumidifiers are often needed in basements in\nair-conditioned buildings.\n\nStack Ventilation\nSlide courtesy of Diego Ibarra. Used with permission.\n\n∆T=50K\nh\n\nSuperheat the air in the solar chimney.\n\nIncrease the height difference between air intake and exhaust.\n\nMove the neutral pressure level up.\n\nAn effective stack is twice as tall as the tallest space it is ventilating.\n\nStack can be interior (atrium) or exterior (chimney).\nPrinciple of a Solar Chimney\nSource: Natural Ventilation in Non-Domestic Buildings. (c) CIBSE. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-\nfair-use/.\n\nBRE Environmental Building\nArchitecture: Feilden Clegg Bradley Studios\nImage deleted due to copyright restrictions.\n\nBRE Environmental Building\nArchitecture: Feilden Clegg Bradley Studios.\nImage courtesy of Feilden Clegg Bradley Studios. Used with permission.\n\nEvaporative Downdraft Cooling Tower\nVisitor Center, Zion National Park (environmental design by NREL)\nLeft: photo courtesy of J. Stephen Conn on Flickr. License: CC BY-NC.\nRight: public domain image courtesy of NREL..\n\nWind Catcher\n- Open the leeward side for updraft (works together with stack effect)\n- Open the windward side for downdraft (works against the stack effect)\n- Qanat (water reservoir) further cools and humidifies the air\nWind catcher in Dowlat-abad, Yazd, Iran\nWind Tower and Qanat\nPhoto courtesy of Matt Werner on Flickr. License:\nCC BY-NC-SA.\n\nCalculation Procedures\nThe previous slides have shown that following the air exchange rate is a key\ncomponent in defining the cooling load of a natural ventilation concept.\nThere are a series of different calculation procedures that can be used to estimate\nair exchange rates in naturally ventilated spaces:\nEnvelope flow models (semi-empirical models)\nComputational fluid dynamics (CFD)\nCombined thermal and ventilation models\nPhysical scale models\nIn the following slides, several envelope flow models are presented.\n\nAir Flow - Single sided, two vents,\nbuoyancy driven\nventilation rate\npressure difference\nThe concept only works if it is warmer inside than outside and if (in a\nside-vented space) the room depth is less than about 2.5 times the\nwindow head height. In a space with vents on both sides the depth\nmay be increased up to 5 times the window head height.\nq = volume flow rate [m3/s]\ng= gravitational constant = 9.81 m/s2\n∆T= difference between Tinside and Toutside\nA typical, empirical value for Cd is 0.6.\nACH= q x 3600/Volume\n\nAir Flow - Single sided, single vent,\nbuoyancy driven\nA typical value for Cd is 0.25 as air only enters through parts of the\nwindow. This is an empirical formula.\n\nq = 0.25 x 55.8 m2 x sqrt(3K *9.81 ms-2 x 1.5 m/297K)\n=5.4 m3s-1\nACH = 5.4 m3s-1 x 3600 s/h / 1559 m3\n= 12.5 h-1\nExample - DOE Benchmark Building\nAssuming\nToutside\n= 27o C\nTinside\n= 24o C\nAwindows = 2.4 m2\nCd\n= 0.25\n\nWind\n\nWind Driven Ventilation\nSlide courtesy of Diego Ibarra. Used with permission.\n\nWind Driven Ventilation- Case Studies\nThom Mayne - Federal Building - San Francisco\nPhoto courtesy of Stuart Hamilton on Flickr. License: CC BY-NC-SA.\n\nWind Driven Ventilation- Case Studies\nCarrilho da Graca G.; Linden P. F.; McConahey E.; Haves P. , 2003, \"DESIGN AND TESTING OF A CONTROL STRATEGY FOR A\nLARGE, NATURALLY VENTILATED OFFICE BUILDING,\" Building Simulation 2003, Eindhoven, The Netherlands, pp. 399-407\n\nAir Flow - Single sided, single vent,\nwind driven\nq = volume flow rate [m3/s]\nA = required window area [m2]\nU= wind speed [m/s]\nC = pressure coefficient ~0.025\n\nMean outside wind speed & direction\nThe wind is primarily coming from west and east.\n\nLocal Pressure Coefficients\nWind from west\nCEast = -0.3\nCNorth = -0.14\n∆C= 0.16\nWind from east\nCWest = 0.5\nCNorth = -0.3\n∆C= 0.8\n(c) ASHRAE. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nWind from West\nq = 0.16 x 1.2 m2 x 7ms-1\n= 1.3 m3s-1\nACH = 3.12 m3s-1 x 3600 s/h / 53 m3\n= 91 h-1\nWind from East\nq = 0.8 x 1.2 m2 x 7 ms-1\n= 6.7 m3s-1\nACH = 3.12 m3s-1 x 3600 s/h / 53 m3\n= 456 h-1\nExample - New England Home\nIf there is wind there is plenty of air exchange.\n\nSimulated Natural Ventilation Summer Design\nWeek\nASHRAE 55 comfort range\nNV cannot maintain thermal comfort during the summer design week since the\noutside air is too hot.\n\nWind vs. Stack Effect\n\nWind tends to be an order of magnitude larger than buoyancy.\n\nStack does not rely on wind and therefore can take place on still, hot summer days\nwhen it is most needed. Stack is a relatively stable air flow (compared to wind) and\noffers greater flexibility in choosing areas of air intake. It relies on temperature\ndifferences (inside/outside).\n\nStack may incur extra costs (ventilator stacks, taller spaces).\n\nBoth effects are difficult to predict in urban settings due to microclimatic effects.\n\nBarriers to the application of natural\nventilation\nDuring design\n\nBuilding and fire regulations\n\nNeed for acoustic protection\n\nDesigning a naturally ventilated building requires more work but can\nreduce mechanical system (design fee on a fixed percentage of system's\ncost)\n\nIncreased risk for design team (occupant behavior)\n\nDifficult to predict pattern of use\n\nDevices for shading, privacy & daylighting may hamper the free flow of air\n\nProblems with automatic controls in openings\nDuring operation\n\nOccupants not understanding the system\n\nSafety concerns\n\nNoise from outdoors\n\nDust and air pollution\n\nSolar shading covering the openings\n|\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 16",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/5b9e24cbf2abd05c5e06a263a85b61f9_MIT4_401F18_lec16.pdf",
      "content": "Christoph Reinhart\nL16 Internal Gains + Load Calculations\n4.401/4.464 Environmental Technologies in Buildings\n\nThermal Module\nThermal Mass & Heat Flow\nInsulating Materials + Window Technologies\nShading + Integrated Facade Design\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\nSimulation Game\n√\n√\n√\n√\n\nInternal Gains\n\nInternal Heat Gains\nInternal heat gains correspond to heat that is generated in buildings as part of their programmatic\nuse. Internal heat gains in buildings are typically divided into three groups:\nHeat from occupants\nHeat from electrical equipment and appliances\nHeat from electric lighting\nObviously, all three are (or should be) strongly correlated with building occupancy...\n\nInternal Heat Gain from Occupants\nSame as individuals' thermal comfort sensation varies, building occupants generate varying amounts of heat\nand moisture. Key factors that determine how much sensible and latent energy a person releases are activity,\nage, and gender.\nSensible heat gains from occupants raise the indoor temperature. Latent heat gains need to be considered if\nthe indoor air is actively dehumidified.\n'Occupancy load schedules' are determined through two factors: maximum occupancy heat gains and time of\nday schedules.\nMaximum occupancy heat gains = activity-related heat gain/person x occupancy density\n\nInternal Heat Gain from Occupants\nOur Classroom\nTogether, we each generate around 100 W of sensible heat. Maximum occupant density is 45 divided over 12 m x 12 m.\nThe resultant maximum occupancy heat gain is\n100 W/person x 45 person/144 m2 = 31 W/m2 = 0.31 person/m2\nExample Cottage\nAssume a 4-person household distributed over 125 m2 and so\n400 W/125 m2 = 3.2 W/m2 or 0.0326 person/m2\n\nSchedules\nThe maximum occupancy heat gain corresponds to heat gains when everybody is at their work place. Since occupants\ntemporarily leave their building, 'schedules' are used in energy simulation software in order to determine occupancy\nloads on different week days and for different times of the day.\nTime of Day [h]\nPartial Load\n\nEquipment and Appliances\nHeat gain due to a variety of equipment, including computers, coffee machines, hot water pipes etc.\nSun Wind and Light (Chapter 4) provides lower and upper margins for different building types:\nOffices : 8 to 17 W/m2 (Studio load typically around 26 W/m2)\nEducation: 14 to 23 W/m2\nResidential: 2 to 6 W/m2\n\nElectric Lighting\nCan vary dramatically for different lighting requirements, types of lighting systems and for different\ntypes of controls. Values range between 1 and 25 W/m2. LEDs are a game changer.\nDiscussion: Relevance of the installed electric lighting power density.\nDOE Small\nOffice Building\n\nUS DOE Small Office Building\nOccupants: 0.0538 p/m2 * 100 W= 5.38 W/m2 Mean daily gain 2.3 W/m2\nEquipment: Mean daily gain 6.7 W/m2\nLighting: Mean daily gain 5.1 W/m2\nTotal internal gains: Mean daily gain 14.1 W/m2\n\nThe Value of Building Surveys\nGund Hall: 150 kWh/m2yr (includes circulation areas etc. as well as pumps, fans,\nserver rooms, cafeteria etc.)\n(Based on data from Wasilowski & Reinhart, 2009)\n\nBuilding Surveys\nField Visits\nOnline Surveys\n\nThermostat Settings\n\nTo what temperatures do you set your\nthermostat in Winter/Summer?\n\nThermostat Setting\nAccording to ASHRAE 90.2, in residential buildings, heating set points and setbacks are\n20oC and 15.5oC, respectively.\n\nDifferent Thermostat Models\nManual\nProgrammable\nSelf-learning/wireless\nLeft photo courtesy of midnightcomm on Flickr. License: CC BY.\nCenter photo courtesy of joinpinnaclephotos on Flickr. License: CC BY-NC.\nRight photo courtesy of Green Energy Futures on Flickr. License: CC BY-NC-SA.\n\nCommon Misconceptions about Thermostats\nThermostat is an on/off switch\nThermostat is a dimmer switch\nThermostat is an accelerator\nTurning down the thermostat has little or no effect on energy consumption\nPaper: B. Urban, D. Elliott, and O. Sachs, \"Towards Better Modeling of Residential Thermostats,\" Conference Proceedings of SimBuild IBPSA-USA,\nMadison, WI, 2014.\n\nDefault Thermostat Setpoints and Setbacks\nFigure courtesy of Bryan Urban. Used with permission.\nPaper: B. Urban, D. Elliott, and O. Sachs, \"Towards Better Modeling of Residential Thermostats,\" Conference Proceedings of SimBuild\nIBPSA-USA, Madison, WI, 2014.\n\nActual energy use depends on how occupants operate\ntheir thermostats\nSimulated energy [MMBTU]\nPaper: B. Urban, D. Elliott, and O. Sachs, \"Towards Better Modeling of Residential Thermostats,\" Conference Proceedings of SimBuild\nIBPSA-USA, Madison, WI, 2014.\nFigure courtesy of Bryan Urban. Used with permission.\n\nHow relevant are heating and cooling set\npoints?\n\nHeat Balance Equation\nInternal gains are easy to model but hard to predict.\n\nFinal Heat Balance Equation\nThis is our final heat balance equation. Please note that a new term called \"Load\" has been added which needs to\nbalance the heat flows during each hour to keep the temperature in the house from changing to outside of the set\ncomfort range of 19oC to 27oC.\n\nMonthly Heat Gains\nMonthly heat flows are an effective way to show the relative size of ongoing and outgoing heat into a building. Heat\nflows are smallest during the transition period/shoulder months. Heating and cooling loads are required to balance\nthe remaining heat flows.\n\nMonthly Conditioning Loads\nNote that there are temporary cooling loads in the building even during winter. Again, those loads\ncould be met by simply opening the window. This effect will be covered in future lectures.\n\nLoad\nThe ideal load is the amount of heat that has to be added or subtracted from a space for it to\nmaintain the zone air temperature at a certain level.\nLoad is measured in kWh or BTU.\nNormalizing the load to the conditioned area helps to compare different spaces. (EUI equivalent.)\nThe load of a space does not correspond to its energy use which requires further conversion\ndepending on the HVAC equipment used.\n\nLoad Calculations\n\nLoad Calculation Procedures\nThere are two types of methods to calculate annual heating and cooling loads.\nManual methods are solving the heat balance equation for each hour\nindependently (steady state) and can be implemented, for example in Excel.\nNumeric methods also take transient thermal effect from thermal mass into\naccount. Example simulation programs are EnergyPlus, TRNSYS,\neQuest/DOE2 and ESP-r. In 4.401/4.464 we are using EnergyPlus through\nDIVA4/Archsim.\n(ΣUA + ACH x volume x c x ρ)·(Tinside-Toutside)+ G·A·SHGC + Q'internal gains=Loadheating/cooling+TM· (Tinside-Tinside future)\n\nBalance Point Temperature\nThe balance point temperature is a building and climate dependent temperature at which internal gains and solar\ngains are equal to conduction, ventilation and infiltration losses. In other words, all heat gains and heat losses\n'balance' each other and the building is in thermal equilibrium with its surrounding without the need for additional\nheating or cooling (Loadheating/cooling=0 ; Tinside=Tinside future).\n(ΣUA + ACH x volume x c x ρ)·(Tinside-Toutside)+ G·A·SHGC + Q'internal gains=Loadheating/cooling+TM· (Tinside-Tinside future)\nLoad =0; Tinside =Tinside future\n\nBalance Point Temperature\nTo calculate the different heat flows usually averaged over 24 hours to cancel out thermal mass effects.\nThe tighter and better insulated a building envelope is, the lower becomes the balance point temperature.\nHigh solar and internal gains lower the balance point.\nA low balance point is desirable during the heating season and may become a liability during the cooling\nseason.\nTBalance point = Tinside comfort range - (G·A·SHGC + Q'internal gains)/(ΣUA + ACH x volume x c x ρ)\n\nExample - DOE Small Office Building\nΣUAEnvelope = 11.6 kW/K\nACH x volume x c x ρ = 0.2 kW/K\nQInternal gains = 14.1 W/m2 x 511 m2 = 7.2 kW\nG·A·SHGC = 3.9 W/m2 x 511 m2 = 2.0 kW\nTBalance point = Tinside comfort range - (G·A·SHGC + Q'internal gains)/(ΣUA + ACH x volume x c x ρ)\nTBalance point = Tinside comfort range - 2kW + 7.2kW)/(11.6kW/K+0.2kW/K)\n= Tinside comfort range - 1.5K\n\nHeating Degree Days (HDD)\nThe number of heating degrees in a day is defined as the difference\nbetween a reference value of 65°F (18°C) and the average outside\ntemperature for that day.\nRule of thumb: If a site has\n>5000 oF HDD (~2800 oC HDD): long cold winters\n<2000 oF HDD (~1100 oC HDD): mild winters\nA fixed base temperature of 18°C allows us to compare different\nclimates. However, 18°C is not representative for all buildings. For\nthe New England Home the lower balance point level is 8°C.\n\nHeating and Cooling Degree Hours Boston\nFigure generated using the Climate File Analyzer (Excel spreadsheet) http://web.mit.edu/sustainabledesignlab/teaching_resources.html\nFor a base temperature of 18oC Boston has 76326 heating degree hours.\n\nHeating Load Calculation\nThe heating degree days with respect to the balance point of a building indicate how much energy is needed to\nkeep the buildings at the balance point over the course of a year.\nHeating load =HDDBalance point x (ΣUA + Qinfiltration)\nHeating loadFeb =76326 Kh x (11.6 kW/K + 0.2 kW/K)\n= 900,647 kWh\nHeating costsb = $.035/kWh x 900,647 kWh /0.9 ~ $35,000\nAssuming a heating efficiency of 90% and a gas price of $0.035/kWh, the annual heating costs are:\n\nCooling Degree Days (CDD)\nThe number of cooling degrees in a day is defined as the difference between a reference value of 65°F\n(20°C) and the average outside temperature for that day.\nRule of thumb: If a site has\n>1500 oF CDD (~800 oC CDD): long hot summers\n< 500 oF CDD (~ 300 oC CDD): mild summers\n\nEnergy Modeling\n\nEnergy Simulation\n\nEnergy Simulation\n\nWhat does one need for a BPS?\nElements needed for BPS are a building model, a simulation program (GUI & engine) and a suitable metric that is able\nto measure the performance in question.\nGUI/Engine\nModel\nMetrics\n\nMost building energy simulation programs come with a graphical user interface (GUI) as well\nas the actual simulation engine. The former is used to prepare simulation input files for the\nlatter and to display simulation results once a simulation is complete.\nWhile the choice of GUI determines the ease of use of a simulation program, it is ultimately\nthe engine that determines how reliable simulation results are.\nA great GUI with a weak engine cannot yield reliable results!\nSimulation Engine vs. GUI\n\nHistory of Energy Modeling Tools\nBLAST at US-DOD, DOE2 at US-DOE, TRNSYS at University of\nWisconsin and ESP at Strathclyde University\n2001: DOE2 and BLAST merged into EnergyPlus (E+)\nToday:\n- several interfaces for DOE2: eQuest, Green Building Studio\n- several interfaces for EnergyPlus: DesignBuilder, Open Studio\n- several commercial interfaces for TRYNSYS\n- IDA-ICE is gaining increased recognition in Europe\n- IES/VE uses proprietary APACHE engine\n- Spawn of EnergyPlus: Modellica, equation based simulation\nenvironments\n\nReasons for using E+: ASHRAE 140\nPurpose of the standard:\nAnalyzing and diagnosing building energy simulation software using software-to-software and\nsoftware-to-analytical-solution comparisons.\nChecking a program against a previous version of itself after internal code modifications such as an\nalgorithmic change.\n\nUncle Sam thinks so, too.\nTax Deduction Information\nUnder IRS rules, taxpayers' building energy use performance must be calculated using software that has been\ntested according to ANSI/ASHRAE Standard 140 to qualify for tax deductions.\n\nEnergyPlus continued...\nEnergyPlus is freely available for download. The program comes with ample documentations\nbut without a GUI. EnergyPlus's capabilities are constantly being further expanded so that\nmore recent modules might not be accessible through any GUI. As a result advanced users\noften start editing their models manually using a text editor. Once any manual changes have\nbeen made to a model one usually cannot go back to the GUI.\nExpert users can get access to the source code allowing for third-party validation which adds\nto the software's credibility and long term reliability.\n\nExample EnergyPlus Interfaces\nNew generation of design tools.\nRemaining question: How can designers effectively use them?\n- Diva for Rhino\n- DesignBuilder\n- Ladybug & Honeybee\n- Urban Modeling Interface\n\nHow accurate are design phase building\nenergy models?\n\nComparison of measured and simulated energy use for 97 LEED\nBuildings\nPaper\nH W Samuelson, A Lantz and C F Reinhart, \"Non-technical barriers to energy model sharing and reuse,\" Building and Environment, 54, pp. 71-76, 2012.\nModel uncertainty from weather, infiltration rate, usage schedule and occupant behavior.\nCourtesy of Elsevier, Inc., https://www.sciencedirect.com. Used with\npermission.\n\n\"Design\" Model vs. \"Calibrated\" Model\nDuring the design process of a building exact numbers for the big uglies are necessarily not available.\nEnergy models generated at that point are called design models.\nA design model can later be calibrated to the actual building based on measurements and surveys, at\nwhich point it becomes a calibrated model.\n\nThe 'Four Uglies'\nThe \"Four Uglies\" are the big unknowns in energy modeling: occupancy, plug-loads, weather, and infiltration. In\n2011 the Boston chapter of the International Building Performance Simulation Assocation (IBPSA) organized three\nevents related to the big uglies.\n\nBut models can be calibrated:\nPaper: H W Samuelson, A Ghorayshib & C F Reinhart, 2015, \"Analysis of a Simplified Building Energy Model Calibration Procedure for 18 Real-World Case\nStudies,\" Journal of Building Performance Simulation, published online January 2015.\nMeasured EUI (kWh/m2)\nPredicted EUI (kWh/m2)\nDesign-\nPhase\nModels\nFinal\nPartially-\nCalibrated\nModels\n# Building\nNumber\nFigure courtesy of H W Samuelson, A\nGhorayshib & C F Reinhart. Used with\npermission.\n\nSo the tools work, but...\n...you have to make sure that\nthe tool that you use has been validated, that\nyou know how to use it properly, and that\nyou are using meaningful performance metrics.\n\nShould designers learn how to conduct a\nenergy model?\n\n\"...to position architects as collaborative leaders at higher thresholds of building performance..\"\nJeff Potter, 2012 AIA president\nURL: http://content.aia.org/sites/default/files/2016-04/Energy-Modeling-Design-Process-Guide.pdf\n\"The energy model and focus on energy performance is not meant to supplant the importance of design. Rather, a building\nenergy model is a tool that can be utilized throughout the design process to test various design options and optimize the\nperformance of all building typologies.\"\n-AIA, \"An Architect's Guide to Integrating Energy Modeling in the Design Process\"\n\nSimulation Game\n\nIs Solar Design a Straitjacket for Architecture?\nPosed a design problem to two student groups only one of which (Group B) was trained to use the site specific solar design tools.\nThe models were evaluated based on their adherence to solar criteria and geometrical diversity.\nGroup B models showed a lower proportion of solar design deficiencies while demonstrating more geometrical creativity, suggesting\nthat the use of more precise solar design tools actually helps to broaden the range of architectural form.\nPaper: T Otis, \"Is Solar Design a Straitjacket for Architecture?\" Conference Proceedings of the 27th International conference on Passive and Low Energy Architecture (PLEA),\nLouvain-la-Neuve, Belgium, July 2011.\nImage courtesy of Tiffany Otis. Used with permission.\n\nHypothesis for the Simulation Game\nBBeeiingng abbllee t too re\n\nreadd ttheherm\nrmall s siimula\nulattiioonn reressuullttss andnd ttoo a addapptt oonene'ss d deessiiggnn accccoordrdiningglyly hahass bbeeccoomee ann\neesssseennttiaial sl skkill ill ffoor g\nr graradduauattiinngg andnd ppraraccttiicciinngg arcrchihitteeccttss.\nWhy?\nThe alternatives for architects are to effectively ignore simulation output or to have the modeler take over\nkey design aspects of the building. (Both alternatives are undesirable for architects.)\nNote:\nEngineers, this does not mean that the architects know how to do the simulations themselves.\n\nDesign analysis - Monthly system loads\nHow could you improve your design?\n\nDesign analysis - Monthly heat balances\nHow could you improve your design?\n\n2011, The Original Game ...\nPaper: C F Reinhart, T Dogan, D Ibarra, and H W Samuelson, \"Learning by playing - Teaching energy simulation\nas a game,\" Journal of Building Performance Simulation, October 2011.\n]\n\nSimulation Order Form\nProvided by Modeler\n(c) Harvard Graduate School of Design. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/ help/faq-fair-use/.\n\nFinal Designs\nFinal designs differed significantly, revealing that a performance-based design does not necessarily lead to\nconverging architectural solutions.\n\"Today building science was definitely not boring.\"\nThis image is from C F Reinhart, T Dogan, D Ibarra, and H W Samuelson, \"Learning by playing - Teaching energy simulation as a game,\"\nJournal of Building Performance Simulation, October 2011. https://doi.org/10.1080/19401493.2011.619668. This journal is available online at\nhttps://www.tandfonline.com/doi/abs/10.1080/19401493.2011.619668.\n\nWhere do we want to be?\nFrom evaluating performance to suggesting new forms\n\nEnergy Game 2014\nYou will be running the simulations yourselves in Rhino/Grasshopper/ArchSim.\nFull build-in cost analysis.\nPaper: C. F. Reinhart, J. Geisinger, T. Dogan, and E. Saratsis, \"LESSONS LEARNED FROM A SIMULATION-BASED APPROACH TO TEACHING BUILDING SCIENCE TO DESIGNERS,\"\nBuilding SImulation 2015, Hyderabad, India, Dec 2015.\nFigure courtesy of C. F. Reinhart, J., T. Dogan and E. Saratsis. Used with permission.\n\nEnergy Game 2014\nPaper: C. F. Reinhart, J. Geisinger, T. Dogan, and E. Saratsis, \"LESSONS LEARNED FROM A SIMULATION-BASED APPROACH TO TEACHING BUILDING SCIENCE TO DESIGNERS,\"\nBuilding SImulation 2015, Hyderabad, India, Dec 2015.\nFigure courtesy of C. F. Reinhart, J., T. Dogan and E. Saratsis. Used with permission.\n\nDynamic Shading in DIVA4/Archsim\n\nBalance Point for an Office\n\nQuestions?\nwww.daylight1-2-3.com\nwww.daysim.com\nSurround Shade\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 17",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/35b1bfdbe2b8d720f6aa5cde6caf3770_MIT4_401F18_lec17.pdf",
      "content": "Christoph Reinhart\nL17 HVAC systems for small buildings\n4.401/4.464 Environmental Technologies in Buildings\n\nThermal Module\nThermal Mass & Heat Flow\nInsulating Materials + Window Technologies\nShading + Integrated Facade Design\nVentilation\nInternal Gains & Load Calculations\nHVAC for Small Buildings\nHVAC for Large Buildings\n√\n√\n√\n√\n√\n√\n\nCourse Project Workflow\nProvide a project narrative; analyze the climate; set your project targets\nGeneral: Generate a Rhino model that uses the daylighting layers for representation and daylighting analysis as\nwell as a set of separate zone layers for energy.\nFor energy set up a simple simulation model in DIVA4 (with surrounding context) and determine orientation,\nWWRs and suitable upgrades levels (lighting, insulation and shading)\nTo add PV using the DIVA/ArchSim PV module.\nShow space layouts in plan on a separate layer.\n\nHVAC Systems\n\nGeneral Considerations\nSo far we have concentrated on quantifying and optimizing energy loads in buildings for heating,\nlighting, cooling, and internal gains using basic building design and passive systems concepts.\nNow we are looking at the mechanical heating & cooling systems that are required to meet these\nloads.\n\nGeneral Considerations\nInternal gains and lighting loads are nearly always met with electricity in which case thermal loads and\nenergy use are identical.\nMechanical heating and cooling systems have a maximum capacity, i.e. a maximum output at any\nparticular point in time.\nIf heating or cooling loads are temporarily higher than the system capacity the building 'under-heats'\n(should not happen) or overheats (may happen once in a while).\nIf a system is always running significantly under its maximum capacity it always runs at part load and\naccordingly has been oversized which might result in unnecessarily high initial investment costs and\nnon-optimized system part loads.\n\nGeneral Considerations\nIs your building envelope or internal load dominated? You need cooling in the latter case.\nThe closer you work with your HVAC engineer and the better you are able to predict the temporal load curve of\nyour building, the more informed will be your choice when designing your HVAC system.\nVariables to consider include:\no\nthermal behavior of your building (thermal mass, solar gains, occupancy patterns)\no\npeak loads\no\npart load curves for your equipment\no\nsize of system units\no\nreturn air/water temperature\n\nPotential Conflict\n\nThe compensation of the HVAC engineer is usually linked to the cost of the purchased equipment.\n\nASHRAE sizing methods do not consider solar gains for heating capacity.\nThis image is from Anca D. Galasiu & Christoph F. Reinhart, \"Current daylighting design practice: a survey,\" Building Research &\nInformation, 36:2, 159-174. This journal is available online at https://www.tandfonline.com/doi/abs/10.1080/09613210701549748.\n\nIntegrated Project Delivery\n\"Integrated Project Delivery (IPD) is a project delivery approach that integrates people, systems, business\nstructures and practices into a process that collaboratively harnesses the talents and insights of all\nparticipants to optimize project results, increase value to the owner, reduce waste, and maximize efficiency\nthrough all phases of design, fabrication, and construction. IPD principles can be applied to a variety of\ncontractual arrangements and IPD teams can include members well beyond the basic triad of owner,\narchitect, and contractor. In all cases, integrated projects are uniquely distinguished by highly effective\ncollaboration among the owner, the prime designer, and the prime constructor, commencing at early design\nand continuing through to project handover.\"\n--American Institute of Architects, 2007\nNote: IPD in building design is linked to the concept of a Building Information Model (BIM).\n\nMacLeamy Curve\n(c) AIA. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHeating\n\nWhat was the first heating\nsystem?\nPhoto courtesy of Rebecca Dominguez on Flickr. License: CC BY-NC-SA.\n\nHeating with Wood\nBasic Physics: Controlled combustion of a medium and delivery of heat to a space through a combination of heat\ntransfer mechanisms\nUses heated room air\nfor combustion\nOpen Fire\nImproved Indoor Air Quality\nChimney (efficiency ~ 10%)\nUses heated room air\nfor combustion\nPhoto courtesy of Rebecca Dominguez on Flickr. License: CC BY-NC-SA.\n\nHeating with Wood\nRetrofitted Fireplace\nDedicated Air\nIntake\nAir Exhaust\nClosed Combustion Chamber\nLeft: photo courtesy of Rebecca Dominguez on Flickr. License: CC BY-NC-SA.\nRight: photo courtesy of Earthworm on Flickr. License: CC BY-NC-SA.\n\nHeating with Wood\nLeft: photo courtesy of I G on Flickr. License: CC BY.\nRight: image (c) Ceramics Today. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCentral Heating\nSeparating the combustion process from the space.\nRequires a distribution system.\nConvection: Movement of Air\nor Water\nCentral Heating System\nHydronic Radiators: Radiation & Convection\nForced Air: Convection\nPhoto courtesy of Rebecca Dominguez on Flickr. License: CC BY-NC-SA.\n\nHeating Systems\nA heating system consists of three components.\nHeating System\nDistribution System\nSource Energy\nSolar\nWood\nOil\nGas\nBiomass\nElectricity\nFurnace\nSolar collector\nBaseboard heater\nHeat pump\nAir\nWater\nElectricity\n\nPros and Cons of Various Heating Distribution\nSystems\nSystem\nAdvantage\nDisadvantage\nAir\n-\nVentilation, cooling and humidity control\n-\nSpace requirements\nWater\n-\nLimited space requirements\n-\nRadiant heating and cooling\n-\nNo ventilation\n-\nNo humidity control\nElectricity\n-\nSpace requirements\n-\nFlexibility; easy to control, cheap to install\n-\nNo ventilation\n-\nNo humidity control\n-\nHigh operation costs\n\nTo consider: pipe expansion, air vents and water drains, pipe insulation\nExamples of hydronic heating distribution systems\nImage from Stein, Reynolds, Grondzik and Kwok (2006) (c) John Wiley & Sons. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\nPerimeter loop\nOne pipe\nTwo pipe reverse return\n\nRadiant Panels\nA radiant floor has a larger heat exchange surface than a conventional radiator and may hence operate at a lower\ntemperature.\nRadiant floor\nRadiant ceiling\nLeft: public domain photo courtesy of Rpvdk on Wikipedia.\nRight: photo courtesy of Oregon Department of Transportation on Flickr. License: CC BY.\n\nCondensing\nAs opposed to a regular furnace, a high-efficiency or condensing furnace extracts so much heat from the exhaust gases that\nwater vapor in the exhaust condenses. Such furnaces must be designed to avoid the corrosion that this highly acidic condensate might\ncause.\nNo chimney is required.\nTypical price premium for a high-efficiency furnace is $1000. Assuming a $200 utility rebate, $100 federal incentives, 15%\nefficiency gain, the payback time lies around 3.5 years or less.\nVariable-speed DC motor fans reduce noise and save electricity.\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCondensing Furnace\nImages: (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHeating with Pellets\nIdeally a byproduct of sawmilling, very dense, low humidity content (<10%)\nDue to regular shape and consistent burning efficiency suitable for automatic feeding.\nBoth room furnaces and central heating.\nRequires local provider and distribution system.\nC02 content depends on the harvesting process of the underlying biomass.\nWood pellets\nPellet stove\nTanker delivering pellets\nLeft: public domain photo courtesy of Tom Bruton on Wikipedia.\nCenter: public domain photo courtesy of USDA.\nRight: (c) Pellergy. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPellet Stove Diagram\n(c) Alliance for Green Heat. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/.\n\nUS Market Penetration (2014)\nImage courtesy of FutureMetrics. Used with permission.\nStates with the highest penetration of wood pellets lack a natural gas infrastructure.\n\nEconomics (ballpark)\nImage courtesy of FutureMetrics. Used with permission.\n\nInternational Pellet Markets\nImage courtesy of FutureMetrics. Used with permission.\n\nHeating with Electricity\nResistance heater: 1 kWh electric equals 1 kWh thermal\nHeat pump: 1 kWh electric yields > 1 kWh thermal\nElectric baseboard heater\nAir Source Heat Pump\nLeft: photo courtesy of Home Spot HQ on Flickr. License: CC BY.\nRight: photo courtesy of Green Energy Futures on Flickr. License: CC BY-NC-SA.\n\nHeat Pumps\nHeat Source\nHeat Sink\nA heat pump is a mechanical heating and cooling system driven by electricity. It is based on a compressive\nrefrigeration system that can run 'both ways'. Compressive refrigeration relies on liquefaction and evaporation\nof a refrigerant.\nTsource < T Sink\n\nHeat Pumps\nA heat pump is a mechanical heating and cooling system driven by electricity. It is based on a compressive\nrefrigeration system that can run 'both ways'. Compressive refrigeration relies on liquefaction and evaporation\nof a refrigerant.\nHeat Source\nHeat Sink\nEvaporator\nCondenser\n\nHeat Pumps\nHeat In\nHeat Out\nPublic domain image courtesy of Internet Archive.\n\nRefrigerator\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCan you cool a room with an open fridge?\nImage courtesy of Ross Berteig on Flickr. License: CC BY.\n\nTypical Through-The-Wall AC Unit\nImage courtesy of Pbroks13 on Wikipedia. License: CC BY.\n\nRefrigerants\nUp until the mid-1990s chlorofluorocarbon (CFC) gases were used\nwhich are strong greenhouse gases.\nIn the mid-1990s CFCs were banned and replaced with\nhydrochlorofluorocarbons (HCFCs).\nIn 2010s HCFCs are being replaced with hydrofluorocarbons (HFC)\n\nHeat Pumps\nHeat pumps typically draw heat from the ambient air or the ground making them either air source or ground source heat pumps.\nHeat pumps can be reversed into a cooling device. In fact, ground source heat pumps should be used for both heating and cooling as the\nground temperature otherwise keeps on rising or falling with time.\nMini split (air to air heat pump) systems are becoming increasingly popular in the US and abroad.\n\nGround Temperatures\nThe temperature of undisturbed ground oscillates around the annual mean air temperature.\nImage courtesy of Natural Resources Canada. Used with permission.\n\nTypes of Earth Connection\nPlastic tubing usually used for outside heat exchanger.\nImage courtesy of Natural\nResources Canada. Used\nwith permission.\nImage courtesy of Natural Resources Canada. Used with permission.\n\nHorizontal Ground Source Heat Pump\nInstallation depth about 1.5 m.\nPublic domain image courtesy of Marktj at Wikipedia.\n\nHeat Pump Example\nGround source heat pumps should be used for both heating and cooling as the ground temperature otherwise keeps on rising or\nfalling with time.\nBlackstone Building (architecture: Bruner Cott)\n\nLamparter Building\nWeilheim, Germany\nGround Source Heat Exchanger\n\nGround Source Heat Exchanger\nPreconditions incoming air in summer and winter.\nMoisture control can be an issue. Underground air ducts should\ntherefore be accessible for cleaning.\nPhoto courtesy of Fraunhofer ISE. Used with permission.\n\nEnvironmental Concept\n\nHeat Pump - General Considerations\nHistorically, utilities tend to promote heat pumps since they tend to run under capacity in the winter.\nNowadays heat pumps are promoted as the goal is to reach an all electric energy supply system. As the electric\ngrid is getting decarbonized, heat pumps are again considered to be a viable, energy-saving technology.\nHeat pumps work well with radiant heating systems as they provide low temperature energy.\n\nGeothermal\nContractors and developers frequently refer to ground source heat pumps as \"geothermal.\"\nGeothermal is the direct use of a high temperature heat stored in the earth. One has to go deep. The geothermal\ngradient of temperatures through the crust is 25-30°C per kilometer.\nSonoma Power Plant\nLeft: public domain image courtesy of US Department of Energy.\nRight: public domain image courtesy of Stepheng3 at Wikipedia.\n\nSimulation Game Choices\nGSPH for Heating and Cooling\nBoiler Heating DX/AC\nBaseboard Heating,\nDX/AC\n\nCooling\n\nWho grew up in a house without\nair-conditioning?\n\nWillis Carrier (1876-1950)\n1902 in Buffalo, NY, inventor of air conditioning\nAir conditioning performs four functions:\n1.) control temperature\n2.) control humidity\n3.) control air circulation and ventilation\n4.) cleanse the air.\nPublic domain image courtesy of\nCarrier Corporation on Wikipedia.\n\nAccording to Carrier Corp., \"The world started to become aware of air conditioned theaters when Carrier brought a\ncentrifugal chiller to the Rivoli Theater in New York's Times Square in 1925.\"\nPhoto courtesy of Joseph at Cinema Treasures. License: CC BY.\n\nCooling - General Considerations\nIn 1950 air conditioning was still considered a luxury. Now it is being viewed as a necessity and even a safety\nissue (e.g. in cars).\nType A office space is air conditioned by definition.\nLoad considerations and the afternoon peak. Highest demand in the summer (even in the Northeast).\n\nCooling Systems\nThere are two main types of mechanical cooling systems:\nCompressive Refrigeration relies on liquefaction and evaporation of a refrigerant.\nIn absorption refrigeration the refrigerant is distilled water and the absorber is lithium bromide (salt\nsolution).\n\nInteraction between HVAC Equipment and the\nBuilding\nChiller\nAir Handler\nTerminal Boxes\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nCooling tower\n\nAir Handling Unit\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nAir Handling Unit\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nSchematic Relationship HVAC System & Building\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCooling Towers & Condenser Water Systems\nCooling towers reject waste heat from the condenser of a chiller to the environment.\nCondenser water systems include chillers, cooling towers, and the associated equipment required to\ncirculate water from the chiller condensers to the cooling towers.\nLeft photo (c) Bradley Tran. Right image (c) source unknown. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCentrifugal Chiller\n(c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nBoilers & Hot Water Systems\nBoilers are used to generate hot water or steam that can be used for heating, domestic hot water\nand humidification.\nHot water systems take the hot water or steam that is produced by the boilers and distribute it\nthrough pipes to various devices, which can include AHUs, ATUs, FCUs, humidifiers, and sterilizers.\nText (c) Bradley Tran, image (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/.\n\nAir Terminal Boxes\nAir terminal boxes (ATUs) receive air from an AHU and control airflow and sometimes\ntemperature of the supply air into a specific room or zone to maintain the desired space\ntemperature.\nText (c) Bradley Tran, image (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nThis looks like a lot of space...\n(c) Bradley Tran. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHow much space are we talking\nabout?\n\nExample Calculations\nOffice building in Boston run via the simulation game.\nHourly peak loads for each floor file are around 18 kW for heating and 26 kW for cooling.\nHow big do the resulting ducts have to be assuming an \"all-air\" system to condition the space and provide fresh air supply for all\noccupants?\nHeating Peak\nCooling Peak\n18 kW\n26 kW\n18 kW\n26 kW\n18 kW\n26 kW\n18 kW\n26 kW\n\nFresh Air Supply\nEach floor has an occupant density of 0.2 persons per m2. With a total floor area on each story of 20 m x 20\nm = 400 m2 this results in 80 occupants per floor.\nEach occupant requires 10 l/s and so we need 800 l/s = 0.8 m3/s floor each floor.\nA 0.1 m2 duct typically deliver around 0.13 m3/s. This means that each floor needs around six 0.1 m2 supply\nducts or 0.6 m2.\nFor a central, roof mounted AHU the main supply duct needs to have a minimum size of 4 floor x 0.6 m2/floor\n= 2.4 m2\n.\nAssuming a similarly sized return duct, the duct size requirements for fresh air supply at 2 x 2.4 m2 = 4.8 m2\n\nCondition Requirements\nThe set point temperatures for heating and cooling are 20oC and 26oC, respectively. The maximum and\nminimum supply air temperatures are 32oC and 13oC to ensure occupant comport.\nThis means that under peak conditions:\nPeak Load = (V'x c x r) x (Tsupply-Tspace)\nwhere:\nV' = required volume flow [m3/s]\nρ= Density of Air 1.2 kg/m3\nc = Specific Heat Capacity of Air (20Deg C) ~ 1000 J/kg K\nHeating\n18 kW = (V' x 1200 J/m3K x (32o C - 20oC)\nV' = 1.3 m3/s\nRequired supply duct size per floor = 1.3 m3/s / 0.13 m3/s\n= 10 ducts with size of 0.1 m2= 1 m2\nCooling\n-26 kW = (V' x 1200 J/m3K x (13oC - 26oC)\nV' = 1.7 m3/s\nRequired supply duct size per floor = 1.7 m3/s / 0.13 m3/s\n= 13 ducts with size of 0.1 m2= 1.3 m2\n\nDuct Size\nThe size of the air supply system is dictated by the required cooling air supply of 1.3 m3 per floor. The\ntotal main duct space required for supply and return air is thus:\nMain duct size = 4 x 2 x 1.3 m2 = 10.4 m2\n\nSimple HVAC Design\nPlenum\nUsable space\nAHU\nPlenum\nUsable space\nPlenum\nUsable space\nPlenum\nUsable space\n\nMIT Campus - Looking up\nImagery (c) Google. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nCooling Tower\nIn larger buildings a secondary loop consisting of water is used to cool the evaporator coil. The water is\ntransported from the cooling unit to the roof of the building and then cooled by evaporation.\n(c) Bradley Tran. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nAbsorption Refrigeration Cycle\nThermally driven cooling system where heat is used to regenerate the salt solution.\nLess efficient than compressive refrigeration but can already work at low thermal heat (60o C), i.e. high grade energy\n(electricity) used to run a compressor is replaced with low grade energy (heat).\nThe heat to concentrate the salt solution can come from natural gas (direct fired) or waste heat (indirect fired) or even the\nsun.\nImage from Stein, Reynolds, Grondzik and Kwok (2006) (c) John Wiley & Sons. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nEvaporative Condensers\nWater is sprayed on the condenser to make heat transfer more efficient.\nUsed in mid-sized commercial buildings where the condensing coil can be less than 60 feet (20 m) from the\ncompressor and evaporator coil.\n\nQuestions?\nSurround Shade\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "4.401 Lecture 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/da40a5bcd7dc66f465a48ee6f3c1e1b4_MIT4_401F18_lec2.pdf",
      "content": "Christoph Reinhart\nL02 Energy Use in Buildings\nMassachusetts Institute of Technology\nDepartment of Architecture\nBuilding Technology Program\n4.401/4.464 Environmental Technologies in\nBuildings\nUS CO2 emission by sector\n\nEnvironmental Technologies\n\nWhy comfortable?\n\n.\nIf you watched Alpha you may agree that nobody was ever comfortable in today's sense during the ice age.\nWhy comfortable?\n(c) Columbia TriStar Marketing Group, Inc. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPublic domain image courtesy of Jose-Manuel Benito on Wikipedia\nFirst Shelters\nProtect from wind and rain and trap the heat.\n\nRoman Domus\nCentral heating, warm water, adequate rain protection.\nLife was getting better, if you could afford it.\nPhoto by Mary Harrsch on Flickr. License: CC BY-NC-SA.\n\nPhoto by Dunnock_D on Flickr. License CC BY-NC.\nMedieval Living\nYou need a lot of wood to keep that space somewhat comfortable during winter.\n\n18th Century Colonial Housing\n(c) Daniel Gale Sotheby's. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nBuilding adapts to local climate. Deciduous trees on the south side for shading, small rooms to\nkeep warm during winter.\n\nFull Climate Control\nWe can now separate building interiors from ambient climatic conditions. This photo could have been taken\nanywhere in the US and elsewhere.\nPhoto by Lynn Betts, USDA Natural Resources Conservation Service. This image is in the public domain.\n\nWhy resource-efficient?\n\nWhy Resource-Efficiency?\n- Population Growth--see Thomas Malthus's An Essay on the Principle of Population (1798)\n- Environmental Damage--see Rachel Carson's Silent Spring (1962)\n- Limited Resources--see Meadows et al.'s Limits to Growth (1972)\n\nRemaining Oil\nImage courtesy of Scott Nazelrod at Wikipedia.\nLicense: CC BY.\n~0.2 ZJ per year (32 billion barrels)\n40 yrs\n55 yrs\n55 yrs\nWe are looking at 100 to 150 years of supply if demand stays stable.\n\nClimate Change Milestones\n1992 IPCC Report\nGlobal mean surface air temperature has increased by 0.3 to 0.6o C over the last 100 years.... The size of this warming is ... the same\nmagnitude as natural climate variability. Thus the observed increase could be largely due to this natural variability; alternatively this\nvariability and other human factors could have offset a still larger human-induced greenhouse warming.\n2007 IPCC Report\nWarming of the climate system is unequivocal. Most of the observed increase in global average temperatures since the mid-20th century is\nvery likely due to the observed increase in anthropogenic greenhouse gas concentrations.\n2014 IPCC Report\nGlobal warming is here, human-caused, and probably already dangerous -- and it's increasingly likely that the heating trend could be\nirreversible, a draft of a new international science report says.\n2016 Paris Agreement (UNFCCC)\n195 countries agreed to seek to limit global temperature increases in the 21st century to below 2 Degrees Celsius.\n\nThis class is directly contributing to goals 7, 11, and 13.\n(c) UN Foundation. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nEnergy Use in Buildings\n\nWhat is Energy?\nThe ability to do work.\nOne cannot see energy.\nEnergy manifests itself in different forms: Kinetic, thermal, gravitational, sound energy, light energy, elastic,\nelectromagnetic, chemical, nuclear, and mass.\n\nEnergy Units for Electricity Use\n1 joule [J]: energy as work\n1 kilowatt hour = kWh\nwith 1 watt = 1 J /s\n= 1000 x J/s x 3600s = 3.600.000 J\nCell phone:\nBattery size = 2900 mAh at ~3.8 V\n= 2.9 Ah x 3.8 V\n= 0. 011 kWh\nAnnual energy use = 0.011 kWh x 365 d/1yr\n= 4 kWh/yr\nEnergy-Efficient Refrigerator:\nAnnual energy use = 150 kWh/yr\nA fridge constitutes one of the main energy uses in a living unit.\nHowever, electronic equipment adds up quickly. A heavily used laptop uses 150 kWh/yr. A\ndesktop may use 600 kWh/yr.\n\nGas boiler:\nMaximum heating output = 62 kBTU/h\n= 18.1 kW\nAnnual energy use for a small single family home in\nBoston ~ 1000 Therm\n~ 29 000 kWh (gas)\nEnergy Units for Heating/Cooling\n1 British Thermal Unit (BTU) = imperial unit, energy needed to cool or heat\none pound of water by one degree Fahrenheit = 1 kBTU = 0. 293 Wh\n1 Therm = 100 000 BTU\nWindow-mounted air conditioner:\nMaximum cooling output = 8 kBTU\n= 2.3 kW\nMaximum electricity use = 724 W\nAt 5 hours per day for 90 days per year annual\nelectricity use comes to\n~ 325 kWh/yr\nAssuming that you have three AC window units in your\nhouse, you end up using\n~ 1 000 kWh (electricity)\nThe average US household uses 10 000 kWh of electricity per year.\n\nEnergy Units for Heating/Cooling\nRule of thumb: The size of a heating and cooling unit depends on the size of the space to be cooled and very\nroughly corresponds to the following:\nHeating unit capacity (mild climate) = 30 BTU x floor area in feet\nHeating unit capacity (cold climate) = 60 BTU x floor area in feet\nCooling unit capacity\n= 20 BTU x floor area in feet\n\nEnergy Conversion\nPrimary energy is energy that has not been subjected to any conversion or transformation process. Primary\nenergy is energy contained in raw fuels and any other forms of energy received by a system as input to the system.\nSecondary energy is energy being converted into more convenient forms of energy, such as electrical energy\nand cleaner fuels.\nEnd Energy is the energy delivered to a site to carry out work such as heating a house, running a fan, or lighting\na room.\nPrimary\nEnergy\nSecondary\nEnergy\nEnd\nEnergy\nConversion\nLosses\nTransportation &\nConversion Losses\n\n10 000 kWh electricity = 7.6 ton CO2e\n29 000 kWh natural gas = 6.7 ton CO2e\nGas and electricity use have comparable environmental impact.\n(c) ASHRAE. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/.\n\nIs a widely used performance metric to describe the energy performance of a building. It is defined as the annual\nsite energy use of a building divided by its floor area. It is expressed in kWh/m2yr or kBTU/ft2yr with 1 kWh/m2yr =\n317 BTU/ft2yr\nWhen applied to a building that uses electricity and gas, adding energy use for gas and electricity is\nliterally mixing \"apples and oranges.\"\nBy normalizing energy use by building size, the goal is to compare the energy performance of different\nbuildings. This works best for buildings of comparable size, with similar programs and in related climates.\nEUI is a measure of how efficiently a space is thermally conditioned (heated and cooled) and lit. It is not a\nmeasure of the efficiency of the building program. In fact, having a spatially inefficient program with\noccupants and equipment spread over a larger area can reduce the EUI of a building.\nEnergy Use Intensity (EUI)\n\nFloor Area of US Residential Buildings\nThis image is in the public domain. Source: https://homes.lbl.gov/sites/all/files/lbnl-55011.pdf\n\nEnergy Use per Capita\nThis image is in the public domain. Source: https://homes.lbl.gov/sites/all/files/lbnl-55011.pdf\n\nBuilding Energy Use by Age\nSource: J Sokol, C Cerezo and C F Reinhart, \"Validation of a Bayesian-Based Method for Defining Archetypes in Urban Building Energy Models,\" Energy and Buildings, 134, pp. 11-24, 2017 . (c) Elsevier B.V. All rights\nreserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nGas\nElectricity\n\nFor day-to-day decisions owners favor costs and/or maintenance costs per floor area to analyze\nbuildings.\nTo overcome some of the limitations of EUI, annual energy use for a space can be normalized by person\nhours used. This metric interprets a building as a service provider for comfortable space conditions\n(adequate temperature and lighting).\nThe drawback of this metric is that it largely lies out of the control of the architect how a building is being\nused. Is a building design \"bad\" because occupants behave inefficiently?\nOn the other side, is a high EUI for an office building that is being used 24/7 an indication of poor\nperformance?\nBeyond Energy Use Intensity\n\n2837 kWh/yr\nAssignment 1: Your Past Energy Use\n2837 kWh/yr / 150 m2 ~ 18.9 kWh/m2 yr\n2837 kWh/ yr / 4 person ~ 709 kWh/person year\n(c) source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nBuildings Performance Database\nSource: http://energy.gov/eere/buildings/building-performance-database. This image is in the public domain.\nOut of 13,362 single detached US homes\n19 kWh/m2yr = 6.3 kBTU/ft2yr\n1 kBTU/ft2yr ~ 3 kWh/m2yr\n\nHandy Online Energy Converter\nSource: http://www.onlineconversion.com/energy.htm. (c) Robert Fogt. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/..\n\nHow does building energy use fit in the\noverall US energy infrastructure?\n\nElectricity Use: 1/3 Industrial, 1/3 Residential, 1/3 Commercial\nEnd Energy Use: 1/3 Transportation, 1/3 Industrial, 1/3 Buildings\nUS Energy Flows 2017\nSource: https://flowcharts.llnl.gov/content/assets/images/energy/us/Energy_US_2017.png. This image is in the public domain.\n1 quad = 293 billion kWh\n\nUS CO2 emission by sector\n\nDecarbonization of the Electric Grid\nGraph based on data from http://www.eia.gov/state/?sid=MA.\n4%\n6%\n5%\n3%\n3%\n3%\n13%\n14%\n16%\n37%\n22%\n0%\n28%\n28%\n6%\n15%\n27%\n69%\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n100%\nNatural Gas\nCoal\nPetroleum\nNuclear\nHydroelectric\nOther Renewable\nMassachusetts Historical Electricity Generation by Source (%) (1990-2012)\n\nHow do we compare to the rest of the world?\n\nWorld Energy Use and Population\n7.6 x 109 People (2015)\nusing\n1014 kWh (2013)\n13000 kWh/person\n(10% of average American)\nPublic domain image courtesy of NASA Goddard Space Flight Center.\n\nWhere does our energy come from?\n(c) Vaclav Smil. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nHigh Performance Buildings\n\nThese are related but different terms to characterize the environmental performance of a building. When\ndeveloping an environmental concept for a building, the design team should early on agree upon what type of\nbuilding they aim to design.\no Sustainable: most comprehensive as it addresses societal, economic, and environmental concerns.\no Green: includes operational energy use, embodied energy use, on site resource management, and\noccupancy well-being\no Net zero energy: concentrates on balanced use and generation of energy (differences exist as to\nwhether energy has to be generated on-site or off-site and whether the cost for energy or primary\nenergy should be considered. Embodied energy of the building structure is sometimes considered as\nwell.)\nTerminology\nSustainable - Green - Net Zero\n\n'Green' Building Design\nThe 'green' building market has become a mass movement (Greenbuild ~30,000 visitors,\nLight+Building 180,000 visitors).\nGreenbuild 2011\n\nLEED - A Market Transformation Tool\nLEED is a green building rating system.\nLEED stands for Leadership in Energy and Environmental Design.\nLEED operates at the building levels and addresses: Sustainable Sites, Water Efficiency, Energy &\nAtmosphere, Materials and Resources, and Indoor Environmental Quality.\nAs of fall 2016, ~150,000 buildings were LEED registered and certified (106,000 homes, 33,500\ncommercial projects).\nLEED ratings come in Certified, Silver, Gold and Platinum.\n(c) Source unknown. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/..\n\nEnergy Performance of LEED Buildings\nNew Buildings Institute (NBI) Study (2008)\nFor all LEED buildings the median measured EUI was 24% below the CBECS national\naverage [for 2003].\nGraph based on data from www.gbci.org.\nNote: 552 LEED-NC buildings were certified in 2006\n\nEnergy Star Target Finder\nA useful first step is to\nestablish a meaningful baseline\nfor energy use.\nThe Energy Star Target Finder\nis based on the US Energy\nInformation Administration's\nCommercial Building Energy\nConsumption Survey (CBECS).\nCBECS 2003: ~5000 commercial\nbuildings across the US\nhttp://www.energystar.gov/buildings/service-\nproviders/design/step-step-process/evaluate-\ntarget/epa%E2%80%99s-target-finder-calculator\nThis image is in the public domain.\n\nPerformance of LEED Buildings\nLEED buildings have on average a 30% lower EUI (Energy Use Intensity).\nA third of LEED buildings had a higher EUI than their matched CBEC counterpart.\nGraph based on LEED-NBI data, CBECS matching by Newsham et al, 2009\n\nEnergy Performance of LEED Buildings\nDO LEED buildings save energy? Not Really ...\nPaper: J H Scofield, \"Do LEED-certified buildings save energy? Not really...,\" Energy and Buildings, Volume 41, Issue 12, December 2009, Pages 1386-1390\nReduce the analysis to the 35 office buildings only because this is the\nmost common building type for LEED-NC.\n\nEnergy Performance of LEED Buildings\nDO LEED buildings save energy? Not Really ...\nPaper: J H Scofield, \"Do LEED-certified buildings save energy? Not really...\" Energy and Buildings, Volume 41, Issue 12, December 2009, Pages 1386-1390\nMultiply EUI with floor area for each building.\nResult: \"35 LEED office buildings and Newsham's matching CBECS office\nbuildings are statistically equivalent.\"\n\nEnergy Performance of LEED Buildings\nDO LEED buildings save energy? Not really ...\nNotice significance of two large buildings (700000 ft2 and 400000 ft2).\nAre smaller LEED office buildings generally more energy-efficient than larger buildings? (Argument on the 'over-use'\nof PV in smaller buildings.)\nPaper: J H Scofield, \"Do LEED-certified buildings save energy? Not really...\" Energy and Buildings, Volume 41, Issue 12, December 2009, Pages 1386-1390\n\nTrend for LEED-NC and LEED-EBOM\nOwners are learning that commissioning is key.\nGraph based on USGBC data.\n\nEnvironmental satisfaction with lighting and acoustics in LEED buildings the same as in conventional\nbuildings. Main complaint: \"not enough daylight.\"\nIn 2009, out of over 1200 buildings that were certified under LEED, 43% and 66% were awarded the\ndaylighting and view credits, respectively.\nGraph based on data from S. Abbaszadeh et al., 2006.\nEnvironmental Satisfaction in LEED Buildings (2006)\n\nEnvironmental Satisfaction in LEED Buildings (2013)\nOccupants of LEED certified buildings are equally satisfied with the building overall and with the workspace as occupants of non-\nLEED buildings are.\nOccupants of LEED buildings tend to be slightly more satisfied with the air quality and workspace cleanliness and less satisfied\nwith the amount of light, visual privacy and amount of space than occupants of non-LEED buildings.\nS. Altomonte, S. Schiavon, 2013, \"Occupant\nsatisfaction in LEED and non-LEED certified\nbuildings,\" Building and Environment 68, pp. 66-\n76. Courtesy of Elsevier, Inc.,\nhttps://www.sciencedirect.com. Used with\npermission.\n\nThis is important because ...\nSource: https://rmi.org/wp-content/uploads/2017/04/Pathways-to-Zero_Bldg-Case-for-Deep-Retrofits_Report_2012.pdf. (c) Rocky mountain Institute.\nAll rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nFinancial Performance of LEED & Energy Star\nBuildings\n\"We find that buildings with a 'green rating' command rental rates that are roughly 3 percent higher per square foot\nthan otherwise identical buildings - controlling for the quality and the specific location of office buildings. Ceteris\nparibus, premiums in effective rents are even higher - above 6 percent. Selling prices of green buildings are higher by\nabout 16 percent.\nOur analysis establishes that variations in the premium for green office buildings are systematically related to their\nenergy-saving characteristics. For example, calculations show that a one dollar saving in energy costs from increased\nthermal efficiency yields roughly 18 dollars in the increased valuation of an Energy-Star certified building.\"\nEichholtz, Kok, Quigley 2009\nhttp://www.ucei.berkeley.edu/PDF/csemwp192.pdf\n\nConstruction Costs for High Performance\nGerman Buildings\nCosts for German reference buildings in 2000\nPaper: Reinhart C F, Voss K, Wagner A, Lohnert G, \"Lean buildings: Energy-efficient commercial buildings in Germany.\" Proceedings of the ACE32000 Summer Study on Energy Efficiency in Buildings 3 pp.\n3.287-3.298, Pacific Grove, USA, August 2000.\n\nSelected Examples\n\nSolar Architecture (1978)\nTwo-story sunspace, thermal mass, Trombe wall, active air circulation system for thermal comfort, 83% solar heated.\nBalcomb Residence, Santa Fe, NM (around 1978) Photo from Lechner, Heating, Cooling, Lighting (c) John Wiley & Sons. All rights reserved. This\ncontent is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/..\n\nSelf-Sufficient Solar House Freiburg\nSouth-exposed half cylinder\nAir-to-ground heat exchanger\nVentilation-heat-recovery\nSolar hot water\nPhotovoltaics 4.2 kWpeak\nTransparent insulating panels\nFuel cells and hydrogen tanks\nMixed reactions in the architectural community:\nthe building of the future ... a building in the emergency room\nSelf-sufficient solar house Freiburg, 1991\nArchitecture: Planerwerkstatt Holken & Berghoff\n\nLean Building ('Schlankes Gebaude')\nUsing the electric grid for energy storage.\nFinding the 'sweet spot'.\nReinhart, Voss, Wagner 2000)\n\nSelected Solar Home (2007)\n\"Made in Germany.\" Triple glazing, thermal mass through PCM, exterior wooden shutters, PV on the roof, integrated lighting system,\nclear architectural forms\nSolar Decathlon Winner 2007 (Team Germany)\nLeft: public domain image courtesy of Dirk Davidson on Flickr.\nRight: (c) source unknown. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPassive House\nPhoto: Mark Peterson/Redux Pictures. (c) Politico Magazine. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\nReduced heating demand 15 kWh/m2 per year\nTight building envelope (blower door n50 < 0.6 hr-1).\nEnergy-efficient appliances and domestic hot water heating (total primary energy use for\nheating, hot water and electricity less than 120 kWh/m2 per year.\n\nZero Net Energy Buildings\n\nThis is a Zero Net Energy Building\n(c) Tonatiuh Ambrosetti. All rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/..\n\nWhat does that mean?\n\nZero Net Energy Building Definition\nNet Zero Site Energy: produces as much as\nit uses\nNet Zero Source Energy: produces as much as\nit uses at sources\nNet Zero Energy Costs: aims for an annual\nenergy bill of $0\nNet Zero Energy Emission: aims for carbon\nneutral\nDefinitions based on NREL. Figures (c) Atelier Ten. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/.\n\nNet ZEBs in the world\nhttp://batchgeo.com/map/net-zero-energy-buildings\nhttp://batchgeo.com/map/net-zero-energy-buildings. (c) Eike Musall. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see https://ocw.mit.edu/help/faq-fair-use/..\nDatabase maintained until 2013\n\nExamples\nAldo Leopold Legacy Center, Fairfield, WI\nTruro Residence, MA\nHome for Life, Denmark\nEnergy Flex House, Denmark\nTop left: (c) Danish Technological Institute. Top right: (c) AART Architects. Bottom left: (c) Zero Energy Design. Bottom right: (c) The Kubala Washatko Architects.\nAll rights reserved. This content is excluded from our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nPlus Energy Houses\nSlide courtesy of Karsten Voss. Used with permission.\n\nLarger Examples\nrte\nSlide cou sy of Karsten Voss. Used with permission.\n\nHighest Net ZEB in the world?\nSlide courtesy of Karsten Voss. Used with permission.\n\nA vision for future cities\nSlide courtesy of Karsten Voss. Used with permission.\n\nCase Study Gund Hall\n\nCase Study - Gund Hall\nCollect weather data\nMeasure Energy Use\nPredicted versus measured energy use\nSurvey occupant behavior\nBuild an energy model\nPaper: Wasilowski H A, Reinhart C F, \"Modeling an existing building using customized weather data and internal load schedules as opposed to default assumptions - A Case Study,\" Proceedings of\nBuilding Simulation 2009, Glasgow, July 2009\n\nEnergy Use of Gund Hall:\nMeasurement vs. Simulation\n\nMonthly Energy Use for Cooling\nCooling use in winter?\n???\n\nHistoric Cooling Data for Gund Hall\n???\n\nMonthly Energy Use for Cooling\nChilled water flow meter was replaced in March 2009.\n\nMIT Campus Study\n\nScope and Carbon Emissions\nGreenhouse gas emissions from sources that are\nowned or controlled by Institute\nGreenhouse gas emissions from sources not owned or\ndirectly controlled by the Institute but related to Institute\nactivities\nScope 1:\nScope 2:\nGreenhouse gas emissions resulting from the\ngeneration of electricity, heat, or steam\npurchased by the Institute\nScope 3:\nPublic domain image courtesy of US EPA.\n\nPaper: S Nagpal, J T Hanson, K Spencer, N Bhatia, C F Reinhart, \"Auto-Calibrated Urban Building Energy Models as Continuous Commissioning and Planning Tools,\" submitted to Applied Energy\nMIT Live Campus Model\nhttps://web.mit.edu/CampusEnergyModel/www/\n\nQuestions?\nwww.daysim.com\nSurround Shade\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "4.401 Final Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-401-environmental-technologies-in-buildings-fall-2018/400472d8d9edfcec734dfbf1bfa7a583_MIT4_401f18_course_project.pdf",
      "content": "4.401/4.464 Environmental Technologies in Buildings - Course Project\nInstructor:\nChristoph Reinhart\nDue Date:\nPresentation on Friday of week 13 (4.401) and week 16\n(4.464)\nType:\nThis is a group assignment.\nProject Description\nAs announced in the course syllabus, the final course deliverable is the presentation\nof an environmental design concept for the 3500m2 innovation/startup space that you\nhave been working on since assignment 5. The final presentation should last for 12\nminutes plus 3 minutes for Q&A and draw from the material that you have generated\nduring previous assignments. You may want to add some additional work to create a\ncoherent project narrative. Below you will find a suggested sample structure for your\npresentation.\nTable 1: Suggested Presentation Format\nContent\n# of slides\nIntroduce yourselves and your design philosophy. Show one or more\nprecedents. What is your EUI target?\nContext\nDiscuss your site using Google Maps, a Rhino massing model of\nsurrounding buildings and a shading study. Describe how you intend to\nwork with your local climate. Be specific. If you show any graphs or figures\nthey should directly relate to your site and design.\n1-2\nLighting and Daylighting\n-\nWalk us through your original three daylit massing models and what\nsolution you ended up choosing.\n-\nPresent any visual comfort analysis and describe any resulting shading\nsystems, if applicable.\n-\nShow your electric lighting solution with an overview plan of all of the\nluminaires for your project.\n1-2\n1-2\n1-2\n\n-\nShow inside and outside perspectives of your final design as well as a\nsample floor plan. How adaptive is your concept?\n1-2\nEnvironmental Concept\n-\nDescribe your thermal envelope using select sections.\n-\nExplain your energy concept. How does the building function? What\nare the main environmental features such as added insulation, lighting\ncontrols, shading, PV and HAVC systems?\n-\nDiscuss operational energy use versus thermal comfort considerations\nin your building. Present simulated annual energy use and compare it\nto your earlier defined target.\n1-2\n1-2\n1-2\nConcluding Thoughts\n1-2\nTable 2: Items to remember\nFigures\n-\nAll plans and perspectives should have a North arrow.\n-\nAll figures need correct units and legends (cd/m2 and lux are not the same; kWh\nor kWh/m2; kWh or BTU).\nEnergy\nFor all energy simulations make sure that you understand whether you are\ncalculating site or source EUI. Explain where your target levels come from.\nGlare\nFor DGP simulations make sure that the view position is representative of where\npeople usually are. It can be helpful to show a plan with the view point and direction\non it.\nTable 3: Evaluation criteria\nPresentation\nPrecedents and context\nDaylighting analysis (complete and correct)\n\nThermal analysis (complete and correct)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n4.401/4.464 Environmental Technologies in Buildings Fall 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}