{
  "course_name": "Environmental Justice",
  "course_description": "This class explores the foundations of the environmental justice movement, current and emerging issues, and the application of environmental justice analysis to environmental policy and planning. It examines claims made by diverse groups along with the policy and civil society responses that address perceived inequity and injustice. While focused mainly on the United States, international issues and perspectives are also considered.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Environmental Policy",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Environmental Policy",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis course explores the foundations of the environmental justice movement, current and emerging issues, and the application of Environmental Justice (EJ) analysis to environmental policy and planning. During the semester, we will examine the claims made by groups and the policy and civil society responses that have been used to address perceived inequity and injustice. While most of the course will focus on the United States, some attention will be given to international issues and perspectives. This course requires active participation in discussions and critical assessments of the implications of environmental in/justice from both theoretical and practical standpoints.\n\nGrading Criteria and Assignments\n\nClass Participation: This course requires your full participation in each session. Most weeks everyone will read the same articles. However, some weeks you will select an additional article or two to read and summarize for the class. You should be prepared to provide summaries of the readings, ask questions, provide constructive feedback, assist classmates locate resources, and generate and share critical perspectives.\n\nReaction Papers: You are required to write brief (no more than one-page) reaction papers on the readings each week. These papers should include a statement of what you believe are the most important aspects of the readings as well as your reactions, critiques, disagreements, and / or questions. Reaction papers will not be graded, but they will be counted toward your final grade.\n\nTerm Project: Your project should focus on a topic related to environmental justice that is of personal interest. For instance, you can study the EJ campaigns of one or more environmental organizations, volunteer to work on an EJ related activity, analyze the distribution of sitings in a given locale, or do primary or secondary research on any topic related to EJ. Students who prefer to write two short papers or to submit their paper in installments are welcome to pursue these options. There are four requirements and deadlines related to the project:\n\nMeet with the professor at least once during the semester to discuss your topic and plans for the term project, paper, and presentation.\n\nWrite a one paragraph summary of your topic.\n\nComplete your final paper (details of the paper will be discussed) by Lecture 11.\n\nPresent your project to the class. Two class sessions are dedicated to this purpose.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n20%\n\nReaction Papers\n\n30%\n\nTerm Project\n\n50%",
  "files": [
    {
      "category": "Resource",
      "title": "dm1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/08660d2144215937be9b2a402f9119e5_dm1.pdf",
      "content": "11.368 2004\nReaction Paper 1\nDEFINING ENVIRONMENTAL JUSTICE\nThe notion of 'environmental justice' rests on the equitable distribution of environmental\nrisks and known hazards among all segments of the American population. But, in a society with\nvast disparities in wealth, political clout, and education, defining a 'just' distribution has not\nnecessarily been synonymous with an 'even' distribution of associated health and economic\nrepercussions related to siting of hazardous materials and processes. The papers we read this\nweek largely asserted the right of all Americans to a clean and healthy living and working\nenvironment, and documented the systematic and unbalanced burden placed on historically\nunderprivileged communities (typically poor, rural, minority groups). The statistics and case\nstudies presented paint a disturbing picture at a local scale, but bring up some larger chicken-\nand-egg questions for me about the chronology of property devaluation, job creation (or loss),\nand neighborhood racial compositions. It seems like it would be logical to tabulate changes in\nracial and economic compositions of communities at various stages both before and after the\narrival of a LULU, but the authors seemed to favor biased (on both sides) presentations of data\nwith the intent to convince. Maybe the data doesn't actually exist, but it would be nice to know\nall the information that is available.\nIn many ways it seems like pitching environmental (in-)justice issues as racially motivated\ndiscrimination undermines the more fundamental need to place the burden of responsible\nhazards management (both curtailing production and effectively mediating waste) on those who\nprofit from it--the producers and the users. The poor and working class suffer\ndisproportionately because their economic livelihoods are tied to these environmentally harmful\nindustries. The can't afford to refuse work, they can't afford to relocate their families away\nfrom hazardous areas, and, because of these confused interests they often don't agitate\neffectively to resist the arrival of hazardous facilities. This is not to discount the gravity of\nracial discrimination, but to refocus the issue at what seems to be its driving economic cause.\nIdeally, where should hazardous sites be located? Does it make more sense for landfill to\nbe located in the middle of the urban center that produces the waste or in an outlying\ncommunity that may or may not be willing to take the risk? I think there should be a cost\nassessed for safe disposal of all waste produced industrially, but even this is laden with\nproblems. It seems that there is always a community willing to make an environmentally\nunsound decision in hopes of economic benefit. As we read, the economic benefits usually do\nnot materialize. Job creation is generally not significant and draws upon a wider region than the\nimmediately surrounding area that bears the brunt of adverse economic and health effects from\nenvironmental degradation (property devaluation, sickness) associated with hazardous sites.\nSome questions:\nShould hazards be concentrated geographically or literally evenly distributed? (Yucca\nMountain etc)\nWho decides if distribution of burden is equitable? The government? Local community\nthat may want a hazardous site? Based on population? Can burdened communities be\nadequately compensated somehow?\nRace--easier to define than socioeconomic status? What are the statistics and their\ncauses. Are systematic trends important, or individual cases on inequity?"
    },
    {
      "category": "Resource",
      "title": "kwg1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/b0db596f298cd794c10ea47e626e772e_kwg1.pdf",
      "content": "11.368 - Reaction Paper 1\nLuke Cole's article, \"Empowerment as the Key to Environmental Protection,\" called into\nquestion the paradigm behind many of the large environmental protection laws. I thought\nhis claim that environmental laws are poorly suited to provide environmental justice\nbecause they focus on a 'bad actor' was intriguing. Even though I have taken 17.32,\n(Environmental Politics and Policy), I have never considered that environmental laws\ncould aim to protect individuals from the 'normal operations' of polluters. I believe that\nrevising the current laws to guard vulnerable populations against 'normal operations'\npollution would go a long way in rectifying environmental injustice. Additionally, I\nbelieve that such a strategy could procure large environmental benefits for society as a\nwhole. Targeting the 'normal operations' of known polluters would likely generate stricter\nenvironmental laws in general.\nI believe that such a strategy would be effective because of the inherent problems\nassociated with siting environmentally hazardous industries. As Cole and Sheila Foster\nhighlight in \"From the Ground Up,\" the characteristics used to site environmental hazards\n(\"cheap land, appropriate zoning, low population densities, proximity to transportation,\nand the absence of hospitals and school\") are race neutral if considered in a vacuum.\nUnfortunately, they are closely correlated to race and income within our society. If such\ncriteria cannot be used to site environmental hazards, what can? It seems that no matter\nhow hard we strive to equally distribute environmental hazards, some people are always\ngoing to suffer more than others. Considered from a utilitarian stance of procuring the\ngreatest good from the greatest number of people, some siting decisions are much more\n\nlogical than others. Given a lack of better criteria with which chose where to site\nenvironmentally risky industries, it may be best to mitigate the health effects of those\ntoxic industries. Targeting the normal operations of many companies is a perfect way to\naccomplish this. While it may not be popular, it may prove more popular, and more\neconomically feasible, than placing a landfill in the middle of Beverly Hills.\nI'd like to discuss what type of paradigm the government uses when choosing where to\nsite toxic facilities. For example, does the government explicitly use a \"greatest good\nfrom the greatest number,\" or does it subscribe to some other logic? I would also like to\ndiscuss whether there are any siting criteria which are not correlated with race and class.\nIf not, is there any way to fairly employ such criteria?"
    },
    {
      "category": "Resource",
      "title": "lkc1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/56df2cc55705c0a3bf1243518c4569ac_lkc1.pdf",
      "content": "11.386 Response 1\nThese readings introduce some of the basic principles of environmental justice (EJ), begin to\nexplain origins of environmental inequity, and use case studies to examine the nuances of these\ninequities. Bullard uses the southern U.S. as an EJ case study because of its historic and ongoing\nstructural disenfranchisement of African Americans. Citing low taxes, cheap labor, and lenient\nenvironmental regulations, the South lured a number of industries; but the economic benefits and\nthe quality of life costs of those facilities are not evenly shared amongst races and classes. Bullard\ndescribes a cyclical process wherein firms chose to locate noxious facilities in low income minority\nareas that pose little political resistance to those facilities, which in turn leads to a depressing of\nproperty values and a further marginalized community. Moreover, throughout the 1960s and 70s,\nenvironmental concerns were not at the fore of many minorities' efforts, as they devoted their\nenergies to other civil rights issues including housing and education. Bullard counters this by\noffering examples of prior rallies against environmental injustices, closing with a call for further\nactions by the growing movement. I found the regional context of this piece useful for\nunderstanding EJ issues beyond a site-specific scale, though I would have appreciated a more\nsystematic analysis of the patterns of environmental inequity in the region. I was left feeling that\nthe excerpt straddled genres of popular history, political piece, and understated social research.\nThis can, however, be useful as an introductory text to the discipline, as the many citations to this\npiece might indicate.\nI found the most useful portions of the Commission on Civil Rights report to be the sections\ntowards the end in which they described specific federal programs and executive orders with real\nramifications for the EJ movement. I did not find the anecdotal references to injustices in various\nmunicipalities to be very compelling or necessary, though I am not certain of the intended audience\nof this document. However, I would argue that many of the criticisms I have heard leveraged\nagainst EJ lie in the literature's inability to demonstrate causality of EJ effects. As such, I believe\nthat advocacy or informational documents are less well served by tossing around various municipal\nexamples, as they are in investigating the historic and legal frameworks that have led to\nenvironmental injustice. The description of Executive Order12,898 as well as Brownfields and\nSuperfund programs pointed to real need for research (on multiple risk exposure) and advocacy (on\nimplementation of existing programs).\nPrimed by my prior interest in seeing more discussion of the pathways by which environmental\ninjustice comes about, I found the Rechtschaffen and Gauna reading to be the most enlightening of\nthe three. Rabin's notion of expulsive zoning and Collin's description of nonscientific siting\npractices were particularly instructive. However, they are countered by Blais, who claims that\nLULUs are accompanied by the benefit of lower rents, revealing rational market preferences of\nthose who choose to live near these sites. Been bolsters this claim by noting that much of the prior\nEJ analysis fails to establish that communities with LULUs were not comprised of residents who\n\"came to the nuisance\" through residential dynamics. It seems that the causality issue is still up for\ndebate. Adding political and psychological considerations to these economic and land use\ndiscussions, one sees where much of the strength of the EJ movement must lie. Political\ndisenfranchisement of minorities is still pervasive, while the psychology of racism remains a\npersistent and challenging force in our \"liberal\" society. How these political and psychological\nforces play out over space should be an ongoing charge of researchers interested in EJ; addressing\nthose forces is the charge of EJ organizers and community members nationwide."
    },
    {
      "category": "Resource",
      "title": "kwg2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/81107a1f40ac23efe478d1fec6d052c6_kwg2.pdf",
      "content": "11.368 - Reaction Paper 2\nI have read the \"Principles of Environmental Justice\" before, but there two points that\nstood out this time. Specifically, I think that the document is hopelessly unrealistic when\nit calls for the \"cessation of the production of all toxins, [and] hazardous wastes...\" While\na noble goal, our modern lifestyles can never be sustained without some pollution. A\nmore realistic goal would be to aggressively limit pollution and properly dispose of\nwhatever cannot be eliminated. Strangely, the \"Principles\" fail to mention proper disposal\nof pollutants and toxins. The closest the \"Principles\" come is to call for \"protection from\n... disposal of toxic/hazardous wastes.\" Protection from the disposal of hazardous\nmaterials is significantly different from the proper disposal of them. To be more realistic,\none should add another clause to the \"Principles\" stating, \"Environmental Justice\ndemands the equal distribution of the burdens associated with modern industry, and that\nno person or groups should be disproportionally affected by pollution or other toxic\nmaterials.\"\nAdditionally, I feel that Point 10 of the \"Principles,\" which states that environmental\ninjustice violates the UN Convention on Genocide, is too extreme. I agree that\nenvironmental injustice may violate international law and the Universal Declaration of\nHuman Rights. I believe that comparing environmental injustice to genocide trivializes\nactual cases of genocide. On the other hand, I do not know exactly what the framers of\nthe \"Principles\" had in mind when they were writing Point 10. It would be interesting to\nknow if the framers were referring to a specific injustice which they believed equated to\ngenocide. Finally, I would like to know how the \"Principles\" came to be as spiritual in\n\nnature as they are. I was also slightly confused by the Cole and Foster article, \"From the\nGround Up.\" The authors name the anti-toxics movement as one of the most significant\nfactors behind the greater EJ movement. They proceed to state the the \"traditional\nenvironmental law community\" was not focused on EJ until relatively recently. I do not\nunderstand how the anti-toxins movement is different from the traditional environmental\ncommunity. Until I read the Cole and Foster piece, I had never heard of the anti-toxins\nmovement. I was under the impression that public outcry over toxic chemicals and\npollution in general was both the impetus for and result of laws like the Clean Air Act\nand the Clean Water Act. I associate these, and other watershed pieces of environmental\nlegislation, with the traditional environmental movement. In short, I'd like to understand\nthe difference between the anti-toxics movement and the traditional environmentalists."
    },
    {
      "category": "Resource",
      "title": "lkc2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/4f8929eca5ef7f98f342c751ed558ad1_lkc2.pdf",
      "content": "11.368 Response Paper 2\nThe three readings this week trace the development of the environmental justice (EJ) movement at\nthe national and local scales, highlighting the separate and sometimes conflicting goals of the\nmainstream environmental movement and the emerging EJ movement. Traditional\nenvironmentalist aims have been advanced often at the national level through costly litigation and\nby large membership organizations like Sierra Club and Audubon that lobby and promote policy\nchange via centralized networks of power. In contrast, EJ arose simultaneously in a number of\ndifferent localities, in response to a variety of environmental threats, often through grassroots,\ncommunity-led organizing. The Cole and Foster piece offers a useful overview of the contributing\nparadigms and focus areas that shape this hybrid movement, as well as identifying (in common with\nGottlieb) a few key events that catalyzed the movement and brought it into the broader public\nawareness. Both texts refer to the Warren County anti-dump actions, Cesar Chavez's United Farm\nWorker organizing, and the 1991 First National People of Color Environmental Leadership Summit\nas seminal moments (among others) in the creation of an EJ consciousness. It is also clear from all\nthree texts that the EJ movement was and is shaped by the research and writings of Robert Bullard,\nand I am curious as to why that is so. My main question is: with such diverse inputs, where will EJ\ngo from here? The principles of the 1991 Summit can serve as an inspiration point and a vision\ndocument, but it is also necessary to investigate the strengths and areas of potential greatest impact\nfor this concept.\nI am less interested in the notion of EJ as extending the NIMBY-capacity to disenfranchised\ncommunities that previously could not access the means to fight off noxious facilities, and am more\ninterested in a sort of reframing of the understanding of the environment. Although Checker's piece\nindeed discusses fighting an incinerator, she touches on this reframing as a means for more\ninclusive coalition-building. She notes that activists are \"expanding the meaning of the\nenvironment to include a host of urban resources\" and that \"the built environment historically\ndivided activists into competitive groups that were considered mutually exclusive. The intangible\nenvironment, however, in its unhealthy state, provided an initial basis upon which activists could\nfind a common ground.\" (Checker: 136, 144) The more that the environment can be understood as\na determinant of quality of life, with vital interaction effects to other concerns of poverty and crime,\nthe more relevant I believe it can be made to communities of all sorts. My own experiences in\nurban forestry demonstrated that the environment--in being either a threat or a resource, but\nultimately something that is shared and ethereal--can serve as a useful organizing tool. We cannot\nrisk losing the complexity or depth of differing issues, but I believe investigation into this capacity\nof the environment is worthwhile. Instead of considering the environment as something that is \"out\nthere\" in Yellowstone, accessible and relevant only to the wealthy, environmental justice can bring\nan understanding of natural resources back to the places in which we live. I would argue that much\nof the strength of EJ lies in its place-based, community-led, and often urban approach. The core EJ\nidea of self-determination is also powerful, in that we as citizens have a right to determine the\ntexture of our physical environments. This concept can allow us to think of broader natural\nresource issues and socioeconomic structures, along with concerns related to siting noxious\nfacilities. I mean not to eclipse or ignore the efforts of communities of color to advocate on their\nown behalf; however I recognize that if EJ plays out solely as a series of costly and often\nunsuccessful legal battles or organizing actions, some of its exciting potential may be lost."
    },
    {
      "category": "Resource",
      "title": "dm3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/55c90389a5660f965c6b87f94dc14af7_dm3.pdf",
      "content": "11.368 2004\nReaction Paper #3\nEnvironmental Inequality Formation - David N. Pellow, American Behavioral\nScientist (2000)\nPellow introduces his EIF framework as a way to frame inquiry and understanding of issues of\nenvironmental (in)justice. Its three main distinctions:\n1. environmental injustice is not just a single harmful event/action/result, but rather a\ncomplicated history of political, social, and economic interactions leading up to, and continuing\nbeyond, the contested instance of perceived injustice\n2. environmental injustice result from decisions made by all parties which may seem\ncontradictory or change over time with shifting circumstances--this is in opposition to the\nsimple Them v. Us or Perpetrator-Victim frame\n3. a life-cycle perspective must be taken on hazard production and consumption in order to fully\naccount for the distribution of costs and benefits in time and space related to hazards\nIn general, I think Pellow's points are good ones, though his choice of the Chicago WMI\nincinerator-turned-recycling program for an illustrative case study was problematic in places. He\nrightly points out the complex set of interests represented by government, community, and\nenvironmental groups that worked together to get the incinerator closed and recycling program\ninitiated, but he then continues to suggest that they walked from one environmental injustice\n(the incinerator) into another (poor labor practices). I think that the labor abuses by WMI are\nunacceptable by all means, but I do not see how they constitute a new environmental injustice\nposed to the community. It seems more like sad irony. There is definitely the issue of workers\nhealth and exposure, but, again, I think that is at a different level than community hazards\nexposure in that it is more voluntary (though still inexcusable) and rectified by different means\n(labor unions, arbitration, active resistance at the workplace). I don't think that recycling was\nthe wrong choice in this case, and I don't think any of the involved parties, except maybe WMI\nwould be satisfied with the result, rather, I think they would all agree to see it refined to be\nmore worker-friendly as well as community-friendly.\nThe Justice of Environmental Justice - David Schlosberg\nDefines justice, as it pertains to the environment, to include three main factors that are\ninseparably linked:\nDistribution-- (in)equity in the spatial location of environmental ills\nRecognition-- legitimacy of affected parties, their knowledge and concerns; a recognition of\nidentity and inequity\nParticipation-- non-tokenist participation of the affected community in decision-making and\noversight\nI did not care for this paper particularly. It restated the three aspects listed above over and\nover as a theoretical basis for approaching issues of justice without making the importance of\nsuch distinctions clear in the realm of environmental justice. I think all of these factors are\ncritical to having a just society, but the equity of distribution seems to be a result of the other\ntwo factors. In the case of environmental justice, it is the disproportionate risk and burden\n\nplaced on disenfranchised and unempowered communities that drives an examination of their\nunjust situation as it relates to recognition and participation.\nI am confused by a couple of the recurrent statements of the paper regarding recognition of\nsocial differences and their role in equitable distribution. Also, 'postmaterial.'\nProject Ideas:\nI think I would prefer to do two smaller project/papers, though I am still conflicted. Here are the\nideas I am thinking about right now:\nProject\nI would really like to do a design project based on a GIS of various population and environmental\nstatistics. The problem is, I have no idea how readily available spatial data is (maybe from the\ncensus or EPA monitoring). I think it would be very interesting to put together a visual\npresentation based on geographic maps of various social, economic, and environmental metrics\n-to persuade and imply connection without direct use of statistics. Some of the things I was\nthinking about were: topography and income; SOx, NOx, ozone; the courses of the most\npolluted waterways; military bases and reservations; racial composition, population density,\npopulation growth and decay over the past 100 years... many things, but I need to find out\nabout data coverage\nPapers\n1. GM food aid-- I am only vaguely familiar with the situation in Zambia, but am interested in\nfinding out more about the role of GMOs in development aid (both as institutionalized long-term\ndevelopment projects and as immediate famine relief). What are the costs and benefits, known\nand supposed risks, from economic, social, and health perspectives?\n2. Land/wildlife conservation and displaced people-- many examples from southern Africa, and I\nam sure all over the world as well. How to reconcile conservation with rural/indigenous culture\nand land-rights. Urban and affluent populations look outside their neighborhoods to protect the\n'unspoiled' environment that puts them in direct conflict with those people inhabiting the\nproposed conservation site. Issues that arise include (in)equitable legal access,\ncultural/indigenous legitimacy (eg Khoi/San people who do not live as hunter-gatherers are not\nentitled to traditional lands etc), rural preservation to compensate for urban pollution, what is\n'fair' compensation?, what is the value of conservation for the various stakeholders?\n3. System of emissions trading, where countries can buy unused emissions allotments from less-\ndeveloped countries. Is this system in the best interest of the global population/environment?\nWhat is fair compensation? Who benefits from the compensation? What are the long term\nhealth, social, and economic effects? Does it reinforce or widen the disparity between\ndeveloped and less-developed nations?"
    },
    {
      "category": "Resource",
      "title": "kwg3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/6ae6d6efda301f9f6a336cd25ee50bcd_kwg3.pdf",
      "content": "11.368 - Reaction Paper 3\nI thought that Pellow presented a novel idea when he suggested a life-cycle analysis of\nhazardous materials in order to help highlight and understand environmental injustice.\nForm the perspective of a traditional environmentalist, the idea is fairly routine, but I had\nnever considered it as a method by which to analyze environmental injustice.\nIt made me think, while reading Schlosberg's piece, that Schlosberg neglected to present\nan in depth discussion of distributional justice. Schlosberg only presented two insights.\nFirst, he claimed that justice itself is traditionally thought of as a problem of distribution.\nSecond, Schlosberg stated that race and economic status are the two most significant\nfactors related to the siting of environmental hazards. He completely missed Pellow's\npoint that the distribution of environmental injustice is more complex than just the siting\nof hazardous waste dumps. Instead, according to Pellow, one should examine the\nextraction, processing, distribution, consumption, and disposal of hazardous materials.\nSchlosberg only addressed one of these five steps -- disposal.\nSome of Schlosberg's analysis of the interaction between distribution, recognition, and\nparticipation can at least be extrapolated to incorporate the extraction and processing of\nhazardous materials. Unfortunately, I believe his analysis completely fails to address the\ndistribution and consumption of hazardous materials. Specifically, how do Schlosberg's\nthree factors of environmental justice address the use of lead paint in older homes? Lead\npaint is not something which can be redistributed, and it is not something which\nindividuals can vote out of their houses. Instead, it is a consequence of economics and\n\ncan only be rectified through economic change. Either the government must step in and\npay for the removal of lead paint, or the residents of contaminated homes must become\neconomically empowered enough to remove it themselves.\nIn general, I agree with Schlosberg that societal recognition and participation are\ncompletely necessary to achieving environmental justice. Yet, Schlosberg uses too\nnarrow of a definition of distribution for it to be applied to all types of environmental\ninjustice. Environmental justice, as the Principles of Environmental Justice states, is also\nconcerned with the responsible use of resources, limiting pollution production, and\nindividual lifestyle choices. Even if Schlosberg's three conditions of environmental\njustice were fulfilled, one could not necessarily say that the environmental movement had\nbeen a success."
    },
    {
      "category": "Resource",
      "title": "lkc3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/33dd1de63ad1332f707bf04af2c0af17_lkc3.pdf",
      "content": "h11.368 Response Paper 3\nThis week's readings delve further into the development of a theory of environmental justice\nfrom moral, political, and sociological standpoints. The Schlosberg piece succinctly describes a\nthree-part meaning of justice, as: equity, recognition, and participation. He states that all three of\nthese conceptualizations of justice are simultaneously incorporated into the environmental justice\nmovement in practice, though past writing in the field has had an over-emphasis on the equity (or\ndistributive) issues related to siting of noxious facilities. I appreciated this piece's nuanced\napproach to demonstrating the interactions between these three definitions of justice (e.g. how a\nlack of recognition can lead to unequal distribution as well as obstacles to political participation).\nSchlosberg states: \"inequitable distribution, a lack of recognition, and limited participation all\nwork to produce injustice, and claims for justice can--some would say must--be integrated into\na comprehensive political project\" (87). Moreover, his political approach ties EJ to theory\n(Mills, Walzer), and helps us to position it for critical comparison to other movements such as\nthe civil rights movement; rather than simply stating that civil rights issues are a contributing\nstream to environmental justice. This piece also gives context to the writings of the prior week,\nparticularly on issues like local self-determination. Some of the calls to action made in the 1991\nSummit, which seemed to have a spurious relationship to EJ, now make intuitive sense when cast\nin this expanded definition of justice. The right to \"cultural survival\" and the need to \"come into\na voice\" are aspects of the right to recognition, while an \"expansion of the concept and practice\nof democracy to be more inclusive of community input\" is also occurring (90,93). Finally, one\nissue that Schlosberg raises that I hope to explore further in future readings is the concept of\nhealth risk as physical abuse, or a violation of a person's body. I do not think toxic exposure is\nby any means analogous to rape or torture, but the moral argument offers interesting avenues for\nEJ advocates.\nPellow's environmental inequality formation (EIF) theory offers a useful frame for thinking\nabout EJ case studies, focusing on \"broader dimensions of the intersection between\nenvironmental quality and social hierarchies\" (582). Moving the literature beyond the existence\nof unequal outcomes, Pellow and other researchers on environmental inequality attempt to\ninvestigate the mechanisms behind those outcomes (587). He unpacks the notion of the\n\"perpetrator-victim\" narrative by highlighting multiple stakeholder relationships and viewing\ninequality as a process rather than a moment in time (588). As such, Pellow has clearly carved\nout a role for sociologists in this discourse, as well as historians, psychologists, and network\ntheorists. His framework helps me to position the Checker article from last week within the\ndiscipline, and inspires me in thinking about my potential research project for this course. While\nthe \"life cycle\" analysis would seem to be the most complete mechanism for analyzing injustice,\nI question its practical applicability in framing feasible research questions. In terms of his\nsubstantive discussion of the recycling facility case study, Pellow raises the issue of\nneighborhoods being torn between advocating for jobs and economic development, while also\nwanting to protect workers' rights and prevent the deepening of patterns of environmental\ninjustice. He also distinguishes between different branches of the \"state\" and investigates the\nmulti-faceted relationship between state and corporate actors. Although I appreciate the depth of\nsuch historical studies, or organizational ethnographies, I wonder what lessons they transfer to\npractice, how comparisons can be made between them, and what new patterns or theories are\nbeginning to emerge from them."
    },
    {
      "category": "Resource",
      "title": "dm4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/5d62c4d8d35c1f9647fc06cada6b2c83_dm4.pdf",
      "content": "11.368 2004\nReaction Paper #4\nA River Runs Through Us - Brett Williams (2001)\nWilliams gives a compelling history of institutionalized racism through legislation and land\nuse decisions in the Anacostia region of Washington DC from the city's very inception. He\ntracks the rapid post-industrial degradation of the Anacostia River and the effect it has had on\nthe location and quality of life for poor black communities. Present-day conditions in the\nwatershed provide stark contrast to the pristine and plentiful watershed that drew native\nAmericans and early settlers with its deep, clean waters and game. Now, the Anacostia River is\nhighly polluted, too choked with sediment to be navigable, and not receiving the same amount\nof government restoration attention as similar rivers in the region that pass through suburban\nand white neighborhoods.\nThough often accepted as a necessary part of progress, environmental degradation is\nnot necessarily a burden shared equally or equitably among communities. In the process of\ndeveloping Washington DC into the nation's proud capitol, the large African American population\nbore the brunt of many of the negative environmental impacts while benefiting little from the\nsocial and governmental benefits supposedly created. Planning was used as a tool to isolate\nblack and poor communities by demolishing and replacing inner city neighborhoods with\ngovernmental and commerce institutions, though highway placement, and by public transport\nsystems serving predominantly suburban affluent communities not open to black residents.\nWilliams also shows the importance of the entire history of settlement and government in the\nregion in determining the pattern and extent of injustices. The residual effects of Jim Crow laws\nand segregated residential developments are enormous in determining where people live today.\nThe more mobile white community has the luxury of using and moving. When the river became\ntoo dirty to live near and too shallow to work along, they moved up to the hills and got\ngovernment support for utility and transportation amenities while leaving those who couldn't\nrelocate (due to race or economics) along the banks of the fetid Anacostia River.\nEnvironmental Justice; Law, Policy, and Regulation: Chapter 3. The Evidence\nClifford Rechtschaffen, Eileen Gauna\nRechtschaffen and Gauna present a series of case studies showing how statistics are\nused to support or deny claims that environmental injustice has occurred. The basic point to\ncome away with is that results can seem radically different depending on the method of\nsampling and size of population units used. One point that they don't really touch is how much\nconsistent evidence is really necessary to make a legitimate claim of injustice. If one plant is\nspewing toxic fumes into a one black community, to what extent does that have to be proven\nto be a result of racial injustice before the health concerns of the community can be\nlegitimated? Does it matter that there is or isn't an affluent white community 10 miles away\nnot suffering the same ill-effects? Obviously this is peripheral to the real question of\ninstitutionalized environmental injustice, but still seems valid to me. There is a tension between\na desire to be objective and scientifically 'rigorous,' and a desire to get the right answer, to give\nthe justification for pointing fingers and getting beleaguered communities the reprieve they\ndeserve from environmental ills.\n\nThe use of census data is particular interesting in how the sampling size can change the\nresult. Whether you use a block-tract or a zipcode you can easily manipulate 'scientific' results.\nI thought the case of the Los Angeles MTA was particularly compelling, because it showed just\nhow inequitably government funding was being used to the disadvantage of the lowest income\nsegments of the population. It steps outside of the argument of market-based hazards sitings."
    },
    {
      "category": "Resource",
      "title": "kwg4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-368-environmental-justice-fall-2004/1ee19d21fef34b26eea9c06e05226346_kwg4.pdf",
      "content": "11.368 - Reaction Paper 4\nI found the first two excerpts contained in the Rechtshaffen piece to be the most\ninteresting part of this week's reading. I think that the Anderton article is especially\nmisleading. It claims that \"the percentage of Black persons in census tracts with\nTreatment Storage and Disposal Facilities (TSDFs) is approximately the same as in tracts\nwithout TSDFs.\"\nThe authors' method has a serious flaw -- it does not account for census tracts which are\npart of Standard Metropolitan Statistical Areas (SMSAs) without TSDFs. The authors\nonly analyzed SMSAs which contained TSDFs. I'd like to know what percentage of\nSMSAs contain TSDFs, but I cannot imagine that is is more than 25%. Additionally, as\nthe name implies, is some other grouping used for census tracts outside of metropolitan\nareas? Clearly, there are a large number of census tracts which do not contain TSDFs\nwhich were excluded form the study. I would assume that these tracts probably have a\nmuch lower concentration of minorities than those reported in the Anderton study. If this\nis the case, the study should have concluded that census tracts which contain TSDFs have\na higher percentage of minorities. Instead, the only thing that the Anderton study truly\nproved was that census tracts which contain minorities and those close by all have the\nsame percentage of minorities.\nThe Been article was equally interesting but for a different reason. Been concluded that\nthe presence of Blacks in a census tract had no bearing on whether that tract would draw\n\nnew sitings of TSDFs. Additionally, Been found that at a later point in time (1990), there\nwas a positive correlation between the percentage of Blacks living in a tract and the\npresence TSDFs. Given that Been concluded that her market dynamics scenario was not\nsupported by the data, she seems to contradict herself. According to the Notes at the end\nof the article, Been attributes this inconsistency to the existence of TSDFs in Black\nneighborhoods prior to 1970. This seems like a good excuse to ignore the inconsistency.\nIt would be helpful to know how many TSDFs existed in predominantly Black\nneighborhoods in 1970 and compare this number to the statistic from 1990. Any increase\nshould indicate that Been's study was flawed."
    }
  ]
}