{
  "course_name": "Environmental Struggles",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Public Administration",
    "Environmental Policy",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Public Administration",
    "Environmental Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nDescription\n\nThis class explores the interrelationship between humans and natural environments. It does so by focusing on conflict over access to and use of the environment as well as ideas about \"nature\" in various parts of the world. The readings and films shown in this course will consider environmental conflict in relation to land rights, hunting and fishing practices, environmental regulations, environmental knowledge (whether scientific or popular knowledge) and hazardous waste. These materials suggest the social, economic, political and environmental stakes of such struggles for both human actors and for the environments in which they live. After beginning with a cultural exploration of ideas of \"nature\" within European thought, this class draws upon a series of ethnographic and historical studies of environmental conflict in East Africa, South Asia, Eastern Europe, Latin America and North America.\n\nClass Requirements\n\nClass attendance is mandatory and attendance will be taken. Missing more than one class without the permission of the class instructor will result in a lower grade. Written requirements: one 3-5 page paper due one day after Lec #5; one 5-7 page paper due one day after Lec #9; two 5 page essay questions (total 10 pages) due one day after Lec #12.\n\nGrading\n\nactivities\n\npercentages\n\nFirst Paper (3-5 pages)\n\n20%\n\nSecond Paper (5 pages)\n\n30%\n\nFinal Paper (2 Essay Questions)\n\n40%\n\nClass Participation\n\n10%",
  "files": []
}