{
  "course_name": "Epigenetic Regulation of Stem Cells",
  "course_description": "During development a single totipotent cell gives rise to the vast array of cell types present in the adult human body, yet each cell has essentially the same DNA sequence. As cells differentiate, distinct sets of genes must be coordinately activated and repressed, ultimately leading to a cell-type specific pattern of gene expression and a particular cell fate. In eukaryotic organisms, DNA is packaged in a complex protein super structure known as chromatin. Modification and reorganization of chromatin play a critical role in coordinating the cell-type specific gene expression programs that are required as a cell transitions from a pluripotent stem cell to a fully differentiated cell type. Epigenetics refers to such heritable changes that occur in chromatin without altering the primary DNA sequence. This class will focus on the role of epigenetic regulation with respect to developmental fate and also consider the fact that the epigenetic mechanisms discussed have broad implications, including how seemingly normal cells can be transformed into cancerous cells.\nThis course is one of many Advanced Undergraduate Seminars offered by the Biology Department at MIT. These seminars are tailored for students with an interest in using primary research literature to discuss and learn about current biological research in a highly interactive setting. Many instructors of the Advanced Undergraduate Seminars are postdoctoral scientists with a strong interest in teaching.",
  "topics": [
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics",
    "Molecular Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nRecommended prerequisites are:\n\n7.03 Genetics\n\n7.05 General Biochemistry\n\n7.06 Cell Biology\n\n7.28 Molecular Biology\n\nCourse Description\n\nDuring development a single totipotent cell gives rise to the vast array of cell types present in the adult human body, yet each cell has essentially the same DNA sequence. As cells differentiate, distinct sets of genes must be coordinately activated and repressed, ultimately leading to a cell-type specific pattern of gene expression and a particular cell fate. In eukaryotic organisms, DNA is packaged in a complex protein super structure known as chromatin. Modification and reorganization of chromatin play a critical role in coordinating the cell-type specific gene expression programs that are required as a cell transitions from a pluripotent stem cell to a fully differentiated cell type. Epigenetics refers to such heritable changes that occur in chromatin without altering the primary DNA sequence.\n\nThe ability to study the epigenome (the chromatin-associated proteins and RNAs that organize and coordinate access to DNA) on a grand scale has only recently become feasible with the advent of methods for genome-wide analyses and high-throughput sequencing technologies. For example, we are now able to map essentially any epigenetic modification that occurs to either the DNA itself and/or to the chromatin protein scaffold around which the DNA is organized. We can even decipher the 3-dimensional structure of chromatin within the nucleus during different epigenetic states. These advances have led to an explosion of data and a comprehensive picture of the epigenome and the factors that regulate it.\n\nIn this class we will discuss the various mechanisms of epigenetic regulation, including DNA methylation and post-translational modification of histones, and the roles of chromatin-assembly modifying complexes, non-coding RNAs and nuclear organization. We will read papers from the primary research literature and discuss both the scientific discoveries and the new technologies that have made these discoveries possible. This class will focus on the role of epigenetic regulation with respect to developmental fate and also consider the fact that the epigenetic mechanisms discussed have broad implications, including how seemingly normal cells can be transformed into cancerous cells.\n\nFormat\n\nThe goal of this course is to provide students with the tools required to survey, interpret, and assess the primary research literature. Within this framework, we will delve into the field of stem cells with a particular focus on epigenetic regulation. Students will read two papers selected from the primary literature before each class. The papers will range from older classical papers to more recent papers that utilize cutting-edge genomic techniques. Active participation will be expected during class. At the end of each class, there will be an introduction to the following week's papers.\n\nGrading\n\nThe course is graded pass / fail, and a passing grade will be awarded to those students who attend the course, participate during discussions, and complete assignments in a timely and appropriate manner.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nIntroduction to Stem Cells and Induced Pluripotency\n\nEpigenetic Memory and Epigenetic states\n\nDNA Methylation\n\nDNA Methyl-Binding Proteins\n\nHistone Marks and Epigenomic Sequencing Technologies\n\nPolycomb Group Proteins\n\nEnhancers\n\nSuper Enhancers\n\nNon-coding RNA\n\nModeling Complex Biological Systems & Student Paper Discussions\n\nWritten Assignment Due\n\nChromatin Nuclear Topology\n\nStem Cell Therapy\n\nFinal Presentations\n\nOral Assignment Due",
  "files": []
}