{
  "course_name": "Ethics of Technology",
  "course_description": "This course introduces the tools of philosophical ethics through application to contemporary issues concerning technology. It takes up current debates on topics such as privacy and surveillance, algorithmic bias, the promise and peril of artificial intelligence, automation and the future of work, and threats to democracy in the digital age from the perspective of users, practitioners, and regulatory/governing bodies.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Legal Studies",
    "Public Administration",
    "Science and Technology Policy",
    "Engineering",
    "Computer Science",
    "Human-Computer Interfaces",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Legal Studies",
    "Public Administration",
    "Science and Technology Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Overview\n\nTechnological advances, and the uses we make of them, continue to radically reshape the world we live in. Data is being collected and analyzed on an unprecedented scale; algorithms play an ever-increasing role in the decisions we make; social media is cited as radically transforming both personal and political discourse; and the list goes on. These developments raise a host of pressing ethical questions that we need to confront, both as a society, and as individuals. The aim of this class is to introduce students to some of these questions and equip them with the conceptual tools needed to engage with them productively and responsibly. Issues studied include:\n\nPrivacy\n\nConsent to data practices\n\nAlgorithmic justice\n\nOnline manipulation and \"dark patterns\"\n\nEcho chambers\n\nCensorship and freedom of speech\n\nIn addition to looking at technology ethics, this class is intended as an introduction to moral philosophy and does not presuppose any philosophical background.\n\nCourse Objectives\n\nUpon successful completion of the class, students will have:\n\nBeen introduced to a variety of important issues in technology ethics.\n\nDeveloped a richer understanding of what ethics is and how to reason about it.\n\nImproved their skills in argument construction, analysis, evaluation, and articulation.\n\nLearned to recognize, and have productive discussions in the face of, reasonable moral disagreement.\n\nLearned to engage critically with the many ethical questions raised by technology.\n\nReadings\n\nAll readings can be found in the\nReadings\nsection.\n\nCourse Requirements\n\nClass Attendance, Preparedness, and Discussion\n\nYou should come to class ready to contribute to class discussions in a way that demonstrates you have done the assigned readings. Attendance at recitations is mandatory.\n\nReading Quizzes\n\nEvery time a new reading is assigned (which is nearly every class), there will be a quiz. These aren't anything to worry about; they are designed to be easy if you've made a sincere attempt to do the reading but hard otherwise.\n\nNote: Quizzes are not included on the OpenCourseWare site for this course.\n\nWriting Assignments\n\nYou are required to submit three short writing assignments (approximately 500-1000 words each) over the course of the semester. These are worth 15% of your final grade each. You will also be required to submit a single longer essay (approximately 1500 words) due on the final day of class. This is worth 30% of your final grade.\n\nFor detail on the writing assignments and the final essay, see the\nAssignments\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in Recitations\n\n10%\n\nReading Quizzes\n\n15%\n\nShort Writing Assignment 1\n\n15%\n\nShort Writing Assignment 2\n\n15%\n\nShort Writing Assignment 3\n\n15%\n\nFinal Essay\n\n30%",
  "files": []
}