{
  "course_name": "Ethics in Your Life: Being, Thinking, Doing (or Not?)",
  "course_description": "This seminar is made possible through a collaboration between Radius and the Philosophy section of MIT. This course provides an opportunity to explore a wide range of ethical issues through guided discussions that are geared to equip students for ongoing reflection and action. Lectures and discussions with guest faculty, as well as attendance at on-and off-campus events, expose students to ethical problems and resources for addressing them. The course also encourages students to work collaboratively as they clarify their personal and vocational principles.\nTopics vary each term and reflect the interests of those enrolled.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nWhat is your responsibility to the global poor, the homeless, the disenfranchised? Is the death penalty morally permissible, and if so, under what conditions? Is it permissible for the state to contract with for - profit prisons? What sacrifices, if any, should we make to protect the environment? What is our right to use \"natural resources,\" such as water? Is nuclear energy worth the risk? What moral and political issues are relevant when we choose what to eat?\n\nThis course is a seminar made possible through a collaboration between\nRadius\nand the\nPhilosophy\nsection of MIT. The seminar is a place to build relationships, share resources, explore tools for solving ethical problems, and gain skills for clarifying your personal and vocational principles. Topics can vary depending on expressed interests of the group and current critical issues such as political change and movements, environmental and / or human catastrophe, global conflict, and local topics.\n\nRequirements\n\nClass Participation\n\nEach seminar meeting will include interactive teaching on a particular topic, designed to equip students for reflection and action. Students are expected to attend every seminar. If you cannot make a seminar, please contact one of the instructors beforehand.\n\nEvents\n\nDuring the semester, students will be expected to attend three Radius events or public forums or other pertinent public lectures, films, plays, panel discussions offered at MIT and beyond. Those who are unable to attend an event recommended by an instructor may substitute an alternative event approved by one of the instructors.\n\nOutside of Class\n\nStudents will be expected to be in dialogue with one another online between meetings through the class website. This is an excellent way to continue and deepen discussion begun during class.\n\nReading and Writing\n\nThere is very little required reading, but links to recommended readings and other resources can be found in the\nReadings\nsection. Students are encouraged to read the suggested material and explore additional resources for information.\n\nStudents are required to submit three short (roughly 250-300 word) reflection papers over the course of the term in response to the outside events you attend. The reflections are due at intervals during the semester.\n\nPresentations\n\nDuring the last class of the term, each student will give a 5-7 minute presentation on their own ethical perspective, as developed over the course of the term.\n\nThere is no final exam.",
  "files": [
    {
      "category": "Resource",
      "title": "MIT24_191S15_Denial.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/e7e290bb1ac047002d4dd8d48063a5c4_MIT24_191S15_Denial.pdf",
      "content": "Event: Screening of PBS documentary \"American Denial\"\n2/24/15\n\nOn Feb. 24th, I watched a documentary called \"American Denial\" on the non-profit TV channel PBS\n(Public Broadcasting Service). The documentary dealt with the topic of race and racial discrimination in\nthe United States. It starts off by talking about a landmark study on this subject by the Swedish researcher\nGunnar Myrdal, entitled \"The American Dilemma\", which he published in 1944. In the first half the\ndocumentary analyzes depicts Myrdals journey conducting this study and discusses all the major\ndiscriminations that mainly African Americans had to go through at that time. In the second half, it makes\nthe point that even though many things, such as segregation, have changed racism is still a major problem.\n\nThe key messages that I took away from this documentary are manifold but I would like to mention two\nideas that stuck with me. The first thing that I found interesting and remarkable is Myrdal's distinction\nbetween the social values that people believe in and the values according to which they live. Myrdal\nfound that there is a discrepancy between those two values which can be very stark. Yet, the subjects in\nquestion were not aware of it which indicates it is subconscious. A powerful example of this is Myrdal's\nquestion to white people if segregation in the 1940's is similar to the Anti-Semitism in Germany. The\npeople asked strongly disagreed and pointed out that this behavior violates the American Creed in\ndifferent ways yet they failed to see that not everyone was equal in their own country as well.\n\nThe second idea that I took to heart from this documentary, is the well explained downward spiral of\ncommunities of color due to racial discrimination. The effects may be split into tangible and\npsychological consequences both of which have severe repercussions. An example for the former type of\nconsequence is the higher policy enforcement for people of color which results in many colored men\nbeing incarcerated. This in turn destabilized their communities though a lack of income and consequently\npoverty as well as stress on mothers in respect to child care. A psychological consequence from\ndiscrimination is the statistically proven underperformance of children of color due to a distorted self-\nimage that portrays them as bad, useless etc.\n\nMy stance on the racial problems and race discrimination in the US has been buttressed by this\ndocumentary. From my own experience, I have noted some of the issues pointed already beforehand,\nhowever the film did a good job looking at the issue of discrimination from different angles. Ultimately,\nthrough empathizing with the individuals displayed, I believe I have become more aware of some of my\nown biases and am given tools to change things in the future.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_191S15_Fossil.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/76ec70b5dd7a654eef754456f6fbdd4b_MIT24_191S15_Fossil.pdf",
      "content": "Event: MIT Fossil Fuel Divestment Debate\n4/9/15\n\nThe question of whether MIT should divest from fossil fuels brings up several ethical issues. The\nfirst and most obvious is our responsibility as humans to prevent damaging warming of the planet, which\nis largely caused by increasing carbon dioxide levels in the atmosphere due to combusting \"dirty\" fossil\nfuels. Secondly, the debate brings up the issue of hypocrisy. On the anti-divestment side, MIT could be\nhypocritical by divesting from fossil fuel when it consumes so much of it and when oil companies are\nlarge funders of its research. On the pro-divestment side, MIT needs to align its values of improving the\nworld with its actions, and needs to educate society about the dangers of fossil fuels and climate change\n(not just its students). One supporter, in defense of MIT, declared that divestment from fossil fuels would\nnot be hypocritical just like opposing slavery was not hypocritical, despite its integral role in society and\nthe economy in its time.\n\nBoth sides had good arguments for and against divestment. The anti-divestment team argued that\nbecause MIT's investment (and all university investments combined) form less than 1% of the global\nfossil fuel market, retracting it would be a largely symbolic measure. They also pointed out that not all\nfossil fuel companies are equal, and not all approach climate change the same way. In particular, privately\nowned oil companies were the \"worst,\" but since they have no shareholders, divesting would not affect\nthem. The anti-divestment team prominently supported climate change education and implementing a\ncarbon price rather than divesting.\n\nThe pro-divestment team argued that although the divestment would not make an appreciable\neconomic impact, symbols genuinely matter in our world (and gave the example of divesting having\nworked during the Apartheid in South Africa). They also pointed out that people do not demand fossil\nfuels, people demand energy, which could be provided by many other sources (mainly nuclear,\nrenewables, increased efficiency, and decreased consumption). The team prominently supported a\nmultifaceted approach that included not only divestment, but implementing a carbon price, educating\npeople about climate change, researching the science behind and developing the technology for renewable\nenergy. They argued that education, science, and technology were not enough, however, but that policies\nneeded to be pushed by society to make change happen (citing that smoking didn't decrease because we\nknew the health effects, but because of regulatory measures). They urged divestment as a symbol to spark\nsocial movement, because disinformation by fossil fuel companies and the suspected insincerity of their\ndesire for a carbon tax is currently preventing useful policies.\n\nI originally thought of divestment as an uninteresting economic and political issue, but now I\nrealize its usefulness as a symbolic tool. Though both sides presented good points, I was particularly\naffected by the incongruous nature of the anti-divestment team's arguments, to the point that it convinced\nme even more of the pro-divestment team's honesty. The anti-divestment team argued both that divesting\nwould make little economic impact, but also that investors could use their influence to put pressure on\nfossil fuel companies (as well as bothering to debate the issue). They argued that MIT should instead\nfocus on researching a carbon price, but the money divested could be used for such practical purposes.\nThey pushed education and the intelligence of people, yet offered no defense against accusation of\ndisinformation by fossil fuel companies. They continually ignored the pro-divestment side's arguments,\nas they often supported the same solutions without offering any new reason not to divest. Finally, in a\npetty stab, they declared that since investment companies show profit is not lost when institutions divest,\nif MIT wanted to divest it would have done it already. Compared to the pro-divestment team's call to\ncourage, action, and global leadership, the choice between which side is more ethical was clear.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_191S15_Housing.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/bcba2a44e01d98bb8cfc9e2f2f88f33f_MIT24_191S15_Housing.pdf",
      "content": "Event: Radius Panel, \"Housing Dynamics and Displacement in Cambridge\"\n4/28/15\n\nI attended Radius's panel on \"Housing Dynamics and Displacement in Cambridge\", or gentrification for\nshort. The panel was about how large corporations - including MIT - are bringing absurd amounts of\ndevelopment to Cambridge and Somerville and in the process displacing families that have been in the\narea for generations. I also learned about how housing assistance works in the forms of mobile vouchers\nand public housing and how those systems have changed over the years, as well as the worker various\ncommunity organizations are doing to try and mitigate the detrimental effects of gentrification, since\nstopping it from happening does not appear to be an option.\n\nCurrent efforts to address this problem seem to revolve around community organizing. Efforts including\ntrying to change policy - for example, increasing the percentage of units per residential space that must be\navailable at prices affordable to low-income families - and trying to work directly with contractors to\nensure that all developments bring some benefits to the community. I was surprised to learn that MIT\ncould make a big difference by providing housing for a much higher percentage of our grad students. The\nsurprise stemmed from the fact that I'd never heard of anyone pushing MIT to do that before.\n\nI didn't go to the event explicitly because I'm concerned about gentrification in the Cambridge area - I\nlive in a dorm and I'm leaving Cambridge in a month when I graduate. I went because I am moving to\nSan Francisco to be part of the tech industry that is gentrifying the city like crazy, and I wanted to learn\nhow I could fight that, or at least try to avoid being part of the problem. I came away from the event\nthinking that this isn't something that I can work on as an individual, but I can find organizations in San\nFrancisco analogous to the ones in Cambridge and work with them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_191S15_Racism.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/f2ab921e6d37ce05470b88c36cb06910_MIT24_191S15_Racism.pdf",
      "content": "05/12/2015\nFinal Presentation\nHi everyone! I am going to talk this evening about racism, a topic\nwhich some of you may think I don't have enough experience with to\nsay anything of consequence. And, for the most part, I'd say you were\nright, because when you think racism, you probably think about all of\nit's terrible effects, too numerous to list, effects which I consider myself\nvery lucky not to be afflicted by. However, I want to talk instead about\nthe causes of racism and how we design our attack on this problem to\nbetter address these causes.\nI think most of us would agree that the label 'post-racial' does not\nat all apply to our current society. I also think that everyone agrees that\nthe goal of creating a 'post-racial' society is admirable and worthy of\neffort. However, I think that the trap we fall into in trying to achieve that\ngoal is going about it at a societal level, i.e. imposing rules and\nregulations on institutions and large macro processes, and, while I think\nthat these efforts are well-meaning and should be continued, they fail to\naddress the root of the problem: the fact that individuals are racist.\nTo demonstrate this, I'm going to say something that I guarantee\nyou have never any public figure or person in power say, something that\n\nyou've probably never heard someone say ever. I am racist. I am racist. I\nam. It's a terrible fact, one that I try to disprove every day, but the\ntenacity of this truth has forced me to surrender to it, and I have instead\nrecently been focusing my efforts on mitigating the effects of my racist\ntendencies. I don't actively discriminate, I try to treat people as I would\nif they had any skin color, and I don't think I would have shot Michael\nBrown, but I did not get a perfect score on the Implicit association test, I\nsometimes catch myself reacting differently to people of different races\nin similar situations, and (allow me to be a little pretentious here and\nquote Joseph Conrad) I am very aware that \"no man ever understands\nquite his own artful dodges to escape the grim shadow of self-\nknowledge.\" I'm gonna let that one sink in a bit. The admission of my\nown racism has caused me to become hyper aware of my own actions,\nto constantly question if I would have reacted in the same way to\nanother person if they had a different skin color, to check every action\nI do on past actions I believe were justified, and to justify to myself\nthat an action I take is not due to my racist nature. Interestingly\nenough, (although I'm sure you all saw this coming), this has led be to\nbe less outwardly racist, as I train myself to force myself to treat\neveryone as I would all others.\n\nIt is my personal belief that humans are innately racist; that,\nbecause we are able to recognize ourselves, we can recognize when\nsomeone does not look like us, and the primal circuitry that kept us\nalive when we all lived in tribal units labels that different person as an\noutsider, someone with perhaps ulterior motives, or, at the very least,\nless worthy of our compassion. By implication then, I also believe that\nthere will never be a generation born in this world that is completely\ncolor blind, that the struggle against our racist nature will never cease.\nThis is not meant to sound pessimistic, as I think we are perfectly\ncapable of eliminating the almost all of the effects of racism through\nmass self-awareness as described above. However, even if you disagree,\nand you think that racism is a cultural problem and it is perfectly\npossible to have a generation of people who are not at all racist, this\nidyllic group of people is certainly not us (a counter-example is right\nhere), and it is certainly not the generation that is currently running\nthings.\nSo, regardless of your beliefs on the ultimate source of racism, I\nargue that racism exists on the most basic personal level, and, in order\nto attack this problem, we need to remove the current stigma not from\nracist actions but rather from the idea having racist tendencies, and\n\nsupport efforts to eliminate the effects of racism at both the cultural and\nthe personal level. We need to allow ourselves to have the idea that we\ncan be both part of the problem and part of the solution; to admit that\nwe are all, each individual person, whether it was ingrained in us either\nby evolution or by our cultural upbringing, we are all racist. This does\nnot mean we are bad people, we just need to realize that there is\nsomething that we tend to do that we don't like, and the best way to fix\nthis is not to deny that this is a part of us but rather be as aware of it as\nwe can and not let it creep out in any aspect of our lives. I think that if\nwe all did this, we would be on a much more secure and thorough path\nto ending the effects of racism.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT24_191S15_Slut.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/3ac960b459502af733f435698c2ede0d_MIT24_191S15_Slut.pdf",
      "content": "Event: Slut the Play\n5/2/2015\n\nSlut the Play centers around the main character Joey and her experience with a sexual assault. A large\nportion of the play simulates Joey's discussion with the police after the assault. In the interview, Joey is\nasked about the events leading up to the assault. She explains that she was drinking with three male\nfriends and brought a pack of condoms as a joke. When asked why she did this, Joey explains that she\nwanted to seem cool in front of these guys; it felt good to get attention from them.\n\nThis prompted me to think about how frequently girls, including myself, place a large part of their self-\nesteem in how guys think of them. I found that I strongly resonated with Joey's desire to be wanted by\nmen. I am extremely comfortable with who I am, but I still find myself vulnerable to what guys think of\nme. I feel powerful when I get a lot of male attention, but I also fixate on what about me could make a\nguy choose not to call after a date.\n\nAfter the play, I posed a question to the cast and writers about how to encourage young girls to place their\nself-esteem out of the control of men. They answered the question in the way I would have: self-esteem\ncomes from you and you alone. I believe that one must take an active role in reflecting about how they\nfeel about themselves. With conscious thought, and some help by talking to others, one can diminish\noutsiders' effects on one's confidence. After this play, I vowed to be more aware of how I react to men\nand to make sure that I do not allow them to play a role in determining my self-worth.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.191S15 Ethics In Your Life - Punishment and Justice Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-191-ethics-in-your-life-being-thinking-doing-or-not-spring-2015/d025814e2213388694e91a159635cac3_MIT24_191S15_PunishndJusti.pdf",
      "content": "24.191 Ethics In Your Life\n3/10/15\n\nPunishment and Justice\n\nTWO CONFLICTING AIMS\n\nA central theme of our discussion over the past two weeks has been a conflict between two\nimportant aims of the state:\n\nSAFETY: the state should use its power to protect its citizens from one another by\npreventing citizens from violating one another's rights.\n\nRESPECT: the state should protect its citizens from itself, only using its power in ways that\ntreat its citizens justly and do not violate its citizens' rights.\n\nRacial profiling (Adam Hosein):\n- Some argue that we could more effectively prevent violent crime if we engaged in racial\nprofiling (SAFETY), since doing so would make us statistically more likely to capture\ncriminals.\n- But, engaging in racial profiling seems to require treating citizens unjustly (RESPECT).\n\nPunishment (Erin Kelly):\n- The threat of punishment, and the incarceration of criminals, is one of the main tools\nthe state has for protecting its citizens from one another (SAFETY).\n- However, punishing a citizen involves doing things that would normally violate her\nrights: using the threat of violence to coerce her into a locked cell, taking away her\nfreedom, etc. So it seems that punishment needs a very powerful justification if it is not\nto violate RESPECT. And it seems very likely that some (many) of the punishments\ncurrently given by the US lack this justification.\n\nTWO BIG QUESTIONS\n\n(1) How should the state take historical injustice into account in its law enforcement\ndecisions?\n\nThere's good reason to think that minority groups commit certain crimes disproportionately\noften because of the historical oppression they have suffered. When enforcing the law, then,\nthe state may punish members of minority groups disproportionately often (even if they\nengage in no racial profiling). This seems to add to the disadvantages faced by the minority\ngroup, which in turn may lead to more crime, which would lead to more imprisonment, and so\non in a vicious cycle. (This is the problem Ta-Nehisi Coates pointed out in his article).\n\nSo: if the state enforces the law without taking historical injustice into account, it is at risk of\ncompounding those very injustices. (Note: another conflict between SAFETY and RESPECT). What\ncould be done to avoid this vicious cycle?\n\n(2) What purpose(s) should punishment serve?\n\nThis is a question about what justifies punishment: not what actually motivates people to\npunish, but rather what ought to motivate people to punish.\n\nRetribution:\n- Idea: the purpose of punishment is to give evil people what they deserve.\n- Advantage: respects the idea that punishment should only be doled out to those who\ndeserve blame.\n- Disadvantage: seems vengeful and counterproductive. Also, is subject to worries about\nwhether blame is ever justified (cf. Barbara Fried's article).\n\nDeterrence:\n- Idea: the purpose of punishment is to prevent crime.\no Special deterrence: the function of punishment is to prevent the person being\npunished from committing further crimes, e.g. by incapacitation or rehabilitation\n(cf. Menninger essay).\no General deterrence: the function of punishment is to prevent people other than\nthe person punished from committing similar crimes, by giving them an incentive\nnot to do so (think of parking tickets).\n- Advantage: seems more productive, less vengeful, more humanitarian.\n- Disadvantage: seems to imply that it could be okay to punish an innocent person (C. S.\nLewis' objection). Also unclear whether and when punishment deters.\n\nPenance:\n- Idea: the purpose of punishment is to give the perpetrator a chance to demonstrate\nremorse and a commitment to reform.\no Example: Ross drinking the fat.\n- Advantage: seems less counterproductive than retribution, but still only justifies\npunishing those who committed the crime.\n- Disadvantage: unclear how it could be implemented by the state. (Though see\nreparative/restorative justice programs).\n\nTWO KINDS OF THEORY\n\nIdeal theory: imagine you can redesign society from scratch. What would the ideal society look\nlike? (Important: don't assume the people are ideal; try to come up with ideal institutions for\ndealing with non ideal people).\n\nNon ideal theory: start with the (very) imperfect society we've got. What are some ways we\nmight be able to make it better, given the constraints we face? What are reforms we could\nintroduce that might have a realistic chance of being adopted? How could we convince people\nto take on the reforms?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.191 Ethics in Your Life: Being, Thinking, Doing (or Not?)\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}