{
  "course_name": "Ethical Practice: Leading Through Professionalism, Social Responsibility, and System Design",
  "course_description": "This course offers an introduction to ethics in business, with a focus on business management. Students explore theoretical concepts in business ethics, and cases representing the challenges they will likely face as managers. There is opportunity to work with guest faculty as well as business and other professional practitioners. Individual class sessions take the form of moderated discussion, with occasional short lectures from the instructor.",
  "topics": [
    "Business",
    "Business Ethics",
    "Management",
    "Business",
    "Business Ethics",
    "Management"
  ],
  "syllabus_content": "Course meeting times\n\nLectures: 2 sessions / week, 90 minutes / session\n\nPrerequisites\n\nNo prerequisites\n\nCourse Description\n\n15.270 Ethical Practice: Leading Through Professionalism, Social Responsibility, and System Design\nintroduces seminar participants to aspects of ethics in business, with a focus on general management. Over 13 sessions, students explore both the philosophy driving business ethics and the daily challenges that managers face; they also engage on the subject with guest faculty and business and other professional practitioners. Individual sessions take the form of moderated discussion, with occasional short lectures from the instructor.\n\n\"Ethical Practice\" walks participants through three ever-wider circles of ethical complexity:\n\nIndividual, professional commitments\n\nThe rights and responsibilities of corporations\n\nThe social, ethical underpinnings of business as an activity. We seek to define terms central to each of these circles, culminating in a brief historical assessment of business and capital in the early twenty-first century.\n\nCourse Requirements\n\nStudents will be graded on the following\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in class discussions\n\n40%\n\nThe writing of three team papers\n\n30%\n\nA final, individual paper in which students reflect on the evolution of their views during the half-semester\n\n30%\n\nCourse Outline and Key Dates\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nCourse Introduction\n\nWealth, values, and human nature\n\nPersonal and Professional Practice\n\nThe reality\n\nA question of character\n\nCommitments\n\nReports from the field: Professional panel discussion\n\nCorporate Social Responsibility\n\nDefinitions and strategies\n\nTeam paper 1 due\n\nClash of values\n\nTeam Paper 2 due\n\nConstructing the global marketplace\n\nCorporate culture and individual responsibility\n\nTeam Paper 3 due\n\nThe Purpose of a Corporation\n\nBeginnings\n\nA new corporate life?\n\nA critique of capital\n\nConclusions\n\nNext steps\n\nFinal paper due\n\nWriting Assignments\n\nStudents will submit:\n\nThree team essays: In all three cases, the topic will correlate with the subject of one of our classes.\n\nIndividual writing assignment: The three team papers will serve as the springboard for your final, longer paper. This assignment represents 30% of your grade.\n\nFor details, see the\nAssignments\nsection.",
  "files": []
}