{
  "course_name": "Ethnic Literature in America",
  "course_description": "Although this class starts by critically examining the term “ethnic” as it defines a wide range of cultural forms over time, we will focus mostly on contemporary writers. Questions to consider will include: How has ethnic writing changed American culture and renovated forms of literary expression? What are the varieties and nuances of what we might call an ethnic subjectivity? What could it mean to harbor fugitives within the self: transgressive thoughts or a “foreign” identity? And what is the future of “ethnic” literature in a global space?",
  "topics": [
    "Humanities",
    "Literature",
    "American Literature",
    "Comparative Literature",
    "Creative Writing",
    "Criticism",
    "Fiction",
    "Humanities",
    "Literature",
    "American Literature",
    "Comparative Literature",
    "Creative Writing",
    "Criticism",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nTwo subjects in\nLiterature\nor\nHistory\n.\n\nDescription\n\nAlthough this class starts by critically examining the term \"ethnic\" as it defines a wide range of cultural forms over time, we will focus mostly on contemporary writers. Questions to consider will include: How has ethnic writing changed American culture and renovated forms of literary expression? What are the varieties and nuances of what we might call an ethnic subjectivity? What could it mean to harbor fugitives within the self: transgressive thoughts or a \"foreign\" identity? And what is the future of \"ethnic\" literature in a global space?\n\nThis seminar will address a number of authors: Dion Boucicault, Sandra Cisneros, Samuel Delany, Junot Diaz, Louise Erdrich, Mohsin Hamid, Mia Heavener, Brendan Jacob Jenkins, Mohja Kahf, Jhumpa Lahiri, Toni Morrison, Ruth Ozeki, and Art Spiegelman. Students will also have a chance to take advantage of the\nMELUS\n(Multi-Ethnic Literature of the United States) conference, sponsored by the Literature Section in April, 2017, which will bring writers and scholars of ethnic literature to MIT.\n\nRequired Texts\n\nJacobs-Jenkins, Branden.\nAn Octoroon\n. Dramatist's Play Service, 2015. ISBN: 9780822232261.\n\nMorrison, Toni.\nJazz\n. Reprint edition. Vintage, 2004. ISBN: 9781400076215.\n\nDiaz, Junot.\nThe Brief Wondrous Life of Oscar Wao\n. Reprint edition. Riverhead Books, 2008. ISBN: 9781594483295. [Preview with\nGoogle Books\n]\n\nSpiegelman, Art.\nMaus: A Survivor's Tale\n. Box set edition. Pantheon, 1993. ISBN: 9780679748403.\n\nCisneros, Sandra.\nThe House on Mango Street\n. Vintage, 1991. ISBN: 9780679734772.\n\nLahiri, Jhumpa.\nUnaccustomed Earth\n. Reprint edition. Vintage, 2009. ISBN: 978030727825.\n\nKahf, Mohja.\nThe Girl in the Tangerine Scarf\n. PublicAffairs, 2006. ISBN: 9780786715190.\n\nDelany, Samuel R.\nStars in My Pocket Like Grains of Sand\n. 20th edition. Wesleyan, 2004. ISBN: 9780819567147. [Preview with\nGoogle Books\n]\n\nErdrich, Louise.\nThe Round House\n. Reprint edition. Harper Perennial, 2013. ISBN: 9780062065254. [Preview with\nGoogle Books\n]\n\nHamid, Mohsin.\nThe Reluctant Fundamentalist\n. Harvest Books, 2008. ISBN: 9780156034029.\n\nOzeki, Ruth.\nA Tale for the Time Being\n. Penguin Books, 2013. ISBN: 9780143124870. [Preview with\nGoogle Books\n]\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nEssay 1\n\n15%\n\nEssay 2\n\n15%\n\nEssay 3\n\n30%\n\nMELUS Conference Report/Project\n\n15%\n\nParticipation\n\n25%\n\nDisclosure\n\nYou may find material in the readings for this class disturbing. These texts include racial and sexual violence, offensive language, cruelty, and human suffering. I cannot predict what material may affect someone experiencing stress or what will upset people for other reasons. If you are concerned or uncertain about this course, please review the course materials and decide whether you want to continue taking it.",
  "files": []
}