{
  "course_name": "Ethnicity and Race in World Politics",
  "course_description": "Discerning the ethnic and racial dimensions of politics is considered by some indispensable to understanding contemporary world politics. This course seeks to answer fundamental questions about racial and ethnic politics. To begin, what are the bases of ethnic and racial identities? What accounts for political mobilization based upon such identities? What are the political claims and goals of such mobilization and is conflict between groups and/or with government forces inevitable? How do ethnic and racial identities intersect with other identities, such as gender and class, which are themselves the sources of social, political, and economic cleavages? Finally, how are domestic ethnic/racial politics connected to international human rights? To answer these questions, the course begins with an introduction to dominant theoretical approaches to racial and ethnic identity. The course then considers these approaches in light of current events in Africa, Asia, Latin America, Europe, and the United States.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Political Science",
    "International Relations",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Political Science",
    "International Relations",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nDiscerning the ethnic and racial dimensions of politics is considered by some indispensable to understanding contemporary world politics. This course seeks to answer fundamental questions about racial and ethnic politics. To begin, what are the bases of ethnic and racial identities? What accounts for political mobilization based upon such identities? What are the political claims and goals of such mobilization and is conflict between groups and/or with government forces inevitable? How do ethnic and racial identities intersect with other identities, such as gender and class, which are themselves the sources of social, political, and economic cleavages? Finally, how are domestic ethnic/racial politics connected to international human rights? To answer these questions, the course begins with an introduction to dominant theoretical approaches to racial and ethnic identity. The course then considers these approaches in light of current events in Africa, Asia, Latin America, Europe, and the United States.\n\nCourse Requirements\n\nRegular attendance, completion of all reading assignments, and consistent class participation are required of all students. Written requirements include two (5-7 page), double spaced analytic essays and one final (7-10 page) essay. Topics for essays will be distributed by the instructor. Final grades will be determined as follows:\n\nActivities\n\npercentages\n\nClass and Participation\n\n20%\n\nTwo Essays\n\n50%\n\nFinal Paper\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "essay2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/f6356c556dac7d11c0e1082281de94a4_essay2.pdf",
      "content": "Mikala Streeter\n17.523 Essay 2: American Poverty\n\nThe United States is a country with vast diversity. Americans have a wide range of\nopinions, personalities, and cultures, and differ in socioeconomic status and how this\nmanifests itself in everyday life. It is the responsibility of the U.S. government to create\npolicy for this diverse group of people. Policymakers can either decide to write policy that\nbenefits one specific group or to write policy that benefits everyone. Social activists have\nstudied the benefits of both for many years and made arguments for both sides. In my\nopinion, the more successful policy is one that benefits people of all socioeconomic groups\nbecause it will gain wider support since more people benefit, allowing it to last longer and\nhave a better chance to improve the life chances of poor black people living in American\nurban centers.\nWilliam Julius Wilson, author of When Work Disappears and The Truly\nDisadvantaged, suggests a framework of long-term and immediate solutions to help poor\npeople. His long-term solutions place emphasis on the \"the relationship between\nemployment and education and family support systems, and in the metropolitan context,\nthe relationship between the cities and the suburbs\" (Wilson, 208). Wilson suggests an\nimproved educational system and more interaction between the cities and the suburbs as\nspecific long-term solutions. His immediate solutions aim to \"either revise current\nprograms or create new programs to decrease joblessness among disadvantaged adults\"\n(Wilson, 208). He recommends job placement centers as a specific immediate solution.\n\nIn When Work Disappears, Wilson offers the educational systems of industrial\ndemocracies like Japan and Germany as models for the U.S. Their policies established a\nperformance standard for students to meet before they can graduate from secondary school.\nThis policy increased the number of workers with \"higher-order thinking skills,\" meaning\nthey are better prepared, regardless of their socioeconomic background, to compete in the\njob market and be successful in technical training schools and other kinds of postsecondary\neducation. By creating a national standard for education in the U.S., the government would\nbe forced to assess the quality of struggling public schools and develop programs, such as\nteacher development and equal allotment of resources, to help them improve. With these\nprograms, students, regardless of race or class, would ideally have more equal access to a\ngood education, which would lead to better preparation and more opportunities after\ngraduation for jobs and postsecondary education.\nIn my opinion, this idea is not guaranteed to be successful. President Bush's \"No\nChild Left Behind\" policy attempted to set national standards for public education by\noffering more funding to schools as a reward for doing well in reference to certain criteria\n(e.g. graduation rate) established by the government. This policy has been largely\nunsuccessful in improving the public school system because it does not offer struggling\nschools any support to improve. The success of this idea depends on implementation,\nmeaning whether or not the government creates a support system for all schools to improve\nand maintain success.\nWilson also suggests that by increasing the interaction between suburbs and cities,\nthe life chances of poor black people living in American urban centers can be improved.\nHe suggests that the U.S. do this by restoring the federal contribution to the city budget\n\nand increasing the employment opportunities. This would help because by increasing the\ncity budget, public transportation to the suburbs could be improved and more businesses\ncould be brought to the city. These improvements would create more employment\nopportunities, helping poor neighborhoods become financially stable. According to\nWilson, there is evidence that cities and suburbs are economically interdependent. Without\na thriving urban center, the surrounding suburbs will, over time, experience a decline in\ngrowth and financial stability. Without access to the surrounding suburbs, people living in\nurban centers will have greatly decreased employment opportunities, which will eventually\nlead to increased poverty and financial instability.\nI agree with this idea because Washington, D.C. is an example of how cooperation\nbetween the suburbs and cities affects the two. The positive side can be seen when looking\nat the thousands of people who commute to the city every day in cars and public\ntransportation to get to work. For the most part, the places where these commuters live and\nthe areas where they work are thriving financially. The negative side can be seen when\nlooking at the areas of Washington, D.C. where there is very minimal public transportation\nand very few businesses. These areas and the immediately surrounding suburbs are not\nthriving financially and are largely comprised of low-income families. Interaction between\nsuburbs and cities is beneficial for both areas and improves the life chances of poor black\npeople living in American urban centers.\nAs an immediate solution, he suggests the creation of job placement centers that get\npotential employees \"job-ready.\" Job placement centers would be beneficial because\nemployers would be confident that these candidates \"understand and appreciate employer\nexpectations such as showing up for work on time and on a regular basis, accepting the\n\norders of supervisors, and so on\" (Wilson, 224). Having job placement centers in the inner\ncity would also help improve the informal job information network that is meant to keep\npeople informed of job openings not advertised publicly, but that is lost as more and more\npeople in a community lose work.\nI agree with this idea because it would help eliminate assumptions the employer\nmight have about the candidates from the job placement centers. Interviewing with\nsomeone who has not already assumed negative things about a candidate's abilities would\nimprove that person's chances of getting and maintaining a job. This success would benefit\nthe candidate and the candidate's community, by helping support the informal job network.\n\nWilson has many good suggestions for how to solve the many problems faced by\npoor blacks in America's urban centers. Many of them, if implemented in a way that the\npoor and non-poor benefited, would be successful. It is important though that the programs\nare implemented in a way that allows them to benefit the poor and the non-poor, because,\nin the last century, it has been seen that universally-targeted programs are much more\nsuccessful (i.e. they last longer and impact more people) than programs targeted at poor\npeople.\nThe War on Poverty is an example of a targeted antipoverty program that was\nlargely unsuccessful and not well received by the public. Started in the early 1960s, the\nWar on Poverty was a series of programs targeted at helping poor people become more\nfinancially stable. The programs included Food Stamps, Medicaid, housing subsidies, and\nAid to Families with Dependent Children. According to American's Hidden Success, a\nstudy by John Schwarz, \"economic expansion between 1965 and 1972 lifted out of poverty\nonly about one-tenth of the 21.3 percent of Americans who were below the poverty line in\n\n1965. Government programs, on the other hand, lifted above the poverty line more than\nhalf of the remaining number\" (Skocpol, 3). While these programs succeeded in helping\nmany poor people, they could not maintain broad support among non-poor Americans,\nnamely politicians. Presidents Johnson, Nixon, and Reagan successively cut funding for\nthese social programs, largely as a result of political attacks from angry Democratic\nleaders. They did not want to support programs supported by people, mostly Democrats,\nwho were hostile towards their administration. By the 1970s, public opinion had\nsignificantly decreased for government aid to minorities and public social programs.\nSupport especially decreased for programs stigmatized as being targeted at poor blacks.\nThe War on Poverty failed because the majority of the country saw it not as a benefit, but\nas a burden, in that they paid taxes to support the programs but saw no personal reward.\nOn the other hand, universally-targeted programs have been much more successful.\nOne such example is the Civil War veteran's benefits policy. Between the 1870s and early\n1900s, veterans' pensions, disability, and survivors' benefits were given out on a large\nscale to men who could prove that they had served in the Union army. According to\n\"Social Policy: Fighting Poverty without Poverty Programs\" by Theda Skocpol, by 1910,\napproximately 29 percent of American men over age 65 received benefits. While there\nwere ethnic differences in the distribution of the benefits (i.e. pensions went to native-born\nNortherners and northern and central Europeans who had come to the North before the\n1860s, and not to blacks and southern and eastern European immigrants who had fought\nfor the Union army), the veterans that did receive benefits ran the gamut of class, from\nthose who were economically disadvantaged to those who had been successful during their\nworking lives. Participation in this program was seen as honorable by veterans and non-\n\nveterans alike, and received support from both the Republican and Democratic parties. At\nthe height of its success, Civil War benefits reached more than 90 percent of surviving\nveterans. This universally-targeted program was successful because it benefited the\nadvantaged and disadvantaged, gaining it support from people of different socioeconomic\nbackgrounds and political affiliations.\nSocial programs that benefit people of different classes and ethnicities have been\nseen in recent history to be much more successful than programs specifically targeted at\npoor people. This occurs because more people, namely policymakers, can \"positively\nrelate\" to the purpose of and need for the program. Needs, such as veteran benefits, child\nsupport, job training, and child-care assistance, that affect advantaged and disadvantaged\nAmericans are universal and can be understood by people of all different backgrounds.\nUniversally-targeted programs benefit people of all classes and races, gaining them broader\nsupport and a better chance to improve the life chances of poor black people living in\nAmerican urban centers.\n\nWorks Cited\n\nSkocpol, Theda. \"Sustainable Social Policy: Fighting Poverty without Poverty Programs.\"\nThe American Prospect. June 23, 1990.\nWilson, William Julius. When Work Disappears. New York: Vintage Books, 1996."
    },
    {
      "category": "Resource",
      "title": "o_l02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/71f2d2d95dff30098947a0c22a0594c2_o_l02.pdf",
      "content": "17.523 / Lecture Notes\n\nRETHINKING ETHNICITY AND RACE\n\nI.\nHOW HAVE RACIAL AND ETHNIC IDENTITIES BEEN UNDERSTOOD AND USED?\nA. Variously used by different professionals. Author James Shreeve\nprovides an example from the forensic sciences. \"Age, sex, stature,\nand race are the cardinal points of a preliminary forensic report,\nthe cornerstones that support the reconstruction\nof a specific human identity.\"\n1 But of the four, race is\nmost subject to interpretation and contestation.\n\n1. Medical anthropologists and other medical professionals\nuse the term race to organize data and to analyze such data.\nThere are studies, then, that purport to show differences in\nsusceptibility to disease between races. [But what are these\ndata really showing? For example, the high incidence of high\nblood pressure among African-Americans or high alcoholism\nrates among Native-Americans?\n\nAren't these data really telling us as much about socio-economic\nstatus and environmental conditions as about a purported \"racial\nsusceptibility?\n\nII.\nWHAT IS RACE?\n\nA. General Consensus that we are all members of the same species:\n\nHomo sapiens.\n1. Shreeve offers this rough definition: \"race is the part\nof one's -person's variation on the theme of humanity\ncreated by the interplay of geography and inheritance.\nB. Historically, anthropologists viewed concepts of races as\nfixed types, each of which was pure and distinct. [As such, a\nperson of any given race would be taken as \"representative\" of\nthat race, since each race had its own characteristics. Think of\nLinnaeus and Blumenbach.]\n1. The idea of \"cluster of physical characteristics\" and\n\"bushel- basket\" scheme still exist when we think about the\nshared physical characteristics that generally, but not\ncompletely, correlate to geography.\n2. \"The straightforward biological fact of human variation\nis that there are no traits that are inherently, inevitably\nassociated with one another. Morphological features do vary\nfrom region to region, but they do so independently, not in\npackaged sets.\"\nC. But is it \"silly,\" as one biological anthropologist has argued,\nto suggest, that there are no races?\nD. There are human morphological (structure, form) differences and\nsimilarities, to be sure, but is \"race\" the right word to use?\nE. According to a study conducted by geneticist Richard Lewontin\nof Harvard, approximately 6% of human variation can be attributed\nto \"race.\"\nF. Here's a more recent attempt to define race provided by a\nleading researcher in the Human Genome Project, Luigi Luca\nCavalli-Sforza: \"A race is a group of individuals that we can\nrecognize as biologically different from others. To be\nscientifically \"recognized,\" the differences between a population\nthat we would like to call a race and neighboring populations must\nbe statistically significant according to some defined criteria.\n\n1 James Shreeve, \"Terms of Estrangement,\" Discover, November 1994, p.57.\n2 Ibid, p.58.\n\nThe threshold of statistical significance is arbitrary. The\nprobability of reaching significance for a given distance\nincreases steadily with the number of individuals and genes\ntested.\"\n\nIII.\nA HISTORICAL CASE: BLUMENBACH'S BLUNDER\nA. Blumenbach, one of the greatest and most honored scientists of\nthe Enlightenment, developed taxonomy of the human races.\n1. His \"final taxonomy of 1795 divided all humans into five\ngroups, defined by both by geography and appearance - in his\norder, the Caucasian variety, for the light-skinned people\nof Europe and adjacent parts of Asia and Africa; the\nMongolian variety, for most other inhabitants of Asia,\nincluding China and Japan, the Ethiopian variety, for the\ndark-skinned people of Africa; the American variety, for\nmost native populations of the New World; and the Malay\nvariety, for the Polynesians and Melanesians of the Pacific\nand the Aborigines of Australia.\"\n2. Blumenbach taxonomy was based largely on an earlier one\ncreated by Carolus Linnaeus (Systema Naturae) in 1758.\nHowever, the Linnaeus' taxonomy had 4 races, while\nBlumenbach's had five. According to Gould, this slight\nalteration had huge ramifications.\nB. The most significant difference is that Blumenbach introduced\na notion of hierarchy, according to Gould. The idea of races\nprovided by Linnaeus corresponded to the conventional cartography\nof the day.\n1. Blumenbach's alteration changed the axis of \"races\" from\nconventional cartography to another axis that included\nhierarchy although B was one of the more \"progressive\"\nthinkers of his time on the idea of race. He, for example,\nbelieved in the unity of the human species. He also believed\nin the relative superficiality of racial variation.\nC. Nonetheless, Blumenbach's taxonomy also \"singled out a\nparticular group as closest to the created ideal and then\ncharacterized all groups by relative degrees of departure from\nthis archetypal standard. He ended up with a system that placed a\nsingle race at the pinnacle, then envisioned two symmetrical lines\nof departure away from this ideal toward greater and greater\ndegeneration.\"\n5 Beauty was the criterion that Blumenbach used to\nmake his judgments re: degeneration.\n\nThe key point is that race, as it has been widely and historically\ndeployed, has not been limited to physical appearance. Values are\nassigned and evaluations made about an individual's moral character,\nintelligence, and temperament, based upon membership in one group or\nanother.\n\n3 Luigi Luca Cavalli-Sforza, Genes, Peoples, and Languages, (Berkeley:\nUniversity of California Press, 2000), p.5.\n4 Stephen Jay Gould, \"The Geometer of Race,\" Discover, November 1994,\np.66.\n5 Ibid, p.69."
    },
    {
      "category": "Resource",
      "title": "o_l03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/570d008a036bcd4db7e613b5e1e73d47_o_l03.pdf",
      "content": "17.523 / Lecture Notes\n\nI.\nWhat is Symbolic Ethnicity?\n-- Prevalent among third and fourth generation European immigrants.\nAccording to Herbert Gans, it is a way of being \"ethnic\" through\nsymbols, but not necessarily by joining ethnic organizations or by\nliving in ethnic enclaves.\n\na. \"Straight-Line Theory\": ethnic identification decreases\nover successive generations, resulting in acculturation and\nthen assimilation.\nb. \"Symbolic ethnicity\" is what is left after substantive\nties have disappeared.\n\nII.\nQuestions that the \"Symbolic Ethnicity\" idea raises:\n\n-- What are the implications for politics by this notion of\n\nsymbolic ethnicity. Why should political scientists care?\n\na. Ethnic Bloc Voting\n\nb. Support or opposition to public policies.(e.g. welfare,\n\naffirmative action).\n\nc. Residential Housing patterns\n\nd. Public Education policies\n\ne. Foreign policy lobbying by domestic ethnic groups\n-- Does the idea of \"SE\" hold for all immigrant groups, especially,\namong post-1965 immigrants?\n-- How well does \"SE\" hold up for the study of 4\nth generation\nEuropean-American immigrants?\n-- How does this idea of symbolic ethnicity hold up against the\nidea of race? At several points, Gans writes that new immigrant\ngroups are not only new ethnic groups, but \"non-white\" racial\ngroups as well. What difference does race make in the experience\nof these new groups?\n-- What role does technology play in sustaining symbolic ethnicity? On\none level, it appears that an ethnic group does not even have to be\npresent in order for \"SE\" to exist and persist."
    },
    {
      "category": "Resource",
      "title": "l_04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/f6d61d210541ecb8f7c5ad7fba9b73bb_l_04.pdf",
      "content": "17.523: Ethnicity and Race in World Politics--Fall 2005\nProf. M. Nobles\nLecture 4: Ethnic and Racial Identities in Comparative Perspective\nClare Kim Reading\n- Field of Racial Positions=partially a hierarchy, but it's not one dimensional.\nNotion of insiders and outsiders.\n- Kim defined Asian-Americans as \"foreigners.\" Why are they considered\nforeigners while blacks are considered insiders?\no Asian-AmericansÆForeigners\nFor most of the 19th century Asian-Americans weren't allowed to\nparticipate in the political arena (civic liberties, voting, etc.)\nThey weren't considered citizens because of their immigrant\nstatus.\no BlacksÆInsiders.\nVery important to the labor market (ex: California)\nConsidered insiders. Did not have full rights as citizens after the\nCivil War.\n- 1882 Chinese Exclusion Act\no First time U.S. adopted policy to exclude people based on race. People\nhad been excluded in the past, but it was based on status, wealth, etc.\no Asians were disallowed to become naturalized citizens until 1952.\n- How would you modify the graph?\no Move blacks to the left.\n- How were immigrants from the main axis powers treated differently (Italian,\nGerman, Japanese)?\no Japanese formed JALC (Japanese American League of Citizens) to show\nthey were Americans.\no Some German-Americans openly sympathized with Nazis.\nWorld Politics - Horowitz Reading\n- Focuses on politics in Asia and Africa\n- Ethnic identities are based on familial arrangements\n- A familial arrangement means that a person is biased towards his/her own family\nbecause of obligation.\n- Ethnicity allows you to extend the circle beyond immediate/extended family.\n- Familial arrangements imply that you identify your family by similarities in\nphysical appearance. Physical marker is used to \"letting people in.\"\n- People sometimes talk in kinship terms to imply that you connect with them by\nblood.\n- What are the positives of enjoying a familial arrangement?\no Support\no Favoritism\no Unity\no Identity\n- Associations that exhibit these notions of blood are fraternities.\n\n- Is ethnic identity involuntary like \"blood connections\"?\no Can you marry into an ethnicity?\no Naturalization of ethnicity? (adopt ethnicity by living in a country)\n- Is being born into ethnicity more secure than assimilating into it?\no Have the vulnerability of being seen as a traitor. Sometimes even if\nyou're born into the ethnicity.\n- Punchline of ethnic membership\no Has elements of birth and choice.\n- Other uses of ethnicity\no Can assist transition in going from say rural area to a large city\no MarriageÆ transactions in society can be facilitated by ethnic names\no Growth of an ethnic partyÆ Elites want to organize a party along ethnic\nlines\nETHNICITY CAN SUBSUME HOW PEOPLE VIEW THEIR CLASS INTERESTS."
    },
    {
      "category": "Resource",
      "title": "o_l04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/588a3c864da61094f7ff6d511d3dae26_o_l04.pdf",
      "content": "ETHNIC AND RACIAL IDENTITIES IN COMPARATIVE PERSPECTIVE\n\nI. Gans - \"Symbolic Ethnicity\" - Using the experiences of white ethnic\ngroups in the U.S., Gans argues that by the 3\nrd generation, white ethnics\nadapt a symbolic ethnicity. It is one of convenience and of little cost\n(economic or social). It does not organize life in any meaningful way.\na. What about \"white\" identity? What identity do these\nethnic groups hold on to?\nb. What distinguishes these groups from non-white ethnic\ngroups?\nc. Gans argues that prior theorists were wrong. There is no\n\"straight line\" to assimilation, but rather than some\nethnicity is retained.\nd. Assimilation into \"American-ness\" which is implicitly\nwhite.\n\nII. Kim - \"Racial Triangulation\" Between Whites, Blacks, and Asians.\nWhere Gans says nothing about \"whiteness\" as a powerful supra-identity\ninto which European ethnics entered, Kim's article is based upon the\nidea of white dominance and manipulation. That is, whites manipulate and\noccupy a \"field of racial positions,\" where they play Asians and Blacks\noff against one another, while degrading both.\na. Kim judges this idea of racial triangulation to be have\nbeen successful politically.\nb. Civic Ostracism - Never fully American, always foreign in\nsome way.\nc. Asians as the \"Model Minority\" vis-a-vis Blacks.\n\nIII. Horowitz - Ethnic Identities are best thought of as familial\narrangements. Ethnic identities and affiliations in Asia and Africa are\nstronger than in the West where there are cross-cutting cleavages. In\nAsia and Africa, societies are typically divided along one ethnic\ncleavage.\na. Ethnicity is a kinship connection, although it is best\nthought of as existing along a continuum, from birth to\nchoice.\nb. Yet Horowitz also claims that it permeates all of civic\nlife and interactions.\n\nEthnic affiliations exist along a continuum of ways in which people\norganize and categorize themselves.\n\nVoluntary Membership --------------------------> Membership by Birth\n\nOften times, these two extremes are not mutually exclusive, although\nthey would appear to be. For example, voluntary social clubs often times\ndecide membership based on one's origins. Both principles of membership\n- birth and choice - are capable of accommodating fictive elements.\n\nDefinition of Ethnicity: Extended Kinship (terms such as brother,\ncousins, etc. are employed). The ethnic tie is simultaneously suffused\nwith overtones of familial duty and laden with depths of familial\nemotion.\n\nUses of Ethnicity (or EI as function):\n1. Assists transition from rural to urban areas.\n2. Marriage choices are constrained and presented.\n3. All types of transactions outside of the home are facilitated by\nethnic ties.\n\nProcesses of Ethnic Fusion and Fission:\n\nWhether one or the other of these occurs depends on the political\ncontext.\n1. Under colonialism - The establishing of colonial boundaries (both\nterritorial, administrative, and social) can result in either subgroup\namalgamation or aggregation/dis-aggregation.\n\nChanges in ethnic boundaries and the appearance of organized efforts can\nproduce corresponding changes in culture:\n1. Myths of common ancestry emerge or disappear\n2. Music and other cultural practices reflect the new ethnic order of\neither aggregation or dis-aggregation.\n3. Similarly the case with literature and folklore.\n\nThe Utility of Ethnic Affiliations:\n\n1. They help in the negotiation of social and business transactions.\n2. Emotional support and meaning producing.\n\nEthnicity and the Modern State:\n\n1. Electoral Politics - Ethnic Parties\n2. Can liberalism (individualism) work or be meaningful in highly\ndivided societies.\n\nEthnicity and Class:\n\n1. Ethnic affiliations - Should they be viewed as just another way for\neconomic and political elites to advance their own individual and class\ninterests under the guise of the group."
    },
    {
      "category": "Resource",
      "title": "o_l4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/a30c57ff3e026ae81cd14da4541612d0_o_l4.pdf",
      "content": "17.523 / Lecture Notes\n\nFrom Jack Donnelly, International Human Rights\n\nTHE EMERGENCE OF INTERNATIONAL HUMAN RIGHTS\n\nI.\nMain Issues:\n\nA. State Sovereignty vs. Intervention: In the 19\nth and early 20\nth\ncenturies, violation of human rights of a country's nationals\nwere not considered a matter of diplomatic concern. One\nimportant exception: International Opposition to Slavery.\nCongress of Vienna in 1815 - Major powers recognized an\nobligation to abolish the slave trade.\n\nB. W.W.II constitutes an important turning point. Specifically,\nThe Holocaust.\n\nA. How was the International Human Rights Regime created?\n\n1. Nuremberg War Crimes Trials (1945-1946). Nazis were\nprosecuted under the then novel charge of Crimes Against\nHumanity.\n2. The United Nations - Its preamble for its Charter\nspecifically mentions \"Human Rights.\" The UN has been the\nmain international institution dedicated to elaborating\ninternational human rights standards.\n3. December 10, 1948 - UN General Assembly unanimously\nadopted the Universal Declaration of Human Rights.\n4. Advent of the Cold War - Flagrant disregard of Human\nRights by both the U.S, and Soviet Union.\n\nB. Decolonization and the entry of African and Asian countries\ninto the UN. Greater progress made on the ratification of a H.R.\ntreaty. December 1966 - International Human Rights Covenants\nwere finally completed.\n\n1, International Covenant on Economic, Social, and Cultural\nRights.\n2. International Covenant on Civil and Political Rights\n3. Universal Declaration of Rights.\n\nAll three together comprise the International Bill of Human\nRights. Existence of international covenants does not mean\nthat they are being implemented.\n\nC. In the 1970s, UN began to put monitoring mechanisms into place,\nthrough the passage of resolutions. Also in the 1970s, the rise\nof international NGOs. HR Committee within the UN established\nin 1976.\n\nF. HR are only as important as the sovereign states view and\ntreat them. (States can make them a part of its foreign policy.\nFor example, President Carter in the late 1970s.)\n\nG. What are the Strengths and Weaknesses of NGOs?\n\n1. Strengths - Organizational independence; Lobby for\nchange; Publicity and persuasion.\n2. Weaknesses - Non-binding; Credibility can be severely\ndamaged if found to be dealing in inaccurate information.\nTheir currency is accurate (and neglected) information.\n\nH. 1980s and 1990s - The deepening of International HR norms and\nissues as legitimate concerns of states and the international\ncommunity such that now Humanitarian intervention is seen as a\nlegitimate and sometimes preferred option. (UN peace keeping\nforces, care for refugees.)\n\nGeneral Timeline: The emergence of International Human Norms (1940s) ---\nÆ Cold War and Convenants (1950 and 1960s) ------Æ Monitoring in\n1970s ---Æ Further growth and Institutionalization (1980s) ------Æ\nContinuity and Change in the Post-Cold War Era (1990s - Present)\n\nII. Theories of Human Rights:\n\nThe nature of HR - Universal rights possessed by every human being. They\nare equal rights in that every human being has them equally and may\nclaim them irrespective of which country s/he lives. HR are moral rights\nas well in that they presume a shared notion of a \"good life\" and\n\"acceptable\" behavior. They typically do not include the right to murder,\nflat out, as a HR.\n\nRights as entitlements - They are exercised and typically trump all\ncompeting claims. Rights holders versus duty bearers. Human rights\nprovide a moral standard of national political legitimacy.\n\nHuman Rights based on some notion of human nature. But what's that? Most\nbroadly, a moral account of human possibility.\n\nMarxists: Human nature is the result of historical processes and esp.\nclass struggle.\n\nRadical Behaviorists: Human nature is the result of social conditioning.\n\nUtilitarianism - Principle of utility - Greatest happiness principle\nrequires us to act so as to maximize the balance of pleasure over pain.\n\nMoral and political theories that stress particularity are likely to be\nat odds with theories of universality.\n\nKant's \"categorical imperative:\" The duty to treat people as ends, never\nas means only. This imperative is categorical, without exception. A list\nof human rights can be seen as a political specification of what it\nmeans to treat all human beings as ends.\n\nIn the end, although there may appear to be a political consensus, there\nis no philosophical consensus about human rights."
    },
    {
      "category": "Resource",
      "title": "l_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/582cafb6a4706d98e0766cab0c819025_l_05.pdf",
      "content": "17.523: Ethnicity and Race in World Politics-Fall 2005\nProf. M. Nobles\nLecture 5: What are the Political Dimensions of Ethnicity and Race?\nRecent and Current Examples of Ethnic Conflict\n- Bosnia\n- Somalia\n- Former Yugoslavia\n- Iraq\n- Sudan (In the news a lot this summer)\nPolitical Autonomy\n- Defined as wanting some freedoms, but not full secession from the country. (e.g\nthe Kurds)\n- Typically means greater local control with less central control\n- Autonomy is sometimes seen as a precursor to independence and secession\n(Example, Southern states of U.S. wanted to secede. South claimed to be\nexercising and protecting states rights.)\nAs an example, what do minority indigenous groups of the United States want?\n- Recognition and protection of their culture\n- Autonomy and not independence because they depend on U.S. protection\n- Native Americans are an indigenous group with a structure governing system.\n- Trying to maintain their cultures because they can't undo the settling of others on\ntheir land\n- Canada and New Zealand have also worked out substantial political autonomy\nwith their respective indigenous population.\nOne tactic of war is ethnic cleansing where one group forces out another.\n- Genocide is an extreme form of ethnic cleansing and that is eliminating a group\nby killing them.\n- In these cases, the oppressive group tends to use some time of propaganda\nmachine to dehumanize the other group in order to justify killings.\no Nazis did it to the Jews in Germany.\no The Hutus did it to the Tutsis in Rwanda.\n- Ethnic cleansing requires the dehumanization to rationalize the killing of another\ngroup of people.\nNorthern Ireland\n- Unionists (Protestants) vs. Nationalists(Catholics)\n- Unionists supported staying in the UK and the Nationalists want to become part\nof the Republic of Ireland.\n- This conflict is organized along religious lines\n- Ireland is independent and mostly Catholic\n- IRA waged war on the U.K. for years\n- IRA finally put down arms to settle and entered into peace talks recently\n- Unionists have a slight majority in Northern Ireland\n\nKashmir\n- India and Pakistani both claim and want to control this region.\nPan Groups\n- United by virtue of the fact that they are a particular ethnicity\n- Are typically unsuccessful in securing long term political goals.\n- Encounter nationalistic interests\n- Diverse interests due to the fact that a particular ethnicity resides in multiple\ncountries"
    },
    {
      "category": "Resource",
      "title": "o_l05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/8acf75d5054e2e3b7709467127e8bed2_o_l05.pdf",
      "content": "17.523 / Lecture Notes\n\nETHNIC AND RACIAL IDENTITIES IN COMPARATIVE PERSPECTIVE\n\nI. From Ethnic Conflict in World Politics - Gurr and Harff\n\nChapter One: Ethnic Conflict and the Changing World Order\n\nA. Contemporary Examples of Ethnopolitical Conflict - What are\nthe desired outcomes of Ethnopolitical mobilization?\n1.Autonomy or Independence: Sometimes autonomy can be an end\nin itself or it can be seen as a means to the end of\n\nIndependence. What is desired is informed, in part, by\n\nexisting constraints and opportunities.\n\na. East Timor - Autonomy, maybe independence\n\nb. South Africa - Independence\n\nc. Indigenous populations in the US, Canada, and\n\nAustralia,\n\n2. Civil Wars - When groups within an existing or\ndisintegrating country fight violently to obtain their\ndesired ends.\n\na. \"Ethnic cleansing\" is a common tactic of conflict.\n\nb. Genocide is an extreme form of warfare.\n\nc. Revolution - Complete overthrow of political system.\nUsually has a strong political ideological component, but\nethnic dimensions are usually present at well, even if not\nup front.\n\nB. Defining and Mapping the World of Ethnic Groups.\n\n1. Identity groups is Gurr's preferred term.\na. Fighting against Discrimination (Economic and\nPolitical)\n\nb. Nationalists - Want their own State\n\nc. Protracted Communal Conflicts (Northern Ireland,\n\nSouthern Sudan, etc.)\nd. Sometimes, \"Pan\" groups have developed to fight for\na common cause, if not against a common foe. (Pan-Arab,\nPan-Indigenous, Pan-African)\n\nC. The Timing of Ethnic Conflicts\n\n1. The End of Colonialism - The beginning of wars as\n\ncountries' won independence and had to redistribute\n\npolitical, economic, and public goods. The conflicts either\nhappened in societies where there was a clear majority/\nminority (e.g. India, Nigeria, Rwanda) or in Angola, where\ngroups were more evenly distributed.\n2. The End of the Cold War - With the ending of proxy\nregimes that had the backing of the U.S. or USSR, state\npower decreases, and war begins. Example: USSR, Ethiopia,\nAngola, Former Yugoslavia.\n3. Some ethnic conflicts are neither directly connected to\nthe end of Colonialism or the Cold War, but have more to do\nw/ the political ambitions/greed of domestic political\nelites.\n\nChapter Two: The World of Ethnopolitical Groups\n\nA. The World Historical Background to Contemporary Ethnic\nConflicts\n\n1. Stratified Societies - Stratified along ethnic lines in\n\npost-colonial world. Ethnic groups that were privileged\nunder\ncolonialism\nusually\nattempt\nto\nmaintain\ntheir\nprivileges upon independence.\n\na. New World Slavery\n\nb. Removal/ Extermination of Indigenous Populations\nIn short, colonialism, slavery, and conquest have all left their\nimprint on contemporary politics, in that the stratification that\n\ncontinues to see has deep historical roots.\n\nB. The Types of Groups and their Grievances: (These groups are not\nalways mutually exclusive.\n1. \"Ethnonationalists\" - We Want Our Own State (Basques in\nSpain)\n\n2. \"Indigenous Groups\" - We Want Our Land and Autonomy Back\n3. \"Communal Contenders\" - Political aim is to share power\nin the central gov't of modern states.\n4. \"Ethnoclasses\" - are ethnically or culturally distinct\nminorities who occupy distinct social strata and have\nspecialized economic roles in the societies in which they\nnow live. Most ethnoclasses in advanced industrial societies\nare composed of descendants of slaves or immigrants who were\nbrought in to do the hard and menial work the dominant\ngroups would not perform (e.g. Lebanese in Africa, Turks in\nGermany, etc.)\n5. Sometimes, the relationships b/ween indigenous groups and\nethnoclasses can overlap. For example, Indians in Fiji.\n6. \"Visible Minorities\" - People who can not easily fit in.\nFor example, Somali in Norway and the Netherlands.\n7. Dominant Minorities - Tutsi in Burundi, White Afrikaaners\nof South Africa.\n8. Politically Active Religious Minorities\n\nC. Matching the Types with the Cases\n1. Ethnonationalists - Their demands pose the greatest\ndilemma for states and the international system; they are\nthe source of some of the most deadly and protracted\nconflicts of the last 50 years. (The Kurds in Iraq).\n2. Communal Contenders- Groups seek a place in the existing\nstates. (The Chinese in Malaysia).\n3. Ethnoclasses - Turks in Germany. Usually, their demands\nand actions are not a major threat to regional or\ninternational security, but they are a matter of political\nconcern, both nationally and internationally.\n4.Indigenous groups - The Miskito of Nicaragua. They demand\nautonomy, based on their claims as the original inhabitants\nor owners of the land."
    },
    {
      "category": "Resource",
      "title": "l_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/8980d5d22535af205b9081026b2ffef3_l_06.pdf",
      "content": "17.523: Ethnicity and Race in World Politics-Fall 2005\nProf. M. Nobles\nLecture 6: What are the Political Dimensions of Ethnicity and Race? (Contd.)\nKurds and Nicaragua\n- First chapter, Kurds and Miskito Indians.\no Both want autonomy\no Kurds\nBook provides history with a focus on the Ottoman Empire.\nWho are the Kurds?\n- They see themselves as a national group.\n- They speak a shared language, but there are also different\ndialects.\n- Most are Muslims.\n- Perceive themselves as having a history of hardship.\n- In general, there is the myth of shared origins.\nOttoman Empire was large.\n- People were members of the Empire, and were organized\nalong religious lines, not ethnic.\n- With dissolution of Empire after WWI, Allied Powers\nbroke it up.\n- Turks wanted their own state. Didn't want to share it with\nKurds.\n- Second treaty in 1923 (Treaty of Lausanne) set out present\nday boundaries.\n- Made it impossible for the establishment an independent\nKurdish state.\nPunchline\n- Kurds lost. Didn't get what they wanted. Kurdish\nnationalists feel entitled to an independent state because\nthe Treaty of Sevres originally provided for one, but the\nTreaty of Lausanne was the one that was actually put into\neffect and didn't allow for an independent Kurdistan.\n- Turkey, Iraq, and Syria got what they wantedÆindependent\ncountry.\nIf Kurdistan was established, Turkey would lose land.\n- Kurds see themselves as losing out on an opportunity.\n- This situation resulted in a political circumstance that can\nalso help strengthen Kurdish identity. It has the potential to\nbuild up a sense of historical grievance.\nA large international interest exists in the region because of oil.\nWhat has happened to the Kurds in Turkey?\n- Turkey rejects the existence of a Kurdish identity.\n-1-\n\n- Turks force a policy of assimilation up until the late 1980s\n-early 1990s.\no Kurds couldn't claim that they were Kurds (called\nmountain Turks), they weren't allowed to speak the\nlanguage.\no The denial of identity undercuts any claims to\nindependence.\nThings got better for the Kurds in the 90s\n- Turkey wants to enter EU\n- It is speculated by some that the EU has been hesitant\nbecause of the majority of Turks are Muslim. The EU is\npredominately Christian and Turkey is Muslim. EU has not\nbluntly rejected Turkey for this reason, but it is speculated.\n- Turkey's desire to get into the EU has forced it to address\nits treatment of the Kurds.\n- EU wants to see a more multicultural Turkey that shows\naccommodation of its Kurdish minority.\nWhat would explain the reticence of some Turkish officials to\nbetter treatment of Kurds?\n- Recognition of Kurds could lead to separation of Kurds\nfrom Turkish population, adds fuel to a separatist\nmovement.\n- A challenge to Turkish nationalism and national identity.\nShould governments be fearful of potential separatism?\n- Student: nationalism is very important. It's probably not\npossible to crush a nationalist movement, and it has a high\nprice.\n- Student: long term, it won't help to crush separatism\nmovements. It works for the short-term.\n- Student: Make the minority happy, and they won't have a\nreason to want a separate state.\nPrior to Iraqi war, the real carrot for Turkey was entry into the EU\n- If Turkey could become more multicultural\nEverything changed with the Iraqi war\n- Iraq has a large Kurdish population and due to the\ninstability during war and post-war, the Kurds could\npotentially have their own independent country.\n- Not everyone is going to have the same view. The Kurds\nin Iraq may not be on board with everything as the Kurds in\nTurkey. And vice versa.\nPan identities are very difficult because different factions have\ndifferent agendas (e.g. Kurds in Iraq vs. Kurds in Turkey).\no Kurds in Iran\nKurds fought some in Iran for autonomy, but didn't seem as\ndetermined as in Turkey.\n-2-\n\n- Nicaragua, Central America\no Miskito Indians\nProtestant Religion\nLanguage: Indigenous Miskito\nPart of their distinctiveness is their connection with the British.\nColonized by protestants, not the Spaniards\nTheir region had been recognized by British.\nExercised a lot of political independence because British tolerated\nit.\nSpoke English.\no In 1894, Nicaragua was careful not to tread on the independence of the\nMiskito Indians.\no Miskito lands rich in lumber, and bananas and attractive to mining\ninterests\no Many American firms set up shop in that area, and people were exploited\nin the banana plantations.\no Many Miskito men especially worked on these plantations and in the\nmines. As a result of these jobs, many moved away from subsistence\nagriculture.\no In 1936-1979. Somoza family dictatorship rules by force\no U.S. supported him, in part, because he did not threaten U.S. economic\ninterests.\no Somoza family wanted some share of the region's wealth and made some\ninroads, but didn't threaten the U.S. hold. Also, didn't infringe on\npolitical autonomy of Miskitos.\no Somoza didn't have a bad reputation because he gave the Miskitos a\ncertain amount of political autonomy.\no Somoza overthrown in 1979 and left national treasury essentially\nbankrupt.\no Sandinistas come in.\nSeen as threat by U.S. (Reagan administration) because of Marxist\nideology.\nSandinistas wanted to institute populist policies\nPromoted people's revolution through land redistribution.\nRequired very active government intervention, including where the\nMiskitos lived.\nAt first there were good relations between Miskitos and\nSandinistas. Over time, buying in, meant selling out to the\nMiskitos Indians. Meant losing autonomy.\nWhen they thought the government was a threat, the Miskitos\npicked up arms.\nIt would have remained a small story if it hadn't have been for the\nCold War.\nThe Miskito Indians known as the Contras were supported by U.S.\nand the conflict escalated from a national issue to an international\nissue.\n-3-\n\no Could the Sandinistas have done something different?\nStudent: When bringing the country together as one, it's hard to\nunderstand a group's desire to do the complete opposite. It's\nmixed ideologies that were incompatible.\nStudent: need to look at the situations of the Sandinistas.\no Is there a difference between Turkey's treatment of the Kurds and the\nSandinistas treatment of the Miskitos?\nStudent: speculating, Sandinistas would team with Miskitos for a\ncommon good.\nThey were driven by notion to redistribute wealth more fairly than\nhad ever been done. They thought naively that the Miskitos would\nbe better off. Didn't take into account the ethnic identity of\nMiskitos or their desires.\nReagan said that by virtue of it being a revolution, the Sandinistas\ncoming to power was illegitimate. (They were not democratically\nelected.)\no \"Country of No Heroes\" reading\nNo one pays attention to Nicaragua anymore.\n- USSR dissolved\n- Cuba is adrift.\n- Threat of communist revolution in western hemisphere is\nno more.\n- Chinese in Malaysia\no Who are the main groups in Malaysia?\nMalays (46% based on survey in 90s)\n- Are considered Malaysia's indigenous peoples.\n- Survived by working the land. Agricultural people.\n- Didn't want to recognize British rule.\n- Politically loyal to local sultans\nChinese (32 %)\n- British brought them over for work.\n- Arrived during late 19th century along with Pakistani\n- Most came from south china.\n- There is an ethnic division of labor prior to WWI\no Malays are mostly in the agricultural sector, some\nin civil service\no Chinese were in public sector. Some in mines.\no\nChinese were loyal to British\nOthers: Pakistani (8%), other(2%)\no British content to rule indirectly.\no In 1948-early 1950s, known as \"the emergency\"\nAllowed for crackdown of Chinese who were members of the\ncommunist party\nDuring WWII, the communists and Chinese were main resistors of\nJapanese occupation of Malaysia.\n-4-\n\no Independence comes in 1957\nMalaysia's elite is comprised of Malay, Chinese and Indians\nThe political compromise: Indians and Chinese will submit to\nMalay political dominance and in return, there will be acceptance\nof Indian and Chinese cultures. Malays are to be deliberately\nadvantaged by certain public policies because they are indigenous.\nImportance.\n- Tacit agreement among elites, not popular agreement\n- Enshrined in Malay constitution.\no\nChinese democratic action party decided they didn't like this elite\nagreement.\nArgued for equal rights for all citizens.\nRiots ensued and were directed at Chinese.\n-5-"
    },
    {
      "category": "Resource",
      "title": "l_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/1a456d179cb313b7c55c78e40e8cb9bd_l_07.pdf",
      "content": "17.523: Ethnicity and Race in World Politics-Fall 2005\nProf. M. Nobles\nLecture 7: What are the Political Dimensions of Ethnicity and Race? (Contd.)\nKurds\n- How did the Turks arrive in Germany?\no Arrived as guest workers\no The idea was that they would be temporary\n- Why would the Turkish Government agree to this guest worker policy with\nGermany?\no Good Aspects\nTakes the pressure off of domestic politics in Turkey. The\neconomic state of Turkey wasn't very good at the time and it was\nbetter for many workers to go abroad.\nThe guest workers typically sent money back home\n- True in most immigrant situations. Latin America is\nanother example.\n- Money sent home seems to help a lot\n- But the problem is that this is inherently unequal because\nonly the people that go abroad can help their relatives at\nhome. Many in the home country do not benefit from\nguest worker policy because they do not have relatives that\nwork abroad.\no Bad Aspects\nWorkers are fairing well with the guest worker policy. They get\nmarried and have children in Germany.\nWorkers don't want to transplant kids and disrupt their lives to\nmove them back home.\nKids view themselves as German.\nWhat happens when the guest workers are concerned about kids\nlosing their culture?\n- Don't let the kids learn German\n- Start own schools\n- Send the kids to home country during summer\nKids consider themselves German, but weren't German citizens\nbecause of German citizenship policies\n- There are two main types of citizenship policies in the world.\no By birth (U.S. uses this policy). Being born in the country makes one a\ncitizen.\no By blood (Germany). Must prove German ancestry in order to become a\ncitizen. Naturalization policies are very strict. Must live there 7 years.\nGermany doesn't allow dual citizenship. Must renounce previous\ncountry's citizenship.\n- Why would a Turkish kid want to be a German Citizen?\no In order to vote.\no Already assimilated into society.\n-1-\n\no Without citizenship, doesn't have a political voice\no Student: The Turkish kid could be ostracized and signals being an\noutsider.\n- Germany's naturalization policies seem unfair.\no Extra high barrier for naturalization and ethnic Germans who desire to\ncome back to Germany after the collapse of the USSR could easily gain\nGerman citizenship.\n- What's good about having citizenship laws similar to Germany?\no Student: Having a culturally homogeneous view isn't good. Who's to\ndecide what the view should be?\no Student: Kids won't be able to identify with their home country if born in\na state that won't give them citizenship.\no Student: Part of your history is cut off.\n- Students asked what country has the best government and if they had to move,\nwhere would they move to and why?\no Student: Britain because it has a government most similar to the U.S. and\nalso has a stronger currency (Euro).\n- In general, the Turks faired well economically in Germany.\n- Turks didn't fair as well politically because they haven't been allowed to become\ncitizens.\n- Can't really determine how they have faired socially because experiences are so\nuneven depending on the area.\n- Why have Germans reacted poorly to the assimilation of Turks and others?\no Dissolution of U.S.S.R., and Eastern European communism put economic\npressure on Germany. Many Germans didn't want to take on more people\nto add to their economic pressure.\no Disintegration of Yugoslavia forced a lot of Eastern Europeans into\nWestern Europe. They saw Germany as a gateway to Western Europe.\nThere was a rise of violence against foreigners, but the government\nquickly and effectively handled the hate crimes because of Germany's\nstrong anti-hate crime legislation.\no Kurds in Iraq\n- Ottoman Empire=included these provinces: Baghdad, Basra, and Mosul. These\nprovinces entered WWI on the Central Power side (Germany and Austria\nHungary).\n- 1918--After defeat of Ottoman Empire, British forces occupied the territories of\nIraq, Palestine, Trans-Jordan, Syria, and Lebanon. These provinces became\nmodern day Iraq.\n- 1920-The treaty of Sevres provided for an independent Kurdistan. The treaty was\nnever implemented and Mustafa Kemal Ataturk came to power and wanted to\ncreate a unitary nation of northern Kurdistan and Turkey.\n- Kurdistan is the largest nation in the Middle East without its own state.\n- 1923--Turkey receives international recognition through the treaty of Lausanne.\n--British bring in Emir Faysal from Arabia and declared him the King of\nIraq. British installed a monarchy but he wasn't a party of any group. They did\nthis on purpose because he was an outsider to the inner conflicts of Iraq.\n-2-\n\n- 1932--Iraq becomes an independent state, although it wasn't really independent\nand was ruled by proxy by the British. British maintained internal military sites\nin Iraq.\n- 1958--Military coup overthrows the monarchy.\n- 1979--Saddam Hussein seizes power. Hussein is Sunni, which is the minority\ngroup in Iraq.\n- What did Hussein do to the Kurds,\no Gassed Kurdish villages in 1988 with nerve gas.\n- What is it about Iraqi history that fuels Kurdish nationalistic demands?\no The Kurds were actually promised an independent state. They feel like it\nwas something that was theirs and was wrongly taken away.\n-3-"
    },
    {
      "category": "Resource",
      "title": "l_08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-523-ethnicity-and-race-in-world-politics-fall-2005/4c94d8464c0504d22c79387e8c0bc05d_l_08.pdf",
      "content": "17.523: Ethnicity and Race in World Politics-Fall 2005\nProf. M. Nobles\nLecture 8: A Framework for Analysis of Ethnopolitical Mobilization\n- Essay topics out today\n- Read thru preamble of Iraq constitution that will be voted on Oct. 15th\no Sunnis, Shiites, and Kurds voted on a legislative council that drafted the\nconstitution.\no Sunnis are boycotting the constitution despite participating in the drafting.\no Sunnis claim that their demands weren't taken seriously.\no Constitution states that Islam is official religion\no No law may be passed that contradicts the religion\no Student: legislation according to Islam could be a concern\no Iraqis are equal under the law without discrimination against race, color,\netc.\no Student: how are they going to set up powers? Will it be like Iran? Not\nsure if there will be a fourth branch of government.\no Student: Women don't have rights in Arab culture. It's going to take a\nwhile to make changes to society while staying in the confines of the\ninterpretation of the Quran.\no Student: Saudi Arabia furthest right of all Arab countries in terms of\npatriarchal attitudes. Iraq not as far as Saudi Arabia.\no Student: Iraq can't be expected to tolerate different sexual orientations\nbecause it's still an issue here in the U.S. and Iraq definitely isn't at the\nsame point as the U.S.\no Brazil has a comprehensive constitution that lists every imaginable right\nbut it is not always enforced. There are limits to what a constitution can\ndo.\no Student: South after the Supreme Court decision to desegregate, however\ncontinued to segregate because it wasn't enforced. Will that happen in\nIraq?\no Why is Sunni non-participation/boycotting bad?\nStudent: a lot of the violence against the U.S. forces comes from\nSunnis or forces hired by the Sunnis.\nSunnis are experiencing status reversal. Enjoyed being on top\npolitically. Were associated with the ruling regime.\n- They do not want to be a permanent minority.\n- Do not want to be violently attacked.\nMany Sunnis are moderate, but they can't control the fighters, who\nwill likely not be on board politically with the \"new Iraqi.\"\nHow much is there a central control of power?\no Students need to follow current developments in Iraq.\n-1-\n\no Why is it important to students? (student responses)\nStudents are draft age\nNo support in the military for it.\nFinancially it affects our future.\nHave friends fighting in Iraq\nSouring U.S. relations with Europe. Important for economic\nreasons. Could affect pocket book indirectly.\nDraft still possible\nRecruitment is low.\no Why are Europeans against the U.S. involvement with Iraq\nStudent: Things were better economically under Saddam.\nHad guaranteed source of oil prior to war\nDestabilizing of the region\nViolating international law\nStudent: French disbelieve the U.S. justification of war and\nanything U.S. government says.\nStudent: In all fairness, the Europeans were the original\nimperialists.\nStudent: Feel like everyone has been lied to.\no Student: Hurricane Katrina revealed weaknesses in the U.S. It's weakened\nin its claims because life in the U.S. isn't so wonderful and who is the U.S.\nto force democracy on everyone else.\n- Ethnopolitical mobilization\no Thinking about why people organize around ethnicity, modernization\ntheory viewed ethnicity has vestiges of the past. Once people got better\njobs, cities urbanized, class identities would become more important.\nEthnic politics will disappear once class identity replaces ethnic identity.\no Politics would be more pluralistic and competitive. Elections won't look\nlike a census.\no The predictions of modernization theory didn't happen.\no Ethnic politics can still be seen in:\nDeveloped economies (U.S., western Europe.)\nDeveloping countries (becoming more prosperous, yet ethnic\npolitics persists).\n- Modernization theory failed. Why? Two competing explanations:\no One instrumental reason, people use ethnic identity to get what they want.\nWant rights, territory, economic advantages. Helps them mobilize a base.\nOR\no Ethnic identities are primordial. Deep cultural and psychological needs.\nEthnic conflict occurs sometimes when their identities are threatened.\nEthnic politics will persist as long as people view themselves in terms of\nethnicity.\n-2-\n\n- Seven internal factors make genocides happen (in book):\no Elites rely on repression to remain in power.\no Typically seen in authoritarian states.\no Elites use power to award groups deferentially. Elite manipulation.\no Exclusionary ideology--we're the best. You're an animal or sub-human.\no Elites are part of an ethnic minority.\no Country has recently undergone political upheaval and instability.\no State has weak political and economic links with other states, thereby\nmaking it easier for elites to shun international norms on human rights.\n-3-"
    }
  ]
}