{
  "course_name": "Ethnic and National Identity",
  "course_description": "An introduction to the cross-cultural study of ethnic and national identity. We examine the concept of social identity, and consider the ways in which gendered, linguistic, religious, and ethno-racial identity components interact. We explore the history of nationalism, including the emergence of the idea of the nation-state, as well as ethnic conflict, globalization, identity politics, and human rights.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis subject looks at the evolution of concepts about ethnic and national identity over time, in both social science and everyday life. We explore the history of notions about what constitutes a \"nation,\" in the sense of a \"people,\" looking at what the term meant prior to the European nation-state and imperial projects of the 19th and early 20th centuries, and at what it means in the present era of multiculturalism, post modernity, globalization, and transnational trends such as migration. We examine how both ethnic and nation-state nationalism create narratives about the past that are intended to address present-day problems. We also look at the related concepts of race, religion, gender, and culture, examining how each one entails the others. We also study how ethnic and national identity in the West are seen in terms of shared biological legacies, shared histories, and shared cultural content, conceived in terms of 1) shared patterns of behavior--music, dress, food styles, embodied habits (e.g., posture), etc., and 2) inner qualities such as character, personality, or talent. Language ideologies are also briefly discussed, with an emphasis on how linguistic features (lexicon, phonology) serve non-linguistic purposes, for instance, signaling ethnic or national identity.\n\nCriteria for HASS CI Subjects\n\nCommunication intensive subjects in the humanities, arts, and social sciences should require at least 20 pages of writing divided among 3-5 assignments. Of these 3-5 assignments, at least one should be revised and resubmitted. HASS CI subjects should further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation. In order to guarantee sufficient attention to student writing and substantial opportunity for oral expression, the maximum number of students per section in a HASS CI subject is 18, except in the case of a subject taught without sections (where the faculty member in charge is the only instructor). In that case, enrollments can rise to 25, if a writing fellow is attached to the subject.\n\nRequirements\n\nReadings\n\nStudents are expected to keep up with all assigned readings (approximately 150 pp. a week for the books; 100 pp. a week for articles).\n\nClass\n\nStudents must attend class and participate. Students who miss more than 3 classes will lose credit. Five videos/DVDs will be shown. The first class hour will be lecture, followed by 1/2 hour discussion.\n\nWeekly Reader Responses\n\nThese consist of a few sentences describing your reaction to one of the readings for that class session. Do not provide an analysis or summary; give us your response to it. These should take no more than 10 minutes to write. While these are not graded, they are required.\n\nPapers\n\nYou will write three papers, 7 or more pages (roughly 2000 words) each. You must rewrite the first two papers in light of the comments you receive. The revised draft is the version that will be graded. Rewriting the third paper is optional, but highly recommended.\n\nStudents will present their third paper in class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nWeekly reader responses and in-class participation\n\n10%\n\nPapers (3)\n\n30% each (total 90%)\n\nPlagiarism\n\nPlagiarism comes in two forms. The first involves using the words of a source, exactly or in very close paraphrase, without quotation marks. If you use the phrases from the original, you must use quotation marks. If you paraphrase, you must indicate the source, including page number(s). The second form involves taking ideas from a source without indicating the source. Although sanctions for plagiarism depend on its severity, failing the subject is a distinct possibility (I have failed students in the past).\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction to the Study of Ethnic and National Identity: The Stakes, and Why the Stakes Are So High\n\nEthnic Identity I\n\nEthnic Identity II\n\nEthnic Identity III: The Hui\n\nNation and Nationalism I\n\nVideo: The Master Race\n\nNation and Nationalism II\n\nEthnicity, state, Nation\n\nState, Nation, Culture\n\nCulture: Definitions\n\nFirst draft of first paper due\n\nEthnic Conflict I\n\nVideo: Gacaca\n\nEthnic Conflict II\n\nFirst paper returned with comments\n\nRace I\n\nRace II\n\nRevision of first paper due\n\nRace III\n\nVideo: Stolen Generations: Genocide and the Aborigines\n\nEthnic Identity, Nationalism and Gender\n\nFirst draft of second paper due\n\nEthnic Identity, State, and Sexuality\n\nReligion, Ethnicity, the Nation\n\nSecond paper handed back with comments\n\nLanguage and Culture, Ethnicity, Race\n\nCulture Recovery\n\nVideo: White Shamans and Plastic Medicine Men Final draft of second paper due\n\nCulture: Appropriations, Heritage, \"Selling Culture\"\n\nFirst draft of third paper due (optional)\n\nHuman Rights, Collective Rights\n\nNew Social Movements\n\nOptional first draft of third paper handed back with comments\n\nTransnationalism, Globalization and Culture\n\nThe State: Hegemony and Push-back\n\nThird paper due\n\nSumming Up\n\nVideo: Without Due Process: Japanese Americans and World War II\n\nStudent Reports\n\nStudent presentations\n\nStudent Reports (cont.)\n\nStudent presentations (cont.)",
  "files": [
    {
      "category": "Resource",
      "title": "MIT21A_226F11_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/9b2cd313755f073bfd7efdb76268eb15_MIT21A_226F11_rules.pdf",
      "content": "Joshua Cohen, 1999\nSOME RULES OF THUMB FOR WRITING PAPERS\nHere are a few suggestions about writing papers. Please read through them before you write\nthe first paper.\n1. State the main thesis of your paper at (or near) the beginning: say, in the first paragraph. It is not\nbad to say something like: \"I will argue that ....\"\n2. Stay focused. Your papers should critically assess some important aspect of one of the theories we\nhave been discussing. Before you get to the evaluation you will need to describe the relevant aspect\n(s) of the theory you are assessing. But do not try to provide a comprehensive overview of the theory.\nInstead, guide your presentation by the particular problems that animate your paper. For example, if\nyou are writing on John Rawls's \"difference principle,\" you should not try to sketch his theory of the\noriginal position and the argument for the principle within the original position. Confine yourself to\nthe aspects of Rawls's view that are of immediate relevance to his account of fair distribution.\nAnything else will be a distraction.\n3. Take the views you are discussing seriously. The political philosophers we are reading are not fools.\nIf, as you describe the relevant parts of their views, you find yourself attributing foolish views to them,\nassume you have misinterpreted. (Perhaps you have not. But treat \"misinterpretation\" as the default\nsetting.) Specifically, ask yourself how the philosopher you are criticizing would respond to your\ncriticism. Try to get \"inside\" the conception you are discussing; develop a sense of its internal\nintegrity, and see if you are able to understand how someone (other than a moron or a sociopath)\nmight have come to hold the views in question. The books and articles we are reading are the\nproduct of sustained reflection, over a long period, by very smart people. The authors often\ndistributed drafts of their manuscripts to other smart people, and then tried to incorporate responses\nto the objections they received. The result is not that their views are right, or genuinely coherent, or\nnice. But you can be sure that they have greater depth and coherence than one notices on first\nreading.\n4. No vague and sweeping generalities: \"Rawls's theory of justice is the most important recent\ncontribution to the perennial human search for the ideal society.\" \"Since Plato, philosophers have\nsought out the meaning of justice.\" \"For thousands of years, human beings have searched for truth.\n\"Philosophy is based on reason, not rhetoric.\" Such remarks add nothing; indeed, they subtract by\ndistracting from the issues at hand. Moreover, they suggest that the writer is looking for a way to fill\npages. Just get right to the point.\n5. Write clearly. That's easier said than done. But you can make a first step by writing short sentences,\navoiding page-long paragraphs, and being careful to signal transitions. Operationally: If a sentence\ngoes on for more than (say) 5 lines, find a way to divide it up; if a paragraph goes on for more than\n20 lines, find a way to divide it up; if one section of a paper seems disconnected from the previous\none, put in a sentence or two of connective tissue. Moreover, put things as simply as you can. Writing\nphilosophy does not require elaborate formulations, esoteric words, purple prose, neologisms, or\ninversions of the natural order of words. Your writing should draw the attention of readers to the\nideas you wish to express, not to the words you have chosen to express those ideas.\n6. Include some stylistic variety. For example, do not start every sentence with the subject. Moreover,\nstay away from passive constructions: instead of \"The wheel was invented by Joe,\" why not: \"Joe\n\nPage 2\nJustice, Fall 1999\ninvented the wheel.\" And don't have too many sentences that begin \"It is...\" or \"There is....\" Though\nsuch constructions are sometimes appropriate, overusing them slows things down.\n7. Support assertions. When you attribute views to the person whose ideas you are addressing,\nindicate the evidence for the attribution by noting relevant passages. But you need not include\nquotations. As a general matter, you should only quote a passage if the passage plays an important\nrole in the paper (say, it is a passage that you will want to be able to refer back to at various points in\nthe argument), or if you think that there is some controversy about whether the philosopher actually\nheld the view that you are attributing to him or her. Do not submit a paper that strings together lots\nof quotations.\n8. When you finish writing, read your paper out loud. If it does not sound right, it will not read right.\nApplying these rules of thumb will require that you spend some time editing your papers after writing\na first draft. But the additional time will be worth it. Your papers for this course will be better than\nthey would otherwise be, and you will eventually start to edit as you write.\n(Courtesy of Joshua Cohen. Used with permission.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_writing.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/bf185ab474ea77005a2f15efdc70b289_MIT21A_226F11_writing.pdf",
      "content": "Dear class,\nA few points about the writing assignments:\n1.\nPapers will be handed back one week after you hand them in, so if you ask for an\nextension, the entire process will be extended.\n2.\nYour revision is due a week after you get your first draft back. Some of you will\ndefinitely need to make an appointment with Nora Delaney, our Writing Advisor. Each\nstudent will need to meet with her at least once. I can also help with writing issues.\n3.\nA \"first draft\" of a paper does NOT mean that you can hand in a \"rough\" draft. It needs to\nbe as finished as you can possibly make it, which includes proper citations, date, title,\nnumbered pages (!!), correct spelling, logical structure, introduction and conclusions, etc.,\netc.\n4.\nIf you have questions about proper citation practice, consult any of our readings for\nexamples or send an email.\nAlso consult a document titled \"Integrating quotations into your writing\" is located under\n\"General\".\nAvoid long quotes. If you must include one, any quote that takes up more than 5 lines\nneeds to be indented. If indented, quotation marks are not needed (consult your readings\nfor examples). But far more preferable is to paraphrase, which is perfectly fine so long as\nyou cite your source. For example:\nJohnson notes that the quick brown fox jumped over the lazy poodle. He qualifies\nthis assertion, however, noting that colorless green ideas sleep peacefully (1987:\n16).\n5.\nCreate a reader in your mind and then write addressing that person. Your aunt Sue, your\nUncle Bob are good candidates. This imagined reader should be someone you have to\nexplain a fair amount to. Keeping that reader in mind will help you to include important\nbackground information. Do NOT write thinking of me or Chloe or Nora as your reader.\n6.\nConsult the following:\n\"Cohen's Rules of Thumb for Written Assignments\"\n\"How to Write a Paper,\" by Steve Van Evera (Courtesy of Stephen Van Evera. Used with permission.)\n\"Tips on grammar, punctuation, revising drafts, and citing sources\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_1_Intro_crs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/8e309d8b86150917c6965c68f6038395_MIT21A_226F11_1_Intro_crs.pdf",
      "content": "INTRODUCTION TO COURSE\n1 Housekeeping\na. Send around piece of paper; each of you should include:\ni. Name\nii. e‐mail\niii. year\niv. major\nv. previous anthropology or sociology courses?\nvi. why taking the course?\nb. All readings (except for books) will be posted\ni. Supplemental readings (related resources) are usually from the mass\nmedia\nii. If newspaper articles are posted for a particular class, they are optional\nreading--only the scholarly pieces are required\niii. Keep the supplemental readings (related resources) in mind as a resource\nwhen you're deciding on a paper topic\n2 Nature of the course\na. CI‐H and HASS‐D course\nb. HASS‐Ds are being phased out\nc. CI‐H: improve communication skills, especially writing\nd. The syllabus contains the specifics of the CI‐H component of the course\n3 Course requirements\na. No prerequisites\nb. Strong discussion component\nc. Basic format is 1 hour lecture, 1⁄2 hour discussion\nd. Lectures themselves are very interactive\ne. Study questions for the readings, designed to help guide class discussions, are on\nthe course webpage\nf. You'll be asked to answer these in class at random\ng. You'll be asked to bring discussion questions\nh. You'll be asked to work in groups and present your findings\ni. Written assignments are fairly easy\n4 Reading\na. As it says on the syllabus, you must do the reading\n5 Reader responses\na. Consisting of a few sentences, a paragraph, nothing you can't do in 5 minutes, after\ndoing the readings\nb. I've found these to be quite useful: students come much more prepared to discuss\nthe reading\nc. They must be reactions to the reading--not about the lectures, not your random\nthoughts about ethnicity not a synopsis of the reading\nd. Reader Responses can be about any of the reading for that week\ne. They're not graded\nf. They are required\n\n6 We will see five video/DVDs\n7 Intellectual Thrust of Course\na. Ethnic identity: we'll begin with a short overview (Eriksen) on ethnicity snd begin\nGladney--an easy book--as well as begin Nagel\nb. Note that some reading of a more theoretical, introductory nature will come later\nc. The syllabus may look like too much reading; it isn't\nd. Vast majority of readings are ethnography‐based rather than theoretical\ne. Introduce you to the wide range of societies out there\nf. We then begin to explore the anthropological perspective on national identity\ng. Have to first ask what nationalism is\ni. For example, is nation the same as country?\nh. What is national identity? How does it differ from ethnic identity?\ni. Note: throughout the course, the purpose of questions like this is not to\ndiscover the BEST definition of ethnic identity or nationalism\nii. In this respect, this course is not like your chemistry class, or other science\nand engineering courses\niii. The purpose of these questions is to get you to think about these concepts\nsystematically and comprehensively\niv. To explore the various meanings of the terms we use (all of them have\nseveral meanings)\nv. To better understand the political, historical, social context of the meanings\nvi. And become familiar with the idea that various meanings can co‐exist, each\none making a contribution to an analysis\nvii. The several meanings of a term are useful for different kinds of scholarly\nand political goals\ni. DISCUSS: how can you have a discussion in a course if all the words have several\nmeanings and there's no \"best\" meaning?\ni. By everyone agreeing that there are several meanings\nii. And understanding these several meanings to some extent\niii. And everyone agreeing on a particular meaning for purposes of discussion\nthat day\niv. We then move to some concepts related to ethnic and national identity\nv. Colonialism, empire, state, culture\nvi. For example, is \"state\" the same as \"nation\"?\nvii. And discuss how to define culture\nj. DISCUSS: your definition of culture?\ni. Then we'll look at ethnic conflict\nii. There are two main kinds:\n1. Conflict between ethnic groups\n2. And conflict between a state and an ethnic group within its\nboarders\niii. Gladney and Nagel address ethnic/state conflict\niv. In some ways ethnic conflict permeates the course\nv. Because it constantly calls attention to itself in our lives\n\nvi. In the newspapers, TV and because a fundamental premise in the social\nsciences holds:\n1. That you learn more about a subject\n2. By examining examples of malfunction, breakdown, too‐rapid\nchange\nvii. You'll learn less when studying cases where things are going well\n1. For example: do you want to know about marriage in the 17th\ncentury New England?\n2. Then study divorce in 17th century New England\nviii. We then look at the concept of race\n1. Which, like culture, informs ethnic and national identity\nix. We look at notions about biology\n1. Note that \"biology\" is a Western concept\n2. If we're looking at societies cross‐culturally\n3. Trying to understand their notions of \"race\"\n4. We have to first work to understand their notions about the\nmateriality of the body\n5. What they understand to be inheritance from one person to\nanother\n6. How they see physical relatedness between persons\nk. DISCUSS: Think about \"folk biology\" concepts you know about\ni. For example, \"blood.\" \"Race\" is one of those concepts that has many\nmeanings which have changed over time\n8 We will work to understand their history\n9 \"Nation,\" \"race\" had very different meanings earlier in the West\n10 Gender\n11 An important lesson in this course is that one identity component (class, gender,\nnationality, sexual orientation)\n12 Is always linked to the others--it never stands in isolation in the real world\n13 These identity components always co‐occur in individuals' identity\n14 Some pairs are seen by members of a given culture to always or usually co‐occur\n15 Concepts about race are gendered, etc.\n\n16 An example: Kath Weston found that for many people, in the U.S. Asian lesbians could\nnot be butch1\n17 DISCUSS: what does \"butch\" mean?\n18 Weston says that the construction of Asian women at present is such that an Asian\nlesbian trying to act working class, for example, by becoming a mechanic, look as\nmasculine as possible, will encounter more problems than will an African‐American\nwoman\n19 An Asian lesbian who wants to be \"butch\" will have to work harder to overcome the\nstereotype of \"petite, docile, oriental blossom,\" a femininity that's seen to inhere in\nAsian females\n20 We will read about another example: de la Cadena's essay titled \"Women are more\nIndian,\" about Andean Indians in Peru\n21 While it is useful to separate out these identity components during analysis\n22 After all, this is what analysis is\n23 Keep in mind that we can only isolate them during examination; no one is ever only a\nman, only an African‐American, only an Italian\n24 G.\nSexuality\n25 Same thing: we will read about how sexuality is raced, ethnicized, classed\n26 H.\nReligion\n27 We will pay particular attention to connections between religion and ethnic/national\nidentity--actual connections, or connections made in people's minds\n28 Islam: the Gladney book\n29 DISCUSS: Jewishness: religion, ethnicity, race--stereotypes about Jewish bodies?\n30 \"He doesn't look Jewish\"\n31 Jokes were made about African‐American movie actor Sammy Davis converting to\nJudaism not \"looking Jewish\"\n1 Weston, Kath, 1996. Render Me, Gender Me: Lesbians Talk Sex, Class, Color, Nation, Studmuffins... New York:\nColumbia University Press.\n\n32 Ethiopian Jews who moved to Israel: Falashi: \"black Jews\"\n33 They experienced racism, people had difficulty accepting them as truly Jewish\n34 Children of black/Jewish parents will say they felt they had to choose an identity--they\nweren't allowed to be both\n35 Like the Asian lesbian butch, these difficulties reveal stereotypes; what combinations of\nidentity components are permitted and which ones are not\n36 By the way, it's OK to speculate in this class, you just have to make sure you tell us that\nyou're speculating\n37 It's OK to talk about stereotypes, if you make it clear that this is what you're doing\n38 Then we move to language, culture and ethnicity\n39 We next look at current trends in scholarship on ethnic and national identity\n40 Transnationalism, globalization are stressed more\n41 Culture recovery movements--\"heritage\" initiatives\n42 An example is the \"Celtic revival\" in England, Scotland, Ireland, even in Brittany\n43 DISCUSS: other examples you can think of?\n44 We consider culture as commodity: issues surrounding \"appropriating\" culture, fears\nabout \"losing\" culture, \"enriching\" culture, \"recovering\" culture, \"selling\" culture\n45 We move on to \"rights\" movements, which are concerned with ensuring rights of all\nkinds\n46 Both the foundational assumptions of human rights, civil rights\n47 Out of the liberal philosophical tradition\n48 And the notion of collective and culture‐specific rights\n49 Then we move to identity politics, New Social Movements\n50 Mobilizing around identity components\n\n51 Examples: gender, indigeneity\n52 Religious mobilizing has been going on for a long time\n53 And transnationalism--diasporas, migration, refugees, globalization's effects\n54 Students will present their third papers at the end of the course\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_10_May_El_R.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/a5953aa47741ff7f01e3097052da2430_MIT21A_226F11_10_May_El_R.pdf",
      "content": "Study Questions on Maybury-Lewis 81-103 (Genocide)\nand Eller 195-241 (Rwanda and Burundi)\n1.\nCompare what Eller says about the shifting nature of the categorical designations \"Hutu\"\nand \"Tutsi\" to Gladney's analysis of the category \"Hui.\"\n2.\nDescribe the role played by European racial aesthetics and racism in the received wisdom\nregarding differences between the Hutu and the Tutsi.\n3.\nCompare and contrast the Rwandan genocide with the Third Reich's \"final solution.\"\n4.\nWhat did you know about the categories \"Hutu\" and \"Tutsi\" prior to reading Maybury\nLewis's and Eller's essays? What did you know about the genocide in Rwanda? In what\nways did these essays change your understanding of the situation?\n5.\nDiscuss the ethnogenesis of the Hutu and Tutsi categories as ethnic groups. What did\nthese categories mean prior to colonization? How did colonization change them? What\nhappened to them following independence, in particular what were the effects of\ninstituting democratic rule?\n6.\nOn p. 83, Maybury-Lewis discusses \"indirect rule\" (also see p. 212 of Eller). What does\nthis mean?\n7.\nWhat conclusions can we draw from the Rwanda and Burundi cases about the likelihood\nof ethnic conflict becoming seriously violent, to the point of genocide?\n8.\nDescribe the arguments made by Tutsi for why they should rule Rwanda (Eller, p. 226).\nDescribe those made by Hutu.\n9.\nEller says that Hutu and Tutsi were achieved statuses almost as much as they were\nascribed ones (p. 202). What do these terms mean? How did an individual or a family\nachieve one or the other status?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_11_El_Mal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/601d6584bb120a9e8b1bc3e762fba1a2_MIT21A_226F11_11_El_Mal.pdf",
      "content": "Study Questions on Eller 143-193 (Kurds); Malkki\n1.\nAccording to Eller, three conditions must be met before a group can be considered\na nation. What are they? (p. 144)\n2.\nEller cites another scholar, Izady, who states that \"Kurdish society remains\nheterogeneous in almost all those aspects that normally form the basis of an ethnic\nidentity...\" (in Eller, p. 144). What are these? How do the Kurds compare to the\nHui in this respect?\n3.\nEller says that some of the most traditional characteristics of Kurdish society are\nthe biggest impediments to being able to build themselves as a nation. What are\nthese?\n4.\nList the ways Kurdish nationalism differs from the vast majority of nationalist\nmovements.\n5.\nDescribe two examples of the Kurds manipulating the governments of countries\nthat contain Kurdish populations. Describe two examples where the Kurds were\nused as pawns by these states.\n6.\nOn p. 163 Eller says that \"in a certain sense\" the Kurdish tribal organization of\ntoday is a product of \"the state systems that overarched Kurdish society.\" How\nso? Compare to the case of the Hui.\n7.\nIraq, unlike Iran, has very little nationalist ideology. What are some of the\nconsequences for the Kurds living in these two countries?\n8.\n\"Of all the interests at work in Kurdistan, however, the most enduring and\npernicious is geopolitics.\" (p. 164). Give two examples.\n9.\nWhat does Malkki mean by \"National Geographic\"?\n10.\nHow \"rooted\" in land/territory/soil is our concept of culture? Give three examples\nof extremely \"rooted\" culture. And three examples of what we might call\n\"unrooted\" culture.\n11.\nDescribe the differences between the camp Hutu refugees and those of the town.\nWhat do the two groups--and the differences between them--tell us about\nculture? About nation? About ethnicity?\n12.\nMalkki makes a couple of points that are potentially upsetting to activists. Why,\ndo you think, would they be upset?\n\n13.\nNagel says that we tend to see Native Americans as \"rooted.\" Discuss, referring to\nMalkki's points.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_12_Race_I.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/2e39021a09b6d6f4afe34aab5846944f_MIT21A_226F11_12_Race_I.pdf",
      "content": "12: RACE I\nRead: Wade, Defining Race, 1-15; Existing Approaches to Race, 16-36; Historicising\nRacialized Natures, 37-68\nI.\nConceptions of race1\nA.\nRace is a social fact\n1.\nWade emphasizes that when studying the history of race, one always\nneeds to unpack the terms\n2.\nFor example, an earlier notion about racial type:\n3.\nSaw it as something not directly observable\n4.\nBut rather, seen to be an underlying essence, subject to all kinds of\nvariation in its observable manifestations\n5.\n\nDISCUSS: to what extent is this notion the opposite of current notions\nabout race?\nB.\nWe must pay careful attention to how such notions change\n1.\n\nWade discusses various notions about how a changing environment\ncreates 'fixed' qualities\n\na.\n\nContradiction\nb.\nE.g., God created humanity, but sometime in the remote past the\nraces were established\nc.\nSome people believed in polygenesis: distinct origins of the races\n2.\n\nHe cites Young:\na.\n\n\"The question is whether the old essentialising categories of\ncultural identity, or race, were really so essentialised, or have been\nretrospectively constructed as more fixed than they were. When\nwe look at the texts of racial theory, we find that they are in fact\ncontradictory, disruptive and already deconstructed.\"\nC.\nEarlier meanings of race included seeing it in terms of lineage\n1 The first part of this lecture follows Wade's exposition of race.\n\n1.\nAll the descendants of a given set of ancestors were members of a\ncommon stock\na.\n\nE.g., the race of Abraham\nD.\nThe meaning changed so that by the nineteenth-century the concept of race was a\nsystem for classifying types\n1.\nHumans were divided into a limited number of permanent racial types,\nsometimes seen as having distinct origins\n2.\n\nStatic, relatively unchanging--although keep in mind Wade's point about\ninternal contradictions challenging this notion of fixity\nII.\nToday:\nA.\nA typical definition of race: \"an interbreeding population whose members share a\ngreater number of traits with one another than they do with people outside the\ngroup\" (Ferraro)\n1.\nThe notion of unambiguous categories based on distinct sets of biological\nattributes and inferred distinct descents\n2.\nNote that establishing a boundary using this definition would be very\ndifficult\nIII.\nUnderlying premises of the social construct of race:\nA.\nFirst: biology determines behavior\n1.\nMany earlier racial schemes included traits we no longer consider to be\nphysically inherited--\"degeneracy,\" laziness, poverty\na.\n\nNote Wade's discussion of earlier \"racial\" classifications that\nallow for environmental influence, effects of culture\n2.\nCultural, moral, aesthetic traits were included as \"racial\" traits\na.\nThis continues, in a sense, today: Wade's points about \"cultural\nracism\"\n1)\n\nGood exercise: list all the \"racial\" traits that turn out to be\ncultural\n\n2)\nOne high school had a \"race war\" on its hands when white\ngirls decided to \"dress black\"\nb.\n\nSometimes traits described as \"ethnic\" are in fact being posited as\nracial, but the speaker doesn't want to appear racist\nB\nSecond underlying premise: Europeans are superior\nC.\nThird premise: race can be scientifically studied (note: only a few scientists today\nbelieve this)\n1.\nBy taking careful measurements\na.\nA good book by Harvard geneticist Stephen Jay Gould discusses\nthis premise: The Mismeasure of Man\n2.\nThey carefully measured hair color and texture, eye color and shape,\nthickness of lips, breadth of the nose, body stature, skin color\na.\nNext week we will see a video with an example of such\n\"scientific\" research projects\n\n1)\n\nStolen Generations\n\nb.\n\nDISCUSS: other examples you know about?\nD.\n\nProblems:\n1.\nFirst: depending on who was doing the categorizing, some racial\ntypologies had hundreds of categories while others had as few as three\na.\n\nThe familiar Mongoloid, Caucasoid, Negroid\n\n2.\n\nSecond: external traits traditionally used to classify and identify races\nwere found to not correlate well with other physical and biological traits\na.\nWhich are often useful markers of populations (e.g., the Diego\nfactor in blood type)\n3.\nThird: the various schemes differ depending on the traits on which they\nare based\na.\nAll the following derive, in part, from genetic inheritance\nb.\n\nSkin color\n\nc.\nBody stature--would produce very different \"racial\" categories\nd.\n\nHair color\ne.\n\nBlood type\nf.\n\nEarlobe structure\n4.\nFourth: variations occur not only within, but between breeding populations\na.\n\nMuch more variation within a given \"race\" than between races (if\nyour number of races is small)\n5.\nOur reactions to the idea of using some of these characteristics (using\nheight: \"silly\") demonstrate that races are social constructions\n\na.\n\nDISCUSS: Why not height?\n\nb.\n\nDISCUSS: those who have read Huxley's Brave New World: how\ndo the categories of people differ?\nIV.\nRace is a social construction, but what kind? Here is Wade's argument\nA.\nThe notion that races exist with definable physical characteristics\n1.\nAnd that some races are superior to others\n\n2.\n\nIs the result of particular historical processes\na.\n\nColonization by European powers\nB.\nWe can't even assume there is such a thing as the brute fact of phenotypical\nvariation\n1.\nWe can't stop at recognizing that races don't exist as objective biological\nentities\n2.\nAnd then reconstruct an objective basis for recognizing 'racial'\ndistinctions by grounding them in phenotype\n3.\nThis glosses over the problem that the apparently \"natural fact\" of\nphenotypical variation is itself socially constructed\nC.\nPhysical differences that have become cues for racial distinctions are quite\nparticular ones\n\n1.\nThey correspond to the geographical encounters of Europeans in their\ncolonial histories\n2.\n\nIt is specific combinations of skin color, hair type and facial features that\nhave been worked into racial signifiers\nD.\nPhenotype cannot be independent of history\n1.\nBecause only certain phenotypical variations become racial categories\na.\nThe ones that count do so because they have emerged through\nhistory\n2.\n\nThis is why height doesn't work as a race\na.\n\nHeight is important--and is a source of discrimination\n1)\nWhy Randy Newman's ironic song \"Short People\" evoked\nsuch outrage--he was on to something that people didn't\nwant to acknowledge\nb.\n\nBut height doesn't \"do\" what the social fact of race \"does\"--it\ncan't\n\nc.\n\nDISCUSS: what work--social, cultural, political, economic--\ndoes race do?\nE.\nConclusions: Racial classifications cannot be understood to be social\nconstructions elaborated on the basis of phenotypical variation\n1.\nBecause they do this using the particular aspects of phenotypical variation\nthat were worked into vital signifiers of difference\n2.\n\nDuring European colonial encounters with others\n3.\nThe study of race is part of that history, not outside it\nV.\nEXERCISE: before reading further, do this exercise with the current most prominent\nsignifier of race, skin color\nA.\nTake out a piece of paper and list all the ways skin color alone doesn't \"work\"--\nis not successful at this task\n1.\nS. Asians' skin color darker than many African-Americans\n2.\nMany African-Americans would be considered white in Nigeria\n\n3.\nExample of untranslatabililty of \"white\" into Spanish in Colombia\na.\nBlacks in the Vaupes where I did my fieldwork (on the equator and\non the border between Brazil and Colombia)\nb.\n\nWere called blancos (\"whites\")\nc.\nThe important divide there was between blancos and indigenas\n(\"Indians\")\nd.\nTo us, \"white\" signals skin color; clearly in the Vaupes its Spanish\ntranslation signaled \"non-Indian,\" and \"not from here,\" rather than\nskin color\n4.\nBrazilian use of \"white\" (Portuguese: branco) is also quite different from\nEnglish\n5.\nDifferent meanings of \"white\" at different moments in history\na.\n\nJews, Irish, Syrians were not \"white\" earlier in U.S. history\nB.\nShould we conclude that all these classificatory schemes are wrong and only ours\nis correct?\nVI.\nDifferences in racial classification systems around the world\nA.\nConstitute another set of evidence for a social constructionist explanation of race\n\n1.\n\nLike ours, these classifications derive from the type of colonial enterprise\nand sets of social relations that were established in each region\na.\nGandhi was called a \"nigger\"\n2.\nLook at the TV news: you will see Afghanis, Pakistanis, etc. who are\ndarker than many African Americans\n3.\nThe populations on opposite coasts of the Red Sea look completely alike,\nyet the African ones are classified as \"black\" and the Middle Eastern ones\nclassified as \"white\" (if one is using a threefold classification system)\n4.\n\nDISCUSS: any other examples?\n5.\nIn North America: category 'black' supposedly includes anyone with a\nknown 'drop of black blood'\n\na.\n\nNagel discusses how different this is from how one is assigned to\nthe category \"Indian,\" or \"Native American\"\n6.\nWhereas in Latin America racial classifications take the form of a\ncontinuum of racial categories\na.\nOften it is only people who look quite African in appearance who\nwill be identified as 'black''\nb.\nOther people are classed by a variety of terms denoting a position\nin between\nc.\nA Puerto Rican or Cuban may not be classed as black in their\ncountry, but might be in the U.S.\n1)\n\nNot to say racism doesn't exist in Puerto Rico or Cuba (just\nask any dark-skinned Puerto Rican or Cuban)\na)\nBut the system there is \"colorism,\" not our binary\nclassification system\nb)\n\nColorism exists in the U.S., too\nd.\nBrazil: the phrase \"money whitens\"\ne.\n\nAlso in Brazil \"A sua branqueza,\" \"your whiteness,\" may be said\nas a way of buttering someone up\n1)\nBoth notions sound silly in English\nf.\n\nSomeone poor who has light skin in Brazil will be perceived and\nclassified as darker than a comparably colored person who is rich\n1)\n\nAll kinds of studies have been done establishing this\n7.\nIn the U.S., race and class are correlated, but racial classification isn't\nchanged by class\na.\nPeople do pass, of course--a \"one-drop\" rule makes this quite\npossible\nb.\n\nAnd colorism results in lighter-skinned people being more likely to\nbe higher socioeconomically\nc.\nBut in Brazil colorism processes are labeled, are very explicit\n\nB.\nClearly, when used to refer to categories of people, \"black,\" no matter what the\nlanguage, has no simple universally applicable referent\n1.\nHow could it be possible to create an objective concept that's applicable\neverywhere?\n2.\n\nImpossible\na.\n\nNo matter what the terminology is (e.g., \"Negroid\"--sounds\nscientific, but simply derives from Spanish for \"black\")\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_12_Wade.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/60f22d0c1fa57916a8f35db1e0a7ec62_MIT21A_226F11_12_Wade.pdf",
      "content": "12 Questions on Wade 1-68\n1.\nWhat is your understanding of \"race\"?\n2.\nWhat was scientific racism? What components of this \"-ism\" remain today?\n3.\nGive three examples of racist ideologies in practice, either in the past or present-day.\nCompare them, noting the similarities and the differences.\n4.\nWhat do you think are useful features of the concept of \"race,\" if any?\n5.\nIf you do not believe there are any useful features of the concept of \"race,\" what are our\nalternatives for discussing biological variability among groups of people?\n6.\nWhat features of the concept of \"race\" are not useful?\n7.\nDescribe Wade's critique of \"race\" as a scientific notion.\n8.\nHow has the notion of \"race\" changed over time in the West?\n9.\nWade says that \"race\" is a social/historical construction. Defend this argument. Argue\nagainst it.\n10.\nDiscuss the differences between the word \"racist\" and the word \"racial.\"\n11.\n\"Now, if anthropologists know one thing, it is that conceptions of 'nature' are not self-\nevident.\" (p. 9) What does \"nature\" mean to you?\n12.\nRacism \"is an ideological construct which refers to a real social process of labeling and\ndiscrimination.\" (p. 17) Discuss.\n13.\nWade, discussing essentialism, asks, \"what is an essence\"? What is your understanding of\nessentialism? Is it \"biology\"?\n14.\nOutline Hirschfield's argument on pp. 32-33. Argue in favor of it. Critique it.\n15.\nPart of the force of racism \"lies in the ambiguous move between ideas of indelibility and\nideas of malleability.\" (p. 38) Discuss, providing one example of indelibility and one of\nmalleability.\n16.\nAre male and female absolutely clearly distinct? Argue in favor. In opposition.\n17.\nThe historian Laqueur wrote a book, Making Sex, in which he shows how the idea of sex\n(meaning the male/female distinction) developed. What was the earlier \"one-sex model\"?\n\n18.\n\"It is human nature to supersede nature.\" (p. 44) Does your notion of human nature\ncontain this paradox? Discuss.\n19.\nDescribe the eugenics movement. Do we have anything like it today?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_13_Race_II.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/3df271741afaa563344d6523a1d8b2eb_MIT21A_226F11_13_Race_II.pdf",
      "content": "13: Race II\nRead: Wade: Genetics and Kinship: The Interpenetration of Nature and Culture, 69-96; Race,\nNature and Culture, 97-111; Embodying Racialised Natures, 112-122\nI. Review: Race, racialization, racism\nA.\nRace is a social fact, not a biological one\n1.\n\nA social construction\n2.\nA very powerful social fact\nB.\nEven if we're not interested in the history of a concept, how its meanings evolved\n1.\nLearning about it can help us get some distance from the term's current,\ntaken-for-granted meaning and be able to analyze it\nC.\nWade provides a very thorough discussion of race, its links to \"nature\" (how\nreproduction was understood, notions about heredity, environmental influences)\nand culture\n1.\nIn particular the surprising variety of theories, both scholarly and in the\ngeneral public\nII.\nToday's meaning of race--components\nA.\nBiology determines behavior (at least in part)\nB.\nEuropeans are superior\nC.\nRace can be scientifically studied\nIII.\nA social construction, but what kind?\nA.\nWade's discussion of what kind of construction:\n1.\nThe modern idea that races exist, with definable physical characteristics,\nwith some superior to others\na.\n\nIs the result of particular historical processes:\nb.\n\nColonization by European powers\n\nB.\nIf race is a social construction, we can't assume that races don't exist as objective\nbiological entities BUT ARE grounded in phenotype\n1.\nThe \"natural fact\" of phenotypical variation is in itself socially constructed\n2.\nNot just any physical differences, only some have become cues for racial\ndistinctions\na.\n\nThese cues correspond to the geographical encounters of\nEuropeans in their colonial histories\n\n3.\n\nSpecific combinations of skin color, hair type and facial features that have\nbeen worked into racial signifiers\n4.\nOnly certain phenotypical variations become racial categories\na.\nThose that have emerged through history\nC.\nParticular aspects of phenotypical variation that have been worked into visual\nsignifiers of difference\n1.\nVital signifiers of difference\n2.\n\n\"Worked into\" for a reason--they work; they help achieve certain goals:\nsocial, cultural, political, economic\nD.\nCould height serve as a racial signifier?\n1.\nIt could, but it hasn't\n2.\n\nHeight IS a signifier, just not a racial one\na.\nCould it be a racial cue, somewhere? Sure.\nb.\n\nIt is in Brave New World\nE.\nOther phenotypical variations, more locally, have served as racial signifiers\n1.\nMy example of body hair\na.\nIn the U.S., body hair means certain things\nb.\n\nUnwanted in women\nc.\nIn Colombia, at least earlier, it racially signified European descent,\nand was desirable\n\nd.\nA racial cue resulting from European colonization\nF.\nWade is generalizing about racialization in the West, but always when you look at\nspecific cases there will be difference, elaborations\n1.\nColorism (Latin America) vs. categorical (U.S., apartheid South Africa)\n2.\n\nDifferences in language\n3.\nSpanish \"Raza\" not the same meaning as \"race\"--and both are polysemic\n4.\n\nExamples of difference\na.\n\nA saying in Brazilian Portuguese: \"money whitens,\"\nb.\nOr \"A sua branqueza\"--\"your whiteness\" in Portuguese\nc.\n\nBoth sound silly to us\n\nd.\n\nIn Brazil, someone poor with light skin will be perceived and\nclassified as darker\n1)\nMight be true here\nIV.\nRace in Japan1: a contrast with our system\nA.\nIn 1986 former Prime Minister Nakasone contrasted his country's supposed\nhomogeneity with the ethnically mixed U.S.\n1.\nSaid the homogeneity was responsible for Japan's success in international\nbusiness\n2.\nThe statement created an international furor\nB.\nAs a major industrial state, Japan is indeed relatively homogeneous\n1 Discussion of race in Japan follows C. Kottak, 1996. Mirror for Humanity: A Concise Introduction to Cultural\nAnthropology. New York: McGraw-Hill, Inc.: 61-65; and Barbara Hall, Burakumin--The Untouchable Caste of\nJapan,\n\n1.\nMost Japanese have strongly held opinions about Japanese being one race,\none people\n2.\nLinguistically, too (although some dialects of Japanese are mutually\nunintelligible)\n3.\nOnly 4%-10% of Japanese are minorities (sources differ)\na.\n\nBurakumin are the largest minority\n4.\nAssimilation of minorities happens, but has been discouraged\n\nC.\n\nThe minorities:\n1.\n\nAboriginal Ainu in the north\n2.\n\nAnnexed Okinawans\n3.\n\nImmigrant nationalities, mostly Koreans\n4.\nOutcaste Burakumin (who, unlike Koreans, are citizens)\na.\nThey number 2-4 million (sources vary)\nD.\n\nBurakumin\n1.\n\nHistory\na.\n\nPresent-day Burakumins' ancestors were outcasts\n1)\nWho did unclean jobs--animal slaughter, disposal of dead\n2)\nSimilar to India's Untouchables\n3)\nAssociation with impure materials, death, made them\nritually impure\n\n4)\nPolluting to others\n5)\nResidentially segregated, official lineage books made it\nimpossible to escape from the identity\nb.\nTheir origins are from a tiered system of stratification (Tokugawa\nperiod--[1603-1868])\n1)\n4 ranks: warrior, farmer, artisan and merchant\n\n2)\n\nAnd outcasts:\na)\nEta (Great Filth), earlier name for Burakumin\nb)\nAnd the Hinin (not human--criminals and survivors\nof suicide)\n\n3)\nNot human, not in the census, but yes registered by\ngovernment\n4)\nNot human, didn't have to pay taxes\n5)\nLife of 7 Etas was equal to that of one human being\n6)\nHad to wear 5\"x4\" rectangular pieces of cloth identifying\nthemselves as Eta\nc.\n\nMeiji Restoration (1868-1912) emancipated them, recognized their\nhumanness\n1)\nBut, although registers merged, Burakumin were called\n\"new commoners\"\nd.\n1926 Emperor Showa called them Dowa, \"same people\"\n1)\nBurakumin prefer \"Buraku\"\n2.\nAre physically and genetically indistinguishable from other Japanese\na.\nBut are seen to be racially different\n3.\nPresent-day notions about the content of difference\na.\n\nVirtually indistinguishable appearance, culture, religion\n\n1)\nSometimes slight speech differences\n2)\nBut mainly known through residence and family last name\na)\nOriginally had no family names, then were named\nafter their dwelling sites\n\nb)\nKristi Yamaguchi--means \"mouth of mountain\"\nc)\nShe's thought to be Buraku\n\nb.\n\nJapanese racial classifications include notions of what people like\nBurakumin or Koreans smell like\n1)\nBut note the built-in contradictions similar to Wade's\npoints about racial classifications being both fixed and\nflexible\n2)\nThese differences sometimes will be attributed by Japanese\nthemselves to non-genetic factors like diet and level of\ncleanliness\n\n3)\n\nNot some relatively immutable and long-standing\nseparation between the races\n\nc.\n\nDiscrimination mainly seems to stem from the association with\nancestors and their perceived difference\n4.\n\nPresent-day differences\na.\nSome job niches still hold (e.g., leather work, and Burakumin are\nmore likely to do manual work)\nb.\n\nSystematic ostracism accounts for some estimates that 70% of\nYakuza (Japanese mafia) are Burakumin\nc.\nLive mainly in Western Japan\nd.\n\n1974 Ministry of Health and Welfare forbade the practice of\nshowing family registry details, restricted access\ne.\nBut in 2 years nine lists from the registers were secretly sold at\nhigh prices to large companies and major banks\n1)\nSo they could identify them, reject job applications\nf.\nNo Burakumin are found in high government office: most are\nengaged in garbage collection and similar jobs\ng.\n\nGoogle Earth caused an uproar by overlaying old maps that\nhighlighted Burakumin neighborhoods\nh.\nIf Burakumin attend schools with majority Japanese, they will face\ndiscrimination\n1)\nSome people will refuse to eat with them\n\ni.\nMany of them \"pass\" as a majority Japanese person\n1)\nAs do some blacks in the U.S.\nj.\nBut if they marry a non Buraku Japanese and are discovered, a\ndivorce might take place\n1)\nMany Japanese hire marriage mediators to check out the\nfamily histories of prospective spouses\na)\n\nLooking especially for Burakumin\n5.\nMany outsiders don't know about Burakumin, many Japanese know very\nlittle\na.\nEmbarrassing if it comes up in conversation\n6.\n\nThe discrimination--attitudinal and institutional--is strikingly similar to\nwhat blacks face in U.S.\na.\n\nEven though there is no clear phenotypic difference\nb.\nNow in Japan, like the U.S., the discrimination is de facto rather\nthan de jure\n7.\nIn response to Burakumin political mobilization:\na.\nJapan has dismantled the legal structure of discrimination against\nthem\nb.\nAnd worked to improve conditions in their racially segregated\nneighborhoods (buraku)\n1)\n\nPoor sanitation, housing, etc.\n2)\nFor example, a Sports Day for Burakumin children was\nestablished\nV.\nKoreans in Japan\nA.\nDuring WW II more than 2 million Koreans were in Japan\n1.\nRecruited to replace Japanese farm workers\n\n2.\n70,000 to 200,000 women were forced to serve as \"comfort women,\"\nprostitutes for military forces\n3.\nMost had been repatriated to a divided Korea by 1952\n4.\nThose who remained were denied citizenship\n5.\nKoreans qualify for citizenship if resident for 3 years and one parent was\nborn in Japan\na.\n\nSome qualify for citizenship but choose not to take it\nb.\n\nResentful of earlier and continuing discrimination\nc.\n\nAnd many maintain strong ethnic ties, often residentially\n6.\nIf they do become citizens\na.\nThey are strongly encouraged to take a Japanese name\nb.\nA kind of semi-occult assimilation that helps maintain the ideology\nof Japanese homogeneity\nVI.\nThe valued group is the majority \"pure\" Japanese\nA.\nStrong feelings about \"same blood\"\n1.\nExample: a caption under a photo of a Japanese-American:\na.\n\"She was born in Japan but raised in Hawaii. Her nationality is\nAmerican but no foreign blood flows in her veins\"2\n\n2.\nChildren of mixed marriages may not get the same \"racial\" label\na.\nBut they are still stigmatized\nb.\nAs are Japanese who spend a long time away from Japan\n1)\nWhen they return, a process of reintegration must take\nplace\n2)\nChildren are sent to special schools3\n2 Jennifer Robertson, Koreans in Japan. Paper presented at U Michigan Dept. of Anthropology Jan. 1992. Cited in Kottak.\n3 See Merry White, 1988. The Japanese Educational Challenge: A Commitment to Children. New York: Free Press, 1987, and\nTokyo: Kodansha. Also in Japanese: Shueisha, 1992.\n\nB.\nAgain, built-in contradictions--the idiom of \"pure blood,\" which presumably\nremains in the body no matter what\n1.\n\nJapanese \"race\"\nC.\nAnother idiom: a notion of contamination from foreign influence\n1.\nThat must be cleansed, eliminated\na.\n\nNot permanently impure\n2.\n\nRemind you of Wade?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_13_Wade.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/309863842a882f0ffe496356b7869133_MIT21A_226F11_13_Wade.pdf",
      "content": "Study Questions on Wade 69-126\n1.\n\"The increase in genetic determinism is not as straightforward as it looks (p. 70). Discuss.\n2.\nDiscuss the way in which \"race\" is modeled on \"species.\" Then discuss the ways in\nwhich the two concepts do not map onto each other.\n3.\nDiscuss the ways new reproductive technologies challenge the traditional foundational\nassumptions about kinship (biological relatedness) in the West.\n4.\n\"...views posited a given, inherited, 'natural' biological substrate onto which was built an\noverlay of cultural/social characteristics, acquired through processes of 'nurture' or, more\nbroadly, from the 'environment'.\" (p. 73)\nIs this your view of the components of human nature? If not, how does yours\ndiffer?\n5.\nWade makes several arguments in this book. Choose one and discuss it.\n6.\nDiscuss Wade's outline of the differences between naturalizing, biologizing, and\ngeneticizing discourses.\n7.\nDescribe Schneider's \"order of nature\" and \"order of law\" analysis of U.S. \"everyday\"\nnotions of kinship (p. 79). Give an example of each. Does this scheme resemble how you\nthink about kinship?\n8.\nDescribe the \"nature-nurture\" distinction. What is your version?\n9.\nHow does the ethnographic material on adoption complicate any argument to the effect\nthat \"nature\" is more influential than \"nurture\"? How does it validate this hypothesized\nascendancy?\n10.\nWhat does the ethnographic literature on New Reproductive Technologies tell us about\nhow people using these technologies actually understand and negotiate the \"nature\nnurture\" divide?\n11.\n\"...it seems that culture is capable of producing human character and human relatedness\nthat, rather than being an overlay onto nature, competes on a level playing field with it.\"\n(p. 94) Give 3 examples.\n12.\nDescribe the 1996 Israeli law regarding surrogacy, formed through a dialogue between\nthe Orthodox Rabbinical Establishment and secular officials of the state (p. 106). What\nare the ways this law ensures the production of Orthodox, \"kosher\" babies in addition to\nthe transmission of Orthodox biogenetic material?\n\n13.\nList three possible ways race may become embodied, according to Wade. Include both\ncultural and biological components.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_14_Omi_Win.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/443dd468bad717a8b021e8d42e5b13a3_MIT21A_226F11_14_Omi_Win.pdf",
      "content": "QUESTIONS ON OMI & WINANT, AND HILL\n1.\nOmi and Winant state that race is now a preeminently political phenomenon (p. 126).\nDiscuss. Do you agree?\n2.\nOmi and Winant argue that \"race\" has no fixed meaning. Do you agree? Why do they\nsay this?\n3.\nWhat is hegemony (Omi and Winant, p. 127)? How can this concept help us understand\nracialization and racism?\n4.\nDiscuss Omi and Winant's notion of \"racial projects.\" What makes some racial projects\nracist and others not? Give an example of each.\n5.\nHill also talks about \"projects\" (pp 20-21). Compare to Omi and Winant's use of the\nword.\n6.\nWere the members of the association of black social workers who maintained that black\nchildren should only be adopted by black parents racist? Defend your position.\n7.\nWhat is an ideologue? Give one example.\n8.\nIs affirmative action an example of reverse racism? Defend your position.\n9.\nOmi and Winant differentiate between ideological and structural causes of racism (p. 134\nand previous discussion). Describe both concepts.\n10.\nWhat is the distinction between racial awareness and racial essentialism (Omi and Winant\np. 131)? What is essentialism? Give 3 examples of essentialism not related to race (if\nyou can, from our readings).\n11.\nOmi and Winant state (p. 130) that Bob Blauner has found that some non-white students\nmaintain that blacks cannot be racist. Defend this position using these students'\nargument. Critique it.\n12.\nDescribe Omi and Winant's \"racial formation\" theory. Link it to \"racial project.\"\n13.\nUse the concept of hegemony to discuss Hill's essay.\n14.\nHow do Omi and Winant differ from classic Marxist understandings of racism?\n15.\nIf someone perpetuates racism but is unaware of doing so, under what circumstances are\nthey racist? Under what circumstances are they not be racists? Provide an example of\nboth. Gold stars if you can do this using examples from Hill.\n\n16.\nWhat are the differences between the biological dimensions of sex/gender and those of\nrace? How does racism resemble sexism?\n17.\nWhy is the average household net worth of African Americans less than one-tenth of\nWhite households (Hill p. 3)?\n18.\nWhat does \"Jim Crow\" refer to?\n19.\nHow can a sociopolitical phenomenon have biological effects? Provide 3 examples.\n20.\nWhat is \"black exceptionalism\" (Hill, p. 16)?\n21.\nDescribe Foucault's use of \"discourse\" (Hill, p. 19).\n22.\nGive 5 examples of white privilege. Try to come up with unobvious ones.\n23.\nCounter-intuitively, the ten most racially segregated cities in the U.S. are in the North and\nthe ten most racially integrated cities are in the South. Having read Hill, discuss what\nproduced these patterns.\n24.\nGive 3 examples of actions that perpetuate racism yet are neither intentionally nor\nunconsciously racist.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_15_de_la_Cad.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/36edf7094f227a7d53f08d61abea2f5f_MIT21A_226F11_15_de_la_Cad.pdf",
      "content": "QUESTIONS ON DE LA CADENA AND SMITH\n1.\nDescribe the ideology that rigidly classifies people as \"Indian\" or \"mestizo\" in the part of\nPeru de la Cadena studied.\n2.\nWhat are the justifications for the gender inequality found in Chitapampa?\n3.\nWhat mechanisms maintain this system of gender inequality? Are there any similarities to\nother systems you know of?\n3.\nDuring the land reform period in Peru General Velasco saw to it that \"Indian\" was\nbanned from official discourse and replaced with \"peasant.\" Defend this decision.\nCritique it.\n4.\nDe la Cadena says that often in Chitapampa nowadays if one asks about the ethnic status\nof one or another villager, a common response is \"he is neither one nor the other; he is 'in\nprocess.'\" What does this mean? Could this happen in the U.S.?\n5.\nWe've all seen movies depicting North American Native Americans. We all grew up with\nstereotypes about Indians. Discuss the gendered aspects of these stereotypes.\n6.\nDiscuss Smith's notion of \"a pre-modern symbolics of blood.\"\n7.\nWhat are the advantages of analyzing race/class/gender together in a particular situation,\nas opposed to separately?\n8.\nIn what ways does De la Cadena's analysis agree with Smith's? How does it differ?\n9.\nSmith talks about \"creoles\" (for example, p. 57). What are they? This is a word with\nmany meanings; do you know another?\n10.\n\"Only women can bring bastards into the family\" (p. 56). What does this mean? Is it true\nin the U.S. (or, international students, in your country)?\n11.\nGuatemalan indigenous nationalists were attempting to construct a single and\nhomogeneous state, nation, and culture, using the Western discourse about them (p. 54).\nWhy was this project doomed?\n12.\n\"Chatterjee's argument suggests that in modern nationalist ideologies, whether European\nor non-European, the female will always come to stand for the spirit of the nation and the\nsite of its reproduction...\" (p. 55). Discuss.\n13.\nSmith argues that Guatemalan elites cannot create a unified Guatemalan nation. Why\nnot?\n\n14.\n\"As in much of Latin America, race is largely defined through culture rather than through\ndescent\" (p. 60). How can race be something cultural? Contrast this ideology with that\nfound in the U.S. Extra points if you can bring in Omi & Winant's discussion.\n15.\nSmith wants scholars to analyze female agency--their capacity to choose among options,\nand choose in accordance with their own interests. Discuss.\n16.\nSmith describes several benefits that accompany playing the role of traditional Maya\nwoman. What are they?\n17.\nSmith compares government policy during the Guatemalan civil war to the Nazis.\nDiscuss.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_226F11_15_Ethn_nat.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-226-ethnic-and-national-identity-fall-2011/031a2f558caa4016933efecf5145301c_MIT21A_226F11_15_Ethn_nat.pdf",
      "content": "Jean: get more images for the last part of this lecture, it was too short\n15 ETHNIC IDENTITY, NATIONALISM, AND GENDER\nRead: De la Cadena, Marisol, 1995, \"Women are more Indian\": Ethnicity and gender in a\ncommunity near Cuzco\nSmith, Carol, 1996. Race, class, gender ideology in Guatemala: modern and anti-modern\nforms\nI.\nIntroduction\nA\nWe have noted in class several times that class /ethnicity /race /nation /gender\n/sexuality intersect, are \"imbricated\"--conjoined, \"interact with and constrain one\nanother\"1\n\nB.\n\nNationality is gendered\nC.\n\nEthnicity is gendered\n1.\nDe la Cadena's case in Peru: \"individuals construct or contest their\nascribed ethnicity within specific social contexts of power and domination\nbased on class and gender inequalities\" (p. 331)\n2.\nRecall the reading by Schein: \"The Consumption of color and the politics\nof white skin in post-Mao China\"\n3.\n\nDISCUSS: other examples of gendered nation or gendered ethnicity you\ncan think of?\nII.\nGendering occurs at two levels: on-the-ground situations, and symbolically\nA.\n\"On-the-ground\" refers to how people actually live; their options, constraints,\ntheir material reality\n1.\nExample: limiting reproduction\na.\n\nExample of Slovenian program to promote sterilizing Gypsy\nwomen\nb.\nAttempt to limit births of the \"wrong\" nationality/ ethnic group\nc.\n\nOr the wrong race\n1 Smith, p. 51.\n\n1)\n\"Mississippi appendectomies\" performed on rural black\nwomen\n\n2)\n\nWere in fact sterilizations--outright deception\n2.\nAnd the opposite: attempts to increase births of members of the \"right\"\nnationality/ ethnic group/ race\na.\nPiece by Heng and Devan we'll read for the next class is about\nSingapore government's pro-natalist state policies directed at\nChinese women, but not Malays or South Asians\nb.\n\nRomania under Ceausescu , the last socialist dictator2\n\n1)\n\nWanted to increase birth rate\n2)\nContraception and abortion were basically not available\na)\n\nLike all E. European socialist countries, both\nwomen and men were expected to hold full-time\njobs; state services to help families with infants and\nsmall children inadequate\n3)\nConsequently many unwanted infants were left as\nfoundlings to be raised in state orphanages\n4)\n\nHorrible conditions; worse was their being given\ntransfusions of HIV-infected blood to \"strengthen\" them\nc.\n\nIsrael3\n\n1)\n\nThere are more fertility clinics per capita in Israel than in\nany other country in the world; world's highest per capita\nrate of in-vitro fertilization procedures\n2)\n\nFertility treatments are fully subsidized by Israeli national\nhealth insurance\n3)\nAvailable to all women, regardless of marital status\n4)\n\nGideon Levy's Ha'aretz article about state pro-natalism\n2 See Gail Kligman, 1998. The Politics of Duplicity: Controlling Reproduction in Ceausescu's Romania. Berkeley:\nUniversity of California Press.\n3 See Susan Martha Kahn, 2000. Reproducing Jews: A cultural account of assisted conception in Israel. Durham:\nDuke University Press.\n\nd.\n\nGreece\n1)\nHighest abortion rate in Europe (Russia's is higher)\na)\nUnlike Romania under Ceausescu, contraception\nand abortion readily available\n2)\nStudied by several scholars4\n\n3)\nDecision-making by both men and women was complicated\nby state policies and propaganda regarding the need to\nincrease the number of Greeks\n\na)\nPerceive Turkey to be a threat\nb)\nAnd Slavs to the north: the highly conflictive issue\nof Macedonia as Greek province and as a country\ne.\nPro-Russian policies in the USSR continue today\n1)\n\nOfficials had been quite concerned that in the near future\nethnic Russians would be a minority\n3.\n\nNote that states always have a stake in demographics\na.\nFor example, Japan is worried about a too-high proportion of older\npeople\n1)\n\nNot enough workers in the future\n2)\n\nNot enough stay-at-home wives to take care of increasing\nnumbers of elderly family members\nb.\nChina's one-child policy: a concern with too many people, period\n4.\nBut in this class we're concerned with a specific kind of state policy\nregarding demographics\na.\nHow to produce more of the \"right stuff\" and less of the \"wrong\nstuff\" in terms of specific categories of people\n1)\n\nWith respect to nationality, ethnicity, race\n4 Alexandra Halkias, 1998. Give birth for Greece! Abortion and nation in letters to the editor of the mainstream\nGreek press. Journal of Modern Greek Studies 16, no. 1: 111-138; also see Heather Paxson, 2004. Making Modern\nMothers: Ethics and Family Planning in Urban Greece. Berkeley: University of California Press.\n\n2)\nWe don't focus on attempts to limit reproduction in \"the\nwrong\" social class\na)\n\nBut ethnicity and race usually correlate with social\nclass\n\nb)\n\nHeng and Devan's piece you'll read for next Mon.\nshows that ethnicity in Singapore is classed\nc)\n\nBut clearly Singapore's policy is mostly intended to\nresult in more ethnic Chinese, not increase numbers\nof upper and middle class members\nB.\nSecond kind of gendering: symbolic\n1.\nWhat De la Cadena terms peoples' \"mental reality\"\n2.\nThe ideology says there's a fixed bipolar system that assigns people to one\nand only one category\na.\nBut there's also a \"fluid, protean, and contingent process by which\npeople attach ethnic labels to themselves or others\" (p. 331)\nb.\n\nThis benefits men\n3.\nWhat is the material reality of Chitapampa?\n4.\nPeru went through a land reform--redistribution of land\na.\n\nSuch that the original distinction between \"whites\" (those that had\nland) and \"indios\" (those who didn't), no longer applied\nb.\n\nBut the classification remained\n1)\nEvolved into a cultural one--a set of symbols\n\na)\nDISCUSS: what is a symbol?\n2)\n\nDress, language, certain skills\n\n3)\n\nRacism does exist in Peru\na)\nIn the sense of colorism\n\nb)\nBut most people are mestizos\n\nc.\nDe la Cadena speaks of \"cultural mestizaje\"\n1)\nAnd documents how women are indeed symbolically\n\"more Indian\"--in several negative senses\nd.\nWhat cultural--ideological, symbolic--processes keep women in\nthat inferior position?\n\n1)\nFamiliar notions about inferiority--women linked to\nchildren\n\n2)\n\"Weak\"\n3)\nSeen to not really \"work\"\n4)\nIdea that if they were to try to do \"real work,\" they'd do it\npoorly, fall ill, and damage their reproductive system\n5)\nIf they went to the city, they'd be subject to sexual\npredation and assault\n6)\nLess likely to be \"in process\" of losing their indigenous\nidentity\n7)\nSo, not only are they \"more Indian\"\na)\nMore of them are, in fact, \"Indian\"\nC.\nIn many other systems women are expected to maintain the ethnic difference\n1.\nBut the gender inequality is sometimes less apparent, more easily argued\naway\n2.\nThe Smith piece: in Guatemala indigenous women will wear traditional\ndress (even when in the U.S.) in situations where men won't\na.\nAnd are far more likely to be monolingual\nb.\n\nCelebrated as \"Maya mothers,\" etc.\n3.\nIn the U.S. and Canada: lots of debates within activist ethnoracial\ncommunities about the proper role of women\na.\n\nShould they organize demonstrations, write leaflets, sign petitions,\netc., just like the men?\n\nb.\n\nOr should they represent the \"traditional\" culture?\nc.\n\nDuring the Black protests in the U.S. in the 1960s and 1970s\nd.\n\nOne leader, Stokley Carmichael, said the proper position of women\nin the movement was supine\n1)\nThis means lying on their backs\ne.\n\nAnother leader, Eldridge Cleaver, said women's proper role in the\nBlack movement was to be a good wife and mother and raise a\nnew generation of warriors who'll continue the fight\nf.\n\nElicited a great deal of discussion\ng.\n\nAlso there's a debate in the Native American movement: women\nportrayed as needing to be traditional--bearers of culture\nD.\nAnother example: Mexico\n1.\nThe very powerful symbol of \"la Malinche\":\n\na.\nA \"national allegory\" of Mexico involving race, ethnicity, conquest,\ngender, and sexuality\nb.\n\nLa Malinche was conquistador Cortez's translator and concubine\nc.\nShe is seen to personify the cultural connection between the act of\nsexual intercourse (chingar) and conquest, violation\nd.\n\nShe is also seen to represent the devaluation of women by men who\nare shamed for being mestizos--sons of Spanish fathers and socially\ndenigrated Indian mothers\ne.\nAnd to have betrayed her people\n\n2.\n\nPresent-day gendered Mexican/Chicana identity\na.\n\nPatricia Zavella5 says that the ideology requires women to submit to\nrepression of their sexuality\nb.\n\nEmbedded in Catholic-based discourse, institutions, and everyday\npractices\n5 Zavella, Patricia 1997. \"Playing with fire\": The gendered construction of Chicana/Mexicana sexuality. In Roger\nN. Lancaster & Micaela di Leonardo, eds., The Gender Sexuality Reader: Culture, History, Political Economy. New\nYork: Routledge: 392-410.\n\nc.\nThe ideology justifies this with the mythologized actions of one of\ntheir sex\nd.\n\nZavella says that male dominance and the double standard are\nrationalized in the cultural polemics of macho/chingon and\nvirgin/whore\n\ne.\n\nIdeology of machismo: men are jealous, unfaithful, possessive\nf.\n\nTheme of conquest--deflowering virgins, etc.\ng.\nWith women needing to continually prove their purity, for they all\nbear the mark of that original betrayal\nh.\n\nDo you see how Zavella's argument links the ideology--the\nsymbolic level--with on-the-ground gendered relations?\n\n1)\n\nProviding justifications for the power asymmetries?\nE.\nThe very frequent theme of \"sleeping with the enemy\" is gendered and sexed\n1.\n\nIt's always women: collaborators, sluts, traitors\n\n2.\n\nFrantz Fanon's book The Wretched of the Earth6\na.\nAssigns a vastly different role to Algerian women in the struggle\nagainst French colonialism\nb.\n\nWomen should remain veiled: the veil is a sign of resistance to the\noppressor who wants to unveil them\n\n1)\n\nA\n\nrape\n\ntheme\n\n2)\nRape symbolizes violation, conquest\n\n3)\nBut what if the woman accepts being unveiled?\n\na)\nIdeology says she's a traitor in a way a man cannot\nbetray\n\nb)\nSeen as buying into the colonialist's ideology\n6 Fanon, Frantz, 1968 (1961 in French). The Wretched of the Earth. New York: Grove Press.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.226 Ethnic and National Identity\nFall 2011\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}