{
  "course_name": "European Thought and Culture",
  "course_description": "This subject surveys main currents of European cultural and intellectual history in the modern period. Such a foundation course is central to the humanities in Europe. The curriculum introduces a set of ideas and arguments that have played a formative role in European cultural history, and acquaints them with some exemplars of critical thought. Among the topics to be considered: the critique of religion, the promise of independence, the advance of capitalism, the temptations of Marxism, the origins of totalitarianism, and the dialects of enlightenment. In addition to texts, we will also discuss pieces of art, incl. paintings and film.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "History",
    "European History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis subject surveys main currents of European cultural and intellectual history in the modern period. Such a foundation course is central to the humanities in Europe. The curriculum introduces a set of ideas and arguments that have played a formative role in European cultural history, and acquaints them with some exemplars of critical thought. Among the topics to be considered: the critique of religion, the promise of independence, the advance of capitalism, the temptations of Marxism, the origins of totalitarianism, and the dialects of enlightenment. In addition to texts, we will also discuss pieces of art, including paintings and film.\n\nReadings begin with the Protestant Reformation, and move through the French Revolution up to the post-WWII period. Authors to be considered include Luther, Descartes, Kant, Hegel, Rousseau, Smith, Marx, Nietzsche, and Freud. Class discussions will set these texts into the context of European culture. Taught in English.\n\nPurpose\n\nThis course serves as a foundation for those pursuing further courses in European Studies. Students will be expected to construct arguments of their own about the issues raised. The course places a premium on excellence in communication; papers, oral presentations, and active participation in class discussions account for the full final grade. Students are expected to demonstrate progress in critical analysis and expression.\n\nRequired Text\n\nWeber, Eugen.\nThe Western Tradition, Vol. 2: From the Renaissance to the Present\n. 5th ed. Belmont, CA: Wadsworth Publishing, 1994. ISBN: 9780669394436.\n\nRequirements\n\nClass Participation\n\nIt is essential to this course. In order to make a valuable contribution students have to come prepared to each class. Assigned readings must be completed before each class meeting. Courtesy toward others in discussions is expected. Students who are unable to attend a class must inform the instructor in advance by e-mail. Students with more than four absences shall be automatically dropped from the class.\n\nEssays\n\nOne of the primary goals of this course is the development and refinement of critical analysis and argument. To this end students will write four essays. In finished essays any and all references must be cited. Essays must conform to MLA standards and should be each five pages long (that is c. 1250 words each: 1 manuscript page = 250 words).\nEssays are due in class in the sessions indicated\n. Essays submitted late without prior permission from the instructor will be penalized by\none full letter grade\n. Essays submitted more than one week late will be penalized by\ntwo full letter grades\n. Always keep a printed copy of your essay. The first essay is a diagnostic exercise. Students are required to submit revised versions of this essay. For this assignment, only the revised essay will be graded.\n\nOral Presentation\n\nIn addition to the writing assignments, students will also be expected to deliver an oral presentation. Students shall prepare and present a one-page handout on the day's reading. In these twenty-minute presentations students should provide a summary of the author's main points, describe the historical context in which the text was produced, and open up a few questions for discussion.\n\nPresentations will be evaluated according to the following criteria: insight, clarity, and, importantly, the degree to which presenters are able to stimulate the thoughtful participation of their classmates.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in class discussion\n\n10%\n\nOne oral presentation\n\n20%\n\nEssays:\n\nFirst essay and its revision (10%)\n\nSecond essay (15%)\n\nThird essay (20%)\n\nFourth essay (25%)\n\n70%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Luther’s Place in European Intellectual History",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-059-european-thought-and-culture-spring-2008/19c2738bab543d6ee09274d85db0e7c8_MIT21G_059S08_delacruz.pdf",
      "content": "Dela Cruz 0\nLuther's Place in European Intellectual History\n(Revised)\nMariel Dela Cruz\n21G.059\nSpring 2008\nProfessor T. Nolden\n\nDela Cruz 1\nWithout question, Martin Luther's works transformed Christendom. However, the\ninfluence of his theology extended beyond the issues that plagued the Catholic Church. Indeed,\nLuther and his teachings affected the intellectual discourse in European history. The Ninety-Five\nTheses, which propelled Luther into the frontlines of the Reformation Movement, was not only a\nscathing critique of the Catholic Church. It was also an introduction of a new way of critical\nthinking through a different manner of interpretation. He used this new perspective to question\nthe Catholic interpretation of the Bible, the only source of knowledge and thus, placed doubt on\nthe intellectual authority of the Church. In the process of condemning Church control, Luther\nalso elucidated on the vast disparity among the laity and Church officials and called for the need\nto abolish such a hierarchical system. A new political consciousness emerged from this that\ninspired revolts and revolutions across Europe. The renewed importance on interpretation and\nthe critique of the Church's intellectual and political authority both created perhaps the most\nimportant development - the emphasis on the individual's intellectual capacity. Individualism\nproved to be a crucial component to the philosophical and political developments that followed.\nThus, the effects of Luther and his insurgent theology revolutionize more than just Christian\nthought; they transformed the progression of European thought.\nWhen Martin Luther posted the Ninety-Five Theses on the cathedral doors at Wittenberg\nin 1517, his purpose was to draw attention to the apparent transgressions of Church practices.\nHe starts with a statement declaring, \"Our Lord and Master Jesus Christ in saying 'Repent ye'\n(poenitentiam agite), etc., intended that the whole life of believers should be penitence\n(poenitentia).\"1 He quickly follows it with a searing criticism proclaiming, \"this word cannot be\nunderstood as sacramental penance (poenitentia), that is, of the confession and satisfaction which\n1 M. Luther, \"The Ninety-Five Theses,\" ed. E. Weber, The Western Tradition: From the Renaissance to the Present,\n(Lexington: D.C. Heath and Company, 1995), 58.\n\nDela Cruz 2\nare performed under the ministry of priests.\"2 Luther elaborates his argument and directly\nattacks the validity of the practice of indulgences and of the sacraments. He claims, \"the grace\nconveyed by these pardons has respect only to the penalties of sacramental satisfaction, which\nare of human appointment. [These indulgences] are in reality most insignificant when compared\nto the grace of God and the piety of the cross.\"3 Evidently, Luther saw a disparity between what\nhe believes the Word of God conveys and how the Church applied it into action. It seemed to\nhim that Church officials misunderstood the Scripture and thus employed impious practices.\nHow then could the gap between faith and practice be reconciled?\n2 Ibid.\n3 M. Luther, \"The Ninety-Five Theses,\" 60, 62.\n4 S. Greidanus, Preaching Christ from the Old Testament: A Contemporary Hermeneutical Method, (Grand Rapids:\nWilliam B. Eerdmans Publishing Company, 1999), 98.\nMartin Luther suggested that there was only one way to read the Scripture correctly; it\nmust be read and understood in the literal sense. The Church's reading of the Bible at that time\nutilized the kind of hermeneutics that focused on the fourth sense - the eschatological meaning.4\nPopularized by St. Augustine, the fourth sense was believed to contain the metaphysical meaning\nof the text, something that could only be discovered by a trained scholar. Only the learned\nclergy could have access to this metaphysical interpretation. But Luther had seen the\nconsequences resulting from this metaphysical understanding. It led Church leaders to\nimplement practices that caused widespread corruption within the Church, avarice and other\nimpieties. Thus, for Luther, the observable evidences determined that this particular way of\nreading the Bible was wrong. Luther justified his new theory of hermeneutics by saying that\nmen, who are inclined to sin, should not try to understand the Scripture according to what they\nthink its meaning was supposed to be. One must refer back to the fundamental text because\nwhatever the Lord Almighty intended to convey in his Word would be made evident on the\n\nDela Cruz 3\n5 M. Luther, \"The Twelve Articles of the Peasants,\" ed. E. Weber, The Western Tradition: From the Renaissance to\nthe Present, (Lexington: D.C. Heath and Company, 1995), 66.\n6 M. Luther, \"The Ninety-Five Theses,\" 62.\nsurface. Clearly, this development of new hermeneutics was crucial to the progression of\nEuropean intellectual history as it introduced an entirely different method of understanding the\nwritten word.\nHowever, Luther did not only oppose the Church's interpretation of Scripture. He also\nchallenged the authority of the Catholic Church. His \"Ninety-Five Theses\" exposed the clergy's\nmisinterpretation of the Bible and his enumerated offenses of the Church only corroborated the\ngrave errors that the Catholic clergy made. Luther's critiques delivered a terrific blow to the\nChurch because it created doubt on its authority on theological thinking. If the most educated of\nall people - the clergy - could not correctly understand the Word of God and could only spread\nreligious falsities, how can the masses ever trust this institution as the one source for knowledge?\nThus, Luther not only created a new method of critical thinking; he also destroyed the notion of\nthe Church's monopoly on knowledge.\nFurthermore, Luther's theology condemned the hierarchy of power within the Church and\ngave rise to a new political consciousness. In fact, his writings motivated peasants to revolt,\ncausing chaos across Europe. Although Luther himself denounced these revolts as \"godless and\ncriminal,\"5 there is good reason why so many people took political inspiration from his theology.\nIndeed, Luther's writings were very sympathetic towards the plight of the poor. For instance, his\ncondemnation of indulgences often highlighted how it disadvantaged the less fortunate. In his\n\"Ninety-Five Theses,\" Luther sarcastically declares \"the treasure of indulgences is deservedly\nmost acceptable, because it makes the last to be first.\"6 He even encouraged the poor to be\nreasonable when buying indulgences, asserting \"that, unless they have superfluous wealth, they\nare bound to keep what is necessary for the use of their own households, and by no means to\n\nDela Cruz 4\n7 M. Luther, \"The Ninety-Five Theses,\" 61.\n8 M. Luther, \"On the Babylonish Captivity of the Church,\" ed. E. Weber, The Western Tradition: From the\nRenaissance to the Present, (Lexington: D.C. Heath and Company, 1995), 64.\n9 M. Luther, \"On the Babylonish Captivity of the Church,\" 65.\nand reminded them that they are at the bottom of the Church's power\nhierarchy, which rendered them powerless.\nlavish it on pardons\"7\nHow then did Martin Luther inspire a new kind of political thinking among the laity? He\ngave importance to the role of the laity in reading theology, a crucial part in interpreting Church\ndoctrine. He elaborated on the special role of laymen as ministers of the Word in his essay \"On\nthe Babylonish Captivity of the Church.\" He began with a sharp criticism of the Sacrament of\nOrders (the sacrament which ordained priests and nuns). Luther concluded \"[the Scripture] not\nonly has no promise of grace, anywhere declared, but not a word is said about it in the whole of\nthe New Testament.\"8 In addition, he blamed the institution of priesthood as the \"admirable\nengine for the establishment of all those monstrous evils which have hitherto been wrought...in\nthe Church.\"9 Luther pointed out that fundamentally, those who have been baptized into\nChristianity were all priests. As priests, laymen would have the same legitimacy in preaching\nand interpreting the Word of God as and clergy; they no longer needed to serve under the Church\nofficials and suffer unjust abuses. Once again, Luther's theology became the transformative\nelement that equipped the common man with the political rational and thought needed to justify\nthe opposition against the Church.\nThis political empowerment, moreover, developed further into arguably the most\nimportant consequence of Luther's theology - the increased emphasis on the significance of the\nindividual. He advocated for the importance of individualism through the notion of sole fides\nand sole scriptura. Sole fides dictates that a person's faith alone brings his salvation. Reliance\non the Church becomes unnecessary. The diminished role of the clergy and the increased\n\nDela Cruz 5\nauthority of the common layman on Christian theology are further reinforced through sole\nscriptura. Sole scriptura asserts that the only source of theological knowledge is the Bible; all\nother interpretations are of equal value and importance. Although this might not mean much on\nthe surface, it essentially equated the teachings and writings of venerated Church writers like St.\nAugustine were no better and were no more of an authority on Church doctrine than the\nunderstanding of the peasant who, guided by his faith, interpreted the Word of God himself.\nThis demonstrated Luther's radical commitment to restructure hierarchy of authority within the\nChurch through his unwavering belief in the capabilities and authority of each person. He\nfurther advocated for individualism in his insistence that the Bible must be translated in the\nvernacular. (Indeed, he successfully translated the Bible into German in 1534). Through this\nway, each person could access to Scripture and therefore have the opportunity to interpret it,\nexercising his own intellectual capacities for spiritual enlightenment.\nMartin Luther's momentous proclamation of his new theology with the Ninety-Five\nTheses reverberated across all of Europe. His new way of critical thinking shifted hermeneutics\nand thus, influenced the works of future Europeans scholars. His opposition against the Church\ndemolished its intellectual monopoly on Scripture interpretation and encouraged laymen to claim\ntheir rightful part in shaping Christian theology. It was also because of this challenged that the\nconcept of individualism gain emphasis and importance, an idea that influenced the emergence\nof capitalism and liberalism, crucial intellectual movements in Europe centuries after Luther's\ntime. Perhaps Luther never intended to cause such progress and change to stem from his\ngrievances. Nonetheless, Martin Luther and his theology revolutionized European intellectual\nhistory.\n\nDela Cruz 6\nWorks Cited\nLuther, Martin. \"The Ninety-Five Theses,\" ed. E. Weber, The Western Tradition: From the\nRenaissance to the Present, Lexington: D.C. Heath and Company, 1995.\nLuther, Martin. \"On the Babylonish Captivity of the Church,\" ed. E. Weber, The Western\nTradition: From the Renaissance to the Present, Lexington: D.C. Heath and Company, 1995.\nLuther, Martin. \"The Twelve Articles of the Peasants,\" ed. E. Weber, The Western Tradition:\nFrom the Renaissance to the Present, Lexington: D.C. Heath and Company, 1995.\nGreidanus, Sidney. Preaching Christ from the Old Testament: A Contemporary Hermeneutical\nMethod, Grand Rapids: William B. Eerdmans Publishing Company, 1999.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.059 European Thought and Culture\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}