{
  "course_name": "Experimental Projects I",
  "course_description": "The Experimental Project Lab in the Department of Aeronautics and Astronautics is a two-semester course sequence: 16.621 Experimental Projects I (this course) and 16.622 Experimental Projects II. This site offers material on 16.621. In the course, two-person teams initiate a project of their own conception and design in 16.621 and then complete it in 16.622. For many students, this is a first encounter with research standards and techniques. It is a complicated course that requires a lot of interaction and support and also access to facilities and materials, but it is rewarding for students to explore an hypothesis under the guidance of a faculty advisor.\nThis OCW site presents the building block materials of the course, which can provide only a profile of the course because the most important learning elements are the interactions between student team, faculty, project advisor, and shop staff and also between student team members. However, this site offers some of the preparation and guidance materials for students embarking on an experimental project. To emphasize the focus on communication skills, a set of study materials and examples of student work are provided.",
  "topics": [
    "Engineering",
    "Aerospace Engineering",
    "Computer Science",
    "Data Mining",
    "Systems Engineering",
    "Systems Design",
    "Science",
    "Engineering",
    "Aerospace Engineering",
    "Computer Science",
    "Data Mining",
    "Systems Engineering",
    "Systems Design",
    "Science"
  ],
  "syllabus_content": "Experimental Projects I, II is the Department of Aeronautics and Astronautics' undergraduate project laboratory course sequence. Students take 16.621 one semester, and\n16.622\nthe following semester. The courses overlap so that 16.621 and 16.622 are taught every semester in parallel. For this reason, the syllabi for 16.621 and 16.622 are contained in the same document.\n\n16.621 / 16.622 Experimental Projects Lab I, II Complete Subject Syllabus (\nPDF\n)",
  "files": [
    {
      "category": "Resource",
      "title": "01_introemm.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/cf28de4ca6627e328fed38a529fc017c_01_introemm.pdf",
      "content": "WELCOME TO 16.621/622\n(and some comments on how to succeed)\n\n-\nSome Questions\n- Team selection process?\n- Project selection process?\n- Advisers can commit to projects Tuesday after 4 pm\n-\nA Requirement\n- Photos\n\nTODAY'S TOPICS\n- Status check, photo opportunity\n- Course goal and course learning objectives\n- Some comments on the research process\n- The research \"catechism\"\n- The 16.62x cycle (16.62x Syllabus)\n- Our thoughts on progress and achievement in 16.62x\n\nQUOTES FROM THE SYLLABUS\n- \"First and foremost this is your project. You choose\nthe topic and advisor.\"\n- \"Your responsibility is to define an experimental\nprogram, develop a hypothesis, objective statement(s),\nand success criteria consistent with the definition of the\nproblem\"\n- One role of the course staff is to help in this process\n- We will ask for feedback about how well we are doing\n\nGOAL FOR 16.62X\nThe goal of 16.62X is to enable you to master the\nrelevant methods, processes and techniques\nnecessary for conceiving, designing,\nimplementing, operating, and documenting an\nexperimental project that addresses the\ninvestigation of a hypothesis\n\n16.62X AND INSTITUTE REQUIREMENTS\n- Institute Laboratory Requirement (satisfied by 622) for\nconducting an experiment dealing with phenomena of the\nnatural world and testing (assessing) a hypothesis\n- Phase II writing requirement can be satisfied by final\n16.621 project proposal (or solely authored 622 report)\n- Grade of B- or better is necessary\n\nLEARNING OBJECTIVES\nAt the end of the 16.62X cycle you will be able to:\n- Formulate the overall objectives and success criteria for an\nexperimental assessment of a hypothesis about the natural world\n- Develop, as a two-person team, strategy and tactics for design of an\nexperiment and data analysis to achieve these objectives\n- Implement, as a two-person team, the detailed experiment design and\ndata analysis\n- Execute, as a two-person team, an experiment which will\nsuccessfully assess a defined hypothesis\n- Effectively communicate, orally and in writing, the key aspects of the\nproject, from concept to end goal\n\nYour 16.62X Journey\nOral\nProp\nSelect Partner,\nProject & Advisor\nWk\nTask\nDue\n16.621 - SP03\nConceive Phase\nBackground, Overview\nHypothesis, Objective(s),\nSuccess Criteria\nProp\nVer 1\nLiterature Review\nTechnical Approach\nProp\nVer 2\nSpring Break (Sun!)\nDesign Phase\nExperimental Design\nData Analysis\nProject Planning\nNeeded Facilities & Space\nEngineering Drawings\nand/or Psuedo Code\nDetailed Parts List\nProp\nVer 3\nProposal Accepted -Onto 622\nProposal Not Accepted - I\nReport Phase\nAnalyze Data\nAssess Hypothesis\nReport Results in Form\nSuitable for submission\nto Student Conference\nWk\nTask\nDue\n16.622 - F03\nImplement Phase\nConstruct Apparatus\nand/or Write Software\nCalibrate\nTake Preliminary data\nOral\nProg\nRept\nLast Day to Take Data\nOperate Phase\nCollect Data\nReduce Data\nCheck For Validity\nOral\nRept\nFinal\nRept\nOptional - Conference Pub\n\nTHE 62X RESEARCH CYCLE\nStatement\nof Project\nProject Proposal\nIdea\nFinal Report\nCompletion of\nExperiment\nProgress Report\nProgress Report\nArticulation\nPlanning\nWork\nAnalysis\nWork\nWork\nThinking\n16.621\n16.622\nApproval to\nProceed\nFunding\n\nThe \"Idea\"....\n-\n....can come from\n- Curiosity\n- Your \"boss\" or in 621 your advisor\n- A need\n- A brainstorming session\n- A previous project\n- ....\n-\nBe sure the idea addresses something of value to society.\n\nTIPS ON PICKING A 62X PROJECT [Murman]\n- Do you like your advisor and think\nyou will be able to work well with\nher/him?\n- Does the topic excite you and your\npartner?\n- Does the project seem doable in 132 hours (11\nweeks) of work in 622 if it is well planned in 621?\n-\nAre the major facilities that you need available?\n\nWHY RESEARCH?\n- To uncover the way nature works\n- To discover the \"laws\" that describe these workings\n- To find out relationships that are not known\n- To determine the value of physical constants\n- ...\n- ...\n- To define ways to make aerospace devices \"better\".\n\nHOW RESEARCH?\n- Figure out which problems/relationships are not known\n- Develop hypothesis about relationship (between inputs & outputs)\n- Design an experimental procedure to illustrate the relationship\n- Build/buy the equipment required for procedure\n- Set up experiment\n- Analyze results\n- Verify results\n-Communicate/publish results (Iteration needed: \"Easy writing's vile\nhard reading\" [Sheridan])\nIteration is involved\n\nG. H. HEILMEIER'S* \"CATECHISM\" FOR EVALUATING A\nRESEARCH PROJECT\n-\nWhat are you trying to do? (Articulate your objectives using\nabsolutely no jargon)\n-\nHow is it done today and what are the limits of current practice?\n-\nWhat is new in your approach and why do you think it will be\nsuccessful?\n-\nWho cares? If it is successful, what difference will it make?\n-\nWhat are the risks and the payoffs?\n-\nHow much will it cost? How long will it take?\n-\nWhat are the midterm and \"final\" exams to check for its success?\n---------------------------------\n* Look him up on the web if you want to see an impressive resume\n\nTHE 16.621 SYLLABUS AT A GLANCE\n- The next few slides give a short tour of the 16.62X Syllabus\n- This is only an overview -- as it says on the front page \"YOU are\nresponsible for reading and understanding this document\"\n- Appendix B gives a list of the specific 16.621 Deliverables\n- Some options for dealing with the list of deliverables\n- Memorize the list and recite it often to yourself\n- Call up Professor Murman at midnight and ask him what is due\nthe next day*\n- Tattoo the list somewhere prominent\n- Less exciting, but perhaps more practical - keep the Syllabus\nhandy and consult it often for specific information\n-------------------\n*Follow-up with another phone call at 2 am to make sure you have all the information\n\n16.621 MILESTONES\nMilestone\nWeek*\nSelect Partner\nSelect Project/Advisor\nVersion I (draft Statement of Project)\nTeam Meeting (all stakeholders in one room)\nVersion II (revised Version I + other material)\nOral Presentation\nTeam Meeting\nFinal Written Proposal: Version III\n(Revised Versions I,\n* Week count includes spring break\n\nMORE MILESTONES (Notebooks)\n- Laboratory Notebooks will be discussed in more depth in next\nlecture. For now just three points:\n- Your notebook should be an accurate and definitive record of\nyour work\n- Notebooks are to be handed in for grading three times in term\nWeek 5\nWeek 8\nWeek 11\n- Last term several teams where the notebooks made a letter\ngrade difference between the two members\n\n16.621 GRADE ALLOCATION\nAssessment Tool\n% Final Grade\n3 Notebook Checks\n9%\nVersion I\n10%\nVersion I rev., Version II\n10%\nOral Project Proposal (I,II)\n20%\nAdvisor's Grade - I\n10%\nFinal Written Proposal\n20%\nAdvisor's Grade - II\n10%\nTechnical Staff Grade\n10%\nSubject Evaluation\n1%\n\nCLIFF NOTES FOR THE SYLLABUS\n- Although Murman, Craig, and Greitzer have worked hard on the\nsyllabus, we understand you may not want to take the time to commit\nit to memory\n- The TAs have volunteered to address this possible disconnect\n- Develop a student-oriented \"Mini-Syllabus\" with information you\nare likely to need on an ongoing basis\n- We emphasize that there is other information in the Syllabus that you\nare going to need\n-\n\nWHAT'S THE MESSAGE?\n- The process we are describing is one that requires a sustained\nconsistent effort\n- The deliverables during the term will feed in directly to the final\nreport\n- It is difficult, if not impossible to \"do it all in the last two weeks\"\n(two days/two hours/....)\n- The faculty/staff will help with this by following your progress\n- This is diagnostic, not punitive\n- Green, yellow, red - we will share information with you about\nthe status\n\nSOME OTHER COMMENTS\n- The process you are engaged in has many similarities with \"real\nworld\" projects:\n- The need to have a clear idea and vision for what you are trying\nto do\n- The nature of a process with specific \"gates\" or hurdles which\nmust be crossed (Staged Gate Process, Passport Review)\n- The need for iteration in both research and communication\naspects\n- The need for teaming in stepping up to project with high impact\n- The opportunity to create something you can be proud of-- and\nthe chance to know how enjoyable that is\n- It's your project--we hope you have a great time with it"
    },
    {
      "category": "Resource",
      "title": "02_16.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/c9cf4acdce715aabe83dd4e1cc8fee97_02_16.pdf",
      "content": "Introduction to 16.62X\n16.621\n\nCourse Faculty\nProf. John Deyst\nProf. Ed Greitzer\nProf. Earll Murman\n\"The course faculty is responsible for the structuring of the subject and the development of\nthe learning objectives, subject content, and assessment tools. The course faculty will lead all\nclass and team meetings and grade all written and oral material. The course faculty, together\nwith input from the 16.62x staff and Writing Program Instructor, are responsible for assessing\nyour progress towards meeting the class learning objectives.\" Source: 16.62X Syllabus\n\nWriting Program Faculty\nJennifer Lynn Craig\n\"The writing program instructor is responsible for organizing and running the\ncommunications content of 16.62X and for evaluating all Phase II papers. She contributes\nevaluations and commentary on oral and written assignments submitted for 16.62X and is\navailable to all students for individual or team consultations. In addition, she teams with\nthe course faculty for the development of all aspects of the subject, with a particular\nfocus on communications aspects.\" Source: 16.62X Syllabus\n\nTechnical Staff\n\"The technical staff will assist you with the use of laboratory and shop equipment, ordering\nmaterials, and the solution of technical problems. They are a very knowledgeable and\nvaluable resource. All past 16.62X classes have found them enormously helpful. Use them.\"\nSource: 16.62X Syllabus\n\nTeaching Assistants\n\"16.62x has recent 16.622 graduates serving as teaching assistants for the course. The TAs\nare available to help you plan and execute your project. Having recently been \"in the\ntrenches,\" the TAs will be uniquely able to assist you with a variety of issues from\nunderstanding the course objectives through directing you to the appropriate laboratory staff\nmember to solve a difficult instrumentation problem. The TAs will also grade your notebooks\nand will provide a student viewpoint in all 16.62X staff meetings.\" Source: 16.62X Syllabus\n\nYour 16.62X Journey\n16.621 - SP03\n16.622 - F03\nReport Phase\nAnalyze Data\nAssess Hypothesis\nReport Results in Form\nSuitable for submission\nto Student Conference\nOral\nProp\nSelect Partner,\nProject & Advisor\nWk\nTask\nDue\nConceive Phase\nBackground, Overview\nHypothesis, Objective(s),\nSuccess Criteria\nProp\nVer 1\nLiterature Review\nTechnical Approach\nProp\nVer 2\nSpring Break (Sun!)\nDesign Phase\nExperimental Design\nData Analysis\nProject Planning\nNeeded Facilities & Space\nEngineering Drawings\nand/or Psuedo Code\nDetailed Parts List\nProp\nVer 3\nProposal Accepted -Onto 622\nWk\nTask\nDue\nImplement Phase\nConstruct Apparatus\nand/or Write Software\nCalibrate\nTake Preliminary data\nOral\nProg\nRept\nLast Day to Take Data\nOperate Phase\nCollect Data\nReduce Data\nCheck For Validity\nOral\nRept\nFinal\nRept\nProposal Not Accepted - I\nOptional - Conference Pub"
    },
    {
      "category": "Lecture Notes",
      "title": "03_62Xf02ethicslecture.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/b0e8a64b7146ba266abeded4a812d1a8_03_62Xf02ethicslecture.pdf",
      "content": "Ethics and Experimental\nResearch Projects\n16.621\n\nWhy be concerned about ethics?\n- Science and engineering are professions whose\nintegrity rely on the participants behaving in ethical\nways.\n- Unethical behavior can lead to loss of life, property,\nor other resources.\n- Individuals can also lose respect and their\nreputation.\n- Without ethics, the profession loses the public trust,\nin which case it will not be valued or it will become\nhighly regulated with much oversight.\n- Due to past transgressions, our profession has lost\nconsiderable public trust. Oversight has increased.\n- Current aerospace companies and agencies place\nconsiderable priority on ethics training and ethical\nconduct.\n\nMacro and Micro Ethics\n- Macro ethics affect large segments of society, e.g.\nsafety of an aircraft or a nuclear power plant\n- Micro ethics affect individuals or small groups,\ne.g. impact on a student or employee.\n- \"Ethics and the Second Law of Thermodyamics\"\nby Norm Augustine* is an excellent easy to read\nintroduction to this topic.\n- In 16.62X we are mainly concerned about micro\nethics surrounding data collection and handling,\nand reporting of results.\nRemember - All of us have human weaknesses!\n*The Bridge, National Academy of Engineering, Fall 2002, pp 4-7\n\nThree basic ethical principles\n- Full disclosure\n- Don't hide anything.\n- Operate under the principle that one day, you\nmay run for public office and be fully\ninvestigated.\n- You don't want any skeletons in the closet.\n- Don't \"invent\" the truth\n- Be an objective, unbiased researcher\n- Give credit for source of information\nor ideas.\n- Don't claim something was your discovery when\nit was someone else's idea.\n- Note: this is one reason why you keep a\nnotebook so the source of your ideas are clear.\n\nThings to avoid in handling data\n- Cooking the data\n- Retaining only those points that fit the theory\nand discarding others\n- Trimming the data\n- Smoothing of irregularities to make the data\nlook extremely accurate and precise\n- Forging data\n- Should be patently clear that it is unacceptable\nto \"invent \"data\n- Yet it has happened! How or when might this\noccur?\n- All data is \"real data\"\n- Seek to explain outlying data points - it might be\nan important discovery\n- If you don't use a data point, explain why\n\nReporting results\n- Plagiarism\n- Verbatim copying of other people's\nwords is unethical\n- More subtle form is not plagiarizing\nwords, but ideas\n- Citations\n- All material taken from other sources\nshould be referenced\n- This includes figures and materials from\nother 16.622 projects\n- Err on the side of giving credit, but\ndon't go overboard.\n\nReporting results - Continued\n- Acknowledgements\n- Always acknowledge someone's help if\nit impacted the work\n- Most reports have an\n\"Acknowledgements\" section\n- Copyright permissions\n\nA Hypothetical Situation - I\nJose's 16.622 project has gone well. All the data is\ncollected. On his way to turn in his lab notebook on this\nfinal day to take data he passes by his good friends Robin\nand Wade. They are nervously working to finish their\nproject. In response to \"how's it going\", they reply \"we just\nfigured out how to satisfy our advisor\".\nRobin and Wade had an exciting project which would prove\nor disprove their advisor's theory. Prof. Astro was an\nengaging but somewhat demanding faculty member\ncoming up for tenure next year. Robin and Wade had\nshown their experimental data to Prof. Astro last week, but\nit didn't agree well with the theory. Prof. Astro told them\nthe results couldn't be right and that they should redo the\nexperiment. This had upset Robin and Wade and who were\nlooking towards applying to graduate school and hoping to\nearn an A in 16.622.\n\nA Hypothetical Situation - II\nRobin and Wade's final oral presentation followed Jose's. He\nwas surprised when they showed results in remarkable\nagreement with Prof. Astro's theory. In the Q&A session, Prof.\nAstro monopolized the time, mostly talking about the good\nresults and not asking many questions. With little time left, a\n16.622 faculty member asked what had led to the successful\noutcome, knowing that the experiment had come down to the\nwire. Robin and Wade, said they fixed a faulty electrical\nconnection and got the data on the last day.\nAt the end of the session, Jose overheard the 16.622 faculty\nasking the technical staff about the faulty connection. And as\nhe left the room, he passed by Prof. Astro who was excitedly\ntalking to Robin and Wade. The experimental proof of the\ntheory would be a big boost to Prof. Astro's stature.\nApparently the professor wanted the students to write a paper\nwith the three of them as co-authors.\n\nJose's dilemma\nSeveral things bothered Jose about Robin\nand Wade's project. He expected a good\ngrade in 16.622 and wanted to ask the\ncourse faculty for a grad school letter of\nrecommendation. He didn't want to rock the\nboat, and Robin and Wade were good\nfriends. But he didn't sleep well that night.\nIf you were Jose, what would you be thinking\nabout? Is there anything you would do?\n\nSummary\n- Follow the ethical principles suggested\n- Keep a notebook and follow guidelines\nin the syllabus\n- Your grade will depend upon it!\n- Ethical issues are often in the \"gray\nzone\"\n- Rarely are they completely cut and dried\n- If in doubt\n- Ask us or your supervisor when you are\nworking, or\n- Talk to MIT's ombudsman"
    },
    {
      "category": "Resource",
      "title": "04_audienceanalysisact.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/4fc90d3730b9dd7ea72884c8bedd14f0_04_audienceanalysisact.pdf",
      "content": "How writers and speakers plan\ncommunication strategy\nAudience analysis skills\n\nInformation\n+\nWriter's or\nspeaker's\n+\npurpose\nAudience\nanalysis\n= Communication strategy\nWhat?\nWhy?\nTo whom?\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis elements\n- Know four key facts about readers and\nlisteners.\n- Consider the level of technical expertise of\nyour audience.\n- Understand why they are reading.\nthen. . . plan communication strategy and\ninformation organization.\nMIT Department of Aeronautics and\nAstronautics\n\n4 key facts about how readers and\nlisteners absorb information1\n- An audience creates\nmeaning bit by bit and\nreacts moment by\nmoment.\n- An audience is influenced\n-by surroundings,\n-by beliefs and values,\n-by prior experiences,\n-by roles and\nresponsibilities.\n- An audience has finite\nresources for\ncomprehension.\n- i.e. The energy that it takes\nto focus, to decipher\nlanguage or symbols\nreduces the ability to\ncomprehend.\n- An audience absorbs\ninformation visually as\nwell as textually.\nMIT Department of Aeronautics and\nAstronautics\n\nReaders and listeners = different levels\nof technical expertise 2\n- Experts (general and\nspecific)\n- General experts: extensive\nknowledge of a field but may be\nunfamiliar with specific details in a\nsub-specialty.\n- Specific experts: extensive\nknowledge of a field and specific\nknowledge about a sub-specialty.\n- Technicians\n- People who construct, operate,\nand fix objects and systems.\n- Decision-makers,\nmanagers\n- People who make choices, implement\nplans, administer budgets, manage\nresources and people.\n- Laypeople\n- People who don't have the\nspecific knowledge of an expert or\na technician.\nMIT Department of Aeronautics and\nAstronautics\n\nTechnical level= different purposes in\nreading/listening\n- Experts\n-maintain and expand expertise;\nevaluate a document's validity\nor credibility; obtain specific\nanswers to their own research\n- Technicians and other\nsupport staff\n- learn how to perform a task; to\nsolve a problem; to learn about\nnew devices and procedures;\nabsorb knowledge helpful to\ntheir tasks\n- Decision-makers,\nmanagers\n- to make a decision, to assess\ncurrent situation, to maintain\ntheir level of expertise; to\nevaluate projects and\nemployees\n- Laypeople\n- to make decisions as a citizen,\nconsumer, and investor; to learn\nhow to do something; to expand\ngeneral knowledge; to become\nan expert\nMIT Department of Aeronautics and\nAstronautics\n\nConsider demographics.\n- Age, sex\n- International or ethnic\nidentity\n- Educational level\n- Values\n- Political position\n- Economic level\n- Reading style/graphic\nstyle\n- Affinity group\nMIT Department of Aeronautics and\nAstronautics\n\nThink about context or current\nsituation, too.\n- Are your readers/listeners from other\ncultures or ethnic backgrounds?\n- Economic situation of your audience?\n- Political situation of your audience?\nMIT Department of Aeronautics and\nAstronautics\n\nInformation organization + choice of\ncommunication form = strategy\n- Information organization:when data is\norganized into a pattern that makes sense to\nthe reader.\n- Sequence: where the reader needs to begin\n- Density: the level of technical detail\n- Rate: the speed at which the technical details\nare presented\nMIT Department of Aeronautics and\nAstronautics\n\nForm of communication\n- The choice of communication form is\nbased on the conventions in your field and\nyour audience analysis.\n- E.g. A group of laypeople might not use a\ntechnical report but would find a press release\nor brochure useful.\n- But an expert would not prefer the press release\nor brochure but would want to see the technical\nreport.\nMIT Department of Aeronautics and\nAstronautics\n\nQuick review\n- 4 facts about how an\naudience absorbs\ninformation\n- Different levels of\ntechnical expertise\n- Purposes in reading\n- Demographics of\naudience\n- Different forms of\ncommunication appeal\nto different audiences\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis scenario #1: You are an engineer in charge\nof a research project that has developed a new process that\nassesses which components of the new gas turbine engine are\nuseful to spend R & D money on and which are not. This allows\na more strategic use of your company's R & D dollars. You are\ninvited to present your project to the CEO and Board of Trustees.\nYou are talking about thermodynamic entropy when you observe\nthat the CEO looks bored and the trustees are falling asleep.\nYour research is sound, but what is making this presentation so\nunsuccessful? Can you rescue this presentation? How? How can\nyou be sure that future opportunities won't produce the same\nresults?\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis scenario #2: You are the CEO of a\ncompany that has developed a new material to be used in the\ntransparent canopy of the F-15. It is more durable and lighter\nweight than the material currently used.You've won a DoD\ncontract. A U.S. Senator from your state arranges to hold a\npress conference. The mayor of the city will be there, too.\nThere will be newspaper and television press. Several DoD\nofficials will attend along with several of your engineering\ncolleagues.\nWhere do you start? What do you need to do to prepare? What\nare the levels of technical expertise involved? Why is the\nsenator there? What roles do you colleagues play? Is the press\nessential or not? The mayor? Explain your reasons.\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis scenario #3: You are the lead engineer on a\nproject to develop an interferometer to be deployed in space.\nThis device will assist in deep space mapping. The work has\ngone well, but it becomes clear that the project cannot be\nsuccessfully completed at the budget for which it was approved.\nThe scope of the project is larger that you'd anticipated, and this\nmeans not only more money but also more time.\nYou must go before a NASA committee. What do you need to\nknow about this group to prepare? What will they care most\nabout? How can you persuade them to approve more money and\nmore time for the project?\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis scenario #4: You are creating a\npresentation to be given to a venture capitalist whom you want\nto persuade to invest $750,000 in your company's haptic\nfeedback glove, a device that provide force feedback to an\noperator as s/he grasps a remote object.\nMs. Smith brings with her several members of her team. They\nplan to spend two to three hours with you, maybe more. What\nroles and responsibilities might these people have? What will\ntheir priorities be? What professional backgrounds might they\nhave?\nWhat's your strategy? Why?\nMIT Department of Aeronautics and\nAstronautics\n\nAudience analysis scenario #5: The launch director sends you to\na meeting with a group of Sierra Club administrators. These\nrepresentatives of this international environmental organization\nare concerned about the possibility that your satellite's\nradioactive power source may have a negative environmental\nimpact should the satellite be destroyed in the launch phase.\nWhat do you need to know about this group? What will your\nstrategy?\nMIT Department of Aeronautics and\nAstronautics\n\nThanks to the faculty and staff at Massachusetts Institute of\nTechnology Department of Aeronautics and Astronautics for their\nadvice in creating the audience analysis scenarios.\nProfessor Ed Greitzer\nProfessor Earll Murman\nProfessor Marthinus Van Schoor\nProfessor David Miller\nColonel Pete Young\nWilliam Litant, Department of Aeronautics and Astronautics\nCommunications Director\nMIT Department of Aeronautics and\nAstronautics\n\nSources cited\n1. Anderson, P., Technical Communication, 4th ed.,Harcourt Brace Publishers:\nFort Worth, Texas, 1999.\n2.Perelman, L., Paradis, J., Barrett, E., The Mayfield Handbook of Scientific and\nTechnical Writing, Mayfield Publishing: California, 1998, pp. 12-20.\nMIT Department of Aeronautics and\nAstronautics"
    },
    {
      "category": "Resource",
      "title": "05_621S03grading.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/bce237f26be1dfa2902afc503438b376_05_621S03grading.pdf",
      "content": "Notes on 16.621 Grading\n16.621\n\nTopics\n- Grading rubrics for written proposals\n- Content\n- Communication\n- Grading distribution between content\nand communication\n- Dealing with multiple graders\n- Division of work within teams\n\n16.621 Written Proposal Content Grading Sheet - Spring 2003\nPerformance Level\n(see reverse side for definitions)\nVersion\nI\nII\nIII\nComments\nCover Page\nExecutive Summary\nIntroduction\nHypothesis, Objective,\nSuccess Criteria\nLiterature Review\nTechnical Approach\nExperimental Design\nData Analysis\nProject Planning\nFacilities\nSummary\nReferences\nAppendices\nOverall Evaluation of\nProposal Version\nNumerical Range\n0-50\n51-69\n70-79\n80-89\n90-100\nStudent:\nVersion:\nGrader:\n\nGrade:\n/100\n\nPerformance Levels*\n5 Exceptionally good\nCoverage and/or correctness of content demonstrates superior understanding of the subject matter, a\nfoundation of extensive knowledge, an ability to skillfully use concepts, and a well-organized and in-\ndepth plan for a 16.62X project. The student is exceptionally well prepared to proceed to 16.622.\n4 Good performance\nCoverage and/or correctness of content demonstrates a good understanding of the subject matter,\ncapability for use of the relevant concepts, and a good plan for a 16.62X project. The section or version\ncan be improved as indicated by comments in the text. The student is prepared to proceed to 16.622.\n3 Adequate\nCoverage and/or correctness of content demonstrates adequate understanding of the relevant material, an\nability to apply the concepts in a relatively simple manner, and a basic plan for a 16.62X project. The\nsection or version can be improved as indicated by comments in the text. The student has the minimum\npreparation to proceed to 16.622.\n2 Minimally acceptable\nCoverage and/or correctness of content demonstrates only partial familiarity with the subject matter,\nsome capacity to work with the concepts in simple applications, and a partial plan for a 16.62X project.\nDeficiencies are serious enough that the student should make major revisions to this section/version by\nthe next version, or before proceeding 16.622.\n1 Unacceptable\nContent is missing, so incomplete, or so full of errors that it does not satisfy minimum requirements of\nacceptability. The student should completely redo this section/version by the next version, or is not\nprepared to continue to the 16.622 without repeating 16.621.\n* These performance levels are paraphrased from the definition of MIT grades given in the Bulletin\n\n16.621 Written Communication Grading Sheet - Spring 2003\nPerformance Level\n(see reverse side for definitions)\nElement\nComments\nDocument preparation\nCover sheet with appropriate information\nAll required sections and sub-sections\npresent and properly labeled.\nPage numbers; tables, figures, and\nequations labeled\nAcronyms and numbers used\nconventionally\nCitations done properly (when appropriate)\nWriting skills\nIdeas flow logically from sentence to\nsentences, from paragraph to paragraph,\nfrom section to section\nDocument shows evidence that writer has\nconsidered a mixed audience and provided\nsufficient background.\nLanguage is used grammatically;\npunctuation is correct; words are spelled\ncorrectly.\nWriting is concise.\nOverall Evaluation\nNumerical Range\n0-50\n51-69\n70-79\n80-89\n90-100\nStudent:\nVersion:\nGrader:\n\nGrade:\n/100\n\nGrading Distribution Between\nContent and Communications\nTable I. 16.621 Grade Allocation\nAssessment Tool\n% Final Grade\n3 Notebook Checks\n9%\nVersion I\n10%\nVersion I revised and\nVersion II\n10%\nOral Project Proposal (I,II)\n20%\nAdvisor's Grade - I\n10%\nFinal Written Proposal\n20%\nAdvisor's Grade - II\n10%\nTechnical Staff Grade\n10%\nSubject Evaluation\n1%\nTable II. 16.622 Grade Allocation\nAssessment Tool\n% Final Grade\n3 Notebook Checks\n9%\nOral Progress Report\n15%\nFinal Oral Presentation\n20%\nFinal Written Report\n25%\nAdvisor's Grade\n20%\nTechnical Staff Grade\n10%\nCourse Evaluation\n1%\nFor shaded assignments, 60% of grade given by Course 16\nFaculty and 40% given by Writing Faculty.\nFor both 16.621 and 16.622, 24% of total grade based upon\ncommunications. Or for 16.621 plus 16.622, 4.32 of 18 total\nsubject units are allotted to communications.\n\nDealing with Multiple Graders\n- Multiple Course 16 Faculty will grade your written and\noral assignments.\n- For example, Profs Deyst, Greitzer and Murman will\neach grade Version I of your proposal.\n- The faculty's evaluations are subjective.\n- The may not be the same.\n- They might be in conflict.\n- They might not agree with your advisor's viewpoint.\n- This may be a new experience for you.\n- In technical subjects, correct answer is usually not subjective.\n- In non-technical subjects, there is usually only one grader.\n- Multiple reviews are the norm in evaluation of research\nproposals and papers, and often the reviewers do not\nagree.\n\nExample of Two Conflicting Reviews\n- Actual contents of the review of a paper submitted to\nthe International Gas Turbine Institute annual\nconference (Turbo Expo).\n- Reviewer #1: \"The authors are to be congratulated on an\nexcellent use of CFD [computational fluid dynamics]. The\nwork leads to increased understanding of a physical flow\nmechanism and is shown to be consistent with experimental\nresults.\"\n- Reviewer #2: \"The authors attempted to study the upstream\nunsteady effects on rotor tip clearance flow.............The CFD\nmodel (wake + rotor) used by the authors is not adequate to\nrepresent the true multi-blade row situation, especially when\nthe blade row gap is small.\"\n\nDealing with Conflicting Evaluations\n- Complain to Instructor in Charge.\n- Ignore the one(s) you don't like.\n- Understand and resolve the evaluations.\n- Ask for clarification from each evaluator.\n- Meet with all the stakeholders at once to\nresolve issues.\nTeam Meetings with all stakeholders are\nscheduled between Versions I and II and\nVersions II and III to resolve issues.\n\nDivision of Work Within Teams\nWorking together\nPartners are expected to\nwork together in defining the problem, exploring design options,\nconstructing the apparatus, taking data, and discussing other aspects of their project.\nBecause of the team nature of the course, a few clarifications relating to academic\nhonesty are provided below.\nOral progress reports and oral presentations are regarded as a combined effort and\nnormally are graded as such. Partners should participate equally in both the presentation\nand the question-and-answer session.\nFigures, tables of data, graphs, and typeset equations used in oral and written deliverables\ncan and likely should be prepared jointly between team members.\nWorking separately\nNotebooks must be kept separately.\nWritten material reflects the degree of understanding, which you have gained from the\nwork, and your capacity to convey the results to others. Everyone is highly encouraged\nto discuss organization, results, conclusions, etc. with your partner, faculty advisor, and\n16.62x staff members. However, the 16.621 project proposals and any solely authored\n16.622 final written reports must be individual efforts. Duplication or direct paraphrasing\nof text is not allowed and is considered to constitute plagiarism. An exception to this is\nthat the Hypothesis, Objective, and Success Criteria statements must be the same\nfor all members of a team.\nSource: 16.621/16.622 Experimental Projects Lab I,II Subject Syllabus, page 15"
    },
    {
      "category": "Resource",
      "title": "06_621s03expdesign.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/1febee546ec22e4b0022a2da0a4d3407_06_621s03expdesign.pdf",
      "content": "Experimental Design\n16.621\n\nElements of Designing an Experiment\n- Goal is to assess your hypothesis\n- The main thing is to keep the main thing\nthe main thing - [Tom Curran, AFRL]\n- The design goal for your experiment is\nto achieve your objective and satisfy\nyour success criteria.\n- Your HOS are the touchstones for your\nexperimental design.\n\nSOME FRAMING QUESTIONS\n- Once the HOS is set we need to define in depth the path to get there\n- Need to think through the whole process on an end-to-end basis\n- Need to identify the hard parts\n- Need to identify the key milestones (\"mid term exams\")\n- This will include (at some level) questions such as:\n- What will we do?\n- Why will we do it?\n- Where will we do it?\n- Who will help us?\n- How will we do it?\n- How well do we have to do it?\n- When will we do it?\n\nProject Specific Applications of these Questions\n- What is the best overall approach to achieve my\nobjective?\n- e.g., should I test children's car seats in the lab or\nin actual airplane environment?\n- What are my choices of facilities?\n- e.g., should I use a water tunnel or a wind tunnel\nto determine the performance of a split-tip keel?\n- How will I measure my independent variables?\n- e.g., Should I measure rotational speed of my\nairspeed indicator with a stroboscope or a shaft\nencoder?\n\nObservations About Design\n- Design is an inductive process.\n- Ways to learn design\n- Study past designs that have been\nsuccessful and extract patterns\n- Look at the online models\n- Work with a \"master\" designer\n- Involve your advisor\n- Do it yourself and receive feedback\n- Basically this is the 16.621 process\n\nThe 621 Design Process\nIdea!\nHOS\nConceptual Design\nDetailed Design\nVersion II\nOverall experimental\napproach; \"scope\nand scale\"; type of\nmodel(s), materials,\nsoftware; data to be\ntaken; sources of\nerror,....\nVersion I\nVersion III\nDetailed drawings and\ndimensions; pseudo\ncode; specific\nequipment; make/buy\ndecisions; construction\nmethods; calibration\nmethods; detailed error\nanalysis, budget and\nschedule,....\n\nConcpetual Design Process\n-\nStart with an open mind. Avoid preconceived approach.\n-\nBrainstorm with your partner\n- Think of multiple ways to accomplish your objective(s)\n- Ask other people, keep your \"eyes open\"\n- Avoid rejecting ideas, particularly wild ones, at this stage.\n- Keep on the cusp of creative thinking.\n- Write these ideas in your notebooks.\n-\nDevelop a set of desired attributes to use to compare your different\ndesigns, keeping your HOS in mind.\n-\nSort through the different options to arrive at a best design to achieve\nyour objective.\n-\nVerify your conceptual design supports your HOS\n- Revise HOS if original set is not feasible\n-\nThen proceed with \"detailed design\".\n\nA 621 Example\nThe potential strategies for creating the aerated ice are as follows:\n1 Drill air holes into the ice.\n2 To use a mixture of crushed ice and water close to freezing\npoint.\n3 Suspend small pockets of air in the ice mix (using tethered\nballoons)\n4 Construction of a specialized rig that constantly blows air\nthrough the ice mix.\n5 The use of soda water or carbonated water.\n6 A combination of these strategies.\nThe most effective method for creating aerating ice will be\ndetermined during the preliminary testing stage of the project. The\nmethod will be chosen based on the best combination of speed,\nease of production, and quality of ice produced.\nSource: Bennett, W. \"Simulating and Testing Ice Screw Performance in the Laboratory\", 16.621 Design\nProposal, Fall 2002\n\nFidelity of Your Approach\n-\nAn experiment is usually a \"model\" of the \"real thing\".\n- It may be too complex or expensive to test the real thing\n- It usually will be difficult to have control over the variables\nin a real operational environment\n- e.g. a part task simulator will be used to test a cockpit\ndisplay instead of modifying a real cockpit.\n-\nThe \"fidelity\"* of your (model) experiment needs to be\nassessed as part of the design process.\n-\nLack of fidelity is one source of errors.\n-\nA good way to consider these errors in the design stage is to\nwrite them down, assess their importance, and consider\nmitigation strategies.\n*Fidelity: Exact correspondence with fact or with a given quality,\ncondition, or event; accuracy. http://dictionary.reference.com/\n\nA 621 Example\nA number of potential error sources in the experiment have been identified. These are\nsummarized in Table 1 along with a brief description of the problem and how to decrease\nor eliminate the error.\nTable 1: Sources of Error\nSource of Error\nDescription\nMethod of Mitigation\nHysteresis\nShape memory alloys have a\nhysteresis effect that could\npotentially cause the actuators to\nget \"stuck\" in a particular state\nIn order to decrease the effects of\nhysteresis, ample cooling time will be\ngiven between consecutive test runs\nCyclic Loading\nDepending upon the frequency and\nduration of the perturbations, the\nactuators could experience several\nthousand cycles of heating and\ncooling throughout the run of the\nexperiment\nA low frequency of perturbations, and\nperiodic checks of a baseline\ncondition will be used to ensure that\nthe actuators have not deformed over\ntime.\nSensors\nCommercially available\naccelerometers will have a certain\noffset, and will drift with time\nThese errors will be corrected during\ndata analysis by shifting and rescaling\nraw data\nInconsistent\nRelease\nIf the actuators start functioning\nbefore the parachute is released or\nfully inflated, errors resulting from\ninitial conditions could occur.\nIn order to ensure that the parachute\nhas completely inflated before a test\nfunction is sent to the actuators, a\ntime delay will be built into the\nfunction generator based on the initial\ntrial run of the experiment.\nSource: Wong, B. \"Assessment of Shape Memory Alloys for Steered Parachutes \", 16.621 Design\nProposal, Fall 2002\n\nSummary\n- Design your experiment to achieve your\nobjective, satisfy your success criteria and\nassess your hypothesis.\n- The conceptual design stage starts with\nan open mind and brainstorming, and then\nuses objective criteria to select best\napproach, considering modeling fidelity\n(errors).\n- Continue to refer to or revise your HOS\n\nActive Learning\n- Working with your partner, pick one\naspect of your experimental design\n(facility, measurement,...) and develop\ntwo or more approaches.\n- Pick two or three attributes you would\nuse to select one approach over the\nother.\n- Be prepared to report to the class at the\nend of the hour."
    },
    {
      "category": "Resource",
      "title": "07_literaturesearchescitation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/9eb175d33b7a867c5307a97015d89053_07_literaturesearchescitation.pdf",
      "content": "Literature searches\nCiting sources\nDepartment of Aeronautics and\nAstronautics\n\nWhy search (and cite) the literature\nof your field?\n- Credibility: To be sure that your work is based on current,\nsound research--the best in your field.\n- Focus: To be able to place your work in context.\n- Efficiency: To be sure that you're not duplicating work\nunnecessarily.\n- Professional ethics: If you don't show your awareness of\ncurrent research and give appropriate citation, you risk\nappearing naive or arrogant or dishonest.\nDepartment of Aeronautics and\nAstronautics\n\nWhere do literature searches appear?\n- Sometimes they are separate documents.\n- More often, they are embedded in complex\ndocuments (proposals, reports, thesis).\nDepartment of Aeronautics and\nAstronautics\n\nWhere to find literature to search?\n- Start with a respected, current source, and look at\nthat author's list of sources.\n- Talk to your professor or to a professional in that\nfield.\n- Ask a reference librarian for help in searching\n- Books\n- Journal articles\n- Electronic databases\n- Conference proceedings\nDepartment of Aeronautics and\nAstronautics\n\nWhere to find literature. . . ?\n- Use the Internet judiciously.\n- Find out as much as you can about the site and\nthe site manager, the date of posting, and whether\nor not the material was peer-reviewed.\n- If a posted article is important to your work, print\nthe article for future documentation.\n- Join a professional listserve and put out a request\nfor information.\nDepartment of Aeronautics and\nAstronautics\n\nOther keys to searching\n- Know your purpose in searching the literature.\n- Narrow the scope of the material you're searching.\n- Assess the author's credibility.\n- Get a sense of how the piece of material relates to\nothers.\n- Write a summary of the key points of the article.\nDepartment of Aeronautics and\nAstronautics\n\nGather bibliographical details\nsystematically.\n- Books\n- Articles\n- Author (s) or editor's full\nname\n- Exact title\n- Publication information\n- Year of publication\n- City of publication\n- Publisher\n- Edition\n- Page numbers\n- Author (s) or editor's full\nname\n- Exact title of article\n- Publication information\n- Exact journal title\n- Volume and issue\n- Year of publication\n- Page numbers\nDepartment of Aeronautics and\nAstronautics\n\nGetting details systematically\n- Electronic sources\n- All of the information for\narticles previously listed\n- URL of the site\n- Type of source/site\n- Date you accessed it\nDepartment of Aeronautics and\nAstronautics\n\nRetrievable vs.. non-retrievable\nsources\nRetrievable sources:\n- Non-retrievable sources:\n-\nsources that anyone could\naccess.\nThese go into the list of sources\ncited at the end of the document,\nand they're noted by superscript\nnumbers in the text.\nsources that are personal;\nsources that not every member\nof the public could access\n- Unpublished papers but not\ndissertations\n- Personal Web sites\n- E-mails and conversations\nThese sources are cited in\nfootnotes and indicated by\nsymbol at the bottom of the\npage, NOT superscript\nnumbers.\nDepartment of Aeronautics and\nAstronautics\n\nAs you do the literature search,\nwhat's your purpose?\n-\nCritical or evaluative summary of information\nrelevant to your research\n- Not just a report but rather a critical discussion of\nthe validity of this work and its relevance to your\nwork.\n- Choose a method of organization that suits your\npurpose.\n- To trace development, organize your findings chronologically.\n- To reflect controversy, organize around the positions held.\nDepartment of Aeronautics and\nAstronautics\n\nWhen to cite\n- You must cite a source when you use that person's\nideas or specific facts.\n- Within quotation marks, if the quote is exact.\n- Without quotation marks, if you are paraphrasing\nor noting the key idea or fact.\n- You do not have to cite ideas/facts that are\ncommon knowledge.\nDepartment of Aeronautics and\nAstronautics\n\nHow to cite retrievable sources\naccording to AIAA standards 1\n- Journals:\n- Walker, R. E., Stone, A. R., and Shandor, M.,\n\"Secondary Gas Injection in a Conical Rocket\nNozzle,\" AIAA Journal, Vol. 1, No. 2, 1963,\npp.334-338.\n- Books:\n- Turner, M. J., Martin, H. C., and Leible, R. C.,\n\"Further Development and Applications of\nStiffness Method,\" Matrix Methods of Structural\nAnalysis, 1st ed., Vol. 1, Wiley, New York, 1963,\npp. 6-210.\nDepartment of Aeronautics and\nAstronautics\n\n- Reports:\n- Book, E., and Bratman, H., \"Using Compilers to Build\nCompilers,\" Systems Development Corp., SP-176, Santa\nMonica, CA, Aug. 1960.\n- Transactions/Proceedings:\n- Soo, S. L., \"Boundary-Layer Motion of a Gas-Solid\nSuspension,\" Proceedings of the Symposium on Interaction\nBetween Fluids and Particles, Vol. 1, Inst. of Chemical\nEngineers, New York, 1962, pp. 50-63.\nDepartment of Aeronautics and\nAstronautics\n\n- AIAA Meeting Papers:\n- Bhutta, V. A., and Lewis, C. H.,\n\"Aerothermodynamic Performance of 3-D and\nBent-Nose RVs under Hypersonic Conditions,\"\nAIAA Paper 90-3068, Aug. 1990.\n- Unpublished thesis or dissertation:\n- Glazer, Frederick G., \"Hierarchical Motion\nDetection,\" Ph.D. diss., University of\nMassachusetts, 1987.\nDepartment of Aeronautics and\nAstronautics\n\n- Web site (not a personal one)\n- Lego Mindstorms Community Page,\nhttp://mindstorms.lego.com/eng/community/resources/default/asp,\nDate accessed: 10/20/2002\nDepartment of Aeronautics and\nAstronautics\n\nHow to cite non-retrievable sources2\n- Non-retrievable sources are footnoted with\nsymbols, not with numbers.\n- Personal conversation:\n- *E.G. Greitzer, personal communication, October,\n2002.\n- E-mail:\n- **E.G. Greitzer, personal e-mail, October, 2002.\nDepartment of Aeronautics and\nAstronautics\n\nClass activity\n- Study the models handed out to see how the writer moves\nfrom one piece of literature to the next.\n- Do you get an idea of how valuable this previous work is?\nHow it relates to the writer's project?\n- With your partner, list 5 places you might find sources\nrelevant to your project and decide who will explore them.\n- Do you have some sources that are peer-reviewed (sources\nwhose validity have been reviewed by academic\ncolleagues)?\n- Check this list with your project advisor.\nDepartment of Aeronautics and\nAstronautics\n\nSources cited\n1. AIAA Web site: http://www.aiaa.org/\nDate accessed, October 3, 2002.\n2. Perelman, L., Paradis, J., Barrett, E., The\nMayfield Handbook of Technical & Scientific\nWriting, Mayfield, CA: 1998.\nDepartment of Aeronautics and\nAstronautics"
    },
    {
      "category": "Resource",
      "title": "08_testmatrices.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/06b733792f220dbce1d185949c87888a_08_testmatrices.pdf",
      "content": "Test Matrices\n16.621\nProf. Earll Murman\n\nVariables\nz Independent Variable: A quantity that you will vary and\ncontrol\n- E.G.; angle of attack, chamber pressure or temperature,\ncoefficient in algorithm, luminosity, gain, ...\nz Parameter: A quantity that is set or otherwise determined,\nwhich you will not vary but which needs to be recorded\n- E.G.; atmospheric pressure, constant in algorithm,\nbattery voltage,...\nz Dependent Variable: A measureable output quantity of\nyour experiment which is a function of the input variables\nand parameters\n- E.G.; reaction time, force, energy consumed,\ntemperature\n\nExercise\nz With your partner, write down your expected variables and\nparameters.\nz Independent Variables\nz Parameters\nz Dependent variables\n\nTest Matrices\nz A graphical display of your experimental independent\nvariables to help:\n- Covey the scope of your experiment to your audience\n- Plan and execute your experiment\nz Each cell represents a \"data point\" for your experiment for\nwhich you will collect values for the dependent variables.\nRPM\n0 mph\n5 mph\n10 mph\n15 mph\n1000 RPM\n2000 RPM\n3000 RPM\n0 RPM\nPropeller RPM\nSpeed .\nCourtesy of Cyndi Vongvanith and Lester McCoy\nIVs\nDVs\n\nMulti-Variable Experiments\n- Factor = Number of independent variables\n- Four-Factor experiment has 4 independent variables\n- Level = A given value of an independent variable\n- Numerical - 200, 300, 400 ...\n- Qualitative - Brand x, Brand y, Brand z ...\n- Full-Factorial Experiment\n- All factors at all levels\n- May lead to a huge number of data points.\n- Fractional-Factorial Experiment\n- Expert judgement: carefully selected subset\n- Adaptive: decide as you get some data\n- Design of Experiments: Taguchi, orthogonal arrays\n- Beyond scope of 16.62X\n\nPresentation of Test Matrices: Full Factorial\n- Test matrix used for graphical representation of test plan\n- Define: An = nth level of factor A\n- One variable matrix\n- Two variable matrix\n- Three variable matrix\nm\nm\nm\nm\nn\nn\nB\nA\nB\nA\nB\nA\nB\nA\nB\nA\nB\nA\nB\nA\nB\nA\nB\nA\nΛ\nΜ\nΟ\nΜ\nΜ\nΛ\nΛ\nA1 B1 C1\nA4 B3 C2\nIV\nA1\n...\nAn\nDV1\nDV2\nDV3\n\n- N- variable matrix\n- Creativity needed\n- Stamina will probably also be required!\nD1 E1 F1\nD4 E3 F2\nD1 E1 F1\nD4 E3 F2\nFor A1 B1:\nFor A2 B7:\nPresentation of Test Matrices: Full Factorial\n\nExpert Judgement Approach\n- Eliminate some combinations\nof independent variables to\nreduce the total number of data\npoints\n- Often required to make\nexperiment feasible within time\nand budget constraints\n- Strategies for elimination\n- Insight from previous\ntheory or experiments\n- Wisdom from advisor or\nother subject matter expert\n- Logical thought about\ninterrelationship of\nvariables on the physics of\nthe problem\n\nAdaptive Approach\n- Preliminary Runs\n- Use theory to bracket range\n- 2 or 3 test cases to check set-up\n- Compare with theory\n- Production Runs\n- Data range and spacing\n- May not be uniform\n- Cluster samples in\n\"interesting areas\"\nRun\nData\nRun\nData\n\nAdditional Considerations\nz Repeatability: Is there reason to believe that the\nmeasurement accuracy will be increased if multiple \"runs\"\nare made with the same independent variables and\nparameters?\nz Hysteresis: Is there reason to believe the physical effect\nbeing studied may depend upon the sequence or rate in\nwhich you vary the independent variable?\nz Learning: Is the reason to believe your human subjects or\nintelligent software will become more capable during the\nexperiment through learning?\nz Fatigue: Will your subjects become less capable during the\ntest due to tiring?\nRefer to backup slides for more information.\n\nHysteresis\nz Hysteresis - \"The lagging of an effect behind its cause, as\nwhen the change in magnetism of a body lags behind\nchanges in the magnetic field.\" http://www.dictionary.com/\n- Feature of physical problem be studied\n- Feature of measurement device (undesirable)\nz Example - pitching vs fixed delta wing\nα increasing\nα decreasing\nα fixed\nHysteresis depends\nupon pitching rate\n\nLearning\nz \"The act, process, or experience of gaining knowledge or\nskill\" http://www.dictionary.com/\nz The response of a human subject changes as an experiment\nproceeds because they gain skill or knowledge - the\nexperiment changes the subject!\nz E.G. measuring a response of a human to a video game\nexperiment\n- Test 1 and Test 2 are different, but subject learns how\nto play the game in test 1 and can respond more quickly\nin test 2.\nz Typical mitigation strategies\n- Train subjects to fix skill level\n- Test many subjects and vary the order of the test\nsequence to average out the learning effect.\n\nFatigue\nz Fatigue: \"Physical or mental weariness resulting from\nexertion.\" http://www.dictionary.com/\nz This is different than learning\n- Learning leads to a new skill level\n- Fatigue is a temporary loss of capability\nz Fatigue can effect both the subject and the experimenter\n- Needs to be considered in the design of the execution of\nthe experiment\nz Fatigue can also apply to physical materials"
    },
    {
      "category": "Resource",
      "title": "09_measurement03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/bb1c0a906b690832fad0c2e02982e165_09_measurement03.pdf",
      "content": "EXPERIMENTAL MEASUREMENT:\nMETHODS AND METHODOLOGY\nStrategies and Tactics for Measurements in\n16.62x\n16.621 Experimental Projects Lab I\n\nBASIS FOR MEASUREMENT\n- Whatever exists, exists in some amount\n- Our goals:\n- Measure the appropriate quantity,\n- Measure with the appropriate accuracy,\nto allow us to assess our hypothesis\n- Some questions:\n- What data do we need?\n- What do we measure?\n- How do we measure?\n- How well do we need to measure?\n- What do we do with the data?\n\nERROR AND UNCERTAINTY IN MEASUREMENT\n- This is the subject of a future class, but the idea is so important that\nI mention it today as well\n- In engineering the word \"error\", when used to describe an aspect of\nmeasurement does not necessarily carry the connotation of mistake\nor blunder (although it can!)\n- Error in a measurement means the inevitable uncertainty that\nattends all measurements\n- We cannot avoid errors in this sense\n- We can ensure that they are as small as reasonably possible and\nthat we have a reliable estimate of how small they are\n[Adapted from Taylor, J. R, \"An Introduction to Error Analysis; The Study of\nUncertainties in Physical Measurements\"]\n\nSOME GENERAL MEASUREMENT CONCEPTS\n- The measurement exists in some context\n- We want to do this measurement because.......\n- The context (and objective) shapes the measurement strategy and\ntactics [\"Begin with the end in mind\"- Steven Covey]\n- You generally do not directly measure the quantity you want\n- Most measurement devices are systems which translate the\nmeasured quantity (voltage, for example) into the quantity you\nwant (pressure)\n- All measurements have some uncertainty, or error, connected with\nthem\n- It is important to know not only the result of the measurement but\nalso the fidelity of the result (how big is the uncertainty, how\nmuch can I trust the answer?)\n\nELEMENTS OF A MEASUREMENT SYSTEM\nMeasured\nMedium\nObserver\nVariable\nManipulation\nElement\nPrimary\nSensing\nElement\nVariable\nConversion\nElement\nData\nTransmission\nElement\nData\nStorage/Playback\nElement\nData\nPresentation\nElement\nSensing\nSignal Conditioning\nReadout\nAdapted from Ernest O. Doebelin, Measurement Systems: Application and Design, McGraw Hill\n\nMEASUREMENT ELEMENT DEFINITIONS\n- Primary Sensing element\n- Retrieves energy from the measured system\n- Produces some form of output\n3⁄4 Strain gage, thermometer tip\n- Variable conversion element\n- Changes data from one physical form to another\n3⁄4 Elongation to resistance, temperature to volume change\n- Variable manipulation element\n- Performs mathematical operation on data\n3⁄4 Amplifier, filter\nAdapted from Ernest O. Doebelin, Measurement Systems: Application and Design, McGraw Hill\n\nMEASUREMENT ELEMENT DEFINITIONS\n- Data transmission element\n- Gets data between measurement elements\n3⁄4 Wire, speedometer cable, satellite downlink system\n- Data storage/playback element\n- Stores data for later retrieval\n3⁄4 Hard drive, RAM\n- Data presentation element\n- Gets data to form detectable by human\n3⁄4 Indicators, alarms, analog recording, digital recording\nAdapted from Ernest O. Doebelin, Measurement Systems: Application and Design, McGraw Hill\n\nOBSERVATIONS ABOUT THE ELEMENTS\n- Two primary functions\n- Extract data\n- Present data\n- Two points of intended contact with the \"outside world\"\n- Functional blocks\n- Can have more than one of each type\n- Not all measurement systems have all functions\n- May be in any sequence (except primary sensing and data\npresentation)\n\nERROR ANALYSIS\n- Error is inherent in experimental process\nUncontrolled Inputs (Co-Factors)\nDiscrete Error\nControlled\nInputs\n(Factors)\nls\nHumans\nExperiment\nAmb Cond\nInst Drift\nMateria\nMachine\nVariation\nOutputs\n(Responses)\nContinuous Error\n\n16.622 MEASUREMENT GOALS\nOur goals:\n-\nMeasure the appropriate quantity (DO THE RIGHT THING)\n- Measure with the appropriate accuracy (DO THE THING\nRIGHT)\n- This is not only strategy (selecting the needed accuracy)\nbut also implementation (being able to carry out the\nmeasurement)\n- To do this, you may have to learn something about\ndiffererent specific measurement methods\n\n16.622 MEASUREMENT GOALS?\n[ONE SIZE DOES NOT FIT ALL]\nJonker/Yenson (Prototype Rowing Blades)\n- 10% change in oar performance\nDiedrich/Smith (Vortex Breakdown)\n- 10% agreement with predictions of theory\nPigeon/Whitaker (Near Vacuum Hall Thruster)\n- Measureable thrust\n- YES-NO Result, BUT result must be able to be\ndemonstrably different than measurement uncertainties\n\nAN EXERCISE CONCERNING THE GREITZER-\nSPAKOVSZKY 16.62X TEAM PROJECT\nHypothesis proposed by our advisor, Murman: The\nthermodynamic loss in the flow through a blade row in a jet\nengine is less than 2% of the inlet dynamic pressure\nObjective: Go to Pratt&Whitney, obtain a blade row, measure\nthe loss\nSuccess criterion: Establishing the loss through the blade row\nto an accuracy such that the hypothesis can be assessed\n- What does all this mean for the measurements we need?\n- What would the final \"slam dunk viewgraph\" look like?\n- We want to measure \"loss\". How do we do this?\n- How well do we need to do it?\n\n16.050 TO THE RESCUE\n- Entropy = loss (half of what I learned in 16.050)\n- How do I measure entropy?\n- Who in the department has an entropy meter?\n- What do I need to measure?\n- Suppose my measurements have an \"uncertainty\" of + 1% of the\ndynamic pressure\n- What would be a success?\n- Suppose my measurements have an \"uncertainty\" of + 0.1% of\nthe dynamic pressure\n- What would be a success?\n- Suppose my measurements have an \"uncertainty\" of + 10% of\nthe dynamic pressure\n- Can I succeed?\n\nA TURN TO YOUR PARTNER EXERCISE\n- For your project:\n- List the quantities you need to know to assess yourhypothesis\n- Define why these quantities are necessary\n- Are these the actual quantities that you will measure? (Is measuring\nthe voltage output of a pressure transducer the same as measuring\nthe pressure directly?)\n- If not, what are the quantities that you will be measuring?\n- If not, what are the ideas, principles, etc. that you will use to\nconnect the two\n- How well does the measurement have to be made?\n\nA TURN TO YOUR PARTNER EXERCISE\n- Pick a variable that is important for your experiment\n- Describe the:\n- sensors\n- Instrumentation\n- measurement chain\nyou will need to obtain the data.\n\nUNDERSTANDING MEASUREMENT DEVICES\nDevices are specified by stating things such as...\n- Accuracy and Precision\n- Static Sensitivity\n- Zero Drift and Sensitivity Drift\n- Linearity\n- Resolution\n- Threshold\n- Hysteresis (dead band)\n- Readability\n- Span\n- Dynamic Performance\n\nACCURACY AND PRECISION\nAccuracy of a measurement is a measure of how close the result of the\nexperimen is to the true value\nAccuracy is a measure of the correctness of the experiment\nPrecision is a measure of how well the result was determined, without\nreference to its agreement with the true value\nBevington, P. R. and Robinson, D. K, 1992, \"Data Reduction and Error\nAnalysis for the Physical Sciences\"\n\nMEASUREMENT ACCURACY AND PRECISION\nAccurate?___\nAccurate?___\nPrecise? ___\nPrecise? ___\nAccurate?___\nAccurate?___\nPrecise? ___\nPrecise? ___\n\nCALIBRATION\n- Once a measurement device is selected, it must be\ncalibrated\n- Calibration - Comparison of instrument's reading to a\ncalibration standard\n- Calibration standard created from a measurement\n- Inherent error\n- Rule of thumb: Calibration standard 10x accuracy of the\ninstrument being calibrated\n- Basic issue is how do we know that what we record has any\nrelation to what we wish to measure?\n\nSENSITIVITY\n- Quantity of output for each unit of input\n- For 1 unit of input:\n- 10 units of output = more sensitivity\n- 1 unit of output = less sensitivity\n- Sensitivity is not accuracy!\n\nSTILL MORE..........\n- Resolution\n-\n- Threshold\n-\nSmallest smallest\ndetectable change\nSmallest detectable value\nOutput\n- Hysteresis (dead band)\nInput\n- Loop resulting from\ncomplete calibration\nusing monotonically\nchanging values\nInput\nOutput\n\nMEASUREMENT METHODS\n- Ask your advisor\n- Ask lab staff\n- Texts or articles\n- e.g., Beckwith, T. G., Mechanical Measurements, Addison\nWesley\n- e.g., Ernest O. Doebelin, Measurement Systems: Application\nand Design, McGraw Hill\n\nMEASUREMENT METHODS: MIT Video Tapes\n- Introduction to Measurement\n- Calibration, Accuracy and Error\n- Mass, Force, Strain, Torque and Pressure\nMeasurement\n- Measuring Dynamic Variables\n- Fluid Quantity and Flow\n- Infrared Temperature Measurement\n- Contact Temperature Measurement\nAvailable in Aero-Astro Library for Viewing\n\nSOME GENERAL MEASUREMENT CONCEPTS\n- The measurement exists in some context\n- We want to do this measurement because.......\n- The context (and objective) shapes the measurement strategy and\ntactics [\"Begin with the end in mind\"]\n- You generally do not directly measure the quantity you want\n- Most measurement devices are systems which translate the\nquantity you measure (voltage, for example) into the quantity you\nwant (pressure)\n- All measurements have some uncertainty, or error, connected with\nthem\n- It is important to know not only the result of the measurement but\nalso the fidelity of the result (how big is the uncertainty, how\nmuch can I trust the answer?)"
    },
    {
      "category": "Resource",
      "title": "10_errors03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/95611e0d7e8670a26d6f04d90dc9733f_10_errors03.pdf",
      "content": "ERROR ANALYSIS\n(UNCERTAINTY ANALYSIS)\n16.621 Experimental Projects Lab I\n\nTOPICS TO BE COVERED\n-\nWhy do error analysis?\n-\nIf we don't ever know the true value, how do we estimate the error\nin the true value?\n-\nError propagation in the measurement chain\n- How do errors combine? (How do they behave in general?)\n- How do we do an end-to-end uncertainty analysis?\n- What are ways to mitigate errors?\n-\nA hypothetical dilemma (probably nothing to do with anyone in the\nclass)\n- When should I throw out some data that I don't like?\n- Answer: NEVER, but there are reasons to throw out data\n-\nBackup slides: an example of an immense amount of money and\neffort directed at error analysis and mitigation - jet engine testing\n\nERROR AND UNCERTAINTY\n-\nIn engineering the word \"error\", when used to describe an aspect of\nmeasurement does not necessarily carry the connotation of mistake\nor blunder (although it can!)\n-\nError in a measurement means the inevitable uncertainty that\nattends all measurements\n-\nWe cannot avoid errors in this sense\n-\nWe can ensure that they are as small as reasonably possible and\nthat we have a reliable estimate of how small they are\n[Adapted from Taylor, J. R, An Introduction to Error Analysis;\nThe Study of Uncertainties in Physical Measurements]\n\nUSES OF UNCERTAINTY ANALYSIS (I)\n-\nAssess experimental procedure including identification of\npotential difficulties\n- Definition of necessary steps\n- Gaps\n-\nAdvise what procedures need to be put in place for measurement\n-\nIdentify instruments and procedures that control accuracy and\nprecision\n- Usually one, or at most a small number, out of the large set of\npossibilities\n-\nInform us when experiment cannot meet desired accuracy\n\nUSES OF UNCERTAINTY ANALYSIS (II)\n-\nProvide the only known basis for deciding whether:\n- Data agrees with theory\n- Tests from different facilities (jet engine performance) agree\n- Hypothesis has been appropriately assessed (resolved)\n- Phenomena measured are real\n-\nProvide basis for defining whether a closure check has been\nachieved\n- Is continuity satisfied (does the same amount of mass go in\nas goes out?)\n- Is energy conserved?\n-\nProvide an integrated grasp of how to conduct the experiment\n[Adapted from Kline, S. J., 1985, \"The Purposes of Uncertainty\nAnalysis\", ASME J. Fluids Engineering, pp. 153-160]\n\nUNCERTAINTY ESTIMATES AND HYPOTHESIS ASSESSMENT\nMass [g]\nDistance [cm]\nMass [g]\nDistance [cm]\nMass [g]\nDistance [cm]\n\nHOW DO WE DEAL WITH NOT KNOWING\nTHE TRUE VALUE?\n-\nIn \"all\" real situations we don't know the true value we are\nlooking for\n-\nWe need to decide how to determine the best\nrepresentation of this from our measurements\n-\nWe need to decide what the uncertainty is in our best\nrepresentation\n\nAN IMPLICATION OF NOT KNOWING THE TRUE VALUE\n-\nWe easily divided errors into precision (bias) errors and random\nerrors when we knew what the value was\n-\nThe target practice picture in the next slide is an example\n-\nHow about if we don't know the true value? Can we, by looking at\nthe data in the slide after this, say that there are bias errors?\n-\nHow do we know if bias errors exist or not?\n\nA TEAM EXERCISE\n-\nList the variables you need to determine in order to carry out your\nhypothesis assessment\n-\nWhat uncertainties do you foresee? (Qualitative description)\n-\nAre you more concerned about bias errors or random errors?\n-\nWhat level of uncertainty in the final result do you need to assess\nyour hypothesis in a rigorous manner?\n-\nCan you make an estimate of the level of the uncertainty in the final\nresult?\n- If so, what is it?\n- If not, what additional information do you need to do this?\n\nHOW DO WE COMBINE ERRORS?\n-\nSuppose we measure quantity X with an error of dx and quantity Y\nwith an error of dy\n-\nWhat is the error in quantity Z if:\n- Z = AX where A is a numerical constant such as π?\n- Z = X + Y?\n- Z = X - Y?\n- Z = XY?\n- Z = X/Y?\n- Z is a general function of many quantities?\n\nERRORS IN THE FINAL QUANTITY\n-\nZ = X + Y\n-\nLinear combination\n-\n- Error in Z is\nBUT this is worst case\n-\nFor random errors we could have\n-\nor\n- These errors are much smaller\n-\nIn general if different errors are not correlated, are\nindependent, the way to combine them is\n-\nThis is true for random and bias errors\nZ + dz = X + dx + Y + dy\ndz = dx + dy\ndz = dx -dy\ndy -dx\ndz =\ndx2 + dy2\n\nTHE CASE OF Z = X - Y\n-\nSuppose Z = X - Y is a number much smaller than X or Y\n-\nSay (say 2%)\n-\nmay be much larger than\n-\nMESSAGE ==> Avoid taking the difference of two numbers of\ncomparable size\ndx\nX = dy\nY = ε\ndz =\ndx2 + dy2\ndz\nZ =\n2 dx\nX -Y\ndx\nX\n\nESTIMATES FOR THE TRUE VALUE AND THE ERROR\n-\nIs there a \"best\" estimate of the true value of a quantity?\n-\nHow do I find it?\n-\nHow do I estimate the random error?\n-\nHow do I estimate the bias error?\n\nSOME \"RULES\" FOR ESTIMATING\nRANDOM ERRORS AND TRUE VALUE\n-\nAn internal estimate can be given by repeat measurements\n-\nRandom error is generally of same size as standard deviation (root\nmean square deviation) of measurements\n-\nMean of repeat measurements is best estimate of true value\n-\nStandard deviation of the mean (random error) is smaller than\nstandard deviation of a single measurement by\n-\nTo increase precision by 10, you need 100 measurements\n1 Number of measurements\n\nGENERAL RULE FOR COMBINATION OF ERRORS\n-\nIf Z = F (X1, X2, X3, X4) is quantity we want\n-\nThe error in Z, dz, is given by our rule from before\n-\nSo, if the error F due to X1 can be estimated as\nand so on\n-\n-\nThe important consequence of this is that generally one or few of\nthese factors is the main player and others can be ignored\ndF1 = ∂F\n∂X1\ndx1\nInfluence coeff.\nError in X1\n\ndz =\n∂F\n∂X1\n\ndx1\n2 +\n∂F\n∂X2\n\ndx2\n2 +\"\n∂F\n∂Xn\n\ndxn\n\nDISTRIBUTION OF RANDOM ERRORS\n-\nA measurement subject to many small random errors will be\ndistributed \"normally\"\n-\nNormal distribution is a Gaussian\n-\nIf x is a given measurement and X is the true value\n-\nσ is the standard deviation\nGaussian or normal distribution =\nσ 2π e-x-X2\n(\n) 2σ2\n\nA REVELATION\n-\nThe universal gas constant is\naccepted R = 8.31451 ±0.00007 J/mol K\n-\nThis is not a true value but can be \"accepted\" as one\n\nONE ADDITIONAL ASPECT OF COMBINING ERRORS\n-\nWe have identified two different types of errors, bias (systematic)\nand random\n- Random errors can be assessed by repetition of measurements\n- Bias errors cannot; these need to be estimated using external\ninformation (mfrs. specs., your knowledge)\n-\nHow should the two types of errors be combined?\n- One practice is to treat each separately using our rule, and then\nreport the two separately at the end\n- One other practice is to combine them as \"errors\"\n-\nEither seems acceptable, as long as you show that you are going\nto deal (have dealt) with both\n\nREPORTING OF MEASUREMENTS\n-\nExperimental uncertainties should almost always be\nrounded to one significant figure\n-\nThe last significant figure in any stated answer should\nusually be of the same order of magnitude (in the same\ndecimal position) as the uncertainty\n[from Taylor, J., An Introduction to Error Analysis]\n\nCOMMENTS ON REJECTION OF DATA\n-\nShould you reject (delete) data?\n-\nSometimes on measurement appears to disagree greatly with all\nothers. How do we decide:\n- Is this significant?\n- Is this a mistake?\n-\nOne criteria (Chauvenaut's criteria) is as follows\n- Suppose that errors are normally distributed\n- If measurement is more than M standard deviations (say 3),\nprobability is < 0.003 that measurement should occur\n- Is this improbable enough to throw out measurement?\n-\nThe decision of \"ridiculous improbability\" [Taylor, 1997] is up to\nthe investigator, but it allows the reader to understand the basis\nfor the decision\n- If beyond this range, delete the data\n\nA CAVEAT ON REJECTION OF DATA\n-\nIf more than one measurement is different, it may be that\nsomething is really happening that has not been envisioned, e.g.,\ndiscovery of radon\n-\nYou may not be controlling all the variables that you need to\n-\nBottom line: Rigorous uncertainty analysis can give rationale to\ndecide what data to pay attention to\n\nSUMMARY\n-\nBoth the number and the fidelity of the number are important in a\nmeasurement\n-\nWe considered two types of uncertainties, bias (or systematic\nerrors) and random errors\n-\nUncertainty analysis addresses fidelity and is used in different\nphases of an experiment, from initial planning to final reporting\n- Attention is needed to ensure uncertainties do not invalidate\nyour efforts\n-\nIn propagating uncorrelated errors from individual measurement to\nfinal result, use the square root of the sums of the squares of the\nerrors\n- There are generally only a few main contributors (sometimes\none) to the overall uncertainty which need to be addressed\n-\nUncertainty analysis is a critical part of \"real world\" engineering\nprojects\n\nSOME REFERENCES I HAVE FOUND USEFUL\n-\nBaird, D. C., 1962, Experimentation: An Introduction to Measurement\nTheory and Experiment, Prentice-Hall, Englewood Cliffs, NJ\n-\nBevington, P. R, and Robinson, D. K., 1992, Data Reduction and\nError Analysis for the Physical Sciences, McGraw-Hill, New York, NY\n-\nLyons, L., 1991, A Practical Guide to Data Analysis for Physical\nScience Students, Cambridge University Press, Cambridge, UK\n-\nRabinowicz, E, 1970, An Introduction to Experimentation, Addison-\nWesley, Reading, MA\n-\nTaylor, J. R., 1997, An Introduction to Error Analysis, University\nScience Books, Sauselito, CA\n\nBACKUP EXAMPLE: MEASUREMENT OF JET ENGINE\nPEFORMANCE\n-\nWe want to measure Thrust, Airflow, and Thrust Specific Fuel\nConsumption (TSFC)\n- Engine program can be $1B or more, take three years or more\n- Engine companies give guarantees in terms of fuel burn\n- Engine thrust needs to be correct or aircraft can't take off in\nthe required length\n- Airflow fundamental in diagnosing engine performance\n- These are basic and essential measures\n-\nHow do we measure thrust?\n-\nHow do we measure airflow?\n-\nHow do we measure fuel flow?\n\nTHRUST STANDS\n-\nIn practice, thrust is measured with load cells\n-\nThe engines, however, are often part of a complex test facility\nand are connected to upstream ducting\n-\nThere are thus certain systematic errors which need to be\naccounted for\n-\nThe level of uncertainty in the answer is desired to be less than\none per cent\n-\nThere are a lot of corrections to be made to the raw data\n(measured load) to give the thrust\n\nTEST STAND-TO-TEST STAND DIFFERENCES\n-\nWant to have a consistent view of engine performance no matter\nwho quotes the numbers\n-\nThis means that different test stands must be compared to see\nthe differences\n-\nAgain, this is a major exercise involving the running of a jet\nengine in different locations under specified conditions\n-\nThe next slide shows the level of differences in the\nmeasurements"
    },
    {
      "category": "Resource",
      "title": "bennettw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/25418a50c4c18c32e5f6f4b4a5f391ba_bennettw.pdf",
      "content": "1/30/2003\nSimulating and Testing Ice Screw Performance in the Laboratory\nFinal Design Proposal\n16.621\nFall 2002\nAuthor: Warren Bennett\nAdvisor: Dr. Kim Blair\nPartner: Stefano Alziati\n10th December 2002\nW. Bennett\nPage 1\n\n1/30/2003\nExecutive Summary\nIce screws are protection devices that allow climbers to anchor themselves to ice. This\nproject is a response to the current lack of any controlled testing procedure for ice\nscrews, and the perceived margin for improvement of ice screw design and usage in the\nfield. This project develops a quantitative, repeatable test methodology for ice screws.\nThis project is of value to the technical and the climbing community because it will\ncreate a methodology for making 'climbing ice' types in the lab. The project will provide\ndata on current safety standards of ice climbing equipment. It is also hoped that this\nstudy will reduce the failure rate in ice climbing by being the first step towards the\nimprovement of such protective equipment, and in educating climbers about the limits\nof their equipment and how to use that equipment most effectively.\nThis project replicates natural ice formations in the laboratory by testing a set of\nmethodologies of ice manufacture and analyzing the ice specimens obtained through a\nseries of prescribed measurements. The objective is to obtain two distinctly different types\nof ice. Once repeatable ice formation has been achieved, the variables affecting ice\nscrew safety can be tested in the test bed. All testing will occur on the MTS machine\nfound in\nTELAC\n(Technology Laboratory for Advanced Composites). Statistical\ntechniques will be used in the processing and presentation of data, and in evaluating\nthe level of success of the project.\nThe projected budget for the project is $2,884. The bulk of expenditure is the purchase of\nthe ice screws themselves at $50 per screw. It is hoped that sponsorship for this aspect of\nthe project will be found through negotiations with equipment manufacturers.\nThe project schedule indicates that data collection will be completed in week 9, two\nweeks before the end of data collection in 622. This gives 2 weeks of leeway before the\nfinal day to collect data in 16.622 for potential problems.\nW. Bennett\nPage 2\n\n1/30/2003\nTable Of Contents\nList Of Figures ........................................................................................................................5\nList of Tables..........................................................................................................................5\n1. Introduction ......................................................................................................................6\n1.1 Background ................................................................................................................6\n1.2 Summary of Project .....................................................................................................8\n1.3 Value to Technical and Climbing Community...........................................................9\n2. Statement of Project.......................................................................................................10\n3. Literature Review ............................................................................................................11\n3.1 Understanding Ice ....................................................................................................11\n3.1.1 Ice Structure .......................................................................................................11\n3.1.2 Ice Formation (morphology) ..............................................................................12\n3.1.3 Micromechanics of Failure.................................................................................12\n3. 2 Ice Testing Results.....................................................................................................12\n3.2.1 Compressive Strength ........................................................................................12\n3.2.2 Flexural Strength.................................................................................................13\n3.2.3 Ice Rheology ......................................................................................................13\n3.2.4 Temperature Dependency................................................................................14\n3.2.5 Impact Testing on Ice.........................................................................................14\n3.3 How to make Ice ......................................................................................................15\n3.4 Ice Screw Testing ......................................................................................................15\n3.4.1 The Harmston/Luebben Study............................................................................15\n3.4.2 Black Diamond internal study ............................................................................16\n3.5 Summary ...................................................................................................................16\n4. Technical Approach.......................................................................................................17\n5. Experimental Design .......................................................................................................18\n5.1 Basic Concepts.........................................................................................................18\n5.1.1 Preliminary Testing ..............................................................................................18\n5.1.2 Stage 1: The Characterization of Ice .................................................................19\n5.1.2 Stage 2: Testing of Ice Screws in Ice ..................................................................22\n5.2 Error Analysis..............................................................................................................25\n5.3 Test Matrices .............................................................................................................26\n5.3.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics.........26\n5.3.2 Stage 2: Testing of Ice Screws in Ice ..................................................................27\nW. Bennett\nPage 3\n\n1/30/2003\nIndependent Variables ..............................................................................................27\n5.4 Safety Concerns........................................................................................................28\n6. Data Analysis ..................................................................................................................29\n6.1 Data Processing ........................................................................................................29\n6.1.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics.........29\n6.1.2 Stage 2: Testing of Ice Screws in Ice ..................................................................29\n6.2 Data Reduction ........................................................................................................29\n6.2.1 Stage 1: ..............................................................................................................30\n6.2.2 Stage 2: ..............................................................................................................30\n6.3 Correlation................................................................................................................30\n7. Project Planning..............................................................................................................32\n7.1 Budget ......................................................................................................................32\n7. 2 Schedule..................................................................................................................33\n8. Conclusion......................................................................................................................35\n9. Acknowledgements .......................................................................................................35\n10. References ....................................................................................................................36\nAppendix A - Recipe for Ice Formation .............................................................................37\nAppendix B - Engineering Drawings, MTS Mounting Apparatus, Stage 2 testing...............39\nAppendix C - Engineering Drawings, ASTM Grips ..............................................................40\nAppendix D - Detailed Parts List.........................................................................................42\nW. Bennett\nPage 4\n\n1/30/2003\nList Of Figures\nFigure 1: Illustrating a climber on an ice face ......................................................................6\nFigure 2: An ice screw ...........................................................................................................7\nFigure 3: A schematic crystal structure of Ih ice..................................................................11\nFigure 4: A spring and dashpot model of ice. ....................................................................13\nFigure 5: MST test apparatus in TELAC. ...............................................................................20\nFigure 6: Schematic of tensile test ......................................................................................21\nFigure 7: Schematic of compressive test ............................................................................21\nFigure 8: Impact testing......................................................................................................21\nFigure 9: Ice screw placement angle.................................................................................23\nFigure 10: Showing the rig for securing the ice specimen during stage 2. .........................24\nFigure 11: Test matrix for stage 1 (each block consists of 4 data points)............................27\nFigure 12: test matrix for stage 2 (each block consists of 4 data points). ...........................28\nFigure 13: Graphs showing scattered normal distributions.................................................30\nFigure 14: Front and right-hand views of stage 2 MTS mounting apparatus......................39\nFigure 15: Third angle projection of main ASTM grips. .......................................................40\nFigure 16: Third angle projection of the connectors...........................................................41\nList of Tables\nTable 1: The proposed budget ...........................................................................................32\nTable 2: The proposed schedule ........................................................................................33\nW. Bennett\nPage 5\n\n1/30/2003\n1. Introduction\n1.1 Background\nAs a sport, ice climbing has been a growth area in the last 10 years. Ever since Yvon\nChouinard introduced the first rigid crampons and curved ice picks in the late 1960's,\nclimbers have been refining techniques and developing equipment in order to push the\nlimits of ice climbing (see Figure 1).\nFigure 1: Illustrating a climber on an ice face*\nOne of the current limitations on ice climbing is the strength of the anchors that the\nclimbers use. Current research into better protection is based on anecdotal evidence\nand lacks a controlled methodology for test or evaluation. Ice screws are the main\nprotection type; thus, for the purposes of this investigation, the focus is solely on ice\nscrews.\n* photograph taken by Luca Marinelli, exhibited courtesy of project adv isor, David Custer.\nW. Bennett\nPage 6\n\n1/30/2003\nIce screws are pieces of climbing safety gear that are used as anchors on a route. This\nroute can be led (when the climber places his own protection on the route) or top-roped\n(a rope anchored at the top of the climb). The climber is then attached to the screw by\na carabiner through the hanger and is thus anchored to the climbing face. Figure 2\nbelow shows an ice screw.\nScrew\nHanger\nFigure 2: An ice screw\nThe ice screw itself consists of a hollow screw that is turned into the ice by use of a\n'hanger' on its end. The screw first 'bites' the ice with a set of sharp, beveled teeth; as it is\nturned the ice is forced out through the center of the hollow screw. In order to reduce\nfriction, both the inside surface and outside threaded surface of the screw are machined\nto be smooth. The screw is usually in the range of 10-22 cm long and has a diameter of 17\nmm, the hanger is typically around 8 cm long. Screws can be made from steel or\ntitanium.\nIce screws provide effective anchoring, if placed properly, but, like all protection\ndevices, they are subject to the changeable nature of the ice environment. Proper\nW. Bennett\nPage 7\n\n1/30/2003\nplacement is defined as placing the screw in good ice and at an orientation that allows\nthe loading to be held by the screw threads, so the load path runs the length of the\nscrew.\nThe essence of good ice protection is speed and reliability. The gear must be placed in\ntens of seconds to minimize climb-time and thus fatigue. It must also sustain the forces\nproduce in the event of a fall (around 10 kN).\nExisting research is lacking in the area of ice protection technology. There a few\ndocumented tests in the public domain, but these tests have not been sufficiently\ncontrolled. The statistics from these tests, notably the Harmston, Luebben study in 19971\nand the study commissioned by Black Diamond,2 lead to the conclusion that there is\nroom for improvement in ice protection performance.\nThere have been numerous papers into the study of ice mechanics and also into the\nstudy of the rheological nature of ice. This forms the basis of the literature review in\nsection 3.\n1.2 Summary of Project\nThe motivation for this project is twofold. Firstly, the poor performance of ice screws in\nexisting tests. Secondly, the lack of repeatability of the existing tests. It is believed that\nwith a standardized testing procedure, ice protection improvement will be possible.\nThe project goals are, first, to produce a realistic simulation of the ice in the lab, and,\nsecond, to test the factors that affect the safety of ice screws and their placement. In\norder to realize this project, the procedure is:\n1)\nInvestigate and understand ice types and their formation\n2)\nDevelop a method of repeatably replicating the ice flows\n3)\nDevelop a controlled methodology for testing the factors that affect the\nsafety of the placement of ice screws.\nSuccessful completion of the primary goal will permit controlled testing and evaluation of\nice screws and will allow the industry to initiate standardized testing of ice protection,\nW. Bennett\nPage 8\n\n1/30/2003\n1.3 Value to Technical and Climbing Community\nThis project is of value to the technical and the climbing community because it will\ncreate a methodology for making \"climbing ice\" types in the lab. There is no data\navailable on repeatable ice formation processes for testing ice-climbing equipment in\nthe public domain. If ice is effectively simulated in the laboratory, the industry will be\ncloser to setting safety standards and thus providing safer protection for climbers\neverywhere. An inexpensive, reliable and realistic lab-based testing method for ice\nprotection would give strong support to the development of ice protection beyond its\npresent state.\nIf the first part of the experiment is fulfilled, then this project will go on to provide data on\ncurrent safety standards of ice climbing equipment. It is also hoped that this study will\nreduce the failure rate in ice climbing by being the first step in educating climbers about\nthe limits of their equipment and how to use that equipment most effectively.\nW. Bennett\nPage 9\n\n1/30/2003\n2. Statement of Project\nPrimary Hypothesis:\nThe structure and morphology of different types of ice formations can be characterized\nand simulated in a lab to provide a \"test bed\" useful for assessment of ice screws.\nSecondary Hypothesis:\nIf the above hypothesis is true, then using the simulated ice, the variables affecting screw\nplacement safety can be determined.\nThe objectives are then, firstly, to develop a repeatable means of reproducing ice in a\nlab and to characterize this ice using rheological data or to understand why ice cannot\nbe simulated in the lab, and secondly, to use this ice model to test simulated falls on ice\nscrews in a manner closely related to climbing conditions.\nThe success criteria that will be used to measure the project are:\n1)\na) If hypothesis 1 is true, then success is characterizing the critical rheological\nproperties of ice.\nb) If hypothesis 1 is false, then success is identifying why ice cannot be made\nsuccessfully.\n2)\na)\nIf hypothesis 2 is true, then success is the development of a test for ice\nscrew safety that produces consistent data and repeatable data.\nb)\nIf hypothesis 2 is false, then success is identifying why ice screw\nperformance cannot be characterized.\nW. Bennett\nPage 10\n\n1/30/2003\n3. Literature Review\nThe three topics of the literature review cover: the understanding of ice, ice testing\nresults, and ice screw testing.\n3.1 Understanding Ice\nThis section covers ice structure, ice formation, and the micro mechanics of ice failure\n3.1.1 Ice Structure\nIce is close to melting at the temperatures at which it is encountered in climbing (around\n0o, according to the Harmston and Luebben study1). As such, it is a 'high temperature'\nmaterial that exhibits a wide variety of behavior that is dependent on a number of\nfactors. Ice can creep with little applied stress, or it can fracture in a brittle manner. Thus,\nclassical solutions do not work for analysis of ice; it is neither a 'simple elastic' nor an\n'elastic/plastic' solid. Instead, specific methods for its characterization must be\nundertaken.\nAccording to Schulson3, ice has 12 different crystallographic structures and 2 amorphous\nstates. The particular structure formed most commonly in nature is the Ih-type. This is\nformed by simply freezing water and has a hexagonal structure (see Figure 3).\nFigure 3: A schematic crystal structure of Ih ice\nThe oxygen atom is strongly covalenty bonded to the 2 hydrogens to form a single water\nmolecule, but, when frozen, the water molecules themselves are bonded weakly by\nhydrogen-bonds. Vacancies in the structure are predominantly point defects. It is these,\nW. Bennett\nPage 11\n\n1/30/2003\nalong with the dislocation density (the number of grain boundaries per unit volume), that\ndetermines the characteristics of the ice. The microstructure of the ice depends on its\nmechanical-thermal history.\n3.1.2 Ice Formation (morphology)\nThere are 3 main ways of forming natural ice:\n1.\nHeterogeneous nucleation at the surface of a slowly flowing water body.\n2.\nNucleation of frazil (Fine spicules, plates or discoids of ice suspended in water)\nparticles that appear in a fast flowing, supercooled water masses.\n3.\nThe freeze up of snow or atmospheric ice nuclei falling into the water.\nThese starting points for ice formation must considered in the context of producing ice in\na laboratory.\n3.1.3 Micromechanics of Failure\nAccording to Wu & Niu4, the main reason for ice failure is due to impurities at grain\nboundaries disrupting the overall structure. These impurities initiate early melting and\nmicrocracks. The grain structure and orientation also affects the failure mode. This\ninformation is important to how the macroscopic ice structure is controlled (by addition\nof impurities for example).\n3. 2 Ice Testing Results\nThis section of the literature review focuses on the methods used to characterize the\nengineering properties of ice.\n3.2.1 Compressive Strength\nThe benchmark for compressive strength is set by uni-axial load tests on specimens in\nlaboratories5. There have been numerous studies carried out on the ice in situ but analysis\nof these tests was hampered by the complex stress states set up within the ice.\nTypical values for the range of compressive strength are from 0.5 - 10 Mpa.\nW. Bennett\nPage 12\n\n1/30/2003\n3.2.2 Flexural Strength\nFlexural strength is generally lower than the compressive strength for ice and typically\nranges from 0.5-3 Mpa. It should be noted that the temperature up to -5oC did not\ninfluence the flexural strength of the specimen.\n3.2.3 Ice Rheology\nThe stress-strain behavior of ice is important to understand as it has relevance to any\nstudy involving ice as a working material.5 In a general sense, ice is described as a\nviscoelastic material. The simple spring dashpot model for ice is shown in figure 4 below.\nThis model attempts to simulate the 4 deformation mechanisms of ice:\n1.\nElastic deformation due to atomic bonds changing length.\n2.\nDelayed elasticity due to sliding at the grain boundaries.\n3.\nViscous deformation due to dislocation movement within grains.\n4.\nDeformation due to microcracks in the ice.\nThe total strain of the ice is usually thought of as the sum of all these components. This\nmodel allows for both the creep of the ice, and the ductile to brittle transition, as strain\nrates are increased. The fourth point is the most important in relation to the project as the\nice screw itself initiates many microcracks, and the primary reason for ice failure is the\npropagation of those cracks.\nFigure 4: A spring and dashpot model of ice.6\nThe values of the spring and dashpot constants are dependent on a number of factors\nincluding the structure and temperature of the ice.\nW. Bennett\nPage 13\n\n1/30/2003\n3.2.4 Temperature Dependency\nIt has been shown that, at temperatures up to -5oC, the flexural strength of the specimen\nis not influenced by temperature.5,7 However at temperatures near zero, it was the\nimpurities at the grain boundaries that induced melting which meant that even the\nflexural strength of thick ice was zero. This change in behavior important for the project\nas this indicates a marked change in behavior around the temperatures of interest.\n3.2.5 Impact Testing on Ice\nA further study of particular relevance to the ice screw testing section of this project are\na series of drop impact tests on laboratory and natural freshwater ice7 conducted in the\nlate 1960s by the Artic and Antarctic research Institute (AARI) and then again by the\nNational Research Council of Canada (NRC) in the late 1980's.\nBoth tests consisted of dropping specially prepared 'impacters' of hemispherical surface\nof weights between 30 and 300kg onto the test surfaces from heights ranging from 0.02\nto 1.6m metres. The measurements taken were the size of the imprint and acceleration\nrecord for the AARI tests, and the maximum pressure and penetration depth (taken using\npressure transducers) in the NRC tests (from this the acceleration record could be\ncalculated).\nThe results of these tests were compared to a hydrodynamic model. The model assumes\nthat a thin layer of crushed ice develops during impact between the indenting body and\nthe undamaged ice, and that its flow is similar to that of a thin layer of viscous fluid. The\nfindings of this study most relevant to the project are:\n1.\nThe energy of mechanical crushing of ice depends on the ice state. This energy\nwas up to 7 times more for cold winter ice in comparison to warm spring ice. The\ncritical temperature was -5?C, either side of this the ice properties were\nsignificantly different. This agrees with the observation made in section 3.2.4.\n2.\nAnalysis of test data showed that, within the considered interval of impact\nvelocities, impact crushing strength of freshwater ice decreased with increasing\nimpact velocities linearly.\nW. Bennett\nPage 14\n\n1/30/2003\n3.\nTheoretical predictions of maximum ice load and depth of penetration, based on\nthe hydrodynamic model coincide closely with experimental data.\nThese findings indicate that a theoretical model can predict some properties of ice to a\nvery high accuracy.\nHowever, the same model may not always predict different\nquantities to the same accuracy.\nThis impact testing is of direct relevance to our project because we expect impact results\nto correlate closely with ice screw performance.\nThis study is limited as it was carried out in an uncontrolled environment.\n3.3 How to make Ice\nInformation on the making of the ice was gathered, via email, from a current expert in\nthe field of ice mechanics, John Dempsey.8 Full details on 'how to make (perfect) ice' is\nfound in Appendix A. Appendix A gives information on test apparatus insulation, tips on\nrepeatable crystal growth (such as the use of existing frost particles to nucleate ice grains\nin the specimen), and it also gives advice on how to allow for the expansion of the water\non freezing. As indicated above, this will only produce one ice type, the most perfect ice\nthat we can make. The methods for making other types of ice will be investigated in the\npreliminary testing stage, section 5.1.1.\n3.4 Ice Screw Testing\nTwo studies are relevant to Stage 2 of this project:\n3.4.1 The Harmston/Luebben Study\nHarmston and Luebben1 conducted tests that consist of placing ice screws into a natural\nice formation and dropping a 185 lb weight from various heights, while statically\nattached to the protection point, giving forces of between 8 kN - 12 kN. The results from\nthis test show that the screw ripped out of the ice 7 out of 12 times. A variety of variables\nwere tested, including screw angle and screw length. The tests suggest that a downward\nangle for the screw is most effective and that a longer screw is more likely to hold than a\nshorter screw. The main conclusion drawn from the test was that ice conditions are so\nvariable that it is difficult to accurately predict the holding strength of ice screw\nplacement.\nW. Bennett\nPage 15\n\n1/30/2003\nA critical examination of the test conditions suggest that many independent variables,\nincluding temperature, sun exposure and ice quality, were not controlled. Also, the\nuncontrolled method of dropping a weight onto the ice screw had no control over the\nstrain rate.\n3.4.2 Black Diamond internal study\nBlack Diamond Equipment has made its own investigations into ice screw effectiveness.2\nThe tests consist of placing ice screws into an ice cell and then loading these cells in a\nUniversal Test Machine. The ice cells are constrained by a steel container and prepared\nusing untreated tap water. Freezing of the cells was at around -10oC and the whole\nprocess took about 72 hours. Ice cells are regenerated 20 times, by simply filling in the\ndamaged hole and refreezing, before being regenerated.\nIt was found in this study that the ice screws tested failed either by levering the hanger\noff the screw head, by breaking of the screw shaft, or by pulling the screw out of the ice.\nIt was also found that the screw placement angle was a significant factor in how much\nload the ice screw could withstand.\nThe limitations on this study are the unpredictable and variable nature of the ice cells\nused for testing. The cell composition was not tightly controlled and regeneration of the\ncell is not consistent.\n3.5 Summary\nIce failure occurs due to impurities initiating cracks on a microscopic level. There is a\nbrittle-elastic behavior change as ice passes through -5oC.\nIt has been found that, when subjected to loading in certain conditions, ice screws fail at\nloads that they are designed to hold. Current research in the area of ice screw testing\nlacks a controlled procedure for the repeatable testing of ice screws in ice. A study that\nregulates not only the ice screw testing but also the ice into which the screw is\nembedded would be beneficial to this area of research.\nW. Bennett\nPage 16\n\n1/30/2003\n4. Technical Approach\nThis project adds to the knowledge base on the subject of ice screw testing by providing\na controlled test environment. This study will bring quantifiable and repeatable results to\nthe field of ice screw testing.\nThere are two distinct stages in the experimental setup of this project:\n?? The characterization of ice.\n?? The testing of ice screws in ice.\nThe main challenge is to repeatably create the structure and morphology of ice in the\nlab. Once the ice formations can be created in a laboratory, a realistic testing method\ncan be devised. The major hurdle is in creating the different types of ice encountered by\nclimbers. These ice types range from good ice (pure, transparent and crack free) which\nis thought to be the safest, to hollow, layered, slushy, aerated and chandeliered which\nare all thought to be poor ice types for screw placement. This descriptive basis for the ice\nis then converted to quantitative properties based on analysis. Not all the ice types can\nbe created and tested owing to the timescale of 16.622. Therefore, two ice types were\nchosen (see section 5.1.1 for further details).\nThe first step towards a controlled methodology for ice screw testing is thus the ability to\ncharacterize the ice and make it consistently. This step entails defining a process and\nthen being able to test the ice for certain properties and gaining repeatable results.\nOnce the ice test-beds have been developed so they are representative of climbing\nconditions, the ice screws can be tested. Initially, the screws will be tested on 'perfect'\n(flawless) ice. Comparisons between with results from the previous tests (Harmston and\nLuebben1 and the Black Diamond study2) will be conducted. This is the control. When\ntesting the ice screws, the independent variable will be the screw placement angle. The\nvariables chosen are to be limited owing to the time-scale of the course.\nW. Bennett\nPage 17\n\n1/30/2003\n5. Experimental Design\n5.1 Basic Concepts\nThis section explains the planned experimental procedures for the project.\n5.1.1 Preliminary Testing\nThis stage involves experimenting with different types of ice and finding the most\neffective method of creating repeatable ice. To this end, possible methods for making\nthe different kinds of ice will be investigated. The factors under test will be air and\nimpurity concentrations in the ice, the critical levels of which will be obtained. One\nparticular issue to be addressed is the effective production of distinctly different types of\nice (based on their properties).\nFrom this preliminary testing module, two different types of ice, named ABS1, and ABS2\n(Alziati & Bennett Standard #) will have been obtained. It is hoped to produce a sample\nof 'perfect' ice (few cracks, no aeration, no particulates), and a sample of either\naerated ice, or 'dirty' ice (high particulate concentration).\nThe potential strategies for creating the aerated ice are as follows:\n1. Drill air holes into the ice.\n2. To use a mixture of crushed ice and water close to freezing point.\n3. Suspend small pockets of air in the ice mix (using tethered balloons)\n4. Construction of a specialized rig that constantly blows air through the ice mix.\n5. The use of soda water or carbonated water.\n6. A combination of these strategies.\nThe most effective method for creating aerating ice will be determined during the\npreliminary testing stage of the project. The method will be chosen based on the best\ncombination of speed, ease of production, and quality of ice produced.\nThe creation of these 'bad' types of ice is not a widely documented subject. Hence, it is\nextremely difficult to say exactly how the specimens will be made. However, limited\npreliminary testing of 'bad' ice during the Fall Semester 2002 has yielded some interesting\ndiscoveries. Encouraging results have been obtained in making small-scale formations\nwith carbonated water.\nW. Bennett\nPage 18\n\n1/30/2003\nOne further decision to be investigated during preliminary testing is the size of the ice\nspecimen. The specimen must be large enough to have a screw inserted into its body\nand not show any visible signs of stress, and it must be small enough to carry manually.\nA further option for ice production is the purchase of prefabricated ice.\n5.1.2 Stage 1: The Characterization of Ice\nThis stage will consist of testing the mechanical properties of the two different types of ice\nproduced, named ABS1 and ABS2. The methodology for creating these ice types\neffectively will have been developed in the preliminary testing. Each ice type will have\nproperties that are measured to be significantly different. The objective of this stage is to\ncharacterize each ice type in terms of its physical and mechanical properties.\nFirst, the physical properties of the ice produced (density, purity) will be measured. The\ndensity will be calculated by measuring the volume and the weight directly; the volume\nitself will be measured by recording the amount of water the specimen displaces. Purity\nwill be measured by weighing the mass of particulate added to the water before\nfreezing. Second, to characterize the ice specimens mechanically, specimens will be put\nunder standard tensile and compressive tests in an MTS machine (see figures 5, 6 and 7).\nAs shown in figure 6, the tensile test plates will be frozen into the ice specimen and then\npulled. A notch will be machined into the specimen to ensure that failure does not occur\nat the plate/ice interface. The MTS machine will apply a gradually increasing force until\nthe failure occurs. For the compressive test, the ice specimen will be placed between\nthe plates of the MTS machine, and a compressive force will be applied, as shown in\nfigure 7. For the characterization stage, the cylindrical ice specimen dimensions will be 10\ncm diameter and 15 cm in length.\nFrom these tests the material properties of tensile strength, and compressive strength will\nbe measured directly. The Young's Modulus will also be evaluated from the results of the\ntests. A computer records the displacement, load, and time data from the MTS machine.\nW. Bennett\nPage 19\n\n1/30/2003\nFigure 5: MST test apparatus in TELAC.9\nW. Bennett\nPage 20\n\n1/30/2003\nF(t)\nF(t)\nContact plates\nIce\nSpecimen\nF(t)\nF(t)\nPlates\nfrozen into\nthe ice\nFailure notch\nFigure 6: Schematic of tensile test\nFigure 7: Schematic of compressive test\nThe third test that will be carried out is an impact test. For this test a heavy steel ball will\nbe dropped from a fixed height onto the ice surface. The radius of indentation will then\nbe measured and the impact toughness can be calculated. An illustration of this is\nshown in Figure 8.\nIndentation width\nSteel Ball\nFigure 8: Impact testing\nW. Bennett\nPage 21\n\n1/30/2003\nTesting of each specimen will be carried out at two different temperatures either side of\nthe critical -5?C temperature where the ice properties change from elastic to brittle.\nThe making of each specimen will be carried out according to a combination of both\nthe recipe prescribed by Dempsey8 (please see appendix A) and of the processes\nexamined in the preliminary experimentation.\n5.1.2 Stage 2: Testing of Ice Screws in Ice\nOnce the ice types have been produced and mechanical characteristics measured, the\neffect of placement angle on ice screw safety will be tested on each ice type (see figure\n8). Each of these tests will be conducted at values of -15?, 0?, and 15? of ice screw angle\nplacement. This angle is measured relative to the perpendicular of the ice face, where\npositive is above and negative below (as illustrated in figure 9). The loading of the\nspecimens in the MTS machine will be under two regimes:\n?? Impact Strength\nThe impact strength will measured by fast loading of the screw. The load rate will\nbe at 10kN per second, which is the approximate load rate of a falling climber.\nThis will be increased until failure.\n?? Low load rate\nThis regime is at a low load rate of around 0.1kN per second (a factor of 100\nbelow the Impact Strength regime above).\nW. Bennett\nPage 22\n\n1/30/2003\nFigure 9: Ice screw placement angle\nThese ice screw tests will be carried out in an MTS machine (figure 5). A computer will\nrecord the displacement, load, and time data.\nThe rig that will hold the cylindrical ice specimen in place during testing is shown in figure\n10. The rig consists of a piece of sheet steel folded into a configuration that will give\nmaximum contact area over the ice/steel interface. For a detailed plan of the mounting\napparatus please see Appendix B. The specimen will be placed inside this large angle\nand strapped on using canvas ties and ratchets. The ties will also support the ice against\npremature cracking when the ice screw is placed in the end of the specimen. Then the\nentire apparatus will be screwed onto the steel base plate of the MTS machine. The ice\nscrew will be attached to the MTS ram by means of clamps (see Appendix C).\nW. Bennett\nPage 23\n\n1/30/2003\nHolding\nStraps\nIce Specimen\nSteel Sheet\nIce Screw\nAluminium Angles\nFigure 10: Showing the rig for securing the ice specimen during stage 2.\nIt should be noted that a new ice screw will be used for every test. Identical ice screws\nwill be used for all experiments.\nFor this stage of the experimentation the dimensions of the ice specimen will be around\n30 cm in diameter and 40 cm in length. However, as stated before, the exact dimensions\nhave yet to be determined in the preliminary testing stage.\nW. Bennett\nPage 24\n\n1/30/2003\n5.2 Error Analysis\nThe main source of error comes from the unpredictable nature of ice fracture. This will be\nhandled with the use of statistics (see section 6.2). Before applying the statistical analysis\ntechniques, the systematic errors must be identified. This will leave only data variation\ndue to the unpredictable nature of ice.\nThe errors associated with this project are located mainly in the measurements that will\nbe taken throughout testing. The greatest source of error lies in the MTS loading machine,\nwhich is accurate to a tolerance of ±13N. At a testing load of 2kN this represents an error\nof 0.65%, which is very small.\nOther possible errors are associated with the measurement of length, temperature and\nvolume and mass:\n?? Lengths: The MTS machine quotes measurements to an accuracy of ±0.1 mm. This\nequates to an error of 0. 5-1 % based on lengths of possible ice screw movement.\n?? Temperatures: Temperatures are measured to an accuracy of one decimal\nplace using a thermocouple and digital readout. The errors associated with this\nare 0.5 - 2.5 %.\n?? Volume measurements will be made by recording the amount of water\ndisplaced by the ice specimen. The errors associated with this are 0.5%\n?? Mass will be measured using an electronic balance accurate to 3 decimal\nplaces. The errors associated with this are small enough to be neglected\ncompletely.\nTherefore the total probable error in this project is around 5 %.\nW. Bennett\nPage 25\n\n1/30/2003\n5.3 Test Matrices\nThe test matrices for the project are laid out below with details on the dependent and\nindependent variables. Owing to the erratic behavior of ice, all characterization and ice\nscrew tests will be repeated 4 times, and statistical techniques applied to obtain the\n'true' values, thus the blocks in the test matrices represent 4 data points.\n5.3.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics\nThe independent and dependent variables for stage 1 are listed below. These are\nfollowed by a diagram of the test matrix for this stage.\nThe measurements taken in this stage will occur in 2 different modes:\nFirstly, the identification measurements will be taken:\n1. Mass of ice formed (kg)\n2. Volume of ice formed (m 3)\n3. Mass of impurity dissolved in water (kg)\nSecondly, the measurements taken from the tensile, compressive and impact tests will be\nthe following:\nIndependent Variables\nThe controlled variables in this stage are:\n1.\nTemperature of ice: initially two values will be set at -2?C and -10?C, but may be\nsubject to change according to the refrigeration unit's capabilities.\n2.\nIce type will be changed: ABS1, and ABS2 will be tested at each of the above\ntemperatures.\nDependent Variables\nThe values that will be measured from the tests at this stage are:\n1. Stress level at tensile fracture (N m-2)\n2. Stress level at compressive fracture (N m-2)\n3. Extension of the ice specimen after fracture (m) [Tensile and compressive tests]\n4. Depth and radius of indent (m) [Impact test]\nW. Bennett\nPage 26\n\n1/30/2003\nFigure 11: Test matrix for stage 1 (each block consists of 4 data points).\n5.3.2 Stage 2: Testing of Ice Screws in Ice\nThe independent and dependent variables for stage 2 are listed below. These are\nfollowed by a diagram of the test matrix for this stage.\nIndependent Variables\nThe controlled variables in this stage are:\n1. The screw angle will be varied between +15? and -15?\n2. Ice type will be changed: ABS1 and ABS2 will be tested at each screw angle.\nDependent Variables\nThe values that will be measured at this stage are:\n1. The load at which the ice screw pulls out under the high load rate regime (kN)\n2. The load at which the ice screw pulls out under the low load rate regime (kN)\nW. Bennett\nPage 27\n\n1/30/2003\nFigure 12: test matrix for stage 2 (each block consists of 4 data points).\n5.4 Safety Concerns\nThe major safety concern connected to working with subzero materials is that prolonged\nexposure can lead to frostbite. To avoid this, gloves will be worn when handling ice.\nIt is also expected that the ice specimens will be of considerable size and weight. Hence\nwhen moving these specimens, caution must be exercised to avoid back injury.\nLastly, ice is a brittle material and will facture on impact. Thus, safety goggles should be\nworn when testing the ice, to protect against flying ice chips. Also, shielding will be set up\naround the test specimen.\nDuring all experimentation TELAC (The MIT Technology Laboratory for Advanced\nComposites ) safety procedures will be followed.\nW. Bennett\nPage 28\n\n1/30/2003\n6. Data Analysis\n6.1 Data Processing\n6.1.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics\nData processing in stage 1 will involve the use of equations 1 and 2 to provide the value\nof the Young's Modulus, E,. The MTS computer will give the values of the force applied at\nfailure via a digital read-out. The only processing that must be done here is dividing this\nforce by the cross-sectional area of the plane of failure to obtain a value of the stress\nlevel, ?x.\n? l\n? x\n? x ?\n[1]\nE ? ?\n[2]\nl\nx\n6.1.2 Stage 2: Testing of Ice Screws in Ice\nData processing from stage 2 will comprise recording MTS digital read-out of forces at\nfailure. After error analysis and accounting for offset measures, these are the values that\nwill be quoted in the experimental results.\n6.2 Data Reduction\nTo reduce the data, a statistical approach will be taken. Owing to the random nature of\nthe behavior of ice, each individual test will have to be repeated a certain number of\ntimes so that statistical techniques can be used. The experiments will be repeated four\ntimes only, due to time constraints. Ideally, good results would yield a standard deviation\nsmaller than the mean value and a skewness of the same order of magnitude as the\nstandard deviation.\nTo illustrate this point, figure 13 shows some distributions that might be expected. If the\nscatter graph for the experiments looks like graph 1 in Figure 13, then no more\nexperiments need to be carried out. If, however, the scatter of data is similar to graph 2,\nthen the number of experiments should be increased in order to reduce the standard\ndeviation. Unfortunately, as stated before, this could prove difficult owing to the time\nconstraints. The problem is balancing the need for statistical significance with the time\navailable.\nW. Bennett\nPage 29\n\n1/30/2003\nFigure 13: Graphs showing scattered normal distributions\n1) Low standard deviation\n2) High standard deviation\n6.2.1 Stage 1:\nThe mean and the standard deviation of the results will be taken. The values obtained\nwill be fitted to a normal distribution and the confidence level of the values for tensile\nand compressive strength, E, and impact strength will be ascertained. Further statistical\nmeasures that will be investigated are the mean square value and the t-statistic test.\nThese tests will indicate the consistency of the data and hence the level of success in\nachieving repeatability in the results.\n6.2.2 Stage 2:\nAgain the mean and the standard deviation of the data obtained will be obtained and\nfitted to a normal distribution to obtain a confidence level for each test. The mean\nsquared value will be analyzed, as will the t-statistic and so the degree of confidence in\nthe distribution will be ascertained.\n6.3 Correlation\nIn order to prove the first hypothesis is correct the results of stage 1 will be analysed, and,\nif consistent, then the ice types produced have been made in a controlled repeatable\nfashion and therefore simulate ice effectively. Successful characterization is defined as\nobtaining recorded mean measurements for 'good' ice that lie within one standard\ndeviation of the quoted values in the available literature. Successful characterization of\nbad ice is defined as obtaining data with a standard deviation of the same order of\nmagnitude as that obtained for good ice. There is no data available for comparison of\npreviously recorded values.\nW. Bennett\nPage 30\n\n1/30/2003\nThe second hypothesis will be proved correct if there is a definite trend of repeatable\ndata from the various loading measurements. This will show how the placement angle\naffects ice screw safety. Repeatable data is defined as having a standard deviation of\nless than 15 % of the mean value. The data in the Black Diamond study2 had a standard\ndeviation of approximately 25 % of the mean value. It is believed that 15 % is a figure that\nwould be acceptable as an industry standard test.\nW. Bennett\nPage 31\n\n1/30/2003\n7. Project Planning\n7.1 Budget\nThe most expensive part of the budget is the ice screws. At $50 per piece, they provide\nthe bulk of the cost. To address this issue, potential sponsors, including Black Diamond,\nthe world leaders in ice screw manufacturing, have already been contacted, as can be\nseen in the schedule below. It is strongly anticipated that a sponsor will be found through\nvarious contacts in the climbing community. This will bring the cost down considerably to\naround $150.\nThe budget is summarized in the table 1. All figures are based on market costs.\nTable 1: The proposed budget\nItem\nAvailability Quantity\nReal World Cost\n16.62X Cost\nMTS Machine use\nMIT\n5 days\n$2,500\ndonated\nMachine Shop\nMIT\nUnknown\nunknown\ndonated\nTest Rig\nMIT\nUnknown\nunknown\ndonated\nRefrigerator\nMIT\nUnknown\nunknown\ndonated\nIce Screws\nOrder\n$2,700\n$2,700\nCarabiners\nOrder\n$30\n$30\nSlings\nOrder\n$24\n$24\nIce Boxes\nOrder\n$40\n$40\nBuilding Materials\nMIT/Order\n$50\n$50\nTotal:\n$5,344\n$2,884\nW. Bennett\nPage 32\n\n1/30/2003\n7. 2 Schedule\nThe proposed schedule for 16.622 and the remainder of 16.621 is shown in Table 2.\nThe preliminary testing has commenced in the 16.621 Fall semester and will proceed\nthrough most of February. The success of the preliminary experiment and discovery of\nsponsors will be presented in the first oral progress report on 27th of March. The ice screw\ntesting will be run in the lab for a maximum of three weeks. The project is predicted to be\nfinished by week 9. This gives 2 weeks leeway in terms of the 622 deadline for unforeseen\ncircumstances. Data analysis will then proceed until the middle of April. From then on,\npreparations will be made for the oral final report and the written final report.\nTable 2: The proposed schedule\nID\nTask Name\nStart\nEnd 16.621 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\nShop Demonstrations\n5-Feb\n7-Feb\nConstruction\n4-Nov 15-Mar\nBuild Test Rig\n16-Feb 22-Feb\nBuild Insulating Box\n16-Feb 22-Feb\nConact sponsers\n4-Nov 15-Mar\nOrder materials\n4-Nov 15-Mar\nStage 1\n22-Oct 15-Mar\nPreliminary Testing\n22-Oct 22-Feb\nMTS Acquaintance\n9-Feb 15-Feb\nIce Testing\n23-Feb 15-Mar\nStage 2\n16-Mar\n5-Apr\nIce Screw Testing\n16-Mar\n5-Apr\nReports and Presentations\n27-Feb 13-May\nOral Progress Reports\n4-Mar\n6-Mar\nLast day to collect data\n18-Apr 18-Apr\nProgress Review\n11-Feb\n3-Apr\nFinal Presentaion\n29-Apr 1-May\nFinal Written Report\n13-May 13-May\nW. Bennett\nPage 33\n\n1/30/2003\n7.3 Facilities Required\nThe MIT Technology Laboratory for Advanced Composites (TELAC) will host all testing.\nTELAC is equipped with an MTS machine that will be used to load the ice specimens and\nice screws. The necessary refrigeration unit required to freeze the ice specimen is located\nnearby the MTS machine. Storage space for the test equipment is also required.\nRequired construction materials are steel brackets, rods, plate, and miscellaneous bolts,\nnuts, etc. for attachment. Additionally blue foam will be used to insulate the steel case.\nThe MIT Gelb laboratory contains all the necessary metal tools to construct the apparatus\nrequired. Items that must be constructed are the steel plates for the tensile loading, the\ncasing (depicted in figure 10) for holding the cylindrical ice specimen and the insulated\nbox for making the ice specimens in.\nW. Bennett\nPage 34\n\n1/30/2003\n8. Conclusion\nIn summary, this project will be a first step towards improvement in ice climbing safety\nand the education of climbers in the limitations of their equipment.\nA successful project will be the simulation of the ice in the laboratory, or the\nunderstanding of why ice cannot be effectively simulated in the laboratory. If ice can be\nsimulated in the laboratory, then the second success of the project will be the\nunderstanding of how ice screw placement angle affects safety.\n9. Acknowledgements\nMy project partner and I would like to extend our thanks to the following people:\nOur advisors, Dr Kim Blair and Dave Custer whose patient guidance and tremendous\nenthusiasm have been a constant source of inspiration.\nProfessor John Dempsey (Clarkson College) whose expert guidance on difficult issues has\nbeen invaluable.\nNemo Equipment Climbing Company whose expert insight into the sport of ice climbing\nhas been instrumental in the development of the project.\nAnd of course the 62X Faculty and staff with a special mention for John Kane and Dick\nPerdichizzi whose experience in the sphere of project testing has proven essential.\nW. Bennett\nPage 35\n\n1/30/2003\n10. References\n1. Luebben, Craig, 'The Cold Truth - How Strong is Ice Protection?', Climbing Magazine,\nNovember 1997, pp. 106 - 115\n2. Harmston. C, 'Myths, Cautions and Techniques of Ice Screw Placement', Internal\nReport, Black Diamond Equipment, July 1998.\n3. Schulson, Erland M., \"The Structure and Mechanical Behavior of\nice\", The Minerals, Metals and Materials Society,\nhttp://www.tms.org/pubs/journals/JOM/9902/Schulson-9902.html, 09/30/02.\n4. Wu, M. S., Niu J., \"Prediction of ice failure by Micromechanics\", AMD Ice Mechanics,\nVol. 163, 1993, pp.35-49.\n5. T. Nakato, R. Ettema, Issues and Directions in Hydraulics (A.A. Balkema/ Rotterdam/\nBrookfield/ 1996.\n6. LØset S., \"Thermomechanical Properties of Materials, examintaions May 24 1997 (0900-\n1300) - Brief solution\", Norwegian University of Science and Technology (NTNU) Faculty of\nCivil and Environmental Engineering Department of Structural Engineering,\nwww.bygg.ntnu.no/~sveinulo/at204/at20497/at204s97.pdf, 10/10/02.\n7. Likhomanov, V., Stepanov, I., Frederking R., Timco G. W., \"Comparison of Results of\nImpact Tests on Laboratory and Natural Freshwater Ice with Hydrodynamic Model\nPredictions\", The Proceedings of the Eighth (1998) International OFFSHORE AND POLAR\nENGINEERING CONFERENCE, Vol. 2, 1998, pp. 453-459\n8. Email from Ice Expert John Dempsey, Clarkson College, Putsdam, New York. Email:\n09/30/2002\n9. Okal, M., 'Carabiner Testing', 16.621 Final Report, Spring 2001, pp. 8-10.\nW. Bennett\nPage 36\n\n1/30/2003\nAppendix A - Recipe for Ice Formation\nForwarded message from John Dempsey\nDate: Mon, 30 Sep 2002 10:35:05 -0400\nFrom: John Dempsey\nReply-To: John Dempsey\nSubject: Re: Information on ice\nTo:\nStefano and Warren,\nPlease give my regards to Professor Parks. I'll give it a go. What size freezer do you have?\nLarger blocks will produce better results.\nSuppose that you make up a cube of a box (quite well made so that it does not leak)\nmake it out of some softwood so that it absorbs water?? Cube of dimension N cm;\nsuppose N is something like 25. Now insulate the bottom and all sides of the box; could\njust use that blue styrofoam but make the wall thickness of the order of 12 cm.\nThis is to stop any freezing nucleation on the sides or bottom. Now fill the box with cold\nwater and put it in the freezer-prepare for leakage because the ice will try to expand\noutwards---which is why you want as much surrounding insulation as possible.\nIf you have the patience, monitor the temperature and stir that water so that\nit all cools more or less uniformly; right near freezing use some of the frost in the freezer as\nseed crystals and float the frost on top.\nThis method should give you repeatable clear blocks - the slower you grow the ice the\nbetter it will be in terms of say dislocation density etc.\nOh, almost forgot, you need a pressure release under the ice as it grows-\nlike a pipe fitted to the side at the bottom-insulated or wrapped in heat\ntape, so that as the ice grows down, it will push water out the pipe-angle the pipe to\nW. Bennett\nPage 37\n\n1/30/2003\nmaintain more or less the same pressure (head). In other words, let this excess\nwater drip into a bucket or some such.\nBe careful of thermal shock-let the ice warm up slowly. You can work at 0 Celsius or very\nnear. I have observed with warm ice, that when you turn ice screws into it, you get these\nvery fine radial crack under the expansion-interesting.\nTemperature of the ice is probably your main variable. Let me know how this goes.\nJohn Dempsey, Prof\nW. Bennett\nPage 38\n\n1/30/2003\nAppendix B - Engineering Drawings, MTS Mounting\nApparatus, Stage 2 testing\nFigure 14: Front and right-hand views of stage 2 MTS mounting apparatus.\nW. Bennett\nPage 39\n\n1/30/2003\nAppendix C - Engineering Drawings, ASTM Grips\nThe full dimensions of the four components of the total ASTM grip set-up are shown\nbelow.\nAll dimensions are given in inches as the machinery in the Gelb Laboratory\noperates with English units.\nFigure 15: Third angle projection of main ASTM grips.\nW. Bennett\nPage 40\n\n1/30/2003\nFigure 16: Third angle projection of the connectors.\nW. Bennett\nPage 41\n\n1/30/2003\nAppendix D - Detailed Parts List\nParts include:\n?? MTS Machine\n?? Refrigerator: temperature controllable between 0°C - -20°C\n?? Thermocouples and digital readout\n?? Grips for MTS machine: ATSM\n?? 54 Ice Screws: Black Diamond\n?? Electronic Mass Balance: correct to 3 decimal places\n?? Measuring Cylinder: 40 liter capacity\n?? Impurities (dirt, sand, grit, etc...)\n?? Aluminium angles: 8 ft long, leg length 1.5 inches, thickness 0.25 inches\n?? Steel plate: 40cm x 65cm\n?? Assorted Nuts & bolts\n?? 10, 000lb Load Cell: As agreed with Dick Perdichizzi\n?? Soda Siphon\nW. Bennett\nPage 42\n\n1/30/2003\n1 Luebben, Craig, 'The Cold Truth - How Strong is Ice Protection?', Climbing Magazine,\nNovember 1997, pp. 106 - 115\n2 Harmston. C, 'Myths, Cautions and Techniques of Ice Screw Placement', Internal\nReport, Black Diamond Equipment, July 1998.\n3 Schulson, Erland M., \"The Structure and Mechanical Behavior of\nice\", The Minerals, Metals and Materials Society,\nhttp://www.tms.org/pubs/journals/JOM/9902/Schulson-9902.html, 09/30/02.\n4 Wu, M. S., Niu J., \"Prediction of ice failure by Micromechanics\", AMD Ice Mechanics,\nVol. 163, 1993, pp.35-49.\n5 T. Nakato, R. Ettema, Issues and Directions in Hydraulics (A.A. Balkema/ Rotterdam/\nBrookfield/ 1996.\n6 LØset S., \"Thermomechanical Properties of Materials, examintaions May 24 1997 (0900-\n1300) - Brief solution\", Norwegian University of Science and Technology (NTNU) Faculty of\nCivil and Environmental Engineering Department of Structural Engineering,\nwww.bygg.ntnu.no/~sveinulo/at204/at20497/at204s97.pdf, 10/10/02.\n7 Likhomanov, V., Stepanov, I., Frederking R., Timco G. W., \"Comparison of Results of\nImpact Tests on Laboratory and Natural Freshwater Ice with Hydrodynamic Model\nPredictions\", The Proceedings of the Eighth (1998) International OFFSHORE AND POLAR\nENGINEERING CONFERENCE, Vol. 2, 1998, pp. 453-459\n8 Email from Ice Expert John Dempsey, Clarkson College, Putsdam, New York. Email:\n09/30/2002\n9 Okal, M., 'Carabiner Testing', 16.621 Final Report, Spring 2001, pp. 8-10\nW. Bennett\nPage 43\n\n1/30/2003\nW. Bennett\nPage 44"
    },
    {
      "category": "Resource",
      "title": "davisvic.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/a9966122a9fed7d9916f62a0912ad420_davisvic.pdf",
      "content": "TESTING AND IMPROVEMENT OF A COMPLEX SYSTEM\nAutonomous Planetary Rover Simulation and Experimentation\n\nDesign Proposal\n16.621\nFall 2002\n\nAuthor: Victoria Davis\n\nAdvisor: Professor Charlie Boppe\n\nPartner: Malena Stiteler\n\nDecember 10, 2002\n\nTable of Contents\nExecutive Summary........................................................................................... 3\n\nIntroduction\n\n1.1\nMotivation..................................................................................\n\n1.2\nPrevious Work............................................................................ 4\n\n1.3\nValue of Project..........................................................................\n\nObjectives\n\n2.1\nHypothesis................................................................................. 5\n\n2.2\nObjectives.................................................................................. 5\n\n2.3\nSuccess Criteria.......................................................................... 5\n\nLiterature Review\n\nTechnical Approach\n\n4.1\nExperiment Overview................................................................... 9\n\n4.2\nApparatus..................................................................................\n\n4.3\nTest Articles...............................................................................\n\n4.4\nMeasured Quantities.................................................................... 10\n\nExperiment Design\n\n5.1\nDesign for Apparatus...................................................................\n\n5.2\nDesign for Test Articles................................................................\n\n5.3\nExperimental Procedures.............................................................. 13\n\n5.4\nMeasurement Systems................................................................. 14\n\n5.5\nErrors.......................................................................................\n\n5.6\nTest Matrices.............................................................................\n\n5.7\nVariables...................................................................................\n\n5.8\nOrigin of Materials.......................................................................\n\n5.9\nSafety Concerns.........................................................................\n\nData Analysis\n\nProject Planning\n\n7.1\nBudget.....................................................................................\n\n7.2\nSchedule..................................................................................\n\n7.3\nSupport....................................................................................\n\nConclusion\n\nAcknowledgements\n\nReferences\n\nAppendix A\nDetailed Drawings of Apparatus\n\nAppendix B\nDetailed Parts List\n\nList of Figures\nFigure 1: State Space Diagram for simulation and rover logic.................................... 11\nFigure 2: Simulation planning - 3 primary processes................................................ 11\nFigure 3: Handyboard.......................................................................................\nFigure 4: Car with handyboard............................................................................\nFigure 5: Side view of car with scale..................................................................... 22\nFigure 6: Side view of car with scale..................................................................... 22\nFigure 7: Example of test bed.............................................................................. 23\n\nList of Tables\nTable 1: Test Matrix.........................................................................................\nTable 2: Budget..............................................................................................\nTable 3: Schedule...........................................................................................\n\nExecutive Summary\nThe Aerospace community uses many complex systems, such as airplanes, satellites, and\nplanetary rovers. This project will test a proposed hybrid developmental approach for these\nsystems. The project is based on the need for new and better ways to accurately predict and\nimprove the performance of complex systems, such as a planetary rover. The hybrid approach\ncombines experimental and Monte Carlo simulation approaches into an iterative combination, and\nit is hypothesized that the hybrid design will show greater performance improvement over the\nbaseline rover than the experimentally derived design alone.\nThe rover that will be tested is a small car operated by a handyboard. It will be completing\nthe mission of finding a path to a randomly placed IR beacon from a random starting location while\nnavigating past obstacles. Three versions of the rover will be tested on the final, unknown test\nfield: the baseline rover, the experimentally derived rover, and the hybrid design rover.\nObservations will be made during the development of the rover towards discovering and describing\nthe individual contributions made towards improvement by experimentation and simulation. The\nproject is planned to be completed within a 15 week time period and has a real world budget of\n$399.00, but will cost MIT and the 16.62x class $0.00.\n\n1.0\nIntroduction\n1.1\nBackground\n\nThe use of complex systems is constantly expanding in both aerospace engineering and\nnumerous other fields, and with the spread of these systems, their complexity increases as well.\nDue to this complexity, the systems and any dependents often suffer from unreliable behavior,\nwhich may result in unsafe operating conditions or a mission failure.\n\nAlthough testing of systems used to be done experimentally, many fields are now using an\nanalytical approach. An example is wing design in which numerous wind tunnel tests were\nperformed in the past, but now the airfoils are developed on computers and then tested in a wind\ntunnel for confirmation.\n1.2\nPrevious Work\n\nAlthough there is much interest in the development of complex systems, little\nexperimentation has been done in this field, as evidenced by a relative lack of publications on the\ntopic. The hybrid developmental approach proposed for this project is one way of attempting to\nimprove a system, not totally unlike many others that are currently in use. This approach combines\nexperimentation with Monte Carlo (MC) simulation. A Monte Carlo simulation involves the use of\nstochastic numbers and thousands of trials of which statistics are taken to describe the behavior of\nthe system that is being modeled. Monte Carlo simulations are already used for analysis and\nmodeling in many fields, including aerospace technology development, molecular chemistry,\neconomics, nuclear physics, radiotherapy, and transportation engineering.\n1.3\nValue of Project\nA hybrid developmental approach will integrate the two current kinds of testing and\ndevelopment, experimentation and simulation, into one. Experimentation will be used in\nconjunction with computer-aided analysis to provide superior development capabilities. This will be\n\ndone by using experimentation to refine a model of the rover and vice versa. The results from the\nMC simulation will then be used to change the rover with the intent of improving its performance on\na given task. It is proposed that this hybrid approach will offer the most benefit to high levels of\ncomplex systems. This project will use the hybrid developmental approach with an autonomous\nplanetary rover, and will also discover and describe the individual contributions made towards\nimprovement by experimentation and simulation.\n\n2.0\nObjective\n2.1\nHypothesis\n\nA hybrid developmental approach for an autonomous rover operating on an unknown test\nfield will yield greater improvement than a solely experimentally developed design, and the\nindividual contributions made towards improvement from both the experimental and the simulation\nportions of the hybrid approach can be discovered and described.\n2.2\nObjectives\n1 - Successfully collect performance data on an unknown test bed for multiple\nconfigurations of an autonomous rover in order to measure and compare performance in task\ncompletion time.\n2 - Observe behavior of rover and the modifications suggested by experimentation and\nsimulation during the hybrid development process in order to describe the contributions made\ntowards performance improvement of the rover by the two approaches.\n2.3\nSuccess Criteria\n1 - Collection of data that clearly supports or does not support the hypothesis that task\nimprovement increases when the hybrid developmental approach is used.\n\n2 - Observations are made during the development processes that pinpoint the\ncontributions that simulation and experimentation make to the overall system improvement.\n\n3.0\nLiterature Review\nAlthough there is a plethora of information available about complex systems in general,\nMonte Carlo simulations, and other ways to model systems, there does not seem to be any\nprevious research that describes particular contributions towards improvement. The information\nthat has been found contains some background into the growing complexity of systems and the\nindustrial and academic reactions to this growth, addresses other novel types of experimentation\nwith complex systems, contains information on complex systems in general, and discusses Monte\nCarlo simulations.\nA rapid increase in complexity of systems and industry's expanding use of these systems\nhave left many engineers without necessary skills for the workplace.1 It is with this difficulty in mind\nthat this project was formed. Academic institutions, such as MIT, have changed their curriculum to\nreflect the new challenges that face the engineering community. Some programs offer graduate\nstudents the opportunity to study both engineering and management to prepare for the changing\nworkplace. One particular class at MIT is Aerospace Product Design (APD), which focuses on\npreparing students to understand \"systems behavior via highly integrative multi -disciplinary\nprocesses.\" The course instructor goes further in defining a system in this context as \"A collection\nof interrelated elements with functionality greater than the sum of the independent element\nfunctionalities.\"1 This new emphasis in curriculum evidences the importance of complex systems\nand the necessity of investigation into their development and behavior.\nMany techniques already exist to assist in the design of complex systems. Quite often\nthese techniques involve modeling of various kinds. As systems have grown more complex, the\n\nuse of high-powered computers to analyze and model the systems has also grown. Two such\ntypes of modeling seemed most relevant to the proposed project: metamodeling and simulations of\nsimulations. The metamodel idea uses a Gaussian Process (GP) model to predict the outcome of\nanother model based on past data sets and a new input. It uses a Gaussian probabilistic\ndistribution as the prediction of the new input's output and also gives an estimate of the confidence\nin its own result. This technique is one of many metamodeling techniques, including Response\nSurface Equations and Neural Networks. The benefits of accurate metamodeling are listed as: \"1.\nIntegration across different teams and organizations. 2. Reduction in design cycle effort and quick\ntradeoff for evaluation. 3. Visibility and transparency. 4. Enabling of the day-to-day use of\nprobability methods. 5. Allowing for parametric design definitions.\"2\nMetamodeling seems to be quite similar to simulations of simulations. This second\ntechnique was developed as a response to increasing use of simulations to model systems before\nthey are completed or when unavailable. With increased use, the models progressively become\nmore complex themselves, and at some points more complex than the systems they are made to\nmodel. The use of distributed simulation to simulate another simulation allows the developer of the\noriginal simulation to find errors or bottlenecks within the model before use. This technique was\ndeveloped mainly with the idea of reducing the costs of complex simulations.3\nComplex systems come with given uncertainties, and particular attention has been given to\naccurately modeling the uncertainties to predict their effect on the system. DeLaurentis and\nMavris suggest a way to classify and to model uncertainties.4 One of the main concerns of this\n16.62x project will be internal uncertainties of the rover and external uncertainties from the\nenvironment. The DeLaurentis and Mavris paper will be a useful resource as the simulation of the\nrover is made. The paper by Rehman, Lock, and Nguyen will also be useful as this project\nprogresses as it describes a process by which particular system design factors can be isolated and\n\noptimized.5 Since this project is predicting improvement in particular performance parameters, the\nprocess given in the Rehman, Lock, and Nguyen paper will be examined in more detail and\nconsulted for use in the project at hand.\nThere is, as stated earlier, a large amount of research and information available on Monte\nCarlo (MC) simulations. Marczyk is a strong supporter of the MC simulation as the strongest\nstochastic tool due to its integration of complexity, robustness, and uncertainty.6 He believes that\ntoo much emphasis is put on optimization with other simulation tools, and not on robustness. He\ncalls the result of a MC simulation a \"good enough\" solution.\nThe final paper examined, by Toshikazu and Yoshikazu, discusses how to identify\ninfluential parameters on a MC simulation. A MC simulation allows many simulations to be run with\nrandom combinations of uncertainties. The occurrence of a 'failed' trial will allow the designer to\nidentify the combination of uncertainties that lead to the failure. This identification will then allow\nfor changes to the design, resulting in more predictable outcomes from the real system. Since\nmost complex systems have many uncertainties to consider, it can be difficult to pinpoint the\nparticular parameters that contributed to the failure. Toshikazu and Yoshikazu propose a method\nto isolate the important influential uncertainties which could be useful for the proposed project of\nhybrid testing and development of complex systems. Their approach will help describe the\ncontributions made toward improvement by experimentation and simulation. Their proposed\nmethod was successfully tested with an autonomous flight system.7\nThis 16.62x project seems to fall under the category of yet another way to develop and test\na complex system, but the discovery part of the project, describing the contributions towards\nimprovement that both experimentation and simulation offer, is expected to add insight to complex\nsystem development.\n\n4.0\nTechnical Approach\n4.1\nExperiment Overview\n\nThis project will use a hybrid developmental approach in the development of an\nautonomous rover to be tested on an unknown test field. The rover will undergo experimental\ntesting and will also be simulated by a MC simulation. Two designs will be suggested by the two\nforms of testing. The rover will be tested in three configurations on the final test bed: the baseline\nstate, the experimental results state, and the final hybrid design state. The final hybrid design will\nbe a combination of suggestions from the experimental and simulation stages, while the\nexperimental design will be based solely on the experimental results. The quantity measured will\nbe the necessary time to complete the task of making a path from a starting location to a randomly\nplaced IR beacon.\n4.2\nApparatus\n\nThe test field will be a 6' by 6' section of the gridded floor of the hanger. It will be littered\nwith boulders and will be set up randomly by a faculty member for the final test, making it unknown\nand unpredictable. The software that is available from Professor Boppe and will be used for this\nexperiment is called Requirements Driven Development - 100 (RDD-100), which uses a Monte\nCarlo simulation. It has the ability to simulate the various functions of complex systems and\nprovides statistical analysis on the simulated performance of the modeled system.\n4.3\nTest Articles\n\nThe rover that will be used is a car that carries a handyboard that was built for the Spring\n2002 class of 16.070. The handyboard has an IR sensor and commands the motors for the car's\nfour wheels. For a more detailed description, see section 5.2.\n\n4.4\nMeasured Quantities\n\nThe measured quantity will be the time needed to reach the IR beacon from a given\nstarting location. The car and beacon will start within five and eight feet of each other to normalize\ntime results.\n\n5.0\nExperiment Design\n5.1\nDesign for Apparatus\n\nThe boulders for the playing field will be rocks that are collected from campus construction\nsites or Professor Boppe's house. A small wall will be built around the test bed to stop the rover\nfrom exiting the playing field during a run.\n\nThe simulation will be built during the first few weeks of 16.622 and will be based on\nbaseline and additional experimental testing. The RDD - 100 is capable of isolating specific\nfunctions within the overall system during simulation and provides statistical analysis of the\nmodeled system.8 The simulation will vary many factors such as the starting location of the rover,\nthe location of the IR beacon or goal, the number of obstacles, the placement of obstacles, and the\namount of power available to the rover. Professor Boppe will assist in the construction of the\nsimulation of the rover and the operation of the software as it is well known to him. Figure 3 is a\nstate transition diagram example of logic for both the simulation and the rover. It was developed by\nProfessor Boppe. Figure 4 is a schematic that shows planning for the simulation. It highlights the\nthree primary processes within the simulation: rover mechanics, rover logic, and the environment.\nIt was also provided by Professor Boppe.\n\nFigure 1: State Space Diagram for simulation and rover logic\n\nFigure 2: Simulation planning - 3 primary processes\n\n5.2\nDesign for Test Articles\nThe rover that will be used is a car that measures 12 inches by 6 inches, has four wheels,\ntwo front touch sensors, and carries a handyboard. The handyboard (see Figures 3 and 4) has an\nIR receiver and controls the motor of the car. The handyboard runs on C code that is loaded by\nthe compiler Interactive C, which has already been obtained. The rover was used in the last year\nfor a 16.070 project, and that code still exists. While this project is more complicated, the existing\ncode will be used as a starting point for coding the new mission.\n\nFigure 3: Handyboard9\n\nFigure 4: Car with handyboard in place\nThe following mission has been chosen for the rover: the rover will move from its starting\npoint to locate and move to an IR beacon. The beacon will always be able to be seen above the\nrock obstacles. A search for an algorithm to support this mission is underway. The following\npseudocode, written by Malena, is an example of the logic that could be used for this mission.\nConstant Signal algorithm:\nRandomly choose rover start location and IR beacon location.\nChoose such that there is a distance of 5-8 feet between the two locations.\nRover turns on.\nRover pivots until signal is found.\nRover moves towards beacon.\n\nIf the rover loses the signal:\nRover pivots until it finds it again.\nIf the rover detects an obstacle:\nRover backs up\nRover pivots a certain number of degrees,\nRover moves towards beacon.\nIf the rover hits the beacon:\n\nRover shuts off motors.\n5.3\nExperimental Procedures\nThe following is a general outline of the procedures that will be followed to complete this\nexperiment. During the development and testing stages, detailed records will be kept to facilitate\nthe discovery and description of contributing factors from experimentation and simulation towards\nimprovement in performance of the rover.\nCollect boulders for test field.\nRefine existing code for the rover to accomplish its new mission.\nRun baseline tests to examine rover performance, sensor performance,\nenvironment/rover interaction, and battery and motor performance.\nMake modifications to rover based on intuition and experience gained from the\nbaseline tests to create a new baseline rover.\nPerform experimental tests, record information, and record suggestions for\nimprovement to rover.\nDevelop a simulation based on the baseline tests and the experimental tests and\nrun it numerous times to generate statistics about its operation and to observe its performance in\nvarious situations.\n\nRecord observations from the simulation and record suggestions for improvement\nto rover.\nTest baseline, experimental, and simulation rover designs and compare the\nperformance of the rover in time needed to reach the goal from the designated starting locations.\n5.4\nMeasurement Systems\nA stopwatch will be used to measure the time from the beginning to the end of the path of\nthe rover. A tape measure will be used to place the rover, its goal, and also the boulders on the\ngrid. The grid is already marked with one foot squares, but additional tape may be laid down to aid\nin measurements.\n5.5\nErrors\nHuman error in time and distance measurements will be the most significant error in the\ndata for this project. These errors are not expected to effect the data greatly, however, as they will\naccount for less than a percentage point of the expected effected quantities (0.1 second error or\n0.5 inch error out of 200 seconds of time or 72 inches of measurement). Variability in the rover\ncould cause error in measurements. The main concern with the rover is the durability of the motor\nafter repeated trial runs. The level of battery power available will be measured at regular intervals\nduring testing, and breaks will be taken to recharge the batteries to full power.\n5.6\nTest Matrices\nEach rover configuration will be tested ~10 times with different starting locations for the\nrover and its goal at each run. After speaking with Professor Kuchar, it has been demonstrated\nthat the number of needed tests will not become clear until after some initial testing is done. The\nvariation in times of the tests will determine how many tests will need to be performed to get\nstatistically significant data. The same pairs of locations will be used with each configuration to\nencourage statistically significant data collection. During experimental runs, simulation, and the\n\nfinal testing runs, the rover and its behavior will be studied in an attempt to describe and qualify the\ncontributions of both experimentation and simulation towards improved performance of the rover.\nThe test matrix can be found in Table 1. A star indicates that the selected rover design and testing\nwill occur.\nTable 1: Test Matrix\ntest 1 ... test 2 ... test 3 ... test n-1 ... test n\nrover design\nunknown test field\ncontributions from\nexperimentation\ncontributions from\nsimulation\nbaseline\ndesign\n\nexperimentally\nderived design\n\nhybrid\ndevelopmental\napproach\ndesign\n\n5.7\nVariables\n\nThe primary independent variable for the testing will be the configuration or status of the\nrover. The starting location of the rover and the location of the IR beacon will change with each\ntest. The starting locations will be constant between the various rover configurations. The starting\nlocations are another independent variable that will be determined at the beginning of the final\ntesting. The battery power at the beginning of each test is a parameter that will need to be\nmeasured. The dependent variables being measured during this experiment are the time needed\n\nto complete a path from the given starting location to the location of the IR beacon and whether or\nnot the task was completed.\n5.8\nOrigin of Materials\n\nThe rover being used is a car that was built for the 2002 16.070 class. Its operating\nsystem will be an onboard handyboard. These cars already exist within the department and will\nnot need to be purchased. The 'boulders' on the test field will be rocks collected from campus\nconstruction sites or Professor Boppe's home. The gridded floor of the hanger will be used as the\ntest field. A last possible purchase is that of any new sensors, but it is not anticipated that they will\nbe needed. As there were many cars built for 16.070, a lack of backup parts is not a concern.\n5.9\nSafety Concerns\nThere are no major safety concerns associated with this project.\n\n6.0\nData Analysis\n\nData analysis will begin as soon as the rover is functional. Two major analyses will need\nto be done, that of performance on the final test bed and the discovery of contributions from the\ntwo approaches within the hybrid approach. When considering performance improvement, this\nproject will be searching for a trend of improvement for the ~10 tests run in each rover\nconfiguration. For example, to confirm the hypothesis, the overall performance of the hybrid rover\nwould be better than that of the experimental rover or baseline rover. A better performance implies\nshorter test field task completion times. Much of the analysis will be graphical, which will illustrate\ntrends well. The same pairs of locations will be used for each of the rover configurations to keep\nresults as comparable as possible.\n\nErrors are likely in the final testing stage due to the small number of runs. It will be\ndetermined during testing how many runs are required to result in statistically significant data. The\n\ndecision will be based on the variation of times of runs. The smaller the standard deviation of\ntimes, the smaller number of runs will need to be made in order to collect statistically significant\ndata.\n\nThe discovery and description analysis of contributing factors towards improvement will be\nqualitative and not quantitative. Constant records will be kept during the development and testing\nstages and these will be analyzed to describe the contributions from experimentation and\nsimulation.\n\nThe hypothesis will be proven or disproved by the presence or absence of statistically\nsignificant shorter task completion times for the hybrid design rover than the baseline or\nexperimentally derived rover. It is also necessary that the project is able to describe individual\ncontributions towards improvement in order for the hypothesis to be proven true.\n\n7.0\nProject Planning\n7.1\nBudget\nThe car and handyboard have already been acquired from the 2002 16.070 class final\nproject at no cost to the project. Rocks will be collected from campus construction sites or\nProfessor Boppe's house, which will accrue no cost to the project. It is not anticipated that a\npurchase of more sensors will be required, as many exist on other 16.070 cars and are available at\nno cost. A detailed version of the budget is available in Table 2.\n\nTable 2: Budget\nRequired Item\nSource\nNumber\nPrice/Unit\nReal World\nPrice (dollars)\n16.62x Cost\n(dollars)\nCar Body\nMIT\n~ 100.00\n100.00\n0.00\nHandyboard\nMIT\n299.00\n299.00\n0.00\nRDD - 100\nBoppe\nNA\nNA\n0.00\nRocks\nConstruction sites\n/ Boppe\n~25\n0.00\n0.00\n0.00\nAdditional Sensors\nMIT\nNA\nNA\nNA\n0.00\nTotal\n\n399.00\n0.00\n\n7.2\nSchedule\nThe rover has already been obtained, and building will commence at the start of term for\nboth the rover logic and the simulation. The majority of the time during the project will be spent\ntesting and suggesting changes to the rover. Two weeks have been allowed for final testing, but\nno more than six hours of actual final testing time should be needed. A large time requirement in\nthis project will be the time needed to make changes to the rover's hardware and software. This\ntime is included under the development stages for experimentation, simulation, and hybrid. The\nlast seven weeks of the term are being left for data analysis and presentation and report work. A\ndetailed schedule is available in Table 3.\n7.3\nSupport\nThe testing will occur on the gridded floor of the hanger. Testing time will be coordinated\nwith another 16.622 group using the floor. No machine shop time is anticipated. The RDD - 100 is\nbeing supplied by Professor Boppe and the car(s) are being supplied by the technical support staff.\n\nTable 3: Schedule\nWeek:\nTask\nStart\nDate\nEnd\nDate\n10 11\n12 13 14\n\nExperiment\nSetup\n2/4\n3/9\n\nBuild Simulation\n2/4\n3/9\n\nBuild Test Bed\n2/4\n2/9\n\nBuild Rover\n2/4\n2/23\n\nRover\nDevelopment\n2/17\n4/18\n\nSystem Testing\n2/17\n3/9\n\nExperimental\nApproach\n2/24\n3/9\n\nSimulation Runs\n3/10\n4/6\n\nHybrid\nApproach\n3/17\n4/6\n\nFinal Testing\n4/7\n4/18\n\nAnalysis and\nPresentation\n3/3\n5/13\n\nData Analysis\n3/31\n5/4\n\nOral Progress\nReport\n3/3\n3/6\n\nFinal\nPresentation\n4/7\n5/1\n\nFinal Report\n4/7\n5/13\n\n8.0\nConclusion\n\nThis project will develop and test a rover that follows the signal from an IR beacon to make\na path from a starting to end location. A hybrid developmental approach composed of both\nexperimental and simulation components will be used to suggest modifications to the rover to\nimprove its time performance in completing the task at hand. It is expected that the design\nsuggested by the hybrid approach will have superior performance to the baseline rover and the\ndesign suggested by solely experimentation. During experimentation and development, this\nproject will discover and describe the contributions from experimentation and simulation made\ntowards improvement in performance.\n\n9.0\nAcknowledgements\n\nWe would like to acknowledge our project advisor Professor Charlie Boppe for initiating the\nproject and helping us understand it, Professor Murman for helping us get out the kinks, Professor\nGreitzer for challenging us to make the project better, and Dick Perdichizzi for finding a rover.\nThanks also to Paul Elliott, Professor Dubowski (Course 2), and Jamie Anderson (Draper Labs) for\npossible rover leads.\n\n10.0\nReferences\n1.\nBoppe, C. W., \"Aerospace Product Design - A new graduate subject for MIT practice-\noriented degree programs,\" AIAA Paper 97-1735, Jan. 1997.\n2.\nDaberkow, D. D. and Mavris, D. N., \"An investigation of metamodeling techniques for\ncomplex systems design,\" AIAA Paper 2002-5457, Sep. 2002.\n3.\nCluff, C. and Strelich, T., \"Simulating simulations to lower cost of simulation solutions,\"\nAIAA Paper 2002-4864, Aug. 2002.\n4.\nDeLaurentis, D. A. and Mavris, D. N., \"Uncertainty Modeling and Management in\nMultidisciplinary Analysis and Synthesis,\" AIAA Paper 2000-0422, Jan. 2000.\n5.\nRehman, J., Lock, E., and Nguyen, C., \"A Generalized Methodology for Evaluating and\nOptimizing System Design Factors,\" Proceedings of the Second IEEE International Conference on\nEngineering of Complex Computer Systems, 1996, pp. 212-215.\n6.\nMarczyk, J., \"Stochastic Multidisciplinary Improvement: Beyond Optimization,\" AIAA Paper\n2000-4929, Sep. 2000.\n7.\nToshikazu, M. and Yoshikazu M., \"Identification of Influential Uncertain Parameters from\nMonte Carlo Simulation Data,\" Journal of Spacecraft and Rockets, Vol. 39, No. 4, July 2002, pp.\n615-623. Also AIAA Paper 2001-4397, Aug. 2001.\n8.\nKlein, Andrew, Description of RDD-100 simulation tool, http://www.atl.external.lmco.com/\nprojects/rassp/toolsheets/Ascent.pdf, November 25, 2002.\n9.\nMartin, Fred G., Handyboard Information, http://handyboard.com/index.html, November 25,\n2002.\n\nAppendix A\nDetailed Drawings of Apparatus\n\nFigure 3: Side view of car with scale\n\nFigure 4: Top view of car with scale\n\nFigure 7: Example of test bed\n\nIR beacon\nrover\n\nAppendix B\nDetailed Parts List\nApparatus\n\nrover\n(12\" X 6\" X 3\")\n\nRDD - 100 software\n\nInteractive C software\n\nIR beacon\n\n2 handyboards\n\nhandyboard serial cables\n\n9V batteries\nTest Equipment\n\ntape measure\n\nstopwatch\n\nbattery power measuring device\nMaterials\n\nrocks\n\nwood (2\" X 4\") for barrier\nFacilities\n\ngridded floor of the hanger"
    },
    {
      "category": "Resource",
      "title": "demierry.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/932b8cc29e57ae0d98c359e1e744db8c_demierry.pdf",
      "content": "1/30/2003\nSimulating and Testing Ice Screw Performance in the Laboratory\nFinal Design Proposal\n16.621\nFall 2002\nAuthor: Warren Bennett\nAdvisor: Dr. Kim Blair\nPartner: Stefano Alziati\n10th December 2002\nW. Bennett\nPage 1\n\n1/30/2003\nExecutive Summary\nIce screws are protection devices that allow climbers to anchor themselves to ice. This\nproject is a response to the current lack of any controlled testing procedure for ice\nscrews, and the perceived margin for improvement of ice screw design and usage in the\nfield. This project develops a quantitative, repeatable test methodology for ice screws.\nThis project is of value to the technical and the climbing community because it will\ncreate a methodology for making 'climbing ice' types in the lab. The project will provide\ndata on current safety standards of ice climbing equipment. It is also hoped that this\nstudy will reduce the failure rate in ice climbing by being the first step towards the\nimprovement of such protective equipment, and in educating climbers about the limits\nof their equipment and how to use that equipment most effectively.\nThis project replicates natural ice formations in the laboratory by testing a set of\nmethodologies of ice manufacture and analyzing the ice specimens obtained through a\nseries of prescribed measurements. The objective is to obtain two distinctly different types\nof ice. Once repeatable ice formation has been achieved, the variables affecting ice\nscrew safety can be tested in the test bed. All testing will occur on the MTS machine\nfound in\nTELAC\n(Technology Laboratory for Advanced Composites). Statistical\ntechniques will be used in the processing and presentation of data, and in evaluating\nthe level of success of the project.\nThe projected budget for the project is $2,884. The bulk of expenditure is the purchase of\nthe ice screws themselves at $50 per screw. It is hoped that sponsorship for this aspect of\nthe project will be found through negotiations with equipment manufacturers.\nThe project schedule indicates that data collection will be completed in week 9, two\nweeks before the end of data collection in 622. This gives 2 weeks of leeway before the\nfinal day to collect data in 16.622 for potential problems.\nW. Bennett\nPage 2\n\n1/30/2003\nTable Of Contents\nList Of Figures ........................................................................................................................5\nList of Tables..........................................................................................................................5\n1. Introduction ......................................................................................................................6\n1.1 Background ................................................................................................................6\n1.2 Summary of Project .....................................................................................................8\n1.3 Value to Technical and Climbing Community...........................................................9\n2. Statement of Project.......................................................................................................10\n3. Literature Review ............................................................................................................11\n3.1 Understanding Ice ....................................................................................................11\n3.1.1 Ice Structure .......................................................................................................11\n3.1.2 Ice Formation (morphology) ..............................................................................12\n3.1.3 Micromechanics of Failure.................................................................................12\n3. 2 Ice Testing Results.....................................................................................................12\n3.2.1 Compressive Strength ........................................................................................12\n3.2.2 Flexural Strength.................................................................................................13\n3.2.3 Ice Rheology ......................................................................................................13\n3.2.4 Temperature Dependency................................................................................14\n3.2.5 Impact Testing on Ice.........................................................................................14\n3.3 How to make Ice ......................................................................................................15\n3.4 Ice Screw Testing ......................................................................................................15\n3.4.1 The Harmston/Luebben Study............................................................................15\n3.4.2 Black Diamond internal study ............................................................................16\n3.5 Summary ...................................................................................................................16\n4. Technical Approach.......................................................................................................17\n5. Experimental Design .......................................................................................................18\n5.1 Basic Concepts.........................................................................................................18\n5.1.1 Preliminary Testing ..............................................................................................18\n5.1.2 Stage 1: The Characterization of Ice .................................................................19\n5.1.2 Stage 2: Testing of Ice Screws in Ice ..................................................................22\n5.2 Error Analysis..............................................................................................................25\n5.3 Test Matrices .............................................................................................................26\n5.3.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics.........26\n5.3.2 Stage 2: Testing of Ice Screws in Ice ..................................................................27\nW. Bennett\nPage 3\n\n1/30/2003\nIndependent Variables ..............................................................................................27\n5.4 Safety Concerns........................................................................................................28\n6. Data Analysis ..................................................................................................................29\n6.1 Data Processing ........................................................................................................29\n6.1.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics.........29\n6.1.2 Stage 2: Testing of Ice Screws in Ice ..................................................................29\n6.2 Data Reduction ........................................................................................................29\n6.2.1 Stage 1: ..............................................................................................................30\n6.2.2 Stage 2: ..............................................................................................................30\n6.3 Correlation................................................................................................................30\n7. Project Planning..............................................................................................................32\n7.1 Budget ......................................................................................................................32\n7. 2 Schedule..................................................................................................................33\n8. Conclusion......................................................................................................................35\n9. Acknowledgements .......................................................................................................35\n10. References ....................................................................................................................36\nAppendix A - Recipe for Ice Formation .............................................................................37\nAppendix B - Engineering Drawings, MTS Mounting Apparatus, Stage 2 testing...............39\nAppendix C - Engineering Drawings, ASTM Grips ..............................................................40\nAppendix D - Detailed Parts List.........................................................................................42\nW. Bennett\nPage 4\n\n1/30/2003\nList Of Figures\nFigure 1: Illustrating a climber on an ice face ......................................................................6\nFigure 2: An ice screw ...........................................................................................................7\nFigure 3: A schematic crystal structure of Ih ice..................................................................11\nFigure 4: A spring and dashpot model of ice. ....................................................................13\nFigure 5: MST test apparatus in TELAC. ...............................................................................20\nFigure 6: Schematic of tensile test ......................................................................................21\nFigure 7: Schematic of compressive test ............................................................................21\nFigure 8: Impact testing......................................................................................................21\nFigure 9: Ice screw placement angle.................................................................................23\nFigure 10: Showing the rig for securing the ice specimen during stage 2. .........................24\nFigure 11: Test matrix for stage 1 (each block consists of 4 data points)............................27\nFigure 12: test matrix for stage 2 (each block consists of 4 data points). ...........................28\nFigure 13: Graphs showing scattered normal distributions.................................................30\nFigure 14: Front and right-hand views of stage 2 MTS mounting apparatus......................39\nFigure 15: Third angle projection of main ASTM grips. .......................................................40\nFigure 16: Third angle projection of the connectors...........................................................41\nList of Tables\nTable 1: The proposed budget ...........................................................................................32\nTable 2: The proposed schedule ........................................................................................33\nW. Bennett\nPage 5\n\n1/30/2003\n1. Introduction\n1.1 Background\nAs a sport, ice climbing has been a growth area in the last 10 years. Ever since Yvon\nChouinard introduced the first rigid crampons and curved ice picks in the late 1960's,\nclimbers have been refining techniques and developing equipment in order to push the\nlimits of ice climbing (see Figure 1).\nFigure 1: Illustrating a climber on an ice face*\nOne of the current limitations on ice climbing is the strength of the anchors that the\nclimbers use. Current research into better protection is based on anecdotal evidence\nand lacks a controlled methodology for test or evaluation. Ice screws are the main\nprotection type; thus, for the purposes of this investigation, the focus is solely on ice\nscrews.\n* photograph taken by Luca Marinelli, exhibited courtesy of project adv isor, David Custer.\nW. Bennett\nPage 6\n\n1/30/2003\nIce screws are pieces of climbing safety gear that are used as anchors on a route. This\nroute can be led (when the climber places his own protection on the route) or top-roped\n(a rope anchored at the top of the climb). The climber is then attached to the screw by\na carabiner through the hanger and is thus anchored to the climbing face. Figure 2\nbelow shows an ice screw.\nScrew\nHanger\nFigure 2: An ice screw\nThe ice screw itself consists of a hollow screw that is turned into the ice by use of a\n'hanger' on its end. The screw first 'bites' the ice with a set of sharp, beveled teeth; as it is\nturned the ice is forced out through the center of the hollow screw. In order to reduce\nfriction, both the inside surface and outside threaded surface of the screw are machined\nto be smooth. The screw is usually in the range of 10-22 cm long and has a diameter of 17\nmm, the hanger is typically around 8 cm long. Screws can be made from steel or\ntitanium.\nIce screws provide effective anchoring, if placed properly, but, like all protection\ndevices, they are subject to the changeable nature of the ice environment. Proper\nW. Bennett\nPage 7\n\n1/30/2003\nplacement is defined as placing the screw in good ice and at an orientation that allows\nthe loading to be held by the screw threads, so the load path runs the length of the\nscrew.\nThe essence of good ice protection is speed and reliability. The gear must be placed in\ntens of seconds to minimize climb-time and thus fatigue. It must also sustain the forces\nproduce in the event of a fall (around 10 kN).\nExisting research is lacking in the area of ice protection technology. There a few\ndocumented tests in the public domain, but these tests have not been sufficiently\ncontrolled. The statistics from these tests, notably the Harmston, Luebben study in 19971\nand the study commissioned by Black Diamond,2 lead to the conclusion that there is\nroom for improvement in ice protection performance.\nThere have been numerous papers into the study of ice mechanics and also into the\nstudy of the rheological nature of ice. This forms the basis of the literature review in\nsection 3.\n1.2 Summary of Project\nThe motivation for this project is twofold. Firstly, the poor performance of ice screws in\nexisting tests. Secondly, the lack of repeatability of the existing tests. It is believed that\nwith a standardized testing procedure, ice protection improvement will be possible.\nThe project goals are, first, to produce a realistic simulation of the ice in the lab, and,\nsecond, to test the factors that affect the safety of ice screws and their placement. In\norder to realize this project, the procedure is:\n1)\nInvestigate and understand ice types and their formation\n2)\nDevelop a method of repeatably replicating the ice flows\n3)\nDevelop a controlled methodology for testing the factors that affect the\nsafety of the placement of ice screws.\nSuccessful completion of the primary goal will permit controlled testing and evaluation of\nice screws and will allow the industry to initiate standardized testing of ice protection,\nW. Bennett\nPage 8\n\n1/30/2003\n1.3 Value to Technical and Climbing Community\nThis project is of value to the technical and the climbing community because it will\ncreate a methodology for making \"climbing ice\" types in the lab. There is no data\navailable on repeatable ice formation processes for testing ice-climbing equipment in\nthe public domain. If ice is effectively simulated in the laboratory, the industry will be\ncloser to setting safety standards and thus providing safer protection for climbers\neverywhere. An inexpensive, reliable and realistic lab-based testing method for ice\nprotection would give strong support to the development of ice protection beyond its\npresent state.\nIf the first part of the experiment is fulfilled, then this project will go on to provide data on\ncurrent safety standards of ice climbing equipment. It is also hoped that this study will\nreduce the failure rate in ice climbing by being the first step in educating climbers about\nthe limits of their equipment and how to use that equipment most effectively.\nW. Bennett\nPage 9\n\n1/30/2003\n2. Statement of Project\nPrimary Hypothesis:\nThe structure and morphology of different types of ice formations can be characterized\nand simulated in a lab to provide a \"test bed\" useful for assessment of ice screws.\nSecondary Hypothesis:\nIf the above hypothesis is true, then using the simulated ice, the variables affecting screw\nplacement safety can be determined.\nThe objectives are then, firstly, to develop a repeatable means of reproducing ice in a\nlab and to characterize this ice using rheological data or to understand why ice cannot\nbe simulated in the lab, and secondly, to use this ice model to test simulated falls on ice\nscrews in a manner closely related to climbing conditions.\nThe success criteria that will be used to measure the project are:\n1)\na) If hypothesis 1 is true, then success is characterizing the critical rheological\nproperties of ice.\nb) If hypothesis 1 is false, then success is identifying why ice cannot be made\nsuccessfully.\n2)\na)\nIf hypothesis 2 is true, then success is the development of a test for ice\nscrew safety that produces consistent data and repeatable data.\nb)\nIf hypothesis 2 is false, then success is identifying why ice screw\nperformance cannot be characterized.\nW. Bennett\nPage 10\n\n1/30/2003\n3. Literature Review\nThe three topics of the literature review cover: the understanding of ice, ice testing\nresults, and ice screw testing.\n3.1 Understanding Ice\nThis section covers ice structure, ice formation, and the micro mechanics of ice failure\n3.1.1 Ice Structure\nIce is close to melting at the temperatures at which it is encountered in climbing (around\n0o, according to the Harmston and Luebben study1). As such, it is a 'high temperature'\nmaterial that exhibits a wide variety of behavior that is dependent on a number of\nfactors. Ice can creep with little applied stress, or it can fracture in a brittle manner. Thus,\nclassical solutions do not work for analysis of ice; it is neither a 'simple elastic' nor an\n'elastic/plastic' solid. Instead, specific methods for its characterization must be\nundertaken.\nAccording to Schulson3, ice has 12 different crystallographic structures and 2 amorphous\nstates. The particular structure formed most commonly in nature is the Ih-type. This is\nformed by simply freezing water and has a hexagonal structure (see Figure 3).\nFigure 3: A schematic crystal structure of Ih ice\nThe oxygen atom is strongly covalenty bonded to the 2 hydrogens to form a single water\nmolecule, but, when frozen, the water molecules themselves are bonded weakly by\nhydrogen-bonds. Vacancies in the structure are predominantly point defects. It is these,\nW. Bennett\nPage 11\n\n1/30/2003\nalong with the dislocation density (the number of grain boundaries per unit volume), that\ndetermines the characteristics of the ice. The microstructure of the ice depends on its\nmechanical-thermal history.\n3.1.2 Ice Formation (morphology)\nThere are 3 main ways of forming natural ice:\n1.\nHeterogeneous nucleation at the surface of a slowly flowing water body.\n2.\nNucleation of frazil (Fine spicules, plates or discoids of ice suspended in water)\nparticles that appear in a fast flowing, supercooled water masses.\n3.\nThe freeze up of snow or atmospheric ice nuclei falling into the water.\nThese starting points for ice formation must considered in the context of producing ice in\na laboratory.\n3.1.3 Micromechanics of Failure\nAccording to Wu & Niu4, the main reason for ice failure is due to impurities at grain\nboundaries disrupting the overall structure. These impurities initiate early melting and\nmicrocracks. The grain structure and orientation also affects the failure mode. This\ninformation is important to how the macroscopic ice structure is controlled (by addition\nof impurities for example).\n3. 2 Ice Testing Results\nThis section of the literature review focuses on the methods used to characterize the\nengineering properties of ice.\n3.2.1 Compressive Strength\nThe benchmark for compressive strength is set by uni-axial load tests on specimens in\nlaboratories5. There have been numerous studies carried out on the ice in situ but analysis\nof these tests was hampered by the complex stress states set up within the ice.\nTypical values for the range of compressive strength are from 0.5 - 10 Mpa.\nW. Bennett\nPage 12\n\n1/30/2003\n3.2.2 Flexural Strength\nFlexural strength is generally lower than the compressive strength for ice and typically\nranges from 0.5-3 Mpa. It should be noted that the temperature up to -5oC did not\ninfluence the flexural strength of the specimen.\n3.2.3 Ice Rheology\nThe stress-strain behavior of ice is important to understand as it has relevance to any\nstudy involving ice as a working material.5 In a general sense, ice is described as a\nviscoelastic material. The simple spring dashpot model for ice is shown in figure 4 below.\nThis model attempts to simulate the 4 deformation mechanisms of ice:\n1.\nElastic deformation due to atomic bonds changing length.\n2.\nDelayed elasticity due to sliding at the grain boundaries.\n3.\nViscous deformation due to dislocation movement within grains.\n4.\nDeformation due to microcracks in the ice.\nThe total strain of the ice is usually thought of as the sum of all these components. This\nmodel allows for both the creep of the ice, and the ductile to brittle transition, as strain\nrates are increased. The fourth point is the most important in relation to the project as the\nice screw itself initiates many microcracks, and the primary reason for ice failure is the\npropagation of those cracks.\nFigure 4: A spring and dashpot model of ice.6\nThe values of the spring and dashpot constants are dependent on a number of factors\nincluding the structure and temperature of the ice.\nW. Bennett\nPage 13\n\n1/30/2003\n3.2.4 Temperature Dependency\nIt has been shown that, at temperatures up to -5oC, the flexural strength of the specimen\nis not influenced by temperature.5,7 However at temperatures near zero, it was the\nimpurities at the grain boundaries that induced melting which meant that even the\nflexural strength of thick ice was zero. This change in behavior important for the project\nas this indicates a marked change in behavior around the temperatures of interest.\n3.2.5 Impact Testing on Ice\nA further study of particular relevance to the ice screw testing section of this project are\na series of drop impact tests on laboratory and natural freshwater ice7 conducted in the\nlate 1960s by the Artic and Antarctic research Institute (AARI) and then again by the\nNational Research Council of Canada (NRC) in the late 1980's.\nBoth tests consisted of dropping specially prepared 'impacters' of hemispherical surface\nof weights between 30 and 300kg onto the test surfaces from heights ranging from 0.02\nto 1.6m metres. The measurements taken were the size of the imprint and acceleration\nrecord for the AARI tests, and the maximum pressure and penetration depth (taken using\npressure transducers) in the NRC tests (from this the acceleration record could be\ncalculated).\nThe results of these tests were compared to a hydrodynamic model. The model assumes\nthat a thin layer of crushed ice develops during impact between the indenting body and\nthe undamaged ice, and that its flow is similar to that of a thin layer of viscous fluid. The\nfindings of this study most relevant to the project are:\n1.\nThe energy of mechanical crushing of ice depends on the ice state. This energy\nwas up to 7 times more for cold winter ice in comparison to warm spring ice. The\ncritical temperature was -5?C, either side of this the ice properties were\nsignificantly different. This agrees with the observation made in section 3.2.4.\n2.\nAnalysis of test data showed that, within the considered interval of impact\nvelocities, impact crushing strength of freshwater ice decreased with increasing\nimpact velocities linearly.\nW. Bennett\nPage 14\n\n1/30/2003\n3.\nTheoretical predictions of maximum ice load and depth of penetration, based on\nthe hydrodynamic model coincide closely with experimental data.\nThese findings indicate that a theoretical model can predict some properties of ice to a\nvery high accuracy.\nHowever, the same model may not always predict different\nquantities to the same accuracy.\nThis impact testing is of direct relevance to our project because we expect impact results\nto correlate closely with ice screw performance.\nThis study is limited as it was carried out in an uncontrolled environment.\n3.3 How to make Ice\nInformation on the making of the ice was gathered, via email, from a current expert in\nthe field of ice mechanics, John Dempsey.8 Full details on 'how to make (perfect) ice' is\nfound in Appendix A. Appendix A gives information on test apparatus insulation, tips on\nrepeatable crystal growth (such as the use of existing frost particles to nucleate ice grains\nin the specimen), and it also gives advice on how to allow for the expansion of the water\non freezing. As indicated above, this will only produce one ice type, the most perfect ice\nthat we can make. The methods for making other types of ice will be investigated in the\npreliminary testing stage, section 5.1.1.\n3.4 Ice Screw Testing\nTwo studies are relevant to Stage 2 of this project:\n3.4.1 The Harmston/Luebben Study\nHarmston and Luebben1 conducted tests that consist of placing ice screws into a natural\nice formation and dropping a 185 lb weight from various heights, while statically\nattached to the protection point, giving forces of between 8 kN - 12 kN. The results from\nthis test show that the screw ripped out of the ice 7 out of 12 times. A variety of variables\nwere tested, including screw angle and screw length. The tests suggest that a downward\nangle for the screw is most effective and that a longer screw is more likely to hold than a\nshorter screw. The main conclusion drawn from the test was that ice conditions are so\nvariable that it is difficult to accurately predict the holding strength of ice screw\nplacement.\nW. Bennett\nPage 15\n\n1/30/2003\nA critical examination of the test conditions suggest that many independent variables,\nincluding temperature, sun exposure and ice quality, were not controlled. Also, the\nuncontrolled method of dropping a weight onto the ice screw had no control over the\nstrain rate.\n3.4.2 Black Diamond internal study\nBlack Diamond Equipment has made its own investigations into ice screw effectiveness.2\nThe tests consist of placing ice screws into an ice cell and then loading these cells in a\nUniversal Test Machine. The ice cells are constrained by a steel container and prepared\nusing untreated tap water. Freezing of the cells was at around -10oC and the whole\nprocess took about 72 hours. Ice cells are regenerated 20 times, by simply filling in the\ndamaged hole and refreezing, before being regenerated.\nIt was found in this study that the ice screws tested failed either by levering the hanger\noff the screw head, by breaking of the screw shaft, or by pulling the screw out of the ice.\nIt was also found that the screw placement angle was a significant factor in how much\nload the ice screw could withstand.\nThe limitations on this study are the unpredictable and variable nature of the ice cells\nused for testing. The cell composition was not tightly controlled and regeneration of the\ncell is not consistent.\n3.5 Summary\nIce failure occurs due to impurities initiating cracks on a microscopic level. There is a\nbrittle-elastic behavior change as ice passes through -5oC.\nIt has been found that, when subjected to loading in certain conditions, ice screws fail at\nloads that they are designed to hold. Current research in the area of ice screw testing\nlacks a controlled procedure for the repeatable testing of ice screws in ice. A study that\nregulates not only the ice screw testing but also the ice into which the screw is\nembedded would be beneficial to this area of research.\nW. Bennett\nPage 16\n\n1/30/2003\n4. Technical Approach\nThis project adds to the knowledge base on the subject of ice screw testing by providing\na controlled test environment. This study will bring quantifiable and repeatable results to\nthe field of ice screw testing.\nThere are two distinct stages in the experimental setup of this project:\n?? The characterization of ice.\n?? The testing of ice screws in ice.\nThe main challenge is to repeatably create the structure and morphology of ice in the\nlab. Once the ice formations can be created in a laboratory, a realistic testing method\ncan be devised. The major hurdle is in creating the different types of ice encountered by\nclimbers. These ice types range from good ice (pure, transparent and crack free) which\nis thought to be the safest, to hollow, layered, slushy, aerated and chandeliered which\nare all thought to be poor ice types for screw placement. This descriptive basis for the ice\nis then converted to quantitative properties based on analysis. Not all the ice types can\nbe created and tested owing to the timescale of 16.622. Therefore, two ice types were\nchosen (see section 5.1.1 for further details).\nThe first step towards a controlled methodology for ice screw testing is thus the ability to\ncharacterize the ice and make it consistently. This step entails defining a process and\nthen being able to test the ice for certain properties and gaining repeatable results.\nOnce the ice test-beds have been developed so they are representative of climbing\nconditions, the ice screws can be tested. Initially, the screws will be tested on 'perfect'\n(flawless) ice. Comparisons between with results from the previous tests (Harmston and\nLuebben1 and the Black Diamond study2) will be conducted. This is the control. When\ntesting the ice screws, the independent variable will be the screw placement angle. The\nvariables chosen are to be limited owing to the time-scale of the course.\nW. Bennett\nPage 17\n\n1/30/2003\n5. Experimental Design\n5.1 Basic Concepts\nThis section explains the planned experimental procedures for the project.\n5.1.1 Preliminary Testing\nThis stage involves experimenting with different types of ice and finding the most\neffective method of creating repeatable ice. To this end, possible methods for making\nthe different kinds of ice will be investigated. The factors under test will be air and\nimpurity concentrations in the ice, the critical levels of which will be obtained. One\nparticular issue to be addressed is the effective production of distinctly different types of\nice (based on their properties).\nFrom this preliminary testing module, two different types of ice, named ABS1, and ABS2\n(Alziati & Bennett Standard #) will have been obtained. It is hoped to produce a sample\nof 'perfect' ice (few cracks, no aeration, no particulates), and a sample of either\naerated ice, or 'dirty' ice (high particulate concentration).\nThe potential strategies for creating the aerated ice are as follows:\n1. Drill air holes into the ice.\n2. To use a mixture of crushed ice and water close to freezing point.\n3. Suspend small pockets of air in the ice mix (using tethered balloons)\n4. Construction of a specialized rig that constantly blows air through the ice mix.\n5. The use of soda water or carbonated water.\n6. A combination of these strategies.\nThe most effective method for creating aerating ice will be determined during the\npreliminary testing stage of the project. The method will be chosen based on the best\ncombination of speed, ease of production, and quality of ice produced.\nThe creation of these 'bad' types of ice is not a widely documented subject. Hence, it is\nextremely difficult to say exactly how the specimens will be made. However, limited\npreliminary testing of 'bad' ice during the Fall Semester 2002 has yielded some interesting\ndiscoveries. Encouraging results have been obtained in making small-scale formations\nwith carbonated water.\nW. Bennett\nPage 18\n\n1/30/2003\nOne further decision to be investigated during preliminary testing is the size of the ice\nspecimen. The specimen must be large enough to have a screw inserted into its body\nand not show any visible signs of stress, and it must be small enough to carry manually.\nA further option for ice production is the purchase of prefabricated ice.\n5.1.2 Stage 1: The Characterization of Ice\nThis stage will consist of testing the mechanical properties of the two different types of ice\nproduced, named ABS1 and ABS2. The methodology for creating these ice types\neffectively will have been developed in the preliminary testing. Each ice type will have\nproperties that are measured to be significantly different. The objective of this stage is to\ncharacterize each ice type in terms of its physical and mechanical properties.\nFirst, the physical properties of the ice produced (density, purity) will be measured. The\ndensity will be calculated by measuring the volume and the weight directly; the volume\nitself will be measured by recording the amount of water the specimen displaces. Purity\nwill be measured by weighing the mass of particulate added to the water before\nfreezing. Second, to characterize the ice specimens mechanically, specimens will be put\nunder standard tensile and compressive tests in an MTS machine (see figures 5, 6 and 7).\nAs shown in figure 6, the tensile test plates will be frozen into the ice specimen and then\npulled. A notch will be machined into the specimen to ensure that failure does not occur\nat the plate/ice interface. The MTS machine will apply a gradually increasing force until\nthe failure occurs. For the compressive test, the ice specimen will be placed between\nthe plates of the MTS machine, and a compressive force will be applied, as shown in\nfigure 7. For the characterization stage, the cylindrical ice specimen dimensions will be 10\ncm diameter and 15 cm in length.\nFrom these tests the material properties of tensile strength, and compressive strength will\nbe measured directly. The Young's Modulus will also be evaluated from the results of the\ntests. A computer records the displacement, load, and time data from the MTS machine.\nW. Bennett\nPage 19\n\n1/30/2003\nFigure 5: MST test apparatus in TELAC.9\nW. Bennett\nPage 20\n\n1/30/2003\nF(t)\nF(t)\nContact plates\nIce\nSpecimen\nF(t)\nF(t)\nPlates\nfrozen into\nthe ice\nFailure notch\nFigure 6: Schematic of tensile test\nFigure 7: Schematic of compressive test\nThe third test that will be carried out is an impact test. For this test a heavy steel ball will\nbe dropped from a fixed height onto the ice surface. The radius of indentation will then\nbe measured and the impact toughness can be calculated. An illustration of this is\nshown in Figure 8.\nIndentation width\nSteel Ball\nFigure 8: Impact testing\nW. Bennett\nPage 21\n\n1/30/2003\nTesting of each specimen will be carried out at two different temperatures either side of\nthe critical -5?C temperature where the ice properties change from elastic to brittle.\nThe making of each specimen will be carried out according to a combination of both\nthe recipe prescribed by Dempsey8 (please see appendix A) and of the processes\nexamined in the preliminary experimentation.\n5.1.2 Stage 2: Testing of Ice Screws in Ice\nOnce the ice types have been produced and mechanical characteristics measured, the\neffect of placement angle on ice screw safety will be tested on each ice type (see figure\n8). Each of these tests will be conducted at values of -15?, 0?, and 15? of ice screw angle\nplacement. This angle is measured relative to the perpendicular of the ice face, where\npositive is above and negative below (as illustrated in figure 9). The loading of the\nspecimens in the MTS machine will be under two regimes:\n?? Impact Strength\nThe impact strength will measured by fast loading of the screw. The load rate will\nbe at 10kN per second, which is the approximate load rate of a falling climber.\nThis will be increased until failure.\n?? Low load rate\nThis regime is at a low load rate of around 0.1kN per second (a factor of 100\nbelow the Impact Strength regime above).\nW. Bennett\nPage 22\n\n1/30/2003\nFigure 9: Ice screw placement angle\nThese ice screw tests will be carried out in an MTS machine (figure 5). A computer will\nrecord the displacement, load, and time data.\nThe rig that will hold the cylindrical ice specimen in place during testing is shown in figure\n10. The rig consists of a piece of sheet steel folded into a configuration that will give\nmaximum contact area over the ice/steel interface. For a detailed plan of the mounting\napparatus please see Appendix B. The specimen will be placed inside this large angle\nand strapped on using canvas ties and ratchets. The ties will also support the ice against\npremature cracking when the ice screw is placed in the end of the specimen. Then the\nentire apparatus will be screwed onto the steel base plate of the MTS machine. The ice\nscrew will be attached to the MTS ram by means of clamps (see Appendix C).\nW. Bennett\nPage 23\n\n1/30/2003\nHolding\nStraps\nIce Specimen\nSteel Sheet\nIce Screw\nAluminium Angles\nFigure 10: Showing the rig for securing the ice specimen during stage 2.\nIt should be noted that a new ice screw will be used for every test. Identical ice screws\nwill be used for all experiments.\nFor this stage of the experimentation the dimensions of the ice specimen will be around\n30 cm in diameter and 40 cm in length. However, as stated before, the exact dimensions\nhave yet to be determined in the preliminary testing stage.\nW. Bennett\nPage 24\n\n1/30/2003\n5.2 Error Analysis\nThe main source of error comes from the unpredictable nature of ice fracture. This will be\nhandled with the use of statistics (see section 6.2). Before applying the statistical analysis\ntechniques, the systematic errors must be identified. This will leave only data variation\ndue to the unpredictable nature of ice.\nThe errors associated with this project are located mainly in the measurements that will\nbe taken throughout testing. The greatest source of error lies in the MTS loading machine,\nwhich is accurate to a tolerance of ±13N. At a testing load of 2kN this represents an error\nof 0.65%, which is very small.\nOther possible errors are associated with the measurement of length, temperature and\nvolume and mass:\n?? Lengths: The MTS machine quotes measurements to an accuracy of ±0.1 mm. This\nequates to an error of 0. 5-1 % based on lengths of possible ice screw movement.\n?? Temperatures: Temperatures are measured to an accuracy of one decimal\nplace using a thermocouple and digital readout. The errors associated with this\nare 0.5 - 2.5 %.\n?? Volume measurements will be made by recording the amount of water\ndisplaced by the ice specimen. The errors associated with this are 0.5%\n?? Mass will be measured using an electronic balance accurate to 3 decimal\nplaces. The errors associated with this are small enough to be neglected\ncompletely.\nTherefore the total probable error in this project is around 5 %.\nW. Bennett\nPage 25\n\n1/30/2003\n5.3 Test Matrices\nThe test matrices for the project are laid out below with details on the dependent and\nindependent variables. Owing to the erratic behavior of ice, all characterization and ice\nscrew tests will be repeated 4 times, and statistical techniques applied to obtain the\n'true' values, thus the blocks in the test matrices represent 4 data points.\n5.3.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics\nThe independent and dependent variables for stage 1 are listed below. These are\nfollowed by a diagram of the test matrix for this stage.\nThe measurements taken in this stage will occur in 2 different modes:\nFirstly, the identification measurements will be taken:\n1. Mass of ice formed (kg)\n2. Volume of ice formed (m 3)\n3. Mass of impurity dissolved in water (kg)\nSecondly, the measurements taken from the tensile, compressive and impact tests will be\nthe following:\nIndependent Variables\nThe controlled variables in this stage are:\n1.\nTemperature of ice: initially two values will be set at -2?C and -10?C, but may be\nsubject to change according to the refrigeration unit's capabilities.\n2.\nIce type will be changed: ABS1, and ABS2 will be tested at each of the above\ntemperatures.\nDependent Variables\nThe values that will be measured from the tests at this stage are:\n1. Stress level at tensile fracture (N m-2)\n2. Stress level at compressive fracture (N m-2)\n3. Extension of the ice specimen after fracture (m) [Tensile and compressive tests]\n4. Depth and radius of indent (m) [Impact test]\nW. Bennett\nPage 26\n\n1/30/2003\nFigure 11: Test matrix for stage 1 (each block consists of 4 data points).\n5.3.2 Stage 2: Testing of Ice Screws in Ice\nThe independent and dependent variables for stage 2 are listed below. These are\nfollowed by a diagram of the test matrix for this stage.\nIndependent Variables\nThe controlled variables in this stage are:\n1. The screw angle will be varied between +15? and -15?\n2. Ice type will be changed: ABS1 and ABS2 will be tested at each screw angle.\nDependent Variables\nThe values that will be measured at this stage are:\n1. The load at which the ice screw pulls out under the high load rate regime (kN)\n2. The load at which the ice screw pulls out under the low load rate regime (kN)\nW. Bennett\nPage 27\n\n1/30/2003\nFigure 12: test matrix for stage 2 (each block consists of 4 data points).\n5.4 Safety Concerns\nThe major safety concern connected to working with subzero materials is that prolonged\nexposure can lead to frostbite. To avoid this, gloves will be worn when handling ice.\nIt is also expected that the ice specimens will be of considerable size and weight. Hence\nwhen moving these specimens, caution must be exercised to avoid back injury.\nLastly, ice is a brittle material and will facture on impact. Thus, safety goggles should be\nworn when testing the ice, to protect against flying ice chips. Also, shielding will be set up\naround the test specimen.\nDuring all experimentation TELAC (The MIT Technology Laboratory for Advanced\nComposites ) safety procedures will be followed.\nW. Bennett\nPage 28\n\n1/30/2003\n6. Data Analysis\n6.1 Data Processing\n6.1.1 Stage 1: Production of Ice and Testing of its Mechanical Characteristics\nData processing in stage 1 will involve the use of equations 1 and 2 to provide the value\nof the Young's Modulus, E,. The MTS computer will give the values of the force applied at\nfailure via a digital read-out. The only processing that must be done here is dividing this\nforce by the cross-sectional area of the plane of failure to obtain a value of the stress\nlevel, ?x.\n? l\n? x\n? x ?\n[1]\nE ? ?\n[2]\nl\nx\n6.1.2 Stage 2: Testing of Ice Screws in Ice\nData processing from stage 2 will comprise recording MTS digital read-out of forces at\nfailure. After error analysis and accounting for offset measures, these are the values that\nwill be quoted in the experimental results.\n6.2 Data Reduction\nTo reduce the data, a statistical approach will be taken. Owing to the random nature of\nthe behavior of ice, each individual test will have to be repeated a certain number of\ntimes so that statistical techniques can be used. The experiments will be repeated four\ntimes only, due to time constraints. Ideally, good results would yield a standard deviation\nsmaller than the mean value and a skewness of the same order of magnitude as the\nstandard deviation.\nTo illustrate this point, figure 13 shows some distributions that might be expected. If the\nscatter graph for the experiments looks like graph 1 in Figure 13, then no more\nexperiments need to be carried out. If, however, the scatter of data is similar to graph 2,\nthen the number of experiments should be increased in order to reduce the standard\ndeviation. Unfortunately, as stated before, this could prove difficult owing to the time\nconstraints. The problem is balancing the need for statistical significance with the time\navailable.\nW. Bennett\nPage 29\n\n1/30/2003\nFigure 13: Graphs showing scattered normal distributions\n1) Low standard deviation\n2) High standard deviation\n6.2.1 Stage 1:\nThe mean and the standard deviation of the results will be taken. The values obtained\nwill be fitted to a normal distribution and the confidence level of the values for tensile\nand compressive strength, E, and impact strength will be ascertained. Further statistical\nmeasures that will be investigated are the mean square value and the t-statistic test.\nThese tests will indicate the consistency of the data and hence the level of success in\nachieving repeatability in the results.\n6.2.2 Stage 2:\nAgain the mean and the standard deviation of the data obtained will be obtained and\nfitted to a normal distribution to obtain a confidence level for each test. The mean\nsquared value will be analyzed, as will the t-statistic and so the degree of confidence in\nthe distribution will be ascertained.\n6.3 Correlation\nIn order to prove the first hypothesis is correct the results of stage 1 will be analysed, and,\nif consistent, then the ice types produced have been made in a controlled repeatable\nfashion and therefore simulate ice effectively. Successful characterization is defined as\nobtaining recorded mean measurements for 'good' ice that lie within one standard\ndeviation of the quoted values in the available literature. Successful characterization of\nbad ice is defined as obtaining data with a standard deviation of the same order of\nmagnitude as that obtained for good ice. There is no data available for comparison of\npreviously recorded values.\nW. Bennett\nPage 30\n\n1/30/2003\nThe second hypothesis will be proved correct if there is a definite trend of repeatable\ndata from the various loading measurements. This will show how the placement angle\naffects ice screw safety. Repeatable data is defined as having a standard deviation of\nless than 15 % of the mean value. The data in the Black Diamond study2 had a standard\ndeviation of approximately 25 % of the mean value. It is believed that 15 % is a figure that\nwould be acceptable as an industry standard test.\nW. Bennett\nPage 31\n\n1/30/2003\n7. Project Planning\n7.1 Budget\nThe most expensive part of the budget is the ice screws. At $50 per piece, they provide\nthe bulk of the cost. To address this issue, potential sponsors, including Black Diamond,\nthe world leaders in ice screw manufacturing, have already been contacted, as can be\nseen in the schedule below. It is strongly anticipated that a sponsor will be found through\nvarious contacts in the climbing community. This will bring the cost down considerably to\naround $150.\nThe budget is summarized in the table 1. All figures are based on market costs.\nTable 1: The proposed budget\nItem\nAvailability Quantity\nReal World Cost\n16.62X Cost\nMTS Machine use\nMIT\n5 days\n$2,500\ndonated\nMachine Shop\nMIT\nUnknown\nunknown\ndonated\nTest Rig\nMIT\nUnknown\nunknown\ndonated\nRefrigerator\nMIT\nUnknown\nunknown\ndonated\nIce Screws\nOrder\n$2,700\n$2,700\nCarabiners\nOrder\n$30\n$30\nSlings\nOrder\n$24\n$24\nIce Boxes\nOrder\n$40\n$40\nBuilding Materials\nMIT/Order\n$50\n$50\nTotal:\n$5,344\n$2,884\nW. Bennett\nPage 32\n\n1/30/2003\n7. 2 Schedule\nThe proposed schedule for 16.622 and the remainder of 16.621 is shown in Table 2.\nThe preliminary testing has commenced in the 16.621 Fall semester and will proceed\nthrough most of February. The success of the preliminary experiment and discovery of\nsponsors will be presented in the first oral progress report on 27th of March. The ice screw\ntesting will be run in the lab for a maximum of three weeks. The project is predicted to be\nfinished by week 9. This gives 2 weeks leeway in terms of the 622 deadline for unforeseen\ncircumstances. Data analysis will then proceed until the middle of April. From then on,\npreparations will be made for the oral final report and the written final report.\nTable 2: The proposed schedule\nID\nTask Name\nStart\nEnd 16.621 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\nShop Demonstrations\n5-Feb\n7-Feb\nConstruction\n4-Nov 15-Mar\nBuild Test Rig\n16-Feb 22-Feb\nBuild Insulating Box\n16-Feb 22-Feb\nConact sponsers\n4-Nov 15-Mar\nOrder materials\n4-Nov 15-Mar\nStage 1\n22-Oct 15-Mar\nPreliminary Testing\n22-Oct 22-Feb\nMTS Acquaintance\n9-Feb 15-Feb\nIce Testing\n23-Feb 15-Mar\nStage 2\n16-Mar\n5-Apr\nIce Screw Testing\n16-Mar\n5-Apr\nReports and Presentations\n27-Feb 13-May\nOral Progress Reports\n4-Mar\n6-Mar\nLast day to collect data\n18-Apr 18-Apr\nProgress Review\n11-Feb\n3-Apr\nFinal Presentaion\n29-Apr 1-May\nFinal Written Report\n13-May 13-May\nW. Bennett\nPage 33\n\n1/30/2003\n7.3 Facilities Required\nThe MIT Technology Laboratory for Advanced Composites (TELAC) will host all testing.\nTELAC is equipped with an MTS machine that will be used to load the ice specimens and\nice screws. The necessary refrigeration unit required to freeze the ice specimen is located\nnearby the MTS machine. Storage space for the test equipment is also required.\nRequired construction materials are steel brackets, rods, plate, and miscellaneous bolts,\nnuts, etc. for attachment. Additionally blue foam will be used to insulate the steel case.\nThe MIT Gelb laboratory contains all the necessary metal tools to construct the apparatus\nrequired. Items that must be constructed are the steel plates for the tensile loading, the\ncasing (depicted in figure 10) for holding the cylindrical ice specimen and the insulated\nbox for making the ice specimens in.\nW. Bennett\nPage 34\n\n1/30/2003\n8. Conclusion\nIn summary, this project will be a first step towards improvement in ice climbing safety\nand the education of climbers in the limitations of their equipment.\nA successful project will be the simulation of the ice in the laboratory, or the\nunderstanding of why ice cannot be effectively simulated in the laboratory. If ice can be\nsimulated in the laboratory, then the second success of the project will be the\nunderstanding of how ice screw placement angle affects safety.\n9. Acknowledgements\nMy project partner and I would like to extend our thanks to the following people:\nOur advisors, Dr Kim Blair and Dave Custer whose patient guidance and tremendous\nenthusiasm have been a constant source of inspiration.\nProfessor John Dempsey (Clarkson College) whose expert guidance on difficult issues has\nbeen invaluable.\nNemo Equipment Climbing Company whose expert insight into the sport of ice climbing\nhas been instrumental in the development of the project.\nAnd of course the 62X Faculty and staff with a special mention for John Kane and Dick\nPerdichizzi whose experience in the sphere of project testing has proven essential.\nW. Bennett\nPage 35\n\n1/30/2003\n10. References\n1. Luebben, Craig, 'The Cold Truth - How Strong is Ice Protection?', Climbing Magazine,\nNovember 1997, pp. 106 - 115\n2. Harmston. C, 'Myths, Cautions and Techniques of Ice Screw Placement', Internal\nReport, Black Diamond Equipment, July 1998.\n3. Schulson, Erland M., \"The Structure and Mechanical Behavior of\nice\", The Minerals, Metals and Materials Society,\nhttp://www.tms.org/pubs/journals/JOM/9902/Schulson-9902.html, 09/30/02.\n4. Wu, M. S., Niu J., \"Prediction of ice failure by Micromechanics\", AMD Ice Mechanics,\nVol. 163, 1993, pp.35-49.\n5. T. Nakato, R. Ettema, Issues and Directions in Hydraulics (A.A. Balkema/ Rotterdam/\nBrookfield/ 1996.\n6. LØset S., \"Thermomechanical Properties of Materials, examintaions May 24 1997 (0900-\n1300) - Brief solution\", Norwegian University of Science and Technology (NTNU) Faculty of\nCivil and Environmental Engineering Department of Structural Engineering,\nwww.bygg.ntnu.no/~sveinulo/at204/at20497/at204s97.pdf, 10/10/02.\n7. Likhomanov, V., Stepanov, I., Frederking R., Timco G. W., \"Comparison of Results of\nImpact Tests on Laboratory and Natural Freshwater Ice with Hydrodynamic Model\nPredictions\", The Proceedings of the Eighth (1998) International OFFSHORE AND POLAR\nENGINEERING CONFERENCE, Vol. 2, 1998, pp. 453-459\n8. Email from Ice Expert John Dempsey, Clarkson College, Putsdam, New York. Email:\njohn@clarkson.edu, 09/30/2002\n9. Okal, M., 'Carabiner Testing', 16.621 Final Report, Spring 2001, pp. 8-10.\nW. Bennett\nPage 36\n\n1/30/2003\nAppendix A - Recipe for Ice Formation\nForwarded message from John Dempsey john@clarkson.edu\nDate: Mon, 30 Sep 2002 10:35:05 -0400\nFrom: John Dempsey john@clarkson.edu\nReply-To: John Dempsey john@clarkson.edu\nSubject: Re: Information on ice\nTo: salziati@mit.edu\nStefano and Warren,\nPlease give my regards to Professor Parks. I'll give it a go. What size freezer do you have?\nLarger blocks will produce better results.\nSuppose that you make up a cube of a box (quite well made so that it does not leak)\nmake it out of some softwood so that it absorbs water?? Cube of dimension N cm;\nsuppose N is something like 25. Now insulate the bottom and all sides of the box; could\njust use that blue styrofoam but make the wall thickness of the order of 12 cm.\nThis is to stop any freezing nucleation on the sides or bottom. Now fill the box with cold\nwater and put it in the freezer-prepare for leakage because the ice will try to expand\noutwards---which is why you want as much surrounding insulation as possible.\nIf you have the patience, monitor the temperature and stir that water so that\nit all cools more or less uniformly; right near freezing use some of the frost in the freezer as\nseed crystals and float the frost on top.\nThis method should give you repeatable clear blocks - the slower you grow the ice the\nbetter it will be in terms of say dislocation density etc.\nOh, almost forgot, you need a pressure release under the ice as it grows-\nlike a pipe fitted to the side at the bottom-insulated or wrapped in heat\ntape, so that as the ice grows down, it will push water out the pipe-angle the pipe to\nW. Bennett\nPage 37\n\n1/30/2003\nmaintain more or less the same pressure (head). In other words, let this excess\nwater drip into a bucket or some such.\nBe careful of thermal shock-let the ice warm up slowly. You can work at 0 Celsius or very\nnear. I have observed with warm ice, that when you turn ice screws into it, you get these\nvery fine radial crack under the expansion-interesting.\nTemperature of the ice is probably your main variable. Let me know how this goes.\nJohn Dempsey, Prof\nW. Bennett\nPage 38\n\n1/30/2003\nAppendix B - Engineering Drawings, MTS Mounting\nApparatus, Stage 2 testing\nFigure 14: Front and right-hand views of stage 2 MTS mounting apparatus.\nW. Bennett\nPage 39\n\n1/30/2003\nAppendix C - Engineering Drawings, ASTM Grips\nThe full dimensions of the four components of the total ASTM grip set-up are shown\nbelow.\nAll dimensions are given in inches as the machinery in the Gelb Laboratory\noperates with English units.\nFigure 15: Third angle projection of main ASTM grips.\nW. Bennett\nPage 40\n\n1/30/2003\nFigure 16: Third angle projection of the connectors.\nW. Bennett\nPage 41\n\n1/30/2003\nAppendix D - Detailed Parts List\nParts include:\n?? MTS Machine\n?? Refrigerator: temperature controllable between 0°C - -20°C\n?? Thermocouples and digital readout\n?? Grips for MTS machine: ATSM\n?? 54 Ice Screws: Black Diamond\n?? Electronic Mass Balance: correct to 3 decimal places\n?? Measuring Cylinder: 40 liter capacity\n?? Impurities (dirt, sand, grit, etc...)\n?? Aluminium angles: 8 ft long, leg length 1.5 inches, thickness 0.25 inches\n?? Steel plate: 40cm x 65cm\n?? Assorted Nuts & bolts\n?? 10, 000lb Load Cell: As agreed with Dick Perdichizzi\n?? Soda Siphon\nW. Bennett\nPage 42\n\n1/30/2003\n1 Luebben, Craig, 'The Cold Truth - How Strong is Ice Protection?', Climbing Magazine,\nNovember 1997, pp. 106 - 115\n2 Harmston. C, 'Myths, Cautions and Techniques of Ice Screw Placement', Internal\nReport, Black Diamond Equipment, July 1998.\n3 Schulson, Erland M., \"The Structure and Mechanical Behavior of\nice\", The Minerals, Metals and Materials Society,\nhttp://www.tms.org/pubs/journals/JOM/9902/Schulson-9902.html, 09/30/02.\n4 Wu, M. S., Niu J., \"Prediction of ice failure by Micromechanics\", AMD Ice Mechanics,\nVol. 163, 1993, pp.35-49.\n5 T. Nakato, R. Ettema, Issues and Directions in Hydraulics (A.A. Balkema/ Rotterdam/\nBrookfield/ 1996.\n6 LØset S., \"Thermomechanical Properties of Materials, examintaions May 24 1997 (0900-\n1300) - Brief solution\", Norwegian University of Science and Technology (NTNU) Faculty of\nCivil and Environmental Engineering Department of Structural Engineering,\nwww.bygg.ntnu.no/~sveinulo/at204/at20497/at204s97.pdf, 10/10/02.\n7 Likhomanov, V., Stepanov, I., Frederking R., Timco G. W., \"Comparison of Results of\nImpact Tests on Laboratory and Natural Freshwater Ice with Hydrodynamic Model\nPredictions\", The Proceedings of the Eighth (1998) International OFFSHORE AND POLAR\nENGINEERING CONFERENCE, Vol. 2, 1998, pp. 453-459\n8 Email from Ice Expert John Dempsey, Clarkson College, Putsdam, New York. Email:\njohn@clarkson.edu, 09/30/2002\n9 Okal, M., 'Carabiner Testing', 16.621 Final Report, Spring 2001, pp. 8-10\nW. Bennett\nPage 43\n\n1/30/2003\nW. Bennett\nPage 44"
    },
    {
      "category": "Resource",
      "title": "davisvic1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/2c30186ac5b4b60381d7775035ae337d_davisvic1.pdf",
      "content": "TESTING AND IMPROVEMENT OF A COMPLEX SYSTEM\nAutonomous Planetary Rover Experimentation and Simulation\nStatement of Project\n16.621\nFall 2002\nAuthor: Victoria Davis\nAdvisor: Professor Charlie Boppe\nPartner: Malena Stiteler\nOctober 3, 2002\n\nIntroduction\nThe use of complex systems is constantly expanding in both aerospace engineering and numerous other\nfields, and with the spread of these systems, their complexity increases as well. Due to this complexity, the\nsystems and any dependants often suffer from unreliable behavior. This behavior is undesirable in a\ncomplex system and may result in unsafe operating conditions or a mission failure.\nA Monte Carlo (MC) simulation involves the use of stochastic numbers. Such a simulation is usually run\nthousands of times and statistics are taken that describe the behavior of the system that is being modeled.\nMonte Carlo simulations are already used for analysis and modeling in many fields, including molecular\nchemistry, economics, nuclear physics, radiotherapy, and even transportation engineering.\nAlthough testing of systems used to be done experimentally, many fields are now using an analytical\napproach. Wing design is just one such area, and serves as a good example. Where in the past numerous\nwind tunnel tests would be performed, the airfoils are now developed on computers and then tested in a\nwind tunnel for confirmation.\nA hybrid development approach will integrate the two current kinds of testing and development into one.\nExperimentation will be used in conjunction with computer-aided analysis to provide superior development\ncapabilities. This will be done by using experimentation to refine a MC simulation and vice versa. The\nresults from the MC simulation will then be used to change the system, a rover, with the intent of improving\nits performance on various tasks. It has been proposed that this hybrid approach will offer the most benefit\nto high levels of complex systems, but it seems that little research has been done in this area.\nIt is the intent of this project to use the hybrid development approach with an autonomous planetary rover,\nbut at many varying levels of complexity. By varying the task that the rover must perform (such as the\nnumber of goals to achieve, total time for varying missions, locations to find, or the number of items\nretrieved), the overall complexity level of the system will change. The results of this project have the\n\npossibility of providing great insight into the correlation between the improvement of complex systems and\nthe methods used for their development.\nHypothesis\nThere is an increasing trend in performance improvement as system complexity increases when a hybrid\ndevelopment approach is used.\nObjective\nThe objective is to successfully collect data for a system operating at various levels of complexity in order\nto measure a performance increase trend caused by the use of a hybrid development approach.\nStrategies\nThe following strategies will be used to achieve the success criteria:\n1. A rover must be obtained.\n2. Define the varying complexity tasks and make a test metric.\n3. Run initial tests with the rover to get baseline performance data.\n4. Employ a hybrid development approach:\na. Build a Monte Carlo simulation of the rover.\nb. Refine the simulation to fit the results from actual runs of the rover. More tests may be required\nhere and this is a cyclical process. If results do not align, look for errors within the rover that can be\ncorrected.\nc. Run the simulation and collect statistics which can then be used to suggest changes to the\nrover.\nd. Implement any changes to the rover that are a result of the statistics from the MC simulation.\n5. Run the tests with the rover again for the same scenarios as in strategy 3 and collect data.\n6. Analyze and compare the results from 3 and 5.\n\nSuccess Criteria\nData that clearly supports or does not support the hypothesis that performance improvement will increase\nwith system complexity.\nConclusion\nThis project will employ the use of a rover to test the idea that a hybrid development approach has more\nimpact on high levels of complex systems than on those systems that are not as complex. It would be\nbeneficial to the aerospace industry, as well as others, to illustrate some correlation between\ndevelopmental approach and system complexity. Only one rover will be used, but it will perform varying\ntasks that will give the system different overall levels of complexity."
    },
    {
      "category": "Resource",
      "title": "demierry1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/9b4f3222df69a978b1b38770494d0866_demierry1.pdf",
      "content": "CONTROL ALGORITHMS FOR SPACE TUG RENDEZVOUS\nStatement of Project\n16.621\nFall 2002\nAuthor: Timothee de Mierry\nAdvisor: Olivier de Weck\nPartner: Gergana Bounova\nThursday, October 3rd\n\n1. Introduction\nThe Space Tug project is an ongoing MIT/Darpa research project that aims at\ndeveloping a satellite - the Tug - to carry out rendezvous and docking with a target\nsatellite. The mission of the Tug will be to capture its target, change its position and\norbital elements by a predefined amount and release it without damage to the target\nsatellite or itself. The capabilities of the Tug must include the following: rescue satellites\nfrom unusable orbits, orbital debris removal, tactical operations, and other emergent uses.\nThe control system of the Tug used to find and dock with the target is a major aspect of\nthis project.\nThe search for the target satellite is a complex procedure. Although approximate\ncoordinates for its location would be provided, the Tug would still have to search a finite\nspace to find it, since current tracking does not give precision below a magnitude of the\norder of kilometers. As a result, the Tug has to have intelligent identification and sensing\nstrategies implemented in its control system to approach the target.\nA major technology risk in the Space Tug project is the target identification and\ndocking. Showing that such a process is feasible would remove this risk and would\nprovide a possible solution to the problem. In addition, given that the control system of\nthe Tug has thus far been modeled as a black box, the results of this research project\ncould give clues as to what the architecture of the control system of the vehicle should be.\nFurthermore, successful search and rendezvous strategies could be used in other\naeronautical applications, such as autonomous and formation flight.\nSearch strategies and algorithms for robots have been studied quite a lot in the\npast years. As a result, the design part of this project will be influenced by previous work\n\ndone on search algorithm, notably by the MIT department of electrical engineering and\ncomputer science. The basic strategies will be enhanced to fit the purpose of the Space\nTug.\n2. Hypothesis\nThe use of a semi-autonomous search system with human in the loop is the\nalgorithm that will be the most effective for rendezvous and docking strategies in terms of\ntime and energy consumption.\n3. Objectives\nThe project is divided into two distinct parts that will achieve two different but\nclosely related goals. The preliminary objective is to develop, implement, and test three\ndifferent strategies for two-dimensional, non-cooperative target search and precise\ndocking. This goal is the first step in achieving the primary objective.\nThe primary objective of the experiment is to compare these three strategies based\non the trade-off costs between time and energy. The search strategies will be evaluated\nusing predefined criteria, developed into a cost function, to examine the performance of\neach.\n4. Overview of strategies\nFirst of all, a model has to be developed in order to simulate the space\nenvironment. The position of the Tug in space is defined using four dimensions: three\nspherical coordinates and time. As a result, assumptions will have to be made in order to\nbuild a two-dimensional model that will fit the situation. One possibility is to assume that\nthe Tug will be in the same orbital plane, relative to Earth, as the target. Furthermore, this\nmodel will also need to take care of the relative sizes of the Tug, the target and the search\narea. According to these parameters, the area of the test-bed environment will be chosen\n\nto fit the model. The development of the simulation model will be completed by the end\nof the 16.621 semester.\nDuring the second phase of the project, three different search and rendezvous\nstrategies will be developed and implemented, using LEGO? Mindstorms robots. One\nstrategy will be a blind search. The Tug simulator will have no sensors to find the target\nand will search space until it \"bumps\" into the target. The second strategy will be a semi-\nautonomous search with a human in the loop. In this case, the robot's sensor will take\ndata about the searched space and send it to a human controller that will interpret the data\nto maneuver the robot accordingly. Finally, the third search strategy will be a human-out-\nof-the-loop algorithm where the robot will be completely autonomous. This part of the\nproject will be done during the 16.622 phase.\nFinally, a test-bed environment will be created for the robots. It will include a\nnon-cooperative, passive target. The different search strategies will be tested in this\nenvironment, and the time and energy consumption will be recorded in order to develop\nthe proper cost function. This final step - which will take place during the second\nsemester of 16.62X - will enable the comparison between the search strategies.\n5. Success criteria\nLinked to the above objectives, this project has two main success criteria. The\nfirst criterion is the design and development of the search algorithms in the test-bed\nenvironment. The successful implementation of the rendezvous strategies in the vehicle\nsimulating the Tug will provide the necessary data to test the relative effectiveness of\neach strategy.\n\nThe second success criterion is the development of a cost function, based on the\nperformance of each search strategy. The trade-off between time and energy has to be\nrepresented by the cost function of the form C ? ? ?time?? ?1? ? ??energy ? . The relative\neffectiveness of each strategy will be calculated using this cost function and the results\nwill be compared in order to assess the validity of the hypothesis.\n6. Conclusion\nThis project will provide answers to the rendezvous and docking problem that\ncould then be implemented in the broader MIT/Darpa Space Tug project. The results will\nhelp to point out potential solutions and algorithms for the control system of the future\nTug. Time and energy consumption, as well as the successful implementations of the\nthree searching strategies, will be the focus of the research project. It will provide a first\nlook at the cheapest rendezvous strategy that could potentially be used in the Space Tug\nproject. Ultimately, the goal of this project is to show that the semi-autonomous with a\nhuman in the loop search will satisfy this important requirement."
    },
    {
      "category": "Resource",
      "title": "wongbri1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/b3651d9d580aede71873c9294cd720cb_wongbri1.pdf",
      "content": "Assessment of Shape Memory Alloy Actuators for Steered Parachutes\nFinal Proposal\n16.621\nFall 2002\nAuthor: Brian Wong\nAdvisor: Dr. Marthinus van Schoor\nPartner: Benjamin Brooks\nTuesday, December 10, 2002\n\nTable of Contents\nList of Tables .......................................................................................................................ii\nList of Figures ......................................................................................................................ii\nExecutive Summary............................................................................................................ 1\nIntroduction......................................................................................................................... 2\nHypothesis, Objective and Success Criteria ....................................................................... 2\nLiterature Review................................................................................................................ 3\nTechnical Approach............................................................................................................ 4\nExperiment Design.............................................................................................................. 7\nIndependent and Dependent Variables ............................................................................. 11\nTest Matrix........................................................................................................................ 12\nData Analysis .................................................................................................................... 13\nExperimental Errors .......................................................................................................... 13\nSafety Concerns ................................................................................................................ 14\nProposed Budget ............................................................................................................... 14\nDetailed Schedule for 16.622............................................................................................ 15\nFacilities, staff support and space needed ......................................................................... 16\nConclusion ........................................................................................................................ 16\nAcknowledgements ........................................................................................................... 17\nList of references............................................................................................................... 17\nAppendix A: Detailed Parts List ....................................................................................... 18\nAppendix B: Parachute Specifications .............................................................................. 19\nAppendix C: Thermal Model............................................................................................ 20\nAppendix D: Nitinol Properties ........................................................................................ 23\ni\n\nList of Tables\nTable 1: Sources of Error.................................................................................................. 13\nTable 2: Proposed Budget................................................................................................. 15\nTable 3: Proposed Schedule .............................................................................................. 15\nTable 4: Properties of Nitinol............................................................................................ 23\nList of Figures\nFigure 1: Experimental Setup ............................................................................................. 6\nFigure 2: Transition between Martensitic and Austentic States ......................................... 8\nFigure 3: Payload Block Diagram....................................................................................... 9\nFigure 4: Schematic of Test Function Generator.............................................................. 10\nFigure 5: Independent Variables....................................................................................... 12\nFigure 6: Graphical Representation of Test Matrix .......................................................... 12\nii\n\nExecutive Summary\nIn recent years, much time and effort has gone into developing controlled parachute\nsystems to improve to accuracy of unmanned airdrops. Most of the research effort has\ngone into developing the guidance and navigation systems, while ignoring the actuators\nused to control the airdrop system.\nThis proposal contains the plans for an experiment to test a new method and type of\nactuator for autonomous guided parachute systems. The proposed method uses lighter\nand cheaper actuators made from shape memory alloys, materials that change shape when\nheated above a certain transition temperature. One such material that is often used and\nreadily available is Nitinol, and alloy of nickel and titanium. The experiment outlined in\nthis proposal will evaluate how well shape memory alloy actuators made of Nitinol wire\ncan steer a parachute.\nA scaled-down prototype parachute will be equipped with Nitinol actuators as well as\ncontrol and sensing circuits housed in a payload container. Simple models were used to\ndetermine baseline parameters for the experiment. Three independent variables, each\nbeing a different method of changing the amount of power supplied to the actuators will\nbe tested. The system will first be tested in the lab, and then by performing a series of\nairdrops at a testing facility. Having the collected data meet or exceed defined\ncontrollability requirements, would demonstrate the potential use of shape memory alloys\nas parachute system actuators.\nCommercially available equipment will be used to construct the experimental apparatus\nbased on low cost and simplicity. Sources of error have been identified, and the design of\nthe experiment has attempted to minimize or account for these wherever possible. Safety\nconcerns are also addressed, as are the data collection and reduction methods.\nThe proposal also includes information concerning the testing facility at the US Army\nNatick Soldier Systems Center, which will be used for the drop tests. A tentative\nagreement has been reached with Natick, whereby they would provide the facility and\nsupport staff free of charge to the project. The proposal also includes information\nconcerning a proposed budget and schedule, and the additional required facilities and\nstaff support.\n\nIntroduction\nIn 1997, the U.S. Air Force Science Advisory Board identified a need to improve the\naccuracy of unmanned airdrops as one of its recommendations in a report titled\n\"Summary Report: New World Vistas, Air and Space Power for the 21st Century.\"1\nUnmanned cargo parachutes are used by military and humanitarian organizations to\ndeliver payloads such as food, ammunition and equipment. Unfortunately, without\ncontrol, cargo parachutes can be knocked off their intended course by wind and other\nmeteorological phenomena, resulting in lost or damaged cargo. Since the New World\nVistas report, there has been work on autonomous Guidance, Navigation and Control\n(GN&C) systems to address the need of improving the accuracy of parachute drops.\nThese efforts have been successful in achieving their goals, but little has been done in the\ndevelopment of actuators for these airdrop systems. In this proposal, an experiment for\ntesting a new type of actuator will be described, which may be a lighter and cheaper\nalternative to current actuation systems.\nThe proposed new method involves using shape memory alloys (SMAs) as the actuators\nfor a parachute system. A shape memory alloy is, in simple terms, defined as a material\nthat changes shape when heated above its transition temperature.2 In this way, the\nmaterial exhibits memory by \"remembering\" its original shape. One method of raising\nthe temperature of an SMA is by running a high amount of electric current through the\nmaterial; a battery can be used to provide the current necessary to effect a change in\nshape of an SMA. By using this method, a simple actuation system can be built by\npowering shape memory alloy wires with electric current.\nHypothesis, Objective and Success Criteria\nThe experiment will assess whether it is possible to control an unmanned parachute by\nchanging the lengths of shape memory alloys woven into its risers. To quantify the\namount of control these actuators can provide, the objective of the project will be to\nassess experimentally what degree of control can be achieved by changing the lengths of\nthe shape-memory alloy wires in the risers of the parachute. Accordingly, the experiment\n\nwill be deemed a success if it can be determined whether or not using shape memory\nalloy actuators enables a scaled-down prototype parachute system to meet the following\ncontrollability requirements:\nm\nm of vertical drop velocity\n1. A horizontal velocity of 0.5 s for every 10 s\n2. A change in horizontal path of 1 ?\ns for every 10 m\ns of vertical drop velocity\nIf the scaled-down prototype parachute is in fact able to meet these controllability\nrequirements, it will constitute a strong argument for exploring the use of shape memory\nalloy wires as the actuators in new and existing parachute guidance systems.\nLiterature Review\nIn the late 1990s, the New World Vistas Precision Aerial Delivery (NWV-PAD) research\ninitiative was formed to develop autonomous GN&C systems for unmanned parachutes.3\nThe most notable of these efforts are the Affordable Guided Airdrop System (AGAS),\ndeveloped at the US Army Yuma Proving Ground (YPG),4 and the Precision Guided\nAirdrop System (PGAS) developed at the US Army Natick Soldier Systems Center.5\nA standard G-12 resupply cargo parachute is used by AGAS, a joint development of the\nAir Force Office of Scientific Research (AFOSR), the US Army Natick Soldier Systems\nCenter, The Boeing Company, and Vertigo Inc. The cargo parachute is modified by\nextending its risers with four pneumatic muscle actuators (PMAs), which contract in\nlength when pressurized. The AGAS project proved, through extensive Monte Carlo\nsimulations and flight tests, that a controlled, unmanned parachute released at an altitude\ngreater than 5000 m can softly land on the ground with an accuracy of within 100 m from\nthe target area. For PGAS, the C. S. Draper Laboratory, Inc. developed a government-\nowned software guidance package that allowed parafoils to reach the same accuracy\ngoals as AGAS. A third system, the Small Autonomous Parafoil Landing Experiment\n(ALEX) developed at the DLR in Germany is similar to PGAS.6\nThe problem with the AGAS system is that the PMAs that it uses are bulky, expensive\n\nand require a tank of compressed nitrogen to function. Likewise, the electromechanical\nactuators used by the PGAS system are heavy and expensive. In addition, PGAS uses\nparafoils, which are more expensive than circular parachutes.\nExtensive research and development has thus gone into developing autonomous control\nsystems for unmanned parachutes. The main focus, however, has been on the guidance\nand navigation aspects of the airdrop systems, and not much work has been done to\nfurther actuator technology. Using shape memory alloy wires as actuators for a guided\nparachute system will decrease the overall mass and cost of the system. This alternative\nactuator option would also not require the additional mass of nitrogen to function, and it\nis much simpler to construct.\nTechnical Approach\nFor this experiment, the type of shape memory alloy that will be used is Nitinol. Nitinol\nis an alloy of Nickel and Titanium discovered by William Buhler at the U.S. Naval\nOrdinance Laboratory in 1961.7 The properties of Nitinol are summarized in Appendix\nD. It has since then been used in a wide variety of applications ranging from stress\nsensors to robotic muscles. For our application, Nitinol wires will be woven into the\nsuspension or rigging lines of a scaled-down prototype parachute. A plywood payload\ncontainer will be constructed to hold the various components of the electronic circuits\nresponsible for control and sensing.\nOnce these circuits have been constructed and installed, a series of bench tests will be\ncarried out on the ground to determine if the actuators function as anticipated. These\ntests will include the following:\n1. Testing the Nitinol actuators on a stationary parachute to demonstrate that control\nauthority on the length of the rigging lines is within expected bounds.\n2. Crashworthy testing of the payload container to ensure that it will not be damaged\nupon ground impact.\n3. Repeated cycles of stationary tests to determine the effects of cyclic loading on\nthe actuators and the electronic system.\n\nA final check of the entire system will be performed before heading out to the test facility\nfor each testing session.\nAt the first session, a calibration drop test will be performed at an airdrop facility and\nused as the control of the experiment. Subsequent drops will be performed using the\ncontrol circuit to apply different perturbations to the actuators, and the sensing circuit to\ndetect the responses of the parachute. A Data Acquisition Unit (DAQ) will store the data\ncollected by the sensing circuit onto a flash memory card for later retrieval.\nFinally, in between and after drop tests, data will be uploaded to a personal computer\nwhere it can be analyzed using a spreadsheet program such as Microsoft Excel or a\nnumerical analysis program such as MATLAB. The analysis will consist of determining\nthe trends resulting from the different perturbations applied by the control circuit, and\nevaluating whether or not the prototype system meets the controllability requirements.\nAlthough it may seem that the functionality of the actuators can be determined without\nactually performing drop tests, this is not the case, as the actuators rely on a combination\nof ambient air temperature and payload weight to return them to their initial state.\nLikewise, it is not possible to perform this experiment \"horizontally\" in a wind tunnel for\na number of reasons including:\n1. The gravitational force pulling on the payload is not in a direction that will stretch\nthe SMA wires back to their original state during cooling periods.\n2. The gravitational force does not allow sideways displacement of the parachute to\nbe tested since there is always a bias to one side.\nThe experimental setup for the drop tests will be as shown in Figure 1.\n\nFigure 1: Experimental Setup\nDrop tests will be performed at the parachute drop facility at the US Army Natick Soldier\nSystems Center in Natick, MA. This facility is an enclosed building similar in structure\nto a warehouse, allowing the parachute actuators to be tested without being affected by\nwind conditions. The release mechanism is built into the facility at Natick, and consists\nof a clamp that holds onto the top of the parachute. Using a rope, the release mechanism\ncan be lowered to the ground, whereupon the parachute will be attached. The parachute\nwill then be raised to the ceiling of the facility. Once the parachute is in place, it can be\nreleased by remotely controlling the release mechanism from the ground. The height of\nthe ceiling allows the parachute to be dropped from altitudes of up to 35 ft.\nThree different ways of changing the signal sent to the actuators will be tested. The first\nmethod involves varying the voltage level of the signal, the second varies the width of the\npulses of the signal, and the third varies the total time for which the signal is sent to the\nactuators. All of these independent variables alter the amount of current supplied to the\nactuators and hence the amount of heat. They will be explained in more detail later.\nThe data that will be recorded will consist of three orthogonal linear accelerations and\none angular acceleration. From these values, the velocity and displacement of the\nparachute system will be calculated, and used to evaluate the parachute under the defined\ncontrollability requirements.\n\nExperiment Design\nAs noted in the previous section, a scaled-down parachute will be dropped in a series of\ntrials in order to determine the effects of our independent variables. The canopy of the\nparachute will be circular in shape and made of rip-stop nylon. The canopy will have a\ndiameter of approximately 2.74 m, and therefore an effective area of 5.9 m2 . A parachute\nwith a canopy area of 5.9 m2 will fall at a vertical velocity of approximately 2.7 s\nm when\nits orientation is completely vertical. The following calculations show the origin of the\nnumber for vertical velocity.\nFirst, the expression for drag is equated with the gravitational force:\n1 rv\n2 SCD cosq = mg ,\n(Eq. 1)\nv\nwhere r is the air density, vv is the vertical velocity, S is the surface area of the canopy,\nCD is the drag coefficient, q is the tilt angle of the parachute from the vertical, m is the\nmass of the parachute, and g is the gravitational force. For a dome-shaped parachute, CD\nkg\nis approximately equal to 1.5.8 The standard sea level air density is 225\n.1\n3 . The mass\nm\nestimate for the payload is approximately 4 kg. Setting the variables in equation 1 to the\nfollowing values:\nm\ns\nr = 225\n.1\nkg\nS = 5.9 m2\nCD = 1.5\nq = 0°\nm = 4 kg\ng = 8.9\n2 ,\nm\nm\nand solving, v = 7.2\ns , a reasonable rate of descent for the purposes of the experiment.\nv\nThe parachute will have 18 rigging lines mad of para-cord. Each line will be 100 in or\n2.54 m long. The rigging lines are already connected to the canopy of the parachute, but\nNitinol wires will need to be woven into the rigging lines of the parachute by hand. The\nNitinol wires are strained in the low temperature martensitic phase by the weight of the\npayload. Heating the material above its transition temperature causes it to undergo a\nphase change to a more ordered austentic crystal structure. This has the effect of\n\ndecreasing the length of each wire by about 3%. The thick line in Figure 2 illustrates the\npath taken by the wires during the transition between the hot and cool states. Note that in\nreality, the path from the high temperature phase to the low temperature phase and the\npath from the low temperature phase to the high temperature phase should be slightly\ndifferent due to hysteresis effects; however this is not shown in Figure 2.\nFigure 2: Transition between Martensitic and Austentic States\nA thermal model developed at Mide Technology Corp was used to determine the type of\nNitinol wire to use. This thermal model predicts the power required to resistively heat\nNitinol wires. A set of realistic parameters for the Nitinol wire was determined by trial\nand error using this model. Based on the lengths of the rigging lines and the amount of\ncurrent that the batteries could realistically supply, the Nitinol wire for the actuators\nneeds to have a diameter of 1.2 mm, and martensitic and austentic final temperatures of\n25 °C and 35 °C respectively. Actuators made from this type of wire should be able to\nundergo a heating and cooling cycle in about half a second. A copy of a MATLAB\nimplementation of the thermal model showing the chosen parameters is included in\nAppendix C.\nThe payload, which consists of the control and sensing circuits as well as the power\nsource, will be housed inside a payload container. This payload container will be\n\nconstructed using plywood and screws. Holes will be drilled near the top of its sides so\nthat the risers of the parachute can be attached simply by tying knots. The dimensions of\nthe container will be approximately 0.23 m × 0.23 m × 0.23 m. All the components in the\npayload will be fixed to the container and balanced as well as possible to eliminate\nchanges in mass distribution due to shifting components. To soften the landing, foam\npadding will be attached to the bottom of the payload container.\nThe payload will consist of two 12 V motorcycle batteries that will act as a power source\nfor the Nitinol wire actuators and, passed through a voltage regulator, the electronic\ncomponents in the two main circuits. The motorcycle batteries do not power the cell-\nphone-sized Data Acquisition Unit, which runs on a separate 9 V Ni-Cd battery. Figure 3\nis a block diagram representation of the major components of the payload circuits.\nControl Circuit\nSensing Circuit\nActuators\nFunction Generator\nBattery\nVoltage Regulator\nData Acquisition Unit\nAccelerometers\nUnregulated\nVoltage\nUnregulated Voltage\nRegulated\nVoltage\nAccelerometer Data\nRegulated\nVoltage\nTest Signal\nFigure 3: Payload Block Diagram\nThe Test Function Generator (Figure 4) will be a custom implementation on a Complex\nProgrammable Logic Device (CPLD) chip programmed using Very High Speed\nIntegrated Circuit (VHSIC) Hardware Description Language (VHDL), the Department of\nDefense standard for hardware description. The function generator will also make use of\na potentiometer and relays to switch power among the four different actuators, one for\neach group of rigging lines. Although similar function generators exist as laboratory\nequipment, those devices are heavy, bulky and cannot be powered easily using a battery.\n\nSince the experiment only requires square waveforms and a limited number of different\nvoltage and pulse widths, a custom implementation using a CPLD allows the function\ngenerator to be scaled down to a simpler and smaller device. Customization also allows\nthe timing delay and choice of length of perturbation to be preset in the source code of\nthe function generator. Two sets of switches will allow the selection of which preset\nlevels to use for a particular trial. The potentiometer in this circuit is used to set the\namount of voltage that the actuators receive. The relays indicated in Figure 4 will\nactually be field effect transistors (FETs).\nFigure 4: Schematic of Test Function Generator\nThe sensing circuit is necessary for collecting data. Ideally, a single three-axis\naccelerometer chip would detect three degrees of linear acceleration, and an angular rate\nsensor would detect one degree of angular acceleration. However, because of availability\nand cost, three single-axis linear accelerometers will be used in conjunction with one\nangular rate sensor. To be compatible with the Data Acquisition Unit described below,\nthe accelerometers must output values between -5V and +5V to represent accelerations.\nAll the integrated circuits in the design are commercially available, and hence are much\neasier and cheaper to purchase than to construct. In determining whether a certain\ncomponent should be purchased or constructed, cost and simplicity were the main\ncriteria.\n\nFour channels of an eight-channel Data Acquisition Unit (DAQ) will collect the linear\nand angular acceleration data, and store it to a flash memory card. The DAQ will be able\nto store raw data from several trials before reaching full capacity, eliminating the need to\ntransfer data between trials. However, using a laptop computer with a flash memory card\nreader, data can be analyzed in the field to ensure that the experiment is functioning as\nplanned. The DAQ is approximately the size of a cell phone.\nIndependent and Dependent Variables\nAs stated, the goal of this project is to determine if shape memory alloy actuators can be\nused to control unmanned parachutes. The dependent variables are:\n1. The horizontal velocity per 10 m\ns of vertical drop velocity\n2. The change in path per 10 m\ns of vertical drop velocity\nVelocities and displacements computed from measured accelerations will be used to\ndetermine the two dependent variables, which will be compared with the controllability\nrequirements to determine how much of an effect the actuators have on the parachute.\nThe independent variables are each different methods of applying varying amounts of\ncurrent to the SMAs to cause them to change shape. In order to achieve control the\nparachute, varying amounts of current are applied to SMAs in the form of wires to cause\nthem to change shape. They are:\n1. Voltage, the potential difference applied to the actuators\n2. Pulse width, the length of pulses of current applied to the actuators\n3. Length of perturbation, the total length of time that a perturbation is applied\nFigure 5 is a sketch of a signal that shows the interrelation of these three independent\nvariables.\n\nFigure 5: Independent Variables\nTest Matrix\nIn order to test each of these independent variables separately and together, the following\ntest matrix was developed (Figure 6):\nFigure 6: Graphical Representation of Test Matrix\nTesting along the axes of the matrix allows the contribution of each independent variable\nto be evaluated alone. Testing along diagonals will provide insight into the correlation\nbetween different independent variables. Note that 25% is used as a minimum value\ninstead of 0%, since, if any one of the three independent variables were set to 0%, the\nother two would be 0% as well. This can be best visualized using Figure 5.\n\nData Analysis\nThe raw accelerometer data will be uploaded onto a personal computer. Then, using\nExcel, the data relevant to each drop test will be extracted from each data set. Each data\nset will then be shifted to correct for the bias error of the accelerometers and then\nrescaled to fit conventional measurement units. Finally data sets from different trials will\nbe compared either graphically, or using a numerical analysis package such as MATLAB\nto determine trends in the data. If the data shows that the controllability requirements\nhave been met, then the hypothesis of the project will be proven.\nExperimental Errors\nA number of potential error sources in the experiment have been identified. These are\nsummarized in Table 1 along with a brief description of the problem and how to decrease\nor eliminate the error.\nTable 1: Sources of Error\nSource of Error\nDescription\nMethod of Mitigation\nHysteresis\nShape memory alloys have a\nhysteresis effect that could\npotentially cause the actuators to\nget \"stuck\" in a particular state\nIn order to decrease the effects of\nhysteresis, ample cooling time will be\ngiven between consecutive test runs\nCyclic Loading\nDepending upon the frequency and\nduration of the perturbations, the\nactuators could experience several\nA low frequency of perturbations, and\nperiodic checks of a baseline\ncondition will be used to ensure that\nthousand cycles of heating and\nthe actuators have not deformed over\ncooling throughout the run of the\ntime.\nexperiment\nSensors\nCommercially available\naccelerometers will have a certain\nThese errors will be corrected during\ndata analysis by shifting and rescaling\noffset, and will drift with time\nraw data\nInconsistent\nIf the actuators start functioning\nIn order to ensure that the parachute\nRelease\nbefore the parachute is released or\nhas completely inflated before a test\nfully inflated, errors resulting from\ninitial conditions could occur.\nfunction is sent to the actuators, a\ntime delay will be built into the\nfunction generator based on the initial\ntrial run of the experiment.\n\nSource of Error\nDescription\nMethod of Mitigation\nAmbient Air\nTemperature\nDifferent ambient temperatures\nwould affect how quickly the\nactuators cool and return to their\nlow temperature state.\nAn alloy with a relatively high\ntransition temperature will be used so\nthat changes in ambient temperature\nwill be negligible. Ambient\ntemperature will also be manually\nrecorded by the experimenter and\nused during analysis to verify that\nthese errors are negligible.\nMeasuring\nCurrent\nThe power output of the battery is\nnot exact since the amount of\ncurrent drawn depends on the\nresistance of the actuators. The\nresistance of the actuators will\nchange as they change shape.\nThe actual voltage being sent to the\nactuators will be recorded by the\nDAQ as well. If the raw data\nindicates that there is a significant\nchange in voltage, then the effect will\nbe included in the data analysis.\nSafety Concerns\nA number of safety concerns were raised during the design of this experiment. Since the\nexperiment deals with high temperatures and high current, care must be taken to ensure\nthat no one and nothing is burned or shocked by the experimental apparatus. To this end,\nsufficient time will be given between test runs to allow the apparatus to cool down, and\nall personnel who are handling the equipment will wear protective gloves. The inherent\ndanger of falling objects is also a concern. The safety procedures of the test facility at\nNatick will be followed. Thus, before each drop test, an auditory warning will be issued\nto ensure that all personnel and equipment have been evacuated from the immediate\ntesting area. At the start of each drop, all personnel must have their backs against an\nexterior wall of the facility to ensure that no one will be unexpectedly hit from above.\nPersonnel will also be required to wear hard hats for added protection.\nProposed Budget\nTable 2 shows the proposed budget for this project. Since the US Army Natick Soldier\nSystems Center also has an interest in this research, the Test Facility Rental and\nParachute expenses will be covered by Natick. The Data Acquisition Unit and the\nelectronic components for the Function Generator will be borrowed from Mide\nTechnology Corp., in Medford, MA.\n\nTable 2: Proposed Budget\nItem\nReal World Cost\n16.62X Cost\nTest Facility Rental (8hrs)\n$800\n$0\nParachute\n$100\n$0\nMaterials\nNitinol Wire\n$240\n$240\nPayload Container\n$50\n$50\nData Acquisition Unit\n$650\n$0\nFunction Generator\n$150\n$0\nOther Electronic Components\n$100\n$100\nBatteries\n$80\n$80\nTotal Cost\n$2170\n$470\nDetailed Schedule for 16.622\nThe project schedule is displayed in Table 3. A four-week period was reserved for drop\ntests and data collection since the exact availability of the drop tower at Natick is\ncurrently unknown. During the bench-testing period, data analysis procedures will also\nbe developed. Data reduction and analysis will be an ongoing process that occurs as new\ndata becomes available. The month of February is left to install the Nitinol actuators and\nto construct the payload.\nTable 3: Proposed Schedule\nID\n622 Schedule\nStart\nEnd\nFeb 2003\nMar 2003\nApr 2003\nMay 2003\n2/2\n2/9\n2/16 2/23\n3/2\n3/9\n3/16 3/23 3/30\n4/6\n4/13 4/20 4/27\n5/4 5/11\n1 Install NiTinol Actuators into\nParachute\n2/5/2003\n2/10/2003\n2 Build and Integrate Payload\n2/5/2003\n2/26/2003\n3 Perform Bench Tests\n2/27/2003\n3/12/2003\n4 Perform Drop Tests and\nCollect Data\n3/13/2003\n4/10/2003\n5 Reduce Data and Analyse\n3/20/2003\n4/29/2003\n6 Progress Report Meeting\n2/11/2003\n2/11/2003\n7 Oral Progress Report\n3/4/2003\n3/4/2003\n8 Progress Report Meeting\n4/1/2003\n4/1/2003\n9 Last Day to Take Data\n4/18/2003\n4/18/2003\n10 Final Oral Presentation\n4/29/2003\n4/29/2003\n11 Final Written Report\n5/13/2003\n5/13/2003\n\nFacilities, staff support and space needed\nWorkspace will be needed to assemble and construct the various components of the\npayload. Construction of the payload container and installation of the Nitinol actuators\nshould not require any special equipment. Thus, a general laboratory facility such as the\nGelb Laboratory should suffice as a workspace. Drop tests will be performed at the US\nArmy Natick Soldier Systems Center, and support staff will be provided by Natick\nfacility to assist in running the trials. The testing facility at Natick was described earlier\nin the Technical Approach section. Additional equipment that has not been previously\nmentioned includes a camera to record the progress of the project.\nConclusion\nGuided parachute systems are an exciting new application for existing technology that is\ncurrently being developed through major research efforts. This proposal outlines an\nexperiment to test a new type of actuator using Nitinol, a shape memory alloy. If it can\nbe shown that shape memory alloys can be effective as actuators for unmanned\nparachutes, a new generation of lighter and cheaper actuators will become a reality.\n\nAcknowledgements\n16.62X Faculty and Staff\nDr. Marthinus van Schoor\nList of references\n1 \"Summary Report: New World Vistas, Air and Space Power for the 21st Century,\" USAF Science\nAdvisory Board, 1997. [http://www.fas.org/spp/military/docops/usaf/vistas/vistas.htm. Accessed\n11/26/2002.]\n2 \"Smart Materials / Motorless Actuators,\" Mide Technology Corp., Medford , MA, 2000.\n[http://www.mide.com/expertise/materials.html. Accessed 11/26/2002.]\n3 Hattis, P. D., Fill, T. J., Rubenstein, D. S., Wright, R. P., and Benney, R. J., \"An Advanced On-Board\nAirdrop Planner to Facilitate Precision Payload Delivery,\" AIAA Modeling and Simulation Technologies\nConference, Denver, CO, Aug. 14-17, 2000; also AIAA Paper 2000-4307.\n4 Brown, G., Haggard, R., Almassy, R., Benney, R., and Dellicker, S., \"The Affordable Guided Airdrop\nSystem (AGAS),\" 15th CEAS/AIAA Aerodynamic Decelerator Systems Technology Conference, Toulouse,\nFrance, June 8-11 1999, Collection of Technical Papers, American Institute of Aeronautics and\nAstronautics, 1999, pp. 316-325; also AIAA Paper 99-1742.\n5 Hattis, P. D., Appleby, B. D., Fill, T. J., and Benney, R., \"Precision Guided Airdrop System Flight Test\nResults,\" 14th AIAA Aerodynamic Decelerator Systems Technology Conference, San Francisco, CA, June\n3-5 1997, Collection of Technical Papers, American Institute of Aeronautics and Astronautics, 1997, pp.\n158-168; also AIAA Paper 97-1468.\n6 Thomas, J., \"Aerodynamic Model Identification and GNC Design for the Parafoil-Load System ALEX,\"\n16th AIAA Aerodynamic Decelerator Systems Technology Conference, Boston, MA, May 21-24 2001,\nCollection of Technical Papers, American Institute of Aeronautics and Astronautics, 2001; also AIAA\nPaper 2001-2015.\n7 \"The History of Nitinol,\" Images SI Inc., Staten Island, NY.\n[http://www.imagesco.com/articles/nitinol/02.html. Accessed 10/3/02.]\n8 Anderson, J., \"Descent Rate,\" Washington High Power Rocketry, 2000.\n[http://www.washingtonhighpower.com/algorithm.htm. Accessed 11/13/02.]\n\nAppendix A: Detailed Parts List\nPower Supply and Regulation\n2 12-Volt Panasonic LC-R123R4P Motorcycle Batteries\n9-Volt Ni-Cd Battery (for Data Acquisition Unit)\nLM 7805 5 V Positive Voltage Regulator\nElectronic Components and Sensors\nAltera MAX 7000S Complex Programmable Logic Device (CPLD)\n1.843 MHz Crystal Oscillator\n3 Analog Devices ADXL105AQC Single Axis Accelerometers\nAnalog Devices ADXRS300ABG Angular Rate Sensor\nCapacitors, Potentiometers, Resistors, Transistors\nSolderless Breadboard\nData Storage Equipment\nEight-Channel Data Acquisition Unit (DAQ)\nFlash Memory Card for DAQ\nCamera\nData Analysis Equipment\nPersonal Computer\nLaptop Computer with flash memory card reader for quick analysis in the field\nMaterials\nParachute (Canopy and Rigging Lines: see specifications in Appendix B)\nNitinol Wire\nPlywood for payload container\nFasteners and other hardware for payload container\nFoam Padding\nManufacturing Facilities\nGelb Laboratory\nDevelopment Software\nAltera MAX+PLUS(r) II BASELINE design software\nAnalysis Software\nMicrosoft Excel Spreadsheet package\nMATLAB Numerical Analysis package\n\nAppendix B: Parachute Specifications\nCanopy\nCanopy shape: circular\nCanopy diameter: 9 ft = 2.74 m\nSpill hole diameter: 15 in = 0.38 m\nCanopy material: rip-stop nylon\nRigging Lines\nNumber of rigging or suspension lines: 18\nLength of each line: 100 in = 2.54 m\nSuspension line material: para-cord\nReferences for Parachute Specifications\nArnott, B., \"Rocketry: Useful Stuff: Mil Spec 9' Chutes,\" www.bobarnott.com: Rocketry\n- The UK's Premier High Power Rocketry Homepage, 2002.\n[http://www.bobarnott.com/rocketry/stuff/chutes/index.shtml. Accessed 12/10/02.]\n\"Parachutes,\" Federal Army and Navy Surplus, Inc., Seattle, WA, 2002.\n[http://www.gr8gear.com/?cat=62. Accessed 12/10/02.]\n\nAppendix C: Thermal Model\nThe following MATLAB file contains the source code for the thermal model from Mide\nTechnology Corp. that was used to determine the power required to resistively heat the\nNitinol wires, as well as the number and type of wires.\n% ACSMART Thermal Model\nclear all\nVelocity_fluid=1;\nfreq=0.5;\nNpts=100;\nT_fluid=20+273;\nNumber_of_wires=36;\nTmartensite=25+273; % Martensite final temperature\nTaustenite=35+273;\n% Austenite final temperature\nTdiff=(Taustenite - Tmartensite)/2;\n% Wire Diameter = 1.5, 2.0, 3.0 and 5 (3.81E-05, 5.08E-05, 7.62E-05, 12.7E-05)\nDiameter_Wire=12.0E-04;\n% Assume conservatively 100 MPa as the maximum allowable stress\nForce = Number_of_wires*(pi/4)*Diameter_Wire*Diameter_Wire*100E6;\nfprintf('\\n\\n Number of Wires = %d, Force produced = %5.2f N \\n',Number_of_wires,Force)\nT_Init_Wire=Tmartensite+10; % Start with wire at martensite temperature\nT_film=(T_fluid+T_Init_Wire)/2;\nLength_Wire=2.54;\nk_wire=1.80E+01;\ncp_wire=837;\nrho_wire=6450;\nrho_air=1.2256;\nArea_Wire=(0.25*pi*Diameter_Wire^2);\nVol_Wire=Number_of_wires*(Area_Wire*Length_Wire);\nSurface_Area_Wire=Number_of_wires*pi*Diameter_Wire*Length_Wire;\nk_air=0.024;\ncp_air=1007;\nT_lookup=[290.00 328.65\n363.15];\n% Lookup Tables\nDens_air_lookup=[1.1887 1.0661\n0.9624];\nDyn_Vis_air_lookup=[1.817E-05 1.981E-05 2.140E-05];\nSpec_Heat_air_lookup=[1006.9 1008.1 1010.3];\nTherm_Conduct_air_lookup=[2.583E-02 2.842E-02 3.100E-02];\nTherm_Dif_air_lookup=[2.173E-05 2.674E-05 3.211E-05];\nrho_air=interp1(T_lookup,Dens_air_lookup,T_fluid);\nmhu_air=interp1(T_lookup,Dyn_Vis_air_lookup,T_fluid);\nmhu_air_film=interp1(T_lookup,Dyn_Vis_air_lookup,T_film);\nk_air=interp1(T_lookup,Therm_Conduct_air_lookup,T_fluid);\nk_air_film=interp1(T_lookup,Therm_Conduct_air_lookup,T_film);\ncp_air=interp1(T_lookup,Spec_Heat_air_lookup,T_fluid);\ncp_air_film=interp1(T_lookup,Spec_Heat_air_lookup,T_film);\na_air_film=interp1(T_lookup,Therm_Dif_air_lookup,T_film);\nRey_lookup=[0.0001\n41 1000 1001 2E5 (2.E5+1)\n1E8];\nC_lookup=[\n0.75 0.75 0.51 0.51 0.26 0.26\n0.076 0.076];\nm_lookup=[\n0.4 0.4 0.5 0.5 0.6 0.6\n0.7\n0.7];\nRe=rho_air*Velocity_fluid*Diameter_Wire/mhu_air;\nPr=cp_air*mhu_air/k_air;\nPrs=cp_air_film*mhu_air_film/k_air_film;\n\nn=0.37;\nif(Pr>=10);n=0.36;end\nC = INTERP1(Rey_lookup,C_lookup,Re);\nm = INTERP1(Rey_lookup,m_lookup,Re);\nNuD=C*(Re^m)*(Pr^n)*(Pr/Prs)^0.25;\n% Convection heat transfer coefficient\nh_air_film=k_air_film*NuD/Diameter_Wire;\n% Thermal diffusivity\nalpha_air_film=k_air/(rho_air*cp_air);\n% The Biot number\nBi_air_film=h_air_film*(Diameter_Wire/2)/k_wire;\n% Now assume that the temperature must be sinusoidally cycled\ndelt=1/(freq*Npts);\nTmax=10/freq;\nTime=[0:delt:Tmax];\n[mm,nn]=size(Time);\nTcommand(1) = T_Init_Wire;\nT_wire(1)=T_Init_Wire;\nPower(1)=0.0;\nfor i=2:nn\nTcommand(i)=T_Init_Wire + Tdiff*sin(freq*2*pi*Time(i));\nTfilm = (T_fluid+T_wire(i-1))/2;\n% Calculate convection heat transfer coefficient\nk_air_film=interp1(T_lookup,Therm_Conduct_air_lookup,T_film);\ncp_air_film=interp1(T_lookup,Spec_Heat_air_lookup,T_film);\nmhu_air_film=interp1(T_lookup,Dyn_Vis_air_lookup,T_film);\nPrs=cp_air_film*mhu_air_film/k_air_film;\nNuD=C*(Re^m)*(Pr^n)*(Pr/Prs)^0.25;\n% Convection heat transfer coefficient\nh_air_film=k_air_film*NuD/Diameter_Wire;\ndTdt = (Tcommand(i) - Tcommand(i-1))/delt;\n%\nPower(i)=max(0,h_air_film*Surface_Area_Wire*(T_wire(i-1) - T_fluid) +\nrho_wire*cp_wire*Vol_Wire*dTdt);\nPower(i)=max(0,h_air_film*Surface_Area_Wire*(Tcommand(i) - T_fluid) +\nrho_wire*cp_wire*Vol_Wire*dTdt);\nif(Tcommand(i) < T_wire(i-1));\nConst = delt*h_air_film*Surface_Area_Wire/(rho_wire*cp_wire*Vol_Wire);\nT_wire(i) = T_wire(i-1) - Const*(T_wire(i-1) - T_fluid);\nelse\nif(Power(i) == 0.0)\nConst = delt*h_air_film*Surface_Area_Wire/(rho_wire*cp_wire*Vol_Wire);\nT_wire(i) = T_wire(i-1) - Const*(T_wire(i-1) - T_fluid);\nelse\nT_wire(i)=0.5*(Tcommand(i) + T_wire(i-1));\nend\nend\nend\nPower(1)=Power(2);\ntit=sprintf('Flow Velocity=%5.2f m/s, T_a=%5.2f C, N_w=%4.0d, D_w=%5.2f\nmils',Velocity_fluid,T_fluid-273,Number_of_wires,Diameter_Wire*1000/.0254);\nVelocity_fluid=100;\n\nfreq=100;\nNpts=50;\nT_fluid=21+273;\nNumber_of_wires=72;\nfigure(1)\nsubplot(211)\nplot(Time,T_wire-273,Time,Tcommand-273);xlabel('Time (seconds)');ylabel('T_W & T_C (C)')\ntitle(tit)\nsubplot(212)\nplot(Time,Power);xlabel('Time (seconds)');ylabel('Input Power (W)')\nfigure(1)\nMatlab code courtesy of Dr. Marthinus Van Schoor.\n\nAppendix D: Nitinol Properties\nTable 4: Properties of Nitinol\nPhysical\nProperty\nMinimum Bend Radius [mm]\nCross-Sectional Area [mm2]\n12.50 0.049\nWire Diameter\n250 μm\n375μm\n18.8\n0.110\nElectrical\nRecommended Current [mA]\nRecommended Power [W/m]\n1,000\n20.0\n2,750\n8.00\nStrength\nMax. Force @ 600 Mpa [N]\nRec. Force @ 190 Mpa [N]\n28.7\n9.11\n61.9\n19.6\nSpeed\nMax. Contraction Speed [sec]\nRelaxation Speed (Ambient Air) [sec]\nTypical Cycle Rate [cycles/min]\n0.2\n5.5\n0.5\n10.0\nThermal/\nMaterial\nHeat Capacity [cal/g°C]\nDensity[g/cc]\nMaximum Deformation Ratio [%]\nRecommended Deformation [%]\n0.077\n6.45\n3-5\nResistivity [mWcm]\nYoung's Modulus [Gpa]\nThermal Conductivity [W/cm°C]\nLow Temp\n0.08\nHigh Temp\n0.18\nSource: \"Shape Memory Alloys,\" Mide Technology Corp., Medford, MA, 2001.\n[http://www.mide.com/expertise/matsys/shamemall.html. Accessed 12/10/2002.]"
    },
    {
      "category": "Resource",
      "title": "wongbria1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-621-experimental-projects-i-spring-2003/ac2c4ed7b783acd1454ccc9748bd1be1_wongbria1.pdf",
      "content": "Steerable-Parachute Design and Testing\nStatement of Project\n16.621\nFall 2002\nAuthor: Brian Wong\nAdvisor: Dr. Marthinus van Schoor\nPartner: Benjamin Brooks\nOctober 3, 2002\n\nIntroduction\nIn 1997, the U.S. Air Force Science Advisory board identified a need to improve\nthe accuracy of airdrops in a report titled \"Summary Report: New World Vistas, Air and\nSpace Power for the 21st Century.\"1 Cargo parachutes currently being used by the\nmilitary and humanitarian organizations to deliver payloads such as food, ammunition\nand equipment are essentially 'dumb.' Once a parachute is dropped from an aircraft,\nthere is no way to control its flight path, which is highly dependent on meteorological\nconditions. Thus one method for improving the accuracy of airdrops involves adding\ncontrol systems to unmanned parachutes in order to improve control over their flight\npaths.\nThe potential value of developing control systems, for use with unmanned cargo\nparachutes in order to improve accuracy of cargo drops, is illustrated by the fact that the\nU.S. Army, the U.S. Air Force, and major industry leaders such as The Boeing Company\nand Vertigo Incorporated have teamed up to develop a parachute control system known\nas the Affordable Guided Airdrop System (AGAS).2\nAGAS uses a commercially available GPS receiver and a magnetic compass as\nnavigational sensors, and pneumatic muscle actuators consisting of braided-fiber tubes to\npull on the parachute's rigging lines in order to displace it. Before AGAS, attempts to\nimprove unmanned parachute control focused on developing more expensive parafoil\nsystems.\nSince their discovery by William Beuhler at the U.S. Naval Ordinance Laboratory\nin 1961,3 nickel titanium shape memory alloys (NiTinol) have been employed in a wide\nvariety of applications from decreasing vibrations in turbine fan blades to use as artificial\nmuscle fibers. However, one potential application that has yet to be explored involves\nusing the properties of NiTinol to control parachutes. Pulse width modulation can be\n\nused to pass varying amounts of electrical current through NiTinol wires in order to\nchange their lengths.4 Therefore we are proposing to attempt to use electrical current-\nheated NiTinol wires to develop a parachute control system similar to AGAS.\nHypothesis\nAn unmanned cargo parachute with rigging lines made of NiTinol shape memory\nalloys can be steered by changing the lengths of those lines.\nObjective\nThe main objective is to analytically and experimentally assess what degree of\ncontrol can be achieved by shortening the shape-memory alloy rigging lines of a\nparachute.\nStatement of Work\nThe following tasks shall be performed as part of 16.621\n?? Develop simple models or use existing ones to define degrees of parachute\ncontrollability based on it being able to perform certain maneuvers at particular\nspeeds or within a particular time period\n?? Perform an order of magnitude analysis in order to size a scale parachute that can be\ndropped under controlled conditions (e.g. inside Johnson Athletic Center)\n?? Design experimental procedures and determine the specific equipment needed\nThe following tasks shall be performed as part of 16.622\n?? Construct the scale parachute\n\n?? Equip the parachute with a simple control system, a car or motorcycle battery and\nrelays to handle power, an accelerometer, a camera, and other equipment selected\nduring 16.621\n?? Perform first set of drop tests without using control system and record data as the\n'control' of the experiment\n?? Perform subsequent tests to determine the controllability of the scale parachute by\nvarying different parameters one at a time\n?? Analyze the resulting data and record findings\n?? Throw a party Caltech-style to celebrate the successful outcome of the project\nSuccess Criteria\nThe project shall be regarded as a success if we can assess to what degree an\nunmanned cargo parachute with NiTinol shape memory alloy rigging lines can be steered\nby changing the lengths of those lines.\nConclusion\nBy drawing from the recently acquired knowledge on unmanned parachute\ncontrol from AGAS and the many successes of NiTinol applications in the past, we hope\nto develop a system to control unmanned cargo parachutes. This system would be similar\nto AGAS, but would provide an alternate means of meeting the same goal by using\ndifferent actuators. The potential advantages of producing this cargo parachute control\nsystem include increases in airdrop accuracy, which translates to lower amounts of cargo\ndamage or loss.\n\nReferences\n1 \"Summary Report: New World Vistas, Air and Space Power for the 21st Century,\"\nUSAF Science Advisory Board, 1997.\n2 Dellicker, S., Benney, R., and Brown, G., \"Guidance and Control for Flat-Circular\nParachutes,\" Journal of Aircraft, Vol. 38, No. 5, 2001, pp. 809-817.\n3 \"The History of Nitinol,\" Images SI Inc., Staten Island, NY.\n[http://www.imagesco.com/articles/nitinol/02.html. Accessed 10/3/02.]\n4 \"Nitinol Technical Information,\" Shape Memory Applications, Inc., San Jose, CA.\n[http://www.sma-inc.com/information.html. Accessed 10/2/02.]"
    }
  ]
}