{
  "course_name": "Experimental Molecular Biology: Biotechnology II",
  "course_description": "The course applies molecular biology and reverse genetics approaches to the study of apoptosis, or programmed cell death (PCD), in Drosophila cells. RNA interference (RNAi), or double stranded RNA-mediated gene silencing, will be used to inhibit expression of candidate apoptosis-related genes in cultured Drosophila cells. Teams of 2 or 3 students will design and carry out experiments to address questions about the genes involved in the regulation and execution of PCD in this system. Some projects involve the use of DNA damaging agents or other cytotoxic chemicals or drugs to help understand the pathways that control a cell’s decision to undergo apoptosis. Instruction and practice in written and oral communication are provided.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Biotechnology",
    "Science",
    "Biology",
    "Molecular Biology",
    "Engineering",
    "Biological Engineering",
    "Biotechnology",
    "Science",
    "Biology",
    "Molecular Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 5 sessions / week, 4 hours / session\n\nAbout this Course\n\nThe course applies molecular biology and reverse genetics approaches to the study of apoptosis, or programmed cell death (PCD), in\nDrosophila\ncells.\n\nRNAinterference (RNAi), or double stranded RNA-mediated gene silencing, will be used to inhibit expression of candidate apoptosis-related genes in cultured\nDrosophila\ncells. Teams of 2 or 3 students will design and carry out experiments to address questions about the genes involved in the regulation and execution of PCD in this system.\n\nTexts and Materials\n\nThere are no required text books. Relevant papers, protocols and other information will be provided in course binders or made available on the course web site.\n\nStructure of Class\n\nStudents break into teams of 2 or 3. For the first three weeks, all teams will work on the Common Project (P0), which involves inducing cell death in S2 cells by depleting the mRNA of the DIAP1 gene, which represses apoptosis.\n\nDuring this time, each team chooses a Team Project from the list provided or devises their own Team Project. Each team then researches this project and writes up a proposal - incorporating suggestions from the writing instructor - describing a set of experiments that will be done to address a question about the mechanism or regulation of apoptosis. This proposal is due at the end of session 14.\n\nThe teams then revise these proposals in response to comments from the instructors. The rest of the class is devoted to carrying out the experiments described in the proposals, and writing up the results. Teams present their results at weekly lab meetings, held every Friday starting in session 15.\n\nAssignments\n\nThere are three written assignments:\n\nThe Team Project Proposal\n\nThe Minireview Paper\n\nThe Final Paper\n\nWritten assignments must be turned in\non the\n\ndue date at the start of the class\nto be eligible for full credit. Assignments turned in up to three days after the due date are eligible for half credit (except the final paper).\n\nNo assignments will be accepted after this time. No Exceptions.\n\nLab books will be reviewed weekly by the TAs. Lab performance and lab meeting presentations will be evaluated by the instructors. There are no exams.\n\nGrading\n\nGrades will be assigned based on the following:\n\nACTIVITIES\n\nPERCENTAGES\n\nTeam Project Proposal\n\n20%\n\nLab Presentations\n\n10%\n\nLab Performance\n\n10%\n\nLab Notebook\n\n10%\n\nMinireview\n\n10%\n\nFinal Paper\n\n40%\n\nIt is important to emphasize that the grade is based mostly on effort and quality of work, rather than on whether or not all of the experiments \"worked\" or yielded interesting results.\n\nTeam members are encouraged to work together on planning the project proposal, lab presentations, intro/methods and final paper, but all written assignments (and oral presentations) must be done individually.\n\nIntellectual Honesty\n\nWe hope and trust that academic misconduct will not occur during this course. We nevertheless want to emphasize that we will be rigorous in our enforcement of Institute rules. It is the policy of the Biology Department to keep a record of all cases of academic misconduct and to forward cases to the Dean of Undergraduate and Student Affairs.",
  "files": [
    {
      "category": "Resource",
      "title": "finalpaper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/65975e1e03a02f1402780db67a9d1682_finalpaper.pdf",
      "content": "7.16 Instructions for Writing Final Paper\nDue date: Thursday, May 12 @ 1:00 PM\nTurn in THREE copies of the Final Paper\nThe content and style of your final paper should be similar to those of the primary research\npapers listed in the Reference List in your course binder. Some good examples are:\n- Li X, Scuderi A, Letsou A, Virshup DM, \"B56-associated protein phosphatase 2A is\nrequired for survival and protects from apoptosis in Drosophila melanogaster,\" Mol Cell\nBiol. 22: 3674-84 (2002).\n- Silverstein AM, Barrow CA, Davis AJ, Mumby MC, \"Actions of PP2A on the MAP\nkinase pathway and apoptosis are mediated by distinct regulatory subunits,\" Proc Natl\nAcad Sci USA. 99: 4221-6 (2002).\nThe basic elements of a primary research paper and length guidelines for this exercise are:\n1) Title. No more than 100 characters including spaces. List authors below title - your name,\nfollowed by your lab partner's name.\n2) Abstract. No more than 150 words.\n3) Introduction. Suggested length: ~3-5 paragraphs.\n4) Methods. Suggested length ~4-5 short paragraphs.\n5) Results. Suggested length: ~5-6 paragraphs. Include ~2-3 display items (figures and/or\ntables). Each must have a legend.\n6) Discussion. Suggested length: ~3-4 paragraphs. May include 1 figure (with legend).\n7) Acknowledgements. Suggested length: ~1-2 sentences.\n8) References. Suggested number: ~15-20.\nPlease submit 3 complete hardcopies of your final paper, including high quality printouts of\nfigures. Your paper should be double-spaced with page numbers, 12-point font, and 1\" or 1.25\"\nmargins.\n\nTips for writing a good paper\nTitle\n- Should be clear and descriptive but not too long. Ideally should state main result.\nIntroduction\n- In about 3-5 paragraphs, an introduction: 1) introduces the problem and motivates why it is\ninteresting; 2) summarizes what's known about problem, citing prior work; and 3) summarizes\nyour approach.\n- Ask yourself: Why is this problem important? Why is it timely? How does your approach to\nthe problem differ from other approaches?\n- You may provide a brief preview of your results at the end of the introduction - but no more\nthan a preview.\n- Do not use subheadings in the introduction.\nMethods\n- Explain your methods in enough detail for a researcher in the same field to replicate the\nexperiments, and for a researcher in a related field to understand the essence of the methods.\n- Don't include results (or discussion) in methods. Only methods. However, it is OK to briefly\nindicate the rationale for a procedure if it makes the methods more readable.\n- Use bold subheadings (on separate lines) to break up the methods. This organizes the methods\nsection by topic and allows readers interested only in some aspects of the methods to quickly\nfind what they're looking for.\n- Each subheading should be followed by one or a few paragraphs. Each paragraph should have\na topic sentence and should be written clearly and concisely.\n- Avoid repetition. Use 'see above' when appropriate, and cite published methods (including\nprotocols in your course binder) when appropriate.\nResults\n- Organize your results in a logically coherent order. The order does NOT have to be the order\nin which the experiments were done, but rather the one which makes the most coherent 'story'.\nIt is not necessary to describe every experiment that was done during the semester. Focus on\nyour best experiments. But it is OK to mention experiments that didn't work briefly and to\ncomment on why they may not have worked.\n- Figures should be numbered in the order they are cited in the text. Insert figures into the\ndocument near where they are discussed.\n- Each figure or table MUST have a legend.\nDiscussion\n- Discuss your results, putting them in the context of what was known before your study.\n- Highlight any agreements or disagreements between your data and those of other published\nstudies. Comment on possible reasons for disagreements.\n- Discuss open questions raised by your findings and any general lessons or conclusions that can\nbe drawn.\n\nReferences\nCite relevant references for statements of known results, hypotheses, methods, or background\ninformation. Cite them in the text like this:\n\"In response to death stimuli, ubiquitination of DIAP1 is enhanced by interaction with Reaper\n(Martin, 2002; Palaga & Osborne, 2002).\"\nFor references with one author, cite as (Smith, 20XX), where 20XX is the year of publication.\nFor references with two authors, cite as (Smith & Jones, 20XX), and for references with three or\nmore authors, cite as Smith et al., 20XX (Latin for 'and others'). Include an alphabetical list at\nthe end (ordered by last name of first author), in this format:\nMartin, S. J. (2002). Destabilizing influences in apoptosis: sowing the seeds of IAP destruction.\nCell 109, 793-796.\nPalaga, T. and Osborne, B. (2002). The 3D's of apoptosis: death, degradation and DIAPs.\nNature Cell Biol. 4, E149-E151.\nNote that the journal name is italicized and the volume number is in bold. In the reference list,\ninclude all authors, even if there are more than two. Make sure that all references cited in the\ntext appear in the reference list at the end and vice versa.\nFinal Comment\nRemember, this is a research paper, not a grant proposal or grant progress report. Specific aims\nare not relevant any more and should not be mentioned, although of course you will discuss the\noverall goal of your study in the introduction."
    },
    {
      "category": "Resource",
      "title": "minireview.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/2bf339e857596c037627e6133ca62600_minireview.pdf",
      "content": "7.16 Minireview Instructions\nDue Date: Friday, March 18, 2005 at beginning of class.\nA minireview provides a concise, focused review of the literature related to a question of\ncurrent interest in the scientific community. Often, reading a well-written minireview is\nthe fastest way to get up to speed on a particular topic that is making news. Partly\nbecause they are short and usually relatively easy reading, minireviews are often very\nwidely read. Sometimes minireviews also raise questions or suggest new hypotheses or\nattempt to reconcile conflicting data that has recently been published. Writing a\nminireview is a good way to organize your thoughts and summarize the knowledge you\nhave obtained about a particular topic that you have acquired from reading the literature\nand thinking and discussing with others and is a good exercise in scientific writing.\nThe content and style of your minireview should be similar to those of the minireviews\nincluded in your course binders. The Martin 2002 and Di Cristofano and Pandolfi 2000\nCell minireviews are good examples of the minireview style. Your minireview will be\nsomewhat shorter than these, but should follow a similar organization. Choose a topic of\ninterest to you that is related to your Team Project Proposal. For example, \"The protein\nphosphatases of Drosophila melanogaster and their potential roles in apoptosis\". You\nmay write your minireview on the same or a different topic from your lab partner. Either\nway, you are encouraged to discuss the topic of your minireview with others. But you\nmust do the writing on your own of course.\nYour minireview should have the following orgainization:\n- Title. Creativity in titles is fine for minireviews, as long as the scientific topic is clear\nfrom the title - see the Martin 2002, Palaga & Osborne, 2002 and Di Cristofano and\nPandolfi 2000 papers for examples of good titles. Shorter is usually better.\n- Author Your name.\n- Brief Abstract (Boldface. No more than 2 sentences.) Summarize what the minireview\nis about as concisely as possible (see Martin 2002 for an example).\n- Introductory paragraph Provide necessary background/context for the reader.\nShould indicate or hint at why the chosen topic is important and timely.\n- Body of the minireview Divide up the minireview into ~3-5 topics/sections, each with\nits own subheading (in bold). Each subheading should be followed by 1-3 paragraphs.\nIdeally each paragraph should have a topic sentence and should be written clearly but\nconcisely. The last section often relates to key open questions in the field (e.g., Di\nCristofano/Pandolfi's section titled \"Outstanding Questions\").\n- Figure(s), with legend(s) Incorporate into the text at an appropriate place.\n\n- References Cite references in the text using the same formatting guidelines as for the\nTeam Project Proposals, e.g., Smith (2000), Smith & Jones (2001), for papers with one or\ntwo authors and Smith et al. (2002) for papers with three or more authors. Provide a\nreference list at the end, sorted alphabetically by last name of first author. Use the same\nformat as for the Team Project Proposals (remember to list all authors of each paper in\nthe reference list and to italicize the journal name, etc. - see below for details)\nAdditional guidelines. Submit two hardcopies of your minireview, typed, double-\nspaced, with pages numbered, using 12 point font and 1\" or 1.25\" margins. Be sure to\ninclude a title and list your name at the top of the first page. The suggested length for the\nminireview is approximately 4-5 pages (excluding Figure(s) and References), although it\nmay be slightly longer if needed. Include a reference list at the end - approximately 10-\n15 references suggested. Include one original Figure (may be adapted/based on a figure\nfrom a published work or from your Team Project Proposal, but must contain some new\ncontent or presentation). Additional display items (figures or tables) may be included if\ndesired. All display items (figures and tables) must have a title (first line of legend, may\nbe a sentence fragment) and a legend explaining the figure (use complete sentences).\nLook at some legends in published papers for examples of the very concise style that is\nused in scientific legends. If a figure is adapted from/based on a published figure, a\nstatement such as 'adapted from Smith (2000)' or 'based on data from Smith (2000)'\nmust appear in the legend.\nIn writing your minireview, follow the instructions provided by the writing instructor,\nand consider the following guidelines.\n- Choose the topics carefully and organize them in a logical order.\n- Cite the literature whenever appropriate.\n- Avoid repetition. Use 'see above' /'see below' if necessary (but try to avoid).\nReference Formatting\nCite relevant references for statements of known results, hypotheses, methods, or\nbackground information. Cite them in the text like this:\n\"In response to death stimuli, ubiquitination of DIAP1 is enhanced by interaction with\nReaper (Martin, 2002; Palaga & Osborne, 2002).\"\nFor references with one author, cite as (Smith, 20XX), where 20XX is the year of\npublication. For references with two authors, cite as (Smith & Jones, 20XX), and for\nreferences with three or more authors, cite as Smith et al., 20XX (Latin for 'and others').\nInclude an alphabetical list at the end (ordered by last name of first author), in this\nformat:\nMartin, S. J. (2002). Destabilizing influences in apoptosis: sowing the seeds of IAP\ndestruction. Cell 109, 793-796.\n\nPalaga, T. and Osborne, B. (2002). The 3D's of apoptosis: death, degradation and\nDIAPs. Nature Cell Biol. 4, E149-E151.\nNote that the journal name is italicized and the volume number is in bold. In the\nreference list, include all authors, even if there are more than two. Make sure that all\nreferences cited in the text appear in the reference list at the end and vice versa."
    },
    {
      "category": "Resource",
      "title": "proposal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/91adb303e2c4f0158f9e21531b28914a_proposal.pdf",
      "content": "7.16 Proposal Instructions\nTeam Project Proposals should be approximately 3-5 pages in length (double-spaced, 12 point\nfont, 1\" or 1.25\" margins, pages numbered, excluding references) and should have 5 sections: 1)\nTitle; 2) Specific Aims (SA); 3) Background & Significance (B&S); 4) Research Design &\nMethods (RD&M); and 5) References. Include a title at the top of the first page, and list the\nteam members who will be working on the project, with the author's name first. A\ndiagram/figure may be included. The style, content and level of detail expected are illustrated\nwith sample text below. The example given refers to a hypothetical project lab whose goal is to\nstudy genes that regulate the shape of human fibroblast cells using over-expression techniques.\nThe title should describe what the project is about but not be too long, e.g.,\n\"An Over-expression Screen for Genes that Control Cell Shape in Cultured Human Fibroblasts\"\nThe specific aims should be numbered and should be concise and specific, e.g.,\n\"SA 1. To identify genes whose products make cells rounder.\nSA 2. To identify genes whose products make cells longer and thinner.\"\nThe B&S section should provide background that is directly relevant to the question that is being\nasked and an indication of why it is important. Ideally, it should be intelligible and interesting to\nany biologist. Here's an example:\n\"The regulation of cell shape is critical in a number of developmental processes, such as\nblah, blah and blah, and misregulation of cell shape can lead to diseases such as blah and blah\n(refs). An increased understanding of the genes involved in cell shape control could lead to\ndevelopment of improved drugs that inhibit or activate these genes and thereby restore proper\ncell shape in individuals with blah syndrome. Genes of the \"rotund\" family have been\nimplicated in making cells rounder in a number of systems (refs). This gene family is\ncharacterized by a conserved N-terminal domain (the \"rotund\" domain), which interacts with\nactin, and a variable C-terminal domain. Rotund family members are thought to regulate cell\nshape by affecting the polymerization and branching of actin microfilaments. A search of the\nliterature identified 6 different rotund family genes: rotund-1, rotund-2, rotund-3, pudgy,\nchubby, and beachball. Blah blah blah ...\nGenes of the \"twiggy\" family tend to oppose the activity of rotund family members,\neither by binding and sequestering rotund family proteins, or by interacting directly with actin\nmicrofilaments to inhibit branch formation. Blah blah blah ... \"\nThe RD&M section should contain a complete but concise description of the experiments that\nwill be done and the techniques that will be used. The use of subheadings to organize this\nsection is encouraged. In describing techniques, include only relevant details, e.g., variables that\nyou will alter in your experiments, not those which are present in the protocols in your binders.\nFor example:\n\nCloning and Transfection Experiments\n\"We will clone the cDNAs of the 6 rotund family genes identified through literature\nsearches (rotund-1,-2,-3, pudgy, chubby and beachball) into the XYZ vector, downstream of a\nstrong, constitutive cytomegalovirus (CMV) promoter and terminating with the beta-globin\npolyadenylation signal sequence. These constructs will be transfected into cultured fibroblasts,\nand cell morphology will be monitored using light microscopy and digital image processing.\nBriefly, captured images of cells will be analyzed using the CellGeometryTM software package,\nwhich calculates the ratio of cell circumference to cell diameter as a measure of \"roundness\".\nThe rotund-1 construct provided by the course instructors will be used as a positive control,\nsince over-expression of this gene is known to cause rounding-up of cultured human fibroblasts\n(ref). A green fluorescent protein (GFP) expression construct will be used as a negative control,\nsince GFP expression has no effect on cell morphology (but makes the cells glow an attractive\nshade of green). As an additional control, cells will be transfected with an \"empty\" vector, i.e. a\nvector containing the CMV promoter and globin polyadenylation site but lacking any inserted\ncDNA sequence.\nWe will also do a TBLASTN search with each of the six known rotund family proteins as\na query against the human genome using the NCBI BLAST web server\n[http://ncbi.nlm.nih.gov/blast]. BLAST hits will be manually inspected for presence of the\nconserved rotund domain and for presence of the 'ACT' motif, which is known to be critical for\ninteracting with actin microfilaments (ref). Full-length cDNAs will be obtained from the IMAGE\nConsortium [http://...] for each potential novel rotund family member identified by BLAST, and\nthese cDNAs will be cloned into the expression construct and tested as for the known rotund\nfamily genes. Blah blah blah ...\nReferences\nCite relevant references for statements of known results, hypotheses, or background information.\nAbout 5-10 refs is probably appropriate for this exercise. Cite them in the text like this:\n\"In response to death stimuli, ubiquitination of DIAP1 is enhanced by interaction with Reaper\n(Martin, 2002; Palaga and Osborne, 2002).\"\nFor references with one or two others, list all authors (and year), as above. For references with\nthree or more authors, cite as first author et al. (Latin for 'and others'), followed by the year.\nInclude an alphabetical list at the end (ordered by last name of first author), in this format:\nMartin, S. J. (2002). Destabilizing influences in apoptosis: sowing the seeds of IAP destruction.\nCell 109, 793-796.\nPalaga, T. and Osborne, B. (2002). The 3D's of apoptosis: death, degradation and DIAPs.\nNature Cell Biol. 4, E149-E151.\nNote that the journal name is italicized and the volume number is in bold. In the reference list,\ninclude all authors, even if there are more than two. Make sure that all references cited in the\ntext appear in the reference list at the end and vice versa.\n\nTips for Writing Team Project Proposals\n1. Begin with the literature. First, read the relevant papers in your course binder. Ask an\ninstructor if unsure of which papers are relevant to your project. Next, do a PubMed search at\n[http://ncbi.nlm.nih.gov/entrez] using a few relevant keywords (e.g., Drosophila, caspase,\napoptosis, DIAP1, phosphatidyl inositol, etc.). Try different combinations of keywords. Read\nthe abstracts of any papers that have relevant-sounding titles. If the paper still sounds relevant,\ndownload it and read it. Collect a list of gene names related to your project. Search for these\ngenes in FlyBase and on the OpenBiosystems web site. You may want to break up the reading\nof the papers and the searching between team members and then pool your insights.\n2. Include some bioinformatics if appropriate. For example, you may want to do some searches\nof FlyBase [http://flybase.net/] (or other servers) or do some BLAST searches against known\nDrosophila proteins or against the Drosophila genome. If the bioinformatics seems complex,\ndescribe what you plan to do in the proposal rather than doing it beforehand.\n3. Come up with specific aims. Roughly 1-3 aims is suggested. The aims are very important, so\nspend some time thinking about them. If you read your aims aloud and they don't seem clear or\ndon't seem interesting, then keep working on them. Aims should be as concise as possible.\n4. Design a set of experiments that address your specific aims. You should discuss the\nexperiments with your teammate(s), but of course write them up independently. Be sure to\ninclude positive and negative controls. Be as specific as possible. List the names and accession\nnumbers of the genes that you will study, perhaps in a table. Describe any time courses or\ntitrations you plan to do, and what range of times or concentrations you will explore. Describe\nhow you will analyze/interpret your data and how you will deal with expected and unexpected\nresults. If one set of experiments is contingent on the outcome of another set of experiments,\nexplain this clearly, and explain what you will do if the first set does not turn out as expected.\nConvince the reader that you have thought about all the potential obstacles in carrying out your\nresearch and have a plan for overcoming each of them.\n5. Follow the advice of the writing instructor in planning, writing and editing your proposals. In\nparticular, make an outline early on, then write a draft, read it over to yourself, make revisions,\nand ask for comments from the writing instructor, Marilee Ogren. Be sure to contact her several\ndays before the due date to allow time for her to give you feedback and for you to revise your\nproposal.\n6. Remember that what you propose is what you will do. For the rest of the semester. So make\nsure that your proposal makes scientific sense and is as interesting to you as possible (while still\nremaining doable in the time available). Of course, some deviation from plans in the face of\nunexpected results (or technical difficulties) often occurs in scientific research."
    },
    {
      "category": "Resource",
      "title": "stafford_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/9f93f0b97f9d1824ec145daf1af7e344_stafford_final.pdf",
      "content": "DIAP1Mediated Apoptosis in Drosophila S2 Cells Relies on the\nCaspases DRONC, DRICE, and DCP1\nKate Stafford and Colin Chu\nMay 12, 2005\nAbstract\nThe caspase cascade in Drosophila is controlled primarily by DIAP1 (Drosophila inhibitor\nof apoptosis), which exerts its regulatory effect by targeting the initiator caspase DRONC\nfor proteasomal degradation.\nProapoptotic signaling stimulates autoubiquitination by\nDIAP1 and frees DRONC to activate the caspase cascade. We used RTPCR for expression\nprofiling of Drosophila S2 cells and determined that all Drosophila caspases save DECAY\nare expressed.\nFurthermore, we employed the technique of RNA interference (RNAi),\ncomplemented by biochemical caspase activity assays, to determine that suppression of\nDRONC, DRICE, and DCP1 by RNAi largely rescues cells from apoptosis induced through\nthe DIAP1 pathway.\nIntroduction\nThe apoptotic pathway in Drosophila is critically dependent on the class of cysteine proteases known as cas\npases, of which seven have been identified in the Drosophila genome (Kumar and Doumanis, 2000; see Table\n1). Caspases are synthesized as zymogens and are activated by proteolysis upon proapoptotic signaling.\nApical or \"initiator\" caspases primarily activate the downstream \"effector\" caspases whose protease activity\nis directed toward the deconstruction of cellular machinery.\n\nTable 1: The seven known Drosophila caspases and their functions.\nCaspase\nFunction\nProdomain\nCaspase\nFunction\nProdomain\nDRONC\nInitiator\nLong\nDECAY\nUnknown\nShort\nDREDD\nInitiator?\nLong\nDAMM\nUnknown\nShort\nDRICE\nEffector\nShort\nSTRICA\nUnknown\nLong\nDCP1\nEffector\nShort\nAdapted from Richardson and Kumar, 2002; Kumar and Doumanis, 2000.\nThis classification scheme is correlated with the size of structural elements called prodomains which lie N\nterminal to the caspase active sites and frequently contain protein interaction motifs. Initiator prodomains\nare typically long and effector prodomains generally short (Kumar and Doumanis, 2000).\nAlthough the caspase activation pathway has yet to be fully characterized, the roles of certain critical\nregulatory molecules are wellestablished. DIAP1 is understood to be the single most important regulatory\nelement in the caspase cascade (Figure 1).\nIts primary mode of regulation is the ubiquitination of the\ninitiator caspase DRONC, which is thus targeted for proteasomal degradation (Palaga and Osborne, 2002).\nDIAP1 has also been reported to bind to and inhibit the effector caspase DRICE without ubiquitinating it\n(Yan et al., 2004).\nFigure 1: The Drosophila apoptosis pathway. Red proteins are proapoptotic and green are anti\napoptotic. Dashed lines represent less wellestablished interactions. Adapted from Richardson and Kumar,\n2002. See Discussion for a revised model based on our data.\nIn apoptotic cells, DIAP1 is itself inhibited by upstream regulatory proteins known as Reaper, Hid, and\nGrim (RHG); when these proteins are active, DIAP1 ubiquitinates itself and is degraded by the proteasome.\nA partial negative feedback loop exists in this interaction - DIAP1 is capable of ubiquitinating Reaper as\nwell (Olson et al., 2003). After removal of DIAP1 inhibition, DRONC recruits the activator protein DARK\nto form a structure known as the apoptosome, which is specialized for further caspase activation (Martin,\n\n2002). Alternatively, DARK may be required for early processing of DRONC into its active form (Muro\net al., 2002). Once activated, DRONC is capable of activating DRICE, which in turn cleaves DRONC and\nrenders it invulnerable to DIAP1 inhibition (Yan et al., 2004). Finally, DCP1's position as a generalpurpose\ndownstream protease is relatively uncontroversial, although it has not been reported to participate in any\nfeedback mechanisms (Richardson and Kumar, 2002).\nThe roles of the remaining caspases in the activation sequence are less wellstudied. DREDD is reported\nto be an initiator caspase, although no clear position in the pathway has been assigned to it. One review\nsuggests that it may also play a role far upstream in the proapoptotic signaling of the innate immunity\npathway (Richardson and Kumar, 2002). It has even been suggested that DREDD concentration is a rate\nlimiting factor in apoptosis induced via RHG activation (Kumar and Doumanis, 2000). DECAY has been\nreported to be an effector caspase similar to DCP1 (Danial and Korsmeyer, 2004), but this assignment is\ntenuous; the roles of DECAY, DAMM, and STRICA in the caspase cascade at this point remain ambiguous.\nA critical element of the caspase activation pathway is the substrate specificity of each caspase. The\ncanonical caspase substrate is the peptide sequence DxxD, where x represents any amino acid; however,\nindividual caspases have more specific substrate requirements. Effector caspases like DCP1, DRICE, and\nDECAY typically recognize the sequence DEVD (Kumar and Doumanis, 2000). DRONC, the only known\nDrosophila caspase capable of cleaving a peptide ending in either glutamate or aspartate, can cleave TQTE,\nTETD, and IETD as well as DEVD (Hawkins et al., 2000). Because DRONC must proteolytically activate\nitself as well as other caspases, it must be capable of recognizing a site toward which proteases (including\nthe other caspases) have no activity. Were this not the case, DRONC would be susceptible to activation\neven in the absence of proapoptotic signaling.\nThe technique of RNA interference (RNAi) has been fruitfully applied to the study of cellular processes in\nDrosophila (Clemens et al., 2000). Because the regulatory molecule DIAP1 is an ideal RNAi target, we used\nthe technique to examine patterns of caspase activation in Drosophila S2 cells. We first determined which of\nthe seven Drosophila caspases are expressed in S2 cells and found that DECAY is the only caspase absent. We\nnext used RNAi targeted toward each caspase in conjunction with DIAP1 in an attempt to produce partial\n\nrescue from DIAP1induced apoptosis. Consistent with expectations, we found that DRONC, DRICE, and\nDCP1 confer strong resistance to apoptosis triggered through the DIAP1 pathway. Finally, we employed\nbiochemical assays of caspase activity to explore the order and magnitude of caspase activation in apoptotic\ncells.\nMaterials and Methods\nCell Culture and Survival Assays\nDrosophila S2 cells were cultured in liquid Schneider's media supplemented with inactivated fetal calf serum\nand penicillinstreptomycin to aid in the prevention of bacterial contamination. Cultures were maintained\nat 25*C and split once every 34 days. Cultures were assayed for cell survival by staining with Trypan Blue,\nwhich is excluded from viable cells but taken up by those that are nonviable. Although this assay does\nnot distinguish between apoptotic and necrotic cell death, wellmaintained cultures should have a minimal\namount of necrosis. Viable cells were counted by visual inspection of a hemacytometer grid with a light\nmicroscope.\nExpression Profiling by RTPCR\nTotal RNA was extracted from a population of nonapoptotic S2 cells (7.16 RNeasy protocol). The resulting\nRNA was briefly treated with DNase to remove contaminating DNA before subjected to twostep reverse\ntranscriptasePCR (RTPCR; 7.16 RTPCR protocol) to produce a cDNA pool. PCR was performed in\n25μL volume per reaction with the primers shown in Table 2. Stock primers for the ribosomal RNA RpS17\nwere used as a control to confirm PCR success and to semiquantitatively compare RNA volume between\nextracts. The PCR procedure was adapted from Hild et al. (2003) and consisted of 30 seconds denaturation\nat 94*C, 30 seconds annealing at either 55*C (A) or 65*C (B), and 90 seconds extension at 72*C. After an\ninitial 5minute denaturation step at 94*C, 10 cycles of procedure A and 25 cycles of procedure B were run,\nfollowed by a final 5minute extension at 72*C.\n\nPreparation of DoubleStranded RNA\nIn vitro transcription (IVT) was used to prepare doublestranded RNA (dsRNA) for RNAi transfections.\nCommercially available DNA clones were purchased from OpenBiosystems where available; DNA for the\nexpressed caspase for which no clone was available (STRICA) was obtained by performing PCR on total\nRNA extractions using primers with T7 extensions. Due to persistent low yields, slight modifications to the\nstandard protocol (7.16 IVT protocol) were made: we used 3μg of DNA template, precipitated the resulting\nRNA with 30μg LiCl solution, and washed each pellet twice with 70% ethanol in DEPCtreated water.\nConcentration was determined by measuring the light absorbance at 260nm, and each product was diluted\nto a final concentration of 1μg/μL for later use.\nTable 2: Primers and reference numbers for expression profiling of each caspase.\nCaspase\nForward Primer\nReverse Primer\nCG number\nDRONC\nGACAATGGTGACCTCCTCGT\nGCCATCACTTGGCAAAACTT\nCG8091\nDREDD\nACTACTTGCCGCATATCG\nTGCTAACATTCCGGTGAAAC\nCG5486\nDCP1\nGCGGTGGCCATACTCTC\nGAACAGCTTCGGCTTGC\nCG5370\nDRICE\nGTACAACATGCGCCACAAG\nCAGGAACCGTCGAGTAGG\nCG7788\nDECAY\nCTCGGGAGGATCACAGTC\nAATGTGGAGTAGAAGACGAG\nCG14902\nDAMM\nGCTGGATTTGTCCTCTTTATC\nTTTTTGGCTTGCCAGATAAG\nCG18188\nSTRICA\nAGAGTGGACCTCAAGGGAA\nCGCAAGACCTTCACATCC\nCG7863\nCG numbers reference the caspases in the FlyBase and OpenBiosystems databases.\nAll primers except\nDRONC were taken from Hild et al. (2003); the DRONC primers shown were tested and confirmed good by\nprevious 7.16 students. STRICA, for which an OpenBiosystems clone was not available, was amplified using\nprimers with the T7 attachment GAATTAATACGACTCACTATAGGGAGA at the 5' end. All primers are\nwritten 5' to 3'.\nRNA Interference Transfections\nRNAi transfections were performed using serum starvation (7.16 serum starvation protocol) to encourage cells\nto take up exogenous dsRNA. Healthy cells cultured as described previously were centrifuged at 1000rpm for\n3 minutes to remove them from serumsupplemented media and resuspended to a concentration of 1 million\ncells/mL in serum free media (SFM). Aliquots of 1mL were placed into each well of a 6well plate and 520μg\nof dsRNA was added dropwise. Cells were incubated in SFM for approximately 30 minutes before 2mL\nof serumsupplemented media was added to each well. At 24hour intervals, aliquots of 100200μL were\n\nremoved after scraping the well bottoms and assayed for cell survival.\nWe titrated DIAP1 dsRNA with a range of concentrations between 020μg RNA per cell well to evaluate\ntransfection efficiency and determine the amount of RNA that produced halfmaximal cell death, which was\nused for double transfections in which both a caspase and DIAP1 were knocked down. To control for the\npossibility that dsRNA addition by itself could induce cell death, the total amount of dsRNA added to cell\nwells was kept constant within experiments by adding dsRNA targeting GFP (green fluorescent protein, a\ngene native to jellyfish that is not present in Drosophila). Because caspase halflives were potentially longer\nthan that of DIAP1, double transfections were performed on two separate days.\nCells were transfected\nwith 10μg of caspase dsRNA first, because protection from DIAP1induced apoptosis requires thorough\ndegradation of preexisting caspase. A total of 10μg of caspase dsRNA and 5μg of DIAP1 dsRNA (for double\nknockdowns) or 5μg GFP dsRNA (for single knockdowns) was added at least 48 and ideally 72 hours later;\nthe additional caspase was intended to reinforce the suppression of caspase expression. The gap between\ntransfections ensured that the caspase was sufficiently degraded before apoptosis induction and that the cells\nhad recovered from the stress of serumstarvation before being transfected again. Each experiment included\nat least one and ideally three control wells containing cells transfected only with GFP dsRNA, and between\none and three wells containing cells transfected with DIAP1 dsRNA on the second day. These controls\nallowed us to establish growth rates over time for normal and apoptotic cells.\nCaspase Activity Assays and UVInduced Apoptosis\nIn preparation for caspase activity assays, it was useful to induce apoptosis more quickly and efficiently than\nby DIAP1 knockdown. Healthy cells or caspase single knockdowns were irradiated with ultraviolet light\nof 254nm wavelength at 4.8×106μJ/min for 12.2 minutes (adapted from Wright et al. 2005). Cells were\nincubated for 24 hours before being harvested and counted.\nCell lysis and caspase activity assays using the BIOMOL QuantiPak Kit were performed according\nto the manufacturer's instructions. Briefly, cells were pelleted, washed with PBS, and resuspended to a\nconcentration of approximately 2×105 cells/μL in the recommended lysis buffer (50mM HEPES pH 7.4,\n\n0.1% CHAPS, 1mM DTT, 0.1mM EDTA). After a 5minute incubation period on ice, cells were centrifuged\nagain at 4*C and the cytosolicextractcontaining supernatant was used for assay preparation.\nEach extract was assayed for activity against the substrates DEVDpNA, IETDpNA, and YVADpNA.\nThe pnitroaniline absorbs light only when cleaved from the peptide, providing a colorimetric assay for\ncaspase activity against each substrate. Assays were carried out in 100μL volume consisting of 80μL fresh\nassay buffer (50mM HEPES pH 7.4, 100mM NaCl, 0.1% CHAPS, 10mM DTT, 1mM EDTA, 10% glycerol),\n10μL peptide substrate, and 10μL cell extract. Absorbance readings at 405nm were taken at 5 and 30 minutes\nafter reaction initiation, although the 30minute readings proved unreliable (possibly due to degradation of\nthe free pnitroaniline).\nResults\nExpression Profiling\nWe performed RTPCR on total RNA extracts from nonapoptotic cells to determine which of the seven\nDrosophila caspases were expressed in S2 cells.\nThe resulting PCR products were run on 1% ethidium\nbromide agarose gels and visualized by UV irradiation as pictured in Figure 2. The same primers were also\nused in PCR against genomic DNA to confirm successful amplification of each target (data not shown).\nAlthough the PCR procedure tended to produce a significant amount of background priming, probably due\nto the large number of cycles, the most prominent band in each lane corresponds to the correct size for the\ntranscript in question. Only DECAY lacks a clear band at its expected size, and this result is maintained\nwhen an alternate set of primers is used (lane 10). We concluded that six of the seven caspases all but\nDECAY are expressed in S2 cells; therefore, our RNAi experiments did not include attempts to transfect\nwith DECAY dsRNA.\n\nFigure 2: Caspase expression profiling of Drosophila S2 cells. (A) The lowest bright band in the\nladder is 500bp. RpS17 primers are controls that amplify a segment of constitutively expressed ribosomal\nRNA at expected sizes of 270bp for genomic DNA and 211 bp for cDNA. The absence of a 270bp product\nin the cDNA or RNA extract lanes (4 and 5) reveals minimal DNA contamination. (B) Clear bands for\nDREDD, STRICA, DAMM, DRICE, DCP1, and DRONC appear at the expected sizes of 504, 518, 139,\n506, 132, and 504bp respectively (lanes 6,7,9,12,13,14). Lane 11, DECAY(1), shows an absence of a strong\nband at the expected size of 325bp using the primers described in Table 2; DECAY(2) primers (lane 10)\nwere borrowed from Jay Blumling and also show no product.\nIdentifying Downstream Caspases\nBefore initiating double knockdown experiments, we titrated DIAP1 to determine the amount of dsRNA\nneeded for a halfmaximal apoptotic effect.\nDIAP1 concentrations ranging from 0μg to 20μg per well\n(equivalent to 020μg per 1 million cells at time of plating) were tested, with GFP added to equalize the\ntotal amount of RNA to 20μg per well. The growth curves are shown in Figure 3. The halfmaximal value\nwas 57.5μg.\nWe next performed a series of double knockdown experiments using each caspase in conjunction with\nDIAP1 to evaluate whether inhibiting the expression of the target caspase rescued cells from apoptotic\ndeath. Initially, we used 7.5μg of DIAP1 dsRNA along with each caspase; however, this caused all the\ndouble knockdowns to die at rates approximately equal to the DIAP1 control (data not shown). When the\namount of DIAP1 RNA was reduced to 5μg, we obtained the results displayed in Figure 4.\n\nFigure 3: DIAP1 RNAi titration. DIAP1 dsRNA concentrations ranging from 020μg per well and\nequalized with GFP dsRNA to a consistent total of 20μg RNA added reveal a halfmaximal value of about\n57.5μg. Data points represent the average of two experiments and error bars indicate the range.\nDRONC knockdowns appeared to completely rescue cells from DIAP1induced cell death (Figure 4A), and\nin fact both the DRONC single knockdown and the DRONC/DIAP1 double knockdown proliferated slightly\nmore than cells transfected with GFP, suggesting that suppression of DRONC decreases the basal rate of cell\ndeath in otherwise healthy cell populations. DCP1 and DRICE knockdowns conferred almost total resistance\n(Figure 4B,E). DAMM knockdowns (Figure 4C) appeared to slightly suppress the apoptotic phenotype at\n72 hours, but this effect was all but eliminated by 96 hours, suggesting that knocking down DAMM has\nat most a small protective effect. The results for DREDD and STRICA are more difficult to interpret;\nthe DREDD/DIAP1 double knockdown actually proliferated more by 96 hours than the DREDD single\nknockdown, although both proliferated more than DIAP1 alone (Figure 4D). From this latter observation\nwe suggest that DREDD knockdowns as well may have a small protective effect. Finally, STRICA single\nknockdowns seemed to inhibit cell proliferation by themselves (Figure 4F).\nExamining Caspase Activity\nBiochemical assays of caspase activity in cell lysates complemented our transfection results and provided\ninformation about feedback effects in the caspase activation pathway.\nBecause caspases are not active\n\nFigure 4: Double transfections of DIAP1 and expressed caspases. With the exception of the double\nknockdowns in (E) and (F), which were done in triplicate, each data point represents the average of two\nwells and error bars represent the range. Note that the error in DIAP1 measurements is very small. On each\ngraph is displayed a DIAP1 transfection, a caspase single knockdown, a caspase/DIAP1 double knockdown,\nand a GFP control. (A), DRONC; (B), DRICE; (C), DAMM; (D), DREDD; (E), DCP1; (F), STRICA.\nIn (E) and (F), single and double knockdowns were transfected at different times with cells at different\nages. In (E), GFP, DIAP1, and DCP1 were performed at the same time, and GFP2 represents a single\nGFP control well transfected at the same time and with the same cells as DCP1/DIAP1. In (F), GFP,\nDIAP1, and STRICA/DIAP1 were transfected at the same time, and GFP2 represents a single GFP control\nwell transfected at the same time and with the same cells as the STRICA single knockdown.\n\nin healthy cells, measurements of caspase activity had to be made on apoptotic populations; however, as\ndescribed previously, some caspase knockdowns confer nearcomplete resistance to apoptosis induced by\nDIAP1. Singly transfected cells in which caspases had been knocked down were therefore exposed to UV\nlight as described (see Materials and Methods), which is a harsher treatment than transfection with half\nmaximal DIAP1.\nPercent cell viability 24h postirradiation is shown in Figure 5.\nConsistent with our\ntransfection results, DRONC, DRICE, and DCP1 knockdowns confer greater resistance to apoptosis than\ndo DAMM or DREDD knockdowns, although all five display some suppression of the apoptotic phenotype.\nSTRICA knockdowns fare no better than GFPtransfected irradiated cells, but this is not surprising, since\nSTRICA single knockdowns seem to kill cells on their own. UVirradiated single knockdowns were not tested.\nFigure 5: Percent cell viability at 24 hours postirradiation. Data points display the number of\ncells in UVtreated caspase knockdown or GFPtransfected populations as a percentage of nonirradiated\ncontrols incubated under the same conditions.\nCell lysates were made 24h postirradiation and assayed with the peptide substrates DEVD, IETD, and\nYVAD. Results are presented in Figure 6 as the ratio of the optical density of each lysate relative to un\nirradiated controls. Because the substrate peptides are coupled to a pnitroaniline ring that is colored only\nwhen free in solution, higher optical density relative to untreated controls implies higher levels of caspase\nactivity. As expected, GFPtransfected control cells showed increased activity toward DEVD, the canonical\ncaspase substrate, as well as toward the DRONCspecific substrate IETD. YVAD was expected to be inert,\n\nas it is reported to be in apoptotic mammalian cells (BIOMOL QuantiPak Product Data Sheet); however,\ncleavage of YVAD is significantly upregulated in apoptotic cells. Figure 6 displays results after a 5minute\nincubation at room temperature; data was also obtained after a 30minute incubation period (not shown),\nbut a decline in optical density in some samples between 5 and 30 minutes led to concerns about pnitroaniline\ndegradation on this timescale.\nFigure 6: Caspase activity assays of UVtreated caspase single knockdowns. Data is presented as\nthe ratio of the OD405nm of each knockdown or of GFPtransfected cells to the OD405nm of nonirradiated\ncontrol cells incubated under the same conditions. (A) All caspases. Cells were irradiated as described\nin Materials and Methods and lysed 24 hours postirradiation. Each data point represents a single assay.\n(B) DCP1 and STRICA. Cells were prepared as in (A), but since these caspase knockdowns were assayed\nas part of two experiments, data points displayed here represent the average of two assays, and error bars\nrepresent the range. Note the high variability in the YVAD measurements.\nThe caspase knockdowns all display cleavage behavior that is very distinct from that of GFPtransfected\nirradiated cells. Although we did not obtain sufficient RNA to perform RTPCR on the cells in our trans\nfection experiments, we can reasonably expect that this substantial difference in activity toward caspase\nsubstrates reflects appreciable knockdown of the target caspase in each case.\nDiscussion\nAlthough we embarked on this research project with the stated goal of identifying which of the expressed\ncaspases are required for apoptosis in S2 cells, the data suggest that apoptosis induction is more subtle than\nis implied a binary classification of \"required\" or \"redundant.\" DRONC, DRICE, and DCP1 knockdowns\nlargely or totally suppress apoptosis induced by transfection with halfmaximal amounts of DIAP1, and\n\nreduce apoptosis induced by UV irradiation by about 4050% . Since UV light is known to activate the pro\napoptotic signaling peptide Reaper and the apoptosome component DARK (Zhou and Steller, 2003), as well\nas inducing the processing of DRONC to its active form (Muro et al., 2002), it is reasonable to assume that\nUV irradiation triggers apoptosis through the DIAP1 pathway. Our data imply that, under the extremely\nsevere cellular stress induced by UV irradiation, a moderate degree of caspasedependent apoptosis can occur\neven in when these \"required\" caspases are severely depleted. Since we were not able to isolate enough RNA\nfor RTPCR, we cannot determine how much of each caspase transcript remained after RNAi or whether\nthis amount was likely to have been sufficient to induce death under severe stress. Figure 7 suggests a model\nof the apoptosis pathway modified to account for our observations; interactions that are suggested by our\ntransfection and activity assay data are shown in orange.\nFigure 7: The revised Drosophila apoptosis pathway. Interactions that were suggested by our data\nare indicated by orange lines. Originally adapted from Richardson and Kumar, 2002.\nIn the cases of DRONC, DRICE, and DCP1, the caspase activity assays are consistent with expectations\nand suggest positivefeedback interactions between the three molecules. All three knockdowns significantly\ndecrease DEVD cleavage to levels below those of nonirradiated cells, which was expected because the effector\ncaspases DRICE and DCP1 preferentially cleave DEVD, and DRONC's main role in apoptosis induction\nis to activate the effector caspases. Similarly, DRONC knockdowns have the lowest IETD cleavage of any\nlysate tested, and DRONC is the only Drosophila caspase known to cleave IETD. This latter fact implies\nthat, unless other caspases have previously unknown activity toward IETD, the remaining knockdowns exert\ntheir effects on IETD cleavage via an effect on DRONC. Since DRICE is known to participate in a positive\nfeedback loop by which it activates DRONC (Yan et al., 2004), and DCP1 is generally closely related\n\nto DRICE (Kumar and Doumanis, 2000), these two effector caspases' effects on IETD cleavage is readily\nexplicable. In fact, one question that arises from the data is why these knockdowns do not have an even\nstronger negative effect.\nThe behavior of DRONC, DRICE, and DCP1 knockdowns under proapoptotic conditions was relatively\npredictable based on the Drosophila apoptosis literature, which focuses mainly on these three caspases in\ncharacterizing the activation of the apoptotic pathway. Fewer studies have characterized DREDD, DAMM,\nand STRICA, and our data on them is more equivocal. DREDD seems to confer mild resistance to DIAP1\ninduced apoptosis. In the case of DAMM, partial rescue from apoptosis appears to have occurred at 72 hours,\nbut the effect is reversed at 96 hours (Figure 4C). It is not clear without additional replicates which of the\ntwo datapoints more accurately reflects the behavior of the cell populations. Finally, the data on STRICA\nis difficult to interpret. We have consistently observed that STRICA single knockdowns kill cells to about\nthe same extent as DIAP1, while STRICA/DIAP1 double knockdowns proliferate somewhat more. This is\nin contrast to the observations of Doumanis et al. (2001), where overexpression of STRICA in Drosophila\nSL2 cells was found to induce apoptosis. Since caspases are almost always proapoptotic, it is not clear why\nsuppression of STRICA should promote cell death. Fruitful further exploration of this phenomenon would\ninclude DNA extraction to distinguish between apoptotic and necrotic death, as well as additional replicates\nof STRICA single knockdowns with a new preparation of dsRNA to control for the remote possibility of\ncytotoxic contamination.\nThe behavior of DREDD, DAMM, and STRICA knockdowns in activity assays is similarly perplexing.\nThe significant decrease in DEVD cleavage in DREDD knockdowns lends credence to the hypothesis that it\nplays a role in DRONCinduced activation of downstream effectors (Richardson and Kumar, 2002). However,\nour data shows that the DREDD knockdown actually increases IETD cleavage relative to GFPtransfected\nirradiated cells.\nThe reason for this is not readily apparent, although it is not known whether this is\na reliably reproducible effect. Of all the caspase knockdowns, DAMM has the smallest effect on DEVD\ncleavage, although DAMM knockdowns are still deficient relative to GFPtransfected apoptotic cells. DAMM\nalso greatly decreases IETD cleavage, although it has not been reported to interact with DRONC. Finally,\n\nSTRICA is again a puzzle, since STRICA knockdowns eliminate both DEVD and IETD cleavage, yet purified\nSTRICA does not cleave any known caspase substrate (Doumanis et al., 2001).\nThe ability of GFPtransfected irradiated cells to cleave the substrate YVAD was also quite surprising,\nsince YVAD was expected to be inert. It is included in the assay kit as an inert control that is not cleaved\nin mammalian cells, and has also been used for the same purpose in studies of Drosophila caspases (e.g.,\nHawkins et al., 2000). In our hands YVAD provided the least consistent results of the three substrates,\nalthough this effect could be due to the incidental fact that it was always assayed last. Furthermore, all\ncaspase knockdowns dramatically decreased YVAD cleavage, although DRICE knockdowns seemed to have\nthe least effect. Results for STRICA proved inconsistent, with one assay showing activity close to that of\nGFPtransfected cells, and another showing a substantial decrease in activity. Because so many caspases\neliminated YVAD activity, it is impossible to suggest that a particular caspase is responsible. YVAD cleavage\nmay even be due to an entirely unrelated protease. Kondo et al. (1997) report YVAD cleavage activity in\nS2 cells during Fasinduced, but not DIAP1induced, apoptosis; however, they were not able to isolate and\ncharacterize the protein or proteins responsible, and there seems to have been little followup on this result.\nMore detailed data could be obtained from caspase activity assays performed under more optimal con\nditions. Monitoring the reaction at higher time resolution, rather than at discrete and widely disparate\ntimepoints, would provide key data on the kinetics of the reactions catalyzed by Drosophila caspases. The\nkinetics of mammalian caspases have been extensively characterized using this method, so its application\nto Drosophila caspases would be useful. A full kinetic study could also examine in more detail whether the\nfree pnitroaniline molecule is degraded by Drosophila cell lysates. Additionally, comparison of an irradiated\ncaspase/DIAP1 double knockdown to the corresponding irradiated single knockdown would provide more\ndetailed information about whether and to what extent basal substrate cleavage is perturbed by the sup\npression of caspase expression. Finally, we had limited amounts of time and limited numbers of cells to work\nwith, so only DCP1 and STRICA assays were repeated more than once; one of our two attempts to perform\nthese assays on all six caspase knockdowns yielded too few cells to obtain significant absorbance readings. In\nthe cases of DCP1 and STRICA the two experiments gave very similar results for both DEVD and IETD,\n\nwith more variability in the YVAD data.\nOverall, we find strong experimental evidence for the hypothesis that DRONC, DRICE, and DCP1 are\nrequired for DIAP1mediated apoptosis in Drosophila S2 cells. Caspase activity assays further suggest that\nboth DRICE and DCP1 activate DRONC in a positivefeedback loop in the course of caspase activation.\nWe also find clear evidence that DECAY is not expressed in S2 cells; because DECAY is reported to be an\neffector caspase, it may be redundant with DRICE and DCP1. DREDD and DAMM do not seem to be\nrequired for apoptosis, but suppressing their expression does yield a small protective effect against apoptotic\ncell death. The effects of STRICA on apoptosis remain difficult to discern.\nAcknowledgements\nWe would like to thank Profs. Chris Burge and David Sabatini for their valuable guidance and instruction\nover the course of the semester.\nWe also thank Alice Rushforth and the TA staff - Megan Cole, April\nRisinger, and Shomit Sengupta - for their knowledgeable assistance, and our fellow 7.16 students for lending\nboth moral support and depleted reagents.\n\nReferences\nBurge C, Sabatini D, Rushforth A, Orgen M, Cole M, Risinger A, Sengupta S. (2005). 7.16: Experimental\nmolecular biology laboratory manual.\nCaspase Colorimetric Substrate/Inhibitor QuantiPak Product Data Sheet. (2004). BIOMOL International,\nLP.\nClemens JC, Worby CA, SimonsonLeff N, Muda M, Maehama T, Hemmings BA, Dixon JE. (2000). Use\nof doublestranded RNA interference in Drosophila cell lines to dissect signal transduction pathways.\nProc. Natl. Acad. Sci. 97(12): 6499503.\nDanial NN and Korsmeyer SJ. (2004). Cell death: critical control points. Cell 116: 20519.\nDoumanis J, Quinn L, Richardson H, Kumar S. (2001). STRICA, a novel Drosophila melanogaster caspase\nwith an unusual serine/threoninerich prodomain, interacts with DIAP1 and DIAP2. Cell Death Differ.\n8: 38794.\nHawkins CJ, Yoo SJ, Peterson EP, Wang SL, Vernooy SY, Hay BA. (2000). The Drosophila caspase DRONC\ncleaves following glutamate or aspartate and is regulated by DIAP1, HID, and GRIM. J. Biol. Chem.\n275(35): 2708493.\nHild M, Beckmann B, Haas SA, Koch B, Solovyev V, Busold C, Fellenberg K, Boutros M, Vingron M, Sauer\nF, Hoheisel JD, Paro R. (2003). An integrated gene annotation and transcriptional profiling approach\ntowards the full gene content of the Drosophila genome. Genome Biol. 5(1): R3.\nKondo T, Yokokura T, Nagata S. (1997). Activation of distinct caspaselike proteases by Fas and reaper in\nDrosophila cells. Proc. Natl. Acad. Sci. 94: 119516.\nKumar S and Doumanis J. (2000).The fly caspases. Cell Death Differ. 7: 103944.\nMartin SJ. (2002). Destabilizing influences in apoptosis: Sowing the seeds of IAP destruction. Cell 109:\n7936.\nMuro I, Hay B, Clem RJ. (2002). The Drosophila DIAP1 protein is required to prevent accumulation of\na continuously generated, processed form of the apical caspase DRONC. J. Biol. Chem. 277(51):\n4964450.\n\nOlson MR, Holley CL, Yoo SJ, Huh JR, Hay BA, Kornbluth S. (2003). Reaper is regulated by IAPmediatred\nubiquitination. J. Biol. Chem. 278(6): 402834.\nPalaga T and Osborne B. (2002). The 3 D's of apoptosis: Death, degradation, and DIAPs. Nat. Cell Biol.\n4: E14951.\nRichardson H and Kumar S. (2002). Death to flies: Drosophila as a model system to study programmed cell\ndeath. J. Immunol. Methods 265: 2138.\nWright CW, Means JC, Clem RJ. (2005). The baculovirus antiapoptotic protein OpIAP does not inhibit\nDrosophila caspases or apoptosis in Drosophila S2 cells and instead sensitizes S2 cells to virusinduced\napoptosis. Virology. 335(1): 6171.\nYan N, Wu JW, Chai J, Li W, Shi Y. (2004). Molecular mechanisms of DrICE inhibition by DIAP1 and\nremoval of inhibition by Reaper, Hid, and Grim. Nat. Mol. Struct. Biol. 11(5): 4208.\nZhou L and Steller H. (2003). Distinct pathways mediate UVinduced apoptosis in Drosophila embryos.\nDev. Cell. 4(4): 599605."
    },
    {
      "category": "Resource",
      "title": "stafford_minirev.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/c4df2cc262a6d608b0d03f95c0d16d63_stafford_minirev.pdf",
      "content": "Drosophila Apoptosis and the Regulation of the Caspase Cascade\nKate Stafford\nMarch 18, 2005\nAbstract\nThe caspase cascade in Drosophila is controlled primarily by DIAP1 (Drosophila inhibitor\nof apoptosis), which exerts its regulatory effect by ubiquitinating the caspase DRONC,\nthus targeting it for proteasomal degradation.\nProapoptotic signaling stimulates auto\nubiquitination by DIAP1 and frees DRONC to activate downstream caspases.\nIntroduction\nThe apoptotic pathway in Drosophila is critically dependent on the class of cysteine proteases known as cas\npases, of which seven have been identified in the Drosophila genome (Kumar and Doumanis, 2000; see Table\n1). Caspases are synthesized as zymogens and are activated by proteolysis upon proapoptotic signaling.\nApical or \"initiator\" caspases primarily activate the downstream \"effector\" caspases whose protease activity\nis directed toward the deconstruction of cellular machinery.\nTable 1: The seven known Drosophila caspases and their functions. Adapted from Richardson\nand Kumar, 2002; Kumar and Doumanis, 2000.\nCaspase\nFunction\nProdomain\nCaspase\nFunction\nProdomain\nDRONC\nInitiator\nLong\nDECAY\nUnknown\nShort\nDREDD\nInitiator?\nLong\nDAMM\nUnknown\nShort\nDRICE\nEffector\nShort\nSTRICA\nUnknown\nLong\nDCP1\nEffector\nShort\n\nThis classification scheme is correlated with the size of structural elements called prodomains which lie N\nterminal to the caspase active sites and frequently contain protein interaction motifs. Initiator prodomains\nare typically long and effector prodomains generally short (Kumar and Doumanis, 2000).\nWhile intensive research has constructed a skeleton outline of the caspaseactivating apoptosis pathway,\nsignificant questions remain unanswered. The roles of three of the caspases are as yet uncharacterized, and\nthe details of the feedback mechanisms within the cascade have yet to be worked out in full. Nevertheless,\nsignificant inroads have been made in determining the critical elements in the regulation of the Drosophila\ncaspase cascade.\nThe Caspase Activation Pathway\nDIAP1 is currently understood to be the single most important regulatory element in the caspase cascade\n(See Figure 1). Its primary mode of regulation is the ubiquitination of the initiator caspase DRONC, which\nis thus targeted for proteasomal degradation (Palaga and Osborne, 2002). DIAP1 has also been reported to\nbind to and inhibit the effector caspase DRICE without ubiquitinating it (Yan et al., 2004).\nFigure 1: The Drosophila apoptosis pathway.\nRed proteins are proapoptotic and green are anti\napoptotic. Dashed lines represent less wellestablished interactions. Adapted from Richardson and Kumar,\n2002.\nIn apoptotic cells, DIAP1 is itself inhibited by upstream regulatory proteins known as Reaper, Hid, and\nGrim (RHG); when these proteins are active, DIAP1 ubiquitinates itself and is degraded by the proteasome.\nA partial negative feedback loop exists in this interaction - DIAP1 is capable of ubiquitinating Reaper as\nwell (Olson et al., 2003). After removal of DIAP1 inhibition, DRONC recruits the activator protein DARK\nto form a structure known as the apoptosome, which is specialized for further caspase activation (Martin,\n\n2002). Alternatively, DARK may be required for early processing of DRONC into its active form (Muro\net al., 2002). Once activated, DRONC is capable of activating DRICE, which in turn cleaves DRONC and\nrenders it invulnerable to DIAP1 inhibition (Yan et al., 2004). Finally, DCP1's position as a generalpurpose\ndownstream protease is relatively uncontroversial, although it has not been reported to participate in any\nfeedback mechanisms (Richardson and Kumar, 2002).\nThe roles of the remaining caspases in the activation sequence are less wellstudied. DREDD is reported\nto be an initiator caspase, although no clear position in the pathway has been assigned to it. One review\nsuggests that it may also play a role far upstream in the proapoptotic signaling of the innate immunity\npathway (Richardson and Kumar, 2002). It has even been suggested that DREDD concentration is a rate\nlimiting factor in apoptosis induced via RHG activation (Kumar and Doumanis, 2000). DECAY has been\nreported to be an effector caspase similar to DCP1 (Danial and Korsmeyer, 2004), but this assignment is\ntenuous; the roles of DECAY, DAMM, and STRICA in the caspase cascade at this point remain ambiguous.\nA critical element of the caspase activation pathway is the substrate specificity of each caspase. The\ncanonical caspase substrate is the peptide sequence DxxD, where x represents any amino acid; however,\nindividual caspases have more specific substrate requirements. Effector caspases like DCP1, DRICE, and\nDECAY typically recognize the sequence DEVD (Kumar and Doumanis, 2000). DRONC, the only known\nDrosophila caspase capable of cleaving a peptide ending in either glutamate or aspartate, can cleave TQTE,\nTETD, and IETD as well as DEVD (Hawkins et al., 2000). Because DRONC must proteolytically activate\nitself as well as other caspases, it must be capable of recognizing a site toward which proteases (including\nthe other caspases) have no activity. Were this not the case, DRONC would be susceptible to activation\neven in the absence of proapoptotic signaling.\nStructureFunction Relationships in Caspase Regulators\nComparatively few crystal structures exist for members of the caspase cascade; however, the structure\nof DIAP1 has been solved in complex with several of its binding partners. DIAP1 possesses three main\n\nstructural subdomains, including a Cterminal RING motif responsible for the molecule's ubiquitin ligase\nactivity (Wilson et al., 2002) and two Nterminal zinccontaining BIR domains (BIR1 and BIR2), which are\nimportant for proteinprotein binding and are found in mammalian as well as Drosophila IAP proteins (Wu\net al., 2001).\nFigure 2: Crystal structures of DIAP1 bound to a fragment of DRONC (A) and Grim (B).\n(A) The DIAP1 BIR2 domain bound to a short fragment of DRONC (outlined in blue). The deep binding\npocket contains a phenylalanine residue required for the binding interaction (Chai et al., 2003). (B) The\nsame domain bound to a Grim fragment in a slightly different orientation. Both Grim and DRONC bind to\nthe same site on the DIAP1 domain (Wu et al., 2001).\nUnsurprisingly, given its role in ubiquitin ligation, a functional RING domain is required for DIAP1\ninduced DRONC degradation, but a mutated RING does not disrupt the interaction between DIAP1 and\nDRONC (Wilson et al., 2002). The BIR2 domain of DIAP1 is required for DRONC binding; interestingly,\ncrystallographic data imply that the DRONC region involved in binding DIAP1 is a short fragment with\nhigh homology to the \"IAPbinding motif\" present at the Ntermini of the RHG proteins. This suggests\nthat the RHG proteins disrupt the DIAP1DRONC interaction by straightforward competitive inhibition\n(Chai et al., 2003; see Figure 2). Also of interest is the size of the DRONC peptide that mediates DIAP1\nbinding - a 12residue region is both necessary and sufficient for DRONC binding to the BIR2 domain of\n\nDIAP1, and a single point mutation is capable of completely destroying the interaction (Chai et al., 2003).\nA similar competitionbased mechanism has been identified for the interaction of the BIR1 domain with\nDRICE, although this interaction does not result in DRICE ubiquitination (Yan et al., 2004).\nThe Mechanism of DRONC and DIAP1 Degradation\nUbiquitination and proteasomal degradation play a vital role in the regulation of the caspase cascade, and it\nis not surprising that a number of secondary regulators influence the ubiquitination of DRONC and DIAP1\n(See Figure 3). Although DIAP1's RING domain has E3 ubiquitin ligase activity, it functions in an E2\nconjugasedependent manner (Schreader et al., 2003). In ubiquitinating either DRONC (in healthy cells)\nFigure 3: DRONC and DIAP1 degradation. Under apoptotic conditions, DIAP1 ubiquitinates itself\nand is degraded by the proteasome. Under conditions of cell survival, DIAP1 instead ubiquitinates DRONC\nand causes its degradation. Adapted from Martin, 2002.\nor other DIAP1 molecules (in apoptotic cells), DIAP1's ubiquitin ligase activity emerges only in complex\nwith the ancillary proteins UBCD1 and Morgue (Martin, 2002). UBCD1 is a \"legitimate\" E2 conjugase;\nhowever, while Morgue shares high sequence identity with known conjugases, it lacks a required active site\nresidue and is thus best described as a ubiquitin E2 conjugase variant (UEV). UEV's lack E2 activity on\ntheir own but promote the activity of conjugases with which they are bound (Schreader et al., 2003). It\nis not known whether either DIAP1 or DRONC retain their biochemical activities after ubiquitination but\nbefore proteasomal degradation.\nInactivation of the proteasome by RNA interference targeted toward a single proteasomal subunit pro\n\nduces varying degrees of apoptotic cell death (W ojcik and DeMartino, 2002). The amount of apoptosis\nobserved is dependent on the particular subunit targeted, although the level of ubiqutinated protein buildup\nobserved in proteasome knockdowns is less subunitdependent. Known proteasome inhibitors such as lac\ntacystin also increase ubiquitinated protein levels and induce apoptosis. In neither case is it clear whether\nproteasomal dysfunction actively induces apoptosis, or whether proapoptotic proteins such as DRONC that\nwould normally be degraded are running amok in the cell.\nConclusions\nAlthough the basic outline of the caspase activation pathway in Drosophila is fairly well characterized, a\nnumber of outstanding questions remain. First, the roles of DECAY, DAMM, STRICA, and to some extent\nDREDD have yet to be fully explored in the apoptotic pathway of Drosophila cells. Second, crystal structures\nof proteins that participate in the caspase cascade remain rare and would provide important information\nabout structurefunction relationships in caspases and their regulators. Finally, the role of the proteasome in\nregulating levels of apoptotic proteins has yet to be elucidated in specific biochemical detail. Further research\nin each of these areas will likely yield exiting new discoveries about apoptosis regulation in Drosophila.\n\nReferences\nChai J, Yan N, Huh JR, Wu JW, Li W, Hay BA, and Shi Y. (2003). Molecular mechanism of ReaperGrim\nHidmediated suppression of DIAP1dependent DRONC ubiquitination. Nat. Struct. Biol. 10(9):\n8928.\nDanial NN and Korsmeyer SJ. (2004). Cell death: critical control points. Cell 116: 20519.\nHawkins CJ, Yoo SJ, Peterson EP, Wang SL, Vernooy SY, Hay BA. (2000). The Drosophila caspase DRONC\ncleaves following glutamate or aspartate and is regulated by DIAP1, HID, and GRIM. J. Biol. Chem.\n275(35): 2708493.\nKumar S and Doumanis J. (2000).The fly caspases. Cell Death Differ. 7: 103944.\nMartin SJ. (2002). Destabilizing influences in apoptosis: Sowing the seeds of IAP destruction. Cell 109:\n7936.\nMuro I, Hay B, and Clem RJ. (2002). The Drosophila DIAP1 protein is required to prevent accumulation\nof a continuously generated, processed form of the apical caspase DRONC. J. Biol. Chem. 277(51):\n4964450.\nOlson MR, Holley CL, Yoo SJ, Huh JR, Hay BA, Kornbluth S. (2003). Reaper is regulated by IAPmediatred\nubiquitination. J. Biol. Chem. 278(6): 402834.\nPalaga T and Osborne B. (2002). The 3 D's of apoptosis: Death, degradation, and DIAPs. Nat. Cell Biol.\n4: E14951.\nRichardson H and Kumar S. (2002). Death to flies: Drosophila as a model system to study programmed cell\ndeath. J. Immunol. Methods 265: 2138.\nSchreader BA, Wang Y, Namby J. (2003). Drosophila morgue and the intersection between protein ubiqui\ntination and programmed cell death. Apoptosis 8: 12939.\nWilson R, Goyal L, Ditzel M, Zachariou A, Baker DA, Agapite J, Steller H, Meier P. (2002). The DIAP1\nRING figured mediates ubiquitination of DRONC and is indispensable for regulating apoptosis. Nat.\nCell. Biol. 4: 44550.\n\nW ojcik C and DeMartino GN. Analysis of Drosophila 26S proteasome using RNA interference. J. Biol.\nChem. 277(8): 618897.\nWu JW, Cocina AE, Chai J, Hay BA, Shi Y. (2001). Structural analysis of a functional DIAP1 fragment\nbound to Grim and Hid peptides. Mol. Cell 8: 95104.\nYan N, Wu JW, Chai J, Li W, and Shi Y. (2004). Molecular mechanisms of DrICE inhibition by DIAP1\nand removal of inhibition by Reaper, Hid, and Grim. Nat. Mol. Struct. Biol. 11(5): 4208."
    },
    {
      "category": "Resource",
      "title": "stafford_prop.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/f46a74774b71c9b9a6af5325ca99733b_stafford_prop.pdf",
      "content": "Caspases Downstream of DIAP1 in Drosophila S2 Cells: In What Order are They Activated\nand What Role Does the Proteasome Play in Their Degradation?\nKate Stafford and Colin Chu\nSpecific Aims\nSA1. Determine which of the seven identified Drosophila caspase genes are expressed in\nDrosophila melanogaster S2 cells.\nSA2. Identify which of the expressed caspases are downstream of DIAP1 in the apoptosis\npathway of S2 cells.\nSA3. Explore the order in which expressed initiator and effector caspases are activated and study\nthe function of proteasomal degradation in regulating the initiator caspase DRONC.\nBackground and Significance\nThe apoptotic pathway is critically dependent on the class of cysteine proteases known as\ncaspases, of which seven have been identified in the Drosophila genome (Kumar and Doumanis,\n2000; see Table 1). Caspases are synthesized as zymogens and activated by proteolysis upon pro\napoptotic signaling. Apical or \"initiator\" caspases primarily activate the downstream \"effector\"\ncaspases whose protease activity is directed toward destruction of cellular machinery. Each\ncaspase has a specific amino acid sequence as its preferred substrate; although caspases may\ncleave related sequences at lower rates, at minimum a distinction can be drawn between initiator\nand effector caspases based on substrate preference (Thornberry et al., 1997). For example, the\ninitiator caspase DRONC is the only Drosophila caspase reported to cleave after the amino acid\nsequences TQTE or IETD (Hawkins et al., 2000), whereas effector caspases generally cleave\nDEVD (Kumar and Doumanis, 2000).\nThe key regulatory protein DIAP1 (Drosophila inhibitor of apoptosis), which can\nfunction as an E3 ubiquitin ligase, blocks the activation of the caspase cascade in non-apoptotic\n\ncells by binding to and ubiquitinating the initiator caspase DRONC (Palaga and Osborne, 2002).\nDIAP1 has also been reported to bind and inhibit DRICE without ubiquitinating it (Yan et al.,\n2004). In apoptotic cells, DIAP1 is itself inhibited by upstream regulatory proteins thought to\ncompete with DRONC for its DIAP1 binding site, thereby preventing DRONC ubiquitination\n(Chai et al., 2003). See Figure 1 for an outline of the pathway.\nFigure 1. The Drosophila apoptosis pathway. Red proteins are pro-apoptotic and green are anti-apoptotic.\nDashed lines represent less well-established interactions. Adapted from Richardson and Kumar 2002.\nAfter removal of DIAP1 inhibition, DRONC recruits the activator protein DARK to form\na structure called an apoptosome, which is specialized for further caspase activation (Martin,\n2002). Alternatively, DARK may be required for early processing of DRONC into its active\nform (Muro et al., 2002). Activated DRONC is capable of activating DRICE, which in turn\ncleaves DRONC and renders it invulnerable to inhibition by DIAP1 (Yan et al., 2004). The\nremaining caspases are less well studied; DCP-1 and DREDD are reported to be expressed in S2\ncells, but DECAY, DAMM, and STRICA are relatively unknown quantities (Kumar and\nDoumanis, 2000). The proposed series of experiments seeks to establish which of the seven\nDrosophila caspases are expressed and function downstream of DIAP1 in S2 cells. Further, we\nintend to explore the sequence in which the expressed caspases are activated and to investigate\nwhether the initiator caspase DRONC is active after ubiquitination but before proteasomal\ndegradation. Knowledge of these key apoptosis parameters as manifested in S2 cells will\nimprove our understanding of the apoptotic pathway in Drosophila.\n\nResearch Design and Methods\nCell Culture and Survival Assays\nDrosophila S2 cells will be cultured in liquid Schneider's media supplemented with\ninactivated fetal calf serum and penicillin-streptomycin to aid in the prevention of bacterial\ncontamination. Cultures will be maintained at 37oC and split once every 3-4 days. All\ntransfections will be performed in six-well plates incubated under the same conditions.\nTransfected cultures will be assayed for cell survival by staining with Trypan Blue, which is\nexcluded from viable cells but taken up by those that are nonviable. Although this assay makes\nno distinction between apoptotic and necrotic cells, a properly maintained culture should have a\nminimal amount of necrosis. Viable cells are counted by visual inspection of a hemacytometer\ngrid with a light microscope.\nIdentification of Expressed Genes\nDNA and mRNA will be extracted from a population of non-apoptotic S2 cells. The\nmRNA will be subjected to two-step reverse transcriptase-PCR (RT-PCR), allowing the isolation\nof a pool of newly synthesized DNA which can be used in multiple PCR reactions aimed at\namplifying different target genes. PCR primers will be designed based on those in the Heidelberg\nRNAi database (Boutros, 2005) for the genes of interest. Results will be visualized on an agarose\ngel in which each lane corresponds to a different gene target; the intensity of a band of\nappropriate size in any lane correlates to the degree to which that gene is expressed.\nName\nFlyBase ID\nName\nFlyBase ID\nDRONC FBgn0026404 DAMM\nFBgn0033659\nDREDD FBgn0020381 STRICA FBgn0033051\nDCP-1\nFBgn0010501 DARK\nFBgn0024252\nDRICE\nFBgn0019972 DIAP1\nFBgn0003691\nDECAY FBgn0028381\nTable 1. Caspases and related regulatory\nproteins identified in the Drosophila\ngenome. Caspases are shown in black; related\nregulatory proteins in blue. Each of the seven\ncaspases will be subjected to gene expression\nanalysis.\n\nThe extracted DNA will serve as one of the several controls necessitated by this\nexperimental design; PCR reactions with the extracted DNA as the template will be performed\nusing the same primer sets as above, thus giving each RT-PCR reaction a corresponding DNA-\nbased control. Failure to produce a band, or the production of a band wildly different in size from\nthat observed for the corresponding RT-PCR, indicates the primers' failure to properly amplify\nthe gene of interest. Amplification by RT-PCR of a gene known to be expressed using known-\ngood primers will serve as a second positive control to confirm the success of the RT step.\nNegative controls not expected to produce a gel band will consist of performing PCR without\nany template, and performing PCR on unprocessed mRNA without an intervening RT step.\nObservation of a band in these lanes would imply contamination of the PCR reagents or mRNA.\nIdentification of Downstream Caspases\nCaspases acting downstream of DIAP1 will be identified by double-knockdown\nexperiments using RNA interference (RNAi; Hannon, 2002). Since knocking down DIAP1 alone\nresults in apoptosis, simultaneously knocking down a required caspase should lead to cell\nsurvival, allowing the identification of the caspases required for apoptosis in S2 cells. RNAi\nprobes directed toward each expressed caspase gene will be designed based on probes in the\nHeidelberg RNAi database (Boutros, 2005) and purchased as dsDNA, on which in vitro\ntranscription will be performed to produce dsRNA suitable for use in transfection.\nThe transfection reagent FuGENE will be used to promote dsRNA uptake by healthy\ncells seeded in a six-well plate to a standard concentration per well. Double transfections may be\nperformed asynchronously to account for differences in protein half-lives; in most cases\ntransfection with dsRNA specific to the target caspase will be performed before the DIAP1\ntransfection to ensure maximal depletion of the caspase. Transfection with dsRNA targeting GFP\n\n- a protein known not to be expressed in S2 cells - will serve as a negative control against the\npossibility that apoptosis might be induced by the transfection procedure itself.\nCells will be assayed with Trypan Blue to determine the extent of apoptosis in a given\nsample. Since the efficacy of RNAi against DIAP1 is known, rescue from apoptosis in a double-\nknockdown sample implies that the targeted caspase is a required component of the apoptosis\npathway in S2 cells. Extensive apoptosis suggests that either the targeted caspase is not\nobligatory for apoptosis, or the caspase gene is not susceptible to RNAi. RT-PCR performed on\nextracts of such cells would reveal the extent to which mRNA for the targeted caspase is present\nand thus distinguish between the two possibilities.\nCaspase Ordering and DRONC Regulation\nThe order of caspase activation in apoptosis is difficult to determine genetically because\nthe caspases all contribute to the same end effect - cell death. However, caspase substrate\nspecificity can be exploited to assign relative upstream and downstream positions. Commercially\navailable activity assays (e.g., BIOMOL Quantipak, AK-004) couple a cleavable peptide\nsubstrate to a p-nitroanilide moiety that is colored only when free in solution. Because solution\ncolor is directly proportional to the number of free pNA molecules, the optical density of a cell-\nfree lysate treated with caspase substrate provides a proxy measure of caspase activity. Used on\ncell lysates prepared from double-knockdown RNAi experiments, caspase activity assays can\ndissect the pathway of caspase activation; for example, if DIAP1 and Caspase A are knocked\ndown and no apoptosis is observed, but Caspase B is active in the cell lysate, one may conclude\nthat Caspase B is upstream of Caspase A. The power of this method is limited by imperfect\ncaspase specificity but should be sufficient to classify caspases as initiators or effectors.\nAdditionally, an RNAi knockout of a selected proteasome subunit (e.g., Wojcik, 2002)\n\nwill be assayed using a substrate specific to the initiator caspase DRONC, which is degraded by\nthe proteasome in non-apoptotic cells. If DRONC is active in proteasome knockouts, the\nhypothesis that it is ordinarily inhibited by ubiquitin-mediated proteasomal degradation is\nsupported. A double knockdown of both DRONC and the proteasome subunit will address the\n(somewhat unlikely) possibility that proteasomal dysfunction itself induces apoptosis via a\ncaspase-independent mechanism.\nA number of controls are required under this experimental paradigm. Testing the optical\ndensity generated by each substrate in a lysate made from non-apoptotic cells accounts for\nbackground protease activity. A peptide-anilide construct that is an unsuitable caspase substrate\nwill serve as the primary negative control. If purified enzymes are available, incubation of each\nexpressed caspase with its preferred substrate will function as a positive control.\n\nReferences\nBoutros M. (2005). GenomeRNAi Drosophila Resources. http://rnai.dkfz.de/\nChai J, Yan N, Huh JR, Wu JW, Li W, Hay BA, and Shi Y. (2003). Molecular mechanism of\nReaper-Grim-Hid-mediated suppression of DIAP1-dependent DRONC ubiquitination.\nNat. Struct. Biol. 10(9): 892-8.\nHannon GJ. (2002). RNA interference. Nature 48: 244-51.\nHawkins CJ, Yoo SJ, Peterson EP, Wang SL, Vernooy SY, Hay BA. (2000). The Drosophila\ncaspase DRONC cleaves following glutamate or aspartate and is regulated by DIAP1,\nHID, and GRIM. J. Biol. Chem. 275(35): 27084-93.\nKumar S and Doumanis J. (2000).The fly caspases. Cell Death Differ. 7: 1039-44.\nMartin SJ. (2002). Destabilizing influences in apoptosis: Sowing the seeds of IAP destruction.\nCell 109: 793-6.\nMuro I, Hay B, and Clem RJ. (2002). The Drosophila DIAP1 protein is required to prevent\naccumulation of a continuously generated, processed form of the apical caspase DRONC.\nJ. Biol. Chem. 277(51): 49644-50.\nPalaga T and Osborne B. (2002). The 3 D's of apoptosis: Death, degradation, and DIAPs. Nat.\nCell Biol. 4: E149-51.\nRichardson H and Kumar S. (2002). Death to flies: Drosophila as a model system to study\nprogrammed cell death. J. Immunol. Methods 265: 21-38.\nThornberry NA, Rano TA, Peterson EP, Rasper DM, Timkey T, Garcia-Calvo M, Houtzager\nVM, Nordstrom PA, Roy S, Vaillancourt JP, Chapman KT, and Nicholson DW. (1997).\nA combinatorial approach defines specificities of members of the caspase family and\ngranzyme B. Functional relationships established for key mediators of apoptosis. J. Biol.\nChem. 272(29): 17907-11.\n\nWojcik C and DeMartino GN. Analysis of Drosophila 26S proteasome using RNA interference.\nJ. Biol. Chem. 277(8): 6188-97.\nYan N, Wu JW, Chai J, Li W, and Shi Y. (2004). Molecular mechanisms of DrICE inhibition by\nDIAP1 and removal of inhibition by Reaper, Hid, and Grim. Nat. Mol. Struct. Biol.\n11(5): 420-8."
    },
    {
      "category": "Resource",
      "title": "dsrna_soaking.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/753accd849d3c765267c885157923adb_dsrna_soaking.pdf",
      "content": "dsRNA Soaking\nMaterials:\n1) T25 or T75 tissue culture flasks\n2) 6-well tissue culture plates\n3) 15-ml Corning conical tubes\n4) Normal S2 complete medium (S2 containing 10% serum)\n5) S2 medium containing 2%, and15% serum\n6) SFM medium\n7) Trypan Blue (GIBCO, catalog number: 15250-061)\nTime Line:\n\nDay -1\nDay 0\nDay 1\nDay 2\nDay-1: Harvest cells from 3-day culture, and reseed 20x106 in T75 flasks in 10ml S2\ncontaining 2% or 5% serum, 250C overnight;\nDay 0: Soaking\nDay 1: Check viability of the cells\nDay 2: Check viability of the cells\nProtocol:\nDay -1:\n1) Harvest cells into using plastic pipette and pipette 5-6 times gently to remove the\ncells from the bottom of the flask. Visually check the flask to make sure proper\nremoval of the cells. Transfer each flask of cells into two 15-ml conical tubes\n(equally distributed) and take 10μl of cells from one of the tubes using sterile tip\nfor counting.\n2) Spin the cells at 1000 rpm for 5 min. During the time of centrifugation, you can\ndilute the cells in trypan blue and count total number of the cells. (Each tube has\nhalf of the total number of cells)\n3) Remove the supernatant; flick the tube gently to loose up the pellet. Resuspend\none tube of cells in S2 medium containing 2% serum (S2/2%) and the other tube in\nS2/10% to have final 10x 106 cells/ml.\n4) Label two T75 flasks with S2/2% or S2/10%, and add 8ml of S2/2% medium or\nS2/10% medium respectively. Then transfer 2ml of cell suspension to each of the\nflask (2% to 2%, and 10% to 10%, do not mix it up). Now you have two flasks,\neach contains 20 x 106 cells in 10ml of medium. You will keep the cells in 10%\nserum as your stock flask for future experiment, and the cells in 2% serum as your\nexperimental flask for tomorrow's dsRNA soaking.\nNote: Generally, you should have enough cells for 10 wells (in 6-well plate) for your\nsoaking experiment from each flask you are seeding today.\n\nDay 0: dsRNA Soaking\nNote: Before setting up the experiment, take SFM and S2 containing15% serum\n(S2/15%) out of the refrigerate and warm up to room temperature in the water\nbath. Dilute dsRNA to 2.5μg/μl in DEPC-H2O and keep on ice.\n1) Harvest cells from S2/2% flask into 15-ml conical tube as described above, spin\ndown at 1000rpm for 5min.\n2) Remove the supernatant, and flick the tube. Add 10ml of SFM and pipette up and\ndown twice to resuspend the cells. Spin down again and remove the supernatant.\n3) Resuspend the cells in 5ml of SFM, and take 10μl of cell suspension using sterile\ntip and count the cells. After you have the total cell number, re-adjust your cell\nsuspension using SFM to have final 2 x 106 cells/ml.\n4) Using P1000 and sterile pipette tips, seed 1ml of the adjusted cell suspension into\neach well of the 6-well plate. Therefore, each well contains 2x106 cells in 1ml.\n5) Add dsRNA to each well directly in the cell suspension -- use P20 to dispend 2μl\nto have final 5μg of dsRNA. (You may change the amount of RNA you want to\ntreat your cells with.) After finish with one plate, rock the plate sideways at least\n5 times each side to mix and do NOT swirl.\n6) Return the cells (plate) to the incubator for 1hr.\n7) Take the plate out of the incubator, add 2ml of S2 containing 15% serum to each\nwell using sterile 10-ml pipette. Again, rock the plate to mix, and the final serum\nconcentration in each well is 10%. Incubate overnight.\nNote: You want to count the cells after one wash in SFM. The reason is that cells\nstick to the plastic when there is no serum/protein around and you may loose\nsome cells during SFM washing. Therefore counting cells before washing will\nnot be accurate.\nDay1 and Day 2: Check the viability of the cells\nNote: Make sure you look at your cells under microscope before harvesting them\nand write down your observations. Generally this visual check gives good idea\nhow your experiment worked.\n1) After staring at your cells under microscope ☺, harvest cells by pipetting up and\ndown for at least 6 times using 5-ml plastic pipette. The cells stick to the bottom\nof the plate a little bit so you want to either look under the microscope or just hold\nthe bottom of the plate against light to see if you have harvested all the cells.\nNote: When you hold the plate against light, the cells still attached to the plate will\nshow up as some sort of cloudy stuff. Check with your TAs if you are not sure.\n2) Spin the cells down at 1000rpm for 5min, remove the supernatant, and resuspend\nin 1 or 2ml of complete S2 medium. Count live cells using trypan blue exclusion."
    },
    {
      "category": "Resource",
      "title": "dsrna_transfecti.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/c7e8541d3b6eef60804b19c2158fe15b_dsrna_transfecti.pdf",
      "content": "dsRNA transfection (serum starvation protocol)\nMaterials:\n6-well plates\n15 ml Corning conical tubes\n*Use cells that have been split the day before.\n1.) Harvest cells as above.\n2.) Count cells.\n3.) For a 6-well plate, seed 1 million cells in each well. Determine # of cells needed\nfor each experiment and aliquot as appropriate.\n4.) Spin cells down @ 1000 rpm for 3 min in 15 ml polypropylene tube.\n5.) Aspirate supernatant.\n6.) Resuspend cells to 106 cells/ml in Serum Free Media (SFM).\n7.) Aliquot 1 ml of cell suspension into each well of a 6 well plate.\n8.) Add the RNA. For initial time course experiment, use 20 ug of DIAP1 RNA. A\ntitration of DIAP1 dsRNA will be done to determine the ideal amount of RNA to add\nto the cells.\n9.) Serum starve cells by leaving cells in SFM for 1 Hour.\n10.) Add back 2 ml of normal media (15% serum, so that final [serum] is 10%.\n11.) Analyze the cells for initial DIAP1 experiment at 24 hours, 48 hours and 72\nhours after transfection and determine the amount of cell death as assayed by trypan\nblue staining.\nNotes\n- Speed number 4 on the floor centrifuge in the tissue culture room corresponds to 1000\nRPM."
    },
    {
      "category": "Resource",
      "title": "exp_design.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/79d442214cebecbd7f6e6aef9e5182c2_exp_design.pdf",
      "content": "Experimental Design\nExperiment\nFunction:\nnoun, transitive verb\nEtymology:\nMiddle English, from Middle French, from Latin experimentum, from\nexperiri\nDate: 14th century\nUsage: (a) test, trial (b) a tentative procedure or policy (c) an operation carried out under\ncontrolled conditions in order to discover an unknown effect or law, to test or establish a\nhypothesis, or to illustrate a known\n(source: Merriam-Webster dictionary)\nBefore you start designing an experiment, you need to:\n-ask a specific question\n-make a hypothesis\nIt may be helpful to write them down. A good experimental design starts from being able to\narticulate the motive of your test.\nThings to consider when designing an experiment:\n1) Decide on the parameter you want to change.\nThis is the independent variable, the effect of which is what you are interested in.\n2) Decide what parameter to measure.\nThis is the dependent variable.\n3) Decide what parameters to keep constant so they won't affect your results\n4) Plan out how you change the independent variable\nWhat values do I test?\n- You can do a literature search to determine a reasonable test range. One place to\nstart is to pick the lowest, average, and highest values. You can refine the range\nlater. Think about how many values you need to (and be able to) test. How you\nspace them would depend on the degree of linearity of the relationship.\n5) Include controls in your experiment\nControls set reference points to compare data against.\nNegative control:\n- A factor known to have no effect on the parameter you measure.\n- Purpose is to determine the baseline of your measures.\n\nPositive control:\n- a factor known to cause a change in what you measure\n- Purpose is to confirm your protocol works.\n6) Decide how many replicates you need\nExperimental results should be reproducible. Decide the number of times you need to\nrepeat the experiment to obtain statistically significant results.\n7) Determine the reagents and equipment you need. Check their availability.\nYou may need to place an order or sign up for equipment in advance. So plan ahead.\nFor example:\nYou want to find out if your favorite gene (Yfg) is involved in apoptosis after DNA damage.\nYou may want to ask: does X-irradiation lead to Yfg-induced apoptosis?\nYou may make this guess: if Yfg is knocked down with RNAi in S2 cells, fewer cells will die\nafter X-irradiation.\nOne way to set up your experiment:\nIndependent variable: amount of X-irradiation\nDependent variable: amount of cell death\nConstants: time, amount of starting cells, amount of dsRNA against Yfg etc..\nNegative control: dsRNA against GFP\nPositive control: dsRNA against caspase"
    },
    {
      "category": "Resource",
      "title": "fungene.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/a74a81d7646c57a63597e16e761e14c2_fungene.pdf",
      "content": "RNAi - dsRNA Transfection using FuGENE 6\nMaterials:\n6-well plates or 3cm dishes\n15ml conical tubes\nsterile Eppendorf tubes\nFuGENE 6 Transfection Reagent* (Roche, Cat # 1 814 443)\n* FuGENE 6 is a multi-component lipid-based transfection reagent that complexes with and transports\nDNA into the cell during transfection.\nA) Preparation of cells for transfection\nUse cells that are healthy and proliferating well.\n1) Tap the flask to loosen cells from the surface. Harvest cells by pipetting up and\ndown 10X.\n2) Set aside a small aliquot of cells for counting.\n3) Collect remaining cells in a 15ml conical tube. Note the volume of cells.\n4) Determine the number of cells in the conical tube.\n5) Centrifuge cells in the conical tube at 1000rpm for 3-5min (setting 4 on\ncentrifuge)\n6) Aspirate supernatant using sterile Pasteur pipette\n7) Resuspend to 106 cells/ml in S2 medium with 10% serum. Pipette up and down\n10X.\n8) For a 6-well plate, seed 2 million cells into each well by adding 2ml of cell\nsuspension with a 2ml pipette.\nB) Preparation of FuGENE-RNA complex\nGeneral notes:\n-Do not allow the undiluted FuGENE reagent to come into contact with any\nplastic surface other than the pipette tip.\n-Always use more FuGENE reagent (μl volume) than RNA (μg mass)\n-A ratio of 3μl FuGENE to 1-2μg RNA works well in S2 cells\n-3 uL of FuGENE with 2 uL of dsRNA at a concentration of 1ug/uL is ideal\n-For co-transfection experiments, if the total amount of RNA exceeds 2μg,\nincrease the amount of FuGENE proportionally.\n1) Based on the table on the following page, determine the volume of each\ncomponent to use. It may be necessary to dilute your dsRNA for accurate\npipetting. If so, dilute dsRNA in DEPC-treated water or nuclease-free water. Do\nnot use a volume of more than 15μl of dsRNA.\n2) (Optional) To transfect multiple wells with the same set of components, determine\nthe volume required to make a master mix. If you have n well, prepare a mix\nenough for n+0.5 wells.\n\n3) Mix the following components in the tissue culture hood. Note that the order of\naddition is critical.\nStep\nComponent\nAmount\nNote\nI\nSerum-Free Medium (SFM)\nX μl to a total\nof 100 μl\nSFM must be pipetted into the\ntube first\nII\nFuGENE 6 Transfection\nReagent\n3 μl\nAdd FuGENE directly into the\nmedium. Tap gently to mix.\nIII\ndsRNA\n0-2μg\nUse a total volume between 0-\n15μl.\n9) Tap the Eppendorf tube gently to mix contents.\n10) Incubate for 20 min at room temperature.\n11) When you finish, check that the cap of the FuGENE bottle is closed tightly.\nC) Transfection of cells\n1) After 20 minute of incubation, gently tap the Eppendorf tube to mix contents.\n2) Dropwise, add FuGENE:RNA mixture to cells.\n3) Gently rock the plate to ensure even dispersal of Fugene:RNA mixture.\n4) Return plate to the incubator."
    },
    {
      "category": "Resource",
      "title": "good_culture.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/bf25b223f2eb0bc41df3690836b821b2_good_culture.pdf",
      "content": "Good Tissue Culture Room Practice\n- Place long pipettes into sharps container on their side so they are laid flat! This\nsaves on space. After you are done using the hood, please shake the sharps\ncontainer to settle the contents.\n- Make sure before using the hood that the vacuum trap is not full. If it is, empty\nout into the sink, rinse with water, and refill with enough bleach (under the sink)\nto cover the bottom.\n- After you finish your tissue culture work, empty the sharps beaker in the hood\ninto the biohazard sharps container.\n- No non-sharps waste in the sharp container such as kimwipes, flasks, tubes, etc.\n- Inform the TA's immediately if you observe anything unusual with your cells.\nThey may be contaminated.\n- Contaminated cells should not be put back into the incubator and should be\nremoved from the tissue culture room. Bleach them in the main lab and then\ndump them down the sink. Log down the date and nature of the contamination,\nand inform the TA's.\n- Make sure the latch to the inner glass door of the incubator is closed properly."
    },
    {
      "category": "Resource",
      "title": "in_vitro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/1d8bf9e61870698eb25bec63ad827c02_in_vitro.pdf",
      "content": "In vitro Transcription\nIn Vitro Transcription Reaction (using Ambion Megascript kit)\nNote: Wear gloves all the time. Take precaution not to contaminate with RNase - do not\ntouch your face with gloved hands, do not spit in the tubes...\nImportant: Make all solutions with DEPC-treated water!\n1) Thaw the frozen reagents (or aliquots of)\nPlace RNA Polymerase Enzyme Mix on ice;\nWarm 4 nucleotide solutions (ATP, CTP, GTP and UTP) quickly in your hands\n(wearing gloves) until they are completely in solution, keep on ice;\nVortex the 10x reaction buffer until it is completely thawed, and keep it at room\ntemperature while assembling reaction. Note that the reaction buffer contains a\nprecipitate that needs to fully dissolve before the reaction is set up. Make sure to\nassemble the reaction at room temperature so that the solute in the reaction buffer\ndoes not precipitate out.\n2) Adjust DNA template in DEPC-treated ddH2O to final concentration of 0.5 μg/μl.\nThe DNA clones coming from OpenBiosystems are 0.5 μg/μl, so you do NOT\nneed to adjust.\n3) Add in the following order to assemble the transcription reaction.\nDEPC-ddH2O\n14 μl\n10X buffer\n4 μl\nATP\n\nμl\nGTP\n\nμl\nCTP\n\nμl\nUTP\n\nμl\nDNA\n2 μl\nT7 Polymerase\n4 μl\n\nTotal Volume:\n40 μl\nGently flick the tube or pipette the mixture up and down gently and then\nmicrofuge tube briefly (2-3 seconds) to collect the reaction mixture at the bottom\nof the tube.\nNote: This reaction setup is recommended when the RNA produced will be\ngreater than/equal to 0.5 kb in length.\n4) Incubate at 370C for 2 hours or overnight (up to 24 hrs).\n\nNote: Optimal incubation time will vary depending on size/transcriptional\nefficiency of your template. For short transcripts, a longer incubation time might\nbe advantageous.\nLiCl2 precipitation to purify dsRNA\n1) Add 30ul of DEPC treated water to the 40ul IVT reaction\n2) Add 25ul of the LiCl2 ppt solution\n3) Mix thoroughly and place the tube at -20 degrees for 30min-overnight\n4) Spin for 15min in a table-top centrifuge at 13000rpm at 4 degrees (there are\ncentrifuges in the cold room)\n5) Carefully pipette off LiCl2 solution to leave RNA pellet (pellet will be clear and\nslippery so be careful)\n6) Add 1ml of 70% ethanol to wash the pellet\n7) Spin for 15min in a table-top centrifuge at 13000rpm at 4 degrees\n8) Carefully pipette off ethanol without disrupting clear RNA pellet\n9) Let tube sit on a clean kimwipe and air dry for 30 minutes or until no residual\nethanol remains on the side of the tube (Check with your TA to make sure that\nyour pellet is dry)\n10) Resuspend the RNA pellet in 40ul of DEPC treated water\n11) Anneal RNA strands by heating to 65 degrees for 30 minutes in a table-top heat\nblock\n12) Let the RNA cool off slowly to room temperature by removing the block\ncontaining the tube of RNA from the heating element\n13) Determine the optical density of the RNA (A260) by diluting the RNA 1:100 in\nDEPC-treated water (the cuvette should hold 100ul total volume)\n14) Calculate dsRNA concentration using the following formula:\nA260 x dilution factor (100) x 50ug/ml = the concentration of your RNA\n15) Dilute your RNA to a concentration of 1ug/ul (if your RNA is less concentrated\nthan 1ug/ul, ethanol precipitate your RNA and resuspend in a smaller volume of\nDEPC treated water.)\nEthanol precipitation of RNA (to make your RNA more concentrated)\n1) Add 1/10th volume of 3M Sodium Acetate pH5.2 (in DEPC treated water) to your\nsample\n2) Add 2.5x volumes of cold (-20 degrees) 100% ethanol to your sample and mix\nthoroughly\n3) Put tube at -20 degrees for 15min-overnight\n4) Spin 15min in a table-top centrifuge at 13000rpm at 4 degrees\n5) Pipette off the ethanol and let the tube sit upside down with the lid open on a piece\nof clean Kimwipe to let air dry for 30min ad make sure there is no residual ethanol\non the side of the tube (check with your TAs to make sure the pellet looks dry)\n6) Resuspend RNA pellet in a volume of DEPC treated water such that the RNA\nconcentration will be greater than 1ug/ul\n\nRun 1% agarose gel to confirm and ensure proper annealing\n1) Dilute TAE Buffer from 10x stock\n80 mL TAE buffer\n720 mL distilled water, mix well\n2) Making a 1% Agarose Gel\n0.5g agarose\n50 mL 1x TAE buffer\nHeat 1 minute 20 seconds in the microwave\nLet it cool and add 2.5 μl of 10mg/ml Ethedium bromide (in the chemical hood).\nPlace the gel plate in the running apparatus with the rubber-banded sides in tight\ncontact with the sides of the apparatus to prevent leaking. Put the combs in. Then\npour agarose into the gel plates, let it solidify without disturbing.\nAfter the gel is solidified, pour 1x TAE in the running apparatus till the buffer\ncovers the agarose gel.\nCaution: Ethidium Bromide is a carcinogen, so be sure to wear gloves and\ndispose pipette tips containing ethidium bromide in designated container!\n3) Loading the Gel\nAdd 1 uL 10x loading dye and 1 uL of RNA sample to 8 uL of DEPC-treated\nwater, heat at 650C for 5 minutes.\nLoad your RNA sample carefully and do not poke a hole at the bottom of the well.\nLet the gels run for 30-45 minutes from negative to positive. (Check with your\nTAs about the voltage. Generally, for the small apparatus, you can run at\n70-80V).\n4) Examining the Gels\nPlace the gel on the UV transilluminator and look for orangish, pink bands of\nRNA. There should be no bands visible in the extraction control lane or the PCR\ncontrol lane. Record all of your observations on the gel map. Take a picture of\nthe gel to use in the lab. Once you are done with the gel, dispose of it in\ndesignated container."
    },
    {
      "category": "Resource",
      "title": "informatics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/9e422cfc05a07160fb051b0f60c05b43_informatics.pdf",
      "content": "Basic Bioinformatics\nPurpose of this protocol: From your literature reading, you might find proteins from\nother model systems (for example mouse) that have known roles in apoptosis, either\nupstream or downstream of IAPs. You will need to find out:\nA Search GenBank for the mammalian gene(s) mentioned in the literature, get the\nGenBank accession numbers of these genes;\nB Search FlyBase to identify Drosophila homologs and to find out more information\non these genes - CG number of the gene, coding and 5' and 3'-UTR sequences,\nand other information on the function of this gene. Also find out if it has\nalternative isoforms;\nC Search OpenBiosystems to find out if they carry RNAi clones of these genes, and\nget the clone ID and catalog number;\nThis protocol has three sections, to answer the above three questions.\nPart A: Find genes in GenBank by name.\n1) Go to NCBI website: http://www.ncbi.nlm.nih.gov/ . Under \"Search\", select\n\"Nucleotide\" and type in the gene name and species that you want to search for.\nUse Booleans, and tags which you can find at the PubMed help page:\nhttp://www.ncbi.nlm.nih.gov/entrez/query/static/help/pmhelp.html#SearchFieldD\nescriptionsandTags\nIf you know the author who published the paper on the gene you are interested,\nyou can also include the author name in your search along with the gene name\nand species.\nNote: You will usually get more than one result. Read the title of each to screen\nout the ones that are obviously not what you are looking for. Then click on the\naccession number and read more details to see if the gene is what you want.\n2) Once you are at the page showing the gene sequence, there are several things you\nshould pay attention to:\nThe general output: from top to bottom, the page shows general description of the\ngene such as which organism, the authors and titles of the literature references\nlisted, the translated protein sequence of this gene, and the gene sequence.\nSome specific things you should notice:\nAccession Number (write that down, you will need it later);\nPubmed and Medline reference numbers (also author, journal name and title):\nclick on them to double check this is the gene you are looking for;\nUnder \"Features\", you will find \"CDS\" and number to the right of it. Say the\nnumber is \"172...1853\". This means the open reading frame (coding sequence)\nstarts from 172 and ends at 1853 from the nucleic acid sequence given below;\n\nYou should save this page (can be .doc or .txt file) and keep one printout of this\npage for later reference.\n3) Get the protein sequence of this gene, copy and paste and save the sequence (do a\ngood annotation in your .doc or .txt file, so that you can always go back and find\nout what exactly you are looking at.\nPart B: Do BLAST search to find Drosophila homolog of this gene and get more\ninformation on the gene.\n1) Open a new browser window, and go to the FlyBase website:\nhttp://www.flybase.org/. In the middle of this page, you will see the big blue\n\"BLAST\" sequence search, click on it.\n2) Search Flybase using:\nDrosophila melanogaster (euchromatin, rel. 4.0)\nFeature type: predicted gene (NT)\nProgram: tblastn\n3) Paste your protein sequence and hit search, then wait (patiently.........)\n4) On the next page, the hits are color coded from weak (black) to strong (red), and\nsorted by strength of homolog from strong to weak. Look at E values - Hits with\nE-value <1e-6 are significant. If you do not see any hit with E<1e-6, you can\nmove on to another gene.\nOtherwise, choose the strongest hit which has a FlyBase link (FBgn##), click on\nit.\n5) This page gives you a brief report of the gene, including genomic organization,\ngene product, gene ontology, expression and phenotype, and finally a summary of\nthe gene. Read through the brief summary and make sure it makes sense to you.\nThe top right side of this page shows the FlyBase ID, write that down. Under\n\"Gene Product\", you can get complete coding region sequence with coding\nsequence highlighted in red, and 5' and 3' UTR sequence in blue. Save the\nsequence in word or plain text (does not matter) but make sure you highlight each\nof these regions so you can go back and find them. It is important when you\ndesign primers for RT-PCR to detect whether S2 cells express this gene.\nOn the right hand side, the inset gives you available reports on this particular\ngene. Click on Abridged report or full report, it brings you to the next page,\nwhich will give you CG symbols. Also on this page, you can get protein\nsequence from Swiss-Prot, as well as domain information within this protein.\n\nPart C: Search OpenBiosystems to find if they carry RNAi clones of these genes, and get\nthe clone ID and catalog number.\n1) Go to http://www.openbiosystems.com , click on Drosophila RNAi collection,\nand download their current RNAi collection in .xls Excel format.\n2) Open the file in Excel. With the CG number you searched from FlyBase, and/or\nwith FlyBase ID number, you can search and find the catalog number from the\nfile."
    },
    {
      "category": "Resource",
      "title": "lab_notebook.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/b4c64ac11fc0a68466af7e025e29bf3e_lab_notebook.pdf",
      "content": "Guidelines for Keeping a Laboratory Notebook\nPurpose of Notebook\n- To record methods and results of your experiments so that\n-you can go back and figure out what you did\n-another person can interpret your results\n(The lab notebook is important in patent review)\n- Therefore, a notebook must be clear and thorough\nOwnership\n- Generally, the notebook should not leave the laboratory\n- The notebook belongs to the lab and institution\nType and Format of Notebook\n1. Bound vs. Loose Leaf\nAdvantages\nDisadvantages\nBound\nNo lost sheets\nNo logical order\nProof against fraud\nLoose Leaf\nGroup experiments\nSheets lost\nMaintain order\nHarder to prove authenticity\n- The bound notebook is the gold standard and will be adopted in our laboratory\n- What to look for in a bound notebook:\n- Bound\n- 8-1/2 x 11\" (Able to attach photographs & printouts)\n- Numbered pages\n- Gridded pages\n2. Ink not Pencil & Mistakes\n- Ballpoint pen with black ink is best\n- Pencil writing can be erased (harder to prove authenticity)\n- Write legibly\n- Mistakes? Cross them out with a single line. White-Out and blacking out is not\nacceptable.\nContent of the Laboratory Notebook\n1. Table of Contents\n- Title\n- Date\n- Page Number\n2. Date of Experiment\n\n3. Title of Experiment (e.g., Serial knock-down of DIAP1 by RNAi)\n4. Purpose (e.g. To determine the relationship between the amount of RNA- used against\nDIAP1 and the amount of cell death.)\n5. Materials and Methods\n- Protocol\n- Written\n- Pasted\n- May refer to previous protocol in notebook (note any changes)\n- Write before you begin procedure\n- Amend as you go through the experiment\n- List any calculations\n6. Observations and Results\n- Everything that happens or doesn't happen is data.\n- Any writing that will facilitate data entry should be planned out in advance\n- Results may include:\n- Tables\n- Charts\n- Graphs\n- Printouts\n- Pictures\n- Gels\n- Films\n- Calculations\n7. Discussion and Conclusion\n- Discuss results and implications of data.\n- Prepare a conclusion. How did the experiment go?\n- What to do next?\nMaintenance\n1. Record everything ASAP\n2. Weekly Check-Up\n3. Attach data/printout/films\n4. Create tables and graphs\n5. Summary for the Week\n6. Record experiment in Table of Contents\n7. Make plan for the following week"
    },
    {
      "category": "Resource",
      "title": "rt_pcr_1step.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/19d218bbbc42726eab36e4e90a3ab68e_rt_pcr_1step.pdf",
      "content": "One-Step RT-PCR\nReagents:\nRETROscriptTM kit from Ambion, Catalogue # 1710\n-Reverse Transcriptase M-MLV-RT (100 units/μl)\n-10X PCR Buffer (100 mM Tris-HCl, pH 8.3, 500 mM KCl, 15 mM MgCl2)\n-Random decamers (50μM)\n-dNTP (2.5mM each dNTP)\n-RNase Inhibitor (10 units/μl)\nTaq polymerase: from Invitrogen, Catalogue #: 10342-020 (5U/μl)\nNotes: Use small 0.25ml PCR tubes supplied by your TAs\nWear gloves at all times to avoid RNase contamination\nBefore you start:\n- Thaw 10x reaction buffer, random decamers, and dNTP mix quickly in your\nhands and place ON ICE;\n- Place RNase Inhibitor and Reverse Transcriptase (M-MLV-RT) ON ICE\ndirectly from the box\n- Prepare working primer stock solution as described in the two-step RT-PCR\nprotocol\nThere should be two negative controls among the PCRs.\nI. The minus-RT control from the previous step, or alternatively, untreated RNA can\nsimply be subjected to PCR.\nII. A minus-template PCR. It should have all the PCR components, but use water as\ntemplate instead of an aliquot of the cDNA (RT reaction). This control will verify\nthat none of the PCR reagents are contaminated with DNA.\nPositive Control\nI.\nPerform PCR to amplify a cDNA that corresponds to a basal/housekeeping\ntranscript, e.g., ribosomal protein S17 (RpS17). The TA's will provide each\nteam with RpS17 primers. For your reference, these are the primer sequences:\nForward RpS17: 5' - cga acc aag acg gtg aag aag - 3'\nReverse RpS17: 5' - cct gca act tga tgg aga tac c - 3'\nExpected RT-PCR product size: 211bp\nThe primers are located on different exons that are separated by a 59bp intron.\nIf genomic DNA is amplified, the product size would be 270bp.\nII.\nUse genomic DNA isolated from S2 cells as template. If your primers span\nintron(s), note the size of the expected PCR product and if necessary, adjust\nannealing temperature of the PCR program.\n\nThe components needed for each reaction are outlined in the following table:\nComponent\nStock\nconc\nFinal\namount\nExperiment\nNeg Control 1\n(-RT in step\n1)\nNeg Control 2\n(no template)\nTotal RNA\n~1-2 μg\n~1-2 μg\nAmbion 10X PCR\nBuffer (with\nMg2+)*\n10X\n1X\n10 μl\n10 μl\n10 μl\ndNTP mix\n2.5mM 0.16mM\n6.5 μl\n6.5 μl\n6.5 μl\nRandom Decamers\n50μM\n5μM\n2 μl\n2 μl\n2 μl\nForward PCR\nprimer\n5μM\n0.25μM\n5 μl\n5 μl\n5 μl\nReverse PCR\nprimer\n5μM\n0.25μM\n5 μl\n5 μl\n5 μl\nRNase Inhibitor\n10U/μl\n10U\n1 μl\n1 μl\n1 μl\nTaq polymerase\n5U/μl\n2U\n0.4 μl\n0.4 μl\n0.4 μl\nReverse\nTranscriptase\n100U\n/μl\n100U\n1 μl\n1 μl\nNuclease-free water\nVariable\nVariable\nVariable\nTotal Volume\n100 μl\n100 μl\n100 μl\n*Use the 10X PCR Buffer in the Ambion Retroscript kit. This buffer contains 15mM MgCl2.\nMaking a Master Mix:\nConsider making a master mix if you are testing multiple sets of primers at once. A master\nmix will contain everything except the PCR primers. If you are testing n sets of primers, make\na master mix enough for n+1 tests.\nMix the components gently but thoroughly. Aliquot 90μl of your master mix to each tube.\nAdd 5μl of each the appropriate primer.\nMaster Mixes:\nComponent\nExperiment\nNeg Control 1\n(-RT in step 1)\nNeg Control 2\n(no template)\nTotal RNA\n~1-2 *(n+1) μg\n~1-2*(n+1) μg\nAmbion 10X PCR Buffer\n10 *(n+1) μl\n10*(n+1) μl\n10 *(n+1) μl\ndNTP mix\n6.5 *(n+1) μl\n6.5 *(n+1) μl\n6.5*(n+1) μl\nRandom Decamers\n2*(n+1) μl\n2*(n+1) μl\n2*(n+1) μl\nRNase Inhibitor\n1 *(n+1) μl\n1 *(n+1) μl\n1*(n+1) μl\nTaq polymerase\n0.4 *(n+1) μl\n0.4 *(n+1) μl\n0.4*(n+1) μl\nReverse Transcriptase\n1*(n+1) μl\n1*(n+1) μl\nNuclease-free water\nVariable\nVariable\nvariable\nTotal Volume\n100 *(n+1) μl\n100*(n+1) μl\n100*(n+1) μl\n\nAssemble reactions on ice.\nIncubate in Thermacycler at:\n1) 44°C for 1 hr for reverse transcription\n2) 94°C for 5 min to inactivate the RT and denature reaction product\n3) 94°C for 30 sec to denature strands\n4) 55°C for 30 sec to anneal strands**\n5) 72°C for 45 sec to extend***\n6) repeat steps 3 to 5, 29 more times\n7) 72°C for 5 min for a final extension\n** Start with the annealing temperature suggested by your primer design software, usually use (Tm-5) 0C.\nAn annealing temperature of ~55°C used with the cycling times shown\nmay be a reasonable starting point, but the optimal temperature and cycling\ntimes for your PCR may need to be determined empirically.\n*** The rule of thumb is to extend for 1 min per kb of target in the PCR cycle.\nRun 10 μl of your reaction on 1-1.5% Agarose gel to check the PCR product."
    },
    {
      "category": "Resource",
      "title": "rneasy_s2rna.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-16-experimental-molecular-biology-biotechnology-ii-spring-2005/da3e401e53efd39a9b5319e87a4ef258_rneasy_s2rna.pdf",
      "content": "Rneasy Prep of S2 RNA\n1. Prepare fresh Buffer RLT by adding 7ul BME to 700ul Buffer RLT. (Wear\ngloves, work in the hood and be careful when adding the BME)\n2. Pipet 10 million cells into an epindorf tube and spin in the micro centrifuge\nfor 5 min at the lowest rpm. (be sure to balance the centrifuge for all spin\nsteps)\n3. Discard supernatant.\n4. Add 600ul Buffer RLT and pipet up and down a few times to mix and\nhomogenize the cells.\n5. Add 600ul 70% ethanol and pipet up and down to mix.\n6. Apply 600ul of sample to Rneasy mini column placed in a 2 ml collection\ntube, close the tube and centrifuge for 15 sec at 10,000 rpm. Discard the\nflowthrough.\n7. Repeat step 6 with rest of sample in same column.\n8. Add 700ul Buffer RW1to the column. Close the tube and centrifuge for 15\nsec at 10,000 rpm.\n9. Transfer the column to a new 2ml collection tube.\n10. Apply 500ul Buffer RPE onto the column. Close the tube and centrifuge for\n15 sec at 10,000 rpm. Discard the flowthrough.\n11. Add another 500ul Buffer RPE to the column. Close the tube and centrifuge\nfor 2 min at 10,000 rpm.\n12. Place the column in a new 2 ml collection tube and discard the old collection\ntube. Centrifuge at full speed for 1 min.\n13. Transfer the column to a 1.5 ml collection tube.\n14. Pipet 50ul Rnase free water directly onto column membrane (without\ntouching the membrane). Close the tube, centrifuge for 1 min at 10,000.\n15. Repeat step 14 using the same collection tube.\n16. Spec your RNA and store at -20."
    }
  ]
}