{
  "course_name": "Experimental Molecular Neurobiology",
  "course_description": "Designed for students without previous experience in techniques of cellular and molecular biology, this class teaches basic experimental techniques in cellular and molecular neurobiology. Experimental approaches covered include tissue culture of neuronal cell lines, dissection and culture of brain cells, DNA manipulation, synaptic protein analysis, immunocytochemistry, and fluorescent microscopy.",
  "topics": [
    "Science",
    "Biology",
    "Molecular Biology",
    "Neurobiology",
    "Cognitive Science",
    "Science",
    "Biology",
    "Molecular Biology",
    "Neurobiology",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nLabs: 1 session / week, 4 hour / session\n\nGeneral Course Information\n\nThis course is divided into two main components:\n\nWet Lab Sessions\n\nLabs will progress linearly in order for the class to acquire basic laboratory skills relevant to molecular neurobiology. Our goal in this class is for each student to learn enough molecular skills to be able to perform experiments successfully in future settings.\n\nEach week we will begin class with a brief overview of the technique covered that day. We will then employ this experimental technique for the remainder of the class period.\n\nPaper Presentations\n\nEach week we will review one paper that elaborates on ideas and techniques that are pertinent to the molecular neuroscience topic of that week.\n\nWe will randomly select three to four students to each present a specific figure from that paper. In addition students will also utilize these figures to discuss the general molecular technique used to collect the figure data and to explain how this technique applies to the paper overall.\n\nEach student will present figures from two papers this semester.\n\nWriting\n\nStudents will have many opportunities to write this semester, for this course fulfills one of the CI-M requirements for course 9 majors.\n\nPaper Questions - Assigned each Week\n\nProfessors Lois and Hayashi will provide the class with six to eight specific questions related to a presentation paper. Students will receive these questions after each presentation and will have one week to answer these questions and to submit these answers for grading.\n\nPresenters and non-presenters alike will have to submit answers to these questions.\n\nReview Essays - Two per Semester\n\nStudents will write a three-page summary and critical review of a scientific paper.\n\nThese essays will be evaluated in two ways. First a scientific writer will analyze the structure, and then the teaching assistant (TA) will analyze the content. The scientific writer will provide feedback that you will use to revise your essay before submitting your paper to the teaching assistant for grading.\n\nLab Reports - Four per Semester\n\nStudents will write a brief (two page) lab report using data collected in the wet lab. These papers can use data from one or many lab weeks, depending on the topics covered.\n\nLab reports consist of a few basic components.\n\nIntroduction: provides an overview of background related to your experiment, how your experiment fits into this background, and your experimental hypothesis for the paper.\n\nMethods: describes techniques/methods used in an experiment and how one collects data from the experiment.\n\nResults: describes the outcome of the experiment using text and figures.\n\nDiscussion: relates the experimental results to the hypothesis and to the overall field of research and explains experiment outcomes, errors, and future directions.\n\nAdditional Information\n\nLaboratory Notebooks\n\nWe will provide students with laboratory notebooks. In the course of performing experiments, you will learn how to properly record methods and data. In general, your lab notebook should be self-explanatory. That is, the notebook should be complete and well organized so that others could use it to accurately repeat your experiments.\n\nWe will periodically evaluate and grade your notebook for content, presentation and organization in order to help you to learn these record-keeping techniques.\n\nPresentations\n\nEach student will have two opportunities to give oral presentations this semester. Figure presentations by each student should last approximately fifteen minutes. We expect students to give computer-based presentations (using Microsoft(r) PowerPoint(r), etc.).\n\nWe will grade you not only on the information that you present, but also on your ability to convey the information. Some points to remember when giving your presentation:\n\nSpeak to your audience; make frequent eye contact.\n\nSpeak slowly, clearly and loudly.\n\nPresent the information on the screen so that it is large enough for all to see it. Typically one has more slides with less text with this method. Remember the common rule of one slide per minute.\n\nAvoid filler words when speaking. Common fillers include, \"um\", \"ah\" and \"like\".\n\nFeel free to contact the teaching assistants or the lab manager for help with any of these points. Practicing in front of a smaller audience can help you when you face a larger one.\n\nParticipation\n\nWe will grade your participation in both the lab sessions and in the presentation sessions.\n\nParticipation in the lab means that you have read and understand the protocol for the week, that you perform your experiments to the best of your ability, and that you are actively learning techniques in the lab.\n\nParticipation in the presentation means that you have read and understand the paper for the week and that you are prepared to answer questions if asked.\n\nEnd of the Year Quiz\n\nIn lieu of a paper presentation the last Wednesday of classes, there will be a class quiz. This quiz will consist of approximately 400 questions given orally in a round-robin manner. We will use this tool to show you all how much information you have acquired over the course of the term.\n\nLab Safety\n\nWhile it is important for you all to learn the molecular techniques that we will teach you this semester, it is equally important that you all are safe while performing these tasks.If you have any questions about lab safety, please contact any of the teaching staff. Additional safety information for this course will not be discussed here, but is placed in the\nlabs\nsection. Please utilize this as a valuable resource.\n\nThe teaching staff will provide all personal protective equipment for students.\n\nRecommended Texts\n\nPrimrose et al.\nPrinciples of Gene Manipulation\n. Oxford, UK: Blackwell Science, 2006. (DNA Recombinant Technology)\n\nAlberts et al.\nMolecular Biology of the Cell\n. Philadelphia, PA: Taylor and Francis, 2002. (Molecular Biology in general)\n\nMartin et al.\nFrom Neuron to Brain\n. Sunderland, MA: Sinauer Associates, Inc., 2000. (Cellular Level Neuroscience in general)\n\nGrading Policy\n\nYour grade for this course will be weighed equally among the following components of the course:\n\nPerformance in Lab\n\nParticipation During Lab and During Presentations\n\nLab Notebook\n\nTwo Presentations\n\nTwo Essays\n\nPaper Questions\n\nFour Lab Reports\n\nWe will provide you with a grade assessment in the middle of the semester. This assessment will give you an opportunity to view your status in the class prior to the end of the year grades.\n\nIf you have any questions about the information found in this overview, please contact any of the teaching staff for this course, especially the faculty.\n\nCalendar\n\nWEEK #\n\nPAPERS DISCUSSED\n\nLAB TOPICS\n\nIntroduction\n\nJulius, David, Amy B. MacDermott, Richard Axel, and Thomas M. Jessel. \"Molecular Characterization of a Funcational cDNA Encoding the Serotonin 1c Receptor.\"\n\nBasic Skills in a Molecular Biology Lab\n\nBuck, Linda, and Richard Axel. \"A Novel Multigene Family May Encode Odorant Receptors: A Molecular Basis for Odor Recognition.\"\n\nSequence Analysis and Vector Design\n\nQuestion and Answer Session\n\nPCR and Digestion\n\nShen, Karen, and Tobias Meyer. \"Dynamic Control of CaMKII Translocation and Localization in Hippocampal Neurons by NMDA Receptor Stimulation.\"\n\nDNA Purification and Subcloning\n\nScheiffele, Peter, Jinhong Fan, Jenny Choih, Richard Fetter, and Tito Serafini. \"Neuroligin Expressed in Nonneuronal Cells Tiggers Presynaptic Development in Contacting Axons.\"\n\nHua, Jackie Yuanyuan, Matthew C. Smear, Herwig Baler, and Stephen J. Smith. \"Regulation of Axon Growth In Vivo by Activity-based Competition.\"\n\nTransformation, Colony pick-up, Miniprep, and Digestion\n\nAntoch, Marina P., Eun-Joo Song, Anne-Marie Change, Martha Hotz Vitaterna, Yaliang Zhao, Lisa D. Wilsbacher, Ashvin M. Sangoram, David P. King, Lawrence H. Pinto, and Joseph S. Takahashi. \"Functional Identification of the Mouse Circadian Clock Gene by Transgenic BAC Rescue.\"\n\nBasic Cell Culture\n\nSerafini, Tito, Timothy E. Kennedy, Michael J. Galko, Christine Mirzayen, Thomas M. Jessell, and Marie Tessler-Lavigne. \"The Netrins Define a Family of Axon Outgrouth-promoting Proteins Homologous to C. elegans UNC-6.\"\n\nPrimary Culture of Neurons from the Brain\n\nGould, Elizabeth, Alison J. Reeves, Michael S. A. Graziano, and Charles G. Gross. \"Neurogenesis in the Neocortex of Adult Primates.\"\n\nKornack, David R., and Pasko Rakic. \"Cell Proliferations without Neurogenesis in Adult Primate Neocortex.\"\n\nSDS-Polyacrylamide Gel Electrophoresis and Western Blotting\n\nMacLauren, R. E., R. A. Pearson, A. MacNeil, R. H. Douglas, T. E. Salt, M. Akimoto, A. Swaroop, J. S. Sowden, and R. R. Ali. \"Retinal Repair by Transplantation of Photoreceptor Precursors.\"\n\nWestern Blotting 2: Detection\n\nDavis, Graeme W., and Corey S. Goodman. \"Synapse Specific control of Synaptic Efficacy at the Terminals of a Single Neuron.\"\n\nBrain Tissue Processing\n\nBrown, Arthur, Paul A. Yates, Patrick Burrola, Dan Ortuno, Ashish Vaidya, Thomas M. Jessell, Samuel L. Pfaff, Dennis D.M. O'Leary, and Greg Lemke. \"Topographic Mapping from the Retina to the Midbrain Is Controlled by Relative but not Absolute Levels of EphA Receptor Signaling.\"",
  "files": [
    {
      "category": "Resource",
      "title": "lab_reports.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/693e41b998e3876db0876a3175c8dc1e_lab_reports.pdf",
      "content": "Writing lab reports for 9.12\nThe aim of the report is to accurately document the procedures that are performed in an\nexperiment so that someone else could reproduce them. It is extremely important to\ninclude all details that might be important for the experiment. On the other hand, do not\noverdo it : discard details that are irrelevant for the experiment. It is fundamental that\nyou include a rationale of why everything is done in the particular way that it is done.\nBecause we have already given the protocol to you, you don't have to \"regurgitate\" that\ninformation. The whole thing should fit in 3-4 pages of text. You can include figures,\nphotographs or printouts in an appendix to illustrate your point.\nThe main idea is that if someone reads you lab report they should be able to figure out the\nfollowing items:\na) what is the goal of the experiment (Explain what is it that you are going to do, and\nwhat is the logic of using the particular technique that you will use)\nb) what reagents and equipment are necessary (already in the protocol, no need to write\nitagain)\nc) detailed protocol of the experiment (already in the protocol, no need to write it again)\nconcentrations of reagents...\ntime of incubation.....\nspeed of centrifugation....\nvoltage.....\nd) Observations: (This is NOT in the protocol, so write down your own observations of\nhow things happened)\nSteps that need special attention\nDifficulties\nCommon mistakes to avoid\nMistakes that were made\ne) Rationale of why things are done in a particular way:\nThe tubes were shaken because the ethanol and salt have to mix well for the\nDNA to precipitate....\nwe used agarose at 2% because the piece to be resolved was 300 base pairs\nWe used a newborn animal because neurons from adult animals do not survive in\nculture....\n\nf) Interpretation of the results:\nIf something went wrong try to explain what happened\nExplain surprising outcomes"
    },
    {
      "category": "Resource",
      "title": "labrep_rubric.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/73700480c3ad896a16e23ab2430a3d8b_labrep_rubric.pdf",
      "content": "9.12 Lab Report Grading Rubric\nEarned\nNotes\nStudent Name:\nIntroduction\nDiscuss backgound specific to your study\nExplain the relivance of the study to the research field\nHow does this stduy fit into the field?\nState the purpose of your study\nWhat is your central question?\nBriefly state your expected results\nWhat is your hypothesis?\nMethods\nDistinquish methods from protocol\nAccurately provide reagents used and concentrations\nDescribe data collection and analysis\nRaw quantification vs. calculation\nResults\nPresent data that is relivant to your central question\nState data appropriately (i.e. no interpretation)\nAppropriately cite figures in text\nDo you reference each figure when you talk about its data\nin text?\nFigures and Tables\nAppropriate labels (units, axes, etc.)\nCaption presence and provides sufficient information\nIf the caption is written properly, then one should be able\nto analyze the graph/table and the supporting caption\nwithout referring to the results text.\nDiscussion\nRestate hypothesis and findings (one sentence)\nAnalysis of experimental results\nWhy are your results interesting?\nWhat information can one interpret from these data?\nDo your results confirm/refute your hypothesis? Why or\nwhy not?\nProject shortcomings/limitations\nFuture research directions\nWhat is the next step that you would take from this study?\nHow would you further prove/negate your results?\nTotal:\nGeneral Comments:"
    },
    {
      "category": "Resource",
      "title": "pres_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/d4e61e7416b852e1ebbae28d713e4612_pres_guide.pdf",
      "content": "Guidelines for the presentation\nThese are a few pointers to make the presentation more effective:\n- Remember that your audience are the other students. You have spent some time reading\nabout a particular technique/experiment and your task is to help them understand it better.\n- Avoid jargon. Don't mention jargon if you are not going to explain it, because it only\nconfuses people. For instance, it would be useless to say something like \"... and they\nused PCR to renormalize the dynamic range of stringent positive clones..\", unless you are\ngoing to explain what each of those terms means. For every image or sentence that you\ninclude in your presentation you should think: does this make the other students\nunderstand this point better?\n- The most important part of the presentation is to illustrate why the particular technique\nthat they use allows the authors to come up with their conclusions. Don't just show some\npictures and mention some numbers: explain the logic of why they chose that technique,\nwhat the numbers suggest, how did they come up with that interpretation, what questions\nremains unanswered by that experiment, what could be the next logical step to do, etc...?\n- If there are many ways to do the experiment, try to explain in more detail the way that\nthey authors did their experiment. Don't worry too much about other technical details if\nthey are not used in the paper.\n- Try to connect the technique with the paper. Always use the general motivation of the\npaper as your guide to present the experiment. Put it in the context of what the authors\nare trying to figure out. What would be even better is, after you are done explaining what\nthey did, if you can suggest better ways of answering the question with another\nexperiment."
    },
    {
      "category": "Resource",
      "title": "summary_advice.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/c975a5da7355202b8cf95c2d1e249495_summary_advice.pdf",
      "content": "General advice for 9.12 students writing research summaries:\n\n1. Site the paper by Scheiffele et al. (2000) don't provide the whole title. Include\nthe reference for the paper at the end of the document.\n\n2. Start with an overview explaining the area of inquiry, i.e., the intellectual context\nfor the paper. Include the scope of your summary in the overview, i.e., say that\nyou have summarized the results of the eight experiments reported by Scheiffele\nand colleagues.\n\n3. Your summaries of the eight experiments should include the method, rationale,\nresults, and interpretation. Consider devoting one paragraph to each of the\nexperiments. Include the question they've asked, the method, rationale, results,\nand interpretation. If you choose to discuss more than one experiment in a single\nparagraph because they are closely related, make sure your topic sentence reflects\nthis organization.\n\n4. Refer to the authors as \"the researchers\" or \"Scheiffele and colleague\" so you can\nuse active voice, e.g., The researchers examined the role of neuroligins and\nneuroexins in synaptogenesis.\n\n5. Devote each sentence to only one idea - a sentence is a unit of discourse. Write\ntwo sentences if you have two ideas to express (e.g., what they did and why they\ndid it that way).\n\n6. Provide each paragraph with a topic sentence that tells the reader what the\nparagraph is about. A paragraph is also a unit of discourse - one topic per\nparagraph please. Look over your topic sentences after you've written the paper to\nsee if the \"story\" your summary tells is evident in the topic sentences alone.\n\n7. Please make an appointment to see me if you find that you have having too much\ndifficulty with your summary.\n\n8. IF YOU TURN IN A REVISION FOR REGRADING, IT MUST BE DOUBLE\nSPACED AND YOU MUST INCLUDE THE ORIGINAL DRAFT WITH ALL\nOF MY COMMENTS PLUS MY COVER PAGE.\n\nM.P. Ogren"
    },
    {
      "category": "Resource",
      "title": "summary_question.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/99ad41403ec333fce896169deb157d91_summary_question.pdf",
      "content": "Summary Essay Question\n9.12 Neurobiology Laboratory\nWriting Instructor: Marilee P. Ogren\n\nWrite a well-organized, clearly worded essay about 3 pages long that summarizes the\nmost essential information and points of agreement and disagreement presented in the\nassigned articles. Your task is to inform your readers about the central issues, not to\npersuade them to take a particular viewpoint. Your approach to the material should be\nobjective, not opinionated.\n\nAssume your audience is a group of your peers who have not studied this topic. Do not\ndo any additional reading or research beyond the articles provided. Be sure your paper is\nunderstandable to someone who has not read the original articles.\n\nYou can include at most, two or three direct quotations. Most of the information from the\narticles should be reported by paraphrasing the authors' words (see \"Using the Language\nof Your Source Appropriately\" from the Mayfield handbook, below). You should\ndocument all direct quotations through parenthetical documentation that uses the authors'\nlast name and year of publication (e.g., Lois et al. 2006). Do not add a list of works cited.\n\nThis is what is expected of you:\n- Extract the most essential information and ideas from each reading.\n- Determine how a particular article's information and ideas related to those in the\nother articles (e.g., support, contradict, supplement).\n- Paraphrase the authors' language concisely and accurately but do not copy their\nwords verbatim except in direct quotes.\n- Structure the essay logically and coherently, avoiding superficial or random lists\nof points. Make good use of your introductory and concluding paragraphs, and the\ntopic sentences of the body paragraphs.\n- Write in precise, concise, and engaging prose.\n\nMayfield Electronic Handbook of Technical & Scientific\nWriting\n\nhttp://www.mhhe.com/mayfieldpub/tsw/home.htm\n\nSection 10.1\n\nUsing the Language of Your Source\nAppropriately\n\nIf you use the language of your source, quote the wording exactly.\nThis is called a direct quotation. A direct quotation is either\nenclosed in quotation marks or indented on the page. If you omit\npart of the wording, use an ellipsis (three periods, four if necessary\nfor punctuation to indicate the omission). In any case, several\nwords in succession taken from another source constitute direct\nquotation and must be acknowledged. Indeed, a single word may\nconstitute a direct quotation if it is a word closely identified with a\nparticular author.\n\nA paraphrase employs source material by restating an idea in an\nentirely new form that is original in both sentence structure and\nword choice. Taking the basic structure from a source and\nsubstituting a few words is an unacceptable paraphrase and may be\nconstrued as plagiarism. Creating a new sentence by merging the\nwording of two or more sources is also plagiarism.\n\nThe following examples illustrate the differences between\nacceptable paraphrase and plagiarism.\n\n------------------------------------------------------------------------\n\nSource Quotation\n\nA grand unified theory has long been the holy grail of\nphysicists. Since ancient times, physicists have sought\nminimalist explanations of nature. Theories with four\nbasic particles are considered better than theories of\nten.\n\n--Alan Lightman, Ancient Light: Our Changing View of the\nUniverse\n\nUnacceptable Paraphrase\n\nA grand unified theory has long been the central goal\nof scientists. Since the dawn of time, men of science\nhave looked for minimalist explanations of natural\nphenomena. A theory with four elementary particles is\nconsidered better than a theory of ten.\n-------------------------------------------------------\n-----------------\n\nIn the preceding passage, the writer has merely substituted a few\nwords of his or her own for words in the source. The structure and\nthe overall wording of the sentences, however, are Lightman's.\nSince the writer has borrowed Lightman's words as well as his\nideas, the acknowledgment of Lightman as a source does not\nprevent this passage from being plagiarism.\n\n------------------------------------------------------------------------\n\nUnacceptable Paraphrase\n\nPhysicists have long had the grand unified theory as\ntheir holy grail. Science always tries to give\nminimalist explanations for natural phenomena. The best\ntheory is the one with the fewest elements.\n\n-------------------------------------------------------\n-----------------\n\nThe structure of the individual sentences in the preceding passage\nis somewhat original, but the order of sentences is clearly taken\nfrom Light man. In addition, the writer has used several phrases\ntaken directly from the source, such as \"minimalist explanations of\nnature.\" Borrowing such phrases without enclosing them in\nquotation marks makes the writer guilty of plagiarism.\n\n------------------------------------------------------------------------\n\nAcceptable Paraphrase\n\nPhysicists have long sought a grand unified theory,\nsince scientists have always preferred theories with\nthe fewest elements (Lightman 106).\n-------------------------------------------------------\n-----------------\n\nThis writer has reproduced much of the meaning of Lightman's\npassage but in a sentence that is original in structure and word\nchoice. The only major words and phrases taken from Lightman\nare grand unified theory, theories, and physicists. Such duplication\nis acceptable, since it would be cumbersome to find synonyms for\nthese basic terms."
    },
    {
      "category": "Resource",
      "title": "summary_rubric.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/d4ded2079d824683892ccef264cff964_summary_rubric.pdf",
      "content": "9.12 Student Paper Reviews\nEarned\nNotes\nStudent Name:\nIntroduction\nProvides introductory information\nabout the paper field\nUnderstands how the paper fits\ninto the research field\nPaper Summary\nExplains basic paper methods\nExplains techniques used in the\npaper (general)\nProvides rationale for usage of\nthese methods and how authors\ncan find results\nExplains basic paper results\nRelates these results to the\nspecific technique used to obtain\nthem\nExplains basic conclusions\nauthors extrapolate from results\nCritical Review\nCritically examines authors'\nmethods\nCritically examines authors'\nresults\nProvides alternative conclusions\nto paper results\nProvides future research from\npaper results\nProvides detail on future\nexperimental methods to carry\nout research\nFormat\nSpelling and Grammar\nTransition Sentences/Paragraphs\nStyle\nTotal"
    },
    {
      "category": "Resource",
      "title": "02answers.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/d4a0450a004f8d6498f701a9d1ad645e_02answers.pdf",
      "content": "Questions for the julius+ axel paper:\n1. explain what is being done in the top image of figure 1 ,\"gradient fractionation of\nchoroid plexus RNA\". (By explanation I don't mean a simple paraphrasing of what is\nwritten on the text, but a real explanation of why they do it)\nthey centrifuge the rna in a gradient of sucrose so that the heavier RNAs will sink deep\nand the smaller rnas will float. In this way they can size select the RNA for further\nexperiments.\n2. explain the experiment described in figure 8. NIH 373 cells do not have any calcium\nfluctuations when exposed to serotonin. Neurons that have the serotonin receptor DO\nhae calcium fluctuations when exposed to serotonin. If you add the 5HT receptor to\n3t3 cells, they should have calcium fluctuations. First, they transfected a plasmid that\nencodes for the 5HT receptor into 3t3 cells. Then they loaded the cells with a\nchemical that emits a fluorescent signal when calcium levels rise. To measure the\nchanges in fluorescence, they analyze the cells with a fluorescent cell scanner. You\ncan see that only the 3t3 cells that express the 5ht receptor show increases in the\nfluorescent signal,when exposed to 5ht.\n3. Why do they make RNA in vitro (from the cDNA library) to inject into the oocytes?\nBecause if they inject RNA it can directly be translated into a protein simply by injecting\ninto the cytoplasm. If they inject DNA, they would have to hit the nucleus of the oocyte,\nwhich is very difficult.\n4. The human (or rat ) genome has approx. 30,000 genes. Why do they make a library\nthat has 1,2 million clones?\nTo make sure that they have complete coverage of low abundance genes, and to make\nsure that in some cases they have full length cDNAs\n5. the gene that they identified is 3kb, but in the northern in figure 10. They mention that\nit is really 5.2 KB. Why the discrepancy?\nThe mrna has untranslated regions (UTRs) that are not part of the protein coding region.\nIn this case, those UTRs account for the extra 2 kb.\n6. Fig 10: why is the actin band from the heart smaller than actin in any other tissues?\nThere are many kinds of forms of actin. The heart, being a contractile organ has a\ndifferent kind of actin that most other parts of the body. Because heart's actin has a\nsequence similar to the rest of the body, it is still recognized by the probe. However,\nbecause it is encoded by a different gene, it produces a different mRNA which has a\ndifferent size.\n\n7. Legend of figure 1: \"..transcribed in vitro in the presence of the cap precursor\nGpppG...\". Why do they need the GpppG?\nThe ribosome from the oocyte will not translate an mRNA unless it is capped by the\nGpppG.\n8. A gene is expressed in a particular cell because it is selectively transcribed there. For\ninstance: the serotonin receptor is expressed in the choroid plexus, but not in the liver.\nHow do they manage to express serotonin receptor in the frog oocyte?\nAs long as they provide the right mRNA (plus the cap and the polyA), the frog oocyte\nwill translate anything that you out it, even if it usually doesn't express that gene\nendogenously.\n9. The oocyte is clearly not an electrically active cell. How come if you put a serotonin\nreceptor now it becomes \"neuron-like\", and it is responsive to neurotransmitters?\nAll cells have a membrane potential (which is usually -70 mV). Neurons have, in\naddition to other ion channels, voltage-gated sodium channels which are responsible for\nthe firing of action potentials. If you put other channels into cells that are usually non-\nexcitable, they will be able to modify their membrane potential.\n10. figure 3. They inject a pool of 100,000 clones (!) and they get a electrical signal when\nthe cell is exposed to serotonin. How do they know which of the 100,000 clones is\nthe responsive one? How do they do to eventually isolate the \"real\" serotonin\nreceptor , if they start with a pool of 100,000?\nThe key here is that the serotonin receptor is not a channel by itself. Like the olfactory\nreceptor, the activation of the serotonin receptor is coupled to a G-protein, which will\nactivate a channel. Thus, there is an amplification cascade between the serotonin\nreceptor and the channel that is triggers to open. In their experiment, if the serotonin\nreceptor was by itself a chennle, they would not have been able to detect it, because there\nwould be no amplification cascade by the G-protein intermediary.\n11. Why do they transfect fibroblasts with DNA but they inject RNA into the oocytes?\nBecause they want to make a cell line that permanently expresses the serotonin\nreceptor, they want to make sure that the DNA that they transfect will integrate\npermanently into the genome. If they were to inject RNA into the fibroblast, the\nRNA will degrade in a few hours, and they would not be have been able to have a cell\nline that permanently expressed the receptor. For the oocyte, it is a different story:\nthey just want to express protein for a few hours, and after that, they throw away the\noocyte. In addition, there is question of injecting into the nucleus versus cytoplasm\nthat we mentioned before (question 3).\n\n12. Why do they put the serotonin receptor in the \"..expression vector pMV7\" when they\nwant to transfect it into fibroblasts? Why do they have an \"independent cassette\nencoding neomycin..\"?.\nTo express a cDNA in mammalian cells they need a specific promoter, and the pMV7 is\nsuch a promoter. As opposed to that, a bacterial promoter would not have worked in that\ncase. They need the neomycin cassette to be able to select for the cells that have\nincorporated the transfected gene. The plasmid that they transfected has both the\nserotonin cDNA and neomycicn. They cannot do anything to directly enrich the cells\nthat have serotonin and discard the cells that don't. However, if a cell does not have the\nneomycin cassette and you grow the cells with neomycin, they will die. In contrast, if a\nfew cells have the neomycin cassette (you grow the cells with neomycin), only those cells\nwill survive. Now, if you have transfected BOTH serotonin receptor and the neomycin\ncassette, and you are selecting for neomycin, you will indirectly will be selecting for the\ncells that also have serotonin receptor.\n13. figure 4: how do they know that out the 3 kb clone that they have, the protein coding\nregion is only 1400 base pairs?\nBecause they look for the ORF in the sequence, like you did in the computer exercise,\nand they realize that there is a lot of UTR before and after the protein coding region of\nthe gene. (see question 5)"
    },
    {
      "category": "Resource",
      "title": "02questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/3df689f4bd8d87570b6a1a66b3bc9d47_02questions.pdf",
      "content": "Questions for the julius+ axel paper:\n1. explain what is being done in the top image of figure 1 ,\"gradient fractionation of\nchoroid plexus RNA\". (By explanation I don't mean a simple paraphrasing of what is\nwritten on the text, but a real explanation of why they do it)\n2. explain the experiment described in figure 8.\n3. Why do they make RNA in vitro (from the cDNA library) to inject into the oocytes?\n4. The human (or rat ) genome has approx. 30,000 genes. Why do they make a library\nthat has 1,2 million clones?\n5. the gene that they identified is 3kb, but in the northern in figure 10. They mention that\nit is really 5.2 KB. Why the discrepancy?\n6. Fig 10: why is the actin band from the heart smaller than actin in any other tissues?\n7. Legend of figure 1: \"..transcribed in vitro in the presence of the cap precursor\nGpppG...\". Why do they need the GpppG?\n8. A gene is expressed in a particular cell because it is selectively transcribed there. For\ninstance: the serotonin receptor is expressed in the choroid plexus, but not in the liver.\nHow do they manage to express serotonin receptor in the frog oocyte?\n9. The oocyte is clearly not an electrically active cell. How come if you put a serotonin\nreceptor now it becomes \"neuron-like\", and it is responsive to neurotransmitters?\n10. figure 3. They inject a pool of 100,000 clones (!) and they get a electrical signal when\nthe cell is exposed to serotonin. How do they know which of the 100,000 clones is\nthe responsive one? How do they do to eventually isolate the \"real\" serotonin\nreceptor , if they start with a pool of 100,000?\n11. Why do they transfect fibroblasts with DNA but they inject RNA into the oocytes?\n12. Why do they put the serotonin receptor in the \"..expression vector pMV7\" when they\nwant to transfect it into fibroblasts? Why do they have an \"independent cassette\nencoding neomycin..\"?\n12. figure 4: how do they know that out the 3 kb clone that they have, the protein coding\nregion is only 1400 base pairs?"
    },
    {
      "category": "Resource",
      "title": "03answers.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/c9b89ec676882d61d26b1621c89fa30e_03answers.pdf",
      "content": "Buck and axel:\n1. why do the use mRNA instead of genomic DNA as starting material?\nOne criteria of olfactory receptor is that it is expressed only in nasal epithelium\nbut not in other region. If one starts from genomic DNA, there is no guarantee that\nwhatever amplified by PCR belongs to olfactory receptor gene family. Also, the\ngenomic DNA contains both exon and intron. There is no guarantee that there is no\nintrons between the two regions selected to design PCR primers. If there is intron(s)\nbetween the two regions, first PCR may not work. Also, the size of PCR product\ncannot be a selection criterion of candidate gene.\n2. How did they design the oligos for PCR? Based on which assumption?\nOlfactory receptors belong to 7-transmembrane G-protein coupled receptor. At\nthat point, there was a dozen of such receptor family already known (rhodopsin,\nbeta-adrenergic receptor etc). By comparison between these genes, one can find\nhomologous region with in this family of protein. They assumed that the olfactory\nreceptor protein also share the same sequence feature.\n3. What is the difference between figure 2a and 2B?\nWhat does it mean?\nExplain the results for lanes 12 and 13.\n2A is before digestion with HinfI and 2B is after. 2A is to confirm that the size of\nPCR products are within expected range as G-protein coupled receptor. 2B test if\nthe bands consist of multiple different DNA or not. In 2B lane 13 consists multiple\nbands which sum up much longer than undigested DNA. This is indicative of\npresence of multiple species of fragments in undigested DNA. In contrast, the\n\nlength of digested DNA will add up to the length of undigested DNA in lane 12\n(compare with marker).\n4. How many \"genes\" are there in lane 13?\nThe authors estimated that the length sum to 5- to 10-fold of the undigested\nDNA. This means there are at least 5-10 different genes.\n5. If they get a band like fig2. A, lane 12: does it rule out that it is really an olfactory\nreceptor?\nIt is still possible that this particular primer pair only amplified single species of\nolfactory receptor.\n6. Would they get any PCR products if they use a brain cDNA library? Before\nanswering remember the design of the oligos.\nThe oligos are designed to detect G-protein family receptor. It is possible that\nother G-protein coupled receptor (but not olfactory receptor) is cloned.\n7. In fig 3: why do they do a northern blot with 20 probes? Wouldn't they loose\nspecificty? How do they know which probe is hybridizing to which target in the\nnorthern? What are those 2 bands?\nThere is ~1000 olfactory receptor genes and if one use only one probe and\neach of may be expressed only in a small fraction of olfactory receptor. Therefore,\nthe amount of expression may not be sufficient to detect if they use only one probe.\nThe two bands may correspond to different subtypes of olfactory receptor.\n\n8. Why do they use a cdna library to get full length cdna clones? Why not do it by\nPCR?\nOne can try 5' RACE (rapid amplification of cDNA end) and 3' RACE to get\nfull-length clone. For RACE, one use primer that anneals to a know part of cDNA\nand another primer in the vector (phage vector or plasmid vector, which is already\nknown) sequence. This will allow one to get unidentified portion of cDNA. However,\nif you have a sufficiently long cDNA fragment which you can use as probe,\nscreening cDNA library using plaque hybridization is more standard. One reason is\nthat PCR tends to incorporate mutations. Second reason is that it does not involve\nfurther work to connect original PCR fragment with new ones.\n9. Fig3, why do they isolate polyA+ RNA? Are there rna's with no polyA+?\nTransfer RNA and ribosomal RNA do not have polyA. Also, there are a number\nof minor RNAs such as shRNA, do not have polyA either. There are also messenger\nRNAs lacking polyA. Some of mRNAs coding nuclear protein belong to such family.\nHiston is a typical example.\n10. How come you can figure out the number of genes by doing a southern blot (fig\n7)? Why do they genomic DNA instead of cDNA from a library? Could you do the\nsame with a northern blot?\nRestriction enzyme digests various olfactory receptor DNA into fragment at\ndifferent length. In addition, if you cut with 6 cutters such as EcoRI or HindIII\n(appears 1 out of 4kb), the average fragment should contain only 1 receptor. By\ndoing blotting at low stringency and counting the number of positive bands, one\n\nshould be able to estimate the number of family protein. In contrast, mRNA has less\ndiverse in their length. It seems to be around 2 kb in Northern blotting even they\nused a mixture of 20 different cDNA as probe. So this makes it difficult to estimate\nthe number of genes. From the same reason, it is difficult to estimate the number of\nindependent gene using southern blotting against cDNA.\n.\n11. What does it mea n to hybridize a library at high stringency?\nWhy would you\nwant to do that?\nDNA double helix is stabilized at low temperature and high salt concentration.\nIf you use higher temperature and low salt concentration, only a perfectly matched\nDNA anneals together. By using such condition, one can identify DNA fragment\nexactly matches the probe.\n12. Fig 7: what does it mean that they do not 'cross-hybridize\"?\nUnder low temperature and high salt concentration, even the mismatched\nDNA can anneal together. It is called low stringency. If you want to detect other\nmembers of the same family, you can use low stringency.\n13. these genes have no introns: how does this factor affect the choice of source of\nnuclei acid for PCR? What would be the results if you use: a) mRNA after reverse\ntranscription, b) cDNA from a library, c) genomic DNA form the olfactory\nepithelium, d) genomic DNA from the liver.\nOlfactory cDNA made by RT reaction (a) or olfactory cDNA library (b) should\namplify olfactory receptor. Genomic DNA from olfactory epithelium and liver (c and\nd) may be also used but G-protein coupled genes other than olfactory receptor may\n\nbe also amplified and requires extra effort to characterize it. (c) and (d) should give\nidentical results. The length of product, if any, will be approximately the same\nbecause there is no intron in-between.\n14. What does it mean to do \"nested\" PCR? Why do they do nested PCr to make\nsure that the clones that they pick are what they really want?\nIn nested PCR, one first amplifies DNA with a pair of primers and then\nrecovers the PCR product. Using it as a template, the second round PCR will be\ncarried out using primers located with in the product region. Because two sets of\nprimers determine the specificity, it will be more accurate than only one set is used.\nErroneous products amplified with only first set of primer will not be amplified in the\nsecond PCR.\n15. By doing northern blot they confirm that the genes are expressed in olfactory\nepithelium. Explain the logic they use to assume that it is likely that these genes are\nexpressed in olfactory neurons.\nIt has been postulated that the cilia of olfactory neuron is the site of odor\ndetection (p175, right column). Selective removal of cilia abolishes the olfactory\nresponse. The specific binding of amino acid (in fish, it is odorant), is found in cilia.\nAlso, by application of odorant, adenylate cyclase is activated GTP dependently\nand open cyclic nucleotide gated channels in cilia.\n16. Do they really know which cells express the genes? What could they do to\nreally make sure where the genes are expressed? PCR? Northern? Other\ntechniques?\n\nIn situ hybridization will be the best technique to identify the cell type\nexpressing a certain gene. One can counter-stain tissue to identify cell types."
    },
    {
      "category": "Resource",
      "title": "03questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/3f08abda5f518123dbc26de56c6728e1_03questions.pdf",
      "content": "Buck and axel:\n1. why do the use mRNA instead of genomic DNA as starting material?\n2. How did they design the oligos for PCR? Based on which assumption?\n3. What is the difference between figure 2a and 2B? What does it mean? Explain the\nresults for lanes 12 and 13.\n4. How many \"genes\" are there in lane 13?\n5. If they get a band like fig2. A, lane 12: does it rule out that it is really an olfactory\nreceptor?\n6. Would they get any PCR products if they use a brain cDNA library? Before\nanswering remember the design of the oligos.\n7. In fig 3: why do they do a northern blot with 20 probes? Wouldn't they loose\nspecificty? How do they know which probe is hybridizing to which target in the\nnorthern? What are those 2 bands?\n8. Why do they use a cdna library to get full length cdna clones? Why not do it by PCR?\n9. Fig3, why do they isolate polyA+ RNA? Are there rna's with no polyA+?\n10. How come you can figure out the number of genes by doing a southern blot (fig 7)?\nWhy do they genomic DNA instead of cDNA from a library? Could you do the same\nwith a northern blot?\n11. What does it mea n to hybridize a library at high stringency? Why would you want\nto do that?\n12. Fig 7: what does it mean that they do not 'cross-hybridize\"?\n13. these genes have no introns: how does this factor affect the choice of source of nuclei\nacid for PCR? What would be the results if you use: a) mRNA after reverse\ntranscription, b) cDNA from a library, c) genomic DNA form the olfactory\nepithelium, d) genomic DNA from the liver.\n14. What does it mean to do \"nested\" PCR? Why do they do nested PCr to make sure that\nthe clones that they pick are what they really want?\n15. By doing northern blot they confirm that the genes are expressed in olfactory\nepithelium. Explain the logic they use to assume that it is likely that these genes are\nexpressed in olfactory neurons.\n16. Do they really know which cells express the genes? What could they do to really\nmake sure where the genes are expressed? PCR? Northern? Other techniques?"
    },
    {
      "category": "Resource",
      "title": "labsafetystudent.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/deeed07b001940ffff56c7268760ffec_labsafetystudent.pdf",
      "content": "GENERAL LAB SAFETY NOTES\nFor Students\nPROPER ATTIRE:\n\nProper laboratory attire includes the following for all labs:\no Closed toe shoes\no Long pants\no Hair longer than shoulders pulled back\nIf need more protection than normal, the lab will provide the\nfollowing items:\no Disposable lab coats\no Protective eyewear\no Disposable masks\no Disposable gloves\nIf any/ all of these items are necessary, then we will inform\nstudents prior to class. We will lie out necessary protective\ngear before class begins, and note where they can find these\nmaterials.\n\nLAB SAFETY EQUIPMENT:\n\nThere are three hoods in the lab that flank the sink in the far\ncorner of the room. Two are culture hoods that the 9.12 class\nwill use, and the other is a fume hood (general for both classes).\nNote the differences between these two hoods and their uses:\no Fume hoods vent from the back and filter noxious\nchemicals.\no Culture hoods vent from the front and if used properly,\nmaintain sterile environments.\nThere are also individual snorkel vents located over every\nworkstation on the lab benches. Please turn these on if you are\nworking with noxious materials (such as preserved brains). To\nopen the vent, turn the long dial on the side of the vent.\n\nThere are four sharps containers located in the room. Two are\nstationed behind the middle lab bench. Two are in the far corner\nof the room next to the animal vestibule. Objects that one can\nplace in these containers include but are not limited to:\no Glass slides\no Pipets (glass or hard plastic)\no Syringes\no Scalpel blades\no Other broken glass or metal objects.\nThese items may or may not be bio-hazardous. Note however,\nthat one can dispose of sharp materials ONLY in these bins.\nRegular trash is not permitted.\nN.B. Never place a scalpel blade on a handle or remove it. For\nyour safety, leave this job to the teaching staff.\n\nThere are three wash stations in the lab. Two are eyewash, and\none is a shower. The first eyewash is located next to the sink.\nThe second eyewash and the shower are next to each other and\nare located behind the middle lab bench and next to the\nicemaker. Do NOT pull the shower cord unless there is an actual\nemergency use for it or else you will flood the lab.\n\nWASTE DISPOSAL:\n\nThere are few chemicals that can go down the sink or throw away\nin the regular trash. Unless specifically told otherwise, treat all\nsolutions/chemicals as if they cannot go down the sink.\nFor chemical waste- There are containers for both solid and\nliquid waste located on the floor next to the fume hood. There\nare multiple liquid waste containers in a satellite container, each\nfor different chemicals. Contact the lab manager or a teaching\nassistant before disposing ANY lab waste, so that we properly\n\ndiscard the waste. If there is a full waste container, liquid or\nsolid, contact the lab manager.\n\nFor bio-hazardous waste- Sharp biohazard waste should be\ndiscarded in the sharps containers (see above). For all other\nbiohazard waste, the lab manager will have biohazard bags. We\nwill alert students to the location of the bag and what must be\nplaced in the bag at the beginning of a lab session. Please place\nthe proper waste in the bag, and the lab manager will dispose the\nwaste properly.\n\nEMERGENCY INFORMATION:\n\nThere is an EHS packet of information by the phone. The phone\nis located next to the animal vestibule door. This packet tells one\nwhat to do in case of a chemical, biological, etc. emergency. Know\nthe location of this packet for use.\n\nCLEANING SUPPLIES AND GENERAL CLEANING INFO:\n\nAll cleaning agents for the lab are located under the sink. These\ninclude the following:\no Alconox\no Bleach\no Lysol disinfectant\no Fantastik\no Sporocidin (virucide, bactericide, fungicide)\no Extra sponges\no Extra hand soap\nThere will always be an open bottle of hand soap to the\nright sink. A sponge and cleaning brush are located to the\nleft of the sink. There is usually a bucket of soapy water to\nthe left of the sink also.\n\nFor general reference, the lab manager convention is that\neverything to the left of the sink is dirty, and everything to the\nright of the sink is clean. For example, if one uses scissors to cut\ntissue, then those scissors should be placed to the left of the\nsink for cleaning when one is finished with them. Clean items are\nalso place on clean diapers to dry. Note that the diapers are on\nthe right side of the sink only.\n\nMISCELLANEOUS INFORMATION:\n\nMake sure to leave the lab/lab station as you found it. A clean\nlab is a happy lab, and a happy lab is a happy lab manager.\nIf one needs gloves in the lab, remember to change them often.\nIf you are unsure if something is clean or dirty, treat it as dirty.\nIf you are unsure if a chemical can go down the sink, treat it as if\nit cannot.\nAlways ask questions. If you cannot find something or don't know\nwhat to do, ask a member of the teaching staff.\nNever be apprehensive about asking for help."
    },
    {
      "category": "Resource",
      "title": "week02_intro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/87c1e7ddf6f7664bc663832e83882018_week02_intro.pdf",
      "content": "Purpose of the 9.12 lab class\n- Gain experience in commonly used methods\nin molecular/cellular neuroscience\n- Understand how research are conducted in\nreal life\n\nLab Report\n- Once in a several sessions (total 3 or 4). Type and give print\nout to TAs. No E-mails please.\n- Arrange similarly to scientific papers\n- Title\n- Author\n- Abstract: 100-200 words.\n- Introduction: The back ground and significance of what you have\ndone.\n- Methods: Do not just copy and paste protocol. Write what you\nhave actually done.\n- Results: Include raw data here.\n- Discussion: Interpretation of the results\n- Total 2 pages.\n- Do not copy each other or from web pages.\n\nGrading\n- Class attendance and attitude\n- Presentation of paper\n- Report on lab\n- Report on paper\n- Quiz\n- No final exam\n- We are not evaluating you by your knowledge but by\nwhat you learn during the class!!\n\nSuggested Text Books\n- DNA recombinant technology\n- Primrose et al. \"Principles of Gene Manipulation\"\nBlackwell Science\n- Molecular Biology in general\n- Alberts et al. \"Molecular Biology of the Cell\"\nRockefeller University Press\n- Cellular level neuroscience in general\n- Martin et al., \"From Neuron to Brain\" Academic Press\n\nQuestions\n- Think, think, think...\n- Search yourself (text, Google...)\n- Ask questions\n- TA (your primary TA)\n- Instructors\nPlease do not send e-mail to every instructors and\nTAs. Nobody may answer.\n\nSafety precautions\n- No food and drink in the lab area.\n- Understand what is dangerous.\n- Sharps\n- Hot/cold\n- Chemicals: Ethidium bromide, acrylamide,\nparaformaldhyde, NaOH, SDS\n- Ultraviolet\n- Personal protective: if you do not have one, we\nwill provide.\n- Grove\n- Glasses or safety goggle\n- Lab coat\n- Shoes. No open toe.\n\nEmergency\n- Shower (fire or large toxic spills on your body)\n- Eye wash (spills in your eye)\n- Other wounds (cut, burn etc)\nImmediately notify instructors and TAs so that we\ncan help you further\n\nGarbage Disposal\n- Sharps (pipette tips, glass, razor blades etc)\n- Temporally in small bucket on your bench.\n- Bioharzard container (grey plastic bin)\n- Chemicals\n- Most salt solutions can go sink.\n- Biological materials\n- Bacterial and cells: needs sterilization before disposal\n- Other nonviable things (bare DNA, eppendorf tubes,\ngloves etc): regular trash"
    },
    {
      "category": "Resource",
      "title": "week02_lab01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/d038e66dbe63681f1d77931a3a1c19b4_week02_lab01.pdf",
      "content": "First class: Basic skills in a molecular biology lab\n\nPLAN FOR THE DAY\n\na) Prepare digest with BamHI or BglII, for the following DNAs: FUGW, genomic\nDNA, FUCEdW.\nb) Prepare 1% agarose gel\nc) Precipitate genomic DNA\nd) Run digest\ne) Take pictures\n\n1. Preparation of the digest\n\nCut 3 l of each type of DNA with BamHI or BglII.\nFor BamHI use buffer 2 (blue)\nFor BglII use buffer 3 (red tube)\n\nCut the following:\n\nFUGW with BamHI\nFUGW with BglI\nFUGW with no enzyme\nFUGW with both BamHI and BglII (in buffer 2)\nFUCed with BglII\nFUCed with no enzyme\nGenomic DNA with BglII\n\n(per tube)\n\n3 l of DNA\n2 l of the appropriate buffer (red or blue)\n14 l of water\n1 l of BSA (bovine serum albumin)\n0.5 l of enzyme (BamHI or BglII)\n\nMix by gently tapping.\nSpin for 3 seconds\nIncubate in 37C waterbath for at least 40 minutes (while waiting, start preparing the gel )\n\n2. Preparation of the agarose gel\n\nPour 100 ml of TAE buffer in a 200 ml bottle\n\nMeasure 1 gram of agarose in a weigh boat\nAdd agarose to bottle and swirl thoroughly\nLoosen cap and put in microwave for 2 minutes at low power (4)\nMake sure that contents do not boil and spill over\nPut bottle in water bath at 37 to cool down until you can touch it\nAdd 5 microliters of ethidium bromide to liquid in bottle\nSwirl (without making bubbles)\nCast get with two 12 tooth combs (one on top row and one in bottom)\nAdd agarose into cast and let solidify\nWait 15 minutes (while you wait, precipitate the genomic DNA as explained below)\nOnce is solid, remove comb, turn the cast 90 degrees, and add approx. 400 ml of TAE\nbuffer, until the liquid starts to cover the gel\n\n3. Precipitation of DNA\n\nInto a 1.5 ml eppendorf tube, add:\n\n40 l of genomic DNA\n5 l of sodium acetate 3 M\n100 l of 100% ethanol\n\nMix well by shaking\n\nSpin in centrifuge at maximun speed for 5 minutes\n\nDiscard supernatant in waste bucket\n\nAdd 1 ml of 70% ethanol\n\nDiscard supernatant in waste bucket (make sure that your remove all you can by inverting\ntube on a piece of paper and gently tap the tube to eliminate all remaining drops)\n\nAir dry tube for 5 minutes\n\nAdd 10 l of water to bottom of tube\n\nTap bottom of tube to ensure mixing of water and pellet\n\nSpin down for 3 seconds\n\n4. Running of DNA digests and precipitation\n\nLoad 4 l of 1Kb DNA ladder in first well\n\nMix 2 l of loading buffer (LB tube) with each of the digests that you prepared before\n\nLoad 23 l of each of the digest+loading buffer in each well\n\nAdd 3 l of loading buffer to the precipitated genomic DNA, and load into a well\n\nThe loading order should be:\n\n1kb ladder-FUGW (BaMHI)- FUGW (BglII)-FUGW (BamHI and BglII)-FUGW (no\nenzyme)- genomic DNA (BglII) -FUCedW (BglII)- FUCed (no enzyme)-precipitated\ngenomic DNA (plus empty wells)\n\nOnce everything is loaded, set voltage to 150 volts and start running the gel\nRun gel for 15 minutes\nStop gel and take image with UV light"
    },
    {
      "category": "Resource",
      "title": "week02first_day.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/96cf5b0f68264a9a11583ff3af8ab6eb_week02first_day.pdf",
      "content": "First class: Basic skills in a\nmolecular biology lab\na) Prepare digest with BamHI or BglII, for\nthe following DNAs: FUGW, genomic\nDNA, FUCEdW.\nb) Prepare 1% agarose gel\nc) Precipitate genomic DNA\nd) Run digest\ne) Take pictures\n\nBasic Procedure: Liquid Handling\nLab\ne\nl\ne\nd\n\ndi\nagr\nam\nof a pipette.\n\nBasic Procedure: Liquid Handling 2\n- 1000: 100-1000 l. Use large tip.\n- 200: 20-200 l. Use small tip.\n- 20: 2-20 l. Use small tip.\n\nBasic Procedure: Centrifuge\n- Have connector always outside\n- Balance tubes.\n- Complete stop before opening.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nPlasmid\n- What is plasmid?\n- What is the difference of plasmid and\n\"usual\" DNA?\n\nPlasmid\n- What is plasmid?\n- Small circular DNA.\n- Replicated inside of host bacteria.\n- Can carry extra gene such as drug resistance gene.\n- Can carry foreign DNA.\n- What is the difference of plasmid and \"usual\" or\nchromosomal DNA?\n- Size\n- Chromosomal DNA carries most (>%99.99) of\nnecessary gene for bacteria\n- Bacteria can live without plasmid DNA but not without\nchromosomal DNA.\n\nRestriction Enzymes\n- The critical component of DNA recombinant\ntechnology\n- Why it is called \"restriction\" enzyme?\n- How often do you see these \"sites\" in DNA?\nBamHI\nBglII\n- Why restriction enzyme is useful?\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nApplication of restriction enzyme\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nSeparation of DNA fragment\n- What is the relationship of migration\ndistance and molecular weight?\n- Include your analysis in the report.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nVisualization of DNA in agarose gel\n- Ethidium bromide (EtBr): Possible\ncarcinogen.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nProtocols\nPreparation of the digest\nCut 3  of each type of DNA with BamHI or BglII.\nFor BamHI use buffer 2 (blue)\nFor BglII use buffer 3 (red tube)\nCut the following:\nFUGW with BamHI\nFUGW with BglI FUGW with no enzyme\nFUGW with both BamHI and BglII (in buffer 2)\nFUCed with BglII\nFUCed with no enzyme\nGenomic DNA with BglII\n(per tube)\n3 l of DNA\n2 l of the appropriate buffer (red or blue)\n14 l of water\n1 l of BSA (bovine serum albumin)\nWhy do you think we have BSA?\n0.5 l of enzyme (BamHI or BglII)\nMix by gently tapping.\nSpin for 3 seconds\nIncubate in 37C waterbath for at least 40 minutes (while waiting, start preparing the gel )\n\nProtocols\nPreparation of the agarose gel\nMeasure 100 ml of TAE buffer in measuring syrinder\nPour 50 ml of TAE buffer in a 200 ml bottle\nMeasure 1 gram of agarose in a weigh boat\nAdd agarose to bottle and swirl thoroughly\nLoosen cap and put in microwave for 2 minutes at low power (4)\nMake sure that contents do not boil and spill over\nAdd the rest of TAE to the bottle and mix well by swirling\nAdd 5 l of ethidium bromide to liquid in bottle\nSwirl (without making bubbles)\nCast get with two 12 tooth combs (one on top row and one in bottom)\nAdd agarose into cast and let solidify\nWait 15 minutes (while you wait, precipitate the genomic DNA as explained below)\nOnce is solid, remove comb, turn the cast 90 degrees, and add approx. 400 ml of TAE\nbuffer, until the liquid starts to cover the gel\n\nProtocols\nPrecipitation of DNA (this is separate experiment to be done while waiting for digestion and electrophoresis)\nInto a 1.5 ml eppendorf tube, add:\n40 l of genomic DNA\n5 l of sodium acetate 3 M\n100 l of 100% ethanol\nMix well by shaking\nSpin in centrifuge at maximun speed for 5 minutes\nDiscard supernatant in waste bucket\nAdd 1 ml of 70% ethanol\nDiscard supernatant in waste bucket (make sure that your remove all you can by inverting\ntube on a piece of paper and gently tap the tube to eliminate all remaining drops)\nAir dry tube for 5 minutes\nAdd 10 l of water to bottom of tube\nTap bottom of tube to ensure mixing of water and pellet\nSpin down for 3 seconds\nDo you see something on the bottom?\n\nProtocols\nRunning of DNA digests and precipitation\nLoad 4 l of 1Kb DNA ladder in first well\nMix 2 l of loading buffer (LB tube) with each of the digests that you prepared before\nLoad 23 l of each of the digest+loading buffer in each well\nAdd 3 l of loading buffer to the precipitated genomic DNA, and load into a well\nThe loading order should be:\n1kb ladder-FUGW (BaMHI)- FUGW (BglII)-FUGW (BamHI and BglII)-FUGW (no\nenzyme)- genomic DNA (BglII) -FUCedW (BglII)- FUCed (no enzyme)-precipitated\ngenomic DNA (plus empty wells)\nOnce everything is loaded, set voltage to 150 volts and start running the gel\nRun gel for 15 minutes\nStop gel and take image with UV light\n\nReport\n- What is the relationship between migration\ndistance and molecular weight?\n- How can you calculate unknown DNA size?\n- How many BamHI and BglII sites are there?\n- How are they arranged?\n- Draw a \"restriction enzyme map\" of FUWG\n- What is the smeary pattern?\n(No introduction, method, etc needed for today. Just\nthe result of you analysis and a map of the plasmid.\nWrite about possibilities.)"
    },
    {
      "category": "Resource",
      "title": "week03_2nd_class.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/7368a71fa6901c76f8006c788e8e336b_week03_2nd_class.pdf",
      "content": "Second Class\n- To understand commonly used method to\nanalyze DNA sequence on computer\n- Sequence prediction of GFP-CaMKII\nfusion protein.\n- No report. Send the sequence file and\ncalculate molecular weight of the fusion\nprotein by e-mail.\n\nCaMKII: Ca2+/calmodulin dependent protein kinase\n- Important enzyme for learning and memory\n- Activated by Ca2+\n- Change its localization by stimulation\n- Four subtypes , , , and \nImage removed due to copyright restrictions.\nA subunit of\nthe CaMKII gene conta\nins a kinase domai\nn\n, a\nn autoinhibitory domain, and an association domain.\nFigure by MIT OCW.An oligomer.\nFigure by MIT OCW.\n\nGFP: Green Fluorescent Protein\nA neuron expressing fusion\nprotein of GFP and CaMKII\nImages removed due to copyright restrictions.\nJellyfish - source of GFP gene.\nNeurons expressing GFP.\n\nNeuronal activity dependent\ntranslocation of GFP-CaMKII\nMovie by Bayer et al.\n\nPCR (polymerase chain reaction)\nCaMKII cDNA\nPCR\nAmplify coding region\nAdd restriction enzyme site\nXhoI\nEcoRI\n\nPCR\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nEnzyme sites\n\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nEnzyme sites are incorporated into the PCR product\n\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nEnzyme digestion\nligation\nVector DNA\n(plasmid)\n\nDNASIS\n- A bit outdated, but enough for daily use\n- Mac OS 9. Works on Classic mode on OS X\n- No Intel Mac\n- Vector NTI, DNAStar etc.\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nDownload DNA sequence\n- Goto http://www.ncbi.nlm.nih.gov/\n- Choose \"nucleotide\" as database.\n- Search for \"Rat calcium/calmodulin-dependent\nprotein kinase type II alpha-subunit mRNA\"\n- Find right record and click\n- Copy nucleotide sequence from bottom of the record\n- Open DNAsis\n- File -> New Select DNA\n- Paste DNA sequence\n- Print-out the record for later reference\n\nClick \"double\nstrand view\"\nPrint-out sequence\nImage removed due to copyright restrictions.\nScreenshot of DNAsis program.\n\nOpen-reading frame search\n- How many reading frames are there?\n- Function -> search -> open reading frame\n- Click LONGEST open-reading frame\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\nATG\nSTOP\n\nSelect frame 1\nThe coding region and length of protein should match with record.\nImages removed due to copyright restrictions.\nScreenshots of DNAsis program.\n\nXhoI\n5' Primer GAT CCT CGA GCT ATG GCT ACC ATC ACC TGC ACC\nCaMKII alpha ATG GCT ACC ATC ACC TGC ACC\nMet Ala Thr Ile Thr Cys Thr\nCaMKII alpha CTG CCC CAT TGA AGG ACC AGG CCA GGG\nLeu Pro His ***\nEcoRI\n3' Primer GTA ACT TCC GTT GCC GGT CCC GTA CGC TTA AGC TAG\n(usual writing, 5' -> 3')\nGAT CGA ATT CGC ATG CCC TGG CCG TTG CCT TCA ATG\nPrimer Sequence\nIf you do not know\n5' and 3' of DNA,\nplease talk to me.\n\nExpect the sequence of PCR product\n- Search primer sequence: Sequence -> Find. Type\nin the 5' primer sequence. Do not include the\nrestriction enzyme sequence.\n- Do the same for the 3' sequence but\ncomplementary strand.\n- Delete the sequence before and after the region\namplified by PCR.\n- Add primer sequence at both ends.\nNote: what is the sequence you need to add 3'?\n\nRestriction Enzyme Search\n- Function -> Search -> Restriction Enzyme\n- Select Enzyme, click \"select\"\n- First click \"none\"\n- Select EcoRI and XhoI, click OK\n- Sequence type, select \"linear\"\n- Click GO\n- A table will open\n- There must be two sites\n\nChange view by\nclicking icons.\nIdentify the same\nplace on the sequence\nfile (you can print out\nif you want)\nImage removed due to copyright restrictions.\nScreenshot of DNAsis program.\n\nSubcloning\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\npECGFP\n-C1 c\nloning\nvect\nor schema\ntic.\nCaMKII\nXhoI\nEcoRI\nFigure by MIT OCW.\n\npEGFP-C1\n- Download sequence from database.\n- Search for EcoRI and XhoI sites.\n\nConnect sequence of PCR\nproduct and pEGFP-C1\n- Copy XhoI-EcoRI sequence of PCR product\nbetween XhoI-EcoRI of pEGFP-C1 by replacing\nthe sequence in between.\n- Make sure you leave only one XhoI and EcoRI\nsite each.\n- Save as a file\n- Compare open reading frame of pEGFP-C1 and\npEGFP-C1 with CaMKII. Open reading frame\nshould be longer by the length of CaMKII.\n\nProtein sequence analysis\n- Amino acid content and molecular weight.\n- Translate the sequence of fusion protein.\n- Function->Content->Amino acid\nImage removed due to copyright restrictions.\nScreenshot of DNAsis program, \"Amino Acid Content\" window.\n\nNo report today\n- Send sequence of\n- Expected PCR product\n- Expected ligation product between pEGFP-C1\nand CaMKII\n- Send molecular weight of the fusion protein\n\n- Search identical or homologous sequence in\ndatabase.\n- Goto\nhttp://www.ncbi.nlm.nih.gov/\n- Click \"Blast\" (top of the page)\nBLAST search\nImage removed due to copyright restrictions.\n\nGenome Blast\nUse CaMKII amino acid sequence as query.\nUse TBLASTN program.\nImage removed due to copyright restrictions.\n\nProtein Secondary Structure\n- Use translated CaMKII sequence\n- Function-> Prediction->Protein Secondary Structure\nH: -helix\nS: -sheet\nT: - turn\nC: random coil\n- Compare two methods\nQuickTimeTM and a\nTIFF (Uncompressed) decompressor\nare needed to see this picture.\n\nHydrophobicity plot\n- Hydrophobic amino acids: Leu, Ile, Val, Phe\n- High in signal peptide and transmembrane domain\n- Use translated CaMKII sequence\n- Function -> Prediction -> Hydrophobicity\n- Compare these two proteins\n- If you want, check the identity of the protein by blast\nsearching and think in relation to the protein of function of\nprotein\n\nProtein 3D structure\n- Launch Cn3D\n- File->GFP.cn3\n- Click main screen and drag the structure to\nrotate\n- Highlight amino acids 64-66 from\nsequence/alignment viewer\n- Play around view and show/hide options"
    },
    {
      "category": "Resource",
      "title": "week03_lab02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/f0cca6f679c0c343c33c0dcbb4d3717a_week03_lab02.pdf",
      "content": "Second class: Sequence analysis and vector design\ncDNA blasting\nOpen the ab1 file called fwd_CMVfwd.Seq.txt with the program editview\nOpen the sequence of nucleotide file\nCopy the sequence (discarding the Ns)\nOpen NCBI BLAST website\nOpen the \"nucleotide-nucleotide\" link.\nPaste you sequence in the window\nClick \"BLAST\" button\nIn the next window, click the \"format\" button, and wait some 20-40 seconds\nStudy the sequences with the highest level of homology\n(we will discuss the results of the search)\nSequence comparison\nOpen DNAsis\nStart a new file (control N)\nSelect\"DNA sequence\"\nPaste sequence of fwd_CMVfwd.Seq.txt, and save on the desktop\nFrom the BLAST program, open the mouse homolog sequence and copy\nStart a new file for this mouse homolog on DNASIS, and paste it there.\nIn DNASIS, go to \"connect\" in the menu bar\nSelect the desktop folder and click \"go\"\nGo to \"results\" in the menu bar, and to \"auto connection\"\nChoose parameters\" 15 bp for minimal overlap and 50% for minimal matching\"\nClick select targets\nClick on the mouse homolog and fwd_CMVfwd.Seq.txt\nClick OK, click go\nThere should be a new sequence at the bottom of the window with the name\n\"fwd_CMVfwd.Seq.txt and mouse homolog\"\nClick on the new sequence, go to \"result\", and select \"open editor\"\nSelect \"unmatching bases\"\n(we will discuss the results of the comparisons\"\nGenomic blasting\nGoogle for \"mouse genome resources\"\nOpen \"blast\" and proceed as we did before with the blasting of cDNAS\nGo to genome view\nOpen the chromosome that has the positive hit\n(we will discuss the results of the genome search)\n\nIdentification of restriction sites\nOpen FUGW' with Strider program\nGo to \"enz' menu option, and check for absent sites, single sites, site usage and all sites\nCheck your notes from last week to figure out what kind of fragment you would expect\nusing BamhI, BglII or both\n(we will discuss results)\nIdentification of open reading frames\nOpen \"partial CamkII\"\nBlast it to find the complete mRNA\nMake a new file in strider and call it \"complete mRNA\"\nGo to \"AA\" menu, go to \"orf map\"and try to find an open reading frame of approx 1200\nbp.\nOne you figure out which frame is the right one, go to \"AA\", go to \"translation 1 phase 3\nletters to figure out the aminoacid content.\n(we will discuss results)\nSequence identification\nOpen mistery sequence\nCopy sequence (and exclude the final N's)\nBlast this sequence in cDNA blast\nIdentify gene\nIdentify ORF\nIdentify restriction sites for digestions\nNucleotide cDNA search\nGoogle NCBI pubmed\nSelect \"nucleotide\" option\nType name of gene identified in previous step\nFind the mouse, human and rat cDNAs for this gene\nUsing strider, find the open reading frames\nIn DNASIS perform comparison of the nucleotide sequences\nIn DNAsis, convert to protein and perform comparison of aminoacids"
    },
    {
      "category": "Resource",
      "title": "writingbasics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-12-experimental-molecular-neurobiology-fall-2006/f01815a1ca03befdf3e3ca96efc49876_writingbasics.pdf",
      "content": "Marilee P. Ogren PhD\nImage removed due to copyright restrictions.\n\nWhy am I here?\n- MIT alums wish they were better at scientific\ncommunication\n- To help with your summary essays\n- To contribute to your writing grade\n\nWhat is Scientific Writing?\nPrecise, concise, objective report of research data collected\naccording to the scientific method...\nAnd an intellectual journey that takes time and patience.\nImage removed due to copyright restrictions.\n\nTime to Convert...\n.....ready for professional writing?\nImage removed due to copyright restrictions.\n\nOld Habit New Habit\nBegin writing a paper at\n2AM that's due at 9AM\nUse language that sounds\nscholarly, serious,\nand smart\nMeet the page count\nWrite a first draft early,\nget feedback, and\nrevise it more than once\nUse language that exactly suits\nyour content\nWrite to communicate\n\nWhat are Some Methods for\nGood Scientific Writing?\nModel your writing after someone in your field\nwho is an especially good writer.\nConsult Texts on Scientific Writing.\nImage removed due to copyright\nrestrictions.\nCover of Alley, Michael. The Craft of\nScientific Writing, 3rd ed. New York,\nNY: Springer, 1998.\nImage removed due to copyright\nrestrictions.\nCover of Day, Robert. How to Write\nand Publish a Scientific Paper, 5th ed.\nCambridge, UK: Cambridge University\nPress, 1998.\n\nDevelop an Outline\nOutlines force you to:\n- establish the scope of your document\n- develop a point of view\n- partition material\n- sequence your topics\n- develop a writing strategy (even if you don't have an outline, you\nneed a strategy).\nOutline can be used to generate feedback, provide the subject\nheadings and topic sentences for your paper.\nWork out a general plan first, and then make the outline more specific.\nThe Mayfield Handbook: Section 1.5.1\nhttp://web.mit.edu/writing/temp2/home.htm\nImage removed due to copyright\nrestrictions.\nCover of Perelmen, Leslie and\nEdward Barrett. The Mayfield\nHandbook of Technical and\nScientific Writing. Burr Ridge,\nIL: McGraw-Hill Higher\nEducation, 1997.\n\nWhen Publishing in a Peer-Reviewed Journal\nRead the Guide to Authors\ne.g., J. Bac., Materials and Methods\nImage removed due to copyright restrictions.\n\nExperienced Scientific Writers...\nSeek Feedback\n- peer-edit\n- self-edit (after a long enough delay)\n- expert-edit\nExpect to learn by writing as well as to inform.\nRevise, revise, revise, revise, revise, revise, revise,\nrevise, revise, revise, revise, revise, revise, revise.\n\nConsider Three Aspects of Writing Style\n\nStructure is Revealed in:\nOrganization (backbone)\n- Headings, Subheadings, Topic sentences\nreflect your writing strategy\n\nHeading and Subheadings\nSTRUCTURAL ORGANIZATION\nis hidden in a long list of headings without secondary headings\nPerformance of\nthe Solar One Receiver\nIntroduction\nSteady State Efficiency\nAverage Efficiency\nStart-Up Time\nOperation Time\nOperation During Cloud Transients\nPanel Mechanical Supports\nTube Leaks\nConclusion\nPerformance of\nthe Solar One Receiver\nIntroduction\nReceiver's Efficiency\nSteady State Efficiency\nAverage Efficiency\nReceiver's Operation Cycle\nStart-Up Time\nOperation Time\nOperation During Cloud Transients\nReceiver's Mechanical Wear\nPanel Mechanical Supports\nTube Leaks\nConclusion\n\nTopic Sentences\nThey're more important than you realize\nReaders rely on a topic sentence\nas if it were a \"title\" for the paragraph\nImage removed due to copyright restrictions.\n\nStructure is Revealed in:\nOrganization (backbone)\n- Headings, Subheadings, Topic sentences\nreflect your writing strategy\nOrdering / Depth\n- Establish emphasis\nTransitions\n- Link ideas\nImage removed due to copyright restrictions.\n\nLanguage: Needless Complexity\n-\nFamiliarization (n)\n-\nHas the functionability (n)\n-\nUtilization (n)\n-\nFacilitate (v)\n-\nUtilize (v)\n-\nAforementioned (adj)\n-\nFirstly, secondly, thirdly (adv)\n-\nHeretofore\n-\nfamiliarity\n-\ncan function\n-\nuse\n-\ncause\n-\nuse\n-\nmentioned\n-\nfirst, second, third\n-\nprevious\n\nLanguage: Needless Words\n- Already existing\n- At the present time\n- Basic fundamentals\n- Completely eliminate\n- Continue to remain\n- Currently being\n- Empty space\n- Had done previously\n- Introduced a new\n- Mix together\n- Existing\n- At present\n- Fundamentals\n- Eliminate\n- Remain\n- Being\n- Space\n- Had done\n- Introduced\n- Mix\n\nLanguage: Needless Words\n- Never before\n- None at all\n- Now at this time\n- Period of time\n- Separate entities\n- Start out\n- Write out\n- Still persists\n- In order to\n- Never\n- None\n- Now\n- Period\n- Entities\n- Start\n- Write\n- Persists\n\nLanguage: Weak Versus Strong Verbs\n- Made the arrangement for\n- Made the decision\n- Made the measurement of\n- Performed the development\nof\n- Arranged\n- Decided\n- Measured\n- Developed\n\nLanguage: Passive Versus Active Voice\n-\nThe voltage was displayed by the\noscilloscope.\n-\nThe feedthrough was composed of\na sapphire optical fiber,\n-\nwhich was pressed against the\npyrotechnic\n-\nthat was used to confine the\ncharge.\n-\nThe oscilloscope displayed the\nvoltage.\n-\nThe feedthrough contained a\nsapphire optical fiber,\n-\nwhich pressed against the\npyrotechnic\n-\nthat contained the charge.\n\nVigorous Writing is Concise\nImage removed due to copyright restrictions.\nCover of Strunk, William and E. B. White. The Elements of Style.\nNew York, NY: Penguin, 2005.\n\nGOALS FOR SCIENTIFIC WRITING\nStructure\n-\nApparent: Headings, subheadings,\nand topic sentences are easily\nidentified and reflect your writing\nstrategy.\n-\nInstructive: The paper's headings,\nsubheadings, and topic sentences\norganizes the reader's thinking (can\nserve as a summary of the content when\nconverted to an outline).\n-\nAppropriate: Structural\ncomplexity matches the complexity\nof the content.\nLanguage\n-\nConcise: Sentences are succinct,\ncontaining no extra words.\n-\nPrecise: Word choice reflects a\nthoughtful process.\n-\nEngaging: Sentences are written in\nactive voice with strong verbs and\napt adjectives.\nImage removed due to copyright restrictions.\n\nGOALS FOR SCIENTIFIC WRITING\n-\nIllustrations\n-\nAppropriate: The choice of tables versus figures suits the data and would not be better\nexpressed as text.\n-\nWell designed: Illustrations are readable and attractive.\n-\nForm\n-\nCorrect grammar, spelling, and punctuation.\n-\nCorrect formatting.\nImage removed due to copyright restrictions.\n\nScoring System\n+\nThoroughly superior work. A model of good scientific\nwriting.\n+\nGood work. Requires only minor improvements in any of\nthe following areas: organization of ideas; economy of\nexpression; diction (word choice); grammar/punctuation/\nspelling.\n\nAcceptable work. Requires moderate revision in one or\nmore of the areas above.\n-\nAcceptable but rough work. Requires substantial\nrevision in all areas.\n-\nUnacceptable work.\nAssignment not handed in.\n\nPlease read\nWriting Readable Prose\nBy\nAmin S. Bredan & Frans van Roy\n\nEND"
    }
  ]
}