{
  "course_name": "Extrasolar Planets: Physics and Detection Techniques",
  "course_description": "This course covers the basic principles of planet atmospheres and interiors applied to the study of extrasolar planets (exoplanets). We focus on fundamental physical processes related to observable exoplanet properties. We also provide a quantitative overview of detection techniques and an introduction to the feasibility of the search for Earth-like planets, biosignatures and habitable conditions on exoplanets.",
  "topics": [
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics",
    "Science",
    "Earth Science",
    "Atmospheric Science",
    "Geophysics",
    "Planetary Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Prerequisites\n\nPhysics I: Classical Mechanics (8.01), Single Variable Calculus (18.01)\n\nCourse Description\n\nThis course covers the basic principles of planet atmospheres and interiors applied to the study of extrasolar planets (exoplanets). We focus on fundamental physical processes related to observable exoplanet properties. We also provide a quantitative overview of detection techniques and an introduction to the feasibility of the search for Earth-like planets, biosignatures and habitable conditions on exoplanets.\n\nFurther Background\n\nThis course is a systematic introduction to the fundamental concepts and principles of the field of exoplanet detection and characterization. The basic exoplanet detection methods are covered, based on the underlying physical concepts. Physical principles behind planet characterization are explored, and tied to observations and interpretation of exoplanet properties such as composition and temperature. Weekly problems sets are assigned, and include exercises related to using real data on exoplanets to derive their physical properties such as mass, radius, density, temperature or composition. Exoplanet research is a young field in planetary science and the material presented in the course covers the major techniques and methods used by exoplanet researchers.\n\nGoals\n\nAn introduction to the current state of knowledge and ongoing research in exoplanet detection and characterization.\n\nThe development of analytic skills to:\n\nFormulate and apply equations to measure exoplanet masses, radii, and semi-major axes from astronomy data sets.\n\nFormulate and apply equations to infer an exoplanet interior composition and atmosphere composition from astronomy data.\n\nRead graphs, judge the data quality, and interpret the meaning.\n\nThe ability to think critically and the habit of doing so actively at all times.\n\nLearning Objectives\n\nSummarize the physical concepts behind five different exoplanet discovery techniques.\n\nDerive and apply equations to measure a planet's radius, semi-major axis, and orbital inclination from a planet transit data set.\n\nDerive and apply equations to measure a planet's mass and semi-major axis from an exoplanet radial velocity data set.\n\nCalculate a planet's mass and radius given a homogeneous planet of a single composition with a given equation of state.\n\nDerive the 1D, plane-parallel radiative transfer equation. Use approximate solutions to this equation to explain the origin of exoplanet atmosphere absorption lines.\n\nList Earth's biosignatures with a discussion of the significance of each one.\n\nTextbooks and Class Handouts\n\nThe topic of exoplanets is so new and fast-paced that no textbooks exist. Instead we will use the book:\n\nde Pater, Imke, and Jack J. Lissauer.\nPlanetary Sciences\n. Cambridge, UK : Cambridge University Press, c2001. ISBN: 9780521482196.\n\nThis book is recommended and not required.\n\nAn additional supplementary book is:\n\nH. Karttunen, et al.\nFundamental Astronomy\n. New York, NY: Springer-Verlag, c2007. ISBN: 9783540341437.\n\nThis is an introductory astronomy textbook.\n\nTo compensate for the lack of an appropriate textbook, there will be regular reading handouts in lectures. These handouts include conceptual descriptions as well as analytical derivations. It is expected that regular attendance in lecture will offer the opportunity to pick up these handouts. Should you miss a handout, they will also be posted online.\n\nClass Participation\n\nThis is a discussion-based and problem-solving-based class. Over half of the class time will be spent problem-solving in small groups or in class discussion. In addition, your questions and comments are extremely valuable. Discussions during class time are especially appropriate given the lack of an exoplanet textbook. Discussion is highly encouraged to fill gaps in the lecture material, to guide the pace of the class, and for you to inquire about the meaning, relevance, and importance of lecture material.\n\nHomework\n\nApproximately weekly problem sets will be handed out on Thursdays and due the following Thursday before class.\n\nA note on submission of work. Collaboration on homework sets is permitted. The manner in which you present your work, therefore, is just as important (and in some cases more so) than the final answer. Be sure to delineate each step along the way. Show a clear and logical approach to your solution. This will make your problem sets both a better reference to you and easier for partial credit (if so deserving) for grading.\n\nGrades\n\nGrading Scheme\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n30%\n\nTest 1\n\n20%\n\nTest 2\n\n20%\n\nFinal exam\n\n30%\n\nTotal\n\n100%",
  "files": [
    {
      "category": "Resource",
      "title": "homework1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/391b3fa5594bb6b6d31d6a0f7ec8e6af_homework1.pdf",
      "content": "s\ns\n\nCourse 12.425. Problem Set 1. Due 20 Sept. 2007\n1. How long would it take for a spacecraft to get from Earth to the nearest star with an exoplanet?\nList any assumptions you made and show your calculation.\n2. Properties of known exoplanets. From the Extrasolar Planets Encylopaedia at (http://exoplanet.eu/), find\nthe interactive catalog for planet candidates detected by radial velocity (http://exoplanet.eu/catalog-RV.php).\nConstruct three different diagrams (either histograms or correlation diagrams). You may use any available\nparameter for the x and y axes (e.g., planet mass, radius, semi-major axis, year of discovery, etc.) Identify any\ntrends that are or are not present. The intention of this exercise is both to update the planet property diagrams\npresented in Lecture 1 and to explore exoplanet properties not discussed in class.\n3. Exoplanet transit light curves for non-central transits. See Figures 1 and 2.\na. Show that the transit duration for a non-central transit is\n\ntT = PR∗\n1 + Rp\na cos i\n.\n(1)\nπa\nR\n-\nR\n∗\n∗\nHere tT is the total transit duration, R is the stellar radius, Rp is the planet radius, a is the orbital semi-major\n∗\naxis, and i is the orbital inclination. Here i = 90* is \"edge on.\"\nb. Show that the duration of the \"flat part\" of the transit light curve, i.e. the time when the planet is fully\nsuperimposed on the stellar disk, is\n\nPR\nRp\na cos i\ntF = πa\n∗\n1 - R\n-\nR\n.\n(2)\n∗\n∗\nc. Describe why the impact parameter b is\na\nb =\ncos i.\n(3)\nR∗\nThe impact parameter b is defined as the projected distance between the planet and star centers during midtransit\nin units of R∗.\n4. Planet radius, star radius and mass, semi-major axis, and orbital inclination for HD 209458. For\nthis problem you will estimate Rp, R∗, a, i, and M\nfrom a real exoplanet transit data set. You will need the\n∗\nequations shown in problem 3, as well as the following: Kepler's Law\n4π2a2\nP 2 =\n;\n(4)\nGM∗\nthe stellar mass-radius relationship\n\nx\nM\nR\n∗ =\n∗\n,\n(5)\nM\nR\nwhere x will be defined below; and the planet-star flux ratio\n\nΔF =\nRp\n.\n(6)\nR∗\na. Download the data for the star-planet system HD 209458 from the MIT Server. Plot the transit\nlight curve: relative intensity vs. phase.\nb. Average the data into larger time bins. This will make the transit light curve more clear. For example, you\ncould average twenty adjacent points. Describe your method for averaging and approximately what duration\nyour time bins are.\nc. Estimate ΔF , tT , tF . Use P = 3.52474859 days .\nd. Using the equations in problem 3 and 4, part 4c, and and x = 2.61, derive Rp, R∗, a, i, and M∗.\ne. Estimate or compute the scatter in the data. In other words, by how much do the points deviate from an\naverage value? Describe the method you used.\n5. Planet radius, star radius and mass, semi-major axis, and orbital inclination for GJ 436.\na. through d. as in Problem 4. Use P = 2.64385 days and x = 1.\n\nFIG. 1: Definition of transit light-curve observables. Two schematic light curves are shown on the bottom (solid and dotted\nlines), and the corresponding geometry of the star and planet is shown on the top. Indicated on the solid light curve are the\ntransit depth ΔF , the total transit duration tT , and the transit duration between ingress and egress tF (i.e., the \"flat part\" of\nthe transit light curve when the planet is fully superimposed on the parent star). First, second, third, and fourth contacts are\nnoted for a planet moving from left to right (not needed for this problem set). Also defined are R∗, Rp, and impact parameter\nb corresponding to orbital inclination i. Different impact parameters b (or different i) will result in different transit shapes, as\nshown by the transits corresponding to the solid and dotted lines.\nFIG. 2: Transit planet schematic for deriving non-central transit parameters. Note the definition of i for orbital inclination\n(i = 90* corresponds to \"edge-on\"). Figure from R. Santana."
    },
    {
      "category": "Resource",
      "title": "homework2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/370250a43b27c4964d7856ddb002cd19_homework2.pdf",
      "content": "Course 12.425. Problem Set 2. Due 2 Oct. 2007.\n1. The Stellar Magnitude System.\na. Derive the stellar magnitude formula given below, using the fact that five magnitudes is a factor of 100.\nFb\nmb - ma = -2.5 log10\n.\n(1)\nFa\nb. If the planet-star flux ratio is 10-3, what is the difference in magnitude?\n2. Planet-Star Center of Mass. The HD 209458 star and planet system have the following properties: M =\n∗\n1.01M, Mp = 0.69MJ , P = 3.525 days, a = 0.045 AU, and e = 0.\na. Find a1, the star's distance to the planet-star common center of mass. How does this compare to the radius\nof the star HD 209458A (1.12R )?\nb. What is a2, the planet's distance to the planet-star common center of mass? How does this compare to the\nsemi-major axis a?\nProblems 3 through 6: Radial Velocity Fits to Real Data Sets.\nThe section lead by TA on Tuesday September 25 will introduce radial velocity fits to data sets as relevant to\nthis problem set. We will be using computers to try some fits. If you have a laptop, please bring the laptop to\nsection on Tuesday September 25. If you do not have a laptop, you can share with a friend,\n\nThe rest of this homework set involves orbital fits to radial velocity data sets. The fits correspond to model\nplanetary systems. The goal of the fitting procedure is to find a planetary model that does the best possible\njob of fitting the data. We will use the Systemic console to obtain the orbital fits. The console has all of the\nfeatures that professional astronomers use to find planets, and indeed, planets such as Gliese 581 c have been\nfound by users of the Systemic console before they were announced by professionals. It is possible that you can\ndiscover a previously unknown planet by doing the best possible job on problem 6.\nFor each planet you fit, be sure to print out either 1) a screen shot of your best fit, including the χ2 value or\n2) the data plot including your fit, and a list of χ2, period, mass, mean anomaly, eccentricity, and longitude of\nperihelion. See the attached sample printout. If a residual periodogram is needed in a given problem, please\nprint and submit that periodogram as well.\nPlease make sure to upload your fits for problems 3, 4b, 5a,b and 6 to the Systemic backend. Also, be sure to\nsave all of your work on your desktop.\n3. Getting Going.\na. Download the console from http://oklo.org/?page id=86 and install it on your computer. The directions are\ngiven on the download page.\n\nb. Register as a new user on the Systemic backend at http://www.oklo.org/php/login.php. The first nine\ncharacters of your username should be mit12 425. The last characters should be initials.\n\nc. Follow the first two tutorials using the console. They are available at www.oklo.org.\nd. Following the instructions on the backend, upload the fit for Upsilon Andromedae that you will make using\ntutorial 2. Please make sure that your χ2 value is as close to unity as possible.\n4. 51-Pegged. In 1995, two Swiss astronomers shocked the world by announcing that they had discovered a\nbizarre planet orbiting the Sun-like star 51 Pegasi. It is interesting to find this planet in the radial velocity data\nsets, which are available on the console under 51Peg B06L.\na. Using the periodogram to get started, find the best 1-planet fit to the data set. What period and mass does\nthe planet have?\nb. Using the periodogram of the residuals, find a 2-planet fit to the data. You must submit this fit following the\ninstructions on the backend, as you did for the previous problem. Do not submit your results for part (a)! What\nis the value of the F-test statistic for your 2-planet fit in comparison to your 1-planet fit? Does this indicate a\nstrong chance that you have discovered a new planet?\n.\n\nc. Explain how one could go about confirming whether this second planet is really present in the system.\nd. The data set 51peg-cc contains only the data obtained by the California-Carnegie planet search team. Are\nboth planets present in this dataset? Give a reasonable hypothesis for what might be going on here.\n5. Trois Neptunes. HD 69830 is a multiple-planet system with three low-mass planets.\na. Using the console, find a three-planet fit to the data set that has the lowest possible χ2 .\nb. Upload your fit to the Systemic backend.\nc. Integrate your fit for 1000 years using the stability checker. (This make take minutes to hours to run,\ndepending on your stepsize and which integrator you choose). Is the system stable?\nd. Increase the mass of the middle planet to one Jupiter mass (this makes the χ2 go way up.) Is this modified\nversion of the system stable?\n6. Bonus Problems: Your Chance to Help Find New Exoplanets.\na. HD 74156 HET07 is a new 3-planet system just announced. Find the best 3-planet fit to this system.\nb. GJ876 is a 3-planet system. There is evidence for an additional, potentially habitable planet in this system.\nFind the best 4-planet fit and provide the F-test probability for the stability of this 4th planet."
    },
    {
      "category": "Resource",
      "title": "homework3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/54f429c80ff58b39458ffec375f877f9_homework3.pdf",
      "content": "Course 12.425. Problem Set 3. Due 25 Oct. 2007.\n1. Star and Planet Radii.\na. The smallest star is a so-called M9 dwarf star which has a radius 0.09Rsun and a mass 0.08Msun. How does\nJupiter compare in radius and mass to such a star?\nb. How can a star be smaller than a planet when the star is so much more massive?\n2. Equations of State.\nIn class we discussed equations of state and phase diagrams.\na. Define equation of state.\nb. Which phase diagram shown in class did you find most interesting? Write one to two paragraphs on that\nphase diagram. You may cross-reference with the web.\n3. Planetary Interior Structure I.\nFor this question and the next you will develop a numerical code to integrate the equations of planetary interiors.\nIn class we reviewed the equations for planetary structure. Mass of a spherical shell\ndm(r)\ndr\n= 4πr2ρ(r);\n(1)\nthe equation of hydrostatic equilibrium\ndP (r)\ndr\n= -Gm(r)ρ(r)\nr2\n;\n(2)\nand the equation of state (EOS)\nP (r) = f(ρ(r), T (r)).\n(3)\na. Solve the equations numerically for a polytropic equation of state. Use the polytropic index n = 3/2.\nP ∼ ρ(n+1/n).\n(4)\nPlot the result of ρ vs. r, P vs. r, and m vs. r.\nb. Show that for constant density Mp ∼ R3 .\np\nc. For a pure electron degenerate gase (index n = 3/2) does Mp ∼ R-3?\np\n4. Planetary Interior Structure II.\nUse the equations in the above question.\na. Consider the modified polytropic EOS, ρ = ρ0 + cP n . Why is there no analytical solution to the equations\nof planetary interiors with this EOS?\nFor parts b and c you will use your numerical code to integrate the equations of planetary interiors. You may\nuse the modified polytropic EOS above. See the below table for ρ0, c, and n.\nb) Find the radius of a homogeneous water planet of 5M⊕. What is the central pressure? List your boundary\nconditions.\nc) What is the central pressure of a homogeneous planet with 10M\nand 2R ? First use the central pressure\n⊕\n⊕\napproximation derived in class. Next use your code to find the central pressure.\nMaterial\nρ0 [kg m-3] c [kg m-3 Pa-n] n\nFe(α)\n8300.00\n0.00349\n0.528\nMgSiO3 (perovskite) 4100.00\n0.00161\n0.541\nH2O (Ice VII)\n1460.00\n0.00311\n0.513"
    },
    {
      "category": "Resource",
      "title": "homework4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/d5da6a63493304702109418ec3a520a9_homework4.pdf",
      "content": "Course 12.425. Problem Set 4. Due 1 Nov. 2007.\n1. Planet Albedos and Related Questions\na. Which body in our solar system has the highest albedo?\nb. One analogy for the brightness ratio of an Earth-twin is: looking for a firefly 6 feet away from a searchlight\nthat is 2,600 miles distant. Come up with a similar analogy for a planet with Rp = 2R\nthat is twice as close\nto a star that has a temperature two thirds that of the sun.\n⊕\nc. If the Moon's albedo were 0.9 instead of 0.1, how would this affect the Earth?\n2. Black Body Radiation.\nIn class we discussed: black body radiation B(ν, T ),\nB(ν, T ) = 2hν3\nc2\nehν/kT - 1 ;\n(1)\nplanet flux F ; and the Stefan-Boltzmann law,\nF = π\nZ inf\nB(ν, T )dν ≡ σRT 4\neff .\n(2)\nDerive the radiation constant\n\n2π5 h\nk\nσR = 15 c2\nh\n,\n(3)\nand give its value and units. Here h is Planck's constant, c is the speed of light, and k is Boltzmann's constant.\n3. Planet Temperature and Energy\nFor this problem we will assume stars and planets can be approximated by black bodies. We will use the\nequilibrium temperature derived in class\n\n1/2\nTeq = Teff,∗\nR∗\n[(1 - AB)]1/4 .\n(4)\na\nHere a is the semi-major axis, and f 0 and AB is the Bond albedo.\na) Compute Teq for a hot Jupiter orbiting a sun-like star. The hot Jupiter has a = 0.04 AU, AB = 0.01.\nb) Compare the energy Earth receives from the sun (using Teq and the Stefan-Boltzmann law) to the energy\nemitted from Earth's interior, 55 terra Watts."
    },
    {
      "category": "Resource",
      "title": "homework5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/b0e5c99207a52cdb5698e2688d1c72c6_homework5.pdf",
      "content": "Course 12.425. Problem Set 5. Due Tuesday 20 Nov. 2007.\nFor all problems be sure to show your work including all steps taken.\n1. Exoplanet Detection: Direct Imaging vs. Radial Velocity\nIn class we discussed the planet candidate 2M1207 discovered by direct imaging. This planet has an estimated\nmass of 4 MJ , a semi-major axis of 46 AU, and a brown dwarf parent star with M = 0.025 M. Is it feasible to\ndetect this planet by the radial velocity method? Use formulae developed in past lectures.\n2. Planet Atmosphere Scale Height.\nSome humans climb to the summit of Mt. Everest without requiring bottled oxygen. On a super Earth, how\nhigh could they climb without bottled oxygen, assuming the same surface atmospheric pressure as on Earth.\nConsider that Earth's atmospheric scale height is 7.4 km, and the super Earth has a = 0.1 AU, M = 10M⊕,\nR = 1.5R , and orbits a sun-like star. Use the scale height definition from class lecture notes.\n⊕\n3. Atmospheric Escape\nIn class we discussed atmospheric escape as the primary sink for atmospheric loss.\na. Derive a formula for escape velocity.\nb. Make a plot of star luminosity (in units of solar luminosity L ) (y axis) vs. escape velocity (x axis) for all\nsolar system planets and Earth's moon. On the same plot, plot all transiting exoplanets. You may find the\ntransiting exoplanet data from the website http://exoplanet.eu/catalog.php, but only consider exoplanets with\nmeasured masses and radii. Because star luminosity data is not available, you may assume that\n\n3/5\nL\nM\n=\n.\n(1)\nL\nM\nIf an exoplanet's host star's mass and/or radius is not available, make your best guess. Hint: use a log/log plot.\nc. Based on the plot from 3b, discuss (in one to two paragraphs) which solar system planets are affected by\natmospheric escape and which exoplanets may be affected by atmospheric escape.\nd. Based on the plot from 3b, choose a planet mass, radius, and semi-major axis for a planet orbiting a sun-like\nstar that would be dramatically affected by atmospheric escape."
    },
    {
      "category": "Resource",
      "title": "homework6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-425-extrasolar-planets-physics-and-detection-techniques-fall-2007/1c6064e1c9b4c86e128d3bef04dbeb98_homework6.pdf",
      "content": "Course 12.425. Problem Set 6. Due Thursday Dec. 6, 2007.\nFor all problems be sure to show your work including all steps taken.\n1. Atmospheric Escape\nNote: this is the same problem given in Problem Set 5, but with a correction to b. We assume your answers in\nc and d will also change.\nIn class we discussed atmospheric escape as the primary sink for atmospheric loss.\na. Derive a formula for escape velocity.\nb. Make a plot of relative stellar heating (in units of solar luminosity L\n= L/4πa2 at Earth) (y axis)\n⊕\n⊕\nvs. escape velocity (x axis) for all solar system planets and Earth's moon. On the same plot, plot all transiting\nexoplanets. You may find the transiting exoplanet data from the website http://exoplanet.eu/catalog.php, but\nonly consider exoplanets with measured masses and radii. Because star luminosity data is not available, you\nmay assume that\n\n3/5\nL\nM\n=\n.\n(1)\nL\nM\nIf an exoplanet's host star's mass and/or radius is not available, make your best guess. Hint: use a log/log plot.\nc. Based on the plot from 3b, discuss (in one to two paragraphs) which solar system planets are affected by\natmospheric escape and which exoplanets may be affected by atmospheric escape.\nd. Based on the plot from 3b, choose a planet mass, radius, and semi-major axis for a planet orbiting a sun-like\nstar that would be dramatically affected by atmospheric escape.\n2. Exoplanet Spectra\nIn class we discussed qualitatively where absorption lines come from. For this problem, use the solution to the\nradiative transfer problem derived in Lecture 15 to explain why a planet atmosphere with increasing temperature\nwith increasing altitude results in emission lines.\n3. Comparison of Exoplanet Detection Techniques\nFigure 1 summarizes four different exoplanet detection techniques including radial velocity, transit searches,\nastrometry, and microlensing.\nRadial Velocity.\na. Using the equation for radial velocity semi-amplitude, qualitatively describe the slope of the radial velocity\ndetection lines.\nb. At approximately 5 AU, the radial velocity detection lines change slope. Why?\nTransits vs. Radial Velocity\nc. Look at the COROT transit curve and the radial velocity 2010 curve. Why does the transit search technique\ndo better at smaller semi-major axes than the radial velocity technique? Why does the transit technique do\nworse at larger semi-major axes?\nAstrometry\nd. The STEPS, VLTI and KECK, and SIM curves are all astrometric planet searches. Using mass balance,\nquantitatively describe the astrometry detection curve at small semi-major axes.\ne. Why is there the curve \"V\"-shaped?\nf. Why does the semi-major axis location of the dip in the \"V\"-shape differ for different surveys?\nMicrolensing\ng. How does the microlensing detection limit differ from the three other planet search techniques shown?\nGeneral\nh. If you were to start a planet survey, which technique would you choose and why?\nBonus Question\ni. What is the green shaded region?\n\nFIG. 1:"
    }
  ]
}