{
  "course_name": "Feeling and Imagination in Art, Science, and Technology",
  "course_description": "This course is a seminar on creativity in art, science, and technology. We discuss how these pursuits are jointly dependent on affective as well as cognitive elements in human nature. We study feeling and imagination in relation to principles of idealization, consummation, and the aesthetic values that give meaning to science and technology as well as literature and the other arts. Readings in philosophy, psychology, and literature are part of the course.",
  "topics": [
    "Humanities",
    "Literature",
    "Philosophy",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Humanities",
    "Literature",
    "Philosophy",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nDescription\n\nThis course is a seminar on creativity in art, science, and technology. We discuss how these pursuits are jointly dependent on affective as well as cognitive elements in human nature. We study feeling and imagination in relation to principles of idealization, consummation, and the aesthetic values that give meaning to science and technology as well as literature and the other arts. Readings in philosophy, psychology, and literature are part of the course.\n\nStudents are encouraged to do original work based on their own experience and expertise in whatever field of science, technology, or humanities in which they specialize. Most of the students are undergraduates, but they and the graduate students are expected to treat the course as a graduate seminar.\n\nThere are no quizzes or exams, but students are required to attend every class (whether or not there are conflicting exams or study groups in other courses), arrive on time, and do the assigned reading for each weekly session. Attendance, lateness, class participation, will be a factor in the final grade. One long paper will be due at the end of the course. This paper will be at least 3500 words long (as indicated by the computer word-count on the first page). The paper will be double spaced (28 pts) and with a font of 14 pts.\n\nRequired Text\n\nSinger, Irving.\nFeeling and Imagination: The Vibrant Flux of Our Existence\n. Lanham, Md.: Rowman & Littlefield, 2001. ISBN: 0742512347.",
  "files": [
    {
      "category": "Resource",
      "title": "Creativity and Machine Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-262-feeling-and-imagination-in-art-science-and-technology-spring-2004/f979f45231b47fb9f16e55198e24358a_creativity_mach.pdf",
      "content": "Nick Martinez\nMay 11, 2004\n24.262\nWORD COUNT: 3,204\nCreativity and Machine Design\nRobots and machines have become very prevalent within recent years.\nWe use robots to assemble cars, explore dangerous areas, and even as\nservants to clean our houses. In the future, we might even see robots help in\ndelicate complex tasks like performing surgery. Many people think that the\nprocess that goes behind designing a robot is unimaginative, involving a lot\nof dull equations and assembly lines. In reality, the design process can be\nvery creative.\nWhile the process behind designing a machine is creative, it should be\nnoted though that eventually engineers were going to design robots to\nperform these tasks. Leonardo Da Vinci sketched early ideas for a helicopter\nin the thirteenth century, which only became a reality in twentieth century.\nRobotic maids that can clean the house was a futuristic idea that was seen in\nthe 1960's cartoon \"The Jetsons\", but the idea of having a robot vacuum the\nfloor has only became popular in the last year or so with iRobot's Roomba.\nOnce engineers found the way to control their machines through the use of\nmicrocontrollers and programming, the cost effectiveness and precision of\nmachines enabled them to be used in a wide variety of tasks. Although the\n\nideas for the next tasks for machines may not be creative, the process that\ngoes into developing that machine is a creative process.\nOne of the most popular vacuum cleaners at this time is iRobot's\nRoomba. The creative engineering behind the Roomba enables the robot to\nmuch less expensive when compared to other robotic vacuums of the same\nsize. Most of the other robots use a complex set of sensors and integrated\nprogramming to navigate across a floor. The Roomba on the other hand uses\na creative and inexpensive system of infrared sensors in order to keep the\nprice and complexity to a minimum.\nMIT's Introduction to Design and Manufacturing class, 2.007, teaches\nthe entire design process. The class is also a contest in which the students'\nmachines compete on a large obstacle ridden table. Each round is only forty-\nseconds long. Each machine must be under the ten pound weight\nrequirement and under the size constraints. The students are only given a\nlimited amount of materials to construct their machine. The course tries to\ncombine the creativity aspect of machine design with the precise nature of\nengineering. When first starting to work on the problem, the students usually\ncome up with a large number of underdeveloped ideas. In order to organize\nand develop our ideas, we are taught to follow the provided design process.\nIn the very beginning, the students are told to only think about the various\n\nmethods to score. By playing around with the table enough, a student can\nstart playing around with the table in his or her mind. This thinking produces\nthe useful insight and information necessary to build the machine. The\ncourse also uses a funnel design method, where the previous decision leads\nto a new branch of ideas and decisions. For example, thinking about one\nstrategy can lead to 5 concepts that can execute the strategy, and one of the\nconcepts can lead to 5 different modules. This type of thinking is seen in\nT.F. Hanson's Engineering Creativity. Hanson calls the set of decisions his\nDecision Tree, which is a way to \"attempt to organize our attack on the\ndesign problem\" (1987, p.64). At the center of the tree is the first decision\nmade which all other decisions stem from. In the case of 2.007, the student's\nstrategy would be in the center. Out from the center come various branches,\ngoing out further and further as the number of decisions increase. In 2.007,\nthe next branches would be concept, modules, and components in the order\nof increasing decisions. The tree is broken up into 6 or more sections,\ndepending on how many designs you are thinking about. This Decision Tree\nprovides a great way to compare and see all the different designs after each\ndecision.\n\nThe first step in building a machine is the design phase. In this phase,\nthe engineer first must identify what the problem is. In the case of the\nrobotic vacuum cleaner, the engineers had to find a way for a robot to clean\nthe floor. As simple as it sounds, there are actually a lot of solutions to this\nproblem. The robot can clean hardwood floors, carpeted floors, or both. The\nrobot can do wet floor cleaning or dry floor cleaning. The robot can be\nautonomous or remote controlled. It almost seems that there are an infinite\nnumber of ways to clean a floor. However, the ultimate goal of the project\nwas to get the most profit out of selling its robotic vacuum. In addition to\nwanting a lot of people buying their product, the company also wanted to\nminimize the costs to produce it. These constraints are the creative factors of\nthe design process. Without the constraints, any simple design would work.\nFor example, if there were no constraints in building bridges, than even a\npiece of cardboard would suffice for a bridge. The constraints are what force\nengineers to think up of new creative ideas which meet all the desired\nrequirements. In the case with the robotic vacuum cleaner, the company\ndecided that an autonomous, yet random, carpet cleaning robot would appeal\nenough to the customers to buy it while keeping production costs low\nenough to generate the maximum profit. The use of a simple system of\ninfrared sensors, instead of usual array of complicated sensors, was the\n\ncompany's creative solution to a robot that can cover the majority of the\nfloor while being relatively inexpensive. This balance of low costs and\nfunctionality is what made the Roomba a popular robotic vacuum.\nIn the case of the 2.007, the students had to find the way to score more\npoints than their opponent. The possible scoring methods included dumping\nmass into the mass bin, rotating the paddle wheels, and pushing the time\nelapse button. The robots could also prevent the other robot from scoring,\nlike setting up a fence to block their opponent's mass bin. The main\nconstraint was the forty-five seconds allotted for the contest. In order to\nfigure out what was the way to get the most points, the students had to look\nat the scoring equation used to determine the final score. By graphing the\ndifferent variables, the students were able to determine that putting mass into\nthe mass bin first and then spinning the paddle wheels was the best way to\nscore. This is why most students ended up building a fool-proof way of\nobtaining a shot-put.\nWhen first thinking about solving an engineering problem, the\nnumerous factors and variables may seem overwhelming. The mind starts to\nfill with all sorts of numbers and new ideas start to arise. While most would\nthink an engineer's job is instantly find an answer to the problem, Hanson\ndoes not believe this is the case. Hanson states that the creative engineer\n\ngoes through an \"incubation period\" when the engineer should \"deliberately\navoid thinking about the problem\" while \"not engaging the subconscious in\nanother creative problem\" (1987, p.20). In this period, all the information\nand numbers the engineer first saw when he or she first approached the\nproblem becomes subconsciously manipulated in engineer's mind. While the\nengineer goes about his or her daily life, the subconscious continues to\nmanipulate the numbers until it gets an answer. At this moment, the engineer\nis overcome by a \"sudden flash of insight\" and solves the problem. The\nengineer's subconscious is able to manipulate the variables thanks to the\nengineer's imagination. Irving Singer talks about imagination and\npossibilities in his book Feeling & Imagination: the Vibrant Flux of Our\nExistence. Singer explains that \"imagination belongs to our awareness of all\nother types of possibilities\" (2001, p.32). The imagination allows the\nengineer to tinker around with all the possibilities in an attempt to solve the\nproblem. Engineers can imagine what will and will not work by using their\nimagination in addition to several idealizations based in fundamental\nphysics. Singer states that the \"intellect constructs ideas of what shall count\nas perfections\" in order to compromise with the imperfect cosmos (2001,\np.69). Complex systems have a lot of complex physics that explains the\nsystem's behavior, but only a small number of the factors contribute a\n\nsignificant result. For example, if an engineer wanted to study a vibrating\nobject, the engineer can linearize the system in order to make the\ncalculations simpler. This approximation though is only valid under small\nperturbations. Otherwise, the ideal imagined system no longer models the\nrealistic system. The engineer's imagination may want to construct a very\ntall and elaborate building, but the idealizations remind him that all the\nforces should not cause the building to buckle in.\nLuck also seems to be a factor in the design process. For example,\nAlexander Fleming mistakenly discovered penicillin after returning from\nvacation. Fleming apparently forgot to wash his Petri dishes and returned to\nsee something growing on the dish. He noticed that the mold growing on the\ndish had no bacteria around it. He found that the mold secreted a chemical to\nfight the bacteria. This became known as penicillin. Fleming was creative\nfor realizing that mold could be used to fight bacteria. The normal idea is\nthat mold is almost as dirty and germ ridden as bacteria. Who would have\nthought one rotting blob could prevent another rotting blob? John Sheehan in\nhis article \"On Applied Science\" states that \"through the flexibility of the\nmethod [we] synthesized a number of variants of the molecule\" (1960, p.97).\nThe other researcher's creativity was seen as they manipulated the penicillin\n\nto get different variants with different advantages. Penicillin is now used\nfrequently to save lives as a strong anti-biotic.\nWhile luck can lead to a creative idea, total concentration on a\nproblem can also have the same effect. Alex F. Osborn writes in his book\nApplied Imagination that \"all-out intent begets an all-around awareness\nwhich also helps us creatively\" (1957, p.195). When dealing with a lucky\nsituation, the person must be aware of the problem and all the information\nbehind it in order to take advantage of the lucky opportunity. If Fleming had\nnot been aware that the mold was repelling the bacteria, he may not have\ndiscovered penicillin. Putting in a lot of attention on the problem can raise\nalertness. If a person only thinks about the problem, even the minutest detail\nbecomes very apparent to the researcher. When a small change happens in\nan experiment, like how the mold repelled the bacteria, the person will be\nnotice it and start to develop a creative solution to the problem. Osborn\ncontinues to write \"as awareness goes beyond receptivity, it becomes active\ncuriosity\" (1957, p.195). This curiosity keeps the researcher asking\nquestions in order to solve the original problem. Eventually, the researcher\nwill ask the question that will lead to an important piece of information in\nsolving the problem. Lastly, Osborn states that \"we tend to overestimate the\npower of inspiration and wait for lightning to strike us\" (1957, p.196).\n\nSometimes, if a researcher just continues to work on the problem, eventually\nan answer will come. By continuing to work, the researcher's awareness\nincreases because the problem is now a significant part of the researcher's\nlife. The increase in awareness may help the researcher catch an important\nfact necessary for solving the problem.\nMost people think that creative people are naturally isolated from the\nrest of society. The idea of the starving artist always brings up the idea of an\noutcast who lives by themselves in a dark apartment trying to create\nsomething new. While engineers are not normally seen in this way, a lot of\nengineers like to think on their design problems alone. Hanson writes \"the\nhistory of creativity seems to support this theory, since it lists achievements\nby individuals rather than teams\" (1987, p.22). When a group of creative\nengineers are together, everyone's ideas tend to interfere with each other.\nUsually, the most outspoken engineer ends up convincing the other\nengineers that their idea is the best. Hanson adds \"a creative thought may\noccur to someone in a committee meeting, but it probably means that person\nwas not paying attention to the meeting\" (1987, p.23). Once the engineer\ngets an interesting idea, that person's mind starts to play around with the\nidea and possible uses. That person may be missing the meeting, but at that\nmoment nothing other than the idea matters.\n\nWhile the engineer would like to think creatively by themselves, most\ncompanies set up groups to tackle new products. Hanson states that the\ncommunication between creative engineers is \"comparable to linking two or\nmore computers using Samuel Morse's first telegraph\" (1987, p.22). An\nengineer can understand their own idea really well, but the idea becomes\nconvoluted when that person tries to convey it another person. This causes a\nreally good idea to turn into an unappreciated bad idea since no one can\nunderstand the concept.\nSome classes at MIT have started to teach a new process that will help\ncommunications between students working on design projects. In 2.007, the\nstudents are required to use the Peer Review Edit Process, or PREP for short.\nThe students develop ideas on the problem individually, so not too stifle\neach other's creative process. The student then must jot down the pertinent\nequations and a clear description of physics involved. The student should be\nable to describe the physics as this shows a clear understanding of the\nproblem and clearly describes the problem to the other group members.\nThen the group comes together and comments each other's ideas. After\nlooking over all the comments, the individuals back and improve on the\nideas. This process enables the individual to be as creative as he or she wants\nwhile expressing his or her idea to the entire group.\n\nThe first step in the design process is to gather all the necessary\nnumber, which allows the engineer's mind to play around with all\npossibilities. However, sometimes the engineer doesn't have all the numbers\nnecessary. The engineer has several options to get around this. The engineer\ncan either estimate the numbers for a quick reality check or run an\nexperiment to get the numbers. Choosing what experiment is also a creative\nprocess. Sheehan states that there are two types of science. The sciences are\nthe \"purely pencil-and-paper [science] of coordinating data or perhaps trying\nto extrapolate the data a bit; the other trying to design experiments which\nwill uncover new principles and furnish new data for the theoretical person\"\n(1960, p.95). The engineer that performs all calculations by hand is not\ncreative. That person is not creating a new equation or new method to solve\nthe problem. Once this engineer runs into a problem that has not been\nencountered before, he or she will no longer be able to solve the problem\nbecause there is no equation to solve it. The experimental engineer will only\nneed to apply the design process to his problem to find a new solution. In\nthis case, the problem is how to extract the missing data. The engineer will\nthen proceed to digest all the information and come up with a new way to\nget the necessary numbers. This experiment might even lead to a new\nequation, which the pencil-and-paper scientist can use.\n\nIf a computer were to create something, would it be labeled as\ncreative? In August of 2000, researchers Hod Lipson and Jordan Pollack\ndeveloped a system that was able to translate the computer's design into a\nprototype. The idea behind the system is called artificial life, where\nresearchers try to build complex systems using fundamental theories of life,\nlike natural selection. This simulation gives the computer a string of\ncommands which act as an artificial genome. Each string tells the computer\nto build another device. The strings are also allowed to combine to make\nnew systems. The devices where printed out using a new method of rapid\nprototyping. In the end, their computer built some systems that were able to\nperform basic locomotion. Does the fact that the computer made a machine\nmake the computer creative? The ability to create something does not\nnecessarily mean the act is creative. The computer is only following the\nprogram its owners have programmed into it. In this case, the programmers\nhave programmed a natural selection simulation. In a way, the computer is\nunder too many design constraints. The program only allows for one process\nto continue, while a creative person's mind actually undergoes different\nphases of design. The natural selection program chooses the next machine to\ncontinue using a range of criteria to find the best machine. However \"there\ncan be no feedback from the physical world into the evolutionary process\".\n\nWhat would happen if the environment changed, which would cause the\ncriteria to change? The computer's machine may not be functional under\nthese new conditions. While the computer may or may not end up with a\nfunctional machine, the creative engineer will always come up with some\nmachine since he or she can always use a different thought process to find\nthe answer.\nThe design process actually involves quite a bit of creativity. The\nproblems and ideas for new machines are not necessarily creative.\nTechnology is constantly evolving. When a piece of technology is cheaper\nand more efficient than the old method, technology will replace it. Part of\nthe creativity come from the constraints placed on the problem. By finding\nand exploiting the constraints, engineers can come up with new and useful\nmachines. In order to organize ideas and to get a better understanding of the\nproblem, it is sometimes important to take a couple steps back and work on\nanother task. This incubation period gives your mind some time to sort\nthrough all the information and hopefully give you a flash of inspiration.\nHowever, a flash of inspiration does not always occur. At times like this, it is\nbest to sit and concentrate on the problem. Your increased concentration will\nmake you more aware to the problem at hand, letting you notice small but\nimportant facts. This increased awareness can also help when luck happens\n\nto knock on the engineer's door. Most creative people prefer to think alone\nbecause the ideas of others can stifle and interfere with their own ideas,\nlosing a potentially important idea. The first thing to do when attacking a\ndesign problem is to get all the necessary information. If this is not possible,\nthe creative engineer will perform an experiment to find the necessary\ninformation.\nBibliography\nBrooks, Rodney. \"Artificial life: From Robot Dreams to Reality\". Nature\n406 (2000): 945-947. Retrieved May 10, 2004, from www.nature.com\nHanson, T. F. Engineering Creativity. Newhall, CA: 1987.\nOsborn, Alex F. Applied Imagination. New York, NY: Charles Scribner's\nSons, 1957.\nSheehan, John C. \"On Applied Science\". The Creative Mind and Method.\nAustin, TX: University of Texas Press, 1960. pp. 95-97.\nSinger, Irving. Feeling and Imagination: The Vibrant Flux of Our Existence.\nLanham, MD: Rowman & Littlefield Publishers, Inc. 2001."
    },
    {
      "category": "Resource",
      "title": "Human and Computer Creativity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-262-feeling-and-imagination-in-art-science-and-technology-spring-2004/9e5c53756f415bd54a68024c909b2afb_24262wed_1145pm1.pdf",
      "content": "Ryan Roberts\n24.262 Feelings and Imagination\n05/13/04\nWord Count: 4004\n\nThe walls of the Louvre are covered with artistic masterpieces, widely\nrecognized as some of the most treasured, creative works known to man.\nThe unique stroke of a brush or the layering of paint can distinguish these\ngeniuses from the masses. Despite the ability to label these pieces of art as\nespecially creative, it remains unclear how one can truly qualify the defining\ncharacteristics of creativity. This faculty is commonly viewed as intangible,\nas 'a spark of creativity,' or, 'a flash of creativity.' This phenomenon, which\nlies at the foundation of our artistic culture, eludes our current grasp of\nunderstanding. For some, creativity rests within our human nature as an\nintegral part of our being, for others, it may emerge from the great\nmechanical complexity of our brains, or the randomness of the universe. In\nrecent years there have also emerged visual and literary works by computers\nwhich some experts believe to have a creative nature. This controversial\nidea causes unease in many that characteristics we commonly assume to be\ninnately human could manifest in a machine. However, after viewing the\nworks created by computers, it becomes necessary to consider the possibility\nof such creative ability whether or not the works themselves are creative. In\n\nmy paper, I will explore the possibility of computer creativity through a\ncontrast with human creativity, current examples of possible creative works\nby computers, and recent theories concerning how this can be achieved.\n\nThough one can find examples of human creativity in nearly all\naspects of life, perhaps it is most clearly evident in our literature. The\nthoughtful combination of words can express the gauntlet of human\nemotions and experiences aptly, and in the most talented of authors, can\nbreathe life into the words and seemingly recreate the experiences in the\nmind of the reader. Notable and critically praised author James Joyce\nprovides an example of this in his work Ulysses:\nAs we, or Mother Dana, weave and unweave our bodies, Stephen said,\nfrom day to day, their molecules shuttled to and fro, so does the artist\nweave and unweave his image. And as the mole on my right breast is\nwhere it was when I was born, though all my body has been woven of\nnew stuff time after time, so through the ghost of the unquiet father\nthe image of the unliving son looks forth. In the intense instant of\nimagination, when the mind, Shelley says, is a fading coal that which\nI was is that which I am and that which in possibility I may come to\nbe. So in the future, the sister of the past, I may see myself as I sit here\nnow but by reflection from that which then I shall be (Joyce 186-7).\n\nJoyce's ability to produce creative analogies shines through in this passage;\nthough Stephen's physical characteristic of the mole on his chest remains the\nsame, he declares that his \"body has been woven of new stuff time after\ntime.\" This analogy of the physical characteristics of his body through time\nis a deep insight into the contrast between the ever-changing individual and\n\nthe continuity of a human being's identity throughout his lifetime. Not only\ndoes he express an insight into\nhuman nature, which is far from readily obvious, he creatively uses powerful\nimagery, such as 'the ghost of the unquiet father,' which strikes the reader,\npainting clear pictures of seemingly intangible subjects.\nWhile Joyce masterfully provides examples of these basic\ncharacteristics of literature, the more controversial William Faulkner\nprovides an alternate creative style. In his novel, The Sound and the Fury,\nhe melds stream-of-consciousness with normal prose to present an intensely\nemotionally-charged work.\nPeering into the mind of one of the characters, the reader witnesses:\nHats not unbleached and not hats. In three years I can not wear a hat. I\ncould not. Was. Will there be hats then since I was not and not\nHarvard then. Where the best of thought Father said clings like dead\nivy vines upon old dead brick. Not Harvard then. Not to me, anyway.\nAgain. Sadder than was. Again. Saddest of all. Again. (Faulkner 95).\n\nAt first glance, the incomplete sentences, and the random word order in parts\nrender the reader confused and unsure of how to comprehend the passage.\nHowever, when one thinks about something, or internalizes an experience,\none doesn't normally think in complete, coherent sentences. Words flash\ninto the mind as quickly as images are presented, sometimes singly, and\nsometimes fragmented. Faulkner exemplifies creativity with his stream-of-\n\nconsciousness dialogue, and further when he successfully transcends age and\ngender barriers later on in the text, as he assumes the characters of men and\nwomen, young and old. He demonstrates creativity and though his style of\nwriting differs from Joyce, he still retains the ability to reach the reader on\nan emotional level.\n\nWith these literary giants in mind, it appears that a computer program\ncould never reproduce such techniques with any authenticity; without the\nemotion or experience of a human which seem crucial to the creative\nprocess, such a feat appears impossible. However, recent computer\nprograms have been able to produce output that has convinced many experts\nof the possibility of computer creativity (Picard 39). One example of this is\nan excerpt from a book written by the computer program 'Racter.' The\ncomputer writes:\nHe wished to assassinate her yet he sang, 'Lisa, chant your valuable\nand interesting awareness.' Lisa speedily replied. She desired\npossessing her own consciousness 'Benton,' she spoke, 'you cry that\nwar and assault are a joy to Diane, but your consciousness is a tragedy\nas is your infatuation. My spirit cleverly recognizes the critical dreams\nof Benton. That is my pleasure.' Benton saw Lisa, then began to revile\nher. He yodeled that Lisa possessed an infatuation for Diane, that her\nspirit was nervous, that she could thoughtfully murder her and she\nwould determinedly know nothing. Lisa briskly spoke that Benton\npossessed a contract, an affair, and a story of that affair would give\nhappiness to Diane. They chanted sloppily for months. At all events I\nquickly will stop chanting now\n(Hofstader 471).\n\nAfter reading this passage, it appears possible that one could perceive this as\ncreative work. The computer touches on subjects which seem so innately\nhuman and personal, such as desire, infatuation, and nervousness, that it\ntakes the reader aback. Not only does the computer reference such human\nemotions, it also exhibits an ability to use a fairly extensive vocabulary in\nconjunction with a surprising command of English grammar which many\npeople seem to lack.\n\nThese modern examples of computer creativity are not only limited to\nprose, but also appear in the complex world of poetry. While it may seem\neasy to explain away the creative nature of the above computer-generated\npassage by virtue of it being a program, written by humans, which clearly\nexpresses grammatical laws and provides vocabulary, poetry seems to be in\na separate realm. Poetry isn't bound by any strict laws which may easily be\nprogrammed into a computer, and, perhaps even more than prose, seems so\nintensely personal that it provokes one to ask, \"How could a computer\npossibly express anything remotely to the effect of human poetry?\" It may\nbe surprising, then, when one reads this sampling of a computer-generated\npoem:\nI do not know the answer to the question\n\nThere was a time when moorhens in the west\nThere was a time when daylight on the top\n\nThere was time when God was not a question\n\nThere was a time when poets\n\nThen I came (Boden 8).\n\nThese incomplete sentences call to mind the stream-of-consciousness that\nFaulkner so successfully adopted as a means to communicate creativity in\nhis own work. They also seem to compel the reader to postulate the\n'question' that the computer mentions, which allows the words to reach the\nreader on a personal level. Furthermore, it speaks to the reader's own\nexperience of introspection about nature and God, which removes it further\nfrom the cold realm of computer programming, consisting of binary\noperations of ones and zeroes. There is also an interesting reference in the\nlast line to something that seems like self-awareness. Though self-\nawareness is not clear evidence of computer creativity, it again adds a\nhuman dimension to the poetry, which lends credibility to the possibility of\nits creative ability.\nNow armed with the examples of both human and computer-generated\nwriting, it becomes necessary to discuss current theories of creativity which\nare relative to the study of artificial intelligence. Two such common theories\nare that the nature of creativity has a foundation in the ability to create\npossibilities and recognize the profound, another is the ability to reshuffle\nthe old into the new. When discussing how to implement the first criteria for\n\ncreativity into an artificial intelligence program, Hofstadter, an artificial\nintelligence researcher, declares that \"full-scale creativity consists in having\na keen sense for what is interesting, following it recursively, applying it at\nthe meta-level, and modifying it accordingly\" (Hofstadter 313). Though this\nis not easy to apply in a computer model, this is an essential component of\nhuman creativity. This is easily seen in math where there are an infinite\nnumber of relations, yet mathematicians have an uncanny ability to\nrecognize the profound. Though they seem commonplace today, correlations\nsuch as the Pythagorean Theorem and pi, the ratio of any diameter of a circle\nto its circumference, were picked out of an infinite number of other less\nsignificant relations.\nThe second criterion of intelligence can be easily traced throughout all\nof literary and art history. With this concept in mind, it has been said by\nmany before that \"all finding is refinding\" (Singer 47). Not only does this\napply to artificial intelligence systems, but it is also widely seen in human\ningenuity. For example, famous beat author Jack Kerouac, by using the\nstyle of stream-of-consciousness, borrows from previous authors such as\nFaulkner, and it has been said that all modern novels find their source in\nCervantes' Don Quixote. Though this reshuffling of old ideas is common,\nthe Jack Kerouac's of the world are nonetheless admired for their creativity.\n\nWith the current theories of creativity in mind, and the examples of\nhuman creativity and possible computer creativity we have seen, we will\nnow determine whether there is sufficient basis to consider whether or not\neach of them truly displays creativity. While the idea of a computer, merely\na machine, possessing creative abilities may seem questionable, it is\nimportant to ask whether our processes of creativity are the same. Initially,\nit seems as though these processes are clearly not the same. We do not, and\nseemingly cannot, know how the creative aspects of our brain work. This\nhas been observed many times before, and was explained by Francois Jacob,\na molecular biologist, as follows:\nDay science employs reasoning that meshes like gears...One admires\nits majestic arrangement as that of a da Vinci painting or a Bach\nfugue. One walks about it as in a French formal garden...Night\nscience, on the other hand, wanders blindly. It hesitates, stumbles,\nfalls back, sweats, wakes with a start. Doubting everything...It is a\nworkshop of the possible...where thought proceeds along sensuous\npaths, tortuous streets, most often blind alleys (Boden 113).\n\nIn this poetic definition, Jacob refers to the methodical part of science, the\npart in which current computers can perform, as day science, and the realm\nof innovation and creativity as night science. Given this vivid description of\na creativity that is well outside the constraints of a strict program, it seems as\nthough any computer could not possibly exist in the \"workshop of the\npossible,\" where Jacob believes that human creativity resides. One expects\n\nthis because the standard approach to computation involves following strict\nguidelines in a program, and this is clearly not what the brain is doing as it\nproceeds along its \"sensuous paths.\" As a result of this, the reader may\ndetermine that computers are not truly creative simply due to the fact that\nthey operate under a list of constraints set by a programmer.\n\nSinger also seems to argue against computer creativity based on the\nfact that humans learn in an entirely different way than computers, and that\nthis prevents them from truly being creative. It seems that the standard\napproach to the way that people learn and develop appears limited, based on\nthe ideas of artificial intelligence computer models. Singer feels that these\ncannot possibly accurately describe, emulate, or reproduce the human mind.\nAs such, there must be something different taking place within us. Singer\nfeels that this may lay in the fact that we not only affect our outside\nenvironment, but that our outside environment affects us as well. It is a\nreciprocating process of growth which allows the human mind to exist as it\ndoes. He feels that this cannot possibly exist in computers because they are a\nset of unchanging and inadaptable pieces of hardware. At best, they are a\nfeeble, potential mind, chained and held back by the cage of metal and\nsilicon. Singer feels that this restriction may be the definitive difference in\n\ndetermining whether or not computers and humans 'think' alike, and\nconsequently, whether they can be considered creative.\nThe idea of comparing the creativity of a machine operating under\ndefinite restrictions to the creativity of a human, which we like to imagine\nremains free from such shackles, may seem unimaginable. However, some\nmay argue, namely researchers involved in artificial intelligence, that brains\nare like one sort of computer-model: a connectionist system or neural\nnetwork, one that most people are not familiar with on a day to day basis.\nThese connectionist systems are used for neuro-scientific research and they\nare modeled on the brain. In fact, these systems have been shown to have an\n\"associative memory,\" which has both a meaningful and contextual basis\n(Boden 119). More importantly these systems perform these meaningful and\ncontextual associations by themselves, without being specifically\nprogrammed to do them. As Boden explains, \"rather, their associative\nmemory and tantalizing, human-like, capacities are inevitable results of their\nbasic design\" (120). An example of school children learning clearly\ndemonstrates this humanistic characterization. For instance, when trying to\nlearn, or at least recognize, what an apple is, though every apple the child\nsees differs slightly than the one before, a connectionist process is used.\nInitially, the child knows nothing of the concept of an apple and can solely\n\nrecognize color and shape contours. Most likely the child will make wrong\nguesses as to what the object is, and will either be corrected by the teacher or\nsociety. This process alters their brain, and results in the storing of this\ninformation much as a connectionist system would. This process continues\nuntil this child has a near perfect knowledge of and ability to recognize the\napple. This associative process in human learning is directly mirrored in\nneural net systems and is capable of feats today such as defeating world\nchess champions, and some believe the capability of creative thought in the\nfuture (Boden 120).\nBoden again maintains that these connectionist systems are plausible\nmodels of genuine creativity through further comparison of human and\ncomputer thought-processes. She attacks the argument that computers are\nprevented from achieving creativity by acting within restrictions. She relates\nthat \"artistic [human] creativity, likewise, often involves such reasoning.\n'Anything goes!' is not a good motto for the arts. We can enjoy a disciplined\nintegration of a Bach fugue and jazz-style, but we would not appreciate just\nany fuzzy mix of melodies\" (132). Clearly, even the ingenious musical or\nvisual artist's creativity operates in some boundary, as does a connectionist\nnetwork. It seems then that the fact that computers act from within some\nbasic constraints does not necessarily exclude them from the creative realm.\n\nNow that the possibility of computer creativity, and the similarities\nbetween human and computer creative processes, has been analyzed, the\ntask is now to determine whether the specific examples cited above of the\ncomputer-poet and Racter are truly examples of creativity. Even\nphilosophers who remain skeptical concerning the possibility of computers\nachieving human capabilities define imagination and creativity in a way that\nthese computer-generated passages exemplify. Concerning the nature of\nimagination in poetry, Irving Singer declares:\nWhen people speak 'poetically,' whether or not they are poets, they\noften make statements that are nonsensical as literal discourse but are\nmeaningful all the same. What is sensically conveyed is a general\nfeeling about the matter at hand, a feeling that obliquely expresses a\nwide range of feelings or emotions that someone may experience.\nThis capability derives from imagination and, above all, from the\nprocess that defines the imaginary (Singer 50).\n\nThis definition of imagination, which is closely tied to the ability to be\ncreative, seems to fit the two computer excerpts above. In both cases it\nappears that what has been \"sensically conveyed\" is \"a feeling that obliquely\nexpresses a wide range of feelings or emotions that someone may\nexperience.\" In Racter's piece, this is achieved through the topics of\nassassinations, affairs, infatuations and dreams. In the case of the computer-\npoet, there is a direct reflection on the question of God, of knowledge, and\none's own effect on external reality. All of these concepts speak deeply to\n\nthe human spirit, yet the question still remains whether these passages\nrepresent true examples of creativity possessed by a computer, or just merely\nits false appearance seen in the rare result of a highly sophisticated program.\n\nThough many artificial intelligence experts maintain that these\npassages are examples of true computer creativity, or proofs that this is\npossible in the future, there are grounds for skepticism. For one, these\ncomputer programs which produce the poetry cited above are a conjunction\nof a random number generator to simulate the high variability of the human\nmind with a primitive ability to choose interesting combinations of the\nrandom variations. In this case, because the selection program is so primitive\nmost of the choosing of the significant material produced is done by the\nhuman. This makes these examples of computer creativity not too\nimpressive because a major portion of the creative process, the recognition\nthat what one produces is interesting or creative was done by the human.\n\nThis is not necessarily the death of computer creative potential. An\nassociative learning computer may in time develop this ability and may even\nsurpass our own. For example, a child must be trained and conditioned\nthrough associative learning to recognize significance and few people\nactually develop this process along with the conjunction to develop the\ninteresting ideas in the first place to be called creative (Hofstadter 470).\n\nThus far there is still potential for the creative computer. However, there is\nanother phenomenon which was first discovered in relation to the human\ninterpretation of computer output: the Eliza effect. Hofstadter defines this as\nthe \"susceptibility of people to read far more understanding than is\nwarranted into strings of symbols - especially words - strung together by\ncomputers\" (157). This process was first discovered and recognized after the\ncreation of program ELIZA in the mid 1960's. ELIZA was originally\ndesigned to act as a psychotherapist that responded to \"typed lamentations\"\nof patients with fairly unoriginal questions or requests such as, \"please go\non.\" Surprisingly, even though this program has no creative component by\nany stretch of the imagination, it convinced many people that it actually\nunderstood and empathized with their situations. This \"effect\" is a serious\nproblem which must be taken into consideration when determining the\ncreative ability of a computer.\nWith that thought in mind, the interpretation of the two computer\nexcerpts presented previously takes on new meaning. It seems reasonable\nthat when we are presented with a string of words written in a manner to\nemulate what a human writer or poet would produce, we would naturally try\nto understand the creative and emotional processes the author experienced to\nproduce these. It is interesting to note that Singer shows that this has been\n\nseen before in respect to the relationship between the human artist and his\nreaders. He relates, \"But more significant, I think, is the fact that no\nfictional character, however suitable for love or suggestive as a sexual\nobject, can have its effect upon members of an audience unless, to\nparaphrase Shakespeare, they upon their imaginary forces work\" (Singer\n133). It appears, then, that this Eliza effect, which is often thought of being\ndeadly to the viability of creative computers, may actually be an integral part\nof the creative process whether human or machine.\nSo far, the debate as to whether computers are capable of creativity,\nand particularly whether the two examples of computer literary art\npreviously discussed are creative, has centered on the insufficiencies of\ncomputer models to represent the human creative process. However, there\nare those who oppose even the possibility of computer creativity not because\nthey believe the computer models are insufficient, but because they believe\nthe faculty of creativity is innately human and could not exist otherwise.\nSinger, for one, holds this view of imagination and creativity, stating:\nIn its role within imagination, the imaginary is typically and\ndistinctively human. It requires an intellectual capacity that exceeds\nthe mental equipment of all other creatures on earth...A dog who sees\nhis master put on an overcoat will make preliminary movements as if\nhe thinks it is quite possible the two of them may be going for a walk.\nThe dog could be said to 'entertain' this and other possibilities, to\nkeep them 'in mind.' But we have no reason to think that he has a\nconcept of possibility (Singer 49).\n\nI do not, however, believe that this is a sufficient argument that computers\ncannot have an imaginary and creative ability on par or superior to man.\nPerhaps a computer model of the future may be excellent at making creative\nanalogies unseen by humans, or even more probable, the ability to make\ninteresting mathematical or scientific insights that have eluded man for\ncenturies. Despite this, the computer may not be said to have human\ncreativity; its existence is not similar to our own. We are living organisms\nwho have a fundamental place on this earth, and this is deeply-seeded in our\nmost basic mental \"machinery.\" A computer, on the other hand, is trapped\ninside a cold and mechanical silicon-based frame, which cannot interact with\nits outside environment. These drastic differences alone are enough to\nconvince some that computers can never possibly attain a creativity\ncomparable to the likes of human creativity. However, this does not rule out\na computer creative ability which may be different, but creative nonetheless.\nAfter reviewing the arguments for and against the possibility of\ncomputer creativity, evidence suggests that current computers are not\ncreative. However, I do not believe that the arguments stating that\ncomputers are incapable of creativity, such as those that cite an impenetrable\nbarrier between our creative processes and that of any hypothetical artificial\nintelligence design, or simply that creativity is uniquely a human\n\nphenomenon are definitive. Though artificial intelligence systems may not\nproduce human creativity, there is the possibility that there can be a\ncreativity different, yet perhaps more effective than our own. Some may still\nfind it hard to believe in a future computer which could paint like Monet, or\nhave faith in a machine to effectively speak to the emotions of a human.\nHowever, technological innovations continually astound us, and it is no less\nplausible that a computer could function at this level of creativity, than one\nhundred years ago to imagine men landing on the moon.\n\nWorks Cited\nBoden, Margaret. The Creative Mind: Myths and Mechanics. London; New\nYork: Routledge, 2004.\n\nFaulkner, William. The Sound and the Fury. New York: Random House,\n1984.\n\nHofstadter, Douglas. Fluid Concepts and Creative Analogies. New York:\nBasic Books, 1995.\n\nJoyce, James. Ulysses. Oxford: Oxford University Press, 1993.\n\nPicard, Rosalind. Affective Computing. Cambridge, Massachusetts: MIT\nPress, 1997.\n\nSinger, Irving. Feelings and Imagination: The Vibrant Flux of Our\nExistence. Maryland: Rowman and Littlefield, 2001"
    },
    {
      "category": "Resource",
      "title": "Imagination and Creativity in Modern Collegiate A Cappella Arranging, Performing, and Recording",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-262-feeling-and-imagination-in-art-science-and-technology-spring-2004/f6ad15fa3f9a8d44ef1541de7e0a4c19_a_cappella_1.pdf",
      "content": "Imagination and Creativity in Modern Collegiate A Cappella\nArranging, Performing, and Recording\n\nTyler Johnson\n\nIntroduction\nA cappella is a relatively young art form that is catching the interest of\nmany people across the nation. The popular movement is believed to have\nbeen started in 1909, when part of the Yale Glee Club broke off and formed\nthe Yale Whiffenpoofs, the first collegiate a cappella group; the\nWhiffenpoofs exist to this day, and the a cappella movement has only grown\nin popularity.\nThroughout the middle decades of the 20th century, professional a\ncappella groups attracted a lot of attention for their renditions of popular\nsongs. As this new progressive style caught on, the a cappella art form\nevolved from its roots in harmonically complex barbershop quartets into a\nmore modern and freely structured type of music. The trend-setting groups\nremained attentive to musicality, but left behind the rigidity commonly\nassociated with barbershop performance. Songs like \"Mr. Sandman,\" by the\nChordettes, and \"It Won't Be Very Long,\" by the Soul Stirrers, showed\npeople that a cappella could be exciting and also that it could tackle a\nmultitude of musical genres.\n\nThe next big developments in a cappella came on the collegiate front.\nWhile professional groups retained their popularity, their numbers did not\nincrease much toward the end of the 20th century. On the other hand, the\nnumber of college groups skyrocketed during this same time period.\nAccording to the Mainely A Cappella website's history of a cappella, since\n1989, there have been about 20 new groups formed at schools across the\nnation every year. 1 This paper suggests that the reason for the drastic spike\nin collegiate interest in a cappella is because students began to realize the\nwide range of creative expression that can be achieved through this art form.\nIn a cappella, there are three main avenues for creative expression.\nWithin each avenue are a variety of distinct lanes, but all of them pertaining\nto arranging, performing, or recording vocal music. This paper will show\nhow a cappella fosters the creativity and imagination of each member of a\ngroup through these three main avenues, and in doing so, it will show the\nreason that the popularity of a cappella in the collegiate spectrum has grown\nso vigorously.\nNOTE : Unless otherwise stated, the arranging, performing, and recording\nexperiences related in this paper come from my last three years performing\nwith the MIT Logarhythms.\n\n1 Historical information taken from the Mainely A Cappella website. See reference list.\n\nArranging\nFor the most part, modern collegiate a cappella groups do not sing\noriginal songs. Though they may have a trademark song or two that was\ncomposed by someone in the group, the bulk of a group's repertoire comes\nfrom covered songs. This lack of original songs does not necessarily\nindicate a lack of imagination or creativity on the part of the group or the\nmembers thereof. In fact, the ability to take a popular song and make a\npurely vocal arrangement of it is an art that requires a great deal of\nimagination and creativity.\nArranging popular music into vocal parts is like an abstraction of the\noriginal piece into a more pure and simple form. This abstraction is of itself\ncreative, as it generates new and different ways to look at problems. In\nWard, Finke, and Smith's book, Creativity and the Mind, there is a lengthy\ndiscussion of abstraction as a means of invention. They note, \"In mounting\na more abstract assault on a problem we still deliberately apply knowledge,\nbut we marshal it differently.\" (128) Arrangers apply their knowledge about\na song, but they make it more abstract by translating the parts into vocal\nlines. This act of abstraction is very hard to do and takes much imagination\nand creativity.\n\nThe primary difficulty of making a good a cappella arrangement stems\nfrom a fundamental conundrum of the entire a cappella genre. Instruments\nwere originally created as technology to do what the human voice could not\ndo. However, in modern a cappella arranging, the goal is often to make the\nvoice sound as much like an instrument as possible.\nImagination is required to see how unique sounds like bells, guitars,\nor drums can be placed back into voices. The instruments were created to\nsurpass vocal or other bodily techniques, but there are still ways to get a\nvoice to make the right sound for almost any instrument. A large part of\ngetting the right sound is picking a suitable syllable. For bells, this might be\na ding or dong, dink or donk, jing or jong, etc. The arranger must assess the\noverall quality of the sound before he can pick a suitable syllable to sing on.\nMost instruments can easily be vocally replicated in this way. For some\ninstruments like piano, where the mix of percussiveness and sound quality is\nalmost beyond human capabilities, an arranger must choose whether to put\nin a decent sounding but not totally accurate syllable such as 'dun' or to just\nput in purely vowels or words into the background part. Actually, inserting\nwords into the background parts is often a stylistic decision on the part of the\narranger that will be discussed a bit later.\n\nSometimes the complexity of a part is not in the sound of the\ninstrument, but in the range or rhythm in which the part is played. In order\nfor the part to come out clearly, the arranger must spread out that part\nthroughout a number of vocal lines. For an arpeggiated guitar line, there\nmay be three or four parts that together create the overall effect. Each part\nis given the same syllable so that there is a uniform sound for the guitar.\nThe parts are then placed at staggered intervals to create the arpeggio that is\nheard in the guitar in the original song. The arranger also must place notes\nwhere they will fit in peoples' ranges so that they are capable of singing the\nnotes in the way the arranger wants. Using these basic techniques and\nexpanding upon them, an arranger can effectively imitate almost any\ninstrumental line.\nTo start an arrangement, a person in the group chooses some song that\nhe likes and listens to it until he knows every part of it inside and out. After\ntranscribing the solo line, which usually sticks to whatever the original\nsoloist did, the arranger gets a chance to be truly creative when he builds up\nthe background parts. Basic background arrangements can be as simple as\nlong, held out notes on the correct chords, but this lacks creative flair.\nModern collegiate a cappella arrangers strive to capture not only the\nchord progression of a song, but also the textures and characteristic\n\ninstrumental sounds in the song. This task varies in difficulty from song to\nsong. A simple song like \"All the Small Things,\" by the punk rock band\nBlink 182, is easily arranged using a minimal number of parts. The guitar\nline is almost entirely done with repeated eighth note power chords, and the\nbass line is in quarter notes on the tonic note of the chord. Using the\nsyllables na, nare, and dare for the guitar, and the syllables dit and dow for\nthe bass, the song is halfway done. Add in one person on vocal percussion\nand one person on the solo and the song is brought to life. However, as\nalready stated, this song is on the easy side of the spectrum in terms of\narranging.\nA song that represents the more complex side of arranging is \"Blurry\"\nby Puddle of Mudd. In the opening sequence, there is an extremely complex\nseries of interweaving notes between bass, guitar, and bells. In order to\naccomplish the arranging of this sequence, all of the parts must work\ntogether with a common line in mind, even though they are all singing at\ndifferent times. If everything is sung as it is written, then when all parts are\nsung together, the entire sound quality, timing, and tuning make the group\nsound just like the opening sequence of Blurry.\nThere is another big arranging trick that was touched on earlier that\nneeds to be developed a little further. Imitating instruments with unique\n\nsyllables is a fascinating task, but it gets boring if that is all a background\npart does. In order to keep both the audience and the singer of the part\nmentally and emotionally involved, the arranger can choose to insert words\ninto the background parts. Lyrics are the basis and the backbone of almost\nall vocal music, and \"therefore any approach to the interpretation of vocal\nmusic...must of necessity begin with the consideration of the text which has\nbeen set to music.\" (Hemsley, 112) The text may tell a story or describe a\nscene which the author is witnessing. The author's tone or emotions will\ncome out through this text, so it is fundamental that a singer derives his\nemotional state during a song from the words in that song. Sometimes this\nis difficult to do as a background singer, which is a big reason why words\nare added into the background parts.\nThe words that are added into a background part may be simply\nrepeats of whatever the soloist is saying, or they may be something\ncompletely different thrown in for comedic effect. If the words are repeats,\nthey are provided to emphasize the lyrics at this point of the song. This\ntechnique serves a dual purpose of engaging the background singer in the\nsong and of drawing more of the audience's attention to whatever lyrics the\nsoloist sang. Since the words for these parts usually do not exist in the\nactual song (unless there are backup singer parts), this is a chance for the\n\narranger to add originality into his arrangement besides just the choices of\nhow to best replicate the instruments in the song.\nThere is one other commonly used arranging technique that allows\narrangers additional room for creativity. This technique is to put together\nvarious songs in a sort of medley to create something original from bits and\npieces of other songs. The popular method that is currently being used is to\ndo most of a song normally, then insert part of another song by the same\nband at the end, and then return to the first song. This provides an\nimaginative alternative to the actual song, but some arrangers have the\ntendency to get carried away with this technique. The best arrangers are\nable to either seamlessly integrate these other songs into their work or to\nmake the arrangement so full and developed that there is no need to distract\nfrom it by adding in a portion of another song.\nPerforming\nPerforming is the main focus of a cappella, since this is when the\nentire group comes together to create a song. It is also the time when each\nindividual is able to express himself through the music and to connect with a\nlive audience so that the feelings and emotions that come out in the song are\nshared. There must be a mix of art and science, since the performance\nshould be creative, and yet it still needs to be rehearsed to the point of\n\nautomation. A more scientific approach to learning songs will enable a\nsinger to be more emotive when performing, since he will be able to\nconcentrate on the meaning behind the song and not be totally preoccupied\nwith singing the correct notes. The notes are obviously important, but\nhigher goals exist beyond a mechanical performance of correct pitches.\nEmotions are the driving force behind all vocal performance. As\nIrving Singer observes in the introduction to his book Feeling and\nImagination, \"The singer tries to initiate and experience different kinds of\nfelt rapport - with (his) listeners in the audience, obviously, but also with the\nconductor,...with the artists in a vocal ensemble, and above all with the\nmusic itself.\" Singer correctly identifies the connections that should be\nmade during a vocal performance, and for the most part, he puts them in the\norder that a cappella singers should think about them. Ultimately, it is a\nbond with the music that should give rise to all of the other connections that\ndevelop in a performance.\nIn a cappella, the first commitment a singer has is to the arrangement\nas it has been learned (the \"music itself\"). After this, the singer must be in\nharmony with his surrounding singers so that everything is in tune and in\ntime. One will note that if everyone is focusing on singing their part as it fits\ninto the arrangement, this second goal should be relatively easy and should\n\nconsist mostly of remembering to listen around the group. After the group\nconnection is the connection to the audience that is developed through\nemotionally expressive singing. Finally, if the conductor has done his work\nahead of time, he acts mostly as a figurehead during the performance and\nshould simply work on keeping the group together and focused on relating to\nthe audience. To achieve this order of goals, there are many processes that\nmust take place before a song is ready to be performed.\nWhen an arranger completes a song, he gives his arrangement to the\nconductor, who decides whether or not the group should learn the\narrangement. If the song is simply too easy or too difficult, it will not fit in\nwith the rest of the repertoire of the group and thus it is not worth learning.\nIf the conductor accepts the song, he will often work with the arranger to add\ncreative input and to clean up any problem sections in the arrangement.\nOnce the arrangement is up to snuff, the group can start to learn it.\nIn learning arrangements, it is important that each person in the group\nknows the basic sound and structure of the original song so that they can\nknow how their part fits into the whole. This takes some imagination to\nmove from a produced song played by a band to an abstract arrangement that\nis produced solely through voices. The central theme of Hemsley's book as\nhe states it is, \"Imagination is an essential prerequisite of singing - not an\n\noptional extra.\" This is true in all singing, but especially so in a cappella.\nEach person must individually think about singing his part accurately and\nwell, but then he must also consider how his part blends and interacts with\nother parts. During this process of learning, each person of the group is\nusually allowed to use his imagination to make stylistic interpretations for\nhow to perform his particular line of the song. For the solo line, there is a lot\nof room for interpretation, but the background parts do not have as much\nfreedom.\nThe singer is not given as much imaginative freedom as the arranger\nsince it is the arranger's vision of the song that is created by the interplay of\nparts. The interactions between vocal parts used in order to imitate higher\ncomplexity songs require that each part be sung with a certain style and tone\nthat may or may not be defined by the arranger. If one person sings in a\ndifferent way than all of the rest of the people on his part, he will stick out\nlike a sore thumb and possibly destroy the final product. If everyone sings at\nthe correct levels, with the right tone, diction, notes, and general blend, it is\npossible to attain a higher goal of creating as a group.\nSawyer's book, Group Creativity, does an excellent job of looking at\nthe ways in which groups function together to be creative as a whole. Even\noutside of the realm of the arts, groups often transcend the creativity of\n\nindividuals to get to a higher goal. Sawyer relates the following study as\nsupport of his claims about group creativity:\nIn the 1980's, a group of psychologists known as socioculturalists\nbegan to study individuals in different social and cultural\ncontexts...They studied how individuals behave intelligently and\neffectively in specific cultural contexts, while engaged in well-defined\ntasks with culturally valued goals. While observing these\npsychological processes as they occur in rich social settings, the\nsocioculturalists gradually began to believe that these processes were\nnot, strictly speaking, \"psychological\" - rather, individual cognitive\nprocesses were so deeply embedded in group practices that it was\ndifficult to identify what was \"individual psychology\" and what was\n\"group process.\" (Sawyer, 21)\nThe results obtained by these 'socioculturalists' is consistent with the way\nmost a cappella groups work. Groups must come together as a cohesive unit\nto be truly creative in this art form. Individuals must heed their own\nresponsibilities, but still remember that without everyone else, performing\nwould not even be possible.\n\nRecording\nIn a cappella recordings, creativity focuses around bringing to life a\nperfect version of the arranger's conceptualization of his song. In an ideal\nsituation, a group could spend as long as possible to get a perfect recording\nof every part from every singer in the group. In reality, this is almost never\npossible. Fortunately, technological developments in the field of audio\nrecording have enabled groups to pay greater attention to detail, and thus to\nproduce more intricate, complex, and interesting musical works.\nIn the past, a cappella groups were constrained by the currently\navailable technology so that they had to record in large groups.\nTranscription, wire, and tape recording techniques left much to be desired as\nfar as data saving capabilities were concerned. Because of this lack of\nmemory, songs were usually tracked by the entire group at the same time.\nThey would stand around one microphone and sing take after take until they\nsettled on one that was good enough. Since all of the individual waveforms\nwere immediately blended together to make the overall track, it was\nimpossible to do editing or mixing of single parts. Even just the act of\nselecting the good takes and piecing them together with other parts of the\nsong was an arduous process. With the advent of digital recording, this style\nof group tracking has become anachronistic.\n\nDigital recording is perfectly suited for a cappella recording, and may\nhelp to explain the sudden burst of interest in a cappella in the late 80's.\nBorn in 1982 with the creation of CD's, digital recording far surpasses other\nrecording techniques in its ability to capture individual parts.2 Each part can\nbe recorded separately, and it is also saved directly into computer memory,\ninstead of as analog data, as in previous techniques. Digital recording has\nenabled arrangers to produce amazing recordings from lesser quality tracks\nbecause each part can be individually manipulated.\nThe most modern digital recording systems come fully loaded with\ntons of tricks to help producers and arrangers to create exactly what they\nwant, even if the singers did not sing their parts entirely right. Tricks that\nare currently being used include the following: being able to fix the pitches\nof notes and thus creates perfect chords by taking a digital copy of every\nperson's voice and constraining the final output to the desired frequencies of\neach note; aligning each part on the right beat or part of a beat; sampling or\nsequencing parts so that only a small section must be sung and then repeated\nwherever else it occurs in the song. Even more advanced tricks like adding\ndistortion or fading a part from side to side are being commonly used\nbecause of the ease with which digital recording makes them possible.\nConclusion\n\n2 Taken from Recording Technology History. See reference list.\n\nA cappella groups have provided an extremely valuable and\nmeaningful outlet for thousands of college students in the last century to\nartistically express themselves. It allows groups to perform a vast array of\nsongs that demonstrate all facets of their creative expression. Many levels of\ncreativity can be achieved in arrangements and in performances, as well as\nin recording.\nCollege students who have been brought up with musical training\nseem to be drawn to this genre of music because of the possibilities for\nfurther development of musical abilities. This development may come in\nmany different forms, and a cappella provides the means for all of these\nforms to flourish. Sawyer provides great insight when he says, \"Ritualized\nensemble genres, by virtue of their rigidity, do not provide as many\nopportunities for individual performers to act in creative ways.\" (129) A\ncappella music breaks away from traditional forms of music to create\nsomething wholly new and special that is both musically pure and extremely\nprogressive.\nMusic is an essential part of education because of all of the benefits it\nprovides for its students. As Michael Kendall of Bethel College simply\nstates, \"Music enhances the quality of human life. The study and\nperformance of music stimulates the growth of students' sensitivity and\n\ncreative skills...Music has the ability and power to enrich human activity\nwith deep meaning...It provides a readily accessible avenue to the study of\nother cultures.\" 3 A cappella has the capability to give students all of these\nbenefits. It is able to truly expand students' cultural and musical horizons\nthrough its simple and yet deeply developed methods of making music.\n\n3 Quotation from Michael Kendall's \"Philosophy of Music Education.\" See reference list.\n\nReference List\n1. Bethel College Website. Michael Kendall, \"Philosophy of Music\nEducation.\"\nhttp://www.bethelcollege.edu/acadb/undgps/finearts/music/phil.htm.\n2. Hemsley, Thomas. Singing and Imagination. Oxford University Press.\n1998.\n3. Mainely A Cappella website. \"A Century of A Cappella.\"\nhttp://www.a-cappella.com/misc/history.php.\n4. Sawyer, Keith. Group Creativity - Music, Theater, Collaboration.\nLawrence Erlbaum Associates, Publishers. 2003.\n5. Singer, Irving. Feeling and Imagination - The Vibrant Flux of Our\n\nExistence. Rowman & Littlefield Publishers, Inc. 2001.\n6. Schoenherr, Steve. \"Recording Technology History.\"\n\nhttp://history.acusd.edu/gen/recording/notes.html#digital.\n7. Ward, Finke, Smith. Creativity and the Mind. Plenum Press. 1995."
    }
  ]
}