{
  "course_name": "Feminist Inquiry: Strategies for Effective Scholarship",
  "course_description": "This course investigates theories and practices of feminist inquiry across a range of disciplines. Feminist research involves rethinking disciplinary assumptions and methodologies, developing new understandings of what counts as knowledge, seeking alternative ways of understanding the origins of problems/issues, formulating new ways of asking questions and redefining the relationship between subjects and objects of study.\nWhat makes research distinctively feminist lies in the complex connections between epistemologies, methodologies and research methods. This course explores how these connections are formed in the traditional disciplines and raise questions about why they are inadequate and/or problematic for feminist inquiry and what, specifically, are the feminist critiques of these intersections.\nThis course is part of the Graduate Consortium in Women’s Studies at MIT.",
  "topics": [
    "Society",
    "Gender Studies",
    "Society",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week; 3 hours / session\n\nThe Graduate Consortium in Women's Studies\n\nThis course is part of the\nGraduate Consortium in Women's Studies\n(GCWS). GCWS at MIT is a pioneering effort that brings together feminist scholars and teachers at nine Boston area institutions devoted to graduate teaching and research in women's studies and to advancing interdisciplinary women's studies scholarship.\n\nPrerequisite\n\nStudents must be graduate students at one of the nine institutions that participate in the Graduate Consortium in Women's Studies.\n\nCourse Overview\n\nFeminist Inquiry starts with questions: What is feminism? What is feminist scholarship? Is feminist scholarship inherently interdisciplinary? Should feminist work interrogate disciplinarity? Must feminists collaborate? How do the so-called different \"waves\" do this?\n\nOur aim is to critically examine feminist theories and methods by providing a forum for sharing, accessing, discussing and debating strategies used by feminist scholars who represent an array of fields. The course will not make a sharp distinction between theory and method. Instead we shall proceed on the assumption that method is applied theory. We shall examine the theoretical positions authors take, and evaluate the usefulness of their methodological approaches.\n\nThe complex connections between epistemologies, methodologies and research methods are central to feminist inquiry. Different questions require different modes of inquiry; many questions propel us into intersectional webs of knowledge and ways of knowing. We shall explore how knowledge is formed in the traditional disciplines and raise questions about how strict disciplinary epistemologies can be problematic for feminist inquiry.\n\nCourse Materials\n\nThe books listed below are the main readings for the course.\n\nBechdel, Alison.\nFun Home: A Family Tragicomic\n. Mariner Books, 2007. ISBN: 9780618871711.\n\nDavis, Angela Y.\nAre Prisons Obsolete\n? Seven Stories Press, 2003. ISBN: 9781583225813.\n\nDreger, Alice Domurat.\nOne of Us: Conjoined Twins and the Future of Normal\n. Harvard University Press, 2005. ISBN: 9780674018259. [Preview with\nGoogle Books\n]\n\nLahiri, Jhumpa.\nUnaccustomed Earth\n. Vintage Books, 2009. ISBN: 9780307278258.\n\nLederman, Muriel, and Ingrid Bartsch, eds.\nThe Gender and Science Reader\n. Routledge, 2000. ISBN: 9780415213585.\n\nStryker, Susan.\nTransgender History\n. Seal Press, 2008. ISBN: 9781580052245.\n\nLevi, Robin, and Ayelet Waldman, eds.\nInside this Place, Not of It: Narratives from Women's Prisons\n. McSweeney's Books, 2011. ISBN: 9781936365500.\n\nRemaining readings come from a variety of sources and are detailed in the\nReadings\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nClass attendance, preparation, and participation\n\n15%\n\nReflection papers (6)\n\n30%\n\nDiscussion leader\n\n15%\n\nResearch paper and proposal\n\n40%\n\nFor further detail, see the\nAssignments\nsection.",
  "files": []
}