{
  "course_name": "Field Geology I",
  "course_description": "The course provides students with (1) an introduction to the geologic history of western North America, with particular emphasis on our field camp location and (2) an introduction to both digital and traditional techniques of geological field study. The weather permitting, several weekend field exercises provide practical experience in preparation for Field Geology II (12.115). It presents introductory material on the regional geology of the locale of 12.115.",
  "topics": [
    "Science",
    "Earth Science",
    "Geology",
    "Social Science",
    "Geography",
    "Science",
    "Earth Science",
    "Geology",
    "Social Science",
    "Geography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nPrerequisites\n\nStructure of Earth Materials (12.108) or permission of instructor.\n\nCorequisite\n\nStructural Geology (12.113)\n\nCurriculum\n\nThe course focuses on three fundamental topics, each expanded below.\n\nTraditional Geologic Mapping Techniques\n\nLocating your self on the Map\n\nOrienting the Map with Respect to your Look-direction\n\nReading Contours and Topography (at various scales)\n\nUsing the Brunton Compass for Triangulation\n\nDistance, Height and Pace Approximation\n\nRapid Collection and Plotting of Planar and Linear Structural Data in the Field\n\nStrike and Dip\n\nTrend and Plunge\n\nRake/Pitch\n\nIdentifying Bedding or other Features vs. Foliation, Avoiding Float\n\nUp Indicators (Paleochans, Trace Fossils, Sole Marks, x-bedding, Turbs)\n\nEffective use of a Field Notebook\n\nOrganization/Clarity\n\nSketching\n\nVisualization/3-D Geometry/Cartooning/Block Diagram\n\nConceptual, Creative Playground\n\nHypothesis Generation and Testing\n\nCommunication of Concepts to others\n\nDistinctions between Observation and Interpretation\n\nA Memory Resource: your Daily Record\n\nWorking with Rocks\n\nHammer, Hand Lens, Magnet, Acid, etc.\n\nClassification Schemes for Different Rocks (Mineralogical, Genetic, Textural,...)\n\nCreating and Working with Geologic Maps\n\nMeasuring Unit Thickness off a Map\n\nHow to Deal with Covered Sections or Regions Outside the Field Area\n\nRecognizing Lateral and Temporal Classification of Formations that have Huge Lateral Extent...How to Differentiate\n\nContacts\n\nFaults: Type, Displacement, Shear Sense Indicators, etc.\n\nParaconformity, Unconformity, Conformable, etc.\n\nHow to Recognize them in Maps, How to Draw them\n\nCreating Cross Sections on Maps\n\nTopographic Profile\n\nProjection of Structures Onto Line\n\nApparent Dip Calculation\n\nWhat Happens at Depth\n\nMental Concepts for the Field\n\nNot just collecting data for data's sake but continuously reevaluating your working hypothesis...iteratively deciding where your next stop should be, what data you need to collect in order to test your hypothesis.\n\nSynthesis: Linking Disparate Observations Together\n\nDigital Tools for Geologic Mapping\n\nKnowing GIS: Tools for Making Maps in the Office\n\nESRI Arc Applications\n\nLoading, Creating, Editing and Visualizing Various Forms of Data\n\nPoints, Lines, Polygons, Rasters\n\nOrganizing Files into an Efficient Directory Structure\n\nCreating Final Maps: Legends, Colors, Symbology, Printing\n\nKnowing iPAQ Handheld Computers: Mapping Tools for the Field\n\niPAQ Basics: Power, Data Storage, Care, Transferring Data, Charging\n\nArcPad GIS Application\n\nLoading and Displaying Base-map Data\n\nMap Manipulation: Panning, Zooming, Turning Layers On/Off\n\nActivating and Troubleshooting the GPS\n\n\"Rocksmith\" Application: An Extension within ArcPad for Geologic Mapping\n\nSherman's Help Documentation\n\nInstalling and Running the Application\n\nCollecting Point, Line and Polygon Data\n\nPreparation of a Compact Field Manual\n\nGoal: Create a Short (< 30p), Compact Field Manual Serving 2 Proposes:\n\nSummarizing Clark's Western U.S. Geology Lectures into Field Notes\n\nSchematic Maps, x-Sections and Strat. Columns through Time\n\nA Time-line of Tectonic Events Effecting the Western U.S.\n\nTip-Sheets Regarding Fundamental Geologic Concepts and Terms\n\nWell-Drafted, Well-Annotated Diagrams for Fundamental Concepts\n\nLithologic and Structural Symbology, Rock Classification, Geologic Timescale, etc.\n\nRationale for Digital Mapping\n\nMap Compilation/Publication Stalled by Traditional, Hand Made Methods.\n\nSemester two does not require much effort as map is finalized in the field.\n\nOffice map left at camp in traditional geology, digital everyone gets a fresh map daily.\n\nGrading\n\nLabs - 100%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lab_lec2_gis_int.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/90f1bf9a5688ba333f1a9d9e108eee35_lab_lec2_gis_int.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "2005_lab01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/a391b59f5ccbdd60df56b2ea5abe198e_2005_lab01.pdf",
      "content": "Field Geology I\nThe Brunton and The Map\nSeptember 26, 2005\nLab Exercise 1\nIntroduction\nThese exercises will emphasize practical mapping skills: reading maps and collecting data with the Brunton\ncompass. Though it is not be particularly difficult to locate yourself on a campus map or take a strike and\ndip on a cardboard plane, we will emphasize some procedural skills that will help us when we go into the\nfield. Through the semester you will find that particular fundamental exercises and concepts will recur.\nDon't fret. This is no accident, as geologic mapping is most productive and enjoyable when your\nfundamental skills are tight. We will practice over and over so that when we are in the field, instead of\ninvesting energy in data collection, you can focus your energy on interpreting the data you just collected.\nThis is how we will learn to make great maps.\nMaterials\nBrunton Compass\nC-Thru Protractor Ruler\nMap of exercise area\nIndex of structural symbols\nClipboard\nPencils and erasers\nLaser rangefinder or long tape\nGood Strike/Dip surfaces\nWorking With Maps\no\nOrienting the Map: No matter which direction you are looking, you will always rotate the\nmap until it is appropriately oriented so that the map's north arrow is pointing north. You can\nconfirm your orientation with your compass. This assures that when you are rapidly glancing\nbetween the map and the landscape, the features are in their appropriate location. We must\ntry overcome the tendency to believe that 'north is up' and recognize that the map is a\ndynamic visualization and data collection tool, not an image hung appropriately on the wall.\no\nDistance and Elevation Approximation: This skill will help you to make rough\nmeasurements and aid in finding yourself on the map. We will work to calibrate our eyes to\nmeasure distance, not just horizontally but along an incline as well. An even more difficult\nskill will be calibrating our eyes to measure differences in elevation. During the lab, we will\nuse a laser rangefinder to confirm/dispel our approximations.\no\nContours and Map Scale: Maps come in different scales and with different contour intervals.\nWhen we work with paper maps, the scale and contour interval are constant and our\nperceptions of distance and elevation become tuned to the map we are working with. We\nbecome comfortable translating back and forth between observations in the real world and\nplotting them on the map. When working with digital mapping tools, we can zoom in and out\non our maps and display contours at variable intervals. This complicates our usage of maps\nand emphasizes the need for careful observation of topography to locate not only our position\nbut also the relative scale of the map in our viewer.\nSame Map Scale, Various Contour Intervals\n100m interval\n50m interval\n10m interval\nPrepared by Ben Crosby\n\nField Geology I\nThe Brunton and The Map\nSeptember 26, 2005\nLab Exercise 1\nDifferent Map Scale, Various Contour Intervals, Same Contour Density\n100m interval\n50m interval\n10m interval\nThe Brunton Compass\no\nDeclination: Magnetic North (where your compass points toward) is offset from True North\n(our axis of rotation). Depending on where on the earth you are, the declination could be\nslightly east or west of True North. All good maps will state the declination in your particular\nlocation. You will use this value to correct your compass so that when the compass is\ndirected at True North, the compass will read 0 degrees. Be certain to check that your\ndeclination is correct as mistakes will lead to great confusion regarding all the data you collect.\no\nLocal Magnetic Interference: Nearby metal items and electric fields can significantly\ninterfere with your compass readings. To help this, make measurements at a distance from\nbelt buckles and hammers and when in urban environments, be wary of induced magnetic\nfields due to motors or spinning metal objects. (MIT's campus is full of magnetic\ninterference: pipes, pumps, etc. )\no\nTaking a Bearing: This technique will help you measure the bearing to a distant object.\n1. hold the compass in two hands: one on the body, one on the mirror.\n2. hold the compass down by your belly (beware of the belt buckle...) so you look\ndown into it.\n3. level the compass so that the bubble is in the round bull's eye\n4. using the mirror-holding hand, tilt the mirror until you see the object of interest.\n5. using the fingers of the hand holding the body of the compass, tilt up the black\narm so that you can see it in the mirror. check that the top-tip of the arm is lined\nup with the line on the mirror's face.\n6. when you have the bubble in the bull's eye, you can see your object in the\nmirror (aligned with the line and the arm), you are ready to read the number\npointed at by the north arrow. This is the bearing to your object of interest.\no\nTriangulation: This techniques will help you calculate your approximate position in the field.\n1. Locate three distinct landmarks that you can see from where you are standing\nand locate exactly (or to very high precision) on the map.\n2. Take the bearing to each of those three landmarks, reading the value next to the\nSOUTH arrow so that you know the bearing from the landmark to yourself.\n3. On the map, use your protractor ruler to draw a line through the landmark, with\nyour measured bearing. Do this for three or more landmarks and they will cross\nat your approximate location.\n\nField Geology I\nThe Brunton and The Map\nSeptember 26, 2005\nLab Exercise 1\nStructural Data Collection in the Field\no\nPlanar Data:\n\nStrike and Dip:\n-\nWe measure strike and dip to know the geometric orientation of a planar\ngeologic feature such as sedimentary beds or faults. The 'strike' is the\ndirectional bearing of a horizontal like tracing across the planar surface (like\nthe line made by the water's edge on a boat-ramp). According to the 'right-\nhand-rule,' we measure the strike in the direction so that the down-dip\ndirection is on the right side of the compass. This convention prevents us\nfrom drawing the dip direction on the wrong side of the strike line. The\n'dip' is the number of degrees below horizontal, [0° - 90°], that the surface\nis (e.g. an almost flat surface has a low dip and a steep surface has a high\ndip). As there are multiple types of planar features in rocks (including:\nfractures, joints, faults, foliation, cleavage, bedding, etc.) we must make\nnote of exactly what kind of feature we are measuring. As well, geologic\nplanar features are seldom perfectly flat so our measurement procedure\nmust also reflect this. We can either measure non-flat planar features by\ntaking one measurement that we believe to average out the variability or we\ncan take multiple measurements at different points along the planar feature\n(e.g. if you suspect that the bed might be folded, collect multiple\nmeasurements for plotting on a stereo-net.) Also, if working with\nsedimentary beds, confirm if the bed is right-side-up or if it is overturned.\nHere is the plan:\n1. Locate the surface of interest. Check for up indicators, and for\nhow variable the planar surface is. Pick a method and location for\nmeasurement that reflects the preceding observations.\n\nIf you find a local point that is reflective of the average\nsurface and you want to measure there, place your field\nbook or clipboard on the surface and make the\nmeasurement on that surface.\n\nIf you cannot confidently pick a point to make the\nmeasurement, position yourself to that you are staring\ndirectly along the perceived average strike of the bed.\nUse you compass and the \"taking a bearing\" technique to\nmeasure the bearing along the strike line.\n2. Measure the strike remembering to follow the \"Right-Hand-Rule.\"\nOur compasses are 0° - 360° or 'azimuth' compasses. (The other\nkind of compasses are 'quadrant' compasses and are divided into 4\ndistinct 0° - 90° quadrants.) When we take measurements of strike,\nwe always want the black arm of our compass pointing in a\ndirection so that the right side of the compass is on the down-dip\nside.\n3. Rotate your compass so that its standing on its side, on the planar\nsurface. Measure the dip so that the compass is aligned\nperpendicular the to strike direction and along the steepest line of\ndescent (this is the direction that dribbled water would flow down-\nslope). Using the inclinometer (which you control using the lever-\narm on the bottom of your compass) measure dip by adjusting the\narm until the bubble is in the center of the inclinometer tube. A\ngood check that you are measuring the true dip is that if you rotate\nthe compass in different dip-directions, the bubble will only move\nto one side of the bubble-tube. If it moves to both sides, there is a\nsteeped dip to be measured.\n4. We report data as (strike/dip) or (245/32)\n\nField Geology I\nThe Brunton and The Map\nSeptember 26, 2005\nLab Exercise 1\nStructural Data Collection in the Field (ctd.)\no\nLinear Data\n\nMeasuring the Trend and Plunge of a linear feature such as a fold axis or a\nstretching lineation in a sheared conglomerate combines the techniques discussed\nearlier.\n1. First approximate the trend and plunge with a non-magnetic linear object\n(such as a pencil). You make the measurements off this approximation.\n2. Measure the bearing of the pencil in the down-plunge direction. This is the\nconvention and must be followed.\n3. The plunge can be measured directly off the pencil using the inclinometer\nor can be approximated by standing perpendicular to the plunge direction\nand holding the compass up and visually aligning it along the plunging\nfeature.\n4. We report the data following the convention (plungeÆtrend) or (35Æ342)\nread as \"plunging 35 degrees toward 342°.\"\nStructural Data Analysis in the Field\no\nPlotting your data: Right after making a measurement, write it down...don't hesitate as it is\neasy to forget. After it is written down, locate your position on the map and plot the data\nthere so that you can see your new data in context of the map and the other data you have\ncollected.\n\nSymbols for plotting structural data: Keep them small enough that they won't\ninterfere with plotting subsequent data, but large enough that they can be read clearly.\n-\nStrike/Dip is a line drawn with the orientation of the strike and a short line\nperpendicular to the strike line (remembering the right hand rule) showing\nthe dip direction. Write the value of the dip near the short line.\n-\nTrend and plunge are drawn by drawing an arrow in the direction of the\nmeasured trend. The value of the plunge is written near the tip of the arrow.\n\nPlotting the data using a 'C-thru' ruler/protractor\n-\nUsing a north-south trending line for reference, measure the angle of the\nstrike or the trend you collected. Draw the symbol centered directly over\nwhere you collected it. Remember that Azimuth is measured 0° - 360° in\nthe clockwise direction starting at True North.\n\nDo you see any trends in the data you are collecting? Do the strikes and dips show a\nregionally uniform trend or do they reflect some systematic structural deformation or\nis the data all over the place and can't be interpreted with the data you currently\nhave...where will you go next to improve your understanding?\n\nStructural data we collect in the field is imprecise...but how much variability can we\nattribute to our measurement techniques and how much is due to the geologic\nvariability itself? How could we test this?\n\nPages removed due to copyright restrictions.\n\nPlease see:\nCompton, R. R. Geology in the Field. New York, NY: John Wiley & Sons, 1985, p. 398.\n\nCampus Map for Triangulation Exercise\nm\n10m Grid Spacing\nMap from MIT GIS Lab"
    },
    {
      "category": "Resource",
      "title": "2005_lab02_gisou.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/da38d3d502e393be9d1efaf043e1e1f7_2005_lab02_gisou.pdf",
      "content": "Lab 2: Lecture Outline: An Introduction to GIS\n\n1. Introduce Paper Maps\na. It is a flat representation of a three dimensional surface with various features on it.\nThe features are indicated with various different unique symbols. There is a\nscale and a contour interval. We can only clearly pace so much data on it...thus\nwe must be careful what we choose to show.\nb. BUT, paper maps are static and one dimensional with no data hidden below the\nsurface. (example of church: denomination, build age, # parishioners, address,\nowner, acres, # of parking spots...etc.)\n2. Introduce G.I.S. (Geographic Information Systems)\na. Rather than being just a tool from making maps, it is a tool for organizing,\nanalyzing, displaying and distributing complex spatial data.\nb. Let's first consider the paper map and separate out the different layers:\ni. roads, elevation contours, vegetation areas, homes, rivers, airports, place\nnames, railroad tracks, political/agency boundaries, etc...\nii. Now allow each of the objects in each of the layers to have multiple\nattributes describing them (for each house you could have: age, price,\nacreage, square feet, owner, address...etc.)\nc. Data Types\ni. Raster data: continuous, pixilated information\n1. aerial photo, satellite image, digital elevation model (DEM)\nii. Vector data: discrete, often discontinuous data. 3 types:\n1. Point Data: houses, waterfalls, gauging stations, etc\n2. Line Data: rivers, roads, railroads, fences, trials, boundaries\n3. Polygon Data: vegetation, geologic units, lakes...\nd. The Application: ESRI's ArcGIS is composed of multiple components\ni. ArcMap: Create, Edit, Analyze and Print GIS maps.\nii. ArcCatalog: Organize do maintenance on GIS datasets\niii. ArcPad: A portable, field-friendly, mapping application for handheld\ncomputers. It's a stripped down version of ArcMap\niv. ArcScene: A three-dimensional data visualization tool. Allows you to\nfly through the data and create realistic looking landscapes.\nv. ArcToolbox: an application embedded in Map and Catalog, providing\ntools for editing and manipulating your GIS data.\ne. File Types\ni. XXX.mxd is the document that you create in ArcMap. It does not\ncontain data other than what layers were in the map and how you were\ndisplaying them, where the layers are located, etc. The file is small\nbecause it contains no data, BUT it has all your information regarding\nhow you want to visualize your data.\nii. GRIDs: ArcGIS likes to store raster data (see above) as GRIDs. A single\nGRID file is composed of multiple separate files and you should not\nmove them around using the traditional windows explorer. Only move\nthem between directories using ArcCatalog. Arc Map is also capable of\ndisplaying Raster data that are .tiff, .jpg, or other raster data format, but\nonly GRIDs retain their discrete data values (for example each pixel in a\nDEM being assigned a unique elevation) while .tif files are just assigned\ncolor value.\niii. Shapefiles: These files can store point, line or polygon data. They cannot\nstore combinations of data types (for example points and polygons\ncannot exist in the same shapefile). Like GRIDs, an individual shapefile\nis composed of multiple files and should only be moved around on your\ncomputer using ArcCatalog.\nPrepared by Ben Crosby"
    },
    {
      "category": "Resource",
      "title": "2005_lab03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/5c6d2b5cc990430963661277708e55dd_2005_lab03.pdf",
      "content": "Field Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\nIntroduction\nFrom Lab 2 we learned to download, manage and create some standard GIS data. We will now apply that\ntechnique to making digital geologic maps. I will give you a scanned portion of a geologic map (a raster)\nand you will go through a sequence of steps to create an attributed GIS version of the scanned map. You\nwill create point features like strike and dip data, linear features like faults and polygon features like\ngeologic units. As this process is not a simple or a speedy task, we will dedicate two lab sessions (and\nsome of structural geology's lab-time!) to completing the project. And just in case you were concerned,\nthis is not a esoteric exercise. You will seldom examine a geologic map as closely than when you digitize\nit. You will learn about different kinds of faults and contacts as well as the varying levels of certainty with\nwhich the geologist identified them. You will also get practice identifying different structural symbols.\nThis will be a great exercise for both learning GIS technique and geologic map interpretation. As well,\nwhen we are in the field, you will have to do this EVERY NIGHT and the last thing you'll want is to be\nmissing out on the campfire because you are in the computer tent stumbling through these techniques.\nHoning your skills now will pay off in the desert!\nMaterials\nGIS-ready computer\nInternet connection\nScanned Geologic Map\nSome basemap data to build your GIS on\nSome musical entertainment?\nThe Workflow\n1. View your .mxd file, examine the available layers.\n2. Load and georeference the scanned geologic map.\n3. Create and attribute blank shapefiles for storing your geologic data in.\n4. Digitize and attribute the faults\n5. Digitize and attribute the contacts\n6. Turn your lines into polygons\n7. Make sure that all your geologic units are represented by the polygons\n8. Attribute your polygons\n9. Manually measure the strike or trend of point data\n10. Digitize and attribute the point data\n11. Prepare symbology for each of your layers so that your map looks beautiful!\n12. Prepare the map for printing using the Layout View.\n1. Viewing the basemap data\nOpen ArcMap and browse to your directory on Langtang. you will find a folder there called Lab03. Open\nthe ArcMap document 'Lab03_DevilsFence.mxd.' You will see that there are already files in the table of\ncontents. These I downloaded and reprojected into UTM: NAD 27, zone 12. Turn on the different layers\nof your basemap and make yourself familiar with them. These datasets are not stored in your personal\nfolder, but rather at a single site on Langtang. Modifications you make to the way these files are displayed\nare stored only in you .mxd file and have no impact on the static parent file.\n-\nTwo 1:24,000 Digital Raster Graphics (DRGs) USGS scanned topo sheets.\no\nI have made the white areas on the map transparent so you can see the DEM below.\n-\na roadmap of the region (this is not really that useful)\no\nthis is the same 'BTS roads' data that we used in Lab 2\n-\na DEM of the region (Devils Fence, Montana. Near Butte and Boulder, MT)\no\nnote that the transparency is set to 30% so you can see the underlying slopemap\n-\na Slopemap of the region\no\nnote that the slopemap is under (lower in the legend) the semi-transparent DEM\nPrepared by Ben Crosby\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\n2. Loading and georeferencing the geologic map\na) Go the add data button on the top toolbar and look in your Lab03 folder for the file called\n'devils_geo_raw_scan.jpg.' This is the un-georeferenced geologic map. If you make the mistake\nof double-clicking the file, ArcMap will display the three color bands that the .jpg is composed of\n(red green blue). Go back up on directory and single-click on the main .jpg file and then click the\n'open' button.\nb) ArcMap will ask you if you want to build pyramids. Say YES. Building pyramids will create\ndifferent resolution views of the .jpg file so that when you are zoomed out, you are looking as a\nlow resolution version of the map. As you zoom in, finer and finer resolution data will be\ndisplayed. This feature makes the viewing and manipulation of raster data way more efficient.\nc) After the pyramids are built, there will be a warning about your layer \"lacking spatial reference\ninformation.\" That's just fine as this image is nothing more than a scan. It has no information\nabout where ArcMap should display the geologic map. It will be your job to give the image it's\nappropriate position in the world. This is called 'Georeferencing.' For now, ArcMap has sent\nyour scanned image down to UTM coordinates around (0,0). That's on the equator somewhere\nsouth of Baja California. Let's fix that.\nd) We will use an imprecise but efficient method called 'rubber-sheeting' to do this. In essence we\nwill select a number of points visible in the geologic map and match them to the same localities on\nthe DRG maps. Start the process by right-clicking on a blank gray area near the toolbars at the\ntop of the ArcMap window. Open the toolbar by selecting 'Georeferencing' from the list.\ne) Now right click on one of the DRGs in the Table of Contents and select 'Zoom to Layer.' Now\nuse the zooming tools to make both the DRGs visible and centered in your window. Now change\nthe scale of your may to 1:50:000. Notice the flat area where there are not many contours slightly\nright of center. It is called Sagebrush Park and will be visible as the grey blob on the scanned\ngeologic map. At this point, make sure that the geologic map is selected in the 'Layer' pull-down\nmenu of the Georeferencing toolbar. Now make sure that the scanned map is turned on in the\nTable of Contents (TOC) and then, from the Georeferencing pull-down menu, select 'Fit to\nDisplay.' This will position the scanned geologic map to fit within the window you are viewing.\nf)\nTake some time alternating back and forth between the two maps (turning the scanned map layer\non and off) until you can recognize the same geographic features on the two maps. Note that the\ncontour interval and the road network is different between the two maps. One thing that has not\nchanged is the 'township and range' grid present on both maps. Once you find one intersection on\nthis grid that you can recognize in both maps are you are ready to begin georeferencing. Begin by\nzooming into the point on the geologic map.\ng) In the Georeferencing toolbar, click to icon that looks like a blue and a red plus connected by a\nline. This is the 'Add control points' tool. Click on the control point in the scanned image. Now\nzoom out and turn off the scan layer so that you can find the same point on the DRG. Zoom in on\nthe point in the DRG. Click the 'add control point' tool again. Connected to the cursor, you\nshould see a line linking off the screen to your first click. Move the cursor to the matched point on\nthe DRG and click once. Once you turn on the geologic map in the TOC, you should see that it\nhas been shifted so that the two clicks are now over one-another.\nh) Repeat the procedure of clicking a point on the geologic map and then matching it on the DRG\nwith a subsequent click until there are 5-6 Control Points well distributed over the geologic map.\nAt this point the maps should be very well aligned. If they are not, click the 'view link table' icon\njust right of the 'add control point' icon. This will bring up a table showing your matched points\nand in the far right column the Residual Error at that point. If one of your points is not well\nmatched, you will see large values here. Aim to have all residuals around 5, but not much more\nthan 10. If there is a bad one, click on that row and hit delete. That pair of matched points will\ndisappear and you can add another pair to replace it.\ni)\nOnce you are happy with your georeferencing, select 'update georeferencing' from the\nGeoreferencing pull-down menu. This will write a 'world file' (.jgw) in the same directory as\nyour .jpg. This file tells ArcMap the spatial position of your scanned file so it now has an\nappropriate position in space!\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\n3. Creating blank, attributed shapefiles for geologic data.\na) Open ArcCatalog, and as you did in Lab02, create some new shapefiles. You learned this\ntechnique in the last lab so I won't describe the process again here. Save them into your personal\ndirectory in the Lab03 directory. Make sure that you assign the correct projection to each of the\nshapefiles (projected, UTM, NAD 27, Zone 12). Once you do the first one your can just use the\n'import' button and select the previous field that you already defined the projection for.\nType\nName\nLine\nDevils_contacts\nLine\nDevils_faults\nPolygon\nDevils_geo_polys\nb) Open ArcMap, open the attribute tables and add the following attributes to those shapefiles:\nShapefile\nAttribute 1\nAttribute 2\nDevils_contacts\nCertainty (text, 10 char)\nDevils_faults\nType_cert (text, 20 char)\nDevils_geo_polys\nUnit_code (text, 20 char)\n4. Digitizing faults.\na) You will begin digitizing by tracing all the faults on the map. Different segments of the same fault\nare drawn with varying levels of certainty. We must create unique lines for each of these segments,\nbut we must also make sure that the tips of adjacent segments share the same nodes or points so as\nnot to leave gaps in the line. This is FUNDAMENTAL to our later success in creating polygons\nfor geologic units. To assure that our line segment tips are perfectly matched, we will use the\n'node snapping' function in the Editor toolbar.\nb) Begin by zooming to some part of the map where there is a fault to trace. Then from the Editor\ntoolbar, select 'Start Editing.' Next, select the appropriate directory where your fault shapefile is\nstored. Then, under the editor menu, select 'Snapping.' In the Snapping Environment window\nthat opens, make sure to check each of the three the boxes for the shapefiles you created.\nSnapping will allow your editing cursor to pseudo-magnetically snap to a vertex, an edge or an\nend of some other editable feature. Once these are turned on, close the snapping window.\nc) Make sure in the editor toolbar to set the target to your faults shapefile. Click the pencil tool and\nbegin clicking out the line as we did in lab02. When the fault you are tracing changes certainty\n(changing from a solid to a dashed or dotted line), double-click and terminate that line segment.\nd) Continue digitizing the same fault from where you stopped by allowing the cursor to snap to the\nend vertex on the last segment. Click once and continue tracing out the fault, terminating and\ninitiating segments as the fault-certainty changes. If the fault splays (or divides off into multiple\nstrands) you can end your segment and start a new suite of diverging faults from that last node.\ne) You can attribute line segments as you go or wait until you have completed tracing ALL the faults.\ne) If you decide to wait on attributing\nyour faults, I recommend using the\nfollowing method: Make the faults\nas visible as possible (bright, bold\nlines). Open the attribute table for\nthe faults. Click the 'selected'\nbutton next to the word 'show'. Start\nediting, setting the target to faults.\nClick on each fault with the arrow\nediting tool. Your selected fault will\nappear in the Attribute Table\nwindow. Write in the correct\ncertainty. Once you have one of\neach type, you can set the line-\nproperties do display the attributed\nfaults appropriately (Lab3, part 11b).\nThe easiest coding of the certainty is (1=certain, 2=partially exposed, 3=concealed, see legend)\n*here is a map with the faults complete and some georeferencing points visible just below and left of center.\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\n5. Digitizing contacts.\na) You will now digitize all the contacts between all geologic units on the map. This is no more\nthan glorified line-clicking but it is a fundamental skill in making digital geologic maps. Start\nyour project by creating a bounding box that encircles the whole map. In the editor, change the\ntarget to 'devils_contacts,' then use the pencil tool to click your way around the edge of the map,\nbut ending the line (with a double click) short of your initial point. Use the snapping tool (it was\nturned on when you were doing the faults), to confidently close your bounding box. We have to\ndo it this way because you cannot snap-to a line that you are in the process of creating. The\nclosure of your bounding box is essential.\nb) Now lets begin with the contacts. This is tedious work and here are a few words of advice:\na.\nLithologic units must be bound on all sides by either faults, edges of the bounding box or\ncontact line segments. Most units will have multiple line segments bounding them. To\nassure that your unit boundary is complete, ALWAYS start and end your line segments\nby snapping to an existing line segment. Never create a contact that is dangling in space.\nb. Do not worry about digitizing every line perfectly. This is a lab exercise, not a\nprofessional map. Just make sure that each line gets represented well.\nc.\nLike with faults, contacts have variable exposure or certainty (observed, partially exposed,\nobscured). You will create different line segments to demonstrate how this certainty\nchanges, BUT, do not try to capture all the changes in certainty or you will never finish\nthe lab. Look for general trends...e.g., \"along this section, the contact is mostly\n'observed',\" while, \"over here the contact is mostly 'obscured.\" Remember, you will\nhave to specify the certainty for each contact that you draw. I would recommend\ndividing up the 'certainty' attribute into something simple. For example, solid lines are\nobserved contacts (written as '1' in the database), dashed lines are inferred contacts ('2')\nand short-dashed or dotted contacts are poorly constrained ('3'). You can do this anyway\nyou please, but make sure it is clear and efficient for you and the map viewer. The\nlegend from the Devils Fence map is attached at the end of this document for reference.\nd. For sanity's sake, it may help to listen to music once you have the technique wired.\nHere is an example of a map with contacts and faults complete\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\n6-8. Transforming your line data into lithology polygons and adding the unit_code.\na) Now that you have line data that bounds polygons, you are ready to use the Topology toolbar. It is\nactivated the same way the other toolbars are. Right click on the gray area at the top of the\nArcMap window. Here is the sequence of steps:\na.\nTurn off ALL layers except for the faults, the contacts and the polygons. This will help\nyou see what you are doing.\nb. Start editing, then use the arrow tool in the editor toolbar to trace a box around and select\nall the displayed line data. This is the data you will use to make polygons.\nc.\nMake sure that in the editor toolbar, the target is the polygon shapefile.\nd. Click the second icon on the Topology toolbar, 'Construct Features.' This will bring up a\nwindow asking about tolerance...leave it alone and just say ok.\ne.\nThe process will run and create a group of polygons.\nf.\nClick the editor arrow in a blank spot and deselect the lines. Now use the TOC to switch\nthe lines on and off. Confirm that each polygon is appropriately unique and that each\ncontact was used as an edge for a polygon. When I first did this, I found a few errors in\nmy work. Find the errors now, before you add attributes to the polygons.\ni. If you find errors, (unbounded polygons), follow these steps:\n1. In the TOC, turn off all the layers except the polygons.\n2. With the editor running, use the editor arrow tool to draw a box around\nall of your freshly created polygons. Hit 'Delete.'\n3. Change the target in the editor to the contacts shapefile. Double click\nwith the arrow tool the offending line segment. Grab the point that you\nneed to snap to another line and make it so.\n4. Now that you have fixed all your dangling, unsnapped lines, save your\nedits and repeat the process outlined above starting at (a.)\ng. Now that you have good looking polygons, you will need to attribute each one. At the\nend of this document, there is a legend from the geologic map that shows the unit_codes\n(the short abbreviated name written on the colored box or on the unit in the geologic\nmap). The name, age and character of the unit is also stated. For now, just write the\nshort unit_code for each polygon. The easiest way to do this is just to open the attribute\ntable and click on the far left end of the row and see which polygon is selected. If the\npolygon layer is made very transparent, then you will be able to see which unit is below.\nWe will later add all the other lithologic information in an efficient manner.\nThis is the map with all lines selected and unattributed polygons.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\n9-10. Manually measuring and the digitizing the point data\na) This will take some time but you will get really good at using your C-Thru ruler. The best way to\ndo this task is to share the workload. I have divided up the map into areas so that we are each\nresponsible for part of the work. On the table in the GIS lab you will find a copy of the map with\nlines dividing it up into regions. Find your region and do that work. There is a point data\nshapefile in the Lab03_data directory on Langtang. In turn, we will each open and add data to it.\nOnly one person can add data at a time (like Piggy and the conch). We will have an early deadline\nfor this task so that we can all begin working with the data ASAP. Here are the steps:\na.\nUse your C-Thru ruler to measure the azimuth of each structural point feature you can\nfind in your map region. Write this number on the paper map sheet and circle the point.\nb. Add the devils_points_group shapefile to your map and begin editing it. To add a point,\nmake the scanned geologic map visible and click on the center of each symbol (the\nintersection of the strike and dip). Use the key in the back to determine what each\nsymbol is. Use the following terminology in the type column of the attribute table:\nStrike/Dip (sd), Strike/Dip of a contact (sdc), Strike/Dip of a fault plane (sdf), Strike/Dip\nof an overturned contact (sdoc), Vertical bedding (vb). These different terms for the\nstructural data will allow unique symbols for each.\nc.\nWhen you are finished, stop editing and pass the map to the next person. The idea of\nwriting the data down is that if the file is corrupted or is lost somehow we have a paper\nversion to work from and do not have to do all the measurements over again.\n11. Prepare symbology for each of your point, line and polygon layers.\nNow we get to make our maps look beautiful. We will display the faults, contacts, point structural data and\npolygons in such a manner that the data is not only clear for reading but looks good too.\na) Fault Line symbology\na.\nWe want the faults to be distinct from the contacts, we don't know the sense of\nmovement on these features so we cannot use structural symbology for thrust or normal\nfaults. Instead, we will display faults according to their certainty. To make them stand\nout from the unit contacts, we draw them in red and with a line twice as thick. To do this,\nwe open the Properties/Symbology tab and select 'Categories: Unique values'.\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\nb. Under the Value Field pull-down menu, select the attribute that describes the fault's\ncertainty. Click the 'add all values' button. You should only have line segments for the\nattributes you created. There should be no counts for values of 'zero' or for '(all other\nvalues).'\ni. If there are then that means you have faults that are not attributed or that they are\nattributed incorrectly. If that is the case, go back to the main window, open the\nattribute table for the faults layer and right click on the heading that you used for\nthe fault certainty. Arrange the attribute values by 'sort ascending' and scroll\nthrough to find the errors. Start editing and change the values. Save your edits.\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\nc.\nNow that all your faults are attributed correctly, go ahead and set the way you want your\nlines to display. Open Properties/Symbology and click on the line beside the value field.\nThis will bring up the 'Symbol Selector' window. Make sure that the Geology 24K\nsymbols have been selected under 'more symbols' button. If you single-click on one of\nthe lines on the left and start typing 'fault' it will automatically scroll down to the faults.\nI decided to use 'Fault - Certain' for '1,' 'Fault - Inferred' for '2' and 'Fault - Concealed'\nfor '3.' I left the line width at 1.08 but changed the color from black to red.\nCourtesy of ESRI. Used with permission.\nb) Polygon Lithologic Symbology\na.\nUse the properties/symbology tab again to assign unique colors to each unit_code.\nRemember to add all values or you will not see each of your units. Use the TOC to\nchange the colors for each of the units on the map. Single click on the TOC box showing\nthe polygon color to open the 'Symbol Selector' window. In this window, click 'More\nSymbols' and select 'Geology24K.' This will add more colors and patterns to your\npalette. Try to follow the color scheme used on the paper map. The use of the line-\npattern within different units is valuable if the image is duplicated in black and white.\nWe have a color printer and will not worry too much about texture. If you decide to use\ntexture, scroll down through the predefined colors to find the black and white geologic\npatterns. For fills that are not lines (like 317 Igneous), you can change the color of the\nsymbol and the background color. For the fills that are just lines (like 661 Flint Clay), it\nis more difficult to change the background (give it a try if you wish). To change to\nbackground color for a non-line geologic pattern click the symbol once in the main\npattern viewing window, then click on the 'Preview' window for that pattern. This will\ntake you to the 'Symbol Property Editor,' where you will see a selection for the\nbackground color of the pattern. This way you can have a limestone polygon fill pattern\nand a particular color. Using properties/labels, turn labels on, using the unit_code field.\nAdjust the 'placement properties' until the labels look right.\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\nc) Contact Line Shapefile\na.\nThe procedure for the contacts is exactly the same as for the faults. In the Symbol\nSelector window, instead of typing 'fault,' type 'contact' and again I used 'certain'\n'inferred' and 'concealed.' I left the lines black and went with the thinner line (0.43).\nb. When you add all values in the categories window, don't forget to check for line\nsegments with labels that don't match up with your intended attributes.\nd) Structure Point Shapefile\na.\nFor this one you will use the Properties/Symbology/Unique values window and choose\nchose the Value Field for 'structure type.' 'Add all values', and select the proper\nsymbology from the Symbol Selector window. Type 'inclined' for the strike and dip\n(s/d) symbol, 'photo' for the s/d of a contact. I'll leave it to you to find the overturned\nbed, the vertical bed and other structural point symbols.\nb. Now in the Properties/Symbology window, click the 'advanced' tab and select 'rotation'.\nSelect Azimuth from the pull-down menu. Make sure 'geographic' is selected. All your\ns/d data should now be rotated correctly. Compare it to the scanned map!\nc.\nIn order to have the dip value labels display appropriately next to symbols, we will create\na new column in the structural_point_data attribute shapefile. To do this, stop all editing,\nopen the attribute properties for the structural point data and use the options button to\ncreate a new column. Name it labelloc and set it as short-integer. Next right click in on\nheader for the new column and select 'calculate values.' In the work area you will see\nthat it already says 'labelloc ='. Double click on the field '[Azimuth]' to add it to the\nequation then add a '+' and type 90. This math will add 90 degrees to all the azimuth\nvalues and place that product in the labelloc column.\nd. Now that we have good locations for the labels, go to the Properties/Labels tab and click\nthe box to 'label all features'. For the label, select the 'text string' dip_plunge. Next\nclick on 'placement properties' and change the 'point settings' to 'Place label at an angle\nspecified by a field.' Then click the 'Rotation Field...' button and select 'label loc',\ngeographic and do not check the box to 'place label perpendicular to the angle.' This\nshould now display your dip values in appropriate locations.\n12. Prepare the Map for Printing Using 'Layout View'.\nLayout view is how we configure our map sheet for printing. There you add a legend, a title, a north arrow\na scale and any other necessary notes. Though Layout View works just like the Data View window, it is\nslower and more clunky. To speed things up, I have written instructions to maximize processing power.\na) Preparing to go to Layout view\na.\nMake sure the symbology and display properties (transparency, etc.) of your layers are\nset to look the way your want them to. Though you can change things in layout view, it\nis slow to redraw. The following layers should be used in your final map:\ni. the geologic polygons with units labeled\nii. the faults and contacts\niii. the structural data with the dips labeled\niv. the Shaded Relief of the region (final_hlshd)\nv. the 2 DRG's (make sure all large regions are set to null (there is one region in\nthe northern part of the map). To do this, use the info tool to find the numeric\nvalue of the particular color. Then click on that color in the TOC. On the second\ntab in the new color chooser window, select the color as null.\nb. Use the zoom tool to zoom as close as possible to extent of your geologic map.\nc.\nGo to file, page and print set-up. Select the printer 'Langtang/raindrops.' Under paper\nsize, select Tabloid and click the landscape button. Click ok and close the window.\nd. Now, turn OFF all the layers except the contacts. They will be your layout guide.\nb) Layout View\na.\nUse the pull-down menus at the top to select View/Layout View.\nb. Allow you map to fully draw. It should be enclosed in a selected box. Position and\nchange the size of the box on the paper so that you have room to place a legend and other\ninformation. Use the ruler surrounding the work area to make sure that the paper is the\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\nright size (11'' x 17''). If your map is not displayed correctly in the selected box, use the\nstandard zooming tools that you use in Data View to get the map in the right position.\nc.\nAround the edge of the map box, add the following items. They in the 'Insert' menu\ni. scale bar\nii. north arrow\niii. legend: I'd include: point data, contacts, faults, polygons\niv. Text: the scale (on the top toolbar), projection info, data sources, your name\nv. Title (no need to add one! Use the Title at the top of the legend for this!)\nd. Once it looks good, turn on all the layers that you want to show (I think the DRG and\nshaded relief look good when included...your choice). Select file/print and make sure the\nimage looks right on the page (nothing over the edge), and select print! It will go to the\nth floor copier across the hall from the Education office. You are done!\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\naasdf\n\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nField Geology I\nDigitizing a Geologic Map\nOctober 17, 2005\nLab Exercise 3\nLab Exercise 3"
    },
    {
      "category": "Resource",
      "title": "2005_lab04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/0e15ac4bf1f98e642c059d648efbcb21_2005_lab04.pdf",
      "content": "Field Geology I\nGeologic Map Interpretation\nOctober 31, 2005\nLab Exercise 4\nprepared by ben crosby\nIntroduction\nHappy Halloween! In this lab we will focus on interpreting geologic maps.\nFor the lay person, geologic maps are intriguing and mystifying images composed of swatches of color,\ncurving and straight lines and all sorts of strange symbols. They juxtapose the familiar (roads, topography)\nagainst the obscure (the distribution of underlying rocks and structures). They have been shown in\nmuseums as works of art and hung on the walls for their aesthetic appeal. They dazzle.\nFor dedicated earth scientists, geologic maps are just as intriguing and mystifying. Even for the authors of\nmost geologic maps, there are elements of the final product that continue to puzzle and defy simple\nexplanation. But for geologists, maps are the fundamental tools of our trade. They synthesize and organize\nthe observations and interpretations we make in the field into a format that allow us to make further\ninterpretations and correlations. Once published, they are accessible and useful to other geologists.\nIn order for us to successfully create maps of our own, we must work to develop an intuition for what\ninformation is present in geologic maps and how we extract that information in an efficient manner. By the\nend of this course in the spring, I expect that each of you will be able to look over a geologic map and\nrecognize the important structures and relations between units well enough that you could sketch out in\nyour mind a number of rough cross-sections. This intuition and facility for geologic map interpretation is\ndeveloped through two types of exercises: pouring over paper maps in the lab and making your own maps\nin the field. Today we will work on the first part and we'll save the second for the desert.\nMaterials\nGeologic Maps and Legends\nTracing Paper with Grid Pattern\nIndex of Geologic Structural Symbols\nCalculator with Trig functions\nIndex of Geologic Map Patterns\nRulers, colored pencils, protractors\nThe Workflow\n1. Discuss the types and scales of geologic maps that exist and the data and symbology used in each.\n2. Discuss how the interaction between topography and geologic structures determines map pattern.\n3. Pick a location to create your cross-section on the Devil's Fence Geologic Map.\n4. Draft a topographic profile along your cross-section, locating unit contacts\n5. Project adjacent structural data onto cross-section line, make apparent dip calculations, and draw\nthese values onto the cross section.\n6. Calculate unit thicknesses (necessary for drawing subsurface beds, drafting the stratigraphic\ncolumn and identifying changes in unit thicknesses across the map area)\n7. Draw the geologic cross section for the Devil's Fence Quadrangle.\n8. Draw the stratigraphic column for geologic units in the Devil's Fence Quadrangle.\n1. Types and Scales of Geologic Maps\nGeologic maps come in numerous flavors. The data depicted on the map may be useful to mineral\nexploration, petroleum exploration, water resources, glacial geology, surface deposits, structural geology,\nmarine geology, continental assemblage, etc. For example, for mineral exploration, local maps of the\nvariation in the earth's gravity and magnetic fields is extremely useful in locating deposits. Some maps\nseparate out discrete units according to their lithology while others separate out units according to deposit's\nage. Some maps describe tectonic units by lumping together all the formations that have the same tectonic\norigin. The level of detain in a particular map depends on its scale and on the intentions of the geologist\ndrafting the map. For example, a geologic map at the scale of the world cannot possibly display separate\nunits on Mt. Saint Helens, but a geologist creating a map just of the volcano would take great care to map\neach separate eruptive deposit. The scale of the map is also indicative of how the data was collected. For\nlocal maps, the data presented was likely collected by the field observations of the author. For larger scale\nmaps, the data was likely collected by multiple workers at different times and compiled (and often\nsimplified) by a only handful of individuals. Other maps at larger scales are based purely on remote\nsensing (using aerial photos or satellite imagery), not field observation. (show examples, Walthers law)\nPrepared by Ben Crosby\n\nField Geology I\nGeologic Map Interpretation\nOctober 31, 2005\nLab Exercise 4\nprepared by ben crosby\n2. Interaction between topography and geologic structures\nThe interaction between topography and geologic structures can create deceiving map patterns. Two\ndifferent structural settings can have a similar map pattern depending on how they are exposed through\nerosion. Be cautious interpreting geologic maps by colors alone. To assess the geometry of geologic units,\nit is necessary to integrate the structural data available on the map with the topographic data. If the aerial\nextent of a particular geologic unit varies across the map, it may be due to actual variation in the unit's\nthickness, or more likely, it is a due to changes in the local topography or structural orientation of the unit.\nThe easiest maps to interpret are those in relatively flat areas. Imagine vertical strata exposed on a flat\nerosional surface like a wave-cut platform. The thickness of each stratigraphic unit can be measured\ndirectly off the map. Now imagine all the beds are dipping at 45 degrees. The map is almost the same, but\nthe units now appear thicker on the map pattern than they are in reality. Adding topography and more\ncomplex structural deformation complicates the map pattern significantly. Though well trained geologists\ncan interpret geologic maps relatively quickly, without the topographic and structural data they would\nnever be able to discern what's going on in the subsurface. (Canyonlands topography/geology example)\n3. Picking a location for a geologic cross section\nPicking a good orientation and location for a geologic cross section is one of the most important steps in\nthis lab. If there is a dominant structural trend in your map area, picking a cross section line perpendicular\nto that trend will not only make the cross section easier to draft but will also best express the subsurface\narchitecture. Also, try to pick a line that crosses the most important or interesting structures of your map.\nIt is also good to pick a line that crosses the maximum number of map units. If making multiple cross\nsections, pick at least one line that goes through the easy-to-interpret part of the map to act as a guide for\nthe other, more complicated sections. Cross sections also do not have to be straight, but instead can be\ncomposed of connected linear segments. Try to keep these segments as parallel as possible to minimize the\ndistortion of the dip (pick multiple sections so students can work in groups of diverse experience and later\ncompare variations in unit thickness across the map area)\n4. Drafting the topographic cross section and adding contacts\nOnce you have decided on your cross section line,\nposition and lightly tape your gridded tracing\npaper over the map so that the cross section line\ntraces horizontally across the lower third of the\ntracing paper.\ntopographic profile\nsection line w/ ticks\nUsing a hard pencil, lightly trace the cross section line. Working from left to right, place vertical tics\nbelow the traced cross section line each time it crosses a contour. Jot the elevation of the contour each time\nit is convenient. If it is too laborious to physically impossible to note every contour, just do the major\ncontours (e.g. 5400, 5600, 5800). In the regions between major contours use a symbol to help you\nremember if you are moving up or downhill. When you draw the section, try to emphasize stream\ncrossings or hilltops as they will be useful guides when switching between map and section. Now go back\nover the cross section line and place a vertical tic above the line each time you cross a unit contact. Write\nthe lithologic unit code between the two tics that bound the particular unit. Your line should look\nsomething like this:\n\nField Geology I\nGeologic Map Interpretation\nOctober 31, 2005\nLab Exercise 4\nprepared by ben crosby\nYou are now ready to draft your topographic profile. It is much easier (and geologically correct) to make\nyour cross section with no vertical exaggeration. Look along your cross section line and find the highest\nand lowest elevations. Next, find the scale bar on the map. Along the edge of a scrap piece of paper, draw\nticks spaced according to the contour interval. (200 ft works for our map) Make sure you have enough\nticks to cover the range of elevations along your profile. Next, project the ends of your section line up to\nabout a third of the way down from the top of the tracing paper. (see figure above) This is where you will\ndraw your topographic section. Use your paper with the contour interval ticks to make scales on both sides\nof the upper section line. If it is not clear where the elevations trace across, you can draw your own faint\nhorizontal guides. You are now ready to project your data up from the section line to create the\ntopographic profile with unit-contacts crossings. Your line should look something like:\n5. Projecting structural data onto the section and calculating apparent dip\nBecause structural data on geologic maps is seldom found in straight lines, we have to project the structural\ndata from the region onto our cross section line. In regions where the data is sparse you may need to go\nfurther out from your line. In regions where the data is rich close to the line, don't include data from very\nfar away. There is no hard-and-fast rule on how far away to get data from, so use your best judgment. Try\nto get at least a few good structural measurements for each of the major units or structural features in your\ncross section.\nIn this lab, because of the relatively\nsubdued regional topography, we will\nproject structural data along-strike until it\nintersects the section line. Where the data\nintersects the line is where we will plot\nthat values on the cross section. If there\nwas greater variation in topography across\nthe map, we could not simply project the\ndata along strike to the section line.\nBecause the strike of the projected\nstructural data is not perpendicular to the\ncross section line, we cannot directly use\nthe dips measured in the field. If the strike\nis anything but perpendicular to the\nsection line, the dips that we draw on our\nsection will be less than the measured dips.\nWe will determine this value, the apparent\ndip, for each structural data point along\nour section. We can determine apparent\ndip using either a stereo-net, a\ntrigonometric calculation or a table of\nvalues. For this exercise we will use the\ntable, but for reference, I will also provide\nthe trigonometric calculation below.\n\nField Geology I\nGeologic Map Interpretation\nOctober 31, 2005\nLab Exercise 4\nprepared by ben crosby\nTo use the table on the previous page, measure the acute angle between the projected strike line and the\nsection line and match this value with the measured dip of the bed. Locate the positions of the intersections\nbetween of the projected strikes and the section line and plot them on a line just above your lower reference\nline on the tracing paper. Once they are located , project them up onto your section and draw short line\nsegments extending down below the surface at their apparent dip. Write the apparent dip value above the\nsurface.\n6. Calculating the thickness of the geologic units\nIn order to construct a coarse, reconnaissance stratigraphic column or project units to depth in our cross\nsections, we need to know the thickness of the geologic units in our study area. Assuming that our cross\nsection is approximately perpendicular to the strike of most units, we can calculate the thickness of the\nunits using some trigonometry and our topographic cross section. To do this, we can take the apparent dip\nvalues within the unit (or better yet, the values at the upper and lower contacts of the unit) and project the\nunit contacts up into the air. The length of the line perpendicular to the contacts is the unit thickness. Note:\nIf our section line was less perpendicular to the strikes of the units, would be underestimating the unit\nthicknesses. In that case, measure unit thicknesses separately using sections perpendicular to strike.\nmeasured unit thickness\n\nField Geology I\nGeologic Map Interpretation\nOctober 31, 2005\nLab Exercise 4\nprepared by ben crosby\n7. Drawing the geologic cross section\nNow that we know the unit thicknesses and the apparent dips of the units, we can begin to draw the cross\nsection. Ink your topographic profile, your unit contacts and your apparent dip at the surface. Be prepared\nto erase heavily as you try out different solutions. You may find correction fluid is your friend. Strive to\nmaintain consistent unit thicknesses as you project units below the surface. If there are faults of known\ndisplacement, try to demonstrate this as well. If you are uncertain of the dip of the fault, just consider it\nvertical and make a note that the dip is uncertain. If there is a unit that there is no apparent dip data for, just\nkeep it consistent with the units above and below it. Also, igneous intrusive units sometimes follow\nbedding planes and sometimes do not. Use the legend to help you decide which are which. Their map\npattern in deformed regions should also help your visualize this. Also look at the map in regions adjacent\nto your cross section line and try to use clues from those regions to understand what might be going on\nbelow your area. If it helps you visualize the continuity of the structures, project the contacts up into the air\nusing dashed lines. As well, try projecting your data to a depth that you feel you have moderate certainty\nabout. Deeper that that should be the realm of light dashed lines with lots of question marks. Color in the\nunits, shading boldly in regions well constrained by your data (the surface) and shading lightly in regions\nthat are speculative (the deep subsurface). Feel free to add clearly drafted notes all over your cross section\nas you deem necessary. Label units and other items to inform your reader of what they are seeing. Here is\na small portion of a cross section as an example\n8. Drawing a stratigraphic column\nNow that we have created a geologic cross section and know the unit thicknesses, we are ready to draft our\nstratigraphic column. We will create a column scaled according to unit thickness rather than geologic time.\nStart by summing the thicknesses of the units so that you know what scale to draw the column at so that it\nfits on one piece of paper. For the units that are not crossed by your cross section line, ask the members of\nthe other groups what the thicknesses of these units were or calculate them by hand off the geologic map\n(remembering to take into account the structural dip of the beds). Pick some bottom unit as the base of the\ncolumn and begin the elevation there as zero. Each subsequent unit then adds onto the height of the unit\nbelow it. The columns to include are (from left to right): age, height above arbitrary zero, unit thickness,\nlithologic column and notes. If you want to add one or change the order to increase clarity go for it...just\nstrive to make it look good. Use the key to the geologic map (below) to help you understand the types of\ncontacts between the units as well as the lithologic types. Use the symbology for lithologic units from\nCompton's book to help you decide how to draw each of the units. Like the cross section, annotate the\nheck out of the column; make it a useful graphic tool for understanding the geologic history of the Devil's\nFence Region.\nTypes of unconformities"
    },
    {
      "category": "Resource",
      "title": "2005_lab05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/0534b670d77cea3a06b3f849898f1b64_2005_lab05.pdf",
      "content": "Field Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nIntroduction\nIn this lab we will exercise our skills in 3D visualization. First, we will use ArcScene to view and create\ntopographic renderings of our digitized geologic map. The outline here is general and will work for any\nscanned or digitized geologic map. Once we have made a 3D rendering, we will then sketch block\ndiagrams beneath this surface. Unlike the last lab, we will not focus on creating exact representations of\nthe subsurface geometry (we will not worry about apparent dip), but rather focus on building skills thinking\nabout structures in three dimensions. Sketching block diagrams below geologic maps is an good way to\nbegin practicing the kinds of sketches you will put in your field book in the desert.\nMaterials\nUngeoreferenced, digital geologic map image\nGeoreferenced map layer for region of interest\nESRI ArcScene and Adobe Photoshop\nDEM data for region of interest\nThe Workflow\n1. Locate and clip the region of interest from the digitized or scanned map\n2. Load your clipped image into ArcMap and georeferenced it\n3. Load your georeferenced image into ArcScene and view the map\n4. Position, prepare and print the image\n5. Sketch your structural relations in three dimensions\n1. Locate and clip the region of interest from the digitized or scanned map\nBegin by locating the image from the Devils Fence Geologic Map. I put it in:\nLandtang/public_d2/user_data/12.114_2005/users._lab_05. This image is an output of Ben's final map. I\nalready exported it from ArcMap as a .jpg to save you that extra step. If at sometime you need to do it\nyourself, use the File menu and select 'Export'. Be sure to choose a large enough dpi that you maintain the\nresolution necessary to make a good looking block diagram (I like 300-600).\nYou will next crop the image in Adobe Photoshop. This step is essential for two reasons: (1) the entire\nimage is large and difficult to manipulate at full resolution in ArcScene and (2) you want to orient your clip\nso that the edges are perpendicular or parallel to structures of interest (just like our cross sections).\nUse the crop tool to draw a box around your area of interest. The crop tool is in the tool bar and looks like\ntwo black 90 degree angles. If you can't find it, just hit the 'c' button and the tool will be activated.\nProceed by drawing a small preliminary box. This will allow you to rotate, position and expand the box to\nthe right size before executing the clip. First prepare to rotate your clip-box by placing the mouse just\noutside one of the corners of the box. The pointer will change to a curved arrow. Hold the mouse button\ndown and rotate your box so until it is perpendicular to your structures of interest. Choose an area that is\nlarge enough to tell a geologic story but small enough to be manageable. You will be able to rotate the\nclipped image in any direction when you are in ArcScene, so align any/all edges that you think you might\nwant to sketch the subsurface for. Pick a region that suits your interest and skill level. If you pick a really\neasy one, I will expect you to do a couple of them.\nPrepared by Ben Crosby\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nOnce you have prepared the right location for your clip, hit return and your region will be rotated and\nclipped. Hit Ctrl-Zero and the map will be fit to the window.\nIt is now time to save your clipped map. Images of the 'save' windows are on the following page. Choose\nFile/Save As and select format: .jpg. Crate a new folder in your directory on Langtang (Labeled Lab 05),\nand save your image there. When the jpeg options window opens be sure to save the image using 'Format\nOptions: Baseline.' A Quality of 8 should be fine as well. When creating images for ArcScene, it is good\nto walk the line between making images small and making them still display at a good resolution.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\n2. Load your clipped image into ArcMap and georeferenced it\nNow that you have saved your image, exit photoshop and open ArcMap. Open a blank document and load\nin your reference spatial data (in this case, ben's polygons: devils_geo). It is in the _lab05_data directory.\nCourtesy of ESRI. Used with permission.\nNext, load in the ungeoreferenced .jpeg image you created. It will ask to build pyramids; say ok. After the\npyramids are built, there will be a warning about your layer \"lacking spatial reference information.\" That's\njust fine as this image is nothing more than a scan. It has no information about where ArcMap should\ndisplay the geologic map. It will be your job to give the image it's appropriate position in the world. This\nis called 'Georeferencing.' For now, ArcMap has sent your scanned image down to UTM coordinates\naround (0,0). That's on the equator somewhere south of Baja California. Let's fix that.\nWe will use an imprecise but efficient method called 'rubber-sheeting' to do this. In essence we will select\na number of points visible in the geologic map and match them to the same localities on the devils_geo\npolygon file. Start the process by right-clicking on a blank gray area near the toolbars at the top of the\nArcMap window. Open the toolbar by selecting 'Georeferencing' from the list.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nNow zoom to the area on your polygon layer where you think the clip should fit. At this point, make sure\nthat the geologic clip is selected in the 'Layer' pull-down menu of the Georeferencing toolbar. Now make\nsure that the scanned map is turned on in the Table of Contents (TOC). Now, from the Georeferencing\npull-down menu, select 'Fit to Display.' This will position the scanned geologic map to fit within the\nwindow you are viewing.\nCourtesy of ESRI. Used with permission.\nTake some time alternating back and forth between the two maps (turning the scanned map layer on and\noff) until you can recognize the same unit contacts on the two maps. Once you find matching points on\nboth maps, you are ready to begin georeferencing. Begin by zooming to the point on the geologic clip.\nIn the Georeferencing toolbar, click to icon that looks like blue and a red corsshairs connected by a line.\nThis is the 'Add control points' tool. Click on the control point in the scanned image. Now zoom out and\nturn off the clip image so that you can find the same point on the geo_polys. Zoom in on that point in the\ngeo_polys. Click the 'add control point' tool again. Connected to the cursor, you should see a line linking\noff the screen to your first click. Move the cursor to the matched point on the geo_polys and click once.\nOnce you turn on the geologic clip in the TOC, you should see that it has been shifted so that the two clicks\nare now over one-another.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nRepeat the procedure of clicking a point on the geologic clip and then matching it on the polygons with a\nsubsequent click until there are 4 Control Points near the corners of the geologic map. At this point the\nmaps should be very well aligned. If they are not, click the 'view link table' icon just right of the 'add\ncontrol point' icon. This will bring up a table showing your matched points and in the far right column the\nResidual Error at that point. If one of your points is not well matched, you will see large values here. Aim\nto have all residuals around 5, but not much more than 10. If there is a bad one, click on that row and hit\ndelete. That pair of matched points will disappear and you can add another pair to replace it.\nCourtesy of ESRI. Used with permission.\nOnce you are happy with your georeferencing, select 'update georeferencing' from the Georeferencing\npull-down menu. This VITAL step will write a 'world file' (.jgw) in the same directory as your .jpg. This\nfile tells ArcMap the spatial position of your scanned file so it now has an appropriate position in space!\nSave your work in ArcMap as a ArcMap document (.mxd). Now you have an image of a geologic map that\ncan be viewed in ArcScene.\n3. Load your georeferenced image into ArcScene and view the map\nOpen ArcScene by going Start/Programs/ArcGIS/ArcScene. ArcScene works a lot like ArcMap except that\nyou can view your data in three dimensions. Use the normal add-data button and select your georeferenced\ngeology clip. It will display like a flat sheet hovering in space in ArcScene.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nYou will next tell ArcScene what topography you would like to place under the geologic map. Double\nclick to map entry in the TOC or right-click and select properties. Under the 'base heights' tab, select,\n'Obtain heights for layer from surface:' and use the 'open folder button' to find your way to the\n_lab03_data folder and select 'final_dem.' Do not change any other values.\nCourtesy of ESRI. Used with permission.\nYour topography should be wrinkly now as each pixel is now hovering at the elevation of the underlying\ntopography. The match between the geologic map and the topography is not precise but it is close enough\nto look good. You may want to add some vertical exaggeration to make the topography stand out, but this\nis a double edged sword. If the vertical exaggeration is too high, you will no be able to see topography\nobscured behind tall hills when you go to make your block diagram. I recommend 1.5x but not more thatn\n2x. To change this value, from the menus select, View/Scene Properties. Change the value and click ok.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nGetting used to maneuvering around the three dimensional image will take some time. There are multiple\ntools for changing the view of your scene.\nThe globe with arrows is the easiest\nto start with. You can grab the map with it and rotate or tile the image at will. If you have a roller mouse,\nyou can zoom in and out by rolling the wheel and pan by holding the roller button down. The nexy most\nuseful tool is the seagull tool, which allows you to fly through your scene. The way it works is that you can\ncontrol where the bird flies to by its position on the screen and you can control how fast it flies by clicking\nthe left mouse button to go incrementally fast and the left button to go incrementally slower. You will see\nyour speed displayed in the lower left corner of the screen. If the value is negative you are flying\nbackwards. If the value is positive...well you know what you are doing by now. The bird is hard to handle\nat first, and you will get lost and find yourself flying through blank space. When this happens move the\nmouse up to the toolbars and select the same icon form ArcMap 'zoom to full extent' this will be one of\nthe most useful tools when working in ArcScene.\nOnce you get the hang of cruising around in ArcScene, you are ready to increase the quality of display of\nyour map. Go to the maps layer properties and select the rendering tab. Slide the quality enhancement to\nabout 3⁄4 the way to 'high.' This will allow you to see the image at high resolution so that you can see all\nthe important detail. It will take some time to display initially, but it should not be too slow while flying\naround.\nCourtesy of ESRI. Used with permission.\nHave fun flying around for a little while and get the lay of the land now that you have the quality resolution.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\n4. Position, prepare and print the image\nAs your final trick in ArcScene, position the image in a way that you can see the geologic map and that you\nwill have a good view of two edges of your map.. This way you can create a good block diagram where the\ntwo edges can have cross sections drawn below them. Block diagrams are always most interesting at the\nintersection of the two sections, so make sure this corner is visible. Also, try to get the map at the right\nangle so that you can still see the geologic units but also have space for the sections. This means...leave a\ngap below the map. You are ready to export and print.\nCourtesy of ESRI. Used with permission.\nNow export the map as a .jpg and save it in your\nfolder. When you export the image, make sure that\nyou get the settings right. Again, set the export\nresolution at something between 300 and 600. But,\nmost importantly, at the bottom of the Export Map\nwindow, set the 'scene size' to something\nlarge...like 3500 pixels. Otherwise you map will\nhave poor resolution. Click save and you have\nmade an image of your three dimensional map.\nYou can now print your exported .jpg in another\nprogram or you can just print it straight out of\nArcScene. To print out of ArcScene...\nCourtesy of ESRI. Used with permission.\n\nField Geology I\n3D Visualization and Block Diagrams\nNovember 7, 2005\nLab Exercise 5\nprepared by ben crosby\nGo to File/Print. Go to the setup tab. Select the raindrops printer (9th floor color). Click properties and\nmake sure the paper size is set to tabloid. return to the setup window and if not already done, select 'paper\nsize' as tabloid and choose landscape orientation. Close the Settings window. In the print window, change\nthe output quality to about 3⁄4 of the way to best and click ok. You map should be printing downstairs now.\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n5. Sketch your structural relations in three dimensions\nThis is just like a cross section, but it has two edges. Use the geologic map that you have for your manual\ncross section or your digital map to look at the structural relations going on and make the best 3D image\nyou can. Here is an example of a nice looking block diagram. Aim for something like this"
    },
    {
      "category": "Resource",
      "title": "2005_lab2_1_2_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/c0f0fd75808b8e8fc6716ccfd06641b7_2005_lab2_1_2_2.pdf",
      "content": "Field Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\nPart 1: GIS Data from the Web: Downloading and Projecting\nDigital Elevation Models (DEM) and BTS Road data\n1. Introduction\na. GIS tools allow us to not only visualize/querry existing datasets but to create our own. In\nthis exercise we will learn to download and manipulate datasets available free over the\nweb. In Part 2, we will use these data sets will as a base map on which we will plot our\nown data. This exercise will teach us many of the fundamental skills necessary to make\nbasic maps using GIS tools.\nb. You will download Digital Elevation Models, and the digital vector road data from the\nUSGS website: http://seamless.usgs.gov.\nc. Projections - Every spatial dataset is projected in some manner, to transfer the\ngeographic coordinates of latitude and longitude on the three-dimensional earth to X and\nY coordinates on a flat piece of paper. When using a dataset, we need to know what\nprojection it is in, so that it can be properly aligned with other datasets. All the data in a\nGIS data view must be in the same projection in order to line up properly with all the\nother datasets. In ArcGIS these tasks are often done in the background, so the user does\nnot have to worry about them. ArcGIS will use the projection of the first dataset loaded to\nset the projection of the view. It will then re-project each dataset on the fly to match that\nprojection, so long as the datasets have a projection defined. If not, it will guess at what\nprojection the data is in.\n2. Data and Software\na. For this part of the lab/homework you will download the necessary data (DEM raster data\nand Roads vector data) from the web, as detailed in the following instructions.\nb. All of this exercise can be done in the ArcMap, including ArcToolbox, and ArcCatalog\nmodules of the ArcGIS Desktop. Each application can be found in the Start menu, under:\nStart >> All Programs >> ArcGIS, except ArcToolbox, which is accessible from ArcMap.\n3. Downloading a Dataset\na. (you should be using Mozilla Firefox as your browser. Internet Explorer won't work.)\nb. Background\ni. For this exercise we will use elevation data from the National Elevation Dataset\n(NED). The NED is a collection of elevation data which covers the entire United\nStates. It has been processed to correct discrepancies, fill holes, match the edges\nof source datasets, and fill slivers of missing data. More information on the NED\ncan be found at http://ned.usgs.gov//About.asp.\nii. The NED is now available through \"The National Map Seamless Data\nDistribution System\" from the USGS. The website for this seamless national\nmap is: http://seamless.usgs.gov. The National Map website makes available a\nnumber of datasets, as listed below. The seamless data distribution system\nallows users to select an area of the country or the world, and to download\nseamless data for that entire area as one dataset. The system allows for data\ndelivery via free web downloads (with size restrictions), or via CD-ROM media.\niii. The National Map Seamless Data Distribution System data sets:\n1. Toogtaphy, Structures, Transportation, Boundaries, Hydrography,\nOrthoimagery, Land Cover, etc. (NED, NLCD, SRTM, etc)\niv. Some areas of the United States have elevation data available in rasters that have\ncells that are 10 meters by 10 meters (NED 1/3) while the rest of the country is\navailable at 30 meters by 30 meters (NED 1/3). The rest of the world is available\nat 90 meters by 90 meters (SRTM 1 arc second). In all cases a single elevation\nrepresents the entire cell.\nv. You will also download a streets database for the same area - the Bureau of\nTransportation Statistics (BTS) roads network.\nPrepared by Ben Crosby\n\nField Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\nc. Downloading the datasets\ni. Go to The National Map website (http://seamless.usgs.gov), and click on the\nlink to: \"View and Order Data Sets - United States Viewer\".\nii. An ArcIMS internet mapping site will open up (see image below), with a view\nof the United States, and the available NED shown. You can use the tools on the\nleft to move around the map, zoom in and out, and select features like within\nArcMap. On the right are two lists of data layers. The top one is download\nlayers. The layers selected in this list will be downloaded when you select an\narea with one of the download tools. The bottom list is the visible layers list, and\nlayers selected from this list will be visible in the viewer. In order to view\nchanges in your selections, you must click the \"Refresh Map\" button at the\nbottom of the list (scroll down).\niii. Use the tools to zoom-in and find an area that you are interested in, such as your\nhome, where you like to vacation, or some place you have always wanted to\nvisit. Try to choose an area that has some elevation differences... a flat\nfloodplain won't be a very interesting elevation dataset. Also, if you can, pick an\narea with features that you will be able to recognize, so that you can see the\neffects of projection more clearly. The area should be somewhere around a scale\nof 1:60,000 (shown in the upper right corner of the window), since we don't\nwant too big a dataset for this exercise.\niv. Once you have found an area you like, make sure that ONLY (Elevation/NED\n1/3\") and (Transportation/BTS Roads) are selected in the Download Layers list.\nv. Use the \"Select By Rectangle\" Download tool\nto select the area for which\nyou want to download data.\nvi. When you release the button, a new window will appear, and after a moment of\nprocessing, you will get a SDDS Request Summary Page containing links to\ndownload your selected data layers. By default, your elevation data should be in\nArcGrid format and the roads will be a shapefile (a vector format native to\nArcGIS). If you wanted to change the format of your data, the format of the\nmetadata, the datasets selected, or other options, you can use the Modify Data\nRequest Button. If you have do this, Be sure to go to the bottom of the modify\npage to \"Save Changes\".\nvii. Click on the \"Download\" link next to the NED and roads datasets. When the\ndata is extracted, select \"Save\" and save the Zip file it to a new directory that in\nthe folders that you have access to.\n\nField Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\nviii. Use Winzip to extract the files from the .zip file that you downloaded. Save to\nthe folder you already created. The naming of the files is tricky (purely numeric),\nso keep track of which is the roads and which is the elevation data.\n4. Examining the Data\na. Open ArcCatalog and navigate to your newly downloaded NED dataset. You will see a\ngrid (the actual data) and a shapefile called METADATA. This file contains polygons\ndepicting the original DEMs from which your dataset was assembled.\nb. Select the grid dataset and click the Metadata tab to view the metadata for the NED grid.\nFind the section on projections and coordinate systems. What projection is it in?\nc. Close ArcCatalog and open ArcMap with a new, empty map.\nd. Before loading any data, view the Data Frame Properties (under the View menu). Go to\nthe Coordinate System tab. Under Current coordinate system, It should say \"No\nProjection\", indicating that no projection is defined for the data view. Close the Data\nFrame Properties Dialog.\nCourtesy of ESRI. Used with permission.\ne. Now, open the Add Data dialog and add in the NED dataset you downloaded.\nf.\nThe dataset should appear on the Layers list.\ng. Go to the new dataset's Layer Properties dialog (Right-click it's name and select\nProperties from the context menu).\nh. Go to the Source tab and scroll down the top box titled \"Data Source\" to see the\nCoordinate System information.\ni.\nThe Coordinate system should show up as \"GCS_North_American_1983\", as shown\nbelow:\nCourtesy of ESRI. Used with permission.\nj.\nSince there is no further projection information, this indicates that the data is in the\nsimplest type of Latitude/Longitude projection, the \"Geographic Coordinate System\"\n\nField Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\n(GCS). The Datum used is the North American, 1983 datum (NAD83), which is pretty\nstandard today, although some datasets are still in the older 1927 datum (NAD27).\nk. Close the Layer Properties Dialog and go to the Data Frame Properties dialog again.\nLook at the Coordinate System information again, and note that the Data Frame view has\nbeen set to GCS_North_American_1983, to match the data. Close the Data Frame\nProperties dialog.\nl.\nDon't forget to Save your work.\n5. Project the Data\na. Open the ArcToolbox from within ArcMap by\nclicking the red toolbox icon.\nb. Since you have found that the dataset you\ndownloaded already has a projection defined (GCS -\nNAD83), you do not need to define a projection, but\ncan simply project it into another projection .\nc. Side Note: If you ever come across a dataset that\nhas no projection defined, it is likely that it may be\nin a GCS projection. Try defining it as GCS, and lay\nit over some data of a known projection in the same\ngeographic region and see how it lines up. Datasets\nwith no projection defined might also be in a State\nPlane projection, especially if they are state level or\nsmaller data, so try that next.\nd. In ArcToolbox, go to Data Management Tools >>\nProjections >> Raster and look at the available tools.\nThere should be two sets of projection tools, one for\nfeatures (vector data (Features) - points, lines, and\npolygons) and one for raster data, like DEMs.\ne. Since we want to re-project a grid with a projection\nalready defined, select \"Project Raster \" and double-\nclick on it to open the wizard.\nf.\nIn the next window, use the browse button under\nInput Raster to find and select your NED dataset.\nCourtesy of ESRI. Used with permission.\ng. Be sure to name your output raster something distinctive and unique\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\nh. Click the button next to the 'output coordinate system' and designate whether you want\nto select a predefined coordinate system or import one from another dataset. (See figure:\nSpatial Reference Properties)\nCourtesy of ESRI. Used with permission.\ni.\nFor the 'Select' option:\ni. This gives you the opportunity to browse through Geographic (latitude and\nlongitude) and projected (State Plane, UTM) coordinate systems.\nii. Select the UTM coordinate system. Click Next to continue and navigate to\nProjected Coordinate Systems, UTM, and NAD 1983 and then choose the zone\nthat you retrieved data for, using the map of zones located at\nhttp://rockyweb.cr.usgs.gov/outreach/gps/UTM_Zones_USA48.jpg.\nCourtesy of ESRI. Used with permission.\nj.\nFor the 'Import' option\ni. use the file browser to locate a file that you know is the same coordinate system\nthat you want to project your data to. When you select the particular dataset,\nyou will see the projection information displayed in the 'Spatial Reference\nProperties' window\nk. I recommend cubic resampling as the other types can create artifacts in your elevation or\nslope data. Leave the output cell size as it is.\nl.\nWhen all is ready, click OK to run the wizard.\n\nField Geology I\nHometown GIS, Part 1\nOctober 03, 2005\nLab Exercise 2.1\nm. Wait for the \"Processing...\" window to close. Your data has been projected and a new\ndataset created. It is automatically added to your map and it won't be evident that it has\nbeen, unless you look at the Table of Contents. That is because the new layer, the\nprojected DEM, has projection information stored within it and the program projected the\ndata to the projection of your original data (Geographic).\nn. Now, follow the same procedure but for the BTS Roads data. Because the Roads data is a\nshapefile (vector data), you will need to use a different part of the Projections and\nTransformations toolbox. This time go to Proj. and Trans. --> Feature --> Project.\nBecause you now have a data set in the appropriate projection, you can use the 'Import'\nfunction in the 'Spatial Reference Properties' window. Select the new projected DEM and\nyou are ready to fill in the rest of the projection data as you did for the DEM.\n6. Changing the projection of a map document and displaying your data\na.\nThe projection is changed by changing the data frame properties. The data frame is the\nmap area of ArcMap. To change this, click on the View menu and then click on Data\nb. You can change your projection to any\nof the available projections, or to the\nprojection of any of the layers in your\nmap. In this case, I navigated to the\nlayers list, clicked on my new\nprojected layer, and then chose its\nprojection. Click ok. You should see\nthe map change somewhat. If you can't\nsee your data, right click on the name\nof the new, projected grid and then\nclick on Zoom to Layer.\nc.\nAdd the UTM-projected roads layer\nshapefile. This will appear on the map\nin the correct location. The old, GCS-\nprojected file would also display in the\ncorrect location because Arc GIS is\nmaking the transformation for your\ndisplay. BUT, when we create data in a GIS, it is always important to make sure that all\ndatasets are in the same projection. This is important when we share data with other\npeople or move data to other applications (like ArcPad) that does not do projections on\nthe fly like ArcMap.\nCourtesy of ESRI.\nUsed with permission.\nFrame Properties. You should see a form like this one:\nd. Remove all of your old GCS data from the legend as you no longer need it because it is\nnow available in the correct UTM projection.\ne.\nTry labeling the roads layer. Right click on its name then click on Label Features. The\nroads will be labeled with the street names. If you can't see all of the street names, zoom\nin so that there is more space to draw the labels.\nCongratulations! You are done with Part 1.\nYou are now ready for PART 2 of the lab, 'Creating your own data.'\ninitially created by Christiaan Adams.\nupdated 9/26/05 - Daniel Sheehan.\nminor revisions and transformation from .html to .doc and .pdf 10/11/05 - ben crosby.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nIntroduction\nCongratulations! You have now made a simple GIS project containing a few layers that you downloaded\nof the internet. In this portion of the exercise, you will make some changes to beautify your map and then\ncreate point, line and polygon shapefiles. Point shapefiles could denote such data as: locations of friend's\nhouses or locations of favorite stores. Line shapefiles could denote routes such as the route you took to\nschool, the route you took to the store, etc. Another line shapefile could denote creeks you played in or\nrailroad tracks or gang turf-boundaries. The polygon shapefiles could show areas such as your extended\nneighborhood or commercial districts or discrete housing developments. Be creative, but keep in mind that\neach shapefile should be of a coherent theme so that they contain comparable data.\nWhen you are picking topics to generate a shapefile for, make them broad so that they will contain multiple\nfeatures that you can categorize multiple ways. For example, one of the point shapefiles could be called\n'friend's houses.' In this shapefile, each of the points that you create on the map can have multiple\nattributes: address, first name, last name, house color, age during friendship, pet type, etc. The idea is to\nhave multiple attributes that can be used to decide symbology.\nThis is an exercise, and I have no interest in stealing your identity or your childhood friend's pets. You are\nwelcome to make the data up (this will be the only time that this is allowed!), but think about the map you\nare making and ask whether or not it makes sense. This exercise is intended to build your skills in creating\nand editing shapefiles...don't let the soft draw of nostalgia slow you down or compromise your capacity to\ncreate rich and well attributed data.\nMaterials\nGIS-ready computer\nInternet connection\nMemories of home\nA completed GIS project with roads and topography from your hometown.\nWe should be starting with something that looks like this...\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nImproving the readability of our map.\nNow that your DEM data are in a projection that is in meters (UTM) rather than degrees (GCS), you can\nrun calculations on the elevation data to make other raster data files that help you visualize the topography.\nLet's start by making a slope map. Follow the instructions given in the file \"make_slope.pdf\" linked in the\nTools section of this course.\nNow that you have made a new vector file it will display above the elevation data in the legend bar on the\nleft side of the screen. You will want the elevation data to be on top so drag the elevation layer up and drop\nit above the slopemap layer. Now click properties for the elevation data and select the \"display\" tab.\nChange the 'transparent' field from 0% to 30%. This will make the DEM see-through. Now click the\n'Symbology' tab and change the color ramp to something cool and colorful. I like the color ramp between\nbrown and teal blue personally, and I invert it so that the brown is at the high elevations...this choice is up\nto you. Click 'OK' and you should now see your colored DEM with shading from the slopemap beneath.\nSave your work. Now we have a good looking map!\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nCreating your own shapefiles\nUsing ArcCatalog (accessible from the icon that looks like a yellow filing cabinet on the toolbar), we will\nnow create 2 point shapefiles, 2 line shapefiles and 2 polygon shapefiles. Once ArcCatalog is open, find\nyour way to the directory where you have stored your roads data (it will be something like...\nlangtang/D2/12.114_class/students/your_name). When you create them, name the shapefiles as\ndescriptively as possible. Also when we create the shapefile we are going to use the Import button to\ndefine the projection to be the same as the DEM or the BTS roads that we projected to UTYM.\nGo to \"make_shapefile.pdf\" in the Tools section to see the tutorial describing how to create new shapefiles:\nOnce you have created all six of your new shapefiles, load them into ArcMap.\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nAdding attributes to your shapefiles\nOnce you have created all six of your blank shapefiles, you are ready to open ArcMap and begin adding\ndata to your shapefiles. Like you did in the first part of this lab, you will use the 'add data' button, (the\nyellow plus symbol). As the shapefiles have no data yet, you will see no new points, lines or polygons, but\nyour will see the layers in the legend. Notice that the load in so that points are on top, then lines, then\npolygons. This helps with layer visibility so one layer does not obscure the other.\nNow that you have added the files to the map, we should prepare each file to have multiple attributes. For\nexample, in my bike_crashes point shapefile, I would like to include information regarding the year, the\nbike-type, the personal-injury, the bike-damage, the cause, etc... This information can be attached to each\nof the points that I create. This information is considered the 'attributes' of the point. Lines and polygons\ncan have attributes as well and the method for creating them is the same as for points.\n-\nlayer you want to add attributes to, then select 'open\nattribute table.'\n-\nThe headers that you see are the names of the columns of\ndata that you will create. Values for the columns FID,\nShape, and ID will be filled in automatically by ArcMAP.\n-\nTo create your own columns that you will later fill in with\nyour values, click on the 'Options' button in the lower\nright corner of the Attributes window and select 'Add\nField...'\no\nIn the window that opens give a short name to\nyour attribute (no spaces or dashes) and specify\nwhich \"type\" of data it is:\no\nThe types are as follows:\n\nshort integer\nan integer between -32,000 and +32,000\n\nlong integer\nan integer between -2 billion and +2 billion\n\nfloat\nbetween -3.4E-38 to -1.2E38 for negative numbers and\nCourtesy of ESRI.\nUsed with permission.\nTo create attributes in a shapefile, right click the title of the\n3.4E-38 to 1.2E38 for positive numbers\nwith seven significant digits\n\ndouble\nbetween -3.4E-38 to -1.2E38 for negative numbers and\n3.4E-38 to 1.2E38 for positive numbers\nwith fifteen significant digits\n\ntext\ntype what you want, must specify the field length (# of chars.)\n\ndate\nmm/dd/yyyy hh:mm:ss and a specification of AM or PM\n\nblob\nbinary large object (we will not use this, embedded data)\n\nguid\nGlobal identifier field\n-\nIf you create a field and want to modify it...sorry, you can't. Delete it by right clicking on the\ncolumn name and selecting 'delete field'\n-\nAdd three or so new fields to each of your six shapefiles. be certain to name them correctly\nand specify the correct 'field type'\nin the end, you should have something that looks like this\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nAdding data to your attributed shapefiles\nOnce you have created all six of your attributed (but still blank) shapefiles, you are ready to use the Editor\ntoolbar to create the actual points, lines and polygons.\nAgain, we will use the online tutorial to get us started. This one is about starting an editing session. It is\nin \"editingvectors.pdf\" in the Tools section.\nNow that we have an editing session started and have selected the correct shapefile as the target, we can\nbegin adding data. The one last thing to do is to right click on the shapefile in the legend and select 'open\nattribute table.' This is the easiest way to watch the points or lines you create get added into the shapefile\nand to add specific data to the attributes of that point or line.\nThe tutorial to help with drawing lines (the same process applies to points and polygons as well)\nis available in \"draw_line.pdf\" in the Tools section.\nAs you complete each individual line, add the attribute data. It is easier to do this as-you-go rather than\nattributing at the end when you are not sure which line or point corresponds to which row in your sheet.\nMAKE SURE YOU SAVE YOUR WORK FREQUENTLY, as ArcMap can crash during editing and if\nyou have not saved your data, you WILL loose it.\nOnce you have finished adding 4-5 objects (points, lines, polygons) to the shapefile you are editing, save\nyour edits (using the editor toolbar pull-down menu), and specify a new target and begin adding data and\nattribute data to the next shapefile. Remember to save as you go. By the time you have done this for all 6\nshapefiles, you will be a wiz!\nCourtesy of ESRI. Used with permission.\n\nField Geology I\nHometown GIS: Mapping the familiar\nOctober 3, 2005\nLab Exercise 2.2\nDisplaying your data using your attributes to dictate symbology\nNow that you have created all this attributed data, you can use those attributes to make a smart looking map\nwhere the symbols/colors/etc for each item can be reflective of the attributes of that particular point, line or\npolygon.\nAs we did with changing the way the DEM's data was displayed, we will change the way each of our\nshapefiles are displayed by right clicking on the name in the legend and selecting 'properties'. Go to the\nsymbology tab and select 'categories' on the left hand side of the properties window. Then select the\nattribute that you wish to use to display the data in the 'Value Field' pull down menu. Then click add all\nvalues to gather the different values you used. (for example, I have selected bike_type for my bike_crashes\npoint shapefile). Tweak the settings so that each of your layers displays the way you want it to. For\nexample, feel free to change the transparency of your polygons so you can see the topography below them.\nAs well, if you want to change the properties of all your symbols in a particular shapefile, right click in the\nwindow where all the different attribute values are displayed and select something like 'change properties\nfor ALL values.' Play around with the display options and find how to best show your data. This is one of\nthe great advantages of working with GIS. If you have questions about this step, please let me know, I'm\nright down the hall or reachable via email.\nWhen you have finished, send me an email and I will be able to look over the map you made as you have\nsaved the ArcMap document (and all the related files) onto Langtang in the folders I prepared.\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "arcinstall.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/0b85b5651e4769292e93775f20146ebc_arcinstall.pdf",
      "content": "INSTALLING ARCPAD\nYou need an iPaq, a cradle and a computer with ArcPad and Activesync loaded.\n1) Establish a connection between the iPaq and the computer. You don't want to set up a partnership.\n2) On the computer, in the start menu go to the ArcPad folder, and select Install ArcPad 6.0.3 Application for Windows CE\nMicrosoft product screen shot(s) reprinted with permission from Microsoft Corporation.\n(according to the use rules at http://www.microsoft.com/mscorp/permission/default.mspx#ELC).\n\nClick Yes to install the application in the default directory. When the installation is complete, a window will prompt you to\nmake sure the application works on the iPaq. Click OK.\nOnce that is done, do the same for the ArcPad 6.0.3 Font for Windows CE, and the VBScript Runtime Library for Windows\nCE.\n3) When everything is installed, run ArcPad on the iPaq by clicking the Start menu, going to Programs, and double-clicking\nArcPad 6.0.3. The Start menu is in the upper-left corner.\nAn ArcPad Registration Window pops up. The Name and Institution are unimportant, but the Registration number is\n854966002718.\nMicrosoft product screen shot(s) reprinted with permission from Microsoft Corporation.\n(according to the use rules at http://www.microsoft.com/mscorp/permission/default.mspx#ELC).\n\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "change_prj.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/d94c791d7ad77c456c2319fffa18798b_change_prj.pdf",
      "content": "CHANGING PROJECTIONS -or- REPROJECTING DATA SETS\nlaptops.\nIn ArcCatalog, click the red toolbox button at the top of the screen to open the ArcToolbox window.\nmultiple datasets. These tools can be found under Data Management Tools > Projections and Transformations > Feature.\nLet's start with shapefiles, because they are a bit easier. I'm assuming that you're using ArcGIS 9, since that is what's loaded on the fieldcamp\nIn the ArcToolbox window, select the Project tool in order to reproject one shapefile, or the Batch Project script, if you want to reproject\nCourtesy of ESRI. Used with permission.\n\nIf you're using the Project Tool, this window opens\nCourtesy of ESRI. Used with permission.\n\nyou want the output to be in. When all that is entered, press OK and it will create the new, reprojected dataset.\nIf you're using the Batch Project script, the window looks like this:\nSpecify the Input Dataset that you want to reproject, the name of the new dataset once it has been reprojected, and the coordinate system that\nCourtesy of ESRI. Used with permission.\n\nyou'd like the outputs to be in. Press OK and you're done.\nin Arc 9, it's just as easy as reprojecting shapefiles.\nHere you specify the Input Datasets, the folder in which you'd like it to place the reprojected outputs, and of course, the coordinate system\nReprojecting Rasters was next to impossible in ArcGIS 8, so if that's what you're using, you'll need to ask the TA for more help. Fortunately,\nIn the ArcToolbox window, go to Data Management Tools > Projections and Transformations > Raster and select the Project Raster Tool.\nCourtesy of ESRI. Used with permission.\n\nNearest Neighbor for remote sensing data. Anyways, once you've specified everything, click OK and the tool does its work.\nIn the Project Raster Window, specify the Input Raster, the name for the Output Raster, and the coordinate system you're projecting into.\nAlso specify the Resampling Method. What they say is, use Nearest Neighbor for discrete datasets, and Cubic Convolution for continuous\ndatasets. The bottom line is, I like to use Cubic for DEMs, because Nearest Neighbor gives some weird banding effects, but I usually use\nCourtesy of ESRI. Used with permission.\n\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "crosby_field_gs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/496a156c069e399e595336c09c2bb130_crosby_field_gs.pdf",
      "content": "Wednesday, September 21, 2005 (6).max\n\nWednesday, September 21, 2005 (6).max\n\nWednesday, September 21, 2005 (6).max\n\nWednesday, September 21, 2005 (6).max\n\nWednesday, September 21, 2005 (6).max\n\nMonday, September 26, 2005.max"
    },
    {
      "category": "Resource",
      "title": "datasources.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/49f778710aa63771eca941c85955dd0a_datasources.pdf",
      "content": "A List of Data Sources\nCalifornia Spatial Information Library\nContains Dems, Landsat images, Orthophotos, USGS Quads, etc. for the State of California\nARIA - Arizona DRGs\nUSGS Topographic Maps for Arizona\nUtah Division of Water Rights - Quadrangle Finder\nDems, orthophotos and USGS topographic maps for the State of Utah\nMcDig Links\nFrom the MIT Center for Digital Geology Webpage"
    },
    {
      "category": "Resource",
      "title": "draw_line.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/a13c1d0cc8fda8df1b4c2ca9e9510817_draw_line.pdf",
      "content": "DRAWING A NEW LINE\nVector Data'.\n2) Set the Task pulldown to Create a New Feature, and make sure the layer in the Target pulldown is the layer you wish to edit.\n3) Click the little pencil on the Editing Toolbar. Use this tool to start your new line and add vertices to it.\nline is complete.\n1) First, open an editing session in the workspace containing the data you wish to edit. Instructions on doing so are given in 'Editing\n4) On the map, click on the points you'd like to add a vertex. The line will follow your vertices. Continue adding vertices until your\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n\n5) When you are ready to finish your line, right-click on the map, and select Finish Sketch.\n6) Should you need to continue adding points to that line, click the arrow tool on the Editing Toolbar\n7) Double-click on the line you wish to extend or modify. You should see the vertices of the line.\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n\n8) You can use the Arrow tool to move vetices you've already placed, or click the pencil tool again in order to place new vertices.\nCourtesy of ESRI. Used with permission.\n\nCourtesy of ESRI. Used with permission.\n9) If interested, you can find more information on modifying lines in 'Modifying Lines'."
    },
    {
      "category": "Resource",
      "title": "editingvectors.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/9ede5bcb92a25377a6e550b0594f6be2_editingvectors.pdf",
      "content": "EDITING VECTOR DATA\ncoverage.\nentry.\n2) Using the Editor pulldown, select Start Editing, which will open the Start Editing window.\nIn order to alter the data in a shapefile or coverage, you need to open an editing session. While within the editing session, you can add data,\nchange the topology of the data, remove data, make up data, etc. When you are finished altering the data, and periodically as you go, make\nsure to save the edits. Leaving an edit session without saving results in your losing whatever changes you've made to the shapefile or\n1) Make the Edit toolbar available. If it is not visible, right-click on the taskbar in the ArcMap window, and put a check next to the Editor\nCourtesy of ESRI. Used with permission.\n\ncontaining the shapefile or coverage you wish to edit and click OK to begin editing.\n3) The Start Editing window contains a list of Workspaces. Workspaces are essentially the folders where the data you have added to your\nmap are stored. You can only edit data within one workspace at a time. When you click on a workspace on the list, the field below lists the\nshapefiles available in your map's Table of Contents which will be editable should you decide to edit that workspace. Choose the workspace\nCourtesy of ESRI. Used with permission.\n\nfeatures, reshape features, etc.)\n4) You are now free to begin editing. If there are multiple data sources in the workspace you are editing, make sure to select the proper layer\nfrom the Target pulldown before you begin. Also, the Task pulldown selects the action you wish to take (create new features, extend/trim\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "linesymbols.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/32bd648ebee5b14f0478ce82063e3869_linesymbols.pdf",
      "content": "LINE SYMBOLOGY\nWhen making geologic maps, you'll deal with lines that represent depositional contacts, intrusive\ncontacts, faults and folds, to name a few. You'll need to generate symbols and decorations for each type\nof line in order to tell the difference between them. This should give you the basic knowledge you need\nin order to do that.\nEach of the lines represents a different sort of feature. I've defined what I want each line to be in the\nshapefile's attribute table.\nInstructions for altering attribute tables are here.\nNow, in order to make each line type look different, I need to open the Properties window for the\nshapefile by right-clicking the shapefile in the Table of Contents and selecting Properties.\nIn the properties dialog, go to the Symbology tab, and click the Categories > Unique Values symbology\ntype on the left-hand side.\nSelect the field from the shapefile's attribute table you'd like to use to define the symbol colors. In this\ncase, we're interested in Type. Once this is selected, click Add All Values.\nNow, usually, simple depostional contacts are displayed as simple black lines. To do this, I double-click\non the symbol next to \"Contact\" and use the subsequent dialog to define the line symbol. Note that there\nare always more symbols to be found in the Geology 24k group (accessed from the \"More Symbols\"\npulldown).\n\nFaults get a bit more interesting. Let's look at the Reverse Fault. Often, such faults are displayed as red\nlines, with triangular teeth decorations, with the triangle pointing to the hanging wall of the fault. Let's\nsymbolize our Reverse Fault like that. You may be able to find a symbol you're happy with by browsing\nall your options in the Symbol Selector window, but sometimes you won't be able to find what you're\nlooking for, and must create the symbol yourself.\nFirst, double-click on the symbol next to \"Reverse Fault\" in the Properties Window for the shapefile of\ninterest. This opens the Symbol Selector Window. Here I select a red line, which will be the base for the\nsymbol I want to create.\nNext, I click Properties... button, which opens the Symbol Property Editor window. In order to put\ndecorations on my line, I need to add a layer tot he symbol. Click the \"+\" button under the layer list in\nthe lower left-hand side.\nChange the Type of line for that new layer to Hash Line Symbol using the pulldown menu at the top of\nthe window.\nAdjust the spacing of the line symbols by clicking the Template tab and adjusting the Interval in the\nlower right.\nNow click the Marker Line tab and click Symbol to select the symbol you want to use to decorate your\nline. You will use the Symbol Selector window that you've seen previously, only this time, you'll be\nselecting from point symbols rather than line symbols.\nBrowse through and find the symbol you'd like. In this case, I want a little triangle, so I pick that, and\nmake it the same color as the line I'm using.\n\nNext, I adjust the offset of the marker symbol in the Line Properties tab of the Symbol Property Editor\nwindow.\nWe've now created the symbol that we want to use for this line. Click as many OK buttons as you need\nto until the window are gone, and you're looking at your map once again. The last thing to do is to make\nsure that the teeth are on the hanging wall side. If this is not the case, you need to flip the line's direction.\nTo do this, first start editing the line shapefile. Now, using the triandular pointer button on the Editor\ntoolbar, double-click your line. The vertices appear when you've click it enough times.\nRight-click on the line, and select Flip. De-select the line and the symbols should change sides. Stop\nediting and be sure to save your edits.\nThis tutorial has at least given you a basic understanding of how to create your own line symbols. Play\naround with it, because you'll find that there are always an infinite number of different line types you\nwant to give different symbols to, and there are often no pre-made symbols that fit your needs perfectly."
    },
    {
      "category": "Resource",
      "title": "make_shapefile.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/2e115760d078e239b2e03a39969927fa_make_shapefile.pdf",
      "content": "MAKING A SHAPEFILE IN ARC CATALOG\nand then click on Shapefile\nor polygon - other options are unimportant right now).\n1) In the ArcCatalog explorer window, browse to the folder in which you'd like to create a shapefile. Right click on that folder, select New\n2) The Create New Shapefile Window appears. Give the shapefile a name and select the type of shapefile you'd like to create (point, polyline\nCourtesy of ESRI. Used with permission.\n\nclick here. To select a coordinate system, click the Edit button, which brings up the Spatial Reference Properties Window.\n3) Select the coordinate system you'd like the shapefile to be projected in. For further information on projections and coordinate systems,\nCourtesy of ESRI. Used with permission.\n\n4) Click the select button, and browse to the coordinate system you wish to use.\nCourtesy of ESRI. Used with permission.\n\ndataset that you'd like your new shapefile to match.\nAlternately, you can match your shapefiles coordinate system to that of another dataset. To do this, click the Import button, and select the\nCourtesy of ESRI. Used with permission.\n\nchose will appear in the Create New Shapefile window. You're all set. Click OK to create the shapefile.\n5) After selecting a coordinate system, click OK to close the Spatial Reference Properties window. The coordinate system information you\nCourtesy of ESRI. Used with permission.\n\nthe Add Data button in ArcMap.\n6) You can add your new shapefile to a map either by dragging the file from ArcCatalog onto the Table of Contents in ArcMap, or by using\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "make_slope.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/a54f6e4616d9678af5c24d15067872ef_make_slope.pdf",
      "content": "HOW TO MAKE A SLOPEMAP FROM A DEM\n1) In ArcMap, display the DEM you are interested in analyzing.\nThe Spatial Analyst toolbar will appear.\n2) Make the Spatial Analyst tools available. Right-click on the taskbar at the top of the window and make sure Spatial Analyst is checked.\nCourtesy of ESRI. Used with permission.\n\n3) From the Layer pulldown in the Spatial Analyst toolbar, select the DEM you want to analyze\nCourtesy of ESRI. Used with permission.\n\nis checked.\nNote! If all the options in the Spatial Analyst toolbar are greyed out, and there are no available layers, it is likely that the Spatial Analyst\nextension is turned off. To turn it on, in the ArcMap window click Tools and select extensions. Make sure that the box next to Spatial Analyst\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n\n4) From the Spatial Analyst pulldown, select Surface Analysis, and Slope.\nCourtesy of ESRI. Used with permission.\n\n5) A window appears. Specify the output path and press OK.\njust created, and select Properties.\n6) Let's give the slopemap a beautiful color scheme! In the Tabloe of Contents, right-click on the layer corresponding to the slope map you\nCourtesy of ESRI. Used with permission.\nCourtesy of ESRI. Used with permission.\n\n7) Click the symbology tab.\nCourtesy of ESRI. Used with permission.\n\nfinished, click OK.\n8) Select Stretched from the menu on the left, then select the black-to-white colormap (it should be the default). We want black to be the\nsteepest slopes so click the Invert box in the lower right corner of the window to flip the colors so that black is at the top. When you're\nCourtesy of ESRI. Used with permission.\n\nCourtesy of ESRI. Used with permission."
    },
    {
      "category": "Resource",
      "title": "mapsmith.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-114-field-geology-i-fall-2005/8ef0db0ed656c7638131f6a5a159494d_mapsmith.pdf",
      "content": "INSTALLING MAPSMITH\n1) Connect the iPaq to the computer which has the MapSmith files on it. You should have a MapSmith\nfolder which contains a Blank Shapefiles folder, a Data folder, and a number of files. Use ArcGIS to put\nthe blank shapefiles into the projection you want, and put them in the Data Folder. You also must have a\nprojection file (.prj) in the Data folder representing whatever projection all your data sets are in.\nBasemaps (raster datasets) must be .sid files, and must be in the same proejction as the shapefiles. Put\nany basemaps you want to use into the Maps folder.\n2) On your computer, open ArcPad. Add the shapefiles you projected, as well as the basemaps you want\nto the map. You can use the folder icon in the upper right to browse for the data files. It's important that\nyou save the map file as \"fieldcamp.apm\" and put this file in the MapSmith folder.\nCourtesy of ESRI. Used with permission.\n\n2) In ActiveSync, press Explore to open the iPaq as a window. Then simply copy the MapSmith folder\nfrom your computer onto the iPaq Storage Card.\n3) Open ArcPad on the iPaq. Click the pulldown menu next to the icon that looks like a wrench and a\nhammer. Select Options.\nMicrosoft product screen shot(s) reprinted with permission from Microsoft Corporation.\n(according to the use rules at http://www.microsoft.com/mscorp/permission/default.mspx#ELC).\n\nUse the arrow to scroll over and select the Paths tab. Change the System Files path and the Applets File\nPath to \\Storage Card\\MapSmith. Click OK to save your changes.\nCourtesy of ESRI. Used with permission.\n\n4) Close ArcPad by clicking the pulldown next to the folder icon at the top left. Select Exit.\nCourtesy of ESRI. Used with permission.\n\nNow re-open ArcPad and verify that the MapSmith Toolbar has appeared.\nCourtesy of ESRI. Used with permission.\n\nCourtesy of ESRI. Used with permission."
    }
  ]
}