{
  "course_name": "Field Seminar in Comparative Politics",
  "course_description": "This course provides an introduction to the field of comparative politics. Readings include both classic and recent materials. Discussions include research design and research methods, in addition to topics such as political culture, social cleavages, the state, and democratic institutions. The emphasis on each issue depends in part on the interests of the students.",
  "topics": [
    "Social Science",
    "Political Science",
    "Comparative Politics",
    "Social Science",
    "Political Science",
    "Comparative Politics"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 2 hours / session\n\nPrerequisites\n\nPermission of the instructor.\n\nCourse Overview\n\nThis course is a graduate-level seminar in comparative politics. It aims to provide you with the conceptual and analytical tools necessary to conduct research in that subfield and to acquaint you with key works in the field.\n\nThe readings focus on foundational material, including both \"classics\" and recent work (though in general only where enough time has elapsed following the publication of a piece to assess its \"staying power\"). Given the volume of material in the field, treatment of some topics is inevitably cursory and incomplete. A number of topics are left out entirely: ethnic politics, civil-military relations, political communication, coalition formation in legislatures, interest group representation, autocratic regimes, and the politics of economic reform (to name just a few). For each week, a list of recommended readings provides a short bibliography for those of you who wish to do further reading on your own in preparation for comprehensive examinations or who are considering research on the topic.\n\nCourse Requirements\n\nWeekly required readings of (on average) 175 pages per week. You are expected to do all of the required readings for the week--and\nnone\nof the recommended readings in advance of class. It shouldn't take you more than 10 hours to read the required material, abstract it, and prepare for class discussion.\n\nClass attendance and participation. Some classes will begin with a brief lecture designed to summarize works not covered in the syllabus. We will then attempt to go through the discussion questions listed (though not necessarily in the order listed). Because this is a seminar, class participation is important, and attendance is a requisite for participation. Things come up, of course, so everyone gets one bye over the semester. Beyond that, you need to be at every class, on time, and prepared to jump into the discussion.\n\nI would also like each person to take a role in leading the discussion for one session over the course of the semester.\n\nSix \"response papers\" over the course of the semester. For more detail, please see the\nAssignments\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Paper Writing Hints",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/118cc93b2c544f57108e6319418e2d46_MIT17_588F13_PaperWritHin.pdf",
      "content": "17.588f13\nStylistic and Substantive Hints for Writing Papers\nStylistic hints\n\n1. Avoid contractions in formal writing. In informal writing, they're OK.\n\n2. Avoid the passive voice (e.g., \"it was done to him\") where possible.\n\n3. In formal writing, never use the second person as a substitute for impersonal\nor general references. Thus you should not write: \"living in a democracy\nmakes you less likely to be arrested for political reasons\". You might write\ninstead: \"Citizens in democratic societies are less likely to be arrested for\npolitical reasons.\"\n\n4.\nConsider avoiding the first person singular. If using that format, however, stick with\nit throughout. Do not switch back and forth between impersonal presentation of\nyour argument and the first person singular. Thus, you could write: \"In the first\nsection of this paper, I discuss the reasons for the collapse of Chilean democracy in\n1973. In the second section, I discuss how General Augusto Pinochet was able to\nconsolidate a personalistic dictatorship.\" You could also write: \"The first section of\nthis paper discusses the reasons for the collapse of Chilean democracy in 1973. The\nsecond section describes how General Augusto Pinochet was able to consolidate a\npersonalistic dictatorship.\" But you would not write: \"In the first section of this\npaper, I discuss the reasons for the collapse of Chilean democracy in 1973. The\nsecond section describes how General Augusto Pinochet was able to consolidate a\npersonalistic dictatorship.\"\n\nThe same point holds for the first person plural (\"we\").\n\n5.\n\"It's\" is a contraction of \"it is\". \"Its\" is the possessive of \"it\". As you will not be using\ncontractions in formal writing, you won't be using \"it's\" ever.\n\n6.\nDo not use impersonal pronouns (e.g., it) when the referent is unclear or nowhere in\nsight. The \"it\" should refer clearly to a specific noun used in the preceding clause,\nnot to a general concept contained in the previous clause, nor to a specific noun two\nor more clauses away.\n\nSimilarly, avoid using \"this\" and \"that\" as subjects or direct objects. Thus, you would\nnot write: \"Dahl and other scholars have advanced the argument that\ndemocratization depends little on international influence. But this ignores\nimportant exceptions, such as Greece, Argentina, Taiwan, and the Eastern Europe.\"\nInstead, write: \"Dahl and other scholars have advanced the argument that\ndemocratization depends little on international influence. But this argument ignores\nimportant exceptions, such as Greece, Argentina, Taiwan, and the Eastern Europe.\"\n\n7.\nDo not use \"and/or\", as in \"they fought for God and/or country\". Instead, you might\ntry \"they fought for God, country, or both\".\n\n8.\nBe careful not to use \"which\" when you mean to use \"that\". Use \"which\" when the\nphrase or clause set off is parenthetical to noun it qualifies. Thus, you would write:\n\"U.S. pressure pushed the Salvadoran government toward democracy, which it\nprobably would have favored in any case.\" By contrast, use \"that\" when the phrase\nor clause it introduces is integral to the noun described. Thus you would write: \"U.S.\npressure pushed the Salvadoran government toward the kind of democracy that\nSalvadoran civilian leaders already favored.\"\n\n9.\nAvoid using \"while\" as a compromise between \"and\" and \"but\". Normally \"while\"\nshould be confined to temporal expressions, such as: \"While my wife read abstruse\npapers on neuro-endocrinology, I watched re-runs of Buffy the Vampire Slayer on\nTV.\"\n\n10.\nIf your first language is not English, check for common mistranslations. For instance,\nif you are a native speaker of Portuguese or Spanish change you should make sure to\nwrite \"make decisions\" instead of \"take decisions\", \"commitment\" as opposed\nto\"compromise\", \"sensitive\" as opposed to \"sensible\", \"soccer\" instead of \"futbol\" or\nfootball\", etc.\n\n11.\nDo not worry about split infinitives. If Captain Kirk can do it (\"to boldly go where no\none has gone before\"), so can you.\n\n12.\nIf in doubt about style and grammar, consult Strunk et al. 1 or some similar volume.\n\n13.\nAlways include page numbers on your papers.\n\n14.\nSpell check and proofread your paper before handing it in.\n\n15.\nPick an acceptable style for citations and stick to it. If your footnotes are abridged or\nyou are using the academic journal style of including citations in parentheses, be\nsure to include a list of references cited.\n\nMake sure the formatting of you bibliography and references corresponds to one of\nthe appropriate styles. Stick with ONE style and use it throughout. If in doubt about\nformatting issues, consult the Chicago Manual of Style.\n\n16.\nFor your first paper, allow at least two hours after that paper is completely written\nto your satisfaction to go back through it and check to make sure that you have\ncovered all these points. For subsequent papers, check through your paper both for\nthese points and for any hints you have received on previous papers.\n\n1 William Strunk Jr., E.B. White, and Roger Angell, The Elements of Style, 4th Edition (Boston: Allyn & Bacon,\n1999).\n\nSubstantive hints\n\n1.\nNear the beginning of the paper, offer your reader a \"road map\". For example, after\nintroducing your subject, you might write: \"This paper will first describe the logic of\nMarx's argument and then critique that logic. Next, it will discuss several empirical\nproblems with Marx's claims. Finally, it will suggest two ways to revise Marx's\nframework so as to take into account these objections without sacrificing its\nadmirable parsimony and intellectual punch.\"\n\n2.\nMake a clear argument in the first paragraph (or in the second paragraph, if you\nstart with a story). Then present evidence to support that argument.\n\n3.\nDo not ignore contrary evidence. Either acknowledge that such contrary evidence\nlimits the generality of your argument or show why it is not actually contrary to\nyour argument.\n\n4.\nDraw on all the potentially relevant readings.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 10 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/f875d72eda70f6de67dacf5494854488_MIT17_588F13_Week10Paper.pdf",
      "content": "17.588f13 Week 10 Paper Topic\n\nOver the last four decades, there have been many critiques of (Donald) Stokes's spatial\nmodel of voting but no one framework has supplanted it. What alternatives can you think\nof to the spatial model? How could you tell if any one particular alternative was superior?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 11 Paper 1 Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/29c23060680dba5ae3bfadfa3c0ffaff_MIT17_588F13_Week11Paper1.pdf",
      "content": "17.588f13 Week 11 Paper Topic Option #1\n\nMexico's Federal Electoral Institute has hired you as a consultant to recommend ways to prevent\nclientelism in the federal midterm elections of 2015. What would you suggest they do?\n\nAs background: Mexican federal elections are administered by an autonomous body known as the\nFederal Electoral Institute (IFE). Over the last fifteen years, elaborate precautions have been put in\nplace to prevent fraud and manipulation. For instance, all voters carry cards with biometric\nidentifiers that must be presented to polling station workers (who are selected at random from the\npopulation); both these ID cards and the electoral registry (which includes photographs of the\nvoters) are marked whenever voters vote, and voters' thumbs are also stamped with indelible ink.\nRepresentatives of political parties and authorized poll watchers may observe elections at all\npolling stations and verify whether polling station workers are accurately recording who is voting;\nhowever, they may not attempt to influence voters on Election Day, attempt to discern how voters\nmark their ballots (behind opaque plastic screens), or offer inducements of any kind to vote for any\nparticular party. Counting of the ballots by polling station workers is conducted only after the\npolling stations are closed and emptied, in the presence of party representatives, an IFE\nrepresentative, and any other authorized observers.\n\nDespite these and other precautions, clientelism and even vote-buying are thought to remain a\nproblem in Mexican elections. Some suspected practices include:\n\n-\nSignificant discretionary spending by state governors and mayors that is not\naccounted for and could be used to influence voters;\n\n-\nRepresentatives of parties paying for people to vote (even who they vote for cannot be\nobserved);\n\n-\nRepresentatives of parties or government officials insisting that recipients of\ngovernment benefits sign pledges to vote for a party in the run-up to the election, or\nthreatening to withdraw benefits from those who do not vote;\n\n-\nParty representatives or government officials promising benefits to those who pledge their\nsupport in advance (even in the absence of a clear enforcement mechanism);\n\n-\nTechniques to frustrate the secret ballot, such as voters' photographing their marked ballots\nwith cellphones and the \"carousel\" (in which a broker marks a ballot but does not deposit it,\npassing it secretly to a voter, who deposits the marked ballot and then returns her\nunmarked ballot to the broker, and so forth);\n\n-\nVoters' \"loaning\" their ID cards to similar-looking individuals;\n\n-\nCollusion between polling station workers and party representatives;\n\n-\nEtc.\n\nYour paper, obviously, should not focus mechanically on these particular practices but rather draw\non the readings to address what sorts of strategies the IFE should adopt.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 11 Paper 2 Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/960c11eded3c664f1b57e5201d95ef0d_MIT17_588F13_Week11Paper2.pdf",
      "content": "17.588f13 Week 11 Paper Topic Option #2\n\nIn 1999, four prominent individuals from the overwhelmingly Hasidic community of New\nSquare, New York were convicted of misdirecting millions in U.S. government funds. In\nher 2000 Senate race, then First Lady Hillary Rodham Clinton won over 99% of the vote\nin the Village of New Square (close to 1,400 votes, against 12 for Republican candidate\nRick Lazio). Two and a half months later, on his last day in office, President William\nClinton used his pardon power to commute the sentences of the imprisonedcommun\nleaders. Does this episode constitute clientelism?\nity\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 12 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/80e746d42a9da8efeea0eb398cb68c04_MIT17_588F13_Week12Paper.pdf",
      "content": "17.588f13 Week 12 Paper Topic\n\nThe World Bank has hired you to recommend ways to reduce corruption in rural health\nclinics in the Kyrgyz Republic. Assuming that you find what you would expect to find after\narriving in Bishkek (empty shelves where pharmaceuticals and bandages should be,\nhospital workers charging patients for clean syringes, rampant absenteeism, ghost\nemployees, etc.), what would you recommend be done?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 13 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/108085fddc837962f625d7546b59749b_MIT17_588F13_Week13Paper.pdf",
      "content": "17.588f13 Week 13 Paper Topic\n\nWas the political system of classical Athens more or less democratic than that of the\nUnited States of America? In what ways? During which periods? What would be the\nmodern critique of Athenian democracy? The Athenian critique of modern democracy?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 2 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/893b1a028f6a60a59ca007227036e98f_MIT17_588F13_Week2Paper.pdf",
      "content": "17.588f13 Week 2 Paper Topic\nDoes democracy depend upon a particular class structure? If so, which one?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 3 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/4e80e42862a2fc53106516e5d48bc34b_MIT17_588F13_Week3Paper.pdf",
      "content": "17.588f13 Week 3 Paper Topic\nAssume that, as an empirical matter, Islamic countries are less likely to be democracies\nthan other countries that appear to share similar characteristics. (I.e., assume that the\nsign on \"percentage of the population that is Muslim\" or \"majority Muslim country\" is\nstatistically significant and non-trivial in magnitude in an OLS regression, in which the\ndependent variable is Polity IV score and the control variables include level of economic\ndevelopment, economic inequality, education, geography, etc.) Is Islamic culture\nresponsible for this difference? Which aspects of Islam?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 4 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/794f5c8bf39309557938e240038d71d4_MIT17_588F13_Week4Paper.pdf",
      "content": "17.588f13 Week 4 Paper Topic\nWhat would happen if the United States adopted a proportional representation electoral\nsystem tomorrow? [If you are not from the U.S. and want to write on some equally\nsignificant change in your home country, that is fine too.]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Wk 5 Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/39e295dffccd281b1b28b8825ebab67b_MIT17_588F13_Week5Paper.pdf",
      "content": "17.588f13 Week 5 Paper Topic\nUnder what circumstances do rulers \"matter\"?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "17.588F13 Field Seminar in Comparative Politics: Reading Hints",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-588-field-seminar-in-comparative-politics-fall-2013/259723abb3aec882da42e456b071a516_MIT17_588F13_ReadingHints.pdf",
      "content": "17.588f13 Hints on the Readings\n1.\nKeep a written abstract of the readings for each week, even if you are not writing a\npaper. Your learning curve in graduate school will be steep, and the knowledge you\naccumulate during your first two years will fall out of even the youngest and largest\nof brains if you don't capture it in writing.\n\n2.\nFor each work, read until you feel you understand the main argument. Then stop\nand write down that argument in a sentence. This task will be relatively\nstraightforward for articles in peer-reviewed journals, for which there is normally\nan abstract at the front of the article; it may be harder for book, especially older\nbooks, which may have several sub-arguments. Sometimes, it is helpful to try to\nsummarize the argument as a boxes-and-arrows diagram (in which A leads to B\nleads to C).\n\n3.\nThink about the argument that you have just written down. Does it make logical\nsense? If not, can you state it in a way that does make sense? Write down your\nreflections in a few bullet points.\n\n4.\nThink about what sorts of evidence might support or contradict this argument. Jot\ndown a few \"observable implications\" of the argument.\n\n5.\nAs you read the rest of the article, keep track of whether the author presents\nevidence for her argument. Jot down, in bullet point form, the evidence that is\npresented.\n\n6.\nStop and reflect on the evidence presented. Is this evidence compelling? Write your\nassessment in a couple of bullet points.\n\n7.\nLeave space at the end of your abstract for ideas that occurred to you as you were\nreading, any clever quotes you may want to use in your own work, etc.\n\n8.\nFeel free to form study groups to go over the material and share the burden of\nwriting up summaries of the readings. Whether you do so and how you do it is\nentirely up to you (and outside my purview). However, even if you do divide up\nwriting notes, I would still recommend going through the exercise sketched out\nabove on your own.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.588 Field Seminar in Comparative Politics\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}