{
  "course_name": "Financial Crises",
  "course_description": "This course is an introduction to the economic theories of financial crises. It focuses on amplification mechanisms that exacerbate crises, such as leverage, fire sales, bank runs, interconnections, and complexity. It also analyzes the different perspectives on the origins of crises, such as mistaken beliefs and moral hazard, and discusses the optimal regulation of the financial system. The course draws upon examples from financial crises around the world, especially the recent subprime financial crisis.\n14.09 is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.",
  "topics": [
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics",
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 lecture / week, 1.5 hours / lecture\n\nPrerequisites\n\n18.01 Single Variable Calculus\n\n14.02 Principles of Macroeconomics\n\nCourse Overview\n\nThis mini-course is an introduction to economic theories of financial crises. We will focus on amplification mechanisms that exacerbate crises, such as leverage, fire sales, bank runs, interconnections, and complexity. We will also analyze the different perspectives on the origins of crises, such as mistaken beliefs and moral hazard, and discuss the optimal regulation of the financial system. Throughout, we will draw upon examples from financial crises around the world, especially the recent subprime financial crisis. Our objective is to gain a deeper understanding of these events by using economic theory as well as empirical evidence.\n\nThere are no required textbooks. We will rely mainly on lecture notes, and a number of optional articles will complement the notes (see\nReadings\nsection).\n\nGrading\n\nThis course is graded on a pass / fail scale. The exam will be distributed at the end of the last lecture and will be due 24 hours afterwards.\n\nACTIVITIES\n\nGRADES\n\nClass participation\n\n30%\n\nTake-home exam\n\n70%",
  "files": [
    {
      "category": "Exam",
      "title": "Take Home Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/090d453e68ab95fd03d6e257cef234f2_MIT14_09IAP16_exam.pdf",
      "content": "14.09, Financial Crises: Take Home Final Exam\nMIT, IAP 2016\nPlease find attached a handout, which is a chapter from the book, The\nCourage to Act: A Memoir of a Crisis and Its Aftermath (2015), by Ex-Fed\nChairman Ben Bernanke. Please read the chapter and answer the following\nquestions as best as you can, based on your understanding of the chapter and\nthe material we covered in lectures. Feel free to refer to the models we covered\nin lectures without explaining the model. Please try to be concise in general.\nThe whole exam shouldn't take more than a few pages.\n1. On page 249, Chairman Bernanke mentions that Lehman Brothers had two financial\nproblems. Briefly (not to exceed a few sentences) describe those problems in conceptual\nterms.\n2. On page 252, Chairman Bernanke mentions that Lehman announced a $2.8 billion\nloss on June 9. Briefly explain how the losses of a financial institution could induce it to\nreduce positions or sell some assets. Could the sales of those assets influence their market\nprices? Suppose they did, and explain whether the endogenous change in asset prices would\nmitigate or exacerbate the institution's financial distress.\n3. On page 252, Chairman Bernanke says: \"Once again I worried about self-fulfilling\nprophecies: If concerns about Lehman's viability became su¢ciently widespread, other firms\nwould stop doing business with it and make recovery impossible.\" Briefly explain what\nChairman Bernanke means by a self-fulfilling prophecy. Mention (not to exceed a sentence)\ntwo types of policies that have been historically used to prevent self-fulfilling prophecies of\nthis type.\n4. On page 255, Chairman Bernanke says that: \"We were also concerned about the com\npany's funding, including its reliance on about $200 billion from the tri-party repo market.\"\nBriefly describe what a repo is. What was happening in repo markets around that time?\nWas Chairman Bernanke correct to be worried?\n5. On page 259, Chairman Bernanke says that: \"We had worked together to rescue Bear\nStearns in March, and we continued to believe that had been the right decision. Lehman\nwas 50 percent bigger than Bear had been on the eve of its acquisition and at least as\ninterconnected (its derivatives \"book\" was twice the size that Bear's had been). Moreover,\nfinancial markets and the economy were, if anything, more fragile now.\" Briefly (not to\nexceed a few sentences) describe what Chairman Bernanke is worried about here, using a\ncase or a model that we discussed in lectures.\n6. On page 261, Chairman Bernanke mentions a Wall Street Journal article that opined,\n\"If the feds step in to save Lehman after Bear and Fannie Mae, we will no longer have\n\nexceptions forged in a crisis. We will have a new de facto federal policy of underwriting Wall\nStreet that will encourage even more reckless risk-taking.\" Briefly evaluate this opinion (not\nto exceed a few paragraphs). Feel free to bring in your view of the issue, and/or to rely on\nthe empirical evidence or the theoretical arguments discussed in lectures.\n7. On page 261, Chairman Bernanke says that: \"But it was in everyone's interest, whether\nor not they realized it, to protect the economy from the consequences of a catastrophic failure\nof the financial system.\" Briefly mention one piece of empirical evidence that we have seen\nin lectures that supports Chairman Bernanke's claim.\n8. Briefly (not to exceed a paragraph) summarize Chairman Bernanke's explanation for\nwhy Lehman Brothers could not be rescued, despite his belief that rescuing would be the\nright decision.\n9. How did the Fed prepare for a potential fallout from the failure of Lehman Brothers.\nDo these preparations make sense from the lens of the models we have seen?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\n-anXar\\ IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Understanding Financial Crises: Lessons from History",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/207a907c80c74a5226dc975456fccdff_MIT14_09IAP16_lec1_edit.pdf",
      "content": "Understanding Financial Crises: Lessons from\nHistory\nAlp Simsek\nMIT\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nRoadmap\nCourse logistics\nThe subprime crisis of 2007-2009\nSome lessons from the history of crises\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nAlp Simsek: Introduction\nAssociate Professor of Economics\nRaised in Turkey\nMIT undergraduate in mathematics and computer science\nMIT Ph.D. in economics, 2010\nSpecialize in macroeconomics and finance\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nWhy should you take this mini-course?\nWe will take an academic look at financial-banking crises:\nHow often do they happen?\nWhy do we care? From Wall Street to Main Street?\nWhy do they happen?\nHow do they get out of control?\nWhat to do about them?\nGeneral mechanisms. Subprime crisis as case study/empirics\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nCourse resources and requirements\nReadings\nNo textbook.\nLectures: 8 lectures.\nGrading: Pass/Fail\nParticipation: 30%\nTake-home exam: 70%\nDistributed at the end of the last lecture. Due in 24 hours.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nRoadmap\n1 Course logistics\n2 The subprime crisis of 2007-2009\n3 Some lessons from the history of crises\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nFinancial system channels resources to uses\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nI &ippliers of capital\n- .... m elXNs _\nS3Virqs\n·RIms ..... C<I!!h\nI Users of capital\n·FiIms tINI1 .,..\",.\n>Go> UlII\"ots IfIaI. SP8Ild\n......... do:b W)'Ing a hou,..,\nMortgages: Loans collateralized by houses\nSubprime mortgage: Borrowers with lower credit ratings.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nSolution: Securitization redistributes mortgage risks\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nAside: Derivatives and securitization\nDerivative security: Value derives from another security.\nFinancial innovation created new derivatives in recent years.\nAn interesting example is collateralized debt obligations (CDOs).\nThese are constructed in two steps:\nPool underlying securities (mortgages, but also corporate bonds,\nloans etc).\nSell claims to parts of the cash fiows on the pool (\"tranches\").\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nStructure of a CDO\nConsider a bond with promise (or face value) of $100.\nSuppose (for simplicity) it pays $0 in case of default.\nConstruct an equally weighted portfolio of many such bonds.\nCreate tranches by seniority:\nThe most senior tranche has a face value of $70. It pays in full\nunless over 30% of the bonds default, in which case it pays the\nremaining value of the bonds.\nThe next most senior has a face value of $15. It pays in full\nunless over 15% of the bonds default, in which case it pays\nwhatever remaining value is above $70.\nAnd so on until you reach the equity tranche, which has a face\nvalue of $3 and pays only the value of the bond portfolio above\n$97.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nStructure of a CDO\nA graph rep resenting the structure of a CDO (collateralized debt obligation) in economic theory.\nLessons from the History of Crises\nA graph representing the structure of a CDO (collateralized debt obligation) in economic theory.\nEquity Tranche\nMezzanine Tranche\nSenior Tranche\nSuper Senior Tranche\n97 100\nBond Portfolio's Ability to Pay\n\nWhy CDOs?\nCredit rating agencies rate bonds according to probability of\npaying in full.\nThere is a scarcity of the bonds with the highest rating (AAA):\nThese bonds account for only about 5% of the supply of\ncorporate bonds,\nBut many institutional investors are restricted to hold only\nhigh-rated bonds.\nCDO creates a supply of AAA tranches even if no individual\nbond is rated AAA.\nThe low-rated tranches can be sold to hedge funds and other\ninvestors who are looking for high yield and can tolerate high\nrisk.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nCDO alchemy\nCourtesy of Efraim Benmelech and Jennifer Dlugosz. Used with permission.\nFigure: From Benmelech and Dlugosz (2009).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nAre CDO ratings reliable?\nPitfalls with CDO ratings:\nUnlike AAA bonds, AAA tranches of CDOs are \"optimized\"so\nthat there is just enough collateral to ensure AAA rating.\nRiskier than a AAA bond (marginally AAA).\nIn view of diversification, the risk of AAA tranches\ndepends on the probability of a negative aggregate\nshock (recession, falling house prices etc.) that affects\nmany underlying securities simultaneously.\nRating agencies are good at modeling idiosyncratic default risk.\nNot so good at modeling aggregate shocks (and correlations).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nBack to story: Subprime mortgages securitized\nA table d\nescribing sub\nprime mortg\nages t\nhat are v\nunerable to a\ndrop in na\ntionwide\nhousing p\nrices.\nImage by MIT OpenCourseWare.\nThis is vulnerable to a drop in nationwide house prices. Why?\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nHouse prices rose and then fell... A graph showing housing prices between 1996 and 2012.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nDefaults and delinquencies increased\nA\ngra\nph r\nepre\nsent\ning\npast\ndue\nmor\ntgag\nes,\nshow\ning b\not\nh p\nrim\ne a\nnd\nsub\nprime mo\nrtgages.\nImage by MIT OpenCourseWare.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nMarkets recognized risks in AAA tranches\nFigure: From Brunnermeier (2009).\nCourtesy of Markus K. Brunnermeier. Used with permission.\nThe spreads are calculated from CDS prices. They provide a\nmeasure of the default probability for corresponding tranches.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nAside on credit default swaps (CDS)\nA CDS is an insurance contract on the default of a particular\nbond.\nFor example, suppose you own a corporate bond from company\nXYZ with principal $1,000. If company XYZ defaults, you might\nget back $500 instead of $1,000.\nYou may buy a CDS for XYZ from someone (CDS seller). In this\ncase, you will definitely get $1,000.\nIf XYZ defaults, the CDS seller pays you $1000 (in exchange for\nthe bond) so that your total of $1000 is guaranteed.\nYou \"swap\" the default risk with the CDS seller.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nExample\nIn October 2008, the 5-year CDS rate on Morgan Stanley debt\nwith face value $10,000 was $1,000.\nThis means that you could enter a swap where you paid $1,000\na year for five years, and in return you get payment $10,000 if\nMS defaults (in exchange for the MS bond).\nThis price provides a measure of the probability that MS will\ndefault. For example, if the recovery rate on MS debt is 50% (in\na default, MS would only pay fifty cents on the dollar), this\n(roughly) implies:\n20% chance that Morgan Stanley would default in the next year,\nAbout 70% chance of default in the next five years.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nCDS during the Euro-debt crisis\n(c) Cable News Network. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\nEstimated probability of default on sovereign bonds over the next five\nyears in September 2011 (CNNMoney article on September 16).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nBack to story: Markets recognized risks\nCourtesy of Markus K. Brunnermeier. Used with permission.\nFigure: From Brunnermeier (2009).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nKey aspect: Some financial institutions made losses\nKrishnamurthy (2010), \"How Debt Markets Have Malfunctioned\nin the Crisis.\"\nCourtesy of the American Economic Association. Used with permission.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nTheir default risks increased\nCourtesy of Markus K. Brunnermeier. Used with permission.\nFigure: From Brunnermeier (2009).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nSome of them became bankrupt\nSome others (Bear Sterns, Freddie, Fannie, AIG...) were bailed out\nwith government support.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nStock market crashed\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nThe US economy entered the Great Recession\nA gr\naph\nshow\ning\nthe\nU.S.\nrea\nl ye\narly\ngro\nss d\nomes\ntic p\nroduct\n(GDP\n) and\nits dr\nop dur\ning th\ne 2008\n-2009 recession.\nImage by MIT OpenCourseWare.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nEconomic activity fell below potential\nCourtesy of the Congressional Budget Office. This work is in the public domain.\nTriggered strong policy response by the Fed and the treasury.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nMonetary policy appears to be constrained\nCourtesy of the Board of Governors of the Federal Reserve. This image is in the public domain.\nTriggered unconventional policies: Quantitative easing etc.\nTriggered also bailouts and stabilizers, which raised deficits....\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nFiscal policy steps in, raising government deficits\nCourtesy of the Congressional Budget Office. This work is in the public domain.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nThe shock seemed small relative to damage\n- One feature of the subprime crisis is that the initiating shock seemed to be\nsmall relative to the ultimate damage it caused.\n- Blanchard (2009, \"The Crisis: Basic Mechanisms and Appropriate Policies\")\nnotes that:\no The estimated losses in the U.S. subprime market in October 2007\nwas around $250 billion dollars\no The cumulative world output loss relative to trend between 2008\nand 2015 (based on IMF estimates) was around $4700 billion\ndollars. About 20 times the initial loss in the subprime market!\no The cumulative loss in the world stock markets from July 2007 to\nNovember 2008 was about $26400 billion. About 100 times the\ninitial loss!\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nThe mystery of the subprime crisis: Whodunit?\nThe subprime crisis features many candidates for a culprit:\nExtension of subprime loans by banks, e.g., lax lending standards.\nSecuritization and the CDOs.\nRating agencies.\nCDS (looks innocent so far, but still a key character)\nLarge financial institutions that made the losses.\nGovernment (Fed+treasury) suport or bailout of banks\nIn fact, books written (movies made) about each candidate.\nBut economics is about prioritizing & focusing on first order.\nWhere should we focus our efforts? Some history could help...\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nRoadmap\n1 Course logistics\n2 The subprime crisis of 2007-2009\n3 Some lessons from the history of crises\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nLessons from history: Crises are \"universal\"\nAllen and Gale (2009): Crises are \"universal\"phenomena.\nThey happened in different periods and in different countries.\nThey happened in developing and developed countries.\nAG discuss Bordo et al. (2001), who analyze the incidence of\ncrises in 21 countries over 120 years.\nBanking crises: Erosion of most banking capital.\nCurrency crises: Forex attacks and devaluation (not our focus).\nTwin crises: Both at the same time...\nAlp Simsek (MIT)\nLessons from the History of Crises\nfrequently\n\nBordo et al. (2001) find that:\nBanking crises are relatively common in most time\nperiods (except for 1945-1971---highly regulated)\nThey also happen in developed countries--albeit\nless frequently\nTheir aftermath is typically associated with severe\noutput losses.\nSchularick-Taylor (AER, 2012) analyze the relationship\nbetween banking crises and output more systematically...\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nThey date 79 banking crises (denoted by year 0 in the figure) and\nanalyze the evolution of investment and output in their aftermath.\nSchularick-Taylor (AER, 2012):\nCourtesy of Moritz Schularick and Alan M. Taylor. Used with permission.\nSevere drops in investment and output, partial recovery.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nCerra and Saxena (AER, 2008) do a similar analysis as\nSchularick-Taylor using an alternative data set that covers 190\ncountries between 1960-2001.\nCourtesy of Valerie Cerra and Sweta Chaman Saxana. Used with permission.\nThey find much more persistent effects, little recovery.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nLessons from history: Optimism/bad news\n- Cerra-Saxena also find optimism during the crisis. Growth\nforecasts systematically revised downwards as crisis unfolds.\n- In their popular book, \"This Time is Different,\" Reinhart and\nRogoff also emphasize optimism before and during crises.\n- As we will see, optimism was also arguably widespread before\nand during the subprime crisis.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nExamples from recent history\nRead Allen and Gale (2009) for a brief discussion of recent crises:\nScandinavian crises (Norway, Finland, Sweden) of early 1990s.\nThe Japanese crisis of early 1990s\nAsian crises of late 1990s (Asian \"dragons\" & \"tigers\"):\nRussian default of 1998 and the LTCM mini-crisis in the US.\nThe Argentina crisis of early 2000s.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nLessons from history: Summary\nHistory suggests:\nBanking crises are common. Can happen in developed economies.\nThe following features are also quite common in crises:\n2. Crises are typically followed by large drops in output.\n3. Crises are associated with ex-ante optimism/ex-post bad\nnews.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nBack to the subprime crisis: Whodunit?\nRecall that we had the following candidates for blame:\nExtension of subprime loans by banks, e.g., lax lending standards.\nSecuritization and the CDOs.\nRating agencies.\nCDS (looks innocent so far, but still a key character)\nLarge financial institutions that made the losses.\nGovernment support of bailout of banks\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nCommon denominator: Banks and the government\nUniversality suggests points 1-4 might not be so central:\nBanking crises happened without subprime, CDOs, rating\nagencies, CDS....\nIn contrast, point 5 appears to be a common feature of crises.\nSevere financial events that don't involve banks need not\ngenerate crises. The bust of the NASDAQ bubble in 2001 wiped\nout a lot of wealth (more than subprime). But banks were not\nexposed. Only mild recession.\nPoint 6 is also in the mix. Most episodes feature gov support.\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nRoadmap for the rest of the course\nWe made a tiny bit of progress, but several issues remain:\nTransmission: How do banks'problems affect the economy?\nAmplification: How do \"small\" shocks generate large damage?\nCauses: What are the ultimate causes of bank losses?\nPanics: Why are crises often associated with a panic?\nWhat is the role of optimism/bad news in losses or panics?\nSolutions: Optimal policy during a crisis? How about before?\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nRoadmap for the rest of the course\nLecture 2: Borrowing constraints and the net worth channel\nLecture 3: Leverage, fire sales, and amplification mechanisms\nLecture 4: Understanding banks'losses: Moral hazard or\nmistakes\nLecture 5: Liquidity, part 1: Maturity mismatch and banking\npanics\nLecture 6: Liquidity, part 2: Debt, information-based panics, and\nfiight to quality\nLecture 7: Interconnections and complexity.\nLecture 8: Optimal policy: How to mitigate or prevent crises?\nFor review, read the chapter by Allen and Gale (2009).\nFor tomorrow, read the intro of Holmstrom and Tirole (1997).\nAlp Simsek (MIT)\nLessons from the History of Crises\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2: Borrowing Constraints, the Net Worth Channel, and the Credit Crunch",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/a433b1637f44770d5b3c9474a7823f20_MIT14_09IAP16_lec2_edit.pdf",
      "content": "14.09: Financial Crises\nLecture 2: Borrowing Constraints, the Net Worth\nChannel, and the Credit Crunch\nAlp Simsek\nAlp Simsek ()\nNet Worth Channel\n\nWhat is the role of financial institutions?\nFinancial institutions (or \"banks\") seem central to financial crises.\nThey intermediate credit between ultimate savers and borrowers.\nBroadly, can think of them as investment specialists/experts.\nThey can identify firms with good borrowers, ensure repayment etc.\nThey can also collect information and \"correct\" asset prices, thereby\nindirectly infiuencing investment (e.g., trading type activities).\nNext: A model of banks and their borrowing constraints, based on\nHolmstrom and Tirole (QJE, 1997).\nAlp Simsek ()\nNet Worth Channel\n\nRoadmap\nBorrowing constraints and the net worth channel\nEmpirical evidence on the net worth channel\nThe credit crunch\nThe net worth channel more broadly\nAlp Simsek ()\nNet Worth Channel\n\nA stylized model of banks\nConsider a model with two periods t ∈{0, 1}.\nTwo types of agents: banks (B) and financiers (F).\nThe H-T model has three agents: Firms, banks (which they call\nmonitors), and financiers. I am presenting a simpler version.\nBoth types have linear preferences, C0 + C1.\nFinanciers are money rich but idea poor:\nLarge endowments at both periods. Happy to make loans as long as\nthey break even. The interest rate is, 1+ r = 1.\nThey don't have ideas for profitable investment.\nBanks (our focus) are the opposite: idea-rich but money poor...\nAlp Simsek ()\nNet Worth Channel\n\nBanks have investment opportunities\nEach bank starts with some initial cash, denoted by N.\nIt chooses how much to invest at date 0, denoted by I .\nSuppose each unit of investment generates payoff R at date 1.\nSuppose R > 1 so bank wants to invest as much as possible...\nIt invests her own cash. But she might also borrow from Fs.\nAlp Simsek ()\nNet Worth Channel\n\nBanks face borrowing constraints\nSuppose the bank borrows on \"per asset\" basis.\nFor each unit of investment I , it can borrow ρ.\nImagine the bank as using its assets as collateral to borrow.\nE.g., a mortgage with 20% downpayment features ρ = 0.8.\nFor a given ρ, the bank's budget constraint can be written as,\nI = N + ρI .\nThe bank's investment can then be written as,\nI =\nN .\n1 - ρ\nWe can also illustrate this on a balance sheet.\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nThe instructor's calculations based on the Federal Reserve Statistical Releases.\n\nNeed: A theory of the leverage ratio\nRecall our investment equation\nI =\nN .\n1 - ρ\nThe ratio of total investment (or assets) to net worth, 1/ (1 - ρ) is\nknown as the leverage ratio.\nWhat is the leverage ratio of commercial banks in 2008?\nMight ask: What determines ρ, and thus, 1/ (1 - ρ)?\nWhy is ρ < 1? What would happen if we had, ρ , 1?\nAlp Simsek ()\nNet Worth Channel\n\nNeed: A theory of borrowing constraints\nThese are deep questions. The field of corporate finance.\nIf we had ρ , 1, the bank would not be borrowing constrained.\nCan do as much investment as she likes with little or no capital.\nIn practice, banks as well as firms (sometimes) seem constrained.\nLiterature emphasizes constraints driven by information frictions.\nWe next illustrate this using a version of Holmstrom-Tirole's (1997)\nmodel based on moral hazard- a particular information friction...\nAlp Simsek ()\nNet Worth Channel\n\nMoral hazard: The bank can misbehave\nSuppose the project either succeeds and yields R, as before, or fails\nand yields 0. Suppose also two versions of the project:\nProject\nNormal\nShirk\nPrivate benefit to the bank\ncI > 0\nProb. of success\nq < 1\n.\nThe normal version succeeds for sure as before.\nThe shirk version requires less effort (skip due diligence etc).\nMight fail, but it generates private benefit for bank insiders..\nMoral hazard: Insiders (managers/workers/owners) might misbehave.\n(Information friction: Fs do not observe whether bank insiders shirk).\nAlp Simsek ()\nNet Worth Channel\n\nSkin-in-the-game, to provide incentives\nA borrowing contract divides the output from each unit of the project (in\ncase of success), R = RF + RB , to meet two objectives:\n1 Financiers need to break even,\nRF = ρ.\n2 The bank insiders need to behave (incentives):\nRB ≥ qRB + c.\nThe second condition can also be rewritten as,\nRB ≥\nc\n.\n1 - q\nFor good management, B must have \"skin in the game.\"\nAlp Simsek ()\nNet Worth Channel\n\nKey implication: Limited borrowing\nCombining the two conditions with R = RF + RB , we obtain\nρ = RF\n= R - RB\nc\n≤ R -\n.\n1 - q\nSo ρ cannot exceed an upper bound,\nc\nρ = R -\n.\n1 - q\nSuppose c is large (incentive problems severe) so ρ < 1.\nWe have thus obtained a theory of limited borrowing, ρ.\nAlp Simsek ()\nNet Worth Channel\n\nBroader interpretation: Limited pledgeability\nThis is a highly specific and stylized model.\nBut some features of the model are more general.\nThe bank is constrained since cannot promise (or pledge) all of the\nvalue from investment, R, to potential lenders.\nc\nCan only pledge up to a level, ρ < R -\n.\n1-q\nThis feature, limited pledgeability, is more general...\nAlp Simsek ()\nNet Worth Channel\n\nBroader interpretation: Limited pledgeability\nAn alternative and broader interpretation of limited pledgeability:\nless tangible or more \"risky\"\n\nR =\nρ\n+\nR - ρ\n.\n\nmore tangible or less \"risky\" assets (collateral)\nLess risky =⇒ More pledgeable since it varies less with info (including\nunobserved action), and thus, is subject to fewer frictions.\nAlp Simsek ()\nNet Worth Channel\n|{z}\n\nLimited pledgeability on collateralized loans\nIn collateralized lending, each loan is backed by specific asset.\nIn this case, you might imagine ρ as applying asset by asset.\nIn this context, ρ is known as the loan-to-value ratio.\nResidual, 1 - ρ, is known as the margin/haircut/downpayment\nThe amount B would have to pay out of its pocket to buy the asset.\nThe inequality, ρ ≤ ρ, becomes a LTV or haircut constraint.\nWe do observe margins on collateralized loans in practice....\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nCourtesy of the American Economics Association. Used with permission.\n\nLimited pledgeability on collateralized loans\nRepo is a particular type of collateralized loan. Will come back.\nThe table shows that riskier assets have greater haircuts/margins.\nIt also shows haircuts are (typically) low on many financial assets.\nOne reason why banks can have so high leverage--will come back.\nAlp Simsek ()\nNet Worth Channel\n\nBack to model: Investment with limited pledgeability\nWith limited pledgeability, the bank's budget constraint becomes:\nI =\nN with ρ ≤ ρ.\n1 - ρ\nThe bank chooses how much to borrow and invest subject to ρ ≤ ρ.\nThe bank's return from choosing particular ρ can be written as,\nR - ρ\nR - 1\nRI - ρI\n=\nN =\n1 +\nN.\n1 - ρ\n1 - ρ\nnet return after paying back financiers\nSince R > 1, the bank borrows and invests to the max (intuition?):\nρ = ρ and I =\nN.\n1 - ρ\nAlp Simsek ()\nNet Worth Channel\n| {z }\n\nImplication: Net worth channel of investment\nI =\nN.\n1 - ρ\nKey implication: Greater bank net worth, N, raises investment, I .\nThis is known as the net worth channel of investment.\nThe logic of the result is in fact more general. As long as:\nThe borrower has profitable projects (captured by R > 1),\nThe projects have limited pledgeability (captured by ρ < 1).\nThen, it is reasonable to think that the borrower's net worth, N (more\nbroadly, internal funds) would affect its investment. Why?\nAlp Simsek ()\nNet Worth Channel\n\nA caveat: What if banks'net worth could grow?\nThe more general interpretation also raises a warning fiag.\nIn a dynamic setting, banks would accumulate net worth (e.g., by\nrealizing returns from past investment).\nEventually, their net worth and investment could be so high that they\ncould run out of projects, R , 1 (already invested in all).\nIf this happened, additional N wouldn't affect investment. Why?\nThese considerations are built into more sophisticated models.\nLet's look at some results (pictures) from Brunnermeier-Sannikov\n(AER, 2014), \"A Macro Model with a Financial Sector.\"\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Markus K. Brunnermeier and Yuliy Sannikov. Used with permission.\n\nNet worth channel in a dynamic setting\nη in the Bru-San model is the analogue of N in the static model.\nq is the analogue of investment, I .\nR -1\nθ captures the marginal value of additional net worth (~1 + 1-ρ ).\nThe second plot illustrates diminishing returns: As η ↑ η∗, the banks\nrun into diminishing returns (θ ↓ 1 similar to R ↓ 1).\nBanks'assets are subject to shocks, so η moves around...\nAlp Simsek ()\nNet Worth Channel\n\nNet worth channel in a dynamic setting\nWhen η hits η∗ banks pay out dividends to their owners (who value\nreceiving them). Don't need funds, so might as well pay out.\nThis keeps η ≤ η∗ . Within this range, there are two regimes:\nMost of the time (normal times) η remains around η∗ .\nIs the sensitivity of investment to η higher or lower in this range?\nBut negative shocks can lower η substantially below η∗:\nIs the sensitivity of investment to η higher or lower in this range?\nAlp Simsek ()\nNet Worth Channel\n\n(In practice, η∗ might also be even lower for reasons outside Bru-San).\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Markus K. Brunnermeier and Yuliy Sannikov. Used with permission.\n\nBack to the static net worth channel\nI =\nN.\n1 - ρ\nMore broadly, imagine this equation as saying: Net worth affects\ninvestment, especially if the bank net worth is suffi ciently low.\nWhat are some policy implications of the net worth channel?\nAlp Simsek ()\nNet Worth Channel\n\nImplications of the net worth channel\n1 Financial shocks that lower B's net worth lower investment.\nShocks to Bs assets, e.g., subprime shock, can trigger a crisis.\n2 Heterogeneity and distribution of wealth matters.\nTransfer of wealth from Fs to Bs raise investment- especially during a\nsevere crisis that depletes B's net worth. Why?\nA bailout can be thought of as a transfer from Fs to Bs.\nSo the NW channel provides one justification for bailouts.\nBut is the channel true? Let's look at some empirical evidence.\nAlp Simsek ()\nNet Worth Channel\n\nRoadmap\n1 Borrowing constraints and the net worth channel\nEmpirical evidence on the net worth channel\nThe credit crunch\nThe net worth channel more broadly\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nThe graph plots the rate at which banks lend to one another.\nImagine this as a (very rough) empirical counterpart of R or θ.\nWhen do we expect the net worth channel to be more relevant?\nRecall also that banks indeed realized losses in 2007 and 2008.\nWhat would the net worth channel imply for banks'investment- i.e.,\ntheir loans to firms or consumers- over this period?\nAlp Simsek ()\nNet Worth Channel\n\nIvashina-Scharfstein (2010): Bank lending declines\nSyndicated loans: Large loans originated by one bank and held by\nmultiple banks. Main source of bank loans for large corporations.\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\n\nIvashina-Scharfstein (2010): Bank lending declines\nSyndicated loans provides as an empirical counterpart to I .\nTotal syndicated loans fell by 79% from 2007Q2 until end of 2008.\nThey fell by 47% at the peak of crisis, 2008Q4 (Lehman shock).\nThe timing is quite consistent with the net worth channel.\nChodorow-Reich (QJE, 2014): Further analysis with more data:\nVariation in the lending of individual banks: Did banks that were\nmore exposed to the (negative) subprime shock reduce lending more?\nWhat happens to the economic activity of firms whose credit is cut?\nAlp Simsek ()\nNet Worth Channel\n\nCR: Aggregate lending declines (replicating IS)\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nCR: Individual lending is consistent with the NW channel\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nCR: Individual lending is consistent with the NW channel\n2nd column: More exposed to subprime CDOs =⇒ Lower lending.\n3rd column: Lower trading revenues or greater charge-offs (realized\nlosses) on real estate assets =⇒ Lower lending.\n(Ignore the 1st column and the deposits entry of the 3rd column for\nnow. These will make a come back next week.)\nConsistent with the net worth channel (though not conclusive).\nThe more important part of Chodorow-Reich concerns firms'activity.\nTo address this, we have to expand our \"model\" to think of firms...\nAlp Simsek ()\nNet Worth Channel\n\nRoadmap\n1 Borrowing constraints and the net worth channel\n2 Empirical evidence on the net worth channel\n3 The credit crunch\n4 The net worth channel more broadly\nAlp Simsek ()\nNet Worth Channel\n\nIncorporating firms into the analysis\nWe haven't explicitly modeled firms- only Bs and financiers.\nRecall banks intermediate credit between financiers and firms.\nConsider a firm who has a relationship with a particular bank.\nAssume:\nA1. The firm doesn't have suffi cient net worth or internal funds of its own.\nA2. The firm cannot directly borrow from financiers (see the more general\nmodel in H-T for a relaxation of this assumption).\nA3. The firm cannot easily switch banks and start a new relationship.\nAlp Simsek ()\nNet Worth Channel\n\nCredit crunch: Firms lose bank financing and cut activity\nThis type of firm must borrow from its bank to spend.\nWhat would happen to the firm's borrowing as its bank loses NW?\nWhat about the firm's economic activity (investment, employment...)?\nThese effects are known as the credit crunch (firms'perspective).\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nCredit crunch \"reduces\" firms'borrowing\nΔLi,s is the total amount of loans made (to all firms) by the bank s\nfrom which firm i received syndicated loan prior to Lehman.\n-ΔLi ,s can be thought of of as a measure of credit crunch faced by i.\nResults show: Credit crunch reduces the firm's probability of\nborrowing. Supports A3 above: Firms can't easily switch to another\nbank.\nThe effects are economically large (see the last two lines).\nAlp Simsek ()\nNet Worth Channel\n\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nCredit crunch \"reduces\" firms'employment\nFirms whose pre-Lehman banks cut back lending more (e.g., due to a\ngreater drop in net worth) reduced employment more.\nThe effects are economically very large (last two lines).\nCR finds (rough estimate) credit crunch can account for 1/3-1/2 of\nthe decline in employment in small-medium firms between 2008:3 and\n2009:3.\nThere are concerns with causality (as usual) but still very interesting.\nAlp Simsek ()\nNet Worth Channel\n\nDifferential effects on small and large firms\nCR also finds the effects of a credit crunch differ by firm size.\nSignificant for small and medium firms, but not for the largest firms.\nThis finding can also be reconciled with the general model in H-T.\nLarge firms have a plausible alternative to bank financing: They\nmight be able to borrow directly from financiers.\nE.g., IBM can issue and sell bonds to raise funds.\nThis might not be feasible for small firms- they need bank financing.\nSo small and medium size firms would arguably be affected more.\nH-T formalize this by allowing for direct financing (relaxing A1-A2).\nAlp Simsek ()\nNet Worth Channel\n\nDifferential effects on small and large firms\nIn the raw data, employment of small firms fell much more.\nCR: Much of this drop can be \"explained\" by the credit crunch.\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nRoadmap\nBorrowing constraints and the net worth channel\nEmpirical evidence on the net worth channel\nThe credit crunch\n4 The net worth channel more broadly\nAlp Simsek ()\nNet Worth Channel\n\nHow about firms'borrowing constraints?\nSo far, we emphasized banks'borrowing problems as being central.\nBut firms might invest to some extend with their own funds, Nfirm .\nLarge firms, such as IBM, might also be obtain direct financing.\nH-T model considers both firms'and banks'borrowing constraints.\nFirms face borrowing constraints, ρfirm < 1, just like banks do.\nTheir net worth, Nfirm , can also affect investment, similar to above.\nAlp Simsek ()\nNet Worth Channel\n\nThe net worth channel more broadly\nThe more general insight is: The net worth of the borrowing sector\nof the economy matters for economic activity.\nBanks'net worth, Nbank , declines: Credit crunch.\nFirms'net worth, Nfirm , declines: Collateral squeeze.\nThe shocks to Nbank are typically amplified more (next lecture).\nBut shocks to Nfirm could also matter and trigger a financial crisis.\nNext: A different source of evidence that is consistent with some version\nof the net worth channel- without pinning its exact location.\nAlp Simsek ()\nNet Worth Channel\n\nAn alternative source of evidence: CFO surveys\nCampello, Graham, and Harvey (2010): Survey of 1050 CFOs in 39\ncountries conducted in Fall 2008: US (574), Europe (192), and Asia\n(284).\nQuestions about financial constraints and future plans.\nResults:\nAll firms planned cuts in investment over this episode (no surprise).\nFirms that report to be financially constrained planned much deeper\ncuts in investment- consistent with borrowing constraints (a drop in\nNfirm or Nbank or both).\nAlp Simsek ()\nNet Worth Channel\n\nIn Fall 2008, firms across the globe planned to reduce\nvarious forms of investment (and employment)\nFigure displays all firms'(not just constrained) change in the policy\nvariable (% per year) as of Fall of 2008.\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Murillo Campello, John Graham, and Campbell R. Harvey. Used with permission.\n\nFirms reported they faced borrowing constraints\nBorrowing constraints: Are you affected by diffi culties in accessing\ncredit markets?\nIn the US sample: 244 indicate unaffected, 210 indicate somewhat\naffected, 115 indicate very affected.\nAlp Simsek ()\nNet Worth Channel\n\nMain result: Constrained firms in the US planned much\nlarger cuts than unconstrained firms\nThey control for many aspects of the firm except for CFOs report of\nfinancial constraints and find similar results.\nAlp Simsek ()\nNet Worth Channel\nCourtesy of Murillo Campello, John Graham, and Campbell R. Harvey. Used with permission.\n\nTaking stock: Transmission mechanisms\nSo why care about banks'problems (or financial shocks in general)?\nBecause they affect economic activity via the net worth channel:\nBorrowing is constrained (due to frictions) so borrowers'internal\nfunds/net worth matters.\nDecline in banks'net worth =⇒ Credit crunch for firms.\nFirms'net worth also matters (albeit to a lesser extent).\nChannels supported by empirical evidence from the recent crisis.\nTomorrow: Amplification mechanisms. Read the LTCM case study.\nAlp Simsek ()\nNet Worth Channel\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3: Leverage, Fire Sales, and Amplification Mechanisms",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/027f253ad61984bb192f1c5d4c060a17_MIT14_09IAP16_lec3_edit.pdf",
      "content": "14.09: Financial Crises\nLecture 3: Leverage, Fire Sales, and Amplification\nMechanisms\nAlp Simsek\nAlp Simsek ()\nAmplification Mechanisms\n\nCrises and amplification mechanisms\nAlp Simsek ()\nAmplification Mechanisms\n-\nBanking crises are often triggered by events that seem\n\"small\" in retrospect.\n-\nIn the recent crisis, estimated initial losses in the U.S.\nsubprime market were less than $500 billion. This is not\ntoo large: comparable to the losses in the U.S. stock\nmarket on some bad days.\n-\nBut these losses triggered a worldwide financial crisis.\nThey were associated with extremely large declines in\neconomic activity (see Blanchard (2009, \"The Crisis: Basic\nMechanisms and Appropriate Policies\").\n-\nThis lecture: How (and when) do small financial shocks\nhave amplified effects?\n\nRoadmap\nAmplification from high leverage\nAmplification from procyclical leverage\nFire sales and amplification\nThe LTCM crisis of 1998\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage and amplification mechanisms\nRecall the Holmstrom-Tirole model from the last time\nN0\nInvest I0 =\nby borrowing ρ0I0.\n1 - ρ0\nWe put the time subscripts to emphasize the timing. Bank made\ninvestments at date 0 and returns are realized at date 1.\nThe realization, R1, will induce a new net worth for banks, N1.\nSuppose banks will reinvest at date 1 given N1, denoted by I1.\nNew question: How would the realization R1 affect N1, and thus I1.\nLet's work out an example with initial N0 = 1 and ρ0 = 0.95...\nAlp Simsek ()\nAmplification Mechanisms\n\nThe bank's initial balance sheet\nThe bank's initial leverage ratio is high, 1/ (1 - ρ0) = 20.\nAlp Simsek ()\nAmplification Mechanisms\n\nThe bank's realized balance sheet\nConsider the balance sheet at date 1 after R1 is realized.\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage amplifies losses (and gains)\nSo in this example, we have\nN1 = 20R1 - 19.\nIf R1 = 1, then bank breaks even and N1 = N0 = 1.\nSuppose instead R1 = 1.01. What is N1 in this case?\nSuppose instead R1 = 0.99. What is N1 in this case?\n1% change in R1 has a large (20%) effect on N1. Why?\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage amplifies losses (and gains)\nMore generally, the bank's realized net worth can be written as,\n\nR1 - 1\nN1 = R0I0 - ρ0I0 =\n1 +\nN0.\n1 - ρ0\nNote that high leverage,\n1 , amplifies gains but also losses.\n1-ρ0\nGoing beyond the math, what is the economic intuition for this result?\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage amplifies due to debt being a constant promise\nThe bank's debt is fixed regardless of its realized returns R1.\nIt has to pay ρ0I0 regardless of returns R1 are high or low.\nPut differently, all the changes in returns are absorbed by N1.\nThis feature of debt creates amplification of losses (and gains).\nBut should Fs'claims be necessarily be fixed regardless of R1?\nSo far, we simply assumed it. This is a deep issue. Will come back.\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage amplifies initial losses (and gains)\nThe drop in banks'net worth, N1, reduces its new investment, I1.\nSuppose the same model is repeated at date 1 so that,\n20% drop\n20% drop\n1% drop\nz}|{\nz}|{\nz}|{\nI1\n=\nN1\n, where N1 = 20 R1\n- 19.\n1 - ρ1\n1% drop in R1 translates into an amplified drop in N1.\nThis translates into an amplified drop in I1. Why?\nIn practice, maximum leverage ρ1 also tends to be procyclical...\nAlp Simsek ()\nAmplification Mechanisms\n\nRoadmap\n1 Amplification from high leverage\n2 Amplification from procyclical leverage\n3 Fire sales and amplification\n4 The LTCM crisis of 1998\nAlp Simsek ()\nAmplification Mechanisms\n\nAlp Simsek ()\nAmplification Mechanisms\n(c) Dow Jones & Company, Inc. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nIn practice, leverage also tends to be procyclical\nThe bottom panels illustrate a measure of ρ1 for different assets.\nLeverage ratios seem procyclical in the sense that they are high in\ngood times (with high R1) but low in bad times (with low R1).\nGeanakoplos (2009), \"The Leverage Cycle\" proposed a theory of\nprocyclical leverage based on changes in uncertainty.\nBad times =⇒ Uncertainty =⇒ Nervous lenders=⇒ Less leverage.\nWe will come back to and formalize this argument next week.\nFor now: Procyclical leverage creates further amplification. Why?\nAlp Simsek ()\nAmplification Mechanisms\n\nz}|{\n|\n{z\n}\nz}|{\nProcyclical leverage creates further amplification\nGoing back to our example, suppose ρ1 = 0.9 < 0.95 after the loss.\n60% drop\nI1\n=\n1 - ρ1 (R1)\n20% drop\nN1\n, where N1 = 20R1-19.\ndrops from 20 to 10 =⇒ 50% drop\nProcyclical leverage ratio creates further amplification!\nBorrowing becomes more diffi cult (ρ1 collapses) precisely when banks\nmake losses and need to borrow the most!\nAlp Simsek ()\nAmplification Mechanisms\nz}|{\n|\n{z\n}\nz}|{\n\nRoadmap\nAmplification from high leverage\nAmplification from procyclical leverage\nFire sales and amplification\nThe LTCM crisis of 1998\nAlp Simsek ()\nAmplification Mechanisms\n\nAnother source of amplification: Fire sales\nAnother problem in practice is that R1 is also endogenous. Many\nbanks (or bank like institutions) invest in financial assets. For\nsuch assets, the realized return can be written as,\nQ1 + D1\nR1 =\n.\nQ0\nHere, Q0, Q1 denote the price and D1 denotes dividend/payoff at 1.\nImagine buying the asset at date 0, receiving D1, and selling the asset\nat date 1 to cash out. Then your return would be R1.\nAlp Simsek ()\nAmplification Mechanisms\n\nAnother source of amplification: Fire sales\nIn financial markets, prices Q0, Q1 are typically \"endogenous.\"\nThis makes R1 endogenous: What the bank does can affect R1.\nIn particular, low investment I1 can lower Q1, and ultimately, R1.\nThis amplification channel is known as fire sales.\nTo illustrate, we need a little bit of background on asset pricing...\nAlp Simsek ()\nAmplification Mechanisms\n\nForced mango sales would reduce the mango price\nCan we draw an analogy from goods to assets? In theory? In practice?\nAlp Simsek ()\nAmplification Mechanisms\n\nBasic asset pricing theory: Forced sales don't matter\nFair value, Q1, is present discounted value of future dividends/payoffs.\nThe discount rate incorporates risk, but is largely unchanged with sale.\nAlp Simsek ()\nAmplification Mechanisms\n\nAsset pricing in practice: Somewhere in between\nAsset prices in practice are somehwere in between. Imagine\nQideal , Qold , Qnew are different but close to one another.\nThere are (various) advanced asset pricing theories that capture this.\nAlp Simsek ()\nAmplification Mechanisms\n\nFire sales: Considerable market impact (larger than usual)\nThe result heavily relies on specialists being out. Why are they out?\nAlp Simsek ()\nAmplification Mechanisms\n\nWhy are specialists out? Common shocks/distress\nShleifer-Vishny (1992): \"Liquidation Values and Debt Capacity...\"\nFirst to emphasize/formalize fire sales. Illustrate with a parable:\nConsider indebted farmer with low current cash fiow.\nCannot reschedule debt or borrow more.\nMust liquidate (sell) the farm to pay back its creditors.\nPotential buyers:\nHigh valuation (specialists): Neighbor farmer.\nLow valuation (non-specialists): Convert to baseball field\nNeighbor is simultaneously distressed (industry wide shocks) and\nthus she is also borrowing constrained.\nThe farm is sold to low valuation user at a fire sale price (much\nlower than the value at best use, Qideal ).\nAlp Simsek ()\nAmplification Mechanisms\n\nFire sales happen in real assets such as farms or houses\nCampbell, Giglio, Pathak (AER, 2011), \"Forces Sales and House\nPrices.\"\nThey analyze house sale prices in Massachusetts between 1987-2009.\nThey investigate sale prices around events that might plausibly\ninvolve fore sales: the death or bankruptcy of owner, the foreclosure\nby a bank.\nThey compare the sale price relative to price of comparable houses...\nAlp Simsek ()\nAmplification Mechanisms\n\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of John Y. Campbell, Stefano Giglio, and Parag Pathak. Used with permission.\n\nTiming of plausibly forced house sales\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of John Y. Campbell, Stefano Giglio, and Parag Pathak. Used with permission.\n\nPlausibly forced sales are associated with lower prices\nThe timing for bankruptcy sales is especially indicative of a fire sale\nmechanism (as opposed to other factors, e.g., poor maintenance).\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of John Y. Campbell, Stefano Giglio, and Parag Pathak. Used with permission.\n\nThe price discount is particularly large for foreclosures\nEspecially large discount for foreclosures. This supports fire sales, but\nread the paper for other contributing factors (vandalism etc).\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of John Y. Campbell, Stefano Giglio, and Parag Pathak. Used with permission.\n\nHow about financial assets? Slow moving capital\nFire sales can also happen in financial assets such as bonds, CDOs...\nWith financial assets, another contributing factor to fire sales is that\nthere might be few specialists (or neighbors) to begin with.\nThis is especially the case for niche and complex financial assets that are\nharder to price (require more effort/research etc).\nWe expect there to be enough specialists to absorb \"reasonable\" sales\nor purchases that happen in regular days.\nBut an unusually large sale could create havoc.\nOther specialists would eventually come in, but this takes time.\nThis is known as slow-moving capital (referring to specialist capital).\nAlp Simsek ()\nAmplification Mechanisms\n\nEvidence on fire sales/slow moving capital\nEmpirical studies show there can be fire sales also in financial markets.\nNext slide is an illustration from Mitchell, Pedersen, Pulvino (2007).\nConvertible bonds: Complex asset with a formula for fair valuation.\nConvertible hedge funds: Specialize in valuing these assets.\nIn 2005, they had to lower their positions due to financial problems.\nHow did these fire sales affect the price of convertible bonds?\nAlp Simsek ()\nAmplification Mechanisms\n\nConvertible arb HFs reduce their positions due to losses and redemptions.\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of Mark Mitchell, Lasse Heje Pedersen, and Todd Pulvino. Used with permission.\n\nOther investors did not immediately step in (since highly specialized) and\nthe price fell below the theoretical value for an extended period.\nMulti-strategy HFs eventually step in (previous slide) but takes time.\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of Mark Mitchell, Lasse Heje Pedersen, and Todd Pulvino. Used with permission.\n\nFire sales generate further amplification\nTo learn more about fire sales, read the survey by Shleifer-Vishny.\nKiyotaki and Moore (1997), \"Credit Cycles\" illustrate that fire sales\ncan generate further amplification.\nWe can illustrate this in our framework. We had the example,\nI1 =\nN1 where N1 = 20R1 - 19.\n1 - ρ1\nWe also mentioned that\nQ1 + D1\nR1 =\n.\nQ0\nAlp Simsek ()\nAmplification Mechanisms\n\n|{z}\nz }| {\nFire sales generate further amplification\nNow let us add the assumption that asset prices are given by:\n⎛\n⎞\nfire sale infiuence\nQ1 =\nQ1\n⎝1 +\nGQ (I1)\n⎠ .\nfactors exogenous to our model\nHere, GQ (·) is an increasing function. Low I1 captures forced asset\nsales by the bank, which lowers GQ (I1) and the price.\nNormalize so that if bank were to break even at that 1 (so that\nN1 = N0), then we also have GQ (I1) = 0 and Q1 = Q1.\nAlp Simsek ()\nAmplification Mechanisms\n|{z}\nz }| {\n\n|{z}\nz }| {\nTaking Q0, D1 as constant (not our focus) this also implies,\nsupply-demand infiuence/fire sales\nD1 + Q1\nR1 =\n=\nR1\n+\nG (I1)\nQ0\nexogenous factors\nQ 1 GQ (·)\nfor some constant R1 and for some function G (·) =\n.\nQ 0\nNote that G (·) is also an increasing function. What is the intuition?\nEarlier analysis is special case with G (I1) = 0 and unresponsive to I1.\nThe responsiveness of G (·) captures the severity of fire sales.\nWhat is the effect of a 1% shock on net worth in this case?\nAlp Simsek ()\nAmplification Mechanisms\n|{z}\nz }| {\n\nz}|{\nz}|{\n|\n{z\n}\n|\n{z\n}\nFire sales generate further amplification\n⎛\n⎞\n1% drop =⇒\nlarge drop (why?)\n⎜\n⎝\n⎟\n⎠\nN1 = 20\nR1 + G\n(I1)\n- 19 .\nMore than 1% drop. Why?\nMore than 20% drop. Why?.\nWhat is the intuition behind the bottom two lines?\nSo fire sales create further amplification.\nThe drop in N1 further reduces investment I1 (why), repeating the\nmechanism and triggering downward spiral...\nAlp Simsek ()\nAmplification Mechanisms\nz}|{\nz}|{\n|\n{z\n}\n|\n{z\n}\n\nFire sale and NW channels trigger a spiral\nAlp Simsek ()\nAmplification Mechanisms\n\nSummary of amplification mechanisms\nPutting everything together, we have (for the example):\n\nI1 =\nN1 =\n\n20 R1 + G (I1) - 19 .\n1 - ρ1\n1 - ρ1 R1\nThis illustrates three amplification mechanisms (find them!):\n1 Leverage generates amplified losses (or gains).\n\n2 Procyclical leverage, ρ1 R1 , generates further amplification.\n3 Fire sales, G (I1), generate further amplification.\nAlp Simsek ()\nAmplification Mechanisms\n\nFigure: From Brunnermeier (2009), \"Deciphering The Liquidity And Credit\nCrunch 2007-2008\".\nNext: Case study (LTCM) that illustrates some of the mechanisms.\nUsing Jorion (2000), \"Risk Management Lessons from LTCM.\"\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of Markus K. Brunnermeier. Used with permission.\n\nRoadmap\nAmplification from high leverage\nAmplification from procyclical leverage\nFire sales and amplification\nThe LTCM crisis of 1998\nAlp Simsek ()\nAmplification Mechanisms\n\nA cautionary tale of high leverage: LTCM\nThe hedge fund, LTCM, was founded in 1994 by star trader John\nMeriwether and other traders who left Salomon Bros. after 1991.\nBob Merton and Myron Scholes (Nobelists) joined them.\nThey did relative value arbitrage: Find two very similar assets, buy\nthe cheap one, and (short) sell the expensive one:\nOn-the-run vs. off-the-run Treasuries,\nMortgage-backed securities (MBS) vs. treasuries,\nHigh-yield vs. low-yield bonds in the Euro area.\nThese strategies make profit if the prices of two assets converge.\nBut they (temporarily) make losses if prices diverge further. Why?\nAlp Simsek ()\nAmplification Mechanisms\n\nLTCM had great success in early years\nLTCM strategies deliver high returns only if leveraged.\nCapital $5-7 billion in 1996-97.\nTotal assets about $125 billion, so 25:1 leverage.\nFees were 2% of capital + 25% of profits ($1.5 billion in 1997).\nPrices indeed converged and they had a great run for a while.\nBut this also meant they ran out of investment opportunities.\nAt the end of 1997, LTCM returned $2.7 billion to investors...\nAlp Simsek ()\nAmplification Mechanisms\n\nHistory of spreads\nAlp Simsek ()\nAmplification Mechanisms\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nLTCM's leverage and asset growth\nReturning capital (lowering N0) brought leverage ratio back to 25.\nIn retrospect, this was not a very prudent thing to do. Why?\nAlp Simsek ()\nAmplification Mechanisms\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nCrisis in 1998: The shock\nPreliminary problems in May and June 1998 from falling MBS prices\n(16% loss from end 1997).\nAugust 17, 1998 Russia announced surprise debt restructuring.\n\"Flight to liquidity\": prices of most fixed income assets declined.\n=⇒ Additional losses (by August, 52% loss).\nLTCM had about N0 =$5B. Invested in about I0 =$125B.\nHow much should R1 fall (from 1) for LTCM to lose about 50%?\nThis is the first amplification channel we discussed!\nAlp Simsek ()\nAmplification Mechanisms\n\nLeverage amplified LTCM's losses\nAfter 50% loss, LTCM's net worth is down to about $2.5B\nThese losses force LTCM to reduce its asset holdings:\nI1 =\nN1 ' $62.5B, much smaller than $125B.\n1 - ρ1\n(This assumes ρ1 ' ρ0 ' 25. If leverage ratio was procyclical, then\nthe required reduction is even larger. Why?)\nAlp Simsek ()\nAmplification Mechanisms\n\nRaising capital is another possibility but not easy\nAs an alternative to reducing I1, LTCM also tried to increase N1 by\nraising capital, i.e., bringing in new owners to the fund.\nWe ruled this possibility out in our model.\nAlso diffi cult in practice, especially in times of turmoil.\nLTCM sought additional capital but obtained none.\nNo-one wants to put money into a fund that just lost 52%!\nIt did not help that they force-returned capital earlier.\nSo LTCM has to reduce I1, i.e., sell about $60B of its assets....\nAlp Simsek ()\nAmplification Mechanisms\n\nLarge asset sales reduce prices further\nAsset sales by LTCM further reduce prices. Why?\nPrice falls might have been accelerated by predatory trading.\nBusiness Week (February 26, 2001): \"If lenders know that a hedge\nfund needs to sell something quickly, they will sell the same\nasset- driving the price down even faster. Goldman Sachs & Co. and\nother counterparties to LTCM did exactly that in 1998.\"\nPredatory trading might be another reason why specialists were out.\nBut this is somewhat speculative (Goldman denies allegations).\nEven without this, we would expect the price to drop. Why?\nThe declining price falls further increase LTCM's losses.\nSeptember 23 bailout organized by Federal Reserve Bank of New York\n(92% loss).\nAlp Simsek ()\nAmplification Mechanisms\n\nLTCM dramatically loses almost all net worth\nAlp Simsek ()\nAmplification Mechanisms\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nTaking stock: Some lessons from LTCM\nHigh leverage creates fragility, even if you have a genius team!\nSmall price movements/unexpected events can generate large losses.\nThese losses induce fire sales and induce price drops/further losses.\nProcyclical leverage might further exacerbate these losses.\nAlp Simsek ()\nAmplification Mechanisms\n\nTaking stock: Some lessons from LTCM\nA view of the subprime crisis: Many LTCMs failing simultaneously!\nAlp Simsek ()\nAmplification Mechanisms\nCourtesy of the U.S. Securities and Exchange Commission. This image is in the public domain.\n\nNext time: Why do financial institutions make losses?\nBut why did LTCM or other institutions make these losses?\nWe will continue our discussion of LTCM next time.\nFinish reading the LTCM case. Also start reading the Bear\nStearns/JP Morgan case. Can read pages 1-8 (until the section on\nfinancial stresses).\nAlp Simsek ()\nAmplification Mechanisms\n\nTaking stock: Amplification mechanisms\nThere are more amplification mechanisms that we will see next week.\nLeverage, procyclical leverage, fire sales are important ones.\nAlso help us understand why shocks to banks particularly damaging.\nBanks are leveraged and subject to fire sales (specialized assets).\nTech bubble bust much milder since investors in tech stocks (like you\nand me) are not highly leveraged. Losses are contained.\nSubprime crisis much more severe since the losses are amplified!\nAlp Simsek ()\nAmplification Mechanisms\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4: Understanding Banks’ Losses: Moral Hazard or Mistakes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/21758d0c268eb7f87c10c9a250bfd094_MIT14_09IAP16_lec4_edit.pdf",
      "content": "'\n14.09: Financial Crises\nLecture 4: Understanding Banks'Losses: Moral Hazard\nor Mistakes\nAlp Simsek\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWhy do financial institutions make losses?\nKey question for policy: The causes of bank losses.\nTwo competing hypotheses:\nMistakes: Optimism and neglected risks\nMoral hazard (of various forms).\nToday: Formalization, and comparison in the context of the recent crisis.\nLet us set the stage by analyzing LTCM's losses...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRoadmap\nMistakes: Optimism and neglected risks\nMoral hazard and reckless risk taking\nEmpirical evidence on insiders'beliefs\nRevisiting moral hazard: Franchise value\nRevisiting moral hazard: Looting\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWhat caused LTCM's losses?\nAlp Simsek ()\nUnderstanding Banks Losses\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'\nLTCM's strategy: Relative value arbitrage\nRecall that LTCM used relative-value trades with high leverage.\nFind two very similar assets, A and B, that trade at prices pA < pB .\nBuy A and sell B. Cash in when the prices converge.\nBut shouldn't similar assets already trade at similar prices?\nThat would be the case in an ideal world, but reality is a bit messier...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRelative arbitrage opportunity: Siamese twins\nLamont and Thaler (2003), \"Anomalies: The Law of One Price...\"\nRoyal Dutch and Shell are stocks of the same company Royal\nDutch/Shell.\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of American Economic Association. Used with permission.\n\n'\nRelative arbitrage is risky business\nPrices can be driven apart by preferences of investors for one stock\nover the other (e.g. because one stock is an index constituent and the\nother is not).\nArbs like LTCM can try to profit from this. But not completely\nriskless.\nIt would be riskless if the arbs could hold the position forever.\nBut HFs have quite short horizons (redemptions in case of losses).\nAs Keynes said, \"in the long run we are all dead\" (including the Arbs).\nSo the risk is that mispricing will worsen before prices eventually\nconverge.\nThe risk is quite serious for stocks (as you see from the graph)\nbecause there is no fixed date at which we can anticipate correct\nvaluation.\nBonds that have fixed maturity are a little less risky but still risky.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nLTCM's strategy: Relative value arbitrage\nThe success of LTCM's trades relied on two principles:\n1 Hedging: Correlations within a pair, (A, B), being high. Why?\nSo that pA and pB move together and pA - pB does not fiuctuate\nmuch.\n2 Diversification: Correlations across different such pairs being low.\nThis ensures that \"you did not put all your eggs in a single basket.\"\nRisks can be much larger if these correlations are mismeasured, or if\nthey change.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nLTCM trades not well hedged\nIt seems that correlations within pairs were overestimated.\nThis leads to much larger risks than thought: A reduction in long\nasset prices not matched by a reduction in short asset prices leads to\nlarge losses in view of leverage.\nAlp Simsek ()\nUnderstanding Banks Losses\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'\nLTCM trades not well diversified\nReturns explained by a single factor =⇒ Correlations across pairs\nwere underestimated.\nAlp Simsek ()\nUnderstanding Banks Losses\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'\nSo why did LTCM make losses?\nSo LTCM made mistakes- large blunders in risk management.\nNarrative accounts, e.g., Jorion, suggest that this was due to a form\nof optimism: They neglected subtle risks (too much focus on recent\ndata etc.)\nBut there is a more ominous alternative: Perhaps LTCM was careless\nbecause it anticipated a government bailout.\nLet us formalize the bailout argument and contrast with mistakes...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRoadmap\n1 Mistakes: Optimism and neglected risks\n2 Moral hazard and reckless risk taking\n3 Empirical evidence on insiders'beliefs\nRevisiting moral hazard: Franchise value\nRevisiting moral hazard: Looting\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nHow about moral hazard?\nThe moral hazard arguments take various forms:\n1 Compensation contracts: Poor incentives for traders.\n2 Borrowing contracts: Risk taking at the expense of financiers.\n3 Government guarantees: Poor incentives for the institution as a\nwhole.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nHow about moral hazard?\n1 and 2 are always an issue (MH is a fact of life), which is why the market\nhas also devised various checks against them:\nTraders'activity monitored by managers/risk management divisions...\nRisk taking monitored by banks, restricted by collateral/debt\ncovenants...\n(Recall the H-T model: MH restricts ρ but does not result in risk\ntaking!)\nThe government has no comparative advantage in dealing with 1 and 2.\nFocus on 3: Moral hazard caused by the government's presence itself.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nA framework for thinking about moral hazard\nFor simplicity, suppose ρ = 0: The pledgeability is so low that the\nbank invests only its own money. We will discuss ρ > 0 later.\nThe bank insiders start with N0 and choose the type of project:\nSafe\nRisky\nHigh state\nR1\nRH\n1 > R1\nLow state\nR1\nRL\n1 = 0\n.\nThe normal project gives R1 regardless of the state\nThe risky project returns higher in H but lower in L.\nR1\nL = 0 for simplicity, but can also imagine as capturing amplification.\nLet π ≥ 0 denote probability the bank assigns to low state L.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nInterpretation of the framework\nOne interpretation for the recent crisis:\n\"Safe\": Holding prime mortgages or other safe investments.\n\"Risky\": Holding subprime mortgages.\nLow state: A large decline in the nation-wide house price index.\n(See Gerardi, Sherlund, Willen (2008), \"Making Sense of the Subprime\nCrisis.\": They claim Banks understood that a price drop would create\nlosses, but they underestimated the probability of a large decline.)\nAn equivalent interpretation:\n\"Safe\": Holding subprime mortgages plus CDS insurance.\n\"Risky\": Holding subprime mortgages without CDS insurance.\nYou can also provide similar interpretations for the LTCM episode.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWarm-up to MH: Without government, banks behave\nTo formalize moral hazard, suppose the parameters are such that\nRH\n1 - R1\nR1 > (1 - π) RH or equivalently π >\n.\n(1)\nRH\nBanks assign suffi ciently high probability to L that, absent government\nintervention, it is not profitable to keep a risky balance sheet.\nSo without government, banks don't take risk. No crisis!\nLet us introduce government into the analysis.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nBailouts: Government injects funds into banks\nImagine state L is realized so that the bank's net worth is, NL = 0\nWhat happens to banks'investment, I1\nL? What happens to loan to\nfirms?\nSuppose the government can transfer wealth from financiers to banks.\nWould the government want to do that? Why?\nBailout: Suppose the government transfers money to bank in state L,\nwhich raises the bank's effective return to some R1\nL,bail > 0.\nThe transfer is financed by taxing financiers.\n(In practice, bailouts work somewhat differently. Will come back.)\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWith government transfer: Banks might misbehave\nSuppose the parameters also satisfy,\n+ πRL,bail\nR1 < (1 - π) RH\n.\nThe bailout is suffi ciently large to make the risky project attractive.\nAnticipating the government bailout, the bank chooses to take risk.\nGovernment bailout creates (or at the very least exacerbates) crises!\nThis is also known as \"heads I win, tails you loose\" principle.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nA strict no-bail-out-ever policy could prevent crises\nIf we could commit to setting RL,bail = 0, the crises would be averted!\nThis type of commitment is diffi cult since it would be very costly for\nthe economy in state L. In economics lingo, the policy is\ntime-inconsistent.\nBut suppose you could get around time-inconsistency, say by enacting\nlaws that make bailouts very diffi cult. Would you want that?\nWhat are some potential problems with this no-bail-out-ever policy?\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nThe policy is not robust to the alternative: Mistakes\nPolicy is not robust to the presence of neglected risks/mistakes.\nIn fact, neglected risks/mistakes provide a natural alternative to MH.\nTo illustrate this alternative using the above framework, suppose the\nconverse of assumption (1) holds, so that\nR1\nR1 < (1 - π) RH or equivalently π < 1 -\n.\nRH\nThe insiders believe state L is so unlikely that holding risk is profitable.\nThey choose \"risky\" even if RL,bail = 0- since they view L as unlikely.\nThey choose risky if they expect RL,bail > 0. Whether there is a\nbailout has a small impact on the bank's decisions since π is low.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRoadmap\nMistakes: Optimism and neglected risks\nMoral hazard and reckless risk taking\nEmpirical evidence on insiders'beliefs\nRevisiting moral hazard: Franchise value\nRevisiting moral hazard: Looting\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nHow to test optimism vs moral hazard?\nKey difference between the two explanations is the bank's belief\nabout crisis, π.\nMoral hazard: high π, deliberate risk taking. Mistakes: low π,\nneglected risks.\nIn the subprime context: The probability of a nation-wide decline in\nhouse prices.\nShouldn't banks have seen the collapse of the housing bubble coming?\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWasn't the housing bubble obvious? A graph showing housing prices between 1996 and 2012.\nHow could the banks have missed this? Surely, π must be large.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nBeware the wisdom-after-the-fact\nThe bubble is obvious only with hindsight. At the time, few people\nanticipated a large nation-wide decline in house prices.\nWatch \"The Big Short\". How many pessimists were there? How were\nthey treated by others- the conventional wisdom?\nDuring the boom phase, there are always justifications for high prices.\nReinhart and Rogoff (2009) call this \"This Time is Different.\"\nFor a narrative account, read the paper by Gerardi, Foote, Willen\n(2010): \"Reasonable people did disagree: Optimism and pessimism\nabout the US housing market before the crash\"\nWe need to do something more systematic to gauge the insiders'π.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nLessons from Titanic: A AAA-rated ship\nFrom Shleifer (2011), AFA address:\nWhen built, Titanic was described as the safest, largest ship ever.\nInsiders and financiers were on board: They believed it was safe.\nRadio operators ignored warnings of icebergs nearby.\nMany lifeboats on board, enough for 1/3 of passengers. Consistent\nwith regulation.\n1500 people died. Some rescue boats were not full. Almost all the\ncrew died.\nThe insiders of Titanic, as well as the regulators, seemed to have low π.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWere insiders on board during the subprime crisis?\nA similar analysis can help us to gauge π during the subprime crisis.\nLook at insiders'own portfolios, i.e., what they did with their money.\nMoral hazard, high π, suggests would be careful with own portfolio.\nMistakes, low π, suggest would take risks also with own portfolio.\nCheng, Reina, Xiong (AER, 2014) analyze personal housing\ntransactions of midlevel managers in securitized finance (CDOs etc)\nin 2004-2006.\nThey use equity analysts and lawyers as comparison groups...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of American Economic Association. Used with permission.\n\n'\nDivestiture: Sale of a home (could be second or first home),\nSecuritization managers were less likely to sell in 2004-2006.\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of American Economic Association. Used with permission.\n\n'\nThey were also more likely to buy a second home, or swap up into\nmore expensive home, well until 2008.\nThe results are robust to various econometric checks.\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of American Economic Association. Used with permission.\n\n'\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of American Economic Association. Used with permission.\n\n'\nSome insiders seem to be on board during the crisis\nThis suggests securitization managers were at least as optimistic\nabout housing as the general public,\no\n\no\n\nE insiders Qhouse ≥ E public Qhouse\n.\nThis rules out π ' 1: Insiders didn't see an imminent crash.\nIt does not definitively prove that π is low (which is not easy).\nBut reconciled more easily with π being low than π being high.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nHow about top management?\nAlp Simsek ()\nUnderstanding Banks Losses\nMa (2013): a similar exercise with bank CEOs.\nMain idea: More optimistic CEOs are less likely to exercise their\nbank's stock options, as well as to sell their stocks, essentially\nspeculating on their bank's success.\nProxy for optimism by using CEOs'exposures to own bank's equity\nin 2002-2006.\nMistakes/neglected risks suggest: Banks with more optimistic CEOs\n(indicative of low π) would have greater real estate exposures before\nthe crisis, and make greater losses during the crisis.\nA case study that compares two banks, US Bancorp (less optimistic CEO)\nand SunTrust (more optimistic CEO), illustrates Ma's more systematic\nresults.\n\n'\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of Yueran Ma. Used with permission.\n\n'\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of Yueran Ma. Used with permission.\n\n'\nMore optimistic CEOs'banks increased real estate loans by more.\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of Yueran Ma. Used with permission.\n\n'\nStock prices of the banks with more optimistic CEOs fell by more.\nThe more on board CEOs were, the deeper the ship did sink!\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of Yueran Ma. Used with permission.\n\n'\nMost insiders seem to be on board during the crisis\nThe evidence on beliefs is more consistent with mistakes (due to\noptimism and neglected risks) than moral hazard.\nThere are also other, more theoretical, reasons to be skeptical of the\nearlier version of the moral hazard argument.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRoadmap\nMistakes: Optimism and neglected risks\nMoral hazard and reckless risk taking\nEmpirical evidence on insiders'beliefs\nRevisiting moral hazard: Franchise value\nRevisiting moral hazard: Looting\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nProblems with the basic moral hazard argument\nThe basic MH argument is too extreme for a couple of reasons:\n1 Owners/shareholders do not necessarily benefit from a bailout...\nRead the HBS case study of JP Morgan and Bear Stearns.\nWhat happened to Bear's shareholders'wealth after the bailout?\nThe bailout did benefit Bear's creditors/financiers. Could formulate a\nmore sophisticated version with ρ > 0, and financiers make low\ninterest loans to Bear.\nMore reasonable. But still requires high π (by financiers as well\ninsiders).\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nProblems with the basic moral hazard argument\n2. Dynamic considerations might push against reckless risk taking.\nFranchise value: Future stable profits due to banking services.\nBanks'such as Bear Stearns and JP Morgan build franchise-reputation\nover time to provide (highly profitable) intermediation services...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nBear Stearns'revenue breakdown\nAlp Simsek ()\nUnderstanding Banks Losses\n(c) Harvard Business School. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'\nBear Stearns revenue breakdown\nThe revenues from fixed income (CDOs etc) are the largest.\nHowever, there are sizeable revenues also from other divisions, e.g.,\ninvestment banking, clearing services, wealth management...\nIf Bear didn't make losses in fixed income portfolio, it would\npresumably continue to make these other revenues year after year.\nThink of the franchise value V F as the present discounted value of\nthese revenues.\nAfter a failure and bailout, Bear insiders lose V F . They are transferred\nto JP Morgan (to the extent that they did not disappear altogether).\nWould franchise value make moral hazard more or less severe?\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nFranchise value can provide discipline against MH\nThink of the Bear management as comparing V F + R1N0, with\n\n+ πRL,bail\n(1 - π) R1\nHN0 + V F\nN0.\nChoose the safe action as long as\nnet profits from fixed income (one-time)\n\n+ πRL,bail\nπV F\n> (1 - π) RH\n- R1\nN0\npotential loss of franchise profits (forever)\n\nWhen π > 0, then V F pushes strongly against risk taking. The moral\nhazard argument more diffi cult to sustain.\nWhen π ' 0, V F has little effect. Mistakes due to neglected\nrisk/mistakes can cause crises even with high V F .\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nWhy did franchise value not discipline Bear Stearns?\nPage 12 of Bear Stearns case: \"Within the bond business,...,key\nlieutenants were in fierce disagreement over how best to manage the\nextent of Bear's mortgage related securities holdings. Bear's head of stock\nsales and trading, as well as the company's head of propriety trading,\nargued that the head of Bear's mortgage division needed to reduce his\nholding: \"Cut the positions, and we'll live to play another day,\" said the\nhead of proprietary trading. Schwartz, however, was reluctant to unload\nbillions of dollars worth at prices that seemed to be unreasonably low and\npossibly not refiective of their true value.\"\nThis paragraph illustrates the crux of the franchise value argument.\nAnd how FV discipline can be lost due to mistakes by top\nmanagement.\nSchwartz replaced Jimmy Cayne as CEO in January 2008.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nJP Morgan revenue breakdown\nAlp Simsek ()\nUnderstanding Banks Losses\n(c) Harvard Business School. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n'\nDid franchise value discipline JP Morgan?\nThe franchise value items appear to be even greater for JP Morgan.\nThis could be one reason why, Jamie Dimon (CEO), insisted on more\ncareful risk management and a \"fortress balance sheet\".\nLiquidity/capital exceeded regulatory requirements (and\ncompetitors')!\nNote also that JP Morgan acquired Bear assets (its franchise value)\ncheaply: There are rewards to being strong in a crisis!\nThis provides further discipline against moral hazard. Why?\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nDid Dimon see the crisis coming?\nEven JP Morgan made some losses in the mortgage market.\nPage 7: \"Looking back, Dimon noted that, \"Our biggest mistake was\nassuming that home prices would go up for a decade without losses.\nWe loosened up our standards. Once prices stopped rising, losses\nmounted. We need to write a letter to the next generation saying\nthat there's a reason why we loan only 80% LTV on a home.\"\nSo even Dimon did not fully see the crisis coming.\nBut he seemed to have the sense that something could go wrong (π\nrelatively high) in a complex economic environment and company.\nMa (2013): Heterogeneity in π also refiected in CEOs'own portfolio...\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nMa (2013): \"The patterns in Table 10 are also consistent with (the\nearlier results for commercial banks). CEOs at the worse-performing\nbanks generally had larger ex ante increases in equity holdings, while\nCEOs at the better-performing banks had smaller increases.\"\nThe exception is Dick Fuld of Lehman Brothers.\nAlp Simsek ()\nUnderstanding Banks Losses\nCourtesy of Yueran Ma. Used with permission.\n\n'\nTaking stock from franchise value and MH\nV F provides discipline against moral hazard, especially when π is high.\nMakes it harder to have crises with high π and reckless risk taking.\nThis also suggests moral hazard can be a real concern when V F is\nlow.\nV F could be low, for instance, if the bank is almost sure to fail\nregardless of its actions (it had already made big mistakes and too\nlate to save).\nIn these cases, a more sinister version of MH can apply: Looting.\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nRoadmap\n1 Mistakes: Optimism and neglected risks\n2 Moral hazard and reckless risk taking\nEmpirical evidence on insiders'beliefs\nRevisiting moral hazard: Franchise value\n5 Revisiting moral hazard: Looting\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nLooting: An extreme version of MH\nLooting (loosely): Extracting value directly (paying dividends to\nowners, transferring money to friends etc) from a bank that is very\nlikely to fail.\nExtreme MH: Transfer at date 0 as opposed to state H of date 1.\nAkerlof and Romer (1993): Looting might be relevant for the Savings\nand Loan crisis of 1980s (as well as other crisis episodes in other\ncountries).\nAlp Simsek ()\nUnderstanding Banks Losses\n\n'\nLooting/MH during the S&L crisis?\nMany thrifts (small banks) were or close to being bankrupt in 1980s.\nThey were also not profitable due to increased competitiveness earlier.\nThese observations suggest that their V F might have been quite low.\nRegulatory action was delayed, and the ultimate cleanup happened\nonly in late 1980s and early 1990s. MH is a real concern.\nCombined with a lack of accountability, looting could well be an issue.\nLessons:\nBeware of moral hazard in situations with low franchise value.\nMH during a crisis (as opposed to before) might be a bigger concern.\nSwift regulatory action/bailout can actually mitigate moral hazard!\nAlp Simsek ()\nUnderstanding Banks Losses\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5: Maturity Mismatch and Bank Runs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/3b2321c0f434296ecb400e1a44b377d8_MIT14_09IAP16_lec5_edit.pdf",
      "content": "14.09: Financial Crises\nLecture 5: Maturity Mismatch and Bank Runs\nAlp Simsek\nAlp Simsek ()\nLecture Notes\n\nLiquidity and financial panics\nSo far: Focus on leverage and amplification channels.\nOur story is missing a key feature of crises, \"panic.\"\nPanic can be thought of as a sudden shift in financiers'behavior that\ninduces them to reduce their lending to banks/institutions.\nThus, the spotlight on the next few lectures will be on Fs:\nThey might need \"liquidity\" (Diamond-Dybvig model)\nThey might seek \"safety\" (Holmstrom-Gorton-Geanakoplos...)\nThey might be institutions, with own problems (Shin-Caballero...)\nWe will formalize 1 today, and will come back to 2 and 3 later.\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nMaturity mismatch and illiquidity\nLiquidity pooling and bank runs\nPotential solutions to bank runs\nApplying bank runs in modern financial markets\nAlp Simsek ()\nLecture Notes\n\nTwo mismatches: Risk and maturity\nAlp Simsek ()\nLecture Notes\nThe instructor's calculations based on the Federal Reserve Statistical Releases.\n\nTwo mismatches: Risk and maturity\nBank balance sheets can be viewed as featuring two mismatches:\n1 Risk mismatch: Relatively risky assets, relatively safe liabilities/debt.\nWe saw how this can create fragility (especially with high leverage).\n2 Maturity mismatch: Longer-maturity assets, shorter-maturity\nliabilities....\nAlp Simsek ()\nLecture Notes\n\nMaturity mismatch\nBank assets typically make small payments spread over a long\nhorizon. Imagine receiving 30-year mortgage loan from the bank.\nBank liabilities typically make promises over a much shorter horizon:\nImagine making a deposit in a checking/savings account.\nThe discrepancy is known as the maturity mismatch.\nThe maturity mismatch also creates the possibility of illiquidity...\nAlp Simsek ()\nLecture Notes\n\nLiquidity of an asset: Ease of converting into cash\nRecall that the value of a financial asset with a long horizon is,\nQideal ' Present discounted value of future payoffs.\nLiquidity of a financial asset (broadly speaking): How easily can the\nasset be converted into cash in a short amount of time.\nHow close a value can I get to Qideal over a short amount of time.\nAlp Simsek ()\nLecture Notes\n\nLiquidity is arguably low for nontraded assets\nSo liquidity is closely related to the fire sales that we discussed.\nFor traded assets (such as stocks, bonds, houses), fire sales is a\nsituation in which liquidity \"dries up\" relative to normal times.\nFor assets that are not regularly traded in financial markets, liquidity\nis a greater concern. Hard to sell even in normal times.\nHistorically, bank assets (mortgages etc) not regularly traded.\nAlp Simsek ()\nLecture Notes\n\nLiquidity can also be low for traded bank assets\nTrading costs dramatically declined in recent years (IT revolution etc).\nThis has converted more bank assets into marketable securities.\nAn example is securitization, which converts traditionally illiquid bank\nassets (e.g. mortgages/loans) into marketable securities (CDOs etc).\nNote that bank assets are typically debt-like (someone else's debt).\nDebt-like securities can be liquid in normal times, but their liquidity\ncan also dry up very quickly at times of uncertainty. Will come back.\nThus, illiquidity is arguably a concern even if bank assets are traded.\nAlp Simsek ()\nLecture Notes\n\nDanger zone: Maturity mismatch with illiquid assets\nCombination of maturity mismatch and illiquid assets an be\ndangerous.\nDiamond and Dybvig (1983): Formal analysis of this danger zone:\nWhy do the banks feature a maturity mismatch to begin with?\nHow does this arrangement create fragility/runs/panics?\nWhat should the policy should do about this?\nOur goal today: Illustrate the DD ideas using a stylized model.\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nMaturity mismatch and illiquidity\nLiquidity pooling and bank runs\nPotential solutions to bank runs\nApplying bank runs in modern financial markets\nAlp Simsek ()\nLecture Notes\n\nA model of banks and financiers\nConsider a model with a number of banks (B) and a large number of\nfinanciers (F) as before.\nIn this case, there are three periods, {0, 1, 2}.\nDate 0 is when investments are done as before.\nDates {1, 2} (previously date 1) when returns might be realized.\nFs have resources at date 0 as before, say 1 dollar each.\nFs have no resources at other dates (for simplicity).\nBs have no resources (can incorporate N0 but not necessary).\nAlp Simsek ()\nLecture Notes\n\nNew ingredient: Fs are subject to liquidity shocks\nPreviously, we assumed the preferences were, C0 + C1 + C2.\nWe now assume Fs might experience a liquidity shock at date 1.\nWith probability λ (say 10%), must consume at least C 1 at date 1.\nHard constraint for simplicity- imagine very low utility if C1 < C 1.\nAssume also that C 1 = 1. Not necessary but simplifies the math.\nWith probability 1 - λ, linear preferences as before C0 + C1 + C2.\nThe liquidity shocks are independent draws. With a large number of\nFs, the fraction of Fs that will have a liquidity shock is exactly λ.\nAlp Simsek ()\nLecture Notes\n\nProject choice: Liquidity-return trade-off\nSuppose there are two types of projects at date 0:\nLiquid (e.g., cash): Investing 1 dollar yields 1 dollar at the next date.\nIlliquid (e.g., loan): Investing 1 dollar yields R > 1 (say 1.5) at date 2\nif completed, but it yields l < 1 (say 0.5) if liquidated at date 0.\nFirst suppose there are no banks and each F is on its own.\nCan hold cash or (unrealistically) make loans. What would she do?\nAlp Simsek ()\nLecture Notes\n\nWithout coordination, liquidity is wasted\nOn her own, each F would put C 1 into cash, and 1 - C 1 into loans.\nThis ensures she can consume C 1 = 1, when she needs.\nIn the numerical example, invest everything in the liquid asset!\nBut the liquidity shock happens only 10% of the time. Most of the\ntime, she would have excess liquidity at date 1 that she doesn't need.\nIf you were a social planner, what would you ideally want to do here?\nAlp Simsek ()\nLecture Notes\n\nIdeal arrangement: Liquidity pooling\nInvest only the minimally necessary amount in cash, λC 1.\nIn the numerical example, invest the fraction, λ = 10%, in cash and\nthe remaining fraction, 1 - λ = 90%, in loans.\nReturn from loans (at date 2) is given by, R (1 - λ) = 1.5 × 0.9.\nWe could give this to Fs without liquidity shock, so that:\nFs who receive a liquidity shock at date 1 consume C 1 = 1.\nFs don't receive a liquidity shock consume C2 = R = 1.5.\nRecall that C2 (1 - λ) = R (1 - λ) so the resource constraints hold.\n(Other arrangements for date 2 also possible since linear utility).\nAlp Simsek ()\nLecture Notes\n\nBanks can implement the ideal outcome\nThe agents in our model can also implement this outcome.\nSuppose the banks are perfectly competitive (for simplicity).\nThey compete to provide the most attractive contract to Fs.\nWe can then show there is a competitive equilibrium in which:\n1 Each B offers the following (ideal) contract to each F:\nF can deposit 1 dollar to the bank at date 0.\nCan withdraw C 1 = 1 at date 1.\nOr can wait and withdraw C2 = 1.5 at date 2.\n2 Each F accepts a bank contract (better than investing herself).\n3 Each bank attracts a large number of Fs (so has suffi cient liquidity).\n4 Fs withdraw only if they actually receive a liquidity shock.\nAlp Simsek ()\nLecture Notes\n\nDiscussion: Bank liabilities and liquidity pooling\nThe contract in this equilibrium resembles various types of bank\nliabilities in practice: saving deposits, term deposits, short term debt...\nSo the model illustrates another function of banks: liquidity pooling.\nSometimes referred to as liquidity creation/maturity transformation.\nBanks help the economy to invest in less liquid but profitable projects,\nwhile meeting the liquidity demand from consumers/firms etc.\nAlp Simsek ()\nLecture Notes\n\nLiquidity pools, investment specialists, or both?\nIn practice, banks are also investment specialists as we discussed\nbefore. They can identify/monitor projects better than Fs.\nBut the two roles don't confiict with one another.\nInvestment specialist is a function (largely) on the asset side of banks.\nLiquidity pooling/creation is a function (largely) on the liability side.\nAlp Simsek ()\nLecture Notes\n\nResulting maturity mismatch creates a source of fragility\nLiquidity pooling provides an explanation for the maturity mismatch.\nBut the mismatch also makes the bank somewhat fragile. Why?\nThis is nicely illustrated in the popular movie, It's a Wonderful Life.\nSee for yourself:\nhttps://www.youtube.com/watch?v=EOzMdEwYmDU\nAlp Simsek ()\nLecture Notes\n\nCan we capture bank runs in our model?\nRecall in the equilibrium we had:\n4. Fs withdraw only if they actually receive a liquidity shock.\nCould it make sense for Fs that don't need liquidity also to withdraw?\nTo address this, we need to specify payoffs in these contingencies.\nLet λˆ ≥ λ denote the total withdrawals. λˆ - λ is unforced\nwithdrawals.\nRecall the bank promised C 1 = 1, C2 = 1.5 for early&late withdrawals.\nBut it might be unable to meet these promises if λˆ exceeds λ.\n\nLet\nC1\nλˆ\n, C2\nλˆ\ndenote the actual payoffs conditional on λˆ....\nAlp Simsek ()\nLecture Notes\n\nBanks'decisions after unforced withdrawals\nThe bank has cash (λ) just enough to meet forced withdrawals.\nThe bank can also liquidate loans to obtain l = 0.5 < 1 at date 1.\nSuppose a bank that faces unforced withdrawals liquidates loans to\nmeet them, as long as it is possible to do so.\nWe can calculate the payoffs, (C1\nλˆ\n, C2\nλˆ , explicitly...\nAlp Simsek ()\nLecture Notes\n(\n)\n( ))\n\nLate payoffs after unforced withdrawals\nWhen λˆ - λ is not too high, we have C1 λˆ\n= 1 but\nˆ\n1 - λ - λ - λ\nl\nˆ\nC2 λ\n= R\n1 - λˆ\n\nˆλ - λ\n1.5\n1 -\n- 1\n=\n1 - λˆ\nl\n⎞\n⎛\n\nunforced withdrawals\n:\n\n⎜\n⎜\n⎜\n⎝ 1 -\n⎟\n⎟\n⎟\n⎠\nˆλ - λ\n1.5\n- 1\n(1)\n=\nl\n1 - λˆ\n\ncost of withdrawals\n:\nThe bank meets the unforced withdrawals but at great cost to\ndepositors that withdraw late. Why is the cost so large?\nAlp Simsek ()\nLecture Notes\n\nLate and early payoffs after unforced withdrawals\nWhen λˆ - λ is even higher (here, λˆ ≥ 0.55) the bank is forced into\nliquidating everything.\nIn this case, the late depositors receive nothing,\nˆ\nC2 λ = 0\nand the early depositors receive less than promised,\nˆ\nλ + (1 - λ) l\n0.55\nC1 λ =\n=\n< 1.\nˆ\nˆ\nλ\nλ\nThe math is not important. What matters is the qualitative effects,\nwhich we can illustrate pictorially (combining both cases)...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nUnforced withdrawal decisions are complementary\nC1 λˆ\n- C2 λˆ\ncaptures the incentive of an F to withdraw unforced.\nNote C1 λˆ\n- C2 λˆ\nis increasing in λˆ (in a neighborhood of λ).\nIn economics jargon, unforced withdrawals are complementary.\nThe more I do an unforced withdrawal, the more I force (ineffi cient)\nliquidations on the bank, and the more I incentivize you to do so.\nThis type of complementarity can lead to multiple equilibria...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nBad equilibrium formalizes bank runs/panics\nSo the earlier liquidity pooling equilibrium still works.\nWhen no-one withdraws, it doesn't make sense to withdraw.\nBut our analysis uncovered an additional possibility: When everyone\nwithdraws, it becomes indeed reasonable to withdraw!\nThe bad equilibrium can be interpreted as a bank run.\nIt provides one formalization of a financial panic.\nIt also suggests some potential policy interventions...\nAlp Simsek ()\nLecture Notes\n\nRoadmap\n1 Maturity mismatch and illiquidity\n2 Liquidity pooling and bank runs\n3 Potential solutions to bank runs\n4 Applying bank runs in modern financial markets\nAlp Simsek ()\nLecture Notes\n\nPotential solution: Suspension of convertibility\nSuspension of convertibility: (Used quite a bit in history.)\nSuppose, the bank temporarily shuts down after λ withdrawals.\nGives C 1 to first λ withdrawals but then stops serving withdrawals.\nThe bank reopens at date 2, and pays the remaining Fs C2 = 1.5.\nIn the model, this kills the bank run equilibrium. Solves the problem!\nIn practice, this \"solution\" is problematic for many reasons. Why?\nAlp Simsek ()\nLecture Notes\n\nPotential solution: Lender of last resort (LLR)\nLender of last resort (LLR): (Many examples in history.)\nSuppose the central bank (e.g., the Fed) has resources at date 1,\nultimately backed by the taxation power of the government.\nCB lends to the bank at rate, 1 + r ∈ [1, R], say r = 50%.\nWhen the bank faces withdrawals, λˆ - λ, it now chooses to borrow\nfrom the CB as opposed to liquidating projects. This implies,\nR (1 - λ) - (1 + r) λˆ - λ\nˆ\nC2 λ\n=\n1 - λˆ\nˆλ - λ\n= R +\n(R - (1 + r))\n1 - λˆ\n= 1.5.\nUnforced withdrawals are less costly in this case. Why?\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nLLR eliminates the bank run equilibrium\nThe bank run equilibrium disappears altogether!\nThe presence of the LLR circumvents ineffi cient liquidations- ensures\nthe Fs that withdraw late will not lose their shirts.\nOnce we switch to the good equilibrium, there are no unforced\nwithdrawals, λˆ = λ. LLR facility is not used at all!\nSo the main role of the LLR is preventive. Knowing that there is a\nLLR in place ensures depositors don't panic.\n(This is of course extreme. In practice, LLR could be used, e.g., if\nrealized λ unexpectedly turns out higher etc.)\nAlp Simsek ()\nLecture Notes\n\nLLR and the Bagehot's principles\nThe LLR function has been well understood- and used- historically.\nBordo (1990) on the reading list summarizes Bagehot's (1873)\nprinciples for the Bank (of England) to observe as LLR:\n1 Lend, but at a penalty rate: \"Very large loans at very high rates are\nthe best remedy for the worst malady of the money market...\"\n2 Make clear in advance the Bank's readiness to lend freely,\n3 Accommodate anyone with good collateral (valued at pre-panic\nprices),\n4 Prevent illiquid but solvent banks from failing..\nAlp Simsek ()\nLecture Notes\n\nDoes the LLR help to prevent panic?\nBordo (1990): Historical analyses of LLR and the runs/panics.\nBank of England: Accepted its role as LLR after the panic of 1866.\nThe US in the second half of the 19th century: No federal LLR.\nCompare the incidence of runs in the US and the UK between\n1870-1933...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nTable 1 from Bordo, Michael D. \"The lender of last resort: Alternative views and historical\nexperience.\" FRB Richmond Economic Review 76, no. 1 (1990): 18-29 removed due to\ncopyright restrictions. Please see https://www.richmondfed.org/-/media/richmondfedorg/\npublications/research/economic_review/1990/pdf/er760103.pdf.\n\nDoes the LLR help to prevent panic?\nThe table compares historical data from the US and the UK during severe\nbusiness cycle downturns.\nMacroeconomic aggregates such as real output growth from peak to\nthrough relative to trend (first column) are qualitatively similar.\nThe table suggests that large recessions/downturns are associated\nwith crises or panics in the US, but not necessarily in the UK.\nSimilar evidence for France, Germany, Sweden, and Canada: They\nall had LLRs and had no banking panics:\n\"In France, appropriate actions by the Bank of France in 1882,\n1889, and 1930 prevented incipient banking crises from developing\ninto panics. Similar behavior occurred in Germany in 1901 and 1931\nand Canada in 1907 and 1914.\"\nAlp Simsek ()\nLecture Notes\n\nFederal Reserve's role as the LLR\nThe Federal Reserve was founded in 1914 to serve as the LLR.\nIts role as the LLR precedes its role as price/macro stabilizer.\nGorton and Metrick (2013) argue that the Fed might have prevented\nthe panic that would have otherwise happened in 1920-1921\nrecession...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nGraph of Federal Reserve Credit extended from 1917-1935 removed due to\ncopyright restrictions. Please see Gorton, Gary, and Andrew Metrick (2013).\n\"The Federal Reserve and Panic Prevention: The Roles of Financial Regulation\nand Lender of Last Resort.\" Journal of Economic Perspectives 27, no. 4, p.45-64.\n\nFederal Reserve in the run-up to the Great Depression\nRead Gorton and Metrick (2013) for an interesting discussion of the\nFed's early attempts at figuring out the LLR function.\nInitially, loans were underpriced, so banks started to borrow\ncontinuously from the Fed- even when they were not in trouble.\nIs this consistent with the Bagehot's principle?\nIn mid-1920's, Fed created a \"reluctance to borrow\" (via rationing\netc).\nThis also created stigma: Borrowing from the Fed itself became a\nnegative signal about the bank's quality, because- given the\nreluctance policy- only weak banks would borrow!\nRuns can become more likely when the perception of R falls\n(appendix).\nSo the stigma is a real concern- has also come up in the recent crisis.\nAlp Simsek ()\nLecture Notes\n\nFederal Reserve during the Great Depression\nAlp Simsek ()\nLecture Notes\n-\nGorton and Metrick (2013) argue that the Fed failed to\nprevent the bank runs that happened in the 1930s\n(during the Great Recession), in part because of the\nstigma it created in the 1920s.\n-\nBanks were cautious and reluctant to borrow from the\nFed. The LLR function did not quite work as intended.\n-\nAfter this experience, the U.S. resorted to a stronger\nsolution to prevent runs: deposit insurance...\n\nPotential solution: Deposit insurance\nDeposit insurance: (Example, FDIC in the US implemented in 1933)\nSuppose the government has resources at date 1 as before (thanks to\nits taxation power), and it guarantees deposit contracts.\nTo be specific, let's say that the bank \"fails\" if it cannot pay at least\n1 to its early or late depositors (i.e., if C1 or C2 falls below 1).\nIf the bank fails, the government takes the bank over and redeems the\noriginal promises to depositors.\nEarly withdrawal receives C 1 = 1, late receives C2 = 1.5....\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nPotential solution: Deposit insurance\nAs in LLR, deposit insurance kills the bank run equilibrium.\nOnce we switch to the good equilibrium, withdrawals are λˆ = λ.\nThe deposit insurance is not used at all!\nSo like the LLR, the main role of deposit insurance is preventive.\n(This is of course extreme. In practice, deposit insurance could be\nused, e.g., if realized λ unexpectedly turns out higher etc.)\nAlp Simsek ()\nLecture Notes\n\nCourtesy of Gary Gorton. Used with permission.\nAlp Simsek ()\nLecture Notes\nIn the U.S., deposit insurance seemed to work as intended, FDIC was\ncreated in 1933. Bank failures dramatically declined and remained\nlow---until the S&L crisis of the 1980s.\n\nDeposit insurance and LLR can be potentially costly\nSo far, we painted a rosy picture of deposit insurance and LLR.\nIn the model, we assumed R > 1, the bank has a valuable project\n(the bank is solvent) but it can fail due to runs (or illiquidity).\nIn practice, hard to know if bank is insolvent, illiquid, or both.\nAn insolvent bank, R < 1, would also experience runs. In this case,\nthe deposit insurance (as well as the LLR) will make losses. Why?\nAlp Simsek ()\nLecture Notes\n\nDeposit insurance, LLR, and moral hazard\nThis also implies deposit insurance creates some moral hazard.\nAs we discussed in the last lecture, a bank can deliberately take risks\nand end up with RL < 1 in some states. FDIC absorbs the losses.\nFranchise value provides some discipline, but MH is a concern.\nThus, deposit insurance is typically complemented with insurance fees\npaid by banks as well as regulation of bank risks/leverage.\nThese are sound policies- up to a degree- regardless of whether\nmistakes or moral hazard is the ultimate cause of bank failures.\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nMaturity mismatch and illiquidity\nLiquidity pooling and bank runs\nPotential solutions to bank runs\nApplying bank runs in modern financial markets\nAlp Simsek ()\nLecture Notes\n\nShin (2009): A case study of Northern Rock\nStarts as a traditional mortgage bank. Rapid growth in assets starting\nin 1998 (following the decision to go public).\nNot exposed to the subprime mortgages- mostly in prime\nmortgages.\nBut nonetheless, experiences a bank run in 2007.\nThe first bank run in the UK since 1866 (Overend Gurney episode).\nAt first glance, looks like the textbook Diamond-Dybvig model.\nThere are, however, some major challenges when applying the theory...\nAlp Simsek ()\nLecture Notes\n\nDeposits are only small fraction of liabilities\nGrowth in assets financed by nontraditional types of liabilities.\nAlp Simsek ()\nLecture Notes\nCourtesy of Hyun Song Shin. Used with permission.\n\nSecuritized deposits not the main problem since long term.\nA decline in both retail deposits and wholesale funds. But...\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nDecline is in mostly nontraditional deposits (not branch accounts).\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nRetail deposits do not seem to be the real problem\nThe timing of the crisis is also inconsistent with deposits playing a\ncentral role.\nStressed start on August 9 when the short-term collateralized debt\nmarket almost froze.\nDepositor run much later (on September 14), and only after the\npublic announcement of support by Bank of England.\n\"Irony of TV images of depositors queuing at the branch offi ces was\nthat it was the branch deposits that were the most stable.\"\n\"The damage was already done well before the run by its retail\ndepositors.\"\n\"Although retail deposits can be withdrawn on demand, bankers have\nbeen heard to joke that a depositor is more likely to get divorced than\nto switch banks.\"\nAlp Simsek ()\nLecture Notes\n\nShort-term debt is the real problem\nAlp Simsek ()\nLecture Notes\nShin (2009) also argues that the real problem was in\nshort to medium term debt (which correspond to the\nwholesale funds in the earlier table).\nNorthern Rock saw large outflows of wholesale funds\nas maturing short to medium term loans and deposits\nwere not renewed.\n\nSome lessons from the Northern Rock\nWe will come back to this case for additional lessons in a few lectures.\nThe lesson so far is that modern markets are a bit different than the\npast.\nThe problem is nontraditional deposits or short term debt, often\nheld by other institutions, as opposed to traditional branch deposits.\nBut we could still apply the Diamond-Dybvig model, with some\nrelabeling:\nShort term debt (of various forms)\n-→\nDemand deposits.\nLarger institutional investors -→ Small financiers/depositors\nAlp Simsek ()\nLecture Notes\n\nApplying DD in modern markets\nSo DD model could be thought of as applying in spirit, if not in\ndetails.\nShort term debt provides liquidity to the financier-institutions.\nBut it creates fragility for the borrowing bank (or bank-like\ninstitution).\nIn fact, the problem is in a sense more severe because small deposits\nare explicitly insured by the government (e.g., the FDIC), but short\nterm debt (as well as large deposits) are not.\nThis is why many public intellectuals and regulators thought the DD\nmodel was a central feature of the crisis...\nAlp Simsek ()\nLecture Notes\n\nFrom Krugman's NY Times column on October 10, 2011:\n\"One of the great things about Diamond-Dybvig is that it immediately\npunctures any superficial notion that a bank can be defined by some\ntraditional appearance - that it basically has to be a marble building with\nrows of tellers, i.e. a depository institution. Any arrangement that borrows\nshort and lends long, that offers investors claims that are liquid while using\ntheir funds to make illiquid investments is a bank in an economic\nsense- and is potentially subject to bank runs. Indeed, what we had in\n2008 was mainly a run on shadow banks, on non-depository institutions.\"\nhttp://krugman.blogs.nytimes.com/2011/10/10/if-banks-are-\noutlawed-only-outlaws-will-have-banks/\nAlp Simsek ()\nLecture Notes\n(c) The New York Times Company. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nFrom Bernanke's speech at the Kansas Fed Symposium at Jackson Hole,\nSeptember 2009, \"Refiections on a Year of Crisis\":\n\". . . the events of September and October [2008] also exhibited some\nfeatures of a classic panic, of the type described by Bagehot and many\nothers. A panic is a generalized run by providers of short-term funding to a\nset of financial institutions, possibly resulting in the failure of one or more\nof those institutions. The historically most familiar type of panic, which\ninvolves runs on banks by retail depositors, has been made largely obsolete\nby deposit insurance or guarantees and the associated government\nsupervision of banks. But a panic is possible in any situation in which\nlonger-term, illiquid assets are financed by short-term, liquid liabilities, and\nin which suppliers of short-term funding either lose confidence in the\nborrower or become worried that other short-term lenders may lose\nconfidence. Although, in a certain sense, a panic may be collectively\nirrational, it may be entirely rational at the individual level, as each market\nparticipant has a strong incentive to be among the first to the exit.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the Federal Reserve Board. This content is in the public domain.\n\nOne case where DD forces could have been relevant is Bear Stearns.\nSEC Chairman Cox said the following after the failure of Bear Stearns:\nWe will discuss this case next time. To prepare, finish reading the\nHBS JP Morgan-Bear Stearns case (from page 8 onwards).\nAlp Simsek ()\nLecture Notes\nCourtesy of the U.S. Securities and Exchange Commission. This image is in the public domain.\n\nAppendix: Are runs random events as in theory?\nIn the above model, runs are purely driven by a lack of coordination.\nTheory doesn't provide guidance about which equilibrium will be\nplayed.\nThere could be panic without any bad news about the assets or the\neconomy. Panics are as likely in booms as in downturns.\nThis feature of the model is not consistent with data.\nGorton (1988) on the runs during the National Banking Era: \"Every\ntime a variable predicting a recession reached a threshold level, a\npanic occurred.\"\nBordo (1990) makes the same point (see the earlier table).\nAlp Simsek ()\nLecture Notes\n\nAppendix: Equilibrium selection via global games\nEconomic theorists have come up with a partial fix.\nBy enriching the model's information structure, we can obtain\nadditional predictions about the likelihood of each equilibrium.\nThe analysis is intuitive and suggests the coordination failures (bad\nequilibrium) are more likely to obtain in bad times.\nThis is way outside our scope. To learn more, read Morris and Shin\n(2001), \"Rethinking Multiple Equilibria in Macroeconomic Modeling.\"\nAlp Simsek ()\nLecture Notes\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6: Collateralized Debt and Information Based Panics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/d9c5a4e3eb2b9ff5f1b8a0f1c9a76045_MIT14_09IAP16_lec6_edit.pdf",
      "content": "14.09: Financial Crises\nLecture 6: Collateralized Debt and Information Based\nPanics\nAlp Simsek\nAlp Simsek ()\nLecture Notes\n\nRevisiting runs: Is Diamond-Dybvig the whole story?\nDiamond-Dybvig provides a plausible account of runs in history, and\nafter some relabeling, a contributing factor to the subprime crisis.\nHowever, there is reason to think that it might not be the whole story.\nRecently (and in history), much debt has been collateralized.\nAn example of collateralized debt is repo (sale-repurchase\nagreement)...\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nUnderstanding the run on the collateralized debt\nInformation insensitivity of collateralized debt\nInformation-based panics and the leverage cycle\nRevisiting the run(s) on Bear Stearns\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nWhat is repo?\nRepo is effectively a collateralized loan.\nB (the borrower/the bank), receives some money by temporarily\ngiving collateral such as treasuries, MBSs etc to F (the financier).\nB pays back the loan with interest and reclaims the collateral.\nThe loan is often short term, e.g., one day, but could also be longer.\n(The deal is technically structured as an initial sale of the collateral\nand a right to repurchase with a prespecified price that refiects the\ninterest rate- hence the name.)\nAlp Simsek ()\nLecture Notes\n\nRepo haircuts\nAs we discussed earlier, the loan usually has a haircut or margin.\nRecall B could borrow ρ from the Fs by using 1 dollar of the asset as\ncollateral. The difference, 1 - ρ, would be the REPO haircut.\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economics Association. Used with permission.\n\nWhy is Repo important?\nRepo is a huge market. In 2006 Q1, the average amount of outstanding\nrepo (and reverse) agreements were close to $5.67 trillion. (Source: Stigum\n(2007), The Money Market)\nDaily trading volume over this period averaged $1.6 trillion!\nAnd this does not even capture all the repo deals out there.\nRepo is typically used to finance treasuries and safer MBSs.\nBut it is also used to finance riskier MBSs (CDOs etc).\nGorton: There was a run on Repo, in the sense that the haircuts\non these types of riskier types of collateral increased...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nCourtesy of Gary Gorton. Used with permission.\n\nGorton: There was a run on the repo\nGorton (2010) on your reading list: \"The figure is a picture of the banking\npanic. We don't know how much was withdrawn because we don't know\nthe actual size of the repo market. But, to get a sense of the magnitudes,\nsuppose the repo market was $12 trillion and that repo haircuts rose from\nzero to an average of 20 percent. Then the banking system would need to\ncome up with $2 trillion, an impossible task.\"\nAlp Simsek ()\nLecture Notes\n\nA similar run on asset backed commercial paper\nABCP is different than Repo, but conceptually similar. Debt is\ncollateralized by assets in a conduit (set up by a sponsor bank).\nCan we invoke DD to explain the run on repo and ABCP?\nAlp Simsek ()\nLecture Notes\nCourtesy of Markus K. Brunnermeier. Used with permission.\n\nTraditional runs are not easy to apply to Repo\nCollateralized debt is conceptually different than bank deposits.\nThe traditional run mechanism relies on multiple Fs having claims on\nthe same \"collateral\" (the banks'assets as a whole).\nMany Fs are on the same boat, so a coordination failure is possible.\nBut in collateralized debt, e.g,. Repo, Fs money is backed by specific\ncollateral. Loosely speaking, F is on its own boat.\nThus, it is not very easy to apply a coordination mechanism.\nSo runs on collateralized debt might be driven by other forces.\nBefore we get there, let's think about the economic rationale of\ncollateral...\nAlp Simsek ()\nLecture Notes\n\nRoadmap\n1 Understanding the run on the collateralized debt\n2 Information insensitivity of collateralized debt\n3 Information-based panics and the leverage cycle\n4 Revisiting the run(s) on Bear Stearns\nAlp Simsek ()\nLecture Notes\n\nFrom pawn shops to repo\n-\nRepo logic is similar to a pawn shop.\n-\nIn a pawn shop, the financier (the lender of money) receives\na valuable commodity such as jewelry as collateral. The\nfinancier returns the collateral back upon receipt of money\nwith interest.\n-\nPawn shop is an ancient institution. See Goetzmann and\nRouwenhorst (2005), The Origin of Wealth, for some\nfascinating pictures of pawnshop loan records from China\ncirca 662-689 A.D. The records indicate that silk garments\nwere used as collateral at the time.\nAlp Simsek ()\nLecture Notes\n\nWhy collateral?\nThe fact that collateral has been used for a long time, and under very\ndifferent institutions, suggests that it serves an important economic\nfunction.\nOne rationale: Collateral helps to mitigate information frictions.\nOnce the loan is secured by collateral, F only needs to have a\nrough sense that the value of collateral exceeds the amount lent.\nLess need to know B's financial health (less \"adverse selection\"). Or\nwhat B will do with the borrowed money (less \"moral hazard\").\nAlp Simsek ()\nLecture Notes\n\nCollateral helps to economize on information costs\nIn practice, producing information about borrowers or their actions\ncan be very costly (need credit registries, monitors, courts etc.)\nSo one view of collateral is that it allows the fiow of credit while\neconomizing on costly information acquisition.\nThis can also help to understand the form of the collateral contract.\nIt typically takes the form of debt as opposed to something else.\nTo formalize, suppose B promises to pay back s (x), where x denotes\nthe value of the collateral (on the due date)\nAlp Simsek ()\nLecture Notes\n\nThe collateral contract could take this form\nAlp Simsek ()\nLecture Notes\n\nOr it could take this form\nAlp Simsek ()\nLecture Notes\n\nBut instead, it typically takes this form\nB pays back (fixed) D whenever x ≥ D but defaults when x < D.\nAlp Simsek ()\nLecture Notes\n\nWhy not have the first two contracts?\nThere are actually some nice things about the first two contracts.\nThey have reasonable risk sharing properties: Fs share some risk in\nthe sense that Bs'liability is relatively low in low states.\nIf we had these types of contracts, crises could be less severe. Why?\nBut we do not have these contracts. Why might this be the case?\nAlp Simsek ()\nLecture Notes\n\nDebt contract is the least sensitive to information\nMost likely because they are quite sensitive to changes in the value, x.\nTo price them, F would have to know quite a bit info about x.\nThis goes against the logic of using collateral to begin with!\nIn contrast, debt is largely insensitive to the value of collateral.\nAs long as x > D (fiat part), payoff doesn't depend on x at all!\nThis further helps to economize on information/reduces frictions.\nAlp Simsek ()\nLecture Notes\n\nCollateralized debt economizes on information costs\nIn fact, in practice contract does not even make reference to the value\nof the collateral, x. That reference is a construct of our formalism.\nAs long as x > D, B pays the debt and reclaims the collateral.\nAs long as there is mutual understanding that E [x] >> D, parties\ncan borrow and lend without discovering the exact value of x.\nThis is probably why even things like old jewelries or silk shirts\n(presumably very diffi cult to price exactly) can serve as collateral.\nAlp Simsek ()\nLecture Notes\n\nHow could they trade so much without knowing much?\nHolmstrom (2015): MBSs could be analogues to old jewelries!\nRemember that trillions of $s were being exchanged in repo markets.\nAlp Simsek ()\nLecture Notes\nMBSs were quite opaque and their pricing was not well understood even\nby the experts on Wall Street.\nIn retrospect, this seemed puzzling to many observers. How could Wall\nStreet trade so much without knowing much? Was nontransparency of\nthese markets a cover for shady deals in the background?\nNote, however, the valuation of jewelries in a pawn shop is not very\ntransparent either...\n\nBecause this is what collateralized debt markets are about\nAlp Simsek ()\nLecture Notes\nAs Holmstrom notes, the Repo market is designed so that---thanks\nto the information insensitivity of debt---people don't need to know\nabout the value of the underlying collateral.\nSince these markets economize on information, opaqueness could\nbe one of their integral features.\nThus, nontransparency does not necessarily reflect an anomaly.\nMoreover forcing these markets to become more transparent might\ngenerate unintended adverse consequences (see Holmstrom, 2015,\nfor details).\n\nAlp Simsek ()\nLecture Notes\n\nComparative statics of debt capacity/margins\nThink of the information insensitive region as E [x] being at least a\nfew standard deviations above D so default is unlikely.\nWhen this region is greater, all else equal (for a fixed E [x]) we can\nhave higher D while still ensuring overcollateralization.\nThis might be why safer collateral is associated with lower\nmargins/haircuts.\nIt also provides an explanation for the short horizon of\nRepo/collateralized debt: Collateral is less risky over shorter horizons!\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economics Association. Used with permission.\n\nRoadmap\nUnderstanding the run on the collateralized debt\nInformation insensitivity of collateralized debt\nInformation-based panics and the leverage cycle\nRevisiting the run(s) on Bear Stearns\nAlp Simsek ()\nLecture Notes\n\nCrisis: Collateralized debt becomes information sensitive\nAlp Simsek ()\nLecture Notes\n-\nWhat happens if there is a severe shock that reduces the expected\nvalue of collateral, E[x], into the information sensitive region?\n-\nThis is the Holmstrom and Gorton view of the crisis. Nontransparency\nof the collateral makes sense in normal times and facilitates liquidity\n(trade). However, once the collateral becomes information sensitive,\nnontransparency exacerbates the crisis.\n-\nThe liquidity in short-term debt markets rely on overcollateralization\nas opposed to information and price discovery about the underlying\ncollateral (which is very costly).\n-\nIn a crisis, investors are forced to discover information but in a\nmarket that was not designed for this purpose (read Holmstrom\n(2015) for a nice contrast with equity markets---which do facilitate\ninformation discovery).\n\nAlp Simsek ()\nLecture Notes\n\nCrisis: Collateralized debt becomes information sensitive\nStart of the crisis: Markets recognize risks in MBS. Valuations fall,\nbut more importantly they become more uncertain (both figures).\nWe are suddenly worried about the value of old jewelries, but in an\nenvironment that was \"designed\" to obviate price discovery.\nWhat would happen to debt capacities?\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nCourtesy of Markus K. Brunnermeier. Used with permission.\n\nAlp Simsek ()\nLecture Notes\nCourtesy of Gary Gorton. Used with permission.\n\nCrisis: \"Run\" on collateralized debt due to uncertainty\nConsistent with theory, Fs started to run riskier forms of collateral (as\nopposed to specific institutions, as in DD) starting mid-2007.\nIn fact, we had seen another person who made the same point using\nslightly different language. Do you remember who he/she was?\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n(c) Dow Jones & Company, Inc. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nLeverage cycle: Run on collateralized debt due to bad news\nThe bottom panels illustrate a measure of ρ (pledgeability in the\nearlier lecture, or debt capacity in this lecture) for different assets.\nLeverage ratios seem procyclical in the sense that they are high in\ngood times (high prices) but low in bad times (low prices).\nGeanakoplos (2009), \"The Leverage Cycle\" proposed a theory of\nprocyclical leverage based on changes in uncertainty.\nBad times =⇒ Uncertainty =⇒ Nervous lenders=⇒ Less leverage\n=⇒ Amplification....\nGeanakoplos is essentially saying something very similar to\nGorton-Holmstrom!\n(But he doesn't explain why there are debt contracts to begin with).\nAlp Simsek ()\nLecture Notes\n\nApplying the theories of runs\nSo we now have two theories of runs:\n1 DD: Run on specific institutions with unsecured short-term debt.\nTo lesser extent, run also on the secured debt, e.g., Repo, if there are\nworries about collateral being seized in bankruptcy.\n2 Holmstrom-Gorton-Geanakopos (HGG): Run on uncertain collateral.\nThe first run is quite sudden, the second run unfolds more gradually.\nLet's try to apply them in the context of the failure of Bear Stearns...\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nUnderstanding the run on the collateralized debt\nInformation insensitivity of collateralized debt\nInformation-based panics and the leverage cycle\nRevisiting the run(s) on Bear Stearns\nAlp Simsek ()\nLecture Notes\n\nRevisiting the run(s) on Bear Stearns\nBy mid-2007, broker dealers such as Bear heavily on Repo financing.\nBear had the weakest liquidity buffers among all such dealers...\nAlp Simsek ()\nLecture Notes\n\nFrom the HBS case (Exhibit 2, Bear's balance sheet).\nData on Q1-2008, 2007, 2006, 2005, 2004 ($million).\nAlp Simsek ()\nLecture Notes\nExhibit 2 from \"The Tip of the Iceberg: JP Morgan Chase and\nBear Stearns\" removed due to copyright restrictions. Please visit\nhttp://www.hbs.edu/faculty/Pages/item.aspx?num=36849.\n\nAlp Simsek ()\nLecture Notes\nExhibit 7 from \"The Tip of the Iceberg: JP Morgan Chase and Bear Stearns\" removed due to\ncopyright restrictions. Please visit http://www.hbs.edu/faculty/Pages/item.aspx?num=36849.\n\nBy the end of 2007--early 2008, the run on Repo (for riskier assets)\nhad already started and gradually tightened liquidity at these\ninstitutions.\nBear was the most exposed to this run, as the above table illustrates.\nCombined with realized losses, this pushed Bear to the edge...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nExhibit 5 from \"The Tip of the Iceberg: JP Morgan Chase and Bear Stearns\" removed due to\ncopyright restrictions. Please visit http://www.hbs.edu/faculty/Pages/item.aspx?num=36849.\n\nAlp Simsek ()\nLecture Notes\nExhibit 6 from \"The Tip of the Iceberg: JP Morgan Chase and Bear Stearns\" removed due to\ncopyright restrictions. Please visit http://www.hbs.edu/faculty/Pages/item.aspx?num=36849.\n\nSophisticated lenders had already run\nSome money market funds like the Reserve Primary Fund continued\nto lend to Bear against riskier forms of collateral.\n(This fund later \"broke the buck\" and induced another layer of panic)\nBut the more sophisticated lenders like Goldman had already stopped\nlending to Bear against riskier forms of collateral.\nProbably because they knew Bear was facing serious risks.\nThis suggests that (somewhat different than in our model) the\nriskiness of the borrower also plays a role in practice.\nImagine collateral + borrower reputation providing joint protection.\nAlp Simsek ()\nLecture Notes\n\nThe case study on Bear Stears and JP Morgan Chase on your reading\nlist describes the events that lead to the Bear's failure in March 2008.\nThe final days (March 10-14) have all the fingerprints of a DD-type\nbank run. Financiers (such as hedge funds that receive brokerage\nservices from Bear) start to question Bear's financial health and\nwithdraw their money, which further exacerbates Bear's financial\ndifficulties.\nInterestingly, some Repo financiers also pulled out partly because\nthere were concerns that Repo collateral can be frozen in bankruptcy\ncourts.\nSo concerns about bankruptcy courts' dealing with collateral can make\nRepo loans (temporarily) similar to an unsecured loan.\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\nBear Stearns' stock traded around $140 per share in July 2007.\nThe price fell to around $80 per share by February 2008.\nThe price was around $60 per share on March 11, 2008. It fell to\nalmost zero by March 14. This sudden drop is further indicative of a\nDD-type run.\nOn March 16, Bear Stearns was purchased by JP Morgan Chase, but\nonly after the Fed agreed to backstop losses from the assets on\nBear's securities portfolio. So the government had to step in to\nmitigate the panic (as it is usually the case with runs).\nThe initial offer by JP Morgan Chase was around $2 per share. The\noffer was later raised to $10 per share (to avoid litigation by Bear\nshareholders).\n\nLessons from the run(s) on Bear Stearns\nMy view: HGG mechanism was important to push Bear Stearns to the\ncliff, creating the conditions that are ripe for a DD type panic.\n(Recall that panics in practice typically happen in bad times.)\nThe DD type panic in turn did the final blow and pushed over the cliff.\nSo it seems that the two run mechanisms combined to create damage.\n+\nAlp Simsek ()\nLecture Notes\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7: Interconnections and Panics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/3e802afa6c3cffe19a19827b93804f15_MIT14_09IAP16_lec7_edited.pdf",
      "content": "14.09: Financial Crises\nLecture 7: Interconnections and Panics\nAlp Simsek\nAlp Simsek ()\nLecture Notes\n\nIs DD and HGG the whole story of runs?\nDD and HGG provide (complementary) perspectives on runs.\nHowever, there might be yet another dimension to runs/crises.\nThis is elaborated by the Northern Rock case study by Shin (2009).\nUnderstanding what happened to NR will also illustrate another key\nfeature of the system: interconnections, with other implications.\nAlp Simsek ()\nLecture Notes\n\nRoadmap\n1 Credit crunch and runs\n2 Counterparty risk\n3 Complexity\nAlp Simsek ()\nLecture Notes\n\nDid Northern Rock experience a DD or HGG run?\n\"To turn the question around, the issue is why sophisticated lenders who\noperate in the capital markets chose suddenly to deny lending to a bank\nthat had an apparently solid asset book and virtually no subprime lending.\nNorthern Rock was in the business of prime mortgage lending to U.K.\nhouseholds. The asset quality of any mortgage bank is vulnerable to a\nsharp decline in house prices and rising unemployment. However, 2007 was\nthe Indian summer of the housing boom in the U.K., and there were no\noutward signs of seriously deteriorating loan quality. Thus, the sudden\nrefusal of lenders to fund Northern Rock needs an explanation. The\nanswers to the puzzle reveal much about the nature of banking in the age\nof securitization and capital markets.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nDid Northern Rock experience a DD or HGG run?\nNorthern Rock did not hold subprime mortgages. So it seems unlikely\nthat they were subject to a (direct version of) HGG run.\nWe could try to apply DD after some relabeling- as we did with Bear.\nBut remember, generally panics happen after bad news about banks.\nLosses erode buffers (capital&liquidity), and make a panic more likely.\nSo it is puzzling that Fs would panic and run out of the blue on\nNorthern Rock- didn't hold subprime or make large losses.\nAlp Simsek ()\nLecture Notes\n\nShin: Fs are also institutions/other \"banks\"\nAlp Simsek ()\nLecture Notes\nShin notes that, unlike the basic DD model, many of the financiers\nof Northern Rock are other banks (or sophisticated institutions).\nSo the financial network is more complicated than what we have\nemphasized so far, with lending among banks.\nIn a financial crisis, the lending institutions might be forced to cut\ntheir positions due to their own financial problems (through their\nown net worth channel, runs etc).\nThis might look like a run from the perspective of the borrowing\ninstitutions...\n\nShin describes an example as in this picture. Imagine B1 as the Northern\nRock and B2 as another bank that lends to Northern Rock...\nAlp Simsek ()\nLecture Notes\n\nWhat happened to Northern Rock?\nAlp Simsek ()\nLecture Notes\n- Shin writes: \"Bank 2 has other assets (that is, loans it has made to other parties), as\nwell as its loans to Bank 1. Suppose that Bank 2 suffers credit losses on these other\nloans, but that the creditworthiness of Bank 1 remains unchanged. The loss suffered by\nBank 2 depletes its equity capital. In the face of such a shock, a prudent course of action\nby Bank 2 is to reduce its overall exposure, so that its asset book is trimmed to a size\nthat can be carried comfortably with the smaller equity capital.\"\n\"From the point of view of Bank 2, the imperative is to reduce its overall lending,\nincluding its lending to Bank 1...However, from Bank 1's perspective, the reduction of\nlending by Bank 2 is a withdrawal of funding. If financial markets are deep and liquid,\nBank 1 will find alternative sources of funding at roughly the same price--after all,\nnothing in Bank 1's risk characteristics has changed, so it should be able to borrow just\nas easily as it did before. But now imagine a situation where a combination of events\narises: i) the reduction in Bank 2's lending is severe; ii) overall credit markets have seized\nup in such a way that no one has access to funding, including Bank 1; and iii) Bank 1's\nassets are so illiquid that they can only be sold at fire-sale prices. Under these\ncircumstances, the prudent shedding of exposures from the point of view of Bank 2 will\nfeel like a run from the point of view of Bank 1. Arguably, this type of run is one element\nof what happened to Northern Rock.\"\nCourtesy of the American Economic Association. Used with permission.\n\nAlp Simsek ()\nLecture Notes\nA\n\nfi\ngu\nre describing how\ncredit crunc\nhes trigger reductions\nin secured and unsecured s\nhort-term credit.\nImage by MIT OpenCourseWare.\n\nNorthern Rock: A run driven by a credit crunch\nRecall that in mid-2007 the Repo and ABCP borrowing collapsed.\nBanks also started to realize or expect losses from subprime.\nThese banks faced tighter borrowing constraints. They were forced to\n(and perhaps also chose to) reduce their leverage and risks.\nThey would cut their positions across the board- not just in subprime.\nIn particular, they would stop reduce or renewing loans to other firms.\nIf these Bs only lent to the real sector, these actions would look like a\ncredit crunch (remember Lectures 2-3 and Chodorow-Reich).\nWhen Bs also lend to one another, the credit crunch will also look like\na run on the Bs that lose financing (more severe externalities).\nAlp Simsek ()\nLecture Notes\n\nLessons from the Northern Rock\nLesson: Initial problems can naturally spread to other Bs/collaterals.\nAlp Simsek ()\nLecture Notes\nCourtesy of Markus K. Brunnermeier. Used with permission.\n\nRoadmap\nCredit crunch and runs\nCounterparty risk\nComplexity\nAlp Simsek ()\nLecture Notes\n\nHow about contagion?\nThe interconnections also suggests the possibility of contagion: A\nbank failure can trigger problems elsewhere in the system.\nContagion is a big concern in policy discussions of bank bailouts.\nOne channel of contagion is the credit crunch as we discussed above.\nAnother channel is informational: The failure of a bank can send a\nnegative signal. Trigger or exacerbate HGG or DD type-runs.\nBut there is also the possibility of direct damage via counterparty\nrisk...\nAlp Simsek ()\nLecture Notes\n\nEx-Fed Chairman Bernanke, in his testimony to the Senate on April 3,\n2008 following the Fed's Bear Stearns intervention, captures these\nconcerns as follows:\n\"Our financial system is extremely complex and interconnected, and Bear\nStearns participated extensively in a range of critical markets. The sudden\nfailure of Bear Stearns likely would have led to a chaotic unwinding of\npositions in those markets and could have severely shaken confidence. The\ncompany's failure could also have cast doubt on the financial positions of\nsome of Bear Stearns'thousands of counterparties and perhaps of\ncompanies with similar businesses.... Moreover, the adverse impact of a\ndefault would not have been confined to the financial system but would\nhave been felt broadly in the real economy through its effects on asset\nvalues and credit availability.\"\nMention info contagion and credit crunch, but also counterparty risk.\nAlp Simsek ()\nLecture Notes\nCourtesy of The Federal Reserve Board. This material is in the public domain.\n\nCounterparty risk\nBs are often exposed to one another through loans that are not fully\nsecured.\nThese exposures can emerge from explicit loans, as in the earlier\ndiagrams.\nIf B1 fails, B2 wouldn't receive its loan back in full and suffer some\nlosses.\nBut these types of exposures could also emerge from \"implicit\nloans\"- unsecured gains that accumulate in bilateral transactions.\nIn practice, implicit exposures are common in derivatives that are\ntraded over-the-counter...\nAlp Simsek ()\nLecture Notes\n\nCounterparty risk in OTC derivatives\nMany types of derivatives are traded OTC: Forwards, swaps, interest\nrate swaps, credit default swaps.\nAIG case nicely illustrates the counterparty risk in these markets...\nAlp Simsek ()\nLecture Notes\n\nCounterparty risk in OTC derivatives\nMcDonald and Paulson (2015), \"By construction, many derivatives\ncontracts have zero market value at inception; this is generally true for\nfutures, swaps, and credit default swaps. When a position has zero market\nvalue, the two parties to a contract can, by mutual consent, exit the\ncontract without any obligation for either to make any further payment to\nthe other....As time passes and prices move, a contract initiated with zero\nmarket value will generally not remain at zero market value: fair value will\nbe positive for one counterparty and negative by an exactly offsetting\namount for the other.\"\nThe positive-value party is exposed to the negative-value party. If the\nlatter becomes bankrupt, the former loses a valuable asset!\nSo the positive-value party has implicitly made an unsecured loan.\nAs the exposures grow, the exposed can make a \"margin call\"...\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nMargin calls in OTC derivatives\n\"In such cases, it is common for the negative value party to make a\ncompensating payment to the positive value counterparty. Such a payment\nis referred to as margin or collateral, in this context, the two terms mean\nthe same thing. Collateral can fiow back and forth as market values\nchange.\"\nRead page 93 for the details of how and when margin calls happen.\nThey happen when exposures exceed a pre-agreed positive threshold.\nAIG faced margin calls before its failure and bailout in September\n2008...\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nWhat is AIG?\nMcDonald and Paulson (2015): \"The near-failure on September 16, 2018,\nof American International Group (AIG) was an iconic moment of the\nfinancial crisis. AIG, a global insurance and financial company with $1\ntrillion in assets, lost $99.3 billion during 2008 and was rescued with the\nhelp of the Federal Reserve, the Federal Reserve Bank of New York, and\nthe US Treasury. The rescue played out over many months and involved\nthe extension of loans, the creation of special purpose vehicles, and equity\ninvestments by the Treasury, with the government assistance available to\nAIG ultimately totaling $182.3 billion. The decision to rescue AIG was\ncontroversial at the time and remains so. AIG's fate also provided an\nimportant touchstone in discussions of financial reform. AIG motivated the\nenactment of new rules governing nonbank financial institutions, as well as\nrules about the treatment of financial derivatives.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nMargin calls can exacerbate the failure of the negative-value party.\nIf this happens, and there is no bailout, the positive-value party might\nalso suffer some losses (see above for margin shortfalls).\nSo unsecured exposures in OTC derivatives create counterparty risk.\nThese markets are large, so this type of risk is a real concern...\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n(c) Securities Finance Monitor. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMcDonald and Paulson calculate the (potential) losses that could\naccrue to AIG's counterparties absent a bailout...\nAlp Simsek ()\nLecture Notes\n(c) Securities Finance Monitor. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nCounterparty risk is non-trivial (although not too large)\n\"The rescue of AIG had many beneficiaries. The broader financial\nsystem was spared the unpredictable consequences of a large and\ncomplicated firm failing at a time when financial markets were very\nfragile. Direct beneficiaries of the rescue included the life insurance\nsubsidiaries that received $20 billion in capital infusions, protecting\ntheir policyholders. The counterparties to the credit fault swaps AIG\nhad sold on multisector credit default obligations (CDOs) were also\nbeneficiaries, although their direct benefit was the $17.7 billion in\ncollateral payments made after the rescue rather than much larger\nfigures that sometimes have been emphasized.\"\nSo it seems that, absent a bailout, the bankruptcy of AIG would\ntrigger non-trvial (although not huge) losses on counterparties.\nAlp Simsek ()\nLecture Notes\n\nAcademic research on counterparty risk\nThere is an interesting academic literature on counterparty risk.\nFormalizes how counterparty risk can generate domino effects.\nAlso tries to empirically estimate the (potential) length of dominos.\nAcemoglu, Ozdaglar, Tahbaz-Salehi (2013) on the reading list analyze\nthe resilience of different with different network structures and\ndifferent-size shocks.\nOther papers try to identify the banks that are more systemic/central.\n\"Too Interconnected to Fail\" as opposed to \"Too Big to Fail\".\nIn Caballero-Simsek (2013), we use counterparty risk to emphasize\nwhat we think is an even more pressing problem: complexity...\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nCredit crunch and runs\nCounterparty risk\nComplexity\nAlp Simsek ()\nLecture Notes\n\nAnother problem during crises: Complexity\nDuring crises, economic environment appears \"complex\".\nHolmstrom-Gorton: Need to figure out value of opaque collateral.\nIn addition, need to figure out whether- and how much- all the\namplification mechanisms we discussed in this course might shake the\nsystem.\nE.g., fire sales possible. Prices affected by \"non-fundamental\" factors.\nMoreover, not much precedent (relatively rare). Unknown\nunknowns.\nPricing models that Bs use in normal times might not be of much use.\nAlp Simsek ()\nLecture Notes\n\nBank of England Financial Stability Report for June 2009:\nAlp Simsek ()\nLecture Notes\nCourtesy of the Governor and Company of the Bank of England. Used with permission.\nFigure:\n\nCounterparty risk is a source of complexity\nCounterparty risk provides a particular and specific source of\ncomplexity.\nHaldane's (2009) speech: \"knowing your ultimate counter-party's risk\nbecomes like solving a high-dimension Sudoku puzzle.\"\nRecall also Bernanke's testimony from earlier: \"Our financial system\nis extremely complex and interconnected...The sudden failure of\nBear Stearns likely would have led to a chaotic unwinding of positions\nin those markets and could have severely shaken confidence. The\ncompany's failure could also have cast doubt on the financial\npositions of some of Bear Stearns'thousands of counterparties and\nperhaps of companies with similar businesses....\"\nAlp Simsek ()\nLecture Notes\nCourtesy of The Federal Reserve Board. This material is in the public domain.\n\nA model of crises driven by counterparty risk and\ncomplexity\nIn Caballero-Simsek (2013), we use a stylized model to illustrate how\ncomplexity during a crisis can create considerable amplification.\nRelatively small losses trigger informational regime change, \"create\ncomplexity,\" and induce a disproportionately large credit crunch.\nGovernment support is desirable, precisely because it reduces\ncomplexity.\nI will summarize the ingredients and results without getting into\ndetails.\nAlp Simsek ()\nLecture Notes\n\nThe basic ingredients of the model\nWe model the financial system as a network of cross-exposures.\nEach bank starts with some legacy assets (e.g., mortgages) and some\ncash.\nEach bank makes essentially a single decision:\nSell (cautious action): Liquidate legacy assets and keep cash.\nBuy (normal action): Keep assets, and make new investments.\nThe more banks sell (or cautious), the bigger is the credit crunch.\nKey question: how banks'sell/buy decisions depend on complexity.\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nThe key ingredients of the model\nBanks learn that one bank, say, b0 (e.g., Bear, Lehman, or another\nbank) is hit by losses and will soon be bankrupt.\nThey realize losses will spill over to other banks via counterparty risk.\nThey can't figure out if they will be caught up in a domino\ncascade.\nWe formalize this ingredient as follows: Banks have only partial\nknowledge of the network. They know their own counterparty\n(understand their own exposures), but they do not know who the\ncounterparties of counterparties are, or who their counterparties are.\nBut let us first look at a benchmark scenario without this ingredient,\ni.e., suppose banks have no uncertainty about the network...\nAlp Simsek ()\nLecture Notes\n\nNo-uncertainty benchmark\nFigure:\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nNo-uncertainty benchmark: Relatively mild outcome\nWhen banks know the network, there is a partial domino effect.\nLosses bring down a few banks, but they gradually dissipate (since\neach failing bank absorbs some), and the cascade eventually stops.\nThis would generate some credit crunch (especially with leverage etc).\nBut in a deep financial market such as the US, the damage would be\ncontained- other banks would step in (they all \"buy\" in our model.)\nEnter our key ingredient: Uncertainty about the network....\nAlp Simsek ()\nLecture Notes\n\n.\nImagine these slots as placeholders: Each bank is assigned to a slot.\nComplexity: Banks know that the network is a circle (for simplicity),\nbut they don't know which bank is assigned to which slot.\nThey know their immediate counterparty, but not others'slots.\nSo they don't know their distance from the troubled bank, b0.\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nSuppose also that Bs are risk averse (want to avoid bankruptcy if\npossible).\nFor simplicity, suppose Bs act according to the worst case scenario.\nThis is not a bad assumption when there are unknown unknowns.\nEconomic agents tend to be more cautious when they face ambiguity\nas opposed to quantifiable risk (supported by experiments).\nHow would Bs react in this case? For a small shock? Larger shock?\nAlp Simsek ()\nLecture Notes\n\nEquilibrium with small shocks: Same as no-uncertainty\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEquilibrium with small shocks: Same as no-uncertainty\nFor small shocks, there is no cascade: The immediate neighbor\nabsorbs some losses, but the remaining banks are safe.\nMore importantly, those other banks know that they are safe:\nThey know they are not directly exposed to b0 (know their\ncounterparty).\nThey can also rule out an indirect hit since the shock is small.\nSince other banks face no bankruptcy risk, they buy. So the\ndamage/credit crunch is relatively small, as in the benchmark.\nNote that there is still complexity (banks still don't know the\nnetwork). But the complexity is dormant- not payoff relevant.\nAlp Simsek ()\nLecture Notes\n\nEquilibrium with larger shocks: Large credit crunch\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEquilibrium with larger shocks: Large credit crunch\nWhen the shock is larger, and a cascade becomes possible, local\ninformation is no longer suffi cient to rule out an indirect hit.\nWorst case scenario is one in which my counterparty is exposed to b0.\nSince I cannot rule this out, and I am very risk averse, I act as if this\nis the case.\nBanks act as if they are closer to the distressed bank than they\nactually are.\nWhen the dust settles, relatively few banks will be bankrupt.\nBut during the crisis, they all take precaution: Large credit crunch!\nSo complexity creates amplification relative to the benchmark.\nAlp Simsek ()\nLecture Notes\n\nBroader idea: Crises increase complexity and uncertainty\nThe broader idea here is that the financial system is quite complex.\nThe system can work fine in normal times (or with small shocks),\nwith each \"bank\" understanding its local corner and markets.\nBut unusual events such as crises greatly increase the information\nburden on the banks/make the complexity payoff relevant.\nThis induces banks/players to be much more cautious than normal.\nThe extreme caution exacerbates distress/panics (recall Shin).\nBailouts or support by the government can mitigate these effects,\nprecisely by reducing the (payoff-relevant) complexity.\nThe above analysis did not feature government, so it illustrates how\nbad things could get if the government doesn't step in...\nAlp Simsek ()\nLecture Notes\n\nRecall what Bernanke said about the potential failure of Bear Stearns.\nCaballero-Simsek: \"Unfortunately, Chairman Bernanke's testimony\nwould prove prescient only a few months later during the Lehman\nepisode, when the demise of the investment bank wrecked havoc all\naround the world.\"\nOur interpretation: Lehman bankruptcy changed the market\nperceptions about bank failures and government support.\nThe market realized that the government might be unable or\nunwilling to prevent the failure of a large bank. What happened?\nAlp Simsek ()\nLecture Notes\n\nWhen Lehman failed: Mother of all panics\nAlp Simsek ()\nLecture Notes\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8: Lessons and Policy Responses",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-09-financial-crises-january-iap-2016/b3b998e10c95ed5c3242f09036cb300d_MIT14_09IAP16_lec8_edit.pdf",
      "content": "14.09: Financial Crises\nLecture 8: Lessons and Policy Responses\nAlp Simsek\nAlp Simsek ()\nLecture Notes\n\nLessons and policy respones\nWe have covered quite a bit of material on financial/banking crises.\nLet's do a recap and think about the ideal policy response.\nAlp Simsek ()\nLecture Notes\n\nAlp Simsek ()\nLecture Notes\n\nFirst set of issues: Solvency, capital, leverage\nAlp Simsek ()\nLecture Notes\n\nNet worth channel, credit crunch, fire sales\nAlp Simsek ()\nLecture Notes\nCourtesy of Markus K. Brunnermeier. Used with permission.\n\nSecond set of issues: Liquidity, runs, panics\nAlp Simsek ()\nLecture Notes\n\nDD-type and HGG-type runs\nAlp Simsek ()\nLecture Notes\n\nPanics driven by interconnections\nAlp Simsek ()\nLecture Notes\n(c) John Wiley and Sons. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\nA\n\nfi\ngu\nre describing how\ncredit crunc\nhes trigger reductions\nin secured and unsecured s\nhort-term debt.\nImage by MIT OpenCourseWare.\n\nWe care because....\nAlp Simsek ()\nLecture Notes\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\nCourtesy of Murillo Campello, John Graham, and Campbell R. Harvey. Used with permission.\n\nEvidence/theory: Government support mitigates panics\nAlp Simsek ()\nLecture Notes\nCourtesy of Gabriel Chodorow-Reich. Used with permission.\nCourtesy of Gary Gorton. Used with permission.\n\nEvidence: Ultimate cause can be mistakes\nAlp Simsek ()\nLecture Notes\nCourtesy of American Economic Association. Used with permission.\nCourtesy of Yueran Ma. Used with permission.\n\nTheory: Some discipline against moral hazard\nAlp Simsek ()\nLecture Notes\n@ Harvard Business School.\nAll rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nSo what is the optimal crisis policy?\nBased on our analysis, how should we think about crisis policy?\nThe question has two dimensions that might also interact:\nWhat is the optimal ex-post policy to fight/mitigate crises?\nWhat is the optimal ex-ante policy to prevent/rarefy crises?\nAlp Simsek ()\nLecture Notes\n\nRoadmap\nOptimal policy during crises\nOptimal policy to \"prevent\" crises\nAlp Simsek ()\nLecture Notes\n\nHow to react to a developing crisis?\nAlp Simsek ()\nLecture Notes\nCaballero (2010) draws an analogy between a heart failure (\"sudden\ncardiac arrest\") and a financial crisis (\"sudden financial arrest\").\nThe main treatment for a sudden cardiac arrest requires a defibrillator.\nMoreover, time is of the essence: the defibrillator must be applied\nwithin minutes of the arrest. Thus, it is important to have numerous and\neasily accessible defibrillators.\nLikewise, the main solution to a financial crisis is rapid and massive\ngovernment support to the financial system, either in the form of\nbailouts (to mitigate the solvency problems) or guarantees (to mitigate\nthe liquidity problems). These are the financial defibrillators.\n\nMoral hazard concerns are secondary during a crisis\nAlp Simsek ()\nLecture Notes\nHowever, many people resist the use of financial defibrillators, as they seem\nto think this will generate moral hazard and exacerbate future crises.\nAs Caballero notes, this is similar to objecting the use of defibrillators out of\nconcern that, once people realize they are more likely to survive a heart\nattack, they will eat more cheeseburgers and will become more likely to have\nheart attacks.\nThe point is that the moral hazard concerns are secondary during a crisis.\nEven if moral hazard is a major cause of the crisis (which itself is debatable--\nsee Lecture 4), it is best dealt with once the crisis is over and by applying\nother policies. To continue the analogy, one could imagine taxing\ncheeseburgers in normal times, as opposed to banning defibrillators during\ncrises.\nOnce the crisis hits, the pragmatic policymakers often realize that they must\napply the financial defibrillators. How did the policymakers in the US react to\nthe crisis?\n\nBernanke (January, 2009), \"The Crisis and the Policy Response\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the Federal Reserve Board. This content is in the public domain.\n\"Other than policies tied to current and expected future values of the\novernight interest rate, the Federal Reserve has-and indeed, has been\nactively using-a range of policy tools to provide direct support to\ncredit markets and thus to the broader economy. As I will elaborate, I\nfind it useful to divide these tools into three groups. Although these\nsets of tools differ in important respects,they have one aspect in\ncommon: They all make use of the asset side of the Federal Reserve's\nbalance sheet. That is, each involves the Fed's authorities to extend\ncredit or purchase securities.\"\n\nTraditional LLR to mitigate DD runs\n\"The first set of tools, which are closely tied to the central bank's\ntraditional role as the lender of last resort, involve the provision of\nshort-term liquidity to sound financial institutions. Over the course of\nthe crisis, the Fed has taken a number of extraordinary actions to\nensure that financial institutions have adequate access to short-term\ncredit. These actions include creating new facilities for auctioning\ncredit and making primary securities dealers, as well as banks, eligible\nto borrow at the Fed's discount window... \"\n\"Liquidity provision by the central bank reduces systemic risk by\nassuring market participants that, should short-term investors begin\nto lose confidence, financial institutions will be able to meet the\nresulting demands for cash without resorting to potentially\ndestabilizing fire sales of assets....\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the Federal Reserve Board. This content is in the public domain.\n\nCollateralized LLR to mitigate HGG runs\n\"On the other hand,....providing liquidity to financial institutions does\nnot address directly instability or declining credit availability in critical\nnonbank markets, such as the commercial paper market or the market\nfor asset-backed securities, both of which normally play major roles in\nthe extension of credit in the United States.\"\n\"To address these issues, the Federal Reserve has developed a second\nset of policy tools, which involve the provision of liquidity directly to\nborrowers and investors in key credit markets....In addition, the\nFederal Reserve and the Treasury have jointly announced a facility\nthat will lend against AAA-rated asset-backed securities collateralized\nby student loans, auto loans, credit card loans, and loans guaranteed\nby the Small Business Administration. The Federal Reserve's credit\nrisk exposure in the latter facility will be minimal, because the\ncollateral will be subject to a \"haircut\" and the Treasury is providing\n$20 billion of capital as supplementary loss protection.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the Federal Reserve Board. This content is in the public domain.\n\nQE1 to mitigate asset fire sales\n\"The Federal Reserve's third set of policy tools for supporting the\nfunctioning of credit markets involves the purchase of longer-term\nsecurities for the Fed's portfolio. For example, we recently announced\nplans to purchase up to $100 billion in government-sponsored\nenterprise (GSE) debt and up to $500 billion in GSE mortgage-backed\nsecurities over the next few quarters. Notably, mortgage rates\ndropped significantly on the announcement of this program and have\nfallen further since it went into operation. Lower mortgage rates\nshould support the housing sector. The Committee is also evaluating\nthe possibility of purchasing longer-term Treasury securities.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the Federal Reserve Board. This content is in the public domain.\n\nHow about the treasury and the FDIC?\nThe Fed could mitigate liquidity issues, but it could not (by itself)\ndeal with all of the net worth/capital/solvency issues.\nTreasury and the FDIC needed to step in.\nTreasury needed authorization by the Congress.\nFDIC had own resources and emergency authority to tap more funds.\nSwagel (2015): \"Constraints on the Crisis Policy Response\":\n\"The Troubled Asset Relief Program (TARP) was proposed on\nSeptember 18, 2008- the same week as the Lehman collapse and the\nAIG bailout- and passed into law as part of the Emergency Economic\nStabilization Act on October 3, 2008. The TARP provided authority\nfor the Treasury to purchase or guarantee up to $700 billion of\ntroubled assets...\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nTARP: From asset purchases to recapitalization\n\"While the intent of the TARP when it was proposed was to purchase\nilliquid assets...It became clear to policymakers that a more rapid\napproach was needed...The switch from asset purchases to capital\ninjections fit within the TARP's legislative language, because shares\nof banks that originated loans represented troubled assets related to\nmortgages.\"\nAsset purchases is at best an indirect fix to net worth issues:\n\"Asset purchases would help cleanse bank balance sheets of illiquid\nmortgages and contribute to price discovery but would raise firms'net\nworth only if Treasury intentionally overpaid for assets (which was not\nthe plan) or if asset prices rose following the TARP purchases (a\npossibility if the implementation of the reverse auctions lifted\nconfidence and thereby improved asset prices).\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nTARP: Recapitalization to mitigate net worth channel\n\"The eight institutions ultimately receiving capital injections (after\nBank of America's acquisition of Merrill Lynch) together accounted\nfor more than half of both the assets and deposits of the US banking\nsystem. The existence of these mega-firms, while giving rise to\nconcerns over institutions that were too big to fail, also made it\npossible to strengthen a broad swathe of the banking system rapidly.\nEach firm received public capital equal to 3 percent of its\nrisk-weighted assets, for a total of about $125 billion. The remaining\nthousands of US banks together would be eligible for another $125\nbillion in capital.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nTARP: Additional capital to particularly weak banks\n\"...Treasury decisions to provide additional assistance to Citigroup\nand Bank of America in 2008 and 2009 beyond the initial capital\ninvestment of $25 billion for each institution. These two banks (and\nperhaps others) appeared to be insolvent at points during the crisis,\nand were to require extraordinary assistance from the TARP, and yet\nthe government propped them up rather than invoking the usual bank\nresolution authority of the FDIC. These decisions refiected several\nfactors. First, there was the concern that a government takeover of\nCitigroup would lead to a renewed fiight from other still-fragile banks.\nSecond,...there was little confidence across the government in the\nagency's ability to run a mega-bank.\"\n\"At the end...the firm did not fail. Meanwhile, bondholders and other\ncounterparties avoided losses entirely, which was in some ways less\nthan fully desirable, but did have the positive effect of limiting further\nfinancial contagion.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nFDIC: Public guarantees to facilitate private borrowing\nSwagel (2015): \"...the Federal Deposit Insurance Commission\nintroduced the Temporary Liquidity Guarantee Program (TLGP),\nunder which it would insure senior debt issued by banks. The FDIC\nfurther extended its deposit insurance to provide an unlimited\nbackstop on business transactional checking accounts that were\npreviously uninsured. The TLGP program was undertaken using the\nFDIC's emergency authority, which allowed the FDIC to put taxpayer\nmoney...without the usual requirement to act in a manner that\nensured the least cost for taxpayers....\"\n\"Veronesi and Zingales (2010) calculate that the guarantees from the\nFDIC account for most of the benefits in terms of stabilization of the\nfinancial system.\n\"...The Dodd--Frank legislation was later to prohibit a repeat of the\nTLGP without explicit Congressional approval.\"\n(Can you see a problem/tension in the last two bullet points?)\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nVeronesi and Zingales (2010), \"Paulson's Gift\"\n\"We calculate the costs and benefits of the largest ever U.S.\nGovernment intervention in the financial sector announced the 2008\nColumbus-day weekend. We estimate that this intervention increased\nthe value of banks'financial claims by $130 billion at a taxpayers'\ncost of $21 -$44 billions with a net benefit between $86bn and\n$109bn. By looking at the limited cross section we infer that this net\nbenefit arises from a reduction in the probability of bankruptcy, which\nwe estimate would destroy 22% of the enterprise value. The big\nwinners of the plan were the bondholders of the three former\ninvestment banks and Citigroup, while the losers were JP Morgan\nshareholders and the U.S. taxpayers.\"\n(The would-be destruction of the enterprise value is consistent with\nDD type runs/ineffi cient liquidations on less liquid assets.)\nAlp Simsek ()\nLecture Notes\nCourtesy of Pietro Veronesi and Luigi Zingales. Used with permission.\n\nStress tests: Incentivize and back up private capital\nSwagel (2015): \"In 2009, TARP funds were again set to be used to\nshore up the financial system, serving as the source of public capital\nbackstopping the so-called \"stress tests,\" in which bank balance\nsheets were evaluated to see whether they could withstand an\nadditional period of financial stress. Banks that lacked the\nappropriate capital as determined by the stress test would be given a\nchance to raise additional capital from the private sector after which\nthey would be required by their regulator to accept it from the TARP\n(on onerous terms meant to induce private capital-raising)....The\navailability of TARP capital was essential to making the stress tests\ncredible in that public capital was available to be forced on firms that\ncould not (or would not) raise their own in response to the results of\nthe stress test.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nStress tests: Incentivize and back up private capital\nHanson, Kashyap, and Stein (2011): \"The penalty box in this case\nwas that any bank failing to raise the capital from the private markets\nwould be required to accept an equity injection from the Treasury,\nwhich would have involved strict limits on executive compensation.\nRemarkably, in the few weeks following the release of the SCAP\n(stress test) results, the banks involved were able to raise nearly $60\nbillion in new common equity; by the end of 2009 this figure had risen\nto over $125 billion.\"\n\"Here is a case where a strong regulatory hand appears to have had\nhighly beneficial effects. Indeed, by being tough and giving banks no\nchoice, regulators probably made it easier for banks to do the capital\nraising.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nAlp Simsek ()\nLecture Notes\n\nHow did the crisis end?\nStress tests are considered to be the turning point in the US crisis.\nEurope also did stress tests in 2009 but much less successful.\nDidn't have credible public capital as backstop (political frictions).\nConsistent with important role of government support during crises.\nCaballero (2010): Make the government support more systematic....\nAlp Simsek ()\nLecture Notes\n\nDid the US follow Caballero's advice to prepare for the next crisis?\nAlp Simsek ()\nLecture Notes\nQuote from page 9 from Caballero, Ricardo J. \"Sudden financial\narrest.\" (PDF) IMF Economic Review 58, no. 1 (2010): 6-36.\n\nDodd-Frank Act: Glass is half empty\nSwagel (2015): \"What constraints will policymakers and regulators\nface when the next financial crisis arrives? It seems safe to conclude,\nbased on political considerations, that there will not soon be another\nTARP...Attacks on the bank bailouts in particular have become a\nstaple of political campaigns. Moreover, some emergency actions\ntaken during the crisis are no longer available to policymakers as a\nresult of provisions in the 2010 Dodd--Frank financial reform bill. The\nTreasury is no longer permitted to use the Exchange Stabilization\nFund to guarantee money markets. The Federal Deposit Insurance\nCorporation must now obtain Congressional approval to provide broad\ndebt guarantees. The Federal Reserve can no longer make emergency\nloans to individual nonbank institutions but must instead devise\nbroad-based programs.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nDodd-Frank Act: But it is also half full\n\"At the same time, the Dodd--Frank law provided important new\npowers for government regulators to respond to a future financial\ncrisis. Title II of the Dodd--Frank law creates a nonbank resolution\nauthority under which the government can put taxpayer funds into a\nfailing institution to prevent a collapse. Government offi cials are\nrequired to recoup taxpayer funds by imposing losses on shareholders,\nbondholders, or other counterparties of the failing firm, and ultimately\nthrough assessments on other financial sector participants if needed.\nThe FDIC is still developing the tools for such an intervention.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nRoadmap\n1 Optimal policy during crises\n2 Optimal policy to \"prevent\" crises\nAlp Simsek ()\nLecture Notes\n\nHow about ex-ante policies to prevent crises?\nThe ideal ex-ante policies are much less well understood.\nMoral hazard suggests that bank risk-taking should be restricted.\nBut mistakes also suggest the same thing in view of externalities.\nBanks (managers) will tend to take excessive risks because they do\nnot internalize the effect that their failures would have on the rest of\nthe economy.\nThey will not think hard about actions and make excessive mistakes.\nThis is not moral hazard per se- it is simply maximizing own utility.\nRegardless of MH or mistakes, it makes sense to regulate banks so as\nto make them safer than they would be on their own...\nAlp Simsek ()\nLecture Notes\n\nNeed: More capital and more liquidity\nAlp Simsek ()\nLecture Notes\n\nHow much is a diffi cult question\nThere are two dimensions to bank safety: capital and liquidity.\nEconomic logic suggests increasing buffers on both margins.\nThere are also some costs to these policies since they might restrict\nbank lending/investment in normal times.\nThe trade-off is diffi cult, especially if you take the mistakes view.\nBut it seems reasonable to increase capital requirements somewhat...\nAlp Simsek ()\nLecture Notes\n\nDoes more capital restrict lending in normal times?\nHanson, Kashyap, Stein (2011): \"But will these higher capital\nrequirements lead to increased costs for borrowers? In what follows,\nwe focus on the long-run steady-state consequences of higher capital\nrequirements, setting aside the transitional issues associated with\nphase-in of a new regime. To preview, our reading of the theory and\nrelevant empirical evidence suggests that while increased capital\nrequirements might be expected to have some long-run impact on the\ncost of loans, this effect is likely to be quite small.\"\nThey do some back of the envelope calculations to assess costs.\nThey also look at the historical record to see trace of costs...\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\n\"...we have examined the behavior of various proxies for the markup\nthat banks charge on loans. In a variety\nof regression specifications (not shown here), we found no reliable\ntime-series correlation between these markup variables and bank\ncapital ratios.\"\n\"To illustrate the loose ties between loan costs and capital ratios,\nFigure 2B plots capital ratios for the period 1920--2009 against two\nmarkup proxies: 1) the net interest margin (net interest income over\nearning assets); and 2) the yield on loans (interest income on loans\nover gross loans) minus the rate paid on deposits (interest expense on\ndeposits over deposits). As can be seen, there is no apparent\ncorrelation between capital ratios and either measure of markups.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nSo how much more capital?\nSo evidence is limited but suggests reasonable increases in capital\nrequirements will not create havoc on the financial system.\nHKS also do back-of-the envelope calculation to argue for capital\nrequirements (in good times) in the order of 15%.\n\"We have stressed the importance of requiring that financial firms\nhave both more capital, and, crucially, higher-quality capital. On this\nscore, the Basel III recommendations look quite good. They would\nraise the minimum common equity requirement from 2 percent of\nrisk-weighted assets to 7 percent (this is inclusive of a \"capital\nconservation buffer\"). While we have argued for a higher number,\nthis is a significant step in the right direction.\"\nAlp Simsek ()\nLecture Notes\nCourtesy of the American Economic Association. Used with permission.\n\nHow about liquidity?\nFor liquidity, the issues are even more complicated, because what\nmatters the most is liquidity in crisis/distress times.\nLiquidity measures in good times can be misguiding (fire sales...).\nThere are also various complications (off-balance sheet positions...).\n\"Liquidity Mismatch Measurement\" by Brunnermeier, Krishnamurthy,\nGorton (2013) discuss issues and propose an index.\nBai, Krishnamurthy, Weymuller (2015), \"Measuring Liquidity\nMismatch in the Banking Sector\" implement for the US banks...\nAlp Simsek ()\nLecture Notes\n\n\"This paper implements a liquidity measure, \"Liquidity Mismatch Index\n(LMI),\" to gauge the mismatch between the market liquidity of assets and\nthe funding liquidity of liabilities. We construct the LMIs for 2882 bank\nholding companies during 2002 - 2014 and investigate the time-series and\ncross-sectional patterns of banks'liquidity and liquidity risk. The\naggregate banking sector liquidity worsens from +$5 trillion before the\ncrisis to -$3 trillion in 2008, and reverses back to the pre-crisis level in\n2009. We also show how a liquidity stress test can be conducted with the\nLMI metric, and that such a stress test as an effective macroprudential\ntool could have revealed the liquidity need of the banking system in the\nlate 2007. In the cross section, we find that banks with more ex-ante\nliquidity mismatch have a higher crash probability and have a higher\nchance of borrowing from the government during the financial crisis. Thus\nthe LMI measure is informative regarding both individual bank liquidity\nrisk as well as the liquidity risk of the entire banking system...\"\nAlp Simsek ()\nLecture Notes\nCourtesy of Jennie Bai, Arvind Krishnamurthy, and Charles-Henri Weymuller. Used with permission.\n\nThe drop is consistent with the DD/HGG run theories we have seen.\nAlp Simsek ()\nLecture Notes\nCourtesy of Jennie Bai, Arvind Krishnamurthy, and Charles-Henri Weymuller. Used with permission.\n\nSo what causes crises and what to do about them?\nAnonymous quote: \"We have not succeeded in answering all our problems.\nThe answers we have found only serve to raise a whole set of new\nquestions. In some ways we feel we are as confused as ever, but we believe\nwe are confused on a higher level and about more important things.\"\nThank you for your attention and interest!\nAlp Simsek ()\nLecture Notes\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n14.09 Financial Crises\nJanuary IAP 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}