{
  "course_name": "Food in American History",
  "course_description": "This course will explore food in modern American history as a story of industrialization and globalization. Lectures, readings, and discussions will emphasize the historical dimensions of—and debates about—slave plantations and factory farm labor; industrial processing and technologies of food preservation; the political economy and ecology of global commodity chains; the vagaries of nutritional science; food restrictions and reform movements; food surpluses and famines; cooking traditions and innovations; the emergence of restaurants, supermarkets, fast food, and slow food. The core concern of the course will be to understand the increasingly pervasive influence of the American model of food production and consumption patterns.",
  "topics": [
    "Business",
    "Globalization",
    "Energy",
    "Climate",
    "Technology",
    "Health and Medicine",
    "Health and Exercise Science",
    "Humanities",
    "History",
    "American History",
    "Science",
    "Earth Science",
    "Sustainability",
    "Business",
    "Globalization",
    "Energy",
    "Climate",
    "Technology",
    "Health and Medicine",
    "Health and Exercise Science",
    "Humanities",
    "History",
    "American History",
    "Science",
    "Earth Science",
    "Sustainability"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis course will explore food in modern American history as a story of industrialization and globalization. Lectures, readings, and discussions will emphasize the historical dimensions of--and debates about--slave plantations and factory farm labor; industrial processing and technologies of food preservation; the political economy and ecology of global commodity chains; the vagaries of nutritional science; food restrictions and reform movements; food surpluses and famines; cooking traditions and innovations; the emergence of restaurants, supermarkets, fast food, and slow food. The core concern of the course will be to understand the increasingly pervasive influence of the American model of food production and consumption patterns.\n\nPrerequisites\n\nMIT students were required to obtain permission of the instructor.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n20%\n\nSugar Six Ways paper\n\n20%\n\nResearch Paper Proposal and Bibliography\n\n10%\n\nFinal Paper\n\n50%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nModern Ingredients\n\nFactories in the Fields\n\nFood Factories\n\nSugar Six Ways paper due\n\nAmerican Agriculture\n\nVisit from Prof. Deborah Fitzgerald\n\nWhat (Not) to Eat\n\nAbundance\n\nResearch Paper Proposal and Bibliography due 3 days after this session\n\nIndividual Meetings to Discuss Paper Proposal\n\nHunger\n\nSupermarkets\n\nAmerican Cuisine\n\nNature\n\nNovelty and Tradition\n\nVisit from Prof. H. Paxson\n\nPotluck\n\nOral Presentations of Final Papers",
  "files": [
    {
      "category": "Resource",
      "title": "Enjoying America’s Drink: The Shift from Saloon to Residence",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/143040e90feab2a55ae733d8f684b44e_MIT21H_S01F14_Fin_Pa_Beer.pdf",
      "content": "21H.S01\nAnya Zilberstein\nFall 2014\n\nEnjoying America's Drink: The Shift from Saloon to Residence\n\nIntroduction\n\nThe consumption of beer in America has been dramatically shaped by the\npolitical circumstances through which it grew up to become the giant industry it is today.\nIn 2014 there were 84 million beer drinkers in the U.S. It is a $144 billion industry and\nthe average American consumes 22 gallons per year.1 The vast majority of which is\nconsumed in private--in their own home or at a private event. Saloons and bars serve a\nsignificantly smaller portion of the overall beer consumed than they once did. This paper\nargues that the reasons for this shift from public to private consumption had many\nfactors; at the start of Prohibition people began to stockpile alcoholic beverages to be\nconsumed in their home which had not been done since the time of every family making\ntheir own homebrew for personal use. Prohibition also had a dramatic effect on the\nconsumption of beer. While it was in effect, more than half of America's breweries went\nout of business, leaving the remaining half to produce the quantity which was\n1 Mittelman, Amy.\n\nBrewing Battles : A History of American Beer\n\n. New York: Algora Pub., 2008, pp. 1.\n\ndemanded after it ended, forcing a change to quantity over quality and a loss of the pure\nand healthful perception of beer. In addition, the new laws that were set in place after\nProhibition ended prohibited breweries from controlling their entire supply chain and\nmeant that they no longer could have corner saloons that exclusively sold their\nbeer--leading to less corner saloons being available and people having to travel greater\ndistances to reach them. Technology increases also allowed for this shift towards\nprivate consumption--the invention of bottled and canned beer and the ability to mass\nproduce on a large scale.\n\nEarly Consumption\n\nAlcohol consumption in America in the 18th and early 19th century consisted of\nprimarily home brewed or home distilled beverages due to lack of technology and\ninfrastructure to produce and distribute it on any sort of larger scale. The infrastructure\nwas not sufficient to allow for mass distribution of the quickly perishable beer they were\nproducing--no bottling techniques were around yet. Most towns lacked the roads\nrequired for shipping beer from a central location. Instead, beer was brewed at home,\nmostly by women, and served at dinner for the family. Both men and women drank\nduring this time.2 Men mostly worked at home on their own land which allowed for home\nconsumption to be the most convenient way to drink beer as well. In addition, during this\n2 Mittelman, 7.\n\nMittelman, 7.\n\ntime there was no real standardization of the brewing process and the technology\nremained mostly stagnant--it was just a skill passed down from mother to daughter.\n\nThe true birth of saloons came in the early 19th century and was born out of the\nneed for public meeting places. Besides the church, most towns had very few other\nplaces where they could gather. Public drinking had a humble start. Homebrewers\nbegan to brew for a few extra guests in their kitchen every night, and eventually these\nturned into larger operations. Towns began to have one or two brewers, still family\nbusinesses, who served and supplied the town from a central location.3 These started\nas just the best of the homebrewers serving a little extra to guests, and turned into a full\nfamily operation. Celebrations, townwide meetings, and many meals were all eaten at\nthese centralized taverns. Public drinking became the normal behavior. Everyone was\ninvolved in it including the women and sometimes children. The fact that these\ncentralized taverns were small family run operations instead of big businesses allowed\nthem to be viewed in a more positive light by most. They were viewed as a necessity to\nthe town and there was very little sentiment against them--something that is lost when\nthey began being operated by big breweries.4\n\nSaloon Era\n\nSaloons became incredibly popular with the working class and the number of\nsaloons skyrocketed in second half of the 19th century. Men had started to leave home\n3 Mittelman, 22.\n4 Mittelman, 9.\n\nto go to work and drinking in saloons became a predominantly male activity as women\nwere still in charge of the home.5 In Chicago there were more saloons than grocery\nstores, butchers, and almost any other type of store. The abundance of saloons shows\nthat they were viewed as a necessity by most of the public.6 In 1897 there were 215,000\nlicensed drinking establishments in the US, and that is not including all of the illegal\nones.7 Since they served free or very cheap quality food and sold alcohol they were the\nperfect mid workday stop. This was the heyday of American saloons and public\ndrinking, and a lot of the negative sentiment that led to Prohibition came from the\nabundance of drinking establishments.\n\nThe high startup costs of saloons led most of them to be indebted to a large\nbrewery in some way--and anti-saloon proponents viewed this as an extreme negative.\nBeginning in 1881 new laws on liquor licenses brought the government into the brewing\nindustry like never before. In order for a saloon to get started, the owner had to pay a\nhigh licensing fee of between $500 and $1000 in addition to the costs of obtaining a\nsuitable building along with furnishings.8 The larger breweries, and the small ones who\nwanted to monopolize the market in their specific regions, began to financially support\nsaloon owners. Saloon keepers would pay the brewers a fee, usually around $200, and\nthe brewery would pay the licensing fees as well as purchase furnishings and anything\nelse needed. The brewer would then only be allowed to sell that brewer's beer and\nwould pay a slight premium per barrel. Around 80% of all NYC breweries prior to\n5 Mittelman, 17.\n6 Mittelman, 48.\n7 Mittelman, 48.\n8 Mittelman, 48.\n\nProhibition operated under this arrangement.9 Saloons being owned by large breweries\nand no longer being family run built up the feeling that they were corrupt.\nSaloon keepers became political forces in their neighborhoods. They were\nusually the same ethnicity as the clientele and viewed as a respected member of the\ncommunity. In a lot of cases the brewery would supply the beer so the saloonkeeper\ncould trade food and drinks for favors, jobs, votes, and goods.10 Many politicians used\nsaloons as a way to win votes by buying beer for all the constituents and delivering\nspeeches inside them. The connection of alcohol and saloons with politics was cited as\na reason why saloons were hurting society.\n\nProhibition & Repeal\n\nThe debate leading up to and the duration of prohibition were a huge burden on\nthe brewing industry and had a tremendous impact on the way Americans viewed and\nconsumed their beer. The anti-alcohol movement cited numerous reasons for wanting\nthe ban on alcohol to be put in place, among them were drunkards, political connection\nof alcohol and subsequently political manipulation, waste of money and time, and\ntied-houses (saloons indebted to breweries). The brewers and drinkers argued that beer\nwas a necessity of life, it was doing no harm in the vast majority of instances, that the\nbrewers funded through taxation a large portion of the federal government, and that\nsaloons are necessary for their social value.\n9 Mittelman, 48-49.\n10 Mittelman, 52.\n\nAnti-saloon sentiment stemmed from a view that America would be a better place\nwithout alcohol consumption, and was argued that it was a completely unnecessary\ndrag on society. One man sums the basis of the argument up: \"I am opposed to the\nsaloon and to the liquor traffic in all its forms. It is unnecessary; it is a waste; it is more\nthan that; it is a positive evil and vicious in the highest degree. It represents no\nnecessity and supplies no legitimate want.\"11 They believed that there was nothing to be\ngained from alcohol consumption and that there was no need to have saloons around. It\nwas viewed as an evil in which men would go lose themselves and become drunkards,\nand all kinds of lewd behaviour would occur.\nThe brewers took a huge hit in public opinion when they were caught trying to\nmanipulate multiple elections related to women's suffrage and public drinking.12 Before\nbrewers had been viewed as honest and tax paying companies, but after this scandal\nbroke public skepticism about the honesty of the brewers and their actions was\nheightened. In addition, women became more hostile towards drinking as the brewers\nwere found out to be very anti women's suffrage--the brewers believed that letting\nwomen vote would lead to more scrutiny of their industry. Women were the leaders of\nthe Temperance Movement and if they were given the power to vote, it would be\ndisadvantageous for the brewers.\nThe taxation of the brewing and distilling industries also led to serious changes in\nthe brewing industry and public sentiment about it. The first tax was placed on alcohol in\n11 Moore, E. C., \"The Social Value of the Saloon,\" American Journal of Sociology\n\n, Vol. 3, No. 1 (Jul.,\n1897), pp. 1-12.\n12 Mittelman, 80.\n\n1862 by Abraham Lincoln to raise funds for the civil war.13 The federal government\nentered in 1862 and has not left the industry since. Alcohol consumption was viewed by\nthe government as an inelastic good--they believed they could tax it as much as they\nwanted and people would still consume it. In 1862 the first tax rate ever places on beer\nwas $50 for a yearly license to brew and $1 per 31 gallon barrel of beer.14 By 1865,\nthese rates had risen significantly: $2/gallon of pure alcohol content which was around\nten times the rate they had been paying since 1862.15 This rapid increase in taxes led to\na spike of alcohol related criminal activity. Illegal brewing, tax evasion, and fraud started\nto give the industry a bad reputation.\nDespite this tax rate being high, brewers maintained that they were paying it\nwillingly and were happy to do their part to support the government. They believed that\nthey were crucial to funding the country and there was no way that they could be shut\ndown. This was one of the main arguments against prohibition put forth by the brewers.\nUltimately, in 1906 when the first income tax was passed to help fund WWI, the\ndependence on alcohol taxes for federal funding was reduced enough to allow for\nProhibition to occur.16\nMeanwhile, these increased taxes, steep competition with the growing number of\nbrewers, and price stagnation in the 1870's led to a huge decrease in the number of\nbrewers. There were 4131 licensed breweries in 1873 and less than 200 in 1900.17 To\nsurvive, these brewers had been starting to add cheaper materials to their beer such as\n13 Mittelman, 23.\n14 Mittelman, 27.\n15 Mittelman, 33.\n16 Mittelman, 73.\n17 Mittelman, 41.\n\ncorn and rice in order to lower costs. They never fully admitted this at the time but\nanti-alcohol supporters jumped on this claiming that beer was no longer a pure and\nhealthful drink.18\nIn this era of growing negative sentiment towards the liquor industry, drinking\nwas almost exclusively done in public establishments by men--they were boys clubs,\nsocial clubs, and a place for those \"craving of fellowship.\"19 Thomas Mador in an article\ntitled \"The Saloon as a Club\" stated that \"the saloon exists because the public demands\nit, and for no other reason.\" He claims that as long as people continue to drink in the\nUnited States, \"the saloon will be retained by the public as the most convenient and\nagreeable medium\" and that \"each man buying wholesale and mixing his own drinks is\nthe merest nonsense.\"20 From these sources it is clear that public drinking was very\nmuch the prominent way of consuming, and drinking at home had been mostly\nforgotten. As prohibition came into effect however, this mentality was changed forever.\nWith the installation of prohibition of alcoholic beverages the federal government\ndecimated an industry and lifestyle in one authoritative move. Saloons instantly became\nillegal and public drinking was halted. Prohibition had many effects on the way beer was\nconsumed--people began stockpiling alcohol in their homes leading up to the installation\nof prohibition, illegal operations of bootleggers began distributing alcohol, many\n18 Mittelman, 41.\n19 David Brundage, \"The Producing Classes and the Saloon: Denver in the 1880's,\" unpublished\nmanuscript, 1979, pp. 13.\n20 Gilmore, Thomas Mador, \"The Saloon as a Club,\" The North American Review\n\n, Vol. 157, No. 443 (Oct.,\n1893), pp. 511-512.\n\nbreweries had to shut their doors, and the soft drink industry made significant advances\nin bottling technologies.\nThe 18th Amendment to the U.S. Constitution was ratified on January 16th, 1919\nbut didn't go into effect until January 17th, 1920. People had an entire year to stockpile\nas much alcohol as they could into their homes. Once the drinks were most\nconveniently located in the home, as was the case after saloons were banned,\nconsumption in the home once again became the norm. People were not going to stop\ndrinking (if they could afford it) and the easiest way to drink, at least in the first few\nyears of prohibition, was drawing from the stockpile at home. This dramatic and sudden\nshift played a major role in the change of perception of home consumption from \"the\nmerest nonsense\"21 to the socially accepted and essentially only way to consume.\nThe rise of bootleggers also aided in this transition. While their clientele also\nconsisted of speakeasies and other illicit drinking establishments, their primary market\nwas people purchasing for personal use. In a sense they were doing exactly what they\nhad previously thought was a ridiculous idea--buying wholesale and mixing their own\ndrinks at home. If they could afford it and acquire the ingredients, people returned to\nhomebrewing as well. Al Capone was a leading bootlegger in the Chicago area and he\nalone had around $60 million in revenue. Even though bootlegging led to crime, bribery,\nand violence, there was undoubtedly a substantial market for it.22\nThirteen years without being able to sell your main or only product wiped out\nalmost half of the breweries across the U.S. Those that did survive did so by selling\n21 Mador, 511-512.\n22 Mittelman, 88-89.\n\nother goods--milk, butter, cheese, grain flour etc.23 The bigger breweries that had capital\nleft behind were in a much better position to take on a bigger share of the market once\nprohibition ended. These breweries invested significantly into better technologies and\nbottling techniques. In order to compete, smaller breweries would need to do so as well.\nAs time went on and the capital just wasn't there for the smaller breweries they were\nousted by their larger counterparts.24\nTechnological advances in the soft drink industry with regards to the machinery\nrequired to produce carbonated drinks as well as store and transport them. Bottling and\ncanning technologies were advanced to the point of being viable for large scale beer\napplications. The first canned beer was introduced in 1935 and was seen to have very\ndesirable qualities for the breweries. It was much easier and cheaper to ship than an\nentire keg or clunky bottles. The ease of shipping and carrying allowed canned beer to\nbe widely shipped and distributed. The can allowed for very effective marketing\ncampaigns for the brewery, and it allowed for portion control of beer brought home.\nInstead of tapping an entire keg or opening a large growler, a single can could just be\nopened. These advances made home consumption financially desirable for breweries\nand feasible for consumers.25\n\n23 Mittelman, 83.\n24 Mittelman, 106.\n25 Mittelman, 107.\n\nWomen & Beer\n\nSaloons became increasingly more male in the mid 1800's as more and more\nmen starting leaving the home to work, while women stayed in charge of the home.26\nWomen were mostly left out of the consumption of alcohol in the years leading up to\nprohibition, and with the scandals of breweries being opposed to women's suffrage,\nthey were the leaders in the temperance and anti-saloon movements. However contrary\nto the way Temperance leaders imagined prohibition to be, as the negative sentiment\ntowards drinking waned in the later half of prohibition women and men began to drink\ntogether in speakeasies and at home.27 After the repeal of prohibition, breweries and\ndistilleries learned quickly they had to target their marketing campaigns towards women\nas well. The results of a survey conducted every year show us that since 1939 over two\nthirds of American adults drink alcohol.28 Women become a large part of the alcohol\nindustry after Repeal, and that hasn't changed since.\nWomen were in charge of the home, and having had the drinking mostly occur in\nthe home during prohibition led women to be a part of the drinking culture once again.\nOnce Repeal was enacted women helped continue the shift towards private drinking by\nthe simple fact that they did the shopping. Now that cans/bottles were becoming readily\navailable in grocery stores where women did the shopping, beer was being purchased\nas part of the supplies for the family.29 It was the inclusion of women into the drinking\n26 Mittelman, 17.\n27 Mittelman, 111.\n28 Peck, Garrett. The Prohibition Hangover Alcohol in America From Demon Rum to Cult Cabernet\n\n. New\nBrunswick, N.J.: Rutgers University Press, 2009.\n29 Mittelman, 119.\n\npopulation by happenstance of prohibition that helped force the home to be infiltrated by\nbeer consumption.\n\nConclusion\n\nMany other social and convenience related factors played into the shift from\npublic beer consumption to the overwhelming majority of consumption being done in\nprivate. The cycle from home consumption when women were the homebrewers, to a\nmale dominate public drinking boom during the saloon era, back to mixed gender\nconsumption in the home following prohibition gives us insight into the social and\npolitical trends of the late 19th and early 20th centuries. Prohibition also forced this\nchange to private consumption by the mere fact that private consumption was the most\nfeasible way for citizens to drink. Women once again became included and since\nwomen were in charge of the home and in charge of shopping for the home, marketers\nbegan to target women as well and this led to the purchase of beer for serving at home.\nAnother major factor was the technological advances in the bottling and canning of beer\nthat allowed for mass distribution and easy consumer purchase from a grocery store. All\nthese factors pushed beer out of the saloon and into the home--and it has stayed there\never since.\n\nSecondary Works Cited\n\nBrundage, David, \"The Producing Classes and the Saloon: Denver in the 1880's,\"\nunpublished manuscript, 1979, pp. 13.\n\nMittelman, Amy. Brewing Battles : A History of American Beer. New York: Algora Pub.,\n2008.\n\nPeck, Garrett. The Prohibition Hangover Alcohol in America From Demon Rum to Cult\nCabernet. New Brunswick, N.J.: Rutgers University Press, 2009.\n\nPrimary Works Cited\n\nFox, Hugh F, \"The Saloon Problem,\" Annals of the American Academy of Political and\nSocial Science, Vol. 32, Regulation of the Liquor Traffic (Nov., 1908), pp. 61-68\n\nGilmore, Thomas Mador, \"The Saloon as a Club,\" The North American Review, Vol.\n157, No. 443 (Oct., 1893), pp. 511-512.\n\nMelendy, Royal L, \"The Saloon in Chicago,\" American Journal of Sociology, Vol. 6, No.\n3 (Nov., 1900), pp. 289-306\n\nMoore, E. C, \"The Social Value of The Saloon,\" American Journal of Sociology, Vol. 3,\nNo. 1 (Jul., 1897), pp. 1-12\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Molecular Gastronomy with a Modern Retelling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/4fd376a613a67eaf4fe9db59e40d3f89_MIT21H_S01F14_FinPa-MolGa.pdf",
      "content": "Molecular Gastronomy with a Modern Retelling\n\nIn 1969, Nicholas Kurti a University of Oxford physicist remarked that \"... it is a\nsad reflection on our civilization that while we can and do measure the temperature in\nthe atmosphere of Venus we do not know what goes on inside our souffles\".1 Kurti\nbelieved that the discovery of new food would bring more happiness than other scientific\npursuits. After many years doing physics research Kurti sought to fulfill this belief by\nperforming food research using his previous knowledge of physics to his advantage.\nThis was the first step in the creation of the field of molecular gastronomy. Kurti went\non to discover new techniques and along with Herve This, an understudy of sorts,\nbegan a series of workshops that would serve as the foundation for the field as it exists\ntoday. Kurti passed away in the waning years of the twentieth century but his legacy\nlived on in the workshops and the field itself.\n\nThis is the story that has continually been told, especially in recent years as the\npopularity of the field grows. Upon deeper examination this story is exposed as a\nfabrication. It is easy to fall back on a story when attempting to explain something so\ncomplex but the truth reveals other characters whose contributions are unfairly swept\naway without tarnishing those of Kurti and This. In addition by looking at the true\nsequence of events, it becomes possible to understand why a certain story was chosen\nand the social conditions that led to such a tale.\n\nThis fabrication goes all the way back to the beginning of the field which is much\nmurkier than the tale suggests. All the way back in 1794, Sir Benjamin Thompson\n\n1 Kurti, Nicholas, But the Crackling Is Superb. Institute of Physics Publishing. 1998\n\nbetter known as Count Rumford published an essay in which he remarked that the\napplication of chemistry and other branches of science to cookery was so apparent that\nhe predicted scientific investigation in the almost immediate future.2 Count Rumford\nbelieved the advantages were so obvious that without hesitation some enlightened\nscientist would throw off his other work and begin to reap the advantages of such\napplication. This was the basic idea for molecular gastronomy but it would become\ndifferentiated over the upcoming years. The idea of applying science to food can even\nbe traced back to second century BC from an intact papyrus that weighed the\ndifferences in meat following different processes such as fermentation and cooking. In\nthe early 19th century Marie-Antoine Careme, a famous French chef, investigated the\nproper method of making food stocks. In 1783 Antoine-Laurent de Lavoisier better\nknown for his contributions to the filed of chemistry and death by guillotine in the French\nRevolution studied the different densities of food stocks in order to evaluate quality.\nThese are only the pre-20th century contributors and they come no where close to\nbeing involved in the tale that has been woven about molecular gastronomy. It is\ncertain that the foundations for the field were set many years before even the birth of\nKurti.\n\nOne of the other main discrepancies besides the dismissal of the early\ninterworking of cuisine and science is the differentiation or lack thereof between\ngastronomy and food science. Food science is the general field for the application of\nscience to food and the early focus of food science was in the molecular interaction in\n\n2 Sir Benjamin Thompson, \"On the construction of kitchen fireplaces and kitchen utensils,\ntogether with remarks and observations relating to the various processes of cookery, and\nproposals for improving that most useful art\". 1794.\n\nfood systems. In 1932 Professor Belle Lowe published a book titled Experimental\nCookery: From the Chemical And Physical Standpoint which was a standard textbook\nfor emerging field of home economics. This book contained many different experiments\nand referenced many of the earlier work in the field. With chapters focusing on the\ncoagulation of proteins, factors affecting the viscosity of cream and other similar\nfocuses, it is easy to see where the confusion can arise.3 With a table of contents that\ncould be confused for a university science curriculum it becomes extremely difficult to\ndifferentiate this from the field of molecular gastronomy. Another group in this field are\nEvelyn Halliday and Isabel Noble who were both home economics professors who\npublished a book Food Chemistry and Cookery that contained similar titles as Lowe's\nwork.4 Halliday and Noble's work was even more scientific with looks into things such\nas hydrogen ion concentration and illustrations of lab experiments. For anyone looking\nat this field its very difficult to figure out why these are not considered to be part of the\nlineage of molecular gastronomy. In truth the modern meaning of gastronomy is\ncertainly built on the works of the home economics professors of the early 20th century\nand even those of the 19th century as the techniques that were discovered would be\nutilized in the field in later years.\n\nWhile the work of earlier food science is a part of molecular gastronomy there is\na clear delineation between the two fields. Some of the confusion that arises when\ntying food science and gastronomy directly together is because of the choice of name.\nThe name molecular gastronomy was chosen because in the organizing of the first\n\n3 Belle Lowe, Experimental Cookery: From the Chemical and Physical Standpoint(Nabu Press:\n1932).\n4 Evelyn G. Haliday and Isabel T. Noble, Food Chemistry and Cookery (University of Chicago\nPress: 1943).\n\nworkshop in 1992, the director of the venue where the gathering was to be held wanted\na more fanciful title.5 So in order to meet the whimsy of the director the word molecular\nwas added to the title of science and gastronomy. Today the misnomer has stuck and\nis not representative of the work that is going on. In the early 1990s the name referred\nto the way scientists examined what happened in food at a smaller level mostly in\nrelation to past recipes and techniques. Later on the field developed and began to\nmove more away from its strict scientific roots to a more unique artistic brand of\ncooking. Nowadays chefs that would technically be classified as molecular\ngastronomists are rejecting the term for the cold scientific nature of the name. There is\na belief that was shared at the 2009 Madrid Fusion conference that the name doesn't\nproperly define their work at the intersection of science, art, psychology and cooking.\nEven though they agree that the term molecular gastronomy is not appropriate, even\nwith the benefit of hindsight they are unable to agree on a clear definition and distinction\nbetween gastronomy and science. As a result of this lack of definition it can become\ndifficult to understand just how the field started and from whom it began.\n\nThe other main area of the creation of the field is focused on the workshops\norganized during the early 1990s. These workshops based in Erice, Sicily came to be\nknown as the Erice workshops and have been attributed to Kurti and This. The story\nwrongly discredits Elizabeth Cawdry Thomas who was instrumental in the formation of\nthe workshop. Thomas was married to a physicist and ran a cooking school in\nBerkeley, California. Thomas is one of the few Americans who was deeply involved in\nthe movement. In a 1992 letter professor Ugo Valdre credited Thomas with coming up\n\n5 Helston Blumenthal, Ferran Adria and Harold McGee,\"Misnomer of a Name\". (Madrid Fusion\n2009). Transcribed by Heather Sperling.\n\nwith the main idea for the workshop and was surprised at her lack of prevalence in the\nliterature.6 Valdre remarked that the possibility for Thomas not being listed in the\nOrganizing Committee was to avoid publicity for her Cooking School. Even Kurti in a\nletter to the another organizer credited Thomas with sparking off the project and being\ninstrumental in the progress of the workshop.7 Yet within the same letter Kurti referred\nto Elizabeth Thomas as a \"representative of the domestic chef\". Kurti did not give the\nsame almost condescending representation of the other two co-organizers. In his\ndescription of the event to the director of the Center where the workshop was to be\nheld, Kurti described Dr. Harold McGee and Dr. Herve This as both incredible cooks\nand scientists with glowing resumes of publications and accomplishments. Kurti already\nhad strong relations with both as he had reviewed McGee's work and had assisted This\nwith his ongoing dissertation only a few months prior. He also routinely visited the two\nand had a much closer relation than Thomas who he had only been introduced to in the\nprevious year with irregular correspondence by mail representing almost the whole of\ntheir relationship. It makes sense that Kurti would prefer to work with two people he\nconsidered friends and colleagues instead of someone he barely knew but by no means\ndoe that make it fair. Kurti ended up excluding the founding member of the group that\ncame up with the idea as well as one who was in the words of Ugo Valdre \"instrumental\nto the starting, organization and successful achievement of the Erice Workshop on\nMolecular Gastronomy.\" When the pamphlet came out advertising the event, Thomas'\nname was almost impossible to find while Kurti, This and McGee enjoyed extreme\nprominence on the front cover. Valdre went on to elaborate in his letter to Thomas that\n\n6 Ugo Valdre, letter to Elizabeth Cawdry Thomas. March 9, 1992.\n7 Nicholas Kurti, letter to Harold McGee. July 28, 1991.\n\nhe disagreed with her lack of inclusion and the reasons that Kurti cited. Even McGee\nhas come out more recently to bring credit to Thomas and in his own words placing her\ncontribution on par with Kurti. McGee left the organizing committee after the first\nworkshop in 1992 leaving Kurti and This as the preeminent members of the workshop\nwhich they would remain until Kurti's death six years later. This would continue to run\nthe workshop with the name changed to the International Workshop on Molecular\nGastronomy ' N. Kurti'\". In 1995 This published his doctoral dissertation titled Molecular\nand Physical Gastronomy in which he laid out the objectives of the field.8 Dr. This in\neffect established himself as the father of molecular gastronomy by calling himself its\nfounder.\n\nNow that it is clear that Thomas was cut out of credit for the Erice workshop it is\nimportant to attempt to understand precisely why she was not credited appropriately.\nLike Belle Lowe, Evelyn Halliday and Isabel Noble Thomas had no formalized scientific\ntraining. She picked up her knowledge from relationships with her first husband who\nwas a physicist and his colleagues with whom she had casual conversation. It became\neasy to pigeonhole Thomas in with the founders of the home economics movement.\nShe was a woman with no formalized scientific knowledge who enjoyed cooking. Kurti\neven called her a representation of the domestic chef. She had come up with a brilliant\nidea to bring all these persons together but she was not viewed on the same level as\npeople like Kurti or This who had formalized scientific training along with years of putting\nthem to work in the kitchen. As a result it was possible that her skills were greatly\ndiscounted after being lumped in with a group that also struggles to get recognition.\n\n8 This, Herve, \"La gastronomie moleculaire et physique\" (PhD diss., University of Paris VI) 1995.\n\nThe work of the home economics professor of the early 20th century also deserve at the\nvery least some credit for the foundation they laid for later scientists. Even some of the\nexperiments they did would not have looked out of place at the Erice workshops as they\napproached food topics from very scientific perspectives. Yet they too have been\nthrown aside for they did not show the creativity that later male counterparts did. This is\na known problem in the world of food especially when it comes to chefs. All four of\nthese women would be classified as chefs and are not alone in receiving less than\nadequate recognition. In San Pellegrino's list of the world's 50 Best Restaurants only\ntwo women appear, both one half of a male female team.9 Women are certainly under\nrepresented in the culinary world and have been for some time. Many have speculated\non the causes with some focusing on the difficulties of motherhood coupled with a\ndemanding job, others speculating about the fault within the kitchen atmosphere or in\nthe media portrayal of high profile male chefs. Whatever the real reason may be, it\ncannot be ignored that there exists a stigma towards women when it comes to the\nkitchen. It is certainly a possibility that similarities in background between Thomas and\nearlier home economics professors allowed the former to be discounted despite the fact\nthat her contributions were appreciated by many. This discrimination if true would fall\non the shoulders of the organizers This and Kurti.\n\nGender discrimination may not have been the only reason that Thomas and\nothers were marginalized. Another name that hasn't come up yet but was influential in\nthe formation of the field is Ferran Adria. Adria is considered one of the best chefs in\nthe world and practices techniques that would fall in the realm of molecular gastronomy.\n\n9 San Pellegrino & Aqua Panna. \"The World's 50 Best Restaurants Guide 2014\" (2014).\n\nIn 1988 he began experimenting with scientific cuisine and opened his own laboratory-\nworkshop in 1997 to further this study. He was one of the great chefs at the time who\nwas using methods being discussed at the Erice workshop. He would have been a\nperfect example of this new cuisine and is considered by McGee to be the most\ninfluential pioneer of experimental cooking. But he was never invited to Erice. Despite\nall of the talk for the innovation and birth of molecular gastronomy at Erice, only two\nchefs emerged as serious renowned chefs. Heston Blumenthal and Pierre Gagnaire,\nEnglish and French respectively, were the only two to have attended the workshops and\ntranslate that to restaurant success. Even then Blumenthal only started attending in\n2001 and Gagnaire in the words of McGee was entreatingly ambivalent about the\ntechnical innovation.10 So the workshops were not instrumental in the development of\nany of the famed gastronomists. Blumenthal actually amazed the assembled crowd\nwhen he attended when he demonstrated what was occurring in the outside world. Even\nthese two had something in common with the other members of the workshop and that\nwas there nationality. The composition of the workshop participants was decidedly\nFrench and English focused. Adria was Spanish and no chef working in Spain was ever\ninvited. Even Kurti who was of Hungarian birth was noticeably French and English in\nhis demeanor. He spoke both French and English and even attended the Sorbonne in\nParis during his earlier years. He was a member of the Royal Society and gave his\ncrackling is superb talk in front of the decidedly English audience. Herve This was a\ncomplete Frenchmen with his education coming in France along with working for the\ncountries' government on multiple occasions. There has always been a significance\n\n10 Harold McGee, \"The Curious Cook: More Kitchen Science and Lore\". (Wiley, April 1992)\n\nthat comes with French cuisine. With its long and rich history French cuisine has been\nseen as the pinnacle of culinary expertise since the end of the French Revolution. As a\nresult it is not uncommon to associate those of French origin as more able chefs. This\ntheory does not just apply to the Spanish as someone like Elizabeth Thomas could have\nbeen discriminated against for her American nationality. It is not uncommon for old\nworld prejudice to exist. Even many of the naming of new techniques are named in\nFrench such as sous vide which means cooking under vacuum. It is impossible to\nexamine molecular gastronomy without analyzing the stigmas that have been\nassociated with certain nationalities.\n\nAfter looking at the history of gastronomy from the perspective of the story that\nhas been told, as well as what actually happened and the discriminations against\ncertain parties it becomes necessary to look at why the story was chosen. Why are\nThis and Kurti considered the two fathers of molecular gastronomy when there are so\nmany other contributors? With the benefit of hindsight it becomes very clear why the\nstory of This and Kurti was chosen. Both chefs are male with decidedly French\ninfluences and fit well into the outsiders perspective of molecular gastronomy. They are\nscientists first who turned to food after either old age or curiosity led them to apply\nscience to food. They were close friends despite Kurti being over forty years older than\nThis. Kurti was able to act as a mentor of sorts for This who had the ability to start his\ninvestigations at a much younger age and not be one of the few involved in the field. In\naddition, despite being a bit cynical, the death of Kurti allowed him to immortalized as a\nfounder of the field. This took advantage of Kurti's death by attaching the name of his\ndeparted colleague to the workshop of which he was the primary organizer. In no way\n\nis it implied that this was purposefully done by This. The effect is that This was able to\npermanently attach himself to Kurti's legacy one which was only enhanced by his tragic\npassing. As the field gained more and more steam the Erice workshop provided a\nstrong starting point that allowed people to classify a definite start and end. This\nnarrative while convenient has been shown incorrect but a it has been proven that in\nmany cases that the clean narrative is preferred over the truth when it comes to\nunderstanding history. This narrative became so widespread that This himself even\nfocused on this narrative in a 2005 paper. He acknowledges some of the previous work\nsuch as Lavoisier and Count Rumford but does not acknowledge any of the home\neconomics professors or Elizabeth Thomas.11 This instead creates a delineated by\nsaying that Kurti and This incorrectly defined the field when they first started and that\nmolecular gastronomy was the science of culinary process and that what had come\nbefore was the science of ingredients. This fact may be true but This easily casts aside\nthe work of those who came before and does not acknowledge people like Thomas who\nwere instrumental in the foundation of this new field anyway. Overall the narrative\nmakes sense. It is easy to understand for a layman and conforms to some of the\nprejudices that may have been present at the time.\n\nThis has not been an attempt to undermine or sell short the work of Kurti and\nThis. They were obviously very involved in the process and deserve a share of the\ncredit. The argument is that there are others who have been not given the credit they\ndeserve and who should be considered alongside the two supposed founders. This is\nespecially true when looking at the reasons why some of these people may have been\n\n11 Herve This, \"Food for tomorrow? How the scientific discipline of molecular gastronomy could\nchange the way we eat\". EMBO REP (7(11)) November 2007. doi:10.1038/sj.embor.7400850\n\nomitted for reasons such as gender or nationality. Narratives are powerful. They are\nsuccinct, easily digestible and in the best of cases true. But when the narrative strays\nfrom the true story and complex interactions are boiled out, it does a disservice to those\nwhose work should not be forgotten. People like Elizabeth Thomas made molecular\ngastronomy and the gathering of people possible. People like Belle Lowe laid the\ngroundwork on which food science was built and she in turn worked off the discoveries\nof people like Lavoisier. This process was by no means linear. Still the true story, while\na little messier, gives credit where it is due and allows a proper understanding of the\nsocial conditions that accompanied this field. At the very least we are closer to\nunderstanding what happens in a souffle.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Some Tips for Writing History Papers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/83c15a770012b087423c5e92552d2015_MIT21H_S01F14_Tip_for_Wri.pdf",
      "content": "Prof. A. Zilberstein\n\nSome Tips for Writing History Papers\n\nAs you compose or revise your history paper, consider these guidelines:\n\n- Write in the past tense. The \"literary present\" is acceptable in other disciplines but not in\nhistorical writing. For example--using the literary present you might write: \"William Wood\ndescribes the various species of fish abounding in the waters off the coast of Cape Cod.\"\n\nInstead: Rely on the past tense to emphasize that you are writing about a\nphenomenon that was specific to a particular time and that this phenomenon\nhas changed: \"William Wood described the various species of fish ...\"\n\n- Avoid vague generalizations. Historians value specificity, not broad, trite, or ahistorical\nphrases like \"societies have always...\" \"once upon a time,\" or \"from the dawn of history...\"\n\nInstead: Provide key descriptive details and necessary context. Contextualize\nthe topic of your paper in the historical setting that is most relevant for staging your\nanalysis (thesis statement) and supporting evidence. For example: \"By the middle of\nthe eighteenth century, colonial settlement had expanded from the coast to the\nAppalachian Mountains, which marked the frontier between British, French, and\nNative territories.\"\n\n- Avoid anachronism. Resist the temptation to relate all historical arguments or concerns to\nideas and events that occurred long after the events you are analysing took place. Cultivate\nan informed sense of historical distance from your subject, rather than clinging to\npreconceptions based on your own personal experience or current events.\n\nInstead: Approach your historical subject with curiosity. Strive to investigate\nand understand the past on its own terms and remember that historical actors\ncould not know the future, including contemporary values or assumptions.\n\n- Paraphrase if you can, quote if you must. Many students rely on quotations as a crutch,\nthereby missing an opportunity to develop their analytical skills.\n\nInstead: Quote sparingly. When you do quote, briefly introduce the source and\ncontext of every remark for the benefit of the reader. For example: \"Samuel\nWilliams, Hollis Professor of Mathematics at Harvard College in the 1780s, taught\nhis students that the \"peculiar advantage\" of mathematics was its \"exactness.\"\n\n- Take some time to outline the sequence of events about which you are going to\nwrite. Include specific dates if possible. This chronology will not be included in the paper\nbut it is guaranteed to be immensely helpful for organizing your thoughts about the topic,\nyour notes on primary and secondary sources, and ultimately for outlining your paper.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Spam: Marketing an Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/7a8a6c7c713d56240eb90a77683e65e4_MIT21H_S01F14_Fin_Pa-SPAM.pdf",
      "content": "Massachusetts Institute of Technology\n\nSpam\n\nMarketing an Identity\n\nFood in American History - 21H.S01\n\nAnya Zilberstein\n\nFrom the front lines of World War II to the kitchen counters of American\nhouseholds, Spam has been integrated into American culture through a variety of\napplications. Spam's evolution in the American marketplace has been defined by\nthe corporate initiatives taken to shape the product's identity. Following the\ninitial booming sales in World War II, Spam struggled to distance itself from the\nutilitarian perception that many Americans had developed from the stories of the\nproduct on the front lines. As a result, Hormel, the company that developed Spam,\ninvested heavily into marketing strategies that focused on household applications\nof Spam. Although these strategies proved successful in the 1950's and early\n1960's, Spam's popularity dramatically decreased as Hormel reduced the\nproduct's marketing presence in mainland America.\nThe underlying perception of Spam throughout its popularity in America\nwas that of a product made for the military. This shared belief by consumers led\nHormel on an uphill battle of marketing Spam with a new identity, a battle that\nseemingly could not be won. Regardless of the marketing efforts by Hormel, there\nexisted a stigma in the marketplace of which the grandiose corporate marketing\ntechniques could only cover for so long. These forced identities that Hormel\ncreated began to dissolve with the shift of Hormel's focus toward more inviting\nmarkets.\nIn contrast to the strained efforts put forward by Hormel in mainland\nAmerica to create a new identity for Spam, the product flourished independently\nof marketing campaigns in Asian and island nations. Following World War II, the\nunpredictable supply of Spam caused the product to be viewed as a novelty item in\n\nthese emerging markets. Once distribution was established to these consumers,\nthey were quick to adopt Spam into their local everyday cuisine. This organic\ngrowth of Spam's popularity has allowed the product to remain a staple food in\nthe diet of island nations.\nIn the 1930's, the meat industry threw out thousands of pounds of unused\npork shoulder meat each year. The pork shoulder was considered to be of lesser\nvalue than that of other pork cuts, and the time it took to remove the shoulder\nmeat from the bone was typically not worth the investment. Jay Hormel, the CEO\nof Hormel Foods Corporation at the time, saw this unused meat surplus as a\npromising opportunity. Throughout the 1930's, Hormel had become increasingly\nmore interested in canned products and their extended shelf life. After seeing the\nprevious success of industrial-sized canned ham from the late 1920's, Hormel set\nout to create a small, family-friendly food product that utilized the shoulder meat.\nWith this vision in mind, the Hormel Foods Corporation introduced Spam in\n1937.1\nSpam's introduction into the marketplace coincided with the beginning of\nWorld War II. Jay Hormel, an isolationist, personally opposed the United States'\ninvolvement in the war. It was not until seeing the nation's support following the\nPearl Harbor attacks that Hormel realized the marketing power that the war could\nprovide for the newly invented canned product. Spam was deemed the perfect\nfood for feeding troops. It was considered cheap, nourishing, filling, and very shelf-\n\n1 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 4-5\n\nstable.2 Spam being included in the war meant that Hormel Food Company could\nreach thousands of new users within the military, expand its distribution to many\ndifferent areas of the world, and piggyback on the marketing of heightened\nnational pride back home.\nAs Hormel expected, the sales of Spam skyrocketed dramatically during the\nwar. Between 1939 and 1942, net sales doubled to almost $120 million. By 1944,\nit was estimated that 90% of all of Hormel's canned goods were being distributed\nto military troops or to military aid programs.3 It became evident that with these\nlarge military contracts, marketing was not the most essential aspect of Hormel's\nbusiness plan. The United States military was clearly not purchasing Spam as a\nresponse to its marketing campaign, but instead because of its practical qualities.\nAdditionally, Hormel was not given much freedom throughout the war for\nmarketing on the front lines, as the military controlled the packaging for logistical\npurposes.\nDue to the lack of Hormel's active marketing, Spam's early identity was\npredominantly a result of the soldiers' opinions. Spam became one of the most\noverstocked foods in the military supply chain and as a result, many soldiers\nbecame exhausted of this food. The repetitiveness of Spam in the military diet led\nto an overall negative perception by soldiers across the front lines. Spam was\noften referred to as \"the ham that didn't pass its physical\" and \"meatloaf without\n\n2 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 16\n\n3 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 17\n\nbasic training\". Although the name of the product was not intended to by a known\nacronym to the public, the soldiers began describing the food as \"SPecial Army\nMeat\". 4\nBy providing Spam on the front lines, Hormel could use this consumption\nas a case for how the product would perform with little or no marketing.\nUnfortunately for Hormel, the many negative stories that originated from the front\nlines did not give Hormel confidence in their product going forward in the post-\nwar era. One example of a soldier's negative opinion of Spam was that of Walter\nMcClatchey. McClatchey and his unit were freezing and starving one winter day,\nwaiting for the Air Force plane to deliver a drop-off of food to their line. As the\nplane came overhead, his unit cheered for the anticipation of food. However,\nwhen the boxes came closer to the ground everyone could read the big logo on the\nside: \"Spam\". McClatchey recalls, \"We shot the hell out of it\". He went on to say\nthat even the German prisoners refused to eat it. These types of stories often\ncirculated throughout the troops, which solidified a negative perception toward\nthe product amongst their primary consumers.5\nIt soon became clear that Spam had acquired a solely utilitarian perception.\nHormel understood its place in the market and was not too concerned with the\nnegative associations at first because their sales were booming. However, at the\nfirst glimpse of Allied victory, it became apparent to Hormel that their business\n\n4 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 20\n\n5 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 21\n\nmodel was not fundamentally sound or sustainable. Hormel only had one\nsignificant distributor, the United States military, with no solid grasp at all on the\ndomestic market. In the later years of the war, Hormel decided to turn their focus\nback to the United States mainland.6 With this new focus, Hormel needed to begin\nits use of heavy marketing to create a new, positive identity with the U.S.\nconsumer.\nOnce the war began to die down and the U.S. involvement dramatically\ndecreased, the amount of Spam orders from the military posts in the island nations\ndeclined significantly because the military need had subsided. Looking for a new\nmarket to capture, Hormel set their eyes on the housewives of mainland America.\nWith the heightened national pride following the strong success of the American\nmilitary in World War II, Hormel knew they could capitalize on their strong\nmilitary involvement. From a strategic point of view, Hormel increased their\nSpam advertising campaigns in order to get families introduced to Spam before\nthe war was over and to ensure a seamless transition for when the soldiers came\nback7.\nWith the conclusion of the war, as expected, Hormel's bottom line began to\nshrink. Hormel needed to respond to the changing consumer quickly in order to\nremain relevant in the marketplace. Hormel had pinpointed several potential\nmarkets, but it became necessary for them to understand the trends of these\n\n6 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\npp. 34\n7 Wansink, Brian. Changing Eating Habits on the Home Front: Lost Lessons from\nWorld War II Research. American Marketing Association. Journal of Public Policy &\nMarketing, Vol. 21, No. 1, Social Marketing Initiatives (Spring, 2002), pp. 90-92\n\nprospective users. As canned and preserved foods became more popular in the\nkitchens of American housewives, there was a push by most food companies to\nappeal to the easy-preparation trend.8,9 Hormel believed that Spam had the\npotential to fit well into this category. The next step in Hormel's marketing\nstrategy was to educate the consumer. Given that Spam was a relatively new\nproduct in the kitchen, a significant percentage of the intended users were\ncompletely unaware of how to incorporate this product into their meals. Hormel\nhad thus identified a new niche for Spam in the marketplace, and therefore\nunderstood that they needed to invest more in marketing. Instead of allowing\nconsumers the chance to experiment with Spam in their kitchen and find their\nopinions independently, Hormel could craft their identity in the marketplace\nthrough strategic marketing10.\nIn the 1950's and into the early 1960's, Hormel reached out to multiple\nadvertising companies to help push their product into the consumer market\nthrough various marketing strategies. One particular individual who helped\nHormel with this challenge was Jean Wade Rindlaub. Rindlaub was one of the first\nwomen to become a powerful advertising executive in the United States. She\n\n8 Neuhaus, Jessamyn. The Way to a Man's Heart: Gender Roles, Domestic Ideology,\nand Cookbooks in the 1950s. Journal of Social History, Vol. 32, No. 3 (Spring,\n1999), pp. 529-555\n\n9 Patten, Marguerite. Spam: The Cookbook. London: Octopus Pub. Group, 2001.\nPrint.\n\n10 Wansink, Brian. Changing Eating Habits on the Home Front: Lost Lessons from\nWorld War II Research. American Marketing Association. Journal of Public Policy &\nMarketing, Vol. 21, No. 1, Social Marketing Initiatives (Spring, 2002), pp. 92-99\n\nidentified that in order to achieve the desired new image for Spam, Hormel needed\nto distance itself from the utilitarian image that many soldiers brought back home\nfrom war. Rindlaub had two main focuses on the Hormel account. One focus was\nto predict the evolution of Spam in the marketplace, which involved identifying\npotential markets, both domestic and international. Her second focus was to find\nways in which Spam could appeal to the classic American housewife.\nFocusing specifically on her second objective, Rindlaub helped develop\nextensive strategies for integrating Spam into the American household. One of her\nmain strategies was through the use of cookbooks. By outlining to housewives the\nvarious ways that they could use the product, Hormel was able to better control\nthe perception of Spam. The cookbooks included all varieties of dishes with the\nultimate goal of incorporating Spam into as many different aspects of daily life as\npossible. Section headings in the cookbook include titles such as \"Children's\nLunches\", \"Spread Crackers with Spam Spread\", and \"French Toast Spam-wiches\".\nThis large marketing expenditure exemplified Hormel's desire to move Spam away\nfrom a one-meal product and towards a more versatile meat that could be used in\nall meals11.\nThroughout the late 1950's and early 1960's, this marketing campaign kept\nSpam as a staple item in grocery stores. A letter by Rindlaub in 1963 to Pat Dolan,\na Hormel executive, details her beliefs on Spam's battle with competition and\nSpam's recovery from decreasing sales. Rindlaub states, \"There were as many as\n\n11 Rindlaub, Jean Wade, 1904-1991. Papers of Jean Wade Rindlaub, 1899-1991\n(inclusive), 10.6, New Food Ideas, 1961-1963.\n\n180 imitators. But through all the years we have had the account, it has kept its\nNo. 1 share of market. Service advertising had a lot to do with this - ways to bake\nand broil and fry ham, Spam-whiches, Spam and eggs - a world of new and easy\nideas.\"12 From this quote, it is clear that Hormel's corporate initiatives helped\npreserve the image of Spam even during the times when the quality of food was\nhighly debated by the men who had returned from war.\nAnother corporate initiative used to maintain the sales of Spam from the\nlate 1940's through the 1950's was The Hormel Girls, a performing group. On any\ngiven Sunday evening, the program Music with the Hormel Girls would be\nbroadcasted across the nation on the radio, the primary source of entertainment\nfor middle class America at this time. This program was a band of female World\nWar II veterans who were organized to market Hormel's food products.13 The\ngroup would also tour the nation, performing in a variety of settings including\nvillage band shells, theaters, and universities. They used an assortment of sales\nstrategies as well as musical performances to sell Hormel's products. These\nstrategies included in-person cooking demos and personal stories from the front\nlines. 14\n\n12 Rindlaub, Jean Wade, 1904-1991. Papers of Jean Wade Rindlaub, 1899-1991\n(inclusive), 10.7, New Food Ideas, 1961-1963.\n\n13 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999.\nPrint. pp. 18\n\n14 Sullivan, Jill. The Hormel Girls. University of Illinois Press. American Music, Vol.\n25, No. 3 (Fall, 2007), pp. 282-311\n\nHormel made a significant decision to continue the simplicity of Spam\nfollowing the war, mainly because Jay Hormel liked his products to be simple and\nto have unpretentious names.15 Because of this blandness, the product was often\nconsidered ordinary. Through the productions of The Hormel Girls and the use of\nevening radio programming, a more grandiose appearance was formed around the\nbrand. This image was used to disguise the utilitarian perception that originally\ncame out of the war. The use of veterans as performers was also used to appeal to\nall of the former troops who may have had poor experiences with the product\nduring their service.\nBy the 1960's the canned food market became very saturated with\ncompetitors. Marketing campaigns such as The Hormel Girls became too\nexpensive as the return on investment began to dwindle. Many attribute this\ndecrease of the program's popularity to the replacement of radio by a new\ninvention, television. Because of these changes, Spam struggled to maintain its\nhold on American housewives. Around this time, Hormel decided to focus its\nefforts on more promising emerging markets, namely Hawaii and Asia. Because of\nthis reduction in marketing, Spam then began to adopt a novelty item image in the\nU.S. marketplace. From the 1970's and on, after the initial decline, Spam was able\nto maintain a steady market share in the canned meat sector. Today, Spam is\nregularly integrated into the meals of approximately 30% of American households.\nAlthough the product maintains strong sales, it is often associated with\nimpoverished regions because of its low cost.\n\n15 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999.\nPrint. pp. 5\n\nIn contrast to Spam's history in the continental United States, this product\nhad an entirely different trajectory in different geographical areas of the world.\nFrom the research that was conducted by advertisement agencies and individuals\nlike Jean Rindlaub, Hormel began to notice an increase in demand from markets\nsuch as Hawaii, the Philippines, and other island nations beginning in the late\n1950's 16. In a contradicting strategy from what Hormel implemented in the\nmainland U.S., the company put very little marketing resources into these island\nmarkets towards the end of World War II. In the late 1940's, local island stores\nand neighborhoods were supplied with Spam as military relief or when there was\nexcess stock in the military supply chain. Because of this unpredictable supply\navailability, Spam was instead viewed as a novelty product.17\nAs the mainland American household became a less attractive market for\nHormel, they turned their focus toward these island markets that had\nincorporated Spam organically into their diet with minimal marketing efforts by\nthe corporation. As an example, Spam musubi, a sushi-like rice and Spam roll,\nbecame a popular snack and lunch food item in Hawaii without the efforts of big-\nname advertisers like Rindlaub developing recipes.18\n\n16 Rindlaub, Jean Wade, 1904-1991. Papers of Jean Wade Rindlaub, 1899-1991\n(inclusive), 10.6-10.7, New Food Ideas, 1961-1963.\n\n17 Miyares, Ines. Expressing \"Local Culture\" in Hawai'i. American Geographical\nSociety. Geographical Review, Vol. 98, No. 4 (Oct., 2008), pp. 525-531.\n\n18 Miyares, Ines. Expressing \"Local Culture\" in Hawai'i. American Geographical\nSociety. Geographical Review, Vol. 98, No. 4 (Oct., 2008), pp. 513-520.\n\nOnce the significant size of the potential island and Asian market was\nrealized, Hormel began to invest in marketing and distribution to meet the\ndemands instead of entirely focusing on the domestic market. The effects of\ncorporate marketing became apparent in the late 1950's. As more product testing\nand marketing was completed by Hormel, more varieties of Spam became\navailable in the island and Asian markets. Each variety appealed to the local\ncuisine. For example, in China the Spam formula contains more meat and less salt\nin order to accommodate the cultural tastes.19\nThis movement from virtually no marketing in the early 1950's to a large\nallocation in the 1960's is a direct contrast to that of mainland America. As Spam\nhad progressed from a staple item to a novelty item throughout the mainland U.S.,\nSpam's presence in Asian and island markets did the completely opposite and had\ndeveloped from a novelty product to an staple grocery item. In these regions,\ncanned foods do not carry the same \"poor food\" stigma as in mainland United\nStates. Canning food is necessary for aspects of transportation such as shelf life\nwhen delivering products to island nations via shipping routes. Since grocery\nstores often contained mainly canned and preserved food, the fact that Spam was a\ncanned food did not lead to the impression that Spam was a \"poor person's food\";\ninstead, it fit well with the existing grocery store products. Additionally, many\ncompanies produced imitations of Spam in these marketplaces, so this lower\nquality competition helped remove any perceived cheapness of Spam in the eyes\nof the consumer.\n\n19 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999.\nPrint. pp. 12\n\nHormel continues to invest in marketing campaigns in the Asian and island\nmarkets today. Through various partnerships, Spam is utilized in popular fast\nfood companies such as Burger King in Korea and Japan. In the Philippines, Spam\nis seen as a cultural symbol. There are nine different varieties of Spam available in\nthe Philippines, and the country purchases an estimated 1.25 million kilos of the\nmeat every year.20\nThe success of Spam in both the mainland U.S. and island nation\nmarketplaces can be traced back to their introductions into the respective\nmarkets. Hormel Corporation had to incorporate a significant amount of\nmarketing in the mainland United States as they fought to alter the stigma from\nSpam's military applications. This identity that Hormel forced upon American\nconsumers broke down in the 1960's as the advertisement campaigns could not\nsustain the image of the product and differentiate the product from competitors.\nOn the contrary, Spam in the Pacific took on a much more organic evolution. With\nthe early years of consumption free from corporate marketing strategies, the\nPacific societies were able to incorporate Spam into their diets in a more natural\nprogression. Without the cookbooks and lavish travelling groups informing\nconsumers how to use Spam, the Pacific created recipes much more meaningful to\ntheir culture that have remained a part of their society to this day.\n\n20 Wyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999.\nPrint. pp. 14\n\nBibliography\n\nMiyares, Ines. Expressing \"Local Culture\" in Hawai'i. American Geographical\nSociety. Geographical Review, Vol. 98, No. 4 (Oct., 2008), pp. 513-531.\n\nNeuhaus, Jessamyn. The Way to a Man's Heart: Gender Roles, Domestic Ideology,\nand Cookbooks in the 1950s. Journal of Social History, Vol. 32, No. 3 (Spring,\n1999), pp. 529-555\n\nPatten, Marguerite. Spam: The Cookbook. London: Octopus Pub. Group, 2001.\nPrint.\n\nRindlaub, Jean Wade, 1904-1991. Papers of Jean Wade Rindlaub, 1899-1991\n(inclusive), 10.6-10.7, New Food Ideas, 1961-1963.\n\nSullivan, Jill. The Hormel Girls. University of Illinois Press. American Music, Vol. 25,\nNo. 3 (Fall, 2007), pp. 282-311\n\nWansink, Brian. Changing Eating Habits on the Home Front: Lost Lessons from\nWorld War II Research. American Marketing Association. Journal of Public Policy &\nMarketing, Vol. 21, No. 1, Social Marketing Initiatives (Spring, 2002), pp. 90-99\n\nWyman, Carolyn. Spam: A Biography. San Diego, CA: Harcourt Brace, 1999. Print.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sugar Six Ways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/772a2cf1dc16554556ff2bd86c837e6e_MIT21H_S01F14_Su_6Wa_Ins.pdf",
      "content": "21H.S01: Food in American History\n\nSugar Six Ways\n\nDue: Session 4\n\nWhat:\nLocate a historical recipe published before 1986 that requires sugar. How does your recipe\nrepresent one or more of Sidney Mintz's six \"principle uses\" of sugar (which he lists in\nchapter 3 of \"Sweetness & Power: The Place of Sugar in Modern History\")? Are there ways\nin which it does not conform to his six-point model? Why or why not? Write an essay of\nroughly 5 pages explaining the ways in which the use of sugar in this particular recipe fits\nwith--and also, diverges from--Mintz's argument about the continuities and changes in the\nsix ways that sugar has been used and consumed over time. Make sure that your essay has\nthese essential components, not necessarily in this order:\n\n1. Your own original, clearly stated argument, i.e. your answer to the questions posed, above.\n2. Your assessment of Mintz's argument about the six functions or uses of sugar.\n3. A description and discussion of your recipe as a primary source, as far as you know--who\nwrote or prepared it? When? Where? Etc. (for more considerations, see below.)\n4. The full recipe (in addition to the five pages of text for the paper).\n5. Proper citations as footnotes or endnotes in Chicago Manual of Style.\n\nLength & Format: Approximately five typed, double-spaced lines, 1'' margins, 12-point\nfont, numbered pages. Be sure to give your paper a specific, descriptive title.\n\nCitations: Footnotes or endnotes in Chicago Manual of Style (standard for citations in\nhistorical scholarship). Examples:\n\nFirst citation of a work in the paper\nBook--Sidney Mintz, Sweetness and Power: The Place of Sugar in Modern History (New York:\nPenguin, 1986), 43-44.\nArticle--Marcy Norton, \"Tasting Empire: Chocolate and the European Internalization of\nMesoamerican Aesthetics,\" American Historical Review 111, No. 3 (June 2006), 665.\nUnpublished interview--Pedro Theroux, (home cook), in discussion with the author,\nSeptember 2014.\n\nAll subsequent citations:\nMintz, Sweetness and Power, 101.\nNorton, \"Tasting Empire,\" 688.\nTheroux, interview.\n\nHow to find a recipe: You may use any recipe, as long as you can prove that it was\npublished (or otherwise circulated) before 1986, the year that Mintz's book was first\npublished. The main resources for this are cookbooks or books on food history that might\ncontain recipes.\n\n21H.S01: Food in American History\n\nYou could use a family or other recipe that you know of through oral testimony, as long as\nyou can obtain confirmation from a source (like your elderly relative Pedro) that it was\nprepared and eaten before 1986.\n\nYou may also find a historical recipe that is available online, as long as you can prove that it\nwas originally published before 1986--see the list of recommended online collections.\n\nGiven the relatively short deadline for this assignment, you should spend less time hunting\nfor an exotic recipe and more on analyzing, and writing your essay about it.\n\nSome questions and considerations to keep in mind: that cookbooks and recipes are a\nkind of primary source for writing history. As with all primary sources, historians must\nconsider both their possibilities and limits. The greatest limit of all is that historians cannot\nclaim to know for certain from such sources which (if any) recipes/dishes people prepared,\nwho prepared them, or how many people read, prepared, or ate the items in any given book or\nmenu. On the other hand, there is a great deal of information that we can know or at least\ninfer from them. We can analyze them by trying to answer such questions as: What form of\nsugar was recommended and what does this tell you about the economic, technological,\ncultural conditions of the place where and time during which the recipe was published? What\ningredients were commonly available, considered exotic, or altogether absent? What\ntechniques, cooking implements, and technologies (brick oven, electrical appliance) were\nrecommended or necessary for the recipe? Does the author offer any further hints about the\nrecipe, when (time of day, season, holiday or other occasion) it was likely to be prepared or\nconsumed? Does the recipe reflect a particular national, religious, ethnic tradition or other\nsort of orientation or purpose (e.g. healthful, economical, luxurious, political activism,\nculturally diversity, technological sophistication, avant-garde, ecological, created for a\nparticular social group like children/Mr. Moms)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Research Paper Assignment: Part 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/7014ba12c5e53c62d0e7d234eb905e86_MIT21H_S01F14_GuidPart_1.pdf",
      "content": "21H.S01: Food in American History\nResearch Paper Assignment\nPART I: Research topic proposal and bibliography\nDue three days after Session 7.\n\nLength: approximately 2-3 pages, plus preliminary bibliography\nRequired: At least 5 secondary sources and 2 primary sources\nPART II: Final Paper\nDue Session 14.\n\nLength: 12-15 pages, plus bibliography.\nPART III: Oral Presentation\nPrepare a 10-15 minute oral presentation about your research on the last day of class.\n* * * * * ** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\nOverview: Your major written assignment for this class is a research paper on some aspect\nof food in American history, broadly construed but focused on some period before the year\n2000. Since there are many possibilities for an appropriate topic, begin thinking and\nreading about your interests now to allow plenty of time to choose something that is\nappealing to you and doable in a semester with library resources at MIT, the area, and on the\nweb.\nPART I: Research topic proposal and bibliography of primary & secondary sources\nYour proposal should include:\n1. A research topic related to food in American history before the current century.\n2. A question or problem that you will attempt to answer with historical research & analysis\n3. A working answer to your research question, otherwise known as an argument or thesis\n4. Methodology: i.e. explain how and why you are using the sources in your bibliography\n5. Bibliography: at minimum 2 primary sources and 5 secondary sources\nHow to choose a topic\nThe first challenging aspect of this assignment is choosing an appropriate and manageable\ntopic that is of interest to you. Because finding and then narrowing your topic will be half\nthe battle, I suggest that you begin working on it ASAP, by doing the following things:\nStage 1:\n- Brainstorm aspects of food history, broadly construed, about which you are curious.\n- Consider topics related to those listed on the course syllabus and readings.\n- Keep a list of everything that comes to mind.\n- Assess whether there are enough and sufficiently interesting sources for the topic.\n- Keep notes on where you look, what you find, and what you learn.\n\n21H.S01: Food in American History\nResearch Paper Assignment\nStage 2:\n- Begin to concentrate on one or two topics that seem the most promising.\n- Think about the topic in relation to the subject matter of course material.\n- Look at the bibliographies of secondary sources to find other relevant sources.\n- Identify the main concepts or keywords related to your topic. Try catalog searches\nwith some keywords to add new ones or abandon dead-end terms.\n- Generate a list of research questions. State your topic idea as a question. For\nexample: why and when did the hamburger become a typical American meal? Why\ndid vegetarianism emerge in parallel to the movement to abolish slavery in the\nUnited States? What accounts for the gendered differences between the stereotypical\namateur (i.e. home) cook versus the professional chef? When and how did\ncommercial fishermen realize that they were overfishing particular species?\nStage 3:\n- Finalize your topic and question(s) and begin to focus on the most relevant sources.\n- Formulate a tentative answer to your question and state it in the form of a thesis\nstatement.\n- Write the research proposal.\n- Make a plan for Part II and assess whether you need more sources.\nPart I of the writing assignment is intended to motivate you to begin researching ASAP. The\nresearch that goes into compiling your preliminary bibliography will be essential preparation\nfor writing your final paper. But you should--and will probably find that you have to--\ncontinue to search for, read, and think about primary and secondary sources even after you\nhand in your bibliography. In other words, you should not worry that you haven't found\nthe perfect complement of sources about your subject or the right research question and an\nanswer to it, by the time your proposal and bibliography are due. The final paper is not due\nuntil the last day of class, so you will four more weeks to add or subtract sources from your\nworking bibliography, modify your research question, reconsider your hypothesis, and formulate\na compelling argument.\nPrimary sources versus secondary sources\nPrimary sources are created by observers or participants during the period that you are studying\nand constitute the 'raw materials' of history writing. Potential primary sources could include\nrecipes, cookbooks, menus; ephemera (pamphlets, postcards, posters); court cases; USDA,\nFDA, and other government documents; advertisements, illustrations, photographs, and\nfeature articles in historical newspapers and general interest magazines (e.g. magazines\ntargeted at women); business archives; and much more.\nFor each primary source, ask:\n- who wrote it and to whom? (can we know this? why or why not?)\n- when was it written or otherwise produced?\n- where or about what place was it written or otherwise produced?\n- what are the main features of this source?\n- what does it reveal about the characters or historical period under study?\n- what are the limits of this source?\n\n21H.S01: Food in American History\nResearch Paper Assignment\nSecondary sources in history are analyses or interpretations of the past often written by scholars,\njournalists, or other experts and usually based on primary sources. Authors of secondary\nsources always argue a point of view (also known as a thesis). Sidney Mintz's book is an\nexample of a secondary source. Secondary sources can include articles in scholarly journals,\nchapters in books, or books, as well as, sometimes, documentary films, newspaper articles,\nand web pages. Secondary sources should help you interpret and analyze your primary\nsources--whether or not you agree with the author's thesis, you should be able to think\nabout your own thesis as a complement or contrast with theirs. Secondary sources also\noften have bibliographies, or at least endnotes or footnotes, which can help lead you to\nfurther primary and secondary sources.\nFor each secondary source, ask:\n- what is its specific concern? (It may be tangential but still relevant to your project.)\n- what is the author's argument?\n- what evidence is this argument based upon?\n- what are some of the themes, controversies, turning points, big questions, time periods,\ncharacters, or anecdotes on which the author concentrates?\n- what does the author ignore?\n- to what extent is the argument persuasive?\n- how might it be used to answer my research question?\nFinding the Sources\nThere are many ways to find sources for historical projects and you should try different\nmethods of searching. As you get deeper into researching your topic, you should keep track\nof your research process and organize your notes.\n1. Encyclopedias, Dictionaries, and Bibliographies.\nReference works come in two varieties: general, like Encyclopedia Britannica, and specialized,\nlike Oxford Encyclopedia of Food and Drink in America. Other reference works you might\nconsider consulting are biographical dictionaries that give you basic information about\nspecific people, like the American National Biography, and specialized bibliographies, for\nexample, Food Bibliography: References to Reports and Other Documents issued by the U.S. General\nAccounting Office. Make notes on what you find.\n**Also note: Reference works are technically secondary sources and are a sensible place to\nstart for basic data about your subject, but they are not suitable as secondary sources for this\nassignment. Similarly, Wikipedia might sometimes be an adequate source of information for\nquick references but it is not suitable as an authoritative source for your paper.**\n2. Reference librarians.\nAsking a librarian about resources for your specific topic is almost always the best way to get\nstarted.\nMake sure to take notes about your conversations with any librarians and archivists.\n\n21H.S01: Food in American History\nResearch Paper Assignment\n3. Keyword Searching.\nThe reason to keep a running list of keywords is so that you can search for them in library\ncatalog. Start with the BARTON Catalog (http://libraries.mit.edu/). Conducting a search\non Google or Google Scholar with the keywords that you have come up with so far may\nturn up additional articles, though you shouldn't rely on Google as the most comprehensive\nguide for finding sources.\n4. Library Catalog and Subject Headings.\nFind out how sources that you might be interested in have been catalogued. In the MIT\nlibraries and most other public and university libraries, you will find the Library of Congress\n(LC) Subject Headings system but other libraries and archives sometimes employ different\nsystems. Understanding how a collection is arranged will help you figure out what subjects\nto search under when you consult the catalog. Again, make a list of relevant keywords and\nsubject headings.\n5. Finding Aids to Manuscript Collections.\nRepositories for manuscript (unpublished works) and other archival material designated as\nspecial collections often produce finding aids, which describe the contents and provenance\nof a particular collection in greater detail than a catalog record. The most comprehensive\nfinding aids describe each individual item in a collection. Many of these are now available\nonline. For example, see the Schlesinger Library's finding aid for the Alice Bradley Papers:\nhttp://oasis.lib.harvard.edu/oasis/deliver/~sch00468\n6. Serendipity: Shelf Browsing and Call Number Scanning.\nBooks in the MIT Libraries are also arranged by the LC system, so that those on similar\nsubjects tend to be near one another on the shelf. What this means is that you should always\nlook at the books on the shelf near the one that you are actually looking for, because they\nmany be relevant for your project. You can also do this electronically.\n7. Indexes to Journal Articles.\nBesides books, you'll be interested in finding articles in scholarly journals. Depending on\nyour topic, you will want to check the Historical Abstracts, America: History and Life, Web\nof Science, Social Sciences Index, the Humanities Index, and Lexis-Nexis. You can also go\ndirectly to electronic journal databases like JSTOR and Project MUSE. These will help you\nfind recent journal articles. Make notes on the articles that you do find. Check especially the\nfollowing journals devoted to food studies: Gastronomica, Food, Culture & Society, Food Studies:\nAn Interdisciplinary Journal, Food & History, Environmental History, and Agricultural History.\nIn addition, pay attention to the following major scholarly journals, which frequently publish\narticles related to food in history: Journal of American History, American Historical Review, Journal\nof the Early Republic, The William & Mary Quarterly, Past and Present, Environmental History,\nWestern Historical Quarterly, Pacific Historical Review, and Technology and Culture (most of these are\navailable online).\n8. Citation and Related-Record Searching\nDatabases and indexes like JSTOR and the Web of Science allow you to do two further\nkinds of search. First, if you have an important book or article, they can help you find\narticles that cite it. Second, they can help you find articles that are similar to it. Take one of\n\n21H.S01: Food in American History\nResearch Paper Assignment\nthe articles that you have found and try both citation and related records searches. Another\nway of doing citation searches is by using the end- or footnotes, bibliography, and index of\nbooks and articles which you've already found. As always, keep track of what you discover.\n7. Digital Collections\nNow that so many primary sources have been digitized and are available at no cost or by\nsubscription through a library, it is likely that you will be able to find court cases, diaries,\nlogbooks, images, and other historical documents on the Internet.\n8. Special knowledge, experience, skills\nNote also that if you have any skills or experience, such as language proficiencies, a\nfamiliarity with food chemistry or manufacturing technology, financial analysis, work\nexperience in the agriculture or food industries, and so on, you might put these abilities to\nwork in this project.\nKeeping Track of Your Work\nAs you search for sources, it is crucial to keep track of your work. Whenever you find out\nabout a potential source, make a note of the following (as relevant):\nAuthor/ Editor\nTitle\nPublisher\nDate\nPage numbers\nCall number\nLibrary or URL\nWay that you found out about the source\nWhether or not you looked at it\nContent notes (once you've examined the source--what information is in it?)\nZotero and other citation applications provide an excellent and easy-to-learn way to keep\ntrack of this stuff but many historians usefully employ more traditional methods: 3x5 index\ncards, notebooks, word processing programs, or spreadsheets. Stick with whatever method\nhelps you to stay organized.\nKeep all of your notes, because you never know what might prove useful. If you ordered\nsomething through interlibrary loan, make a note to remind yourself. You should also make\na list of things that you checked that didn't work out. For example, if you looked in a book\nabout your subject but didn't find the author's argument convincing, make a note of that so\nthat you don't repeat unnecessary work.\nMaking a Bibliography\nAs you do your research you will likely come across more sources than are germane to your\nsubject. Go through your list of primary and secondary sources and pick out those that\nseem particularly relevant or interesting. You are not necessarily going to read every word,\nbut you are going to skim through each source and make notes.\n\n21H.S01: Food in American History\nResearch Paper Assignment\nYour bibliography should have separate lists for primary and secondary sources and\nprovide full bibliographic information.\nHistorians use the Chicago Manual of Style as their citation style. This is the style you will\nuse for your bibliography and footnotes. The MIT Libraries provide an online guide and\nexamples. Go to the link in the Barton catalog:\nhttp://www.chicagomanualofstyle.org.libproxy.mit.edu/home.html\nProofread before submitting! Your proposal and bibliography should contain no spelling or\ngrammatical errors.\nPART II: Writing the Final Research Paper\nOnce you have your research topic and question, you are ready to continue onto the second\npart of this assignment: finding more material (if necessary), analyzing your material, building\nan argument, organizing your material to support your argument, and writing the paper.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Research Paper Assignment: Parts 2 and 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-s01-food-in-american-history-fall-2014/d9efb3db42a4c81aed029bcb866f7477_MIT21H_S01F14_GuidPar2and3.pdf",
      "content": "21H.S01: Food in American History\nResearch Paper Assignment\nPART II: Final Paper\nDue: Last session.\nLength: 12-15 pages, plus bibliography.\nRequired: At least 5 secondary sources and 2 primary sources\nPART III: Oral Presentation\nPrepare a 10-15 minute oral presentation about your research on the last day of class.\n(Your presentation is mandatory but will not be graded.)\n* * * * * ** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *\nWriting the Final Research Paper:\nIn the next stages of working on this paper, you may need to find more material, but you should shift\nemphasis to analyzing your material, building an argument, organizing your material to support your\nargument, and writing the paper. You will likely need to revisit and perhaps modify your research\nquestion as you read through your sources. Just as in scientific experiments, it is always a mistake to\ncling to the historical question you originally formulated if your sources will not allow you to answer\nit; instead, you should revise the question and/or answer to it in light of your findings. In addition,\nconsider what work you may need to do in light of the feedback you received from me on your\nproposal.\nAs you may have already experienced, writing is a laborious process. Moving on from your research\nproposal, you should begin to work out your further thoughts about your research on paper, not just\nin your head. By Session 10, you should have located and obtained all the major sources you\nwill use for your paper. By this time, you should also begin to outline and draft your final paper.\nBy Session 12, you should shift your focus away from further research and decisively toward\nthe writing process.\nMaking a Bibliography\nYour final bibliography may, indeed, is likely to, be somewhat different from the bibliography you\nsubmitted with your proposal. Changes in the range of your sources should reflect the ways in which\nfurther research, analysis, and writing have shaped your developing understanding of the plausible\nanswers to your research question.\nYour bibliography should have separate lists for primary and secondary sources and provide full\nbibliographic information in Chicago style:\nhttp://www.chicagomanualofstyle.org.libproxy.mit.edu/home.html\nGrading:\n40% Content: Is this paper well-researched, fully-cited, & informative?\n30% Analysis: How successfully did this paper formulate and answer a research question related to\nfood in American history? Was the thesis coherent and cogently defended?\n20% Organization: Is the paper structured so that content and analysis flow in a logical, readable\nsuccession of sentences and paragraphs?\n10% Style: Is the writing clear? Is the word choice precise? Is it largely free of basic errors?\nDon't forget to proofread before submitting your final paper!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.S01 Food in American History\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}