{
  "course_name": "Forms of Western Narrative",
  "course_description": "This course examines some leading examples of major genres of storytelling in the Western tradition, among them epic (Homer’s Odyssey), romance (from the Arthurian tradition), and novel (Cervantes’s Don Quixote). We will be asking why people tell (and have always told) stories, how they tell them, why they might tell them the way they do, and what difference it makes how they tell them. We’ll combine an investigation of the changing formal properties of narratives with consideration of the historical, cultural, and technological factors that have influenced how tales got told. In keeping with its CI-H and HASS-D label, this course will involve substantial attention to students’ writing and speaking abilities.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Fiction",
    "International Literature",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Fiction",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis is a HASS-D / CI-H class requiring substantial work in analytical writing and in oral presentation. More detail about this will be given below, but here are the basics:\n\nWritten Work\n\nEach student will write 3 essays, minimally 7 double-spaced pages apiece; one of these must be revised after consultation with me.\n\nOral Presentations\n\nEach student will deliver 2 ten-minute reports on subjects pertinent to our readings. More details below.\n\nRequired Texts\n\nHomer.\nThe Odyssey of Homer\n. Translated by Richmond Lattimore. New York, NY: Harper Perennial, 1999. ISBN: 9780060931957.\n\nde Troyes, Chretien.\nArthurian Romances\n. New York, NY: Penguin Classics, 1991. ISBN: 9780140445213.\n\nde Cervantes, Miguel.\nDon Quixote\n. Edited and translated by John Rutherford. New York, NY: Penguin Classics, 2003. ISBN: 9780142437230.\n\nBrothers Grimm.\nThe Complete Grimm's Fairy Tales\n. New York, NY: Pantheon Books, 1976. ISBN: 9780394709307.\n\nShelley, Mary.\nFrankenstein\n. New York, NY: Penguin Classics, 2003. ISBN: 9780141439471.\n\nConrad, Joseph.\nHeart of Darkness\n. New York, NY: Penguin Modern Classics, 2000. ISBN: 9780141182438.\n\nChandra, Vikram. \"Kama.\" In\nLove and Longing in Bombay\n. New York, NY: Back Bay Books, 1998. ISBN: 9780316136778.\n\nClass Schedule\n\nThe following schedule shows the reading you should have done by a given day; it's designed to spread your reading fairly evenly across the semester (for example, if four class sessions are devoted to a novel, you should read\nat least\na quarter of the work for each of those sessions). In class, however, I'll go slower over some parts, faster over others. The schedule is subject to change, so if you miss a class, check to make sure what's coming next.\n\nSpecial Feature\n\nThe day before Ses #14, the novelist and short-story author Vikram Chandra will be visiting MIT for a late afternoon seminar and an evening public reading. Students of 21L.012 will read Chandra's story \"Kama\" (from his collection\nLove and Longing in Bombay\n) and are strongly encouraged to attend the seminar and reading.\n\nCalendar\n\nSES #\n\nTOPICS\n\nIntroduction\n\nHomer\n\nHomer (cont.)\n\nHomer (cont.)\n\nHomer (cont.)\n\nHomer (cont.)\n\nHomer (cont.)\n\nFinish Homer\n\nChretien\n\nCervantes (readings for all 4 classes: pp. 11-479)\n\nCervantes (cont.)\n\nCervantes (cont.)\n\nCervantes (cont.)\n\nGrimms' tales: \"The Frog-King\"; \"Hansel and Gretel\"; \"The Fisherman and His Wife\"; \"Cinderella\"; \"Little Snow-White\"; \"Brother Lustig\"\n\nShelley\n\nShelley (cont.)\n\nShelley (cont.)\n\nConrad\n\nConrad (cont.)\n\nConrad (cont.)\n\nConrad (cont.)\n\nEnd-of-term exercises\n\nStudent presentations\n\nStudent Work\n\nAs a HASS-D / CI-H class, 21L012 requires substantial practice in analytical writing and speaking.\n\n3 take-home essay exams (minimum 7 double-spaced pages each) on Homer, Cervantes, and Shelley (respectively). Please use Courier 12-point font for all your writing in this class.\n\nA 4th (and last) essay exam, consisting of a substantially revised version of one of the previous three. Outside of class, you will work with me and with a class partner on your revision; when submitted it must be accompanied by a one-page statement reflecting on what you found necessary to change, what improvements you attempted to make, why, and so forth.\n\nTwo oral reports, approximately 10 minutes each, on topics to be assigned. Your function on the first of these will be to inform your fellow students about a topic relevant to our readings, to do so in the clearest and most concise manner, to show you have selected the most important information to convey, to deliver your report with a professional demeanor and authority. The second report will be a joint presentation with your revision partner about the original and final versions of your revised papers.\n\nThere will be an in-class quiz on Conrad's\nHeart of Darkness\nas soon as we have finished discussing that work.\n\nGuidelines\n\nWritten work is due either at the beginning of class or, if on a Friday, before 5 pm at the Literature office. Hard copies, please; electronic versions are acceptable only in special circumstances and if approved by me.\n\nExtensions may be arranged, but only if you ask for them in advance of the original due date.\n\nNo more than two unexcused absences. Beyond that, you will fail the course.\n\nIf you are sick or have to be away for another legitimate reason, e-mail me.\n\nI may charge you an unexcused absence if you frequently arrive late or without your book.\n\nUnannounced quizzes on readings at my discretion.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten work (including quiz)\n\n75%\n\nOral presentations\n\n20%\n\nOverall helpfulness of attitude and demeanor\n\n5%\n\nPrinciples of Assessment\n\nI expect written work of the same caliber as the work required in your other MIT subjects. This means carefully composed and proof-read (no sloppy errors), thorough, well thought-out, sufficiently supplied with supporting material quoted or paraphrased from the text(s). I make no distinctions between \"content\" and \"quality of writing.\" How you decide to state something, how you assemble an argument, how you construct each and every sentence - these things\nconstitute\nyour argument and are thus indistinguishable from its \"content.\" Also, more richly detailed essays, those that take the trouble to respond very fully to the text and to the questions posed in the assignment, will receive higher marks than those that give minimal or very general responses. I will distribute a sample \"A\" paper (from another class, of course!) to illustrate the qualities I have described above.\n\nOn oral presentations, students will be judged on pertinence, clarity, and organization of the information presented, as well as on delivery style (the \"professional demeanor and authority\" mentioned above).\n\nOn Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the MIT's Writing and Communication Center and useful\ncitations\nlinks located here.",
  "files": [
    {
      "category": "Resource",
      "title": "paper_revision.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/35e2cf4f82875f31a35905a929d98ea0_paper_revision.pdf",
      "content": "Revision project (for paper 1 or 2)\nRevisions are due Tuesday, Dec. 11\nYour revision should include a cover page describing the improvements you attempted to\nmake, the main problem areas you identified, and the steps you took to address them.\nLimit: 1 double-spaced page.\nYou should conceive of the revision process as an opportunity to rethink everything\nabout your original essay; do not limit yourself to \"fixing\" only those things I marked as\nproblematic. You may decide that many things about your original essay are the way you\nwant to keep them, but you should have a justification for that decision, just as you\nshould have one for any changes you make. There is no guarantee that a revised essay\nwill receive a higher grade than the original. The grade on the revision will completely\nreplace that given to the original.\nIn class on Tuesday, Nov. 27, we will form teams of 3 to work collaboratively on the\nrevision process. It will be your responsibility to read each other's work and meet to\nstrategize about the revision process.\nI will be available, by appointment, to meet with teams during the week of Dec. 3-7; you\nshould have met as a team before coming to see me.\nOn the final day of class, Tuesday, Dec. 11, each team will make a 10-minute\npresentation on its revision process. You can elect a team spokesperson or divide the\ntime as you see fit. Remember that you should address your remarks to the rest of the\nclass, not just to me. You should emphasize those aspects of your revision process that\nmight be illuminating for the other students.\nPlease note: it is imperative that you treat your team members with respect. Everyone\ncan stand to improve, so please make your comments on each other's work constructive.\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/a3e9627be35ffcde31c18eb797ab4601_paper1.pdf",
      "content": "Topics for paper #1: minimum of 7 pages\nDue Thurs. 10/4, in class\nGUIDELINES ON FORMAT for all papers in this class (retain for future reference):\n1) Attach a cover sheet to your essay giving a title (a good one), your name, and a\nsigned pledge that the paper is entirely your own work. You should not need to\nconsult any outside sources, just your memory and notes. Now would be the time\nto review the section on Plagiarism on the class syllabus.\n2) Double space and use a size-12 Courier (or Courier New) font, with margins of\nabout 1 inch. Quotations of longer than 5 lines should be set in on both sides and\nshould be double-spaced. They do NOT need quotation marks around them (the\nsetting-in indicates that it's a quotation).\n3) Number your pages. The cover page should not be numbered. By convention the\nfirst page of your text should not show a number, although it is counted as page 1;\nthe next page should show 2, and so on.\n4) Staple the pages in the correct order. Yes, past experience tells me I have to\nspecify this.\n5) When you quote, follow your quotation with a parenthetical citation giving the\nwork's name (the first time; after that, if you're quoting only one work, it's not\nnecessary) and the page number. You don't need footnotes or endnotes, or a\n\"Works Cited\" list or bibliography. When you are quoting from a work divided\ninto separate books and marked with line numbers, give the book and line\nnumbers as well, after the page number (for example: Odyssey, p. 222, Book XIV,\nlines 66-68).\nADVICE for all papers written for this class:\n1) Don't assume that you can't use the first-person voice. \"I think\" or \"it seems to\nme\" is OK, as long as you have reasons to back up what you think. I'd rather\nhave you sound like a distinct individual than an impersonal bureaucratic\ncommittee.\n2) Quote from and/or paraphrase portions of the text to support your claims as much\nas possible. Unlike experimental scientists, who seek to arrive at knowledge by\neliminating variables and narrowing the field of possibilities, we in the humanities\nare looking for responses that seek to take in more, that don't just identify an issue\nof importance but attempt to see how it plays out in a variety of different settings\nin a literary work or historical context. Don't think of your task as one of arriving\nat the tersest statement of a book's \"meaning\"; think of it as one of engaging with\nsome issue raised by the book in sufficiently satisfying detail.\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY].\n\n3) Don't assume that your essay has to conform to some ideal model of the 5\nparagraph essay (opening paragraph, 3 paragraphs of \"body,\" closing paragraph).\nRather than helpfully providing a structure, this model can become a cage, and it\nencourages a boredom-inducing level of repetition (here's what I will say, here I\nam saying it, here's what I have said). You want to persuade your readers, not hit\nthem over the head.\n4) Don't write for the professor. Write for an imaginary reader who is somewhat\nfamiliar with the text you're discussing but needs some reminding about what\nhappens when and so forth. When you discuss a particular passage or incident in\nthe text, make sure to contextualize it for this imaginary reader. When you move\nfrom one part of the text to another, help the reader move with you by providing a\nsufficient transition. Explain any foreign-language terms (e.g. biotos, etc.).\nAlways be asking yourself if what you're saying will be clear and persuasive to\nthe imaginary reader.\n5) Keep your opening paragraph focused on the specific claim your paper is making.\nDon't begin with vast generalizations (e.g. \"Throughout the history of Western\nliterature\") when your real subject is something specific about a particular text.\n6) People often think that academic writing is unlike the kind of writing they might\nneed to do in the \"real world.\" But one way in which the writing in this class is\nexactly like the writing you might do in a professional context is that it is being\nread by someone busy who has a lot of other things to read and who will hold you\nresponsible for what you present.\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY].\n\nPossible topics for paper #1: choose one.\n1. Explain what it means to say that a central theme of the Odyssey is the conflict\nbetween Poseidon and Athena. Make sure to consider, along with other things,\nAthena's behavior at the beginning of book 3 and what difference that makes to\nour sense of this conflict. Is it a conflict that is likely to end in one side's victory?\nHow does Teiresias's description, in Book XI, of the final journey that Odysseus\nwill have to make help us answer this question?\n2. Write about the significance of Odysseus's trick of naming himself \"Nobody\" in\nhis encounter with the Cyclops. By \"significance\" I do not mean simply \"what\nthat trick leads to in the Cyclops encounter itself,\" but what it suggests about all\nof Odysseus's adventures in books 9-12 and the epic as a whole. How does the\nencounter with the Cyclops offer a prototype for all of Odysseus's adventures in\nattempting to get home? Separate out the various important elements of the\nencounter that help establish it as prototype.\n3. Write about the ways in which the Odyssey exhibits an ancient people's tendency\nto \"externalize\" things (like ambivalence, guilt, remorse, recklessness, etc.) that\nwe modern folks would tend to represent by reference to \"internal\" individual\npsychology. What might this tendency have to do with the oral origins of\nHomer's epic?\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/4cbb28f74efbc7bf8d8cdc2e9e2b041b_paper2.pdf",
      "content": "Topics for paper #2\nAt least 7 pages, due Tuesday, Nov. 13\nRemember to observe the guidelines specified on the assignment for exam #1. Don't\nforget the signed pledge. And make sure to review the advice I gave with assignment #1.\nChoose one of the following:\n1) In \"The Knight of the Cart,\" we have a romance of chivalry that may (some\nreaders think) work to undercut or treat with irony some of the ideals of romance\nand chivalry. In Don Quixote, we have a novel that professes itself devoted to the\ndebunking of romance conventions and illusions (see the prologue) yet which\nseems at times to revalidate some aspects of the romance ideals to which Quixote\ndevotes himself. Discuss the possibility that these two works may express\nambivalence about their ostensible purposes. Support your claims with analysis\nof specific passages from both texts.\n2) Focusing on chapter 20 of Don Quixote Part I, write about how we might best\nconceive of the pairing of Don Quixote and Sancho Panza. Draw liberally upon\npassages from other chapters in the text to support your observations, and be as\nspecific as possible in developing the relationship between the two.\n3) Write about how some tensions or contradictions in Don Quixote's words and\nbehavior may help us feel the \"historical moment\" of Don Quixote as a time of\nprotracted transition from a courtly or feudal society to a market-driven one.\nQuote liberally from the text to support this claim.\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "paper3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/453d11cfb1a72935c34d3a6ca6426a6d_paper3.pdf",
      "content": "Topics for paper #3\nAt least 7 pages, due Friday, Dec. 7\nRemember to observe the guidelines specified on the assignment for exam #1. Don't\nforget the signed pledge. And make sure to review the several pieces of advice I gave\nwith assignment #1.\nThere is a change to the syllabus: we will NOT have a quiz on Heart of Darkness on\nTues. Dec. 11.\nThis essay will focus on Frankenstein but will also touch on Heart of Darkness.\nSince we will finish discussion the latter work on Dec. 6, your discussion of it may be\nbrief, but it should adequately address the questions posed below.\nChoose one of the following:\n1) A literary work is not like a box with a meaning inside, and reading one is not like\nopening the box and taking out the meaning. On the contrary, a work of literature\nuses its form to put readers through a certain kind of experience in relation to the\ncontent it delivers. Form and content are intimately interrelated, and the way a\nwork is told matters as much (or more) as what it tells about.\nSo: how does the structure of the narrative in Frankenstein (the way the narrative\nis organized and delivered to us) relate to the ideas with which the novel is\npreoccupied? What parallel can you see between the structure of Frankenstein\nand that of Heart of Darkness? What does it mean to regard both works as\ninvolving a \"contest of voices\"?\n2) When people try to describe unprecedented experiences, they usually draw upon\nfamiliar patterns to try to make sense of them. Both Frankenstein and Heart of\nDarkness take us to places and types of experience far beyond the common or\neveryday - to say the least. What patterns derived from the literary and\nmythological traditions of the Western world - in other words, what kinds of prior\nstories - do they draw upon in seeking a template that can adequately encompass\ntheir new (and terrifying) material? How adequate are these established patterns\nto their new purposes?\nJames Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded\non [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "arthur.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/eff35df8f7e1b41231c49f44ab443a90_arthur.pdf",
      "content": "21L.012, Arthurian romances\n\n(4 October)\n\nKing Arthur:\n- 1000 year span (5th century - 15th century) of Arthurian legend developing\n- Note \"medieval\": much social change during time\n- If Arthur did exist, likely in the 4th century as Romans withdrew\n- Britain changed significantly after Norman conquest (1066); French was spoken\n\nThe Art of Courtly Love\n- Why would the book The Art of Courtly Love catch on?\n- Marie among the most powerful women in France\n- Question to reader: was courtly love in \"Knight of the Cart\" what you expected?\n- Author does not explain how Lancelot fell in love, because that was widely\nknown at the time\n- Jarring that love was sexual (included adultery); 19th century version of courtly\nlove celibate\n- Pg. 291: she intends to continue affair\n\nIn \"The Knight of the Cart,\" what is experience of being in love like?\n- Pg. 211: the knight gets into cart, which disgraces him; contaminated\n- Purity important: needed noble spirit to be worthy of love; love is noble\nphenomenon, not among dirty peasants\n- There's battle between love and reason\n- Love triumpths over other concerns (disgrace didn't matter)\n- Pg. 225: his reaction to hair almost silly\n- Medieval Catholicism developed cult around relics; he treats her hair like a relic;\nlove takes him over as religion does to many; suggests that love is competition to\nreligion\n\nRole of women\n- In Bible\no woman is downfall of man (Eve)\no Mariolatry: Mary elevated to semi-divine, merciful\n- Courtly love: secularizes Mariolatry\n- Pg. 207: author acknowledges her power, flatters her\no Emphasis that she wants him to write distances author from writing\no Author may not have believed ideas in story\n\nOverarching tale: Lancelot on quest to rescue other\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "conrad.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/1c976dcc13c8d7845f343ea48c7191a5_conrad.pdf",
      "content": "21L.012, Heart of Darkness\n(27 Nov)\nNote sthat Joseph Conrad does not name the places he goes\nWhy not?\nHeart of Darkness is not just about what happened to Marlow and Kurtz;\nalso about the difficulty of telling the story;\nMarlow often treats words as if they float free of their traditional meanings\nhandout\n- Livingstone quote\no commerce and Christianity go hand in hand\no Livingstone: leading force behind redefinition of colonialism to be not\nonly imperial; should also enlighten and improve others\n- Stanley: Africans are capable of being civilized through colonialism\n- racists opposed colonialism; thought Africans couldn't be civilized\n- Carlyle\nHow do we approach the story?\n(29 Nov)\nMarlow liked maps\n- maps: link knowledge with economic interests\n- people make maps only if they're needed\n- 14: Marlow likes sutdying map with colors\n- Marlow differentiates between different countries' colonialism\n- Casement report\nsponsored by U.K. to study Congo\n(4 Dec)\nFranklin expedition\n- raised possibility that civilized white man taken out of environment may become\nworse\nHow to approach story?\n- consider as a tale of 2 rivers\n- 3\no service used twice\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\no serve once\no What's suggested about attention of narrator?\n- Conrad makes decision about setting: day is dlindling: we think we understand\nour actions, but there's darker truth\n- Meaning of service?\no curious to say about river\no thinks of river as a servant\n- Marlow\no thinks of river as taking us to places\n- history\no progress: savage Æ civil\no progress: illusory: savage remains; civil a cloak that deludes\no for Marlow, traveling up river removes cloak\n- 63\no How does Conrad represent Africans?\nexpresses rurprise at Africans' restraint\n(6 Dec)\n(student presentation on Chinua Achebe, who criticized Conrad)\nHow do we reconcile quality of Conrad's writing with its potentially tainted nature?\n- Is it satisfactory to say that it's a product of its time?\n- consider distinction between Europeans and Africans\n- Achebe accuses Conrad of dehumanizing Africans. What's that mean?\nConrad portrays Africans as objects rather than subjects\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "darkness.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/30d54f321df80e3515e7aff9b4fafa4d_darkness.pdf",
      "content": "21L.012, Heart of Darkness\n\n(27 Nov)\n\nNote that Joseph Conrad does not name the places he goes\n\nWhy not?\n\nHeart of Darkness is not just about what happened to Marlow and Kurtz;\nalso about the difficulty of telling the story;\nMarlow often treats words as if they float free of their traditional meanings\n\nhandout\n- Livingstone quote\no commerce and Christianity go hand in hand\no Livingstone: leading force behind redefinition of colonialism to be not\nonly imperial; should also enlighten and improve others\n- Stanley: Africans are capable of being civilized through colonialism\n- racists opposed colonialism; thought Africans couldn't be civilized\n- Carlyle\n\nHow do we approach the story?\n\n(29 Nov)\n\nMarlow likes maps\n- maps: link knowledge with economic interests\n- people make maps only if they're needed\n- 14: Marlow likes studying map with colors\n- Marlow differentiates between different countries' colonialism\n- Casement report\nsponsored by U.K. to study Congo\n\n(4 Dec)\n\nFranklin expedition\n- raised possibility that civilized white man taken out of environment may become\nworse\n\nHow to approach story?\n- consider as a tale of 2 rivers\n- 3\no service used twice\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\no serve once\no What's suggested about attention of narrator?\n- Conrad makes decision about setting: day is dwindling: we think we understand\nour actions, but there's darker truth\n- Meaning of service?\no curious to say about river\no thinks of river as a servant\n- Marlow\no thinks of river as taking us to places\n- history\no progress: savage Æ civil\no progress: illusory: savage remains; civil a cloak that deludes\no for Marlow, traveling up river removes cloak\n- 63\no How does Conrad represent Africans?\nexpresses surprise at Africans' restraint\n\n(6 Dec)\n\n(student presentation on Chinua Achebe, who criticized Conrad)\n\nHow do we reconcile quality of Conrad's writing with its potentially tainted nature?\n- Is it satisfactory to say that it's a product of its time?\n- consider distinction between Europeans and Africans\n- Achebe accuses Conrad of dehumanizing Africans. What's that mean?\nConrad portrays Africans as objects rather than subjects\n\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "don_quixote.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/81524c9b21dc8a9c0d6440d211c9cb9c_don_quixote.pdf",
      "content": "21L.012, Don Quixote\n\n(16 Oct)\n\n(student presentation on the Picaro)\n\nDon Quixote\n- borrows from Picaresque literature\n- Picaro: similar to \"rogue\"\n- episodic: plot loosely formed; several self-contained events\n- Picaro: 1 form of episodic literature\n\n(student presentation on Amadis of Gaul)\n\nDon Quixote Part 1: 1605, published by itself;\nlater, a different author wrote a follow-up, which prompted Cervantes to publish Part 2 in\n\nEpic: The Odyssey\n\nRomance: Arthurian Romance\n- characters idealized, contrary to a novel's realistic characters\n\nnovel: Don Quixote\n- supernatural events occur (e.g., Don Quixote blames enchanter)\n\nnovel: new, modern\n- opposed to romance (Don Quixote mocks romance)\n\nIn a prologue, what's the relationship between the author and the addressee?\n- Cervantes addresses reader\n- Cervantes's prologue is less formal than Chretien's prologue\n- Chretien distances himself from his patron\n- Cervantes refers to the idle reader, lowers expectations\n- Cervantes's audience: the public, whom he didn't know, in contrast to Chretien's\naudience\n- Cervantes is open about the difficulty of writing prologue; he mocks prologue\nconventions\n- pg. 15: book mocks chivalry books\n- pg. 26: Don Quixote deranged by chivalrous books\n- another interpretation: Don Quixote should be admired for dreaming of something\nbetter instead of settling for normal life (romantic)\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- How mad is Don Quixote?\n- pg. 27: Don Quixote cleans suit of armor, makes helmet, learns from first test that\nhelmet is not strong enough, and doesn't retest it\npg. 30: note conflict of languages (ornate vs. normal)\n\n(18 Oct)\n\n(student presentation on Hidalgo)\n\nHidalgo\n- social class (and literary genre: romance/novel)\n- purity/mixture\n- dualistic nature of humanity\n\nDon Quixote and Sancho Panza\n- dualistic nature\n- conflict\n- note image of Don Quixote on horseback: man taming beast\n\nnote varying social classes\n\nSpain in Christendom\nmany Muslims and Jews forced to convert, though still not pure;\npeople feel uncertain because of changing religious environment\n\npg. 73: person and Arabic text a fiction\n- Why did Cervantes attribute?\n- distances author from writing\n\npg. 76: Arabs are liars\n\nCervantes may have attributed to Arab because an Arab would have a different\nperspective\n\nRomance as a genre is obsessed with purity\n- note the contrast between royal court of romance and marketplace where Arab\ntext was found\n- pure vs. mixed\n- novel: embraces mixture\n- Don Quixote: story of Spanish knight from Arab\n- recall contrast between languages on pg. 30: ornate vs. normal\n\npg. 46: encounter between Don Quixote and merchants\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- note knight vs. merchants\n- merchants want to observe\n- Don Quixote wants them to believe\n\n(30 Oct)\n\n(student presentation on Charlemagne)\n\n(student presentation on the counter-reformation and Spanish Inquisition)\n\nThe Spanish Inquisition sought cultural homogeneity;\nNote historical transformation during which Don Quixote was written: power was\ntransferring from a few elite to the marketplace\n\nDon Quixote, ch. 20\n154:\n- Don Quixote fears sound, which he mistakes for something dangerous\n- he relates his vision of a golden age (vs. an iron age) to his companion Sancho\nPanza, of universal brotherhood and community\n156:\n- Sancho binds Don Quixote's horse's feet\n- What does this action represent?\n- Sancho learns he can't persuade Don Quixote with words; instead Sancho appeals\nto Don Quixote's sense of destiny\n- Sancho learns how to manipulate Don Quixote\n157:\n- Sancho clings to Don Quixote's thigh?\n- What is the symbolic value of this?\n- the 2 sides of human nature that Don Quixote and Sancho Panza represent are\ninextricably connected\n- what's the symbolic significance of the thigh?\n- Dionysus: born from thigh of Zeus, where he was hidden; god of wine, everything\nanimalistic about human nature\n160:\n- Don Quixote unable to avoid Sancho Panza's stench\n162:\n- Don Quixote and Sancho Panza acknowledge that they're bound together; they\nlaugh about it; comedy: accommodating what can't change\n- Don Quixote then reinstates the difference between them, getting angry\n164:\n- Don Quixote requires distance from Sancho Panza\n\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nnames\n- Rocinante (horse)\no significance of name?\n- Sancho Panza\no significance of name?\n- Dulcinea (Don Quixote's love)\no dulci: sweet\no nea: born\no sweet-born: of noble birth (but she's actually a peasant)\nDoes Don Quixote attach importance to birth?\n\n(1 Nov)\n\nrecap of previous class:\n- used ch. 20 in Don Quixote to explore issues\no in the chapter, Don Quixote announces his vision of a new golden age\no he describes it as a time when people didn't know the words \"yours\" and\n\"mine\"\n- issues explored:\no Don Quixote considers the state of society\no explores which society is most suitable\no comic acceptance of duality (only momentarily)\n\nwindmills episode in Don Quixote:\n- he notices windmills, which he mistakes for giants (pg. 63)\n- he ignores Sancho's disputation\n- he's thrown from his horse\n- even then, he claims that an enchanter turned the giants into windmills to thwart\nhim\n- Don Quixote substitutes fantasy for reality\n- questions: how certain can we be of evidence from senses?\n- consider evolution of modern science: relies on physical laws\n- Don Quixote illustrates transformation from religious world to scientific world,\nfrom theism (God active in workings of world) to deism (God designed world, let\nit work)\n\nnote Descartes handout\n- how certain can we be of perception?\n- What can I know without senses?\n- recall Don Quixote's encounter with merchants\n\nDon Quixote's encounter with sheep\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- he mistakes the dust from the sheep for a cloud of dust being raised by armies\n- Don Quixote is so insistent that Sancho believes him\no Don Quixote goes into detail about the supposed armies\no the sheep are not visible initially\n- Sancho: confirmed empiricist\n- Sancho cannot observe the sheep, and is swayed by Don Quixote's story\n\nDon Quixote's naming of things\n- contains a hint of a thing's actual state\n\nWhat we expect to find in the world affects how we perceive the world\n\nDon Quixote has a framework of assumptions in which he observes the world;\nincompatible with scientific framework\n\nIs truth about finding what's real or finding a coherent framework?\n\nDon Quixote provides a coherent account within his framework\n\nconsider issues of social class\n- Don Quixote mixes with a variety of people\n- class about not just $, but also worldview, values\n- Don Quixote wants to bring back courtly ideals, but he also states that \"man is a\nchild of his deeds\"\n- Don Quixote remakes himself as a knight\n- in assessing Dulcinea, Don Quixote emphasizes her potential, rather than her\nlineage (future, not past)\n\nDon Quixote's encounter with servant girl\n- he beautifies homely girl\n- is Don Quixote\no satire: makes fun of him, or\no romance\n\npriest complains of prisoners who are let loose\nDon Quixote claims it's not his responsibility to determine whether the chained are good\nor bad: \"I did what my religion requires of me\"\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "frankenstein.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/cf45541f67d1f6c44c25a338cededb33_frankenstein.pdf",
      "content": "21L.012, Frankenstein\n\n(8 November)\n\n(student presentation on Romanticists)\n\nstudent exercise: sketch Frankenstein on board\n- Who drew monster?\n- Who drew Victor?\n- What surprised you about the story?\n- Many differences between popular conception and actual story\n- What information does the title page present and not present?\no Who was Prometheus?\nmyth: Titan, between gods and humans; stole fire from gods, gave\nto humans\nmyth: formed humans from mud\nsuggests that Frankenstein title refers to Victor\no Is story about creature or creator?\n\nrecall what Victor tells of childhood:\n- coddled by parents, in contrast to his care of monster\n- title page: author's name omitted, because of gender\n\nWhy does story begin with a series of letters between other characters?\n- explorer wants to:\no discover something new\no achieve glory\no benefit humans\n\n(13 November)\n\n(student presentation on Sir Humphrey Davy)\n\nFrankenstein\n- note Davy quote in intro\n- in beginning of 1800's, science was an amateur activity because only the wealthy\ncould pursue it\n- in the days of amateur science, normal educated people knew of science, counter\nto later specialization\n\nprevious works\n- Odyssey: significant in paying homage to Poseidon\no Athene prays to him\no Odysseus must go on final voyage\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- Don Quixote: note vision of comic acceptance: tied to worse side of nature\nregardless of efforts: our ability to improve things is limited\n\nrecall beginning of Frankenstein\n- letters\n- Walton adds to credibility of story\n- Walton observed monster\n\nnarrative\nMrs. Saville I Walton I Frankenstein I monster\n- progressive steps away from social solidarity\n- Walton can provide pathway to isolation\n- opening and closing landscapes: barren\n\nWhat constitutes beautiful and sublime?\n- Burke: beautiful an experience of happiness; calm and peaceful\n- sublime: parts of nature that seem indifferent to humans; can make us feel\ninsignificant, unimportant (e.g., stormy sea)\n- beautiful: world we're at home in\n- sublime: monster's experience; world hostile, indifferent\n- Poseidon: sublime force\n- Don Quixote's lower side of human nature\n\nFrankenstein suggests that some part of our soul could be alien to us\n\nShelley's perspective\n- women keep men in touch with social world\n\nthe night Frankenstein succeeded\n- Frankenstein exhausted\n- has dream\no divided between his love of Elizabeth, respect for father and pursuit of\nmonster\no Elizabeth morphs into dead mother; before mother died, she said to\nElizabeth, \"Elizabeth my love, you must supply my place,\" undone in\ndream; mother died after helping Elizabeth\no Frankenstein may be motivated subconsciously to render women obsolete\nmonster embodies Frankenstein's side that he does not understand\n\n(15 November)\n\nAlone, alone, all all alone,\nAlone on the wide wide sea\nAnd never a saint took pity on\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMy soul in agony.\n-S. T. Coleridge\n\"The Rime of the Ancient Mariner\"\n\n(student presentation on film versions of Frankenstein)\n\nColeridge's work influenced Shelley's writing\n- The passage above expresses despair--beyond the redemptive power of God\n- a recurring theme in Frankenstein\n\nrecall the trial of Justine\n- consider the role of Victor during trial\n- vol. 1 ch. 8, pg. 86\n\nWhat is the book's attitude toward Victor?\n- vol. 1, ch. 4: if everyone stays within the bounds of the familiar, progress is\nslowed\n- admiration for striving for something new, but needs tradition to balance\n- tension between 2 forces\n\nStart of vol. 2: Victor exalts himself in perverse way\n- exempts himself from advice\n- monster challenges the primacy of Victor's misery\n- competition of who's most miserable\n- consider Oedipus the King\no goes from best to worst\no tragic hero\no retains grandeur during fall\no contest between Victor and the monster to be tragic hero of story\no vol. 2, ch. 2\n\nWhy can Victor in the book Frankenstein inspire sympathy but not Victor in the film\nversions?\n- in 1st person narrative (book), tendency to slide from explanation to justification\n- vol. 2, ch. 1\n\"qui s'accuse, s'excuse\" he who accuses himself excuses himself\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "grimms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/d276b721a36524d4f97c7d159f39ef12_grimms.pdf",
      "content": "21L.012, 6 November\n\n(student presentations on Grimms)\n\nGermany in the early 1800's\n- language united people\n- shift from multicultural empires to culture-centric nation-states\n\nGrimms advocated preservation of popular antiquities: the people's stories\n\nobservations of Grimms' fairy tales\n- more gruesome than modern-day versions\n- stories exhibit women's power within households\n- storylines differ significantly from modern versions (key elements added or\nmissing, morals not always obvious)\no e.g., story about the frog ends strangely\n\nGrimms fairy tales\n- told not just to teach morals\n- engage difficult questions\n\nthe frog king story\n- questions it addresses\no father-daughter relationship: tensions between the two\no pg. 19: daughter resists frog;\nnote contrast between daughter and frog: pristine vs. dirty\nnote how frog advances step-by-step\ngods of the ground: chthonic\nstory: contrast between solar and chthonic powers\nby the father instructing girl to go to bed with the creature, the\nstory confronts sexual anxiety\nraises issue, but doesn't solve it\n\nstory of Brother Lustig\n- What's the moral?\n- Is that the correct question to ask?\n- What can humans achieve without grace of God?\n- he fails at what St. Peter achieves\n\nstory of Cinderella\n- an innocent girl who is degraded, then restored\n- has to pick lentils from fireplace: pick the good from the bad\n- nature endorses societal order\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "introduction.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/0aa15409a449bf7561bb85e55033ff92_introduction.pdf",
      "content": "21L.012, Introduction\n\n(6 September)\n\nWhy read fiction?\n- It gives us distance.\n- It mediates between the reader (their assumptions and perspective) and reality.\n\nWhat do we gain from fiction?\n- We learn by identifying with characters (though the comparison doesn't need to\nbe complete)\n\nWhat can fiction teach?\n- Morals (a story is disarming)\n- Can explore the inner lives of characters, which can change the reader's\nperspective\n\n\"Narrative\": from the Latin \"narare\"\n\nroot: gna: know\n\ncognition\n\nrecognize\n\n\"Story\": from the Greek \"historia\"\n\nroot: histor: wise man, judge\n\nhistory: what happened\n\nstory of what happened (narrative)\n\n1st-person-narrative: retroactive: story told after end; narrator knows whole story\n\nAn experienced reader has expectations of a given genre; a good writer deviates\n\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "odyssey.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-012-forms-of-western-narrative-fall-2007/9cd5e5d838d6c6f3d5045c32f273b173_odyssey.pdf",
      "content": "21L.012, The Odyssey\n\n(11 September)\n\n2 of the central characters in The Odyssey\n- Poseidon, the god of the sea\no \"earth shaker\" is Poseidon's epithet\no [epithet]\n- Athene, the goddess of war and wisdom\n\nNote about gods: in Homer's world, a god does not embody only 1 idea; a god embodies a\ncluster of ideas.\nWhich qualities does Poseidon embody?\n\nNote about ceremony at the start of Book 3:\n- Ritual is prominent\n- Hospitality, as displayed toward Telemachus, is a vital part of the ancient world\n\n3.43-3.62\nThe passage illustrates manners\n- When the visitors Telemachus and Athene arrive at Pylos, food and drink come\nfirst, before inquiries\n- The king's oldest son escorts the visitors to the king\n- The cup is given first to Athene (who assumes the form of an older man)\n\nBooks 1-4: about getting Telemachus's education underway\n- he has not had education previously because of his father's absence.\n- Pylos serves as a good place for Telemachus to learn statecraft. Pylians represent a\nproperly functioning society, which contrasts to the dysfunctional Ithaka. Note\nPeisistratus, a well-behaving prince, who accompanies Telemachus.\n- The education of Telemachus involves copying a model\n\nNotice that the ceremony occurring in Pylos when Telemachus and Athene arrive is for\nPoseidon\n- Athene prays to Poseidon\n- The conflict between Athene and Poseidon motivates the story\n\nAthene\n- According to classical mythology, Athene is born from the head of Zeus, wearing\narmor\n- Represents strategic, crafty side of war\n- Metis, Athene's mother, means wisdom, cunning; was swallowed by Zeus, and\nremained inside, thus endowing Zeus with those qualities\n\nDoes Homer have an idea of general good that's distinct from what's good for Odysseus?\n\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nAthene is fond of Odysseus, favors him above all\n- when with him during Trojan war, she appeared in natural form\n- they shared qualities\n- Odysseus did Trojan horse; built large enough so that Trojans dismantled gates\n\nNotice that Athene prays to Poseidon\n- Potential interpretations:\no Poseidon is more senior than Athene\no The prayer is empty\n- When reading the story, we cannot foreclose which interpretation is best\n\nIn Homer's world, conflict between immortals (such as that between Athene and Poseidon)\nis different from conflict between mortals in that it's ongoing. Perhaps Homer shows that\ndifferent qualities are established parts of the world, and that one must find balance\nbetween fighting and accommodating.\n\nNotice that much of Greece is surrounded by water\n- In the ancient world, the sea was mysterious and uncontrollable\n- The sea is made of water, which is formless and changing, while we try to\naccomplish control, forming shelters, communities, rules, rituals\n- This suggests a conflict between civilization and what threatens it\n- An ancient Greek city was walled, which symbolized the walled space of civilized\nlife\n\nThe Odyssey starts differently from The Iliad\n- The Iliad: starts with wrath; the main character is introduced with his patronymic\n(lineage and place)\nThe Odyssey: the main character is introduced using his epithet \"man of many ways;\"\nfrom the Greek polutropos, which means \"many qualities.\" Odysseus has gone many\nplaces and is resourceful; he has broader experience of the world, and survives. Notice\nthat his companions died from recklessness.\n\n(13 September)\n\nOral storytelling in ancient Greece\n- Rhythm of Odyssey: dactylic hexameter (expand)\n- An oral story is not set as a written one is; it changes and evolves over time\n- The written version of The Odyssey likely came from professional poets in ancient\nGreece, which were important positions\n\nAlbert Lord and Milman Parry proved that the Odyssey came from an oral tradition by\ntracing formulae in the story: reused occurrances, which served as a mneumonic device for\nthose who memorized it\n\n1.420-1.444:\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTelemachus ponders, but his thoughts are not revealed\n\"he pondered in his heart\" is a formula used repeatedly in The Odyssey\nBecause characters' inner thoughts are not revealed, characters lack individual details,\nwhich is a characteristic of an oral tradition\n\n(18 September)\n\nOpening question: how do you know who you are?\n\nOne common answer is that we know who we are from others' recognition of us, from\nwhich we can observe that our own personal identities are not our own possessions.\n\nHow does this relate to The Odyssey? How are characters identified?\n- Patronymic: the proper way of introduction: the character's lineage and place, e.g.,\nOdysseus son of Laertas of Ithaka\n- Epithet: a term bestowed by others\n\nThe Odyssey opens with a kind of identity crisis\n- In the first few books of The Odyssey, Telemachus needs to know who he is, which\nhe doesn't know because he doesn't know his father\n- \"Nobody really knows his own father.\" (1.216)\n\nBooks 1-4: Telemachy\n- About Telemachus\n- About problems that arise in Ithaka in Odysseus's absence (e.g., in Book 2,\nfollowing Athene's advice, Telemachus calls an assembly for the first time--a\nkingly prerogative, but the assembly doesn't go well (in contrast to the first\nassembly in The Odyssey, which is among the gods, and goes smoothly)\n- After Telemachus's assembly, Antinoon, who is a suitor of Telemachus's mother\nPenelope and thus a guest at Telemachus's house, invites Telemachus to join him\nfor dinner at Telemachus's house, which further conveys the dysfunction in Ithaka\n- Note the roots of \"Antinoos\":\no Anti: against\no Noos: mind or soul\no He's the antithesis of Odysseus\n- In the background of the problems in Ithaka, the importance of a king is apparent\n\nEvidence of The Odyssey's oral tradition: the passages 3.71-3.74 and 9.252-9.255 are the\nsame\n\nThese passages illustrate the lack of consensus in The Odyssey regarding whether people's\nactions are determined by them or the gods:\n- 2.206-2.242: Telemachus complains of Odysseus's fate, raising the question of\nwhose fault it is--Odysseus's or the gods'?\n- Note that recklessness is considered to be caused by Ate, a minor divinity\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- 4.120: Helen is introduced in a matter-of-fact manner, not as someone who's\noppressed by the past\n- 4.240-4.279: Helen acknowledges the ability of divinity to influence; wavers about\nOdysseus\n- A muse is invoked at the start of The Odyssey\n- Telemachus needs a god's prodding to start\n- In the ancient Greek world, claiming influence of divinity did not absolve one of\nresponsibility for actions\n\nIn 2.230, Telemachus notes that Odysseus's ambiguous status is the worst fate that can\nbefall someone. Oscar Wilde said, \"The only thing worse than being talked about is not\nbeing talked about.\" There are more than a dozen Greek synonyms for honor, fame.\n\n2.158-2.160: \"they eat up the substance\"\n- Substance: Greek \"biotos\"\n- Life: Greek \"bios\"\n- In ancient Greece, possessions were an important part of the self\n- Nowadays, there's more interest in a deep self, beyond what others know\n- Conception of selfhood changes over time, influenced by technology (e.g., writing)\nor lack thereof\n\n2.125-2.126: a suitor says of Penelope upon learning of her stalling, \"she is winning a great\nname for herself\"\n- She weaves in honor of her father-in-law, but does so to stall until Odysseus\nreturns, so in doing so she weaves a trap for the suitors\n- What is the meaning of her reputation:\no Cunning, as Odysseus? Or\nUnusual for a woman?\n\n(20 September)\n\nWhat is the function in Book 4 of Sparta?\n\nStart of Book 4: wedding, which can symbolize the continuation of life\n- Jarring that Menelaus and Helen have only a daughter, while Menelaus has son\nwith a slave, which casts complication on future\n\n4.43-4.46: Telemachus and Peististratus marvel at Menelaus's palace and possessions,\nmuch of which he acquired in Egypt; he's the richest man they know\n- But Menelaus laments the tragedies that have befallen him (4.90-4.92)\n- He wishes that he could have fewer possessions in exchange for the men he lost in\nthe Trojan war, which is radical, considering the importance placed on possessions\nin ancient Greece\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- Casts a shadow on Greek values\n\n4.219-4.229: Helen puts potion from Egypt in wine to purge men's sorrow\n- Would that be desirable?\n- It would be nice to be free from pain, but pain is the price paid for being human\n- The human experience is mixed, though we imagine bliss (e.g., 4.561-4.570: \"place\nof ease\"); its appeal is questionable: immortality may be lonely, perfection boring\n\nNarrative:\n- The reader wants to get to the end of a compelling story, but the end of conflict\nends the reader's interest\n- Narrative is driven by conflict and tension; a good story cannot come from paradise\n\n5.1: Tithonas\n- connection between immortal and mortal, common in Greek mythology\n- Tithonas granted immortality, but not immortal youth\n\nHelen\n- from Zeus and Leda\n- Leda lays 2 eggs: Helen and Clytenmestra\n\nThe Old Man of the Sea\n- Subdued by Menelaus\n- Tells Menelaus of others\n- Aias smitten because of pride\n\nProtean: changing\nProteus and Poseidon: both of the sea: nature at its most uncontrollable, mysterious\n\nFirst instance of Odysseus: weeping\n- Arrives on shore naked: has nothing, has to rebuild\n\n8.550-8.561: Odysseus's identity is questioned\n- Name: a boundary marker for humans\n\n9.16: Odysseus introduces himself, must tell others of his deeds because his companions\nperished\n\nAt dinner, Odysseus honors poet, offers to promote poet if poet promotes Odysseus\n\nPhaiakians: seagoers with ships from Poseidon, isolated, between immortal and mortal,\navoid struggle, queen is niece of king\n\n(25 September)\n\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFrom handout:\nIn The Odyssey, the divine is distinct from the human, which is distinct from the natural:\n- Where and how you live\no Divine: on Olympus, free to move, to change form at will\no Human: in cities (end of nomadism); identity linked to place (e.g., Odysseus\nintroduces himself with his patronymic)\nPolis: significant, defines human's space\no Natural: homeless, wandering (until domesticated)\n- How related to other forms of life\no Divine: receive sacrificed animals from humans\no Human: sacrifice animals to gods\no Natural: objects of sacrifice\n- How related to others of same kind\no Divine: constantly shifting alliances, jealousies, etc.\no Human: strict hierarchies, ritualized interactions (\"guest-friendship\")\no Natural: no meaningful interactions (not \"social\")\n- How, what you eat\no Divine: nectar and ambrosia (no labor to get it)\no Human: cultivate crops; convert \"raw\" into \"cooked\" (labor, ritual)\no Natural: eat what lives or grows (raw)\n- Sex life?\no Divine: any time, any one, anywhere (free choice)\no Human: strict codes of behavior regulating partners (choice, but limited)\no Natural: no codes; mating season (no choice; obey impulse)\n- In general\no Divine: agents of constant change, immortal; change without threat to\nidentity\no Human: subject to constant change; rituals give illusion of controlling\nchange\no Natural: changeless--endlessly repetitive\n- Conclusion: civilization = (illusion of) controlled change (e.g.: royal succession)\n\nSignificant detail about Menelaus's story of Proteus:\n1.45-1.54: Odysseus kept at \"the naval of all the waters.\"\n\nThe story of Odysseus is the story of someone being taken beyond human boundaries:\nexplorations at borderlines of demarcations of humanity\n\nThe effort to make Odysseus's homecoming is effort to relocate him within human\nboundaries\n\nNote how Odyssey is told: the order of events vs. the order of telling\n\nWhat does order of telling emphasize?\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- Starting with Ithaka: importance of Odysseus in social structure; highlights\nTelemachus and his education\n- Books 1-4 and 5-8 feel simultaneous\n- Odysseus is discussed, built up, before he's introduced\n- Odysseus is introduced in a distressed setting\n\nOdysseus is articulate and clever: does, and tells of doing\n\n9.39-9.61: Odysseus and his men sack a city, not exciting\n- Adversary is not unusual ( a group of men)\n- Odysseus does not act distinctively\n- Loss because of recklessness\n- Failure of Odysseus's authority to control men\n\nRecognition important:\n- Sacking of city of Kikonians is unfruitful because Odysseus is not known as\nattacker\n- Odysseus risks safety to claim responsibility to cyclops\n\nWhat do unsuccessful encounters that Odysseus repeats reveal about meaningful parts of\nsuccessful encounters?\n- Contrast\n\nCyclops: border between humans and nature; if Odysseus failed, he'd risk becoming\nnobody; a recurring theme: each successful encounter expands name and reputation\nCyclops: lack of depth perception and multiple perspectives\n\n9.355-9.370: cyclops asks name, mocks notion of hospitality\n\n(27 September)\n\nOdysseus vs. Cyclops: about antithetics\n\nOdysseus: man of many ways, poulometis\nCyclops: small-minded (symbolized by 1 eye)\nhuman: can have multiple perspectives\nDemoticus: no sight but gift of song\n\nCyclops not social\nThus cyclops parodies ritual when encountering Odysseus\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n- The host-guest relationship is vital to society; to violate relationship accords guest\nno recognition\n- Odysseus says he's \"nobody\" (clever)\n- Nobody: \"outis\" in Greek\n\nIn encounter with enemy:\n\nA ==>\n\nB ==>\n\nA'\nO. son of...\n\nrisks outis\n\nO. son of...who accomplished...\n\nIf he fails, he becomes nobody\n\nOdysseus is introduced on island that is the \"naval of all the waters\"\n- He's \"detained in her hollowed caverns\"\n- Kalupto: cover up for protection\n- Similar to Kalypso\n- In a sense, Kalypso is as much a threat as Cyclops\n\nEncounter with lotus eaters: hospitable but dangerous because it threatens Odysseus's\nhomecoming\n\nTrojan War:\n- After 9 years of fighting, the war was still not settled\n- if nothing changed, the war would drag on indefinitely\n- Odysseus changed the course of the war with the Trojan horse\n\n9.413-9.415: \"the pain of his agony\"\n- pain: \"odino\" in Greek: pain of birth\n- agony: \"odinesi\" in Greek; similar to \"odino\"\n- each of Odysseus's repeated successes: a rebirth, as in the Trojan horse\n- Odysseus turns adversary into tool\n\nCirce episode:\n- 10.220-10.224: Circe identified with a loom; recall that Penelope weaved with a\nloom to stall her suitors\n- 10.224-10.243: Circe turns men into beasts; she seduces them (but Odysseus\nresists)\n- Why does Odysseus go to bed with her?\no He gets oath from her\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\no He reasserts his authority\n\nNote the threat of sexual desire in the ancient Greeks' male-dominated society:\n- The Odyssey suggests such a threat, as Circe reduces men to beasts\n- There's tension between the threat and the need of sex for procreation\n\nPenelope vs. Circe\n- Penelope seems subservient to men (she weaves for her father-in-law)\n- Circe is dominant\n\nAiolos:\n- Odysseus has the opportunity to get home, but near there, he falls asleep, and his\nmen open the bag of wind\n- Perhaps Odysseus wanted that to happen\n- Characters are capable of having others' desires\n\n\"Yet all experience is an arch, wherethro'\nGleams that untravelled world, whose margins fade\nFor ever and for ever as I move.\"\n-Tennyson, \"Ulysses\" (1842)\ndramatic monologue\n\nOdysseus wants to add to reputation, but he must return home eventually to tell others of\nhis accomplishments\n\nAs the monologue above suggests, there's a limit to Odysseus's actions; if he continued\non, his identity would eventually include everything\n\n11.100-11.111: \"contain your own desire\"\n\n12.184-12.200: Odysseus contains his desire by being confined\n\n(2 October)\n\n\"For all experience is an arch, wherethro'\nGleams that untravelled world, whose margin fades\nFor ever and for ever as I move.\"\n\n-Tennyson, \"Ulysses\" (1842)\n\nParadox of the quest for fame in The Odyssey:\n- If one experiences everything, one is not distinct; to be everything is to be nothing\n- In order for Odysseus to gain glory, he must \"cash in\" his experiences\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\n11.104-11.109: Odysseus must contain desire to get home\n- Otherwise he would approach the level of Helios (deity)\n- \"contain your own desire\"\n- Odysseus contains his desire in his encounter with the sirens by having himself\nconfined\no He becomes the only person to hear the sirens' song and live to tell of it\n\n12.184-12.191: the sirens offer Odysseus omniscience (a recurring theme in The Odyssey)\n\n2 concepts of identity:\n- One person vs. another\n- Humans vs. others\n\nIn Greek mythology, to be human is to strive to be more\n- E.g., the struggle between Menelaus and Proteus\n- The sirens offer Odysseus the chance to be omniscient\n\nNote 12.377: the consequences if Odysseus does not contain his desire\n\n11.110-11.136:\n- What's the significance of the information?\n- What light does it cast on the remainder of The Odyssey?\n- Odysseus does not ultimately defeat Poseidon\n- Details of Odysseus's death\no At sea\no Unglorious\n- The story of how Odysseus must make peace with Poseidon\n- A journey inland, in contrast to earlier journeys at sea\n- Odysseus must repay Poseidon after having his victory\n- Struggle between human tendency to become more and forces that can't be\novercome\n\nNotes on oral tradition of The Odyssey:\n- Careful design regarding order of telling\n- Book 11: midpoint, about descent of living man to realm of the dead\n- Death: ultimate form of becoming nobody\no Recall: a ==> b ==> a'\nE.g., men ==> beasts ==> better men\nCite as: James Buzard, course materials for 21L.012 Forms of Western Narrative, Fall 2007.\nMIT OpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    }
  ]
}