{
  "course_name": "Forms of Political Participation: Old and New",
  "course_description": "How and why do we participate in public life? How do we get drawn into community and political affairs? In this course we examine the associations and networks that connect us to one another and structure our social and political interactions. Readings are drawn from a growing body of research suggesting that the social networks, community norms, and associational activities represented by the concepts of civil society and social capital can have important effects on the functioning of democracy, stability and change in political regimes, the capacity of states to carry out their objectives, and international politics.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Political Science",
    "Sociology",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Political Science",
    "Sociology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nHow and why do we participate in public life? How do we get drawn into community and political affairs? In this course we examine the associations and networks that connect us to one another and structure our social and political interactions. Readings are drawn from a growing body of research suggesting that the social networks, community norms, and associational activities represented by the concepts of civil society and social capital can have important effects on the functioning of democracy, stability and change in political regimes, the capacity of states to carry out their objectives, and international politics.\n\nRequirements\n\nFor the second class session of each week, you will be expected to complete the vast majority of required reading and to contribute actively to class discussions. In order to facilitate discussion, you will be required to e-mail two discussion questions to me by noon of that day. During class discussion, \"cold calls\" will sometimes be used, although comments contributed will only help, not hurt, one's grade.\n\nThere will be no final exam in this class. You will be required to write three papers of 1200-1800 words (about 4-6 pages). The first paper is due in class on Lecture 9. You will also be required to rewrite the first paper. The rewrite of the first paper is due in class on Lecture 13. The second and third papers are due on Lecture 19 and Lecture 25. Rewrites of the second and third papers are optional but can only improve your grade.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nPapers and Rewrites\n\n75%\n\nClass Participation\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "Civil Society and the Dangers of Social Capita",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-905-forms-of-political-participation-old-and-new-spring-2005/b45c3d5e714681dc4e662c4536c53a7e_paper1_rewrite.pdf",
      "content": "Civil Society and the Dangers of Social Capital\n17.905 Paper #1\n(Rewrite)\nChristopher Suarez\nProfessor Lily L. Tsai\nMarch 18, 2005\n17.905\n\nSuarez\nCivil Society and the Dangers of Social Capital\nSocial capital is a very useful concept. In fact, it may be too useful. In this paper, I argue\nthat it is dangerous to apply the concept of social capital to theories of civil society. Despite its\npotential utility, current social capital theory is underdeveloped and is often misapplied to civil\nsociety, sometimes to the point of being completely unnecessary. Social capital theories have\nalready been applied too widely and, arguably, this has triVialized the concept. Moreover, in\njustifying civil society theories using social capital, theorists are less able to focus on exogenous\nfactors that contribute to civil society - historical context, culture, and economics - that seem to\nplay as strong of roles as any in shaping outcomes of civil society. Finally, the quantifiable\naspects of social capital are not rqbzsdy developed at this time, and scholars mislead both\nthemselves and the public in drawing conclusions from quantified social capital. This essay will\ngo into detail in each of these topic areas and elucidate the key points relevant to each discussion.\nBefore describing these dangers, however, it is first important to establish a working\ndefinition of civil society. For our purposes, civil society represents self-generating, self-\nsupporting, state independent organizations that allow citizens to act collectively in the public\nsphere to express their interests. Good or bad, civil society represents a mechanism through\nwhich the societal will can prevail publicly, be it through government policy or the establishment\nof cultural customs. Civil society represents the bridge that separates private and public spheres,\nand is a necessary intermediary between the two.\nSocial capital, on the other hand, plays a more microscopic role. Patrick Kilby, in\ndescribing the relationship between civil society and social capital, explains that, while civil\nsociety represents non-governmental institutional arrangements of society in governance, social\ncapital describes the underlying social relationships from which these institutional arrangements\n'Diamond, Larry. \"Toward Democratic Consolidation.\" p. 228\n\nSuarez\nemerge. This description implies the difference in scale between the two concepts. Civil society\nis a group concept used to affect change at the level of a large community. It is used in\nmaintaining social norms within a town, lobbying a national legislature to decrease taxes, or in\nproposing a worldwide summit to promote women's rights. As such, civil society operates at a\nmacroscopic level. This is unlike social capital, which can operate both microscopically and\nmacroscopically. With every relationship, bond of trust, obligation, or expectation, a marginal\nunit of social capital is added. Further, social capital can be generated in public and in private.\nJust as it is generated on Capitol Hill as people lobby to pass a bill, it is generated in families as\nchildren form bonds of trust with their mothers.2\nWith good reason, political scientists have increasingly used the concept of social capital\nto justify their respective formulations of civil society. 9 rclvil society and social capital, social\ncapital is certainly more useful. Since it operates as a micro-level concept, social capital helps\nexplain how relationships and ties between individuals and groups can lead tdesired (or\npossibly undesired) outcomes in almost any situation. Moreover, social capital is both tangible\nand quantifiable, allowing scholars to use it in rationalizing the legitimacy of theories of civil\nsociety. While past theories of civil society were based on mere intuition, theories of civil society\ncould now be \"grounded\" in social capital. With social capital, a theory of associations no longer\nassumes only that associations inherently lead to change. Rather, the theory can posit that\nassociations generate social capital, economic transfers are made, and change is produced from\nthose transfers. Social capital would seem valuable to any discussion of civil society.\nHowever, recent definitions of social capital have opened up the concept to overly broad\ninterpretations. James Coleman wrote in Social Capital in the Creation of Human Capital that\n2 Kilby, Patrick. \"Social Capital and Civil Society.\" National Center for Development Statistics\n\nJ u.\n,IL.\nsocial capital can take many forms: obligations, expectations, trust, information, or norms. Social\ncapital is also \"fungible,\" and forms of social capital that may be useful for one end may be\n\"useless or even harmful for others.\" To him, social capital resides within relations between\nindividuals and groups.3 Putnam, finally, argued in Making Democracy Work that social capital\ncould also reside within individuals, making an already ambiguous definition of social capital\neven more applicable.4\nAs such, more and more applications of social capital have been observed. In his paper\non social capital in community development, James DeFilipis provides two examples; the name\nof a 1999 Urban Affairs Convention (\"The Social Construction of the City: Social Capital and\nCommunity Building\") and the incorporation of social capital discourse within funding\ninitiatives for community building. s5 Today, a simple search on Google will yield information\nfrom the Canadian government referencing several studies on how your individual social capital\ndetermines your personal health.6 More abound.\nAlejandro Portes explains that social capital has essentially developed into an elixir that\nscholars use to solve all of the problems of the world. At te point it has been applied within so\nI /\nmany contexts, it begins to lose some of the meaning it may have once had.7 This does present\nsome danger, as social capital may eventually be discredited to such a degree that it gets lost in\nthe shuffle, never to be considered again when it may have had some future value in explaining\nphenomena. Its broad misapplication today could undermine its narrower, more proper\napplication tomorrow.\n3Coleman, James. Social Capital in the Creation of Human Capital\n4 Putnam, Robert. Making Democracy Work\n5 The Myth of Social Capital in Community Development, James DeFilipis, Housing Policy Debate, Fannie Mae\nFoundation, 2001\n6 \"Social Capital as a Health Determinant: How is it Defined?\"\nhttp:l/www.hc-sc.gc.caliacb-dgiac/arad-draa/english/rmdd/wpaperslengsocial2.html\n7 Portes p. 2\n\nSuarez\nPart of the reason that social capital is so broadly applied is due to the normative instincts\nof social scientists. Civil society itself is a very normative concept, and, in general, social\nscientists like to discuss it in terms of the good that can arise from it. Most discussions of civil\nsociety center on the overthrow of authoritarian regimes or the successful implementation of\nsocial change. Social capital, as a more powerful and seemingly positive concept, allows social\nscientists to naively fulfill their desires to make normative claims.\nOut of this desire, some applications of social capital to civil society have become\ntautological. The prime example of this is in Making Democracy Work, where social capital is\nsimultaneously represented as a cause and an effect. The book argues that high levels of social\ncapital produce positive outcomes, such as high government performance. Meanwhile, it infers\nthese high levels of social capital by examining the government characteristics of successful and\nunsuccessful cities. This practice is not necessarily bad. However, in desiring to make the\nnormative (and more appealing) claim of a relation between social capital ano government\nperformance, Putnam limited his social capital descriptors to civic factors, knowing that these\nfactors were generally correlated with the cities whose governments performed better. Putnam\nessentially said that civic minded cities do civic things well.8\nMany discussions of social capital can be done without. And this is not only the case with\nPutnam's tautology. When Jean-Pierre Worms discusses social capital in France, for example, he\ndiscusses a missing link syndrome in which large associations, directly connected to the state,\nbecome isolated from is\nd\nand therefore. He thus presents a solution in which\nseveral institutional reforms could be made to reestablish flows of social capital. By linking the\nstate to its citizens, he argues that civil society will be revitalized. Again, in a tautological form,\nWorms says that a government in which citizens voices are not heard can be remedied by a\ns Portes p. 19-20\n\nuarez\ngovernment in which citizens voices are heard. But isn't that obvious? We could have inferred\nthis without any discussion of social capital, and could have instead focused on the mechanisms\nthrough which a robust civil society may have been established in France.9\nAs scholars become preoccupied with their large stockpiles of social capital, they also\nglaze over political and economic changes that may have been confounding factors in shaping\nsocial conflicts. Regarding Putnam, John Ehrenberg points out that \"[Putnam's] focus on 'social\ncapital' signals [his] relative lack of interest in the political and economic roots of civic decline,\nsomething he shares with the moralizing neo-Tocquevillean theories of civil society\" (230).\nEhrenberg further explains how many civic organizations were created from state stimuli and not\na sense of civic virtue. He also cites Skocpol, who argues that many associations grew out of\npolitical and economic changes such as World War II and the New Deal.'\nMore specifically, preoccupations with stores of social capital ignore the role of\neconomic restructuring in shaping civil society and public perception. \" This As\nrelevant in\nPoland, Russia, some African and Arab states, China, or in any other state that may move toward\nprivatization and away from economic systems in the spiri~ of authoritarian or communist rule\n(or vice versa). It is clear that the privatized economy of Lebanon, in addition to Lebanon's\nhistory of communal ties, influences its standing as one of the more \"democratic\" states of the\nArab world.'2 It is also clear that, despite the long history of Polish \"solidarity\" and protest, its\n.ivil society became stronger as citizens gained confidence in a collective ability to affect change\npos-democratization. Social capital alone does not explain the ebbs and flows'of civil societies.\n9 Worms, Jean-Pierre. \"Old and New Civic Ties in France.\" Democracies in Flux. Oxford, 2002. p. 186-188.\n'0 Ehrenberg, John. Civil Society: The Critical History of an Idea. New York: New York University Press, 1999.\n\" Edwards, Bob and Foley, Michael. \"Escape from Politics? Social Theory and the Social Capital Debate.\"\nAmerican Behavioral Scientist, 1997. 40:5:551.\n12 Harik, Iliya. \"Pluralism in the Arab World.\"\n\nSuarez\nAdditional errors in social capital theorizing are encouraged by social capital's perception\nas a quantitative measure instead of a qualitative description. Pierre Bourdieu set the stage when\nhe defined the concept as \"the aggregate of the actual or potential resources which are linked to\npossession of a durable network of more or less institutionalized relationship....\" Fukuyama\nattempts to take this notion of quantification further by summing the memberships of groups and\nadding cohesion, radius of trust, and radius of distrust coefficients. 13 Generally, we encourage\nquantitative measures as objective measures of things. However, in this case, we are dealing with\nsomething that is incredibly difficult to quantify. How, for example, do we sum small networks\nof trust with large networks of trust? Are they at the same level of social capital? What about\nnegative social capital? Social capital's visualization as a quantitative concept invites false\noverestimates of its power.\nAnd indeed, numerical measures of social capital can be sufficiently gerrymandered to\nachieve a given end. Our whipping boy, Making Democracy Work, had this pr6blem when it\nlumped various factors of civic virtue into a single composite measure. This fact, along with the\nsingle-factor weighting of performance indicators performed by Putnam, makes an otherwise\nweak finding appear more robust.'4 James Gibson's discussion of social capital in Russian civil\nsociety also attempts to draw substantive conclusions from weak data. In his study, Gibson\nuniformly assumes that all within-family ties are strong while all of those made outside of the\nfamily are weak. Although this may possibly describe the majority of strong and weak ties, this\nis a very coarse measure. Gibson's conclusion that Russian social networks are strong because\n3 Fukuyama, Francis. \"Social Capital and Civil Society.\" Presented at the IMF Conference on Second Generation\nReforms, October 1, 1999.\nhttp://www.imf.orolexternal/pubs/ft/seminar/1999/reformslfukuvama.htm\n14 Jackman, Robert W., and Ross A. Miller. \"A Renaissance of Political Culture?\" American Journal of Political\nScience. 1996. 40:3:632-659, p. 639\n\n. Ar.ez\nthey contain many weak ties is undermined bvythe form of this measure.' How do we know that\nthe ties he identified as weak were actually weak? Were these ties necessarily good things?\nLuckily, there are members of the social capital school who are able to place the theory in\nits proper place. For example, when Mark Granovetter makes a compelling argument about the\ngains to be had from weak social ties. he discusses the positive results that could be achieved\nfrom these ties. Nevertheless, he also admits there could be negative ties - a strained friendship,\na begrudged former colleague - that may be detrimental to the attainment of these results. He\nalso admits that the strength of ties is very difficult to measure, and that purely focusing on their\nstrength ignores \"all important issues involving their content.\" Because the concept of social\ncapital is so intertwined with interpersonal associations, his discussion is very relevant. Just as it\nis hard to measure the strength of ties, it is difficult to measure quantities of social capital. \"\nUltimately, the words of sociologists are key. Granovetter reminds us that sociology is\nsociology, and that political science is political science. Sociologists definitely do need to\ninvestigate the strength of ties and the impact of associations, and political scientists need to\nunderstand these things. However, political scientists alsopeed to understand how institutions\noperate in full. As a continuing factor in this debate; social capital has attempted to simplify an\nincredibly complex concept of civil society into an immeasurable quantity, and has enticed many\npolitical scientists to remain on a one-track mind towards potentially false conclusions.\nTherefore, discussions of social capital need to be divorced from civil society nnA thi qhnmll\nremain the case until theories of social capital are further refined. In the interest of maintaining a\ndirect, accurate focus on all the factors that may contribute to civil societies, this is worth it.\n15 Gibson, James L. \"Social Networks, Civil Society, and the Prospects for Consolidating Russia's Democratic\nTransition.\" American Journal of Political Science, 45:1:51-68, p. 59 and 65\n16 Granovetter, Mark S. 'The Strength of Weak Ties.\" The American Journal of Sociology. 78:6:1360-1380.\n\nSuarez\nWorks Cited\n\"Social Capital as a Health Determinant: How is it Defined?\"\nhttp://www.hc-sc.gc.ca/iacb-dgiac/arad-draa/english/rmddlwpapers/engsocial2.html\nColeman, James S. \"Social Capital in the Creation of Human Capital.\" The American Journal of\nSociology. Vol. 94 Supplement: 1988:S95-S 120.\nDefilipis, James. The Myth of Social Capital in Community Development. Housing Policy\nDebate, Fannie Mae Foundation, 2001.\nDiamond, Larry. \"Toward Democratic Consolidation.\" in The Global Resurgence of Democracy,\ned. Larry Diamond and Marc Plattner, 1996, pp. 227-240.\nEdwards, Bob and Foley, Michael. \"Escape from Politics? Social Theory and the Social Capital\nDebate.\" American Behavioral Scientist, 1997. 40:5:550-61.\nEhrenberg, John. Civil Society: The Critical History of an Idea. New York: New York\nUniversity Press, 1999.\nFukuyama, Francis. \"Social Capital and Civil Society.\" Presented at the IMF Conference on\nSecond Generation Reforms, October 1, 1999.\nGibson, James L. \"Social Networks, Civil Society, and the Prospects for Consolidating Russia's\nDemocratic Transition.\" American Journal of Political Science, 45:1:51-68\nGranovetter, Mark S. \"The Strength of Weak Ties.\" The American Journal of Sociology.\n78:6:1360-1380.\nhttp://www.imf.org/extemal/pubs/ftlseminar/1999/refolms/fukuvama.htm\nHarik, Iliya. \"Pluralism in the Arab World.\" The Global Resurgence of Democracy, ed. Diamond\nand Plattner, 1996, Chapter 23.\n\nSuarez\nJackman, Robert W., and Ross A. Miller. \"A Renaissance of Political Culture?\" American\nJournal of Political Science. 1996. 40:3:632-659, p. 639\nKilby, Patrick. \"Social Capital and Civil Society.\" National Centerfor Development Statistics\nPortes, Alejandro. \"Social Capital: Its Origins and Applications in Modem Sociology.\" The\nAnnual Review of Sociology. 1998. 24:1-24.\nPutnam, Robert. Making Democracy Work Princeton, 1993.\nSeligman, Adam B. The Idea of Civil Society. New York: The Free Press, 1992.\nWorms, Jean-Pierre. \"Old and New Civic Ties in France.\" Democracies in Flux. Oxford, 2002.\np. 186-188."
    },
    {
      "category": "Resource",
      "title": "Clientelism in Urban America: Building Trust for Democratic Governance",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-905-forms-of-political-participation-old-and-new-spring-2005/f353b701ff6bab5dd850355b799b63d7_paper3.pdf",
      "content": "Clientelism in Urban America:\nBuilding Trust for Democratic Governance\n\nA Research Grant Proposal\nThe Ford Foundation\nPeace and Social Justice Program\n\n17.905 Paper #3\n\nChristopher Suarez\nProfessor Lily L. Tsai\nApril 20, 2005\n17.905\n\nSuarez\nClientelism in Urban America:\nBuilding Trust for Democratic Governance\n\nResearch Overview\n\nMost of the current literature relating to clientelism in politics assumes that patron-client\nnetworks are antithetical to sound Democratic governance. But do they necessarily have to be?\nAre there some elements of clientelism we may want to keep? American cities represent a unique\ncase in this debate. Unlike relatively homogeneous small cities or towns, a satisfied citizenry in\nlarge cities requires representation of an unusually diverse set of interests. From rich to poor,\ngold coast to ghetto, black to white, Puerto Rican to Asian, it is difficult, if not impossible, to\nappease large segments of an urban citizenry. When these large ethnic and/or socioeconomic\ndivides exist, I argue that higher levels of patron-client ties may serve as a good complement to\nDemocratic governance.\nIn particular, this research project seeks to find an association between levels of patron-\nclient ties and trust in government. The project will complement current theories that posit\nrelationships between trust in government and good governance. Through interviews, data\ncollection, and surveys, this study will assess levels of clientelism and trust in several American\ncities. As positive aspects of machine politics and patron-client networks are dismissed both in\ntheory and in practice, it is imperative that we grasp an understanding of their place in urban\npolitics now rather than later. Moreover, in a new generation - one in which most American\ncities have already made many progressive reforms - we must examine ways to re-shape our\nmetropolitan institutions to better represent the poor and the destitute. In some cases, using the\ngovernment to increase patron-client ties may be the way to do just that. And, even if this study\nfails to confirm the hypothesized relationship, we are left with an invaluable data set aids us in\nmaking myriad policy prescriptions that relate to levels of government trust in urban America.\n\nSuarez\nLiterature Review and Practical Relevance\n\nThe debate on whether or not machine politics are effective and/or trustworthy in urban\nsettings has been rattling for some time. After Richard J. Daley died in office in 1976, his\nobituaries not only lamented his passing, but also reflected on the passage of urban machine\npolitics as we knew it. When his son, Richard M. Daley, was elected mayor just thirteen years\nlater, however, many thought that this indicated a rebirth of urban machine politics. Many critics\nthen assumed that an ensuing political machine would hurt the Chicago government. Instead,\nreform ensued.1 But does that necessarily mean the elements of machine politics are gone? What\nif the reforms were occurring as the government maintained high levels of patron-client ties?\nIn the midst of his myriad reforms and award-winning initiatives (including a recent\naward from MIT for his efforts in public conservation), Daley is currently facing corruption\ncharges for his relation to a \"Hired Truck Program\" which used private firms to haul debris and\nmaterial from city construction sites. In the past, he has also been scrutinized for\ndisproportionately awarding construction contracts to certain ethnic groups. After this most\nrecent scandal, he was quoted as saying \"there is nothing more important to me than maintaining\nthe trust of all the taxpayers...we'll do what's necessary...we'll get to the bottom of this.\"2 As an\naward-winning mayor who has been elected to four consecutive terms by landslide margins, his\ngoal is to maintain trust. But what does he mean when he says trust? And why may it be so\nimportant in sustaining good governance?\nFor the purposes of this study, trust will be conceptualized in terms of the faith in the\noverall motives of the particular persons in government. That is, when a person perceives that the\ngoverning body has good intentions, we assume that person will have a greater trust towards that\n\n1 Stave, Bruce M. \"Urban Bosses and Machine Politics\" The Reader's Companion to American History.\n2 Rucker, Patrick and Ray Gibson. \"US Agents Seize Files at City Offices.\" Chicago Tribune May 1, 2005.\n\nSuarez\ngoverning body. This is the trust that allows politicians like Daley to win votes, and the type of\ntrust that gives people the confidence and motivation to get involved and help government out -\nthe type of trust we care about in this study.\nIt is important to address our non-use of one of the major counter-interpretations of trust.\nThis interpretation, presented by Luhman (1980) and Williams (1988), argues that trust applies\nonly to small number contexts. People will trust one another based on models of cooperation\nsuch as the prisoner's dilemma. Under the model, one can have a reasonable expectation that\nthere will be future interactions in which the trusted person may reciprocate. Thus, there is trust.\nHowever, such a game doesn't generalize to interactions with large numbers of individuals, and\nLuhman argues that \"participation in functional systems such as the economy...requires\nconfidence, not trust.\" This appears an exercise in semantics more than anything else. Because\ngovernment actions represent an aggregation of several individual preferences, and government\nis often viewed by individuals as a monolithic entity, I would argue that people form attitudes\ntowards government as if it were an individual. They can still trust government, and this is\nespecially true when we define trust in terms of benevolent intentions.3\nHaving defined trust, I turn to some of the relevant theories in the literature that help\nexplain the value high levels of trust may have on democratic governance. First, I discuss some\nof the theory presented by Tom Tyler, who discusses social trust. Second, I apply Mark Peel's\ntheories that relate to trusting disadvantaged citizens. Finally, I reflect on additional theories\npresented by Braithwaite and Hardin, who argue for the enculturation of trust and provide\narguments that help explain why trust is particularly useful for urban politics. Each theory gives\nus a reason to better understand trust in urban America, and will be considered in our research.\n\n3 Hardin, Russell. \"Trust in Government.\" From Ch. 1 Trust and Governance. Valerie Braithwaite and Margaret Levi, Editors: Russell Sage\nFoundation, 1998 p. 12-13\n\nSuarez\nIn Trust and Democratic Governance, Tyler discusses two types of trust. The first type of\ntrust, instrumental trust, has a rational choice grounding and is based on expectations of\nreciprocity - like the conception proposed by Luhman and Williams, this type of trust is not the\nfocus of our study, and is more difficult to apply to government institutions as a whole (albeit\narguably applicable). The second conception of trust, social trust, is more useful for our needs\nand can have huge implications on government conformity and deference.\nSocial trust, to Tyler, is linked to the sense of identity people derive from their\nrelationships with authorities. Specifically, the theory suggests that people value social status and\nreputations, and that those concerns motivate compliance with group rules. It also suggests that\ntrust in social authorities shapes judgments of an individual's social status and reputations, and\nthat treatment by social authorities leads to inferences about trustworthiness. In his conceptual\nmodel of social trust, Tyler groups social trust into two areas: pride and respect. We derive pride\nfrom the social groups we are in, and we maintain a social reputation with the hope of gaining\nrespect. He cites several studies that verified statistically significant relationships between\npride/respect and government compliance (Citizens in San Francisco, Employees at University of\nCalifornia Berkeley, and Bay Area Citizens).4\nIn line with our hypothesis, social trust can be fostered by patron-client relationships\nwithin cities. For example, if a big city mayor disproportionately rewards contracts to members\nof a certain socioeconomic or ethnic group, that group may feel as if it as a higher social standing\nthan another less-represented group. If big city leaders were able to establish such ties with\nseveral groups within a metropolis, moreover, I would argue that this could lead to a general\nincrease in social trust. How is each group supposed to know which group is receiving more\n\n4 Tyler, Tom R. \"Trust and Democratic Governance.\" From Ch. 11 Trust and Governance. Valerie Braithwaite and Margaret Levi, Editors:\nRussell Sage Foundation, 1998. , p. 280-284\n\nSuarez\nbenefits? In addition, the mayor that holds local cookouts, supports the local sports leagues in\ncertain areas, and puts efforts towards public works projects will make the residents of the\nbenefited regions feel empowered to appreciate what the government is doing for it. Particularly\nfor the impoverished, the community is all they have. The small things - getting food on the\ntable, having adequate housing and public services, and being recognized - are what matter\nmost. Moreover, the lower class and less educated have more of an interest in using politics for\nsocial mobility, making them more susceptible to clientelist politics.5 In general, by feeling\nempowered and achieving a sense of pride in their social standing as a result of patron-client ties,\nthey are more than willing to give their votes.\nBecause the poor and destitute care more about these microscopic-level issues, patron-\nclient ties are more likely to increase their levels of trust than are patron-client ties for the rich\nand socioeconomically advantaged. Because the poor segments of the population represent a\nsubstantial minority and often fail to vote in larger national elections, establishing trust and\npositive relationships with them is often avoided in these situations. Cities, with concentrated\nlevels of the poor who vote more often, provide a special context in which patron client-ties can\nbenefit the disadvantaged.\nIn smaller urban settings, moreover, there is less of an incentive to reach out to the upper\nclasses to increase trust. This is because trust is generally established for these individuals by\ntaking positions on larger issues (i.e. taxes and abortion). Because these larger issues tend to be\nso divisive, effectiveness in office will correlate strongly with disappointing or offending a large\nproportion of these constituents.6 And, whereas the rich and the socially empowered (and even\nthe middle classes in some cases) will always provide financial resources to their candidates to\n\n5 Greene, Kenneth F. \"Against the Machine: Party Organization and Clientelist Politics in Mexico.\" October, 2001. [Unpublished, Submitted for\nPeer-to-Peer Review], p. 15\n6 Hardin, Russell. \"Trust in Government.\" From Ch. 1 Trust and Governance. Valerie Braithwaite and Margaret Levi, Editors: Russell Sage\nFoundation, 1998, p. 19\n\nSuarez\nencourage their allocations of patron-client ties and/or pork, the poor and destitute won't\nnecessarily dole out what they have to give - their votes. They are primarily swayed by\nmaintaining and increasing social ties.\nOne of the most major concerns of disadvantaged citizens, as Peel argues, is a desire to\nfeel accepted in society. Frankly, disadvantaged citizens are oftentimes just not trusted. Workers\nat welfare and other social agencies often interrogate disadvantaged citizens as they make benefit\nclaims. There is often an assumption that the disadvantaged are \"dumb\" or \"inadequate.\" Peel\nfurther explains that the disadvantaged often feel powerless, and that they resent having to\npassively accept a third-party interpretation of their problems. 7\nAdmittedly, increased social trust due to additional patron-client ties may perpetuate such\nmistreatment. For example, after benefits were conferred to citizens by the hypothetical mayor as\ndescribed above, it may be the case that people are socially empowered to such an extent that\nunsatisfactory levels of bureaucratic performance may be masked by a high perception of trust in\nthe government. At the point people's conceptions of themselves change and self-esteem\nincreases due to higher levels of social trust, people may become more compliant. Thus, in\nperforming this study, we will separately analyze trust that relates to one's social standing and\ntrust that directly relates to bureaucratic performance. In the meantime, however, we must\nacknowledge the potential that these two forms of trust may be correlated with one another. Even\nif we were to find that increasing patron-client ties increases social trust within destitute regions,\nwe still must recognize the potential that some institutions may still fail post study. If high levels\nof patron-client ties promote social trust but damage institutions, finding a relationship between\nsuch ties and social trust may not have as great of implications for good governance.\n\n7 Peel, Mark. \"Trusting Disadvantaged Citizens.\" From Ch. 13 Trust and Governance. Valerie Braithwaite and Margaret Levi, Editors: Russell\nSage Foundation, 1998., p. 319\n\nSuarez\nAnother point we must consider is presented by Braithwaite. He argues that we must\ninsist on enculturating trust by institutionalizing distrust. By institutionalizing distrust through\nlaws, law enforcement, and an open civil society that serves as a check to the government, he\nargues that abuses of power such as violence, environmental destruction, and political corruption\nmay be thwarted. If patron-client ties are high (and thus political corruption is high), it would\nthen appear that there is more of an \"institutional trust\" in society if we assume this theory is\ntrue. By assessing the levels of trust we obtain in this study, we can gain some insight into that.\nWe can thus glaze the surface in testing Braithwaite's theory.8\n\nUnfortunately, urban politics has lost a substantial amount of momentum in the last\ncouple of decades. After producing high amounts of valuable theory throughout the first two-\nthirds of the twentieth century, recent work of the urbanists has done little to bolster political\nscience. Its focus, Danielson and Lewis argue, has been too much on the big cities, and that\nrecent scholarship has led to a skewed perception of urban phenomena. They advocate a\ndiscourse in which a more general \"politics of urbanization\" is discussed, so as to ensure that the\nroles of suburbs and areas outside of the city proper are properly synthesized with the theory.9\n\nI agree with this, and would advocate a future expansion of my initial study into the\nsuburbs to see if the theory carries over to these areas. With the virtual nonexistence of the urban\ndowntowns of the past and the reality of suburban sprawl, this makes sense. Nevertheless, I\nfirmly believe that focusing on urban metropolises is critical to this study. In fact, I believe it will\nredirect the currently misguided and technically infiltrated debates in urban politics towards\nsomething more useful.\n\n8 Braithwaite, John. \"Institutionalizing Distrust, Enculturating Trust.\" From Ch. 14 Trust and Governance. Valerie Braithwaite and Margaret\nLevi, Editors: Russell Sage Foundation, 1998.\n9 Danielson, Michael N. and Paul G. Lewis. \"City Bound: Political Science and the American Metropolis. Political Science Quarterly, 49:1:203-\n220, March 1996.\n\nSuarez\nIn particular, this study is unique from the most recent emphases in the urban political\nfield. Unlike the studies of Sayre, Kaufman, Elkin, Stone, and others, it is not a study that tries to\nassess the viability of elitist and pluralist paradigms in city governments. It is not, moreover, a\nstudy that discusses the factors for business influence and economic power in urban contexts.\nRather, it is a study that allows us to examine a commonly criticized element of urban politics\n(patron-client ties) and determine if it may actually contribute to some things that are beneficial.\nAnd, while our initial results will only be applicable to large cities, we may be on the forefront of\nmore general theoretical principles - we will understand various dimensions of trust within cities\nand their relationship with patron-client ties.\nMeasures and Methods\n\nThe methodology of this study operates on two fronts. First, I assess the preferences and\nbeliefs of the citizens of each selected metropolis. This is necessary to determine levels of trust\nindividuals within a city have for their government. Second, I collect information about the\ngovernment institutions themselves - facts and internal beliefs - that will combine to provide\nsome measure of the levels of clientelism within each city. The following paragraphs will discuss\nhow exactly all of this information will be captured and conclude with an explanation of the\napproach to data analysis necessary to ground our results.\n\nTo assess the levels of trust within a particular government, we will randomly select\n10,000 residents from each city. Because all of the large cities in the selection pool are divided\ninto (approximately equally populated) wards, we perform randomization at the level of each\nward (we select 10,000/W from each, where W represents the number of wards). This way, we\nensure that each major aldermanic constituency is well-represented in the survey, and that we\ncan guarantee representation of both lower and higher-income wards (we will collect ward-level\n\nSuarez\ncensus data). Although it will be impossible to randomize from the entire population within each\nward (residential and/or telephone records may not account for some of the most destitute), this\nmethod should allow us to obtain a viable distribution of individuals within a given city.\n\nHaving selected these individuals, we will distribute questionnaires to them. To\ndiscourage nonresponse, we intend to offer financial incentives to each respondent and will\ngenerally go door to door (although the telephone may be used on occasion). We will then pose\nquestions that center around the two areas of trust we wish to focus on: social trust and,\nbureaucratic trust. We will also collect demographic data of the respondents (i.e. income, race),\nto identify groupings within each city that may have special significance.\n\nTo assess trust, we will ask questions in the spirit of those suggested by Tyler (270). We\nwant to know whether people believe the government \"is genuinely concerned about your\nneeds,\" \"considered your arguments,\" \"tried to do what is right for you,\" or \"tried to be fair to\nyou.\" We will group these questions as they relate to the types of trust described above. For\nsocial trust, we will ask questions about how one feels \"socially connected\" to the government.\nWe will frame these questions in terms of whether people feel the government is genuinely\nconcerned about your social needs. We will ask if people feel socially attached to government\nprograms and ideals. Other questions will be directed at specific areas of social life.\n(Diagram of Dependent and Independent Variables)\nFor bureaucratic trust, we will ask whether or not people believe workers at government agencies\nare concerned about needs and whether people feel trusted during bureaucratic transactions. This\ndata will be particularly useful for those who are poorer, who we learned tend to feel distrusted\nin these situations. Finally, to test Braithwaite's theory on a potentially institutionalized trust (or\ndistrust), we can collect information on the degree to which people believe the \"government\n\nSuarez\nseeks to protect them,\" \"promotes public welfare,\" and \"staves off corruption.\" And, while we\ncan assess all of these measures of trust independently, we can group them together as well.\n\nWhile obtaining these trust indicators, half of the research team will be devoted to\ndetermining the levels of patron-client ties within each city. Patron-client ties, for data collection,\nare defined as direct relationships between the government and outside groups. They are about\npersonal obligations and the exchange of favors.10 As we are collecting data for patron-client ties\nand trust over a year-long period, we acknowledge that major events could occur during data\ncollection that may impact results relating to levels of trust beyond patron-client ties and all\ncontrol variables we may use. Because we intend to survey at least ten cities, however, we doubt\nthese problems will arise in many of the cases.\n\nAssessing the degree of patron-client ties is a more nebulous than simply surveying\nindividuals about trust, but we have devised a good strategy for determining this. Before\nspeaking with anyone, we intend to examine the most recent available financial records\n(specifically pork spending) of each city relative to the year the study is performed. This will\nallow us to see the allocations of various monies to each of the wards within the cities. In\naddition, we will scour public records and survey construction companies within each city to\ndetermine the extent to which public contracts are awarded to various firms. Because I have done\nresearch studies in the past and know insiders within construction unions, I will be able to seek\nout most of these companies. Insiders will also inform me about any rogue construction groups,\nas these groups operate against the union. Gathering this data will give us some sort of gauge on\nthe patron-client ties between government and certain social/ethnic group within the cities.\n\nAlthough the methods above are the only ways in which I can gather empirical data to\nassess patron-client ties, we will conduct interviews of city bureaucrats from each city ward\n\n10 Stone, Clarence N. \"Urban Political Machines: Taking Stock.\" PS: Political Science and Politics. 29:3:446-450, September 1996., p. 446\n\nSuarez\nduring the study. We will ask them about the legitimacy of various clientelist tactics that are\nspecific to various ethnic and socioeconomic groups within each ward. Their beliefs on issues\nrelating to clientelism and patron-client networks will serve as a useful proxy to the level of these\nnetworks. Because this proxy is best realized by interviewing those in power, these interviews\nwill ideally be of aldermen themselves, but we may interview people who work directly with the\naldermen if this is not possible.\nAdmittedly, it would seem on-face that interviewing aldermen would yield skewed\nresults because of an incentive to lie about patron-client ties. We take four steps to avoid this\nproblem. First, we will frame our questions about the legitimacy of various clientelist tactics\nassuming that the alderman's goal is simply to maximize votes. We know from rational choice\ntheory that this is the primary goal of most politicians, and, by framing the question in this way,\nthe politician will feel less inclined to inculcate moral standards into the answer. Second, the\nsurvey will only ask about \"democratic clientelism.\" In particular, this means the types of patron-\nclient ties that don't imply coercion or other violent measures (presumably, this represents the\nmajority of clientelist ties in the US today anyway). Third, we will ask the controversial\nclientelist questions towards the middle of our interviews. Thus, the questions will be asked after\nthe alderman hopefully feels somewhat comfortable with the interviewer. Finally, the clientelist\nquestions will not be asked in rapid-fire succession. Instead, they will be interspersed with other\nquestions so as to raise the cognitive difficulty of categorizing questions. Hopefully, these\nprecautions will allow us to obtain accurate measures of levels of patron-client ties.11\nFrom this discussion, we have seen that this study uses robust, multi-layered methods to\ncollect data for both trust and clientelism. Upon collecting the data, we intend to run regressions\n\n11 Greene, Kenneth F. \"Against the Machine: Party Organization and Clientelist Politics in Mexico.\" October, 2001. [Unpublished, Submitted for\nPeer-to-Peer Review]\n\nSuarez\nto confirm or reject the various relationships. We will control for relevant variables. As\nnecessary, we will do T-tests for differences of means to determine statistically sound differences\nin trust between groups.\nStudy Implications and Benefits\nUltimately, this study will achieve four major goals. First, we will understand levels of\nclientelism better within cities. Do strong patron-client ties still exist in cities? Are they there but\njust less obvious? Second, we can do comparisons of trust levels and different types of trust\nacross social and ethnic groups. Are there particular institutions that need systematic\nimprovement? Can we increase trust by improving them? Finally, we will be able to confirm or\ndeny the hypothesized relationship between patron-client ties and trust, particularly for the urban\npoor and disadvantaged. For these people, breeding a sense of trust may serve huge tangible\nbenefits for cities, as it can empower people to take actions to improve government when it was\notherwise considered useless. Given how much work city governments still have to do to\nimprove their infrastructures, the potential for this alone makes this study worth it. We still do\nnot know how to solve the problem of urban poverty, and a better overall understanding of\ncitizen trust within our cities could add a missing piece to that puzzle.\n\nSuarez\nWorks Cited\n\nBraithwaite, John. \"Institutionalizing Distrust, Enculturating Trust.\" From Ch. 14 Trust and\nGovernance. Valerie Braithwaite and Margaret Levi, Editors: Russell Sage Foundation,\n1998.\nDanielson, Michael N. and Paul G. Lewis. \"City Bound: Political Science and the American\nMetropolis. Political Science Quarterly, 49:1:203-220, March 1996.\nGimpel, James. \"Reform-Resistant and Reform-Adopting Machines: The Electoral Foundations\nof Urban Politics.\" Political Research Quarterly, 46:2:371-382, June 1993.\nGreene, Kenneth F. \"Against the Machine: Party Organization and Clientelist Politics in\nMexico.\" October, 2001. [Unpublished, Submitted for Peer-to-Peer Review]\nHardin, Russell. \"Trust in Government.\" From Ch. 1 Trust and Governance. Valerie Braithwaite\nand Margaret Levi, Editors: Russell Sage Foundation, 1998\nPeel, Mark. \"Trusting Disadvantaged Citizens.\" From Ch. 13 Trust and Governance. Valerie\nBraithwaite and Margaret Levi, Editors: Russell Sage Foundation, 1998.\nRucker, Patrick and Ray Gibson. \"US Agents Seize Files at City Offices.\" Chicago Tribune May\n1, 2005.\nStave, Bruce M. \"Urban Bosses and Machine Politics\" The Reader's Companion to American\nHistory.\nStone, Clarence N. \"Urban Political Machines: Taking Stock.\" PS: Political Science and\nPolitics. 29:3:446-450, September 1996.\nTyler, Tom R. \"Trust and Democratic Governance.\" From Ch. 11 Trust and Governance. Valerie\nBraithwaite and Margaret Levi, Editors: Russell Sage Foundation, 1998.\n\nSuarez\nAppendix A: Grant Specification\nPUBLIC POLICY/LAW\nFord Foundation Peace and Social Justice Program\nFoundation's home page\n\nhttp://www.fordfound.org/program/peace_main.cfm"
    }
  ]
}