{
  "course_name": "Foundations of Development Policy",
  "course_description": "This course explores the foundations of policy making in developing countries. The goal is to spell out various policy options and to quantify the trade-offs between them. We will study the different facets of human development: education, health, gender, the family, land relations, risk, informal and formal norms and institutions. This is an empirical class. For each topic, we will study several concrete examples chosen from around the world. While studying each of these topics, we will ask: What determines the decisions of poor households in developing countries? What constraints are they subject to? Is there a scope for policy (by government, international organizations, or non-governmental organizations (NGOs))? What policies have been tried out? Have they been successful?\nMITx Online Version\nThis course is part of the Micromaster’s Program in Data, Economics, and Design of Policy through MITx Online. The course is entirely free to audit, though learners have the option to pay a fee, which is based on the learner’s ability to pay, to take the proctored exam, and earn a course certificate. To access the course, create an MITx Online account and enroll in the course 14.740x Foundations of Development Policy.",
  "topics": [
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Public Administration",
    "Public Policy",
    "Social Science",
    "Economics",
    "Developmental Economics",
    "International Development",
    "Public Administration",
    "Public Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nDescription\n\nThis course explores the foundations of policy making in developing countries. The goal is to spell out various policy options and to quantify the trade-offs between them. We will study the different facets of human development: education, health, gender, the family, land relations, risk, informal and formal norms and institutions. This is an empirical class. For each topic, we will study several concrete examples chosen from around the world. While studying each of these topics, we will ask: What determines the decisions of poor households in developing countries? What constraints are they subject to? Is there a scope for policy (by government, international organizations, or non-governmental organizations (NGOs))? What policies have been tried out? Have they been successful?\n\nPrerequisites\n\nA microeconomics and a statistics course are prerequisites. Examples are\n14.01 Principles of Microeconomics\nand\n14.30 Introduction to Statistical Methods in Economics\n. Econometrics is not a prerequisite for this class, but you will be expected to be willing to familiarize yourself with basic econometric methods. The relevant material will be covered in class and occasionally in the recitation.\n\nTextbooks and Readings\n\nThe textbook for this class is Debraj Ray's\nDevelopment Economics\n. However, we will rely mostly on articles. There are many readings for this class. You are not expected to read every single article in detail, but you are expected to understand the methods used by the authors to reach their conclusions. Required readings are starred. Lecture notes will be distributed at each lecture. They are not a substitute for attending the class, but rather a study aid.\n\nRay, Debraj.\nDevelopment Economics\n. Princeton, NJ: Princeton University Press, 1998. ISBN: 9780691017068.\n\nRequirements\n\nProblem Sets\n\nThere will be about one problem set every 2 or 3 lectures (for a total of 6 problem sets), with each one due a week after it is handed out. Problem sets will contain empirical exercises, theory exercises, and written assignments developing a policy idea that will culminate in your class presentation. In the first few recitations, you will learn how to use Stata software to complete these exercises. Problem sets for this class are very important, and somewhat time-consuming.\n\nPresentations\n\nStudents will work in pairs to develop a program proposal throughout the semester that addresses a need or problem in a developing country. Students must identify a problem, research the underlying causes, and come up with a program that may help address the problem. Each group of students is required to present their findings during brief class presentations, approximately 5 minutes long.\nClass presentations will take place Ses #15 and #16\n.\n\nExams\n\nThis class has two equally weighted exams.\nThere will be a mid-term exam after Ses #12 and a final exam during exam week\n.\n\nGrading\n\nThe grade is based on the following activities. Class participation is expected, and will be taken into account in marginal cases (i.e. in the difficult decision between B+ and A).\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets (6)\n\n40%\n\nMid-term exam\n\n25%\n\nFinal exam\n\n25%\n\nClass participation and presentations\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/4edf3dab00f61bea642cd5327c191a80_MIT14_74s09_pset07_project.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Presentations\n\nEach of you is required to present to the class on a topic that interests you in development.\nYou may work in a group of two or individually. The talk should be 5 minutes long, and\nif you work in a group, both students should take the opportunity to speak.\n\nPresentations will take place on Ses #15\n\nand Ses #16\n\n. The presentation schedule will be\ndistributed on Ses #13, and students will be randomly assigned to one of the dates. In\naddition to the presentation, please hand in either (a) a two-page summary of your topic\nOR (b) detailed slides from your presentation. The summary or slides are due on the day\nthat you present.\n\nYou may choose your own partner for this presentation. You must e-mail the course\nteaching assistant by Ses #12\n\nwith your choice of partner and topic. If you are unable\nto find a partner, e-mail the teaching assistant and list 2 or 3 topics that interest you, and\nlet her know if you would prefer to work alone or with a partner. She will assign matches\nto the remaining students who would like partners.\n\nHere are the guidelines for the talk and written summary:\n1) Choose a topic that interests you from the syllabus (Nutrition, Education, Health,\nGender Discrimination, Bargaining in Families, Gender in Politics, Savings,\nLand, Insurance, Credit Markets, Formal and Informal Institutions, Corruption)\n2) Read at least three papers on the topic that you have chosen.\n3) Identify a problem and a possible underlying cause. (Examples of problems: why\ndo poor people have poor nutrition? Why are health services underutilized? Why\ndo credit institutions not serve the poor, or charge such high interest rates when\nthey do?)\n4) Brainstorm at least three possible programs that could mitigate the problem\nyou have chosen by affecting the channel you identified.\n5) Choose the program you have thought of that sounds most promising to you, and\ndescribe it in some detail. How would you implement it? Who would be the target\naudience? How would you encourage take-up of the program? What do you\nexpect the effect to be?\n6) Describe how you would evaluate the program. Would you use a randomized\nevaluation or some other technique? Who would comprise the treatment and\ncontrol groups? At what level would you randomize or assign treatment? What\ndata would you collect? What are the relevant outcome variables?\nIn your talk, you should clearly outline the topic, problem, and cause. Describe the\nprogram you think may address the problem. Explain clearly why you think it meets a\npotential need and how it could lead to improvement in the lives of the poor.\nThe summary write-up or slides should provide a written description of the steps outlined\nbelow. In particular, list the 3 papers you have read. Describe the problem and the\npotential cause you have identified. List your three possible approaches to solving it.\nDescribe the most promising program in more detail."
    },
    {
      "category": "Assignment",
      "title": "Problem Set #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/bb61f91b033d8553603c0699610590f4_MIT14_74s09_pset01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n14.74 Foundations of Development Policy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Problem Set # 1\nDue at the beginning of recitation on Friday, February 20, 2009\n14.74 Problem Set #1, p. 1\n\nNo late problem sets will be accepted\n\nFeel free to work in groups. But please hand in individual problem sets.\nPlease give clear concise answers (the least amount of words it takes to make your\nmeaning clear). The point of this problem set is to think thoroughly about the models and\nissues discussed in lectures and recitation and to relate your own insights to the intuition\ngiven in class.\n\n1. World Bank Development Report Data\nThe point of this exercise is to help you understand the faces of poverty on the one\nhand, and acquaint you with Stata on the other. You will need to download the Stata\ndata set (wbdr.dta; this data set contains 1997 variables, unless otherwise noted) from\nthe course website. There, you will also find instructions for using Stata. Hand in\nyour do file with the problem set. No need to hand in the log file, although you can\nhand in the parts that are directly relevant for answering questions below.\na. What are the mean and standard deviation of GNP per capita and infant mortality\nin 1997 across countries? Compare the average male illiteracy rate to the female\nilliteracy rate. Why might they be different?\nb. Restrict your data set to countries for which we have GNP per capita for 1997.\nWhat are the mean, minimum, and maximum illiteracy rate, infant mortality rate\n(for 1997), and under 5 mortality rate among the 50 richest countries? Among the\n50 poorest countries? What does this tell you about the relationship between\nincome and illiteracy, and income and mortality? (Hint: use the gsort command--\nread the help files to learn how it works, and make sure that you sort in the\ncorrect ascending or descending order! Use \"sum in 1/50\" to summarize across\nthe first 50 observations in the data set.)\nc. Now, find the median GNP per capita. How is it different from the mean GNP per\ncapita from part (a)?Why might the mean and median be different? What\ninformation can we infer about the income distribution (inequality) from this?\n\nReturn to using the original (unrestricted) data set.\ni. Regress the illiteracy rate on per capita GNP in 1997. Report the coefficient\non per capita GNP and its standard error; what do they tell you? Is the sign of\nthe coefficient what you expected? Explain briefly. What is the t-statistic for\nthis coefficient, and what does it tell you? Interpret the 95% confidence\ninterval.\nii. Regress the infant mortality rate in 1997 on GNP per capita in 1997. Is the\ncoefficient on per capita GNP significantly different from zero? How do you\nknow? Interpret the coefficient in terms of a $1000 difference in per capita\nGNP.\niii. Regress the infant mortality rate in 1997 on the illiteracy rate. Graph a scatter\nplot of the data as well as the regression line. (Use the \"graphics\" option\nfrom the Stata toolbar. Stata will output the code as well as the graph. You\nshould then try typing the code in directly instead of the editor. It is much\nfaster.)\niv. Using the results from part i-iii, what can we say about the causal relationship\nbetween illiteracy, infant mortality, and income (GNP)? In other words, tell a\n\nstory of how illiteracy, income, and infant mortality might affect one another.\nBe concise but clear about what causes what and why.\n2. Poverty, Nutrition and Labor Markets\nThis exercise is based on the lecture and the textbook pp. 272-79, 489-504. Each\nanswer should not be longer than a couple of sentences.\na. In what circumstances will unequal allocation amongst a 2-member household\nincrease total household work capacity? Discuss the importance of the convexity\nof the relationship between work capacity and income. Please illustrate this in a\nsimple graph.\nb. For a workers with no non-labor income (e.g. land) and are getting piece rates,\ndraw the aggregate labor supply curve and a standard downward sloping labor\ndemand curve with piece rates on the y-axis. When will unemployment occur? In\nequilibrium, why can the piece rate not be bid down so that people who are\ninvoluntarily unemployed can obtain work?\nc. How does having non-labor income affect the work capacity or willingness to\nwork? (Hint: think of the difference tradeoffs between working and not working\nfor the two different types of workers.)\nd. Discuss in words and graphically how voluntary and involuntary unemployment\ncan be generated in an economy where some workers have non-labor income and\nother workers do not.\ne. What policy can the government enact to address involuntary unemployment?\nBriefly discuss the tradeoffs of your policy suggestion.\nf. Recall from class that nt=g(workcapacityt)=g(f(nt-1)), algebraically derive the\nelasticity of income with respect to nutrition. Explain the meaning of this term\nwith words.\nImagine that we have survey data of people's food expenditure and their basic\nincome and demographic characteristics (e.g. age, education, etc.)\ng. Write the linear regression that you would run to answer the question whether\npeople who eat more nutritiously earn more.\nh. Can the regression estimate tell us whether eating more nutritiously causes higher\nincome ? Why or why not?\ni. Do you predict the coefficient of your regression aboveto be positive or negative?\nj. Do you predict the coefficients b and d to be positive or negative if you regress\nincome or nutrition on education?\nIncomei=a + b(educationi) + e\nNutritioni=c + d(educationi) + m\nk. How might the results from part (i) and (j) affect the interpretation of the\nregression you ran in (g)?\nl. Give two separate examples of measurement error that would cause us to\noverestimate and underestimate the effect of income on nutrition intake. Explain.\n3. Essay exercise: A preview of material to come\nFor this exercise, please pick one of the questions we generated during the lecture on\n\"The Economic Lives of the Poor\" on February 9th regarding demographics,\nconsumption patterns, education, savings, borrowing, employment, and earnings.\nIdentify a part of the syllabus that addresses your selected question. Read 2-3 of the\n14.74 Problem Set #1, p. 2\n\npapers or readings on the syllabus under that section, and write a concise essay\n(approximately 1 or 2 typed pages) explaining how these papers relate to the selected\nquestion.\nAt the top of the page, list the papers you have read, and clearly state your selected\nquestion. Explain how the facts discussed in \"The Economic Lives of the Poor\"\nmotivate the question you have selected. Discuss how the papers you read help to\nanswer the question--either by explaining a puzzling fact, analyzing a potential cause\nfor a problem, or evaluating a possible solution. Close your essay by briefly\nsummarizing any important aspects of the question that you think these papers did not\naddress.\nFor your reference, a partial list of potential questions is included below. You are not\nrestricted to the questions on this list; you may select any question that is broadly\nmotivated by our class discussion on February 9th .\nDemographic questions\n- Why do the poor have so many children? Does poverty cause them to\nhave more children? Or are they poor because they have so many children?\n- Does poverty cause high mortality rates? Or does poor health cause\npoverty?\nConsumption questions\n- Why are there so many festivals? What is the role of alcohol and tobacco\nconsumption?\n- Are the poor malnourished? Do they consume enough calories? Why not?\nEducation questions\n- Why do so many 13-18 year olds drop out of school?\n- What explains the gaps in rural/urban schooling expenditures?\n- Why is there such a large gap between poor and middle class schooling\nexpenditures?\n- Why is there such a large gap between the education attendance of girls\nand boys?\nSavings and borrowing questions\n- Why don't the poor accumulate more savings?\n- Why are there such big differences in savings behavior across countries?\n- What are poor people saving up for?\n- Are savings alone sufficient to smooth consumption?\n- Why aren't loans effective at fully smoothing consumption?\n- Why isn't there a stronger bank presence, given the apparent demand for\nlending?\n- Why do the rich borrow more than the poor?\n- Why does everyone own land?\nEarnings and Employment\n- Why is there so little permanent migration?\n- Why do poor people have so many different jobs? Why are so many of\nthem small business owners?\n14.74 Problem Set #1, p. 3"
    },
    {
      "category": "Assignment",
      "title": "Problem Set #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/920ce0895ad068b474c16658ebd73746_MIT14_74s09_pset02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Problem Set #2\nDue Wednesday, Mar. 4, 2008 by 5 pm\nKeep your answers short and to the point. Please submit homework in the format of the\nsolutions. There should be 2 parts 1) The write up your answers including relevant parts\nof the log file, 2) The final, working version of your do file (one comprehensive\nprogram).\n1. Estimating the Returns to Schooling: the INPRES School Construction Program\nin Indonesia\nThis problem will lead you through the instrumental variables techniques introduced\nin lecture to estimate the returns to schooling (in particular, the effect of years of\neducation on log hourly wages). This exercise uses the Stata data set named\nsupa.dta, which is a subset of the data used by Professor Duflo in her paper listed in\nthe syllabus, \"Schooling and labor market consequences of school construction in\nIndonesia: Evidence from an unusual policy experiment.\" Because this data set is\n2.5Mb while the Stata default memory setting is 1Mb, begin your Stata session by\ntyping \"set mem 20m\"; you will also need to type the command \"set matsize 800\").\nSpend some time understanding the notation and data well, and the methods are\nexplained step by step.\na. Recall the wage-setting equation from the education model discussed in class:\nln wi = ai + bSi\nInterpret the parameter b in this equation. Why might the coefficient on an OLS\nregression of log wages on years of schooling not be a good estimate of b?\nIn the remainder of this problem, you will be asked to use a number of\ninstrumental variable techniques to try to get an unbiased estimate of b. We want\nto estimate the effect of years of schooling on log wages, but years of schooling is\nan endogenous variable (we call this the \"endogenous regressor\"). The idea\nbehind instrumental variables is to use other variables, called instruments, which\ngenerate exogenous variation in years of schooling. In this problem, we can\nexploit the exogenous variation in years of schooling generated by the INPRES\nprogram.\nb. Wald Estimate\ni.\nFirst, calculate the difference-in-differences (DD) estimate of the effect of\nINPRES on years of schooling; this is the first stage. Use cross-cohort\n(young versus old) and cross-regional (high-intensity versus low-intensity)\nvariation. Interpret the estimate. Under what assumption is this an unbiased\nestimate of the effect of INPRES on education?\nii.\nNext, calculate the DD estimate of the effect of INPRES on log hourly\nwages, using the same sources of variation as in (i); this is the reduced form.\nInterpret the estimate. Under what assumption is this an unbiased estimate of\n\nthe effect of INPRES on wages? How might we test this assumption, given the\navailable data?\niii.\nThe Wald estimate for b in the wage-setting equation is the DD estimate\nfrom the reduced form divided by the DD estimate from the first stage. What\nis the additional assumption for unbiasedness of the Wald estimate? How\nmight we test this assumption, given the available data?\niv.\nCalculate and interpret the Wald estimate of the returns to schooling.\nc. Indirect least squares (ILS)\nIn (b), we used only some of the available variation in the INPRES program (in\nparticular, we used only 2 age and 2 regional groups). Now we will use all of the\nregional variation. Before, you were calculating means for high- and low-\nintensity regions, young vs. old; in this question, you are calculating means for the\nyoung and old, region-by-region.\nFirst, generate a new data set that contains the mean schooling of the young, mean\nschooling of the old, mean wage of the young, mean wage of the old, mean\nnumber of children in 1971, and mean program intensity, by region. (Hint: Your\nfirst line of Stata code should say something like generate educ_yng = yeduc if\nyoung == 1. Then, use the collapse command .)\nNext, generate a variable called educ_dif which equals young mean education\nminus old mean education. Likewise, generate a variable called wage_dif which\nequals young mean log wage minus old mean log wage.\ni.\nThe first stage is: SYj - SOj = αPj + vj (where S denotes years of\nschooling; P denotes program intensity; Y and O index young and old; and j\nindexes the region). The equation is written as though the only right-hand\nside variable is program intensity; however, the vj term can be understood to\ninclude the error term, the constant term, and any control variables (i.e., other\nright-hand-side variables). Note that the left-hand side of the equation is just\neduc_dif. Estimate α by regressing educ_dif on program intensity, including\nthe number of children in 1971 as a control variable; report the estimate.\nii.\nThe reduced form is given by equation (2): yYj - yOj = γPj + εj (where y\ndenotes log hourly wage). Note that the left-hand side of the equation is just\nwage_dif. Estimate γ by regressing wage_dif on program intensity, including\nthe number of children in 1971 as a control variable; report the estimate.\niii.\nRecall the wage-setting equation yi = ai + bSi , where y is log hourly wage.\nTaking means by region and cohort, we have that yYj = aYj + bSYj and yOj = aOj\n+ bSOj. Subtracting the latter from the former, we get yYj - yOj = aYj - aOj +\nb( SYj - SOj ). Use this equation, along with the first-stage and reduced-form\nequations, to argue algebraically that b = γ/α .\niv.\nCalculate the indirect least squares estimate of b in this way, report and\ninterpret this estimate. How does it compare to the Wald estimate? Which do\nyou prefer? Explain.\nv.\nIndirect Least Squares uses the program as an instrument to generate\nexogenous variation in years of schooling. Essentially, it predicts years of\nschooling based on the exposure to the program; it then estimates returns to\nschooling using only the variation in predicted schooling. Now let's use a\n\nsecond technique to estimate the return to schooling using Indirect Least\nSquares. Run the first stage regression from part (i) above and use the predict\ncommand to save predicted values of the variable educ_dif as a new variable\nthat you can call edif_pred. Next, run a regression of wage_dif on the\npredicted values edif_pred, again including the control for number of\nchildren in 1971. Report your new estimate of b and check to make sure the\ncoefficient on the predicted values edif_pred is indeed the same as what you\ncalculated in part (iv)?\nd. Two-stage least squares (2SLS)\nIn (c), we did not use fully the variation by cohort; instead, we aggregated cohorts\ninto two groups, young and old. Now we will use all of the cohort variation as\nwell. In (c) you modified the data set; for this part, return to using the original\ndata set.\nNote that we could repeat the indirect least squares exercise cohort-by-cohort; that\nis, for each cohort k ( = year of birth), we could run the regressions:\nSkj - S50j = αkPj + vkj and\nykj - y50j = γkPj + εkj ,\nwhere 50 is the oldest cohort (year of birth = 1950), and j indexes the region.\ni.\nYou are not being asked to run the above regressions. However, if you\nwere to run those regressions, how would you interpret the estimates for αk\nand γk?\n2SLS combines these different ways of estimating b in an optimal fashion (in the\nsense of minimizing the variance of the estimator). Like all instrumental variable\nestimators, 2SLS uses a set of variables, called instruments, to generate\nexogenous variation in the endogenous regressor. In our case, years of schooling\nis the endogenous regressor, so we use \"exposure to the INPRES program\" as\ninstruments that will generate exogenous variation in years of schooling.\nThis data set has individuals who were age 2 to 24 in 1974; those who were age 2\nto 12 in 1974 (i.e., yob between 1962 and 1972) are young enough to have been\nexposed to the program. Hence, we have 11 instruments available (1 program *\n11 cohorts).\nii.\nFor each cohort exposed to the program, generate a dummy variable equal\nto 1 if the individual was born in that year and 0 otherwise (e.g., generate d62\n= (yob==62) , etc., up to d72 ). Now, for each exposed cohort, generate a\nvariable that equals the cohort dummy multiplied by program intensity (e.g.,\ngenerate z62 = d62*prog_int , etc., up to z72 ). These eleven variables (z62\nthrough z72) are the 11 instruments. State clearly the requirements for these\nto be good instruments? Explain briefly why you might think that these\nvariables satisfy those two requirements.\n\nFor control variables in our regressions, we will use number of children in\n1971, year-of-birth dummies, and year-of-birth dummies interacted with\nnumber of children in 1971 (\"interacted with\" means \"multiplied by\"). Year-\nof-birth dummies mean dummy variables, one for each possible year of birth,\nwhich take the value 1 if the individual is born in that year, and 0 otherwise.\nAs you might have noticed, these are a lot of control variables (1 variable for\nnumber of children + 23 year-of-birth dummies + 23 interaction terms = 47\ncontrol variables!). Fortunately, Stata makes it easy to handle dummies and\ninteraction terms based on an existing variable (in this case, year of birth yob).\nWithin a Stata command, you can use the formulation i.variable to refer to a\nset of dummy variables based on the values taken by the variable named\nvariable; you can use the formulation i.variable1*variable2 to refer to the\nthe set of dummy variables based on variable, the variable variable2, and the\ninteraction terms between the two. When using the i. formulation in a\ncommand, you must precede the command with xi: . Thus, to regress the\nvariable y on x, number of children in 1971, year-of-birth dummies, and year-\nof-birth dummies interacted with number of children, you would use the\ncommand\nxi: regress y x i.YOB*ch71\niii.\nTo calculate the 2SLS estimate of b,\n1. First, use the instruments and control variables to predict years of\neducation (i.e., run an OLS regression of years of education on the\ninstruments and control variables, and form the predicted values of\neducation from this regression).\n2. Regress log hourly wages on this predicted value of years of education and\nthe control variables. The coefficient on the predicted years of education\nis the 2SLS estimate of b.\nCompute and interpret the 2SLS estimate of b.\n3. Can we trust this 2SLS estimate if the INPRES program improves school\nquality? Why or why not?\n2. Essay Question\nRead the paper \"Peer Effects, Pupil-Teacher Ratios, and Teacher Incentives: Evidence\nfrom a Randomized Evaluation in Kenya\" by Duflo, Dupas, and Kremer, which has been\nposted to the course website under \"Problem Set 2\".\n- Succinctly but clearly describe the experimental design. What were the different\ntreatments offered?\n- Outline the specific questions/hypotheses that the paper tests. To guide yourself,\nlook through Figures 4, 5, 6, and Tables 3, 4, 5, 6, 7, 8, and identify the\nhypothesis that the reported results are testing. State the hypotheses as questions.\nIt is okay to bullet your response to this section. For example, I would begin with\nthese questions from Table 3:\no Does reducing class size via the Extra Teacher Program (ETP) improve\nteacher attendance/effort? (Table 3)\no Does tracking students improve teacher attendance/effort? (Table 3)\no Do contract teachers in tracking schools have higher attendance/effort than\nnon-contract teachers? (Table 3)\n\no etc.\nThen, after reading the paper on tracking, read the paper \"Many Children Left Behind:\nTextbooks and Test Scores in Kenya\" by Glewwe, Kremer, and Moulin, which has also\nbeen posted to the course website under Problem Set 2.\n- Briefly summarize the experimental design.\n- Think about how you could modify the experimental design to answer more\nquestions than those addressed directly in the paper. Keep the experiment related\nto textbook use, but think of other questions you may have about textbooks, or\nother programs that might interact with the effectiveness of textbooks. For\nexample: what types of textbooks are effective? who benefits from textbooks?\nhow should textbooks be distributed? what secondary programs may increase the\nefficacy of textbooks? etc. Be specific about what additional hypotheses you\nwould like to test, beyond those covered in the paper.\n- What control and treatment groups would you need to test your new hypotheses?\nWhat data would you like to collect? What comparisons would you make in your\ndata?"
    },
    {
      "category": "Assignment",
      "title": "Problem Set #3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/3519b87493b7e0c5629fa38314aa5b7e_MIT14_74s09_pset03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Problem Set #3\nDue Friday, March 13, 2009\nFeel free to work in groups. But please hand in individual problem sets. Keep your answers clear\nand concise.\n1) Worms in Kenya. The dataset, ted_miguel_worms.dta is from Ted Miguel's (UC Berkeley) and\nMichael Kremer's (Harvard) de-worming project in Kenya. Please read the paper to familiarize\nyourself with the experiment before answering this question. You can find the paper on the\ncourse website under Assignment #3.\nMiguel and Kremer randomize over schools (not individuals) and to introduce de-worming\ndrugs to randomly selected treatment group to estimate the effect of deworming on school\nattendance.\na. First, why randomize at the school level? Think what issues might arise in your\nevaluation if you randomize at the individual level.\nb. Suppose you had pre- and post- treatment attendance records for all schools, describe\nthe calculations/comparisons you do in order to estimate the effect of deworming on\nschool attendance (in words and with a DD grid). Why might you prefer this DD\nestimate to a straightforward OLS estimate using only post-treatment data (i.e. mean\nattendance in program schools minus mean attendance in non-program schools after the\nprogram)?\nc. Write down the regression you want to run in to estimate the DD you described in part\n(b)? Explain the meaning of the interaction term.\nNow look at the data set. As before, you are only required to hand in your documented .do files\nalong with the answers. You can also include relevant parts of your .log file.\ntotpar98 is school participation in 1998, during the first year of\ntreatment (they do not have good pre-treatment data - it is from attendance\nregisters only).\npill98 is a dummy variable for whether or not the student took a pill.\ninfect_early99 is the health outcome in early 1999 when only Group 1\nschools have received deworming (Group 2 schools got them right after this\ndata was collected)\nUse the describe command to see the meaning of other variables. The authors have pre\ntreatment health, but only for the Group 1 kids - since it was considered unethical to get health\ninformation for control group kids -and thus this data cannot be used in regressions. So we\ncannot run the DD proposed above\n\nd. How many observations are there per pupil? What percentage of the pupils are boys?\nWhat percentage of pupils took the deworming pill in 98 and 99? What percentage of\nschools was assigned deworming in 98? Is this more or less than the percentage of pupils\nwho actually took the pill in 98?\ne. What does the mean of a dummy variable tell us? Give one example from the dataset.\nWhat are two advantages of using dummy variables?\nf. Using the data, find the difference in outcomes (Y: school participation) between.\ni. Students that took the pill and students which did not in 1998.\nE(Y|X=1)-E(Y|X=0)\nIs this a good estimate of the effect of taking the pill on school attendance?\nii. Students in treatment schools versus students not in treatment schools in 1998\n(regardless of whether they actually took the pill).\nE(Y|Z=1)-E(Y|Z=0)\ng. Using the data, calculate the difference in the probability of taking the pill given that a\nstudent was in a treatment school and the probability of taking it if a student was not in a\ntreatment school.\nE(X|Z=1)-E(X|Z=0)\nh. Derive the Wald Estimator and Explain the meaning of this result. What is the\nadvantage of the Wald Estimator over what calculated in f(i)\n2) Economist Jeffrey Sachs does a cross-country regression by regressing economic growth on the\nincidence of malaria while controlling for education, income level, macroeconomic policy, etc.\nHe finds that countries with malaria grow more slowly.\na. Is this a causal relationship? Why or Why not? (Give an alternative interpretation to his\nregression results.)\nb. Generally speaking, what do the coefficients of the right hand side controls tell us? It will\nhelp to write down the regression equation. Do you think the control variables resolve\njoint determination problems? Explain briefly.\nc. Let's assume that education jointly determines income and malaria incidence and\neconomic growth. In this case, what does the coefficient of education tell us? Would this\ncause us to over or underestimate the true relationship between malaria on income? Why?\n(hint: think of possible ways education jointly increases/decreases income and malaria).\nNext, assume that education decreases malaria and increases income. Explain how/why\nthe regression might overestimate the effect of malaria on income."
    },
    {
      "category": "Assignment",
      "title": "Problem Set #4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/9258638833bb7c4df744e6cb93aa7bc3_MIT14_74s09_pset04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Problem Set #4\nDue Friday, April 24, 1pm\nNo late problem sets will be accepted\n1. Sharecropping (Explanations of results should not exceed one or two sentences. When\nasked to solve, please write the steps and the equations clearly and explain what they\nmean). Consider the following setting\n- Tenant farms the land and applies effort, e\n- Tenant's outside option is 0, and tenant has wealth w\n- The landlord cannot observe e\n- Both the tenant and the landlord are risk-neutral\n- Effort is costly, the cost of effort is .5ce2\n- Two things can happen:\no With probability e: Output is H\no With probability 1-e: Output is 0 (zero)\n- The tenant and the landlord write a contract which specifies a payment from the landlord\nto the tenant\no Payment of h if output is H\no Payment of l if output is 0\n- Tenant and landlord maximize their expected utility, which is equal to expected income\nfor the landlord, and expected income minus cost of effort for the tenant.\n1) What do l and h look like in a sharecropping contract? In a rental contract? (Give the\ngeneral form of l and h).\n2) Optimal effort (first best):\na) What problem do you need to solve to determine the optimal level of effort (the\none that would be chosen if there were no contractual difficulties)?\nb) Solve the problem: what is eFB, the first best level of effort?\n3) Tenant's choice of effort\na) Given a contract that specifies h and l, what is the tenant's effort? (Set up the\ntenant's utility maximization problem and solve the first order conditions).\nb) What class of contract will lead the tenant to choose the FB level of effort, eFB?\n4) Optimal Contract without limited liability\na) Assume there is no limited liability. The landlord maximizes his income. What\ncontract will the landlord propose to the tenant? Calculate the rent that the\nlandlord charges\nb) What is the tenant's utility under this contract?\n5) Optimal contract with limited liability - the landlord cannot take more than the\ntenant's wealth (l>= -w)\na) Is the tenant's problem and effort choice given h and l changed?\nb) What is l chosen by the landlord?\nc) How does the landlord choose h? What condition on H, C, w is needed such that\nthe tenant is willing to participate in this contract (remember that we assume in\n(b) the limited liability constraint binds, solve and plug the solution into the other\nconstraint to find the condition for this constraint to be satisfied).\nd) What is the tenant's effort under this contract? (eLL: effort under limited liability)?\nHow does it compare to eFB and why?\n14.74 Problem Set #7, p. 1\n\ne) What is the tenant's utility under this contract? How does it compare to the utility\nunder a rental contract?\nf) Now think of a market with many tenants and landlords. Suppose different plots\nof land have different fertility levels and therefore H varies (and has a distribution\nG(H)). Each landlord has 1 plot of land and all plots of land are the same size.\nLet there be a large number of potential tenants whose w varies (distribution\nF(w)) and there be more potential tenants than there are plots of land, so that some\ntenants will earn their outside option of 0. The allocation of tenants to landlords\nis generated by a competitive market where landlords compete for the tenants they\nlike the best. What would the matching look like in equilibrium, i.e. landlords\nwith low (high) H are matched with which kind of tenants? No need for closed\nform solutions here, but justify your arguments.\n2. Land Size and Distribution of Labor\nThis is from Debraj Ray, Development Economics, p. 478, Question 1.\nText removed due to copyright restrictions.\n3. Savings: Evidence from Thailand\nPaxson (1992), in her article entitled \"Using Weather Variability to Estimate the Response of\nSavings to Transitory Income in Thailand\" (which is in the course reader), attempts to\nestimate the marginal propensity to save out of transitory income. She states that \"a finding\nthat these marginal propensities are high would indicate that farmers do use savings to\nsmooth consumption\" (p. 15).\nRead the article, since you will need to refer to specific tables in the article to complete the\nfollowing empirical exercise. This exercise uses the data set paxson.dta. At the beginning of\n14.74 Problem Set #7, p. 2\n\nyour Stata session, type \"set memory 20m\" and also \"set matsize 200\" because you will\nbe using more memory and variables than the default setting.\na. What is the problem with measuring the marginal propensity to save out of total income\nby regressing savings on total income?\nb. Paxson only has data on total income (inc). She wants to decompose it into a permanent\nincome component (call it incperm) and a transitory income component (call it\ninctrans). In this part, you will replicate the results in Table 3 and obtain estimates of\nincperm and inctemp.\ni. Run the regression that Paxson ran in Table 3, Column 1 (the income equation).\nInclude all the variables you see in the table, as well as the region dummies\nmentioned in the footnote. (When I do this, I get numerically identical estimates as\nPaxson.) This part is not hard, but it gets tedious because of all the variables that\nmust be included. Note you will have to form dummy variables for year and region.)\nii. Using the coefficients estimated in (i), Paxson constructs a predicted value for\npermanent income as follows. She multiplies the permanent characteristics by their\nrespective coefficients from (i), and adds it all up to form incperm (see equation 2).\n[Stata hint: Suppose in (i), I just ran \"reg inc x z\" where x is a permanent\ncharacteristic and z is a transitory characteristic. Then I would form incperm by\ntyping: \"gen incperm = _b[x]*x\". So note the syntax: the \"_b[x]\" refers to the\ncoefficient estimated for the independent variable, and you ask Stata to multiply it by\nx in order to form the predicted value of permanent income.] Generate the variable\nincperm. What is the mean of incperm?\niii. Paxson obtains a predicted value for transitory income in a similar way. She\nmultiplies the transitory characteristics by their respective coefficients from (i), and\nadds it all up to form inctrans (see equation 3). Which variables from (i) are\nconsidered to be transitory characteristics? Generate the variable inctrans. What is\nthe mean of inctrans?\niv. Paxson also has a category called unexplained income, defined as: inc - incperm -\ninctrans. Form this variable, and call it incunexp. What is the mean of incunexp?\nv. Now you are ready to estimate the effect of income on savings. Run the regression\nthat Paxson ran in Table 4, Column 2 (using save2 as the savings measure). Include\nall the variables you see in the table, as well as the year dummies mentioned in the\nfootnote. (When I do this, I get very close to Paxson's results, but not exactly the\nsame. So don't worry if you don't exactly replicate her results.) Paxson interprets\nthe coefficient for inctrans as the marginal propensity to save out of transitory\nincome. Based on your regression results, what is the marginal propensity to save out\nof each dollar of transitory income? Test the null hypothesis that this marginal\npropensity equals one. [Stata hint: Suppose you just ran \"reg save2 inctemp x1\nx2\" and you wanted to test whether the coefficient for inctemp equals zero. You can\njust look at the Stata regression table and see whether the t-statistic is above the\ncritical value, or see whether zero is in the confidence interval, or see whether the p-\nvalue is <= the significance level. Or, you can type \"test inctemp=0\" and the p-\nvalue will be given. Now, for a test of the coefficient for inctemp equal to one, you\ncan either look at the confidence interval or type \"test inctemp=1\".]\n14.74 Problem Set #7, p. 3"
    },
    {
      "category": "Assignment",
      "title": "Problem Set #5 – Models of Insurance and Credit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/e7929f0c22e28be5749906343482320f_MIT14_74s09_pset05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nProblem Set #5 - Models of Insurance and Credit\n14.74\n\nDue by 5 pm on Monday, May 4th\nYou may turn it in during class or to Leila's mail folder on the 3rd floor of E52.\n1. Insurance and Incentives\nConsider a village of a large number of identical farmers. All farmers are owner-\ncultivators; i.e., they own and work their own land. They can choose how much\neffort p to apply to their land, where p is either pL or pH ( pL < pH ). With probability\np their crop is a success, and their output is H; with probability (1-p) their crop is a\nfailure, and their output is L<H. For consumption equal to y, utility over\nconsumption and effort is given by u(y) - C(p). C(p) is the cost of effort; assume that\nC(pL) = 0 and C(pH) = K, a positive constant. Farmers are risk-averse.\na. Assume there is no insurance. What condition must be satisfied for farmers to\nchoose effort level pH? For the remainder of this problem, assume that this\ncondition is satisfied. What is each farmer's expected consumption under this\nchoice of effort? What is their expected utility?\nb. What does risk-aversion imply about the shape of u? Explain why we interpret\nthis condition on u as risk-aversion.\nc. Suppose now that the farmers form a group insurance mechanism. Assume that\neach farmer's effort level is observable to all other farmers. Consider a full\ninsurance mechanism which requires that each farmer choose effort pH, all\nfarmers pool their output, and then each farmer gets an equal, nonrandom share.\ni. Is such a mechanism feasible? Explain why? (Hint: There are two conditions\nthat must be satisfied; all farmers must choose pH and their consumption must\nbe nonrandom).\nii. What is each farmer's expected consumption under this mechanism? How\ndoes this compare with expected consumption in (a)?\niii. What is each farmer's expected utility under this mechanism? How does this\ncompare with the expected utility in (a)?\niv. Explain the reason for the difference in your answers to parts (ii) and (iii).\nd. Now suppose that each farmer's choice of effort level is unobservable. Is the\nmechanism in part (c) still feasible? Why or why not?\ne. We continue to assume that each farmer's choice of effort level is unobservable.\nWe will now solve for the optimal, feasible insurance mechanism. Consider the\nfollowing mechanism: After output is produced, all farmers pool their output. If a\nfarmer's output was H, he gets to consume h; if his output was L, he gets to\nconsume l. In the case of full insurance, h=l.\ni. What \"budget constraint\" must be satisfied to ensure that the total insurance\npayments made equals the total amount taken in?\nii. What condition must be satisfied to ensure that all farmers choose pH? Does\nthis condition hold in the case of full insurance, and why?\niii. What is each farmer's expected consumption from this insurance mechanism?\n\niv. Argue from (i)-(iii) that L<l<h<H . Argue also that expected utility under\nthis mechanism is greater than expected utility under no insurance (i.e., part\n(a)) but lower than expected utility under full insurance (i.e., part (c)).\nf. Suppose L=1 (i.e., the number one, not lower-case \"L\") and u(y) = ln(y).\ni. Calculate the optimal h and l based on part (e).\nii. Show that farmers face less variation in consumption than in the no insurance\ncase, but more variation than in the full insurance case (for this, show\nalgebraically that the amount l > 1 (one) and h < H).\n2. Credit as Insurance\nRead the following article in your syllabus (this article is posted on course website):\nChristopher Udry (1990), \"Credit Markets in Northern Nigeria: Credit as Insurance in\na Rural Economy,\" World Bank Economic Review 4(3), 251-269.\nFor each part below, please limit your response to about one paragraph (the entire\nquestion should take about a page). Do not summarize the article; please answer\nspecifically and precisely the questions asked.\na. In the Nigerian villages that Udry studies, there is active borrowing and lending\nwithin villages and within kinship groups. How does Udry demonstrate that there\nare risk-sharing arrangements between borrowers and lenders? Please refer to\nspecific results in tables to support your answer.\nb. Someone might argue that Udry's empirical results are due to limited liability\n(which leads to sharecropping arrangements between borrowers and lenders). In\nwhat way would this person be right? Why can't this person's explanation fully\naccount for Udry's empirical results? Please refer to specific results in the tables\nto support your answer.\nc. Relate Udry's findings to lecture regarding the difficulty of enforcement: how can\nUdry's findings explain why it is often not economically feasible for formal\ninstitutions to lend to, or provide insurance for, poor, rural households? Even\nthough informal insurance mechanisms may exist and operate well, what is a\nlimitation that they have which formal institutions could improve upon?"
    },
    {
      "category": "Resource",
      "title": "Case- Using Evaluations to Diagnose the Problem and  Design Policy Solutions: Health and Healthcare in Rajasthan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/0368ab57cd29b64b1e2b6423e05ae6f1_MIT14_74s09_lec09.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nCase- Using Evaluations to\nDiagnose the Problem and\nDesign Policy Solutions: Health\nand Healthcare in Rajasthan\nThis case study describes how data gathering and data analysis, combined with the\nuse of randomized trials, can be used to identify critical problems and evaluate\nwhich solutions are effective. It highlights a joint enterprise on healthcare in rural\nRajasthan among Seva Mandir, an NGO active in the area, Vidhya Bhavan, a\nconsortium of schools and colleges in Udaipur, and a group of researchers.\nThis case study, with the kind permission of the authors, is based on \"Health and health care in\nRajasthan: Identifying Problems, Designing Solutions,\" by Abhijit Banerjee and Esther Duflo (Abdul\nLatif Jameel Poverty Action Lab working paper, 2004).\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n1. Introduction\nThe 2004 World Bank Development Report opens with the statement \"social services fail\nthe poor.\" There are few contexts where this failure is more apparent than in the Indian\nhealthcare system. Especially in rural areas, public healthcare often seems to be on the\nverge of collapse and the poor, like everyone else, have opted for private healthcare\nwhich is largely unregulated and of dubious quality. The recent launching of the National\nRural Health Mission (NRHM) reflects the widely held view that the Indian government\nneeds to do more about healthcare.\nUnder the NRHM, public spending on healthcare will go up from 0.9 percent of GDP to\ntwo percent or more. How are we to make sure that this extra money is well spent? How\ndo we identify the most important healthcare problems, and design effective policies to\nsolve these problems?\nThis case study describes how data gathering and data analysis, combined with the use of\nrandomized trials, can be used to identify critical problems and evaluate which solutions\nare effective. It highlights a joint enterprise in rural Rajasthan among Seva Mandir, an\nNGO active in the area, Vidhya Bhavan, a consortium of schools and colleges in Udaipur,\nand a group of researchers.\n2. The Udaipur Rural Health Survey\nSeva Mandir is a very well established NGO that has operated for over 50 years in\nUdaipur district, Rajasthan, and works in several areas: education, environment,\nmicrofinance, and health. Its health unit had traditionally organized health camps in\nvillages, trained traditional birth attendants and paid them to perform deliveries. It also\ntrained village health workers to provide health advice and some basic healthcare to the\nvillagers. However, by 2001, the organization was increasingly frustrated with the impact\nits work in health was having. Many felt that while working hard, the unit was merely\nscratching the surface of the problem and that it was necessary to completely re-think\npriorities, interact more closely with the government, and find a way of piloting\nsuccessful, replicable models that could inspire other NGOs or the government.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nSeva Mandir approached MIT Professor Abhijit Banerjee, who felt that too little was\nknown about the situation for him to make any reasonable recommendation. It was\ndecided to start by collecting a rich data set on healthcare and healthcare behavior in the\nSeva Mandir work area, as a way to identify the problems and think about possible\nsolutions. The proposed solutions would then be implemented in a limited number of\nSeva Mandir's villages as a pilot and their impact would be evaluated. The successful\nsolutions would then be scaled up. Vidhya Bhavan, a consortium of schools, teaching\ncolleges, and agricultural colleges in Udaipur agreed to host and supervise the survey\nteam. Professors Abhijit Banerjee, Angus Deaton, and Esther Duflo led the research\neffort.\nThe data collection occurred between January 2002 and August 2003 in 100 hamlets in\nUdaipur district, Rajasthan. Udaipur is one of India's poorest districts, with a large tribal\npopulation and an unusually high level of female illiteracy. The sample frame consisted\nof all the hamlets in the 362 villages where Seva Mandir operates in at least one hamlet.1\nSeva Mandir's relation with the villages and the health authorities ensured participation\nin the survey, and allowed collection of very detailed information at the village and\nhousehold level.\nThe data collection had four components: (1) A village survey done in 100 villages, which\nyielded a village census, a description of the village's physical infrastructure, and a list of\nhealth facilities commonly used by villagers; (2) A survey of over 1,000 households\nwhich provided detailed health and economic information about the households,\nincluding health and fertility histories, reports of experiences with the health system\n(public and private), as well as a small array of direct measures of health (hemoglobin,\nbody temperature, blood pressure, weight and height, and a peak flow meter\nmeasurement of lung capacity); (3) A facility survey, aimed at obtaining detailed\ninformation on the nature of health facilities in the area (including types of treatment\n1 A hamlet is a set of houses that are close together and share a community center, and constitutes a\nseparate entity. A village is an administrative boundary. One to 15 hamlets constitute a village (the mean\nnumber of hamlets in a village is 5.6). Seva Mandir in general operates in the poorest hamlets within a\ngiven village. In this project, the researchers exploited the extensive network of Seva Mandir's employees\nin the district to hire 130 reliable employees. The sample was stratified according to access to a road (out of\nthe 100 hamlets, 50 hamlets are at least 500 meters away from a road). Hamlets within each stratum were\nselected randomly, with a probability of being selected proportional to the hamlet population.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nand how much they cost, as well as quality of the infrastructure), that reached all the 143\npublic facilities serving the sample villages along with the \"modern\" private facilities\nmentioned in the village surveys or in the household interviews (a total of 451), and a\nsample of 98 bhopas (traditional healers); (4) A continuous facility survey which\ninvolved a random, timed weekly visit to all public facilities serving the villages (143\nfacilities in total, with 49 visits per facility on average) during hours of operation to check\nwhether the facility was open, and count the number of doctors, nurses, other medical\nand non-medical personnel, and clients present in the facility (if the facility was closed\nbecause the staff was supposedly performing a scheduled village visit, the para-worker\nwent to the village that the staff was supposed to be visiting, and checked whether the\nstaff was there).2\n3. Findings: Health Status\nSurveyed households in Udaipur are poor, even by the standards of rural Rajasthan.\nTheir average per capita household expenditure (PCE) is 470 rupees, and more than 40\npercent of the households fall below the official poverty line, compared with only 13\npercent in rural Rajasthan in the latest official counts for 1999-2000. Only 46 percent of\nadult (14 and older) males and 11 percent of adult females report themselves literate.\nOnly 21 percent of households have electricity. In terms of measures of health using a\nstandard cutoff for anemia (11 g/dl for women, and 13 g/dl for men), men are almost as\nlikely (51 percent) to be anemic as women (56 percent) and older women are not less\nanemic than younger ones, suggesting that diet is a key factor. Moreover, five percent of\nadult women and one percent of adult men have hemoglobin levels below eight grams\n2 To ensure the quality of the data collected in the Continuous Facility Survey, a strictly enforced\nmonitoring system was implemented: every four weeks, all the CFS para-workers of a block met, and their\ndata entry forms were collected. They were also given a schedule indicating on which days they had to\ncomplete their visits. Two members of the team of investigators used motorcycle transport to visit several\nfacilities every day, following the schedules given to the CFS para-workers. The para-workers were paid\nonly if their visits had been completed on the planned day, and only if there were no unexplained\ndiscrepancies between their reports and those of the CFS monitors. The CFS monitors also visited the\nfacilities on different days, so that they could check that there was no collusion between the para-workers\nand the facility staff. This survey took place for 13 to 14 months, including a \"pilot period\" of one to two\nmonths in each facility, during which the system was fine-tuned. We report data for 12 months for each\nfacility. The survey is complemented by a detailed one-time facility survey, which, among other things,\nallows us to identify correlates of absenteeism in the centers.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nper deciliters, which is the standard cut-off for being critically anemic.\nThe average Body Mass Index (BMI) is 17.8 among adult men, and 18.1 among adult\nwomen. Within the population surveyed, 93 percent of adult men and 88 percent of\nadult women have a BMI less than 21, considered to be the cutoff for low nutrition in the\nUS (Fogel, 1997). We also used peak-flow meter measurement to measure lung capacity\nin an attempt to detect asthma or other respiratory disorders such as chronic bronchitis.\nAmong adults, the average peak flow meter measurement is 316 ml per expiration\n(anything below 350 for an adult 1.60 meters tall is considered to be an indicator of\nrespiratory difficulties).\nSymptoms of disease are widespread, and adults report a wide range of symptoms: a\nthird reported experiencing cold symptoms in the past 30 days, and 12 percent said the\ncondition was serious. In adults, 33 percent reported fever (14 percent reported serious\nfever), 42 percent reported \"body ache\" (20 percent reported serious \"body ache\"), 23\npercent reported fatigue (seven percent serious), 14 percent reported problems with\nvision (three percent serious), 42 percent reported headaches (15 percent serious), 33\npercent reported back aches (10 percent serious), 23 percent reported upper abdominal\npain (nine percent serious), 11 percent reported chest pains (four percent serious), and 11\npercent had experienced weight loss (two percent serious). Few people reported\ndifficulties in activities that involved taking care of themselves, such as bathing, dressing,\nor eating, but many reported difficulty with the physical activities that are required to\nearn a living in agriculture. Indeed, 30 percent or more reported having difficulty\nwalking five kilometers, drawing water from a well, or working unaided in the fields. 18\n20 percent had difficulty squatting or standing up from a sitting position.\nTable 1 shows the number of symptoms reported in the 30 days before the survey, BMI,\nfraction of individuals with hemoglobin counts below 12, peak flow meter reading, high\nblood pressure, and low blood pressure, broken down by thirds of distribution of the\nmonthly per capita expenditure. Individuals in the lower third of the per capita\nexpenditure distribution have, on average, a lower BMI, lower lung capacity, and are\nmore likely to have a hemoglobin count below 12 than those in the upper third.\nIndividuals in the upper third report the most symptoms over the last 30 days, perhaps\nbecause they are more aware of their own health status - there is a long tradition in the\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nIndian and developing country literature of better-off people reporting more sickness\n(see, for example, Murray and Chen (1992) and Sen (2002)).\nInterestingly, when asked to report their own health status and shown a ladder with 10\nrungs, 62 percent of individuals placed themselves on rungs five through eight (more is\nbetter), and less than seven percent placed themselves on one of the bottom two rungs.\nHowever, most people report themselves close to the middle and the life-satisfaction\nmeasures don't show any great dissatisfaction with life: on a five point scale, 46 percent\ntake the middle value, and only nine percent say their life makes them generally\nunhappy. Such results are similar to those for rich countries; for example, in the United\nStates more than a half of respondents report themselves as a three (quite happy) on a\nfour-point scale, and 8.5 percent report themselves as unhappy or very unhappy. So,\nthose surveyed are presumably adapted to the sickness that they experience in that they\ndo not see themselves as particularly unhealthy or, in consequence, unhappy.\nNonetheless, they are not completely free of complaints: when asked about their\nfinancial status, which was also self-reported on a 10-rung ladder, the modal response\nwas the bottom rung, and more than 70 percent of people live in households that were\nself-reported as being on the bottom three rungs.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nDiscussion Topic 1: Does health lead to wealth or is it the other way\naround?\nThe high rates of anemia that we see suggest a close relationship between health\nand wealth. Anemia can be caused by nutritional deficits (and is particularly likely in\nthis context, since its not only women in the child-bearing ages who have high rates\nof anemia). In turn, anemia weakens the body and makes people less productive,\nwhich limits their capacity to earn a living. This possibility of a \"nutrition\nproductivity trap\" has been discussed extensively in the economics literature. Our\ndata reveals a strong relationship between self reported health and income, as\nshown in Table 1.\n1. Can we necessarily conclude from this data that poor health causes low\nincomes?\n2. What are possible alternative explanations?\n3. Which are more plausible?\nOne of the interventions that was tried in Udaipur was to work with local Chakkiwalis\n(flour-making units) in 60 villages with the goal of training them to fortify villagers'\nflour with an iron premix distributed by Seva Mandir. Iron helps reduce anemia.\nThese 60 villages were randomly selected among the villages in the study.\n4. How can we use this set up to answer the question of whether high\nanemia causes low income?\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n4. Findings: Healthcare Facilities\nTypes of facilities\nThere are three broad categories of facilities: public, private and traditional. The official\npolicy on public facilities requires that there be one sub-center (or sometimes an aid-\npost) staffed by one trained nurse (ANM) for every 3,000 individuals. These sub-centers\nprovide the first point of care, the Public Health Centers (PHCs) or Community Health\nCenters (CHCs) provide the next step, and the referral hospitals deal with the most\nserious health problems. In the data from Udaipur, we found that each sub-center serves\non average 3,600 individuals and is usually staffed by one nurse. Almost no sub-centers\nreport vacancies. A primary health center serves 48,000 individuals and has on average\n5.8 medical personnel appointed, including 1.5 doctors. Very few of the PHCs report\nvacancies.\nThe list of private facilities includes every place that our respondents describe as a\nprivate facility that they have visited. These include a wide range of options, from\nfacilities run by people who have completed their medical training and have additional\npost-graduate medical degrees, to traditional birth attendants (TBAs/\"Daimas\") and\npharmacists, who in most cases have no formal medical training whatsoever.\nWithin traditional healers there are two main categories: Out of the 98 we have in our\nsample, 63 are jhad-fook practitioners who focus mainly on exorcisms and prayers, 5 just\ndo desi ilaaj (they give traditional, usually herbal, medicines) and the rest do both.\nProviders in the public facilities are required to have certain qualifications and these\nrequirements are usually respected. The ANM in a sub-center is someone who has at\nleast a high-school degree and has then undergone training (in Rajasthan the training\nlasts a year and a half). He/she is trained to handle a limited set of heath conditions and\nto identify a wider set, which get referred to the PHC/CHC or to the referral hospital. The\ndoctors in the PHCs/CHCs are fully qualified to practice as general practitioners and\nmight have some specialized degrees (87 percent of the CHCs and 13 percent of the PHCs\nhave one or more specialist).\nBy contrast, many private doctors are not formally qualified to practice medicine. Table\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n2a reports that 27 percent of the private doctors who are described as the main provider\nin their facility claim to have some kind of specialist degree over and above the standard\nmedical college degrees. Another 28 percent self-report a medical college degree, though\nthis includes a sizeable fraction who have degrees in Ayurvedic (traditional Hindu)\nmedicine (BAMS) or Unani (traditional Islamic) medicine (only 10.7 percent have an\nMBBS, i.e., are qualified in conventional modern medicine). The rest do not claim\nmedical college degrees. They may, however, be trained as compounders (the Indian\nequivalent of what are known as pharmacists in the United States) or have attended\nsome course that gives them some medical training. In the local parlance these doctors\nare referred to as Bengali doctors. Among the staff that are not the \"main providers\" at\nthe facility (most of them also see patients), 67.2 percent have no formal qualifications,\nand less than three percent are qualified as MBBS.\nAbout 36 percent of the private doctors do not have a college degree in any subject (Table\n2b). Among them the average years of schooling is 11 years, which is a year less than\nwhat it takes to graduate from schooling. The education level among the nurses and\ncompounders/pharmacists is very similar.\nTable 2a shows that traditional healers do not claim to have any formal medical training.\nThey are also less educated than the private doctors, with an average schooling level of\nbetween four and five years.\nHow far are the facilities from the population?\nThe mean distance to the closest public facility is 2.09 km, and the mean distance to the\nclosest PHC/CHC is 6.7 km. The mean distance to the closest private provider that\nanyone in our sample has reported using is 3.78 km. The mean distance to the closest\nself-described qualified private doctor (once again that anyone has reported using) is\n8.01 km. Traditional healers are much closer. The closest traditional healer in our\nsample is 1.53 km away, and this probably understates how close they are since we only\nhave a sample of the traditional healers.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nHow much does treatment cost?\nThe services of the government doctors are supposed to be free, though everyone who is\nabove the poverty line is required to pay for medicines, tests, etc. Nevertheless, visits to\nsub-centers are cheap: Table 3 reports that the average visit to a sub-center/ aid-post\nonly costs Rs. 33, whereas visiting a Bengali doctor costs Rs. 105, on average. The\naverage cost of visiting a PHC/CHC is Rs. 138 (only Rs. 100 if we leave out operations\nand tests), while visiting a qualified private doctor costs Rs. 179 (not including\noperations and tests).3 Surprisingly, visiting a traditional healer is also quite expensive-\nthe average visit costs Rs. 131 (typically because you have to bring a chicken or a goat).\nEquipment and infrastructure\nEvery public health facility has syringes and needles, but beyond that equipment\navailability is patchy. About 20 percent of the aid-posts and one-third of the sub-centers\nlack a stethoscope, a blood pressure instrument, a thermometer, or a weighing scale, and\nonly one quarter of the sub-centers have a sterilizer. Since every facility is supposed to\nhave at least one of each of these pieces of equipment, there is some concern that the\npractitioners might have \"privatized\" the equipment that was provided to them.\nThe quality of the infrastructure is also unimpressive: none of the sub-centers has a\nwater supply, only seven percent have a toilet for patients and only eight percent have\nelectricity. It is therefore not surprising that only three percent of rooms have fans,\ndespite the 50 plus degrees Centigrade summer weather. Finally, 45 percent of the rooms\nleak when it rains.\nUnfortunately, there is no comparable data on private facilities. Casual observation\nsuggests that the infrastructure is not much better there than in other facilities, but\nalmost all of them seem to have a stethoscope and a thermometer (this is part of what\nmakes private facility doctors credible).\n3 In a previous paper we had said that visits to public and private facilities cost more or less the same. The\ndifference comes from a relatively small number of operations/tests in public facilities which are very\nexpensive. Our interpretation is that these procedures are inherently expensive and the government facility\nmay well be the least expensive and perhaps the only place to get them done.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nAre the government facilities actually running?\nPublic sub-centers and Primary Health Centers are supposed to be open six days a week,\nsix hours a day. In the Udaipur survey, public health facilities were surveyed weekly, and\nwe have on average 49 observations per facility. Table 7 summarizes the main result -\nthings are not working the way they are supposed to be. On average, 45 percent of the\nmedical personnel are absent in sub-centers and aid-posts, and 36 percent are absent in\nthe (larger) Primary Health Centers and Community Health Centers. High absence rates\nare not due to staff outreach activities since, whenever the nurse was absent from a sub-\ncenter, we made sure to look for him/her in the community. Since sub-centers are often\nstaffed by a single nurse, this high absenteeism means that these facilities are often\nclosed: we found the sub-centers closed 56 percent of the time during regular operating\nhours. Only in 12 percent of the cases was the nurse to be found in the area of his/her\nsub-center.\nTable 8 reports results on the kinds of facilities we are most likely to find closed. The six\npercent of sub-centers that are far from the road have, on average, only 38 percent of\ntheir personnel present, compared to the 55 percent general average. Facilities that are\ncloser to Udaipur or to another town do not have lower absenteeism. The available\namenities (water and electricity) do not seem to have a large impact on absenteeism,\nalthough the presence of living quarters does have a large impact on the fraction of\npersonnel present, particularly in sub-centers. Reservations of the position of\nchairperson (Sarpanch) of the panchayat to a woman have no impact on sub-centers, but\nseem to be associated with increased personnel presence in PHCs.\nThe weekly survey makes it possible to assess whether there is any predictability in the\nfraction of staff present at a center or sub-center. In other words, we can ask whether\nthere is a specific time of the day or day of the week when a sub-center, for example, is\nvery likely to be open. The answer turns out to be no. Public facilities are thus open\ninfrequently and unpredictably, leaving people to guess whether it is worth their while to\nwalk for over half an hour to cover the 2.09 km that separate the average village in our\nsample from the closest public health facility.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n5. Patterns of Healthcare Use\nHow frequent are healthcare visits?\nTable 4 shows that adults visit a health facility, on average, 0.51 times a month. The\npoor, defined here as people who are in households in the bottom third of the\ndistribution of PCE (average expenditure of Rs. 219 per month), visit a facility 0.43 times\na month, while an adult in the middle third of the distribution (average PCE of Rs. 361)\nvisits a facility 0.54 times a month and an adult in the highest group (average PCE of Rs.\n770) visits a facility 0.55 times a month.\nDeterminants of healthcare visits\nEach adult interviewee was also asked what symptoms of ill health he/she had in the past\nmonth and what he/she did to deal with these symptoms. Table 5 reports the results.\nWhen someone reports a symptom, he/she visits some facility 31 percent of the time on\naverage. The frequency, however, varies substantially by disease: a person will see a\nprovider more than 50 percent of the time for a high fever and more than 45 percent of\nthe time for diarrhea, but less than 20 percent of the time for chest pains, trouble\nbreathing, genital ulcers, blood in saliva, worm in stool, weight loss, night sweats, or\nhearing or eye-sight problems. The pattern seems to be that people are more likely to see\nsomeone for relatively short-duration morbidities than for more chronic problems\n(other conditions which make them go to the doctor include vomiting for which a doctor\nis visited 40 percent of the time, and cold symptoms, headaches and productive coughs\nfor which a doctor is visited about a third of the time). This is especially striking given\nthat most of the short-duration morbidities tend to get cured on their own, or in the case\nof acute diarrhea, with the help of some simple home remedies, while many of the\nchronic conditions are either potentially debilitating (hearing problems, eye-sight\nproblems, etc.) or possible symptoms of some grave condition (chest pains, breathing\nproblems, blood in saliva, etc.).\nThe use of preventive care\nIn contrast to frequent visits to health facilities in response to symptoms, a very small\nnumber of health visits occur to obtain preventive care. For instance, full immunization\nrates for children aged one to five turn out to be only 2.5 percent.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nChoice of healthcare providers\nWhere do these people get the healthcare they are buying? In the Udaipur survey, of the\n0.51 visits to a health facility that the average person in our survey reports in a month,\nonly 0.12 visits (i.e. less than quarter) are to a public facility. The fraction of visits to a\npublic facility is highest for the richest group (the poor and middle income groups visit\npublic facilities less frequently than the wealthy and with about the same frequency as\none another). Overall, no one uses public facilities very much, and if anything, the poor\nuse them the least. The majority of the rest of the visits (0.28 visits per adult per month)\nare to private facilities. The rest are to bhopas (0.11 visits per adult per month), who are\nthe traditional healers. For the poor, the fraction of visits to a bhopa is well over a\nquarter of all visits, while for the richest group it is about an eighth of all visits.\nPatients associate specific diseases with specific providers. Table 5 lists the conditions in\nthe order of how likely it is that the person will see a doctor for them. When we compare\npublic versus private facilities there is no discernable pattern, except that those who have\nblood in cough tend to go to public facilities relatively more often. On the other hand, it\nis clear that a person is somewhat less likely to see a bhopa for the conditions at the top\nof the table, which are the conditions which the patient presumably takes most seriously\n(since he/she goes to the doctor more frequently for these conditions than for others).\nDiscussion Topic 2: Patterns of healthcare usage-- Are providers or patients\ndriving it?\nAnother pattern we observed in the survey is that the poor are less likely to visit the sub-centers\nthat were often closed according to the absenteeism survey. Instead of attending these sub-\ncenters, they go to the bhopas more often.\n1. Why would provider absence discourage patients?\nHowever, government nurses tend to blame the patients. Patients, they suggest, prefer to go to\nBengali doctors because the Bengali doctors give them lots of injections and tablets, and prefer to\ngo to see bhopas because patients are superstitious. Nurses claim that patients do not\nunderstand the dangers of being over-medicated or the futility of trying to exorcise diseases. In\nthe end, government nurses say they do not come to work because there is no demand for their\nservices.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n2. Do we know anything about whether patients can make reliable judgments about the\nkind of healthcare to get?\nThe Udaipur Health project team, the collector, and the Chief Medical Health Officer (CMHO) were\nkeen to answer this question. They decided to try to implement an intervention that would\nimprove absenteeism in some selected centers. First, they had to decide on an intervention.\n3. Brainstorming session: What are possible interventions to reduce absenteeism?\nThe intervention they finally decided on was to provide incentives to the nurses to be present at\ntheir centers on a specific day of the week. All regular nurses were given an order to be present\nat their centers (and to not visit the field) on Mondays. All additional nurses were given an order\nto be present at their centers (and to not visit the field) at least 3 days a week.4 This order was\nimplemented in all of Udaipur district. However, in addition, in half (randomly selected) of the\nsub-centers serving our study villages, Seva Mandir was given a mandate to monitor the nurses\non the specified days. The nurses were given a time and date stamp and a register.5 Seva Mandir\ncollected the register, and provided the information to the CMHO. The CMHO announced\npunishments for nurses with high absences on these days (pay deduction and threat of\ntermination).\n4. What data do we need to collect to assess whether the monitoring system made a\ndifference in term of absence rates? And in terms of facility usage?\n4 \"Regular\" nurses are \"permanent\" while \"additional\" nurses are hired on a yearly contract basis.\n5 A time and date stamping machine allows for monitoring of ANM presence at sub-centers by requiring\nANMs to stamp a register three times daily.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\n5. In the first 6 months, the program led to a sharp reduction in absence rates. For\nexample, columns 3 and 4 in Table 9 show that, between May and October, the\nabsence rate on Mondays for the regular ANMs in the treatment group was 40.6\npercent while the absence rate for regular ANMs in the control group was 69.2\npercent. However, there was no change in the usage of the facility, even on Mondays.\nHow do we explain this? Is this necessarily a sign that consumers are the main\nproblem?\n6. After 6 months, the program stopped having any effect on absence rates: Absence\nwas as high in the centers where the program was implemented as in the other\ncenters when it was measured by the researcher. Yet, Figure 1 shows that the\nrecorded absence did not go up. What happened? Does Figure 1 give us a clue?\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nHow much do they spend?\nColumns 1 and 2 of Table 6 show the monthly expenditure on health in the Udaipur\nsurvey, calculated in two ways: from the expenditure survey, and from the expenditures\nreported in the adult and children surveys. Column 3 shows the expenditure as a fraction\nof household total expenditures, and from the expenditures reported in the adult and\nchildren survey as a fraction of personal expenditures. The average household spends\nseven percent of its budget on health. While the poor spend less than the rest of the\npopulation in absolute amount, they spend the same amount as a share of their budget.\nColumn 4 shows the average health expenditure for adults. It is about 60 rupees, or 13\npercent of the monthly PCE of the average family. This fraction is highest for the poorest\ngroup (15 percent) and lowest for the richest group (11 percent).\nPoor adults in the Udaipur survey spend 13 percent of their total health expenditures at\npublic facilities, 23 percent on bhopas, and the rest at private facilities. The rich spend 23\npercent of their total health expenditures at public facilities, and less than 10 percent on\nbhopas, while the middle group spends more than 17 percent of their health\nexpenditures on bhopas and 13 percent at public facilities.6 The rich therefore spend a\nsignificantly larger fraction of their health rupees at public facilities than do the poor,\nand a significantly smaller fraction on bhopas.\nTreatments\nPatients are given a shot in 68 percent of the visits to a private facility and a drip in 12\npercent of the visits. A test is performed in only three percent of the visits. In public\nfacilities, they are somewhat less likely to get an injection or a drip (32 percent and six\npercent, respectively) but no more likely to be tested. Among private doctors in this\nsample, it does not appear that more qualified doctors are less likely to administer shots:\nif anything, we seem to find the opposite. Given the evidence on the nature of the\nailments that people see doctors for (mostly short-term, self-limiting diseases) it does\nseem likely that shots and drips are being overused, at least by the private doctors, and\nperhaps even by the public providers.\nIt is not clear that the public facilities are delivering what the patients want. Out of 898\n6 The percentages do not necessarily add up to 100, because some people did not know whether certain\nfacilities were public or private.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\npeople who could not remember ever going to a public facility, the most common reason\nfor not attending (chosen by over 250 people) was \"no proper treatment at government\nfacilities.\" Another 60 people said that \"better treatment (was) available elsewhere.\" The\nother most common answers were \"I did not need to go\" (roughly 175 people), followed\nby \"too far\" (roughly 100 people), \"too expensive,\" \"do not know where it is\" (roughly 50\npeople each), and \"do not know about government hospitals\" (roughly 35 people). There\nis clearly a large group that feels that they are not getting the care they want. Among\nthese people there are some who do say that they don't go to public facilities because\nthey do not get a shot when they go, but most just say that they do not like the treatment\nat public facilities.\nDiscussion Topic 3: Preventive care--Distinguishing provider side and\nconsumer side problems\nIn contrast to individuals' frequent visits to health providers when they are ill, there seems to\nbe very little demand for preventive care. At the baseline, the full immunization rate (the\nshare of children having received all the immunization recommended by the government of\nIndia after age one) was only 2.5 percent among children aged one to two.\n1. The root of this low immunization rate could be caused by either the consumers\nor the providers. Develop possible arguments that suggest how each side could\nbe responsible.\nImproving the provider side: Instead of trying to improve the reliability of the government\nnurses, Seva Mandir and the health administration decided to form a direct partnership. Seva\nMandir gets vaccines from the government for free, and organizes monthly, well publicized\ncamps in a set of villages. Seva Mandir uses its network of para-workers to advertise the\ncamps and remind people they can go to get their children vaccinated.\n2. Is this arrangement necessarily a \"temporary\" fix until we can improve the\ngovernment sector, or would it be possible to scale this program up in the context\nof a permanent public-private partnership? If we wanted to scale such a program\nup, what would we need to be careful of?\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nEncouraging the consumers: To encourage parents to get their children immunized, Seva\nMandir designed a program in which a small quantity of lentils was going to be provided to\neach parent at the time of immunization. This program could be effectively combined with the\ncamp.\nMany say that one should not encourage parents to immunize their children with goods such\nas lentils. Instead, one should try and convince them that immunizing their children is the\nright thing to do. Yet, while immunization rates have improved significantly in Africa thanks\nto massive campaigns in which parents received free mosquito nets, they are stagnating in\nIndia. This is problematic both since immunization is mandatory in most OECD countries, and\nsince immunization prevents many communicable diseases.\n3. Discuss why this provides a rationale for making immunization mandatory or\nsubsidizing it. What are the respective merits of subsidizing immunization versus\nmaking it mandatory?\n4. Propose an experimental design using these two programs to assess the relative\nimportance of the provider and consumer sides in determining the decision to get\nimmunized.\n\nThe Abdul Latif Jameel Poverty Action Lab at the Massachusetts Institute of Technology | Cambridge, MA 02139, USA\nReferences\nBanerjee, Abhijit, Angus Deaton and Esther Duflo (2004), \"Healthcare Delivery in Rural\nRajasthan,\" Economic and Political Weekly, February 28, 2004, v. 39, iss. 9, pp. 944\n949.\nBanerjee, Abhijit, Esther Duflo and Rachel Glennerster (2007), \"Putting Band-Aid on a\nCorpse: Incentives for Nurses in the Indian Public Health Care System,\" MIT and the\nAbdul Latif Jameel Poverty Action Lab.\nChaudhury, Nazmul and Jeffrey Hammer (2003) \"Ghost Doctors: Absenteeism in\nBangladeshi Health Facilities,\" mimeo, Development Research Group, World Bank.\nChaudhury, Nazmul, Jeffrey Hammer, Michael Kremer, Kartik Muralidharan and Halsey\nRogers (2003), \"Teachers and Healthcare Providers Absenteeism: A Multi-country\nStudy,\" mimeo, Development Research Group, World Bank.\nDas, Jishnu and Carolia Sanchez-Paramo (2004), \"\nShort but not Sweet: New\nEvidence on Short Duration Morbidities from India,\" mimeo, Development Research\nGroup, World Bank.\nDas, Jishnu and Jeffrey Hammer (2005), \"Money for Nothing: The Dire Straits of Health\nCar in Delhi,\" mimeo, Development Research Group, World Bank.\nDas, Jishnu and Jeffrey Hammer (2004), \"Which Doctor? Combining Vignettes and\nItem Response to Measure Doctor Quality,\" mimeo, Development Research Group,\nWorld Bank.\nDas, Veena and Bhrigupati Singh (2005), \"TB and Urban Poverty: An Essay Critical and\nClinical,\" mimeo, Johns Hopkins University.\nDuflo, Esther and Rema Hanna (2005), \"Monitoring Works: Getting Teachers to Come\nto School,\" mimeo, MIT.\nFogel, Robert W. (1997), \"New findings on Secular Trends in Nutrition and Mortality:\nSome Implications for Population Theory,\" in Oded Stark and Mark Rosenzweig, eds.,\nHandbook of Population and Family Economics, Amsterdam, Elsevier, 433-81.\nMurray, Christopher J. L., and Lincoln C. Chen (1992), \"Understanding Morbidity\nChange,\" Population and Development Review, 18(3) 481-503.\nSadana, Ritu, Ajay Tandon, et al. (2002), \"Describing Population Health in Six\nDomains: Comparable Results from 66 Household Surveys,\" Geneva, World Health\nOrganization. GPE Working Paper No. 43.\nSen, Amartya K. (2002), \"Health: Perception Versus Observation,\" British Medical\nJournal, 324, 860-1.\nSen, Gita, Aditi Iyer and Asha George (2002), \"Structural Reforms and Health Equity: A\nComparison of NSS Surveys, 1986-87 and 1995-96,\" Economic and Political Weekly,\nApril 6, 2002, 1342-1352.\n\nTable 1: Selected health indicators, by position in the per capita monthly expenditure distribution\nreported\nNo. of symptoms\nhealth\nself reported in last\nhemoglobin below peak flow meter\nhigh blood\ngroup\nstatus\n30 days\nBMI\n12 g/dl\nreading\npressure\nlow blood pressure\nbottom third\n5.87\n3.89\n17.85\n0.57\n314.76\n0.17\n0.06\nmiddle third\n5.98\n3.73\n17.83\n0.59\n317.67\n0.15\n0.08\ntop third\n6.03\n3.96\n18.31\n0.51\n316.39\n0.20\n0.09\nNote:\nMeans based on data collected by the author from 1024 households. See text for survey and variable description\n\nAppendices\nTable 2a: Medical Training\nNo\nMBBS\nOther\nFormal\nBHMS/ +\nSeva\nNGO\nGovt\nOther\nFacility Type\nQual\nRMP\nBAMS BIMS\nBUMS MBBS DHMS\nSpec\nANM\nPharm Mandir\nTraining Training Training Total\nprivate doctor\n13.9% 21.3%\n6.6%\n0.8%\n0.0%\n10.7%\n10.7%\n27.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n14.8%\nnurse/MPW\n0.0%\n0.0%\n11.1%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0% 55.6%\n0.0%\n0.0%\n0.0%\n0.0%\n33.3%\n100.0%\ncompounder\n15.6%\n6.3%\n12.5%\n0.0%\n3.1%\n0.0%\n0.0%\n1.6%\n6.3%\n3.1%\n0.0%\n0.0%\n6.3%\n45.3%\n100.0%\npharmacist\n75.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n6.3%\n18.8%\n0.0%\n0.0%\n0.0%\n100.0%\nTBA/Dai\n76.6%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n22.5%\n0.0%\n0.0%\n0.0%\n99.1%\nVHW\n4.5%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n86.4%\n9.1%\n4.5%\n0.0%\n105.7%\n104.5%\nCommmunity\nHealth\nWorker\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n50.0%\n0.0%\n0.0%\n50.0%\n100.0%\nHome Remedy\nWorker\n0.0% 50.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n50.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n100.0%\nTrad healer/\ndesi ilaj\npractitioner\n60.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n20.0%\n20.0%\n0.0%\n0.0%\n100.0%\njhaad fonk\npractitioner\n100.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n100.0%\ndesi ilaj and\njhadd fonk\n96.7%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n3.3%\n0.0%\n0.0%\n100.0%\nprivate hospital\n0.0%\n2.4%\n0.0%\n2.4%\n0.0%\n9.5%\n0.0%\n63.1%\n2.4%\n0.0%\n0.0%\n0.0%\n0.0%\n27.4%\nayurvedic\n50.0%\n0.0%\n50.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n100.0%\nnon medical\nprofession\n75.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n25.0%\n0.0%\n0.0%\n0.0%\n100.0%\nother\n28.6%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n0.0%\n28.6%\n0.0%\n0.0%\n42.9%\n100.0%\n107.1%\n\nMain Provider Education Table 2b\nMain Providers\nfactype\nPercentage\nEducated People\nPercentage\nEducated in\nNFE\nPercentage\nWho Went To\nSchool\nPercentage\nGraduate People\nPercentage\nWho Went To\nSchool But Not\nGraduates\nMean Class\nReached By People\nWho Went To\nSchool and Do Not\nHave Grad Diploma\nprivate doctor\nnurse/MPW\ncompounder\npharmacist\nTBA/Dai\nVHW\nCommmunity\nHealth Worker\nHome Remedy\nWorker\nTrad healer/desi\nilaj practitioner\njhaad fonk\npractitioner\ndesi ilaj and jhadd\nfonk\nprivate hospital\nayurvedic\nnon medical\nprofession\nother\n100.0%\n100.0%\n100.0%\n100.0%\n7.2%\n95.5%\n100.0%\n100.0%\n60.0%\n23.8%\n40.0%\n97.6%\n100.0%\n75.0%\n85.7%\n0.0%\n0.0%\n3.1%\n0.0%\n5.4%\n4.5%\n0.0%\n0.0%\n20.0%\n6.3%\n10.0%\n0.0%\n0.0%\n0.0%\n14.3%\n100.0%\n100.0%\n96.9%\n100.0%\n1.8%\n90.9%\n100.0%\n100.0%\n40.0%\n17.5%\n30.0%\n97.6%\n100.0%\n75.0%\n71.4%\n63.1%\n22.2%\n34.4%\n6.3%\n0.0%\n0.0%\n0.0%\n50.0%\n0.0%\n0.0%\n0.0%\n92.9%\n0.0%\n0.0%\n14.3%\n36.9%\n77.8%\n62.5%\n93.8%\n1.8%\n90.9%\n100.0%\n50.0%\n40.0%\n17.5%\n30.0%\n4.8%\n100.0%\n75.0%\n57.1%\n11.1\n11.4\n11.5\n9.3\n2.5\n6.4\n10.0\n11.0\n4.5\n5.0\n3.7\n12.0\n11.0\n8.0\n8.8\n\nTable 3: Health-care costs\nTotal Health Visit Cost\n(w/o Transportation)\nVisit Cost (average of all) According To\nCosts with Test/Ope\nCost Without\nTest/Ope\nClients\nPrivate Provider\nPublic Provider\nClient\nProvider\nClient\nFacility type\nAverage\ncost\nTotal\nConsultation Fee\n(Poor)\nTotal Consultation\nFee (Rich)\nPercentage of\nFacilities Who\nCharge Any Fee\nMaximum\nFee That\nCan be\nCharged\nCost of Visits\nwith Tests or\nOperations\nAmount for\nLab Test +\nOperation+\nInpatientStay\nCost of Visits\nWithout Tests\nor Operations\nCHC/\n138.1\n87.50%\n17.3\n683.0\n100.2\nPHC\n0.0%\nGovernment referral\nhospital\n1217.2\n3145.2\n555.0\nPrivate hospital\n889.5\n1364.1\n1344.5\n3106.4\n462.4\nAyurvedic hospital\n1981.4\n0.0%\n29326.7\n73.6\nTB hospital\n401.0\n6667.0\n.\ndispensary\n0.0\n0.0\n.\naidpost/subcenter\n32.8\n0.0%\n300.0\n32.5\nangawadi\n0.0\n.\n0.0\nhealth camp\n0.0\n0.0\n0.0\nNgo clinic\n121.8\n774.0\n78.5\nprivate qualified doctor\n178.6\n107.4\n130.0\n1788.0\n145.3\nprivate nurse/\n157.9\n53.3\n61.7\n4410.0\n91.4\ncomponder\n44.0\n46.9\nprivate pharmacist\n16.7\n38.5\n37.3\n.\n16.7\nbengali doctor\n105.2\n394.7\n99.5\ngovernment doctor,\nprivate practice\n179.2\n3383.3\n132.9\ng\npractitionner, private\npractice\n103.7\n540.0\n93.5\nTBA/Dai\n103.3\n6.2\n10.7\n.\n103.3\nVHW/\n0.9\n4.0\n4.5\n.\n0.9\nCHW\n42.5\n50.0\nHRW\n33.2\n767.5\n767.5\n.\n33.2\nbhopa\n130.8\n(desi ilaj/\n11.9\n11.9\njhaad fonk/\n8.0\n8.0\nboth)\n7.4\n12.0\nOTHER\n16.1\n18.6\n27.1\n0.0\n17.1\nDon't know\n144.5\n103.8\nayurvedic\n30.0\n30.0\nnon medical profession\n2.8\n2.8\nNote: we do not have detail on operations/lab test for private providers\n\nTable 4: frequency of health care visits\nPer capita monthly\nTotal number of visits in the last 30 days\nexpenditure\nALL\nPublic\nPrivate\nBhopa\nPANEL A: MEANS\nALL\n0.51\n0.12\n0.28\n0.11\npoor\n0.43\n0.09\n0.22\n0.12\nmiddle\n0.54\n0.11\n0.29\n0.13\nrich\n0.55\n0.15\n0.33\n0.07\nPANEL B: OLS REGRESSIONS: dependent variable: number of visits\nMiddle\n0.11\n0.02\n0.07\n0.01\n(.052)\n(.023)\n(.034)\n(.027)\nRich\n0.12\n0.06\n0.11\n-0.05\n(.05)\n(.024)\n(.034)\n(.022)\nPANEL C: OLS REGRESSIONS, WITH VILLAGE FIXED EFFECTS\nMiddle\n0.14\n0.02\n0.09\n0.02\n(.047)\n(.024)\n(.033)\n(.023)\nRich\n0.13\n0.04\n0.11\n-0.03\n(.05)\n(.026)\n(.036)\n(.025)\nVillages Fixed effects\nyes\nyes\nyes\nyes\nNote: Omitted dummies in panel B and C: poor\nStandard errors in parentheses below the coefficients\n\nTable 5: Choice of Facilities\nCondition\nMean\nAny Visit\nFraction\nof\nPrivate\nHosp\nFraction\nof\nPrivate\nVisit\nPub\nPvt\nNGO\nBhopa\nMILD AND SERIOUS\nHot Fever\nDiarrhea\nVomiting\nPain in Upper Abdomen\nBody Ache\nCold Symptoms\nCough with Blood\nDry Cough\nHeadache\nProductive Cough\nPain in Lower Abdomen\nBack Ache\nWeakness/Fatigue\nSkin Problems\nSwelling Ankles\nMenstrual Problems\nPainful Urination\nChest Pain\nTrouble Breathing\nGenital Ulcers\nBlood in Spit\nWorms in Stool\nWeight Loss\nProblems with Vision\nNight Sweats\nHearing Problems\n0.32\n0.54\n0.03\n0.02\n0.19\n0.59\n0.01\n0.14\n0.16\n0.45\n0.05\n0.02\n0.20\n0.62\n0.01\n0.10\n0.09\n0.40\n0.02\n0.01\n0.18\n0.61\n0.00\n0.16\n0.23\n0.38\n0.03\n0.01\n0.20\n0.45\n0.00\n0.29\n0.42\n0.37\n0.04\n0.02\n0.21\n0.51\n0.01\n0.20\n0.33\n0.35\n0.03\n0.03\n0.20\n0.61\n0.01\n0.10\n0.01\n0.34\n0.20\n0.00\n0.30\n0.40\n0.00\n0.10\n0.20\n0.34\n0.02\n0.01\n0.23\n0.60\n0.02\n0.10\n0.42\n0.34\n0.03\n0.01\n0.20\n0.53\n0.02\n0.19\n0.11\n0.33\n0.07\n0.00\n0.22\n0.54\n0.02\n0.13\n0.12\n0.31\n0.01\n0.04\n0.14\n0.47\n0.00\n0.33\n0.33\n0.28\n0.03\n0.03\n0.21\n0.49\n0.03\n0.19\n0.23\n0.25\n0.05\n0.02\n0.18\n0.53\n0.02\n0.19\n0.03\n0.24\n0.15\n0.00\n0.10\n0.55\n0.05\n0.10\n0.01\n0.24\n0.00\n0.11\n0.22\n0.33\n0.00\n0.33\n0.06\n0.24\n0.05\n0.05\n0.25\n0.20\n0.05\n0.40\n0.10\n0.21\n0.04\n0.00\n0.23\n0.52\n0.02\n0.19\n0.11\n0.20\n0.02\n0.02\n0.24\n0.51\n0.02\n0.18\n0.07\n0.19\n0.03\n0.06\n0.17\n0.57\n0.03\n0.14\n0.01\n0.18\n0.00\n0.00\n0.17\n0.50\n0.00\n0.33\n0.01\n0.17\n0.00\n0.00\n0.25\n0.50\n0.00\n0.25\n0.03\n0.14\n0.00\n0.09\n0.55\n0.18\n0.00\n0.18\n0.11\n0.07\n0.05\n0.05\n0.26\n0.42\n0.05\n0.16\n0.14\n0.06\n0.05\n0.00\n0.30\n0.45\n0.00\n0.20\n0.03\n0.04\n0.00\n0.00\n0.33\n0.67\n0.00\n0.00\n0.04\n0.03\n0.00\n0.00\n0.00\n0.33\n0.00\n0.67\n\nTable 6: Patterns of Health-care Spending\nhousehold monthly health expenditure\nAverage adult monthly expenditure on:\nAverage cost per visit\nlevel\nshare/monthly exp.\nexpenditure\nindividual\nAll\nshare\nall\nsurvey\nsurveys\nindividual surveys\nvisits\nshare public\nprivate\nshare bhopa\nvisits\nPublic\nPrivate\nBhopa\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n(9)\n(10)\n(11)\nPANEL A: MEANS\nALL\n0.07\n0.18\n0.66\n0.15\npoor\n0.07\n0.13\n0.61\n0.24\nmiddle\n0.09\n0.14\n0.68\n0.17\nrich\n0.08\n0.23\n0.68\n0.09\nPANEL B: OLS REGRESSION\nmiddle\n0.02\n0.01\n0.07\n-0.07\n-19\n(21)\n(38)\n(.018)\n(8)\n(.042)\n(.051)\n(.041)\n(12)\n(24)\n(20)\n(31)\nrich\n0.01\n0.10\n0.07\n-0.16\n(109)\n(34)\n(.012)\n(12)\n(.042)\n(.053)\n(.041)\n(24)\n(45)\n(35)\n(34)\nPANEL C: OLS REGRESSIONS, WITH VILLAGE FIXED EFFECTS\nmiddle\n0.02\n0.01\n0.08\n-0.07\n5.7\n-33\n0.46\n-7.9\n(21)\n(39)\n(.015)\n(12)\n(.04)\n(.049)\n(.039)\n(26)\n(78)\n(42)\n(36)\nrich\n0.01\n0.05\n0.07\n-0.10\n-21\n(109)\n(42)\n(.016)\n(13)\n(.042)\n(.052)\n(.041)\n(28)\n(86)\n(43)\n(49)\nvillage fixed\neffects\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nyes\n\nTable 7: Continuous facility survey: summary statistics\nSubcenters\n& aidposts\nPHC & CHC\ndoors closed\n0.56\n0.03\nno personnel found\n0.45\n0.03\nfraction of medical personnel found\n0.55\n0.64\ndoctor is appointed\n0.89\nfraction of doctors present\n--\n0.55\nat least one medical personnel is missing\n0.56\n0.78\nobservations\nnumber of facilities\nnumber of visits per facility\n\nTable 8: Where is absence higher?\nFraction of medical personnel present\nnumber of\nvisits\nSubcenters &\naidposts\nPHC & CHC\nDistance from road\n0 Km from road\n>0 and <=5 Km from road\n>5 Km from road\nDistance from Udaipur\nclosest to udaipur\nfarther\nfarthest\nDistance from the nearest town\nclosest to town\nfarther\nfarthest\nReservations for women\nno reservation for women\nreservation for women\nElectricity\nno electricity\nelectricity\nWater\nin facility\nless than 30 meters from facility\n30 to 100 meters from facility\nmore than 100 meters from facility\nMedical personnel living in facility\nno medical personnel living in facility (with living quarters)\nat least one medical personnel living in facility\nno living quarters available\n0.56\n0.65\n0.55\n0.63\n0.38\n0.53\n0.61\n0.58\n0.68\n0.54\n0.66\n0.56\n0.64\n0.55\n0.75\n0.54\n0.59\n0.57\n0.50\n0.56\n0.68\n0.56\n0.60\n0.52\n0.65\n0.53\n0.61\n0.57\n0.68\n0.49\n0.62\n0.59\n0.62\n0.56\n0.80\n0.64\n0.69\n0.49\n0.64\nNote: some data covers only a subset of facilities\n\nTable 9: Difference Between Treatment and Comparison Centers: Centers with one ANM\nEntire period\nMay-October\nNovember-June\nTreatment Control\nDifference\nTreatment Control\nDifference\nTreatment Control\nDifference\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n(9)\nA. On all days\nCenter open\n0.391\n0.245\n0.091\n0.584\n0.333\n0.220\n0.281\n0.224\n0.056\n(0.022)\n(0.020)\n(0.051)\n(0.038)\n(0.047)\n(0.094)\n(0.025)\n(0.023)\n(0.050)\nMonitored ANM present\n0.382\n0.220\n0.104\n0.584\n0.324\n0.243\n0.273\n0.196\n0.073\n(0.022)\n(0.019)\n(0.049)\n(0.038)\n(0.047)\n(0.093)\n(0.025)\n(0.022)\n(0.047)\nNumber of clients\n0.309\n0.167\n0.081\n0.572\n0.294\n0.237\n0.182\n0.113\n0.065\n(0.038)\n(0.026)\n(0.062)\n(0.093)\n(0.073)\n(0.245)\n(0.030)\n(0.025)\n(0.045)\nNumber of clients (if center is open)\n0.724\n0.590\n0.077\n0.907\n0.794\n0.170\n0.582\n0.451\n0.161\n(0.085)\n(0.089)\n(0.186)\n(0.147)\n(0.188)\n(0.489)\n(0.088)\n(0.098)\n(0.174)\nNumber of Visits\nB. On Mondays\nCenter open\n0.546\n0.408\n0.138\n0.594\n0.308\n0.286\n0.443\n0.431\n0.012\n(0.036)\n(0.059)\n(0.078)\n(0.043)\n(0.133)\n(0.148)\n(0.064)\n(0.066)\n(0.111)\nMonitored ANM present\n0.541\n0.394\n0.147\n0.586\n0.308\n0.279\n0.443\n0.414\n0.029\n(0.036)\n(0.058)\n(0.073)\n(0.043)\n(0.133)\n(0.148)\n(0.064)\n(0.065)\n(0.105)\nNumber of clients\n0.536\n0.203\n0.333\n0.586\n0.385\n0.202\n0.426\n0.161\n0.266\n(0.076)\n(0.067)\n(0.136)\n(0.101)\n(0.180)\n(0.243)\n(0.100)\n(0.071)\n(0.142)\nNumber of clients (if center is open)\n0.906\n0.464\n0.441\n0.911\n1.000\n-0.089\n0.889\n0.375\n0.514\n(0.124)\n(0.150)\n(0.247)\n(0.155)\n(0.408)\n(0.431)\n(0.180)\n(0.157)\n(0.279)\nNumber of Visits\nNotes:\n1. Standard errors in parenthesese below the mean (or difference)\n2. The difference in means is obtained from a regression where we control for the day of the week in which the visit took place\n3. The standard errors of the difference in means is corrected for clustering a the center level.\n\n0%\n20%\n40%\n60%\n80%\n100%\nMachine problem\nExempt\nCasual leave\nAbsent\nHalf day\nFull day\nFigure 1: ANM attendance according to official records, monitored days\nFeb-\nMar- Apr-06 May-\nJun-\nJul-06 Aug-\nSep- Oct-06 Nov-\nDec-\nJan-\nFeb-\nMar- Apr-07 May\nMonth"
    },
    {
      "category": "Resource",
      "title": "Challenges of Development: How do the poor live?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/119803d6aa0dbdd31f047d4650a73392_MIT14_74s09_lec02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChallenges of Development:\nHow do the poor live?\n14.74, lecture 2, February 9, 2009\n\nA data description project\n(based on work with Abhijit Banerjee)\n\nData\nBringing together data on the very poor, defined as those\nwith consumption below $1.08 ($1) a day at 1993 PPP.\nThe poor defined as those below $2 a day at 1993 PPP\nThe Middle class defined as those between $2 and $4\ndollars a day, or $6 and $10\nFrom a number of detailed households surveys (LSMS,\nRAND, our own data).\n\nTopics\nThe demographic structure\nHow do the poor spend their money?\nWhat are their living conditions (houses, health, etc.)?\nHow do they earn their money?\nHow is it different form the middle class?\nWhat are the main puzzles that emerge from this portrait?\nDoes this provide support for the \"messiahs'\" or the\n\"romantics'\" view of the poor? : bringing more evidence\nfrom field experiment\n\nThe Demographic Structure\n\nThe demographic structure\nLarge families\nMany young people\nNot many old people or among the poor\nHigher mortality?\nOr lower fertility?\nCan you tell from this data? Why or why not?\nWays to tell:\nMissing grandparents\nPanel data: probability of dying\nDirection of causality??\n\nProbability of death after 5 years,\nconditional on being alive at age 50\n0%\n2%\n4%\n6%\n8%\n10%\n12%\n14%\n16%\n18%\nIndonesia <$2\nIndonesia $2-$4 Indonesia $6-$10\nVietnam<$2\nVietnam $2-$4\nVietnam $6-$10\n\nQuestion on demographics?\n\nHow do the poor spend their\nmoney?\n\nFood?\nFood is the first place where people are looking for poverty\ntraps (e.g Abu).\nAre the very poor spending every marginal penny they can\non getting more food?\nThe share of expenditure between 78% in Papua New\nGuinea and 50% in Mexico.\nOther large items include:\nTobacco/alcohol (up to 8%)\nFestivals (up to 14% when asked in detail)\nThey could easily spend more on food.\n\nHow the poor spend their money\nAlcohol/\nFood\nTobacco\nEducation\nHealth\nLiving on less than $1 a day\nRural\nCote d'Ivoire\n64.4%\n2.7%\n5.8%\n2.2%\nGuatemala\n65.9%\n0.4%\n0.1%\n0.3%\nIndia - Udaipur\n56.0%\n5.0%\n1.6%\n5.1%\nIndonesia\n66.1%\n6.0%\n6.3%\n1.3%\nMexico\n49.6%\n8.1%\n6.9%\n0.0%\nNicaragua\n57.3%\n0.1%\n2.3%\n4.1%\nPakistan\n67.3%\n3.1%\n3.4%\n3.4%\nPanama\n67.8%\n2.5%\n4.0%\nPapua New Guinea 78.2%\n4.1%\n1.8%\n0.3%\nPeru\n71.8%\n1.0%\n1.9%\n0.4%\nSouth Africa\n71.5%\n2.5%\n0.8%\n0.0%\nTimor Leste\n76.5%\n0.0%\n0.8%\n0.9%\nAs a Share of Total Consumption\n\nEngel curves?\nPercentage of Household Budget spent on Food\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n100%\nRural\n$1\nRural\n$2\nRural\n$2-$4\nRural\n$6-$10\nUrban\n$1\nUrban\n$2\nUrban\n$2-$4\nUrban\n$6-$10\n\nHow the poor spend their money\n% HHs with\nany Festival\nEntertainment\nFestivals\nExpenditure\nLiving on less than $1 a day\nRural\nCote d'Ivoire\n0.0%\n1.3%\n59.9%\nGuatemala\n0.1%\n7.7%\nIndia - Udaipur\n0.0%\n14.1%\n99.4%\nIndonesia\n0.0%\n2.2%\n80.3%\nMexico\n0.7%\n0.0%\n2.7%\nNicaragua\n0.0%\n0.0%\n1.8%\nPakistan\n0.3%\n2.4%\n64.8%\nPanama\n0.6%\n0.0%\n0.0%\nPapua New Guinea\n0.2%\n1.5%\n21.7%\nPeru\n0.0%\nSouth Africa\n0.1%\n3.2%\n90.3%\nTimor Leste\n0.0%\n0.0%\n49.0%\n\nChoice?\nDeaton and Subramanian also show that the poor\nspend 30% of their food budget on rice and wheat\nwhich cost between 70% and 100% more per\ncalorie than other grains\nThey also spend 7% on sugar\nThey could buy almost 30% more calories without\nspending more.\nDeaton and Dreze (2008) As the poor in India are\nbecoming richer, the consumption of calories (and\nof any nutrients except fat) is decreasing.\n\nAre the poor eating \"enough\"?\nDeaton and Dreze (2008) find that 76% of Indians live in households\nwhere the average per capita calorie consumption is below the\nrecommended levels (2,400 rural, 2,100 urban)\nAverage body mass index is 17.8 in Udaipur compared to a cut-off for\nunder-nourished of 18.5 & 55% are anemic.\n46.7% of children have \"low weight for age\"\nIn Udaipur:\n\nin the last year 37% of the very poor households the adults starved\nfor an entire day.\n45% cut the size of their meals\nOnly 57% report that they have enough to eat throughout the year\nThose families that report missing meals are 0.23 standard deviations\nless well-being\n\nEducation\nFraction of children in school increase fast with\nincome\nShare of income spent on education is higher in\nurban area\nShare of income spent on education constant or\nincrease with income:\nMoney spent for each child increases a lot (income is\nmuch higher, fewer kid to educate)\n\nQuestions on consumption?\n\nSavings and Accumulation\n\nAssets and Savings\nIn the median country a majority of the rural poor own\nland.\nOther than that they own very little: in the Udaipur sample,\n10% or less have a chair or a table\nIn the median country less than 15% have a bicycle and less\nthan 10% own a television.\nThe middle classes acquire televisions!\nIn Udaipur very few possible business assets: Less than 1%\nown a tractor, a bullock cart, a motorized cycle, a fan\nVery little savings we can detect (bank accounts, Self Help\nGroups etc.) (table 12, page 3)\n\nWhat the poor own\nRadio\nTelevision\nBicycle\nLand\nLiving on less than $1 a day\nRural\nCote d'Ivoire\n43.3%\n14.3%\n34.4%\n62.7%\nGuatemala\n58.5%\n20.3%\n23.1%\n36.7%\nIndia - Udaipur\n11.4%\n0.0%\n13.5%\n98.9%\nIndonesia\n26.5%\n49.6%\nMexico\n41.3%\n4.0%\nNicaragua\n59.3%\n8.3%\n11.1%\n50.4%\nPakistan\n23.1%\n27.0%\n30.4%\nPanama\n43.6%\n3.3%\n0.0%\n85.1%\nPapua New Guinea\n18.0%\n0.0%\n5.3%\nPeru\n73.3%\n9.8%\n9.8%\n65.5%\nSouth Africa\n72.2%\n7.2%\n20.0%\n1.4%\nTanzania\n0.0%\n92.3%\nTimor Leste\n14.3%\n0.6%\n0.9%\n95.2%\nPercent of Households with:\n\nPercentage of household living in a\nhousehold with a TV\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n100%\nRural $1\nRural $2\nRural $2-$4\nRural $6-\n$10\nUrban $1\nUrban $2\nUrban $2-\n$4\nUrban $6-\n$10\n\nSavings\n% HH with a\nSavings\nAccount\nRural\nCote d'Ivoire\n79.5%\nIndia - Udaipur\n6.4%\nIndonesia\n6.6%\nMexico\n6.2%\nPakistan\n11.7%\nPanama\n0.5%\np\nPeru\n0.5%\nTimor Leste\n13.4%\nLiving on less than $1 a day\n\nLiving conditions\n\nHealth and health environment\nHousing conditions are dire\nElectricity, sanitation, drinking water are still very rare in\nthe poor's houses\nThis is something which changes very steeply with\nincome: the middle class lives in much more comfortable\nconditions\nLots of illnesses (table 11)\nLots of visits, to private and public doctors\nHigh expenditures on health, which increase steeply\nwith income\n\nBasic infrastructure\nIn-House\nToilet/\nTap Water\nLatrine\nElectricity\nRural\nCote d'Ivoire\n11.8%\n27.1%\n45.1%\nGuatemala\n37.7%\n50.5%\n29.9%\nIndia - Udaipur\n0.0%\n0.0%\n8.3%\nIndonesia\n5.6%\n30.5%\n96.9%\nNicaragua\n12.3%\n59.0%\n16.4%\nPakistan\n9.9%\n28.5%\n55.5%\nPapua New Guinea\n1.7%\n95.2%\n2.0%\nPeru\n29.7%\n12.2%\nSouth Africa\n4.4%\n58.9%\n5.6%\nTanzania\n0.7%\n91.6%\n1.1%\nTimor Leste\n2.3%\n31.3%\n8.8%\nLiving on less than $1 a day\nPercent of Households with:\n\nHealth in the household\nA Household's\nPercent of Households that met\nPercent of HH\nAverage # of\nAt Least Once with a Consultant\nMembers Sick\nConsultations\nPublic\nPrivate\nRural\nCote d'Ivoire\n21.4%\n1.28\n49.7%\n3.2%\nIndia - Udaipur\n46.1%\n0.11\n20.1%\n58.1%\nIndonesia\n24.2%\n0.77\n20.7%\n27.3%\nMexico\n46.3%\n1.11\n47.7%\n0.0%\nNicaragua\n34.9%\n0.15\n46.0%\n5.0%\nPakistan\n28.0%\n0.45\n24.0%\n48.8%\nPanama\n15.2%\n0.10\n23.8%\n0.0%\nPeru\n11.1%\n0.10\n20.9%\n8.5%\nSouth Africa\n12.5%\n0.12\n16.4%\n6.9%\nTanzania\n13.2%\n0.07\n23.2%\n14.0%\nTimor Leste\n11.7%\n0.21\n30.2%\n0.5%\nLiving on less than $1 a day\nIn Last Month\n\nHow do the poor earn their\nmoney?\n\nLittle bit of everything\nIn most countries a majority of households get income\nfrom self-employment (even in rural areas self-employment\nis both in agriculture and outside it and many do both)\nThe next commonest occupation is wage work, including a\nlot of casual work. Many households do both.\n20% of the households in rural Udaipur say agriculture is\ntheir main source of earnings. 75% say their main earnings\ncome from wage work. Yet almost all of them own land\nand cultivate it.\nAnother survey which identifies all the occupations the\nhouseholds are in (26 occupation, including sewing,\ngathering fuel) finds that each family has 3 working\nmembers and 7 occupations.\n\nOccupations: rural\nPercent of Households in which At Least One Member:\nPercent of HHs\nWorks for a Wage or Salary in\nThat Receive Income\nAgriculture\nOther\nAgriculture\nOther\nFrom Multiple Sectors\nLiving on less than $1 a day\nRural\nCote d'Ivoire\n37.2%\n25.9%\n52.4%\n78.3%\n72.1%\nGuatemala\n64.4%\n22.6%\n31.4%\n86.4%\n83.8%\nIndia - Udaipur\n98.4%\n5.9%\n8.5%\n90.7%\n94.0%\nIndonesia\n49.8%\n36.6%\n31.1%\n34.3%\n50.4%\nMexico\n4.9%\n20.4%\n2.8%\n72.6%\n13.2%\nNicaragua\n54.7%\n11.6%\n0.3%\n42.8%\n18.4%\nPakistan\n72.1%\n35.5%\n32.6%\n50.8%\n66.8%\nPanama\n69.1%\n17.7%\n0.0%\n0.0%\n19.2%\nPeru\n71.7%\n25.2%\n34.8%\nSouth Africa\n0.0%\n9.1%\n27.9%\n26.6%\n0.4%\nTimor Leste\n78.5%\n12.0%\n10.4%\nIs Self Employed In\n\nOccupation: urban\nPercent of Households in which At Least One Member:\nPercent of HHs\nWorks for a Wage or Salary in\nThat Receive Income\nAgriculture\nOther\nAgriculture\nOther\nFrom Multiple Sectors\nLiving on less than $1 a day\nUrban\nCote d'Ivoire\n35.0%\n4.8%\n92.3%\n26.3%\n47.4%\nIndia - Hyderabad\n0.0%\n18.0%\n0.8%\n89.8%\n11.5%\nIndonesia\n9.6%\n50.8%\n35.6%\n77.0%\n56.9%\nMexico\n27.3%\n20.7%\n24.3%\n36.3%\n24.2%\nNicaragua\n24.9%\n37.7%\n0.0%\n31.6%\n8.3%\nPakistan\n17.6%\n51.2%\n4.2%\n67.2%\n38.3%\nPeru\n6.2%\n57.6%\n21.9%\nSouth Africa\n0.0%\n6.8%\n9.0%\n46.4%\n0.0%\nTimor Leste\n80.6%\n7.6%\n2.1%\nIs Self Employed In\n\nThe businesses the poor run\nFamilies often run multiple businesses\nBusinesses are very small. Almost no outside labor\nIn Hyderabad only 20% of businesses have their own\npremises and the commonest businesses assets are\npushcarts, scales and tables.\nIn Hyderabad the main businesses are tailoring,\nfruit/vegetable selling, general stores, telephone booths,\nselling milk, driving a small taxi: Skills?\nIs there anything to worry about?\nSome evidence of the wrong scale:\nInnumerable side by side identical businesses\n\nPercent of HHs\nwith at least One\nNon-Agricultural\nAverage Number of Employees\nPercent of Businesses that Own:\nBusiness\nPaid Workers\nPaid + Unpaid\nVehicles\nMachines\nRural\nCote d'Ivoire\n66.4%\n0.14\n2.48\n2.6%\n66.5%\nIndonesia\n29.4%\n0.11\n1.55\n0.0%\nMexico\n7.8%\n0.59\n2.16\n0.0%\nNicaragua\n14.0%\n0.08\n1.39\n7.5%\n0.0%\nPakistan\n34.3%\n0.13\n1.16\n36.7%\n0.0%\nPanama\n15.2%\n0.00\n1.58\n0.0%\nPapua New Guinea\nPeru\n34.5%\n1.50\nUrban\nCote d'Ivoire\n19.8%\n0.03\n2.43\n0.7%\n73.0%\nIndia - Hyderabad\n14.8%\n1.85\n0.0%\nIndonesia\n44.4%\n0.15\n1.49\n0.0%\nMexico\n7.9%\n0.75\n2.30\n0.0%\nNicaragua\n40.6%\n0.03\n1.18\n0.0%\n0.0%\nPakistan\n51.7%\n0.18\n1.23\n40.3%\n0.0%\nPeru\n63.2%\n1.39\nLiving on less than $1 a day\nIn Each Business:\n\nIs this different for the middle class?\nThe \"romantic\" view of the penniless entrepreneurs is that\nif they get an opportunity, they will create successful\nventures.\nWhat happens to the businesses run by the middle class?\nWe find them to be very similar to that of the poor:\nsimilarly small, undercapitalized, under-specialized.\nThe fundamental difference between the middle class and\nthe poor is that the middle class have steady jobs (regular\nsalaried job that pay a monthly salary).\n\nThe scale of businesses\n$1\n$2\n$2-$4\n$6-$10\nUrban\nIndia Hyderabad\n1.6\n1.7\n2.4\nIndonesia\n1.4\n1.6\n1.8\n2.8\nIvory Coast\n2.6\n2.6\n2.9\nMexico\n2.1\n2.2\n2.6\n2.5\nNicaragua\n1.5\n1.6\n1.8\nPakistan\n1.2\n1.3\n1.7\nPanama\n1.6\n1.7\nPeru\n1.4\n1.6\n2.0\npaid + unpaid\nin each business:\nAverage number of employees\n\nPercentage of employees on casual or\nregular payments\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n100%\nRural $1\nRural $2\nRural $2-$4\nRural $6-$10\nUrban $1\nUrban $2\nUrban $2-$4\nUrban $6-$10\nCasual Pay\nWeekly to monthly pay\n\nMigration\nIn most countries in our sample long-term migration for\nwork is rare\nTemporary migration on the other hand seems quite\ncommon. In 60% of the very poor households in Udaipur\nsomeone had migrated for work.\nAverage duration of a completed episode is 40 days.\nTotal time spent away in a year on average is 18 weeks.\nYet for many of them it provides the majority of their\nincome.\n\nPercent of Adults who Have Migrated\nSince Birth\nFor Work\nRural\nCote d'Ivoire\n26.9%\n11.1%\nGuatemala\nIndonesia\n34.3%\n30.8%\nMexico\n48.7%\n45.6%\nNicaragua\n22.4%\n5.6%\nPakistan\n16.7%\n3.7%\nPanama\n34.8%\n0.6%\nPapua New Guinea\n4.8%\nPeru\n15.3%\n6.7%\nTimor Leste\n61.6%\n\nMigration to urban areas\nPercent of Adults who Have Migrated\nSince Birth\nFor Work\nUrban\nCote d'Ivoire\n14.1%\n6.0%\nIndonesia\n43.0%\n41.3%\nMexico\n37.4%\n32.3%\nNicaragua\n16.2%\n5.9%\nPakistan\n23.1%\n3.6%\nPapua New Guinea\n18.9%\nPeru\n16.5%\n9.6%\nTimor Leste\n62.6%\n\nThe economic environment\nof the poor\n\nThe market for credit\n1.\nFew Loans\n2.\nFrom where?\n3.\nHigh interest rates (3% a month in Hyderabad)\n4.\nLow default rate\n\nSavings and Insurance\nWe already discussed the low savings\nPart of the problem is low access to savings opportunities\nSavings options:\nBanks\nSHG\nRoscas\nInsurance: almost no formal insurance (health, life,\nweather). All the insurance will have to be informal\n\nInfrastructure and public policy\nWe have already seen that availability of electricity, tap\nwater, etc is much lower for the poor\nHuge variation across countries: point out some of the\nkey differences?\nGovernments are typically providing schools and health\ncenter, yet, even the poor spend money on health and\neducation: de facto privatization in some places.\nPoor spend fair amount of money on health and\neducation, for very poor quality private sector.\nWhy does that happen?\n\nFive things that stand out\n1.\nWhy are they not more specialized?\n2.\nWhy are so many of them are entrepreneurs?\n3.\nWhy don't they eat more?\n4.\nWhy don't they accumulate more wealth?\n5.\nWhy don't they migrate for longer\n\nLack of specialization\nIndivisibilities in the labor market: you can only sell\nbreakfast in the morning; You can only farm when there is\nrain, etc.\nOther things you do are also not divisible, or the indivisible\noccupations have excess returns.\nNeither seems to fit the facts.\nLack of markets/access to the market\nRisk diversification: the poor have almost no access to\nformal insurance and informal insurance has its limits\nLack of capital: you do not have the money to expand the\nbusiness that you are best qualified to do: Lot of evidence\non credit constraints\n\nThe many entrepreneurs\nEntrepreneurship is what you often do when you cannot\nfind a job.\nYou cannot find a job because all the other entrepreneurs\nare small-scale and use only family labor.\nThis is in part a result of financial constraints which mean\nthat people either cannot or will not want to invest more\nAnd in part probably a result of labor market and other\nregulations.\n\nWhy not eat more?\nKeeping up with the neighbors\nNot having what the others have may be a source of\nunhappiness.\nBut people are not buying durables. They are spending\non tea, sugar, alcohol, what they call \"avoidable\nexpenses\"\nThere are many others things to buy\nAnd the health effects are negligible\nDeaton-Dreze explanation of food consumption drop in\nIndia is decline in need for calories\nOr the health effects are serious but people cannot resist\n\"temptations\".\n\nWhy not save more?\nThe poor have very limited access to conventional savings\nopportunities (Banks, Post Offices, etc.): less than 14% of\nhouseholds have any kind of Bank account (except in Cote\nD'Ivoire)\nSaving at home is hard: it could be stolen, there is inflation\nrisk etc.\nBut alternatively, why not put it in productive assets: after\nall, an implication of the high interest rates that the poor\npay is that the return on capital must be very high.\nWe calculate that a middle class business owner in\nHyderabad could double their working capital stock in one\nyear by spending 5% of their budget on health (like the\npoor) rather than 10%.\n\nUnderstanding Low Savings\nOther example: Fruit sellers, borrow at 5% A\nDAY. How much is that a year?\nWhat is the returns on saving one cup of tea\na year?\nHow to explain the low savings then?\nIs it because of very high discount rates?\nIs it because those discount rates are inconsistent\nover time?\nIs it for some other reason??\n\nWhy not migrate more?\nThe popular discourse is usually that there is too\nmuch migration to the cities, but there seems to be\ntoo little\nThere is also a lot of back and forth that prevent\npeople to settle into a good job in the city\nLoss of insurance network\nLoss of utility (urban housing conditions can be\nworst than rural)."
    },
    {
      "category": "Resource",
      "title": "Colonial history, institutions and economic development",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/00ae1bd050db6efcfdfdbf7a23e69496_MIT14_74s09_lec24.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74 Colonial history, institutions and economic development\nProf. Esther Duflo\nMay 10, 2009\nThe paper \"The Colonial Origins of Comparative development: An Empirical Investigation,\"\nby Daron Acemoglu, Simon Johnson and James A. Robinson seeks to answer a very important\nquestion: do good institutions matter for development? Through the course, we have seen\nseveral channels where institutions should matter:\n-\n-\n-\n-\nThis paper tries to answer a more \"reduced form\" question: without getting into all these details,\nif we give Zaire the same institutions as the US, how much richer would Zaire be?\nThe question and the identification problem\nIf we think of the quality of institution as our \"treatment\" (as in the quality of schooling), we\nare trying to measure the effect of the treatment on an outcome: log GDP of the country.\nMathematically, we could write it in the following way:\nlog yi = μ + αRi + Xiγ + i\nwhere:\nlog yi = log(GDP ) of country i in year 1995\n\nRi = quality of institutions, measured by the \"expropriation risk\" which we discussed last time.\nXi= control variables (e.g. latitude)\nIf we run the OLS regression, corresponding to this regression, we find\nα = 0.52 standard error 0.06\nLook at the graph\nvery strong correlation\n→\nWhat does it indicate?\n-\n- What are the problems with this interpretation?\n-\n-\n-\nAll these problems create a correlation between Ri and i which biases OLS.\n→\nUsing instrumental variables to solve the identification\nproblem\nWe cannot randomly assign institutions!\nlook for a variable which predicts current\n→\ninstitutions but does not predict directly current GDP per capita. Call this variable Z.\nHow is Z called?\nRefresher: method to recover an unbiased estimate of α using Z:\n1. Run the regression:\nRi = λR + βRZi + XiγR + VRi\nif Zi affects Ri, we expect βR to be significant (otherwise, this is not a good instru\nment!)\nWhat is the name of this regression?\nForm the variable:\nRˆi = λˆR + βˆRZi + XiγˆR\n\n2. Run the regression:\nlog(yi) = μ + αRˆi + Xiγ + i\nWhat is the name of this regression\nIs Rˆi correlated with i?\nTo see this, replace Rˆi:\nlog(yi) = μ + α[λˆR + βˆRZi + XiγˆR] + Xiγ + i\nBy assumption,\n- Zi and i are not correlated.\n- Xi and i are not correlated.\nThe main idea is that we are using only the part of the variation in Ri which is close to\nZi, and therefore is not correlated with the error term. The method is called 2 stage least\nsquares because we are running the regression in two stages (1 and 2).\nAlternatively, we could run the reduced form equation\nlog(yi) = η0 + η1Zi + Xiη2 + UI\nη0 =\nη1 =\nη2 =\nHow can we obtain an estimate of α if we have only one instrument?\nUsing early settlers' mortality as an instrument for the\nquality of institutions\n1. In former colonies, current institutions are better in places where early institutions\nwere better.\n2. In colonies, institutions were of better quality when European settlers decided to stay\nin the country and establish themselves there, instead of just using the country to\nmake money.\nExamples of countries where Europeans settled:\n\n-\n-\n-\n-\nExamples of countries where Europeans did not settle but just set up an extractive\nstate:\n-\n-\n-\n3. The mortality of early settlers was an important determinant in the decision of Eu\nropeans to establish themselves in the place.\nThis is summarized in the following expressions:\nlog yi = μ + αRi + Xiγ + i\n(1)\nRi = λR + βRCi + XiγR + VRi\n(2)\nCi = λc + βcSi + Xiγc + Vci\n(3)\nSi = λs + βs log(Mi) + Xiγs + Vsi\n(4)\nuse log(Mi) as an instrument for Ri in equation (1).\n→\nWe can also check the intermediate steps by using log(Mi) as an instrument for Si in\nequation (3), and Ci in equation (2).\nData and results\n- Data on early mortality, from a historian who used military records.\nMain causes of death of bishops and soldiers (except war):\n- Data on early institutions: constraints on executives in 1900. (goes from 1 to 10,\nwith 10 being better)\n- Data on number of Europeans in 1900.\n\n- Data on current institutions.\nResults\n- βs =\n- βc = (using log(Mi) as an instrument)\n- βR = (using log(Mi) as an instrument)\n- Table 4: Main results\n∗ First stage:\nRi = λR + βR log(Mi) + XiγR + ViR\nβR =\n∗ Second stage equation\nα =\n- What are the potential problems with the strategy:\n∗\n∗\nConclusion: if we gave Zaire the institutions of the US, Zaire would be 5 times richer!\nA more specific look at the question: The impact of Colo\nnial Institutions in India\nExamines the long term impact of institutions in India. Most of India was colonized by\nthe British, but they used different types of technology to collect land taxes (the major\nsource of revenue for the British):\n1. The landord, or zamindari system asked a landlord to collect taxes on behalf of the\nBritish (have you seen Lagaan?). Landlords could collect as much as they wanted\nand any extra was theirs to keep.\n\n2. The individual responsibility, or raiyatwari system asked the farmers to arrange be\ntween themselves to collect the taxes. There also existed a village-based system quite\nsimilar.\nThere are many reasons why a system put in place during a colonial period may persist\nlong after independence.\n-\n-\n-\n-\nThe British's idea about what system was better evolved over time, so that different places\nin India who were colonized at different times have different institutions, even within\ncurrent states.\nSee Map.\nSee Figure 4: dates of conquest determines in part time of governance: places colonized\nbetween 1820 and 1856 more likely to have a non-landlord system.\nStill correlated with yield today!!\nCan look at OLS (compare non-landlord/landlord area) and IV, using as instrument the\ndate of conquest.\nConclusion: Even today, yields are higher in non-landlord districts. Very persistent effects\nof long-run institutions."
    },
    {
      "category": "Resource",
      "title": "Credit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/c0937f5f54ce7603b984b001a2d74387_MIT14_74s09_lec22.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n14.74 Foundations of Development Policy\n\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nCredit\nEsther Duflo\n14.74\nMay 4 and May 6, 2009\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nIntroduction\nIntroduction: Lending to the Poor\n▶In the 1970s and early 1980s, many had given up hope on\ngiving credit to the poor and being repaid.\n▶Some governments were continuing subsidized credit programs\nto the poor, which functioned almost like free transfers\nprograms. For example, in India:\n▶Mandated bank branch expansion in rural areas helped reduce\npoverty (Robin Burgess and Rohini Pande), but the default\nrate is 42%, and it cost $2.72 to increase income by $1.\n▶Loans are used for political purpose: Shawn Cole shows that\nagricultural credit increases by 5%-10% in election years,\nespecially in districts where elections are close. These extra\nloans are not productive.\n▶Yet, informal credit institutions have always existed: village\nmoneylenders; Rotating Credit and Savings Associations;\nmutual credit and insurance arrangements.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nIntroduction\nIntroduction: The Microfinance Revolution\n▶In 1976, Mohammed Yunus created the Grameen Bank: an\ninstitution which made small loans to poor women.\n▶Microcredit has expanded as a worldwide phenomenon:\nToday, $25 billion outstanding, 150-200 million clients; high\nrepayment rates. Many microfinance institutions are\nprofitable. Some are very profitable.\n▶Mohammed Yunus and the Grameen Bank won the Nobel\nPeace Prize.\n▶Compartamos, a Mexican MFI.\n▶Microfinance institutions try to also provide a broader set of\nfinancial services, beyond traditional group lending: larger\nindividual loans; savings; insurance.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nIntroduction\nIntroduction: The Questions\nToday we will try to understand:\n1. Why lending to the poor may be difficult,\n▶and to what extent are those difficulties serious;\n2. What innovation did the \"microfinance\" revolution introduce\nto overcome those difficulties,\n▶and to what extent are those innovations responsible for the\nability of microfinance institutions to lend and be reimbursed;\n3. Whether microcredit really helps the poor, and if so how;\n4. Other financial services the poor may need: ( savings,\ninsurance), and their impact.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nThe Barriers to Credit\n1. Informational asymmetries\n▶Moral hazard: the monitoring cost multiplier.\n▶Adverse selection.\n2. Lending to the poor is costly. Their rates of return are too\nlow.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nCredit markets: some facts\n▶Sizeable gap between lending rates and deposit rates within\nthe same sub-economy\n▶Extreme variability in the interest rate within the same\nsub-economy:\n▶Low levels of default:\n▶There seems to be ex ante competition in the markets\n▶Production and trade finance are the main reasons given for\nborrowing, even in cases where the rate of interest is relatively\nhigh\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nThe neo-classical model of the capital market\n▶Everyone faces the same interest rate, adjusted for risk. i.e. if\nthere is a d% risk of default then (1 -d)r (where r is the\ngross interest rate) is a constant.\n▶The interest rate paid to depositors is equal to (1 -d)r less\nsome small change for the cost of operating a bank.\n▶The expected marginal product of capital should be equated\nto (1 -d)r.\n▶This cannot explain any of these facts!\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nA simple model of the credit market\n▶Loan repayment is imperfectly enforceable.\n▶Suppose k dollars invested yields a gross return F(k) and that\nthe gross interest rate is r. A borrower who has a wealth of w\nand invests k will need to borrow k -w. He is supposed to\nrepay (k -w)r at the end of the period.\n▶But by expending some resources, which we assume to be\nproportional to the size of the investment, he can avoid\nrepayment altogether. We denote the constant of\nproportionality by η and assume that it is less than the cost of\ncapital, ρ.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\n▶Lenders will only provide finance up to the point where the\nborrower has the incentive to repay: this requires F(k)-\nr(k -w) ≥F(k) -ηk which gives us:\nk\nw =\nr\nr -η ≡λ(r, η).\n▶Firms are credit rationed. They cannot borrow as much as\nthey want.\n▶The amount you can borrow is increasing in your wealth and\nyour η but decreasing in the interest rate.\n▶The interest rate is equal to the cost of capital. It obviously\ndoes not vary across borrowers.\n▶This is a handy model but does not fit the facts.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nExtending the model: 1\n▶It is natural to assume that the lender needs to spend\nresources in order to make the borrower want to repay. In\nother words, η = 0 unless the lender spends some resources.\n▶First let monitoring cost be linear in the amount borrowed:\nφ(k -w).\n▶In this case\nr(k -w)\n=\nρ(k -w) + φ(k -w)\nr\n=\nρ + φ\n▶r will only vary to the extent that φ or ρ varies.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nExtending the model: 2\n▶Let monitoring be a variable cost, φ per unit of ηk, i.e. the\ncost does not depend on the amount borrowed but on amount\ninvested.\n▶Under the assumption of competition, the lender just breaks\neven:\nr(k -w) = ρ(k -w) + φηk\n▶For any credit constrained borrower, k =\nr\nr-ηw, which implies\nthat\nr = ρ + φr =\nρ\n1 -φ.\n▶Aleem calculates φr to be 50 cents per dollar lent on average,\neasily explaining the gap between the 32.5% cost of capital\nand the 78.5% average interest rate in this data.\n▶For this φ needs to be about 0.6\n▶Does not explain exclusion\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nExtending the model: 3\n▶Let the monitoring cost be a fixed cost φ\n▶Then the lender's zero profit condition is\nr(k -w) = ρ(k -w) + φ\n▶In the model without default, the borrower's IC constraint is\nnow given by\nr(k -w) = ηk\nwhich together give us\nρ(k -w) + φ = ηk\n▶We can rewrite this in the form k = ρw-φ\nρ-η . What if ρw < φ?Is\nthis necessarily more than w?\n▶Multiplier property.:\nr = ρ + φ(ρ -η)\nηw -φ\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nImplications of the model\n▶Can explain a large wedge between the cost of capital and the\ninterest rate and by implication a very high monitoring cost.\n▶The interest rate can be very sensitive to the cost of capital\nand the monitoring cost, if 1-φ is small\n▶The interest rate will be especially sensitive where the interest\nrate is high relative to the cost of capital\n▶However we do not explain equilibrium default.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nSome Policy Implications\n▶What is the total amount lent?\n▶In the model without default, the borrower's IC constraint is\nnow given by\nr(k -w) = ηk\nwhile the lender's zero profit condition is\nr(k -w) = ρ(k -w) + φ\nwhich together give us\nρ(k -w) + φ = ηk\nor\nk = ρw -φ\nρ -η\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\n▶One dollar subsidy to monitoring costs reduces φ by ρ dollars\n(since we assume monitoring costs are paid at the end of the\nperiod) which increases the amount of resources going to the\npoor by\nρ\nρ-η > 1 dollars.\n▶Keeping the interest rate fixed, the effect of $1 subsidy would\nhave been\nr\nr-η <\nρ\nρ-η. The mutiplier adds to the leverage,\nespecially when monitoring is expensive.\n▶Cutting monitoring costs is the raison d'etre of the\nmicro-credit movement.\n▶Note however that one dollar subsidy to wealth (w) would\nhave the same effect.\n▶However this is only true for those who have ηw -φ > 0.\n▶Those who have ηw -φ < 0, start out unable to borrow.\n▶This may be why some micro-credit organizations insist on\nsavings as a way into borrowing (especially under the self-help\ngroup model): Helping them save may be way to subsidize\nbuilding wealth.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Barriers to Credit\nHow Serious Are Those Constraints?\nIf moral hazard are real, the credit market can lead to a poverty\ntrap, at the individual level and at the societal level. Another\nproblem may be adverse selection: high interest rates may\ndiscourage people who are planning to repay, and encourage people\nwho have low cost of default and were planning to default anyway.\nHow serious are they?\n1. Are market interest rates higher than the profits the poor\ncould make with their businesses?\n2. Do high interest rates increase adverse selection?\n3. Do high interest rates increase ex-post default?\n4. Is there moral hazard in the credit market?\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nThe High Interest Rate\n▶Interest rates will be highly sensitive to the cost of monitoring\nand the cost of funds: They are highly variable. Many\nexamples: e.g., interest rates in Pakistani villages can vary\nfrom 2% to 150% (Irfan Aleem).\n▶The poor borrow less and pay higher interest rates. Interest\nrate on daily loans for vegetable and fruit vendors in India can\nbe up to 5% per day (Dean Karlan and Sendhil Mulainathan).\n▶Interest rates of 3% to 4% per month are common.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nHigh Interest Rates and the Demand for Credit\nAre the poor excluding themselves from the credit market because\nthe rate of return on their projects won't be very high?\n▶Prima facie does not seem to be the case: The poor borrow at\nthose rates. Furthermore, in informal markets, defaults are\nrare, and most loans appear to be taken for productive\npurposes.\n▶However it could be that only those with high rates of return\nagree to borrow: Average rates could still be lower (but still\nhigher than a \"reasonable\" interest rate).\n▶More direct evidence on returns to capital is given by an\nexperiment in Sri Lanka.\n▶More direct evidence on elasticity of demand of credit to\ninterest rate is given by an experiment in South Africa.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nThe Returns to Capital for Micro-Entrepreneurs: Sri Lanka\n▶A study by Suresh de Mel, David McKenzie and Christopher\nWoodruff\n▶Starting from a census, identified 405 households which had a\nsmall business (retail or manufacturing), with less than $1,000\nin fixed capital (excluding land and building).\n▶Most of the firms have very little in the way of assets (about\n$100 in machinery or stock).\n▶Conducted a survey and offered, as an encouragement to\nparticipate in the survey, a random prize drawing:\n▶Prize was a small grant ($100 or $200) either in cash or kind\nof asset, or stock. $100 is equivalent to 3 to 6 months profit.\nCash grants were unrestricted.\n▶Follow-up survey data was collected on all firms.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nResults\n▶Treatment increased real monthly business profit by 5.7% on\naverage: very high returns, greater than the monthly interest\nrates observed in urban area.\n▶Return decrease steeply: $200 led to no more profit than\n$100.\nFigure\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nNet Profit in Follow-up Waves (Rupees)\nwithout grant\nwith 10 000 Rs grant\nwith 20 000 Rs grant\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nHow Sensitive is the Demand for Credit to Interest Rates?\n▶Thus, the poor have profitable investment opportunities: They\nshould be willing to borrow, even at high interest rates.\n▶What is their sensitivity to interest rates?\n▶To find it out, Dean Karlan and Jonathan Zinman worked\nwith a consumer credit firm in South Africa.\n▶Average interest rate: between 7.75% and 11.75% depending\non risk class.\n▶Bank sent letter to offer credit at a specific rate to over\n55,000 former clients.\n▶Both interest rate and suggested reimbursement duration were\nrandomized:\n▶Offer rates were randomized (96% below usual rate, 4%\nabove).\n▶The suggested loan maturity was also randomized (although it\nwas not binding: They could choose another maturity when\nthe applied).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nThe Sensitivity of Credit Demand with Respect to Prices\n\nConfidence\nIntervals\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nResults\n▶Within a limit, clients are not very sensitive to interest rates\nvariation: Reducing interest rate by 1% from current level\nwould increase take-up of credit by 0.3 percent (take-up of\ncredit: 8%).\n▶Clients more sensitive to interest rate increase: Institution\nprobably prices at optimal level.\n▶Similar results for loan size.\n▶Sensitivity to repayment duration is much larger: Increasing\nsuggested duration of reimbursement by 1 month increase\ntake-up by about 15%.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nA (Serious) Caveat: Do Clients Really Understand the\nInterest Rate?\n▶Some microfinance institutions charge very high interest rates.\nCompartamos in Mexico: 100% a year.\n▶Yunus spoke very strongly against those organizations: \"They\nare no better than the moneylenders we tried to displace.\"\n▶Answer commonly given by institutions who charge a high\nrate: But if clients are willing to borrow at these rates, why\nwouldn't we lend it to them at that rate?\n▶This implies that they understand interest rates. This is not\nobvious: They are often not very clearly presented. For\nexample, MFI in India presents interest rates as \"flat\" (the\ninterest payment always stays the same even as the balance\ndecline: Interest rate is effectively double the stated interest\nrate).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nWhat Do Clients Pay Attention To?\n▶To test the power of marketing manipulation, the South\nAfrican Bank varied at the same time the price of the offer\nand other aspects of the offer letter (such randomizations are\nvery common in marketing):\n1. Photo: no photo, man, woman;\n2. Language affinity (\"we speak your language\"),\n3. \"Special rate,\" \"low rate,\" no blurb;\n4. Suggested use;\n5. Number of suggested maturities and loan sizes;\n6. Interest rate explicitly disclosed, or client needs to infer from\nexample loans;\n7. Comparison with competition: loss frame (if you borrow with\nothers you will pay more), or gain frame (if you borrow with us\nyou will pay less); and\n8. Cell phone raffle.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\n\nImage removed due to copyright restrictions.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Interest Rates\nResults\n▶Taken jointly, these manipulations affect demand.\n▶Three manipulations that have a large impact:\n▶Photo: Female photo increases loan take up by 0.4% (more\nthan reducing interest rate by 1 percentage point, e.g., 8% to\n7% per month);\n▶Not giving a specific use increases take up by 0.6% (equal to a\n2 percentage points reduction in interest rate); and\n▶Proposing only one example increases take up by 0.7% (more\nthan a 2 percentage points reduction in interest rate).\n▶Thus, while it is difficult to predict ex-post what will matter,\nsome seemingly irrelevant manipulations matter as much as\nthe interest rate. This suggests that client awareness may be\nlimited (and we don't fully understand credit demand).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nHow Serious Are Those Constraints?\nIf moral hazard and adverse selection constraints are real, the\ncredit market can lead to a poverty trap, at the individual level and\nat the societal level.\nHow serious are they?\n1. Are market interest rates higher than the profits the poor\ncould make with their businesses?\n▶Not really: High returns to capital; low sensitivity to interest\nrates: interest rates can be high.\n2. Do high interest rates increase adverse selection?\n3. Do high interest rates increase ex-post default?\n4. Is there moral hazard in the credit market?\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\n\"Observing Unobservables\"\n▶How can we identify moral hazard and adverse selection?\n▶By definition they are hidden...we cannot measure it directly\n(or the bank would do it themselves!).\n▶Creative experimental design by Dean Karlan and Jonathan\nZinman (with the same South African lender) allows us to\nmake progress on this question.\n▶Experimental design builds on the previous randomization\n(randomization of an interest rate offer to different people).\n▶We know that those who receive a higher offer are\n(somewhat) less likely to borrow.\n▶Do they reimburse less? Yes.\n▶Proportion of loan passed due (after maturity):\n▶10.5% for those who receive a high offer, and borrow at high\nrate.\n▶8.2% for those who receive a low offer, and borrow at low rate.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nMoral Hazard or Adverse Selection\n▶It could be because of adverse selection: Those who agree to\nborrow at high rates are those who were not planning to repay\nanyway.\n▶Or it could be due to the effect of the interest rate paid,\nbecause of:\n▶Moral Hazard.\n▶Repayment burden.\n▶Usual identification problem... but here we are directly\ninterested in selection effects.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nThe Solution\n▶When client comes into the bank, computer sometimes\nrandomly offers a lower rate.\n▶Two clients may therefore have faced different offer rate, but\nend up with the same offer rate: selection effect.\n▶Two clients may have faced the same offer rate, but end up\nwith different offer rate: \"treatment\" effect of the interest rate.\n▶To identify moral hazard from other ex-post effects, among\nclients who have a low rate:\n▶Some get to keep it only for this loan.\n▶Some get to keep it for future loan if they repay on time.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nExperimental Design\n\nHigh Contract Rate\n\nHigh Offer Rate\n\nLow Offer Rate\nN/A\n\nAdverse selection\n!\nRepayment burden\n\"\n#\n$\n%\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nResults\n0.1225\nlowest offer rate and\nrealized rate\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nResults\n0.1225\n0.1275\nlowest offer rate and\nrealized rate\n1 percentage point\nincrease in offer rate\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nResults\n0.1225\n0.1275\n0.1275\nlowest offer rate and\nrealized rate\n1 percentage point\nincrease in offer rate\n1 percentage point\nincrease in realized\nrate\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nResults\n0.1225\n0.1275\n0.1275\n0.1035\nlowest offer rate and\nrealized rate\n1 percentage point\nincrease in offer rate\n1 percentage point\nincrease in realized\nrate\ndynamic incentive\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nAssessing the Constraints: Moral Hazard and Adverse Selection\nHow Serious Are Those Constraints?\nIf moral hazard and adverse selection constraints are real, the\ncredit market can lead to a poverty trap, at the individual level and\nat the societal level.\nHow serious are they?\n1. Are market interest rates higher than the profits the poor\ncould make with their businesses?\n▶Not really: High returns to capital; low sensitivity to interest\nrates: interest rates can be high.\n2. Do high interest rates increase adverse selection?\n▶No evidence\n3. Do high interest rates increase ex-post default?\n▶No evidence\n4. Is there moral hazard in the credit market?\n▶Yes: Dynamic incentives improve repayment.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nHow Microfinance Solves the Moral Hazard Problem\nDefault rates in microfinance are extremely low (less than 2%).\nThe \"canonical\" model of microcredit (Grameen Bank) has the\nfollowing elements: (adopted or not by other MFIs) (Jonathan\nMorduch and Beatriz Armendariz de Aghion)\n1. Lends almost only to women.\n2. Weekly repayment schedule.\n3. Group lending (5 to 10 women who know each other), with\njoint liability.\n4. Regular meetings, where members forge bonds and other\nthings can be discussed (business advice, home advice).\n5. Very small loans initially, which become larger over time.\n6. Extensive monitoring by credit officers who are not very well\npaid and work very hard, with incentives based on number of\nclients, and repayment rates.\n7. High interest rates (at least 20% a year, often much more).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nHow Microfinance Solves the Moral Hazard Problem\n1. Lends almost only to women.\n2. Weekly repayment schedule.\n3. Group lending (5 to 10 women who know each other), with\njoint liability.\n4. Regular meetings, where members forge bonds and other\nthings can be discussed (business advice, home advice).\n5. Very small loans initially, which become larger over time.\n6. Extensive monitoring by credit officers who are not very well\npaid and work very hard, with incentives based on number of\nclients, and repayment rates.\n7. High interest rates (at least 20% a year, often much more).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nLending to Women\nMotivations for focus on women:\n1. Women are (intrinsically) more reliable.\n2. Social goal: Lending to women may improve women's power\nin the household (which is an objective in itself and could also\nhave consequences within the household).\n3. Women are more likely to have no other access to credit: may\nhave higher return.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nLending to Women\n▶There is no experimental evidence on the first point yet\n(whether women are less likely to default).\n▶We will return to the second point later, when we discuss the\nimpact of getting a microcredit loan on household life.\n▶On the third point, we have the evidence from the experiment\nin Sri Lanka.\nResults\n▶Surprising results: Women's marginal product of the loan is\nabout zero!\n▶Why is that?\n▶The smaller loans are not invested in the business.\n▶The larger loans are invested in the business, but women are\noften in less profitable industries.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nLending to Women\n▶There is no experimental evidence on the first point yet\n(whether women are less likely to default).\n▶We will return to the second point later, when we discuss the\nimpact of getting a microcredit loan on household life.\n▶On the third point, we have the evidence from the experiment\nin Sri Lanka.\nResults\n▶Surprising results: Women's marginal product of the loan is\nabout zero!\n▶Why is that?\n▶The smaller loans are not invested in the business.\n▶The larger loans are invested in the business, but women are\noften in less profitable industries.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nReturns to Capital for Men\nwithout grant\nwith 10 000 Rs grant\nwith 20 000 Rs grant\nmen\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nReturns to Capital for Men...and Women\nwithout grant\nwith 10 000 Rs grant\nwith 20 000 Rs grant\nmen\nwomen\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nLending to Women\nThe Puzzle of Low Returns for Women\n▶Low returns to capital for women have been found in other\nsettings:\n▶Christopher Udry: agricultural productivity in Burkina Faso.\n▶Christopher Udry and Markus Goldstein: agricultural\nproductivity in Ghana.\n▶This suggests intra-household inefficiencies: If households\nwere efficient, money should always be put towards its most\nefficient use within the household.\n▶This also suggests that small household businesses (especially\nowned by women) may not always try to maximize\nproductivity, but may have other goals: e.g., a little extra\nincome while mother watches children.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nRepayment Schedules\nHow Microfinance Solves the Moral Hazard Problem\n1. Lends almost only to women.\n2. Weekly repayment schedule.\n3. Group lending (5 to 10 women who know each other), with\njoint liability.\n4. Regular meetings, where members forge bonds and other\nthings can be discussed (business advice, home advice).\n5. Very small loans initially, which become larger over time.\n6. Extensive monitoring by credit officers who are not very well\npaid and work very hard, with incentives based on number of\nclients, and repayment rates.\n7. High interest rates (at least 20% a year, often much more)\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nRepayment Schedules\nWeekly Repayment Schedule\n▶Many MFIs are convinced that a regular repayment schedule\nstarting immediately is essential for repayment: it provides\ndiscipline, and it is easier for clients to save a small amount\ntowards weekly repayment, rather than large amounts.\n▶In contrast, many potential clients say they are discouraged\nfrom weekly repayment by both the schedule (not appropriate\nto all activities, e.g., cow rearing), and meetings (time\nconsuming).\n▶Erica Field and Rohini Pande set up a study to test this with\nan MFI in Kolkata (West Bengal, India).\n▶After joining the organization, 100 groups were randomized by\npublic lottery into:\n▶Regular (weekly) repayment schedule.\n▶Monthly repayment schedule with monthly meetings.\n▶Monthly repayment schedule with weekly meetings.\n▶On time repayment was as high in monthly and weekly.\nFigure\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nRepayment Schedules\nProportion of Loans Fully Repaid within 54 Weeks\n0.985\n0.973\n0.976\nmonthly payment, monthly\nmeeting\nmonthly payment, weekly\nmeeting\nweekly payment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nRepayment Schedules\nHow Microfinance Solves the Moral Hazard Problem\n1. Lends almost only to women.\n2. Weekly repayment schedule.\n3. Group lending (5 to 10 women who know each other), with\njoint liability.\n4. Regular meetings, where members forge bonds and other\nthings can be discussed (business advice, home advice).\n5. Very small loans initially, which become larger over time.\n6. Extensive monitoring by credit officers who are not very well\npaid and work very hard, with incentives based on number of\nclients, and repayment rates.\n7. High interest rates (at least 20% a year, often much more),\nwhich allows them to be financially sustainable (or close)\ndespite high operating costs.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nGroup Lending with Joint Liability\n▶This is probably the feature of microcredit which has\nattracted the most attention: Women are responsible for each\nother's loan (they cannot borrow again if the group does not\nreimburse).\n▶Two potential beneficial effects:\n▶A screening effect: Women will only want to join other reliable\nwomen (Maitreesh Ghatak).\n▶A monitoring effect: Women will monitor each other (for free).\n▶Yet, it has drawbacks: it may create excessive pressure, and\ndiscourage some clients from borrowing.\n▶Many microfinance organizations are quietly moving away\nfrom it. Even Grameen Bank does not practice joint liability\nany more, but \"group lending with individual liability:\" the\ngroup.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nTesting the Role of Joint Liability\n▶Dean Karlan, Xavier Gine, and Jonathan Zinman: Philippines\n▶In 2004-2005, after group formation, Green Bank of Caraga\nconverted 56 centers (randomly selected out of 106) from\njoint liability to individual liability. Weekly group meetings still\nheld, but now people are not jointly responsible: pure\nmonitoring effect.\n▶Three years later: Percent in default (or delay in repayment)\nis exactly the same in both type of center.\n▶Green Bank then randomly selected different areas to\nimplement from the start (selection and monitoring effects):\n▶Group liability;\n▶Individual liability (still grouped based); and\n▶Staggered: First loan cycle is group, and then individual\nonwards, if repayment was high.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nTesting the Role of Joint Liability: Results\n1.9%\n1.8%\n3.0%\n1.0%\n4.0%\n1.4%\nGroup liability\nIndividual liability\nStaggered\nIndividual\nGroup liability\nIndividual liability\nStaggered\nIndividual\nFirst cycle only\nSecond cycle and after\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nHow Microfinance Solves the Moral Hazard Problem\n1. Lends almost only to women.\n2. Weekly repayment schedule.\n3. Group lending (5 to 10 women who know each other), with\njoint liability.\n4. Regular meetings, where members forge bonds and other\nthings can be discussed (business advice, home advice).\n5. Very small loans initially, which become larger over time.\n6. Extensive monitoring by credit officers who are not very well\npaid and work very hard, with incentives based on number of\nclients, and repayment rates.\n7. High interest rates (at least 20% a year, often much more),\nwhich allows them to be financially sustainable (or close)\ndespite high operating costs.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nSocial Capital\n▶The group structure could still be important for microcredit,\nas a support and reputation structure.\n▶\"Social Capital\" (Robert Putnam): web of interactions which\nexist between people, and help them achieve better outcomes\nthrough mutual cooperation.\n▶A study by Dean Karlan with FINCA Peru.\n▶Natural experiment: in Ayacucho, Peru, FINCA assigns\nindividuals to groups quasi-randomly, in the order in which\nthey visit the office to join.\n▶Group members may live close or far; may be from same or\ndifferent culture.\n▶Results, focusing on people who came uninvited:\n▶Default is lower when more members live close by.\n▶Default is lower when more members have the same culture.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nSocial Capital and Group Meetings\n▶The regular meetings may favor social interactions, and social\ncapital.\n▶This can be checked in the Field-Pande experiment in Kolkata\nthat we saw earlier: In groups with monthly meetings, was\nsocial capital lower relative to the groups with weekly\nmeetings?\nResults\n▶Much more contact between the members of weekly groups.\n▶More solidarity: When VWS organized a lottery, and offered\ngroup members a chance to give away some ticket to\nmembers of their group (thus reducing the chance that the\nindividual wins, but improving the chance that someone from\nthe group wins), members of weekly groups were more likely\nto give tickets away to members of their group.\n▶Social capital valuable in itself.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\n0.031\n0.034\n0.044\nNumber of members who\nvisited me in my home\nNumber of members I\nvisited in their homes\nPeople for whom I know\nnames of family members\nMonthly loan repayment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\n0.031\n0.034\n0.044\n0.544\n0.547\n0.724\nNumber of members who\nvisited me in my home\nNumber of members I\nvisited in their homes\nPeople for whom I know\nnames of family members\nMonthly loan repayment\nWeekly loan repayment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nGroup Lending\nTaking Stock: What Explains the Success of Microfinance?\n▶The features of microcredit that have most attracted interest\nmay not in fact be the most important ones. Microcredit may\nwork on relatively old-fashioned principles:\n▶When legally possible, MFIs require clients to save,\nprogressively building up a collateral.\n▶Promise of future loans for people who have no other source\nof credit, or at least not at good interest rates (like in the\nSouth Africa experiment).\n▶Role of credit officers who are given strong incentives to\nmonitor reimbursement.\n▶High cost of monitoring and high interest rates, but lower\nthan what the clients could get elsewhere.\n▶As microfinance grows, competition between agencies may\ncause problems: The strength of the threat to be cut out of\ncredit will be less strong if someone else can pick up the client.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nThe Impact of Microcredit\n▶Does microcredit really help the poor?\n▶Surprisingly, in contrast to the vibrant research on why it\nworks which we just reviewed, we still have very little evidence\non this question.\n▶For a long time, microcredit organizations refused to ask the\nquestion of impact.\n▶The reasoning was as follows. Since we are profitable, we are\nlike any other business: As long as we have clients, they must\nget some value out of coming back, and since we don't\nrequire any funding, we don't need to be accountable to\nanyone but the clients.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nThe Necessity to Evaluate Impacts\nThere are two flaws in this reasoning:\n▶First, while there are some profitable microcredit\norganizations, many are not, in particular when they lend to\nthe very poorest. There are also hidden subsidies (salaries,\nfunds to start up, etc.). While some venture capitalists make\nmoney by lending to microcredit organizations, as an industry,\nmicrofinance receives considerable subsidies.\n▶Spending resources to lend to the poor is not a problem. We\njust need to be sure that benefits are higher than costs.\n▶Second, many now realize that the fact that clients borrow\nfrom microfinance organizations does not mean that this is\ngood for them. Poor information, bounded rationality, may\nlead some clients to fall into debt traps: The impact may be\nnegative.\n▶Example: confrontation in Andhra Pradesh between MFI and\nGovernment.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nMicrocredit: Evidence from Urban India\n▶This is the first randomized evaluation of a regular microcredit\nprogram.\n▶A study by Abhijit Banerjee, Esther Duflo, Rachel Glennerster,\nand Cynthia Kinnan.\n▶The partner organization, Spandana, works mainly in eight\nstates, but mainly in South India, particularly Andhra Pradesh.\n▶At the time the project started, it had not yet started working\nin Hyderabad, Andhra Pradesh's capital.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nEvaluation Design\n▶A Spandana team visited Hyderabad, and identified 120 small\nneighborhoods where they were willing to start working right\naway, but also willing to wait.\n▶Prior to randomization, realized that 16 slums were not\nsuitable for microfinance.\n▶In remaining 104 slums, selected half treatment: operations to\nstart right away; half control: operations would start after two\nyears.\n▶Other MFIs were already present, or about to enter, in those\nslums as well.\n▶Baseline survey of 20 households per slum; endline of up to\n100 households per slum, at least two years after Spandana\nstarted to operate in the slum.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nSpandana\n▶One of the fastest growing microfinance organizations in India.\n▶Founded in 1997 by Padmaja Reddy, it now has over 2 million\nclients in 8 States, and $297 million outstanding.\n▶Its main product is a standard, Grameen inspired, group\nlending product:\n▶Eligible women: age 18-55, able bodied, lived at least 3 years\nin the slum, owner.\n▶Groups of 10 women organized in center of 50, joint liability.\n▶Starting loan Rs 10,000 (roughly $200).\n▶Weekly repayment over a year: (principal+interest)/52.\n▶Interest Rates varied over the period, but on average 24% per\nyear.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Spandana Evaluation: First Randomized Impact Evaluation of Microcredit\nA Profile of Spandana's Potential Clients: Findings from\nthe Baseline\n▶The average family is a family of 5, with monthly expenditure\nof Rs 5,000.\n▶Poor, but not ultra poor: Only 6% of these households live\nunder a dollar a day per member, but 47% live under 2 dollars\na day.\n▶98% of the 7 to 11 year olds, and 84% of the 12 to 15 year\nolds are in school.\n▶31% of the households have a business, many have more than\none.\n▶Most of these businesses are,\n▶Not specialized (25% stores or fruitsellers);\n▶Small: only 10% have any employee. None have more than\nthree. Sales: Rs 13,000 per month; and\n▶Very little assets: 20% use nothing. Most common asset:\ntable, chair, scale.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nTake-up of Microfinance Loans: Level and Reasons\nTake-up of Microfinance Loans\n▶At baseline, 69% of the households have debt, 49% of the\nloans are from moneylenders. Average interest rate 3.84% a\nmonth.\n▶Most of these loans were not taken for the business.\n▶Take-up of micro-finance:\nFigure\n▶A first lesson from this evaluation (and others on-going) is\nthat while microcredit has many clients, penetration is less\ndeep then often suggested: Overall take-up is 35%.\n▶Despite the presence of the other MFIs, Spandana's presence\nsignificantly increases the probability of microfinance\nborrowing (8.3% more borrowers; Rs 1,260 higher debt from\nmicrofinance).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nTake-up of Microfinance Loans: Level and Reasons\nTake-up of Microfinance Loans\nOther MFI only,\n13%\nOther MFI only,\n8%\nSpandana, 5%\nSpandana, 19%\nControl\nTreatment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nTake-up of Microfinance Loans: Level and Reasons\nWhat Should We Expect?\n▶Main reason to take up a loan (self-reported):\n▶Start a new business (30%).\n▶Repay an old loan (30%).\n▶Expand business (22%).\n▶So there should be three groups of households:\n▶Those who already had a business, who can expand it. If the\nreturn to capital is high (as in Sri Lanka), their consumption\nshould increase.\n▶Those who take a loan to start a business: If there is a fixed\ncost to start a new business, we may see their consumption fall\nat first.\n▶Those who do not start a business, but repay an old loan:\nTheir consumption could increase right away.\n▶Non-economic outcomes: education, health, women's power.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nOverall Results\n▶We cannot compare Spandana's clients to others: While\nmicrocredit was randomly introduced in half the slums, those\nwho decide to take a Spandana loan are clearly different, and\nwe do not know who to compare them with in the treatment\nslum. Instead, we are comparing outcomes among everyone in\nthe treatment slums, and everyone in the control slums.\n▶More new businesses were created in treatment slums.\nFigure\n▶Overall consumption per capita did not increase significantly,\nhowever:\n▶Durable consumption increased.\n▶Consumption of \"temptation\" goods (cigarettes, alcohol, tea\nand snacks) declined.\nFigure\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nOverall Results\n▶We cannot compare Spandana's clients to others: While\nmicrocredit was randomly introduced in half the slums, those\nwho decide to take a Spandana loan are clearly different, and\nwe do not know who to compare them with in the treatment\nslum. Instead, we are comparing outcomes among everyone in\nthe treatment slums, and everyone in the control slums.\n▶More new businesses were created in treatment slums.\nFigure\n▶Overall consumption per capita did not increase significantly,\nhowever:\n▶Durable consumption increased.\n▶Consumption of \"temptation\" goods (cigarettes, alcohol, tea\nand snacks) declined.\nFigure\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nBusiness Creation\n5.3%\n6.9%\nControl\nTreatment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nBusiness Creation due to Spandana Loans\n▶If we assume that Spandana's presence has no effect on\nstarting a business for those who did not take a loan, the\ndifference between treatment and control slum is due entirely\nto the 13% of people who took a Spandana loan.\n▶Effect of getting a loan on starting a business is 1.6%\n13% = 12%.\nFigure\n▶This estimate of the Spandana loan on business creation is\nthe effect of getting a loan on starting a business for people\nwho would like to take a loan if it were available to them.\n▶It would be an over-estimate if the presence of Spandana also\ninduced some who did not take a loan to start a business (for\nexample, due to social learning) or an under-estimate if the\npresence of Spandana discouraged some who did not take a\nloan to start a business (for example, due to competition).\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nEffect of Spandana Loan on Business Creation\n17.3%\n4,7%\nNo Spandana loan\nWith Spandana Loan\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nConsumption Effect: Overall Sample\n1304 1317.6\n5,3\nNon Durable\nConsumption\nDurables\nBusiness Durables\nTemptation goods\nControl\nTreatment\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nConsumption Effect: By type of individual\n-15\n-20\n-7\n-2\nNon Durable\nConsumption\nDurables\nBusiness Durables\nTemptation goods\nPrevious Business owner\nLeast likely to start a new business\nMore likely to start a new business\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nUnderstanding the Effects\n▶Spandana helps some to get out of expensive loans: The\ndifference in interest payment can then be consumed.\n▶Spandana helps some borrowers purchase assets (for home or\nthe business), and then they tighten their belt to reimburse\nthe weekly amount: cut down in \"un-necessary' expenses.\n▶Is there a broader change in household behavior?\n▶No impact on boys' education, girls' education, boys' health,\ngirls' health, expenditure on health and education, nor\nwomen's decision making power.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nUnderstanding the Effects\n▶Spandana helps some to get out of expensive loans: The\ndifference in interest payment can then be consumed.\n▶Spandana helps some borrowers purchase assets (for home or\nthe business), and then they tighten their belt to reimburse\nthe weekly amount: cut down in \"un-necessary' expenses.\n▶Is there a broader change in household behavior?\n▶No impact on boys' education, girls' education, boys' health,\ngirls' health, expenditure on health and education, nor\nwomen's decision making power.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nUnderstanding the Effects\n▶Microcredit serves its purpose: Some people take advantage\nof it when it is available, 1 in 8 start a new business, those\nwho already had businesses invest in durables and restrict\ntheir other consumptions, others consume more.\n▶It may neither be the life changing experience that some have\ndescribed, nor the new usury: The bottom line is that not\neveryone may want to become an entrepreneur. Microcredit\nwill not be all to all people.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nThe Impacts of Microfinance\nBeyond Credit?\n▶Overall, Spandana clients increase their durable expenditure,\nand reduce their consumption on \"avoidable\" goods.\n▶This suggests that the credit may work for them as a\ncommitment to save: Suppose they are buying a television\nwith the Spandana loan, then they may not need the\ntelevision right now, if they could save towards it.\n▶But saving is difficult: Small temptations (tea, snacks) and\nintra-family differences get in the way; they may never be able\nto get a television if they need to save for it.\n▶Microcredit allows them to get the television right away, and\nthen the credit officer (and their group) will come and force\nthem to repay.\n▶The cost is the high interest rate they have to pay.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nConclusion\nConclusion: Microfinance Revolution?\n▶Much hope has been placed in the microfinance movement.\n▶Not only one (very smart) way to address one particular\nmarket failure (like most anti-poverty programs), but\nrevolution in the way we help the poor.\n▶With credit (and now insurance) priced at financially\nsustainable prices, we can help the poor help themselves, and\nthis way, lift everyone out of poverty without spending (much)\nmoney.\n▶The worldwide success of this vision has encouraged\nreplicating the model in other domains, through social\nbusinesses.\n▶The reaction against microcredit has been no less extreme:\nthe new moneylenders, profiteering from the poor's myopia.\n\nIntroduction\nBarriers to Credit\nWhy Microfinance Works\nThe Impact of Microcredit\nConclusion\nConclusion\nConclusion: Microfinance Revolution?\n▶The evidence leads us to a much more nuanced conclusion:\n▶Financial innovation gave access to credit to some households\nwho could start a business (one microcredit loan in 8\ntranslates into a new business).\n▶It helps others to save or smooth shocks.\n▶However not everyone is a natural entrepreneur and the poor\nface other barriers to accumulation (time inconsistency,\nendogenous discouragement).\n▶Microfinance is a great innovation, it should be supported and\nwe should continue to develop new projects to improve\nfinancial access.\n▶However, it cannot replace old-fashioned ways to help the poor."
    },
    {
      "category": "Resource",
      "title": "Health",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/98ea9887a76c5d47d407218f7fee8f37_MIT14_74s09_lec10.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n14.74 Foundations of Development Policy\n\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nHealth\nEsther Duflo\n14.74\nMarch 9 and March 11, 2009\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nIntroduction\nI Today, we will talk about health from the point of view of\nsocial scientists: We will not talk about the efficacy of one\ntreatment or another, but about health services and health\nbehavior.\nI We will start by discussing, in detail, health and health care in\none specific region, to identify what seem to be the key\nproblems.\nI Motivated by this evidence, we will then discuss the research\nthat has tried to address these key issues:\nI Fixing supply.\nI Demand for preventive health: low demand, high sensitivity to\nprices.\nI Why this low demand? What can be done to improve it?\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nThe Udaipur Health Project\nI A five-year collaboration with Seva Mandir, a local NGO\nactive for over 50 years in Udaipur, Rajasthan.\nI Seva Mandir was interested in overhauling the work of their\nhealth unit, and contacted my colleague Abhijit Banerjee and\nme to see whether we would be interested in working with\nthem on it.\nI We had no idea what the problems were on the ground, so we\ndecided to start with a year-long survey of health status,\nhealth services and health behavior in Udaipur.\nI We would then analyze the data and hold a consultation in\nUdaipur with representatives from everyone working in the\nhealth sector in the area (doctors, NGOs, government officials)\nto decide on promising interventions.\nI We would then test those ideas in several randomized\nevaluations and meet again to discuss the results.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nThe Udaipur Health and Well Being Survey\nThis survey took place in 2002-2003. It covered:\nI 100 villages;\nI 1,000 households: long household interviews, some measures\nof health status;\nI 451 \"modern,\" private facilities; and\nI 123 public facilities, visited every week.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nThe Survey: Interview\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nThe Survey: Measuring Height\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nSome Striking Facts\nI Health status is poor.\nI Patterns of demand for health care.\nI Patterns of supply of health care.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nHealth Status Is Poor\nI Diseases\nData\nI Nutritional status:\nI Height and weight: 88% of women, and 93% of men, have\nBody Max Index below 21 (average=18).\nI Respiratory problems: peak flow meter on average 316 ml per\nexpiration (anything below 350 is symptoms of respiratory\ndifficulties).\nI Anemia: 56% of women, and 51% of men are anemic.\nI An India-wide phenomenon: Despite growth in income, even\nfor the poor, calorie consumption is worsening, and child\nnutritional status is not improving.\nFigure\n\nCold Symptoms\nFever\nHeadaches\nBody Ache\nBack Aches\nTrouble Walking 5km, Drawing water\nAbdominal Pain\nFatigue\nTrouble Squatting/Standing\nVision Problems\nChest Pain\nPresence\nSerious\nPercentage of Adults Reporting Symptom\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nAn Ocean of Disease\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nFraction of Households Consuming Less Calories than\nRecommended\n66%\n61%\n65%\n71%\n58%\n68%\n80%\n64%\n76%\nRural\nUrban\nAll India\n1993-94\n2004-05\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nPatterns of Demand for Health Care\nI High share of budget is devoted to health, even by the poor\nFigure\nI On average, household visits are provided once every two\nmonths.\nI Most health visits are to private \"doctors.\"\nFigure\nI In contrast to curative care, preventive care is very limited.\nE.g.,\nI Full immunization rate: less than 2% at baseline.\n\n7%\n9%\n8%\n7%\nPoor\nMiddle\nRich\nAll\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nShare of Budget Devoted to Health\n\nPublic\nFacilities\nPrivate\nFacilities\nBhopas\nPoor\nMiddle\nRich\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nShare of Visits to Different Facilities\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nPattern of Supply of Health Care: The Private Sector\nI The Private Sector:\nI Completely un-regulated, terrible quality.\nQualifications\nI Treatments that emphasize antibiotics and drips, not tests.\nTreatments\n\n27.0%\n28.8%\n21.3%\n14.8%\n13.9%\nMBBS + Spec\nMedical college\ndegree\nRMP\nOther Training\nNo formal\nqualification\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nQualifications of Private \"Doctors\"\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nTreatment in Private Facilities\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nPattern of Supply of Health Care: The Public Sector\nI The public sector:\nI On paper, the \"ideal\" system for a developing country.\nI A 3-tiered system of public health facilities:\nI One sub-center for 3,000 people (3,600 in our data), close\n(within 2 km in Udaipur), a nurse provides preventive care and\nreferral, free treatment;\nI One primary health center for 50,000 people (48,000 in our\ndata); and\nI Community health centers and district hospitals for bad cases.\nI In practice:\nI Dismal physical state of facilities.\nPicture\nI Absenteeism: 54% absence rate (weekly measures over a year),\nnot only Udaipur.\nPicture\nI Treatments: less antibiotics but no more tests.\nI Multiple missions for the nurses:\nI Undo their credibility (e.g., sterilization campaigns).\nI Leads them to completely give up on discharging any of these\nduties.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nSome Striking Facts about Health. Udaipur, Rajasthan, India\nThe Interactions between Supply and Demand\nI People are less likely to use public facilities when nurses are\noften absent.\nI Two possible explanations:\nI Patients are discouraged by high absence rate.\nI Nurses are discouraged by low demand.\nI Both of these phenomena could be present simultaneously.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nFixing Supply?\nI At the national level, response to the state of public health is\nto pour more money in the system. Under National Rural\nHealth Mission, health budget will increase form 0.9% of GDP\nto 2% of GDP.\nI At the local level, during the consultations that follow the\nanalysis, Udaipur's district Dollector (the head of the\nadministration, equivalent to a \"pr efet\") proposed that nurses\nshould be in their center at least one day a week (no meeting,\nno field visits).\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nMonitoring Nurses\nI District administration and Seva Mandir partnered to test a\nmonitoring system in to ensure their presence on that day\n(Monday) in 33 centers (randomly chosen in the districts).\nI Seva Mandir distributes a date and time stamp to nurses.\nI Nurses stamp on Mondays to indicate that they were present,\nindicate if she has a motive to be absent.\nI Seva Mandir collects the register and gives them to the\ngovernment.\nI The government announced sanctions for very delinquent\nnurses.\nI A research team (J-PAL and Vidhya Bhawan, a local\nuniversity) performed regular unnanounced checks (on\nMondays and other days).\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nResults of the Nurse Monitoring Program\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nResults\nI Early on, large impact: Nurses are sensitive to incentives.\nI However, as time goes on, attendance declines in monitored\ngroup (and increases in the other group).\nI At the end, attendance on Monday is higher in the\nnon-monitored group.\nI What happened?\nI Key is the nurse register indicating reason for absences.\nI Absence became \"exempted days\" (and \"broken machines\").\n\n0%\n20%\n40%\n60%\n80%\n100%\nFeb-06 Apr-06 Jun-06 Aug-06 Oct-06 Dec-06 Feb-07 Apr-07 Jun-07 Aug-07 Oct-07\nMonth\nMachine\nproblem\nExempt\nCasual\nleave\nAbsent\nHalf day\nFull day\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nFrom Absences to Exemptions\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nPolitical Commitment to a Monitoring System is Key\nI Contrast between these results and results on teacher\nincentives (where absence went down from 40% to 20% and\nstayed down):\nI An example of the difficulty to scale up.\nI Seva Mandir was committed to implementing the system for\nteachers.\nI But the public health system was not committed to\nimplementing it, despite commitment at the top.\nI Among all contradicting demands, nurses try to figure out\nwhat is really important and what is not. In the treatment\ngroups, they learned that the commitment to Monday presence\nwas not a real priority.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nDemand for Health and Political Commitment\nI How could the bureaucracy get away with not implementing\nits own rules?\nI One possible answer: No political will because there is no\ndemand for incremental changes in public health care.\nI One symptom: Even during the six months where attendance\nwas higher in treatment group, usage of the facility remained\nvery low:\nI On average, 0.74 clients seen in treatment facility when facility\nis open.\nI On average 0.81, clients seen in control facility when facility is\nopen.\nI It is possible that a system imposed from the top without any\ngrassroot demand cannot be sustained.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nPower to the People: Improvement in Health through\nGrassroot Mobilization\nI An interesting contrast is provided by an experiment in\nUganda.\nI Problems are very similar (e.g., absence rate in health center:\n47%)\nI Instead of a top down approach, they involved the community\nin monitoring the providers.\nI Intervention started with a household survey to collect data\non experience with public health facilities.\nI Then, community organizations facilitated three meetings: a\ncommunity meeting, a meeting at the health center, and an\ninterface meeting.\nI The outcome of these meetings was an action plan on how to\nimprove the situation, and how the community members\nwould monitor the facilities.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nPower to the People: Results\nResults:\nFigure\nI Community became more involved in monitoring health\nworkers.\nI Health workers were more present.\nI Health utilization improved in some respects.\nI Health outcomes improved.\n\n36%\n144%\n47%\n791,2\n35%\n94,1%\n34%\nabsence rate\nUnder Five Mortality\nrate\nself\ntreatment/traditional\nhealers\nnumber of outpatient\ncare visits\ncontrol\ntreatment\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nFixing Supply?\nCommunity-Level Monitoring in Uganda: Results\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nWhy This Lack of Demand?\nThere could be two reasons for lack of increase in the use of public\nfacilities even when they are improved:\nI Villagers do not trust that changes will persist (rightly).\nI The underlying demand for care provided in public facilities\n(preventive/no antibiotics) is relatively low (compared to care\nprovided by private doctors).\nI To investigate the second reason, we look at the effect of an\nimprovement in supply on the take-up of preventive care.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nThe Effect of Improvement in Supply: Immunization\nCamps\nI High rates of absenteeism in sub-centers may explain the low\nrate of immunization in Udaipur.\nI Seva Mandir teamed-up with the government to organize\nimmunization camps.\nI Seva Mandir hires a male nurse (on a motorcycle). The nurse\npicks the vaccines from the government facilities. They then\nheld an immunization camp in the village.\nI Monthly, always at the same date.\nI Very regular (95% of the planned camps took place).\nI Announced by a local health worker who also tries to sensitize\nwomen to the need of getting children immunized.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nResults\nI Improvement in immunization rates\nI Fraction of children fully immunized increased.\nFigure\nI However, increase was larger for first immunization; mothers\nless likely to come back for the following shots.\nFigure\nI 88% of children do not remain immunized despite very low\ncost.\nI Note that results from Uganda intervention were similar:\nincrease in the first immunization received, but\n\n6%\n17%\ncontrol\ncamp\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nFraction of Children Fully Immunized\n\n50%\n50%\n39%\n20%\n10%\n6%\n23%\n77%\n70%\n42%\n23%\n17%\nimmunization\nAt least 1\nimmunization\nAt least 2\nimmunizations\nAt least 3\nimmunizations\nAt least 4\nimmunizations\nAt least 5\nimmunizations\ncontrol\nCamp\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nFraction of Children Receiving a Given Number of Shots\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nPreventive Care: The Demand Problem\nI Low utilization of cheap health saving medical interventions\nI In India: Only a quarter of mothers breast-fed the child within\nan hour of birth and the average extent of exclusive\nbreastfeeding was only 2 months (WHO recommends\nbreastfeeding within an hour of birth, and to exclusively\nbreastfeed for 6 months).\nI Fraction of children receiving deworming medicine dropped\nfrom 78% to 59% when parents had to sign a form.\nI Very high price-elasticity for those services, both for positive\nprices, and negative prices.\nI Positive prices (even small) discourage use:\nFigure\nI Bed-nets (Kenya, Uganda, Madagascar)\nI Deworming (Kenya)\nI Chlorine (Kenya, Zambia)\nI Small rewards greatly encourage use:\nI Immunization (India, several African countries)\nI Learning HIV-Aids Status (Malawi)\nDetails\nDetails\n\n0%\n20%\n40%\n60%\n80%\n100%\n0.0 $\n0.1 $\n0.2 $\n0.3 $\n0.4 $\n0.5 $\n0.6 $\ndeworming\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nPositive Prices Discourage Use: Deworming\n\n0%\n20%\n40%\n60%\n80%\n100%\n0.0 $\n0.1 $\n0.2 $\n0.3 $\n0.4 $\n0.5 $\n0.6 $\ndeworming\nbednets\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nPositive Prices Discourage Use: Bednets\n\n0%\n20%\n40%\n60%\n80%\n100%\n0.0 $\n0.1 $\n0.2 $\n0.3 $\n0.4 $\n0.5 $\n0.6 $\ndeworming\nbednets\nchlorine purchase\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nPositive Prices Discourage Use: Chlorine\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nThe Impact of Small Incentives on Immunization\nI In some immunized camps, Seva Mandir offered one kilogram\nof lentils to mothers who took their children to be\nimmunization, and a set of plates for completed immunization.\nI A very small reward would not convince people who are\nstrongly against immunization.\nI Large impact on full immunization, especially on getting more\nthan one of the needed shots.\n\n6%\n17%\n38%\ncontrol\ncamp\ncamp+lentils\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nFraction of Children Fully Immunized\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nFraction of Children Receiving Different Number of\nImmunizations\n50%\n50%\n39%\n20%\n10%\n6%\n23%\n77%\n70%\n42%\n23%\n17%\n26%\n74%\n70%\n55%\n46%\n38%\nimmunization\nAt least 1\nimmunization\nAt least 2\nimmunizations\nAt least 3\nimmunizations\nAt least 4\nimmunizations\nAt least 5\nimmunizations\ncontrol\nCamp\nCamp + Lentils\n\n17%\n10%\n20%\n38%\n6%\ncontrol\ncamp\nnext to camp camp +\nlentils\nnext to\ncamp+lentils\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nSpillovers to Other Villages\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nThe Impacts of Small Incentives on Learning HIV-Aids\nStatus\nI A study by Rebecca Thornton (Malawi)\nI Voluntary Counselling and Testing (VCT) is seen as a\ncornerstone in the fight against HIV (Mozambique: 55% of all\nHIV-Aids expenditures were for VCT.\nI Yet, few people know their status: It is often assumed that\npsychological and social barriers are very strong.\nI As part of a survey, over 2,812 respondents were tested for\nHIV-AIDS.\nI A few weeks later, they could pick up their results if they\nwanted to (in a tent set up in the village).\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nExperimental Design\nTwo elements were randomized:\nI At the end of the interview, respondents drew a bottlecap\nwith a number, with an indication of a small thank you\nvoucher (between 0 and 3 dollars) for picking up their tests.\nI The location of the tent was also randomized within the\nvillage (\nI Results suggest that fear or stigma may not explain the low\ntake up rate of VCT.\nclose or\nfar ).\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nClose...\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\n...and Far\nImage removed due to copyright restrictions.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nImpact of Incentive: Percentage Learning Results\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n0 0.1-0.2 0.3-0.5 0.5-1.0 1.0-1.5 1.5-2.0 2.0-2.5 2.5-3.0\nPercentage learning HIV results\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nLow Demand for Preventive Care\nImpact of Distance and Incentive: Percentage Learning\nResults\np\nDistance to VCT(KM)\nNo incentive\nSome incentive\n0.8\n0.6\n0.4\n0.2\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nWhy Is Demand Low?\nWhy Is the Demand for Preventive Care So Sensitive to\nPrices?\nI The high sensitivity to (even small) prices on the demand for\nfinancial care is surprising. In a standard model of investment\nin health, the individual compares the costs and the benefits.\nGiven the very high returns of those investment in terms of\nhealth, the demand should be high.\nI There could be fear, or lack of trust: But in that case small\nchanges in prices should not have any effect (e.g.\nimmunization, HIV-test).\nI Two explanations have been proposed:\n1. Time inconsistent preferences.\n2. The perceived benefits of those actions is low (even if the real\nbenefits are high): Parents are largely indifferent between\nimmunizing their children or not immunizing them.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nTime Inconsistent Preferences\nTime Inconsistent Preferences\nI Today, cost of immunizing the child is time taken, child\ndiscomfort, potential side effects.\nI Benefits are in the future (at some unknown time).\nI Human beings think of the present and the future differently\n(O'Donoghue and Rabin, Laibson).\nI In the present, we are impulsive: Costs incurred today appear\nvery large relative to benefits.\nI In the future, we are more rational: Costs to be incurred next\nmonth appear small relative to benefits.\nI We have a tendency to postpone small costs to a future period.\nI But when the future comes, it is now the present, and the\ncosts again seem large.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nTime Inconsistent Preferences\nTime Inconsistent Preferences and Preventive Care\nI This could explain why getting an immunization is always\npostponed until next month while people are willing to spend\nlarge sums of money on a dubious curative care treatment for\nthe same disease for their child.\nI In this case, a small benefit that offset the small cost and is\nobtained today (e.g. a bag of lentils) can convince parents to\ntake the step today.\nI In most developed countries, there is a compulsory schedule of\nimmunization: it plays the same role.\nI In this world, subsidy, incentives, making some behavior\ncompulsory, can be justified for two reasons:\nI Externalities: They convince us to undertake behavior that\nhave positive spillovers on others.\nI \"Internalities\": They help us undertake behavior that are\noptimal from our own point of view.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nTime Inconsistent Preferences\nThe Role of Commitment Devices\nI If time inconsistency is the main problem, there can be other\nways to help individuals in taking the right steps:\nI \"Nudging,\" in the words of Richard Thaler and Cass Sunstein:\nMarketing techniques used to stir individuals to a choice that\nwould be right from their rational's self point of view (e.g.\n\"good\" default choices).\nI Helping them to commit in advance to behave in a certain way\nin the future: commitment devices.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nTime Inconsistent Preferences\nSmoking: The Role of Commitment Devices\nI Smoking is a public health epidemic in developing countries.\nI Self-aware individuals with time inconsistent preferences may\nwant to commit to stop smoking.\nI A microcredit bank in the Philippines proposed the CARES\nprogram, a commitment contract to smokers:\nI They open a (interest free) savings account.\nI They make regular deposits in the account.\nI After 6 months, they have to pass a surprise smoking test.\nI If they fail the test, they forfeit their money.\nI No one would take this product if they were not looking to\nforce themselves to stop smoking.\nI The CARES program was evaluated by Dean Karlan and Jon\nZinman.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nTime Inconsistent Preferences\nThe Impact of the CARES Program\nI CARES randomly offered to 781 out of 2000 smokers\n(randomly selected). 83 out of 781 (11%) accepted to take up\nthe program.\nI After 6 months, everyone performs a smoking test.\nI Smoking cessation rates:\nI 11% in the treatment group (all those offered CARES)\nI 8% in the control group\nI 29 out of 83 who took CARES stopped smoking (35%). But\nnote that we cannot compare those who took up CARES and\nthose who did not: Those who took-up may be those who are\nthe most (or the least!) likely to stop smoking.\nI Impact of being offered CARES: 3 percentage points.\nI If we assume that being offered CARES has no effect on those\nwho do not take it up, these extra 3% are due to the 11% of\n0.03\npeople who took up the program. Effect of the program: 0.11 :\n30%.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nThe Perception of Benefits\nI Thus, there is evidence that time inconsistency plays a role.\nI However, constantly postponing preventive care, if we are fully\naware of its benefits, requires to be both time inconsistent and\nvery naive.\nI Maybe the low demand and the high sensitivity to prices for\npreventive care, and the high demand and high willingness to\npay for curative care comes from the fact that we tend to:\nI Underestimate the benefits of preventive care.\nI Overestimate the benefits of curative care.\nI Learning about health is difficult:\nI For curative care: Since most diseases are self-limiting, any\ncure is going to appear effective. When a \"doctor\" gives one\nshot of antibiotic against the flu, we may think he cured the\nflu, and we will go back to this doctor.\nI For preventive care: It prevents a disease from happening, so\nthe disease is not observed: no immediate link is drawn\nbetween immunization and not getting sick.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nLearning about Preventive Health\n1. Well targeted information is useful, general incantations are\nnot.\n2. Education as a health policy.\n3. We can learn by doing, and we can learn from others.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nHIV-AIDS Prevention: Risk Avoidance or Risk Reduction\nI In the effort to prevent HIV-AIDs, the youth are considered to\nbe a \"window of opportunity.\" Youth were targets of\nprevention efforts in many countries that have been relatively\nsuccessful at curbing the spread of HIV-AIDs (e.g. Uganda)\nI Government response in Kenya: HIV-AIDS education in\nschool\nI As in many countries, the curriculum is a product of a\nconsensus: UNICEF, churches.\nI Based on ABCD Message (Abstain, Be Faithful, use a\nCondom... or you Die).\nI Public health discourse: choice beween emphasizing risk\navoidance (promote the message that AIDs is everywhere,\nabstinence is the only 100% safe behavior) vs risk reduction\n(avoid the most risky situation).\nI ABCD is a risk avoidance message.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nRisk Avoidance or Risk Reduction: An Evaluation in Kenya\nI Collaborative project: Government of Kenya, ICS (an NGO),\nand E. Duflo, P. Dupas, M. Kremer, S. Sinei.\nI The curriculum is, in principle, in place everywhere, but\nteachers do not teach it (fear of stigma, lack of comfort, etc.).\nI Government has a few trainers for teachers, but program is\nbeing phased in progressively: evaluation possible.\nI ICS organized training by Government Trainers of 3 teachers\nin 183 schools, randomly selected out of 370, in official\ncurriculum. ICS follows with health clubs.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nRisk Avoidance or Risk Reduction: An Evaluation in Kenya\nI In 35 trained schools, and 36 untrained schools, ICS organized\nan extra program, centered on risk reduction: the \"Sugar\nDaddy\" program.\nI Many adolescents girls have relationships with older adults\n(\"Sugar Daddies\").\nI Cross generational sex is associated with transmission of\nepidemics: Rate of infection of girls age 15 to 19 is 5 times\nthat of boys.\nI Intervention showed rate of infection of older men, younger\nmen, younger women.\nI And showed a UNICEF video against sugar daddies \"Sarah, the\nTrap\".\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nResults: Teacher Training\nI To get an objective measure of changes in sexual behavior,\nget information on pregnancy of girls who were in grades 6-8\nat baseline (2003). Reveals abstinence, condom use. Desirable\ninformation in and of itself.\nI Teacher training\nI Trained teachers more likely to have discussed HIV-AIDS in\nclass\nI Not much impact in self reported knowledge.\nI Not much impact in self reported behavior (sexual activity;\ncondom use).\nI No effect on pregnancy rates after 3 years, and after 5 years.\nFigure\nI Similar results found for HIV-AIDs prevention in Mexico,\nTanzania.\nI Michael Kremer and Edward Miguel: Same (lack of) effects of\ninformation campaign on deworming (wear shoes, don't swim\nin lake)\n\n14.4%\n30.7%\n14.3%\n30.2%\nGirls pregnant or having\na child after 3 years\nGirls pregnant or having\na child after 5 years\nControl\nTeacher Training\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Girls Who Started Childbearing\n\nI\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nResults: Sugar Daddy\nI Decrease in sexual activity with older partners; increase with\nyounger partners, but condom protected.\nI Large decrease in pregnancy rate, especially with older\nI Pregnancy rates after one year dropped by 30% (from 5.4% to\n3.7%).\nI Pregnancy rates with older partners dropped by 67% (from\n2.4% to 0.79%).\npartners.\nResults\n\n5.4%\n2.4%\n3.7%\n0.79%\nPregnancy rates\nPregnancy rates with older\npartners\nControl\nTreatment\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Girls Who Started Childbearing\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFigure\nEducation as a Health Policy: One Example\nI In half the trained schools, and half the untrained schools, ICS\nprovided school uniforms in grade 6 (in 2003) and grade 8 (in\n2005).\nI For girls, dropout declined from 18% to 12%.\nI Fraction of girls who became pregnant or had a child by 2005\ndeclined from 14.4% to 10.6%.\nI Fraction of girls who became pregnant or had a child by 2007\ndeclined from 30.7% to 26.1%.\n\n14.4%\n30.7%\n14.3%\n30.2%\n10.6%\n26.1%\nGirls pregnant or\nhaving a child after 3\nyears\nGirls pregnant or\nhaving a child after 5\nyears\nControl\nTeacher Training\nUniform\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Girls Who Started Childbearing\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nLearning by Doing and Learning from Others\nI Role of habits: Trying a health behavior may encourage one\nto continue.\nI Role of norms, culture, social learning: Seeing others adopt a\nhealth behavior may encourage further adoption.\nI Pascaline Dupas: experiment with bednets in Kenya\nI Worked with 644 households (sampled from parents' list) in\nwestern Kenya.\nI Distributed voucher for reduction in the price of a bednet at\nlocal stores: Price varied from 0 to 250 Ksh , or $3.80) (full\nprice is approximately $5).\nI One year later, offer a voucher to all the households, for 100\nKsh.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nLearning by Doing and Learning from Others: Results\nMore likely to purchase at first follow up if net is cheaper.\nI\nFigure\nI As likely to use bednet in beginning at first follow-up when\nfree.\nFigure\nI More likely to buy a second one if they received the first one\nfor free.\nFigure\nI It is really an experience effect: effect smaller for chlorine.\nI Social learning: More likely to buy at second follow-up if they\nknow more people who got it for free.\nFigure\nI Social learning on health (but going in the other direction)\nwas also found by M. Kremer and E. Miguel on deworming.\n\n59%\n37%\n35%\n11%\n98%\nfree\n50-70\nKsh\n100-110\nKsh\n130-150\nKsh\n190-250\nKsh\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Households Who Buy the First Net\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Households Who Use the First Net, if\nPurchased\n63%\n61%\n59%\n57%\n67%\nfree\n50-70\nKsh\n100-110\nKsh\n130-150\nKsh\n190-250\nKsh\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Households Who Buy the Second Net and\nChlorine\n66%\n50%\nAverage (33% receive\nfree)\nIf All receive free\n\n42%\n18%\n52%\n9%\nRedeemed 2nd LLIN\nvoucher\nRedeemed\nWaterGuard voucher\nControl\nTreatment\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPerceived Benefits: Learning about Health\nFraction of Households Who Buy the Second Net\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPolicy Implications\nConclusion: Policy Implications\nI The market will not naturally lead to an outcome where\npreventive care is delivered, or demanded.\nI We cannot just rely on communities to ensure that preventive\ncare is delivered.\nI The quality of care depends on the underlying demand:\nI Emergence of a dangerous private sector if there is no trust in\nGovernment (to regulate, or to deliver).\nI Good quality care must be a politically salient issue to\nguarantee the quality of the public sector.\nI A publicly funded, publicly provided (or regulated) effort to\nencourage behavioral change is essential.\n\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPolicy Implications\nCostBenefit\nHow Can Behavioral Change Be Facilitated?\nI In the short run, prices are important. We should use them.\nI Full subsidy of good quality preventive care and health\nproducts: the emphasis on \"sustainability\" often heard may be\nmissplaced.\nI Incentives (or compulsion) for preventive behavior work.\nI Use cross-subsidy of health behavior. E.g. distribution of\nbednets in measles camps (WHO, UNICEF) and in maternity\nclinics (TamTam, PSI).\nI We need to find effective ways to communicate information:\nI Credibility is essential. Governments often waste it on ancillary\ngoals. For example, sterilization campaign in India has ruined\nthe credibility of the nurses.\nI Focus on information that can be acted upon (e.g. Sugar\nDaddy vs Total Abstinence)\nI Exploit the mass media (done in rich countries): e.g. in Brazil\nand India, TV and soap opera associated with reduction in\nfertility.\n\n1.4\n4.26\n100%\nSubsidy\n90%\nSubsidy\nWith\nLentils\nWithout\nLentils\nNo Cost\nSharing\nWith cost\nsharing\nBednets: cost per life saved\n($)\nImmunization: Cost per\nimmunization ($)\nDeworming: Cost\nper Child treated\n($)\nSome Striking Facts\nFixing Supply?\nLow Demand for Preventive Care\nWhy Is Demand Low?\nConclusion\nPolicy Implications\nIs the \"Sustainable\" Approach Cost-Effective?"
    },
    {
      "category": "Resource",
      "title": "Income and Nutrition: Interrelationship",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/b87b2799b21d11751eabe1ad499388f0_MIT14_74s09_lec04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74\nLecture 4: Income and Nutrition: Interrelationship\nProf. Esther Duflo\nFebruary 17, 2000\nIs there a nutrition based poverty trap:\nWe have seen in the last lecture that in order to have a proverty trap, the capacity curve which\nlinks today's income to tomorrow income must intersect the 45 degree line from below:\nThe capacity curve links productivity to income: productivity = φ(income) = f(g(income))\nwhere:\n- nutrition=g(income)\n- productivity=f(nutrition)\nA poverty trap will emerge if f0g0 > 1. Let's denote income by y and do some algebra:\nf0g0 = gf0 ∗ g0\n= f0\ng ∗ g0\ny ∗ f\n(1)\ng\nf\ng\ny\nThe expressions f\nf\n0 g and g0 y are called\"elasticities\".\ng\nDefinition of an elasticity of Y with respect to E. When E changes by 1%, Y changes by η %.\n∂C\nη = ∂E\nC\nE\nElasticity is an important concept because it is unit-free: you do not need to know in what unit\nexpenditures and calories are measured. It is much easier to make comparisons across countries\nand samples.\nOn the 45 degree line, f = y. Expression 1 tells us that there can be a nutrition-based poverty\ntrap only if the product of the elasticities of the income-nutrition and nutrition-productivity\nrelationships is greater than 1. It gives us a clear empirical fact to look for. n\n\nThe relationship between income and nutrition\nWe seek to estimate the elasticity of calories (or other nutrients) consumed with respect to total\nresources available.\nSeveral things to keep in mind:\n1.\n2.\n3.\n1.1\nEndogeneneity Issues\nWe know that calories (or other nutrients) consumed may lead to more resources (through the\neffect of nutrition on productivity). When we observe the relationship between nutrition and\nresources, we may be picking this up as well.\nFor now, we will ignore this issue (because the literature has not dealt with it) but we should\nkeep it in the back of our mind\n1.2\nFunctional Form Issues\nWe know that the elasticity is unlikely to be the same everywhere: in fact, this is the basis for\nthe poverty trap.\nWe want to estimate:\nln(Calories per capita) = g(ln(Expenditures per capita)) +\ny = g(x) +\nAnd we want to be agnostic on the shape of g(.)\nTwo questions:\n- Why do we run the relationship in logs?\n- Once we have estimated this function g(.), where can we read the elasticity? (hint: think\nof a log-log regression)\n\nTo estimate this relationship, we use a non-parametric method: we are looking for the g(.) that\nfollows as closely as possible true shape of the function, while not being driven by the cloud of\npoint: there is a trade off between bias and variance.\nThree possible methods:\n- Approximate the g() with a series of polynomial, and run a familiar linear regression.\n- Chose a grid of point for x (x1, x2, .....) and at each of point xk, compute a weighted\naverage of y, giving more weight to the points that are closer to xk: kernel regression.\n- Same method, but at each point xk, run a weighed regression, and take the predicted\nvalue: local linear regression y = αx + . Advantages of this methods:\n- It is not biased at the edges\n- Since we run a regression, we can immediately read the local elasticity at xk: it is α!\n1.3\nMeasurement issues\nMeasurement of the calories\n-\n- Can we observe the calories directly?\nHow can we infer them?\n-\n- When we infer them from expenditures, what problem to do we into?\n- First issue: quality.\nExpenditure = number of calories*price of calorie\nlog(food expenditure) = log(number of calories) + log(price of calories)\nImagine running the regression:\nlog(food expenditure per capita) = g(log(Expenditures per capita)) +\nThis can be rewritten:\nlog(Calories per capita) + log (Price per calorie) = g(log(Expenditures per capita)) +\nThere is a positive correlation between the price of calories and the expenditures per capita. In\nwhat direction does that bias α?\n\n- Second issue: Waste, food given away to people, meals received elsewhere.\nWe need to correct for this by calculating the expenses on items in a very detailed way.\n1.4\nThe nutrition-income relationship in India\nDeaton and Subramanian: Maharastra, India\n- The relationship between expenditure and calories\n- Figure 2: More expenditures\nbetter nutrition.\n→\n- Figure 3: Elasticity: derivative of the curve in figure 2. It is declining with expendi\ntures (the curve is concave), but not very fast.\n- The relationship between quality and expenditures\n- An indicator of quality: price paid per calorie.\n- Figure 4: Log of price per calorie increases with expenditures.\n- Figure 5: Elasticity is fairly constant with expenditures.\nParametric results\n-\nln(Calories per capita) = α ln(Expenditures per capita)) + Xβ +\nWhat do they find for α?\nDreze and Deaton: The evolution of the income-calories relationship in India over time.\nSee the pictures.\n- What do you observe?\n- How can we explain that?\n\n1.5\nConclusion\nThere is a fairly sizeable relationship between income and nutrition (an elasticity of about 0.3).\nHowever, the relationship is nowhere close to 1, even for the poorest.\nIn a sense, it is surprisingly large, because the price of the cheapest calories is very low in India.\nThe cheapest meals are not expensive. One could think that the poorest household would eat\nas much calories as they need, and then as they become richer, acquire better quantity.\nIt could be :\n- beginitemize\n- because the relationship is over-estimated:\n- Reverse causality\n- Omitted varibles\n- because even the very poorest want to eat something which taste nice\n- or because the effect of calories on productivity is low: calories are a luxury.\nThe relationship between nutrition and productivity\nIs there evidence that this relationship is very steep?\n- There is experimental evidence that better-fed workers are more productive at physical\ntasks. Experiment in Indonesia provided iron supplement to randomly selected household\n(reference in the reading list). Compared to other households, they were stronger, less\nlikely to be anemic, less likely to be sick, worked longer hours, and earned more.\n- However the elasticity of the productivity-nutrition relationship appears to be below 1,\nunless all the extra money is spent on specific nutrients: A study of the relationship\nbetween farm productivity and calorie consumption in Burkina Faso (Strauss 1986) finds\nan elasticity of 0.34, 0.49 for the poorest.\n\nConclusion: Should we abandon DasGupta and Ray?\n- This exercise has shown us that this very clever and appealing model is not a literal\ndescription of the reality: the relationship between calories and nutrition is not steep\nenough to generate a poverty trap by itself: the product of the two elasticities is around\n0.09, which is far from one!!\n- However, the model forces us to think about how the nexus between human capital and\nincome can lead to a vicious circle: this circle may be found in contexts other than the\nhealth and productivity nexus.\n- Examples:\n- Child development: iron; worms; Iodine supplementation of pregnant women: small\nimprovement in nutrition can have large long term consequences for the entire life\nvia the education channel, or via irreversible losses (IQ, physical fitness) of poor\nnutrition in utero or early childhood: the elasticity of life-time earning with respect\nto improvement during childhood may be much larger than one. For example, Miguel\nand Kremer (2003) find that a school based deworming program that cost $0.49 would\nincrease life time earning of affected children by $30: the elasticity is much greated\nby one.\n- Schooling investment\n- Investment in businesses with fixed cost. Suppose you need 100 dollars to buy your\nfirst bag of widgets: if there is no credit market, small changes in your baseline level\nof wealth will have large impact on productivity: poverty trap can emerge."
    },
    {
      "category": "Resource",
      "title": "Inside the household: How are decisions made within the household?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/919b5c0368bd8b4e0b50783a6377c767_MIT14_74s09_lec14.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n14.74 Foundations of Development Policy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74\nLecture 13: Inside the household: How are decisions made\nwithin the household?\n\nProf. Esther Duflo\nApril 1, 2009\n\nUntil now, we have always assumed that the household\nwas maximizing utility like an individual. This is called\nthe unitary model of the household.\nBut the household is not one individual, it is a collection\nof individuals living together. Why would the decisions of\nthese groups be made exactly like those of an individual?\nTwo cases:\n1. \"Dictatorial\" household: Decisions are made by one\nmember who maximizes according to his own utility\nfunction.\nEx: Child labor model: one child, one adult, who de-\ncides? NB: Does the parent ignore the consumption\nand the leisure of the child in the child labor model?\nThe preference of the dictator can be altruistic.\nDe...nition of altruistic:\n\n2. Household with \"unanimity\" in preferences. All the\nhousehold members have exactly the same prefer-\nences, so they maximize the same function.\nIn reality, both assumptions are likely to be violated. A\nfew reasons:\n-\n-\n-\nWe are left with two questions to answer:\n1. Is the unitary model of the household right? How\ncan we reject it or accept it in the data?\n2. Is there a better model to describe the household?\nCan we accept or reject this model?\nToday we will try to answer both questions.\n\nRepresenting preferences\nImagine a household of two persons: Ahmad and Bi-\njou. Each household member eats a consumption bundle\nwith several goods [this is a vector (bread, butter, liquor,\nwomen's clothing, etc.)]. Note: qA the vector of con-\nsumption of Ahmad, qB the consumption of Bijou.\nThe preference of Ahmad can be represented by a utility\nfunction uA(qA; qB). Why does qB enter in Ahmad's\nutility function?\nThe preference of Bijou can be represented by a utility\nfunction uB(qA; qB).\nAhmad gets income yA and Bijou gets income yB.\nAhmad and Bijou must make decisions about what goods\nto buy for the household (and who will get to eat what).\n\nWe are trying to understand how they will arrive at this\ndecision:\nWe can consider several cases:\n1)How can we represent the preferences if Bijou is a all-\ndominating mother?\n2) How can we represent the preferences if Ahmad and\nBijou have exactly the same preferences?\nDoes either of these models require any di¤erent analysis\nthan the traditional model where each individual is mak-\ning individual decisions?\nThose two models are called\nmodels of a unitary household.\n3) How can we represent the preferences if Ahmad and\nBijou are trying to maximize the joint welfare of both\nmembers?\n4) How can we represent the preferences if Ahmad and\nBijou are each maximizing their own utility?\n\nWhich model is plausible?\nIs model 1 very plausible?\nIs model 2 very plausible?\nWould model 3 be plausible if Ahmad and Bijou just met\nfor the ...rst time?\nWhy is model 3 plausible in the case of a family?\nTesting household model\n3.1\nIs the household unitary?\nImagine the household is unitary. Without loss of general-\nity, the household is then maximizing Bijou's preferences,\n\nunder the resources constraint:\nMax uB(qA; qB)\nsuch that p(qA + qB) = yA + yB;\nWhat do demand functions (qA, qB) depend on?\n-\n- What do they not depend on?\n-\nNow imagine that the household is not unitary, but we\nare in case 3:\nMax AuA(qA; qB) + BuB(qA; qB)\nsuch that p(qA + qB) = yA + yB + y;\n\nWhat do demand functions (qA, qB) depend on now?\n-\n-\n-\nWe don't observe the weight directly, but what are pos-\nsible determinants of it, and what are good proxies we\ncould observe?\n-\n-\n- So what would happen if model 1 or 2 were not true,\nbut 3 were true? What test(s) can you think of to reject\nthe unitary model?\n?\nNow imagine that the household is made of two household\nmembers who each maximize their own utility functions.\nWhat do demand functions (qA, qB) depend on now?\n-\n-\n\nDo the tests you propose above allow you to discriminate\nbetween model 3 and model 4?\nSo with this type of test, we can reject unitary model, but\nnot discriminate between a welfare maximizing household\nand an atomistic (ine¢ cient) household.\nImplementing the test\n-We need a variation in the weights that is not directly\nrelated to variation in preferences.\nWhat would be a\nproblem if we used labor income?\n-Ideally we want an unexpected, permanent variation in\nthe weight. This could be given by an unexpected, per-\nmanent increase in women's bargaining power.\n-An example: Pensions in South Africa.\nPensions were introduced for Black South Africans in\n1993, and represent a substantial transfer of income for\n\nmen older than 65 and women older than 60.\nMany\nchildren live with their grandparents (a grandmother, a\ngrandfather, or both).\nThe grandparents suddenly receive this income that they\nwould not have expected for most of their lives but is now\npermanent: do they share it with their grandchildren,\nand do grandmothers share it more than grandfathers?\nIn particular, are the grandchildren now better nourished\n(bigger weight, taller).\nIn a unitary household, what would we expect?\n-Results: weight-for-height.\nWeight for height is a fast reacting measure of health: we\ncan use the same strategy as in the paper on child labor\n(compare people who are just eligible to those who are\nnot yet eligible).\nWhat do we ...nd?\n\n-Result: height-for-age\nHeight for age can to some extent replace a \"pre\"period.\nWhy? Because height for age is a stock measure: if you\nhave not been fed very well in early childhood, you have\nnot fully recovered by age 5.\nAll the kids were measured in the same year. What dif-\nference do you expect to see between children with an el-\nigible grandmother (grandfather)-for older children? for\nyounger children?\nHow should we set up the di¤erence in di¤erence estima-\ntor?\nSee the result in the table. Conclusion?\n\n3.2\nIs the household Pareto-e¢ cient? A\nsimple test\nNow that we know that the household is not unitary,\ncan we discriminate between 3 and 4? With simply this\nmodel, it is di¢ cult without knowing the exact shape of\nthe preferences.\nTo test for e¢ ciency, let's enrich the model and intro-\nduce explicitly the notion that the household needs to\nmaximize the \"size of of the pie\".\nAgricultural households do two things: home production\nand consumption.\nIntuitively, a Pareto-e¢ cient house-\nhold would ...rst maximize the size of its total income, and\nthen share this income according to the set of weights\nthat are speci...c to the household. This test of Pareto\ne¢ ciency is based upon this idea, it is implemented in\nthe paper by Chris Udry \"Gender, Agricultural Produc-\ntion and the Theory of the Household,\"which you should\nread.\n\nSetting: Burkina-Faso. Very poor, semi-arid area. There\nis on average 1.8 wives for each head of the household.\nImportant characteristic: Women and men each control\ntheir own plots.\nModel: Keep thinking about Ahmad and Bijou. Ahmad\ncontrols plot A, and Bijou controls plot B.\nPlot A has characteristics XA: size, fertility, distance\nfrom the house, etc....\nPlot B has characteristics XB.\nProduction function: hA = f(IA; XA), where IA are\nthe inputs that are applied to plot A (labor of A, labor\nof B, labor of the children, fertilizer, etc...).\nTo simplify, we are going to assume that the only inputs\nare the labor of A and B. So\nhA = f(LA\nA; LA\nB; XA);\n\nwhere Lj\ni is the labor that household member i applies\non plot j.\nLikewise, hB = f(LB\nA; LB\nB; XB).\nImagine a Pareto-e¢ cient household (with the same util-\nity function as in the previous lecture).\nThey maximize:\nunder the following constraints:\nhA = f(LA\nA; LA\nB; XA)\n(1)\nhB = f(LB\nA; LB\nB; XB)\n(2)\nLA\nA + LB\nA = LA\n(3)\np(qA + qb) = p(hA + hB)(4)\nNote that the problem is the same as in the previous\nlecture, except now individual incomes are determined by\nthe production decisions of the household.\n\nNote that, once the weights are ...xed, how the pro-\nduction is achieved is irrelevant for the household's total\nwelfare: what matters is total production.\nThe household can solve this problem sequentially:\nFirst maximize production\nSecond choose the individual consumption levels\nTherefore, the household should apply labor on each plot\nuntil the marginal product of labor is equalized across\nplots.\nWhat does this imply for hA and hB:\n-If they have the same XA and XB they should be ....\n-Once we control for X they should be ....\n\nTherefore, the yield (production divided by size) of each\nplot should be independent of the gender of the owner of\nthe plot.\nTest: for a given year, household and crop, is the yield a\nfunction of the gender of the person who owns the plot?\nRegression:\nQhtci = Xhtci + Ghtci + htc + htci\nwhere:\n-h:\n-t:\n-c:\n-i:\nQhtci:\nXhtci:\nhtc:\n\nTest: is equal to zero?\nResults in the tables. The summary is that the household\ncould achieve an increase of 5.8% of the production just\nby reallocating inputs across plots.\nThe household appears not to be e¢ cient."
    },
    {
      "category": "Resource",
      "title": "Land",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/63f925b02a63478b781cf413daf9d6ad_MIT14_74s09_lec17.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74\n\nLand\n\nProf. Esther Duflo\n\nApril 13 and 15, 2009\n\nAgriculture: The e!ciency of land\nuse\n- Share of agriculture in employment is close to\n50% for the world as a whole (50% in China, 57%\nin India).\n- Is land used e!ciently?\n\n1.0.1\nFarm size and productivity: observed relation-\nship\n- Farm size productivity di\"erences: see table.\n- Prot-Wealth ration and weather variability (mon-\nsoon outset is a measure of the risk faced by the\nfarmer): see gure\n-- The Prot-Wealth ratio is always greater for\nsmall farmers\n-- Small farmers' prots are hurt much more by\nuncertainty than large farmers'\n\n1.0.2\nWhy is this surprising?\n- Arguments for increasing returns (the opposite re-\nlationship)\n-- Technology with xed costs (tractors, etc..)\n-- Larger farmers have better access to capital\n(evidence in a few lecture)\n-- Larger farmers have better access to politi-\ncally allocated inputs (evidence from Africa in\na book by Bates \"Market and states in tropical\nAfrica\").\n-- The best farmer will have more land...\n- Mitigating factors:\n-- Rental markets in farm machinery\n-- Technological change in not very rapid. Savi-\nness not that important.\n\n1.0.3\nWhat could be going on: Arguments for de-\ncreasing returns\n-\n-- Agency problems: large farms are cultivated\nby hired labor, which has fewer incentive to\nwork hard. Small farms are owner cultivated.\n! Redistributing land will create more owner\ncultivated land which will be more productive.\n-- But why cannot the owner of the land not give\nthe right incentive to the farmers?\n\n1.0.4\nDi\"erent potential explanations for the observed\ninverse productivity relationship:\n- Di\"erences in land quality\n- Di\"erences in farmer characteristics\n- Incentive Problems\nProblem with the observed relationship: all of this\ncould be going on... How can we separate these dif-\nferent e\"ects.\n\n1.0.5\nEvidence: Study by Biswanger and Rosenzweig\n- Using ICRISAT data: very detailed panel (repeated\nobservation for every household) data from India.\n- Some individuals cultivate both an owner-operated\nplot and a rented plot.\n- Biswanger and Rosenzweig compare the inputs\nthey apply on their own plot and the rented plots,\nand the overall productivity of both plots.\n#ij = ! + \"Rij + #i + $ij,\n\n- where #ij is farmer's i outcome (prot, invest-\nment) on plot j, and Rij indicate whether the\nplot is rented.\n#i is the unoberved (but xed)\ncharacteristics of the farmers (risk aversion, qual-\nity, etc...).\nWe think that #i and Rij may be\ncorrelated, but, for a minute, not $ij and Rij.\nWhat can we do?\n- Control for the individual xed e\"ect to compare\nplots within individual's. So for example, for all\nthe farmers that cultivate two plots of land, we\ncan run the regression:\n#i2 \" #i1 = \"(Ri2 \" Ri1) + $i2 \" $i1,\n- The individual xed e\"ect is gone!\nBiswanger and Rosenzweig nd a strong negative \".\nWhat does this suggest? What could be the remaining\nproblem?\n\n1.0.6\nMore evidence: Shaban (1987)\n- Uses the same data, but controls in addition for\nplot quality.\n- He nds that individual work 40% more on their\nown land (controlling for land size) and that the\nproductivity is 15% to 30% higher on own land\nthan on rented land (with or without controling\nfor land quality).\n- On balance, the evidence suggests that the inef-\nciency comes from incentive problems.\n\n1.1\nIncentive problems: A simple model of\nsharecropping\n- Tenant farms the land, and applies e\"ort e.\n- The tenant can choose to work somewhere else\nand obtain w\n- The landlord cannot observe e.\n- E\"ort is costly to the tenant: 1\n2ce2\n- Two things can happen:\n-- with probability e: Output is H\n-- with probability e: Output is 0\n\n- The tenant and landlord write a contract which\nspecies a payment to the tenant\n-- a payment h if output is H\n-- a payment l if the output is 0\n\n1.1.1\nOptimal E\"ort\n- Maximize eH + (1 \" e)0 \" 1\n2ce2\n-- What is the solution?\n-- Why?\n\n1.1.2\nNo Limited Liability\n- Work sequentially: given h and l, what is the ten-\nant's e\"ort? Tenants want to maximize income\nminus the cost of e\"ort: eh + (1 \" e)l \" 1\n2ce2\n- What is the solution for e given h and l?\n- How do we need to x h and l to incite the tenant\nto choose the optimal e\"ort H\nc ?\n- l=\n- h=\n- This contract is a .\n\n- How is the rent, R, chosen?\n- Tenant has to agree to work with landlord: he has\nto receive at least w. # exercise: calculate R\n\n1.1.3\nLimited Liability\n- Imagine that the tenant cannot receive negative\npayment: .\n- What will l be?\n- What will e be?\n- What will the output be?\n- How does it move with h?\n\n- Maximization problem of the landlord: Maximize\nhis income.\nmax etenant[H \" h]\nmax h\nc[H \" h]\n-- What is the optimal h now?\n-- What is the output?\n-- How does the output compare to the optimal\noutput?\n-- What is the di\"erence h - l?\n-- How does it compare to the case without lim-\nited liability?\n-- Why is the e\"ort smaller than the optimal ef-\nfort?\n\n1.1.4\nOutside Option\nRemember that the tenant can choose to work some-\nwhere else and will receive a utility w. How does it\nmodify the contract chosen above?\n\n- Tenant's utility under the contract:\nh\n2h \" 1\n2c(h\nc)2 = 1\nh\nc\n2 = 1\nH\nc\nif 1\nH\nc\n2 $ w, they can choose this contract: Is there\nanuthing strange about this contract?\nif 1\nH\nc\n2 < w, they have to pick a contract which will\ngive at least w to the tenant Pick h such that:\nh\nc\n2 = w\nh=\ne=\n- e is always an increasing function of w\n- output is always an increasing function of w\n# increasing the tenant outside option increases pro-\nductivity\n\n1.1.5\nOther sources of ine!ciency\n1. (a) The rental contract makes the farmer bear\nall the risk of production: if he is risk averse\nhe may dislike that and want some insurance\nfrom the landlord: a contract where he will\nneed to pay less during bad times than during\ngood times.\n2. The rental contract provides no incentives for the\nland owner-and there may be things he needs to\ndo (management-type things)\n\n1.1.6\nThe desirability of land reform\n1. (a) If limited liability is important, then redistrib-\nuting wealth clearly will help: if the farmer is\nwealthier, it improves the ability for a x rent\ncontract. But why land in particular?\n2. If risk aversion is important, then redistributing\nland may or may not have an e\"ect on productiv-\nity, depending on why people have di\"erent level\nof risk aversion:\na. Suppose that di\"erence in risk aversion are ex-\nogenous: then what will happen after the land\nreform?\nb. Suppose that risk aversion is bigger for those\nwho don't have much land how does it change\nthe argument?\n3. If there are incentive problems on both sides: what\nwill happen after theland reform?\n\n1.2\nThe case for redistributing land\nWhy redistribute land rather than money? As econo-\nmists, we tend to think that money is better, since\nwith money, the poor could buy land if they wanted\nto. So why land reform?\n- The giving end: Getting land from the rural rich.\n-- Common argument (1): land cannot ee to\nSwitzerland, and cannot be hidden: easy to\nseize\nYet: Land titles are very sketchy. Formal titles\ncan be quite di\"erent from e\"ective control,\nespecially if people have an incentive to do so.\nLand may not be so easy to take away after\nall.\n\n-- Common argument (2):\nredistributing land\ndoes not create distorsions, since it is a xed\nasset (income taxation would reduce labor sup-\nply, but land does not).\nYet: Redistributing land is di!cult: it is op-\nposed by landowners who often control impor-\ntant political resources. There are very few in-\nstances of large scale land redistribution that\ndid not take place in the midst of massive so-\ncial upheaval. Land reform may be politically\nvery costly.\n-- Perhaps we want to tax the rural rich, and not\nthe urban elite (entrepreneurs, etc...), for ex-\nample because we want to foster industrializa-\ntion. This does not seem to be important now,\nsince recent examples have favored\nland reforms, whereby landlords are is\ncompensated out of general tax revenues.\n\n- The receiving end: giving land to the rural poor.\n-- Makes them more likely to migrate to the cities.\nBut are cities really too large?\n-- Land is an asset: Intrahousehold allocation is-\nsues. Perhaps money would be spent by the\nhousehold head in alcohol etc... whether land\nwill remain in the household. We should make\nit hard to sell the land then! This may be the\nmost compelling argument in favor of land re-\nform. -\n\n1.3\nDoes land reform work?\n- Few studies of the e!ciency consequences of large-\nscale reforms of property rights:\nMost reforms\nhave been accompanied by major upheaval and\nsocial unrest # di!cult to separate the e\"ects of\nthe two.\n- The paper, \"Empowerment and E!ciency: The\nEconomics of Agrarian Reform\" (Banerjee, Gertler,\nGhatak), studies a = improve-\nment in the rights of tenants. It di\"ers from a\ntraditional land reform (redistribution of land).\nLand is not redistributed. The tenant is o\"ered\nthe = if he registers, he cannot\nbe evicted by the landlord, as long as he pays 25%\nof the output to the landlord\n\n1.3.1\nTraditional System: Sharecropping\nDenition: The landlord owns the land. The tenant\nfarms the land and provides the inputs (Sometimes,\nthe landlord provides some inputs too(e.g., fertilizer).\nAt the end of the season, the tenant gives the landlord\na share of the crop (e.g., 1/3 or 1/2).\nConsequences of the reform on the tenant\n\n1 Bargaining power e\"ect\n- Tenant and landlord negotiate on the share\n- Before, what would happen to the tenant if he\ndisagreed with the landlord?\n- After, what can happen to him?\n- What are the consequences of this on the share\nof the tenant?\n- is it good or bad for productivity?\n- why?\n2 Security of tenure e\"ect\n- What positive e\"ect does it have on produc-\ntivity?\n- What negative e\"ect does it have on produc-\ntivity?\n\n1.4\nEmpirical analysis of the reform\n- Left front government came to power in 1977\n- Started registration camps in villages (o!cials came\nto help tenants register)\n- Faced some di!culties = ood, landlords' opposition\n# registration progressed more slowly than expected\n(Figure 6)\n\n1.5\nThe expected e\"ects of the reform\n1.\nReform # bargaining power # improvement in\nshare # improvement in productivity\n2. Reform # security of tenure # improvement in\nproductivity (?)\nQuestions asked in the study=\na) Did reform increase share of output for the tenants?\nb) Did reform increase security of tenure?\nc) Did reform increase productivity?\n\n1.6\nEmpirical analysis\n1.6.1\nSecurity and share of output\n- Table 2 -- Conclusion?\n- Figure 4 -- Conclusion?\n1.6.2\nProductivity\n- Figure 1: Productivity and registration rate\n- observation:\n- what else could be going on?\n-\n-\n\n- What can we do:\na) Bangladesh\n- Neighboring country but no reform\n- Di\"erence in di\"erence\nBEFORE\nAFTER\nDIFFERENCE\nWEST BENGAL\n1308.2\n1649.52\nBANGLADESH\n1296.76\n1561.64\nDIFFERENCE\nb) Within West Bengal\nDistrict had di\"erent registration rates at di\"erent\ntimes.\nAt any given point, was productivity higher\nin the districts which had more registered tenants?\n\nRegression\nydt = !d + %2 + \"bdt + &Xdt + 2dt\n!d = district specic e\"ect\n% = year e\"ect\nbdt = number of registered tenants\nXdt = other district-time varying variables\n& = e\"ect of other district-rm varying variables on\nproductivity\nResult in table 4"
    },
    {
      "category": "Resource",
      "title": "Missing Women: Gender Discrimination",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/dbcc3549423f5da47c1824e04cdecbea_MIT14_74s09_lec13.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n14.74 Foundations of Development Policy\nSpring 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n14.74\n\nLecture 11: \"Missing Women\": Gender Discrimination\"\n\nProfessor Esther Duflo\n\nMarch 30, 2009\n\n!\n\"#$$#%& '()*%\n!\"#$%&# '() *+,-(. /$01( $(2030()%45 67($( #$( 899 \"0.:\n.0,) \"0;;0)< =,\"()\n>7#% 0; # ?\"0;;0)< =,\"#)@A\nB#%0,5 +C\"-($ ,D D(\"#.(;E+C\"-($ ,D \"#.(; 0) 8FGH\n: IC$,3(5 8J9K\n: 'C-:'#7#$#) !D$02# *''!45 8J9LL\n: +,$%7 !D$02#5 9JFH\n: ',C%7 I#;% !;0#5 8\n: M70)#5 9JFN\n: O#)<.#P(;75 9JFN\n: Q)P0#5 9JFR\n: /#S0;%#)5 9JF8\n! \"0;;0)< =,\"#) 0; # =,\"#) =7, ;7,C.P -( #.0T( #)P 0;\n),%J\n\n+C\"-($ ,D \"0;;0)< =,\"()UMC$$()% 3,3C.#%0,)V W(\"#.(E\"#.(\n$#%0, 0) ''!:MC$$()% )C\"-($ ,D =,\"()\n+C\"-($ ,D \"0;;0)< =,\"() 0) 8FGH *\"0..0,);45\n: ',C%7 I#;% !;0#5 L\n: M70)#5 NN\n: O#)<.#P(;75 RJX\n: Q)P0#5 RX\n: /#S0;%#)5 KJL\n670; 37(),\"(),) 0; \",$( 3$,),C)2(P 0) ',C%7 !;0# #)P\nM70)# %7#) #)&=7($( (.;(J 67($( #$( ,%7($ P0\"();0,); ,D\nP0;2$0\"0)#%0,) *;(( 7#)P,C% D$,\" Y$;% .(2%C$(4Z -C% %7(\nP0[($()%0#. \",$%#.0%& 0; %7( \",;% ;%$0S0)<J\n\n+\n,*&-*./ #% *0*12 342 -#5* 4%3 #%\n$6*.#4- .#1.7)$/4%.*$\n+8!\n90*12342 -#5*: ;(< .4% <* =%3 (7/\n<>*/>*1 &#1-$ 41* &#0*% -*$$ /( *4/ />4%\n?(2$@\n\\-;($T0)< =7, <(%; =7#% 3,$%0,) ,D %7( D,,P (T($&,)(\n<(%; 0; #.\",;% 0\"3,;;0-.(J\n],=(T($Z 0\"#<0)( %7#% %7( D#\"0.& 7#; # Y^(P -CP<(% %,\n;3()P ,) 2,);C\"3%0,)J 67($( #$( L <,,P;5 20<#$(%%(;\n#)P -$(#PJ\n_0P; 2,);C\"( ,).& -$(#PZ #PC.%; 2,);C\"(\n20<#$(%%(; #)P -$(#PJ Q)0%0#..& %7($( #$( %=, #PC.%; 0) %7(\nD#\"0.&J\n\n! >7#% 7#33(); %, %7( #PC.%;` %,%#. 2,);C\"3%0,) =7()\n# 270.P 0; -,$)A\n! >7#% 0; .0S(.& %, 7#33() %, 20<#$(%%( 2,);C\"3%0,)\n=7() # 270.P 0; -,$)A\n! Q\"#<0)( %7#% <0$.; #$( <0T() .(;; %, (#% %7#) -,&;J\n],= P,(; %7( P$,3 0) 20<#$(%%(; 2,);C\"3%0,) P0[($\n=7() # -,& 0; -,$) %7() =7() # <0$. 0; -,$)A\n! ],= 2#) =( C;( %70; ,-;($T#%0,) %, 2,);%$C2% # %(;%\n,D -,&; T; <0$.; P0;2$0\"0)#%0,)A\n!)<C; a(#%,) %(;%; %70; 0P(# 0) M,%( P`QT,0$(J ! $#%0,5\n*)(<#%0T( ,D 4 %7( #\",C)% =( )((P %, <0T( %, %7( 7,C;(:\n7,.P ;, %7#% %7(& \"#0)%#0) %7(0$ 2,);C\"3%0,) ,D %7( #PC.%\n<,,PJ\n\n>7#% =,C.P -( %7( $(.#%0,);703 -(%=(() ! $#%0, D,$ -,&;\n#)P ! $#%0, D,$ <0$.; 0) 2#;( ,D <()P($ P0;2$0\"0)#%0,)A\nb,,S #% %7( $#%0,) 0) %7( %#-.(5 a, &,C ;(( #)& ;&%(\"#%02\n3#%%($)A\n670; %(;% P,(; ),% 0)P02#%( ;%$,)< P0;2$0\"0)#%0,)J\nc(%\n%7( -#;02 D#2% %7#% =,\"() P0( \",$( %7#) \"() $(\"#0);\n%$C(J\n/($7#3; %7( 2,);C\"3%0,) ,D 20<#$(%%(; 0; 3,,$.&\n\"(#;C$(PJ /($7#3; %7( P0;2$0\"0)#%0,) P,(; ),% ,22C$ 0)\n%7( #\",C)% ,D D,,P %7(& <(% -C% 0) \",$( (^%$(\"( 20$2C\":\n;%#)2(;Z ,$ 0) \",$( ;C-%.( =#&;J\n+8+\n9A/1*)* (7/.()*$: .>#-3 $710#04- #%\n6*1#(3$ (5 31(7&>/\nI^%$(\"( ,C%2,\"( D,$ %7( 270.P5 d0$.; #$( .(;; .0S(.& %, -(\n%#S() %, %7( P,2%,$ ,$ %7( 7,;30%#. =7() ;02SJ\n\nI^%$(\"( ,C%2,\"( D,$ %7( 3#$()%;5 !$( <0$.; \",$( .0S(.& %,\nP0( %7() -,&; =7() 3#$()%; D#2( # 2$0;0; *(J<J # P$,C<7%4J\n>7& =,C.P 0% -( %7( 2#;(A\n6(;%5 $(.#%0T( ;C$T0T#. 3$,-#-0.0%& ,D <0$.; #)P -,&; 0) $C$#.\nQ)P0#J\na(3()P()% T#$0#-.( 5\n\"!;C$T0T#.\"<0$.\"\n\"!;C$T0T#.\"-,&\"\n'7( P,(; ),% 7#T( %70;5 ;7( P,(; ),% S),= %7( <()P($ ,D\n270.P$() =7, 7#T( P0(PJ\nO& O#&(; $C.(5\n\"!#\"$\" # \"!#\"\n\"!$\"\"!$\"#\"\n\n+,%( % %7( 3$,-#-0.0%& %7#% # <0T() 270.P 0; # <0$.5\n\"!$\"#\" #\n%\n\"!$\"\"!$\"#\"\n67( P(3()P()% T#$0#-.( 2#) -( (^3$(;;(P5\n\"!#\"$\"\n$ # \"!#\"$\"\n$ # %\n%\nb,,S #% %#-.( 0) %7( 7#)P,C% *6J ;%#%0;%02 0) 3#$()%7(;(;4\n:a,(; P$,C<7% #[(2% -,&;` ,$ <0$.;` ;C$T0T#. \",$(A\n:>7& P,(; ;7( $C) %7( $(<$(;;0,) D,$ %7( ?), e,,P &(#$;@A\n:>7& P,(; ;7( $C) 0% ;(3#$#%(.& D,$ .#)P(P #)P .#)P.(;;A\n\nB\nC()* *.(%()#. *A6-4%4/#(%$\nB8!\nD>* 1*-4/#(%$>#6 ?*/<**% &#1- )(1/4-E\n#/2 4%3 <()*%F$ *41%#%& (66(1/7%#/2\nM70.P \",$%#.0%& P,(; ),% 2,\"( ,C% ,D #2%C#. P(;0$( ,D\n%7( 3#$()% %, ;C33$(;; %7( <0$.Z -C% 0; %7( 2,);(fC()2(\n,D )(<.(2%J /#$()%; #$( ),% 0)T(;%0)< 0) %7( <0$.`; 7(#.%7J\n>7&A\n/($7#3; -(2#C;( %7(& #$( ),% (^3(2%0)< %7#% %7( $(%C$);\n%, <0$.`; 7C\"#) 2#30%#. 0; %7#% 70<7J\n+#)2& g0#)`; 3#3($5 ?=7#% P,(; %70; 7#T( %, P, =0%7 %7(\n3$02( ,D %(# 0) M70)#hJ\n! b0-($#.01#%0,) ,D #<$02C.%C$( C)P($ %7( ?7,C;(7,.P $(:\n;3,);0-0.0%& ;&;%(\"@ .(P %, #) 0)2$(#;( 0) %7( 3$,PC2:\n%0,) ,D 2#;7 2$,3; *%(#Z ,$27#$P;Z T(<(%#-.(;4 $(.#%0T(\n%, 2($(#.; #D%($ 8FXFJ\n\n! 6(# 0; # 2$,3 =7($( =,\"() 7#T( # 2,\"3#$#%0T( #P:\nT#)%#<(Z =7($(#; ,$27#$P 0; # 2$,3 =7($( \"() 7#T(\n# 2,\"3#$#%0T( #PT#)%#<(J\n! 'C33,;( 3#$()%; $(;3,)P %, (^3(2%(P $(%C$); ,D 7#T:\n0)< -,&; #)P <0$.;J >7#% =,C.P &,C (^3(2% %, ;((\n0D &,C 3.,%%(P %7( <()P($ $#%0, ,T($ %0\"( 0) $(<0,);\n;C0%#-.( %, %(# 3$,PC2%0,) #)P 0) ,%7($ $(<0,);A QD\n&,C 3.,%%(P %7( P0[($()2(A\n! Q; %70; )(2(;;#$& 0)P02#%0T( ,D # $(PC2%0,) ,D P0;2$0\":\n0)#%0,) =7() =,\"()`; (#$)0)<; #$( 70<7($A\n>7#%\n(.;( 2,C.P -( <,0)< ,)A\n! >7#% =,C.P &,C (^3(2% %, ;(( 0D &,C 3.,%%(P %7(\n<()P($ $#%0, ,T($ %0\"( 0) $(<0,); ;C0%#-.( %, ,$27#$P\n3$,PC2%0,) #)P 0) ,%7($ $(<0,);A QD &,C 3.,%%(P %7(\nP0[($()2(A\n\n! >7#% =,C.P &,C (^3(2% %, ;(( 0D &,C 3.,%%(P %7( <():\nP($ $#%0, ,T($ %0\"( 0) $(<0,); ;C0%#-.( %7( 3$,PC2%0,)\n,D ,%7($ 2#;7 2$,3; #)P 0) ,%7($ $(<0,);A ],= =0..\n%70; 7(.3 C; P(%($\"0)( =7(%7($ 3$(T0,C; $(;C.%; #$(\n$(#..& PC( %, %7( D#2% %7#% 7,C;(7,.P; $(;3,)P %, %7(\n$(%C$); %, 7#T0)< <0$.; ,$ =7(%7($ %70; =#; ;0\"3.& #)\n0)2,\"( ([(2%A\n! >7#% ;7,C.P %7( aa (;%0\"#%,$ -( D,$ %7( ([(2% ,D\n%(#A\n! >7#% ;7,C.P %7( \",$(:e(^0-.( (;%0\"#%,$ -(Z D,$ %7(\n([(2%; ,D #.. %7( 2$,3;A\nG\nD>* 1(-* (5 />* )411#4&* )41H*/\n! >7#% 0; # P,=$&A\n\n! >7#% 0; # -$0P( 3$02(A\nQ) Q)P0#Z # P,=$& 0; \",$( D$(fC()% %7#) # -$0P( 3$02(J\n! >7#% 0; %7( (^3(2%(P $(.#%0,);703 -(%=(() %7( )C\":\n-($ ,D 3,%()%0#. <$,,\"; #)P %7( P,=$&A\n! >7#% 0; %7( (^3(2%(P $(.#%0,);703 -(%=(() %7( )C\":\n-($ ,D 3,%()%0#. -$0P(; #)P %7( P,=$&A\n>( 2#) %(;% %70; 0P(#5\nQ) Q)P0#Z \"() %()P %, \"#$$&\n&,C)<($ =,\"()J\n! >7#% 0; %7( ([(2% ,D 3,3C.#%0,) <$,=%7 ,) %7( $#%0,\n;C33.& ,D <$,,\"; E;C33.& ,D -,&;A *;(( Y<C$(4\n! ],= 0; %7#% (^3(2%(P %, #[(2% P,=$0(;A\n\n! '(( %#-.(5 $(<$(;;0,) ,D %7( P,=$& 3#0P ,) %7( P0;%$02%\n;(^ $#%0,J >7#% 0; %7( ;0<)A Q; 0% ;0<)0Y2#)%A\n! a, &,C (^3(2% P,=$0(; %, <, C3 ,$ P,=) =7() %7(\n=,\"() 0; -(%%($ (PC2#%(P ,$ 7#; -(%%($ 7(#.%7A\n! Q) 3$#%02(Z 0% \"0<7% ),% #.=#&; -( %$C(J IPC2#%(P\n=,\"() )((P %, \"#$$& (PC2#%(P \"() *D,$ ;,20#. $(#:\n;,);4J O& <(%%0)< #) (PC2#%0,)Z =,\"() $(PC2( %7(\n)C\"-($ ,D \"() %7(& 2#) 3,%()%0#..& \"#$$&J >7#%\n([(2% 2#) %70; 7#T( ,) %7( P,=$&A >7#% 0)%($#2:\n%0,) P,(; 0% 2$(#%( -(%=(() %7( $0<0P0%& ,D %7( ;,20#.\n),$\"; #)P <()P($ P0;2$0\"0)#%0,)A"
    },
    {
      "category": "Resource",
      "title": "Nutrition and productivity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-74-foundations-of-development-policy-spring-2009/ddb0d85cdd3a2207995caceb093dd45d_MIT14_74s09_lec03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n14.74 Foundations of Development Policy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNutrition and productivity\n14.74, Spring 2009, Lecture 3\nDepartment of Economics, M.I.T.\n\nA simple theory of nutrition and\nproductivity\nThe capacity curve (fig 1)\n- The capacity curve: It relates income and work\ncapacity (productivity)\n-- Higher income → better nutrition.\n-- Better nutrition: first used by the body for the\nbasic metabolism. Then only it translates in\nhigher capacity.\n-- As a result, the work capacity is convex, and\nit intersects the 45 degree line from below.\n\nThe Piece-wage schedule (fig1)\n- The piece wage schedule\n-- The amount of income you get for each task\nyou perform\n-- : v1 > v ∗ > v3\n-- There is a wage v ∗ at which the body \"breaks\neven\" → it creates a discontinuity in the labor\nsupply.\nDiscontinuous labor supply (fig 2)\n- The individual labor supply jumps\n- We can now draw the aggregate labor supply.\n\nEquilibrium (fig 3)\n- Introduce a labor demand curve.\n- What happens if the labor supply cross the labor\ndemand in the gap?\n- There is involuntary unemployment\nDefinition= A person is involuntarily unemployed\nif he cannot find employment in a market which\ndoes employ a person very similar to him and if\nthe latter person, by virtue of his employment in\nthis market is distinctly better off than him.\n- The vicious circle is complete: low wage leads\nto reduced work capacity, which closes access to\nemployment.\n\n1.1\nThe effect of non-labor income (fig 4)\n- In what direction do assets move the capacity\ncurve?\n- Who is more likely to be employed: the rich or\nthe poor?\n- Who earns a larger wage income if both are em\nployed?\nThe vicious circle of inequality: the functioning of the\nlabor market magnifies assets inequality.\n\n1.2\nThe effect of redistributing wealth\n- Imagine individuals are ranked by land holding (fig\n5)\n- m have no land.\n\nWho will work (fig 6)\nDefinition: Minimum wage such that an individual can\nor want to work.\n- Capacity curve and labor supply.\n-- what is the minimum wage at which someone\ncan work?\n-- Labor supply for capacity to work: the mini\nmum wage necessary decreases with wealth\n- Willingness to work and labor supply\n-- The willingness to work is smaller for richer\npeople\n-- Labor supply for willingness to work: the min\nimum wage necessary increases with wealth.\n\nLabor Supply (fig 7)\n- Combine the two: labor supply.\n- How does redistributing land frm the rich to the\npoor affect labor supply\n- what happens to wages, production.\n\n1.3\nDynamics\n- Assume now that work capacity today is a func\ntion of last period's nutrition:\nworkcapacityt = f(nt-1), f0 > 0\n- To simplify the analysis, let us assume away all the\nlabor market issues--everyone works on his own\nand gets an income equal to his work capacity.\nFurthermore nutrition is an increasing function of\nincome.\n- Therefore\nnt = g(workcapacityt) = g(f(nt-1)).\n\nImplications\n- Poverty trap (fig 1 , 2 , 3).\n- Reinforces the lack of a equity-efficiency trade-off\n- What if poor people could enter into long term\nemployment contracts?\n- What would be the effect of providing free meals?\n- What would be the effect of providing access to\ncredit?\n- What would be the effect of an employment guar\nantee scheme?\n- How much does an improvement in a household's\nincome increase investments in human capital?\n\n1.4\nLooking at the evidence\n- Observe that the model, in order to generate a\npoverty trap, requires that over a range, the f(g(·))\ncurve intersects the 45 degree line from below.\n- A poverty trap will emerge if f0g0 > 1. Let's\ndenote income by y and do some algebra:\nf0 g 0 = gf0 ∗ g0\n= f0\ng ∗ g0\ny ∗ f\n(1)\ng\nf\ng\ny\nThe expressions f\nf\n0 g and g\ng\n0 y are called\"elasticities\".\n- On the 45 degree line, f = y. Expression 1 tells\nus that there can be a nutrition-based poverty\ntrap only if the product of the elasticities of the\nincome-nutrition and nutrition-productivity rela\ntionships is greater than 1. It gives us a clear\nempirical fact to look for."
    }
  ]
}