{
  "course_name": "Foundations of Cognition",
  "course_description": "Advances in cognitive science have resolved, clarified, and sometimes complicated some of the great questions of Western philosophy: what is the structure of the world and how do we come to know it; does everyone represent the world the same way; what is the best way for us to act in the world. Specific topics include color, objects, number, categories, similarity, inductive inference, space, time, causality, reasoning, decision-making, morality and consciousness. Readings and discussion include a brief philosophical history of each topic and focus on advances in cognitive and developmental psychology, computation, neuroscience, and related fields. At least one subject in cognitive science, psychology, philosophy, linguistics, or artificial intelligence is required. An additional project is required for graduate credit.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Humanities",
    "Philosophy",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 2 hours / session\n\nClass Description\n\nAdvances in cognitive science have resolved, clarified, and sometimes complicated some of the great questions of Western philosophy: what is the structure of the world and how do we come to know it; does everyone represent the world the same way; what is the best way for us to act in the world. Specific topics include color, objects, categories, similarity, inductive inference, space, time, causality, reasoning, decision-making, morality and consciousness.\n\nThe format of this class is interactive and includes in-class discussion, in addition to required online web forum interactions among students. Readings and discussions include a brief philosophical history of each topic and focus on advances in cognitive and developmental psychology, computation, neuroscience, and related fields.\n\nPrerequisites\n\nAt least one subject in cognitive science, psychology, philosophy, linguistics, or artificial intelligence is required.\n\nRecitations\n\nFor five weeks during the term, class will only meet once per week for a recitation with the TA. These weeks are indicated on the\nschedule\nby the word RECITATION in bold capital letters.\n\nAttendance and participation in these recitations is mandatory. Recitations will take a discussion format focusing on topics from lectures and course reading materials. 10% of the grade for the course comes from participation in recitation section.\n\nRequirements and Grading\n\n30% - Midterm exam covering all lecture and required reading material from the first half of the term.\n\n30% - Final exam covering all lecture and required reading material covered after the midterm.\n\n20% - Submissions to the on-line discussion forum.\n\n20% - Participation in recitation.\n\nIn addition to the above requirements, graduate students must also write a 10-page paper on one of the topics from the\nreading list\n.",
  "files": []
}