{
  "course_name": "Foundations of Western Culture:  Homer to Dante",
  "course_description": "As we read broadly from throughout the vast chronological period that is “Homer to Dante,” we will pepper our readings of individual ancient and medieval texts with broader questions like: what images, themes, and philosophical questions recur through the period; are there distinctly “classical” or “medieval” ways of depicting or addressing them; and what do terms like “Antiquity” or “the Middle Ages” even mean? (What are the Middle Ages in the “middle” of, for example?) Our texts will include adventure tales of travel and self-discovery (Homer’s Odyssey and Dante’s Inferno); courtroom dramas of vengeance and reconciliation (Aeschylus’s Oresteia and the Icelandic Njáls saga); short poems of love and transformation (Ovid’s Metamorphoses and the Lais of Marie de France); and epics of war, nation-construction, and empire (Homer’s Iliad, Virgil’s Aeneid, and the Anglo-Saxon Beowulf).",
  "topics": [
    "Humanities",
    "Literature",
    "Classics",
    "Comparative Literature",
    "Philosophy",
    "Humanities",
    "Literature",
    "Classics",
    "Comparative Literature",
    "Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nAs we read broadly from throughout the vast chronological period that is \"Homer to Dante,\" we will pepper our readings of individual ancient and medieval texts with broader questions like: what images, themes, and philosophical questions recur through the period; are there distinctly \"classical\" or \"medieval\" ways of depicting or addressing them; and what do terms like \"Antiquity\" or \"the Middle Ages\" even mean? (What are the Middle Ages in the \"middle\" of, for example?) Our texts will include adventure tales of travel and self-discovery (Homer's\nOdyssey\nand Dante's\nInferno\n); courtroom dramas of vengeance and reconciliation (Aeschylus's\nOresteia\nand the Icelandic\nNjals saga\n); short poems of love and transformation (Ovid's\nMetamorphoses\nand the\nLais\nof Marie de France); and epics of war, nation-construction, and empire (Homer's\nIliad\n, Virgil's\nAeneid\n, and the Anglo-Saxon\nBeowulf\n).\n\nCourse Requirements\n\nAttendance\n\nYou may miss one class, no questions asked. After that, unexcused absences will lower your Participation grade (see below) at the rate of one \"tick\" (A- to B+, C to C-) per day. Excused absences are for serious illness, family emergencies, and the like.\n\nWritten Assignments\n\nYou will complete three forms of written\nassignments\nduring the term.\n\nThree short (two-page) plot summaries of one of texts (or a portion thereof) that we have read in class. 15% of total grade.\n\nOne short (four-page) exercise designed to teach you the basics of what \"close reading\" is, and how to make it the foundation of arguments about literary texts. First draft, 5%; second draft, 10% of total grade.\n\nOne substantial (eight-page) literary essay that makes a detailed, textually based argument about one of the many ways in which Virgil's\nAeneid\nenlarges upon, revises, or suggestively ignores prominent themes, images or characters from either or both of Homer's epic poems. First draft, 10%; second draft, 20% of total grade.\n\nOpen-Book, Open-Note Final Exam\n\nBecause we are covering a great deal of material (of necessity; it's a very long historical period), I want to give you the opportunity to demonstrate synthetic understanding and appreciation of the many texts that you will not have the opportunity to write about in depth. The exam will consist of a number of short essays, covering the entire term but focusing on the texts read after the\nAeneid\n. 20% of total grade.\n\nParticipation\n\nBecause the Communication requirement is designed to encourage oral as well as written forms of expression, and in order to give everyone a stake in fostering engaged class discussions, the final 20% of your grade will be determined by the quality of your engagement with me and your fellow students in class. This will involve not simply \"talking in class\" (in which category I will value quality over quantity), but also, in teams of two, taking responsibility for helping to lead class discussion for one day. Early in the semester I will pass around a sign-up sheet with available dates and give more detailed suggestions on how to prepare for this element of the course. (I will be more lenient in my assessment of the teams' discussion-management based on how early in the semester they perform, since it is always easier to have models of what does and doesn't work, an advantage that later teams will necessarily have.)\n\nGrades\n\nGrades will be assigned in accordance with MIT's definitions, which I reprint below (bold-faced adjectives have been thus emphasized by the Institute):\n\nA - Exceptionally good performance, demonstrating a\nsuperior\nunderstanding of the subject matter, a foundation of extensive knowledge, and a skillful use of concepts and/or materials.\n\nB - Good performance, demonstrating capacity to use the appropriate concepts, a\ngood\nunderstanding of the subject matter, and an ability to handle the problems and materials encountered in the subject.\n\nC - Adequate performance, demonstrating an\nadequate\nunderstanding of the subject matter, an ability to handle relatively simple problems, and adequate preparation for moving on to more advanced work in the field.\n\nD - Minimally acceptable performance, demonstrating at least\npartial familiarity\nwith the subject matter and some capacity to deal with relatively simple problems, but also demonstrating deficiencies serious enough to make it inadvisable to proceed further in the field without additional work.\n\nF - Unsatisfactory performance.\n\nAs the above makes clear, MIT defines a B as an actively good grade, and reserves the A to recognize truly \"exceptional\" performance. I take these definitions seriously, and you should expect to receive grades in accordance with them.\n\nImportant Information\n\nPlease read the following carefully and consult me or one of the resources listed below if you have questions.\n\nMIT Literature Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nCourse introduction\n\nIliad\n, books 1-6\n\nFirst summary due 1 day later\n\nIliad\n, books 7-12\n\nClose reading exercise due 2 days later\n\nIliad\n, books 13-18\n\nIliad\n, books 19-24\n\nFirst summary revision due 4 days later\n\nOdyssey\n, books 1-6\n\nOdyssey\n, books 7-12\n\nClose reading exercise revision due 2 days later\n\nOdyssey\n, books 1-12 (discussion)\n\nOdyssey\n, books 13-18\n\nOdyssey\n, books 19-24\n\nAeneid\n, books 1-4\n\nSecond summary due 2 days later\n\nAeneid\n, books 5-8\n\nAeneid\n, books 9-12\n\nInferno\n, cantos 1-12\n\nMandatory essay conferences due 2 days later\n\nInferno\n, cantos 13-23\n\nInferno\n, cantos 24-34\n\nThird summary due 2 days later\n\nAeschylus,\nAgamemnon\n\nAeschylus,\nLibation Bearers\n\nHomer/Virgil essay due 2 days later\n\nAeschylus,\nEumenides\n\nNjals saga\n, chapters 1-77\n\nNjals saga\n, chapters 78-133\n\nNjals saga\n, chapters 134-end\n\nBeowulf\n, lines 1-1650\n\nBeowulf\n, lines 1651-end\n\nRevised Homer/Virgil essay due 2 days later\n\nde France, Marie.\nLais\n, pp. 28-125\n\nLais\n, pp. 126-233\n\nClass party 2 days later",
  "files": [
    {
      "category": "Resource",
      "title": "Close Reading Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-001-foundations-of-western-culture-homer-to-dante-fall-2008/46cc4d6a751e3d91c14ceab43ab43d35_close_read_exer1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.001 Foundations of Western Culture: Homer to Dante\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nArthur W. Bahr\n\n21L.001\nFall 2008\n\nClose Reading Exercise, due by email 2 days after SES #3\n\nMost readers of Homer's Iliad have found Agamemnon an unsympathetic character, in a\nhost of different ways and for a wide range of specific causes. Your assignment is to use\nthe techniques of close reading we've discussed in class as a way of delving more deeply\ninto just who this figure is: the war-leader of the Achaean host, yet in the dramatic\narchitecture of the poem subordinate to Achilles, Hector, and a host of gods and\ngoddesses. Why, precisely, and in what ways can he be read as unsympathetic? Do you\nagree with such assessments or not, and why? Does his character evolve over the course\nof the reading to this point? You have the entire first half of the Iliad to use as data,\nthough with such a large range of material to explore, you will need to be strategic about\nwhich passages you focus on in depth.\n\nYour analytic method will need to consider how all of the elements of close reading we\nhave discussed intersect with what actually happens in the Iliad: what Agamemnon does\nand does not do; says and does not say; and how all of this compares and contrasts with\nthe actions and words of other characters, mortal and divine. Bear in mind that I am an\nintelligent reader and do not need to be informed of the obvious: that it was foolish of\nAgamemnon to take Achilles' concubine, for example. Rather I am interested in how the\ntexture of the text - its diction, tone, syntax, and so on - reinforce or complicate Homer's\ndepiction of Agamemnon.\n\nThe first draft of this exercise that is due on Friday does not need to be a sustained,\ncoherent literary argument about Agamemnon's character (though the revised version due\ntwo weeks later does, so any progress you can make toward such a document is all to the\ngood). At this stage I am most interested in - read: will grade you on - how insightfully,\ncreatively, and convincingly you make arguments about how the subtleties of Homer's\nlanguage create nuance and complexity in the depiction of a principal though often\noverlooked character.\n\nThe document you present to me can be a finished essay or a series of close reading-\nbased interpretations of scenes and speeches, with or without a larger provisional\nargument. Do not worry about form at this point: if you have read closely, analyzed\ncreativey, and argued convincingly, you will be fine."
    },
    {
      "category": "Resource",
      "title": "Elements of Close Reading",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-001-foundations-of-western-culture-homer-to-dante-fall-2008/1edceb240bc75f850dd2a993e4ad2d60_elemntcloseread1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.001 Foundations of Western Culture: Homer to Dante\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nArthur W. Bahr\n\n21L.001\nFall 2008\n\nElements of Close Reading\n\nDiction: also known as \"word choice,\" diction involves the decision to use one word or\nphrase - what's actually on the page - as opposed to any of the nearly infinite other ways\nof saying roughly the same thing. \"Vengeance\" (for example) is not the same word as\n\"retribution,\" \"payback,\" \"punishment,\" or even \"revenge,\" and close attention to diction\nasks what effects an author achieves by picking that word as opposed to those others.\n\nTone: diction (among other things) helps to create tone, our ability to describe a passage\nor speech as \"bitter,\" \"heroic,\" \"wily,\" or any of the other wonderful adjectives with\nwhich English is blessed. Sometimes tone is obvious (and correspondingly less\ninteresting to focus on), other times much less so, and often it hovers or shifts between\ndifferent or even opposed adjectives; always look at the cumulative effect of diction and\nissues below before arriving at a conclusion.\n\nSyntax: broadly defined as \"sentence structure,\" namely how complex or simple, neatly\nparallel or wildly expansive, the sentences, clauses, and phrases of a given passage are.\nComplex sentences can enmesh and entrap the reader, which could be a deliberate\nstrategy (e.g., the wiles of Odysseus) or the mark of an incompetent speaker; similarly,\nsimple sentence sturctures might indicate noble clarity of character or dim-witted single-\nmindedness.\n\nSound (including alliteration and assonance): simply that, what the language sounds like;\nalways read passages you're working on out loud. Alliteration involves multiple words\nin the same sentence or phrase beginning with the same sound; assonance consists of\ninternal rhyme or off-rhyme, as in \"the consonants' assonance affected their sense\" (an\nextreme example). Think too about the potential effect of vowel- or consonant-heavy\npatches of language, and that of monosyllabic or polysyllabic ones.\n\nRhythm and cadence: especially crucial in poetry, but not to be overlooked in prose;\nagain, read out loud and take note of where the words flow especially smoothly, and\nwhere they don't. Stuttering or awkward clusters of words (thickly bunched consonant\ngroups of the str- thw- and -nch variety) or phrases (lots of brief phrases or incomplete,\ninterrupted sentences) might indicate (for example) intensity of ill-controlled emotion.\n\nMetaphor, Simile, and Image: if a character is said to be \"like\" or do something \"as\"\nsomething else, pay close attention to what that is, especially in Homer, who invented the\nso-called \"heroic simile,\" a long, detailed comparison of a charater's actions or thoughts\nto those of a raging lion, boundless ocean, tranquil sunset, or whatever. And always,\nalways look for images or image-clusters (animals, weather phenomena, whatever) that\nparticularly catch your eye or recur at various points.\n\nRepetition: Especially in Homer, look for repeated words, phrases, and even entire\npassages. Sometimes these will be purely formulaic (e.g., \"daughter of Zeus whose\nshield is thunder\"), but don't be afraid to argue for their significance if you feel it exists;\nthink too about the effect of one character repeating verbatim what another said earlier."
    },
    {
      "category": "Resource",
      "title": "Homer/Virgil Essay Prompt",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-001-foundations-of-western-culture-homer-to-dante-fall-2008/546be38c4e1d1a9ed5371a8139c00ad7_virg_home_prompt.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.001 Foundations of Western Culture: Homer to Dante\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nArthur W. Bahr\n21L.001\nHomer/Virgil Essay Prompt\n\nWrite a substantial (eight-page) essay that makes an argument about one way in which\nVirgil engages with Homeric epic: how and to what effect he does it, and how it should\naffect our understanding of the Aeneid and, retrospectively, the Iliad and/or Odyssey.\nThis is a wide-open topic, and it's crucial to your success that you sharply limit your\nfocus so that you can acquire depth before attempting to make a broader argument about\nhow your chosen theme relates to the texts more globally. I encourage you to explore\nindependently and craft your own focus; the following are examples that you are free to\nadopt should you wish to.\n\n1) Competitive tension, on and off the battlefield. Obviously interesting would be the\nfuneral games for Patroclus and Anchises in the Iliad and Aeneid, respectively. You\nmight also consider the various duels of the Iliad (as distinct from the chaotic cut-and-\nthrust of all-out battle); Odysseus's participation in the games on Phaeacia; and the way\nthat initially non-lethal competition with the bow turns into slaughter near the end of the\npoem. Surprising or suddent drawbacks from competitive engagements (Glaucus and\nDiomedes, various exchanges between the gods) might factor into your readings too.\n\n2) Death and the Underword. Think about representations of the dying and dead,\nfocusing specifically but not necessarily exclusively on Aeneas's descent into the\nUnderworld to speak with his father, and Odysseus's analogous trip to speak with the\nshades of Tireisias and his mother. You might also consider the organization of the\nUnderworld, the fates and attitudes of those resident there, and the impact that the dead\nhave upon the living. Depictions of the act of dying (in battle, for example) might also\nprove fruitful to consider.\n\n3) Female prominence and power. The Aeneid is famous for its women: tragic Dido,\nvengeful Juno, valorous Camilla. Yet many have argued that this prominence only\ndisguises (and thinly at that) the extent to which the poem valorizes masculine\nachievement at the expense of female power; Dido is abandoned by Aeneas, Juno fails to\nhalt his progress, and Camilla is killed by his forces. How does Virgil build on or depart\nfrom (or both) Homer's representations of \"women in charge,\" and how does all this\nmatter to our understanding of the Virgilian and Homeric projects as a whole?\n\n4) Comradeship and homosocial bonds. Think about the relationship(s) between a)\nAeneas and Pallas and/or b) Nisus and Euryalus in relation to that of Achilles and\nPatrocus, which in the centuries after Homer wrote was widely regarded (by Plato and\nAeschylus, among many others) to have been erotic. The point here is not to speculate\nabout the activities or proclivities of characters outside the confines of the fictions in\nwhich they appear, but rather to analyze how masculine devotion to other men is\nrepresented in those fictions, and how that representation matters to our understanding of\nother themes that Virgil and Homer tackle.\n\nArthur W. Bahr\n21L.001\n\n5) Armor and identity. The crucial importance of armor - practical, symbolic, and at\ntimes (we suggested) almost magical - emerges clearly in both Homer and Virgil, but to\nsubstantially different effect. Think about how Achilles' armor, the shield crafted for\nhim subsequently, and Aeneas's shield (this is not an exhaustive list; you could talk about\nothers, and/or fewer than the three listed above) create, communicate, and delimit\nmeaning. How do the arms and the man who wears them (to borrow shamelessly from\nVirgil) interact, and how does this matter?\n\n6) A topic arrived at independently, in consultation with me.\n\nBear in mind that these are only suggestions on how to begin organizing your thoughts.\nYou may form arguments that draw on images or themes at the junction of two or more\nof these listed \"topics\" (or, of course, from other material entirely). The questions I pose\nare designed to jump-start your creative process, not to constitute a set of \"answerables\"\nthat you must \"deliver\" (to adopt, momentarily, the horrifying lexicon of business)."
    },
    {
      "category": "Resource",
      "title": "Techniques of Close Reading",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-001-foundations-of-western-culture-homer-to-dante-fall-2008/b9fea184063a713b140bdf9cc657feba_tech_close_read1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.001 Foundations of Western Culture: Homer to Dante\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nArthur W. Bahr\n\n21L.001\nFall 2008\nTechniques of Close Reading\n\nThe first and most important technique of close reading is to think actively about all the\nelements of close reading on the sheet and the many I doubtless left out (enjambment, for\nexample, or the prevalence of active vs. passive voice) as you read, closely, the text.\nRead it several times; read it out loud (several times); take notes on anything and\neverything that catches your eye as you read. Do not try to make the pieces add up to a\ncoherent argument or even picture just yet; instead try to notice everything that is\npotentially interesting about how the text conveys meaning. This is the time to be\ncapacious, not discriminating.\n\nNow that you've noticed a lot of stuff, go back and take notes on what significance you\nthink it has: that is, how does it affect our understanding of a character, the plot,\nwhatever. Remember close reading is about using the how of narrative to come to a more\nin-depth understanding of what it narrates and why it does so in the way it does. Some of\nwhat you've noticed may have no braoder significance, or none that you can come up\nwith. That's fine; don't try to wrench meaning out of a moment you genuinely believe\nhas none. At the same time, don't be shy about speculating on a textual moment's\nsignificance, especially if it corroborates what a different textual moment suggests. For\nexample, if the diction in a given line seems to suggest X, and the syntax seems to as\nwell, you might more readily trust an instinct that the rhythm and cadence of the lines\nfurther strengthens the reading. But at this stage don't worry too much about how\nplausible your thoughts on significance are; think broadly and fearlessly, as there will be\nplenty of time to self-censor later.\n\nNow leave it alone. Go away, think about something else, eat, get some exercise,\nwhatever. When you come back, read closely again, both the text and your own notes,\nand this time also think critically about all the stuff you noticed the first time, and the\nsignificance that you ascribed to it. Which of your points seem the most convincing,\nwhich seem the most interesting (these may not be the same), and which seem like a\nstretch? Which points reinforce one another along lines described above, and which\nseem to be at odds with one another? Now is when you subject your earlier enthusiasm\nto hard analytic rigor. What objections do you think I or other informed readers might\nhave to your speculations? How would you respond? Putting the pieces together, what\ndoes the big picture of your close reading suggest, what larger argument can you see the\noutlines of? Where else in the text would you go to find evidence to support his larger\nargument? What objections to it would you have to deal with, and how would you\nenvision doing so?\n\nThis - in very abstract terms - is how to use close reading in the service of literary\nanalysis. Your close reading exercise will ask you to put these abstract guidelines into\npractice."
    }
  ]
}