{
  "course_name": "Frameworks of Urban Governance",
  "course_description": "Urban governance comprises the various forces, institutions, and movements that guide economic and physical development, the distribution of resources, social interactions, and other aspects of daily life in urban areas. This course examines governance from legal, political, social, and economic perspectives. In addition, we will discuss how these structures constrain collective decision making about particular urban issues (immigration, education…). Assignments will be nightly readings and a short paper relating an urban issue to the frameworks outlined in the class.",
  "topics": [
    "Social Science",
    "Economics",
    "Political Economy",
    "Public Administration",
    "Regional Politics",
    "Urban Studies",
    "Social Science",
    "Economics",
    "Political Economy",
    "Public Administration",
    "Regional Politics",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions for 4 days, 3 hours / session\n\nCourse Description\n\nUrban governance comprises the various forces, institutions, and movements that guide economic and physical development, the distribution of resources, social interactions, and other aspects of daily life in urban areas. This course examines governance from legal, political, social, and economic perspectives. In addition, we will discuss how these structures constrain collective decision making about particular urban issues (immigration, education...). Assignments will be nightly readings and a short paper relating an urban issue to the frameworks outlined in the class.\n\nCalendar\n\nSES #\n\nTOPICS\n\nLegal\n\nPolitical\n\nSocial\n\nEconomic",
  "files": [
    {
      "category": "Resource",
      "title": "Final Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-957-frameworks-of-urban-governance-january-iap-2007/bd3862e8157aa3c41426b5d95d6ed2e1_finalpaper.pdf",
      "content": "11.957: Frameworks of Urban Governance\nHomework: Final Paper\nDue: Sunday, February 4, 5:00 pm\n5 - 7 pages double spaced\nDefine an urban problem that interests you and types of action that you think would improve the\nproblem. Be as specific as possible. Then, analyze your topic in the context of each of the\nframeworks discussed in class. In addition, you may choose one additional framework as long as\nyou specifically define your framework and its fundamental importance. Discuss the types of\nconstraints each framework implies for your recommended actions and the types of strategies\nmost likely to be pursued when viewing the problem from the perspective of each framework.\nHow do the frameworks differ?\nBe as specific as possible. You can draw on readings from the week or outside readings, but if\nyou use other sources cite them and situate them in one of the frameworks from the week."
    }
  ]
}