{
  "course_name": "French Film Classics",
  "course_description": "This course covers the history and aesthetics of French cinema from the advent of sound to present-day. It treats films in the context of technical processes, the art of narration, directorial style, role of the scriptwriter, the development of schools and movements, the impact of political events and ideologies, and the relation between French and other national cinemas.\nTaught in English, the films are screened with English subtitles. Students may complete written assignments in French.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis course offers a survey of French film classics from cinema's origins in the late nineteenth century to the present day. The class queries both the notion of \"French\" or national cinema and the idea of the \"classic\" film. It asks how we define French cinema and what assumptions and processes turn a film into a \"classic.\" As such we will learn about the history of film production, exhibition, reception, aesthetics, and theory. As we move chronologically, we'll study the material context of film alongside French society and culture. We'll watch popular films alongside classic films, questioning what differentiates them. The course is taught in English, and films are screened with English subtitles. Students may complete written assignments in French.\n\nDesignations:\nThis course fulfills the\nHASS-H\nrequirement.\n\nCourse Goals\n\nUpon completion of this course students will be able to:\n\nIdentify key figures, works, and aesthetic trends in French film.\n\nSituate film within the context of its production, exhibition, and reception.\n\nAnalyze the role of film in modern society.\n\nArticulate the function of \"French\" and \"classic\" as film categories.\n\nPerform visual and formal analysis of moving images.\n\nCraft effective oral and written arguments about visual materials and texts.\n\nRecommended Text\n\nWilliams, Alan.\nRepublic of Images: A History of French Filmmaking\n. Harvard University Press, 1992. ISBN: 9780674762688. [Preview with\nGoogle Books\n]\n\nAssignments and Grading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n15%\n\nQuizzes\n\n10%\n\nResponses\n\n20%\n\nPresentation\n\n20%\n\nOutside Film-going Experience Review\n\n15%\n\nFinal Exam\n\n20%\n\nClass Participation:\nEvaluated based on student's attendance, the demonstration of adequate preparation, and the quality (not just quantity) of oral participation.\n\nAttendance Policy:\nIf you sleep through class, you will receive a zero participation grade for that session.\nStudents who miss more than 2 classes will automatically receive a failing grade\n.\n\nQuizzes:\n6 quizzes will test you on the content of readings, lectures, and films. These will not be announced in advance and cannot be made up if you miss them. Your lowest quiz score will be dropped.\n\nResponses:\nEach week students will write a response to the texts / film(s) for the week.\n\nPresentation / Film Pitch:\nWorking in groups of 2 or 3, students will give one 10-15 minute oral and visual presentation about a film and readings. Presentations must present an argument about the material and will be graded on content, clarity, engagement with the topic, and oral communication skills.\n\nOutside Film-Going Experience Review:\nStudents will attend one French film screened outside of our class and write a paper about the film and the film-going experience.\n\nFinal Exam:\nThe final exam will test the knowledge of French film that students acquire over the course of the semester and their ability to construct arguments about the ideas we discuss. Quizzes and weekly responses will provide preparation for the final.\n\nCitations:\nAll written assignments must employ a standardized citation system (i.e., MLA, Chicago). Students\nmust\nsubmit a list of resources consulted for their oral presentations.\n\nLate assignments\nwill lose one full letter grade for each day past the deadline. Assignments handed in a week late will automatically receive no credit. No extensions will be granted after an assignment's due date has passed.\n\nScreenings:\nMost films will be screened Monday evenings. Monday screenings are recommended but not mandatory.\n\nTechnology\n\nCell phones must be silenced (not just placed in vibrate mode) and put away during class time. You may use laptops / tablets, but only to take notes or access information relevant to the topic at hand. If used for other purposes, laptops / tablets will be banned.\n\nEnrollment Limits\n\nEnrollment is limited to 18 students for pedagogical purposes. Priority will be given to pre-registered students, including pre-registered undergraduates who were cut from the same class the previous semester due to the enrollment cap. In case of over enrollment, preference given to pre-registered declared French majors, minors and concentrators, followed by juniors, seniors, sophomores, continuing students, and freshmen (in that order), who attend the first day of class.\n\nAcademic Integrity\n\nStudents are expected to adhere to\nMIT's Academic Integrity policies\n. All work (research papers, weekly papers, presentations) must be completed independently, unless otherwise cleared by the instructor. Students are encouraged to discuss the readings and their papers with each other (they may, for example, want to practice their presentations for their classmates or have a classmate look over a draft of their film experience paper), but they are individually responsible for all written work.\n\nViolating the Academic Integrity policy in any way (e.g., plagiarism) will result in official Institute sanction. Possible sanctions include receiving a failing grade on the assignment, being assigned a failing grade in the course, having a formal notation of disciplinary action placed on your MIT record, suspension from the Institute, and expulsion from the Institute for very serious cases.\n\nPlease review the Academic Integrity policy and related resources (e.g., working under pressure; how to paraphrase, summarize, and quote; etc.) and contact me if you have any questions about appropriate citation methods, the degree of collaboration that is permitted, or anything else related to the Academic Integrity of this course.",
  "files": [
    {
      "category": "Resource",
      "title": "What’s so Funny about Les Aventures de Rabbi Jacob (1973)?: A Cinematic Comedy between History and Memory",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-052-french-film-classics-spring-2015/98cab31c9a67e24ac38fe14915f5cbbb_MIT21G_052S15_RabbiJacob.pdf",
      "content": "DRAFT: This manuscript is under revision and a work-in-progress.\nWhat's so Funny about Les Aventures de Rabbi Jacob (1973)?: A Cinematic Comedy\nbetween History and Memory\nMichael Joseph Mulvey, PhD\nSaint Thomas University\nNe donnons pas trop d'importance aux Aventures de Rabbi Jacob. \"After all, it's only a movie,\" eut dit\nAlfred Hitchcock.\nGerard Oury, Ma grande vadrouille, 20011\nDirector Gerard Oury's (1919-2006) Les Aventures de Rabbi Jacob was a\ngroundbreaking film that satirized French intolerance as it preached multiculturalism and\nmetissage. Despite the plot of non sequiturs and Louis de Funes' burlesque hysterics,\nRabbi Jacob merits our critical attention not only because it was the top French box\noffice draw of 1973 and a 1974 best foreign film Golden Globe nominee (it lost to\nIngmar Bergman's Scenes from a Marriage), but for its imaging of the Jew, the Arab, and\nthe bourgeois at the historical juncture of the Fourth Arab-Israeli War. Why did the\noriginal French audience of over seven million laugh at Rabbi Jacob? Why did a\nminority, including the hijacker of an Air France flight, find nothing funny about the\nfilm? Oury's screenplay, co-written with his daughter Daniele Thompson (1944-), in\nconsultation with Rabbi Josy Eisenberg (1933-), host of La Source de vie on France 2\ntelevision since 1962, betrayed the noble or naive belief that comedy served a therapeutic\nfunction inside the national culture of a liberal-democratic society. In the case of Rabbi\nJacob, popular comedic cinema rather than avant-garde films or documentaries became\nthe privileged means for French audiences to work through anti-Semitism and racism.\nRabbi Jacob made the bourgeois bigot ready to proclaim \"La France aux Francais\"\nlaughable as it satirized intolerance as stupidity. Simultaneously, Rabbi Jacob imagined a\ntranscendental French reconciliation with both, as well as between, Jews and Arabs.\nRabbi Jacob thus was a serious rhetorical moral-political strategy that communicated an\noptimistic fantasy scenario thereby liberating French audiences from racist realities,\nsocietal divisions, and historical injustices. Rabbi Jacob, however, treated its Arabs and\nJews differently: French culture served secular North African Arabs as a template for\ntheir universality whilst Jewishness, a cult of memory, demanded French acceptance of\ncultural plurality. Imagined communities--national identities--depend on every\nparticipant's ability to say that the collective \"we\" is fundamentally good despite the past\nand present crimes committed in \"our\" name.2 Rabbi Jacob contributed to such a task and\nhas continued to do so a canonized culture text since 1973.\nThis essay takes a historical approach to contextualizing Rabbi Jacob with the\ncaveat that historians can never fully comprehend why people laughed at Rabbi Jacob or\nexplain why individuals who \"got\" the joke did not find it funny at all. An audience in\nOctober 1973 did not react to Rabbi Jacob as an audience in October 2014 might only\nwearing more polyester and corduroy. The plot remains the same, but the cultural context\nthat informs an audience's sense of humor alters. Historian Robert Darnton struggled to\nuncover why eighteenth-century Parisian print workers found it funny to torture cats--to\n\n\"get\" the joke was to \"get\" artisanal culture under the Old Regime.3 Rabbi Jacob was an\ninformed comedic consumer product rather than a spontaneous labor revolt against\nauthority. Yet as a cultural artifact Rabbi Jacob assembled a complex repertory of\nphysical action (slapstick), shared identity (drag, parody, the burlesque, caricatures),\nirrationality (masking, absurdity), and language (puns, exaggerations, allusions), which\ninvited spectators to laugh at a paradoxical recastings of French reality in 1973.\nDominick LaCapra noted that the Voltarian smirk replaced carnivalesque laughter as a\nform of social protest--what Darnton described as \"laughter, sheer laughter, the thigh-\nslapping rib-cracking Rabelaisian kind.\"4 Carnival humor withdrew from the street and\nthe marketplace only to make occasional appearances in cabarets and vaudevillian\ntheatre. Rabbi Jacob's fell back on carnival for humor and laughter, nonetheless, the\nlatter were communication strategies for a Voltarian message. Rabbi Jacob was\ninextricably linked to visualizations of citizenship, identity, multiculturalism, and\nmemory. Rabbi Jacob thus had an educational potential inside France's public sphere of\nrational debate albeit the real effects of humor on individual subjectivity in time cannot\nbe measured. The aim of this essay therefore is threefold: to provide critical analysis of a\nfilm; to understand where those who produced Rabbi Jacob and those who consumed\nRabbi Jacob were coming from; and, to reflect on the legacies of Rabbi Jacob in French\nculture.\nUntil recently, Rabbi Jacob and similar films were never analyzed through the\nauteur-ist lens because they lacked the stylistic and aesthetic innovation of nouvelle\nvague or politically committed directors. 5 As Guy Austin noted, there has been a\nscholarly tendency to think French cinema as intellectual or cerebral rather than comedic\nand corporal.6 Comedy, however, has been France's most popular cinematic genre since\nWorld War Two. Critic Michael Kimmelman argued that the French obsession with\ncomedic cinema evidences a pervasive social desire for escapism in producers, directors,\nand audiences who have refused to confront French realities since 1945.7 To ignore or\ndismiss France's most successful cinema, however, is to disregard its potential\ncomplexity and reject comedy's moralizing power in a liberal democracy. As Remi\nFournier-Lanzoni observed, French film censorship, already lax under the Pompidou\nadministration, seldom policed cinematic comedies for their politics.8 Rabbi Jacob thus\nserved as a vehicle for Oury to speak freely with French popular audiences about anti-\nSemitism and racism.\nThe Plot\nA brief summary is advantageous to those unfamiliar with Rabbi Jacob. The\npretext for the entire film is the bar mitzva of David Schmoll on the Rue des Rosiers, a\nhistorically Ashkenazi Parisian neighborhood. The family invited David's American-\nbased relative, Rabbi Jacob (played by Marcel Dalio), to officiate the service. Rabbi\nJacob and his American assistant thus depart Manhattan for France, Rabbi Jacob's\nbeloved birthplace not visited since he fled during the Second World War, on mid-day\nFriday. An Orthodox Rabbi strangely flies directly into Shabbat to facilitate the plot. Like\nmuch of what is to follow, the audience must suspend its disbelief. Meanwhile, that\nFriday afternoon in France, a chauffer named Salomon (Henri Guybet) and his employer\nVictor Pivert (Louis de Funes), a bourgeois, racist, anti-Semitic, and xenophobic factory\nowner, race from Deauville, where Pivert's wife Germaine (Suzy Delair) fears he has a\n\nmistress, to Paris in a Citroen DS. The DS carries a small upside down pleasure boat on\nits roof. Pivert is rushed to return and prepare for his daughter's marriage to a pimply-\nfaced aristocrat on Saturday. As they drive, Pivert makes a litany of derogatory remarks\nabout blacks, foreigners, and interracial marriage. Pivert then learns, to his stupefaction,\nthat Salomon is expecting the visit of his uncle Rabbi Jacob, a Jew. Pivert's amazement\nthat his chauffer is Jewish ultimately leads the car to overturn into a lake boat end down.\nSalomon, respecting the Shabbat, is fired and abandons his employer by the roadside. The\nstranded Pivert seeks shelter in a nearby factory--Le Yankee Chewing Gum plant--\nwhere Arab assassins led by Le colonel Fares (the Italian Renzo Montagnani), described\nby Pivert as \"oily and curly-haired,\" happen to be torturing Mohamed Larbi Slimane (a\ntanned Claude Giraud), a socialist revolutionary from an unidentified resource-rich North\nAfrican nation. Pivert accidently frees Slimane who then takes him hostage. In the\ninterim, the police suspect Pivert rather than the assassins had fired a machine gun at\ngendarmes. Slimane and Pivert, pursued by assassins and the police, flee to Orly airport.\nThe odd pair proceed to the toilets where they jump two Orthodox Jews stealing their\nclothes and--magically--beards and side locks. Emerging from the bathroom, the\nSchmoll family mistake Pivert for the French-born Rabbi Jacob visiting from\nManhattan's Lower East Side with his American assistant to officiate his nephew's bar\nmitzvah. The film's title is misleading. These are not the adventures of Rabbi Jacob.\nThey are the adventures of Pivert and Slimane in Hasidic drag.\nThe two imposters are taken with great fanfare to the Rue des Rosiers in the\nMarais for David's bar mitzva. Slimane, the secular Arab, serves as Pivert's religious\nguide as they attempt to conceal their true identity inside and outside the synagogue.\nSalmon is also there to welcome Rabbi Jacob and immediately recognizes his boss. The\nlatter pushes Pivert into the most absurd and memorable scene of the film: a complicated\nHassidic dance number that Pivert masters brilliantly. Soon after, Salmon and Pivert\nreconcile and Salmon and Slimane shake hands as self-identifying \"distant cousins\"\nbefore fleeing. Elsewhere, the assassins and police proceed to accost the real Rabbi\nJacob and his assistant who they think are Pivert and Slimane. After even more screwball\ntwists and a great deal of beard tugging, all conflicts are resolved and Slimane, now a\nnewly elected president, leaves France with Pivert's daughter (Sylvette Herry or Miou-\nMiou), with the industrialist's blessing, and the support of the Fifth French Republic.\nThe Moralizing Politics of a Cinematic Comedy\nDecolonization, France's diminished standing in a Cold War world, a growing\nawareness of the Shoah, European integration, a youth generation's reassertion of radical\nindividualism and sexual desire, and immigration are inseparable from Rabbi Jacob's\nexplorations of identity, memory, anti-racisme, tolerance, and metissage. While Rabbi\nJacob was contradictory and its characterizations problematic, historians should\nacknowledge the film and its struggle to promote an affirmative culture that allowed for\nhuman difference (multiculturalism) and reconciliation (trans/national unity). Rabbi\nJacob was a powerful communicator of liberal and moral imagery in its original context.\nThe film depended on various humorous strategies to arouse laughter: incongruous\njuxtapositions, exaggerated characteristics, and relief from awkward tension. Laughter\nallowed audiences to collectively condemn negative impulses and visualize the resolution\nof conflicts through the re-establishment of social order. Paradoxically, Rabbi Jacob\n\nachieved the conservative-Gaullist aim of having audiences share a collective laughter\nthereby reminding filmgoers of their membership to a national community while\nnormalizing multicultural tolerance.\nKristin Ross observed that May 1968 disrupted de Gaulle's confident centrist-\nhumanism as it revealed a widening gulf between the French right and left. The upheaval\nof 1968 \"achieved unforeseen alliances and synchronicities between social sectors and\nbetween very diverse people working together to conduct their affairs collectively.\"9\nRabbi Jacob re-imagines--through Pivert and Slimane's comical identity play--the\nfoundation of new alliances of equality between the French, Jews, and Arabs. In 1973,\nthe film presented a transcendent utopian vision of social peace to audiences in a France\nmarked by a new anti-Semitism and intense racist violence against Maghrebin\nimmigrants. In 1971, Marseilles witnessed the murder of Algerians in a wave of racist\ncrimes.10 Although an awareness of the Shoah inaugurated a reevaluation of deportation\nnarratives in France, hatred of Jews continued although anti-Semites now expressed\nthemselves in a new language of anti-Zionism. Jean-Marie Le Pen founded the Front\nNational in 1972 proudly defending a French identity tied to whiteness and\nCatholicism.11 Anxiety over Algeria and its aftermath, had given way to a debate over\nthose who had come to live within French society; particularly, the stigmatized Algerian\nand Maghrebin worker. Uncertain economic futures, soon to be aggravated by the global\noil crisis, provoked anti-immigration legislation and more racist attacks, including\nmurders in Paris and its suburbs with ratonnades in Marseilles and Grasse during the\nsummer of 1973.12\nThis context informed Oury when he decided to write a screenplay with the goal\nof making \"a comedic film against racism\" specifically for the broadest possible\naudience. 13 He was confident that a humorous, anti-racist film could serve moral\nimperatives as it maximized profits for financial backers. Oury's foremost ambition was\nmoral rather than political. The director believed the French desperately needed a film\nthat would \"exorcise certain demons France feared\" while \"denouncing intolerance,\nracism, and anti-Semitism by making audiences laugh.\"14 Oury felt the best means to\ncombat anti-Semitism and racism inside France was not an intellectualizing or accusatory\n\"film a these\" that alienated general audiences, but a highly accessible movie that\nprovoked laughter. Oury's un-consciously embraced themes the Dutch Johan Huizinga\nconsidered in Homo Ludens (1938). Huizinga wrote Homo Ludens in opposition to the\nuncompromising radicalism and humorlessness of National Socialism. The historian\ncalled for a more playful politics that eased tensions and encouraged a spirit of fellowship\nbetween the bitterest of political opponents. As Huizinga put it, \"it is the decay of humor\nthat kills.\"15 To Oury, the laughter evoked by comedy served as social medicine that\ncould heal the collective.\nGaumont studios funded Oury's previous projects and its president, Alain Poire,\nhad just green-lighted Rabbi Jacob when the Schlumberger Corporation acquired the\nstudio and halted all productions for financial restructuring. Having already secured\nactors and a crew, Oury desperately sought new financial backing in early 1973 only to\nhave producer after producer inform him:\nA film on friendship between Jews and Arabs, come on, you must be kidding! You know, in any\nsecond the Orient risks exploding into violence again. And de Funes as a French bourgeois who is\na racist, xenophobic, anti-Semite, disguised as an orthodox rabbi, with a beard and side locks,\n\ntossed into a hostage situation! Arabs will take it the wrong way, Jews even more. What do\nyou want to prove anyway?16\nOury considered rewriting the screenplay for Hollywood before Bertrand Javal signed on\nas producer and assembled four million dollars in financing.17\nRabbi Jacob, like many postwar French comedies, benefited from transnational\nFranco-Italian funding. Hence, Oury knew different linguistic and national audiences\nwould consume the film. As Vanessa Schwartz argued in It's So French!, a study of\npostwar Franco-American cinematic relations, France was not a passive receiver, but an\nactive producer of mass culture. 18 Rabbi Jacob operated across transnational space;\nindeed, Tom Teicholz, a Jewish-American journalist, fondly recalled falling out of his\nseat laughing at New York's 68th Street Playhouse during the film's American release.19\nRabbi Jacob can be read in a French context, but the film was part of a European\nproduction and global distribution system--Rabbi Jacob was a cosmopolitan film. At the\nsame time, the Franco-Italian co-productions and dubbed releases of Jean Girault's\nbeloved gendarme series, Oury's Rabbi Jacob or Edouard Molinaro's La Cage aux Folles\n(1978) made their directors no less engaged with specific national contexts, visual\nlanguages, and anxieties of French audiences or an audiences' awareness that films\naddressed particular subjectivities.\nOury ultimately directed a complicated cultural artifact whose message circulated\nthroughout Atlantic and Mediterranean worlds. The film critiqued nationalist ideologies\ncentered on xenophobia, racism, and ethnocentrism as it celebrated the possibility of\npost-national hybridity, multiplicity, and de-territorialized identities. A moral and\npolitical project, Rabbi Jacob, as shall be discussed, had obvious critical limits. The film,\nhowever, cannot be criticized as an amnesic reaction that completely elided France's role\nin colonization and deportation. Oury engaged with the history/memory couplet that\nacknowledged France's complex and problematic past within the limits of appealing to a\nbroad French audience. Indeed, Rabbi Jacob should be thought in relation to France's\ncinematic dialogue with deportation and the Shoah. What Oury elected not to portray was\na social portrait of a new anti-Semite or a racist organizing ratonnades on the screen. Nor\nwas Rabbi Jacob an exploration into the struggles of postcolonial migrants. After all,\nthose realities were humorless.\nRabbi Jacob nonetheless reflected a growing awareness of the Shoah and the\nfracture colonial. Yet factual cinematic representations documenting the wrongs\nnecessitating reconciliation took a backseat to Oury's advancement of a well-meaning\nand forward-looking, albeit ahistorical, vision. Walter Benjamin's famous angel of\nhistory could see nothing more than catastrophes heaping more wreckage upon wreckage.\nOury felt no burden to document death and inhumanity. Rabbi Jacob mourns neither the\nShoah nor imperialism.\nOury's angel of comedic cinema looked to the horizon. To\nOury's credit, he never filmed that directly referenced the Shoah by having Pivert and\nSlimane flee the Rue des Rosiers through a tunnel rabbi Jacob's sister used to escape\ndeportation during the Occupation.20 He judged the scene too serious for a comedy.\nFrench critics immediately recognized what Oury had attempted to do with Rabbi\nJacob. They almost universally praised him for sugar-coating an anti-racist and philo-\nSemetic message in laughter for popular audiences. At Le Monde, Jean de Baroncelli saw\nin Rabbi Jacob the masterful fusion of a classical comedic motif--the substitution of\ncharacters--with burlesque vaudeville that rather than simply satirize the French racist\n\nwas \"a discreet call to generosity and the communion of all peoples.\"21 Oury, he found,\nhad proven that\na \"cinema populaire\" could offer people more than\nvulgar\ndivertissement, but also a moral education. Henry Chapier writing for Combat found that\nthe film radiated fraternal warmth as it provoked \"habitual crazy laughter\" and \"the\nnoblest of messages.\"22 To Chapier, the film was a moralizing sermon for the masses.\nRobert Chazal at the popular daily France-Soir praised Rabbi Jacob not only for\nproviding \"kilometers and kilometers of laughter,\" but for putting the anti-Semitic and\nanti-Arab Pivert \"the incarnation of a certain French character [bien de Chez Nous]\"\nbefore audiences to laugh at and thereby shame together.23 At the Catholic daily La\nCroix, Henry Rabine lauded Rabbi Jacob as an \"intelligent comedy.\"24 Rabine left the\ntheater impressed that Oury had discovered the perfect balance between \"ha! ha!\" and a\nmessage: \"please, let's not be racist.\" Rabine also celebrated de Funes for perfectly\ncaricaturing an \"inter(national) imaginary\" of the bigoted French bourgeois. As Rabine\nnoted, the racist Pivert was himself a stereotype, but to laugh at him allowed audiences to\nconfirm that they shared neither his values nor the values of those attacking France's real\nNorth African and Jewish communities.\nThe Mythical Bourgeois\nThe film historian Jean-Pierre Jeancolas cited hyper-presentism and respectable\ngood intentions as the defining characteristics of French domestic cinema during 1973\nand 1974 season.25 French films showed national audiences a contemporary France as\nthey either wanted to see it or as they might dream it. He described the cinema as one of\n\"bonne compagnie\" that took audiences on a well-meaning tours of those on society's\nmargins: peasants, leftists, ethnic and racial minorities, and immigrants. To Jeancolas,\nhowever, the season of 1973-1974 confirmed that French comedic cinema was \"a dead\ngenre, without an author or inventor\" despite Rabbi Jacob's box-office triumph. The\nFrench, Jeancolas admitted, still \"laughed lots\" in\ncinemas, but they did so\n\"conventionally... even if sometimes the scriptwriters adapt their dated schemas and\nallusions to this or that contemporary issue.\" 26 Jeancolas was right: Rabbi Jacob\nstylistically lacked any comedic innovation. Oury borrowed much and innovated little on\nFrench classical comedic, vaudevillian, and commedia dell'arte theatrical traditions. The\nbourgeois Pivert's transformative narrative harkened directly back to the nineteenth-\ncentury French vaudevillian theatre of Eugene Labiche. Indeed, the film was a\ncarnivalesque attacks on the ephemeral bourgeoisie similar to Luis Bunuel's surrealist Le\ncharme discret de la bourgeoisie (1972) and Le fantome de la liberte (1974). The\nbourgeois Pivert was Oury's safe receptacle for France's negative compulsions because\nPivert would not alienate working or lower-middle class audiences.\nDe Funes who played Pivert was the son of Spanish immigrants, a devout\nTridentine Catholic, Royalist, and not without confessed anti-Semitic prejudices.27 As de\nFunes told Le Point magazine, playing the role of Rabbi Jacob \"did me good. It helped\nme clean myself up.\"28 In an on-set television interview prior to the film's release, de\nFunes mispronounces Hasidic and then seeks the proper pronunciation when he tells a\njournalistic he plays a Hasidic rabbi in the film.29 As the fictional Pivert, de Funes found\nhimself in the uncomfortable spot of mocking the notion of stable identity through black\nface and Jewish drag. The life-long Catholic de Funes confirmed the Second Vatican\nCouncil's condemnation of anti-Semitism as he denied Catholicism its claims to\n\nuniversality. The majority of the gags in the film centered on Pivert learning to perform\nas a Hasidic rabbi not only by wearing a beard and side-locks, but also speaking Yiddish,\na conversational style (Slimane tells him to answer all questions with a question), Hasidic\ndancing, and religious practices. Pivert's successful identity performance was a parody\nthat subversively questioned essentialist or racialized identity. Jewishness like\nCatholicness or Frenchness was performance. Catholic, French, and bourgeois identity\nthus lost their naturalness in the process.\nThe character Pivert fits into a popular theatrical tradition that maligned the\nbourgeoisie for its values well documented by Sarah Maza.30 The \"bonne compagnie\"\nthat Rabbi Jacob gave audiences was not just of the Jewish and Arab \"Other,\" but also\nwith the elite bourgeois whose genealogy of ridicule traces back to Moliere. Pivert is a\nwealthy philistine with exaggerated and crass behaviors corresponding to no self-\nidentifying elite political or economic group. Theoretically, he corresponds to the\nMarxian definition as a member of a dominant class who owns the means of production.\nPivert is a Catholic and Parisian abstract bourgeois, as opposed to a provincial, protestant\nor a grande variant, concerned with preserving the symbolic capital of his status across\ngenerations. Pivert may emerge a tolerant bourgeois, but his preoccupation with status\nremains. As the still racist Germaine sputters \"mais il est...\" as her daughter leaves with\nSlimane and implied future sexual and marital union, Pivert interjects \"il est president de\nson pays\" before the word \"Arab\". Pivert's daughter is marrying a secular man with\nimpeccable French at the pinnacle of power inside his society. As a Comedie-Francaise\ntrained actor, Oury knew the reconciliation of differences through marriage defined\ncomedy as a genre. Pivert's support for his daughter's choice to marry a foreign\nrepublican is a recasting of Le Bourgeois gentilhomme's Jourdain's eagerness to see his\ndaughter marry foreign royalty, the Turkish Sultan's son (the bourgeois Cleonte in\ndisguise).\nFrench audiences could not look at Pivert and recognize the \"average\" Frenchman\nbecause his bourgeois social status made him \"someone else\" entirely.31 Maza famously\nargued that the bourgeoisie worked as a negative \"other\" similar to the Jew, the\nAmerican, and, one should add, the Arab in the eighteenth and nineteenth centuries.\nFrench rejection of bourgeois, Jewish, American, or Arab values, all constructs of the\nsocial imaginary, contributed to the definition of coherent national identity. As an\nimaginary, the crass, capitalist, and piously Catholic Pivert celebrates his pseudo-\naristocratic bourgeois status and whiteness. He opposes republican equality, fraternity,\nand color-blind assimilation:\nVictor Pivert: Raciste! Moi, raciste! Salomon...Raciste! Enfin, Dieu merci, Antoinette\nepouse un Francais bien blanc. Bien blanc... Il est meme un petit peu palot, vous trouvez\npas ? Avec ses petits boutons...\nSalomon: ...et son cheveu sur la langue.\nVictor Pivert: Il a un cheveu, mais il est riche, riche comme moi, et catholique comme\ntout le monde !\nPivert values wealth and its intergenerational preservation whilst holding the masses--the\ncinematic audience--in contempt. Pivert dismisses Slimane's optimistic faith in speaking\ntruth to his people by informing the revolutionary that one can indeed lie to them: \"Moi, a\nmon usine, je lui mens toute la journee, au peuple! Mais il aime qu'on lui mente, le\n\npeuple! Le peuple!\" In the context of post-'68 trade unionism, burgeoning fears of\nrestructuring and downsizing, and the Lip factory occupation, Pivert was a villain guilty\nnot of owning the means of production, but of treating employees with contempt.\nAfter all, a labor dispute and its resolution facilitate the plot's advancement.\nPivert is aghast when the chauffer Salomon \"outs\" himself as a Jew along with his family\nand that his uncle Jacob is a rabbi. Pivert recovers, \"Ecoutez, ca fait rien,\" and keeps\nSalomon nonetheless, \"je vous garde quand meme.\" The labor unrest only arises when\nSalomon, wearing only boxers and his chauffer's cap, is dragging Pivert's inverted DS\nthrough water in a rainstorm. Salomon threatens to go \"en greve\" only to have Pivert beat\nhim with an umbrella. At shore, Pivert asks Salomon to turn on the headlights. Salmon\nrefuses and informs his employer that he cannot work during the Shabbat, places a\nyarmulke on his head, and begins chanting the Lecha Dodi before an uncomfortable\nPivert. Pivert tells Salomon to make an exception and continue working. Salmon's refusal\nleads Pivert to call his Sabbath \"bete\" and walk the chauffer through a mimed preverbal\ndoor to unemployment. Only when disguised as rabbi Jacob and fearing capture does\nPivert renegotiate with his former chauffer:\nSalomon: Moi, je n'ai qu'une question a vous poser: Mon patron m'a flanque a la porte parce que\nje refusais de travailler le samedi. Qu'est-ce que vous feriez a ma place ?\nPivert: Demande-lui de te reengager, il te dira oui ! Demand-lui de te augmenter, il te dira oui!\nSalomon: De me doubler ?\nPivert: Il te dira oui !\nSalomon: De me tripler?\nPivert: Il...Il te dira non!\nPivert is not a virulent French anti-Semite. He calls Salomon's observance of the Shabbat\n\"stupid,\" but he does not see Salomon as part of a \"menace\". The Protocols of the Elders\nof Zion is no reference point for the fictional Pivert. Pivert may know nothing of Judaism,\nbut he never spews hatred of the Jew as an abstract idea, transcendent evil, or shadow\nforce. The only shadow force operating in France is a group of Arab assassins. Pivert\nbetrays bourgeois values without deranged extremism. Moreover, Pivert holds no\npolitical opinions on Israel or Zionism.\nOf course, the audience knows little about Pivert. What did this bourgeois do\nduring the war? Might one assume Pivert was a Petainist? What was his role in the\nnational trauma? Did he collaborate? Was Pivert's wartime conscious clear? When did he\nchoose to make a stand? Was not Pivert the guilty bourgeois happy to cloak himself in\nthe Gaullist myth and stand side-by-side with resistance fighters after the war? Or, was\nPivert more in line with the interviewees of Marcel Ophuls' Le Chagrin et la pitie\n(1969)? Was Pivert not unlike Monsieur Verdier, the bourgeois who carefully played the\nwaiting game? The actor de Funes spent the Parisian Occupation breaking into comedic\ntheater during the day and earning a living playing jazz piano at night.32 Pivert, like de\nFunes, would have been in his late-twenties during the Occupation. The French had\nquestioned the official Gaullist history that the persecution of French Jews was the Nazi\noccupier's fault. Could audience members imagine Pivert supporting deportation policies\nbetween de Funes gesticulations? Was to laugh at Pivert a collective condemnation of\nlingering anti-Semitism and postcolonial racism impacting France's real Jewish, North\nAfrican, and black communities?\n\nDespite his flaws, the bourgeois--a stand-in for negative French compulsions--\nforced into Jewish drag emerges in the end a good person with proud rather than\nexcessive claims of national superiority (Pivert's glee as the French Republic's helicopter\nlands to return the newly elected Slimane to his country). The Catholic bourgeois fittingly\nrecuperates his self-identity in the courtyard of the Hotel des Invalides where on the 5\nJanuary 1895 the accused traitor Alfred Dreyfus suffered his military degradation. In the\ncourtyard, Pivert, still dressed as a rabbi, meets the real Rabbi Jacob:\nVictor Pivert: Ecoutez-moi, Rabbi Jacob, ecoutez-moi! Il faut que je me confesse. Voila...je ne\nsuis pas juif.\nSalomon: Ca ne fait rien, Monsieur, on vous garde quand meme!\nPivert invokes Catholic penance as he confesses the sin of not being Jewish. Salomon\nlightheartedly forgives him. Pivert's \"je ne suis pas juif\" is different than the\ncontroversial slogan adopted by May '68 students: \"nous sommes tous des juifs\nallemands.\" Students rallied around the slogan after French authorities attempted to block\nstudent protest leader Daniel Cohn-Bendit, a German-Jew, reentry to France from\nGermany. The statement conflated Gaullist treatment of Cohn-Bendit with the Vichy\ngovernment's treatment and deportation of Jews thereby revealing how students suffered\nunder a Fascist regime. Sarah Hammerschalg contrasted French students' adoption of\nJewish identity--claiming Jewish particularity and exception as \"the Jew\"--with\nDreyfusards solidarity with Dreyfus as a human and citizen whose \"Jewishness\" led to\nsuspicion of his guilt as a foreigner.33 In 1968, students linked the \"Jew\" positively to a\npolitical marginality that they embraced for themselves.\nPivert does not claim Jewish identity for himself despite an impulse to self-\nidentify as Jewish. He is neither an outsider nor the Other and cannot abandon his\nCatholicism. Pivert does not claim Jewish identity as a symbolic status for himself. He is\nnot a German-Jew. For Pivert to claim \"Jewishness\" would go against the two dominant\nmodes of constructing \"Frenchness\": universalist-assimilationist Republicanism and\nexclusionary hyper-nationalism. Salomon's reply does not open the category of\nJewishness to all. Instead, Salomon, as a fictional \"real Jew\" rather than the \"Jew-cum\nallegory,\" extends the bourgeois Pivert solidarity by replicating Pivert's initial response\nto discovering Salmon was Jewish. The righteous insider is embraced by the outside in a\nsymbolic reversal of power. Edouard Drumont denied the Jew legitimacy as part of the\nFrance reelle; Salomon extends the boundaries of legitimate inclusion from the margins.\nSalomon's words are reminiscent of Robert Misrahi's La Condition reflexive de l'homme\njuif (1963) who wrote \"the Jew should always and wherever champion the universal\nagainst the particular and the shared identity of mankind against differentiations among\nmen.\"34 Salomon is the anti-thesis to the right-wing bourgeois Gentiles--\"La France aux\nFrancais\"--gathered in the courtyard for a racial-financial bourgeois union, but, Salomon\nis also not an Orthodox Hassid. The character of Salomon is an imaginary Jew in the\nSatrian sense of the juif engage who serves as the film's ethical authority and\nsubversively extends to Pivert a reversed universalism.35\nThe Imaginary Jew\nAs the preceding discussion showed, Oury, no different than French and French-\nJewish intellectuals, was trying to \"work through\" the history of anti-Semitism, Jews,\n\nJudaism, and the Shoah in Rabbi Jacob. Oury found himself unconsciously or\nconsciously oscillating between the effort to portray assimilated French Jews and reifying\nthe Jew's Jewishness when claiming Frenchness. In the film's Sartrian moment, it is\nPivert the anti-Semite who forces Salomon to confront his Jewishness and, out of an act\nof authenticity, to return to Jewish identity and revolt against work. Salomon performs a\ndialectical nationality to defend himself from the anti-Semite. And yet the film centered\nnot on the Sartrian Salomon, but his uncle's Hassidism. On the Rue des Rosiers, Salomon\nis like Virgil from Dante's Inferno. He is the modern French Jew who can combat anti-\nSemitism, be a good citizen, and interpret tradition. Rabbi Jacob, and Pivert's experience\nin rabbi-drag, dialogued instead the lost Jewish culture and community of pre-World War\nTwo Europe. Rabbi Jacob therefore was an attempt to recover an authentic Jewish\ninheritance lost in the Shoah.\nDid Oury's philo-Semitism lead him to essentialzied representations of Jews,\nJewishness, and Judaism little better than anti-Semitic essentialism? The portrayal of\nJews and Judaism inside Rabbi Jacob and the film itself, however, are best interpreted\nwith knowledge of Oury's and his daughter Thompson's biographies. In 1919, Oury was\nborn Max-Gerard Oury, the son of Belarussian-Jewish violinist Serge Lazare Tenenbaum\nand the French-Jewish Marcelle Oury, fashion editor at Paris-Midi and Paris-Soir. His\nfirst childhood memories were of costume parties full of perfumed, absinthe drinking\nwomen at the home of fashion designer Paul Poiret where he brushed shoulders with a\ncosmopolitan crowd composed of Africans, Asians, and Eastern Europeans. Oury's\nmaternal great-grand father Leon Leopold Oury (1825-1900) was an Alsatian who served\nas Toulouse's rabbi and was awarded the Legion d'honneur on the field during the\nFranco-Prussian War. Tenenbaum was absent from Oury's life and his widowed maternal\ngrandmother \"Mouta\" Berthe nee Goldner (1871-1949) and mother raised him in an\nunobservant household.\nAfter his baccalaureate, Oury successfully entered the Comedie-Francaise at the\ninvitation of Edouard Bourdet. He was genuinely shocked to find himself banned from\ntheatrical radio broadcasts and from the stage in Paris and later in Marseille as a Jew after\nthe Armistice with Germany.36 Oury recalled being relatively apolitical and oblivious to\nanti-Semitism during the Interwar period. Marcella first accepted the 1941 Vichy\nmandate that Jews declare their Jewishness to the police writing in a letter that she was\n\"mere juive d'un fils qui ne l'est pas.\" 37 However, she regretted the decision and,\naccording to Oury, waited for the postman to unlock the mailbox so she could rip the\nletter to pieces. The well-connected family had declined filmmaker Jean Renoir's request\nto travel to the United States. 38 Instead, Oury escaped to Geneva with his mother,\ngrandmother, wife (the actress Jacqueline Roman), and daughter (the director Daniele\nThompson) for the duration of the war. Oury denied his daughter's paternity to avoid her\npotential classification as a Jew. Daniele Thompson's given name was a refutation of\nJewish identity.\nIn 1945, Oury returned to a liberated Paris where he rejoined the Comedie-\nFrancaise. Oury's pathway to cinematic comedy was not immediate. He moved from\ntheater and radio to screenwriting and directing in the 1950s (he had appeared in his first\nfeature during the Occupation) and began a career as a screenwriter and director in the\n1950s. 39 It was the comedian de Funes who convinced the director to abandon his\nmediocre gangster films and histoires macabres for comedy in the early 1960s.40 Relying\n\non de Funes physical humor and his own screwball plots, Oury propelled himself to the\napex of domestic cinematic success with Le Corniaud (1965), La Grande Vadrouille\n(1966), Le Cerveau (1969), and La Folie des grandeurs (1971). In La Grande vadrouille\n(1966), a record-breaking comedy starring Bourvil and de Funes, Oury turned his\nattention to the Resistance and Occupied France. Historian Henry Rousso qualified the\nfilm as \"one of the few films to have made children of parents who survived the short\nrations of the 1940s regret that they had not been born before the end of the war.\"41 La\nGrande vadrouille exemplified a vision of a comedic cinema that denounced evil through\nlaughter thereby making the past bearable and the present optimistic. Rabbi Jacob,\nbetrayed a similar desire to promote philosemitism through laughter as well as an\nethnographic ambition to document Jewishness as a cult of memory.\nRabbi Jacob therefore must be considered Oury's first cinematic attempt (in the\ncomedic genre no less!) to work through the trauma of French Jews being stripped of\ncitizenship, deported, and murdered. What Rabbi Jacob does not explore is the reality of\nSephardic and secular French Jews or Israeli and Hebraic culture in 1973. It was an\nabsence in the knowledge of practiced Judaism that led Oury to hire the liberal Rabbi\nEisenberg, son of Polish immigrants who immigrated to Strasburg, as a consultant to\nassure an accurate portrayal of the religion in Rabbi Jacob.42 The film represented an\nattempt by Oury and Thompson to reconnect with a Jewishness denied by Oury's\nmother's secularism. Rabbi Jacob was a recreation of an authentic Yiddish and Eastern\nEuropean culture Oury never knew. The emergence of a more pluralistic France after\nMay 1968 gave Oury the opening to re-imagine the particularity of Jews. Oury, a French\nJew who survived World War Two, confronted a quandary later examined by Alain\nFinkielkraut (1949-) in Le Juif imaginaire (1980): what was an authentic Jew? Oury's\nRabbi Jacob was Finkielkraut's \"juif imaginaire\": a series of nostalgic Hasidic, Ostjuden,\nand Ashkenazi images rather than the Sephardic cultures of those who had experienced\nthe mellah and now resided in France.43 Oury was a generation older than Finkielkraut,\nbut they shared being raised by families who provided no Jewish education. The Judaism\nof Rabbi Jacob hence was earnest pastiche rather than parody. Oury revealed the\nuniqueness of Jewish religious tradition without detailed reflection on their real plurality\ninside France.\nThe character Rabbi Jacob therefore functions as the return of memory. The rabbi\nleaves the thriving Hasidic culture of New York City to return to Paris, a city that\ndeported its Jewish community. The actor who played the real Rabbi Jacob was a direct\nallusion to deportation. Marcel Dalio, born Israel Mosche Blauschild, was a French\ncelebrity throughout the 1930s who is known for his sympathetic portrayals of\nassimilated Jewish aristocrats in Jean Renoir's La Grande Illusion (1937) and La Regle\ndu Jeu (1939). 44 Dalio, who fled to Hollywood after France's defeat, appeared in\nOccupation period French propaganda posters as \"le juif typique\". The poster's failed to\nexplain how Dalio's features--he played Emil, a French card dealer, in Casablanca\n(1942)--were typically Jewish in the sense of a biological race promoted by Nazi\nthought. Oury subversively casted Vichy's \"le juif typique\" as his \"le juif imaginaire\"\nwho symbolically returned from exile in the United States as a Hasidic rabbi rather than\nas the assimilated Jews he played in the 1930s. The Frenchman who once menaced the\npure French race with his Jewish-looks was now costumed as the Hasidic Jew. Yet\nDalio's costume of Jewishness was just a costume that de Funes wore just as easily.\n\nWas the irony of Dalio's role lost on audiences? Was Oury's clever casting of\nDalio an inside joke? Film critics who may have reflected on Dalio's biography and his\nperformance as the \"real\" Rabbi Jacob remained silent. Dalio's was only mentioned as a\ncameo performance. In the same way, French media avoided discussion of Rabbi Jacob's\npublicity campaign that centered on the image of de Funes dressed as the Hasidic rabbi.\nAnti-Semitic racial ideologies of twentieth century echoed in the provocative de Funes'\n\"Jew-face\" advertisement. Those who first saw the advertisements and film posters,\nhowever, would know that the celebrated comedian de Funes was not Jewish. The\nadvertisement plastered across Parisian walls was itself a powerful allusion of Vichy and\nthe Occupation. Indeed, the image reverberated in a 1970s culture sphere inundated with\nwhat Henry Rousso called \"forties revival\" that elevated the \"dark years\" to the level of\nobsession.\nOne of Rabbi Jacob's most iconic moments is the elaborate klezmer dance set to a\nfreylekhs score composed by the Franco-Romanian Vladimir Cosma (1940-). Hasidism\nhad a tradition of bringing round dances and music into spiritual worship. Hasidic men\ndanced to celebrate joy, to remind of community, and for spiritual release or repentance.45\nRabbi Jacob's dance is joyous as it evokes a millennialist ghost dance linked to\nrevitalization and resistance. Out of nowhere young, mute Hasidic men encircle the\ndisguised Pivert's to dance as Rabbi Jacob once did before the war. Pivert, intoxicated by\nthe spirit, masters the complicated choreography. The dance, nonetheless, fits the classic\ndefinition of a ghost dance: a devastated minority whose social and cultural structures\nhave been shattered makes a mystical plea for dignity and restoration. Rabbi Jacob's\nghost dance actualizes Oury's vision of Judaism as a cultural heritage embedded in a\npast. Oury's Jew may still be an outsider inside in France, but an outsider who has\nclaimed the positive values of religious tradition rather than suffered from the negative\nstigma of race. In his second autobiography, Ma grande vadrouille (2001), Oury wrote\nthat no protesters ever gathered outside Rabbi Jacob screenings. This was perhaps false.\nThe leftist Politique hebdo reported a serious altercation between anti-Rabbi Jacob\n\"Orthodox Israelites\" and pro-Rabbi Jacob cinemagoers in front of the Latin Quarter's\nCluny-Palace theater. 46 According to Politique hebdo, the riot required a police\nintervention. This isolated incident reveals that for some Orthodox Jews Rabbi Jacob's\ncarnivalesque portrayal of their beliefs was offensive. That no North African groups\nprotested Rabbi Jacob's portrayal of Arabs or Arab-Jewish relations perhaps only\ntestified to the marginalized position of the community within French society at the time.\nThe Arab Question\nThe filming went incident free between March and July 1973 in Manhattan,\nNormandy, Saint-Denis, and Paris. The only setback arrived when Parisian authorities\nrefused to issue a permit to film on the Rue des Rosiers due to traffic circulation\nconcerns. Oury therefore decided to recreate an entire Jewish neighborhood, including\nthe synagogue, later demolished, with the help of a working-class North African\ncommunity in a suburban Saint-Denis neighborhood slated for demolition.47 A couscous\nrestaurant named \"El Djezair\" (Algiers) became the delicatessen \"A l'Etoile de Kiev,\" a\nhalal butcher became kosher, shop owners repainted their storefronts with the names\nBlum, Rosenberg, and Rosenfeld while some two-hundred residents made a brief vocal\n\ncameo by yelling out \"Shalom Rabbi Jacob!\" The film thus concealed a Maghrebian\ncommunity in its attempts to construct a simulacrum of a historically Jewish Parisian\nneighborhood.\nOn the morning of 6 October 1973, Parisian commuters discovered posters of a\nside locked and bearded de Funes plastered on metro walls. They would find a Rabbi\nJacob advertisement again in their evening newspapers after reading that Egypt and Syria\nhad invaded Israel starting the 1973 Arab-Israeli War. Gerard Beytout and Georges\nCravenne, Rabbi Jacob's distributor and publicist, Javal, the producer, Oury, and other\nfinancial backers met on 7 October to decide whether or not to cancel the film's release.48\nThe first private screening for financial backers proved a complete flop: not a single\nlaugh, palpable tension, and voiced concerns that scenes mocking Jews and Arabs would\ninfuriate the two communities.49 Beytout feared the war would make the provocative\nRabbi Jacob posters polemical and bring a spectrum of political positions from Anti-\nSemite to Zionist and Anti-Arab to Pro-Palestinian to bomb cinemas. The 18 October the\n(the start of the Israeli counter-offensive) release date held and no violence erupted at\nopening night screenings.\nRabbi Jacob's Arabs--a revolutionary and assassins--appeared in the context of\nPan-Arabism, repressive post-independence regimes, and Palestinian nationalism. The\nlatter manifested itself in the dramatic events of the 1970 Jordan air-hijackings and the\n1972 Munich Summer Olympics Massacre. In Rabbi Jacob, the figure of the Arab is\nlinked to violence. Rabbi Jacob's Arabs have neither heritage nor tradition. Slimane is\nsecular and cosmopolitan. He understands Pivert's Catholic gestures and communicates\nJewish traditions to Pivert without professing a faith in Islam. Moreover, Slimane was the\nfilm's only character modeled after a real personage: Mehdi Ben Barka (1920-1965). Ben\nBarka was a charismatic Moroccan leftist opposition leader who disappeared from the\nbrasserie Lipp on the Boulevard Saint-Germain at midday on 29 October 1965. The\ncharismatic Slimane is captured by his assassins behind the Parisian cafe Les Deux\nMagots also on the Boulevard Saint-Germain. One of the assassins humorously\nreferences Ben Barka's kidnapping when he expresses a worry: \"Mon Colonel, on ne\npeut pas l'enlever comme ca en plein Saint-Germain-des-Pres. Ca a deja ete fait.\" Le\ncolonel Fares bore a resemblance to General Mohamed Oufkir (1920-1972) later\nconvicted of torturing and murdering Ben Barka in a French court. Ben Barka's\ndisappearance scandalized de Gaulle and led to questions of France's complicity in the\nabduction. In the aggressive, \"Che\"-Guevara-quoting Slimane, Oury re-imagined Ben\nBarka's story culminating in a Third World leader's victory.\nOury wrote and filmed Rabbi Jacob before the war and the ensuing energy crisis\nthat represented a critical juncture in France's \"Arab\" policy. Since the 1962 Evian Peace\nAccords ending the Algerian War, Gaullist France, sensitive to US-Soviet hegemonic\nambitions and French oil companies' need to diversify, sought to reassert its place in the\nsouthern and eastern Mediterranean. Foreign policy realignment culminated in the 1967\nFranco-Israeli divorce and a later pro-Arab armament sales policy. De Gaulle presented\nFrance as more Arab-friendly when it castigated Israeli territorial ambitions by calling\nJews \"an elite people, sure of themselves and domineering\" on 27 November 1967.50\nSlimane never mentions Israel or Palestine, but the scene, intended to be heartwarming,\nin which Salomon and Arab revolutionary embrace as \"distant cousins\" appeals to Arab\n\nIsraeli peace. By \"being\" a Jew, Oury's Arab re-gains consciousness of his proper\nSemitism thereby setting a condition for an end to violence.\nParadoxically, a comedic film that advocated for peace brought death in the name\nof the Palestinian cause. The morning after Rabbi Jacob's release, Danielle Cravenne,\nthirty-five, wife of the film's publicist, and mother of two, boarded an Air France Boeing\n727 at Orly airport destined for Nice. Somewhere over Clermont-Ferrand, Cravenne,\nwearing a mink coat and carrying a large crocodile-skin purse containing a small dog,\nbrandished a twenty-two caliber rifle, a pistol, and a list of demands.51 Cravenne had\nbecome first Frenchwoman to hijack an airplane. She demanded:\nThat the film Rabbi Jacob should not appear on any theater screens. During twenty-four hours all\nFrench automobiles must remain stationary. All circulation other than by bicycle is forbidden.\nThat all French armament factories and all armament factories in the world halt their production.\nThat the French government assists in the reconciliation of Arabs and Israelis and the re\nestablishment of peace.52\nCravenne threatened to crash the plane into the Pierrelatte nuclear power plant, the Lyon\nairport, or the Shell-Berre oil refineries if her demands were not met. She eventually\nallowed a refueling landing at Marignane airport near Marseille where all passengers and\ncrew disembarked with the exception of the captain and chief steward. In the late\nafternoon, three police officers, disguised as a sandwich-bearer and two mechanics,\nentered the plane and shot Cravenne to death.53\nCravenne demanded Rabbi Jacob's prohibition because she was pro-Palestinian,\nbut the press made little of her demands and presented her foremost as a mentally ill\nhomemaker. Of course, Cravenne had every reason to believe the hijacking would end\nwith a highly publicized trial and not her death. She informed the pilot that Jean Kay's\n1971 hijacking of a Pakistani Airline flight in support of Bengalis independence inspired\nher to make a \"spectacular act\" calling attention to her cause (Kay's trial had concluded\nthe first week of October 1973 with his acquittal).54 Cravenne's hijacking was no less\nfoolhardy than Kay's hijacking, but while Andre Malraux praised Kay for his political\nconviction, the French press rendered Cravenne's politics irrelevant. France-Soir\nconsidered Cravenne \"more of a lunatic than a political extremist.\" She was \"a woman\ntoo delicate\" who was clearly in a \"depressive state\" and \"entirely without reason.\"55 Her\nstory was the tragic history of a manic depressive rather than an ideologue opposed to\nRabbi Jacob.56\nOury dismissed Cravenne as a desperately depressed woman although her\nhusband admitted she was passionate about the unfolding of events in the Middle-East.57\nLiberation alone identified Cravenne as an \"impassioned idealist\" and considered it\nintolerable that she was shot like a \"rabid dog\" for protesting Rabbi Jacob as anti-\nPalestinian propaganda.58 News of the hijacking disappeared overnight and critics never\nonce referenced the event in Rabbi Jacob reviews. Rabbi Jacob's producers certainly\nwanted to distance the film from the hijacking over fears it would be seen as a publicity\nstunt gone wrong.59 Oury long maintained that Cravenne had never seen the film and held\n\"an entirely false idea\" of its politics. 60 He later speculated that Cravenne, who he\nthought was in the process of converting to Judaism, targeted Rabbi Jacob as anti-Semitic\nout of ignorance. If Cravenne had just seen the film, she would never have requested its\nprohibition. Some years after, Oury changed his explanation for Cravenne's motivations:\n\nCravenne was a militant pro-Palestinian and found Rabbi Jacob had anti-Arab\norientations. George Cravenne's Le Monde obituary, however, reported that his former\nwife found Rabbi Jacob anti-Semitic.61 The casting of Cravenne as a lunatic lacking\nreason rendered her attempt to politicize Rabbi Jacob unreasonable to those who\nconsidered Rabbi Jacob's message universal.\nTwo film critics substantiated Cravenne's claim that Rabbi Jacob was anti-Arab.\nShortly after film's release, L'Humanite's Francois Maurin denounced Rabbi Jacob as\nunfunny and xenophobic in its portrayal of Arabs.62 The pro-Palestinian Maoist Pascal\nBonitzer, however, articulated a more substantial critique of Oury's portrayal of Arabs\nthat he feared only reconfirmed racist French ideas. Bonitzer, who mentioned his Jewish\nheritage in the article, accepted that Oury's film was fundamentally well-meaning, but his\nmessage was ineffectual because it ignored a reality: \"the real object of racist hatred in\nFrance: the Arab worker (Algerian, Moroccan, Tunisian..).\"63 Bonitzer linked racism to\nclass exploitation, \"c'est l'argent qui fait le racisme,\" and it was the Arab factory worker\nwho suffered most. Bonitzer thus argued that Oury's mass promotion of an abstract\nreconciliation narrative failed to address the source of anti-Semitism and racism:\ncapitalism. Bonitzer, however, was genuinely angered by the film's representation of\nArabs as the mythical Arabs of French fantasy--assassins, presidents, revolutionaries,\nseducers, and spies. Oury's anti-racist film paradoxically portrayed Arabs as racist\nstereotypes. Bonitzer contrasted these Arabs with Oury's far more complex portrayal of\nJews and Jewish religious traditions. Bonitzer was correct. Oury's film contains not a\nsingle \"real\" North African who suffered violence at the hands of the French racist. What\nFrench audiences needed was a \"truly antiracist film\" that departed from the concept of\nshared ideological struggle. Who would buy tickets to such a serious film?\nTo French audiences, there was certainly nothing unsettling about the French-\nspeaking, rational, secular, cosmopolitan, and democratically elected Slimane played by a\ntanned Frenchman. One may read Oury's decision to have the tanned Giraud play\nSlimane as provocative;; Giraud's Slimane perhaps said \"yes, you too look Arab after too\nmuch sun on the beach!\" But the characters Slimane and Le colonel had no features\nbeyond their darker skin color, curly hair, and aggressive demeanor that defined both as\nArab. This made it all the easier for audiences to accept that an attractive, well-spoken\nArab who frequented stylish Parisian cafes (as opposed to an actual immigrant living in\nSaint Denis) would marry a bourgeois woman. Surprisingly, Liberation followed\nBonitzer's review with a series of interviews between Oury and journalists Pierre\nAudibert and Helene de Gainsberg praising the \"Rabbi Jacob phenomenon.\"64 Oury\ndirectly addressed many of Bonitzer's criticisms in the interviews. He admitted that he\ncould have made a film called Les aventures de Mohamed Larbi Slimane wherein the\nfactory owner Pivert substituted himself for an Algerian factory worker in the master-\nvalet style of Moliere. The problem Oury sensed was that Les aventures de Mohamed\nLarbi Slimane could not be a comedy although he never elaborated as to why.65 Perhaps\nOury found nothing funny about being an immigrant worker in France? Perhaps he knew\nnothing about Arab/Muslim culture? Rabbi Jacob, Oury admitted, was nothing but his\nbest attempt to tackle a serious subject through a genre he believed best suited for the\nbroadest of possible audiences.\nThe interviews outraged critics at Les Cahiers du Cinema who condemned the\n\"longwinded\" conversations for giving readers with a favorable opinion of Rabbi Jacob.\n\nIn an unsigned 15 November 1973 letter published in Liberation, Cahiers du Cinema\naccused the newspaper of failing to engage in an ideological struggle against Rabbi\nJacob, a bourgeois product of mass consummation and accused Audibert and Gainsberg\nof being undercover \"UDR [Union pour la defense de la Republique, the Gaullist party]\njournalists.\"66 These critics found nothing funny about Rabbi Jacob rather they identified\nthe comedy as part of a discourse diluting the capitalist origins of racism and the\nexploitation of Arab workers. The letter proclaimed that the French could only\ncollectively overcome racism when every individual recognized he or she feared Arabs\nand Jews. In contrast, Oury sent audiences the wrong message. He told them,\nYou, you average Frenchman who recognizes himself in Louis de Funes; it is true that\nyou are a racist, but that's no big deal. You are only a racist on the surface, but not deep\ndown. There is enough humanity and unused generosity in you, so that when you want,\nyou will renounce racism as nothing but a silly little game.67\nAudiences made Rabbi Jacob a financial triumph because the film flattered viewers and\nallowed them to leave cinemas reassured of their morality.68 For the Maoists at Cahiers,\nwho preferred a cinema that inculcated viewers with an ideological reality, Rabbi Jacob\nonly encouraged complicity with a system of domination.\nConclusion: Nostalgia\nRabbi Jacob made no gesture at a subversive laughter inspiring political action or\npublic outrage. Oury sought a stabilizing laughter that encouraged tolerance and philo-\nSemitism. The political efficacy and social utility of a moralizing comedy may seem\ntrivial in comparison to more cerebral and ethically engaged films that challenged\ncollective memories and questioned disparities. What cannot be denied was that Rabbi\nJacob served as a locus where a population lightheartedly engaged hyperbolic\nrepresentations of their social world and re-imagined the possibilities of identity. Rabbi\nJacob was neither reactionary in its portrayal of human difference nor escapists in its\nsubject matter. The temptation to assess Rabbi Jacob as evasionist and its representations\nessentialist ignores the nuanced moral and political ambitions of the film in the specific\nsociocultural context of its production and release.\nWe cannot measure Rabbi Jacob's impact on French society in 1973. We can be\nsure that the film's message stemmed neither anti-Semitic nor racist violence. One might\nwonder how in a Post-Rabbi Jacob world was it possible for Prime Minister Raymond\nBarre to make a Freudian slip after the 3 October 1980 bombing of the Rue Copernic\nsynagogue on TF1: \"This odious bombing wanted to strike Israelites who were going to\nsynagogue and it hit innocent French people who crossed the Rue Copernic.\" 69\nThroughout the 1980s and 1990s, Rabbi Jacob was available for private screening\nthrough periodic VHS, DVD, and televised re-releases. Since 2001, TF1 Video has\nreissued the DVD on an almost annual basis. In 2009, Rabbi Jacob was the most\nfrequently shown film on French television with thirteen screenings viewed by an\nestimated total audience of 6.8 million. 70 The continued accessibility of Rabbi Jacob\nfacilitated the film's cultural canonization. Humor tends to have a temporal specificity\nthat often renders it unable to travel intact across time. What our parents once found\nfunny, we now find offensive just as we might find a younger generation's comedic tastes\n\nvulgar. Rabbi Jacob has stood the test of time, but does the film's popularity reflect a\ncontinued ability to make audiences laugh? It may not matter.\nDominique de Villepin proclaimed once that Rabbi Jacob was \"part of all our\n[French] memories\" because it was \"part of the patrimony of French families,\" a film\nseen and re-seen always with the same joy.71 Is the joy felt a product of nostalgia for the\nworld Rabbi Jacob imagined in 1973? Joy does not mean audiences still laugh or laugh\nfor the same reasons as original audiences. The film's talismanic endurance in French\nculture perhaps reflects a desire to return to a past that never existed at all. Does the film\nfunction as a congratulatory reminder to the French of their commitment to tolerance? In\nretrospect, the conditions for Rabbi Jacob's interethnic friendship might also be\nappealing in the contemporary. Oury portrayed interethnic friendship as arriving through\nempathy, shared understanding, and moral certitude rather than through reflection on\nindividual or societal culpability for past or present inequalities in the genre of morally\nambiguous tragic drama. Two recent examples of this style are Mathieu Kassovtiz's\nacclaimed La Haine (1995) and Austrian director Michael Haneke's Cache (2005).\nAlthough La Haine shows deep camaraderie between a Maghrebin, a Jew, and black, the\nthree youths remain on the margins of French society. In both films, the guilt of France\nand the French cannot be transcended in the present.\nwhen France 2 television flew the director to Israel for the film's twentieth\nanniversary in 1993, Oury acknowledged in an interview that Rabbi Jacob's optimism\nbelonged to a different era.72 At a checkpoint, Oury encountered an Israeli Defense\nForce's soldier who reenacted the scene when de Funes' attempted to call gendarmes\nattention to his kidnapping by Slimane. In Israel, Oury lamented that the hope for Arab-\nIsraeli reconciliation found in the Salomone-Slimane metaphor was difficult to imagine\ntwenty years later. The Jewish-American journalist Tom Teicholz, who fell out of his seat\nlaughing at Rabbi Jacob's American release, reviewed the film in 2006. He neither\nlaughed nor felt like he was watching a comedy so much as \"a long ago dream of a time\nwhen anti-Semites were funny vaudeville characters, Jews just wanted to be understood\nfor the warm and fuzzy people they were and Arab leaders were just a handshake away\nfrom living in peace with their Jewish neighbors.\" Oury had hoped to follow Rabbi\nJacob's success with a political comedy mocking South American and Southern\nEuropean dictators that reunited Oury, Thompson, and Eisenberg as screenwriters and\nmany Rabbi Jacob cast members. De Funes' declining health prevented filming. The\nsecond-half of Oury's cinematic corpus, however, returned to mythical Jewish\nexperiences from the rescue of a Jewish boy from the Gestapo in L'As des As (1982), the\nfirst Shoah comedy, to Levy et Goliath (1987), a Parisian set comedy about Orthodox\nJews.73 L'As des As returned to themes apparent in Rabbi Jacob: the possibility of\nfriendship and reconciliation between supposed enemies, in this case a German and a\nFrenchman united to save a Jewish child, while, in the words of Jean-Paul Belmondo,\nwho co-produced the film, \"stigmatizing, via the lighthearted tone of comedy, anti-\nSemitism and intolerance.\"74 Rabbi Eisenberg, identified by the press as the \"technical\nconsultant\" for Rabbi Jacob, officiated over Oury's 2006 graveside where he asked\nattendees to \"according to the Jewish tradition thank God for having given life to the one\nthat departs us,\" the only religious aspect of Oury's otherwise secular burial at\nMontparnasse cemetery.75\n\nIn 2008 interview, Thompson confessed she doubted Rabbi Jacob could be made\nin the present because of political correctness.76 It is humorous, hypothetical question to\nask if the entire cast and crew would be prosecuted for incitement to racial hatred if they\nmade the same film today. And yet cultural references to Rabbi Jacob abound. Whatever\ndisruptive potential Rabbi Jacob had in 1973 had become emptied by the 21st century as\nit has recirculated through endless repetition as an object of cultural hegemony. The film\nno longer compels contemporary audiences to think or reconsider; instead, it confirms\nshared knowledge of French popular culture. At the 2007 Cesars, a side-locked Valerie\nLemercier recreated the shtetl dancing scene from the film provoking discerning glances\nfrom American guests.77 The scene was a tribute to Oury, but what multicultural message\nwas conveyed by dressing as a Hasidic rabbi in 2007? Rabbi Jacob also had a failed\nmusical theater spinoff with an ambiguous song by French rapper MC Solaar entitled \"Le\nRabbi Muffin\".78 MC Solaar's video for the song had Black and Arab Yeshiva students\ndoing a Hasidic inspired dance to hip-hop lyrics about bar-mitzvahs. The song contained\nsuch nonsensical phrases as \"Bouge ton corps ou ton bady c'est Beth din, de New York\njusqu'a Paris dans le style Ragga Muffin.\" The video implies that Rabbi Jacob, as a\ncultural touchstone, somehow unites multicultural France. In more recent years, the\nHasidic dancing scene has become a favorite of white French flash mobs. There is\nnothing more French than pretending to be a Hasidic Jew? Rabbi Jacob has indirectly\nprovided multiple French generations with a misleading understanding of Judaism\nreduced to Orthodox traditions and Yiddish culture. As a Jewish activist from Lille\nlamented, almost all adult French base their entire knowledge of Judaism on Rabbi\nJacob.79Oury's film continues to provide French families with a virtual ethnographic\nexperience into Judaism.\nRabbi Jacob defined the borders of inclusivity as it denounced the prejudices of\nwhite, Catholic Europeans towards minorities in 1973. Henri Bergson wrote that laughter\nwas a repressive function that sought to illegitimate separatist tendencies in a society.80\nLaughter was \"made to humiliate, to give to the person who is its object a painful\nimpression. Society avenges itself through laughter for the liberties one has taken with\nit.\"81 If Rabbi Jacob encouraged a mode of symbolic violence in its original context, it\nstruck justly and maybe even inspired thoughts of goodwill. Rabbi Jacob chastised those\nwho might embrace a territorialized humor of insult that constructs exclusive Volkish\nidentities and negative minority subjectivity.82 It presented an alternative reality where\ndifferences were negotiated and the superiority of reactionary Frenchness questioned.\nThe film, however, only addressed a small portion of the real hatred expressed by white\nand/or Christian Europeans towards their nation's postcolonial denizens. As this essay\nhas argued, Rabbi Jacob was inseparable from the history of Jews in France and the\npostwar acceptance that being Jewish was compatible with integration into France. The\nlatter point does not hold true for France's Muslim/Arab community who Islamophobes\nstill assume cannot be assimilated because of Muslim/Arab inferiority and\naggressiveness. The question that remains is will France ever laugh at Les aventures de\nImam Mohamed? Would such a film acknowledge Arab/Muslim culture as equal in value\ntherefore meriting survival and worth? Does Rabbi Jacob alienate young French citizens\nwith minority identifications? Has Rabbi Jacob taken on a privileged status in a culture\nsystem that demands those grappling with inclusion to appreciate its values?\n\n1Gerard Oury, Ma grande vadrouille (Paris: Plon, 2001), 54.\n2Alan Larson Williams, Republic of Images: a History of French Filmmaking (Harvard University Press,\n1992).\n3Henry Rousso, The Vichy Syndrome History and Memory in France Since 1944, Arthur Goldhammer,\ntrans. (Cambridge, MA: Harvard University Press, 1991), 223-234;\n4Dominick LaCapra, Rethinking Intellectual History: Texts, Contexts, Language (Ithaca: Cornell University\nPress, 1983), 52-53, 300, 304; Darnton, The Great Cat Massacre, 96-99; Also see Mikhail Bakhtin, trans.\nHelene Iswolsky, Rabelais and His World (Bloomington & Indianapolis: Indiana University Press, 1984),\n88.\n5See Remi Fournier-Lanzoni's discussion of Rabbi Jacob in Remi Fournier-Lanzoni, French Comedy on\nScreen: A Cinematic History (New York: Palgrave, 2014), 129-133.\n6Guy Austin, \"Body Comedy and French Cinema: Notes on Les Visiteurs,\" Studies in French Cinema 6,1\n(April 2006), 43-52.\n7The New York Times 4 November 2008.\n8Fournier-Lanzoni, French Comedy on Screen, 131.\n9Kristin Ross, May '68 and Its Afterlives (Chicago: University of Chicago Press, 2002), 6.\n10Benjamin Stora, \"The Algerian War in French Memory: Vengeful Memory's Violence,\" in Ussama Samir\nMakdisi and Paul A Silverstein, Memory and Violence in the Middle East and North Africa (Bloomington:\nIndiana University Press, 2006), 151-176.\n11Michel Wieviorka, La Tentation anti-Semite: haine des juifs dans la France d'aujourd'hui (Paris: Robert\nLaffont, 2005); Pierre Birnbaum, La France aux Francais: histoire des haines nationalistes (Paris: Seuil,\n2006);; Tony S. Juge and Michael P. Perez, \"The Modern Colonial Politics of Citizenship and Whiteness in\nFrance,\" Social Identities 12.2 (March 2006): 187-212.\n12Yven Gastaut, \"La Flambee raciste de 1973 en France,\" Revue europeenne de migrations internationales\n9.2 (1993): 61-75.\n13Liberation 8 November 1973.\n14Oury, Memoires d'Elephant, 266; Oury, Ma grande vadrouille (Paris: Plon, 2001), 157.\n15Johan Huizinga, Homo Ludens: A Study of the Play-Element in Culture trans. R.F.C. Hull (Boston: The\nBeacon Press, 1955), 207, 210.\n16Oury, Memoires d'Elephant, 253.\n17Le Point 22 October 1973, 107.\n18Vanessa R. Schwartz, It's So French! Hollywood, Paris, and the Making of Cosmopolitan Film Culture\n(Chicago: The University of Chicago Press, 2007); Richard Kuisel, Seducing the French: The Dilemma of\n\nAmericanization (Berkeley: University of California Press, 1994); Kristin Ross, Fast Cars, Clean Bodies:\nDecolonization and the Reordering of French Culture (Cambridge: MIT Press, 1995).\n19The Jewish Journal 4 August 2006\n20Oury, Ma grande vadrouille, 136; Helene de Gainsberg and Pierre Audibert, \"Les aventures de Gerard\nOury realisateur de 'Rabbi Jacob',\" Liberation 9 November 1973.\n21Le Monde 21-22 October 1973.\n22Combat 18 October 1973.\n23France-Soir 19 October 1973.\n24La Croix 28-29 October 1973.\n25Jean-Pierre Jeancolas, Le cinema des Francais: la Ve Republique, 1958-1978 (Paris: Stock, 1979).\n26Ibid.,\n28Ibid., 109-110.\n29 Tournage du film de Gerard Oury \"Rabbi Jacob\". 12 juin 1973 Midi trente\n30Sarah Maza, The Myth of the French Bourgeoisie: An Essay on the Social Imaginary: 1750-1850\n(Cambridge, MA.: Harvard University Press, 2003).\n31Ibid, 5.\n32 Jean-Jacques Jelot-Blanc, Louis de Funes, une legende (Paris: Carriere, 1993), 33; Bertrand Dicale, Louis\nde Funes, grimace et gloire (Paris: Grasset, 2009), 19-22.\n33Sarah Hammerschlag, The Figural Jew: Politics and Identity in Postwar French Thought (Chicago:\nUniversity of Chicago Press, 2010), 3-7.\n34Robert Misrahi, La condition reflexive de l'homme juif (Paris: R. Julliard, 1963), 249.\n35Jean-Paul Sartre, Reflexions sur la question juive. (Paris: Paul Morihien, 1946).\n36Oury, Memoires d'Elephant, 30-31.\n37 Oury, Memoires, 102. Edler's documentary\n38Dido Renoir and Alexander Sesonske, eds., Jean Renoir: Lettres d'Amerique (Paris: Presse de la\nRenaissance, 1984).\n39 Medecin des neiges, Marcel Ichac (1942).\n40 Oury, Memoires d'Elephant, 205; La Menace, Gerard Oury (1950); La Main chaude, Gerard Oury\n(1960); Le Crime ne paie pas, Gerard Oury (1961).\n41Rousso, The Vichy Syndrome, 232\n42Pierre Billard, \"Rire: la qualite 'Oury-de-Funes,\" Le Point 22 October 1973, 110.\n43Alain Finkielkraut, Le juif imaginaire (Paris: Seuil, 1980).\n44 Remy Pithon, \"Le Juif a l'ecran en France vers la fin des annees trente,\" Vingtieme Siecle 18.18 (1988):\n89-100\n45 Michael Fishbane, The Exegetical Imagination: On Jewish Thought and Theology, pp. 173-184, 226-\n231 (Cambridge, Mass., Harvard University Press 1998);\n46Oury, Ma grande vadrouille, 58; Politique hebdo 15 November 1973.\n47France-Soir 6 October 1973; Oury, Memoires d'Elephant, 260; Oury, Ma grande vadrouille, 41-54, 157.\n\n48Cravenne was the top French publicist of the time and best remembered as the founder of Les Cesar.\nOury, Memoires d'Elephant, 264.\n49Auberi Edler, \"Il etait une fois...Les aventures de Rabbi Jacob,\" Il etait une fois TV5, France, 14 May\n2009.\n51France-Soir 19 October 1973.\n52Liberation 20-21 October 1973.\n53The agents were members of la groupe d'intervention de la police nationale de marseille formed in 1972.\n54Jean Kay, L'Arme au Coeur (Paris: Denoel, 1972).\n55France-Soir 19 October 1973; France-Soir 20 October 1973; France-Soir 20 October 1973.\n56Le Figaro 19 October 1973\n57Le Figaro 22 October 197; Liberation 20-21 October 1973.\n59Oury, Memoires d'Elephant, 264.\n60Ibid., 265.\n61Le Monde 14 January 2009.\n62L'Humanite 24 October 1973.\n63Liberation 1 November 1973.\n64Liberation 8 November 1973; Liberation 9 November 1973; Liberation 10-11 November 1973.\n65Liberation 9 November 1973.\n66Liberation 15 November 1973; The Maoist reaction led to a great deal of self-criticism at Liberation and\ndebates over the newspaper's cinematic commitments. See Francois Marie Samuelson, Il etait une fois\n'Liberation': reportage historique (Paris: Seuil, 1979), 227-228.\n67Liberation 15 November 1973\n68Oury never responded to the article in Liberation. He considered the letter an example of \"intellectual\nterrorism practiced by the mullahs fachos-gauchos.\" Oury, Memoires d'Elephant, 268.\n69 Raymond Barre \"Cet attentat odieux qui a frappe des francais innocents\" Television Francaise 1 IT1\nNUIT 03 oct. 1980\n70Emmanuel Berretta, \"Le top 20 des films a la tele en 20009,\"Le Point Online 12 February 2009\n71Agence France Presse 20 July 2006.\n72Oury, Vadrouille, 50.\n73L'As des As, Gerard Oury (1982); Levy et Goliath, Gerard Oury (1987).\n\n74Jean-Paul Belmondo, \"Lettre ouverte aux 'coupeurs de tete,\" in Oury, Memoires d'Elephant, 329.\n75Agence France Presse 24 July 2006.\n76 Paris Match 30 September 2008.\n77 Valerie Lemercier, \"Un hommage a Gerard Oury,\" Les Cesar Canal Plus, France, 25 February 2007\n78MC Solaar, \"Le Rabbi Muffin,\" Le Rabbi Muffin (Single), France, 2008; Le Figaro 29 October 2008.\n79 Guysen Israel News 17 December 2003; Also see See Shaina Judith Hammerman, \"The Fantastic Hasid:\nFashioning Jewishness on-Screen,\" (PhD Diss., Graduate Theological Union, 2013).\n80 Henri Bergson, Le Rire (Paris: PUF, 1940), 135.\n81 Pierre Bourdieu, Le Sens pratique (Paris: Minuit, 1980), 219; Ibid., 150.\n82 Didier Eribon, trans. Michael Lucey, Insult and the Making of the Gay Self (Durham: Duke University\nPress, 2004).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.052 French Film Classics\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}