{
  "course_name": "French II",
  "course_description": "21G.302/352 is the second part of an introductory course to the French language and culture with an emphasis on the acquisition of vocabulary and grammatical concepts through active communication. The course is conducted entirely in French and students interact in French with their classmates from the very beginning. They also receive exposure to the language via a variety of authentic sources such as the Internet, audio, video and printed materials which help them develop cultural awareness as well as linguistic proficiency. There is a coordinated language lab program.\nThis course is taught in rotation by the following instructors: Laura Ceia-Minjares, Cathy Culot, Gilberte Furstenberg, and Johann Sadock.",
  "topics": [
    "Humanities",
    "Language",
    "French",
    "Humanities",
    "Language",
    "French"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nAdditional lab work is also required.\n\nCourse Objectives\n\nThis is the second part of an introductory course to French which is\nconducted in French\n. The goals for this semester are:\n\nto further develop linguistic proficiency through active communication;\n\nto expand vocabulary acquisition and to complete the basics of French grammar;\n\nto study short texts and to increase practice in writing without the use of a dictionary;\n\nto continue exposure to culturally authentic audio and video materials in the classroom and in the language lab.\n\nCourse Requirements\n\nA. Content\n\nWe will begin the semester with a quick revision of chapters 1 through 7 of your textbook. We will then try to cover chapters 8 through 13. Class time will be devoted to the development of oral communication skills designed to develop fluency, increase vocabulary and reinforce specific grammatical structures. Most activities will be based on materials found in\nParalleles.\nThese will also be supplemented with activities based on French videos and Francophone web sites. Class time will also be used to improve pronunciation.\n\nB. Attendance and Participation\n\nYou are expected to attend all class meetings and to participate actively. Your ability to speak, write and understand French can only be developed and improved through daily individual work and in-class intensive practice. More than 4 unexcused absences will affect significantly your final grade in the course. Regular late arrivals will also affect your final grade. Should you miss class, it is your responsibility to find out what was done in class, what handouts were given, what the next assignment is, etc.\n\nC. Homework\n\nStudents are expected to do the assigned readings, to be prepared before class and to participate actively in all course activities, group work, etc. Coming to class fully prepared will help you have a rewarding and productive experience.\n\nEvery week or two weeks you will receive a detailed syllabus outlining the work for the following week(s). Therefore, your assignments will be announced ahead of time. They will include:\n\nstudying the vocabulary and grammar in the textbook\nParalleles\n;\n\ncompleting each day the assigned written exercises in the\nCahier d'activites\n(these will be collected);\n\nwriting and correcting compositions;\n\npreparing listening exercises from the audio CD (this CD contains recorded materials for the in-text \"En direct\" activities);\n\ncompleting all the \"Comprehension auditive\" exercises and the revision exercises in the\nCahier d'activites.\nYou need to complete all the exercises for each chapter by the day of the exam for that chapter when they will be collected.\n\nlistening to the audio CD on your own time and as often as you need to practice your pronunciation.\n\nAdditional homework might include watching videos and using the web. These assignments will always be announced well ahead of time.\n\nplease check the\nMIT French Web page\nfor regular updates on the program, French resources, as well as useful information about available French grants and fellowships for both undergraduate and graduate students.\n\nThe LLARC (Language Learning and Resource Center)\n\nFor the pronunciation and listening comprehension activities, you will have the option to go to the Language Learning and Resource Center and borrow the corresponding cassettes in order to work on the listen/record cassette decks if you wish to do so.\n\nD. Exams\n\nSix exams, which are all required, will be scheduled throughout the semester. If you miss any exam and want to make it up, you need to make arrangements with me ahead of time. If you miss any exam because of an illness or an accident, you or someone on your behalf needs to call the office the day the exam is administered in order to be allowed to make it up later. Make-ups will not be allowed if this procedure is not strictly respected. Pop quizzes may be given without prior notice on any day. These cannot be made up.\n\nThe first exam will not be included in your final grade, and there is no final exam.\n\nAt least once during the semester, you will be asked to come in small groups (2 or 3 students at a time) to my office during a regular class hour for an informal discussion in French. These discussions will not be graded but they will help me give you a precise assessment of your personal strengths and weaknesses.\n\nGrading\n\nEvaluation\n\nGrades will be based on pop quizzes, class work and participation, attendance, homework, compositions and five exams.\n\nGrading Procedure\n\nACTIVITIES\n\nPERCENTAGES\n\nFive Exams and Quizzes\n\n50%\n\nAttendance and Active Participation\n\n25%\n\nHomework and Compositions\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "A quoi correspondent les dates suivantes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/4ff030623d93a56557b3e83f30250e47_MIT21G_302_F04_doss8_pt2_A.pdf",
      "content": "Fiche: A quoi correspondent les dates suivantes?\n\n1. Regardez le calendrier qui se trouve a la page 318 de votre livre et dites:\n-\na quoi correspondent les dates suivantes et\n-\nquel type de fete c'est (civile/religieuse etc.)\n\nLe 1er janvier:\n\nLe 7 avril:\n\nLe 1er mai:\n\nLe 14 juillet:\n\nLe 15 aout:\n\nLe 11 novembre:\n\n2. Repondez aux questions suivantes:\n\nQuel est le premier jour du printemps?\n\nComment appelle-t-on le dernier jour de l'annee?\n\nQue peut-on dire a propos du mois de mai?\n\nPartagez, avec un/e partenaire, les dates du calendrier qui sont importantes pour vous (des dates\nd'anniversaire, de fetes de famille, de fetes nationales, etc.... Dites comment vous les celebrez. Donnez des\ndetails.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Dans un magasin de vtements",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/15dac607b6f4a6df3258719ea4908067_MIT21G_302_F04_Classe_S.pdf",
      "content": "Activite de classe: Dans un magasin de vetements\n\nEn utilisant les vitrines pp. 425-426, vous allez acheter certains vetements selon le contexte indique ci-\ndessous. Votre partenaire est le vendeur (la vendeuse). Vous voulez voir plusieurs articles, vous les\ncomparez, vous demandez des conseils, vous demandez votre taille, les prix, la qualite etc.\n\n1- Vous partez en vacances en Grece en juin.\n\n2- Vous aller en Irlande au mois de novembre.\n\n3- Vous avez decide de faire du sport le week-end.\n\n4- Vous allez rendre visite a des amis dans les Alpes en fevrier.\n\n5- Vous cherchez un emploi et vous devez aller a un entretien demain.\n\n6- Vous allez a une soiree formelle a l'ambassade de France samedi prochain.\n\n7- Vous allez vous occuper du jardin d'un ami pendant qu'il est absent cette semaine.\n\n8- Vous allez passer le premier jour de l'An a Paris.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Jeu de mots",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/10af324e61e626c7738ed7691982d25c_MIT21G_302_F04_classe_O2.pdf",
      "content": "Activite de classe: Jeu de mots\n\nRemettez les mots des phrases suivantes dans le bon ordre.\n\nque/ preter/ nous/ est/ dictionnaire/ ce/ vous/ votre/ pouvez/ ?\n\nje/ parle/ lui/ pas/ ai/ ne\n\nla/ dis/ verite/ moi\n\napres/ vais/ le/ je/ cours/ rencontrer/ le\n\nne/ peux/ aujourd'hui/ mon/ je/ lui/ pas/ rendre/ devoir\n\nlus/ les/ a/ elle\n\nrends/ prochaine/ visite/ semaine/ leur/ la\n\nvoulu/ ses/ pas/ ne/ a/ nous/ notes/ montrer/ il\n\ntard/ telephone/ le/ pas/ me/ ne/ soir\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: La qualit de notre vie",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/05fb317f5124670c223c8d1b0a3241a1_MIT21G_302_F04_Classe_Z3.pdf",
      "content": "Activite de classe: La qualite de notre vie\n\n1. A l'ecrit (5 -7 lignes)\n\nImaginez une invention et expliquez au futur comment fonctionnera\nvotre invention, ce qu'elle changera (votre invention peut etre dans les\ndomaines social, economique, culturel, technologique, scientifique).\n\n2. Circulez dans la classe pour expliquer et vous faire expliquer vos\ninventions respectives. Posez des questions pour demander des\nprecisions, obtenir des details et des explications, etc.\n\n3. Vote pour la meilleure invention. Remise de prix et discours de\nremerciement (improvise) du gagnant.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Le meilleur emploi du temps en terminale",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/7d6ef406798631646a6278156e7ea096_MIT21G_302_F04_terminale_L.pdf",
      "content": "Activite de classe: Le meilleur emploi du temps en terminale\n\nA. Etablissons ensemble un petit questionnaire pour determiner quel\netait votre emploi du temps en terminale.\n\nExemples de questions :\n\n- Quels jours avais-tu cours? Quels jours n'avais-tu pas cours?\n\n- A quelle heure tu commencais et tu finissais le plus souvent?\n\n- Combien d'heures de cours est-ce que tu avais au total?\n\n- Est-ce qu'il y avait une pause en general pour le dejeuner?\nPendant combien de temps?\n\nB. Circulez dans la classe et posez ces questions aux autres etudiants\npour decouvrir qui avait le meilleur emploi du temps en terminale.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Les pronoms",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/af86646aa5a1dbe25f80bfb4155ea7c7_MIT21G_302_F04_classe_O1.pdf",
      "content": "Activite de classe: Les pronoms\n\nPosez ces questions a vos voisins. Repondez en utilisant un pronom complement d'objet\nindirect et indiquez si vous faites ces activites souvent, jamais, exceptionnellement,\nrarement, pas souvent, quelquefois, parfois, de temps en temps, tout le temps, toujours ...\n\nDemandez\n\ns'il/elle pose souvent des questions a ses professeurs.\n\ns'il/elle demande de l'aide a ses copains pour ces cours de sciences.\n\ns'il/elle ecrit des courriels a ses amis.\n\ns'il/elle repond toujours correctement en classe.\n\ns'il/elle prete sa voiture a ses amis.\n\ns'il/elle veut bien vous donner ses notes de cours.\n\ns'il/elle doit envoyer son CV a des employeurs potentiels.\n\ns'il/elle dit tout a ses copains.\n\ns'il/elle peut vous telephoner ce week-end.\n\ns'il/elle veut vous emprunter votre ordinateur pendant deux jours.\n\ns'il/elle doit ecrire a ses grands-parents.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Prparatifs de vacances",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/fb449fd1b44f1a98d1eaae2929789d8e_MIT21G_302_F04_classe_Z1.pdf",
      "content": "Activite de classe: Preparatifs de vacances\n\nA vous de trouver la question.\n\nModele:\n\n... De Boston\n\nQuestion a trouver:\n\n- D'ou partez-vous ?\n\n... A la Martinique\n\nQuestion a trouver:\n\n...en bateau a voile\n\nQuestion a trouver:\n\n... Des amis\n\nQuestion a trouver:\n\n...Une semaine\n\nQuestion a trouver:\n\n...Manger, bronzer, dormir\n\nQuestion a trouver:\n\n...Des brosses a dents, des maillots, de la creme solaire\n\nQuestion a trouver:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Retour de vacances",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/b54ce72fd963562481901ad2a2a4aa42_MIT21G_302_F04_Classe_Z2.pdf",
      "content": "Activite de classe: Retour de vacances\n\nA l'aeroport, vous observez des touristes qui rentrent de vacances.\nD'apres ce qu'ils ont dans leurs sacs de voyage, essayez de deviner d'ou\nils arrivent (en utilisant la preposition et l'article appropries).\n\nModele: Du parfum...\n\nCes touristes arrivent de France.\n\n1. Une camera video ultramoderne...\n\n2. Une bouteille de rhum...\n\n3. Des chaussures en cuir (peau d'animal)...\n\n4. Un pull en cachemire...\n\n5. Du chocolat...\n\n6. Du cafe...\n\n7. Un couscoussier (pour faire du couscous)...\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Activit de Classe: Un peu de gographie",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/55c45c8cc6b44adc087c5d093bec02c8_MIT21G_302_F04_Classe_X.pdf",
      "content": "Activite de classe: Un peu de geographie\n\nLes prepositions avec les noms geographiques\n\nin, at, to\nfrom\n\nmasculin\nfeminin\nmasculin\nfeminin\n\nContinents\n\nPays\n\nEtats americains\nRegions\n\nVilles\n\nQuelles prepositions faut-il dans les exemples suivants?\n\nJe vais...\nParis tous les ans. Je vais...\n\nItalie tous les ans.\n\nJe vais...\nJapon tous les ans. Je vais...\nProvence tous les ans.\n\nJe vais...\nVermont tous les ans.\n\nMa meilleure amie est nee...\nVenezuela.\n\nMa meilleure amie est nee...\nEtats-Unis.\n\nMichael veut aller habiter...\nMaine.\n\nMichael veut aller habiter...\nNormandie.\n\nMichael veut aller habiter...\nToronto.\n\nJe vais aller chercher Catherine a l'aeroport. Elle revient...\nCanada ce soir.\n\nElle revient...\n\nLondres ce soir. Elle revient...\nLa Nouvelle-Orleans.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ACTIVIT WEB",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-302-french-ii-fall-2004/407397372286e4fa1a0db5f5d80b62ff_MIT21G_302_F04_web_Q.pdf",
      "content": "ACTIVITE WEB\n\nAllez sur le site suivant: http://mit.edu/mit-france/partnerships/hosts.html\nChoisissez une compagnie francaise qui vous interesse. Cliquez sur la version francaise\net remplissez le tableau suivant.\nSi vous ne trouvez pas l'information voulue, mettez un point d'interrogation (= ?).\n\nNOM DE LA COMPAGNIE\n\nTYPE DE COMPAGNIE\n\nEMPLACEMENT(S)\n\nPRODUITS VENDUS OU\nSERVICES PROPOSES\n\nQUELQUES CHIFFRES\n\nNOTEZ DES MOTS UTILISES\nPAR LA COMPAGNIE POUR\nSE DECRIRE\n\nQUALITES DEMANDEES\nAUX EMPLOYES\n\nAUTRE(S) INFORMATION(S)\nINTERESSANTE(S)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.302 / 21G.352 French II\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}