{
  "course_name": "From Print to Digital: Technologies of the Word, 1450-Present",
  "course_description": "There has been much discussion in recent years, on this campus and elsewhere, about the death of the book. Digitization and various forms of electronic media, some critics say, are rendering the printed text as obsolete as the writing quill. In this subject, we will examine the claims for and against the demise of the book, but we will also supplement these arguments with an historical perspective they lack: we will examine texts, printing technologies, and reading communities from roughly 1450 to the present. We will begin with the theoretical and historical overviews of Walter Ong and Elizabeth Eisenstein, after which we will study specific cases such as English chapbooks, Inkan knotted and dyed strings, late nineteenth-century recording devices, and newspapers online today. We will also visit a rare book library and make a poster on a hand-set printing press.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Intellectual History",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Intellectual History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nSubject Requirements\n\nActive class participation is central to our work together. Attendance is mandatory, and students are expected to arrive in class on time and prepared to discuss common readings. A student who misses two or more class sessions will automatically fail the subject. At the beginning of most class sessions, students will hand in two-page papers that address issues from that week's readings; the questions will be distributed in advance. A ten-page paper will be due in class in Lec #6, and a five page paper due on the last day of classes, five days after Lec #12. I will hand out instructions for these assignments later in the semester. There will be no exams and no final. Each assignment will be weighted as follows in the calculation of the final grade, although these calculations will also take into account improved performance during the course of the semester:\n\nACTIVITIES\n\nVALUES\n\nClass Participation\n\n40 points\n\nHomework (8 Assignments)\n\n40 points (5 points each)\n\nTen-page Paper\n\n80 points\n\nFive-page Paper\n\n40 points\n\nTotal\n\n200 points\n\nStatement on Cheating and Plagiarism\n\nThe Web now hosts many sites which offer college-level papers of varying quality on a variety of topics. I am well acquainted with these sites, and with others that offer detection services to professors.\nBuying a paper and submitting it as your own work is cheating. Copying sections from someone else's print or online work into your own without an acknowledgement is plagiarism.\nMIT has strict policies against both activities that I will fully enforce. For the appropriate MIT definitions and policies, visit the following Web sites. If you are uncertain about what constitutes cheating or plagiarism, please contact me before submitting the work in question.\n\nMIT Online Writing Communication Center\n\nAvoiding Plagiarism\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction: The Perpetually Imminent Demise of the Book\n\nTheorizing Orality and Literacy\n\nHomework 1 due\n\nWas There a \"Printing Revolution\"?\n\nHomework 2 due\n\nEnglish Chapbooks\n\nHomework 3 due\n\nA Visit to the Burndy Library\n\nHomework 4 due\n\nCritiquing Early Printing Assignments\n\nTen-page paper due\n\nTypesetting\n\nAn Alternative to the Technologized Word: The Inkan Khipu (Guest: Prof. Gary Urton, Anthropology, Harvard)\n\nHomework 5 due\n\nThe Technologized Word in the Nineteenth Century\n\nHomework 6 due\n\nConsultations with Instructor\n\nReading Communities Today\n\nHomework 7 due\n\nReading Online\n\nHomework 8 due\n\nConclusion\n\nFive-page paper due 5 days after Lec #12",
  "files": [
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/108f7d027cd0f07e410bf1891d9b409e_hw1.pdf",
      "content": "21H.418, Fall 2005\n\nFirst Homework Assignment: Ong, Orality and Literacy\n\nPlease submit electronically to the professor by 5 PM on the day of Lec #2.\n\n1. What does it mean to \"technologize a word\" (from the book's subtitle)?\n2. Imagine you are asked to give a tour of MIT to a person in the stage that Ong\nlabels \"primary orality\". Where would you take them? What aspects of MIT\nwould this individual easily grasp, and what aspects would he or she have\ndifficulty understanding?\n3. \"More than any other single invention, writing has transformed human\nconsciousness.\" (p. 78) What does Ong mean by this statement? Provide an\nexample of another significant invention that, in your opinion, has transformed\nhuman consciousness, and evaluate its impact in relation to that of writing."
    },
    {
      "category": "Resource",
      "title": "paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/c9629099c9fff6d0817f10a7f214b959_paper1.pdf",
      "content": "21H.418/CMS.880\nFall 2005\n\nFirst Paper Topic: Chapbook Analysis\n\nI. General Requirements\n1. Write a paper of at least ten pages in length, following the \"specific requirements\"\nbelow. A preliminary report on your paper, in which you provide the title of the\nchapbook you will study, and a summary of its contents, will be due electronically by 5\nPM on the day of Lec #5. A hard copy version of the paper is due at the beginning of class\nof Lec #7.\n2. Your paper must be computer-processed. The text should be double-spaced. Please\ngive your paper a title, and write your name on the back of the last page. Do not write\nyour name elsewhere on the paper. All pages should be numbered.\n3. Citations to texts read in this course should be made in parentheses in your paper. For\nexample, if you refer to a passage on page 13 of Elisabeth Eisenstein's The Printing\nRevolution in Early Modern Europe, indicate this in the following manner at the end of\nyour sentence, after the period: (Eisenstein, 13) Full citations to any work not assigned in\nclass should be made in footnote or endnote form. For more suggestions, see the study\nmaterials section.\n\nII. Specific Requirements\n\n1. Select a chapbook from the list of chapbooks below. Some of these works are available\nonline, through the Early Books Online (EEBO) resource, on the page of the MIT\nlibraries. Others can be consulted in hard copy at the Houghton Library, the Rare Books\nCollection at Harvard. See the related resources section for a link to EEBO, and directions to the\nHoughton Library at Harvard.\n2. Read the work, and provide the title and a summary of its contents electronically by 5\nPM on the day of Lec #5.\n3. Write a ten page paper on this work, due at the beginning of class of Lec #7, in which\nyou address the following issues:\n-\nWhat is the source of the story? If possible, state how the chapbook version of the\nstory differs from previous versions of the story.\n\n-\nSummarize the contents of the chapbook.\n-\nWho is the intended audience for the chapbook? (Here you may wish to draw on\nthe work of Margaret Spufford we read in class, or Tessa Watt, Cheap Print and\nPopular Piety, 1550-1640 (available at the reserve reading desk in Hayden.)\n-\nIn what ways does this work blend oral and print culture? Consider the work's\ncontent and its typographical conventions.\n-\nWould your detailed study of this chapbook cause you to modify any aspects of\nOng's argument about orality and literacy? Would it prompt you to rethink\nEisenstein's notion of a \"printing revolution\"? (You must discuss either Ong or\nEisenstein in your paper, but you do not have to consider both.)\n\nIII. List of Chapbooks\nA. Early English Books Online (EEBO)\n(These are some suggested titles from the EEBO. You may also browse the collection's\nholdings and propose another title, but you must get my approval before you proceed\nwith your paper.)\n-\nRycharde Rolle hermyte of Hampull in his contemplacyons of the drede and loue\nof god with other dyuerse tytles as it sheweth in his table. (1519)\n-\nA counterblaste to tobacco (1604)\n-\nTarltons newes out of purgatorie Onely such a iest as his iigge, fit for gentlemen\nto laugh at an houre, &c. Published by an old companion of his, Robin\nGoodfellow. (1590)\n-\nRobin Good-Fellovv, his mad prankes, and merry iests full of honest mirth, and is\na fit medicine for melancholy. (1628)\n-\nKeep within compasse Dick and Robin, there is no harme in all this, or, A merry\ndialogue betwen two or three merry coblers, with divers songs full of mirth and\nnewes, which may very fitly be applyed to these times (1641)\n-\nTopsie-turvy, hey-down-derry, or, The colledge of fools display'd and their capps\ntost at tennis in a jovial discourse, betwixt Merry Andrew and Poor Robin : in\nwhich, with other varieties : Merry Andrew to the life discovers the several\nhumours, tricks and devices with which some folk use to delight themselves.\n(1672)\n-\nThe vvitch of the vvoodlands: or, The coblers new translation. Written by L.P.\nHere Robin the cobler for his former evils, was punisht worse then Faustus was\nwith his devils (1680)\n-\nTom Thumbe, his life and death wherein is declared many maruailous acts of\nmanhood, full of wonder, and strange merriments: which little knight liued in\nKing Arthurs time, and famous in the court of Great-Brittaine. (1630)\n-\nMurder upon murder committed by Thomas Sherwood, alias, Countrey Tom: and\nElizabeth Evans, alias, Canbrye Besse (1635)\n\n-\nThe complaint of Christmas· And the teares of Twelfetyde. (1631)\n-\nA contention betwene three bretheren, that is to say, the vvhoremonger, the\ndronkarde, and the diceplayer to approue which of them three is the worste (1581)\n-\nVVine, beere, and ale, together by the eares A dialogue, vvritten first in Dutch by\nGallobelgicus, and faithfully translated out of the originall copie, by Mercurius\nBritannicus, for the benefite of his nation. (1629)\nB. Houghton Library (Search Harvard's online Catalogue)\n(Again, these titles are suggestions. If you find another title that interests you, clear it\nwith me first.)\n-\nThe comical budget of fun and frolic, containing all the most popular and new\npuns, jests, and witty sayings of the most eminent men. By Godfrey imcrackiana,\nesq. (Houghton Accessions *44W-1223)\n-\nA merry jest of the frier and the boy. (Houghton Accessions *61-2112)\n-\nA pretty dialogue betwixt Robin Hood and a begger. (Houghton Accessions *61-\n2111 [Bound with *61-2112.])\n-\nThe history of Goody Two shoes. (Houghton 25276.3*)\n-\nThe famous and renowned history of the life and glorious actions of the mighty\nHercules of Greece : his encount[e]ring, and overcoming serpents, lions,\nmonsters, giants, tyrants, and powerful armies; his taking of cities, towns, kings,\nand kingdoms, etc. with many rare and extraordinary adventures, and exploits,\nwonderful and amazing. Also the manner of his unfortunate death, being the most\nexcellent of histories. (Houghton Accessions *59-202)\n-\nThe unknown, or, The horrors of Montaldo : a romance in which is related the\nunprecedented and wonderful adventures of Gonsalvo, who discovers that his\nparents have been inhumanely and secretly murdered by the perfidious tyrant\nDespardo. (Houghton 19464.37.25*)"
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/43df82c357bd1ab9be47c4bf957d2abe_hw2.pdf",
      "content": "21H.418\nFall 2005\n\nHOMEWORK ASSIGNEMENT # 2\nWas There a Printing Revolution?\n\nPlease submit responses to the following questions to the professor by 5 PM\non the day of Lec # 3.\n\n********************************\n\n1) Ong, as we saw last week, argues that the great break in the history of\n\"technologizing the word\" occurred with the invention of writing. How would\nEisenstein rebut this claim?\n\n2) According to Eisenstein, what features of print culture explain its \"revolutionary\"\nimpact?\n\n3) Would Clanchy agree with Eisenstein that the introduction of printing technology\nin Europe ca. 1450 constituted a Revolution? Why, or why not?\n\n4) While appreciative of Eisenstein's work, Anthony Grafton also has important\nreservations about her thesis. Discuss one or two of these reservations, and state\nwhy you do, or do not, agree with him."
    },
    {
      "category": "Resource",
      "title": "paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/54bb5e8cb3e9379c5e1ac22a8399e3d2_paper2.pdf",
      "content": "21H.418/CMS.880\nFall 2005\n\nSecond Paper Topics\n\nRequirements\n1. Please write a five-page paper in response to ONE of the topics below. The text\nshould be double-spaced. The paper is due by 7 PM five days after Lec #13.\n\n2. Your paper must be computer-processed. Please give your paper a title, and write\nyour name on the back of the last page. Do not write your name elsewhere on the\npaper. All pages should be numbered. Refer to the accompanying handout, posted\non the stellar web site, for further editing suggestions.\n\n3. Citations to texts read in this course should be made in parentheses in your paper.\nFor example, if you refer to a passage on page 13 of Long's Book Clubs, indicate\nthis in the following manner at the end of your sentence, after the period: (Long, 13)\nFull citations to any work not assigned in class should be made in footnote or\nendnote form.\n\nTopics\n1. Does the advent of digital technology today constitute a communications\nrevolution as significant as the one that some scholars believe occurred as a result\nof the introduction of the printing press in Europe ca. 1450? Please consider\nevidence from either Elizabeth Long's Book Clubs, or Pablo Boczkowski's\nDigitizing the News, in your response.\n\n2. The time is the present. Imagine that you are a medieval illuminator, an ancient\nInkan khipukamayuq, Johannes Gutenberg, a continental typesetter from the first\nhalf of the sixteenth century, or a chapbook reader from seventeenth-century\nEngland. You have been miraculously resurrected, placed in front of a computer\nterminal, and, after suitable training, instructed to explore the internet. Record\nyour responses to this activity in the form of a journal entry or a letter to long-\ndeceased acquaintance."
    },
    {
      "category": "Resource",
      "title": "Proudfoot_paper_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/d0aa5c799d4214a787e219b3017e401e_Proudfoot_paper_2.pdf",
      "content": "(Courtesy of David Proudfoot. Used with permission.)\nDavid Proudfoot\n\nJournal of Johannes Gutenberg\nEntry December 5th, 2005\n\nToday I will not be going into the specifics of how I got to this time and place or\ntheorizing the mechanics by which it may have been achieved. Since arriving this has\nbeen, understandably I think, all that has occupied my mind. But I have written enough\nabout this subject in the entries of the past weeks and I am still no closer to resolution of\nthe question. Today's entry will be much different, for I have finally figured out where,\nexactly, I am.\nI have been staying the past couple of days with a young man named David\nProudfoot. He has taken me into his room under the assumption that I am a \"pre-frosh.\"\nFrom what I have gathered from materials in his room (he has many books, as do all the\nstudents, my invention must have succeeded), he is a student at the Massachusetts\nInstitute of Technology. It seems that these pre-frosh are people visiting the school,\ndeciding if they want to go there. I figured I would not correct him, as this would be the\nperfect guise to cover the ignorance of my general situation.\nAs I had never heard of this Massachusetts, I did some more research yesterday\nwhile he was at class. I walked across the concrete paths, narrowly escaping being\ntrampled by the roaring, beeping, mechanical beasts I have described in previous entries\nand entered a shop whose sign read Store 24. In here, I found a map (many printed\ncopies were available very cheaply, it was great to see yet another application of my\nwork) of this place called Massachusetts. I was able to establish my location by\n\n(Courtesy of David Proudfoot. Used with permission.)\nreferencing some of the signs I had seen at the road intersections with those on the map.\nIt appears I am in a city called Boston, and very near the coast. But what coast?\nI picked up a different map. This map seemed to be for an entire country called\nthe United States of America. Massachusetts, it seems, it just one of the fifty states I\ncounted on this map. It is located in the Northeast coast of what looks like a very\nextensive country. This, of course, brought up more new questions than it answered.\nWhere could this massive country have come from? Surely in the five and a half\ncenturies I had been dormant, governments could have fallen and borders been reformed,\nbut this land mass looked like nothing I had ever seen. Had the continents shifted so\nquickly? Was I even still on my home planet, the Earth?\nI decided this was an important enough question to risk exposing who I really\nwas. When Mr. Proudfoot came back from class that day I approached him about the\nsubject. I asked him to tell me about the United States. He said, \"What do you mean\nabout the US? Aren't you from here?\" I said that no, I was in fact from Germany. I was\nrelieved to find out that I had not revealed myself with this fact, as he replied, \"Oh,\nyou're one of the exchange students. I got ya. Well you must want to know a bit more\nabout our history then?\" When I replied in the affirmative he brought me to the most\nstrange and wonderful machine I have ever laid my eyes upon.\n\"This,\" he said, \"is my computer. Feel free to use the internet. Just click on\nInternet Explorer over there.\" I stared at the machine. All the letters of the alphabet,\nnumbers, and punctuation were laid out on small squares in front of me. It immediately\nbrought to mind the cases of type we had kept for the presses. However, these letters\nonly seemed to move in and out of the machine and were not raised to print. I looked\n\n(Courtesy of David Proudfoot. Used with permission.)\nback at Mr. Proudfoot who immediately picked up on my confusion. \"What's the matter?\nDon't tell me you've never used the internet before.\" I replied, \"Actually, sir, I am from\na very small town in Germany. I have never used one of these internet machines.\" After\na moment of looking at me in a manner that suggested he was equally as puzzled as I\nwas, he recovered and said, \"This isn't an internet machine, it's a computer. You just\naccess the internet through it.\"\nMr. Proudfoot took the rest of his afternoon to help me learn to use the computer\nmachine. It was an interesting, if not confusing experience. Apparently, much of the\nfunction of the machine has descended from my printing press! The first thing he taught\nme to do was to \"type.\" In a way, this is much like type setting type on the press.\nHowever, through mechanisms which I cannot begin to comprehend, only the one set of\ntype laid out before me (I would come to find this is called the keyboard) was required.\nSimply striking these keys would make the corresponding characters appear on the\nmedium in front of me, which Mr. Proudfoot called the screen. Now, it is important to\nnote that the screen was rather large. The space the type appeared on was about the size\nof the sheet of paper...but it was much deeper, much heavier, and much harder. It did not\nseem to be much use. What good was this screen? It was hardly portable. You could not\nfold it up and put it in your pocket. I couldn't imagine storing these screens, how much\nwould space would even a single book take up?\nWhen I brought these concerns up, Mr. Proudfoot laughed and took the \"mouse\"\n(a device used to move a pointer on the screen) in his hand. He moved the cursor over a\nbutton on the screen and clicked one of the devices buttons. Next to me, another machine\ncame to life with a whir of machinery. Only seconds later a piece of paper came out. I\n\n(Courtesy of David Proudfoot. Used with permission.)\nstudied the leaflet closely. It was covered in printed text. It was perfectly spaced. The\nletters seemed perfectly constructed. No ink was smudged, yet I could tell it certainly ink\nthat had formed the characters. The print job was all around flawless. Only then did I\nread the text...it was the words I had just typed. I looked at this printer and my eyes\nfollowed a small cable from it to the computer machine. That was it, just a small cable,\nno bigger than the diameter of my pinky, had transferred the type I had set on the screen\nto the printer. I looked back at the screen and to my astonishment I realized that I was\nwrong. The type had not been transferred, it was still there. It had been copied.\nThe computer had made for me, completely uninitiated in its ways, possible in\nminutes what would have taken hours or days on my machine by an skilled printer. I was\noverwhelmed. And as hard as it may be to believe, the most astonishing ability of the\ncomputer was yet to come.\nAfter I had realized the computer and printer were capable of spreading ideas\nfaster than I had ever dreamed possible with my press, we moved on to the reason I had\nbeen shown the computer in the first place. Mr. Proudfoot once again took control of the\nmouse. In an instant, the type I had laid out disappeared from the screen. A few seconds\nlater, the screen was washed in white with a few multicolored letters in the middle that\nspelled out \"Google.\" Below this title was a gray box, in which the computer's cursor\nblinked on and off, expectantly. \"There you are,\" Mr. Proudfoot said, \"Now you can\nlook up whatever you want to know about the US. Just type in what you are looking for.\"\nSo I did. I searched for United States of America.\nThe Google page disappeared. In its place, a new Google page appeared. At the\nvery top of this page, a miniaturized version of the Google logo and grey text box were\n\n(Courtesy of David Proudfoot. Used with permission.)\nfound. Below that were a few pictures of the Untied States, outlines of the same country\nI had found in the maps. The rest of the page contained titles in blue, with small\ndescriptions underneath. I was interested in some of these titles, but the descriptions did\nnot get me very far. Using the mouse, however, I was able to \"click\" on the titles and\nopen up whole new pages. On these pages, too, were blue underlined words. I could\nclick on these to bring up whole new pages...instantly.\nThe amount of information I was presented with in such a short time was\nshocking. I found the answer to my earlier questions quickly. Shortly after my time, a\nSpanish man named Christopher Columbus had set sail to the west, determined that the\nworld was indeed not flat and that he could loop around and find the short way to India.\nWhile he was right about the world being round, he did not find India. Instead he found a\nwhole new continent. There were two of them in fact, North and South America. The\nEuropean counties sent people over to lay claim to the new world. The different\ncountries went to war with each other for the land. Eventually, some of the colonists\ndecided they didn't like being fought over, and they formed their own country, the United\nStates of America. So it is still all there, the rest of the world I had known. This place is\njust a new addition.\nHaving missed all this, however, I must have mad a million new questions. The\ninternet brought me so many answers, and quickly. I couldn't believe the amount of\ninformation this little machine had stored. I asked Mr. Proudfoot how it knew so much.\n\"It doesn't. It's all out there,\" he responded, waving his hands in no specific direction,\n\"on the internet. My computer is just hooked up to it. The internet doesn't know things,\n\n(Courtesy of David Proudfoot. Used with permission.)\npeople know things. Then they type those things up and put them on the internet.\" So\nthere it was. All along, the power had been in the people, not the machine.\nWhen I invented the printing press I knew it could it have far reaching effects if\npeople utilized it properly. I always thought it was the greatest triumph of my life,\nbringing the technology to let people spread their ideas easier, to give more people access\nto the knowledge of the world. The computer and printer had made this process even\neasier, but it is the internet that will take this idea beyond my dreams. I was amazed\nwhen the page came out of Mr. Proudfoot's printing machine, but the information that is\nnot even printed is the most revolutionary. Anyone with access to a computer and the\ninternet can retrieve enormous volumes of information and opinions, more than all the\nlibraries in my Germany combined. And all these same people can become publishers\nthemselves, sharing their own ideas or adding to the collective knowledge of the society.\nIn my weeks here in 2005 I have seen the effects that my press has had on the\nworld. Printed material is everywhere. Newspapers are distributed throughout the city,\nthe students' rooms are filled with large, illuminated text books, and smaller paper back\nbooks are found on every last shelf I've seen. But the effects of my invention will be\ndwarfed by the internet. In only the few days I have been using it I can understand. It\nprovides instant access to any piece of knowledge that exists. Every time I need to know\nsomething now, I can just \"Google it.\" It would indeed seem that if it doesn't exist on the\ninternet, man kind has not yet discovered it.\nSo I finally figured out where I am. In a house, in the city of Boston, in the state\nof Massachusetts, in the country of United States of America, on the planet Earth, in the\ntime of the Information Revolution."
    },
    {
      "category": "Resource",
      "title": "proudfootpaper_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/b0ee9382f80137b937b53cd2b3de8acf_proudfootpaper_2.pdf",
      "content": "(Courtesy of David Proudfoot. Used with permission.)\nDavid Proudfoot\n\nJournal of Johannes Gutenberg\nEntry December 5th, 2005\n\nToday I will not be going into the specifics of how I got to this time and place or\ntheorizing the mechanics by which it may have been achieved. Since arriving this has\nbeen, understandably I think, all that has occupied my mind. But I have written enough\nabout this subject in the entries of the past weeks and I am still no closer to resolution of\nthe question. Today's entry will be much different, for I have finally figured out where,\nexactly, I am.\nI have been staying the past couple of days with a young man named David\nProudfoot. He has taken me into his room under the assumption that I am a \"pre-frosh.\"\nFrom what I have gathered from materials in his room (he has many books, as do all the\nstudents, my invention must have succeeded), he is a student at the Massachusetts\nInstitute of Technology. It seems that these pre-frosh are people visiting the school,\ndeciding if they want to go there. I figured I would not correct him, as this would be the\nperfect guise to cover the ignorance of my general situation.\nAs I had never heard of this Massachusetts, I did some more research yesterday\nwhile he was at class. I walked across the concrete paths, narrowly escaping being\ntrampled by the roaring, beeping, mechanical beasts I have described in previous entries\nand entered a shop whose sign read Store 24. In here, I found a map (many printed\ncopies were available very cheaply, it was great to see yet another application of my\nwork) of this place called Massachusetts. I was able to establish my location by\n\n(Courtesy of David Proudfoot. Used with permission.)\nreferencing some of the signs I had seen at the road intersections with those on the map.\nIt appears I am in a city called Boston, and very near the coast. But what coast?\nI picked up a different map. This map seemed to be for an entire country called\nthe United States of America. Massachusetts, it seems, it just one of the fifty states I\ncounted on this map. It is located in the Northeast coast of what looks like a very\nextensive country. This, of course, brought up more new questions than it answered.\nWhere could this massive country have come from? Surely in the five and a half\ncenturies I had been dormant, governments could have fallen and borders been reformed,\nbut this land mass looked like nothing I had ever seen. Had the continents shifted so\nquickly? Was I even still on my home planet, the Earth?\nI decided this was an important enough question to risk exposing who I really\nwas. When Mr. Proudfoot came back from class that day I approached him about the\nsubject. I asked him to tell me about the United States. He said, \"What do you mean\nabout the US? Aren't you from here?\" I said that no, I was in fact from Germany. I was\nrelieved to find out that I had not revealed myself with this fact, as he replied, \"Oh,\nyou're one of the exchange students. I got ya. Well you must want to know a bit more\nabout our history then?\" When I replied in the affirmative he brought me to the most\nstrange and wonderful machine I have ever laid my eyes upon.\n\"This,\" he said, \"is my computer. Feel free to use the internet. Just click on\nInternet Explorer over there.\" I stared at the machine. All the letters of the alphabet,\nnumbers, and punctuation were laid out on small squares in front of me. It immediately\nbrought to mind the cases of type we had kept for the presses. However, these letters\nonly seemed to move in and out of the machine and were not raised to print. I looked\n\n(Courtesy of David Proudfoot. Used with permission.)\nback at Mr. Proudfoot who immediately picked up on my confusion. \"What's the matter?\nDon't tell me you've never used the internet before.\" I replied, \"Actually, sir, I am from\na very small town in Germany. I have never used one of these internet machines.\" After\na moment of looking at me in a manner that suggested he was equally as puzzled as I\nwas, he recovered and said, \"This isn't an internet machine, it's a computer. You just\naccess the internet through it.\"\nMr. Proudfoot took the rest of his afternoon to help me learn to use the computer\nmachine. It was an interesting, if not confusing experience. Apparently, much of the\nfunction of the machine has descended from my printing press! The first thing he taught\nme to do was to \"type.\" In a way, this is much like type setting type on the press.\nHowever, through mechanisms which I cannot begin to comprehend, only the one set of\ntype laid out before me (I would come to find this is called the keyboard) was required.\nSimply striking these keys would make the corresponding characters appear on the\nmedium in front of me, which Mr. Proudfoot called the screen. Now, it is important to\nnote that the screen was rather large. The space the type appeared on was about the size\nof the sheet of paper...but it was much deeper, much heavier, and much harder. It did not\nseem to be much use. What good was this screen? It was hardly portable. You could not\nfold it up and put it in your pocket. I couldn't imagine storing these screens, how much\nwould space would even a single book take up?\nWhen I brought these concerns up, Mr. Proudfoot laughed and took the \"mouse\"\n(a device used to move a pointer on the screen) in his hand. He moved the cursor over a\nbutton on the screen and clicked one of the devices buttons. Next to me, another machine\ncame to life with a whir of machinery. Only seconds later a piece of paper came out. I\n\n(Courtesy of David Proudfoot. Used with permission.)\nstudied the leaflet closely. It was covered in printed text. It was perfectly spaced. The\nletters seemed perfectly constructed. No ink was smudged, yet I could tell it certainly ink\nthat had formed the characters. The print job was all around flawless. Only then did I\nread the text...it was the words I had just typed. I looked at this printer and my eyes\nfollowed a small cable from it to the computer machine. That was it, just a small cable,\nno bigger than the diameter of my pinky, had transferred the type I had set on the screen\nto the printer. I looked back at the screen and to my astonishment I realized that I was\nwrong. The type had not been transferred, it was still there. It had been copied.\nThe computer had made for me, completely uninitiated in its ways, possible in\nminutes what would have taken hours or days on my machine by an skilled printer. I was\noverwhelmed. And as hard as it may be to believe, the most astonishing ability of the\ncomputer was yet to come.\nAfter I had realized the computer and printer were capable of spreading ideas\nfaster than I had ever dreamed possible with my press, we moved on to the reason I had\nbeen shown the computer in the first place. Mr. Proudfoot once again took control of the\nmouse. In an instant, the type I had laid out disappeared from the screen. A few seconds\nlater, the screen was washed in white with a few multicolored letters in the middle that\nspelled out \"Google.\" Below this title was a gray box, in which the computer's cursor\nblinked on and off, expectantly. \"There you are,\" Mr. Proudfoot said, \"Now you can\nlook up whatever you want to know about the US. Just type in what you are looking for.\"\nSo I did. I searched for United States of America.\nThe Google page disappeared. In its place, a new Google page appeared. At the\nvery top of this page, a miniaturized version of the Google logo and grey text box were\n\n(Courtesy of David Proudfoot. Used with permission.)\nfound. Below that were a few pictures of the Untied States, outlines of the same country\nI had found in the maps. The rest of the page contained titles in blue, with small\ndescriptions underneath. I was interested in some of these titles, but the descriptions did\nnot get me very far. Using the mouse, however, I was able to \"click\" on the titles and\nopen up whole new pages. On these pages, too, were blue underlined words. I could\nclick on these to bring up whole new pages...instantly.\nThe amount of information I was presented with in such a short time was\nshocking. I found the answer to my earlier questions quickly. Shortly after my time, a\nSpanish man named Christopher Columbus had set sail to the west, determined that the\nworld was indeed not flat and that he could loop around and find the short way to India.\nWhile he was right about the world being round, he did not find India. Instead he found a\nwhole new continent. There were two of them in fact, North and South America. The\nEuropean counties sent people over to lay claim to the new world. The different\ncountries went to war with each other for the land. Eventually, some of the colonists\ndecided they didn't like being fought over, and they formed their own country, the United\nStates of America. So it is still all there, the rest of the world I had known. This place is\njust a new addition.\nHaving missed all this, however, I must have mad a million new questions. The\ninternet brought me so many answers, and quickly. I couldn't believe the amount of\ninformation this little machine had stored. I asked Mr. Proudfoot how it knew so much.\n\"It doesn't. It's all out there,\" he responded, waving his hands in no specific direction,\n\"on the internet. My computer is just hooked up to it. The internet doesn't know things,\n\n(Courtesy of David Proudfoot. Used with permission.)\npeople know things. Then they type those things up and put them on the internet.\" So\nthere it was. All along, the power had been in the people, not the machine.\nWhen I invented the printing press I knew it could it have far reaching effects if\npeople utilized it properly. I always thought it was the greatest triumph of my life,\nbringing the technology to let people spread their ideas easier, to give more people access\nto the knowledge of the world. The computer and printer had made this process even\neasier, but it is the internet that will take this idea beyond my dreams. I was amazed\nwhen the page came out of Mr. Proudfoot's printing machine, but the information that is\nnot even printed is the most revolutionary. Anyone with access to a computer and the\ninternet can retrieve enormous volumes of information and opinions, more than all the\nlibraries in my Germany combined. And all these same people can become publishers\nthemselves, sharing their own ideas or adding to the collective knowledge of the society.\nIn my weeks here in 2005 I have seen the effects that my press has had on the\nworld. Printed material is everywhere. Newspapers are distributed throughout the city,\nthe students' rooms are filled with large, illuminated text books, and smaller paper back\nbooks are found on every last shelf I've seen. But the effects of my invention will be\ndwarfed by the internet. In only the few days I have been using it I can understand. It\nprovides instant access to any piece of knowledge that exists. Every time I need to know\nsomething now, I can just \"Google it.\" It would indeed seem that if it doesn't exist on the\ninternet, man kind has not yet discovered it.\nSo I finally figured out where I am. In a house, in the city of Boston, in the state\nof Massachusetts, in the country of United States of America, on the planet Earth, in the\ntime of the Information Revolution."
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/9b104a161c2d2781bca6dbcd42a7c2e8_hw3.pdf",
      "content": "21H.418\nFall 2005\n\nHOMEWORK ASSIGNEMENT # 3\nEnglish Chapbooks\n\nPlease submit responses to the following questions to the professor by 5 PM\non the day of Lec #4.\n\n********************************\n\n1) Using arguments provided by Spufford, evaluate the readers of early modern English\nchapbooks. Are they the same readers Eisenstein imagines for works of classical\nscholarship, religion, and science? Is it possible to generalize about the reading practices\nof English chapbook readers?\n2) Consider English chapbook readers in light of Ong's arguments about orality and\nliteracy. To what extent do traces of orality remain in the texts of the chapbooks?\n3) Are there texts available in print or online today that resemble any of the excerpts that\nyou read from Samuel Pepys' Penny Merriments? Name one or two publishing genres\ntoday that you think might be distantly related to the early modern chapbook, and state\nwhy you think there are similarities."
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/1e2304cf2ef0bc3596b8d7bd71197f2b_hw4.pdf",
      "content": "21H.418\nFall 2005\n\nHOMEWORK ASSIGNMENT # 4\nEisenstein's Printing Revolution Revisited\n\nPlease submit responses to the following questions to the professor by 5 PM\non the day of Lec #5.\n\n********************************\n\n1) Which criticisms of her \"printing revolution\" thesis does Eisenstein address in\nthis debate? How does she respond to her critics?\n\n2) In 1998, Adrian Johns published a volume, The Nature of the Book: Print and\nKnowledge in the Making, which was just as large as Eisenstein's earlier thesis,\nand equally provocative and influential. As you will gather from Eisenstein's\ncontribution to this debate, Johns confined himself primarily to examples drawn\nfrom seventeenth-century English science and bookmaking. What are Johns'\ncriticisms of Eisenstein? How does he differ from the criticisms made by Grafton\nand Clanchy two decades earlier?\n\n3) Who do you think is right: Eisenstein, or Johns? Why?"
    },
    {
      "category": "Resource",
      "title": "hw5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/02b6c3f63d6ba8e9f7c95f7cc002bcc9_hw5.pdf",
      "content": "21H.418\nFall 2005\n\nHOMEWORK ASSIGNMENT # 5\nInkan Khipus\n\nPlease submit responses to the following questions to the professor by 5 PM\non the day of Lec #8.\n\n**************************************************\n\nN.B.: I suggest you read the article by\nConklin before the chapters from Urton's book.\n\n1) Discuss two or three reasons why scholars today have not yet figured out how to\naccess the information contained in Inkan Khipus.\n\n2) What are the main elements of the theories for \"reading\" khipus put forth by\nConklin and Urton?\n\n3) Ong argues that writing restructures human consciousness. Do you think that\nkhipu-making restructured Inkan consciousness in a similar fashion?"
    },
    {
      "category": "Resource",
      "title": "hw6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-418-from-print-to-digital-technologies-of-the-word-1450-present-fall-2005/f2eea277cfd390e6a8db041715c620d4_hw6.pdf",
      "content": "21H.418\nFall 2005\n\nHOMEWORK ASSIGNMENT # 6\nScripts, Grooves, and Writing Machines\n\nPlease submit responses to the following questions to the professor by 5 PM\non the day of Lec #9.\n\n**************************************************\n\n1) Does Gitelman think the phonograph provoked a communications revolution\ncomparable to Eisenstein's printing revolution?\n\n2) Does phonograph technology at the end of the nineteenth century make orality\nmore or less dependent on textuality?\n\n3) Based on your reading of Gitelman, do you think technology drove culture at the\nend of the nineteenth century, or vice versa?"
    }
  ]
}