{
  "course_name": "Fundamentals of Energy in Buildings",
  "course_description": "This design-based subject provides a first course in energy and thermo-sciences with applications to sustainable energy-efficient architecture and building technology. No previous experience with subject matter is assumed. After taking this subject, students will understand introductory thermodynamics and heat transfer, know the leading order factors in building energy use, and have creatively employed their understanding of energy fundamentals and knowledge of building energy use in innovative building design projects. This year, the focus will be on design projects that will complement the new NSTAR/MIT campus efficiency program.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Architectural Engineering",
    "Environmental Design",
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Architectural Engineering",
    "Environmental Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nPrerequisites\n\n8.01 Physics I: Classical Mechanics\n\n18.02 Multivariable Calculus\n\nCourse Overview\n\nThis design-based subject provides a first course in energy and thermo-sciences with applications to sustainable energy-efficient architecture and building technology. No previous experience with subject matter is assumed. After taking this subject, students will understand introductory thermodynamics and heat transfer, know the leading order factors in building energy use, and have creatively employed their understanding of energy fundamentals and knowledge of building energy use in innovative building design projects. This year, the focus will be on design projects that will complement the new NSTAR/MIT\ncampus efficiency program\n.\n\nAssignments and Evaluations\n\nThe final grade in the course will be based upon analytical homework assignments, two quizzes, design projects, and class participation weighted as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework assignments and class participation\n\n20%\n\nTwo design projects\n\n20%\n\nTwo quizzes\n\n30%\n\nFinal exam\n\n30%\n\nHomework\n\nHomework will be distributed in class, and due dates announced at that time. The assignments are essential to learning the material. There will be seven assignments throughout the semester. Each student will make a short presentation on their evaluation of an advanced building that they have visited.\n\nDesign Projects\n\nThere will be two design projects in this class. They will require creative use of the principles and information given in the course to solve a particular problem, relating to energy consumption in buildings. They will be due in Lec #17 and Lec #26, respectively.\n\nExams\n\nThere will be two open book quizzes given in class (1 1/2 hour duration each). They are scheduled for Lec #13 and Lec #21, at the usual class time and location. The content of the quizzes will be discussed in the class sessions leading up to the quizzes. There will also be a three-hour long exam during the final exam period.\n\nTextbook and Readings\n\nThe required text for this course is:\n\nLevenspiel, Octave.\nUnderstanding Engineering Thermo\n. Upper Saddle River, NJ: Prentice Hall, 1996. ISBN: 9780135312032.",
  "files": [
    {
      "category": "Resource",
      "title": "Homework Set #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/ae9e6ce71d8fe1a01a329571c1bb4463_MIT4_42JF10_assn01.pdf",
      "content": "Page 1 of 2\nFALL '10\n1.044J, 2.45J, 4.42J\n\nHomework Set # 1\n\n1.\nThe average energy used for heating a 1980's single family home is roughly 84 x 106 kJ, 80 x 106 BTU in\na climate similar to Boston or Madison, Wisconsin. Heating is mainly needed for the six coldest months.\nUse the enclosed table of daily solar radiation, taken from ASHRAE Handbook of Fundamentals 1997, to\nestimate, to within 15 to 20 percent accuracy, the size of a solar collector needed, in ft,or m2, to supply\n75% of the heating energy for the house for the six winter months. Assume the energy collected on the\ncollector is 50% of the total solar radiation incident on the collector.\n\n2.\nAssume the house is a typical US home with 2000 square feet total floor area overall. Sketch a\npreliminary design of the appropriate sized collector integrated into the roof. The design and\norientation is your choice. What if the long axis of the house is N-S?\n\n3.\nA solar collector costs roughly $25/ft2 of collector area for the entire system. A gallon of fuel oil\ncan supply roughly 140,000 BTU, 158 x 106 J, and costs 2.5 dollars. Compare the economics of a\none square foot collector versus heating with oil. Consider how to compare building cost versus\noperating cost. What other alternatives should be considered?\n\n.How big must the solar collector be to supply all of the heating energy if no back up system is included?\n\nOn same consistent basis, e.g. J, Kw-hr, or BTU compare the costs of energy supplied by\nelectricity, and by burning natural gas and heating oil. Use average consumer prices for one area,\nsuch as Boston. Obtain prices directly from utilities or from reference sources. Is there a disparity in\nenergy prices? If so, is this a consumer rip off or is there some justification? This problem is\nfundamental to many energy considerations.\n\n6. You have been recently hired by MIT to perform a partial energy audit of one of the new luxury\ndorm rooms just built on campus. Each room comes with quite a bit of pre-installed equipment for\nthe students. Your task is to estimate the electricity usage of one of these rooms. Among other\nitems in the room are: a room air conditioner, full-size refrigerator, microwave oven, coffee maker,\ntoaster, iron, hair dryer, TV and VCR, PC, monitor and laser printer. Assume the electrical lighting\nis the same as in your own room. Use the kill a watt meters we will supply to make your\nmeasurements. Don't forget the energy sued by power supplies and other items in standby mode.\n\nNow assume that the student has everything running at full blast at one time. How much electrical\npower does this room need to be supplied with (in Watts)? Make some assumptions about how long\neach appliance is used on a certain day. How many kilowatt-hours of electricity are used by this\nroom in one day? Based on your response to Problem 5, how much does electricity cost for one\nday?\n\nSubmit a table with the following information for each appliance:\n\nAppliance 1\n350W\n2 hours/day\n700 kWh/day\nName of Source\n\n7.\nFor your living group at MIT, list two or three strategies to make it more energy efficient.\n\nYour sources may include: info on the backs of appliances, the internet, and your own\nmeasurements.\n\nPage 2 of 2\n\nTable from ASHRAE Handbook of Fundamentals\nDaily Solar Heat Gain Through a Single Sheet of Clear Glass at 40 N Latitude\nWith a Clear sky\nMonth\nHorizontal\nVertical South Vertical East\n\nDaily (W h/m2)\nFacing\nFacing\n\nJan\n\nFeb\n\nMar\n\nApr\n\nMay\n\nJun\n\nJul\n\nAug\n\nSep\n\nOct\n\nNov\n\nDec\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/a23f265c416f271a8ab137c59cb68568_MIT4_42JF10_assn02.pdf",
      "content": "Page 1 of 2\n\nFall'10\n1.044J, 2.66J, 4.42J\nHomework Set #2\n\n1.\nLook at the cutaway of the EdenPure Quartz Infrared heater on\nhttp://edenpurestore.com/bob_vila_edenpure, How would the design and materials of the\ncured copper tubes improve the efficiency of the heater? From an energy perspective\nwhat is the proper definition of efficiency?\n\n2.\nOne means proposed to conserve energy for space heating is the use of night\nsetback; the interior temperature of a building is reduced during the evening. The heat\ntransferred from the building to the outside air is directly proportional to the temperature\ndifference between the building interior and the outdoor ambient temperature. Between\nthe hours of 8 AM and 10 PM the interior temperature in the winter should remain at\n20C. At night for the remaining 10 hours, it cannot fall below 12 C when the ambient\ntemperature is constant at 0C.\na) You are asked to design a control strategy, when to turn the heater off and on, to stay\nwithin these temperature limits while minimizing the total heater energy for a 24 hour\nperiod. For a given building you will be given an Excel program that will be predict the\ninternal temperature response and heater energy. The heater only has three setting, on\nlow, on high and off. Setting the heater on low at steady state will just maintain the house\nat 12C. You can design the maximum heater size, high, the maximum heater output as a\nmultiple of the low setting between 1 and 5. What is the minimum energy for the\nnighttime?\nb) Some people have questioned this strategy claiming that the total energy saved by\nnight setback is reduced because of the additional energy needed to raise the interior\ntemperature in the morning. Consider a 24-hour period for a building. The internal\nenergy of the building is proportional to the temperature. Be careful in defining the\nsystem and the heat and work interactions at the boundaries. What is the net energy\nchange for the system over the 24-hour period? How much impact does the reheating\nenergy in the morning have on the savings due to the night setback?\n\n3.\nThe door to an ordinary electric home refrigerator is left open by accident (with\nthe power on) while the people are away for the weekend. If the kitchen doors are closed\nand the room is thermally well insulated, will the room be hotter than, colder than, or at\nthe same temperature as the rest of the house when the unhappy people return? Why?\n\nPage 2 of 2\n\nFall'08\n1.044J, 2.66J, 4.42J\nHomework Set #2\n\n4.\nAn investigator suggests use of a heat pump to provide winter heating to a\nbuilding. Instead of using the outside air as the low temperature heat source, she proposes\nto use the domestic water system which enters the house at a higher temperature than the\noutside air. This raises the heat pump average coefficient of performance QH/W from 2.5\nto 3.0. As the heat pump operates, Qw is transferred from the water, lowing TI, the inlet\nwater temperature to the house. To simplify the consideration assume the initial water\ntemperatures is TH same as the interior temperature. The house temperature is constant at\nTH. Evaluate the net energy electrical savings under two conditions:\n\n(a)\nThe water quickly flows through the house and there is no heat transfer\nbetween the water and the interior of the house. TD the water drain\ntemperature equals TI with or without the heat pump.\n(b)\nThe water remains in the house for a long time. Heat transfer to the water\nin the house raises it temperature to the interior temperature TH, so that TD\nis equal to TH no matter how much TI changes.\n(c)\nComment on the feasibility of such a system.\n\nHeat\nPump\nW\nQH\nTH\nQW\nWater\nInlet\nT = TH\nTI\nD\nI\nm\nm\n\nTD\nDrain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/a29dfa68f8fd5a82fd464a68b7d5169c_MIT4_42JF10_assn03.pdf",
      "content": "Fall '10\n1.044J, 2.66J, 4.42J\nHomework Set #3\n________________\n______________________________________________________________________\n\n1) Simmons Hall, the newest MIT student dorm on campus should be operated to minimize\nenergy use. One proposed strategy to reduce air conditioning energy in the summer is night\ncooling. At 8 p.m. the windows are opened and cool night air is circulated through the room.\nBy 8 a.m. the room air and the concrete floor slab have a temperature close to that of the\noutside air, 18 degrees Centigrade. The slab is four inches thick. At 8 a.m. the windows are\nclosed and heat transfer to the cooled floor slab helps to maintain a comfortable interior\ntemperature. Neglect any heat transfer through the closed windows. Assume that the average\nrate of electrical and solar energy into the room totals 500 watts over the 12 hours.\n\na)Sketch the room temperature vs. time for the 12 hour period between 8 a.m. and 8\np.m. What is the maximum room temperature? Assume as a limiting case that the slab\nand the air temperature are always equal. In reality, do you expect the slab to be at a\nlower or higher temperature than the air?\nb) Can you suggest an improved strategy for window opening and closing during the\nday?\n\n2) To supplement the night cooling strategy described above, it is proposed to spray liquid\nwater droplets into the air. If the room air at 8 a.m. is completely dry what is the maximum\namount of liquid water that can be evaporated into the room air at 18 degrees Centigrade?\nAssume that the room is closed up and there is no air circulation from the outside into the\nroom.\n\n3) Using both night cooling and the maximum amount of liquid water evaporation in the room,\nestimate the room temperature at 8 p.m. From 8 a.m. to 8 p.m. the windows are closed and the\naverage electrical and solar energy into the room totals 500 watts. To solve, write an energy\nbalance for a system including the floor slab, the water and the air. Take state 1 as liquid\nwater, floor slab and air at 18 degrees Centigrade, the conditions at 8 a.m. Take state 2 as the\nslab and saturated air at 8 p.m.\n\n4) What do you think about the feasibility of the proposed solutions?\n\n5) You are interested in investigating the thermal stratification in your dorm room, which\ndirectly impacts our assumption that the slab and air temperatures are equal. Chose 4\nlocations in your room, 2 of which are in the immediate vicinity of your highest power\nconsuming appliances identified in the first problem set. At each location, use the Vernier\nLabQuest and temperature probe to measure the floor temperature and air temperature at the\nfollowing heights (1 in, 2 ft, 4 ft, 6 ft, 8 ft above floor). Allow enough time at each height for the\ntemperature reading to reach steady state (ie to settle on a value and not change).\n\nHow justified is our assumption about the slab and air temperatures? Is the thermal\nstratification different at each location? If so, please justify any differences.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/245f4c4b53fd2c17954977f2930f8069_MIT4_42JF10_assn04.pdf",
      "content": "Fall'2010\n1.044J, 2.45J, 4.42J\nHomework Set #4\n\nPage 1 of 5\n1.\n\nA room at steady state has a supply air stream of cool air entering at 60oF. The lights, office\nappliances and people transfer heat to the air so that it leaves at 75oF. Consider only sensible heat\ntransfer for this problem, with all temperatures given as dry bulb temperatures. After the air leaves\nthe room some is exhausted from the building. The remainder mixes with ambient air. The mixture\nis cooled by the chiller down to 60oF. For ventilation requirements Mamb must be at least 20\npercent of the total flow rate. The total air flow rate to the room and the entering temperature, state\n1, are held constant. The amount of ambient air can be varied from 20 percent up to 100 % of\nMtotal (with corresponding increases in the exhaust flow to keep the total flow constant). The\ntemperature changes are small so Cp can be considered constant.\n\na) For an arbitrary ambient temperature develop an expression for Qchiller\n\nin terms of Mamb and Mtotal.\n\nb) As the ambient temperature varies between 50oF and 85oF what should Mamb and Mtotal\nbe to minimize Qchiller ?\n\nShow a diagram of the optimum Mamb and Mtotal versus TAMB. At different ambient\ntemperature levels, e.g., 60, 75 oF, the strategy to minimize the chiller cooling requirement\nmay change. This is known as an economizer cycle.\n\nRoom\nState 2\n75 oF\nExhaust\nState 1\n60 oF\nMamb\nTamb\nState 3\nQ chiller\nMtotal\n\nFall'2010\n1.044J, 2.45J, 4.42J\nHomework Set #4\n\nnstantly supplied to the space at 60oF\nerature, what is the required air mass\nw of air continually leaves the space.\ngh an exterior wall is 16,000 BTU/hr.\nPage 2 of 5\n2.\nAn office space is to be kept at 73oF. If cool air is co\nand the space can be assumed to be at a uniform temp\nflow in lb/hr and volume flow in CFM? The same flo\nThe heat transfer into the space from the outside throu\nInternal \"heat gains\" in the office space can be taken as 2.5 W/ft2 for office equipment and\ncomputers and 250 BTU/hr per person. Assume the space ft2 is occupied by 40 people.\nThe heat given due to people assume is only sensible heating, i.e., it neglects any\nevaporation or changes in the moisture level in the air. Assume steady state conditions\nprevail. The floor area of the office is 1500 ft2.\n\n2b.\nIf all the heat gains are doubled what options are available for the cool air supply to keep\nthe office space at 73oF? What other factors must be considered in choosing an option?\n\n3.\nA water to air heat exchanger is used to heat the air of a home interior. The air flow rate is\n2000 lbm/hr; the air enters in steady flow at 70o F and leaves the heat exchanger at 100 oF.\nHeating water enters at 130oF and leaves at 110oF.\n\na)\nIf the heat exchanger is operating in steady state and there is negligible heat loss\nfrom the outside casing of the exchanger to its surroundings what is the required\nwater flow rate?\n\nb)\nDo you think it's possible to design a heat exchanger with a water temperature drop\nfrom 130oF to 110oF while the air outlet temperature is raised to 125oF (for suitable\nair and water flow rates)?\n\nc)\nIs it possible to have an air outlet temperature of 135oF with these same water\ntemperatures?\n\n4.\nAn air conditioning system uses R-12 (Freon-12) as a working fluid. The flow rate of\nrefrigerant is 1,000 lbm/hr and it is steady. The refrigerant is condensed in the condenser to\nsaturated liquid at 120oF. From the condenser, it passes through an expansion valve where\nthe pressure is lowered and the outlet temperature is 20oF. The expansion valve is insulated\nand there is no shaft work. After the expansion valve the Freon enters the evaporator where\nit receives heat at constant pressure corresponding to the saturation pressure of 20oF. The\nheat transferred to the Freon in the evaporation provides the cooling to the air passing over\nthe evaporator.\n\na)\nFind the cooling capacity of the unit in BTU/hr if the outlet of the evaporator is\nsaturated vapor. Find the cooling capacity in tons. Hint: Define a control volume\naround the evaporator and write the steady flow energy equation.\n\nb)\nRepeat part (a) if the outlet of the evaporator is super heated by 15oF; that is, the\nvapor is heated at constant pressure to 15oF above the saturation temperature.\nAssume the Freon-12 vapor is a perfect gas with Cp equal to 0.15 BTU/lbm oF.\n\nFall'2010\n1.044J, 2.45J, 4.42J\nHomework Set #4\n\nPage 3 of 5\n\n5. An open plan office is to be cooled by natural ventilation. The long axis of the building\nis aligned in the East-West direction. The depth in the North-South direction is 30 m\nwith operable windows on both the North and South sides. With open windows and\nnegligible air flow resistance in the interior, when the wind is from the South, the air\nvelocity at the Southern window open area can be approximately related to the wind\nvelocity as, Vopen area = 0.35 Vwind. Assume the North side windows have the same open\narea as the South windows and there is an equal air flow out of the North side windows.\nThe interior height is 3 m and there is a combined heat input due to lights, people and\noffice equipment of 40 W/m2 of floor area.\n\na)\nWhat is the air change rate per hour, ACH, of the building interior as a function of\nthe percent of the South facade used for open window area? The wind velocity is 1.5\nm/s.\n\nb)\nPlot the temperature rise of the interior air as a function of the percent of the South\nfacade used for open windows. The wind velocity is still 1.5 m/s.\n\nc)\nHow can the building be kept cool when the wind velocity is reduced?\n\nd)\nCompare the performance of natural ventilation between the upper and lower floors\nof a high rise building.\n\nFall'2010\n1.044J, 2.45J, 4.42J\nHomework Set #4\n\nPage 4 of 5\n\n6.\nAn air conditioning system uses HFC 134a as a working fluid, the refrigerant. The\nflow rate of refrigerant is 500 kg/hr and it is steady. The refrigerant is condensed in\nthe condenser to saturated liquid at 45 C. From the condenser, it passes through\nan expansion valve, flow resistance, where the pressure is lowered and the outlet\ntemperature is 10 C. The expansion valve is insulated and there is no shaft work.\nAfter the expansion valve the refrigerant enters the evaporator where it receives\nheat at constant pressure corresponding to the saturation pressure of 10 C. The\nheat transferred to the refrigerant in the evaporation provides the cooling to the air\npassing over the evaporator.\n\nWhat is the enthalpy change of the refrigerant as it flows through the expansion\nvalve?\n\nFind the cooling capacity of the unit in W and BTU/hr if the outlet of the evaporator\nis saturated vapor. Hint: Define a control volume around the evaporator and write\nthe steady flow energy equation.\n\nCondensor\nEvaporator\nFlow\nResistance\nCompressor\nT=10C\nT=10 C,\nsaturated vapor\nT= 45 C Saturated\nLiquid\n500 kg/s flow rate\n\nFall'2010\n1.044J, 2.45J, 4.42J\nHomework Set #4\n\nPage 5 of 5\n7. MIT has a large number of fume hoods used for wet chemistry experiments. When the\nhood sashes are open the air velocity, sometimes called the face velocity, must be\nmaintained at a safe level to prevent any dangerous fumes from escaping. The air drawn\ninto the hoods comes from the air supplied to the room. This air must be heated to\nacceptable temperature levels for the lab occupants. For safety reasons, all of the air flow\nin such a building must be exhausted and none can be recycled, a once-through system.\nUse the instruments from class to measure the air flow rate in a new and an older hood as\nthe window is closed.\n\na)\nEstimate for one full sized hood at MIT the energy required to heat the air use\nduring one winter day if the hood is left fully open for 24 hours.\n\nb)\nUse the instruments from class to measure the air flow rate in a new and older\nhood as the sash is closed.\n\nb)\nEstimate the amount of energy required to heat the air for the entire heating\nseason if the hood is always open.\n\nc)\nCompare this to the energy required to heat an average single family house in\nBoston for the heating season.\n\nd)\nWhat steps would you recommend to save energy with the fume hoods at MIT?\n\n8.\nA single story shopping mall has a floor plan 50m X 100 m. All energy is supplied by electricity.\nIt has been designed with some advanced efficiency features so that the yearly energy use is 100 kWh/m2\nof floor area. The architect proposes to use a wind turbine on the top of the building to supply all of the\nelectricity. The wind turbine has a horizontal axis and has an average efficiency of 35 percent.\n\na) Use the average wind speed in Boston (Logan Airport) to estimate what the diameter of a\nsingle\nturbine to meet the buildings energy?\n\nb) What are the practical issues with such a system?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/bca1661ff6579e24acd2d82e2805860b_MIT4_42JF10_assn05.pdf",
      "content": "4.42 F'10\nAssignment #5\nPage 1 of 2\n\nFOR ALL OF THE FOLLOWING PROBLEMS USE THE\nPSYCHOMETRIC CHARTS WHEN YOU CAN TO OBTAIN THE NEEDED DATA.\n\n1. The air leaving an office space is at 78oF dry bulb and 85% relative humidity. The\nleaving air is cooled to 65oF dry bulb and 70% relative humidity and returned to the\noffice space. This is accomplished by first sensible cooling of the air to saturation,\nthen cooling and dehumidification along the saturation line and finally reheating\nwithout vapor addition. Show the process on the psychometric curve. Find the\nenergy requirement for each of the three processes per pound of dry air.\n\n2. The overall change of state described in problem 1 is to be accomplished solely by\nmixing the leaving air with cool air at 55oF. What must the relative humidity of the\ncool air be so that the mixture can reach the 65oF dry bulb and 70% relative\nhumidity state? How many pounds of cool air are needed per pound of leaving air?\n\n3. A building in the Southwest is to be cooled by use of an evaporative cooler. Cool\nliquid water is sprayed into outside air as it is brought into the building. The\noutside air is at 90oF dry bulb temperature and 10% relative humidity. Show the\ncooling process on a psychometric chart assuming the enthalpy of the liquid water\nis negligible in the energy balance. How much water must be evaporated for each\n10oF dry bulb temperature decrease of the air?\n\n3b. Steam, hot water vapor, is mixed with the outside air. Show the process on the\npsychometric chart when the enthalpy of the steam, enthalpy per mass of steam, is\nequal to the enthalpy of the water vapor in the outside air at 90F, 10% RH. What\nhappens when the steam enthalpy is greater than the enthalpy of the water vapor in\nthe outside air?\n\n4. Within the building considered in problem 3 the sensible heat gain is twice the\nlatent heat gain. If the air-conditions within the office space (well mixed\nconditions) is 80oF and 40% relative humidity, construct the condition line for the\nbuilding. The condition line is the line on the psychometric chart representing all\nof the possible states of the supply air which yields the desired well mixed\nconditions within the building. The indoor conditions are maintained by mixing the\nambient air, cooled by evaporation as given in problem 3, with the exhaust from\nthe building. What is the only state of the cooled ambient air which permits the\ninterior conditions to be maintained, i.e. for the specified state of the interior air\nand the given ratio of sensible to latent heat gain?\n\n4.42 F'10\nAssignment #5\nPage 2 of 2\n\n5. A small portable dehumidifier is a single self-contained unit that is placed\ninside a room. It has one air inlet and one air outlet for the entire unit (the\ndehumidifier does not have any direct contact with the air outside the house).\nAir enters at 24 C dry bulb temperature and 80 percent relative humidity. The\nvolume flow rate of air is 245 CFM, 6.9 m3/min. The unit removes 40 pints of\nliquid water per day, approximately 19 kg/day, from the air when operated\nconstantly at steady state. It consumes 400 W of electricity. Assume that there is\nnegligible heat transfer from the cabinet of the unit to the surrounding air. Take\nthe air density as 1.16 kg/m3\n\na) What is the specific humidity in g/kg of the air leaving the unit?\n\nb) What is the dry bulb temperature of the air leaving the unit? Show the state of\nthe inlet and leaving air on the psychometric chart.\n\nAir In\n6.9 m3/min\n24 C, 80% RH\n400 W\nAir Out\nSpecific humidity = ?\nT dry bulb = ?\nPortable\nDehumidifier\nLiquid water\n19 kg/day\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/cf80b2a50d59c052aaccf90c9b6c181b_MIT4_42JF10_assn06.pdf",
      "content": "Fall'10\n1.044J, 2.45J, 4.42J\nHomework Set #6\n\n1. A low density fiberglass insulation has an R value of 11 (BTU/hr ft2 oF)-1 when used in\na standard 2x4 wall cavity. To achieve a higher insulation, a contractor compresses the\nfiberglass so that there are two layers of the insulation in the 2 x 4 wall cavity. He states\nthat the wall has an R value of 22. Do you agree? Explain.\n\n2. A flat roof insulation system uses aluminum screws to hold down flat insulation\npanels. The screws are 1/4 inch diameter, 2 inches long and spaced 4 inches on center in\na square array. The top of the insulation uses a thin aluminum sheet as a weather barrier\nand a reflective layer. Underneath the insulation is a corrugated steel roof. The\ninsulation is two inches thick and has a conductivity of 0.015 BTU/hr ft oF. The screws\npass through the insulation and are anchored in the corrugated roof. The effective U\nvalue of the insulation system plus screws is defined as U=q(total)/A(total)ΔT where\nq(total) is the sum of the heat transfer through the aluminum screws and the insulation.\nAssume that the convective heat transfer coefficient on the inside of the corrugated\nsurface and on the outside over the top of the thin aluminum sheet is 2BTU/hr ft2 oF.\nCalculate the U value for two limiting cases: 1) There is large lateral heat transfer and the\ncorrugated sheet and the thin aluminum are each at a uniform temperature and ; 2) there\nis no lateral heat transfer through the corrugated sheet and the aluminum panel, heat\ntransfer through the screws and the insulation occur in parallel with no interaction\nbetween the heat flows in the respective cross-sections.\n\n3. A window has two vertical panes of glass separated by an one inch air gap. The glass\npanes can be considered black bodies at uniform temperatures of 40oF and 60oF,\nrespectively. Estimate the total heat transfer, convection plus radiation, through the\nwindow space. Note: convection through a vertical space is a very weak function of the\nlayer height, as a first approximation this effect can be neglected.\n\n4. How much does the result of problem 3 change if one glass pane has a low emissivity\ncoating which reduces its emissivity to 0.2. Instead of the low emissivity coating, a third\nlayer of opaque glass is placed midway between the two; how much is the convective\nheat transfer changed, is the radiation also changed?\n\n5. Estimate the total heat loss from a wood frame house in the Boston area for the heating\nseason of one year. Boston averages 5634 degree days for a typical heating year. The\nwalls are 2 x 4 filled with fiberglass and covered with one inch of polyurethane foam\ninsulation sheathing. The windows are double glazed with a low e coating. The attic has\n10 inches of low density fiberglass insulation. Neglect heat loss from the foundation.\nThe house is a single story with 2000 ft2 of floor area. The perimeter is 220 ft. and the\noutside walls are 12 feet high. Fifteen percent of the outside walls are windows. There\nare 0.3 air changes per hour in the house. Neglect additional losses through doorways,\netc. Use values from other homework problems or reference tables to determine U\nvalues.\n\nFall'10\n1.044J, 2.45J, 4.42J\nHomework Set #6\n\n6. A person is seated in a room which has still air. The room surfaces are all black and at\nthe same temperature as the air, 70oF. The person is now seated in front of a large\nwindow which is cold, 50oF. The window and the person can both be considered as a\nblack body. The rest of the room walls are still at 70oF. Estimate how much the room air\ntemperature must be increased for the person to have the same net heat loss from their\nentire body surface as in the original case without the window? In both cases the surface\ntemperature of the person is unchanged. You will need to estimate some values of the\nconvective and radiative heat.\n\n7. Estimate the surface temperatures of all of the components in a typical 2 X 4 frame\nwall as seen in class. Estimate the average heat transfer rate per square foot of wall area.\nTake the inside air temperature as 68oF and the outside air temperature as\n30oF. Be sure to include heat transfer through the wood stud.\n\n8. A forced hot air system has 6 inch diameter ducts installed in an uninsulated attic.\nHeated air at 100F flows through the ducts at 10 ft/s velocity. The ducts are made of\naluminum and the contractor neglects to insulate them. If the attic is at 40F estimate the\nU value from the heated air inside the duct to the cold attic air. If the duct is 10 feet long\nwhat is the rate of heat loss from the duct? Neglect radiation. How much will the air\ntemperature inside the duct change due to this heat loss?\n\n9. Try to determine the thermal resistance of a typical MIT window facing Killian Court.\nOn a cold night use the IR camera to measure the exterior surface temperature of the\nvarious window components. Then using your estimate of the radiation and convection\nheat transfer from the exterior surface make an estimate of the U value of the specific\ncomponent, e.g, glass, frame, etc.\nRepeat this for the exterior surface of the masonry wall.\nWhat is your recommendation to increase the energy efficiency of the entire exterior\nenvelope?\n\n10. The courtyard in the center of the Gardner Museum in Boston is enclosed with a\nglass roof. The glass is supported by a steel frame. The steel, 2 cm thick, extends in a\nsolid piece from the inside to the outside as shown in the figure. The outside surface of\nthe steel is painted black and has a convective heat transfer coefficient of 5 W/m2oK. The\ninside air temperature is 0 oC. Assume the inside surface of the steel is painted with a\nsilver paint that has an emissivity of 0.1. The inside convective heat transfer coefficient\nis 3 W/m2oK. The inside air temperature is 20 oC and the relative humidity is 45 percent.\nAssume the steel surface on the inside radiates to a black body at 20 oC and the steel\nsurface on the outside radiates to a black body at 0 oC.\na) Draw the electric analogy for the heat transfer through the steel frame by using\nthe linear form for radiation heat transfer (ht).\n\nFall'10\n1.044J, 2.45J, 4.42J\nHomework Set #6\n\nb) What is the inside temperature of the steel frame?\nc) Will water condense on the inside surface of the steel frame?\nd) If the inside surface of the steel is painted black, will this cause worse\ncondensation problems?\nOutside air Tout = 0 °C\nBlack surface, h(convection) = 5 W/m2°K\n\nSteel frame\n\n2cm\n\nInside air Tin = 20 °C, RH = 45%\nSilver surface, emissivity = 0.1\nh(convection) = 3 W/m2°K\n\n11. A manufacturer of double glazed windows will put a low emissivity coating on either\nthe inside surface of the interior glass layer, shown in the figure as case 1 or alternatively\nwill put the low emissivity coating on the inside surface of the outermost glass layer,\nshown in the figure as case 2. You are asked to consider means to determine the relative\ntemperature of the inside glass layer surface for both cases. Assume wintertime\nconditions with the interior air temperature at 24 C and the exterior surroundings is a\nblack body at 5 C. In both cases the spacing between the two glass layers is 1⁄2 inch.\na) Sketch the electrical resistance network for the two cases.\nb) Estimate the numerical values of the resistance elements.\nc) Based on the relative value of the resistances can you make a qualitative judgment\nof which case yields a lower temperature for the inside layer of glass?\nd) How would you estimate the inside glass temperature steady state? Give the\nrelevant expressions but do not solve or evaluate numerically.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_assn07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/59adca3453f46845e9e09a15690b7bbd_MIT4_42JF10_assn07.pdf",
      "content": "-------------------------------------------------------------------------------------------------------------------------------\nFALL 10\n1.044J, 2.45J, 4.42J\nHomework #7\nNot required\nTo be discussed\nDo the following problems in Levenspiel,\nUnderstanding Engineering Thermo:\n1) Example 18.4\n2)\n18.8\n3)\n18.9\n4)\n18.12\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_project_sw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/a46af42735e8f0c989a35f036f93d53f_MIT4_42JF10_project_sw.pdf",
      "content": "Fundamentals of Energy in Buildings\nUndergraduate 4.42J, 2.66J, 1.044J\nStudents from courses\n1,2,3,4 and 10\n\nSubject Outline\nFundamentals of\n± Thermodynamics\n± Heat Transfer\n± Fluid Flow\nApplied to the design and operation of energy\nefficient buildings\nIssues of economics, behavior, environment\nCreative design project\nHands on performance measurements\n(with equipment obtained with MITEI support)\n\nExamples of student design projects\n\nDESIGN PROJECT 2\nLIGHTING IN ARCHITECTURE STUDIO 7\n\nFor the purpose of simplicity we selected one particular desk (approxi\nmately) right under the desk, and decided to use that as our lighting test\nzone.\nWe used a Extech HD450 light meter to take readings at the location\nunder different lighting circumstances. The data is shown below:\nAt Night (Fluoroscent Lights only) = 680 Lux\nDuring the Day (Fluoroscent Lights only/skywindows closed) = 850 Lux\nDuring the Day with straight Glare = 11000 Lux\nDuring the Day with straight Glare and White museum Board = 14500 Lux\nMezannine with Lights off : 65 Lux\nMezannine with Lights on : 628 Lux\nImage of Extech HD 540 light meter removed due to copyright restrictions.\n\nskylights\n300mm sunpipes\n\nEstimated yearly savings for one studio\n$1700 per year savings\n\nSingle Pane: Building 3\n\nPlastic Surgery\nfor old buildings\n\nnon-obtrusive to currently inoperable\nwindows\ndiscreet\nscaleable to entire building\nsimple to install and maintain\n\n19.2 GJ saved per heating season\nEquivalent to 20% of season heat for a single\nfamily home in Boston\n\nCurrent Situation\nWindows are efficient\nLiving Room ʹ casement windows\nDining Room ʹ double-hung windows\n\nBefore\nAfter\n\n477 - 479\nCommonwealth\n\nDining Room\nWindows\nStorm Windows\nLeaky due to wood frames\nLarge and Operable\nCurved to fit walls of room\nexpensive to replace\n5 inch gap between inner and\nouter windows\n\nCO2 Leakage through Windows\nThe purpose of our experiment is to evaluate the air leakage\nthrough the windows in a controlled environment, by measuring\nthe rate of CO2 flow out of the otherwise sealed room.\n\nDiagram of co\nmponents of\nwindow f\nrame.\nEstimated Savings\nof Caulking and\nWeather stripping\nEstimated Heat loss due to old/\nleaky windows: 10,348 MJ/window\nBy completely eliminating air leaks\n(ideal case) we can save:\n$2164/year\n\nImage by MIT OpenCourseWare.\n\nExperiment Setting:\nDining Room\n\nRESULTS\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_project.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/af5837aca699baa8e91fb1eaae5b1c18_MIT4_42JF10_project.pdf",
      "content": "4.42J\nDesign Project 1\nDue: November 3, 2010\nIn Class at 11:00 AM\n\nMIT has undertaken a program to improve the energy efficiency of all existing buildings.\nThrough a cooperative agreement with the electrical utility NSTAR, MIT will be rewarded for\neach efficiency improvement that can be documented. You are asked to pick one building or\nwing of an existing building on campus and focus on one or two particular inefficient energy\nfeatures such as exits doors. You are asked to access the current energy use, develop redesigns\nof components or operations that substantially improve energy efficiency and predict the\nenergy savings and economics of these new designs. The new concepts should an outstanding\nsustainable design that is also financially sound.\n\nIn Design Projects 1 and 2 you are asked to select a building and propose and assess\ninnovative building designs, technologies and operating schemes that will yield an outstanding\nsustainable building. For Design Project 1 you should first collect basic information about the\nproposed building features you want to address. Some of this information might be available\nfrom the MIT Facilities Department. In addition, you should develop general conceptual\ndesigns and technologies for the building and site and qualitatively describe their importance.\nIn phase 2 you will quantitatively assess the behavior of the proposed schemes and refine your\ndesigns.\nStudents should work on this project in teams of two and produce a written report. The report\nshould indicate the contribution of each student. Address your report to readers who have\nsome technical background. This report for Design Project 1 should be the preliminary\nassessment of the proposed scheme and additional concepts that you propose. The report\nshould include an introduction, discussion of the above items and diagrams, and conclusions\nand recommendations.\nThe grade for this project is equivalent to one half of an hour quiz.\nYou are required to discuss your preliminary finding with the instructor and TA (unpaid but\nhighly knowledgeable consultants) at least once before the due date.\n\nYour design will be graded in terms of:\nClarity and thoroughness of the report\nOriginality\nPracticality\nPunctuality (Late reports will lose substantial credit)\n\nSome suggestions for design projects\n\nControl of dorm heaters\nRevolving doors vs swing doors vs double doors\nControl of shades, lights in Building E62\nStata Building daylight sensors\nFacade improvements for original MIT buildings\nRelighting potential in academic buildings, dorms\nLiving group energy improvements\nBehavioral measures: design, monitoring, confirmation\nYour suggestions?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/c02b403efc43eb4f90a8be736fdb7acb_MIT4_42JF10_quiz01.pdf",
      "content": "4.42 Quiz 1\nAn inventor proposes a refrigerator that makes ice which is then melted and\nused to cool a cold storage room. The refrigerator is put into a closed insulated\nroom without any air flow into or out of the room. It is turned on when the water is\nliquid at 0C, the initial room temperature. It makes 10kg of ice which is then\nmelted to liquid at 0C without any evaporation of the water.\na) Will the room temperature increase or decrease for the entire process\n(from the time the refrigerator is turned on to the time the ice has melted)?\nb) If the refrigerator has a COP of 3 and it is only used to make the ice, how\nmuch electrical energy does the refrigerator require? Take the internal\nenergy change from ice to liquid water at 0C as 334 kJ/kg. The COP is the\nrate of useful cooling to the rate of electrical energy consumed.\nc) If 0.25 kg of water evaporates after all of the ice has melted, does the\nroom temperature increase or decrease over the entire process?\n\nAn MIT fraternity holds a party in their largest common room, which is 10m long x 10m\nwide x 3m high. The party lasts 4 hours and 300 students attend. Because everyone is\ndancing, each person gives off 300 Btu/hr of sensible heat. The home theatre system\nuses 1000W. Two 100W lights are also on.\nThe room has a 0.1m concrete slab floor. The air in the space and the slab are initially\nat 68 oF. Assume that the specific humidity remains constant for both problems.\na. If the room is perfectly insulated and there is no ventilation system, what is the\ntemperature of the air in the space at the end of the party? Assume that the air and floor\nslab end up at the same temperature and that all electrical equipment is on the whole\ntime. Is this a comfortable temperature?\nb. For their second party, the frat brothers decide to naturally ventilate the space using\ntwo windows, each 1.5m x 2m. The temperature of the air outside is 60 oF and the wind\nvelocity is 2 m/s. Let vin be the velocity of air entering the open windows. Assume that\nvin = 0.35 vwind and that all the rate of air leaving the space is the same as air entering the\nsame. If all other conditions stay the same, what is the temperature of the air in the\nspace at the end of the second party? Again assume that the air and floor slab end up\nat the same temperature and that all air is well-mixed. Is this a comfortable\ntemperature?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_final08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/d74dd793b7b5df53f58a02cc588e89d9_MIT4_42JF10_final08.pdf",
      "content": "4.42 Fall 08 Final\nPage 1 of 4\nMIT Architecture\n\nFall 2008\nL. Glicksman\n4.42 FINAL\nOpen Book\n\n1) (25) A company that makes heat pump components had decided to use their\nknowledge and some of their existing equipment to make small electric power generators\nfor buildings in the developing world.. They want to use their existing refrigerant, HFC\n134a as the working fluid in the power cycle. They plan to burn natural gas as the heat\nsource. Their initial test was disappointing as they only achieved an efficiency of 4\npercent. In this test the natural gas was burned with lots of air so the combustion gas only\nachieved a temperature of 50C. Heat was rejected to the environment; the environment\nwas at 20C\n\na) If we improve the heat exchangers, the boiler and condenser, by significantly\nincreasing their area while keeping the natural gas and environmental temperatures at\n50C and 20C, respectively, what is the limit to the efficiency gain that could be achieved\nwith the power generator?\n\nb) One suggestion is to significantly increase the temperature of the combustion gas\nwhile the environment remains at 20 C. They still want to use HFC134a as the working\nfluid within the power cycle. Reviewing the saturation properties of HC134a are there\nsome practical limits to achieving an efficiency of 20 percent or greater?\n\nc) What is your recommendation for major charges in the overall project concept to\nachieve a practical power generation device with an efficiency above 30 percent?\n\n4.42 Fall 08 Final\nPage 2 of 4\n\n2) (25) The indoor conditions in a room are 21C and 50 %RH. There is still air in the\nroom. When the outside temperature is 0C, the inside glass surface has a temperature of\n16C, measured at the center of the glass surface at night. The glass is a double glazed unit\nwith unknown properties. The inside surface of the glass does not have a low e coating on\nit.\n\na) With these temperature measurements can you estimate the U value neglecting framing\nelements?\n\nb) For another window, the same inside glass temperature, 16C is measured when the sun\nis shining on the window and the room air conditions and the outside temperature are the\nsame as part (a). Is the U value for this window the same as that in part (a)? If not, is the\nU value of this window larger or smaller than the window in part a? Remember, the U\nvalue always refers to the heat transfer through the window without the presence of solar\nradiation.\n\nc) For the same conditions as part (a), condensation just begins to form on the inside of\nthe framing elements. Can you estimate the U value of a framing element based on its\nsurface area?\n\nd) Without replacing this window in parts a and c, suggest ways to improve its thermal\nperformance.\n\npump\nBoiler for HFC\n134a\nTurbine\nCondensor\nHeat from combustion gas\nHeat to environment at 20C\nWork\n\n4.42 Fall 08 Final\nPage 3 of 4\n\n3. (25) We would like to cool a building so that the interior is maintained at 24 oC and\n50% RH. The outside conditions are 35 oC and 50% RH. We know that 60% of the heat\nin the room is sensible and 40% is latent. We will supply 1200 kg/hr of air to the space.\n\nTo achieve the supply air conditions, we will use the following processes:\n\n1. Cool the outdoor air by mixing it with some of the return interior air.\n2. Sensible cooling to saturation temperature.\n3. Dehumidification.\n4. Sensible heating until we reach the desired supply conditions.\n\na. We will supply air at 18 oC. What is the relative humidity of the supply air?\n\nb. During step 1, we will mix 60% return air with 40% outdoor air. What are the\nresulting temperature and humidity of the mixed air?\n\nc. How much water (in kg/hr) will be removed from the air during step 3?\n\nd. During step 4, what is the rate of sensible heat (in kJ/hr) that we will need to put into\nthe air?\n\n4.42 Fall 08 Final\nPage 4 of 4\n4. (25) A cooling tower can be used to remove heat from water. The cooling tower in the\ndiagram below cools water from 40 oC to 25 oC. Air enters the bottom of the tower at 20\noC and 50% relative humidity. Air exits the top of the tower at 32 oC and 95% relative\nhumidity. The mass flow rate of the water which enters the tower is 10,000 kg per\nminute.\n\na. Assuming steady state, write expressions for the energy and mass balance of this\nsystem.\n\nb. What is the mass flow rate of air entering the cooling tower?\n\nc. What is the mass flow rate of water which leaves the cooling tower?\n\nAir at 20 oC,\n50% RH\nAir at 32 oC,\n95% RH\nWater at 25 oC\nWater at 40 oC\nWater\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT4_42JF10_quiz01_2006.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/43f997ac3418613ffe09288b11fc3eb1_MIT4_42JF10_quiz01_2006.pdf",
      "content": "4.42 QUIZ 1\n\nOpen Book\nOctober 27, 2006\n\nFall 2006\n\n1) (50)\nIn the winter an automobile is driven into a well insulated garage with\ninternal dimensions 4m x 5m x3m. The air in the garage is initially at 100C.\nThe car is mostly steel with a mass of 1500 kg and a specific heat of 500\nJ/kg K. The car is initially at 00C except for the engine. The engine\ntemperature is 1000C and consists of 150 kg steel and 20 kg liquid water.\nNeglect heat transfer to the envelope and floor of the garage.\n(a) What is the final temperature of the garage when the car, engine\nand air in the garage reach a single uniform temperature?\n\n(b) If the engine has 10 kg liquid water and 10 kg saturated water\nvapor at 1000C what is the final temperature if all of the water\nvapor has condensed to liquid?\n\n2) (50)\n\nA building uses cross flow natural ventilation to provide cooling. The\nbuilding has two zones or rooms and the air flows at steady state through\nzone 1 and then flows through zone 2 in series. Each zone has the air well\nmixed so that each individual zone is at a uniform temperature. The outside\nair flow rate entering zone 1 is\nand this equals the air flow rate leaving\nzone 2 that is exhausted to the outside. Each zone has a total rate of heat\ninput\nm&\n.\nQ 1 that is the same for each portion of the problem.\nLet ∆T1 =\n/\nc\n.\nQ\nm&\np.\n\n(a)\nIf there is no back mixing between zone 2 and 1 so that the air\nflows in one direction as shown; first through zone 1 and then\nthrough zone 2, what are the temperatures of zone 1 and 2 in\nterms of ∆T1 and TAMB?\nB\n(b)\nNow assume there is a large amount of back mixing between\nzones 1 and 2 so that they are both at the same temperature.\nThe net air flow is still\n. What is the temperature of zones 1\nand 2?\nm&\n(c)\nThere is a limited back mixing from zone 2 to 1 so that there is\na back flow of 0.5m1 from zone 2 to 1 while the net flow from\nzone 1 to 2 is still\n. What is the temperature of zone 2 for this\ncase? Consider a method to find this without first evaluating\nT\nm&\n1.\n(d)\nFor case (c) what is the temperature of zone 1?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT4_42JF10_quiz01_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/07674a07fe1f0dd0ac39041db4774152_MIT4_42JF10_quiz01_sol.pdf",
      "content": "4.42 Quiz 1 Solutions\n2(50)An inventor proposes a refrigerator that makes ice which is then melted and\nused to cool a cold storage room. The refrigerator is put into a closed insulated\nroom without any air flow into or out of the room. It is turned on when the water is\nliquid at 0C, the initial room temperature. It makes 10kg of ice which is then\nmelted to liquid at 0C without any evaporation of the water.\na) Will the room temperature increase or decrease for the entire process\n(from the time the refrigerator is turned on to the time the ice has melted)?\nb) If the refrigerator has a COP of 3 and it is only used to make the ice, how\nmuch electrical energy does the refrigerator require? Take the internal\nenergy change from ice to liquid water at 0C as 334 kJ/kg. The COP is the\nrate of useful cooling to the rate of electrical energy consumed.\nc) If 0.25 kg of water evaporates after all of the ice has melted, does the\nroom temperature increase or decrease over the entire process?\nSolution:\na) For a system composed of the room plus the refrigerator and water/ ice, the net\nchange of the internal energy of the water to ice and back to water is zero. The\nrefrigerator operates in a cycle so there isn't any energy change. There is only a\nflow of electricity into the room, an energy gain, so the room temperature will\nincrease.\nb) COP = Qcool/Welec\nWelec = Qcool / COP = 10x 334 /3 = 1113 kJ which is the net energy flow into\nthe room\nc) In this case the final state of the water has a higher internal energy of 0.25x2375 =\n594 kJ. This is less than the electrical energy so the room temperature still rises.\n\nAn MIT fraternity holds a party in their largest common room, which is 10m long x 10m\nwide x 3m high. The party lasts 4 hours and 300 students attend. Because everyone is\ndancing, each person gives off 300 Btu/hr of sensible heat. The home theatre system\nuses 1000W. Two 100W lights are also on.\nThe room has a 0.1m concrete slab floor. The air in the space and the slab are initially\nat 68 oF. Assume that the specific humidity remains constant for both problems.\na. If the room is perfectly insulated and there is no ventilation system, what is the\ntemperature of the air in the space at the end of the party? Assume that the air and floor\nslab end up at the same temperature and that all electrical equipment is on the whole\ntime. Is this a comfortable temperature?\nb. For their second party, the frat brothers decide to naturally ventilate the space using\ntwo windows, each 1.5m x 2m. The temperature of the air outside is 60 oF and the wind\nvelocity is 2 m/s. Let vin be the velocity of air entering the open windows. Assume that\nvin = 0.35 vwind and that all the rate of air leaving the space is the same as air entering the\nsame. If all other conditions stay the same, what is the temperature of the air in the\nspace at the end of the second party? Again assume that the air and floor slab end up\nat the same temperature and that all air is well-mixed. Is this a comfortable\ntemperature?\nSolution:\na. First find the total amount of heat gain in the room:\nQpeople = 300 people * 300 Btu/hr * 1055 J/Btu * 4 hrs = 3.8 x 108 J\nQequipment = (1000 W + 200 W) * 4 hrs * 3600 s/hr = 1.7 x 107 J\nQtotal = Qpeople + Qequipment = 3.97 x 108 J\nTo find Tfinal, we use the energy conservation equation:\n∆Uair + ∆Uslab = cair mair ∆T + cslab mslab ∆T = Qtotal\nWe have seen from previous problems that in this situation we can assume that ∆Uair will\nbe negligible, so we will only consider ∆Uslab.\nWe know that cslab = 880 J/kg-oK, ρslab = 2100 kg/m3, and Vslab = 100 m2 x 0.1 m = 10 m3\nPlugging these into the energy conservation equation, we find:\ncslab mslab ∆T = Qtotal\n880 J/kg-oK * 2100 kg/m3 * 10 m3 * ∆T = 3.97 x 108 J\n∆T = 21.5 oC\n∆T = Tfinal - 20 oC Æ Tfinal = 41.5 oC or 106.7 oF !!!\nClearly, this is not a comfortable temperature for the party.\n\nb. We know that the total amount of heat gain in the room will be the same as in part a.\nFor this problem, it is easier to use the rate of heat gain in W:\ndQtotal/dt = 3.97 x 108 J / (4hrs * 3600 s/hr) = 27575 W\nWe can also find the rate of internal energy change in the slab:\ndUslab/dt = (880 J/kg-oK*2100 kg/m3*10 m3*∆T) / (4hrs*3600 s/hr) = 1283*∆T W\nNow find the mass flow rate of the air:\n\nρv = 0.35*\nwind *Awindow\nm =\nρ *v\n= 0.35*(1.22 kg/m )*(2 m/s)*(6m ) = 5.12 kg/s\nConsider the energy conservation equation with the addition of moving air into the space:\n\n+ m h - m h\n∆E = Q + Uslab\nin in in out = 0\nSince we know that the rate of air entering the space is equal to that leaving, we can\nsimplify to:\n\n∆E = Q + Uslab + m(h in - h out) = Q + m\nslab * cslab * ∆Tslab + m air * c air * ∆Tair = 0\nQ = m slab * cslab *(Tfinal - T initial ) + m air * c air * (Tfinal - T initial )\nPlugging everything in, we solve:\n27575 W = 1283 W/oK*( Tfinal - 20 oC) + (5.12 kg/s)*(700 J/kg-oK)*( Tfinal - 15.5 oC)\nTfinal = 22.3 oC or 72.1 oF\nThis is clearly a much more comfortable temperature for the party.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT4_42JF10_quiz02_2005.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/4e98830d456319ee90e73375d66c83f5_MIT4_42JF10_quiz02_2005.pdf",
      "content": "4.42J/2.66J/1.044J\nQuiz 2\nNovember 21, 2005\nOpen Book\n1) (50) Estimate the energy performance of MIT's traditional single pane windows per\nsquare meter of surface area. Consider both convection and mid-long range infrared\nradiation from both the inside and outside surfaces of the window. Neglect air leakage,\nthe window frame, and do not include solar radiation for parts a and b.\na) If the inside air temperature is 23 C and the outside is 0 C, estimate the rate of heat\ntransfer through the window from inside to outside, Use typical numerical values for the\nheat transfer components. Assume the glass is a black body for the infrared radiation in\nthe mid-long range wavelengths.\nb) What is the total heat lost through one square meter of window over a typical heating\nseason in Boston? Use the same assumptions used in part a.\nc) Will the result in part b increase or decrease substantially when including each of the\nfollowing: the window frame, air leakage, or solar radiation? Treat each of these\nindividually. You do not need to do detailed calculations for part c.\n\n2) (50) Consider what it takes to keep an indoor pool area at a comfortable temperature\nand humidity during the winter. Assume that there is one pool that is 50 m long and 20\nm wide in a room that is 70 m long, 30 m wide and 10 m high. Assume that the pool\nroom is to be kept at 28 degrees Celsius and 50 percent relative humidity and that the\noutdoor conditions are 0 degrees Celsius and 20 percent relative humidity.\na) (10) Calculate the latent heat load associated with evaporation of water from\nthe pool. Because the pool water is heated and air blows over the surface, some of\nthe water near the surface of the pool evaporates into the air, removing heat from\nthe pool water. Assume that 10 kg of water vapor per every 100 square meters of\npool evaporates every hour. What is the latent heat load associated with\nevaporation from the pool?\nb) (10) Determine the sensible heat fraction. The latent heat and sensible heat\nloads are both important for determining how to condition air to keep the room at 28\ndegrees Celsius and 50 percent relative humidity. Assume that the latent heat load\nyou found in part a) is the only latent load on the room. Assume that you find that\nthere are sensible heat losses from the room that are one third the magnitude of the\nlatent heat gains. What is the sensible heat fraction, SHF = (Sensible heat load) /\n(Total heat load), for the room?\nc) (10) Draw the condition line on the psychrometric chart. The condition line is\nthe line on the psychrometric chart which defines the state of air supplied to the\nroom to maintain desired indoor conditions. In general, the supply air state can be\nanywhere on this line. The slope of this line can be found using the SHF and the\ngauge in the upper left hand corner of the psychrometric chart.\nd) (20) Determine the temperature and relative humidity of the supply air\ndelivered to the room. Draw two lines on the chart representing the process to\nproduce this supply air. Assume that 20% of the air supplied to the room must be\nfresh, outdoor air. Mix the indoor air with outdoor air and sensibly heat it to achieve\nsuitable supply air conditions in the most energy efficient way (a graphical solution is\nsufficient, you need not write equations). Draw the process lines on the\npsychrometric chart. What is the temperature and relative humidity of the supply\nair?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT4_42JF10_quiz02_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/7191bb60b1f7f37013d4e41701e4546d_MIT4_42JF10_quiz02_sol.pdf",
      "content": "a.) Calculate the heat transfer in W/m2 for the wall section shown in the figure below.\nThe wood studs occupy 20% of the surface area of the wall and the insulation occupies\n80%. The temperature of the air outside is 0oC and the temperature of the air inside is\n20oC. Assume that there is no lateral heat transfer. Include convection and radiation heat\ntransfer in your calculation. The outdoors and indoors can be considered black bodies at\n0oC and 20oC respectively.\nkplywood = 0.15 W/m-K\nkinsulation = 0.035 W/m-K\nkgypsum = 0.2 W/m-K\nkwood = 0.15 W/m-K\nToutside = 0 oC\nPlywood\n1 in.\nInsulation\nStud\n3.5 in\nGypsum\n0.5 in\nTinside = 20 oC\nb.) A contractor you know suggests using steel studs instead of wood. He believes that\nbecause you need less steel than wood for structural stability, the increased insulation will\ndecrease the total heat transfer across your wall section. Is he correct? Calculate the heat\ntransfer in W/m2 for a wall section with steel studs. Assume again that there is no lateral\nheat transfer. For this case, the insulation occupies 90% of the wall surface area and the\nsteel occupies 10%. (ksteel = 43 W/m-K)\nc.) Is the interior wall temperature the same over the insulated and stud sections? For\ncase b, approximate the temperature of the interior wall over an insulated section.\nCompare this to the temperature of the interior wall over a steel stud.\n\nSolution:\na.) Approximate hout ~ 20 W/m2-K, hin ~ 5 W/m2-K\nhrout = 4σT3 = 4*5.67e-8*(273 K)3 = 4.6 W/m2-K\nhrin = 4σT3 = 4*5.67e-8*(293 K)3 = 5.7 W/m2-K\nCalculate total resistance for insulated section:\nRins = [1/(hout + hrout)] + (L/k)ply + (L/k)ins + (L/k)gyp + [1/(hin + hrin)]\nRins = [1/(20 + 4.6)] + (0.0254/0.15) + (.09/.035) + (.0127/0.2) + [1/(5 + 5.7)]\nRins = 2.94 m2-K/W\nqins = ∆T/R = 20 K/2.9 m2-K/W = 6.8 W/m2\nCalculate total resistance for wood stud section:\nRwood = [1/(hout + hrout)] + (L/k)ply + (L/k)wood + (L/k)gyp + [1/(hin + hrin)]\nRwood = [1/(20 + 4.6)] + (0.0254/0.15) + (.09/.15) + (.0127/0.2) + [1/(5 + 5.7)]\nRwood = 0.97 m2-K/W\nqwood = ∆T/R = 20 K/0.97 m2-K/W = 20.7 W/m2\nCalculate total heat transfer through wall:\nqtotal = qins + qwood = (0.8*6.8) + (0.2*20.7) = 9.6 W/m2\nb.) The heat transfer through the insulation section is the same.\nCalculate total resistance for steel stud section:\nRsteel = [1/(hout + hrout)] + (L/k)ply + (L/k)wood + (L/k)gyp + [1/(hin + hrin)]\nRsteel = [1/(20 + 4.6)] + (0.0254/0.15) + (.09/43) + (.0127/0.2) + [1/(5 + 5.7)]\nRsteel = 0.36 m2-K/W\nqsteel = ∆T/R = 20 K/0.36 m2-K/W = 54.2 W/m2\nCalculate total heat transfer through wall:\nqtotal = qins + qsteel = (0.9*2.9) + (0.1*54.2) = 11.5 W/m2\nThe contractor was wrong. The steel stud wall allows more heat transfer than the wood\nstud wall, even though there is more insulation in the steel stud section.\nc.) Case 1 - Insulated section:\nqins = ∆T/R = ∆T/[1/(hin + hrin)]\n6.8 W/m2 = ∆T/0.093 Æ ∆T = Tin - Twall = 0.6 oC\nTwall = 20 - 0.6 = 19.4 oC\nCase 2 - Steel stud section:\nqsteel = ∆T/R = ∆T/[1/(hin + hrin)]\n54.2 W/m2 = ∆T/0.093 Æ ∆T = Tin - Twall = 5 oC\nTwall = 20 - 5 = 15 oC\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT4_42JF10_quiz02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/fc6b825a768fd49823122638f5440861_MIT4_42JF10_quiz02.pdf",
      "content": "a.) Calculate the heat transfer in W/m2 for the wall section shown in the figure below.\nThe wood studs occupy 20% of the surface area of the wall and the insulation occupies\n80%. The temperature of the air outside is 0oC and the temperature of the air inside is\n20oC. Assume that there is no lateral heat transfer. Include convection and radiation heat\ntransfer in your calculation. The outdoors and indoors can be considered black bodies at\n0oC and 20oC respectively.\nkplywood = 0.15 W/m-K\nkinsulation = 0.035 W/m-K\nkgypsum = 0.2 W/m-K\nkwood = 0.15 W/m-K\nToutside = 0 oC\nPlywood\n1 in.\nInsulation\nStud\n3.5 in\nGypsum\n0.5 in\nTinside = 20 oC\nb.) A contractor you know suggests using steel studs instead of wood. He believes that\nbecause you need less steel than wood for structural stability, the increased insulation will\ndecrease the total heat transfer across your wall section. Is he correct? Calculate the heat\ntransfer in W/m2 for a wall section with steel studs. Assume again that there is no lateral\nheat transfer. For this case, the insulation occupies 90% of the wall surface area and the\nsteel occupies 10%. (ksteel = 43 W/m-K)\nc.) Is the interior wall temperature the same over the insulated and stud sections? For\ncase b, approximate the temperature of the interior wall over an insulated section.\nCompare this to the temperature of the interior wall over a steel stud.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Air Water Vapor Mixtures: Psychrometrics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/a860d453697831aca223049667c430bb_MIT4_42JF10_water_vapor.pdf",
      "content": "Air Water Vapor Mixtures: Psychrometrics\nLeon R. Glicksman\nc 1996, 2010\nIntroduction\nTo establish proper comfort conditions within a building space, the designer must consider the\nair temperature and the amount of water vapor in the air. The latter is important because too\nhigh a level of water vapor can lead to uncomfortable feeling, sweat does not evaporate fast and\npeople feel too wet and \"clammy\". If the water vapor is too low, people suffer from dryness in\ntheir respiratory systems, skin dries out and is itchy and there can be a build up of static\nelectricity, which can cause uncomfortable shocks to people and also disrupt electrical\nequipment.\nEvaporation of water into the air can serve to lower the air temperature. Cooling towers are\nused in conjunction with air conditioners to produce a higher COP. The condenser of the air\nconditioner is in contact with cooling tower water, which is at a lower temperature than the\noutside ambient air.\nWe will need to define several new terms to deal with air-water vapor mixtures, sometimes\nreferred to as psychrometrics. In addition, mass and energy balances will be established for\nboth the air and the water. A graphical technique will be introduced which aids in visualizing\nthe processes for the air-water vapor mixture.\nMixtures\nWhen air and water vapor exist alone at moderate or low pressures, always the case for our\nconditions, they closely approximate ideal gases. In that case the relationship between pressure,\ntemperature and mass can be expressed as,\npaV = n RT = m Ra T\na\na\n(1)\nfor the air and\npvV = nv RT = m Ra T\nv\nfor the water vapor. In these equations, the subscript a refers to the air and v to the water\nvapor, n is the number of moles, m the mass, T the absolute temperature, in deg Kelvin or\nRankine, R is the universal gas constant and Ra and Rv are the ratios of R to their respective\nmolecular weights. At low pressure, if their and water vapor are mixed together the interaction\nbetween the molecules of the two gases is modest so that the mixture can be considered an\nideal gas,\n(2)\n\npV =( na+nv )RT\n(3)\nwhere p is the total pressure of the mixture. Adding equations 1 and 2 and comparing to\nequation 3 it can be seen that the total pressure in the mixture is just the sum of the pressure of\neach gas existing alone at the same temperature and in the same total volume, Dalton's Law,\np= pa+ pv\n(4)\nWhen the gases are mixed together pa and pv are referred to as the partial pressure of air and\nwater vapor, respectively.\nThe total enthalpy is the sum of the enthalpy of the air and water vapor,\nH = H a+ H = m h +m h\nv\nv\n(5)\nv\na\na\n\nDividing the total enthalpy of the mixture by the mass of the air (note, this is not the total\nmixture mass), we obtain the enthalpy of the mixture per unit mass of dry air which will be\nwritten as h without any subscript,\nH\nm (\n)= m (h)= m h +m h\n(6)\na\na\n\na\na\nv\nv\nma\nAlthough this seems an odd choice just now, it will become evident why this is a convenient\nchoice. Dividing equation 6 by the mass of the air in the mixture,\n§\nmv ·\n1 hv = ha+\nh= ha+\nω\n(7)\nhv\n(c) ma\nNote the new enthalpy of the mixture we just defined, h, is the sum of the specific enthalpy of\nthe air and the product of the specific enthalpy of the water vapor and the ratio of the mass of\nwater vapor to the mass of air in the mixture. The air mass is sometimes called dry air to\nremind the reader that only the air without the water vapor mass is being considered. Note, be\ncareful when you use h since different tables can use different states for the zero values of hv\nand ha which are added together to get h of the mixture.\nHumidity ratio or Specific Humidity\nThe ratio of mass of water vapor to mass of air in a mixture is referred to as the specific\nhumidity or the humidity ratio with the symbol ω (no this is not the humidity the goofy\nweathermen are reporting). The advantage in dealing with the specific humidity is that if the\namount of water vapor in the air remains unchanged, the specific humidity remains constant. The specific\nhumidity is expressed in grams of moisture (water vapor) per kilogram of dry air. Alternatively\nit is given as lbsv /lbsa or grains of water vapor per pound of dry air where 7000 grains is one\n\npound mass.\nThe internal energy of the mixture can also be defined in a similar form as the enthalpy,\n§\nmv ·\n1 uv = ua+\nu = ua+\nω\n(8)\nuv\n(c) ma\nbut since we will be considering open systems in steady state, we won't spend much time on\nthis.\nAlternate definitions of humidity\nSpecific humidity we defined above will be useful in writing energy balances and the like but it\ndoes not give a good feel for the degree of moisture in the air. For that there is the relative\nhumidity, ij. For ideal gases, this is the ratio of the partial pressure of the water vapor in the\nmixture, pv, to the partial pressure of water vapor in a mixture saturated with water vapor at the\nsame temperature, Ts\nφ = pv\n(9)\nps\nThe relationship of pv and ps can be best seen by\nreferring to the saturation curve of water, Figure 1.\nNote: this curve only involves the water which is in\nthe mixture, not the air. The state of the water vapor\nin the mixture is shown by the point v at temperature\nT and partial pressure pv. In general this state will be\nin the superheated vapor region, away from the\nsaturation line. If additional water vapor is added to\nthe mixture while maintaining temperature constant at\nT, the largest amount which the mixture could contain\nis given by point s on the saturation curve between\nliquid water and water vapor. If more water vapor\nbeyond s is added, the additional water vapor would\ncondense out since the excess vapor pressure would\nnot be in equilibrium with liquid water at this\ntemperature.\n\nThe specific humidity and relative humidity can be related by (see for example, McQuiston and\nParker)\nφ = ω\npa\n(10)\n0.622 ps\nNote, o must be expressed as kg water vapor/kg of dry air or lb water vapor/lb dry air in\nequ.10.\nAnother term frequently used is the dew point temperature, Td . Td is found by cooling the\nmixture of air and water vapor, at constant total pressure, until liquid water just begins to\ncondense. The temperature at which condensation first occurs is the dew point temperature.\nIt is also shown on Figure 1. Note that in this case the cooling of the mixture takes place\nwithout adding or subtracting any water vapor from the air, i.e., at a constant specific humidity.\nWhen the relative humidity is high, near 100%, or the dew point temperature is close to the air\ntemperature, the air is close to being saturated with water vapor. When this happens in the\nsummer you had better look for an air-conditioned space.\nExample\nA mixture of water vapor and air at sea level has a specific humidity of 0.013 kg\nwater vapor per kg of dry air.\nThe temperature is 25oC. What is the relative humidity and enthalpy of the mixture?\nSolution\nFrom saturation tables of water find Ps for water corresponding to 25 oC, ps=3.17\nkPa\nhv=2547 kJ/kg for saturated water vapor (If the water vapor is an ideal gas, hv(T) is\nequal to hv sat at the same temperature).\nThe total pressure of air and water vapor is approximately 101 kPa. At this point Pv\nis unknown, but it is generally one to two orders of magnitude less than Pa . As a\nfirst guess take Pa as 101 kPa.\nThe related humidity, from Equ. 10 is,\nφ = ω\nPa = (.013) 101 = 0.666 ≈ 67%\n0.622 Ps\n(.622) 3.17\n\nTo be more precise we can now calculate Pv from ij (ij= Pv/Ps) and correct our\nguess for Pa.\nTo find the mixture enthalpy, we need the water vapor enthalpy, hv, found above and\nha the enthalpy of the dry air. Taking ha as zero at 25oC,\nkJ\nha( 25\noC)= C p(25 -0)= 1.005(25)= 25.13 kg\nh= ha+ω hv = 25.13+(0.013)2547 =\nh= 25.13+33.11= 58.24\nNote that in the mixture the magnitude of the air enthalpy, referenced to air at 0oC,\nand the water vapor enthalpy, referenced to liquid water at 0oC, is about the same.\nTherefore, changes in air temperature of about 10oC and evaporation of water\nincreasing relative humidity by fifty percentage points lead to the same order of\nmagnitude change in the mixture enthalpy. Both effects are important in an energy\nbalance for the air-water vapor mixture.\nMeasurement of the State of Mixture\nThe state of the air-water vapor mixture can be defined by knowing the temperature, the ratio\nof mass of water vapor to air in the mixture and the total pressure in the mixture. In our\nconsideration the total pressure is at or close to (the building may be slightly pressurized) the\nlocal barometric pressure. This does make some difference between say Boston and Denver\nbut generally sea level pressures are used. The temperature (called the dry bulb temperature in\nthis instance) can be found by using a conventional thermometer, thermocouple or thermistor.\nThe latter two are electronic devices whose voltage output is proportional to the temperature.\nThe most tricky measurement is the amount of water vapor in the air. In earlier days, use was\nmade of a wet bulb thermometer whose bulb was kept in contact with a wet wick. Some water\nwould evaporate from the wick, lowering the thermometer reading below the dry bulb\ntemperature. The difference in reading between the wet and dry bulb thermometers can then\nbe used to calculate the humidity of the air. The lower the relative humidity, the more\nevaporation ensues and the lower the wet bulb temperature. In recent times, the humidity is\ndetermined from the capacitance measurement of a thin film whose electrical properties are\nfound to vary with water vapor content. There is also an automated instrument which has a\ncooling and heating element. The temperature of a mirror is adjusted until condensate is first\ndetected; the measured mirror temperature at this condition is the dew point temperature.\n\nGraphical Representation\nThe dry bulb temperature and amount of water vapor in a moist air mixture can be graphically\nshown on a psychrometric chart. Such a chart is very useful to visualize the changes undergone\nby a mixture of air and water vapor as the air is conditioned. The chart is also useful in\ndetermining the amount of energy required for a specific conditioning of the air. It is strongly\nsuggested that you become familiar with the chart.\nFigure 2 shows the psychrometric chart for sea level in SI units. Similar charts are available for\nselected altitudes and in English units. The right hand vertical scale gives the humidity ratio or\nspecific humidity of the mixture. Note that in most situations encountered in buildings practice\nthe mass of water vapor is much less than the mass of air in the mixture. Typical values of A\nare 0 to 20 grams of water vapor per kilogram of air. Thus, the mass of water vapor is only at\nmost one to two percent of the mass of air.\nThe horizontal axis is the dry bulb temperature. There are parallel slanted straight lines starting\nfrom the upper left which are lines of constant mixture enthalpy per mass of dry air defined by\nequ. 7. To keep the enthalpy lines straight and parallel, it turns out that lines of constant dry\nbulb temperature deviate somewhat from vertical.\nThe chart also shows other information. Curves of constant relative humidity, ij, are shown as\nare lines of constant wet bulb temperature. Thus, if the dry bulb temperature and relative\nhumidity are known, the state of the mixture can be located on the chart and the corresponding\nvalue of the mixture enthalpy and humidity ratio read from the chart.\nThe left hand border represents saturation conditions of the mixture, 100% relative humidity.\n\n-20\n-10\n11.7\n\n:\nENTHALPY - KJ PER KILOGRAM OF DRY AIR\nBAROMETRIC PRESSURE: 101.325 kPa\nPSYCHROMETRIC\nCHART\nNormal Temperature\nSI Units\nSEA LEVEL\n-25\n-20\n-15\n-10\n-5\nDRY BULB TEMPERATURE - °C\n-20\n-10\nENTHALPY - KJ PER KILOGRAM OF DRY AIR\nSATURATION TEMPERATURE - °C\n1.0\n2.0\n3.0\n4.0\n5.0\n6.0\n7.0\n8.0\n9.0\n10.0\n11.0\n12.0\n13.0\n14.0\n15.0\n16.0\n17.0\n18.0\n19.0\n20.0\n21.0\n22.0\n23.0\n24.0\n25.0\n26.0\n27.0\n28.0\n29.0\n30.0\n31.0\n32.0\n33.0\n34.0\nVAPOR PRESSURE - MM OF MERCURY\n-10\n-5\nDEW POINT TEMPERATURE - °C\nChart by: HANDS DOWN SOFTWARE, www.handsdownsoftware.com\nBAROMETRIC PRESSURE: 101.325 kPa\n1.00\n0.95\n0.90\n0.85\n0.80\n0.75\n0.70\n0.65\n0.60\n0.55\n0.50\n0.45\n0.40\n0.35\n0.30\n0.25\n0.20\nSENSIBLE HEAT RATIO = Qs / Qt\nSENSIBLE HEAT RATIO = Qs / Qt\n15%\n25%\n2%\n4%\n6%\n8% RELATIVE HUMIDITY\n10% RELATIVE HUMIDITY\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n-20\n-15\n-15\n-10\n-10\n-5\n-5\n30 WET BULB TEMPERATURE - °C\n0.74\n0.76\n0.78\n0.80\n0.82\n0.84\n0.86 VOLUME - CUBIC METER PER KG DRY AIR\n0.88\n0.90\n0.92\n0.94\nHUMIDITY RATIO - GRAMS MOISTURE PER KILOGRAM DRY AIR\n1.0\n1.0\n:-\n2.0\n\n4.0\n\n8.0\n\n-8.0\n-4.0\n-2.0\n-1.0\n-0.5\n-0.4\n-0.3\n-0.2\n-0.1\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n\n0.8\n\n-4.6\n\n-2.3\n\n0.0\n1.2\n2.3\n3.5\n4.7\n7.0\n\n-:\nSENSIBLE HEAT\nQs\nTOTAL HEAT\nQt\nENTHALPY\nHUMIDITY RATIO\nD h\nD W\nPSYCHROMETRIC\nCHART\nNormal Temperature\nSI Units\nSEA LEVEL\nChart by: HANDS DOWN SOFTWARE, www.handsdownsoftware.com\nASHRAE Psychrometric Chart No. 1.\nThis image was created by Bob Hanna, can be found on Wikipedia,\nand is in the public domain.\n\nComfort Conditions\nThe psychrometric chart can also be used to show typical comfort conditions for indoor\nenvironments. Shown on Figure 3 are comfort conditions for individuals doing light duties such\nreading while seated wearing typical summer or winter clothing. These are obtained by\nsubjecting\nvolunteers\nto\ndifferent\ntemperature and humidity conditions and\nStandard effective temperature and ASHRAE comfort zones\ntabulating their vote on their sensation of\nHeat\ntransfer coefficient as a\nfun\ncti\non\nof\nair\nspace th\nickn\ness.\ncomfort. There are factors other than dry\nbulb temperature and humidity which are\nimportant to comfort: such as air velocity,\nradiant energy, and temperature gradient.\nFor our purposes at this time we will take\nthe operative temperature in Figure 3 as\nthe dry bulb temperature.\nIf the\noccupants are doing more intensive\nactivities, such as working out in a gym,\nthe conditions for comfort will change\nDew point temperature, oC\nHumidity ratio, g/kg\nand a new chart analogous to Figure 3 can\n-5\n-10\nbe produced.\nOperative temperature, oC\nFigure by MIT OpenCourseWare.\nConditioning Processes\nThe purpose of heating, cooling and ventilation systems within buildings is to provide proper\nventilation and comfort conditions for all of the occupants of a building. Ventilation is\nconcerned with supplying enough fresh air to keep the concentration of pollutants such as CO2\nin the building within a safe level. In terms of the comfort conditions shown on Figure 3, the\naim is to maintain the temperature and humidity conditions throughout the building within the\ncomfort bands shown. This requires heating or cooling the air and in some instances changing\nthe amount of water vapor in the air. There are a number of techniques which can be used to\naccomplish this. We will start with the most straightforward ones.\nHeating\nWhen the air dry bulb temperature is below the comfort zone, such as state 1 in Figure 4a, the\ntemperature can be raised by forcing the air over a heat exchanger surface. On the other side of\nthe surface, e.g. tubes, is a fluid at a higher temperature. The heat transfer from the hot fluid\nincreases the energy of the air. Taking a control volume around the heat exchanger as shown in\nFigure. 4b, and assuming steady state operation we can write first a mass balance for the air,\nm 1= m 2\n(11)\n\nIn this process, we will write the mass flow rate of dry air without the subscript a. There isn't\nany water vapor added to the air so the mass balance for the water becomes,\nm w= m 1ω1= m 2 ω 2\n(12)\nCombining this with eqn. 11,\nω1 = ω 2\n(13)\nThus, the humidity ratio remains constant during the heating. We can also write an energy\nbalance for the control volume,\nQ = m 2 ha 2 + m v 2 hv 2 - (m 1ha1 + m v1 hv 2 )\n(14)\nwhich can be rewritten as,\nQ = m 2( ha 2 +ω 2 hv 2 ) - m1( ha1 +ω1hv1 )\n(15)\nUsing the enthalpy of the mixture per unit mass of the dry air, eqn 15 becomes,\nQ = m 2 h2 - m 1h1\n(16)\nNow you can see the utility of the way h was defined for the mixture.\nAll of the enthalpy change for both the air and the water vapor is associated with temperature\nincrease and each could be given as cp aT. The heat transfer in this process is referred to as\nsensible heat.\nThe heating process is represented on the psychrometric diagram as a horizontal line from 1 to\n\n2 since A remains constant. Note that the relative humidity decreases in this process as the dry\nbulb temperature increases.\nTo reduce the dry bulb temperature of a mixture of air and water the mixture is passed over\nheat exchanger tube containing cold fluid inside. The cooling process without any addition or\nsubtraction of water vapor is shown on Figure 5a. The equations for the mass and energy\nbalance are exactly the same as the heating case.\nDehumidification\nIf the air has too high a moisture content and A must be reduced, the process gets a little\ntrickier. The heat exchanger tube must be at a temperature below the dew point for the air\nwater vapor mixture. When that occurs, some of the water vapor will condense as liquid on the\ntubes. The liquid water drains off the tubes by gravity and is collected below and disposed of.\nIn the idealized case, the process is shown as 2-3-4 on Figure 5a. First the mixture is cooled to\nstate 3 on the saturation curve without loss of water vapor. As it is cooled further, it moves\ndown the saturation curve to state 4 which has a lower humidity ratio and a lower dry bulb\ntemperature.\nIn the real process shown on Figure 5c, the condensation begins before the saturation curve is\nreached since the tube wall temperature is normally lower than the dew point temperature.\nFor this process conservation of air mass yields,\nm = m\n(17)\nwhile conservation of water must balance the water vapor carried into the exchanger with the\nsum of the water vapor and liquid water leaving at steady state,\nm v 2 = m 2 ω 2 = m v 4 + m l4 = m 4 ω 4+ m l\n(18)\nThe energy balance between states 2 and 4 must also include the stream of liquid leaving,\n\nQ\n2-4 = m 4 ha 4 +m v 4 hv 4 + m l hl -( m 2 ha 2 +m v 2 hv1 )\n(19)\nSince the enthalpy of the air and water leaving the exchanger is lower than that entering, Q2-4 is\nnegative, the mixture is cooled. The energy balance can be rearranged by use of the enthalpy of\nthe air-water vapor mixture again,\nQ2-4 = m 4( h4 )+ m l hl - m 2 h2 = m 2( h4 - h2 )+ m l hl\n(20)\nNote that in this case the rate of cooling, Q , involves the change of mixture enthalpy as well as\nthe enthalpy of the leaving water stream. In general the magnitude of the latter term is small\nand it can be neglected.\n\n( Q3-4 )sensible = m ( h4 - h5 )= m Δ hsensible\n(21)\nIn theory the process from state 2-3-4 could be\nreplaced first by a reduction in water vapor at\nconstant dry bulb temperature, process 2-5,\nFigure 6, followed by a reduction in dry bulb\ntemperature at constant water vapor content,\nprocess 5-4. The latter process is one of pure\nsensible heat,\nWhile the process 2-5 has no sensible heat since\naT remains constant. In process 2-5 all the\nheat is associated with the phase change of\nwater from vapor to liquid and this heat is called\nthe latent heat,\n\n( Q3-4 )latent = m (ω2 -ω4 )hlg = m Δ hlatent\n(22)\nFor the actual process 2-3-4, ahlatent / ahsensible, given in eqns 22 and 21, is the ratio of latent to\nsensible heat for the process.\n\nWe have gone to all the work of dehumidifying the air in the\nprocess 2-3-4 above. After all this, when we compare state 4\nto the comfort conditions shown in Figure 3 we usually find\nthat the dry bulb temperature is too low for comfort. To\nachieve comfort conditions, we must reheat the mixture\nfrom state 4 to a higher dry bulb temperature as shown in\nFigure 7. Notice after expending energy to run a chiller or\nair conditioner to provide cooling to dehumidify the air from\nstate 2 to 4 now we must supply more energy to reheat the\nair.\n\nExample\nFor the cooling, dehumidification and reheat process shown on the following figure,\nuse the psychrometric chart to show how an additional heat exchanger can be used to\nreduce both the cooling energy and reheat energy (no, this is not violating some sacred\nlaw, it's just a use of smarts to save energy albeit with the need for an additional heat\nexchanger).\nDi\nag\nra\nm\nof\ncooling\n, deh\numidification and reheat process with cooling coil and heat exchanger.\nSolution:\nFigure by MIT OpenCourseWare.\nLooking at the process on the psych chart, notice that temperature T4 is lower than T2.\nIf we put a heat exchanger in system, we can transfer heat from the hotter mixture at T2\nto the colder mixture at T4. This reduces the amount of cooling we must supply as well\nas the amount of heat for the reheat process.\n\nThe Condition Line\nNow that we've found out how to produce air at any given dry bulb temperature and humidity\nratio that we like, let's put it to work maintaining a comfortable interior space. We must\nconsider the amount of sensible and latent energy given off by occupants and equipment in a\nbuilding space.\nConsider the space shown in Figure 8a. In most systems air is\nbrought in through a diffuser at a high enough velocity to set up a\nwell mixed condition. Everywhere in the space, the dry bulb and\nhumidity of the air is the same. The heat and moisture transfer\nfrom the occupants and equipment to the air can be represented\nas heat and moisture transfer to a control volume covering all of\nthe air in the space. Table 1 below gives some typical values of\nsensible and latent heat from people. If the inlet dry air flow rate\nis m and the inlet mixture enthalpy and humidity ratio are respectively h1 and A1 , respectively,\nthen the increase of the mixture enthalpy is given as,\n\nm ( h2 - h1 )= QT\n(23)\n\nwhere QT represents the total, latent plus sensible, energy transfer rate to the air. Similarly the\nincrease in the water vapor can be determined by,\n( m v 2 - m v1 )h fg = m (ω 2 -ω1 )h fg = Q\nL\n(24)\n\nwhere QL represents the latent energy transfer associated with the evaporation of water added\nto the air.\nTaking the ratio of equation 24 to 23,\nω 2 -ω1 = Q\nL\n(25)\nh2 - h1\nQ\nT\nWe can see that the airflow rate into the room falls out and\nthe ratio of aA/ah is determined by the ratio of latent to total\nenergy input. That is, the state of the well mixed air in the\nroom, state 2, must be on the line, called the condition line,\nwith slope aA/ah which passes through the inlet state 1 as\nshown on Figure 8b.\n\nIf we want to make sure the room falls within the comfort\nconditions, then state 1 must be located so that the line 1-2\npasses through the range of comfort on the psychrometric\ndiagram. For example, Figure 8c shows a typical condition\nline and summer comfort zone. With the original state of\ninlet air to the space, labeled 1, the condition line does not\npass through the comfort zone no matter what airflow rate is\nused. The inlet air must be altered to state 1' to achieve\ncomfortable conditions.\nTable 1\nRates of Heat Gain from Occupants in Conditioned Spaces\n\nSensible (W)\n\nLatent (W)\nSeated, light work (e.g. MIT student)\nModerate dancing (BU student)\nAthletics (Harvard student)\nTaken from ASHRAE Handbook of Fundamentals, p 26.8, 1993\nIn a building having a common supply of conditioned air and rooms housing different\nactivities with different ratios aA/ah, achieving comfortable conditions in all rooms may be\ndifficult.\nAdiabatic Mixing\nTo conserve fan energy and duct size in some buildings, the\ntemperature of the cold air in the supply system of a building\ncan be lowered (but at the cost of a decreased COP for the\nchiller). To prevent cold drafts on occupants near the diffuser\noutlet we can use a mixing box which mixes warmer room air\nwith the cold supply air, see Figure 9. The question is: how to\ndetermine the dry bulb temperature and humidity of the\nmixture leaving the box? In most cases the box is small enough\nso that heat transfer from the external surface of the box is negligible. We can write a mass\nbalance for the air entering and leaving the box at steady state,\n\nm 3 = m 1+m 2\n(26a)\nand a mass balance for the water vapor,\nω 3m 3= m 1ω1+m 2 ω 2\n(26b)\nwhich can be rewritten as,\nω 3= m 1 ω1+ m 2 ω 2\n(26c)\nm 3\nm 3\nSimilarly an energy balance using the mixture enthalpies becomes,\nm 3h3= m 1h1+ m 2 h2\n(27a)\nwhich can be written as,\nh3= m 1 h1+ m 2 h2\n(27b)\nm 3\nm 3\nWhen the supply air flow m 1 is equal to the room air to the\nbox, m 2 , it is easy to see that the enthalpy of the mixture at\nstate 3 is the average of h1 and h2 , while A3 is the average of\nA1 and A2. State 3 shown of the figure is half way along a\nstraight line between 1 and 2. For any other mixture\nproportions it can be shown that state 3 is always on the\nstraight line between 1 and 2 with its location set by the\nproportion of cold air to recycled air in the mixing box.\nAdiabatic Water Addition to Air Stream\n\nIn some instances, the air entering a building has too small an amount of water vapor. Water or\nsteam sprays are used to add moisture. In earlier times, people would put out pans of liquid\nwater. Water vapor evaporating from the surface would mix with the air passing over.\nSometimes this technique can be used in hot dry climates to supplement or replace the\nconventional air conditioning system.\nWe will assume that the spray mixes with the air stream in a small mixing box which is\nadiabatic, with no heat transfer from the outside surface of the box. See Fig. 10a. Just as before\nwe can write conservation of mass for the steady state process,\nm a1 = m a 2 = m 1\n(28)\nm w = ω 2 m a 2 -ω1m a1 = (ω 2 -ω1)m 1\n(29)\nand the energy balance becomes,\nm 1h1+m whw= m 2 h2\n(30)\nNote this holds whether the spray is liquid water or steam. Dividing both sides of eqn. 30 by\nma1, we can find an expression for h2,\nh2 = (ω 2 -ω1 )hw + h1\n(31)\nWhen the spray is a cold liquid, the enthalpy of the liquid stream\nis small compared to that of the air mixture and as a good first\napproximation, the enthalpy of the air mixture leaving the\nmixing box is equal to the enthalpy of the mixture entering. On\nthe psychrometric chart the process line 1 to 2 moves at\nconstant h from a low humidity ratio and high dry bulb\ntemperature to a final state at higher humidity and lower dry\nbulb temperature. The energy necessary to evaporate the liquid\nwater comes from the air, causing a lower temperature. In a way\nthis could be termed free cooling, but the price is water\nconsumption.\nWhen hot liquid or steam with progressively higher enthalpy is sprayed into the air, eqn. 31\nindicates that the enthalpy of the air leaving the mixing box will increase. Figure 10b illustrates\nthis. When the enthalpy of the steam in the spray is the same as the enthalpy of the water vapor\nin the mixture entering, the leaving mixture is at the same temperature as the entering mixture.\n\nAdiabatic Saturation Temperature\nIf the water spray in Figure 10a is sufficiently large, the mixture leaving at state 2 is saturated.\nThe temperature, T2, of the mixture leaving the mixing box is called the adiabatic saturation\ntemperature. This provides another means of measuring the unknown moisture content of a\nmixture at, say, state 1. Rather then using a spray, the air at state 1 is passed over a long liquid\nwater surface. If the surface area is large enough, the leaving stream, at state 2 is saturated. By\nmeasuring the dry bulb temperature of states 1 and 2 and knowing state 2 is saturated with\nwater vapor, an energy balance or the psychrometric chart will allow us to find the humidity\nratio of state 1. Thus, a mixture of air and water vapor with a given dry bulb temperature and\nhumidity ratio has a unique value of adiabatic saturation temperature.\nWhen a closed amount of liquid is used in the adiabatic saturation apparatus, the liquid\ntemperature, Tw, approaches the outlet temperature T2 so hw in equ. 30 can be accurately\ndetermined.\nSince the liquid enthalpy is a small component of equation 31, lines of constant enthalpy are\napproximately parallel to lines of constant adiabatic saturation temperature.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT4_42JF10_heat.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-42j-fundamentals-of-energy-in-buildings-fall-2010/932ba308aee67d0164ea8b59cec1c4be_MIT4_42JF10_heat.pdf",
      "content": "Heat Transfer\n\nLeon R. Glicksman\n\n(c) 1991, 1997, 2004, 2005, 2010\n\n1)Introduction\n\nHeat transfer deals with the rate of heat transfer between\ndifferent bodies. While thermodynamics deals with the magnitude of\nheat exchanged in a process, heat transfer is necessary to determine\nthe time required for a process or alternatively the size of a surface\nnecessary to achieve a certain total rate of heat transfer.\n\nHeat transfer analysis permits a calculation of the heat loss\nfrom a building surface to the surroundings for a given building size,\nwindow area and wall design, e.g. the level of insulation in the wall\ncavity. The comfort conditions for occupants in a room is determined\nby a balance of heat transfer from the person to the air surrounding\nhim or her as well as the heat transfer to the walls of the interior.\nThe size and cost of a heat exchanger is also determined by\nconsidering the heat transfer between the fluid streams in the\nexchanger.\n\nIn other fields, heat transfer plays a key role as well. The\ndesign of integrated microprocessors which contain very closely spaced\nelements, each with a finite amount of heat generation, is limited by\nthe requirement for adequate cooling so that the operating temperature\nof the electronic components is not exceeded. Reentry of the space\nshuttle in the earth's atmosphere must be carefully programmed so that\ntemperature extremes due to air friction are confined to the\ninsulating tiles on the shuttle's surface.\n\nModes of Heat Transfer\n\nFollowing thermodynamics, heat transfer is that energy transfer\nwhich takes place between two bodies by virtue of a temperature\ndifference between the bodies. From the second law considerations it\ncan be demonstrated that there is always a net positive energy\ntransfer from the body at a high temperature to a second body at a\nlower temperature. Following the definition of heat, there are only\ntwo physical mechanisms for heat transfer: (1) electromagnetic waves\nproduced by virtue of the temperature of a body, referred to as\nthermal radiation heat transfer and (2) atomic or molecular motion in\na medium between the bodies exchanging energy, referred to as\nconduction heat transfer.\n\nSometimes conduction heat transfer takes place during the\nchange of phase and is referred to as boiling or condensation\nheat transfer. Conduction heat transfer can also take place in\nthe presence of fluid motion, which is called convection heat\ntransfer.\n\nThe rate of heat transfer between two bodies is\nproportional to the temperature difference between the bodies\nand in some cases the temperature level of the bodies as well.\nIn many instances the heat transfer process is analogous to the\nrate of transfer which appears in other fields. The analogy\nbetween heat transfer and DC electrical current flow will be\nused to illustrate some of the simpler heat transfer processes.\nSimilarly, it can be shown that the rate of transfer of mass in\nan evaporation process follows a process very similar to that\nfor heat transfer.\n\n2)Conduction Heat Transfer\n\nIn a homogenous body which experiences a temperature\ngradient the rate of heat transfer due to microscopic motions is\nconduction heat transfer. In a gas the gas molecules in the\nhigher temperature portion of the gas will have a higher kinetic\nenergy. As the molecules of the gas randomly move through the\ngas volume there is a net energy transfer\nfrom the high temperature portion to the\nlow temperature zones. In a solid, the\nenergy transfer from high to low\ntemperature may be due to the migration of\nelectrons or the vibration of the\nmolecular bonds.\n\nViewed as a macroscopic phenomena,\nthe rate of heat transfer by conduction\nrepresented by the symbol q or Q is found\nto be directly proportional to the product\nof the local temperature gradient and the\ncross-sectional area available for heat transfer,\n\n~\nq\nA gradT\n\n(2.1)\n\nFig 2.1 One dimensional\nconduction\n\nIn the case of one-dimensional heat transfer normal to a plane\nslab, figure 1, the conduction heat transfer can be given by\nFourier's Equation,\n\ndT\nq\nkA dx\n\n(2.2)\n\nThe constant k is known as the thermal conductivity. q has\nthe dimensions of BTU/hr or Watts and k has the dimensions of\nBTU/hrftF or W/mK.\n\nThe thermal conductivity defined by equation 2.2 is a\nthermophysical property of the material. If the composition and\nthermodynamic state is known then the thermal conductivity can\nbe found.\n\nTable 2.1 lists the thermal conductivity of common solids,\nliquids and gases at normal temperatures. Note that these\nvalues span many orders of magnitude with electrically\nconductors having the highest thermal conductivity and high\nmolecular weight gases generally having the lowest thermal\nconductivity.\n\nConsider a slab with a steady\nconduction heat transfer across it in the x\ndirection, fig. 2, with the temperature\nequal to T1 and T2 at the surfaces\ncorresponding to x equal to 0 and L,\nrespectively. Then q is a constant and\nequation 2 can be integrated to give,\n\nT\nT\nq\nkA\nL\n\n(2.3)\n\nFor this case the temperature varies linearly across the width\nof the slab. One can consider an analogy between the solution\nfor steady conduction and for steady D.C. electric current flow,\nOhm's Law,\nFig. 2,2 Conduction Through\na Plane Wall\n\nV\nV\nI\nR\n\n(2.4)\n\nTable 2.1\n\nThermal Conductivity of\n\nCommon Materials\n\nk(BTU/hr ft F)\n(W/mK)\n\nSolids\n\nCopper\n\nAluminum\n\nSteel\n\nBrick,common\n\n0.2 - 0.1\n0.17 - 0.34\n\nConcrete\n\n0.5 - 0.8\n0.87 - 1.38\n\nGlass\n\n0.5\n\n0.87\n\nGlass fiber insulation\n\n.03\n\n0.05\n\nIce\n\n1.3\n\n2.2\n\nPlastic\n\n0.1\n\n0.17\n\nWood\n\n0.1 - 0.2\n0.17 - 0.34\n\nLiquids\n\nAmmonia\n\n0.3\n\n0.5\n\nRefrigerant-12\n\n0.04\n\n0.07\n\nLight Oil\n\n0.08\n\n0.14\n\nWater\n\n0.34\n\n0.59\n\nMercury\n\n8.7\n\nGases\n\nAir,dry\n\n0.015\n\n0.026\n\nCarbon Dioxide\n\n0.009\n\n0.016\n\nHelium\n\n0.09\n\n0.16\n\nHydrogen\n\n0.11\n\n0.19\n\nWater Vapor (Steam)\n\n0.015(at 212F)0.026 (at 100\nC)\n\nRefrigerant-11\n\n0.005\n\n0.009\n\n1.0 (BTU/hr ft F)= 1.73 (W/m C)\n________________________________________________________________\n\nThe rate of heat transfer q is analogous to the current flow I,\nthe potential difference V is analogous to T and the balance of\nequation 2.3 is analogous to the resistance. The term thermal\nresistance is used; for eqn. 2.3 the thermal resistance is L/kA.\n\nConsider the case of steady heat transfer through a composite\nwall as shown in figure 2.3. Each element of the wall has the\nsame heat transfer rate q through it and for each an equation\nsimilar to equation 2.3 can be written. At steady state with no\nchange in internal energy with time, no work, and no mass flows\nthrough each of the elements, the rate of heat transfer into and\nout of each wall element must be the same. For the wall board,\n\nWB\nWB\nk\nA\nq\nT\nT\nL\n\n(2.5)\nThis can be rewritten as,\n\nWB\nWB\nL\nT\nT\nq k\nA\n\n(2.6)\nFor the insulation\n\nFig. 2.3 Steady State Heat Transfer Through a Composite Wall\n\nI\nI\nL\nT\nT\nq k A\n\n(2.7)\n\nSimilar equations can be written for the plywood, T3 - T4 and\nand the siding, T4 - T5. When these equations are summed up the\nintermediate temperatures T2, T3 and T4 cancel and the resulting\nequation becomes\n\nWB\nS\nI\nP\nWB\nI\nP\nS\nL\nL\nL\nL\nT\nT\nq k\nA\nk A\nk A\nk A\n\n(2.8)\nor\n\nT\nT\nq\nL\nkA\n\n(2.9)\n\nThe electrical analogy for this case is resisters in series as\nshown in figure 2.4.\n\nThen the overall\nsolution can be\neasily written as,\n\n(2.10)\nT\nq\nR\n\nwhich is identical to equation 2.9.\n\nFig. 2.4 Electric Analogy to Steady State Heat Transfer\n\nsame so that equation 9 can be rewritten as\n\n(2.11)\nWB\nS\nI\nP\nWB\nI\nP\nS\nT\nT\nA\nq\nL\nL\nL\nL\nk\nk\nk\nk\n\nR-value of that material. Note the R-value is independent of the\nsurface area A while the thermal resistance RT includes the surface\narea. For the plywood, a typical R-value for a one inch thickness is\n\n1/12\n0.8\n(2.12)\n0.1\nP\nhr ft F\nL\nk\nBTU\n\nNote in US building practice units and dimensions are still in the\nimperial system.\nresidential wall constructed with 2 by 4 studs,\n3.5/12\n2.13)\n0.028\nI\nhr ft F\nL\nk\nBTU\n\nFor the composite wall in figure 2.3, the R-value of the insulation\ndominates all of the terms in equation 2.11\n\nConvection Heat Transfer, Introduction\n\ntemperature on the inside wall\nsurface, T1, and the outside\nsiding surface T5 are not\ngenerally known. Rather the\ninterior room air temperature,\nTi, and the exterior air\ntemperature, Te, are the known\nquantities. Consider a\nwintertime condition, when the\nbuilding is at a higher\ntemperature then the exterior\nair. The temperature through the\nbuilt-up wall continuously de-\ncreases from the inside wall at\nT1 to the outside surface at T5.\nThis is shown in figure 5. The\noutside surface temperature T5 is higher than the exterior air\ntemperature Te. In the air layer close to the building surface\nthe air is in motion parallel to the surface. There is heat\ntransfer by conduction from the building surface through this\nair layer. Because there is also energy transfer by the motion\nof the fluid the temperature through the air layer does not vary\nlinearly. Rather, there is a large temperature gradient near\nthe surface which decreases further from the surface until the\ntemperature reaches the constant air temperature Te. The layer\nover which the temperature change occurs is thin, typically one\nquarter of an inch or less.\n\nenergy transfer by fluid motion is called convection heat\ntransfer. The rate of heat transfer is proportional to the\nsurface area and the temperature difference between the surface\nand the uniform air temperature outside of the thin surface or\nboundary layer,\n\n~\n(\n)\n(2.14)\ne\nq\nA T\nT\n\nThe expression is changed to an equality and in the process a\nnew quantity, h, the heat transfer coefficient is defined,\n\nFig. 2.5 Temperature Distribution with Convection\nat the Surfaces\n\n(2.15)\nsurface\nfluid far from surface\nq\nhA T\nT\n\nwhere h has the units of BTU/hr ft2 F or W/m2 . Equation 2.15\nis of no use until some way to calculate h is established.\n\nGenerally, the heat transfer coefficient, h, is a function of\nthe fluid properties, the fluid velocity, the surface geometry\nand sometimes the temperature level. A more detailed discussion\nof convection will be given later. For now it is sufficient to\nobserve that h increases as the air velocity increases and it\nincreases with fluids of higher thermal conductivity.\n\nThere are two general forms of convection. When the air\nmotion is set up by buoyancy effects due to the applied\ntemperature difference between the surface and the fluid, e.g.\nthe air flow over a hot `radiator', the flow is natural or free\nconvection. When the flow is due to an external source, e.g.\nthe wind, a fan or by the motion of the surface, the flow is\nforced convection.\n\nRohsenow has presented a table which gives good estimates\nof the order of magnitude of h for convection heat transfer as\nwell as boiling and condensation. It is reproduced in table\n2.2.\n\nGases, Natural Convection 0.5-50\nGases, Forced Convection 2-50\nLiquids, forced Convection 30-1000\nBoiling Liquids 200-50,000\nPhase Change 500-5,000\n\nNow returning to the concept of thermal resistance, from\nequation 15 the equivalent thermal resistance, RT for convective\nheat transfer is 1/hA.\nTable 2.2\nConvection Heat Transfer Coefficients\nBTU/hr ft2 F\n\nSOLUTION\n\nIn this case convection heat\ntransfer from the inside air at\nTi to the glass surface acts in\nseries with conduction through\nthe glass and convection to the\noutside air. The equivalent electrical circuit is shown on\nfigure 7 and the steady state heat transfer, neglecting\nradiation, becomes\n\n1/\n/\n1/\n1/\n/\n1/\ninsideair\nexterior air\ninsideair\nexterior air\ni\ng\ne\ni\ng\ne\nT\nT\nT\nT\nA\nq\nhA\nL kA\nhA\nh\nL k\nh\n(2.16)\nUsing table 2 the magnitudes of hi and he are\n\nFigure2.7Electrical Analogy\nExample\nFor a single glazed window\nwhat is the increase in\nthermal efficiency if the\nglass is made of plastic with\nk = 0.1 BTU/hr ft F instead\nof glass with a k = 0.5\nBTU/hr ft F? Assume that\nthe radiation heat transfer\nremains the same.\n\nFig. 2.6 Heat transfer through window\n\n0.33\ni\ne\nBTU\nh\nhr ft F\nBTU\nh\nhr ft F\n\n(2.17)\nFor the glass, assuming it is 1/8 inch thick,\n\n1/8 1/12\n0.5\ng\nL\nBTU\nk\nhr ft F\n(2.18)\n\nChanging to plastic decreases kg to 0.1 and increases L/kg to\nl/10 but it will only change the overall value of q, given by\nequation 16 by less than 10 percent.\n\nThe overall heat transfer for composite systems such as\nfigure 2.3 or figure 2.6, represented by equations 2.9 and 2.16,\nrespectively is sometimes rewritten in terms of an overall heat\ntransfer coefficient U defined as\n\n(\n)\ni\ne\nq\nUA T\nT\n\n(2.19)\nAlthough U has the same units as h, U can involve a combination\nof conduction and convection heat transfer and is not physically\nmeaningful although it may be helpful for estimate purposes. A\nnumber of handbooks like the ASHRAE Handbook of Fundamentals\nlist\nvalues\nof\nU\nfor\ntypical\nbuilt\nup\nwall\nand\nroof\nconstruction. These values of U include convection heat\ntransfer on the inside and outside for an assumed wind velocity\nand interior air circulation conditions.\n\nTwo-dimensional Heat Transfer\n\nMost walls are not uniform across their entire surface\narea. Wood framing using 2 by 4's has studs spaced at regular\nintervals in the wall cavity, fig 2.8. Clearly the heat\ntransfer through the studs is higher than the heat transfer\nthrough\nan\nequivalent\ncross-sectional\narea\ncontaining\ninsulation.\n\nThe heat transfer through the wall cavity is due to two\nparallel conduction paths, one through the studs and the other\nthrough the insulation. If the lateral resistance is very\nlarge, i.e., the lateral conductivity of the wallboard and the\nplywood approaches zero, then the overall heat transfer can be\nmodeled as two separate parallel heat flow paths from Ti to Te,\nshown in fig. 2.9.\n\nThe heat transfer through the studs is\n\n1/\n( / )\n( / )\n( / )\n1/\ni\ne\nstud\nstud\ni\nWB\nS\nP\ne\nT\nT\nA\nq\nh\nL k\nL k\nL k\nh\n\n(2.20)\nand through the insulation,\n\nFig. 2.8\n\n1/\n( / )\n( / )\n( / )\n1/\ni\ne\ninsulation\ninsulation\ni\nWB\ninsulation\nP\ne\nT\nT\nA\nq\nh\nL k\nL k\nL k\nh\n(2.21)\nThe total heat transfer rate is the sum of equations 2.20 and\n2.21. The true value of the two-dimensional heat transfer lies\nbetween\nthese\ntwo\nlimiting\ncases\nof\nvery\nsmall\nlateral\nconductivity and very large lateral conductivity.\nThe electrical analogy of this, in one limit, is shown in figure\n2.9 with the insulation and the studs in parallel.\n\nIt is important to note that this approximation for the two-\ndimensional case represents one limiting case, the temperature\non the inside of the wall board where it contacts the stud will\nbe different from the temperature of the wall board in contact\nwith the insulation. Similarly the temperature of the plywood\nwill differ in the lateral direction between the stud and the\ninsulation. These temperature differences across the wall board\nwill cause heat to flow laterally into the stud, fig. 2.10.\nSimilarly\nheat\nwill\nflow\nlaterally out from the stud\nthrough the plywood. These\nlateral effects will enhance\nthe\ntotal\nheat\ntransfer\nthrough the stud. This will\nincrease the overall heat\ntransfer\nover\nthe\nvalues\ncalculated from the sum of\nequations 2.20 and 2.21.\nFig 2.9 Limiting Case of Small Lateral Conductivity in Wall Board and Plywood\nFig. 2.10\nlateral heat Flow in the vicinity of the stud\n\nThe\nexact\nanalysis\nof\nthese\ntwo-dimensional\neffects\nis\ndifficult. We can look at the other extreme case. If the wall\nboard and plywood were replaced by metal sheets, something\nsometimes seen in metal walled buildings, then the resistance to\nlateral conduction through them would be reduced. In the\nlimiting case w e could assume that the wall board and plywood\nwould have a very high conductivity and the temperature would be\nuniform in the lateral direction across these elements. The\nelectrical analogy for this case is shown on fig. 2.11. The\nsolution shown in figure 10 is only valid when the lateral\nresistance is small, i.e., the y direction conductivity of the\nwall board and the plywood approaches infinity.\n\nIn this case, the heat transfer through the studs and insulation\nacts in parallel between T2 and T3, the sheet rock and plywood\ntemperatures, respectively. The heat transfer through the two\nelements is summed,\n( /\n)\n( /\n)\ninsulation\nstud\nT\nT\nT\nT\nq\nL kA\nL kA\n\n(2.22)\nand defining an equivalent resistance,\n( /\n)\n( /\n)\ninsulation\nstud\nequivalent\nT\nT\nT\nT\nq\nL kA\nL kA\nR\n\n(2.23)\nFig 2.11 Limiting Case for\nSmall Lateral Resistance to Heat Transfer in Sheathing\n\nThe resistance, Requivalent,is then added in series to the remaining\nresistance shown in figure 2.11. This extreme case will result\nin a much larger overall calculated heat transfer than the other\nextreme shown in figure 2.9. The true value lies between the two\nand must be evaluated by analysis or practical judgment.\nTransient Heat Transfer\n\nConditions for Uniform Temperature\n\nWhen\nthe\ntemperature\nof\nthe\ninterior\nchanges,\nthe\nbuilding\nstructure may be sufficiently massive\nto\nprovide\nsignificant\nthermal\nstorage. This technique is used in\nnaturally ventilated buildings, using\nnight cooling in the summer to reduce\nthe structural temperature. During the\nhot daytime the cool structure will\nhelp\nto\nmaintain\nthe\ninterior\ntemperature\nwithin\na\ncomfortable\nrange. However, if the structure is\nvery\nthick,\nit\nmay\nrequire\na\nsubstantial time interval before the\ntemperature change is felt throughout the thickness of the\nstructure.\n\nConsider the case of a plane homogenous slab of thickness\n2L, fig. 2.12. The y and z dimensions are large compared to L\nso that the heat transfer can be assumed to be one dimensional,\nin the x direction only. Initially the slab is at a uniform\ntemperature T0 equal to the exterior air temperature. At time\nzero the air temperature suddenly increases to a new temperature\nlevel Te. Both sides of the slab are in contact with the air and\nboth sides have convective heat transfer coefficient h. At\nshort times, the surface temperature of the slab will increase\ndue to the heat transfer from the air. Some of the energy\ntransferred to the slab will be used to raise the internal\nenergy\nof\nthe\nmaterial\nnear\nthe\nsurface. The balance of the heat\ntransfer will be transferred to the\nnext layer inside the slab where the\nsame process occurs. The temperature\ndistribution within the slab at some\nFig. 2.12\n\nFig. 2.13\n\nintermediate time is shown in figure 2.13. When the conduction\nof the slab is large and the thickness is small, it is expected\nthat the temperature differences from the surface to the center\nof the slab will be small at all times. A better criterion is to\ncompare the resistance to conduction, L/kslab,to the convective\nresistance at the surface, 1/h. When 1/h is much larger than\nL/kslab it is expected that the temperature of the slab will be\nuniform throughout it thickness. A handy criterion is hL/kslab <\n1/6\nfor\nuniform\ntemperature.\n\nThe\nterm\nhL/k\nwhich\nis\ndimensionless is known as the Biot number.\n\nWhen hl/k < 1/6, the slab temperature T only varies with time.\nAssuming the slab initially is at temperature T0 and at time t it\ncontacts air at a different temperature T the energy equation\nbecomes,\n(\n)\ndE\nq\nhA T\nT\ndT\n\n(2.24)\n\nwhere A is the entire surface area of the slab which is in\ncontact with air at a constant temperature T. When there isn't\nany change of phase, the energy change is given as McT, where M\nis the total mass of the slab. Equation 2.24 becomes,\n(\n)\ndT\nMc\nhA T\nT\ndt\n\n(2.25)\nSince T is a constant this can be rearranged to read,\n(\n)\n(\n)\nd T\nT\nhAdt\nT\nT\nMc\n\n(2.26)\nwith the initial condition for the slab that\nat t = 0, T = T0\nThe solution of equation 31 is\n(\n)exp\n(\n)exp\nhAt\nt\nT\nT\nT\nT\nT\nT\nMc\n\n(2.27)\n\nwhere is the thermal time constant of the slab with convective\nheat transfer coefficient h and\n\nMc\nhA\n\n(2.28)\n\nExample\nA two inch thick steel structural beam has natural convection\nheat transfer over one surface; the opposite side is insulated.\nFind its time constant.\n\nSolution\n\nFirst it must be determined if the steel can be assumed\nuniform in temperature across its width. Since only one side\nhas convective heat transfer, referring to figure 2.13, L in\nthis case should be the full width of the steel beam. The Biot\nnumber is\n2(2/12)\nhL\nk\n\n(2.29)\n\nwhere h is estimated for natural convection from table 2.2. The\nassumption of uniform temperature is clearly justified. Note\nthat if we were considering a two inch thick concrete section\nwith a conductivity of about 1 BTU/hr ft\nF the Biot number\nwould be 1/3 and the assumption of uniform temperature through\nthe concrete would be questionable.\n\nThe thermal time constant for the steel beam is,\n400(0.1)(2/12)\n3.5\nMc\nLAc\nLc\nhrs\nhA\nhA\nh\n\nThe time constant is a function of the steel properties and the\nheat transfer coefficient at its surface. If air was blowing\nover the surface at a high velocity the time constant would be\nsubstantially reduced.\n\n3. Convection Heat Transfer\n\nConvective heat transfer is conduction\nthough a gas or liquid augmented by fluid motion.\nIn these notes an introduction to the physics\ngoverning convection will be given along with\nsome results for several different conditions.\n\nConsider the case of air at a uniform\ntemperature Ta blown by a fan along a flat\nsurface which is heated to a uniform temperature\nTs, Figure 3.1. Say, this is cool air in an air-\nconditioned room flowing over the surface of a\nwindow heated by solar radiation. The element\nof air closest to the heated surface has a\ntemperature increase as it starts to move up the\nplate. Elements further away, at a larger y\ncoordinate still are at Ta. As the element\nbecomes hotter it moves up and is replaced with\nanother element at Ta and the process is\nrepeated. Viewed from the point of view of the\nroom as a whole, room air at Ta approaches the\nplate and a given flow of air leaves the plate at an elevated temperature somewhere between Ta\nand Ts. Thus there is a net energy transfer from the surface of the window to the room air.\n\nThe convective heat transfer coefficient is defined as,\n\ns\na\nq\nh\nA T\nT\n\n(3.1)\n\nTo get an estimate of how the rate of heat transfer is influenced\nby the parameters of the problems we have to look more closely\nat the layer of air moving along the plate surface. To make the\nexplanation clear we will assume all of the elements of air are\nmoving along the plate surface at uniform velocity and in straight\nlines. This is an instance of laminar flow. At any location (x,y)\nfixed relative to the stationary plate the temperature remains\nconstant with time and there is a steady conduction heat transfer\nfrom the surface to the air in the y direction, normal to the plate\nsurface. As the air continues up the plate the elements close to\nthe plate increase their temperature. At the same time the\nelements further away start to rise in temperature due to\nconduction from the hotter elements at the plate surface..The\nfurther along the air moves in the x direction the more elements\nfurther from the plate surface feel the conduction heat transfer\nand rise in temperature as shown in figure 3.2.The maximum y\nFigure 3.1 Flow over a heated plate\nFigure 3.1 Flow over a heated plate\n\n1.2\n1.2\n\ndistance at which the thermal effects are felt, at any location x, will be specified as , the thermal\nboundary layer thickness.\n\nAt any position x the variation of air temperature normal to the plate surface, the y axis is shown\non figure 3.3. The rate of heat transfer from the plate surface is determined by the conduction\ninto the air at y=0. This can be calculated from,\n\na\ny\nT\nq\nk\ny\n\n(3.2)\nAs a good first estimate we can use,\n\ns\na\na\nT\nT\nq\nCk\n\n(3.3)\n\nwhere the constant C should be of order of magnitude unity. Now substituting this into the\ndefinition of the convective heat transfer coefficient,\n\n(\n)\n(\n)\n(\n)\na\ns\na\na\ns\na\ns\na\nk T\nT\nk\nq\nh\nT\nT\nT\nT\n\n(3.4)\n\nThus the heat transfer coefficient is proportional to the\nthermal conductivity of air and inversely proportional to the\nsize of the thermal boundary layer thickness.\n\nWe can use the estimate for h to qualitatively predict how the\nheat transfer coefficient will vary with the main parameters\n\nFirst, if the velocity of the air is increased over the plate\nsurface then each fluid element spends a shorter time in\ncontact with, or close to the plate. The fluid element\ntemperatures don't increase as much. From figure 3.1 and 3.2, in such an instance the thermal\nboundary layer, , will be smaller at a given x value. Thus an increase in air velocity should result\nin an increase in the heat transfer coefficient and the rate of convective heat transfer. This result\nis summarized in table 3.1\n\nConsider now an increase in the air density, say, by an increase in the air pressure, assuming all\nother air properties and the air velocity remains the same. For the same magnitude of heat\ntransfer the temperature increase of the element will be less since the element has a larger mass.\n\nFig. 3.3 Air temperature in\nthermal boundary layer\nFig. 3.3 Air temperature in\nthermal boundary layer\n\nA smaller temperature increase will reduce the thermal boundary layer thickness. Therefore, an\nincrease in the density will increase the heat transfer coefficient, one reason that liquid water has\na higher convective heat transfer rate than air. An increase in the specific heat of the fluid flowing\nover the plate has the same behavior as an increase in density.\n\nAs the plate length is increased the air will flow over the plate for a longer time. Heat transfer will\npenetrate a further distance from the plate surface. The thermal boundary layer thickness will\ngrow larger. When averaged over the entire plate length , the average thermal boundary layer\nthickness will become larger and the average heat transfer coefficient will be smaller. Note, the\ntotal heat transfer will be higher for the longer plate but the heat transfer per unit area will be\nsmaller. To augment the heat transfer when possible, designers will break a long surface up into a\nseries of smaller surfaces. This can be done by physically separating sections of the plate or by\nplacing an array of ribs at right angles to the flow to break up the boundary layer and restart it.\n\nTable 3.1 Key Parameters Influence on Convective Heat Transfer\n\nParameter\n, thermal boundary layer\nthickness\nh, convective heat transfer\ncoefficient\nVelocity increase\ndecreases\nh increases\nDensity increase\ndecreases\nh increases\nSpecific heat increase\ndecreases\nh increases\nPlate length L increase\naveraged over L increases\nh averaged over L decreases\nThermal conductivity ka\nincrease\nincrease\nh increases\nTransition to turbulent flow\nfrom laminar flow\ndecreases\nh increases\n\nWhen the thermal conductivity of the fluid passing over the plate is increased, y using a higher\nconductivity gas or liquid there are two elements in play. The thermal boundary layer thickness\nwill increase because of augmented means of heat transfer through the fluid. Remember that h is\nproportional to the ratio of conductivity to boundary layer thickness. In this case k increases faster\nthan and the heat transfer coefficient increases. It should be expected that when we increase\nthe mechanism for heat transfer, in this case the molecular conductivity, that the rate of\nconvection will increase.\n\nTurbulent Flow\n\nAt low velocity, the fluid flows in very smooth paths about parallel to the plate surface. As\nthe velocity is increased a point is reached where the fluid motion is much more chaotic\ncharacterized by eddies in the flow near the plate surface. This is termed turbulent flow.\nTurbulent flow over a flat plate is found to occur when the Reynolds number Vx/ exceeds\n300,000. x is used to indicate the distance from the leading edge; the front of the flat plate can\nhave laminar flow while the rear experiences turbulent flow. The distinction between laminar and\n\nturbulent flow is important because the eddies in the turbulent flow tend to bring fluid at the\nambient temperature Ta much closer to the heated plate surface. In effect the eddies reduce the\ndistance for conduction heat transfer and can markedly increase the heat transfer coefficient,\nsometimes by an order of magnitude or more.\n\nAt can be seen that the convective heat transfer is a function of the fluid properties such as\ndensity and conductivity, the flow conditions and the surface geometry. Given below are a few\ndimensional expressions that can be used for specific cases. The constants in the equations\nalready include the fluid properties.\n\nLaminar flow expressions for h\nUsing air properties at room temperature h for laminar flow over flat plates can be found as\n\n0.5\n0.71 V\nh\nL\n\n(3.5)\n\nwhile for water,\n\n0.5\n12.7 V\nh\nL\n\n(3.6)\n\nIn this form h is in BTU/hrft2F, V is in ft/sec and L is in ft. Note, water gives a much higher heat\ntransfer coefficient than air because it has a much higher thermal conductivity as well as a higher\ndensity and specific heat.\n\nTurbulent Flow\n\nAt low velocity, the fluid flows in very smooth paths about parallel to the plate surface. As\nthe velocity is increased a point is reached where the fluid motion is much more chaotic\ncharacterized by eddies in the flow near the plate surface. This is termed turbulent flow.\nTurbulent flow over a flat plate is found to occur at higher velocities and longer plate lengths. Also\nflowing liquids will reach turbulent flow at lower velocities than gases.\n\nFor air near room temperature turbulent flow is reached when the product of plate length and air\nvelocity exceeds,\n\n50 ft\nVL\nft\ns\n\n(3.7)\n\n0.8\n0.2\n0.55V\nh\nL\n\n(3.8)\n\nFor water\n\n0.8\n0.2\n3.9\n21.2\nft\nVL\nft\ns\nV\nh\nL\n\n(3.9)\n\nAgain, all of the parameters are in Imperial units.\n\nFlow Inside Tubes\n\nThe other important flow geometry is gas or liquid flow inside tubes. A similar\ndevelopment exists for the convective heat transfer with the exception that h is defined based\non the mean temperature TM of the fluid within the tube at the location in question. For a\nsection within the tube of axial length between x and x+x,\n\nS\nM\nq\nh\nD x T\nT\n\n(3.10)\n\nwhere TM is the mean fluid temperature at x.\n\nAlmost all practical cases of tube flow, the flow is turbulent. Exceptions are flows\nthrough very small tube diameters or the flow of viscous fluids such as oil. For turbulent tube\nat room temperature, the relationship becomes,\n\n0.8\n0.2\n0.34 V\nh\nD\n\n(3.11)\n\nwhile for water we get,\n0.8\n0.2\n13V\nh\nD\n\n(3.12)\n\nwhere V is given in ft/sec and D is in feet.\n\nNatural or Free Convection\n\nIn natural convection the fluid motion is solely due to\nbuoyancy effects caused by the heating or cooling\nprocess of the fluid. Natural convection flow over\nvertical flat plates has similar physical considerations\nand analogous expressions to those used for forced\nconvection, see Figure 3.4. However, in this case\nthe fluid velocity V is not set by external fans or by\nthe motion of the heated body. The air density varies\nwith 1/T. The air close to the plate is at a higher\ntemperature and has a lower mass. This results in a net upward buoyancy force on these\nelements that accelerates them. We would expect the velocity and the heat transfer coefficient\nis a function on the temperature difference Ts-Ta.\n\nJust as forced flow, laminar flow exists at low velocities. The exact expression for natural\nconvection of air over a vertical plate at room temperature is\n1/4\n0.29\no\nTL\nF ft\nT\nh\nL\n\n(3.13)\n\nFor turbulent flow,\n\n1/3\n0.21\nTL\nh\nT\n\n(3.14)\n\nNatural Convection in Enclosed Spaces\n\nIn an open wall cavity between interior and exterior walls air circulation will take place\nfrom the hot to the cold wall. The air will rise along the hot wall move horizontally to the cold\nwall at the upper end of the wall cavity (and at other vertical locations as well). The warm air will\nthen flow down the cold wall. This process will result in energy transfer from the hot to the cold\nFigure 3.4 natural convection on a\nvertical heated plate\nFigure 3.4 natural convection on a\nvertical heated plate\n\nH\ne\na\nt\nt\nra\nns\nfe\nr co\ne\nf\nfici ent as a fun\nctio\nn of\nair\nspa\nce t\nh\nick\nnes\ns.\nwall. The overall heat transfer can be represented by a heat transfer coefficient defined in terms\nof the two wall temperatures,\nC\nhot wall\ncold wall\nq\nh A T\nT\n\n(3.15)\n\nFigure 3.5 shows measured results for eight foot high walls. hc is a function of the\nspacing between the walls and , the temperature difference from the hot to the cold wall. At a\nsmall spacing and/or a small temperature difference the buoyancy effects are minimal and hc is\nsimply the ratio of air conductivity to wall spacing. As the spacing is increased, hc reaches a\nconstant, typically a spacing between 1/2 and 3/4 inch is optimum. Radiation heat transfer\nacross the cavity must be added to the convection. If there is infiltration of outside air into the\ncavity the energy transfer may be increased considerably.\n\nImage by MIT OpenCourseWare.\n\n4) Radiation Heat Transfer\n\nThermal radiation and conduction are the two fundamental mechanisms of heat transfer.\nBodies, such as the sun, emit electromagnetic energy by virtue of their temperature level. The\nelectromagnetic energy is exchanged between bodies at different temperatures giving rise to a\nnet heat transfer.\n\nFor heat transfer by radiation the electromagnetic energy generally falls in the visible\nrange, with wavelengths from 0.4 to 0.7 m, the near infrared, from 0.7 to 25m in wavelength, or\nthe far infrared from 25 to 1000 m. Electromagnetic radiation in other wavelengths such as X-\nRays, and Radio waves is not thermally induced and will be excluded from consideration.\n\nA black body is a body which absorbs all of the radiation incident on its surface over all\nwavelengths of importance for heat transfer. The absorbed energy represents an energy\ntransfer to the black body which can contribute to the internal energy increase or it may be\ntransferred through the body by one or more forms of heat transfer.\n\nFor a black body at a uniform temperature T, the rate of radiation heat transfer emitted\nby the body and leaving the surface, over all wavelengths, is given as\nemitted\nq\nA T\n\n(4.1)\n\nwhere T is the absolute temperature and is the Stefan-Boltzmann constant, which has the\nvalue 0.17 x 10-8 BTU/hr ft2R4 or 5.7 x 10-8 W/m2 K4. Because of the non-linear nature of the\nexpression, radiation becomes progressively more important at higher temperatures although\nthere is considerable radiative heat transfer between bodies at room temperature.\n\nThe black body radiation is emitted over a range of wavelengths. The emitted energy at\na single wavelength , qre, can be defined so that\nemitted\nre\nq\nq\nd\n\n(4.2)\n\nFigure 20 shows the distribution of qre as a function of wavelength for black bodies at three\ntemperature levels. For solar radiation, the sun has an effective black body temperature near\n10,400 R, a majority of the emitted energy is in the visible wavelengths and the balance of the\nenergy is in the near infrared below 3m. In contrast, the energy emitted by a black body at\nroom temperature falls in the infrared wavelength range from 8m to 40m. For any black body\nat temperature T eighty percent of the total black body emissions occurs when the product of\nthe wavelength and the absolute temperature, T, is between 4000 (m)(R) and 17,000\n(m)(R). One half of the total radiation is emitted at wavelengths equal to or below the value of\nT equal to 7400 (m)(R).\n\nMaterial Properties\nIn the visible wavelengths many common building materials are not good absorbers.\nThe fraction of the black body radiation absorbed by a body at a given wavelength is given by\nthe monochromatic absorptivity\n, the values of\nlie between zero and one. In the visible\nwavelengths, white paint, wood and plaster have\nvalues between about 0.1 and 0.5 see\nTable 3. In the infrared above 4 or 5m wavelengths almost all common building materials\nexcept shiny metals have\nof 0.8 or higher. Plate glass which is transparent in the visible\n\nwavelength becomes a very good black body in the infrared wavelengths with\ngreater than\n0.9.\n\nHeat Transfer Between Black Bodies\n\nConsider two flat plates, A1 and A2, parallel to each other with the spacing between the\nsurfaces small compared to the width of the plates, see Figure 4.1. The air between the plates\ncan be considered transparent.\n\nEach plate is a black body at a uniform temperature T1 and T2, respectively. The radiant energy\nemitted by the first plate is\nq\nA T\n\n(4.3)\n\nAll of the energy emitted by plate 1 is absorbed by plate 2. Similarly all of the energy emitted by\nplate 2, A2 T2\n4 is absorbed by plate 1. The net radiative heat transfer is\nq\nA\nT\nT\n\n(4.4)\n\nThis heat transfer takes place independent of any conduction or convection heat transfer\nassuming the temperature T1 and T2 can be maintained. Thus the total heat transfer is the sum\nof the radiative heat transfer given by Eqn. 70 plus the convective heat transfer between the two\nplates.\n\nIn many cases it is useful to linearize the relationship given by Eqn. 70. Taking the\nmean temperature as (T1+T2)/2 and T as the temperature difference T1-T2 then T1=TM+T/2 and\nT2=TM -T/2 and\nFig. 4.1 Radiation between\nparallel black plates\nFig. 4.1 Radiation between\nparallel black plates\n\nM\nT\nT\nT\nT\nT\nT\nT\nT\n(4.5)\n\nWhen T<<TM, where TM is measured in absolute temperatures, K or R,\nM\nT\nT\nT\nT\nT\n\n(4.6)\n\nAn effective or radiative heat transfer coefficient can be defined so that\nr\nr\nr\nM\nq\nh A T\nT\nwhere h\nT\n\n(4.7)\n\nTable 4.1 gives values of hr for different values of mean temperature. These values should be\ncompared to the values given for convection in Table 2. At room temperatures heat transfer\n\nTable 4.1 hr for radiation at mean temperature T\n___________________________________________________________________________\n\nMean Temperature oF\nhr (BTU/hr ft2 F)\n\nhr(W/m2K)\n\n0.7\n\n3.8\n\n1.0\n\n5.7\n\n2.0\n\n6.0\n\n___________________________________________________________________________\n\nby radiation is comparable in magnitude to natural convection. For heat transfer between two\nglass sheets that make up a double glazed window, infrared radiation is important. To reduce\nthe radiation heat transfer one of the glass layers is coated with a very thin metallic layer. For\nresidential buildings this layer allows visible solar radiation to pass but reflects most of the\ninfrared radiation. The layer is referred to as a low e coating. The net infrared radiation can be\nexpressed as,\nq\nA\nT\nT\n\n(4.8)\n\nwhere is the emissivity of the glass covered by the metallic layer. Typically can be less than\n0.1, substantially reducing the net radiation transfer.\n\nFor radiation between walls and ceiling or between a person and surrounding surfaces which\nare each black bodies at different temperatures the geometry of the configuration must be\nincluded. For example the radiation heat tranfer between a person and a large glazed wall can\nbe expressed as\n\nq\nA\nF\nT\nT\n\n(4.9)\n\nwhere F12 is the configuration factor between surface 1, the person, and the glazed surface. F\nrepresents the fraction of radiation form the entire surface of the person that is directed toward the\nglazed wall. When the person is very close to a large glazed surface extending from floor to ceiling, the\nvalue of F will be close to 1⁄2. On the other hand when the person moves further from the window F will\ndecrease. If the person sits in the center of a cubic room, F from the person to the glazed wall drops to\n1/6.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n4.42J / 1.044J / 2.45J Fundamentals of Energy in Buildings\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}