{
  "course_name": "Fundamentals of Biology",
  "course_description": "Fundamentals of Biology focuses on the basic principles of biochemistry, molecular biology, genetics, and recombinant DNA. These principles are necessary to understanding the basic mechanisms of life and anchor the biological knowledge that is required to understand many of the challenges in everyday life, from human health and disease to loss of biodiversity and environmental quality.\nCourse Format\n\n This course has been designed for independent study. It consists of four units, one for each topic. The units can be used individually or in combination. The materials for each unit include:\n\nLecture Videos by MIT faculty.\nLearning activities, including Interactive Concept Quizzes, designed to reinforce main concepts from lectures.\nProblem Sets you do on your own and check your answers against the Solutions when you’re done.\nProblem Solving Video help sessions taught by experienced MIT Teaching Assistants.\nLists of important Terms and Definitions.\nSuggested Topics and Links for further study.\nExams with Solution Keys.\n\nContent Development\n\nEric Lander\nRobert Weinberg\nTyler Jacks\nHazel Sive\nGraham Walker\nSallie Chisholm\nDr. Michelle Mischke",
  "topics": [
    "Science",
    "Biology",
    "Science",
    "Biology"
  ],
  "syllabus_content": "«\nPrevious\n|\nNext\n»\n\nCourse Overview\n\nThis course focuses on the basic principles of biochemistry, genetics, molecular biology, and recombinant DNA technologies. The material presented introduces modern biology at the molecular level: the structure and function of biological macromolecules, the basics of cellular metabolism, meiosis and inheritance, DNA replication, the basics of gene expression, and general recombinant DNA techniques.\n\nPrerequisites\n\nThere are no formal prerequisites for this course. At MIT, it is usually taken during the freshman (first) year.\n\nPrior to taking this course, you may want to review\nPre-7.01 Getting up to Speed in Biology\n, a self-paced course designed to help prepare students for their first college-level biology class.\n\nCourse Goals\n\nAfter completing the four units of this course, you should be able to:\n\nIdentify the general structure and function of carbohydrates, phospholipds, proteins, enzymes and nucleic acids.\n\nOutline the general processes used by the cell to generate cellular energy from sugar and to generate the energy and reducing agent needed for the Calvin cycle.\n\nDescribe how DNA was shown to be the genetic material and how DNA is copied.\n\nDescribe the structure and regulation of genes, and the structure and synthesis of proteins.\n\nUnderstand the inheritance of two or more traits based upon Mendelian genetics. Apply this knowledge to drawing and decoding human pedigrees.\n\nUnderstand the inheritance of traits when the genes involved are linked.\n\nPredict the results of genetic crosses involving two or more traits when the genes involved are linked or unlinked.\n\nUnderstand the general tools and reagents used in recombinant DNA technologies.\n\nOutline a general strategy for making a recombinant DNA library, screening a recombinant DNA library, and analyzing the DNA fragment identified.\n\nDesign a general strategy for identifying a gene of interest using recombinant DNA techniques.\n\nFormat\n\nFundamentals of Biology\nwas designed specifically for independent study. It draws upon material developed for the three versions of MIT's Introductory Biology classes known as\n7.012\n,\n7.013\n, and\n7.014\n. All three classes cover the same core material, which includes the fundamental principles of biochemistry, genetics, molecular biology, and cell biology. In addition, each version of the subject has its own distinctive material.\n\n7.012, with Professors Eric Lander and Robert Weinberg, focuses on genomics, neurobiology, and cancer cell biology.\n\n7.013, with Professors Hazel Sive and Tyler Jacks, focuses on development and cancer cell biology.\n\n7.014, with Professors Graham Walker and Penny Chisholm, focuses on ecology and environment.\n\nThe content of this Fundamentals of Biology OCW Scholar course is organized into four major units:\n\nBiochemistry\n\nMolecular Biology\n\nGenetics\n\nRecombinant DNA\n\nEach unit has been further divided into a sequence of sessions that cover an amount you might expect to complete in one sitting. Most sessions include:\n\nOne or more lecture video excerpts by MIT faculty explaining a key concept in biology.\n\nProblems (with solutions) and interactive concept quizzes.\n\nBrief help session videos by experienced MIT Teaching Assistants.\n\nLists of important terms and definitions.\n\nSuggested topics and links for further study.\n\nThe following textbook was used when this course was taught on the MIT campus:\n\nCampbell, N. A., J.B. Reece, et al.\nBiology\n. 8th ed. Pearson Benjamin Cummings, 2008. ISBN: 9780805368444.\n\nOCW users will find equal value in most standard introductory biology textbooks. Throughout the course, we suggest topics of study that can be found in any standard textbook.\n\nMIT expects its students to spend about 150 hours on this course. More than half of that time is spent preparing for class and doing assignments. It's difficult to estimate how long it will take you to complete the course, but you can probably expect to spend an hour or more working through each individual session.\n\nMeet the Team\n\nThis OCW Scholar course was developed by the following MIT Faculty and Teaching Staff:\n\nProf. Eric Lander\n\nProf. Robert Weinberg\n\nProf. Tyler Jacks\n\nProf. Hazel Sive\n\nProf. Graham Walker\n\nProf. Penny Chisholm\n\nDr. Michelle Mischke\n\nTo learn more about the Faculty and Teaching Staff, visit the\n\nMeet the Instructors\n\npage.\n\nThe Help Session Videos were developed by the following MIT Teaching Assistants:\n\nJoseph Robert Dorkin\n\nSera Thornton\n\nGenevieve Michelle Gould\n\nNicole De Nisco\n\nTo learn more about the\n\nTeaching Assistants\n, visit the\nMeet the TAs\npage.\n\n«\nPrevious\n|\nNext\n»",
  "files": [
    {
      "category": "Exam",
      "title": "MIT_7_01SCF11_exam3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/6feaadb59ef84248bdd913076194580b_MIT_7_01SCF11_exam3.pdf",
      "content": "Genetics Unit Exam\n\nQuestion 1\n\nYou are working with an ornamental fish that shows two color phenotypes, red or white. The color is controlled by\na single gene. These fish are hermaphrodites - meaning they can either (1) self-fertilize or (2) mate with another\nfish. You have three fish: fish 1, fish 2, and fish 3.\n\na) You set up the mating experiment #1 below using these fish. From the following statements check all that might\nbe true (that is, are consistent with the data, allowing for reasonable statistical fluctuations), given only the results\nof experiment #1.\n\nNumber of progeny with following phenotype\nExperiment\nRed\nWhite\n#1: Fish 2 (red) with Fish 3 (red)\n\nO Fish 2 and fish 3 are homozygotes.\nO The red phenotype is dominant to the white phenotype.\nO The white phenotype is dominant to the red phenotype.\nO Both fish 2 and fish 3 are heterozygotes.\nO Fish 2 is a homozygote, and fish 3 is a heterozygote.\nO Fish 2 is a heterozygote, and fish 3 is a homozygote.\n\nb) You set up mating experiments #1 (same as above) and #2 below using these fish. From the following\nstatements check all that might be true (that is, are consistent with the data, allowing for reasonable statistical\nfluctuations), given both experiment #1 and experiment 2.\n\nNumber of progeny with following phenotype\nExperiment\nRed\nWhite\n#1: Fish 2 (red) with Fish 3 (red)\n#2: Fish 2 (red) with Fish 2 (red)\n\nO Fish 2 and fish 3 are homozygotes.\nO The red phenotype is dominant to the white phenotype.\nO The white phenotype is dominant to the red phenotype.\nO Both fish 2 and fish 3 are heterozygotes.\nO Fish 2 is a homozygote, and fish 3 is a heterozygote.\nO Fish 2 is a heterozygote, and fish 3 is a homozygote.\n\nc) You perform experiment #3 and obtain 400 progeny. Note that fish 2 is the same fish in all three experiments.\nIn the table below, list the phenotype or phenotypes you would see in the progeny. Then give the number of\noffspring expected with each phenotype.\n\nExperiment\n#3: Fish 1 (white) with Fish 2 (red)\n\nPossible Phenotypes\ntotal number showing this phenotype\n\nQuestion 1, continued\n\nWhile working further with this fish, you discover one other mutation (in a different gene) that leads to the\nrecessive phenotype of long dorsal fins. We now have two phenotypes:\nColor: red or white (described in part a). Alleles denoted by R and r.\nDorsal Fins: long (recessive) or short (dominant). Alleles denoted by D and d\n\n*each trait is controlled by a single gene. For the questions below, use the upper case letter for the allele\nassociated with the dominant phenotype. Use the lower case letter for the allele associated with the recessive\nphenotype.\n\nIn experiment A, you cross true-breeding white fish with short fins to true-breeding red fish with long fins and get\nall red fish with short fins. You then cross the F1 fish to true-breeding white fish with long fins.\n\nExperiment A: white fish with short fins X red fish with long fins\n\n(F1) red fish with short fins X white fish with long fins\n\nF2: ?\n\nd) You obtain 1000 F2 offspring. Assume that the color and fin loci are 5 cM apart. In the table below, list all the\npossible phenotypes seen in the F2 offspring. For each phenotype given, list all the possible genotypes seen in\nthe F2 offspring. Finally, give the number of offspring expected with each phenotype.\n\nPossible Phenotypes\nPossible Genotypes\nTotal F2 showing this\nphenotype\nred fish with short fins\n\nred fish with long fins\n\nwhite fish with long fins\n\nwhite fish with short fins\n\nQuestion 2\n\nYou are studying a genetically inherited trait. The pedigree for a family with this trait is shown below. This trait\nshows complete penetrance. Assume no new mutations.\n\nComplete each table below ONLY if that mode of inheritance is possible.\n\na) Could this trait be inherited in an Autosomal Dominant manner? __________\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use A for the allele\nassociated with the dominant phenotype and a for the allele associated with the recessive phenotype.\n\nb) Could this trait be inherited in an Autosomal Recessive manner? ___________\n\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use A for the allele\nassociated with the dominant phenotype and a for the allele associated with the recessive phenotype.\nIndividual\npossible genotype or genotypes\n\nc) Could this trait be inherited in an X-linked Recessive manner? __________\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use XA for the\nallele associated with the dominant phenotype and Xa for the allele associated with the recessive phenotype.\nIndividual\npossible genotype or genotypes\n\nIndividual\npossible genotype or genotypes\n\nNote: carriers are not distinguished from non-carriers\nUnaffected male\nAffected male\nUnaffected female\nAffected female\n\nQuestion 3\n\nThe pathway for the breakdown of phenylalanine is as follows. There are six enzymes involved in this pathway.\nEnzyme A is encoded by gene A, enzyme B is encoded by gene B, etc. The genes involved in this pathway all lie\non different chromosomes and are thus unlinked to each other.\n\na) PKU is a human autosomal recessive genetic disorder where the inability to breakdown the amino acid\nphenylalanine and the resulting accumulation can cause neurological problems. What would be the genotype of\nan individual with PKU? Consider only the relevant gene and use the upper case letter for the allele associated\nwith the dominant phenotype, the lower case letter for the allele associated with the recessive phenotype.\n\nb) Alkaptonuria is a human autosomal recessive genetic disorder where the individual is missing the function of\nenzyme D. This results in the accumulation of a byproduct that is excreted in the urine. What byproduct\naccumulates in these individuals?\n\nc) A woman with PKU who is also a carrier for Alkaptonuria marries a man with Alkaptonuria who is also a carrier\nfor PKU.\n\ni) What would be the genotype of the woman?\nWhat would be the genotype of the man?\n\nii) What are the chances that their child will appear phenotypically normal? Explain your answer or show\nyour work.\n\niii) What are the chances that their child will show a both the PKU and the Alkaptonuria phenotype?\nExplain your answer or show your work.\n\nPhenylalanine\nTyrosine\np-‐hydroxyphenylpyruvate\nHomogentisate\n4-‐maleyacetoacetate\nFumerate + Acetoacetate\n4-‐fumeryacetoacetate\nenzyme A\nenzyme B\nenzyme C\nenzyme D\nenzyme E\nFu\nin t\nr\nh\nther\ne Kr\ndegr\nebbs\nadat\nCyc\ni\nl\non\ne\nor use\nenzyme F\n\nQuestion 4\n\nYou are studying development in a new species of fruit fly, Drosophila mit-ensis, and you find a fly that has curly\nwings as seen here:\n\nCurly Wings\nNormal Wings\n\na) The Curly wings phenotype is due to a mutation at a single locus. Assume that you have flies that are true-\nbreeding for the curly wing phenotype (cur/cur) and flies that are true-breeding for normal wings (+/+).\n\n-\nPropose a genetic cross to determine whether the mutant phenotype is dominant or recessive, and list\nthe genotype(s) of the F1 offspring you would obtain from this cross. Use cur for the allele associated\nwith curly wings and + for the allele associated with normal wings.\n\n-\nWhat phenotype(s) would you expect to see in the F1 generation if the mutant phenotype is dominant? In\nwhat proportion would you see these phenotypes?\n\n-\nWhat phenotype(s) would you expect to see in the F1 generation if the mutant phenotype is recessive? In\nwhat proportion would you see these phenotypes?\n\nYou perform the experiment and find that the curly wing phenotype is recessive. A friend of yours has been\nstudying a mutation that causes short antenna. The short antenna phenotype is recessive to the wild-type long\nantenna phenotype. You designate the mutant allele (ant) and the wild-type allele (+).\n\nYou set up the following crosses:\n\nCurly wings, long antenna\nNormal wings, short antenna\n\ncross 1:\ncur +\n+ ant\ncur +\nX\n+ ant\n\n⇓\n\nF1:\n\nNormal wings,\n\nlong antenna\n\ncross 2:\nNormal wings, long antenna\nCurly wings, short antenna\nX\n(F1 from cross 1)\n\nb) What type of cross is cross 2?\n\nc) If the two genes are unlinked...\n\ni) What phenotypic classes do you expect to see from cross 2 and in what ratios?\n\nii) Could these two genes be located on the same chromosome? Explain.\n\nQuestion 4, continued\n\nd) You perform cross 2, examine 1000 progeny and see that the genes are linked. In the table below, give the\ngenotypes and phenotypes for the parental and recombinant progeny.\n\nPlease note that you must use the following nomenclature. Use cur and + for the alleles of the wing gene. Use\nant and + for the alleles of the antennae gene.\n\nNumber of progeny\nGenotype\nPhenotype\n\nParental\n431 + 429\n\nRecombinant\n69 + 71\n\ne) What is the recombination frequency between the wing and the antennae genes?\n\nQuestion 5\n\nYou are studying a genetically inherited disease. The pedigree for a family with this disease is shown below.\nAssume 1) the disease phenotype shows complete penetrance and 2) the disease allele is present at a high\nfrequency in the population.\n\na) Circle all possible modes of inheritance that are consistent with this disease and assumptions 1 and 2.\n\nAutosomal dominant\nAutosomal recessive\n\nX-linked dominant\n\nX-linked recessive\n\nY-linked\n\n*Now assume that individual 8 does not carry any disease alleles. Complete the remainder of this question based\non this information.\nUse the genotypes +/-, +/+, or -/- for autosomal traits.\nUse the genotypes X+Y, X-Y, X+X-, X-X- or X+X+ for X-linked traits.\nUse the genotypes XY+ or XY- for Y-linked traits.\n*In all cases, + indicates the wild-type allele and - the mutant allele.\n\nb) Give all possible genotypes for the following individuals below.\n-\nindividual 2\n\n-\nindividual 4\n\nUnaffected male\nAffected male\nUnaffected female\naffected female\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/7a9390d436e6ba0369611c8b64522441_MIT7_01SCF11_exam1.pdf",
      "content": "Biochemistry Unit Exam\nQuestion 1\na) An example of a structural representation is shown in the adjacent box.\nDraw a structural representation of the amino acid, Aspartic acid, which has the\nside chain of: CH2COOH.\nb) The molecule drawn above is a monomer found in _________________.\nc) Below is a pentose found in RNA. On the diagram circle the hydroxyl that differs between ribonucleotides and\ndeoxyribonucleotides.\nOH\nO\nCH2\nOH\nH\nH\nH\nH\nOH\nOH\nd) You find an organism that lives in thermal pools with temperatures as high as 160 °F. You find that many of this\norganism's proteins have a high percentage of cysteine. Briefly explain why this might be the case.\nH - C - C -H\nH\nH\nH\nH\ne) To the right is an iconic view of a phospholipid.\n-\nList what atoms are found in a phospholipid molecule represented by the boxed region of this schematic.\nDescribe the properties associated with this region.\n-\nList what atoms are found in a phospholipid molecule represented by the shaded region of this schematic.\nDescribe the properties associated with this region.\n\nQuestion 1, continued\n\nf)\n\nATP\n_\n\na) Box the part that is added to a growing chain of nucleic acid.\nb) Star the atom(s) that can form a hydrogen bond with the complementary nitrogenous base.\nc) Circle the part of the molecule that decreases the stability of RNA as compared to DNA.\nd) Draw an arrow to the part of this molecule that you would modify to prevent further elongation. Indicate what\nchange you would make next to the arrow drawn.\nQuestion 2\nShown below is the structure of Drug 1, that binds to the E. coli ribosome. Indicate whether each circled region\ncould possibly form ionic bonds, hydrogen bonds, or hydrophobic interactions with another molecule by filling out\nthe table below. Fill in the table with \"yes\" if that type of bond is possible, \"no\" if it is not.\nO\nCH\nC\nHN\nO\nO -\nH2\nN\nH\nC\nO\n(iii)\n(iv)\nCH3\nCH2\nCH3\n(i)\n(ii)\nCH3\na)\nPart\nCould this part form\nionic bonds\nCould this part form\nhydrogen bonds\nCould this part be involved in a\nhydrophobic interaction\n(i)\n(ii)\n(iii)\n(iv)\n\nQuestion 2, continued,\nA representation of the drug bound to the E. coli ribosome is shown below. Three amino acids of the ribosome\nthat are important for binding are shown. If this drug can bind to different bacterial ribosomes, it may be useful as\nan antibiotic. The ability of this drug to bind to the ribosomes of two different species is examined. The drug binds\nto the ribosome of species 1, but does not bind to the ribosome of species 2.\nO\nCH\nC\nHN\nO\nO -\nH2\nN\nH\nC\nO\n(iii)\n(iv)\nCH3\nCH2\nCH3\n(i)\n(ii)\nCH3\nLys 101\nLeu 312\nAsn 231\nRibosome\nFor your information:\nAmino acid\nSide chain\nIle\nCHCH3CH2CH3\nVal\nCHCH3CH3\nAsn\nCH2CONH2\nGlu\nCH2CH2COO-\nLys\n(CH2) 4NH3+\nSer\nCH2OH\nLeu\nCH2CHCH3CH3\nArg\n(CH2)3NHC(NH2)2+\nb) The table shows the differences between the ribosomes. Given this information, complete the table indicating\nwhich would be from species 1 (drug binds) and which would be from species 2 (drug does not bind).\nRibosome from:\nAmino acid found at\nE. coli\nLys\nAsn\nLeu\nSpecies _____\nGlu\nSer\nVal\nSpecies _____\nArg\nGlu\nIle\nc) What specific amino acid or amino acids prevents the ribosome from species 2 from binding Drug 1?\nd) In terms of the specific non-covalent interactions, explain why the ribosome from species 2 will NOT bind Drug\n1, but the ribosomes from E. coli and species 1 will.\n\nQuestion 3\nReaction 1)\nA\nB, where ΔG' = +2\na) The energy profile for the reaction 1 is drawn on the axes below.\n-\nLabel A, B, and ΔG' on the graph below.\n-\nWhat is the value for the energy of activation?\nCompare reaction 1 (above) to reactions 2 and 3 (below).\nFree energy\nCourse of reaction\nReaction 2) C\nD, where ΔG' = -3, Energy of activation = +0.5\nReaction 3) E\nF, where ΔG' = +0.3, Energy of activation = +2\nb) Which of these reactions, 1, 2, or 3 is most likely to proceed in the forward direction in the absence of an\nenzyme? If you do not have enough information to answer this question, write \"Can't tell\" below. Explain your\nanswer.\nc) When an appropriate enzyme is added to each of these reactions, the rate of the reaction increases. Which\nreaction will proceed the fastest? If you do not have enough information to answer this question, write \"Can't tell\"\nbelow. Explain your answer.\nd) Assume that you have a reaction X\nY where ΔG = 0 and the energy of activation = +0.6 kcal/mole. In\na cell, you find that the reaction proceeds almost exclusively in the forward direction. Explain why this might be\nthe case.\n\nQuestion 3, continued\nEnzyme 1 carries out the reaction: W - X + Y. There are three regions where enzyme 1 interacts with substrate\nW (another protein) to facilitate the conversion of W into X and Y.\nRegion 1 is stabilized by hydrophobic interactions between the side chains of the amino acids found on the\nenzyme and substrate.\nRegion 2 is stabilized by hydrogen bonds between the side chains of the amino acids found on the enzyme\nand substrate.\nRegion 3 is stabilized by ionic bonds between the side chains of the amino acids found on the enzyme and\nsubstrate.\ne) You have the following pairs of amino acids. For each pair given, list in which region (1, 2, or 3) this pair would\nact to stabilize the interaction of enzyme 1 with substrate A. If the pair could be found in more than one region,\nlist all that apply. If the pair would not be found in any region write in the word NONE.\npair\nAmino acid on\nenzyme\nAmino acid on substrate\nIn what region or regions would\nthe pair be found?\nalanine\nleucine\narginine\nisoleucine\nserine\nmethionine\nthreonine\nserine\nlysine\narginine\nglutamine\nasparagine\nproline\nvaline\naspartic acid\nlysine\nQuestion 4\nYou inoculate two test tubes with the same amount of identical growth medium and with the same number of\nidentical yeast cells and grow these cells under identical conditions except for the presence or absence of\noxygen.\na) After 12 hours, all of the glucose in each culture has been consumed. You determine the number of total cells\nfound in each culture and find that one culture has more cells than the other.\n-\nWhich culture would have the greater cell density, the one grown aerobically or the one grown\nanaerobically?\n-\nExplain why the culture you chose above can make more cells with the same amount of glucose than the\nother culture.\nb) The cells of both cultures convert glucose to pyruvate via glycolysis, and then further metabolize pyruvate.\n-\nAre the cells of both cultures able to obtain the same amount of ATP from glycolysis? Explain.\n-\nUnder anaerobic conditions, the carbon from pyruvate will ultimately be found in which molecule?\n-\nUnder aerobic conditions, the carbon from pyruvate will ultimately be found in which molecule?\n\nQuestion 4, continued\nc) Under aerobic conditions, when glucose is metabolized some of the energy is used to reduce NAD+ to NADH +\nH+ . In the mitochondria, NADH donates its electrons to NADH-Q reductase, and from there the electrons move\nthrough the electron transport chain.\n-\nExplain why this process requires aerobic conditions.\n-\nBriefly describe how the transfer of electrons from one protein to another in the electron transport chain\nresults in the production of ATP.\nd) In oxygenic photosynthesis, electrons from the cholorphyll found in photosystem II are donated to the primary\nelectron carrier. How are the donated electrons replaced?\ne) Anoxygenic photosynthetic organisms make ATP using an electron transport chain, but do not produce O2 as a\nwaste product. What is a common source of electrons for the conversion of NADP+ to NADPH for in this type of\norganism?\nMany highly reduced compounds whose redox potential will allow transfer of electrons to NADP+ could serve as a\nsource of electron. One common compound is H2S.\nf) Circle all of the metabolic processes that occur in organisms that perform oxygenic photosynthesis.\nGlycolysis\nCitric acid Cycle\nOxidative phosphorylation\nCalvin Cycle\nCyclic photophosphorylation\nNon-cyclic photophosphorylation.\ng) Both respiration and photosynthesis are evolutionarily conserved. Based upon the current understanding of\nhow life on earth evolved, which of these processes likely evolved first? Justify your answer in the space below.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/0fd1358eddb7e0b2a582a22d2dbb3efe_MIT7_01SCF11_exam2.pdf",
      "content": "Molecular Biology Unit Exam\n\nQuestion 1\n\nConsider the following origin of replication that is found on a chromosome. The sequence of region 1 is shown\nbelow.\n\nRegion 1: 5'...CTGACTGACA...3'\n3'...GACTGACTGT...5'\n3'\n5'\n5'\n3'\nRegion 1\ntop\nori\nbottom\n\na) Within Region 1, which strand will be the template for leading strand synthesis, the top or the bottom?\n\nb) If we assume that a lagging strand fragment is made from region 1, what will be its sequence?\n\nc) You examine DNA replication in an E. coli mutant, which has a partially defective DNA polymerase. In vitro\nexperiments using the mutant DNA polymerase gives an error rate of 10-3, as compared to the expected error\nrate of 10-6. Which of the following activities is the mutant polymerase likely to be missing, as compared to\nthe normal polymerase? Circle all that apply.\n5'3' polymerase\n\n3'5' exonuclease\n5'3' exonuclease\n\n3'5' polymerase\n5'3' recombinase\n\n3'5' recombinase\n\nd) Below is a schematic of the molecule that inserts the fourth amino acid (a trytophan) into the mutant\npolymerase. A codon chart is found on the final page of the exam.\n\ni) This schematic represents a _________\n\nii) On the schematic, give the nucleotides of the anticodon.\n\nTrp\n- O\nO\n⏐ ⏐ ⏐\nP\nO\nO -\n\nQuestion 2\n\nBelow are 210 consecutive base pairs of DNA that includes only the beginning of the sequence of gene X. The\nunderlined sequence (from position 20-54) represents the promoter for gene X and the underlined and italicized\nsequence (from position 71-90) encodes the gene X ribosome binding (RBS) site. Transcription begins at and\nincludes the T/A base pair at position 60 (bold)\n\n1 10 20 30 40 50 60 70\nI--------I---------I---------I---------I---------I---------I---------I\n5' ATCGGTCTCGGCTACTACATAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTAGGCTACTAC\n3' TAGCCAGAGCCGATGATGTATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGATCCGATGATG\n\nPromoter\n\n80 90 100 110 120 130 140\n---------I---------I---------I---------I---------I---------I---------I\n5' CAGGTATCGGTCTGATCTAGCTAGCTTCTCTTCTCTCTCTCCCCCGCGGGGGCTGTACTATCATGCGTCG\n3' GTCCATAGCCAGACTAGATCGATCGAAGAGAAGAGAGAGAGGGGGCGCCCCCGACATGATAGTACGCAGC\n\nRBS\n\n150 160 170 180 190 200 210\n---------I---------I---------I---------I---------I---------I---------I\n5' TCTCGGCTACTACGTAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTCGGCTACTACGTAAA\n3' AGAGCCGATGATGCATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGAGCCGATGATGCATTT\n\na) What are the first 6 nucleotides of the mRNA from gene X?\n\nb) What are the first 4 amino acids encoded by gene X? (A codon chart is found on the final page)\n\nYou have found two different mutations of gene X, mutation 1 and mutation 2.\n\nc) In mutation 1, there is an insertion of the following three base pairs immediately after the C/G base pair at\nposition 100 (shown in bold).\n\n5' TGT 3'\n3' ACA 5'\n\ni) Would the mRNA expressed from this version of gene X be longer, shorter, or the same as that\nproduced from the normal gene X? Explain and if longer or shorter, indicate by how many in bases.\n\nii) If the mRNA can be translated, ...\n\n-\n...would you expect the protein to be longer, shorter, or the same as that produced from the\nnormal gene X? If longer or shorter, indicate by how many in amino acids.\n\n-\n...do you expect that the protein produced will have the same function as the normal protein X?\nExplain your thinking.\n\nQuestion 2, continued\n\nThis is the same sequence as shown on the previous page. It is repeated for your convenience.\nBelow are 210 consecutive base pairs of DNA that includes only the beginning of the sequence of gene X. The\nunderlined sequence (from position 20-54) represents the promoter for gene X and the underlined and italicized\nsequence (from position 71-90) encodes the gene X ribosome binding (RBS) site. Transcription begins at and\nincludes the T/A base pair at position 60 (bold)\n\n1 10 20 30 40 50 60 70\nI--------I---------I---------I---------I---------I---------I---------I\n5' ATCGGTCTCGGCTACTACATAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTAGGCTACTAC\n3' TAGCCAGAGCCGATGATGTATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGATCCGATGATG\n\nPromoter\n\n80 90 100 110 120 130 140\n---------I---------I---------I---------I---------I---------I---------I\n5' CAGGTATCGGTCTGATCTAGCTAGCTTCTCTTCTCTCTCTCCCCCGCGGGGGCTGTACTATCATGCGTCG\n3' GTCCATAGCCAGACTAGATCGATCGAAGAGAAGAGAGAGAGGGGGCGCCCCCGACATGATAGTACGCAGC\n\nRBS\n\n150 160 170 180 190 200 210\n---------I---------I---------I---------I---------I---------I---------I\n5' TCTCGGCTACTACGTAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTCGGCTACTACGTAAA\n3' AGAGCCGATGATGCATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGAGCCGATGATGCATTT\n\nd) In mutation 2, there is an insertion of the following four base pairs immediately after the A/T base pair at\nposition 130 (shown in bold).\n\n5' ATGT 3'\n\n3' TACA 5'\n\ni) Would the mRNA expressed from this version of gene X be longer, shorter, or the same as that\nproduced from the normal gene X? Explain and if longer or shorter, indicate by how many in bases.\n\nii) If the mRNA can be translated,...\n-\n...what are the first four amino acids produced?\n\n-\n...would you expect the protein to be longer, shorter, or the same as that produced from the\nnormal gene X? If longer or shorter, indicate by how many in amino acids.\n\n-\n...do you expect that the protein produced will have the same function as the normal protein X?\nExplain your thinking.\n\n__\n_________\nQuestion 3\nYou have discovered a new virus that contains only RNA as its genetic material. Curious as to how this virus\nworks, you infect host cells with this virus and discover that after infection, you find that the host cell makes lots\nof viral RNA molecules and various viral proteins. Upon further examination, you discover that the host genome\nnow encodes viral proteins.\na) What type of virus you have discovered.\nb) Outline the steps of the information flow for this virus by filling in the blanks below. Each arrow represents a\nprocess, for example, copying of DNA from a DNA template. Circle the arrow that represents a process not\nfound naturally in the host cell.\nc) There is a human gene that encodes a protein identical to one of the proteins produced by the virus. You\nisolate a fragment of DNA that includes the shared gene, heat the fragment to separate the two DNA strands\nand allow the human DNA to base pair with the viral RNA. You find the following hybrid molecule using electron\nmicroscopy.\nRNA\n_______\ni) Label which strand is human DNA and which is viral RNA in the picture.\nii) Why can some regions form complementary base pairs, while other regions cannot?\niii) If you were to isolate mature mRNA from the human cell and allow it to base pair with the viral RNA,\nwould you see the same type of hybrid molecule? Explain your thinking.\nd) In an actively dividing, normal cell, indicate whether the following statements are true or false for the virus\ndiscussed above.\nTrue False\nRNA-dependent RNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nTrue False\nRNA-dependent DNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nTrue False\nDNA-dependent DNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nTrue False\nThe polymerase used by the virus to copy its genome forms a covalent bond between\na 5' phosphate and a 3' hydroxyl.\nTrue\nFalse\nThe polymerase used by the virus to copy its genome forms a covalent bond\nbetween an N-terminal amine and a C-terminal carboxyl.\nTrue False\nPolymerization of the viral genome would be 5' 3'.\nTrue\nFalse\nPolymerization of the viral genome would be 3' 5'.\nTrue\nFalse\nDeoxyribonucleotides would be incorporated into the packaged viral genome.\nTrue\nFalse\nDi-deoxyribonucleotides would be incorporated into the packaged viral genome.\n\nQuestion 4\na) Below is a schematic of gene Y, which encodes protein Y. The promoter region is indicated by the dotted\nbox. Transcription begins immediately following the promoter.\nPromoter\nTranscriptional terminator\n5'\nExon 1\nIntron 1\nIntron 2\nExon 2\nExon 3\nPositions 200-203 = Start codon\nPositions 4800-4802 = Stop codon\n3'\n1 100\n5100 base pairs\n-\nThe transcript first produced by this gene would be approximately how many nucleotides long?\n-\nTwo different transcripts are produced from this gene, one is approximately 2000 nucleotides long,\nthe other is approximately 3000 nucleotides long. Explain how two different transcripts can be\nproduced from this gene.\n-\nAssume each transcript produces a protein. Given your answer above and the diagram, what is the\napproximate size of the two proteins produced from this gene?\nb) Assume gene Y was mutated such that the base pair found at position 200 was changed from an A/T to a\nG/C. Transcription and translation of the altered gene Y still occurs.\n-\nWould the first transcript be the same length, shorter or longer than the first transcript produced from\nthe wild type gene Y? Give all possible answers and explain your thinking.\n-\nWould the protein produced be the same length, shorter or longer than the protein produced from the\nwild type gene Y? Give all possible answers and explain your thinking.\nc) Now assume gene Y was mutated such that only the base pair found at position 2100 was changed from a\nC/G to an A/T. Transcription and translation of gene Y still occur.\n-\nWould the first transcript be the same length, shorter or longer than the first transcript produced from\nthe wild type gene Y? Give all possible answers and explain your thinking.\n-\nWould the protein produced be the same length, shorter or longer than the protein produced from the\nwild type gene Y? Give all possible answers and explain your thinking.\n\nQuestion 5\nYou design a summer class where you recreate experiments studying the lac operon in E. coli (see schematic\nbelow). In your experiments, the activity of the enzyme β-galactosidase (β-gal) is measured by including X-\ngal and IPTG in the growth media. X-gal is a lactose analog that turns blue when metabolized by β-gal, but it\ndoes not induce the lac operon. IPTG is another analog of lactose that is an inducer of the lac operon but is\nnot metabolized by β-gal.\nlacZ\nI\nPlac\nPi\nPromoter for\nO\nBinding site for CAP\nactivator protein\nGene encoding β-gal\nRepressor (I)\na) Which of the following would you expect to bind to b -galactosidase? Circle all that apply.\nLactose (or allolactose)\nX-gal\nIPTG\nb) Which of the following would you expect to bind to the lac repressor? Circle all that apply.\nLactose (or allolactose)\nX-gal\nIPTG\nAfter mutagenesis you find 7 mutants that never turn blue as shown in the table below. Each mutant has a\nsingle loss-of-function mutation.\nCell Type\nMedia\n+ glucose\nNo lactose + X-gal\n+ glucose\n+ lactose + X-gal\nNo glucose\nNo lactose + X-gal\nNo glucose\n+ lactose + X-gal\nWild type\nWhite colonies\nWhite colonies\nWhite colonies\nDark blue colonies\nMutants 1-7\nWhite colonies\nWhite colonies\nWhite colonies\nWhite colonies\nc) A single loss-of-function mutation in which component or components could produce the phenotype seen in\nthese mutants? List all that apply. Choose from:\nI, Pi, CAP binding site, O, lacZ, or Plac\nYou also find three mutants with the following phenotype. Each mutant has a single loss-of-function mutation.\nCell Type\nMedia\n+ glucose\nNo lactose + X-gal\n+ glucose\n+ lactose + X-\ngal\nNo glucose\nNo lactose + X-gal\nNo glucose\n+ lactose + X-gal\nWild type\nWhite colonies\nWhite colonies\nWhite colonies\nDark blue colonies\nMutants\nWhite colonies\nWhite colonies\nDark blue colonies\nDark blue colonies\nd) A single loss-of-function mutation in which component or components could produce the phenotype seen in\nthese mutants? List all that apply. Choose from:\nI, Pi, CAP binding site, O, lacZ, or Plac\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/4163c886f47315a7c2336ad1d815e40b_MIT7_01SCF11_exam4.pdf",
      "content": "Recombinant DNA Unit Exam\n\nQu\n\nestion 1\nRestriction enzymes are extensively used in molecular biology. Below are the recognition sites of two\nof these enzymes, BamHI and BclI.\n\na) BamHI, cleaves after the first G. Does cleavage by BamHI result in a 5' or 3' overhang? What is the\nsequence of this overhang?\n\n5' GGATCC 3'\n\n3' CCTAGG 5'\nb)\n\nBclI cleaves after the first T. Does cleavage by BclI result in a 5' or 3' overhang? What is the\nsequen\n\nce of this overhang?\n\n5' TGATC 3'\n\n3' ACTAGT 5'\nc)\n\nYou are given the DNA shown below.\n\n5' ATTGAGGATCCGTAATGTGTCCTGATCACGCTCCACG 3'\n3' TAACTCCTAGGCATTACACAGGACTAGTGCGAGGTGC 5'\n\ni) If this DNA was cut with BamHI, how many DNA fragment would you expect?\n\nWrite out the sequence of these double-stranded DNA fragments.\n\nii) If the DNA shown above was cut with BclI, how many DNA fragment would you expect?\n\nWrite out the sequence of these double-stranded DNA fragments.\n\nd)\n\nYou can ligate the smaller restriction fragment produced in (c, i) to the smaller restriction fragment produced\nin\n\n(c, ii). Write out the sequence of the resulting recombinant fragment.\n\ne)\n\nCould you cut the fragment from (d) with either BamHI or BclI? Explain.\n\nQuestion 2\n\nYou have isolated two different yeast strains, strain 1 and strain 2, each of which fails to grow in the\nabsence of arginine. You want to clone the wild type copy of the gene or genes that are mutated in\nstrain 1 and strain 2. To do so you plan to:\n1) Obtain fragments of the entire yeast genomic DNA\n2) Cut the chosen vector and ligate each fragment into a vector\n3) Use this pool of original and recombinant vectors to transform E. coli cells\n4) Select for E. coli cells that have obtained an original or recombinant vectors\n5) Screen for E. coli transformed with a recombinant plasmid\n6) Obtain recombinant plasmids from the library and transform yeast\n7) Clone by complementation the gene that can restore the yeast to arginine prototrophy.\n\na) To construct a yeast genomic library in E. coli that will allow you to successfully complete step 7\nabove, what would be the phenotype of the yeast you would choose as the donor for the genomic\nDNA?\n\nb) You choose the vector pBlue, shown below. Note that the cloning site lies within lacZ, the coding\nregion of the gene that encodes β-galactosidase. A cell that expresses β-galactosidase can take a\nsubstrate called X-gal and cleave the β-1,6 linkage to form a product that is bright blue. For each of the\nfollowing sequences found on pBlue, list the step or steps (1-7 above) for which that sequence is\nneeded and explain the role that sequence plays.\n\nCloning site\nOri\n(yeast)\nOri (E. coli)\npBlue\n\nc) You digest both the yeast genomic DNA and many copies of the vector with the BamH1 restriction\nenzyme. You mix the genomic fragments with the cut vectors and add DNA ligase. You then transform\nE. coli cells with the ligation mix and plate on solid agar medium. Describe what medium you could use\nto distinguish the bacterial colonies that carry a non-recombinant vector from the ones that carry a new\nrecombinant vector. Explain how this media would allow you distinguish the bacterial colonies that carry\na non-recombinant vector from the ones that carry a new recombinant plasmid.\n\nYeast ori:\n\nAmpr:\n\nE. coli ori:\n\nQuestion 2, continued\n\nd) You successfully create a yeast genomic library in E. coli cells, and obtain a clone that can restore\nthe yeast of strain 1 to arginine prototrophy. Would it be possible to use the same library to clone by\ncomplementation the gene that can restore the yeast of strain 2 to arginine prototrophy? Explain.\n\ne) You successfully identify a recombinant vector that restores yeast strain 1 to arginine prototrophy\n(clone 1). You are curious as to whether this recombinant vector can also rescue a bacterial cell that is\narg- (i.e., it is also an arginine auxotroph). Give 2 reasons why this recombinant vector will NOT work\nto rescue the arg- bacterial cell.\n\nf) Your friend suggests that you use her yeast cDNA library to attempt to restore an arg- bacterial cell\nto arginine prototrophy.\n\ni) Briefly describe how a cDNA library is different from a genomic library.\n\nii) You transform arg- bacterial cells with your friend's yeast cDNA library and find a clone,\nclone 2, that restores the cells to arginine prototrophy. What sequence NOT found on pBlue\nwould have been present on the vector that your friend used to create this library? Explain why\nthis sequence is required.\n\niii) You transform a different arg- bacterial strain with clone 2 and find that clone 2 does NOT\nrestore these cells to arginine prototrophy. What does this suggest about synthesis of arginine\nin bacterial cells? Explain.\n\nQuestion 3\nMillions of children that depend primarily on rice as a food staple become blind each year due to\nvitamin A deficiency. Humans cannot synthesize vitamin A and must have a supply of vitamin A or\nvitamin A precursor like beta-carotene in their diet. You want to create a strain of yeast that has the\ncomplete beta-carotene pathway so you can easily study the biochemistry of beta-carotene and vitamin\nA synthesis. You have a yeast strain that has 5 of the required 7 enzymes for beta-carotene synthesis.\nYou need to provide these yeast cells with the two missing enzymes, crt1 from bacteria and psy2 from\ndaffodils.\n\nTo clone the gene encoding crt1 into yeast, you plan to\n1. Cut bacterial genomic DNA.\n2. Clone it into an appropriate expression vector (vector 1) to create a library.\n3. Transform your yeast cells with the library.\n4. Select for yeast cells that have obtained any vector.\n5. Screen the selected colonies for production of the crt1 protein using an antibody.\n\na) The cloning vector chosen for this experiment has the gene leu1+, which encodes an enzyme\nneeded to synthesize the amino acid leucine and can be used as a selectable marker. To successfully\ncomplete step 4 above, what genotype and phenotype would your yeast strain be prior to\ntransformation?\n\nb) List the minimum features, in addition to the leu1+ gene, required in the vector for all steps 1-5\noutlined above to be successful. For any DNA sequence(s) listed, indicate what type of organism it\nwould come from.\n\nYou are also given some DNA sequence from the psy2 locus as shown below. To complete the\nproduction of the yeast strain capable of synthesizing beta-carotene, you decide to use Polymerase\nChain Reaction (PCR) to amplify the psy2 coding sequence based on the flanking sequence shown\nbelow.\n\nc) Circle the set of primer(s) could you use to amplify the entire psy2 coding sequence.\n\nSet 1:\n5' AGGCCG 3'\n5' GCCGGA 3'\nSet 2:\n5' TCCGGC 3'\n5' ACCGGG 3'\nSet 3:\n5' TCCGGC 3'\n5' GCCGGA 3'\n\nCGTCGACTCCGGC 3'\nGCAGCTGAGGCCG 5'\n\n5' TCCGGCGGAATTCCAAGGCCT\n3' AGGCCGCCTTAAGGTTCCGGA\n\npsy2\n\nQuestion 3, continued\n\nYou successfully amplify the psy2 coding sequence (repeated below for you) and plan to clone the\nPCR fragment into vector 2. The cloning sites available on this vector are shown below.\n\nStuI: 5'-AGG|CCT-3' SalI cuts: 5'-G|TCGAC-3' EcoRI: 5'-G|AATTC-3'\n3'-TCC|GGA-5' 3'-CAGCT|G-5' 3'-CTTAA|G-5'\n\nd) There are two different ways to insert the amplified psy2 coding sequence into vector 2. Give the\nrestriction enzyme(s) that you could use to cut the vector and the psy2 coding sequence for each of\nthese.\n\nCut plasmid with:\nCut psy2 loci with:\nOption 1:\n\nOption 2:\n\ne) Which of these options would you use to create a recombinant vector that could express psy2 in\nyeast? Why?\n\nQuestion 4\n\nThe following is the DNA sequence of the wild type allele of Gene Z that you want to amplify using the\npolymerase chain reaction (PCR).\n\n5'CTCGAGGTGAATATGAAAG----\n3'GAGCTCCACTTATACTTTC----\n------------CATTTGGCGCGTAATCGATA3'\n------------GTAAACCGCGCATTAGCTAT5'\n\na) If you amplify a DNA sequence through PCR what are the reaction components that you would\nabsolutely need? Briefly state the function of each of these components.\n\nb) Circle the set of primers from the options below, which you would use for PCR reaction in part (a)?\nSet 1: 5'TACACTTATACTTTC3' and 3'GTAAACCGCGCATTAG5'\n\nSet 2: 5'CTCGAGGTGAATAT3' and 3'CCGCGCATTAGCTAT5'\nSet 3: 5'GAGTTACACTTATAC3' and 3'TGGCGAGTAATCGATA5'\nGene Z\nSalI\nCGTCGACTCCGGC 3'\nGCAGCTGAGGCCG 5'\n\npsy2\nStart codon\n5' TCCGGCGGAATTCCAAGGCCT\n3' AGGCCGCCTTAAGGTTCCGGA\nPromoter\nStuI\nEcoRI\nVector 2\n\nQu\n\nestion 4, continued\nc) In the PCR reaction, you need a three-step reaction cycle, which results in a chain reaction that\nproduces an exponentially growing population of identical DNA molecules. Each step of a reaction\ncycle is performed at a specific temperature i.e. 95oC for Step 1, 55oC for step 2 and 70oC for Step 3.\nBriefly explain why the three steps are performed under different temperatures.\n\nd) You decide to determine the complete nucleotide sequence of Gene Z by DNA sequencing using\nfluorescent nucleotides.\n\n-\nWhich of the above nucleotides(s) (1/2/3) are used in DNA sequencing reaction? Circle all that\napply.\n\n-\nWhich of the above nucleotides(s) (1/2/3) would you fluorescently tag for DNA sequencing?\n\nQuestion 5\n\nYou are given a plasmid. In order to map this plasmid you set up a series of restriction digests and\nobtain the following results using agarose gel electrophoresis.\n\nM1 1 2 3 4 5 6 M2\n\n4.2Kb\n3.5Kb\n3.2Kb\n2.5Kb\n2.0Kb\n1.5Kb\n1.0Kb\n800b\np\n700b\np 600b\np\n500b\np 400b\np 300b\np 200b\np 100b\np\n\nLane\nDigest\nSize of fragments in bp\nBamHI and SmaI\n4200, 800\nSmaI and KpnI\n3200, 1500, 300\nKpnI and BglII\n2500, 1500, 1000\nBamHI and KpnI\n3500, 1000, 500\nKpnI\n3500, 1500\nBglII and BamHI\n3500, 1500\n\na) What is the approximate size of the plasmid?\n\nb) Add the SmaI, KpnI, BglII sites to plasmid map. On your map give the distances between each\nof the restriction sites.\n\n*M\n\n1 and M2 are DNA markers.\nBamHI\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT_7_01SCF11_exam3_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/6d518508492cd5eda610e3c04253aa51_MIT_7_01SCF11_exam3_sol.pdf",
      "content": "Solutions to Genetics Unit Exam\n\nQuestion 1\n\nYou are working with an ornamental fish that shows two color phenotypes, red or white. The color is controlled by\na single gene. These fish are hermaphrodites - meaning they can either (1) self-fertilize or (2) mate with another\nfish. You have three fish: fish 1, fish 2, and fish 3.\n\na) You set up the mating experiment #1 below using these fish. From the following statements check all that might\nbe true (that is, are consistent with the data, allowing for reasonable statistical fluctuations), given only the results\nof experiment #1.\n\nNumber of progeny with following phenotype\nExperiment\nRed\nWhite\n#1: Fish 2 (red) with Fish 3 (red)\n\n√ Fish 2 and fish 3 are homozygotes.\n√ The red phenotype is dominant to the white phenotype.\n√ The white phenotype is dominant to the red phenotype.\nO Both fish 2 and fish 3 are heterozygotes.\n√ Fish 2 is a homozygote, and fish 3 is a heterozygote.\n√ Fish 2 is a heterozygote, and fish 3 is a homozygote.\n\nb) You set up mating experiments #1 (same as above) and #2 below using these fish. From the following\nstatements check all that might be true (that is, are consistent with the data, allowing for reasonable statistical\nfluctuations), given both experiment #1 and experiment 2.\n\nNumber of progeny with following phenotype\nExperiment\nRed\nWhite\n#1: Fish 2 (red) with Fish 3 (red)\n#2: Fish 2 (red) with Fish 2 (red)\n\nO Fish 2 and fish 3 are homozygotes.\n√ The red phenotype is dominant to the white phenotype.\nO The white phenotype is dominant to the red phenotype.\nO Both fish 2 and fish 3 are heterozygotes.\nO Fish 2 is a homozygote, and fish 3 is a heterozygote.\n√ Fish 2 is a heterozygote, and fish 3 is a homozygote.\n\nc) You perform experiment #3 and obtain 400 progeny. Note that fish 2 is the same fish in all three experiments.\nIn the table below, list the phenotype or phenotypes you would see in the progeny. Then give the number of\noffspring expected with each phenotype.\n\nExperiment\n#3: Fish 1 (white) with Fish 2 (red)\n\nPossible Phenotypes\ntotal number showing this phenotype\n\nred\nwhite\n\nQuestion 1, continued\n\nWhile working further with this fish, you discover one other mutation (in a different gene) that leads to the\nrecessive phenotype of long dorsal fins. We now have two phenotypes:\nColor: red or white (described in part a). Alleles denoted by R and r.\nDorsal Fins: long (recessive) or short (dominant). Alleles denoted by D and d\n\n*each trait is controlled by a single gene. For the questions below, use the upper case letter for the allele\nassociated with the dominant phenotype. Use the lower case letter for the allele associated with the recessive\nphenotype.\n\nIn experiment A, you cross true-breeding white fish with short fins to true-breeding red fish with long fins and get\nall red fish with short fins. You then cross the F1 fish to true-breeding white fish with long fins.\n\nExperiment A: white fish with short fins X red fish with long fins\n\n(F1) red fish with short fins X white fish with long fins\n\nF2: ?\n\nd) You obtain 1000 F2 offspring. Assume that the color and fin loci are 5 cM apart. In the table below, list all the\npossible phenotypes seen in the F2 offspring. For each phenotype given, list all the possible genotypes seen in\nthe F2 offspring. Finally, give the number of offspring expected with each phenotype.\n\nPossible Phenotypes\nPossible Genotypes\nTotal F2 showing this\nphenotype\nred fish with short fins\nRrDd\nred fish with long fins\nRrdd\nwhite fish with long fins\nrrdd\nwhite fish with short fins\nrrDd\n\nQuestion 2\n\nYou are studying a genetically inherited trait. The pedigree for a family with this trait is shown below. This trait\nshows complete penetrance. Assume no new mutations.\n\nComplete each table below ONLY if that mode of inheritance is possible.\n\na) Could this trait be inherited in an Autosomal Dominant manner? _____NO\n\n______\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use A for the allele\nassociated with the dominant phenotype and a for the allele associated with the recessive phenotype.\n\nb) Could this trait be inherited in an Autosomal Recessive manner? _____YES______\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use A for the allele\nassociated with the dominant phenotype and a for the allele associated with the recessive phenotype.\nIndividual\npossible genotype or genotypes\nAa\nAa\nAa\naa\nAA or Aa\n\nc) Could this trait be inherited in an X-linked Recessive manner? _____NO______\nIf Yes, give all the possible genotype or genotypes for the individuals listed in the table below. Use XA for the\nallele associated with the dominant phenotype and Xa for the allele associated with the recessive phenotype.\nIndividual\npossible genotype or genotypes\n\nIndividual\npossible genotype or genotypes\n\nNote: carriers are not distinguished from non-carriers\nUnaffected male\nAffected male\nUnaffected female\nAffected female\n\nQuestion 3\n\nThe pathway for the breakdown of phenylalanine is as follows. There are six enzymes involved in this pathway.\nEnzyme A is encoded by gene A, enzyme B is encoded by gene B, etc. The genes involved in this pathway all lie\non different chromosomes and are thus unlinked to each other.\n\na) PKU is a human autosomal recessive genetic disorder where the inability to breakdown the amino acid\nphenylalanine and the resulting accumulation can cause neurological problems. What would be the genotype of\nan individual with PKU? Consider only the relevant gene and use the upper case letter for the allele associated\nwith the dominant phenotype, the lower case letter for the allele associated with the recessive phenotype.\nGenotype of individual with PKU = aa\n\nb) Alkaptonuria is a human autosomal recessive genetic disorder where the individual is missing the function of\nenzyme D. This results in the accumulation of a byproduct that is excreted in the urine. What byproduct\naccumulates in these individuals?\nHomogentisate accumulates.\n\nc) A woman with PKU who is also a carrier for Alkaptonuria marries a man with Alkaptonuria who is also a carrier\nfor PKU.\n\ni) What would be the genotype of the woman? aaDd\nWhat would be the genotype of the man? Aadd\n\nii) What are the chances that their child will appear phenotypically normal? Explain your answer or show\nyour work.\n25% will be AaDd. (see below) because both traits are recessive, these children will appear normal.\n\niii) What are the chances that their child will show a both the PKU and the Alkaptonuria phenotype?\nExplain your answer or show your work.\n0%. Although 25% will have the genotype aadd. (see below) these children will show only the PKU\nphenotype because the PKU phenotype is epistatic to the alkaptonuria phenotype.\n\nAd\nad\n\naD\nAaDd\naaDd\nad\nAadd\naadd\n\nPhenylalanine\nTyrosine\np-‐hydroxyphenylpyruvate\nHomogentisate\n4-‐maleyacetoacetate\nFumerate + Acetoacetate\n4-‐fumeryacetoacetate\nenzyme A\nenzyme B\nenzyme C\nenzyme D\nenzyme E\nFu\nin t\nr\nh\nther\ne Kr\ndegr\nebbs\nadat\nCyc\ni\nl\non\ne\nor use\nenzyme F\n\nQuestion 4\n\nYou are studying development in a new species of fruit fly, Drosophila mit-ensis, and you find a fly that has curly\nwings as seen here:\n\nCurly Wings\nNormal Wings\n\na) The Curly wings phenotype is due to a mutation at a single locus. Assume that you have flies that are true-\nbreeding for the curly wing phenotype (cur/cur) and flies that are true-breeding for normal wings (+/+).\n\n-\nPropose a genetic cross to determine whether the mutant phenotype is dominant or recessive, and list\nthe genotype(s) of the F1 offspring you would obtain from this cross. Use cur for the allele associated\nwith curly wings and + for the allele associated with normal wings.\n\nP0: cur/cur X +/+\n\nF1: cur/+\n\n-\nWhat phenotype(s) would you expect to see in the F1 generation if the mutant phenotype is dominant? In\nwhat proportion would you see these phenotypes?\n\n100% curly wings\n\n-\nWhat phenotype(s) would you expect to see in the F1 generation if the mutant phenotype is recessive? In\nwhat proportion would you see these phenotypes?\n\n100% normal wings\n\nYou perform the experiment and find that the curly wing phenotype is recessive. A friend of yours has been\nstudying a mutation that causes short antenna. The short antenna phenotype is recessive to the wild-type long\nantenna phenotype. You designate the mutant allele (ant) and the wild-type allele (+).\n\nYou set up the following crosses:\n\nCurly wings, long antenna\nNormal wings, short antenna\n\ncross 1:\ncur +\n+ ant\ncur +\nX\n+ ant\n\n⇓\n\nF1:\n\nNormal wings,\n\nlong antenna\n\ncross 2:\nNormal wings, long antenna\nCurly wings, short antenna\nX\n(F1 from cross 1)\n\nb) What type of cross is cross 2? A Test cross\n\nc) If the two genes are unlinked...\n\ni) What phenotypic classes do you expect to see from cross 2 and in what ratios?\nNormal wings, long antennae: curly wings, long antennae: Normal wings, short antennae: curly wings,\nshort antennae\n\n1 : 1 : 1 : 1\n\nii) Could these two genes be located on the same chromosome? Explain.\nYes these two genes can be located on the same chromosome, but far enough apart the recombination\nfrequency is 50%.\n\nQuestion 4, continued\n\nd) You perform cross 2, examine 1000 progeny and see that the genes are linked. In the table below, give the\ngenotypes and phenotypes for the parental and recombinant progeny.\n\nPlease note that you must use the following nomenclature. Use cur and + for the alleles of the wing gene. Use\nant and + for the alleles of the antennae gene.\n\nNumber of progeny\nGenotype\nPhenotype\n\ncur +\nCurly wings, long antennae\ncur ant\n\nParental\n431 + 429\n\n+ ant\nNormal wings, short antennae\ncur ant\n\ncur ant\nCurly wings, short antennae\ncur ant\n\nRecombinant\n69 + 71\n\n+ +\nNormal wings, long antennae\ncur ant\n\ne) What is the recombination frequency between the wing and the antennae genes?\n69 + 71/1000 = 14%\n\nQuestion 5\n\nYou are studying a genetically inherited disease. The pedigree for a family with this disease is shown below.\nAssume 1) the disease phenotype shows complete penetrance and 2) the disease allele is present at a high\nfrequency in the population.\n\na) Circle all possible modes of inheritance that are consistent with this disease and assumptions 1 and 2.\n\nAutosomal dominant\nAutosomal recessive\n\nX-linked dominant\n\nX-linked recessive\n\nY-linked\n\n*Now assume that individual 8 does not carry any disease alleles. Complete the remainder of this question based\non this information.\nUse the genotypes +/-, +/+, or -/- for autosomal traits.\nUse the genotypes X+Y, X-Y, X+X-, X-X- or X+X+ for X-linked traits.\nUse the genotypes XY+ or XY- for Y-linked traits.\n*In all cases, + indicates the wild-type allele and - the mutant allele.\n\nb) Give all possible genotypes for the following individuals below.\n\nindividual 2 X+\n-\n-\nX\n\n-\nindividual 4 X- Y\n\nUnaffected male\nAffected male\nUnaffected female\naffected female\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/7907dbf23243cc924afb6150c76bf5d5_MIT7_01SCF11_exam1_sol.pdf",
      "content": "Solutions for Biochemistry Unit Exam\nb) The molecule drawn above is a monomer found in\nProteins\nc) Below is a pentose found in RNA. On the diagram circle the hydroxyl that differs between ribonucleotides and\ndeoxyribonucleotides.\nOH\nQuestion 1\na) An example of a structural representation is shown in the adjacent box.\nH - C - C -H\nH\nH\nH\nH\nDraw a structural representation of the amino acid, Aspartic acid, which has the\nside chain of: CH2COOH.\nOH\nOH\nCH2\nH\nH\nH\nH\nO\nOH\nd) You find an organism that lives in thermal pools with temperatures as high as 160 °F. You find that many of this\norganism's proteins have a high percentage of cysteine. Briefly explain why this might be the case.\nThe amino acid cysteine has a terminal S - H group on the side chain. Under the appropriate conditions,\nadjacent cycteines can for disulfide bonds. A disulfide bond is a covalent interaction, and these strong covalent\nbonds can stabilize the tertiary and quaternary structure at higher temperatures. Because the protein structure\ndictates the function, these bonds would be important for an organism that lives in thermal pools.\ne) To the right is an iconic view of a phospholipid.\n-\nList what atoms are found in a phospholipid molecule represented by the boxed region of this schematic.\nDescribe the properties associated with this region.\nYou would find P, O. You would also N, C and H. The phosphate groups and the nitrogens are polar\nand/or charged, which gives this region hydrophilic properties.\n-\nList what atoms are found in a phospholipid molecule represented by the shaded region of this schematic.\nDescribe the properties associated with this region.\nYou would find C and H. The hydrocarbon chains are non-polar, which gives this region hydrophobic\nproperties.\n\nH\n\nQuestion 1, continued\nf)\nATP\n*\n*\nH\n-\na) Box the part that is added to a growing chain of nucleic acid.\nb) Star the atom(s) that can form a hydrogen bond with the complementary nitrogenous base.\nc) Circle the part of the molecule that decreases the stability of RNA as compared to DNA.\nd) Draw an arrow to the part of this molecule that you would modify to prevent further elongation. Indicate what\nchange you would make next to the arrow drawn.\nQuestion 2\nShown below is the structure of Drug 1, that binds to the E. coli ribosome. Indicate whether each circled region\ncould possibly form ionic bonds, hydrogen bonds, or hydrophobic interactions with another molecule by filling out\nthe table below. Fill in the table with \"yes\" if that type of bond is possible, \"no\" if it is not.\nO\nCH\nC\nHN\nO\nO -\nH2\nN\nH\nC\nO\n(iii)\n(iv)\nCH3\nCH2\nCH3\n(i)\n(ii)\nCH3\na)\nPart\nCould this part form\nionic bonds\nCould this part form\nhydrogen bonds\nCould this part be involved in a\nhydrophobic interaction\n(i)\nyes\nyes\nno\n(ii)\nno\nyes\nno\n(iii)\nno\nno\nyes\n(iv)\nno\nno\nyes\n\nQuestion 2, continued,\nA representation of the drug bound to the E. coli ribosome is shown below. Three amino acids of the ribosome\nthat are important for binding are shown. If this drug can bind to different bacterial ribosomes, it may be useful as\nan antibiotic. The ability of this drug to bind to the ribosomes of two different species is examined. The drug binds\nto the ribosome of species 1, but does not bind to the ribosome of species 2.\nO\nCH\nC\nHN\nO\nO -\nH2\nN\nH\nC\nO\n(iii)\n(iv)\nCH3\nCH2\nCH3\n(i)\n(ii)\nCH3\nLys 101\nLeu 312\nAsn 231\nRibosome\nFor your information:\nAmino acid\nSide chain\nIle\nCHCH3CH2CH3\nVal\nCHCH3CH3\nAsn\nCH2CONH2\nGlu\nCH2CH2COO-\nLys\n(CH2) 4NH3+\nSer\nCH2OH\nLeu\nCH2CHCH3CH3\nArg\n(CH2)3NHC(NH2)2+\nb) The table shows the differences between the ribosomes. Given this information, complete the table indicating\nwhich would be from species 1 (drug binds) and which would be from species 2 (drug does not bind).\nRibosome from:\nAmino acid found at\nE. coli\nLys\nAsn\nLeu\nSpecies 2\nGlu\nSer\nVal\nSpecies 1\nArg\nGlu\nIle\nc) What specific amino acid or amino acids prevents the ribosome from species 2 from binding Drug 1?\nThe glutamic acid at position 101.\nd) In terms of the specific non-covalent interactions, explain why the ribosome from species 2 will NOT bind Drug\n1, but the ribosomes from E. coli and species 1 will.\nThe ribosomes of E. coli and species 1 have positively charged amino acids (lysine and arginine, respectively), at\nposition 101. Hence both can form an ionic bond with the carboxyl of drug 1. The glutamic acid at position 101\nin species 2 is negatively charge and will repel the carboxyl of drug 1 and prevent binding.\n\nQuestion 3\nReaction 1)\nA\nB, where !G' = +2\na) The energy profile for the reaction 1 is drawn on the axes below.\n-\nLabel A, B, and !G' on the graph below.\n-\nWhat is the value for the energy of activation?\nThe energy of activation for the forward reaction is 3, The energy of activation for the reverse reaction is 1.\nFree energy\nA\nB\n!G'\nCourse of reaction\nCompare reaction 1 (above) to reactions 2 and 3 (below).\nReaction 2) C\nD, where !G' = -3, Energy of activation = +0.5\nReaction 3) E\nF, where !G' = +0.3, Energy of activation = +2\nb) Which of these reactions, 1, 2, or 3 is most likely to proceed in the forward direction in the absence of an\nenzyme? If you do not have enough information to answer this question, write \"Can't tell\" below. Explain your\nanswer.\nReaction 2 is most likely to proceed in the forward direction in the absence of an enzyme because it is exergonic\n(the !G is negative) and the energy of activation is low compared to the other two reactions.\nc) When an appropriate enzyme is added to each of these reactions, the rate of the reaction increases. Which\nreaction will proceed the fastest? If you do not have enough information to answer this question, write \"Can't tell\"\nbelow. Explain your answer.\nYou can't tell because the rate of a reaction is a function of the enzyme, not the thermodynamics. One enzyme\nmay be more efficient than another, regardless of the thermodynamics of the reaction, so you do not have enough\ninformation to answer the question.\nd) Assume that you have a reaction X\nY where !G = 0 and the energy of activation = +0.6 kcal/mole. In\na cell, you find that the reaction proceeds almost exclusively in the forward direction. Explain why this might be\nthe case.\nIn a cell, the product can be used as soon as it is produced. This consumption of the product prevents the\nreverse reaction for occurring and drives the reaction in the forward direction.\n\nQuestion 3, continued\n\nEnzyme 1 carries out the reaction: W - X + Y. There are three regions where enzyme 1 interacts with substrate\nW (another protein) to facilitate the conversion of W into X and Y.\nRegion 1 is stabilized by hydrophobic interactions between the side chains of the amino acids found on the\nenzyme and substrate.\nRegion 2 is stabilized by hydrogen bonds between the side chains of the amino acids found on the enzyme\nand substrate.\nRegion 3 is stabilized by ionic bonds between the side chains of the amino acids found on the enzyme and\nsubstrate.\ne) You have the following pairs of amino acids. For each pair given, list in which region (1, 2, or 3) this pair would\nact to stabilize the interaction of enzyme 1 with substrate A. If the pair could be found in more than one region,\nlist all that apply. If the pair would not be found in any region write in the word NONE.\npair\nAmino acid on\nenzyme\nAmino acid on substrate\nIn what region or regions would\nthe pair be found?\nalanine\nleucine\narginine\nisoleucine\nNONE\nserine\nmethionine\nNONE\nthreonine\nserine\nlysine\narginine\nNONE\nglutamine\nasparagine\nproline\nvaline\naspartic acid\nlysine\nQuestion 4\nYou inoculate two test tubes with the same amount of identical growth medium and with the same number of\nidentical yeast cells and grow these cells under identical conditions except for the presence or absence of\noxygen.\na) After 12 hours, all of the glucose in each culture has been consumed. You determine the number of total cells\nfound in each culture and find that one culture has more cells than the other.\n-\nWhich culture would have the greater cell density, the one grown aerobically or the one grown\nanaerobically?\nAerobic\n-\nExplain why the culture you chose above can make more cells with the same amount of glucose than the\nother culture.\nFor a cell to grow and divide, it needs a large supply of ATP. The aerobic culture will perform respiration,\nwhich produces about 36 ATP/glucose. The anaerobic culture will ferment which gives 2 ATP/glucose.\nThus there is more energy to make more yeast cells in aerobic conditions.\nb) The cells of both cultures convert glucose to pyruvate via glycolysis, and then further metabolize pyruvate.\n-\nAre the cells of both cultures able to obtain the same amount of ATP from glycolysis? Explain.\nYes, glycolysis does not require oxygen, and give a net 2 ATP regardless. The difference in energy\nproduction is determined by what happen after glycolysis, i.e., respiration or fermentation.\n-\nUnder anaerobic conditions, the carbon from pyruvate will ultimately be found in which molecule?\nLactic acid or ethanol\n-\nUnder aerobic conditions, the carbon from pyruvate will ultimately be found in which molecule?\nCO2\n\nQuestion 4, continued\nc) Under aerobic conditions, when glucose is metabolized some of the energy is used to reduce NAD+ to NADH +\nH+ . In the mitochondria, NADH donates its electrons to NADH-Q reductase, and from there the electrons move\nthrough the electron transport chain.\n-\nExplain why this process requires aerobic conditions.\nEach consecutive protein in the electron transport chain is more electronegative than the last. The final\nelectron acceptor is oxygen, which is highly electronegative.\n-\nBriefly describe how the transfer of electrons from one protein to another in the electron transport chain\nresults in the production of ATP.\nAs the electrons pass from one protein to another, H+ ions pass across the membrane to form a charge\nand concentration gradient . H+ ions of the gradient flow down the charge and concentration gradient\nthrough ATP synthase. ATP synthase can use the stored energy to make ATP from ADP.\nd) In oxygenic photosynthesis, electrons from the cholorphyll found in photosystem II are donated to the primary\nelectron carrier. How are the donated electrons replaced?\nThe electrons are replace by splitting water, which generates the O2.\ne) Anoxygenic photosynthetic organisms make ATP using an electron transport chain, but do not produce O2 as a\nwaste product. What is a common source of electrons for the conversion of NADP+ to NADPH for in this type of\norganism?\nMany highly reduced compounds whose redox potential will allow transfer of electrons to NADP+ could serve as a\nsource of electron. One common compound is H2S.\nf) Circle all of the metabolic processes that occur in organisms that perform oxygenic photosynthesis.\nGlycolysis\nCitric acid Cycle\nOxidative phosphorylation\nCalvin Cycle\nCyclic photophosphorylation\nNon-cyclic photophosphorylation.\ng) Both respiration and photosynthesis are evolutionarily conserved. Based upon the current understanding of\nhow life on earth evolved, which of these processes likely evolved first? Justify your answer in the space below.\nIt is believed that prebiotic earth had an atmosphere that lacked oxygen. The first cells were anaerobic and likely\nabsorbed free organic compounds from the primordial seas. At some point, free organic compounds were\nlimiting, and cells needed a way to produce them. Photosynthetic organisms used H2S as a source of electrons to\nproduce energy rich carbon compounds. At some point, photosynthetic organisms developed the ability to use the\nhighly abundant H2O instead of H2S as a source of electrons, which released oxygen. The seas became\nsaturated with O2, O2 began oxidizing the iron on land, and finally O2 began accumulating in the atmosphere. Not\nuntil significant O2 began accumulating, could respiration evolve.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/7440ab80be6bc7dbe2d2509d4d630a3f_MIT7_01SCF11_exam2_sol.pdf",
      "content": "Solutions to Molecular Biology Unit Exam\n\nQuestion 1\n\nConsider the following origin of replication that is found on a chromosome. The sequence of region 1 is shown\nbelow.\n\nRegion 1: 5'...CTGACTGACA...3'\n3'...GACTGACTGT...5'\n5'\n3'\n5'\n3'\nRegion 1\nori\ntop\nbottom\n\na) Within Region 1, which strand will be the template for leading strand synthesis, the top or the bottom?\nThe bottom strand will be the template for leading strand synthesis.\n\nb) If we assume that a lagging strand fragment is made from region 1, what will be its sequence?\n5' T G T C A G T C A G 3'\n\nc) You examine DNA replication in an E. coli mutant, which has a partially defective DNA polymerase. In vitro\nexperiments using the mutant DNA polymerase gives an error rate of 10-3, as compared to the expected error\nrate of 10-6. Which of the following activities is the mutant polymerase likely to be missing, as compared to\nthe normal polymerase? Circle all that apply.\n5'3' polymerase\n\n3'5' exonuclease\n5'3' exonuclease\n\n3'5' polymerase\n5'3' recombinase\n\n3'5' recombinase\n\nd) Below is a schematic of the molecule that inserts the fourth amino acid (a trytophan) into the mutant\npolymerase. A codon chart is found on the final page of the exam.\n\ni) This schematic represents a tRNA\n\nii) On the schematic, give the nucleotides of the anticodon.\n\nTrp\n⏐ ⏐ ⏐\nO\n- O\nO\nP\nO -\nC C A\n\nQuestion 2\n\nBelow are 210 consecutive base pairs of DNA that includes only the beginning of the sequence of gene X. The\nunderlined sequence (from position 20-54) represents the promoter for gene X and the underlined and italicized\nsequence (from position 71-90) encodes the gene X ribosome binding (RBS) site. Transcription begins at and\nincludes the T/A base pair at position 60 (bold)\n\n1 10 20 30 40 50 60 70\nI--------I---------I---------I---------I---------I---------I---------I\n5' ATCGGTCTCGGCTACTACATAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTAGGCTACTAC\n3' TAGCCAGAGCCGATGATGTATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGATCCGATGATG\n\nPromoter\n\n80 90 100 110 120 130 140\n---------I---------I---------I---------I---------I---------I---------I\n5' CAGGTATCGGTCTGATCTAGCTAGCTTCTCTTCTCTCTCTCCCCCGCGGGGGCTGTACTATCATGCGTCG\n3' GTCCATAGCCAGACTAGATCGATCGAAGAGAAGAGAGAGAGGGGGCGCCCCCGACATGATAGTACGCAGC\n\nRBS\n\n150 160 170 180 190 200 210\n---------I---------I---------I---------I---------I---------I---------I\n5' TCTCGGCTACTACGTAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTCGGCTACTACGTAAA\n3' AGAGCCGATGATGCATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGAGCCGATGATGCATTT\n\na) What are the first 6 nucleotides of the mRNA from gene X?\n5' U A G G C U 3'\n\nb) What are the first 4 amino acids encoded by gene X? (A codon chart is found on the final page)\nN met arg arg leu C\n\nYou have found two different mutations of gene X, mutation 1 and mutation 2.\n\nc) In mutation 1, there is an insertion of the following three base pairs immediately after the C/G base pair at\nposition 100 (shown in bold).\n\n5' TGT 3'\n3' ACA 5'\n\ni) Would the mRNA expressed from this version of gene X be longer, shorter, or the same as that\nproduced from the normal gene X? Explain and if longer or shorter, indicate by how many in bases.\nThe insertion is after the promoter so the mRNA would be longer by 3 nucleotides.\n\nii) If the mRNA can be translated, ...\n\n-\n...would you expect the protein to be longer, shorter, or the same as that produced from the\nnormal gene X? If longer or shorter, indicate by how many in amino acids.\nThe protein would be the same as the normal protein because the insertion is before the start\ncodon.\n\n-\n...do you expect that the protein produced will have the same function as the normal protein X?\nExplain your thinking.\nThe protein produced is identical to the normal protein, so it will have the same structure and\nfunction.\n\nQuestion 2, continued\n\nThis is the same sequence as shown on the previous page. It is repeated for your convenience.\nBelow are 210 consecutive base pairs of DNA that includes only the beginning of the sequence of gene X. The\nunderlined sequence (from position 20-54) represents the promoter for gene X and the underlined and italicized\nsequence (from position 71-90) encodes the gene X ribosome binding (RBS) site. Transcription begins at and\nincludes the T/A base pair at position 60 (bold)\n\n1 10 20 30 40 50 60 70\nI--------I---------I---------I---------I---------I---------I---------I\n5' ATCGGTCTCGGCTACTACATAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTAGGCTACTAC\n3' TAGCCAGAGCCGATGATGTATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGATCCGATGATG\n\nPromoter\n\n80 90 100 110 120 130 140\n---------I---------I---------I---------I---------I---------I---------I\n5' CAGGTATCGGTCTGATCTAGCTAGCTTCTCTTCTCTCTCTCCCCCGCGGGGGCTGTACTATCATGCGTCG\n3' GTCCATAGCCAGACTAGATCGATCGAAGAGAAGAGAGAGAGGGGGCGCCCCCGACATGATAGTACGCAGC\n\nRBS\n\n150 160 170 180 190 200 210\n---------I---------I---------I---------I---------I---------I---------I\n5' TCTCGGCTACTACGTAAACGCGCGCATATATCGATATCTAGCTAGCTATCGGTCTCGGCTACTACGTAAA\n3' AGAGCCGATGATGCATTTGCGCGCGTATATAGCTATAGATCGATCGATAGCCAGAGCCGATGATGCATTT\n\nd) In mutation 2, there is an insertion of the following four base pairs immediately after the A/T base pair at\nposition 130 (shown in bold).\n\n5' ATGT 3'\n\n3' TACA 5'\n\ni) Would the mRNA expressed from this version of gene X be longer, shorter, or the same as that\nproduced from the normal gene X? Explain and if longer or shorter, indicate by how many in bases.\nThe insertion is after the promoter so the mRNA would be longer by 4 nucleotides.\n\nii) If the mRNA can be translated,...\n-\n...what are the first four amino acids produced?\nN met phe met arg C\n\n-\n...would you expect the protein to be longer, shorter, or the same as that produced from the\nnormal gene X? If longer or shorter, indicate by how many in amino acids.\nThe protein encoded by mutant 2 will be longer by 2 amino acids.\n\n-\n...do you expect that the protein produced will have the same function as the normal protein X?\nExplain your thinking.\nThis mutant protein is nearly identical to the normal protein. It is different in that it has two\nadditional amino acids at the very N terminus, but these two terminal amino acids are unlikely\nto change the overall tertiary structure of the protein, so it is unlikely that this insertion will\nchange the function of the protein.\n\nQuestion 3\nYou have discovered a new virus that contains only RNA as its genetic material. Curious as to how this virus\nworks, you infect host cells with this virus and discover that after infection, you find that the host cell makes lots\nof viral RNA molecules and various viral proteins. Upon further examination, you discover that the host genome\nnow encodes viral proteins.\na) What type of virus you have discovered.\nA Retrovirus.\nb) Outline the steps of the information flow for this virus by filling in the blanks below. Each arrow represents a\nprocess, for example, copying of DNA from a DNA template. Circle the arrow that represents a process not\nfound naturally in the host cell.\nRNA\nprotein\nDNA\nRNA\nc) There is a human gene that encodes a protein identical to one of the proteins produced by the virus. You\nisolate a fragment of DNA that includes the shared gene, heat the fragment to separate the two DNA strands\nand allow the human DNA to base pair with the viral RNA. You find the following hybrid molecule using electron\nmicroscopy.\nDNA\nRNA\ni) Label which strand is human DNA and which is viral RNA in the picture.\nii) Why can some regions form complementary base pairs, while other regions cannot?\nThe DNA contains introns that are not present in the viral RNA.\niii) If you were to isolate mature mRNA from the human cell and allow it to base pair with the viral RNA,\nwould you see the same type of hybrid molecule? Explain your thinking.\nThe mature human mRNA results from the processing of the original transcript. During processing, the\nintrons are spliced out. Because the two proteins are identical, you would expect that the two\nmolecules would be the same, so you would not see the type of hybrid molecule shown above.\nd) In an actively dividing, normal cell, indicate whether the following statements are true or false for the virus\ndiscussed above.\nTrue\nFalse\nRNA-dependent RNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nTrue\nTrue\nTrue\nTrue\nFalse\nFalse\nFalse\nFalse\nRNA-dependent DNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nDNA-dependent DNA polymerase is used at some point during the viral life cycle to\ncopy the viral genome.\nThe polymerase used by the virus to copy its genome forms a covalent bond between\na 5' phosphate and a 3' hydroxyl.\nThe polymerase used by the virus to copy its genome forms a covalent bond\nbetween an N-terminal amine and a C-terminal carboxyl.\nTrue False\nPolymerization of the viral genome would be 5' 3'.\nTrue\nFalse\nPolymerization of the viral genome would be 3' 5'.\nTrue\nFalse\nDeoxyribonucleotides would be incorporated into the packaged viral genome.\nTrue\nFalse\nDi-deoxyribonucleotides would be incorporated into the packaged viral genome.\n\nQuestion 4\na) Below is a schematic of gene Y, which encodes protein Y. The promoter region is indicated by the dotted\nbox. Transcription begins immediately following the promoter.\n5'\n3'\nPromoter\nExon 1\nIntron 1\nIntron 2\nExon 2\n5100 base pairs\nPositions 200-203 = Start codon\nPositions 4800-4802 = Stop codon\nTranscriptional terminator\nExon 3\n-\nThe transcript first produced by this gene would be approximately how many nucleotides long?\nThe transcript first produced by this gene would be approximately 5000 nucleotides long.\n-\nTwo different transcripts are produced from this gene, one is approximately 2000 nucleotides long,\nthe other is approximately 3000 nucleotides long. Explain how two different transcripts can be\nproduced from this gene.\nAlternative splicing could produce two different transcripts. One transcript could contain exons 1, 2\nand 3, the other could contain only exons 1 and 3.\n-\nAssume each transcript produces a protein. Given your answer above and the diagram, what is the\napproximate size of the two proteins produced from this gene?\nThe transcript contain all three exons would encode a protein beginning at the ATG at position 200\nand end at the stop codon. This is about 2600 nucleotides, which represents about 866 codons. SO\nthe two proteins expected would be about 866 amino acids long and about 533 amino acids long.\nb) Assume gene Y was mutated such that the base pair found at position 200 was changed from an A/T to a\nG/C. Transcription and translation of the altered gene Y still occurs.\n-\nWould the first transcript be the same length, shorter or longer than the first transcript produced from\nthe wild type gene Y? Give all possible answers and explain your thinking.\nThis mutation changes a single base pair well after the promoter, so it is unlikely to affect\ntranscription. The first transcript is expected to be the same length.\n-\nWould the protein produced be the same length, shorter or longer than the protein produced from the\nwild type gene Y? Give all possible answers and explain your thinking.\nThis mutation changes a single base pair, eliminating the start codon. It is impossible to tell what\naffect this will have on the protein. If there is another start codon that maintains the original reading\nframe, then the protein will be shorter. If there is another start codon that changes the reading frame,\nthen the protein will certainly be different. Because the location of the stop codon is also altered in\nthis alternative reading frame, the resulting protein might be longer or shorter or even the same.\nc) Now assume gene Y was mutated such that only the base pair found at position 2100 was changed from a\nC/G to an A/T. Transcription and translation of gene Y still occur.\n-\nWould the first transcript be the same length, shorter or longer than the first transcript produced from\nthe wild type gene Y? Give all possible answers and explain your thinking.\nThis mutation changes a single base pair well after the promoter, so it is unlikely to affect\ntranscription. The first transcript is expected to be the same length.\n-\nWould the protein produced be the same length, shorter or longer than the protein produced from the\nwild type gene Y? Give all possible answers and explain your thinking.\nThis mutation changes a single base pair of a single codon. There are two possibilities. If the new\ncodon still encodes an amino acid, then the resulting protein will be the same length. If the new codon\ncreates a stop codon, the resulting protein will be the shorter.\n\nQuestion 5\nYou design a summer class where you recreate experiments studying the lac operon in E. coli (see schematic\nbelow). In your experiments, the activity of the enzyme β-galactosidase (β-gal) is measured by including X-\ngal and IPTG in the growth media. X-gal is a lactose analog that turns blue when metabolized by β-gal, but it\ndoes not induce the lac operon. IPTG is another analog of lactose that is an inducer of the lac operon but is\nnot metabolized by β-gal.\nlacZ\nI\nPlac\nPi\nPromoter for\nRepressor (I)\nO\nBinding site for CAP\nactivator protein\nGene encoding β-gal\na) Which of the following would you expect to bind to b -galactosidase? Circle all that apply.\nLactose (or allolactose)\nX-gal\nIPTG\nb) Which of the following would you expect to bind to the lac repressor? Circle all that apply.\nLactose (or allolactose)\nX-gal\nIPTG\nAfter mutagenesis you find 7 mutants that never turn blue as shown in the table below. Each mutant has a\nsingle loss-of-function mutation.\nCell Type\nMedia\n+ glucose\nNo lactose + X-gal\n+ glucose\n+ lactose + X-gal\nNo glucose\nNo lactose + X-gal\nNo glucose\n+ lactose + X-gal\nWild type\nWhite colonies\nWhite colonies\nWhite colonies\nDark blue colonies\nMutants 1-7\nWhite colonies\nWhite colonies\nWhite colonies\nWhite colonies\nc) A single loss-of-function mutation in which component or components could produce the phenotype seen in\nthese mutants? List all that apply. Choose from:\nI, Pi, CAP binding site, O, lacZ, or Plac\nCAP binding site, Plac, lacZ\nYou also find three mutants with the following phenotype. Each mutant has a single loss-of-function mutation.\nCell Type\nMedia\n+ glucose\nNo lactose + X-gal\n+ glucose\n+ lactose + X-\ngal\nNo glucose\nNo lactose + X-gal\nNo glucose\n+ lactose + X-gal\nWild type\nWhite colonies\nWhite colonies\nWhite colonies\nDark blue colonies\nMutants\nWhite colonies\nWhite colonies\nDark blue colonies\nDark blue colonies\nd) A single loss-of-function mutation in which component or components could produce the phenotype seen in\nthese mutants? List all that apply. Choose from:\nI, Pi, CAP binding site, O, lacZ, or Plac\nI, Pi , O\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "MIT7_01SCF11_exam4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/3587be8a06f444db2f069c2f443f1838_MIT7_01SCF11_exam4_sol.pdf",
      "content": "Solutions for Recombinant DNA Unit Exam\n\nQu\n\nestion 1\nRestriction enzymes are extensively used in molecular biology. Below are the recognition sites of two\nof these enzymes, BamHI and BclI.\n\na) BamHI, cleaves after the first G. Does cleavage by BamHI result in a 5' or 3' overhang? What is the\nsequence of this overhang?\n\n5' GGATCC 3'\n\n3' CCTAGG 5'\n\nCl\n\n5' G\neavage by BamHI results in a 5' overhang as seen here: 3' CCTAG\nb)\n\nBclI c\n\nleaves after the first T. Does cleavage by BclI result in a 5' or 3' overhang? What is the\nsequence of this overhang?\n\n5' TGATCA 3'\n3' ACTAGT 5'\n5' T\nCl\n\neavage by BclI results in a 5' overhang as seen here:\n\n3' ACTAG\nc) You are given the DNA shown below.\n5' ATTGAGGATCCGTAATGTGTCCTGATCACGCTCCACG 3'\n3' TAACTCCTAGGCATTACACAGGACTAGTGCGAGGTGC 5'\n\ni)\n\nIf this DNA was cut with BamHI, how many DNA fragment would you expect?\n\nWrite out the sequence of these double-stranded DNA fragments.\n\n5' ATTGAG 3'\n\n5' GATCCGTAATGTGTCCTGATCACGCTCCACG 3'\n3' TAACTCCTAG 5'\n3' GCATTACACAGGACTAGTGCGAGGTGC 5'\n\nii) If the DNA shown above was cut with BclI, how many DNA fragment would you expect?\n\nWrite out the sequence of these double-stranded DNA fragments.\n\nd)\n\n5' ATTGAGGATCCGTAATGTGTCCT 3' 5' GATCACGCTCCACG 3'\n3' TAACTCCTAGGCATTACACAGGACTAG 5' 3' TGCGAGGTGC 5'\n\nYou can ligate the smaller restriction fragment produced in (c, i) to the smaller restriction fragment produced\n\nin (c, ii). Write out the sequence of the resulting recombinant fragment.\n5' ATTGAGGATCACGCTCCACG 3'\ne)\n\n3' TAACTCCTAGTGCGAGGTGC 5'\nCould you cut the fragment from (d) with either BamHI or BclI? Explain.\nNo, this fragment cannot be cut with either enzyme. The junction site is now:\n5' ...GGATCA... 3'\n3' ...CGTAGT... 5'\n\nQuestion 2\n\nYou have isolated two different yeast strains, strain 1 and strain 2, each of which fails to grow in the\nabsence of arginine. You want to clone the wild type copy of the gene or genes that are mutated in\nstrain 1 and strain 2. To do so you plan to:\n1) Obtain fragments of the entire yeast genomic DNA\n2) Cut the chosen vector and ligate each fragment into a vector\n3) Use this pool of original and recombinant vectors to transform E. coli cells\n4) Select for E. coli cells that have obtained an original or recombinant vectors\n5) Screen for E. coli transformed with a recombinant plasmid\n6) Obtain recombinant plasmids from the library and transform yeast\n7) Clone by complementation the gene that can restore the yeast to arginine prototrophy.\n\na) To construct a yeast genomic library in E. coli that will allow you to successfully complete step 7\nabove, what would be the phenotype of the yeast you would choose as the donor for the genomic\nDNA?\nYou would choose wild-type yeast or a yeast arginine prototroph.\n\nb) You choose the vector pBlue, shown below. Note that the cloning site lies within lacZ, the coding\nregion of the gene that encodes β-galactosidase. A cell that expresses β-galactosidase can take a\nsubstrate called X-gal and cleave the β-1,6 linkage to form a product that is bright blue. For each of the\nfollowing sequences found on pBlue, list the step or steps (1-7 above) for which that sequence is\nneeded and explain the role that sequence plays.\n\nc) You digest both the yeast genomic DNA and many copies of the vector with the BamH1 restriction\nenzyme. You mix the genomic fragments with the cut vectors and add DNA ligase. You then transform\nE. coli cells with the ligation mix and plate on solid agar medium. Describe what medium you could use\nto distinguish the bacterial colonies that carry a non-recombinant vector from the ones that carry a new\nrecombinant vector. Explain how this media would allow you distinguish the bacterial colonies that carry\na non-recombinant vector from the ones that carry a new recombinant plasmid.\nYou would plate on medium containing ampicillin which will kill any cell that did not obtain an original or\nrecombinant vector. In addition, the medium should contain X-Gal. If the cell has an original vector (i.e.,\nno insert in the BamHI site), the β-galactosidase gene will be functional and β-galactosidase will be\ncreated, resulting in blue colonies. If the cell has a vector with an insert in the BamHI site, the β-\ngalactosidase gene will be disrupted, and no β-galactosidase is made. These colonies will be white.\n\nYeast ori:\nStep 6, 7. Require the yeast origin for the\nvector to propagate in yeast.\n\nAmpr:\nStep 4, 5. Require AmpR to select for cells\nthat have taken up a vector.\n\nE. coli ori:\nStep 3-6. Require the bacterial origin for\nthe vector to propagate in bacteria.\n\nCloning site\n(yeast)\npBlue\nOri (E. coli)\nOri\n\nQuestion 2, continued\n\nd) You successfully create a yeast genomic library in E. coli cells, and obtain a clone that can restore\nthe yeast of strain 1 to arginine prototrophy. Would it be possible to use the same library to clone by\ncomplementation the gene that can restore the yeast of strain 2 to arginine prototrophy? Explain.\nYes. If the library is a yeast genomic library, it will likely contain the gene that may complement the\nmutation in strain 2.\n\ne) You successfully identify a recombinant vector that restores yeast strain 1 to arginine prototrophy\n(clone 1). You are curious as to whether this recombinant vector can also rescue a bacterial cell that is\narg- (i.e., it is also an arginine auxotroph). Give 2 reasons why this recombinant vector will NOT work\nto rescue the arg- bacterial cell.\nMany possible reasons:\n1. Yeast promoters don't work in bacteria.\n2. Bacteria cannot splice out introns (though some yeast strains have almost no introns).\n3. The yeast pathway may not be the same as the bacterial pathway. Or, different genes are\nrequired for the same job in different species.\n4. Many eukaryotic proteins have post-translational modifications.\n5. The mutation may be in a different gene.\n6. Proteins may be structurally different between yeast and bacterial version, despite being\nhomologs (evolutionarily related).\n\nf) Your friend suggests that you use her yeast cDNA library to attempt to restore an arg- bacterial cell\nto arginine prototrophy.\n\ni) Briefly describe how a cDNA library is different from a genomic library.\nPossible answers:\n\n1. cDNA library is generated from mRNA, so introns have already been spliced out.\n2. cDNA libraries lack the endogenous promoters found in the genome.\n3. One may have multiple cDNAs for the same gene due to alternative splicing.\n4. cDNA libraries will not contain genes that are not expressed in the cells used to generate\nthe cDNA library.\n\nii) You transform arg- bacterial cells with your friend's yeast cDNA library and find a clone,\nclone 2, that restores the cells to arginine prototrophy. What sequence NOT found on pBlue\nwould have been present on the vector that your friend used to create this library? Explain why\nthis sequence is required.\npBlue does not have a yeast promoter and one was not needed since the genomic insert\nalready contains the promoter for the endogenous gene. On the other hand, when making a\ncDNA library we need to include a yeast promoter since cDNA fragments don't contain\npromoters.\n\niii) You transform a different arg- bacterial strain with clone 2 and find that clone 2 does NOT\nrestore these cells to arginine prototrophy. What does this suggest about synthesis of arginine\nin bacterial cells? Explain.\nThe gene in clone 2 cannot complement the missing gene in the arg- bacterial strain.\n\nQuestion 3\nMillions of children that depend primarily on rice as a food staple become blind each year due to\nvitamin A deficiency. Humans cannot synthesize vitamin A and must have a supply of vitamin A or\nvitamin A precursor like beta-carotene in their diet. You want to create a strain of yeast that has the\ncomplete beta-carotene pathway so you can easily study the biochemistry of beta-carotene and vitamin\nA synthesis. You have a yeast strain that has 5 of the required 7 enzymes for beta-carotene synthesis.\nYou need to provide these yeast cells with the two missing enzymes, crt1 from bacteria and psy2 from\ndaffodils.\n\nTo clone the gene encoding crt1 into yeast, you plan to\n1. Cut bacterial genomic DNA.\n2. Clone it into an appropriate expression vector (vector 1) to create a library.\n3. Transform your yeast cells with the library.\n4. Select for yeast cells that have obtained any vector.\n5. Screen the selected colonies for production of the crt1 protein using an antibody.\n\na) The cloning vector chosen for this experiment has the gene leu1+, which encodes an enzyme\nneeded to synthesize the amino acid leucine and can be used as a selectable marker. To successfully\ncomplete step 4 above, what genotype and phenotype would your yeast strain be prior to\ntransformation?\nThe yeast strain would need to be leu1- and be unable to grow on media lacking leucine.\n\nb) List the minimum features, in addition to the leu1+ gene, required in the vector for all steps 1-5\noutlined above to be successful. For any DNA sequence(s) listed, indicate what type of organism it\nwould come from.\nRestriction enzyme sites, origin of replication from yeast, promoter from yeast\n\nYou are also given some DNA sequence from the psy2 locus as shown below. To complete the\nproduction of the yeast strain capable of synthesizing beta-carotene, you decide to use Polymerase\nChain Reaction (PCR) to amplify the psy2 coding sequence based on the flanking sequence shown\nbelow.\n\n5' TCCGGCGGAATTCCAAGGCCT\n3' AGGCCGCCTTAAGGTTCCGGA\n\nc) Circle the set of primer(s) could you use to amplify the entire psy2 coding sequence.\nSet 1:\n5' AGGCCG 3'\n5' GCCGGA 3'\nSet 2:\n5' TCCGGC 3'\n5' ACCGGG 3'\nSet 3:\n5' TCCGGC 3'\n5' GCCGGA 3'\n\nCGTCGACTCCGGC 3'\nGCAGCTGAGGCCG 5'\n\npsy2\n\nQuestion 3, continued\n\nYou successfully amplify the psy2 coding sequence (repeated below for you) and plan to clone the\nPCR fragment into vector 2. The cloning sites available on this vector are shown below.\n\nStuI: 5'-AGG|CCT-3' SalI cuts: 5'-G|TCGAC-3' EcoRI: 5'-G|AATTC-3'\n3'-TCC|GGA-5' 3'-CAGCT|G-5' 3'-CTTAA|G-5'\n\nd) There are two different ways to insert the amplified psy2 coding sequence into vector 2. Give the\nrestriction enzyme(s) that you could use to cut the vector and the psy2 coding sequence for each of\nthese.\n\nCut plasmid with:\nCut psy2 loci with:\nOption 1:\nStuI and Sal I\nStuI and Sal I\nOption 2:\nEcoRI and Sal I\nEcoRI and Sal I\n\ne) Which of these options would you use to create a recombinant vector that could express psy2 in\nyeast? Why?\nStuI and Sal I. This allows the insert to be positioned in the correct orientation with respect to the\npromoter.\n\nQuestion 4\n\nThe following is the DNA sequence of the wild type allele of Gene Z that you want to amplify using the\npolymerase chain reaction (PCR).\n\n5'CTCGAGGTGAATATGAAAG----\n3'GAGCTCCACTTATACTTTC----\n------------CATTTGGCGCGTAATCGATA3'\n------------GTAAACCGCGCATTAGCTAT5'\n\na) If you amplify a DNA sequence through PCR what are the reaction components that you would\nabsolutely need? Briefly state the function of each of these components.\nDNA primer - provides a 3' hydroxyl for the polymerization reaction\nThermostable DNA polymerase - enzyme to catalyze extension\nDNA template - the thing we want to amplify\ndNTPs - nucleotides used in the reaction\n(Optional) Buffer - keeps the reaction conditions constant over the long time\n\nb) Circle the set of primers from the options below, which you would use for PCR reaction in part (a)?\nSet 1: 5'TACACTTATACTTTC3' and 3'GTAAACCGCGCATTAG5'\n\nSet 2: 5'CTCGAGGTGAATAT3' and 3'CCGCGCATTAGCTAT5'\nSet 3: 5'GAGTTACACTTATAC3' and 3'TGGCGAGTAATCGATA5'\nGene Z\nSalI\nCGTCGACTCCGGC 3'\nGCAGCTGAGGCCG 5'\nA\nT\npsy2\nStart codon\nPromoter\nStuI\nEcoRI\nVector 2\n5' TCCGGCGGAATTCCAAGGCC\n3' AGGCCGCCTTAAGGTTCCGG\n\nQuestion , continued\nc)\n\nIn the PCR reaction, you need a three-step reaction cycle, which results in a chain reaction that\nproduces an exponentially growing population of identical DNA molecules. Each step of a reaction\ncycle is performed at a specific temperature i.e. 95oC for Step 1, 55oC for step 2 and 70oC for Step 3.\nBriefly explain why the three steps are performed under different temperatures.\nThe first step at 95oC ensures that the DNA strands are melted. The second step at 55oC is meant to\nensure that the template can anneal to the appropriate complementary sequence with specificity.\nLastly, 70oC is the optimal temperature for the thermal-stable DNA polymerase to work.\n\nd) You decide to determine t\nfluorescent nucleotides.\nhe complete nucleotide sequence of Gene Z by DNA sequencing using\n\n-\nWhich of the above nucleotides(s) (1/2/3) are used in DNA sequencing reaction? Circle all that\napply.\n-\nWhich of the above nucleotides(s) (1/2/3) would you fluorescently tag for DNA sequencing?\nYou would Tag nucleotide 3.\n\nQuestion 5\n\nYou are given a plasmid. In order to map this plasmid you set up a series of restriction digests and\nobtain the following results using agarose gel electrophoresis.\n\nM1 1 2 3 4 5 6 M2\n4.2Kb\n3.5Kb\n3.2Kb\n2.5Kb\n2.0Kb\n1.5Kb\n1.0Kb\n800b\np\n700b\np 600b\np\n500b\np 400b\np 300b\np 200b\np 100b\np\n\nLane\nDigest\nSize of fragments in bp\nBamHI and SmaI\n4200, 800\nSmaI and KpnI\n3200, 1500, 300\nKpnI and BglII\n2500, 1500, 1000\nBamHI and KpnI\n3500, 1000, 500\nKpnI\n3500, 1500\nBglII and BamHI\n3500, 1500\n\na) What is the approximate size of the plasmid?\nApproximately 5 kb\n\nb) Add the SmaI, KpnI, BglII sites to plasmid map. On your map give the distances between each\nof the restriction sites.\n\n*M\n\n1 and M2 are DNA markers.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.4amino.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/274df9f4b3cead031889d1a3448360d9_MIT7_01SCF11_1.4amino.pdf",
      "content": "STRUCTURES OF AMINO ACIDS at pH 7.0\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.5diagram.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/a13c62cd30232e7b4e6f42d9b10fddcf_MIT7_01SCF11_2.5diagram.pdf",
      "content": "glucose lactose\noperator\n(repressor binding site)\nPromoterZYA\nlacZ\nlacY\nlacA\ncrp\nlacI\nrepressor\nactive\nactivator\ninactive\nPromoterI\nPromotercrp\n+ -\nmRNA\nmRNA\nactivator\nbinding site\npolymerase\nRNA\npolymerase\nRNA\noperator\n(repressor binding site)\nPromoterZYA\nlacZ\nlacY\nlacA\ncrp\nlacI\nrepressor\nactive\nrepressor\nlactose\ninactive\nactivator\ninactive\ncAMP\nactivator\nactive\nPromoterI\nPromotercrp\nmRNA\nmRNA\nmRNA\nLacZ\n(βgal)\nLacY\nLacA\nactivator\nbinding site\npolymerase\nRNA\npolymerase\nRNA\nrepressor\nactive\ncan metabolize lactose!\ncAMP+\n- +\nlactose\n+\ncAMP\nactivator\nactive\npolymerase\nRNA\nDNA\nDNA\nThe lac operon: a model of gene regulation in E. coli\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_3.1terms.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/13aaf4b79c5d93421a12040f3fad06de_MIT7_01SCF11_3.1terms.pdf",
      "content": "Terms and Definitions:\nGene: Discrete particle/factor (gene) of inheritance. A segment of DNA\nencoding a protein.\nChromosome: A very long piece of double-stranded DNA. Many different genes\nare found on each chromosome.\nLocus or loci: A particular place or location along a chromosome. Can be a\ngene or other DNA sequence.\nAllele: Alternative forms of gene\nGenotype: The combination of alleles that an individual has\nPhenotype: A trait or appearance\nHeterozygote: Individual with different alleles\nHomozygote Individual with same alleles\nPure-breeding: An individual or strain that is homozygous for a particular gene.\nDominant versus recessive:\nPlease note that these terms should be applied only to phenotypes, not to alleles!\nPhenotype 1 is dominant to phenotype 2 if the heterozygote has phenotype 1.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT_7_01SCF11_3.4recprob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/c2b922885acce04edfaca18ba410f636_MIT_7_01SCF11_3.4recprob.pdf",
      "content": "Help session practice problem\nYou cross a series of fruit flies that are homozygous for six different mutations, each of which\ncause a recessive mini-fly phenotype. You score the phenotype of the resulting F1 progeny as\nfollows.\na/a\nb/b\nc/c\nd/d\ne/e\nf/f\na/a\nX\nmini\nnormal\nnormal\nnormal\nmini\nb/b\nmini\nX\nnormal\nnormal\nnormal\nmini\nc/c\nnormal\nnormal\nX\nnormal\nmini\nnormal\nd/d\nnormal\nnormal\nnormal\nX\nnormal\nnormal\ne/e\nnormal\nnormal\nmini\nnormal\nX\nnormal\nf/f\nmini\nmini\nnormal\nnormal\nnormal\nX\ni) Place the six mutations into complementation groups.\nii) Are mutations b and c in the same gene or in different genes? ________________\niii) You cross a homozygous \"g/g\" mutant animal to a/a and b/b animals. Both crosses yield mini-\nflies. What is your conclusion?\niv) Another student in the lab tells you that she has found that g and d are two different alleles of\nthe same gene. What is something about mutation g that would explain this discrepancy?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.1prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/809cc567d9342d195b0dcda47fcd3a87_MIT7_01SCF11_1.1prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 1: Types of Organisms, Cell Composition\nQuestion 1\nYou are given four test tubes, each tube contains cells from a different organism. One tube\ncontains bacterial cells, one contains yeast cells (eukaryotic), one contains human cells and the\nlast contains insect cells. Can you identify the cells from each tube if you are given a light\nmicroscope? Explain your answer.\nQuestion 2\nWhich of the following sequences is the best representation of the organizational hierarchy (from\ncomplex to simple) found in an individual animal?\nBrain, Cerebellum, Nerve cell, Nervous tissue\nCerebellum, Nervous tissue, Molecule, Cell\nOrganism, Organ system, Tissue, Cell, Organ\nNervous system, Nerve cell, Brain, Cerebellum\nNervous system, Cerebellum, Cell, Molecule\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.2prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/7b1fe7c46ccbc104f8a3080310d14d5a_MIT7_01SCF11_1.2prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 2: Covalent Bonds, Hydrogen Bonds\nQuestion 1\nConsider the following carbohydrate.\na) Name each bond or interaction that is circled in the schematic above. Explain why you\nselected these options. Choose from polar covalent, nonpolar covalent, ionic, hydrophobic,\nvan der Waals.\n- Bond #1 (C-C):\n- Bond #2 (C-OH):\nb) Would you expect this polymer to be soluble in an aqueous environment? Explain your\nanswer.\nc) What type of bonds or interactions can occur between two such polymers? Choose from:\ncovalent, hydrogen, hydrophobic, ionic, van der Waals. Explain your answer.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.3prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/41d1c1f850caeebb8ba7e32830c9da55_MIT7_01SCF11_1.3prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 3\nQuestion 1\nThe following structure is found in many biological systems.\nH3C\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2 O\nO\nC\nH2\nH3C\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2\nC\nH2 O\nO\nCH\nO\nP\nO\nO\nO\na) Name the molecule diagramed above.\nb) Where are these molecules found in a living cell, and what purpose do they serve?\nc) This molecule is sometimes drawn like this:\n-\nIf you were to add many of these molecules to a glass of water shown below, draw one of three\nconfigurations these molecules would assume.\n-\nWhat is the name of your configuration?\nd) Explain briefly why these molecules form the structure you have drawn.\ne) Another class of biological polymers contains phosphate. Draw another biological molecule that contains\nphosphate.\nf) What is the function of this molecule?\n\nQuestion 2\nBelow is a segment of a cellulose molecule. A microfibril of cellulose is composed of about 80 molecules that lie\nparallel to each other and close together.\nWhat type of bond holds the parallel fibers together?\nQuestion 3\na) Is the following a polymer of DNA or RNA? Explain how you can determine this.\nO\nCH2\nO\nP\nO\nN\nN\nN\nN\nNH 2\nO\nH\nH\nO-\n-\nH\nH\nadenine\nH\nO\nO\nO\nP\nO\n-\nO\nH\nH\nO\nH C\nH\nH\nthymine\nH\nO\nP\nO\nO\n-\nO\nH\nH\nO\nH C\nHO\nH\nH\nH\nN\nHN\nO\nN\nN\nN\nN\nNH2\nadenine\nCH 3\nb) Which of the following arrangements is possible in an RNA molecule? The small lines\nrepresent\nHydrogen bonds.\nB\nA\nC\n5'\n3'\n3'\n5'\n5'\n3'\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.4prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/5e5e88adbc3c016d3f285f750b586537_MIT7_01SCF11_1.4prob.pdf",
      "content": "Practice Problems for Biochemistry\n\n, Session 4:\n\nProteins, Lev\n\nels of Structure, Non-\n\nCovalent Forces\nQuestion 1\nYou have discovered a new enzyme, enzyme E, which breaks down proteins by cleaving peptide bonds after\ntyrosine or phenylalanine.\na) Enzyme E is the product of gene G that encodes a protein with the molecular weight of 50 kilodaltons (50 kD).\nWhen you purify enzyme E, you obtain a single type of polypeptide of 50 kD. However, active enzyme E has a\nmolecular weight of 250 kilodaltons (250 kD), not 50 kD.\ni) Why might active purified enzyme E be larger than the product encoded by gene G?\nii) Define primary, secondary, tertiary, and quaternary structure.\niii) Is the primary structure of the 50 kD protein the same or different than the primary structure of the 250\nkD protein? Explain briefly.\niv) Is the tertiary structure of the 50 kD protein the same or different than the tertiary structure of the 250\nkD protein? Explain briefly.\nv) Is the quaternary structure of the 50 kD protein the same or different than the quaternary structure of\nthe 250 kD protein? Explain breifly.\nb) You test enzyme E activity on a large protein substrate. This substrate is not cleaved by enzyme E. You then\ntreat the substrate with DTT (a compound that disrupts disulfide bonds) and test the enzyme E activity again.\nThis time the substrate is cleaved by enzyme E.\nWhy was enzyme E able to cleave the protein substrate only after the substrate was treated with DTT?\n\nstar protein\n\nQuestion 2\n\nFor the first pair of amino acids listed below, draw the two amino acids with the side chains interacting and list the\nstrongest type of interaction that can occur between the side chain groups. For the remaining pairs, simply list the\nstrongest type of interaction that occurs between the side chain groups. Choose from covalent bonds, hydrogen\nbonds, ionic bonds, or van der Waals interactions.\ni) tyrosine, asparagine\nii) cysteine, cysteine\niii) isoleucine, valine\niv) glutamic acid, lysine\nv) glycine, glutamine\nQuestion 3\nIn analyzing differences between drug resistant fungi and drug sensitive fungi, you have discovered a protein that\nexists only in the drug resistant fungi. You named this the Resist protein and design substrates that you hope will\nbind to it.\nCH 3\nCH 3\nCH 3\nHO\nH N\n+\nOH\nVal\nGlu\nAsp\nAla\nsubstrate 1\nResist protein\na) Give the name for the strongest intermolecular interaction between substrate 1 as shown and the side chains\nof following amino acids on the Resist protein. Choose from ionic bond, covalent bond, hydrogen bond, and van\nder Waals forces.\nAmino Acid\nStrongest interaction\nVal\nGlu\nAsp\nAla\n\nstar protein\n+\nWhat is the strongest interaction that\nnow exists between the glu of the star\nprotein and substrate 3?\n______________________________\nionic\n\nstar protein\n\nSH\nWhat is the strongest interaction that\nnow exists between the ala of the star\nprotein and substrate 2?\n______________________________\nvan der Waals\n\nQuestion 3, continued\nb) You make the following additional substrates .\nVal\nGlu\nAsp\nAla\nsubstrate 2\nH N\n+\nCH 3\nCH 3\nCH 3\nHO\nResist protein\nCH3\nWhat is the strongest interaction that\nnow exists between the Ala of the\nResist protein and substrate 2?\nVal\nGlu\nAsp\nAla\nCH 3\nCH 3\nCH 3\nNH3\n+\nH N\n+\nOH\nsubstrate 3\nResist protein\nWhat is the strongest interaction that\nnow exists between the Glu of the\nResist protein and substrate 3?\nc) Which substrate would you expect to bind the most tightly to the Resist protein?\nsubstrate 1\nsubstrate 2\nsubstrate 3\nExplain why you made this choice.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.5prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/a61124da1927b71dc73326804a802b39_MIT7_01SCF11_1.5prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 5: Biochemical Reactions, Enzymes and ATP\nQuestion 1\nYou are looking at the following biological reactions that are catalyzed by specific enzymes as shown below.\nE1\nCompound A\nCompound B\nE2\nCompounds C + D\nCompound E\nE3\nCompound F\nCompound G\nNote:\n-\nIn Reaction #1, Enzyme E1 catalyzes the conversion of Compound A to Compound B. This reaction is\ntruly reversible and the reverse reaction is as likely as the forward reaction.\n-\nIn Reaction #2, Enzyme E2 catalyzes an energy requiring reaction that uses Compounds C and D as\nsubstrates to produce Compound E.\n-\nIn Reaction #3, Enzyme E3 catalyzes an energy producing reaction that converts Compound F to\nCompound G.\na) Draw the energy profiles of reactions #1, #2 and #3 on the axes given below. On the diagram, please label the\nreactants and the products.\n#1\n#2\n#3\nFree energy\nFree energy\nFree energy\nTime\nTime\nTime\nb) You decide to reproduce Reaction #2 in three test tubes. You may assume that this biological reaction occurs\nat a 37oC and a pH of 7.4 under normal conditions.\n-\nTest tube #1: You perform the reaction at 70oC and a pH of 7.4 and observe that no Compound E is\nproduced. When the temperature is brought to 37oC, Compound E is produced at a rate similar to normal\ncondition.\n-\nTest tube #2: You perform the reaction at 37oC and a pH of 10.4 and observe that no Compound E is\nproduced. When the pH is brought to 7.4, Compound E is produced at a rate similar to normal condition.\n-\nTest tube #3: You perform the reaction at 37oC and a pH of 7.4 in the presence of proteases and\nobserve that no Compound E is produced. The effect of protease treatment persists even after its\nremoval from reaction mixture.\nExplain the effect of the changed reaction parameters in each of the above test tubes on structure and function\nof Enzyme E2.\nReaction parameters\nEffect on Enzyme E2\nIs the effect reversible/\nirreversible?\n70oC in test tube #1\n10.4 pH in test tube #2\nProtease in Test tube #3\n\nc) An enzyme may alter some or all of the following parameters. For each choose whether the enzyme would\n\"increase\" or \"decrease\" that parameter. If the enzyme does not affect that parameter, write \"no change\".\nParameter\nEffect of enzyme\nFree energy of the products\nRate of forward reaction\nRate of reverse reaction\nEnergy of activation\nOverall free energy change\nQuestion 2\na) On the axes below, draw and label the products and reactants, ΔG, and energy of activation for reaction 1\nbelow.\n1) A\nB, where the forward reaction has a ΔG = -3, and an Energy of activation = +0.5\nFree energy (kcals/mole)\nCourse of reaction\nCompare reaction 1 (above) to reactions 2 and 3 (below).\n2) C\nD, where the forward reaction has a ΔG = +2, and an Energy of activation = +2.5\n3) E\nF, where the forward reaction has a ΔG = +0.3, and an Energy of activation = +2\nb) Which of these reactions, 1, 2, or 3 is most likely to proceed in the forward direction in the absence of an\nenzyme? If you do not have enough information to answer this question, write \"Can't tell\" below. Explain your\nanswer.\nc) Which of these reactions, 1, 2, or 3 will have the larger Keq? If you do not have enough information to answer\nthis question, write \"Can't tell\" below. Explain your answer.\nd) Assume that you have a reaction X\nY where ΔG = 0 and the energy of activation = 0.6 kcal/mole. In a\ncell, you find that the reaction proceeds almost exclusively in the forward direction. Explain why this might be the\ncase.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.6prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/92e94b83a425a5a1ee88e3fe029a5807_MIT7_01SCF11_1.6prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 6: Glycolysis, Respiration and Fermentation\nQuestion 1\nADP\nATP\nNAD+\nNADH\nGlycolysis can be summarized as:\nglucose\npyruvate\na) In a yeast cell, what is the fate of the carbon in pyruvate under anaerobic conditions?\nb) In a yeast cell, what is the fate of the carbon in pyruvate under aerobic conditions?\nc) In step 7 of glycolysis 1,3-Bisphosphoglycerate (BPG) is converted into 3-Phosphoglycerate (3PG). Which of\nthese molecules, BPG or 3PG would you expect is at a higher energy level? Explain your answer.\nd) The enzyme triose phosphate isomerase, catalyzes step 5. In this step Dihydroxyacetone phosphate is\nconverted into Glyceraldehyde-3-phoshate (DAP G3P). Glyceraldehyde-3-phoshate (G3P) is immediately\nused in step 6. Dihydroxyacetone phosphate must be converted to Glyceraldehyde-3-phoshate (G3P) before it\ncan continue through glycolysis. Cells lacking triose phosphate isomerase can't convert (DAP G3P). These\ncells can remain alive but only under aerobic conditions. Explain why cells lacking triose phosphate isomerase\nare alive only under aerobic conditions.\ne) Assume that you have a cell that is able to complete glycolysis, the citric acid cycle, and the steps of oxidative\nphosphorylation involving the electron transport chain. However, the ATP synthase in this cell allows passage of\nH+ ions but does not produce ATP. When grown in aerobic conditions, you expect this cell to generate...\n(circle the best answer from below)\nthe same amount of ATP as a cell that was fermenting.\na little more ATP than a cell that was fermenting.\na little less ATP than a cell that was fermenting.\nabout the same amount of ATP as a cell that was respiring normally under aerobic conditions.\nExplain your choice.\nf) Assume that you have a cell that completes glycolysis, the citric acid cycle, and the first steps of oxidative\nphosphorylation normally. However, in this cell you inhibit the transfer of electrons to the last protein in the\nelectron transport chain. Explain why glycolysis in this cell stops almost immediately, even before all of the ATP is\ndepleted.\n\nQuestion 2\nIn the 1860's, Louis Pasteur observed the following phenomenon, which has come to be called \"the Pasteur\nEffect\". If you grow a culture of E. coli bacteria (which can grow anaerobically or aerobically) without O2, they\nconsume large amounts of glucose as they grow and they produce lactic acid from the glucose. If you now supply\nthis culture with O2, you make two observations:\n1) Lactic acid is no longer produced.\n2) The rate of glucose consumption (glycolysis) decreases even though the rate of cell growth is constant.\na) Explain both of these results in terms of fermentation and respiration.\nb) Fermentation is one example of a pathway by which the electron carrier used in glycolysis is regenerated.\nDraw the appropriate structures of the reactants and the products of fermentation in the boxes below.\nc) Where does the oxidative phosphorylation in E. coli cells take place compared to a eukaryotic cell?\n\nStep 2\nStep 1\nStep 3\nStep 4\nIsomerase\nStep 5\nStep 7\nStep 6\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.7prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/25f6bf696b75c6ba3f96ad00dfed842b_MIT7_01SCF11_1.7prob.pdf",
      "content": "Practice Problems for Biochemistry, Session 7: Chemiosmotic Principle, Photosynthesis\nQuestion 1\na) Respiration and Non-cyclic photophosphorylation both produce ATP using chemiosmosis.\n-\nIn respiration, what molecule donates electrons to the first protein in the electron transport chain?\n-\nIn non-cyclic photophosphorylation, what molecule donates electrons to the first protein in the electron\ntransport chain?\n-\nIn respiration, what molecule accepts electrons from the last protein in the electron transport chain?\n-\nIn non-cyclic photophosphorylation, what molecule accepts electrons from the last protein in the electron\ntransport chain?\n-\nNon-cyclic photophosphorylation also produces NADPH. In what process is NADPH used, and what role\ndoes it perfom in this process?\nb) Purple sulfur bacteria have photosystem I, but not photosystem II, and thus carry out cyclic\nphotophoshorylation. Plants have both photosystem I and photosystem II, and carry out non-cyclic\nphotophosphorylation.\n-\nIs the Calvin Cycle the same or different in Purple sulfur bacteria and plants? Explain.\n-\nIs the mechanism for producing ATP the same or different in Purple sulfur and plants? Explain.\n-\nWhat is the initial source of the electrons that are used to convert NADP+ to NADPH for cyclic\nphotophoshorylation?\n-\nWhat is the source of electrons for the conversion of NADP+ to NADPH for non-cyclic\nphotophoshorylation?.\nQuestion 2\nExplain why the evolution of non-cyclic photophosphorylation was a prerequisite to the evolution of respiration.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.1prob1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/20445ba44a664923fd74ae15e3133723_MIT7_01SCF11_2.1prob1.pdf",
      "content": "Practice Problems for Molecular Biology, Session 1: DNA Structure, Classic Experiments\nQuestion 1\nIn 1928, Griffith performed a series of experiments where he infected mice with two different strains of\npneumonia-causing bacteria (S. pneumonia): the smooth/virulent, disease causing S strain and the harmless\nrough/ non-virulent R strain. You have three unknown samples (A/ B/ C) of S. pneumonia and want to\ncharacterize them. You inject these samples into mice both individually and in combination. You then obtain blood\nsamples from the injected mice and culture the bacteria present. You also record whether the mice live or die.\nYour observations are summarized in the following table.\nSet 1\nSample injected\nResponse of the\nmice\nType of strain recovered from\nmice\nA\nDead\nLive S strain\nB\nLive\nNone\nC\nLive\nLive R strain\nA + B\nDead\nLive S strain\nA + C\nDead\nLive R and live S strains\nB + C\nDead\nLive R and live S strains\na) Assuming that each sample (A, B, and C) contained only one type of bacterial strain, what type of S.\npneumonia is found in each sample? Choose from live smooth/virulent, heat-killed smooth/virulent, live\nrough/non-virulent, or heat-killed rough/non-virulent. Provide an explanation for your classification.\nSample A:\nSample B:\nSample C:\nQuestion 2\nThe Meselson-Stahl experiment suggested that DNA replicates in a semi-conservative manner. E. coli cells were\ngrown for several generations in a media with 15N. These E. coli cells were then transferred into a 14N media and\nallowed to replicate their DNA. DNA was extracted from the cells grown in 14N-containing media and separated by\ncesium chloride density centrifugation. In tube 1 below, you see the band formed by the DNA isolated from cells\ngrown exclusively in 15N media. On the schematic below, draw the band(s) that you would expect in tubes 2 & 3 if\nthe DNA duplex is copied by a semi-conservative mode of replication.\nTube 1\nTube 2\nTube 3\n14N\n15N\nCells grown only in\nCells grown in\n15N-containing media\n15N-containing media and then\nin\n14N-containing media for one\ngeneration\nCells grown in\n15N-containing media and then\nin\n14N-containing media for two\ngenerations\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.2prob.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/d2cdbbbd3edc74951a83787cbcc71f88_MIT7_01SCF11_2.2prob.pdf",
      "content": "Practice Problems for Molecular Biology, Session 2: DNA Replication\n\nQuestion 1\n\nATP\n-\n\na) Box the part that is added to a growing chain of nucleic acid.\n\nb) Star the atom(s) that can form a hydrogen bond with the complementary nitrogenous base.\n\nc) Circle the part of the molecule that decreases the stability of RNA as compared to DNA.\n\nd) Draw an arrow to the part of this molecule that you would modify to prevent further elongation. Indicate what\nchange you would make next to the arrow drawn.\n\nQuestion 2\n\nConsider the following origin of replication that is found on a chromosome. The sequence of region 1 is shown.\n\nRegion 1: 5'...CTGACTGACA...3'\n3'...GACTGACTGT...5'\n5'\n3'\n5'\n3'\nRegion 1\nori\ntop\nbottom\n\na) Within Region 1, which strand will be the template for leading strand synthesis, the top or the bottom?\n\nb) If we assume that a lagging strand fragment is made from region 1, what will be its sequence?\n\nc) You have a mutant DNA polymerase that is partially defective. In vitro experiments using the mutant DNA\npolymerase gives an error rate of 10-3, as compared to the expected error rate of 10-6. Which of the following\nactivities is the mutant polymerase likely to be missing, as compared to the normal polymerase? Circle all that\napply.\n5'3' polymerase\n\n3'5' exonuclease\n5'3' exonuclease\n\n3'5' polymerase\n5'3' recombinase\n\n3'5' recombinase\n\nQuestion 3\n\nShown below is a schematic of replicating DNA in a bacterial cell.\n\na) On the diagram, label the 5' and the 3' ends of the parental DNA strands.\n\nb) Which parental DNA strand (top or bottom) serves as a template for the synthesis of the leading strand in\nRegion 2?\n\nc) To which site (A, B, or both) can the primer 5' UUGC 3' bind?\n\nd) The replication of which strand (top, bottom, or both) in Region 2 would be affected in the absence of RNA\nprimase? Assume that replication has not yet initiated on either strand. Explain.\n\ne) You perform DNA replication in a test tube (in vitro) using a single-stranded linear DNA as the template and the\nappropriate DNA primer. From the list below, circle the proteins that are required for one round of replication.\n\nPrimase DNA polymerase\nRibonuclease Topoisomerase\nLigase Helicase\n\nf) Why does the DNA of a eukaryotic cell require multiple origins of replication when some prokaryotic cell\ngenomes have only one origin of replication?\n\ng) The \"leading strand\" terminology refers to the fact that this strand is the first daughter DNA strand to be\ncompleted from a given replication fork. Explain why the leading strand is completed before the lagging strand.\n\nh) Which of the following statements is true?\na. DNA polymerase moves along the template strand in the 3' to 5' direction.\nb. DNA polymerase requires a primer to initiate replication.\nc. DNA polymerase forms a covalent bond between a phosphate group and a hydroxyl group.\nd. Polymerization of DNA for both the lagging and the leading strands is in the 5' to 3' direction.\ne. Shortly after DNA replication has begun, you find two replication forks moving in opposite directions\naway for the Origin of Replication.\nf. All of the above statements are true.\ne. None of the above statements are true.\n\nOrigin\nRegion 1 Region 2\nAACG\nAACG\nTop strand\n\nBottom strand\nSite B\n\nSite A\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.1sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/0cd794261aaf33e3f7921965914829ce_MIT7_01SCF11_1.1sol.pdf",
      "content": "Solutions to Practice Problems for Biochemistry, Session 1: Types of Organisms, Cell Composition\nQuestion 1\nYou are given four test tubes, each tube contains cells from a different organism. One tube\ncontains bacterial cells, one contains yeast cells (eukaryotic), one contains human cells and the\nlast contains insect cells. Can you identify the cells from each tube if you are given a light\nmicroscope? Explain your answer.\nWith a light microscope you could easily distinguish the prokaryotic bacteria from the other cell\ntypes. The prokaryotic bacteria would not have a nucleus, the other cell types would. The yeast\ncell wall would distinguish yeast cells from human and insect cells. Distinguishing human and\ninsect cells with a simple microscope may not be possible, as the two are very similar.\nQuestion 2\nWhich of the following sequences is the best representation of the organizational hierarchy (from\ncomplex to simple) found in an individual animal?\nBrain, Cerebellum, Nerve cell, Nervous tissue\nCerebellum, Nervous tissue, Molecule, Cell\nOrganism, Organ system, Tissue, Cell, Organ\nNervous system, Nerve cell, Brain, Cerebellum\nNervous system, Cerebellum, Cell, Molecule\nThe best representation of a complex to simple organizational hierarchy in an animal would be:\nNervous system, Cerebellum, Cell, Molecule\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.2sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/97be7ab10307d71a289dc44d32ecc650_MIT7_01SCF11_1.2sol.pdf",
      "content": "Solutions to Practice Problems for Biochemistry, Session 2: Covalent Bonds,\nHydrogen Bonds\nQuestion 1\nConsider the following carbohydrate.\na) Name each bond or interaction that is circled in the schematic above. Explain why you\nselected these options. Choose from polar covalent, nonpolar covalent, ionic, hydrophobic,\nvan der Waals.\n- Bond #1 (C-C):\nNon-polar covalent because carbon always forms covalent bonds in biological systems\nand both carbon atoms have the same electronegativity making the bond non-polar\n- Bond #2 (C-OH):\nPolar covalent because carbon and oxygen have different electronegativities. Oxygen\nis much more electronegative than carbon and pulls the electrons more towards itself\nmaking the bond polar.\nb) Would you expect this polymer to be soluble in an aqueous environment? Explain your\nanswer.\nYes, because of the exposed OH groups that allow for hydrogen bonding with water in the\nenvironment.\nc) What type of bonds or interactions can occur between two such polymers? Choose from:\ncovalent, hydrogen, hydrophobic, ionic, van der Waals. Explain your answer.\nHydrogen bonds can occur between the two polymers. The exposed OH groups allow for\neasy hydrogen bonding between molecules. There are no charged groups so ionic bonds\ncannot occur and covalent bonds cannot occur without an enzyme or catalyst.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.3sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/a7768ab855fe720fdb5b53b5ee2a8855_MIT7_01SCF11_1.3sol.pdf",
      "content": "Solutions to Practice Problems for Biochemistry, Session 3: Macromolecules: Lipids,\nCarbohydrates, Nucleic Acid\nQuestion 1\nThe following structure is found in many biological systems.\nH2\nH2\nH2\nH2\nH2 O\nH2\nC\nC\nC\nC\nC\nC\nC\nC\nC\nC\nO\nH3C\nH2\nH2\nH2\nH2\nH2\nH2\nH2\nH2\nH2 O\nC\nC\nC\nC\nC\nC\nC\nC\nC\nO\nCH\nO\nH3C\nH2\nH2\nH2\nH2\nO\nP\nO\nO\na) Name the molecule diagramed above. Phospholipid\nb) Where are these molecules found in a living cell, and what purpose do they serve? '\nThey are found as the major component in the cell membrane\nc) This molecule is sometimes drawn like this:\n-\nIf you were to add many of these molecules to a glass of water shown below, draw one of three\nconfigurations these molecules would assume.\nbilayer\nmicelle\nvesicle\nWATER\nNO water here\n-\nWhat is the name of your configuration? See label above\nd) Explain briefly why these molecules form the structure you have drawn.\nPhospholipids are amphipathic, i.e., they are molecules with two different ends. The polar end with the\nphosphorous and oxygen is hydrophilic and associates with the aqueous environment. The non-polar end\ncomposed of hydrocarbons is very hydrophobic and to excludes water.\nd) Explain briefly why these molecules form the structure you have drawn.\n\ne) Another class of biological polymers contains phosphate. Draw another biological molecule that contains\nphosphate.\nATP\nf) What is the function of this molecule?\nThe two nucleic acids, DNA and RNA have different functions. DNA is the storage form of genetic material for\nmost organisms. RNA is a molecule involved in the transfer of information from DNA to protein. ATP, which is\ndrawn above, is a building block of RNA. ATP is also used as energy currency in the cell.\nQuestion 2\nBelow is a segment of a cellulose molecule. A microfibril of cellulose is composed of about 80 molecules that lie\nparallel to each other and close together.\nWhat type of bond holds the parallel fibers together?\nHydrogen bonds between the hydroxyl groups attached to the carbon atom 3 on one molecule and carbon atom 6\non the adjacent molecule.\n\nQuestion 3\na) Is the following a polymer of DNA or RNA? Explain how you can determine this.\nThis is DNA because the 2' carbon is lacking a hydroxyl (DNA = deoxyribonucleic acid) and one of the bases is\nthymine not uracil.\nNH 2\n-O\nadenine\nO\nCH2\nO\nP\nN\nN\nN\nN\nO\nH\nH\nO-\nH\nH\nH\nO\nP\nO\nO\n-\nO\nH\nH\nO\nH C\nH\nH\nadenine\nthymine\nH\nO\nP\nO\nO\n-\nO\nH\nH\nO\nH C\nH\nH\nN\nHN\nO\nO\nN\nN\nN\nN\nNH2\nCH 3\nHO\nH\nb) Which of the following arrangements is possible in an RNA molecule? The small lines\nrepresent\nHydrogen bonds.\nB\nA\nC\n5'\n3'\n3'\n5'\n5'\n3'\nArrangement A and B are possible because they maintain the anti-parallel direction of the two strands forming\nhydrogen bonds. Arrangement C is not possible because the two strands forming hydrogen bonds are parallel to\neach other.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.4sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/ddfbc7c06d0edb746e9390c964757b71_MIT7_01SCF11_1.4sol.pdf",
      "content": "Solutions for Practice Problems for Biochemistry\n\n, Session 4:\n\nProteins, Lev\n\nels of\n\nStructure, Non-Cov\n\nalent Forces\nQuestion 1\nYou have discovered a new enzyme, enzyme E, which breaks down proteins by cleaving peptide bonds after\ntyrosine or phenylalanine.\na) Enzyme E is the product of gene G that encodes a protein with the molecular weight of 50 kilodaltons (50 kD).\nWhen you purify enzyme E, you obtain a single type of polypeptide of 50 kD. However, active enzyme E has a\nmolecular weight of 250 kilodaltons (250 kD), not 50 kD.\ni) Why might active purified enzyme E be larger than the product encoded by gene G?\nThe active enzyme must have multiple subunits. Likely it is a pentamer of the 50 kD polypeptide encoded\nby gene G.\nii) Define primary, secondary, tertiary, and quaternary structure.\nThe primary structure is the linear sequence of amino acids.\nThe secondary structure is localized regions of alpha helix and beta sheet.\nThe tertiary structure is the 3 dimensional shape.\nThe quaternary structure is the association of distinct polypeptide chains with each other.\niii) Is the primary structure of the 50 kD protein the same or different than the primary structure of the 250\nkD protein? Explain briefly.\nBecause each subunit is encoded by the G gene, the linear sequence of amino acids is the same.\nThus the primary structure is the same.\niv) Is the tertiary structure of the 50 kD protein the same or different than the tertiary structure of the 250\nkD protein? Explain briefly.\nIt is likely that the tertiary structure is the same. Each polypeptide folds to form the same 3 dimensional\nshape. However, if the association between the subunits influences the shape of each, the tertiary\nstructure could be different.\nv) Is the quaternary structure of the 50 kD protein the same or different than the quaternary structure of\nthe 250 kD protein? Explain breifly.\nThe 50 kD protein, as a single polypeptide does not have quaternary structure, the quaternary structure of\nthe 250 kD protein is the five subunit nature of this protein.\nb) You test enzyme E activity on a large protein substrate. This substrate is not cleaved by enzyme E. You then\ntreat the substrate with DTT (a compound that disrupts disulfide bonds) and test the enzyme E activity again.\nThis time the substrate is cleaved by enzyme E.\nWhy was enzyme E able to cleave the protein substrate only after the substrate was treated with DTT?\nEnzyme E binds and cuts at specific sites. These sites are not present on the exterior of the substrate when the\nsubstrate is properly folded. When the disulfide bonds within the substrate protein are disrupted, the 3\ndimensional shape is altered, and the protein unfolds. This allows enzyme E access to sites that were previously\nprotected within the substrate protein.\n\nstar protein\n\nQuestion 2\nFor the first pair of amino acids listed below, draw the two amino acids with the side chains interacting and list the\nstrongest type of interaction that can occur between the side chain groups. For the remaining pairs, simply list the\nstrongest type of interaction that occurs between the side chain groups. Choose from covalent bonds, hydrogen\nbonds, ionic bonds, or van der Waals interactions.\ni) tyrosine, serine\nHydrogen\nii) cysteine, cysteine\ncovalent\niii) isoleucine, valine\nvan der Waals\niv) glutamic acid, lysine ionic bond\nv) glycine, glutamine\nvan der Waals\nQuestion 3\nIn analyzing differences between drug resistant fungi and drug sensitive fungi, you have discovered a protein that\nexists only in the drug resistant fungi. You named this the Resist protein and design substrates that you hope will\nbind to it.\nCH 3\nCH 3\nCH 3\nHO\nH N\n+\nOH\nVal\nGlu\nAsp\nAla\nsubstrate 1\nResist protein\na) Give the name for the strongest intermolecular interaction between substrate 1 as shown and the side chains\nof following amino acids on the Resist protein. Choose from ionic bond, covalent bond, hydrogen bond, and van\nder Waals forces\nAmino Acid\nStrongest interaction\nVal\nvan der Waals force\nGlu\nHydrogen bond\nAsp\nIonic bond\nAla\nvan der Waals force\n\nstar protein\n+\nWhat is the strongest interaction that\nnow exists between the glu of the star\nprotein and substrate 3?\n______________________________\nionic\n\nstar protein\n\nSH\nWhat is the strongest interaction that\nnow exists between the ala of the star\nprotein and substrate 2?\n______________________________\nvan der Waals\n\nQuestion 3, continued\nb) You make the following additional substrates.\nVal\nGlu\nAsp\nAla\nsubstrate 2\nH N\n+\nCH 3\nCH 3\nCH 3\nHO\nResist protein\nCH3\nWhat is the strongest interaction that\nnow exists between the Ala of the\nResist protein and substrate 2?\nVan der Waals force\nVal\nGlu\nAsp\nAla\nCH 3\nCH 3\nCH 3\nNH3\n+\nH N\n+\nOH\nsubstrate 3\nResist protein\nWhat is the strongest interaction that\nnow exists between the Glu of the\nResist protein and substrate 3?\nIonic Bond\nc) Which substrate would you expect to bind the most tightly to the Resist protein?\nsubstrate 1\nsubstrate 2\nsubstrate 3\nExplain why you made this choice.\nSubstrate 3 forms strong ionic interactions at two positions as opposed to one position.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.5sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/653bf5bdea8911e0e42e998999d13cb9_MIT7_01SCF11_1.5sol.pdf",
      "content": "Solutions to Practice Problems for Biochemistry, Session 5: Biochemical Reactions,\nEnzymes and ATP\nQuestion 1\nYou are looking at the following biological reactions that are catalyzed by specific enzymes as shown below.\nE1\nCompound A\nCompound B\nE2\nCompounds C + D\nCompound E\nE3\nCompound F\nCompound G\nNote:\n-\nIn Reaction #1, Enzyme E1 catalyzes the conversion of Compound A to Compound B. This reaction is\ntruly reversible and the reverse reaction is as likely as the forward reaction.\n-\nIn Reaction #2, Enzyme E2 catalyzes an energy requiring reaction that uses Compounds C and D as\nsubstrates to produce Compound E.\n-\nIn Reaction #3, Enzyme E3 catalyzes an energy producing reaction that converts Compound F to\nCompound G.\na) Draw the energy profiles of reactions #1, #2 and #3 on the axes given below. On the diagram, please label the\nreactants and the products.\nFree energy\n#1\n#2\n#3\nFree energy\nFree energy\nReactants\nReactants\nReactants\nProducts\nProducts\nProducts\nTime\nTime\nTime\nb) You decide to reproduce Reaction #2 in three test tubes. You may assume that this biological reaction occurs\nat a 37oC and a pH of 7.4 under normal conditions.\n-\nTest tube #1: You perform the reaction at 70oC and a pH of 7.4 and observe that no Compound E is\nproduced. When the temperature is brought to 37oC, Compound E is produced at a rate similar to normal\ncondition.\n-\nTest tube #2: You perform the reaction at 37oC and a pH of 10.4 and observe that no Compound E is\nproduced. When the pH is brought to 7.4, Compound E is produced at a rate similar to normal condition.\n-\nTest tube #3: You perform the reaction at 37oC and a pH of 7.4 in the presence of proteases and\nobserve that no Compound E is produced. The effect of protease treatment persists even after its\nremoval from reaction mixture.\nExplain the effect of the changed reaction parameters in each of the above test tubes on structure and function\nof Enzyme E2.\nReaction parameters\nEffect on Enzyme E2\nIs the effect reversible/ irreversible?\n70oC in test tube #1\nDenaturation/Unfolding\nReversible - Can refold when\ntemperature lowered back to 37oC\n10.4 pH in test tube #2\nDenaturation/Unfolding\nReversible Can refold when pH is\nlowered back to 7.4\nProtease in Test tube #3\nDigestion/Degradation\nIrreversible - the peptide bonds that hold\nthe primary amino acid sequence of the\nenzyme are disrupted resulting in\nindividual amino acids.\n\nc) An enzyme may alter some or all of the following parameters. For each choose whether the enzyme would\n\"increase\" or \"decrease\" that parameter. If the enzyme does not affect that parameter, write \"no change\".\nParameter\nEffect of enzyme\nFree energy of the products\nno change\nRate of forward reaction\nincrease\nRate of reverse reaction\nincrease\nEnergy of activation\ndecrease\nOverall free energy change\nno change\nQuestion 2\na) On the axes below, draw and label the products and reactants, ΔG, and energy of activation for reaction 1\nbelow.\n1) A\nB, where the forward reaction has a ΔG = -3, and an Energy of activation = +0.5\nFree energy (kcals/mole)\nCourse of reaction\nProducts\nReactants\nΔG\nEnergy if activation\nCompare reaction 1 (above) to reactions 2 and 3 (below).\n2) C\nD, where the forward reaction has a ΔG = +2, and an Energy of activation = +2.5\n3) E\nF, where the forward reaction has a ΔG = +0.3, and an Energy of activation = +2\nb) Which of these reactions, 1, 2, or 3 is most likely to proceed in the forward direction in the absence of an\nenzyme? If you do not have enough information to answer this question, write \"Can't tell\" below. Explain your\nanswer.\nReaction 1 is most likely to proceed in the forward direction in the absence of an enzyme because it is exergonic\n(the ΔG is negative) and the energy of activation is low compared to the other two reactions.\nc) Which of these reactions, 1, 2, or 3 will have the larger Keq? If you do not have enough information to answer\nthis question, write \"Can't tell\" below. Explain your answer.\nReaction 1 will have a larger Keq. The free energy of the products is much less than the free energy of the\nreactants, thus the forward reaction is favored, and at equilibrium, there will be more products than reactants.\nd) Assume that you have a reaction X\nY where ΔG = 0 and the energy of activation = 0.6 kcal/mole. In a\ncell, you find that the reaction proceeds almost exclusively in the forward direction. Explain why this might be the\ncase.\nIn a cell, the product can be used as soon as it is produced. This consumption of the product prevents the\nreverse reaction for occurring and drives the reaction in the forward direction.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.6sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/6b5018b5b59a0b1764fa9f89404ea5bf_MIT7_01SCF11_1.6sol.pdf",
      "content": "Solutions for Practice Problems for Biochemistry, 6: Glycolysis, Respiration and\nFermentation\nQuestion 1\nADP\nATP\nNAD+\nNADH\nGlycolysis can be summarized as:\nglucose\npyruvate\na) In a yeast cell, what is the fate of the carbon in pyruvate under anaerobic conditions?\nethanol\nb) In a yeast cell, what is the fate of the carbon in pyruvate under aerobic conditions?\nCO2\nc) In step 7 (see attached diaragm) of glycolysis 1,3-Bisphosphoglycerate (BPG) is converted into 3\nPhosphoglycerate (3PG). Which of these molecules, BPG or 3PG would you expect is at a higher energy level?\nExplain your answer.\nBPG is at a higher energy level than 3PG. You can infer this because BPG has two phosphate groups as\ncompare to 3PG, which has one phosphate group. Also, the conversion of BPG into 3PG drives the synthesis of\nATP.\nd) The enzyme triose phosphate isomerase, catalyzes step 5. In this step Dihydroxyacetone phosphate is\nconverted into Glyceraldehyde-3-phoshate (DAP G3P). Glyceraldehyde-3-phoshate (G3P) is immediately\nused in step 6. Dihydroxyacetone phosphate must be converted to Glyceraldehyde-3-phoshate (G3P) before it\ncan continue through glycolysis. Cells lacking triose phosphate isomerase can't convert (DAP G3P). These\ncells can remain alive but only under aerobic conditions. Explain why cells lacking triose phosphate isomerase\nare alive only under aerobic conditions.\nCells that lack triose phosphate isomerase can complete glycolysis using only G3P, but this generates only 2 ATP. In\nthese cells under anaerobic conditions there is no net gain of ATP from glycolysis. Under aerobic conditions, the\nsingle pyruvate can be further oxidized to generate a little more ATP and the energy stored in NADH can be\nharvested through oxidation phosphorylation to generate even more ATP.\ne) Assume that you have a cell that is able to complete glycolysis, the citric acid cycle, and the steps of oxidative\nphosphorylation involving the electron transport chain. However, the ATP synthase in this cell allows passage of\nH+ ions but does not produce ATP. When grown in aerobic conditions, you expect this cell to generate...\n(circle the best answer from below)\nthe same amount of ATP as a cell that was fermenting.\na little more ATP than a cell that was fermenting.\na little less ATP than a cell that was fermenting.\nabout the same amount of ATP as a cell that was respiring normally under aerobic conditions.\nExplain your choice.\nOnly little more ATP is generated when pyruvate is used in the citric acid cycle. The bulk of the ATP which is\nproduced in oxidative phosphorylation will not be recovered.\nf) Assume that you have a cell that completes glycolysis, the citric acid cycle, and the first steps of oxidative\nphosphorylation normally. However, in this cell you inhibit the transfer of electrons to the last protein in the\nelectron transport chain. Explain why glycolysis in this cell stops almost immediately, even before all of the ATP is\ndepleted.\nNAD+ is required as an electron carrier for glycolysis and must be regenerated from NADH. In respiration, NADH\ntransfers electrons to the first protein in the electron transport chain, and these electrons move through the chain\nand are ultimately transferred to oxygen. If the transfer of electrons is halted, then all of the carriers will be\nholding electrons and NADH will be unable to transfer electrons. This will prevent the regeneration of NAD+, so\nglycolysis stops.\n\nQuestion 2\nIn the 1860's, Louis Pasteur observed the following phenomenon, which has come to be called \"the Pasteur\nEffect\". If you grow a culture of E. coli bacteria (which can grow anaerobically or aerobically) without O2, they\nconsume large amounts of glucose as they grow and they produce lactic acid from the glucose. If you now supply\nthis culture with O2, you make two observations:\n1) Lactic acid is no longer produced.\n2) The rate of glucose consumption (glycolysis) decreases even though the rate of cell growth is constant.\na) Explain both of these results in terms of fermentation and respiration.\nIn the absence of O2, pyruvate is fermented into lactic acid as a means to regenerate NAD+, however, only 2 ATP\nare produced per glucose molecule. In the presence of O2, pyruvate enters the Citric Acid Cycle (CAC) which\nproduces additional ATP and NADH. The NADH from glycolysis and the CAC unload electrons to the electron\ntransport chain which can produce additional ATP. Because respiration (the CAC + oxidative phosphorylation)\nproduces 18x more ATP/glucose, less glucose is consumed.\nb) Fermentation is one example of a pathway by which the electron carrier used in glycolysis is regenerated.\nDraw the appropriate structures of the reactants and the products of fermentation in the boxes below.\nc) Where does the oxidative phosphorylation in E. coli cells take place compared to a eukaryotic cell?\nIn E.coli, oxidative phosphorylation takes place on the plasma membrane. In eukaryotes, oxidative\nphosphorylation takes place on the inner mitochondrial membrane.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_1.7sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/20d10b902b67d561a1d2bc360d674398_MIT7_01SCF11_1.7sol.pdf",
      "content": "Solutions for Practice Problems for Biochemistry, Session 7:Chemiosotic Principle,\nPhotosynthesis\nQuestion 1\na) Respiration and Non-cyclic photophosphorylation both produce ATP using chemiosmosis.\n-\nIn respiration, what molecule donates electrons to the first protein in the electron transport chain?\nNADH transfers electrons to the first protein in the electron transport chain.\n-\nIn non-cyclic photophosphorylation, what molecule donates electrons to the first protein in the electron\ntransport chain?\nChlorophyll transfers electrons to the first protein in the electron transport chain. Note that the electrons\ndonated by this chlorophyll molecule are replaced by electrons taken from H2O to make O2.\n-\nIn respiration, what molecule accepts electrons from the last protein in the electron transport chain?\nOxygen accepts electrons from last protein in the electron transport chain.\n-\nIn non-cyclic photophosphorylation, what molecule accepts electrons from the last protein in the electron\ntransport chain?\nNADP+ accepts electrons from last protein in the electron transport chain.\n-\nNon-cyclic photophosphorylation also produces NADPH. In what process is NADPH used, and what role\ndoes it perfom in this process?\nNADPH is used in the Calvin cycle to produce glucose from CO2.\nb) Purple sulfur bacteria have photosystem I, but not photosystem II, and thus carry out cyclic\nphotophoshorylation. Plants have both photosystem I and photosystem II, and carry out non-cyclic\nphotophosphorylation.\n-\nIs the Calvin Cycle the same or different in Purple sulfur bacteria and plants? Explain.\nThe Calvin cycle is the same. The steps and enzymes needed for the pathway from CO2 glucose are\nidentical, however the way the organisms generate NADPH differs.\n-\nIs the mechanism for producing ATP the same or different in Purple sulfur and plants? Explain.\nThe mechanism for producing ATP is basically the same. Both use an electron transport chain to\ngenerate an H+ gradient that is used to drive the synthesis of ATP. The specifics of the eleron transport\nchain differ slightly.\n-\nWhat is the initial source of the electrons that are used to convert NADP+ to NADPH for cyclic\nphotophoshorylation?\nThe electrons come from reduced compounds such as H2S.\n-\nWhat is the source of electrons for the conversion of NADP+ to NADPH for non-cyclic\nphotophoshorylation?.\nThe electrons come from water.\nQuestion 2\nExplain why the evolution of non-cyclic photophosphorylation was a prerequisite to the evolution of respiration.\nUntil the evolution of Non-cyclic photophosphorylation, there was no oxygen in the atmosphere. Non-cyclic\nphotophosphorylation obtains electrons from H2O forming O2. Respiration requires O2 to act as the final electron\nacceptor.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.1sol1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/8b297b772b66d90db5d87b214ccdb97b_MIT7_01SCF11_2.1sol1.pdf",
      "content": "Solutions to Practice Problems for Molecular Biology, Session 1: DNA Structure, Classic Experiments\nQuestion 1\nIn 1928, Griffith performed a series of experiments where he infected mice with two different strains of\npneumonia-causing bacteria (S. pneumonia): the smooth/virulent, disease causing S strain and the harmless\nrough/ non-virulent R strain. You have three unknown samples (A/ B/ C) of S. pneumonia and want to\ncharacterize them. You inject these samples into mice both individually and in combination. You then obtain blood\nsamples from the injected mice and culture the bacteria present. You also record whether the mice live or die.\nYour observations are summarized in the following table.\nSet 1\nSample injected\nResponse of the\nmice\nType of strain recovered from\nmice\nA\nDead\nLive S strain\nB\nLive\nNone\nC\nLive\nLive R strain\nA + B\nDead\nLive S strain\nA + C\nDead\nLive R and live S strains\nB + C\nDead\nLive R and live S strains\na) Assuming that each sample (A, B, and C) contained only one type of bacterial strain, what type of S.\npneumonia is found in each sample? Choose from live smooth/virulent, heat-killed smooth/virulent, live\nrough/non-virulent, or heat-killed rough/non-virulent. Provide an explanation for your classification.\nSample A: Live smooth/virulent; In set 1 when A is injected alone, only live S viral strain is recovered and the mice\ndie\nSample B: Heat-killed smooth/virulent; In set 2, when B is injected alone, no live viral strain is recovered indicating\nthat they have been heat-killed. However, in set 6 when B and C are coinjected, the mice die and you recover\nboth S and R strains indicating that the heat killed S strain transforms some live R strain to live S strain.\nSample C: Live rough/non-virulent; In set 3, when C is injected alone, only live R strain is recovered and the mice\nlive.\nQuestion 2\nThe Meselson-Stahl experiment suggested that DNA replicates in a semi-conservative manner. E. coli cells were\ngrown for several generations in a media with 15N. These E. coli cells were then transferred into a 14N media and\nallowed to replicate their DNA. DNA was extracted from the cells grown in 14N-containing media and separated by\ncesium chloride density centrifugation. In tube 1 below, you see the band formed by the DNA isolated from cells\ngrown exclusively in 15N media. On the schematic below, draw the band(s) that you would expect in tubes 2 & 3 if\nthe DNA duplex is copied by a semi-conservative mode of replication.\nTube 1\nTube 2\nTube 3\n15N\n14N\nCells grown only in\nCells grown in\nCells grown in\n15N-containing media\n15N-containing media and then\n15N-containing media and then\nin\n14N-containing media for one\nin\n14N-containing media for two\ngeneration\ngenerations\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.2sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/fce9be4ad2d135ad651968f967cf069b_MIT7_01SCF11_2.2sol.pdf",
      "content": "H\n\nSolutions for Practice Problems for Molecular Biology, Session 2: DNA Replication\nQuestion 1\nATP\n*\n*\nH\na) Box the part that is added to a growing chain of nucleic acid.\nb) Star the atom(s) that can form a hydrogen bond with the complementary nitrogenous base.\nc) Circle the part of the molecule that decreases the stability of RNA as compared to DNA.\nd) Draw an arrow to the part of this molecule that you would modify to prevent further elongation. Indicate what\nchange you would make next to the arrow drawn.\nQuestion 2\nConsider the following origin of replication that is found on a chromosome. The sequence of region 1 is shown.\n5'\n3'\n5'\n3'\nRegion 1\nori\ntop\nbottom\nRegion 1: 5'...CTGACTGACA...3'\n3'...GACTGACTGT...5'\na) Within Region 1, which strand will be the template for leading strand synthesis, the top or the bottom?\nThe bottom strand will be the template for leading strand synthesis.\nb) If we assume that a lagging strand fragment is made from region 1, what will be its sequence?\n5'\nT G T C A G T C A G 3'\n\nc) You have a mutant DNA polymerase that is partially defective. In vitro experiments using the mutant DNA\npolymerase gives an error rate of 10-3, as compared to the expected error rate of 10-6 . Which of the following\nactivities is the mutant polymerase likely to be missing, as compared to the normal polymerase? Circle all that\napply.\n5'3' polymerase\n5'3' exonuclease\n5'3' recombinase\n3'5' exonuclease\n3'5' polymerase\n3'5' recombinase\nQuestion 3\nShown below is a schematic of replicating DNA in a bacterial cell.\n3'\n5'\n5'\n3'\nAACG\nAACG\nSite A\nTop strand\nBottom strand\nSite B\nRegion 1\nRegion 2\nOrigin\na) On the diagram, label the 5' and the 3' ends of the parental DNA strands.\nb) Which parental DNA strand (top or bottom) serves as a template for the synthesis of the leading strand in\nRegion 2?\nBottom strand\nc) To which site (A, B, or both) can the primer 5' UUGC 3' bind?\nSite B\nd) The replication of which strand (top, bottom, or both) in Region 2 would be affected in the absence of RNA\nprimase? Assume that replication has not yet initiated on either strand. Explain.\nBoth. DNA polymerase is a primer dependent enzyme, it needs a single RNA primer for the leading strand\nsynthesis and multiple primers for the lagging strand synthesis.\ne) You perform DNA replication in a test tube (in vitro) using a single-stranded linear DNA as the template and the\nappropriate DNA primer. From the list below, circle the proteins that are required for one round of replication.\nPrimase\nDNA polymerase\nRibonuclease\nTopoisomerase\nLigase Helicase\nf) Why does the DNA of a eukaryotic cell require multiple origins of replication when some prokaryotic cell\ngenomes have only one origin of replication?\nThe eukaryotic genomes are much larger than the prokaryotic genomes. Having multiple origins of replication\nallows replication to start simultaneously at multiple regions and reduces the total time required for the whole\ngenome to replicate.\ng) The \"leading strand\" terminology refers to the fact that this strand is the first daughter DNA strand to be\ncompleted from a given replication fork. Explain why the leading strand is completed before the lagging strand.\nThe leading strand is made continuously from 1 primer whereas the lagging strand is made in many smaller\nfragments. This requires that DNA polymerase attach to the template many times, which is the rate-limiting step\nin polymerization. In additional, each fragment needs to have the RNA primer replaced with DNA and\nphosphodiester bonds must be formed between each fragment by DNA ligase.\n\nh) Which of the following statements is true?\na. DNA polymerase moves along the template strand in the 3' to 5' direction.\nb. DNA polymerase requires a primer to initiate replication.\nc. DNA polymerase forms a covalent bond between a phosphate group and a hydroxyl group.\nd. Polymerization of DNA for both the lagging and the leading strands is in the 5' to 3' direction.\ne. Shortly after DNA replication has begun, you find two replication forks moving in opposite directions\naway for the Origin of Replication.\nf. All of the above statements are true.\ne. None of the above statements are true.\nStatement f. All of the above statements are true\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT7_01SCF11_2.3sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-01sc-fundamentals-of-biology-fall-2011/32978b0d1afb90f5579ab12966f58e1c_MIT7_01SCF11_2.3sol.pdf",
      "content": "Solutions to Practice Problems for Molecular Biology, Session 3: Transcription, Translation\n\nQuestion 1\n\nFill in the table:\n\nTranscription\nTranslation\nWhere does this process occur in a\nnucleus\ncytoplasm\neukaryotic cell?\nWhat is the enzyme that carries out\nRNA polymerase\nRibosome\nthis process?\nWhat is the template that is read\nDNA\nRNA\nduring this process?\nIn what direction is the template\n3' 5'\n5' 3'\nread?\nWhat is the start signal/sequence for\npromoter\nStart codon\nthis process?\nWhat is the polymer that is formed?\nRNA\npolypeptide\n\nWhat monomer is used to form this\nribonucleotides\nAmino acids\npolymer?\nWhat type of bond is formed\nphosphodiester\npeptide\nbetween monomers?\nIn what direction is the new polymer\n5' 3'\nN C\nformed?\nAmino to carboxyl\nWhat is the stop signal/sequence for\nTranscription Terminator\nStop codon\nthis process?\n\nQuestion 2\nBelow is the double-stranded DNA sequence of part of a hypothetical yeast genome, which happens to contain a\nvery small gene. Transcription starts at the Transcription Start Site (TSS) after the promoter (shown in yellow), and\nproceeds in the direction of the arrow. Transcription stops at the end of the Transcription Terminator (shown in\nblue).\n\na) Which strand of DNA shown, the top or the bottom, is the template strand? Bottom.\n\nb) What is the sequence of the mRNA produced from this gene? Label the 5' and 3' ends.\n5' GAGCCAUGCAUUAUCUAGAUAGUAGGCUCUGAGAAUUUAUCUC 3'\n\nc) What is the sequence of the protein produced from the mRNA in (b)? Label the N and C termini.\nThe start codon is shown above in bold. Met-His-Tyr-Leu-Asp-Ser-Arg-Leu\n\nIf a mutation were found where a T/A (top/bottom) base pair were added immediately after the T/A base pair shown\nin bold, what would be the sequence of the mRNA? What would be the sequence of the protein?\n5' GAGCCAUGCAUUUAUCUAGAUAGUAGGCUCUGAGAAUUUAUCUC 3'\nMet-His-Leu-Ser-Arg\n\nQuestion 3\nShown below is a double-stranded bacterial (E. coli) DNA sequence coding for a hypothetical protein. Both strands\nare shown; the top strand reads 5' to 3' left to right, while the bottom strand reads 5' to 3' right to left. The\nnucleotides are numbered 1 to 100. NOTE: For this problem, transcription begins with and includes the red and\nunderlined C/G (top strand/bottom strand) base pair and RNA polymerase proceeds from left to right along the\nDNA.\n5'-GTGTCCGTCTAATATTGTGAGATGTTATATCCCGCCGTCAACACCATCAA-3'\n---------+---------+---------+---------+---------+\n3'-CACAGGCAGATTATAACACTCTACAATATAGGGCGGCAGTTGTGGTAGTT-5'\n\n5'-ACAGGATAATCGCCTGCTGGGGCAAAGGCGGTGAAGGTAAAGGTGTTGCC-3'\n---------+---------+---------+---------+---------+\n3'-TGTCCTATTAGCGGACGACCCCGTTTCCGCCACTTCCATTTCCACAACGG-5'\n\na) Which strand is used as a template for transcription, the top or the bottom? Bottom.\n\nb) Where would the promoter be relative to the start of transcription?\nThe promoter would be to the left of the transcription start site\n\nc) What are the first 15 nucleotides of the resulting mRNA? Indicate the 5' and 3' ends of the mRNA.\n5' CUAAUAUUGUGAGAU 3'\n\nd) What are the first 5 amino acids translated from the resulting mRNA? Indicate the amino (NH +\n3 ) and carboxy\n-\n(COO ) termini of the protein.\nN Met-Leu-Tyr-Pro-Ala C\n\ne) Do the underlined nucleotides TAA (indicated in blue) encode a stop codon for the protein? Briefly explain your\nanswer.\nNo. The underlined TAA is not read as TAA because of the reading frame. The sequence GATAAT forms the\ncodons: GAU AAU.\n\nConsider the situations in parts (f-h) independently.\n\nf) A mutation occurs which results in the insertion of an extra G/C (top strand/bottom strand) base- pair immediately\nafter base pair 11 (shown in bold). What effect will this insertion mutation have on the mRNA transcript and\nresulting protein?\nThe mRNA will be longer by one nucleotide, but because the insertion is prior to the start codon, the protein is\nunchanged.\n\ng) A different mutation results in the substitution of the T/A base pair at position 30 (shown in bold and underlined)\nwith a G/C base pair. How would this mutation affect the sequence of the protein that is produced?\nThe codon UAU encoded Tyr, but now it is UAG, a stop codon. The protein is truncated.\n\nh) A third mutation occurs which results in the substitution of the C/G base pair at position 42 (shown in bold italics)\nto a T/A base pair. How would this mutation affect the sequence of the protein that is produced?\nThe codon AAC which encoded Asn, now is AAU, which also encodes Asn. The protein is unchanged.\n\nQuestion 4\nA mutation is found in a tRNA-encoding gene. The wild type allele produces a tRNA that recognizes the codon\nGAA, and is charged with the amino acid Glutamic acid. The mutant tRNA is still charged with Glu, but the\nanticodon is mutated such that it recognizes the codon TAA. What effect will this have on translation in these cells?\nHow will the proteins produced be different?\nIt i\n\ns important to recognize that, in normal cells, the codon TAA is a stop codon. In the mutant cells, the stop codon\nTAA will sometimes be bound by the mutant tRNA charged with Glutamic acid. In this case, the polypeptide\nsynthesis will continue past the stop codon and the protein made will be longer than normal.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.01SC Fundamentals of Biology\nFall 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}