{
  "course_name": "Fundamentals of Music",
  "course_description": "This class introduces students to the rudiments of Western music through oral, aural, and written practice utilizing rhythm, melody, intervals, scales, chords, and musical notation. The approach is based upon the inclusive Kodály philosophy of music education. Individual skills are addressed through a variety of means, emphasizing singing and keyboard practice in the required piano labs.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music Performance",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music Performance",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Content\n\nThis course covers the following topics.\n\nElements of music\n\nPractice and mastery\n\nIn-tune singing\n\nRelative solmization\n\nEar training and sight-singing\n\nMeter and rhythmic patterns\n\nMelodic and rhythmic dictation\n\nIndividual and ensemble work\n\nTwo- and three-part work\n\nPitch names\n\nIntervals\n\nScales and modes\n\nKey signatures\n\nFunctional harmony\n\nChord progressions\n\nHarmonic analysis\n\nHarmonic dictation\n\nScore reading\n\nHighlights of The Kodaly Philosophy of Music Education Vis-A-Vis This Class\n\n...\nHe who cannot hear what he sees and cannot see what he hears is not a musician\n.\n\n...\nThe criteria of a good musician are: A well-trained ear, a well-trained intellect, a well-trained heart, and well-trained fingers\n.\n\n...\nThe real reward comes to those who sing and feel and think with others. This is what harmony means\n.\n\n--Zoltan Kodaly_, Selected Writings_\n\nThe Kodaly Philosophy of music education is known among musicians worldwide for its inclusive points of view: Music is for everyone; no person is complete without music; the best approach to musical genius is through the instrument accessible to nearly everyone - the human voice; everyone can learn to sing in tune; authentic folk songs provide a body of masterpieces by which we can be led to the masterpieces of renowned composers; all musicians, whether novices or professionals, must aspire to develop their ability to hear with the inner ear the music which is on the page, and to express from the heart. It is due to this frame of mind that our approach to the Fundamentals of Music is based upon the Kodaly Philosophy. You can read more about the Kodaly Philosophy at the Web site of the\nOrganization of American Kodaly Educators\n.\n\nWhile principles of musical notation are central to the course, we consider 21M.051 to be a skill-building course. In that regard, our goals include creating an environment in which the student can be encouraged to sing in tune, enabling the student to train her/his music literacy and inner hearing, and making music musically. Please be reminded that such skills are best learned under the guidance of a live teacher who possesses the experience necessary to evaluate your skill level and inspire your growth.\n\nEligibility\n\nStudents who have already taken 21M.301 or 21M.302 may not enroll in 21M.051.\n\nRequired Course Tools\n\nDuckworth, William.\nA Creative Approach to Music Fundamentals\n. 9th ed. Belmont, CA: Thomson/Schirmer, 2007. ISBN: 9780495090939.\n\nKodaly, Zoltan.\n333 Reading Exercises\n. New York, NY: Boosey & Hawkes, 1972. ISMN: M060035661.\n\nChromatic pitch pipe\n\nStaff paper and erasable writing implement\n\nVoice, mind, ear, hand, heart, desire for mastery\n\nDaily practice\n\nRegular attendance and recitation\n\nRequired Piano Labs\n\nStudents are required to attend a weekly Piano Lab for\none hour\n. You will be expected to prepare for your lessons by practicing daily as assigned by your Piano Lab instructor. The lab sessions are limited to four students per hour.\n\nExams\n\nStudents will take four tests during the term.\n\nThe Unit I test requires individuals to sight-sing pentatonic melodies.\n\nThe Unit II test is written, and requires mastery of major scales and key signatures, and some intervals.\n\nThe Unit III test is also written, and requires mastery of minor scales and key signatures, and other intervals.\n\nThe final Unit IV test usually provides opportunities for harmonic analysis.\n\nGrading\n\nThe greater portion of your grade will be determined by the quality of your daily preparation for and recitation in the Lectures and Piano Lab.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\n1-3\n\nI: Elements of music\n\n4-7\n\nII: Rhythm + pitch = melody; pentatonic exercises\n\nUnit test (oral)\n\n9-11\n\nIII: Major scales\n\n12-13\n\nIV: Major key signatures\n\nUnit test (written)\n\n15-16\n\nV: Major-minor key relationships\n\n17-19\n\nVI: Minor scale types\n\nUnit test (written)\n\n21-22\n\nVII: Foundations in tonal harmony\n\nMeet in music library for listening assignment\n\n24-26\n\nVII: Foundations in tonal harmony (cont.)\n\nListening assignment due in Ses #25\n\n27-28\n\nCulminating performances\n\nFinal unit test",
  "files": []
}