{
  "course_name": "Game Design",
  "course_description": "This course provides practical instruction in the design and analysis of non-digital games. Students cover the texts, tools, references and historical context to analyze and compare game designs across a variety of genres, including sports, game shows, games of chance, card games, schoolyard games, board games, and role–playing games. In teams, students design, develop, and thoroughly test their original games to understand the interaction and evolution of game rules. Students taking the graduate version complete additional assignments.",
  "topics": [
    "Fine Arts",
    "Game Design",
    "Media Studies",
    "Fine Arts",
    "Game Design",
    "Media Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLab: 1 session / week, 3 hours / session\n\nDescription\n\nThis course provides practical instruction in the design and analysis of non-digital games. Students cover the texts, tools, references and historical context to analyze and compare game designs across a variety of genres, including sports, game shows , games of chance, card games, schoolyard games, board games, and role-playing games. In teams, students design, develop, and thoroughly test their original games to understand the interaction and evolution of game rules. Students taking the graduate version complete additional assignments.\n\nClass Requirements and Grading\n\nThe grade of the course will be determined by preparedness for classes and participation in classes and forum discussions (25%) and three team game design projects (25% each). As long as each game project meets the basic parameters of each assignment (see \"Assignments\" below), grades will be based exclusively on teamwork (5%), adherance and rigorous use of the iterative design process (10%), and responsiveness to tester and faculty feedback from week to week (10%).\nGrades will not be determined by the quality or \"fun\" of your games\n. Because of this, deadlines are fixed and extensions will not be granted. Last-minute heroics will neither be necessary nor useful.\n\nBecause this class emphasizes participation and teamwork, and because you will have to play many games with your classmates, the faculty reserve the right to warn and dock the participation grade of any student who engages in antisocial or disruptive behavior.\nRegular and consistent class attendance is mandatory.\n\nYou may receive a failing grade if you miss more than more than 3 classes without justification and approval from the instructors.\nHowever, this class intends to be lenient on absences due to illness and discourages working while you are sick. Meeting up with classmates in person when you may have a contagious illness is particularly discouraged!\n\nWhile this class does not emphasize essay writing,\ngame rules and text are expected to be clear, spell-checked, and demonstrate a high proficiency in written\n\nEnglish\n. Full acknowledgment for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. Quotations from other sources must be clearly marked as distinct from the student's own work. Students who plagiarize will receive an F in the class.\n\nTextbook\n\nBrathwaite, Brenda, and Ian Schreiber.\nChallenges for Game Designers: Non-digital Exercises for Video Game Designers\n. Boston, MA: Charles River Media/Course Technology, 2009. ISBN: 97815845058081.\n\nAssignments\n\nYou are expected to write a minimum of one paragraph on the forum on the course website every week. When you are not working on a team project, you should write at least one forum post about the readings that week. Feel free to disagree or otherwise complicate the ideas in the readings. Participation in a forum thread is encouraged. \"First!;\" or one-line forum posts do not count.\n\nWhen you are working on a team project, you must write at least one forum post a week detailing the work you and your teammates have done on the game over some part of the previous week. It could just be an account of what changed in your game that day or a collection of feedback from a playtest.\nEvery member of the team must write a different post.\nExplain or demonstrate how your team is applying the iterative design process in the development of your game. Discussion between teams and members is encouraged.\n\nAll original IP for the game designs will belong to the members of the team.",
  "files": [
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g1_cards.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/1c853f15ec813338777b520268c7508b_MITCMS_608F10_p1g1_cards.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\n\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g1_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/e4d3ecd534503f0b729de83d0720764e_MITCMS_608F10_p1g1_rules.pdf",
      "content": "A Wizard Did It...\n!\nOnce upon a time, there were two competing wizards. Both were freelancers, taking jobs from\nthe highest bidder and sending Knights to do their dirty work. Because of their immense power, they\nwere both invited to the Wizardʼs Guild. However, there wasnʼt enough room; thus they were put to a\nchallenge by the the White Mage. They were to send a knight to the Castle to rescue the Princess,\nearning points along the way both for accomplishing impressive feats as well as having the most\nvalorous Knight. You are one of those wizards.\nOverview: As a Wizard, you will put down encounters for your Knight to defeat while also trying to\nhave your opponentʼs Knight lose to the monsters they encounter. Your knight will first go into The\nForest, travel into The Crypt, and cross a river on The Pirate Ship in a race to reach the Castle and\nrescue the Princess. Along the way, you will be attempting to achieve goals for more points, which will\nhelp you get into the guild. There are two phases to the game. First, the Wizard phase, where you lay\ndown encounters for both Knights. Second, the Knight phase, where your Knight runs through the\nencounters in a rush to reach the Princess first. Thus you have a choice to make: will you focus on\nmaking the other Knight lose or will you play helpful cards on your Knight?\nObjective: Your objective is to have the most goal points at the end of the Knightʼs Phase. Once both\nKnightʼs have reached the Castle, count up the goal points and see who won. Each Valor Point your\nKnight has at the end of the game is worth 1 goal point, the Princess is worth 4 goal points, and each\ngoal is worth the number of goal points written on the back. The Wizard with the most goal points gets\nto join the Guild!\nIf this is your first time playing, we recommend you skip the setup, read the rules for the Knightʼs\nPhase, and play through the Knightʼs Training. After you have played through the Knightʼs Training,\nset up the game.\nSetup: Sitting opposite of your opponent, place the following cards in front of you, in order: The\nForest, The Crypt, The Pirate Ship. Your opponent does the same. Place the Princess on top of The\nCastle between both of your Pirate Ships. You will be creating stacks of cards next to each of the six\nlocation cards (the Castle is not a location card). Shuffle each type of card (the goals worth 2, 4, and\n6 points are different types). Deal two 2 Point goals, one 4 Point goal and one 6 Point goal to each\nwizard. The Wizards place these next to the location cards and read them aloud. Each Wizard is dealt\n5 Stack Cards, and the rest are set aside face down in the Stack Card deck. See the next page for an\nillustration of the setup.\n\ns\nThis is how the board should look at the beginning of the game, after setup:\nThis is how the game should look like after the Wizardʼs Phase (note that the stacks next to the\nlocations may not be the same):\n\nWhen playing A Wizard Did It... the players set up the Knightʼs Phase during the Wizardʼs Phase. To\nmake the outcomes of decisions made during the Wizardʼs Phase clear, we will first run through the\nrules governing the Knightʼs Phase. We recommend that you play through the Knightʼs Training after\nreading about the Knightʼs Phase\nThe Knightʼs Phase\n!\nThe Knightʼs Phase is played in turns. Each turn, your knight fights one encounter (if there are\nsome on top of the current stack), collects loot, and earns Valor Points if he killed any monsters. A\nKnight begins the game with 1 Valor Point. The Player who played the last card in the Wizardʼs Phase\nplays second in the Knightʼs Phase. If a location has no cards on it, you do not need to spend a turn\nthere.\nEncounters: an encounter is a set of purple cards (monsters and monster modifiers) drawn off the\ntop of the current stack (there may be stacks next to each Location Card, i.e. The Forest, The\nCrypt, and The Pirate Ship), ending in a red card (an item) or the bottom of the stack (the end of the\nlocation).\nThus on your turn, you:\n1. Draw cards off the top of the current stack (the first non-empty stack on your path to the Castle)\nuntil you draw an item. If you draw any blue cards (stack modifiers), follow the directions on the card\nand discard it (see Stack Modifier Section). The end of the encounter is the first item card drawn or\nthe end of the stack. If there are no cards in any of your stacks, you have reached the Castle! Take\nthe Princess card if you are the first one there, or end the game if you are second.\n2. Resolve the encounter\nI. Add all the strength of the monsters. Note that each location has an effect on encounters\n(Bears in The Forest are more powerful, etc), and that certain encounters pair together to\nmake stronger monsters (a Bear-Shark is worth 4 instead of 2; note that cards must be paired,\ni.e. a Bear-Shark Bear is only worth 5, since the second Bear has nothing to pair with). Note\nthat for the purposes of goals, monster modifiers apply to all monsters in the encounter (one\nWith Laser Beams gives all monsters in the encounter laser beams but only adds one strength\ntotal).\nII. Add all of your Knightʼs strength, which is a sum of your items bonuses and your Valor\nPoints (only count items you currently have equipped that you have previously won in an\nencounter).\nIII. If the monsters have more combined strength than you do, you lose. Otherwise you win\n(this means you win ties).\n3. If you won the encounter, take a Valor Point and any item the monsters were protecting (there may\nnot be one if the encounter ended by the end of the stack). If you lost the encounter, discard one\nValor Point (never discard your last Valor Point).\n4.If there were no monsters (even if there were monster modifiers), you take the item but donʼt gain\nany Valor Points.\n5. You equip any item you earned (you can equip any number and combination of items)\n6. After an encounter, discard all the cards in the encounter (other than items you have equipped) and\npass the turn. If you reached the end of a stack, your next turn begins in the next non-empty location\nstack (or youʼve reached the Princess and you can patiently await the arrival of the other Knight).\n7. If you lost an encounter this turn, pass the play to the other Knight. Otherwise, take another turn.\nNote that after resolving an encounter or a stack modifier, if either Wizard accomplished any goals,\nhe/she flips them over.\nThe game ends when both Knights have reached the Castle.\n\nWizardʼs Phase\n!\nThe Wizardʼs phase is also played in turns. Each turn, a Wizard plays a stack card face up on\na stack. There exists one stack next to each location card. A Wizard can play on any of the six\nstacks (his own or his opponentʼs).\n!\n!\nThe Wizard with the longest beard plays first (ties are resolved with the infamous Wizard\ngame, rock paper scissors).\n\"\nRemember, the Wizardʼs phase is played first, and sets up the encounters for the Knightʼs\nphase.\n!\nOn your turn, you play one stack card face up on a stack. The only exception is the Swap card;\nwhich is a spell that gets played once then discarded (it does not go on a stack). You cannot play an\nitem directly on top of another item (although playing a swap card or using stack modifiers may\naccomplish the same thing, which is allowed). After playing a card, draw another card from the Stack\nCard deck (if there are any left). The Wizardʼs phase ends when every stack card has been played.\n!\nYou may only look at the top card in each stack.\n\"\nGoals are only resolved in the Knightʼs Phase.\nGoals and Goal Points:\n!\nAt the beginning of the game, each player receives four goal cards. These cards remain face\nup unless they are accomplished during the Knight's Phase. Some goals apply to your own Knight,\nsome to your opponent's Knight, and some to either. Goals are accomplished only by the resolution of\na stack modifier or by the conclusion of an encounter. You get goal points at the end of the game\n(specified on the back of the card) for each goal you accomplish. You get 4 goal points if your Knight\nreached the Princess first. You gain 1 goal point for each Valor Point your Knight ended the game\nwith. Remember, the player with the most goal points at the end of the game wins!\nStack Modifiers:\nStack modifiers are played on top of a stack and are resolved during the Knight's Phase. Whenever a\nstack modifier is drawn during the Knight's Phase, its effect happens immediately and it is discarded\nbefore another card is drawn. Remember, some goals depend on stack modifiers, so you should\ncheck if any goals were accomplished after drawing a stack modifier.\nNote that goals that depend on stack modifiers use the card as a verb:\n- When an In Space is resolved, any discarded cards are now In Space for the purposes of any\ngoals.\n- When a Lurking is resolved, any moved cards are now Lurking cards for the purposes of any goals.\n- When a Surprise! is resolved, any moved cards are now Surprise! cards for the purposes of any\ngoals.\n\nKnight's Training, Encounter by Encounter\n\"\nThe goal of the Knight's Training is to help you understand the outcome of the cards\nyou will play during the Wizard's Phase.\nSetup: Place the Knight's Training stack next to the The Forest location card. Deal yourself the\n\"Make a Lurking Pigeon\" and \"Encounter a Pigeon Wrapped in Bacon\" goals. Give yourself 1 Valor\nPoint.\nFollow the instructions for the Knight's Phase to play through the Knight's Training. This guide will\ndetail what you should see and the outcome of what you will encounter.\n1. You draw a Ninja and a Sword. You have 1 Valor Point and therefore 1 strength. The Ninja has 1\nstrength. You win the battle. You gain a Valor Point and take the Sword.\n2. You draw a Shark, a With Laser Beams (1), a Kung Fu, and a Shield. The Shark With Laser\nBeams does Kung Fu, so you can only use your Valor to defeat it. You have 2 Valor and therefore\n2 strength. The Kung Fu Shark With Laser Beams has 2 strength. You win the battle. You gain a\nValor Point and take the Shield.\n3. You draw a Lurking card. Take the next 2 cards (Wrapped in Bacon and Pigeon) and put them at\nthe bottom of the stack (preserve their order). Flip over the \"Make a Lurking Pigeon\" goal, it is\ncompleted.\n4. You draw an In Space (1) card. Take the next card (a Force Field) and discard it.\n5. You draw a Bear, a Wrapped in Bacon, and a Pigeon card. You have reached the end of the stack.\nThe encounter has 2 strength because the Bear is in The Forest. You win the battle. You gain a\nValor Point because the Wrapped in Bacon bonus cancels out the Pigeon penalty. Flip over the\n\"Encounter a Pigeon Wrapped in Bacon\" goal, it is completed.\nAt the end of the training, you have 8 goal points: 2 from each goal you completed and 4 Valor Points.\nNotes: The first card played in a stack during the Wizard's Phase will be the last drawn from that\nstack during the Knight's Phase.\n\nWizard's Phase Summary\n1. Play a stack card face up on top of any stack or play a swap card. Announce out loud what you\nare playing. You may not play an item on top of another item.\n\"Suprise!\", \"Lurking\" or \"Swap\" cards may later result in an item being on top of another item. This is\nallowed.\n2. Draw a card.\nDo not mark any goal as completed until the Knight's Phase.\nKnight's Phase Summary\n1. Draw from the first non-empty stack closest to you until you draw an item or reach the end of the\nstack. Follow the instructions on any stack modifier you draw when you draw it.\n!\nIf you did not draw a monster before drawing an item or reaching the end of the stack, discard\nthe cards you drew, take the item (if any), and repeat step 1.\n2. Fight! See \"Resolving an Encounter\".\n3. Did you win?\nNo? Shame! Lose 1 Valor Point and end your turn. Discard all cards you drew including the item.\nNever go below 1 Valor Point. Check to see if any goals were completed. Pass the turn to the\nnext Knight.\n!\n!\nYes? Equip the item. Gain 1 Valor Point, plus one extra Valor Point for every Wrapped in Bacon,\nand minus one Valor Point for every Pigeon. You can never lose Valor Points for winning an\nencounter. Check to see if any goals were completed. Take another turn - go back to step 1.\n\nResolving an Encounter - A Summary\nEncounters:\nThe Encounter consists of all the monster and monster modifier cards you drew before drawing an\nitem or hitting the end of the stack.\nCalculating your Strength:\nIf the monster does Kung Fu, your strength is equal to the number of Valor Points you have.\nOtherwise your strength is equal to the number of Valor Points you have plus the bonuses awarded\nby items you have won in previous encounters. Do not take into account the item you are fighting for.\nCalculating the encounter's Strength:\n1. Pair up all the combo encounters. These are worth 4 strength each.\n2. Every lone monster except Pigeons is worth 1 strength each.\n3. For every monster on their home turf, add 1 strength.\n4. Add 1 or 2 strength (specified on the card) for every With Laser Beams card present with the\nmonsters.\nCombo Encounters:!!\nPirate-Ninja! !\n!\nBear-Shark! !\n!\n!\n!\n!\n!\n!\n!\nHome Turf Advantage:\nPirate on The Pirate Ship\nBear in The Forest\nVampire-Zombie!\n!\n!\n!\nVampire in The Crypt\nDeciding Outcome:d\nYour Strength > Monster's Strength = You Win!\nYour Strength = Monster's Strength = You Win!\nYour Strength < Monster's Strength = You Lose...\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g3_cards.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/ff1c2a349f3d6ec128938c8ecef3a9e7_MITCMS_608F10_p1g3_cards.pdf",
      "content": "Trait\nAccent\nTrait\nAccent\nTrait\nAccent\nTrait\nAthletic\nTrait\nAthletic\nTrait\nAthletic\nTrait\nCharming\nTrait\nCharming\nTrait\nCharming\n\nTrait\nExotic\nTrait\nExotic\nTrait\nExotic\nTrait\nFunny\nTrait\nFunny\nTrait\nFunny\nTrait\nHandsome\nTrait\nHandsome\nTrait\nHandsome\n\nTrait\nIntelligent\nTrait\nIntelligent\nTrait\nIntelligent\nTrait\nRich\nTrait\nRich\nTrait\nRich\nTrait\nSexy\nTrait\nSexy\nTrait\nSexy\n\nTrait\nWitty\nTrait\nWitty\nTrait\nWitty\nLauren\nI want:\nAccent\nFunny\nJeanine\nI want:\nAccent\nRich\nAbby\nI want:\nAccent\nAthletic\nAllison\nI want:\nCharming\nFunny\nKelly\nI want:\nCharming\nHandsome\nJulie\nI want:\nCharming\nRich\n\nNicole\nI want:\nExotic\nFunny\nMichelle\nI want:\nExotic\nHandsome\nJennifer\nI want:\nExotic\nSexy\nSarah\nI want:\nHandsome\nIntelligent\nRachel\nI want:\nIntelligent\nAthletic\nSuzie\nI want:\nIntelligent\nWitty\nKatie\nI want:\nRich\nSexy\nRebecca\nI want:\nSexy\nWitty\nKaren\nI want:\nAthletic\nWitty\n\nAction: Swagger\nSteal Someone's\nGirl\nChoose any opponent's girl card\ncurrently in play, take it (with modifier\ncards, if applicable), and play it\nalongside your current set of girl\ncards.\nIf the opponent is left without a girl\ncard, he immediately draws another\ngirl card from the pile and plays it.\nAction: Swagger\nSteal Someone's\nGirl\nChoose any opponent's girl card\ncurrently in play, take it (with modifier\ncards, if applicable), and play it\nalongside your current set of girl\ncards.\nIf the opponent is left without a girl\ncard, he immediately draws another\ngirl card from the pile and plays it.\nAction: Swagger\nTrade Girls\nChoose any one girl currently in\nplay by an opponent and any\none girl currently in play by you\nand exchange them.\nAction: Swagger\nTrade Girls\nChoose any one girl currently in\nplay by an opponent and any\none girl currently in play by you\nand exchange them.\nAction: Swagger\nSteal Someone's\nCard Blindly\nTake\none\ncard\nfrom\nany\nopponent's hand, and add it to\nyour current hand.\nAction: Swagger\nHumiliate!\nForce any single opponent to\ndiscard all of his current traits\nin play.\nAction: Swagger\nPimp Your Ride\nAfter completing your current\nturn, take another turn.\nAction: Swagger\nWrite a Ballad of\nLove\nDraw another girl card from the\npile and play it.\nWhen played, this card counts\nas the Charming trait.\nAction: Swagger\nSettle\nPlay this on any one of your own girl\ncards. That girl now requires only one\ntrait for the player to win. Designate\nwhich trait to ignore by placing this\ncard under the girl card such that this\ncard is visible on the side adjacent to\nthe trait you wish to ignore.\nThis card and the Hard to Get card\ncancel each other out.\n\nAction: Swagger\nTake Salsa Lessons\nDiscard any Rich traits you\nhave in play as you play this\ncard.\nWhen played. This card counts\nas the Sexy trait.\nAction: Swagger\nTravel the World\nDraw another action card from\nthe pile.\nWhen played, this card counts\nas the Exotic trait.\nAction: Swagger\nNice Outfit!\nDraw an extra card from all\nthree piles (Trait, Action, and\nGirl). Play the extra girl card\nalongside your current set of\ngirl cards.\nAction: Swagger\nPlaying the Field\nDiscard any number of girl\ncards you have in play, then\ndraw that many girl cards from\nthe\npile\nand\nplay\nthem\nalongside your remaining set of\ngirls, if any.\nAction: Swagger\nFunny Story\nDraw an extra girl card from the\npile, and play it alongside your\ncurrent set of girl cards.\nAction: Swagger\nDance Floor\nCollect every girl card currently\nin play and redistribute them\nrandomly, such that each player\nreceives the same number of\ngirl cards he originally had\nbefore this card was played.\nAction: Burn\nBring up a Wiki on\nYour Phone (to Show\nSomeone is Stupid)\nTake any one Intelligent trait\ncurrently\nin\nplay\nby\nan\nopponent, and then play it as\nyour own.\nAction: Burn\nIdentity Theft\nTake\nany\none\nRich\ntrait\ncurrently\nin\nplay\nby\nan\nopponent, and then play it as\nyour own.\nAction: Burn\nSteal Punchline\nTake any one Funny trait\ncurrently\nin\nplay\nby\nan\nopponent, and then play it as\nyour own.\n\nAction: Burn\nBeat Someone\nin a Race\nTake any one Athletic trait\ncurrently\nin\nplay\nby\nan\nopponent, and then play it as\nyour own.\nAction: Burn\nPoint out\nFake Accent\nChoose\none\nAccent\ntrait\ncurrently\nin\nplay\nby\nan\nopponent, and discard it.\nAction: Burn\nPoint out\nToupee\nChoose one Handsome trait\ncurrently\nin\nplay\nby\nan\nopponent, and discard it.\nAction: Burn\nPoint out\nArtificial Tan\nChoose\none\nExotic\ntrait\ncurrently\nin\nplay\nby\nan\nopponent, and discard it.\nAction: Burn\nThat's Her Sister!\nIf someone has two or more girl\ncards in play, discard all of that\nperson's girl cards. The target\nimmediately draws another girl\ncard from the girl pile and plays\nit.\nAction: Burn\nFarting\nDiscard\nany\nCharming\nor\nSexy traits in play by the target.\nThis card counts as a Funny\ntrait. The target places this card\nalongside his other traits.\nAction: Burn\nHard to Get\nChoose any one girl in play by an\nopponent. That girl now requires\ndouble of one of her desired traits.\nDesignate this trait by placing this\ncard under the girl card such that this\ncard is visible on the side adjacent to\nthe trait the opponent needs two of.\nThis card and the Settle card cancel\neach other out.\nAction: Burn\nSpit Mad Game\nWhen played, this card cancels\nany single immediate action on\nyou that causes any sort of trait\nloss.\nAction: Burn\nBilingual\nWhen played, this card cancels\nthe\nimmediate\nloss\nof\nCharming and/or Intelligent\ncaused by an opponent's action\non you.\nThis card also counts as an\nAccent trait.\n\nAction: Burn\nWitty Comeback\nAny action played immediately\nagainst you with a negative\neffect now targets the person\nwho played the action.\nThis card also counts as a Witty\ntrait.\nAction: Burn\nConfidence\nWhen\nplayed,\ncancels\nthe\nnegative effects of any single\naction\nplayed\nimmediately\nagainst you.\nAction: Burn\nYou're a Jerk!\nWhen played, this card cancels\nany single immediate action on\nyou that causes any sort of trait\nloss.\nAction: Burn\nTake Care of Drunken\nRoommate\nIf another player is about to pick up a\ngirl and win, discard the girl card\nwhich is allowing him to win.\nIf the opponent is left without any\nother girl cards, he must immediately\ndraw another girl card from the girl\npile and play it.\nAction: Burn\nLet's Just Be\nFriends\nThis card negates any action\ndone by an opponent that\nallows him to receive another\ngirl card.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g3_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/59a712ed88c07bad5a22a0cb466074db_MITCMS_608F10_p1g3_rules.pdf",
      "content": "The Game of Conquest\nRecommended # of players: 3-6\nApproximate playing time: 5-15 minutes\nFor ages 13 and up\nGame contents:\n15 Girl cards\n30 Trait cards\n32 Action cards\nWelcome to The Game of Conquest! You and your companions are lonely single\nmales seeking companionship with the opposite sex. To assert dominance and\nprove your superiority as the alpha male among your group, you endeavor to be\nthe first to get a girl - but other desperate men will be actively attempting to\nthwart your every step.\nThis game is quick to set up and easy to pick up. Its lively pace will provide many\nopportunities for everyone to impress the girl and bring her home.\nGame rules:\nStarting out:\n1. Separate trait, action, and girl cards into their own stacks. Place each stack\nface down in the middle of the table, while leaving room for discard piles next to\neach stack.\n2. The dealer is chosen by finding out the player who has most recently obtained\na girl's phone number. For back-to-back games, the winner of the previous game\nbecomes the dealer.\n3. Place one girl card face up in front of each player. As the game progresses, the\ngirls may change, increase, move, etc., but they must always remain face up and\nvisible to all players. You must always have at least one girl card in front of you.\nIf circumstances leave you with no girl, immediately take another girl from the\npile and play it.\n4. Each player also receives 2 trait and 2 action cards, face down. These cards\nmake up the starting hands. Each player may look at his hand at any time and\norganize it as he sees fit.\n\nPlay:\n5. The dealer goes first. Players take turns going clockwise during gameplay.\n6. At the beginning of each turn, a player draws 1 card from the action pile and 1\ncard from the trait pile. During a player's turn, he may play up to 1 trait card, and\n1 Swagger card.\n7. During his turn, the player has the option of discarding any two cards in his\nhand and, afterwards, drawing a single card either from the trait pile or the action\npile. This action counts as playing a Swagger card and can only be done once per\nturn.\nPlayable cards:\n8. Trait cards are always placed face up in front of a player. Traits are only\nconsidered in play when placed in this manner, not when they are merely in a\nplayer's hand.\n9. Action cards are made up of Swagger and Burn cards.\nSwagger cards may only be played on your turn, and are placed into the\naction discard pile after use, unless specified otherwise.\nBurn cards may be played at any time during gameplay, and are also\ndiscarded upon use, unless specified otherwise.\nWinning:\n10. Your objective is to win the girl (or one of them, provided a player has\nmultiple girls) by having all the traits the girl desires in play. If a player achieves\nthis, and none of the other players can stop him, he wins!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g4_cards_a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/c46251034d42d701d9751f61d70eb223_MITCMS_608F10_p1g4_cards_a.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g4_cards_b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/079fd8d49c5e2ecea74e34edf520aea0_MITCMS_608F10_p1g4_cards_b.pdf",
      "content": "AVERAGE\nAMY\nDESCRIPTION\nNEEDED\n\nTANYA\nwhen person joins\nfamily, player dis-\ncards 2 actions of\ntheir choice\n\" it runs in the\nfamily\" - can opti-\nnally buy another\nchild when having\nor adopting a\nbaby\ncan only have kids\nworth 5 people\npoints or less\nwhen the total\nnumber of people\npoints in the famly\nreaches 12, this\nperson dies\nthis person can'\nt\nhave more than 2\nsiblings\nJUSTIN\nMICHELE\nKATE\nPHILIP\nBLAND\nBLAKE\nDESCRIPTION\nNEEDED\nCANDY\nbuy the husband\nautomatically\nwhen you buy this\nperson\nROBERT\nhaving this as a\nchild causes the\nparents to not\nhave any more\nchildren\nDESCRIPTION\nNEEDED\nAVERAGE\nCANDY?\nAMY?\nDESCRIPTION\nNEEDED\nbuy the husband\nautomatically\nwhen you buy this\nDerson\n\nDEBBIE\nDOWNER\nSAM\nPATRICK\nDANIEL\nALEX\nDULL\nDOLLY\nBORING\nBOB\nall her siblings lose\none people point\nall sickness, disas-\nter, and divorce\ncards are targeted\nat this character\ndiscard any two\nactions to save\nthis person from\ndisaster\nDESCRIPTION\nNEEDED\nDESCRIPTION\nNEEDED\n(Insert androg-\nynous symbol\nhere.)\n(Insert androg-\nynous symbol\nhere.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p1g4_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/5899cad42cfa857447be1b2b968e1b75_MITCMS_608F10_p1g4_rules.pdf",
      "content": "Family Dysfunction\nA game of family building and drama\nObject\nHave the most People Points after all people have been played\nMaterials\nA deck of People cards, Action cards, a Graveyard card, and two Fountain of Youth\ncards\nSetup\nShuffle the Action cards and set them aside. Place the Graveyard card between the\ntwo players, with a Fountain of Youth on either side, facing the players. Off to the\nside, lay out all the People cards so they can be easily seen and read by both players.\nEach player starts with 5 Drama points (to be counted on pen and paper), which are\nused as currency, and 2 Action cards. The player with the most siblings chooses\nwhether to choose first or play first (or closest upcoming birthday, if there's a tie).\nThe player who chooses first gets to buy a person from the People stock and place it\non their Fountain of Youth. The person must cost 5 or less Drama Points (the\nnumber on the top right of the card) and is worth the number of People Points as\nnoted on the bottom left of the card. This person cannot be harmed for the whole\ngame (or transfer families), as long as they have the Fountain of Youth. After the first\nplayer buys a person, the next player buys a person for their Fountain of Youth, and\nthen that player starts the game.\nGameplay\nAt the beginning of a turn, players draw 2 Actions and may either:\n* Discard any number of cards from their hand, gaining 1/2 the sum of all Drama\npoints noted on the cards (rounded up; cards worth 0 yield 1 point), and redraw.\n* Play an action card, gaining the noted amount of Drama points. See card rules for\ndetails.\nIf a player has more than 5 cards at the end of their turn, they must discard down to 5\ncards, gaining half their Drama points.\n\nWhen all People cards have been purchased, the player with the most People Points\nwins.\nCard Rules\nPeople may be purchased only when playing a Marriage, Have a Baby, or Adopt card,\nunless otherwise noted.\nMarriage - When players play a marriage card, they choose a person on the board to\nplay it on. This person can be from either family, and their spouse must either be an\nunmarried person on the board, or must be purchased from the People stock using\nDrama points. Married couples are denoted by having their cards overlap each other\non the board. People of any gender may be married, however, only Male-Female\ncouples may be the target of a \"Have a Baby\" card. Same-sex couples can use the\n\"Adopt\" card. For all intents and purpsoses, spouses are considered children of the\nother spouse's parents. It does not matter which spouse came first or which is the\nbiological child of the parent.\nHave a Baby / Adopt - When playing either of these cards, a person is purchased\nfrom the People stock and placed underneath the chosen parent(s).\nDiseases, Disasters, Divorces, Statuses - These cards are destructive, and generally kill\na member of the family, or alter their ability to have children. They can be instantly\ncountered by Panacea, Deus Ex Machina, Marriage Counseling, and Hormone\nTherapy, respectively. Family members killed or removed from the game go to the\nGraveyard, and are no longer considered part of the People stock. Status cards remain\non the board attached to the afflicted person until countered or the person dies.\nWhen a player counters one of these cards, the player that played the action still gets\nthe Drama Points.\nN.B. - The term 'siblings' refers to anyone in a given generation, even if they have\ndifferent parents, or are married.\nIf a player chooses to marry or adopt someone from the opponent's family, the\nspouse's People card is taken and placed in the player's family.\nIf a player plays a card that requires discarding actions, the discarding player still\nreceives half the Drama points from what they discard, unless noted otherwise.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\n\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p2g1_board.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/f01df193934e11a415dcbed865c8155b_MITCMS_608F10_p2g1_board.pdf",
      "content": ")0.&\n\n)0.&\n\n(*#40/\n\n5&3.*/\"-\n\"3#:4\n:\"-&\n.*5\n\"11-&\n(00(-&\n#63(&3\n,*/(\n$)\"4&\n#\"/,0'\n\".&3*$\"\n$)*/\"\n3644*\"\n1*9\"3\n.*$3040'5\n#-*;;\"3%\n)\"37\"3%\n$\"-5&$)\n5\"$0\n#&--\n'\"$&#00,\n.$%0/\"-%4\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\n\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p2g1_cards.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/d1050bf24d4e6bdafece2662eb8018e7_MITCMS_608F10_p2g1_cards.pdf",
      "content": "Total\nCPU\nUsed\nCPU\nTotal\nCPU\nUsed\nCPU\nFirewall\nFirewall\nDDOS\nDDOS\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\n\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MITCMS_608F10_p2g1_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-608-game-design-fall-2010/8887b9446a25a76d2b1f561586b1ed38_MITCMS_608F10_p2g1_rules.pdf",
      "content": "Black Hat\nRules and Information v1.6\nWelcome!\nFor years, you have been a king of the information superhighway. Using your skill, ingenuity, and a bit of luck,\nno computer on the cloud has ever been out of your reach. But now, a challenge has been issued. It's time\nto don your black hat and prepare to fight. The goal is simple - whoever hacks the Gibson supercomputer1\nwill win eternal glory. To achieve this goal, you will be researching software exploits, blocking computers\nfrom use, installing firewalls, and taking over computers.\nBasic Information\n2.1\nNumber of players\nThis game supports 2 players (hereafter known as Hackers).\n2.2\nEstimated play time\nEstimated play time is 30-40 minutes.\n2.3\nMaterials\n2 sets of Rules and Information with cheat sheets\n-\n- Playing Board with a computer network, 2 sets of 4 software research dials (red, green, blue, and yellow\nto indicate how close a player is to discovering an exploit for a particular color of software), 2 sets of\nTotal CPU and Used CPU spaces, 1 DDOS space, and 1 Firewall space.\n- The computer network should have 2 personal computers, approximately 19 cloud computers, and 1\nGibson Supercomputer. Each computer has a color or several colors determining which software have\nbeen installed on it (and therefore, which software exploits will be effective)\n- 22 red and 22 green Rootkit markers to signify possession of computers by hackers\n1Check out the movie Hackers\n\n- 10 yellow DDOS Markers\n10 blue Firewall Markers\n-\n60 CPU Beans\n-\n- 12 6-sided dice (Note: True hackers use digital dice. If you would like a faster and more convenient way\nto roll dice, grab a laptop and use the program at: web.mit.edu/alect/www/blackhat/dice.html)\n2.4\nHow to Win\nThere are two ways to win. A hacker can either:\n- Successfully take over the Gibson Supercomputer\n- Take over all the other hacker's computers\nLet's play!\n3.1\nSetup\nEach hacker gets one of the starting computers which have a CPU of 4. Place a rootkit marker on it to\nindicate ownership. Each hacker then takes 4 CPU \"beans\" and places it into the respective \"Total CPU\"\nspace to indicate their current CPU total. Each hacker sets all of their research dials to 0.\n3.2\nHow to play\n3.2.1\nDetermine who goes first\nThe player who can come up with the coolest hacker nickname goes first.\n3.2.2\nA turn\nThis is information about what a turn looks like:\n- A hacker gets a number of CPU to spend based on the computers she controls. Unless a computer has\na number written on it, assume its CPU is 1. Hackers should use CPU beans to keep track of how\nmuch CPU they have. Extra CPU does not carry over from turn to turn. At the start of her turn, a\nhacker piles all her CPU beans onto the Total CPU space.\n\n- A hacker can spend as much CPU during her turn as she wants, limited only by the total CPU. As a\nhacker spends CPU, she should move spent CPU beans from the Total CPU space to the Used CPU\nspace to keep track of how much CPU she has left to spend.\n- A hacker can spend CPU to perform the following actions:\n- Research Exploit: A hacker can spend any number of CPU to research an exploit for a certain\npiece of software. She can increase the corresponding research dial a number of steps equal to the\namount of CPU she spends to indicate her progress. When a hacker reaches level 6 of a single\ncolor, the hacker has discovered an exploit and computers with the corresponding color become\neasier to rootkit. If the hacker is the only one to have discovered this exploit, it's a \"zero-day\"\nexploit and it's even easier to rootkit computers of that color until another hacker discovers that\nexploit.\n- Research Patch: A hacker can spend any number of CPU to research a patch for a certain piece\nof software. When a patch is researched, any hacker with research for that piece of software has\nto decrease the research counter for that piece of software a number of steps equal to the amount\nof CPU spent on the patch. If a player no longer has enough research to exploit the software, that\nplayer no longer has an exploit for the software. A common strategy to prevent another player\nfrom removing your exploits is to research a piece of software beyond level 6 (the research dials\ngo up to 10).\n- DDOS Attack: A hacker may DDOS a computer that neighbors one of their computers. A\nparticular computer may only be DDOSed once per turn. DDOSing a computer takes twice the\namount of CPU on the computer the hacker wishes to DDOS. That computer is shut down until\nthe hacker decides not to DDOS anymore. To signify that it has been shut down, place a DDOS\ntoken on it. A computer that is shut down cannot be attacked and cannot contribute to the total\nCPU usable by the owner. The owner of the DDOSed computer should set aside a number of\nCPU beans equal to the CPU of the DDOSed computer to indicate that these cannot be used\non the next turn. Essentially, a DDOSed computer acts as if it were removed from the board, so\nrules that require a hacker to have a neighboring computer act as though the DDOSed computer\ndoes not exist. A computer with a firewall on it cannot be DDOSed. DDOSes are removed at the\nbeginning of the hacker's next turn.\n- Install Firewall: A hacker can place a firewall on an existing computer to prevent a future DDOS\nor defend a computer against potential future attacks. Installing a firewall costs twice the amount\nof CPU of that computer. Note that a player may install multiple firewalls on a computer.\n\nFirewalling must be performed at the end of the hacker's turn. Firewalls are removed at the\nbeginning of the hacker's next turn.\n- Install Rootkit: A hacker can attempt to invade and install a rootkit on any computer neighboring\na computer they own that was not invaded on the same turn. A hacker may only attempt to invade\na particular computer once per turn. To rootkit a computer, the invading hacker must pay the\namount of CPU on the target computer to get a single die roll. The invading hacker may then\npay for extra die rolls at a cost of 2 CPU per die roll. The hacker must announce the number of\nextra dice to be used before rolling the dice. The player then rolls a number of 6-sided dice based\non how much CPU she spent. The maximum value of the hacker's rolls determines a successful\nrootkit install depending on conditions outlined below:\n∗ For a completely protected computer (no exploits), the player must roll a max of 6 to succeed.\n∗ For a computer with a color of software for which the hacker has an exploit, the hacker must\nroll a 5 or a 6 to succeed. Note that a computer with multiple colors can be exploited through\nany of those pieces of software.\n∗ For a computer with a color of software for which the hacker has a \"zero-day\" exploit, the\nhacker must roll a 4, 5, or 6 to succeed.\nIf the computer is owned by another hacker, the attacker must first roll using the above rules.\nIf successful, the attacker and defender then have a roll-off to determine who gets the computer.\nThe roll-off rules are as follows:\n∗ The defending hacker can spend up to the amount of CPU on the defending computer to\nget one die roll per CPU. This CPU cannot be used on the defending hacker's next turn. If\nthe defending computer has a firewall(s) installed on it, the defending player can choose to\ndiscard a number of these firewalls to gain a corresponding number of extra dice rolls.\n∗ The attacking hacker can spend up to the amount of CPU on any computers she owns that\nneighbor the defending computer to get a single die roll per CPU. Note that the amount\nof CPU the attacking hacker can spend cannot exceed the amount of CPU they have left\nfor their turn. Whoever gets the higher total for all dice rolls wins the roll-off and gets the\ncomputer. If the defending hacker no longer has any computers, she is out of the game.\nIf a hacker has gained a new computer on this turn, she can take a number of CPU beans equal\nto the amount of CPU on the computer she just acquired. These CPU beans may not be used\nuntil the next turn.\n\nTurn cheat sheet\nAt the beginning of each round, remove any DDOS or Firewall tokens placed last turn.\nHere's what you can do during a turn and how much CPU it costs:\n- Research Exploit - Cost: Same as the amount you wish to research.\n- Research Patch - Cost: Same as the amount you wish to research.\n- DDOS Attack - Cost: Twice as much CPU as the target computer\n- Install Rootkit - Cost: The amount of CPU on target computer + 2 CPU for every additional die roll.\nRolls for successful install:\n- Completely protected computer: 6\n- Exploited computer: 6, 5\n- Zero-day exploited computer: 6, 5, 4\nCombat rules:\n1. Attacker chooses number of CPU used for die rolls (1 die roll/CPU, up to the number of computers\nflanking the defending computer).\n2. Defender chooses the number of CPU used for die rolls (1 die roll/CPU, up to the amount of CPU\non the defending computer + extra die rolls if firewalls are discarded from defending computer.).\n3. Both hackers roll (if neither wants to roll first, defender rolls first)\n4. Hacker with higher total wins the computer\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nCMS.608 / CMS.864 Game Design\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}