{
  "course_name": "Gender & Media: Collaborations in Feminism and Technology",
  "course_description": "This course examines representations of race, class, gender, and sexual identity in the media, with a particular focus on new media and how digital technologies are transforming popular culture. We will be considering issues of authorship, spectatorship, (audience) and the ways in which various media content (film, television, print journalism, blogs, video, advertising) enables, facilitates, and challenges these social constructions in society.",
  "topics": [
    "Social Science",
    "Communication",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Social Science",
    "Communication",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 3 hours / session\n\nPrerequisite\n\nThere is no prerequisite for this course.\n\nCourse Overview\n\nThis course examines representations of race, class, gender, and sexual identity in the media, with a particular focus on new media and how digital technologies are transforming popular culture. We will be considering issues of authorship, spectatorship, (audience) and the ways in which various media content (film, television, print journalism, blogs, video, advertising) enables, facilitates, and challenges these social constructions in society.\n\nIn addition, we will examine how gender and race affects the\nproduction\nof media, and discuss the impact of new media and digital media and how it has transformed access and participation, moving contemporary media users from a traditional position of \"readers\" to \"writers\" and / or commentators. Students will analyze gendered and racialized language and embodiment as it is produced online in blogs and vlogs, avatars, and in the construction of cyberidentities. The course provides an introduction to feminist approaches to media studies by drawing from work in feminist film theory, journalism, cultural studies, gender and politics, and cyberfeminism.\n\nDistributed Open Collaborative Course\n\nThis course was designed as a a DOCC, a Distributed Open Collaborative Course, in conjunction with others running simultaneously at other colleges and universities by members of\nFemTechNet\n, an international consortium of feminist scholars, cultural producers, and educators. Students engaged in \"conversations\" in dialogue with each other and also with participants in other courses, using digital technology to supplement real-time class interactions. Read\nFemTechNet\nDocuments.\n\nCourse Objectives\n\nUpon successful completion of this course, students will be able to do the following:\n\nRecognize diversity across\naudiences, content and producers\nof media\n\nIdentify stereotypes of gender, race, class, and sexual identity in media portrayals\n\nLocate examples of\nframing, intersectionality, and symbolic annihilation\nin media\n\nAnalyze texts in context of cultural and social identities, considering how reality is socially and discursively constructed by media\n\nDiscuss\nmedia literacy\nin contemporary terms, in light of 21\nst\ncentury developments in online cultural production and new media\n\nTo engage in collaborative learning with an aim to embody and enact a different way of being scholars, through flattened hierarchies and collaboration within and outside of established institutions.\n\nCourse Texts\n\nboyd, danah.\nIt's Complicated: The Social Lives of Networked Teens\n. Yale University Press, 2015. ISBN: 9780300199000.\n\nJenkins, Henry, Sam Ford, and Joshua Green.\nSpreadable Media: Creating Value and Meaning in a Networked Culture\n. NYU Press, 2013. ISBN: 9780814743508. [Preview with\nGoogle Books\n]\n\nCourse Requirements\n\nAttendance and participation are critical to your success in this course. Each class session will focus on one or more topics and be accompanied by appropriate readings. Please be sure to read all assignments in advance, come to class on time and be prepared to discuss your reactions and ideas. Failure to attend will adversely affect your grade. Missing more than two weeks of class is grounds for failure in this course. Active participation in discussion in class and responding to classmate's blog posts is necessary to receive full credit.\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and participation\n\nBlog commentary / collaborations with weekly posts\n\nCritical response paper\n\nVideo keyword dialogue\n\nFinal project",
  "files": [
    {
      "category": "Assignment",
      "title": "Title WGS.111 S16 Final Paper Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-111-gender-media-collaborations-in-feminism-and-technology-spring-2016/2aa8d30af24337a5b709eb323d7c763a_MITWGS_111S16_FinalPaper.pdf",
      "content": "Final Project Guidelines - WGS 111\nINDEPENDENT TOPIC OPTION\n\nDate Due: week of last class\nLength: 5-8 pages\n\nThe final project should reflect feminist analysis of a media \"text\" of your choice, in which you\napply concepts we've studied this term, bringing a gender, sexuality, race or class critique to\nyour topic. This final research paper represents the cumulative effort of your work this semester,\nand should be 5-8 pages in length, and must include a minimum \"Works Cited\" list of five\ncritical academic sources, two or three of which must be taken from assigned course readings.\nAdditional secondary sources may be cited at your discretion; be sure to distinguish between\nprimary sources (the text, whether print or visual, that you wish to analyze or critique), and\nsecondary sources (critical commentary on that text or media phenomenon). Secondary sources\nmay include blog entries and comments as well as independent research including peer-reviewed\nacademic books and journals, but should also include at least two assigned readings from our\ncourse. Depending on your topic, you may also find it interesting and informative to seek out\nnon-academic critical responses, such as those emerging from social media platforms.\n\nYour research paper should clearly identify the topic of your paper, but also suggest a thesis\nargument you wish to make, or an answer to a central research question. It is a good idea to set\nup the basic argument of the paper right away in a thesis statement at the end of the introduction;\nthat way, your reader will not be wondering what claim you are attempting to make throughout\nthe essay.\n\nSome possible examples of valid topics might include analysis of an ad campaign such as\nubykotex or the controversial PETA ad use of female models, a film or TV sitcom's\nrepresentation of female figures or protagonists, fan fiction, blogs and their readership, race &\ngender representation in games or use of avatars, fashion magazines and their\nrelationship/representation of female sexuality, masculinity as it is portrayed in a specific media\nsite (such as those mentioned above), mashups, cyberactivism, gender analysis of social\nnetworking, photography, etc. If you have an idea and are not sure if it is viable, send me an\nemail and ask.\n\nPresentations - each project (some are being done in pairs or small groups, some individual)\nwill give a short presentation on our last day of class - plan to show a brief clip or image related\nto your project, if relevant, and say a few words about the argument you are making or what you\ndiscovered. Classmates can give some feedback which then may serve as a basis for revision or\ncompletion of the final project, to be submitted by the end of that week. This should be relatively\ninformal! Please do not think you have to read an entire paper or present every detail of the\nproject in these presentations; the idea here is to share your work and give everyone a chance to\nget some peer review.\n\nFinal Project Guidelines - WGS 111\nSELFIE PROJECT OPTION 1\n\nIMAGE PRODUCTION ASSIGNMENT\nLocate three photos of yourself on your phone, computer or posted to social networks you think are flattering. Locate\nthree photos of yourself that you find to be unflattering, funny or embarrassing in some way.\n\nPhoto Essay (2-3pp)\nLabel your six photos A-F, and then write a 2-3 page photo essay in which you explain which pictures would be the\nbest and worst to use for the purposes below. In your explanations, be as specific as you can (e.g. don't say \"this\nphoto looks professional,\" explain how and why you came to that conclusion, based on signifiers like clothing,\nbackground details, and so forth.)\n-\nFacebook profile page\n-\nCompany profile for someone who works in a bank\n-\nDating site profile page\n-\nHistory book showing what everyday life was like in 2014 in your country\nContext Analysis (3-5pp)\nGo back to your photo essay and take a look again at the photo you chose as best and worst for the category,\n\"History book showing what everyday life was like in 2014.\" Now we are going to engage in a thought\nexperiment: Pretend you are an archeologist from, say 5000 years from now, and these photos are the only\nexisting records of human culture from 2014. What would you know about culture, based solely on these photos?\nWhat important information about our culture would be missing?\nUsing references to our background readings on selfies (Senft, Mead, Goffman, Althusser), explain how\nsocial/cultural ideas about gender, race, class, and embodiment inform our interpretation of these images, and\nhow we assign meaning to them in different contexts. You may compare conclusions you have drawn in your\nPhoto Essay to critical observations made by other selfie projects like one of these:\n\"I Too Am Oxford.\" The Tumblr site is here:\nhttp://itooamoxford.tumblr.com/\n\n\"We are all Neda.\" Look at images here:\nhttps://www.google.com/search?q=we+are+all+neda&client=firefox-a&hs=jsE&rls=org.mozilla:en-\nUS:official&channel=fflb&source=lnms&tbm=isch&sa=X&ei=iv4WVIfSAfaNsQSo-\nILQBw&ved=0CAgQ_AUoAQ&biw=1200&bih=643 Read more here:\nhttps://en.wikipedia.org/wiki/Death_of_Neda_Agha-Soltan\n\"What I really do\" meme at http://knowyourmeme.com/memes/what-people-think-i-do-what-i-really-do\n\"Which Picture Would they Use?\" at http://iftheygunnedmedown.tumblr.com/\n\"Don't Shoot\" Selfie taken at Howard University\nhttp://www.washingtonpost.com/blogs/style-blog/wp/2014/08/14/the-story-behind-the-viral-dontshoot-\nphoto-at-howard-university/\n\"Women Laughing Selfie\" meme at http://www.bbc.com/news/blogs-trending-28548179\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nWGS.111 / CMS.619 Gender & Media: Collaborations in Feminism and Technology\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "WGG.111 S16 Keyword Video Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-111-gender-media-collaborations-in-feminism-and-technology-spring-2016/3da34e82e6f09eb28ac9c86b2ce9ad04_MITWGS_111S16_KeywordVdo.pdf",
      "content": "WGS.111: Gender and Media\nKeyword Video Assignment\nDeadline: Session #7 - post on Vimeo and link from your blog\nA Keyword Video is a short, do-it-yourself video project - aim for something in the 3-5 minute range,\nin line with the sample student keyword videos you can see on the FemTechNet Vimeo channel at\nFemTechNet Keywords and FemTechNet Group Videos.\nUse whatever tools are available to you -- be it a video editing program, an app on your phone, a\ncoding language or even Google Hangout. You choose. You may work alone or in a small team (please\nno more than 3-4; pairs are best!) The video should explore one keyword; some suggestions here,\nthough you can work on one of your own choosing if you'd rather, as long as it is relevant to our\ncourse!:\nsexuality\ngender\nfemininity\nmasculinity\nrepresentation\nbodies\nrace\nclass\nconsumerism\nObjectives\n-\nMake feminist and or feminist media studies theoretical terms, ideas, and arguments\napproachable, accessible, and/or available in other formats, vernaculars, and to new audiences\n-\nMake reference to at least one course text relevant to the keyword you have selected\n-\nParticipate actively and with increased sophistication through the use of social media and other\nonline tools - you may incorporate outside footage, image, or text, following fair use guidelines to\nreference an example in making a critical argument or building a dialogue around the concept you\nare demonstrating.\nSOME SAMPLE FORMATS\nSpeech Video - Write a speech or outline about your topic and record yourself speaking directly into\nthe camera or into a microphone plugged into your computer's mic input. You can use templates or\ncutaways to illustrate a speech video.\nVoice Over Video - The voice over video is ideal for those who do not want to physically appear in a\nvideo, or who wish to illustrate their thoughts with images or footage. To produce a voice over video,\nrecord your speech with a camera, a microphone and external recording device, or a microphone\nplugged into your computer's mic input. Import the audio into your editing platform and then\nillustrate the video with various images or video footage.\nIn The Field Documentary - Produce a keyword video in a location related to your topic. Collect\nfootage of an event or an important space. To speak on this location or event, you can either make a\ndirect address to the viewer while on location or record a voice over and import it into your editing\nplatform.\nInterview Video - Interviews can be produced anywhere so long as the sound quality is acceptable.\nFor the best outcome, use either lavalier microphones or two off-camera shotgun microphones\npointed at the subjects. Shotguns are best because they are directional and can be placed at some\n\ndistance from the subject. This allows the subject the freedom from having to hold and point the\nmicrophone.\nConversation Video - For a more casual video between two or more people, this video illustrates a\ndiscussion on a particular topic.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nWGS.111 / CMS.619 Gender & Media: Collaborations in Feminism and Technology\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "WGS.111 S16 Critical Response Paper Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-111-gender-media-collaborations-in-feminism-and-technology-spring-2016/e73e26b7be54a137c8a1b8f852cf206b_MITWGS_111S16_ResponsePapr.pdf",
      "content": "WGS.111 - Gender and Media\n1st Short Response Paper\n\nDate Due: Session #6\n\nLength: 3-4 pages, or approximately 750-1200 words\n\nThe representation of women and racial/sexual minorities in advertising and in\njournalism (both news and sports journalism) have been critiqued and addressed in\ndifferent ways by several of our authors this semester (e.g. Steinem, Wilson & Gutierrez,\nRoss, Kilbourne, and Hesse-Biber); we have also discussed how \"ways of looking\" are\nimplicated in representation (Tuchman, Gorham, Mulvey, hooks). For this short essay (3-\n4 pages), choose a \"text\" (print or television advertisement, campaign ad, news story,\nelection coverage, or sports article) and analyze it in light of one or two of the articles we\nhave read. For example, you might develop an analysis of a particular ad campaign using\ntools set forth by Jean Kilbourne in \"Cutting Us Down to Size,\" or examine the news\ncoverage of women politicians or sports figures. Your essay should comment specifically\non elements of the text you have chosen - use direct quotes if working with a print text,\nand describe visual aspects of broadcast or visual advertisements. In other words, the\nessay should be a close reading of a specific text using concepts and tools we have\nencountered in one of our readings. Please include a copy of the ad or article you are\nanalyzing ( a link will do if it is video or otherwise available online). Don't forget to\ninclude a coherent thesis statement and to support your argument with concrete\nexamples from the text(s) you choose.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nWGS.111 / CMS.619 Gender & Media: Collaborations in Feminism and Technology\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}