{
  "course_name": "Gender and Japanese Popular Culture",
  "course_description": "This course examines relationships between identity and participation in Japanese popular culture as a way of understanding the changing character of media, capitalism, fan communities, and culture. It emphasizes contemporary popular culture and theories of gender, sexuality, race, and the workings of power and value in global culture industries. Topics include manga (comic books), hip-hop and other popular music, anime and feature films, video games, contemporary literature, and online communication. Students present analyses and develop a final project based on a particular aspect of gender and popular culture.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Language",
    "Japanese",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Gender Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Language",
    "Japanese",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis course examines Japanese popular culture with a focus on gender issues, alongside consideration of sexuality, ethnicity and class. We examine the relationships between identity and participation in Japanese popular culture, and offer a way of understanding the changing character of media, capitalism, fan communities and culture. Topics include\nmanga\n(comic books), hip-hop and other popular music in Japan,\nanime\n(Japanese animated films) and feature films, Japanese video games, contemporary literature, and online communication. Emphasis will be on contemporary popular culture and theories of gender, sexuality, race, and the workings of power in global culture industries. Each student will be expected to present analysis of the course materials during in-class discussions and to develop a final project based on a particular aspect of gender and popular culture. Several films will be screened outside of regular class meeting times. This course is taught in English.\n\nGraduate students may take the class with permission of the instructor. Grad students will be expected to do some extra work beyond the undergraduate requirements.\n\nThis course may be taken as 21G.591, which indicates the Japanese language option. This designates the same course, but with additional work required (reading and a short essay) in the Japanese language. Students who wish to minor in Japanese are required to take one course with the Japanese language option.\n\nCourse Requirements and Grading Distribution\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n15%\n\nPecha Kucha\n\n5%\n\nMicrotheme Response Papers\n\n10%\n\nEssay 1\n\n20%\n\nEssay 2\n\n15%\n\nOral Presentations\n\n10%\n\nFinal Paper\n\n25%\n\nThere will be no final exam. For more detail on the above, see the\nAssignments\nsection.\n\nRequired Texts\n\nThere are no required texts for this class. Assigned readings can be found in the\nReadings\nsection.\n\nGrading of Written Work\n\nWritten work will be graded according to three criteria:\n\nArgument\n. Is there a coherent thesis? How clearly is the argument stated in the introduction and developed throughout the paper? Do the steps of the argument make sense and lead logically to the conclusion?\n\nEvidence\n. How well does the essay use the evidence available from the class materials (readings, lectures, films)? Are there contradictory examples that should be discussed to eliminate doubts?\n\nStyle\n. How well is the paper written? Has it been carefully proofread? Do the introduction and conclusion accurately reflect the paper's argument? Do transitions work to develop the essay, point by point? Does the paper length match the assignment?\n\nOral Presentations\n\nStudent presentations will take place during the final few weeks of class (10 min. each, depending on number of students). Grading of oral presentations will be determined by following criteria:\n\nDoes the oral discussion demonstrate a facility with the course materials?\n\nHow well organized is the presentation?\n\nHow well does the student communicate his / hers ideas, questions, and insights?\n\nThe Writing and Communication Center at MIT\n\nThe\nWriting and Communication Center\nat MIT offers\nfree\none-on-one professional advice from communication experts (MIT lecturers who all have advanced degrees and who are all are published writers). The WCC works with undergraduate and graduate students and with post-docs. The WCC helps you strategize about all types of academic, creative, job-related, and professional writing as well as about all aspects of oral presentations (including practicing your presentations & designing slides). No matter what department or discipline you are in, we help you think your way more deeply into your topic, help you see new implications in your data, research and ideas. The WCC also helps with all English as Second Language issues, from writing and grammar to pronunciation and conversation practice.",
  "files": [
    {
      "category": "Exam",
      "title": "21G.039J 21G.039J Gender and Japanese Popular Culture: Student 1 Example Final Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/ef797e151c842997a6907f75c47de34b_MIT21G_039JF15_Education.pdf",
      "content": "MIT Student 1\n\nMIT Student\nProfessor Ian Condry\n21G.039J Gender and Japanese Popular Culture\n14 December 2015\nEducation in Japan\n\nGender inequality, especially in recent times, has been a hot topic of sorts in mainstream\nWestern media. Particularly, due in large part to the feminist movement, there has been a push to\nmake women social equals of men. We see that the sight of the office lady is becoming more and\nmore common, and increasing numbers of women are at least in part forsaking traditional female\ntasks and roles, such as taking care of the family, to pursue their own individual interests.\n\nHowever, if we look internationally, this progressivism is not necessarily a global trend.\nParticularly, we look at Japan, which tells a different story. An Organization for Economic\nCooperation and Development (OECD) study found that the gender wage gap for Japan was\nsignificantly higher at 26.59 percent than America's, which came out to be 17.91 percent\n(OECD). This suggests that while western countries may be progressing towards a more gender-\nequal society, there exist countries, such as Japan, which are not. It is of interest then, to look at\nwhat is inhibiting this progress towards equality in Japan. Particularly, by looking at the\nhistorical social structure of Japan itself, we see that in a sense, contrary to what we have seen so\nfar, it would make sense for progress to occur in terms of gender dynamics. This is reflected in\nchanges made over time to the education system, which has been generally aiming to provide\nequal education opportunity to both men and women. However, if one looks more carefully at\nthe quality of education being provided to both genders, we see that not a huge amount has\n\nMIT Student 2\n\nchanged in terms of progress towards gender equality, suggesting that while the intention exists\nto make Japanese education and more generally Japanese society more equal, the focus has been\nplaced on the wrong areas.\nThe first thing that comes to mind when looking at stagnancy in gender dynamics is to\nlook at the history and social structures behind these gender dynamics. After all, it is not\nunreasonable to believe that there is some cultural factor that is causing inequality. We observe\nthat Japan is a country that has historically empowered men over women. As noted in a Yoko\nSugihara and Emiko Katsurada paper, \"the fall of the uji (clan) system [...] facilitated inequality\nbetween sexes\", as the \"establishment of the ie system institutionalized a gendered division of\nlabor and a power imbalance between men and women\" (Sugihara & Katsurada). The two\nauthors then proceed to describe this power imbalance, citing that under the law, only men could\ninherit property and the family name. Men also had complete control over family members,\nwhile women were not allowed to participate in matters outside of the home. That is, the\nhusband-wife relationship was characterized by an absolute dependence of the wife on the\nhusband.\n\nHowever, one may argue that modern Japan is a different story. There are a number of\narguments and phenomenon one could cite to support this claim. For example, the introduction\nof host clubs as a counterpart to hostess clubs supports the idea that Japan, like Western\ncountries, is on its way to becoming more equal, as it provides a venue that \"offers women a\nchance to enact their fantasies and experience their dream lifestyles--even if only for a moment\"\n(Takeyama). As host clubs existed long before hostess clubs began to appear, the fact that\nhostess clubs are being created seems to point in a progressive direction. Moreover, after the\nSecond World War, the ie system was largely reformed (Beauchamp). That is, the supposed\n\nMIT Student 3\n\ninstitutions historically in place that created as large of a gender gap as there was in Japan are\nlargely changed and much less of a factor today. This suggests that it is not something embedded\nin Japanese culture or way of thought that is inhibiting change towards gender inequality.\n\nOf course, this then still does not answer for us why Japan has not reached at least a\nWestern level of gender equality. To take a look at what is causing this lack of progress, we look\nat the youth of Japan. We reason that feminist theory has been around since at the mid-twentieth\ncentury in the West (Jackson). However, a large amount of progress in gender equality in general\nhas been in recent years. That is, the current feminist movement that is bringing about change is\nlargely a product of today's youth.\n\nOne thing that immediately comes to mind when investigating youth is popular culture,\nas it is essentially what is popular among young people. After all, \"109, a tall shiny department\nstore in Shibuya that, for a few million of Japan's teenage girls, is the most stylish, most\nimportant, and most exciting place in the world\" (McGray). Such a medium is bound to have\neffects on the ideals of youth on the relationship between the two genders. However, we must\nrealize that children actually spend most of their time in schools in Japan, even more so than\ncountries such as the United States with more than 70% of students attending private cram\nschools, called juku, at least once in their lives (Lowe). Therefore, it makes the most sense to\nlook at education as the main factor in influencing young Japanese thinking regarding gender\nthat is impeding progress towards equality. This of course makes sense to look at when\nconsidering that education level has an effect on one's salary, which also would help explain the\nlarge gender wage gap in comparison to the rest of the world.\n\nWe begin by looking at the history behind Japanese education. As already mentioned,\nuntil the mid-nineteenth century when the ie system was reformed due to the fall of the\n\nMIT Student 4\n\nTokugawa shogunate, Japanese society itself was decidedly male dominated. This also\nmanifested itself in the education of the time. In order to become a respectable man, one had to\nreceive \"training in classical Chinese letter and martial arts\" (Saito). On the other hand, \"the\nbooks used to educate women discussed a woman's duty to admire her husband, who was\nconsidered as superior in many aspects as a god\" (Sugihara & Katsurada). Historically, education\nuntil this point mirrored the societal structure. It is worth noting that at this time, the concept of\ngender equality had not even made its way into the west--\"first-wave\" feminists first exerted\nsome influence in the late nineteenth century and until then, gender dynamics developed as their\nmostly misogynistic societies willed. While Japan was incredibly male-dominated at this period\nof time, we can say to some degree that relative to the West at this time, Japan was not more or\nless advanced in terms of achieving gender equality.\n\nWith the fall of the Tokugawa shogunate, however, there were a number of educational\nreforms that seemed to bring more equality to education. The newly formed Ministry of\nEducation spurred the passing of the Education System Ordinance, which created an elementary,\nmiddle, and high school system (Beauchamp). In the early Meiji period, mission schools, which\ntaught girls English, music, singing, and dancing in addition to Christian beliefs, were\nestablished, which gave girls a means to a higher education. However, there was a negative\nstigma behind this, as girls who attended these schools were seen as \"western culture freaks\"\n(Saito). Even still, the government established the first official girls middle school based on these\nwestern culture schools. However, this also coincided with the establishment of tradition-\noriented schools such as the Atomi girls school, which taught subjects such as flower\narrangement. This stagnation continued until around after the First World War, where there was\nan increase in popularity for secondary education for girls in order to make them good mothers\n\nMIT Student 5\n\nand wives. While girls' middle schools became legally recognized much like boys' schools,\nmany of the schools taught subjects related to home economics (Saito). This to some degree, we\nobserve that Japan falls behind the West here in terms of gender inequality, as the advances,\nwhile significant, do not seem to be as noteworthy as changes prompted by first-wave feminists\nin the West.\n\nAfter the Second World War, however, even more reform was made to help even out the\ngender difference in education due to intervention by the winners of the war. Particularly, the\namount of years of compulsory education was increased and equal opportunity of education was\nrequired. This major change, along with numerous minor reforms afterwards, led to the situation\ntoday, which features less difference between enrollment rates of women and men in all levels of\neducation. In higher education, particularly, the percentage of women graduates was 41.1% in\n2010 compared to just 36.2% in 2000 (Economist). While this is lower than the global average, it\nis not outrageously low. In fact, it is high enough that one might say that we cannot conclude that\nthere is a significant difference in education between men and women. Of course, as this change\nwas spurred by intervention from Western countries, it makes sense that this progress mirrors\nprogress in the West. Moreover, we observe that most reform that occurred was in relation to\nproviding equal opportunity of education in terms of getting students any sort of education,\nwhich does not immediately lend itself to equal education.\n\nThis then suggests that education is not in fact the problem with the lack of progressivism\nin terms of gender equality of Japan's youth, as education has been more and more progressive\nover time, even compared to Western countries. However, once we compare the quality of\neducation between men and women, we see a rather stark disparity. As we mentioned before, just\nbecause opportunity in education is equal, the education itself is not necessarily equal.\n\nMIT Student 6\n\nParticularly, we look at the University of Tokyo, which has consistently been ranked the best\nuniversity in Japan. We observe that the university is less than twenty percent female. Looking at\nscience and engineering, which has higher paying jobs relative to other fields, women only\naccount for less than ten percent of students (Iida). This implies that there is indeed a difference\nbetween education of women and men in Japan. To get a sense of how severe this difference is,\nwe look at the gender difference in enrolled students in elite American universities. Of the top\ntwenty or so schools in America according to a variety of ranking sites, Caltech consistently\nposts the worst gender ratio, being slightly less than forty percent female. While the wage gap in\nJapan is to a nontrivial extent more severe than the wage gap in America, we observe that the\neducation gap is even greater.\n\nLooking now at lower levels of education, we realize that this issue of the quality of\neducation does not stop at universities. We first note that the schools that post the best admission\nrates into top universities are six-year schools that combine middle and high school into one fluid\nprocess (USJP). A cursory survey of the rankings of these schools brings up the following\nstatistics. The top five schools are all-boys schools. What follows is then a six-way tie for sixth\nplace. Of these six schools, only two are all-girls schools, while there are two co-ed schools and\nthree all-boys schools. That is, of the top twelve middle and high schools in the country, there are\neight all-boys schools, compared to only two all-girls schools (Chu-Shigaku). That is, while there\nmay be an equal number of middle schools girls can attend when compared to middle schools\nboys can attend due to the requirement of equal opportunity passed during the era of reform, the\nquality of this opportunity is quite different.\n\nWe can further extend our study to the juku we mentioned at the beginning of this\nliterature review. While most juku are in fact co-ed, a study by Robert J. Lowe found that the\n\nMIT Student 7\n\ntexts used to teach students English contain \"disproportionate references to males and females\",\n\"different roles assigned to males and females\", \"reinforcement of gender stereotypes\", and\n\"condescending statements or generalizations about women\" (Lowe). Previous studies had found\nsimilar problems in the books used by Japanese high schools. This to some degree makes sense,\nas this could be a case of catering to an audience. If one's students are mostly male, then it\nmakes sense to introduce texts that show males both more positively and more frequently.\nAdditionally, texts written when society itself was more male-dominated may still have pure\neducational value, and as such are still being used.\n\nEssentially, through these readings, we see that contrary to the surface facade of equal\nopportunity and enrollment, when looking at quality, there indeed is a disparity between male\nand female education. Namely, with regards to elite private secondary schools and universities,\nmales opportunity and enrollment rate is higher. Thus, we find that education does indeed seem\nto play a role in impeding the progress of Japan towards a gender equal society. For one thing,\nthe introduction of mandatory education carries with it the implication that education affects\neverybody. Moreover, if the people gaining better educations and moving into positions of power\nare mostly males who are taught implicitly through compulsory readings about male superiority,\nthen it seems natural that societal change with respect to gender would be slow.\n\nFortunately, identifying education as an area inhibiting progress towards gender\ninequality in Japan's workforce and society as a whole gives us some rather clear steps that need\nto be taken to encourage more progress. Namely, balancing quality of education seems like it\nwould be necessary to place more progressive-minded people into power and in and of itself\nencourage a movement towards gender inequality in Japan. This can be done in a multitude of\nways, one potentially being introducing more opportunity for girls to receive a higher quality\n\nMIT Student 8\n\neducation by increasing the number of top girls high schools or making some of the top boys\nhigh schools coeducational as once was done with universities. Of course, there are potential\nproblems with this, as most elite universities in Japan are public, whereas the upper tier of high\nschools and middle schools are private, but what is important is that there are ideas and effort to\ntry to bring a semblance of balance to the quality of education between genders. While gender\nrepresentations in media such as anime like Evangelion, more mainstream movies like Ghibli\nfilms, can be argued to be growing more and more gender neutral as mentioned by Ariana in\nclass, the reality is children spend more time being exposed to education than they are exposed to\nany kinds of this media. While according to Lynda, there are groups of people such as fujoshi\nthat contain more people than one might think, in almost all cases, these people are students as\nwell. By not looking deeper than the surface facade of equal opportunity in education between\ngenders, one disservices himself in putting himself in a position to tackle Japan's gender\ninequality problem.\n\nMore generally, we can see that this trend of treating issues on the surface and not\ndealing with deeper problems in the institutions persists among a myriad of areas. Take, for\nexample, Takarazuka, an all-female acting troupe. Takarazuka does provide a counterpart to\nKabuki as a more modern female counterpart to the male acting tradition, and in that sense, it\ncould be considered progress towards gender equality, as it provides the same thing we saw in\neducation--equal opportunity (Robertson). However, this surface analysis ignores the fact that a\nmale-dominated management controls the women in Takarazuka, and the implications of this are\nstill quite gendered. For example, women in Takarazuka are encouraged to shield relationships\nfrom the public eye and have to leave the acting troupe if they choose to marry. Contrast this\nwith Kabuki, where it is not surprising for an actor to be sleeping with multiple women and we\n\nMIT Student 9\n\nsee that this surface equality is put into question. Looking at idol groups as an example of\nproviding equal representation of females in popular media ignores the same issues mentioned\nwith regards to Takarazuka above and also ignores the implications of male gaze. Furthermore,\nthis extends to issues not limited by gender equality. For example, take the issue of representing\ntransgender and homosexual people in media. We heard in class from Minami that homosexual\nentertainers are becoming more and more popular as television personalities, but that popularity\nis based on these personalities shoehorning themselves into stereotyped roles. In this sense, we\nsee that Japan's perceived achievement of equality of the sexes is questionable at best. While it is\na step in the right direction to achieve this surface level of equality, in order to truly change\ngender dynamics in Japan and as an effect close the gender gap, those aiming for social change\ntowards gender equality should look past the surface and deal with more inherent issues in\ninstitutions causing gender imbalance. This is true in a number of cases, but as we have explored\nabove, education is not a bad choice to start with.\n\nMIT Student 10\n\nWorks Cited\n\"全国の私立中学校 偏差値ランキンク| 偏差値順 | 学費順 | 授業時間順 | 人気順 | 842 件.\"\nシリタス. N.p., n.d. Web. 1 Dec. 2015. <http://www.chu-\nshigaku.com/list/a_japan/popular_1.html>.\nBeauchamp, Edward R. Education and Schooling in Japan since 1945. New York: Garland Pub.,\n1998. Print.\n\"Gender Wage Gap - OECD.\" Gender Wage Gap - OECD. N.p., n.d. Web. 14 Oct. 2015.\nIida, Yuki. \"The Male to Female Ratio in the University of Tokyo.\" Komaba Times. N.p., 03 Dec.\n2012. Web. 14 Oct. 2015.\nJackson, Stevi. Women's Studies: Essential Readings. New York: New York UP, 1993. Print.\nLowe, Robert J. \"Wolves in Sheep's Clothing: Problematic Representations of Gender in\nAuthentic EFL Vocabulary Texts.\" Journal and Proceedings of the Gender Awareness in\nLanguage Education 6 (2013): 6-22. Web. 1 Dec. 2015.\nMcGray, Douglas. \"Japan's Gross National Cool. .\" Foreign Policy 1 May 2002: n. pag. Web.\nRobertson, Jennifer Ellen. Takarazuka: Sexual Politics and Popular Culture in Modern Japan.\nBerkeley: U of California, 1998. Print.\nSaito, Yasuo. \"Gender Equality in Education.\" (2014): n. pag. National Institute for Educational\nPolicy Research. Web. 1 Dec. 2015.\nSugihara, Yoko, and Emiko Katsurada. \"Gender-Role Personality Traits In Japanese Culture.\"\nPsychol of Women Q Psychology of Women Quarterly 24.4 (2000): 309-18. Web.\nTakeyama, Akiko. Staged Seduction: Selling Dreams in a Tokyo Host Club. N.p.: n.p., n.d. Print.\n\nMIT Student 11\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21G.039J Gender and Japanese Popular Culture: Assignments: Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/12dce05f09aca516260f937062d55a4e_MIT21G_039JF15_Essay1.pdf",
      "content": "21G.039J Gender and Japanese Popular Culture\nFall 2015\nProf. Ian Condry\n\nEssay 1: 5-pages, double spaced\n\nDraft DUE: 10/15 (R) BRING two (2) copies to class for peer review workshop\n\nFinal version DUE: 10/20 (T) by 10pm\n\nIn the first section of this class, we have explored theories of gender, theories\nof popular culture, and discussions of inequality. We have also explored some\nexamples of popular culture, including Princess Jellyfish (manga) and Kamikaze Girls\n(film). Using these materials, please make an argument regarding one (1) of the\nfollowing statements:\n\n- Japanese popular culture reveals that women have the power to shape their\nown destinies.\n\n- The structural contexts in which women and men operate are oppressive\nbecause they force people into particular gender roles.\n\n- When Japanese popular culture travels abroad, it is fundamentally\ntransformed because of the different contexts in which it is consumed.\n\n- The economic dynamic of capitalism is the driving force in shaping unequal\ngender relations.\n\nWhen you make your argument, using the materials in class, please consider\ncounter arguments that appear in the readings and/or that you develop yourself.\nTry to respond to these counter arguments as well.\n\nI would like you to focus on the materials used in class, but if you'd like to consider a\nform of popular culture that you are interested in, that may be included as well.\n\nI also am open to students proposing their own topics for essay writing. In that case,\nplease propose the topic to me by 10/8 so that other people in the class might write\nabout the same topic.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms/."
    },
    {
      "category": "Assignment",
      "title": "21G.039J Gender and Japanese Popular Culture: Assignments: Final Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/3fdc23e4a7b6419d2e9da8d047a767f0_MIT21G_039JF15_Final.pdf",
      "content": "Gender and Japanese Popular Culture\nFall 2015\nProf. Ian Condry\n\nFinal Project Prompt\n\nPlease choose a topic of interest to you related to gender and Japanese popular culture, and\nwrite an 8-10 page (double-spaced) essay analyzing an aspect of this phenomenon that\nspeaks to the issues we have read about and discussed in class.\n\nIn particular, we have explored analyses of gender in terms of social theory, cultural contexts,\nand media representations,. We have considered gender and class inequalities, questions of\ntransnational flows, and gender and performance through Takarazuka, onnagata, host clubs,\nidols, and video games. We have also explored questions of \"hegemonic masculinity and\nfemininity\" as well as transgender fluidity. All of these readings and topics are appropriate\nto consider incorporating into your final project.\n\nThe final project has several parts:\n\nLiterature Review 4-5 pages due Dec. 1, Tue\n\nPlease analyze readings in the class (4 at least; more is better) and 2-3 outside readings\n(that you found) in terms of your topic. These outside readings should be academic journal\narticles or book chapters. In addition, I expect many of you will choose some aspect of\npopular culture to explore.\n\nFinal presentation (10 minutes) in class Dec. 1, 3, 7\n\nPlease consider touching on the following topics: Your research question(s), relate to\nsome of the readings (in class assignments and scholarly articles you've found yourself), and\nsomething about what you hope to learn (or have learned) from the study of your topic.\n\nFinal paper 8-10 pages, Due Dec. 10,\n\nUsing your literature, incorporate an additional 3-5 pages on some aspect of Japanese\npopular culture of your choice. Your polished argument about your research topic and its\nimplications for the understanding of gender and Japanese popular culture. Please also\ninclude reference to two (2) student presentations, 3-4 of the class readings, 2-3 outside\nreadings that you've found. Images are encouraged; images do not count towards number of\npages.\n\nPlease also consider, if appropriate, interviewing some people who could help you\nunderstand your topic, whether as experts, fans, or anti-fans.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21G.039J Gender and Japanese Popular Culture: Student 1 Example Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/cf861e54d3f06ff40bdc04694c984b1d_MIT21G_039JF15_inequality.pdf",
      "content": "MIT Student 1\n\nMIT Student\nProfessor Ian Condry\n21G.039J Gender and Japanese Popular Culture\n20 October 2015\nGender Inequality in Japan: An Issue of Class\n\nThe issue of whether or not women have or do not have the power to shape their own\ndestinies is an interesting one. To many of us living in western countries that hold values such as\nfreedom of choice close to us, it seems natural that even if women cannot shape their own\ndestinies, they should be allowed a degree of autonomy. And to some extent, in modern\nAmerican society, this is becoming more and more true. The sight of the office lady is becoming\nmore and more common. Women are as free as men to choose their sexual orientation. However,\nif we look at the issue globally, this is not necessarily the case. Particularly, looking at Japan, we\nsee a different story. While there are factors besides raw salary that play into the gender wage\ngap making it a shaky indicator at best of the existence of gender inequality in the workplace, for\ncomparing the difference in gender inequality between Japan and America, it suits our purposes.\nAn Organization for Economic Cooperation and Development (OECD) study found that the\ngender wage gap for Japan was significantly higher at 26.59 percent than America's, which came\nout to be 17.91 percent (OECD). This indicates that while America and more generally the west\nmay be progressing towards a more gender equal society, when looking at the issue on a global\nscale, eastern countries such as Japan are not. Of course, one's initial reaction would be to\nsuppose that there is some sort of cultural factor that is the cause of this; after all, Japan has\ntraditionally been a country where the woman stays at and takes care of the home. However, by\n\nMIT Student 2\n\nlooking at gender in Japanese pop culture through Akiko Higashimura's manga, \"Princess\nJellyfish\", and validating it through a real-world example in Laura Miller's article, \"Cute\nMasquerade and the Pimping of Japan\", we see that the root of this inequality may in fact not be\nany rooted cultural values, but rather a difference in class, in this case defined as a difference in\nsocioeconomic standing. Finally, by looking at Japan's education system, we suggest education\nas a potential cause of this socioeconomic difference while further validating our claim that it is\nclass rather than cultural values that cause gender inequality in Japan.\n\nWe begin by looking at Higashimura's \"Princess Jellyfish\". As the 2010 Kodansha\nManga Award recipient for best shoujo manga, we know that \"Princess Jellyfish\" has been well\nreceived. As the Japanese people in general have enjoyed the manga, we can assume that the\nideas presented in the manga are shared by the Japanese people, and in a sense represent\nJapanese cultural values.\nWhile it may seem that Japanese culture itself encourages gender inequality, this is not\nthe case, as we can see by looking at the two main characters of \"Princess Jellyfish\". We are\nintroduced the male lead, Kuranosuke, as he is wearing women's clothes. He maintains this\nappearance for at least two volumes and experiences very little trouble in doing so. While his\nfather scolds him, this works in his favor as he does not want to follow his father's footsteps in\nbecoming a politician, and nothing actually harmful occurs to him as a result of this. On an\nemotional level, he never experiences any self-identity confusion either, always firmly holding\non to the truth that he is a man. Upon revealing that he is a man, he casually brushes off his\nappearance as a female saying, \"I just have a taste in women's clothing. I'm normal\" (Princess\nJellyfish). All of this combines to show the degree of freedom Kuranosuke has in determining his\nappearance. We contrast this with his continuous pursuit of the female lead Tsukimi, a shy otaku\n\nMIT Student 3\n\nwho dresses in a homely manner, due to his desire to make her, in his opinion, \"beautiful\". As\nKuranosuke believes, even girls at an \"otaku garden would all want to be pretty too, deep down\"\n(Princess Jellyfish). Tsukimi is shocked the first time she is dressed up, and does not want to\nreturn back to her home due to her appearance. She clearly does not like being dressed up. In\nshort, we see that Kuranosuke imposes his ideal of what a woman should look like on Tsukimi,\nlimiting, at least in the moment, her freedom to choose what she wants to look like. At first\nglance, this difference between Kuranosuke's freedom and Tsukimi's lack thereof seems to\nindicate an inherent gender imbalance in Japanese culture. This is further reinforced by the fact\nthat Kuranosuke, who despite cross-dressing is very much a man, is imposing this ideal on\nTsukimi, a woman, suggesting that in Japanese culture, women are to some extent subjugated by\nmen. However, this analysis ignores the fact that Kuranosuke is the wealthy son of a politician\nand Tsukimi is in comparison rather poor. That is, there are other factors besides an inherent\ngender imbalance, namely class, which may create the structure that separates both Kuranosuke\nand Tsukimi from each other and creates the inequality of freedom between the two.\n\nOf course, one may argue that in the real world, such an argument would not hold. That\nthere are few if any real-life situations where a man and women of classes as different as\nKuranosuke and Tsukimi's would have such an interaction with each other. That is, because it is\nless plausible to have a situation with a large class divide in real life, Higashimura in her manga,\nthrough the dynamic of Kuranosuke and Tsukimi, is commenting on an inherent gender\ninequality problem rather than a class inequality problem. However, we note that we do indeed\nsee this inequality in class in real life by looking at the \"Ambassadors of Cute\" in Laura Miller's\n\"Cute Masquerade and the Pimping of Japan\". Miller states that \"the selection, media production,\nand strategic deployment of the Ambassadors of Cute were primarily in the hands of middle-\n\nMIT Student 4\n\naged men\", claiming that the Ambassadors of Cute project was actually the manipulation of three\nwomen by men in forcing them to dress up as female stereotypes (Miller 20). While this case\nmay be less exaggerated, this is essentially what Kuranosuke is doing to Tsukimi, making it an\napt real-world comparison to the fictional \"Princess Jellyfish\". However, in this case as well, we\nsee that the middle-aged men producing these girls are quite wealthy and influential, as they\ninclude in Miller's words, \"the powerful bureaucrat Monji Kenjiro\" (Miller 20). That is, there is\na large socioeconomic difference between the supposed subjugated and subjugators in this case\nas well. Thus, while perhaps less pronounced, even under real world situations, the argument for\nclass as the driving factor behind gender inequality rather than any inherent gender inequality\nbuilt into Japanese culture holds up. We observe the same things in both popular culture and\nreal-life situations.\n\nHowever, we must note that these two examples are merely that--two examples. While\nwe can extrapolate from popular culture such as \"Princess Jellyfish\", as it draws from society in\ngeneral as an item of culture rather than a particular event, we have not yet made an argument for\nwhy we should favor using class as a basis for gender inequality rather than inherent cultural\nvalues. We proceed to do so by looking at education. At first glance, we see that according to an\nEconomist study more than forty percent of college graduates in Japan are female. While this is\nlower than the global average, it is not outrageously low. In fact, it is high enough that one might\nsay that we cannot conclude that there is a significant difference in education between men and\nwomen. However, once we compare the quality of education between men and women, we see a\nrather stark disparity. Particularly, we look at the University of Tokyo, which has consistently\nbeen ranked the best university in Japan. We observe that the university is less than twenty\npercent female. Looking at science and engineering, which has higher paying jobs relative to\n\nMIT Student 5\n\nother fields, women only account for less than ten percent of students (Iida). This implies that\nthere is indeed a difference between education of women and men in Japan. Coupling this with\nthe general fact that better education often leads to better social status, we reach the natural\nconclusion that women and men do in fact differ in social class. Moreover, by looking at the\ndifference in education quality between men and women, we can say something even more\npowerful by using our conclusion before that gender inequality is a product of class difference;\nthat is, a difference in education leads to socioeconomic difference, which then leads to the\ngender inequality in Japan that we see today.\n\nBy looking at both examples in Japanese popular culture and examples in real life, we see\nthat in many cases we see gender inequality in Japan due to a supposed inherent tendency of\nJapanese culture to subjugate women, we also see an inequality in class between the subjugator\nand subjugated. This leads us to think that Japanese culture does not inherently subjugate women,\nand that an inequality in gender is largely a product of a socioeconomic difference. By looking at\neducation, we validate this difference in class between genders as a large factor behind gender\ninequality and suggest a reason for the existence of this class difference. From this, we can\nconclude that there is nothing in Japanese culture that inherently prevents women from personal\nadvancement. While society itself has a structure that encourages men to advance in society\nrather than women, there are no institutions in place that prevent a woman who wants to advance\nfrom advancing. Particularly, we see that if women pursue and prioritize better education, then\nthey should rise in socioeconomic standing, and a major driving force behind gender inequality\nwill be eliminated. That is, by looking at our examples in Japanese pop culture and the real world,\nwe see that women, by pursuing better education, have the power to shape their own destinies.\n\nMIT Student 6\n\nWorks Cited\n\"Gender Wage Gap - OECD.\" Gender Wage Gap - OECD. N.p., n.d. Web. 14 Oct. 2015.\nHigashimura, Akiko. \"Princess Jellyfish.\" N.p.: n.p., n.d. Print.\nIida, Yuki. \"The Male to Female Ratio in the University of Tokyo.\" Komaba Times. N.p., 03 Dec.\n2012. Web. 14 Oct. 2015.\nMiller, Laura. \"Cute Masquerade and the Pimping of Japan.\" International Journal of Japanese\nSociology 20.1 (2011): 18-29. Web.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21G.039J Gender and Japanese Popular Culture: Student 2 Example Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/3ebd9d20ba299f51fea6624963c6ae58_MIT21G_039JF15_Transformation.pdf",
      "content": "MIT Student\n21G.039J\n10-19-15\nOn the Global Transformation of Japanese Culture\n\nWhen Japan's popular culture travels abroad in the form of manga, anime, and video\ngames, its media is viewed in contexts that differ from its own. Some forms of consumption\nmay simply change the public's perception of Japan, but others have the potential to shape\nfuture pieces of media as artists in Japan adapt in order to appeal to a wider audience.\nLanguage is one prominent way that a piece of media can garner different interpretations, but\nthe inclusions of different stereotypes may also give the audience a glimpse of how Japan views\ndifferent aspects of life. These vectors lead to a transformation of Japanese popular culture as\nit's consumed within different contexts.\nIn translating one language to another, countless layers of connotations and cultural\ncontexts may be lost. Since many series of manga and anime take a while to be localized to\nother languages, while some of them never leave Japan, many fans have taken it upon\nthemselves to translate the dialogue for other people. In the case of manga, this phenomenon\nis called a 'scanlation', or a scanned translation, while in anime this leads to fan-made subtitles\nmatched to Japanese audio. These types of translations often include a variety of author's\nnotes, where the authors are aware of the cultural diffusion taking place and so attempt to\neducate the reader on lost contexts. Yet, as McGray asserts: \"most foreigners will never\npenetrate the barriers of language and culture well enough to see Japan as the average\nJapanese sees it\" (52). Their attempts have had mixed success.\nIn Princess Jellyfish, for example, the main characters call themselves the Amars. To a\nreader who does not understand Japanese, this name means nothing, but with the help of the\n\ntranslator's note, the reader learns that Amar is based off of the kanji for 'nun'. This knowledge\nhelps the reader to understand how these women relate themselves to the outside world, from\nwhich they secluded themselves in order to freely focus on their otaku passions. In some cases,\ntranslator's notes can be superfluous and lead to confusion within the reader; one prominent\nexample is a fan-subbed line from a particularly dramatic scene in Death Note, where Light says\n\"just according to keikaku\", accompanied by an author note detailing that \"keikaku means plan\"\n(\"Just as Planned,\" Know Your Meme). This scene was now viewed in a more humorous light\nbecause of this translation, which transformed it from its original form. It also allowed more\npeople to learn this word of Japanese- and to slip it into conversations where others\nunderstood the joke. Official translations, too, have the potential to disregard the Japanese\norigins of some anime in order to appeal to their audiences. In one episode of the Pokemon\nanime, 4Kids changed a few lines of dialogue so that the characters referred to onigiri as jelly-\nfilled doughnuts (\"Pokemon Jelly-Filled Donought,\" Youtube). In this case they took a Japanese\nfood, the rice balls known as onigiri, and attempted to appeal to Americans with a pastry that\nthey were familiar with. In the process, the audience lost an opportunity to learn about a staple\nof Japanese cuisine. Both of these examples have led to memes that poked fun at the\ntranslations, leading to the spread of associations that were not originally related to the media\nin question. In shedding the original cultural contexts from a piece of media, foreign consumers\nexperienced it differently from Japanese consumers.\nTo elaborate on McGray's point, foreign readers may not understand the Amars in\nPrincess Jellyfish as Japanese readers would view them. The Amars are a group of fujoshi,\nfemale otakus, who also happen to be NEETs. These three terms: fujoshi, otaku, and NEET are\n\nall culturally significant within Japan. To the uninformed reader, the only word they may have\nalready had knowledge of is otaku, and the American perception of otaku is not too aware of\nthe contexts surrounding it in Japan. An otaku is, generally, someone with an obsession over a\nvery specific type of popular culture. This seems to be fairly similar to the American terms for\nnerd and geek. Where nerd and geek are starting to gain traction in mainstream media and gain\na positive connotation, however, otaku does not follow so closely. In Japan, otakus are\nconsidered to be so obsessed with their subject of interest that they start to disconnect with\nreality.\nFujoshi adds an element of gender to otaku, and literally means 'rotten girl'. It began as\na word specifically for women who enjoyed boys love- or homosexual, romantic- manga and\nliterature, but has since extended as a general term for female otakus (Suzuki). NEET is an\nacronym for 'Not in Education, Employment, or Training'. None of the Amars have paying jobs,\nexcept for the head of the household, who is a BL manga artist. In Japan, this NEET status\ncarries a generally negative connotation. NEETs are associated with laziness and a lack of desire\nto work, but are majorly unemployed as a result of a recession in Japan, from which jobs are\nespecially difficult for young women to find (Reiko). With the context of these three words\ntaken together, the reader can now understand the degree to which Tsukimi's group is\nostracized from society, when before they might have considered them just a group of geeks\nwho are lacking in social skills. Knowing the background of these words can help the reader to\nunderstand the viewpoint of the characters as the Japanese would see them; without this\nknowledge the media would not be consumed in the same manner.\n\nWhen Pokemon was first created, it would take years for the games to be localized to\nother countries. Now, Nintendo has strived to accommodate fans all over the world by\nlaunching its newest Pokemon games on the same day- or at the least within the same week.\nPokemon fans no longer have to wait months for translations and details to be released online\nin anticipation of buying their own copies, and everyone has the opportunity to experience new\nthings at the same time. Similarly, Pokemon has transformed over the years in its inclusion of\nother cultures. Many of the early games, from Red/Blue all the way to Diamond/Pearl, had their\ngeographies inspired by locations within Japan. Red/Blue's Kanto is based on the region of the\nsame name in Japan, Gold/Silver's Johto is based on Kansai, Ruby/Sapphire's Hoenn is based on\nKyushu, and Diamond/Pearl's Sinnoh is based on Hokkaido (\"Pokemon World in Relation to the\nReal World,\" Bulbapedia).\nThe two most recent generations of games, Black/White and X/Y, however, have their\ngeographic inspirations based in the United States and France, respectively. Unova in\nBlack/White features many bridges, and its central city is a direct analog to New York City. X/Y's\nKalos is home to opulent mansions and cafes, and even has an Eiffel Tower replica within its\ncenter city. These games seem to express a Japanese perception of American and French\nstereotypes. Black/White brings sports arenas containing football, baseball, and basketball.\nTrainers with darker skin colors are introduced, and some of the region-specific Pokemon\ninclude a buffalo with an afro (Bouffalant) and a red, white, and blue eagle (Braviary). X/Y\nintroduces the ability to customize your character with expensive boutique clothing, and the\nlore in the region is based in medieval castles and battles. Some of the Pokemon introduced in\nthat region include a customizable poodle (Furfrou) and a floating sword and shield (Aegislash).\n\nThis shift in geographical inspiration may be seen as an attempt to appeal more to both\nthe Japanese audience and the world at large. When Miller explained the significance of Japan's\nmarketing of its cute culture, she mentioned that \"global and male-authored mining of\nJapanese cute often leaves behind some of the more interesting and meaningful aspects of the\naesthetic\" (24). Similarly in this case, Nintendo focused on the particular aspects of each culture\nthat may be more appealing to each player demographic, without necessarily understanding\nthe significance. Japanese players got the opportunity to explore aspects of American and\nFrench culture that may not be quite so prominent within their cultures, while European or\nAmerican players got to experience a familiarity with their surroundings. Within the Japanese-\nbased regions, foreign players were less familiar with the aesthetic unless clearly Japanese\naspects were present, such as the magnet train and pagodas within Gold/Silver. These aspects\nhelped to make each game look more exciting and cool to different audiences for introducing\naesthetics that were both foreign and familiar to each group.\nThis shift in culture inclusion may as such work as a counterpoint to the idea that\nJapanese culture appears to change when it's consumed in another country. In this case, the\ncreators of Pokemon considered their audience and changed their product beforehand so that\nit would be consumed in the way that they desired. This was not a case of fan interpretations\ncompletely changing the meaning of a piece of media; to players in Japan, X/Y is very clearly\nFrench-inspired, and American and French players would all agree to this same notion. The\ngames were tailored so that these meanings would not be lost across cultural boundaries.\nHowever, this example can also support the notion that Japanese culture is being transformed\n\nin a preemptive response to possible outside influence. In either case, the exchange of ideas\nbetween countries has led to a product that is fundamentally changed from its original form.\nWhen cultural connotations are lost in translation, or game content is changed to appeal\nto a wider audience, this leads to a transformation of Japanese culture. The first case is merely\na change in one culture's perception of another, but the second has direct consequences on\nhow Japan will evolve its popular culture to appeal to the rest of the world.\n\nWorks Cited\n\n\"Kuragehime.\" Mangareader.net. Web. 19 Oct. 2015.\n<http://www.mangareader.net/kuragehime/1/16>.\n\"Just As Planned.\" Know Your Meme. 2007. Web. 19 Oct. 2015.\n<http://knowyourmeme.com/memes/just-as-planned>.\nMiller, Laura. \"Cute Masquerade and the Pimping of Japan.\"International Journal of Japanese\nSociology (2011): 18-29. Web. 19 Oct. 2015.\nMcgray, Douglas. \"Japan's Gross National Cool.\" Foreign Policy (2002): 44. Web. 19 Oct. 2015.\n\"Pokemon Jelly Filled Donought.\" YouTube. YouTube, 7 Dec. 2013. Web. 19 Oct. 2015.\n<https://www.youtube.com/watch?v=vWgxH2KG4ts>.\n\"Pokemon World in Relation to the Real World.\" Bulbapedia, the Community-driven Pokemon\nEncyclopedia. Web. 15 Oct. 2015.\nReiko, Kosugi. \"Youth Employment in Japan's Economic Recovery: 'Freeters' and 'NEETs'\" Japan\nFocus. 11 May 2006. Web. 15 Oct. 2015.\nSuzuki, Midori. 2013. \"The Possibilities of Research on Fujoshi in Japan.\" In \"Transnational Boys'\nLove Fan Studies,\" edited by Kazumi Nagaike and Katsuhiko Suganuma, special\nissue, Transformative Works and Cultures, no. 12. doi:10.3983/twc.2013.0462. 15 Oct.\n2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21G.039J Gender and Japanese Popular Culture: Student 3 Example Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/95b47691da5e20e73d97668a714c8653_MIT21G_039JF15_Culture.pdf",
      "content": "MIT Student\nProfessor Ian Condry\n21G.039J\nOctober 20, 2015\nJapanese Culture Abroad\nWhen Japanese popular culture travels abroad, it is experienced differently by varied\naudiences and therefore fundamentally transformed from its original state within Japan.\nUltimately, the language barrier, different cultural views, and selection bias, and lack of\nimmersion offer a different view of the popular culture found in Japan.\n\nMost people abroad consuming Japanese popular culture do not speak the Japanese, or\nare not fluent enough to understand precisely what is trying to be said. Even with the most\naccurate translations, some meaning will always be lost, since different languages are never\nperfectly analogous. We can see the effects of this when we watched Kamikaze Girls simply by\nlooking at the title in both English and Japanese. The original Japanese title is Shimotsuma\nMonogatari - Yanki-chan to Rolita-chan, which is translated to Shimotsuma Story - Yankee Girl\nand Lolita Girl. Both titles have very different connotations, which affects the view and\nexpectations of the movie before even seeing it. Even if the more accurate translation was used\nfor the English title, some meaning is still lost, since the English language has no equivalent to\nthe chan suffix. Viewed abroad, it is also unlikely the viewer would know much, if anything,\nabout Shimotsuma and its stereotypes. If the location is merely a backdrop, or is fairly\nstraightforward, then this lack of information may not be that important. However, when\nShimotsuma is satirized, there is a significant loss of information that viewers abroad likely\nwould not even notice is missing.\n\nNuanced terms like Yankee and Lolita are also transformed once taken out of Japan. I\nhad no background knowledge of what a Yankee would be described as in Japan, and what I did\nknow of Lolita fashion is essentially just that it existed. I suspect most other people outside of\nJapan are similarly ignorant regarding Japanese subcultures. This perspective transforms the\nfilm from one about two girls who belong to very different groups to a film about two girls who\nare just very different, which takes away some of the meaning. Additionally, it is unclear to\noutsiders if these girls are conforming to the gender roles associated with these subcultures or\nsubverting them. While the internet can be useful here when it comes to looking up terms like\nYankee and Lolita, it is still hard to fully understand what they mean just by reading about them.\nHowever, by seeing the girls as people first and group members second, outsiders to Japanese\npop culture can focus more on the characters themselves, rather than what they represent. In this\nway, the outsider's interpretation is not necessarily lesser. Instead, it just naturally focuses on a\ndifferent aspect of the film.\nThe same thing occurs in Princess Jellyfish when Tsukimi describes herself as a fujoshi.\nThis is translated as female otaku, which, aside from questionable accuracy, relies on the premise\nthat the reader knows what an otaku is as well. Normally otaku is translated to mean something\nlike nerd or dork, but now we run into the issue that different societies respond to these terms in\ndifferent ways. Here in the United States - where the rise of tech giants like Bill Gates and Mark\nZuckerberg have shown that geekdom can be profitable, and comic book characters are the stars\nof blockbuster movies - it has become more socially acceptable to call oneself a nerd, and dork\ncan be seen as a cute term of endearment. These words have lost much of the negative context\nthat they once had here, and that otaku seems to still have in Japan.\n\nThe nerd vs. otaku differences, in addition to showing how language is difficult to\naccurately translate, indicates the wider issue of trying to view Japanese popular culture through\na different cultural lens. For example, while the United States and Japan view similar traits as\nbeing masculine or feminine, a number of American stereotypes for both genders are seen as not\nsocially acceptable in Japan. Four items originally categorized as masculine by the Bem Sex\nRole Inventory - dominant, aggressive, self-sufficient, and individualistic - were determined to\nbe not desirable for Japanese men, while one item originally categorized as feminine - yielding -\nwas determined to be not desirable for Japanese women (Sugihara; Katsurada). With different\nviews on what it means to be \"properly\" masculine or feminine, it is inevitable that Americans,\nor anyone not from Japan, interpret Japanese popular culture in ways it would not be interpreted\nwithin a Japanese context. A narrative about an individualistic, aggressive man would be read\nvery differently by Japanese audiences (who would disapprove of the character) and American\naudiences (who would approve of the character). These differing views can drastically affect the\nmeaning of the narrative.\nThe Japanese popular culture that makes it abroad is not an accurate representation of\nJapanese pop culture. The Japanese government's creation of the Ambassadors of Cute is just\none example of this (Miller). This campaign grossly misrepresents Japanese popular culture by\nsimplifying the three Ambassadors into very basic stereotypes of their schoolgirl, Lolita, and\nHarajuku personas. It also shows a predominantly masculine view of popular culture, as all of\nthis was orchestrated by men, even if the three ambassadors are women. As Miller states,\n\"Women and girls are constrained in Cool Japan ideology, and are not usually represented as\nshaping, resisting, creating or critiquing Japanese popular culture\" (18). While it is unclear how\n\nprolific or influential this campaign really is, it shows that the Japanese government is actively\ntrying to package and transform Japanese popular culture as it gets shipped abroad.\nAside from the government pushing a skewed view of Japanese culture, even Western\nindividuals themselves select a skewed example of Japanese culture to absorb. People will self-\nselect what is interesting to them, and so they will never have a comprehensive view of Japanese\npopular culture as a whole. Culture does not exist in a vacuum, and seemingly unrelated parts of\nsome culture will still have an effect on each other. This does not mean that to have an accurate\nunderstanding of some culture someone must partake in all aspects of that culture. For example,\nI don't find reality television that interesting, so I have never watched anything related to the\nKardashians. Still, I am aware that they exist and I can understand references to them when they\noccur in other aspects of American culture. While I self-select what is interesting to me, I still\nhave a comprehensive view of American culture because I am exposed to it. When Japanese\npopular culture travels abroad, this total exposure becomes impossible, allowing people to miss\nout on crucial aspects of Japanese culture without even realizing it, simply because it is\nsomething they have no desire to seek out.\nSince the very nature of taking a culture abroad prevents total exposure and immersion,\nthose who experience some culture abroad are also prevented from engaging in participatory\nculture. Someone abroad cannot go to book signings, or festivals, or fully engage with others\ninvolved in the local culture. As participatory culture becomes more prevalent, fans engage\nmore and more with the mainstream media (Jenkins). This makes it harder for someone\nphysically outside of this cultural bubble to experience this culture in an accurate way. Even if\nsomeone was culturally omniscient, in the sense that they somehow were fully aware of all\naspects of Japanese popular culture, simply by being abroad they could never by omnipresent, or\n\neven just present. Part of understanding popular culture is taking part in and experiencing it, so\nwithout this option it is inevitable that the culture is transformed.\nAs discussed by Dorothy Hobson in her essay \"Women Audiences and the Workplace\",\nthe cultural significance of watching television has more to do with the discussions about the\nshow than the show itself. This analytical approach can be applied to Japanese popular culture\nas well. Someone can watch all the anime they want, but if there is no one to discuss it with, it is\njust passive entertainment, not active involvement in a culture. Simply by not being in Japan it is\nharder to find people to discuss Japanese culture with, but due to the internet this is becoming\nless and less difficult. It is easier than ever to use the internet as a tool to connect with people\nwith similar interest and have these discussions about anime, manga, or whatever part of\nJapanese culture someone is interested in. However, we still run into two problems here: that\nany resulting conversations will likely not involve Japanese people simply due to the language\nbarrier, and that by discussing these things with like-minded people, those involved will not have\nmany differing opinions. It is difficult to gain a better understanding of a culture when someone\nis surrounded by those who reinforce their own opinions, instead of challenging these opinions\nand offering a broader view.\nEssentially, while the internet can be a helpful tool to augment understand of Japanese\npopular culture, culture differences, like the language barrier and different ingrained culture\nviews, affect the way we view Japanese popular culture. Additionally, it is difficult to fully\nunderstand a culture without immersion, which is inherently impossible when experiencing a\nculture abroad.\n\nWorks Cited\nHobson, Dorothy. \"Women Audiences and the Workplace.\" Women's Studies: Essential\nReadings. Washington Square: New York UP, 1991. 490-92. Print.\nJenkins, Henry. \"Participatory Culture: From Co-Creating Brand Meaning to Changing the\nWorld.\" Participatory Culture 6.2 (2014): 24-39. Print.\nMiller, Laura. \"Cute Masquerade and the Pimping of Japan.\" International Journal of Japanese\nSociology (2011): 18-29. Print.\nSugihara, Yoko, and Emiko Katsurada. \"Gender-Role Personality Traits in Japanese\nCulture.\" Psychology of Women Quarterly (2000): 309-18. Print.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21G.039J Gender and Japanese Popular Culture: Student 3 Example Final Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-039j-gender-and-japanese-popular-culture-fall-2015/8150ffb0835080f08963f421b84c9313_MIT21G_039JF15_Feminism.pdf",
      "content": "MIT Student\nProfessor Ian Condry\n21G.039J\nDecember 10, 2015\nFeminism and Studio Ghibli\n\nStudio Ghibli is easily the most well-known Japanese film studio outside of Japan. Many\nStudio Ghibli films are known within the United States, and it is relatively common on the\ninternet to laud Ghibli films as feminist, typically at the expense of Disney. While asking people\nin real life produces a wider range of opinions on the feminism of Studio Ghibli, the animation\nstudio is still more often than not viewed as feminist, with the dissenting voices claiming it is\nneither feminist nor non-feminist. The point used most often in Studio Ghibli's favor is the\nprevalence of female characters and the lack of stereotypes impinged upon them. But is this an\naccurate depiction of Studio Ghibli films? And even if it is, is that an adequate standard to make\nStudio Ghibli feminist? To argue the feminism of Studio Ghibli, I will focus on the extent that\nwomen are treated as equal to men, if there are truly a wide variety of roles for women, and how\ncommon stereotypes of women are either subverted or reinforced.\nI will draw examples from various Studio Ghibli movies as they apply, but will focus on\nthree of the studio's more popular films: Nausicaa of the Valley of the Wind, as the film credited\nfor starting Studio Ghibli, and considered a Studio Ghibli film for the purposes of this paper;\nPrincess Mononoke, as it has many counter examples to common Studio Ghibli archetypes; and\nHowl's Moving Castle, as a film based on a book written by a woman that was drastically\nrewritten for the movie.\n\nLooking at the entire body of Studio Ghibli films, the vast majority1 manage to pass The\nBechdel Test, mentioned in Ariana's presentation about lesbians in Neon Genesis Evangelion.\nThe test stipulates that a movie must have at least two women in it who talk to each other about\nsomething other than a man. However, the test is \"truly just a guideline; there are ... films with\npowerful female characters and feminist themes that actually don't wind up passing the test ...\njust as there are films that meet the criteria that don't necessarily do anything to further gender\nequality or female empowerment\" (Wilson). Still, while The Bechdel Test cannot be used to\ndetermine if an individual movie is or is not feminist, it is a strong indicator that the studio could\nbe feminist when so many movies pass the test.\nWhile female characters are prevalent on screen, it is also important to look at the\nrepresentation of women behind the scenes. In general, \"women are sadly under-represented in\nthe worlds of cinema,\" and Studio Ghibli does not differ from the norm (Muir). No woman has\never directed or produced a studio Ghibli film, and only six movies have had a female\nscreenwriter2. Additionally, in only one of these cases is the woman the sole screenwriter and\nnot joined by a man3. In this way, there is certainly room for improvement within Studio Ghibli\nfor more high level positions to be filled by women.\nWith so many positions within Studio Ghibli held by men, there is a danger that the male\ngaze may become dominant, since men typically produce a masculine point of view (Muir).\nHowever, while studio Ghibli is led by men, the films more often than not feature young female\ncharacters. Moreover, these young women are placed in situations where they gain courage and\n\n1 Of the twenty feature films produced by Studio Ghibli - and the addition of Nausicaa - seventeen pass, three do\nnot have data (Only Yesterday, My Neighbors the Yamadas, Tales from Earthsea), and one fails the test (Pom Poko)\n(Bechdel).\n2 Reiko Yoshida for The Cat Returns; Keiko Niwa for Tales from Earthsea, Arrietty, From Up on Poppy Hill, and When\nMarnie Was There; Riko Sakaguchi for The Tale of Princess Kaguya (IMDb).\n3 Reiko Yoshida was the only screenwriter for The Cat Returns (IMDb).\n\nself-respect (Iles). This can be seen in Howl's Moving Castle, where the entire narrative focuses\non Sophie realizing her importance and self-worth. Throughout the movie, Sophie's physical\nappearance changes from an old to young woman as she becomes more assertive, willing to\nstand up for herself, and stops putting herself down. Other examples include Chihiro's journey\nnavigating the dangers of the spirit world in Spirited Away and Kiki's gains in self-confidence\nafter leaving home in Kiki's Delivery Service.\nWomen are often treated as equal to the male protagonist in many Studio Ghibli films.\nThe leading women both learn from and teach their male counterparts, instead of presenting male\ncharacters who \"single-handedly inspire the female characters to emulate them\" (Iles). It is a\nvery mutual arrangement, where women and men repeatedly help and save each other. In\nNausicaa of the Valley of the Wind, Nausicaa rescues the downed pilot Asbel, who within the\nspan of minutes also defends her when she falls unconscious. This equality is also seen in\nPrincess Mononoke, where San and Ashitaka must work together to protect the forest spirits.\nThis cooperation is visually enforced at the end of the movie, where the two return the head of\nthe forest god by lifting it up together. In this way, Iles claims that Studio Ghibli films are\n\"feminist in its blindness to gender,\" where female and male characters interact equally, each\nteaching and learning from the other.\nThe flowing narratives of Studio Ghibli, where the simplistic view of 'good guys' vs 'bad\nguys' is typically discarded, allows for more flexibility within roles initially categorized as 'hero'\nor 'villain'. The very nature of this storytelling technique allows for more complex and nuanced\nportrayals of women that subvert gender norms. Women are seen in prominent leadership\npositions in many Studio Ghibli films (Iles). In Nausicaa of the Valley of the Wind, Nausicaa is a\nwarrior princess and a pacifist with an interest in ecology. She also fulfills the prophecy\n\nmentioned at the beginning of the movie that predicts a savior will arise \"to join bonds with the\ngreat earth and guide the people to the pure lands at last\" (Miyazaki, Nausicaa). It is important\nto note that this role was originally coded male, with an image of a bearded man to go with the\nwords, causing Nausicaa to subvert the trope of a male savior. Nausicaa isn't the only woman of\nthe film in a position of power. Kushana is both an empress and a military commander who\nreceives total respect from her soldiers and stands her ground in the face of danger.\nHowl's Moving Castle also features many powerful women, both in terms of position and\nmagical ability. The magical advisor to the king is an older woman, Madame Suliman, and The\nWitch of the Waste is seen as a powerful and dangerous woman. Aside from Howl and his\nvarious aliases, no other male wizard is mentioned by name.\nPrincess Mononoke has some of the best representations of women in power, specifically\nin the role of Lady Eboshi, the leader of Irontown, \"a commune independent from patriarchal\ndomains\" (Yoshida). Through her leadership of the town, Lady Eboshi actively opposes the\nencroaching samurai and easily sees through the manipulations of Jigo. She is so confident that\nshe lets Ashitaka, a stranger looking for evidence against her, wander anywhere within the town\nwith no supervision. The women of the town follow her example and are dominant and self-\nsufficient, traits typically seen as masculine (Sugihara). Led by Toki, a former prostitute, the\nwomen of Irontown get more speaking time and characterization than the men. One unfortunate\ndownside and less positive portrayal is the trope of the nagging wife and henpecked husband,\nshown with Toki and her husband Kuroku.\nStill, it is important to recognize the amazing job Studio Ghibli has done here giving\nwomen voices. Toki is able to freely criticize Captain Gonza, without fear of being reprimanded.\nWhile at work in the bellows, the women speak freely and crudely and are not shy expressing\n\ntheir sexuality by loudly commenting on Ashitaka's appearance, calling him \"gorgeous\" and\n\"beautiful\" (Miyazaki, Princess Mononoke). There are two scenes specifically where the women\nare reprimanded by the men and then are allowed to speak back and assert themselves. In the\nfirst, the men of Irontown talk down to the women, saying, \"Look, woman! We risked our lives\nto bring you the rice you're all eating tonight, so watch your mouth,\" to which one of the women\nreplies, \"And who made the iron that paid for that rice,\" ending the conversation (Miyazaki,\nPrincess Mononoke). The second instance occurs when faced with a messenger from Lord\nAsano, who says, \"You ladies need to be taught some respect!\" and gets \"Respect? What's that?\nWe haven't had any respect since the day we were born!\" in reply (Miyazaki, Princess\nMononoke). These shots are all strongly framed in a way to suggest that the women are in the\nright for speaking back to these men. Both instances are offer positive, feminist representation\nby allowing these women to speak out against the men, some of which hold positions of power.\nMentorship roles and female friendships are also featured in several Studio Ghibli films.\nIn Kiki's Delivery Service, Kiki is supported by the bakery owner Osono, and in Spirited Away,\nChihiro is guided and helped through the bathhouse by Lin. As mentioned previously, the\nIrontown women in Princess Mononoke form a strong group that supports each other. One\ncounterexample would be Nausicaa, who has no female mentors and a dead mother only briefly\nseen in a flashback. Instead, she gets Lord Yupa, a classic male master swordsman. Had Lord\nYupa been an old woman instead of an old man, the story would have gained a positive female\nmentor, as well as a master swordswoman that would have been a great addition to a collection\nof diverse and subversive female roles.\nRegarding stereotypes, Studio Ghibli films dismantle much of what is seen in Cool Japan\nideology, where young women are allowed to be \"cute, feminine, and fun\" but also must be\n\ncooperative and docile (Miller). While many female characters within Studio Ghibli works have\nconventionally feminine attributes, like \"Nausicaa's cute voice and Kiki's big red ribbon and shy\ndemeanor,\" these characters are not necessarily docile (Yoshida). In addition to the titular\ncharacter, Nausicaa of the Valley of the Wind also features Kushana, who is a hard woman with a\nmissing arm, divergent from the ideal female body type. Still, Kushana is supposed to be read as\nan antagonist, and contrasted with the protagonist Nausicaa's childlike purity and optimism, it\nseems like Nausicaa's personality traits, as opposed to Kushana's, are what is being pushed as\nideal. These traits are more closely aligned with the problematic portrayal of women in Cool\nJapan ideology. Even when Nausicaa goes against the orders of the men in her life to enter\ndangerous situations, her purpose is always to help others - she never does anything selfishly.\nWhen Nausicaa is covered in the blood of a giant bug she still looks cute instead of disgusting,\nwith the only difference a change in the color of her dress from pink to blue.\nWithin Howl's Moving Castle, Sophie presents an excellent counter example to the\nwomen of Cool Japan, as she is far from cooperative or docile and often stands up to Howl. It is\nalso interesting that she is portrayed as an old woman throughout most of the film, which directly\ngoes against the idea that women in media should be young and cute (Miller).\nEven more extreme are the female characters in Princess Mononoke, specifically the wolf\nmother Moro and San. The first shot where the audience sees San's face is when she glares at\nthe camera with her mouth covered in blood, actively challenging the idea of passive femininity\n(Yoshida). She continues to stay wild and untamed throughout the film, even after meeting\nAshitaka. Moro also subverts typical femininity by being both nurturing and protective as well\nas violent and cruel. She focuses on revenge for the forest, presented as a masculine attribute\n(Yoshida).\n\nWhat is especially interesting about Princess Mononoke in its subversion of gender\nstereotypes is its rejection of the heterosexual relationship between the two main characters San\nand Ashitaka. While Princess Mononoke is certainly not the only Studio Ghibli film to end\nwithout a relationship, in most other cases it is simply not the focus, and while the audience may\ninterpret the relationship as becoming romantic, it is not shown. Examples of this would be\nNausicaa and Asbel, or Kiki and Tombo. What makes Princess Mononoke different is that it is\nimplied that Ashitaka and San will become a couple by the end of the film, but they never do,\nand instead decide to remain in separate worlds (Yoshida). Throughout the film, the audience is\ntold that Ashitaka has feelings for San, as Moro asks him \"Can you save the girl you love,\" and\ntells San that Ashitaka wanted to spend his life with hers. Additionally, Ashitaka himself calls\nSan beautiful, and Lady Eboshi sarcastically tells Ashitaka \"I'm sure she'll make a lovely wife\nfor you\" (Miyazaki, Princess Mononoke). With all these comments the audience is led to\nassume that the 'guy will get the girl' in the end, which is specifically avoided.\nStill, while there may be a rejection of the heterosexual relationship in Princess\nMononoke, heteronormativity is strongly reinforced throughout most Studio Ghibli movies. This\nis a main theme throughout Howl's Moving Castle, with the romance between Sophie and Howl.\nAdmittedly, this is done better than the book, where Sophie's sisters are also neatly paired off\nwith eligible men. Still, much of the plot throughout the movie relies on Howl's romantic\nrelationships with women, such as The Witch of the Waste's fixation on capturing his heart.\nNausicaa of the Valley of the Wind also has several heteronormative side comments that\nseem awkwardly forced, especially since there are no explicit romantic relationships within the\nmovies. When Kushana shows Lord Yupa her missing arm, she makes the comment, \"Whatever\nlucky man becomes my husband shall see far worse than that,\" forcing heteronormativity into a\n\nsituation that has no reason for it. Later on, Kurotowa makes the comment \"She's starting to\nlook kind of cute to me,\" after Kushana demands that the people of the Valley surrender\n(Miyazaki, Nausicaa of the Valley of the Wind). Neither comment affects the narrative and could\nhave easily been left out. Even though Nausicaa's relationship with Asbel is never explicitly\nromantic, the audience is led to believe that it could be, as he is a prince to her princess. While\nNausicaa barely gets a chance to interact with Asbel's sister, the scene where Nausicaa tries to\nsave her could be read as romantic, as the princess Lastelle fulfills the role of damsel in distress\nwhile Nausicaa rushes into the fire to save her. The story could have been more interesting and\nsubversive if Asbel's and Lastelle's roles were swapped in the narrative, so that Nausicaa instead\nsaves Lastelle when she is acting as a fierce fighter pilot, and the two girls interact and help each\nother throughout the movie, possibly culminating in a lesbian relationship.\nOne of the biggest stereotypes that Studio Ghibli falls into is conflating women with\nnature and the home. As Timothy Iles writes, \"Miyazaki often presents young women as being\nmore in contact with nature or the forces of the spirit world, and so reflective of an essentialising\nview which sees women as potentially alien to the human, cultural, urban world.\" This common\ntheme in Studio Ghibli films reinforces the idea that women are closer to nature, which Carol\nMcCormack explains is illogical and potentially harmful in her essay \"Nature, Culture and\nGender: a critique.\" She explains that the root of this idea lies in the argument that the\nreproductive power of women places them closer to nature than men. Men, \"lacking natural\ncreative functions,\" must create other more permanent objects to assert creativity. McCormack\npoints out the fallacy of this argument and asserts that both men and women have equally\nessential procreative roles, concluding that there is no logic to support the idea that women are\n\nmore natural than men, and that \"because of their naturalness, are opposed and subordinate to\nmen.\"\n\nWhile the connection between female characters and the natural world is a common\ntheme throughout many Ghibli films, there are some counterexamples. Even though Nausicaa of\nthe Valley of the Wind and Princess Mononoke have main female characters tied so closely to\nnature that it is a defining characteristic, both films also have at least one female character that\nopposes nature and works with technology. For Princess Mononoke, this is Lady Eboshi, who\naligns herself with modern technology over nature and prioritizes human development at the cost\nof the forest and its spirits (Yoshida). Similar things can be said about Kushana, who tries to use\ntechnology to destroy and control nature, in this case a jungle instead of a forest, for the\nperceived benefit of humankind.\n\nRegarding domesticity, women are often seen cooking and cleaning. These activities are\noften portrayed as positive and liberating. Sophie in Howl's Moving Castle is a prime example,\nas she considers herself the cleaning lady for Howl and the rest of castle and has several scenes\nwhere she is cleaning up after them. Other examples include Satsuki and Mei cleaning their new\nhouse in My Neighbor Totoro, Chihiro cleaning the bathhouse in Spirited Away, Kiki cleaning\nthe room given to her in Kiki's Delivery Service, and Umi leading the clubhouse cleaning effort\nin From Up on Poppy Hill. Other than the last example, men are rarely seen helping with the\nwork, if at all.\n\nOn the internet, many people like to exult Studio Ghibli, and more specifically Hayao\nMiyazaki, as producers of great feminist media. More often than not, this includes some quip\nabout how much better Studio Ghibli is than Disney (even though Ghibli movies are released as\nDisney movies in the United States). Often, this means looking over some of Ghibli's flaws and\n\nfocusing just on the positive aspects of the films. This is prevalent even within scholarly articles,\nseen when Iles recognizes that Studio Ghibli often presents women as closer to nature and\ntherefore alien to the human, masculine world, but then goes on to say \"this is an issue which I\nfor one am prepared to overlook in favor of his relatively balanced perspective on the abilities of\nyoung women to determine for themselves courses of action in any given situation.\" While these\nfilms are certainly more feminist than not, and include a lot of positive representation for girls\nand women, it is important to recognize that there is still progress to be made, and positive\nrepresentation does not erase all flaws within Studio Ghibli.\n\nWorks Cited\n\"Bechdel Test Movie List.\" Bechdeltest.com. N.p., 02 Dec. 2015. Web. 08 Dec. 2015.\nIles, Timothy \"Female Voices, Male Words.\" (n.d.): n. pag. Electronic Journal of Contemporary\nJapanese Studies. Web. 01 Dec. 2015.\nIMDb. IMDb.com, n.d. Web. 11 Dec. 2015.\nHowl's Moving Castle. Dir. Hayao Miyazaki. Prod. Toshio Suzuki. Screenplay by Hayao\nMiyazaki. Studio Ghibli, 2006.\nJones, Diana Wynne. Howl's Moving Castle. New York, NY: HarperTrophy, 2001. Print.\nMcCormack, Carol. \"Nature, Culture and Gender: a critique.\" Women's Studies: Essential\nReadings. Washington Square: New York UP, 1991. 84-86. Print.\nMiller, Laura. \"Cute Masquerade and the Pimping of Japan.\" International Journal of Japanese\nSociology (2011): 18-29. Print.\nMuir, Anne Ross. \"The Status of Women Working in Film and Television.\" Women's Studies:\nEssential Readings. Washington Square: New York UP, 1991. 488-490. Print.\nNausicaa of the Valley of the Wind. Dir. Hayao Miyazaki. Screenplay by Hayao Miyazaki. Prod.\nIsao Takahata. Toei, Inc., 1984.\nPrincess Mononoke. Dir. Hayao Miyazaki. Prod. Toshio Suzuki. Screenplay by Hayao Miyazaki.\nStudio Ghibli, 2002.\nSugihara, Yoko, and Emiko Katsurada. \"Gender-Role Personality Traits in Japanese\nCulture.\" Psychology of Women Quarterly (2000): 309-18. Print.\nWilson, Samantha. \"Exploring The Bechdel Test As a Ratings System.\" Film School Rejects.\nN.p., 08 Nov. 2013. Web. 09 Dec. 2015.\nYoshida, Kaori. \"National Identity (Re)Construction in Japanese and American Animated Film.\"\n(n.d.): n. pag. Electronic Journal of Contemporary Japanese Studies. Web. 01 Dec. 2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.039J / 21A.143J / WGS.154J / 21G.591 Gender and Japanese Popular Culture\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}