{
  "course_name": "Gender, Race, and the Construction of the American West",
  "course_description": "This course explores how gender shaped the historical experiences and cultural productions in the North American West during the time it was being explored, settled, and imagined. The North American West of the late nineteenth and early twentieth centuries provides a fascinating case study of the shifting meanings of gender, race, citizenship, and power in border societies. As the site of migration, settlement, and displacement, it spawned contests over land, labor disputes, inter-ethnic conflicts and peaceful relations, and many kinds of cultural productions.\nThe Graduate Consortium in Women’s Studies (GCWS)\nThis course is part of the Graduate Consortium in Women’s Studies. The GCWS at MIT brings together scholars and teachers at nine degree-granting institutions in the Boston area who are devoted to graduate teaching and research in Women’s Studies and to advancing interdisciplinary Women’s Studies scholarship. Learn more about the GCWS.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Modern History",
    "Literature",
    "American Literature",
    "Social Science",
    "Political Science",
    "American Politics",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Humanities",
    "History",
    "American History",
    "Modern History",
    "Literature",
    "American Literature",
    "Social Science",
    "Political Science",
    "American Politics",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 3 hours / session\n\nPrerequisites\n\nApplication to the\nGraduate Consortium in Women's Studies\n.\n\nOverview\n\nThe North American West of the late nineteenth and early twentieth centuries provides a fascinating case study of the shifting meanings of gender, race, citizenship, and power in border societies. As the site of migration, settlement, and displacement, it spawned contests over land, labor disputes, inter-ethnic conflicts and peaceful relations, and many kinds of cultural productions.\n\nThis course explores how gender shapes the historical experiences and cultural productions in the North American West during the time it was being explored, settled, and imagined. Challenging the myths of western expansion as an exclusively male endeavor, and the formation of western myth and enterprise as exclusively male domains, the course pays particular attention to the roles of women in promoting, resisting, transforming, and constructing the trans-Mississippi West as reality and imaginary.\n\nThe course uses primary sources (diaries, letters, novels, photographs) and secondary source readings to examine gender identity and practice across racial-ethnic groups, geographic region, local economies, and class lines. It does so through the lenses of social and cultural theory, history, sociology, film, literature, craft, and art. The readings consistently prompt questions about the sources of evidence--whose voice is recorded, whose image is captured, whose art is preserved--and how the twenty-first century scholar can interpret them. The methodological limitations of certain sources and the implications of their use will be part and parcel of our quest to understand this multifaceted history.\n\nCourse Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n40%\n\nResearch Paper\n\n60%\n\nRequired Readings\n\nBabb, Sanora.\nWhose Names Are Unknown.\nUniversity of Oklahoma Press, 2006. ISBN: 9780806137124. [Preview with\nGoogle Books\n]\n\nBernardin, Susan, Melody Graulich, et al.\nTrading Gazes: Euro-American Women Photographers and Native North Americans, 1880-1940\n. Rutgers University Press, 2003. [Preview with\nGoogle Books\n]\n\nCalof, Rachel.\nRachel Calof's Story: Jewish Homesteader on the Northern Plains.\nIndiana University Press, 1995; repr. 1936. ISBN: 9780253209863. [Preview with\nGoogle Books\n]\n\nCather, Willa.\nMy Antonia.\nEdited by Joseph R. Urgo. Broadview Press, 2003. ISBN: 9781551114910.\n\nGordon, Linda.\nThe Great Arizona Orphan Abduction\n. Harvard University Press, 2003. ISBN: 97806743600419. [Preview with\nGoogle Books\n]\n\nHansen, Karen V.\nEncounter on the Great Plains: Scandinavian Settlers and the Dispossession of Dakota Indians, 1890-1930\n. Oxford University Press, 2013. ISBN: 9780199746811. [Preview with\nGoogle Books\n]\n\nLee, Mary Paik.\nQuiet Odyssey: A Pioneer Korean Woman in America.\nUniversity of Washington Press, 1990. ISBN: 9780295969695. [Preview with\nGoogle Books\n]\n\nSilko, Leslie.\nCeremony.\nPenguin Classics, 2006; repr. 1976. ISBN: 9780143104919. [Preview with\nGoogle Books\n]\n\nSee the\nReadings\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "Passions, Property, and Power: Mexican-Anglo Marriage in the Spanish Borderlands",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-640-gender-race-and-the-construction-of-the-american-west-fall-2014/a156ff706f669403182d0c078c024b5a_MITWGS_640F14_Intrmarriage.pdf",
      "content": "Erica Washburn\nGender, Race, and the West\n12 December 2014\n\nPassions, Property, and Power: Mexican-Anglo Marriage in the Spanish Borderlands\n\nInterracial unions, as well as the legal and social prohibitions against such unions, reflect\nthe ways in which societies consolidate power and regulate domestic arrangements. In the\nsouthwest, the study of intermarriage illuminates the intersection of race, gender, and culture on\nthis colonial frontier. In focusing on Mexican-Anglo intermarriages in Texas, New Mexico, and\nCalifornia, this paper will demonstrate how historians reconceptualized the study of\nintermarriage based on their fields of study and how these studies were influenced by the\ndominant historical paradigms of the time. During the second half of the twentieth century,\nhistorians struggled to reconcile the studies of larger historical forces of assimilation, conquest,\nand colonialism with studies of individual agency and patterns of accommodation and resistance\nagainst oppressive circumstances. Sociologists, Marxists, cultural and social historians,\nfeminists, Chicanas, borderlands historians, colonial and post-colonial historians have all\nanalyzed Mexican-Anglo marriages. Their conclusions vary in explaining the motivations and\nconsequences of interracial unions, as well as the amount of agency Mexican women may have\nexpressed in choosing their marital partners.\nIn theoretical terms, historians have dramatically reconceptualized the study of\nintermarriage over the second half of the twentieth century. Until recently, the majority of studies\non intermarriage have been carried out by social scientists, who have focused their analysis on\nthe laws of social behavior that account for the incidence of interracial marriage.1 In the\nimmediate post-war period, American structural-functional theorists laid out an explicit theory of\n\n1 Peggy Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage\" Frontiers: A Journal\nof Women Studies 12, no. 1 (1991): 5.\n\nWashburn\nsocial structures, which produced much of the \"classic\" theories of sociology.2 Structural\nfunctionalism reached the peak of its influence in the 1940s and 1950s, during which time\nClaude Levi-Strauss analyzed the role of marriage as a form of exchange between less powerful\nand more powerful allies. According to Levi-Strauss, \"dual organizations\" existed in\nprecapitalist societies, and were marked by a system in which, \"members of the community,\nwhether it be a tribe or a village, are divided into two parts which maintain complex relationships\nvarying from open hostility to very close intimacy, and with which various forms of rivalry and\nco-operation are usually associated.\"3\nDual organizations existed within tribes and could apply to different tribes and\ncommunities of peoples. Within the American Southwest, structural-functionalist theorists\nposited that women were the means by which men literally and symbolically maintained\npeaceful relations with outsider groups. In this context, Amerindians represented the less\npowerful political group in the face of sixteenth century Spanish conquest. Maria Raquel Casas,\none of the leading contemporary Chicana historians, claims that structuralist theories of the\n1950s overemphasized the utilitarian role of women in intermarriage. Despite this critique, the\nmajority of historians still tend to agree that intermarriage was important for alliance building\nbetween Mexican elites and Euro-American immigrants in the nineteenth century.4\nAnother explanation for the prevalence of Mexican-Anglo marriages with a functionalist\nelement claims that Anglo-American men only sought out marriages with Mexican women\nbecause there were too few Anglo-American women in frontier societies. Again, this argument\n\n2 Charles, Crothers. \"Recent Works on Social Structure: A Literature-Review Essay\" Humboldt Journal of Social\nRelations 22, no. 97 (1996): 97.\n3 Claude Levi-Strauss, John Richard Von Sturmer, James Harle Bell, and Rodney Needham, The elementary\nstructures of kinship. (Boston: Beacon Press, 1969), 69\n4 Maria Raquel Casas, Married to a daughter of the land: Spanish-Mexican Women and Interethnic Marriage in\nCalifornia, 1820-1880. (Reno: University of Nevada Press, 2007), 22.\n\nWashburn\nhas the effect of commodifying Mexican women because these women theoretically represented\nthe only options for immigrating men. It also does not explain why Anglo-American men sought\nout marriages primarily with Mexican women, and not Indian women. Regardless, historian\nAlbert Hurtado argues that there were far more men than women in colonial California, which\ndrove male competition for eligible women and fostered early betrothal of young girls. He even\ncites the example of Sergeant Ygnacio Vicente Ferrer Vallejo who found it so important to marry\na woman with similar Spanish bloodlines, that he became engaged to an infant girl on the day of\nher birth. In 1776, Vallejo helped deliver his future wife, whom he would formally marry when\nhe was forty and she was fourteen.5 Hurtado argues that arranged marriages buttressed\npatriarchal authority and reinforced the power of an oligarchy of elite landowners, but his\nanalysis leaves very little room for Mexican women's agency in these unions. According to\nHurtado, \"The young women who formed interfamily links seldom had much to say about it;\nwhen they did speak up there was little chance that they would be taken seriously.\"6 Clearly an\ninfant would not have the capacity to refuse this marriage proposal, but Hurtado does not\nrecognize Mexican women's actions in pushing against race and gender boundaries within such\nunions.\nAlthough later historians criticized structural functionalist approaches to studying\nintermarriage because of its utilitarian analysis of Mexican women, it has nevertheless remained\na popular discourse due in part to Marxist economic determinist interpretations. By claiming that\n\"male chauvinism\" and women's oppression can only be understood by analyzing class,\nhistorians have essentially reduced the roles of Mexican women to mere objects, which were\ntraded between powerful male groups. This \"commodification\" argument highlights how\n\n5 Albert L. Hurtado, Intimate frontiers: sex, gender, and culture in old California. (Albuquerque: University of New\nMexico Press, 1999), 27.\n6 Hurtado, 129.\n\nWashburn\nMexican patriarchs and Anglo-American men exploited Mexican women, but it also eliminates\nany trace of women's agency in these coercive encounters, which later feminist and Chicana\nhistorians sought to reclaim as part of the dominant narrative.\nPost-structuralism and cultural studies of the 1960s and 1970s arose in response to\nstructural functionalism's immutable categories of societies and peoples, which eventually gave\nway to a larger cultural and gendered perspective of history. Rejecting the older paradigm, in\nwhich culture was seen as \"a relatively unified system of values and beliefs,\" social historians\nemphasized the \"community strength, collective consciousness, and active agency of people in\nthe various cultures\" they studied.7 Rather than focusing solely on the histories of elite white\nmen, social historians analyzed broader categories of race, class, and gender. Within this new\nparadigm, historians no longer analyzed Mexican women as mere commodities in an exchange\nsystem between elite Mexican families and Euro-American men. Rather, historians adopted what\nCasas calls a \"feminine perspective\" by focusing on the lives of Mexican women, who were\ntraditionally considered of secondary importance because of both their race and gender.8 Casas\nstops short of calling this a \"feminist perspective\" because historians' conclusions about\nMexican women were often problematic. Although these historians attempted to fully understand\nthe positions and contributions of Mexican women, they were influenced by contemporary\nparadigms of assimilation, which ultimately concluded that women were primarily victims.9\nIn 1976, Jane Dysart adopted such a \"feminine perspective\" in examining intermarriages\nbetween Mexican women and Anglo-American men in San Antonio from 1830 to 1860. Within\nthis period, Dysart describes how intermarriage united Anglo political influence with Mexican\nlanded wealth in Texas. Historians have also found this interracial alliance-making between\n\n7 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 12.\n8 Casas, 11.\n9 Casas, 11.\n\nWashburn\nMexican patriarchs and Anglo immigrants present in the regions of New Mexico and California\naround the time of the Mexican-American War. According to civil marriage records dating from\n1837 to 1860, 906 Mexican women married Mexican men, and only 88 chose to marry Anglos.\nWhile only accounting for roughly 10 percent of marriages, nearly half of Anglo-Mexican\nmarriages involved women from high status families. What is more, at least one daughter from\nalmost every rico family in San Antonio married an Anglo.10 Dysart argues that there was a clear\nclass component to these interracial arrangements, in that wealthy Mexican patriarchs sought to\nestablish family connections with the dominant Anglo group after Texas gained its independence\nfrom Mexico in 1836. Because Mexican daughters customarily inherited property on a relatively\nequal basis with sons, Anglo men who married Mexican women gained extensive landholdings\nwhile tapping into existing networks of power.\nWhile Dysart examines the motivations behind Mexican-Anglo intermarriage based on\nthe interests of men in both parties, she also makes a point to mention the effects of these\nmarriages on Mexican women. In setting the foundation of her study, she claims that historians\nmust \"treat the women as active participants, rather than passive objects in the historical\nprocess.\"11 Clearly, she adopts a burgeoning feminist stance; however, her conclusions about\nMexican women are often problematic when compared to those of contemporary feminist and\nChicana scholars like Casas. Dysart claims that Mexican-Anglo marriages initiated a process of\nassimilation and acculturation that subsumed women's identities under the project of\nAmericanization. According to Dysart, \"cultural, ethnic, and even racial distinctions were\nblurred as the two groups incorporated in a common culture. Where prevailing attitudes\nassuming cultural or racial superiority prevented extensive intermarriage, the assimilation\n\n10 Jane Dysart, \"Mexican Women in San Antonio, 1830-1860: The Assimilation Process\" The Western Historical\nQuarterly 7, no. 4 (1976): 370.\n11 Dysart, 366.\n\nWashburn\nprocess was only partially complete.\"12 Although Dysart proclaims the need to recognize\nMexican women's participation in the historical process, she also paints these women as victims\nof the larger forces of Anglo assimilation. At worst, assimilation effectively stripped these\nwomen of their cultural identities, and at best, their identities melted down into an amalgamated\n\"common\" culture.\nAlthough Dysart fails to recognize the complexities of women's agency within\nintermarriages, she does recognize some ways in which women held fast to their religion and\nkinship networks. Dysart used baptismal records to show that children retained their Catholic\nfaith and census records to demonstrate the strength of Mexican kinship networks due to the\npresence of Mexican grandparents in these interracial households. Mexican mothers often gave\ntheir children typically \"Spanish\" names and relied on godparents to guide their children in the\nfaith. However, Dysart backtracks by claiming that children \"established their identity with their\nfather's ethnic group,\" and that school attendance, as well as the next generations' marriage to\nnon-Mexicans, hastened the process of assimilation.13\nLike Dysart, Darlis A. Miller adopts an assimilationist stance while writing about New\nMexico in 1982, but she also adopts a \"feminine stance\" examining the lives and qualities of\nMexican women. According to Miller, earlier historians of Mexican-American marriages\nattributed these relationships solely to Anglo-Americans' land hunger, whereas she claims, these\nwomen \"were valued by Anglo men for many reasons: as helpmates, links to powerful Hispanic\nfamilies, and as mothers, companions, and lovers.\"14 She also claims that \"Hispanic women were\n\n12 Dysart, 365.\n13 Dysart, 374.\n14 Darlis A. Miller, \"Cross-Cultural Marriages in the Southwest: The New Mexico Experience, 1846-1900\" New\nMexico Historical Review 57, no. 4 (1982): 336.\n\nWashburn\nuniversally praised for their kindness and hospitality.\"15 Perhaps, Miller attempted to counter\nracist stereotypes of Mexican women, but her claims of Anglos' glorification of these women's\npositive qualities may also blur the realities of racism at the time. More recently, colonial\nhistorian Linda Gordon argued that Anglo-American men adopted an \"Orientalist\" construction\nof Mexican women, which \"made them seem simultaneously submissive and exotically sexually\nattractive.\"16 Thus historians today claim that Anglo-American men held both negative and\npositive stereotypes of Mexican women, which effectively \"othered\" these women.\nMiller's discussion of nineteenth century intermarriages in New Mexico is similar to\nDysart's findings in San Antonio. According to Miller, Anglo merchants and adventurers\nimmigrated to the region after Mexican independence from Spain in 1821. She claims that by the\n1850s, there was a predominantly male Anglo population of between 500 and 1200 people. Like\nHurtado's claims about intermarriages in California, Miller argues that these men arrived without\nwives so they were essentially \"forced\" into marrying into the local population. She also notes a\nparticular class component to Mexican-Anglo marriages, which Dysart also found in Texas.\nAccording to Miller, many early Anglo settlers married into the territory's elite Hispanic\nfamilies, which essentially \"tied an intruding foreign population to the ruling class of New\nMexico and smoothed the transition to American rule.\"17 However, she also relies on the work of\nhistorian Nancie Gonzales to claim that in the early years after American conquest,\n\"intermarriage between Anglo men and Mexican women was apparently quite common and not\nrestricted to any particular social class.\"18 Gonzales examined the 1880 census and found that in\nthe territorial capital of Sante Fe, 63 percent of married Anglo men were joined in mixed\n\n15 Miller, 340.\n16 Linda Gordon, \"Internal Colonialism and Gender\" in Haunted by empire: geographies of intimacy in North\nAmerican history ed. Ann Laura Stoler, (Durham: Duke University Press, 2006), 439.\n17 Miller, 337.\n18 Miller, 341.\n\nWashburn\nmarriages in 1870.19 Rather than claiming that intermarriage was largely restricted to elite\nMexicans and Anglos, Miller argues that intermarriage was a common phenomenon between all\nclasses, which calls into question the motivations for these marriages.\nAccording to Miller, military records and census returns indicate that in the post-1830\nperiod intermarriages abounded in the laboring and artisan classes. These Anglo-American men\nincluded \"farm laborers, carpenters, blacksmiths, miners, butchers, cooks, and numerous small\nfarmers. The women who married these men frequently came from humble surroundings.\"20\nWhile historians argue that elite marriages served common economic and political interests of\nMexican and Anglo-American men, Miller's argument about the prevalence of lower-class\nintermarriages begs for an explanation. Miller is careful not to claim that these women chose\ntheir marriage partners, but she does insinuate that these interracial unions came about for solely\neconomic reasons. Despite finding that these intermarriages were not limited to the elite class\nwho presumably had more at stake in protecting their wealth and class status, she does not draw\nany further conclusions about whether women from lower-class backgrounds had more freedom\nin choosing their marital partners.\nCasas' primary study examined nineteenth century marriages between Californianas and\nEuro-American men, though she also discusses Deena Gonzalez's study of intermarriages in\nSante Fe, New Mexico to demonstrate how historians have historically overstated the prevalence\nof such unions. Deena Gonzalez finds that in the 1850s, approximately 100 out of 239 Euro-\nAmerican men, mostly trappers and traders who had decided to settle in New Mexican\ncommunities, were married to New Mexican women. While this number is shockingly high (just\nlike Nancie Gonzales' findings for 1870) in comparison to the total New Mexican community,\n\n19 Miller, 341.\n20 Miller, 342.\n\nWashburn\nthese marriages meant that only 2 percent of New Mexican women were married to Euro-\nAmerican men.21 According to Casas, historians' manipulation of how common intermarriage\nwas around the mid-nineteenth century is important because--in focusing only on Anglo men--it\n\"epitomizes the way in which historians have projected their ethnocentric cultural attitudes\ntoward intermarriage.\"22 In claiming that these marriages were quite common, historians are\nperpetuating racist claims of the nineteenth century that maintained Mexican women preferred\nrelationships with Anglo-American men over Mexican men. Historians' overestimation of\nintermarriage also seems to validate America's project of colonization in the Southwest because\nthese women appear to be naturally drawn to the conquerors.\nCasas illustrates how even present day historians' understandings of Mexican women's\nmotivations continue to be tainted by the racialized ideologies of the nineteenth century. Both\nCasas and Hurtado rely on information obtained from nineteenth century historian Hubert Howe\nBancroft, who compiled brief biographies of prominent California pioneers, including marriage\ndata. Casas relies heavily on Bancroft's compilation of elite Mexican women's narratives to\nsupport her arguments about women's agency. Bancroft recorded 80 mixed marriages between\n1817 and 1848.23 While providing objective data of intermarriages, he also expressed the\nsocioracial ideologies of the day by asserting that Californianas readily preferred Euro-\nAmericans as marriage partners because of the \"physical, moral, spiritual, and cultural\ndeficiencies that the women were alleged to perceive among their own Californio menfolk.\"24\nSurprisingly, these racist discourses continue to permeate contemporary historical scholarship on\nintermarriage today.\n\n21 Casas, 12.\n22 Casas, 12.\n23 Hurtado, 36.\n24 Casas, 10.\n\nWashburn 10\nColonial historian Linda Gordon draws on these racist nineteenth century ideas about\nAnglo and Mexican men's racial differences with the aim of celebrating Mexican women's\nagency in choosing marital partners. According to Gordon, \"Mexican women were not merely\nexchanged. They often preferred or even sought out marriages with white men because of their\nreputation of being more egalitarian, less controlling than Mexican men and because of their\nbetter jobs and greater resources.\"25 Although a feminist claim in highlighting women's choice,\nher arguments are problematic for several reasons. Miller pointed out that \"diaries, letters, and\njournals written by Hispanic women are rare, making it difficult to assess the impact that\ninterethnic marriages had on Hispanic women.\"26 The lack of documents from Mexican women\nthemselves makes not only the consequences of intermarriages difficult to ascertain, but also the\nmotivations for such unions. Gordon may be exaggerating how much say these women actually\nhad in choosing their partners, while also perpetuating Anglo-American men's racist claims\nmade about Mexican men.\nWhile Casas opposes historians' problematic understanding of Mexican women's\nmotivations in intermarriage, she also argues against historians' descriptions of the consequences\nof these unions. According to Miller, \"For many New Mexican women, a rise in social status\naccompanied marriage to an Anglo. The latter generally--but not always--had more money to\nspend than his Hispanic counterpart and usually was better educated.\"27 Casas flatly denies this\nassertion, in stating \"these marriages did not instigate upward social mobility for the women as\npreviously assumed.\"28 Miller also describes Mexican women as victimized objects and Anglo\nmen as active subjects. According to Miller, \"Rather than being assimilated into Hispanic\n\n25 Gordon, 439.\n26 Miller, 346.\n27 Miller, 342.\n28 Casas, 13.\n\nWashburn 11\nsociety, Anglo husbands became agents for social change.\"29 Chicana historians refute the\nvalidity of assimilationist discourse for the very reason that it represents a male-dominated\ndiscourse that leaves women powerless in the face of cultural oppression.\nAlthough Miller tends to portray Mexican women as victims of oppression, she does\nredeem herself in discussing how some women retained their Catholic faith and \"Spanish\"\ncustoms. However, she goes on to claim, \"Spanish was not universally spoken in the home,\" and\nthat \"schools, visits from Anglo relatives, and the presence of English-speaking neighbors\nhastened assimilation.\"30 She relies on census records of the city of Las Cruces to argue that the\nmajority of school-aged children of mixed marriages attended school, and therefore, underwent a\nprocess of assimilation. In San Antonio, Dysart argued that the children of mixed marriages\nsought marriages with Anglo-Americans, while Miller explains that children of mixed marriages\nin New Mexico often married individuals who were themselves the products of cross-cultural\nunions.31 Dysart claims census and marriage records show that second generation were\nassimilated because as adults, they Anglicized their names and married Anglo-American\npartners.\nIn resisting these claims of assimilation, Casas argues that in California, Euro-American\nmen married into well-connected Californio families and had to accommodate themselves into a\nwoman's family and culture. According to Casas, \"the Euro-American husband and resulting\nchildren became Hispanicized.\"32 It is far more likely that Euro-American men accommodated\nMexican families before the Mexican-American War when elite Mexican men were in power\nand controlled the majority of land, and is perhaps, less true after Mexico's defeat when the\n\n29 Miller, 347.\n30 Miller, 352.\n31 Miller, 353.\n32 Casas, 13.\n\nWashburn 12\nSouthwest became part of the United States. While Casas' argument may be an\novergeneralization about Mexican-Anglo marriages over time, she firmly asserts Mexican\nwomen as cultural agents and negotiators of interracial exchanges. For Chicana historians,\nMexican women represent the ultimate actors in their own stories, which require a more nuanced\nunderstanding of how they both accommodated and resisted the pressures put on them by Euro-\nAmerican husbands, changing legal structures, and gender roles.\nIn the 1980s, assimilation and acculturation discourse still represented the dominant\nparadigm. However, some historians were moving away from analyzing women as victims of\nlarger forces of oppression. One such groundbreaking work on intermarriage was Sylvia Van\nKirk's Many Tender Ties published in 1983. Although her work centered on Native American\nwomen and intermarriage with Euro-American men within the Canadian fur trade, her focus on\n\"intimate frontiers\" inspired later scholars of the Spanish borderlands, feminism,\n(inter)colonialism, and post-colonialism. Kirk argued that marriages between fur traders and\nIndian women created bonds of mutual dependency that advanced cultural exchange along with\ntrade relations. Like Casas who described Mexican women as cultural agents, Kirk described\nIndian women as cultural brokers, which represented a move away from the contemporary\nnarrative of women of color as mere victims of assimilation.\nPublished only four years later in 1987, Gloria Anzaldua's Borderlands struck the\nheaviest blow to the assimilationist discourse in her analysis of the \"mestiza consciousness\" in\nthe Spanish borderlands. Rather than claiming Mexican women were forced to give up their\nethnic identities in order to adopt Anglo cultural norms, Anzaldua describes an ethno-cultural\nconsciousness that is rife with conflict, but which also holds the opportunity to cure society's ills.\nAs Mestizas, Mexican women are daughters of Indian mothers and Spanish fathers, and are\n\nWashburn 13\nforced to undergo an inner struggle or \"inner war\" of borders. For Anzaldua, Chicana culture\nitself represents a form of inner cultural domination where \"commonly held beliefs of the white\nculture attack commonly held beliefs of the Mexican culture, and both attack commonly held\nbeliefs of the indigenous culture.\"33 According to Anzaldua, these identities do not disappear\nunder assimilationist policies, and instead result in a new consciousness that uproots dualistic\nthinking and asymmetrical power relationships by its very \"mixedness.\"\nHer arguments do not provide a plan for tackling systematic patterns of oppression and\nexploitation because she views multiracial peoples' racial ambiguity and tolerance for\ncontradictions as a necessary precursor to racial equality and coexistence. Anzaldua also\nresponds to assimilationist arguments that the majority of children of Mexican-Anglo marriages\nadopted their Anglo father's identity. According to Anzaldua, racial mixedness cannot simply be\n\"unlearned\" through Anglo cultural practices, but is written on people's DNA. She argues:\nAt the confluence of two or more genetic streams with chromosomes constantly\n'crossing over,' this mixture of races, rather than resulting in an inferior being,\nprovides hybrid progeny, a mutable, more malleable species with a rich gene\npool. From this racial, ideological, cultural and biological cross-pollinization, an\n\"alien\" consciousness is presently in the making--a new mestiza consciousness,\nuna consciencia de mujer.34\n\nAnzaldua refutes any claims for the existence of a \"dominant\" Anglo race or \"weaker\" Mexican\nand Indian races, which assimilationist arguments rested on. She also adopts scientific language\nto discredit pseudoscientific racist claims made about the \"mongrelization\" of races. Anzaldua's\nwork refocused writing about race and gender, however, her claims that racial mixing was\nevident on even the biological level, reinforces the illusion that race exists as a scientific reality.\nWriting in 1991, Peggy Pascoe argued for the study of intermarriage within a feminist\nanalytical framework for the very reason that race and gender were often treated as physical\n\n33 Gloria Anzaldua, Borderlands/La Frontera: the new mestiza. (San Francisco: Spinsters/Aunt Lute, 1987), 100.\n34 Anzaldua, 99.\n\nWashburn 14\nrealities, rather than as social constructions. According to Pascoe, historians \"tend to accept the\nsocial-scientific assumption that race and sex themselves are immutable categories, the \"givens\"\nof historical analysis; they stop short of investigating historical changes in notions of race and\ngender.\"35 She argues that historians have even greater difficulty analyzing race as a social\nconstruction than gender because feminist scholars have distinguished between the notion of sex\nas a biological category and gender as a social construction. Pascoe also nods to more recent\nfeminist scholarship, which adds another layer of complexity to the argument by claiming that\nlike gender, sex itself is a social construction.36\nAlong with the focus on race and gender as social constructions, the 1990's also saw a\nrise in critical cultural studies and a refocusing of social history. Historians who adopted a\ncultural critical model, analyzed power and conflict within given cultures. According to Pascoe,\nthis approach had \"its roots in critical theory, poststructuralist literary criticism, and postmodern\nanthropology,\" and examined culture as a site of conflict where various groups struggled to\ncontrol symbols and meaning.37 With regards to the history of interracial marriage, this approach\nhighlighted power relations within given cultures, but Pascoe argues that ultimately, the cultural\ncritical model emphasized larger forces at the expense of individual agency. According to\nPascoe, this model was counterproductive to feminist historians because it \"deemphasizes\npersonal agency and choice, which does not empower \"subaltern\" groups to share their own\nexperiences.\"38 While social historians aimed to emphasize ordinary people as active agents in\ntheir own lives, Pascoe claimed that they also tend to keep relationships between cultures on the\nmargins of their studies. Pascoe states, \"To keep a firm eye on the tension between the power of\n\n35 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 5.\n36 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 9.\n37 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 13.\n38 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 15.\n\nWashburn 15\nthe dominant, on the one hand, and the agency of the oppressed, on the other, we must choose\nsites in which multiple cultures are present, and we must focus on the problem of recovering the\nperspectives of the powerless, as well as the powerful.\"39 The study of intermarriage requires\nfeminist theory, which analyzes dominant groups and oppressive forces, while also\nunderstanding how people influenced race and gender relations through their resistance and\naccommodation.\nAs a contemporary Chicana historian, Casas adopts a feminist analytical stance and\ndraws on notions of Mexican women's hybridity to analyze Mexican-Anglo intermarriage in the\nCalifornia borderlands region. Casas was also inspired by Kirk's Many Tender Ties and argued\nthat the similarities between Native American and Mexican women involved in marriages with\nEuro-American men were significant, particularly \"the economic and collaborative roles that\nwomen played in incorporating their husbands into specific cultural exchanges. Both Canadian\nNative American women and Californianas became \"women in between.\"40 Historians like Casas\nand Anzaldua have focused precisely on Mexican women's \"in-betweenness\" in order to assert a\nspace where these women expressed their agency.\nCasas describes her work as a larger project of Chicana history, which reclaims the\nhistories of Mexican women who chose to marry \"outsiders.\" According to Casas, Chicana\nhistorians of the 1970s largely ignored the study of Mexican-Anglo marriages because these\nrelationships represented \"the act of powerful males taking women from powerless men. For\nMexicans and Chicanos, pride in their miscegenated background was counterbalanced by shame\nthat it resulted from a devastating military and cultural conquest.\"41 While the studies of\nintermarriage may have stirred up feelings of shame related to an American colonial conquest, it\n\n39 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 15.\n40 Casas, 49.\n41 Casas, 12.\n\nWashburn 16\ncan also be argued that Chicana historians may have viewed these women as interlopers or race\ntraitors who compromised their ethnic identities and communities by \"sleeping with the enemy.\"\nCasas seeks to overcome this historical marginalization of women who intermarried with\nforeigners in order to express Mexican women's participation in cultural exchange and\nresistance.\nCasas roots her analysis of nineteenth century Mexican-Anglo marriages in the California\nregion within the context of a larger colonial project. During the initial wave of conquest during\nthe sixteenth century, the Spanish crown promoted marriage with Amerindians, or \"daughters of\nthe land,\" in order to gain access to property and stabilize the border.42 By the nineteenth\ncentury, Mexican Californios had acquired the vast majority of land and began using the term\n\"daughters of the land\" to refer to their own California-born daughters. Consequently,\nAmerindian women were lowered in social status to being merely Indian.43 Although the concept\nof race was more fluid in colonial societies than in Spain, the rules controlling domestic\narrangements reflected the empire's larger imperial goals of expansion. Invading Americans had\nthese same goals of expansion and also appropriated colonial language to legitimize their\nconquest in the nineteenth century. They, too, reinforced their claims of a natural association to\nthe land by marrying the Mexican \"daughters of the land.\" On the other hand, marriages to\nIndian women were no longer useful because they did not own the land.\nAlthough American colonizers adopted the same language to justify land-taking, the\nconsequences of intermarriage on Mexican populations varied based on the region. According to\nCasas, in New Mexico \"the marriage of Europeans to 'daughters of the land' brought value and\n\n42 Casas, 8.\n43 Casas, 8.\n\nWashburn 17\nwealth to the women and their families, whereas in California the opposite occurred.\"44 By the\nearly-nineteenth century, a landed-elite already existed in California, which essentially absorbed\nEuro-Americans into its folds. Euro-American men were the major benefactors of property and\nwealth. In return, elite Mexican families affirmed their social standing and status by maintaining\nthe racial purity of their Spanish background.\nIn looking at the numbers of intermarriages, Casas cites several scholars who place the\npercentage of interethnic marriages between Californianas and Euro-Americans in 1840 at\nroughly 15 percent of the total Californio population.45 This relatively low number of interethnic\nunions again demonstrates how previous historical scholarship has exaggerated how common\nthese relationships actually were in the Spanish borderlands. Casas blames historians'\noverstatements on their own Eurocentric beliefs about Mexican women being overwhelmingly\ndrawn to white men for sexual or economic reasons.46 The census data also shows that only half\nof the Euro-American trappers who entered California married Mexican women. Historians like\nHurtado have analyzed these relationships from an Anglo-male perspective by claiming that\nimmigrating men were essentially forced to marry Mexican women due to the lack of Anglo-\nAmerican women. Casas' analysis, on the other hand, assigns Mexican families with the agency\nto deny lower-class Euro-American trappers entry into their prestigious family networks.\nMexican patriarchs sought out proper marital partners for their daughters in order to\nmaintain their status and protect their political and economic interests around the time of the\nMexican-American War in 1846. While elite Mexican men sought stability in forming alliances\nwith the Euro-American invaders, Casas argues that the marriages between Californianas and the\nsecond wave of Euro-Americans were far less stable in the 1840s. She claims that Euro-\n\n44 Casas, 9.\n45 Casas, 135.\n46 Casas, 13.\n\nWashburn 18\nAmericans who settled in California after 1836--the year that Texas gained its independence\nfrom Mexico--were less likely to abide by customary social mores. By the 1840s, the most\ndesirable lands were already taken and Euro-Americans viewed Mexican cultural protocol as an\nobstacle to their ability to establish their own homesteads and ranchos.47 Consequently, 10.2\npercent of all trappers and traders eventually separated from their Mexican wives.48 Perhaps,\nEuro-American men no longer saw the value in interethnic unions with a conquered people\nfollowing Mexico's defeat in the Mexican-American War.\nAfter the Mexican-American War, Casas focuses her analysis on how Mexican women\nadapted to the cultural expectations of their Euro-American spouses and biethnic families, as\nwell as the changing legal systems and gender roles of American society. Unlike earlier\nhistorians who focused on women's assimilation, Casas examined how women expressed their\nagency. After the conquest, Mexican women lost many of the traditional ways in which they\ncontested their prescribed sexual boundaries, including the community legal system. Under\nMexican law, a married woman retained control of any property she had acquired prior to\nmarriage, and could air her grievances in court. By exposing displeasure with a spouse, Mexican\nwomen enlisted public censure to obtain counseling or modify their spouse's behavior.\nAccording to Casas, the courts had a high success rate of reconciliation, with 85 percent of\nspouses returning to their marriages, and only 15 percent separating.49 Although only a minority\nof marriages dissolved, communities were forced to accept these women living alone. Indeed,\nCasas cites social historian Richard Griswold del Castillo who estimates that single women ran\n13 percent of all Californio households in the post-Mexican War era.50\n\n47 Casas, 127.\n48 Casas, 135.\n49 Casas, 134.\n50 Casas, 118.\n\nWashburn 19\nThe California Congressional Convention of 1850 recognized Mexican women's rights to\ncommunity property, however, women lost the underlying legal structures and social\nrelationships that protected their interests under the Mexican government. Despite this loss,\nwomen found new avenues to resist their gendered boundaries by utilizing the American legal\nsystem. According to Casas, Mexican women's will-making became \"the primary means of\npreserving inheritances and of keeping property out of the prying hands of Euro-Americans.\"51\nLikewise, Casas explains that after the war, more women gave their power of attorney to men,\nbut that these women also placed strict limits on the power of these \"attorneys.\"52 She goes on to\nargue, \"Rather than interpreting such transactions as reinforcements of stereotypical gender\nroles, we need to see how these transactions, like wills, pushed against patriarchal boundaries\nand helped to fulfill women's desires and needs.\"53 This new perspective is representative of a\nhistorical change in how historians described the genuine obstacles Mexican women faced in\ntheir marriages and under their new government without painting them as victims.\nCasas respects Mexican women's agency in highlighting the subtle ways in which they\npursued their own interests by accommodating and resisting the new systems of power. Casas\ncites the example of Maria Amparo Ruiz, who used her maternal surname \"Ruiz\" throughout her\nadult life because it was a more prestigious and influential family name in Baja California than\n\"Maitorena.\"54 When Ruiz married Lieutenant Colonel Henry Stanton Burton, she abandoned\nher maiden name due to the same class motivations. Casas argues, \"In terms of class, the name of\nBurton advanced and protected her interactions with American society; therefore, she made a\nrelatively quick and easy accommodation. Yet she raised her children in a bilingual, bicultural\n\n51 Casas, 123.\n52 Casas, 125.\n53 Casas, 126.\n54 Casas, 159.\n\nWashburn 20\nhousehold.\"55 Far from being a victim of assimilation, Casas portrays Maria Amparo Ruiz-\nBurton as a savvy woman who chose to take her husband's name in order to protect her\neconomic interests. In some ways, Casas argues that Mexican women retained what really\nmattered to them on an intimate level by raising their children in a way that honored their\nMexican background.\nWriting in 2012, historian Ann Hyde also analyzed subtle resistance within a feminist\nanalytical stance, but from the perspective of the second generation. Maria de Jesus was the\ndaughter of Ramona Yorba, an elite Mexican woman; and Benjamin Davis Wilson; a former fur\ntrader who arrived in southern California in 1841. Wilson married into an old Californio family,\nand according to Hyde, \"took on the trappings of elite Mexican life,\" included landownership.56\nYorba and Wilson had several children before she died, including Maria de Jesus. Like Casas,\nHyde discusses women's agency with regards to accommodation, rather than their victimization.\nLike Maria Amparo Burton, Maria de Jesus also voluntarily changed her name in order to protect\nher class status. According to Hyde, Maria de Jesus became Sue Wilson when she went to\nboarding school in San Francisco. Although she accommodated American society with her name\nchange, she refused to give up her religion. She was pressured to become a Protestant by her new\nstepmother, Margaret Hereford Wilson, but Hyde argues that she remained a practicing Catholic\nwith the support of her Mexican relatives.57\nSue later married James DeBarth Shorb, a gold rush emigrant to California, and had\neleven children. According to Hyde, Sue Wilson \"seemed not to be burdened by racial markers\"\n\n55 Casas, 161.\n56 Anne F. Hyde, \"Hard Choices: Mixed Race Families and Strategies of Acculturation in the U.S. West after 1848\"\nin On the Borders of Love and Power Families and Kinship in the Intercultural American Southwest ed. David\nWallace Adams and Crista DeLuzio, (Berkeley: University of California Press, 2012), 107.\n57 Hyde, 108.\n\nWashburn 21\neven through she looked \"Mexican.\" 58 Hyde concludes that her father's status and her husband's\nfinancial success allowed Sue and her children to \"move easily into the upper-class world of\nwealthy southern Californians but also to retain their ties to the Californio Yorba family through\nnaming and godparenting.\"59 As a woman \"in-between,\" Sue Wilson did not appear alienated,\nbut rather seems to have taken advantage of the familial ties of both her mother and father. She\nprotected her class interests by asserting her connections with her father's and husband's\n\"whiteness,\" while also tapping into kinship and religious support networks. While Hyde\nexplains that Sue \"managed to cross growing ethnic divides,\" she also concedes, that \"marriage\nbetween Anglos and Mexican Californians grew ever more rare.\"60 One of the reasons Mexican-\nAnglo marriages became exceedingly rare was due to the hardening of racial boundaries in\nAmerican society.\nColonial, inter-colonial, and post-colonial historians argued that the study of American\nrace and gender hierarchies, as well as the hardening of race and gender boundaries required an\nanalysis of the colonial context. During the 1950s and 1960s colonial historians studied\nAmerican colonialism as a \"mere episode\" in American history.61 In the 1990s, colonial\nhistorians and Spanish borderlands historians argued that America's colonial project was also\npresent on the domestic front. According to Gordon, internal colonialism called attention to the\nfact that there was little ideological difference between the United States' domestic and foreign\nrelations. For historians of colonialism, internal colonialism represented the desire to construct\ncomparisons with foreign colonialism and internal, or \"settler\" colonialism at home in the\nSpanish borderlands. According to Gordon, internal colonialism arose from a Marxist tradition,\n\n58 Hyde, 109.\n59 Hyde, 109.\n60 Hyde, 109.\n61 Ann Laura Stoler, \"Tense and tender ties: the politics of comparison in (post) colonial studies\" Itinerario 27, no. 3\n(2003): 4.\n\nWashburn 22\nwhich \"came to characterize intersecting economic exploitation and political exclusion of a\nsubordinated group that differed racially or ethnically from the dominant group--and all this\nwithin a polity rather than across oceans or borders.\"62 In studying the historical construction of\nrace, colonial historians can identify the processes by which some groups became white and\ngained access to all of the privileges and rights which went along with such classification.\nWhat is perhaps most interesting about Mexicans introduction to the American polity\nafter the Mexican-American War is that the stipulations of the Treaty of Guadalupe Hidalgo,\nwhich granted Mexicans citizenship led a federal court to rule in 1897 that Mexicans were\n\"white.\"63 According to Gordon, \"the domination of the U.S. binary, black-white racial system\nled Mexican Americans struggling for rights and acceptance to insist that they were white.\"64 In\nlooking at patterns of Mexican women's agency in claiming familial connections to white fathers\nand husbands, it is easy to see how Mexican-Americans would also insist on their whiteness in\nsuch a racially-stratified and discriminatory society. Rather than being \"white-washed\" under\nassimilation, Mexican-Americans accommodated the American racialization process, which\nconsidered them white in order to protect their own economic interests. Gordon calls these acts\n\"reaccommodation,\" and urges a focus on people's agency in negotiating conflict.65\nColonialism studies waned in the 1990's, but the focus on comparing American\ncolonialism with other colonial regimes did not. For post-colonial historians, like Ann Stoler,\nstudies \"turned away from how United States imperialism 'consolidated' North America and\nhow empire influenced domestic policy to view American racial politics from the regions that\n\n62 Gordon, 428.\n63 Gordon, 436.\n64 Gordon, 437.\n65 Gordon, 443.\n\nWashburn 23\nwere colonized.\"66 Like previous studies on intermarriage, post-colonial historians recognized\nthe importance of analyzing intimate domains and how they figured into making of racial\ncategories, which effectively buttressed imperial rule. However, post-colonial historians also\nexamined the Spanish borderlands as a contested social and cultural space where racial\nclassifications were both accepted and confounded by ordinary peoples.\nStoler also argues for a more global perspective in comparing the \"intimacies of\nAmerican empire\" to other colonial regimes in regions other than Latin America. According to\nStoler, comparative studies of American empire are necessary because they \"may prompt a\nsearch for common strategies of rule and the sequences of their occurrence that questions the\nrelationship between imperial expansion and nation building and that asks why sex was a\npolitically charged \"transfer point\" for racisms of the state.\"67 As a colonial state project, the\nUnited States developed its own rules regarding interracial unions, with an emphasis more on\nmarital rather than sexual relationships. Once again, property was of utmost concern, in that\nAmerican legislators targeted interracial marriage with a greater fervor because marriage\ninvolved property obligations.68 While Mexican-Anglo marriages facilitated the exchange of\nproperty into white men's hands, anti-miscegenation laws ensured that this property stayed in\nwhite men's hands.\nThe study of Mexican-Anglo marriages illuminates the ways in which Mexican women's\nlives were defined not only by gender, but also the larger economic, political, cultural, and\nreligious structures of the time. Intermarriage occurred within the bounds of American\ncolonization, where American leaders developed specific legislation, which both encouraged\ninterracial unions in order to gain access to Mexican land and discouraged such unions after the\n\n66 Stoler, 5.\n67 Stoler, 14.\n68 Pascoe, \"Race, Gender, and Intercultural Relations: The Case of Interracial Marriage,\" 6.\n\nWashburn 24\nland grabbing process was complete. As historians have moved in the direction of \"bottom up\"\nhistory in studying oppressed groups, they have also struggled to fully recognize Mexican\nwomen's agency due to the lack of Mexican women's own writing. Historians, then, are faced\nwith the task of analyzing how women made sense of and perhaps, influenced the racialization\nprocesses of the American colonial regime. Studies of intermarriage are also important in\nrecognizing how race and gender are social constructions and how those in power assign\nmeaning to these mutable categories in order to purse their own imperial and domestic agendas.\nDebates over issues defining American culture, power, race, ethnicity, and gender require a\nhistorical understanding of how the state has historically intervened in personal matters for the\nsake of maintaining its policies. Ultimately, historical scholarship must examine America's\nmultiracial and multicultural past to inform contemporary discussions of race and gender\nrelations.\n\nWashburn 25\nBibliography\n\nAnzaldua, Gloria. 1987. Borderlands: the new mestiza = La frontera. San Francisco:\nSpinsters/Aunt Lute.\n\nCasas, Maria Raquel. 2007. Married to a daughter of the land Spanish-Mexican women and\ninterethnic marriage in California, 1820-1880. Reno: University of Nevada Press.\n\nCrothers, Charles. 1996. \"RECENT WORKS ON SOCIAL STRUCTURE: A LITERATURE-\nREVIEW ESSAY\". Humboldt Journal of Social Relations. 22 (2): 97-107.\n\nDysart, Jane. 1976. \"Mexican Women in San Antonio, 1830-1860: The Assimilation Process\".\nThe Western Historical Quarterly. 7 (4): 365-375.\n\nGordon, L. \"Internal Colonialism and Gender.\" In Haunted by empire: geographies of intimacy\nin North American history, edited by Ann Laura Stoler, 427-451. Durham: Duke\nUniversity Press, 2006.\n\nHurtado, Albert L. 1999. Intimate frontiers: sex, gender, and culture in old California.\nAlbuquerque: University of New Mexico Press.\n\nHyde, Anne F. \"Hard Choices: Mixed Race Families and Strategies of Acculturation in the U.S.\nWest after 1848.\" In On the Borders of Love and Power Families and Kinship in the\nIntercultural American Southwest, edited by David Wallace Adams and Crista DeLuzio,\n93-115. Berkeley: University of California Press, 2012.\n\nLevi-Strauss, Claude, John Richard Von Sturmer, James Harle Bell, and Rodney Needham.\n1969. The elementary structures of kinship = (Les structures elementaires de la parente).\nBoston: Beacon Press.\n\nMiller, Darlis A. \"Cross-Cultural Marriages in the Southwest: The New Mexico Experience,\n1846-1900.\" New Mexico Historical Review 57:4 (1982): 335-359.\n\nPascoe, Peggy. 1991. \"Race, Gender, and Intercultural Relations: The Case of Interracial\nMarriage.\" Frontiers: A Journal of Women Studies. 12 (1): 5-18.\n\nStoler, Ann Laura. 2003. \"Tense and tender ties: the politics of comparison in (post) colonial\nstudies.\" Itinerario. 27 (3/4): 263-284.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nWGS.640 Gender, Race, and the Construction of the American West\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}