{
  "course_name": "Gender, Power, Leadership, and the Workplace",
  "course_description": "This course will provide students with an analytic framework to understand the roles that gender, race, and class play in defining and determining access to leadership and power in the U.S., especially in the context of the workplace. We will explore women and men in leadership positions within the corporate, political and non-profit sectors, with attention to the roles of women of color and immigrant women within this context. We will also look at specific policies such as affirmative action, parental leave, child-care policy, and working-time policies and the role they play–or could play–in achieving parity. We will further investigate ways in which these policies address gender, racial, and class inequities, and think critically about mechanisms for change. The course will be highly interactive, and will combine texts, theater, videos and visual arts.",
  "topics": [
    "Business",
    "Leadership",
    "Social Science",
    "Political Science",
    "American Politics",
    "Public Administration",
    "Public Policy",
    "Social Welfare",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Business",
    "Leadership",
    "Social Science",
    "Political Science",
    "American Politics",
    "Public Administration",
    "Public Policy",
    "Social Welfare",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1 hour and 15 minutes / session\n\nPrerequisites\n\nMIT students need permission of the instructor.\n\nDescription\n\n\"Until women are as ambitious as men, they're not going to achieve as much as men.\"\n\nSheryl Sandberg, Facebook Executive and author of\nLean In.\n\n\"Young men keep telling me they don't 'have it all' either. And they may have a point. But if you define 'having it all' as the opportunity to have a successful career and a family, I'd say this. When a man tells his coworkers he's going to have a child, no one asks him how he'll manage or if he'll be coming back to work.\"\n\nAnne-Marie Slaughter, President and CEO of the New America Foundation and author of\nWhy Women Can't Have it All\n.\n\n\"Seek out and learn from people with a different perspective on history. To create our multicultural future, all people's voices and perspectives must be welcome.\"\n\nJuana Bordas, author of\nSalsa, Soul, and Spirit: Leadership for a Multicultural Age.\n\nCourse Requirements\n\nStudents are expected to complete the weekly readings prior to class, to attend all classes and to participate in discussion. The course grades are based on:\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n20%\n\nResponse papers / presentations\n\n20%\n\nAn 8-page research/policy paper that involves library / field research\n\n30%\n\nFinal 8-page paper and presentation in which students explore strategies and / or leadership for change\n\n30%\n\nSee\nAssignments section\nfor more information.\n\nRequired Readings\n\nBordas, Juana.\nSalsa, Soul and Spirit: Leadership for a Multicultural Age\n. Barrett-Koehler Publishers, 2012. ISBN: 9781609941178. [Preview with\nGoogle Books\n]\n\nSandberg, Sheryl.\nLean In: Women, Work, and the Will to Lead\n. Knopf Doubleday Publishers, 2013. ISBN: 9780385349949. [Preview with\nGoogle Books\n]\n\nFried, Mindy.\nTaking Time: Parental Leave Policy and Corporate Culture\n. Temple University Press, 1998. ISBN: 9781566396462. [Preview with\nGoogle Books\n]\n\nRecommended\n\nNeely, Barbara.\nBlanche on the Lam\n. Penguin Books, 1993. ISBN: 9780140174397.\n\nNote: On the weeks where there is a lot of reading, students will divide the reading, selecting articles / chapters from among those that are assigned.",
  "files": [
    {
      "category": "Resource",
      "title": "Research/Policy Paper Options",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/wgs-s10-gender-power-leadership-and-the-workplace-spring-2014/3f4f0c5fb599e02646d04cb5c46ce756_MITWGS_S10S14_pap_opt.pdf",
      "content": "Research/Policy Paper Options\n\nChoose from the following options (or suggest your own idea, which we can discuss):\n\n1. Select a workplace policy or benefit that potentially supports employees to\nbalance their work and family responsibilities/needs. Critically review the\nresearch in this area. What have you learned from the findings of these\nstudies? What are the strengths and limitations of these studies (e.g., their\nmethods)? Where are the gaps in information about the policy/benefit?\nPossible examples of workplace policies/benefits are: employer-sponsored\nchild care, union-initiated work-family policies/programs, flexible work\narrangements (e.g., flextime, telecommuting, job sharing, part-time work), and\nparental leave policy.\n\n2. Examine workplace policies in another country that offer a contrast to the U.S.\nCritically review the research done on these issues, using a gender lens in your\nanalysis. Compare and contrast with policies and practices in the United\nStates. Possible countries to explore include: Sweden, Germany, France, the\nU.K., Cuba, Chile, Argentina (or other country you select).\n3. Examine a leader who has \"made a difference\" in promoting gender equity in\nthe workplace, in politics, in communities, etc. Write about the\npolicies/legislation/actions s/he has promoted and the impact they have had.\nDiscuss any controversies involved in their actions, and include your opinion\nabout their leadership actions as well as leadership style, if relevant.\n\n4. Research a piece of work-related legislation that is pending or has already\npassed. Describe the legislation, analyze it from a gender/race/class\nperspective. Describe the forces in favor and opposed to it, articulate their\npositions, and provide any insight regarding how their ideologies inform their\nstance on the legislation. Does the legislation go far enough? Does it go too\nfar? Share your opinion about it. Finally, provide an analysis regarding the\nimplications of this legislation.\n\nExamples of legislation you might select include: welfare legislation (e.g.,\nTransition Assistance for Needy Families), parental leave legislation (e.g.,\nFamily and Medical Leave Act, Baby UI), child care legislation (e.g., ABC),\nflexible working time, etc.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nWGS.S10 Gender, Power, Leadership, and the Workplace\nSpring 2014\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}