{
  "course_name": "Gender Issues in Academics and Academia",
  "course_description": "Does it matter in education whether or not you’ve got a Y chromosome? You bet it does. In this discussion-based seminar, we will explore why males vastly outrank females in math and science and career advancements (particularly in academia), and why girls get better grades and go to college more often than boys. Do the sexes have different learning styles? Are women denied advanced opportunities in academia and the workforce? How do family life and family decisions affect careers for both men and women?",
  "topics": [
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nFormat\n\nThis course, as part of the\nExperimental Study Group\nSeminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Students Laurel Ruhlen (B.S. 06 Physics) and Kayla Jacobs (B.S. 06 Physics, 07 Mathematics) taught this seminar in cooperation with Dr. Holly Sweet, Lecturer and Associate Director of the Experimental Study Group. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nCourse Description\n\nDoes it matter in education whether or not you've got a Y chromosome? You bet it does. In this discussion-based seminar, we will explore why males vastly outrank females in math and science and career advancements (particularly in academia), and why girls get better grades and go to college more often than boys. Do the sexes have different learning styles? Are women denied advanced opportunities in academia and the workforce? How do family life and family decisions affect careers for both men and women?\n\nWhile much of the material will deal with the issues of girls and women in academics, boys' experiences will also be addressed. We will also briefly investigate the effects of race and general societal pressures on these issues, and how MIT specifically is addressing gender concerns in its educational and research programs.\n\nClass Structure\n\nThe class will meet for two hours once per week. The seminar is almost entirely discussion-based, guided by the readings assigned for that class.\n\nReadings\n\nEach week will have 25-50 pages of reading to be completed before class. A number of the selections, especially early in the semester, will come from two excellent books:\n\nSadker, Myra, and David Sadker.\nFailing at Fairness\n. New York, NY: Scribner, 1995. ISBN: 9780684800738.\n\nJossey-Bass Publishers.\nThe Jossey-Bass Reader on Gender in Education\n. San Francisco, CA: Jossey-Bass, 2002. ISBN: 9780787960742.\n\nOthers readings will be provided as photocopies or online links. Unless you're using a library book, do mark up the pages with underlining, highlighting, and notes in the margins. Students are encouraged to suggest interesting supplemental topics and readings to the class.\n\nWriting Assignments\n\nJot down your initial thoughts and reactions and questions after each reading (try to include the page number that prompted your idea, so that it can be easily referred to during the discussion). Come with at least one open-ended discussion question every week - something you found particularly interesting, or surprising. Your journal will not be graded or even looked at (unless you'd like the instructors to give you feedback); it's for your own recordings of your thoughts, though you will need to draw from your notes during class discussions.\n\nGrading Policy\n\nThis seminar is graded P/D/F. You will be expected to complete all the assigned readings before class, use your journal regularly, and participate fully and thoughtfully in the discussions. Because the discussion element of the course is so integral, you may miss at most two class sessions; please inform your instructors ahead of time if possible, and let them know if there are any special circumstances.",
  "files": [
    {
      "category": "Resource",
      "title": "Boys' Educational Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/1c99b0b53f0ad821a76af90278042e70_MITES_242S04_ses2.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 2: Boys' Educational Issues\nReadings to complete before class:\n(1) Kindlon, Dan and Michael Thompson. \"Thorns Among Roses: The Struggle of Young Boys\nin Early Education.\" Chapter 7 in The Jossey-Bass Reader on Gender in Education. Edited\nby Jossey-Bass Publishers. San Francisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in Kindlon and Thompson's 2000 book, Raising Cain: Protecting the\nEmotional Life of Boys.)\n(2) Sadker, Myra and David Sadker. \"The Miseducation of Boys.\" Chapter 8 in Failing at\nFairness. New York, NY: Scribner, 1995. ISBN: 068480073X.\n(This reading can also be found, identically, in Chapter 8 of The Jossey-Bass Reader on Gender in Education.\nSee publication information above.)\nDiscussion notes:\n- (2) \"The Miseducation of Boys\" is from \"Failing at Fairness\" (where last week's (1) \"A\nHistory of Women's Education\" was also from), which was based on research conducted\nin the late '80s and early '90s.\n- Never before thought of the \"burden\" of being a \"star\"\no Definitely recognized the \"star\" stereotype from personal experience with\nclassmates.\no \"Runner-up stars\" a fascinating concept.\n- \"It is precisely because they intensified traditional notions of masculinity that educators\nfound sports so attractive and incorporated them into the official school program\" (Jossey-\nBass Reader p. 188).\n- In early 1900s, more women top school were administrators than today!\n- Murder statistics really shocking.\n- \"Whatever sophisticated planning has gone into curriculum design at Alan's school, the\ndistinction between a good class and a bad class, for his point of view, has a lot to do with\nthe freedom it offers to stand up and walk around\" (Jossey-Bass Reader p. 159).\n- Slower language development in boys: \"If you start teaching [reading] any earlier, it looks\nas if all your boys have reading disabilities\" (Jossey-Bass Reader p. 164).\n- Action figures: \"to be big instead of small, to have power in the world instead of the role of\npowerless child\" (Jossey-Bass Reader p. 161).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Classroom Dynamics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/3a02f6b357d510f5be7558608ea82a24_MITES_242S04_ses7.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 7: Classroom Dynamics\nReadings to complete before class:\n(1) Orenstein, Peggy. \"Learning Silence: Scenes from the Class Struggle.\" Chapter 1 in\nSchoolGirls: Young Girls, Self-Esteem, and the Confidence Gap. New York: Doubleday\n(1994). ISBN: 0385425759.\n(2) FAF chapter 3: \"Missing in Interaction.\"\nDiscussion notes:\n(1) Orenstein: \"Learning Silence\"\n- \"Amy walks to the far side of the room and, as she takes her seat, falls into a typically\nfeminine pose: she crosses her legs, folds her arms across her chest, and hunches forward\ntoward her desk, seeming to shrink into herself. The sauciness of the playground\ndisappears, and, in fact, she says hardly a word during class. Meanwhile, the boys,\nespecially those who are more physically mature, sprawl in their chairs, stretching their\nlegs long, expanding into the available space\" (p.7).\n- \"When the girls... do speak, they follow the rules... When Amy volunteers her sole answer\nof the period, she raises her hand, too. She gives the wrong answer to an easy\nmultiplication problem, turns crimson, and flips her head forward so her hair falls over her\nface. Occasionally, the girls shout out answers, but generally they are the easiest, lowest-\nrisk questions, such as the factors of four or six. And their stabs at public recognition\ndepend on the boys' largesse; when the girls venture responses to more complex questions\nthe boys quickly become territorial, shouting them down with their own answers... [The\nteacher] doesn't say anything to condone the boys' aggressiveness, but she doesn't have to:\nthey insist on--and receive--her attention even when she consciously tries to shift it\nelsewhere in order to make the class more equitable.\" (p. 9).\n- \"I don't raise my hand in my classes because I'm afraid I have the wrong answer and I'll\nbe embarrassed\" (p.11).\n- Classroom interactions as power struggles.\n(2) Failing at Fairness: \"Missing in Interaction\"\n- To preserve order, most teachers use established classroom conventions such as raising\nyour hand if you want to talk. Intellectually, teachers know they should apply this rule\nconsistently, but when the discussion becomes fast-paced and furious, the rule is often\nswept aside. When this happens and shouting out begins, it is an open invitation for male\ndominance. Our research shows that boys call out significantly more often than girls.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSometimes what they say has little or nothing to do with the teacher's questions. Whether\nmale comments are insightful or irrelevant, teachers respond to them. However, when girls\ncall out, there is a fascinating occurrence: Suddenly the teacher remembers the rule about\nraising your hand before you talk. And then the girl, who is usually not as assertive as the\nmale students, is deftly and swiftly put back in her place. Not being allowed to call out like\nher male classmates... will not psychologically scar [her]; however, the system of silencing\noperates covertly and repeatedly. It occurs several times a day during each school week for\ntwelve years, and even longer if [she] goes to college, and, most insidious of all, it happens\nsubliminally. This micro-inequity eventually has a powerful cumulative impact\" (Failing\nat Fairness pp. 43-44).\n- \"On the surface, girls appear to be doing well. They get better grades and receive fewer\npunishments than boys... Reinforced for passivity... As victims of benign neglect, girls are\npenalized for doing what they should\" (Failing at Fairness p. 44).\n- \"When we videotape classrooms and play back the tapes, most teachers are stunned to see\nthemselves teaching subtle gender lessons along with math and spelling.\" (Failing at\nFairness p. 46)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Course-Taking Patterns; Sex Education",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/f1761e89dd7cb1aefecb4788defc6eda_MITES_242S04_ses3.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 3: Course-Taking Patterns; Sex Education\nReadings to complete before class:\n(1) American Association of University Women. \"Course-Taking Patterns.\" Chapter 11 in The\nJossey-Bass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San\nFrancisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in the AAUW-commissioned 1998 report, Gender Gaps: Where Schools\nStill Fail Our Children.)\n(2) Fine, Michelle. \"Sexuality, Schooling, and Adolescent Females.\" Chapter 17 in The Jossey-\nBass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San Francisco, CA:\nJossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in Fine and Lois Weis's 1993 book, Beyond Silenced Voices, and in the\nFebruary 1988 Harvard Educational Review.)\nDiscussion notes:\n(1) AAUW: Course-Taking Patterns\n- Number of math courses taken by girls and boys nearly equal now, but type/level not.\no Should states make higher-level math required for all students? (AAUW p. 294)\n- Have you heard of the issue of boys' underenrollment in language and arts classes before?\nHas it struck you as a \"problem\" like girls' underenrollment in physics?\n- Boys and girls are approximately equally represented in the social sciences and APs.\n- Remedial classes and tracking: Good or bad?\no Good for gifted, not for others?\no Is it helpful for slower students, or does it just hold them back?\no Is it the responsibility of the schools to provide for the extremes of the bell curve?\nThe state?\n- Girls identified more than boys in gifted programs in elementary school, but they drop out:\nwhy?\no Suggestions: Geek stereotypes, fitting in, etc.\n- \"U.S. culture often equates higher expenditure of effort with lower ability\" (AAUW p.\n291). What does this say about boys (who often assume/say their success is due to ability)\nand girls (who often assume/say their success is due to effort)? Does this stereotype ring\ntrue? Could girls' efforts be to compensate for lower ability, or perhaps to give the\nimpression of lower ability so as not to be \"too smart\"? (\"Oh, I just studied really hard for\nthat test; it's not that I'm a math genius\"--and thus geeky and unattractive.)\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n(2) Fine: Sex Education\n- \"Adolescent sexuality → victimization and danger\" theme.\n- \"Sex-negative attitudes do not discourage sexual activity, but they do discourage\nresponsible use of contraception. Teens who believe sexual involvement is wrong deny\nresponsibility for contraception. To accept responsibility would legitimate 'bad' behavior\"\n(Fine p. 377).\n- Personal experience: 9th grade \"Life Skills\" class video on rape had only female victims of\nmale aggressors depicted.\no What does this portrayal say to boys who don't/won't rape?\no What about male victims of rape? (More of 'em than you might think! Though\nstill much smaller than the number of female victims.)\n- Don't get into an argument about abstinence education: rather, focus on academic effects\n(pregnancy, drop outs...) if possible.\n- Surprising that most parents didn't object to sex ed in schools.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESL Studies and Cross-Cultural Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/aed80a70c2b87b604534d33f67159d4e_MITES_242S04_ses10.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 10: ESL Studies and the Cross-Cultural Issues\nReadings to complete before class:\n(1) Morris, Lori. \"Differences in Men's and Women's ESL Writing at the Junior College Level:\nConsequences for Research on Feedback.\" Canadian Modern Language Review 55, no. 2\n(December 1998). http://128.100.205.43/access/jour.ihtml?lp=product/cmlr/552/552-\nMorris.html\n(2) McGroarty, Mary. \"Cross-Cultural Issues in Adult ESL Classrooms.\" Center for Adult\nEnglish Language Acquisition Digests (July 1993).\nhttp://www.cal.org/caela/esl_resources/digests/cross_cultural.html\nDiscussion notes:\n(1) Morris: \"Dfferences in ESL Writing\"\n- This study shows that women tend to succeed because they are good at obeying rules. Why\ndoes that make them \"better\" at leaning languages and not, say, math - which relies even\nmore heavily on sets of rules than language does?\n(2) McGroaty:\"Cross-Cultural Issues in Adult ESL Classroom\"\n- How effective are classroom techniques in overcoming cultural gender inequalities?\n- How can teachers respect cultural differences while also ensuring that all the students\nreceive an equal education? (e.g. Sitting in circle, looking at wife.)\n- How is doing that different from trying to overcome American traditions of gender\ninequality?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Gay, Lesbian, Bisexual, and Transgendered Experiences",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/b30e3e54662700326085ea74ef82fb20_MITES_242S04_ses13.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 13: Gay, Lesbian, Bisexual, and Transgendered Experiences\nReadings to complete before class:\n(1) Steward, Doug. \"Working Towards Equality.\" Academe 89, no. 4 (July-August 2003).\nhttp://www.aaup.org/publications/Academe/2003/03ja/03jastew.htm\n(2) Feltey, Katherine M. \"Living Outside the Center.\" Chapter 6 in Lesbians in Academia:\nDegrees of Freedom. Edited by Beth Mintz and Esther Rothblum. New York, NY: Rothblum\n(1997). ISBN: 0415917026.\n(3) Anonymous. \"My, How Times Have Changed... Or Have They? A Quarter Century as a\nLesbian Academic.\" Chapter 29 in Lesbians in Academia: Degrees of Freedom. Edited by\nBeth Mintz and Esther Rothblum. New York, NY: Rothblum (1997). ISBN: 0415917026.\n(4) Bernstein, Fred. \"On Campus, Rethinking Bio 101.\" New York Times (March 7, 2004).\nDiscussion notes:\n- Sex vs. gender\no Sex = biological sex, based on physical features.\no Gender = social role and identity (affects clothing, speech patterns, encouraged\ncareer goals, etc.).\no Big question in cultural studies of how much of gender is determined by sex\nand/or by society's conventions.\no Both terms are used independently of sexual orientation (who a person is\nromantically/sexually attracted to).\n- Because of their relative seclusion from the outside world, university settings can be\nexcellent - or terrible - in terms of environment for GLBTs.\n- Differently-gendered living arrangements\no Pros and cons of same-sex roommates, floors, dorms, schools.\no What about more \"traditional\" requests? \"Yale Five\" - Orthodox Jewish students\nat Yale sued the university for requiring them to live in co-ed dormitories (or, as it\nhappened in practice, to pay for the dorms while actually living at home) which\nthe students felt was against their religion's teachings on moral living. Suit\ndismissed by courts because \"the plaintiffs could have opted to attend a different\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\ncollege or university if they were not satisfied with Yale's housing policy.\" How\nis this similar or dissimilar to GLBT accommodation requests?\n- Should students at single-sex colleges be allowed to continue to be enrolled if during\ncollege they change to identifying (either personally or biologically) as a member of the\nopposite sex?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Gender Issues in Academics and Academia",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/2e7206d9f7e51b1f25f9f95bdc2266f7_MITES_242S04_lecs.pdf",
      "content": "MIT ES.242 - Spring 2004\nGender Issues in Academics and Academia\nLaurel Ruhlen & Kayla Jacobs\nhttp://ocw.mit.edu/OcwWeb/Special-Programs/SP-242Spring-2004/CourseHome/\nCourse Description: Does it matter in education whether or not you've got a Y chromosome?\nYou bet it does. In this discussion-based seminar, we will explore why males vastly outrank\nfemales in math and science and career advancements (particularly in academia), and why girls\nget better grades and go to college more often than boys. Do the sexes have different learning\nstyles? Are women denied advanced opportunities in academia and the workforce? How do\nfamily life and family decisions affect careers for both men and women?\nSES # TOPIC\nPAGES\nIntroduction; History of Gender in Education\n2-3\nBoys' Educational Issues\nCourse-Taking Patterns; Sex Education\n5-6\nTitle IX\n7-8\nStandardized Tests\nSingle-Sex Schooling\nClassroom Dynamics\n11-12\nThe Feminine Mystique\n13-14\nWomen's Studies\n15-16\nESL Studies and Cross-Cultural Issues\nMIT's Journey Towards Diversity\n18-19\nOpting Out\n20-21\nGay, Lesbian, Bisexual, and Transgendered Experiences\n22-23\nSummary and Conclusions\nThe notes below were prepared by the instructors as informal personal notes to help guide\ndiscussions during classes.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 1: History of Gender in Education\nReadings to complete before class:\n(1) Sadker, Myra and David Sadker. \"Through the Back Door: A History of Women's\nEducation.\" Chapter 2 in Failing at Fairness. New York, NY: Scribner, 1995. ISBN:\n068480073X.\n(2) American Association of University Women. \"How Girls Negotiate School.\" Chapter 10 in\nThe Jossey-Bass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San\nFrancisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in the AAUW-commissioned 1996 report, Girls in the Middle: Working\nto Succeed in School.)\nDiscussion notes:\n(1) Failing at Fairness: \"History of Women's Education\"\n- Quite surprising in many ways\no Describes many now-laughable theories on women's abilities (e.g. algebra vs.\novaries, phrenology).\no Interesting that now \"laughable\" - we don't find things like \"women's careers\" or\n\"home-ec\" laughable at all (though perhaps could feel it misguided or offensive).\n- Changes both slow and fast\no Hundreds of years till girls could even go to school or receive any education at all.\no But then, \"mere\" decades till gender equality more-or-less recognized as a Good\nThing to be striving for.\n- \"Professionalized motherhood\" (p. 19) similar to description of the 1950s in Betty\nFriedan's The Feminine Mystique (to be explored more deeply in Session 8).\n- Reagan-era backlash particularly shocking - the late '70s and '80s were recent.\n(2) AAUW: \"How Girls Negotiate Schools\"\n- AAUW = American Association of University Women, founded 1881 (as the Association\nof Collegiate Alumnae). Funds lots of influential research on girls and women in\neducational settings (both pre- and post-university levels). Also has funds female graduate\nstudent stipends and holds national conferences on women in education.\nhttp://www.aauw.org\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n- Did you recognize the social cues and norms from your own experience? (Does answer\ndiffer depending on gender of student?)\n- Big emphasis on role models\no Really seemed to be a make-or-break factor.\no What does this mean for areas without lots of female (or male!) role models? For\nexample, physics today or medicine in the past for women, full-time homemaking\nor nursing for men.\no Note over 50% of medical school students are female; less than 5% of nurses are\nmale.\no Keep in mind that there's often a big difference between the percentage of a\nprofessional school class being a certain gender and the percentage of a profession\nbeing a certain gender. Practicing professionals went to school years ago, when\nthe percentages were often different (usually reflecting traditional gender roles).\nBrings up \"leaky-pipeline\" issue too.\n- Did you have any difficulties relating to Angela? Why?\n- The \"schoolgirls\" studied were mostly white - would there be different conclusions for\nother racial groups? What would you expect the differences to be?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 2: Boys' Educational Issues\nReadings to complete before class:\n(1) Kindlon, Dan and Michael Thompson. \"Thorns Among Roses: The Struggle of Young Boys\nin Early Education.\" Chapter 7 in The Jossey-Bass Reader on Gender in Education. Edited\nby Jossey-Bass Publishers. San Francisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in Kindlon and Thompson's 2000 book, Raising Cain: Protecting the\nEmotional Life of Boys.)\n(2) Sadker, Myra and David Sadker. \"The Miseducation of Boys.\" Chapter 8 in Failing at\nFairness. New York, NY: Scribner, 1995. ISBN: 068480073X.\n(This reading can also be found, identically, in Chapter 8 of The Jossey-Bass Reader on Gender in Education.\nSee publication information above.)\nDiscussion notes:\n- (2) \"The Miseducation of Boys\" is from \"Failing at Fairness\" (where last week's (1) \"A\nHistory of Women's Education\" was also from), which was based on research conducted\nin the late '80s and early '90s.\n- Never before thought of the \"burden\" of being a \"star\"\no Definitely recognized the \"star\" stereotype from personal experience with\nclassmates.\no \"Runner-up stars\" a fascinating concept.\n- \"It is precisely because they intensified traditional notions of masculinity that educators\nfound sports so attractive and incorporated them into the official school program\" (Jossey-\nBass Reader p. 188).\n- In early 1900s, more women top school were administrators than today!\n- Murder statistics really shocking.\n- \"Whatever sophisticated planning has gone into curriculum design at Alan's school, the\ndistinction between a good class and a bad class, for his point of view, has a lot to do with\nthe freedom it offers to stand up and walk around\" (Jossey-Bass Reader p. 159).\n- Slower language development in boys: \"If you start teaching [reading] any earlier, it looks\nas if all your boys have reading disabilities\" (Jossey-Bass Reader p. 164).\n- Action figures: \"to be big instead of small, to have power in the world instead of the role of\npowerless child\" (Jossey-Bass Reader p. 161).\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nESSION 3: Course-Taking Patterns; Sex Education\neadings to complete before class:\n1) American Association of University Women. \"Course-Taking Patterns.\" Chapter 11 in The\nS\nR\n(\nJossey-Bass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San\nFrancisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in the AAUW-commissioned 1998 report, Gender Gaps: Where Schools\nStill Fail Our Children.)\n(2) Fine, Michelle. \"Sexuality, Schooling, and Adolescent Females.\" Chapter 17 in The Jossey-\nBass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San Francisco, CA:\nJossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in Fine and Lois Weis's 1993 book, Beyond Silenced Voices, and in the\nFebruary 1988 Harvard Educational Review.)\nDiscussion notes:\n(1) AAUW: Course-Taking Patterns\n- Number of math courses taken by girls and boys nearly equal now, but type/level not.\no Should states make higher-level math required for all students? (AAUW p. 294)\n- Have you heard of the issue of boys' underenrollment in language and arts classes before?\nHas it struck you as a \"problem\" like girls' underenrollment in physics?\n- Boys and girls are approximately equally represented in the social sciences and APs.\n- Remedial classes and tracking: Good or bad?\no Good for gifted, not for others?\no Is it helpful for slower students, or does it just hold them back?\no Is it the responsibility of the schools to provide for the extremes of the bell curve?\nThe state?\n- Girls identified more than boys in gifted programs in elementary school, but they drop out:\nwhy?\no Suggestions: Geek stereotypes, fitting in, etc.\n- \"U.S. culture often equates higher expenditure of effort with lower ability\" (AAUW p.\n291). What does this say about boys (who often assume/say their success is due to ability)\nand girls (who often assume/say their success is due to effort)? Does this stereotype ring\ntrue? Could girls' efforts be to compensate for lower ability, or perhaps to give the\nimpression of lower ability so as not to be \"too smart\"? (\"Oh, I just studied really hard for\nthat test; it's not that I'm a math genius\"--and thus geeky and unattractive.)\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n(2) Fine: Sex Education\n- \"Adolescent sexuality → victimization and danger\" theme.\n- \"Sex-negative attitudes do not discourage sexual activity, but they do discourage\nresponsible use of contraception. Teens who believe sexual involvement is wrong deny\nresponsibility for contraception. To accept responsibility would legitimate 'bad' behavior\"\n(Fine p. 377).\n- Personal experience: 9th grade \"Life Skills\" class video on rape had only female victims of\nmale aggressors depicted.\no What does this portrayal say to boys who don't/won't rape?\no What about male victims of rape? (More of 'em than you might think! Though\nstill much smaller than the number of female victims.)\n- Don't get into an argument about abstinence education: rather, focus on academic effects\n(pregnancy, drop outs...) if possible.\n- Surprising that most parents didn't object to sex ed in schools.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 4: Title IX\nReadings to complete before class:\n(1) Sandler, Bernice Resnick. \"Too Strong for a Woman: The Five Words that Created Title IX.\"\nChapter 1 in The Jossey-Bass Reader on Gender in Education. Edited by Jossey-Bass\nPublishers. San Francisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading, which was edited by the author for the Jossey-Bass Reader, was originally published in the April\n2000 issue of Equity & Excellence in Education. A version is available online, perhaps edited differently, at\nhttp://www.bernicesandler.com/id44.htm)\n(2) Title IX of the Education Amendments of 1972. 20 U.S.C. §1681-1688.\nhttp://www.dol.gov/oasam/regs/statutes/titleix.htm\n(3) Riley, Richards and Norma Cantu. \"Title IX: 25 Years of Progress.\" U.S. Department of\nEducation (June 1997). http://www.ed.gov/pubs/TitleIX/index.html\n(4) Toppo, Greg. \"New Rules Would Allow More Single-Sex Schools.\" USA TODAY (March\n3, 2004).\n\n(5) Irving, John. \"Wrestling with Title IX.\" New York Times (January 28, 2003).\nDiscussion notes:\n(1) Sandler: \"Too Strong for a Woman\"\n- Sandler described by the New York Times as \"the godmother of Title IX.\"\n- \"Nice girls aren't feminists\" theme.\n- \"She [Rep. Edith Green (OR)] informed us that it would be better it we did not lobby\nbecause there was no opposition to the bill, and the less that people knew about the bill, the\nbetter its chances were for passage. We were skeptical, but she was absolutely right\"\n(Jossey-Bass Reader p. 10).\n(2) Title IX itself\n- Clause (2): Good that they allow a grace period for schools changing to coed.\n- Clause (3): Religious objections: But can't religious schools then just do whatever they\nwant then? (In other situations, yes for some things and no for others - e.g. religious\nschools still have a minimum standard for secular subjects that they must teach to children,\nbut can focus on their religious beliefs like public schools cannot.)\nhttp://www.usatoday.com/news/education/2004-03-03-single-sex-schools-usat_x.htm\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n- Is legislation the way to change these issues? Is Title IX enough? What about\nenforcement?\n(3) U.S. Dept of Education: \"25 Years of Progress\"\n- Overall, great! But how can we tell what effects are due to Title IX and what are due to\ngeneral societal trends?\n(4) Toppo:\"Single-Sex Schools\"\n- More on this coming up in Session 6.\n(5) Irving: \"Wrestling with Title IX\"\n- Interesting note: Author is a well-known writer of various books, including The Cider\nHouse Rules (made into a 1999 Oscar-winning movie), that often deal with feminism.\n- A shame that most people know Title IX as a sports gender law and not a much broader\nand more powerful and important law.\no Maybe because there's a lot of money in sports, so this gets attention, whereas\nfewer people might care about the gender ratio of a science classroom\n- Personal anecdote: Brother at University of Pittsburgh, where there's enormously\nexpensive (and profitable) men's basketball and football teams. To \"balance\" the amount\nof money the school spends on them, they offer ridiculously specialized and obscure\nwomen's sports that no one really wants. (Similar to Arizona rowing team example.)\n- Could argue that women aren't as interested in sports as men because there aren't enough\nopportunities, encouragement, scholarships, prestige, etc. - which could be helped by\nkeeping the sports interpretation Title IX as is.\n- Or could argue that there's just a statistical fact: that boys like sports more than girls -\nmaybe because of biology, and maybe because of society, and maybe because of a mixture\nof the two - but the fact remains. Thus, spending should be divvied up accordingly.\no But then couldn't you make this argument about non-sports subjects, too? e.g.\n\"Girls just don't like computers as much as boys, so let's not care if they're\noutnumbered in computer science 3-1.\"\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 5: Standardized Tests\nReadings to complete before class:\n(1) Sadker, Myra and David Sadker. \"Designing Tests\" in \"Test Dive.\" Chapter 6 in Failing at\nFairness. New York, NY: Scribner, 1995. ISBN: 068480073X.\n(The section starts on page 131 and continues until page 156.)\n(2) The College Board Office of Research and Development. \"Research Summary: SAT and\nGender Differences.\" College Entrance Examination Board (February 1998).\nhttp://www.collegeboard.com/research/abstract/3874.html\n(3) Buck, Gary, Irene Koston, and Rick Morgan. \"Examining the Relationship of Content to\nGender-Based Performance Differences in Advanced Placement Exams.\" College Entrance\nExamination Board (2002). http://www.collegeboard.com/research/abstract/20703.html\n(Only read pp.1-3 (until the \"Method\" section), and p. 18 (\"Implications\"). The rest can be skimmed or skipped\n- it goes into far more detail than we'll need.)\n(4) Dittman, M. \"College Women Underperform on Tests When in the Minority.\" Monitor on\nPsychology 35, no. 1 (January 2004): 14. http://www.apa.org/monitor/jan04/college.html\nDiscussion notes:\n- For the CollegeBoard articles, notice distinctly different \"agendaization.\" However, in\n\"Examining the Relationship,\" note on opening information page: \"Researchers are\nencouraged to freely express their professional judgment. Therefore, points of view or\nopinions stated in College Board Reports do not necessarily represent official College\nBoard position or policy.\" Do you think that's truly the case? Why or why not?\n- SAT article. Very clear \"SATs are good\" message, almost defensive.\n- AP article: Obfuscated concepts with technical terminology. Timidly asked for more\nresearch. Felt like researchers wanted to do a good job but toed the line of their higher-ups.\n- Is it right to tailor questions to not be better for one group or another? Isn't life\nunavoidably different too?\n- Very amusing, the origin of SATs with Columbia!\n- \"ETS suggests that the lower female scores are not a sign of test unfairness but rather the\nsignal of a real educational problem. From the point of view of ETS, test critics are\nmisguided; they are attacking the messenger because they do not like the message\" (Sadker\np. 156).\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 6: Single-Sex Schooling\nReadings to complete before class:\n(1) Kaminar, Wendy. \"The Trouble with Same-Sex Schools.\" Atlantic Monthly (April 1998).\n(2) National Association of State Boards of Education. \"Single-Sex Schools.\" Policy Update 5,\nno. 15 (July-August 1997).\nhttp://www.nasbe.org/new_resources_section/policy_updates/PU_SingleSex_Schools_08.97.\npdf\n(3) Schemo, Diana Jean. \"Administration Proposes Same-Sex-School Option.\" New York Times\n(March 4, 2004).\nDiscussion notes:\n- Could \"separate but equal\" actually work for single-sex schooling?\no How would fairness be measured? Enforced?\n- How is single-sex schooling different / similar to separating kids by:\no\nRace? (e.g. Brown v. Board of Education, 1954.)\no Ability level? (e.g. Tracking, gifted and remedial programs.)\no Age? (e.g. Grade levels.)\no \"At-risk\" factors? (e.g. Programs for low-income, disruptive, or pregnant teens?)\n- Would your objections (if any) be alleviated or removed by single-sex schooling being an\noption - with a co-ed option always available? What problems might arise?\n- Do public single-sex schools or partial programs seem to you to be against the spirit and/or\nthe law of Title IX?\n- Why do you think single-sex schooling has become more popular recently? What other\nsocial trends might be contributing to renewed interest in single-sex schooling? Or is it just\nthat more thorough research is coming out?\n- Might same-sex schooling be better if emphasized at different points in children's lives?\n(e.g. Separate math classes in middle school, but together for high school?)\n- Anecdote from friend at an all-female college: \"I never see boys except as dates - they're\nnot friends or study partners, but have only romantic/sexual roles.\" Since men and women\nwork together in the workplace as adults, what issues might this feeling bring up?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 7: Classroom Dynamics\nReadings to complete before class:\n(1) Orenstein, Peggy. \"Learning Silence: Scenes from the Class Struggle.\" Chapter 1 in\nSchoolGirls: Young Girls, Self-Esteem, and the Confidence Gap. New York: Doubleday\n(1994). ISBN: 0385425759.\n(2) FAF chapter 3: \"Missing in Interaction.\"\nDiscussion notes:\n(1) Orenstein: \"Learning Silence\"\n- \"Amy walks to the far side of the room and, as she takes her seat, falls into a typically\nfeminine pose: she crosses her legs, folds her arms across her chest, and hunches forward\ntoward her desk, seeming to shrink into herself. The sauciness of the playground\ndisappears, and, in fact, she says hardly a word during class. Meanwhile, the boys,\nespecially those who are more physically mature, sprawl in their chairs, stretching their\nlegs long, expanding into the available space\" (p.7).\n- \"When the girls... do speak, they follow the rules... When Amy volunteers her sole answer\nof the period, she raises her hand, too. She gives the wrong answer to an easy\nmultiplication problem, turns crimson, and flips her head forward so her hair falls over her\nface. Occasionally, the girls shout out answers, but generally they are the easiest, lowest-\nrisk questions, such as the factors of four or six. And their stabs at public recognition\ndepend on the boys' largesse; when the girls venture responses to more complex questions\nthe boys quickly become territorial, shouting them down with their own answers... [The\nteacher] doesn't say anything to condone the boys' aggressiveness, but she doesn't have to:\nthey insist on--and receive--her attention even when she consciously tries to shift it\nelsewhere in order to make the class more equitable.\" (p. 9).\n- \"I don't raise my hand in my classes because I'm afraid I have the wrong answer and I'll\nbe embarrassed\" (p.11).\n- Classroom interactions as power struggles.\n(2) Failing at Fairness: \"Missing in Interaction\"\n- To preserve order, most teachers use established classroom conventions such as raising\nyour hand if you want to talk. Intellectually, teachers know they should apply this rule\nconsistently, but when the discussion becomes fast-paced and furious, the rule is often\nswept aside. When this happens and shouting out begins, it is an open invitation for male\ndominance. Our research shows that boys call out significantly more often than girls.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSometimes what they say has little or nothing to do with the teacher's questions. Whether\nmale comments are insightful or irrelevant, teachers respond to them. However, when girls\ncall out, there is a fascinating occurrence: Suddenly the teacher remembers the rule about\nraising your hand before you talk. And then the girl, who is usually not as assertive as the\nmale students, is deftly and swiftly put back in her place. Not being allowed to call out like\nher male classmates... will not psychologically scar [her]; however, the system of silencing\noperates covertly and repeatedly. It occurs several times a day during each school week for\ntwelve years, and even longer if [she] goes to college, and, most insidious of all, it happens\nsubliminally. This micro-inequity eventually has a powerful cumulative impact\" (Failing\nat Fairness pp. 43-44).\n- \"On the surface, girls appear to be doing well. They get better grades and receive fewer\npunishments than boys... Reinforced for passivity... As victims of benign neglect, girls are\npenalized for doing what they should\" (Failing at Fairness p. 44).\n- \"When we videotape classrooms and play back the tapes, most teachers are stunned to see\nthemselves teaching subtle gender lessons along with math and spelling.\" (Failing at\nFairness p. 46)\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 8: The Feminine Mystique\nReadings to complete before class:\n(1) Friedan, Betty. \"The Sex-Directed Educators.\" Chapter 7 in The Feminine Mystique. New\nYork: Norton (1963). ASIN: B000CBJK5I.\n(2) Friedan, Betty. \"The Sexual Sell.\" Chapter 9 in The Feminine Mystique.\nOptional:\n(3) Film. Mona Lisa Smile, Revolution Studios and Columbia Pictures (2003).\n(4) Kayes, Rebecca. \"Frowning at Mona Lisa Smile: An Alum Looks Back.\" Counterpoint: The\nMIT-Wellesley Journal of Campus Life 26, no. 1 (February 2004): 6-7.\n(5) Walsh, Diana Chapman. \"Message from the President to Wellesley College Alumnae\nConcerning the Film, Mona Lisa Smile.\" Wellesley College Office for Public Information\n(January 9, 2004).\nhttp://www.wellesley.edu/PublicAffairs/President/Announcements/monalisasmile.html\nDiscussion notes:\n- The Feminine Mystique was hugely influential in women's movement.\n- Inspired by a questionnaire Friedan (then a suburban housewife) sent to her classmates\nfrom the Smith 1942 class.\n-\n- Formalized \"The Problem that Has No Name:\" 1950s middle- and upper-class white\nwomen's restlessness with concerning themselves only with house and home and family,\noften after college educations, and being told they had achieved perfect happiness.\n-\n- \"The problem that has no name - which is simply the fact that American women are kept\nfrom growing to their full human capacities - is taking a far greater toll on the physical and\nmental health of our country than any known disease\" (Friedan).\n- Questions remain: What about lower-class women or women of color? Were men happy\nwith this situation? Did/can/should women truly fully embrace this domestic role? Men?\n- Opening paragraph:\n\"The problem lay buried, unspoken, for many years in the minds of American women. It was a strange\nstirring, a sense of dissatisfaction, a yearning that women suffered in the middle of the twentieth century in\nthe United States. Each suburban wife struggled with it alone. As she made the beds, shopped for groceries,\nmatched slipcover material, ate peanut butter sandwiches with her children, chauffeured Cub Scouts and\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nBrownies, lay beside her husband at night -- she was afraid to ask even of herself the silent question -- 'Is\nthis all?'\"\n- Friedan went on to help found the National Organization for Women, National Association\nfor the Repeal of Abortion Law, and National Women's Political Caucus.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 9: Women's Studies\nReadings to complete before class:\n(1) \"Men in Women's Studies Classes II.\" E-mail archive of WMST-L list (February 1999).\nhttp://research.umbc.edu/~korenman/wmst/Men1.html\n(2) Agozino, Biko. \"What Women's Studies Offer Men.\" West Africa Review 2, no. 1 (August\n2002). ISSN: 1525-4488. http://www.westafricareview.com/vol2.1/agozino.html\nDiscussion notes:\nStarting Class Activity\n(Idea from Sadker, Myra and David Sadker. \"Hidden Lessons.\" Chapter 1 in Failing at Fairness.\nNew York, NY: Scribner, 1995. ISBN: 068480073X.)\n- Take 3 minutes to write down as many famous men from American history as you can,\ntrying for at least twenty. No sports stars or entertainers, please.\n- Now take 3 minutes to write down as many famous women from American history as you\ncan, trying for at least twenty. Again, no sports stars or entertainers.\n- Is there a difference in the length of your two lists? In how hard it was to come up with\nnames? Did you manage to get more than twenty on either list? What does that tell you?\n(1) \"Men in Women's Studies Classes\" E-mails\n- Marc Sacks:\no \"Women's studies isn't really an academic discipline so much as an advocate for\nwomen's issues and a feminist perspective.\"\n- Irene Goldman-Price:\no Used to 1-3 boys in a class of 20-25.\no Now at school that gives diversity credit and now ratio is 16/40.\no \"The girls just haven't opened up the way they usually do.\"\n- Daphne Patai:\no \"Confusion between intellectual inquiry and proselytizing, the endorsement of\nbehavior that would never be tolerated in reverse, as if tit for tat were what\nfeminism is all about...\"\n- Corey Hale:\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\no As a Gender Studies major, I've never failed to feel offended at the extra attention\na lone male gets... I don't want my theories to be given credibility by the\npresence of a man within my discipline.\"\n(2) Agozino: \"What Women's Studies Offer Men\"\n- \"By asking what women's studies offer men, we imagine that women's studies are now\nchampioned by knights in shinning armor who are out to save the apparently lost men from\nthe web of their dominant hysterical gender ideology. The question is not what women's\nstudies can learn from men but what lessons men can learn by humbling themselves to\nlisten to women's perspectives.\"\n- Do men experience the same feelings of being \"left out\" or being the \"odd one out\" as\nwomen do in general classes that are male-dominated?\n- How is women's studies similar and different to African-American studies, Chinese\nstudies, economic/social class studies...?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 10: ESL Studies and the Cross-Cultural Issues\nReadings to complete before class:\n(1) Morris, Lori. \"Differences in Men's and Women's ESL Writing at the Junior College Level:\nConsequences for Research on Feedback.\" Canadian Modern Language Review 55, no. 2\n(December 1998). http://128.100.205.43/access/jour.ihtml?lp=product/cmlr/552/552-\nMorris.html\n(2) McGroarty, Mary. \"Cross-Cultural Issues in Adult ESL Classrooms.\" Center for Adult\nEnglish Language Acquisition Digests (July 1993).\nhttp://www.cal.org/caela/esl_resources/digests/cross_cultural.html\nDiscussion notes:\n(1) Morris: \"Dfferences in ESL Writing\"\n- This study shows that women tend to succeed because they are good at obeying rules. Why\ndoes that make them \"better\" at leaning languages and not, say, math - which relies even\nmore heavily on sets of rules than language does?\n(2) McGroaty:\"Cross-Cultural Issues in Adult ESL Classroom\"\n- How effective are classroom techniques in overcoming cultural gender inequalities?\n- How can teachers respect cultural differences while also ensuring that all the students\nreceive an equal education? (e.g. Sitting in circle, looking at wife.)\n- How is doing that different from trying to overcome American traditions of gender\ninequality?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 11: MIT's Journey Towards Diversity\nReadings to complete before class:\n(1) Jaimes, Joel J. \"Diversity at MIT: 1981 to Present.\" The Tech 123, no. 3 (February 11, 2003).\n\nhttp://www-tech.mit.edu/V123/N3/timeline.3f.html\n(2) Penfield, Paul. \"Faculty Diversity.\" MIT Faculty Newsletter 6, no. 3 (January/February\n1994): 1, 12-15. http://www-mtl.mit.edu/~penfield/pubs/diversity.html\n(3) MIT Committee on Women Faculty in the School of Science. \"A Study on the Status of\nWomen Faculty in Science at MIT.\" MIT Faculty Newsletter 11, no. 4 (March 1999).\nhttp://web.mit.edu/fnl/women/women.html\n(4) Waugh, Alice C. \"Policies Have Helped Boost Women Faculty.\" MIT Tech Talk (March 31,\n2004). http://web.mit.edu/newsoffice/2004/fac-diversity-0331.html\n(5) JBR chapter 26: \"Examining Women's Progress in the Sciences from the Perspective of\nDiversity\" (Clewell and Ginorio).\nDiscussion notes:\n- Have you personally seen or experienced gender discrimination at MIT?\n- MIT's report has huge influence outside the Institute, too: MIT really \"led the charge\" and\ninspired other universities to examine their own policies. Some criticism recently that\nMIT's efforts have not continued being pursued very vigorously.\n- \"How do these trends project into the future? To double the percentage of MIT women\nfaculty to 35 percent would take 31 years, and to bring it to 50 percent would take 60\nyears--assuming that current faculty size, number of hires per year, percentage of women\nhires and tenure rates remained unchanged, Hopkins said\" (Tech Talk article).\n- Why is gender (racial, economic, cultural...) diversity important, aside from ensuring that\nthose groups are included? What are the benefits to the \"overrepresented majority\"?\no \"A diverse faculty can carry out the mission of our department better than a\nnondiverse one\" (Penfield).\n- Affirmative action: a whole can of worms.\n- MIT undergraduate admissions office defense of why women have a higher acceptance\nrate than men (though since the number of male applicants is much larger, overall more\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nmen are admitted than women): the women applicants are more self-selecting, with only\nthe very best even applying.\n- \"First and foremost it is essential to set aside the issue of whether these women were badly\ntreated because they were simply not good enough. It must be understood that for these\nparticular women the opposite was undeniably true. Despite discrimination, most of these\nwomen achieved at an outstanding level within their professions... Only people above the\naverage MIT faculty could have succeeded at this level despite the many obstacles the\nsenior women faculty encountered in their careers. Indeed, it should be almost obvious that\nthe first women, the first blacks, the pioneers who break through despite enormous barriers\nmust be exceptional\" (Study on the Status).\n- \"Women are often the harshest critics of other women they deem less than better than most\nfaculty for fear that they will reflect badly on all women\" (Study on the Status).\n- How much of the responsibility for improving diversity is MIT's, and how much is\nsociety's?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 12: Opting Out\nReadings to complete before class:\n(1) Belkin, Lisa. \"The Opt-Out Revolution.\" New York Times (October 26, 2003).\n(2) Wallis, Cynthia. \"The Case for Staying at Home: Why More Young Moms Are Opting Out\nof the Rat Race.\" TIME (March 22, 1994).\nhttp://www.time.com/time/magazine/article/0,9171,993641,00.html\n(3) Boufis, Christina. \"Strange Bedfellows: Does Academic Life Lead to Divorce?\" Salon\n(March 24, 1999). http://www.salon.com/it/feature/1999/03/24feature.html\n(4) Hilborn, Robert C., Ruth H. Howes, Barbara L. Whitten, Suzanne R. Foster, and Margaret L.\nDuncombe. \"What Works for Women in Undergrad Physics?\" Physics Today 56, no. 9\n(September 2003): 46. http://www.aip.org/pt/vol-56/iss-9/p46.html\nDiscussion notes:\n(1) Belkin, \"The Opt-Out Revolution\" & (2) Wallis, \"The Case for Staying at Home\"\n- How wide-spread are these phenomena?\n- Profiles mainly of white, upper-middle-class, highly educated women.\n- An important cultural clue for other groups, though.\n- Work isn't about \"self-fulfillment\" for everyone - most working women don't have the\nchoice to stay home with their kids because their families need the income.\n- Sad for men that they don't often feel they have the same \"opt out\" choices as women.\n- Why is the media so enchanted with this issue?\n- Do these articles confirm traditional ideas/fears? Progressive? Feminist?\n- How realistic is the \"detour\" career option? (Education, good start to career, pause for a\nfew years for little kids, resume at same level when kids are in school.) Not much data\nyet...\n(3) Boufis, \"Does Academic Life Lead to Divorce?\"\n- Anecdotes of many MIT female professors single or divorced, with no or few children,\nfertility problems post-tenure.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n- Efforts by MIT and other institutions to alleviate tenure pressure on new mothers (and\nsometimes new fathers), especially to make tenure extensions automatic and not require a\nrequest (which may depend on the whims of an advisor or a woman's worry over looking\n\"weak\" or \"not dedicated\").\n- Frenetic tenure questing bad for men too, not just women, of course!\n- Different biological clock for men and women. Tenure track years = women's fertile years.\n(4) Robert, et al, \"What Works for Women in Undergrad Physics?\"\n- Physics problems not just for girls: low retention of female students (and faculty as they\nadvance forward) indicates problems for everyone.\n- Lack of mentoring: a vicious cycle.\n- Leaky pipeline: conflicting reports.\n- Astronomy generally much better than physics on gender ratio. Possible explanation:\nastronomy much more of a solitary pursuit, without downsides of heavily-male group lab\nenvironments.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 13: Gay, Lesbian, Bisexual, and Transgendered Experiences\nReadings to complete before class:\n(1) Steward, Doug. \"Working Towards Equality.\" Academe 89, no. 4 (July-August 2003).\nhttp://www.aaup.org/publications/Academe/2003/03ja/03jastew.htm\n(2) Feltey, Katherine M. \"Living Outside the Center.\" Chapter 6 in Lesbians in Academia:\nDegrees of Freedom. Edited by Beth Mintz and Esther Rothblum. New York, NY: Rothblum\n(1997). ISBN: 0415917026.\n(3) Anonymous. \"My, How Times Have Changed... Or Have They? A Quarter Century as a\nLesbian Academic.\" Chapter 29 in Lesbians in Academia: Degrees of Freedom. Edited by\nBeth Mintz and Esther Rothblum. New York, NY: Rothblum (1997). ISBN: 0415917026.\n(4) Bernstein, Fred. \"On Campus, Rethinking Bio 101.\" New York Times (March 7, 2004).\nDiscussion notes:\n- Sex vs. gender\no Sex = biological sex, based on physical features.\no Gender = social role and identity (affects clothing, speech patterns, encouraged\ncareer goals, etc.).\no Big question in cultural studies of how much of gender is determined by sex\nand/or by society's conventions.\no Both terms are used independently of sexual orientation (who a person is\nromantically/sexually attracted to).\n- Because of their relative seclusion from the outside world, university settings can be\nexcellent - or terrible - in terms of environment for GLBTs.\n- Differently-gendered living arrangements\no Pros and cons of same-sex roommates, floors, dorms, schools.\no What about more \"traditional\" requests? \"Yale Five\" - Orthodox Jewish students\nat Yale sued the university for requiring them to live in co-ed dormitories (or, as it\nhappened in practice, to pay for the dorms while actually living at home) which\nthe students felt was against their religion's teachings on moral living. Suit\ndismissed by courts because \"the plaintiffs could have opted to attend a different\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\ncollege or university if they were not satisfied with Yale's housing policy.\" How\nis this similar or dissimilar to GLBT accommodation requests?\n- Should students at single-sex colleges be allowed to continue to be enrolled if during\ncollege they change to identifying (either personally or biologically) as a member of the\nopposite sex?\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 14: Summary and Conclusions\nReadings to complete before class:\nNo readings for this class. Enjoy studying for final exams!\nDiscussion notes:\n- What about the topics we've discussed has interested you most? Surprised you most?\nConfused you most? Changed you most?\n- What would you have done differently in this class?\n- What next?\no There's plenty more to read and discuss about all of the topics we covered.\no Many more topics, too! As possible starting points for future explorations, here\nare some subjects that can relate to gender in education that we didn't explore in\nmuch detail:\nLearning disabilities\nSexual harassment\nBullying\nTechnology in education\nBiological differences between the sexes\nMore examples of non-U.S. cultures\nWomen's political movements\nPhysical education\nEconomic/social class\nThe media's role\nTeaching styles of male and female teachers\nReligious influences\nWork environments outside of academia\no Keep reading the newspaper: these topics show up frequently. Keep yourself up-\nto-date on current developments. These issues affect you and the world we live in.\n- Thanks for a really fun semester!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction; History of Gender in Education",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/4958449222b4b18db1ca5a69242c53b9_MITES_242S04_ses1.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 1: History of Gender in Education\nReadings to complete before class:\n(1) Sadker, Myra and David Sadker. \"Through the Back Door: A History of Women's\nEducation.\" Chapter 2 in Failing at Fairness. New York, NY: Scribner, 1995. ISBN:\n068480073X.\n(2) American Association of University Women. \"How Girls Negotiate School.\" Chapter 10 in\nThe Jossey-Bass Reader on Gender in Education. Edited by Jossey-Bass Publishers. San\nFrancisco, CA: Jossey-Bass, 2002. ISBN: 0787960748.\n(This reading was originally published in the AAUW-commissioned 1996 report, Girls in the Middle: Working\nto Succeed in School.)\nDiscussion notes:\n(1) Failing at Fairness: \"History of Women's Education\"\n- Quite surprising in many ways\no Describes many now-laughable theories on women's abilities (e.g. algebra vs.\novaries, phrenology).\no Interesting that now \"laughable\" - we don't find things like \"women's careers\" or\n\"home-ec\" laughable at all (though perhaps could feel it misguided or offensive).\n- Changes both slow and fast\no Hundreds of years till girls could even go to school or receive any education at all.\no But then, \"mere\" decades till gender equality more-or-less recognized as a Good\nThing to be striving for.\n- \"Professionalized motherhood\" (p. 19) similar to description of the 1950s in Betty\nFriedan's The Feminine Mystique (to be explored more deeply in Session 8).\n- Reagan-era backlash particularly shocking - the late '70s and '80s were recent.\n(2) AAUW: \"How Girls Negotiate Schools\"\n- AAUW = American Association of University Women, founded 1881 (as the Association\nof Collegiate Alumnae). Funds lots of influential research on girls and women in\neducational settings (both pre- and post-university levels). Also has funds female graduate\nstudent stipends and holds national conferences on women in education.\nhttp://www.aauw.org\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n- Did you recognize the social cues and norms from your own experience? (Does answer\ndiffer depending on gender of student?)\n- Big emphasis on role models\no Really seemed to be a make-or-break factor.\no What does this mean for areas without lots of female (or male!) role models? For\nexample, physics today or medicine in the past for women, full-time homemaking\nor nursing for men.\no Note over 50% of medical school students are female; less than 5% of nurses are\nmale.\no Keep in mind that there's often a big difference between the percentage of a\nprofessional school class being a certain gender and the percentage of a profession\nbeing a certain gender. Practicing professionals went to school years ago, when\nthe percentages were often different (usually reflecting traditional gender roles).\nBrings up \"leaky-pipeline\" issue too.\n- Did you have any difficulties relating to Angela? Why?\n- The \"schoolgirls\" studied were mostly white - would there be different conclusions for\nother racial groups? What would you expect the differences to be?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT's Journey Towards Diversity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/841b984f8af3d2041da1a3c613b92c5d_MITES_242S04_ses11.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 11: MIT's Journey Towards Diversity\nReadings to complete before class:\n(1) Jaimes, Joel J. \"Diversity at MIT: 1981 to Present.\" The Tech 123, no. 3 (February 11, 2003).\nhttp://www-tech.m\nit.edu/V123/N3/timeline.3f.html\n(2) Penfield, Paul. \"Faculty Diversity.\" MIT Faculty Newsletter 6, no. 3 (January/February\n1994): 1, 12-15. http://www-mtl.mit.edu/~penfield/pubs/diversity.html\n(3) MIT Committee on Women Faculty in the School of Science. \"A Study on the Status of\nWomen Faculty in Science at MIT.\" MIT Faculty Newsletter 11, no. 4 (March 1999).\nhttp://web.mit.edu/fnl/women/women.html\n(4) Waugh, Alice C. \"Policies Have Helped Boost Women Faculty.\" MIT Tech Talk (March 31,\n2004). http://web.mit.edu/newsoffice/2004/fac-diversity-0331.html\n(5) JBR chapter 26: \"Examining Women's Progress in the Sciences from the Perspective of\nDiversity\" (Clewell and Ginorio).\nDiscussion notes:\n- Have you personally seen or experienced gender discrimination at MIT?\n- MIT's report has huge influence outside the Institute, too: MIT really \"led the charge\" and\ninspired other universities to examine their own policies. Some criticism recently that\nMIT's efforts have not continued being pursued very vigorously.\n- \"How do these trends project into the future? To double the percentage of MIT women\nfaculty to 35 percent would take 31 years, and to bring it to 50 percent would take 60\nyears--assuming that current faculty size, number of hires per year, percentage of women\nhires and tenure rates remained unchanged, Hopkins said\" (Tech Talk article).\n- Why is gender (racial, economic, cultural...) diversity important, aside from ensuring that\nthose groups are included? What are the benefits to the \"overrepresented majority\"?\no \"A diverse faculty can carry out the mission of our department better than a\nnondiverse one\" (Penfield).\n- Affirmative action: a whole can of worms.\n- MIT undergraduate admissions office defense of why women have a higher acceptance\nrate than men (though since the number of male applicants is much larger, overall more\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nmen are admitted than women): the women applicants are more self-selecting, with only\nthe very best even applying.\n- \"First and foremost it is essential to set aside the issue of whether these women were badly\ntreated because they were simply not good enough. It must be understood that for these\nparticular women the opposite was undeniably true. Despite discrimination, most of these\nwomen achieved at an outstanding level within their professions... Only people above the\naverage MIT faculty could have succeeded at this level despite the many obstacles the\nsenior women faculty encountered in their careers. Indeed, it should be almost obvious that\nthe first women, the first blacks, the pioneers who break through despite enormous barriers\nmust be exceptional\" (Study on the Status).\n- \"Women are often the harshest critics of other women they deem less than better than most\nfaculty for fear that they will reflect badly on all women\" (Study on the Status).\n- How much of the responsibility for improving diversity is MIT's, and how much is\nsociety's?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Opting Out",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/5742cd51fe42b9ef99d499a2893db91d_MITES_242S04_ses12.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 12: Opting Out\nReadings to complete before class:\n(1) Belkin, Lisa. \"The Opt-Out Revolution.\" New York Times (October 26, 2003).\n(2) Wallis, Cynthia. \"The Case for Staying at Home: Why More Young Moms Are Opting Out\nof the Rat Race.\" TIME (March 22, 1994).\nhttp://www.time.com/time/magazine/article/0,9171,993641,00.html\n(3) Boufis, Christina. \"Strange Bedfellows: Does Academic Life Lead to Divorce?\" Salon\n(March 24, 1999). http://www.salon.com/it/feature/1999/03/24feature.html\n(4) Hilborn, Robert C., Ruth H. Howes, Barbara L. Whitten, Suzanne R. Foster, and Margaret L.\nDuncombe. \"What Works for Women in Undergrad Physics?\" Physics Today 56, no. 9\n(September 2003): 46. http://www.aip.org/pt/vol-56/iss-9/p46.html\nDiscussion notes:\n(1) Belkin, \"The Opt-Out Revolution\" & (2) Wallis, \"The Case for Staying at Home\"\n- How wide-spread are these phenomena?\n- Profiles mainly of white, upper-middle-class, highly educated women.\n- An important cultural clue for other groups, though.\n- Work isn't about \"self-fulfillment\" for everyone - most working women don't have the\nchoice to stay home with their kids because their families need the income.\n- Sad for men that they don't often feel they have the same \"opt out\" choices as women.\n- Why is the media so enchanted with this issue?\n- Do these articles confirm traditional ideas/fears? Progressive? Feminist?\n- How realistic is the \"detour\" career option? (Education, good start to career, pause for a\nfew years for little kids, resume at same level when kids are in school.) Not much data\nyet...\n(3) Boufis, \"Does Academic Life Lead to Divorce?\"\n- Anecdotes of many MIT female professors single or divorced, with no or few children,\nfertility problems post-tenure.\n\nMIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\n- Efforts by MIT and other institutions to alleviate tenure pressure on new mothers (and\nsometimes new fathers), especially to make tenure extensions automatic and not require a\nrequest (which may depend on the whims of an advisor or a woman's worry over looking\n\"weak\" or \"not dedicated\").\n- Frenetic tenure questing bad for men too, not just women, of course!\n- Different biological clock for men and women. Tenure track years = women's fertile years.\n(4) Robert, et al, \"What Works for Women in Undergrad Physics?\"\n- Physics problems not just for girls: low retention of female students (and faculty as they\nadvance forward) indicates problems for everyone.\n- Lack of mentoring: a vicious cycle.\n- Leaky pipeline: conflicting reports.\n- Astronomy generally much better than physics on gender ratio. Possible explanation:\nastronomy much more of a solitary pursuit, without downsides of heavily-male group lab\nenvironments.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Single-Sex Schooling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-242-gender-issues-in-academics-and-academia-spring-2004/6a9d409488f318e5ae373f3ba6b98bcb_MITES_242S04_ses6.pdf",
      "content": "MIT ES.242 \"Gender Issues in Academics and Academia\" (Spring 2004) - Laurel Ruhlen & Kayla Jacobs\nSESSION 6: Single-Sex Schooling\nReadings to complete before class:\n(1) Kaminar, Wendy. \"The Trouble with Same-Sex Schools.\" Atlantic Monthly (April 1998).\n(2) National Association of State Boards of Education. \"Single-Sex Schools.\" Policy Update 5,\nno. 15 (July-August 1997).\nhttp://www.nasbe.org/new_resources_section/policy_updates/PU_SingleSex_Schools_08.97.\npdf\n(3) Schemo, Diana Jean. \"Administration Proposes Same-Sex-School Option.\" New York Times\n(March 4, 2004).\nDiscussion notes:\n- Could \"separate but equal\" actually work for single-sex schooling?\no How would fairness be measured? Enforced?\n- How is single-sex schooling different / similar to separating kids by:\no\nRace? (e.g. Brown v. Board of Education, 1954.)\no Ability level? (e.g. Tracking, gifted and remedial programs.)\no Age? (e.g. Grade levels.)\no \"At-risk\" factors? (e.g. Programs for low-income, disruptive, or pregnant teens?)\n- Would your objections (if any) be alleviated or removed by single-sex schooling being an\noption - with a co-ed option always available? What problems might arise?\n- Do public single-sex schools or partial programs seem to you to be against the spirit and/or\nthe law of Title IX?\n- Why do you think single-sex schooling has become more popular recently? What other\nsocial trends might be contributing to renewed interest in single-sex schooling? Or is it just\nthat more thorough research is coming out?\n- Might same-sex schooling be better if emphasized at different points in children's lives?\n(e.g. Separate math classes in middle school, but together for high school?)\n- Anecdote from friend at an all-female college: \"I never see boys except as dates - they're\nnot friends or study partners, but have only romantic/sexual roles.\" Since men and women\nwork together in the workplace as adults, what issues might this feeling bring up?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.242 Gender Issues in Academics and Academia\nSpring 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}